{"id":66194,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eHISTORY OF THERAPY\u003c/p\u003e\n\u003cp\u003eOF PSYCHOMOTOR EPILEPSY\u003c/p\u003e\n\u003cp\u003e1864 Morel, Fairet, and other French neurologists describe some elements of psychomotor epilepsy.\u003c/p\u003e\n\u003cp\u003e1888 Hughlings Jackson (Great Britain) provides the classic description of psychomotor epilepsy and its preceding aura.\u003c/p\u003e\n\u003cp\u003e1898 Jackson and Colman (Great Britain) localize the disorder to the temporal lobe of the brain.\u003c/p\u003e\n\u003cp\u003e1908 Horsley and Clarke (Great Britain) describe stereotaxic surgical techniques for use on animals.\u003c/p\u003e\n\u003cp\u003e1941 Jasper and Kershman (U.S.A. and Canada) show that the electroencephalogram of patients with psychomotor epilepsy is characterized by discharges from the temporal lobe.\u003c/p\u003e\n\u003cp\u003e1947 Spiegel and co-workers (U.S.A.) report the first stereotaxic surgery performed on a human being.\u003c/p\u003e\n\u003cp\u003e1950 Penfield and Flanagan (Canada) perform ablative surgery for psychomotor epilepsy, with good results.\u003c/p\u003e\n\u003cp\u003e1953 Heath and co-workers (U.S.A.) perform stereotaxic implantation of depth electrodes.\u003c/p\u003e\n\u003cp\u003e1958 Talairach and co-workers (France) begin chronic stereotaxic implantation of depth electrodes.\u003c/p\u003e\n\u003cp\u003e1963 Heath and co-workers (U.S.A.) allow patients to stimulate themselves, at will, via implanted electrodes.\u003c/p\u003e\n\u003cp\u003e1965 Narabayashi (Japan) reports on 98 patients with violent behavior treated by stereotaxic surgery.\u003c/p\u003e\n\u003cp\u003e1965 More than 24,000 stereotaxic procedures on human beings have been performed in various countries by this date.\u003c/p\u003e\n\u003cp\u003e1968 Delgado and co-workers (U.S.A.) attach \"stimoceiver\" (radio stimulator plus radio receiver) to freely ambulatory hospital patients with psychomotor epilepsy.\u003c/p\u003e\n\u003cp\u003e1969 Chimpanzee at Alamogordo, N.M., is directly linked by radio to a computer which programs and delivers his brain stimulations.\u003c/p\u003e\n\u003cp\u003e1971 Patient Harold Benson is operated on in Los Angeles.\u003c/p\u003e\n\u003cp\u003eM.C.\u003c/p\u003e\n\u003cp\u003eLos Angeles\u003c/p\u003e\n\u003cp\u003eOctober 23, 1971\u003c/p\u003e\n\u003cp\u003e\"I have come to the conclusion that my subjective account of my own motivation\u003c/p\u003e\n\u003cp\u003eis largely mythical on almost all occasions. I don\u0027t know why I do things.\"\u003c/p\u003e\n\u003cp\u003eJ. B. S. Haldane\u003c/p\u003e\n\u003cp\u003e\"The wilderness masters the colonist.\"\u003c/p\u003e\n\u003cp\u003eFrederick Jackson Turner\u003c/p\u003e\n\u003cp\u003eChapter 1\u003c/p\u003e\n\u003cp\u003eTuesday, March 9, 1971: Asmission\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eThey came down to the emergency ward at noon and sat on the bench just behind the swinging doors that led in from the ambulance parking slot. Ellis was nervous, preoccupied, distant. Morris was relaxed, eating a candy bar and crumpling the wrapper into the pocket of his white jacket.\u003c/p\u003e\n\u003cp\u003eFrom where they sat, they could look at the sunlight outside, falling across the big sign that said EMERGENCY WARD and the smaller sign that said NO PARKING AMBULANCES ONLY. In the distance they heard sirens.\u003c/p\u003e\n\u003cp\u003e\"Is that him?\" Morris asked.\u003c/p\u003e\n\u003cp\u003eEllis checked his watch. \"I doubt it. It\u0027s too early.\" They sat on the bench and listened to the sirens come closer. Ellis removed his glasses and wiped them with his tie. One of the emergency ward nurses, a girl Morris did not know by name, came over and said brightly, \"Is this the welcoming committee?\"\u003c/p\u003e\n\u003cp\u003eEllis squinted at her. Morris said, \"We\u0027ll be taking him straight through. Do you have his chart down here?\"\u003c/p\u003e\n\u003cp\u003eThe nurse said, \"Yes, I think so, Doctor,\" and walked off looking irritated.\u003c/p\u003e\n\u003cp\u003eEllis sighed. He replaced his glasses and frowned at the nurse.\u003c/p\u003e\n\u003cp\u003eMorris said, \"She didn\u0027t mean anything.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose the whole damned hospital knows,\" Ellis said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a pretty big secret to keep.\"\u003c/p\u003e\n\u003cp\u003eThe sirens were very close now; through the windows they saw an ambulance back into the slot. Two orderlies opened the door and pulled out the stretcher. A frail elderly woman lay on the stretcher, gasping for breath, making wet gurgling sounds. Severe pulmonary edema, Morris thought as he watched her taken into one of the treatment rooms.\u003c/p\u003e\n\u003cp\u003e\"I hope he\u0027s in good shape,\" Ellis said.\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Benson.\"\u003c/p\u003e\n\u003cp\u003e\"Why shouldn\u0027t he be?\"\u003c/p\u003e\n\u003cp\u003e\"They might have roughed him up.\" Ellis stared morosely out the windows. He really is in a bad mood; Morris thought. He knew that meant Ellis was excited; he had scrubbed in on enough cases with Ellis to recognize the pattern.\u003c/p\u003e\n\u003cp\u003eIrascibility under pressure while he waited - and then total, almost lazy calm when the operation began. \"Where the hell is he?\" Ellis said, looking at his watch again.\u003c/p\u003e\n\u003cp\u003eTo change the subject, Morris said, \"Are we all set for three-thirty?\" At 3:30 that afternoon, Benson would be presented to the hospital staff at a special Neurosurgical Rounds.\u003c/p\u003e\n\u003cp\u003e\"As far as I know,\" Ellis said. \"Ross is making the presentation. I just hope Benson\u0027s in good shape.\"\u003c/p\u003e\n\u003cp\u003eOver the loudspeaker, a soft voice said, \"Dr. Ellis, Dr. John Ellis, two-two-three-four. Dr. Ellis, two-two-three-four.\"\u003c/p\u003e\n\u003cp\u003eEllis got up to answer the page. \"Hell,\" he said.\u003c/p\u003e\n\u003cp\u003eMorris knew what he meant. Two-two-three-four was the extension for the animal laboratories. The call probably meant something had gone wrong with the monkeys. Ellis had been doing three monkeys a week for the past month, just to keep himself and his staff ready.\u003c/p\u003e\n\u003cp\u003eHe watched as Ellis crossed the room and answered from a wall phone. Ellis walked with a slight limp, the result of a childhood injury that had cut the common peroneal nerve in his right leg. Morris always wondered if the injury had had something to do with Ellis\u0027s later decision to become a neurosurgeon. Certainly Ellis had the attitude of a man determined to correct defects, to fix things up. That was what he always said to his patients: \"We can fix you up.\" And he seemed to have more than his share of defects himself - the limp, the premature near-baldness, the weak eyes, and the heavy thick glasses. It produced a vulnerability about him that made his irascibility more tolerable.\u003c/p\u003e\n\u003cp\u003eOr perhaps the irascibility was the result of all those years as a surgeon. Morris wasn\u0027t sure; he hadn\u0027t been a surgeon long enough. He stared out the window at the sunlight and the parking lot. Afternoon visiting hours were beginning; relatives were driving into the parking lot, getting out of their cars, glancing up at the high buildings of the hospital. The apprehension was clear in their faces; the hospital was a place people feared.\u003c/p\u003e\n\u003cp\u003eMorris noticed how many of them had sun tans. It had been a warm, sunny spring in Los Angeles, yet he was still as pale as the white jacket and trousers he wore every day. He had to get outside more often, he told himself. He should start eating lunch outside. He played tennis, of course, but that was usually in the evenings.\u003c/p\u003e\n\u003cp\u003eEllis came back. \"Shit,\" he said. \"Ethel tore out her sutures.\"\u003c/p\u003e\n\u003cp\u003e\"How did it happen?\" Ethel was a juvenile rhesus monkey who had undergone brain surgery the day before. The operation had proceeded flawlessly. And Ethel was unusually docile, as rhesus monkeys went.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Ellis said. \"Apparently she worked an arm loose from her restraints. Anyway, she\u0027s shrieking and the bone\u0027s exposed on one side.\u003c/p\u003e\n\u003cp\u003e\"Did she tear out her wires?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. But I\u0027ve got to go down and resew her now. Can you handle this?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"Are you all right with the cops?\" Ellis said. \"I don\u0027t think they\u0027ll give you any trouble.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Just get Benson up to seven as fast as you can,\" Ellis said. \"Then call Ross. I\u0027ll be up as soon as possible.\" He checked his watch. \"It\u0027ll probably take forty minutes to resew Ethel, if she behaves herself.\"\u003c/p\u003e\n\u003cp\u003e\"Good luck with her,\" Morris said, and smiled.\u003c/p\u003e\n\u003cp\u003eEllis looked sour and walked away.\u003c/p\u003e\n\u003cp\u003eAfter he had gone, the emergency ward nurse came back.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter with him?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Just edgy,\" Morris said.\u003c/p\u003e\n\u003cp\u003e\"He sure is,\" the nurse said. She paused and looked out the window, lingering.\u003c/p\u003e\n\u003cp\u003eMorris watched her with a kind of bemused detachment. He\u0027d spent enough years in the hospital to recognize the subtle signs of status. He had begun as an intern, with no status at all. Most of the nurses knew more medicine than he did, and if they were tired they didn\u0027t bother to conceal it. (\"I don\u0027t think you want to do that, Doctor.\") As the years went by, he became a surgical resident, and the nurses became more deferential. When he was a senior resident, he was sufficiently assured in his work that a few of the nurses called him by his first name. And finally, when he transferred to the Neuropsychiatric Research Unit as a junior staff member, the formality returned as a new mark of status.\u003c/p\u003e\n\u003cp\u003eBut this was something else: a nurse hanging around, just being near him, because he had a special aura of importance. Because everyone in the hospital knew what was going to happen.\u003c/p\u003e\n\u003cp\u003eStaring out the window, the nurse said, \"Here he comes.\" Morris got up and looked out. A blue police van drove up toward the emergency ward, and turned around, backing into the ambulance slot. \"All right,\" he said. \"Notify the seventh floor, and tell them we\u0027re on our way.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Doctor.\"\u003c/p\u003e\n\u003cp\u003eThe nurse went off. Two ambulance orderlies opened the hospital doors. They knew nothing about Benson. One of them said to Morris, \"You expecting this one?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"EW case?\"\u003c/p\u003e\n\u003cp\u003e\"No, a direct admission.\"\u003c/p\u003e\n\u003cp\u003eThe orderlies nodded, and watched as the police officer driving the van came around and unlocked the rear door. Two officers seated in the back emerged, blinking in the sunlight. Then Benson came out.\u003c/p\u003e\n\u003cp\u003eAs always, Morris was struck by his appearance. Benson was a meek, pudgy, thirty-four-yearold man, with a sort of permanently bewildered air about him. He stood by the van, with his wrists handcuffed in front of him, and looked around. When he saw Morris, he said, \"Hello,\" and then looked away, embarrassed.\u003c/p\u003e\n\u003cp\u003eOne of the cops said, \"You in charge here?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027m Dr. Morris.\"\u003c/p\u003e\n\u003cp\u003eThe cop gestured toward the interior of the hospital.\u003c/p\u003e\n\u003cp\u003e\"Lead the way, Doctor.\"\u003c/p\u003e\n\u003cp\u003eMorris said, \"Would you mind taking off his handcuffs?\"\u003c/p\u003e\n\u003cp\u003eBenson\u0027s eyes flicked up at Morris, then back down.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have any orders about that.\" The cops exchanged glances. \"I guess it\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eWhile they took the cuffs off, the driver brought Morris a form on a clipboard: \"Transfer of Suspect to Institutional Care (Medical).\" He signed it.\u003c/p\u003e\n\u003cp\u003e\"And again here,\" the driver said.\u003c/p\u003e\n\u003cp\u003eAs Morris signed again, he looked at Benson. Benson stood quietly, rubbing his wrists, staring straight ahead. The impersonality of the transaction, the forms and signatures, made Morris feel as if he were receiving a package from United Parcel. He wondered if Benson felt like a package.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" the driver said. \"Thanks, Doc.\"\u003c/p\u003e\n\u003cp\u003eMorris led the other two policemen and Benson into the hospital. The orderlies shut the doors. A nurse came up with a wheelchair and Benson sat down in it. The cops looked confused.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hospital policy,\" Morris said.\u003c/p\u003e\n\u003cp\u003eThey all went to the elevators.\u003c/p\u003e\n\u003cp\u003eThe elevator stopped at the lobby. A half-dozen relatives were waiting to go up to the higher floors, but they hesitated when they saw Morris, Benson in the wheelchair, and the two cops. \"Please take the next car,\" Morris said smoothly. The doors closed. They continued up.\u003c/p\u003e\n\u003cp\u003e\"Where is Dr. Ellis?\" Benson asked. \"I thought he was going to be here.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in surgery. He\u0027ll be up shortly.\"\u003c/p\u003e\n\u003cp\u003e\"And Dr. Ross?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll see her at the presentation.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes.\" Benson smiled. \"The presentation.\"\u003c/p\u003e\n\u003cp\u003eThe cops exchanged suspicious looks, but said nothing. The elevator arrived at the seventh floor, and they all got out.\u003c/p\u003e\n\u003cp\u003eSeven was the Special Surgical floor, where difficult and complex cases were treated. It was essentially a research floor. The most severe cardiac, kidney, and metabolic patients recuperated here. They went down to the nurses\u0027 station, a glass-walled area strategically located at the center of the X-shaped floor.\u003c/p\u003e\n\u003cp\u003eThe nurse on duty at the station looked up. She was surprised to see the cops, but she said nothing. Morris said,\u003c/p\u003e\n\u003cp\u003e\"This is Mr. Benson. Have we got seven-ten ready?\"\u003c/p\u003e\n\u003cp\u003e\"All set for him,\" the nurse said, and gave Benson a cheery smile. Benson smiled bleakly back, and glanced from the nurse to the computer console in the corner of the nursing station.\u003c/p\u003e\n\u003cp\u003e\"You have a time-sharing station up here?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Morris said.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the main computer?\"\u003c/p\u003e\n\u003cp\u003e\"In the basement.\"\u003c/p\u003e\n\u003cp\u003e\"Of this building?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. It draws a lot of power, and the power lines come to this building.\"\u003c/p\u003e\n\u003cp\u003eBenson nodded. Morris was not surprised at the questions. Benson was trying to distract himself from the thought of surgery, and he was, after all, a computer expert.\u003c/p\u003e\n\u003cp\u003eThe nurse handed Morris the chart on Benson. It had the usual blue plastic cover with the seal of University Hospital. But there was also a red tag, which meant neurosurgery, and a yellow tag, which meant intensive care, and a white tag, which Morris had almost never seen on a patient\u0027s chart. The white tag meant security precautions.\u003c/p\u003e\n\u003cp\u003e\"Is that my record?\" Benson asked as Morris wheeled him down the hall to 710. The cops followed along behind.\u003c/p\u003e\n\u003cp\u003e\"Uh-huh.\"\u003c/p\u003e\n\u003cp\u003e\"I always wondered what was in it.\"\u003c/p\u003e\n\u003cp\u003e\"Lot of unreadable notes, mostly.\" Actually, Benson\u0027s chart was thick and very readable, with all the computer print-outs of different tests.\u003c/p\u003e\n\u003cp\u003eThey came to 710. Before they entered the room, one of the cops went in and closed the door behind him. The second cop remained outside the door. \"Just a precaution,\" he said.\u003c/p\u003e\n\u003cp\u003eBenson glanced up at Morris. \"They\u0027re very careful about me,\" he said. \"It\u0027s almost flattering.\"\u003c/p\u003e\n\u003cp\u003eThe first cop came out. \"It\u0027s okay,\" he said.\u003c/p\u003e\n\u003cp\u003eMorris wheeled Benson into the room. It was a large room, on the south side of the hospital, so that it was sunny in the afternoon. Benson looked around and nodded approvingly. Morris said, \"This is one of the best rooms in the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"Can I get up now?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eBenson got out of the wheelchair and sat on the bed. He bounced on the mattress. He pressed the buttons that made the bed move up and down, then bent over to look at the motorized mechanism beneath the bed. Morris went to the window and drew the blinds, reducing the direct light. \"Simple,\" Benson said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-terminal-man/page-1.html","bookId":1705,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
