{"id":66209,"no":16,"title":"Page 16","content":"\u003cp\u003e\"Surely computers are- \"\u003c/p\u003e\n\u003cp\u003e\"Please let me finish. Trend number two is the autonomy of the computer. In the old days, computers weren\u0027t autonomous. They were like adding machines; you had to be there all the time, punching buttons, to make them work. Like cars: cars won\u0027t drive without drivers. But now things are different.\u003c/p\u003e\n\u003cp\u003eComputers are becoming autonomous. You can build in all sorts of instructions about what to do next - and you can walk away and let the computer handle things.\"\u003c/p\u003e\n\u003cp\u003e\"Harry, I- \"\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t interrupt me. This is very serious. Trend number three is miniaturization. You know all about that. A computer that took up a whole room in 1950 is now about the size of a carton of cigarettes. Pretty soon it\u0027ll be smaller than that.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause on the tape.\u003c/p\u003e\n\u003cp\u003e\"Trend number four- \" Benson began, and she clicked the tape off. She looked at Ellis and Morris. \"This isn\u0027t getting us anywhere,\" she said.\u003c/p\u003e\n\u003cp\u003eThey didn\u0027t reply, just stared with a kind of blank fatigue. She looked at her list of information.\u003c/p\u003e\n\u003cp\u003eBenson home at 12:30. Picked up? blueprints,? gun, and tool kit.\u003c/p\u003e\n\u003cp\u003eBenson not seen in Jackrabbit Club recently.\u003c/p\u003e\n\u003cp\u003eBenson upset by UH computer, installed 7/69.\u003c/p\u003e\n\u003cp\u003e\"Suggest anything to you?\" Ellis asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" Ross said. \"But I think one of us should talk to McPherson.\" She looked at Ellis, who nodded without energy. Morris shrugged slightly. \"All right,\" she said. \"I\u0027ll do it.\"\u003c/p\u003e\n\u003cp\u003eIt was 4:30 a.m.\u003c/p\u003e\n\u003cp\u003e\"The fact is,\" Ross said, \"we\u0027ve exhausted all our options. Time is running out.\"\u003c/p\u003e\n\u003cp\u003eMcPherson stared at her across his desk. His eyes were dark and tired. \"What do you expect me to do?\" he said.\u003c/p\u003e\n\u003cp\u003e\"Notify the police.\"\u003c/p\u003e\n\u003cp\u003e\"The police are already notified. They\u0027ve been notified from the beginning by one of their own people. I understand the seventh floor is swarming with cops now.\"\u003c/p\u003e\n\u003cp\u003e\"The police don\u0027t know about the operation.\"\u003c/p\u003e\n\u003cp\u003e\"For Christ\u0027s sake, the police brought him here for the operation. Of course they know about it.\"\u003c/p\u003e\n\u003cp\u003e\"But they don\u0027t really know what it involves.\"\u003c/p\u003e\n\u003cp\u003e\"They haven\u0027t asked.\"\u003c/p\u003e\n\u003cp\u003e\"And they don\u0027t know about the computer projection for 6 a.m.\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\" he said.\u003c/p\u003e\n\u003cp\u003eShe was becoming angry with him. He was so damned stubborn. He knew perfectly well what she was saying.\u003c/p\u003e\n\u003cp\u003e\"I think their attitude might be different if they knew that Benson was going to have a seizure at six a.m.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re right,\" McPherson said. He shifted his weight heavily in his chair. \"I think they might stop thinking about him as an escaped man wanted on a charge of assault. And they would begin thinking of him as a crazy murderer with wires in his brain.\" He sighed. \"Right now, their objective is to apprehend him. If we tell them more, they\u0027ll try to kill him.\"\u003c/p\u003e\n\u003cp\u003e\"But innocent lives may be involved. If the projection- \"\u003c/p\u003e\n\u003cp\u003e\"The projection,\" McPherson said, \"is just that. A computer projection. It is only as good as its input and that input consists of three timed stimulations. You can draw a lot of curves through three graph points. You can extrapolate it a lot of ways. We have no positive reason to believe he\u0027ll tip over at six a.m. In actual fact, he may not tip over at all.\"\u003c/p\u003e\n\u003cp\u003eShe glanced around the room, at the charts on his walls. McPherson plotted the future of the NPS in this room, and he kept a record of it on his walls, in the form of elaborate, multicolored charts. She knew what those charts meant to him; she knew what the NPS meant to him; she knew what Benson meant to him. But even so, his position was unreasonable and irresponsible.\u003c/p\u003e\n\u003cp\u003eNow how was she going to say that?\u003c/p\u003e\n\u003cp\u003e\"Look, Jan,\" McPherson said, \"you began by saying that we\u0027ve exhausted all our options. I disagree. I think we have the option of waiting. I think there is a possibility he will return to the hospital, return to our care. And as long as that is possible, I prefer to wait.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to tell the police?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"If he doesn\u0027t come back,\" she said, \"and if he attacks someone during a seizure, do you really want that on your head?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s already on my head,\" McPherson said, and smiled sadly.\u003c/p\u003e\n\u003cp\u003eIt was 5 a.m.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eThey were all tired, but none of them could sleep. They stayed in Telecomp, watching the computer projections as they inched up the plotted line toward a seizure state. The time was 5:30, and then 5:45.\u003c/p\u003e\n\u003cp\u003eEllis smoked an entire pack of cigarettes, and then left to get another. Morris stared at a journal in his lap but never turned the page; from time to time, he glanced up at the wall clock.\u003c/p\u003e\n\u003cp\u003eRoss paced, and looked at the sunrise, the sky turning pink over the thin brown haze of smog to the east.\u003c/p\u003e\n\u003cp\u003eEllis came back with more cigarettes.\u003c/p\u003e\n\u003cp\u003eGerhard stopped working with the computers to make fresh coffee. Morris got up and stood watching Gerhard make it; not speaking, not helping, just watching.\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eRoss became aware of the ticking of the wall clock. It was strange that she had never noticed it before, because in fact it ticked quite loudly. And once a minute there was a mechanical click as the minute hand moved another notch. The sound disturbed her. She began to fix on it, waiting for that single click on top of the quieter ticking. Mildly obsessive, she thought. And then she thought of all the other psychological derangements she had experienced in the past. Deja vu, the feeling that she had been somewhere before; depersonalization, the feeling that she was watching herself from across the room at some social gathering; clang associations, delusions, phobias. There was no sharp line between health and disease, sanity and insanity. It was a spectrum, and everybody fitted somewhere on the spectrum. Wherever you were on that spectrum, other people looked strange to you. Benson was strange to them; without question, they were strange to Benson.\u003c/p\u003e\n\u003cp\u003eAt 6 a.m., they all stood and stretched, glancing up at the clock. Nothing happened.\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s six-four exactly,\" Gerhard said.\u003c/p\u003e\n\u003cp\u003eThey waited.\u003c/p\u003e\n\u003cp\u003eThe clock showed 6:04. Still nothing happened. No telephones rang, no messengers arrived. Nothing.\u003c/p\u003e\n\u003cp\u003eEllis slipped the cellophane wrapper off his cigarettes and crumpled it. The sound made Ross want to scream. He began to play with the cellophane, crumpling it, smoothing it out, crumpling it again. She gritted her teeth.\u003c/p\u003e\n\u003cp\u003eThe clock showed 6:10, then 6:15. McPherson came into the room. \"So far, so good,\" he said, smiled bleakly, and left. The others stared at each other.\u003c/p\u003e\n\u003cp\u003eFive more minutes passed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Gerhard said, staring at the computer console. \"Maybe the projection was wrong after all. We only had three plotting points. Maybe we should run another curve through.\"\u003c/p\u003e\n\u003cp\u003eHe sat down at the console and punched buttons. The screen glowed with alternative curves, streaking white across the green background. Finally, he stopped. \"No,\" he said. \"The computer sticks with the original curve. That should be the one.\"\u003c/p\u003e\n\u003cp\u003e\"Well, obviously the computer is wrong,\" Morris said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s almost six-thirty. The cafeteria will be opening. Anybody want to have breakfast?\"\u003c/p\u003e\n\u003cp\u003e\"Sounds good to me,\" Ellis said. He got out of his chair.\u003c/p\u003e\n\u003cp\u003e\"Jan?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I\u0027ll wait here awhile.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think it\u0027s going to happen,\" Morris said. \"You better get some breakfast.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll wait here.\" The words came out almost before she realized it.\u003c/p\u003e\n\u003cp\u003e\"Okay, okay,\" Morris said, raising his hands. He shot a glance at Ellis, and the two men left. She remained in the room with Gerhard.\u003c/p\u003e\n\u003cp\u003e\"Do you have confidence limits on that curve?\" she said.\u003c/p\u003e\n\u003cp\u003e\"I did,\" Gerhard said. \"But I don\u0027t know any more. We\u0027ve passed the confidence limits already. They were about plus or minus two minutes for ninety-nine percent.\"\u003c/p\u003e\n\u003cp\u003e\"You mean the seizure would have occurred between six-two and six-six?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, roughly.\" He shrugged. \"But it obviously didn\u0027t happen.\"\u003c/p\u003e\n\u003cp\u003e\"It might take time before it was discovered.\"\u003c/p\u003e\n\u003cp\u003e\"It might,\" Gerhard nodded. He didn\u0027t seem convinced. She returned to the window. The sun was up now, shining with a pale reddish light. Why did sunrises always seem weaker, less brilliant, than sunsets? They should be the same.\u003c/p\u003e\n\u003cp\u003eBehind her she heard a single electronic beep.\u003c/p\u003e\n\u003cp\u003e\"Oh-oh,\" Gerhard said.\u003c/p\u003e\n\u003cp\u003eShe turned. \"What is it?\"\u003c/p\u003e\n\u003cp\u003eHe pointed across the room to a small mechanical box on a shelf in the corner. The box was attached to a telephone. A green light glowed on the box.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" she repeated.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the special line,\" he said. \"The twenty-four-hour recording for the dog tag.\"\u003c/p\u003e\n\u003cp\u003eShe went over and picked up the telephone from its cradle. She listened and heard a measured, resonant voice saying, \".\u003c/p\u003e\n\u003cp\u003e.. should be advised that the body must not be cremated or damaged in any way until the implanted atomic material has been removed. Failure to remove the material presents a risk of radioactive contamination. For detailed information- \"\u003c/p\u003e\n\u003cp\u003eShe turned to Gerhard. \"How do you turn it off?\"\u003c/p\u003e\n\u003cp\u003eHe pressed a button on the box. The recording stopped.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" she said.\u003c/p\u003e\n\u003cp\u003eThere was a pause. Then a male voice said, \"Whom am I speaking to?\"\u003c/p\u003e\n\u003cp\u003e\"This is Dr. Ross.\"\u003c/p\u003e\n\u003cp\u003e\"Are you affiliated with the\" - a short pause - \"the\u003c/p\u003e\n\u003cp\u003eNeuropsychiatric Research Unit?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I am.\"\u003c/p\u003e\n\u003cp\u003e\"Get a pencil and paper. I want you to take an address down. This is Captain Anders of the Los Angeles police.\"\u003c/p\u003e\n\u003cp\u003eShe gestured to Gerhard for something to write with.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the problem, Captain?\"\u003c/p\u003e\n\u003cp\u003e\"We have a murder here,\" Anders said, \"and we\u0027ve got some questions for your people.\"\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eThree patrol cars were pulled up in front of the apartment building off Sunset. The flashing red lights had already drawn a crowd, despite the early hour and the morning chill. She parked her car down the street and walked back to the lobby. A young patrolman stopped her.\u003c/p\u003e\n\u003cp\u003e\"You a tenant?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Dr. Ross. Captain Anders called me.\"\u003c/p\u003e\n\u003cp\u003eHe nodded toward the elevator. \"Third floor, turn left,\" he said, and let her through. The crowd watched curiously as she crossed the lobby and waited for the elevator. They were standing outside, looking in, peering over each other\u0027s shoulders, whispering among themselves. She wondered what they thought of her. The flashing lights from the patrol cars bathed the lobby intermittently with a red glow. Then the elevator came, and the doors closed.\u003c/p\u003e\n\u003cp\u003eThe interior of the elevator was tacky: plastic paneling made to look like wood, worn green carpeting stained by innumerable pets. She waited impatiently for it to creak up to the third floor. She knew what these buildings were like - full of hookers, full of fags, full of drugs and transients. You could rent an apartment without a long lease, just month to month. It was that kind of place.\u003c/p\u003e\n\u003cp\u003eShe stepped off at the third floor and walked down to a cluster of cops outside an apartment. Another policeman blocked her way; she repeated that she was here to see Captain Anders, and he let her through with the admonition not to touch anything.\u003c/p\u003e\n\u003cp\u003eIt was a one-bedroom apartment furnished in pseudo-Spanish style. Or at least she thought it was. Twenty men were crowded inside, dusting, photographing, measuring, collecting. It was impossible to visualize how it had looked before the onslaught of police personnel.\u003c/p\u003e\n\u003cp\u003eAnders came over to her. He was young, in his middle thirties, wearing a conservative dark suit. His hair was long enough to hang over the back of his collar and he wore horn-rimmed glasses. The effect was almost professorial, and quite unexpected. It was strange how you built up prejudices. When he spoke, his voice was soft: \"Are you Dr. Ross?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Captain Anders.\" He shook hands quickly and firmly.\u003c/p\u003e\n\u003cp\u003e\"Thank you for coming. The body is in the bedroom. The coroner\u0027s man is in there, too.\"\u003c/p\u003e\n\u003cp\u003eHe led the way into the bedroom. The deceased was a girl in her twenties, sprawled nude across the bed. Her head was crushed and she had been stabbed repeatedly. The bed was soaked with blood, and the room had the sickly sweet odor of blood.\u003c/p\u003e\n\u003cp\u003eThe rest of the room was in disarray - a chair by the dressing table knocked over, cosmetics and lotions smeared on the rug, a bedside lamp broken. Six men were working in the room, one of them a doctor from the medical examiner\u0027s office. He was filling out the death report.\u003c/p\u003e\n\u003cp\u003e\"This is Dr. Ross,\" Anders said. \"Tell her about it.\"\u003c/p\u003e\n\u003cp\u003eThe doctor shrugged toward the body. \"Brutal methodology, as you can see. Strong blow to the left temporal region, producing cranial depression and immediate unconsciousness. The weapon was that lamp over there. Blood of her type and some of her hair are affixed to it.\"\u003c/p\u003e\n\u003cp\u003eRoss glanced over at the lamp, then back to the body. \"The stab wounds?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re later, almost certainly post-mortem. She was killed by the blow to the head.\"\u003c/p\u003e\n\u003cp\u003eRoss looked at the head. It was squashed in on one side, like a deflated football, distorting the features of what had once been a conventionally pretty face.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll notice,\" the doctor said, moving closer to the girl, \"that she\u0027s put on half her make-up. As we reconstruct it, she\u0027s sitting at the dressing table, over there, making up. The blow comes from above and from the side, knocking her over in the chair, spilling the lotions and crap. Then she\u0027s lifted up\" - the doctor raised his arms and frowned in mock effort, lifting an invisible body - \"from the chair and placed on the bed.\"\u003c/p\u003e\n\u003cp\u003e\"Somebody pretty strong?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. A man for sure.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know that?\"\u003c/p\u003e\n\u003cp\u003e\"Pubic hair in the shower drain. We\u0027ve found two varieties. One matches hers, the other is male. Male pubic hair as you know is more circular, less elliptical in cross section than female hair.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Ross said. \"I didn\u0027t know that.\"\u003c/p\u003e\n\u003cp\u003e\"I can give you a reference on it, if you want,\" the doctor said. \"It\u0027s also clear that her killer had intercourse with her before the murder. We\u0027ve got a blood type on the seminal fluid and it\u0027s AO. The man apparently takes a shower after intercourse, and then comes out and kills her.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-terminal-man/page-16.html","bookId":1705,"creation":"Oct 5, 2019 10:00:23 AM","modification":"Oct 5, 2019 10:00:23 AM"}
