{"id":93322,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, well, I mean to say, I’m Dimity Ann Plumleigh-Teignmott, actually, in full.”\u003c/p\u003e\n\u003cp\u003e“Sophronia Angelina Temminnick.”\u003c/p\u003e\n\u003cp\u003e“Gosh, that’s a mouthful.”\u003c/p\u003e\n\u003cp\u003e“It is? I suppose so.” As though Dimity Ann Plumleigh-Teignmott were a nice easy sort of name. Sophronia dragged her eyes away from the girl to examine the final occupant of the carriage. It was difficult to make out what kind of creature lurked under the oversized bowler and oiled greatcoat. But, if pressed, she would have said it was some species of grubby boy. He had spectacles that were very thick, a brow that was very creased, and a large dusty book occupying the entirety of his lap and attention.\u003c/p\u003e\n\u003cp\u003e“What’s that?” she asked the girl, wrinkling her nose.\u003c/p\u003e\n\u003cp\u003e“Oh, that? That’s just Pillover.”\u003c/p\u003e\n\u003cp\u003e“And what’s a pillover, when it’s at home?”\u003c/p\u003e\n\u003cp\u003e“My little brother.”\u003c/p\u003e\n\u003cp\u003e“Ah, I commiserate. I have several of my own. Dashed inconvenient, brothers.” Sophronia nodded, perfectly understanding the outlandish hat and coat.\u003c/p\u003e\n\u003cp\u003ePillover glanced up from behind his spectacles and issued them both a look. He seemed a few years younger than his sister, who was, Sophronia guessed, about thirteen.\u003c/p\u003e\n\u003cp\u003e“He’s slated for Bunson’s.”\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003e“Bunson and Lacroix’s Boys’ Polytechnique. You know, our sibling school?”\u003c/p\u003e\n\u003cp\u003eSophronia, who had no idea what Dimity was talking about, pretended to follow out of politeness.\u003c/p\u003e\n\u003cp\u003eThe girl prattled on. She seemed to be a bit of a prattler. Sophronia was comfortable with this after living with her own family. They were big talkers, but with a lot less interesting things to say than Dimity. “Mummy and Daddy want him to be an evil genius, but he has his heart set on Latin verse. Don’t you, Pill?”\u003c/p\u003e\n\u003cp\u003eThe boy gave his sister a nasty stare.\u003c/p\u003e\n\u003cp\u003e“Pillover is terribly bad at being bad, if you take my meaning. Our daddy is a founding member of the Death Weasel Confederacy, and Mummy is a kitchen chemist with questionable intent, but poor Pillover can’t even bring himself to murder ants with his Depraved Lens of Crispy Magnification. Can you, Pill?”\u003c/p\u003e\n\u003cp\u003eSophronia felt as though she was progressively losing the thread of the conversation. “Death Weasel Confederacy?”\u003c/p\u003e\n\u003cp\u003eDimity nodded, curls bobbing. “I know—can you countenance it? I tend to look on the bright side; at least Daddy’s not a Pickleman.”\u003c/p\u003e\n\u003cp\u003eSophronia’s eyes popped. “Uh, oh yes, rather.” Pickleman? What in aether is a Pickleman?\u003c/p\u003e\n\u003cp\u003e“But Pill here is a sad disappointment to poor old Daddy.”\u003c/p\u003e\n\u003cp\u003eThe boy in question put down his book, clearly driven to defend himself. “I made the articulated hassock that moved when someone went to sit on it. And there was that custard pot that never got cool enough for the pudding to set.”\u003c/p\u003e\n\u003cp\u003eDimity provided parenthetical information against this defense. “The hassock always ended up moving forward helpfully. And cook simply used the Custard Pot of Iniquity for keeping her buns warm.”\u003c/p\u003e\n\u003cp\u003e“Oh, I say. That’s not on. Telling family secrets like that!”\u003c/p\u003e\n\u003cp\u003e“Face it, Pill, you’re disappointingly good.”\u003c/p\u003e\n\u003cp\u003e“Oh, I like that! And you’re so evil? Why, you want to get married and be a lady. Who ever heard of such a thing in our family? At least I try.”\u003c/p\u003e\n\u003cp\u003e“Well, finishing school should help with being a lady. Shouldn’t it?” At least this was something Sophronia knew about.\u003c/p\u003e\n\u003cp\u003eThe boy snorted derisively. “Not half. Not this finishing school. Wrong kind of finishing altogether. Or should I say right kind, but only on the surface? I’m sure you follow.” Pillover made a funny little leer at Sophronia, then, seeming to have embarrassed himself, resumed his book.\u003c/p\u003e\n\u003cp\u003e“What could he possibly be implying?” Sophronia looked to Dimity to explain her brother’s behavior.\u003c/p\u003e\n\u003cp\u003e“You mean, you don’t know?”\u003c/p\u003e\n\u003cp\u003e“Know what?”\u003c/p\u003e\n\u003cp\u003e“Oh my goodness. You’re a covert recruit? No family connection at all? I knew they took them, of course, but I didn’t think I would get to meet one. How charming! Have you been under surveillance? I heard they do that sometimes.”\u003c/p\u003e\n\u003cp\u003eMademoiselle Geraldine interceded at that juncture. “That’s enough of that, Miss Plumleigh-Teignmott.”\u003c/p\u003e\n\u003cp\u003e“Yes, Mademoiselle Geraldine.”\u003c/p\u003e\n\u003cp\u003eThe headmistress went back to ignoring them.\u003c/p\u003e\n\u003cp\u003e“So where are we traveling to?” Sophronia asked, figuring that was a safe question, since they clearly weren’t allowed to talk about the school itself.\u003c/p\u003e\n\u003cp\u003e“You don’t even know that much?” Dimity’s tone full of pity. “Why, to Mademoiselle Geraldine’s Finishing Academy for Young Ladies of Quality.”\u003c/p\u003e\n\u003cp\u003eSophronia shook her head. “No, I mean, where is the location of this school?”\u003c/p\u003e\n\u003cp\u003e“Well, no one knows exactly, but to the south. Dartmoor, or somewhere around there.”\u003c/p\u003e\n\u003cp\u003e“Why so mysterious?”\u003c/p\u003e\n\u003cp\u003eDimity shook her head, curls flying. “Oh, no, you see, I’m not meaning to be. It isn’t, you understand, at a fixed location.”\u003c/p\u003e\n\u003cp\u003e“What isn’t?”\u003c/p\u003e\n\u003cp\u003e“The academy.”\u003c/p\u003e\n\u003cp\u003eSophronia imagined a building, filled with shrieking girls, scooting about the moor on tracks, like some massive, overexcited mechanical. “The school is mobile? What, on hundreds of tiny little legs?”\u003c/p\u003e\n\u003cp\u003e“Legs? Well, yes, moving, only not on legs. I think it’s, you know.” Dimity tilted her head back and looked to the ceiling.\u003c/p\u003e\n\u003cp\u003eSophronia was about to inquire further when a terrific jolt shook them where they sat and the carriage came to a stop so abruptly that it pitched Dimity on top of Sophronia, and Pillover on top of Mademoiselle Geraldine.\u003c/p\u003e\n\u003cp\u003eMademoiselle Geraldine screamed, probably upset by extended contact with Pillover’s grimy coat, and flapped her arms and legs to get the boy off.\u003c/p\u003e\n\u003cp\u003eSophronia and Dimity untangled themselves, giggling.\u003c/p\u003e\n\u003cp\u003ePillover extracted himself from the headmistress with remarkable dignity for a boy of his age and dress and retrieved his bowler from the floor.\u003c/p\u003e\n\u003cp\u003e“What on earth is going on?” Mademoiselle Geraldine banged on the ceiling of the cab with her parasol. “Coachman? Coachman!”\u003c/p\u003e\n\u003cp\u003eThe carriage remained still. Or at least it didn’t appear to want to move forward. Every so often it would bob upward, as though it were afloat on the open sea.\u003c/p\u003e\n\u003cp\u003eThe door to the carriage was yanked open to reveal not the coachman, but a bizarre-looking gentleman. He was dressed for the hunt in tweed jodhpurs, boots, red jacket, and riding hat, but he also wore goggles, with a long scarf of the type donned by arctic explorers wrapped around the lower part of his face.\u003c/p\u003e\n\u003cp\u003eThe carriage lurched again. One of the horses neighed in alarm.\u003c/p\u003e\n\u003cp\u003eThe strange man had a massive brass onion pinned to his cravat and was pointing a wicked-looking pistol at the occupants of the carriage. Sophronia’s eyes, once caught by the weapon, remained fixed upon it. Never before had she come face-to-face with an actual gun. She was shocked. Why, that thing could go off. Someone could get hurt!\u003c/p\u003e\n\u003cp\u003e“Highwaymen!” squeaked Pillover.\u003c/p\u003e\n\u003cp\u003e“No,” corrected Mademoiselle Geraldine, her teeth gritted. “Worse: flywaymen.” The was something in her tone, felt Sophronia, that suggested she was not surprised. Sophronia was instantly suspicious of both Mademoiselle Geraldine and the flywayman.\u003c/p\u003e\n\u003cp\u003eThe headmistress batted her long eyelashes. “Why, sir, what could you possibly want from us? I’m simply a headmistress transporting these children to their final destination.”\u003c/p\u003e\n\u003cp\u003eLaying it on a bit thick, isn’t she? thought Sophronia.\u003c/p\u003e\n\u003cp\u003e“We have nothing of great value. We—”\u003c/p\u003e\n\u003cp\u003eThe flywayman interrupted Mademoiselle Geraldine. “Silence. We know perfectly well what you’ve got those pretty little mitts on. Hand over the prototype.”\u003c/p\u003e\n\u003cp\u003e“I have absolutely no idea what you are on about.” The headmistress’s trembling smile was well executed, but apparently not convincing.\u003c/p\u003e\n\u003cp\u003e“ ’Course you do. Where is it?”\u003c/p\u003e\n\u003cp\u003eMademoiselle Geraldine shook her head, eyelashes lowered prettily.\u003c/p\u003e\n\u003cp\u003e“Well, perhaps we’ll simply have a look for ourselves.”\u003c/p\u003e\n\u003cp\u003eThe man stuck his head, briefly, back out the door and yelled something indistinguishable up to the sky.\u003c/p\u003e\n\u003cp\u003eThere came a thump on the top of the carriage. Sophronia and the others could do nothing but watch, mutely, as their trunks, bags, and hatboxes were thrown from the roof to crash to the ground. There they fell open, littering the dusty road with clothing, hats, and shoes.\u003c/p\u003e\n\u003cp\u003eTwo more flywaymen, dressed much like their leader, jumped down after and began rifling through the spilled contents. Whatever they were looking for appeared to be relatively small, as every piece of luggage—no matter what the size—had to be emptied. One of the men even used a knife to slash the bottoms of the trunks, searching for hidden pockets.\u003c/p\u003e\n\u003cp\u003eThis was all highly embarrassing, to have one’s private possessions strewn about in public! Sophronia was particularly mortified that Pillover could see all her underthings—a stranger, and a boy! She also noted that Mademoiselle Geraldine’s trunks included some very salacious night garments. Why, there was a nightgown of purple flannel. Imagine that!\u003c/p\u003e\n\u003cp\u003eThe flywaymen’s movements became increasingly frenzied. Their leader, while still guarding the occupants of the carriage, glanced frequently behind him at the activity in the road.\u003c/p\u003e\n\u003cp\u003eAfter a quarter of an hour, the man’s hand, the one holding the gun, began shaking from fatigue.\u003c/p\u003e\n\u003cp\u003e“Where is it?” he hissed at Mademoiselle Geraldine.\u003c/p\u003e\n\u003cp\u003e“I told you, young man, you will not find it here. Whatever it is.” She tossed her head. Actually tossed it!\u003c/p\u003e\n\u003cp\u003e“Impossible. We know you have it. You must have it!”\u003c/p\u003e\n\u003cp\u003eThe headmistress looked off to the far distant horizon, nose elevated. “Your information would appear to be faulty.”\u003c/p\u003e\n\u003cp\u003e“Come with me. You, children, stay here.” The man dragged Mademoiselle Geraldine from the carriage. The headmistress struggled briefly, but finding the man’s strength superior to her own, she subsided.\u003c/p\u003e\n\u003cp\u003e“Where’s the coachman?” Sophronia hissed to Dimity and Pillover.\u003c/p\u003e\n\u003cp\u003e“Probably overcome by physical assault,” said Dimity.\u003c/p\u003e\n\u003cp\u003e“Or dead,” added Pillover.\u003c/p\u003e\n\u003cp\u003e“How’d they get to us? I didn’t hear any horses or anything.”\u003c/p\u003e\n\u003cp\u003ePillover pointed up. “Sky highwaymen. Haven’t you heard of them?”\u003c/p\u003e\n\u003cp\u003e“Well, yes, but I didn’t think they actually existed.”\u003c/p\u003e\n\u003cp\u003ePillover shrugged.\u003c/p\u003e\n\u003cp\u003e“Must have been hired by someone,” Dimity said. “What do you think the prototype is for?”\u003c/p\u003e\n\u003cp\u003e“Does it matter?” her brother asked.\u003c/p\u003e\n\u003cp\u003e“You think she actually has it?” Sophronia wondered.\u003c/p\u003e\n\u003cp\u003ePillover looked at Sophronia with something like pity in his dark eyes. “Of course she has it. Question is, did she hide it well enough?”\u003c/p\u003e\n\u003cp\u003e“Or did she make a copy?” added Dimity.\u003c/p\u003e\n\u003cp\u003e“Is it safe to let them think they’ve won?”\u003c/p\u003e\n\u003cp\u003e“And was she thinking that far ahead?”\u003c/p\u003e\n\u003cp\u003eSophronia interrupted their speculation. “That’s a lot of questions.”\u003c/p\u003e\n\u003cp\u003eThey heard Mademoiselle Geraldine say something sharp to the men rifling through the luggage. All three looked out the open door to see what would happen next. The flywayman with the gun struck the headmistress across the face with his free hand.\u003c/p\u003e\n\u003cp\u003e“Oh, dear,” said Sophronia. “Violence.” She suppressed panic and a strange urge to giggle. She’d never before seen a grown man actually hit a woman.\u003c/p\u003e\n\u003cp\u003eDimity looked slightly green.\u003c/p\u003e\n\u003cp\u003ePillover’s small face became drawn behind his round spectacles. “I don’t think she planned for this.”\u003c/p\u003e\n\u003cp\u003eHis assessment seemed correct, for Mademoiselle Geraldine proceeded to have a bout of hysterics, culminating in a very dramatic faint in the middle of the road.\u003c/p\u003e\n\u003cp\u003e“Quite the performance. My sister Petunia once acted like that over a mouse.”\u003c/p\u003e\n\u003cp\u003e“You think she’s shamming?” Dimity was inclined to be impressed.\u003c/p\u003e\n\u003cp\u003e“Shamming or not, she seems to have hung us out to dry.” Sophronia pursed her lips. I don’t want to go to finishing school, but I don’t exactly want to be kidnapped by flywaymen either.\u003c/p\u003e\n\u003cp\u003eThe carriage lurched up again.\u003c/p\u003e\n\u003cp\u003eSophronia looked at the ceiling. The flywaymen’s transport must be tied to the luggage rails above. She put two and two together: the flywayman’s goggles plus his onion-shaped pin. Balloon transport. At which point Sophronia decided she had better do something about their predicament. “We need to cut the balloon’s ties to the carriage and get to the driver’s box and take command of the horses. Once we get moving, can we outrun them?”\u003c/p\u003e\n\u003cp\u003ePillover nodded. “No scientist has figured out how to make air transport move as quickly as ground. Although there were some interesting dirigible prototypes in last month’s Junior Guide to Scientific Advancements and Amoral Superiority. Something about utilizing the aether currents, but nothing on balloons, so –” \u003c/p\u003e","sourceLink":"https://allnovel.net/etiquette-espionage-finishing-school-1/page-3.html","bookId":1612,"creation":"Oct 5, 2019 6:01:28 PM","modification":"Oct 5, 2019 6:01:28 PM"}
