{"id":75941,"no":35,"title":"Page 35","content":"\u003cp\u003eAfter a few minutes she sighed. \"Tres, get out of here with me. Destroy that damn disk if you need to, but get out of here.\"\u003c/p\u003e\n\u003cp\u003eI tried to pretend she hadn’t said anything. I wanted to just lie there, keep my eyes closed, listen to Maia breathing as long as I could. But she pulled away. She sat up and looked down at me. The anger in her eyes watered down to frustration.\u003c/p\u003e\n\u003cp\u003e\"Two men have died because of that disk, and now you’ve started advertising you’ve got it. To me that makes the rest insignificant. Even Lillian. Especially Lillian.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. “I can’t just leave it. And I can’t destroy it. Not if it’s about my father’s killers.\"\u003c/p\u003e\n\u003cp\u003e\"You want to get yourself killed instead?\"\u003c/p\u003e\n\u003cp\u003eThere was no correct answer to that. After another minute Maia lost the spirit even to glare at me. She sank back into the cushions.\u003c/p\u003e\n\u003cp\u003e“God damn you, \" she said.\u003c/p\u003e\n\u003cp\u003eI lay there for a long time, contemplating how else I could possibly screw things up. Mentally I started placing bets on who would be coming through my front door next with a gun.\u003c/p\u003e\n\u003cp\u003eBut of course my life wasn’t complicated enough. The ironing board rang. When I picked up the receiver I knew I was either listening to a rock tumbler or an aging smoker trying to breathe. Carl Kelley, retired deputy, my father’s old buddy.\u003c/p\u003e\n\u003cp\u003e\"Hey, son,\" he said. \"Didn’t hear from you yet. Thought I’d call.\"\u003c/p\u003e\n\u003cp\u003eYet? Then I realized it was Sunday afternoon again. I’d been in town exactly one week. In Kelley’s mind I’d started a tradition when I’d called him.\u003c/p\u003e\n\u003cp\u003e\"Hi, Carl.\"\u003c/p\u003e\n\u003cp\u003eI settled in for the duration and opened a Shiner Bock. Maia watched me curiously while Carl launched into a discussion of the newest terminal illnesses he’d read about. He talked about how worthless his son in Austin was. Then he started mentioning past discussions we’d never had. He repeated himself. Finally I listened more carefully to the background noises on the other end of the line.\u003c/p\u003e\n\u003cp\u003e\"Carl,\" I interrupted, \"where are you?\"\u003c/p\u003e\n\u003cp\u003eHe was silent for a minute, except for the breathing.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,\" he said. His voice was shaky. His tone asked me to please worry about it.\u003c/p\u003e\n\u003cp\u003e\"What hospital, Carl?\"\u003c/p\u003e\n\u003cp\u003e\"I didn’t want to trouble you,\" he said. \"My neighbor brings me in for a cold and they say I’ve got pneumonia. Some fucking liver disease. I don’t know what all. Can you believe that?\"\u003c/p\u003e\n\u003cp\u003eHe started to cough so loudly I had to pull the receiver away from my ear. When the coughing subsided it took a few moments for his gravelly breathing to start up again.\u003c/p\u003e\n\u003cp\u003e\"What hospital, Carl?\" I said again.\u003c/p\u003e\n\u003cp\u003e\"The Nix. But don’t worry about it. They’ve got a TV set up for me. I’ve got a little money left. I’m okay.\"\u003c/p\u003e\n\u003cp\u003e\"I’ll come by,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"That’s okay, son.\"\u003c/p\u003e\n\u003cp\u003eHe held the line for a minute longer, but he didn’t need to say anything. I heard the loneliness and the fear even louder than the hospital TV.\u003c/p\u003e\n\u003cp\u003e\"What?\" said Maia when I hung up.\u003c/p\u003e\n\u003cp\u003e\"Somebody from my past,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eMy look made her sorry she’d said it. The irritation drained out of her face. She dropped her eyes. I dug another handful of fifties out of Beau Karnau’s retirement fund and made sure Maia still had bullets in her .45.\u003c/p\u003e\n\u003cp\u003e\"I’ll be back later,\" I told her.\u003c/p\u003e\n\u003cp\u003eMaybe Maia asked me a question. I didn’t wait to hear it.\u003c/p\u003e\n\u003cp\u003e44\u003c/p\u003e\n\u003cp\u003eThe Nix looked like exactly the kind of building Superman would’ve loved to jump over in the 1940s. After saying a few Hail Marys and grinding up twelve floors in the antique elevator, I found Carl’s semi-private room at the end of a narrow blue-lit hallway.\u003c/p\u003e\n\u003cp\u003eI thought I’d been prepared to see Carl as an old man. I was wrong. I couldn’t find his face anywhere in the thinly coated skull that looked up at me. Oxygen tubes ran from his nostrils like an absurdly long mustache. If he had been any more frail they would’ve had to weight him down to keep him from floating out of bed. The only thing still heavy was his voice.\u003c/p\u003e\n\u003cp\u003e\"Hey, son,\" he croaked.\u003c/p\u003e\n\u003cp\u003eAt first I didn’t see how those watery white eyes could focus on me enough to recognize who I was. Maybe he thought I really was his son. Then his eyes slid back over to the TV screen and he started talking about the old days with my father. After a while I interrupted.\u003c/p\u003e\n\u003cp\u003e\"Jesus, Carl. How could you not’ve known you were sick?\"\u003c/p\u003e\n\u003cp\u003eHe looked away from the TV and tried to frown. He put his hand out for mine.\u003c/p\u003e\n\u003cp\u003e\"Hell, son,\" he said.\u003c/p\u003e\n\u003cp\u003eBut he didn’t have an answer for me. I wondered how long it had been since Carl looked in a mirror, or had somebody pay him a visit so they could tell him he was wasting down to a skeleton. I made a mental note to find his son in Austin and have that discussion, if I lived long enough.\u003c/p\u003e\n\u003cp\u003e\"Tell me how it’s going, \" Carl said. \"About your daddy.\"\u003c/p\u003e\n\u003cp\u003e“You should rest, Carl. They got you on vitamins or anything?\"\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, rolled his tongue into a tunnel, and coughed so hard he sat up. In the state he was in I was afraid he’d broken his ribs, but he just sank back into the pillows and tried to smile.\u003c/p\u003e\n\u003cp\u003e\"I want to hear, son.\"\u003c/p\u003e\n\u003cp\u003eSo I told him. There wasn’t much point in hiding anything. I asked him if he remembered my dad saying anything about Travis Center, or Sheff, or even vague comments about a big investigation he wanted to do. I told him I couldn’t figure out how my father would’ve stumbled onto the scheme to fix the bidding.\u003c/p\u003e\n\u003cp\u003eI’m not sure Carl even heard half of what I said. His eyes were fixed lazily on the television. When I was finished he offered no comments. He was staring at some Cowboy cheerleaders in a beer commercial.\u003c/p\u003e\n\u003cp\u003e\"Your daddy and the ladies,\" he said. \"I guess you never heard the stories.\"\u003c/p\u003e\n\u003cp\u003e\"Too many stories, Carl.\"\u003c/p\u003e\n\u003cp\u003eHis hand looked so fragile I was surprised how hard he gripped my fingers.\u003c/p\u003e\n\u003cp\u003e“Don’t you doubt he loved your mama, son. It’s just—\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, he loved the ladies too much.\"\u003c/p\u003e\n\u003cp\u003e\"Naw,\" said Carl. \"Just Ellen.\"\u003c/p\u003e\n\u003cp\u003eI don’t know why the name still made me uncomfortable. I’d heard it so many times from people outside the family. At home it had never been an issue. No big deal, really. just every Thanksgiving, my father used to get a little teary-eyed after his third bourbon and Coke. Then he’d raise his glass and Garrett and Shelley would raise theirs too. Nobody said anything. Nobody invited my mother or me to ask. But we knew who they were drinking to. That momentary cease-fire between the three of them was all that was left of Ellen Navarre, my father’s first wife. But the name still made me feel like an unwelcomed guest in my own family.\u003c/p\u003e\n\u003cp\u003eThe studio audience cheered the winner of jeopardy.\u003c/p\u003e\n\u003cp\u003e\"Nothing ever took root for your daddy after Ellen died,\" Carl said. \"Not really.\"\u003c/p\u003e\n\u003cp\u003eI wished he would go back to talking about Alzheimer’s, or maybe prostate cancer. Anything but my father’s love life.\u003c/p\u003e\n\u003cp\u003e\"Right before he got shot,\" Carl said, “he finally thought something was working out, you know. Course he always thought something was working out with some lady.\"\u003c/p\u003e\n\u003cp\u003eI nodded politely, then realized what he was saying. “I don’t remember anybody like that.\"\u003c/p\u003e\n\u003cp\u003eCarl just looked at me and breathed gravel. I got the point.\u003c/p\u003e\n\u003cp\u003e\" She was married.\"\u003c/p\u003e\n\u003cp\u003e\"Eh,\" he said. \"They usually were.\"\u003c/p\u003e\n\u003cp\u003eFor a minute his eyes drifted off, as ·if he’d forgotten what we were talking about. Then he continued.\u003c/p\u003e\n\u003cp\u003e\"Your dad was a hard-nosed son of a bitch, son. But, Good Lord, he could turn soft over a woman. You should’ve seen the roses he bought once for a Laredo whore—\"\u003c/p\u003e\n\u003cp\u003e“Carl,\" I said.\u003c/p\u003e\n\u003cp\u003eHe stopped. I guess he saw well enough to read my expression in the blue light of the television.\u003c/p\u003e\n\u003cp\u003e\"Yeah, you’re right, son. Enough said.\"\u003c/p\u003e\n\u003cp\u003eI sat with him for a while and watched the game shows. The nurse brought in some applesauce and I helped him eat it, spooning the excess up his chin and into his mouth like you would a baby.\u003c/p\u003e\n\u003cp\u003eAfter an hour he said: \"I guess you need to go.\"\u003c/p\u003e\n\u003cp\u003e\"I’ll try and come back tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"You don’t need to do that,\" he said. But his hand wouldn’t let go of mine. He looked at me for a minute and said: \"You look just like your mama. Just like Ellen.\"\u003c/p\u003e\n\u003cp\u003eI didn’t tell him he was wrong. I just nodded, swallowing hard.\u003c/p\u003e\n\u003cp\u003e\"You find this girl of yours,\" Carl said, squeezing the words into my hand, \"and you hang on to her, Jackson.\"\u003c/p\u003e\n\u003cp\u003eMaybe he was talking to me, maybe to my father. At that point it didn’t matter. When I left him he was still recounting the old days, telling Vanna White what a son of a bitch my father had been.\u003c/p\u003e\n\u003cp\u003e\"Roses for a Laredo whore,\" he told her. \" Some kind of roots.\"\u003c/p\u003e\n\u003cp\u003eCarl Kelley held on feebly to his oxygen tubes like they were the only things still anchoring him down.\u003c/p\u003e\n\u003cp\u003e45\u003c/p\u003e\n\u003cp\u003eMaia acknowledged my existence long enough to throw a notepad at me. Then she went back to pretending to read the newspaper.\u003c/p\u003e\n\u003cp\u003e\"He called about an hour ago,\" she said. \"Right after Detective Schaeffer.\"\u003c/p\u003e\n\u003cp\u003eThe note said: \"Carlon—5 hours and counting. Talk to me. \" I tore off the note and threw it in the trash can. I missed.\u003c/p\u003e\n\u003cp\u003e\"And Schaeffer is interested in talking about Terry Garza,\" Maia said. \"I stalled him as much as I could.\"\u003c/p\u003e\n\u003cp\u003e\"Any more good news?\"\u003c/p\u003e\n\u003cp\u003eMaia dropped the paper longer this time, enough for me to see that her eyes were red. She sat on the futon with her legs tucked under her, wearing a black pantsuit with sequins. Her ponytail was tied back in a new way, with a small cluster of red and blue ribbons. It all looked slightly familiar, but not on her. I frowned.\u003c/p\u003e\n\u003cp\u003e\"What else happened?\" I asked. \"Did you go somewhere?\"\u003c/p\u003e\n\u003cp\u003eShe tried to look hurt. Then the tension became unsustainable. She cracked a smile. “Your mother came by,\" she admitted.\u003c/p\u003e\n\u003cp\u003eMy expression must’ve been good. She started laughing.\u003c/p\u003e\n\u003cp\u003e\"You asshole,\" Maia said. \"I’m still mad at you.\"\u003c/p\u003e\n\u003cp\u003eHer eyes said otherwise.\u003c/p\u003e\n\u003cp\u003e\"And—what did my mother say?\"\u003c/p\u003e\n\u003cp\u003e\" She was mad at you too,\" Maia said. The smile was evil. \"We commiserated. We--talked.\"\u003c/p\u003e\n\u003cp\u003eI sat down on the futon next to her, still frowning. I tried to look threatening. \"Talked?\"\u003c/p\u003e\n\u003cp\u003eShe did a bad job of covering up her smile. \"We buried the hatchet, more or less. She took me out as a peace offering. This was right after you left.\"\u003c/p\u003e\n\u003cp\u003eI looked at the pantsuit again, the ribbons in Maia’s hair.\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003eShe nodded her head enthusiastically. “We went shopping at Solo Serve.\"\u003c/p\u003e\n\u003cp\u003e\"It’s over,\" I said. \"Homicides, disappearances, and now you’re going to Solo Serve with my mother.\"\u003c/p\u003e\n\u003cp\u003eMaia shrugged. Then she kissed my cheek.\u003c/p\u003e\n\u003cp\u003e\"I was going to rell you that I’d decided to leave tomorrow,\" she admitted. \"I even made\u0026nbsp; reservations. Now that I’ve seen the clearance rack, I may never go away.\"\u003c/p\u003e\n\u003cp\u003eI needed a beer very badly. Of course Maia and my mother had drunk them all. \u003c/p\u003e","sourceLink":"https://allnovel.net/big-red-tequila-tres-navarre-1/page-35.html","bookId":2416,"creation":"Oct 5, 2019 10:37:11 AM","modification":"Oct 5, 2019 10:37:11 AM"}
