{"id":10553,"no":11,"title":"X. MR. MUDGE MEETS HIS MATCH.","content":"\u0026nbsp;John lounged along, appearing to be very busily engaged in making a whistle from a slip of willow which he had a short time before cut from the tree. He purposely kept in the middle of the road, apparently quite unaware of the approach of the vehicle, until he was aroused by the sound of a voice behind him. \n\u003cdiv\u003e\n “Be a little more careful, if you don\u0027t want to get run over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John assumed a look of surprise, and with comic terror ran to the side of the road.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Mudge checked his horse, and came to a sudden halt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, youngster, haven\u0027t you seen a boy of about your own size walking along, with a bundle in his hand?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tied up in a red cotton handkerchief?” inquired John.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I believe so,” said Mr. Mudge, eagerly, “where did you——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With a blue cloth cap?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, where——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gray jacket and pants?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, yes. Where?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With a patch on one knee?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, the very one. When did you see him?” said Mr. Mudge, getting ready to start his horse.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps it isn\u0027t the one you mean,” continued John, who took a mischievous delight in playing with the evident impatience of Mr. Mudge; “the boy that I saw looked thin, as if he hadn\u0027t had enough to eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Mudge winced slightly, and looked at John with some suspicion. But John put on so innocent and artless a look that Mr. Mudge at once dismissed the idea that there was any covert meaning in what he said. Meanwhile Paul, from his hiding-place in the bushes, had listened with anxiety to the foregoing colloquy. When John described his appearance so minutely, he was seized with a sudden apprehension that the boy meant to betray him. But he dismissed it instantly. In his own singleness of heart he could not believe such duplicity possible. Still, it was not without anxiety that he waited to hear what would be said next.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Mr. Mudge, slowly, “I don\u0027t know but he is a little PEAKED. He\u0027s been sick lately, and that\u0027s took off his flesh.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was he your son?” asked John, in a sympathizing tone; “you must feel quite troubled about him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked askance at Mr. Mudge, enjoying that gentleman\u0027s growing irritation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son? No. Where——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nephews perhaps?” suggested the imperturbable John, leisurely continuing the manufacture of a whistle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I tell you, nothing of the kind. But I can\u0027t sit waiting here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I hope you\u0027ll excuse me,” said John, apologetically. “I hope you won\u0027t stop on my account. I didn\u0027t know you were in a hurry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you know it now,” said Mr. Mudge, crossly. “When and where did you see the boy you have described? I am in pursuit of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he run away?” inquired John in assumed surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to answer my question or not?” demanded Mr. Mudge, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I beg your pardon. I shouldn\u0027t have asked so many questions, only I thought he was a nice-looking boy, and I felt interested in him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s a young scamp,” said Mr. Mudge, impetuously, “and it\u0027s my belief that you\u0027re another. Now answer my question. When and where did you see this boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n This time Mr. Mudge\u0027s menacing look warned John that he had gone far enough. Accordingly he answered promptly, “He passed by our farm this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How far back is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About three miles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he stop there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he stopped a while to rest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you seen him since?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I saw him about half a mile back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On this road?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but he turned up the road that branches off there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just what I wanted to find out,” said Mr. Mudge, in a tone of satisfaction, “I\u0027m sure to catch him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So saying, he turned about and put his horse to its utmost speed, determined to make up for lost time. When he was fairly out of sight, Paul came forth from his hiding-place.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How could you do so!” he asked in a reproachful tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Could I do what?” asked John, turning a laughing face towards Paul. “Didn\u0027t I tell old Mudge the exact truth? You know you did turn up that road. To be sure you didn\u0027t go two rods before turning back. But he didn\u0027t stop to ask about that. If he hadn\u0027t been in such a hurry, perhaps I should have told him. Success to him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can\u0027t think how I trembled when you described me so particularly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You didn\u0027t think I would betray you?” said John, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I was afraid you would venture too far, and get us both into trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Trust me for that, Paul; I\u0027ve got my eyes wide open, and ain\u0027t easily caught. But wasn\u0027t it fun to see old Mudge fuming while I kept him waiting. What would he have said if he had known the bird was so near at hand? He looked foolish enough when I asked him if you were his son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John sat down and gave vent to his pent-up laughter which he had felt obliged to restrain in the presence of Mr. Mudge. He laughed so heartily that Paul, notwithstanding his recent fright and anxiety, could not resist the infection. Together they laughed, till the very air seemed vocal with merriment.\n\u003c/div\u003e \n\u003cdiv\u003e\n John was the first to recover his gravity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry, Paul,” he said, “but I must bid you good-by. They will miss me from the house. I am glad I have got acquainted with you, and I hope I shall see you again some time before very long. Good-by, Paul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by, John.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two boys shook hands and parted. One went in one direction, the other in the opposite. Each looked back repeatedly till the other was out of sight. Then came over Paul once more a feeling of sadness and desolation, which the high spirits of his companion had for the time kept off. Occasionally he cast a glance backwards, to make sure that Mr. Mudge was not following him. But Paul had no cause to fear on that score. The object of his dread was already some miles distant in a different direction.\n\u003c/div\u003e \n\u003cdiv\u003e\n For an hour longer, Paul trudged on. He met few persons, the road not being very much frequented. He was now at least twelve miles from his starting-place, and began to feel very sensibly the effects of heat and fatigue combined. He threw himself down upon the grass under the overhanging branches of an appletree to rest. After his long walk repose seemed delicious, and with a feeling of exquisite enjoyment he stretched himself out at full length upon the soft turf, and closed his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n Insensibly he fell asleep. How long he slept he could not tell. He was finally roused from his slumber by something cold touching his cheek. Starting up he rubbed his eyes in bewilderment, and gradually became aware that this something was the nose of a Newfoundland dog, whose keen scent had enabled him to discover the whereabouts of the small stock of provisions with which Paul had been supplied by his late companion. Fortunately he awoke in time to save its becoming the prey of its canine visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon you came nigh losing your dinner,” fell upon his ears in a rough but hearty tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the same time he heard the noise of wheels, and looking up, beheld a specimen of a class well known throughout New England—a tin pedler. He was seated on a cart liberally stocked with articles of tin ware. From the rear depended two immense bags, one of which served as a receptacle for white rags, the other for bits of calico and whatever else may fall under the designation of “colored.” His shop, for such it was, was drawn at a brisk pace by a stout horse, who in this respect presented a contrast to his master, who was long and lank. The pedler himself was a man of perhaps forty, with a face in which shrewdness and good humor seemed alike indicated. Take him for all in all, you might travel some distance without falling in with a more complete specimen of the Yankee.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you came nigh losing your dinner,” he repeated, in a pleasant tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Paul, “I got tired and fell asleep, and I don\u0027t know when I should have waked up but for your dog.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Boney\u0027s got a keen scent for provisions,” laughed the pedler. “He\u0027s a little graspin\u0027, like his namesake. You see his real name is Bonaparte; we only call him Boney, for short.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile he had stopped his horse. He was about to start afresh, when a thought struck him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you\u0027re goin\u0027 my way,” said he, turning to Paul; “if you are, you\u0027re welcome to a ride.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was very glad to accept the invitation. He clambered into the cart, and took a seat behind the pedler, while Boney, who took his recent disappointment very good-naturedly, jogged on contentedly behind.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How far are you goin\u0027?” asked Paul\u0027s new acquaintance, as he whipped up his horse.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul felt a little embarrassed. If he had been acquainted with the names of any of the villages on the route he might easily have answered. As it was, only one name occurred to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think,” said he, with some hesitation, “that I shall go to New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “New York!” repeated the pedler, with a whistle expressive of his astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you\u0027ve a journey before you. Got any relations there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No uncles, aunts, cousins, nor nothing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then what makes you go? Haven\u0027t run away from your father and mother, hey?” asked the pedler, with a knowing look.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no father nor mother,” said Paul, sadly enough.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you had somebody to take care of you, I calculate. Where did you live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I tell you, you won\u0027t carry me back?” said Paul, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not a bit of it. I\u0027ve got too much business on hand for that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Relieved by this assurance, Paul told his story, encouraged thereto by frequent questions from his companion, who seemed to take a lively interest in the adventures of his young companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s a capital trick you played on old Mudge,” he said with a hearty laugh which almost made the tins rattle. “I don\u0027t blame you a bit for running away. I\u0027ve got a story to tell you about Mrs. Mudge. She\u0027s a regular skinflint.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2993/82566.html","bookId":319,"creation":"Aug 2, 2019 3:12:59 AM","modification":"Aug 2, 2019 3:12:59 AM"}
