{"id":10567,"no":25,"title":"XXIV. PAUL CALLS ON MRS. DANFORTH.","content":"\u0026nbsp;“Mrs. Edward Danforth,” repeated the sexton, on hearing the story of Paul\u0027s exploit. \n\u003cdiv\u003e\n “Why, she attends our church.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know Mr. Danforth?” asked Paul, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only by sight. I know him by reputation, however.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose he is very rich.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I should judge so. At any rate, he is doing an extensive business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is his business?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a merchant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A merchant,” thought Paul; “that is just what I should like to be, but I don\u0027t see much prospect of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you like Mrs. Danforth?” inquired the sexton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very much,” said Paul, warmly. “She was very kind, and made me feel quite at home in her company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope she may be disposed to assist you. She can easily do so, in her position.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day Paul did not as usual go out in search of a situation. His mind was occupied with thoughts of his coming interview with Mrs. Danforth, and he thought he would defer his business plans till the succeeding day.\n\u003c/div\u003e \n\u003cdiv\u003e\n At an early hour in the evening, he paused before an imposing residence on Fifth Avenue, which he had seen but not entered the day previous.\n\u003c/div\u003e \n\u003cdiv\u003e\n He mounted the steps and pulled the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n A smart-looking man-servant answered his ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mrs. Danforth at home?” asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I believe so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have called to see her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does she expect you?” asked the servant, looking surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I come at her appointment,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I suppose it\u0027s all right,” said the man. “Will you come in?” he asked, a little doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul followed him into the house, and was shown into the drawing-room, the magnificence of which somewhat dazzled his eyes; accustomed only to the plain sitting-room of Mr. Cameron.\n\u003c/div\u003e \n\u003cdiv\u003e\n The servant reappeared after a brief absence, and with rather more politeness than he had before shown, invited Paul to follow him to a private sitting-room upstairs, where he would see Mrs. Danforth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking at Paul\u0027s plain, though neat clothes, the servant was a little puzzled to understand what had obtained for Paul the honor of being on visiting terms with Mrs. Danforth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening, Paul,” said Mrs. Danforth, rising from her seat and welcoming our hero with extended hand. “So you did not forget your appointment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was no fear of that,” said Paul, with his usual frankness. “I have been looking forward to coming all day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you, indeed?” said the lady with a pleasant smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I must endeavor to make your visit agreeable to you. Do you recognize this desk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon a table close by, was the desk which had been purchased the day previous, at Appleton\u0027s.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Paul, “it is the one you bought yesterday. I think it is very handsome.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad you think so. I think I told you that I intended it for a present. I have had the new owner\u0027s name engraved upon it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul read the name upon the plate provided for the purpose. His face flushed with surprise and pleasure. That name was his own.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you really mean it for me,” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will accept it,” said Mrs. Danforth, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall value it very much,” said Paul, gratefully. “And I feel very much indebted to your kindness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won\u0027t talk of indebtedness, for you remember mine is much the greater. If you will open the desk you will find that it is furnished with what will, I hope, prove of use to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The desk being opened, proved to contain a liberal supply of stationery, sealing wax, postage stamps, and pens.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was delighted with his new present, and Mrs. Danforth seemed to enjoy the evident gratification with which it inspired him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said she, “tell me a little about yourself. Have you always lived in New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only about three years,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where did you live before?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At Wrenville, in Connecticut.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard of the place. A small country town, is it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul answered in the affirmative.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you happen to leave Wrenville, and come to New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul blushed, and hesitated a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ran away,” he said at length, determined to keep nothing back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ran away! Not from home, I hope.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had no home,” said Paul, soberly. “I should never have left there, if my father had not died. Then I was thrown upon the world. I was sent to the Poorhouse. I did not want to go, for I thought I could support myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a very honorable feeling. I suppose you did not fare very well at the Poorhouse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In reply, Paul detailed some of the grievances to which he had been subjected. Mrs. Danforth listened with sympathizing attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were entirely justified in running away,” she said, as he concluded. “I can hardly imagine so great a lack of humanity as these people showed. You are now, I hope, pleasantly situated?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Paul, “Mr. and Mrs. Cameron treat me with as great kindness as if I were their own child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Cameron! Is not that the name of the sexton of our church?” said Mrs. Danforth, meditatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is with him that I have a pleasant home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, I am glad to hear it. You have been attending school, I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it is not more than two months since I left off school.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now I suppose you are thinking of entering upon some business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I have been trying to obtain a place in some merchant\u0027s counting-room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think, then, that you would like the career of a merchant?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is nothing that would suit me better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have not succeeded in obtaining a place yet, I suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. They are very difficult to get, and I have no influential friends to assist me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard Mr. Danforth say that he experienced equal difficulty when he came to New York, a poor boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see that you are surprised,” said Mrs. Danforth, smiling. “You think, perhaps, judging from what you see, that my husband was always rich. But he was the son of a poor farmer, and was obliged to make his own way in the world. By the blessing of God, he has been prospered in business and become rich. But he often speaks of his early discouragements and small beginnings. I am sorry he is not here this evening. By the way, he left word for you to call at his counting-room to-morrow, at eleven o\u0027clock. I will give you his address.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She handed Paul a card containing the specified number, and soon after he withdrew, bearing with him his handsome gift, and a cordial invitation to repeat his call.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked back at the elegant mansion which he had just left, and could not help feeling surprised that the owner of such a palace, should have started in life with no greater advantages than himself.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2993/82580.html","bookId":319,"creation":"Aug 2, 2019 3:13:34 AM","modification":"Aug 2, 2019 3:13:34 AM"}
