{"id":10572,"no":30,"title":"XXIX. DAWKINS IN DIFFICULTIES.","content":"\u0026nbsp;George Dawkins was standing at his desk one morning, when a man entered the office, and stepping up to him, unceremoniously tapped him on the shoulder. \n\u003cdiv\u003e\n Dawkins turned. He looked extremely annoyed on perceiving his visitor, whose outward appearance was certainly far from prepossessing. His face exhibited unmistakable marks of dissipation, nor did the huge breast pin and other cheap finery which he wore conceal the fact of his intense vulgarity. His eyes were black and twinkling, his complexion very dark, and his air that of a foreigner. He was, in fact, a Frenchman, though his language would hardly have betrayed him, unless, as sometimes, he chose to interlard his discourse with French phrases.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you this morning, my friend?” said the newcomer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you here for?” asked Dawkins, roughly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That does not seem to me a very polite way of receiving your friends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Friends!” retorted Dawkins, scornfully, “who authorized you to call yourself my friend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Creditor, then, if it will suit you better, mon ami.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush,” said Dawkins, in an alarmed whisper, “he will hear,” here he indicated Paul with his finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And why should I care? I have no secrets from the young man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop, Duval,” exclaimed Dawkins, in an angry whisper, “Leave the office at once. Your appearing here will injure me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I am not your friend; why should I care?” sneered Duval.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen to reason. Leave me now, and I will meet you when and where you will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, that sounds better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now go. I\u0027m afraid Mr. Danforth will be in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he comes, introduce me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins would like to have knocked the fellow over.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Name your place and time, and be quick about it,” said he impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eight o\u0027clock this evening, you know where,” was the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. Good-morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mind you bring some money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-morning,” returned Dawkins, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length, much to his relief, Duval left the office. Dawkins stole a side glance at Paul, to see what impression the interview had made upon him, but our hero, who had overheard some portions of the dialogue, perceiving that Dawkins wished it to be private, took as little notice of the visitor as possible. He could not help thinking, however, that Duval was a man whose acquaintance was likely to be of little benefit to his fellow clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n Throughout the day Dawkins appeared unusually nervous, and made several blunders which annoyed Mr. Danforth. Evidently he had something on his mind. Not to keep the reader in suspense, George had fallen among bad companions, where he had learned both to drink and to gamble. In this way he had made the acquaintance of Duval, an unscrupulous sharper, who had contrived to get away all his ready money, and persuading him to play longer in the hope of making up his losses had run him into debt one hundred and fifty dollars. Dawkins gave him an acknowledgment of indebtedness to that amount. This of course placed him in Duval\u0027s power, since he knew of no means of raising such a sum. He therefore kept out of the Frenchman\u0027s way, avoiding the old haunts where he would have been likely to meet him. Dawkins supposed Duval ignorant of the whereabouts of his employer\u0027s counting-room. So he had been, but he made it his business to ascertain where it was. He had no idea of losing sight of so valuable a prize.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins would willingly have broken the appointment he had made with Duval, but he did not dare to do so. He knew that the man was well able to annoy him, and he would not on any account have had the affair disclosed to his father or Mr. Danforth.\n\u003c/div\u003e \n\u003cdiv\u003e\n As Trinity clock struck eight, he entered a low bar-room in the neighborhood of the docks.\n\u003c/div\u003e \n\u003cdiv\u003e\n A young man with pale, sandy hair stood behind the counter with his sleeves rolled up. He was supplying the wants of a sailor who already appeared to have taken more drink than was good for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening, Mr. Dawkins,” said he, “you\u0027re a stranger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Duval in?” inquired Dawkins, coldly. His pride revolted at the place and company. He had never been here but once before, having met Duval elsewhere.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s up in his room. John show the young gentleman up to No. 9. Won\u0027t you have a glass of something this evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Dawkins, abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy preceded him up a dark and dirty staircase.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s the room, sir,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop a minute,” said Dawkins, “he may not be in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He inwardly hoped he might not. But Duval answered his knock by coming to the door himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Delighted to see you, mon ami. John, may leave the lamp. That\u0027s all, unless Mr. Dawkins wishes to order something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want nothing,” said Dawkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They have some capital brandy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not in the mood for drinking tonight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As you please,” said the Frenchman, disappointed; “be seated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins sat down in a wooden rocking-chair, minus an arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Duval, “how much money have you brought me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “None.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Frenchman frowned and stroked his mustache, fiercely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does all this mean? Are you going to put me off longer?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would pay it if I could,” said Dawkins, “but I haven\u0027t got the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You could get it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ask your father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father would rave if he knew that I had lost money in such a way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you need not tell him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I ask for money, he will be sure to ask what I want it for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him you want clothes, or a watch, or a hundred things.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins shook his head; “it won\u0027t do,” said he. “He wouldn\u0027t give me a hundred and fifty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then ask seventy-five, and I will wait a month for the rest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Duval, you have no rightful claim to this money. You\u0027ve got enough out of me. Just tear up the paper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Duval laughed scornfully, “Aha, Mr. Dawkins,” he said, “that would be a very pretty arrangement FOR YOU. But I don\u0027t see how it is going to benefit me. No, no, I can\u0027t afford to throw away a hundred and fifty dollars so easily. If I was a rich man like your father it would make a difference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you won\u0027t remit the debt,” said Dawkins, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would think me a great ninny, if I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you may collect it the best way you can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean by that?” demanded the Frenchman, his face darkening.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean what I say,” said Dawkins, desperately, “Gambling debts are not recognizable in law.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing is said about it\u0027s being a gambling debt. I have your note.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which is worth nothing, since I am a minor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Duval\u0027s face became black with rage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aha, my friend,” said he showing his teeth, “this is a very nice game to cheat me out of my money. But it won\u0027t do, it won\u0027t do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why won\u0027t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall say a word in your father\u0027s ear, mon ami, and in the ear of your worthy employer whom you were so anxious for me not to see, and perhaps that would be worse for you than to pay me my money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins\u0027s brief exultation passed away. He saw that he was indeed in the power of an unscrupulous man, who was disposed to push his advantage to the utmost.\n\u003c/div\u003e \n\u003cdiv\u003e\n He subsided into a moody silence, which Duval watched with satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, my friend, what will you do about it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know what I can do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will think of something. You will find it best,” said the Frenchman, in a tone which veiled a threat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will try,” said Dawkins, gloomily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is well. I thought you would listen to reason, mon ami. Now we will have a pleasant chat. Hold, I will order some brandy myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not for me,” said Dawkins, rising from his chair, “I must be going.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you not have one little game?” asked Duval, coaxingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no, I have had enough of that. Goodnight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you won\u0027t stop. And when shall I have the pleasure of seeing you at my little apartment once more?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it is any trouble to you to come, I will call at your office,” said Duval, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t trouble yourself,” said Dawkins, hastily; “I will come here a week from today.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A week is a long time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Long or short, I must have it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, mon ami. A week let it be. Good-night. Mind the stairs as you go down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins breathed more freely as he passed out into the open air. He was beginning to realize that the way of the transgressor is hard.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2993/82585.html","bookId":319,"creation":"Aug 2, 2019 3:13:45 AM","modification":"Aug 2, 2019 3:13:45 AM"}
