{"id":10574,"no":32,"title":"XXXI. CONVICTED OF THEFT.","content":"\u0026nbsp;Half an hour later Mr. Danforth returned. \n\u003cdiv\u003e\n “Has any one been here?” he asked as he passed through the outer office.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” said Dawkins, with outward composure though his heart was beating rapidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n While apparently intent upon his writing he listened attentively to what might be going on in the next room. One,—two,—three minutes passed. Mr. Danforth again showed himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you say that no one has been here?” he demanded, abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have either of you been into my office since I have been out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have not, sir,” said Dawkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I went in to carry your letters,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you see a roll of bills lying on my desk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Paul, a little surprised at the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have just counted it over, and find but six hundred dollars instead of eight hundred. Can you account for the discrepancy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Danforth looked keenly at the two boys. Dawkins, who had schooled himself to the ordeal, maintained his outward calmness. Paul, beginning to perceive that his honesty was called in question, flushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” said the boys simultaneously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It can hardly be possible, that Mr. Thompson, who is a very careful man, should have made such a mistake in paying me,” resumed Mr. Danforth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As we have been the only persons here,” said Dawkins, “the only way to vindicate ourselves from suspicion is, to submit to a search.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Paul promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Both boys turned their pockets inside out, but the missing money was not found.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is my overcoat, sir,” said Dawkins, “will you be kind enough to search it for yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Next, of course, Paul\u0027s overcoat was searched.\n\u003c/div\u003e \n\u003cdiv\u003e\n What was our hero\u0027s dismay when from one of the pockets Mr. Danforth produced a fifty dollar bill.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it possible?” he exclaimed in as much grief as surprise, “Unhappy boy, how came you by this money in your pocket?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know, sir,” returned Paul, his cheek alternately flushing and growing pale.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I could believe you,” said Mr. Danforth; “where have you put the other bills? Produce them, and I may overlook this first offense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, sir,” said Paul, in great distress, “I have not the slightest knowledge of how this bill came into my pocket. I hope you will believe me, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can I? The money evidently did not go into your pocket without hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A sudden thought came to Paul. “Dawkins,” said he, “did you put that money into my pocket?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, sir?” returned Dawkins, haughtily. “Is it your intention to insult me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dawkins could not prevent his face from flushing as he spoke, but this might easily be referred to a natural resentment of the imputation cast upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Paul,” said his employer, coldly, “you will not help your own cause by seeking to involve another. After what has happened you can hardly expect me to retain you in my employment. I will not make public your disgrace, nor will I inquire farther for the remainder of the money for which you have been willing to barter your integrity. I will pay your wages up to the end of this week, and——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Danforth,” said Paul, manfully, though the tears almost choked his utterance, “I am sorry that you have no better opinion of me. I do not want the balance of my wages. If I have taken so large a sum which did not belong to me, I have no claim to them. Good-morning, sir. Sometime I hope you will think better of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul put on his coat, and taking his cap from the nail on which it hung, bowed respectfully to his employer and left the office.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Danforth looked after him, and seemed perplexed. Could Paul be guilty after all?\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never could have suspected him if I had not this evidence in my hand,” said Mr. Danforth, to himself, fixing his eyes upon the bill which he had drawn from Paul\u0027s overcoat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dawkins, did you observe whether Paul remained long in the office?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Longer than sufficient to lay the letters on the desk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I think he did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you notice whether he went to his overcoat after coming out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, he did,” said Dawkins, anxious to fix in Mr. Danforth\u0027s mind the impression of Paul\u0027s guilt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am afraid it is true,” said his employer sadly. “And yet, what a fine, manly boy he is too. But it is a terrible fault.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Danforth was essentially a kind-hearted man, and he cared much more for Paul\u0027s dereliction from honesty than for the loss of the money. Going home early to dinner, he communicated to his wife the unpleasant discovery which he had made respecting Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, from the first, Paul had been a great favorite with Mrs. Danforth, and she scouted at the idea of his dishonesty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Depend upon it, Mr. Danforth,” she said decisively, “you have done the boy an injustice. I have some skill in reading faces, and I tell you that a boy with Paul Prescott\u0027s open, frank expression is incapable of such a crime.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I should have said, my dear, but we men learn to be less trustful than you ladies, who stay at home and take rose-colored views of life. Unfortunately, we see too much of the dark side of human nature.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So that you conclude all to be dark.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not so bad as that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me all the circumstances, and perhaps a woman\u0027s wit may help you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Danforth communicated all the details, with which the reader is already familiar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What sort of a boy is this Dawkins?” she asked, “Do you like him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not particularly. He does his duties passably well. I took him into my counting-room to oblige his father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he is the thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To tell the truth I would sooner have suspected him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he cleared himself from suspicion?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was the first to suggest a search.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precisely the thing he would have done, if he had placed the bill in Paul\u0027s pocket. Of course he would know that the search must result favorably for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is something in that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Besides, what could have been more foolish, if Paul wished to hide the money, than to multiply his chances of detection by hiding it in two different places, especially where one was so obvious as to afford no concealment at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Admitting this to be true, how am I to arrive at the proof of Paul\u0027s innocence?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My own opinion is, that George Dawkins has the greater part of the money stolen. Probably he has taken it for some particular purpose. What it is, you may learn, perhaps, by watching him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will be guided by your suggestion. Nothing would afford me greater pleasure than to find that I have been mistaken in assuming Paul\u0027s guilt, though on evidence that seemed convincing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This conversation took place at the dinner-table. Mr. Danforth understood that no time was to be lost if he expected to gain any information from the movements of his clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n George Dawkins had ventured upon a bold act, but he had been apparently favored by fortune, and had succeeded. That he should have committed this crime without compunction could hardly be expected. His uneasiness, however, sprang chiefly from the fear that in some way he might yet be detected. He resolved to get rid of the money which he had obtained dishonestly, and obtain back from Duval the acknowledgment of indebtedness which he had given him.\n\u003c/div\u003e \n\u003cdiv\u003e\n You will perhaps ask whether the wrong which he had done Paul affected him with uneasiness. On the contrary, it gratified the dislike which from the first he had cherished towards our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am well rid of him, at all events,” he muttered to himself, “that is worth risking some thing for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When office hours were over Dawkins gladly threw down his pen, and left the counting-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n He bent his steps rapidly towards the locality where he had before met Duval. He had decided to wait some time before meeting that worthy. He had to wait till another day, when as he was emerging from the tavern he encountered the Frenchman on the threshold.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aha, my good friend,” said Duval, offering his hand, which Dawkins did not appear to see, “I am very glad to see you. Will you come in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I have not time,” said Dawkins, shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you brought me my money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aha, that is well. I was just about what you call cleaned out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you my note with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Duval fumbled in his pocket-book, and finally produced the desired document.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must have the money first,” said the Frenchman, shrewdly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take it,” said Dawkins contemptuously. “Do you judge me by yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He tore the note which he received into small pieces, and left Duval without another word.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sheltered by the darkness, Mr. Danforth, who had tracked the steps of Dawkins, had been an unseen witness of this whole transaction.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2993/82587.html","bookId":319,"creation":"Aug 2, 2019 3:13:50 AM","modification":"Aug 2, 2019 3:13:50 AM"}
