{"id":10577,"no":35,"title":"XXXIV. HOW PAUL GOES BACK TO WRENVILLE.","content":"\u0026nbsp;While \u0027Squire Conant was speaking, Paul formed a sudden resolution. He remembered that Aunt Lucy Lee was a sister of \u0027Squire Conant. Perhaps, in his present frame of mind, it might be possible to induce him to do something for her. \n\u003cdiv\u003e\n “I believe I am acquainted with a sister of yours, \u0027Squire Conant,” he commenced.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha!” exclaimed the \u0027Squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Lucy Lee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” was the slow reply; “she is my sister. Where did you meet her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the Wrenville Poorhouse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long ago?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About six years since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is she there, still?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. Since I have been in New York, I have heard from her frequently. I am going from here to visit her. Have you any message, sir? I am sure she would be glad to hear from you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She shall hear from me,” said the \u0027Squire in a low voice. “Sit down, and I will write her a letter which, I hope, will not prove unwelcome.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes afterwards he handed Paul an open letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may read it,” he said, abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have been a better friend to my sister than I. You shall witness my late reparation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The letter was as follows:——\n\u003c/div\u003e \n\u003cdiv\u003e\n CEDARVILLE, JAN 13, 18—. MY DEAR SISTER:—\n\u003c/div\u003e \n\u003cdiv\u003e\n I hope you will forgive me for my long neglect. It is not fitting that while I am possessed of abundant means you should longer remain the tenant of an almshouse. I send you by the bearer of this note, Paul Prescott, who, I understand, is a friend of yours, the sum of three hundred dollars. The same sum will be sent you annually. I hope it will be sufficient to maintain you comfortably. I shall endeavor to call upon you soon, and meanwhile remain, Your affectionate brother,\n\u003c/div\u003e \n\u003cdiv\u003e\n EZEKIEL CONANT.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul read this letter with grateful joy. It seemed almost to good to be true. Aunt Lucy would be released from the petty tyranny of Mrs. Mudge\u0027s household, and perhaps—he felt almost sure Aunt Hester would be willing to receive her as a boarder, thus insuring her a peaceful and happy home in her declining years.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, sir,” said he, seizing \u0027Squire Conant\u0027s hand, “you cannot tell how happy you have made me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is what I ought to have done before. Here is the money referred to in the letter,—three hundred dollars,—mind you don\u0027t lose it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take every care, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may tell my sister that I shall be happy to have her write me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul left \u0027Squire Conant\u0027s house, feeling that he had great cause for joy. The \u0027Squire\u0027s refusal to receive more than half the debt, left him master of over three hundred dollars. But I am not sure whether he did not rejoice even more over the good fortune which had come to Aunt Lucy Lee, whose kindness to him, in his unfriended boyhood, he would ever hold in grateful remembrance. He enjoyed in anticipation the joy which he knew Aunt Lucy would feel when the change in her fortunes was communicated to her. He knew also how great would be the chagrin of Mr. and Mrs. Mudge, when they found that the meek old lady whom they hated was about to be rescued from their clutches. On the whole, Paul felt that this was the happiest day of his life. It was a satisfaction to feel that the good fortune of his early friend was all due to his own intercession.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was able to take the cars to a point four miles distant from Wrenville. On getting out on the platform he inquired whether there was a livery stable near by. He was directed to one but a few rods distant. Entering he asked, “Can you let me have a horse and chaise to go to Wrenville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said the groom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me have the best horse in the stable,” said Paul, “and charge me accordingly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said the groom, respectfully, judging from Paul\u0027s dress and tone that he was a young gentleman of fortune.\n\u003c/div\u003e \n\u003cdiv\u003e\n A spirited animal was brought out, and Paul was soon seated in the chaise driving along the Wrenville road. Paul\u0027s city friends would hardly have recognized their economical acquaintance in the well-dressed young man who now sat behind a fast horse, putting him through his best paces. It might have been a weakness in Paul, but he remembered the manner in which he left Wrenville, an unfriended boy, compelled to fly from persecution under the cover of darkness, and he felt a certain pride in showing the Mudges that his circumstances were now entirely changed. It was over this very road that he had walked with his little bundle, in the early morning, six years before. It seemed to him almost like a dream.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length he reached Wrenville. Though he had not been there for six years, he recognized the places that had once been familiar to him. But everything seemed to have dwindled. Accustomed to large city warehouses, the houses in the village seemed very diminutive. Even \u0027Squire Benjamin Newcome\u0027s house, which he had once regarded as a stately mansion, now looked like a very ordinary dwelling.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he rode up the main street of the village, many eyes were fixed upon him and his carriage, but no one thought of recognizing, in the well-dressed youth, the boy who had run away from the Wrenville Poorhouse.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2993/82590.html","bookId":319,"creation":"Aug 2, 2019 3:13:57 AM","modification":"Aug 2, 2019 3:13:57 AM"}
