{"id":70815,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSilence filled the cab—not comfortable silence.\u003c/p\u003e\n\u003cp\u003eBrandt gently said, “Talk to me.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can do this, Brandt.”\u003c/p\u003e\n\u003cp\u003eHe paused a second. “Okay. I appreciate your honesty.”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“But I don’t know if a few hours is enough to make a decision. Especially if all you’ve had with him are a few bad hours.”\u003c/p\u003e\n\u003cp\u003e“How long did it take you to decide to ask me to help you with Landon’s care?”\u003c/p\u003e\n\u003cp\u003eHe mumbled something.\u003c/p\u003e\n\u003cp\u003e“Say what?”\u003c/p\u003e\n\u003cp\u003e“Three days. Three very long days when I second and third guessed this from every possible angle and…I still ain’t sure I did the right thing.”\u003c/p\u003e\n\u003cp\u003eThat admission surprised her.\u003c/p\u003e\n\u003cp\u003e“Every one of my McKay cousins showed up this morning and that’s a rare thing, trust me.”\u003c/p\u003e\n\u003cp\u003eJessie frowned. “Why? Is there something going on with the ranch?”\u003c/p\u003e\n\u003cp\u003e“There’s always something goin’ on, but I usually hear about it long after it’s happened. Dad ain’t real good about keepin’ me informed, which pisses me off because I’ve been doin’ every damn thing he’s ever asked and he still has all the control and never lets me forget it.” He inhaled. Exhaled. “Sorry. That’s twice I’ve gone off about it today. For once my cousins showing up didn’t have nothin’ to do with the ranch.\u003c/p\u003e\n\u003cp\u003eThey came because of Landon. But mostly because of you.”\u003c/p\u003e\n\u003cp\u003eHer gut clenched. “Me? Why?”\u003c/p\u003e\n\u003cp\u003e“They asked why I didn’t come to them first and ask for help.”\u003c/p\u003e\n\u003cp\u003eNo surprise the McKay’s circled the wagons around one of their own. “What’d you say?”\u003c/p\u003e\n\u003cp\u003eBrandt sighed, pushing his hat back to rub his forehead. “I didn’t know what to say. It pissed me off a little, to be honest. Because of the…family dynamic between my dad and his brothers, it’d make things ten times worse for everyone if I’d asked one of Uncle Carson’s, or Uncle Cal’s, or Uncle Charlie’s sons or daughters-in-law to help.”\u003c/p\u003e\n\u003cp\u003eShe weighed aspects of this situation she hadn’t considered. “Is it a family pride thing?”\u003c/p\u003e\n\u003cp\u003e“Jess—”\u003c/p\u003e\n\u003cp\u003e“It’s not a nosy question. Maybe for the first time I understand why you involved me—because I’m neutral. The lesser of two evils. You knew your dad would prefer to have me, who he’s never liked, helping out with Landon, rather than taking his brothers’ or his nephews’ charity.” Another thing occurred to her.\u003c/p\u003e\n\u003cp\u003e“And you don’t want your McKay relatives knowing you don’t think your father would be a fit guardian for Landon, even temporarily.”\u003c/p\u003e\n\u003cp\u003e“But it’s more about how they view my mom and not my dad.”\u003c/p\u003e\n\u003cp\u003eLogical, sweet Brandt. Sparing his mother’s feelings. Figuring out every contingency before he made a single move. It used to drive Luke crazy, since Luke was the impulsive one.\u003c/p\u003e\n\u003cp\u003eAnd look what happened to him.\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m a bastard.”\u003c/p\u003e\n\u003cp\u003e“No. You’re just a good guy who’s been put in a no win situation and you’re trying to make everyone happy.” Jessie had circled back to her house. She braked and turned into her driveway.\u003c/p\u003e\n\u003cp\u003eBrandt said nothing until after she’d parked. Then he faced her with such a look of misery her breath caught. “You’re wrong about me, Jessie. I’m not a good guy. I’m selfish. You were always my first choice.\u003c/p\u003e\n\u003cp\u003eAlways. Even when I knew this would hurt you like nothin’ else, I still went ahead and demanded this of you anyway. And I have to live with knowing when this is done, you’ll probably hate me and I’ll deserve it.”\u003c/p\u003e\n\u003cp\u003eHe jumped out and hefted a still sleeping Landon into his arms before she could formulate a response.\u003c/p\u003e\n\u003cp\u003eThree hours later, Jessie couldn’t believe the change in Landon. He played quietly with his toys on the floor, although he never ventured very far from Brandt. Happy as she was that he wasn’t screaming, she worried his adjustment at the daycare would take longer if was subjected to continual quiet instead of chaos. After she popped the casserole in the oven, she returned to the living room where Brandt was working on his laptop.\u003c/p\u003e\n\u003cp\u003eHe glanced up and smiled.\u003c/p\u003e\n\u003cp\u003eMercy. That smile of his could knock her for a loop.\u003c/p\u003e\n\u003cp\u003eSince when? Her practical side demanded.\u003c/p\u003e\n\u003cp\u003eSince always, her feminine side countered.\u003c/p\u003e\n\u003cp\u003eWhen she didn’t respond, that roguish smile died. “What?”\u003c/p\u003e\n\u003cp\u003e“Nothing. You just look so studious. I’m not used to it.”\u003c/p\u003e\n\u003cp\u003eLandon pushed to his feet and ran to Brandt, possessively wrapping his arm around Brandt’s thigh.\u003c/p\u003e\n\u003cp\u003eJessie shook her head. “He’s really afraid I’m gonna take him away from you, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“He’ll get used to you. I’m just the only familiar thing in his world right now.”\u003c/p\u003e\n\u003cp\u003e“How many times did you see him before his mother went to jail?”\u003c/p\u003e\n\u003cp\u003eHe shrugged and continued looking at Landon. “I stopped by about twice a week. Sometimes Samantha needed a break from bein’ a single parent and I’d take him off her hands for a couple of hours.\u003c/p\u003e\n\u003cp\u003eOther times she just needed someone to talk to. Either way, I ended up hangin’ out with him.”\u003c/p\u003e\n\u003cp\u003eAn unfamiliar, sharp pang arose. For the first time Jessie wondered if Brandt might’ve developed feelings for Landon’s mother.\u003c/p\u003e\n\u003cp\u003e“Jessie. Look at me.”\u003c/p\u003e\n\u003cp\u003eShe met his gaze.\u003c/p\u003e\n\u003cp\u003e“You’re not doin’ anything wrong with him. Give him more than a day to get used to you.”\u003c/p\u003e\n\u003cp\u003eShe was relieved Brandt hadn’t picked up on the real reason for her worry. Especially since she didn’t understand why it’d caused a spark of jealousy. “I’m going out to feed the horses and the llamas.”\u003c/p\u003e\n\u003cp\u003e“Do you need help?”\u003c/p\u003e\n\u003cp\u003e“Nah. I’m used to doing everything myself.”\u003c/p\u003e\n\u003cp\u003eA guilty look flashed in his eyes. “How are the llamas?”\u003c/p\u003e\n\u003cp\u003e“Lucy and Ethel are great. But they’d like male attention. They miss their mates. And their babies.”\u003c/p\u003e\n\u003cp\u003eJessie hated selling her male llamas and Lucy and Ethel’s last babies. But they’d been raised specifically to work cattle and were easily bored and got into trouble if they didn’t have a herd to protect. A bored llama was a dangerous llama. Luckily Lucy and Ethel had half a dozen horses to run with, but they had escaped a few times, probably looking for intimate male companionship.\u003c/p\u003e\n\u003cp\u003eYou’d like some intimate male companionship too.\u003c/p\u003e\n\u003cp\u003eWhat the hell was wrong with her today?\u003c/p\u003e\n\u003cp\u003e“Those baby llamas were awful cute,” Brandt said.\u003c/p\u003e\n\u003cp\u003e“Someday I’ll have babies, but not now. The timing is all wrong.”\u003c/p\u003e\n\u003cp\u003eBrandt frowned.\u003c/p\u003e\n\u003cp\u003e“I’ll be back in a bit.”\u003c/p\u003e\n\u003cp\u003eJessie slipped on her coveralls, her ratty old Carhartt coat, her leather gloves, and her ridiculous looking, but very warm, Elmer Fudd hat. She tugged on the waterproof work boots, whistled for Lexie and was out the door.\u003c/p\u003e\n\u003cp\u003eI’m used to doing everything myself.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a shot at him, but Brandt still felt guilty. In the six months before Luke died, he’d passed a lot of his ranch responsibilities to Jessie. Jessie already had her hands full taking care of the horses, Luke expected she’d learn every aspect of being a ranch wife and worked her to the bone.\u003c/p\u003e\n\u003cp\u003eWhich was why Brandt, Tell and Dalton had become so enraged when his father kicked Jessie out of the home she and Luke shared. After Jessie turned down Brandt’s offer to live in his house, which he owned free and clear, he’d scrambled to find Jessie a place where she could bring her horses and llamas. It pained him to think she’d still had to give up some of them up.\u003c/p\u003e\n\u003cp\u003eWhen he didn’t feel Landon clinging to his leg, he glanced at the boy standing by the door. The kid only cared about the dog, and running free outside as he chased the dog, so maybe fresh air would do him good. “Wanna go outside and see the llamas?”\u003c/p\u003e\n\u003cp\u003eLandon just stared at him.\u003c/p\u003e\n\u003cp\u003e“It’d be nice if you could talk. Or at least try to talk.”\u003c/p\u003e\n\u003cp\u003eBut when Brandt grabbed his coat off the peg, Landon seemed to grasp Brandt’s intention. He didn’t fuss at all when Brandt bundled him up. But his winter wear options were sorely lacking and the kid needed snow boots and snow pants.\u003c/p\u003e\n\u003cp\u003eNo snow covered the ground today, although it was cold and the wind blew like a bitch. He blocked the worst of the wind from Landon’s face as he carried him to the fence.\u003c/p\u003e\n\u003cp\u003eJessie was in the pasture with the llamas. They were intent on whatever she was talking to them about, until they noticed Brandt and Landon.\u003c/p\u003e\n\u003cp\u003eGiven the way Landon was scared of everything, it surprised him that the boy reached over the fence to touch the animals. “Whoa, buddy, wait a second. Let’s make sure it’s okay.” Brandt looked at Jessie.\u003c/p\u003e\n\u003cp\u003eShe said, “As long as you hold him, it should be all right.” She spoke to the llamas in a lilting tone, and Brandt had a moment of jealousy. What would it be like to have Jessie murmuring to him like that?\u003c/p\u003e\n\u003cp\u003ePure heaven.\u003c/p\u003e\n\u003cp\u003eLandon shrieked, “Goggie!” and Lexie bounded away, her doggie body language said, Ha ha, you can’t catch me now, sucker.\u003c/p\u003e\n\u003cp\u003eBrandt laughed. For some reason Brandt’s laughter made Landon giggle.\u003c/p\u003e\n\u003cp\u003eJessie grinned. “This is much better than earlier today.”\u003c/p\u003e\n\u003cp\u003e“No doubt.”\u003c/p\u003e\n\u003cp\u003eShe wrapped her arm around a llama’s neck and urged her closer. “This is Lucy. She is far too curious for her own good.” She looked at Landon and held out her hand, palm up.\u003c/p\u003e\n\u003cp\u003eHe blinked at her and frowned. But he watched her.\u003c/p\u003e\n\u003cp\u003eShe reached in her pocket and pulled out a chunk of carrot. She opened her palm, put the carrot in the center and held it out to Lucy.\u003c/p\u003e\n\u003cp\u003eLucy sniffed and lowered her head over the carrot, bringing it into her mouth.\u003c/p\u003e\n\u003cp\u003e“See? You wanna feed Ethel? You’ve gotta do the same thing. Just like this.” She explained the whole process again. Landon held his hand out, exactly the way Jessie instructed.\u003c/p\u003e\n\u003cp\u003eBrandt was blown away by her patience, showing Landon every step, speaking to him softly, but not in a baby-talk voice. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-13.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
