{"id":70823,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe couldn’t stop himself from sweeping her hair from her face, then gently running the back of his knuckles from her temple to her chin. This woman who’d given so much, wanted to give more. “No. This was for you. I did it because I wanted to, Jessie. I enjoyed it, but I don’t expect anything in return.”\u003c/p\u003e\n\u003cp\u003eHer eyes softened. So did her body.\u003c/p\u003e\n\u003cp\u003eAs much as he wanted to stay…That was his cue to leave.\u003c/p\u003e\n\u003cp\u003eBrandt scooted backward on his hands and his knees until he was off the bed and his feet touched the floor. “I’ll get up with Landon tonight if need be.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“Get some sleep. See you in the morning.”\u003c/p\u003e\n\u003cp\u003eHe made it to the door before she said anything.\u003c/p\u003e\n\u003cp\u003e“Brandt?”\u003c/p\u003e\n\u003cp\u003e“Mmm?”\u003c/p\u003e\n\u003cp\u003e“How did you know my ticklish spots?”\u003c/p\u003e\n\u003cp\u003e“I didn’t. But I sure do know them all now.”\u003c/p\u003e\n\u003cp\u003eShe laughed, a little huskily, and said, “Oh, you don’t know all of them.”\u003c/p\u003e\n\u003cp\u003eDamn. Was that…suggestive?\u003c/p\u003e\n\u003cp\u003e“Goodnight.”\u003c/p\u003e\n\u003cp\u003eAs Brandt tossed and turned on the couch, he replayed every second of their interaction. Twice. At the end of the third dissection, he’d determined Jessie probably wouldn’t rebuff his sexual advances this time.\u003c/p\u003e\n\u003cp\u003eWhile that possibility caused a gnawing feeling of anticipation in his gut and made his dick stir with interest, it also served as a warning. He’d have to wait for Jessie to approach him about making a change in their relationship. Not because he intended to punish her for turning him down previously, nor did he want her to beg, but he had to be one hundred percent certain it was a change she initiated—not a change she was reacting to if he suggested they become lovers.\u003c/p\u003e\n\u003cp\u003eIt’d be hard as hell to wait. But he would, because he knew taking that next step, a permanent one in his mind, would definitely be worth the wait.\u003c/p\u003e\n\u003cp\u003e“I think your best option is just to walk up to him, stark naked and say, Ride me, cowboy hottie.”\u003c/p\u003e\n\u003cp\u003eJessie glanced up from tying a bag of garbage. “You cannot be serious, Simone.”\u003c/p\u003e\n\u003cp\u003e“What’s the problem? It’s direct.”\u003c/p\u003e\n\u003cp\u003e“A little too direct.”\u003c/p\u003e\n\u003cp\u003e“Girlfriend, ain’t no man gonna turn and run when faced with a sexy, naked, willing woman such as yourself. Trust me on this.”\u003c/p\u003e\n\u003cp\u003eProblem was, Jessie had seen a man turn and run when faced with her naked, willing self. Well, in Mike’s case it was more like he fell down and passed out, but still, it’d happened.\u003c/p\u003e\n\u003cp\u003e“Trust Simone on what, Jessie?” Skylar asked.\u003c/p\u003e\n\u003cp\u003eCrap. She blushed. “Oh, nothing.”\u003c/p\u003e\n\u003cp\u003eSimone harrumphed and said, “Later,” leaving her alone with Skylar.\u003c/p\u003e\n\u003cp\u003eThanks, Simone.\u003c/p\u003e\n\u003cp\u003eJessie spent an extra long time securing a knot in the plastic garbage bag, hoping Skylar would leave.\u003c/p\u003e\n\u003cp\u003e“I have a confession to make,” Skylar said, moving in closer.\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“I overheard your conversation with Simone.”\u003c/p\u003e\n\u003cp\u003eJessie looked at her boss. “Which part?”\u003c/p\u003e\n\u003cp\u003e“The ride me, cowboy hottie part. I’m assuming she meant Brandt.”\u003c/p\u003e\n\u003cp\u003e“Yes, but it’s not what you think.” Liar.\u003c/p\u003e\n\u003cp\u003e“So you’re not planning on riding him into your bed?”\u003c/p\u003e\n\u003cp\u003eDon’t blush. “I am. It’s just…” A whole new possibility to me and I’m flustered with you grilling me about my plans. “I imagine you want to talk me out of it.”\u003c/p\u003e\n\u003cp\u003eSkylar shook her head. “Exactly the opposite.”\u003c/p\u003e\n\u003cp\u003eJessie wasn’t expecting that.\u003c/p\u003e\n\u003cp\u003e“Look, although our situations aren’t similar, in some ways they are. I sprang a surprise baby on Kade. He moved in to help me take care of her. I insisted we just be friends and parenting partners, nothing else, meaning absolutely no way, no how, was I having sex with him.”\u003c/p\u003e\n\u003cp\u003e“How long did that last?”\u003c/p\u003e\n\u003cp\u003eSkylar smirked. “You’ve seen my husband. So, oh, about two weeks before we were getting naked together at every opportunity. I hope this isn’t too much information, but I wanted to let you know, I’ve been exactly where you are. And I almost let the best thing that ever happened to me get away because I was afraid to take a chance.”\u003c/p\u003e\n\u003cp\u003eKade and Skylar had a nauseatingly perfect marriage, so Jessie doubted the truth to that statement.\u003c/p\u003e\n\u003cp\u003e“Like you, I had past relationship issues to work through. Like Brandt, Kade had family issues to work through. I wasn’t sure if Kade wanted me, or if he only cared about me because of Eliza.”\u003c/p\u003e\n\u003cp\u003eOkay. So that did sound a little familiar.\u003c/p\u003e\n\u003cp\u003e“The point I’m trying to make? Brandt is a great guy. He’s crazy about you. I know you’re crazy about him, too, and well, it wouldn’t be the worst thing in the world if you two got to know each other on a whole new level, would it?”\u003c/p\u003e\n\u003cp\u003e“No. But this…situation with Landon isn’t permanent. I don’t want it to be permanent. But Brandt wouldn’t mind if it was. So can I start something with him knowing I’ll have to walk away?”\u003c/p\u003e\n\u003cp\u003e“The better question is: how can you be willing to walk away from him now and not be willing to take a chance that you might never have to walk away from him?”\u003c/p\u003e\n\u003cp\u003eFor the psychoanalytical slant she used to make her statement, Skylar could’ve just said, you’ll never know unless you try. Jessie smiled. “Thanks, Skylar. I appreciate your candor.”\u003c/p\u003e\n\u003cp\u003e“Good.” At the door, she turned. “For what it’s worth? Simone was dead on. Getting naked always works.”\u003c/p\u003e\n\u003cp\u003eChapter Nine\u003c/p\u003e\n\u003cp\u003e“Landon is down for the count.”\u003c/p\u003e\n\u003cp\u003e“Thank God,” Brandt muttered. “You have the magic touch. I swear the kid looked like he’d punch me in the face if I so much as touched him.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “He’s a little young to start brawling. But he is a McKay, so I wouldn’t be surprised.”\u003c/p\u003e\n\u003cp\u003eBrandt took another pull off his beer and gestured to the couch. “Sit down and take a load off.”\u003c/p\u003e\n\u003cp\u003eJessie paced to the door, peering out the window, cursing her nervous energy. Hah. Who was she trying to kid? She was just plain nervous. This seemed like such an easy idea in the truck on the way home from work. Get naked. But it was two hours later and she still had her clothes on.\u003c/p\u003e\n\u003cp\u003e“Something on your mind?”\u003c/p\u003e\n\u003cp\u003eShe couldn’t un-stick her tongue from the roof of her mouth.\u003c/p\u003e\n\u003cp\u003e“Jess? You know you can tell me anything,” Brandt said.\u003c/p\u003e\n\u003cp\u003eYeah, just spit it out. You turned him down once. What’s to say he won’t do the same to you…just to even the score?\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, trying to slam the door on the self-sabotaging portion of her brain. “This…the way we’ve got this set up isn’t working for me any longer.”\u003c/p\u003e\n\u003cp\u003eHe exhaled a frustrated burst of air. “Okay. What’s the problem?”\u003c/p\u003e\n\u003cp\u003e“I’m tired—”\u003c/p\u003e\n\u003cp\u003e“We both are. That said, I can probably pick Landon up earlier and take him back here until after you get off work so it’s not—”\u003c/p\u003e\n\u003cp\u003e“This isn’t about Landon. It’s about…us.”\u003c/p\u003e\n\u003cp\u003e“Us?” he repeated.\u003c/p\u003e\n\u003cp\u003e“Yes, us. Living in the same space. Sharing everything.”\u003c/p\u003e\n\u003cp\u003eAnother one of his thoughtful pauses. “I’ve tried to keep to myself and not cause you extra stress.”\u003c/p\u003e\n\u003cp\u003eJessie whirled to face him. “That’s what’s not working, Brandt. I am stressed and it’s because you’re everywhere. In every part of my life. In every part of my house. We eat together. We do chores together.\u003c/p\u003e\n\u003cp\u003eWe take care of Landon together. We watch TV together. You’re the first person I see when I get up in the morning and you’re the last person I see before I go to bed at night. We’re acting like a married couple.”\u003c/p\u003e\n\u003cp\u003eThe muscles in his jaw rippled and he gritted out, “And that bothers you?”\u003c/p\u003e\n\u003cp\u003e“Yes, dammit, because we’re doing all the hard day-to-day couple stuff without the benefit of the good couple stuff.”\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“We’re not sleeping together. And if we’re gonna act like a married couple then I want you naked in my bed every night.”\u003c/p\u003e\n\u003cp\u003eBrandt’s mouth dropped open so fast Jessie swore she heard his jawbone crack. Then his eyes tapered to fine points and his entire posture changed. “Since when?”\u003c/p\u003e\n\u003cp\u003e“You want an exact moment? How about last night when you gave me a backrub? I wanted you to stay with me all night and rub more than just my back. I know you’re probably thinking I’m crazy since I freaked out last year when you told me you wanted more than friendship.”\u003c/p\u003e\n\u003cp\u003e“What’s changed?”\u003c/p\u003e\n\u003cp\u003e“Honestly? Me.” Jessie briefly closed her eyes. “I’m not as emotionally raw as I was even four months ago. I’ve also realized I don’t want to spend my life unwilling to take a chance because I’m scared.”\u003c/p\u003e\n\u003cp\u003e“I scare you?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eEmbarrassment flickered on his face.\u003c/p\u003e\n\u003cp\u003e“You don’t scare me physically. There’s an intensity to you that is intimidating as hell. There are no half measures in your world, Brandt. It’s all or nothing. Being with a man like you would be unlike anything I’ve ever experienced.”\u003c/p\u003e\n\u003cp\u003eThat muscle in his jaw continued to jump in an agitated manner. “How do you know that?”\u003c/p\u003e\n\u003cp\u003eNow that she was floundering, she realized getting naked in body was a helluva lot easier than stripping herself emotionally bare in front of him.\u003c/p\u003e\n\u003cp\u003e“Jessie. Answer me.”\u003c/p\u003e\n\u003cp\u003e“I figured it out last summer when you warned me about Mike, but you didn’t pull that highhanded McKay attitude and drag me out of there. Even though that situation ended in my humiliation, the way you forced me to accept the consequences of my rash decision proved you weren’t the gentleman I thought you were. But you didn’t leave. I know you wanted to finish what Mike couldn’t. But I was too—”\u003c/p\u003e\n\u003cp\u003e“Shitfaced?” he supplied with a soft snarl.\u003c/p\u003e\n\u003cp\u003e“No, I was too mortified you’d witnessed yet another man who found me as sexually lacking as my husband had,” she said without flinching. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-21.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
