{"id":70824,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut Brandt flinched. “Jessie that’s not—”\u003c/p\u003e\n\u003cp\u003e“True? Yes, it is. Yet, I know you would’ve tossed me a pity fuck if I’d asked.”\u003c/p\u003e\n\u003cp\u003eThat shocked him. But he recovered quickly. “You sure?”\u003c/p\u003e\n\u003cp\u003e“No. I’m not sure of anything. Except I can’t get you out of my head since you’ve moved in. All that mundane household shit that oughta be boring and I hated doing by myself? I look forward to doing it with you. Even when you’re driving me crazy with lust.”\u003c/p\u003e\n\u003cp\u003e“Crazy with lust?” His dark eyebrows winged up. “That’s a stretch, ain’t it?”\u003c/p\u003e\n\u003cp\u003eHis skepticism might’ve sent old Jessie scurrying to her room to hide. But new Jessie soldiered on.\u003c/p\u003e\n\u003cp\u003e“Every night after you get out of the shower and the scent of your shaving cream drifts out of the bathroom I fantasize about you rubbing your face and that scent over every inch of my skin.”\u003c/p\u003e\n\u003cp\u003eSurprise and something else like…desire flashed in his eyes, which spurred her to keep going.\u003c/p\u003e\n\u003cp\u003e“Sometimes when you’re talking to me? I’m so busy staring at your mouth, imagining your kiss that I don’t hear a single word you say.”\u003c/p\u003e\n\u003cp\u003eWith that, his surprise changed to recognition. So Brandt had noticed her attention to his lips whenever they were within kissing distance.\u003c/p\u003e\n\u003cp\u003e“But know what really twists me into knots? Seeing the way you look at me now.”\u003c/p\u003e\n\u003cp\u003e“And how’s that?”\u003c/p\u003e\n\u003cp\u003e“Like you no longer see me as sweet, innocent Jessie. That if you ever got those big hands of yours on me, the last thing you’d be with me…is sweet. You’d get a thrill pushing past my boundaries, the ones I had before Luke and the ones I’ve erected since Luke. You’d derive great pleasure in showing me facets of sexual intimacy that I’ve been denied—or denied myself.”\u003c/p\u003e\n\u003cp\u003e“Fancy talk.” Brandt cocked his head, as if he was trying to study her from a new angle. “I’ll admit, you’ve got me pegged better than I ever thought you would. With one exception.”\u003c/p\u003e\n\u003cp\u003e“Which is?”\u003c/p\u003e\n\u003cp\u003e“If we set this in motion, I’ll demand more than just physical intimacy from you. It ain’t only gonna be about scratching an itch, Jess, because I can get that any time I want.”\u003c/p\u003e\n\u003cp\u003eHow had Brandt picked up on her plan to prove to herself that she could experience sex without the pesky emotional ties?\u003c/p\u003e\n\u003cp\u003eBecause he knows you better than you’ve ever given him credit for.\u003c/p\u003e\n\u003cp\u003e“I’ll expect a different kind of intimacy than what we’ve had in the past. A connection between us that has nothin’ to do with Luke.”\u003c/p\u003e\n\u003cp\u003eShe looked away.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“It’s a nice thought, but this connection has everything to do with Luke and there’s no way we can ever get around that. Besides, you brought Landon into my life, Brandt, and he’s connected to Luke. We wouldn’t be in this situation if not for him. And maybe Landon’s presence has forced us to deal with this-”\u003c/p\u003e\n\u003cp\u003eshe gestured to the space between them, “—so I’m done denying the pull is there.”\u003c/p\u003e\n\u003cp\u003e“Is this ‘pull’ something you recently realized? A proximity thing? I’m a man, I’m here, I’m good enough to fuck for a few months?”\u003c/p\u003e\n\u003cp\u003eJessie twisted her fingers together. “It’s more than that and you know it. After you made that pass at me, I convinced myself you were exactly like Luke—biding your time until your charm earned an invitation into my bed. You’d get your fill of me, work me out of your system and move on. And no, you can’t fault me for that mindset, because of my limited experience with men, and my experience with Luke in particular. Plus, I wasn’t so sure you wouldn’t be using me to settle a score with Luke.”\u003c/p\u003e\n\u003cp\u003e“You really think that lowly of me?” he bit off.\u003c/p\u003e\n\u003cp\u003e“You really think I’m a clichéd horny widow desperate to screw the first man who smiles at me?” She didn’t bother to bank the anger in her eyes when she met his glare head on. “If that was true, I wouldn’t have waited two goddamn years, would I? I wouldn’t be asking you to touch me, would I? I could’ve found another man to scratch that itch in the four months since we last saw each other. But I didn’t. Something held me back.”\u003c/p\u003e\n\u003cp\u003e“Again, nice sentiment, but spell it out for me.”\u003c/p\u003e\n\u003cp\u003e“I want no-strings sex for these four months we’re together. At the end of those four months, we’ll walk away.”\u003c/p\u003e\n\u003cp\u003e“Just like that?”\u003c/p\u003e\n\u003cp\u003eBe strong, be confident. “Can’t we try it and see?”\u003c/p\u003e\n\u003cp\u003e“What do we tell people? Because you know my family, they’re gonna ask.”\u003c/p\u003e\n\u003cp\u003e“We are living together, even if it’s temporarily. People are already gonna assume we’re sleeping together, especially in the gossipy McKay family.”\u003c/p\u003e\n\u003cp\u003e“So if Skylar comes right out and asks you if you’re with me? Will you tell her that we’re just fuck buddies?”\u003c/p\u003e\n\u003cp\u003eShe couldn’t confess that Skylar encouraged her to get naked with him. “What would you rather I told her? That we’re attracted to each other, but we’re keeping our hands off each other because it’d be like Luke was in bed with us?”\u003c/p\u003e\n\u003cp\u003eShe’d struck a nerve with that. She hadn’t meant to but there was no sense in apologizing now.\u003c/p\u003e\n\u003cp\u003e“I’m not Luke.”\u003c/p\u003e\n\u003cp\u003e“Then stop acting like him,” she snapped. “Quit trying to tell me what I’m feeling is wrong. I’m being completely honest with you. I’m telling you this because I realized if we start this, I’d own my sexuality for the first time in my life. I want that. With you. Starting tonight.” Jessie took a breath, figuring she’d said enough. Too much probably.\u003c/p\u003e\n\u003cp\u003eHe studied her more intently than she was used to. With an edgy stillness that seemed totally foreign to him.\u003c/p\u003e\n\u003cp\u003eThe longer she stood before him, the more her paranoia built.\u003c/p\u003e\n\u003cp\u003eFinally, Brandt pushed to his feet. His dark eyes remained on hers as he deftly skirted the coffee table and the pile of Landon’s toys. He stopped in front of her, his big hands clenched at his sides. “Starting tonight, but especially this first time, I call the shots. All of them. I own your sexuality. We clear?”\u003c/p\u003e\n\u003cp\u003eTalk about being the big, bad wolf. Jessie nodded.\u003c/p\u003e\n\u003cp\u003e“Say the word so there’s no misunderstanding between us.”\u003c/p\u003e\n\u003cp\u003eShe swallowed and said, “Yes.”\u003c/p\u003e\n\u003cp\u003eBrandt slanted his mouth over hers. But he didn’t kiss her with lust-fueled passion. He drank her in—\u003c/p\u003e\n\u003cp\u003ewith his eyes, with the short, choppy breaths he pulled into his lungs.\u003c/p\u003e\n\u003cp\u003eAlthough Jessie was pretty sure he wanted to take a possessive kiss, he didn’t, which indicated his monumental control.\u003c/p\u003e\n\u003cp\u003eHis tongue darted out and slid along the plump inside curve of her bottom lip. A leisurely, sensuous glide across the sensitive flesh that caused her mouth to tremble even as her lips parted in invitation. But he didn’t dive in for a greedy, openmouthed kiss. He lightly swept his damp lips over hers. Repeatedly. Male hunger and hot breath, tempered with softness that was unlike anything she’d ever experienced.\u003c/p\u003e\n\u003cp\u003eHe gauged her responses and inched closer, but didn’t allow their bodies to touch. Heat shimmered between them.\u003c/p\u003e\n\u003cp\u003eJessie actually felt dizzy from want. What would he do if she fisted her hands in his T-shirt and just took the kiss she craved? His warning, This first time, I call the shots, forced her to truly surrender to him.\u003c/p\u003e\n\u003cp\u003eAnd that’s when Brandt kissed her.\u003c/p\u003e\n\u003cp\u003eHoly mother of God did the man lay a kiss on her. His hands framed her face with utmost gentleness as his mouth conquered hers. Dominated. Destroyed. Ignited.\u003c/p\u003e\n\u003cp\u003eAfter several minutes of proving his mastery, Brandt changed the angle of his head, taking the kiss from fiery to flirty. Sucking on her tongue. Nibbling on the very edges of her lips. Kissing the corners of her smile.\u003c/p\u003e\n\u003cp\u003e“Jessie?” he murmured between kisses. “Can you do something for me?”\u003c/p\u003e\n\u003cp\u003eHer head buzzed. She had no idea how her body remained upright when he’d turned her inside out.\u003c/p\u003e\n\u003cp\u003e“Jess? Darlin’? Are you listening?”\u003c/p\u003e\n\u003cp\u003e“Umm. What?”\u003c/p\u003e\n\u003cp\u003e“Hang on.” His hands dropped from her face and he took her arm.\u003c/p\u003e\n\u003cp\u003eShe thought he was taking her to bed, but he detoured to the couch. She blinked at him. “What are we—”\u003c/p\u003e\n\u003cp\u003e“I’m getting to it.” Brandt curled his hand around her jaw, feathering his thumb across her kiss swollen lower lip. “Take your clothes off.” Her eyes must’ve given away her confusion because he clarified, “I don’t need a striptease. I need you nekkid.”\u003c/p\u003e\n\u003cp\u003eWith shaking fingers, Jessie gripped the edges of her mock turtleneck and tugged it over her head.\u003c/p\u003e\n\u003cp\u003eHe’d seen her naked before, but her whole body flushed with color anyway.\u003c/p\u003e\n\u003cp\u003eBrandt didn’t help with her clothing removal, besides the heat in his eyes urging her to hurry.\u003c/p\u003e\n\u003cp\u003eNext she unhooked her bra, tossing it on the floor. She yanked to release the button on her jeans.\u003c/p\u003e\n\u003cp\u003eBrandt’s hand shot out and held her shoulder as she shimmied the denim down her legs. She’d hooked a finger in each side of her black lace panties, when Brandt’s rough hand covered hers, forcing her to look at him.\u003c/p\u003e\n\u003cp\u003e“Those are mine.” He gently pushed her onto the couch.\u003c/p\u003e\n\u003cp\u003eThe tweed fabric scratched her skin. Weird to think she’d never sat naked on this couch before now.\u003c/p\u003e\n\u003cp\u003eLeather probably would’ve been a better furniture choice.\u003c/p\u003e\n\u003cp\u003eThis is not the time to contemplate home furnishing mistakes. Look at Brandt, dummy, not the weaving pattern in the fabric.\u003c/p\u003e\n\u003cp\u003e“What are you thinkin’ about so hard?”\u003c/p\u003e\n\u003cp\u003e“Not thinking about anything but you, Brandt.”\u003c/p\u003e\n\u003cp\u003e“Such pretty words from such a pretty mouth.” He used the tip of his finger to trace the contours of her lips. “Do you have any idea how jealous I was that night at the lake? Seein’ you on your knees in front of that little fucking prick, Mike?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember much from that part of the night.”\u003c/p\u003e\n\u003cp\u003e“I do, and I wanna erase that mental image of you with another man’s cock in your throat. All I want to remember is the image of my cock in your throat. Your mouth on my dick.” Brandt unbuckled his belt and unzipped his jeans. Eased both to the floor without losing eye contact with her. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-22.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
