{"id":70805,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe couldn’t believe Jessie had kept the wallet. She’d seemed embarrassed when she’d opened his present. Too late Brandt learned such a labor-intensive gift was appropriate for a girlfriend. Or a lover. Or a wife. None of which Jessie was to him. Luke had been a real prick about it, too, teasing him mercilessly.\u003c/p\u003e\n\u003cp\u003eRagging on Jessie. They’d both ignored Luke, and Brandt figured Jessie had probably thrown it out to keep the peace with her husband. Warmth expanded in his chest even as he called himself ten kinds of fool for feeling that spark of pleasure.\u003c/p\u003e\n\u003cp\u003eHe scrutinized the inside of the truck cab for anything else that might belong to her before he zipped up the purse and jogged back to his pickup.\u003c/p\u003e\n\u003cp\u003eJessie had wedged herself in the corner. Relief swept over her when he tossed the purse in her lap.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You wanna check to see if anything is missing?”\u003c/p\u003e\n\u003cp\u003e“No. Just take me home.”\u003c/p\u003e\n\u003cp\u003eHe let her be, even when he wanted to assure her that Mike’s reaction was a result of booze and pot, not a reaction to her. They’d barely driven two miles when he heard Jessie sniffle. Brandt glanced over at her. “Jess. Baby. Please. Don’t cry. I swear to God you’re killin’ me here.”\u003c/p\u003e\n\u003cp\u003eHer voice was a raw rasp. “Chin up, buck up, right? Be strong, be tough. Don’t snivel. No man likes a crybaby. Yeah. I know. I’ve heard that a time or fifty.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t what he’d meant and her response jabbed that raw wound in his gut again. Before he could explain, Jessie said, “Do you wanna know something? Tonight was supposed to be ‘the night’ when I’d finally…” She sniffled again. “God. How pathetic is it that I had to build up my courage to do it and this is how it turned out? How fucking pathetic that I’m twenty-seven years old and I haven’t been with any man besides Luke?”\u003c/p\u003e\n\u003cp\u003e“Ever?” spewed out of his mouth before he could stop it. Brandt knew Jessie hadn’t dated at all during the year they grieved together over Luke. But he hadn’t expected she’d stayed celibate during the months he hadn’t seen her, especially since he’d heard she’d been out, hitting the local honky-tonks.\u003c/p\u003e\n\u003cp\u003eIt burned his ass to think her experience with that little fucking prick Mike was her first foray into reclaiming a sexual part of herself.\u003c/p\u003e\n\u003cp\u003eHer soft sigh tempered his anger. “Yes, Luke was my first, my only, but we were married for two years. So I’m not…inexperienced as much as I’m out of practice.”\u003c/p\u003e\n\u003cp\u003eBrandt wanted to tell her to shut up as much as he wanted her to keep talking.\u003c/p\u003e\n\u003cp\u003e“I miss sex. A lot.”\u003c/p\u003e\n\u003cp\u003eShe intended to torture him all right.\u003c/p\u003e\n\u003cp\u003e“Does it make me sound like a horny widow if I admit I want that body-to-body connection? I can get myself off with my vibrator a dozen times a day if I want. But it’s not the same, is it?”\u003c/p\u003e\n\u003cp\u003eI can demonstrate the difference, if you want.\u003c/p\u003e\n\u003cp\u003eShe was quiet for a minute or so, and Brandt thought she’d fallen asleep. But her voice broke into his thoughts.\u003c/p\u003e\n\u003cp\u003e“When was the last time you had sex?”\u003c/p\u003e\n\u003cp\u003eIt’d been a few weeks, which didn’t compare to the two years she’d gone without.\u003c/p\u003e\n\u003cp\u003e“So out there in the dating world, does oral sex count as real sex? Because I’m thinking if I didn’t get off, even if he did, then it shouldn’t count as sex.”\u003c/p\u003e\n\u003cp\u003e“I cannot believe we’re havin’ this conversation.” He sensed her studying him, but he kept his eyes on the road.\u003c/p\u003e\n\u003cp\u003e“Well, it is a pretty one-sided conversation, Brandt.” She paused again. “Think Mike will tell everyone we did the nasty?”\u003c/p\u003e\n\u003cp\u003eBrandt snarled, “If he opens his goddamn mouth and says anything to anyone about you, I will track that little fucking prick down and cut his tongue out.”\u003c/p\u003e\n\u003cp\u003e“Oh. That’s sweet. Okay, maybe not sweet, and wow, I never imagined you had such a violent streak, Brandt. It’s kinda scary.”\u003c/p\u003e\n\u003cp\u003eYou have no idea.\u003c/p\u003e\n\u003cp\u003eJessie made a noise that sounded like a choked laugh.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Then again, maybe you’d be doing a service to womankind, cutting out his tongue. Because, man, he really did not know how to use it.”\u003c/p\u003e\n\u003cp\u003eJesus, Mary and Joseph give him strength to survive this discussion with Jessie about oral sex, vibrators, tongues, abstinence and…nope. The devil had taken over his thoughts and was conjuring up some smokin’ hot scenarios, adding in rope for fun.\u003c/p\u003e\n\u003cp\u003eWhen she thrashed to get more comfortable, Brandt looked over to double check she hadn’t wiggled too close to the door handle. He hit the automatic locks as a precaution.\u003c/p\u003e\n\u003cp\u003eAlways looking out for her, aren’t you?\u003c/p\u003e\n\u003cp\u003eSomebody has to.\u003c/p\u003e\n\u003cp\u003eThe rest of the drive might’ve been awkward if she’s kept peppering him with questions about sex and freely offering her own insight. But she either drifted off or pretended to, and Brandt was grateful for the reprieve. Didn’t keep his brain from offering advice in case she suddenly became chatty again.\u003c/p\u003e\n\u003cp\u003eAt the turnoff to her trailer, Jessie stirred. After he parked by her front porch steps, she faced him. Not with a sheepish look, as he expected, but with a resigned look. “Thank you. I’m sorry you had to…” She gestured wildly. “Be party to my humiliation tonight.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t—”\u003c/p\u003e\n\u003cp\u003eShe held up her hand. “It was. And you don’t have to be nice about it. So thank you. Please…now that I’ve had time to think about what an idiot I was, I never want to talk about it again, okay?”\u003c/p\u003e\n\u003cp\u003eBrandt bit back, No, it’s not okay, goddammit, what the hell were you thinking tonight?\u003c/p\u003e\n\u003cp\u003e“In fact, I don’t want any kind of reminder of tonight.”\u003c/p\u003e\n\u003cp\u003eLike he’d ever forget this night.\u003c/p\u003e\n\u003cp\u003e“Get rid of it. Burn it, use it as a rag, I don’t care.”\u003c/p\u003e\n\u003cp\u003eHe refocused on her. “Get rid of what?”\u003c/p\u003e\n\u003cp\u003e“This.” She unwrapped the comforter from around her body and shoved it between them.\u003c/p\u003e\n\u003cp\u003eThen Jessie was as naked as a newborn babe, in the front seat of his truck.\u003c/p\u003e\n\u003cp\u003eOh no. No, no, no.\u003c/p\u003e\n\u003cp\u003eBrandt was so pole-axed he couldn’t make his mouth work when Jessie bounced out of his truck and strolled to her house, wearing nothing but her birthday suit.\u003c/p\u003e\n\u003cp\u003eIf he hadn’t been so busy gawking at her perfectly pear-shaped ass, or if he hadn’t become mesmerized by the sassy way her hair teased the dimples above that perfectly pear-shaped ass, or if he hadn’t been drooling over the way her long-legged strides made that perfectly pear-shaped ass shake so jauntily, he might’ve remembered Jessie had warned him that he didn’t know her as well as he thought he did.\u003c/p\u003e\n\u003cp\u003eWhen she turned in the doorway and blew him a kiss, Brandt realized he should’ve listened to her.\u003c/p\u003e\n\u003cp\u003eHe also understood some things hadn’t changed, namely Jessie’s brotherly feelings toward him. So he’d do as she asked, pretend this night never happened, and continue to stay away from her, as hard as that would be.\u003c/p\u003e\n\u003cp\u003eChapter One\u003c/p\u003e\n\u003cp\u003eFour months later…\u003c/p\u003e\n\u003cp\u003eTalk about being a total chickenshit. Here she was, twenty-seven years old, doing her best wallflower imitation again.\u003c/p\u003e\n\u003cp\u003eStory of your life, Jessie McKay.\u003c/p\u003e\n\u003cp\u003eAt least she’d had the foresight to bring along a couple of beers for company. Or solace. Or courage.\u003c/p\u003e\n\u003cp\u003eJessie swigged from the bottle of Corona as she watched the newlyweds swaying to an old George Strait tune. Keely and Jack fit the love song they’d chosen for their first dance as husband and wife. The happy couple only had eyes for each other, despite repeated attempts from Keely’s assorted male family members to cut in. Although Jack used a charming smile to dissuade interruption, a possessive male lurked beneath his polished demeanor.\u003c/p\u003e\n\u003cp\u003eKeely deserved a man so perfectly suited for her. A man who worshipped her as a strong-willed cowgirl, but clearly was fierce enough to stand up to her—and her family. Because when you married one McKay, somehow you ended up with them all.\u003c/p\u003e\n\u003cp\u003eSo it wasn’t a surprise that Jessie was still considered part of the McKay family. Well, most of the McKays. They’d been supportive after Luke’s death, especially during the first month of shock and grief.\u003c/p\u003e\n\u003cp\u003eShe’d been forced from her home. Forced to find a job. Forced to stand on her own. If it hadn’t been for Luke’s brother Brandt, she might’ve taken the easy way out and driven her truck off a cliff.\u003c/p\u003e\n\u003cp\u003eBut Brandt became her pillar of support. He helped her, no matter if her problem was big or small. He was there for her like a brother would be. Except one night, a year into her widowhood, Brandt had confessed his feelings for her weren’t merely brotherly.\u003c/p\u003e\n\u003cp\u003eAt the time, she’d been shocked. She’d never looked at Brandt in that light. In her heart, in her mind, she would always be Luke’s wife. She hadn’t known how to explain it without sounding delusional.\u003c/p\u003e\n\u003cp\u003eAfter that night, everything changed between them. Brandt stopped coming over. He’d quit answering her calls. In a moment of clarity a month or so later, she realized it was time to let go.\u003c/p\u003e\n\u003cp\u003eIn those soul-searching moments, she’d faced a lot of truths, half-truths and untruths. About herself.\u003c/p\u003e\n\u003cp\u003eAbout Luke. About their marriage. Then she’d taken three steps that helped her move on for good.\u003c/p\u003e\n\u003cp\u003eOne: she’d stopped wearing her wedding ring.\u003c/p\u003e\n\u003cp\u003eTwo: she’d had the McKay “brand” tattoo above her ankle reworked into a butterfly emerging from a cocoon.\u003c/p\u003e\n\u003cp\u003eThree: she’d decided to have a one-night stand with a complete stranger.\u003c/p\u003e\n\u003cp\u003eThe last step had been a biggie. Not only had Luke McKay been her first and only lover, Luke also hadn’t been faithful during their marriage. So she’d needed to prove—if only to herself—that she could attract a lover.\u003c/p\u003e\n\u003cp\u003eWhich was how she’d ended up at the lake last summer when she’d run into Brandt. She hadn’t recognized him at first. She’d never seen Brandt McKay without all his cowboy regalia—boots, jeans, hat.\u003c/p\u003e\n\u003cp\u003eShe’d definitely never seen him shirtless, barefoot, wearing funky board shorts, looking tanned, fit and unbelievably sexy.\u003c/p\u003e\n\u003cp\u003eUpon closer inspection, the baby fat Luke had always teased Brandt about was gone, replaced with muscle. Lots of muscle. He’d hacked off his dark, wavy hair in a military buzz cut style. Goatee? Gone. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-3.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
