{"id":70833,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Billy.”\u003c/p\u003e\n\u003cp\u003eHe gave her an awkward hug. “Glad you could make it.” He glanced over at Brandt. “Luke. Good to see you.”\u003c/p\u003e\n\u003cp\u003eBoth she and Brandt froze.\u003c/p\u003e\n\u003cp\u003eBilly wasn’t aware he’d made a misstep.\u003c/p\u003e\n\u003cp\u003e“Luke died about two years ago, remember? This is Luke’s brother, Brandt McKay. Brandt, this is Billy Reynolds.”\u003c/p\u003e\n\u003cp\u003eThey shook hands.\u003c/p\u003e\n\u003cp\u003e“Sorry about that,” Billy said. “Sometimes I think I’ve landed on my head too many times and my memory is goin’.”\u003c/p\u003e\n\u003cp\u003eOr you don’t give a shit about what’s going on in my life.\u003c/p\u003e\n\u003cp\u003eActing like a ten-year-old much, Jessie?\u003c/p\u003e\n\u003cp\u003eBrandt placed his palm in the small of her back. “Got time to have a Coke or something before you ride, Billy?”\u003c/p\u003e\n\u003cp\u003e“Sure.” They walked to the concession area in silence.\u003c/p\u003e\n\u003cp\u003eWell, besides Billy stopping every fifteen feet to chat with someone he knew. Not once in those dozen or so times did Billy bother to introduce Jessie to his friends. So by the time they actually sat down, Jessie was wound so tight that one more snip to her tightly held control and she’d unravel.\u003c/p\u003e\n\u003cp\u003eBrandt’s touch stayed steady. He held her hand, or put his arm around her shoulders, or on her back, or on her thigh beneath the table. His support was absolute.\u003c/p\u003e\n\u003cp\u003eBilly had always been a man of few words, at least around her, so Jessie was taken aback when he started a conversation without prompting. “How’s your mother?”\u003c/p\u003e\n\u003cp\u003e“Good. She’s living in Riverton with Roger.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Happy to hear it. She’s a great lady. Ain’t a day that goes by that I don’t wish…” He offered a sheepish smile. “Anyway, it don’t matter.”\u003c/p\u003e\n\u003cp\u003e“Have you heard from Josie?” Jessie asked.\u003c/p\u003e\n\u003cp\u003e“Off and on. For a while it seemed I saw her all over the damn place. And in the weirdest places.”\u003c/p\u003e\n\u003cp\u003e“Like she was following you or something?” she said, only half-jokingly.\u003c/p\u003e\n\u003cp\u003e“Yeah. For the life of me, I couldn’t figure out why. It wasn’t like she was competing or dating a professional rodeo cowboy or nothin’.”\u003c/p\u003e\n\u003cp\u003eProfessional rodeo cowboy. Sounded like a misnomer, but Jessie kept her mouth shut because it was probably just her bitterness about Billy considering himself a professional when he’d spent his entire adult life broke, on the road, chasing a dream. Didn’t sound very professional to her.\u003c/p\u003e\n\u003cp\u003e“I shudder to think she’s become one of them trashy buckle bunnies that follows the rodeo from town to town.”\u003c/p\u003e\n\u003cp\u003e“Maybe Josie just wants to learn more about your life on the road,” Jessie suggested.\u003c/p\u003e\n\u003cp\u003eBilly scowled. “Why? She’s a grown woman. She oughta have a life of her own, not worrying about mine. Or checkin’ up on me.”\u003c/p\u003e\n\u003cp\u003eRather than argue, Jessie sipped her Coke.\u003c/p\u003e\n\u003cp\u003eBrandt asked, “So isn’t the rodeo season about wound down?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Already been decided who’s competin’ in Vegas for the NFR. I came awful damn close to makin’ the cut, but fell short.” He shrugged. “There’s always next year.”\u003c/p\u003e\n\u003cp\u003eHow many times had she heard that?\u003c/p\u003e\n\u003cp\u003eBut Brandt wasn’t easily sidelined. “What do you do in the off season?”\u003c/p\u003e\n\u003cp\u003eBilly squinted. “Off season? Ain’t no off-season in rodeo. Even if some of the events ain’t got a qualifying purse, there’s always some place havin’ an expo or a one day event. So while I’m waitin’ for the season to get back into full swing, I’m tryin’ to get on as many broncs as I can to improve my buck off percentage for next year. Tryin’ to put a little jingle in my pocket that ain’t comin’ from my spurs.”\u003c/p\u003e\n\u003cp\u003eThe rodeo announcer tested the PA system.\u003c/p\u003e\n\u003cp\u003eBrandt stirred his soda.\u003c/p\u003e\n\u003cp\u003eJessie fiddled with her straw.\u003c/p\u003e\n\u003cp\u003eBilly smiled. “Speakin’ of jingle…”\u003c/p\u003e\n\u003cp\u003eNot a very smooth transition, Jessie thought, but subtle never fit Billy. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“Any chance you could help your old dad out?”\u003c/p\u003e\n\u003cp\u003eDad. Right. He’d insisted she call him Billy round about the time he’d left her mom. “Whatcha need?”\u003c/p\u003e\n\u003cp\u003eHe leaned forward, the portrait of sincerity. “The transmission went out on my truck. It’s at a repair shop here in Gillette, but I’m a couple hundred short on the repair bill.”\u003c/p\u003e\n\u003cp\u003eSo. This requested meet up with Billy wasn’t spur of the moment. He’d called her because he wanted something. Money.\u003c/p\u003e\n\u003cp\u003eLike that’s news, Jessie.\u003c/p\u003e\n\u003cp\u003eShe couldn’t resist poking him. “How long has it been in the repair shop?”\u003c/p\u003e\n\u003cp\u003e“Since Wednesday. Damn thing blew up right after I got to town. Luckily, I rode well Friday night and ended up in first. Last night I finished second. I’m guaranteed a top five finish today even if I get throwed on my ass. If I finish first overall, it oughta be enough cash to get my truck back. But I ain’t countin’ on it, because them stock contractors brought seriously rank stock for the finals today. I’d rather be safe than sorry, instead of worrying I’ll have to scrub oil pans or something to get my rig outta hock, know what I mean?”\u003c/p\u003e\n\u003cp\u003eHe’d been around for four days and hadn’t bothered to call her. That stung worse than the fact he was hitting her up for cash.\u003c/p\u003e\n\u003cp\u003eNo. That stung like hell too.\u003c/p\u003e\n\u003cp\u003eBrandt stopped caressing Jessie’s leg beneath the table and reached in the back pocket of his jeans.\u003c/p\u003e\n\u003cp\u003eShe didn’t try to stop Brandt from opening his wallet. She didn’t give a shit if her protest would’ve hurt Billy’s feelings, but she’d never point out to Brandt that his show of generosity was for a man who didn’t deserve it.\u003c/p\u003e\n\u003cp\u003eHe tossed three hundred dollar bills on the table and two fifties. “I have a cousin who’s on the road as a professional bull rider, so I know how tough it is when cash is tight. I’d like to think someone would help him out if he needed it.”\u003c/p\u003e\n\u003cp\u003eBilly neatly folded the bills and shoved them into his threadbare wallet. “Thanks, man. I appreciate it.\u003c/p\u003e\n\u003cp\u003eI really do. And I’m considering this a loan, ’cause I will pay you back. Every penny. My word is good as gold. Ask anyone ’round here.”\u003c/p\u003e\n\u003cp\u003eLiar. She noticed Billy didn’t tell Brandt to ask her if his word was good.\u003c/p\u003e\n\u003cp\u003e“I’ll hold you to that,” Brandt said without much conviction.\u003c/p\u003e\n\u003cp\u003e“So, what’s your cousin’s name?” Billy asked with feigned interest, because even as self-absorbed as he was, he understood it’d be rude to take Brandt’s money and run. “Maybe I know him.”\u003c/p\u003e\n\u003cp\u003e“Chase McKay. He’s in the PBR.”\u003c/p\u003e\n\u003cp\u003e“Never heard of him.”\u003c/p\u003e\n\u003cp\u003eAnother lie. With as much as Billy Reynolds lived and breathed the world of rodeo, he had to’ve heard of Chase, since Chase McKay ranked as one of the top fifteen bull riders in the world.\u003c/p\u003e\n\u003cp\u003e“Yeah, well, he’s an up and comer,” Brandt said.\u003c/p\u003e\n\u003cp\u003eThey chatted politely about nothing.\u003c/p\u003e\n\u003cp\u003eJessie tuned them out. She was too busy wondering if everyone saw hopeful sucker stamped on her forehead or if it was as invisible as she was.\u003c/p\u003e\n\u003cp\u003eBilly’s, “Wow, look at the time,” brought Jessie back to their conversation. “I gotta stretch out before my ride.”\u003c/p\u003e\n\u003cp\u003e“Understood.” Brandt thrust his hand across the table. “Good meetin’ you, Billy.”\u003c/p\u003e\n\u003cp\u003e“You too Brandt. Take good care of my girl.”\u003c/p\u003e\n\u003cp\u003eGod. Just stop pretending I ever meant anything to you. Stop pretending you care now. You got what you wanted.\u003c/p\u003e\n\u003cp\u003e“Will do.”\u003c/p\u003e\n\u003cp\u003e“Jessie, it was great seein’ you. I hope we’ll cross paths again soon.”\u003c/p\u003e\n\u003cp\u003e“Give ’em hell on those broncs today, Billy.”\u003c/p\u003e\n\u003cp\u003e“Always.” As he shuffled away, she noticed he didn’t have the same spring in his step as he used to.\u003c/p\u003e\n\u003cp\u003eMaybe the years beating the shit out of his body had finally begun to take its toll.\u003c/p\u003e\n\u003cp\u003eIt was ironic Billy’s favorite saying, you reap what you sow, popped into her head at that moment.\u003c/p\u003e\n\u003cp\u003eJessie and Brandt sat side by side, in silence, for several long minutes. Watching people passing by.\u003c/p\u003e\n\u003cp\u003eInhaling the scents of popcorn, nachos, hot dogs and mini-donuts drifting from the concession stand.\u003c/p\u003e\n\u003cp\u003eFeeling the anticipation in the air because rodeo kick off time neared.\u003c/p\u003e\n\u003cp\u003eWhen Brandt rubbed her back in a show of support, she had the overwhelming urge to bawl. Instead, she said, “Let’s go home.”\u003c/p\u003e\n\u003cp\u003eHis hand stilled. “You don’t want to stay for the performance?”\u003c/p\u003e\n\u003cp\u003e“I’ve just seen Billy Reynolds’ best performance today, so let’s call it good and get the hell out of here.”\u003c/p\u003e\n\u003cp\u003eBrandt didn’t say anything until they were out of the arena, in the truck and back on the road. “You okay?”\u003c/p\u003e\n\u003cp\u003e“No. I’m such a fucking idiot. I can’t believe I fell for his bullshit. I should’ve gone with my first instinct and told him I was too busy today to drive to Gillette. Now, we’ve wasted a few hours and you’re out four hundred bucks.” She sighed. “Which I will pay you back for, of course.”\u003c/p\u003e\n\u003cp\u003e“Like that’s my biggest goddamn concern right now, Jessie,” he snapped. “How long has this been goin’ on?”\u003c/p\u003e\n\u003cp\u003e“What? A man only showing up when he needs something from me? My whole goddamn life.”\u003c/p\u003e\n\u003cp\u003eHis lips flattened.\u003c/p\u003e\n\u003cp\u003eJessie didn’t bother to assure Brandt he was the exception because he wasn’t.\u003c/p\u003e\n\u003cp\u003eShe expected he’d push her to talk, but he didn’t. Not for several miles. Then he simply said, “I’ve been tryin’ to think if you’ve told me anything about your childhood. About Billy.”\u003c/p\u003e\n\u003cp\u003e“Not much to tell. My mom was a single parent until she met Billy. He charmed her, bedded her and wedded her. He adopted me the same year my sister Josie was born. You saw him today, Brandt. He’s always been that way. Around when he wanted something, gone when he didn’t.”\u003c/p\u003e\n\u003cp\u003e“Have you ever met your biological father?”\u003c/p\u003e\n\u003cp\u003eWhat a loaded question. She knew where Brandt was going with this line of questioning. “No. My mom put ‘father unknown’ on my birth certificate because he’d washed his hands of her when she found out she was pregnant with me.” She pressed her fingers against her burning eyes and managed a laugh. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-31.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
