{"id":70836,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Just Spanish rice, nothing fancy.”\u003c/p\u003e\n\u003cp\u003eHe looked around the living room. “Landon asleep?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I know it’s probably crazy to put him down this late, but he was really crabby.”\u003c/p\u003e\n\u003cp\u003e“Sorry I wasn’t here to help. I ended up stopping at Ben’s place on the way home and we had a couple of beers.”\u003c/p\u003e\n\u003cp\u003eJessie smiled, appreciating he’d told her his whereabouts. “No need to explain, but I’m glad you did.”\u003c/p\u003e\n\u003cp\u003eBrandt crossed into the kitchen, lowering his mouth to hers for a blistering kiss. He tasted of beer and need.\u003c/p\u003e\n\u003cp\u003eThis sweet, hot man could wind her up in no time flat. She returned his kiss with equal fervor, loving his deep groan as she pressed her body to his and twined her arms around his neck. She felt him harden against her belly. Then Brandt clamped his hands on her butt, hoisting her up so her legs circled his hips.\u003c/p\u003e\n\u003cp\u003eHe walked to the bedroom, breaking the liplock as he set her on the bed. “Damn, woman, kissing you almost makes me forget I have a splitting headache.”\u003c/p\u003e\n\u003cp\u003eHis face was pale. And his eyes had that squinty look she associated with pain. Any thoughts of getting nekkid with him vanished. “Would you like me to rub your neck to see if it’ll help your headache?”\u003c/p\u003e\n\u003cp\u003e“Nah. That’s okay. You don’t have to.”\u003c/p\u003e\n\u003cp\u003e“I want to.” She laid her hand on his cheek. His skin seemed hotter than normal. “While you strip down to more comfy clothes, I’ll throw the peppers in the pan and be right back.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eBrandt must be in pain if he didn’t argue.\u003c/p\u003e\n\u003cp\u003eIn the kitchen, Jessie scooped the diced peppers into the hamburger and tomato mixture. She added a cup of rice before putting the lid on and turning the burner to low. After washing her hands, she checked on Landon and returned to the bedroom.\u003c/p\u003e\n\u003cp\u003eOh. Lordy. Would you look at that? A half-naked, muscled cowboy hottie stretched out on her bed.\u003c/p\u003e\n\u003cp\u003eBrandt had taken her strip down suggestion literally; he only wore his boxers.\u003c/p\u003e\n\u003cp\u003eHe turned his head as she climbed on the bed. “I probably oughta be givin’ you a neck rub.”\u003c/p\u003e\n\u003cp\u003e“You’ve given me plenty of backrubs. It’s payback.” She sat on his butt, tucking her knees by his sides. “Mind if I sit like this?”\u003c/p\u003e\n\u003cp\u003e“Hell no. If you don’t mind knowin’ that you sittin’ on me like that is gonna give me wood.\u003c/p\u003e\n\u003cp\u003eGuaranteed.”\u003c/p\u003e\n\u003cp\u003eShe chuckled and splayed her hands across his upper shoulders.\u003c/p\u003e\n\u003cp\u003e“Ah, sweet Jesus, Jess, that feels so damn good.”\u003c/p\u003e\n\u003cp\u003e“Close your eyes and relax, Brandt.”\u003c/p\u003e\n\u003cp\u003eHe muttered, “Bossy thing,” and rested the side of his face on the bed.\u003c/p\u003e\n\u003cp\u003eJessie worked his shoulders, digging her thumbs into knotted muscles. His headache probably stemmed from the tight points all over his back, not just his neck. She attempted to loosen them, paying particular attention to the area around his spine.\u003c/p\u003e\n\u003cp\u003eShe let herself enjoy touching him, her hands pulling, pushing and smoothing his skin. The musculature of his back had ridges and dips and hollows, forged from hours of physical labor he did every day. Yet that same flesh was pliant. It gave way beneath her kneading fingertips. And the scent of his skin… God, she wanted to bury her nose between his shoulder blades and fill her lungs with all that masculine goodness. Rub her face against his taut flesh, wearing the scent of his skin on hers. Press her lips to his spine and follow the length with her tongue down to his tailbone, tasting his heat and sweat.\u003c/p\u003e\n\u003cp\u003eBrandt exhaled a contented sigh.\u003c/p\u003e\n\u003cp\u003eThat sigh emboldened her. She gently turned his head to reach the other side of his neck, resting her hands around the base of his throat, working her thumbs from his nape to his hairline. In that position, Jessie had to squeeze her thighs against his side as she leaned over him.\u003c/p\u003e\n\u003cp\u003eShe had no idea how long she’d been lost in massaging him, when a rumbling sound vibrated the fingers on his throat.\u003c/p\u003e\n\u003cp\u003eMaybe that noise was his polite way of telling her she’d been pressing too hard.\u003c/p\u003e\n\u003cp\u003e“Am I hurting you?”\u003c/p\u003e\n\u003cp\u003e“No. It feels so goddamn good. Too good if you know what I mean.”\u003c/p\u003e\n\u003cp\u003eAh. He was hard. Because she’d been touching him. A sense of feminine power arose and she nuzzled his ear. “I could work that muscle too.”\u003c/p\u003e\n\u003cp\u003eBrandt chuckled. “You’ve already done enough.”\u003c/p\u003e\n\u003cp\u003e“But I could do more.” She teased his earlobe with her teeth, causing him to groan. “Let me touch you. Let me wrap my hand around your cock and get you off.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eWhy did he sound so surprised? “Really.” Jessie swung her leg over his left side so she no longer straddled him. “Lift up so I can take your boxers off.”\u003c/p\u003e\n\u003cp\u003eHe pushed up and she slid her hand across his belly, making sure the head of his penis didn’t catch in the elastic waistband.\u003c/p\u003e\n\u003cp\u003eJessie impulsively placed a kiss on each of his butt cheeks. “My God. All that time in the saddle does amazing things for your butt. I always knew you looked good in Wranglers? But cowboy? You look even better out of them.”\u003c/p\u003e\n\u003cp\u003e“How long have you been eyeing my ass?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Quite a bit in the last month, truthfully. Lay on your side. Now reach up and grab the headboard with your left hand. Good. Put your right palm flat on the mattress and brace yourself.”\u003c/p\u003e\n\u003cp\u003e“Literally brace myself?”\u003c/p\u003e\n\u003cp\u003e“Yep.” Jessie grabbed the lube off the dresser and liberally coated her right hand. As she stretched out behind him, she wished she’d stripped because she couldn’t get enough of that delicious skin-to-skin sensation. She layered her left arm alongside his, gripping his wrist to anchor herself. Then she reached her right hand over his hip and curled her fingers around the root of his cock, while kissing the slope of his shoulder.\u003c/p\u003e\n\u003cp\u003eBrandt sucked in a quick breath.\u003c/p\u003e\n\u003cp\u003e“Tell me how you like it. Slow and teasing like this?” She slid her slippery hand from the base to the tip, sweeping the pad of her thumb under the sweet spot on the upstroke. “Or fast like this?” Keeping her hand a tight fist, she moved up and down the length rapidly.\u003c/p\u003e\n\u003cp\u003e“Jesus. That feels amazing.”\u003c/p\u003e\n\u003cp\u003e“Fast it is.”\u003c/p\u003e\n\u003cp\u003eHe groaned, “That’s it,” when she found the right rhythm and speed.\u003c/p\u003e\n\u003cp\u003eJessie kissed his nape while she stroked him, pleased how the skin on his arms broke out in goose flesh beneath her questing lips. She explored the tendons in his neck with her tongue. Her teeth grazed the ball of his shoulder and he twitched, head to toe.\u003c/p\u003e\n\u003cp\u003e“Woman you’re killin’ me. I’m not gonna last.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to last. I want you to come.” She increased her tempo, and immediately his butt muscles clenched against the cradle of her hips.\u003c/p\u003e\n\u003cp\u003e“Jess—”\u003c/p\u003e\n\u003cp\u003e“Don’t hold out on me, Brandt. I wanna feel your cock jerking beneath my fingers. Give it up for me.”\u003c/p\u003e\n\u003cp\u003eHe came with a low grunt, hips bucking as he spurted into her hand.\u003c/p\u003e\n\u003cp\u003eJessie continued to squeeze his cock, kissing his back, wondering what to do with her sticky hand.\u003c/p\u003e\n\u003cp\u003eBrandt rolled over and handed her his boxers. “Here. Use these.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” She discreetly wiped her hand and tossed his underwear toward the hamper. “Is your headache gone now?”\u003c/p\u003e\n\u003cp\u003e“One of them is.” Brandt managed a small smile but a hint of pain lingered in his eyes. “Thanks, Jess.\u003c/p\u003e\n\u003cp\u003eI should return the favor—”\u003c/p\u003e\n\u003cp\u003eSlightly annoyed, she said, “I didn’t touch you because I wanted something in return, Brandt. I did it because touching you any way I please makes me happy. Very happy.” Jessie placed a kiss above his heart.\u003c/p\u003e\n\u003cp\u003e“Close your eyes because I can see that headache is dogging you.”\u003c/p\u003e\n\u003cp\u003eLandon woke up in a better mood. He’d gotten less picky with food, and ate some of the hamburger and rice, a slice of bread and half a can of mandarin oranges. The instant he was out of his high chair, he shrieked, “Goggie!” and made a beeline for Lexie, who allowed Landon to pet and hug her…for about two minutes.\u003c/p\u003e\n\u003cp\u003eJessie was hungry but she waited for Brandt. She did mundane things, started a load of clothes, scoured the highchair tray, let Lexie outside. Then let Lexie back inside, trying to keep Landon from opening the door and following the dog.\u003c/p\u003e\n\u003cp\u003eThinking she had a minute to rest, Jessie sat on the couch. Right away Landon scrambled beside her, dragging his new fleece blanket from Grandma Joan and his favorite book about farm animals.\u003c/p\u003e\n\u003cp\u003e“You want me to read to you?”\u003c/p\u003e\n\u003cp\u003eLandon blinked at her.\u003c/p\u003e\n\u003cp\u003eShe held up the book. “If you want me to read this, Landon, say yes.”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eShe laughed. “No way, lil’ buckaroo. You’re not getting away with that nonverbal communication stuff so young. Say yes.”\u003c/p\u003e\n\u003cp\u003eHis fingers worried the fringe on the blanket and stared at her pitifully, but he didn’t utter a peep.\u003c/p\u003e\n\u003cp\u003e“Okay. Fine. If you don’t wanna read the book…” Jessie set the book on the coffee table. She hated to play hardball, but Landon needed to work on his verbal skills, rather than grunting, pointing and shrieking to get what he wanted.\u003c/p\u003e\n\u003cp\u003eHe yelled, “No!” and scooted off the couch, grabbing the book and shoving it at Jessie.\u003c/p\u003e\n\u003cp\u003e“We’ve been working on this for a while, Landon. Do you want me to read the book? Then say yes.”\u003c/p\u003e\n\u003cp\u003eShe said “Yes” as she nodded her head.\u003c/p\u003e\n\u003cp\u003eLandon nodded and said, “Yef.”\u003c/p\u003e\n\u003cp\u003eJessie clapped. “Yes! Yay Landon! See? You can talk. You just need someone to force you to do it.”\u003c/p\u003e\n\u003cp\u003eShe opened the book. Before she read a single word, Landon crawled into her lap, blanket under one arm as he cuddled against her.\u003c/p\u003e\n\u003cp\u003eHer heart turned over. Landon’s unexpected sweetness and neediness had the power to undo her from her just another daycare kid mindset. So it seemed natural to brush her lips across the top of his dark head.\u003c/p\u003e\n\u003cp\u003eShe read, “Farmer George has one cow.” She stopped. “Heh, he’s not much of a rancher is he, with only one cow?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe laughed and continued reading. “But Farmer George has lost his cow. Can you help him find it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-34.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
