{"id":70839,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBrandt sighed. “Ain’t no talkin’ you out of this?”\u003c/p\u003e\n\u003cp\u003e“Nope.” She buttoned her coat and slipped on her gloves. “Just double check that everything is shut off before you leave. I’ll call you when I get there, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay. But first…c’mere and give me some sugar.” He curled his fingers around her lapels and tugged her closer.\u003c/p\u003e\n\u003cp\u003eThen he proceeded to turn her inside out with one of his long, drugging kisses, chock-full of passion, sweetness and heat. Boy howdy did Brandt’s kisses pack a wallop. Her knees and her will went weak.\u003c/p\u003e\n\u003cp\u003eUntil he chuckled against the corner of her mouth. “You sure that didn’t change your mind?”\u003c/p\u003e\n\u003cp\u003e“Nope.” She backed up and he released her. She reached for the duffel bag strap but Brandt firmly knocked her hand away and picked it up. She still wasn’t used to all his gentlemanly quirks, but she really liked them.\u003c/p\u003e\n\u003cp\u003eBut you could get used to them, couldn’t you?\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eShe opened her truck door and whistled. Lexie’s furry body was a blur as she leapt into the cab. Her tail wagged so hard it left wet prints on the passenger window.\u003c/p\u003e\n\u003cp\u003eBrandt hoisted the duffel into the truck bed. “Landon is gonna miss Lexie the next few days. Did you say goodbye to him?”\u003c/p\u003e\n\u003cp\u003eShe wasn’t sure how Landon would take it, given he sometimes screamed when Jessie left him with Brandt or vice versa. The last thing Brandt needed was a cranky, confused toddler. But Jessie suspected Brandt wouldn’t see the logic in her decision not to give Landon an official goodbye, to tell him to be a Lorelei James\u003c/p\u003e\n\u003cp\u003egood boy and all that parenting stuff, especially since she wasn’t his parent. Yet, she didn’t want Brandt to think she didn’t care because she was starting to care too much and that scared the holy bejeezus out of her.\u003c/p\u003e\n\u003cp\u003e“Jess?”\u003c/p\u003e\n\u003cp\u003eHer gaze snapped to his. “Sorry. Give him a kiss for me, okay? I’ve gotta get on the road.”\u003c/p\u003e\n\u003cp\u003e“Promise me you’ll drive safe.”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“Promise you’ll call me as soon as you’re at your mom’s.”\u003c/p\u003e\n\u003cp\u003eIt was so sweet he worried about her. Had Luke ever obsessively worried about her like this? Not that she remembered. She smiled at him. “I promise.”\u003c/p\u003e\n\u003cp\u003eBrandt kissed her again. “Have a Happy Thanksgiving.”\u003c/p\u003e\n\u003cp\u003e“You too, Brandt.” She slammed the door and backed out of her driveway. The last thing she saw as she turned the corner onto the main road was Brandt still standing on her steps, watching her go.\u003c/p\u003e\n\u003cp\u003eLuke definitely had never done that.\u003c/p\u003e\n\u003cp\u003eThe drive from Moorcroft to Riverton was uneventful, with the exception of sporadic snow flurries drifting across the road. By the time she’d reached her mother’s house, both she and Lexie were ready to get out of the truck. She texted Brandt rather than calling him.\u003c/p\u003e\n\u003cp\u003eWhen Jessie saw her mom standing in the doorway, she had the urge to run straight into her arms, like she had as a child. So it was no surprise to either of them she did exactly that.\u003c/p\u003e\n\u003cp\u003eHer mom hugged her tightly. “Jessie! It’s so good to see you. I’m so glad you’re here.”\u003c/p\u003e\n\u003cp\u003e“Me too.” No matter where they’d ended up living as she was growing up, her mom carried the scents Jessie associated with home; coffee, Aqua Net hairspray, double mint gum and Jergen’s cherry-almond lotion. She inhaled deeply and sighed, happy that some things never changed.\u003c/p\u003e\n\u003cp\u003e“Come in. I’ve got a pot of coffee ready to go.”\u003c/p\u003e\n\u003cp\u003e“Thanks, but I’m wired enough as it is.” Jessie kicked off her boots, ditched her coat, hat and gloves.\u003c/p\u003e\n\u003cp\u003eThen she wiped Lexie’s paws. Her mom didn’t mind pets in the house just as long as she didn’t have to clean muddy paw prints out of her carpet.\u003c/p\u003e\n\u003cp\u003e“Where’s Roger?”\u003c/p\u003e\n\u003cp\u003e“At the college. He’ll be here later. He’s trying to catch up on paperwork so he can have the whole weekend off.”\u003c/p\u003e\n\u003cp\u003eJessie didn’t really know her mother’s husband Roger Randolph very well. They’d met through the community college in Wheatland where he taught and she worked as an administrative assistant. By that time Jessie already lived on her own. Then she’d met Luke, married him and moved to the McKay ranch.\u003c/p\u003e\n\u003cp\u003eAbout six months before Luke died, her mom and Roger had relocated to Riverton. Roger was a nice enough guy, and he seemed to make her mother happy, so that’s all that mattered. “Is Josie coming?”\u003c/p\u003e\n\u003cp\u003eThat gave her mother pause. “No. You haven’t talked to her?”\u003c/p\u003e\n\u003cp\u003e“She doesn’t exactly keep me on speed dial.” Jessie’s sister, Josie, had inherited her father’s wanderlust. After years spent waiting for Billy to get off the road, her mother had finally divorced him the year Jessie turned twelve. The sad thing was, it hadn’t affected Jessie’s life because Billy hadn’t been around much anyway.\u003c/p\u003e\n\u003cp\u003eBut it’d affected Josie. Josie had romanticized her father and his lifestyle, so she took off right after she’d turned eighteen. It’d been a hard blow to their mother, and for that Jessie resented her younger sister.\u003c/p\u003e\n\u003cp\u003eAny close relationship they shared vanished when Josie did.\u003c/p\u003e\n\u003cp\u003e“I talked to her last month,” her mom said. “She’s working at a restaurant in Dallas.”\u003c/p\u003e\n\u003cp\u003eNo big stunner Josie was in cowboy country in Texas. Jessie couldn’t muster interest in Josie’s latest escapade and refused to pretend. She also refused to mention to her mother she’d seen Billy because she doubted she could be civil about him, either.\u003c/p\u003e\n\u003cp\u003eShe wandered into the kitchen and snatched an oatmeal raisin cookie. Her eyes nearly bugged out at the three different kinds of pie, and cinnamon rolls, and brownies, and two different types of cookies—all homemade—that crowded the countertop.\u003c/p\u003e\n\u003cp\u003e“You want milk with that?”\u003c/p\u003e\n\u003cp\u003eMilk. Right. Jessie smiled. “Nope. I’d rather have a beer.” She helped herself to one from the fridge.\u003c/p\u003e\n\u003cp\u003e“Do you have time to sit down? Or are you still whipping up food for tomorrow?”\u003c/p\u003e\n\u003cp\u003e“I’m mostly done. Gotta get up and put the turkey in, glaze the hamballs and peel the potatoes, but I figured you could help me.”\u003c/p\u003e\n\u003cp\u003e“Sure thing. How many people are you feeding?” She took a long pull off the Corona.\u003c/p\u003e\n\u003cp\u003e“Eight. Our friends Barb and Tim, our empty nest neighbors Rich and his wife Dawn, and Roger’s new teaching assistant, Jake.”\u003c/p\u003e\n\u003cp\u003eJessie slowly lowered the bottle. “Mom. Please tell me you’re not trying to fix me up with this Jake guy.”\u003c/p\u003e\n\u003cp\u003eHer mother grabbed a dishrag and wiped cookie crumbs from the counter. “Not a fix up. But Jake is a really great guy. He’s single, so are you. You’re around the same age, I thought it’d be good for you to have someone show you around while you’re here.”\u003c/p\u003e\n\u003cp\u003eRegardless of what her mom claimed, this was a fix up. Although she and Brandt were exclusive while they were living together, this thing, whatever it was, was temporary.\u003c/p\u003e\n\u003cp\u003eYou don’t really believe that. There’s more going on between you and Brandt than just hot sex. This thing could be the start of something big.\u003c/p\u003e\n\u003cp\u003eBut her cynical side reminded her that there already was something very big between her and Brandt, something insurmountable: Landon’s future.\u003c/p\u003e\n\u003cp\u003e“Jessie?” her mother prompted. “I see the wheels turning. What’s going on?”\u003c/p\u003e\n\u003cp\u003e“Besides the fact I’m currently helping my former brother-in-law take care of my dead husband’s secret love child from a jailbait jailbird? Oh, and just to make it even more interesting, I’m now sleeping with said brother in law.”\u003c/p\u003e\n\u003cp\u003eAfter her mom picked her jaw up off the floor, she pointed to a dining room chair. “Sit and start talking. I’ll get more beer.”\u003c/p\u003e\n\u003cp\u003eJessie knew her mother intended to grill her when she ditched her apron, embroidered with a big “L”\u003c/p\u003e\n\u003cp\u003efor Lisa. Removal of the apron indicated the shift in parental roles from cookie and comfort giver to interrogator. She sipped her beer and waited for the barrage of questions.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long.\u003c/p\u003e\n\u003cp\u003e“Did you end up in this situation with Brandt out of guilt?” Her mother raised her hand when Jessie began to object. “I know you’re in the situation with Landon out of some obligation you feel to Luke.”\u003c/p\u003e\n\u003cp\u003eJessie ran her thumb along the edge of the sandstone coaster as she tried to figure out a way to explain it, when half the time she didn’t understand it herself. “Being in such close quarters with Brandt felt different from the start. That everyday familiarity between us built pretty damn fast and in some ways, it was more intimate than sex. I missed that physical closeness, and since we were already acting like a married couple, I told him I wanted all of the benefits of being married.”\u003c/p\u003e\n\u003cp\u003e“So you approached him?” her mother asked.\u003c/p\u003e\n\u003cp\u003e“Yes.” Jessie swallowed a mouthful of beer. “Hard to believe, huh?”\u003c/p\u003e\n\u003cp\u003e“I’m happy you did. At least you’re getting something you want out of this lousy situation. How you’re able to handle…” She shook her head. “I don’t know what I would’ve done if one of Billy’s floozies would’ve shown up with a kid he’d fathered.”\u003c/p\u003e\n\u003cp\u003eHer mom hadn’t spoken of Billy’s infidelities, but Jessie knew it’d been another reason she’d ended the marriage. Before she could answer, her mother laughed.\u003c/p\u003e\n\u003cp\u003e“See, I say that, but I probably would’ve done the exact same thing you did, Jessie.”\u003c/p\u003e\n\u003cp\u003e“What? Caved in?”\u003c/p\u003e\n\u003cp\u003e“No.” She leaned back in her chair. “In some ways hearing about Landon’s mother reminded me…well, kinda like déjà vu.”\u003c/p\u003e\n\u003cp\u003e“How so?”\u003c/p\u003e\n\u003cp\u003e“One day when you were about sixteen months, I was at my wit’s end, with you, with my job, and this neighbor lady volunteered to take care of you for a couple of hours while I got control. At first I thought it was weird, but she told me someone helped her out when she was a young mother and she was just returning the favor. Her kindness over the next few months really changed a lot for me. For us.”\u003c/p\u003e\n\u003cp\u003eJessie was floored. “How come I never knew any of this?” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-37.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
