{"id":70842,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Mom. Stop.” Brandt tugged her into his arms. “Just stop.” She was absolutely breaking his heart.\u003c/p\u003e\n\u003cp\u003e“No,” Tell said from behind him, “Let her talk if she wants to.”\u003c/p\u003e\n\u003cp\u003e“We’ll listen to anything she has to say,” Dalton added. “She needs to know that.”\u003c/p\u003e\n\u003cp\u003eBrandt hadn’t heard his brothers come up behind them, but he was damn happy they were here.\u003c/p\u003e\n\u003cp\u003eShe pushed back from Brandt and wiped her tears. “I’ve been thinking about this a lot over the last month and wanted to talk to you boys yesterday. On Thanksgiving. To let you know how thankful I am for each of you, but…well. You were there. Wasn’t exactly a Norman Rockwell painting, was it?”\u003c/p\u003e\n\u003cp\u003eNone of them could look at each other, which was just weird.\u003c/p\u003e\n\u003cp\u003e“Sorry.” She used a lace hankie to wipe her nose. “I didn’t mean to blather like a fool and get so weepy.”\u003c/p\u003e\n\u003cp\u003eA moment of silence passed as they all struggled.\u003c/p\u003e\n\u003cp\u003e“It’s okay, Mom. Tell cries all the damn time. It’s sort of embarrassin’ if you wanna know the truth,”\u003c/p\u003e\n\u003cp\u003eDalton mock-whispered.\u003c/p\u003e\n\u003cp\u003eTell probably would’ve shoved him, but Dalton was holding a wide-eyed Landon.\u003c/p\u003e\n\u003cp\u003eShe smiled wanly, shaking her head with that “boys will be boys” look of resignation Brandt recognized. “How long have you been here?”\u003c/p\u003e\n\u003cp\u003e“An hour.”\u003c/p\u003e\n\u003cp\u003e“You’ve been sitting in your car in the cold for an hour? Why?”\u003c/p\u003e\n\u003cp\u003e“Because I didn’t want to go in there by myself.” She sniffed and laughed at the same time. “Stupid, huh?”\u003c/p\u003e\n\u003cp\u003e“Not stupid. You were just waiting for us, right?”\u003c/p\u003e\n\u003cp\u003eShe nodded and wiped her cheeks.\u003c/p\u003e\n\u003cp\u003eBrandt was afraid she’d start crying again, and he knew how much that’d embarrass her in front of their McKay relatives. He looked at Dalton. “How about if you let Mom carry Landon inside?”\u003c/p\u003e\n\u003cp\u003eIf he thought his mother was done with tears, he was mistaken. Because for some reason, that made her cry harder.\u003c/p\u003e\n\u003cp\u003eA few hours later, the noise level in Cord and AJ’s house still rivaled the floor of the New York Stock Exchange.\u003c/p\u003e\n\u003cp\u003eKids and dogs running everywhere, inside and out. Men gathered in the den shouting at a football game on TV. Pregnant women in the kitchen. Nursing mothers and babies in the living room. Still more kids racing up and down the stairs. It was pure chaos.\u003c/p\u003e\n\u003cp\u003eBrandt loved every second of it. He wished Jessie were here because he knew she’d love it too.\u003c/p\u003e\n\u003cp\u003e“Kane?” Ginger shouted from the living room.\u003c/p\u003e\n\u003cp\u003e“I’ll get him,” Brandt said. He wandered to the den where his uncles were sacked out in the easy chairs, snoring, while his cousins were crouched on the floor, surrounded by kids, trying to watch the game.\u003c/p\u003e\n\u003cp\u003e“Kane? Ginger’s lookin’ for you.”\u003c/p\u003e\n\u003cp\u003e“I’m there.” Immediately Kane pushed to his feet and brushed past Brandt as he lingered in the doorway.\u003c/p\u003e\n\u003cp\u003eA collective groan arose at a play on the football field.\u003c/p\u003e\n\u003cp\u003eColby shifted his youngest son, Austin, asleep on his lap, and pointed at the TV. “That’s gotta be a personal foul.”\u003c/p\u003e\n\u003cp\u003e“Give it up, Colby,” Cam said. “They’re gonna get their butts handed to them today.”\u003c/p\u003e\n\u003cp\u003e“And no pussy ref call is gonna make a damn bit of difference,” Ben said. “Shit, I mean shoot, I’m not supposed to say the ‘p’ word in front of the kiddos, am I?”\u003c/p\u003e\n\u003cp\u003e“Nope,” Quinn said. “Ditto for the ‘d’ word and the ‘s’ word.”\u003c/p\u003e\n\u003cp\u003e“If poor Ben can’t curse he ain’t gonna have no language skills at all,” Chase drawled from the other side of the room.\u003c/p\u003e\n\u003cp\u003eBen whipped a pillow at him. “Fu—I mean funny.”\u003c/p\u003e\n\u003cp\u003eChase caught the pillow, almost without looking.\u003c/p\u003e\n\u003cp\u003eColt whistled. “You oughta be playin’ ball instead of ridin’ bulls.”\u003c/p\u003e\n\u003cp\u003e“I’ll pass. No buckle bunnies waitin’ for a hard ride after a baseball game like they are after a bull riding expo.”\u003c/p\u003e\n\u003cp\u003eTell sighed. “Dude. You have the perfect life.”\u003c/p\u003e\n\u003cp\u003eBrandt looked around. This room used to seem so big, but now it couldn’t hold them all. Colt was backed against the wall with Hudson on his lap. Cam was kicked back in the recliner with his two youngest boys sprawled on him. Quinn’s son Adam rested his head on Quinn’s thigh. Kade leaned against the recliner, his lap empty. Didn’t appear his girls were the slightest bit interested in football.\u003c/p\u003e\n\u003cp\u003eA dark haired boy Brandt recognized as Carter’s middle son, Spencer, was curled up in the corner.\u003c/p\u003e\n\u003cp\u003eBut he didn’t see the kid’s father. “Where’s Carter?”\u003c/p\u003e\n\u003cp\u003e“Workin’ on some art thing. Said he’d be by later.”\u003c/p\u003e\n\u003cp\u003eColt snorted. “So he says. But since he sent Macie over here with all the kids, what do you think the chances are that’ll happen?”\u003c/p\u003e\n\u003cp\u003e“Slim to none,” Colby said.\u003c/p\u003e\n\u003cp\u003eBrandt hadn’t seen Keely’s husband, Jack, either. “Where’s Keely?”\u003c/p\u003e\n\u003cp\u003e“She and Jack went to his mom’s in South Dakota for Thanksgiving.”\u003c/p\u003e\n\u003cp\u003e“That’s because she wants to be here on Christmas to see the looks on our faces after she gives each of her nephews a drum set,” Cord said. When his youngest son, Foster, snuggled into his chest, Cord gently patted his back and lowered his voice. “If she ain’t bluffin’ I swear I will strangle her.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, get in line. She informed me the nieces are getting tambourines,” Cam pointed out. “That ain’t any better.”\u003c/p\u003e\n\u003cp\u003e“Keely just told you guys this?” Brandt asked.\u003c/p\u003e\n\u003cp\u003e“Yep, she doesn’t want anyone to ‘steal’ her present ideas, since she’s dragged Jack along as her pack mule for Black Friday sales shopping.”\u003c/p\u003e\n\u003cp\u003e“Poor bastard,” Ben said.\u003c/p\u003e\n\u003cp\u003e“That ‘b’ word is off limits too,” Quinn reminded him.\u003c/p\u003e\n\u003cp\u003e“I just got a text from Jack that said, Kill me now,” Carter said.\u003c/p\u003e\n\u003cp\u003eEveryone turned toward Carter, who stood behind Brandt.\u003c/p\u003e\n\u003cp\u003e“Hey, you are here,” Kade said.\u003c/p\u003e\n\u003cp\u003e“I said I would be.” Carter’s gaze moved between Colt and Colby. “Thanks for the vote of confidence, guys.”\u003c/p\u003e\n\u003cp\u003e“Even you gotta admit you lose track of time when you’re workin’ on a new sculpture,” Cam said.\u003c/p\u003e\n\u003cp\u003e“What is this? Pick on Carter day?”\u003c/p\u003e\n\u003cp\u003e“Yep, gotta uphold the tradition of pickin’ on the youngest since Keely ain’t here,” Cord said.\u003c/p\u003e\n\u003cp\u003e“Terrific.”\u003c/p\u003e\n\u003cp\u003e“Grab a seat.”\u003c/p\u003e\n\u003cp\u003eCarter looked around. “Where?”\u003c/p\u003e\n\u003cp\u003e“Good point.”\u003c/p\u003e\n\u003cp\u003eChase stood. “You can have my spot. I need air.” As Chase passed by Brandt, he made the “wanna beer?” sign and Brandt nodded, grabbing his coat before he followed Chase out the front door.\u003c/p\u003e\n\u003cp\u003eThe lid on the cooler slammed and Chase handed him a Bud Light. “Thanks.”\u003c/p\u003e\n\u003cp\u003e“No prob.”\u003c/p\u003e\n\u003cp\u003eTheir breath came out in a misty white steam. “Damn, it’s cold out here.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but it’s quiet.” Chase took a long swallow. “I’m not used to bein’ around so many kids. I ain’t gonna lie. It drives me insane.”\u003c/p\u003e\n\u003cp\u003eBrandt didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Shit. Sorry. I forgot that you’re takin’ care of Luke’s kid for a while.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it. But there’s a huge difference between one kid and twenty-some kids.”\u003c/p\u003e\n\u003cp\u003e“So how is it goin’ with Landon?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Okay. Jessie’s been workin’ with him to get him to talk more. He’s adjusted to bein’\u003c/p\u003e\n\u003cp\u003earound kids in the daycare, but the first couple of days were sheer hell for both of us.”\u003c/p\u003e\n\u003cp\u003eWhen Chase kept quiet, Brandt said, “You wondering how come I was such a bastard and brought Jessie into this?”\u003c/p\u003e\n\u003cp\u003e“I’d be lyin’ if I didn’t admit it crossed my mind.” Chase looked straight ahead and drank. “So you’re livin’ with Jessie? At her place?”\u003c/p\u003e\n\u003cp\u003eBrandt leaned across the railing. “For now. Why?”\u003c/p\u003e\n\u003cp\u003e“Just curious. Seems everyone is pairing up and producing the next generation of McKays.”\u003c/p\u003e\n\u003cp\u003e“She’s already paired up with one McKay and that didn’t work out so good for her.”\u003c/p\u003e\n\u003cp\u003e“That’s probably because she was paired with the wrong McKay to start with.”\u003c/p\u003e\n\u003cp\u003eNot touching that one.\u003c/p\u003e\n\u003cp\u003e“What about you? I read all about the ‘Wyoming Wild Man’ in the rodeo magazines. Sounds like you’ve got a girl in every town and left a string of broken hearts across the country.”\u003c/p\u003e\n\u003cp\u003e“You know how the media exaggerates.”\u003c/p\u003e\n\u003cp\u003e“So none of it’s true?”\u003c/p\u003e\n\u003cp\u003eChase grinned. “Oh, it’s completely true. The raunchier stuff don’t make the trade mags.” He peeped over his shoulder, then back at Brandt. “I gotta admit, I love havin’ a different girl or two every night if I want. They wanna fuck a top fifteen bull rider and I let ’em. Win-win, right?”\u003c/p\u003e\n\u003cp\u003e“Right. Who’s the flavor this week?”\u003c/p\u003e\n\u003cp\u003e“Flavors—plural, as in Miss Rodeo Nevada and Miss Rodeo Montana. Damn good thing the states aren’t next to each other, huh?”\u003c/p\u003e\n\u003cp\u003eBrandt whistled. “You’ve always had a thing for them fancy types.”\u003c/p\u003e\n\u003cp\u003e“What’s not to love about big hair, tight jeans, high heeled boots, lots of cleavage and rhinestones?\u003c/p\u003e\n\u003cp\u003eDude. I’m so there. Not to mention them queens can ride you hard and squeeze you dry. Ain’t nothin’ I like better than ridin’ double.”\u003c/p\u003e\n\u003cp\u003e“Watch yourself, Chase. You’re gonna run across one of them beauty queens whose daddy don’t like his little girl bein’ toyed with and he’s gonna get out the shotgun.”\u003c/p\u003e\n\u003cp\u003e“I can handle myself. And lookit you, B, goin’ all big brother on me, worried about me getting my ass full of buckshot.”\u003c/p\u003e\n\u003cp\u003e“Asshole. I’m worried about you bustin’ your ass and getting crippled up because you’re too stupid to understand you ain’t invincible and you ain’t gonna be able to ride forever.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-40.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
