{"id":70844,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe skirted the coffee table. “Is Landon sleeping?”\u003c/p\u003e\n\u003cp\u003e“Yep. He’s been down about a half hour.”\u003c/p\u003e\n\u003cp\u003e“Good. Then I timed it perfectly.”\u003c/p\u003e\n\u003cp\u003eHis eyebrows lifted. “Timed what perfectly?”\u003c/p\u003e\n\u003cp\u003e“This.” She straddled his lap, held his face in her hands and kissed him. She tried to keep it easy, a deep, slow, wet reunion kiss. But the sensation of his full warm lips beneath hers, the glide of his tongue against hers, his taste and his scent made her wild, and she inhaled him in a blazing kiss of pure need.\u003c/p\u003e\n\u003cp\u003eHeady stuff, how he met her kiss for kiss, touch for touch, breath for breath.\u003c/p\u003e\n\u003cp\u003eShe moved her lips along the line of his jaw to his ear. “God, Brandt. I’m dying for you. Phone sex was hot, but I want real sex. Lots of it. Right now.” She slid off his lap.\u003c/p\u003e\n\u003cp\u003eKeeping her eyes on his, she circled her fingers around his wrists, tugging him to his feet. While gorging herself on his addictive kisses, she herded him down the hallway to his bedroom. After locking the bedroom door, Jessie jerked Brandt’s shirt off. She made short work of his jeans, yanking the denim and his boxers to the floor.\u003c/p\u003e\n\u003cp\u003eThen she pushed him on the bed.\u003c/p\u003e\n\u003cp\u003eBrandt propped himself on his elbows, not the least bit bothered by his nakedness. Or his full-blown hard-on. And he shouldn’t be. His rockin’ body should always be naked.\u003c/p\u003e\n\u003cp\u003e“What are you grinning at, Miss Jessie?”\u003c/p\u003e\n\u003cp\u003e“The thought of you being naked twenty-four/seven.”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t be much fun if I was nekkid alone. Speaking of nekkid…” His predatory gaze moved over her in a sensual caress. “You have way too many clothes on.”\u003c/p\u003e\n\u003cp\u003e“Do I? I might be inclined to take them all off, but there is one little condition.”\u003c/p\u003e\n\u003cp\u003eHe said, “Name it,” without hesitation.\u003c/p\u003e\n\u003cp\u003e“I get to have my wicked way with you and you just have to lay there and take it.”\u003c/p\u003e\n\u003cp\u003e“Deal.”\u003c/p\u003e\n\u003cp\u003eThere was that smile of his, the smile that promised he’d keep his word, but also guaranteed delicious payback.\u003c/p\u003e\n\u003cp\u003eJessie disrobed and crawled over him, loving how his body heat warmed her skin. She tucked her knees by his hips and bent down, letting her hair fall in a curtain around their faces. She savored the give and take of mouths, as they both took a turn at leading the kiss.\u003c/p\u003e\n\u003cp\u003eBrandt’s arms were casually thrown above his head, but before too long, those rough-skinned hands were sliding up her arms, gliding down her back, stopping to cup her butt cheeks. He whispered, “Jess.\u003c/p\u003e\n\u003cp\u003eBefore we… I need…”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“To put my mouth on you. I know you’re wet. I can smell that hot sweetness between your thighs.\u003c/p\u003e\n\u003cp\u003eThe need to taste you is makin’ me crazy.” He nuzzled her temple. “You can do anything you want to me after, but first, I wanna feel you come against my tongue.”\u003c/p\u003e\n\u003cp\u003eAh. What was she supposed to say? No way? When her clit was doing the wave in anticipation of Brandt’s mouth? “You drive a hard bargain, but…okay.”\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003eJessie pushed back to balance on her knees as she straddled Brandt’s thighs.\u003c/p\u003e\n\u003cp\u003e“Sexy girl. Stay just like that. Don’t move.” He wiggled his body down until his head was between her knees. “Goddammit my mouth is watering and I can’t reach you. Fall forward on your elbows and hands. That’s it.” His palms pushed on the inside of her thighs, sliding her legs out farther and then his fingers gripped her ass.\u003c/p\u003e\n\u003cp\u003eShe couldn’t see what he was doing, but a second after she felt the first wet swipe of his tongue, she nearly went blind with pleasure anyway.\u003c/p\u003e\n\u003cp\u003eBrandt didn’t tease. He lapped at her slit. Licked and mapped every inch of her folds with absolute gusto. Buried his tongue in her channel and fucked her with it.\u003c/p\u003e\n\u003cp\u003e“This isn’t gonna take long,” she gasped.\u003c/p\u003e\n\u003cp\u003e“Then I can do this again later.” He did a twirly, swirly maneuver from her clit to her anus. Using his lips and his tongue in such raunchy ways.\u003c/p\u003e\n\u003cp\u003e“Brandt.” So close. She rolled her hips back, wanting that continual attention to her pleasure point.\u003c/p\u003e\n\u003cp\u003eHe growled and brought her down, so she straddled his face. She had no idea how he was breathing, but when he fastened his mouth to her top of her sex and did a sexy rhythmic, slurping thing directly on her clit, she didn’t care. “Yes. Please. Don’t stop.”\u003c/p\u003e\n\u003cp\u003eHer hands grabbed fistfuls of the quilt as Brandt kept pushing her higher. Each lick. Each suck. Each incredible flicker of his tongue and she was sure her body would simply ignite.\u003c/p\u003e\n\u003cp\u003eAnd it did. Jessie pressed her face into the mattress and bit back a scream as her clit pulsed against Brandt’s hot mouth. Despite the blood pounding in her groin, her ears and her throat, she still heard the sexy sounds of him swallowing. Drinking her down.\u003c/p\u003e\n\u003cp\u003eThat set her off again.\u003c/p\u003e\n\u003cp\u003eWhen she floated back from that head rushing, body buzzing happy place, she pushed herself back up on her knees. She smoothed back her tangled hair and scooted down Brandt’s upper torso so she could see his face.\u003c/p\u003e\n\u003cp\u003eHis look of cockiness was totally justified. He licked his lips and said, “Mmm. Tasty.”\u003c/p\u003e\n\u003cp\u003eJessie fastened her mouth to his, surprising him with an openmouthed kiss, sucking her taste from his tongue, rubbing her face through the sticky glaze on his cheeks, nipping and biting and enjoying his shock.\u003c/p\u003e\n\u003cp\u003eShe said, “Move up and spread out.”\u003c/p\u003e\n\u003cp\u003e“Jess—”\u003c/p\u003e\n\u003cp\u003e“No arguments, buster. You agreed. Me. In charge.”\u003c/p\u003e\n\u003cp\u003eBrandt sighed, but it wasn’t a sigh of frustration.\u003c/p\u003e\n\u003cp\u003eShe pinned his arms above his head and allowed her hands to track the muscles from his wrists down the sinew defining in his forearms, over the bulge of his biceps to the cup of his shoulders. “I never get to touch you enough.”\u003c/p\u003e\n\u003cp\u003e“Anytime you want, all you want.”\u003c/p\u003e\n\u003cp\u003e“You’re usually so busy touching me. It makes me lose my mind and I sort of get lost.” She snared her gaze. “That’s not fair to you.”\u003c/p\u003e\n\u003cp\u003e“If you knew how long I’d dreamed of getting my hands all over you, Jess, you’d know how untrue that statement really is.”\u003c/p\u003e\n\u003cp\u003eHer belly fluttered. She ducked her head from the intensity in his eyes and let her palms drift over his pectorals. God. There was just something so wholly masculine about a guy with chest hair. This part of his body always smelled good. Not musky like his groin, but earthy. Soap and sweat. She rubbed her lips down the delineated line between his pecs, loving how the crisp hair tickled her chin and cheek. She rubbed her face all over his chest, practically purring.\u003c/p\u003e\n\u003cp\u003eBrandt’s hand landed on the side of her head and he brushed the hair from her cheek.\u003c/p\u003e\n\u003cp\u003eShe looked up at him. “Did I say you could touch me?”\u003c/p\u003e\n\u003cp\u003e“No. But I like watchin’ you touchin’ me. It’s sexy as hell.”\u003c/p\u003e\n\u003cp\u003e“Mmm. So you wanna watch me do this?” Jessie used the tip of her tongue to trace the outline of his right nipple.\u003c/p\u003e\n\u003cp\u003eHis arms broke out in goose flesh. “Christ.”\u003c/p\u003e\n\u003cp\u003e“I guess you like that.” Jessie closed her eyes and sucked the flat disk until the center drew up into a rigid point. She let her tongue flick back and forth before she sucked hard again. Then she used her teeth.\u003c/p\u003e\n\u003cp\u003eShe felt his cock jumping between their bodies and she curled her hand around the shaft, pumping it while she tongued his nipple.\u003c/p\u003e\n\u003cp\u003e“Fuck. Oh fuck.”\u003c/p\u003e\n\u003cp\u003eReducing Brandt’s vocabulary to curse words was a good sign. Her lips skimmed his skin as she blindly sought the nipple on the other side. Her mouth enclosed the tiny nub and she got those same hot, sexy noises when she worked it relentlessly.\u003c/p\u003e\n\u003cp\u003eHis hips pumped up, which meant he was ready for the next phase of seduction. She slowly kissed her way down the trail of dark hair running along the center of his belly.\u003c/p\u003e\n\u003cp\u003e“Jess. Fuck.”\u003c/p\u003e\n\u003cp\u003e“No fucking yet. I want you in my mouth for a little while first.”\u003c/p\u003e\n\u003cp\u003eHe groaned.\u003c/p\u003e\n\u003cp\u003eShe smiled. She let her breath tease the purple crown of his cock before she swallowed him to where her right gripped the thick base. She didn’t move, concentrating on the heat and the hardness and the taste of this intimate part of him.\u003c/p\u003e\n\u003cp\u003eBrandt didn’t buck his pelvis, or grab her head, or ask for her to finish him. He allowed her to do what she wanted, despite the rapid beat of his pulse in the vein running up the length of his dick, a vein that pulsed so sweetly against her tongue.\u003c/p\u003e\n\u003cp\u003eJessie took her time, using all the tricks she’d learned about him that made him moan or twitch or curse. She stopped teasing him and lifted her head. “I’m giving you two choices.”\u003c/p\u003e\n\u003cp\u003e“Which are?”\u003c/p\u003e\n\u003cp\u003e“I suck you off. Or…”\u003c/p\u003e\n\u003cp\u003eJust a tad impatiently he demanded, “Or what?”\u003c/p\u003e\n\u003cp\u003e“We do something new.”\u003c/p\u003e\n\u003cp\u003eHe waited.\u003c/p\u003e\n\u003cp\u003e“What’s your dirty girl fantasy, Brandt?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“What’s something you’ve always wanted to do to a woman but you’ve never tried?”\u003c/p\u003e\n\u003cp\u003eHis gaze skittered away and then back. “Why are you askin’ me this?”\u003c/p\u003e\n\u003cp\u003e“Because I wanna fulfill that dirty girl fantasy, Brandt. I wanna do the one thing for you that you’ve never had the guts to ask any other woman.” She suckled the head of his cock while keeping her gaze firmly on his. “Tell me. Anything you want.”\u003c/p\u003e\n\u003cp\u003e“Anything?”\u003c/p\u003e\n\u003cp\u003e“Yes.” When Brandt squirmed, she knew this was stepping far outside his comfort zone.\u003c/p\u003e\n\u003cp\u003eGood.\u003c/p\u003e\n\u003cp\u003e“Tell me,” she repeated.\u003c/p\u003e\n\u003cp\u003eHe reached down and traced her jawline, from the front of her temple down to the tip of her chin.\u003c/p\u003e\n\u003cp\u003eThen he swept the rough pad of his thumb across her bottom lip. “I wanna come on your face. I wanna see my come coating your lips before you lick it off and swallow it all.”\u003c/p\u003e\n\u003cp\u003eHoly crap that was a hot request. Really hot. Especially coming from a cowboy gentleman such as Brandt McKay. She smiled and licked another pearl of pre-come from the slit in his dick.\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Just like that? You’d say yes?”\u003c/p\u003e\n\u003cp\u003e“Yep. So where do you want me? On my knees between your legs, sitting on the floor? You’d probably have better aim if I was on the floor.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-42.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
