{"id":70846,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I know more than you do. When Samantha lived with Drex, she talked about turning the boy over to his father’s family so she could be free. Most the time she was so wasted she didn’t remember she even had a kid, let alone knowing how to take care of him. Get used to him being around permanently, because she won’t want him back.”\u003c/p\u003e\n\u003cp\u003e“That’s enough.” Brandt didn’t look away from the woman when he spoke to Jessie. “Jess. Go.”\u003c/p\u003e\n\u003cp\u003eA million thoughts spun in her head as she reached the checkout line. Obviously the woman knew Landon. But not as well as she knew Landon’s mother. How much of what she’d said was true? Had Samantha just been biding her time? Brandt hadn’t said anything about his jail visit with Samantha, but Jessie knew the visit had upset him. Had Samantha already told Brandt she didn’t intend to take Landon back?\u003c/p\u003e\n\u003cp\u003eIt’d been easy to forget these fears when everything had been going along so smoothly. She cared about Landon, but she had no desire to be the kid’s mother. Because she never really would be his mother.\u003c/p\u003e\n\u003cp\u003eNo matter what she did for him, he’d always be affected by his mother abandoning him. He’d always have that kernel of hope that someday his biological mother would come to her senses and connect with him.\u003c/p\u003e\n\u003cp\u003eJessie could spend her life loving him and it wouldn’t be enough. And it had nothing to do with him being a McKay.\u003c/p\u003e\n\u003cp\u003e“Miss? You have to unload the cart yourself,” the checker said to her.\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” Brandt said from behind her. When he set his hands on her shoulders, she shrugged him off.\u003c/p\u003e\n\u003cp\u003eBrandt was smart enough to not push the issue as they drove back to her house. He readied Landon for bed and for once Landon didn’t insist Jessie read him a bedtime story.\u003c/p\u003e\n\u003cp\u003eJessie was grateful for the busy work of putting away groceries. Once she had that done, she decided she’d scour the kitchen and the bathroom. If that didn’t allow her brain to shut off, she’d go into the barn and find some project to keep her energy and thoughts focused elsewhere.\u003c/p\u003e\n\u003cp\u003eBrandt came into the kitchen. “We need to talk about what happened at the grocery store.”\u003c/p\u003e\n\u003cp\u003e“No, we don’t.” She squirted the cleaning solution on the countertop and scrubbed furiously, her rubber gloves squeaking with each stroke.\u003c/p\u003e\n\u003cp\u003e“Jess—”\u003c/p\u003e\n\u003cp\u003eShe spun around and aimed the spray bottle at him. “Don’t push me. Leave me alone.”\u003c/p\u003e\n\u003cp\u003eBrandt snatched the plastic bottle out of her hand. “No. Now give me the goddamn gloves and sit on the couch so we can talk about this like rational adults because we’re not gonna shove this under the rug.”\u003c/p\u003e\n\u003cp\u003e“You don’t get to order me around.”\u003c/p\u003e\n\u003cp\u003e“Fine.” He exhaled slowly. “Jessie, will you sit on the couch with me so we can hash this out?”\u003c/p\u003e\n\u003cp\u003eSay no.\u003c/p\u003e\n\u003cp\u003eScream no.\u003c/p\u003e\n\u003cp\u003eHe said, “Please.”\u003c/p\u003e\n\u003cp\u003eLooking at him, she stripped off her gloves. “Give me back my spray bottle.”\u003c/p\u003e\n\u003cp\u003e“When we’re done talkin’. Do you want a beer?”\u003c/p\u003e\n\u003cp\u003e“I’d rather have whiskey.”\u003c/p\u003e\n\u003cp\u003e“Two shots comin’ up.”\u003c/p\u003e\n\u003cp\u003eJessie chose to sit in the easy chair, which didn’t make Brandt happy. But she needed to keep a clear head, and whenever Brandt touched her, she pretty much went mindless.\u003c/p\u003e\n\u003cp\u003eHe set the bottle of Maker’s Mark whiskey and two shot glasses on the coffee table. He poured. He knocked one back and refilled it again, holding the shot out to her.\u003c/p\u003e\n\u003cp\u003eShe gulped it, welcoming the burn.\u003c/p\u003e\n\u003cp\u003e“I know you said you didn’t want to hear anything about Samantha, but in light of what happened, there are a few things you need to know. First off, that woman we saw tonight? According to Samantha, she’s psycho. She’s the mother of the guy Samantha lived with for a while. This woman used to show up, all hours of the night and day, looking for drugs, booze or money. She gave Samantha parenting advice, usually along the lines of give the kid up for adoption, your life will be better.”\u003c/p\u003e\n\u003cp\u003e“The woman said that stuff about adoption in front of her grown son?”\u003c/p\u003e\n\u003cp\u003e“Apparently. She badgered Samantha about Landon’s father, if he was paying child support. Between that and the issues with the boyfriend, it got bad enough Samantha left. And no matter what that psycho bitch claimed, Samantha didn’t drink or do drugs during her pregnancy. I believe that.”\u003c/p\u003e\n\u003cp\u003e“Why? Samantha could be feeding you full of shit, Brandt.”\u003c/p\u003e\n\u003cp\u003e“True. But I talked to her aunt and she said Samantha was really sick the entire pregnancy. And Samantha was embarrassed. She barely left the house. As far as what happened after she gave birth to Landon, who knows? She racked up two DUIs. As far as her dumping him off with us for the long haul?\u003c/p\u003e\n\u003cp\u003eNothin’s been decided because she’s still incarcerated.”\u003c/p\u003e\n\u003cp\u003eJessie poured another shot. “There is no ‘us’ in that context. You do understand that, right?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, no. I don’t understand it.”\u003c/p\u003e\n\u003cp\u003e“Where is Samantha right now?”\u003c/p\u003e\n\u003cp\u003eBrandt looked at her skeptically for dodging the question. “In the halfway house. Why?”\u003c/p\u003e\n\u003cp\u003e“How long has she been out of jail?”\u003c/p\u003e\n\u003cp\u003e“A week.”\u003c/p\u003e\n\u003cp\u003e“And in that week has she asked to see her son at all?”\u003c/p\u003e\n\u003cp\u003eThe muscle in his jaw flexed. “No.”\u003c/p\u003e\n\u003cp\u003e“So after being locked up and away from him for months, she’s not chomping at the bit to see how he’s doing? Especially since she left him in the care of virtual strangers?”\u003c/p\u003e\n\u003cp\u003eHe swallowed the whiskey in his shot glass.\u003c/p\u003e\n\u003cp\u003e“And since it’s a halfway house, she could have him overnight at some point. Couldn’t she?”\u003c/p\u003e\n\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003e“Has she asked you if she can have him over Christmas?”\u003c/p\u003e\n\u003cp\u003e“No. But I’m sure she has a—”\u003c/p\u003e\n\u003cp\u003e“Valid excuse?” Jessie supplied. “What? She’s afraid she won’t have time to buy him a Santa gift?\u003c/p\u003e\n\u003cp\u003eNo. The reason she hasn’t asked for him is because she doesn’t want him.”\u003c/p\u003e\n\u003cp\u003e“That’s not true. The halfway house is just that, a place halfway between jail and normalcy. She’s adjusting. She’s got two more months before we should even be talkin’ about this.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” Jessie lifted her glass in a mock toast but didn’t drink. “I will uphold my end of sticking out the full four months. But it will end at four months, Brandt. I have not changed my mind. I like Landon, but he’s not my child. If this whole thing heads south, like I suspect it will, if you want to file for permanent guardianship, fine. You can do that on your own. You don’t need me.”\u003c/p\u003e\n\u003cp\u003e“Why is this so different from if Luke had a kid from a previous relationship and that kid lived with you?” Brandt demanded. “Would you’ve kicked him to the curb after Luke died?”\u003c/p\u003e\n\u003cp\u003eShe shook her finger at him. “Not the same thing. If I knew that kid, if I’d been raising him, I’d continue raising him because chances would be good that kid would have no other alternative and he’d probably consider me his mother. But Landon already has a mother.”\u003c/p\u003e\n\u003cp\u003e“You are impossible to reason with.”\u003c/p\u003e\n\u003cp\u003e“No. I’m right and you know it.”\u003c/p\u003e\n\u003cp\u003e“As long as we’re supposing, what if it comes down to Landon needing a permanent home and I become his legal guardian?”\u003c/p\u003e\n\u003cp\u003e“I’d be happy for Landon because you’d be good for him.”\u003c/p\u003e\n\u003cp\u003e“That’s it? You wouldn’t be a part of either of our lives?”\u003c/p\u003e\n\u003cp\u003eA sharp pain stabbed at her, thinking about walking away from Brandt forever. But unless she wanted to live her life waiting for the other boot to drop, she’d have no choice. “No.”\u003c/p\u003e\n\u003cp\u003eThe bitterness and pain in Brandt’s eyes was like another hot poker to her heart.\u003c/p\u003e\n\u003cp\u003e“Look. I care about him. But he’s not mine, Brandt. He never will be. Even if I pour all my love, my heart and my soul into raising that boy, I’ll never be his real mother. And if Samantha signed off on him as a toddler and had a change of heart or changed her life, ten or so years later? What then? Landon would need to give his mother a chance to be part of his life. I would have to encourage him to forgive her. I would have to let him go. So it’s easier for me to let him go now and save myself years of heartache.”\u003c/p\u003e\n\u003cp\u003e“But aren’t you forgetting the years of joy Landon might bring to your life?”\u003c/p\u003e\n\u003cp\u003eJessie knew she wasn’t getting through to him. Didn’t know if she ever could. “Might doesn’t make right.\u003c/p\u003e\n\u003cp\u003e“That’s bullshit. You don’t know—”\u003c/p\u003e\n\u003cp\u003e“I do too! You have no freakin’ clue what I went through as a kid.”\u003c/p\u003e\n\u003cp\u003e“Then explain it to me.”\u003c/p\u003e\n\u003cp\u003eShe slammed the remainder of the whiskey. “You met Billy Reynolds. He adopted me, but I still wondered about the man who’d fathered me. I still wished he’d come to his senses and search me out, especially when things were bad at home. I can’t tell you how many hours I spent imagining my ‘real’\u003c/p\u003e\n\u003cp\u003efather would show up and rescue me. He’d admit he’d been searching for me for years, he’d tell me how much he loved me and then he’d take me away. I had those stupid daydreams even when I resented the hell out of him for abandoning me.”\u003c/p\u003e\n\u003cp\u003eBrandt stared into the bottom of his empty shot glass. “Don’t you think there were times when I was growing up that I fantasized there’d been some mix up at the hospital and I went home with the wrong people? All kids feel like that at some point in there lives.”\u003c/p\u003e\n\u003cp\u003e“Or they feel like that all the time because it’s not a fantasy, but reality. So you can’t tell me I don’t know how Landon will feel a few years down the road, because I have a pretty good idea. Better than you do.”\u003c/p\u003e\n\u003cp\u003e“Protecting yourself at all costs?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes, maybe for the first time in my life. And even you can’t fault me for that.”\u003c/p\u003e\n\u003cp\u003eThe pointlessness of the conversation prompted her to retreat. Brandt didn’t attempt to stop her.\u003c/p\u003e\n\u003cp\u003eIn her bedroom, she stripped, slipped on her long johns and crawled in bed, burrowing under the covers because she couldn’t seem to get warm. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-44.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
