{"id":70848,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, I wouldn’t say that. I have a feeling Santa is coming a lot of times tonight.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003e“Merry Christmas,” Brandt whispered, nuzzling the back of Jessie’s head.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas to you too.” She yawned. “What time is it?”\u003c/p\u003e\n\u003cp\u003e“Eight.”\u003c/p\u003e\n\u003cp\u003eShe groaned and rolled away from his tempting body. “I told you not to wake me up until noon.”\u003c/p\u003e\n\u003cp\u003e“But somebody woke me up, so I wanted to spread the love.”\u003c/p\u003e\n\u003cp\u003e“Landon is up?”\u003c/p\u003e\n\u003cp\u003e“Yep.” Brandt scooted closer. “Which is a shame because I had great plans involving me tasting your sugar plum first thing this morning.” He whapped her on the rump and she yelped. “Get up. I already fed the animals. I made coffee. And a coffee cake.”\u003c/p\u003e\n\u003cp\u003eShe whipped around so fast they almost bumped noses. “Excuse me? I must’ve had the covers over my ears. I thought I heard you say you made cake.”\u003c/p\u003e\n\u003cp\u003eBrandt smooched her chin. “I did.”\u003c/p\u003e\n\u003cp\u003e“You? Made…cake?”\u003c/p\u003e\n\u003cp\u003e“I have been cookin’ for myself for years, Jess, so I’m not totally helpless in the kitchen.”\u003c/p\u003e\n\u003cp\u003e“I didn’t say you were. I would’ve expected you to whip up scrambled eggs. Or oatmeal. But coffee cake?” Did he know how much she loved coffee cake? “What kind?”\u003c/p\u003e\n\u003cp\u003e“Caramel. It’s warm and gooey, because you know how much I love warm and gooey first thing in the mornin’.”\u003c/p\u003e\n\u003cp\u003eJessie threw the covers back. “If you’re lyin’ to me Brandt McKay, so help me…”\u003c/p\u003e\n\u003cp\u003e“I’m not.” He tossed her a robe. “Come on. The boy is anxious to open his presents.”\u003c/p\u003e\n\u003cp\u003e“Which boy?” she asked his retreating back.\u003c/p\u003e\n\u003cp\u003eHe turned around and grinned. “Both of ’em.”\u003c/p\u003e\n\u003cp\u003eLandon raced over and slammed into her knees. He had two speeds, full throttle and idle. She swooped him up. “Merry Christmas, lil’ buckaroo. Should we see if Uncle Brandt’s cake is edible?”\u003c/p\u003e\n\u003cp\u003e“Yef.”\u003c/p\u003e\n\u003cp\u003e“So agreeable.” She couldn’t resist nuzzling him. He smelled like baby shampoo, orange juice and little boy.\u003c/p\u003e\n\u003cp\u003eBreakfast was fast. Jessie inhaled two pieces of coffee cake and settled in the living room with her new mug that Santa had left for her by the coffee pot.\u003c/p\u003e\n\u003cp\u003eBrandt demonstrated how to rip into wrapping paper and it was over. Landon shrieked while shredding every last inch of Christmas paper from his gifts. Brandt had gone a little overboard buying presents, but he had almost as much fun watching Landon rip the paper as Landon did shredding it.\u003c/p\u003e\n\u003cp\u003e“See? That fire truck has a working siren.” Brandt pushed the button and a really obnoxious whoop whoop whoop erupted.\u003c/p\u003e\n\u003cp\u003eJessie stared at Brandt until he said, “What?”\u003c/p\u003e\n\u003cp\u003e“You picked that out?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Why?”\u003c/p\u003e\n\u003cp\u003e“Because it’s annoying, that’s why.”\u003c/p\u003e\n\u003cp\u003e“All boys love fire trucks. It’s a right of passage. Besides, if you think this one is noisy? You oughta see what Keely bought him.”\u003c/p\u003e\n\u003cp\u003eShe shuddered.\u003c/p\u003e\n\u003cp\u003eLandon hit excitement overload, ignoring his gifts and sitting in the pile of wrapping paper, throwing it in the air, or at Lexie, or tearing it into smaller pieces.\u003c/p\u003e\n\u003cp\u003eTwo unopened gifts remained under the tree. “Aren’t you going to open your present from me, Brandt?”\u003c/p\u003e\n\u003cp\u003e“Don’t you wanna go first?”\u003c/p\u003e\n\u003cp\u003e“Nope. I’m comfy drinking my coffee. You go ahead.”\u003c/p\u003e\n\u003cp\u003eBrandt snagged the box from beneath the tree. When Landon saw another paper ripping opportunity, he loped to Brandt’s side. Brandt said, “I suppose you can help me,” as Landon tore away a chunk of paper.\u003c/p\u003e\n\u003cp\u003eJessie’s stomach knotted. Maybe Brandt would think her gift was stupid. She hid behind her coffee cup as he lifted the lid on the box.\u003c/p\u003e\n\u003cp\u003eWhen Brandt froze, her heart fell to her toes. She prepared for a polite look of interest on his face when he finally glanced up. But all she saw was astonishment. “Jess. I can’t believe you—”\u003c/p\u003e\n\u003cp\u003e“I still use the wallet you made me. It was one of the best gifts I’ve ever gotten.” She dropped her gaze to her coffee cup but she couldn’t keep from babbling. “I don’t know if you still do leatherwork, which you should, because it’d be a damn crying shame to let that talent go to waste. I’m not sure if you have punches like those, but I thought they were cool and if you don’t like them I can take them back—”\u003c/p\u003e\n\u003cp\u003eThen Brandt’s hands were on her face, his mouth was on hers and he was kissing her with such gentleness and gratitude she could scarcely breathe. He pulled away to rest his forehead to hers. “No one has ever…you are…Jess. Thank you. It’s perfect.” He groaned. “And now I’m wishing I could take yours back because it’s nowhere near as—”\u003c/p\u003e\n\u003cp\u003e“Brandt. I’m sure it’s fine.”\u003c/p\u003e\n\u003cp\u003e“I guess we’ll see, won’t we?” Brandt pushed the box to her with his foot and sat on the opposite end of the couch.\u003c/p\u003e\n\u003cp\u003eLandon bulled his way over to help. Jessie lifted the box onto the coffee table and waited as Landon’s next strategic rip revealed…a machine that shampooed carpets. “Wow. Is this really what’s in the box?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I remembered one night we were watching TV and an infomercial came on and you said you always wanted one. But it’s kind of lame, isn’t it?”\u003c/p\u003e\n\u003cp\u003eJessie had zero expectations when it came to receiving gifts. She must’ve waited too long to respond because Brandt swooped down and picked it up off the table.\u003c/p\u003e\n\u003cp\u003e“Never mind, no biggie, I’ll return it.”\u003c/p\u003e\n\u003cp\u003eShe stood and tried to snatch the box out of his hands. “Hey, that’s mine. You gave it to me, so you don’t get to take it back.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to pretend you like it, Jess, just to spare my stupid feelings. It was a dumb gift idea.”\u003c/p\u003e\n\u003cp\u003eShe jerked the box away from him and set it aside so she could get right in his face. “It’s not dumb.\u003c/p\u003e\n\u003cp\u003eIt’s thoughtful and I’m sorry I wasn’t jumping up and down screaming with joy. But I’m not really a scream-and-jump-up-and-down type of woman.”\u003c/p\u003e\n\u003cp\u003eHis cheeks were red with embarrassment. “You don’t have to explain.”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. Because you know what buying that carpet cleaner proved? That you listen to me. That you pay attention to me. So in my mind, the gift is perfect. Thank you.” She brushed her lips across his.\u003c/p\u003e\n\u003cp\u003eOne, two, three, four times. By kiss five he was fully on board, kissing her back.\u003c/p\u003e\n\u003cp\u003e“Up, up!” Landon said, trying to worm between their legs.\u003c/p\u003e\n\u003cp\u003e“So sorry we weren’t payin’ enough attention to you,” Brandt said. “How about if we look at some of the toys you’re ignoring?”\u003c/p\u003e\n\u003cp\u003eAfter Jessie listened to Landon beat on the drums for ten solid minutes, she vowed to get even with Keely. She ducked into the bedroom to get dressed for the McKay family feud. She reminded herself she was doing this for Brandt.\u003c/p\u003e\n\u003cp\u003eWith Landon’s things loaded in the diaper bag, she smooched Brandt on the chin. “No offense, but I’ll take my own truck. That way if you and Landon wanna stay and hang out after the meal, you can.”\u003c/p\u003e\n\u003cp\u003e“That way you won’t get stuck there.”\u003c/p\u003e\n\u003cp\u003e“True.”\u003c/p\u003e\n\u003cp\u003e“Maybe Casper will be on his best behavior,” Brandt offered.\u003c/p\u003e\n\u003cp\u003eJessie said, “Wanna make a bet?”\u003c/p\u003e\n\u003cp\u003eGood thing they didn’t bet on it.\u003c/p\u003e\n\u003cp\u003eCasper was a nightmare. Brandt figured his father had been drinking for several hours before they arrived.\u003c/p\u003e\n\u003cp\u003eIt was the Christmas dinner from hell.\u003c/p\u003e\n\u003cp\u003eCasper ranted about everything under the sun from the stupidity of the government, to inflated cattle prices, to his brothers’ idiotic decisions with running the ranch. He wasn’t blatant in calling his sons brown-nosing, suck ups, when it came to their uncles and cousins, but it was heavily implied.\u003c/p\u003e\n\u003cp\u003eDalton and Tell stuffed their faces rather than engage him.\u003c/p\u003e\n\u003cp\u003eHis mother was up and down throughout dinner, getting this and that. If he hadn’t known better, he’d suspect she was hitting the bottle in between refilling the gravy boat and the bread basket.\u003c/p\u003e\n\u003cp\u003eHowever, for some reason, Casper ignored Jessie completely. He didn’t look at her, didn’t talk to her.\u003c/p\u003e\n\u003cp\u003eIt was as if she was beneath his notice. Brandt comforted himself with the knowledge Jessie was better off being invisible than in Casper’s line of fire.\u003c/p\u003e\n\u003cp\u003eBut no, Casper was just sneakier and waited to approach Jessie until Brandt wasn’t around. He’d cornered her by the bathroom. Casper leaned back with a smug smile when Brandt appeared and grabbed Jessie’s hand. “Come on. Mom is dishing up pie.”\u003c/p\u003e\n\u003cp\u003eJessie left immediately following dessert.\u003c/p\u003e\n\u003cp\u003eBrandt wished he could’ve left, too, but he stayed to watch Landon rip open more presents. He was glad when Landon had a total screaming fit, because it gave him a valid excuse to leave.\u003c/p\u003e\n\u003cp\u003eThe long day had taken its toll, and Landon was down for the count early. Brandt bided his time, waiting to talk to Jessie until after they cleaned up the wrapping paper mess.\u003c/p\u003e\n\u003cp\u003eShe tied the garbage bag and headed outside to dump it.\u003c/p\u003e\n\u003cp\u003eHe followed her. She hadn’t worn a coat and it was freezing out, so she’d be anxious to get the conversation over fast.\u003c/p\u003e\n\u003cp\u003e“What did my father say to you?”\u003c/p\u003e\n\u003cp\u003eShe tried to sidestep him, but he blocked her. “I don’t want to talk about it.”\u003c/p\u003e\n\u003cp\u003e“Tough. What he said upset you.”\u003c/p\u003e\n\u003cp\u003e“Like that’s news, Brandt. Just drop it.”\u003c/p\u003e\n\u003cp\u003eBrandt grabbed her biceps and ran his palms up and down her arms to warm her. “Please. If you don’t tell me it’ll just drive a wedge between us, which is exactly what he wants.”\u003c/p\u003e\n\u003cp\u003e“He said that you’d taken that old bible verse about a man’s responsibility in taking care of his brother’s widow literally and all I am to you is an obligation. That you’d tire of me soon, just like Luke had.”\u003c/p\u003e\n\u003cp\u003eGoddamn good thing he was freezing his ass off, it was probably the only thing keeping his blood from boiling. “That bastard. You know that’s not true. That I—” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-46.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
