{"id":70850,"no":48,"title":"Page 48","content":"\u003cp\u003eBrandt returned from outside and Lexie shot out the door. Landon attempted to chase her, but Brandt caught him around his midsection with one hand. “Whoa, it’s cold and dark out there. And if Lexie’s runnin’ from you, she’s got good reason, so you need to stay put.”\u003c/p\u003e\n\u003cp\u003e“Goggie!”\u003c/p\u003e\n\u003cp\u003e“How about if we have that bath?”\u003c/p\u003e\n\u003cp\u003e“No!” Landon became as limp as a worm.\u003c/p\u003e\n\u003cp\u003eBut Brandt was wise to his tricks. “Nice try, but you’re getting in the tub.”\u003c/p\u003e\n\u003cp\u003e“No! No! No!” echoed down the hallway until the bathroom door shut.\u003c/p\u003e\n\u003cp\u003eJessie told herself if it’d been really bad news, Brandt would’ve told her instead of allowing Landon to distract him. She tidied up the toys, folded up the blankets, swept the floor. By the time she’d finished, a scrubbed Landon barreled toward her and didn’t stop until he’d hit her knees.\u003c/p\u003e\n\u003cp\u003e“That was a fast bath tonight.”\u003c/p\u003e\n\u003cp\u003e“Up!”\u003c/p\u003e\n\u003cp\u003eShe perched him on her hip and he curled into her, nestling his head on front of her shoulder. “I swear when you’re such a sweet-smelling, sweet-acting boy I can almost forgive how you torture my poor dog.”\u003c/p\u003e\n\u003cp\u003eShe smooched his crown.\u003c/p\u003e\n\u003cp\u003e“Are you gonna read to him?”\u003c/p\u003e\n\u003cp\u003eJessie looked up and saw Brandt leaning in the doorjamb, wearing a pensive expression. “I’d planned to. Why?”\u003c/p\u003e\n\u003cp\u003e“No reason.” Brandt smiled. “He just loves it.”\u003c/p\u003e\n\u003cp\u003eA snuggly, attentive Landon was a treat after dealing with his rambunctious ways all day. She settled in the easy chair and grabbed the book on the top of the stack—a book about dinosaurs.\u003c/p\u003e\n\u003cp\u003eBrandt draped Landon’s blanket over him and retreated to the kitchen.\u003c/p\u003e\n\u003cp\u003eLandon’s eyes were drooping by the time she finished the story. She tucked him in his crib and he didn’t fuss about not having a bottle.\u003c/p\u003e\n\u003cp\u003eShe debated whether to crawl in the shower or find out what Brandt’s phone call was about. No contest.\u003c/p\u003e\n\u003cp\u003eBrandt sat in the middle of the couch and patted his lap. “C’mere and give me some sugar.”\u003c/p\u003e\n\u003cp\u003e“In a second. I need a drink.” She poured a glass of water and brought it back to the living room with her. “So you gonna tell me about the phone call? Or just distract me with sex?”\u003c/p\u003e\n\u003cp\u003eHis humor vanished.\u003c/p\u003e\n\u003cp\u003e“Who was it?”\u003c/p\u003e\n\u003cp\u003e“Samantha.”\u003c/p\u003e\n\u003cp\u003eJessie remained standing. “What did she want?”\u003c/p\u003e\n\u003cp\u003e“To tell me she’d been released from the halfway house in Casper.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003eThe muscle in Brandt’s jaw flexed.\u003c/p\u003e\n\u003cp\u003e“When?” she repeated.\u003c/p\u003e\n\u003cp\u003e“Five days ago.”\u003c/p\u003e\n\u003cp\u003e“And she’s just calling you now?”\u003c/p\u003e\n\u003cp\u003e“Evidently she had some stuff—”\u003c/p\u003e\n\u003cp\u003e“I don’t want to hear you make excuses for her, Brandt.”\u003c/p\u003e\n\u003cp\u003e“I’m not.” Brandt rubbed the line of his forehead where his hat usually rested. “It wasn’t her choice, it was a court thing. Anyway, she wants to meet with us. Specifically…you.”\u003c/p\u003e\n\u003cp\u003eJessie had the sensation of falling. Air rushing in her ears, her body bracing for that bone jarring impact. Everything blurred.\u003c/p\u003e\n\u003cp\u003e“Jess?”\u003c/p\u003e\n\u003cp\u003eShe jumped. “What does she want?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eShe didn’t believe him, but picking a fight to get him to come clean wouldn’t be wise. “Where and when will this meeting take place?”\u003c/p\u003e\n\u003cp\u003e“At the Pizza Barn in Moorcroft at noon.” He paused. “The day after tomorrow.”\u003c/p\u003e\n\u003cp\u003e“She can take five fucking days to get her shit together and she gives us thirty-six hours?”\u003c/p\u003e\n\u003cp\u003e“We knew this day was coming. It came more than month earlier than we expected, but it’s not a surprise.”\u003c/p\u003e\n\u003cp\u003e“We’re just supposed to pack his stuff and hand him over?”\u003c/p\u003e\n\u003cp\u003eBrandt’s inquisitive eyes trapped hers. “Yes. Isn’t that what you wanted?”\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eI don’t know.\u003c/p\u003e\n\u003cp\u003eI have no clue what I want anymore.\u003c/p\u003e\n\u003cp\u003eJessie fought a feeling of panic. However her hand remained steady as she drained the glass of water.\u003c/p\u003e\n\u003cp\u003e“Yes, I suppose it is.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e“Well, I’m gonna hit the hay. Night.”\u003c/p\u003e\n\u003cp\u003e“Night, Jess. I’ll come to bed in a bit.”\u003c/p\u003e\n\u003cp\u003eIn her bedroom her fingers were numb as they worked the buttons on her western shirt. Somehow she stripped. Somehow she crawled in bed. Somehow she found the energy to berate herself for her emotional investment with the pesky kid when she’d sworn she wouldn’t let that happen.\u003c/p\u003e\n\u003cp\u003eYet, for the first time in her life, somehow she found the strength not to cry.\u003c/p\u003e\n\u003cp\u003eJessie, girl, you’re such a liar.\u003c/p\u003e\n\u003cp\u003eBrandt had tried to remain neutral, to see if she would be honest and admit her once hard stance toward long term care involving Landon had softened. But she’d thrust out that stubborn chin, denied it and run away.\u003c/p\u003e\n\u003cp\u003eBut she couldn’t deny what he’d seen tonight. What he’d seen the last few months. Jessie’s patience, kindness, firmness and amusement regarding Landon. She loved him.\u003c/p\u003e\n\u003cp\u003eJessie had been exactly right. Landon would break her heart and there wasn’t a damn thing he could do about it. Because it was his fault. He’d brought that heartache right to her.\u003c/p\u003e\n\u003cp\u003eWould she ever forgive him?\u003c/p\u003e\n\u003cp\u003eHe slipped into bed and spooned in behind her. He appreciated she didn’t feign sleep. “You wanna talk?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“You wanna fuck?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eYou want me to tell you I love you, I’ve loved you forever and I’m relieved I don’t have to choose between you and my nephew?\u003c/p\u003e\n\u003cp\u003eHer answer would be nope to that too.\u003c/p\u003e\n\u003cp\u003eBrandt hadn’t told Jessie that Samantha insisted all of Landon’s stuff be boxed up and ready to go.\u003c/p\u003e\n\u003cp\u003eMaybe Samantha was proving she had the power. Maybe she was ready to become a parent to her son. He knew Jessie well enough that if he told her about Samantha’s request, she’d obsess about what it meant.\u003c/p\u003e\n\u003cp\u003eHe called his brothers and asked if they could take Landon tomorrow night, as they’d planned. It might be easier for everyone.\u003c/p\u003e\n\u003cp\u003eThat was a total fucking lie. This wouldn’t be easy on any of them.\u003c/p\u003e\n\u003cp\u003eWhen Brandt informed her Landon would spend the night with Dalton and Tell, rather than them, Jessie fought her urge to lash out at him.\u003c/p\u003e\n\u003cp\u003eWe knew this day was coming.\u003c/p\u003e\n\u003cp\u003eThey’d watched TV like any other night. In bed, Brandt reached for her, like he did every night. His way of dealing with her melancholy wasn’t to match it with sweetness, but to counter it with heat. Lots of heat.\u003c/p\u003e\n\u003cp\u003eBrandt hadn’t been content to stick with the tried and true. After whipping her into a frenzy by making her come three times, once with his fingers, once with his mouth and once with her vibrator, he pushed her on her back. While remaining on his knees, he hooked her right leg over his right shoulder. He turned her lower body sideways so he could imprison her left thigh between the back of his left thigh and his calf. Then he fucked her. He controlled everything. The depth of his thrusts. The spread of her pussy, and the contact point where her clit abraded his groin.\u003c/p\u003e\n\u003cp\u003eOh, it was breathtaking, watching his ferocious man master her. Teach her. Pleasure her. Mesmerized by the fire in his eyes, Jessie had just held on, as her body became his playground. He watched her breasts bounce with every deep thrust. He watched her bring herself to orgasm. He watched his cock shuttling in and out of her pussy. When Brandt started to come, he turned, sinking his teeth into the outside of her thigh right by his head, giving her the sexiest love bite she’d ever had. They’d both collapsed.\u003c/p\u003e\n\u003cp\u003eHe’d tucked her against his naked body, like he did every night, and drifted off.\u003c/p\u003e\n\u003cp\u003eShe slept for maybe an hour or two and then she’d lain in his arms, restless. She disentangled from his embrace and snuck out to the kitchen.\u003c/p\u003e\n\u003cp\u003eA cup of hot herbal tea didn’t induce sleepiness. She didn’t dare clean or she’d wake Brandt. So she sat on the couch and tried to process everything that’d gone on the last three months.\u003c/p\u003e\n\u003cp\u003eJessie wasn’t sure why Samantha had insisted on talking to her face to face. Was Samantha gauging her fitness as Landon’s temporary guardian before she dropped the bomb she wasn’t ready to resume fulltime parenting responsibilities yet?\u003c/p\u003e\n\u003cp\u003eFor the past day, Jessie wrestled with the situation regarding Landon, the facts, the fears, the promises given and the promises broken. Mostly she weighed the promises she’d made to herself to keep an almost clinical detachment for the boy, to set a time limit for how long she’d allow herself to care for him. It was laughable now, thinking she could ever protect her heart from such a sweet soul, from Luke’s son.\u003c/p\u003e\n\u003cp\u003eIt was pitiful that she’d ever even tried.\u003c/p\u003e\n\u003cp\u003eSince she’d insisted Brandt didn’t discuss anything involving Landon’s mother, she couldn’t bring up the fact she’d changed her mind about everything. Not until tomorrow.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Two\u003c/p\u003e\n\u003cp\u003eJessie loitered outside the Pizza Barn in Moorcroft. She kept her phone to her ear, pretending to be in the middle of an important conversation.\u003c/p\u003e\n\u003cp\u003eStop stalling.\u003c/p\u003e\n\u003cp\u003eShe pocketed her cell and entered the restaurant. Normally she took a second to breathe in the tangy scents of oregano, tomato sauce, spicy meat and cheese, and the earthy aroma of baking crust. But today, she didn’t smell a thing.\u003c/p\u003e\n\u003cp\u003eProbably because you’re holding your breath.\u003c/p\u003e\n\u003cp\u003eTwo tables had customers. One booth held an older couple chowing down on pizza. A petite woman sat in the other booth, stirring a glass of soda. Had to be Samantha.\u003c/p\u003e\n\u003cp\u003eJessie’s heart galloped as she slowly crossed the room and stopped in front of the booth. “Samantha?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I’m Jessie.” She slid into the opposite seat without being asked, and scrutinized the woman without apology.\u003c/p\u003e\n\u003cp\u003eSamantha Johnston looked young now, so Jessie couldn’t fathom how young she must’ve looked two and a half years ago. Her body type was slight. Not busty. An air of fragility surrounded her. A feature Jessie recognized because she’d had that same trait when she’d met Luke McKay. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-48.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
