{"id":70859,"no":57,"title":"Page 57","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAnd what Dash Paulson found sort of shocked us.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“We were under the impression that if just one of us wanted to sell our portion of the ranch, the other three owners would be forced to sell theirs too. Which is how Casper tried to control us, or at least got away with a lot more shit than we would’ve let him, had we known the real legalities of the matter.”\u003c/p\u003e\n\u003cp\u003eCarson pointed with his beer bottle. “It entails lots of legal gibberish that took us slow readin’\u003c/p\u003e\n\u003cp\u003eranchers some time to understand, but the bottom line is we were wrong. Casper never had the power to force us to sell.”\u003c/p\u003e\n\u003cp\u003eBrandt held up his hand. “Wait a second. My dad threatened to sell his portion of the ranch?”\u003c/p\u003e\n\u003cp\u003e“Several times over the years. To be honest, he even went as far as to have it appraised about six months after Luke died.”\u003c/p\u003e\n\u003cp\u003eThat son of a bitch. “Why?”\u003c/p\u003e\n\u003cp\u003e“So he could point out what idiots we were for keepin’ it, when we could have more money in our pockets than we could ever spend.”\u003c/p\u003e\n\u003cp\u003e“How much money we talkin’?”\u003c/p\u003e\n\u003cp\u003eThe three brothers exchanged a look. Then Carson met his gaze. “On paper? Over eighty million dollars.”\u003c/p\u003e\n\u003cp\u003e“Holy fucking shit.”\u003c/p\u003e\n\u003cp\u003e“So yeah, Casper thought he had the ace in the hole, thinkin’ if we wanted to buy out his portion of the ranch, it’d cost us over twenty million dollars each. Which none of us have in cash obviously.”\u003c/p\u003e\n\u003cp\u003eBrandt looked at Cal. “What is the legal discrepancy the lawyer found?”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you, my daughter in law is one smart cookie. Ginger and her dad pored over the paperwork the last couple days and discovered a clause written into the original trust that’d been forgotten.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“Majority rules,” Charlie said. “We’d intended to talk to Casper about it, but he’s been such a prick…” He looked at Jessie. “Sorry, Jess.”\u003c/p\u003e\n\u003cp\u003e“If anyone knows how much of a prick Casper can be, it’s Jessie.” Brandt kissed her hand. “I’m assuming he told you the choice he gave me?”\u003c/p\u003e\n\u003cp\u003e“Yeah. He said he wanted you off the payroll and to treat your departure the same as we had when Chase, Carter, Cam and Keely opted out of the land trust.”\u003c/p\u003e\n\u003cp\u003eSeemed his father really did want to leave him destitute.\u003c/p\u003e\n\u003cp\u003e“’Course, we said no.” Carson grinned. “Then we sprang the ‘majority rules’ clause on him. Which means we all have a say in what happens to his portion of the ranch, but only as it relates to naming his successors.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“We can’t take over or sell his portion of the ranch, but we can give control to his descendents. So you, Tell and Dalton now call the shots. Your father has officially been retired from ranching. He’ll still receive a portion of the profits, but as far as the day-to-day operations and decision makin’? You and your brothers are in charge.”\u003c/p\u003e\n\u003cp\u003eBrandt couldn’t keep his jaw from dropping. “Are you serious?”\u003c/p\u003e\n\u003cp\u003e“Completely. But we should also point out in doin’ this we couldn’t single out your father. So me’n Cal and Charlie all officially retired too. The fourth generation of McKays are now one hundred percent in charge of the McKay cattle company and the ranch.”\u003c/p\u003e\n\u003cp\u003e“So…you knew this all when my dad came to see you?”\u003c/p\u003e\n\u003cp\u003e“No. We listened to him, told him we’d hafta wait until Monday to talk to the attorney. Then Tuesday we met up and told him what we’d decided.”\u003c/p\u003e\n\u003cp\u003e“How’d he take it?”\u003c/p\u003e\n\u003cp\u003eThey exchanged another look and Cal spoke. “He didn’t say a lot, Brandt, bein’s that he was dealin’\u003c/p\u003e\n\u003cp\u003ewith your mother leavin’ him.”\u003c/p\u003e\n\u003cp\u003e“We couldn’t tell him where Joan’s been stayin’,” Carson said. “Caro and Kimi and Vi have spent the last few days helpin’ her…hell, I don’t know what the four of ’em have been doin’.”\u003c/p\u003e\n\u003cp\u003eA minute or so of awkward silence hung in the air.\u003c/p\u003e\n\u003cp\u003e“Do you have any questions?” Carson asked.\u003c/p\u003e\n\u003cp\u003e“About a million. But they’ll keep. Wait, there is one, since I went off her grid for a few days.” He sent Jessie an apologetic look. “Did you talk to Tell or Dalton about any of this?”\u003c/p\u003e\n\u003cp\u003eCharlie shook his head. “As a matter of fact, we haven’t told our sons about it yet. Wanted to let you know first, since it changes everything for you and your brothers.”\u003c/p\u003e\n\u003cp\u003eThat floored him. He’d gone from flipping through the classifieds to find work to finding out he had a bigger stake in the ranch than before.\u003c/p\u003e\n\u003cp\u003e“No doubt our boys will be on board, happy to be kickin’ the old men to the curb,” Carson said dryly.\u003c/p\u003e\n\u003cp\u003e“Little do they know we’re gonna be watchin’ them closer than ever.”\u003c/p\u003e\n\u003cp\u003e“Yeah, only thing that’ll change is we ain’t haulin’ our asses outta bed to do chores at the crack of nothin’ any more,” Cal said.\u003c/p\u003e\n\u003cp\u003e“A benefit of bein’ retired,” Charlie added. “Effective immediately.”\u003c/p\u003e\n\u003cp\u003eAll three men laughed. Then they stood.\u003c/p\u003e\n\u003cp\u003e“We’d best get on our way so we can have this same conversation again. Luckily, all the boys will be together later this afternoon so we’ll only have to do it once.”\u003c/p\u003e\n\u003cp\u003eBoys. Brandt wondered if these guys would still be calling them boys when they were in their sixties.\u003c/p\u003e\n\u003cp\u003e“I’d like to be a part of the conversation, if you don’t mind. Me’n Tell and Dalton.”\u003c/p\u003e\n\u003cp\u003e“Thinkin’ of makin’ some changes already?” Carson asked.\u003c/p\u003e\n\u003cp\u003e“We’ll see, but it’ll nice to be involved in the decision makin’ process for once.”\u003c/p\u003e\n\u003cp\u003e“Agreed.”\u003c/p\u003e\n\u003cp\u003eBrandt slipped his arm around Jessie’s waist and pulled her close. “Anything else?”\u003c/p\u003e\n\u003cp\u003e“Just one.” Carson looked between Brandt and Jessie. “We’re all happy for you two.”\u003c/p\u003e\n\u003cp\u003eHe waited for Carson to add something, like Luke would be happy for them, too, or advise them to start having McKay babies, but he turned away and spoke to Cal as they put on their winter wear.\u003c/p\u003e\n\u003cp\u003e“Did you hear what Liesl did the other day?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Eliza told me.”\u003c/p\u003e\n\u003cp\u003e“Was she in on it?”\u003c/p\u003e\n\u003cp\u003e“No, but I swear them two girls are gonna be more trouble than all their male cousins combined.”\u003c/p\u003e\n\u003cp\u003e“Probably more than their uncles and fathers combined,” Charlie offered.\u003c/p\u003e\n\u003cp\u003eAll three men groaned on their way out the door.\u003c/p\u003e\n\u003cp\u003eBrandt tugged Jessie on his lap and just held her, trying to process everything. And she rested her head into that spot on his body that’d been made for her.\u003c/p\u003e\n\u003cp\u003e“What’re you thinkin’ about?”\u003c/p\u003e\n\u003cp\u003e“How it’s sad your uncles’ wives are finally offering Joan support now, when she doesn’t need it. She needed it years ago.”\u003c/p\u003e\n\u003cp\u003eBrandt kissed her forehead. “It’s sweet of you to stand up for her, Jess, but my mom should’ve asked for support years ago. Plus, it just goes to show you that it’s never too late to change.”\u003c/p\u003e\n\u003cp\u003e“True. Do you think Joan just needs time away? That she and Casper will get back together down the road?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I plan on keeping my nose out of their marriage and I hope they extend us the same courtesy.”\u003c/p\u003e\n\u003cp\u003eJessie wrapped her arms around his neck. “Speaking of marriage…when are we making it official?”\u003c/p\u003e\n\u003cp\u003e“Within the week, Jess. I’m not givin’ you time to change your mind. So pick a day.”\u003c/p\u003e\n\u003cp\u003e“You’re serious?”\u003c/p\u003e\n\u003cp\u003e“I’ve never been more serious in my life. Let’s do it as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“But what about—”\u003c/p\u003e\n\u003cp\u003eBrandt smothered her protest with a kiss. A kiss that heated rapidly, as kisses between them were prone to do. He kept kissing her, pouring everything of himself, everything he was feeling into her. He rested his forehead to hers. “I want to spend my life with you, Jessie. Every day. With you as my wife. I don’t want to wait because my feelings ain’t ever gonna change.”\u003c/p\u003e\n\u003cp\u003e“I feel the same.” Jessie laughed. “Okay. Let’s do it.”\u003c/p\u003e\n\u003cp\u003e“How about Friday?”\u003c/p\u003e\n\u003cp\u003e“Oh. Wait. It’s not Friday the thirteenth, is it?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Knowing our luck, it probably is. But I can’t help but think our luck is about to change.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-57.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
