{"id":70810,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLandon’s whole body wiggled, he was so excited.\u003c/p\u003e\n\u003cp\u003eSo Brandt kept helping the boy pet the dog, keeping Lexie’s head and teeth away from Landon’s poking fingers. He shot a glance toward Jessie, but she hadn’t moved.\u003c/p\u003e\n\u003cp\u003eCome on, Jess. You can do this. I know you can.\u003c/p\u003e\n\u003cp\u003eThree things happened while he was silently begging Jessie to look at them. His cell phone rang in his back pocket. As he shifted to reach for it, he stepped on Lexie’s tail. She yipped and scampered away, heading toward Jessie. When he loosened his hold on Landon, the monkey kid jumped down and raced after the dog.\u003c/p\u003e\n\u003cp\u003eBut Lexie had wormed her way between Jessie and the kitchen cabinet. Before Brandt could catch Landon, he smacked into the back of Jessie’s calves, squealing, determined to get a hold of the dog.\u003c/p\u003e\n\u003cp\u003eStartled, Jessie spun around and knocked Landon to the floor. He landed with a thud on his diapered butt and cried out.\u003c/p\u003e\n\u003cp\u003eThe rest of it happened in slow motion.\u003c/p\u003e\n\u003cp\u003eJessie instinctively picked him up, with a reassuring, “You’re okay,” and smoothed her hand over his dark head.\u003c/p\u003e\n\u003cp\u003eBrandt watched, not breathing, as Jessie realized what she’d done.\u003c/p\u003e\n\u003cp\u003eA tiny gasp escaped. Her hand froze, as if the kid had suddenly become radioactive, but her gaze tracked every inch of Landon’s face.\u003c/p\u003e\n\u003cp\u003e“My God. I can’t believe how much he looks like Luke.”\u003c/p\u003e\n\u003cp\u003e“It’s a little spooky.” He took another step closer. “I’ll take him, if you want.”\u003c/p\u003e\n\u003cp\u003eShe swallowed with difficulty. “No. It’s okay. I’ve got him.”\u003c/p\u003e\n\u003cp\u003e“You sure you’re all right?”\u003c/p\u003e\n\u003cp\u003e“No, not really.”\u003c/p\u003e\n\u003cp\u003eTell her she doing great.\u003c/p\u003e\n\u003cp\u003eThe words stuck in his throat. An excruciatingly long minute passed before he said, “I didn’t mean—”\u003c/p\u003e\n\u003cp\u003e“I said I’m working on it, Brandt. Just give me a second.”\u003c/p\u003e\n\u003cp\u003eHe nodded. He’d give her all the time she needed.\u003c/p\u003e\n\u003cp\u003eJessie hiked Landon higher on her hip. He seemed to be studying Jessie as closely as she was studying him.\u003c/p\u003e\n\u003cp\u003eThen Landon pointed to a package of crackers on the counter and grunted.\u003c/p\u003e\n\u003cp\u003e“Has he eaten anything?”\u003c/p\u003e\n\u003cp\u003e“Not since I’ve picked him up.”\u003c/p\u003e\n\u003cp\u003e“Does he have food allergies?”\u003c/p\u003e\n\u003cp\u003eBrandt scratched his chin. “Not that she mentioned.”\u003c/p\u003e\n\u003cp\u003e“Maybe she left instructions.” She wandered into the living room and rummaged in the diaper bag.\u003c/p\u003e\n\u003cp\u003eLandon started to fuss when she pulled out an empty bottle. She frowned. “He’s still on a bottle?”\u003c/p\u003e\n\u003cp\u003e“I guess. Is that bad?”\u003c/p\u003e\n\u003cp\u003e“Most kids I’ve dealt with have been weaned by this age. But I’ll be the first to admit all kids develop differently, so I’m not sure.” She dug out a can of baby formula and studied it. “This is a special formula for underweight toddlers. It has more nutrients than regular formula.” When Jessie realized she’d been babbling, she backtracked, “I only know this because one of the kids at Sky Blue was on this formula until she turned two.”\u003c/p\u003e\n\u003cp\u003e“Good to know,” Brandt murmured.\u003c/p\u003e\n\u003cp\u003e“Here.” She passed Landon to him. “Entertain him while I fix his bottle.”\u003c/p\u003e\n\u003cp\u003eLexie decided to give Landon another chance and let herself be petted, patted and pulled on. By the time Jessie brought the full bottle over, Landon was antsy for it.\u003c/p\u003e\n\u003cp\u003eBrandt held Landon while the kid sucked down his bottle, keeping an eye on Jessie.\u003c/p\u003e\n\u003cp\u003eShe sat in the couch, knees drawn to her chest. Her gaze hadn’t wandered from Landon for several long minutes. “You knew once I saw him I wouldn’t say no, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’d hoped.”\u003c/p\u003e\n\u003cp\u003e“So what now?”\u003c/p\u003e\n\u003cp\u003e“Now I need to know if you’re really on board with this.”\u003c/p\u003e\n\u003cp\u003e“It’s temporary, right?”\u003c/p\u003e\n\u003cp\u003e“Right. Samantha was sentenced to two months in jail in Lusk and two months in a halfway house in Casper. Which might actually end up less time if she exhibits good behavior.”\u003c/p\u003e\n\u003cp\u003e“So we’re looking at four months before she’s out and can take him back.”\u003c/p\u003e\n\u003cp\u003e“Roughly.”\u003c/p\u003e\n\u003cp\u003eShe tipped her head back and sighed. “I can’t believe I’m saying this…but okay. I’ll help you.”\u003c/p\u003e\n\u003cp\u003eBrandt nearly shouted with relief. “You are an amazing woman, Jess. Thank you, for doin’ this.”\u003c/p\u003e\n\u003cp\u003e“Before you sing my praises, I have a couple of conditions that we can talk about after I hear the plan you’ve sketched out with me on board.”\u003c/p\u003e\n\u003cp\u003e“What makes you think I’ve got more than one plan?”\u003c/p\u003e\n\u003cp\u003eJessie gave him a wry look. “Because I know you, Brandt McKay. You prepare for every possibility.”\u003c/p\u003e\n\u003cp\u003e“I’m not exactly a go with the flow kind of guy.”\u003c/p\u003e\n\u003cp\u003e“That’s not a bad thing. In fact, it’s a better trait than impulsiveness.”\u003c/p\u003e\n\u003cp\u003e“You always say that.” He smiled. “I figured since you work in a daycare, and if Skylar was okay with it, you could take Landon to work with you. Not every day. Three days a week.” Brandt suspected it’d be harder to convince Jessie than her boss Skylar, married to Brandt’s cousin Kade, to agree to the arrangement.\u003c/p\u003e\n\u003cp\u003e“It’ll be good for him to be around other kids. I’m no expert, but he seems to be behind in stuff, like…talking.”\u003c/p\u003e\n\u003cp\u003eHer eyebrows rose. “He doesn’t talk at all?”\u003c/p\u003e\n\u003cp\u003e“I’ve heard him say no and mama and goggie, which means doggie as far as I can tell. That’s it.”\u003c/p\u003e\n\u003cp\u003e“When I take Landon to daycare with me, I won’t be spending all my time with him teaching him to talk. In fact, it’ll present a conflict.”\u003c/p\u003e\n\u003cp\u003e“How so?”\u003c/p\u003e\n\u003cp\u003e“After Sky hired me, she changed the daycare structure. Before, because each employee had kids, they had to rotate into the daycare for a week. But since I don’t have kids and wasn’t trained for factory work, she made me fulltime in the daycare. I won’t put Sky in the position of assuring her employees—\u003c/p\u003e\n\u003cp\u003ewho are also my friends—that Landon won’t be getting all my attention.”\u003c/p\u003e\n\u003cp\u003e“Anyone who knows you, Jess, understands you won’t play favorites.”\u003c/p\u003e\n\u003cp\u003e“No need to flatter me. I already said yes.” She ran an agitated hand through her hair. “What happens after the five o’clock whistle blows?”\u003c/p\u003e\n\u003cp\u003e“After I’m done workin’ on the ranch during the week, I’ll be at your place.”\u003c/p\u003e\n\u003cp\u003e“Every night?”\u003c/p\u003e\n\u003cp\u003eWas that alarm in her tone? “Yes. Why?”\u003c/p\u003e\n\u003cp\u003e“You didn’t say a dang thing about moving in with me, Brandt.”\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t say I wasn’t movin’ in with you either.” He gave her his most charming grin.\u003c/p\u003e\n\u003cp\u003eShe didn’t even crack a smile.\u003c/p\u003e\n\u003cp\u003e“To be blunt, my place is too far away. It doesn’t make sense for us to drive back and forth a couple times a day. I’ll be here after you get off work to take care of him, including anything he needs at night. In the morning you guys will go to Sky Blue, I’ll head to the ranch.”\u003c/p\u003e\n\u003cp\u003e“There’s some other reason you’re insisting on this happening here at my place, so spill it.”\u003c/p\u003e\n\u003cp\u003eBrandt sighed. “It’d be easier for everyone if I wasn’t livin’ so close to my folks while he’s under my guardianship.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, I can see where it’d be so much better if you tell Casper you’re living with me.”\u003c/p\u003e\n\u003cp\u003e“Guess I didn’t think that one through, did I?”\u003c/p\u003e\n\u003cp\u003e“No.” Jessie’s eyes kept wandering to Landon. “I just want you to make sure they both understand that this was not my idea, Brandt.”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“And as long as we’re heading down this road, I have a few conditions. First, I will not have any contact with Landon’s mother. Period. You will deal with her. I don’t want to hear about how she’s doing in jail or any of her problems. Ever.”\u003c/p\u003e\n\u003cp\u003e“That sounds reasonable.”\u003c/p\u003e\n\u003cp\u003e“Second, I will not have any contact with Casper. Your mom? Fine. Casper. No way.”\u003c/p\u003e\n\u003cp\u003e“Understood. Which is why it’ll be best that I stay here for the most part.”\u003c/p\u003e\n\u003cp\u003e“Third, I’m done in four months. Regardless of what Landon’s mother does, or what you’ve promised her beyond that, my part in helping you is finished.” Brandt started to speak, but she cut him off. “I’m not kidding about this. Four months. That’s it.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003e“I know I won’t have to spell it out to you that I won’t be doing everything myself for this kid, like feeding him, changing him, entertaining him, plus all the regular household stuff I already do.”\u003c/p\u003e\n\u003cp\u003e“And why don’t you have to spell it out for me?”\u003c/p\u003e\n\u003cp\u003eJessie looked away. “Because you’re not like Luke. For the record, that’s a compliment. You’d never ask me to help you and then abandon me.”\u003c/p\u003e\n\u003cp\u003eYeah, Luke had been awesome at that. He’d called it delegating. Everyone else called it bullshit.\u003c/p\u003e\n\u003cp\u003e“Anything else?” he asked.\u003c/p\u003e\n\u003cp\u003e“Last thing. You won’t bring women into my house and no expecting me to baby-sit while you’re out on the town.”\u003c/p\u003e\n\u003cp\u003eBrandt looked at her sharply but kept his voice down. “Jesus, Jessie, you really think I’d bring another woman into your home? You think I’m that heartless I wouldn’t give a damn about your feelings just so I could get my rocks off? Wrong, especially now that I’m—” He snapped his mouth shut, just in time.\u003c/p\u003e\n\u003cp\u003eDammit, he’d almost been goaded into admitting that he was exactly where he wanted to be.\u003c/p\u003e\n\u003cp\u003e“What Brandt? Now that…?”\u003c/p\u003e\n\u003cp\u003e“Now that I’m forced to pick up the pieces of Luke’s stupidity once again. The thought of me causin’\u003c/p\u003e\n\u003cp\u003emore shit for you to deal with rips me apart, Jess. What don’t you understand about that?”\u003c/p\u003e\n\u003cp\u003eBy her startled look, she hadn’t foreseen that answer. Then again, he hadn’t expected Jessie to make demands of her own. And he had a sneaking suspicion she wasn’t done making demands. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-8.html","bookId":2691,"creation":"Oct 5, 2019 10:18:11 AM","modification":"Oct 5, 2019 10:18:11 AM"}
