{"id":101541,"no":25,"title":"Page 25","content":"\u003cp\u003eKissing the top of his curly head, she was amazed at all Pam managed to do with a houseful of preschoolers. Scotty had only been with her a couple of hours and already she was emotionally and physically exhausted.\u003c/p\u003e\n\u003cp\u003eAndrew arrived just then, leaning indolently against the door frame, his face wide with a saucy grin. “It looks like you could use a nap yourself.”\u003c/p\u003e\n\u003cp\u003e“No one ever told me toddlers could be so exhausting,” Leah admitted.\u003c/p\u003e\n\u003cp\u003e“Here,” Andrew whispered, gently lifting Scotty from her arms. “Let’s put him to bed.”\u003c/p\u003e\n\u003cp\u003eMoving around her husband, Leah turned back the sheets and Andrew carefully laid the sleeping child onto the mattress. Covering him with the quilt, Leah bent down and kissed her godson’s forehead.\u003c/p\u003e\n\u003cp\u003eNeither Andrew nor Leah were in any hurry to leave the room. Standing next to her husband, she nestled in the warm security of Andrew’s arms, her head resting against the solid wall of his chest.\u003c/p\u003e\n\u003cp\u003e“He’s really something, isn’t he?” Andrew said softly, so as not to disturb Scotty’s sleep.\u003c/p\u003e\n\u003cp\u003e“He’s a ball of energy.”\u003c/p\u003e\n\u003cp\u003eAndrew kissed the side of her neck. “Come on, I think we could do with a nap ourselves.”\u003c/p\u003e\n\u003cp\u003eFrom the way he made the suggestion, Leah knew resting was the last thing on her husband’s mind. She caught his eye, and whispered regretfully, “Andrew, we can’t.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Scotty might wake and—”\u003c/p\u003e\n\u003cp\u003e“Do you think Doug and Pam worry about that? Besides, I can be real quiet, and with some effort so can you,” he whispered, steering her toward their bedroom.\u003c/p\u003e\n\u003cp\u003eSometime later, Leah woke to the sounds of someone hopping up and down at the foot of her bed. She rolled onto her back to find Scotty doing a marvelous impression of a kangaroo.\u003c/p\u003e\n\u003cp\u003e“Hi, Scotty.”\u003c/p\u003e\n\u003cp\u003eHe was holding onto his front with both hands, his eyes wide and appealing.\u003c/p\u003e\n\u003cp\u003e“Scotty?” she asked, sitting up, clenching the sheets to her breasts. “Do you need to go potty?”\u003c/p\u003e\n\u003cp\u003e“That would be my guess,” Andrew said, yawning. “Come on, fellow, I’ll show you the way.” Lifting the boy into his arms, Andrew carried him to the bathroom.\u003c/p\u003e\n\u003cp\u003eLeah grabbed her sweater and finished dressing. “How’s everything going in there?” she called out.\u003c/p\u003e\n\u003cp\u003e“Not good. He seems to need something.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eScotty apparently didn’t trust Andrew to properly relay the message. “I need my blanky . . . I need my blanky . . . I need my blanky.”\u003c/p\u003e\n\u003cp\u003eLeah retrieved the yellow monstrosity in record time and rushed back into the bathroom where Andrew was holding Scotty over the toilet seat. The boy grabbed the blanket, and held it against his face. As soon as the blanket was in position, he released a long, grateful sigh and relaxed.\u003c/p\u003e\n\u003cp\u003eWhen Scotty finished, Andrew sagged onto the side of the bathtub. “What was that all about?”\u003c/p\u003e\n\u003cp\u003e“Pam said something about forgetting his toilet seat. He must have been terrified of being perched up there.”\u003c/p\u003e\n\u003cp\u003eAndrew looked at Leah and she looked at him and soon the two of them dissolved into giggles.\u003c/p\u003e\n\u003cp\u003e“I’m a big boy,” Scotty insisted, looking downright proud of himself, his laughter mingling with theirs.\u003c/p\u003e\n\u003cp\u003eMonica was convinced Michael would guess that Chet was hiding behind the door in the other room. Why Chet felt he needed to disappear, she could only speculate.\u003c/p\u003e\n\u003cp\u003eThe man was a fool to show up at the church this way. She’d wanted to shout at him, and throw the entire contents of her filing cabinet in his face. Heaven knew he deserved that and far worse. Why, she should have slapped him silly.\u003c/p\u003e\n\u003cp\u003eShe would have, too, if she hadn’t been so pleased to see him.\u003c/p\u003e\n\u003cp\u003e“Your hair looks especially nice today,” Michael said with glowing approval.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Knowing Chet, it was probably all he could do to keep from leaping out from behind the door and commenting that he’d been the one to suggest the change.\u003c/p\u003e\n\u003cp\u003e“I’m playing the piano for the Methodists’ church cantata this evening,” Michael was saying. “Their regular pianist came down with the flu. I thought I’d stop by and see if you’d like to come along.”\u003c/p\u003e\n\u003cp\u003e“Tonight?” Monica asked, stalling for time. In truth she was looking for an excuse, anything to get out of this date, but nothing readily presented itself.\u003c/p\u003e\n\u003cp\u003e“I mentioned this evening to your father and he said you didn’t have anything planned,” Michael pressed.\u003c/p\u003e\n\u003cp\u003e“No, I don’t believe I do.” So her father had put him up to this. She should have realized that sooner.\u003c/p\u003e\n\u003cp\u003eMichael hesitated, glancing at her as if he were waiting for her to say something more. Uncertain, Monica steadily met his look.\u003c/p\u003e\n\u003cp\u003e“Did Lloyd mention anything about dinner?”\u003c/p\u003e\n\u003cp\u003e“Dinner?” She knew she was beginning to sound like a parrot. “Why, yes. Dad did say something this morning about having you over for dinner some evening. We’d be more than happy to have you join us, if you’d like.”\u003c/p\u003e\n\u003cp\u003e“Tonight?”\u003c/p\u003e\n\u003cp\u003e“Tonight . . . why, sure . . . tonight would be perfect, wouldn’t it, since I’ll be there for the Methodists’ cantata.”\u003c/p\u003e\n\u003cp\u003e“What time?”\u003c/p\u003e\n\u003cp\u003e“Six,” she said automatically, willing to agree to anything that would convince him to leave faster. Knowing Chet was listening in on the conversation made matters ten times worse.\u003c/p\u003e\n\u003cp\u003e“Great,” Michael said, looking well pleased with himself, “I’ll see you around six, then. Would you like me to bring anything?”\u003c/p\u003e\n\u003cp\u003e“No. Everything’s under control. Good-bye, Michael,” she said, sitting back down at the computer, hoping he’d take the hint and kindly leave while her sanity was intact. She placed her hands on the keyboard until she noticed how badly she was trembling and immediately lowered them to her lap.\u003c/p\u003e\n\u003cp\u003e“I’ll look forward to this evening,” he said, reluctantly moving toward the door. He was looking for an excuse to stay, but she refused to give him one.\u003c/p\u003e\n\u003cp\u003eDespite her obvious signs of distress, she tried to concentrate on the computer screen.\u003c/p\u003e\n\u003cp\u003e“Your father claims you’re a fabulous cook.”\u003c/p\u003e\n\u003cp\u003e“I do a fair job,” she muttered. This was getting worse every minute and she didn’t know how much more she could bear.\u003c/p\u003e\n\u003cp\u003e“Good-bye for now.”\u003c/p\u003e\n\u003cp\u003e“Good-bye, Michael,” she said, closing her eyes in relief.\u003c/p\u003e\n\u003cp\u003eMichael left then and the door closed with a soft clicking sound. The instant he was gone, Monica leaped out of her chair, raced around her desk and into her father’s study. By the time she arrived she was both breathless and furious.\u003c/p\u003e\n\u003cp\u003e“Why’d you hide?” she demanded. “Of all the crazy things you’ve said and done in the last few weeks, this takes the cake.”\u003c/p\u003e\n\u003cp\u003e“It would have required awkward explanations,” was all he’d say.\u003c/p\u003e\n\u003cp\u003e“Well, he’s gone now.”\u003c/p\u003e\n\u003cp\u003e“So I see.” A frown darkened Chet’s face and he glared at her. “So you’re going to continue seeing him despite what I said.”\u003c/p\u003e\n\u003cp\u003e“What choice did I have?” she cried, throwing her arms into the air. “I said what I had to, to get him to leave. Besides, what business is it of yours who I do or do not date?” How could he say such things to her when he was the one who’d put her in this predicament!\u003c/p\u003e\n\u003cp\u003eIt took him a long time to answer. “You’re right, it’s none of my damn business.”\u003c/p\u003e\n\u003cp\u003eMonica was pleased that Chet did care, but she didn’t want him to know it.\u003c/p\u003e\n\u003cp\u003e“Michael’s not so bad,” he said after a moment. “It’s plain as day that he’s crazy about you.”\u003c/p\u003e\n\u003cp\u003eThe man was full of surprises. First he demanded that she stay away from Michael and now he was urging her to see the other man.\u003c/p\u003e\n\u003cp\u003eChet’s eyes were clouded as if he carried the weight of the world on his shoulders. “I should never have come.”\u003c/p\u003e\n\u003cp\u003eHe strode past her and in her heart Monica knew if he walked out the door she’d never see him again. She had to do something.\u003c/p\u003e\n\u003cp\u003eHe was all the way across the room, his hand on the doorknob, before she found the courage to speak. “Don’t go.” She advanced a single step toward him and stopped.\u003c/p\u003e\n\u003cp\u003eChet turned around slowly as if he wasn’t sure he’d heard her correctly. Gradually a grin danced its way across his lips. “You don’t want me to leave?”\u003c/p\u003e\n\u003cp\u003eHer tongue was trapped against the roof of her mouth and she shook her head, unable to say the words a second time. It had demanded every ounce of courage she possessed the first time.\u003c/p\u003e\n\u003cp\u003eHis gaze narrowed into thin, disbelieving slits. “Why not?”\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003e“Come on, sweetheart, you can do better than that.”\u003c/p\u003e\n\u003cp\u003e“Don’t call me that.” She backed away from him, as far as she could go, until her buttocks were pressed against the edge of her desk.\u003c/p\u003e\n\u003cp\u003e“What would you like me to call you?”\u003c/p\u003e\n\u003cp\u003eIt was a mistake to have asked him to stay, a mistake to let him know how much of the time he dominated her thoughts. He made her weak where she’d once been strong, and she’d found no compensation for what she’d lost.\u003c/p\u003e\n\u003cp\u003e“I think you should go,” she whispered.\u003c/p\u003e\n\u003cp\u003eHe cocked his thick brows at that. “You don’t seem to know what you want, do you? You want me to stay, yet you invite that mild-mannered choirboy for dinner.”\u003c/p\u003e\n\u003cp\u003e“My father invited him.”\u003c/p\u003e\n\u003cp\u003e“Ah, your father,” Chet said thoughtfully. “Michael’s the type of man he wants you to marry, isn’t he? We both know what your daddy would think of the likes of me.”\u003c/p\u003e\n\u003cp\u003e“That’s not true. My father isn’t like that.”\u003c/p\u003e\n\u003cp\u003e“Sure,” he scoffed. “He’d welcome me with open arms. Don’t kid yourself, Monica, we both know better. Listen, sweetheart, forget I was ever here, all right?”\u003c/p\u003e\n\u003cp\u003e“No. No, I won’t forget,” she whispered heatedly. “I can’t forget.”\u003c/p\u003e\n\u003cp\u003eShe read the questions etched in his eyes and realized they were a reflection of her own. She didn’t have any of the answers and apparently neither did he.\u003c/p\u003e\n\u003cp\u003eWalking toward him was the boldest thing she’d ever done in her life. Flattening her palms against the hard expanse of his chest, she slowly, reluctantly raised her eyes to his.\u003c/p\u003e\n\u003cp\u003eHe didn’t give her a chance to speak. His mouth came down on hers in a kiss that was as hot as it was wild. Instinct dictated her actions as she raised her arms and looped them around his neck, giving herself completely to his kiss.\u003c/p\u003e\n\u003cp\u003eHis arms folded around her waist, greedily holding her against him as his mouth plundered hers. Her feet dangled several inches off the ground.\u003c/p\u003e\n\u003cp\u003eThe kiss ended only when they were both desperate to breathe.\u003c/p\u003e\n\u003cp\u003eMonica was left stunned, her heart in a panic. It had always been like this between them, this craziness. Her head felt as if it were in its own orbit, spinning madly out of control. Emotionally she was a wreck, close to tears and trembling.\u003c/p\u003e\n\u003cp\u003eChet’s lips returned to hers in a series of long, slow kisses and her world righted itself. Everything slipped neatly back into place. Only when she lifted her head from his did outside influences overtake her.\u003c/p\u003e\n\u003cp\u003eFor the love of heaven, they were in a church building, and yet she couldn’t have left his arms in that moment for all the gold in the world. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-season-of-angels-angels-everywhere-1/page-25.html","bookId":2625,"creation":"Oct 5, 2019 10:04:57 PM","modification":"Oct 5, 2019 10:04:57 PM"}
