{"id":101553,"no":37,"title":"Page 37","content":"\u003cp\u003e“She’ll get over me,” he said.\u003c/p\u003e\n\u003cp\u003eThe older man nodded. “I suspect you’re right. In due time. She loves you, and Monica’s a good deal like her mother when it comes to love.”\u003c/p\u003e\n\u003cp\u003eChet hadn’t a clue what that meant and furthermore he didn’t want to know. His ladle of guilt was filled to capacity and overflowing.\u003c/p\u003e\n\u003cp\u003e“Good-bye, Chet. I appreciate you taking the time to talk to me.” He patted Chet’s upper arm as if he were little more than a schoolboy and then ambled out of the room.\u003c/p\u003e\n\u003cp\u003eStanding in the doorway, Chet watched as Monica’s father absently walked down the hallway, strolling past the elevator. He turned around, looking confused, when he reached the end of the hall.\u003c/p\u003e\n\u003cp\u003eChet shut the door, leaned against the thick white glass, and closed his eyes. He smelled of stale beer, hadn’t shaved in two days, and as a general rule looked like crap, and this man of God had thanked him for damn near deflowering his daughter.\u003c/p\u003e\n\u003cp\u003eThere was something screwy somewhere, and the hell if Chet could figure out where.\u003c/p\u003e\n\u003cp\u003eHe was dizzy again and decided it was probably due to the fact that he hadn’t eaten since the day before. The alcohol hadn’t helped.\u003c/p\u003e\n\u003cp\u003eAfter showering and fixing himself something to eat he felt better. He’d finished his scrambled eggs when the thought subtly presented itself to him. Monica was at the Mission House. Hadn’t her father said so himself?\u003c/p\u003e\n\u003cp\u003e“No,” Chet said out loud. “I will not go down there.” He reached for his television controller, his finger poised over the Power button.\u003c/p\u003e\n\u003cp\u003e“You’re a fool,” Chet muttered, already knowing there was no force on this earth that could keep him away.\u003c/p\u003e\n\u003cp\u003eHe had no intention of talking to her. None. The picture windows in the place gave ample opportunity to view the inside without being noticed. He’d go down, check out what her father had said, and slip away without anyone being the wiser. It was something he’d done a thousand times before as part of his job. He was good at this sort of thing.\u003c/p\u003e\n\u003cp\u003eWith purpose directing him, Chet locked up his office, and when the elevator didn’t arrive fast enough to suit him, he took the stairs.\u003c/p\u003e\n\u003cp\u003eThe mission was only a few doors away from his own building. It amazed Chet how easily he was able to find Monica in the crowd of workers. There seemed to be some sort of Christmas party going on. He spied Lloyd Fischer serving turkey with all the trimmings to a long line of derelicts.\u003c/p\u003e\n\u003cp\u003eMonica was in another part of the room with the children. Apparently she was telling them a story. A handful of kids were sitting on the floor looking up at the book she was holding. A toddler was fidgeting in her lap, reaching for her dangly earrings.\u003c/p\u003e\n\u003cp\u003eThis was what hell must be like, Chet decided. To stand hidden in some corner and view the woman he loved so much it defied reason, and know he would never have her. Hell was watching her hold a child in her arms, and realizing she would never hold their child.\u003c/p\u003e\n\u003cp\u003eShe was pale, Chet realized with regret, and dark circles shadowed her eyes. No wonder her father was concerned. Monica wasn’t faring any better than Chet was himself. He wanted to shake some reason into her, but that was part of his hell too. He would never touch her again.\u003c/p\u003e\n\u003cp\u003eComing here had not been one of his most brilliant ideas. He took a step back, and then another, and was ready to turn and walk away when Monica’s gaze suddenly, unexplainably, locked with his.\u003c/p\u003e\n\u003cp\u003eChet read her shock and watched the book she was holding tumble unnoticed from her fingers and fall to the floor.\u003c/p\u003e\n\u003cp\u003eChet’s heart faltered. He couldn’t turn and walk away. Then she’d know his game. Then she’d know he’d purposely been spying on her. He had to do something and do it fast.\u003c/p\u003e\n\u003cp\u003eHis shoes made harsh sounds against the sidewalk as he slammed into the Mission House door. He walked past the soup kitchen and moved directly to where Monica was sitting with the children. He braced his feet and glared down at her, sneering.\u003c/p\u003e\n\u003cp\u003e“Tell your father to stay away from me,” he ordered coolly.\u003c/p\u003e\n\u003cp\u003eMonica’s eyes widened with shock.\u003c/p\u003e\n\u003cp\u003eNot giving her a chance to recover, he turned and walked out, leaving the door to slam in his wake.\u003c/p\u003e\n\u003cp\u003eJody let herself into the house that evening, same time as always. Timmy was sitting on the carpet in the family room, occupied with his video game.\u003c/p\u003e\n\u003cp\u003e“I’m home,” she told him, walking into the kitchen.\u003c/p\u003e\n\u003cp\u003e“Hi, Mom,” he called out. “Grandma called.”\u003c/p\u003e\n\u003cp\u003eJody’s blood ran cold. “Grandma Potter?”\u003c/p\u003e\n\u003cp\u003e“Yes. She wants you to call her right away. She said—oh, darn—”\u003c/p\u003e\n\u003cp\u003e“What did she say?” Jody asked, hoping to hide her anxiety. It was times such as this that she regretted ever having purchased Timmy the video game system.\u003c/p\u003e\n\u003cp\u003e“Grandma said if you didn’t call her right away that she would call you.”\u003c/p\u003e\n\u003cp\u003eJody wasn’t up to another confrontation with Gloria.\u003c/p\u003e\n\u003cp\u003e“Glen’s coming over for dinner,” Jody announced, watching for her son’s reaction, hoping to gain confidence in his enthusiasm to spend more time with the attorney. “I thought I’d make spaghetti.”\u003c/p\u003e\n\u003cp\u003e“Sure. He’ll like that.” Timmy’s gaze didn’t waver from the television screen, his attention rapt.\u003c/p\u003e\n\u003cp\u003eInviting Glen to dinner so they could talk to Timmy together about their engagement had been Glen’s idea. Jody had immediately seen the wisdom of it, although now she wished she’d discussed the matter of her remarrying with her son much sooner.\u003c/p\u003e\n\u003cp\u003eJody didn’t doubt that Timmy would be thrilled. After all, this was what he wanted. His nine-year-old heart had yearned for a father, and his desire was what opened her eyes to the way she’d isolated her life.\u003c/p\u003e\n\u003cp\u003e“You want to help me set the table?” she asked, although it was an hour or longer before they’d eat.\u003c/p\u003e\n\u003cp\u003e“In a minute.”\u003c/p\u003e\n\u003cp\u003eJody rolled her eyes. She’d heard that phrase often enough to have it etched into the patio walkway.\u003c/p\u003e\n\u003cp\u003eSeeing that she wasn’t going to get much conversation from her son, she fried the ground turkey and set the sauce to simmer. Once she’d finished, she reached for the phone and dialed her mother’s number. If ever she needed emotional support it was now.\u003c/p\u003e\n\u003cp\u003e“Hi, Mom.”\u003c/p\u003e\n\u003cp\u003e“Jody, how are you?”\u003c/p\u003e\n\u003cp\u003e“All right, I guess.” She didn’t want to unburden her soul, nor could she very well announce that she’d decided to marry Glen within earshot of Timmy. But she could tell her about Gloria’s call.\u003c/p\u003e\n\u003cp\u003e“My guess is that Gloria wants to apologize, dear,” her mother said, after Jody finished. “She was hurt and angry and said something she didn’t mean, and now she’s looking to make amends.”\u003c/p\u003e\n\u003cp\u003eJody was sure her mother was right, but needed confirmation before returning the call, and said as much.\u003c/p\u003e\n\u003cp\u003e“You need to remember,” Helen continued, “you and Timmy are the only relatives she has left. I’m sure she regrets everything and would like to mend fences. The Christmas gifts you mailed probably arrived and they were the perfect excuse for her to contact you. She means well, sweetheart.”\u003c/p\u003e\n\u003cp\u003eThe doorbell sounded and Jody glanced at her watch. “That must be Glen,” she explained.\u003c/p\u003e\n\u003cp\u003e“I do like that young man,” her mother announced, and after a quick word in parting, Jody hung up the phone.\u003c/p\u003e\n\u003cp\u003eHer guess proved correct. Glen stood on the other side of the door, a bottle of wine in his hand and a bouquet of red rosebuds in the other. He kissed her on the cheek and handed her both.\u003c/p\u003e\n\u003cp\u003e“How’s Timmy?” Glen asked as she arranged the roses in a crystal vase.\u003c/p\u003e\n\u003cp\u003e“Preoccupied,” Jody whispered.\u003c/p\u003e\n\u003cp\u003eGlen’s arm circled her waist as they returned to the kitchen. When Timmy noticed Glen had arrived, he turned off the game.\u003c/p\u003e\n\u003cp\u003e“Hi, Glen.”\u003c/p\u003e\n\u003cp\u003e“How’s it going, scout?”\u003c/p\u003e\n\u003cp\u003e“All right, I guess. Mom said you were coming over for dinner.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you don’t mind, do you?”\u003c/p\u003e\n\u003cp\u003e“Oh, no,” Timmy said, “I think it’s great, but she made spaghetti and she makes me eat it with a spoon. She’ll probably make you do the same thing.”\u003c/p\u003e\n\u003cp\u003e“I think I can live with that, if you can.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess so,” Timmy said.\u003c/p\u003e\n\u003cp\u003e“Son, Glen and I would like to have a talk with you before dinner.” Rubbing her palms together as if warding off a chill, Jody looked at Glen for assistance. They hadn’t talked about when they’d break the news to Timmy, and Jody worried their dinner would be a disaster with this hanging over their heads.\u003c/p\u003e\n\u003cp\u003e“Sure,” Timmy said.\u003c/p\u003e\n\u003cp\u003eThe three of them sat down together in the family room. Glen was next to Jody and Timmy sat across from them. Glen reached for Jody’s hand.\u003c/p\u003e\n\u003cp\u003e“Your mother and I talked this afternoon and decided that we like each other very much,” Glen explained.\u003c/p\u003e\n\u003cp\u003e“I kind of guessed that you did,” Timmy said. “I saw you kissing her once.”\u003c/p\u003e\n\u003cp\u003e“Did that trouble you?” Jody asked, watching her son for any telltale signs of jealousy. Although Timmy yearned for a father, he may not have understood that it would mean having to share his mother’s attention with someone else.\u003c/p\u003e\n\u003cp\u003e“I don’t know why people kiss on the lips,” Timmy said. “It’s seems silly when you’re always warning me about germs, but adults seem to like it and even some kids. Rich told me he kissed a girl and it wasn’t too bad.”\u003c/p\u003e\n\u003cp\u003e“But how do you feel about me and your mother kissing?” Glen pressed.\u003c/p\u003e\n\u003cp\u003eTimmy frowned as if he didn’t know how to answer. “All right, I guess.”\u003c/p\u003e\n\u003cp\u003eGlen’s hand tightened around Jody’s. She noticed for the first time that he was nervous, which was something she suspected happened only rarely. Her gaze met his and he smiled weakly.\u003c/p\u003e\n\u003cp\u003e“Glen and I want to talk to you about us getting married,” Jody said, surprised by how shallow her voice sounded. Saying the words aloud for the first time caused her heart to pound at a fast rate, as if she were walking up a steep hill. In many ways she was, and the anticipation of this new path she’d chosen suddenly felt momentous.\u003c/p\u003e\n\u003cp\u003e“Does this mean we’d be a family?”\u003c/p\u003e\n\u003cp\u003eJody nodded.\u003c/p\u003e\n\u003cp\u003e“I’d be your stepfather,” Glen explained.\u003c/p\u003e\n\u003cp\u003eTimmy frowned at that. “But we’d still be a family?”\u003c/p\u003e\n\u003cp\u003e“Of course we would. Isn’t that what you wanted?” Jody sensed Timmy’s uncertainty and wanted to reassure him that there was nothing on this earth that would ever change her love for him.\u003c/p\u003e\n\u003cp\u003e“Would you have more babies like Rich’s mom?”\u003c/p\u003e\n\u003cp\u003eJody released her breath and looked at Glen. They hadn’t discussed the prospect of having children.\u003c/p\u003e\n\u003cp\u003e“I’d like that very much,” Glen answered for her. “But we’ll leave the decision up to your mother.”\u003c/p\u003e\n\u003cp\u003e“What do you think, Timmy, would you like it if Glen and I married?” Jody experienced the strongest need to break down and cry. It felt like a band around her chest that tightened more with each second.\u003c/p\u003e\n\u003cp\u003e“Sure, that would be great. Glen could help me be a better pitcher and then you wouldn’t miss my dad so much. It’d be nice to be part of a real family.”\u003c/p\u003e\n\u003cp\u003eJody bit back the words that claimed they were already a real family, he and she together. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-season-of-angels-angels-everywhere-1/page-37.html","bookId":2625,"creation":"Oct 5, 2019 10:04:57 PM","modification":"Oct 5, 2019 10:04:57 PM"}
