{"id":8001,"no":14,"title":"CHAPTER XIV. DOUBTS AND FEARS.","content":"\u0026nbsp;“WELL, what kept you so long?” asked Peg, impatiently, as Ida rejoined her at the corner of the street, where she had been waiting for her. “And where\u0027s your gingerbread?” \n\u003cdiv\u003e\n “He wouldn\u0027t let me have it,” said Ida.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he said the money wasn\u0027t good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stuff! it\u0027s good enough,” said Peg, hastily. “Then we must go somewhere else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he said the dollar I gave him last week wasn\u0027t good, and I promised to bring him another to-morrow, or he wouldn\u0027t have let me go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, where are you going to get your dollar to carry him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, won\u0027t you give it to me?” said Ida, hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Catch me at such nonsense! But here we are at another shop. Go in and see whether you can do any better there. Here\u0027s the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, it\u0027s the same piece.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What if it is?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t want to pass bad money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tut, what hurt will it do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the same as stealing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man won\u0027t lose anything. He\u0027ll pass it off again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody\u0027ll have to lose it by and by,” said Ida, whose truthful perceptions saw through the woman\u0027s sophistry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you\u0027ve taken up preaching, have you?” said Peg, sneeringly. “Maybe you know better than I what is proper to do. It won\u0027t do to be so mighty particular, and so you\u0027ll find out if you live with me long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you take the dollar?” asked Ida, with a sudden thought; “and how is it that you have so many of them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of your business,” said her companion, roughly. “You shouldn\u0027t pry into the affairs of other people.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to do as I told you?” she demanded, after a moment\u0027s pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t,” said Ida, pale but resolute.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can\u0027t,” repeated Peg, furiously. “Didn\u0027t you promise to do whatever I told you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Except what was wicked,” interrupted Ida.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what business have you to decide what is wicked? Come home with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peg, walked in sullen silence, occasionally turning round to scowl upon the unfortunate child, who had been strong enough, in her determination to do right, to resist successfully the will of the woman whom she had every reason to dread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived at home, Peg walked Ida into the room by the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick was lounging in a chair, with the inevitable pipe in his mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hilloa!” said he, lazily, observing his wife\u0027s movements, “what\u0027s the gal been doing, hey?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s she been doing?” repeated Peg; “I should like to know what she hasn\u0027t been doing. She\u0027s refused to go in and buy some gingerbread of the baker, as I told her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, little gal,” said Dick, in a moralizing vein, “isn\u0027t this rayther undootiful conduct on your part? Ain\u0027t it a piece of ingratitude, when we go to the trouble of earning the money to pay for gingerbread for you to eat, that you ain\u0027t willing to go in and buy it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would just as lieves go in,” said Ida, “if Peg would give me good money to pay for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That don\u0027t make any difference,” said the admirable moralist; “jest do as she tells you, and you\u0027ll do right. She\u0027ll take the risk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t!” said the child.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You hear her?” said Peg.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very improper conduct!” said Dick, shaking his head. “Put her in the closet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So Ida was incarcerated once more in the dark closet. Yet, in the midst of her desolation, there was a feeling of pleasure in thinking that she was suffering for doing right.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Ida failed to return on the expected day, the Crumps, though disappointed, did not think it strange.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I were her mother,” said Mrs. Crump, “and had been parted from her so long, I should want to keep her as long as I could. Dear heart! how pretty she is, and how proud her mother must be of her!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s all a delusion,” said Aunt Rachel, shaking her head. “It\u0027s all a delusion. I don\u0027t believe she\u0027s got a mother at all. That Mrs. Hardwick is an imposter. I knew it, and told you so at the time, but you wouldn\u0027t believe me. I never expect to set eyes on Ida again in this world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do,” said Jack, confidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s many a hope that\u0027s doomed to disappointment,” said Aunt Rachel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So there is,” said Jack. “I was hoping mother would have apple-pudding for dinner to-day, but she didn\u0027t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day passed, and still no tidings of Ida. There was a cloud of anxiety, even upon Mr. Crump\u0027s usually placid face, and he was more silent than usual at the evening meal.\n\u003c/div\u003e \n\u003cdiv\u003e\n At night, after Rachel and Jack had both retired, he said, anxiously, “What do you think is the cause of Ida\u0027s prolonged absence, Mary?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know,” said Mrs. Crump, seriously. “It seems to me, if her mother wanted to keep her longer than the time she at first proposed, it would be no more than right that she should write us a line. She must know that we would feel anxious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps she is so taken up with Ida that she can think of nothing else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may be so; but if we neither see Ida to-morrow, nor hear from her, I shall be seriously troubled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose she should never come back,” said the cooper, sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, husband, don\u0027t think of such a thing,” said his wife, distressed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We must contemplate it as a possibility,” returned Timothy, gravely, “though not, I hope, as a probability. Ida\u0027s mother has an undoubted right to her; a better right than any we can urge.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it would be better,” said his wife, tearfully, “if she had never been placed in our charge. Then we should not have had the pain of parting with her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not so, Mary,” said the cooper, seriously. “We ought to be grateful for God\u0027s blessings, even if he suffers us to possess them but a short time. And Ida has been a blessing to us, I am sure. How many hours have been made happy by her childish prattle! how our hearts have been filled with cheerful happiness and affection when we have gazed upon her! That can\u0027t be taken from us, even if she is, Mary. There\u0027s some lines I met with in the paper, to-night, that express just what I feel. Let me find them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The cooper put on his spectacles, and hunted slowly down the columns of the paper, till he came to these beautiful lines of Tennyson, which he read aloud,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; “I hold it true, whate\u0027er befall;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; I feel it when I sorrow most;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0027Tis better to have loved and lost,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Than never to have loved at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, wife,” said he, as he laid down the paper; “I don\u0027t know who writ them lines, but I\u0027m sure it\u0027s some one that\u0027s met with a great sorrow, and conquered it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are beautiful,” said his wife, after a pause; “and I dare say you\u0027re right, Timothy; but I hope we mayn\u0027t have reason to learn the truth of them by experience. After all, it isn\u0027t certain but that Ida will come back. We are troubling ourselves too soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At any rate,” said the cooper, “there is no doubt that it is our duty to take every means to secure Ida if we can. Of course, if her mother insists upon keeping her, we can\u0027t say anything; but we ought to be sure, before we yield her up, that such is the case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, Timothy?” asked Mrs. Crump, with anxious interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know as I ought to mention it,” said her husband. “Very likely there isn\u0027t anything in it, and it would only make you feel more anxious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have already aroused my anxiety,” said his wife. “I should feel better if you would tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will,” said the cooper. “I have sometimes doubted,” he continued, lowering his voice, “whether Ida\u0027s mother really sent for her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the letter?” queried Mrs. Crump, looking less surprised than he supposed she would.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought—mind it is only a guess on my part—that Mrs. Hardwick might have got somebody to write it for her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is very singular,” murmured Mrs. Crump, in a tone of abstraction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is singular?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, the very same thought occurred to me. Somehow, I couldn\u0027t help feeling a little suspicious of Mrs. Hardwick, though perhaps unjustly. But what object could she have in obtaining possession of Ida?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That I cannot conjecture; but I have come to one determination.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unless we learn something of Ida within a week from the time she left here, I shall go on to Philadelphia, or send Jack, and endeavor to get track of her.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3017/83410.html","bookId":264,"creation":"Aug 1, 2019 8:09:46 AM","modification":"Aug 1, 2019 8:09:46 AM"}
