{"id":94279,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMorgie came to see them, but he was weak and fragile. Even with a head injury, he was able to see how things were between Benny and Nix. Benny braced himself for Morgie to be angry, but he too had been changed by what had happened. He nodded thoughtfully, and went home.\u003c/p\u003e\n\u003cp\u003eIt all seemed like a thousand years ago. Gameland was still out there, and now they knew where. However, if Benny thought that hearing Lilah’s story would change the people in town or spark them to action, he was disappointed. They were shocked, they were sympathetic … but they said that it was too far away. That it wasn’t their concern. That it was too dangerous to mount a raid on it. After a couple of days they even stopped talking about it.\u003c/p\u003e\n\u003cp\u003e“It’s just like everything beyond the fence,” Benny complained. “They act like it’s all happening on a different planet.”\u003c/p\u003e\n\u003cp\u003e“To them it is,” said Nix. “My mom told them about the first Gameland, and they didn’t do anything then, either.”\u003c/p\u003e\n\u003cp\u003eNothing would be done, and that was the ugliest truth.\u003c/p\u003e\n\u003cp\u003eBut when he said this to Tom, his brother’s eyes became distant, and he changed the subject. Each day, however, he spent at least an hour in his workroom making bullets, and he had maps pinned to the walls.\u003c/p\u003e\n\u003cp\u003eBenny, Nix, and Tom spent every evening talking about things. Not about the fight or the dreadful things each of them had been forced to do. No. They talked about the jumbo jet. Tom had seen it too. He’d watched it fly out of the east and then turn slowly over the mountains and fly back.\u003c/p\u003e\n\u003cp\u003e“What do you think is out there?” Benny asked Nix one night after Tom went to bed. “Out where the jet went?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. It won’t be my islands,” she said. “It’ll be something … different. Something that isn’t here.”\u003c/p\u003e\n\u003cp\u003e“Here isn’t that bad. Not now that Charlie’s gone.”\u003c/p\u003e\n\u003cp\u003eHer green eyes were full of shadows. “‘Here,’ Benny, they accept that Gameland exists and won’t do anything about it.” She shook her head. “Here isn’t enough, Benny. Not for me. Not anymore.”\u003c/p\u003e\n\u003cp\u003eLater, when Benny told Tom that Nix wanted to go find where the jet came from, Benny had expected Tom to scoff at the idea. Tom hadn’t. Next morning there was a stack of maps on the kitchen table. There was one for every state.\u003c/p\u003e\n\u003cp\u003eOn the fifteenth day since the camp, Tom told Benny that he had one more closure job he had to do. “I want you to go with me.”\u003c/p\u003e\n\u003cp\u003eBenny sighed.\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can,” he said.\u003c/p\u003e\n\u003cp\u003eTom sat down with him at the table. “Please,” he said. “Just this last one, and then I’m done. I … can’t do it alone.”\u003c/p\u003e\n\u003cp\u003eBenny studied his brother for a long time and then nodded.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. “But after this, I’m done, too.”\u003c/p\u003e\n\u003cp\u003eNix went with them, but only for the first part of the trip. She was harder than before, less apt to smile, which Benny understood. Much of her softness was gone, and Benny hoped that with time it would return. The toughness, he knew, would remain. Nix spent hours writing in her book of zombie lore. She practiced with Benny every day with the wooden swords. When she trained, her beautiful face was set and grim, and Benny was sure that each time she swung the sword, she wasn’t seeing him. She was seeing the faces of the men who would have put her into a pit with zoms.\u003c/p\u003e\n\u003cp\u003e“Give her time,” Tom said one day after practice.\u003c/p\u003e\n\u003cp\u003e“I plan on it,” said Benny, and Tom smiled. “All the time she needs.”\u003c/p\u003e\n\u003cp\u003eThey left Mountainside on a gray morning in late September. Tom led the way, often walking alone as a way of dealing with his own sadness and loss. Benny and Nix followed behind, vigilant of the world around them and the threats it offered, but feeling safe and strong in each other’s company. Even if neither of them was ready to say so.\u003c/p\u003e\n\u003cp\u003eThey found the way station where Brother David and the two young women lived. Over lunch Benny and Tom and Nix told their story. The monk and the girls exchanged long looks, their faces sometimes sad at the news of pain and death, and sometimes hopeful as they considered a future without Charlie Pink-eye and the Motor City Hammer.\u003c/p\u003e\n\u003cp\u003e“Nix,” Benny said, “do you mind staying here?”\u003c/p\u003e\n\u003cp\u003e“No,” she said. “Tom told me that you have a job to do.”\u003c/p\u003e\n\u003cp\u003e“He told you?”\u003c/p\u003e\n\u003cp\u003eShe gave him a funny look. Deep and penetrating. “He told me everything, Benny. I understand about what he does … what you do. About the family business. About the need for closure.”\u003c/p\u003e\n\u003cp\u003eBenny touched her face. “Nix, I—”\u003c/p\u003e\n\u003cp\u003e“Benny Imura,” she said with a rare flicker of a smile on her mouth, “if you are going to say something like ‘I love you’ and you choose here, in a way station out in the Rot and Ruin to do it, so help me, I will kick your ass.”\u003c/p\u003e\n\u003cp\u003eThere was a fragile quality about her smile and a glimmer of the old Nix woven into the complexity of this new Nix. He loved both versions, but he valued his butt and had no doubts that she could kick it completely and with great enthusiasm.\u003c/p\u003e\n\u003cp\u003e“As if I would say something so stupid,” he said.\u003c/p\u003e\n\u003cp\u003eShe cocked an eyebrow at him.\u003c/p\u003e\n\u003cp\u003e“Can I at least ask for a kiss without being stomped and humiliated?”\u003c/p\u003e\n\u003cp\u003eHe could, and she proved it.\u003c/p\u003e\n\u003cp\u003eBenny and Tom left at noon. They walked for several hours, rarely talking. The sun broke through the clouds as they cut through a grove of trees that were heavy with apples. Tom picked a few, and they ate them and still said almost nothing until they reached the wrought-iron gate of a community that was embowered by a high red-brick wall. A sign over the gate read: SUNSET HOLLOW.\u003c/p\u003e\n\u003cp\u003eOutside of the gate there was trash and old bones and a few burned shells of cars. The outer walls were pocked with bullet scars. To the right of the gate someone had used white paint to write: “This Area Cleared. Keep Gates Closed. Keep Out.” Below that were the initials TI.\u003c/p\u003e\n\u003cp\u003eBenny pointed. “You wrote that?”\u003c/p\u003e\n\u003cp\u003e“Years ago,” Tom said.\u003c/p\u003e\n\u003cp\u003eThe gates were closed, and a thick chain had been threaded through the bars and locked with a heavy padlock. The chain and the lock looked new and gleamed with oil.\u003c/p\u003e\n\u003cp\u003e“What is this place?” Benny asked.\u003c/p\u003e\n\u003cp\u003eTom tucked his hands into his back pockets and looked up at the sign. “This is what they used to call a gated community. The gates were supposed to keep unwanted people out and keep the people inside safe.”\u003c/p\u003e\n\u003cp\u003e“Did it work? I mean … during First Night?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Did all the people die?”\u003c/p\u003e\n\u003cp\u003e“Most of them. A few got away.”\u003c/p\u003e\n\u003cp\u003e“Why is it locked?”\u003c/p\u003e\n\u003cp\u003e“For the same reason as always,” Tom said. He blew out his cheeks and dug into his right front jeans pocket for a key. He showed it to Benny and then opened the lock, pushed the gates open, and then restrung the chain and clicked the lock closed with the keyhole on the inside now.\u003c/p\u003e\n\u003cp\u003eThey walked along the road. The houses were all weather damaged, and the streets were pasted with the dusty remnants of fourteen years of falling leaves. Every garden was overgrown, but there were no zombies in them. Some of the doors had crosses nailed to them, around which hung withered garlands of flowers.\u003c/p\u003e\n\u003cp\u003e“Your job’s here?” Benny asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” said Tom. His voice was soft and distant.\u003c/p\u003e\n\u003cp\u003e“Is it like the other one? Like Harold Simmons?”\u003c/p\u003e\n\u003cp\u003e“Sort of.”\u003c/p\u003e\n\u003cp\u003e“That was … hard,” said Benny.\u003c/p\u003e\n\u003cp\u003e“Yes, it was.”\u003c/p\u003e\n\u003cp\u003e“Tom … I never wanted this. I mean, we all played games. Y’know, Kill the Zoms. Stuff like that. But … this isn’t how I imagined it.”\u003c/p\u003e\n\u003cp\u003e“Kiddo, if you were capable of imagining this without having seen it, I’d be scared for you. Maybe scared of you.”\u003c/p\u003e\n\u003cp\u003eBenny shook his head. “Doing this over and over again would drive me crazy. How do you do it?”\u003c/p\u003e\n\u003cp\u003eTom turned to him as if that was the question he’d been waiting for all day. “It keeps me sane,” he said. “Do you understand?”\u003c/p\u003e\n\u003cp\u003eBenny thought about it for a long moment. Birds sang in the trees and the cicadas buzzed continually. “Is it because you knew what the world was before?”\u003c/p\u003e\n\u003cp\u003eTom nodded.\u003c/p\u003e\n\u003cp\u003e“Is it because if you didn’t do it … then maybe no one would?”\u003c/p\u003e\n\u003cp\u003eTom nodded again.\u003c/p\u003e\n\u003cp\u003e“It must be lonely.”\u003c/p\u003e\n\u003cp\u003e“It is.” Tom glanced at him. “But I always hoped you’d want to join me. To help me do what I do.”\u003c/p\u003e\n\u003cp\u003e“I … don’t know if I can.”\u003c/p\u003e\n\u003cp\u003e“That’s always going to be your choice. If you can, you can. If you can’t, then believe me, I’ll understand. It takes a lot out of you to do this. And it takes a lot out of you to know that the bounty hunters are out there, doing what they do.”\u003c/p\u003e\n\u003cp\u003e“How come none of them ever came here?”\u003c/p\u003e\n\u003cp\u003e“They did. Once.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eTom shrugged.\u003c/p\u003e\n\u003cp\u003e“What happened?” Benny asked again.\u003c/p\u003e\n\u003cp\u003e“I was here when they came. Pure chance.”\u003c/p\u003e\n\u003cp\u003eBenny looked at him. “You … killed them,” he said. “Didn’t you?”\u003c/p\u003e\n\u003cp\u003eTom walked a dozen steps before he said, “Not all of them.” A half dozen steps later he added, “I let one of them go.”\u003c/p\u003e\n\u003cp\u003e“That was Charlie, wasn’t it? That’s what he was talking about.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why did you let him go?”\u003c/p\u003e\n\u003cp\u003e“To spread the word,” Tom said. “To let the other bounty hunters know that this place was off-limits.”\u003c/p\u003e\n\u003cp\u003e“And they listened? The bounty hunters?”\u003c/p\u003e\n\u003cp\u003eTom smiled. It wasn’t boastful or malicious. It was a thin, cold knife-blade of a smile that was there and gone. “Sometimes you have to go to some pretty extreme lengths to make a point and to make it stick. Otherwise you find yourself having to make the same point over and over again.”\u003c/p\u003e\n\u003cp\u003eBenny stared at him. “How many were there?”\u003c/p\u003e\n\u003cp\u003e“Ten.”\u003c/p\u003e\n\u003cp\u003e“And you let one go.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And you killed nine of them?”\u003c/p\u003e\n\u003cp\u003e“Yes.” The late afternoon sunlight slanting through the trees threw dappled light on the road and painted the sides of all of the houses to their left with purple shadows. A red fox and three kits scampered across the street ahead of them. “I let the wrong one go.”\u003c/p\u003e\n\u003cp\u003e“How could you have known? With one of the other guys, even Vin or Joey … It might not have been any different.”\u003c/p\u003e\n\u003cp\u003e“Maybe. But I don’t get to play that game. I made a choice, and a lot of people suffered because of it.”\u003c/p\u003e\n\u003cp\u003e“Tom … when you made that choice, you’d already beaten Charlie, right?”\u003c/p\u003e\n\u003cp\u003e“Yes. He was hurt and disarmed.”\u003c/p\u003e\n\u003cp\u003e“Then you did the right thing, I think. You can’t know the future. You believed him when he said that he’d change his ways, right?”\u003c/p\u003e\n\u003cp\u003eTom nodded.\u003c/p\u003e\n\u003cp\u003eBenny said, “I would have done the same thing, Tom, because I don’t ever want to live in a world where something like mercy … or maybe it’s compassion … is the wrong choice. Just ’cause Charlie said you were wrong to let him live, it doesn’t make him right.”\u003c/p\u003e\n\u003cp\u003eTom didn’t answer, but he nodded and gave his brother a small, sad smile. They stood there, taking each other’s measure perhaps for the very first time. Taking each other’s measure and getting the right values.\u003c/p\u003e\n\u003cp\u003eTom pointed, and Benny turned toward the front door of a house with peach trees growing wild in the yard. “This is it.”\u003c/p\u003e\n\u003cp\u003e“There’s a zombie in there?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Tom said. “There are two.”\u003c/p\u003e\n\u003cp\u003e“We have to tie them up?”\u003c/p\u003e\n\u003cp\u003e“No. That’s already been done. Years ago. Nearly every house here has a dead person in it. Some have already been quieted, the rest wait for family members to reach out and want it done.”\u003c/p\u003e\n\u003cp\u003e“I know this sounds gross, but why don’t you just go house to house and do it to every one of them? You know … quiet them. Release them.”\u003c/p\u003e\n\u003cp\u003e“Because a lot of the people here have family living in our town. It takes a while, but people usually get to the point where they want someone to go and do this the way I do it rather than as part of a general sweep. With respect, with words read to their dead family, and then let the dead rest in their own homes. Closure isn’t closure until someone’s ready to close the door. Do you understand what I mean?”\u003c/p\u003e\n\u003cp\u003eBenny nodded.\u003c/p\u003e\n\u003cp\u003e“Do you have a picture of the … um … people in there? So we know who they are? So we can make sure.”\u003c/p\u003e\n\u003cp\u003e“There are pictures inside. Besides … I know the names of everyone in Sunset Hollow. I come here a lot. I was the one who went house to house and tied the dead up. Some monks helped, but I knew everyone here.” Tom walked to the front door. “Are you ready?”\u003c/p\u003e\n\u003cp\u003eBenny looked at Tom and then at the door.\u003c/p\u003e\n\u003cp\u003e“You want me to do this, don’t you?”\u003c/p\u003e\n\u003cp\u003eTom looked sad. “I want us to do it.”\u003c/p\u003e\n\u003cp\u003e“If I do my part … then I’ll be like you. I’ll be doing this kind of thing.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Forever?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, Benny. I told you that I think I’m done with this too. But I don’t know if that’s true. Besides, we don’t know the future, remember?”\u003c/p\u003e\n\u003cp\u003e“What if I can’t?”\u003c/p\u003e\n\u003cp\u003e“If you can’t, I’ll do it. Then we go to the way station for tonight and head home in the morning. After that … maybe you and Nix and I will talk about going east. That jet had to land somewhere.”\u003c/p\u003e\n\u003cp\u003e“Tom, I know I’ve asked this already, but why don’t people from town come out to places like this and just take them back? We’re so much stronger than the zoms. This place is protected. Why don’t we take everything back?” \u003c/p\u003e","sourceLink":"https://allnovel.net/rot-and-ruin-benny-imura-1/page-45.html","bookId":2581,"creation":"Oct 5, 2019 6:07:38 PM","modification":"Oct 5, 2019 6:07:38 PM"}
