{"id":94280,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTom shook his head. “I ask myself that every day. They think they’re safe in town.”\u003c/p\u003e\n\u003cp\u003e“That’s not true. Ask Mr. Sacchetto. Ask Nix’s mom. It’s stupid.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Tom said, “it surely is.”\u003c/p\u003e\n\u003cp\u003eHe turned the doorknob and opened the door. “Are you coming?”\u003c/p\u003e\n\u003cp\u003eBenny came as far as the front step. “It’s not safe in there, either, is it?”\u003c/p\u003e\n\u003cp\u003e“It’s not safe anywhere, Benny. Not unless your generation makes it safe. My generation gave up trying.”\u003c/p\u003e\n\u003cp\u003eThey were both aware in that moment they were having a different discussion than the words they exchanged.\u003c/p\u003e\n\u003cp\u003eThe brothers went into the house.\u003c/p\u003e\n\u003cp\u003eTom led the way down a hall and into a spacious living room that had once been light and airy. Now it was pale and filled with dust. The wallpaper had faded, and there were animal tracks on the floor. There was a cold fireplace and a mantel filled with picture frames. The pictures were of a family. Mother and father. A smiling son in a uniform. A baby in a blue blanket. Two women who might have been twin sisters. Brothers and cousins and grandparents. Everyone was smiling. Benny stood looking at the pictures for a long time and then reached up and took one down. A wedding picture.\u003c/p\u003e\n\u003cp\u003e“Where are they?” he asked softly.\u003c/p\u003e\n\u003cp\u003e“In here,” said Tom.\u003c/p\u003e\n\u003cp\u003eStill holding the picture, Benny followed Tom through a dining room and into a kitchen. The windows were open and the yard was filled with trees. Two straight-backed chairs sat in front of the window and in the chairs were two withered zombies. Both of them turned their heads toward the sound of footsteps. Their jaws were tied shut with silken cord. The man was dressed in the tatters of an old blue police uniform; the woman wore a tailored frilly white party dress whose sleeves were dark with blood that had dried years ago. Benny came around front and looked from them to the wedding picture and back again.\u003c/p\u003e\n\u003cp\u003e“It’s hard to tell.”\u003c/p\u003e\n\u003cp\u003e“Not when you get used to it,” said Tom. “The shape of the ears, the height of the cheekbones, the angle of the jaw, the distance between the nose and upper lip. Those things won’t change even after years.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can do this,” Benny said again.\u003c/p\u003e\n\u003cp\u003e“That’s up to you.” Tom took his knife from his boot. “I’ll quiet one, and you can quiet the other. If you’re ready. If you can.”\u003c/p\u003e\n\u003cp\u003eTom went to stand behind the man. He gently pushed the zombie’s head forward and placed the tip of the knife at the base of his skull, doing everything slowly, reminding Benny of how it had to be done.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to say anything?” said Benny.\u003c/p\u003e\n\u003cp\u003e“I’ve already said it,” said Tom. “A thousand times. I waited, because I knew that you might want to say something.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know them,” said Benny. “Not like I thought. …”\u003c/p\u003e\n\u003cp\u003eA tear fell from Tom’s eye onto the back of the struggling zombie’s neck.\u003c/p\u003e\n\u003cp\u003eHe plunged the blade and the struggles stopped. Just like that.\u003c/p\u003e\n\u003cp\u003eTom hung his head for a moment as a sob broke in his chest. “I’m sorry,” he said, and then, “Be at peace.”\u003c/p\u003e\n\u003cp\u003eHe sniffed and held the knife out to Benny.\u003c/p\u003e\n\u003cp\u003e“I can’t!” Benny said, backing away. “Jesus Christ, I can’t!”\u003c/p\u003e\n\u003cp\u003eTom stood there, tears rolling down his cheeks, holding the knife out. He didn’t say a word.\u003c/p\u003e\n\u003cp\u003e“God … please don’t make me do this,” said Benny.\u003c/p\u003e\n\u003cp\u003eTom shook his head.\u003c/p\u003e\n\u003cp\u003e“Please, Tom.”\u003c/p\u003e\n\u003cp\u003eTom lowered the knife.\u003c/p\u003e\n\u003cp\u003eThe female zombie threw her weight against the cords and uttered a shrill moan that was like a dagger in Benny’s mind. He covered his ears and turned away. He dropped into a crouch, face tucked into the corner between the back door and the wall, shaking his head.\u003c/p\u003e\n\u003cp\u003eTom stood where he was.\u003c/p\u003e\n\u003cp\u003eIt took Benny a long, long time. He stopped shaking his head and leaned his forehead against the wood. The zombie in the chair kept moaning. Benny turned and dropped onto his knees. He dragged a forearm under his nose and sniffed.\u003c/p\u003e\n\u003cp\u003e“She’ll be like that forever, won’t she?”\u003c/p\u003e\n\u003cp\u003eTom said nothing.\u003c/p\u003e\n\u003cp\u003e“Yes,” said Benny, answering his own question. “Yes.”\u003c/p\u003e\n\u003cp\u003eHe climbed slowly to his feet.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said, and held out his hand. His hand and arm trembled. Tom’s trembled too as he handed over the knife.\u003c/p\u003e\n\u003cp\u003eBenny stood behind the zombie, and it took six or seven tries before he could bring himself to touch her. Eventually he managed it. Tom guided him, touching the spot where the knife had to go. Benny put the tip of the knife in place.\u003c/p\u003e\n\u003cp\u003e“When you do it,” said Tom, “do it quick.”\u003c/p\u003e\n\u003cp\u003e“Can they feel pain?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. But you can. I can. Do it quick.”\u003c/p\u003e\n\u003cp\u003eBenny closed his eyes and the old image was there. The white blouse, the red sleeves. Not red cloth. Blood. It had been blood. He took a ragged breath and said, “I love you, Mom.”\u003c/p\u003e\n\u003cp\u003eHe did it quick.\u003c/p\u003e\n\u003cp\u003eAnd it was over.\u003c/p\u003e\n\u003cp\u003eHe dropped the knife, and Tom gathered him up, and they sank down to their knees together on the kitchen floor, crying so loud that it threatened to break the world. In the chairs the two dead people sat slumped, their heads tilted toward each other, their withered mouths silent.\u003c/p\u003e\n\u003cp\u003eThe sun was tumbling behind the edge of the mountain by the time they left the house. Together they’d dug graves in the backyard. Tom locked up the house and then relocked the chain on the front gate. Side by side they walked back the way they came.\u003c/p\u003e\n\u003cp\u003e“On First Night,” Benny began, “all those years ago. I remember Mom with red sleeves. I remember her screaming. I remember you taking me and running. I looked back and saw Dad behind her.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Tom. “All of that happened.”\u003c/p\u003e\n\u003cp\u003e“The red sleeves … she’d already been bitten. By Dad. Hadn’t she?”\u003c/p\u003e\n\u003cp\u003eTom’s voice was a ghost. “Yes. She’d seen what happened when Dad got bitten. She was smart, she understood. She wanted us safe. Maybe she could already feel the change inside. The hunger. I don’t know. But she begged me to take you, to save you. To run.” He buried his face in his hands, and his whole body trembled with that terrible memory and all the years of grief.\u003c/p\u003e\n\u003cp\u003e“I … You saved me.”\u003c/p\u003e\n\u003cp\u003eTom said nothing.\u003c/p\u003e\n\u003cp\u003e“And all these years you knew that I hated you. That I thought you were a coward. Why didn’t you ever tell me?”\u003c/p\u003e\n\u003cp\u003eTom raised his head and dragged a forearm across his eyes. “By the time you were old enough to be told, you already believed your version of it. Tell me, Ben, if I had told you the truth, would you have believed me? If we had never come out here, would you have believed me?”\u003c/p\u003e\n\u003cp\u003eBenny slowly shook his head.\u003c/p\u003e\n\u003cp\u003e“So I waited.”\u003c/p\u003e\n\u003cp\u003e“God … that must have been hard.”\u003c/p\u003e\n\u003cp\u003eTom shrugged. “I knew that one day we’d come here. But when we got here … you knew, didn’t you? When did you figure it out?”\u003c/p\u003e\n\u003cp\u003eBenny sniffed and wiped his eyes. “Since … since we got back from Harold Simmons’s house. When I was sitting on the back porch all that time. I figured it out. I just didn’t want it to be the truth. I didn’t ever want to come here.”\u003c/p\u003e\n\u003cp\u003eTom nodded. “Neither did I. But you do understand that we had to, right?”\u003c/p\u003e\n\u003cp\u003e“Yes,” whispered Benny. “Because we needed closure, too.”\u003c/p\u003e\n\u003cp\u003eBenny still held the knife. He’d cleaned the blade, but he gripped the ribbed handle with a tight fist.\u003c/p\u003e\n\u003cp\u003e“Can I keep this?” Benny asked, holding out the knife.\u003c/p\u003e\n\u003cp\u003e“Why?” his brother asked.\u003c/p\u003e\n\u003cp\u003eBenny’s eyes were puffy from crying, but they were dry. “I guess I’ll need it,” he said.\u003c/p\u003e\n\u003cp\u003eTom stopped and studied him for a long time. His smile was sad, but his eyes were filled with love. And with pride. He removed the boot sheath and handed it to Benny, who clipped it inside his own boot.\u003c/p\u003e\n\u003cp\u003e“Come on,” he said. “Let’s go back to the way station. Nix will be waiting.”\u003c/p\u003e\n\u003cp\u003e“I don’t think Mountainside is home anymore. Not for me, and definitely not for Nix.”\u003c/p\u003e\n\u003cp\u003e“We could go east,” said Tom. “Find out what’s on the other side of the Ruin.”\u003c/p\u003e\n\u003cp\u003e“The jet,” Benny said.\u003c/p\u003e\n\u003cp\u003e“The jet,” Tom agreed.\u003c/p\u003e\n\u003cp\u003eBenny Imura looked back at the wrought-iron gates and at the words painted outside. He nodded to himself.\u003c/p\u003e\n\u003cp\u003eTogether they walked through the gathering twilight back to the way station where Nix would be waiting for them. They walked side by side in the vast silence of the Rot and Ruin. \u003c/p\u003e","sourceLink":"https://allnovel.net/rot-and-ruin-benny-imura-1/page-46.html","bookId":2581,"creation":"Oct 5, 2019 6:07:38 PM","modification":"Oct 5, 2019 6:07:38 PM"}
