{"id":105069,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe almost hung up again. It was a stupid business call. “No thanks.”\u003c/p\u003e\n\u003cp\u003e“This is important…” He heard the strain in her voice.\u003c/p\u003e\n\u003cp\u003eHe groaned. “What’s the time frame?”\u003c/p\u003e\n\u003cp\u003e“We gather in Muscat in one week. I can’t give you the details over the phone, but it’s a major discovery. It may rewrite the history of the entire Arabian Peninsula.”\u003c/p\u003e\n\u003cp\u003eBefore he could answer, Danny pushed up next to him. “I loaded both barrels.” He held the gun out to Omaha. “But I don’t know how you’re going to hold them off with nothing more than salt shot.”\u003c/p\u003e\n\u003cp\u003e“I’m not. You are.” He pointed the phone behind him. “Aim for their hull. Just rattle ’em enough to buy me some time. I’ve got my hands full here.”\u003c/p\u003e\n\u003cp\u003eDanny nodded, swinging around.\u003c/p\u003e\n\u003cp\u003eHe pulled the phone back to his face and heard Kara in midrant. “…wrong? What is all this about shooting?”\u003c/p\u003e\n\u003cp\u003e“Calm down. Just chasing off some big river rats—”\u003c/p\u003e\n\u003cp\u003eThe shotgun blast cut him off.\u003c/p\u003e\n\u003cp\u003e“Missed,” Danny swore behind him.\u003c/p\u003e\n\u003cp\u003eKara spoke. “What about the expedition?”\u003c/p\u003e\n\u003cp\u003eDanny cranked the next shell. “Should I shoot again?”\u003c/p\u003e\n\u003cp\u003e“Yes, goddamnit!”\u003c/p\u003e\n\u003cp\u003e“Brilliant,” Kara said, misinterpreting his outburst. “We’ll see you in Muscat in a week. You know the place.”\u003c/p\u003e\n\u003cp\u003e“Wait! I didn’t—”\u003c/p\u003e\n\u003cp\u003eBut the connection was severed. He threw the phone headset down. Kara damn well knew he hadn’t been agreeing to the expedition. As usual, she had taken advantage of the situation.\u003c/p\u003e\n\u003cp\u003e“I hit one of the boat’s drivers in the face!” Danny yelled, his voice surprised. “It’s heading for shore. But watch out! The other’s flanking starboard!”\u003c/p\u003e\n\u003cp\u003eOmaha glanced to the right. The sleek black Scimitar raced up alongside them. Four men in worn gray uniforms, former soldiers, crouched low. A bullhorn lifted. Mandarin spilled out in commanding tones that basically meant “Throttle down…or die!” To punctuate this demand a rocket launcher appeared and was pointed at their boat.\u003c/p\u003e\n\u003cp\u003e“I don’t think throwing salt at them is going to help this time,” Danny said, sinking into the other seat.\u003c/p\u003e\n\u003cp\u003eWith no choice, Omaha pulled back on the throttle and slowed the boat. He waved an arm in admitted defeat.\u003c/p\u003e\n\u003cp\u003eDanny opened the glove compartment. Inside was a perfectly preserved trio of fossilized tyrannosaurus eggs, worth their weight in gold. Discovered in the Gobi Desert, they had been destined for a museum in Beijing. Unfortunately, such a treasure was not without its admirers. Many collectors bought and sold such items on the black market—for princely sums.\u003c/p\u003e\n\u003cp\u003e“Hang on,” Omaha whispered to his brother.\u003c/p\u003e\n\u003cp\u003eDanny closed the glove compartment. “Please don’t do what I think you’re going to do…”\u003c/p\u003e\n\u003cp\u003e“No one steals from me. I’m the only grave robber around these parts.”\u003c/p\u003e\n\u003cp\u003eHe flipped open the thumb switch that protected the nitrous feed to the pulse jets incorporated into the Hamilton 212 turbo impeller. He had salvaged the boat from an outfitter out of New Zealand. It had raced tourists through Black Rock River outside of Auckland.\u003c/p\u003e\n\u003cp\u003eHe eyed the next twist of the crooked river.\u003c/p\u003e\n\u003cp\u003eThirty yards. With a little luck…\u003c/p\u003e\n\u003cp\u003eHe punched the button. Nitrous gas poured into the impeller, igniting the pulse jets. Licks of flame spat from the twin exhausts, accompanied by a throaty scream of the jets. The boat’s bow shot up; the stern dug deep.\u003c/p\u003e\n\u003cp\u003eShouts erupted from the other boat. Caught off guard, they were too slow bringing the rocket launcher to bear.\u003c/p\u003e\n\u003cp\u003eOmaha shoved the throttle wide open. The boat rocketed across the water, a torpedo of aluminum and chrome.\u003c/p\u003e\n\u003cp\u003eDanny scrambled to belt himself in his seat. “Ohmygod…!”\u003c/p\u003e\n\u003cp\u003eOmaha simply kept his stance in front of the wheel, knees half bent. He needed to feel the balance of the boat under him. They reached the jag in the river. He risked a glance over his shoulder.\u003c/p\u003e\n\u003cp\u003eThe other boat sped toward them, struggling to keep up. But their pursuers had one distinct advantage. A flash of fire marked the launch of a rocket-propelled grenade, a black-market Chinese RPG Type 69, with a lethal radius of twenty meters. They didn’t have to be close.\u003c/p\u003e\n\u003cp\u003eOmaha tore the wheel to the right, canting the boat high up on the port side. They skimmed the water, plowing around the corner.\u003c/p\u003e\n\u003cp\u003eThe grenade rocketed past, just missing the stern.\u003c/p\u003e\n\u003cp\u003eClearing the bend, Omaha straightened the boat and shot it down the center of the river. The explosion ripped into the opposite cliff face. Boulders and rocks rained down amid a cloud of smoke and dust.\u003c/p\u003e\n\u003cp\u003eHe eked more speed out of the jets, barely touching the water now. The boat handled as if it were on ice.\u003c/p\u003e\n\u003cp\u003eBehind him, the other boat appeared around the smoky bend, racing after them. They were loading another grenade into the launcher.\u003c/p\u003e\n\u003cp\u003eHe couldn’t give them another chance to get a clear shot at him. Luckily the Narrows were in a cooperative mood. The twists and crooked bends kept them out of sight for a fair stretch, but it also forced Omaha to cut the nitrous feed and slow their own boat.\u003c/p\u003e\n\u003cp\u003e“Can we outrun them?” Danny asked.\u003c/p\u003e\n\u003cp\u003e“I don’t think we have a choice.”\u003c/p\u003e\n\u003cp\u003e“Why not turn over the eggs? It’s not worth our lives.”\u003c/p\u003e\n\u003cp\u003eOmaha shook his head at his brother’s naïveté. It was hard to believe they were brothers. They were both the same six-foot-two, the same sandy blond hair, but Danny looked as if he had been put together with wire and bone. Omaha was built broader and rougher around the edges, hardened by the world, his skin burned by suns from six out of the seven continents. And the ten years that separated younger brother from older had marked his face with lines, like the rings of a tree: sun crinkles at the corners of his eyes, deep furrows across his brow from too much frowning and not enough smiling.\u003c/p\u003e\n\u003cp\u003eHis brother remained unmarked, smooth, a blank slate waiting to be written upon. He had finished his doctoral program only last year, speeding through Columbia as if it were a footrace. He suspected that a part of Danny’s rush through school had been the desire to join his older brother in the wider world.\u003c/p\u003e\n\u003cp\u003eWell, this was it: long days, few showers, stinking tents, dirt and sweat in every crack. And for what? To have some thieves pilfer their find?\u003c/p\u003e\n\u003cp\u003e“If we gave them the eggs—”\u003c/p\u003e\n\u003cp\u003e“They’d kill us anyway,” Omaha finished, tweaking the boat around another sharp turn in the river. “These folks don’t leave trails behind them.”\u003c/p\u003e\n\u003cp\u003eDanny searched behind the stern. “So we run.”\u003c/p\u003e\n\u003cp\u003e“As fast as we can.”\u003c/p\u003e\n\u003cp\u003eThe whine of the Scimitar’s motor ratcheted up as the other boat cleared the bend behind them. They were closing the distance. He needed more speed, hoping for a short stretch of open water, one long enough that he could open the nitrous wide and put some distance between them again, but not too long a stretch that their pursuers could take another potshot.\u003c/p\u003e\n\u003cp\u003eHe wrangled the boat back and forth through a narrow switchback. Worry made him miss spotting a hidden rock. The boat jarred into it, hung up for a breath, then with a screech of aluminum dragged free again.\u003c/p\u003e\n\u003cp\u003e“That couldn’t have been good,” Danny commented.\u003c/p\u003e\n\u003cp\u003eNo, it wasn’t. His brows furrowed deeper. Through his feet, he felt a persistent tremble in the boat. Even on flat water. Something had torn.\u003c/p\u003e\n\u003cp\u003eAgain the sound of the Scimitar’s engine whined louder.\u003c/p\u003e\n\u003cp\u003eAs Omaha rounded another bend, he caught a glimpse of their pursuers. Seventy yards behind. He faced around and heard Danny groan. The river ahead boiled and frothed with white water. This section of the river pinched between high walls. A long straight stretch of river—too long, too straight.\u003c/p\u003e\n\u003cp\u003eIf there had been a place to run the boat aground and take their chances overland, he would’ve done it. But they had no choice. He continued down the gorge, studying the flows and alert for rocks. He mapped the plan in his head.\u003c/p\u003e\n\u003cp\u003e“Danny, you’re not going to like this.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eA quarter of the way down the rapids, he spun the boat into an eddy and skipped it around in a tight circle, pointing the bow back upriver.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“The boat’s corked,” he said. “There’s no way we can outrun them. We’re going to have to take the fight to them.”\u003c/p\u003e\n\u003cp\u003eDanny nudged the shotgun. “Salt shot against a rocket launcher?”\u003c/p\u003e\n\u003cp\u003e“All it takes is the element of surprise.” That and perfect timing.\u003c/p\u003e\n\u003cp\u003ePushing the throttle forward, he edged back into the current, this time working upriver. He followed the map in his head: skirt around that drop, around that deep boil, edge clear of the rock splitting the current, take the calmer side. He aimed for a standing, refractory wave as it humped over a boulder, worn smooth by the constant churn of water.\u003c/p\u003e\n\u003cp\u003eThe whine of the other boat grew as it approached.\u003c/p\u003e\n\u003cp\u003e“Here they come…” Danny pushed up his glasses.\u003c/p\u003e\n\u003cp\u003eOver the lip of the wave, Omaha spotted the bow end of the Scimitar clear the corner. He shifted his thumb and flipped the cover over the nitrous feed. He twisted the nozzle to full feed. It was all or nothing.\u003c/p\u003e\n\u003cp\u003eThe Scimitar rounded the bend and spotted them. It must appear that they were floundering, turned ass backward by some mean boil or whirlpool.\u003c/p\u003e\n\u003cp\u003eThe other boat slowed, but momentum and the current brought the Scimitar into the rapids. Their pursuers were only ten yards away now. Too close to use the grenade launcher. Shrapnel from the explosion would risk their own boat and lives.\u003c/p\u003e\n\u003cp\u003eIt was a momentary standoff.\u003c/p\u003e\n\u003cp\u003eOr so it seemed.\u003c/p\u003e\n\u003cp\u003e“Grab tight!” Omaha warned as he punched the nitrous injector.\u003c/p\u003e\n\u003cp\u003eIt was like someone had ignited a case of TNT under their stern. The boat bolted forward, slamming into the standing wave, striking the boulder hidden beneath. The bow climbed the flat rock, driving the stern down. The twin pulse jets shot the aluminum frame straight up. They went airborne over the wave, flying high, trailing fire.\u003c/p\u003e\n\u003cp\u003eDanny hollered—then again, so did Omaha.\u003c/p\u003e\n\u003cp\u003eTheir boat sailed over the Scimitar, but it was not meant for true flight. The nitrous cut out, the flames died, and their boat came crashing down atop the fiberglass Scimitar. \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-16.html","bookId":1530,"creation":"Oct 5, 2019 10:43:19 PM","modification":"Oct 5, 2019 10:43:19 PM"}
