{"id":105074,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSafia crossed to the jet. “Am I the last one here?”\u003c/p\u003e\n\u003cp\u003e“Everyone’s aboard.” Kara reached toward her luggage.\u003c/p\u003e\n\u003cp\u003eSafia snapped down the tote’s handle and lifted it herself. “I have it.”\u003c/p\u003e\n\u003cp\u003eKara didn’t argue. She knew what the luggage contained. The iron heart, nestled in a molded, rubberized cocoon. Safia refused to let anyone near it—not to protect it, but as if it was a burden she must bear. Its blood debt was hers alone. Her discovery, her responsibility.\u003c/p\u003e\n\u003cp\u003eGuilt shadowed her friend like a mourning shroud. Ryan Fleming had been her friend. Murdered before her eyes. All for a chunk of iron, something Safia had unearthed.\u003c/p\u003e\n\u003cp\u003eKara sighed as she followed Safia up the stairs.\u003c/p\u003e\n\u003cp\u003eIt was Tel Aviv all over again.\u003c/p\u003e\n\u003cp\u003eNo one could console Safia then…and now was no different.\u003c/p\u003e\n\u003cp\u003eKara stopped at the top of the stairs and glanced one last time over toward the misty heights of London in the distance as the sun crested the Thames. She searched her heart for some sense of loss. But all she found was sand. This was not her true home. It never had been.\u003c/p\u003e\n\u003cp\u003eShe turned her back on London and climbed inside the jet.\u003c/p\u003e\n\u003cp\u003eA man in uniform leaned out the cockpit door. “Ma’am, we have clearance from the tower. Ready when you are.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Very good, Benjamin.”\u003c/p\u003e\n\u003cp\u003eShe stepped into the main cabin as the door was secured behind her. The Lear had been customized to suit her needs. The cabin’s interior was furnished in leather and burled walnut, describing four intimate seating groups. Fresh flowers sprouted from Waterford crystal vases secured to seatside tables. A long mahogany bar, an antique out of Liverpool, stood stocked near the rear of the cabin. Beyond the bar, a set of folding doors marked the entry to Kara’s private study and bedroom.\u003c/p\u003e\n\u003cp\u003eShe allowed herself a self-satisfied smile upon seeing Painter Crowe’s cocked eyebrow as he surveyed the space. Clearly he was not accustomed to such luxuries on a physicist’s salary, even one supplemented by government work. The plane’s butler handed him a drink. Soda water and ice, it appeared. His glass clinked as he turned.\u003c/p\u003e\n\u003cp\u003e“What…no honey-roasted peanuts?” he mumbled as he passed. “I thought we were traveling first class.”\u003c/p\u003e\n\u003cp\u003eHer smile grew stale as he crossed and took a seat beside Dr. Novak. Flippant bastard…\u003c/p\u003e\n\u003cp\u003eEveryone else began to find their seats as the pilot announced their departure. Safia settled off by herself. Her graduate student, Clay Bishop, was already buckled across the cabin, face pressed to a window. He wore earphones attached to an iPod resting on his lap, lost to everyone else.\u003c/p\u003e\n\u003cp\u003eWith all in readiness, Kara crossed to the bar. Her usual was waiting for her: a chilled glass of Chardonnay. It came from St. Sebastian, a French winery. Kara had been allowed her first sip on her sixteenth birthday, on the morning of the hunt. Since then, she lifted one glass each morning in honor of her father. She swirled the wineglass and inhaled its crisp bouquet, a hint of peach and oak. Even after so many years, the smell drew her immediately back to that morning, so full of promise. She could hear her father’s laughter, the baying of camels in the distance, the whisper of wind with the dawning sun.\u003c/p\u003e\n\u003cp\u003eSo close now…after so very long…\u003c/p\u003e\n\u003cp\u003eShe sipped slowly, drowning the nagging dryness in her mouth. Her head buzzed with the sharpness of the two pills she had taken upon waking two hours earlier. Through her lips, she felt the minor tremor in her fingertips as they held up the glass. One wasn’t supposed to mix alcohol with prescription drugs. But it was only the one glass of Chardonnay. And she owed it to her father.\u003c/p\u003e\n\u003cp\u003eShe lowered the glass and found Safia studying her. Her face was unreadable, but her eyes glowed with concern. Kara met her gaze, un-flinching, holding it steady. Safia finally broke away to stare out the window.\u003c/p\u003e\n\u003cp\u003eNeither had the words to comfort the other. Not any longer…\u003c/p\u003e\n\u003cp\u003eThe desert had stolen a part of their lives, a part of their hearts. And only out in the sands could it be recovered.\u003c/p\u003e\n\u003cp\u003e11:42 A.M.\u003c/p\u003e\n\u003cp\u003eMUSCAT, OMAN\u003c/p\u003e\n\u003cp\u003eO MAHA SLAMMED through the door to the Ministry of National Heritage.\u003c/p\u003e\n\u003cp\u003eThe door swinging back almost struck his brother, Danny, in the face as he followed. “Omaha, calm down.”\u003c/p\u003e\n\u003cp\u003e“Damn bureaucrats…” He continued his tirade out in the street. “You need a friggin’ permit to wipe your ass here.”\u003c/p\u003e\n\u003cp\u003e“You got what you wanted,” Danny said in a conciliatory tone.\u003c/p\u003e\n\u003cp\u003e“It took all goddamn morning. And the only reason we finally got the permit to carry gasoline aboard the Rovers—to carry friggin gasoline!—was because Adolf bin Asshole wanted his damn lunch.”\u003c/p\u003e\n\u003cp\u003e“Calm down.” Danny grabbed his elbow and dragged him to the curb. Faces turned in their direction.\u003c/p\u003e\n\u003cp\u003e“And Safia…Kara’s plane is landing in”—Omaha checked his watch. “In just over an hour.”\u003c/p\u003e\n\u003cp\u003eDanny waved for a cab. A white Mercedes sedan pulled away from a nearby taxi stand and slid up to the curb. Danny opened the door and shoved Omaha inside. It was gloriously air-conditioned. Noon in Muscat and it was already over a hundred degrees.\u003c/p\u003e\n\u003cp\u003eThe cool interior washed the edge from his irritation. He leaned and tapped at the Plexiglas between the backseat and the front. “Seeb Airport.”\u003c/p\u003e\n\u003cp\u003eThe driver nodded and cut into traffic without signaling, simply barging his way into the lunchtime flow.\u003c/p\u003e\n\u003cp\u003eOmaha fell back into his seat beside his brother.\u003c/p\u003e\n\u003cp\u003e“I’ve never seen you this nervous,” Danny said.\u003c/p\u003e\n\u003cp\u003e“What are you talking about? Nervous? I’m pissed.”\u003c/p\u003e\n\u003cp\u003eDanny stared out the window. “Right…like meeting your ex-fiancée, face-to-face, hasn’t trimmed your fuse a tad short this morning.”\u003c/p\u003e\n\u003cp\u003e“Safia has nothing to do with this.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“I have no reason to be nervous.”\u003c/p\u003e\n\u003cp\u003e“Keep tellin’ yourself that, Omaha.”\u003c/p\u003e\n\u003cp\u003e“Shut up.”\u003c/p\u003e\n\u003cp\u003e“You shut up.”\u003c/p\u003e\n\u003cp\u003eOmaha shook his head. Both of them had had too little sleep since arriving two weeks ago. There were a thousand and one details to attend to when putting together an expedition in such a short time: permits; paperwork; hiring guards, manual labor, and trucks; clearing access from Thumrait Air Base; buying potable water, petrol, guns, salt, dry chemical toilets; organizing personnel. And all of it fell squarely upon the Dunn brothers’ shoulders.\u003c/p\u003e\n\u003cp\u003eThe trouble back in London had delayed Kara’s arrival. If Kara had been here as planned, preparations for the expedition would’ve gone much more smoothly. Lady Kensington was revered in Oman, the Mother Teresa of philanthropy. Throughout the country, museums, hospitals, schools, and orphanages all bore plaques with her name on them. Her corporation helped win many lucrative contracts—oil, mineral, and fresh water—for the country and its people.\u003c/p\u003e\n\u003cp\u003eBut after the museum incident, Kara had asked the brothers to maintain a low profile, keep her involvement on a need-to-know basis only.\u003c/p\u003e\n\u003cp\u003eSo Omaha chewed a lot of aspirin.\u003c/p\u003e\n\u003cp\u003eThe taxi crossed out of the business district of Muscat and wended through the narrow streets that bordered the stone walls of the old city. They followed a truck loaded with pines, weeping a path of dry needles behind it.\u003c/p\u003e\n\u003cp\u003eChristmas trees. In Oman.\u003c/p\u003e\n\u003cp\u003eSuch was the country’s openness to the West, a Muslim country that celebrated Christ’s birth. Oman’s attitude could be attributed to the monarchy’s head of the state, Sultan Qaboos bin Said. Educated in England, the sultan had opened his country to the wider world, brought extensive civil rights to his people, and modernized his country’s infrastructure.\u003c/p\u003e\n\u003cp\u003eThe taxi driver turned on the radio. Strains of Bach floated through the Bose speakers. The sultan’s favorite. By royal decree, only classical music could be played at noon. Omaha checked his watch. High noon.\u003c/p\u003e\n\u003cp\u003eHe stared out the window. It must be good to be king.\u003c/p\u003e\n\u003cp\u003eDanny spoke up. “I think we’re being followed.”\u003c/p\u003e\n\u003cp\u003eOmaha glanced at his brother to see if he was joking.\u003c/p\u003e\n\u003cp\u003eDanny was craning over a shoulder. “The gray BMW, four cars back.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“It’s a BMW,” Danny said more firmly. His brother—a yuppie wannabe, fascinated by all things German-engineered—knew cars. “I spotted the same car parked down the street from our hotel, then again at the entrance to the parking lot for the natural history museum.”\u003c/p\u003e\n\u003cp\u003eOmaha squinted. “Could be coincidence…same make, different car.”\u003c/p\u003e\n\u003cp\u003e“Five-forty-i. Custom chrome wheels. Tinted privacy glass. Even—”\u003c/p\u003e\n\u003cp\u003eOmaha cut him off. “Enough of the sales pitch. I believe you.”\u003c/p\u003e\n\u003cp\u003eBut if they were truly being followed, only one question stood out.\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003eHe flashed back to the bloodshed and violence at the British Museum. Even the newspapers here reported on it. Kara had warned him to be as cautious as possible, to maintain a low profile. He leaned forward. “Take the next right,” he said in Arabic, hoping either to lose or confirm their tail.\u003c/p\u003e\n\u003cp\u003eThe driver ignored him and continued straight.\u003c/p\u003e\n\u003cp\u003eOmaha felt a sudden twinge of panic. He tried the door. Locked.\u003c/p\u003e\n\u003cp\u003eThey passed the turnoff for the airport.\u003c/p\u003e\n\u003cp\u003eBach continued to stream from the speakers.\u003c/p\u003e\n\u003cp\u003eHe yanked at the door handle again.\u003c/p\u003e\n\u003cp\u003eCrap.\u003c/p\u003e\n\u003cp\u003e12:04 P.M.\u003c/p\u003e\n\u003cp\u003eAIRBORNE OVER THE MEDITERRANEAN\u003c/p\u003e\n\u003cp\u003eS AFIA STARED at the book in her lap, blind to the words. She had not turned a page in the last half hour. Tension stripped her nerves raw. Her shoulder muscles knotted, and a dull headache made her teeth hurt.\u003c/p\u003e\n\u003cp\u003eShe glanced out at the sunlit blue skies. Cloudless. A vast blank canvas. It was as if she were leaving one life and sweeping toward another.\u003c/p\u003e\n\u003cp\u003eWhich in many ways she was.\u003c/p\u003e\n\u003cp\u003eShe was abandoning London, her flat, the stone walls of the British Museum, all that she once thought safe these past ten years. But that safety had proved to be an illusion, so fragile it shattered in a single night.\u003c/p\u003e\n\u003cp\u003eBlood once again stained her hands. Because of her work.\u003c/p\u003e\n\u003cp\u003eRyan…\u003c/p\u003e\n\u003cp\u003eSafia could not erase the momentary glint of surprise in his eyes as the bullet sliced him from this world. Even weeks later, she felt the need to wash her face repeatedly, sometimes even in the middle of the night. Brown soap and cold water. Nothing washed away the memory of the blood. \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-22.html","bookId":1530,"creation":"Oct 5, 2019 10:43:19 PM","modification":"Oct 5, 2019 10:43:19 PM"}
