{"id":105107,"no":55,"title":"Page 55","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’re going to wear the battery down,” Danny warned as Clay engaged the engine again. “Let it rest. Five minutes at least.”\u003c/p\u003e\n\u003cp\u003eA buzzing filled Kara’s skull, as if her body were an antenna, tuning in on static. She had to move. She could no longer sit still. She pulled open the latch and half fell out the door, bobbling her rifle.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Clay called to her, frightened.\u003c/p\u003e\n\u003cp\u003eShe didn’t answer. She stepped into the road. The van had been pulled under the branches of a tamarind tree. She crossed out into the open and wandered a short distance up the road, out of sight of the van.\u003c/p\u003e\n\u003cp\u003eGunfire continued to echo.\u003c/p\u003e\n\u003cp\u003eKara ignored it, her attention focused closer at hand.\u003c/p\u003e\n\u003cp\u003eAn old woman stood in the roadway, facing Kara, as if waiting for her. She was dressed in a long desert cloak, her face hidden behind a black veil. In her bony fingers, she carried a staff of gnarled wood, worn smooth and shiny.\u003c/p\u003e\n\u003cp\u003eKara’s head throbbed. Then the static in her head finally tuned to a proper station. Pain and nausea drained from her. She felt momentarily weightless, unburdened.\u003c/p\u003e\n\u003cp\u003eThe woman merely stared.\u003c/p\u003e\n\u003cp\u003eNumbness filled the empty spaces inside her. She didn’t fight it. The rifle dropped from Kara’s limp fingers.\u003c/p\u003e\n\u003cp\u003e“She will need you,” the woman finally said, turning away.\u003c/p\u003e\n\u003cp\u003eKara followed after the stranger, moving as if in a dream.\u003c/p\u003e\n\u003cp\u003eBack by the tamarind tree, she heard the van’s engine crank and fail.\u003c/p\u003e\n\u003cp\u003eKara continued walking, leaving the road behind and heading down into the forested valley. Kara did not resist, even if she had been able to.\u003c/p\u003e\n\u003cp\u003eShe knew who needed her.\u003c/p\u003e\n\u003cp\u003e8:36 P.M.\u003c/p\u003e\n\u003cp\u003eS AFIA HAD been forced to her knees, hands on top of her head. Cassandra crouched behind her, a pistol pressed at the base of her skull, another pointed toward the entrance. They both faced the doorway, poised tensely on the far side of the chamber. The grave mound stood between them and the exit.\u003c/p\u003e\n\u003cp\u003eWith the explosion, Cassandra had extinguished the lights and sent Kane out a back window. To circle around. To hunt down Painter.\u003c/p\u003e\n\u003cp\u003eSafia clenched her fingers together. Could it be true? Could Painter still be alive, be somewhere out there? If that was so, had the others survived? Tears welled. No matter what, she was not alone. Painter had to be out there.\u003c/p\u003e\n\u003cp\u003eGunfire still rattled from beyond the compound.\u003c/p\u003e\n\u003cp\u003eFires cast the night in crimson and shadow.\u003c/p\u003e\n\u003cp\u003eShe heard the beat of helicopters, spatters of automatic fire.\u003c/p\u003e\n\u003cp\u003e“Just let us go,” Safia pleaded. “You have Ubar’s location.”\u003c/p\u003e\n\u003cp\u003eCassandra remained silent in the dark, her full attention on the door and windows. Safia didn’t know if she had even heard her plea.\u003c/p\u003e\n\u003cp\u003eFrom beyond the door, a shuffling sound reached them.\u003c/p\u003e\n\u003cp\u003eSomeone was coming. Painter or Kane?\u003c/p\u003e\n\u003cp\u003eAcross the doorway, a large shadow passed, lit momentarily by the lone flashlight still out in the courtyard.\u003c/p\u003e\n\u003cp\u003eA camel.\u003c/p\u003e\n\u003cp\u003eIt was a surreal sight as it sauntered past, soaked by the rain. In its wake, a woman stood framed in the doorway, naked. She seemed to shimmer in the crimson glow of the nearby fires.\u003c/p\u003e\n\u003cp\u003e“You!” Cassandra gasped.\u003c/p\u003e\n\u003cp\u003eIn one hand, the stranger carried the silver case containing the iron heart. It had been resting just outside the door.\u003c/p\u003e\n\u003cp\u003e“No you don’t, bitch!” Cassandra fired her pistol, two rounds, deafeningly close to Safia’s left ear.\u003c/p\u003e\n\u003cp\u003eCrying out from the painful sound of the blast, Safia fell forward onto one of the prayer rugs. She rolled a step away, toward the grave mound.\u003c/p\u003e\n\u003cp\u003eCassandra followed, still firing at the door.\u003c/p\u003e\n\u003cp\u003eSafia craned up, her head ringing. The doorway was empty again. She glanced sidelong to Cassandra, who’d assumed a shooter’s stance, both pistols pointed toward the open door.\u003c/p\u003e\n\u003cp\u003eSafia saw her chance. She grabbed the edge of the prayer rug, which she now shared with Cassandra. In a swift motion, she lunged up, dragging the rug with her.\u003c/p\u003e\n\u003cp\u003eCaught by surprise, Cassandra toppled, her feet going out from under her.\u003c/p\u003e\n\u003cp\u003eA pistol fired.\u003c/p\u003e\n\u003cp\u003ePlaster shattered from the ceiling.\u003c/p\u003e\n\u003cp\u003eAs Cassandra fell backward, Safia dove over the grave mound and rolled toward the door. At the entrance, she leaped headlong over the threshold.\u003c/p\u003e\n\u003cp\u003eAnother blast.\u003c/p\u003e\n\u003cp\u003eIn midair, Safia felt a kick in her shoulder, shoving her around. She hit the ground and skidded in the mud. Her shoulder burned. Shot. Panicked, reacting on pure instinct, she rolled to the side, away from the doorway.\u003c/p\u003e\n\u003cp\u003eRain washed over her.\u003c/p\u003e\n\u003cp\u003eShe scrambled around the corner, pushing through a hedgerow to enter the narrow alley between the tomb and the ruins of the prayer room.\u003c/p\u003e\n\u003cp\u003eAs she reached cover, a hand from behind reached out of the darkness and clamped over her mouth hard, bruising her lips.\u003c/p\u003e\n\u003cp\u003e8:39 P.M.\u003c/p\u003e\n\u003cp\u003eP AINTER HELD tight to Safia, clinging to her. “Stay quiet,” he whispered in her ear, leaning against the wall of the ruins.\u003c/p\u003e\n\u003cp\u003eShe quaked in his grip.\u003c/p\u003e\n\u003cp\u003eHe had been hiding here for the past few minutes, watching the courtyard, attempting to ascertain some way to draw Cassandra out. But his ex-partner seemed entrenched, patient, letting her team do the work for her while she guarded the prize. Spotlights from the hovering helicopters crisscrossed the yard, keeping him pinned down. Again Cassandra had outwitted him, hiding an aerial force, probably sent here in advance.\u003c/p\u003e\n\u003cp\u003eAll seemed hopeless.\u003c/p\u003e\n\u003cp\u003eThen a moment ago, he had watched a camel stroll by through the rain, seemingly unconcerned by the gunfire, moving with steady determination to pass his hiding place and disappear in front of the tomb. Next, a spatter of shots and Safia came tumbling out.\u003c/p\u003e\n\u003cp\u003e“We have to reach the back wall of the complex,” he whispered, motioning down the alleyway. There was too much gunfire coming from out front. They’d have to take their chances on the steep slopes out back, try to reach cover. He released his grip on her, but she still clung to him.\u003c/p\u003e\n\u003cp\u003e“Keep behind me,” he urged.\u003c/p\u003e\n\u003cp\u003eTwisting around, Painter led the way in a low crouch, heading back toward the rear of the complex. The shadows lay thicker there. He kept a keen watch through his night-vision glasses, wary and tense. Pistol pointed forward. Nothing moved. The world was defined in shades of green. If they could reach the far wall that encircled the complex…\u003c/p\u003e\n\u003cp\u003eTaking another step, he saw the alleyway bloom with light, blindingly bright through the goggles, burning the back of his eye sockets. He tore away the scopes.\u003c/p\u003e\n\u003cp\u003e“Don’t move.”\u003c/p\u003e\n\u003cp\u003ePainter froze. A man lay flat atop the wall of the ruins. He held a flashlight in one hand, a pistol in the other, both aimed at Painter.\u003c/p\u003e\n\u003cp\u003e“Don’t even twitch,” the man warned.\u003c/p\u003e\n\u003cp\u003e“Kane,” Safia moaned behind him.\u003c/p\u003e\n\u003cp\u003ePainter cursed silently. The man had been lying in wait atop the wall, spying from on high, waiting until they had moved into his line of sight.\u003c/p\u003e\n\u003cp\u003e“Drop your weapon.”\u003c/p\u003e\n\u003cp\u003ePainter had no choice. If he refused, he’d be shot where he stood. He let the pistol fall from his fingers.\u003c/p\u003e\n\u003cp\u003eA new voice called sharply from behind him, coming from the entrance to the alleyway. Cassandra. “Just shoot him.”\u003c/p\u003e\n\u003cp\u003e8:40 P.M.\u003c/p\u003e\n\u003cp\u003eO MAHA CROUCHED beside Coral as she finished checking the body on the ground. Barak covered them with his rifle. They were hidden at the edge of the parking lot, awaiting a chance to make a run across the open space.\u003c/p\u003e\n\u003cp\u003eClutching his Desert Eagle, Omaha fought to keep his heart from hammering out of his chest. He seemed incapable of getting enough oxygen. A minute ago, he had heard pistol blasts from within the complex.\u003c/p\u003e\n\u003cp\u003eSafia…\u003c/p\u003e\n\u003cp\u003eAhead, the parking lot was still lit by flaming pools of gasoline. A pair of helicopters swept by overhead, searchlights crisscrossing in a deadly pattern. Both sides had settled into a standoff. Only occasional spates of gunfire shattered the stillness.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Coral said, standing up, still shadowed by the limbs of the wild fig tree. Her eyes were on the skies. She watched a second pair of helicopters swoop overhead. “Be ready to run.”\u003c/p\u003e\n\u003cp\u003eOmaha frowned—then saw the grenade resting in her palm, taken from the dead guard at her feet.\u003c/p\u003e\n\u003cp\u003eShe pulled the pin and stepped out into the open, her full attention on the skies. She pulled her arm back, leaning like a pitcher onto one leg. She held that stance for a breath.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Omaha asked.\u003c/p\u003e\n\u003cp\u003e“Physics,” she answered. “Vector analysis, timing, angle of ascent.” She threw the grenade with a wicked fling of her entire body.\u003c/p\u003e\n\u003cp\u003eOmaha immediately lost sight of it in the darkness.\u003c/p\u003e\n\u003cp\u003e“Run!” Coral dove ahead, following the momentum of her toss.\u003c/p\u003e\n\u003cp\u003eBefore Omaha could even move, the grenade exploded overhead in a brilliant flash, lighting up the underbelly of the one-man craft. Its spotlight swung wildly as the concussion hit it. Shrapnel ripped into the belly. A piece must have struck its fuel tank. The copter blew up in a fiery bloom.\u003c/p\u003e\n\u003cp\u003e“Run!” Coral called again, urging Omaha to move.\u003c/p\u003e\n\u003cp\u003eBarak was already on Coral’s heels.\u003c/p\u003e\n\u003cp\u003eOmaha ran. Debris rained down off to the right. A piece of rotor impacted the ground with a thunking twang. Then the flaming bulk smashed into the tree line, casting up backwash of fire and black smoke.\u003c/p\u003e\n\u003cp\u003eHe continued his flight across the lot. The other helicopters had swung away, scattering like a flock of startled crows.\u003c/p\u003e\n\u003cp\u003eAhead, Coral reached the lone SUV. She flew into the driver’s seat. Barak hauled open the back door, leaving the front passenger seat to Omaha.\u003c/p\u003e\n\u003cp\u003eAs his fingers closed on the door, the truck’s engine roared to life. Omaha had barely gotten the door open when Coral shifted into gear and hit the accelerator. Omaha’s arm was wrenched. He had to run and leap inside.\u003c/p\u003e\n\u003cp\u003eCoral had no time for stragglers.\u003c/p\u003e\n\u003cp\u003eHe fell into the seat as a rifle blast exploded.\u003c/p\u003e\n\u003cp\u003eOmaha ducked, but the shot was not from the enemy.\u003c/p\u003e\n\u003cp\u003eFrom the backseat, Barak had shot out the truck’s moonroof. He used an elbow to crack away the shattered safety glass, then shoved his body up through the opening along with his rifle. He immediately began firing as Coral fought the steering wheel, spinning tires in the mud.\u003c/p\u003e\n\u003cp\u003eThe truck slipped as she made a sharp turn toward the open gate in the compound wall. Wheels mired. The SUV struggled to move.\u003c/p\u003e\n\u003cp\u003eAnother helicopter hove into view, blades angled steeply. Automatic fire flashed from its nose, chattering and digging a trough toward their mud-bogged vehicle. It would slice them in half. \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-55.html","bookId":1530,"creation":"Oct 5, 2019 10:43:20 PM","modification":"Oct 5, 2019 10:43:20 PM"}
