{"id":105126,"no":74,"title":"Page 74","content":"\u003cp\u003e“How’s things look, Captain?” Kane asked through her radio earpiece.\u003c/p\u003e\n\u003cp\u003eShe knelt and peered below. The chasm stretched ahead of her. Opposite her position, the far side of the sinkhole was a tumbled slope of rock, still rolling with tiny slides. A fresh avalanche. What the hell had happened? She shifted her gaze directly below her.\u003c/p\u003e\n\u003cp\u003eThe tunnel entrance stared back at her, a glistening eye, crystalline.\u003c/p\u003e\n\u003cp\u003eGlass.\u003c/p\u003e\n\u003cp\u003eHer pulse quickened at the sight of it. This had to be the entrance to whatever treasure lay below. Her gaze swept over the parked vehicles. She could not let them steal the prize.\u003c/p\u003e\n\u003cp\u003eShe touched her throat mike. “Kane, I want a full team ready to enter that tunnel in five minutes.” There was no answer.\u003c/p\u003e\n\u003cp\u003e“Kane,” she shouted louder, twisting around.\u003c/p\u003e\n\u003cp\u003eThe tractor’s headlights blinded her.\u003c/p\u003e\n\u003cp\u003eShe shoved to the side. Suspicion flared.\u003c/p\u003e\n\u003cp\u003eShe moved forward, only then spotting something knocked on its side, in the lee of the wall, abandoned, half covered in sand.\u003c/p\u003e\n\u003cp\u003eA sand bike.\u003c/p\u003e\n\u003cp\u003eOnly one person was that clever.\u003c/p\u003e\n\u003cp\u003e11:52 A.M.\u003c/p\u003e\n\u003cp\u003eT HE KNIFE stabbed at his face. Tangled, rolling across the floor, Painter turned his head, avoiding a fatal plunge to the eye. The dagger sliced his cheek, grazing the bone under his eye.\u003c/p\u003e\n\u003cp\u003eFury and desperation fueled Painter’s strength. Despite the blood flowing, he kept his legs pinned around the other man’s legs, his right arm clenched around the man’s neck.\u003c/p\u003e\n\u003cp\u003eThe bastard was as strong as a bull, bucking, rolling.\u003c/p\u003e\n\u003cp\u003ePainter pinned him, trapping his knife arm.\u003c/p\u003e\n\u003cp\u003eAs he had climbed through the side door of the tractor, left conveniently ajar by Cassandra, he’d recognized the man. Painter had been hiding, buried under loose, windblown sand piled against the crumbling wall. Five minutes ago, he had ridden the sand bike at breakneck speeds up out of the sinkhole and raced to the gap in the east wall. He knew Cassandra’s forces would have to come through there with any vehicles.\u003c/p\u003e\n\u003cp\u003eHe hadn’t expected the behemoth of a tractor, a twenty-ton monster from the look of it. A bus fitted with tank treads. But it suited his purpose better than an ordinary truck.\u003c/p\u003e\n\u003cp\u003eHe had crawled out of hiding as the tractor stopped, idling in the storm. He had ducked between the back treads. As he expected, all attention had been focused on the sinkhole.\u003c/p\u003e\n\u003cp\u003eThen Cassandra had stepped from the vehicle, giving him the opening he needed. With the door unlocked, Painter had slipped into the back compartment, pistol in hand.\u003c/p\u003e\n\u003cp\u003eUnfortunately, his wrestling partner, John Kane, must’ve caught Painter’s reflection in the glass. He had swung around on a splinted leg and snapped out with the other, knocking the pistol from Painter’s hand.\u003c/p\u003e\n\u003cp\u003eNow they struggled on the floor.\u003c/p\u003e\n\u003cp\u003ePainter maintained his choke hold. Kane tried to slam the back of his head into the bridge of Painter’s nose. Painter avoided the blow. Instead, he yanked the man’s head back even farther and slammed it hard against the metal floor.\u003c/p\u003e\n\u003cp\u003eA groan.\u003c/p\u003e\n\u003cp\u003eHe repeated the action three more times. The man went limp. Painter continued to clamp his forearm over the man’s neck. Only then did he note the blood spreading across the gray metal. Nose broken.\u003c/p\u003e\n\u003cp\u003eTime running out, Painter let the man go. He stood up and stumbled back. If that leopard hadn’t tenderized the bastard first, Painter would never have won that fight.\u003c/p\u003e\n\u003cp\u003eHe shoved to the driver’s seat, popped the clutch, and gave the tractor some gas. The lumbering giant crunched forward, surprisingly agile. Painter checked his landmarks and aimed the tractor toward the right trajectory, straight for the sinkhole.\u003c/p\u003e\n\u003cp\u003eBullets suddenly peppered the side of the tractor. Automatic weapons. His presence had been discovered.\u003c/p\u003e\n\u003cp\u003eThe noise deafened.\u003c/p\u003e\n\u003cp\u003ePainter continued forward, unconcerned. The tractor was armored. And he had locked the side door.\u003c/p\u003e\n\u003cp\u003eThe rim of the sinkhole appeared ahead. He kept the tractor moving.\u003c/p\u003e\n\u003cp\u003eBullets continued to pound, stones against a tin can.\u003c/p\u003e\n\u003cp\u003eThe front end of the tractor crawled past the lip of the sinkhole.\u003c/p\u003e\n\u003cp\u003eThat was good enough for Painter. Trusting momentum, he swept out of the seat. The tractor slowed but crept farther past the edge of the sinkhole. Its forward end dipped down as the rim crumbled. The floor tilted.\u003c/p\u003e\n\u003cp\u003ePainter scrambled toward the rear door, intending to jettison before the tractor went over, taking his chances among the commandos. But a hand snatched his pant leg, yanking his feet out from under him. He fell hard, the wind knocked out of him.\u003c/p\u003e\n\u003cp\u003eKane dragged Painter toward him, still impossibly strong.\u003c/p\u003e\n\u003cp\u003ePainter had no time for this. The floor angled steeply. He kicked out with a heel, striking Kane’s broken nose. The man’s head snapped back. His ankle was freed.\u003c/p\u003e\n\u003cp\u003ePainter crawled and leaped up the sloped floor, climbing a cliff of steel. Equipment and gear tumbled toward the front, knocking into him. He felt a sliding lurch. Gravity now gripped the tractor. Treads tore through stone.\u003c/p\u003e\n\u003cp\u003eIt was going over.\u003c/p\u003e\n\u003cp\u003eLeaping, Painter snatched the handle to the back hatch. Unfortunately, it opened out. He didn’t have good purchase to shove it open. Using his toes, his calves, he just managed to push the hatch a foot up.\u003c/p\u003e\n\u003cp\u003eThe wind did the rest. The storm caught the door and flung it wide.\u003c/p\u003e\n\u003cp\u003ePainter followed, carried bodily outward.\u003c/p\u003e\n\u003cp\u003eBeneath him, the tractor fell away, diving into the sinkhole.\u003c/p\u003e\n\u003cp\u003eHe managed one kick. Leapfrogging off the back end, he aimed for the cliff edge, arms outstretched.\u003c/p\u003e\n\u003cp\u003eHe made it, barely. His belly struck the edge. He flung his torso on the ground, legs dangling in the pit. His fingers dug for purchase. A screeching crash sounded below him. He noted figures scrambling toward him.\u003c/p\u003e\n\u003cp\u003eThey wouldn’t reach him in time.\u003c/p\u003e\n\u003cp\u003eHe slid backward. There was no grip. The tractor’s treads had churned the edge to mush. He managed for a moment to catch a buried rock in the dust.\u003c/p\u003e\n\u003cp\u003eHe hung for a breath by one hand and stared down.\u003c/p\u003e\n\u003cp\u003eForty feet below, the tractor had slammed nose-first into the glass hole, tearing away, crumpling, a twenty-ton plug in the tunnel.\u003c/p\u003e\n\u003cp\u003eGood enough.\u003c/p\u003e\n\u003cp\u003eHis rocky purchase gave way. Painter fell, tumbling into the pit.\u003c/p\u003e\n\u003cp\u003eDistantly he heard his name called.\u003c/p\u003e\n\u003cp\u003eThen his shoulder struck an outcropping of rock, he bounced, and the ground rushed up to meet him, jagged with rocks and broken metal.\u003c/p\u003e\n\u003cp\u003ePart Five\u003c/p\u003e\n\u003cp\u003eFire Down Below\u003c/p\u003e\n\u003cp\u003eSandstorm\u003c/p\u003e\n\u003cp\u003eAny Port in a Storm\u003c/p\u003e\n\u003cp\u003eSandstorm\u003c/p\u003e\n\u003cp\u003eDECEMBER 4, 12:02 P.M.\u003c/p\u003e\n\u003cp\u003eUNDERGROUND\u003c/p\u003e\n\u003cp\u003eS AFIA HURRIED down the spiraling ramp, leading the others. The crash above them had thrown them into a panic. Debris rolled and skittered from above: glass, rocks, even a broken rim of metal. The last had rolled like a child’s hoop, skimming around the spiral, through the mass of folk in flight, and down into the depths.\u003c/p\u003e\n\u003cp\u003eOmaha followed it with his flashlight until it vanished. The noise above subsided, echoing away.\u003c/p\u003e\n\u003cp\u003e“What happened?” Safia asked.\u003c/p\u003e\n\u003cp\u003eOmaha shook his head. “Painter, I guess.”\u003c/p\u003e\n\u003cp\u003eKara marched on her other side. “Barak and Coral went back to check.”\u003c/p\u003e\n\u003cp\u003eBehind them marched Danny and Clay, backs loaded with gear. They held flashlights. Clay held his with both hands, as if it were a lifeline. Safia doubted he’d ever volunteer for a field expedition again.\u003c/p\u003e\n\u003cp\u003eBeyond them marched the Rahim, similarly encumbered with supplies and packs. Only a few flashlights glowed. Lu’lu, bent in discussion with another elder, led them. They had lost six women during the fighting and bombing. Safia saw the raw grief in all their eyes. A child wept softly back there. As insulated as the Rahim were, a single death must be devastating. They were down to thirty, a quarter of them children and old women.\u003c/p\u003e\n\u003cp\u003eThe footing suddenly changed underfoot, going from rough glass to stone. Safia looked down as they wound around the spiral.\u003c/p\u003e\n\u003cp\u003e“Sandstone,” Omaha said. “We’ve reached the end of the blast range.”\u003c/p\u003e\n\u003cp\u003eKara shone her light back, then forward. “The explosion did all this?”\u003c/p\u003e\n\u003cp\u003e“Some form of shaped charge,” Omaha said, seemingly unimpressed. “Most of this spiraling ramp was probably already down here. The trilith chamber was its cork. The bomb simply blew its top away.” Safia knew Omaha was simplifying things. She continued forward. If they had passed the transition from glass to stone, then the end must be near. The sandstone underfoot was still wet. What if all they found was a flooded passage? They’d have to go back…face Cassandra.\u003c/p\u003e\n\u003cp\u003eA commotion drew her attention. Coral and Barak trotted up to them. Safia stopped along with the others.\u003c/p\u003e\n\u003cp\u003eCoral pointed back. “Painter did it. Dropped a truck over the entrance.”\u003c/p\u003e\n\u003cp\u003e“A big truck,” Barak elaborated.\u003c/p\u003e\n\u003cp\u003e“What about Painter?” Safia asked.\u003c/p\u003e\n\u003cp\u003eCoral licked her lips, eyes narrowed with concern. “No sign.”\u003c/p\u003e\n\u003cp\u003eSafia glanced past the woman’s shoulder, searching.\u003c/p\u003e\n\u003cp\u003e“That won’t keep Cassandra off our tail forever. I already heard men up there digging.” Coral waved forward. “Painter bought us time, let’s use it.” Safia took a deep shuddering breath. Coral was right. She turned and continued down. No one spoke for another turn of the spiral.\u003c/p\u003e\n\u003cp\u003e“How deep are we?” Kara asked.\u003c/p\u003e\n\u003cp\u003e“I’d say over two hundred feet,” Omaha answered.\u003c/p\u003e\n\u003cp\u003eAround another bend, a cavern opened, about the size of a double garage. Their lights reflected off a well of water in the center. It jostled gently, its surface misty. Water dripped from the ceiling.\u003c/p\u003e\n\u003cp\u003e“The source of the water flume,” Omaha said. “The shaped charge of the explosion must have sucked it up, like milk through a straw.” They all entered the cavern. A lip of rock circled the well.\u003c/p\u003e\n\u003cp\u003e“Look.” Kara pointed her light to a door on the far side.\u003c/p\u003e\n\u003cp\u003eThey marched around the well.\u003c/p\u003e\n\u003cp\u003eOmaha placed his palm on the door’s surface. “Iron again. They sure like smelting around here.” There was a handle, but a bar was locked across the door’s frame.\u003c/p\u003e\n\u003cp\u003e“To keep the chamber pressure-sealed,” Coral said behind them. “For the explosive vacuum.” She nodded back to the well of water.\u003c/p\u003e\n\u003cp\u003eFar above them, a crash echoed down.\u003c/p\u003e\n\u003cp\u003eOmaha grabbed the locking bar and pulled it. It wouldn’t budge. “Goddamnit. It’s jammed.” He wiped his hands on his cloak. “And all oily.” “To resist corrosion,” Danny said. He tried to help him, but the two brothers fared no better. “We need a crowbar or something.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-74.html","bookId":1530,"creation":"Oct 5, 2019 10:43:20 PM","modification":"Oct 5, 2019 10:43:20 PM"}
