{"id":105134,"no":82,"title":"Page 82","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003ePainter dug faster through the storm’s headwinds, keeping a shoulder to each tractor’s tread. He reached the last in the line. Its engine purred like a happy kitten, a twenty-ton kitten.\u003c/p\u003e\n\u003cp\u003eSliding down the side, Painter found the door and struggled to open it against the wind. Not a one-handed job. He tucked the pistol into his boxer’s waistband, its weight half pulling his shorts down. He set the laptop on the tread and finally got the door open enough to squeeze through. He snatched the computer with him.\u003c/p\u003e\n\u003cp\u003eAt last, he slammed the door and latched it closed. Leaning his back against the door, he spit sand from his mouth and rubbed his eyes, clearing his eyebrows and lashes of grit.\u003c/p\u003e\n\u003cp\u003eGunfire peppered the side of the carriage, stinging his back with their rattling impacts. He shoved away. The fun never stops around here.\u003c/p\u003e\n\u003cp\u003eHe hurried to the driver’s compartment and slid into the seat. He tossed the laptop onto the other seat. The sandstorm swirled beyond the windshield, a permanent midnight. He flipped on the lights. Visibility stretched for a whole two yards. Not bad.\u003c/p\u003e\n\u003cp\u003eHe kicked the gear into reverse and headed out of Dodge.\u003c/p\u003e\n\u003cp\u003eHe retreated straight back. If anything was back there, he’d simply have to trust that the armored behemoth could bull through it.\u003c/p\u003e\n\u003cp\u003eMore gunfire chased him, like kids throwing stones.\u003c/p\u003e\n\u003cp\u003eHe fled, noting when he cleared the charred remains of Shisur. He escaped into the desert, shooting backward. Eventually he’d think about forward gears. But backward worked fine for now.\u003c/p\u003e\n\u003cp\u003eAs he glanced to the windshield, he noted twin glows bloom in the darkness, out in the city.\u003c/p\u003e\n\u003cp\u003ePursuit.\u003c/p\u003e\n\u003cp\u003e5:00 P.M.\u003c/p\u003e\n\u003cp\u003eA S THE others took a brief rest, Omaha stared at the queen’s palace. The structure had managed to escape the initial bombardment. Maybe they could make a stand here, up in its tower.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eFanciful, but impractical. Their only hope was to keep moving. But they were running out of city. Not much lay above and beyond the palace. A few streets and low buildings.\u003c/p\u003e\n\u003cp\u003eHe glanced over the lower city. Sporadic gunfire still flared, but it was both less frequent and closer. The Rahim’s defense was wearing thin, the line being overwhelmed.\u003c/p\u003e\n\u003cp\u003eOmaha knew they were doomed. He had never considered himself a pessimist, just a pragmatist. Still, he glanced at Safia. With his last breath, he would keep her safe.\u003c/p\u003e\n\u003cp\u003eKara stepped beside him. “Omaha…”\u003c/p\u003e\n\u003cp\u003eHe looked at her. She never called him Omaha. Her face was exhausted, lined by fear, eyes hollow. Like him, she sensed their end.\u003c/p\u003e\n\u003cp\u003eKara nodded to Safia. Her voice was a sigh. “What the hell are you waiting for? Bloody Christ…” She stepped away to the courtyard wall, slumped against it, and sank to a seat.\u003c/p\u003e\n\u003cp\u003eOmaha remembered her earlier words. She still loves you.\u003c/p\u003e\n\u003cp\u003eFrom steps away, he watched Safia. She knelt beside a child, holding both the girl’s small hands between her own. Her face shone in the glow overhead. Madonna and child.\u003c/p\u003e\n\u003cp\u003eHe moved closer…then closer again. Kara’s words inside his head: Life is hard. Love doesn’t have to be.\u003c/p\u003e\n\u003cp\u003eSafia didn’t look up, but she still spoke. “These are my mother’s hands,” she said so quietly, so calmly, defying their situation. She stared at the child. “All these women. My mother still lives through them. An entire life. From babe to elder. A full life. Not one cut short.”\u003c/p\u003e\n\u003cp\u003eOmaha dropped to one knee. He stared into her face as she studied the child. She simply took his breath away. Literally.\u003c/p\u003e\n\u003cp\u003e“Safia,” he said softly.\u003c/p\u003e\n\u003cp\u003eShe turned to him, eyes shining.\u003c/p\u003e\n\u003cp\u003eHe met her gaze. “Marry me.”\u003c/p\u003e\n\u003cp\u003eShe blinked. “What…?”\u003c/p\u003e\n\u003cp\u003e“I love you. I always have.”\u003c/p\u003e\n\u003cp\u003eShe turned. “Omaha, it’s not that simple…”\u003c/p\u003e\n\u003cp\u003eHe touched her chin gently with a finger, and turned her face back to his. He waited for her eyes to find him. “That’s just it. Yes, it is.”\u003c/p\u003e\n\u003cp\u003eShe attempted to shift away.\u003c/p\u003e\n\u003cp\u003eHe would not let her escape this time. He leaned closer. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHer eyes shone a bit brighter, not from happiness but from the threat of tears. “You left me.”\u003c/p\u003e\n\u003cp\u003e“I know. I didn’t know what to do. But it was a boy who left you.” He lowered his hand, gently taking hers. “It is a man on his knees now.”\u003c/p\u003e\n\u003cp\u003eShe stared into his eyes, wavering.\u003c/p\u003e\n\u003cp\u003eMovement over her shoulder caught his eye. Figures pushed out of the dark around the corner of the palace. Men. A dozen.\u003c/p\u003e\n\u003cp\u003eOmaha leaped to his feet, scrambling to push Safia behind him.\u003c/p\u003e\n\u003cp\u003eOut of the shadows, a familiar figure strode forth.\u003c/p\u003e\n\u003cp\u003e“Barak…” Omaha scrambled to comprehend. The giant of an Arab had been missing since before the attack.\u003c/p\u003e\n\u003cp\u003eMore men followed behind Barak, in desert cloaks. They were led by a man with a crutch under one arm.\u003c/p\u003e\n\u003cp\u003eCaptain al-Haffi.\u003c/p\u003e\n\u003cp\u003eThe leader of the Desert Phantoms waved to the men behind him. Sharif was among them, as hale as when Omaha had last seen him, out at Job’s tomb. He had survived the firefight without a scratch. Sharif and the men dispersed down the streets, strapped with rifles, grenades, and RPG launchers.\u003c/p\u003e\n\u003cp\u003eOmaha stared after them.\u003c/p\u003e\n\u003cp\u003eHe didn’t know what was going on, but Cassandra was in for a surprise.\u003c/p\u003e\n\u003cp\u003e5:05 P.M.\u003c/p\u003e\n\u003cp\u003eA LL THAT was left was the cleanup.\u003c/p\u003e\n\u003cp\u003eCassandra kept one foot on the pontoon of her boat. She listened to the open channel as various teams swept the city in quadrants, clearing away pockets of resistance. She clutched her electronic tracker, fingers digging. She knew exactly where Safia was within the city.\u003c/p\u003e\n\u003cp\u003eCassandra allowed the curator to scurry like a mouse while her crew mopped behind her, wearing through her resistance. Cassandra still wanted the bitch alive. Especially with Painter now on the run.\u003c/p\u003e\n\u003cp\u003eShe had to resist screaming her frustration.\u003c/p\u003e\n\u003cp\u003eShe would have the balls of every man topside if Painter escaped.\u003c/p\u003e\n\u003cp\u003eShe took a deep shuddering breath. There was nothing she could do down here. She had to secure this place, root out its secrets, which meant capturing Safia alive. And with Safia in hand, Cassandra would have a card to play against Painter. A pretty little ace in the hole.\u003c/p\u003e\n\u003cp\u003eAn explosion drew her attention back to the city. She was surprised her men needed to employ another grenade. She watched an RPG sail into the air.\u003c/p\u003e\n\u003cp\u003eShe blinked at its trajectory.\u003c/p\u003e\n\u003cp\u003eFuck…\u003c/p\u003e\n\u003cp\u003eShe leaped from her perch and sprinted down the shoreline. Her rubber soles gave her good purchase on the rough glass. She dove behind a sheltering pile of debris as the grenade struck the pontoon boat.\u003c/p\u003e\n\u003cp\u003eThe explosion deafened her, making her ears ache, even stinging her eyes. Glass and water sprayed high. She rolled up and away as broken glass rained down. She covered her head with her arms. Jagged pieces fell around her, dancing off other glass, slicing skin and clothes, stinging like a rain of fire.\u003c/p\u003e\n\u003cp\u003eAfter the deadly shower ceased, she stared up at the city. Had someone commandeered one of her team’s launchers? Another two RPGs flew by.\u003c/p\u003e\n\u003cp\u003eNew automatic fire flared from a dozen places.\u003c/p\u003e\n\u003cp\u003eWhat the hell was going on?\u003c/p\u003e\n\u003cp\u003e5:07 P.M.\u003c/p\u003e\n\u003cp\u003eA S THE explosions echoed away and gunfire chattered, Safia watched Captain al-Haffi clump forward on his crutch. The shock of his arrival still held everyone speechless.\u003c/p\u003e\n\u003cp\u003eThe captain’s eyes settled on Lu’lu. He dropped his crutch and lowered himself to one knee. He spoke in Arabic, but in a dialect few had heard spoken aloud. Safia had to strain her ears to recognize the words of the singsong speech.\u003c/p\u003e\n\u003cp\u003e“Your Highness, please forgive your servant for arriving so late.”\u003c/p\u003e\n\u003cp\u003eHe bowed his head.\u003c/p\u003e\n\u003cp\u003eThe hodja was as mystified as anyone else by his arrival and posturing.\u003c/p\u003e\n\u003cp\u003eOmaha stepped to Safia’s side. “He’s speaking Shahran.”\u003c/p\u003e\n\u003cp\u003eSafia’s mind spun. The Shahra were the mountain clan that traced their lineage to King Shaddad, the first ruler of Ubar…or rather the consort of its first queen.\u003c/p\u003e\n\u003cp\u003eBarak spoke, hearing Omaha. “We are all of the Shahra clan.”\u003c/p\u003e\n\u003cp\u003eCaptain al-Haffi rose to his feet. Another man returned his crutch.\u003c/p\u003e\n\u003cp\u003eSafia realized what she had just witnessed: the formal acknowledgment of the king’s line to its queen.\u003c/p\u003e\n\u003cp\u003eCaptain al-Haffi motioned them to follow, speaking again in English. “I had thought to get you clear, but all I can offer is shelter. We must hope my men and your women can hold the marauders off. Come.”\u003c/p\u003e\n\u003cp\u003eHe led the way back around the palace. Everyone followed.\u003c/p\u003e\n\u003cp\u003eOmaha paced next to Barak. “You are Shahra?”\u003c/p\u003e\n\u003cp\u003eThe man nodded.\u003c/p\u003e\n\u003cp\u003e“So that’s why you knew about that back door out of the mountains, through that graveyard. You said only the Shahra knew of that path.”\u003c/p\u003e\n\u003cp\u003e“The Vale of Remembrance,” Barak intoned more formally. “The graves of our ancestors, back to the exodus from Ubar.”\u003c/p\u003e\n\u003cp\u003eCaptain al-Haffi hobbled alongside Lu’lu. Kara helped her from the other side, continuing their conversation. “Is that why you all volunteered for the mission? Because of its ties to Ubar.”\u003c/p\u003e\n\u003cp\u003eThe captain bowed his head. “I apologize for the ruse, Lady Kensington. But the Shahra do not reveal their secrets to outsiders. That is not our way. We are as much guardians of this place as the Rahim. We were given this burden by the last queen of Ubar, just before our two lines parted ways. As she divided the keys, so she divided the royal lines, each with its own secrets.”\u003c/p\u003e\n\u003cp\u003eSafia stared between the two, the houses of Ubar joined again.\u003c/p\u003e\n\u003cp\u003e“What secret was left with you?” Omaha asked him.\u003c/p\u003e\n\u003cp\u003e“The old path into Ubar. The one walked by the first queen. We were forbidden to open it until Ubar was tread again.”\u003c/p\u003e\n\u003cp\u003e“A back door,” Omaha said.\u003c/p\u003e\n\u003cp\u003eSafia should have known. The queen who sealed Ubar after the horrible tragedy here was too meticulous. She had contingency plans stacked atop contingency plans, spreading them across both lines.\u003c/p\u003e\n\u003cp\u003e“So there’s a way out of here?” Omaha asked.\u003c/p\u003e\n\u003cp\u003e“Yes, to the surface. But there is no escape there. The sandstorm rages, which makes crossing atop Ubar’s dome dangerous. It was what took us so long to get here, once we learned from Barak that the gate had been breached.”\u003c/p\u003e\n\u003cp\u003e“Well, better late than never,” Danny said behind them. \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-82.html","bookId":1530,"creation":"Oct 5, 2019 10:43:20 PM","modification":"Oct 5, 2019 10:43:20 PM"}
