{"id":105145,"no":93,"title":"Page 93","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Interesting,” Coral said. “For the mitochondria to propagate buckyballs in cells, it must need a few buckyballs as patterns, seeds, like those found in the original fertilized egg. But wipe them all out, and the mitochondria alone can’t generate them anew.” “So the powers are truly gone,” Safia said, dismayed. She looked at her palms, remembering the warmth and peace. Gone…\u003c/p\u003e\n\u003cp\u003eThe hodja took her hand and squeezed. Safia sensed the long stretch of time from the scared little girl lost in the desert, seeking shelter among the stones, to the woman standing here now.\u003c/p\u003e\n\u003cp\u003eNo, maybe the magic wasn’t completely gone.\u003c/p\u003e\n\u003cp\u003eThe warmth and peace she had experienced before had nothing to do with gifts or blessings. It was this human touch. The warmth of family, the peace of self and certainty. That was blessing enough for anyone.\u003c/p\u003e\n\u003cp\u003eThe hodja touched the ruby teardrop by her left eye. She spoke softly. “We Rahim call this Sorrow. We wear it to represent the last tear shed by the queen as she left Ubar, shed for the dead, for herself, for those who would follow and carry her burden.” Lu’lu dropped her finger. “We rename it this night, under the moon, simply Farah.” Safia translated. “Joy…”\u003c/p\u003e\n\u003cp\u003eA nod. “The first tear shed in happiness for our new life. Our burden is finally lifted. We can leave the shadows and walk again in full sunlight. Our time of hiding is over.” A trace of dismay must have persisted in Safia’s expression.\u003c/p\u003e\n\u003cp\u003eThe hodja reached and gently turned Safia around. “Remember, child, life is not a straight line. It cycles. The desert takes, but it gives back.” She freed her hand and motioned to the new lake swelling behind them. “Ubar is gone, but Eden has returned.”\u003c/p\u003e\n\u003cp\u003eSafia gazed across the moonlit waters.\u003c/p\u003e\n\u003cp\u003eShe pictured the Arabia lost to the past, before Ubar, before the meteor strike, a land of vast savannahs, verdant forests, meandering rivers, and plentiful life. She watched the flow of water across the parched sands of her home, the past and present overlapping.\u003c/p\u003e\n\u003cp\u003eCould it be possible?\u003c/p\u003e\n\u003cp\u003eThe Garden of Eden…reborn.\u003c/p\u003e\n\u003cp\u003eFrom behind, Omaha settled against her, arms reaching around.\u003c/p\u003e\n\u003cp\u003e“Welcome home,” he whispered in her ear.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eSandstorm\u003c/p\u003e\n\u003cp\u003eAPRIL 8, 2:45 P.M.\u003c/p\u003e\n\u003cp\u003eDARPA HEADQUARTERS\u003c/p\u003e\n\u003cp\u003eARLINGTON, VIRGINIA\u003c/p\u003e\n\u003cp\u003eP AINTER CROWE stood outside the office doors. He watched the custodian unscrew the nameplate. It had been there since the inception of Sigma Force. Mixed feelings warred in him: pride and satisfaction certainly, but also anger and a little shame. He had not wanted to gain this position under these awful circumstances.\u003c/p\u003e\n\u003cp\u003eThe nameplate fell off the door.\u003c/p\u003e\n\u003cp\u003eDIRECTOR SEAN MCKNIGHT.\u003c/p\u003e\n\u003cp\u003eThe former leader of Sigma.\u003c/p\u003e\n\u003cp\u003eIt was tossed in the garbage.\u003c/p\u003e\n\u003cp\u003eThe custodian grabbed the new black-and-silver plate from the secretary’s desk. He pressed it to the door and used an electric screwdriver to affix it in place. He stepped back.\u003c/p\u003e\n\u003cp\u003e“How’s that?” the man asked, tipping back his cap.\u003c/p\u003e\n\u003cp\u003eHe nodded, staring at the plate.\u003c/p\u003e\n\u003cp\u003eDIRECTOR PAINTER CROWE.\u003c/p\u003e\n\u003cp\u003eThe leader of Sigma Force’s next generation.\u003c/p\u003e\n\u003cp\u003eHe was due to be sworn in and take his oath in half an hour. How could he sit behind that desk?\u003c/p\u003e\n\u003cp\u003eBut it was his duty. Presidential directive. After all that had happened in Oman, DARPA had been shaken from top to bottom. The leader of the Guild had been a member of their own organization. Painter had brought both his suspicions and proof out of Oman. The experts here were able to recover the data from the hard drive of Cassandra’s laptop. It left a trail confirming Painter’s claim.\u003c/p\u003e\n\u003cp\u003eThe Minister was exposed.\u003c/p\u003e\n\u003cp\u003eHis plan to corrupt Sigma stopped.\u003c/p\u003e\n\u003cp\u003eHe unfortunately swallowed his own pistol before he could be taken into custody. It was surely a blow to the Guild, but they were like the mythic Hydra. Cut off one head, and another would eventually arise.\u003c/p\u003e\n\u003cp\u003ePainter would be ready.\u003c/p\u003e\n\u003cp\u003eA scuff of shoe drew his attention around. Painter smiled broadly, reaching out a hand. “What are you doing down here, sir?” Sean McKnight took his hand. “Old habits die hard. I just wanted to make sure you’re settled in here.” “Fine, sir.”\u003c/p\u003e\n\u003cp\u003eHe nodded, clapped Painter on the shoulder. “I’m leaving Sigma in good hands.” “Thank you, sir.”\u003c/p\u003e\n\u003cp\u003eSean stepped forward, noted his old nameplate in the trash, and bent to retrieve it. He picked it up and tucked it inside his jacket.\u003c/p\u003e\n\u003cp\u003ePainter’s face burned with shame.\u003c/p\u003e\n\u003cp\u003eBut Sean merely smiled and patted his jacket. “For old times’ sake.” He strode away. “I’ll see you at the swearing-in ceremony.” They would both be taking their oaths today.\u003c/p\u003e\n\u003cp\u003eAs Painter was filling Sean’s position, Sean would be filling the vacancy in the directorship left behind by Vice Admiral Tony “The Tiger” Rector.\u003c/p\u003e\n\u003cp\u003eThe Minister.\u003c/p\u003e\n\u003cp\u003eThe bastard was so vain as to use a code name derived from his own last name. Rector. Meaning a member of the clergy.\u003c/p\u003e\n\u003cp\u003eIn Oman, Painter had almost pegged Sean as the traitor. But when Painter had heard Cassandra mention the Minister, he had realized his mistake. Two men sent him on this mission: Sean McKnight and Admiral Tony Rector. Naturally, Sean would have passed Painter’s intelligence to Rector, his boss, but it was Rector who had leaked it to Cassandra.\u003c/p\u003e\n\u003cp\u003eThe laptop’s data confirmed the connection.\u003c/p\u003e\n\u003cp\u003eRector had been attempting to usurp Sigma for himself. Cassandra was his first mole. Even back at Foxwoods, she had been ordered to orchestrate and facilitate the passing of military secrets to the Chinese through Xin Zhang. The purpose was to embarrass Sigma’s leadership. This failure had been intended as a crowbar to pry Sean McKnight out of office so Rector could place someone loyal to the Guild in charge.\u003c/p\u003e\n\u003cp\u003eBut now it was over.\u003c/p\u003e\n\u003cp\u003eHe stared at the closed door. It was a new chapter of his life.\u003c/p\u003e\n\u003cp\u003eHe thought back to the long road that had led him here. The letter was still in his jacket pocket. Standing now, he took it out. He fingered its sharp edges, ran a thumb over the oatmeal envelope. His name was neatly embossed on the front. He had received it last week. If he wasn’t brave enough to face this, he’d never get past the door here.\u003c/p\u003e\n\u003cp\u003eStanding still, he sliced open the seal and pulled out the contents. Translucent vellum, textured cotton card stock, hand-deckled edge. Nice.\u003c/p\u003e\n\u003cp\u003eA slip of paper fell out. He caught it and flipped it over.\u003c/p\u003e\n\u003cp\u003eBe there…\u003c/p\u003e\n\u003cp\u003e—Kara\u003c/p\u003e\n\u003cp\u003eWith a slight shake of his head and a small smile, he opened the invitation and read through it. A June wedding. To be held on the banks of Lake Eden, the new inland freshwater lake of Oman. Drs. Omaha Dunn and Safia al-Maaz.\u003c/p\u003e\n\u003cp\u003eHe sighed. It hadn’t hurt as much as he’d expected.\u003c/p\u003e\n\u003cp\u003eHe thought about all the others who had brought him to this door. Coral was already on another assignment in India. Danny and Clay, the best of buddies, were on a dig together…in India. The choice of dig sites had to be Danny’s idea. The Shahra and Rahim had united their clans to much celebration in Oman. And a new Shabab Oman was being built. Kara was overseeing the ship’s construction while financing the repairs to the British Museum. He had read in People magazine that she was involved with a young doctor, someone she met while in rehab.\u003c/p\u003e\n\u003cp\u003eHe glanced back to Kara’s note. Be there…\u003c/p\u003e\n\u003cp\u003eMaybe he could.\u003c/p\u003e\n\u003cp\u003eBut first he had to get through this door.\u003c/p\u003e\n\u003cp\u003ePainter strode up, grabbed the handle, took a deep breath, and pushed.\u003c/p\u003e\n\u003cp\u003eOn to the next big adventure. \u003c/p\u003e","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-93.html","bookId":1530,"creation":"Oct 5, 2019 10:43:20 PM","modification":"Oct 5, 2019 10:43:20 PM"}
