{"id":110601,"no":32,"title":"Page 32","content":"\u003cp\u003eWE FACED EACH other, now, like gladiators on the sands of some mysterious arena. A struggle to the death, the strange thought came to me. Yet both of us were already dead. What was our struggle then?\u003c/p\u003e\n\u003cp\u003eI only knew that, if I failed to win it, both of us were lost.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no afterlife,\" I began.\u003c/p\u003e\n\u003cp\u003e\"None.\u0027\u0027 Glaring at me, almost cowing me with her defiance.\u003c/p\u003e\n\u003cp\u003e\"Then I couldn\u0027t know of anything that happened after my death.\"\u003c/p\u003e\n\u003cp\u003eA moment\u0027s confusion on her face before she muttered, scornfully, \"Your death,\"\u003c/p\u003e\n\u003cp\u003e\"I say I\u0027m Chris,\" I told her.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re--\"\u003c/p\u003e\n\u003cp\u003e\"Your husband Chris.\" \"And I say you\u0027re a fool for saying it.\" Now she seemed to be regaining strength.\u003c/p\u003e\n\u003cp\u003e\"Believe what you will,\" I persisted. \"But, whoever I am, I couldn\u0027t know what happened to you after your husband died, could I? I mean details,\" I added, cutting her off. \"Could I?\"\u003c/p\u003e\n\u003cp\u003eShe looked at me suspiciously. I knew she wondered what I was getting at. I continued quickly to keep her off balance. \"No, I couldn\u0027t,\" I answered myself. \"You know I couldn\u0027t. Because if I did--\"\u003c/p\u003e\n\u003cp\u003e\"What details?\" she interrupted fiercely.\u003c/p\u003e\n\u003cp\u003e\"Details like you and the children sitting in the front row of the church. Like someone touching your shoulder, making you start.\"\u003c/p\u003e\n\u003cp\u003eI knew, from her reaction, that my opening move was a failure. Obviously, she didn\u0027t remember my touch. She gazed at me with open contempt.\u003c/p\u003e\n\u003cp\u003e\"Things like the house filled with people after the funeral,\" I went on. \"Richard serving drinks at the bar--\"\u003c/p\u003e\n\u003cp\u003e\"Do you think--?\" she started.\u003c/p\u003e\n\u003cp\u003e\"Your brother Bill there, Pat, your brother Phil, his wife and--\"\u003c/p\u003e\n\u003cp\u003e\"Is that what you call--?\"\u003c/p\u003e\n\u003cp\u003e\"You in the closed bedroom, lying on our bed, Ian sitting beside you, holding your hand.\"\u003c/p\u003e\n\u003cp\u003eI knew I\u0027d made a hit for she jerked as though I\u0027d struck her. It was something she\u0027d remember vividly, being a moment of sorrow. I was on safer ground now--unhappy ground but safer. \"Ian saying, to you, that he knew it was insane but he felt that I was there with you.\"\u003c/p\u003e\n\u003cp\u003eAnn began to shake.\u003c/p\u003e\n\u003cp\u003e\"Your telling him: I know you want to help--\"\u003c/p\u003e\n\u003cp\u003eShe whispered something. \"What?\"\u003c/p\u003e\n\u003cp\u003eShe whispered it again. I still couldn\u0027t hear. \"What, Ann?\"\u003c/p\u003e\n\u003cp\u003e\"Leave me alone,\u0027\u0027 she told me in a rasping voice.\u003c/p\u003e\n\u003cp\u003e\"You know I\u0027m right,\" I said. \"You know I was there. Which proves--\u0027\u0027\u003c/p\u003e\n\u003cp\u003eThe filming across her eyes again. So fast it appeared almost physical. She turned her head away. \"I wish it would rain,\" she murmured.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m right, aren\u0027t I?\" I demanded. \"These things really happened. Didn\u0027t they?\"\u003c/p\u003e\n\u003cp\u003eShe labored to her feet, looking groggy.\u003c/p\u003e\n\u003cp\u003e\"Are you afraid to hear the truth?\"\u003c/p\u003e\n\u003cp\u003eShe sank back down. \"What truth?\" Her body jerked spasmodically. \"What are you talking about?\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no afterlife?\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Her face gone rigid with fear and fury.\u003c/p\u003e\n\u003cp\u003e\"Then why did you agree to a seance with Perry?\"\u003c/p\u003e\n\u003cp\u003eShe jerked again as though struck.\u003c/p\u003e\n\u003cp\u003e\"He told you I was sitting by you in the cemetery,\" I said. \"I\u0027ll tell you what he said, word for word. \u0027I know how you feel, Mrs. Nielsen, but take my word for it. I see him right beside you. He\u0027s wearing a dark blue shirt with short sleeves, blue checked slacks --\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re lying. Lying.\" Her voice was guttural, her teeth clenched tightly, her expression one of malignant wrath.\u003c/p\u003e\n\u003cp\u003e\"Shall I tell you what you said to Perry at the house?\"\u003c/p\u003e\n\u003cp\u003eShe tried to stand again but couldn\u0027t. The filming of her gaze came and went. \"Not interested,\" she mumbled.\u003c/p\u003e\n\u003cp\u003e\"You said \u0027I don\u0027t believe in survival after death. I believe that when we die we die and that\u0027s the end of it.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right!\" she cried.\u003c/p\u003e\n\u003cp\u003eA leap of futile hope. \"That is what you said?\"\u003c/p\u003e\n\u003cp\u003e\"Death is the end of it!\"\u003c/p\u003e\n\u003cp\u003eI fought off momentary loss. \"Then how do I know these things?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"You made them up!\"\u003c/p\u003e\n\u003cp\u003e\"You know that isn\u0027t true! You know that everything I\u0027ve described is exactly the way it happened!\"\u003c/p\u003e\n\u003cp\u003eShe managed to stay on her feet this time. \"I don\u0027t know who you are,\" she said, \"but you\u0027d better get out of here before it\u0027s too late.\"\u003c/p\u003e\n\u003cp\u003e\"Too late for whom?\" I asked. \"You or me?\"\u003c/p\u003e\n\u003cp\u003e\"You!\"\u003c/p\u003e\n\u003cp\u003e\"No, Ann,\" I said. \"I know what\u0027s happened. You\u0027re the one who doesn\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re my husband?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Mister,\" she said; she almost spat the word at me. \"I\u0027m looking right at you and you\u0027re not my husband.\u0027\u0027\u003c/p\u003e\n\u003cp\u003eI felt a sudden, wrenching coldness in my chest.\u003c/p\u003e\n\u003cp\u003eShe saw the depth of my reaction and took immediate advantage of it. \"If you were my husband,\" she said, \"you wouldn\u0027t say such things to me. Chris was kind. He loved me.\"\u003c/p\u003e\n\u003cp\u003e\"I love you too.\" I felt depression rising. \"I\u0027m here because I love you.\"\u003c/p\u003e\n\u003cp\u003eHer laugh was a cynical, chilling sound. \"Love,\u0027\u0027 she said. \"You don\u0027t even know me.\"\u003c/p\u003e\n\u003cp\u003eThe ground was slipping out from under me. \"I do!\" I cried. \"I\u0027m Chris! Can\u0027t you see that?! Chris!\" My loss was complete as she smiled in cold victory. \"How can you be here then?\" she asked. \"He\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003eIt had all been in vain. There was no way of convincing her because she, literally, could not conceive of afterlife. No one can conceive of the impossible. And, to Ann, survival after death was an impossibility.\u003c/p\u003e\n\u003cp\u003eShe turned and walked from the living room, followed by Ginger.\u003c/p\u003e\n\u003cp\u003eAt first, the\" shock of it failed to register. I sat watching her go as if it had no importance to me. Then it struck and I stood in dumbfounded shock. I\u0027d done everything I could to convince her, thought I\u0027d had her on the razor edge of belief only to discover I\u0027d accomplished nothing.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eI moved after her but, now, without hope. Each step seemed to bring another condensation to my mind and body--a curdling of thought, a clogging of flesh which grew increasingly worse.\u003c/p\u003e\n\u003cp\u003eFor a ghastly moment, I thought I was home again, that this was where I belonged.\u003c/p\u003e\n\u003cp\u003eStopping, I resisted the hideous process. I couldn\u0027t bear to stay in that place. It was too horrible.\u003c/p\u003e\n\u003cp\u003eAnn\u0027s cry of terror from our bedroom made me break into a run.\u003c/p\u003e\n\u003cp\u003eI say a run but it was more a hobble, my legs coated with lead. It was then that I knew what Ann had described. Like her, I could barely lift my feet. And it was worse for her.\u003c/p\u003e\n\u003cp\u003eI stopped in the bedroom doorway, Ginger whirling to face me. Ann was pressed against the wall, staring at our bed.\u003c/p\u003e\n\u003cp\u003eAcross its dingy, faded spread, a tarantula the size of a man\u0027s fist was crawling.\u003c/p\u003e\n\u003cp\u003eThe moment was frozen. Ann against the wall. Ginger staring at me. Me in the doorway.\u003c/p\u003e\n\u003cp\u003eThe only thing that moved, with bloated sluggishness, was the enormous, furry spider.\u003c/p\u003e\n\u003cp\u003eAs it started up the pillow on Ann\u0027s side, she made a gagging noise. I wondered, for a dreadful moment, if she\u0027d done this to herself; an unconscious punishment for not believing what I\u0027d told her. Created an image of the most repugnant thing she could imagine--a huge tarantula walking on the place where she lay her head in sleep.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know why Ginger made no move as I entered the room. Was it because she, now, sensed that I was really there to help Ann? I have no answer. I only know that she let me walk by Ann and reach the bed.\u003c/p\u003e\n\u003cp\u003ePicking up the pillow gingerly, I started to turn. I gasped and flung it from me as the spider made a sudden, hitching movement toward my right hand. Ann cried out, sickened, as the tarantula thudded on the bedspread.\u003c/p\u003e\n\u003cp\u003eHastily, I snatched up the pillow and dropped it on top of the spider. Then, as quickly as I could, I grabbed the spread at each corner and pulled it over the pillow. Picking up the bundle, I carried it to the door and slide it open. Tossing the spread outside, I shut the door again and locked it.\u003c/p\u003e\n\u003cp\u003eAs I turned back, Ann was stumbling to the bed and falling on it, stonelike.\u003c/p\u003e\n\u003cp\u003eMotionless, I stared at her.\u003c/p\u003e\n\u003cp\u003eThere were no movements left to make. I\u0027d exhausted all possibilities.\u003c/p\u003e\n\u003cp\u003eThe encounter was over, the battle ended. \u003c/p\u003e","sourceLink":"https://allnovel.net/what-dreams-may-come/page-32.html","bookId":2541,"creation":"Oct 6, 2019 12:02:37 AM","modification":"Oct 6, 2019 12:02:37 AM"}
