{"id":110605,"no":36,"title":"Page 36","content":"\u003cp\u003eTHERE WAS ONE thing more I had to do before departure.\u003c/p\u003e\n\u003cp\u003eDictate this book and have it brought to you.\u003c/p\u003e\n\u003cp\u003eAgain, I will not detail how I was put in contact with the woman who brought you this manuscript. Originally, I\u0027d planned to have it given to my children. But when it turned out that the only sensitive available was on the east coast, I decided to have the book brought to you instead.\u003c/p\u003e\n\u003cp\u003eI hope it is published and read by many. I hope that, at the very least, a few people are prepared for the inevitable transition which will take place at the end of their lives.\u003c/p\u003e\n\u003cp\u003eMy account draws to a close.\u003c/p\u003e\n\u003cp\u003eRemember this: What I have told you is partial. It could be no other way. I could only tell you what I, personally, saw and heard. It is my recollection of what happened, nothing more. Recall what Albert told me.\u003c/p\u003e\n\u003cp\u003eThe mind is all.\u003c/p\u003e\n\u003cp\u003eI emphasize that strongly. The experience was my experience and no one else\u0027s. While it is all completely true, it is not, by any means, definitive regarding afterlife experience.\u003c/p\u003e\n\u003cp\u003eAnother person would tell a different story.\u003c/p\u003e\n\u003cp\u003eRemember this as well: Things I have not told you would fill a hundred volumes. Accept my word that the variety in afterlife is boundless. There is so much more that my account is as a grain of sand to all the beaches and the deserts in the world.\u003c/p\u003e\n\u003cp\u003eI must mention, too, that all I have described has taken place on a relatively low level of spiritual existence. There are planes which I have never known and may not know for eons.\u003c/p\u003e\n\u003cp\u003eIn brief, there is no standard afterlife reality. I told you my experience. Yours will be different. You can be sure of only one thing.\u003c/p\u003e\n\u003cp\u003eIt will happen.\u003c/p\u003e\n\u003cp\u003eI feel it vital to enlarge upon my point.\u003c/p\u003e\n\u003cp\u003eNothing is as simple as I have stated it.\u003c/p\u003e\n\u003cp\u003eIn actuality, the conditions of survival cannot be explained in terms of time, space and form. I have described people, locations and events but these were subject to my ability -- or lack of it--to see things as they really are.\u003c/p\u003e\n\u003cp\u003eIn point of fact, the entire experience may have been precisely what I told myself it was following my death.\u003c/p\u003e\n\u003cp\u003eA dream.\u003c/p\u003e\n\u003cp\u003eWhen you sleep, your dream world is as real to you as life, isn\u0027t it?\u003c/p\u003e\n\u003cp\u003eSo it may be here as well.\u003c/p\u003e\n\u003cp\u003eBy that token, it is only natural that what I have referred to as Summerland would appear as it does. Since the phenomena of this level are essentially thought pictures carried over by the consciousness of those newly arrived from earth, what else could Summerland be but an idealized version of earth?\u003c/p\u003e\n\u003cp\u003eAlbert told me, at the very outset, that heaven was a state of mind.\u003c/p\u003e\n\u003cp\u003eIt is.\u003c/p\u003e\n\u003cp\u003eConsider though. Isn\u0027t earth a state of mind as well? Matter is no more than energy which, to the human intellect, appears static. Life is the state of consciousness which perceives this energy as matter. Death is the state of consciousness which no longer perceives it as such. Life on earth is only a panorama of vivid observations which seem real to you.\u003c/p\u003e\n\u003cp\u003eWhy should afterlife seem less real?\u003c/p\u003e\n\u003cp\u003eLet me not confuse you though.\u003c/p\u003e\n\u003cp\u003eIt will seem real enough to you.\u003c/p\u003e\n\u003cp\u003eAnd, please, my brother, do not fear it.\u003c/p\u003e\n\u003cp\u003eDeath is not the king of terrors.\u003c/p\u003e\n\u003cp\u003eDeath is a friend.\u003c/p\u003e\n\u003cp\u003eConsider it this way. Do you fear to sleep at night? Of course not. Because you know that you will wake again.\u003c/p\u003e\n\u003cp\u003eThink of death the same way. As a sleep from which, inevitably, you will awaken.\u003c/p\u003e\n\u003cp\u003eTrue life is a process of becoming. Death is a stage in this progression. Life is not followed by un-life.\u003c/p\u003e\n\u003cp\u003eThere is only a single continuity of being.\u003c/p\u003e\n\u003cp\u003eWe are part of a plan, never doubt that. A plan to bring each one of us to the highest level of which we are capable. The way will be dark at times but it leads, assuredly, to light.\u003c/p\u003e\n\u003cp\u003eNever forget, however, that we pay for every act and thought and feeling we commit.\u003c/p\u003e\n\u003cp\u003eOne statement from the Bible says it all.\u003c/p\u003e\n\u003cp\u003eWhatsoever a man soweth, that shall he also reap.\u003c/p\u003e\n\u003cp\u003ePeople are not punished for their deeds but by them.\u003c/p\u003e\n\u003cp\u003eIf only everyone believed that.\u003c/p\u003e\n\u003cp\u003eIf only every man and woman in the world knew--beyond a shadow of a doubt--that they would have to face the consequences of their lives.\u003c/p\u003e\n\u003cp\u003eThe world could change overnight. God bless you.\u003c/p\u003e\n\u003cp\u003eI return to my love. \u003c/p\u003e","sourceLink":"https://allnovel.net/what-dreams-may-come/page-36.html","bookId":2541,"creation":"Oct 6, 2019 12:02:37 AM","modification":"Oct 6, 2019 12:02:37 AM"}
