{"id":110579,"no":9,"title":"Page 9","content":"\u003cp\u003eTHE IDEA ONLY struck me then. I can\u0027t conceive why it took so long except, perhaps, that there had been so many new amazing things to adjust to that my mind simply hadn\u0027t found time for it until that moment.\u003c/p\u003e\n\u003cp\u003e\"My father.\" I said, \"Your parents. Our uncles and aunts. Are they all here?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Here\u0027 is a big place, Chris,\" he answered with a smile. \"If you mean did they all survive, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Where are they?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d have to check,\" he told me. \"The only ones I know about for sure are my mother and Uncle Sven.\"\u003c/p\u003e\n\u003cp\u003eI felt a glow of pleasure at the mention of Uncle\u0027s name. The image of him sprang to mind: his bald, shiny head, his bright eyes twinkling behind horn rim glasses, his cheery expression and voice, his unfailing sense of humor. \"Where is he?\" I asked. \"What does he do?\"\u003c/p\u003e\n\u003cp\u003e\"He works with music,\" Albert said.\u003c/p\u003e\n\u003cp\u003e\"Of course.\" I had to smile again. \"He always loved music. Can I see him?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly.\" Albert returned my smile. \"I\u0027ll arrange it as soon as you\u0027ve become more acclimated.\"\u003c/p\u003e\n\u003cp\u003e\"And your mother too,\" I said. \"I never knew her very well but I\u0027d certainly like to see her again.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll arrange it,\" Albert said.\u003c/p\u003e\n\u003cp\u003e\"What did you mean about having to check?\" I asked. \"Don\u0027t families stay together?\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily,\" he told me. \"Earth ties have less meaning here. Relationships of thought, not blood, are what count.\"\u003c/p\u003e\n\u003cp\u003eThat sense of awe again. \"I have to tell Ann about this,\" I said. \"Let her know where I am--that everything\u0027s all right. I want that more than anything.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s really no way, Chris,\" Albert said. \"You can\u0027t get through.\"\u003c/p\u003e\n\u003cp\u003e\"But I almost did.\" I told him how I\u0027d gotten Marie to write my message.\u003c/p\u003e\n\u003cp\u003e\"The two of you must have a great affinity,\" he said. \"Did she show it to your wife?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I shook my head. \"But I could try again.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re beyond that now,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But I have to let her know.\"\u003c/p\u003e\n\u003cp\u003eHe put a hand on my shoulder. \"She\u0027ll be with you soon enough,\" he told me gently.\u003c/p\u003e\n\u003cp\u003eI had no idea what else to say. The thought that there was no way left to let Ann know I was all right was terribly depressing. \"What about someone like Perry?\" I asked, remembering suddenly. I told Albert about him.\u003c/p\u003e\n\u003cp\u003e\"Remember that you and he were on the same level then,\" Albert said. \"He wouldn\u0027t be aware of you now.\"\u003c/p\u003e\n\u003cp\u003eSeeing my expression, Albert put an arm around my shoulder. \"She\u0027ll be here, Chris,\" he said. \"I guarantee it.\" He smiled. \"I can understand your feeling. She\u0027s a lovely person.\"\u003c/p\u003e\n\u003cp\u003e\"You know about her?\" I asked, surprised.\u003c/p\u003e\n\u003cp\u003e\"About her, your children, Katie, your office, everything,\" he said. \"I\u0027ve been with you for more than twenty years. Earth time, that is.\"\u003c/p\u003e\n\u003cp\u003e\"Been with me?\"\u003c/p\u003e\n\u003cp\u003e\"People on earth are never alone,\" he explained. \"There\u0027s always someone as a guide for each individual.\"\u003c/p\u003e\n\u003cp\u003e\"You mean you were my--guardian angel?\" The phrase sounded trite but I could think of no other.\u003c/p\u003e\n\u003cp\u003e\"Guide is a better word,\" Albert said. \"Guardian angel is a concept derived by ancient man. He sensed the truth about guides but misinterpreted their identity because of his religious beliefs.\"\u003c/p\u003e\n\u003cp\u003e\"Ann has one too?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Then can\u0027t her guide let her know about me?\"\u003c/p\u003e\n\u003cp\u003e\"If she were open to it, yes, easily,\" he answered and I knew there was no answer there. She was insulated by her skepticism.\u003c/p\u003e\n\u003cp\u003eAnother thought; this one brought about by the discovery that Albert had been near me for decades: a sense of shame as I realized that he\u0027d been witness to many less than admirable acts on my part.\u003c/p\u003e\n\u003cp\u003e\"You were all right, Chris,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Are you reading my mind?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Something like that,\" he answered. \"Don\u0027t feel too badly about your life. Your flaws have been duplicated in the lives of millions of men and women who are, basically, good.\"\u003c/p\u003e\n\u003cp\u003e\"My flaws were mostly to do with Ann,\" I said. \"I always loved her but, too often, failed her.\"\u003c/p\u003e\n\u003cp\u003e\"Mostly when you were young,\" he told me. \"The young are too involved with themselves to really understand their mates. The making of a career alone is enough to subvert the capacity to understand. It was the same way in my life. I never got a chance to marry because I came across too young. But I failed to properly understand my mother, my father, my sisters. What\u0027s the phrase from that play? It goes with the territory, Chris.\"\u003c/p\u003e\n\u003cp\u003eIt occurred to me that he had died before that play was written. I made no mention of it though, still concerned about Ann. \"There\u0027s really no way at all I can get through to her?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Perhaps something will develop in time,\" he said. \"At the moment, her disbelief is an impassable barrier.\" He removed his arm from my shoulder and patted my back reassuringly. \"She will be with you though,\" he said. \"Count on it.\"\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t have to go through what I did, will she?\" I asked, uneasily.\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t likely,\" he answered. \"The circumstances are bound to be different.\" He smiled. \"And we\u0027ll keep an eye on her.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"All right.\" I wasn\u0027t actually reassured by his words but forced my thoughts away from the problem for then. Looking around, I told him that he must be quite a gardener.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"There are gardeners, of course,\" he said. \"But not for tending gardens. They require no tending.\"\u003c/p\u003e\n\u003cp\u003e\"None?\" I was amazed again.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no lack of moisture,\" he told me. \"No extremes of heat or cold, no storms or winds, snow or sleet. No random growth.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t the grass even have to be mowed?\" I asked, remembering our lawns in Hidden Hills and how often Richard, then Ian had to mow them.\u003c/p\u003e\n\u003cp\u003e\"It never grows beyond this height,\" Albert said.\u003c/p\u003e\n\u003cp\u003e\"You say there are no storms,\" I went on, making myself concentrate on other things besides my concern for Ann. \"No snow or sleet. What about people who like snow? This wouldn\u0027t be heaven to them. What about the colors of autumn? I love them. So does Ann.\"\u003c/p\u003e\n\u003cp\u003e\"And there are places were you can see them,\" he said. \"We have all the seasons in their own locations.\" I asked about the flow of energy I\u0027d felt from the tree trunk, grass blade, flowers and water.\u003c/p\u003e\n\u003cp\u003e\"Everything here emits a beneficial energy,\u0027\u0027 he answered.\u003c/p\u003e\n\u003cp\u003eThe sight of Kate sitting contentedly beside me made me smile and kneel to pet her again. \"Has she been here with you?\" I asked.\u003c/p\u003e\n\u003cp\u003eAlbert nodded, smiling.\u003c/p\u003e\n\u003cp\u003eI was about to say something about how much Ann missed her but held it back. Katie had been her inseparable companion. She adored Ann.\u003c/p\u003e\n\u003cp\u003e\"But you haven\u0027t seen my home yet,\" Albert said. I stood and, as we strolled toward the house, I commented on its lack of windows and door.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no need for them,\" he said. \"No one would intrude though everyone is welcome.\" \"Does everyone live in houses like this?\" \"They live as they did on earth,\" he answered. \"Or as they wished they had lived. I never had a home like this, as you know. I always dreamed about it though.\" \"Ann and I did too.\" \"Then you\u0027ll have one like it.\" \"Will we build it?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Not with tools,\" he said. \"I built this house with my life.\" He gestured toward it. \"Not that it was like this when I first arrived,\" he said. \"Like the rooms of my mind, the rooms of the house were not all that attractive. Some were dark and messy and the air in them was heavy. And, in this garden, mixed among the flowers and bushes were weeds I\u0027d grown in life.\u003c/p\u003e\n\u003cp\u003e\"It took a while to reconstruct,\" he said, smiling at the memory. \"I had to revise the image of it--the image of myself, that is--detail by detail. A section of wall here, a floor there, a doorway, a furnishing.\" \"How did you do it?\" I asked. \"With mind,\" he said. \"Does everyone have a house waiting for them when they arrive?\"\u003c/p\u003e\n\u003cp\u003e\"No, most build their houses afterward,\" he said. \"With help, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Help?\"\u003c/p\u003e\n\u003cp\u003e\"There are building circles,\" he told me. \"Groups of people skilled in construction.\" \"By using their minds?\"\u003c/p\u003e\n\u003cp\u003e\"Always with mind,\" he said. \"All things start in thought.\"\u003c/p\u003e\n\u003cp\u003eI stopped and looked up at the house which loomed above us. \"It\u0027s so ... earthlike,\" I said.\u003c/p\u003e\n\u003cp\u003eHe nodded, smiling. \"We\u0027re not so distant from our memories of earth that we desire anything too novel in the way of dwelling places.\" He made a welcoming gesture. \"But come inside, Chris.\"\u003c/p\u003e\n\u003cp\u003eWe walked into Albert\u0027s home. \u003c/p\u003e","sourceLink":"https://allnovel.net/what-dreams-may-come/page-9.html","bookId":2541,"creation":"Oct 6, 2019 12:02:37 AM","modification":"Oct 6, 2019 12:02:37 AM"}
