{"id":70423,"no":15,"title":"Page 15","content":"\u003cp\u003eThere was something familiar about her that Caleb couldn’t place, and he worked his brain to remember.\u003c/p\u003e\n\u003cp\u003e“Who’s your friend?” asked the woman, giving Caleb a thorough perusal.\u003c/p\u003e\n\u003cp\u003eHe felt Lana tense beside him and shot her a quick glance. That plastic, dimple-less smile was bright on her face, but her eyes were too wide. “This is my friend Caleb.\u003c/p\u003e\n\u003cp\u003eCaleb, meet Kara McIntire and Phil Macy. Volunteers.”\u003c/p\u003e\n\u003cp\u003ePhil held out a beefy hand in greeting. “New boyfriend, Lana?” He squeezed Caleb’s hand hard, entering one of the older, more childish pissing contests around. Caleb smiled as he squeezed back hard enough to make the bones in Phil’s hand shift. Phil relented with a grimace and put his hand behind his back, likely to massage it.\u003c/p\u003e\n\u003cp\u003eCaleb nodded his head toward the woman but didn’t offer to shake hands, because she didn’t seem inclined to, either. “Ma’am. Nice to meet you.”\u003c/p\u003e\n\u003cp\u003e“The pleasure is entirely mine,” purred Kara in a rich voice that matched her elegant attire.\u003c/p\u003e\n\u003cp\u003e“We heard about Stacie,” said Phil. “How is she?”\u003c/p\u003e\n\u003cp\u003e“She’l recover, but it’s going to take a while,” said Lana.\u003c/p\u003e\n\u003cp\u003eKara offered a gentle smile. “I hardly got a chance to know her, but I could tel we were going to be good friends.”\u003c/p\u003e\n\u003cp\u003e“She’l be back in a couple weeks, I’m sure. I’l tel her you were thinking about her next time I talk to her,” offered Lana.\u003c/p\u003e\n\u003cp\u003e“That would be lovely,” said Kara, dismissing the topic of Stacie with a wave of her hand. Her eyes roamed up and down Caleb’s body in a blatant show of admiration.\u003c/p\u003e\n\u003cp\u003e“I’m looking forward to seeing you again,” she said, then walked away in a lovely swing of hips. Phil wasn’t far behind, panting after her.\u003c/p\u003e\n\u003cp\u003eLana stood there, motionless, breathing a little too rapidly as if relieved.\u003c/p\u003e\n\u003cp\u003eCaleb stepped in front of her, blocking her from the rest of the room. He bent his knees and tilted up her chin so she couldn’t escape eye contact. For a moment, he was distracted by the startling beauty of her blue eyes fringed by dark lashes. “Has Phil been bothering you, Lana?”\u003c/p\u003e\n\u003cp\u003eHe saw her face shut down. No warmth, no anger. Just the neutral mask of a mannequin. “No.”\u003c/p\u003e\n\u003cp\u003e“I can speak with him. Make sure he knows to leave you alone. I promise when we’re done chatting he won’t go within twenty feet of you.”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare. He’s harmless and I don’t want your interference.”\u003c/p\u003e\n\u003cp\u003e“I’m not so sure about that, especialy not after what happened to Stacie.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to be sure.”\u003c/p\u003e\n\u003cp\u003e“Promise me that if he bothers you, you’l let me know.”\u003c/p\u003e\n\u003cp\u003eShe hesitated for a moment as if she was going to say something different, but what came out was, “Okay. I promise that if Phil bothers me, I’l tel you.”\u003c/p\u003e\n\u003cp\u003eCaleb gave a nod, but he wasn’t satisfied at al. There was something she wasn’t saying, but he had no idea what. He hated not being able to read her beneath that artificial expression.\u003c/p\u003e\n\u003cp\u003eShe walked off to join the kids who were coloring at the table. Caleb hung back and watched as she chatted with them, sometimes picking up a crayon or marker to help them color. One of the little girls asked her to draw a puppy, and Lana smiled indulgently. “Here, sit right beside me and draw what I draw,” said Lana to the girl.\u003c/p\u003e\n\u003cp\u003eThe little girl watched Lana’s paper as if waiting for a miracle to appear, but Lana hesitated. The pencil in her hand quivered as her hand shook and she closed her eyes in defeat. “My hand is tired. How about I use yours?”\u003c/p\u003e\n\u003cp\u003eThe girl nodded happily as Lana put the child on her lap and guided the chubby little hand over the paper. The puppy they drew was lopsided, but the girl ran off squealing with pride to show it to her big brother, who was playing basketbal.\u003c/p\u003e\n\u003cp\u003eCaleb looked back at Lana and saw the pain of loss on her face. He remembered those sketches in her apartment—how lifelike they were—and wondered if something had happened to her hands to make her unable to draw. Her left hand had been broken in Armenia, but her right had only been a little bruised. He knew because he’d spent hours holding her hand, praying that she’d live.\u003c/p\u003e\n\u003cp\u003eBefore he realized what he was doing, Caleb had gone to her and wrapped his hands over her slim shoulders. She felt delicate under his fingers, but Caleb knew that was an ilusion. Lana Hancock was made of tempered steel.\u003c/p\u003e\n\u003cp\u003eShe was stiff under his grip, but she didn’t flinch away.\u003c/p\u003e\n\u003cp\u003e“You look beat. Let me take you home,” he offered.\u003c/p\u003e\n\u003cp\u003eHe felt her sigh, her shoulders rising and faling with the long breath. “I should go back to the office, clean up the mess, see what can be salvaged.”\u003c/p\u003e\n\u003cp\u003e“You’re exhausted. Let it go for tonight.”\u003c/p\u003e\n\u003cp\u003e“I wish I could, but there’s so damn much to do, and now, with Stacie in the hospital—”\u003c/p\u003e\n\u003cp\u003e“Let it go tonight and I’l lend a hand tomorrow. I’m not Stacie, but maybe I can help.”\u003c/p\u003e\n\u003cp\u003eShe turned around and leaned back so she could look up at him. She had the oddest look on her face—a mix of hope and desperation that made his heart ache with the need to hold her and make her life a happy place. “I wish you could, Caleb. You have no idea how much.”\u003c/p\u003e\n\u003cp\u003eCHAPTER NINE\u003c/p\u003e\n\u003cp\u003eKara’s hand shook with excitement as she dialed Marcus Lark. She wasn’t sure if he was going to be pleased or angry that Caleb Stone was in town, but both prospects were thriling, each in its own way.\u003c/p\u003e\n\u003cp\u003e“Helo, love,” came Marcus’s deep voice from over a thousand miles away.\u003c/p\u003e\n\u003cp\u003eKara let a shiver course over her body at the sound of his voice. “I miss you,” she told him.\u003c/p\u003e\n\u003cp\u003e“Of course you do. I was hoping you’d be home soon.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t said he missed her, but Kara refused to pout. Marcus wasn’t a man given to affection or empty words. He was a man of action, and Kara was determined to prove to him that she was the kind of woman who could be his equal, the kind of woman who wouldn’t turn squeamish in the face of hardship.\u003c/p\u003e\n\u003cp\u003e“I was making you a gift.”\u003c/p\u003e\n\u003cp\u003eAn interested lilt colored his tone. “Oh? What sort of gift?”\u003c/p\u003e\n\u003cp\u003e“A video. Would you like to hear a sample?”\u003c/p\u003e\n\u003cp\u003eAt his silence, she pressed play and held the phone near the speaker on her laptop. Lana’s terrified screams shrieked from the speakers, and the image of her body writhing in imagined pain filed the screen. Marcus was going to love it.\u003c/p\u003e\n\u003cp\u003e“You’ve finished the job, then, I take it.”\u003c/p\u003e\n\u003cp\u003eHe thought those screams meant Lana was dead. Kara did pout then. She’d worked hard to colect al this footage and meld it together in a seamless montage of Lana’s suffering. It was a gift from the heart and yet stil not enough for him.\u003c/p\u003e\n\u003cp\u003eNothing she did for him was ever enough. That had to change. She couldn’t let him send her out on her own again. She would never go back to that life.\u003c/p\u003e\n\u003cp\u003e“I saw her today. Spoke to her.”\u003c/p\u003e\n\u003cp\u003e“You’re not there to toy with her.”\u003c/p\u003e\n\u003cp\u003e“I planned to finish it tonight,” she told him, unable to keep the sharpness from her tone. He’d punish her for that when she got home, but she’d learned to like that, too.\u003c/p\u003e\n\u003cp\u003e“I told you not to cal until it was done.”\u003c/p\u003e\n\u003cp\u003e“I thought you would want to know that there’s been a development. Caleb Stone came to town. He’s with her now.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause and the sound of grating teeth coming from the phone. “It’s too late, then. You’l never get to her now. Come home. We need to talk.”\u003c/p\u003e\n\u003cp\u003eIcy fear lanced through her body. She knew that tone. Marcus was more than simply mad, he was enraged. She’d failed him, and he was going to send her away. “I can stil do it. I swear.”\u003c/p\u003e\n\u003cp\u003e“How do you plan to kil her without getting caught?”\u003c/p\u003e\n\u003cp\u003e“You have no faith in me.”\u003c/p\u003e\n\u003cp\u003e“Too much is at stake. We alowed Caleb and his men to destroy the Swarm so they would leave us alone. If Caleb finds out that any of the old members survived, it wil start a hunt. It’s much easier to do business when none of his kind are watching us. I wil not let you compromise that advantage.”\u003c/p\u003e\n\u003cp\u003e“I won’t. I would never do anything like that to you.” Surely she’d proved her loyalty to him by now.\u003c/p\u003e\n\u003cp\u003e“How can you possibly prevent it if you proceed now? If anything happens to the girl, it wil be obvious who did it.”\u003c/p\u003e\n\u003cp\u003e“No. I’m being careful. I’ve hired help that can’t be linked back to us.”\u003c/p\u003e\n\u003cp\u003e“To me, you mean.”\u003c/p\u003e\n\u003cp\u003e“Yes. Of course, to you.”\u003c/p\u003e\n\u003cp\u003e“You are expendable,” he reminded her in a cruel tone.\u003c/p\u003e\n\u003cp\u003eAnd that cruelty hurt. She loved him so much. Al she ever wanted was to make him happy, to be by his side and feel like she belonged there. “I know.”\u003c/p\u003e\n\u003cp\u003eThe heat left his voice. It dropped to a low, seductive tone. “Come home to me, love. We’l figure out what to do together.”\u003c/p\u003e\n\u003cp\u003e“I can’t let you down like that. I’l finish what I started. You’l see I can do it. Just give me a little time.”\u003c/p\u003e\n\u003cp\u003eAnother long pause had her sweating. She knew that if he ordered her to come home, she would go. She would do anything for him, even if it meant letting him vent his anger on her. It wasn’t his fault she made him so angry.\u003c/p\u003e\n\u003cp\u003e“Fine. But if you do anything to compromise me, don’t bother coming back. I’l find you.”\u003c/p\u003e\n\u003cp\u003eLana slid under the cool sheets and stared at the ceiling. The fan twirled lazily overhead, sending a breeze over her arms and face. With al the lights in the room on and the heat of summer outside, the fan was the only thing keeping the room comfortable.\u003c/p\u003e\n\u003cp\u003eLana should have been too wired to sleep after a day like today, but instead she was exhausted. Even the fear of dreaming couldn’t keep her from her bed. The worry that Caleb would bust in again made her hesitate, but she couldn’t do anything to drive him away. He was stil sitting outside in his car after stuffing her ful of food and driving her home.\u003c/p\u003e\n\u003cp\u003eShe wasn’t sure how she’d managed to get the food down, but she did. It was al part of the act. Nothing was wrong. He might as wel leave, although she wasn’t so sure she wanted him to go anymore.\u003c/p\u003e\n\u003cp\u003eAt least she knew he could protect himself if Kara came after him.\u003c/p\u003e\n\u003cp\u003eLana wondered if Kara recognized Caleb as Miles Gentry. More important, she wondered if he’d recognized Kara—if he knew she was the woman who’d run the operation in Armenia, the woman who had ordered Lana’s death.\u003c/p\u003e\n\u003cp\u003eLana wasn’t sure that Caleb and Kara had ever actualy met, since Kara’s goon had served as the go-between as wel as the muscle. Lana had seen her only once, but that had been enough. Fear had imprinted her face on Lana’s memory the way nothing else could.\u003c/p\u003e\n\u003cp\u003eTonight Lana had been watching both Kara and Caleb closely, and she didn’t think that either one of them recognized the other. If so, they hid it wel.\u003c/p\u003e\n\u003cp\u003eAl this subterfuge made Lana’s head ache. She couldn’t keep up with al the lies, and it was wearing her thin. If it hadn’t been for Caleb’s support today at the hospital, she didn’t think she would have made it through.\u003c/p\u003e\n\u003cp\u003eHe hadn’t hovered or pushed her. He’d just been there, ready to help in whatever way she needed. Lana wasn’t used to that kind of treatment. Her family’s idea of helping was either babying her to the point where she wasn’t even alowed to feed herself or pushing her to lay al her pain and grief out in the open so she could “heal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-15.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
