{"id":70424,"no":16,"title":"Page 16","content":"\u003cp\u003eNeither one worked for her, but there was something about Caleb’s quiet support that made her burdens feel lighter.\u003c/p\u003e\n\u003cp\u003eMaybe fate hadn’t sent him back into her life to torture her, after al.\u003c/p\u003e\n\u003cp\u003eThen again, maybe this was fate’s way of giving her something only to rip it away later. Like her ex-fiancé, or her drawing, or her feeling of security. She had to remember that Caleb wasn’t going to become a permanent fixture. She couldn’t come to depend on him too much, because, unlike what she believed she’d had with Oran, Lana knew that Caleb’s presence was only temporary. The more temporary, the better—the safer—for everyone.\u003c/p\u003e\n\u003cp\u003eCaleb stretched out as much as he could in his rental car and downloaded the data from the mini-cam in Lana’s apartment. The break-in at her office bothered him, and not just because Stacie had been hurt, or because it could have just as easily been Lana who’d shown up to work first. It bothered him because there was nothing of value to steal, and any robber worth his salt would have broken in to either the walk-in clinic for a possible score of pain meds or the print shop, which was ful of expensive computer equipment. So if the break-in wasn’t for the sake of robbery, then it was for something else. The perp had definitely been looking for something. What could Lana have in her office that someone would want? And what did it have to do with what happened in Armenia, if anything? Even if the Swarm had somehow survived and was stil operating, the only thing they’d want is Lana’s death—proof that no one could escape their grasp. Whoever had broken in had wanted something more. What could they possibly think she was hiding at work? It didn’t make any sense inside the framework the Swarm operated in.\u003c/p\u003e\n\u003cp\u003eHis laptop chimed, indicating the data stored on the camera was ready to view. Caleb puled up the image of Lana’s apartment during the time they’d been gone today and scanned through it in fast motion, looking for anything unusual. About seven hours into the footage, Lana’s new front door opened, and someone who was covered from head to toe in black came in. He was fairly tal, nearly six feet, with a thin build. He moved confidently as he swept into the apartment, heading straight for Lana’s bookshelves. He puled out a book and leafed through it, looking carefuly at each page. Caleb couldn’t read the title or see what the intruder was looking at.\u003c/p\u003e\n\u003cp\u003eAfter he finished looking at the book, he went to the far wal, unscrewed the faceplate on the electrical outlet, and puled something out of the hole. Something else went back in, the faceplate was put back on, and the man left the apartment as easily as he’d come in.\u003c/p\u003e\n\u003cp\u003eThe whole section of footage covered maybe a minute, and Caleb realized that he’d just seen a pro at work. Whoever that man was, he knew what he was doing. And he was listening to every word Lana said.\u003c/p\u003e\n\u003cp\u003eCaleb’s stomach iced over, and he felt himself slipping into that adrenaline-altered state that prepared him for battle, stretching out each second into an endless eternity. By the time he reached Lana’s apartment, he knew exactly what he needed to do to get her out of her bugged house safely without letting whoever was listening, and possibly watching her, know.\u003c/p\u003e\n\u003cp\u003eCHAPTER TEN\u003c/p\u003e\n\u003cp\u003eLana had just changed into a comfy pair of short pajamas when she saw Caleb striding toward her apartment. There was a strange look on his face that she’d never seen him wear before. It was fierce, determined, without a hint of mercy anywhere.\u003c/p\u003e\n\u003cp\u003eHe knocked once before she got the door unlocked and opened it for him. “What is it?”\u003c/p\u003e\n\u003cp\u003eCaleb didn’t wait for her to step aside to let him in, he just moved forward, crowding her with his big body. “I’m sorry, baby,” he said in a low, fervent voice. “I couldn’t stay away. I need you too much.”\u003c/p\u003e\n\u003cp\u003eLana blinked in confusion and opened her mouth to ask him what the hel he was talking about when his mouth covered hers in a kiss, silencing her. His arms slid around her, and she heard the front door being kicked shut.\u003c/p\u003e\n\u003cp\u003eLana went stiff with shock for about two seconds before al her questions faded away. She hadn’t been kissed since before she left for Armenia. She’d forgotten how wonderful it was. That flush of heat, that spurt of excitement shooting through her limbs, that heavy, languid warmth that made her go weak in a realy nice way. She was hungry for it. Her body took over and decided that this was a good thing. Very good.\u003c/p\u003e\n\u003cp\u003eShe had no clue why Caleb was kissing her, but she didn’t care. She drank it in, starved for the contact of a man after being alone so long. And not just any man. Caleb. A hero with a body that that was carved by the hand of God for a woman’s pleasure. He was strength personified, and she felt al those masculine ridges pressing against her body. It was enough to make a woman melt and give herself up to whatever he had in mind, no matter how insane.\u003c/p\u003e\n\u003cp\u003eHis tongue teased her mouth open and she gave him entry, sighing with pleasure at his boldness. One wide hand pressed against the smal of her back, holding her tight to his hard body while the other hand cradled her head, guiding her so he could nibble his way to her ear. Everything he did felt right and she wanted more—wanted to kiss him back so he’d never stop. She tried to kiss his mouth, but he held her immobile.\u003c/p\u003e\n\u003cp\u003eIn a quiet, breathless voice, he said, “You’re being watched. Play along.”\u003c/p\u003e\n\u003cp\u003eHer brain stuttered trying to make sense of what he said, but finaly gave up. There was no sense to be made. Her whole world narrowed to the few square inches where his bare skin touched hers—his fingertips sliding under the hem of her pajama shirt, the press of his lips along the edge of her ear. She’d never felt anything so completely right in her life, and nothing else mattered.\u003c/p\u003e\n\u003cp\u003eHer heart pumped hard, heating her blood, making her feel both powerful and weak at the same time. Lana went up on tiptoe and guided his mouth back to hers, where it belonged. A rough, pleased male rumble vibrated against her breasts, making her nipples harden.\u003c/p\u003e\n\u003cp\u003e“Shower,” he whispered against her mouth.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I need to get you into the shower.” He sounded tense. Desperate. When her feet didn’t move fast enough, he picked her up and carried her into the bathroom, then set her down to turn on the water.\u003c/p\u003e\n\u003cp\u003eLana didn’t understand why he needed the shower, but she wasn’t sure she cared. Without his touch fogging her brain, her head had cleared enough to ask him, “Caleb, what are you—” but then he puled her back up against his big body and silenced her with another scorching kiss. His fingers clenched against her hips, and she could feel the hard length of his erection pressing into her bely.\u003c/p\u003e\n\u003cp\u003eLana’s mouth went dry at the proof of his desire for her. She couldn’t remember the last time she felt desired, and she’d never felt it quite like that before. The man was definitely built in perfect proportion—big everywhere.\u003c/p\u003e\n\u003cp\u003eHe stripped his shirt off over his head, giving Lana access to the sprawling width of his bare chest. Dark hair accentuated the deep ridges of his muscles, which his clothing had partialy concealed. Her hands couldn’t resist the lure of al that naked male skin, and she trailed her fingertips lightly over his pecs and down his ribs. Caleb shuddered, and his dark eyes shut tight as if he were trying to focus.\u003c/p\u003e\n\u003cp\u003eHe grabbed her wandering hands and held them hostage as he tested the temperature of the water. A second later, Lana was lifted into the tub, and he puled the curtain closed behind them. He maneuvered her under the pounding stream of water, dousing her from head to toe despite her clothing.\u003c/p\u003e\n\u003cp\u003eShe surrendered to his strange treatment, alowing her hands to slide up over his thick shoulders and back down along the muscles of his spine. Needy little noises were rising up in her throat, and there was nothing she could do to stop them. He felt too good. Tasted too good.\u003c/p\u003e\n\u003cp\u003eLana’s hands encountered his clothing, and she looked down to see he stil wore his jeans, which had turned dark with moisture, and his heavy boots.\u003c/p\u003e\n\u003cp\u003eSomething about this picture wasn’t right, but Lana’s brain was too busy dealing with a sudden dose of lust poisoning to care. She tugged her wet PJ shirt over her head, boldly displaying her naked breasts.\u003c/p\u003e\n\u003cp\u003eCaleb let out a low, pained groan, and his fingers clenched against her hips. “I don’t know how much more I can take,” he whispered so softly she barely heard it over the pounding of water on the tiles.\u003c/p\u003e\n\u003cp\u003e“A lot more, I hope,” she told him and pressed her breasts against his muscled body. The springy hair rasped lightly over her nipples, sending shockwaves of current racing along her nerves. She felt her body heat further until the warm water felt cool against her skin.\u003c/p\u003e\n\u003cp\u003eHis fingers plunged into her wet hair, and he bent down to whisper in her ear. “We have to stop now or I’m not going to be able to.”\u003c/p\u003e\n\u003cp\u003e“Then don’t.”\u003c/p\u003e\n\u003cp\u003e“They might be watching, and if things are going to go any farther, I’d rather not have an audience.”\u003c/p\u003e\n\u003cp\u003eLana had no idea what he was talking about. “Watching?”\u003c/p\u003e\n\u003cp\u003eHer voice wasn’t as quiet as his had been, and he silenced her with his mouth. Lana parted her lips and made a demanding foray with her tongue. She felt Caleb’s muscles trembling with effort, and after a moment, he puled away from her mouth. Lana tried to folow him, but he used his body to pin her against the cool tile.\u003c/p\u003e\n\u003cp\u003eShe shuddered as she felt the weight of his body hot along her front and the hard tiles cold against her back. Her wrists were captured tight in one of his big hands, and even as slippery as the water made their skin, she couldn’t break away to touch him.\u003c/p\u003e\n\u003cp\u003eHe gave her a stern look, but his eyes were black with need. “Listen!” he whispered urgently. “I need you to listen.”\u003c/p\u003e\n\u003cp\u003eWithout his mouth on hers driving her stupid, sanity started to return. Something was wrong. He was trying to tel her something was wrong.\u003c/p\u003e\n\u003cp\u003eLana stopped fighting against his hold.\u003c/p\u003e\n\u003cp\u003eCaleb let out a relieved sigh and leaned near her ear again, stil holding her body immobile. “Your house is bugged. The water is covering our voices, but we need to get out without them knowing we know.”\u003c/p\u003e\n\u003cp\u003eFear made blood drain from Lana’s limbs until she was hardly strong enough to stand. Her house was bugged. Oh, God.\u003c/p\u003e\n\u003cp\u003eCaleb must have seen that she’d finaly come to her senses, because his grip on her hands relaxed. “I’m going to get you out of here—I just need you to folow my lead.”\u003c/p\u003e\n\u003cp\u003eLana gave him a shaky nod.\u003c/p\u003e\n\u003cp\u003e“Damn!” said Caleb loud enough to be heard over the water. “I forgot the condoms.”\u003c/p\u003e\n\u003cp\u003e“Forgot them?” she asked. Her voice was perfect—al rough with unquenched desire and frustration.\u003c/p\u003e\n\u003cp\u003e“It’s okay, baby. I’l make it up to you,” he gave her an open-mouthed kiss just under her ear.\u003c/p\u003e\n\u003cp\u003eLana’s body arched against him despite her orders to stay stil. “How are you going to do that?”\u003c/p\u003e\n\u003cp\u003e“How about a nice getaway. Hotel room with room service. Champagne. Giant tub big enough for two.”\u003c/p\u003e\n\u003cp\u003e“What is it with you and sex in the shower?”\u003c/p\u003e\n\u003cp\u003e“I like you nice and wet,” he said in a deep, sexy tone.\u003c/p\u003e\n\u003cp\u003eLana felt something low in her bely clench tight against a wave of lust. Caleb’s grip tightened again, and it wasn’t until she felt it that she realized she’d tried to get free to touch him again. She wanted to run her hands over his body until she convinced him to strip naked and slide hot and thick inside her. \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-16.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
