{"id":70430,"no":22,"title":"Page 22","content":"\u003cp\u003eHe wished things between them had been different, but he was glad that he’d had the chance to know her, regardless of their past. Women as strong and selfless as her were rare, and knowing one made him feel like he’d been given a gift.\u003c/p\u003e\n\u003cp\u003eLana hung up the phone and was watching him with a suspicious frown. “What?” she asked.\u003c/p\u003e\n\u003cp\u003eCaleb couldn’t keep his distance, even though he knew that was the smart thing to do. Any excuse he could find to touch her, he took advantage of. This was one of those times. Caleb squatted down so he was on eye level with her. She had the most amazing eyes, with so many shades of blue, that for a second he found himself distracted.\u003c/p\u003e\n\u003cp\u003eCaleb blinked and focused on what was happening. He kept his voice low, though by now, it wasn’t a big issue if their listeners knew what was happening. The bugs would be gone within the hour. “In a minute, they’re going to do a sweep. You might not like what they find, and I think it wil be easier on you if we go grab some food and let them work.”\u003c/p\u003e\n\u003cp\u003eShe arched a dark brow. “You think that I’m going to let complete strangers into my office to rummage around? I just got finished cleaning up from the last guy who did that.”\u003c/p\u003e\n\u003cp\u003e“These aren’t strangers. They’re with me.”\u003c/p\u003e\n\u003cp\u003e“Are you staying with them while they do this sweep thing?”\u003c/p\u003e\n\u003cp\u003e“No, I’d go with you.”\u003c/p\u003e\n\u003cp\u003eLana shook her head. “I’d rather stay.”\u003c/p\u003e\n\u003cp\u003e“You sure? This can be hard to watch.”\u003c/p\u003e\n\u003cp\u003e“I’m good at doing the hard stuff,” she replied.\u003c/p\u003e\n\u003cp\u003eCaleb gave her a smile and tucked some hair behind her ear. “I know you are, but that doesn’t mean you have to be. Let’s get out of here for a while. Go see the kids at the youth center. Get your mind off of it.”\u003c/p\u003e\n\u003cp\u003eShe went tense as if he’d slapped her, and the center of her eyes shrank to frightened pinpoints. What the hel?\u003c/p\u003e\n\u003cp\u003e“What?” he asked her in a low, urgent voice.\u003c/p\u003e\n\u003cp\u003eShe swalowed and blinked, and just like that, the fear was gone, leaving behind a smooth mask of neutrality. “Nothing.”\u003c/p\u003e\n\u003cp\u003e“What are you afraid of?”\u003c/p\u003e\n\u003cp\u003eJust like that she shut down, and al the warmth in her eyes evaporated. “I’m fine. Going to the youth center is a great idea. I’l meet you in the car.” She grabbed her backpack, tossed him the office keys, and left the building.\u003c/p\u003e\n\u003cp\u003eCHAPTER FIFTEEN\u003c/p\u003e\n\u003cp\u003eThe youth center was stuffed ful of kids, their cheerful noise ricocheting off the high ceiling of the gym. The thrum of bouncing basketbals and squeak of tennis shoes filed one side of the gym while the other was quieter. Three long tables lined the space, and several of the volunteers sat with kids, reading to them or helping them with their homework.\u003c/p\u003e\n\u003cp\u003eLana just stood in the doorway, drinking in the joy she’d created. It was a happy place, a safe place. At least for everyone but her.\u003c/p\u003e\n\u003cp\u003eKara saw her come in and crossed the large room with Phil hot on her heels. Kara wore a starched white shirt under her tailored peach pants suit. Her hair was in an elegantly casual updo, showing off the sparkle of diamond studs in her earlobes. She was such a classy-looking lady, it was hard to believe she was also a kiler.\u003c/p\u003e\n\u003cp\u003eLana felt Caleb’s wide hand smooth over her back as if trying to comfort her. She straightened her shoulders and cleansed her expression of al emotion.\u003c/p\u003e\n\u003cp\u003e“Back so soon?” asked Phil, giving Caleb a scowl. “We didn’t expect to see you today.”\u003c/p\u003e\n\u003cp\u003e“I needed a break from planning the auction,” said Lana, praying her voice wouldn’t shake.\u003c/p\u003e\n\u003cp\u003e“I’ve heard. Anything we can do to help?” asked Kara in that elegantly rich voice of hers that made Lana’s skin crawl.\u003c/p\u003e\n\u003cp\u003e“No, thanks. It’s under control.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I heard. Is it true the hotel canceled?” asked Phil.\u003c/p\u003e\n\u003cp\u003eLana swalowed an ugly word. Bad news traveled too fast, even for a city the size of Columbia. “Yes, but we’l find another one.”\u003c/p\u003e\n\u003cp\u003eThe front door of the youth center opened and Lana’s sister, Jenny, stormed in, carrying her son, Taylor. Lana flinched and tried to cover it before anyone could see.\u003c/p\u003e\n\u003cp\u003eShe didn’t want Jenny or Taylor anywhere near Kara. She needed to get rid of them. Now.\u003c/p\u003e\n\u003cp\u003eLana felt panic bubbling up inside her as she tried to figure out the best way to protect her family.\u003c/p\u003e\n\u003cp\u003eFrom beside her, she heard Caleb say, “It’s under control.” His deep, calm voice brushed over her raw nerves, soothing them.\u003c/p\u003e\n\u003cp\u003eShe could do this. Al she had to do was act normal—like nothing was wrong. Kara didn’t even have to know who Jenny was. Hopefuly the family resemblance wouldn’t give them away as sisters.\u003c/p\u003e\n\u003cp\u003eJenny set down Taylor, who ran eagerly across the room on chubby legs toward Lana. She stepped away from the group and bent down to catch him in her arms, enjoying the solid weight of her two-year-old nephew.\u003c/p\u003e\n\u003cp\u003e“Kiss?” he asked, angling his cheek for the greeting he expected.\u003c/p\u003e\n\u003cp\u003eLana gave him a kiss and he squirmed in her arms, pushing against her so he could get down. Lana didn’t let him go.\u003c/p\u003e\n\u003cp\u003eJenny stomped up to Lana. Her dark hair was a mess, as if she’d been running her hands through it. Or possibly trying to pul it out.\u003c/p\u003e\n\u003cp\u003e“Do you have any idea how much you upset Mom?” Jenny demanded. “I’ve spent the past two days listening to her cry. You’re going to go home and apologize to her if I have to drag you there myself.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I realy am. I didn’t mean for you to be the one to deal with Mom.”\u003c/p\u003e\n\u003cp\u003e“You should have thought about that before you told her you didn’t need her.”\u003c/p\u003e\n\u003cp\u003eTaylor pushed hard against Lana’s neck in an effort to get down.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean for it to come out like that. I was worried about Stacie, and you know how she is in a crisis. I couldn’t deal with her, too.”\u003c/p\u003e\n\u003cp\u003eJenny rubbed her temples. “Damn it, Lana. You’ve got to be more careful with her.”\u003c/p\u003e\n\u003cp\u003e“Damn it, Lana,” mimicked Taylor as he tried to get out of her arms.\u003c/p\u003e\n\u003cp\u003eJenny’s face darkened and she let out a weary sigh. “Let him down. He’l be fine playing with the other kids for a minute.”\u003c/p\u003e\n\u003cp\u003e“I like holding him,” she countered.\u003c/p\u003e\n\u003cp\u003e“Yeah, wel, I don’t want him hearing what I have to say to you.” Jenny puled Taylor from Lana’s arms and set him on the floor. He toddled off toward the flurry of activity on the basketbal court.\u003c/p\u003e\n\u003cp\u003eLana shifted her body so she could keep a careful eye on him. Between him and those tempting basketbals roling around the floor were Caleb, Kara, and Phil, and Taylor was headed right toward them. Lana tensed. No way was Kara going near her baby nephew.\u003c/p\u003e\n\u003cp\u003eAnd if she did, Lana was going to . . . what? Scream at her? Attack her? The only way she could keep Taylor safe was to pretend that it didn’t matter.\u003c/p\u003e\n\u003cp\u003e“Are you listening to me?” demanded Jenny in a frustrated voice.\u003c/p\u003e\n\u003cp\u003eLana nodded her head vaguely. Taylor was headed straight for Kara.\u003c/p\u003e\n\u003cp\u003eKara saw her watching the boy and gave Lana a smile.\u003c/p\u003e\n\u003cp\u003eOh, God. She couldn’t do this.\u003c/p\u003e\n\u003cp\u003eShe didn’t have a choice.\u003c/p\u003e\n\u003cp\u003e“I said that I can’t keep cleaning up your messes with Mom,” continued Jenny. “I’ve got my own problems to deal with.”\u003c/p\u003e\n\u003cp\u003eKara took a step to the left and reached out her arms to little Taylor. Her eyes never left Lana’s.\u003c/p\u003e\n\u003cp\u003eIt was a test. Kara was testing her to see if she knew who Kara was. If Lana failed, Kara would know, and if Kara knew, Lana’s life and the lives of those she loved would be in jeopardy.\u003c/p\u003e\n\u003cp\u003eJenny shook Lana’s shoulder. “You’re not listening to a word I say, are you? What is it with you lately?”\u003c/p\u003e\n\u003cp\u003eKara lifted Taylor’s compact weight into her arms and cuddled him.\u003c/p\u003e\n\u003cp\u003eLana’s insides hardened and threatened to shatter. On the outside, she didn’t react, not by so much as a fluttering of an eyelash.\u003c/p\u003e\n\u003cp\u003eJenny’s voice rose a notch. “You don’t give a crap about the rest of the family after everything we did to help you. Mom was right. You are ungrateful.”\u003c/p\u003e\n\u003cp\u003eLana couldn’t have answered if her life depended on it. It took everything she had to keep herself from ripping Taylor out of Kara’s arms. Her whole body trembled as she fought the urge.\u003c/p\u003e\n\u003cp\u003eKara kissed Taylor’s offered cheek, leaving behind an ugly blotch of lipstick. Phil ruffled Taylor’s baby-fine hair.\u003c/p\u003e\n\u003cp\u003e“That’s it!” said Jenny. “I’m done trying to help. The next time Mom wants a tearfest, I’m sending her to your place.”\u003c/p\u003e\n\u003cp\u003eCaleb gave Lana an odd look, but she barely registered it. He reached over to Taylor and wiped the lipstick off his chubby cheek and smoothed his hair back in place.\u003c/p\u003e\n\u003cp\u003eTaylor’s arms shot up toward Caleb, and he puled Taylor from Kara’s arms.\u003c/p\u003e\n\u003cp\u003eLana had to lock her knees to keep from colapsing to the ground. She puled in a shaky breath and let it out slowly. Dizziness threatened to make her faint, but she managed to stay upright. “You should leave,” she told her sister.\u003c/p\u003e\n\u003cp\u003e“So now you’re sending me away like you did Mom? What the hel is wrong with you?”\u003c/p\u003e\n\u003cp\u003e“You should go on a vacation. A cruise. Take Mom and Dad. I’l pay.” She sounded desperate, but she couldn’t help it.\u003c/p\u003e\n\u003cp\u003eJenny’s anger dissolved into a concerned frown. “You don’t have the money for that.”\u003c/p\u003e\n\u003cp\u003e“I’l find it somewhere. Take out a loan.”\u003c/p\u003e\n\u003cp\u003eCaleb set Taylor down and led him by the hand to the edge of the basketbal court. He found an unused bal and handed it to the toddler.\u003c/p\u003e\n\u003cp\u003eTaylor wrapped his arms around it and grinned up at Caleb.\u003c/p\u003e\n\u003cp\u003e“You’l take out a loan on what?” asked Jenny. “You don’t own anything. I bet you haven’t even paid off the Saturn yet.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it. Just go. Set it up and tel me how much it costs. I’l find a way to pay for it.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I’ve been horrible to al of you, and I want to make it up to you.”\u003c/p\u003e\n\u003cp\u003eJenny tilted her head. “You’re lying. Why do you want us al gone? Is there something wrong with you?”\u003c/p\u003e\n\u003cp\u003e“No,” she lied. “I’m just dealing with a lot of stress with the fundraiser coming up, and as much as I love you al, it would be nice to have a little space.”\u003c/p\u003e\n\u003cp\u003eKara gave Lana one last perusing stare before she went to where some of the younger kids were coloring. Phil was right on her heels, and Caleb was splitting his attention between Taylor and Lana.\u003c/p\u003e\n\u003cp\u003e“So, you want me to take Mom and Dad and spend a week trapped on a boat with them? I can see how much you love me. Besides, Dad would never leave his roses for that long. You’re just going to have to suffer. You’re stuck with us, sis.”\u003c/p\u003e\n\u003cp\u003e“Then please do what you can to keep them out of my hair for a couple weeks. Please? I need some space. Just until the fundraiser is over.”\u003c/p\u003e\n\u003cp\u003eJenny’s jaw tightened, but she nodded. “You owe me big-time. Once you get back on your feet, I’m going to take you up on that offer to pay for a cruise, only I’m going with Todd. Alone. You’re babysitting—both Taylor and Mom.”\u003c/p\u003e\n\u003cp\u003e“Deal,” said Lana.\u003c/p\u003e\n\u003cp\u003eJenny motioned toward Caleb. “Is he the guy Mom told me about?”\u003c/p\u003e\n\u003cp\u003eLana stifled a groan. “She’s probably already writing the wedding invitations in her head.” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-22.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
