{"id":70433,"no":25,"title":"Page 25","content":"\u003cp\u003eShe was making sobbing sounds of anguish now, and they ripped at his guts. How could he have let this happen to her? Why hadn’t he found a way to protect her?\u003c/p\u003e\n\u003cp\u003eNo new answers came to the old questions, just a familiar aching regret that he hadn’t done more to prevent her pain.\u003c/p\u003e\n\u003cp\u003eHer sobbing halted, and he felt her wake up more fuly, felt her pul a heavy cloak of detachment around her. She was drawing away from him, and he’d be damned if he let it happen again. He didn’t know how to get through to her, but he knew what he wanted to do, what he’d been craving since the moment he laid eyes on her again.\u003c/p\u003e\n\u003cp\u003eWith a touch more gentle than he felt, he wiped away a wet trail of tears from her temple. She was awake now, closing herself off more with every passing second.\u003c/p\u003e\n\u003cp\u003e“Don’t,” he whispered, his throat tight. “Don’t pul away from me.”\u003c/p\u003e\n\u003cp\u003eShe knew what he meant. He saw the knowledge flash in her eyes. An ocean of blue brightened with understanding. “You shouldn’t be here.”\u003c/p\u003e\n\u003cp\u003e“You need me.”\u003c/p\u003e\n\u003cp\u003e“No. I—”\u003c/p\u003e\n\u003cp\u003eHe pressed a finger to her mouth to quiet her. “You need me. There’s no shame in needing someone else.”\u003c/p\u003e\n\u003cp\u003e“It’s easy for a man like you to say. You don’t need anyone.”\u003c/p\u003e\n\u003cp\u003eGrant pounded on the door. “You okay in there?”\u003c/p\u003e\n\u003cp\u003e“Go away!” growled Caleb.\u003c/p\u003e\n\u003cp\u003e“Those didn’t sound like fun screams. She okay?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Lana in a breathless voice. Then again, louder. “Yes. I’m fine.”\u003c/p\u003e\n\u003cp\u003e“I’l just be, uh, outside, then. Sorry.”\u003c/p\u003e\n\u003cp\u003eGrant’s footsteps faded.\u003c/p\u003e\n\u003cp\u003e“If I don’t need anyone, then why is Grant outside watching your apartment? Why is another man watching your office and another guarding Stacie?”\u003c/p\u003e\n\u003cp\u003eShe tried to turn away, but Caleb held her chin and made her look at him.\u003c/p\u003e\n\u003cp\u003e“They’re out there because I can’t protect you on my own. I need their help, just like you need mine. Let me help you. Tel me why you’re so afraid.”\u003c/p\u003e\n\u003cp\u003e“I’m not.”\u003c/p\u003e\n\u003cp\u003e“Liar.”\u003c/p\u003e\n\u003cp\u003eLana’s eyes slid shut. “I can’t. Just let it go.”\u003c/p\u003e\n\u003cp\u003e“I wish I could, but I can’t. Not anymore. I’m not going to let you destroy yourself like this.”\u003c/p\u003e\n\u003cp\u003e“It isn’t your choice.”\u003c/p\u003e\n\u003cp\u003eCaleb muttered a caustic curse under his breath. She was right. If she wanted to ruin her life and keep her secret, there wasn’t much he could do to stop her.\u003c/p\u003e\n\u003cp\u003eCaleb started to move off of the bed. Lana’s hand stopped him. Her fingers wrapped around his wrist, pale against his tan skin. She hadn’t reached out for him since the incident in the shower, and Caleb hadn’t realized how much he’d been craving for her to do just that.\u003c/p\u003e\n\u003cp\u003eHe stared at her hand, unable to take his eyes off her slender fingers.\u003c/p\u003e\n\u003cp\u003e“Wil you stay?” she asked. “Just for a while? The dreams . . . they’re easier when you hold me.”\u003c/p\u003e\n\u003cp\u003eCaleb’s heart filed up with a bittersweet mix of joy that she wanted him to hold her and guilt that she needed him to. He pushed the guilt aside and focused on the joy. He didn’t want her accidentaly reading anything into his actions that would make her think he didn’t want to be right here.\u003c/p\u003e\n\u003cp\u003eHe scooted his body against hers and wrapped his arm over her waist. She snuggled with her back against his front and closed her eyes. His body hummed in delight, happy to be horizontal with the woman he wanted, nagging him to get naked and horizontal. He ignored his desire for her as much as any man could, hoping she’d fal asleep before she’d figure out just how much he wanted her. Another inch closer and his traitorous body would give him away in a big way.\u003c/p\u003e\n\u003cp\u003eThe god of sleeping pils was on his side, and she fel back to sleep in a few minutes. For Caleb, sleep came much, much later.\u003c/p\u003e\n\u003cp\u003eCaleb remembered hearing on a TV ad that if you had an erection that lasted longer than four hours, it was a bad thing. Of course, that was after having taken some medication. He wasn’t sure what it meant for a man who didn’t do anything stronger than aspirin.\u003c/p\u003e\n\u003cp\u003eJust the act of taking a shower had him hard. Al he could think about was how Lana had sounded when he pressed her against the tile wal, or how she’d tasted when her demanding little tongue had swept into his mouth. It was enough to make a sane man mad.\u003c/p\u003e\n\u003cp\u003eHe finished in the shower, ending with a cold blast that had him shivering but did little for the lust prowling through his system. Sleeping next to Lana al night had been hard enough, so to speak, but waking up with his hands on her bare stomach and her fingers curled just inside the waistband of his jeans was sheer torture. Not that it had affected her one bit.\u003c/p\u003e\n\u003cp\u003eShe was stil sleeping peacefuly and would stay that way as long as he had anything to say about it. He’d unplugged her clock and covered her up to her neck before leaving her room. Had things been different between them, he’d have woken her with just his tongue, but that was material best left stored in the back of his mind. His imagination was way too vivid when it came to Lana. He could almost imagine what she’d look like al stretched out and naked beneath him. Her breasts were smal, but her nipples stood at attention every time he touched her. Her hips were slim under her jeans, but she had womanly curves that would fit his hands perfectly. She was smooth everywhere he touched, and he already knew the unique taste of her skin, her unique scent. Woman and honeysuckle and miracles.\u003c/p\u003e\n\u003cp\u003eIt was almost enough to make a cynical man believe. Almost.\u003c/p\u003e\n\u003cp\u003eCaleb dried himself off with a rough brush of a towel. He should have just taken matters into his own hand and come out of the shower with a smile, but he knew that a simple session with his fist wasn’t going to do the trick. He wanted Lana. Hot and wet and naked. Nothing else would even come close to scratching his itch.\u003c/p\u003e\n\u003cp\u003eWhen he came out of the bathroom, Grant was waiting with coffee and donuts. “Have I ever told you you’re my hero?” asked Caleb as he puled a double chocolate out of the box.\u003c/p\u003e\n\u003cp\u003e“Get in line. Ladies first.”\u003c/p\u003e\n\u003cp\u003eCaleb shook his head and took a sip of coffee strong enough to make his chest sprout new hair. Perfect. “You can’t have her,” said Caleb, only half joking.\u003c/p\u003e\n\u003cp\u003e“I know. Between you and David, the world is losing al the good women.”\u003c/p\u003e\n\u003cp\u003e“There are only two of us, and Lana isn’t exactly my woman.” The word yet seemed to float between them, unspoken but understood.\u003c/p\u003e\n\u003cp\u003e“You slept with her.”\u003c/p\u003e\n\u003cp\u003e“Fuly clothed.”\u003c/p\u003e\n\u003cp\u003e“Harsh,” said Grant with a sympathetic wince.\u003c/p\u003e\n\u003cp\u003e“You have no idea. Gives new meaning to the term hardship post. ”\u003c/p\u003e\n\u003cp\u003eCaleb finished off the donut and went for a second. Grant had brought a whole dozen. What a guy.\u003c/p\u003e\n\u003cp\u003e“Is she stil asleep?” asked Grant.\u003c/p\u003e\n\u003cp\u003e“Yeah. Hopefuly she wil be for a while.”\u003c/p\u003e\n\u003cp\u003e“Good. There’s something I didn’t want to tel you in front of her last night. Her car was sabotaged. The brakes had been tampered with.”\u003c/p\u003e\n\u003cp\u003e“Shit. When did that happen? I thought you were watching her car.”\u003c/p\u003e\n\u003cp\u003e“We were. When was the last time she drove it?”\u003c/p\u003e\n\u003cp\u003e“The morning Stacie was shot.”\u003c/p\u003e\n\u003cp\u003eGrant shrugged. “Could have happened any time between then and when we arrived. It wasn’t a professional job, though. I mean, brakes going out on the highway is one thing, but here in the city, the chances of her getting kiled in an accident aren’t very high.”\u003c/p\u003e\n\u003cp\u003e“No, but it sure would scare the hel out of her.”\u003c/p\u003e\n\u003cp\u003e“You think someone’s toying with her?” asked Grant.\u003c/p\u003e\n\u003cp\u003e“I don’t know. Maybe. She’s not exactly forthcoming.”\u003c/p\u003e\n\u003cp\u003e“Maybe this wil help. There’s something I want to show you,” said Grant. He flipped open his laptop and puled up a diagram of Lana’s apartment. It was a 3-D model complete with furniture. Several red and blue dots glowed in various locations, along with dotted lines fanning out from each. Caleb had seen diagrams like this before. It showed the location of every bug they found in Lana’s apartment and the estimated area each had covered.\u003c/p\u003e\n\u003cp\u003eCaleb studied the image, frowning. “Is red video or audio?” he asked.\u003c/p\u003e\n\u003cp\u003e“Video. See anything odd?”\u003c/p\u003e\n\u003cp\u003e“Hel, yes.” For some reason, her bookshelves were covered by two separate video cameras. Those cameras wouldn’t have picked up anything more than a passing glance at someone walking by, so why were they there?\u003c/p\u003e\n\u003cp\u003eCaleb went to the bookcase, looking for the reason behind the unusual setup.\u003c/p\u003e\n\u003cp\u003e“If you find anything let me know,” said Grant. “I looked for over an hour, took out every book and leafed through it just in case one had a hidden pocket. I found nothing.\u003c/p\u003e\n\u003cp\u003eWhatever those cameras were trying to catch, it beats me.”\u003c/p\u003e\n\u003cp\u003e“Maybe Lana would know.” Something in the back of Caleb’s mind nagged at him.\u003c/p\u003e\n\u003cp\u003e“And wil she also share?”\u003c/p\u003e\n\u003cp\u003eCaleb sank down onto the couch and took a slug of hot, thick coffee. He didn’t even bother to respond to Grant’s question. They both knew the answer.\u003c/p\u003e\n\u003cp\u003e“Anything else I should know?” asked Caleb.\u003c/p\u003e\n\u003cp\u003e“It was al pretty standard equipment, al up-to-date with no serial numbers to trace. No fingerprints. Everything we found is available in the States.”\u003c/p\u003e\n\u003cp\u003e“What about the shower? Was it bugged?”\u003c/p\u003e\n\u003cp\u003eGrant raised a golden brow. “Why? Want some footage?”\u003c/p\u003e\n\u003cp\u003e“Don’t be an ass.”\u003c/p\u003e\n\u003cp\u003e“Sorry. Hard habit to break,” said Grant with an unapologetic grin. “No, the shower was clean, though there was audio hidden under the sink.”\u003c/p\u003e\n\u003cp\u003eCaleb let out a relieved breath.\u003c/p\u003e\n\u003cp\u003e“Why? Got something to hide? A little monkey-spank going on, maybe?”\u003c/p\u003e\n\u003cp\u003eCaleb just roled his eyes and reached for a third donut.\u003c/p\u003e\n\u003cp\u003eGrant stared at Caleb for a moment, his grin growing wider until it bloomed into a knowing smile. “You got her in there, didn’t you? You had our pretty little lady in the shower and you didn’t want anyone to see.”\u003c/p\u003e\n\u003cp\u003e“Fuck off, Kent.”\u003c/p\u003e\n\u003cp\u003eGrant let out a deep laugh. “I’m right. You sly devil you, and here I thought this thing you had for her was al one-sided. I should have known better.”\u003c/p\u003e\n\u003cp\u003e“Mind your own business.”\u003c/p\u003e\n\u003cp\u003e“My friend, your love life is my business.”\u003c/p\u003e\n\u003cp\u003e“How, even in the most deranged minds like yours, could you think that was true?”\u003c/p\u003e\n\u003cp\u003e“Because I need you and David out of the way, al happily settled down, so that I can have my turn. David’s done his part, now it’s up to you.”\u003c/p\u003e\n\u003cp\u003e“What the hel are you talking about?” asked Caleb, totaly confused.\u003c/p\u003e\n\u003cp\u003eGrant closed the file on his laptop and shut the screen. “I have this theory that since I was the third man to join the team, I’l be the third one to leave. After you and David.\u003c/p\u003e\n\u003cp\u003eIf you don’t get al domestic and have the little wifey-poo convince you to quit, I’l never get out.”\u003c/p\u003e\n\u003cp\u003eCaleb stared at Grant, struggling not to let his brains spil out his ears from trying to understand such convoluted logic. “How long have you had this theory?”\u003c/p\u003e\n\u003cp\u003e“A couple years before David left. The first time he left, I mean.”\u003c/p\u003e\n\u003cp\u003e“And you’ve been waiting al this time for us to settle down in suburbia somewhere so you could, too?” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-25.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
