{"id":70434,"no":26,"title":"Page 26","content":"\u003cp\u003e“Yep. Something like that. That job David offered me is looking pretty good. Nice cushy work here at home. No more dragging my ass halfway around the world for months on end.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you just quit if you want out?”\u003c/p\u003e\n\u003cp\u003eGrant shrugged. “I can’t leave you without someone to cover your hairy ass, so hurry up and nail you a woman already.”\u003c/p\u003e\n\u003cp\u003eCaleb gave Grant a steady look. “You know there’s not enough therapy or antipsychotics in the world to fix what’s wrong with you.”\u003c/p\u003e\n\u003cp\u003eGrant waggled his eyebrows. “But the ladies love it.”\u003c/p\u003e\n\u003cp\u003e“Lord help them.”\u003c/p\u003e\n\u003cp\u003eThey sat in companionable silence for a while, and that nagging feeling in Caleb’s head wasn’t going away. “Pul up that diagram again, would you?”\u003c/p\u003e\n\u003cp\u003eGrant did and handed Caleb the laptop. Caleb stared at the screen, letting his eyes wander, trying to see a pattern. Nothing stood out, but he kept looking at the bookshelves again. Something wasn’t right.\u003c/p\u003e\n\u003cp\u003eThen he remembered. That night he’d rushed her into the shower, he’d seen footage of someone looking through one of her books.\u003c/p\u003e\n\u003cp\u003eCaleb went to his duffel, took out his own laptop, and puled up the surveilance footage. He saw Grant’s shadow hovering over his shoulder as they watched the intruder come in, replace a bug and pick a single book off the shelf.\u003c/p\u003e\n\u003cp\u003e“Can you tel which one it was?” asked Grant.\u003c/p\u003e\n\u003cp\u003eCaleb squinted at the screen. “No.” He zoomed in on the area, but the image was stil fuzzy. The only thing he could make out was that the book had a spiral binding.\u003c/p\u003e\n\u003cp\u003eGrant had seen it too and went to the same shelf, running his fingers over the spines, puling out three of the books on the shelf. “They’re al sketchbooks,” he said, handing one to Caleb.\u003c/p\u003e\n\u003cp\u003e“Why would someone be interested in her sketchbooks? I already checked for hidden compartments.”\u003c/p\u003e\n\u003cp\u003eThere was no obvious answer, and Caleb leafed through the book, looking at sketch after sketch. Lana’s skil was impressive. Whether she drew people or animals or landscapes, they were al detailed and lifelike.\u003c/p\u003e\n\u003cp\u003e“Is your book ful?” asked Grant.\u003c/p\u003e\n\u003cp\u003eCaleb flipped to the end. “Yeah. Yours?”\u003c/p\u003e\n\u003cp\u003e“The first one is, but check this out,” said Grant. “The second one is only half ful, and the last sketch is dated December before last.”\u003c/p\u003e\n\u003cp\u003eRight before she’d left for Armenia.\u003c/p\u003e\n\u003cp\u003eCaleb tried to compare the book to the one in the surveilance footage, but he couldn’t tel if it was the same one or not.\u003c/p\u003e\n\u003cp\u003e“Maybe she kept something hidden in the book?”\u003c/p\u003e\n\u003cp\u003eCaleb felt a cold feeling of dread rol around in his gut. Lana’s hand had shaken when she’d tried to draw a puppy. She hadn’t put a new sketch in that book since before her kidnapping. Al the cameras in her apartment were aimed in such a way that they’d catch the image of anything she drew, whether sitting at her desk or on her couch or on her bed.\u003c/p\u003e\n\u003cp\u003eWhoever was watching her wanted to know what she drew, and he could only think of one reason why. “Whoever is doing this thinks Lana saw something in Armenia, and they want to know if she puts it down on paper.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about? She was hooded. What could she possibly have seen? And if she did see something, why haven’t they just kiled her?”\u003c/p\u003e\n\u003cp\u003eCaleb wasn’t sure how much Grant had been told. They’d been briefed on the op separately, and Grant hadn’t been there in Armenia. Caleb had been working alone until the very end. “What do you know about Lana’s background?”\u003c/p\u003e\n\u003cp\u003e“Just that she was the only surviving member of a group of hostages taken by a group of loonies trying to get into the Swarm. Her file says she was banged up pretty bad.”\u003c/p\u003e\n\u003cp\u003e“Banged up” didn’t even come close to what Lana had endured, and Caleb had to bite back a hostile criticism of Grant’s casual attitude. Grant had no way of knowing what she’d gone through.\u003c/p\u003e\n\u003cp\u003eGrant continued, “A team went in and extracted her, taking down a smal group of Swarm wannabes in the process.”\u003c/p\u003e\n\u003cp\u003eCaleb’s hands tightened into fists. “There’s a lot more to it than that.”\u003c/p\u003e\n\u003cp\u003eGrant’s golden eyes widened with understanding. “You were there.”\u003c/p\u003e\n\u003cp\u003eCaleb nodded, unable to speak past the clump of bitterness lodged in his throat.\u003c/p\u003e\n\u003cp\u003e“That was the op you did solo, wasn’t it? The one you came back from al fucked up?”\u003c/p\u003e\n\u003cp\u003eCaleb stood and turned his back. No way was he going to talk about this with Grant. He couldn’t stand to even think about it.\u003c/p\u003e\n\u003cp\u003e“I can’t help if you don’t tel me what happened. If she did see something, then it’s going to take more than two of us to keep her safe. You know anyone wiling to take innocent civilians as hostages and kil them won’t stop until she’s dead, too.”\u003c/p\u003e\n\u003cp\u003eCaleb felt like pounding a hole in the wal, like tearing the couch apart with his bare hands. He needed to vent some of this frustration before he did something stupid. “I can’t tel you what I don’t know. She doesn’t trust me, and I don’t blame her. She was an easy target before I showed up, but they didn’t kil her. They must want something from her—something she can’t give them if she’s dead.”\u003c/p\u003e\n\u003cp\u003e“Could it be a rival terrorist group—an enemy of the Swarm?”\u003c/p\u003e\n\u003cp\u003e“As far as we know, the Swarm is gone. At least, they haven’t claimed credit for anything since that op we went on six months ago.”\u003c/p\u003e\n\u003cp\u003eGrant gave Caleb a feral grin. “That was fun, wasn’t it?”\u003c/p\u003e\n\u003cp\u003eSatisfying maybe, but not fun. “Let’s assume the Swarm isn’t gone and they could have something to do with this. She was hooded and kept in a separate cave from those running the show. What could she possibly have seen?”\u003c/p\u003e\n\u003cp\u003e“Maybe the hood slipped off and she got a peek at plans or blueprints?”\u003c/p\u003e\n\u003cp\u003e“Or people?” added Caleb. “She could have seen one of them before they managed to get the hood on.”\u003c/p\u003e\n\u003cp\u003e“Maybe she doesn’t even know she saw them. She could have had breakfast in the hotel before she was taken. Could have been sitting next to one of them and never known it.”\u003c/p\u003e\n\u003cp\u003eCaleb shook his head. “We thought we got them al, but those caves were extensive. Someone could have slipped through one of the tunnels.”\u003c/p\u003e\n\u003cp\u003e“Maybe it wasn’t someone who was actualy there, but someone associated with them. They could think she knows something even if she doesn’t, which would match her story.”\u003c/p\u003e\n\u003cp\u003eExcept for the fact that Caleb knew she was hiding something. “The bottom line is that it realy doesn’t matter who is after her, or whether or not the Swarm is stil operating quietly. What matters is stopping them—keeping her safe until she trusts us enough to cooperate.”\u003c/p\u003e\n\u003cp\u003e“Any clues when that wil be?”\u003c/p\u003e\n\u003cp\u003e“She doesn’t have a lot of reason to be trusting.”\u003c/p\u003e\n\u003cp\u003e“You may be as patient as God, but Monroe isn’t. He’s going to want results so we can move on. We have a lot of men tied up on this thing right now.”\u003c/p\u003e\n\u003cp\u003e“I don’t care what Monroe wants. I nearly got her kiled once already. I can’t let anything happen to her this time.”\u003c/p\u003e\n\u003cp\u003e“Got her kiled? I thought you were the one who brought her out alive,” said Grant.\u003c/p\u003e\n\u003cp\u003e“Yeah, right after I watched them beat her.”\u003c/p\u003e\n\u003cp\u003eGrant’s body stiled. “You did what?”\u003c/p\u003e\n\u003cp\u003eCaleb’s stomach knotted at the memory. He didn’t want to tel Grant what he’d done, but if there was even a slim chance that the knowledge could help Lana, he owed it to her to suck it up and tel Grant his shame.\u003c/p\u003e\n\u003cp\u003eCaleb’s voice was low, and he couldn’t look Grant in the eye as he told him. “I watched a man beat her. I stood there and let it happen. I heard every one of her screams.\u003c/p\u003e\n\u003cp\u003eEvery one of her bones break. I was right there the whole time and I couldn’t do a damn thing.”\u003c/p\u003e\n\u003cp\u003e“God, Caleb. Why?”\u003c/p\u003e\n\u003cp\u003eHe’d asked himself the same thing a thousand times, and al he could come up with was the same pitiful answer. “I was undercover. The Swarm had bombed a school bus the week before, kiling three kids and wounding ten more. Their next target was a school. We had to find out which one, so I went in posing as a demolitions expert for hire.\u003c/p\u003e\n\u003cp\u003eOne of our teams had taken out the real Miles Gentry, and I took his place.”\u003c/p\u003e\n\u003cp\u003e“And the real Miles Gentry wouldn’t have given a shit if they’d beaten a woman to death, since he was wiling to blow up a whole fucking school,” guessed Grant. His mouth flattened, and Caleb saw something like pity pass through his expression. He hid it quickly, but Caleb saw it anyway, and it made him want to crawl in a dark hole and never come out.\u003c/p\u003e\n\u003cp\u003e“I should have done something. Kiled them al before they hurt her.”\u003c/p\u003e\n\u003cp\u003e“They would have taken you down before you’d had time, and then what would have happened to al those kids? Where would they be?”\u003c/p\u003e\n\u003cp\u003e“I know. I try to remind myself about that part, but it doesn’t make it any easier.”\u003c/p\u003e\n\u003cp\u003e“But you saved her. That’s what matters.”\u003c/p\u003e\n\u003cp\u003e“I thought I’d saved her, but I didn’t. These nightmares she has, Grant . . .” He swalowed past the anger that burned his throat. “She relives it every night. I kept her from being kiled, but I didn’t save her.”\u003c/p\u003e\n\u003cp\u003e“You can now. We can find these bastards and take them down. Make sure she knows she’s safe. Maybe then her nightmares wil go away.”\u003c/p\u003e\n\u003cp\u003e“Whatever I do now it wil never make up for what I had to do then.”\u003c/p\u003e\n\u003cp\u003e“Does she know why you couldn’t act?”\u003c/p\u003e\n\u003cp\u003eCaleb nodded. “Monroe told Lana.”\u003c/p\u003e\n\u003cp\u003e“Monroe told me what?” Lana asked as she walked out of the bedroom. She was wearing that giant, droopy robe over her short pajamas. Surgical scars crisscrossed her legs, reminding Caleb of just how much she’d suffered in her struggle to walk again. Her hair was a mess, her eyes were stil puffy from sleep, and she had the imprint of her wrinkled sheet on one cheek, but she gave him a warm smile.\u003c/p\u003e\n\u003cp\u003eCaleb’s heart clenched at the sight of her. Al this talk had brought back vivid memories of her broken body and battered face. Seeing her whole and alive made him ache to pul her into his arms and beg for forgiveness.\u003c/p\u003e\n\u003cp\u003eInstead, he waved toward the box of donuts. “Grant brought breakfast.”\u003c/p\u003e\n\u003cp\u003eLana’s blue eyes narrowed at the distraction, but she let it drop. “Save me a couple. I’l be out in a few minutes.”\u003c/p\u003e\n\u003cp\u003eThe bathroom door closed behind her, and Caleb heard the water run. His body tightened at the thought of her naked and wet in there, and he wished he could join her.\u003c/p\u003e\n\u003cp\u003eThe muscles in his legs were jerking as if they were trying to convince his brain to let him folow her into the shower. He ignored them.\u003c/p\u003e\n\u003cp\u003e“It doesn’t look like she hates you to me,” observed Grant.\u003c/p\u003e\n\u003cp\u003e“She should. For a while, she did.”\u003c/p\u003e\n\u003cp\u003e“But not anymore?”\u003c/p\u003e\n\u003cp\u003e“Not anymore,” agreed Caleb.\u003c/p\u003e\n\u003cp\u003e“It’s a start,” said Grant.\u003c/p\u003e\n\u003cp\u003e“It’s not enough. If I can’t make her feel safe, she’l suffer for the rest of her life.”\u003c/p\u003e\n\u003cp\u003e“You can’t make anyone feel safe. Al you can do is give her the tools to take care of herself. If this was one of your brothers or your sister, what would you do?” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-26.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
