{"id":70448,"no":40,"title":"Page 40","content":"\u003cp\u003eBut he couldn’t do any of those things. Al he could do was let her walk away and pray that someday she’d find a man she could love—a man she could trust.\u003c/p\u003e\n\u003cp\u003eCaleb didn’t love her. Lana kept teling herself that over and over as she hid in the bathroom stal, trying not to cry.\u003c/p\u003e\n\u003cp\u003eHe was just infatuated. It was just the sex talking. Or the adrenaline rush. It was just pilow talk that al men gave women to keep them interested in sex.\u003c/p\u003e\n\u003cp\u003eIt had to be, because the possibility of anything else was just too frightening.\u003c/p\u003e\n\u003cp\u003eCaleb didn’t love her. He felt guilty over being powerless to protect her in Armenia. He felt protective of her now because it was his job. He was just confused.\u003c/p\u003e\n\u003cp\u003eIt would pass. He’d realize he was wrong, and things would be fine again. No harm, no foul.\u003c/p\u003e\n\u003cp\u003eYeah, right.\u003c/p\u003e\n\u003cp\u003eLana knew the damage was already done. He’d said the words, and they couldn’t be taken back. He couldn’t unring the bel.\u003c/p\u003e\n\u003cp\u003e“Damn it!” she cursed at the stainless-steel door. This couldn’t be happening. How was she going to protect herself from al the feelings his confession of love gave her?\u003c/p\u003e\n\u003cp\u003eHow was she going to resist letting herself daydream about happily ever after when reality was so freaking bleak?\u003c/p\u003e\n\u003cp\u003eAs long as he didn’t love her, there was no way she’d let herself love him back. She’d protect her heart, keeping it safely locked up in the cage that pain of loss and rejection had constructed. Nothing could get to her as long as she protected her heart. She wouldn’t be vulnerable. She’d be safe. She’d be in control.\u003c/p\u003e\n\u003cp\u003eShe had to keep hold of what little control she had left in her life, protect it ferociously. She couldn’t let Caleb, or any man, barge into her life and force her to feel things she wasn’t strong enough to feel. Like love.\u003c/p\u003e\n\u003cp\u003eAs long as he didn’t love her, she didn’t have to fear loving him back. At least, that’s what she kept teling herself.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eD id you do what I told you?” asked the modulated voice of Denny’s boss.\u003c/p\u003e\n\u003cp\u003eDenny wiped the acid taste from his mouth and prayed he wouldn’t puke again. “Yeah,” he said in a voice made rough from retching into the toilet for the past twenty minutes. The combination of too much alcohol and his boss’s bizarre instructions had turned his stomach inside out.\u003c/p\u003e\n\u003cp\u003eHe stil couldn’t get the sloppy crayon drawings out of his head. Flowers and dogs and race cars, al scribbled in with garish colors. The building he’d broken into—First Light Foundation—was plastered with them, along with gloppy paintings that made no sense and crooked clay sculptures formed by clumsy little hands.\u003c/p\u003e\n\u003cp\u003e“Good boy. Now there’s only one more thing I need you to do.”\u003c/p\u003e\n\u003cp\u003eA sickening wave roled over him, and he swalowed hard to keep from throwing up again. He was sweating and shaking and could barely hold the phone to his ear.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eThe voice gave a metalic laugh. “Nothing so dramatic as you’re thinking. I just need you to go pick up your last payment.”\u003c/p\u003e\n\u003cp\u003eDenny sat silent, waiting to hear the catch. The money his boss offered him was enough to pay off Bruce, which meant he’d have no hold on Denny any longer. With the threat of broken legs gone, there was nothing that freaky robot could do to convince Denny to keep working for him. “Where?”\u003c/p\u003e\n\u003cp\u003e“Meg’s Diner. Be there in five minutes.”\u003c/p\u003e\n\u003cp\u003e“But that’s a fifteen-minute drive!”\u003c/p\u003e\n\u003cp\u003e“I suggest you get moving, then. If you’re late, the money wil no doubt be found by someone else.”\u003c/p\u003e\n\u003cp\u003eShit! Denny ignored his twisting stomach, grabbed his keys and flew out the door. He ran six stoplights getting there, but he made it in time. The money was sitting in a little paper sack behind the toilet. Denny opened it with trembling hands and counted the money. It was al there. His nightmare was over. Bruce would be paid off, he’d never work for Mr. Robot again, and he was going to pick up and move the hel out of this place—so far away no one could find him.\u003c/p\u003e\n\u003cp\u003eCaleb sat down on the grass next to Grant. The evening air was stil hot, but at least the sun was no longer overhead.\u003c/p\u003e\n\u003cp\u003e“Any word on the sniper?” asked Caleb.\u003c/p\u003e\n\u003cp\u003eGrant swalowed a bite of one of the sandwiches that the foundation’s cook, Sharon, had provided to al the workers who had stayed to finish setting up for tomorrow.\u003c/p\u003e\n\u003cp\u003eThere was stil plenty to be done before nightfal, but they were on schedule. “CIA’s working on him. They either haven’t gotten him to talk yet or they’re not sharing.”\u003c/p\u003e\n\u003cp\u003e“Gee. That’s helpful.”\u003c/p\u003e\n\u003cp\u003eGrant shrugged. “The job is the same either way. Keep her safe.”\u003c/p\u003e\n\u003cp\u003e“Nice and simple,” said Caleb with more sarcasm than he’d intended.\u003c/p\u003e\n\u003cp\u003e“Where is she?”\u003c/p\u003e\n\u003cp\u003e“Inside. Avoiding me. Jack’s with her. Everyone is on high alert.”\u003c/p\u003e\n\u003cp\u003e“Which is why I’m surprised you’re not at her side.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to make her cry again.” God, he sounded pitiful.\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eCaleb hesitated. He wasn’t one to talk about things like this, but if anyone knew what was going through a woman’s head, it would be Grant.\u003c/p\u003e\n\u003cp\u003e“What does it mean when you tel a woman you love her and she acts like you just threatened to murder her kitten?” Caleb asked Grant, trying to sound more casual than he felt. Inside, he was twisting with a mixture of anger and regret that he couldn’t shake.\u003c/p\u003e\n\u003cp\u003eGrant raised an amused brow. “Are you sure you didn’t accidentaly say you have herpes?”\u003c/p\u003e\n\u003cp\u003eCaleb roled his eyes at the lame joke. “Pretty sure.”\u003c/p\u003e\n\u003cp\u003eThis time Grant was completely serious, not even a glimmer of amusement in his golden eyes. “She’s not ready for that kind of pressure, man.”\u003c/p\u003e\n\u003cp\u003e“What pressure? It’s supposed to be a good thing.”\u003c/p\u003e\n\u003cp\u003e“Maybe to a woman who hasn’t had her life turned upside down, but not for Lana. The woman’s been through hel, and she’s not out yet. She’s too scared to even tel you what she’s scared of, she’s got this fundraiser riding her ass, her friend was shot, her parents’ house burned down, a sniper on the roof, and you go dumping confessions of love on top of that pile. How do you expect her to react?”\u003c/p\u003e\n\u003cp\u003e“Something other than that look of horror would have been nice,” said Caleb. Truth was, he hadn’t realy thought about it like that. He felt it, so he said it. Simple. Stupid, but simple.\u003c/p\u003e\n\u003cp\u003eHe should have kept his feelings to himself, but it was a little late for that.\u003c/p\u003e\n\u003cp\u003eCaleb fisted his hand, watching the broken flesh over his knuckles stretch.\u003c/p\u003e\n\u003cp\u003e“She’l come around. Back off on the Romeo routine and let her get through this thing tomorrow. Once that’s over, maybe she’l have the space to process what you said.\u003c/p\u003e\n\u003cp\u003eMaybe she’l even say the words back.”\u003c/p\u003e\n\u003cp\u003eCaleb grunted his skepticism. “Not in this lifetime. Besides, my time here is almost up. Monroe is reassigning someone else to the case if I can’t get her to talk by tomorrow.”\u003c/p\u003e\n\u003cp\u003eGrant’s face wrinkled in a pained expression. “That’s harsh. Any idea who he’s going to replace you with?”\u003c/p\u003e\n\u003cp\u003e“Why? You looking for a broken face?”\u003c/p\u003e\n\u003cp\u003eGrant laughed and held up his hands. “No warning needed, man. I just thought that you might appreciate knowing that the next man won’t be putting the moves on her.”\u003c/p\u003e\n\u003cp\u003e“Like you wouldn’t. When have you ever been able to keep your dick in your pants?”\u003c/p\u003e\n\u003cp\u003e“Have patience. I’m learning a new skil. Besides, Celia is rough on a man. Woman made me sore.”\u003c/p\u003e\n\u003cp\u003e“I do not want to know how that happened.”\u003c/p\u003e\n\u003cp\u003e“Like I’d ever kiss and tel.”\u003c/p\u003e\n\u003cp\u003eCaleb laughed, considering how Grant loved to awe the team with the stories of his female conquests. “You stil seeing her?”\u003c/p\u003e\n\u003cp\u003eGrant shrugged. “While I’m here. When there’s time. It’s nothing serious.”\u003c/p\u003e\n\u003cp\u003e“You make that sound like it’s a bad thing. I thought you were al about no serious relationships.”\u003c/p\u003e\n\u003cp\u003e“Never mind,” said Grant, waving it off. “Just hurry up and get this thing with Lana straightened out, wil you? A man can only wait so long for his turn.”\u003c/p\u003e\n\u003cp\u003e“Your turn at what?”\u003c/p\u003e\n\u003cp\u003e“Love, my friend,” said Grant.\u003c/p\u003e\n\u003cp\u003eCaleb scoffed. “You get more action than any man I know—hel, more than any three men I know put together.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and look where it’s gotten me. I’ve got paint stains on my ass and a sore dick.”\u003c/p\u003e\n\u003cp\u003e“Poor baby. Maybe you should try teling Celia you love her. That’l scare her off.”\u003c/p\u003e\n\u003cp\u003e“Don’t I wish,” said Grant with a sigh. “Knowing her, it would probably turn her on. Everything turns that woman on.”\u003c/p\u003e\n\u003cp\u003e“Even watching paint dry?” teased Caleb.\u003c/p\u003e\n\u003cp\u003eGrant winced as if a memory stung. “Especialy that.”\u003c/p\u003e\n\u003cp\u003eLana couldn’t hide any longer. She’d spent the day avoiding Caleb, but they’d shared a ride here, and as much as she wanted to continue to avoid him, she knew it was the coward’s way out. He deserved better. He deserved an explanation about why she’d reacted the way she did to those three little words. She knew her reaction had to hurt him, and it kiled her inside to know that she’d given him pain in exchange for such a precious gift.\u003c/p\u003e\n\u003cp\u003eLana locked up the building and found Caleb lying on the hood of the car, waiting for her. Everyone had left an hour ago when the final prep work was done. It was nearly ten, and the sky was dark, the air stil hot as it blew over the sun-heated ground. She could hear crickets singing in the bushes nearby and the hum of traffic along the street.\u003c/p\u003e\n\u003cp\u003eSwarms of bugs hovered in a cloud around the light overhead.\u003c/p\u003e\n\u003cp\u003eCaleb was leaning back against the windshield with his hands stacked behind his head. Muscles in his thick arms bulged beneath the sleeves of his shirt, which was stretched tight over the ridges of his chest and abdomen.\u003c/p\u003e\n\u003cp\u003eLana’s chest tightened at the sight of him lounging there so casualy in an elegant male sprawl. Part of her wished she was a normal woman with a normal life so she could just give in to the fantasy life his love could create for her. He would be an easy man to love, so caring and gentle. A true hero.\u003c/p\u003e\n\u003cp\u003eHe deserved better than Lana, and she deserved better than pretending she was a normal woman when she was anything but.\u003c/p\u003e\n\u003cp\u003e“You waited,” she said as she approached the car. Her pace was slow as she tried to gauge his mood.\u003c/p\u003e\n\u003cp\u003e“I stil have a job to do,” he told her in an even voice. No accusations.\u003c/p\u003e\n\u003cp\u003eLana felt herself relax a little. She should have known he wouldn’t throw a fit. He was better than that. “I’m sorry about . . . today,” she told him.\u003c/p\u003e\n\u003cp\u003eHe didn’t seem inclined to get up, just stayed where he was, staring up at the stars. “What part are you sorry about? The part where I said what I did, or the part where you ran away?”\u003c/p\u003e\n\u003cp\u003e“Both, I guess.”\u003c/p\u003e\n\u003cp\u003eHe let out a heavy sigh. “I can’t take it back, Lana. I would if I could, but I can’t. We can either get past it or not. Your cal.”\u003c/p\u003e\n\u003cp\u003eFor a second, she resented him putting that burden on her, until she realized that he didn’t see it as a burden as much as he did a choice. One he was letting her make. No pressure. No pushing. She didn’t deserve to be treated so gently after what she’d done. \u003c/p\u003e","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-40.html","bookId":2375,"creation":"Oct 5, 2019 10:16:51 AM","modification":"Oct 5, 2019 10:16:51 AM"}
