{"id":10951,"no":13,"title":"CHAPTER XIII. GRIT\u0027S BOAT IS SOLD.","content":"\u0026nbsp;Brandon was not usually an early riser, and would not on this occasion have got up so soon if a bright idea had not occurred to him likely to bring money to his purse. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was certainly vexatious that Grit so obstinately refused to pay into his hands the money he had managed in some way unknown to his stepfather to accumulate. Perhaps some way of forcing the boy to do so might suggest itself, but meanwhile he was penniless; that is, with the exception of the dime he had abstracted during the night. Possibly his wife might have some money. He proceeded to sound her on the subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mrs. B.,\" said he, \"I shall have to trouble you for a little money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I gave you a dollar yesterday,\" said Mrs. Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s a dollar? I have none of it left now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you spend it at the tavern?\" asked his wife gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 88]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not willing to be catechized upon that point,\" returned Brandon, in a tone of lofty dignity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is quite impossible to supply you with money for such a purpose,\" continued Mrs. Brandon. \"What money Grit earns is wanted for necessary expenses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so easily deceived,\" said her husband, nodding sagaciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is quite true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t argue the point, Mrs. B. Have you any change now? That is the question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I have not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be it so. I have only to remark that you and your son will have occasion to regret the unfriendly and suspicious manner in which you see fit to treat me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So saying, Mr. Brandon sat down to his breakfast, which he ate with an appetite such as is usually earned by honest toil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he rose from the table, he left the cottage without a word.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How it all this to end?\" thought Mrs. Brandon, following his retreating form with an anxious glance. \"He has not been here twenty-four hours yet, and he has spent a dollar of Grit\u0027s hard earnings, and is dissatisfied because we will not give him more. Besides,[Pg 89] he has already broached the subject of mortgaging the house, and all to gratify his insatiable thirst for strong drink.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Certainly the prospects were not very bright, and Mrs. Brandon might well be excused for feeling anxious.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though Brandon had ten cents in his pocket, the price of a glass of whisky, he did not go at once to the tavern, as might have been expected. Instead of this, he bent his steps toward the river.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew about where Grit kept his boat, and went directly to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ha! a very good boat!\" he said, after surveying it critically. \"It ought to be worth ten dollars, at least, though I suppose I can\u0027t get over five for it. Well, five dollars will be a lift to me, and if Grit wants another boat he\u0027s got the money to buy one. I can get even with him this way, at least. He\u0027d better have treated me well and saved his boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat was tied fast, but this presented no insurmountable difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon pulled a jack-knife out of his pocket, and after awhile—for it was very dull—succeeded in severing the rope.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he jumped into the boat and began to row out into the stream.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 90]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was a little at a loss at first as to where he would be most likely to find a purchaser. In his five years\u0027 absence from the neighborhood he had lost his former acquaintances, and there had been, besides, changes in the population.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he was rowing at random, he chanced to look back to the shore he had left, and noticed that a boy was signaling to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He recognized him as the boy whom he had heard speaking of Grit\u0027s treasure, and, being desirous of hearing more on the subject, he at once began to pull back to the river bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy, as the reader will surmise, was Phil Courtney.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hello, there!\" said Phil; \"isn\u0027t that Grit Morris\u0027 boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, it\u0027s mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the same Grit usually rows in,\" said Phil, beginning to suspect Brandon of theft.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That may be, but the boat is mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he sell it to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who are you, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Mr. Brandon, Grit\u0027s stepfather.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil whistled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s you, is it?\" he said, surveying Brandon, not over respectfully, for he knew[Pg 91] where he had spent the last five years. \"So you\u0027ve come home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but I might as well have stayed away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is that?\" asked Phil, regarding the man before him with curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon was not too proud to speak of his domestic grievances, as he regarded them, to a stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My wife and son treat me like a stranger,\" he said. \"Instead of giving me a warm welcome after my long absence, they seem to be sorry to see me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t wonder much,\" thought Phil, but he did not say so, not being averse to drawing Brandon out on this subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And that reminds me, young gentleman; I was walking behind you last evening, and I heard you say something about Grit\u0027s having a large sum of money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he showed me sixty dollars yesterday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you sure there was as much as that?\" inquired Brandon eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I am sure, for my cousin counted it in my presence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might have belonged to some one else,\" suggested Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 92]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I thought so myself, but Grit said it belonged to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he say where he got it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he\u0027s mighty close about his affairs. I couldn\u0027t help wondering myself, and asked him, but he wouldn\u0027t tell me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he\u0027s got as much money as that, he ought to give it to me to take care of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you make him give it to you?\" suggested Phil maliciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did ask him, but he refused. A boy of his age ought not to carry about so much money. Did he carry it in a roll of bills, or in a pocketbook?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had it in a wallet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t see the wallet,\" thought Brandon. \"I only found the purse. The boy must have hidden it somewhere. I must look for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you going to do about it?\" asked Phil. \"Are you going to let him keep it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not if I can find it. I will take it away from him if I get the chance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish he would,\" thought Phil. \"It would soon go for drink, and then Master Grit wouldn\u0027t put on so many airs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask your name?\" asked Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Phil Courtney, the son of Squire Courtney, the president of the bank,\" answered Phil pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 93]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say so!\" exclaimed Brandon, in a tone of flattering deference. \"I am proud to know you. You come of a fine family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, my father stands pretty high,\" remarked Phil complacently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really,\" thought he, \"this man has very good manners, even if he has just come from the penitentiary. He treats me with a good deal more respect than Grit does. If I could help him to get the money I would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not a man in town stands higher,\" said Brandon emphatically. \"Are you a friend of my stepson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, hardly,\" answered Phil, shrugging his shoulders. \"You must excuse my saying so, but Grit hasn\u0027t very good manners, and, though I patronize him by riding in his boat, I cannot regard him as a fitting associate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are entirely right, young gentleman,\" said Brandon. \"Though Grit is my stepson, I am not blind to his faults. He has behaved very badly to me already, and I shall be obliged to require him to treat me with more respect. If he would only copy you, I should be very glad.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very polite, Mr. Brandon,\" said Phil, flattered. \"I hope, for your sake, that Grit will improve.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 94]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, Mr. Courtney\"—Phil swelled with conscious pride at this designation—\"do you know any one who would like to buy a boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What boat do you refer to?\" asked Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I thought it was Grit\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am his stepfather, and have decided to sell it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027ll you take?\" asked Phil, not unwilling to buy a good boat, especially as he knew it would annoy Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is worth ten dollars, but I will sell it for six dollars cash.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say five, and I\u0027ll take it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Mr. Courtney, seeing it\u0027s you, I will say five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a bargain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil had his money in his pocket, and he lost no time in binding the bargain by paying the money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I\u0027ll take a row myself,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He jumped into the boat, and Brandon, with five dollars in his pocket, took the nearest road to the tavern.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81855.html","bookId":372,"creation":"Aug 2, 2019 3:31:38 AM","modification":"Aug 2, 2019 3:31:38 AM"}
