{"id":10958,"no":20,"title":"CHAPTER XX. A PROMISING PLAN.","content":"\u0026nbsp;The conference between Colonel Johnson and Travers was apparently of great interest to the latter. It is important that the reader should be made acquainted with its nature. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I take it for granted, Mr. Travers,\" said the colonel, after their potation, \"that you are ready to undertake a job if there is money in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s as true as you live,\" said Travers emphatically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I also right in concluding that you are not squeamish as to how the money is earned? You are not overburdened with conscientious scruples, eh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not much! They\u0027re all nonsense,\" returned Travers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good! I see you are the sort of a man I took you for. Now you must, to begin with, promise that you will regard as confidential what I am about to say to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom Travers can be relied upon, colonel. He\u0027s safe every time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good again! Then I shall not hesitate to[Pg 144] unfold to you my little plan. I believe you have a bank in the village?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but, colonel, I am a stranger here. I only know one person here—my friend Brandon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he—the same kind of a man as yourself?\" inquired Johnson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The same identical kind, colonel. What is it Shakespeare, or some other poet, says:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Two flowers upon a single stalk,\n\u003c/div\u003e \n\u003cdiv\u003e\n Two hearts that beat as one.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I compliment you on your knowledge of poetry, Mr. Travers. I didn\u0027t think it was in you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Travers looked complimented.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve had an education, colonel,\" he said complacently, \"though circumstances have been against me for the last four years. As for my friend Brandon, he\u0027s one you can rely upon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall probably require his services as well as yours,\" said Johnson. \"Now let me proceed. You agree with me that bank capitalists are grasping monopolists, that they grind down the poor man, and live in luxury at the expense of the poor laborer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just my notion, colonel!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 145]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And whatever we can get out of them is what they richly deserve to lose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well and good! I see you agree with me. And now, friend Travers, I will tell you what I have in view, and why it is that I need the services of two gentlemen like you and your friend. The fact is\"—here Johnson dropped the mask, being assured of the character of his listener—\"there\u0027s a good haul to be made within three days—a haul which, if successful, will make all three of us easy in our circumstances for years to come.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go ahead, colonel. I\u0027m with you, and my friend Brandon, too. I\u0027ll answer for him. We both need a lift mightily.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I learn—no matter how\"—said Johnson, lowering his voice, \"that a messenger from the bank goes to Boston day after to-morrow with a package of thirty thousand dollars in government bonds. He\u0027s to carry them to the Merchant\u0027s National Bank in Boston. These bonds are not registered, but coupon bonds, and can easily be sold. They are at a premium of fifteen or sixteen per cent., which would bring up the value to nearly or quite thirty-five thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Travers listened with eager interest. He [Pg 146]began to understand the service that was expected of him, but it did not apparently shock him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My plan,\" continued Colonel Johnson, \"is for you and your friend to follow this bank messenger, and between here and Boston to relieve him of this package. You will meet me at a spot agreed upon in or near the city, and I will take the package.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will take the package?\" repeated Travers blankly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but I will reward you liberally for your service. You and Brandon will each receive from me, in case the affair succeeds, the sum of five thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought we would share and share alike,\" said Travers, in a tone of disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nonsense, man! Isn\u0027t it my plan? Am I to reap no benefit from my own conception? Besides, shall I not have the care and responsibility of disposing of the bonds? This will involve danger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So will our part involve danger,\" objected Travers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true, but your hazard is small. There will be two of you to one bank messenger. Besides, I take it for granted that you[Pg 147] will be adroit enough to relieve the messenger without his knowing anything about it. When he discovers his loss you will be out of sight. It strikes me you will be rewarded very handsomely for the small labor imposed upon you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Travers made a further effort to secure better terms, but his new acquaintance was firm in refusing them. The result was, that Travers unconditionally accepted for himself and Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When shall you see your friend Brandon, as you call him?\" inquired the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This very afternoon,\" answered Travers promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good! I like your promptness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is, if I can,\" continued Travers, a shade doubtfully, for he remembered the summary manner in which he had been ejected from the house of his congenial companion and friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well. Then we will postpone further debate till you have done so. I shall stay at the tavern here, and you can readily find me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will stay there, too. I was staying with my friend Brandon, but his wife and her son did not treat me well, and I left them. They want to separate us—old friends as we are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 148]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are jealous of you,\" suggested Johnson, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so, but I\u0027ll euchre them yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two walked together to the road, and there they separated, Johnson suggesting that it might be prudent for them not to be seen together too much.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Travers assented, and turned back in the direction of the house he had recently left under rather mortifying circumstances.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy\u0027ll be gone to his boat,\" he thought, \"and I don\u0027t care for the old lady. She doesn\u0027t like me, but I can stand that. I must see my friend Brandon, if I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Although Travers decided that Grit had returned to his boat, he approached the house cautiously. He thought it possible that Grit might still be on guard with the formidable pistol which he had pointed at him an hour or more earlier, and he did not like the looks of the weapon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might go off!\" he thought. \"That plaguy boy is awfully reckless, and he wouldn\u0027t mind shooting a gentleman, if he felt like it. I\u0027d like to pitch him into the water, pistol and all,\" he ejaculated fervently, in conclusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As I have said, Travers approached the little cottage with cautious steps. Drawing near,[Pg 149] he listened to see if he could hear any sound of voices that would betray the presence of the boy he wished to avoid.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All was still. Nothing was to be heard but the deep breathing of Brandon, who still lay on the floor in a stupor. Grit was back at his boat, and Mrs. Brandon had already left the house and gone to spend the remainder of the afternoon with her neighbor. Brandon was, therefore, the only occupant of the cottage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hear my friend Brandon,\" said Travers to himself. \"I can hear nothing of the boy. He must be away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By way of ascertaining definitely, Travers moved round to the window and peered in. He caught sight of the prostrate figure of Brandon, but could see no one else.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all right,\" he said to himself, in a satisfied tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He tried the door, and found it unlocked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered, and stooping over, seized Brandon by the shoulder, and called him loudly by name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say, Brandon, wake up!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go away, Grit,\" said Brandon drowsily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t Grit. It\u0027s I—your friend Travers,\" said that gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 150]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thought my friend Travers was gone,\" muttered Brandon, opening his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I did go, but I\u0027ve come back. I want to see you on important business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Portant business?\" repeated Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, very important business. Do you want to earn five thousand dollars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five thousand dollars!\" said Brandon, roused by this startling inquiry. \"\u0027Course I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then rouse yourself, and I\u0027ll tell you all about it. Here, let me bring you some water, and you can dip your face in it. It will bring you to yourself sooner than anything else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon acceded to the proposal, and was soon in a clearer state of mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Travers proceeded to unfold his plan, after learning that Mrs. Brandon was out; but he had a listener he did not know of. Grit had come home for something he had forgotten, and, with his ear to the keyhole, heard the whole plot. He listened attentively. When all was told, he said to himself:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll foil them, or my name isn\u0027t Grit!\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81862.html","bookId":372,"creation":"Aug 2, 2019 3:31:58 AM","modification":"Aug 2, 2019 3:31:58 AM"}
