{"id":10962,"no":24,"title":"CHAPTER XXIV. WHAT GRIT OVERHEARD BEHIND THE ELM-TREE.","content":"\u0026nbsp;Grit listened with incredulous amazement to the words of the bank president. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mean to send me?\" he ejaculated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Mr. Graves, nodding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I am only a boy!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true; but you have shown a sagacity and good judgment which justify me in selecting you, young as you are. Of course,[Pg 175] I shall take care that you are paid for your time. Now, are you willing to go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Willing to go to Boston, where he had not been for five years? Grit did not take long to consider.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" he answered promptly. \"If you are willing to trust me, I am willing to go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is well,\" said the president. \"I need hardly caution you to keep your errand a profound secret.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must not even tell your mother,\" continued Mr. Graves.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But she will feel anxious if I go away without a word to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mistake me. I would not for the world have you give her unnecessary anxiety. You may tell her that you are employed on an errand which may detain you from home a day or two, and ask her not to question you till you return.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I can say that,\" returned Grit. \"Mother will very likely think Mr. Jackson has employed me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Jackson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A gentleman now staying at the hotel. He has already been very kind to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If Grit had been boastful or vainglorious, he would have given the particulars of his rescue of little Willie Jackson from drowning. As it[Pg 176] was, he said no more than I have recorded above.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" answered the president. \"Your mother will not, at any rate, think you are in any mischief, as she knows you too well for that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When do you want me to go, sir?\" asked Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me see. To-day is Wednesday, and Friday is the day when we had decided to send the messenger. He was to go by the morning train. I think I will send you off in advance by the evening train of Thursday. Then the bonds will be in the bank at Boston, while the regular messenger is still on the way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will suit me very well, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The train starts at ten o\u0027clock. You can be at the train at half-past nine. I will be there at the same hour, and will have the bonds with me. I will at the same time provide you with money for the journey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir. Do you want to see me any time to-morrow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. I think it best that we should not be too much together. Even then, I don\u0027t think any one would suspect that I would employ you on such an errand. Still, it will be most prudent not to do anything to arouse suspicion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 177]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, Mr. Graves, I will bid you good night,\" said Grit, rising. \"I thank you very much for the confidence you are going to repose in me. I will do my best, so that you may not have occasion to repent it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t expect to repent it,\" said Mr. Graves, shaking hands with Grit in a friendly manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the young boatman left the house of the bank president, it was natural that he should feel a thrill of pride as the thought of the important mission on which he was to be sent. Then again, it was exhilarating to reflect that he was about to visit Boston. He had lived at Chester for five years and more, and during that time he had once visited Portland. That was an exciting day for him; but Boston he knew was a great deal larger than the beautiful city of which Maine people are pardonably proud, and contained possibilities of pleasure and excitement which filled him with eager anticipations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Grit knew that his journey was undertaken not for his own enjoyment, but was to be an important business mission, and he resolved that he would do his duty, even if he did not have a bit of fun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he thought over the business on which he was to be employed, his thoughts reverted[Pg 178] to Ephraim Carver, the bank messenger, and the more he thought of him, the more he suspected that he was implicated in the projected robbery. It was perhaps this thought that led him to make a detour so that he could pass the house of the messenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a small cottage-house, standing back from the street, from which a narrow lane led to it. Connected with it were four or five acres of land, which might have yielded quite an addition to his income, but Mr. Carver was not very fond of working on land, and he let it lie fallow, making scarcely any use of it. Until he obtained the position of bank messenger he had a hard time getting a living, and was generally regarded as rather a shiftless man. He was connected with the wife of one of the directors, and that was the way in which he secured his position. Now he received a small salary, but one on which he might have lived comfortably in a cheap place like Chester. But in spite of this he was dissatisfied, and on many occasions complained of the difficulty he experienced in making both ends meet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit turned down the lane and approached the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He hardly knew why he did so. He had no expectation of learning anything that would[Pg 179] throw light on the question whether Carver was or was not implicated in the conspiracy. Still, he was drawn toward the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The night was quite dark, but Grit knew every step of the way, and he walked slowly up the lane, which was probably two hundred feet long.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had gone, perhaps, half the distance, when he saw the front door of Carver\u0027s house open. Mr. Carver himself could be seen in the doorway with a kerosene-lamp in his hand, and at his side was a person whom with a thrill of surprise Grit recognized as the man staying at the hotel under the name of Colonel Johnson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That looks suspicious,\" thought Grit. \"I am afraid the messenger is guilty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He reflected that it would not do for either of them to see him, as it might render them suspicious. He took advantage of the darkness, and the fact that the two were not looking his way, to jump over the stone wall and hide behind the broad trunk of the lofty elm which stood just in that spot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could hear what they are saying,\" thought Grit. \"Then I should know for certain if my suspicions are well founded.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two men stood at the door for the space of a minute or more, and then the stranger [Pg 180]departed, but not alone. Ephraim Carver took his hat and accompanied him, both walking slowly up the lane toward the main road.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By a piece of good luck, as Grit considered it, they halted beneath the very elm-tree behind which he lay concealed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These were the first words Grit heard spoken:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear friend,\" said Johnson, in bland, persuasive accents, \"there isn\u0027t a particle of danger in it. You have only to follow my directions, and all will be well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall find it hard to explain how it happened that I lost the package,\" said Carver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at all! You will have a facsimile in your possession—one so like that no one need wonder that you mistook it for the original. Undoubtedly you will be charged with negligence, but they can\u0027t prove anything more against you. You can stand being found fault with for five thousand dollars, can\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If that is all, I won\u0027t mind. I shall probably lose my situation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose you do; it brings you in only six hundred dollars a year, while we pay you in one lump five thousand dollars—over eight times as much. Why, man, the interest of this sum at six per cent. will yield half as much as your annual salary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 181]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The bank people ought to pay me more,\" said Carver. \"Two months since I asked them to raise me to eight hundred a year, but they wouldn\u0027t. There was only one of the directors in favor of it—the man who married my wife\u0027s cousin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They don\u0027t appreciate you, friend Carver,\" said Johnson. \"How can they expect you to be honest, when they treat you in so niggardly a manner?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" said Carver, eager to find some justification for his intended treachery. \"If they paid me a living salary, I wouldn\u0027t do this thing you ask of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As it is, they have only themselves to blame,\" said Colonel Johnson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the way I look at it,\" said the bank messenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And quite right, too! I shouldn\u0027t be surprised if you managed to keep your place, after all. They won\u0027t suspect you of anything more than carelessness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would be splendid!\" returned Carver. \"With my salary and the interest of five thousand dollars, I could live as comfortably as I wanted to. How soon shall I receive the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As soon as we can dispose of the bonds safely. It won\u0027t be long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 182]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the two men parted, and Carver returned to his house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit crept out from behind the elm-tree when the coast was clear, and made his way home. He had learned a most important secret, but resolved to communicate it only to Mr. Graves.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81866.html","bookId":372,"creation":"Aug 2, 2019 3:32:07 AM","modification":"Aug 2, 2019 3:32:07 AM"}
