{"id":10964,"no":26,"title":"CHAPTER XXVI. THE FALL RIVER MANUFACTURER.","content":"\u0026nbsp;Grit lost no time in prosecuting his journey. In Portland he found that he should need to stay over a few hours, and repaired[Pg 190] to the United States Hotel. He left word to be called early, as he wished to take a morning train to Boston. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the breakfast-table he found himself sitting next to a man of swarthy complexion and bushy black whiskers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, my young friend,\" said the stranger, after a scrutinizing glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, sir,\" said Grit politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you stopping at this hotel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For the present, yes,\" answered the young boatman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going farther?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think of it,\" said Grit cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you are going to Boston,\" proceeded the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may do so,\" Grit admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad of it, for I am going, too. If agreeable, we will travel in company.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose we shall go on the same train?\" said Grit evasively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so. I am going to Boston on business. You, I suppose, are too young to have business of any importance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boys of my age seldom have business of importance,\" said Grit, resolved to baffle the evident curiosity of the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly. I suppose you have relations in Boston?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 191]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I once lived in that neighborhood,\" said Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so. Are you going to stay long in the city?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That depends on circumstances?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you live in this State?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At present I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The man looked a little annoyed, for he saw that Grit was determined to say as little about himself as possible. He decided to set the boy an example of frankness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not live in Maine,\" he said; \"I am a manufacturer in Fall River, Mass. I suppose you have heard of Fall River?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a right smart place, as a Philadelphian would say. You never heard of Townsend\u0027s Woolen Mill, I dare say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I never have.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is one of the largest mills in Fall River. I own a controlling interest in it. I assure you I wouldn\u0027t take a hundred thousand dollars for my interest in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You ought to be in very easy circumstances,\" said Grit politely, though it did occur to him to wonder why the owner of a controlling interest in a large woolen mill should be attired in such a rusty suit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am,\" said the stranger complacently.[Pg 192] \"Daniel Townsend\u0027s income—I am Daniel T., at your service—for last year was twelve thousand three hundred and sixty-nine dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This gentleman seems very communicative,\" thought Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your income was rather larger than mine,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ho, ho! I should say so,\" laughed Mr. Townsend. \"Are you in any business, my young friend?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am connected with navigation,\" said Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed?\" observed Townsend, appearing puzzled. \"Do you find it a paying business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tolerably so, but I presume woolen manufacturing is better?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" assented Townsend, rather absently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point Grit rose from the table, having finished his breakfast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Townsend seems very social,\" thought our hero, \"but I think he is given to romancing. I don\u0027t believe he has anything more to do with a woolen mill in Fall River than I have.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit reached the station in time, and took his seat in the train. He bought a morning paper, and began to read.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, here you are, my young friend!\" fell[Pg 193] on his ears just after they passed Saco, and Grit, looking up, saw his breakfast companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is the seat beside you taken?\" asked Mr. Daniel Townsend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit would like to have said \"yes,\" but he was compelled to admit that it was unengaged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So much the better for me,\" said the woolen manufacturer, and he sat down beside our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had with him a small, well-worn valise, which looked as if in some remote period it had seen better days. He laid it down, and, looking keenly about, observed Grit\u0027s parcel, which, though commonplace in appearance, contained, as we know, thirty thousand dollars in government bonds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is rather a long ride to Boston,\" said Mr. Townsend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but it seems shorter when you have something to read,\" answered Grit, looking wistfully at his paper, which he would have preferred reading to listening to the conversation of his neighbor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never care to read on the cars,\" said Mr. Townsend. \"I think it is injurious to the eyes. Do you ever find it so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 194]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have not traveled enough to be able to judge,\" said Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very likely. At your age I had traveled a good deal. My father was a rich merchant, and as I was fond of roving, he sent me on a voyage to the Mediterranean on one of his vessels. I was sixteen at that time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder whether this is true, or not,\" thought Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I enjoyed the trip, though I was seasick on the Mediterranean. It is really more trying than the ocean, though you might not imagine it. Don\u0027t you think you would enjoy a trip of that sort?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I am sure I would,\" said Grit, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so; most boys of your age are fond of traveling. Perhaps I might find it in my way to gratify your wishes. Our corporation is thinking of sending a traveler to Europe. You are rather young, but still I might be able to get it for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You know so little about me,\" said Grit sensibly, \"that I wonder you should think of me in any such connection.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true. I don\u0027t know anything of you, except what you have told me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That isn\u0027t much,\" thought Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And it may be necessary for me to know[Pg 195] more. I will ask you a few questions, and report your answers to our directors at their meeting next week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir; but I think we will postpone discussing the matter this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is any time better than the present?\" inquired Townsend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit did not care to say much about himself until after he had fulfilled his errand in the city. He justly felt that with such an important charge it was necessary for him to use the greatest caution and circumspection. Still, there was a bare possibility that the man beside him was really what he claimed to be, and might have it in his power to give him a business commission which he would enjoy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you will call on me at the Parker House this evening,\" said Grit, \"I will speak with you on the subject.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whom shall I inquire for?\" asked the Fall River manufacturer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You need not inquire for any one. You will find me in the reading-room at eight o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" answered Mr. Townsend, appearing satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The conversation drifted along till they reached Exeter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 196]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Mr. Townsend rose in haste, and, seizing Grit\u0027s bundle instead of his own, hurried toward the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit sprang after him and snatched the precious package.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have made a mistake, Mr. Townsend,\" he said, eyeing his late seat companion with distrust.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, so I have!\" ejaculated Townsend, in apparent surprise. \"By Jove! it\u0027s lucky you noticed it. That little satchel of mine contains some papers and certificates of great value.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In that case I would advise you to be more careful,\" said Grit, who did not believe one word of the last statement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I will,\" said Townsend, taking the satchel. \"I am going into the smoking-car. Won\u0027t you go with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, thank you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a spare cigar,\" urged Townsend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you again, but I don\u0027t smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, well, you\u0027re right, no doubt, but it\u0027s an old habit of mine. I began to smoke when I was twelve years old. My wife often tells me I am injuring my health, and perhaps I am. Take the advice of a man old enough to be your father, and don\u0027t smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 197]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s good advice, sir, and I shall probably follow it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, good day, if we don\u0027t meet again,\" said Townsend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Townsend, instead of passing into the smoking-car, got off the train. Grit observed this, and was puzzled to account for it, particularly as the train started on, leaving him standing on the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few minutes later the conductor passed through the train, calling for tickets.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit looked in vain for his, and, deciding that he should have to pay the fare over again, he felt for his pocketbook, but that, too, was missing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He began to understand why Mr. Townsend left the train at Exeter.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81868.html","bookId":372,"creation":"Aug 2, 2019 3:32:14 AM","modification":"Aug 2, 2019 3:32:14 AM"}
