{"id":10966,"no":28,"title":"CHAPTER XXVIII. THE TRAIN ROBBERY.","content":"\u0026nbsp;When Grit had delivered the bonds at the bank, a great load seemed to be lifted from his shoulders. Especially after he had been robbed on the train, he realized the degree of risk and responsibility involved in the custody of so valuable a packet. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The officials at the bank seemed surprised at the youth of the messenger, but Grit felt at liberty to explain why he was selected as a substitute for the regular messenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving our hero for a time, we go back to Chester to speak of other characters in our story.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ephraim Carver, the bank messenger, went to the bank at the hour of opening to receive the package of bonds which he expected to convey to Boston. He had no suspicion that his negotiations of a previous evening had been overheard and reported to the president. He felt somewhat nervous, it is true, for he[Pg 206] felt that a few hours would make him a rich man. Then the risk involved, though he did not consider it to be great, was yet sufficient to excite him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was admitted into the president\u0027s room, as usual.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Graves was already in his office, but his manner was his ordinary one, and the messenger did not dream that the quiet official read him through and through and understood him thoroughly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You know, I suppose, Mr. Carver,\" said President Graves, \"that you are to go to Boston by the next train.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The packet you will carry is of unusual value, and requires an unusual degree of care and caution.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It contains thirty thousand dollars in government bonds,\" said the president, laying his hand on the prepared packet, which was in the usual form. \"That is a fortune in itself,\" he added, closely scrutinizing the face of the messenger. He thought he detected a transient gleam of exultation in the eyes of the bank messenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course,\" he proceeded, \"if it were known that you carried a packet of such[Pg 207] value, there would be great danger of your being robbed. Indeed, you might be in some personal danger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But as it is only known to you and the officers of the bank, there is no special danger. Still, I advise you to be more than usually vigilant, on account of the value of your charge.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, sir, I shall take good care of it,\" answered Carver, reaching out his hand for the packet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me see, how long have you been in the employ of the bank?\" asked the president.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nearly three years, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have found it a light, easy position, have you not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, though, if you will allow me to say so, the salary is small.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True; but the expenses of living in Chester are small, also. However, we will not discuss that question now. Possibly at the end of the year, if they continue satisfied with you, the directors may increase your salary slightly. There cannot be a large increase.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may not need an increase then,\" thought Carver. \"With five thousand dollars to fall back upon, I shall feel independent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will report to me when you return,\"[Pg 208] said Mr. Graves, as the messenger left the bank parlor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, directly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The president fixed his eyes upon the vanishing figure of the messenger, and said to himself:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My friend, you have deliberately planned your own downfall. Greed of money has made you dishonest, but your plans are destined to miscarry, as this time to-morrow you and your confederates will be made aware.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" thought the bank messenger, as he bent his steps toward the railway station, \"the path is clear. Here is what will completely change my fortunes, and lift me from an humble dependent to a comfortable position in life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he thought, with some dissatisfaction, that he was to receive but one-sixth of the value of the bonds, and that the man who employed him to betray his trust would be much more richly paid. However, in his case, there would be no risk of being personally implicated. No one could prove that he had allowed himself to be robbed. Even if suspicion fastened upon him, nothing could be proved. So, on the whole, perhaps it was better to be content with one-sixth than to incur greater[Pg 209] risk, and the dread penalty of imprisonment for a term of years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the railroad platform Carver glanced furtively about him. He easily recognized Brandon and Travers, who stood side by side, each having provided himself with a ticket. They on their side also glanced swiftly at him, and then turned away with a look of indifference. But they had not failed to notice the important packet which the bank messenger carried in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is all right!\" was the thought that passed through their minds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another passenger waiting for the train, whom they did not notice. He was a small, quiet, unpretentious-looking man, attired in a suit of pepper and salt, and looked like a retail merchant in a small way, going to Portland or Boston, to order goods. They would have been very much startled had they known that it was a Boston detective, who had been telegraphed for by Mr. Graves, and that his special business was to follow them and observe their actions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the train reached the station Carver got in, and took a seat by himself in the second car. Just behind him sat the two confederates, Brandon and Travers, and in line with them, on the opposite side of the car,[Pg 210] sat the quiet man, whom we will call Denton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ten minutes before the train reached Portland Ephraim Carver left his seat, and very singularly forgot to take the parcel, of which he had special custody, with him. It was a remarkable piece of forgetfulness, truly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his oversight was not unobserved. Travers sprang from his seat, took the parcel, and following the messenger overtook him at the door of the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He tapped Carver on the shoulder, and the latter turned round.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I beg pardon,\" said Travers, \"but you left this on the seat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he handed a packet to Carver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A thousand thanks!\" said the messenger hurriedly. \"I was very careless. I am very much indebted to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought the packet might contain something valuable,\" said Travers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At any rate, I should not like to lose it,\" said the messenger, who appeared to be properly on his guard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, don\u0027t mention it,\" said Travers politely, and he walked back and resumed his seat beside Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The quiet man, to whom we have already referred, noted this little piece of acting with a smile of enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 211]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well done, good people,\" he said to himself. \"It ought to succeed, but it won\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His sharp eyes had detected what the other passengers had not—that Travers had skilfully substituted another package for the one he had picked up from the seat vacated by Carver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carver passed on into the next car, and Denton now concentrated his attention upon Brandon and Travers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He noticed in both traces of joyful excitement, for which he could easily account. They thought they had succeeded, and each mentally congratulated himself on the acquisition of a neat little fortune.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They will get out at Portland,\" thought Denton, \"and take account of their booty. I should like to be there to see, but I am instructed to follow my friend the bank messenger to Boston, and must, therefore, forego the pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At Portland, Brandon and Travers got out of the cars, and took a hack to the Falmouth Hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They went to the office, and, calling for the hotel register, carefully scanned the list of arrivals.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 212]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The afternoon previous they found entered the name of Colonel Johnson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Colonel Johnson in?\" asked Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will ascertain,\" was the reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bell-boy who was despatched to inquire returned with the message that Colonel Johnson would see the gentlemen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They followed the attendant to a room on the third floor, where they found their employer pacing the room in visible excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me the parcel,\" he said, in a peremptory tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He cut the strings, and hastily opened the coveted prize.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his eager look was succeeded by black disappointment, as, instead of the bonds, he saw a package of blank paper of about the same shape and size.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Confusion!\" he ejaculated; \"what does all this mean? What devil\u0027s mess have you made of the business?\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81870.html","bookId":372,"creation":"Aug 2, 2019 3:32:19 AM","modification":"Aug 2, 2019 3:32:19 AM"}
