{"id":10972,"no":34,"title":"CHAPTER XXXIV. GRIT REACHES BOSTON.","content":"\u0026nbsp;Full of hope and joyful anticipation, Grit left home and pursued his journey to Boston. He had occasion to stop a couple of hours at Portland, and improved it by strolling down[Pg 244] to the pier of the little steamers that make periodical trips to the islands in the harbor. Just outside a low saloon he unexpectedly ran across his stepfather. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How are you, Grit?\" said Brandon affably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a flush on Brandon\u0027s face, and an unsteadiness of gait which indicated that he had succeeded in evading what is known as the Maine law. To Grit it was not a welcome apparition. Still, he felt it due to himself to be ordinarily polite.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am well,\" he answered briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how\u0027s your mother?\" asked Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite well, thank you,\" Grit answered, as formally as if the question had been asked by a stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does she miss me much?\" asked his stepfather, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She has not mentioned it,\" responded our hero coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry that circumstances compel me to be absent from her for a time,\" continued Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, don\u0027t disturb yourself,\" said Grit. \"She is quite used to being alone. I think she mentioned that you talked of going to Europe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 245]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon frowned, and his bitter disappointment was thus recalled to his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know whether I shall or not,\" he answered. \"It depends upon whether my—speculation turns out well. Where are you going?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit hesitated as to whether he should answer correctly. He was not anxious to have Brandon looking him up in Boston, but it occurred to him that he should be traveling at the West, and, therefore, he answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have heard of a chance in Boston, and am going to see about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, Grit!\" said Brandon. \"You have my consent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It occurred to Grit that he did not stand in need of his stepfather\u0027s approval, but he did not say so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Grit, I send you forth with a father\u0027s blessing,\" said Brandon paternally. \"By the way, have you a quarter about you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit thought that a quarter was rather a high price to pay for Brandon\u0027s blessing, but he was in good spirits, and this made him good-natured. Accordingly, he drew a quarter from his pocket and handed it to his stepfather.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Grit,\" said Brandon briskly, for he had felt uncertain as to the success of[Pg 246] his application. \"I like to see you respectful and dutiful. I will drink your good health, and success to your plans.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better drink it in cold water, Mr. Brandon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s all right,\" said Brandon. \"Good-by!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He disappeared in the direction of the nearest saloon, and Grit returned to the depot to take the train for Boston.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know that I ought to have given him any money,\" thought Grit, \"but I was so glad to get rid of him that I couldn\u0027t refuse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He reached Boston without further adventure, arriving at the Boston and Maine depot in Haymarket Square about four o\u0027clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder whether it is too late to call on Mr. Weaver to-night,\" thought Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He decided that it was not. Even if it were too late for an interview, he thought it would be wise to let his prospective employer understand that he had met his appointment punctually.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Carriage, sir?\" asked a hackman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit answered in the negative, feeling that to one in his circumstances it would be foolish extravagance to spend money for a carriage. But this was succeeded by the thought that time was valuable, and as he did not[Pg 247] know where Essex Street was, it might consume so much to find out the place indicated in the letter that he might miss the opportunity of seeing Mr. Weaver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How far is Essex Street from here?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three or four miles,\" promptly answered the hackman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is there any street-car line that goes there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, bless you, no.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Neither of these answers was correct, but Grit did not know this.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much will you charge to take me to No. —— Essex Street?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Seein\u0027 it\u0027s you, I\u0027ll take you for a dollar and a quarter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit was about to accept this offer, when a quiet-looking man beside him said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The regular fare is fifty cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it any of your business?\" demanded the hackman angrily. \"Do you want to take the bread out of a poor man\u0027s mouth?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, if the poor man undertakes to cheat a boy!\" answered the quiet man keenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s ridiculous expectin\u0027 to pay fifty cents for a ride of three or four miles,\" grumbled the hackman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The distance isn\u0027t over a mile and a [Pg 248]quarter, and you are not allowed to ask over fifty cents. My boy, I advise you to call another hack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jump in,\" said the hackman, fearful of losing his fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I will get in, too, as I am going to that part of the city,\" said the small man, in whom my readers will probably recognize the detective already referred to.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027ll be extra.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course,\" said the detective. \"I understand that, and I understand how much extra,\" said the stranger significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the man and boy rattled through the streets, they fell into a conversation, and Grit, feeling that he was with a friend, told his plan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph!\" said the detective. \"May I see this letter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know who recommended you to Mr. Weaver?\" asked Grit\u0027s new friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And can\u0027t guess?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Doesn\u0027t it strike you as a little singular that such an offer should come from a stranger?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; that did occur to me. Don\u0027t you[Pg 249] think it genuine?\" asked Grit anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I could tell better if I should see this Mr. Weaver.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you go in with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; it might seem odd, and the proposal may be genuine. I\u0027ll tell you what to do, my boy. That is, if you feel confidence in me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do, and shall be glad of your advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come to the Parker House after your interview, and inquire for Benjamin Baker.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will, sir, and thank you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the hack drew up in front of No. —— Essex Street, the stranger got out with Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am calling close by,\" he said, \"and won\u0027t ride any farther. Here is the fare for both.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, sir,\" said Grit, \"it is not right that you should pay my fare for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is all right,\" said Mr. Baker. \"I have more money than you, probably, my young friend. Besides, meeting with you has saved me some trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This speech puzzled Grit, but he did not feel like asking any explanation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He glanced with some interest at the house where he was to meet Mr. Weaver. It was a three-story brick house, with a swell front, such as used to be very popular in Boston thirty or forty years since. It was very quiet in appearance, and there was nothing to distinguish it from its neighbors on either side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 250]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon, Mr. Baker,\" said Grit, as he ascended the steps to ring the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon. Remember to call upon me at the Parker House.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Baker turned down a side street, and Grit rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was opened by a tall, gaunt woman, with a cast in her eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s wanted?\" she asked abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I called to see Mr. Weaver—Mr. Solomon Weaver,\" said Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes,\" said the woman, with a curious smile. \"Come in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The hall which Grit entered was dark and shabby in its general appearance. Our hero followed his guide to a rear room, the door of which was thrown open, revealing a small apartment, with a shabby collection of furniture. There was no carpet on the floor, but one or two rugs relieved the large expanse of floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take a seat, and I\u0027ll call Mr. Weaver,\" said the woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Somehow Grit\u0027s courage was dampened by the unpromising look of the house and its interior.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had pictured to himself Mr. Weaver as a[Pg 251] pleasant, prosperous-looking man, who lived in good style, and was liberally disposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He sat down in an armchair in the center of the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had but five minutes to wait.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the door opened, and to Grit\u0027s amazement the man whom he had known as Colonel Johnson entered the room, and coolly locked the door after him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81876.html","bookId":372,"creation":"Aug 2, 2019 3:32:32 AM","modification":"Aug 2, 2019 3:32:32 AM"}
