{"id":10974,"no":36,"title":"CHAPTER XXXVI. THE BOY DANIEL.","content":"\u0026nbsp;Though Grit was not hurt by his sudden descent into the dark cavity under the room in which he had been seated, he was, nevertheless, somewhat startled. Indeed, it was enough to startle a person much older. For the first time it dawned upon him that he was the victim of a conspiracy, and Mr. Weaver was either an imaginary person, or his offer was not genuine. It was clear, also, from the tenor of Johnson\u0027s questions that he fully understood, or at least suspected, that his plan had been known in advance to the bank officials. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young boatman understood how to manage a boat, but in the present case he found that he was out of his element. The[Pg 258] tricks, traps, and devices of a great city he knew very little about. He had, indeed, read about trap-doors and subterranean chambers in certain sensational stories which had come into his possession, but he looked upon them as mere figments of the imagination, and did not believe they really existed. Now, here was he himself made an unexpected victim by a conspiracy of the same class familiar to him in novels.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Naturally, the first thing to do was to take a survey of his new quarters, and obtain some idea of his position. At first everything seemed involved in thick darkness, but as his eye became accustomed to it, he could see that he was in a cellar of about the same size as the room above, though there was a door leading into another. He felt his way to it, and tried to open it, but found that it was fastened, probably by a bolt on the other side. There was no other door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am like a rat in a trap,\" thought Grit. \"What are they going to do with me, I wonder?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While it was unpleasant enough to be where he was, he did not allow himself to despond or give way to unmanly fears. There was no reason, he thought, to apprehend serious peril or physical violence. Colonel Johnson [Pg 259]probably intended to frighten him, with a view of securing his compliance with the demands of the conspirators.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will find he has made a mistake,\" thought Grit. \"I am not a baby, and don\u0027t mean to act like one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He heard a noise, and, looking round, discovered the armchair in which he had descended being drawn up toward the trap-door. The door was opened by some agency, the chair disappeared, and again he was in darkness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They don\u0027t mean to keep me here in luxury,\" thought Grit. \"If I sit down anywhere, it will have to be on the floor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was late in the afternoon, as we know, and it seemed likely that our hero would have to remain in the subterranean chamber all night. As there was no bed, he would have to lie down on the ground. Grit kneeled down, and ascertained that the floor was cemented, and not a damp earthen flooring as he had feared. He congratulated himself, for he was bound to make the best of the situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another source of discomfort, however. It was already past Grit\u0027s ordinary supper hour, and, except a very slight lunch, consisting of a sandwich bought in the cars,[Pg 260] our hero had had nothing to eat since breakfast, and an early breakfast at that. Now, Grit was not one of those delicate boys who are satisfied with a few mouthfuls, but he had what is called a \"healthy appetite,\" such as belongs to most boys who have good stomachs and spend considerable time in the open air. He began to feel an aching void in the region of his stomach, and thought, with a sigh, of the plain but hearty supper he should have had at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope Colonel Johnson isn\u0027t going to starve me,\" he thought. \"That is carrying the joke too far. It seems to me I never felt so hungry in all my life before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Half an hour passed, and poor Grit\u0027s reflections became decidedly gloomy as his stomach became more and more troublesome. However, he was perfectly helpless, and must wait till the man, or men, who had him in their clutches, saw fit to provide for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Under these circumstances it may well be imagined that his heart leaped for joy when he heard the bolt of the only door, already referred to, slowly withdrawn with a rasping sound, as if it did not slide easily in its socket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned his eyes eagerly toward the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was opened, and a tall, overgrown youth[Pg 261] entered with a small basket in his hand, which he set down on the floor while he carefully closed the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hello, there! Where are you?\" he asked, for his eyes were not used to the darkness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here I am,\" answered Grit. \"I hope you\u0027ve brought me some supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Right you are!\" said the youth. \"Oh, now I see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The speaker was tall and overgrown, as I have said. He was also painfully thin, and his clothes were two or three sizes too small for him, so that his long, bony arms protruded from his coat-sleeves, and his legs appeared to have outgrown his pants. His face was long, and his cheeky were hollow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He reminds me of Smike, in \u0027Nicholas Nickleby,\u0027\" thought Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take your supper, young one, and eat it quick,\" said the youth, for he was not more than eighteen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit needed no second invitation. He quickly explored the contents of the basket. The supper consisted of cold meat and slices of bread and butter, with a mug of tea. To Grit everything tasted delicious, and he did not leave a crumb.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My! haven\u0027t you got an appetite?\" said the youth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 262]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t had anything to eat since morning,\" said Grit apologetically—\"that is, only a sandwich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say, what are you here for?\" asked the youth curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" answered Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Honor bright?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, honor bright. Do you live here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered the youth soberly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this man—Colonel Johnson—any relation of yours?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where are your folks?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Haven\u0027t got any. Never had any as I know of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you always lived here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Always lived with him,\" answered the boy, jerking his thumb in an upward direction. \"Sometimes here, sometimes in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like to be with—him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you run away?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Run away!\" repeated the other, looking around him nervously. \"He\u0027d get me back, and half kill me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s some mystery about this boy,\" thought Grit. \"Do you think he will keep me here long?\" he asked, in some anxiety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t say—maybe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 263]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Daniel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s your other name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Haven\u0027t got any.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Daniel,\" said Grit, a thought striking him. \"Do you ever go out—about the city, I mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes; I go to the post-office and other places.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you carry a message for me to the Parker House?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I darsn\u0027t,\" said Daniel, trembling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No one will know it,\" pleaded Grit. \"Besides, I\u0027ll give you—five dollars,\" he added, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got so much?\" asked Daniel eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Show it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit did so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I\u0027ll do it,\" said the youth, after a pause; \"but I must be careful so he won\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right. When can you leave the house?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will suit me very well. Now, shall I see you again to-morrow morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I shall bring you your breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 264]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; I will write a note, and will describe the gentleman you are to hand it to.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be sure to give me the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I will give it to you before you go, if you will promise to do my errand faithfully.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll promise. I never had five dollars,\" continued Daniel. \"There\u0027s many things I can buy for five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you can,\" answered Grit, who began to perceive that this overgrown youth was rather deficient mentally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t tell anybody that you are going to carry a message for me,\" said Grit, thinking the caution might be necessary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no, I darsn\u0027t,\" said Daniel quickly, and Grit was satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero felt much more comfortable after he was left alone, partly in consequence of the plain supper he had eaten, partly because he thought he saw his way out of the trap into which he had been inveigled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-morrow I hope to be free,\" he said to himself, as he lay down on the floor and sought the refreshment of sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fortunately for him, he was feeling pretty well fatigued, and though it was but eight o\u0027clock, he soon lost consciousness of all that[Pg 265] was disagreeable in his situation under the benignant influence of sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Grit awoke, he had no idea what time it was, for there was no way for light to enter the dark chamber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope it is almost breakfast-time,\" thought our hero, for he already felt the stirrings of appetite, and besides, all his hope centered in Daniel, whom he was then to see.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After awhile he heard the welcome sound of the bolt drawn back. Then a sudden fear assailed him. It might be some one else, not Daniel, who would bring his breakfast. If so, all his hopes would be dashed to the ground, and he could fix no limit to his captivity. But his fears were dissipated when he saw the long, lank youth, with the same basket which he had brought the night before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, Daniel,\" said Grit joyfully. \"I am glad to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re hungry, I reckon,\" said the youth practically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but I wanted to see you, so as to give you my message. Are you going out this morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I\u0027m goin\u0027 to market.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you go to the Parker House? You know where it is, don\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 266]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; it is on School Street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit was glad that Daniel knew, for he could not have told him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit had written a note in pencil on a sheet of paper which he fortunately had in his pocket. This he handed to Daniel, with full instructions as to the outward appearance of Mr. Benjamin Baker, to whom it was to be handed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now give me the money,\" said Daniel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here it is. Mind, Daniel, I expect you to serve me faithfully.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said, the lank youth, as he disappeared through the door, once more leaving Grit alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81878.html","bookId":372,"creation":"Aug 2, 2019 3:32:38 AM","modification":"Aug 2, 2019 3:32:38 AM"}
