{"id":10975,"no":37,"title":"CHAPTER XXXVII. DANIEL CALLS AT THE PARKER HOUSE.","content":"\u0026nbsp;It was half-past nine o\u0027clock in the forenoon, and Mr. Benjamin Baker, detective, sat smoking a cigar in the famous hotel on School Street, known as \"Parker\u0027s.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope nothing has happened to the boy,\" he said to himself, uneasily, as he drew out his watch. \"It is time he was here. Have I done rightly in leaving him in the clutches of a company of unprincipled men? Yet I[Pg 267] don\u0027t know what else I could do. If I had accompanied him to the door, my appearance would have awakened suspicion. If through his means I can get authentic information as to the interior of this house, which I strongly suspect to be the headquarters of the gang, I shall have done a good thing. Yet perhaps I did wrong in not giving the boy a word of warning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Baker took the cigar from his mouth and strolled into the opposite room, where several of the hotel guests were either reading the morning papers or writing letters. He glanced quickly about him, but saw no one that resembled Grit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not here yet?\" he said to himself, \"perhaps he can\u0027t find the hotel. But he looks too smart to have any difficulty about that. Ha! whom have we here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question was elicited by a singular figure upon the sidewalk. It was a tall, overgrown boy, whose well-worn suit appeared to have been first put on when he was several years younger, and several inches shorter. The boy was standing still, with mouth and eyes wide open, staring in a bewildered way at the entrance of the hotel, as if he had some business therein, but did not know how to go about it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 268]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s an odd-looking boy,\" he thought. \"Looks like one of Dickens\u0027 characters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally the boy, in an uncertain, puzzled way, ascended the steps into the main vestibule, and again began to stare helplessly in different directions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One of the employees of the hotel went up to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want?\" he demanded, rather roughly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be you Mr. Baker?\" asked the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I am not Mr. Baker.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is Mr. Baker?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know anything about Mr. Baker,\" answered the attendant impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy told me I would find him here,\" said Daniel, for of course my reader recognizes him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then the boy was playing a trick on you, most likely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Mr. Baker thought it advisable to make himself known.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Mr. Benjamin Baker,\" he said, advancing. \"Do you want to see me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel looked very much relieved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve got a note for you,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel did so, and was about to go out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 269]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait a minute, my young friend, there may be an answer,\" said the detective.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Baker read rapidly the following note:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am in trouble. I think the letter I received was only meant to entrap me. I have not seen Mr. Weaver, but I have had an interview with Colonel Johnson, who planned the robbery of the bank at Chester. He seems to know that I had something to do with defeating his plans, and has sounded me as to whether I will help him in case I act again as bank messenger. On my refusing, he touched a spring, and let me down through a trap-door in the floor of the rear room to a cellar beneath, where I am kept in darkness. The boy who gives you this brings me my meals. He doesn\u0027t seem very bright, but I have agreed to pay him well if he will hand you this, and I hope he will succeed. I don\u0027t know what Colonel Johnson proposes to do with me, but I hope you will be able to help me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Baker nodded to himself while he was reading this note.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This confirms my suspicions,\" he said to himself. \"If I am lucky I shall succeed in trapping the trappers. Hark you, my boy, when are you going back?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 270]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As soon as I have been to the market.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; what did the boy agree to give you for bringing this note?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five dollars,\" answered Daniel, his dull face lighting up, for he knew the power of money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you like five dollars more?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wouldn\u0027t I?\" was the eager response.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then don\u0027t say a word to anybody about bringing this note.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t. He\u0027d strap me if I did.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall you see the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, at twelve o\u0027clock, when I carry his dinner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When you see him, tell him you\u0027ve seen me, and it\u0027s all right. Do you understand?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may call up there some time this morning. If I do I want you to open the door and let me in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel nodded again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do. You can go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Baker left the hotel with a preoccupied air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2972/81879.html","bookId":372,"creation":"Aug 2, 2019 3:32:41 AM","modification":"Aug 2, 2019 3:32:41 AM"}
