{"id":72040,"no":17,"title":"Page 17","content":"\u003cp\u003e“Well, I heard they host orgies,” Hanna added. Everyone let out a collective Ew, but then a face had appeared at the window of the Purple House and they’d all quickly biked away.\u003c/p\u003e\n\u003cp\u003eMurderer.\u003c/p\u003e\n\u003cp\u003eSpencer paused from climbing up the front steps, her heart shooting into her throat. She stared at the quiet, almost vacant-looking houses on the street. A shadow slipped behind a pair of metal garbage cans in the alley.\u003c/p\u003e\n\u003cp\u003eShe shivered and thought of her most recent note from A. Maybe her friends weren’t convinced that Kelsey could be their new evil text-messager, but it was the most logical answer. Spencer had ruined Kelsey’s life. Now Spencer had to stop her before Kelsey ruined hers—and her friends’, too.\u003c/p\u003e\n\u003cp\u003eOver the summer, Spencer and Kelsey had become fast friends. Kelsey had confessed that after her parents had gotten divorced, she started acting out and fell in with a wild group of girls. She’d gotten into pot, and then started selling it. During a locker search at school, security found her stash. The only reason she wasn’t expelled from St. Agnes was because her dad had recently donated a science wing, but her parents threatened to send her to a super-strict Catholic school in Canada if she stepped out of line again.\u003c/p\u003e\n\u003cp\u003e“I decided to turn things around,” Kelsey said one night as she and Spencer lay together on her bed after a night of studying. “My parents refused to pay for it, saying it would be a waste after all the trouble I’d gotten into, but amazingly, a nonprofit I’d never heard of swooped in at the last minute and gave me a scholarship to go to the Penn program. I want to show my parents it was all worth it.”\u003c/p\u003e\n\u003cp\u003eIn turn, Spencer told Kelsey about her troubles, too—well, some of them. Like how she’d been tortured by A. How she’d stolen her sister’s paper and passed it off as her own for the Golden Orchid prize. How she wanted to be the very best all the time.\u003c/p\u003e\n\u003cp\u003eThey’d both been the perfect candidates for Easy A. At first, the pills hadn’t had much effect other than making them both feel really awake even when they’d pulled all-nighters. But as time went on, they both began to notice when they hadn’t taken it. “I can’t keep my eyes open,” Spencer would say during class. “I feel like a zombie,” Kelsey would groan. They watched Phineas across the room, covertly slipping yet another pill under his tongue. If he was okay taking more, maybe they would be, too.\u003c/p\u003e\n\u003cp\u003eA car with a rattling muffler drove past, breaking Spencer from her thoughts. Straightening up, she climbed the steps to Beau’s front porch, checked herself out in the front sidelight window—she’d dressed in skinny jeans, a soft cashmere sweater, and tall boots, which she thought looked appropriately cute but not like she was trying to impress Beau—and rang the bell.\u003c/p\u003e\n\u003cp\u003eNo one answered. She rang it again. Still no one.\u003c/p\u003e\n\u003cp\u003e“Hel-lo?” Spencer said impatiently, rapping hard on the door.\u003c/p\u003e\n\u003cp\u003eFinally, a light snapped on, and Beau appeared at the window. He whipped open the door. His eyes were sleepy, his dark hair was tousled, and he was shirtless. Spencer nearly swallowed the piece of Trident she was chewing. Where had he been hiding those abs?\u003c/p\u003e\n\u003cp\u003e“Sorry,” Beau said drowsily. “I was meditating.”\u003c/p\u003e\n\u003cp\u003e“Of course you were,” Spencer mumbled, trying not to stare at his thousand-sit-ups-a-day torso. This was like the time she and Aria had taken a life-drawing class at Hollis that had nude male models. The models seemed so nonchalant, but Spencer kept wanting to burst into giggles.\u003c/p\u003e\n\u003cp\u003eShe strode into the foyer, noting that the inside of the Purple House was as chaotic-looking as the outside. The hallway walls were filled with an eclectic mix of handwoven tapestries, oil paintings, and metal signs advertising brands of cigarettes and long-defunct diners. Shabby mid-century modern furniture adorned the large living room off to the left, and a rustic maple table covered in hardcover books of all shapes and sizes took up most of the dining room. At the end of the hall was an unrolled blue yoga mat. A small boombox sat nearby playing a soothing harp song, and an incense holder bearing a single lit stick wafted smoke into the air from an end table.\u003c/p\u003e\n\u003cp\u003e“So is your family renting this place?” Spencer asked.\u003c/p\u003e\n\u003cp\u003eBeau strolled over to the mat, scooped up a white T-shirt from the floor, and pulled it over his head. Spencer was both relieved and oddly disappointed that he was covering up. “No, we’ve owned it for almost twenty years. My parents rented it out to professors, but then my dad got a job in Philly and we decided to move back in.”\u003c/p\u003e\n\u003cp\u003e“Did your parents paint it purple?”\u003c/p\u003e\n\u003cp\u003eBeau grinned. “Yep, back in the seventies. It was so everyone knew where the orgies were.”\u003c/p\u003e\n\u003cp\u003e“Oh, I heard something about that,” Spencer said, trying to sound nonchalant.\u003c/p\u003e\n\u003cp\u003eBeau snorted. “I’m messing with you. They were both literature professors at Hollis. Their idea of a thrill was reading The Canterbury Tales in Old English. But I heard all the rumors.” He glanced at her knowingly. “Rosewood people love to talk, don’t they? I heard some rumors about you, too, Pretty Little Liar.”\u003c/p\u003e\n\u003cp\u003eSpencer turned away, pretending to be fascinated with a folk art sculpture of a large black rooster. Even though surely everyone in town—in the country—had heard about her ordeal with Real Ali, it was strange that someone like Beau had paid attention. “Most of the rumors aren’t true,” she said quietly.\u003c/p\u003e\n\u003cp\u003e“Of course they aren’t.” Beau strolled toward her. “But it sucks, doesn’t it? Everyone talking. Everyone looking at you.”\u003c/p\u003e\n\u003cp\u003e“It does suck,” she said, surprised Beau had nailed her struggle so succinctly.\u003c/p\u003e\n\u003cp\u003eWhen she looked up, he was staring at her with an enigmatic look on his face. It was almost like he was trying to memorize every inch of her features. Spencer stared back. She hadn’t noticed how green his eyes were before. Or the cute little dimple on his left cheek.\u003c/p\u003e\n\u003cp\u003e“So, um, should we get started?” she asked after an awkward beat.\u003c/p\u003e\n\u003cp\u003eBeau broke his gaze, walked across the room, and settled into a leather chair. “Sure. If you want.”\u003c/p\u003e\n\u003cp\u003eSpencer felt a stab of exasperation. “You told me to come here so you could teach me. So . . . teach me.”\u003c/p\u003e\n\u003cp\u003eBeau tilted the chair back and pressed a hand to his lips. “Well, I think your problem is that you don’t understand Lady Macbeth. You’re just a high school girl regurgitating her lines.”\u003c/p\u003e\n\u003cp\u003eSpencer straightened her spine. “Of course I understand her. She’s determined. She’s ambitious. She gets in over her head. And then she’s plagued by guilt for what she did.”\u003c/p\u003e\n\u003cp\u003e“Where’d you get that from, SparkNotes?” Beau scoffed. “Knowing facts isn’t the same as getting into the character. You have to experience what she experiences and really feel her. That’s Method acting.”\u003c/p\u003e\n\u003cp\u003eSpencer resisted the urge to laugh. “That’s bullshit.”\u003c/p\u003e\n\u003cp\u003eBeau’s eyes flashed. “Maybe you’re scared to really go for it. Method acting can dredge up some demons.”\u003c/p\u003e\n\u003cp\u003e“I’m not scared.” Spencer crossed her arms over her chest.\u003c/p\u003e\n\u003cp\u003eBeau rose from the chair and moved a few steps closer to her. “Okay, so you’re not scared. But you are doing this to get a four-point-oh, aren’t you? Not because you care about acting. Not because you care about the integrity of the play.”\u003c/p\u003e\n\u003cp\u003eHeat rushed to Spencer’s face. “You know what, I don’t need this.” She spun on her heel and started out of the room. Arrogant jerk.\u003c/p\u003e\n\u003cp\u003e“Wait.” Beau clamped his hand on hers and spun her around. “I’m challenging you. I think you’re good, better than you realize. But I also think you can step it up to the next level.”\u003c/p\u003e\n\u003cp\u003eThe sudden scent of sandalwood incense tickled Spencer’s nose. She looked down at Beau’s large, warm fingers tightly entwined around hers. “Y-you think I’m good?” she asked in a voice barely over a whisper.\u003c/p\u003e\n\u003cp\u003e“I think you’re very good,” Beau said in a suddenly tender voice. “But you also have to let go of a lot of things first.”\u003c/p\u003e\n\u003cp\u003e“Let go of what?”\u003c/p\u003e\n\u003cp\u003e“You need to become Lady Macbeth. Go to a special place inside of you to understand her motivations. Feel what she feels. Know what you would do, if faced with her predicament.”\u003c/p\u003e\n\u003cp\u003e“Why does it matter what I would do?” Spencer protested. “She’s the character Shakespeare wrote about. Her lines are there on the page. She helps kill the king and sits silently by while her husband kills off everyone else in his way. Then she freaks.”\u003c/p\u003e\n\u003cp\u003e“Well, wouldn’t you freak if you killed someone and kept terrible secrets?”\u003c/p\u003e\n\u003cp\u003eSpencer looked away, a lump rising in her throat. This was a little too close for comfort. “Of course I would. But I’d never do that.”\u003c/p\u003e\n\u003cp\u003eBeau sighed. “You’re taking this too literally. You’re not Spencer Hastings, good girl, straight-A student, teacher’s pet. You’re Lady Macbeth. Sinister. Conniving. Ambitious. You convinced your husband to murder an innocent man. If it hadn’t been for you, he might not have gone off his rocker. What does it feel like to be responsible for so much damage?”\u003c/p\u003e\n\u003cp\u003eSpencer picked at a loose thread on her cashmere sweater, uncomfortable with Beau’s scrutiny. “How do you become one with Macbeth? Where’s the special place you go to?”\u003c/p\u003e\n\u003cp\u003eBeau looked away. “It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003eSpencer placed her hands on her hips.\u003c/p\u003e\n\u003cp\u003eBeau pressed his lips together. “Fine. If you must know, I was bullied a lot when I was younger.” His voice was pinched. “I thought a lot about getting revenge. That’s where I go. I think about . . . them.”\u003c/p\u003e\n\u003cp\u003eSpencer’s hands went slack at her sides. The words hung heavily in the air. “Do you want to talk about it?”\u003c/p\u003e\n\u003cp\u003eBeau shrugged. “It was these assholes in my eighth-grade homeroom. I wanted to hurt them so badly. It’s not the same as Macbeth’s ambition, but it gets me in the right head space.”\u003c/p\u003e\n\u003cp\u003eHe walked across the living room and spun a large old globe around and around. With his hunched shoulders and heavy head, he almost looked vulnerable. Spencer shifted her weight. “I’m really sorry that happened to you.”\u003c/p\u003e\n\u003cp\u003eThe corners of Beau’s mouth pulled up in a wry smile. “I guess we have something in common, huh? You were bullied, too.”\u003c/p\u003e\n\u003cp\u003eSpencer frowned. She’d never thought of A as a bully, exactly, but it wasn’t far off the mark. And come to think of it, Their Ali bullied them, too . . . even though she was their best friend.\u003c/p\u003e\n\u003cp\u003eShe looked up at Beau and was surprised to see he was staring at her again. They held each other’s gaze for a few long beats. Then, with one swift movement, Beau sprang across the room and pulled Spencer to him. His breath was minty on her cheek. Spencer was certain they were going to kiss. And even crazier, she wanted to.\u003c/p\u003e\n\u003cp\u003eBeau’s face loomed teasingly close. He slid his arms along Spencer’s back and ran his fingers through her hair, which gave her shivers. Then he stepped away. “That’s one way of letting go,” he said softly. “Now, c’mon. We have a lot of work to do.”\u003c/p\u003e\n\u003cp\u003eHe turned and strolled back into the hall. Spencer stared after him, her skin slightly sweaty and her emotions a jumble. She might have let go for a moment, but could she really let go in the way she needed to and connect with Lady Macbeth? It would mean facing what she did to Tabitha. Confronting the guilt. \u003c/p\u003e","sourceLink":"https://allnovel.net/ruthless-pretty-little-liars-10/page-17.html","bookId":2386,"creation":"Oct 5, 2019 10:22:41 AM","modification":"Oct 5, 2019 10:22:41 AM"}
