{"id":107833,"no":31,"title":"Page 31","content":"\u003cp\u003eABBEY DES FONTAINES\u003c/p\u003e\n\u003cp\u003eTHE SENESCHAL STARED INTO GEOFFREY\u0027S EYES AND SAW HATRED. He\u0027d never seen that emotion there before.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve told our new master,\" Geoffrey said, nudging the gun deeper into de Roquefort\u0027s throat, \"to stand still or I will shoot him.\"\u003c/p\u003e\n\u003cp\u003eThe seneschal stepped close and poked a finger beneath the white mantle, into the protective vest. \"If we\u0027d not started the gunfire, you would have, right? The idea was for us to be killed while escaping. That way, your problem is solved. I\u0027m eliminated and you\u0027re the Order\u0027s savior.\"\u003c/p\u003e\n\u003cp\u003eDe Roquefort said nothing.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you came here alone. To finish the job yourself. I saw you lock the dormitory door. You wanted no witnesses.\"\u003c/p\u003e\n\u003cp\u003e\"We must go,\" Geoffrey said.\u003c/p\u003e\n\u003cp\u003eHe realized the danger that endeavor would entail, but doubted if any of the brothers would risk the master\u0027s life. \"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll show you.\"\u003c/p\u003e\n\u003cp\u003eKeeping the gun cocked at de Roquefort\u0027s neck, Geoffrey led his hostage across the dormitory. The seneschal kept his own gun ready and, at the door, released the latch. In the hall stood five armed men. At the sight of their leader in peril, they raised their guns, ready to fire.\u003c/p\u003e\n\u003cp\u003e\"Lower your aim,\" de Roquefort ordered.\u003c/p\u003e\n\u003cp\u003eThe guns stayed pointed.\u003c/p\u003e\n\u003cp\u003e\"I command you to lower your weapons. I want no more bloodshed.\"\u003c/p\u003e\n\u003cp\u003eThe gallant gesture stimulated the desired effect.\u003c/p\u003e\n\u003cp\u003e\"Stand away,\" Geoffrey said.\u003c/p\u003e\n\u003cp\u003eThe brothers took a few steps backward.\u003c/p\u003e\n\u003cp\u003eGeoffrey motioned with the gun and he and de Roquefort stepped out into the hall. The seneschal followed. Bells rang in the distance, signaling one PM. Sext prayers would be ending shortly, and the corridors would once again be filled with robed men.\u003c/p\u003e\n\u003cp\u003e\"We need to move quickly,\" the seneschal made clear.\u003c/p\u003e\n\u003cp\u003eWith his hostage, Geoffrey led the way down the passageway. The seneschal followed, creeping backward, keeping his attention trained on the five brothers.\u003c/p\u003e\n\u003cp\u003e\"Stay there,\" the seneschal made clear to them.\u003c/p\u003e\n\u003cp\u003e\"Do as he says,\" de Roquefort called out, as they turned the corner.\u003c/p\u003e\n\u003cp\u003eDE ROQUEFORT WAS CURIOUS. HOW DID THEY EXPECT TO FLEE the abbey? What had Geoffrey said? I\u0027ll show you. He decided the only way to discover anything was to go with them, which was why he\u0027d ordered his men to stand down.\u003c/p\u003e\n\u003cp\u003eThe seneschal had twice shot him. If he\u0027d not been quick, a third bullet would have found his skull. The stakes had clearly been raised. His captors were on a mission, something he believed involved his predecessor and a subject that he desperately needed to know more about. The Denmark excursion had been less than productive. So far nothing had been learned in Rennes-le-Chateau. And though he\u0027d managed to discredit the former master in death, the old man might have reserved the last laugh.\u003c/p\u003e\n\u003cp\u003eHe also did not like the fact that two men had been wounded. Not the best way to start off his tenure. Brothers strived for order. Chaos was seen as weakness. The last time violence had invaded the abbey\u0027s walls was when angry mobs tried to gain entrance during the French Revolution--but after several died in the attempt, they\u0027d retreated. The abbey was a place of tranquility and refuge. Violence was taught--and sometimes used--but tempered with discipline. The seneschal had demonstrated a total lack of discipline. Stragglers who may have harbored some fleeting loyalty to him would now be won over by his grievous violations to Rule.\u003c/p\u003e\n\u003cp\u003eBut still, where were these two headed?\u003c/p\u003e\n\u003cp\u003eThey continued down the hallways, passing workshops, the library, more empty corridors. He could hear footfalls behind them, the five brothers following, ready to act when the opportunity arose. But there\u0027d be hell to pay if any of them interfered until he said so.\u003c/p\u003e\n\u003cp\u003eThey stopped before a doorway with carved capitals and a simple iron handle.\u003c/p\u003e\n\u003cp\u003eThe master\u0027s quarters.\u003c/p\u003e\n\u003cp\u003eHis chambers.\u003c/p\u003e\n\u003cp\u003e\"In there,\" Geoffrey said.\u003c/p\u003e\n\u003cp\u003e\"Why?\" the seneschal asked. \"We\u0027ll be trapped.\"\u003c/p\u003e\n\u003cp\u003e\"Please, go inside.\"\u003c/p\u003e\n\u003cp\u003eThe seneschal pushed open the door, then engaged the latch after they entered.\u003c/p\u003e\n\u003cp\u003eDe Roquefort was amazed.\u003c/p\u003e\n\u003cp\u003eAnd curious.\u003c/p\u003e\n\u003cp\u003eTHE SENESCHAL WAS CONCERNED. THEY WERE NOW IMPRISONED within the master\u0027s chamber, the only exit a solitary bull\u0027s-eye window that opened to nothing but air. Drops of sweat pebbled his forehead and he swiped the salty moisture from his eyes.\u003c/p\u003e\n\u003cp\u003e\"Sit,\" Geoffrey ordered de Roquefort, and the man took a seat at the desk.\u003c/p\u003e\n\u003cp\u003eThe seneschal surveyed the room. \"I see you\u0027ve already changed things.\"\u003c/p\u003e\n\u003cp\u003eA few more upholstered chairs hugged the walls. A table now stood where there had been nothing before. The bed coverings were different, as were items on the tables and desk.\u003c/p\u003e\n\u003cp\u003e\"This is my home now,\" de Roquefort said.\u003c/p\u003e\n\u003cp\u003eHe noticed the single sheet of paper on the desk, penned in his mentor\u0027s hand. The successor\u0027s message, left as required by Rule. He lifted the typewritten page and read.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; Do you think that what you judge to be imperishable will not perish? You base your hope upon the world, and your god is this life. You do not realize that you will be destroyed. You live in darkness and death, drunk with fire, and full of bitterness. Your mind is deranged because of the smoldering fire within you and you are delighted by the poisoning and beating of your enemies. Darkness has risen over you like the light, for you have exchanged your freedom for slavery. You will fail, that is clear.\u003c/p\u003e\n\u003cp\u003e\"Your master thought passages from the Gospel of Thomas relevant,\" de Roquefort said. \"And he apparently believed that I, not you, would wear the white mantle once he was gone. Surely those words were not meant for his chosen one.\"\u003c/p\u003e\n\u003cp\u003eNo, they weren\u0027t. He wondered why his mentor had so little faith in him, especially when, in the hours before he died, he\u0027d encouraged him to seek high office.\u003c/p\u003e\n\u003cp\u003e\"You should listen to him,\" he made clear.\u003c/p\u003e\n\u003cp\u003e\"His is the advice of a weak soul.\"\u003c/p\u003e\n\u003cp\u003ePounding came from the door. \"Master? Are you there?\" Unless the brothers were prepared to blast their way inside, there existed little danger of the heavy slabs being forced.\u003c/p\u003e\n\u003cp\u003eDe Roquefort stared up at him.\u003c/p\u003e\n\u003cp\u003e\"Answer,\" the seneschal said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine. Stand down.\"\u003c/p\u003e\n\u003cp\u003eGeoffrey moved toward the window and stared out at the waterfall across the gorge.\u003c/p\u003e\n\u003cp\u003eDe Roquefort placed one knee over the other and leaned back in the chair. \"What do you hope to accomplish? This is foolishness.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up.\" But the seneschal was wondering the same thing.\u003c/p\u003e\n\u003cp\u003e\"The master left more words,\" Geoffrey said from across the room.\u003c/p\u003e\n\u003cp\u003eHe and de Roquefort turned as Geoffrey reached into his cassock and produced an envelope. \"This is his true final message.\"\u003c/p\u003e\n\u003cp\u003e\"Give that to me,\" de Roquefort demanded, rising from the chair.\u003c/p\u003e\n\u003cp\u003eGeoffrey leveled his gun. \"Sit.\"\u003c/p\u003e\n\u003cp\u003eDe Roquefort stayed on his feet. Geoffrey cocked the weapon and aimed for the legs. \"The vest will do you no good.\"\u003c/p\u003e\n\u003cp\u003e\"You would kill me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll cripple you.\"\u003c/p\u003e\n\u003cp\u003eDe Roquefort sat. \"You have a brave compatriot,\" he said to the seneschal.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a brother of the Temple.\"\u003c/p\u003e\n\u003cp\u003e\"A shame he will never achieve the oath.\"\u003c/p\u003e\n\u003cp\u003eIf the words were designed to evoke a response in Geoffrey, they failed.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going nowhere,\" de Roquefort told them.\u003c/p\u003e\n\u003cp\u003eThe seneschal watched his ally. Geoffrey was again staring out the window, as if waiting for something.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll enjoy seeing you both punished,\" de Roquefort said.\u003c/p\u003e\n\u003cp\u003e\"I told you to shut up,\" the seneschal said.\u003c/p\u003e\n\u003cp\u003e\"Your master thought himself clever. I know he wasn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe could tell de Roquefort had something more to say. \"Okay, I\u0027ll bite. What is it?\"\u003c/p\u003e\n\u003cp\u003e\"The Great Devise. It\u0027s what consumed him and all of the masters. Each wanted to find it, but none succeeded. Your master spent a lot of time researching the subject, and your young friend over there helped him.\"\u003c/p\u003e\n\u003cp\u003eThe seneschal shot a glance at Geoffrey, but his partner did not turn from the window. He said to de Roquefort, \"I thought you were close to finding it. That\u0027s what you told the conclave.\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003eThe seneschal did not believe him.\u003c/p\u003e\n\u003cp\u003e\"Your young friend over there and the late master were quite a team. I\u0027ve learned that recently they scoured our records with a newfound relish--one that piqued my interest.\"\u003c/p\u003e\n\u003cp\u003eGeoffrey turned and stomped across the bedchamber, stuffing the envelope back into his cassock. \"You\u0027ll learn nothing.\" The voice approached a shout. \"What there is to find is not for you.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" de Roquefort asked. \"And what is there to find?\"\u003c/p\u003e\n\u003cp\u003e\"There will be no triumph for the likes of you. The master was right. You are drunk with fire and full of bitterness.\"\u003c/p\u003e\n\u003cp\u003eDe Roquefort appraised Geoffrey with a stiff countenance. \"You and the master learned something, didn\u0027t you? I know you sent two parcels in the mail, and I even know to whom. I\u0027ve tended to one of the receivers and will shortly tend to the other. Soon I\u0027ll know all that you and he knew.\"\u003c/p\u003e\n\u003cp\u003eGeoffrey\u0027s right arm swung out and the gun he held slammed into de Roquefort\u0027s temple. The master teetered, stunned, then his eyes rolled skyward and he collapsed to the floor.\u003c/p\u003e\n\u003cp\u003e\"Was that necessary?\" the seneschal asked.\u003c/p\u003e\n\u003cp\u003e\"He should be glad that I didn\u0027t shoot him. But the master made me promise I wouldn\u0027t harm the fool.\"\u003c/p\u003e\n\u003cp\u003e\"You and I need to have a serious talk.\"\u003c/p\u003e\n\u003cp\u003e\"First, we have to leave.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think the brothers out in the hall are going to allow that.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not our problem.\"\u003c/p\u003e\n\u003cp\u003eHe could sense something. \"You know the way out of here?\"\u003c/p\u003e\n\u003cp\u003eGeoffrey smiled. \"The master was quite clear.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-templar-legacy-cotton-malone-1/page-31.html","bookId":2232,"creation":"Oct 5, 2019 11:13:33 PM","modification":"Oct 5, 2019 11:13:33 PM"}
