{"id":107849,"no":47,"title":"Page 47","content":"\u003cp\u003eFIFTY-FIVE\u003c/p\u003e\n\u003cp\u003e7:30 AM\u003c/p\u003e\n\u003cp\u003eDE ROQUEFORT THREADED HIS WAY THROUGH THE FOREST OF tall pines, the ground beneath him silvered with white heather. A honey scent hung in the morning air. The rocky clefts of red limestone surrounding him were shrouded by a wispy fog. An eagle soared in and out of the haze, on the prowl for breakfast. He\u0027d eaten his with the brothers, the meal taken in the traditional silence as Scripture was read to them.\u003c/p\u003e\n\u003cp\u003eHe had to give Claridon credit. He\u0027d deciphered the cryptogram with the seven, nine combination and unlocked the secret. Unfortunately, the message was useless. Claridon told him that Lars Nelle had found a cryptogram within an unpublished manuscript by Noel Corbu, the man who\u0027d promulgated much of the fiction about Rennes in the mid-twentieth century. But had Nelle changed the puzzle or had Sauniere? Was the frustrating solution what drove Lars Nelle to suicide? All that effort and when he finally deciphered what Sauniere left, he was told nothing. Was that what Nelle meant when he\u0027d declared There\u0027s absolutely nothing to find?\u003c/p\u003e\n\u003cp\u003eHard to know.\u003c/p\u003e\n\u003cp\u003eBut he was damn well going to find out.\u003c/p\u003e\n\u003cp\u003eA horn blared in the distance from the direction of the castle. The workday was probably about to begin. Ahead, he spied one of his sentries. He\u0027d communicated with the man by cell phone on the trip north from the abbey and learned that all was quiet. Through the trees he caught sight of the chateau, a couple of hundred meters away, bathed in a filtered morning glow.\u003c/p\u003e\n\u003cp\u003eHe approached the brother who reported that an hour ago a group of eleven men and women had arrived on foot from the construction site. All period-dressed. They\u0027d been inside ever since. The second sentinel had reported that the rear of the building remained quiet. No one had entered or left. Plenty of inside movement came two hours ago--lights on in rooms, servant activity. Cassiopeia Vitt herself emerged at one point and walked to the stables, then back.\u003c/p\u003e\n\u003cp\u003e\"There also was activity around one AM,\" the brother said to him. \"Bedroom lights came on, then a downstairs room was lit. About an hour later the lights went off. Seems they all woke up for a while, then went back to sleep.\"\u003c/p\u003e\n\u003cp\u003ePerhaps their night had been as revealing as his own. \"But no one left the house?\"\u003c/p\u003e\n\u003cp\u003eThe man shook his head.\u003c/p\u003e\n\u003cp\u003eHe reached for the radio in his pocket and communicated with the team leader for the ten knights he\u0027d brought with him. They\u0027d parked their vehicles half a mile away and were hiking through the forest toward the chateau. He\u0027d ordered that they quietly ring the building, then await his instruction. He was now informed that all ten were in place. Counting the two already here and himself, thirteen armed men--more than enough to accomplish the task.\u003c/p\u003e\n\u003cp\u003eIronic, he thought. The brothers were once again at war with a Saracen. Seven hundred years ago, Muslims defeated the Christians and retook the Holy Land. Now another Muslim, Cassiopeia Vitt, had involved herself in Order business.\u003c/p\u003e\n\u003cp\u003e\"Master.\"\u003c/p\u003e\n\u003cp\u003eHis attention was diverted to the chateau and the front entrance, where people were exiting, all dressed in the colorful peasant garb of the Middle Ages. The men in plain brown cottes with cords tied about their waists, legs sheathed in dark hose, feet covered by thin shoes. A few sported cockers tied about their ankles. The women wore long gray gowns and heuks tied around their hips with apron strings. Straw hats, broad-brimmed caps, headrails, and hoods covered the heads. Yesterday, he\u0027d noticed how all of the workers at the Givors site wore authentic clothing, part of the anachronistic atmosphere the place was surely designed to evoke. A couple of the workers started jostling with one another in good humor as the group turned and slowly headed for the lane leading back to the castle site.\u003c/p\u003e\n\u003cp\u003e\"Perhaps some sort of meeting,\" the brother standing next to him said. \"They came and are returning to the construction site.\"\u003c/p\u003e\n\u003cp\u003eHe agreed. Cassiopeia Vitt personally oversaw the Givors project, so it was reasonable to assume workers would meet with her.\u003c/p\u003e\n\u003cp\u003e\"How many went in?\"\u003c/p\u003e\n\u003cp\u003e\"Eleven.\"\u003c/p\u003e\n\u003cp\u003eHe counted. The same had exited. Fine. Time to act. He raised the radio to his lips and said, \"Move in.\"\u003c/p\u003e\n\u003cp\u003e\"What are our orders?\" the voice on the other end of the radio asked.\u003c/p\u003e\n\u003cp\u003eHe was tired of toying with his opponent.\u003c/p\u003e\n\u003cp\u003e\"Do what is necessary to contain them until I get inside.\"\u003c/p\u003e\n\u003cp\u003eHe entered the chateau through the kitchen, an enormous room loaded with stainless steel. Fifteen minutes had passed since he gave the order to take the house and the siege had proceeded without a shot. In fact, the occupants had been eating their breakfast when the brothers made their way through the ground floor. Men stationed at all the exits and outside the dining room windows had destroyed any hope of escape.\u003c/p\u003e\n\u003cp\u003eHe was pleased. He did not want to attract any attention.\u003c/p\u003e\n\u003cp\u003eAs he moved through the many rooms, he admired the walls covered in colorful brocade, the painted ceilings, carved pilasters, glass chandeliers, and furniture sheathed in varying shades of damask. Cassiopeia Vitt possessed taste.\u003c/p\u003e\n\u003cp\u003eHe found the dining room and prepared himself to face Mark Nelle. The others would be killed, their bodies buried in the forest, but Mark Nelle and Geoffrey would be returned to face discipline. He needed to make an example of them. The death of the brother in Rennes must be avenged.\u003c/p\u003e\n\u003cp\u003eHe stepped through a spacious foyer and entered the dining room.\u003c/p\u003e\n\u003cp\u003eBrothers ringed the room, their weapons drawn. His gaze raked the long table and he registered six faces.\u003c/p\u003e\n\u003cp\u003eNone of which he recognized.\u003c/p\u003e\n\u003cp\u003eInstead of seeing Cotton Malone, Stephanie Nelle, Mark Nelle, Geoffrey, and Cassiopeia Vitt, the men and women gathered around the table were strangers, all six dressed in jeans and shirts.\u003c/p\u003e\n\u003cp\u003eWorkers from the construction site.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eThey\u0027d escaped right before his eyes.\u003c/p\u003e\n\u003cp\u003eHe contained his rising anger. \"Hold them here until I return,\" he said to one of the knights.\u003c/p\u003e\n\u003cp\u003eHe left the house and calmly strolled down the treed lane toward the car park. Only a few vehicles present this early. But Cotton Malone\u0027s rental, which had been parked there when he arrived earlier, was gone.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eNow he was at a loss, with no idea where they\u0027d gone.\u003c/p\u003e\n\u003cp\u003eOne of the brothers he\u0027d left inside the chateau ran up from behind. He wondered why the man had left his post.\u003c/p\u003e\n\u003cp\u003e\"Master,\" the man said. \"One of the people inside the chateau told me that Cassiopeia Vitt asked them to come to the chateau early today, dressed in their work outfits. Six of them switched clothing and were all told by Vitt to enjoy their breakfast.\"\u003c/p\u003e\n\u003cp\u003eThat much he\u0027d already surmised. What else?\u003c/p\u003e\n\u003cp\u003eThe man handed him a cellular phone. \"That same employee said a note was left that indicated you\u0027d be coming. When you did, he was to give you this phone, along with this.\"\u003c/p\u003e\n\u003cp\u003eHe unfolded and read from a scrap of paper.\u003c/p\u003e\n\u003cp\u003eThe answer has been found. I will call before the sun sets with information.\u003c/p\u003e\n\u003cp\u003eHe needed to know, \"Who wrote this?\"\u003c/p\u003e\n\u003cp\u003e\"The employee said it was left with his change of clothes along with an instruction that it be given directly to you.\"\u003c/p\u003e\n\u003cp\u003e\"How did you get it?\"\u003c/p\u003e\n\u003cp\u003e\"When he mentioned your name, I simply told him I was you and he handed it to me.\"\u003c/p\u003e\n\u003cp\u003eWhat was happening here? Was there a traitor among his enemy? Apparently so. Since he possessed no idea where they\u0027d gone, little choice remained.\u003c/p\u003e\n\u003cp\u003e\"Withdraw the brothers and return to the abbey.\"\u003c/p\u003e\n\u003cp\u003eFIFTY-SIX\u003c/p\u003e\n\u003cp\u003e10:00 AM\u003c/p\u003e\n\u003cp\u003eMALONE MARVELED AT THE PYRENEES, WHICH WERE SO MUCH like the Alps in appearance and majesty. Separating France from Spain, the crests seemed to roll to infinity, each jagged peak crowned with bright snow, the lower elevations a mixture of green slopes and purple crags. Between the summits lay sun-scorched valleys, deep and foreboding, the haunts of Charlemagne, the Franks, Visigoths, and Moors.\u003c/p\u003e\n\u003cp\u003eThey\u0027d taken two cars--his rental and Cassiopeia\u0027s Land Rover, which she kept parked at the construction site. Their exit from the chateau had been clever--the ruse apparently working, since there\u0027d been no tails--and, once away, he\u0027d given both cars a thorough searching for any electronic trackers. He had to give Cassiopeia credit. She was imaginative.\u003c/p\u003e\n\u003cp\u003eAn hour ago, before heading up into the mountains, they\u0027d stopped and purchased clothes at a shopping plaza outside Ax-les-Thermes, a thriving spa resort that catered to hikers and skiers. Their colorful tunics and long gowns had won them some strange looks, but they were now dressed in jeans, shirts, boots, and fleece jackets, ready for what lay ahead.\u003c/p\u003e\n\u003cp\u003eSt. Agulous perched on the rim of a precipice, surrounded by terraced hills, at the end of a narrow highway that corkscrewed a path up through a cloud-dimmed pass. The village, not much larger than Rennes-le-Chateau, was a mass of time-worn limestone buildings that seemed to have merged with the rock beyond.\u003c/p\u003e\n\u003cp\u003eMalone stopped short of entering the town, easing off into the trees, down a narrow dirt lane. Cassiopeia cruised in behind him. They climbed out into sharp mountain air.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think it\u0027s a good idea for all of us to just ride in there,\" he said. \"This doesn\u0027t look like a place that receives a whole lot of tourists.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right,\" Mark said. \"Dad always approached these villages cautiously. Let me and Geoffrey do it. Just a couple of guys out hiking. That\u0027s not unusual for summer.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think I\u0027d make a good impression?\" Cassiopeia asked.\u003c/p\u003e\n\u003cp\u003e\"Making an impression is not your problem,\" Malone said, grinning. \"Getting folks to forget that impression is the problem.\"\u003c/p\u003e\n\u003cp\u003e\"And who put you in charge?\" Cassiopeia asked.\u003c/p\u003e\n\u003cp\u003e\"I did,\" Thorvaldsen declared. \"Mark knows these mountains. He speaks the language. Let him and the brother go.\"\u003c/p\u003e\n\u003cp\u003e\"Then, by all means,\" she said. \"Go.\"\u003c/p\u003e\n\u003cp\u003eMARK LED THE WAY AS HE AND GEOFFREY STROLLED THROUGH the main gate and into a tight plaza shaded by trees. Geoffrey still carried the rucksack with the two books, so they appeared as a couple of hikers out for the afternoon. Pigeons circled above the jumble of black slate roofs, dueling with a blast of wind that whistled through the clefts, shoving clouds northward over the mountains. A fountain in the center of the plaza trickled with water, green with age. No one was in sight.\u003c/p\u003e\n\u003cp\u003eA cobbled street radiating from the plaza was well kept and checkered with scattered sunlight. The tap of horned feet announced the appearance of a shaggy goat, which vanished down another side lane. Mark smiled. Like so many in this region, this was not a clock-driven place.\u003c/p\u003e\n\u003cp\u003eOne vestige of any former glory came from the church, which rose at the end of the plaza. A set of wide narrow steps led up to a Romanesque door. The building itself, though, was more Gothic, its bell tower an odd octagonal shape that immediately arrested Mark\u0027s attention. He could not recall seeing another like it in the region. The size and grandeur of the church spoke of a lost prosperity and power.\u003c/p\u003e\n\u003cp\u003e\"Interesting that a small town like this has a church that size,\" Geoffrey said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen others like it. Five hundred years ago, this was a thriving market center. So a church would have been a must.\"\u003c/p\u003e\n\u003cp\u003eA young woman appeared. Sun freckles gave her the air of a country girl. She smiled, then entered a small general store. Next door stood what appeared to be a post office. Mark wondered about the strange vagary of fate that had apparently preserved St. Agulous from the Saracens, Spaniards, French, and Albigensian Crusaders.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s start in there,\" he said, pointing at the church. \"The local priest may be helpful.\"\u003c/p\u003e\n\u003cp\u003eThey entered a compact nave topped by a star-spangled ceiling of vivid blue. No statuary decorated the plain stone walls. A wooden cross hung above the simple altar. Worn boards, each at least two feet wide, probably hewn centuries ago from the surrounding primeval forest, sheathed the floor and creaked with each step. Where the church at Rennes was animated in obscene detail, an unnatural quiet reigned in this nave.\u003c/p\u003e\n\u003cp\u003eMark noticed Geoffrey\u0027s interest in the ceiling. He knew what he was thinking. The master had worn a robe of blue with gold stars in the last days of his life.\u003c/p\u003e\n\u003cp\u003e\"Coincidence?\" Geoffrey asked.\u003c/p\u003e\n\u003cp\u003e\"I doubt it.\"\u003c/p\u003e\n\u003cp\u003eFrom the shadows near the altar emerged an older man. His crooked shoulders were poorly concealed under a loose brown frock. He walked with a jerky, stooped gait that reminded Mark of a puppet on a string.\u003c/p\u003e\n\u003cp\u003e\"Are you the abbe?\" he asked the man in French.\u003c/p\u003e\n\u003cp\u003e\"Oui, monsieur.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the name of this church?\"\u003c/p\u003e\n\u003cp\u003e\"The Chapel of St. Agulous.\"\u003c/p\u003e\n\u003cp\u003eMark watched as Geoffrey strolled forward, past where they stood, to the first pew before the altar. \"This is a quiet place.\"\u003c/p\u003e\n\u003cp\u003e\"Those who live here belong only to themselves. It is indeed a peaceful location.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been abbe?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, for many years. No one else seems to want to serve here. But I do like it.\"\u003c/p\u003e\n\u003cp\u003eMark recalled what he knew. \"This area was once a hiding place for the Spanish brigands, wasn\u0027t it? They would slip into Spain, terrorize the locals, rob farmhouses, then slip back over the mountains, safe here in France, out of reach of the Spanish.\"\u003c/p\u003e\n\u003cp\u003eThe priest nodded. \"To plunder Spain, they had to live in France. And never once did they touch a Frenchman. But that was a long time ago.\"\u003c/p\u003e\n\u003cp\u003eHe continued to study the church\u0027s austere interior. Nothing suggested that the building harbored any great secret.\u003c/p\u003e\n\u003cp\u003e\"Abbe,\" he said. \"Have you ever heard the name Berenger Sauniere?\"\u003c/p\u003e\n\u003cp\u003eThe older man thought for a moment, then shook his head.\u003c/p\u003e\n\u003cp\u003e\"Is that a name anyone has ever mentioned in this village?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not accustomed to monitoring my parishioners\u0027 conversations.\"\u003c/p\u003e\n\u003cp\u003e\"Nor did I mean to say that you were. But is it a name you recall anyone mentioning?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head again.\u003c/p\u003e\n\u003cp\u003e\"When was this church built?\"\u003c/p\u003e\n\u003cp\u003e\"In 1732. But the first building was erected here in the thirteenth century. Many came after. So unfortunate, but nothing remains from those early structures.\"\u003c/p\u003e\n\u003cp\u003eThe older man\u0027s attention was diverted to Geoffrey, who was still wandering near the altar.\u003c/p\u003e\n\u003cp\u003e\"Does he bother you?\" Mark asked.\u003c/p\u003e\n\u003cp\u003e\"What is he looking for?\"\u003c/p\u003e\n\u003cp\u003eGood question, Mark thought. \"Perhaps he\u0027s in prayer, wanting to be near the altar?\"\u003c/p\u003e\n\u003cp\u003eThe abbe faced him. \"You don\u0027t lie well.\"\u003c/p\u003e\n\u003cp\u003eMark realized the old man standing before him was far smarter than he wanted his listener to believe. \"Why don\u0027t you tell me what I want to know.\"\u003c/p\u003e\n\u003cp\u003e\"You look just like him.\"\u003c/p\u003e\n\u003cp\u003eHe fought to repress his surprise. \"You knew my father?\"\u003c/p\u003e\n\u003cp\u003e\"He came to this area many times. He and I spoke often.\"\u003c/p\u003e\n\u003cp\u003e\"Did he tell you anything?\"\u003c/p\u003e\n\u003cp\u003eThe priest shook his head. \"You know better.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what I\u0027m to do?\"\u003c/p\u003e\n\u003cp\u003e\"Your father told me that if you ever made it here, you should already know what it is for you to do.\"\u003c/p\u003e\n\u003cp\u003e\"You know he\u0027s dead?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. I was told. He took his own life.\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s fanciful thinking. Your father was an unhappy man. He came here looking but, sadly, found nothing. That frustrated him. When I heard that he took his own life, I was not surprised. There was no peace for him on this earth.\"\u003c/p\u003e\n\u003cp\u003e\"He spoke to you about those things?\"\u003c/p\u003e\n\u003cp\u003e\"Many times.\"\u003c/p\u003e\n\u003cp\u003e\"Why did you lie to me about never hearing the name Berenger Sauniere?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t lie. I\u0027ve never heard that name before.\"\u003c/p\u003e\n\u003cp\u003e\"My father never mentioned him?\"\u003c/p\u003e\n\u003cp\u003e\"Not once.\"\u003c/p\u003e\n\u003cp\u003eAnother riddle stood before him, as frustrating and irritating as Geoffrey, who was now walking back toward them. The church surrounding him clearly contained no answers, so he asked, \"What about the abbey of Hildemar, the castle he turned over to Agulous in the tenth century? Is any of that still standing?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. Those ruins still exist. Up in the mountains. Not far.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s no longer an abbey?\"\u003c/p\u003e\n\u003cp\u003e\"Goodness no. It hasn\u0027t been occupied in three hundred years.\"\u003c/p\u003e\n\u003cp\u003e\"Did my father ever mention the place?\"\u003c/p\u003e\n\u003cp\u003e\"He visited there many times, but found nothing. Which only added to his frustration.\"\u003c/p\u003e\n\u003cp\u003eThey needed to go. But he wanted to know, \"Who owns the abbey ruins?\"\u003c/p\u003e\n\u003cp\u003e\"They were bought years ago. By a Dane. Henrik Thorvaldsen.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-templar-legacy-cotton-malone-1/page-47.html","bookId":2232,"creation":"Oct 5, 2019 11:13:33 PM","modification":"Oct 5, 2019 11:13:33 PM"}
