{"id":75994,"no":35,"title":"Page 35","content":"\u003cp\u003eShe got up from bed slowly, alarmed when her head spun and her stomach roiled in protest at the movement.\u003c/p\u003e\n\u003cp\u003e“Morning sickness, my butt,” she muttered beneath her breath. The term was a complete misnomer. She sat quietly and breathed deeply to try and regain her equilibrium. When she felt steadier, she made her way to the door and peeked into the living room. Cal was sitting on the couch, making out with some guy Cleo had never seen before.\u003c/p\u003e\n\u003cp\u003eThey didn’t even notice when Cleo stepped into the room and only—leisurely—ended their kiss when she cleared her throat pointedly.\u003c/p\u003e\n\u003cp\u003e“Hi, hon,” Cal greeted cheerfully. “This is the guy I told you about. Greg.”\u003c/p\u003e\n\u003cp\u003e“Oh, Greg, yes. Cal never stops talking about you,” she lied. Greg—a good-looking guy about ten years Cal’s junior—smiled sweetly. He had stars in his eyes as he looked at Cal. Poor kid.\u003c/p\u003e\n\u003cp\u003eCleo turned toward the kitchen and was gratified to note that Cal had tidied up a bit while she was asleep, probably in anticipation of Greg’s visit. Cal left Greg on the couch and joined Cleo in the kitchen.\u003c/p\u003e\n\u003cp\u003e“Hey, hon, I hope you don’t mind us chilling here for the evening,” he said casually, clearly not really concerned with Cleo’s response. “But Greg still lives at home, so we couldn’t hook up there.”\u003c/p\u003e\n\u003cp\u003e“He lives at home? How old is he?” She looked at Greg again and reevaluated her initial assessment of his age.\u003c/p\u003e\n\u003cp\u003e“Nineteen? Twenty? Something like that.” Cal waved a dismissive hand. “Isn’t he adorable, though?”\u003c/p\u003e\n\u003cp\u003e“Cal, he’s a baby,” Cleo hissed impatiently. She was getting a little fed up with her friend’s casual hookups. “When are you going to stop messing around with these little toy boys and find a decent—age-appropriate—guy?”\u003c/p\u003e\n\u003cp\u003e“Age-appropriate guys aren’t fun and lack stamina,” he whispered smugly. “What Greg lacks in experience, he makes up for in enthusiasm.”\u003c/p\u003e\n\u003cp\u003e“Look, you and young Greg are going to have to go someplace else tonight. I’m expecting guests,” she said, and Cal’s eyebrows rose.\u003c/p\u003e\n\u003cp\u003e“Guests?”\u003c/p\u003e\n\u003cp\u003e“Luc and Blue are coming,” she explained, and Cal rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“They’re hardly guests. They won’t mind if Greg and I are hanging around.”\u003c/p\u003e\n\u003cp\u003e“Cal, I have something really important to discuss with Luc; I just need a bit of privacy.”\u003c/p\u003e\n\u003cp\u003e“Since when do you have secrets from me?” he teased.\u003c/p\u003e\n\u003cp\u003eCleo’s patience just snapped. “Since now, okay?”\u003c/p\u003e\n\u003cp\u003eCal took a step back and his face froze over.\u003c/p\u003e\n\u003cp\u003e“No need to lash out,” he said icily. “Keep your precious secrets. Greg, babe, we’re going out. We’re not welcome here.”\u003c/p\u003e\n\u003cp\u003eThe passive-aggressive comment was so typical of him.\u003c/p\u003e\n\u003cp\u003e“Cal,” she said miserably, and he held up a hand, still not looking at her.\u003c/p\u003e\n\u003cp\u003e“It’s okay, Cleo. This is your flat, and you have every right to want it to yourself sometimes. I’m sure Greg and I will find someplace to go in this weather. Right, babe?” Greg’s pretty blue eyes were wide and confused, but he nodded.\u003c/p\u003e\n\u003cp\u003e“It’s just for a couple of hours,” she explained. “I’ll text you when they leave.”\u003c/p\u003e\n\u003cp\u003e“Whatever.” He shrugged, grabbing his coat. She tried her best to shove aside the guilt as he and the hapless young Greg left. She really didn’t need Cal’s drama right now, but that’s how he always was, and she continually made excuses for him.\u003c/p\u003e\n\u003cp\u003e“Who’s the father?” Luc asked. He had been grim and silent when Cleo told him about her pregnancy and had remained that way for nearly five minutes after she had stuttered to a halt. She had never seen her normally amicable brother so quiet and unreadable before. Blue had filled the silence with slightly nervous chatter about the weather and the new leaks they’d discovered in the roof, all the while darting uncertain glances at Luc like he was a ticking time bomb about to go off. And now, when he finally spoke, his voice was cold enough to freeze the air around him.\u003c/p\u003e\n\u003cp\u003e“His identity is unimportant,” Cleo said, trying to keep her voice from wobbling.\u003c/p\u003e\n\u003cp\u003e“You do know who the father is, right?” The question was designed to wound, and Cleo felt the impact of it like a blow to her sternum. She gasped and folded in on herself defensively.\u003c/p\u003e\n\u003cp\u003e“Lucius Knight!” Blue barked, angrier than Cleo had ever seen her before. “You should be ashamed of yourself.”\u003c/p\u003e\n\u003cp\u003eTo his credit, Luc looked immediately contrite.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Cleo, that was unfair of me,” he mumbled. “I’m just angry and frustrated. I hate to see you in a situation like this, with the loser who got you pregnant having zero accountability.”\u003c/p\u003e\n\u003cp\u003e“It’s my choice, Luc.”\u003c/p\u003e\n\u003cp\u003eHe nodded curtly, his jaw tight. He still looked angry and disappointed, and it killed her to have put that look on his face.\u003c/p\u003e\n\u003cp\u003e“So you’re having it but not sure if you’re keeping it?” he said after a long pause, during which he’d done nothing but stare at her intently and stroke his thumbs restlessly across the back of her hands.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“When do you think you’ll know?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. I have no feelings about this baby one way or another. I just feel trapped and confused and scared and so stupid right now.” Her voice was thick with tears.\u003c/p\u003e\n\u003cp\u003e“Oh, Pattypan,” Luc sighed, and dragged her into his arms for a comforting hug. The childhood nickname—one he’d come up with because she hated her full name—brought tears to her eyes, and she sobbed into his chest, suddenly feeling years younger than her age. “We’ll figure this out. I promise you that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-35.html","bookId":1838,"creation":"Oct 5, 2019 10:37:14 AM","modification":"Oct 5, 2019 10:37:14 AM"}
