{"id":76041,"no":82,"title":"Page 82","content":"\u003cp\u003e“You want my honest opinion?” he asked. They were both ignoring poor Kate’s frantic attempts to get their attention, while Cleo lowered her eyelashes and pretended to consider his question.\u003c/p\u003e\n\u003cp\u003e“Honesty would be appreciated,” she said demurely.\u003c/p\u003e\n\u003cp\u003e“What if it’s a boy?” he asked. “You can’t seriously want to surround the kid with fairies and pixies? That’s girlie stuff!”\u003c/p\u003e\n\u003cp\u003e“No, it’s not!” she argued, quite affronted by this view. “Fairies and pixies sometimes have a dangerous air to them, and they’re appealing to a child of any sex. If it’s a boy and he wants to change his room later, that would be entirely up to him.” He didn’t respond; instead he gazed at her impassively.\u003c/p\u003e\n\u003cp\u003eCleo couldn’t read his expression and wasn’t certain of his mood, especially since he was wearing dark glasses to hide part of his shiner. His lips thinned and he sighed quietly.\u003c/p\u003e\n\u003cp\u003e“Must you argue? You seem to forget that you asked for my opinion,” he said gravely. “Cleo, sometimes you can be so damned . . .”\u003c/p\u003e\n\u003cp\u003e“Frustrating?” she supplied with a sympathetic nod.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Annoying?” she guessed, and he gave her the Look, which shut her up immediately. He really was so super anal about her finishing his sentences.\u003c/p\u003e\n\u003cp\u003e“Cute,” he said with playful smile, and shocked the hell right out of her. “Sometimes you can be so damned cute.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Well, how else was she supposed to respond to that? “Are you flirting with me?” She really couldn’t tell. Dante Damaso did nothing conventionally.\u003c/p\u003e\n\u003cp\u003e“What if I were?” he asked speculatively, and she pondered over that for a moment.\u003c/p\u003e\n\u003cp\u003e“I’d tell you to stop,” she finally replied. “It’s weird.”\u003c/p\u003e\n\u003cp\u003e“Maybe I’m wooing you,” he said.\u003c/p\u003e\n\u003cp\u003e“To what end?”\u003c/p\u003e\n\u003cp\u003e“You know what,” he countered, confirming her worst fear.\u003c/p\u003e\n\u003cp\u003e“Well, stop it at once. I gave you my answer Friday night. It’s not just a no, it’s a hell no.” As if she would marry a man who didn’t love her.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said so casually that she blinked at him uncertainly. His response was unexpectedly easygoing, and it threw her a little.\u003c/p\u003e\n\u003cp\u003e“I’m assuming you have the accompanying pieces to this crib.” He directed the comment to Kate, who’d been watching their exchange with interest.\u003c/p\u003e\n\u003cp\u003e“Uh. Yes. Of course.” She was just way too enthusiastic. Cleo wished the woman would tone it down a bit. She was starting to develop a headache and was questioning the wisdom of coming out so soon after the accident. Her entire body ached, from her shoulders on down. She followed the other two a little sluggishly, and when Kate told them that the matching changing table and dresser were must-haves, she found herself unable to argue with the woman.\u003c/p\u003e\n\u003cp\u003eA stroller, a baby bouncer, a rocking chair, and a car seat later, Cleo—deciding new clothes could wait another day or two—pleaded exhaustion, and Dante, who was also looking a bit pale and peaked, agreed that it was best to head home. She went straight up to bed when they got home and fell asleep almost instantly.\u003c/p\u003e\n\u003cp\u003eHer sleep was restless and filled with disturbing dreams, and when she awoke hours later, it was to an even worse headache. She took a warm bath to try and relax her muscles and ease her tension, and it seemed to work to a certain extent. Her headache had definitely diminished enough for her to face going downstairs to dinner.\u003c/p\u003e\n\u003cp\u003eDante was in the kitchen, cooking something that smelled divine. He smiled when he saw her.\u003c/p\u003e\n\u003cp\u003e“I hope you’re hungry,” he said, and she sat down at the island to watch him. The scene was reminiscent of that first night he’d cooked for her.\u003c/p\u003e\n\u003cp\u003e“I could eat.”\u003c/p\u003e\n\u003cp\u003e“I made some paella, my second stepmother’s recipe. That woman was a genius in the kitchen, which was great, since none of the old man’s other wives bothered. They thought cooking was beneath them, and they married a rich man so cooking was something the chef did.”\u003c/p\u003e\n\u003cp\u003eHe was unusually forthcoming tonight, and Cleo rested her cheek in the palm of her hand and idly traced the pattern of veins on the marble countertop.\u003c/p\u003e\n\u003cp\u003e“Did you like any of your stepmothers?”\u003c/p\u003e\n\u003cp\u003e“That one, Stepmom Number Two? She was my favorite. Taught me a thing or two about cooking. The rest were just . . .” His voice faded as he thought about it. “I don’t know, interchangeable maybe. After Number Two, I stopped trying to get to know them.”\u003c/p\u003e\n\u003cp\u003e“Did you act out?” Cleo asked, thinking of her own rebellious years.\u003c/p\u003e\n\u003cp\u003e“I was a good kid, got the best grades and stayed out of trouble. I didn’t have many friends. I still don’t.” And he’d lost one of his best friends because of her, Cleo thought, swallowing past a lump in her throat. “It was only when I hit puberty that I started getting into fights, and my father thought it best for me to take boxing classes in order to channel that aggression. It worked. One of his more sound parental decisions.”\u003c/p\u003e\n\u003cp\u003e“Do you get along with him?” she asked.\u003c/p\u003e\n\u003cp\u003e“We get along now. He wasn’t too happy when I decided to stay here. However, since I’ve made a success of the business, he’s back in the black and able to fund his current wife-to-be, Carmen’s, spendthrift ways. So he’s come to accept the idea. I love him, he’s my papa, but we’re not friends. If we go a year or more without seeing each other, both of us are fine with that. We’re both happy with a few Skype sessions a year.”\u003c/p\u003e\n\u003cp\u003e“That’s sad.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” he said with a little shrug. “It’s life. Sometimes we get along with our parents, and sometimes we don’t.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-82.html","bookId":1838,"creation":"Oct 5, 2019 10:37:14 AM","modification":"Oct 5, 2019 10:37:14 AM"}
