{"id":68290,"no":13,"title":"Page 13","content":"\u003cp\u003eWhen Teresa opened her eyes, the family doctor and the village priest were standing alongside her bed.\u003c/p\u003e\n\u003cp\u003e\"No!\" she screamed. \"I don\u0027t want to come back. Let me die. Let me die!\"\u003c/p\u003e\n\u003cp\u003eThe priest said, \"Suicide is a mortal sin. God gave you life, Teresa. Only He may decide when it is finished. You are young. You have a whole lifetime ahead of you.\"\u003c/p\u003e\n\u003cp\u003e\"To do what?\" Teresa sobbed. \"Suffer more? I can\u0027t stand the pain I\u0027m in. I can\u0027t stand it!\"\u003c/p\u003e\n\u003cp\u003eHe said gently, \"Jesus stood the pain and died for the rest of us. Don\u0027t turn your back on Him.\"\u003c/p\u003e\n\u003cp\u003eThe doctor finished examining Teresa. \"You need to rest. I\u0027ve told your mother to put you on a light diet for a while.\" He wagged a finger at her. \"That does not include razor blades.\"\u003c/p\u003e\n\u003cp\u003eThe following morning Teresa dragged herself out of bed. When she walked into the drawing room, her mother said in alarm, \"What are you doing up? The doctor told you - \"\u003c/p\u003e\n\u003cp\u003eTeresa said hoarsely, \"I have to go to church. I have to talk to God.\"\u003c/p\u003e\n\u003cp\u003eHer mother hesitated. \"I\u0027ll go with you.\"\u003c/p\u003e\n\u003cp\u003e\"No. I must go alone.\"\u003c/p\u003e\n\u003cp\u003e\"But - \"\u003c/p\u003e\n\u003cp\u003eHer father nodded. \"Let her go.\"\u003c/p\u003e\n\u003cp\u003eThey watched the dispirited figure walk out of the house.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going to happen to her?\" Teresa\u0027s mother moaned.\u003c/p\u003e\n\u003cp\u003e\"God only knows.\"\u003c/p\u003e\n\u003cp\u003eShe entered the familiar church, walked up to the altar, and knelt.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve come to Your house to tell You something, God. I despise You. I despise You for letting me be born ugly. I despise You for letting my sister be born beautiful. I despise You for letting her take away the only man I ever loved. I spit on You.\"\u003c/p\u003e\n\u003cp\u003eHer last words were so loud that people turned to stare at her as she rose and stumbled out of the church.\u003c/p\u003e\n\u003cp\u003eTeresa had never believed there could be such pain. It was unbearable. It was impossible for her to think of anything else. She was unable to eat or sleep. The world seemed muffled and far away. Memories kept flashing into her mind, like scenes from a movie.\u003c/p\u003e\n\u003cp\u003eShe remembered the day she and Raoul and Monique had walked along the beach at Nice.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a beautiful day for a swim,\" Raoul said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to go, but we can\u0027t. Teresa doesn\u0027t swim.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind if you two go ahead. I\u0027ll wait for you at the hotel.\"\u003c/p\u003e\n\u003cp\u003eAnd she had been so pleased that Raoul and Monique were getting along so well together.\u003c/p\u003e\n\u003cp\u003eThey were lunching at a small inn near Cagnes. The maitre d\u0027 said, \"The lobster is particularly good today.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have it,\" Monique said. \"Poor Teresa can\u0027t. Shellfish makes her break out in hives.\"\u003c/p\u003e\n\u003cp\u003eSt. Tropez. \"I miss horseback riding. I used to ride every morning at home. Do you want to ride with me, Teresa?\"\u003c/p\u003e\n\u003cp\u003e\"I - I\u0027m afraid I don\u0027t ride, Raoul.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t mind going with you,\" Monique said. \"I love to ride.\"\u003c/p\u003e\n\u003cp\u003eAnd they had been gone all morning.\u003c/p\u003e\n\u003cp\u003eThere were a hundred clues, and she had missed all of them. She had been blind because she had wanted to be blind. The looks that Raoul and Monique had exchanged, the innocent touching of hands, the whispers and the laughter.\u003c/p\u003e\n\u003cp\u003eHow could I have been so stupid?\u003c/p\u003e\n\u003cp\u003eAt night when Teresa finally managed to doze off, she had dreams. It was always a different dream, but it was always the same dream.\u003c/p\u003e\n\u003cp\u003eRaoul and Monique were on a train, naked, making love, and the train was crossing a trestle high over a canyon, and the trestle collapsed and everyone on the train plunged to their deaths.\u003c/p\u003e\n\u003cp\u003eRaoul and Monique were in a hotel room, naked in bed. Raoul laid down a cigarette and the room exploded into flames, and the two of them were burned to death, and their screams awakened Teresa.\u003c/p\u003e\n\u003cp\u003eRaoul and Monique fell from a mountain, drowned in a river, died in an airplane crash.\u003c/p\u003e\n\u003cp\u003eIt was always a different dream.\u003c/p\u003e\n\u003cp\u003eIt was always the same dream.\u003c/p\u003e\n\u003cp\u003eTeresa\u0027s mother and father were frantic. They watched then-daughter wasting away, and there was nothing they could do to help her. And then suddenly Teresa began to eat. She ate constantly. She could not seem to get enough food. She gained her weight back, and then kept gaining and gaining until her body was gross.\u003c/p\u003e\n\u003cp\u003eWhen her mother and father tried to talk to her about her pain, she said, \"I\u0027m fine now. Don\u0027t worry about me.\"\u003c/p\u003e\n\u003cp\u003eTeresa carried on her life as though nothing were wrong. She continued to go into town and shop and do all the errands she had always done. She joined her mother and father for dinner each evening and read or sewed. She had built an emotional fortress around herself, and she was determined that no one would ever breach it. No man will ever want to look at me. Never again.\u003c/p\u003e\n\u003cp\u003eOutwardly, Teresa seemed fine. Inside, she was sunk in an abyss of deep, desperate loneliness. Even when she was surrounded by people, she sat in a lonely chair in a lonely room, in a lonely house, in a lonely world.\u003c/p\u003e\n\u003cp\u003eA little over a year after Raoul had left Teresa, her father was packing to leave for avila.\u003c/p\u003e\n\u003cp\u003e\"I have some business to transact there,\" he told Teresa. \"But after that, I\u0027ll be free. Why don\u0027t you come with me? avila is a fascinating town. It will do you good to get away from here for a while.\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you, Father.\"\u003c/p\u003e\n\u003cp\u003eHe looked at his wife and sighed. \"Very well.\"\u003c/p\u003e\n\u003cp\u003eThe butler walked into the drawing room.\u003c/p\u003e\n\u003cp\u003e\"Excuse me, Miss De Fosse. This letter just arrived for you.\"\u003c/p\u003e\n\u003cp\u003eEven before Teresa opened it, she was filled with a prescience of something terrible looming before her.\u003c/p\u003e\n\u003cp\u003eThe letter read:\u003c/p\u003e\n\u003cp\u003eTeresa, my darling Teresa:\u003c/p\u003e\n\u003cp\u003eGod knows I do not have a right to call you darling, after the terrible thing I have done, but I promise to make it up to you if it takes me a lifetime. I don\u0027t know where to begin.\u003c/p\u003e\n\u003cp\u003eMonique has run off and left me with our two-month-old daughter. Frankly, I am relieved. I must confess that I have been in hell ever since the day I left you. I will never understand why I did what I did. I seem to have been caught up in some kind of magic spell of Monique\u0027s, but I knew from the beginning that my marriage to her was a terrible mistake. It was you I always loved. I know now that the only place I can find my happiness is at your side. By the time you receive this letter, I will be on my way back to you.\u003c/p\u003e\n\u003cp\u003eI love you, and I have always loved you, Teresa. For the sake of the rest of our lives together, I beg your forgiveness. I want...\u003c/p\u003e\n\u003cp\u003eShe could not finish reading the letter. The thought of seeing Raoul again and his and Monique\u0027s baby was unthinkable, obscene.\u003c/p\u003e\n\u003cp\u003eShe threw the letter down, hysterical.\u003c/p\u003e\n\u003cp\u003e\"I must get out of here,\" Teresa screamed. \u0027Tonight. Now. Please...please!\"\u003c/p\u003e\n\u003cp\u003eIt was impossible for her parents to calm her.\u003c/p\u003e\n\u003cp\u003e\"If Raoul is coming here,\" her father said, \"you should at least talk to him.\"\u003c/p\u003e\n\u003cp\u003e\"No! If I see him, I\u0027ll kill him.\" She grabbed her father\u0027s arms, tears streaming down her face. \"Take me with you,\" she pleaded.\u003c/p\u003e\n\u003cp\u003eShe would go anywhere, as long as she escaped from this place.\u003c/p\u003e\n\u003cp\u003eAnd so that evening Teresa and her father set out for avila.\u003c/p\u003e\n\u003cp\u003eTeresa\u0027s father was distraught over his daughter\u0027s unhappiness. He was not by nature a compassionate man, but in the past year Teresa had won his admiration with her courageous behavior. She had faced the townspeople with her head held high and had never complained. He felt helpless, unable to console her.\u003c/p\u003e\n\u003cp\u003eHe remembered how much solace she had once found in church, and when they arrived in avila he said to Teresa, \"Father Berrendo, the priest here, is an old friend of mine. Perhaps he can help you. Will you speak to him?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She would have nothing to do with God.\u003c/p\u003e\n\u003cp\u003eTeresa stayed in the hotel room alone while her father conducted his business. When he returned, she was seated in the same chair, staring at the walls.\u003c/p\u003e\n\u003cp\u003e\"Teresa, please see Father Berrendo.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHe was at a loss. She refused to leave the hotel room, and she refused to return to eze.\u003c/p\u003e\n\u003cp\u003eAs a last resort, the priest came to see Teresa.\u003c/p\u003e\n\u003cp\u003e\"Your father tells me that you once attended church regularly.\"\u003c/p\u003e\n\u003cp\u003eTeresa looked into the eyes of the frail-looking priest and said coldly, \"I\u0027m no longer interested. The Church has nothing to offer me.\"\u003c/p\u003e\n\u003cp\u003eFather Berrendo smiled. \"The Church has something to offer everyone, my child. The Church gives us hope and dreams...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve had my fill of dreams. Never again.\"\u003c/p\u003e\n\u003cp\u003eHe took her hands in his thin hands and saw the white scars of razor slashes on her wrists, as faint as a long-ago memory.\u003c/p\u003e\n\u003cp\u003e\"God doesn\u0027t believe that. Talk to Him and He will tell you.\"\u003c/p\u003e\n\u003cp\u003eTeresa just sat there, staring at the wall, and when the priest finally made his way out of the room, she was not even aware of it.\u003c/p\u003e\n\u003cp\u003eThe following morning Teresa walked into the cool, vaulted church, and almost immediately the old, familiar feeling of peace stole over her. The last time she had been in a church was to curse God. A feeling of deep shame filled her. It was her own weakness that had betrayed her, not God.\u003c/p\u003e\n\u003cp\u003e\"Forgive me,\" she whispered. \"I have sinned. I have lived in hate. Help me. Please help me.\"\u003c/p\u003e\n\u003cp\u003eShe looked up, and Father Berrendo was standing there. When she finished, he led her into his office behind the vestry.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what to do, Father. I don\u0027t believe in anything anymore. I\u0027ve lost faith.\" Her voice was filled with despair.\u003c/p\u003e\n\u003cp\u003e\"Did you have faith when you were a young girl?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Very much.\"\u003c/p\u003e\n\u003cp\u003e\"Then you still have it, my child. Faith is real and permanent. It is everything else that is transient.\"\u003c/p\u003e\n\u003cp\u003eThey talked that day for hours.\u003c/p\u003e\n\u003cp\u003eWhen Teresa returned to the hotel late in the afternoon, her father said, \"I must get back to eze. Are you ready to leave?\"\u003c/p\u003e\n\u003cp\u003e\"No, Papa. Let me stay here for a while.\"\u003c/p\u003e\n\u003cp\u003eHe hesitated. \"Will you be all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Father. I promise.\"\u003c/p\u003e\n\u003cp\u003eTeresa and Father Berrendo met every day after that. The priest\u0027s heart went out to Teresa. He saw in her not a fat, unattractive woman, but a beautiful, unhappy spirit. They spoke of God and creation and the meaning of life, and slowly, almost in spite of herself, Teresa began to find comfort again. Something that Father Berrendo said one day triggered a deep response in her.\u003c/p\u003e\n\u003cp\u003e\"My child, if you do not believe in this world, then believe in the next world. Believe in the world where Jesus is waiting to receive you.\"\u003c/p\u003e\n\u003cp\u003eAnd for the first time since the day that was supposed to have been her wedding day, Teresa began to feel at peace again. The church had become her haven, just as it had once been. But there was her future to think about.\u003c/p\u003e\n\u003cp\u003e\"I have no place to go.\"\u003c/p\u003e\n\u003cp\u003e\"You could return home.\"\u003c/p\u003e\n\u003cp\u003e\"No. I could never go back there. I could never face Raoul again. I don\u0027t know what to do. I want to hide, and there is no place to hide.\"\u003c/p\u003e\n\u003cp\u003eFather Berrendo was silent for a long time. Finally he spoke. \"You could stay here.\"\u003c/p\u003e\n\u003cp\u003eShe looked around the office, puzzled. \"Here?\"\u003c/p\u003e\n\u003cp\u003e\"The Cistercian convent is nearby.\" He leaned forward. \"Let me tell you about it. It is a world inside a world, where everyone is dedicated to God. It is a place of peace and serenity.\"\u003c/p\u003e\n\u003cp\u003eAnd Teresa\u0027s heart began to lift. \"It sounds wonderful.\"\u003c/p\u003e\n\u003cp\u003e\"I must caution you. It is one of the strictest orders in the world. Those who are admitted take a vow of chastity, silence, and obedience. No one who enters there ever leaves.\"\u003c/p\u003e\n\u003cp\u003eThe words sent a thrill through Teresa. \"I will never want to leave. It is what I have been searching for, Father. I despise the world I live in.\"\u003c/p\u003e\n\u003cp\u003eBut Father Berrendo was still concerned. He knew that Teresa would be facing a life totally different from anything she had ever experienced.\u003c/p\u003e\n\u003cp\u003e\"There can be no turning back.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t turn back.\"\u003c/p\u003e\n\u003cp\u003eEarly the next day, Father Berrendo took Teresa to the convent to meet the Reverend Mother Betina. He left the two of them there to talk.\u003c/p\u003e\n\u003cp\u003eThe moment Teresa entered the convent, she knew. At last, she thought exultantly. At last\u003c/p\u003e\n\u003cp\u003eAfter the meeting she eagerly telephoned her mother and father.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been so worried,\" her mother said. \"When are you coming home?\"\u003c/p\u003e\n\u003cp\u003e\"I am home.\"\u003c/p\u003e\n\u003cp\u003eThe bishop of avila performed the rite:\u003c/p\u003e\n\u003cp\u003e\"Creator, Lord, send thy benediction upon thy handmaid that she shall be fortified with celestial virtue, that she may maintain complete faith and unbroken fidelity.\"\u003c/p\u003e\n\u003cp\u003eTeresa responded, \"The kingdom of this world and all secular adornings I have despised for the love of our Lord, Jesus Christ.\"\u003c/p\u003e\n\u003cp\u003eThe bishop made the sign of the cross over her.\u003c/p\u003e\n\u003cp\u003e\"De largitatis tuae fonte defluxit ut cum honorem nuptiarum nulla interdicta minuissent ac super sanctum conjugium nuptialis benedictio permanent existerent conubium, concupiscerent sacramentum, nec imitarentur quod nuptiis agitur, sed diligerent quod nuptiis praenotatur. Amen.\"\u003c/p\u003e\n\u003cp\u003e\"Amen.\"\u003c/p\u003e\n\u003cp\u003e\"I espouse thee to Jesus Christ, the son of the Supreme Father. Therefore receive the seal of the Holy Ghost, so that thou be called the spouse of God, and if thou serve him faithfully, be crowned everlastingly.\" The bishop rose. \"God, the Father Almighty, Creator of heaven and earth, who hath vouchsafed to choose you to an espousalship like that of the blessed Mary, mother of our Lord, Jesus Christ - ad beatae Mariae, matris Domini nostri, Jesu Christi, consortium - hallow you, that in the presence of God and of His angels, you may persevere, untouched and undefiled, and hold to your purpose, love, chastity, and keep patience that you may merit to receive the crown of His blessing, through the same Christ our Lord. God make you strong when frail, strengthen you when weak, relieve and govern your mind with piety, and direct your ways. Amen.\"\u003c/p\u003e\n\u003cp\u003eNow, thirty years later, lying in the woods watching the sun come up over the horizon, Sister Teresa thought: I came to the convent for all the wrong reasons I was not running to God. I was running away from the world. But God read my heart.\u003c/p\u003e\n\u003cp\u003eShe was sixty years old, and the last thirty years of her life had been the happiest she had ever known. Now she had suddenly been flung back into the world she had run away from. And her mind was playing strange tricks on her.\u003c/p\u003e\n\u003cp\u003eShe was no longer sure what was real and what was unreal. The past and the present seemed to be blending together in a strange, dizzying blur. Why is this happening to me? What does God have planned for me? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sands-of-time/page-13.html","bookId":2361,"creation":"Oct 5, 2019 10:08:56 AM","modification":"Oct 5, 2019 10:08:56 AM"}
