{"id":68305,"no":28,"title":"Page 28","content":"\u003cp\u003eLucia Carmine paused outside the tabema in Aranda de Duero and took a deep breath. Through the window she could see Rubio Arzano seated inside, waiting for her.\u003c/p\u003e\n\u003cp\u003eI must not let him suspect, she thought. At eight o\u0027clock I\u0027ll have a new passport and be on my way to Switzerland.\u003c/p\u003e\n\u003cp\u003eShe forced a smile and entered the taberna. Rubio grinned in relief when he saw her, and as he rose, the look in his eyes gave Lucia a pang.\u003c/p\u003e\n\u003cp\u003e\"I was very worried, querida. When you were gone for so long, I was afraid something terrible had happened to you.\"\u003c/p\u003e\n\u003cp\u003eLucia put her hand over his. \"Nothing happened.\" Except that I\u0027ve bought my way to freedom. I\u0027ll be out of the country tomorrow.\u003c/p\u003e\n\u003cp\u003eRubio sat there looking into her eyes, holding her hand, and there was such an intense feeling of love coming from him that Lucia felt uneasy. Doesn\u0027t he know it could never work? No. Because I haven\u0027t the courage to tell him. He\u0027s not in love with me. He\u0027s in love with the woman he thinks I am. He\u0027ll be much better off without me.\u003c/p\u003e\n\u003cp\u003eShe turned away and looked around the room for the first time. It was filled with locals. Most of them seemed to be staring at the two strangers.\u003c/p\u003e\n\u003cp\u003eOne of the young men in the cafe started to sing and others joined in. A man walked over to the table where Lucia and Rubio were sitting.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not singing, senor. Join us.\"\u003c/p\u003e\n\u003cp\u003eRubio shook his head. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the problem, amigo?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your song.\" Rubio saw the puzzled expression on Lucia\u0027s face, and explained. \"It is one of the old songs praising Franco.\"\u003c/p\u003e\n\u003cp\u003eOther men began to gather around the table. It was obvious that they had been drinking.\u003c/p\u003e\n\u003cp\u003e\"You were against Franco, senor?\"\u003c/p\u003e\n\u003cp\u003eLucia saw Rubio\u0027s fists clench. Oh, God, not now. He mustn\u0027t start anything that will attract attention.\u003c/p\u003e\n\u003cp\u003eShe said to him warningly, \"Rubio...\"\u003c/p\u003e\n\u003cp\u003eAnd, thank God, he understood.\u003c/p\u003e\n\u003cp\u003eHe looked up at the young men and said pleasantly, \"I have nothing against Franco. I just don\u0027t know the words.\"\u003c/p\u003e\n\u003cp\u003e\"Ah. Then we\u0027ll all hum the song together.\"\u003c/p\u003e\n\u003cp\u003eThey stood there waiting for Rubio to refuse.\u003c/p\u003e\n\u003cp\u003eHe glanced at Lucia. \"Bueno.\"\u003c/p\u003e\n\u003cp\u003eThe men began to sing again, and Rubio hummed loudly. Lucia could feel the tension in him as he held himself under control. He\u0027s doing this for me.\u003c/p\u003e\n\u003cp\u003eWhen the song ended, a man slapped him on the back. \"Not bad, old man. Not bad at all.\"\u003c/p\u003e\n\u003cp\u003eRubio sat there, silently willing them to go away.\u003c/p\u003e\n\u003cp\u003eOne of the men saw the package in Lucia\u0027s lap.\u003c/p\u003e\n\u003cp\u003e\"What are you hiding there, querida?\"\u003c/p\u003e\n\u003cp\u003eHis companion said, \"I\u0027ll bet she\u0027s got something better than that up her skirt.\"\u003c/p\u003e\n\u003cp\u003eThe men laughed.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you pull your panties down and show us what you\u0027ve got there?\"\u003c/p\u003e\n\u003cp\u003eRubio sprang to his feet and grabbed one of the men by the throat. He punched him so hard that he flew across the room, breaking a table.\u003c/p\u003e\n\u003cp\u003e\"No!\" Lucia screamed. \"Don\u0027t!\"\u003c/p\u003e\n\u003cp\u003eBut it was too late. In an instant it became a free-for-all, with everybody eagerly joining in. A wine bottle shattered the glass behind the bar. Chairs and tables were knocked over as men went flying through the air, screaming curses. Rubio knocked down two men and a third ran toward him and hit him in the stomach. He gave a grunt of pain.\u003c/p\u003e\n\u003cp\u003e\"Rubio! Let\u0027s get out of here!\" Lucia screamed.\u003c/p\u003e\n\u003cp\u003eHe nodded. He was clutching his stomach. They pushed their way through the melee and found themselves outside on the street.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to get away,\" Lucia said.\u003c/p\u003e\n\u003cp\u003eYou will have your passport tonight. Come back after eight o\u0027clock.\u003c/p\u003e\n\u003cp\u003eShe had to find a place to hide until then. Damn him! Why couldn\u0027t he have controlled himself?\u003c/p\u003e\n\u003cp\u003eThey turned down Calle Santa Maria, and the noises of the fight behind them gradually diminished. Two blocks away they came to a large church, the Iglesia Santa Maria. Lucia ran up the steps, opened the door, and peered inside. The church was deserted.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be safe in here,\" she said.\u003c/p\u003e\n\u003cp\u003eThey walked into the dimness of the church, Rubio still holding his stomach.\u003c/p\u003e\n\u003cp\u003e\"We can rest for a while.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eRubio let his hand fall away from his stomach, and blood came gushing out.\u003c/p\u003e\n\u003cp\u003eLucia felt sick. \"My God! What happened?\"\u003c/p\u003e\n\u003cp\u003e\"A knife,\" Rubio whispered. \"He used a knife.\" He slumped to the floor.\u003c/p\u003e\n\u003cp\u003eLucia knelt at his side, panicky. \"Don\u0027t move.\"\u003c/p\u003e\n\u003cp\u003eShe removed his shirt and pressed it against his stomach, trying to stem the flow of blood. Rubio\u0027s face was chalk white.\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t have fought them, you idiot,\" Lucia said angrily.\u003c/p\u003e\n\u003cp\u003eHis voice was a slurred whisper. \"I could not let them speak to you that way.\"\u003c/p\u003e\n\u003cp\u003eI could not let them speak to you that way.\u003c/p\u003e\n\u003cp\u003eLucia was touched as she had never been touched before. She stood there staring at him and thought: How many times has this man risked his life for me?\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t let you die,\" she said fiercely. \"I\u0027m not going to let you die.\" She stood up abruptly. \"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eShe found water and towels in the priest\u0027s changing room in the rear of the church and she bathed Rubio\u0027s wound. His face was hot to the touch, and his body was soaked in perspiration. Lucia put cold towels on his forehead. Rubio\u0027s eyes were closed and he seemed to be asleep. She cradled his head in her arms and talked to him. It did not matter what she said. She was talking to keep him alive, forcing him to hold on to the thin thread of his existence. She babbled on, afraid to stop for even a second.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll work your farm together, Rubio. I want to meet your mother and sisters. Do you think they\u0027ll like me? I want them to, so much. And I\u0027m a good worker, caro. You\u0027ll see. I\u0027ve never worked on a farm, but I\u0027ll learn. We\u0027ll make it the best farm in all of Spain.\"\u003c/p\u003e\n\u003cp\u003eShe spent the afternoon talking to him, bathing his fevered body, changing the dressing. The bleeding had almost stopped.\u003c/p\u003e\n\u003cp\u003e\"You see, carol You\u0027re getting better. You\u0027re going to be well. I told you. You and I will have such a wonderful life together, Rubio. Only, please don\u0027t die. Please!\"\u003c/p\u003e\n\u003cp\u003eShe found that she was weeping.\u003c/p\u003e\n\u003cp\u003eLucia watched the afternoon shadows paint the church walls through the stained-glass windows and slowly fade away. The setting sun dimmed the sky and finally it was dark. She changed Rubio\u0027s bandage again and, so close that it startled her, the church ell began to ring. She held her breath and counted. One...three...five...seven...eight. Eight o\u0027clock. It was calling her, telling her it was time to return to the Casa de Empenos. Time to escape from this nightmare and save herself.\u003c/p\u003e\n\u003cp\u003eShe knelt down beside Rubio and felt his forehead again. He was burning with fever. His body was soaked with perspiration and his breathing was shallow and rasping. She could see no sign of bleeding, but that could mean he was bleeding internally. Goddamn it. Save yourself, Lucia.\u003c/p\u003e\n\u003cp\u003e\"Rubio...darling...\"\u003c/p\u003e\n\u003cp\u003eHe opened his eyes, only half conscious.\u003c/p\u003e\n\u003cp\u003e\"I have to leave for a little while,\" Lucia said.\u003c/p\u003e\n\u003cp\u003eHe gripped her hand. \"Please...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" she whispered. \"I\u0027ll be back.\"\u003c/p\u003e\n\u003cp\u003eShe rose and took a long last look at him. I can\u0027t help him, she thought.\u003c/p\u003e\n\u003cp\u003eShe picked up the gold cross and turned and hurried out the church door, her eyes filled with tears. She stumbled out onto the street and began to walk rapidly, heading toward the pawnshop. The man and his cousin would be there waiting for her with her passport to freedom. In the morning, when church services begin, they\u0027ll find Rubio and get him to a doctor. They\u0027ll treat him and he\u0027ll get well Except that he will not live through the night, Lucia thought. Well, that\u0027s not my problem.\u003c/p\u003e\n\u003cp\u003eThe Casa de Empenos was just ahead. She was only a few minutes late. She could see that the lights were on in the shop. The men were waiting for her.\u003c/p\u003e\n\u003cp\u003eShe began to walk faster, then she was running. She crossed the street and burst through the open door.\u003c/p\u003e\n\u003cp\u003eInside the police station, a uniformed officer was behind the desk. He looked up as Lucia appeared.\u003c/p\u003e\n\u003cp\u003e\"I need you,\" Lucia cried. \"A man has been stabbed. He may be dying.\"\u003c/p\u003e\n\u003cp\u003eThe policeman did not ask questions. He picked up a telephone and spoke into it. When he put the phone down, he said, \"Someone will be with you in a moment.\"\u003c/p\u003e\n\u003cp\u003eTwo detectives appeared almost immediately.\u003c/p\u003e\n\u003cp\u003e\"Someone has been stabbed, senorita\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Please follow me. Hurry!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll pick up the doctor on the way,\" one of the detectives said. \"Then you can take us to your friend.\"\u003c/p\u003e\n\u003cp\u003eThey picked up the doctor at his home and Lucia hurried the group to the church.\u003c/p\u003e\n\u003cp\u003eWhen they entered the church the doctor walked over to the still figure on the floor and knelt beside him.\u003c/p\u003e\n\u003cp\u003eA moment later he looked up. \"He\u0027s alive, but barely. I\u0027ll call for an ambulance.\"\u003c/p\u003e\n\u003cp\u003eLucia sank to her knees and said silently, Thank you, God. I\u0027ve done all I can. Now let me get away safely and I\u0027ll never bother you again.\u003c/p\u003e\n\u003cp\u003eOne of the detectives had been staring at Lucia all the way to the church. She looked so familiar. And then he suddenly realized why. She bore an uncanny resemblance to the picture in the Red, the top-priority circulation from Interpol.\u003c/p\u003e\n\u003cp\u003eThe detective whispered something to his companion and they both turned to study her. Then the two of them walked over to Lucia.\u003c/p\u003e\n\u003cp\u003e\"Excuse me, senorita. Would you be good enough to come back to the station with us? We have a few questions we wish to ask you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sands-of-time/page-28.html","bookId":2361,"creation":"Oct 5, 2019 10:08:56 AM","modification":"Oct 5, 2019 10:08:56 AM"}
