{"id":68307,"no":30,"title":"Page 30","content":"\u003cp\u003eThere was a link missing, a clue to the past, and Alan Tucker was determined to find it. There had been no mention in the newspaper of a baby being abandoned, but it should be easy enough to find out the date it was brought to the orphanage. If the date coincided with the time of the plane crash, Ellen Scott would have some interesting explaining to do. She couldn\u0027t be that stupid, Alan Tucker thought. To risk pretending that the Scott heiress was dead, and then leave her on the doorstep of a farmhouse. Risky. Very risky. On the other hand, look at the reward: Scott Industries. Yes, she could have pulled it off. If it is a skeleton in her closet, it\u0027s a live one, and it\u0027s going to cost her plenty.\u003c/p\u003e\n\u003cp\u003eTucker knew that he had to be very careful. He had no illusion about whom he was dealing with. He was confronting raw power. He knew he had to have all the evidence in hand before he made his move.\u003c/p\u003e\n\u003cp\u003eHis first stop was another visit with Father Berrendo.\u003c/p\u003e\n\u003cp\u003e\"Father - I would like to speak to the farmer and his wife, where Patricia - Megan was dropped off.\"\u003c/p\u003e\n\u003cp\u003eThe old priest smiled. \"I hope your conversation with them will not take place for a long time.\"\u003c/p\u003e\n\u003cp\u003eTucker stared at him. \"You mean - ?\"\u003c/p\u003e\n\u003cp\u003e\"They died many years ago.\"\u003c/p\u003e\n\u003cp\u003eDamn. But there had to be other avenues to explore. \"You said the baby was taken to a hospital with pneumonia?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eThere would be records there. \"Which hospital was it?\"\u003c/p\u003e\n\u003cp\u003e\"It burned down in 1961. There is a new hospital now.\" He saw the look of dismay on his visitor\u0027s face. \"You must remember, senor, that the information you are seeking goes back twenty-eight years. Many things have changed.\"\u003c/p\u003e\n\u003cp\u003eNothing\u0027s going to stop me, Tucker thought. Not when I\u0027ve come this close. There must be a file on her somewhere.\u003c/p\u003e\n\u003cp\u003eThere was still one place left to investigate: the orphanage.\u003c/p\u003e\n\u003cp\u003eHe was reporting daily now to Ellen Scott.\u003c/p\u003e\n\u003cp\u003e\"Keep me informed of every development. I want to know the moment the girl is found.\"\u003c/p\u003e\n\u003cp\u003eAnd Alan Tucker wondered about the urgency in her voice.\u003c/p\u003e\n\u003cp\u003eShe seems in an awful big rush over something that happened all those years ago. Why? Well, that can wait. First I have to get the proof I\u0027m looking for.\u003c/p\u003e\n\u003cp\u003eThat morning Alan Tucker visited the orphanage. He looked around the dreary community room where a noisy, chattering group of children were playing, and he thought: This is where the heiress to the Scott dynasty grew up, while that bitch in New York kept all the money and all the power. Well, she\u0027s going to share some of that with yours truly. Yes, sir, we\u0027ll make a great team, Ellen Scott and me.\u003c/p\u003e\n\u003cp\u003eA young woman came up to him and said, \"May I help you, senor?\"\u003c/p\u003e\n\u003cp\u003eHe smiled. Yeah. You can help me to about a billion dollars. \"I\u0027d like to talk to whoever\u0027s in charge here.\"\u003c/p\u003e\n\u003cp\u003e\"That would be Senora Angeles.\"\u003c/p\u003e\n\u003cp\u003e\"Is she here?\"\u003c/p\u003e\n\u003cp\u003e\"Si, senor. I will take you to her.\"\u003c/p\u003e\n\u003cp\u003eHe followed the woman through the main hall to a small office at the rear of the building.\u003c/p\u003e\n\u003cp\u003e\"Go in, please.\"\u003c/p\u003e\n\u003cp\u003eAlan Tucker entered the office. The woman seated behind the desk was in her eighties. She had once been a very large woman, but her frame had shrunk, so she looked as though her body had at one time belonged to someone else. Her hair was gray and thin, but her eyes were bright and clear.\u003c/p\u003e\n\u003cp\u003e\"Good morning, senor. May I help you? You have come to adopt one of our lovely children? We have so many delightful ones to choose from.\"\u003c/p\u003e\n\u003cp\u003e\"No, senora. I have come to inquire about a child who was left here many years ago.\"\u003c/p\u003e\n\u003cp\u003eMercedes Angeles frowned. \"I do not understand.\"\u003c/p\u003e\n\u003cp\u003e\"A baby girl was brought in here\" - he pretended to consult a piece of paper - \"in October of 1947.\"\u003c/p\u003e\n\u003cp\u003e\"That is so long ago. She would not be here now. You see, we have a rule, senor, that at the age of fifteen - \"\u003c/p\u003e\n\u003cp\u003e\"No, senora. I know she\u0027s not here. What I wish to know is the exact date she was brought here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I cannot help you, senor.\"\u003c/p\u003e\n\u003cp\u003eHis heart sank.\u003c/p\u003e\n\u003cp\u003e\"You see, so many children are brought in here. Unless you know her name - \"\u003c/p\u003e\n\u003cp\u003ePatricia Scott, he thought. Aloud, he said, \"Megan. Her name is Megan.\"\u003c/p\u003e\n\u003cp\u003eMercedes Angeles\u0027s face lit up. \"No one could forget that child. She was a devil, and everyone adored her. Do you know that one day she - \"\u003c/p\u003e\n\u003cp\u003eAlan Tucker had no time for anecdotes. His instincts told him how close he was to getting hold of a piece of the Scott fortune. And this gabby old woman was the key to it. I must be patient with her. \"Senora Angeles - I don\u0027t have much time. Would you have that date in your files?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, senor. We are commanded by the state to keep very accurate records.\"\u003c/p\u003e\n\u003cp\u003eTucker\u0027s heart lifted. I should have brought a camera to take a picture of the file. Never mind. I\u0027ll have it photocopied. \"Could I see that file, senora?\"\u003c/p\u003e\n\u003cp\u003eShe frowned. \"I don\u0027t know. Our records are confidential and - \"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Tucker said smoothly, \"and I certainly respect that. You said you were fond of little Megan, and I know you\u0027d want to do anything you could to help her. Well, that\u0027s why I\u0027m here. I have some good news for her.\"\u003c/p\u003e\n\u003cp\u003e\"And for this you need the date she was brought in here?\"\u003c/p\u003e\n\u003cp\u003eHe said glibly, \"That\u0027s just so I\u0027ll have the proof that she\u0027s the person I think she is. Her father died and left her a small inheritance, and I want to make sure she gets it.\"\u003c/p\u003e\n\u003cp\u003eThe woman nodded wisely. \"I see.\"\u003c/p\u003e\n\u003cp\u003eTucker pulled a roll of bills from his pocket. \"And to show my appreciation for the trouble I\u0027ve put you to, I\u0027d like to contribute a hundred dollars to your orphanage.\"\u003c/p\u003e\n\u003cp\u003eShe was looking at the roll of bills, an uncertain expression on her face.\u003c/p\u003e\n\u003cp\u003eHe peeled off another bill. \"Two hundred.\"\u003c/p\u003e\n\u003cp\u003eShe frowned.\u003c/p\u003e\n\u003cp\u003e\"All right. Five hundred.\"\u003c/p\u003e\n\u003cp\u003eMercedes Angeles beamed. \"That is very generous of you, senor. I will go get the file.\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve done it, he thought jubilantly. Jesus Christ, I\u0027ve done it! She stole Scott Industries for herself. If it hadn\u0027t been for me, she would have gotten away with it\u003c/p\u003e\n\u003cp\u003eWhen he confronted Ellen Scott with his evidence, there was no way she could deny it. The plane crash happened on October 1. Megan was in the hospital for ten days. So she would have been brought into the orphanage around October 11.\u003c/p\u003e\n\u003cp\u003eMercedes Angeles returned to the office holding a file in her hands. \"I found it,\" she said proudly.\u003c/p\u003e\n\u003cp\u003eIt was all Alan Tucker could do to keep from grabbing it out of her hands. \"May I look at it?\" he asked politely.\u003c/p\u003e\n\u003cp\u003e\"Certainly. You have been so generous.\" She frowned. \"I hope you will not mention this to anyone. I should not be doing this at all.\"\u003c/p\u003e\n\u003cp\u003e\"It will be our secret, senora.\"\u003c/p\u003e\n\u003cp\u003eShe handed him the file.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath and opened it. At the top it said: \"Megan. Baby girl. Parents unknown.\" And then the date. But there was some mistake.\u003c/p\u003e\n\u003cp\u003e\"It says here that Megan was brought in here on June 14, 1947.\"\u003c/p\u003e\n\u003cp\u003e\"Si, senor.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s impossible!\" He was almost screaming. The plane crash happened on October 1, four months later.\u003c/p\u003e\n\u003cp\u003eThere was a puzzled expression on her face. \"Impossible, senor? I do not understand.\"\u003c/p\u003e\n\u003cp\u003e\"Who - who keeps these records?\"\u003c/p\u003e\n\u003cp\u003e\"I do. When a child is left here, I put down the date and whatever information is given to me.\"\u003c/p\u003e\n\u003cp\u003eHis dream was collapsing. \"Couldn\u0027t you have made a mistake? About the date, I mean - couldn\u0027t it have been October tenth or eleventh?\"\u003c/p\u003e\n\u003cp\u003e\"Senor,\" she said indignantly. \"I know the difference between June fourteenth and October eleventh.\"\u003c/p\u003e\n\u003cp\u003eIt was over. He had built a dream on too flimsy a foundation. So Patricia Scott had really died in the plane crash. It was a coincidence that Ellen Scott was searching for a girl who had been born around the same time.\u003c/p\u003e\n\u003cp\u003eAlan Tucker rose heavily and said, \"Thank you, senora.\"\u003c/p\u003e\n\u003cp\u003e\"De nada, senor.\"\u003c/p\u003e\n\u003cp\u003eShe watched him leave. He was such a nice man. And so generous. His five hundred dollars would buy many things for the orphanage. So would the hundred-thousand-dollar check sent by the kind lady who had telephoned from New York. October eleventh was certainly a lucky day for our orphanage. Thank You, Lord.\u003c/p\u003e\n\u003cp\u003eAlan Tucker was reporting.\u003c/p\u003e\n\u003cp\u003e\"Still no hard news, Mrs. Scott. They\u0027re rumored to be heading north. As far as I know, the girl is safe.\"\u003c/p\u003e\n\u003cp\u003eThe tone of his voice has completely changed, Ellen Scott thought. The threat is gone. So he\u0027s visited the orphanage. He\u0027s back to being an employee. Well, after he finds Patricia, that will change too.\u003c/p\u003e\n\u003cp\u003e\"Report in tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mrs. Scott.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sands-of-time/page-30.html","bookId":2361,"creation":"Oct 5, 2019 10:08:56 AM","modification":"Oct 5, 2019 10:08:56 AM"}
