{"id":68310,"no":33,"title":"Page 33","content":"\u003cp\u003eThe report of the bank robbery was handled through regular police channels, and it was not until two hours after the robbery occurred that a police lieutenant notified Colonel Acoca about it.\u003c/p\u003e\n\u003cp\u003eAn hour later, Acoca was in Valladolid. He was furious at the delay.\u003c/p\u003e\n\u003cp\u003e\"Why wasn\u0027t I informed immediately?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Colonel, but it never occurred to us that - \"\u003c/p\u003e\n\u003cp\u003e\"You had him in your hands and you let him get away!\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t our - \"\u003c/p\u003e\n\u003cp\u003e\"Send in the bank teller.\"\u003c/p\u003e\n\u003cp\u003eThe teller was filled with a sense of self-importance. \"It was my window he came to. I could tell he was a killer by the look in his eye. He - \"\u003c/p\u003e\n\u003cp\u003e\"There is no doubt in your mind that the man who held you up was Jaime Miro?\"\u003c/p\u003e\n\u003cp\u003e\"None. He even showed me a wanted poster of himself. It was - \"\u003c/p\u003e\n\u003cp\u003e\"Did he come into the bank alone?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He pointed to a woman in the line and he said she was a member of his gang, but after Miro left I recognized her. She\u0027s a secretary who\u0027s a regular customer and - \"\u003c/p\u003e\n\u003cp\u003eColonel Acoca said impatiently, \"When Miro left, did you see in which direction he went?\"\u003c/p\u003e\n\u003cp\u003e\"Out the front door.\"\u003c/p\u003e\n\u003cp\u003eThe interview with the traffic policeman was no more helpful.\u003c/p\u003e\n\u003cp\u003e\"There were four of them in the car, Colonel. Jaime Miro and another man and two women in the back.\"\u003c/p\u003e\n\u003cp\u003e\"In what direction were they headed?\"\u003c/p\u003e\n\u003cp\u003eThe policeman hesitated. \"They could have gone in any direction, sir, once they got off the one-way street.\" His face brightened. \"I can describe the car, though.\"\u003c/p\u003e\n\u003cp\u003eColonel Acoca shook his head in disgust. \"Don\u0027t bother.\"\u003c/p\u003e\n\u003cp\u003eShe was dreaming, and in her dream there were the voices of a mob, and they were coming for her to burn her at the stake for robbing a bank. It wasn\u0027t for me. It was for the cause. The voices grew louder.\u003c/p\u003e\n\u003cp\u003eMegan opened her eyes and sat up, staring at the unfamiliar castle walls. The sound of voices was real. It was coming from outside.\u003c/p\u003e\n\u003cp\u003eMegan rose and hurried over to the narrow window. Directly below, in front of the castle, was an encampment of soldiers. She was filled with a sudden panic. They\u0027ve caught us. I have to find Jaime.\u003c/p\u003e\n\u003cp\u003eShe hurried to the room where he and Amparo had slept and looked inside. It was empty. She ran down the steps to the reception hall on the main floor. Jaime and Amparo were standing near the bolted front door, whispering.\u003c/p\u003e\n\u003cp\u003eFelix ran up to them. \"I checked the back. There\u0027s no other way out of here.\"\u003c/p\u003e\n\u003cp\u003e\"What about the back windows?\"\u003c/p\u003e\n\u003cp\u003e\"Too small. The only way out is through the front door.\"\u003c/p\u003e\n\u003cp\u003eWhere the soldiers are, Megan thought. We\u0027re trapped.\u003c/p\u003e\n\u003cp\u003eJaime was saying, \"It\u0027s just our damned bad luck that they picked this place to camp.\"\u003c/p\u003e\n\u003cp\u003e\"What are we going to do?\" Amparo whispered.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing we can do. We\u0027ll have to stay here until they leave. If - \"\u003c/p\u003e\n\u003cp\u003eAnd at that moment there was a loud knock at the front door. An authoritative voice called out, \"Open up in there.\"\u003c/p\u003e\n\u003cp\u003eJaime and Felix exchanged a quick look, and without a word drew their guns.\u003c/p\u003e\n\u003cp\u003eThe voice called out again, \"We know there\u0027s someone in there. Open up.\"\u003c/p\u003e\n\u003cp\u003eJaime said to Amparo and Megan, \"Get out of the way.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s hopeless, Megan thought as Amparo moved behind Jaime and Felix. There must be two dozen armed soldiers out there. We haven\u0027t got a chance.\u003c/p\u003e\n\u003cp\u003eBefore the others could stop her, Megan moved swiftly to the front door and opened it.\u003c/p\u003e\n\u003cp\u003e\"Thank the Lord you\u0027ve come!\" Megan exclaimed. \"You must help me.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sands-of-time/page-33.html","bookId":2361,"creation":"Oct 5, 2019 10:08:56 AM","modification":"Oct 5, 2019 10:08:56 AM"}
