{"id":68315,"no":38,"title":"Page 38","content":"\u003cp\u003e\"Deus Israel conjungat vos; et ipse sit vobiscum, qui, misertus est duobus unicis...plenius benedicere te... The God of Israel join you together, and He be with you...and now, Lord, make them bless Thee more fully. Blessed are all they that love the Lord, that walk in His ways. Glory...\"\u003c/p\u003e\n\u003cp\u003eRicardo looked away from the priest and glanced at Graciela standing at his side. I was right. She is the most beautiful bride in the world.\u003c/p\u003e\n\u003cp\u003eGraciela was still, listening to the words of the priest echo through the cavernous, vaulted church. There was such a sense of peace in this place. It seemed to Graciela to be filled with the ghosts of the past, all the thousands of people who had come there generation after generation to find forgiveness, fulfillment, and joy. It reminded her so much of the convent. I feel as though I\u0027ve come home again, Graciela thought. As though I belong.\u003c/p\u003e\n\u003cp\u003e\"Exaudi nos, omnipotens et misericors Deus; ut, quod nostra ministratur officio, tua benedictione potius impleatur Per Dominum...Hear us, Almighty and merciful God, that what is done by our ministry may be abundantly fulfilled with Thy blessing...\"\u003c/p\u003e\n\u003cp\u003eHe has blessed me, more than I deserve. Let me be worthy of Him.\u003c/p\u003e\n\u003cp\u003e\"In te speravi, domine: dixi: Tu es Deus meus: in manibus tuis tempora mea...\"\u003c/p\u003e\n\u003cp\u003e\"In Thee, O Lord, have I hoped; I said: Thou art my God; my times are in Thy hands...\"\u003c/p\u003e\n\u003cp\u003eMy times are in Thy hands. I took a solemn vow to devote the rest of my life to Him.\u003c/p\u003e\n\u003cp\u003e\"Suscipe, quaesumus, Domine, pro sacra connubii lege munus oblatum...\"\u003c/p\u003e\n\u003cp\u003e\"Receive, we beseech Thee, O Lord, the offering we make to Thee on behalf of the holy bond of wedlock...\"\u003c/p\u003e\n\u003cp\u003eThe words seemed to reverberate in Graciela\u0027s head. She felt as though time had stopped.\u003c/p\u003e\n\u003cp\u003e\"Deus qui potestate virtutis tuae de nihilo cuncta fecisti...\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God, who by the mighty power didst make all things out of nothing...\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God, who has hallowed wedlock to foreshadow the union of Christ with the Church...look in Thy mercy upon this, Thy handmaid, who is to be joined in wedlock and entreats protection and strength from Thee...\"\u003c/p\u003e\n\u003cp\u003eBut how can He show me mercy when I am betraying Him?\u003c/p\u003e\n\u003cp\u003eGraciela was suddenly finding it difficult to breathe. The walls seemed to be closing in on her.\u003c/p\u003e\n\u003cp\u003e\"Nihil in ea ex actibus suis ille auctor praevaricationis usurpet...\"\u003c/p\u003e\n\u003cp\u003e\"Let the author of sin work none of his evil deeds in her...\"\u003c/p\u003e\n\u003cp\u003eThat was the moment when Graciela knew. She felt as though a great burden had been lifted from her. She was filled with an exalted, ineffable joy.\u003c/p\u003e\n\u003cp\u003eThe priest was saying, \"May she win the peace of the kingdom of heaven. We ask Thee to bless this marriage, and - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m already married,\" Graciela said aloud.\u003c/p\u003e\n\u003cp\u003eThere was a moment of shocked silence. Ricardo and the priest were staring at her. Ricardo\u0027s face was pale.\u003c/p\u003e\n\u003cp\u003e\"Graciela, what are you - ?\"\u003c/p\u003e\n\u003cp\u003eShe took his arm and said gently, \"I\u0027m sorry, Ricardo.\"\u003c/p\u003e\n\u003cp\u003e\"I - I don\u0027t understand. Have - have you stopped loving me?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I love you more than my life. But my life doesn\u0027t belong to me anymore. I gave it to God a long time ago.\"\u003c/p\u003e\n\u003cp\u003e\"No! I can\u0027t let you sacrifice your - \"\u003c/p\u003e\n\u003cp\u003e\"Darling Ricardo...It is not a sacrifice. It\u0027s a blessing. In the convent I found the first peace I had ever known. You\u0027re a part of the world I gave up - the best part. But I did give it up. I must return to my world.\"\u003c/p\u003e\n\u003cp\u003eThe priest was standing there listening, silent.\u003c/p\u003e\n\u003cp\u003e\"Please forgive me for the pain I am causing you, but I can\u0027t go back on my vows. I would be betraying everything I believe in. I know that now. I could never make you happy, because I could never be happy. Please understand.\"\u003c/p\u003e\n\u003cp\u003eRicardo stared at her, shaken, and no words would come. It was as though something in him had died.\u003c/p\u003e\n\u003cp\u003eGraciela looked at his stricken face, and her heart went out to him. She kissed him on the cheek. \"I love you,\" she said softly. Her eyes filled with tears. \"I will pray for you. I will pray for us both.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sands-of-time/page-38.html","bookId":2361,"creation":"Oct 5, 2019 10:08:56 AM","modification":"Oct 5, 2019 10:08:56 AM"}
