{"id":98964,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI willed my heart to calm down. When it slowed to something like its normal rhythm, we stepped past the emergency exit staircase, beyond the light. Kane continued in the lead, and I stayed close behind him. The narrow tunnel’s walls and low, curved ceiling pressed more heavily with the weight of the darkness, and each breath required conscious effort. In, out. In, out. Don’t forget to breathe.\u003c/p\u003e\n\u003cp\u003eIt was slow going. Like the lights, the tidily swept floor ended at the exit, and I had to watch carefully so I didn’t trip on the tracks or the debris that covered them in this part of the tunnel. Every few feet, Kane would pause and look up, his ears straining forward, his nostrils working to sift through the scents ahead. Then he’d put his nose back to the ground and keep going.\u003c/p\u003e\n\u003cp\u003eI couldn’t smell anything besides mold and the old dust that covered every surface. But that was the scent of the Old Ones, that deep, underground scent of ancient decay. I stayed on edge, unable to tell whether I was smelling an old, empty tunnel or a black-robed, fanged monstrosity about to attack.\u003c/p\u003e\n\u003cp\u003eYet nothing did attack. We reached the end of the tunnel without finding any sign of the Old Ones. At the far end, a huge pile of cans, ranging in size from soup cans to ten-gallon barrels, was heaped up against the wall almost to the ceiling. It looked like debris from a landslide. I shone my flashlight on a label. Pear halves. Judging from the dusty, peeling condition of the label and the rust that marked the seams of the can, it was decades old. There were cans of other fruits and vegetables, crackers and biscuits, and drums marked POTABLE WATER. I didn’t think it would be all that potable now.\u003c/p\u003e\n\u003cp\u003eHomeless settlement? Fallout shelter? Whatever this tunnel had become after it was closed, these supplies had long outlasted whoever had carried them in. I sheathed my knife. The Old Ones weren’t here.\u003c/p\u003e\n\u003cp\u003eAs we backtracked to the emergency exit, the pressure lessened. We were on our way out.\u003c/p\u003e\n\u003cp\u003eBy the exit, I turned off the flashlight, happy to stand again in the lights of the emergency exit. I set my foot on the first step, but Kane leapt up in front of me and blocked my way.\u003c/p\u003e\n\u003cp\u003e“What?” Fresh air and open sky were calling me, and I was eager to say hello.\u003c/p\u003e\n\u003cp\u003eHe jumped down the stairs in a bound and pulled at the back of my sweater.\u003c/p\u003e\n\u003cp\u003eReluctantly, I stepped back into the tunnel and turned around. “Why can’t we go? Did you spot something?”\u003c/p\u003e\n\u003cp\u003eHe stared at the tracks. I did, too, looking for a secret switch or something that might open a hidden door, like the door to Axel’s guest room. I didn’t see anything like that, but after a minute I realized what Kane was trying to tell me. There was only one set of tracks.\u003c/p\u003e\n\u003cp\u003e“This tunnel has room for just one train. There must be an old track on the outbound side, too.” Kane yipped and ran along the lighted tunnel. After a longing glance up the stairs, I followed him.\u003c/p\u003e\n\u003cp\u003eSince Boylston Street Station was closed, we could hunt for the other tunnel without anyone bothering us. I was glad the station attendant hadn’t turned out the lights when he went home. The platform was deserted. We walked along the tracks a little way, then crossed to the outbound side. At the end of the platform, we squeezed around a gate and into another disused tunnel. No lights here. I pulled my knife again, shone my flashlight straight down to the floor at my feet. A little ways into the tunnel was a door marked PUMP ROOM. Cautiously, I tried the handle. It was locked. Kane spent a long time sniffing around the edges of the door, but eventually he continued down the tunnel. Although we followed the tracks to the end, we found nothing else besides dust and scattered debris.\u003c/p\u003e\n\u003cp\u003eNo Old Ones here, either.\u003c/p\u003e\n\u003cp\u003eWe crossed back to the inbound platform and followed the route to the emergency exit. This time, we took the stairs to the street-level door. When I pushed it open, an alarm sounded at the same moment the cool night air hit my face. It took only a second to get my bearings—we were on Tremont Street near the Wang Theatre—and move quickly away from the clanging exit toward Deadtown.\u003c/p\u003e\n\u003cp\u003e“Just to make sure,” I said to Kane as we walked. “You didn’t scent Juliet in there, did you?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“Myrddin?”\u003c/p\u003e\n\u003cp\u003eAnother shake.\u003c/p\u003e\n\u003cp\u003e“What about the Old Ones?”\u003c/p\u003e\n\u003cp\u003eHe stopped and sat on the pavement. He reared up and lifted his shoulders in a canine approximation of a shrug.\u003c/p\u003e\n\u003cp\u003e“Not sure, huh?” I could understand that. The entire subway system smelled like an age-old tomb.\u003c/p\u003e\n\u003cp\u003eKane nodded, and we continued our progress toward Deadtown.\u003c/p\u003e\n\u003cp\u003eAlthough the night was chilly, the breeze blowing from the Common felt warm, carrying smells of spring, of damp earth and life stirring. I inhaled deeply, savoring the sweetness that cut through the usual city smells. It was a good antidote for the dust that clogged my lungs.\u003c/p\u003e\n\u003cp\u003eThe tunnel had been the perfect location for the Old Ones’ base—near the final point on the rune, deep underground, old and dusty enough to feel like home to a bunch of creatures that should’ve been corpses centuries ago. But there’d been nothing. It was hard not to feel discouraged. Juliet was still missing, Pryce was one victim away from coming back to life, and Mab’s life-giving bloodstone was still in Myrddin’s clutches.\u003c/p\u003e\n\u003cp\u003eWe did have one advantage, though. Myrddin wanted my life force to revive Pryce. If I showed up at Boylston Street at the appointed time, Myrddin would be waiting for me.\u003c/p\u003e\n\u003cp\u003eA guaranteed date with a crazy wizard who wanted me dead—some advantage. But it was my best chance to defeat Myrddin and save my aunt.\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003eBACK AT MY APARTMENT, TINA WASN’T IN THE LIVING ROOM. The TV was off, and the empty ice cream container sat on the coffee table. A trail of candy wrappers led down the hallway toward my bedroom. Tina’s laugh, never what you’d call subtle, boomed from that direction.\u003c/p\u003e\n\u003cp\u003eI threw my jacket on the sofa. What the hell was Tina thinking? One thing I had asked of her. One. Let Mab rest. And there she was, in the bedroom, bothering my aunt. As I stormed down the hallway, Kane slunk off in the other direction, into the kitchen. I couldn’t say whether he was avoiding my scowl or Tina’s “nice doggie” routine. Either way, I couldn’t blame him.\u003c/p\u003e\n\u003cp\u003eOutside my bedroom, I paused to take three deep breaths. Calm. I had to stay calm and reasonable for my aunt’s sake. No point in upsetting Mab because I was annoyed with Tina. One more deep breath and I stepped through the doorway.\u003c/p\u003e\n\u003cp\u003eTina sat on the edge of my bed, one leg tucked under her, facing Mab, who sat propped up against the pillows. I flung a peeved glance at Tina. “How about you let me talk to my aunt?”\u003c/p\u003e\n\u003cp\u003eTina stood up slowly and stretched like a cat. Well, stiffer than that—a zombie cat. I had to squeeze past her to get near Mab.\u003c/p\u003e\n\u003cp\u003eMy aunt didn’t look any better. A little more rested, maybe, but so old and ill. Her hands, folded on top of the sheet, were rough and crisscrossed with veins. Those hands had always been so strong, able to deal any problem, from treating scrapes and bruises to fighting off Hellions. Now they were frail and trembling. It was hard to imagine them lifting a cup of tea.\u003c/p\u003e\n\u003cp\u003eI sat where Tina had been and patted Mab’s hands. They were cold. “How are you feeling? Are you warm enough?”\u003c/p\u003e\n\u003cp\u003e“Don’t talk to me as though I’m an invalid, child.” Coming from Mab, the quavering voice still managed to sound sharp.\u003c/p\u003e\n\u003cp\u003eBehind me, Tina brayed a laugh. I turned around to tell her off at the same time Mab said, “Be respectful, young lady.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Tina mumbled at the floor.\u003c/p\u003e\n\u003cp\u003e“Wait for me in the living room,” I said, pointing. “I’ll be there in a minute. I want to speak to you before you go.”\u003c/p\u003e\n\u003cp\u003eTina gave a sulky nod and stepped into the hall. But she turned around immediately. “It was nice talking with you,” she said to Mab.\u003c/p\u003e\n\u003cp\u003eMab nodded regally.\u003c/p\u003e\n\u003cp\u003e“And . . . you won’t forget?”\u003c/p\u003e\n\u003cp\u003e“I’ll not forget. But you have some things to remember as well, do you not?”\u003c/p\u003e\n\u003cp\u003eTina’s eyes flicked to me, then away. She bit her lip and nodded. Then she turned and fled down the hall.\u003c/p\u003e\n\u003cp\u003e“That young lady—” Mab began.\u003c/p\u003e\n\u003cp\u003e“I’m sorry she was in here bothering you. But I don’t want to talk about Tina right now. I want to talk about you.” I caught her hands and held them between mine, warming them.\u003c/p\u003e\n\u003cp\u003e“I’m as well as can be expected under the circumstances. Rest did help. But unless the bloodstone is returned to me, I shall continue to age at an accelerated rate.” She spoke matter-of-factly, as if commenting on the weather. But that was Mab. No matter how bad the situation, she always cut through emotional distractions to focus on the practical. “So tell me, child, what have you learned?”\u003c/p\u003e\n\u003cp\u003e“We didn’t find the bloodstone.”\u003c/p\u003e\n\u003cp\u003e“I assumed as much. If you had, I’d have felt it.”\u003c/p\u003e\n\u003cp\u003eI briefed her on what Kane and I had learned. Since that was virtually nothing, it didn’t take long. But as I spoke, I had an idea. “Can you use your connection with the bloodstone to locate the safe house?”\u003c/p\u003e\n\u003cp\u003eMab shook her head. “Myrddin has cloaked it. Its whereabouts are as much a mystery to me as they are to you.”\u003c/p\u003e\n\u003cp\u003e“How can we get it back?”\u003c/p\u003e\n\u003cp\u003e“I’m not happy with your plan to put yourself at risk to draw Myrddin out. Let’s be up front about that. But I can’t see any alternative. Myrddin intends, I believe, to pour your life force into Pryce and then shut me away forever, suffering from the knowledge of your fate.” Her cloudy eyes looked down at our joined hands. “So there’s one piece of good news, at least.”\u003c/p\u003e\n\u003cp\u003eI attempted a smile. “I think your definition of ‘good news’ must be different from mine.”\u003c/p\u003e\n\u003cp\u003e“We’ve time to plan, child. My body is giving out, but my mind is keen. Now, let me think, and then we’ll discuss strategy.” She drew her hands away. Three quick pats on my arm let me know I was dismissed.\u003c/p\u003e\n\u003cp\u003eThe bed shifted as I stood. When I was at the doorway Mab said, eyes still closed, “By the way, I told Tina you’d most likely let her keep Russom’s a bit longer.”\u003c/p\u003e\n\u003cp\u003e“You did? Why?”\u003c/p\u003e\n\u003cp\u003e“She’s adequate on her overview of the Inimicus genus but needs to spend more time on the characteristics of individual species. If the child wishes to study demonology on her own time, surely you can allow her to borrow a text that would otherwise only gather dust on your bookshelf.” \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodstone-deadtown-3/page-46.html","bookId":2611,"creation":"Oct 5, 2019 6:38:26 PM","modification":"Oct 5, 2019 6:38:26 PM"}
