{"id":98927,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI twisted around. It took me a moment to realize what she’d seen. There was no blinking from the video camera. Its light had gone dark.\u003c/p\u003e\n\u003cp\u003eOut in the hallway, something crashed, making the cell’s cement floor shudder. The crash was followed by a protracted scream, a sound twisted with unfathomable fear and pain.\u003c/p\u003e\n\u003cp\u003eI jumped up and went to the door. There was no knob on the inside. We were trapped. More crashes, more bangs shook the cell. Maybe whatever stalked the hallway wasn’t looking for us. Maybe it would pass us by.\u003c/p\u003e\n\u003cp\u003eI held my breath and waited.\u003c/p\u003e\n\u003cp\u003eA blow from outside jarred the door. So much for passing us by.\u003c/p\u003e\n\u003cp\u003eBehind me, Juliet made a strangled sound. “It’s them,” she whispered. “They’ve found me.” She looked wildly around the cell. Her gaze landed on me, darkened with something like sorrow. “I’m sorry, Vicky,” she whispered.\u003c/p\u003e\n\u003cp\u003eHer words chilled me more than the scream had. Vampires never apologize—ever. Not even as a figure of speech.\u003c/p\u003e\n\u003cp\u003eAnother blow bulged the door inward.\u003c/p\u003e\n\u003cp\u003eI reached into my purse for a knife—and pulled out my weapons-check receipt. Stupid visitors’ policy. I picked up the chair I’d been sitting in and lifted it over my head, pressing myself as flat as I could against the cinder-block wall beside the door. When whatever was on the other side rushed into the room, I’d knock the crap out of it.\u003c/p\u003e\n\u003cp\u003eWith a screech of tearing metal, the door was ripped from its hinges. A robed figure sped through the doorway. I slammed the chair down on him, and he collapsed in a heap of black cloth.\u003c/p\u003e\n\u003cp\u003eRight behind him came a second one, this one in a brown robe. He flew—literally flew—over the first, straight at Juliet.\u003c/p\u003e\n\u003cp\u003eJuliet sat perfectly still, her hands folded in her lap, her face expressionless except for the terror that screamed silently from her eyes.\u003c/p\u003e\n\u003cp\u003eWhat the hell was wrong with her? Why wasn’t she fighting?\u003c/p\u003e\n\u003cp\u003eShe didn’t move, didn’t even flinch, as the brown-robed creature lifted her from the bed.\u003c/p\u003e\n\u003cp\u003eI picked up the chair and rushed him from behind. As I brought the chair down, the creature flung his arm backward, knocking me sideways. There was ice and power in the blow, and more-than-ordinary strength. I flew across the room and hit the wall headfirst. Stars exploded through my vision. Pain and the warm, metallic taste of blood filled my mouth. I’d bitten my tongue when I hit the wall. I wiped my mouth, smearing blood across my cheek.\u003c/p\u003e\n\u003cp\u003eThe room felt twenty degrees colder than it had before the Old Ones entered.\u003c/p\u003e\n\u003cp\u003eI shook the stars away. Brown Robe held Juliet like an undead groom about to whisk his bride over the threshold. But her shackle held her back, the silver chain stretched taut. The creature grabbed the chain and pulled, trying to yank it from the wall. He shrieked as a cloud of black-and-yellow smoke billowed from his hand. The creature dropped both Juliet and the chain. He spun around, clutching his hand to his chest, his bulging eyes searching the room.\u003c/p\u003e\n\u003cp\u003eHis face. I’d forgotten how hideous the Old Ones were. Yellow skin stretched taut across the skull. His eyes protruded from their sockets, the whites tea colored. A hole gaped where his nose should be. But it was the fangs that made the Old Ones redefine ugly. They stretched from this Old One’s lipless mouth past his chin, ending in razor-sharp points. Saber-toothed vampires. Just what I wanted to fight without my weapons.\u003c/p\u003e\n\u003cp\u003eBrown Robe didn’t share my dilemma. Smoke still streaming from his right hand, he drew a short sword with his left. I tensed, preparing. But the Old One didn’t attack. Instead, he picked up Juliet, threw her onto the cot, and began hacking at her leg with the sword, just above the shackle.\u003c/p\u003e\n\u003cp\u003eJuliet screamed.\u003c/p\u003e\n\u003cp\u003eOh, no, you don’t.\u003c/p\u003e\n\u003cp\u003eI rushed the Old One from the right. He tried to swat me away again, but I dodged the blow. I grabbed his sword, and we grappled for it.\u003c/p\u003e\n\u003cp\u003eThe Old One’s grip was strong. His icy fingers made my joints ache. Gritting my teeth, I stuck a finger in his eye socket. Brown Robe recoiled, and I twisted my body. I got the sword away.\u003c/p\u003e\n\u003cp\u003eImmediately I thrust, but Brown Robe jumped impossibly high. Something grabbed my ankle and yanked backward. I fell, cracking my head again on the side of the cot. More stars. They filled the room, swirling over my head like the goddamn Milky Way.\u003c/p\u003e\n\u003cp\u003eWhen my vision cleared, I lay on my back, a weight pinning my limbs to the floor. Inches above me, the faces of two Old Ones hovered like a nightmare. The cold, stale smell of ancient death—of mold and rot and grave dust—flowed from them like an arctic wind blowing through a tomb. I struggled, but I couldn’t move. The Old Ones looked at each other. The black-robed one nodded. Brown Robe yanked his sword from my hand and rose. Immediately, Juliet’s screams began again, louder and more frantic than before.\u003c/p\u003e\n\u003cp\u003eBlack Robe lowered his face to mine. A tip of black tongue poked out from between his fangs. Slowly, carefully, he licked the corner of my mouth, tasting the blood smeared there. It felt like an ice-coated slug slithering along my skin. Revulsion clenched my stomach, and I turned my head away. Mistake. Pain stabbed my neck and shoulder as the Old One sank his fangs into me. These creatures could drain a person dry in a couple of minutes. I’d seen the empty husks they left behind.\u003c/p\u003e\n\u003cp\u003eMy neck ached and burned, and I could feel myself weaken as the creature sucked the life from my body. My toes and fingers were cold, going numb. I wiggled them, and my left hand brushed something. I heard a faint clink. The silver chain. It had burned Brown Robe’s hand to a cinder. I had a feeling that Black Robe wouldn’t like it much, either.\u003c/p\u003e\n\u003cp\u003eBlack Robe had my hand pinned to the floor, but I got my fingers around the chain. One flick, and the silver made contact with the decrepit yellow flesh. Smoke billowed. Black Robe reared back, batting at his burned hand.\u003c/p\u003e\n\u003cp\u003eThe moment his weight left my arms I was up on my knees. I wrapped the chain around his neck and yanked hard. Black Robe snarled and bucked and clawed at me with both hands. I looped the chain around my own hands so I wouldn’t lose my grip on it. The silver links grew hot in my fists as smoke billowed, spewing the smell of charred, rotten meat throughout the room. The links of chain seared my palms, the backs of my hands. I clenched my teeth against the pain and kept the chain taut.\u003c/p\u003e\n\u003cp\u003eA blade sliced toward me. I dropped sideways, dragging Black Robe with me, rolling as we hit the floor. With the second strike, Brown Robe drove his blade deep into his buddy’s gut. I kicked Brown Robe’s wrist, and he dropped his sword. In my hands, the burning chain went slack as Black Robe’s head toppled from his body and rolled under the cot.\u003c/p\u003e\n\u003cp\u003eI held two lengths of chain, one in each hand. Contact with the Old One’s flesh had melted the links, breaking the chain. The Old One’s headless corpse lay at my feet. The contact hadn’t done the creature’s neck any good, either.\u003c/p\u003e\n\u003cp\u003eThe length of chain attached to Juliet’s shackle was the longer of the two pieces. I lashed it like a whip at Brown Robe. The Old One jumped back, but not far enough. The chain hit his face, burning through his cheek. He shrieked and flew up to the ceiling. I whipped the chain at his legs, his feet, whatever I could reach. The smoke that choked the room showed I’d hit him more than once.\u003c/p\u003e\n\u003cp\u003eBrown Robe swooped toward me. I ducked, spinning the chain over my head like a helicopter rotor. But Brown Robe wasn’t attacking; he was running away. The Old One rocketed through the door. I let go of the silver chain, snatched up the dropped sword, and ran after him.\u003c/p\u003e\n\u003cp\u003eThe hallway was empty. Cell doors hung crookedly, any inhabitants long gone. I ran toward the entrance. The metal door that sealed off the cell block had been torn from its hinges. Beside it, the guard who’d walked me down the hallway lay crumpled on the floor. I passed him, then stopped where the hallway turned right. Keeping my back against the wall, I peered around the corner.\u003c/p\u003e\n\u003cp\u003eNo sign of Brown Robe—except for more bodies left behind. Two here. The receptionist who’d signed me in lay sprawled across her desk. Another guard, one I hadn’t seen before, had been tossed aside like an empty candy wrapper. All three of the dead norms had been drained of blood.\u003c/p\u003e\n\u003cp\u003eThrough a half-open door, I could see the building’s surveillance center. It looked like a tornado had blown through, and then someone had taken an ax to what was left.\u003c/p\u003e\n\u003cp\u003eWhat a disaster. After this, Juliet wouldn’t be safe from the Goon Squad or the Old Ones. I had to get her out of here. I gathered up the knives I’d left with the receptionist and returned to the cell block.\u003c/p\u003e\n\u003cp\u003eThe ruined door to Juliet’s cell lay against the far wall, where the Old Ones had hurled it. A quiet moaning issued from the open doorway.\u003c/p\u003e\n\u003cp\u003eJuliet sat on the cot, her injured leg pulled up and resting on her other thigh. The silver chain trailed from her ankle. She rocked back and forth, back and forth, cradling her leg.\u003c/p\u003e\n\u003cp\u003eI went over to her. “Let me see—”\u003c/p\u003e\n\u003cp\u003eShe snarled, baring her fangs, and shoved me away. Nail marks scored my arm.\u003c/p\u003e\n\u003cp\u003e“Juliet, we have to go.”\u003c/p\u003e\n\u003cp\u003eShe snarled again, her eyes flaring with rage and pain but not a spark of recognition.\u003c/p\u003e\n\u003cp\u003e“Hey, it’s me. Vicky. Come on, you know me.” I stayed out of scratching range, trying to make my voice both gentle and urgent. “We need to get out of here. Those Old Ones killed the guards. The one that got away might come back with reinforcements.”\u003c/p\u003e\n\u003cp\u003e“The Old Ones,” she whispered, and I saw a flicker of the Juliet I knew. Her forehead wrinkled, like she was considering a difficult problem. “You killed one of them.”\u003c/p\u003e\n\u003cp\u003eI nudged the headless body with my toe. Yup. Killed it dead. Juliet stared at the corpse as if she couldn’t fathom what it was.\u003c/p\u003e\n\u003cp\u003eI tried again. “How badly are you hurt? Can you walk?”\u003c/p\u003e\n\u003cp\u003eShe extended her leg toward me. The bloody wound where Brown Robe had tried to saw through her leg gaped. The bone, absurdly white, showed in the ragged cut. That wasn’t good. Juliet should have started to heal already.\u003c/p\u003e\n\u003cp\u003e“It’s the silver,” she said. “It slows healing. As long as that’s in contact with my skin . . .” She hugged herself. “And I’m so famished.”\u003c/p\u003e\n\u003cp\u003eShe looked terrible. Purple crescents, so dark they were almost black, ringed her eyes. Her skin, always pale, looked dead white, like those guards who’d been drained of blood. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodstone-deadtown-3/page-8.html","bookId":2611,"creation":"Oct 5, 2019 6:38:26 PM","modification":"Oct 5, 2019 6:38:26 PM"}
