{"id":34605,"no":13,"title":"CHAPTER XIII. THE ACTION OF THE EXECUTIVE.","content":"\u0026nbsp;The private breakfast-room of the Presidential palace was a small but lofty apartment. The walls were hung with tapestries; over the doors weapons of ancient type and history were arranged in elaborate patterns. The great French windows were deeply set in the wall, and the bright light of the morning was softened by heavy crimson curtains. Like the rest of the house it wore an official aspect. The windows opened on to the stone terrace, and those who passed through them experienced a feeling of relief in exchanging the severe splendours of the palace for the beautiful confusion of the garden, where between the spreading trees and slender palms the sparkling waters of the harbour were displayed. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The table, which was set for two, was comfortably small and well arranged. The generous revenue which it had long been the principle of the Lauranian Republic to bestow on her First Magistrate enabled the President to live in a style of elegance and luxury, and to enjoy the attractions of good silver, fresh-cut flowers, and an excellent cook. But it was with a clouded brow that Molara met his wife at breakfast on the morning after the events which have just been chronicled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bad news,—tiresome news again, dear,\" he said as, sitting down and depositing a handful of papers on the table, he signed to the servants to leave the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucile experienced a feeling of intense relief. After all she would not have to tell him the secret she had learned. \"Has he started?\" she asked incautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, last night; but he will be stopped.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank heaven for that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara looked at her in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean? Why are you glad that the Admiral and the fleet are prevented from carrying out my orders?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fleet!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good gracious! What did you think I meant?\" he asked impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A loophole of escape presented itself. She ignored his question. \"I am glad the fleet is stopped because I think they will be wanted here, now that the city is so unsettled.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh,\" said the President shortly,—suspiciously, she thought. To cover her retreat she asked a question. \"Why are they stopped?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara pulled out a Press telegram slip from among his papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Port Said, September 9th, 6.0 a.m.,\" he said, reading; \"British steam-collier Maude, 1,400 tons, grounded this morning in canal, which is in consequence blocked for traffic. Every effort is being made to clear the fairway. Accident is believed to be due to the silting up of channel caused by extreme draught of H.B.M.S. Aggressor which passed through last night.\" He added: \"They know their business, these English pigs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think they have done it on purpose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But the fleet is not there yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will be there to-morrow night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why should they block the channel now,—why not wait?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Characteristic dislike of coups de théatre, I suppose. Now the French would have waited till we were at the entrance of the channel, and then shut the door in our faces neatly. But British Diplomacy does not aim at effects; besides, this looks more natural.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How abominable!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And listen to this,\" said the President, as giving way to keen irritation he snatched another paper from his bundle and began to read. \"From the Ambassador,\" he said: \"Her Majesty\u0027s Government have instructed the officers commanding the various British coaling-stations south of the Red Sea, to render every assistance to the Lauranian fleet and to supply them with coal at the local market-rate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is an insult,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a cat playing with a mouse,\" he rejoined bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What will you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do? Sulk, protest,—but give in. What else can we do? Their ships are on the spot; ours are cut off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a pause. Molara read his papers and continued his breakfast. Lucile came back to her resolution. She would tell him; but she would make terms. Savrola must be protected at all costs. \"Antonio,\" she said nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The President, who was in a thoroughly bad temper, went on reading for a moment and then looked up abruptly. \"Yes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must tell you something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, what is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A great danger is threatening us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know that,\" he said shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Savrola——\" She paused uncertain and undecided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What of him?\" said Molara, suddenly becoming interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you were to find him guilty of conspiracy, of plotting revolution, what would you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should shoot him with the greatest pleasure in the world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, without a trial?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh no! He should have a trial under martial law and welcome. What of him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a bad moment. She looked round for another loophole.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He—he made a speech last night,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He did,\" said the President impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I think it must have been very inflammatory, because I heard the crowds cheering in the streets all night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara looked at her in deep disgust. \"My dear, how silly you are this morning,\" he said and returned to his paper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The long silence that followed was broken by the hurried entrance of Miguel with an opened telegram. He walked straight up to the President and handed it to him without speaking; but Lucile could see that he was trembling with haste, excitement, or terror.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara opened the folded paper leisurely, smoothed it on the table and then jumped out of his chair as he read it. \"Good God! when did this come?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This moment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fleet,\" he cried, \"the fleet, Miguel,—not an instant must be lost! Recall the Admiral! They must return at once. I will write the telegram myself.\" Crumpling the message in his hand he hurried out of the room, Miguel at his heels. At the door he found a waiting servant. \"Send for Colonel Sorrento,—to come here immediately. Go! be off! Run!\" he cried as the man departed with ceremonious slowness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucile heard them bustle down the corridor and the slam of a distant door; then all was silent again. She knew what that telegram contained. The tragedy had burst upon them all, that tragedy whose climax must strike her so nearly; but she felt glad she had meant to tell her husband,—and yet more glad that she had not told him. A cynic might have observed that Savrola\u0027s confidence, in the safety of his secret, was well founded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She returned to her sitting-room. The uncertainty of the immediate future terrified her. If the revolt succeeded, she and her husband would have to fly for their lives; if it were suppressed the consequences seemed more appalling. One thing was clear: the President would send her out of the capital at once to some place of safety. Whither? Amid all these doubts and conflicting emotions one desire predominated,—to see Savrola again, to bid him good-bye, to tell him she had not betrayed him. It was impossible. A prey to many apprehensions she walked aimlessly about the room, awaiting the developements she feared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile the President and his secretary had reached the private office. Miguel shut the door. Both looked at each other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It has come,\" said Molara with a long breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In an evil hour,\" replied the Secretary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall win, Miguel. Trust to my star, my luck,—I will see this thing through. We shall crush them; but much is to be done. Now write this telegram to our agent at Port Said; send it in cipher and clear the line: Charter at once fast despatch-boat and go personally to meet Admiral de Mello, who with fleet left Laurania midnight 8th instant for Port Said. Stop. Order him in my name return here urgent. Stop. Spare no expense. Now send that off. With good luck the ships should be here to-morrow night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miguel sat down and began to put the message into code. The President paced the room excitedly; then he rang the bell; a servant entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has Colonel Sorrento come yet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Your Excellency.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Send and tell him to come at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has been sent for, Your Excellency.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Send again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The man disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara rang the bell once more. He met the servant in the doorway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is there a mounted orderly?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Your Excellency.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Finished, Miguel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here,\" said the Secretary, getting up and handing the message to the startled attendant,—\"at speed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go on,\" shouted the President, striking the table with his open hand, and the man fled from the room. The sound of the galloping horse somewhat allayed Molara\u0027s impatience.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He crossed the frontier last night at nine o\u0027clock, Miguel; he should have been at Turga at daybreak. We have a garrison there, a small one, but enough to delay the advance. Why is there no news? This telegram comes from Paris, from the Foreign Minister. We should have heard from—who is it commands the post?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, Your Excellency. The Colonel will be here directly; but the silence is ugly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The President set his teeth. \"I cannot trust the army; they are all disaffected. It is a terrible game; but I shall win, I shall win!\" He repeated the sentence to himself several times with more energy than conviction, as if to fortify his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door opened. \"Colonel Sorrento,\" announced the usher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, old man,\" said Molara familiarly,—he felt he wanted a friend rather than a subordinate—\"Strelitz has invaded us. He crossed the frontier last night with two thousand men and several Maxim guns, marching here by Turga and Lorenzo. We have no news from the Commandant at Turga; who is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sorrento was one of those soldiers, not an uncommon type, who fear little but independent responsibility. He had served under the President for many years in the field and in the Government. Had he been alone when the news arrived, he would have been thunderstruck; now that he had a leader he followed and obeyed with military precision. Without any appearance of surprise he thought for a moment and then replied: \"Major de Roc. He has four companies,—a good officer,—you can trust him, Sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But the troops?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s another matter altogether. The whole army, as I have several times informed you, Sir, is disturbed. Only the Guard can be relied on, and, of course, the officers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, we shall see,\" said the President stoutly. \"Miguel, get the map. You know the country, Sorrento. Between Turga and Lorenzo, the Black Gorge must be held. Here,\" he pointed on the map, which the Secretary unrolled, \"here they must be stopped or at any rate delayed, till the fleet comes back. What is there at Lorenzo?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A battalion and two machine-guns,\" replied the War-Minister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The President took a turn up and down the room. He was used to deciding quickly. \"A brigade would do it for certain,\" he said. He took another turn. \"Rail two battalions of the Guard at once to Lorenzo.\" Sorrento, who had produced his note-book, began to write. \"Two field-batteries,\" said the President. \"Which two are fit, Colonel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The first and second will do,\" answered Sorrento.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the Lancers of the Guard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, all, except details for orderly-work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That leaves you only one trustworthy battalion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know,\" said the President. \"It is a bold course, but the only one. Now what about the Line regiments in the city? Which are the worst?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The third, fifth, and eleventh have caused us most uneasiness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; we will get them out of the way. Let them march to-day towards Lorenzo and halt anywhere ten miles out of the city as a supporting brigade. Now, who is to command?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rollo is senior, Sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A fool, a fossil, and out of date,\" cried the President.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stupid, but steady,\" said Sorrento. \"You can rely upon his attempting nothing brilliant; he will do what he is told, and nothing more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara reflected on this tremendous military virtue. \"Very well; give him the supporting brigade; they will have no fighting. But the other business; that is different. Brienz should have it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not Drogan?\" suggested the War-Minister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t stand his wife,\" said the President.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a good musician, Sir,\" interposed Miguel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Guitar,—very melodious.\" He shook his head appreciatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And has a capital cook,\" added Sorrento.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Molara; \"this is a matter of life and death. I cannot indulge my prejudices, nor yours; he is not a good man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A good Staff would run him all right, Sir; he is very placid and easily led. And he is a great friend of mine; many\u0027s the good dinner——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Colonel, it\u0027s no good; I cannot. Is it likely that when so much is at stake, when my reputation, my chances in life, indeed life itself, are on the hazard, that I or any one would give a great command on such grounds? If claims were equally balanced, I would oblige you; but Brienz is a better man and must have it. Besides,\" he added, \"he has not got a horrid wife.\" Sorrento looked terribly disappointed but said no more. \"Well, that is all settled. I leave all details to you. The Staff, everything, you may appoint; but the troops must start by noon. I will speak to them myself at the station.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The War-Minister bowed and departed, solaced by the minor appointments which the President had left to his decision.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara looked at his secretary dubiously. \"Is there anything else to do? None of the revolutionaries in the city have moved, have they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They have given no sign, Sir; there is nothing to incriminate them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is possible this has surprised them; their plans are not ready. At the first overt act of violence or sedition, I will arrest them. But I must have proofs, not for my own satisfaction, but for the country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is a critical moment,\" said the Secretary. \"If the leaders of the sedition could be discredited, if they could be made to appear ridiculous or insincere, it would have a great effect on public opinion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had thought,\" replied Molara, \"that we might hope to learn something of their plans.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have informed me that Her Excellency has consented to ask Se?or Savrola for information on this point?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I dislike the idea of any intimacy between them; it might be dangerous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might be made most dangerous for him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In what way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the way I have already indicated to you, General.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean in the way I forbade you to suggest, Sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And this is the moment?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now or never.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a silence, after which they resumed the morning\u0027s business. For an hour and a half both worked busily. Then Molara spoke. \"I hate doing it; it\u0027s a dirty job.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is necessary, is necessary,\" said the Secretary sententiously. The President was about to make a reply when a clerk entered the room with a deciphered telegram. Miguel took it from him, read it, and passed it to his chief, saying grimly as he did so: \"Perhaps this will decide you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The President read the message, and as he read his face grew hard and cruel. It was from the Police Commissary at Turga, brief but terrible; the soldiers had deserted to the invaders, having first shot their officers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" said Molara at last, \"I shall require you to accompany me to-night on a mission of importance. I will take an aide-de-camp as well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the Secretary; \"witnesses are necessary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be armed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is desirable, but only as a threat, only as a threat,\" said the Secretary earnestly. \"He is too strong for violence; the people would be up in a moment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know that,\" curtly replied the President, and then with savage bitterness he added: \"but for that there would be no difficulty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None whatever,\" said Miguel, and went on writing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Molara rose and went in search of Lucile, choking down the disgust and repugnance he felt. He was determined now; it might just make the difference to him in the struggle for power, and besides, it contained the element of revenge. He would like to see the proud Savrola grovel and beg for mercy at his feet. All mere politicians, he said to himself, were physical cowards; the fear of death would paralyse his rival.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucile was still in her sitting-room when her husband entered. She met him with an anxious look. \"What has happened, Antonio?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We have been invaded, dearest, by a large force of revolutionaries. The garrison of Turga have deserted to the enemy, and killed their officers. The end is now in sight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is terrible,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lucile,\" he said with unwonted tenderness, \"one chance remains. If you could find out what the leaders of the agitation in this city intend to do, if you can get Savrola to show his hand, we might maintain our position and overcome our enemies. Can you,—will you do this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucile\u0027s heart bounded. It was, as he said, a chance. She might defeat the plot, and at the same time make terms for Savrola; she might still rule in Laurania, and, though this thought she repressed, save the man she loved. Her course was clear; to obtain the information and sell it to her husband for Savrola\u0027s life and liberty. \"I will try,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew you would not fail me, dearest,\" said Molara. \"But the time is short; go and see him to-night at his rooms. He will surely tell you. You have power over men and will succeed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucile reflected. To herself she said, \"I shall save the State and serve my husband;\" and herself rejoined, \"You will see him again.\" Then she spoke aloud. \"I will go to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear, I always trusted you,\" said the President; \"I will never forget your devotion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he hurried away, convulsed with remorse,—and shame. He had indeed stooped to conquer.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2890/79943.html","bookId":1138,"creation":"Aug 5, 2019 5:46:47 AM","modification":"Aug 5, 2019 5:46:47 AM"}
