{"id":102295,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“That I wanted a chance to prove I’m worth your trouble.”\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eEven when he was standing at street level on Seattle’s topside, Andan Cly still felt like he was underneath something. A long shadow covered much of the contained city, cast by the two-hundred-foot wall that surrounded it, and the sky above was gray like usual. Even at the very height of noon, any light that managed to make it past the shadow was filtered and dim. Direct sunlight, on those few days of the year when it appeared, was never quite brilliant within the wall, either. Every speck of illumination—from the sun, from the ever-present lanterns—was rendered thick and watery by years of accumulated blight gas, which filled the blocks with a thick, yellowish fog.\u003c/p\u003e\n\u003cp\u003eWatery, yes. That was it.\u003c/p\u003e\n\u003cp\u003eIt felt like being underwater.\u003c/p\u003e\n\u003cp\u003eThe gas mask he wore underscored this impression. The lenses rounded off the edges of his vision, creating a very slight fishbowl effect, and the charcoal filters through which he breathed made the air feel stuffy and taste strange. He didn’t like to hear the sound of his lungs working, and even the faintest whisper of a stuffy nose reached his ears as a hearty whistle. The straps were rubbing a groove into the back of his head, and the rubber seals made his face itch.\u003c/p\u003e\n\u003cp\u003eBut all in all, it was better than breathing the blight. A few thousand of the walking dead would have attested to it, if they could.\u003c/p\u003e\n\u003cp\u003eMost of the ships that came or went from the city did so over at King Street Station, half a mile away. Decatur was more often considered a pit stop of last resort or desperate straits.\u003c/p\u003e\n\u003cp\u003eBut Andan Cly saw potential.\u003c/p\u003e\n\u003cp\u003eHe saw a sturdy protective barricade thirty feet high around the main compound, and a large shelter that could serve as a depot for goods and airmen and had an entrance to the underground through its basement. Conveniently located—almost triangulated—between Chinatown, the train station, and the vaults, it was within easy reach for the three main populations. All it needed was a framework of lead pipe sunk into the ground, so hydrogen ships would have something to dock against, rather than the present method of hitching down to an enormous fallen totem pole that grew softer and more rotten by the month.\u003c/p\u003e\n\u003cp\u003eWell, it’d also need a set of tanks for hydrogen manufacture and fill-ups, and some tubing to pump everything up. Cly had a feeling the tanks would be best positioned underground, since untreated metal corroded so quickly in the blight, and there was no telling how, or if, that pervasive gas would interfere with hydrogen production.\u003c/p\u003e\n\u003cp\u003eBut he was getting ahead of himself.\u003c/p\u003e\n\u003cp\u003eIt was difficult not to, when he thought about the possibilities. The underground could have a real, honest-to-God dock inside—where people could reliably send and receive goods and messages … maybe even mail! It’d make Seattle something like a real city again, despite the rotters and the toxic air. It’d mean easier access to the outside for people who wanted it.\u003c/p\u003e\n\u003cp\u003eCly put his hands on his hips and watched as the Naamah Darling prepared for takeoff. His ship was full of fuel and had hundreds of miles to go before it’d need a fill-up, but his crew members were checking the last-minute details, running down the list of things that needed attention before a cross-country excursion.\u003c/p\u003e\n\u003cp\u003eHydrogen stores: check.\u003c/p\u003e\n\u003cp\u003eThrusters and hydraulics in good repair: check.\u003c/p\u003e\n\u003cp\u003eCargo hold emptied, cleaned, and ready for stocking: check—though in this case it was emptied, cleaned, and ready for the retrofitting in New Orleans. This meant all the gas bags had been dumped, and the bracing crates had been removed. The long ceiling rails with their ball-bearing rollers would be cut off at a machine shop, and the resulting seams would be soldered. Rubber seals needed to be restored and augmented if he was going to carry cargo that he didn’t want tainted by the city air.\u003c/p\u003e\n\u003cp\u003e“Hey, boss, we’re about ready to fly,” reported Kirby Troost, the Naamah Darling’s new engineer. Troost was a little man, roughly the height of Briar Wilkes and maybe ten pounds heavier. But what he lacked in size, he made up for with a keen intelligence and a willingness to try anything once. He was fresh out of jail. What he’d done to land there, he wasn’t fond of saying.\u003c/p\u003e\n\u003cp\u003eCly knew, but he didn’t spread it around. The secret protected them both.\u003c/p\u003e\n\u003cp\u003eThe captain nodded down at the engineer and looked back at the log structure that led to the underground, courtesy of a pair of ladders. “Before we go, I want to make sure nobody has any ‘one last things’ to ask for.”\u003c/p\u003e\n\u003cp\u003eKirby Troost bobbed his head. The bob looked heavy, as if his gas mask threw off his balance.\u003c/p\u003e\n\u003cp\u003e“You doing all right in that thing?” Cly asked, indicating the mask.\u003c/p\u003e\n\u003cp\u003e“Yes, sir. No trouble at all.”\u003c/p\u003e\n\u003cp\u003e“Really? Because mine itches like a son of a bitch.”\u003c/p\u003e\n\u003cp\u003e“Didn’t say it was pleasant, sir. Just said it wasn’t any trouble.”\u003c/p\u003e\n\u003cp\u003e“If it bugs you, they’ve got a bunch of different models you could try. On the return trip, I’ll take you to the storage center in the vaults, and you can try ’em on one after another, like they’re hats in a shop.” Seeing Mercy Lynch coming toward him, he called out, “Mercy! You think of something else?”\u003c/p\u003e\n\u003cp\u003eShe said, “Yep, and I’m glad you’re still here. I was afraid you’d already left.” She wiggled her hand in a gimme motion.\u003c/p\u003e\n\u003cp\u003e“Oh, your list. It’s right here.” He removed three of them from his pocket, selected hers, and gave it back to her.\u003c/p\u003e\n\u003cp\u003e“Thanks. I’ll be right back. Since it doesn’t look like I’m holding you up, or anything.”\u003c/p\u003e\n\u003cp\u003e“No, ma’am. Take your time.”\u003c/p\u003e\n\u003cp\u003eKirby stood beside the captain, watching Mercy retreat to the station house—or the building that would become a station house if Cly had anything to say about it. The engineer said, “Fine figure of a woman, there.”\u003c/p\u003e\n\u003cp\u003e“How can you tell? She’s wearing a mask.”\u003c/p\u003e\n\u003cp\u003e“Not talking about her face, sir. She looks strong. I like that.”\u003c/p\u003e\n\u003cp\u003e“You like them taller than you?”\u003c/p\u003e\n\u003cp\u003e“If I stuck to the ones who were shorter than me, I’d never have any fun at all.”\u003c/p\u003e\n\u003cp\u003eCly shrugged. “She’s young. But not so young that people would talk.”\u003c/p\u003e\n\u003cp\u003e“Are you saying I should have a word with her?”\u003c/p\u003e\n\u003cp\u003e“I’m saying if you did, it wouldn’t be a scandal. But there are two things you should know first.”\u003c/p\u003e\n\u003cp\u003e“I’ll start counting.”\u003c/p\u003e\n\u003cp\u003e“First,” said the captain. “She’s been married before.”\u003c/p\u003e\n\u003cp\u003e“Widowed?”\u003c/p\u003e\n\u003cp\u003e“Her husband died in the war.”\u003c/p\u003e\n\u003cp\u003e“And what’s number two?” Troost asked.\u003c/p\u003e\n\u003cp\u003e“Number two is her father. If you decide to have a word with her, you’d best do it while he’s still on crutches.”\u003c/p\u003e\n\u003cp\u003e“Is he a big man?”\u003c/p\u003e\n\u003cp\u003e“Yup.”\u003c/p\u003e\n\u003cp\u003eKirby Troost said, “Good. They’re the easiest kind to outrun.” And then, as Yaozu strolled into the compound area he added, “Men like that one, on the other hand…”\u003c/p\u003e\n\u003cp\u003eAs was so often the case, the lord and master of King Street Station was dressed in white except for his shoes—making him easy to recognize, even in a mask that obscured his face. He moved ghostlike through the foggy gas, which thickened and thinned in clumps around him, parting for his passage.\u003c/p\u003e\n\u003cp\u003e“Captain Cly,” he said. “I trust Houjin gave you my requests?”\u003c/p\u003e\n\u003cp\u003e“Got ’em right here,” he said, patting the vest pocket where all his lists went. “Some of this will take some looking for, but I’ll scare it up.”\u003c/p\u003e\n\u003cp\u003e“Of that I have no doubt. But there’s still the matter of how you’ll pay for it. I’m certain your credit is good from coast to coast, but money speaks louder than reputation, and some of my requests are expensive.” After reaching into the folds of his long pale jacket, he extracted a pouch. “This should cover everything, with some to spare. And you’ll find the second half of your fee when you return. Now, at the risk of making a sudden shift in conversation, is this your new crewman? I understand that Rodimer died last year.”\u003c/p\u003e\n\u003cp\u003e“That’s right.” Cly answered both questions at once. “This is my new engineer,” he said, indicating Troost.\u003c/p\u003e\n\u003cp\u003e“You seem … very familiar to me,” Yaozu said, squinting through his visor at the smaller man, who squinted back through his own.\u003c/p\u003e\n\u003cp\u003eTroost said, “Can’t say we’ve ever met. It’s hard to tell with these masks.”\u003c/p\u003e\n\u003cp\u003e“You’re right, of course. Still, there’s something about you. Whatever it is, it reminds me of someone I met years ago, in a desert town called Reno.”\u003c/p\u003e\n\u003cp\u003e“Never been there.”\u003c/p\u003e\n\u003cp\u003e“Never once? Are you certain?”\u003c/p\u003e\n\u003cp\u003e“Well,” the engineer said. His tone oozed contrived carelessness. “Since you’ve asked me to reconsider, I’ll have to think on it. I’ve done a lot of traveling in my time.”\u003c/p\u003e\n\u003cp\u003eYaozu said, “It’s possible I’m mistaken. At any rate—” He held out the pouch to the captain.\u003c/p\u003e\n\u003cp\u003eCly took it and stuffed it into the pocket with his lists. It made a heavy bulge against his chest, but he was layered up against the blight, and it did not show through his clothes. “I appreciate the vote of confidence.”\u003c/p\u003e\n\u003cp\u003e“And I’ll appreciate receiving everything I’ve asked for. Make no mistake, this is a vote of confidence.”\u003c/p\u003e\n\u003cp\u003e“I’ll be back in one piece, with all your goodies.”\u003c/p\u003e\n\u003cp\u003e“Oh, I know you’ll be back,” Yaozu said, glancing over his shoulder. “I can count on the fact that you’re too smart to come back empty-handed.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Cly said, ignoring the unsavory implications—not because he doubted Yaozu’s sincerity or capacity to be unpleasant, but because he had no intention of letting him down. He’d be back, and they both knew it.\u003c/p\u003e\n\u003cp\u003eBriar arrived, emerging from the station house with Mercy, who had finished making her revisions. The nurse gave her list to the captain, and she told him, “It’s no small thing, you doing this. They trust you around here, don’t they?” \u003c/p\u003e","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-14.html","bookId":1669,"creation":"Oct 5, 2019 10:16:09 PM","modification":"Oct 5, 2019 10:16:09 PM"}
