{"id":102312,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAt a quick, casual count, Cly estimated perhaps two dozen men in the camp, the majority of them dark skinned and wearing Union uniform pieces in much the same way that the Texians wore their own garb—without any attention paid to the official lines of the garments. Everything was adapted to the thick, wet warmth that was trapped there in the swamp. Everything bowed to the dense heat and close-pressing smell of vegetation being soaked in its own rot—of new plants and freshly broken branches, of stringy grass filaments and gray-felt moss, and the leftover whiffs of catfish fried at an earlier meal but long since eaten.\u003c/p\u003e\n\u003cp\u003eShirts were left open, and sleeves were rolled to elbows. But pants were worn down long, sometimes cinched at the ankles or tucked into boots. Cly understood. There were places where a man didn’t dare walk with his ankles unprotected, regardless of the temperature, for fear of stinging insects, snakes, and thorns.\u003c/p\u003e\n\u003cp\u003eFrom the corner of his eye, he watched Houjin stick a finger into the mandarin collar of his shirt and wipe away the dampness that collected there. Then the boy swiped at the back of his neck, at the place where his ponytail hung over the collar, and his hand came away wet with perspiration there, too.\u003c/p\u003e\n\u003cp\u003eThe buggy was lured up beneath yet another canopy, which was not otherwise covering anything. It was guided into place by a thickly muscled man with skin that gleamed with humidity and sweat, and hair that grew into a soft black halo. Using both hands, he helped Norman Somers park the machine in the perfect position, where every edge, bumper, corner, and cranny would be covered by the net of manipulated foliage.\u003c/p\u003e\n\u003cp\u003e“Welcome to camp!” Somers announced. “Everybody be careful getting down, you hear? And stay to the walkways when you can. The earth is half made of mud, my friends. Ruthie, love—you especially. Shall I help you down?”\u003c/p\u003e\n\u003cp\u003e“Mr. Somers, I am always happy for your assistance,” she said, with a bat of her eyelashes.\u003c/p\u003e\n\u003cp\u003eWhen everyone had left the buggy and no one was standing in the mud, the man who’d guided them into the shelter said, “Folks, I’m Rucker Little, and I’m second in command here after Deaderick Early. You,” he said to Cly, “must be the captain Josephine’s been telling me about.”\u003c/p\u003e\n\u003cp\u003e“Yes, yes, I am,” he said, extending a hand and receiving a shake. “I’d ask how you knew, but Ruthie’s already said that my description is going around.”\u003c/p\u003e\n\u003cp\u003e“Tall son of a bitch, that’s what Josie told us,” he said. “And this must be the rest of your crew?”\u003c/p\u003e\n\u003cp\u003eHis question called for introductions, and these were made.\u003c/p\u003e\n\u003cp\u003eBy the time the captain had finished, two more men had approached, and these were identified as Chester Fishwick and Honeyfolk Rathburn. Like Rucker Little, they had served in the Union’s colored troops, and they carried themselves like men who’d seen the inside of a military operation.\u003c/p\u003e\n\u003cp\u003eOnce everyone was formally acquainted, Chester Fishwick said, “I can take you to Josephine, if you like. She’s with her brother, in his place. There’s not much room for the whole gang in there, but I expect Rucker would be happy to give the rest of you folks a tour of the camp. When you’re finished speaking with Miss Early, we’ll take you out to the Ganymede so you can see it for yourself.”\u003c/p\u003e\n\u003cp\u003e“I’d appreciate that,” Cly said, and seeing that everyone agreed to this arrangement, he followed after Chester, who led him up to one of the tree houses closest to the lake’s edge—though he did not realize how close it was until he’d scaled the ladder. From halfway up it, he could tell that they were in fact quite near to Pontchartrain, no more than fifty yards away from one of its banks.\u003c/p\u003e\n\u003cp\u003eThe ladder creaked beneath Cly’s weight, the willow wood flexing and springing as he climbed from rung to rung behind Chester Fishwick, who scaled the thing swiftly, like a man who did so every day and no longer needed to think about the particulars of hanging on, stepping precisely, or watching his head. At the top, the captain hauled himself over the edge and into a cabin that seemed larger on the inside than the outside would have led him to expect.\u003c/p\u003e\n\u003cp\u003eAgain contrary to its outer appearance, the cabin was not remotely rustic. If anything, it looked like the headquarters of an advanced operation. Texian manuals and tools were shelved and mounted on the walls; a large chalkboard was covered with mathematical formulas and maps; and high-grade military guns were racked beside the door, their ammunition boxed beside them in crates with precise stencils detailing the contents. Mosquito curtains hung from the ceiling, but were tidily bundled above a row of three cots, or draped across the open windows to function as screens.\u003c/p\u003e\n\u003cp\u003eOn the edge of one cot sat a man with wide, strong cheekbones and skin the color of coffee. His hair was long and braided tightly into rows, and his chest and shoulder were swaddled in a bandage fashioned from clean cotton strips.\u003c/p\u003e\n\u003cp\u003eBeside him on a small camp stool sat Josephine Early, looking not remarkably different from the last time Cly had set eyes upon her. She rose from the camp stool and her brother—for the resemblance was not overwhelming, but decidedly present—shifted his weight as if he’d like to do the same. But she stalled him with a hand upon his unbound shoulder.\u003c/p\u003e\n\u003cp\u003eTen years had left her body fuller by perhaps that same number of pounds, as if she’d grown into her age. It looked good on her, Cly thought. And he tried not to think any harder about other things that had looked good on her, in other times.\u003c/p\u003e\n\u003cp\u003eNow she wore a dress that was out of place among the camp full of men; it was too fancy by at least five dollars, and its fabric was meant to shimmer in a ballroom rather than perch upon a stool. It was easy to see that she still wore whatever she’d arrived in. She’d tucked up the lace on her sleeves and traded her pretty boots for a brown set of workman’s footwear—though the boots, as well as a beaded bag and a light brocade jacket were folded as carefully as if they were in a shop-front window. They rested underneath the next cot.\u003c/p\u003e\n\u003cp\u003eBefore the captain could summon any words, Josephine said to him, “Cly, I can’t believe you came.”\u003c/p\u003e\n\u003cp\u003e“Well, you asked me to.”\u003c/p\u003e\n\u003cp\u003e“I guess this isn’t exactly what you expected.”\u003c/p\u003e\n\u003cp\u003e“Not exactly.”\u003c/p\u003e\n\u003cp\u003e“But, you’re here.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I am.”\u003c/p\u003e\n\u003cp\u003eThe man on the cot said, “I’m Deaderick Early—and I don’t believe we met, last time you were passing through New Orleans.”\u003c/p\u003e\n\u003cp\u003e“I don’t believe we did. You were off in the war, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“Sounds about right. It’s good to meet you now,” he said, and since Josephine had stood, he stood as well—with effort and some pain, but also with dignity. He extended a hand and Cly shook it. “And it’s good of you to come.”\u003c/p\u003e\n\u003cp\u003e“Rick, sit yourself back down,” his sister told him, more gently than crossly. “You’re supposed to be resting.”\u003c/p\u003e\n\u003cp\u003eCly saw a chance to be helpful, so he went to pull up a stool and said, “We should all sit. We’ve got some talking to do.” But upon getting his hands on one of the stools, he changed his mind and said, “I suppose I’ll just go cross-legged,” for he didn’t think the chair would hold his weight.\u003c/p\u003e\n\u003cp\u003eChester Fishwick took the seat instead, and when they were all settled again—Deaderick wincing and Josephine working hard to keep from babying him in front of the other men—the captain said, “So I hear you’ve got a big boat, only it’s not exactly a boat. And you want me to fly it.”\u003c/p\u003e\n\u003cp\u003e“That’s the sum of it,” Deaderick said.\u003c/p\u003e\n\u003cp\u003eWhile Cly figured out what else to add, and how to add it, Houjin’s excited voice carried through the windows, spouting a list of questions a mile long. Cly said, “The kid must’ve found Mr. Worth.”\u003c/p\u003e\n\u003cp\u003e“The lens-maker?” Josephine asked. “Yes, he’s here. Who’s the kid?”\u003c/p\u003e\n\u003cp\u003e“He’s apprenticing with me. Smart boy. Wants to know how everything works, and he’s real excited about that gate you folks have set up—the one with the mirrors. Norman Somers said a guy named Worth designed it, and now Huey needs to hear the details. But I’m not here to tell you about my crew. I’m here to hear about your ship.”\u003c/p\u003e\n\u003cp\u003eDeaderick took a deep breath that appeared to sting. He said, “I’m not sure how much the ladies have told you already.”\u003c/p\u003e\n\u003cp\u003e“The history of it, mostly. And I’ve seen the engineer’s drawings, the ones that show most of the workings. But I’m still trying to wrap my head around how to operate it, or get it to the ocean. I mean, I can tell from what little I’ve seen of your camp that you fellows have plenty of good machines and good mechanics to keep them running. Surely someone here can pilot your bird. Your fish,” he corrected himself.\u003c/p\u003e\n\u003cp\u003eChester declared, “We have four mechanics from the schools at Fort Chattanooga, and a couple of men who trained in the machine shops in Houston. So yes, we’re all set for men to make and maintain what we’ve got, that’s a fact. But the men we have … they’re drivers and sailors. They’re engineers who’ve worked on rolling-crawlers and the big diesel walkers the Rebs are using on the northern fronts. They aren’t men who know much about airships, or this kind of … watership.”\u003c/p\u003e\n\u003cp\u003eDeaderick added, “I think they could be forgiven for not knowing much about the Ganymede. Everyone who ever understood it is dead or in prison, miles and miles away from here. The Ganymede is a tribe of one. Wallace Mumler wants to call it an undermariner, but that’s a mouthful, isn’t it? Hunley called these things submarines, so that’s what I’m sticking to.”\u003c/p\u003e\n\u003cp\u003eJosephine smiled, every bit as cool and measured as he remembered she was capable of being. “Chester and Rucker, and Deaderick here, and Edison Brewster, and Honeyfolk—they all know how it works. They can tell you what every lever means and what every button does, but not a one of them knows how to turn the thing in a full circle without so much shouting, arguing, and complicated finesse that you can’t imagine them ever moving it down the river. These men have all the paper know-how, and none of the hands-on experience to pilot the thing correctly.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-34.html","bookId":1669,"creation":"Oct 5, 2019 10:16:09 PM","modification":"Oct 5, 2019 10:16:09 PM"}
