{"id":102328,"no":50,"title":"Page 50","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt made Cly’s skin crawl, and Kirby Troost’s, too—the captain could see it when he glanced over at the engineer. Troost looked queasy. One arm over his stomach. One hand over the weakly illuminated dial that showed how far down they’d come, and how much farther they could reasonably go.\u003c/p\u003e\n\u003cp\u003eHoujin, on the other hand, was vibrating with excitement. They’d stationed him at the mirrorscope he’d liked so much upon first encounter; now it was his job to stay there and report what was coming and going whenever it was safe to leave the tube up in the open air. He turned it side to side, a voyeur to adventure, and the metal tube’s joints squeaked despite their fresh greasing.\u003c/p\u003e\n\u003cp\u003e“What do you see?” Troost asked the boy.\u003c/p\u003e\n\u003cp\u003e“The other boats—the little ones, the rafts and skimmers. They’re moving into place and coming up behind us. Ooh! Norman sees me looking at him! He’s waving us forward.… He wants us to pull ahead.”\u003c/p\u003e\n\u003cp\u003e“Is there anything or anyone in front of us?”\u003c/p\u003e\n\u003cp\u003e“No, sir, and I’ll say so, if I see something.”\u003c/p\u003e\n\u003cp\u003e“Then here goes,” he breathed, and he engaged the back propeller screws. Slowly he toggled their controls. The hum of the engines was not quite loud in their ears, but it felt very close all the same. “Everyone hang on. We’re headed into the current.”\u003c/p\u003e\n\u003cp\u003eHe gritted his teeth, not knowing what to expect. It might be easy as a cloudless day, or it might be bad as a hailstorm.\u003c/p\u003e\n\u003cp\u003eThe ensuing jolt was a little of both.\u003c/p\u003e\n\u003cp\u003eGanymede bobbed forward and was caught very quickly in a full-surface tug as the Mississippi River got a grip on the craft and hurled it forward. The ship swayed, forcing everyone to take hold of whatever handles they could find; Houjin’s feet slid out from under him, leaving him hanging by the crook of his elbows from the scope.\u003c/p\u003e\n\u003cp\u003eBut Fang’s expert handling of the thrusters soon had the ship aimed steadily downriver, resisting the left and right yanks of the underwater pathways surging beneath the surface, so that it only twitched back and forth instead of swinging out of control.\u003c/p\u003e\n\u003cp\u003e“This isn’t like the lake,” Cly complained, wrestling with the foot pedals. “And it ain’t like flying.”\u003c/p\u003e\n\u003cp\u003eKirby Troost, now fully green around the gills, said, “Bullshit, sir. It’s the same thing as flying; you just have to find a current and ride it.”\u003c/p\u003e\n\u003cp\u003e“But the currents are all over the place!” he declared. “And I can’t see a goddamn thing.…”\u003c/p\u003e\n\u003cp\u003e“Can’t up in the sky, either. Find the flow and hold it.”\u003c/p\u003e\n\u003cp\u003e“I’m trying, all right?”\u003c/p\u003e\n\u003cp\u003eGanymede dropped precipitously, and bounced up again. Troost said, “Goddamn,” and clutched at his mouth.\u003c/p\u003e\n\u003cp\u003e“Hang in there, Kirby. Hang in there, everybody. I’ll find it.” He fought with the controls, watching out the forward windows that told him almost nothing about where they were going, or even what direction he was headed. He could feel the river shoving at his back, so he could assume they were headed east and south, since that was the curve and flow of the Mississippi from where they started. “Troost?”\u003c/p\u003e\n\u003cp\u003eOminously, he burped. “East-southeast, sir.”\u003c/p\u003e\n\u003cp\u003e“Fang, you’re doing great. Keep us from spinning, and I’ll get us level,” he vowed.\u003c/p\u003e\n\u003cp\u003eHoujin was once more standing upright, and now he was braced that way with his legs locked. “The bayou boys are catching up to us, sir. They lost us for a minute. We caught a drag,” he said, using the slang he’d picked up overnight. “Can you slow down any?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Can you … I keep losing the view,” he warned. “Every time we dip under. I can’t adjust this thing in time to keep it steady.”\u003c/p\u003e\n\u003cp\u003e“Not your fault. I’m the one making trouble over here.”\u003c/p\u003e\n\u003cp\u003e“No,” Deaderick corrected. “It’s the river. She’s fighting you. Fight her back, and hold her off.”\u003c/p\u003e\n\u003cp\u003e“I’m working on it.”\u003c/p\u003e\n\u003cp\u003eAndan Cly closed his eyes. Looking out through the window into the swirling, sediment-packed void wasn’t doing him any good, and the dim red lights of the ship’s interior told him only where to put his hands and feet—which he knew already. His hands were primed on the levers. His feet were propped against the pedals that would expel water or draw it into the tanks, changing the underwater “altitude.”\u003c/p\u003e\n\u003cp\u003eOr whatever it was called, there below the waves.\u003c/p\u003e\n\u003cp\u003eFor half a minute he was breathless, considering and reconsidering how absurd this situation was—how impossible, and how bizarre it had become. But in the next half minute, he calmed as he sat there, holding fast to the instruments and feeling the water moving around Ganymede—pulling and pushing, urging and demanding, crushing and jostling—and some deep instinct told him not to worry.\u003c/p\u003e\n\u003cp\u003eIt’s only water, he told himself. Only a storm. As above, so below.\u003c/p\u003e\n\u003cp\u003eHe let instinct move his arms and guide his feet, and he told himself it was only the thrusting power of a hurricane—water below, moving no differently from the air above. It wasn’t quite true: the tug was different; the force was different. The weight of the craft was different, too, and it handled more slowly, more heavily.\u003c/p\u003e\n\u003cp\u003eBut it handled. It worked. And soon the craft was stable.\u003c/p\u003e\n\u003cp\u003eCly opened his eyes and gazed out through that near-useless window, and saw that Deaderick was standing now, blocking part of the view by looking out into the shimmering, brown-black panorama. In silence, the whole crew stared as the whirling waters went streaking ahead in curls and coils. Fish pirouetted past, their gleaming silver and gray bodies standing out like a flicker of gas lamps as seen from above a city. River-borne driftwood crashed along, smacking the metal exterior, cracking against the window, and spiraling away.\u003c/p\u003e\n\u003cp\u003eThey were within the abyss, and it carried them.\u003c/p\u003e\n\u003cp\u003eBut it did not dash them to bits like the driftwood, or hurl them beyond their abilities.\u003c/p\u003e\n\u003cp\u003eHoujin whispered, as the moment called for whispering. “Captain, Norman Somers and Rucker Little are caught up, and the other craft are fanning out. They’re giving us the signal. They’re telling us to go forward.”\u003c/p\u003e\n\u003cp\u003e“Forward. Sure. Here we go. Hey, Mumler, refresh my memory—what’s our first refueling stop?”\u003c/p\u003e\n\u003cp\u003e“We’re stopping at Jackson Avenue, near the Quarter, but not right on top of it. There’s a ferry stop where we’ve got enough friends to be left alone and we can still dock without any problems. We’d pick up Josephine closer to home, except we don’t want to run into any of the zombis.”\u003c/p\u003e\n\u003cp\u003e“Zombis?” Houjin asked, peeking his head around the side of the visor.\u003c/p\u003e\n\u003cp\u003e“I’ll fill you in later,” Cly promised him. “All right, let’s go. We know the general course, but not the particulars. Mumler, you’re on point. Stick with Kirby; he’s got the instruments to tell us where we are, and you’ve got the know-how to tell us where to go. Me and Fang will keep this thing as steady as we can. Huey, you’re our eyes above the water. Tell me if we get out of range, or if we outpace our escorts. And someone’s gotta listen for their taps. Kirby?”\u003c/p\u003e\n\u003cp\u003e“I’ll keep my ears peeled for ’em,” he said. Troost was the fastest and best at understanding Morse, so it became his job to listen—in addition to the rest of his duties. If indeed he could listen as he wrestled with his digestive situation.\u003c/p\u003e\n\u003cp\u003e“Good man, Troost. And good on you, keeping everything inside. You’ll get your sea legs soon enough. Mumler, what about our air supply? How are we looking?”\u003c/p\u003e\n\u003cp\u003e“Fine for now,” Wallace told him. “We won’t need to worry about circulating it for another half hour.”\u003c/p\u003e\n\u003cp\u003e“Somebody keep an eye on a clock.”\u003c/p\u003e\n\u003cp\u003eMumler said, “That’ll be me. I’ve got my dad’s watch. It’s as precise as any nautical piece.”\u003c/p\u003e\n\u003cp\u003e“It’d better be. By the time we know we have a problem, it’ll be too late—that’s what Rucker said.”\u003c/p\u003e\n\u003cp\u003e“And he’s right. But we could go closer to an hour without having to worry about it.”\u003c/p\u003e\n\u003cp\u003e“Glad to hear it,” the captain said. He flinched as a submerged tree trunk careened toward the window, hit it, and ricocheted away. “Jesus.”\u003c/p\u003e\n\u003cp\u003e“The window will hold,” promised Mumler. “Don’t worry about that. Just keep us moving.”\u003c/p\u003e\n\u003cp\u003eCly urged the pedals in accordance with the flow, his hands on the levers to manage their rise and fall; Fang worked the other set of controls, the ones that moved the ship from side to side. Between them, Ganymede’s trip downriver was not smooth or even graceful, but it was steady, and they neither sank too far nor rose too high.\u003c/p\u003e\n\u003cp\u003eOut of the corner of Cly’s eye, he watched his engineer go green around the gills, and prayed the man wouldn’t vomit … even as he was forced to admit that the submarine was giving them one hell of a wild ride. “Troost?” he called.\u003c/p\u003e\n\u003cp\u003e“Yes … Captain?”\u003c/p\u003e\n\u003cp\u003e“You still with us over there?”\u003c/p\u003e\n\u003cp\u003e“Still here, sir. Hey, Mumler, Early—I’ve got an idea for an improvement, for the next model.”\u003c/p\u003e\n\u003cp\u003eDeaderick asked, “What would that be?”\u003c/p\u003e\n\u003cp\u003e“Buckets.”\u003c/p\u003e\n\u003cp\u003e“Huey,” said the captain. “How’s our escort?”\u003c/p\u003e\n\u003cp\u003e“Sticking with us, sir. Some of them better than others. The little boats with the little motors are doing best, them and the ones with the big fans.”\u003c/p\u003e\n\u003cp\u003e“Those guys have poles, don’t they?”\u003c/p\u003e\n\u003cp\u003e“They do, Captain. But in this current, with all this movement … I don’t know. I hope they can keep up.”\u003c/p\u003e\n\u003cp\u003eCly said, “When we stop at—what was that, Jackson Street?—to pick up Josephine and whoever she brings along, we can have a quick conference with the topside men and see how they’re doing.”\u003c/p\u003e\n\u003cp\u003eThe Ganymede continued half-carried, half-piloted farther down the wide, muddy ribbon of river. Mostly she stayed away from debris, and mostly they stayed satisfactorily submerged, bobbing above the surface only once, and then diving again immediately. No one saw them, though, or if anyone did, no one knew what it was, and no one was alarmed. \u003c/p\u003e","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-50.html","bookId":1669,"creation":"Oct 5, 2019 10:16:09 PM","modification":"Oct 5, 2019 10:16:09 PM"}
