{"id":102333,"no":55,"title":"Page 55","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Sir!” he said. “Take us a lower, and do it now!”\u003c/p\u003e\n\u003cp\u003e“You want me to swamp your scope?”\u003c/p\u003e\n\u003cp\u003e“Now!”\u003c/p\u003e\n\u003cp\u003e“All right, kid,” he said, and he worked his foot to change their depth until everything—including the oscillating scope—was withdrawn back under the waves. “What’s going on up there? Talk to me, Huey.”\u003c/p\u003e\n\u003cp\u003e“Dirigible, incoming. Coming down fast, hard, and on fire,” he announced.\u003c/p\u003e\n\u003cp\u003e“Coming down on top of us?”\u003c/p\u003e\n\u003cp\u003e“Close enough as makes no difference!”\u003c/p\u003e\n\u003cp\u003eDeaderick stiffened in alarm. “What about Rucker and Wally?”\u003c/p\u003e\n\u003cp\u003e“Last I saw, they pulled a hard reverse and they’re getting out of the way. I don’t think they’ll be cut off from us, but we might have to lose them for a few minutes.”\u003c/p\u003e\n\u003cp\u003eA splashing crash shook the liquid volume of the canal, throwing Ganymede to the right and shoving it upward. The top of the window briefly breached the surface again, before diving back below in a sudden sinking that Cly struggled to control.\u003c/p\u003e\n\u003cp\u003e“Goddamn!” Deaderick Early cursed, pointing out the window where the wreckage of something huge was coming down in pieces, still burning and bubbling, and giving the whole canal the brilliant flickering glow of a fishbowl in front of a candle.\u003c/p\u003e\n\u003cp\u003e“Troost?”\u003c/p\u003e\n\u003cp\u003e“Rev it up and gun it, sir. That’s my advice!”\u003c/p\u003e\n\u003cp\u003e“I like the way you think,” Cly said gruffly, and pushed hard on the lever that powered the propulsion screws. “I just wish we could see where the damn thing above us was crashing, exactly.”\u003c/p\u003e\n\u003cp\u003eThe engineer clutched the sides of his console as Ganymede surged and wobbled forward, quivering in its path. Eventually Fang got a handle on the new speed and could keep it steady once more.\u003c/p\u003e\n\u003cp\u003eTroost was not quite shrill when he barked a sudden complaint, “It’s right on top of us!”\u003c/p\u003e\n\u003cp\u003e“Settle down, Kirby. We’re almost past it, I think.”\u003c/p\u003e\n\u003cp\u003eSomething huge squashed down on top of Ganymede’s hull. The resulting ruckus threw Deaderick to the floor, cast Troost out of his seat and sent him careening into the wall, and elicited a pained shout from the bays where the charges were being prepared and loaded.\u003c/p\u003e\n\u003cp\u003eHoujin fell off his seat and spun around, holding the scope for support, then clamored back into position.\u003c/p\u003e\n\u003cp\u003e“Huey, get a grip on something! Hang on!”\u003c/p\u003e\n\u003cp\u003e“Sir, we need to see outside!” he shouted, and turned the crank to raise it. “I can help, if I can see!”\u003c/p\u003e\n\u003cp\u003eCly’s knuckles were white and going numb from his death grip on the levers, but he hadn’t lost his seat yet. “Everyone all right?” he cried. “Everyone?” he said again when no one responded fast enough.\u003c/p\u003e\n\u003cp\u003e“I’ll live,” Troost groused as he crawled back over to his chair. Cly gave him a quick look and saw no blood, and no broken bones.\u003c/p\u003e\n\u003cp\u003eHoujin announced, “I’m fine, sir—and I can see it. Part of it hit us.”\u003c/p\u003e\n\u003cp\u003e“Are we high enough for you to get that scope out of the water? How can you see a damn thing?”\u003c/p\u003e\n\u003cp\u003e“No, sir, it’s underwater, but I can see the hull of something big—it landed halfway on us, and halfway on the canal’s edge. We scooted out from under it. We’re fine. Just get us up and moving.”\u003c/p\u003e\n\u003cp\u003e“I’ll take you at your word, kid.”\u003c/p\u003e\n\u003cp\u003e“I’m not saying there isn’t more debris, because there is.”\u003c/p\u003e\n\u003cp\u003e“I’ll take that under advisement. Hey, ladies? You all right in there? I heard a scream?”\u003c/p\u003e\n\u003cp\u003eJosephine replied, “We’ll be fine, I’m sure—you just get us to the Gulf.”\u003c/p\u003e\n\u003cp\u003eCly didn’t like the sound of that. Deaderick didn’t either, but Cly barked, “Early, you know how to keep this in a straight line, for a few minutes?”\u003c/p\u003e\n\u003cp\u003e“I can if I have to. I think—?”\u003c/p\u003e\n\u003cp\u003e“Get over here and take my seat,” he said. As Deaderick approached, Cly cut the thrust to the screws and Ganymede’s progress slowed to the proverbial crawl. “Hold her steady, will you? We’ll give your men up top a chance to catch up.”\u003c/p\u003e\n\u003cp\u003e“I’ll give it a shot.”\u003c/p\u003e\n\u003cp\u003e“I have every faith…,” he said, abandoning his position to Early as soon as the other man was able to take it. “Josephine? Ruthie?” he called as he approached them, ducking low and swinging himself through the portal-shaped doorway that separated the main control deck from the side bay where the charges were kept and readied.\u003c/p\u003e\n\u003cp\u003e“Cly, give us a minute—we’ll be fine,” Jo said with caution and control in her voice, not yet realizing that he was already there, in the room with her. She was bent over Ruthie, who was moaning unhappily on the ground, holding on to her head. “Andan! Get back to your seat! She knocked her head, that’s all. She’s not hurt bad, and she’ll be up again shortly.”\u003c/p\u003e\n\u003cp\u003e“Thank you … for your worry, Captain,” Ruthie told him, giving him a look that dared him to come and assist her. But Cly was the sort to take a dare, so he went to her other side—the one Josephine didn’t occupy—and slipped an arm underneath her to lift her up.\u003c/p\u003e\n\u003cp\u003e“Andan, don’t!” Josephine was firm now, commanding. “Let her be!”\u003c/p\u003e\n\u003cp\u003eHe ignored her. “Ruthie, you all right? What happened?”\u003c/p\u003e\n\u003cp\u003e“No, don’t—,” she begged. “I’ve torn my dress. It caught on the charge launch door.…”\u003c/p\u003e\n\u003cp\u003eToo late. He used his long arms and considerable strength to sweep her gently onto her feet and place her in a seated position on the edge of the chute.\u003c/p\u003e\n\u003cp\u003eAt this point, he realized that she was right—her dress was torn.\u003c/p\u003e\n\u003cp\u003eThe outer skirt was ripped away like an apron pulled off a doll, leaving only light cotton undergarments between her and the world. She did not quite swoon, though she was clearly in some pain from a lump rising on her forehead; nonetheless, she struggled to collect the torn fabric and cover herself.\u003c/p\u003e\n\u003cp\u003eBut in the instant between Ruthie being covered and uncovered, the undergarments had been her only shield, and they had not covered nearly enough. And in that brief occasion, many things occurred to Cly at once, chief among them being precisely why Ruthie Doniker, popular whore, had such a fierce desire to keep herself covered—there inside the Ganymede, where at least half her companions were unaware of a secret that surely couldn’t have been much of a secret.\u003c/p\u003e\n\u003cp\u003eIt blindsided Cly all the same.\u003c/p\u003e\n\u003cp\u003eAstonished, he turned to Josephine as if seeking some explanation—but all he found was the barrel of a gun pointed at his face.\u003c/p\u003e\n\u003cp\u003eOver the barrel he saw Josephine’s eyes, and they were harder and colder than an iceberg. Quietly she told him. “Do not say a word.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“That’s a word, Andan.”\u003c/p\u003e\n\u003cp\u003eHe whispered, lest he alert anyone in the other room. “You’re not going to shoot me, Josie.”\u003c/p\u003e\n\u003cp\u003e“I might.”\u003c/p\u003e\n\u003cp\u003e“For … for…?” He bobbed his chin toward Ruthie, who would’ve rendered him dead on the spot if looks could do such things.\u003c/p\u003e\n\u003cp\u003e“For Ruthie, yes. And for the Garden Court, where she is adored by a good number of people, all of whom would prefer to have their privacy protected. I guarantee that privacy, Andan. And I won’t let anyone ruin it.”\u003c/p\u003e\n\u003cp\u003e“You’re not going to shoot me, Josie,” he said again, still so softly that no one could’ve heard it over the rumble of the engines and the clatter of debris still raining slowly down upon the hull from the burning crafts above them and, increasingly, behind them.\u003c/p\u003e\n\u003cp\u003e“You’re right.” She lowered the gun and uncocked it. “Because you’re probably not the type to go running off at the mouth about things that are no business of yours. Unless something’s changed since we last knew each other well.”\u003c/p\u003e\n\u003cp\u003eSlowly he said, “No, no. That hasn’t changed.” He looked away from his old lover and down at Ruthie again, who was still glaring at him. But somewhere under her glare he saw the source of her anger, and it wasn’t an impinged-upon sense of propriety.\u003c/p\u003e\n\u003cp\u003eIt was fear.\u003c/p\u003e\n\u003cp\u003eStill speaking in increments, every word that emerged cloaked in quiet, and confusion, he said, “But she’s … she’s not … she’s not a she.”\u003c/p\u003e\n\u003cp\u003eJosephine brought the gun up again. Maybe not to shoot. Maybe to make a point. She lifted it and aimed it at Cly as if holding it gave her some power she otherwise lacked—and maybe it did. “She is one of my ladies, Andan. And if I ever hear you say a word to the contrary, even implying anything to the contrary, I swear to God, you will regret it to the end of your days.”\u003c/p\u003e\n\u003cp\u003eThen she turned the gun away from his face and stuck it back under her skirt, in the leg holster he’d all but forgotten she sometimes wore.\u003c/p\u003e\n\u003cp\u003eStill pondering a hundred different questions raised by the contents of Ruthie Doniker’s undergarments, Cly stood there stupidly, gazing back and forth between them. Finally he mustered the gumption to ask, “So … people. Men, I mean. They know?”\u003c/p\u003e\n\u003cp\u003e“Of course they know!” Josephine whispered. “And if you think she’s the only woman in the world with a secret like hers, you’re an idiot. But not every man, everywhere knows. It’s not the kind of thing everyone understands.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“I know you don’t. But I don’t believe you’re the kind of man to go on a holy rampage about it, either. You’ve always lived and let live, Andan, and I hope that’s still the case. I’d hate to have to shoot you in order to shut you up.”\u003c/p\u003e\n\u003cp\u003e“No one has to shoot me. I’m shocked silent, anyhow.”\u003c/p\u003e\n\u003cp\u003e“Good,” she told him. “And you damn well better stay that way. Nothing you’ve just now learned, seen, or figured out means a damn thing to what we’re trying to do here. Now, get back to your seat and get this ship back up in the water. Who’d you leave in charge?”\u003c/p\u003e\n\u003cp\u003e“Your brother.”\u003c/p\u003e\n\u003cp\u003e“Go relieve him. We’ll sort out this ammunition over here, like I said we would.”\u003c/p\u003e\n\u003cp\u003e“Sure,” he said. Then, with one more look at Ruthie, he asked, “Are you … are you going to be all right?” \u003c/p\u003e","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-55.html","bookId":1669,"creation":"Oct 5, 2019 10:16:09 PM","modification":"Oct 5, 2019 10:16:09 PM"}
