{"id":64799,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMarguerite had returned to Paris.\u003c/p\u003e\n\u003cp\u003eHe had expected as much, which was why he’d paid the maid to join Solange’s household so many years ago. It was a simple, relatively inexpensive thing to keep the woman on retainer, and he had known that one day the expense would prove valuable.\u003c/p\u003e\n\u003cp\u003eNothing could be allowed to alter the course of events put into motion two decades ago.\u003c/p\u003e\n\u003cp\u003eMost especially not Marguerite Baillon.\u003c/p\u003e\n\u003cp\u003eCorinne’s house was quiet as a tomb by five o’clock in the evening.\u003c/p\u003e\n\u003cp\u003eEdward sat at her dainty escritoire and worked quietly, his gaze moving to the bed at regular intervals to monitor her breathing. He had returned just a little past four and found her raging with fever and incoherent. The staff was exhausted. The footman had run to and fro for water all day and the housekeeper had given Corinne cooled cloth baths until her arms were protesting their exhaustion with tingling aches. When Edward arrived, they had conceded Corinne’s care to him with undisguised gratitude. He in turn, appreciated the many hours he had spent researching how best to care for an invalid in her condition.\u003c/p\u003e\n\u003cp\u003eHe had immediately relocated her to a guest room. There, Madame Fouche removed the soiled night rail from her body, while Edward stripped her bed and remade it with fresh linens. He’d ordered that Corinne be bathed again and that vodka should be rubbed beneath her arms, behind her neck, and into the soles of her feet. She smelled like a drunkard now, but her temperature had cooled considerably. She’d then been swaddled like a child and he had returned her to the comfort of her freshly made bed.\u003c/p\u003e\n\u003cp\u003eIn appreciation for their efforts, the Fouches had been dismissed early. Their son, Thierry—who was around the same age as Edward’s score, ten, and three years—remained in service. With only two people left awake in the house, it was eerily silently in contrast to the explosion of activity just an hour ago. The thick blanket of peace left Edward with too much time to contemplate his involvement in Corinne’s life and too little in the way of answers.\u003c/p\u003e\n\u003cp\u003eThat was why, when the door knocker was rapped impatiently, Edward felt relief. It was a distraction when he felt in desperate need of one.\u003c/p\u003e\n\u003cp\u003eHe paused with his quill suspended above parchment, his hearing alert. A moment later he heard voices, too distant to be distinguished. Expecting Desjardins, he waited for the sound of footsteps approaching. When they did not come, Edward pushed to his feet and walked through the open door into the gallery.\u003c/p\u003e\n\u003cp\u003eFrom there, he looked directly down the stairs into the small, marble-lined entry. Thierry stood in the front doorway, speaking at length with whoever stood there. Finally, the servant retreated into the house and closed the door.\u003c/p\u003e\n\u003cp\u003eCurious as to who else occupied Corinne’s life, Edward rounded the landing and entered the upper parlor. He moved to the window and pushed the curtains aside, affording him a clear view of the street in front of the house.\u003c/p\u003e\n\u003cp\u003eThe man named Quinn was unhitching his horse from the post with casual ease. The cut and quality of the man’s garments spoke of wealth and privilege, as did the beautiful lines of his mount.\u003c/p\u003e\n\u003cp\u003eHow did he know Corinne?\u003c/p\u003e\n\u003cp\u003eQuinn stilled just before placing his booted foot into the stirrup. He glanced over his shoulder at the house, lifting his gaze until it met with Edward’s. The tension that gripped the man’s large frame was tangible even across the distance between them.\u003c/p\u003e\n\u003cp\u003eThere had been a brief moment when Edward considered backing up and out of view. It was not his place to intrude in Corinne’s life. They were nothing to each other, not even true acquaintances. When she awoke, she might rail at his arrogance in taking charge of her household—and her—while she was helpless to protest.\u003c/p\u003e\n\u003cp\u003eBut a long-buried part of him reared up and exerted a claim on the lovely Corinne, and he was unable to resist it. He would have her. It was the only reason for the madness of his actions since meeting her.\u003c/p\u003e\n\u003cp\u003eEdward’s eyes examined the man who might be a rival, noting every detail. They were as opposite as opposite could be, except for their facial expressions. Quinn looked the way Edward felt—taut, challenged, and malevolent.\u003c/p\u003e\n\u003cp\u003eWas this the man who had so wounded Corinne? Who had made her fearful and given her that haunted look in her eyes?\u003c/p\u003e\n\u003cp\u003eHis fists clenched at his sides. “I will know who you are,” Edward warned softly.\u003c/p\u003e\n\u003cp\u003eQuinn touched the brim of his hat, smiled in a near sneer, and mounted his horse. He could not have heard Edward or even seen his lips moving, but the fact that he’d picked up the gauntlet was clear.\u003c/p\u003e\n\u003cp\u003eAnother complication in an already tangled affair.\u003c/p\u003e\n\u003cp\u003eEdward lowered the curtain and returned to Corinne.\u003c/p\u003e\n\u003cp\u003eSimon stood in the entryway of his home and pulled off his gloves one fingertip at a time, his movements deliberate and evenly paced. The action was meant to calm him, but it was ineffectual. His breath heaved with his anger, and his neck ached with tension.\u003c/p\u003e\n\u003cp\u003eEdward James had been visiting Lysette while she was “indisposed.” The man had stood in the window sans coat and waistcoat as if he were at home, his posture both defensive and possessive.\u003c/p\u003e\n\u003cp\u003eSimon had played this game before, coming to a head with a man over a desirable female. It was a diverting activity and Simon rarely had a true stake in the outcome. If he won the lady’s regard, the sex was wild and hot. If he lost it, he conceded with a smile and caught another.\u003c/p\u003e\n\u003cp\u003eThis time, he was incensed. He would like to think it was only his pride that was bruised, but the truth was more disturbing than that. He had been happy those brief, passionate moments in the library. Not merely content or distracted but happy. To know that it had been nothing noteworthy to Lysette was a bitter realization to reach.\u003c/p\u003e\n\u003cp\u003eAnd then there was the feeling that he was losing his mind. He had disliked Lysette until last night. Now, suddenly, he felt murderous over the thought of her with another man.\u003c/p\u003e\n\u003cp\u003eRight now.\u003c/p\u003e\n\u003cp\u003eHe growled and bounded up the stairs to his room, determined to change from his riding clothes to something more suitable for a night of bawdy delights. A hard fuck would get her out of his blood. Tomorrow he would be clear headed and ready to deal with her as he must.\u003c/p\u003e\n\u003cp\u003e“Mr. Quinn, you have a caller.”\u003c/p\u003e\n\u003cp\u003eSimon paused in the act of removing his cravat. He met his butler’s gaze in the mirror attached to the inside of his armoire door. “Who is it?”\u003c/p\u003e\n\u003cp\u003e“She would not give me her name, sir.”\u003c/p\u003e\n\u003cp\u003eTensing at the news that his caller was female, he asked, “Is she blonde and beautiful?”\u003c/p\u003e\n\u003cp\u003eThe butler’s mouth twitched. “Yes, sir.”\u003c/p\u003e\n\u003cp\u003eAll of Simon’s simmering anger and frustration reheated to boiling. He yanked off the loosened linen and tossed it on the floor. She must have come haring directly after him in order to reach him so soon. Perhaps she realized how James’s show of propriety had ruined her plans for him, whatever they were.\u003c/p\u003e\n\u003cp\u003eFor a moment, he debated sending her away without seeing her just to aggravate her in kind, but the thought of Eddington’s hold over him stayed his tongue. The sooner he knew what she was up to, the sooner he could be rid of her and away from the damnable lot of mischief makers.\u003c/p\u003e\n\u003cp\u003e“Where is his lordship?” he asked.\u003c/p\u003e\n\u003cp\u003e“Out for the evening, sir.”\u003c/p\u003e\n\u003cp\u003eWith a long, rapid stride, Simon quit his chambers and descended to the lower floor. He was vaguely aware of his butler scrambling after him, but he paid the man no mind. He would not be needing tea or refreshments. If anything, he needed a stiff drink.\u003c/p\u003e\n\u003cp\u003eHe paused on the threshold of the receiving parlor and found Lysette seated delicately on the edge of his yellow brocade settee. She was dressed in a bold burgundy gown, another color choice he would not have anticipated her to select but one he found potently alluring against her creamy skin. An elaborately decorated hat rested on the carved wooden side table and she twisted the strings of a matching reticule in her lap.\u003c/p\u003e\n\u003cp\u003eShe was the picture of elegance and gentility . . .\u003c/p\u003e\n\u003cp\u003e. . . until she looked at him with the blue eyes that had lured him across a ballroom and into her arms.\u003c/p\u003e\n\u003cp\u003eSomething akin to lightning raced across his skin. Burning. Tingling. Making him perspire. His heart rate picked up its pace and his chest rose and fell unevenly.\u003c/p\u003e\n\u003cp\u003eAs he entered, her expression of hesitation and wariness was swiftly replaced with heated feminine appreciation. Her gaze lowered to his bared throat and her tongue darted out to caress her lush lower lip.\u003c/p\u003e\n\u003cp\u003eWhen her eyes met his again, the raw, carnal hunger he saw in the crystalline depths hardened every muscle in his body, tightening his frame with coiling lust. A quarter of an hour ago he had wanted to strangle her. Now, he wanted nothing more than to lift her skirts and ride her to a screaming climax.\u003c/p\u003e\n\u003cp\u003eAgain and again.\u003c/p\u003e\n\u003cp\u003eHe growled and snapped, “Bah! You are not worth the trouble.”\u003c/p\u003e\n\u003cp\u003ePivoting, he left the room.\u003c/p\u003e\n\u003cp\u003e“Mr. Quinn . . . Wait!”\u003c/p\u003e\n\u003cp\u003eHe turned about again and found her chasing after him. “The name is Simon, curse you, as you well know.”\u003c/p\u003e\n\u003cp\u003eShe drew up short, her breathing as rapid as his. “Please. Allow me to introduce myself. I am—”\u003c/p\u003e\n\u003cp\u003e“I know bloody well who you are, you addlepated female!”\u003c/p\u003e\n\u003cp\u003e“Lynette Baillon,” she continued stubbornly, “daughter of the Vicomte de Grenier. I believe you may have known my sister, Lysette Baillon. Perhaps intimately . . . i-if last night was any indication.”\u003c/p\u003e\n\u003cp\u003eSimon stood frozen, unblinking. “What the devil are you talking about?”\u003c/p\u003e\n\u003cp\u003e“You do not know me,” she said softly. “Until last night, you and I had never met.”\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eThe woman was either daft as you please, or the answer to a prayer.\u003c/p\u003e\n\u003cp\u003eSimon’s gaze narrowed and became examining, moving from the top of Lysette’s—Lynette’s—golden head down to the hem of her gown. He noted the artfully revealed lacey underskirts, the tightly cinched waist, and the low bodice, which displayed a tempting swell of luscious breasts. It was an ensemble designed to display the feminine charms of the wearer to best advantage. The Lysette he knew did not dress to arouse. If anything, her gowns were remarkably understated.\u003c/p\u003e\n\u003cp\u003eBut beyond this woman’s outward appearance were deeper, more complex signs—there was no torment in her eyes and no brittle tension in her delicate frame.\u003c/p\u003e\n\u003cp\u003eLynette. Lysette. \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-20.html","bookId":2661,"creation":"Oct 5, 2019 9:55:39 AM","modification":"Oct 5, 2019 9:55:39 AM"}
