{"id":64816,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Is it her?” Lynette asked with hopeful eyes.\u003c/p\u003e\n\u003cp\u003e“Yes,” Simon said softly. “I believe so. But she is not the sister you once knew. Her memory is lacking beyond two years past and the woman she has become during that time is not the one you remember.”\u003c/p\u003e\n\u003cp\u003e“I do not care,” Lynette said stubbornly.\u003c/p\u003e\n\u003cp\u003e“You might when you meet her,” he warned, but his gaze promised support to her. She nodded and looked at him with such adoration he wondered how he remained seated.\u003c/p\u003e\n\u003cp\u003e“I think,” he said, turning his attention back to the vicomtess, “that the L’Esprit who once demanded vengeance from Saint-Martin has become one who demands vengeance for him.”\u003c/p\u003e\n\u003cp\u003eThe vicomtess frowned. “I still do not understand.”\u003c/p\u003e\n\u003cp\u003e“Who would have a grievance against you and your children? Who would resent your happiness and wish to destroy it?”\u003c/p\u003e\n\u003cp\u003eShe pushed to her feet. “Are you speaking of Saint-Martin?”\u003c/p\u003e\n\u003cp\u003eSimon stood. “Desjardins told me that L’Esprit’s goal was to ruin Saint-Martin, yet the new L’Esprit—the one who hand-writes his notes and does not visit him in the cellar—makes demands that have nothing to do with the marquis. Their purpose is to bedevil Desjardins.”\u003c/p\u003e\n\u003cp\u003e“Saint-Martin would never hurt me,” she refuted. “Never.”\u003c/p\u003e\n\u003cp\u003e“Who is Saint-Martin?” Lynette asked.\u003c/p\u003e\n\u003cp\u003e“By all accounts he fell into a rapid decline when you left him,” Simon continued. “Yet you married, had children, lived life.”\u003c/p\u003e\n\u003cp\u003e“How would he know about L’Esprit?” the vicomtess challenged. “I received the one and only missive from him the night I left France and I took it with me. Saint-Martin never saw it.”\u003c/p\u003e\n\u003cp\u003e“If L’Esprit was so determined to take every happiness away from the marquis, would he not gloat when he succeeded? Would he not have sent something to Saint-Martin advising him that his misfortune was not an aberration but a well-planned attack? What satisfaction would there be in defeating your enemy if they did not know they were defeated?”\u003c/p\u003e\n\u003cp\u003e“Mon Dieu,” Solange whispered.\u003c/p\u003e\n\u003cp\u003e“He isn’t capable of such viciousness,” the vicomtess insisted.\u003c/p\u003e\n\u003cp\u003eSimon glanced at Lynette, but spoke to the vicomtess. “A man can be driven mad with wanting, my lady.”\u003c/p\u003e\n\u003cp\u003e“What do you believe has transpired, Mr. Quinn?” Lynette met his gaze directly.\u003c/p\u003e\n\u003cp\u003e“I believe your sister was taken,” Simon advised. “I believe another body was dressed in her clothing and burned in the carriage. I believe these acts were committed by a man named Depardue, who was working on behalf of Saint-Martin. Somehow, Lysette’s brain was damaged and her memory lost. Desjardins learned of Lysette and took her in, knowing full well who she was. He created an identity for her and has used her for his own purposes these two years, hoping that one day her existence would prove useful in freeing him from L’Esprit. I do not believe Saint-Martin knows she is alive.”\u003c/p\u003e\n\u003cp\u003e“I do not believe any of that,” the vicomtess said, but her white face and wringing hands said something else entirely.\u003c/p\u003e\n\u003cp\u003e“All this because my mother broke off their affair?” Lynette guessed.\u003c/p\u003e\n\u003cp\u003e“It is a possibility.”\u003c/p\u003e\n\u003cp\u003e“No, it is not.” The vicomtess straightened her shoulders. “You do not know him, Mr. Quinn, to make such aspersions on his character.”\u003c/p\u003e\n\u003cp\u003e“Or perhaps you contribute feelings to him regarding your children that he cannot feel. You know more than he, after all.”\u003c/p\u003e\n\u003cp\u003e“You are very clever, Mr. Quinn,” Solange said softly.\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Lynette asked.\u003c/p\u003e\n\u003cp\u003eSimon looked at the vicomtess, hoping she would speak up and explain. She said nothing, merely looked away.\u003c/p\u003e\n\u003cp\u003eLynette sighed. “Maman, you will have to be less secretive, if we have any hope of success.”\u003c/p\u003e\n\u003cp\u003e“We will have to lure L’Esprit out into the open,” Simon said, “in order to free Lysette completely. She and Lynette will both be at risk as long as his involvement is unaddressed.”\u003c/p\u003e\n\u003cp\u003eLynette stood. “I will help you however I can.”\u003c/p\u003e\n\u003cp\u003e“You will not become involved in this morass!” her mother said crossly.\u003c/p\u003e\n\u003cp\u003e“I am sorry, Maman.” Lynette’s voice was sure and unwavering. “It is not my wish to disobey you, but I cannot allow Mr. Quinn to risk himself alone for us and I cannot allow Lysette to continue to live as she has been if I can spare her. She would do no less for me.”\u003c/p\u003e\n\u003cp\u003e“You do not know if this woman is your sister.”\u003c/p\u003e\n\u003cp\u003e“I do,” Lynette said. “I know it without a doubt.”\u003c/p\u003e\n\u003cp\u003eSolange exhaled audibly. “What can we do, Mr. Quinn?”\u003c/p\u003e\n\u003cp\u003e“Speak with de Grenier when he arrives a few days hence. Share my suspicions. We will need every able-bodied man we can find.”\u003c/p\u003e\n\u003cp\u003e“De Grenier . . . Yes, you are correct.” The vicomtess’s relief was palpable. “He will assist you.”\u003c/p\u003e\n\u003cp\u003e“In the interim,” Simon said, “I will do what I can to keep Lysette safe from harm.” He looked at Lynette. “Please remain indoors, mademoiselle. I would be much aggrieved if something untoward were to befall you.”\u003c/p\u003e\n\u003cp\u003e“Of course.” She offered him a reassuring smile. “I will not jeopardize myself in any manner.”\u003c/p\u003e\n\u003cp\u003eSimon bowed. “I am in your service if you should need me, but please, do not venture to my home during this time. It is not safe for any of you.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Mr. Quinn.” Lynette came to him and offered her hand. The smell of her skin as he kissed the back filled his mind with memories he cherished. He released her with the greatest reluctance, fighting his most basic instincts to squire her away and protect her from all harm.\u003c/p\u003e\n\u003cp\u003eSolange also reached out to him. “Be careful, Mr. Quinn.”\u003c/p\u003e\n\u003cp\u003e“Thank you, mademoiselle. You, as well.”\u003c/p\u003e\n\u003cp\u003eThe vicomtess tilted her head. “If what you say about Lysette is true, I will owe you a great deal.”\u003c/p\u003e\n\u003cp\u003e“You owe me nothing. I am not here with any expectation.” He looked at Lynette one last time, wishing they were alone so that he could share with her all his concerns. In all of his life, he’d had no one to share his burdens.\u003c/p\u003e\n\u003cp\u003e“Godspeed.”\u003c/p\u003e\n\u003cp\u003eSimon left the way he had come, leaving behind turmoil he hoped he had the power to help mend.\u003c/p\u003e\n\u003cp\u003eSimon realized he was being followed within two streets’ length from the Tremblay home. His tracker was quite good.\u003c/p\u003e\n\u003cp\u003eSimon was better.\u003c/p\u003e\n\u003cp\u003eSlipping through two carts, Simon rounded the opposite side and came up behind him. Tucked in the sleeve of Thierry’s coat was Simon’s sheathed dagger. With a quick flick of his arm, the hilt slid down into his palm.\u003c/p\u003e\n\u003cp\u003e“Can I help you?” he drawled from a few feet behind the man.\u003c/p\u003e\n\u003cp\u003eMaintaining his air of insouciance, the individual slowed his steps gradually, then turned about in an elegant spin and touched the brim of his hat.\u003c/p\u003e\n\u003cp\u003e“Perhaps I can help you,” the man returned.\u003c/p\u003e\n\u003cp\u003e“Marquis de Saint-Martin, I take it?”\u003c/p\u003e\n\u003cp\u003eAlthough he asked, Simon knew it was he.\u003c/p\u003e\n\u003cp\u003eSaint-Martin tilted his head slightly. “Mr. Quinn.”\u003c/p\u003e\n\u003cp\u003eThey eyed each other carefully.\u003c/p\u003e\n\u003cp\u003e“Shall we find a more private venue?” Simon asked.\u003c/p\u003e\n\u003cp\u003e“Certainly.”\u003c/p\u003e\n\u003cp\u003eTogether they moved cautiously, selecting a small tavern off the street. The air was redolent of roasted meat and hearty ale, and the patrons as a rule were neatly attired and subdued.\u003c/p\u003e\n\u003cp\u003eThe two men settled into a corner opposite each other, and Simon studied the marquis as he removed his hat.\u003c/p\u003e\n\u003cp\u003eTall, blond, and well formed, the marquis and the equally golden Marguerite Baillon would make a striking couple together. They had certainly made striking issue.\u003c/p\u003e\n\u003cp\u003e“The vicomtess asked me to investigate you, Mr. Quinn.”\u003c/p\u003e\n\u003cp\u003e“Enjoying that task?”\u003c/p\u003e\n\u003cp\u003e“Immensely.” The marquis’s mouth curved and his fingertips drummed lightly on the table. “You are an interesting individual.”\u003c/p\u003e\n\u003cp\u003e“As are you.”\u003c/p\u003e\n\u003cp\u003e“Buried secrets are often best left beneath the ground,” the marquis said in a low, dark tone.\u003c/p\u003e\n\u003cp\u003e“What an intriguing turn of phrase,” Simon murmured, reclining into his seat. “I have one for you: It is too late to close the stable door once the mare is freed.”\u003c/p\u003e\n\u003cp\u003eSaint-Martin’s eyes narrowed ominously.\u003c/p\u003e\n\u003cp\u003eSimon was not fooled by the man’s lithe build and pretty face. There was a sharp intensity about the marquis and a tense desperation. Simon was reminded that the man had nothing of emotional value left to lose, which made him exceedingly dangerous. His hardened mien also brought to mind Simon’s future, which would lack Lynette. Perhaps Simon would look similar in the years to come. The thought was sobering and heartbreaking.\u003c/p\u003e\n\u003cp\u003e“Step lightly, Mr. Quinn. You tread on dangerous ground.”\u003c/p\u003e\n\u003cp\u003e“Yours is the fourth threat I have had presented to me today,” Simon said dryly. “I believe that must be a record of some sort.”\u003c/p\u003e\n\u003cp\u003e“You inspire murderous thoughts apparently.” The marquis’s smile was chilling.\u003c/p\u003e\n\u003cp\u003eSimon snorted. “So do you. Tell me about L’Esprit.”\u003c/p\u003e\n\u003cp\u003eSaint-Martin tensed visibly. “Beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“I must confess, I am impressed with your ability to inspire such vehement hatred. Perhaps you might care to explain what you did?”\u003c/p\u003e\n\u003cp\u003eA slight whitening of the marquis’s knuckles was the only sign of disturbance.\u003c/p\u003e\n\u003cp\u003e“No comment?” Simon murmured. “Regardless, I will not allow this new threat to the vicomtess and her family to continue. As you said, some things that were once buried should remain that way. They should not be revived and utilized again.”\u003c/p\u003e\n\u003cp\u003e“Can you stop it?” Saint-Martin asked softly. “I think not.”\u003c/p\u003e\n\u003cp\u003e“A desperate man will resort to desperate measures. You seem to know that very well.”\u003c/p\u003e\n\u003cp\u003e“You are very clever, Mr. Quinn.” Saint-Martin stood and set his hat on his head. “Pray that you are also very prudent. You might live, if you are.”\u003c/p\u003e\n\u003cp\u003eSmiling, Simon called after him, “That makes five threats in a day.” \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-37.html","bookId":2661,"creation":"Oct 5, 2019 9:55:39 AM","modification":"Oct 5, 2019 9:55:39 AM"}
