{"id":64817,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe tavern door closed behind the marquis without a sound.\u003c/p\u003e\n\u003cp\u003eChapter 16\u003c/p\u003e\n\u003cp\u003eLysette woke to the sound of the lock turning in her bedroom door. Blinking gritty eyes, she lifted her head and watched Madame Fouche peek her head around the corner.\u003c/p\u003e\n\u003cp\u003e“Madame Marchant?” she queried softly, most likely unable to see well into the dark room. “Are you well?”\u003c/p\u003e\n\u003cp\u003e“Yes, come in,” she rasped, clearing her throat.\u003c/p\u003e\n\u003cp\u003eThe housekeeper bustled in and quickly had the lamps lit and coals heating in the grate. She approached the bed, wiping her hands on her apron. “Mr. James is below and would like to see you.”\u003c/p\u003e\n\u003cp\u003e“Send him up in ten minutes,” Lysette said, knowing she should change first and receive him elsewhere but feeling too weary to make the effort. She also felt safe in her room, closed off from the world at large, protected from the prying eyes of Desjardins’s staff.\u003c/p\u003e\n\u003cp\u003eMadame Fouche departed and moments later returned with Edward in tow. Lynette was refreshed, her face washed and a robe tied securely over her night rail. She waited in a chair before the fire, her hands linked primly in her lap, her bearing collected and self-assured.\u003c/p\u003e\n\u003cp\u003eOr so she thought.\u003c/p\u003e\n\u003cp\u003e“What is it?” he asked, sinking to his haunches beside her with a concerned frown. He was dressed with care, his gray suit unremarkable yet nicely tailored, his cravat perfectly tied. “You have been weeping.”\u003c/p\u003e\n\u003cp\u003eAn emotion on his face goaded her to reach out and touch his cheek with tentative, shaking fingertips. He exhaled harshly the moment they connected and the sound so startled her that she snatched her hand back.\u003c/p\u003e\n\u003cp\u003eEdward caught her withdrawal with such speed it was nearly too quick to see. He pressed his face into her palm, his eyes dark with something that frightened her . . . and made her tingle.\u003c/p\u003e\n\u003cp\u003e“Why do you come to me?” she asked hoarsely.\u003c/p\u003e\n\u003cp\u003e“Because I cannot stay away.”\u003c/p\u003e\n\u003cp\u003e“What do you hope will happen?”\u003c/p\u003e\n\u003cp\u003eHe inhaled deeply and slowly, his eyes never leaving hers. “I hope you will give me enough time to show you how it can be between us, if only you allow me to know you.”\u003c/p\u003e\n\u003cp\u003e“The more you know, the less you will like.”\u003c/p\u003e\n\u003cp\u003e“You know that is not true. You can feel it. I can see it in your eyes.” He set one hand over her tightly linked ones and squeezed. “You would not be so afraid otherwise.”\u003c/p\u003e\n\u003cp\u003e“Y-you want me,” she whispered. “I-in your b-bed.”\u003c/p\u003e\n\u003cp\u003eStanding, Edward held out both hands to her and helped her to her feet. She stood before him, trembling.\u003c/p\u003e\n\u003cp\u003eHis touch drifted over her brow, his gaze hot and tender. “You feel fear, but not of me. It is the memories that frighten you. I can replace those. I can make them fade.”\u003c/p\u003e\n\u003cp\u003eLysette watched his mouth lower to hers, the pace set to afford her the opportunity to turn away. Part of her wanted to, knowing what he would want after the kiss. Another part of her was enamored with the shape of his lips, so stern, so somber. There was no frivolity about him.\u003c/p\u003e\n\u003cp\u003eEdward was an anchor. She was adrift. There was no way to fight the urge to cling to him and find steadiness. She had been alone for so long, unable to rely on anyone but herself. And he was here . . . again . . . steadfast . . .\u003c/p\u003e\n\u003cp\u003e“Yes, I want you,” he said gruffly, his lips a hair’s breadth away from hers. “But I can wait. I will wait. Until you are ready, however long that might be.”\u003c/p\u003e\n\u003cp\u003eLysette stood frozen, her heart racing in a panicked rhythm.\u003c/p\u003e\n\u003cp\u003eHis mouth touched hers, gently but without hesitation. His tongue touched the seam of her lips, glided along it, caressed the curve. The scent of sandalwood and verbena filled her nostrils, warming her blood and causing her skin to tingle.\u003c/p\u003e\n\u003cp\u003eLow in her belly, heat spread.\u003c/p\u003e\n\u003cp\u003eBetween her legs, dampness grew. She whimpered and clung to his coat, achingly aware of the cool air at her back and the heated length of hard male to her front.\u003c/p\u003e\n\u003cp\u003e“Let me in, Corinne.”\u003c/p\u003e\n\u003cp\u003eTrembling, she obliged, gasping when his tongue thrust deep and sure. The similarity to the sexual act could not be ignored and her trembles turned to violent shaking.\u003c/p\u003e\n\u003cp\u003eBreathing harshly, he pulled back. “See?” he rasped. “I can stop. At any time. You lead, I follow.”\u003c/p\u003e\n\u003cp\u003e“Lysette.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “Beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“My name is Lysette.” She wrapped her hands around his wrists. “I lied to you.”\u003c/p\u003e\n\u003cp\u003eSomething suspiciously like a laugh escaped him. It was rough and abbreviated, almost a bark. “Lysette suits you better.”\u003c/p\u003e\n\u003cp\u003e“I work for Desjardins,” she blurted out. “He needs information about Mr. Franklin, and he was using me to pry it from you.”\u003c/p\u003e\n\u003cp\u003e“Was?” His hands moved—one cupping her nape, the other banding her waist.\u003c/p\u003e\n\u003cp\u003eLysette stared up at him, afraid to breathe. “I am not a good person. I have done things—”\u003c/p\u003e\n\u003cp\u003e“I do not care.” Edward studied her, his gaze burning. “What concerns me is how you are with me from this moment onward. You must decide, Lysette: Will you trust me to care for you, as I have since I met you, or will you send me away?”\u003c/p\u003e\n\u003cp\u003eLysette swallowed hard. “I want to trust you.”\u003c/p\u003e\n\u003cp\u003e“That is a beginning, I suppose.”\u003c/p\u003e\n\u003cp\u003eHis fingers kneaded into the tense muscles of her neck, driving her mad. Her brain fought to stay frightened, urging her to flee. But her body, fickle thing, was melting into his touch. The feel of his hard, sinewy frame against her was not unpleasant.\u003c/p\u003e\n\u003cp\u003e“I have never trusted anyone,” she confessed.\u003c/p\u003e\n\u003cp\u003e“Ever?”\u003c/p\u003e\n\u003cp\u003eHer smile was wry. “As long as I can remember. Would you like to hear the tale of my life? It is lamentably short but true.”\u003c/p\u003e\n\u003cp\u003eEdward kissed the tip of her nose. “I should relish the opportunity to listen to whatever truths you have to tell me. I would, however, be grateful if you would return to bed and drink some beef tea.”\u003c/p\u003e\n\u003cp\u003e“As you wish.” Her smile wavered, shaken by gratitude at the care he displayed for her well-being.\u003c/p\u003e\n\u003cp\u003eWith his hand at her lower back, he walked her to the bed.\u003c/p\u003e\n\u003cp\u003eTo her surprise, she gave him the lead without reticence or fear for hidden intentions. The half-smile that curved the stern lines of his mouth made the concession worth it.\u003c/p\u003e\n\u003cp\u003eMarguerite was abed and nearly asleep when a raised masculine voice in the adjoining boudoir of her bedroom alerted her. She sat up, tossed back the covers, and fetched her robe from where it was draped over the foot of the bed. Rushing to the door, she pulled it open and found herself faced with her husband.\u003c/p\u003e\n\u003cp\u003eDe Grenier was travel dusty and obviously weary, yet his handsome face lit when he saw her. Celie, her maid, stood behind him, holding his cane and hat.\u003c/p\u003e\n\u003cp\u003e“I reached Paris tonight,” he said, “and found your note waiting for me. I came straightaway.”\u003c/p\u003e\n\u003cp\u003e“You may go,” Marguerite said to the maid, linking her arm with de Grenier’s and leading him into the bedroom.\u003c/p\u003e\n\u003cp\u003eShe shut the door behind them, briefly noting the disgruntled frown on the servant’s face. Celie always looked displeased when de Grenier was with Marguerite. Since the maid had been with her since her affair with Saint-Martin, she suspected it was simply a case of liking one master more so than the other.\u003c/p\u003e\n\u003cp\u003e“Why are you here in Paris?” he asked, moving to the grate and holding his hands out to the banked fire.\u003c/p\u003e\n\u003cp\u003e“There is so much that I have to tell you,” she said urgently. “So much has transpired since you and I last spoke.”\u003c/p\u003e\n\u003cp\u003eTheir marriage was a distant one, with de Grenier gone from their house more often than he was there. Even when he was home, he was often occupied in his study, working on diplomatic matters between France and Poland. But it was her fault, as well. With her heart engaged elsewhere, she had never given herself to him as she should have.\u003c/p\u003e\n\u003cp\u003e“Perhaps we should retire to our own home,” he suggested.\u003c/p\u003e\n\u003cp\u003e“That would take hours and I cannot wait that long. As it is, I thought I might go mad before you arrived.”\u003c/p\u003e\n\u003cp\u003eNodding, de Grenier shrugged out of his coat, baring broad shoulders encased in shirtsleeves and waistcoat. He was younger than Saint-Martin by a decade, his body in its prime and beautifully maintained, his dark hair unmarred by gray. Women admired and coveted him, fawned over him, yet he was most often too distracted to take note of their interest.\u003c/p\u003e\n\u003cp\u003eHe sank into a slipper chair and removed his heels. “You have my undivided attention, madame.”\u003c/p\u003e\n\u003cp\u003eNodding, Marguerite linked her hands behind her back and began to relate the events of the past sennight. She paced with agitation, but her words were spoken clearly. The entire affair was too important to say anything incorrectly.\u003c/p\u003e\n\u003cp\u003e“And you believe this man? This Quinn?” he asked when she finished. “You saw Lysette’s body with your own eyes, Marguerite. How can this woman be our daughter?”\u003c/p\u003e\n\u003cp\u003e“I do not know. I confess, I am completely confused.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to do?” He stood and approached her, taking her hands in his. His gaze was clear and direct, capped by a slight frown.\u003c/p\u003e\n\u003cp\u003e“What do you think of Quinn’s tale of L’Esprit?” she asked. “Do you think it has merit?”\u003c/p\u003e\n\u003cp\u003eHe exhaled, then shook his head. “Are you asking me if I think Saint-Martin is responsible? I’ve no notion. There are too many unanswered questions. What happened to the original L’Esprit? How involved is Desjardins?”\u003c/p\u003e\n\u003cp\u003e“I detest that man,” she hissed. “It frightens me how deeply I wish him ill.”\u003c/p\u003e\n\u003cp\u003ePressing his lips to her forehead, he said, “I will visit Quinn tomorrow and judge his sincerity for myself.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Marguerite looked up at him and felt deep gratitude. Through every tragedy of her life, he had been available to her, offering support and commiseration.\u003c/p\u003e\n\u003cp\u003eOne of his hands slipped from her shoulders and cupped her unfettered breast. She inhaled sharply, startled by the abruptness of his advance. His thumb brushed across her nipple, then circled it, expertly bringing it to a hard and aching point.\u003c/p\u003e\n\u003cp\u003e“It is late,” he murmured, watching her reactions with heavy-lidded eyes. “Let us retire here. On the morrow, I will take you and Lynette home, and resolve this dilemma.”\u003c/p\u003e\n\u003cp\u003eShe nodded. As always, Philippe came to mind unbidden and her stomach knotted. Marguerite pushed the inevitable feelings of guilt and betrayal aside with effort and took her husband to her bed. \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-38.html","bookId":2661,"creation":"Oct 5, 2019 9:55:39 AM","modification":"Oct 5, 2019 9:55:39 AM"}
