{"id":64822,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLynette’s cry reverberated through the room and gave Marguerite the strength to do what she must.\u003c/p\u003e\n\u003cp\u003eSaint-Martin reared up, the heel of his palm shattering the aquiline beauty of de Grenier’s nose. The sound of cartilage breaking was like a thundercrack.\u003c/p\u003e\n\u003cp\u003eMarguerite aimed and pulled the trigger.\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eFour weeks later . . .\u003c/p\u003e\n\u003cp\u003eSimon alighted from his carriage and ascended the steps to the front door of Marguerite Baillon’s home. The day was bright and beautiful, the air cleansed from a brief spate of early morning rain. From the exterior, the home was cheery and welcoming, with red flowers overflowing from urns flanking the entrance.\u003c/p\u003e\n\u003cp\u003eThe door opened before he knocked, revealing the much-loved sight of Lynette standing on the threshold.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Mademoiselle Rousseau,” he greeted her, removing his hat and sweeping a low bow.\u003c/p\u003e\n\u003cp\u003e“You are tardy, Mr. Quinn,” she chastised him sternly.\u003c/p\u003e\n\u003cp\u003e“I am not,” he protested, withdrawing his pocket watch. “It is precisely one o’clock, the same time I visit you every day.”\u003c/p\u003e\n\u003cp\u003e“It is nearly five after one.” She caught his arm and tugged him into the foyer, shutting the door behind him. She collected his hat and tossed it agilely to the rack, where it caught and swayed into place.\u003c/p\u003e\n\u003cp\u003e“Excellent shot,” he praised, staring down at her lovely, animated features.\u003c/p\u003e\n\u003cp\u003e“Do not change the subject.”\u003c/p\u003e\n\u003cp\u003e“You are piqued with me.” He smiled. “Did you miss me, a thiasce?”\u003c/p\u003e\n\u003cp\u003e“You know I did,” she grumbled, leading him toward the lower parlor. “I thought you might not come.”\u003c/p\u003e\n\u003cp\u003e“Nothing could keep me away,” he murmured, the fingers of his free hand clenching with the need to touch her. Everywhere.\u003c/p\u003e\n\u003cp\u003eWeeks of abstinence were taking their toll, but he was determined to woo her properly. She and Lysette had decided to take Saint-Martin’s name in an effort to right the wrongs done by de Grenier. Their declaration of bastardy had ruined them, making them unsuitable for an esteemed social marriage. Because of this, Simon was firm in his intent to court Lynette as she might have been if only he were worthy and she were not tainted by scandal.\u003c/p\u003e\n\u003cp\u003e“I think you might be falling in love with me, Simon,” Lynette purred, her smile wicked and filled with feminine satisfaction.\u003c/p\u003e\n\u003cp\u003e“I might be,” he agreed, squeezing her hand where it rested over his forearm.\u003c/p\u003e\n\u003cp\u003eShe was so brave. He admired as well as desired her. She had not wanted to believe that the man she knew as her pater would be so heinous, but she had trusted Simon and displayed great courage by agreeing to his plan. Her fortitude when faced with the darker side of his world had ensnared him.\u003c/p\u003e\n\u003cp\u003eHe was not an easy man to live with. He was coarse, roughened by years spent in the gutter, surviving by his wits and his fists. It would take an exceptional woman to manage him and love him regardless. What a miracle it was to have found Lynette, gently bred yet strong, demure but passionate. She took all that he was and all that he had ever been, and wanted him, regardless.\u003c/p\u003e\n\u003cp\u003eOver the last four weeks he had shown her both the best and the worst of himself, visiting her daily, good humor or bad. At times his longing for her made him curt, but she tolerated him easily. She, too, had shown the various facets of her temper—sometimes sweetly cajoling, at others pensive or cross. He’d found that he would rather be with a disgruntled Lynette than any other woman in the world.\u003c/p\u003e\n\u003cp\u003eHe was firmly caught and happy for it.\u003c/p\u003e\n\u003cp\u003eThey entered the parlor, and Simon discovered Lysette and Mr. James sitting on the window seat, sharing a book between them. The vicomtess was engaged in needlepoint on the settee, and the Marquis de Saint-Martin was occupied at the small escritoire.\u003c/p\u003e\n\u003cp\u003e“See?” Lynette murmured. “Saint-Martin and Mr. James have already arrived.”\u003c/p\u003e\n\u003cp\u003eSimon pulled out his timepiece again and scowled down at it. “I may need a new watch,” he said.\u003c/p\u003e\n\u003cp\u003e“Or a ring.”\u003c/p\u003e\n\u003cp\u003eHis gaze met hers and she winked.\u003c/p\u003e\n\u003cp\u003e“Mr. Quinn,” the marquis called out. “Come here, if you would, please.”\u003c/p\u003e\n\u003cp\u003e“Will you walk with me in the garden today?” Lynette asked.\u003c/p\u003e\n\u003cp\u003e“I will walk with you anywhere.”\u003c/p\u003e\n\u003cp\u003eHer smile warmed him from the inside, offering him the home he had searched for all his years. He belonged somewhere, to someone. After a lifetime of loneliness, her presence in his life was an oasis in the desert.\u003c/p\u003e\n\u003cp\u003e“I will fetch my shawl while you speak with the marquis.” She ran from the room in a swirl of dark green and white striped skirts.\u003c/p\u003e\n\u003cp\u003eSimon moved to the escritoire. “Good afternoon, my lord.”\u003c/p\u003e\n\u003cp\u003e“You, as well.” Saint-Martin straightened and gestured to the profusion of papers before him.\u003c/p\u003e\n\u003cp\u003e“Are those the items found with the maid?”\u003c/p\u003e\n\u003cp\u003e“Yes. Poor Celie. I cannot imagine what purgatory she suffered all these years. To take her own life . . .” He shook his head. “I wish she had known that we would not fault her.”\u003c/p\u003e\n\u003cp\u003e“Have you found anything that reveals de Grenier’s motivations?”\u003c/p\u003e\n\u003cp\u003eHeaving out his breath, the marquis sat back and nodded. “There was a woman in my past. The affair was brief and forgettable, if not for her reaction to our parting. She went into a decline, weeping on the steps of my home and creating a scene every time we crossed paths.”\u003c/p\u003e\n\u003cp\u003e“I had heard tales of that, I think,” Simon said, wincing in sympathy.\u003c/p\u003e\n\u003cp\u003e“People still speak of it today. It was dreadful, for both of us. At the time, I had yet to meet Marguerite so I could not collect why the woman was so distraught. I had no understanding of love or obsession.” He rubbed the back of his neck. “Regrettably, I did not handle the ordeal well and her family sent her away to avoid further embarrassment for us all.”\u003c/p\u003e\n\u003cp\u003e“De Grenier knew her?”\u003c/p\u003e\n\u003cp\u003e“He loved her, apparently. She was a distant cousin and he had hoped to wed her. She took her own life shortly after her removal from Paris and he set the blame on my doorstep. Perhaps, rightly so.”\u003c/p\u003e\n\u003cp\u003eSimon set his hand atop the marquis’s shoulder. “While your affair may have brought her illness to light, I think it likely that she would have succumbed to madness regardless of your involvement. From de Grenier’s actions, I suspect mental defect is a trait in their family line.”\u003c/p\u003e\n\u003cp\u003e“If only it were that simple.” The marquis reached up and patted Simon’s hand, the paternal gesture startling and deeply moving. “Marguerite is still shaken by de Grenier’s death and her hand in it. She has nightmares, as does Lysette. I have lost years of my daughters’ lives. Their childhood is gone and they are about to be wed.” Saint-Martin arched a brow. “They are about to be wed, oui?”\u003c/p\u003e\n\u003cp\u003eLaughing, Simon stepped back. “I cannot see to both of them, my lord. Only the one.”\u003c/p\u003e\n\u003cp\u003e“What are you laughing about, Mr. Quinn?” Lynette asked, sweeping into the room with a soft smile. She held her bare hand out to him and he accepted it, lifting it to his lips.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he evaded, wrapping her arm around his. “Shall we walk?”\u003c/p\u003e\n\u003cp\u003e“I should like that.”\u003c/p\u003e\n\u003cp\u003eThey excused themselves and left the parlor, moving down the gallery to the doors leading to the outside. Once they had exited to the garden, Simon drew her closer, breathing deeply of the scents of rain-cleansed air and the seductive scent of Lynette’s perfume.\u003c/p\u003e\n\u003cp\u003e“You know,” she murmured, her lips curved sweetly, “when I first saw you, I marveled at your handsomeness and thought to myself that you would never be tamed.”\u003c/p\u003e\n\u003cp\u003e“Tamed?” His brows rose. “I am not certain I like the sound of that.”\u003c/p\u003e\n\u003cp\u003e“Oh?” She glanced up at him from beneath thick, chocolate-colored lashes. “Do you not have honorable intentions toward me, Mr. Quinn?”\u003c/p\u003e\n\u003cp\u003e“‘Mr. Quinn,’ is it?” He sidestepped behind a tall hedge and dragged her with him. Cupping her face, he kissed her, releasing only the veriest portion of his insatiable desire for her.\u003c/p\u003e\n\u003cp\u003eHe licked across her lips, nibbling, teasing. Relishing the wordless entreaties she made, soft pleas for more than he could possibly give her here. His tongue stroked deep into her mouth, licking, tasting, drinking her in. “You would not want me tamed, a thiasce.”\u003c/p\u003e\n\u003cp\u003e“Let me come to you tonight,” she whispered, her head tilted back, her eyes closed.\u003c/p\u003e\n\u003cp\u003e“Don’t tempt me,” he growled.\u003c/p\u003e\n\u003cp\u003e“Simon.” She gave an exasperated laugh and opened her eyes. “You will drive me insane. Have you any notion of how I dream of you? How I miss you? Sometimes at night I think of you lewdly. I feel your hands on my skin, your mouth on my breasts, your body covering mine . . .”\u003c/p\u003e\n\u003cp\u003e“Bloody hell.” He tugged her closer, his hips grinding restlessly against the mass of her skirts, his cock hard and throbbing within the confines of his breeches. “You would drive a saint to sin.”\u003c/p\u003e\n\u003cp\u003e“There is a gazebo in the far corner . . .” she suggested, licking her kiss-swollen lips.\u003c/p\u003e\n\u003cp\u003e“I am attempting to court you properly, curse you.”\u003c/p\u003e\n\u003cp\u003e“Seems rather late, considering the fact that you have already been inside me.” She shivered against him. “Sometimes I feel you, pushing deep . . .”\u003c/p\u003e\n\u003cp\u003eGroaning, Simon kissed her again, grateful for her passion and the freedom with which she gave herself to him. Without shyness or reservation, trusting him implicitly, as she had from the very first.\u003c/p\u003e\n\u003cp\u003e“What are you waiting for?” she asked breathlessly.\u003c/p\u003e\n\u003cp\u003e“I want to give you time,” he said hoarsely, tucking a golden curl behind her ear. “I want you to be certain I am what you want.”\u003c/p\u003e\n\u003cp\u003eLynette’s brows rose. “And if I find someone else? You would allow me to go?”\u003c/p\u003e\n\u003cp\u003eHis hands tightened involuntarily into her tender flesh and he forced himself to release her. “No.”\u003c/p\u003e\n\u003cp\u003eHer slender arms wrapped around his waist, bridging the gap he had just created. “I thought not. So you torture us both for nothing.”\u003c/p\u003e\n\u003cp\u003e“I have nothing to offer you.”\u003c/p\u003e\n\u003cp\u003e“Give me your heart and your body, those are all I desire from you. The rest—home, family—we will create on our own. Saint-Martin has promised a substantial dowry.” \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-43.html","bookId":2661,"creation":"Oct 5, 2019 9:55:39 AM","modification":"Oct 5, 2019 9:55:39 AM"}
