{"id":39179,"no":43,"title":"CHAPTER VIII","content":"\u0026nbsp;‘GOOD NIGHT, GOOD REST. AH! NEITHER BE MY SHARE.’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maurice Clissold sat for some time, smoking and musing by the hearth—sat till the light faded outside the diamond-paned windows, and the shadows deepened within the room. He might have sat on longer had he not been surprised by the opening of a door in that angle of the hall which was sacred to age and infirmity in the person of old Mrs. Trevanard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the door of her room which had opened. ‘Have they come back yet?’ asked her feeble old voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, ma’am,’ answered Maurice, ‘not yet. Can I do anything for you?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, sir. It’s the strange gentleman, Mr.—Mr.——’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Clissold. Yes, ma’am. Won’t you come to your old place by the fire?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No; I’ve my fire in here, thank you kindly. But the place seems lonesome when they’re away. I’m not much of a one to talk myself, but I like to hear voices. The hours seem so long without them. You can come in, if you please, sir. My room is kept pretty tidy, I believe; I should fret if I thought it wasn’t.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman was standing on the threshold of the door opening between the two rooms. Maurice had risen to offer her assistance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come in and sit down a bit,’ she said, pleased at having found some one to talk to, for it was a notorious fact at Borcel End that old Mrs. Trevanard always had a great deal more to say for herself when her daughter-in-law was out of the way than she had in the somewhat freezing presence of that admirable housewife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maurice complied, and entered the room which he had observed through the half-glass door, a comfortable homely room enough, in the light of an excellent fire. Old Mrs. Trevanard required a great deal of warmth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She went back to her arm-chair, and motioned her visitor to a seat on the other side of the hearth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It’s very kind of you to be troubled with an old woman like me,’ she mumbled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I dare say you could tell me plenty of interesting stories about Borcel End if you were inclined, Mrs. Trevanard,’ said Maurice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, there’s few houses without a history; few women of my age that haven’t seen a good deal of family troubles and family secrets. The best thing an old woman can do is to hold her tongue. That’s what my daughter-in-law’s always telling me. “Least said, soonest mended.”’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah,’ thought Maurice, ‘the dowager has been warned against being over-communicative.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Contemplating the room more at his leisure now than he had done from outside, he perceived a picture hanging over the chimney-piece which he had not noticed before. It was a commonplace portrait enough, by some provincial limner’s hand, the portrait of a young woman in a gipsy hat and flowered damask gown—a picture that was perhaps a century old.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Is that picture over the chimney a portrait of one of your son’s family, ma’am?’ asked Maurice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes. That’s my husband’s mother, Justina Trevanard.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Justina. The name startled him—so uncommon a name—and to find it here in the Trevanard family.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That’s a curious name,’ he said, ‘and one which recalls a person I met under peculiar circumstances. Have you had many Justinas in the Trevanard family since that day?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, there was never anybody christened after her.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I met your granddaughter in the garden the other night, Mrs. Trevanard,’ said Maurice, determined to find out whether this blind woman was a friend to Muriel, ‘and I was grieved to see her in so sad a condition.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Muriel. Yes, poor girl, it’s very sad—sad for all of us,’ answered the old woman, with a sigh, ‘saddest of all for her father. He was so proud of that girl—spared no money to make her a lady, and now he can’t bear to see her. It wounds him too deep to see such a wreck. Yet he won’t have her away from the house. He likes to know that she’s near him, and as well cared for as she can be—in her state.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It must have been a great sorrow that so changed her?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It was more sorrow than she could bear, poor child; though others have borne harder things.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘She was crossed in love, her brother told me.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, yes—crossed in love, that was it. The young man that she loved died young, and she was told of it suddenly. The shock turned her brain. She had a fever, and every one thought she was going to die. She got the better of the illness, but her senses never came back to her. She’s quite harmless, as you’ve seen, I dare say; but she has her fancies, and one is to think that the young man she was fond of is still alive, and that he’ll keep his promise and come back to her.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maurice told Mrs. Trevanard of his first night at Borcel End, and the intrusion which had shortened his slumbers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, to think that she should have happened to find her way there that night, close as we keep her! My door is always locked, and she can’t get out into the house without coming through this room; but I suppose that night I must have forgotten to take the key out of the door and put it under my pillow as I do mostly. And the poor child went roaming about the house by moonlight. That’s an old trick of hers. The room where you sleep was her room once upon a time, and she always goes there if she gets the chance. It was unlucky that it should have happened the first night of your being here!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘She is very fond of you, I suppose,’ said Maurice, anxious to hear more of one in whom he felt a strong interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, I think she likes me better than any one else now.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Better even than her own mother?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, yes, she does not get on very well with her mother; she has odd fancies about her.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I thought as much. I have heard her speak of a child. That was a mere delusion, I conclude.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, that was one of her fancies.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Has Mrs. Trevanard never consulted any medical man upon the state of her daughter’s mind?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Medical man,’ repeated the old woman, dubiously. ‘You mean a doctor, I suppose? Yes; Dr. Mitchell, from Seacomb, has seen the poor child many a time, and given her physic for this, that, and the other, but he says her mind will never be any different. There’s no use worrying about that. He gives her stuff for her appetite sometimes, for she has but a poor appetite at the best. She’s sorely wasted away from the figure she was once upon a time.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘She was a very beautiful girl, I have heard from Martin.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, I never saw a handsomer girl than Muriel when she came from school. It was all along of sending her to boarding school things went wrong.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How do you mean?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh dear me, sir, you mustn’t listen to my rambling talk, I’m a weak old woman, and I dare say my mind goes astray sometimes, just like Muriel’s.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A light step sounded on the narrow stairs, a door in the paneling opened, and the figure Maurice had first seen in the spectral light of the moon came towards the hearth, and crouched down at the grandmother’s knees. A slender figure, dressed in a light-coloured gown which looked white in the uncertain flare of the fire, a pale worn face, a mass of tangled hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Muriel took the old woman’s withered hand, laid her hollow cheek against it, and kissed it fondly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Granny,’ she murmured, ‘patient, loving granny. Muriel’s only friend.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Trevanard smoothed the dark hair with her tremulous hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How tangled it is, Muriel! Why won’t you let me brush it, and keep it nice for you? My poor old hands can do that without the help of eyes.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why should it be made smooth or nice? He isn’t coming back yet. See here, granny, you shall dress me the day he comes home—all in white—with myrtle in my hair, like a bride. I would have orange blossoms if I knew where to get any. There are some orange trees up at the Manor House. I’ll ask him to bring me some. I was never dressed like a bride.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, Muriel, Muriel, so full of fancies!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah! but there are some of them real—too real. Where is the old cradle that my little brother used to sleep in?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t know, darling. In the loft, perhaps.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘They should have burnt it. I peeped into the loft one day, and saw it in a corner—the old cradle. It set me thinking—such strange thoughts!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She remained silent for a few minutes, still crouching at her grandmother’s knees, and with her hollow eyes fixed on the low fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Didn’t you hear a child cry?’ she asked, suddenly, looking up with a listening face first at the old woman, then at Maurice. ‘Didn’t you, granny?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, love. I heard nothing.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Didn’t you, then?’ to Maurice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, indeed.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, you are all of you deaf. I hear that crying so often—a poor little feeble voice. It comes and goes like the wind in the long winter nights, but it sounds so distant. Why doesn’t it come nearer? Why doesn’t it come close to us, that we may take the child in and comfort it?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, Muriel, Muriel, so full of fancies,’ repeated the old woman, like the burden of an ancient ballad.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sound of doors opening, and loud voices, announced the return of the family.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You’d better go back to the hall, sir. Bridget won’t like to find you here with her,’ said Mrs. Trevanard in a hurried whisper, pointing to the figure leaning against her knees.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maurice obeyed without a word. His last look at Muriel showed him the great haggard eyes gazing at the fire, the wasted hands clasped upon the grandmother’s knee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left Borcel early next morning, Martin insisting upon bearing him company for the first few miles of his journey. He had paid liberally for his entertainment, rewarded the servant, and parted upon excellent terms with Mr. and Mrs. Trevanard and the blind grandmother. But he saw no more of Muriel, and it was with her image that Borcel End was most associated in his mind. When he was parting with Martin he ventured to speak of her, for the first time since that conversation in the dog-cart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Martin, I am going to say something which will perhaps offend you, but it is something I can’t help saying.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t think there’s much fear of offence between you and me—at least not on my side.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am not so sure of that; some subjects are hazardous even between friends. You remember our talk about your sister? Well, I have seen her twice since then, never mind how or where; and I am more interested at her sad story than I can well express to you. It seems to me that there is something in that story which you, her only brother, ought to know, or, in a word, that she has need of your love and protection. Do not suppose for a moment that I would insinuate anything against your father and mother. They have doubtless done their duty to her according to their lights, but it is just possible that she has need of more active friendship, more sympathetic affection, than they can give. She clings to her old grandmother—a fading succour. When old Mrs. Trevanard dies, your sister will lose a natural nurse and protector. It will be your duty to lighten that loss for her, to interpose your love between her and the sense of desolation that may then arise. You are not angry with me for saying so much?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Angry with you? no, indeed! You set me thinking, that’s all. Poor Muriel! I used to be so fond of her when I was a little chap, and perhaps I have thought too little about her of late years. My mother doesn’t like any interference upon that point—doesn’t even like me to talk of my poor sister, and so I’ve got into the way of taking things for granted, and holding my tongue. Honestly, if I had thought there was anything to be done for Muriel, that she could be better off than she is, or happier than she is, I should have been the first to make the attempt to bring about that improvement. But my mother has always told me there was nothing to be done except submit to the will of Providence.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your mother may be right, Martin; it is not for me, a stranger in your home, to gainsay her. But your sister’s case seems to me most pitiful, and it will be long before I shall get her image out of my mind. If ever there should come a time when you may need the advice or the assistance of a man of the world upon that subject, be very sure my best services will be at your disposal. And whenever you come to London on business or on pleasure, remember that you are to make my home yours.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I shall take you at your word. But you are more likely to come back to Borcel than I to come to London, for, mind, I count upon your coming next summer. And now you are so thick with the Manor House people you’ve some inducement for coming,’ added Martin, with the faintest touch of bitterness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There is temptation enough for me at Borcel End, Martin, without any question of the Manor House.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Martin shook his head incredulously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Miss Bellingham is too pretty to be left out of the question,’ he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Miss Bellingham! A mere Dresden china beauty, a very fine specimen of human waxwork. I have told you my adventure in that line, Martin. I’m not likely to make a second venture.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They parted with the friendliest farewell, and Maurice felt that he was leaving something more than a chance acquaintance behind him at Borcel End.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2127/80758.html","bookId":486,"creation":"Aug 5, 2019 11:09:54 AM","modification":"Aug 5, 2019 11:09:54 AM"}
