{"id":90572,"no":16,"title":"Page 16","content":"\u003cp\u003e\"Are you okay?\" Cassie asked Suzan, whom she happened to be lying on. \"Is everybody okay?\"\u003c/p\u003e\n\u003cp\u003eThe Circle was lying scattered over the vacant lot as if some giant hand had dropped them. But everyone was moving.\u003c/p\u003e\n\u003cp\u003e\"I think my arm\u0027s broken,\" Deborah said, rather calmly. Laurel crawled over to her to look at it.\u003c/p\u003e\n\u003cp\u003eCassie stared around the lot. The house was gone. Number Thirteen was a barren piece of land again. And the light was changing.\u003c/p\u003e\n\u003cp\u003e\"Look,\" Melanie said, her face turned up. This time there was joy and reverence in her voice.\u003c/p\u003e\n\u003cp\u003eThe moon was showing silver again, just a thin crescent, but now the crescent was growing. The blood color was gone.\u003c/p\u003e\n\u003cp\u003e\"We did it,\" Doug said, his blond hair disheveled more wildly than Cassie had ever seen it. He grinned. \"Hey! We did it!\"\u003c/p\u003e\n\u003cp\u003e\"Cassie did it,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"Is he really gone?\" Suzan asked sharply. \"Gone for good this time?\"\u003c/p\u003e\n\u003cp\u003eCassie looked around again, sensing nothing but brisk air and the endlessly moving sea. The earth was quiet. There was no light but moon and stars.\u003c/p\u003e\n\u003cp\u003e\"I think he is,\" she whispered. \"I think we won.\" Then she turned quickly to Adam. \"What about the hurricane?\"\u003c/p\u003e\n\u003cp\u003eHe was fumbling at his belt with the radio. \"I hope it\u0027s not broken,\" he said, and put the headphones on, listening.\u003c/p\u003e\n\u003cp\u003eLimping and crawling, they all gathered around him, and waited.\u003c/p\u003e\n\u003cp\u003eHe kept listening, shaking his head, flicking the channels. His face was tense. Cassie saw Diana beside her, and reached out to take her hand. They sat together, hanging on. Then Adam sat straight suddenly.\u003c/p\u003e\n\u003cp\u003e\"Gale force winds on Cape Cod . . . storm moving northeast. . . northeast! It\u0027s turned! It\u0027s heading out to sea!\"\u003c/p\u003e\n\u003cp\u003eThe Henderson brothers cheered, but Melanie hushed them. Adam was talking again.\u003c/p\u003e\n\u003cp\u003e\"High tides . . . flooding . . . but it\u0027s okay, nobody\u0027s hurt. Property damage, that\u0027s all. We did it! We really did it!\"\u003c/p\u003e\n\u003cp\u003e\"Cassie did it - \" Nick was beginning again, irritably, but Adam had leaped up and grabbed Cassie and was whirling her in the air. Cassie shrieked and kept shrieking as he swooped her around. She hadn\u0027t seen Adam this happy since ... well, she couldn\u0027t remember when she\u0027d seen Adam this happy. Since the beach on Cape Cod, she guessed, when he\u0027d flashed that daredevil smile at her. She\u0027d forgotten, in their months of trouble, that grimness wasn\u0027t Adam\u0027s natural state.\u003c/p\u003e\n\u003cp\u003eLike Herne, she thought, when she was deposited, breathless and flushed, back on her feet. The horned god of the forest was a god of joyful celebration. Chris and Doug were trying to dance with her now, both together. Adam was waltzing Diana. Cassie collapsed, laughing, just as something large and furry hit her and rolled her over.\u003c/p\u003e\n\u003cp\u003e\"Raj!\" Adam said. \"I told you to stay at home!\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s about as obedient as all of you,\" Cassie gasped, hugging the German shepherd as his wet tongue lapped her face. \"But I\u0027m glad you came. All you guys, not the dog,\" she said, looking around at them.\u003c/p\u003e\n\u003cp\u003e\"We couldn\u0027t just leave you in there,\" Sean said.\u003c/p\u003e\n\u003cp\u003eDoug snickered, but he slapped the smaller boy on the back. \"\u0027Course not, tiger,\" he said, and rolled his eyes at Cassie.\u003c/p\u003e\n\u003cp\u003eCassie was looking at Faye, who had been sitting a little apart from everyone else, the way Nick used to do. \"I\u0027m glad you came to join us too,\" she said.\u003c/p\u003e\n\u003cp\u003eFaye didn\u0027t look anything at all like a stenographer. Her mane of pitch-black hair was loose over her shoulders, and the black shift exposed more pale honey-colored skin than it covered. She looked a little bit like a panther and a lot like a jungle queen.\u003c/p\u003e\n\u003cp\u003eHer heavy-lidded golden eyes met Cassie\u0027s directly, and a small smile tugged at the corners of her lips.\u003c/p\u003e\n\u003cp\u003eThen she looked down. \"I can do my nails red again, anyway,\" she said lazily.\u003c/p\u003e\n\u003cp\u003eCassie turned away, hiding a smile of her own. That was probably as much acknowledgement from Faye as she was ever going to get.\u003c/p\u003e\n\u003cp\u003e\"If you guys are all finished yelling and dancing,\" Laurel said, in a carefully patient voice, \"can we go home now? Because Deborah\u0027s arm is broken.\"\u003c/p\u003e\n\u003cp\u003eCassie jumped up guiltily. \"Why didn\u0027t you say so?\"\u003c/p\u003e\n\u003cp\u003e\"Aw, it\u0027s nothing,\" Deborah said. But she let Nick and Laurel help her up.\u003c/p\u003e\n\u003cp\u003eAs they walked back, Cassie was struck by another thought. Her mother. Black John was dead, the hurricane was detoured, but what about her mother?\u003c/p\u003e\n\u003cp\u003e\"Can we take Deborah to the crones?\" she asked Diana.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the best place, anyway,\" Diana said. \"They know the most about healing.\" She looked at Cassie with understanding in her green eyes, then she took Cassie\u0027s hand and squeezed it.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got to prepare myself, Cassie thought as they approached Number Four. I\u0027ve got to be ready. She could be dead. She could be just the same as when I left there . . . lying on that bed. She could stay that way forever.\u003c/p\u003e\n\u003cp\u003eWhatever happens, I kept my promise. I stopped Black John. He won\u0027t ever hurt her again.\u003c/p\u003e\n\u003cp\u003eCassie glanced up at the moon before stepping up to Melanie\u0027s house. It was a thick crescent now, a fat happy moon. She took it as a good omen.\u003c/p\u003e\n\u003cp\u003eInside, candles flickered. Cassie wondered for one wild instant if the three old ladies were still dancing around sky-clad, and then she saw the parlor. Great-aunt Constance was sitting as stiff as a ramrod on the rounded seat of a chair, immaculately dressed and looking very proper as she served tea by candlelight to her three guests.\u003c/p\u003e\n\u003cp\u003eTo her three guests . . .\u003c/p\u003e\n\u003cp\u003e\"Mom.\u0027\" cried Cassie, and she ran forward, knocking over one of Great-aunt Constance\u0027s fragile chairs as she went. The next minute she was holding her mother, hugging her wildly on Aunt Constance\u0027s couch. And her mother was hugging back.\u003c/p\u003e\n\u003cp\u003e\"Good heavens, Cassie,\" her mother said a few minutes later, pulling away slightly to look at her. \"The way you\u0027re dressed . . .\"\u003c/p\u003e\n\u003cp\u003eCassie felt for the diadem, which had fallen askew. She settled it on her head and looked into her mother\u0027s eyes. She was so happy to see those eyes looking back at her, and seeing, that she forgot to answer.\u003c/p\u003e\n\u003cp\u003eDeborah\u0027s voice came from the hallway, tired but proud. \"She\u0027s our leader,\" she said. Then: \"Anybody got an aspirin?\"\u003c/p\u003e\n\u003cp\u003e\"Well, obviously it isn\u0027t just temporary,\" Laurel said, looking nettled. \"I mean, we elected you.\"\u003c/p\u003e\n\u003cp\u003e\"And you came through,\" Deborah said, taking a large bite out of an apple with the hand that wasn\u0027t in a cast.\u003c/p\u003e\n\u003cp\u003eIt was the next day. There was no school, because of minor storm damage and the disappearance of the principal. The Circle was enjoying the unseasonably mild weather by having a picnic in Diana\u0027s backyard.\u003c/p\u003e\n\u003cp\u003e\"But we\u0027ve got two leaders now,\" said Chris. \"Or is Faye unelected?\"\u003c/p\u003e\n\u003cp\u003e\"Hardly,\" Faye said, with a withering glance.\u003c/p\u003e\n\u003cp\u003eMelanie shifted thoughtfully, her gray eyes considering. \"Well, other covens have had more than one leader. The original coven did; remember, Black John was only one of the leaders. You could share with Faye, Cassie.\"\u003c/p\u003e\n\u003cp\u003eCassie shook her head. \"Not without Diana.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\" said Doug.\u003c/p\u003e\n\u003cp\u003eNick directed an amused glance at her. \"Diana might not want the honor,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care,\" Cassie said, before Diana could say anything. \"I won\u0027t be leader without Diana. I\u0027ll quit. I\u0027ll go back to California.\"\u003c/p\u003e\n\u003cp\u003e\"Look, you can\u0027t all be leaders,\" Deborah began.\u003c/p\u003e\n\u003cp\u003e\"Why not?\" Melanie asked, sitting up. \"Actually, it\u0027s a good idea. You could be a triumvirate. You know, like in Roman times; they had three rulers.\"\u003c/p\u003e\n\u003cp\u003e\"Diana might not want to,\" Nick repeated, with rising inflection. But Cassie got up and went over to her anxiously.\u003c/p\u003e\n\u003cp\u003e\"You will, won\u0027t you?\" she said. \"For me?\"\u003c/p\u003e\n\u003cp\u003eDiana looked at her, then at the rest of the Club.\u003c/p\u003e\n\u003cp\u003e\"Yeah, go on,\" Doug said expansively.\u003c/p\u003e\n\u003cp\u003e\"Three\u0027s a good number,\" Laurel added, smiling impishly.\u003c/p\u003e\n\u003cp\u003eFaye sighed heavily. \"Oh, why not?\" she grumbled, looking in the other direction.\u003c/p\u003e\n\u003cp\u003eDiana looked at Cassie. \"All right,\" she said.\u003c/p\u003e\n\u003cp\u003eCassie hugged her.\u003c/p\u003e\n\u003cp\u003eDiana pushed a strand of fair hair back. \"Now I\u0027ve got something for you to do,\" she said. \"As a leader, you\u0027re not a junior member of the coven anymore, Cassie, but nobody else can do this. Will you please go and dig up that box I gave you on the night of Hecate?\"\u003c/p\u003e\n\u003cp\u003e\"The trust festival box? Is this the time to unbury it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Diana said. \"It is.\" She was looking at Melanie and Melanie was nodding at her, obviously sharing some secret.\u003c/p\u003e\n\u003cp\u003eCassie looked at both of them, puzzled, but then she went down the road to get the box, accompanied only by Raj, who trotted along behind her. It was wonderful to be alone, and to know that nothing was out to get her. She dug in the sand near the big rock where she\u0027d buried it that night, and pulled the damp box out. The sea flashed and sparkled at her.\u003c/p\u003e\n\u003cp\u003eShe brought it back to Diana\u0027s house, breathless from the walk, and presented it to Diana.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s in there? More Master Tools?\" Doug said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s probably some girl thing,\" said Chris.\u003c/p\u003e\n\u003cp\u003eDiana bent over the box, an odd expression on her face. \"You didn\u0027t open it,\" she said to Cassie.\u003c/p\u003e\n\u003cp\u003eCassie shook her head.\u003c/p\u003e\n\u003cp\u003e\"Well, I know you didn\u0027t,\" Diana said. \"I knew you wouldn\u0027t. But I wanted you to know. Anyway, it\u0027s yours; and what\u0027s inside it, too. It\u0027s a present.\" She blew drying sand off the box and handed it back to Cassie.\u003c/p\u003e\n\u003cp\u003eCassie looked at her doubtfully, then shook the box. It rattled lightly, as if there were something small inside. She glanced at Diana again. Then, hesitantly, with an almost scared feeling, she opened it.\u003c/p\u003e\n\u003cp\u003eInside, there was only one object. A little oval of rock, pale blue swirled with gray, embedded all over with tiny crystals which sparkled in the sunlight.\u003c/p\u003e\n\u003cp\u003eThe chalcedony rose.\u003c/p\u003e\n\u003cp\u003eEvery muscle frozen but her eyes, Cassie looked at Diana. She didn\u0027t know what to do or say. She didn\u0027t understand. But her heart was beating violently.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s yours,\" Diana said again, and then, as Cassie just crouched there, immobile, she looked at Melanie. \"Maybe you\u0027d better explain.\"\u003c/p\u003e\n\u003cp\u003eMelanie cleared her throat. \"Well,\" she said, and looked over at Adam, who was sitting as still as Cassie. He hadn\u0027t said much all morning, and now he was staring at Diana wordlessly, riveted.\u003c/p\u003e\n\u003cp\u003e\"Well,\" Melanie said again. Adam still wouldn\u0027t look at her, so she went on anyway. \"It was when Adam was telling us about how he met you,\" she said to Cassie. \"He described a connection - what you called a silver cord. You remember that?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said Cassie, not moving otherwise. She was looking at Diana now too, searching Diana\u0027s face. Diana looked back serenely.\u003c/p\u003e\n\u003cp\u003e\"Well, the silver cord is something real, something in the old legends. The people it connects are soul mates - you know, meant to be together. So when Diana and I heard about it, we knew that\u0027s what you and Adam are,\" Melanie finished, sounding glad to be done explaining to people who wouldn\u0027t look at her.\u003c/p\u003e\n\u003cp\u003e\"That was why I was surprised about Nick, you see,\" Diana said to Cassie, gently. \"Because I knew you could only love Adam. And I was going to tell you at the very beginning, but then you were asking me to give you another chance, to let you prove you could be faithful . . . and I thought that was a good idea. Not for me, but for you. So you\u0027d know, Cassie, how strong you are. Do you see?\"\u003c/p\u003e\n\u003cp\u003eCassie nodded mutely. \"But - Diana - \" she whispered.\u003c/p\u003e\n\u003cp\u003eDiana blinked, her emerald eyes misting over. \"Now you\u0027re going to make me cry,\" she said. \"Cassie, with all the unselfishness that\u0027s been going on around here, do you think I\u0027m not going to do my part? You two have been waiting for months because of me. Now you don\u0027t have to wait anymore.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing anybody can do about it,\" Melanie put in, sympathetically but pragmatically. \"You and Adam are linked, and that\u0027s it. There isn\u0027t anyone else for either of you, so you\u0027re stuck together for this lifetime. Maybe for a lot of lifetimes.\"\u003c/p\u003e\n\u003cp\u003eCassie, still frozen, shifted her eyes to Adam.\u003c/p\u003e\n\u003cp\u003eHe was looking at Diana. \"Diana, I can\u0027t just ... I mean, I\u0027ll always - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll always love you, too,\" Diana said steadily. \"You\u0027ll always be special to me, Adam. But it\u0027s Cassie you\u0027re in love with.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Adam whispered.\u003c/p\u003e\n\u003cp\u003eCassie looked down at the rough little stone in her palm. It was sparkling crazily and she felt very dizzy.\u003c/p\u003e\n\u003cp\u003e\"Go on, go over to him,\" Diana said, pushing her gently.\u003c/p\u003e\n\u003cp\u003eBut Cassie couldn\u0027t, so he came to her. He looked a bit dazed, but his eyes were as blue as the ocean in sunlight, and the way he smiled at her made her blush.\u003c/p\u003e\n\u003cp\u003e\"Go on, kiss her,\" Chris said. Laurel smacked him. The rest of the Circle looked on with great interest.\u003c/p\u003e\n\u003cp\u003eAdam glared at them and kissed Cassie formally on the cheek. Then, under cover of the groans, he whispered \"Later,\" to her in a way that made her pleasantly nervous.\u003c/p\u003e\n\u003cp\u003eCan I handle Herne? she wondered, looking up at his hair that was so many colors: dark like garnet and bright like holly berries, threaded with gold in the sunshine. I guess I\u0027m going to have to, she thought. For a lifetime, Melanie had said; maybe a lot of lifetimes.\u003c/p\u003e\n\u003cp\u003eFor some reason that made her look at Faye and Diana.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know why, and then she had a flash of memory. Sunlight. Golden sunlight, the smell of jasmine and lavender, a laughing voice singing. Kate. Kate\u0027s hair had been the impossible fair color of Diana\u0027s. But, Cassie realized now, Kate\u0027s laughing, teasing eyes had been Faye\u0027s.\u003c/p\u003e\n\u003cp\u003eAn ancestress of both of them, Cassie thought. After all, they\u0027re cousins; they\u0027ve got most of their ancestors in common.\u003c/p\u003e\n\u003cp\u003eBut something deep inside her seemed to smile, and she wondered. Was Melanie right; was it possible to have more than one life? Could a soul keep coming back to Earth? And if so, could a soul ever - split?\u003c/p\u003e\n\u003cp\u003e\"I think,\" she said suddenly to Diana, \"that you and Faye are going to have to learn to get along. I think you two . . . need each other.\" \"Of course,\" Diana said, as if it were something everybody knew. \"But why?\"\u003c/p\u003e\n\u003cp\u003eIt was probably a crazy theory. Cassie wouldn\u0027t tell her about it, or at least not right now. Maybe tomorrow.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to do a picture, I believe,\" Diana was saying thoughtfully, \"to add to my collection. What do you think of the Muse, with the moon and stars around her, looking inspired?\"\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s a good idea,\" Cassie said unsteadily.\u003c/p\u003e\n\u003cp\u003e\"What we really have to talk about,\" said Melanie, \"is what we\u0027re going to do with the Master Tools now. We have power; the coven has power, and we need to decide what to do with it.\"\u003c/p\u003e\n\u003cp\u003e\"Naw, what we need to do is party,\" Doug said. \"To make up for all the birthdays that we missed. Chris and me didn\u0027t get a real party, and neither did Sean or Laurel...\"\u003c/p\u003e\n\u003cp\u003e\"Environmentalist!!,\" Laurel was saying firmly to Melanie. \"That should be our first cause.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t get a party either,\" Suzan pointed out, delicately peeling the wrapper off a Twinkie.\u003c/p\u003e\n\u003cp\u003eFaye examined her nails, jewel-red, in the sunlight. \"I know some people I want to hex,\" she said.\u003c/p\u003e\n\u003cp\u003eCassie looked at them all, her coven, laughing and arguing and debating with each other. She looked at Nick, who was leaning back, looking amused, and he caught her eye and winked.\u003c/p\u003e\n\u003cp\u003eThen she looked at Diana, whose clear green eyes shone at her for a moment. Then, \"Yes, environmentalism is good,\" Diana said, turning to Laurel. \"But we have to think about how to improve relations with the outsiders, too ...\"\u003c/p\u003e\n\u003cp\u003eCassie looked at Adam and found him looking at her. He took her hand, closing it in his own, both of them holding the chalcedony rose.\u003c/p\u003e\n\u003cp\u003eCassie looked down at their intertwined fingers, and it seemed that she could see the silver cord again, wrapping around their two hands, connecting them. But not just them. Filaments of the cord seemed to web out and touch the others of the group, linking them together with silver light. They were all connected, all part of one another, and the light shone around them to touch the earth and sky and sea.\u003c/p\u003e\n\u003cp\u003eSky and sea, keep harm from me. Earth and fire, bring my desire.\u003c/p\u003e\n\u003cp\u003eThey had. And they would in the future. With her inner vision, Cassie saw that the Circle was part of something bigger, like a spiral that went on and on forever, encompassing everything, touching the stars.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" Adam whispered.\u003c/p\u003e\n\u003cp\u003eFrom the center of the Circle, Cassie smiled. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-circle-the-power-the-secret-circle-3/page-16.html","bookId":2097,"creation":"Oct 5, 2019 5:43:49 PM","modification":"Oct 5, 2019 5:43:49 PM"}
