{"id":104585,"no":10,"title":"Page 10","content":"\u003cp\u003e“Is that like a shopping mall?”\u003c/p\u003e\n\u003cp\u003e“A shopping mall where manufacturers sell their products directly to the public through their own stores. Mostly you see them in locations far away from major cities. That’s because the rents are cheaper, which reduces overhead, and because most of these manufacturers have contracts with conventional retailers that sell their products. The malls have to be located in places where they won’t compete with them.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I know what you’re thinking, McKenzie—a mall in a town with a population of twelve hundred, in a county with only thirty-three hundred people? But it was a good plan. The plan would have worked. An outlet mall here would have drawn customers from Prairie City and Bison, Meadow, Faith, Isabel, Timber Lake, Dupree—where else?—Lemmon, Reva, Lodgepole. You have to remember, we’re five hundred thirty miles from Denver, six hundred miles from Minneapolis, and about the same distance from Omaha. The nearest decent shopping—we’re nearly four hours by car from both Rapid City and Aberdeen. An outlet mall here would have been huge.”\u003c/p\u003e\n\u003cp\u003e“Except he did not intend to build a mall.”\u003c/p\u003e\n\u003cp\u003e“No. All he wanted was our money.”\u003c/p\u003e\n\u003cp\u003e“How much did he take you for?”\u003c/p\u003e\n\u003cp\u003eShe said, “Nothing from me,” in a way that made me think she was lying. “The city, though, and some others—he picked us clean and disappeared.”\u003c/p\u003e\n\u003cp\u003e“How long ago?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow will make a week. McKenzie, can I rely on your discretion?”\u003c/p\u003e\n\u003cp\u003e“Not even a little bit.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, if we let you go—”\u003c/p\u003e\n\u003cp\u003e“What do you mean, if?”\u003c/p\u003e\n\u003cp\u003e“That came out wrong.”\u003c/p\u003e\n\u003cp\u003e“I certainly hope so.”\u003c/p\u003e\n\u003cp\u003e“I meant when we let you go—McKenzie, we need your help.”\u003c/p\u003e\n\u003cp\u003e“To do what?”\u003c/p\u003e\n\u003cp\u003e“To catch Rush—to catch the Imposter.”\u003c/p\u003e\n\u003cp\u003e“Call the cops.”\u003c/p\u003e\n\u003cp\u003e“Chief Gustafson is working on it.”\u003c/p\u003e\n\u003cp\u003e“Call the real cops. Call the South Dakota Division of Criminal Investigation. Call the FBI.”\u003c/p\u003e\n\u003cp\u003e“We don’t want—we’re trying to avoid—our losses were severe, McKenzie. The city was forced to borrow to maintain basic services. Others were hurt, as well—the bank, some Main Street businesses, other investors. McKenzie, small towns all across America are drying up and blowing away. We were doing okay, except now—if we get the money back, a lot of people will be embarrassed, but life will go on. If we don’t, if people learn the city is bankrupt…”\u003c/p\u003e\n\u003cp\u003e“Do you expect me to care?”\u003c/p\u003e\n\u003cp\u003eTracie’s eyes lost their harshness then. They became soft and moist, and I found myself looking away so I didn’t have to see them. You are the mushiest person I know, my inner voice told me. It also reminded me that Libbie’s problem wasn’t my problem. Your problem is getting home.\u003c/p\u003e\n\u003cp\u003e“What do you expect me to do?” I said.\u003c/p\u003e\n\u003cp\u003e“Chief Gustafson said the only way to catch Rush, to catch the Imposter, is by finding out who he really is, where he really lives. We can do that, he said, by investigating the things the Imposter said that were true that might have slipped through all the lies he told us. Rush was here a long time and spoke to a lot of people, and the chief thinks he might have divulged information that he didn’t mean to. The problem is, we have no way of knowing what was a lie he told about you and what was the truth he might have told about himself. Only you would know the difference.”\u003c/p\u003e\n\u003cp\u003eIt was a realistic plan, probably the only plan. We are all creatures of habit and of our own experiences. Over time, even the best-trained actor will slip out of character to reveal something of himself. He’ll start ad-libbing, remembering when he did this, or when he went there, or when he saw that. It’s only breadcrumbs of information, and we all know what happened to Hansel and Gretel when they tried to rely on them. Still, a guy could get lucky. It would probably take an enormous amount of work, yet I had to admit, I found the prospect challenging.\u003c/p\u003e\n\u003cp\u003eOn the other hand, they kidnapped me from my home and chained me to a table—my head had been aching for hours. I could sue them for everything they had. ’Course, if the Imposter looted the city’s coffers, they probably didn’t have much …\u003c/p\u003e\n\u003cp\u003eI stared into Tracie’s eyes for a good long time, and then I beat on the metal table with both hands—shave and a haircut, two bits.\u003c/p\u003e\n\u003cp\u003e“What does that mean?” she said.\u003c/p\u003e\n\u003cp\u003e“Let me go.”\u003c/p\u003e\n\u003cp\u003e“Will you help us?”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it. Now let me go.”\u003c/p\u003e\n\u003cp\u003eTracie spun in her chair and looked at the one-way mirror. A few moments later, the interrogation door opened, and Chief Gustafson walked in. He was followed by the desk officer who had chained me to the table and the old man who had slugged me. Behind them was a teenaged girl with a mature body and a child’s face.\u003c/p\u003e\n\u003cp\u003eI stood as the chief walked to the table and uncuffed my hands. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-10.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
