{"id":104602,"no":28,"title":"Page 28","content":"\u003cp\u003e“Permission granted. Just keep me in the loop.”\u003c/p\u003e\n\u003cp\u003e“I’ll be asking a lot of people a lot of embarrassing questions. Do you have a problem with that?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Are you sure, Chief? You’ll be getting a lot of phone calls. These people pay your salary, after all.”\u003c/p\u003e\n\u003cp\u003e“Way I look at it, McKenzie, you don’t help us find all that money, I’m going to be out of a job anyway.”\u003c/p\u003e\n\u003cp\u003eThe Tall Moon Tavern was far enough outside of Libbie that you couldn’t see the glow of the town’s lights from there. Or much of anything else, for that matter. There was a single fading arch light mounted on a high wooden pole to help patrons negotiate the gravel parking lot—and attract every winged insect in the known world. Yet beyond the yellow circle of light it cast, there was impenetrable darkness.\u003c/p\u003e\n\u003cp\u003eI parked the Audi under the light, locked it with my remote control key chain, and made my way toward the front door; the brown stones crunched under my shoes. There was a neon sign on the door that advertised a beer I had never heard of—Ringneck Red Ale—that apparently had something to do with pheasants. Before I could reach it, the door flew open, and out stepped a thin, wiry man with a shaved head that reflected the arch light and a mustache that looked like something I tried to grow when I was a kid and gave up on after much ridicule. He moved quickly, and I had to hop to the side to avoid a collision.\u003c/p\u003e\n\u003cp\u003e“I see you,” he shouted.\u003c/p\u003e\n\u003cp\u003eHe pointed more or less down the country road. I tried to follow his finger yet could see nothing beyond the circle of light.\u003c/p\u003e\n\u003cp\u003e“I see you,” he repeated. “Bastard.”\u003c/p\u003e\n\u003cp\u003eA moment later, a car engine turned over. Headlamps flared. A vehicle had been parked alongside the county road about two hundred yards from the Tall Moon’s parking lot. It moved forward, slowly at first, then with greater speed. The thin man kept pointing his finger, pointing it like a gun, as he followed the vehicle’s progress. It wasn’t until it passed the parking lot that I could see that it was a City of Libbie Police Department cruiser. A moment later, it disappeared into the night; not even its taillights were visible.\u003c/p\u003e\n\u003cp\u003e“What was that about?” I said.\u003c/p\u003e\n\u003cp\u003e“Bastard’s trying to ruin my business,” the man said. “He parks out there, scaring my customers, making ’em think he’ll bust ’em for DUI if they drink here.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why? Why?” The man turned to me. His eyes were bright and shiny in the light. “Cuz his fucking brother-in-law owns a joint down the road, that’s why.”\u003c/p\u003e\n\u003cp\u003e“Does Chief Gustafson know about this?”\u003c/p\u003e\n\u003cp\u003e“That was Chief Gustafson. I saw him cruise past just before you arrived. I don’t know why he’s doing me like this. I’ve been competing with his brother-in-law for years, and there’s never been no, whatjacallit, animosity. Last few weeks, though, I see ’im out here a lot. I gotta figure a way to take care of this.”\u003c/p\u003e\n\u003cp\u003e“That wouldn’t be smart, messing with cops.”\u003c/p\u003e\n\u003cp\u003e“How the fuck would you know? You a cop?”\u003c/p\u003e\n\u003cp\u003e“Me? Hell no.”\u003c/p\u003e\n\u003cp\u003eI followed him inside the Tall Moon. He slipped behind a bar that looked as if it had been there since the invention of alcohol. Wooden booths with worn cushions bordered the near wall, and a regulation pool table, bumper pool table, foosball table, and plastic dart board were arrayed near the far wall. Between them were half a dozen tables and chairs. Someone had used folded napkins and cardboard to shim the legs of nearly all of the tables to keep them from tilting. That’s because the wooden floor had become so badly warped over the years that it resembled the most treacherous putting green I had ever seen—drop a golf ball and there’d be no telling where it would roll. There was a dance floor, also warped, facing a small stage that was empty save for a handwritten sign propped on a chair that promised live music every other Saturday night. In the meantime, Hank Williams was playing on a jukebox that looked like it still accepted nickels.\u003c/p\u003e\n\u003cp\u003eBehind the bar I saw assorted bottles of liquor, spigots for tap beer, coolers for bottled beer, pig’s feet in a jar, a pizza oven, beef jerky, bags of chips and pretzels, clear plastic bins filled with pull tabs, and a mirror that was badly in need of resilvering. Tracie Blake was sitting on a stool at the crowded bar. She was chatting with a bartender who seemed to only have eyes for her. I approached from behind.\u003c/p\u003e\n\u003cp\u003e“Hello, Tracie.”\u003c/p\u003e\n\u003cp\u003eShe turned to look at me. The expression on her face went from bored to surprised just like that.\u003c/p\u003e\n\u003cp\u003e“McKenzie, my God,” she said.\u003c/p\u003e\n\u003cp\u003eI sat on the stool next to hers without asking permission. The owner hustled over as if he expected trouble.\u003c/p\u003e\n\u003cp\u003e“I got it, Jeff,” he said.\u003c/p\u003e\n\u003cp\u003eHe took the much taller bartender’s elbow and literally pulled him away. Jeff frowned but began serving other customers without an argument.\u003c/p\u003e\n\u003cp\u003e“He bothering you, Tracie?” the owner asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-28.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
