{"id":104615,"no":41,"title":"Page 41","content":"\u003cp\u003eTracie gave it a moment’s thought before answering. “Ed Bizek, the city manager. He’s also the city’s director of economic development.”\u003c/p\u003e\n\u003cp\u003e“Rural flight,” Bizek said. “We’re fighting rural flight. Eighty-nine percent of the cities in the United States have fewer than three thousand people, and they’re getting smaller all the time. Six states, according to the numbers I last saw, six states—Nebraska, Kansas, Oklahoma, Iowa, North Dakota, and South Dakota—have lost over five hundred thousand residents, half of them with college degrees. Fighting rural flight. That’s what my job is all about. At least that’s what it was about.”\u003c/p\u003e\n\u003cp\u003e“Was?” I said.\u003c/p\u003e\n\u003cp\u003e“I expect to be fired at the next city council meeting.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Mistakes were made. Money was lost. Someone has to pay for that.”\u003c/p\u003e\n\u003cp\u003e“You?”\u003c/p\u003e\n\u003cp\u003e“The council sure isn’t going to blame itself.”\u003c/p\u003e\n\u003cp\u003eHe was probably right, I decided. Especially since City Councilwoman Tracie Blake was sitting in the backseat of Bizek’s car and didn’t say a word to dispute his theory.\u003c/p\u003e\n\u003cp\u003e“You know, I did check him out,” Bizek said. “The Imposter, I mean. I called his office in the Cities. I went to the Web site. I interviewed his references. We had a conference call with Rush’s other investors. The city council was there. I even called a couple of the major retailers that Rush said were interested in becoming anchor tenants. They all said that they had a strict policy against commenting on future expansion, but no one set any alarm bells to ringing, either. There was no reason to believe, to not believe … Later, after Rush disappeared, I checked again. The investors were gone, and so were the references. The Web site had been taken down, the office phone just kept on ringing, and the retailers, they all had a strict policy against commenting on future expansion. Even then I couldn’t believe it.” He looked at Tracie’s reflection in his rearview mirror. “I guess I would fire me, too.”\u003c/p\u003e\n\u003cp\u003eShe didn’t so much as smile in reply.\u003c/p\u003e\n\u003cp\u003eBizek drove his car to a halt at a four-way stop. He surprised me by putting it into park and leaning back against his door.\u003c/p\u003e\n\u003cp\u003e“Of course, it was too good to be true,” he said.\u003c/p\u003e\n\u003cp\u003eI glanced through the back window of the car, looking for the traffic that he was blocking. There wasn’t any.\u003c/p\u003e\n\u003cp\u003e“I think I knew it was too good to be true, even when Rush was telling me about it,” Bizek said. “He was projecting sales of four hundred to five hundred dollars a square foot, though. I had to listen, and the more I listened—it really would have improved our way of life. Right now people drive, some of them drive hundreds of miles, to go shopping for furniture, for appliances, for clothes and whatnot. Think of the difference it would make if people could get what they need right here. No long drives, no waste of time and gas. The revenue we’ve been losing to other communities, to Rapid City and whatnot, we would have kept that revenue. Everyone in town would have benefited.”\u003c/p\u003e\n\u003cp\u003e“Not everyone,” Tracie said.\u003c/p\u003e\n\u003cp\u003eBizek looked at her in his rearview mirror.\u003c/p\u003e\n\u003cp\u003e“Yeah, well,” he said, as if it were a topic not worth discussing. He sat straight in his seat, put the car in gear, and drove through the intersection.\u003c/p\u003e\n\u003cp\u003e“Still, the town should be all right,” Bizek said. “Look.”\u003c/p\u003e\n\u003cp\u003eHe pointed to a blond-stone building to his left. The sign above the door read northern star nursing home.\u003c/p\u003e\n\u003cp\u003e“We’ve got health care,” he said. “We’ve got assisted living. We just finished up an expansion of the Libbie Medical Clinic down on the end of First Street, which has two full-time and two part-time nurse practitioners and roving doctors. People will move to a small town to retire if you have the medical facilities.”\u003c/p\u003e\n\u003cp\u003eBizek continued his slow motor tour of Libbie, showing me a lot more than I had seen during my hike around the town’s perimeter that morning. There was a two-screen movie theater, a shoe store, a beauty parlor, a barbershop, an auto mechanic, a farm equipment dealer, a livestock sales barn, UPS—just about everything a small town needs except for a lumberyard.\u003c/p\u003e\n\u003cp\u003e“That was my biggest priority,” Bizek said. “To get a lumberyard. I worked on it for years. Talked to Home Depot, Menards, just about everyone you can think of. They all said, the big chains said, they weren’t interested in a town this size. Then I found a guy, a retired contractor—he was willing to build a lumberyard here. He was going to run it with his sons.” Bizek glanced at Tracie in his rearview again. “Only the city council wouldn’t dip into the development fund to help him out. They said it wasn’t a good investment considering our limited tax base. Still, I’d like to get a lumberyard here.”\u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-41.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
