{"id":104619,"no":45,"title":"Page 45","content":"\u003cp\u003e“How do you know his name?”\u003c/p\u003e\n\u003cp\u003e“I looked into his wallet. Everything he had in his wallet said Rushmore McKenzie except for a credit card that he had tucked into a secret compartment, although, when you think about it, there are no secret compartments in a wallet.”\u003c/p\u003e\n\u003cp\u003e“The name Nicholas Hendel was on the credit card?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Which credit card company?”\u003c/p\u003e\n\u003cp\u003eShe told me. I wrote it down.\u003c/p\u003e\n\u003cp\u003e“How did you get access to his wallet?”\u003c/p\u003e\n\u003cp\u003e“After we finished fucking he went into the bathroom. I looked then. Does that shock you?”\u003c/p\u003e\n\u003cp\u003eGeezus, not another one, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“A big-city boy like me?” I said aloud. “Hardly.”\u003c/p\u003e\n\u003cp\u003e“I’m not from a big city,” Dawn said. “I’m from a town where the biggest building is two stories high. When I met Perry, we both worked at the same call center in Franklin, which is another shitty little town just down the highway from where I lived. I married him, and I swear to God, I meant to stick with him. I would have, too, if only he had told me the truth. He promised he would take me away from small-town life, from the call center. Instead, he brought me here. Different name, same bullshit.”\u003c/p\u003e\n\u003cp\u003eI gestured at the name stitched to her pocket.\u003c/p\u003e\n\u003cp\u003e“You don’t work at the call center,” I said.\u003c/p\u003e\n\u003cp\u003e“I couldn’t do it. I couldn’t go back to that. Instead, I work for this company that delivers groceries to shut-ins and the terminally lazy. They call in with their lists, and we shop for them and deliver their groceries to their doors.”\u003c/p\u003e\n\u003cp\u003e“At least the job gets you outside.”\u003c/p\u003e\n\u003cp\u003e“That’s the only good thing about it.”\u003c/p\u003e\n\u003cp\u003e“Why did you take up with Rush?”\u003c/p\u003e\n\u003cp\u003e“He … We … I thought he was exciting.”\u003c/p\u003e\n\u003cp\u003e“More exciting than Ed Bizek?”\u003c/p\u003e\n\u003cp\u003e“You know about that?”\u003c/p\u003e\n\u003cp\u003e“Everyone knows about that.”\u003c/p\u003e\n\u003cp\u003e“Small fucking towns, small fucking minds.”\u003c/p\u003e\n\u003cp\u003e“If you say so.”\u003c/p\u003e\n\u003cp\u003e“I know what you think of me. Only I wouldn’t be this way if Perry had kept his promise.”\u003c/p\u003e\n\u003cp\u003e“If you say so.”\u003c/p\u003e\n\u003cp\u003e“Look, I came here to do you a favor.”\u003c/p\u003e\n\u003cp\u003e“I appreciate it,” I said. “I’m just wondering why you’re doing it.”\u003c/p\u003e\n\u003cp\u003e“Because I don’t want Ed to lose his job, okay? Because I don’t want him to have to move away. Is that reason enough?”\u003c/p\u003e\n\u003cp\u003e“So it’s about Ed.”\u003c/p\u003e\n\u003cp\u003e“It’s about me. If he left Libbie, I would just die.”\u003c/p\u003e\n\u003cp\u003e“If you’re so concerned, why didn’t you tell him about Rush when you first learned the truth?”\u003c/p\u003e\n\u003cp\u003e“I tried. I told him that Rush couldn’t be trusted. Only I couldn’t tell him how I knew—I couldn’t tell him … I didn’t want him to know I had cheated on him. You’re not going to tell anyone, are you? About me and Rush?”\u003c/p\u003e\n\u003cp\u003e“Who would I tell?”\u003c/p\u003e\n\u003cp\u003e“Ed.”\u003c/p\u003e\n\u003cp\u003eNot her husband, I thought.\u003c/p\u003e\n\u003cp\u003e“No,” I said. “I won’t tell anyone.”\u003c/p\u003e\n\u003cp\u003e“Thank you. I hope you find Rush. I really do.”\u003c/p\u003e\n\u003cp\u003eDawn rose from her chair and had started to move away when I stopped her with a question.\u003c/p\u003e\n\u003cp\u003e“Why did you look in the wallet?” I said.\u003c/p\u003e\n\u003cp\u003eShe hesitated before answering. “I wanted to know if he was married. He said he wasn’t.”\u003c/p\u003e\n\u003cp\u003e“Did he tell you he was going to take you away from all of this?”\u003c/p\u003e\n\u003cp\u003e“Sure. Men always tell a girl what she wants to hear. If it’ll get them what they want, they’ll say anything.”\u003c/p\u003e\n\u003cp\u003eI nodded as if I believed her.\u003c/p\u003e\n\u003cp\u003eSharren Nuffer waited until Dawn had left the dining room before she approached my table.\u003c/p\u003e\n\u003cp\u003e“What did she want?” she asked.\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Who? Dawn Neske.”\u003c/p\u003e\n\u003cp\u003e“Understanding,” I said. “She wanted understanding.”\u003c/p\u003e\n\u003cp\u003e“Did you give her any?”\u003c/p\u003e\n\u003cp\u003e“What are you so angry about?”\u003c/p\u003e\n\u003cp\u003eInstead of answering, Sharren sat across from me and pointed at my meal. “How’s the steak?”\u003c/p\u003e\n\u003cp\u003e“Quite good,” I said. To prove it, I consumed a forkful, and then another while she watched.\u003c/p\u003e\n\u003cp\u003e“I was married three times, and not once did I cheat on my husband,” Sharren said. “Not once, although that didn’t stop them from cheating on me. I want you to know that.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to think I’m like Dawn. Or Tracie.”\u003c/p\u003e\n\u003cp\u003e“What did the Imposter tell you to get you to go to bed with him?”\u003c/p\u003e\n\u003cp\u003e“Nothing. I had an itch and I let him scratch it. Simple as that. There was nothing dishonest about it.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eSharren stood abruptly.\u003c/p\u003e\n\u003cp\u003e“Not all of us are lucky in love, McKenzie,” she said. “Some of us have to take what we can get.”\u003c/p\u003e\n\u003cp\u003eWhen she left, she followed the same path from the dining room that Dawn had followed. As I watched her go, I had to admit that Sharren was right. Sex between unmarried consenting adults who don’t give a damn about each other isn’t necessarily bad. It just isn’t any good.\u003c/p\u003e\n\u003cp\u003eWhat I wanted to do next was illegal. That meant I couldn’t call Bobby Dunston, or the sergeant in the Minneapolis Police Department gang unit that I sometimes paid for information. There was no way I was going to contact Chief Gustafson, either, the blabbermouth. That left only one contact. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-45.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
