{"id":104625,"no":51,"title":"Page 51","content":"\u003cp\u003e“It would be helpful if you canvassed the area. Everyone seems to know everyone in this town. Could be someone saw something.”\u003c/p\u003e\n\u003cp\u003eThe chief sighed like a man who thought too much was being asked of him.\u003c/p\u003e\n\u003cp\u003e“About the two men in the alley,” he said.\u003c/p\u003e\n\u003cp\u003e“They were across the street when we came out of the alley,” Saranne said. “I saw them. I made them help me get McKenzie into my car so I could take him here.”\u003c/p\u003e\n\u003cp\u003e“How did you manage that?” I asked.\u003c/p\u003e\n\u003cp\u003e“Blackmail.”\u003c/p\u003e\n\u003cp\u003e“You threatened to call the police?”\u003c/p\u003e\n\u003cp\u003e“No, I threatened to call their wives. Chief, they won’t be bothering me anymore. There’s no sense to pressing charges or anything.”\u003c/p\u003e\n\u003cp\u003e“Saranne—”\u003c/p\u003e\n\u003cp\u003e“That’s another thing. My name is Sara Anne—two words. People have been slurring my name since I can remember, and I want it to stop. It’s Sara Anne. Better yet, call me Sara. Just plain Sara.”\u003c/p\u003e\n\u003cp\u003e“You go, girl,” Nancy said.\u003c/p\u003e\n\u003cp\u003eThe chief sighed some more. He said he wanted the names nonetheless. He suggested the two men witnessed the assault and, all things considered, could probably be encouraged to talk about it. Sara gave up the names. The chief wrote them down, closed his notebook, and buttoned it into the top pocket of his shirt. He bowed his head toward the girl.\u003c/p\u003e\n\u003cp\u003e“If you think of anything more, call me,” he said. “McKenzie, I’ll be in touch.”\u003c/p\u003e\n\u003cp\u003eThe chief turned toward his wife. She had been standing to the side with her arms crossed over her chest.\u003c/p\u003e\n\u003cp\u003e“I guess I’ll be seeing you later,” he said to her.\u003c/p\u003e\n\u003cp\u003e“When my shift ends,” Nancy said. “If you’re still up.”\u003c/p\u003e\n\u003cp\u003eSara Miller turned toward me the moment the chief left the room.\u003c/p\u003e\n\u003cp\u003e“What do you think?” she said.\u003c/p\u003e\n\u003cp\u003e“I think you are a very cool young lady.”\u003c/p\u003e\n\u003cp\u003e“Shuddup. Really?”\u003c/p\u003e\n\u003cp\u003e“Really. It’s getting late, though. Your parents must be worried about you.”\u003c/p\u003e\n\u003cp\u003e“I already called them. I don’t know why, but I feel so happy.”\u003c/p\u003e\n\u003cp\u003e“You’re a hero.”\u003c/p\u003e\n\u003cp\u003e“That’s not it. It’s—I don’t know what it is.”\u003c/p\u003e\n\u003cp\u003e“Have you ever read Saul Bellow?” I said. “Seize the Day?”\u003c/p\u003e\n\u003cp\u003e“Oh, McKenzie, you and your books. Don’t you know? It’s all video now.”\u003c/p\u003e\n\u003cp\u003eShe hugged me again and announced that she had to go.\u003c/p\u003e\n\u003cp\u003e“Take care, Sara,” I said.\u003c/p\u003e\n\u003cp\u003eShe smiled at the sound of her own name.\u003c/p\u003e\n\u003cp\u003e“See ya around,” she said.\u003c/p\u003e\n\u003cp\u003eA moment later she was gone.\u003c/p\u003e\n\u003cp\u003e“I’ve known that girl her entire life,” Nancy said. “That’s the longest I’ve seen her smile at one time. I have to admit, you do have a way with women.”\u003c/p\u003e\n\u003cp\u003e“It’s a gift,” I said.\u003c/p\u003e\n\u003cp\u003e“Do you want me to call Tracie for you?”\u003c/p\u003e\n\u003cp\u003e“No. If I’m going to be awakened by a woman every two hours, I’d rather it be by you.”\u003c/p\u003e\n\u003cp\u003e“Good choice.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do about her?”\u003c/p\u003e\n\u003cp\u003e“Tracie? Nothing.”\u003c/p\u003e\n\u003cp\u003e“Nothing?”\u003c/p\u003e\n\u003cp\u003e“I have a pretty healthy self-esteem, McKenzie. Before time and work destroyed my body, I was a Ferrari; I was the sleekest sports car on the road. A dozen years later I’m an SUV. I’m not any happier about it than Eric. Yet that’s the way it is, and if he can’t deal with it, then he can’t. Let him run to Tracie. If he’d rather be with a drunk than his wife, so be it. I’m not going to change just to please somebody else.”\u003c/p\u003e\n\u003cp\u003e“That somebody else is your husband.”\u003c/p\u003e\n\u003cp\u003e“Spoken like a guy.”\u003c/p\u003e\n\u003cp\u003e“You might not have noticed, but you’re married to a guy.”\u003c/p\u003e\n\u003cp\u003e“Do you condone his behavior?”\u003c/p\u003e\n\u003cp\u003e“Absolutely not.”\u003c/p\u003e\n\u003cp\u003e“Well, then.”\u003c/p\u003e\n\u003cp\u003e“I don’t condone yours, either.”\u003c/p\u003e\n\u003cp\u003e“Mine?”\u003c/p\u003e\n\u003cp\u003e“You’ve given up.”\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003e“You’re letting Tracie win. Where I come from, you never let the other guy win. He might beat you, but you never let him win. It’s a matter of principle.”\u003c/p\u003e\n\u003cp\u003e“Is that right?”\u003c/p\u003e\n\u003cp\u003e“Or is it character? I often get the two confused.”\u003c/p\u003e\n\u003cp\u003e“C’mon, McKenzie. Let’s find you a room.”\u003c/p\u003e\n\u003cp\u003eShe pushed a wheelchair to where I was sitting on the gurney.\u003c/p\u003e\n\u003cp\u003e“Really?” I said.\u003c/p\u003e\n\u003cp\u003e“Get in.”\u003c/p\u003e\n\u003cp\u003eAfter I settled into the chair, Nancy wheeled me out of the emergency room to a waiting elevator.\u003c/p\u003e\n\u003cp\u003e“How long have you been in Libbie?” she asked.\u003c/p\u003e\n\u003cp\u003e“One full day.”\u003c/p\u003e\n\u003cp\u003e“And you already have it all figured out.”\u003c/p\u003e\n\u003cp\u003e“Of course. There’s one thing you should know, though.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“I actually like Tracie Blake. She’s been very considerate. Even so, it wouldn’t bother me at all to see her run down by a Ferrari.”\u003c/p\u003e\n\u003cp\u003eNancy gave me a hospital gown to wear, and I slipped into bed, keeping my back to the wall as I crossed from the bathroom after I changed.\u003c/p\u003e\n\u003cp\u003e“You didn’t strike me as the shy type, McKenzie,” she said.\u003c/p\u003e\n\u003cp\u003e“You didn’t strike me as a voyeur.”\u003c/p\u003e\n\u003cp\u003e“That’s why I took all those medical courses, so I could see the hairy butts of middle-aged men.”\u003c/p\u003e\n\u003cp\u003e“Who are you calling middle-aged?”\u003c/p\u003e\n\u003cp\u003eAfter I settled in, Nancy gave me a bottle of water and a remote control for the TV mounted high in the corner of the room.\u003c/p\u003e\n\u003cp\u003e“We have satellite,” she said.\u003c/p\u003e\n\u003cp\u003e“I’m good.” I set the remote aside. “If you have time, I wouldn’t mind chatting.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-51.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
