{"id":104635,"no":61,"title":"Page 61","content":"\u003cp\u003e“Yes, right there.”\u003c/p\u003e\n\u003cp\u003eMrs. Miller pointed at a spot along the far edge of the clearing. There was no body. Then again, I never thought for a moment that there would be. We do not live in an Agatha Christie world. People do not admit that they committed murder and announce, “Yes, and I’m glad that I killed him, glad, do you hear? Ah ha ha ha ha ha.” I was convinced that Mrs. Miller was playing me. The question was, why? Still, just in case there was some truth to what she said, I squatted near the spot and examined the ground carefully. There were footprints, mostly the tread of tennis shoes and the impressions of boot heels.\u003c/p\u003e\n\u003cp\u003e“When was the last time you had rain?” I said.\u003c/p\u003e\n\u003cp\u003e“Last month sometime.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Do you see anything?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“No?” She seemed surprised.\u003c/p\u003e\n\u003cp\u003e“What did you kill him with?” I said.\u003c/p\u003e\n\u003cp\u003e“Rush? What did I use to kill Rush?”\u003c/p\u003e\n\u003cp\u003e“Yes, Rush. Unless you’ve killed so many people lately that it’s hard to keep them straight.”\u003c/p\u003e\n\u003cp\u003e“That’s not funny, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“I apologize.”\u003c/p\u003e\n\u003cp\u003e“I used a tree branch.”\u003c/p\u003e\n\u003cp\u003e“A tree branch?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You lured Rush here so you could kill him with a tree branch?”\u003c/p\u003e\n\u003cp\u003e“I thought it would be better that way. Harder to trace the murder weapon.”\u003c/p\u003e\n\u003cp\u003e“What did you do with it?”\u003c/p\u003e\n\u003cp\u003e“The tree branch?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I threw it into the lake.”\u003c/p\u003e\n\u003cp\u003e“You walked out to the lake where people could see you and threw the branch in?”\u003c/p\u003e\n\u003cp\u003e“It was dark. No one could see me. Besides, there was no one here. Just me and Rush.”\u003c/p\u003e\n\u003cp\u003e“No other cars in the parking lot?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI examined the ground some more. There were no bloodstains and no drag marks.\u003c/p\u003e\n\u003cp\u003e“How did you manage it?” I said.\u003c/p\u003e\n\u003cp\u003e“Manage what?”\u003c/p\u003e\n\u003cp\u003e“Mrs. Miller…”\u003c/p\u003e\n\u003cp\u003e“I told Rush to meet me here. Here in this spot. I waited for him. When he stepped into the clearing I hit him with the branch.”\u003c/p\u003e\n\u003cp\u003e“How many times did you hit him?”\u003c/p\u003e\n\u003cp\u003e“Times? Just once.”\u003c/p\u003e\n\u003cp\u003e“How did you know he was dead?”\u003c/p\u003e\n\u003cp\u003e“He fell. He didn’t move.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t mean he was dead.”\u003c/p\u003e\n\u003cp\u003e“I checked his pulse.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003eI touched my wrist and the carotid artery in my throat as I spoke. “Wrist, carotid artery—”\u003c/p\u003e\n\u003cp\u003e“Wrist.”\u003c/p\u003e\n\u003cp\u003eI held out my arm. “Show me.”\u003c/p\u003e\n\u003cp\u003eMrs. Miller set all four of her fingers over the tendons that ran down the center of my wrist instead of the radial artery that’s found on the thumb side between the tendons and the edge of the bone. She jumped back when she discovered that I didn’t have a pulse, either.\u003c/p\u003e\n\u003cp\u003e“Feeling for a pulse in the wrist isn’t always reliable,” I said. “Especially if the pulse is faint, especially if you don’t have much experience at it, especially if you were rattled. You were rattled, right?”\u003c/p\u003e\n\u003cp\u003e“Are you saying he isn’t dead?”\u003c/p\u003e\n\u003cp\u003e“There are two possibilities. First, that you actually did kill the Imposter and someone came along and removed the body—but I don’t see any blood or drag marks. Two, that you hurt him, perhaps even knocked him unconscious, and sometime after you left he got up and walked away. Or at least he recovered enough to call for help, called for someone to pick him up, his accomplice probably. That would explain why his car was still here.”\u003c/p\u003e\n\u003cp\u003eThere was a third possibility—that she was lying through her teeth, but I didn’t mention that.\u003c/p\u003e\n\u003cp\u003e“Are you saying I didn’t kill him?” Mrs. Miller said.\u003c/p\u003e\n\u003cp\u003e“You sound disappointed.”\u003c/p\u003e\n\u003cp\u003e“I am, a little.”\u003c/p\u003e\n\u003cp\u003e“Well, cheer up. You committed assault with a deadly weapon with intent to kill. That’s a Class C felony in most states.”\u003c/p\u003e\n\u003cp\u003e“I hit him extremely hard.”\u003c/p\u003e\n\u003cp\u003e“As hard as you hit me last night?”\u003c/p\u003e\n\u003cp\u003e“I didn’t—McKenzie. Certainly not. I had nothing to do with what happened to you. How can you suggest such a thing?”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“What reason would I have for attacking you?”\u003c/p\u003e\n\u003cp\u003e“The same reason you had for attacking the Imposter.”\u003c/p\u003e\n\u003cp\u003e“Rush assaulted my daughter; you protected her.”\u003c/p\u003e\n\u003cp\u003e“You might not have known that.”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie.”\u003c/p\u003e\n\u003cp\u003e“All right.”\u003c/p\u003e\n\u003cp\u003e“Surely you don’t believe—”\u003c/p\u003e\n\u003cp\u003e“Just a thought.”\u003c/p\u003e\n\u003cp\u003e“I have never been so insulted.”\u003c/p\u003e\n\u003cp\u003eIt was hard to keep from laughing at her, but I managed it just the same.\u003c/p\u003e\n\u003cp\u003eMrs. Miller stared down at the spot where the Imposter’s body should have been.\u003c/p\u003e\n\u003cp\u003e“Should we call the police?” she said.\u003c/p\u003e\n\u003cp\u003e“We could do that. They’ll strap you to a polygraph and ask some hard questions, though. Are you prepared to answer them?”\u003c/p\u003e\n\u003cp\u003eShe didn’t say if she was or wasn’t.\u003c/p\u003e\n\u003cp\u003e“Why don’t we just hold off on calling the cops for now,” I said.\u003c/p\u003e\n\u003cp\u003e“Until when?”\u003c/p\u003e\n\u003cp\u003e“Until we know what really happened.”\u003c/p\u003e\n\u003cp\u003e“I told you what really happened.”\u003c/p\u003e\n\u003cp\u003e“I meant until we have confirmation.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-61.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
