{"id":104641,"no":68,"title":"Page 68","content":"\u003cp\u003e“Sounds kind of juvenile,” I said.\u003c/p\u003e\n\u003cp\u003e“I guess, but you need to be sure, don’t you? It’s about peace of mind. Peace of mind is hard to come by for most people.”\u003c/p\u003e\n\u003cp\u003eI told her that was probably true.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTEEN\u003c/p\u003e\n\u003cp\u003eSunday morning, and the window to my antiquated hotel room was open—when was the last time you were able to open a window in a hotel? Through the window I heard three sets of church bells calling to each other from different corners of the city. Through the window I could smell the lingering smoke and ash from the Danne house fire. Or maybe it was just the clothes I had worn last night and tossed on the floor.\u003c/p\u003e\n\u003cp\u003eI lay in bed, my hands tucked beneath my head, and stared at the ceiling. I thought about Tracie Blake. She had been a lonely woman. She asked me to help chase the alone feeling away. I understood the alone feeling; I knew about waking up alone and going to bed alone and all the lonely hours in between with the phone not ringing and the e-mail in-box coming up empty. I believed we all knew it at one time or another. Yet I had turned her down, just as I had turned down Sharren Nuffer. I did it for honorable reasons. I did it for Nina, the woman who had chased the alone feeling away for me. That didn’t make me feel any less guilty about it.\u003c/p\u003e\n\u003cp\u003eI thought about Mike, another solitary soul. He and Tracie found each other. Together they had chased away the alone feeling, if only for one night. But who knows? One night could have become two. Then a week. A month. A year. Maybe it would have been permanent if they had time.\u003c/p\u003e\n\u003cp\u003eI liked Tracie. I liked Mike. In my neighborhood, they both would have been labeled “good guys”—high praise indeed. Now they were both gone, and there wasn’t anything I could do about it. I didn’t even know where to start; not that Big Joe Balk would tolerate my kibitzing. He didn’t know me. This was his ground, not mine. My only thought was to keep after the Imposter and see if one thing might lead to another.\u003c/p\u003e\n\u003cp\u003eChurch, on the other hand, was a different matter.\u003c/p\u003e\n\u003cp\u003eI listened to the bells. When they finally fell silent, I spoke aloud—“Brothers and sisters, the subject of today’s homily is”—and stopped. The Old Testament God spoke of an eye for an eye and a tooth for a tooth—proportional justice. The New Testament God preached forgiveness—“Turn the other cheek,” He said.\u003c/p\u003e\n\u003cp\u003eSo which is it? Justice or forgiveness?\u003c/p\u003e\n\u003cp\u003eHe beareth not the sword in vain: for he is the minister of God, a revenger to execute wrath upon him that doeth evil—so wrote Paul in Romans 13 of the emperor’s policemen.\u003c/p\u003e\n\u003cp\u003eEt prout vultis ut faciant vobis homines et vos facite illis similiter, wrote Luke in 6:31—“And just as you wish others to do for you, do also the same for them.”\u003c/p\u003e\n\u003cp\u003eI decided to let Shakespeare settle the matter: If you prick us, do we not bleed? If you tickle us, do we not laugh? If you poison us, do we not die? And if you wrong us, shall we not revenge?\u003c/p\u003e\n\u003cp\u003eI don’t even know why I bothered with the internal debate. I had made up my mind when I gazed into Cathy’s eyes, and I confirmed my decision when I found Paulie sitting on the car hood, having a swell time at the expense of the Dannes.\u003c/p\u003e\n\u003cp\u003e“Fire and brimstone,” I said aloud. “Today’s homily—fire and fucking brimstone.”\u003c/p\u003e\n\u003cp\u003eSharren wouldn’t approve. Most of the people I knew and cared about wouldn’t approve—Cathy Danne might even be among them once she had time to think about it. I didn’t care.\u003c/p\u003e\n\u003cp\u003eForty minutes later, I was in the lobby of the Pioneer Hotel. I did not know the young woman behind the reservation desk, but she knew me.\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie,” she said, “Sharren Nuffer asked me to give this to you.”\u003c/p\u003e\n\u003cp\u003eI took a folded sheet of paper from the woman’s hand. It contained a list of the Libbie City Council members and where I might find them.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I said.\u003c/p\u003e\n\u003cp\u003eI headed for the door. The woman called to me.\u003c/p\u003e\n\u003cp\u003e“If you’re hungry,” she said, “our brunch lasts until eleven.”\u003c/p\u003e\n\u003cp\u003eI stopped and looked through the arched doorway into the dining room. It was packed. I recognized some of the patrons from last night’s fire. I had no doubt that the fire—and the murders of Tracie Blake and Mike Randisi—were the main topics of conversation of the diners. Except for Perry and Dawn Neske, who apparently had other things on their minds.\u003c/p\u003e\n\u003cp\u003eI saw them sitting across from each other in a booth against the far wall, laughing over plates heaped with eggs, hash browns, flapjacks, ham, bacon, sausage, assorted fruits, and muffins. He reached across the white linen tablecloth and took her hand. She leaned toward him, said something, and smiled. He smiled back. A moment later, she pulled her hand free and cupped it beneath a cube of cantaloupe that she forked into Perry’s mouth. He responded with a strawberry that Dawn ate from his fingertips. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-68.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
