{"id":104646,"no":73,"title":"Page 73","content":"\u003cp\u003e“Seems they couldn’t start the Imposter’s rental.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Someone opened the fuse panel under the hood and removed the fuses that controlled both the fuel pump and the ignition.”\u003c/p\u003e\n\u003cp\u003e“I’ll be damned.”\u003c/p\u003e\n\u003cp\u003e“You were wrong. The car didn’t break down. It looks like someone purposely stranded Rush at the lake.”\u003c/p\u003e\n\u003cp\u003eI poured a quart of motor oil into each of the plastic jugs and then filled them to the brim with unleaded gasoline. After topping off the Audi’s tank, I went inside Miller Big Stop. The young man behind the cash register seemed surprised when I paid cash. I don’t know why. I had paid cash for everything I bought that day.\u003c/p\u003e\n\u003cp\u003e“Hear about the excitement we had yesterday?” he asked.\u003c/p\u003e\n\u003cp\u003e“What excitement?”\u003c/p\u003e\n\u003cp\u003eHe waved in the general direction of Mike Randisi’s place. “Man and woman got themselves shot just over to the farm over there.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?”\u003c/p\u003e\n\u003cp\u003e“Naked as jaybirds, they were. I heard they were in bed doin’ it when someone came in and shot them both.”\u003c/p\u003e\n\u003cp\u003e“Does the sheriff have any suspects?”\u003c/p\u003e\n\u003cp\u003e“Not that I heard, but if it was me, I’d be lookin’ to see who they were sleepin’ with besides each other, that’s what I would do.”\u003c/p\u003e\n\u003cp\u003eI left as soon as he counted out my change. I might have told him to keep it—I’ve done it before—only I didn’t want to give him anything to remember me by.\u003c/p\u003e\n\u003cp\u003eIt was so quiet and the call so unexpected that I jumped when I heard the opening notes to “Summertime” again. I read the name on the display.\u003c/p\u003e\n\u003cp\u003e“Hey, sweetie,” I said.\u003c/p\u003e\n\u003cp\u003e“Hi, McKenzie,” Victoria Dunston replied.\u003c/p\u003e\n\u003cp\u003e“How was the soccer tournament?”\u003c/p\u003e\n\u003cp\u003e“We got our butts kicked.”\u003c/p\u003e\n\u003cp\u003e“So basically your athletic career is following the same path as your father’s and mine.”\u003c/p\u003e\n\u003cp\u003e“So far. McKenzie, I did what you asked. I looked for high school teams called the Raiders in Chicago and for about a hundred miles around Chicago. There are a bunch of them, including teams called Red Raiders and the Purple Raiders—Wells Academy, Robeson, Glenbard South, Ashton-Franklin, Grove, Bolingbrook. It’s a long list. Do you want me to recite the whole thing?”\u003c/p\u003e\n\u003cp\u003e“No. I’ll have to get them later. I’m a little busy right now.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said. “There’s something else, though. I checked. There’s a Taste of Chicago that’s just like Taste of Minnesota except much, much bigger. Guess where they hold it?”\u003c/p\u003e\n\u003cp\u003e“Grant Park.”\u003c/p\u003e\n\u003cp\u003e“Yep. Is that helpful?”\u003c/p\u003e\n\u003cp\u003e“It is, but—can I get back to you later?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eI hung up and resumed staring out the windshield of my car.\u003c/p\u003e\n\u003cp\u003eChurch lived in a small clapboard house on the wrong side of the tracks that divided Libbie in half, not far from the water treatment plant. The house needed work, and so did the garage and lawn. On the other hand, the Ford F150 pickup parked in the driveway was gleaming, its black body newly washed and waxed. Even the tires sparkled in the hard sunlight. I watched the house from a safe distance through a pair of binoculars that I kept along with my guns under the false bottom of the Audi’s trunk. I had removed and loaded a 9 mm Beretta as well. It was sitting on the seat next to me. Even so, my inner voice pleaded with me—Let’s keep our crimes to a minimum, shall we?\u003c/p\u003e\n\u003cp\u003eI agreed to that request. Yet I refused to listen when my inner voice told me that what I was about to do was wrong.\u003c/p\u003e\n\u003cp\u003eThis isn’t justice, it’s revenge.\u003c/p\u003e\n\u003cp\u003eSo?\u003c/p\u003e\n\u003cp\u003eIt’s illegal. It’s against the law.\u003c/p\u003e\n\u003cp\u003eThe law doesn’t work out here.\u003c/p\u003e\n\u003cp\u003eYou’re not that person.\u003c/p\u003e\n\u003cp\u003eYeah, I am.\u003c/p\u003e\n\u003cp\u003eI set the binoculars aside and gripped the steering wheel. My hands were icy cold, yet sweating at the same time—go figure. According to my expensive watch, which, among other things, had a timer, Paulie arrived at exactly 8:13 p.m. He parked his battered Dodge Stratus on the street and walked across the spotty lawn to the front door of the house. He walked in without knocking. At 8:42 he and Church emerged from the house. Church carefully cradled a small brown paper bag in one arm as if he were afraid of dropping it as he walked to the pickup. In his free hand he carried a twelve-gauge double-barrel shotgun. Paulie moved toward the Stratus. Church called to him. Paulie paused and pointed at the bag. Church laughed at him. Finally they both boarded Church’s F150; Church set the bag on the seat and placed the gun on a rack attached to his rear window. They drove away without coming anywhere near me.\u003c/p\u003e\n\u003cp\u003eI sat and listened to the quietness, straining to hear any sound resembling a truck engine or human voices. I heard only the sound of the never-ceasing wind. I waited fifteen minutes, partly to make sure Church didn’t return for something he forgot and partly to give the sun time to set—this was the kind of thing best done in darkness, I told myself. While I waited, I patted the double-A batteries in my pocket. For safety’s sake, I had removed them from the kitchen timers. I would return them when I was ready to set the bombs.\u003c/p\u003e\n\u003cp\u003eCHAPTER FOURTEEN \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-73.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
