{"id":104648,"no":75,"title":"Page 75","content":"\u003cp\u003e“Hey, Paulie,” I said. “Sit your ass back down.”\u003c/p\u003e\n\u003cp\u003eHe stopped. Confusion clouded his eyes. He looked back at Church for clarity. Church jerked his head. Paulie continued toward the door.\u003c/p\u003e\n\u003cp\u003e“I said sit down.” I slipped out from between the stools, making it clear that I was prepared to intercept him. Paulie stopped again. Again he looked to Church for guidance.\u003c/p\u003e\n\u003cp\u003e“You got a problem, McKenzie?” Church said.\u003c/p\u003e\n\u003cp\u003e“I’m going to beat you to death, you gutless piece of crap, and I don’t want shit-for-brains here sneaking up on me from behind while I do it.”\u003c/p\u003e\n\u003cp\u003eThe bar was as quiet as a movie theater during a Kate Winslet film. Patrons watched us intently, and I thought this was probably as much entertainment as some of them had had in years.\u003c/p\u003e\n\u003cp\u003eChurch tossed his cue stick down on the green felt. He circled the pool table and came toward me. I noticed he wasn’t moving quickly, and his eyes—they flicked back and forth, watching the audience watching him. Clearly he didn’t want to fight, yet he was afraid of losing face if he didn’t. I waited for him. The limp was gone, and he flexed the fingers of his broken hand. When he reached a spot on the warped floor that he thought was close enough, he stopped and lifted his hand, giving everyone in the tavern a good look at the white cast.\u003c/p\u003e\n\u003cp\u003e“It’s going to be an unfair fight, but I’m not afraid of you,” he said. “That’s your speed, though, ain’t it? Sucker-punch a guy when he ain’t looking; fight a guy who’s got but one hand.”\u003c/p\u003e\n\u003cp\u003eI felt my muscles tighten, felt my eyes grow wide at the insult. This was the part of the program where I was supposed to call him a liar, call him a hypocrite, remind him of all the cowardly crimes he had committed against people like the Dannes, and I would have. There was a clock on the wall behind Church that was made to resemble the logo of a St. Louis beer company. If it was accurate, I needed at least another ninety seconds. Only Wayne gave me the time I needed when he slammed his shot glass down on the bar top. He hopped off his stool, reached around the end of the bar, and came up with a small baseball bat with tattered and dirty white tape wrapped around the handle.\u003c/p\u003e\n\u003cp\u003e“You fucker,” he said.\u003c/p\u003e\n\u003cp\u003eI didn’t know if he meant Church or me until he turned toward the big man and raised the bat. I came up behind him as quickly as I could and grabbed the barrel of the bat and pulled it down.\u003c/p\u003e\n\u003cp\u003e“No, no, no,” I chanted.\u003c/p\u003e\n\u003cp\u003e“Let it go,” Wayne said.\u003c/p\u003e\n\u003cp\u003e“It’s my party,” I told him.\u003c/p\u003e\n\u003cp\u003eWayne yanked the bat out of my hand and waved it at me.\u003c/p\u003e\n\u003cp\u003e“Church bullied Tracie,” he said. “He insulted her cuz she wouldn’t have anything to do with him, and I let him. I let him.”\u003c/p\u003e\n\u003cp\u003eWayne glared at Church.\u003c/p\u003e\n\u003cp\u003eChurch waved his cast like a flag and took two steps backward.\u003c/p\u003e\n\u003cp\u003ePaulie skipped to the front door.\u003c/p\u003e\n\u003cp\u003eThe bar patrons took a collective deep breath.\u003c/p\u003e\n\u003cp\u003eThe bomb exploded.\u003c/p\u003e\n\u003cp\u003eThere wasn’t a loud bang. It was more of a whooshing sound as the kitchen timer set off the makeshift detonator, which in turn ignited the gas and oil in the plastic jug, splattering the cab of Church’s pickup truck with both.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” someone shouted.\u003c/p\u003e\n\u003cp\u003eI glanced at my watch. The bomb had gone off a good thirty seconds before I thought it would. I held the watch to my ear. You need a new battery, my inner voice said.\u003c/p\u003e\n\u003cp\u003ePeople rushed to the windows of the bar.\u003c/p\u003e\n\u003cp\u003ePaulie stood in the doorway, a look of terror on his face.\u003c/p\u003e\n\u003cp\u003e“You said it was safe,” he said. “You said it wouldn’t go off.”\u003c/p\u003e\n\u003cp\u003e“Shut up,” Church told him. He ran toward the door.\u003c/p\u003e\n\u003cp\u003e“You said it wouldn’t blow up until we lit the fuse.”\u003c/p\u003e\n\u003cp\u003e“Shut up.” Church shoved Paulie hard against the door frame. “Shut the fuck up.” He shoved him again. Paulie fell out of the bar. Church followed. He kicked Paulie while he was down. “Shut up,” he repeated.\u003c/p\u003e\n\u003cp\u003eA half-dozen patrons followed Church and Paulie out of the tavern. A few of them rushed to move their vehicles away from the F150. The two nearest the pickup managed to start and drive their cars off just as the Molotov cocktail that Church had prepared and left in the brown bag on his seat exploded. The bang it made wasn’t quite as thunderous as it is in the movies, yet it was loud enough to make everyone duck and powerful enough to shatter the windshield.\u003c/p\u003e\n\u003cp\u003eA siren screamed from down the county road; red and blue lights flicked in the darkness. A moment later, a City of Libbie police cruiser turned into the parking lot and came to a screeching halt beneath the light pole. The light at the top of the pole was a pale and sickly thing compared to the brilliance of the fire. The car was still rocking when Chief Gustafson jumped out.\u003c/p\u003e\n\u003cp\u003e“Do something,” Church said. “Save my truck.”\u003c/p\u003e\n\u003cp\u003eThe chief didn’t even try. Instead, he forced his way to the head of the crowd, turned, and spread his arms wide as if he were herding small, dumb animals. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-75.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
