{"id":104649,"no":76,"title":"Page 76","content":"\u003cp\u003e“Everyone get back,” he said. “C’mon now, step back, everyone step back.”\u003c/p\u003e\n\u003cp\u003eSomehow he managed to force the crowd to retreat about ten paces. That was as far as we would go. The fire compelled our attention despite the danger.\u003c/p\u003e\n\u003cp\u003eFumes from burning plastic, rubber, metal, and the various synthetic materials that went into making the vehicle wafted over the parking lot. Jeff was standing next to me. He took a deep breath, probably not a wise thing to do.\u003c/p\u003e\n\u003cp\u003e“Don’t you just love that new car smell,” he said.\u003c/p\u003e\n\u003cp\u003eIt took hardly any time for the flames to reach the gas tank. The truck didn’t explode—that only happens in the movies. Instead, it made another loud whoosh as the gas simply ignited. That was followed by several loud popping sounds. I thought the shotgun shells going off might have caused it, but I was mistaken. It was the tires melting.\u003c/p\u003e\n\u003cp\u003eChurch was screaming. He made several efforts to get closer to the vehicle—I had no idea what he was trying to accomplish. Each time, the heat pushed him back. Most of what he had to say was unintelligible. Only the words “Call the fire department” were loud and clear.\u003c/p\u003e\n\u003cp\u003e“I did,” the chief said. “They can’t come. They’re already on a call.”\u003c/p\u003e\n\u003cp\u003e“What call?”\u003c/p\u003e\n\u003cp\u003e“It’s your house,” Gustafson said. “They said it was completely engulfed in flames.”\u003c/p\u003e\n\u003cp\u003e“My house?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” the chief said.\u003c/p\u003e\n\u003cp\u003e“My house!”\u003c/p\u003e\n\u003cp\u003eChurch continued shouting, mostly obscenities, until he doubled over and began to gag as if he were about to be sick. I don’t know if the fumes got to him or it was something else. For a moment, I felt sorry for him. Then I thought about Rick and Cathy Danne, and all of his other victims, and the feeling went away.\u003c/p\u003e\n\u003cp\u003eHe saw me out of the corner of his eye.\u003c/p\u003e\n\u003cp\u003e“You did this,” he said. “You did this.”\u003c/p\u003e\n\u003cp\u003eChurch rushed at me. Wayne stepped in to block his path. Church pushed him away. Wayne swung his baseball bat and hit him squarely on the point of the hip. Church went down with an agonizing scream. Chief Gustafson crossed the gravel lot and yanked the bat from Wayne’s hands.\u003c/p\u003e\n\u003cp\u003e“Are you crazy?” he said.\u003c/p\u003e\n\u003cp\u003e“He insulted Tracie,” Wayne said.\u003c/p\u003e\n\u003cp\u003e“You did this, you,” Church said.\u003c/p\u003e\n\u003cp\u003e“Me?” I said. “What did I do?”\u003c/p\u003e\n\u003cp\u003eChurch tried to rise from the ground. The chief bent to give him aid. “He did this,” Church told him.\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” I said. “You’re the one who had a gasoline bomb in his car, not me. Ain’t that right, Paulie?”\u003c/p\u003e\n\u003cp\u003ePaulie was standing near the door of the tavern, both arms clutching his stomach where Church had kicked him. He looked as confused as ever.\u003c/p\u003e\n\u003cp\u003e“What about it, Paulie?” I said. “Everyone heard what you said.”\u003c/p\u003e\n\u003cp\u003e“What did you say?” the chief said.\u003c/p\u003e\n\u003cp\u003e“Shut up,” Church said. “Paulie.”\u003c/p\u003e\n\u003cp\u003e“I didn’t say anything,” Paulie said.\u003c/p\u003e\n\u003cp\u003eJeff stepped next to him. “Yes, you did, when the fire started. The fire started, and you were talking to Church.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“What did he say?” the chief asked.\u003c/p\u003e\n\u003cp\u003e“He was looking at Church,” Jeff answered. “When the fire started in the truck, he looked at Church and he said, ‘You promised that it wouldn’t blow up until we lit the fuse.’”\u003c/p\u003e\n\u003cp\u003e“That’s right,” one of the bar patrons said.\u003c/p\u003e\n\u003cp\u003e“I heard him say it,” said another.\u003c/p\u003e\n\u003cp\u003e“Shut up,” Church said. “You got rights.”\u003c/p\u003e\n\u003cp\u003eThe chief put a hand on Church’s chest and eased him backward. After he made room, he stepped between Church and Paulie. Paulie shook his head.\u003c/p\u003e\n\u003cp\u003e“I didn’t do anything,” he said.\u003c/p\u003e\n\u003cp\u003e“Talk to me, Paulie,” said the chief.\u003c/p\u003e\n\u003cp\u003e“I didn’t do anything.”\u003c/p\u003e\n\u003cp\u003e“You’re a liar,” Wayne said. “We all heard you.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“It was McKenzie,” Church said. “He did it. He set the fire. Oh, you bastard.”\u003c/p\u003e\n\u003cp\u003e“That’s crazy,” I said. “Why would I do that?”\u003c/p\u003e\n\u003cp\u003e“To get even.”\u003c/p\u003e\n\u003cp\u003e“For what? What have you ever done to me?”\u003c/p\u003e\n\u003cp\u003eChief Gustafson kept his hand on Church’s chest, even while he stared at Paulie.\u003c/p\u003e\n\u003cp\u003e“I’m going to give you one more chance to tell me the truth,” he said.\u003c/p\u003e\n\u003cp\u003e“I didn’t do anything,” Paulie said.\u003c/p\u003e\n\u003cp\u003e“All right, you’re under arrest.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003ePaulie tried to run. Wayne and another guy grabbed him by the arms. The chief tucked the bat under his arm and made a slow and deliberate production out of producing his handcuffs. Paulie stared at them as if they were dental instruments.\u003c/p\u003e\n\u003cp\u003e“No,” he said. He squirmed, but the two men held fast.\u003c/p\u003e\n\u003cp\u003e“You have the right to remain silent—”\u003c/p\u003e\n\u003cp\u003e“But I didn’t do anything.”\u003c/p\u003e\n\u003cp\u003e“Anything you say can and will be used against you in a court of law—”\u003c/p\u003e\n\u003cp\u003e“It wasn’t me.”\u003c/p\u003e\n\u003cp\u003e“You have the right to have an attorney present—”\u003c/p\u003e\n\u003cp\u003e“It was Church,” Paulie said. He would have pointed at him, except Wayne and the other bar patron had his arms pinned. “He had a Molotov cocktail. He was going to smash it on McKenzie’s car like he did against Danne’s house last night.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-76.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
