{"id":104658,"no":85,"title":"Page 85","content":"\u003cp\u003e“I’m glad I met you.”\u003c/p\u003e\n\u003cp\u003eI laughed at the remark. Just about everything she and her family said Wednesday and Thursday morning while I was recuperating from my two days on the plains had cracked me up.\u003c/p\u003e\n\u003cp\u003e“Believe me,” I said, “the pleasure was all mine.”\u003c/p\u003e\n\u003cp\u003eI smiled when she went back to the pickup, smiled some more when she drove off, and smiled again when I turned and faced the front door of the hotel. No one in Libbie knew what had happened to me except for the people who arranged it. While I was convalescing at Angela’s ranch, I made calls to Nina and the Dunstons and Harry. They told me that both Big Joe Balk and Chief Gustafson had made inquires when it became clear that I had disappeared. After assuring them that once again rumors of my demise were greatly exaggerated, I made them all promise not to reveal that I was alive and well. Surprisingly, Harry seemed most annoyed by what was going on; even more so than Nina, who pretended—I knew that she was pretending—to take it all in stride. I reminded Harry that the FBI field office in Minneapolis covered all the counties in South Dakota, and then I explained why he should care. That brightened his disposition considerably. I glanced at my watch. I expected to see him in a few hours.\u003c/p\u003e\n\u003cp\u003e“This is going to be fun,” I said aloud.\u003c/p\u003e\n\u003cp\u003eSharren Nuffer was in her usual spot behind the registration desk, her glasses balanced on the tip of her nose. When she saw me, her eyes grew wide and her entire face became one enormous smile. I was happy to see it. It confirmed my hypothesis that she was guiltless in my abduction. She threw her cheaters down and circled the counter.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” she said way too loudly. I silenced her with an index finger quickly pressed to my lips. She hesitated for a beat and then continued toward me until her arms were wrapped around my shoulders and her cheek was pressed hard against mine.\u003c/p\u003e\n\u003cp\u003e“I thought you were gone like Rush,” she said. “I thought you were gone.”\u003c/p\u003e\n\u003cp\u003e“Not me,” I said.\u003c/p\u003e\n\u003cp\u003e“Oh, you’re hurt. What happened to your eye?”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“But I do. I do worry. After you disappeared—I found your sports jacket draped across a chair, and you weren’t in your room, so I called the police, the sheriff—”\u003c/p\u003e\n\u003cp\u003e“Where is my sports jacket?” I said. I didn’t need the coat; I needed the cell phone in the pocket. While at Angela’s ranch, I also made a call to Greg Schroeder and told him what I wanted and why. Only to make it work, I needed my cell.\u003c/p\u003e\n\u003cp\u003e“They took your coat,” Sharren said. “They searched your room; they confiscated your belongings; they impounded your car. The sheriff, they say he found guns hidden in your trunk. A lot of guns. They thought—they thought the worst. McKenzie, what happened?”\u003c/p\u003e\n\u003cp\u003e“Yeah, about that. Where’s Evan? Is he working?”\u003c/p\u003e\n\u003cp\u003e“Yes, Evan, he’s tending bar. Why, McKenzie? Why?”\u003c/p\u003e\n\u003cp\u003eI pressed my finger against my lips again.\u003c/p\u003e\n\u003cp\u003e“Stay here,” I said.\u003c/p\u003e\n\u003cp\u003e“McKenzie?”\u003c/p\u003e\n\u003cp\u003eI marched through the lobby, under the arch leading to the dining room, and around dining room tables and chairs toward the bar in back. Sharren followed despite my order, but I knew she would. My legs were heavy and stiff, reminding me that I seldom seemed to be in as good a shape as I thought I was. My ribs ached, too, but then they hadn’t stopped hurting, not even for a moment, since I found myself on the Great Plains. I tried to ignore the pain.\u003c/p\u003e\n\u003cp\u003eEvan was behind the stick, brushing his fingers through his blond hair with his fingers. He was busy speaking to a girl who looked like she graduated from high school yesterday and didn’t see me until I stepped between two stools and rested my elbows on top of the bar.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” he said. He pronounced my name as if it were a particularly deadly virus and stepped away from the bar as if I were a carrier; bottles on the shelf behind him rattled and fell when he backed into them.\u003c/p\u003e\n\u003cp\u003eI glanced at the girl and the cocktail in front of her. In South Dakota, an eighteen-year-old can drink alcohol if it’s done in the immediate presence of a parent, guardian, or spouse over twenty-one years of age. I threw a thumb at Evan.\u003c/p\u003e\n\u003cp\u003e“Is this your old man?” I said.\u003c/p\u003e\n\u003cp\u003eThe girl said, “What?”\u003c/p\u003e\n\u003cp\u003e“You should leave. Leave right now.”\u003c/p\u003e\n\u003cp\u003eThe girl glanced first at Evan and then at Sharren. They both looked frightened, and suddenly the girl became frightened, too. She slid off her stool and headed for the exit as fast as she could without actually running. I gestured with two fingers at Evan as if I wanted to place a drink order.\u003c/p\u003e\n\u003cp\u003e“C’mere,” I said. I deliberately kept my voice light and nonmenacing.\u003c/p\u003e\n\u003cp\u003e“McKenzie—”\u003c/p\u003e\n\u003cp\u003e“It’s okay.”\u003c/p\u003e\n\u003cp\u003eEvan very slowly, very cautiously inched to where I stood at the bar.\u003c/p\u003e\n\u003cp\u003e“Closer,” I said. I was speaking in a whisper.\u003c/p\u003e\n\u003cp\u003eEvan turned his head as if he were straining to hear.\u003c/p\u003e\n\u003cp\u003e“McKenzie, it wasn’t me,” he said.\u003c/p\u003e\n\u003cp\u003e“What wasn’t you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-85.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
