{"id":104660,"no":87,"title":"Page 87","content":"\u003cp\u003e“In the meantime, I’ll give you something for the pain.”\u003c/p\u003e\n\u003cp\u003e“I don’t need any drugs,” I said. To prove it, I winced and groaned as I pulled on my rust-colored polo shirt.\u003c/p\u003e\n\u003cp\u003e“That’s very heroic of you, McKenzie, except we’re talking ibuprofen, not narcotics.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. Tell me something? Concussions, broken ribs, black eyes—does this sort of thing happen to you often?”\u003c/p\u003e\n\u003cp\u003e“I’m just looking for an excuse to spend time with you.”\u003c/p\u003e\n\u003cp\u003eNancy smiled at that.\u003c/p\u003e\n\u003cp\u003e“Since I have you here, may I ask a question?” I said.\u003c/p\u003e\n\u003cp\u003e“Certainly.”\u003c/p\u003e\n\u003cp\u003e“Did you prescribe sertraline for Mike Randisi’s agoraphobia?”\u003c/p\u003e\n\u003cp\u003e“Yes, with the approval of a doctor, why?”\u003c/p\u003e\n\u003cp\u003e“Mike told me that he couldn’t force himself to come into town to get his prescription filled, and since Spiess Drug Store can no longer fill prescriptions, can no longer deliver drugs to customers like it used to, I was wondering—where did Mike get his meds?”\u003c/p\u003e\n\u003cp\u003e“He got them from us.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003eNancy stepped backward. Suspicion clouded her face.\u003c/p\u003e\n\u003cp\u003e“You sound like you’re building up to something, McKenzie,” she said.\u003c/p\u003e\n\u003cp\u003e“Your husband told Sheriff Balk that he was with you when Mike and Tracie Blake were killed. At first, I thought he was using you to give himself an alibi. Now I know that he already had an alibi. He was processing a DUI at the time with plenty of witnesses to back him up. That means he wasn’t protecting himself. He was lying to protect you.”\u003c/p\u003e\n\u003cp\u003e“He did that?” Nancy said.\u003c/p\u003e\n\u003cp\u003e“He thought you killed Mike and Tracie. Why would he think that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You delivered Mike’s meds, didn’t you? You drove out to his place and gave them to him.”\u003c/p\u003e\n\u003cp\u003e“Yes, I did. It’s called being neighborly. You should try it sometime.”\u003c/p\u003e\n\u003cp\u003e“Were you having an affair with him?”\u003c/p\u003e\n\u003cp\u003e“McKenzie—”\u003c/p\u003e\n\u003cp\u003e“He seemed like an awfully nice guy. Didn’t take him long to charm Tracie, that’s for sure.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t like that. We were friends, we talked, but no, we weren’t having an affair.”\u003c/p\u003e\n\u003cp\u003e“Friday night, the night he and Tracie were killed, you didn’t go home after your shift, did you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Did you go to Mike’s? Did you find Tracie there? Tracie stole your husband, and now she was with your friend. The gun was sitting on the kitchen counter. Did you pick it up?”\u003c/p\u003e\n\u003cp\u003e“No, no, McKenzie. You’re wrong.”\u003c/p\u003e\n\u003cp\u003e“That’s not what your husband thinks, or else why would he risk his job and more to give you an alibi?”\u003c/p\u003e\n\u003cp\u003e“He believes Mike and I were sleeping together, but we weren’t.”\u003c/p\u003e\n\u003cp\u003e“Then why does he believe it?”\u003c/p\u003e\n\u003cp\u003e“I wanted him to.”\u003c/p\u003e\n\u003cp\u003e“You wanted him to believe you and Mike were having an affair?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Even though you weren’t?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eA voice behind me answered.\u003c/p\u003e\n\u003cp\u003e“It was easier than telling him the truth.”\u003c/p\u003e\n\u003cp\u003eI twisted on the examination table. Sharren Nuffer stood in the entrance to the suite. Nancy spun to face her, too. She hesitated just for a moment and moved to Sharren’s side. They hugged like two people who had just escaped a horrific traffic accident. When they finished, they both turned to face me, holding hands, standing straight and still like gunfighters, legs apart, weight evenly balanced, a ferocious expression of defiance on their faces.\u003c/p\u003e\n\u003cp\u003e“Oh,” I said.\u003c/p\u003e\n\u003cp\u003e“You look disappointed, McKenzie,” Sharren said.\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003eNancy said, “Who would have thought you’d be another heterosexual male intimidated by—”\u003c/p\u003e\n\u003cp\u003e“Oh, don’t give me that crap,” I said. “I don’t give a damn about your sexual orientation. You two lied to me. Both of you. I’m starting to feel like Diogenes wandering around with my lantern held high in search of an honest man and finding only—God, I can’t believe you lied to me.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Nancy said.\u003c/p\u003e\n\u003cp\u003e“All that nonsense about your husband and Tracie Blake. The noble, long-suffering wife—you played the part well, you know? Tell me, who started cheating first? You or him?”\u003c/p\u003e\n\u003cp\u003eSharren said, “McKenzie—”\u003c/p\u003e\n\u003cp\u003eI cut her off.\u003c/p\u003e\n\u003cp\u003e“And you. What was it you told me? ‘I was married three times and not once did I cheat on my husband.’ What do you call this?”\u003c/p\u003e\n\u003cp\u003e“Eric Gustafson is not my husband,” Sharren said.\u003c/p\u003e\n\u003cp\u003e“Yeah, that makes all the difference in the world.”\u003c/p\u003e\n\u003cp\u003e“Why are you angry at us?” Nancy said.\u003c/p\u003e\n\u003cp\u003e“Be honest,” said Sharren. “You weren’t angry at Eric or Tracie or Dawn Neske or Ed Bizek. Why are you mad at us if it isn’t because we’re gay?”\u003c/p\u003e\n\u003cp\u003e“Because I like you,” I said.\u003c/p\u003e\n\u003cp\u003e“You like us?” Nancy said.\u003c/p\u003e\n\u003cp\u003e“Of course I do.”\u003c/p\u003e\n\u003cp\u003e“Then why did you accuse me of murder?”\u003c/p\u003e\n\u003cp\u003e“I didn’t accuse you of murder.”\u003c/p\u003e\n\u003cp\u003e“You said I shot Mike and Tracie.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-87.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
