{"id":104665,"no":93,"title":"Page 93","content":"\u003cp\u003e“Murder,” I said.\u003c/p\u003e\n\u003cp\u003e“You can’t prove anything,” Kampa shouted.\u003c/p\u003e\n\u003cp\u003e“You were at the Miller home when Sara called Nicholas Hendel and arranged to meet him at Lake Mataya. I believe you overheard the conversation and followed her out there. I believe you stole the fuses from Hendel’s car, stranding him. Hendel called his accomplices for a ride, but neither of them was home, so he decided to hoof it back into town. I believe you ran him down. I believe you killed him with your car so if you got caught in the act, you could always claim it was an accident.”\u003c/p\u003e\n\u003cp\u003e“Believing isn’t proving,” Kampa said.\u003c/p\u003e\n\u003cp\u003e“No, it isn’t,” the chief added.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, Chief,” Harry said. “I’ve seen this before. McKenzie is a music lover. He likes to build to a crescendo.”\u003c/p\u003e\n\u003cp\u003e“The front of your car was smashed in,” I told Kampa. “I saw it at Schooley’s Auto Repair. You said you hit a deer out on White Buffalo Road, the road leading to Lake Mataya. There’s an impact crater and blood on the windshield. A simple test will prove that it’s human blood. We don’t have Hendel’s body, but we do have the next best thing. His sister. What do you want to bet that if we tested her DNA and the DNA taken from the blood sample, we’d come up with a familial match? ’Course, we still have Hendel’s hairbrush. It’ll take longer to get his DNA off that, but the result will be the same.”\u003c/p\u003e\n\u003cp\u003e“Ta-da,” Harry said.\u003c/p\u003e\n\u003cp\u003eKampa didn’t speak.\u003c/p\u003e\n\u003cp\u003e“Besides, your vehicle was undrivable,” I said. “You needed a tow. So you couldn’t have taken the body far. If the chief examines the ground near where Schooley hooked up your car, I bet he finds where you buried Hendel and who knows what other evidence.”\u003c/p\u003e\n\u003cp\u003eKampa didn’t have anything to say to that, either.\u003c/p\u003e\n\u003cp\u003e“As for the money you stole…” I waved at all the suits crowding into the bank and bustling about with laptops and file boxes. “People think computers can do anything. They can’t. I bet the FDIC finds the money, and I bet it won’t be in the Cayman Islands. I’m making a lot of bets, I know. I bet I win them all.”\u003c/p\u003e\n\u003cp\u003eHarry patted Kampa on the shoulder. “Don’t worry, pal,” he said. “If you beat the murder rap, we’ll have a lot of federal charges waiting for you.”\u003c/p\u003e\n\u003cp\u003e“Jon,” the chief said, “how could you have done all this? I would have said you were the most honest man in town.”\u003c/p\u003e\n\u003cp\u003e“Maybe he was,” Harry said. “Until his bank failed.”\u003c/p\u003e\n\u003cp\u003e“Show me a completely honest man,” I said, “and I’ll show you someone who has never truly faced temptation.”\u003c/p\u003e\n\u003cp\u003e“That’s so profound,” Harry said.\u003c/p\u003e\n\u003cp\u003e“You like it?”\u003c/p\u003e\n\u003cp\u003e“McKenzie, you are so full of—”\u003c/p\u003e\n\u003cp\u003eBefore Harry could complete the insult, a commotion near the front door caused all of us to turn. Dewey Miller was shouting.\u003c/p\u003e\n\u003cp\u003e“What is the meaning of this?” he said. “Who’s in charge here?”\u003c/p\u003e\n\u003cp\u003e“Who are you?” Hasselberg said.\u003c/p\u003e\n\u003cp\u003e“I’m the mayor of this town.”\u003c/p\u003e\n\u003cp\u003eHarry pivoted at the words and glared at me.\u003c/p\u003e\n\u003cp\u003e“Not yet,” I said.\u003c/p\u003e\n\u003cp\u003eHasselberg tried to rest his arm on Miller’s shoulder, but Miller shrugged it off.\u003c/p\u003e\n\u003cp\u003e“I’m with the FDIC,” Hasselberg explained. “We have seized this bank. The deposits are safe; you might want to tell your citizens that. We have arranged the sale of seventy-five percent of First Integrity’s assets to a bank in North Dakota. We’ll try to collect as much of the remaining outstanding loans as possible ourselves.”\u003c/p\u003e\n\u003cp\u003eKampa moaned loudly at that and slumped down in the chief’s arms; the chief had to make an effort to keep him upright. “My family,” he said. I don’t know if he was in anguish over his wife and children, if he had any, or the generations of Kampas that had built and maintained the bank these many decades.\u003c/p\u003e\n\u003cp\u003e“We’re going to be out of here as fast as we can,” Hasselberg said. “All of this will be just a blip in your history.”\u003c/p\u003e\n\u003cp\u003e“I have questions,” Miller said. I wondered if they were about the town or his holdings.\u003c/p\u003e\n\u003cp\u003e“Please ask them,” Hasselberg said.\u003c/p\u003e\n\u003cp\u003eWhile they spoke, Sheriff Balk arrived.\u003c/p\u003e\n\u003cp\u003e“What’s going on here?” he asked.\u003c/p\u003e\n\u003cp\u003e“Ahh, Sheriff,” Hasselberg said. He extradited himself from his conversation with Miller. “We would like to hire some of your deputies to assist with crowd control. Of course, we’ll pay overtime.”\u003c/p\u003e\n\u003cp\u003eWhile they spoke, Miller surveyed the chaotic scene in the bank. Eventually his eyes found me. I gave him a Victoria Dunston microwave. He didn’t wave back. He didn’t react at all, not even to display his disappointment. He was totally without guilt, I decided. Without conscience, shame, remorse, regret, empathy, sympathy—there was no compassion or tenderness in his heart.\u003c/p\u003e\n\u003cp\u003e“What about it, McKenzie?” Harry said.\u003c/p\u003e\n\u003cp\u003e“Later,” I said. “I have things to do first.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-93.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
