{"id":104666,"no":94,"title":"Page 94","content":"\u003cp\u003e“What things?”\u003c/p\u003e\n\u003cp\u003eI drifted to where Hasselberg and Big Joe were having their conversation. As soon as it began to wane, I said, “Excuse me, Sheriff. You and I need to chat.” He stared as if he were surprised to see me. “There’s the matter of Tracie Blake’s murder.”\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHTEEN\u003c/p\u003e\n\u003cp\u003eFour in the afternoon and there were only two customers in the Tall Moon Tavern. A man and a woman, no longer young, sitting in a booth near the jukebox, were surrounded by discarded pull tabs, empty beer bottles, and the remains of a pizza-oven pizza. I wondered briefly if this was what they had planned for their retirement or if it just worked out that way—but only briefly. Jeff was standing at one end of the bar, a knife in his hand. The blade of the knife seemed too long and too sharp for the job—he was slicing lemons, limes, and oranges. Wayne was sitting at the other end of the stick, his elbow propped on the smooth surface, his chin resting against his hand. There was a coffee mug in front of him. He called to us.\u003c/p\u003e\n\u003cp\u003e“Look what the cat dragged in.”\u003c/p\u003e\n\u003cp\u003eThe sheriff and I moved across the impossibly warped floor. I settled on a stool at the bar. Big Joe Balk took a chair at a table facing Wayne.\u003c/p\u003e\n\u003cp\u003e“How are you doing?” I said.\u003c/p\u003e\n\u003cp\u003e“Fair,” Wayne said. “I heard that you disappeared after Church and Paulie got busted. I thought one of their friends might have had a hand in it until I realized that Church and Paulie didn’t have any friends. So, what happened to you?”\u003c/p\u003e\n\u003cp\u003e“I was just checking out the countryside, bathing in the scenery.”\u003c/p\u003e\n\u003cp\u003e“Some of that scenery punch you in the eye, did it?”\u003c/p\u003e\n\u003cp\u003e“It’s a rough neighborhood.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m always happy to see you. You, too, Sheriff. What’ll ya have? Jeff, take care of these boys on me.”\u003c/p\u003e\n\u003cp\u003eJeff wiped his hands on a towel and moved down the bar.\u003c/p\u003e\n\u003cp\u003e“Ringneck,” I told him.\u003c/p\u003e\n\u003cp\u003e“I’m good,” said the sheriff.\u003c/p\u003e\n\u003cp\u003e“Not drinkin’?” Wayne said.\u003c/p\u003e\n\u003cp\u003e“I’m working.”\u003c/p\u003e\n\u003cp\u003e“Can’t even offer you a cup of joe?”\u003c/p\u003e\n\u003cp\u003eThe sheriff shook his head.\u003c/p\u003e\n\u003cp\u003e“Shit.” Wayne picked up his mug, took a long sip, and set it down again. “Shit,” he repeated.\u003c/p\u003e\n\u003cp\u003eJeff served the Ringneck and went back to his fruit. He didn’t look at Wayne, or me, or anyone else for that matter. Just a fly on the wall.\u003c/p\u003e\n\u003cp\u003e“Well, shit,” Wayne said again. “If I had known you boys were coming, I never would have climbed back up on the wagon. Hey, Jeff. Pour me a shot.”\u003c/p\u003e\n\u003cp\u003eJeff didn’t look, didn’t move; just stood there, slicing lemons as if it were the most important task a man could perform.\u003c/p\u003e\n\u003cp\u003e“C’mon, Jeff,” Wayne said. “I need it.”\u003c/p\u003e\n\u003cp\u003eJeff ignored him some more.\u003c/p\u003e\n\u003cp\u003e“Hell,” Wayne said. “You tellin’ me a man can’t get one last drink before he goes to prison?” He drained what was left of his coffee and slammed the mug on top of the bar as if he didn’t care if it shattered or not.\u003c/p\u003e\n\u003cp\u003e“Take your time,” Sheriff Balk said. “We’re in no hurry.”\u003c/p\u003e\n\u003cp\u003e“That’s damn white of ya, Big Joe,” Wayne said. “It truly is. But I guess there’s no sense puttin’ it off. I want to tell you, though—McKenzie, I want to tell you—I’m sorry. I really am, man. Hittin’ you with my bat like that—see, Sheriff, I’m confessing. You won’t have any trouble with me. McKenzie, hitting you with the bat, that was wrong, flat-out wrong, and I’m sorry. I thought you were stepping out with Tracie, and I got all jealous, and then I find out that it wasn’t even true. Then the way you did Church, that was beautiful, man. You’re a stand-up guy, McKenzie, and I’m sorry I went after you.”\u003c/p\u003e\n\u003cp\u003eI raised the Ringneck in salute. “Don’t worry about it. I forgive you.” I took a sip of the ale and set the bottle down.\u003c/p\u003e\n\u003cp\u003e“Yeah, only Big Joe, he ain’t the forgivin’ sort,” Wayne said. “Are you, Big Joe?”\u003c/p\u003e\n\u003cp\u003e“Vic won’t press charges, what am I supposed to do about it?” the sheriff said.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“We didn’t come for that,” I said. “You hitting me in the head with a baseball bat, there are worse crimes. Not many, but some.”\u003c/p\u003e\n\u003cp\u003e“We came about Tracie and Mike,” the sheriff said.\u003c/p\u003e\n\u003cp\u003e“No, no, no,” Wayne said. He slipped off his stool, and for a moment I thought he might fall to his knees; he steadied himself by gripping the bar. “You can’t believe—no, McKenzie. No, Sheriff. I didn’t have anything to do with that. You gotta believe me.”\u003c/p\u003e\n\u003cp\u003e“We do believe you,” I said.\u003c/p\u003e\n\u003cp\u003e“Relax,” the sheriff said.\u003c/p\u003e\n\u003cp\u003e“Relax?” Wayne said.\u003c/p\u003e\n\u003cp\u003e“Tracie and Mike were killed after 2:00 a.m., killed right after closing time,” I said. “They were killed while you were at the Libbie cop shop trying to convince Chief Gustafson to drop the DUI charges against Councilman Hudalla’s kid.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Wayne said. “That’s right.”\u003c/p\u003e\n\u003cp\u003e“Besides, you didn’t know Tracie left the bar that night to see Mike. You thought she had gone to see me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-94.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
