{"id":104667,"no":95,"title":"Page 95","content":"\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“Jeff knew, though. He told me so the night Church’s truck accidentally caught on fire. Didn’t you, Jeff?”\u003c/p\u003e\n\u003cp\u003eJeff didn’t move, not even to look up from the cutting board.\u003c/p\u003e\n\u003cp\u003e“You said a lot of things about Wayne that night, Jeff,” I said. “You said he was furious when Tracie left on her date with Mike. You said he insulted her, called her names. You said he went off in a huff but later came back happy. You gave me as many reasons to believe that Wayne killed Mike and Tracie as you could without actually accusing him. I thought that was odd. Do you think it was odd?”\u003c/p\u003e\n\u003cp\u003e“I think it was odd,” said the sheriff.\u003c/p\u003e\n\u003cp\u003e“Did you, Jeff?” Wayne said. “Did you say those things?”\u003c/p\u003e\n\u003cp\u003eJeff didn’t say if he did or didn’t.\u003c/p\u003e\n\u003cp\u003e“Where were you that night, Jeff?” I said. “You said you got off early; said that Wayne was in such a good mood that he closed up. Where did you go after last call? Jeff?”\u003c/p\u003e\n\u003cp\u003eJeff stared at the lemon on the cutting board, the knife poised above it.\u003c/p\u003e\n\u003cp\u003e“It’s just a hunch, Jeff,” I said. “I could be wrong. I could be way, way out there on this one. During the ride over, the sheriff said you could sue my ass for slander if I accused you and I was wrong. Am I wrong, Jeff?”\u003c/p\u003e\n\u003cp\u003e“Whoever shot Mike and Tracie left his fingerprints on the gun,” the sheriff said. “If they aren’t yours, Jeff, you could take a lot of money offa McKenzie. I’ll even testify on your behalf.”\u003c/p\u003e\n\u003cp\u003e“Jeff?”\u003c/p\u003e\n\u003cp\u003e“Do I need to get a court order to take your fingerprints, Jeff?”\u003c/p\u003e\n\u003cp\u003e“Say it ain’t so, Jeff,” Wayne said.\u003c/p\u003e\n\u003cp\u003eJeff’s head came up slowly. He looked at the sheriff. He looked at Wayne. He looked at me. Then he threw the knife at the sheriff.\u003c/p\u003e\n\u003cp\u003eI ducked at Jeff’s arm motion and spun off of the stool. I didn’t see the knife in flight, but I heard the sheriff’s painful cry, and I saw him wrench his left shoulder back and spill from his chair.\u003c/p\u003e\n\u003cp\u003eJeff rounded the bar and ran to the door. I went to the sheriff. He was lying on his side and gurgling angrily. I gently rolled him on his back. The knife was four inches deep and protruding from the upper part of his armpit. It didn’t seem to have sliced any major arteries.\u003c/p\u003e\n\u003cp\u003e“Not so bad,” I said.\u003c/p\u003e\n\u003cp\u003e“Fuck you, McKenzie,” the sheriff said.\u003c/p\u003e\n\u003cp\u003eI reached across his body and yanked his handgun from its holster. It was a Glock 17, the primary sidearm used by the St. Paul Police Department while I was there. I never liked the Glock, was never comfortable with the grip.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” the sheriff said.\u003c/p\u003e\n\u003cp\u003e“Wayne, call the sheriff’s department,” I said. “Call them right now. An ambulance, too. Did you hear me, Wayne?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Wayne said. He went running for the phone behind the bar.\u003c/p\u003e\n\u003cp\u003e“That’s my gun,” the sheriff said.\u003c/p\u003e\n\u003cp\u003e“This is what comes from confiscating my grenade launcher,” I said.\u003c/p\u003e\n\u003cp\u003eI went to the door. The couple sitting in the booth stared at me mutely. They could have been watching reruns of Walker, Texas Ranger for all the excitement they showed.\u003c/p\u003e\n\u003cp\u003e“McKenzie, wait,” the sheriff said.\u003c/p\u003e\n\u003cp\u003eI did wait, but only long enough to be sure that it was clear.\u003c/p\u003e\n\u003cp\u003eI stepped out of the tavern into bright sunlight, the Glock leading the way. I shielded my eyes as I surveyed the parking lot. I saw the sheriff’s cruiser and a battered pickup that I guessed belonged to the older couple. There was a seared and blackened area in the corner of the lot where Church’s vehicle had burned. No Jeff. I circled to my right, carrying the gun with both hands, staying close to the building. I heard movement. I quickened my pace until I was at the corner of the tavern. I peeked around the corner. Jeff was rummaging in the back of an SUV parked alongside the building about twenty paces away.\u003c/p\u003e\n\u003cp\u003e“Stop,” I said.\u003c/p\u003e\n\u003cp\u003eHe paused, looked at me, then pivoted away from the SUV. The gun in his hands looked like a Magnum. It sounded like a Magnum. When the chunk of the building just above my head exploded, raining shards and slivers of wood on my head and against my face, that sealed it.\u003c/p\u003e\n\u003cp\u003eI swung into a Weaver stance just as I had been trained to do—my feet shoulder-width apart, my right foot back from my left foot, knees locked, right arm extended at shoulder level with a slight bend in the elbow, my left hand supporting my right hand, my left arm bent at the elbow, the elbow close to my body, my body turned at a forty-five-degree angle, my head bent slightly to align the gun sights on the center of Jeff’s chest. I squeezed the trigger slowly.\u003c/p\u003e\n\u003cp\u003eClick.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eI scurried back around the corner of the building just as Jeff threw another shot at me, this one sailing wide.\u003c/p\u003e\n\u003cp\u003eI pulled back the slide.\u003c/p\u003e\n\u003cp\u003eAre you kidding me?\u003c/p\u003e\n\u003cp\u003eSheriff Balk had been carrying his Glock without a round in the chamber.\u003c/p\u003e\n\u003cp\u003eYou gotta be kidding me. Who are you, Barney Fife?\u003c/p\u003e\n\u003cp\u003eMaybe that’s why he told me to wait, I told myself. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-taking-of-libbie-sd-mac-mckenzie-7/page-95.html","bookId":2219,"creation":"Oct 5, 2019 10:37:43 PM","modification":"Oct 5, 2019 10:37:43 PM"}
