{"id":78212,"no":27,"title":"Page 27","content":"\u003cp\u003e\"My sister needs no encouragement in that regard,\" Amelia said. She gave Beatrix a meaningful look. \"It\u0027s time to say farewell to Spot, dear.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know.\" Beatrix heaved a sigh and peered inside the loose cage of her fingers at her erstwhile pet. \"I\u0027ll let him go now. I think Spot would rather live here than at the Ramsay estate.\"\u003c/p\u003e\n\u003cp\u003e\"Who wouldn\u0027t? Go find a nice place for him, Bea. I\u0027ll wait for you here.\"\u003c/p\u003e\n\u003cp\u003eAs her sister scampered off, Amelia turned and gazed at (he dim verge of the house, its outline melding into an ironstone wall set along the bluff overlooking the river.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" Cam asked, approaching her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m taking a good last look at Stony Cross Manor, since this is the last time I\u0027ll ever see it.\"\u003c/p\u003e\n\u003cp\u003eHe grinned. \"I doubt that. The Westcliffs have welcomed back guests who have done far worse.\"\u003c/p\u003e\n\u003cp\u003e\"Worse than setting wild creatures loose at the supper table? Dear heaven, they must be desperate for company.\"\u003c/p\u003e\n\u003cp\u003e\"They have a great tolerance for eccentricity.\" He paused before adding, \"What they don\u0027t take well, I\u0027m afraid, is callousness.\"\u003c/p\u003e\n\u003cp\u003eThe reference to her brother caused a delicate play of emotions on her face, humor fading to chagrin. \"Leo was never callous before.\" She wrapped her arms tightly across her chest, as if she wanted to tie herself into a self-protective bundle. \"It\u0027s only been in the past year that he\u0027s become so intolerable. He\u0027s not himself.\"\u003c/p\u003e\n\u003cp\u003e\"Because he inherited the title?\"\u003c/p\u003e\n\u003cp\u003e\"No, that has nothing to do with it. It\u0027s because? Looking away from him, she swallowed hard. He heard a nervous tapping from a foot half concealed beneath her skirts. \"Leo lost someone,\" she finally said. \"The fever struck many people in the village, including a girl he ... well, he was betrothed to her. Laura.\" The name seemed to stick in her throat. \"She was my best friend, and Win\u0027s, too. A beautiful girl. She liked to draw and paint. She had a laugh that would make you laugh, too, just to hear it.\"\u003c/p\u003e\n\u003cp\u003eAmelia was silent for a moment, lost in her memories. \"Laura was one of the first to fall ill,\" she said. \"Leo stayed with her every possible moment. No one expected her to die ... but it happened so quickly. After three days she was so feverish and weak you could barely feel her pulse. Finally she lost consciousness and died a few hours later in Leo\u0027s arms. He came home and collapsed, and we realized he had caught the fever. And then Win had it, too.\"\u003c/p\u003e\n\u003cp\u003e\"But the rest of you didn\u0027t?\"\u003c/p\u003e\n\u003cp\u003eAmelia shook her head. \"I had already sent Beatrix and Poppy away. And for some reason, neither I nor Merripen were susceptible. He helped me nurse them both through it. Without his help, they would both have died. Merripen made a syrup with some kind of toxic plant?\u003c/p\u003e\n\u003cp\u003e\"Deadly nightshade,\" Cam said. \"Not easy to find.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She gave him a curious glance. \"How did you know? You learned it from your grandmother, I suppose.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"The trick is to administer enough to counteract the poison in the blood, but not enough to kill the patient.\"\u003c/p\u003e\n\u003cp\u003e\"Well, both of them came through it, thank God. But Win is quite fragile, as you can probably see, and Leo ... now he cares for nothing and no one. Not even himself.\" Her foot resumed its nervous tapping. \"I don\u0027t know how to help him. I understand how it feels to lose someone, but...\" She shook her head helplessly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re referring to Mr. Frost,\" he said.\u003c/p\u003e\n\u003cp\u003eAmelia gave him a sharp glance and flushed deeply. \"How did you know? Did he say something? Was there gossip, or?\u003c/p\u003e\n\u003cp\u003e\"No, nothing like that\u0027. I saw it when you talked to him earlier.\"\u003c/p\u003e\n\u003cp\u003eShaking her head, Amelia raised her hand to her heat-infused cheeks. \"Dear heaven. Am I that easy to read?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps I\u0027m one of the PhuriDae\" he said, smiling at her. \"A mystical Gypsy. Were you in love with him?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s none of your concern,\" she said, a bit too quickly.\u003c/p\u003e\n\u003cp\u003eHe watched her closely. \"Why did he leave you?\"\u003c/p\u003e\n\u003cp\u003e\"How did you? She broke off and scowled as she understood what he was doing, throwing out provocative questions and gleaning the truth from her reactions. \"Bother. All right, I\u0027ll tell you. He left me for another woman. A prettier, younger woman who happened to be his employer\u0027s daughter. It would have been a very advantageous marriage for him.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wrong.\"\u003c/p\u003e\n\u003cp\u003eAmelia gave him a perplexed glance. \"I assure you, it would have been an enormously advantageous?\u003c/p\u003e\n\u003cp\u003e\"She couldn\u0027t possibly have been prettier than you.\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened at the compliment. \"Oh,\" she whispered.\u003c/p\u003e\n\u003cp\u003eApproaching her, Cam touched her vibrating foot with his own. The tapping stopped.\u003c/p\u003e\n\u003cp\u003e\"A bad habit,\" Amelia said abashedly. \"I can\u0027t seem to rid myself of it.\"\u003c/p\u003e\n\u003cp\u003e\"A hummingbird will do that in spring. She hangs on the side of the nest and uses her other foot to tamp down the floor.\"\u003c/p\u003e\n\u003cp\u003eHer gaze chased around as if she couldn\u0027t decide where to look.\u003c/p\u003e\n\u003cp\u003e\"Miss Hathaway.\" Cam spoke gently, while she fidgeted before him. He wanted to take her in his arms and hold her until she quieted. \"Do I make you nervous?\"\u003c/p\u003e\n\u003cp\u003eShe brought herself to look up at him, her eyes harboring the blue-black glitter of a moonlit lake. \"No,\" she said immediately. \"No, of course you... yes. Yes, you do.\"\u003c/p\u003e\n\u003cp\u003eThe vehement honesty of her answer surprised both of them. The night deepened—one of the torches had burned out—and the conversation devolved into something halting and broken and delicious, like pieces of barley sugar melting on the tongue. \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-27.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
