{"id":78218,"no":33,"title":"Page 33","content":"\u003cp\u003e\"It may not be safe for the family to stay here.\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s my concern,\" Leo said, adding with a sneer, \"isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eSensitive to the brittle disquiet in the atmosphere, Amelia made a hasty attempt at diplomacy. \"Mr. Rohan. Lord Ramsay is convinced the house poses no immediate danger to the family.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t be so easily convinced,\" Rohan replied. \"Not with four sisters in my charge.\"\u003c/p\u003e\n\u003cp\u003e\"Care to take them off my hands?\" Leo asked. \"You can have the lot of them.\" He smiled without amusement at Rohan\u0027s silence. \"No? Then pray don\u0027t offer unwanted advice.\"\u003c/p\u003e\n\u003cp\u003eDespondent worry swept over Amelia as she saw the bleakness of her brother\u0027s face. He was becoming a stranger, this man who harbored despair and fury so deep inside that it had begun to eat at his foundations. Until, like the house, he would eventually collapse as the weakest parts of the structure gave way.\u003c/p\u003e\n\u003cp\u003eUnruffled, Rohan turned to Amelia. \"In lieu of advice, let me offer some information. Two days hence, there\u0027ll be a Mop Fair held at the village.\"\u003c/p\u003e\n\u003cp\u003e\"What is that?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a hiring fair, attended by all the local residents in need of work. They wear tokens to signify their trade—a servant girl will carry a mop, a thatcher carries a tuft of straw, and so forth. Give the ones you want a shilling to seal the contract, and you\u0027ll have them for a year\u0027s employment.\"\u003c/p\u003e\n\u003cp\u003eAmelia darted a cautious glance at her brother. \"We do need proper servants, Leo.\"\u003c/p\u003e\n\u003cp\u003e\"Go, then, and hire whomever you please. I don\u0027t give a damn.\"\u003c/p\u003e\n\u003cp\u003eAmelia gave a troubled nod and raised her hands to her upper arms, rubbing them over her sleeves.\u003c/p\u003e\n\u003cp\u003eIt was cold, she thought, even for autumn. Icy drafts rept around her stockinged ankles, beneath the edges of her cuffs, across the sweat-dampened back of her neck. Her muscles tensed against the strange, raw chill.\u003c/p\u003e\n\u003cp\u003eBoth men had fallen silent. Leo\u0027s face was blank, his gaze focused inward.\u003c/p\u003e\n\u003cp\u003eIt felt as if the space around them were folding in on itself, thickening until the air was as heavy as water. Colder, tighter, closer... instinctively Amelia stepped back, away from her brother, until she felt Rohan\u0027s chest against her shoulders. His hand came up to her arm, gently cupping her elbow. Shivering, she leaned harder against the warm, vital strength of his body.\u003c/p\u003e\n\u003cp\u003eLeo had not moved. He waited, his gaze unfocused, as if he were intent on absorbing the chill. As if he welcomed it, wanted it. His averted face was harsh and shadow-crossed.\u003c/p\u003e\n\u003cp\u003eSomething divided the space between them, her and Leo. She felt the resonance of movement, softer than a breeze, more delicate than eiderdown...\u003c/p\u003e\n\u003cp\u003e\"Leo?\" Amelia murmured uncertainly.\u003c/p\u003e\n\u003cp\u003eThe sound of her voice seemed to bring him back to himself. He blinked and stared at her with near-colorless eyes. \"Show Rohan out,\" he said curtly. \"That is, if you\u0027ve been sufficiently compromised for one day.\" He walked away rapidly. Reaching his room, he closed the door with a clumsy swipe of his arm.\u003c/p\u003e\n\u003cp\u003eAmelia was slow to move, bewildered by her brother\u0027s behavior, and even more so by the splintering coldness in the hallway. She turned to face Rohan, who was staring after Leo with a level gaze.\u003c/p\u003e\n\u003cp\u003eHe glanced down at her, keeping his expression carefully impassive. \"I hate to leave you.\" There was a gently mocking edge to his tone. \"You need someone to follow you around and keep you safe from mishaps. On the other hand, you also need someone to find a beekeeper.\"\u003c/p\u003e\n\u003cp\u003eRealizing he was not going to talk about Leo, Amelia followed his lead. \"Will you do that for us? I would consider it a great favor.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Although ...\" His eyes held a wicked glitter. \"As I mentioned before, I can\u0027t keep doing favors for you with no reward. A man needs incentive.\"\u003c/p\u003e\n\u003cp\u003e\"If... if you want money, I\u0027ll be glad to?\u003c/p\u003e\n\u003cp\u003e\"God, no.\" Rohan was laughing now. \"I don\u0027t want money.\" Reaching out, he smoothed back her hair, letting the heel of his hand graze the edge of her cheekbone. The brush of his skin was light and erotic, causing her to swallow hard. \"Goodbye, Miss Hathaway. I\u0027ll see myself out.\" He flashed a smile at her and advised, \"Stay away from the windows.\"\u003c/p\u003e\n\u003cp\u003eOn the way down the stairs, Rohan passed Merripen, who was ascending at a measured pace.\u003c/p\u003e\n\u003cp\u003eMerripen\u0027s face darkened at the sight of the visitor. \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"It seems I\u0027m helping with pest eradication.\"\u003c/p\u003e\n\u003cp\u003e\"Then you can begin by leaving,\" Merripen growled.\u003c/p\u003e\n\u003cp\u003eRohan only grinned nonchalantly, and continued on his way.\u003c/p\u003e\n\u003cp\u003eAfter informing the rest of the family about the perils of the upstairs parlor, which was promptly dubbed \"the bee room,\" Amelia investigated the rest of the upstairs with extreme caution. There were no more hazards to be found, only dust and decay and silence.\u003c/p\u003e\n\u003cp\u003eBut it was not an unwelcoming house. When the windows were opened and light spilled across floors that had been untouched for years, it seemed the place was eager to pen and breathe and be restored. Ramsay House was a charming place, really, with eccentricities, secret corners, and unique features that only needed some polish and attention. Not unlike the Hathaway family itself.\u003c/p\u003e\n\u003cp\u003eIn the afternoon Amelia collapsed in a chair downstairs, while Poppy made tea in the kitchen. \"Where is Win?\"\u003c/p\u003e\n\u003cp\u003e\"Napping in her room,\" Poppy replied. \"She was exhausted after the busy morning. She wouldn\u0027t admit it, of course, but you can always tell when she gets all pale and drawn.\"\u003c/p\u003e\n\u003cp\u003e\"Was she content?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-33.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
