{"id":78190,"no":4,"title":"Page 4","content":"\u003cp\u003e\"I wouldn\u0027t tell you even if I knew.\" His accent was a subtle mixture of foreignness and Cockney, and even a hint of upper class. It was the voice of a man who kept company with an unusual assortment of people.\u003c/p\u003e\n\u003cp\u003e\"I assure you, sir, I wouldn\u0027t put myself or anyone else to the trouble, were it not absolutely necessary. But this is the third day since my brother has gone missing?\u003c/p\u003e\n\u003cp\u003e\"Not my problem.\" Rohan turned toward the door.\u003c/p\u003e\n\u003cp\u003e\"He tends to fall in with bad company?\u003c/p\u003e\n\u003cp\u003e\"That\u0027s unfortunate.\"\u003c/p\u003e\n\u003cp\u003e\"He could be dead by now.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help you. I wish you luck in your search.\" Rohan pushed open the door and made to enter the club.\u003c/p\u003e\n\u003cp\u003eHe stopped as Merripen spoke in Romany.\u003c/p\u003e\n\u003cp\u003eSince Merripen had first come to the Hathaways, there had been only a handful of occasions on which Amelia had heard him speak the secret language known to the Rom. It was heathen-sounding, thick with consonants and drawn-out vowels, but there was a primitive music in the way the words fit together.\u003c/p\u003e\n\u003cp\u003eStaring at Merripen intently, Rohan leaned his shoulder against the door frame. \"The old language,\" he said. \"It\u0027s been years since I\u0027ve heard it. Who is the father of your tribe?\"\u003c/p\u003e\n\u003cp\u003e\"I have no tribe.\"\u003c/p\u003e\n\u003cp\u003eA long moment passed, while Merripen remained inscrutable in the face of Rohan\u0027s regard.\u003c/p\u003e\n\u003cp\u003eThe hazel eyes narrowed. \"Come in. I\u0027ll see what I can find out.\"\u003c/p\u003e\n\u003cp\u003eThey were brought into the club without ceremony, Rohan directing an employee to show them to a private receiving room upstairs. Amelia heard the hum of voices, and music coming from somewhere, and footsteps going to and fro. It was a busy masculine hive forbidden to someone like herself.\u003c/p\u003e\n\u003cp\u003eThe employee, a young man with an East London accent and careful manners, took them into a well-appointed room and bid them wait there until Rohan returned. Merripen went to a window overlooking King Street.\u003c/p\u003e\n\u003cp\u003eAmelia was surprised by the quiet luxury of her surroundings: the hand-knotted carpet done in shades of blue and cream, the wood-paneled walls and velvet-upholstered furniture. \"Quite tasteful,\" she commented, removing her bonnet and setting it on a small claw-footed mahogany table. \"For some reason I had expected something a bit... well, tawdry.\"\u003c/p\u003e\n\u003cp\u003e\"Jenner\u0027s is a cut above the typical establishment. It masquerades as a gentlemen\u0027s club, when its real purpose is to provide the largest hazard bank in London.\"\u003c/p\u003e\n\u003cp\u003eAmelia went to a built-in bookshelf and inspected the volumes as she asked idly, \"Why is it, do you think, that Mr. Rohan was reluctant to take money from Lord Selway?\"\u003c/p\u003e\n\u003cp\u003eMerripen cast a sardonic glance over his shoulder. \"You know how the Rom feel about material possessions.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know your people don\u0027t like to be encumbered. But from what I\u0027ve seen, Romas are hardly reluctant to accept a few coins in return for a service.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s more than not wanting to be encumbered. For a chal to be in this position?\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a chal?\"\u003c/p\u003e\n\u003cp\u003e\"A son of the Rom. For a chal to wear such fine clothes, to stay under one roof so long, to reap such financial bounty... it\u0027s shameful. Embarrassing. Contrary to his nature.\"\u003c/p\u003e\n\u003cp\u003eHe was so stern and certain of himself, Amelia couldn\u0027t resist teasing him a little. \"And what\u0027s your excuse, Merripen? You\u0027ve stayed under the Hathaway roof for an awfully long time.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s different. For one thing, there\u0027s no profit in living with you.\"\u003c/p\u003e\n\u003cp\u003eAmelia laughed.\u003c/p\u003e\n\u003cp\u003e\"For another...\" Merripen\u0027s voice softened. \"I owe my life to your family.\"\u003c/p\u003e\n\u003cp\u003eAmelia felt a surge of affection as she stared at his unyielding profile. \"What a spoilsport,\" she said gently. \"I try to mock you, and you ruin the moment with sincerity. You know you\u0027re not obligated to stay, dear friend. You\u0027ve repaid your debt to us a thousand times over.\"\u003c/p\u003e\n\u003cp\u003eMerripen shook his head immediately. \"It would be like leaving a nest of plover chicks with a fox nearby.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not as helpless as all that,\" she protested. \"I\u0027m perfectly capable of taking care of the family ... and so is Leo. When he\u0027s sober.\"\u003c/p\u003e\n\u003cp\u003e\"When would that be?\" His bland tone made the question all the more sarcastic.\u003c/p\u003e\n\u003cp\u003eAmelia opened her mouth to argue the point, but was forced to close it. Merripen was right—Leo had wandered through the past six months in a state of perpetual inebriation. She put a hand to her midriff, where worry had accumulated like a sack of lead shot. Poor wretched Leo—she was terrified nothing could be done for him. Impossible to save a man who didn\u0027t want to be saved.\u003c/p\u003e\n\u003cp\u003eThat wouldn\u0027t stop her from trying, however.\u003c/p\u003e\n\u003cp\u003eShe paced around the room, too agitated to sit and wait calmly. Leo was out there somewhere, needing to be rescued. And there was no telling how long Rohan would have them bide their time here.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to have a look around,\" she said, heading to the door. \"I won\u0027t go far. Stay here, Merripen, in case Mr. Rohan should come.\"\u003c/p\u003e\n\u003cp\u003eShe heard him mutter something beneath his breath. Ignoring her request, he followed at her heels as she went out into the hallway.\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t proper,\" he said behind her.\u003c/p\u003e\n\u003cp\u003eAmelia didn\u0027t pause. Propriety had no power over her now. \u0027This is my one chance to see inside a gaming club—I\u0027m not going to miss it.\" Following the sound of voices, she ventured toward a gallery that wrapped around the second story of a huge, splendid room.\u003c/p\u003e\n\u003cp\u003eCrowds of elegantly dressed men gathered around three large hazard tables, watching the play, while croupiers used rakes to gather dice and money. There was a great deal of talking and calling out, the air crackling with excitement. Employees moved through the hazard room, some bearing trays of food and wine, others carrying trays of chips and fresh cards. \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-4.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
