{"id":78230,"no":46,"title":"Page 46","content":"\u003cp\u003eThat was as close to a proposal as he had ever come. There had been no official betrothal, although Christopher had led her to expect one. There had only been a mysterious silence for almost a month, and then Leo had gone to find him on Amelia\u0027s behalf. Her brother had come back from London looking angry and troubled.\u003c/p\u003e\n\u003cp\u003e\"There are rumors,\" Leo had told Amelia gruffly, taking her against his shirtfront, drying her tears with his handkerchief. \"He\u0027s been seen with Rowland Temple\u0027s daughter. They say he\u0027s courting her.\"\u003c/p\u003e\n\u003cp\u003eAnd then another letter had come from Christopher, so devastating that Amelia wondered how mere scratches of ink on paper could rip someone\u0027s soul to shreds. She had wondered how she could feel so much pain and still survive. She had gone to bed for a week, not venturing from her darkened room, crying until she was ill, and then crying some more.\u003c/p\u003e\n\u003cp\u003eIronically, the thing that had saved her was the scarlet fever that had struck Win and Leo. They had needed her, and caring for them had pulled her out of the depths of melancholy. She had not shed a tear for Christopher Frost after that.\u003c/p\u003e\n\u003cp\u003eBut the absence of tears wasn\u0027t the same as an absence of feeling. Amelia was surprised now to discover that underneath the bitterness and caution, all the things she had once found appealing about him were still there.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the last person who should remark on how you conduct your personal affairs,\" Christopher said quietly. He offered an arm as they walked. She hesitated before taking it. \"However, you know what people will say if you\u0027re seen with him.\"\u003c/p\u003e\n\u003cp\u003e\"I appreciate your concern for my reputation.\" Amelia\u0027s tone was lightly salted with sarcasm. \"But I\u0027m hardly the only person to indulge in a few caprices at the village fair.\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re with a gentleman, a few caprices may be overlooked. But he\u0027s a Gypsy, Amelia.\"\u003c/p\u003e\n\u003cp\u003e\"I noticed,\" she said dryly. \"I would have thought you above such prejudice.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not my prejudice,\" Christopher countered swiftly, \"it\u0027s society\u0027s. Defy it if you wish, but there\u0027s always a price to pay.\"\u003c/p\u003e\n\u003cp\u003e\"The argument is moot, at any rate,\" she said. \"Mr. Rohan is leaving for London soon, and then for parts unknown. I doubt I\u0027ll ever see him again. And I can\u0027t fathom why you would care one way or another.\"\u003c/p\u003e\n\u003cp\u003e\"Of course I care,\" Christopher said gently. \"Amelia?I regret having hurt you. More than you could ever know. I certainly don\u0027t wish to see you endure further harm from yet another ill-advised love affair.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not in love with Mr. Rohan,\" she said. \"I would never be so foolish.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad to hear it.\" His excessively soothing tone was grating. It made her want to do something wild and irresponsible just to spite him.\u003c/p\u003e\n\u003cp\u003e\"Why aren\u0027t you married?\" she asked abruptly.\u003c/p\u003e\n\u003cp\u003eThe question was met with a long sigh. \"She accepted my proposal to please her father, rather than out of any sincere attachment to me. As it happened, she was in love with someone else, a man her father didn\u0027t approve of. Eventually they eloped to Gretna Green.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s some justice in that,\" Amelia said. \"You abandoned someone who loved you. And she abandoned you for someone she loved.\"\u003c/p\u003e\n\u003cp\u003e\"Would it please you to know that I never loved her? 1 liked and admired her, but... it was nothing compared to what I felt for you.\"\u003c/p\u003e\n\u003cp\u003e\"No, that doesn\u0027t please me in the least. It\u0027s even worse that you put ambition before all else.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a man who\u0027s trying to support himself—and someday a family—with an uncertain career. I don\u0027t expect you to understand.\"\u003c/p\u003e\n\u003cp\u003e\"Your career was never that uncertain,\" Amelia shot back. \"You had every promise of advancement, even without marrying Rowland Temple\u0027s daughter. Leo told me your talent would have taken you far.\"\u003c/p\u003e\n\u003cp\u003e\"Would that talent were enough. But it\u0027s naive to think so.\"\u003c/p\u003e\n\u003cp\u003e\"Well, naivet?seems to be a common failing of the Hathaways.\"\u003c/p\u003e\n\u003cp\u003e\"Amelia,\" he murmured. \"It\u0027s not like you to be cynical.\"\u003c/p\u003e\n\u003cp\u003eShe bent her head. \"You don\u0027t know what I\u0027m like now.\"\u003c/p\u003e\n\u003cp\u003e\"I want the chance to find out.\"\u003c/p\u003e\n\u003cp\u003eThat drew a glance of startled disbelief from her. \"There\u0027s nothing to be gained by a renewed acquaintance with me, Christopher. I\u0027m no wealthier, nor am I more advantageously connected. Nothing has changed since we last met.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps I have. Perhaps I\u0027ve come to realize what I lost.\"\u003c/p\u003e\n\u003cp\u003e\"Threw away,\" she corrected, her heart thumping painfully.\u003c/p\u003e\n\u003cp\u003e\"Threw away,\" he acknowledged in a soft tone. \"I was a fool and a cad, Amelia. I would never ask that you overlook what I did. But at least give me the opportunity to make amends. I want to be of service to your family, if at all possible. And to help your brother.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t,\" Amelia said. \"You see what\u0027s become of him.\"\u003c/p\u003e\n\u003cp\u003e\"He is a man of remarkable talents. It would be criminal to waste them. Perhaps, if I could befriend him again?\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think he would be very receptive to that.\"\u003c/p\u003e\n\u003cp\u003e\"I want to help him. I have influence with Rowland Temple now. His daughter\u0027s elopement left him with a sense of obligation toward me.\"\u003c/p\u003e\n\u003cp\u003e\"How convenient for you.\"\u003c/p\u003e\n\u003cp\u003e\"I might be able to interest Leo in working for him again. It would benefit them both.\"\u003c/p\u003e\n\u003cp\u003e\"But how would it benefit you?\" she asked. \"Why would you go to such trouble on Leo\u0027s behalf?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-46.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
