{"id":78247,"no":63,"title":"Page 63","content":"\u003cp\u003eAmelia nodded in greeting. \"Good day, gentlemen.\" She steeled herself not to flinch as she stared up into Cam\u0027s dark face. \"Mr. Rohan, I had thought you would have been gone by now.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be leaving for London soon.\"\u003c/p\u003e\n\u003cp\u003eGood, she thought. That was for the best. But her heart thumped in an extra painful beat.\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ll return within a week,\" Cam stunned her by adding calmly. \"Along with an engineer and master builder to appraise the condition of Ramsay House.\"\u003c/p\u003e\n\u003cp\u003eAmelia was shaking her head even before he had finished. \"Mr. Rohan, I don\u0027t wish to sound ungrateful, but that won\u0027t be necessary. My brother and I will decide how best to proceed.\"\u003c/p\u003e\n\u003cp\u003e\"Your brother is in no condition to decide anything.\" Lord Westcliff broke in. \"Miss Hathaway, you are welcome to stay at Stony Cross Manor indefinitely.\"\u003c/p\u003e\n\u003cp\u003e\"You are very generous, my lord. But since Ramsay House is still standing, we will live there.\"\u003c/p\u003e\n\u003cp\u003e\"It was barely adequate before the fire,\" Cam said. \"As things stand now, I wouldn\u0027t let a stray dog go in there. Most of the place will have to be razed to the foundation.\" Amelia scowled. \"Then we will move into the gatehouse on the approach road.\"\u003c/p\u003e\n\u003cp\u003e\"That place is too small for the lot of you. And it\u0027s in bad condition.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s none of your concern, Mr. Rohan.\"\u003c/p\u003e\n\u003cp\u003eCam gave her a long, intent stare. There was something new in his gaze, she realized. Something that made her insides tighten with apprehension and confusion.\u003c/p\u003e\n\u003cp\u003e\"We need to speak privately,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No we don\u0027t.\" All her nerves shrilled in warning as she saw the glances the three men exchanged.\u003c/p\u003e\n\u003cp\u003e\"With your permission,\" Lord Westcliff murmured, \"we will withdraw.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Amelia said swiftly, \"you don\u0027t have to go, really, there\u0027s no need...\" Her voice faded as it became apparent that her permission was not required.\u003c/p\u003e\n\u003cp\u003eFollowing Westcliff, Lord St. Vincent paused just long enough to murmur to Amelia, \"Although most advice should be distrusted, particularly when it comes from myself... keep an open mind, Miss Hathaway. One should never look a rich husband in the mouth.\" He winked at her and left, striding to the back terrace along with Westcliff. Thunderstruck, Amelia could only manage one word.\u003c/p\u003e\n\u003cp\u003e\"Husband?\"\u003c/p\u003e\n\u003cp\u003e\"I told them we were betrothed.\" Cam took her arm in a gentle but adamant grip and guided her around to the other side of the yew, where they could not be observed from the house. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because we are.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eThey stopped in the concealment of the hedge. Aghast, Amelia looked up into his warm hazel eyes. \"Are you mad?\" Taking her hand, Cam lifted it until the ring gleamed in the daylight. \"You\u0027re wearing my ring. You slept with me. You made promises. Many in the Rom would say that constitutes full-blown marriage. But just to make certain it\u0027s legal, we\u0027ll do it the way of the gadjos as well.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll do no such thing!\" Amelia snatched her hand from his and backed away. \"I\u0027m only wearing this ring because I can\u0027t get the blasted thing off. And what do you mean, I made promises? Were those Romany words you asked me to repeat some kind of vow? You tricked me! I didn\u0027t mean what I said.\"\u003c/p\u003e\n\u003cp\u003e\"But you did sleep with me.\"\u003c/p\u003e\n\u003cp\u003eShe flushed in shame and outrage, and dragged a sleeve across her sweating brow. Whirling away from him, she strode rapidly along a graveled path that led deeper into the garden. \"That didn\u0027t mean anything, either,\" she said over her shoulder.\u003c/p\u003e\n\u003cp\u003eHe kept pace with her easily. \"It meant something to me. The sexual act is sacred to a Roma.\"\u003c/p\u003e\n\u003cp\u003eShe made a scornful sound. \"What about all the ladies you seduced in London? Was it sacred when you slept with them, too?\"\u003c/p\u003e\n\u003cp\u003e\"For a while I fell into the impure ways of the gadjo,\" he said innocently. \"Now I\u0027ve reformed.\"\u003c/p\u003e\n\u003cp\u003eAmelia sent him a sideways glare. \"You don\u0027t want this. You don\u0027t want me. One night can\u0027t change the entire course of someone\u0027s life.\"\u003c/p\u003e\n\u003cp\u003e\"Of course it can.\" He reached for her, and Amelia skittered away, passing a mermaid fountain surrounded by stone benches. Cam caught her from behind and jerked her back against him. \"Stop running from me and listen. I do want you. I want you even knowing if I marry you, I\u0027ve got an instant family, complete with a suicidal brother-in-law and a Gypsy houseboy with the temperament of a poked bear.\"\u003c/p\u003e\n\u003cp\u003e\"Merripen is not a houseboy.\"\u003c/p\u003e\n\u003cp\u003e\"Call him what you like. He comes with the Hathaways. I accept that.\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t accept you,\" she said desperately. \"There\u0027s no place for you in our family.\"\u003c/p\u003e\n\u003cp\u003e\"Yes there is. Right by your side.\" Breathing hard, Amelia felt his hand drift over the front of her body. Even though her br**sts were contained in a padded corset, the pressure of his hand over her bodice caused her to shiver.\u003c/p\u003e\n\u003cp\u003e\"It would be disastrous.\" Heat climbed in her br**sts and throat and face. \"You would resent me for taking away your freedom?and I would resent you for taking mine. I can\u0027t promise to obey you, to accept your decisions and never again be entitled to my own opinions?\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t have to be that way.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? Would you swear never to command me to do anything against my will?\"\u003c/p\u003e\n\u003cp\u003eCam turned her to face him, his fingers gentle on the burning surface of her cheek. He considered the question carefully. \"No,\" he eventually said. \"I couldn\u0027t swear that. Not if I thought something was for your own good.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-63.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
