{"id":78249,"no":65,"title":"Page 65","content":"\u003cp\u003eBy the time they reached the top, Lillian, Lady Westcliff, was there, her dark gaze chasing over Amelia with concern. \"You look as if you\u0027re about to cast up your crumpets,\" she said without preamble. \"What\u0027s the matter?\"\u003c/p\u003e\n\u003cp\u003e\"I proposed to her,\" Cam said shortly. Lillian\u0027s eyebrows lifted.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" Amelia told her. \"I\u0027m just a bit hungry.\"\u003c/p\u003e\n\u003cp\u003eLillian accompanied them as Cam took Amelia to her sisters\u0027 table. \"Did she accept?\" she asked Cam.\u003c/p\u003e\n\u003cp\u003e\"Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m not surprised. A woman can\u0027t possibly consider a marriage proposal on an empty stomach.\" Lillian watched Amelia with concern. \"You\u0027re very pale, dear. Shall I take you inside to lie down somewhere?\"\u003c/p\u003e\n\u003cp\u003eAmelia shook her head. \"Thank you, no. I\u0027m sorry to make a scene.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you\u0027re not making a scene,\" Lillian said. \"Believe me, this is nothing compared to the usual goings-on here.\" She smiled reassuringly. \"If there is anything you need, Amelia, you have only to ask.\"\u003c/p\u003e\n\u003cp\u003eCam led Amelia to her sisters. She sank gratefully into a chair, in front of a plate heaped with sliced ham, chicken, various salads, and a plate of bread. To her astonishment, Cam took the chair beside hers, cut a bite of something on the plate, and speared it with a fork.\u003c/p\u003e\n\u003cp\u003eHe held the morsel up to her lips. \"Start with this.\"\u003c/p\u003e\n\u003cp\u003eShe scowled. \"I\u0027m perfectly capable of feeding mys?\u003c/p\u003e\n\u003cp\u003eThe fork was pushed into her mouth. Amelia continued to glare at him as she chewed. When she swallowed, she could only manage a few words?Give me that\"—before he shoved another bite in.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re going to do such a poor job taking care of yourself,\" Cam informed her, \"someone else will do it for you.\"\u003c/p\u003e\n\u003cp\u003eAmelia picked up a piece of bread and bit deeply into .it. Although she longed to tell him that it was his fault she\u0027d gotten so little sleep and missed breakfast in the bargain, she couldn\u0027t say a word with her sisters present. As she ate, she felt the color returning to her cheeks. She was aware of conversation taking place around her, the younger Hathaway sisters asking Cam about the condition of Ramsay House, and what was left of it. A chorus of groans greeted the revelation that the bee room had been left intact, and the hive was still busy and thriving.\u003c/p\u003e\n\u003cp\u003e\"I suppose we\u0027ll never be rid of those dratted bees,\"\u003c/p\u003e\n\u003cp\u003eBeatrix exclaimed.\u003c/p\u003e\n\u003cp\u003e\"Yes we will,\" Cam said. His hand lowered to Amelia\u0027s arm, which was resting on the table. His thumb found the delicate blue veins on the underside of her wrist and stroked the agitated throb of her pulse. \"I\u0027ll see that every last one of them is removed.\"\u003c/p\u003e\n\u003cp\u003eAmelia didn\u0027t look at him. She picked up a cup of tea with her free hand and took a careful sip.\u003c/p\u003e\n\u003cp\u003e\"Mr. Rohan,\" she heard Beatrix ask, \"are you going to marry my sister?\"\u003c/p\u003e\n\u003cp\u003eAmelia choked on her tea and set the cup down. She sputtered and coughed into her napkin.\u003c/p\u003e\n\u003cp\u003e\"Hush, Beatrix,\" Win murmured.\u003c/p\u003e\n\u003cp\u003e\"But she\u0027s wearing his ring?\u003c/p\u003e\n\u003cp\u003ePoppy clamped her hand over Beatrix\u0027s mouth.\u003c/p\u003e\n\u003cp\u003e\"Hush!\"\u003c/p\u003e\n\u003cp\u003e\"I might,\" Cam replied. His eyes sparkled with mischief as he continued. \"I find your sister a bit lacking in humor. And she doesn\u0027t seem particularly obedient. On the other hand?\u003c/p\u003e\n\u003cp\u003eOne set of French doors flew open, accompanied by the sound of breaking glass. Everyone on the back terrace looked up in startlement, the men rising from their chairs.\u003c/p\u003e\n\u003cp\u003e\"No,\" came Win\u0027s soft cry.\u003c/p\u003e\n\u003cp\u003eMerripen stood there, having dragged himself from his sickbed. He was bandaged and disheveled, but he looked far from helpless. He looked like a maddened bull, his dark head lowered, his hands clenched into massive fists. And his stare, promising death, was firmly fixed on Cam.\u003c/p\u003e\n\u003cp\u003eThere was no mistaking the bloodlust of a Roma whose kinswoman had been dishonored.\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" Amelia muttered.\u003c/p\u003e\n\u003cp\u003eCam, who stood beside her chair, glanced down at her questioningly. \"Did you say something to him?\"\u003c/p\u003e\n\u003cp\u003eAmelia turned red as she recalled her blood-spotted nightgown and the maid\u0027s expression. \"It must have been servants\u0027 talk.\"\u003c/p\u003e\n\u003cp\u003eCam stared at the enraged giant with resignation. \"You may be in luck,\" he said to Amelia. \"It looks as if our betrothal is going to end prematurely.\"\u003c/p\u003e\n\u003cp\u003eShe made to stand beside him, but he pressed her back into the chair. \"Stay out of this. I don\u0027t want you hurt in the fray.\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t hurt me,\" Amelia said curtly. \"It\u0027s you he wants to slaughter.\"\u003c/p\u003e\n\u003cp\u003eHolding Merripen\u0027s gaze, Cam moved slowly away from the table. \"Is there something you\u0027d like to discuss, chal?\" he asked with admirable self-possession.\u003c/p\u003e\n\u003cp\u003eMerripen replied in Romany. Although no one save Cam understood what he said, it was clearly not encouraging.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to marry her,\" Cam said, as if to pacify him.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s even worse!\" Merripen moved forward, murder in his eyes.\u003c/p\u003e\n\u003cp\u003eLord St. Vincent swiftly interceded, stepping between the pair. Like Cam, he\u0027d had his share of putting down fights at the gambling club. He lifted his hands in a staying gesture and spoke smoothly. \"Easy, large fellow. I\u0027m sure you can find a way to resolve your differences in a reasonable fashion.\"\u003c/p\u003e\n\u003cp\u003e\"Get out of my way,\" Merripen growled, putting an end to the notion of civilized discourse.\u003c/p\u003e\n\u003cp\u003eSt. Vincent\u0027s pleasant expression didn\u0027t change. \"You have a point. There\u0027s nothing so tiresome as being reasonable. I myself avoid it whenever possible. Still, I\u0027m afraid you can\u0027t brawl when there are ladies present. It might give them ideas.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-65.html","bookId":1788,"creation":"Oct 5, 2019 4:07:20 PM","modification":"Oct 5, 2019 4:07:20 PM"}
