{"id":93719,"no":24,"title":"Page 24","content":"\u003cp\u003eStefan had a very strong sense of deja vu. Here he was again, heavyhearted outside the dark wood door of Damon\u0027s apartment, ready to plead with his brother but knowing already that his words would be pointless. He could hear Damon moving quietly inside the apartment, the pages of a book flicking, his brother\u0027s shallow breaths, and he knew that Damon could hear him, too, hesitating in the hall.\u003c/p\u003e\n\u003cp\u003eHe knocked. This time, when Damon opened the door, he didn\u0027t immediately snarl at Stefan but instead gazed at him patiently, waiting for Stefan to speak.\u003c/p\u003e\n\u003cp\u003e\"I know you don\u0027t want to see me,\" Stefan said. \"But I thought I should tell you what\u0027s going on.\"\u003c/p\u003e\n\u003cp\u003eDamon stepped back and waved Stefan in. \"Whatever you like, little brother,\" he said airily. \"I\u0027m afraid I can\u0027t ask you to stay long, though. I\u0027ve got a date with a delicious little undergraduate.\" His smile broadened as Stefan winced.\u003c/p\u003e\n\u003cp\u003eDeciding not to respond to that, Stefan sank down into one of sleek chrome-and-pale-green chairs in Damon\u0027s ultramodern living room. Damon was looking better than he had the last time Stefan had been here. His clothes and hair were perfectly, stylishly arranged, and his pale skin had a slight flush, a sure sign that Damon had been feeding freely. Stefan grimaced a little at the thought, and Damon arched one eyebrow at him.\u003c/p\u003e\n\u003cp\u003e\"So, there is something going on?\" he prompted. His voice took on a mocking tone with the last few words.\u003c/p\u003e\n\u003cp\u003e\"Katherine\u0027s back,\" Stefan said flatly, and had the pleasure of seeing the smile fall off Damon\u0027s face. \"Klaus raised her from the dead somehow.\"\u003c/p\u003e\n\u003cp\u003eDamon blinked slowly, his long black lashes veiling his eyes for a moment, and then he flashed his cruel smile again. \"The dynamic duo together again, hmm?\" he asked. \"That should be quite a handful for you and your humans.\"\u003c/p\u003e\n\u003cp\u003e\"Damon.\" Stefan heard the catch in his own voice. Damon had constructed a wall around himself, but the real Damon was still in there, wasn\u0027t he? He couldn\u0027t have stopped caring about Elena, stopped caring about Stefan himself, so absolutely in such a short time, could he? If Stefan\u0027s plan against Klaus was to work, he would need Damon to care. \"Klaus is determined to find out the truth about Elena,\" he said quickly. \"They\u0027re bound to use Katherine as a weapon against you. They\u0027ll see how you\u0027ve separated yourself from the rest of us. I\u0027m begging you, please don\u0027t tell them anything. If you don\u0027t give a damn about any of us anymore, at least remember how much you hate Katherine and Klaus.\"\u003c/p\u003e\n\u003cp\u003eTilting his head to one side, Damon narrowed his eyes speculatively at Stefan. \"I\u0027ve never been the weakest link, brother,\" he said. \"But, as a matter of simple curiosity, tell me, what truth about Elena?\"\u003c/p\u003e\n\u003cp\u003eThe floor swung dizzyingly under Stefan\u0027s feet and he closed his eyes for a moment. He was such a fool. He hadn\u0027t asked for the details of Elena\u0027s and Damon\u0027s midnight meeting in the woods, and he\u0027d just assumed Elena had told him she was a Guardian. He could have kept his mouth shut, and Damon would have been no danger to them, at least not on this count.\u003c/p\u003e\n\u003cp\u003eBut no, Damon had known that Elena was a potential Guardian, that they had once planned for her to join them. She had told him that the Guardians had killed her parents, trying to get to her. And he knew that Elena had Power now, that she could see auras. If he had let those facts slip to Katherine or Klaus, it would have been dangerous enough. Better that Damon be warned off with a partial truth. Right? Stefan shook his head slightly. It was impossible to know what Damon might do.\u003c/p\u003e\n\u003cp\u003eDamon was still watching him, his eyes bright and cruelly amused, and Stefan had the uncomfortable feeling that his indecision was playing out boldly across his features, plainly evident to someone who had known him as long as Damon had.\u003c/p\u003e\n\u003cp\u003e\"The truth that Elena is connected to the Guardians,\" he said at last. \"Klaus would use it against her if he could. Please, Damon. You say you don\u0027t care, but you can\u0027t want Klaus to kill Elena. Klaus nearly destroyed you.\" He could hear the begging note in his own voice. Please, my brother, he thought, unsure about whether Damon was reading his thoughts. Please. Don\u0027t abandon us. There\u0027s nothing but pain that way, for all of us.\u003c/p\u003e\n\u003cp\u003eDamon smiled briefly and flicked his fingers dismissively at Stefan before turning away. \"No one hurts me, little brother,\" he said over his shoulder. \"Not for long. But don\u0027t worry, I\u0027m sure I can handle Katherine if she comes to me.\"\u003c/p\u003e\n\u003cp\u003eStefan shifted closer to his brother, moving to meet Damon\u0027s eyes again. \"If something happens to me,\" he said somberly, \"tell me you\u0027ll look out for Elena. You loved her once. She could love you, if . . . if things were different.\" No matter what happened, Elena couldn\u0027t be left unprotected.\u003c/p\u003e\n\u003cp\u003eFor a moment, Damon\u0027s mask of indifference seemed to lift, his mouth going taut and his midnight-dark eyes narrowing. \"What do you mean, if something happens to you?\" he said sharply.\u003c/p\u003e\n\u003cp\u003eStefan shook his head. \"Nothing,\" he said. \"It\u0027s a dangerous time, is all.\"\u003c/p\u003e\n\u003cp\u003eDamon stared at him for a moment longer, and then the mask slammed back into place. \"All times are dangerous,\" he said, smiling faintly. \"Now, if you\u0027ll excuse me . . .\" He wandered off in the direction of the kitchen, and after a few minutes, Stefan realized he wasn\u0027t coming back.\u003c/p\u003e\n\u003cp\u003eStefan pushed himself to his feet and hesitated only briefly before turning toward the door. The meeting had gone as well as he could have reasonably expected: Damon hadn\u0027t guaranteed his own silence, but he hadn\u0027t threatened them either, and he\u0027d seemed scornful of any suggestion that he might help Katherine and Klaus. As far as protecting Elena was concerned, all Stefan could do was say his piece. He knew that if it really came down to it, his brother would do the right thing.\u003c/p\u003e\n\u003cp\u003eStefan called a farewell, which went unanswered, and headed out the door. For all he knew, Damon had left through a window and was already winging his way across campus as a crow.\u003c/p\u003e\n\u003cp\u003eHis heart sank at the thought of leaving his brother now without a good-bye, but he kept going. If they both survived, he and Damon would connect again as brothers. He couldn\u0027t let go of that hope. But he didn\u0027t know when or how it would happen. Maybe he\u0027d lost his brother for another century or two. The thought made him feel bleakly, unutterably alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3/page-24.html","bookId":2123,"creation":"Oct 5, 2019 6:04:14 PM","modification":"Oct 5, 2019 6:04:14 PM"}
