{"id":93725,"no":31,"title":"Page 31","content":"\u003cp\u003eCell phone clamped to her ear, Elena hit the button to replay the message. James couldn\u0027t possibly have said what she\u0027d thought she\u0027d heard.\u003c/p\u003e\n\u003cp\u003eBut the message was exactly the same. \"Elena, my dear,\" James said, a thread of excitement running through his voice. \"I think I\u0027ve got it. I think there\u0027s a way we can kill Klaus.\" He paused, as if he was thinking hard, and when he spoke again, his voice was more cautious. \"We have to plan carefully, though. Come to my house as soon as you get this and we\u0027ll talk. This method . . . it\u0027ll take some preparation.\" The message ended, and Elena frowned at her phone in exasperation. Honestly, it was just like James to be cryptic rather than leave some useful information.\u003c/p\u003e\n\u003cp\u003eBut, if he really had found something . . . A bubble of joyous excitement rose in Elena\u0027s chest. The knowledge that Klaus was out there, and that her Guardian Powers were focused on Damon instead, had been like a heavy weight on her shoulders. She didn\u0027t know when, but she had the constant nagging feeling that disaster could come at any moment. If James had a new idea, perhaps there would be an end in sight.\u003c/p\u003e\n\u003cp\u003eAs she hurried across the sun-drenched campus toward James\u0027s house, Elena quickly texted Stefan to meet her there. He\u0027d taken command of their anti-Klaus army, making the decisions and organizing the patrols while she tried to expand her Guardian Powers, and she wanted him there if James had found a solution.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t heard back from Stefan yet when she reached James\u0027s front door. He was probably in class; he\u0027d told her that his philosophy seminar had started up again, now that it had been more than a week since the body of a student had appeared on campus. Oh, well, they could fill him in as soon as he arrived.\u003c/p\u003e\n\u003cp\u003eElena rang the doorbell and waited impatiently. After a minute, she tried again, then knocked on the door. No one came. Andres, she remembered, had planned to spend the afternoon at the library, and then go out to dinner.\u003c/p\u003e\n\u003cp\u003eJames had probably had a quick errand. Pulling out her phone again, Elena dialed his number. It rang, and rang again. Elena cocked her head. She was pretty sure she could hear James\u0027s ringtone coming from inside the house.\u003c/p\u003e\n\u003cp\u003eSo he had gone out and forgotten his phone, Elena thought nervously, shifting from one foot to the other. That didn\u0027t mean anything was wrong.\u003c/p\u003e\n\u003cp\u003eShould she just sit on the porch and wait for James? Stefan would probably be here soon, too. She looked at her watch. It was five o\u0027clock. She was pretty sure Stefan\u0027s class let out around five thirty. It would be dark soon, though. She didn\u0027t really want to wait here alone after dark. Not with Klaus\u0027s army out there somewhere.\u003c/p\u003e\n\u003cp\u003eAnd what if something was wrong? Why would James have left, when he\u0027d asked Elena to come over? If he was in there, and he wasn\u0027t answering . . . Elena\u0027s heart was pounding hard. She tried to look in the window over the porch, but the shades were drawn and she only saw her own worried reflection.\u003c/p\u003e\n\u003cp\u003eMaking up her mind, Elena reached out and twisted the doorknob. It turned easily in her hand, and the door opened. Elena stepped inside. It wasn\u0027t the way she had been raised - Aunt Judith would be horrified to know Elena was walking into someone\u0027s house uninvited - but she was sure James would understand.\u003c/p\u003e\n\u003cp\u003eElena had already closed the door behind her when she noticed the streak of blood. It was wide and still wet, a long stripe of blood just at hand-level, as if someone with bloody hands had strode down the hall, carelessly wiping the blood on the walls as he went.\u003c/p\u003e\n\u003cp\u003eElena froze, and then, her mind blank, walked forward. Something in her was screaming stop stop, but her feet just kept going as if they weren\u0027t even under her control anymore, down the hall and into the usually neat and cheerful kitchen.\u003c/p\u003e\n\u003cp\u003eThe kitchen was still flooded with sunlight through its western-facing windows. The copper pots hanging from the ceiling reflected the light back, illuminating all the corners.\u003c/p\u003e\n\u003cp\u003eAnd everywhere, on all the shining surfaces, were great dark splashes of blood.\u003c/p\u003e\n\u003cp\u003eJames\u0027s body was slumped over the kitchen table. Elena knew at a glance that he was dead. He must be dead - no one could live with their insides spilled across the floor like that - but she went to him anyway. She still felt numb, but she realized she had clapped one hand over her own mouth, holding back the whimpering noise that wanted to come out. She made an effort and pulled the hand away from her mouth, swallowed hard. Oh, God.\u003c/p\u003e\n\u003cp\u003e\"James,\" she said, and pressed her fingers against his neck, trying to find a pulse. His skin was still warm and sticky with blood, but there was no heartbeat at all. \"Oh, James, oh, no,\" she whispered again, horrified and so, so sorry for him.\u003c/p\u003e\n\u003cp\u003eHe had been half in love with her mother when he was a student, she remembered; he\u0027d been her father\u0027s best friend. He could be stuffy and wasn\u0027t always brave, but he had helped her. And he had been funny and smart, and he really hadn\u0027t deserved to die this way just because he had helped Elena. There was no question in her mind that this was because of her: Klaus had come after James because he was on Elena\u0027s side.\u003c/p\u003e\n\u003cp\u003eShe reached for her Guardian Powers, tried to sense his aura, to see if there was anything she could do, but there was no aura left around him. James\u0027s body was here, but everything that made him a person was gone.\u003c/p\u003e\n\u003cp\u003eHot tears were running down her face and Elena wiped furiously at them. Her hand was sticky with James\u0027s blood, and, sickened, she wiped it on one of the kitchen towels before pulling out her phone again. She needed Stefan. Stefan could help.\u003c/p\u003e\n\u003cp\u003eNo answer. Elena left a brief, tense message and tucked the phone away. She had to get out of here. It would be unbearable to stay any longer in this room with its slaughterhouse smell and James\u0027s sad, accusing shell at the table. She could wait for Stefan outside.\u003c/p\u003e\n\u003cp\u003eAs she was about to leave, something caught her eye. On the kitchen table, the only thing not spattered with blood, sat a single pristine sheet of expensive-looking stationery. Elena hesitated. There was something familiar about it.\u003c/p\u003e\n\u003cp\u003eAlmost against her will, she walked slowly back toward the table, where she picked up the paper and turned it over. It was just as blank and clean on the other side.\u003c/p\u003e\n\u003cp\u003eLast time, she remembered, there were dirty fingerprints. Perhaps Klaus had washed his hands after wiping them on the walls. A deep, warming anger was building inside her. It felt like such a violation that, after . . . doing that to poor James, Klaus might wash his hands in the porcelain sink James had kept clean, dried his fingers on James\u0027s carefully arranged towels.\u003c/p\u003e\n\u003cp\u003eShe knew what to expect from Klaus\u0027s message, but she still stiffened, hissing involuntarily through her teeth as black letters began to appear on the paper, written with long jagged downstrokes as if slashed with an invisible knife. She read them with a growing sense of dread.\u003c/p\u003e\n\u003cp\u003eElena -\u003c/p\u003e\n\u003cp\u003eI told you I\u0027d find out the truth. He had plenty to say by the time I let him die.\u003c/p\u003e\n\u003cp\u003eUntil next time,\u003c/p\u003e\n\u003cp\u003eKlaus\u003c/p\u003e\n\u003cp\u003eElena doubled over as if she had been punched in the stomach. No, she thought. Please, no. After everything they\u0027d been through, Klaus had found out her secret. He\u0027d find a way to kill her now - she was sure of it.\u003c/p\u003e\n\u003cp\u003eShe had to pull herself together. She had to keep going. Elena shuddered once, her body jerking, and then took a deep breath. Carefully, she folded the paper and put it in her pocket. Stefan and the others ought to see it.\u003c/p\u003e\n\u003cp\u003eShe was still operating on automatic as she walked outside, shutting James\u0027s front door firmly behind her. There was a spot of blood on her jeans and she rubbed at it absently for a moment, then raised her hand and stared at the red streaks. Without warning, she convulsed, retching into the bushes by the door.\u003c/p\u003e\n\u003cp\u003eHe knew. Oh, God, Klaus knew. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3/page-31.html","bookId":2123,"creation":"Oct 5, 2019 6:04:14 PM","modification":"Oct 5, 2019 6:04:14 PM"}
