{"id":93704,"no":9,"title":"Page 9","content":"\u003cp\u003eMatt craned to look over Stefan\u0027s shoulder and through the creaking door of the abandoned boathouse. It was dark and musty inside, and Matt\u0027s hand tightened automatically on Chloe\u0027s.\u003c/p\u003e\n\u003cp\u003e\"This should be a safe place for now,\" Stefan told them.\u003c/p\u003e\n\u003cp\u003eElena and the others had headed back to campus, shaken and quiet from the fight, but Chloe had nowhere to go. \"I don\u0027t know what to do now,\" she\u0027d said. \"I can\u0027t go back to the Vitale house. Will you help me?\"\u003c/p\u003e\n\u003cp\u003eMatt had taken her hand, feeling a wave of guilty compassion wash over him. If only he hadn\u0027t trusted Ethan. The other Vitale pledges had been innocent victims, but Matt had known vampires. Why hadn\u0027t he suspected? \"Wherever you go, I\u0027m coming with you,\" he\u0027d said stubbornly. So Stefan had brought them here.\u003c/p\u003e\n\u003cp\u003eMatt rubbed the back of his neck and looked around. Safe or not, the old boathouse certainly was grim-looking. Stefan had said that students didn\u0027t come here anymore, and Matt could easily believe it.\u003c/p\u003e\n\u003cp\u003eThis had once been the boathouse for the Dalcrest crew team, but new docks and a boathouse had been built closer to the river. Since then, the small artificial lake this boathouse fronted had silted up. Now algae-scummed, brackish water lay shallowly across the muddy lake bottom, and the boathouse itself had been left to rot. Foul-smelling water sloshed below damp, softened wood underfoot. Above their heads, the rotting roof let in glimpses of the night sky.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure Chloe should be living like this,\" Matt said slowly, not wanting to offend Stefan.\u003c/p\u003e\n\u003cp\u003eStefan\u0027s lips curled up in a bitter smile. \"The first lesson you both need to learn is that she\u0027s not living like this. She\u0027s not living at all - not anymore.\"\u003c/p\u003e\n\u003cp\u003eNext to Matt, Chloe hunched her shoulders protectively and crossed her arms. \"I feel alive,\" she muttered. Matt waited for the wry, dimpling twist of her mouth he\u0027d gotten used to from the human Chloe, but she just gazed down at her feet somberly.\u003c/p\u003e\n\u003cp\u003e\"This is what it is, Chloe,\" Stefan said to her. His voice was dispassionate. \"Until you can learn to survive without hurting humans, you can\u0027t stay near them. Any scent or sound might set you off. It takes a long time to get to the point where you can trust yourself, and until you do, you\u0027ll be skulking in the shadows, existing in the places where no human would go. Sewers. Caves. Places that make this boathouse look like luxury.\"\u003c/p\u003e\n\u003cp\u003eChloe nodded, looking up at Stefan with wide, earnest eyes. \"I\u0027ll do anything I have to,\" she said. \"This is my second chance - I understand that. I\u0027m going to fix myself.\"\u003c/p\u003e\n\u003cp\u003eStefan gave her a small smile. \"I hope so, Chloe,\" he said. Rubbing the bridge of his nose between two fingers in a familiar weary gesture, he turned to Matt. \"There are things you can do to help her,\" Stefan told him. \"She\u0027s young. It\u0027s important she have plenty of blood or she won\u0027t be able to think about anything else.\"\u003c/p\u003e\n\u003cp\u003eMatt started to speak and Stefan cut him off. \"Not your blood. Animal blood. If you go with her into the woods when she\u0027s hunting, you can help keep her grounded and away from humans. You can bring her animals when she doesn\u0027t feel like she can go out.\" Matt nodded, and Stefan turned to Chloe. \"You\u0027re fast and strong now; you\u0027ll be able to catch deer if you want to. If you concentrate, you should be able to call smaller animals - birds and rabbits - to you. You can try not to kill them if you want, but you probably will anyway, at least until you learn to control yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Stefan,\" Chloe said solemnly.\u003c/p\u003e\n\u003cp\u003e\"Practice deep breathing,\" Stefan told her. \"Meditation. Listen to your own heartbeat, learn the new slower rhythm it has now that you\u0027ve been turned. You\u0027re going to get pretty agitated sometimes, and you should find out how to calm yourself down. Do it with her, Matt. It\u0027ll help her focus.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Matt wiped his sweaty hands against his jeans and nodded again. \"We can do this.\"\u003c/p\u003e\n\u003cp\u003eHis eyes met Stefan\u0027s, and Matt was surprised by the look on the vampire\u0027s face. Despite the matter-of-fact tone Stefan had been using, he could tell Stefan was concerned. \"It\u0027s dangerous for you,\" Stefan said gently. \"I shouldn\u0027t leave you with her.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t hurt him,\" Chloe said. Her eyes filled with tears and she angrily brushed them away with the back of her hand. \"I\u0027d never hurt Matt.\"\u003c/p\u003e\n\u003cp\u003eStefan turned the same sympathetic gaze on her. \"I know you don\u0027t want to hurt him,\" he told her, \"but I also know you can hear the rushing of Matt\u0027s blood as his heart pounds, that you can smell the overwhelming sweet blood-scent of him all around you. It\u0027s hard to think straight when he\u0027s near you, isn\u0027t it? Part of you just wants to tear into him, to rip at that soft skin of his throat, to find the vein that\u0027s so full of rich, warm blood, just there below his ear.\"\u003c/p\u003e\n\u003cp\u003eChloe clenched her jaw, but the white edge of a tooth slipped past the firm line of her mouth, cutting at her lip. With a shudder, Matt realized that Chloe\u0027s sharp vampire canines had descended while Stefan was talking, that she was ready to bite.\u003c/p\u003e\n\u003cp\u003eSteeling himself, Matt pushed down the instinct to run away from her and instead moved closer and put an arm across her shoulders.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll get through this,\" he said firmly. Chloe took a deep, slow breath and then another, clearly trying to calm herself. After a moment, her shoulders relaxed a little and, looking at the looser set of her jaw, Matt thought that her teeth had gone back to normal.\u003c/p\u003e\n\u003cp\u003e\"What else should we do?\" Chloe asked Stefan, her voice determined.\u003c/p\u003e\n\u003cp\u003eStefan shrugged and stuffed his hands into his pockets. He walked back to the doorway and looked out over the dark water of the lake. \"In the end, the only thing that matters is that you really want to change,\" he said. \"If you want it enough and if your willpower is strong enough, you will. I won\u0027t lie to you, it\u0027s not easy.\"\u003c/p\u003e\n\u003cp\u003e\"I do want to,\" Chloe said, her eyes shining with tears again. \"I won\u0027t hurt anyone. That\u0027s not who I am, not even now. These last few days - I can\u0027t be that thing.\" She closed her eyes, and the tears spilled over her lashes, running in silvery lines down her cheeks.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t feed on anyone,\" Stefan warned her. \"If Matt or anyone else gets hurt, even if you\u0027re sorry, I\u0027ll do what I need to do to protect the humans here.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll kill me,\" Chloe agreed, her voice thin. Her eyes were still closed, and she hugged herself, wrapping her arms around herself defensively. \"It\u0027s okay,\" she said. \"I don\u0027t want to live like that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take responsibility for her,\" Matt said, his voice sounding loud in his own ears. \"I won\u0027t let anything bad happen.\"\u003c/p\u003e\n\u003cp\u003eChloe inched closer to him, seeming to find comfort under his arm. Matt held on to her. Chloe could be saved; he knew it. He hadn\u0027t been careful enough, hadn\u0027t realized what Ethan was. But Chloe wasn\u0027t lost to him, not yet.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Stefan said quietly, looking between them. \"Good luck.\" He shook hands with Matt and then he turned and was gone, faster than Matt\u0027s eyes could follow, no doubt headed back to Elena.\u003c/p\u003e\n\u003cp\u003eChloe pressed against Matt\u0027s side and laid her head on his shoulder. He rested his cheek on the top of her head, her dark, curly hair soft where it touched his face. This was dangerous, a small unhappy knot in his stomach reminded him, and he didn\u0027t really know what he was doing.\u003c/p\u003e\n\u003cp\u003eBut Chloe was breathing slowly beside him, and all he could think was: at least they had a chance.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, Bonnie,\" Zander said, half laughing. \"I\u0027m tough, remember? Supertough. I\u0027m a hero.\" He tugged on her hand, trying to pull her onto the bed beside him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re hurt is what you are,\" Bonnie said sharply. \"Don\u0027t try that macho stuff on me.\" She pulled her hand away and shoved an ice pack at him with her other hand. \"Put that on your shoulder,\" she ordered.\u003c/p\u003e\n\u003cp\u003eThey\u0027d met up outside the library a little while after dawn, and she\u0027d immediately seen that Zander was wounded. Back in his human form, he had seemed almost as graceful as always, running along with his Pack with his usual easy, loping stride, but he\u0027d held himself aloof from the rest of the guys\u0027 playful shoving and tussling, the rough hands-on affection that was their default mode when they weren\u0027t on duty. As he\u0027d stepped lightly out of range of Marcus\u0027s and Enrique\u0027s grappling arms and ducked away from Camden\u0027s headlock, Bonnie had realized Zander must be hurting.\u003c/p\u003e\n\u003cp\u003eSo she\u0027d taken him to the cafeteria and filled him up with eggs and bacon and the sugary cereal he loved. They\u0027d come back to Zander\u0027s dorm room and she\u0027d gotten him to take his shirt off so she could examine the damage. Normally, Bonnie would have been happily ogling Zander\u0027s chiseled abs, but right now, the purple-black bruise beginning to bloom on his shoulder and stretch down his side was ruining the view.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not really hurt, Bonnie,\" Zander insisted. \"You don\u0027t have to baby me.\" He lay back on the bed, though, and didn\u0027t try to get up, so Bonnie figured that Zander was feeling a lot worse than he was willing to admit.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get you some ibuprofen,\" she said, and he didn\u0027t argue. She rummaged through his desk until she found the bottle and rattled the last couple of pills out into his hand, then brought him a bottle of water. Zander hitched himself up onto his elbows to swallow the pills and winced.\u003c/p\u003e\n\u003cp\u003e\"Lie down,\" Bonnie told him. \"If you promise to stay in bed and try to nap, I could go get you some of my special healing tea.\"\u003c/p\u003e\n\u003cp\u003eZander grinned at her. \"Why don\u0027t you lie down with me?\" he suggested. \"I bet I\u0027d feel a lot more comfortable with you here.\" He patted the mattress next to him.\u003c/p\u003e\n\u003cp\u003eBonnie hesitated. That was actually pretty tempting. She was about to snuggle up to him when a brisk knock came on the door.\u003c/p\u003e\n\u003cp\u003eBonnie waved Zander back onto the bed as he started to rise. \"I\u0027ll get it,\" she told him. \"It\u0027s probably one of the guys.\" Not that Zander\u0027s Packmates bothered to knock much, but maybe they were using their best manners, assuming Bonnie would be there.\u003c/p\u003e\n\u003cp\u003eAnother sharp tap came as Bonnie crossed the room. \"All right, hold your horses,\" she muttered, opening the door.\u003c/p\u003e\n\u003cp\u003eIn the hallway, her hand raised to knock yet again, stood a complete stranger, a girl with hair cut in a long blond bob. Her small, precise features mirrored Bonnie\u0027s own surprise.\u003c/p\u003e\n\u003cp\u003e\"Is Zander here?\" the girl asked, frowning.\u003c/p\u003e\n\u003cp\u003e\"Um,\" Bonnie said, feeling thrown. \"Yeah, he\u0027s . . .\"\u003c/p\u003e\n\u003cp\u003eThen Zander came up behind her. \"Well, hi, Shay,\" he said, his voice slightly unsure. He was smiling, though. \"What\u0027re you doing here?\"\u003c/p\u003e\n\u003cp\u003eThe girl - Shay, Bonnie thought, what kind of name was that? - glanced at Bonnie instead of answering, and Zander flushed. \"Oh,\" he said. \"Yeah, Bonnie, this is Shay, who\u0027s a friend from back home. Shay, this is my girlfriend, Bonnie.\"\u003c/p\u003e\n\u003cp\u003e\"Nice to meet you, Bonnie,\" Shay said coolly, raising one eyebrow. Her eyes traced over Zander\u0027s naked chest, lingering for a moment on the purpling bruise, and his cheeks flushed pink. \"Been busy?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Come on in,\" he said, and backed away from the door, reaching for his shirt. \"I, uh, was just putting some ice on my shoulder.\"\u003c/p\u003e\n\u003cp\u003e\"Nice to meet you, too,\" Bonnie said, a little late, as she made room for Shay to pass her. Since when did Zander have female friends? Other than Bonnie, and Bonnie\u0027s friends, he lived in an exclusively male world.\u003c/p\u003e\n\u003cp\u003e\"I need to talk to you. Alone,\" Shay said to Zander, shooting him a meaningful look and then cutting her eyes sharply to Bonnie.\u003c/p\u003e\n\u003cp\u003eZander rolled his eyes. \"Subtle, Shay,\" he said. \"But it\u0027s okay. Bonnie knows about me and the rest of the Pack.\"\u003c/p\u003e\n\u003cp\u003eA second eyebrow climbed up Shay\u0027s forehead to join the first. \"Do you think that\u0027s wise?\" she asked.\u003c/p\u003e\n\u003cp\u003eZander\u0027s lips quirked into the half smile Bonnie loved. \"Believe me, it\u0027s not the weirdest thing Bonnie knows,\" he said.\u003c/p\u003e\n\u003cp\u003e\"O-kay,\" Shay said slowly. She fixed Bonnie with a long, speculative look and Bonnie stuck out her chin defiantly and glared right back at her. Finally, Shay shrugged. \"I guess I lost my right to give you advice a while back,\" she said, then lowered her voice, as if she was afraid someone might be eavesdropping from the hallway. \"The High Wolf Council sent me,\" she said quietly. \"They\u0027re not happy with what they\u0027re hearing about the vampires at Dalcrest. They thought maybe I could help you guys find some direction.\"\u003c/p\u003e\n\u003cp\u003eZander\u0027s jaw tightened. \"Our direction\u0027s fine, thanks,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh, don\u0027t be like that,\" Shay said. \"I\u0027m not trying to Alpha you.\" She reached out and touched his arm lightly, letting her hand linger on it. \"It was a good excuse to come visit,\" she said, even more softly. \"I was sorry about how things ended the last time we saw each other.\"\u003c/p\u003e\n\u003cp\u003eBonnie glanced down at herself. Shay was so focused on Zander that Bonnie had started to wonder if maybe she had disappeared and left them thinking they were alone together. But nope, same solid Bonnie.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said, startled, as everything Shay had said suddenly clicked into place. \"You\u0027re a werewolf.\"\u003c/p\u003e\n\u003cp\u003eShe should have seen it immediately: despite Shay\u0027s neat, swinging bob and feminine features, she moved the same way Zander and his Pack did, with a kind of solid grace, as if she was completely aware at all times of her body, without even having to think about it. And she had touched Zander the way he touched the guys in his Pack, easy and as if her body was almost part of his own.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t touch Bonnie that way. Not that Bonnie had any complaints at all about the way Zander did touch her, which was sweet and sure and as if she was the most precious thing he\u0027d ever held. But still, it wasn\u0027t quite the same.\u003c/p\u003e\n\u003cp\u003eThere was no one there to overhear, but Shay pinned Bonnie with a glare. \"Keep your voice down,\" she whispered fiercely.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Bonnie said. \"I just didn\u0027t know there were girl Original werewolves.\"\u003c/p\u003e\n\u003cp\u003eShay\u0027s lips curved into a smirk. \"Sure,\" she said. \"Where do you think all the little Original werewolves come from?\"\u003c/p\u003e\n\u003cp\u003e\"The High Wolf Council usually divides younger wolves up into Packs of either guys or girls when they send us out to keep an eye on things,\" Zander told Bonnie. \"They think mixing together distracts us from our jobs.\"\u003c/p\u003e\n\u003cp\u003e\"Apparently they\u0027re not considering the other ways some of us can get distracted,\" Shay said acidly. Her eyes were cold on Bonnie\u0027s, but Bonnie hadn\u0027t been through hell and back in the last year to let any bossy and self-important werewolf girl push her around.\u003c/p\u003e\n\u003cp\u003eBonnie was just opening her mouth to tell Shay that she\u0027d better lose the attitude when Zander, seeming to sense her reaction, grabbed hold of Bonnie\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"Listen, Shay, I really need to get some rest,\" he said quickly. \"We\u0027ll catch up later, okay? Call me or one of the other guys and we\u0027ll get together.\" Bonnie had a brief impression of Shay looking startled, and then Zander hurried Shay right out of the room and shut the door behind her.\u003c/p\u003e\n\u003cp\u003e\"So . . . friend from back home?\" Bonnie asked after a moment. \"I don\u0027t think you\u0027ve mentioned her before.\"\u003c/p\u003e\n\u003cp\u003e\"Um,\" Zander said. His gorgeous long lashes brushed his cheeks as he looked down, away from Bonnie, and she might have been distracted by how sweet that made him look. Except that Zander also looked distinctly guilty.\u003c/p\u003e\n\u003cp\u003eBonnie suddenly felt her stomach sink. \"Is there something you\u0027re not telling me?\" she asked. Zander shifted uncomfortably from one foot to the other, his cheeks flushing, and Bonnie\u0027s stomach plummeted even further. \"No more secrets, remember?\"\u003c/p\u003e\n\u003cp\u003eZander sighed. \"I just think this is going to sound like a bigger deal than it is,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Zander,\" Bonnie said.\u003c/p\u003e\n\u003cp\u003e\"The High Wolf Council wanted Shay and me to be together,\" Zander confessed. He glanced up at her tentatively through his lashes. \"They, um, I guess thought we\u0027d be like mates? Get married, maybe, and have werewolf children together when we finished school. They thought we\u0027d make a good team.\"\u003c/p\u003e\n\u003cp\u003eBonnie blinked. Her brain felt numb, she realized. Zander and Shay had thought about getting married?\u003c/p\u003e\n\u003cp\u003e\"But we couldn\u0027t get along,\" Zander said hurriedly. \"I swear, Bonnie, we just never clicked. We fought, like, all the time. So we broke up.\"\u003c/p\u003e\n\u003cp\u003e\"Uh,\" Bonnie said. She was so blindsided by this, it felt like a huge effort to even put words together. \"So the High Wolf Council controls who you marry?\" she asked finally, picking the most general of the questions swarming her mind.\u003c/p\u003e\n\u003cp\u003e\"They try,\" Zander said, looking at her anxiously. \"They can\u0027t . . . they can\u0027t make me do anything I don\u0027t want to do. And they wouldn\u0027t want to. They\u0027re fair.\" His sky-blue eyes, that heavenly tropical blue, caught hers, and he smiled tentatively, his hands warm on her shoulders. \"You\u0027re the one I love, Bonnie,\" he said. \"Believe me.\"\u003c/p\u003e\n\u003cp\u003e\"I do believe you,\" Bonnie said, because she did; it was shining out of Zander\u0027s eyes. And she loved him, too. Zander flinched a little as she hugged him, and Bonnie loosened her arms, mindful of his bruises. \"It\u0027s okay,\" she said softly.\u003c/p\u003e\n\u003cp\u003eBut even as she turned her face up to Zander\u0027s kiss, Bonnie couldn\u0027t help the word that resounded in her mind, making her twitch with anxiety.\u003c/p\u003e\n\u003cp\u003eUh-oh.\u003c/p\u003e\n\u003cp\u003eStefan and Elena curled together on his bed, her head on his shoulder. Stefan let himself relax under her touch, feeling the softness of her hair against his cheek. It had been a seemingly endless day. But Elena was safe, for now. Just for this moment, she was in Stefan\u0027s arms and nothing would hurt her. He tightened his hold on her.\u003c/p\u003e\n\u003cp\u003e\"Is Chloe going to be all right?\" Elena asked.\u003c/p\u003e\n\u003cp\u003eStefan bit back an incredulous little laugh and the corners of Elena\u0027s lips turned up in response. \"What?\" she said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re worried about Chloe,\" Stefan said. \"Klaus has promised to kill you, and you want to hear if Chloe, who you barely knew when she was human, is going to be all right.\" He should have known, though. Elena had a core of steel running through her. And nothing was more important to her than protecting her friends, her town, the world.\u003c/p\u003e\n\u003cp\u003eMaybe, Stefan thought, she\u0027s always been a Guardian.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t stopped thinking about what Klaus said,\" Elena told him, and Stefan felt her body shudder against his. \"I\u0027m afraid. But I can\u0027t stop caring about everyone else, either. Matt needs Chloe, so she matters to me, too. I worry that there might not be a lot of time left. We should all be with the people we love.\" She kissed Stefan, just a light brush of her lips on his. When she spoke again, her voice trembled. \"We just found each other again, Stefan. I don\u0027t want to miss anything. All I want to do is hold on to you.\"\u003c/p\u003e\n\u003cp\u003eStefan kissed her, more deeply this time. I love you, he told her silently. I will protect you with my life.\u003c/p\u003e\n\u003cp\u003eElena broke the kiss and smiled at him, her eyes full of tears. \"I know,\" she said. \"I love you, too, Stefan, so much.\" She pulled her hair back and tilted her head invitingly, exposing her long slender throat. Stefan hesitated - it had been so long, not since before they broke up and came back together - but she drew his mouth down to her throat.\u003c/p\u003e\n\u003cp\u003eThe rush of Elena\u0027s blood - so intoxicating, so full of vitality that it was like champagne and sweet nectar at the same time - made Stefan light-headed, flooding him with warmth. There were no barriers between them, no walls, and he felt a great wonder at the steadfast tenderness that he found in Elena.\u003c/p\u003e\n\u003cp\u003eThey fell asleep wrapped around each other. Darkness threatened them on all sides, but for this night, they would be together, be each other\u0027s light. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3/page-9.html","bookId":2123,"creation":"Oct 5, 2019 6:04:14 PM","modification":"Oct 5, 2019 6:04:14 PM"}
