{"id":67709,"no":23,"title":"Page 23","content":"\u003cp\u003eJack chuckled. “About the time I married you.”\u003c/p\u003e\n\u003cp\u003e“Good answer.”\u003c/p\u003e\n\u003cp\u003e“You still interested in that shower?” Olivia asked in a sultry voice as they neared the house.\u003c/p\u003e\n\u003cp\u003e“You bet I am.” Her question added an extra bounce to his step.\u003c/p\u003e\n\u003cp\u003eOlivia broke into an unhurried trot. “Wanna race?”\u003c/p\u003e\n\u003cp\u003eJack declined. “I think I’d better conserve my strength—for later.”\u003c/p\u003e\n\u003cp\u003e“Excellent idea. Otherwise I might wear you out completely and I wouldn’t want to do that.”\u003c/p\u003e\n\u003cp\u003eJack cast her a teasing, sexy look. “Oh, but I was hoping you’d at least try.”\u003c/p\u003e\n\u003cp\u003eOlivia couldn’t keep from giggling like a schoolgirl. One of the great gifts of her marriage was laughter. Jack tended to see the humor in situations, even serious ones, and he could be a very clever mimic. “I don’t know what I ever did without you, Jack Griffin.”\u003c/p\u003e\n\u003cp\u003e“I don’t, either.”\u003c/p\u003e\n\u003cp\u003e“We don’t have anything planned for this evening, do we?” he asked.\u003c/p\u003e\n\u003cp\u003e“Well…” Olivia hated to break this to him. “Actually, we do.”\u003c/p\u003e\n\u003cp\u003e“We do?” Jack whined.\u003c/p\u003e\n\u003cp\u003e“Grace and Cliff invited us to dinner to give Cal a nice send-off to Wyoming.”\u003c/p\u003e\n\u003cp\u003e“He needs us to send him off?”\u003c/p\u003e\n\u003cp\u003eOlivia would rather stay home, too, but she’d promised her friend. “I told Grace we’d be there.”\u003c/p\u003e\n\u003cp\u003eJack gave a deep, resigned sigh. “What’s Grace cooking?”\u003c/p\u003e\n\u003cp\u003e“I didn’t ask.”\u003c/p\u003e\n\u003cp\u003e“I’m going to need lots of incentives. Like her rib roast and those mashed potatoes she does.”\u003c/p\u003e\n\u003cp\u003eThey reached the house and Olivia jogged up the steps only to find Jack surging ahead of her. “Jack,” she cried when he entered the house. He hadn’t bothered to wait for her, either. “Where are you going?”\u003c/p\u003e\n\u003cp\u003eHe looked back, raising his eyebrows. “To turn on the shower, of course.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Olivia echoed. “I’m right behind you.”\u003c/p\u003e\n\u003cp\u003eNineteen\u003c/p\u003e\n\u003cp\u003eEver since the phone call from Anson, Allison had been waiting, waiting for him to contact her again. It’d been almost three weeks, and she was afraid she wouldn’t hear from him a second time. As graduation grew closer, she hoped and prayed that the investigators would uncover something, anything, to prove his innocence.\u003c/p\u003e\n\u003cp\u003e“Dinner,” her mother shouted from the kitchen. Allison reluctantly left her bedroom. After her parents had remarried, they’d insisted on eating as a family every night. Sometimes, like this evening, Allison considered it a major pain, but mostly she enjoyed it. Silly though it sounded, eating together had brought them all closer. With everyone’s hectic schedule, the habit had fallen by the wayside, and Allison hadn’t thought she’d really missed it. But if sitting down with her family at dinnertime helped keep her parents’ marriage intact, she’d do it.\u003c/p\u003e\n\u003cp\u003eHer mother had cooked Eddie’s favorite meal tonight, spaghetti and meatballs. That should make her little brother happy, since food, computer games and basketball were his three passions. She remembered how much Anson liked Eddie and had even played basketball with him a few times.\u003c/p\u003e\n\u003cp\u003eWithout being asked, Allison set the salad on the table and brought out two bottles of dressing from the refrigerator door. Her mother thanked her with a smile.\u003c/p\u003e\n\u003cp\u003eHer father sliced the French bread while Eddie sat at the table waiting. Typical boy attitude. Like it was his right to have everyone wait on him.\u003c/p\u003e\n\u003cp\u003eAfter saying grace, they passed everything around and Allison served herself some salad and just enough spaghetti to deter any comments or questions. Her appetite hadn’t been good since Anson’s disappearance and she’d lost several pounds. Again and again she’d reviewed their brief phone conversation. He’d told her so little, for fear of putting himself at risk. The less she knew, the better. Allison understood that. Still, she couldn’t help worrying about him.\u003c/p\u003e\n\u003cp\u003e“How was school?” her mother asked.\u003c/p\u003e\n\u003cp\u003eEddie shrugged, digging into his meal with unrestrained gusto. He was already taller than Allison and still growing. “Bor-ing.”\u003c/p\u003e\n\u003cp\u003e“Allison?” Her mother turned to her.\u003c/p\u003e\n\u003cp\u003e“Okay, I guess. I got accepted into the University of Washington.” The letter had come that afternoon.\u003c/p\u003e\n\u003cp\u003eHer father set his fork down and stared at her. “You’re only thinking to mention that now?”\u003c/p\u003e\n\u003cp\u003eShe nodded carelessly. “I knew I’d get in.”\u003c/p\u003e\n\u003cp\u003e“Such confidence,” her mother said, looking at Zach with a smile.\u003c/p\u003e\n\u003cp\u003e“Congratulations, Allison.” Her father raised his water glass, and the others joined in the toast.\u003c/p\u003e\n\u003cp\u003eReally, Allison couldn’t see what all the fuss was about. Both of her parents had attended UW and it was expected that she would, too. She’d encouraged Anson to apply for a scholarship there, and if he’d stayed in school, if he’d pursued it, she was positive he would’ve been accepted.\u003c/p\u003e\n\u003cp\u003eNo one seemed to realize how intelligent Anson was. He picked up languages easily, as she’d mentioned to his mother; he’d also helped Allison get through her chemistry class. Without him she would barely have passed. All that stuff came to him with very little effort.\u003c/p\u003e\n\u003cp\u003e“What about you, honey?” her mother asked, directing the question to Zach.\u003c/p\u003e\n\u003cp\u003e“I attended the Rotary meeting this afternoon and sat with Seth Gunderson.”\u003c/p\u003e\n\u003cp\u003eAllison’s ears perked up. She kept a file with whatever she could find out about the Gundersons, the restaurant and the fire. Obviously, she didn’t possess the resources or the finesse of the authorities, but she collected every bit of information she could.\u003c/p\u003e\n\u003cp\u003e“How are Seth and his family doing now?” her mother asked.\u003c/p\u003e\n\u003cp\u003e“All right, it seems. He’s selling boats.”\u003c/p\u003e\n\u003cp\u003e“Boats?” Eddie echoed, a smear of tomato sauce on his chin. “That’s a switch, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Not really. He was a fisherman before he went into the restaurant business,” Zach explained.\u003c/p\u003e\n\u003cp\u003e“Oh.” Uninterested, Eddie returned to his meal.\u003c/p\u003e\n\u003cp\u003e“Apparently the arson investigators found a cross in the fire,” her father added. “There was a picture of it in last night’s paper. Seth hopes someone might recognize it and come forward.”\u003c/p\u003e\n\u003cp\u003eAllison froze. She hadn’t read yesterday’s paper.\u003c/p\u003e\n\u003cp\u003e“What an interesting twist.” Her mother met Allison’s gaze, and Allison didn’t dare look away.\u003c/p\u003e\n\u003cp\u003e“Has anyone come forward?” she asked, her heart in her throat. Anson had worn a pewter cross. That didn’t mean anything, she was quick to tell herself. “But whoever wore it might not be responsible for the fire,” she said. “It could’ve belonged to anyone, right?”\u003c/p\u003e\n\u003cp\u003eBoth her parents and Eddie stared at her.\u003c/p\u003e\n\u003cp\u003e“What makes you ask?” her father asked, watching her intently.\u003c/p\u003e\n\u003cp\u003eAllison lowered her head and swallowed hard. “No reason,” she mumbled. Only there was…. As soon as she could do it discreetly, she was going to find that newspaper and take a look.\u003c/p\u003e\n\u003cp\u003eNo one at school had said anything about the article, not anyone, and Allison knew why. They were afraid to; afraid she’d get defensive and angry the way she always did when anyone dared suggest Anson was involved in the fire.\u003c/p\u003e\n\u003cp\u003eWhen dinner was over, Allison escaped to the privacy of her bedroom. Her mother, who had an uncanny ability to read her moods, came to see her shortly afterward. She held the local newspaper.\u003c/p\u003e\n\u003cp\u003eAllison pretended not to notice.\u003c/p\u003e\n\u003cp\u003e“Don’t you want to see the picture?” her mother asked, sitting on the bed beside her.\u003c/p\u003e\n\u003cp\u003eAllison thought of lying and acting as if it didn’t matter at all. Instead, she shrugged. “I suppose,” she said in a dispassionate voice.\u003c/p\u003e\n\u003cp\u003e“Anson wore a big cross, didn’t he?” her mother asked gently.\u003c/p\u003e\n\u003cp\u003e“It’s not his,” she said before she’d even glanced at the photograph. “And even if it is, that doesn’t mean anything.”\u003c/p\u003e\n\u003cp\u003eHer mother was slow in answering. “It might not. But then again, it might.”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t do it, Mom,” Allison insisted and although her mother didn’t argue, Allison wondered who she was working so hard to convince—her family or herself.\u003c/p\u003e\n\u003cp\u003eHer mother handed Allison the paper, which was open to the picture. One look, and Allison closed her eyes, so sick at heart that she couldn’t bear to read the caption or the article below the photograph.\u003c/p\u003e\n\u003cp\u003e“Anson wore a cross like this?” her mother asked.\u003c/p\u003e\n\u003cp\u003eAllison bit her lower lip hard and nodded.\u003c/p\u003e\n\u003cp\u003e“You need to tell the sheriff you recognize it as his, sweetheart.”\u003c/p\u003e\n\u003cp\u003eA sob threatened to burst from her chest, but Allison managed to hold it back. “I will.”\u003c/p\u003e\n\u003cp\u003eRosie slid her arm around Allison’s shoulders. “I’m sorry,” she whispered.\u003c/p\u003e\n\u003cp\u003eUnable to speak, Allison nodded again. “It’s not him,” she said. “It’s not Anson.” He wouldn’t lie to her. He’d told her he hadn’t started the fire and she believed him.\u003c/p\u003e\n\u003cp\u003eAfter a moment, her mother stood and left the room. Allison remained on the edge of her bed. She had to think, to sort everything out. Whenever she least wanted to remember it, the conversation with his mother kept running through her mind.\u003c/p\u003e\n\u003cp\u003ePlaying with matches. According to her, Anson had nearly burned the house down as a youngster. Later he’d started a brush fire with friends and then there was the toolshed at the park. Fires fascinated him; his mother had been quick to tell her that. According to Cherry, he was just setting bigger ones now.\u003c/p\u003e\n\u003cp\u003eEven his own mother thought Anson was responsible for burning down The Lighthouse. The only person who still believed in him was Allison. And yet every shred of evidence she’d collected pointed directly at him.\u003c/p\u003e\n\u003cp\u003eFor the first time, her faith in Anson wavered. She wanted to believe, and prayed that he was innocent. But how could she maintain her faith in the face of everything she’d learned?\u003c/p\u003e\n\u003cp\u003eThe phone rang, and on the slight chance that it might be Anson, Allison leaped on it before Eddie could.\u003c/p\u003e\n\u003cp\u003e“Hello,” she said, hoping she didn’t sound as breathless as she felt.\u003c/p\u003e\n\u003cp\u003e“Allison, it’s Kaci. Did you get your acceptance from UW?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m in.”\u003c/p\u003e\n\u003cp\u003e“Me, too. Want to go out and celebrate?”\u003c/p\u003e\n\u003cp\u003eAllison didn’t feel much like celebrating. “Not really.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong? You sound really down.”\u003c/p\u003e\n\u003cp\u003eKaci was Allison’s best friend. “Anson,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Come on, Allie, you’ve got to stop pining for him. He’s the one who walked out on you. Remember?”\u003c/p\u003e\n\u003cp\u003eAllison didn’t say anything, couldn’t say anything.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean that,” Kaci said apologetically.\u003c/p\u003e\n\u003cp\u003e“I know,” Allison assured her and then, because it all seemed so hard, she started to cry. “Oh, Kaci, I think he might’ve done it.”\u003c/p\u003e\n\u003cp\u003e“No way! Hold on, I’m coming over.”\u003c/p\u003e\n\u003cp\u003eBefore Allison could protest, the line was disconnected.\u003c/p\u003e\n\u003cp\u003eTen minutes later, the doorbell rang. Allison didn’t go out to greet her friend. If her parents saw her tears, they’d be asking questions and she couldn’t cope with that right now. Kaci let herself into Allison’s room and immediately flopped down on the bed. “All right, talk.” \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-23.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
