{"id":67713,"no":27,"title":"Page 27","content":"\u003cp\u003eJay and Lana were former classmates and good friends. With the restaurant demanding so much of their time, Seth and Justine had rarely seen any of their friends in the last few years.\u003c/p\u003e\n\u003cp\u003e“After dinner,” Seth went on, interrupting her thoughts, “I have another small surprise for you.”\u003c/p\u003e\n\u003cp\u003e“Better than stealing me away for a celebration dinner with friends?” This was more than they’d done in months and months; when they were operating The Lighthouse, they’d simply never had the time.\u003c/p\u003e\n\u003cp\u003e“Much better,” Seth promised in a low voice.\u003c/p\u003e\n\u003cp\u003e“I’ll finish up here,” she said, glancing at the clock. The bank closed later on Fridays; however, she planned to leave at six. “Then I’ll go home and change.”\u003c/p\u003e\n\u003cp\u003e“Not necessary,” Seth told her.\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, why don’t you leave now?” Her boss stepped up to her desk. He winked at Seth, and Justine wondered how much Frank knew about this surprise of her husband’s.\u003c/p\u003e\n\u003cp\u003e“Should I drive out and meet you in Silverdale?” she asked, reaching into the bottom drawer for her purse.\u003c/p\u003e\n\u003cp\u003e“No need to do that, either,” Seth said, taking her arm in his.\u003c/p\u003e\n\u003cp\u003e“But my car…”\u003c/p\u003e\n\u003cp\u003e“Is at home.”\u003c/p\u003e\n\u003cp\u003eJustine’s jaw sagged. “When did that happen?” She’d driven to work that morning and parked it at the far end of the lot, where employees left their vehicles.\u003c/p\u003e\n\u003cp\u003e“Jay and I came by earlier,” Seth explained. “I picked up your car and then drove back here.”\u003c/p\u003e\n\u003cp\u003e“I would like to change clothes.” If they were going out for the evening, she’d prefer to wear something fancier than business attire.\u003c/p\u003e\n\u003cp\u003e“I figured as much, so I brought another outfit with me.” He opened the bank door as he spoke and they walked toward his car, parked near the entrance.\u003c/p\u003e\n\u003cp\u003e“Very cute, Seth, and where am I supposed to change? A gas station restroom? I don’t think so.” She leaned against his car. “I suppose I could use the employee bathroom, but…”\u003c/p\u003e\n\u003cp\u003e“Hmm, that’s a good point,” he muttered, his eyes bright with love and anticipation. “I guess I’ll just have to take you to the hotel earlier than I’d planned.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“We have a hotel room for the night, complete with champagne.”\u003c/p\u003e\n\u003cp\u003e“Oh, my goodness.” Justine covered her mouth. “Pinch me, because I must be dreaming.”\u003c/p\u003e\n\u003cp\u003eSeth brought his arms around her waist and laughed. “Why don’t I kiss you, instead?”\u003c/p\u003e\n\u003cp\u003eThis was an offer she couldn’t refuse. “It’s a deal.”\u003c/p\u003e\n\u003cp\u003eThe evening was everything Justine could have imagined, and more. After a lengthy dinner with excellent wine, the four of them drove to the hotel and had drinks in the elegant lounge while a three-piece ensemble played. Justine needed a couple of mixed drinks to fuel her courage before she agreed to step onto the dance floor. She was glad she did. Any excuse to have Seth’s arms around her was worth potential embarrassment.\u003c/p\u003e\n\u003cp\u003eJay and Lana had to get home to relieve their babysitter and left at midnight. Shortly after that, Seth was feigning a yawn.\u003c/p\u003e\n\u003cp\u003e“All right, all right,” Justine teased. “I’ve got the message.”\u003c/p\u003e\n\u003cp\u003eSmiling, Seth reached for her hand. In the elevator, he stood behind her, arms around her waist as he kissed the side of her neck. “I’m ready to collect on all those promises you’ve been sending my way all evening.”\u003c/p\u003e\n\u003cp\u003e“And what about that surprise you promised me?”\u003c/p\u003e\n\u003cp\u003e“You’ll see when we get to the room.”\u003c/p\u003e\n\u003cp\u003e“Oh, Seth, I love you so much.” She turned in his arms and held him close. It felt as if she had her husband back at last—as if the burdens of the months since the fire had fallen away.\u003c/p\u003e\n\u003cp\u003e“Just wait until you see what I bought you to wear to bed,” he whispered with a low groan—obviously picturing her in it.\u003c/p\u003e\n\u003cp\u003e“Do you really want me to take the time to change?” she whispered.\u003c/p\u003e\n\u003cp\u003e“True,” Seth murmured. “No, don’t bother. The minute you put it on, I’ll be taking it off.”\u003c/p\u003e\n\u003cp\u003eJustine closed her eyes and smiled. “That’s what I thought.”\u003c/p\u003e\n\u003cp\u003eThe elevator doors glided open, and Seth swung her into his powerful arms as though she weighed next to nothing. He headed down the long hallway toward their room. It was a small comedy of errors as he tried to hold her while attempting to open the door with the room card. Justine dissolved into giggles and then they were both laughing. He had to put her down before he managed to get the door unlocked.\u003c/p\u003e\n\u003cp\u003eSeth didn’t bother to turn on the lights. He shut the door and pressed her against it, kissing her with hot, urgent hunger.\u003c/p\u003e\n\u003cp\u003e“Oh, Seth,” she breathed, her head spinning. “I was so afraid I’d lost you.”\u003c/p\u003e\n\u003cp\u003e“Never.” His hands worked at the tiny buttons on her silk blouse. “I think you’d better get out of this before I accidentally rip something.”\u003c/p\u003e\n\u003cp\u003eShe giggled again and took over the task of unbuttoning the blouse.\u003c/p\u003e\n\u003cp\u003eThey made love that night and again in the morning. Lying there, spent, Justine felt utterly relaxed in her husband’s arms, utterly tranquil and at peace.\u003c/p\u003e\n\u003cp\u003e“Seth,” she whispered, thinking aloud. “I need to ask you something.”\u003c/p\u003e\n\u003cp\u003e“Anything.” He stroked her bare back, letting his hand roam from her shoulder blades to the curve of her waist.\u003c/p\u003e\n\u003cp\u003e“After a night out—the first one in over a year—are you sure you want to rebuild the restaurant?”\u003c/p\u003e\n\u003cp\u003eHis hand stilled, and she feared she’d destroyed the moment.\u003c/p\u003e\n\u003cp\u003e“I don’t know anymore, Justine. I just don’t know.”\u003c/p\u003e\n\u003cp\u003eTwenty-Three\u003c/p\u003e\n\u003cp\u003eOn Sunday at noon, Nate drove to Rachel’s with a picnic lunch. She met him on the sidewalk outside her front door, too eager to wait. Throwing herself into his arms, she sighed as he hugged and kissed her. It was weeks since they’d spent more than a couple of hours together.\u003c/p\u003e\n\u003cp\u003eHis work schedule was hectic, but so was hers. Her days off were Sunday and Monday, although lately she’d been working Mondays, too. As soon as the navy wives had gotten word that she did both hair and nails, her schedule had started filling up. Her bookings were practically overlapping. The money was great, but she needed a break.\u003c/p\u003e\n\u003cp\u003e“Where would you like to go?” Nate asked, smiling down at her.\u003c/p\u003e\n\u003cp\u003e“How about Point Defiance Park?” she suggested. The Tacoma park was always lovely, but especially at this time of year with the rhododendrons and azaleas in bloom.\u003c/p\u003e\n\u003cp\u003e“Perfect.” Nate kissed the top of her head. “I can have you all to myself?”\u003c/p\u003e\n\u003cp\u003e“Of course.” Rachel knew the question referred to the time she spent with Jolene. Nate didn’t complain much, but he wasn’t pleased—and she realized it was her relationship with Bruce that troubled him, not her friendship with the little girl.\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eThe day could not have been more ideal for their outing. The sun shone brightly in a clear blue sky, and a light breeze blew off the cove. Rachel grabbed her sweater, then slipped into the front seat of Nate’s convertible, a relatively new acquisition. He’d chosen a candy-apple red and she’d fallen in love with it the minute he’d brought it over the first time.\u003c/p\u003e\n\u003cp\u003eThe wind blew her hair into total chaos, not that Rachel cared. She was with Nate, and they had the whole day together. The weather was a bonus, but it wouldn’t have mattered if the skies had opened and drenched them with rain. In that case, they would’ve had their picnic on her living room floor.\u003c/p\u003e\n\u003cp\u003eThey wandered through the park, finally choosing a secluded spot where Nate spread out a blanket. The picnic basket boasted fried chicken, potato salad, rolls and coleslaw, which Nate had picked up at a chicken franchise before coming to collect her. He’d also brought some white wine that was way more expensive than anything she ever chose.\u003c/p\u003e\n\u003cp\u003eWhen they’d eaten, Nate sprawled out with his head nestled in her lap. Rachel lazily stroked his hair and savored this peaceful afternoon together. Nate’s eyes drifted shut and Rachel discovered that she felt sleepy, too. The sun’s warmth, the wine and the food and, most of all, being with Nate produced a sense of well-being and uncomplicated joy.\u003c/p\u003e\n\u003cp\u003eThe tranquility of the moment was shattered by the shrill ring of Nate’s cell phone.\u003c/p\u003e\n\u003cp\u003eJerking upright, Nate frowned and reached for the phone, clipped to his waist. “Hello,” he answered tersely. But then his demeanor changed and he relaxed.\u003c/p\u003e\n\u003cp\u003eAfter a minute or two of conversation, Rachel realized it was Nate’s mother on the phone.\u003c/p\u003e\n\u003cp\u003e“A political rally for Dad,” he repeated. He looked at Rachel and smiled reassuringly. “In October. I can request leave, but Mom, there’s no guarantee. Yes, yes, of course, I understand this is important. I’ll do what I can.” He touched his index finger to his mouth and kissed it, then pressed it against Rachel’s lips.\u003c/p\u003e\n\u003cp\u003eShe smiled and brought his finger into her mouth and gently sucked on it.\u003c/p\u003e\n\u003cp\u003eNate darted her a warning glance before he withdrew his finger.\u003c/p\u003e\n\u003cp\u003e“I’m with Rachel,” he said unexpectedly. “This would be a good time to introduce yourself.”\u003c/p\u003e\n\u003cp\u003eA feeling of dread washed over her. Nate’s powerful, wealthy family made her feel insecure. Her sole disagreement with him while he was away at sea for six months had been about the difference between their stations in life. In defiance of his father, Nate had enlisted in the navy and, through his own skills, had risen to the grade of warrant officer, the highest of any noncommissioned rank.\u003c/p\u003e\n\u003cp\u003eApparently Nate had something else to prove to his father, and she was afraid that something was his relationship with her. Rachel’s biggest fear was that dating her was another act of defiance on his part, although Nate fervently assured her otherwise.\u003c/p\u003e\n\u003cp\u003eNevertheless, Rachel kept a close guard on her heart. She was apprehensive, justifiably so, in her opinion. Still she found herself drawn to him despite everything. She treasured the hours they could spend together and looked forward to their conversations. Even when he wasn’t at sea, they e-mailed each other often. Rachel sometimes used the computer at the salon during her breaks, although privacy wasn’t exactly in great supply.\u003c/p\u003e\n\u003cp\u003e“Here, why don’t you talk to Rachel,” Nate said next and without warning handed her the cell phone.\u003c/p\u003e\n\u003cp\u003eShe glared at him and shook her head, refusing to accept it. Nate insisted, however, and given no choice, she took the cell.\u003c/p\u003e\n\u003cp\u003e“Hello, Mrs. Olsen, this is Rachel Pendergast,” she said, making a face at him.\u003c/p\u003e\n\u003cp\u003eNate smiled and brought her right hand to his mouth, sucking on her finger. She yanked it away and turned around so she could concentrate on his mother.\u003c/p\u003e\n\u003cp\u003e“Hello, Rachel,” his mother greeted her warmly. “It’s nice to finally get a chance to meet you, even if it is over my son’s cell. And please, call me Patrice.”\u003c/p\u003e\n\u003cp\u003e“All right, Patrice,” she said, nearly stumbling over the name. “It’s lovely to meet you, too.” Rachel’s heart felt lodged in her throat as she struggled to think of some appropriate comment.\u003c/p\u003e\n\u003cp\u003e“You certainly seem to have captured our son’s interest.”\u003c/p\u003e\n\u003cp\u003eRachel glanced over her shoulder and exchanged a smile with Nate. “He’s wonderful.” \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-27.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
