{"id":67715,"no":29,"title":"Page 29","content":"\u003cp\u003eBen’s son, David, stood on the porch.\u003c/p\u003e\n\u003cp\u003e“David!” she burst out before she could stop herself.\u003c/p\u003e\n\u003cp\u003eHer husband hesitated, then invited him in.\u003c/p\u003e\n\u003cp\u003e“This is unexpected,” Ben said, and if David didn’t notice Ben’s lack of welcome, Charlotte did.\u003c/p\u003e\n\u003cp\u003e“You’re just in time for lunch.” Charlotte felt obliged to include him. “I have homemade tomato basil soup and toasted cheddar cheese sandwiches.”\u003c/p\u003e\n\u003cp\u003e“I’m sure my son has other plans,” Ben said, his voice unemotional.\u003c/p\u003e\n\u003cp\u003eDavid, impeccably dressed as always, looked uncertain. “I can stay,” he said, “but I don’t want to intrude.”\u003c/p\u003e\n\u003cp\u003e“Of course you’re not intruding! Now what brings you to Cedar Cove?” Charlotte asked, joining her husband.\u003c/p\u003e\n\u003cp\u003eDavid seemed surprised by the question. “I came to visit you. I was in Seattle on business, and it’s been several months since we saw each other. I felt I should at least make an effort to visit my own father.”\u003c/p\u003e\n\u003cp\u003e“What a good idea,” Charlotte said, leading him to the sofa. “Lunch will be ready in a few minutes.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Charlotte.” He sent her a smile. David Rhodes was an attractive man, but unfortunately she’d discovered that he wasn’t to be trusted. It was a sad reality they had to come to terms with. Still, he was Ben’s son and as such, was welcome in her home.\u003c/p\u003e\n\u003cp\u003eRemaining stoic and unemotional, Ben sat down opposite his son. “I appreciate the check, David,” he said after an awkward silence. He leaned back in his chair, crossing his arms. “However, it bounced.”\u003c/p\u003e\n\u003cp\u003eDavid’s eyes flew open as though in shock. “Oh, my goodness, Dad, I’m really sorry. I had no idea. Why didn’t you say anything?”\u003c/p\u003e\n\u003cp\u003eCharlotte wanted to stay and listen, but she dared not or their lunch would be ruined. As quickly as she could, she ladled out three bowls of soup and cut up the sandwiches, then arranged peanut butter cookies on a plate.\u003c/p\u003e\n\u003cp\u003e“Lunch is ready,” she announced, carrying two soup bowls into the dining room.\u003c/p\u003e\n\u003cp\u003eBen came to help her, but not David, who eagerly took his seat at the table. Charlotte returned for the platter of sandwiches, and Ben followed with the third soup bowl and the cookies.\u003c/p\u003e\n\u003cp\u003eDavid immediately started his meal until his father stopped him. “We say grace before we eat.”\u003c/p\u003e\n\u003cp\u003eSomewhat embarrassed, David set his spoon aside and bowed his head while his father said a few simple words of thanksgiving. David then had the good sense to wait until Charlotte reached for her spoon before he took up his own. She did so want to think well of Ben’s son and could see that he was trying.\u003c/p\u003e\n\u003cp\u003e“I’ll write you another check,” David insisted after he’d finished his soup, on which he’d complimented Charlotte any number of times.\u003c/p\u003e\n\u003cp\u003eBen didn’t encourage him, nor did he refuse his son’s offer.\u003c/p\u003e\n\u003cp\u003e“You’re staying in Seattle, David?” she asked, making conversation.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’m at a hotel downtown.”\u003c/p\u003e\n\u003cp\u003e“How long will you be there?” Charlotte asked next, wanting to cover the uncomfortable silence.\u003c/p\u003e\n\u003cp\u003e“I leave tomorrow. Say,” David said, “on my way into town, I drove past the waterfront. What happened to The Lighthouse restaurant? It’s gone.”\u003c/p\u003e\n\u003cp\u003e“It was destroyed by a fire,” Ben responded, “that seems to have been set by an arsonist.”\u003c/p\u003e\n\u003cp\u003eDavid’s brows shot up and he leaned forward. “Here in Cedar Cove? That’s hard to believe.”\u003c/p\u003e\n\u003cp\u003e“It was terribly shocking,” Charlotte agreed. “Poor Justine and Seth have been beside themselves. Until everything’s settled, Justine is working part-time at the bank and Seth has taken a sales job.”\u003c/p\u003e\n\u003cp\u003e“What about the fire? Is there a suspect?”\u003c/p\u003e\n\u003cp\u003eBen exhaled slowly, as though loath to discuss the subject. “A high-school boy appears to be responsible. The sheriff has called Anson Butler a ‘person of interest.’ The boy hasn’t been seen since the fire and apparently Seth let him go shortly beforehand.”\u003c/p\u003e\n\u003cp\u003e“Everyone in town is heartbroken for Seth and Justine,” Charlotte said. “But I’m sure they’ll rebuild soon.”\u003c/p\u003e\n\u003cp\u003e“I feel bad for them,” David said, sounding sincere. “I hope everything works out for your granddaughter, Charlotte.”\u003c/p\u003e\n\u003cp\u003eShe was touched by his words and thanked David. “A cookie?” she asked, passing him the plate.\u003c/p\u003e\n\u003cp\u003eDavid took two.\u003c/p\u003e\n\u003cp\u003eBefore he left, he wrote his father another check. “I couldn’t be more embarrassed, Dad,” he said. “You shouldn’t have any problem with this one.” He shifted his eyes from Ben to Charlotte, then stared at the floor. “You might want to wait until the first of the month, though, if that’s not inconvenient.”\u003c/p\u003e\n\u003cp\u003eAgain Ben didn’t comment. He accepted the check, nodded his head at David’s request and walked his son to the door.\u003c/p\u003e\n\u003cp\u003e“Next time, let us know when you plan to stop by,” Charlotte chastised him gently. “That way I can make you a real dinner.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Charlotte,” David said, kissing her cheek. “Next visit, I’ll give you plenty of notice.”\u003c/p\u003e\n\u003cp\u003eCharlotte and Ben stood out on the porch with him. It was cool, and the drizzle continued. Ben put his arm around her shoulders.\u003c/p\u003e\n\u003cp\u003e“Come and see us again soon,” she said as David ran to his car. She waited until he’d started the engine and driven off before she went back inside, Ben at her heels.\u003c/p\u003e\n\u003cp\u003e“It was good of David to stop by,” she commented, watching her husband closely.\u003c/p\u003e\n\u003cp\u003e“Like you said, David should’ve let us know he was coming,” Ben murmured. He helped her clear the table. “Frankly, it would’ve suited me just fine if he hadn’t bothered.”\u003c/p\u003e\n\u003cp\u003e“Ben! That’s a terrible thing to say about your own son.”\u003c/p\u003e\n\u003cp\u003eHer husband shook his head. “I know David.” With that, he reached for the check his son had given him and tore it in several pieces. “This is as worthless as the first one he wrote.” Ben’s eyes filled with pain as he crumpled the scraps and dropped them in the garbage.\u003c/p\u003e\n\u003cp\u003eCharlotte walked over to him and slipped her arms around his neck. “I’m sorry about this,” she whispered, wishing she knew how to ease the ache in his heart.\u003c/p\u003e\n\u003cp\u003e“So am I,” Ben said, holding her close. “So am I.”\u003c/p\u003e\n\u003cp\u003eTwenty-Five\u003c/p\u003e\n\u003cp\u003eThe morning before the senior prom, Allison drove into Silverdale to pick up her dress. She’d dreamed that Anson would be her date on prom night. That wasn’t possible, but rather than stay home feeling depressed, she was attending with her friend Kaci. Her parents didn’t understand why she’d refused to go with any of the three boys who’d invited her, and Allison knew her mother was disappointed on her behalf.\u003c/p\u003e\n\u003cp\u003eHer cell phone rang as she walked through the mall to the parking lot, the dress draped over her arm. She’d purchased the cell with her own funds, hoping against hope to get the number to Anson so they could talk privately. So far, there hadn’t been any opportunity. He hadn’t phoned her again and his mother had no way of getting in touch with him, either.\u003c/p\u003e\n\u003cp\u003e“Hello,” she said as she walked toward her mother’s car, expecting to hear Kaci’s voice.\u003c/p\u003e\n\u003cp\u003e“Allison?”\u003c/p\u003e\n\u003cp\u003eShe stopped cold. It was Anson.\u003c/p\u003e\n\u003cp\u003e“Can you talk?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said, hardly able to believe it. Despite her fears, her heart did a little jig of happiness. She had so much to tell him, so much she wanted to ask.\u003c/p\u003e\n\u003cp\u003e“Are you alone?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “I’m in the parking lot outside the Silverdale Mall.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eBefore he told her anything else, she had to warn him. “Don’t tell me where you are. All right? I’d have to tell the sheriff, so it’s better that I not know. You aren’t on a phone that can be traced, are you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Thank goodness.” She breathed easier. “How did you get my number?” she asked. His call seemed like the answer to a prayer, the granting of a wish, but she didn’t think it was the result of either divine intervention or fairy-tale magic.\u003c/p\u003e\n\u003cp\u003e“I’ll explain in a minute. There’s something I have to say first.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You’re probably going to the prom tomorrow night,” he said, “and I want you to go. It’s important to me that you do. I don’t want you sitting home alone because of me. If you think you’re being loyal to me by staying away, then don’t.”\u003c/p\u003e\n\u003cp\u003eHer throat hurt as she held back tears, and she found it hard to swallow, hard to speak. She was moved beyond words that he cared about her…that he’d even remembered the dance. “I’m going with Kaci,” she finally said. Because of all the traffic noise outside the mall, she unlocked the car and sat in the driver’s seat. She tossed her dress on the empty space beside her.\u003c/p\u003e\n\u003cp\u003e“But Allison…”\u003c/p\u003e\n\u003cp\u003e“You’re my date, Anson. I can’t imagine dancing at the prom with anyone but you.” Closing her eyes, she could almost feel his arms around her.\u003c/p\u003e\n\u003cp\u003e“I’d give anything to be there with you,” he whispered.\u003c/p\u003e\n\u003cp\u003eHer heart felt like it was about to break. “How did you get my number?” she asked again, trying to maintain some semblance of control.\u003c/p\u003e\n\u003cp\u003e“Eddie. I had a friend phone the house pretending to be a guy from school and Eddie answered and gave him the number of your cell.”\u003c/p\u003e\n\u003cp\u003e“Now that I have my own phone, can you talk more often?” She had so many questions. Although she was desperate to ask about the pewter cross found in the fire, she was also afraid of what he might tell her. All she needed now, she decided, was the sound of his voice. The questions could wait.\u003c/p\u003e\n\u003cp\u003e“I’m not sure it’s a good idea for me to call you,” he said.\u003c/p\u003e\n\u003cp\u003e“Please! I have to know you’re all right.”\u003c/p\u003e\n\u003cp\u003e“I’m okay. There’s nothing to worry about.”\u003c/p\u003e\n\u003cp\u003e“I do worry, Anson.” She wanted him to come back to Cedar Cove, and yet she was terrified of what might happen when—if—he did. A part of her yearned to tell him to stay hidden, otherwise he might end up in jail. At the same time, she longed for his name to be cleared. Only she wasn’t convinced anymore that was possible….\u003c/p\u003e\n\u003cp\u003e“What can you tell me about The Lighthouse?” he asked. “Is there any news? Has anyone been arrested?”\u003c/p\u003e\n\u003cp\u003eAllison closed her eyes again, fearing this very subject. She hesitated.\u003c/p\u003e\n\u003cp\u003e“Allison?”\u003c/p\u003e\n\u003cp\u003e“Your cross was found in the ashes. It’d partially melted and there was a picture of it in the Chronicle.”\u003c/p\u003e\n\u003cp\u003eHe muttered something best not repeated.\u003c/p\u003e\n\u003cp\u003e“You were there that night, weren’t you?” Asking him this required all the courage she could muster. Her hand was trembling and damp with perspiration as she clutched the phone.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said, “but I swear to you, Allison, I didn’t set the fire. I did everything I could to put it out. I realized I’d lost my cross, but I didn’t know where. Tell the sheriff to check the fire extinguisher. My fingerprints should be all over it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-29.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
