{"id":67718,"no":32,"title":"Page 32","content":"\u003cp\u003eA year ago on Memorial Day, when Cecilia was still pregnant with Aaron, and Ian had been at sea, she’d driven out to the cemetery and placed flowers on Allison’s gravesite. The loss of her little girl still affected her, and Ian, too, although he wasn’t as willing to discuss the subject as she was. Every now and then in the middle of the night, he’d reach for her and they’d talk about Allison. She could never doubt Ian’s love for the daughter he’d never seen or held.\u003c/p\u003e\n\u003cp\u003e“Cecilia?” Ian said groggily. He stood in the hall doorway wearing his pajama bottoms. “What are you doing up so early?”\u003c/p\u003e\n\u003cp\u003e“I was awake and it’s such a lovely morning, I decided to get up.” She was hoping to do a bit of yard work later, after they’d been out to the cemetery. She’d started tending the garden and hoped to coax Grace’s rosebushes and perennials back to vibrant life. She longed to show the Hardings how well she and Ian were caring for the house and yard.\u003c/p\u003e\n\u003cp\u003e“It’s only about five,” Ian said.\u003c/p\u003e\n\u003cp\u003e“I know. Why don’t you go back to bed?” She had plans for him later and didn’t want him telling her he was too tired.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” he asked, sounding worried.\u003c/p\u003e\n\u003cp\u003e“Yes,” she told him.\u003c/p\u003e\n\u003cp\u003eHe didn’t look as if he believed her.\u003c/p\u003e\n\u003cp\u003e“Ian,” she said, smiling softly. “I couldn’t be happier. I love you and our babies so much, and Aaron is healthy and thriving. We live in a lovely home. My life’s never been better.”\u003c/p\u003e\n\u003cp\u003e“Babies,” Ian repeated carefully.\u003c/p\u003e\n\u003cp\u003e“Yes, babies.” Allison would always live in Cecilia’s heart, would always be her daughter.\u003c/p\u003e\n\u003cp\u003e“So we’re going to the cemetery today,” he said.\u003c/p\u003e\n\u003cp\u003eCecilia had already purchased a small bouquet of flowers. She nodded. “I have every year. I couldn’t imagine not going.”\u003c/p\u003e\n\u003cp\u003e“Me, neither,” Ian concurred sadly. He yawned and turned away, then walked into the room with slow, measured steps. To her surprise, he sat down on the nearby ottoman, his shoulders slumped.\u003c/p\u003e\n\u003cp\u003eCecilia leaned forward and placed her hand on his bare back, pressing a kiss to his shoulder. He didn’t say anything for a long time. Long enough for her to recognize that he had something on his mind. Something that weighed on him.\u003c/p\u003e\n\u003cp\u003e“Ian?” she said. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer; instead, he stared down at the floor.\u003c/p\u003e\n\u003cp\u003e“Ian?”\u003c/p\u003e\n\u003cp\u003e“I’ve been transferred.”\u003c/p\u003e\n\u003cp\u003eThe words hung in the air. Ian transferred?\u003c/p\u003e\n\u003cp\u003eCecilia swallowed hard, trying to make sense of what he was telling her. Ian had been stationed at the same base for nearly six years, two more years than the usual four-year assignment. Those two extra years could be attributed to the fact that he’d moved from a submarine to an aircraft carrier.\u003c/p\u003e\n\u003cp\u003eAfter Allison’s death, the navy had given him a new duty assignment. Because Ian had been under the polar ice cap at the time of Allison’s birth, he hadn’t even known until his return that his daughter had been born, had died and already been buried. He’d suffered severe emotional trauma as a result.\u003c/p\u003e\n\u003cp\u003e“We have to move?” Cecilia asked, choking off an automatic protest. The day they’d come to view the house, Ian had said they couldn’t sign a full year’s lease. He’d said there was a rumor they might be transferred. Cecilia had known it was a possibility, only she’d convinced herself it wouldn’t really happen.\u003c/p\u003e\n\u003cp\u003eIan had told her when they were first married that the navy might require frequent moves. But Cedar Cove was their home. It was where they’d met, where they’d fallen in love and married, and where they—\u003c/p\u003e\n\u003cp\u003eNo. Bile rose in the back of her throat. Their daughter was buried here. A transfer meant they’d be leaving Allison behind.\u003c/p\u003e\n\u003cp\u003e“I put off telling you as long as I could,” he mumbled. “I was afraid one of the other wives would say something, and I didn’t want you hearing this from anyone else. The George Washington’s new home base is San Diego.”\u003c/p\u003e\n\u003cp\u003e“Just like that, we have to pack up and leave?” she said in a small voice.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’m sorry, Cecilia.” He shrugged helplessly. “There’s nothing I can do.”\u003c/p\u003e\n\u003cp\u003e“What about Allison? Who’ll visit her grave? Who’ll make sure it’s properly taken care of if we’re not here?” Fears and denials crowded her mind but she quickly swallowed a cry of alarm. This had to be hard on Ian, too, and her dissolving into tears wouldn’t change anything.\u003c/p\u003e\n\u003cp\u003e“I don’t know what to tell you. All I can say is that the navy’s sending us to another duty station. When I signed my name on the enlistment agreement, I knew this was bound to happen sooner or later. You knew it, too.”\u003c/p\u003e\n\u003cp\u003eCecilia did. Two weeks ago, her closest friend, Cathy Lackey, had revealed that her husband had received transfer papers that would send the small family to Scotland. Cecilia and Cathy had shed a lot of tears, but they’d vowed to keep in touch through e-mail and letters. Cecilia was determined to hold on to that precious friendship.\u003c/p\u003e\n\u003cp\u003e“What about the house?” she asked next. They’d only just settled in; the packing boxes were still in the garage. Cecilia loved this house, and so did Ian. “I thought we might own it one day.”\u003c/p\u003e\n\u003cp\u003e“I know.” Her husband sounded as miserable as she felt. “We are on a month-to-month agreement, though. I’ve already spoken to Mrs. Harding. She was disappointed, too, but she understood.”\u003c/p\u003e\n\u003cp\u003eCecilia hardly knew what to say. She’d be walking away from the friends she’d made, the daughter she’d buried, the job she enjoyed and the teenage girl she’d befriended. Everything—her whole life—was here in Cedar Cove.\u003c/p\u003e\n\u003cp\u003e“You’ll like San Diego,” Ian said gamely.\u003c/p\u003e\n\u003cp\u003e“I’m sure I will,” she murmured with no particular enthusiasm.\u003c/p\u003e\n\u003cp\u003eWhen Ian spoke again, his voice was void of emotion. “I’ve been doing a lot of thinking, and I know how much you love it here.” He paused. “If you wanted, you could stay,” he suggested with obvious reluctance. “I could make the commute for a while. I’m at sea for six months—and, well, there are ways around this if you don’t feel you can uproot your life and leave Allison.”\u003c/p\u003e\n\u003cp\u003e“Oh, Ian.” That would be disastrous for their marriage. She needed to be with her husband, regardless of where he was assigned. They were a family.\u003c/p\u003e\n\u003cp\u003e“Is that what you’d like to do?” he asked, his eyes intense and sad as he studied her.\u003c/p\u003e\n\u003cp\u003e“I hate leaving Cedar Cove,” she said softly, rubbing her hand down his bare back. “But Ian, don’t you see? I could never live apart from you.” She managed a shaky laugh. “At least, not any more than the navy already requires.”\u003c/p\u003e\n\u003cp\u003eHe brought his arms around her then, and they clung to each other. Words weren’t necessary. He wanted her and Aaron with him, and yet he’d been willing to compromise, to give her what he felt would make her happy.\u003c/p\u003e\n\u003cp\u003e“I love you so much,” he whispered. “You have no idea how much I dreaded telling you this.”\u003c/p\u003e\n\u003cp\u003eShe hadn’t made it easy, Cecilia realized. Every day she’d been full of joy about the house and working hard to make it comfortable and welcoming.\u003c/p\u003e\n\u003cp\u003e“We can start packing this afternoon,” she said, tears spilling from her eyes.\u003c/p\u003e\n\u003cp\u003e“We’ll go visit Allison first.”\u003c/p\u003e\n\u003cp\u003eYes, and while she was there, Cecilia would tell her baby girl goodbye.\u003c/p\u003e\n\u003cp\u003eTwenty-Eight\u003c/p\u003e\n\u003cp\u003eJustine glanced at her watch, surprised it was almost noon. With a staff meeting and back-to-back appointments, the morning had gotten away from her. She grabbed her purse and hurried out from behind her desk. She should’ve left ten minutes ago. She was meeting Seth and their insurance agent at The Lighthouse, or rather where The Lighthouse used to be. The site had been cleared now, and decisions needed to be made.\u003c/p\u003e\n\u003cp\u003eAs Justine headed out, she nearly collided with Warren Saget, who was just entering the bank.\u003c/p\u003e\n\u003cp\u003e“Justine,” he said catching her by the shoulders. “I almost bowled you over.”\u003c/p\u003e\n\u003cp\u003e“Warren,” she said, nearly breathless. “Oh, my goodness, I’m sorry. I’m in a rush—I’m supposed to meet Seth and our insurance agent.”\u003c/p\u003e\n\u003cp\u003e“Oh.” His face fell, his disappointment obvious. “I was hoping to convince you to have lunch with me.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” she told him. “I have to run. I’m already late.”\u003c/p\u003e\n\u003cp\u003e“Will the meeting take long? I could wait.”\u003c/p\u003e\n\u003cp\u003eShe didn’t want to hurt his feelings, but Seth had asked her not to see Warren again. Her mother had been critical of her, too, for that one lunch meeting. Olivia didn’t know the nature of her relationship with Warren, although Seth, of course, did. Warren was impotent, and they’d been friends who’d provided each other with certain mutual benefits, including company in social or business situations.\u003c/p\u003e\n\u003cp\u003e“I’m going to be at D.D.’s on the Cove,” Warren told her as she started backing away from him. “They do marvelous crab cakes. That was your favorite entrée, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“You go on ahead,” she told him, eager to get away. She realized she hadn’t explicitly turned him down.\u003c/p\u003e\n\u003cp\u003e“Meet me if you can,” he said.\u003c/p\u003e\n\u003cp\u003eJustine nodded and, because she was late, decided to drive rather than walk. She rushed across the parking lot where she’d left her car. Seth had been so busy at the boatyard lately that they hadn’t had a chance to discuss their plans for the restaurant. She still had mixed feelings about rebuilding. The restaurant was too demanding; it took too much time away from their family life.\u003c/p\u003e\n\u003cp\u003eTragic and distressing as the arson had been, she loved the freedom the last few months had given her. Seth was doing so well in sales, and each commission he collected was more than they’d cleared in any single month at the restaurant. In her heart of hearts, she hoped Seth would see that rebuilding The Lighthouse would be too hard on them. At the same time, she understood what he was saying about not wasting all the effort of the last five years. Besides, she had an idea, one she’d come up with during a recent visit at her mother’s and briefly discussed with Seth. He seemed to listen but she wasn’t convinced that he’d truly grasped her vision.\u003c/p\u003e\n\u003cp\u003eSeth and Robert Beckman, their insurance agent, were already at the site. Justine parked and hurried across the street to join them. The view of the cove was dramatic and beautiful, part of the reason this was such a valuable piece of real estate.\u003c/p\u003e\n\u003cp\u003eWhen she approached Seth and Robert, they were deep in conversation, pausing only to smile at her. Still speaking, her husband put his arm around her waist and brought her close.\u003c/p\u003e\n\u003cp\u003e“Robert was just saying he’s reviewed the architect’s plans,” he told Justine. “With a fresh start, we can make some necessary changes and update the old floor plan.”\u003c/p\u003e\n\u003cp\u003eJustine unsuccessfully hid her surprise. Construction plans? No one had mentioned any of this to her. “I have a few ideas of my own,” she inserted.\u003c/p\u003e\n\u003cp\u003e“Because of the fire,” Seth said, ignoring her comment, “we have the opportunity of a lifetime.” He grinned wryly. “Ironic, huh?” \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-32.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
