{"id":67723,"no":37,"title":"Page 37","content":"\u003cp\u003eTeri giggled, suddenly so happy she wanted to sing—and she had a terrible voice. Whenever she broke into song, the dogs in the neighborhood joined in. Using a special phone Bobby handed her, she called Rachel and asked if she’d cover for her the next few days and promised to keep in touch.\u003c/p\u003e\n\u003cp\u003eAs she hung up the receiver, she thought of something else. “I don’t have any form of birth control, either.”\u003c/p\u003e\n\u003cp\u003eHis smile faded and an adoring look stole over his face. “I’d like to get you pregnant,” he said softly. “With your wide hips, you should have an easy birth.”\u003c/p\u003e\n\u003cp\u003eThe man said the most outrageous things! “Fine. Then, you can go through labor.”\u003c/p\u003e\n\u003cp\u003e“I would if it was possible. I don’t think I could stand to see you suffer.”\u003c/p\u003e\n\u003cp\u003eWas it any wonder she loved him? “Okay, but there’s one little fact you should know. No child of mine’s going to have the smarts to be a chess champion.”\u003c/p\u003e\n\u003cp\u003eHe accepted that without argument. “Good. I want my child to live a more normal life than I have.”\u003c/p\u003e\n\u003cp\u003eWhen they landed in Vegas nearly three hours later, they were ushered into another limo and driven down the Strip. Teri opened the sunroof and stood with her head and arms out, yelling to the crowds at the top of her lungs. “I’m getting married!” she screeched, waving madly and flashing her diamond.\u003c/p\u003e\n\u003cp\u003eA minister was waiting for them in the penthouse suite of a posh casino hotel. The room was filled with flowers, all white. Everything was ready. All Teri had to do was sign the paperwork and show her identification.\u003c/p\u003e\n\u003cp\u003eThen she and Bobby exchanged vows. James was the witness. Two minutes after the ceremony, they were alone. Bobby kissed her again. “Can I make love to you now?” he asked.\u003c/p\u003e\n\u003cp\u003eHe was so sincere, so sweet. She nodded. “Please.”\u003c/p\u003e\n\u003cp\u003eBobby led her into the bedroom, looking a bit self-conscious. He turned off the light.\u003c/p\u003e\n\u003cp\u003eAll at once, Teri was nervous. She was no novice to bedroom antics. As one of her loser boyfriends had said, she’d been around the block more often than the mailman. While she wasn’t happy about her past, she wasn’t ashamed, either. But just then, she would’ve given everything she had in this world to have come to her husband a virgin.\u003c/p\u003e\n\u003cp\u003eWhatever fears and regrets she had faded the instant Bobby took her in his arms.\u003c/p\u003e\n\u003cp\u003eHe was gentle, as she knew he would be, and generous and tender. For her, it might as well have been the first time because that was how he made her feel. Lying in his arms, she wept silently. He kissed her tears away and explored her body with his hands and lips, between the sweetest and most exquisite of kisses.\u003c/p\u003e\n\u003cp\u003e“I love you,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Do you think I gave you a baby?” he asked.\u003c/p\u003e\n\u003cp\u003e“Hmm.” Teri considered his question. “I’m not sure. Maybe we should try again.”\u003c/p\u003e\n\u003cp\u003eBobby laughed and she thought she’d never heard him sound this happy. That thrilled her, knowing she was capable of pleasing him.\u003c/p\u003e\n\u003cp\u003eIn the wee hours, she woke to find Bobby leaning on one elbow staring down at her. With his index finger, he outlined the shape of her eyebrow. Teri smiled up at him.\u003c/p\u003e\n\u003cp\u003e“Can we…again?” he asked shyly.\u003c/p\u003e\n\u003cp\u003eHer smile widened, and she threw her arms around his neck, and let him know she had absolutely no objections.\u003c/p\u003e\n\u003cp\u003eThey slept late, only to be awakened by James pounding on the door, announcing that Bobby was needed downstairs.\u003c/p\u003e\n\u003cp\u003eAt the noise, Bobby leaped out of bed, glanced at the clock and searched frantically for his pants. “I’m late.”\u003c/p\u003e\n\u003cp\u003e“You have a match this morning?” For modesty’s sake, Teri pulled up the sheet to cover her naked breasts. She dropped it. There was no reason to be shy with Bobby. Her husband had spent plenty of time holding, touching and kissing her breasts the night before.\u003c/p\u003e\n\u003cp\u003e“I have a tournament here.” He jerked up his pants and scrabbled around for his socks and shoes.\u003c/p\u003e\n\u003cp\u003e“This morning?”\u003c/p\u003e\n\u003cp\u003e“Yes. At nine.” He found his shirt and buttoned it crookedly. She crawled across the bed and refastened it for him. “I don’t want to go. I’m sorry,” he told her.\u003c/p\u003e\n\u003cp\u003e“Me, too. My favorite time to make love is in the morning.”\u003c/p\u003e\n\u003cp\u003eHis eyes widened. “Stay here,” he said, his voice husky. He cleared his throat and spoke again. “I’ll be back. Soon.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003eHe pointed at her and at the bed, and stammered, “Please. Order breakfast, have a…have a shower, but…don’t leave this room.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” she promised. “Is the match televised?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He dragged in a deep breath.\u003c/p\u003e\n\u003cp\u003e“Come here,” she said, kneeling at the foot of the bed.\u003c/p\u003e\n\u003cp\u003eJames knocked again but Bobby moved toward Teri. Wrapping her arms around her husband’s neck, she kissed him in a way that guaranteed his return. “That was for luck.”\u003c/p\u003e\n\u003cp\u003eBobby’s breathing went shallow, and he backed out of the room.\u003c/p\u003e\n\u003cp\u003eTeri ordered coffee, which arrived when she’d finished her shower. She uncovered the television remote, and after flipping through various channels, found the station broadcasting the live chess match. The commentator was talking about Bobby, and Teri sat up in bed, sipping coffee, listening as the highlights of her husband’s illustrious career were described. Husband—oh, that word had a wonderful sound.\u003c/p\u003e\n\u003cp\u003eShe watched as Bobby faced his opponent, a well-known Russian player, according to the commentator. Teri had never heard of him but that wasn’t saying much.\u003c/p\u003e\n\u003cp\u003eTwenty moves later, the game was over. The audience was stunned. When Bobby stood up to leave, the man who’d been commenting on the game tried to interview him. Shaking his head, Bobby walked directly past him. He simply marched out of the room. Five minutes later, Teri heard the door to their suite open.\u003c/p\u003e\n\u003cp\u003eBobby already had his shirt off by the time he made it into the bedroom. He stood at the end of the bed, and his eyes glowed with warmth as he smiled at her.\u003c/p\u003e\n\u003cp\u003eShe repeated what the television commentator had announced. “Bobby Polgar just made chess history.”\u003c/p\u003e\n\u003cp\u003e“I hurried.”\u003c/p\u003e\n\u003cp\u003eTeri held her arms open. “How long before the next game?”\u003c/p\u003e\n\u003cp\u003e“An hour,” he said, frowning.\u003c/p\u003e\n\u003cp\u003e“That’s enough time,” she assured him.\u003c/p\u003e\n\u003cp\u003eHis smile was back.\u003c/p\u003e\n\u003cp\u003eBobby Polgar, husband of Teri Miller Polgar, continued to make chess history for the rest of that week. Without explanation, he disappeared after each match and arrived late for several of them. Refusing all interviews, he was less social and more reclusive than he’d been since entering the international chess arena. Speculation ran rampant.\u003c/p\u003e\n\u003cp\u003eTeri didn’t leave the suite for five days. She had everything she could want or need at her fingertips. In fact, she had more than she’d ever dreamed possible.\u003c/p\u003e\n\u003cp\u003eThirty-Two\u003c/p\u003e\n\u003cp\u003e“I’d like to talk to you a moment,” Seth said after a silent dinner on Wednesday evening. They hadn’t mentioned the subject of the restaurant since last Friday, although it loomed between them. He hadn’t said any more about her idea for a tearoom, and Justine hadn’t brought it up. She was so bitterly disappointed in her husband that she could barely look at him. He’d acted as though her ideas and suggestions meant nothing. What hurt even more was that Seth hadn’t told her about his ideas, either. He’d just moved forward without her.\u003c/p\u003e\n\u003cp\u003e“All right,” she murmured, turning away from the sink. They’d spoken very little for the past five days, exchanging only mundane remarks about Leif’s needs. They still slept in the same bed, but as far from each other as possible, and they never went upstairs at the same time.\u003c/p\u003e\n\u003cp\u003eSeth had been avoiding her. He put in long hours at work. At least she assumed that was where he spent his time. For all she knew, he could’ve been in meetings with a builder and broken ground. Sad to say, she wasn’t privy to her husband’s plans.\u003c/p\u003e\n\u003cp\u003eDrying her hands on a dish towel, she glanced into the living room and saw that Leif was putting together a puzzle, Penny curled up beside him. He’d be content for a few more minutes. Pulling out a kitchen chair, she sat down while Seth poured himself a cup of coffee.\u003c/p\u003e\n\u003cp\u003eInstead of joining her at the table, he remained standing, leaning against the counter. Justine felt at a disadvantage, sitting while he stood, but didn’t have the energy to get up.\u003c/p\u003e\n\u003cp\u003e“I owe you an apology,” Seth admitted, surprising her. “I didn’t take this tearoom idea of yours seriously. I should’ve given it more consideration and I didn’t. Instead, I went ahead with my plans to rebuild—without discussing them with you first.”\u003c/p\u003e\n\u003cp\u003eJustine kept her eyes lowered. “I didn’t even know you’d made any plans, Seth. It was a shock.”\u003c/p\u003e\n\u003cp\u003e“No more of a shock than you seeing Warren behind my back,” he retaliated.\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to defend herself and swallowed a retort. Arguing wouldn’t help, and she didn’t want to say anything in front of their son. Leif had heard far too many of their disagreements already.\u003c/p\u003e\n\u003cp\u003e“Forget I said that,” Seth murmured, brushing his blond hair away from his face. Despite his words, his mouth was pinched, his expression disapproving.\u003c/p\u003e\n\u003cp\u003e“All right, I will.”\u003c/p\u003e\n\u003cp\u003eHer husband exhaled, as though he had difficulty controlling his frustration. “I want you to know I’ve done some serious thinking about what we should do.”\u003c/p\u003e\n\u003cp\u003eShe dared to raise her eyes, almost afraid to hope Seth would be willing to hear her ideas.\u003c/p\u003e\n\u003cp\u003e“I love you, Justine,” he said, his eyes meeting hers. “You and Leif mean more to me than anything. I can’t risk losing you.”\u003c/p\u003e\n\u003cp\u003eJustine felt a lump form in her throat.\u003c/p\u003e\n\u003cp\u003e“I won’t destroy our marriage because I’m too stubborn to let go of an idea.”\u003c/p\u003e\n\u003cp\u003eJustine blinked rapidly to hold back tears. “I love you, too,” she said.\u003c/p\u003e\n\u003cp\u003e“More than Warren Saget?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she cried. “A thousand times more!”\u003c/p\u003e\n\u003cp\u003eSeth pulled out another chair and sat across from her. He reached for her hand. Justine struggled not to cry; she hadn’t slept well in days, and she doubted Seth had, either. Lack of sleep had made her emotions more volatile than they already were.\u003c/p\u003e\n\u003cp\u003e“I think the best thing to do, since we can’t agree, is to sell the property. I’ve contacted a real estate agent and I’ve decided—” he hesitated “—if you concur, that is, we’ll put the property on the market.”\u003c/p\u003e\n\u003cp\u003eJustine was sure she hadn’t heard him correctly. “You’re willing to sell the land?” That wasn’t what she wanted, although at one time she’d thought perhaps she did.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “With the way property values have gone up in the last five years,” he continued, “plus what we’ll collect from the insurance company, we should be able to walk away debt-free.”\u003c/p\u003e\n\u003cp\u003eThey could pay off everything they owed, but…“In other words, we won’t have anything to show for all the work we put into The Lighthouse?” She realized she was stating the very argument he’d made earlier. She saw the discouragement in his eyes and in the tight set of his mouth. She and Seth had taken a risk when they’d opened the restaurant. From the first day they’d opened for business, Seth had been determined to succeed. \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-37.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
