{"id":67724,"no":38,"title":"Page 38","content":"\u003cp\u003eHe’d worked hard. So had Justine. And yet, after five long years, they had nothing. The fire had wiped them out.\u003c/p\u003e\n\u003cp\u003e“What do you think?” he asked.\u003c/p\u003e\n\u003cp\u003e“But…” Sell the property? Even now, he didn’t want to listen to her ideas. She wouldn’t force them on him. “Can I sleep on it?”\u003c/p\u003e\n\u003cp\u003eHe bowed his head. “Of course.” He leaned forward, not looking at her. “It’s just…I’ve put so much into this.”\u003c/p\u003e\n\u003cp\u003eWhat about me? she thought resentfully. The restaurant had been their dream, the project they’d worked on together. Justine felt cast aside, unimportant. Once again, Seth had made her feel as though her contribution and her concerns were of little value.\u003c/p\u003e\n\u003cp\u003eHer reaction last Friday had been childish, and she regretted seeing Warren. Her willingness to have lunch with him that day had only encouraged him. Every day since, he’d made an excuse to visit the bank. She’d declined his invitations for meals and drinks, but nothing she said seemed to convince him. As he told her repeatedly, he’d achieved the success he had by persisting, and her polite rejections had only made him redouble his efforts. In fact, he’d sent flowers to the bank twice. His attention had become conspicuous—and embarrassing.\u003c/p\u003e\n\u003cp\u003eMaybe it would be best all the way around if they did sell the property. Justine tucked a strand of hair behind her ear as she considered. “You’re still enjoying sales?” she asked.\u003c/p\u003e\n\u003cp\u003eSeth grinned. “I appear to have a knack for it.”\u003c/p\u003e\n\u003cp\u003eThat was true enough; after only a few weeks, Seth was the company’s top salesperson.\u003c/p\u003e\n\u003cp\u003e“Before you make your decision, there’s something you should know,” Seth said. “If we list the property, there’s a strong likelihood it’ll sell right away.”\u003c/p\u003e\n\u003cp\u003e“You can’t be sure of that.”\u003c/p\u003e\n\u003cp\u003e“Actually, I am. From what I understand, a fast-food franchise is looking for prime property here in Cedar Cove.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“We’d get full price and the deal can close within the month.”\u003c/p\u003e\n\u003cp\u003e“The real estate agent told you this?” Justine asked.\u003c/p\u003e\n\u003cp\u003eSeth nodded.\u003c/p\u003e\n\u003cp\u003e“Would you have any regrets?” she asked, studying him.\u003c/p\u003e\n\u003cp\u003e“No,” he said, and he seemed sincere. “Not anymore. I hate the thought of someone selling hamburgers and fries at the waterfront, where our restaurant once stood, but I’d get used to it.”\u003c/p\u003e\n\u003cp\u003eSeth might, but Justine wondered if she would as easily.\u003c/p\u003e\n\u003cp\u003e“Let’s sleep on it,” she said again. “Both of us.”\u003c/p\u003e\n\u003cp\u003eSeth put Leif to bed while Justine walked the dog. When she got back, he was still reading stories to their son. Eventually Leif fell asleep in the middle of Good Night, Moon, which both she and Seth could practically recite from memory. Justine took a long soak in the tub, perfuming the water with gardenia-scented bubble bath. Seth’s favorite. Her body was glistening when she finally climbed out of the water.\u003c/p\u003e\n\u003cp\u003eSeth paused in the bathroom doorway, watching her dress for bed. He gave her a slow, lazy smile. “Are you thinking what I’m thinking?” he said, his voice husky with suggestion.\u003c/p\u003e\n\u003cp\u003eJustine smiled. “I certainly hope so.”\u003c/p\u003e\n\u003cp\u003eIt was still light out when they went to bed. Seth reached for her, and Justine turned willingly into his arms. Their lovemaking was full of deep sighs and hoarse whispers.\u003c/p\u003e\n\u003cp\u003eAfterward Seth held her close. Nestled in her husband’s embrace, Justine felt content for the first time in weeks.\u003c/p\u003e\n\u003cp\u003e“I could get pregnant, you know.” She hadn’t bothered to resume her birth control pills—with Seth’s agreement. Not that it’d mattered much recently.\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eShe grinned sleepily. “You’d like that, wouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, I would. It’s time.” He kissed the top of her head. “Do you think twins might run in the family?”\u003c/p\u003e\n\u003cp\u003eHer eyes flew open as she considered the idea. She was a twin. “It’s a possibility, I suppose. What makes you ask?”\u003c/p\u003e\n\u003cp\u003eSeth twined his fingers through her hair. “If you had two babies, you’d be too busy to give Warren Saget a second’s thought.”\u003c/p\u003e\n\u003cp\u003e“Seth,” she whispered, raising her head to meet his gaze, “don’t tell me you’re actually jealous.”\u003c/p\u003e\n\u003cp\u003eHe slid his hand down her spine, and she arched her back. “In case you hadn’t noticed,” he said. “I’m green with it.”\u003c/p\u003e\n\u003cp\u003e“There’s absolutely no need to feel the slightest bit of jealousy. I promise you that.”\u003c/p\u003e\n\u003cp\u003e“I’m glad to hear it.”\u003c/p\u003e\n\u003cp\u003eShe kissed his jaw. “If you don’t object, I’ll give the bank my notice.”\u003c/p\u003e\n\u003cp\u003eShe felt his smile against her temple. “No objection here.”\u003c/p\u003e\n\u003cp\u003eShe loved the feel of his skin against her own. Justine smoothed her hand along his bare shoulders and over his chest. “I didn’t think you’d mind.” Suddenly tired, she yawned. “I like falling asleep in your arms,” she murmured. With the long hours Seth had spent at The Lighthouse, there’d been few opportunities for them to go to bed at the same time. And lately—ever since last week—they’d been so angry with each other, they hadn’t wanted to.\u003c/p\u003e\n\u003cp\u003e“I love you,” she whispered, yawning again.\u003c/p\u003e\n\u003cp\u003e“Sleep,” Seth urged and she did, falling into the soundest, deepest rest since before the fire had laid claim to her security.\u003c/p\u003e\n\u003cp\u003eJustine woke about five in the morning, feeling energetic and alert. She tossed aside the covers, got out of bed and quickly donned her robe. Then she hurried to the kitchen and, even before starting a pot of coffee, grabbed a pen and paper. She’d never been good at drawing, but her vision of a tearoom wouldn’t leave her alone. She had tried to push it out of her mind, afraid that discussing it would only upset Seth. Now she was determined to make him listen, to demand that he give her idea a fair hearing.\u003c/p\u003e\n\u003cp\u003eSeth found her standing over the table, sipping coffee. He slipped his arms around her middle and hugged her from behind, pressing his cheek against her back.\u003c/p\u003e\n\u003cp\u003e“You’re awake early.” Working his hands inside her robe, he cupped her breasts.\u003c/p\u003e\n\u003cp\u003eIt was difficult not to get caught up in the sheer sensual nature of his caress. “Seth,” she breathed, even as her nipples hardened in the palms of his hands. “I don’t want to list the property until after you listen to me.”\u003c/p\u003e\n\u003cp\u003eHe seemed to stop breathing. “You’re still thinking about a tearoom for women?” He removed his hands and stepped away from her. “Justine, we can’t keep doing this. We have to make a clear decision and go on with our lives. Isn’t that what you’ve been saying?”\u003c/p\u003e\n\u003cp\u003e“Yes, but do you honestly want to see a fast-food joint on the waterfront overlooking the cove?” In her view that would be a terrible misuse of the land.\u003c/p\u003e\n\u003cp\u003e“All right. Convince me a tearoom would be a success.”\u003c/p\u003e\n\u003cp\u003e“Here,” she said, shoving the tablet toward him. Her artistic talents were limited, but she’d done a fairly good job of drawing a Victorian structure with one turret and two gables.\u003c/p\u003e\n\u003cp\u003eSeth glanced down at her sketch and then at her. “It looks like a Victorian house. You want to build a house that serves tea where we once had the restaurant? I don’t mean to discourage you, Justine, but I don’t think the city would grant a permit for us to put a residence in a commercial zone.”\u003c/p\u003e\n\u003cp\u003e“It only looks like a house, Seth. It’s a Victorian Tea Room.”\u003c/p\u003e\n\u003cp\u003e“A Victorian Tea Room,” he repeated. “That’s different from a regular tearoom?”\u003c/p\u003e\n\u003cp\u003e“Well, maybe not, but that isn’t the point. First, we’d only be open for breakfast and lunch, and I’d be home in the evenings. I thought we could add a gift store, too. We’d serve high tea once a month, more often if there’s a demand.”\u003c/p\u003e\n\u003cp\u003e“In Cedar Cove?”\u003c/p\u003e\n\u003cp\u003e“It would be a special place for women to meet. We could have small receptions there and an outside patio for special occasions and—” She stopped because she was getting ahead of herself. “It occurred to me that we were wasting all the valuable lessons we learned from The Lighthouse.”\u003c/p\u003e\n\u003cp\u003e“How so?” he asked, studying her drawing. “For the record, I agree. But I’d like to hear what you think.”\u003c/p\u003e\n\u003cp\u003eThose words made her smile. “When we were open for lunch and dinner, our working hours were much too long. I wouldn’t want a liquor license, either.” Because they’d served evening meals, it was a necessity and where they’d garnered their highest profits.\u003c/p\u003e\n\u003cp\u003e“I can understand that,” Seth murmured. “I have to admit you’ve come up with an interesting compromise….”\u003c/p\u003e\n\u003cp\u003e“With just the two meals, I’d be home in time for dinner with you and Leif.”\u003c/p\u003e\n\u003cp\u003e“All right,” he said, and seemed to be slowly absorbing her thoughts. “Here’s my next question—would I be part of this?”\u003c/p\u003e\n\u003cp\u003e“Only if you wanted to be. And only to the extent that you wanted to be. The thing is, Seth, you’re good at sales. You’re happy, and the money so far is great. We wouldn’t need to rely solely on the earnings from the tearoom.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “In other words, you want to do this…alone?”\u003c/p\u003e\n\u003cp\u003e“Absolutely not! I’d need you. Not to work in the restaurant necessarily—unless you felt like it—but I’ll need your counsel and suggestions and input and encouragement. And your love.”\u003c/p\u003e\n\u003cp\u003e“I can give you all that,” he said. “Gladly.”\u003c/p\u003e\n\u003cp\u003e“We can do this, Seth, I know we can.”\u003c/p\u003e\n\u003cp\u003eHe set aside his coffee and drew her into his arms. Justine accepted his kiss. This was the perfect solution—for both of them.\u003c/p\u003e\n\u003cp\u003eThirty-Three\u003c/p\u003e\n\u003cp\u003eLinnette didn’t know where else to turn. It’d been a week since she’d heard from Cal. In the beginning, Cal had contacted her every few days, and then less often. Now, not at all.\u003c/p\u003e\n\u003cp\u003eLinnette understood his reasons for leaving Cedar Cove. Or, at least, she tried to. Everyone said saving wild mustangs was a worthy cause, and she knew it was. She also understood that cell phone reception in rural Wyoming was poor to nonexistent. But whenever they did manage to speak, it seemed that he ended the call as quickly as possible.\u003c/p\u003e\n\u003cp\u003eLinnette didn’t need anyone to tell her something was wrong. Because she didn’t know what else to do or whom to trust, she went to see Grace Harding, Cliff’s wife. Grace might be as completely in the dark as Linnette, but she hoped the librarian might be able to give her some information. Linnette couldn’t go on like this, not when she loved Cal so much.\u003c/p\u003e\n\u003cp\u003eShe visited the library on Thursday during her lunch break. This was the first time she’d actually set foot inside. The truth was, she hadn’t read very much since moving to Cedar Cove—mostly medical journals in order to keep current. What novels she did enjoy had been passed along by her mother. Sad as it was to admit, she’d lived in Cedar Cove for more than a year and hadn’t even bothered to get a library card.\u003c/p\u003e\n\u003cp\u003eThe library was an inviting place to be. The floor was carpeted to absorb sound and the reading area with its overstuffed chairs and displays of books welcomed anyone stepping inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-38.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
