{"id":67726,"no":45,"title":"Page 45","content":"\u003cp\u003e“You didn’t?”\u003c/p\u003e\n\u003cp\u003e“No. I think he was on the verge of having a heart attack himself.”\u003c/p\u003e\n\u003cp\u003e“Oh, no…” She wanted to ask Jon how that made him feel but she couldn’t. His father had saved Katie’s life, yet Jon couldn’t acknowledge that, not explicitly, not in so many words.\u003c/p\u003e\n\u003cp\u003eAn hour later, Ellen phoned to report that Joe had been seen by Dr. Timmons at the medical clinic and his heart was fine. His blood pressure was elevated but that was understandable. They were both back at the hotel and resting comfortably.\u003c/p\u003e\n\u003cp\u003eGrace phoned, and after she’d learned of the frightening episode, she and Cliff came over with dinner. Maryellen barely touched the chicken-and-rice casserole. She assumed it was because of the terror she’d felt earlier, but her appetite was nonexistent.\u003c/p\u003e\n\u003cp\u003eAfter straightening the kitchen, her mother was getting ready to leave, and Maryellen clambered up from the sofa to hug her mother and Cliff goodbye. She suddenly noticed how much her back ached. Then and only then did she recognize what was happening.\u003c/p\u003e\n\u003cp\u003eShe was in labor.\u003c/p\u003e\n\u003cp\u003e“Can you stay for a while?” she asked her mother.\u003c/p\u003e\n\u003cp\u003eGrace glanced at Cliff, then nodded. “Of course.”\u003c/p\u003e\n\u003cp\u003e“Jon.” Smiling, she stretched out her arms to her husband. “I think it would be a good idea if you took me to the hospital now.”\u003c/p\u003e\n\u003cp\u003eThirty-Nine\u003c/p\u003e\n\u003cp\u003eCharlotte spent the morning with her friends at the Senior Center. The knitting group get-together had included a lunch of sandwiches and coffee—and a thoroughly enjoyable gossip fest. Although it was a lovely afternoon—the official first day of summer—and the house was only a few blocks from the center, she drove. She usually enjoyed the short walk, but today she needed to run errands.\u003c/p\u003e\n\u003cp\u003eBen had decided to remain at the house, which meant he wouldn’t be playing bridge with his friends while she visited with hers. It meant he wouldn’t be running errands with her, either. From the moment they’d started seeing each other, Ben had willingly accompanied her on such routine tasks, and Charlotte had come to rely on his companionship.\u003c/p\u003e\n\u003cp\u003eSomething was bothering him. Had they been married longer, she might have known instinctively what it was. She was becoming familiar with his moods, but this latest one was new—and it worried her.\u003c/p\u003e\n\u003cp\u003eAs she pulled into the grocery store lot, she found a convenient parking spot, turned off the engine and sat in her car for a few minutes while she thought about this. She’d hoped Ben would feel comfortable enough to share his troubles with her. Apparently he didn’t. But rather than take offense, she tried to think of ways to ease his worries. Perhaps she should ask him outright why he seemed so distressed. That was what she’d do, she decided.\u003c/p\u003e\n\u003cp\u003eOlivia was walking out of the grocery just as Charlotte was going in.\u003c/p\u003e\n\u003cp\u003e“Mom!” her daughter said excitedly. “Maryellen’s having the baby.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“She might even have delivered already. Grace phoned yesterday evening to tell me. She and Cliff spent the night out at Jon and Maryellen’s. They’re watching Katie.”\u003c/p\u003e\n\u003cp\u003e“That’s wonderful news.” Charlotte was so pleased for Maryellen—and her mother. Grace was having a good year, and she deserved it. Two grandbabies due within a few weeks of each other, a new husband and—Charlotte frowned. Although Grace’s happiness was unmistakable, a cloud darkened the horizon. Will was returning to Cedar Cove. Her son’s sudden desire to move here concerned Charlotte. Her fear was that Will intended to meddle in Grace’s relationship with Cliff.\u003c/p\u003e\n\u003cp\u003e“Mom?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“Oh, sorry, I was just thinking.”\u003c/p\u003e\n\u003cp\u003e“I have to get back to the courthouse—I came to pick up something I need for dinner. It’s tofu, but don’t tell Jack. He eats it all the time, only I don’t let him know.”\u003c/p\u003e\n\u003cp\u003e“Good for you.” Grabbing a cart, Charlotte entered the store. “Be sure and call me when you hear about the baby.”\u003c/p\u003e\n\u003cp\u003e“I will,” Olivia promised. “Talk to you later.”\u003c/p\u003e\n\u003cp\u003eCharlotte exhaled heavily. Life did have its share of worries. Her first concern was Ben; she’d tackle Will later. Ben had been so preoccupied lately, so distracted, and try as she might, she couldn’t put her finger on what was wrong. That thought weighed on her as she hurriedly finished her tasks. She bought milk and bread, went to the cleaners, then headed home.\u003c/p\u003e\n\u003cp\u003eYes, she’d ask him. Further deliberation had confirmed her decision. Asking him was the only sensible way to handle the situation. Charlotte was a sensible woman, or she had been, until she’d fallen in love with Ben Rhodes.\u003c/p\u003e\n\u003cp\u003eOn the drive back to the house, Charlotte stopped at a roadside stand selling strawberries freshly picked on Vashon Island. She purchased two large flats to put up strawberry preserves. Perhaps she could tempt Ben by serving scones topped with sweetened strawberries and whipped cream for dessert this evening. He enjoyed scones, especially when they were hot from the oven. As she’d always known, a clever woman had ways of getting information from a man. Her granddaughter might tell her this was an old-fashioned approach, but whatever worked…\u003c/p\u003e\n\u003cp\u003eThe moment she got home, Ben came out to carry in the strawberries and the few groceries she’d bought.\u003c/p\u003e\n\u003cp\u003eCharlotte followed with the dry cleaning. The prices they charged for pressing a shirt were highway robbery, but Ben insisted. He didn’t want her expending time or energy at the ironing board when the cleaner was happy to do it.\u003c/p\u003e\n\u003cp\u003eBen brought everything into the kitchen, and she saw that he hadn’t eaten the lunch she’d left for him. Rather than comment, she mentioned Olivia’s news. “Maryellen’s having the baby.”\u003c/p\u003e\n\u003cp\u003eHer words fell on deaf ears.\u003c/p\u003e\n\u003cp\u003e“Did you hear me, Ben? Maryellen’s in labor.”\u003c/p\u003e\n\u003cp\u003e“Oh, sorry,” he said, recovering quickly. “That’s great.”\u003c/p\u003e\n\u003cp\u003e“It is,” Charlotte agreed. “Olivia said she’d let us know as soon as Grace calls her.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eShaking her head, Charlotte set the kettle on the stove to heat water for tea. Whatever was wrong had grown markedly worse in the time she’d been away.\u003c/p\u003e\n\u003cp\u003e“These are a lot of strawberries,” Ben commented as he picked up a large red one.\u003c/p\u003e\n\u003cp\u003e“Let me wash a few of those for you to nibble on,” Charlotte suggested. “They were just picked this morning and couldn’t be sweeter.” The vendor had told her as much.\u003c/p\u003e\n\u003cp\u003eBen set the strawberry down and shook his head. “Thanks, but no.”\u003c/p\u003e\n\u003cp\u003eCharlotte couldn’t stand it a minute longer; she had to know. “Is everything all right, Ben?” she asked.\u003c/p\u003e\n\u003cp\u003eHe walked over to where Harry had curled himself up on a kitchen chair and began to pet her cat. “Of course.”\u003c/p\u003e\n\u003cp\u003e“I don’t mean to pry,” she continued, “but you just haven’t been yourself lately.”\u003c/p\u003e\n\u003cp\u003eBen pulled her close and hugged her, sighing deeply. “Are you sure you want to know?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“It’s my son,” he confessed.\u003c/p\u003e\n\u003cp\u003e“David?”\u003c/p\u003e\n\u003cp\u003eHe sighed again. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Here,” she said, the practical side of her nature immediately taking over. “I’ll pour water in the teapot and while it steeps we can start to talk.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to burden you with this,” Ben said, dismissing the offer.\u003c/p\u003e\n\u003cp\u003e“Nonsense! I’m your wife.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Ben, please. Unless you confide in me, I won’t feel comfortable sharing my worries about my own children.”\u003c/p\u003e\n\u003cp\u003e“Your children are nothing like mine—especially David,” he murmured.\u003c/p\u003e\n\u003cp\u003e“That’s not true, but we can discuss Will later.”\u003c/p\u003e\n\u003cp\u003e“Will?” Ben looked up, his face a picture of astonishment.\u003c/p\u003e\n\u003cp\u003e“I’ll say more about him when we’re finished. Please, tell me what’s got you in such a state.”\u003c/p\u003e\n\u003cp\u003eHe seemed relieved to finally tell her, and Charlotte silently scolded herself for delaying this conversation. Instead of fretting, she should’ve asked him sooner.\u003c/p\u003e\n\u003cp\u003eHe waited until she’d poured hot water in the teapot and assembled cups. When she sat down with him at the table, she noticed that he’d placed Harry on his lap. Not so long ago, the cat had taken exception to sharing Charlotte’s affections, but Ben had won him over—as well as everyone else in her life. Harry purred contentedly as Ben stroked his sleek body.\u003c/p\u003e\n\u003cp\u003e“You know Steven phoned a little while ago.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Charlotte had talked briefly with Ben’s older son. It’d been a bit awkward at first, but Steven sounded like a fine young man. Unlike his brother, he wasn’t a charmer and seemed to have difficulty carrying on a conversation. Fortunately Charlotte had no such problem and she’d done her best to let him know how pleased she was to be part of his family.\u003c/p\u003e\n\u003cp\u003e“Do you remember Steven said that David had gotten himself into a financial mess—again?”\u003c/p\u003e\n\u003cp\u003e“Yes. He declared bankruptcy a few years ago, didn’t he?”\u003c/p\u003e\n\u003cp\u003e“Right,” Ben confirmed. He looked past Charlotte, not meeting her eyes. “What I didn’t tell you has to do with yet another mess my son’s gotten himself into. I’m not sure of all the details. According to Steven, David was recently arrested for fraud. It was because of an insurance claim he made.”\u003c/p\u003e\n\u003cp\u003eArrested? “Oh, dear,” she gasped.\u003c/p\u003e\n\u003cp\u003eBen continued to pet Harry, his fingers smoothing the cat’s soft fur. “Then all of a sudden, he had the money to hire a high-priced attorney to represent him.”\u003c/p\u003e\n\u003cp\u003e“All of a sudden?” Charlotte repeated. “You mean he came into some unexpected funds?”\u003c/p\u003e\n\u003cp\u003eBen grew very still. “Apparently this was shortly after the break-in and arson at The Lighthouse.”\u003c/p\u003e\n\u003cp\u003eCharlotte felt a chill. “Are you saying David might somehow have been involved in that?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said hoarsely.\u003c/p\u003e\n\u003cp\u003e“Ben, surely David would never do anything so…so vile.”\u003c/p\u003e\n\u003cp\u003e“You think I want to believe my own son could do something like this?” he asked. “I have lived with this information for nearly a week now, and I can’t ignore the possibility any longer. I checked the dates and they coincide.”\u003c/p\u003e\n\u003cp\u003e“Oh, Ben.”\u003c/p\u003e\n\u003cp\u003eAll the color had drained from Ben’s face. “I didn’t say anything earlier because…because I didn’t know if I could. It’s one thing to suspect my son of such an ugly, underhanded crime and another to give his name to Sheriff Davis as a suspect.”\u003c/p\u003e\n\u003cp\u003eCharlotte’s heart ached for her husband. What an impossible decision he had to make. Regardless of anything else, the young man was Ben’s son. No father wanted to be responsible for turning his own child over to the authorities.\u003c/p\u003e\n\u003cp\u003e“While you were at the Senior Center this morning, I paid Sheriff Davis a visit.”\u003c/p\u003e\n\u003cp\u003e“Oh, Ben.” Charlotte stretched her arm across the table, wanting to clasp his hand, to offer what comfort she could. He didn’t seem to notice.\u003c/p\u003e\n\u003cp\u003e“Sheriff Davis took down all the information and said he’d look into it,” Ben said stoically, gazing down at the cat. “If it does turn out that David had something to do with the fire, promise me, Charlotte, that you and your family—” He seemed incapable of continuing. \u003c/p\u003e","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-45.html","bookId":1947,"creation":"Oct 5, 2019 10:06:35 AM","modification":"Oct 5, 2019 10:06:35 AM"}
