{"id":111193,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDeirdre crossed her arms on her chest. “What do you mean stall?”\u003c/p\u003e\n\u003cp\u003e“He’ll want this matter concluded now, before the Vunta back off, but he can’t just back out of the marriage, so he’ll demand a higher amount and when we fail to deliver, he will claim to be gravely insulted.”\u003c/p\u003e\n\u003cp\u003e“She could pretend to be sick,” Nina said.\u003c/p\u003e\n\u003cp\u003e“No, then he’ll claim we’re insulting him by withholding her. It has to be something else, something he can’t weasel out of.”\u003c/p\u003e\n\u003cp\u003eAn idea snapped together. So simple and so ironic. Deirdre smiled. “Robert?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“How much smut do we have in our databanks?”\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003e“I feel dirty.” Fatima laid her head back. “I don’t think I can take anymore.”\u003c/p\u003e\n\u003cp\u003e“Found another one,” Michel Rashvili announced. “The man on the back, legs bent, the woman holds his hands on the sides and squats onto his…”\u003c/p\u003e\n\u003cp\u003e“The amazon,” Deirdre and Nina said at the same time.\u003c/p\u003e\n\u003cp\u003e“Did that one,” Robert said.\u003c/p\u003e\n\u003cp\u003e“I thought the amazon was the one in a chair.” Michel yawned.\u003c/p\u003e\n\u003cp\u003e“No, that’s side-saddle.” Nina yawned too.\u003c/p\u003e\n\u003cp\u003e“Has anyone actually done the amazon? I mean like in real life?” Michel wondered.\u003c/p\u003e\n\u003cp\u003e“I have.” Duke of Rodkil yawned. “It’s overrated.”\u003c/p\u003e\n\u003cp\u003eDeirdre blinked her eyes, trying to stay awake. Whatever embarrassment she had possessed had fled hours ago.\u003c/p\u003e\n\u003cp\u003eRobert surveyed the room strewn in pornography sheets and sex toys. “It looks like we had an orgy.” He stifled a yawn, gave up and yawned. “Now look what you’re started, Rashvili. Don’t you know yawning is contagious? We all need a nap.”\u003c/p\u003e\n\u003cp\u003eNina put her head down and snored.\u003c/p\u003e\n\u003cp\u003e“Highly appropriate post-orgy, I would say,” His Grace murmured.\u003c/p\u003e\n\u003cp\u003eThe comscreen flared and the face of the chief of security came into the view. Nina jerked awake.\u003c/p\u003e\n\u003cp\u003e“We have contact with the Reigh. They want the bride and they want her now.” Timur squinted. “What exactly have you all been doing?”\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eThe booster shot coursed through Deirdre’s veins, spreading a slightly cool sensation all the way from her toes to her scalp. She felt light as a feather. Twelve hour from now she would pay the price by passing out, but for now she felt fantastic.\u003c/p\u003e\n\u003cp\u003eThe elation evaporated when she entered the meeting room. The Reigh guard had been doubled. Nagrad’s face promised a storm.\u003c/p\u003e\n\u003cp\u003e“Are you prepared to accept my terms?”\u003c/p\u003e\n\u003cp\u003eThe question wasn’t aimed at her, but the harsh tone lanced her anyway.\u003c/p\u003e\n\u003cp\u003e“Of course, Lord Nagrad,” Jason smoothly said.\u003c/p\u003e\n\u003cp\u003e“Thirty billion?” The disbelief was plain on Nagrad’s face.\u003c/p\u003e\n\u003cp\u003e“Indeed. However, before the moneys and the lady can exchange hands, there is a small matter that requires your attention. A mere formality.”\u003c/p\u003e\n\u003cp\u003e“What matter?”\u003c/p\u003e\n\u003cp\u003eThe Duke smiled. “In accordance with the formal union contract, the bride requests a full accounting of her duties.”\u003c/p\u003e\n\u003cp\u003e“I’ve delivered the full accounting during our first meeting.”\u003c/p\u003e\n\u003cp\u003eNot even a single glance in her direction. I am just an animal to be sold and bought.\u003c/p\u003e\n\u003cp\u003e“Yes, but the accounting states, and I quote, ‘…and to not shun the husband’s request in the bedroom, lest she sabotage the begetting of an heir.’ This fails to specify the exact nature of your attentions.”\u003c/p\u003e\n\u003cp\u003e“This was also covered in our first meeting.”\u003c/p\u003e\n\u003cp\u003e“But my lord,” she said, keeping her voice as sweet as she could. “That was but a very small part. The subject must be explored fully before I commit to you. I have a right to know what is required of me.”\u003c/p\u003e\n\u003cp\u003e“We’ve taken the liberty of preparing a short list of all ‘duties’ known to the bride.” With elegance of a dancer, Jason slid the reader card onto the table. “All that remains is for us to examine each entry and to determine whether or not it will enter into accounting. Should you require anything beyond what is detailed here, we will do our best to incorporate it into our list.”\u003c/p\u003e\n\u003cp\u003eNagrad slid the card into his reader. It took him a good minute to scroll to the end of the list. His eyes blazed. “How many entries are here?”\u003c/p\u003e\n\u003cp\u003e“Five hundred and forty five.” The Duke’s voice couldn’t have been sweeter.\u003c/p\u003e\n\u003cp\u003e“I request all of them,” Nagrad said.\u003c/p\u003e\n\u003cp\u003e“In accordance to entry two hundred and three, will you then submit to having a cast of your anal canal so the dildo employed to penetrate your anus can be made to perfect proportions?”\u003c/p\u003e\n\u003cp\u003eThe Reigh bodyguards froze.\u003c/p\u003e\n\u003cp\u003eNagrad read the entry. “I won’t be requesting that one.”\u003c/p\u003e\n\u003cp\u003eDeirdre leaned forward. “With all due respect, my lord, I insist you review each one to avoid such misunderstandings.”\u003c/p\u003e\n\u003cp\u003eHe finally turned to her. “I refuse to submit to this idiocy. The list could take days to review.”\u003c/p\u003e\n\u003cp\u003e“It’s my right under the law. You must review the list with the witnesses present. You have made an offer of a formal commitment. It cannot be withdrawn lightly.”\u003c/p\u003e\n\u003cp\u003eShe could almost hear him grinding his teeth. “You are not a Reigh. You have no rights.”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. You gave them to me when you delivered the statement of full accounting of my duties and requested a dowry. You have followed the law up to this point as if I was a Reigh bride. Does the doctrine exist only until it suits you, my Lord?”\u003c/p\u003e\n\u003cp\u003eFor a moment she thought he’d reach across the table and strangle her. Instead he sat back. His face relaxed it must’ve taken a monumental effort of will on his part and the Reigh lord picked up the reader. “Very well. The first section is titled ‘Terms and Devices’. I believe we can skip that one.”\u003c/p\u003e\n\u003cp\u003e“Would my lord care to define the term anal plug?” Deirdre asked. “How about the difference between the soft and a hard one?”\u003c/p\u003e\n\u003cp\u003eIf his eyes could shoot lightning, she would’ve been fried on the spot.\u003c/p\u003e\n\u003cp\u003e“Very well then.” His Grace announced with a placating smile. “Term number one: penis. Also known as dick, cock, Johnson, lance, sword, thruster, little soldier.”\u003c/p\u003e\n\u003cp\u003eDeirdre leaned toward. “You may want to call for some refreshments, my lord. It will be a very long day.”\u003c/p\u003e\n\u003cp\u003eFour hours later Nagrad tossed his reader onto the table. “I need some fresh air.”\u003c/p\u003e\n\u003cp\u003eHe strode onto the balcony. Deirdre rose, stretching, and went outside also.\u003c/p\u003e\n\u003cp\u003eThe second she stepped out of the room, Nagrad took her by the elbow. “Come with me, my Lady.”\u003c/p\u003e\n\u003cp\u003eHis touch on her arm was very light, yet she knew with absolute certainty she couldn’t get away. He led her to the farthest point of the balcony out of the ear shot of the bodyguards within the room. “It’s you,” he said. “I know it’s you. You came up with this farce.”\u003c/p\u003e\n\u003cp\u003e“What gives you that idea?”\u003c/p\u003e\n\u003cp\u003e“You were gloating in every second of it. Why are you doing this?”\u003c/p\u003e\n\u003cp\u003e“I simply want to know what’s required of me.”\u003c/p\u003e\n\u003cp\u003eHe turned away from her, plainly trying to keep control of himself. “This matter could be settled later. It’s of no consequence.”\u003c/p\u003e\n\u003cp\u003e“It’s of a great consequence to me. You opened the door, all I had to do was walk through it.”\u003c/p\u003e\n\u003cp\u003e“I opened the door?” he snarled.\u003c/p\u003e\n\u003cp\u003e“Temper, temper, my Lord. I’m sure your guards would rush to my rescue if you were to choke me. Patience is a virtue.”\u003c/p\u003e\n\u003cp\u003eHe stared at her. “God preserve the man who makes an enemy of you.” He turned on his heel and stalked off.\u003c/p\u003e\n\u003cp\u003eDeirdre sighed and went back to the room. As she slumped into her chair, His Grace leaned to her. “How did it go?”\u003c/p\u003e\n\u003cp\u003e“My future husband hates me with a passion of a thousand stars,” she said.\u003c/p\u003e\n\u003cp\u003eThe Duke gently patted her hand. “We’ll get through this.”\u003c/p\u003e\n\u003cp\u003e“That’s what I’m afraid of.”\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003e“Entry number three hundred and twelve: Multiple partners.” The Duke droned on.\u003c/p\u003e\n\u003cp\u003eDeirdre put her head onto her hands. Post-booster cooldown required at least twelve hours of sleep. She barely got eight before the Reigh demanded her presence. Her head hurt. Her ears were filled with something soft and mushy. Across the table Nagrad looked exhausted. The two Reigh witnesses, picked by him from the bodyguard, didn’t look much better.\u003c/p\u003e\n\u003cp\u003e“Subsection A. Two male partners and one female partner.”\u003c/p\u003e\n\u003cp\u003e“Pass,” Nagrad called. There were deep bags under his eyes.\u003c/p\u003e\n\u003cp\u003e“Let it be known that Lord Nagrad abandons all claim to the act described in entry number three hundred and twelve, subsection A and all the subsequent positions described or listed under subsection A.”\u003c/p\u003e\n\u003cp\u003e“So noted,” the witnesses intoned.\u003c/p\u003e\n\u003cp\u003eEveryone made the appropriate notations in their copy of the list.\u003c/p\u003e\n\u003cp\u003e“Subsection B: Two female partners and one male partner.” The Duke waited for a moment, but Nagrad appeared absorbed in his reader.\u003c/p\u003e\n\u003cp\u003e“Position one: the male partner assumes horizontal position with his back to the surface. The first female partner kneels.”\u003c/p\u003e\n\u003cp\u003eDeirdre rolled her eyes. Just pass now, you know you can’t take it in front of the witnesses. Nagrad listened to the description with the look of somber concentration. “Pass,” he said finally.\u003c/p\u003e\n\u003cp\u003e“Let it be known that Lord Nagrad abandons all claim to the act described in entry number three hundred and twelve, subsection A, position one.”\u003c/p\u003e\n\u003cp\u003eDeirdre stuck her tongue out at him.\u003c/p\u003e\n\u003cp\u003eNagrad mouthed, “After we’re married.”\u003c/p\u003e\n\u003cp\u003e“So noted,” the witnesses mumbled.\u003c/p\u003e\n\u003cp\u003e“Position number two: the first female partner clasps the male partner’s.”\u003c/p\u003e\n\u003cp\u003eThe Duke’s comlink beeped. “Excuse me. It appears I have an urgent call.” He strode away onto the balcony.\u003c/p\u003e\n\u003cp\u003eDeirdre put her head onto the table with a soft bump. Marry me off, I don’t care. I just want some sleep.\u003c/p\u003e\n\u003cp\u003eShe heard the Duke’s footsteps. They stopped next to her. “Thirty five billion,” he said softly. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mere-formality/page-5.html","bookId":1588,"creation":"Oct 6, 2019 12:20:10 AM","modification":"Oct 6, 2019 12:20:10 AM"}
