{"id":80944,"no":35,"title":"Page 35","content":"\u003cp\u003eI hadn’t seen her but every woman who reminded me of her made me jump out of my seat until Gus had to tell me to stop being such a heat score.\u003c/p\u003e\n\u003cp\u003eI switched the subject onto something else. Gus’s health problems.\u003c/p\u003e\n\u003cp\u003e“So what was wrong with you, Gus?” I asked him, the fingers on my good arm now tapping on the table as I scanned the crowds.\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything but I knew he heard me.\u003c/p\u003e\n\u003cp\u003e“First Lydia, then Dan. Both mentioned you had health problems or something for a while. Just curious as to what it was.”\u003c/p\u003e\n\u003cp\u003eWhen he still didn’t say anything, I tore my eyes away from the building and looked at him. He was staring off into the distance, looking utterly lost.\u003c/p\u003e\n\u003cp\u003eHe sighed and looked down at his hands. “It’s personal, Camden. No offense.”\u003c/p\u003e\n\u003cp\u003e“I’m not offended,” I told him, turning my gaze back to the crowd. “But since we’ve been through a lot this past week, I figured I’d be privy to some personal things. You know everything about me. What happened with you? Why are you not matching up with the man that Ellie described to me?”\u003c/p\u003e\n\u003cp\u003e“People change.”\u003c/p\u003e\n\u003cp\u003e“Some people do. They usually have their reasons.”\u003c/p\u003e\n\u003cp\u003eHe chugged his entire beer then slammed it down before motioning for the waiter to bring him another. “Ah hell.”\u003c/p\u003e\n\u003cp\u003eOnce the waiter disappeared, he leaned back in his chair and said, “I had mental health problems, Camden. I sort of lost my mind for a while.”\u003c/p\u003e\n\u003cp\u003eHe said this so casually that it took me a bit to realize the gravity of it all.\u003c/p\u003e\n\u003cp\u003e“For real?”\u003c/p\u003e\n\u003cp\u003eHe smiled sadly. “Yes. For real.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“A girl broke my heart. Isn’t that always the way?”\u003c/p\u003e\n\u003cp\u003eI leaned in closer. “What girl?”\u003c/p\u003e\n\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003eI frowned. “What happened?”\u003c/p\u003e\n\u003cp\u003eHis face twisted as he grappled with something inside. “It … it wasn’t meant to be. She was married to a good friend of mine. Once upon a time, she should have been married to me. I guess I got stupid, fell back in love with her. It didn’t go anywhere. She made it seem like it would, like it wouldn’t be just an affair but … anyway I believed her. She made a living out of lying and I should have known the difference. Played me for a fool, like she played everyone else.”\u003c/p\u003e\n\u003cp\u003eI cleared my throat. “Gus, don’t tell me this is a cautionary tale meant for me.”\u003c/p\u003e\n\u003cp\u003eHis eyes shot sideways to mine. “No, Camden. You asked. I’m telling you the truth what happened. But if you want to learn anything out of this it’s … don’t lose your head. Lose your heart but don’t fucking lose your head. You don’t know if you’ll get that back.”\u003c/p\u003e\n\u003cp\u003e“What would you do if you saw her again? The woman?”\u003c/p\u003e\n\u003cp\u003e“Oh, now it’s a cautionary tale.”\u003c/p\u003e\n\u003cp\u003eI shrugged, my eyes back to the line-up. Still no Ellie and it was getting late. “I’m just curious. I know what it was like for me when Ellie came back into my life. I suppose I kind of lost my head too. Fuck, I know I did. How else did I fucking end up here?”\u003c/p\u003e\n\u003cp\u003e“Touché,” Gus said raising his beer. I clinked my coffee cup against his. “What a couple of fucking headless chumps we are.”\u003c/p\u003e\n\u003cp\u003eI chuckled at that and drained the last bit of coffee into my mouth.\u003c/p\u003e\n\u003cp\u003eThen everything around me whirled to a halt.\u003c/p\u003e\n\u003cp\u003eSlow-motion.\u003c/p\u003e\n\u003cp\u003eEllie, Ellie, Ellie.\u003c/p\u003e\n\u003cp\u003eThere she was.\u003c/p\u003e\n\u003cp\u003eShe was leaving the club and walking down the center of the plaza. She was alone. She was devastatingly beautiful, so much so that it was surreal to even be admiring her beauty in such a moment of complete shock.\u003c/p\u003e\n\u003cp\u003eThere she was.\u003c/p\u003e\n\u003cp\u003eHer head was down, looking at the ground a few feet in front of her. She was walking fast, in a hurry, in a bright red dress that glowed on a night like tonight. It was cut all the way down to her stomach, showing off a new tan, attracting the blatant stares of every single man she walked past. Her black hair was done up in ringlets, like a film star, her makeup was seductive and smoky. I’d seen her dressed up to the nines in Las Vegas, but it was nothing like this. This was different – she looked different, walked different, was different. My heart clenched painfully as I was assaulted with things I had no time to think about.\u003c/p\u003e\n\u003cp\u003e“Gus,” I managed to say. I couldn’t look away.\u003c/p\u003e\n\u003cp\u003e“I see her,” he said. “She doesn’t see us”\u003c/p\u003e\n\u003cp\u003e“She doesn’t see anything.”\u003c/p\u003e\n\u003cp\u003eSuddenly Gus was getting up, pushing his chair back with a loud scrape and Ellie disappeared around a crowd of people. “We need to follow her. Now.”\u003c/p\u003e\n\u003cp\u003eHe threw a handful of pesos down on the table and we quickly got onto the plaza. She was far in front of us, a quick red slash in the crowds of people. We tried to walk as fast as we could without looking like we were chasing someone, but after Gus had collided with the third gawking tourist, we knew it wouldn’t matter. Everyone was chasing someone in Mexico.\u003c/p\u003e\n\u003cp\u003eWe started trotting as she disappeared around the corner. Where was she going? Why was she dressed like that and why was she alone?\u003c/p\u003e\n\u003cp\u003eThen I remembered what Felipe had said back in Ocean Springs. That they took her to see Travis. That they wanted her at first to kill her parents. Were the two connected?\u003c/p\u003e\n\u003cp\u003eOr …\u003c/p\u003e\n\u003cp\u003e“He’s using her as an assassin,” I said as we were about to round the corner.\u003c/p\u003e\n\u003cp\u003eGus pulled back on my good shoulder when we reached the edge of the plaza. “Wait. We have to be careful.”\u003c/p\u003e\n\u003cp\u003eHe poked his head around and then waved me over. I did the same. Ellie was walking down the street but cutting across it to an idling SUV. We walked quickly in the shadows, ducking between cars, trying to get close enough to see who was driving the beat-up looking Range Rover. We couldn’t see inside.\u003c/p\u003e\n\u003cp\u003e“Veracruz license plate, YBA something,” Gus said from beside me just as Ellie got inside.\u003c/p\u003e\n\u003cp\u003eI looked down. He had night vision goggles in his hands.\u003c/p\u003e\n\u003cp\u003e“Where the hell did you get that?” I asked.\u003c/p\u003e\n\u003cp\u003e“My pants,” he answered.\u003c/p\u003e\n\u003cp\u003eThe car began to drive off with Ellie inside. I leaped out onto the street, contemplating running after the car, waving my arms, doing something.\u003c/p\u003e\n\u003cp\u003e“We’re not going to lose her,” Gus said. “Don’t worry.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah, you want to run after the car?”\u003c/p\u003e\n\u003cp\u003e“I’d rather drive,” he said. He took out a screwdriver-looking thing from his pocket and jabbed it into the lock of the hatchback next to us. He busted open the lock with ease and motioned for me to get in the other side while he unlocked the door and got started on the wires beneath the steering wheel.\u003c/p\u003e\n\u003cp\u003e“I’m impressed,” I said.\u003c/p\u003e\n\u003cp\u003e“To know how to catch car thieves, you have to know how to steal a car,” he grunted. The car started with a roar as if to punctuate his sentence and we were bounding down the street, trying to catch up with the Range Rover that was now turning left onto a busy street.\u003c/p\u003e\n\u003cp\u003eWe plowed through the lights as they went amber, under the early Christmas decoration wreaths hung above the intersections. The Range Rover was now two cars in front of us. Perfect stalking distance.\u003c/p\u003e\n\u003cp\u003eGus navigated the stolen car through the Friday night traffic with ease. “We’ll return the car tomorrow.”\u003c/p\u003e\n\u003cp\u003eEnergy and twisted excitement was flowing through me. “Gus, I don’t really care. I’ll do anything not to lose her, a car is nothing.”\u003c/p\u003e\n\u003cp\u003e“I can tell.”\u003c/p\u003e\n\u003cp\u003eWe followed the Range Rover as it headed out of the city and onto the highway leading south to Alvarado.\u003c/p\u003e\n\u003cp\u003e“Did you hear what I said about Ellie … I think Javier’s using her as an assassin. Or at least some sort of attempt to get Travis, to kill him.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I figured that.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?” I pulled my eyes away from the Rover long enough to give him a betrayed look.\u003c/p\u003e\n\u003cp\u003e“Because you’d lose your nut, Camden. I know how much she means to you. Boy, do I ever.” He shook his head to himself.\u003c/p\u003e\n\u003cp\u003e“Javier is putting her in Travis’s lap.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t expect anything less from him.”\u003c/p\u003e\n\u003cp\u003e“Then why aren’t you upset?”\u003c/p\u003e\n\u003cp\u003e“Not everyone shows it like you. Just because I’m not setting people’s faces on fire, doesn’t mean I’m not upset.”\u003c/p\u003e\n\u003cp\u003eI couldn’t tell if that was a dig at what I did to his best friend or not, so I decided to let it go. We had bigger things to do than argue.\u003c/p\u003e\n\u003cp\u003e“Why is Ellie doing this? She was there. She was in his club, looking like … a goddess.”\u003c/p\u003e\n\u003cp\u003e“Because this is Travis. And Ellie has never forgotten what he did to her.”\u003c/p\u003e\n\u003cp\u003e“Her parents had a part in it too.”\u003c/p\u003e\n\u003cp\u003eHis face grew grim. In the flash of headlights from oncoming traffic, his skin was completely white. “They did. And I’m sure that’s why Javier thought he could get Ellie to … well, whatever that cartel kid back in Mississippi told us.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand.” I sat back in the seat, shaking my head. “I just don’t. Why doesn’t Javier kill these people himself? Why get her to do it?”\u003c/p\u003e\n\u003cp\u003e“Maybe he has his own agenda. Or maybe he thinks he’s doing her a favor. Maybe that’s why she was out there tonight. She agrees with him.”\u003c/p\u003e\n\u003cp\u003e“How could she agree to anything that man says?”\u003c/p\u003e\n\u003cp\u003e“I don’t think you really understand the history those two share.”\u003c/p\u003e\n\u003cp\u003eI felt like punching my fist through the window with my bad arm. Just to feel the pain.\u003c/p\u003e\n\u003cp\u003e“I need another pill,” I said, grinding my teeth instead.\u003c/p\u003e\n\u003cp\u003e“No, you don’t,” he said sharply. “We need you to be thinking straight right now. We need our Ellie back, you got it?”\u003c/p\u003e\n\u003cp\u003eOur Ellie. I liked the sound of that.\u003c/p\u003e\n\u003cp\u003e“I got it.”\u003c/p\u003e\n\u003cp\u003eWe ended up following Ellie all the way into Alvarado. The town was quiet and our presence this late at night would be known so we had to take our time, hanging way back and occasionally turning off the headlights.\u003c/p\u003e\n\u003cp\u003eThe Range Rover parked outside of a fish shop on the malecón, right on the edge of the sea. We parked up the street, watching Ellie’s and Javier’s silhouettes leave the car and go into the building. I didn’t need features to recognize the man. Sometimes a featureless black shape was all it took.\u003c/p\u003e\n\u003cp\u003eWe decided to head to the beach and get a better look at the place from there. We edged silently along the malecón wall, the walkway between the sea and the beach, until we came across a concrete pier with a few fishing boats tied up. We jumped into one and crouched down low, hiding behind smelly crab traps.\u003c/p\u003e\n\u003cp\u003eGus had out the night vision goggles and was playing with them when a light went on in the upstairs of the fish market.\u003c/p\u003e\n\u003cp\u003e“Look,” I breathed out. A sliding glass door opened and Ellie stepped out onto the balcony, still in her dress. She closed the door halfway behind her and walked to the railing, leaning against it, staring out at the sea.\u003c/p\u003e\n\u003cp\u003eI snatched the goggles out of Gus’s hands to get a better look. She looked stunning even in greeny haze of the night vision. She still took my breath away, so much so I didn’t have space in my brain to ponder the big picture—where she was and who else she was with.\u003c/p\u003e\n\u003cp\u003e“She must be blackmailed somehow,” I whispered to Gus. “Otherwise she could jump down onto the sand and leave. She could run away. She’s good at that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shooting-scars-the-artists-trilogy-2/page-35.html","bookId":2733,"creation":"Oct 5, 2019 4:31:43 PM","modification":"Oct 5, 2019 4:31:43 PM"}
