{"id":79267,"no":16,"title":"Page 16","content":"\u003cp\u003eMolly went next. “I never did it with anyone in public!”\u003c/p\u003e\n\u003cp\u003eThat time, Joy took the bottle. “It was at a park,” she explained. “It was getting dark. I doubt anyone saw us.”\u003c/p\u003e\n\u003cp\u003eShay said, “Does a restaurant bathroom count?”\u003c/p\u003e\n\u003cp\u003eI could feel my face get hot. I was dreading my turn. I hadn’t done much of anything. My I Nevers could probably last all night.\u003c/p\u003e\n\u003cp\u003e“I never hooked up with Chad from the fourth floor!”\u003c/p\u003e\n\u003cp\u003eMolly said, collapsing into a fit of giggles.\u003c/p\u003e\n\u003cp\u003eJoy threw a pillow at her. “No fair! I told you that in secret.”\u003c/p\u003e\n\u003cp\u003e“Drink! Drink!” everyone chanted.\u003c/p\u003e\n\u003cp\u003eJoy took a swig. Wiping her mouth, she said, “Your turn, Isabel.”\u003c/p\u003e\n\u003cp\u003eMy mouth felt dry all of a sudden. “I never …” Had sex. “I never … played this game before,” I finished lamely.\u003c/p\u003e\n\u003cp\u003eI could feel Joy’s disappointment in me. Maybe she’d thought we could be close friends too and now she was rethinking it.\u003c/p\u003e\n\u003cp\u003eAnika chuckled just to be polite, and then they all took turns drinking before Joy started it up again with,\u003c/p\u003e\n\u003cp\u003e“I never went skinny-dipping in the ocean. In a pool, though!”\u003c/p\u003e\n\u003cp\u003eNope, never did that either. Almost, that time I was fifteen, with Cam Cameron. But almost didn’t count.\u003c/p\u003e\n\u003cp\u003eI ended up taking one drink when Molly said, “I never dated two people in the same family.”\u003c/p\u003e\n\u003cp\u003e“You dated brothers?” Joy asked me, looking interested all of a sudden. “Or a brother and a sister?”\u003c/p\u003e\n\u003cp\u003eCoughing a little, I said, “Brothers.”\u003c/p\u003e\n\u003cp\u003e“Twins?” Shay said.\u003c/p\u003e\n\u003cp\u003e“At the same time?” Molly wanted to know.\u003c/p\u003e\n\u003cp\u003e“No, not at the same time. And they’re just regular brothers,” I said. “They’re a year apart.”\u003c/p\u003e\n\u003cp\u003e“That’s kind of badass,” Joy said, giving me an approv-ing look.\u003c/p\u003e\n\u003cp\u003eAnd then we went on to the next thing. When Shay said she’d never stolen before and Joy took a drink, I saw the look on Anika’s face, and I had to bite the insides of my cheeks to keep from laughing. She saw me, and we exchanged a secret look.\u003c/p\u003e\n\u003cp\u003eI saw Joy around after that, in the hall bathroom and in the study, and we talked, but we never became close.\u003c/p\u003e\n\u003cp\u003eJillian and I never became best buddies either, but she ended up being a pretty good roommate.\u003c/p\u003e\n\u003cp\u003eOf all those girls, Anika was the one I ended up being closest to. Even though we were the same age, she took me under her wing like a little sister, and for once I didn’t mind being the little sister. Anika was too cool for me to care. She smelled the way I imagined wildflowers smelled when they grew in sand. Later, I found out it was the oil she put in her hair. Anika almost never gossiped, she didn’t eat meat, and she was a dancer. I admired all of those things about her.\u003c/p\u003e\n\u003cp\u003eI was sorry we’d never be roommates. From now on, I’d only ever have one roommate again—my husband.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eI woke up early the next day. I showered, threw away my shower shoes, and got ready one last time in my dorm room. I didn’t put my ring on, just in case. I put it in the zippered pocket in my purse. My dad wasn’t the most observant guy when it came to accessories, so it wasn’t likely, but still.\u003c/p\u003e\n\u003cp\u003eMy dad was at the dorm by ten o’clock to move me out. Jeremiah helped. I didn’t even have to give him a wakeup call the way I’d planned; he showed up at my room at nine thirty with coffee and donuts for my dad.\u003c/p\u003e\n\u003cp\u003eI stopped in some of the girls’ rooms, hugging them good-bye, wishing them good summers. Lorrie said, “See you in August,” and Jules said, “We have to hang out more next year.” I said good-bye to Anika last, and I teared up a little. She hugged me and said, “Chill out. I’ll see you at the wedding. Tell Taylor I’ll be e-mailing her about our bridesmaid dresses.” I laughed out loud. Taylor was going to love that. Not.\u003c/p\u003e\n\u003cp\u003eAfter we were done loading up the car, my dad took us to lunch at a steak restaurant. It wasn’t super fancy, but it was a nice, a family place with leather booths and pickles at the table.\u003c/p\u003e\n\u003cp\u003e“Order whatever you like, guys,” my dad said, sliding into the booth.\u003c/p\u003e\n\u003cp\u003eJeremiah and I sat across from him. I looked at the menu and picked the New York strip because it was cheapest. My dad wasn’t poor, but he definitely wasn’t rich, either.\u003c/p\u003e\n\u003cp\u003eWhen the waitress came over to take our orders, my dad ordered the salmon, I got the New York strip, and Jeremiah said, “I’ll have the dry-aged rib eye, medium rare.”\u003c/p\u003e\n\u003cp\u003eThe rib eye was the most expensive thing on the menu. It cost thirty-eight dollars. I looked at him and thought, he probably didn’t even look at the price. He never had to, not when all his bills got sent to his dad.\u003c/p\u003e\n\u003cp\u003eThings were gonna change when we were married, that was for sure. No more spending money on dumb stuff like vintage Air Jordans or steak.\u003c/p\u003e\n\u003cp\u003e“So, what do you have going on this summer, Jeremiah?” my dad asked.\u003c/p\u003e\n\u003cp\u003eJeremiah looked at me and then back at my dad and then back at me. I shook my head just slightly. I had this vision of him asking my dad for his blessing, and it was all wrong. My dad couldn’t find out before my mother.\u003c/p\u003e\n\u003cp\u003e“I’m going to be interning at my dad’s company again,” Jeremiah said.\u003c/p\u003e\n\u003cp\u003e“Good for you,” my dad said. “That’ll keep you busy.”\u003c/p\u003e\n\u003cp\u003e“For sure.”\u003c/p\u003e\n\u003cp\u003eMy dad looked at me. “What about you, Belly? Are you going to waitress again?”\u003c/p\u003e\n\u003cp\u003eI sucked soda from the bottom of my glass. “Yeah. I’m gonna go in and talk to my old manager next week. They always need help in the summer, so it should be all right.”\u003c/p\u003e\n\u003cp\u003eWith the wedding just a couple of months away, I would just have to work doubly—triply—hard.\u003c/p\u003e\n\u003cp\u003eWhen the bill came, I saw my dad squint and take a closer look. I hoped Jeremiah didn’t notice, but when I realized he hadn’t, I wished he had.\u003c/p\u003e\n\u003cp\u003eI felt closest to my dad when I was sitting in the passenger seat of his minivan, studying his profile, the two us listening to his Bill Evans CD. Drives with my dad were our quiet times together, when we might talk about nothing and everything.\u003c/p\u003e\n\u003cp\u003eSo far the drive had been a quiet one.\u003c/p\u003e\n\u003cp\u003eHe was humming along with the music when I said,\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003eI wanted to tell him so badly. I wanted to share it with him, to have it happen during this perfect moment when I was still his little girl in the passenger seat and he was still the one driving the car. It would be a moment just between us. I’d stopped calling him Daddy in middle school, but it was in my heart—Daddy, I’m getting married. \u003c/p\u003e","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-16.html","bookId":2725,"creation":"Oct 5, 2019 4:15:44 PM","modification":"Oct 5, 2019 4:15:44 PM"}
