{"id":79278,"no":27,"title":"Page 27","content":"\u003cp\u003eThat made sense. Otherwise, how would we know how much food we needed and everything?\u003c/p\u003e\n\u003cp\u003eSo far, my list was short. Taylor, her mom, a couple of the girls we’d grown up with—Marcy and Blair and maybe Katie—Anika, my dad, Steven, and my mother.\u003c/p\u003e\n\u003cp\u003eAnd I didn’t even know if my mother was coming. My dad would—I knew he would. No matter what my mother said, he’d be there. I wanted my grandma to come too, but she’d moved out of her house in Florida and into a nursing home the year before. She’d never liked traveling, and now she couldn’t. In her invitation I decided I would write a note promising to visit with Jeremiah over fall break.\u003c/p\u003e\n\u003cp\u003eThat was pretty much it for me. I had a few cousins on my dad’s side but none I was particularly close to.\u003c/p\u003e\n\u003cp\u003eJeremiah had Conrad, three of his fraternity brothers like we agreed, his freshman-year roommate, and his dad. Last night Jere told me he could tell his dad was softening. He said Mr. Fisher asked about who was marrying us and how much we were planning on spending on this so-called wedding. Jere told him our budget. One thousand dollars. Mr. Fisher had snorted.\u003c/p\u003e\n\u003cp\u003eTo me, a thousand dollars was a lot of money. Last year, it took me the whole summer to save that much waitressing at Behrs.\u003c/p\u003e\n\u003cp\u003eOur guest list would be under twenty people. With twenty people we could have a clambake and feed everyone, easy. We could get a few kegs and some cheap champagne. Since we’d be marrying on the beach, we wouldn’t even need decorations. Just some flowers for the picnic tables, or shells. Shells and flowers. I was on a roll with this wedding.\u003c/p\u003e\n\u003cp\u003eI was writing down my ideas as Jeremiah came up the steps. The sun blazed behind him, so bright it hurt my eyes. “Morning,” I said, squinting up at him. “Where’s Con?”\u003c/p\u003e\n\u003cp\u003e“He’s still out there.” Jeremiah sat down next to me.\u003c/p\u003e\n\u003cp\u003eGrinning, he asked, “Aw, did you do all the work without me?” He was dripping wet. A drop of seawater splashed down on my notepad.\u003c/p\u003e\n\u003cp\u003e“You wish.” I wiped at the water. “Hey, what do you think about a clambake?”\u003c/p\u003e\n\u003cp\u003e“I like a good clambake,” he agreed.\u003c/p\u003e\n\u003cp\u003e“How many kegs do you think we’d need for twenty people?”\u003c/p\u003e\n\u003cp\u003e“If Peterson and Gomez are coming, that’s two already.”\u003c/p\u003e\n\u003cp\u003eI pointed my pen at his chest. “We said three brothers and that’s it. Right?”\u003c/p\u003e\n\u003cp\u003eHe nodded, and then he leaned forward and kissed me. His lips tasted salty, and his face was cool against my warm one.\u003c/p\u003e\n\u003cp\u003eI nuzzled his cheek before I broke away. “If you get Taylor’s binder wet, she’ll kill you,” I warned, putting it behind me.\u003c/p\u003e\n\u003cp\u003eJeremiah made a sad face, and then he took my arms and put them around his neck like we were slow dancing.\u003c/p\u003e\n\u003cp\u003e“I can’t wait to marry you,” he murmured into my neck.\u003c/p\u003e\n\u003cp\u003eI giggled. I was super ticklish on my neck, and he knew it. He knew almost everything about me and he still loved me.\u003c/p\u003e\n\u003cp\u003e“And what about you?”\u003c/p\u003e\n\u003cp\u003e“What about me?”\u003c/p\u003e\n\u003cp\u003eHe blew on my neck, and I burst out laughing. I tried to wriggle away from him, but he wouldn’t let me. Still giggling, I said, “Okay, I can’t wait to marry you either.”\u003c/p\u003e\n\u003cp\u003eJere left later that afternoon. I walked him out to his car.\u003c/p\u003e\n\u003cp\u003eConrad’s car wasn’t in the driveway; I didn’t know where he’d gone off to.\u003c/p\u003e\n\u003cp\u003e“Call me when you get home so I know you got there safe,” I said.\u003c/p\u003e\n\u003cp\u003eHe nodded. He was being quiet, which was unlike him. I guessed he was sad to be leaving so soon. I wished he could stay longer too. I really did.\u003c/p\u003e\n\u003cp\u003eI got on my tiptoes and gave him a big hug. “See you in five days,” I said.\u003c/p\u003e\n\u003cp\u003e“See you in five days,” he repeated.\u003c/p\u003e\n\u003cp\u003eI watched him drive off, my thumbs hooked in the belt loops of my cutoffs. When I couldn’t see his car anymore, I headed back inside the house.\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eThat first week in Cousins, I steered clear of Conrad. I couldn’t deal with one more person telling me that I was making a mistake, especially judgy Conrad. He didn’t even have to say it with words; he could judge with his eyes. So I got up earlier than him and ate meals before he did. And when he watched TV in the living room, I stayed upstairs in my room addressing invitations and looking at wedding blogs that Taylor had bookmarked for me.\u003c/p\u003e\n\u003cp\u003eI doubt he even noticed. He was pretty busy too.\u003c/p\u003e\n\u003cp\u003eHe surfed, he hung out with friends, he worked on the house. I’d never have known he was handy if I didn’t see it with my own two eyes—Conrad on a ladder checking the air-conditioning vents, Conrad repainting the mailbox. I saw it all from my bedroom window.\u003c/p\u003e\n\u003cp\u003eI was eating a strawberry Pop-Tart on the deck when he came jogging up the steps. He’d been out all morning.\u003c/p\u003e\n\u003cp\u003eHis hair was sweaty, and he was wearing an old T-shirt from his high school football days and a pair of navy gym shorts.\u003c/p\u003e\n\u003cp\u003e“Hey,” I said. “Where are you coming from?\u003c/p\u003e\n\u003cp\u003e“The gym,” Conrad said, walking past me. Then he stopped short. “Is that what you’re eating for breakfast?”\u003c/p\u003e\n\u003cp\u003eI was munching around the edge of the Pop-Tart.\u003c/p\u003e\n\u003cp\u003e“Yeah, but it’s my last one. Sorry.”\u003c/p\u003e\n\u003cp\u003eHe ignored me. “I left cereal out on the counter.\u003c/p\u003e\n\u003cp\u003eThere’s fruit in the fruit bowl too.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I thought it was yours. I didn’t want to eat your stuff without asking.”\u003c/p\u003e\n\u003cp\u003eImpatiently, he said, “Then why didn’t you ask?”\u003c/p\u003e\n\u003cp\u003eI was taken aback. “How could I ask when I’ve barely even seen you?”\u003c/p\u003e\n\u003cp\u003eWe scowled at each other for about three seconds before I saw a smile tugging at the corners of his mouth.\u003c/p\u003e\n\u003cp\u003e“Fair enough,” he said, and his trace of a smile was already gone. He started to slide the glass door open, and then he turned and said, “Whatever I buy, you can eat.”\u003c/p\u003e\n\u003cp\u003e“Same here,” I said.\u003c/p\u003e\n\u003cp\u003eThat almost-smile again. “You can keep your Pop-Tarts and your Funyuns and your Kraft mac and cheese all to yourself.”\u003c/p\u003e\n\u003cp\u003e“Hey, I eat other stuff besides just junk,” I protested.\u003c/p\u003e\n\u003cp\u003e“Sure you do,” he said, and he went inside.\u003c/p\u003e\n\u003cp\u003eThe next morning, the cereal box was out on the counter again. This time, I helped myself to his cereal and to his skim milk, and I even cut up a banana to put on top. It wasn’t half bad.\u003c/p\u003e\n\u003cp\u003eConrad was turning out to be a pretty good house-mate. He always put the seat back down on the toilet, he did his dishes right away, he even bought more paper towels when we ran out. I wouldn’t have expected any less, though. Conrad had always been neat. He was the exact opposite of Jeremiah in that way. Jeremiah never changed the roll of toilet paper. It would never occur to him to buy paper towels or to soak a greasy pan in hot water and dishwashing soap. \u003c/p\u003e","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-27.html","bookId":2725,"creation":"Oct 5, 2019 4:15:44 PM","modification":"Oct 5, 2019 4:15:44 PM"}
