{"id":79293,"no":43,"title":"Page 43","content":"\u003cp\u003eAfter I’d made the beds and straightened up the guest bathroom, I went down to the kitchen to make myself a sandwich. I thought I was safe, I thought he was still out.\u003c/p\u003e\n\u003cp\u003eBut there he was, eating a sandwich himself.\u003c/p\u003e\n\u003cp\u003eAs soon as he saw me, Conrad put down his sandwich.\u003c/p\u003e\n\u003cp\u003eRoast beef, it looked like. “Can I talk to you for a sec?”\u003c/p\u003e\n\u003cp\u003e“I’m about to go into town to run some errands,” I said, looking somewhere in the vicinity of over his shoulder, anywhere but at him. “Wedding stuff.”\u003c/p\u003e\n\u003cp\u003eI started to walk away, but he followed me out to the porch.\u003c/p\u003e\n\u003cp\u003e“Listen, I’m sorry about last night.”\u003c/p\u003e\n\u003cp\u003eI didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Will you do me a favor? Will you just forget everything I said?” He flashed a slight, ironic kind of smile. I wanted to smack the smile off his face. “I was out of my mind last night, drunk off my ass. Being here again, it just brought back a lot of stuff. But it’s all ancient history, I know that. Honestly, I can barely remember what I said, but I’m sure that whatever it was, it was out of line. I’m really sorry.”\u003c/p\u003e\n\u003cp\u003eFor a moment I felt such rage, I think I forgot how to speak. I found it was hard to catch my breath. I felt like a flopping goldfish, opening and closing my mouth, sucking in pockets of air. I hadn’t even slept the night before; instead, I’d agonized over every word he said to me. I felt so stupid. And to think, just for a second, just for a moment, I had wavered. I had pictured it, what it would be like, if I was marrying him and not Jeremiah. I hated him for that.\u003c/p\u003e\n\u003cp\u003e“You weren’t drunk,” I said.\u003c/p\u003e\n\u003cp\u003e“Yeah, I really was.” This time he gave me an apolo-getic smile.\u003c/p\u003e\n\u003cp\u003eI ignored it. “You brought up all that the weekend of my wedding, and now you want me to just ‘forget it’?\u003c/p\u003e\n\u003cp\u003eYou’re sick. Don’t you get that you can’t play with people like that?”\u003c/p\u003e\n\u003cp\u003eConrad’s smile faded. “Hold on a second. Belly—”\u003c/p\u003e\n\u003cp\u003e“Don’t say my name.” I backed away from him. “Don’t even think it. In fact, don’t ever speak to me again.”\u003c/p\u003e\n\u003cp\u003eAgain with the ironic half smile, he said, “Well, that would be kind of hard, considering the fact that you’re marrying my brother. Come on, Belly.”\u003c/p\u003e\n\u003cp\u003eI didn’t think I could be angrier, and now I was. I was so mad, I practically spat as I said, “I want you to leave.\u003c/p\u003e\n\u003cp\u003eMake up one of your bullshit excuses and just go. Go back to Boston or California. I don’t care where. I just want you gone.”\u003c/p\u003e\n\u003cp\u003eHis eye twitched. “I’m not leaving.”\u003c/p\u003e\n\u003cp\u003e“Go,” I said, shoving him, hard. “Just go.”\u003c/p\u003e\n\u003cp\u003eThat’s when I saw the first cracks in his armor.\u003c/p\u003e\n\u003cp\u003eHis voice cracking, he said, “What did you expect me to say to you, Belly?”\u003c/p\u003e\n\u003cp\u003e“Stop saying my name!” I screamed.\u003c/p\u003e\n\u003cp\u003e“What do you want from me?” he yelled back. “I laid myself f**king bare last night! I put it all out there, and you shut me down. Rightfully so. I get that I shouldn’t have said any of that stuff to you. But now here I am trying to find a way to come out of this with just a little fragment of pride so I can look you in the eye when this is all over, and you won’t even let me have that. You broke my heart last night, all right? Is that what you want to hear?”\u003c/p\u003e\n\u003cp\u003eAgain, I was at a loss for words. And then I said, “You really are heartless.”\u003c/p\u003e\n\u003cp\u003e“No, I think you might actually be the heartless one,” he said.\u003c/p\u003e\n\u003cp\u003eHe was already walking away as I called out, “What is that supposed to mean?” I walked up right behind and twisted his arm toward me so we were facing each other.\u003c/p\u003e\n\u003cp\u003e“Tell me what you meant by that.”\u003c/p\u003e\n\u003cp\u003e“You know what it means.” Conrad jerked away from me. “I still love you. I never stopped. I think you know it.\u003c/p\u003e\n\u003cp\u003eI think you’ve known it all along.”\u003c/p\u003e\n\u003cp\u003eI pressed my lips together, shaking my head. “That’s not true.”\u003c/p\u003e\n\u003cp\u003e“Don’t lie.”\u003c/p\u003e\n\u003cp\u003eI shook my head again.\u003c/p\u003e\n\u003cp\u003e“Have it your way. But I’m not going to pretend for you anymore.” With that, he walked down the steps and to his car.\u003c/p\u003e\n\u003cp\u003eI sank onto the deck. My heart was pounding a million trillion times a minute. I never felt more alive. Anger, sadness, joy. He made me feel it all. No one else had that kind of effect on me. No one.\u003c/p\u003e\n\u003cp\u003eSuddenly I had this feeling, this absolute certainty, that I was never going to be able to let him go. It was as simple and as hard as that. I had clung to him like a barnacle all these years, and now I couldn’t cut away. It was my own fault, really. I couldn’t let go of Conrad, and I couldn’t walk away from Jeremiah.\u003c/p\u003e\n\u003cp\u003eWhere did that leave me?\u003c/p\u003e\n\u003cp\u003eI was getting married tomorrow. I wasn’t supposed to be thinking this way. It was shameful.\u003c/p\u003e\n\u003cp\u003eIf I did it, if I chose Conrad, I could never go back.\u003c/p\u003e\n\u003cp\u003eI would never cup the back of Jere’s neck in my hand again, feel it’s downy softness. Like feathers. Jere would never look at me the way he did now. He looked at me like I was his girl. Which I was, and it felt like it had always been that way. That would all be lost. Over.\u003c/p\u003e\n\u003cp\u003eSome things you can’t take back. How was I supposed to say good-bye to of all those things? I couldn’t. And what about our families? What would it do to my mother, his father? It would destroy us. I couldn’t do that. Especially—especially with everything so fragile now that Susannah was gone. We were still figuring out how to all be together without her, how to still be that summer family.\u003c/p\u003e\n\u003cp\u003eI couldn’t give all that up, just for this. Just for Conrad.\u003c/p\u003e\n\u003cp\u003eConrad, who told me he loved me. At last, he said the words.\u003c/p\u003e\n\u003cp\u003eWhen Conrad Fisher told a girl he loved her, he meant it. A girl could believe in that. A girl could maybe even bet her whole life on it.\u003c/p\u003e\n\u003cp\u003eThat was what I would be doing. I would be betting my whole life on him. And I couldn’t do it. I wouldn’t.\u003c/p\u003e\n\u003cp\u003eChapter Forty-nine\u003c/p\u003e\n\u003cp\u003eConrad\u003c/p\u003e\n\u003cp\u003eI was in my car, driving away, my adrenaline pumping hard.\u003c/p\u003e\n\u003cp\u003eI finally said it. The actual words, out loud, to her face.\u003c/p\u003e\n\u003cp\u003eIt was a relief, not carrying it around anymore, and it was a rush, actually telling her. I was in an elated sort of daze, on a high. She loved me. I didn’t need to hear her say it out loud, I knew it innately in the way she looked at me just then.\u003c/p\u003e\n\u003cp\u003eBut now what? If she loved me and I loved her, what did we do now, when there were so many people in between us? How could I ever get to her? Did I have it in me to just grab her hand and run away? I believed she’d come with me. If I asked her, I believed she really might come. But where would we even go? Would they forgive us? Jere, Laurel, my dad. And if I really did take her away, where would I be leading her? \u003c/p\u003e","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-43.html","bookId":2725,"creation":"Oct 5, 2019 4:15:44 PM","modification":"Oct 5, 2019 4:15:44 PM"}
