{"id":79301,"no":51,"title":"Page 51","content":"\u003cp\u003ea couple of years later\u003c/p\u003e\n\u003cp\u003eDearest Belly,\u003c/p\u003e\n\u003cp\u003eRight now I am picturing you today, on your wedding day, looking radiant and lovely, the pret-tiest bride there ever was. I picture you about thirty or so, a woman who’s had lots and lots of adventures and romances. I picture you marrying a man who is solid and steady and strong, a man with kind eyes. I am sure your young man is completely wonderful, even if he doesn’t have the last name Fisher! Ha.\u003c/p\u003e\n\u003cp\u003eYou know that I could not love you more if you were my own daughter. My Belly, my special girl.\u003c/p\u003e\n\u003cp\u003eWatching you grow up was one of the great joys of my life.\u003c/p\u003e\n\u003cp\u003eMy girl who ached and yearned for so many things … a kitten you could name Margaret, rainbow roller skates, edible bubble bath! A boy who would kiss you the way Rhett kissed Scarlett. I hope you’ve found him, darling.\u003c/p\u003e\n\u003cp\u003eBe happy. Be good to each other.\u003c/p\u003e\n\u003cp\u003eAll of my love always, Susannah\u003c/p\u003e\n\u003cp\u003eOh, Susannah. If you could see us now.\u003c/p\u003e\n\u003cp\u003eYou were wrong about a couple of things. I’m not thirty yet. I’m twenty-three, almost twenty-four. After Jeremiah and I broke up, he went back to live in the fraternity house, and I ended up living with Anika after all.\u003c/p\u003e\n\u003cp\u003eJunior year, I studied abroad. I went to Spain, where I did have lots and lots of adventures.\u003c/p\u003e\n\u003cp\u003eSpain is where I got my first letter from him. Real letters, written by his hand, not e-mails. I didn’t write him back, not at first, but they still came, once a month, every month. The first time I saw him again, it was another year, at my college graduation. And I just knew.\u003c/p\u003e\n\u003cp\u003eMy young man is kind and good and strong, just like you said. But he doesn’t kiss me like Rhett kissed Scarlett.\u003c/p\u003e\n\u003cp\u003eHe kisses me even better. And there’s one other thing you were right about. He does have the last name Fisher.\u003c/p\u003e\n\u003cp\u003eI am wearing the dress my mother and I picked out together—creamy white with lace cap sleeves and a low back. My hair, my hair that we spent an hour pinning up, is falling out of the side bun, and long wet strands of hair are flying around my face as we run for the car in the pouring rain. Balloons are everywhere. My shoes are off, I am barefoot, holding his gray suit jacket over my head.\u003c/p\u003e\n\u003cp\u003eHe’s got one high-but-not-too-high heel in each hand.\u003c/p\u003e\n\u003cp\u003eHe runs ahead of me and opens the car door.\u003c/p\u003e\n\u003cp\u003eWe are just married.\u003c/p\u003e\n\u003cp\u003e“Are you sure?” he asks me.\u003c/p\u003e\n\u003cp\u003e“No,” I say, getting in. Everyone will be expecting us at the reception hall. We shouldn’t keep them waiting.\u003c/p\u003e\n\u003cp\u003eBut then again, it’s not like they can get started without us. We have to dance the first dance. “Stay,” by Maurice Williams and the Zodiacs.\u003c/p\u003e\n\u003cp\u003eI look out the window, and there is Jere across the lawn. He has his arm around his date, and our eyes meet.\u003c/p\u003e\n\u003cp\u003eHe gives me a small wave. I wave back and blow him a kiss. He smiles and turns back to his date.\u003c/p\u003e\n\u003cp\u003eConrad opens the car door and slides into the driver’s seat. His white shirt is soaked through—I can see his skin.\u003c/p\u003e\n\u003cp\u003eHe is shivering. He grabs my hand, locks my fingers into his, and brings it to his lips. “Then let’s do it. We’re both wet already.”\u003c/p\u003e\n\u003cp\u003eHe turns on the ignition, and then we’re off. We head for the ocean. We hold hands the whole way. When we get there, it is empty, so we park right on the sand. It’s still raining out.\u003c/p\u003e\n\u003cp\u003eI jump out of the car, hitch up my skirt, and call out,\u003c/p\u003e\n\u003cp\u003e“Ready?”\u003c/p\u003e\n\u003cp\u003eHe rolls up his pant legs, and then he grabs my hand.\u003c/p\u003e\n\u003cp\u003e“Ready.”\u003c/p\u003e\n\u003cp\u003eWe run toward the water, tripping in the sand, screaming and laughing like little kids. At the last second he picks me up like he is carrying me across a threshold. “If you dare try and Belly Flop me right now, you’re going down with me,” I warn, my arms tight around his neck.\u003c/p\u003e\n\u003cp\u003e“I go wherever you go,” he says, launching us into the water.\u003c/p\u003e\n\u003cp\u003eThis is our start. This is the moment it becomes real.\u003c/p\u003e\n\u003cp\u003eWe are married. We are infinite. Me and Conrad. The first boy I ever slow danced with, ever cried over. Ever loved.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-51.html","bookId":2725,"creation":"Oct 5, 2019 4:15:44 PM","modification":"Oct 5, 2019 4:15:44 PM"}
