{"id":72814,"no":19,"title":"Page 19","content":"\u003cp\u003e“You didn’t tell any of this to the specialist?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No.”\u003c/p\u003e\n\u003cp\u003e“Did your parents ask her to meet with you?”\u003c/p\u003e\n\u003cp\u003e“They don’t know,” I say. “The headmaster thought it best that I don’t bother them.”\u003c/p\u003e\n\u003cp\u003eHe seems angry, which reignites my nervousness. It takes so much to upset him.\u003c/p\u003e\n\u003cp\u003e“Don’t tell this specialist any of what you told me,” he says.\u003c/p\u003e\n\u003cp\u003e“I couldn’t,” I say. “I barely had the courage to tell you. I thought you’d say it was wrong.”\u003c/p\u003e\n\u003cp\u003eHe leans toward me until our foreheads are touching, our eyes downcast. “You aren’t wrong, Morgan.” Waves of coldness and heat bloom in my stomach. “Not at all.”\u003c/p\u003e\n\u003cp\u003eI don’t know how it happens. We move our faces at the same time, and then our lips are touching. I’ve lost my worries. Traded them in for the sun and the taste of his tongue and the thought that in sixty years we’ll be ashes—we’ll be tossed into the air and after a moment of weightlessness we’ll be everywhere and nowhere. But for now there’s quick breathing and the feeling like he has my heart in his palm as it beats outside my chest.\u003c/p\u003e\n\u003cp\u003eHe knows that I’m not like the other girls—the normal ones—that a part of me is slipping off this floating city, and he doesn’t care. He doesn’t care.\u003c/p\u003e\n\u003cp\u003eMaybe we’re both beyond saving.\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eLove should be a staple in our history book. Wasn’t it an act of love when the god of the sky chose to keep us? Isn’t love what makes living bearable, and unbearable?\u003c/p\u003e\n\u003cp\u003e—“Intangible Gods,” Daphne Leander, Year Ten\u003c/p\u003e\n\u003cp\u003eTHE FIRST KISS LINGERS. IT TRAVELS AWAY from the lips once it’s over, and it breaks apart and settles in strange places. The stomach. Fingertips. Knees. It follows us along the cobbles and onto the train.\u003c/p\u003e\n\u003cp\u003eThe train’s rumbling rattles my ribs. It’s late enough now that the train is crowded with workers on their evening commute, and the noise is like bugs that have gotten trapped inside the car, vaguely thrumming. I feel as though a layer of my skin has been peeled away, leaving me chilled, my senses heightened.\u003c/p\u003e\n\u003cp\u003eBasil keeps me fastened to his side, as though to protect me from the crowd. He kisses my temple, and I close my eyes, reveling in the sensation of it. Now that we’ve had that first kiss, the tension is severed. He can kiss me a thousand times. Ten thousand.\u003c/p\u003e\n\u003cp\u003eThen, too soon, the train rolls to a stop and his arm around me tenses to keep us steady for the final jolt. I stand with the feeling that I’m being awoken.\u003c/p\u003e\n\u003cp\u003eAlice told me that the first kiss would leave a girl feeling strange. I wasn’t prepared for how right she was.\u003c/p\u003e\n\u003cp\u003eWe take our time walking back to the apartment building. I watch a cloud swirl over the atmosphere. On very overcast days when the sky goes entirely white, it’s like Internment is an inking on a piece of paper, and the rest has yet to be drawn.\u003c/p\u003e\n\u003cp\u003e“Do you have to see the specialist again?”\u003c/p\u003e\n\u003cp\u003e“Every day, until I hear otherwise,” I say.\u003c/p\u003e\n\u003cp\u003eI see in his face that he’s unhappy, but it isn’t because of anything I’ve done; he’s being protective. I’m glad I told him. I’d want him to tell me, if it were the other way around. “I’m not going to bother my parents with it,” I say. “They’ll worry. They’ll think they’ve done wrong by us. First Lex and now me.”\u003c/p\u003e\n\u003cp\u003eHe stops me a few paces before the door to my building, takes my hands. “If you feel like going to the edge, come and find me,” he says.\u003c/p\u003e\n\u003cp\u003eIt takes me a moment to work up the courage to look at him. “What if you can’t stop me?” I say. “What if I go mad and I jump?”\u003c/p\u003e\n\u003cp\u003eHe squeezes my hands. “I won’t let you go alone.”\u003c/p\u003e\n\u003cp\u003eIt may be the greatest thing anyone has ever said to me, and my smile is too small to express my gratitude.\u003c/p\u003e\n\u003cp\u003e“Shall we go inside?” Basil says.\u003c/p\u003e\n\u003cp\u003e“Not yet,” I say, looking to the clouds again. This afternoon has been one long moment that I haven’t wanted to end. I want Basil beside me a little longer. I want this warmth in my cheeks to stay.\u003c/p\u003e\n\u003cp\u003eHe puts his hand on the small of my back, and I feel the current of my blood flowing under his touch. “You could walk with me to the playground,” he says. “I’m supposed to find my brother before dinner.”\u003c/p\u003e\n\u003cp\u003e“All right,” I say.\u003c/p\u003e\n\u003cp\u003eThe playground isn’t far from the park, which means we’re undoing our train ride by going there, but Basil doesn’t seem to mind. Time is passing too quickly, though I keep willing for it to hold still.\u003c/p\u003e\n\u003cp\u003eThere’s only one child left on the playground, hanging by his knees from the dome of metal bars.\u003c/p\u003e\n\u003cp\u003e“Leland,” Basil calls, and the boy topples clumsily to his feet.\u003c/p\u003e\n\u003cp\u003e“He’s gotten better,” I notice. “Last time he was falling on his head.”\u003c/p\u003e\n\u003cp\u003e“He practices on the furniture,” Basil says, and sighs.\u003c/p\u003e\n\u003cp\u003e“Is it dinnertime already?” Leland asks, dusting his knees as he ambles toward us. The necklace that holds his betrothal band has fallen against his collar so that the band is behind his neck. Basil stoops to fix it.\u003c/p\u003e\n\u003cp\u003e“Almost,” Basil says. “Where’s your tie?”\u003c/p\u003e\n\u003cp\u003e“I lost it.”\u003c/p\u003e\n\u003cp\u003e“Lost it where?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. Leland has never been a child who can hold on to things; he’s careless even by the standards set by other seven-year-olds. He does his best to seem contrite for Basil’s sake, an effort that’s less than valiant. He scratches the bridge of his nose. “Hi, Morgan.”\u003c/p\u003e\n\u003cp\u003e“Hi, kid,” I say. I try not to laugh at Basil’s fretful expression. “The tie will turn up somewhere,” I say.\u003c/p\u003e\n\u003cp\u003e“It’s the third one you’ve lost this year, Little Brother,” Basil says.\u003c/p\u003e\n\u003cp\u003e“Or maybe it’s been the same tie being found and reissued to me all along,” Leland says, walking ahead. “We’ve never seen more than one at a time.”\u003c/p\u003e\n\u003cp\u003e“Interesting theory,” I say.\u003c/p\u003e\n\u003cp\u003eHe beams. “Are you coming for dinner?”\u003c/p\u003e\n\u003cp\u003e“Another night,” I say. Basil and I quicken our pace to keep up with him. Leland is all skips and twirls, always in motion. I think he’ll become something theatrical, or at the very least some kind of athlete.\u003c/p\u003e\n\u003cp\u003eOr an explorer. The thought comes to me now and again, though I know it isn’t logical. Explorers are for stories about the people of the ground. Explorers are for those who weren’t born in a city that has been interned in the sky.\u003c/p\u003e\n\u003cp\u003e“There wasn’t even a patrolman watching the playground,” Basil says, quiet enough that his brother won’t hear.\u003c/p\u003e\n\u003cp\u003e“There never used to be,” I say. “When we were little, sometimes it was dark out by the time we went home for dinner.”\u003c/p\u003e\n\u003cp\u003e“That was then,” Basil says. Too late, he realizes the worried expression on his face and tries to smile for my sake.\u003c/p\u003e\n\u003cp\u003eI catch his arm and stop him from walking. “Nobody is going to hurt Leland,” I say.\u003c/p\u003e\n\u003cp\u003eHe locks his arms around the small of my back and draws me to his chest. I feel like a jar filled with lightbugs that have burst suddenly into flight. How can our little world be unsafe? How can it be anything but perfect?\u003c/p\u003e\n\u003cp\u003eSeveral paces ahead, Leland has made a game of leaping among the biggest cobblestones. He won’t end up like Daphne; of course he won’t. He is brimming with so much energy and life, not even death would be able to catch him as he skips toward the melting sun.\u003c/p\u003e\n\u003cp\u003eI wonder if the people of the ground ever feel that their children are too big for their world, too.\u003c/p\u003e\n\u003cp\u003eAfter dinner, my mother settles on the couch with her sampler. I sit on the floor with my homework spread out in front of me, but sometimes my gaze wanders to the underside of the fabric. I watch as the arches become stitched full with color. Whatever the colors mean, it has my mother in a good mood. She’s humming.\u003c/p\u003e\n\u003cp\u003eBut it doesn’t take long, of course, for the headache elixir to exhaust her. She stoops down to kiss me before she goes to bed.\u003c/p\u003e\n\u003cp\u003eI finish up my equations sheet and wait for the soft snoring that means my mother is asleep, before I take my unfinished leftovers from the cold box and wrap them in a few sheets of water-soluble cloth. That way the evidence can be tossed into the lake. I don’t know if I’m trying to protect Judas, or myself.\u003c/p\u003e\n\u003cp\u003eWhen I open the door, a slip of paper flutters from the doorjamb. I unfold it, revealing Pen’s swirling, flawless handwriting:\u003c/p\u003e\n\u003cp\u003eM—\u003c/p\u003e\n\u003cp\u003eI know where you’re going.\u003c/p\u003e\n\u003cp\u003eDon’t leave without me.\u003c/p\u003e\n\u003cp\u003e—P\u003c/p\u003e\n\u003cp\u003eMy natural inclination is to include her, the way I’ve always included her. But Judas barely trusts me, and Amy is starting to—I can see it. Bringing Pen along would scare the both of them off. Amy is the one, after all, who answered Pen’s question to indicate that we were dealing with a murderer.\u003c/p\u003e\n\u003cp\u003eFor all the secrets Pen keeps for herself, surely she can allow me this one.\u003c/p\u003e\n\u003cp\u003eThe cavern is empty when I arrive. Maybe Judas and Amy have decided not to trust me after all.\u003c/p\u003e\n\u003cp\u003eI leave the food anyway.\u003c/p\u003e\n\u003cp\u003eThere are no further broadcasts, but news travels anyway. On the train the next morning, the word has spread that the jury selection for Judas Hensley has begun. Everyone is murmuring.\u003c/p\u003e\n\u003cp\u003ePen isn’t paying attention. She breathes onto the window and writes her name in the fog.\u003c/p\u003e\n\u003cp\u003e“Such a clear day,” Thomas says. “We can almost see the ground.”\u003c/p\u003e\n\u003cp\u003eI look over Pen’s shoulder, and “almost” is the best way to describe any notion of seeing the ground. All I see is the wooden fence that borders the train, and then the sky and Internment’s uninhabited outskirts. If I were standing on the edge, then maybe I would see the patchwork of land that is captured by the scopes.\u003c/p\u003e\n\u003cp\u003eThe thought of the edge has caused me to clench my fists. Basil touches my wrist.\u003c/p\u003e\n\u003cp\u003ePen is someplace far away. With a flourish and a sigh, she rests her head against my shoulder and watches her name fill up with daylight in the window and then disappear.\u003c/p\u003e\n\u003cp\u003eMs. Harlan pours us each a second cup of tea toward the end of our session.\u003c/p\u003e\n\u003cp\u003eI would love to believe that she’s trying to help me, but her presence only serves to make me anxious. She asks how I’m sleeping and how frequently my mother takes her elixirs. She asks about my brother and even about Alice. Stoic Alice who never flinches even when things are at their worst. Even when she was on the verge of becoming a loner forever.\u003c/p\u003e\n\u003cp\u003e“I understand your sister-in-law underwent a termination procedure,” Ms. Harlan says.\u003c/p\u003e\n\u003cp\u003eI stare at the bell that’s near the ceiling, willing it to ring.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. “Three years ago.”\u003c/p\u003e\n\u003cp\u003e“Was she ill afterward?” Ms. Harlan asks.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I say. “I was too young to have paid much attention.” This is a lie. I remember everything about the weeks to follow. I remember wondering how it was that Alice could be physically healthy, while it seemed so very possible the grief alone could kill her. \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-ruin-the-internment-chronicles-1/page-19.html","bookId":1764,"creation":"Oct 5, 2019 10:25:38 AM","modification":"Oct 5, 2019 10:25:38 AM"}
