{"id":72818,"no":23,"title":"Page 23","content":"\u003cp\u003eI can’t help the pitying expression that surely comes over me. She raises her chin in defiance. “I can’t tell you everything,” she says. “But you’ll hear about it, and when you do, I’ll already be gone.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t have anything to say to me after that. She gets up and busies herself trying to climb one of the trees.\u003c/p\u003e\n\u003cp\u003e“You like to climb?” I say.\u003c/p\u003e\n\u003cp\u003e“I’m not allowed,” she says. “I can get away with it only when Judas isn’t around.”\u003c/p\u003e\n\u003cp\u003eI can’t imagine why he would worry about Amy climbing trees. She appears to be quite good at it.\u003c/p\u003e\n\u003cp\u003e“When I was little,” I say, “I used to climb trees, too. It took me months before I could reach the top of the highest tree I could find here in the woods. And once I’d climbed it I realized there was nowhere else to go.”\u003c/p\u003e\n\u003cp\u003eAmy’s expression is thoughtful. “Did you ever think about what it would be like to climb in the opposite direction? Instead of going above Internment, to go beneath it?”\u003c/p\u003e\n\u003cp\u003e“Like a tunnel,” I say. “Yes, I think so, now that you mention it. I could burrow along the roots that go all the way to the bottom of the city, and then I’d be dangling high above the ground.”\u003c/p\u003e\n\u003cp\u003e“You’re kind of strange,” Amy says, swinging from a low branch.\u003c/p\u003e\n\u003cp\u003e“You are, too,” I say.\u003c/p\u003e\n\u003cp\u003eBefore she hoists herself up to the next branch, she smiles at me. “Go away now,” she says. “I have important things to consider.”\u003c/p\u003e\n\u003cp\u003eI leave her to her ascent for the stars.\u003c/p\u003e\n\u003cp\u003eSomewhere around the block, I hear a sweeper. They always come sometime after dinner. Men driving machines propelled by giant round brushes, gathering all the debris from the street so that it can be recycled.\u003c/p\u003e\n\u003cp\u003eI pass my apartment, not ready to go home, and keep walking until I reach the border of my city: the train tracks.\u003c/p\u003e\n\u003cp\u003eAnd I’m not alone. There is a patrolman at the far end of the platform where the doors will open when the train arrives. And Pen, sitting on the steps of the platform in the light of a street lantern. Paper lanterns hang from the lantern’s post, decorated with slantscript requests.\u003c/p\u003e\n\u003cp\u003eUnder Pen’s long red coat I can see the hems of her pinstripe pajamas and her wool slippers. She grins at me. “Have a fun tryst?” she asks.\u003c/p\u003e\n\u003cp\u003e“What are you doing out without your shoes?” I say. I think back on what she said about killing Judas if anything ever happened to me, and I wonder if she followed me.\u003c/p\u003e\n\u003cp\u003eShe looks over her shoulder and nods at the silver branches, lanterns, and charms that decorate the train platform. “Thinking about this year’s request,” she says.\u003c/p\u003e\n\u003cp\u003eI sit beside her. “It’s strange to see Internment so afraid, especially this time of year,” I say.\u003c/p\u003e\n\u003cp\u003e“It’s important that the festival of stars goes on, no matter what happens,” Pen says. “The fear will pass eventually, as unhappy things always do.” She smiles at the sky, but offers a little nod toward me. “Do you remember how excited we used to get when we were little, and we would try to sneak away with whatever treats your mother was baking for the festival?”\u003c/p\u003e\n\u003cp\u003e“She knew what we were up to, and she let us get away with our pockets full of mini pastries anyway,” I say.\u003c/p\u003e\n\u003cp\u003ePen sighs wistfully.\u003c/p\u003e\n\u003cp\u003e“I still do love the city this time of year,” I say. “I love the way it looks, the way it feels. I just don’t get excited about the requests anymore.”\u003c/p\u003e\n\u003cp\u003e“The requesting part is more fun when you’re a child anyway,” Pen says. “Children ask for simple things.”\u003c/p\u003e\n\u003cp\u003eWhen I was young I asked for a flutterling farm in a jar, and the next year, for my brother to be nicer to me. Lex struck the match for me both times, never knowing what I’d asked for, and together we watched our papers fly up into a sky of burning stars. My mother bought me the farm, but my brother’s patience with me grows thinner every year. From that festival on, I began to suspect that by being born I disturbed something in his fragile world. I gave him someone to worry about, and he would never forgive me for it.\u003c/p\u003e\n\u003cp\u003e“The god of the sky has never answered my most important requests,” I say. “Do you suppose it’s because I was never very good at slantscript?”\u003c/p\u003e\n\u003cp\u003e“No,” Pen says. “I’m rather good at slantscript, and my requests go unanswered lately, too.”\u003c/p\u003e\n\u003cp\u003e“Maybe this year I’ll offer up a request on Judas’s behalf.”\u003c/p\u003e\n\u003cp\u003ePen shakes her head. “Don’t waste your request. There isn’t much that can be done for him now.”\u003c/p\u003e\n\u003cp\u003e“Do you think Daphne’s essay is right?” I ask.\u003c/p\u003e\n\u003cp\u003e“All that whatnot about the gods being a myth that we dreamed up to add meaning to our lives?” she says. “It goes against everything we’ve been taught. We’re living on a big rock floating in the sky. How many explanations can there be for that?”\u003c/p\u003e\n\u003cp\u003e“Maybe there’s a science to it,” I say.\u003c/p\u003e\n\u003cp\u003e“Medicine is a science,” she says. “Electricity, colors, mapmaking. Those are things that can be crafted. What kind of science could explain how we got here or even why we exist? Of course there are gods.”\u003c/p\u003e\n\u003cp\u003e“Daphne said the gods are a theory,” I say. “Theories can’t be proven.”\u003c/p\u003e\n\u003cp\u003e“Daphne is dead, may I remind you,” she says. “You need to get your head back up in the sky with the rest of us. You’re always so fixated on what’s beyond the city. Whatever there is, it isn’t for us. We’ve been interned.”\u003c/p\u003e\n\u003cp\u003eShe’s impassioned by her faith, yet another reason Instructor Newlan adores her. Her next breath moves the hair from her brow. “We didn’t make ourselves,” she says. “We aren’t the greatest things to exist. I can’t believe that. I won’t believe that. We have too many faults.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to get you so riled,” I say.\u003c/p\u003e\n\u003cp\u003e“I’m not riled, Morgan. Not at all. I’m just concerned that one of these days your daydreaming will go entirely too far.” She fidgets with the hem of her glove.\u003c/p\u003e\n\u003cp\u003e“I was just discussing.”\u003c/p\u003e\n\u003cp\u003eShe talks of staying in the sky. Yet sometimes she is her own floating city, drifting farther away from me.\u003c/p\u003e\n\u003cp\u003e“You should think more about the things you choose to discuss aloud,” she says. “Maybe the specialist will leave you alone then.” She was subjected to one of the king’s specialists in third year, when her mother’s tonic addiction prevented her mother from working. That was the year Pen learned to set her own curls.\u003c/p\u003e\n\u003cp\u003e“I haven’t talked to the specialist about it,” I say. “I don’t like her. She makes me uneasy.”\u003c/p\u003e\n\u003cp\u003ePen hugs her arms. “Just lie like the rest of us,” she says as the train approaches. The train’s roar nearly swallows her voice when she says, “And if you must escape, escape here in the city. There are so many places for it.”\u003c/p\u003e\n\u003cp\u003eThe train door opens with a mechanical whine. No one disembarks. The shops are all closed and there’s hardly anyone out at this hour on a weeknight unless they work for the hospital or the king’s patrol. And still, the trains run, keeping vigil over those who dream of leaving the safe world within the tracks.\u003c/p\u003e\n\u003cp\u003e“I don’t need to escape,” I say.\u003c/p\u003e\n\u003cp\u003eShe leans back on her elbows and looks at the stars. “That’s good,” she says, starting to smile. “See that? You are an apt liar after all.”\u003c/p\u003e\n\u003cp\u003eThe train pulls away from us.\u003c/p\u003e\n\u003cp\u003eI frown and put my hand over hers. “Please don’t be angry,” I say. I don’t understand her when she gets like this, and it frightens me.\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “I’m not. Really.”\u003c/p\u003e\n\u003cp\u003e“Were you waiting for me?” I say.\u003c/p\u003e\n\u003cp\u003e“You aren’t the only one who can sneak off into the night to meet mysterious men,” she says, raising her chin. “It just so happens that I am having a starlit picnic tonight.”\u003c/p\u003e\n\u003cp\u003eThe clock tower strikes its first chime of the tenth hour, and I see a figure in the distance. The figure removes its bowler hat and spins it on its finger. I recognize the sharp click of those shoes on the cobblestones. Thomas moves into the light of a street lantern. This shocks me more than a mysterious man would have.\u003c/p\u003e\n\u003cp\u003e“Hello,” he says, nodding to the both of us. “I didn’t realize I’d be graced with both of your companies tonight.”\u003c/p\u003e\n\u003cp\u003e“Morgan’s leaving,” Pen says, squeezing my hand before rising.\u003c/p\u003e\n\u003cp\u003e“I thought you were having a picnic,” I say. “You didn’t pack any food?”\u003c/p\u003e\n\u003cp\u003eThomas smiles in his theatrical way. “Tonight, we’re feasting on the words of dead poets,” he says.\u003c/p\u003e\n\u003cp\u003ePen narrows her eyes. “Must you be so cloying?”\u003c/p\u003e\n\u003cp\u003eBut she descends the platform steps with him, though not letting him wrap his arm around her shoulders when he reaches out.\u003c/p\u003e\n\u003cp\u003e“Good night, Morgan,” she tells me. She picks the lint from her coat sleeve and tosses it away, blithely unaware of the way Thomas looks at her—as though he has no purpose at all but to love her.\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eDeath is the end of some things. Not everything.\u003c/p\u003e\n\u003cp\u003e—“Intangible Gods,” Daphne Leander, Year Ten\u003c/p\u003e\n\u003cp\u003eIN THE MORNING ON THE WAY TO THE academy, Pen can’t seem to stay awake. Not that she’s trying. She has her head on my shoulder and her eyes are closed.\u003c/p\u003e\n\u003cp\u003eThe crowded train car forced Thomas and Basil to take seats elsewhere.\u003c/p\u003e\n\u003cp\u003e“Out late with Thomas?” I ask.\u003c/p\u003e\n\u003cp\u003e“You don’t have to sound so hopeful about it,” she says.\u003c/p\u003e\n\u003cp\u003e“It’s just nice to see the two of you getting along,” I say.\u003c/p\u003e\n\u003cp\u003e“I suppose I should get used to him,” she says, and sighs. “But we weren’t out very late. I was working on my coloring for the festival after I came home. The art instructor was furious when she realized I’d crumbled my portrait of the glasslands.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t have done it,” I say.\u003c/p\u003e\n\u003cp\u003eShe sits up, blinking lazily. “Artistic license.” She yawns. “You wouldn’t understand.”\u003c/p\u003e\n\u003cp\u003e“Not a talentless commoner like me,” I say.\u003c/p\u003e\n\u003cp\u003eShe pats my cheek. “We all have our own skills,” she says. “I can color still life and scrub tonic stains out of the furniture. And you are a professional diplomat.”\u003c/p\u003e\n\u003cp\u003e“Am I?” I say.\u003c/p\u003e\n\u003cp\u003e“To a fault,” she says. “For example, you’re always kind to your brother, even though he’s been picking on you since day one. Most little siblings are brats. I’m so relieved my parents never entered the queue after I was born.”\u003c/p\u003e\n\u003cp\u003eThe train slows to stop. “If I’m such a diplomat, why aren’t I at all popular?”\u003c/p\u003e\n\u003cp\u003e“To everyone who matters, you are,” she says. \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-ruin-the-internment-chronicles-1/page-23.html","bookId":1764,"creation":"Oct 5, 2019 10:25:38 AM","modification":"Oct 5, 2019 10:25:38 AM"}
