{"id":72833,"no":38,"title":"Page 38","content":"\u003cp\u003eIf Prince Azure is dead, will his father tell Internment it was Judas Hensley? Say it was another act of treason?\u003c/p\u003e\n\u003cp\u003eMoonlight, so familiar and beautiful when we make it outside that my chest aches at the sight of it. It’s trapped in a shimmering triangle on the ground. We’re standing before the plum court; it’s made of glass, its lines and circles waiting for players to come and follow their rules. Pen and I run across the court, which is scuffed from the prince and princess’s last game. We’re trying to get momentum though our wrists are bound, and no one is there to stop us. Pen’s plan is almost perfect. Almost.\u003c/p\u003e\n\u003cp\u003eI push through a row of shrubs, scratching my arms, legs, and face as I do. Pen winces at the sound of fabric tearing. When I look at her, I see the lace from her dress collar is now dangling in the shrub. She tries to free it, but it won’t come loose, and she has to leave it behind.\u003c/p\u003e\n\u003cp\u003eThe clock tower is located in a wooded area, not far from where Sections One and Two meet. I know exactly where we are. My apartment is to the left in Section One, Basil’s to the right in Section Two. I allow myself a moment to stare at my building several paces away, partially hidden by its neighbors. Lights are still on in some of the apartments. It isn’t too late for people to be awake, but the streets are empty. Probably from fear that murderers are running rampant. The patrolmen surrounding the clock tower are occupied, but there will be plenty more in the city, and it probably won’t take long for word to spread that the prince has been attacked. We have to move quickly. We have to be invisible.\u003c/p\u003e\n\u003cp\u003eDown alleyways and through the woods, we move. It’s only when we reach the charred flower shop that Pen asks, “Why are we here?”\u003c/p\u003e\n\u003cp\u003e“It’s where the machine is kept,” I say, doing nothing to hide the bitterness in my voice. If she hadn’t hurt the prince, possibly killed him, here is where I would tell her to go home to her parents, to Thomas. But her ring catches a bit of starlight and I know she’ll never see her betrothed again. After what she’s done, she can never be safe in this city. She’d be declared irrational if she weren’t dispatched for her crime. I have to take her with me, and hope the metal bird really will fly us to the ground.\u003c/p\u003e\n\u003cp\u003eShe’s quiet and contrite, because she knows it too.\u003c/p\u003e\n\u003cp\u003eI pry back the familiar board, granting a small passageway in through the window. Without full range of motion from my arms, I tumble forward, landing hard on my shoulder. The pain hardly registers. I catch Pen as she tumbles in on top of me.\u003c/p\u003e\n\u003cp\u003eEven after several days, the burnt smell lingers in this place, and memories of the day at the theater rush back to me. In my nightmares, I couldn’t have imagined that the fire would destroy as much as it did. I couldn’t have imagined this feeling I get now knowing I can never go back.\u003c/p\u003e\n\u003cp\u003eWhen I was little, my brother drew an image for me on the train ride home from the academy. It was a map of Internment. Only, instead of the real city, he’d drawn a castle for the clock tower. And the buildings were all different somehow. Mysterious. And right at the edge he drew a ladder that went down and disappeared into the clouds. It was the most spectacular thing I’d ever seen, and getting ready for my bath that night, I discovered that the map had fallen from a hole in my skirt pocket. I wanted to go out and look for it, but my mother told me the sweepers had already come. The paper would be collected with all the other forgotten-about things and it would be compressed and recycled into something new.\u003c/p\u003e\n\u003cp\u003eI looked for it the next day, anyway, to no avail. I couldn’t believe such a wonderful thing could be destroyed so simply. I learned that it could. Anything could be destroyed.\u003c/p\u003e\n\u003cp\u003e“There’s a machine in here?” Pen asks.\u003c/p\u003e\n\u003cp\u003e“Under here.” I’m on my hands and knees now, struggling to crawl, until I find the door that will take us underground.\u003c/p\u003e\n\u003cp\u003eThis poses a new problem. There are several locks on the other side of it, and even if I manage to break through them, I’ll be faced with the pulleys and ropes of the lift; there’s no way I’ll be able to operate them while my wrists are bound.\u003c/p\u003e\n\u003cp\u003e“We have to find something to cut the twine,” I say.\u003c/p\u003e\n\u003cp\u003e“I can’t see anything,” Pen says. “There must be scissors, though.”\u003c/p\u003e\n\u003cp\u003eWe begin fumbling through what’s left of drawers and cabinets. “Careful,” I remind Pen. But I say this a moment too late, because there’s a creaking sound as one of the cabinets gives way and crashes to the ground. Glass and metal fall around our feet.\u003c/p\u003e\n\u003cp\u003e“Sorry!” she says. “But there’s probably a glass shard we can use now.”\u003c/p\u003e\n\u003cp\u003eCarefully, I crouch among the debris looking for something sharp, and I hear Pen rustling about beside me for a few moments before she stops. “Listen,” she says. “Did you hear that?”\u003c/p\u003e\n\u003cp\u003eI stop fumbling and then I hear it, too. There are faint whining and creaking noises coming from beneath the floorboards. Someone is using the lift.\u003c/p\u003e\n\u003cp\u003eHurriedly I crawl for the door, scraping my knee as I do. I see light through cracks in the floorboards, and my heart is on my tongue.\u003c/p\u003e\n\u003cp\u003eThe noise stops, and next I hear the pound of shoes on the metal ladder. A voice says, “Who’s there?”\u003c/p\u003e\n\u003cp\u003e“Judas?” I say.\u003c/p\u003e\n\u003cp\u003eLatches being hastily unlocked. The door is pushed open, granting a square of candlelight to come through the floor. Judas sets the lantern on the ground before starting to hoist himself up. But Basil pushes past him—he’s heard my voice and now he can’t move fast enough—and in a beat I’m in his arms.\u003c/p\u003e\n\u003cp\u003eI want to hold on to him like he’s holding me, but I can’t, and so I bury my face in his neck and I press my lips there. I don’t belong on Internment itself anymore, but I’ll always belong with him.\u003c/p\u003e\n\u003cp\u003e“I see you’ve brought your friend.” Judas’s voice is dry.\u003c/p\u003e\n\u003cp\u003ePen stares aside into the darkness. I know she’s thinking about what she’s done, about the boy soaked in blood in the clock tower.\u003c/p\u003e\n\u003cp\u003e“I had no choice,” I say, reluctantly drawing back when Basil notices my bound wrists. He tries to free them, but stops when I cringe.\u003c/p\u003e\n\u003cp\u003e“We were coming for you,” he says. “We tried last night, and there were too many patrolmen. We had to come up with a plan.”\u003c/p\u003e\n\u003cp\u003e“We were going to start a fire this time,” Judas says, sounding proud. “I figured it couldn’t hurt our reputation. Everyone already thinks we started this one.”\u003c/p\u003e\n\u003cp\u003eViolence is the only way to achieve freedom, it seems. I wouldn’t have thought so before all of this. My escape plan was a more peaceful one, but I know now that it wouldn’t have been successful.\u003c/p\u003e\n\u003cp\u003eJudas draws a knife from a makeshift sheath at his hip and saws through our restraints. It isn’t as much of a relief as I’d hoped for. The pain is still there, tightening around the bones like bloody phantom ropes.\u003c/p\u003e\n\u003cp\u003e“So you’re the fugitive,” Pen says, grinning.\u003c/p\u003e\n\u003cp\u003e“Look at that,” Judas says. “We’ve just met and already we have something in common.”\u003c/p\u003e\n\u003cp\u003eDuring the rickety ride down in the lift, I press my body against Basil’s. I pretend that we’re in a shuttle on the way to the academy, not sinking down into a place where the stars won’t find us.\u003c/p\u003e\n\u003cp\u003ePen gasps when she sees a side of the metal bird emerging in the lantern light. “It’s really here,” she says.\u003c/p\u003e\n\u003cp\u003e“What people have been dying for,” Judas says, easing up a fistful of rope.\u003c/p\u003e\n\u003cp\u003e“Is everyone angry with me?” I ask Basil.\u003c/p\u003e\n\u003cp\u003e“Yes, very,” he says. “I can’t imagine what you were thinking.”\u003c/p\u003e\n\u003cp\u003e“I wanted to say good-bye to Pen, and to see the stars, and possibly murder the king.”\u003c/p\u003e\n\u003cp\u003eJudas snickers.\u003c/p\u003e\n\u003cp\u003eBasil kisses my hair, which has gone lank and stringy from my time as a prisoner. I look at him and quietly say, “I wanted to go home.”\u003c/p\u003e\n\u003cp\u003eHe touches my nose, my lips. “I know.”\u003c/p\u003e\n\u003cp\u003eI press my ear to his heart, and the steady force of it makes strange music with the creaky lift. Last time I rode it, I was afraid. Now I dread only the moment we stop.\u003c/p\u003e\n\u003cp\u003e“Lex will have my head,” I say.\u003c/p\u003e\n\u003cp\u003e“He’ll just be glad you’re back,” Basil says. “We all thought, when you were taken to the king in the clock tower—”\u003c/p\u003e\n\u003cp\u003eHe doesn’t finish the sentence.\u003c/p\u003e\n\u003cp\u003e“The king never knew we were there,” Pen says. “It was his insane children.”\u003c/p\u003e\n\u003cp\u003e“The princess asked about the machine that would take us to the ground,” I say. “I misled her, but she knows. She was adamant.”\u003c/p\u003e\n\u003cp\u003e“Wonder why,” Judas says. “What’s the princess want with the ground? Her life here is charmed enough.”\u003c/p\u003e\n\u003cp\u003e“I think she’s just lonely,” I say, looking at Basil. His eyes are dark and worried.\u003c/p\u003e\n\u003cp\u003e“Lonely and insane,” Pen says. “They had us locked away from the sunlight for ages.”\u003c/p\u003e\n\u003cp\u003e“How did you get away?” Judas says.\u003c/p\u003e\n\u003cp\u003eNo one answers him. But it’s no matter; we’ve stopped.\u003c/p\u003e\n\u003cp\u003ePen is still in awe of the machine, though it’s hardly visible in the dim. She feels along the metal slope of it, tries to peer at what’s in the shadows. “What are those claws for, underneath?” she asks.\u003c/p\u003e\n\u003cp\u003e“You know how dirt warrens have claws for fingers?” Judas says. “That’s so they can dig through the dirt faster than we can walk it. There are claws like that on all sides of this thing so it can do just that.”\u003c/p\u003e\n\u003cp\u003e“To get us up to the surface so we can fly away?” Pen asks.\u003c/p\u003e\n\u003cp\u003e“To get us below the surface,” Judas says. “We’ll dig a tunnel and break out through the bottom and then sail down to the ground. Assuming we don’t fall to our deaths, or that the force surrounding the edge doesn’t throw us back.”\u003c/p\u003e\n\u003cp\u003e“But how will we get back up?” Pen says.\u003c/p\u003e\n\u003cp\u003e“We won’t.”\u003c/p\u003e\n\u003cp\u003eShe already knew that, of course, but the confirmation has her staring at her betrothal band. Somewhere above us, Thomas is worrying for her. He hasn’t learned yet that he’ll spend his dodder years alone. He won’t ever stop searching for her, even if they tell him she’s dead. But that search will be fruitless, and Pen knows it. When she thinks I’m not watching, her lips move.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” is what they say.\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003eWhen my betrothed asked me to marry him, the second time, I didn’t answer right away. I held the possibilities on my tongue. Carried them with me for days. I thought about choices. I imagined myself leaving Internment on the wings of a great bird or perhaps down a very strong length of twine. I tried to imagine what the ground would be like, and I couldn’t. I would try to see shapes, but all I would get is the bright light that cloaks the unknown when the human mind strives for a knowledge it can’t possess. But even then, even without the ability to imagine, every time I conjured that bright haze, I could feel him standing beside me. No god has ever felt as tangible as flesh and bone. I can love only what I have experienced. \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-ruin-the-internment-chronicles-1/page-38.html","bookId":1764,"creation":"Oct 5, 2019 10:25:38 AM","modification":"Oct 5, 2019 10:25:38 AM"}
