{"id":87751,"no":26,"title":"Page 26","content":"\u003cp\u003eFearing I’ve overstepped my bounds again, I walk out of the bedroom and make my way back across the street.\u003c/p\u003e\n\u003cp\u003eI OPEN THE door to the bathroom and slip inside. I set the clothes and a towel down on the counter, then glance up to the mirror. It’s mostly fogged over, but clear enough that I can see the shower in the reflection. There’s a section a few inches wide where the wall should meet the shower curtain, but it’s pulled slightly back. Lake’s foot is propped up against the porcelain tub and she’s shaving her legs. She’s using my razor.\u003c/p\u003e\n\u003cp\u003eAnd my shower.\u003c/p\u003e\n\u003cp\u003eAnd her clothes are on the floor, next to my feet. Not on her. She’s three feet from me without her clothes on.\u003c/p\u003e\n\u003cp\u003eIt’s one of the worst days of her life and I’m sitting here thinking about how she’s not wearing anything. Ass-hole.\u003c/p\u003e\n\u003cp\u003eIf I had any semblance of a decent conscious at all, I’d have never allowed her into my house last night to begin with. Now I’m watching the razor glide up her ankle, praying she’s too upset to go home for at least one more night.\u003c/p\u003e\n\u003cp\u003eJust one more night. I’m not ready to let her go.\u003c/p\u003e\n\u003cp\u003eI quietly back out of the bathroom and shut the door behind me. I head straight to the kitchen sink and splash water on my face.\u003c/p\u003e\n\u003cp\u003eI grip the edge of the counter and take a deep breath, preparing my earth-shattering apology for when she comes storming out of the bathroom. She’s so pissed at me right now for yelling at her and throwing her into the shower. I don’t blame her. I’m sure there was an easier way I could have calmed her down.\u003c/p\u003e\n\u003cp\u003e“I need a towel!” she yells from the bathroom. I walk to the edge of the hallway.\u003c/p\u003e\n\u003cp\u003e“It’s on the sink. So are your clothes.” I go back to the living room and sit on the couch in a lame attempt to appear casual. Maybe if I don’t seem so pissed anymore, she’ll remain calm.\u003c/p\u003e\n\u003cp\u003eGod, I can’t stand the thought of her being mad at me for another day. The day she recited her poem in class was probably the hardest knock my heart has ever taken from a girl . . . and it happened in front of seventeen other students. I realize none of them knew I was her target, other than Gavin, but still. It felt like I’d taken over thirty bullets straight to the heart with each insult that came out of her mouth.\u003c/p\u003e\n\u003cp\u003eThe door to the bathroom begins to open and my attempt at casual goes out the window. I jump over the back of the couch, wanting nothing more than to hold her and apologize for everything I did tonight.\u003c/p\u003e\n\u003cp\u003eWhen she sees me rushing toward her, her eyes grow big and she backs up to the wall. I wrap my arms around her and squeeze her tight. “I’m sorry, Lake. I’m so sorry I did that. You were just losing it,” I say in my best attempt to excuse my actions. Rather than try to hit me, she wraps her arms around my neck, causing my chest to tighten as I attempt to hold on to my willpower before it slips away from me again.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” she says softly. “I kinda sorta had a bad day.”\u003c/p\u003e\n\u003cp\u003eI want nothing more than to stifle her words with my mouth right now. I want to tell her how much I need her. How much I love her. How, no matter how bad things get for her, I’ll be by her through every second of it.\u003c/p\u003e\n\u003cp\u003eBut I don’t. Because of Julia, I don’t. I reluctantly pull back and place my arms on her shoulders.\u003c/p\u003e\n\u003cp\u003e“So we’re friends? You aren’t gonna try to punch me again?”\u003c/p\u003e\n\u003cp\u003e“Friends,” she says with a forced smile. I can tell she wants to be my friend about as much as I want to be hers. I have to turn away from her and head down the hallway before the words “I love you” fall helplessly from my mouth.\u003c/p\u003e\n\u003cp\u003e“How was the matinee?” she asks from behind me.\u003c/p\u003e\n\u003cp\u003eI can’t make small talk. We need to get to the heart of why she’s here, or I’m going to forget she’s not here for me.\u003c/p\u003e\n\u003cp\u003e“Did you talk to your mom?” I ask.\u003c/p\u003e\n\u003cp\u003e“Jeez. Deflect much?”\u003c/p\u003e\n\u003cp\u003e“Did you talk to her? Please don’t tell me you spent the entire day cleaning.” I continue into the kitchen and grab two glasses. She takes a seat at the bar.\u003c/p\u003e\n\u003cp\u003e“No. Not the entire day. We talked.”\u003c/p\u003e\n\u003cp\u003e“And?” I ask.\u003c/p\u003e\n\u003cp\u003e“And . . . she has cancer.”\u003c/p\u003e\n\u003cp\u003eDamn that indomitable will.\u003c/p\u003e\n\u003cp\u003eI roll my eyes at her stubbornness and walk to the refrigerator, removing the milk. When I begin to pour it into her glass, she turns away from the bar and flips her head over, then pulls the towel off her head. Her hair falls around her and she brushes at the tangles with her fingers. She smoothes out the strands, working her fingers through them delicately. What I wouldn’t give to touch—crap! I realize, just as she glances up, that I’ve poured way too much milk. It’s trickling down my hand and onto the counter. I quickly wipe it up with a hand towel.\u003c/p\u003e\n\u003cp\u003ePlease tell me she didn’t see that.\u003c/p\u003e\n\u003cp\u003eI grab the powdered chocolate out of the cabinet and a spoon, then stir some chocolate into her cup. “Will she be okay?”\u003c/p\u003e\n\u003cp\u003e“No. Probably not.”\u003c/p\u003e\n\u003cp\u003eI should know better than to ask close-ended questions with her. But I haven’t asked Julia any details and I’m curious.\u003c/p\u003e\n\u003cp\u003e“But she’s getting treatment?”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and looks incredibly annoyed. “She’s dying, Will. Dying. She’ll probably be dead within the year, maybe less than that. They’re just doing chemo to keep her comfortable. While she dies. ’Cause she’ll be dead. Because she’s dying. There. Is that what you wanted to hear?”\u003c/p\u003e\n\u003cp\u003eHer response sends a surge of guilt through me. I’m doing the exact thing to her that I hated having done to me. Forcing her to talk about something she hasn’t even accepted yet. I decide to drop it. She’ll come to this on her own terms. I walk to the freezer and grab a handful of ice, then drop it into her cup, sliding it across the counter to her. “On the rocks.”\u003c/p\u003e\n\u003cp\u003eShe looks down at the chocolate milk and smiles. “Thanks,” she says. She finishes her drink in silence.\u003c/p\u003e\n\u003cp\u003eWhen the glass is empty, she stands up from the bar and walks to the living room. She lies down on the floor and stretches her arms above her head.\u003c/p\u003e\n\u003cp\u003e“Turn the lights off,” she says. “I just want to listen for a while.”\u003c/p\u003e\n\u003cp\u003eI turn out the lights, then walk to where she is and lower myself onto the floor beside her. She’s quiet, but the stress radiates from her.\u003c/p\u003e\n\u003cp\u003e“She doesn’t want me to raise Kel,” she whispers. “She wants to give him to Brenda.”\u003c/p\u003e\n\u003cp\u003eI inhale a deep breath, understanding completely where her pain is coming from. I reach out across the floor until I find her hand and I hold it, wanting more than anything for her to know she’s not alone in this.\u003c/p\u003e\n\u003cp\u003eMY EYES SNAP open at the sound of Eddie’s voice. I sit up on the floor, shocked that I even fell asleep, and see Lake watching Eddie walk out the door.\u003c/p\u003e\n\u003cp\u003eShit! Shit, shit, shit! What the hell was Eddie doing in my house? Why would Lake even let her in? I’m getting fired. That’s it. I’m done.\u003c/p\u003e\n\u003cp\u003eAfter the door closes behind Eddie, Lake turns around and sees me sitting up on the floor. She purses her lips and tries to smile, but she knows I’m not happy.\u003c/p\u003e\n\u003cp\u003e“What the hell was she doing here?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “Visiting,” she mutters. “Checking on me.”\u003c/p\u003e\n\u003cp\u003eShe has no idea what kind of jeopardy she just put my entire career in!\u003c/p\u003e\n\u003cp\u003e“Dammit, Layken!” I push myself off the floor and throw my hands in the air, defeated. “Are you trying to get me fired? Are you that selfish that you don’t give a crap about anyone else’s problems? Do you know what would happen if she let it get out that you spent the night here?”\u003c/p\u003e\n\u003cp\u003eLake’s eyes dart down to the floor.\u003c/p\u003e\n\u003cp\u003eOh, god. She knows. Eddie already knows.\u003c/p\u003e\n\u003cp\u003eI take a step closer to her and she glances up at me again. “Does she know you spent the night here?” I demand. She looks down at her lap. “Layken, what does she know?”\u003c/p\u003e\n\u003cp\u003eShe doesn’t look at me, which answers my question.\u003c/p\u003e\n\u003cp\u003e“Christ, Layken. Go home.”\u003c/p\u003e\n\u003cp\u003eShe nods, then walks to the door. She slips her shoes on and pauses before she leaves, looking at me apologetically. I’m standing in the middle of the living room with my hands clasped behind my head, watching her. As mad as I am right now, it hurts to let her go. I know she needs me, but there’s so much we both need to process at this point. Besides, she needs to be home with her mother. Being here instead of at her own house isn’t helping her confront her situation at all.\u003c/p\u003e\n\u003cp\u003eA tear rolls down her cheek and she quickly turns away.\u003c/p\u003e\n\u003cp\u003e“Lake,” I say softly, dropping my hands to my sides. I can’t let her leave with the added stress of my outburst lingering in her mind. I walk to the door where she’s standing and reach down and touch her fingers, then take her hand in mine. She allows me to hold her hand, but she doesn’t face me again. She keeps one hand on the front door and sniffs, her head still focused on the floor.\u003c/p\u003e\n\u003cp\u003eThis girl. In love with the boy she can’t have. Grieving the death of her father, only to find out she’s about to grieve the death of the only adult left in her life? This girl who’s being told she can’t keep the only family member she has left? I squeeze her hand and rub my thumb over hers. She slowly turns to meet my eyes. Seeing the pain behind them and knowing that a lot of it is because of me reminds me of all the reasons I need to let her go.\u003c/p\u003e\n\u003cp\u003eHer mother.\u003c/p\u003e\n\u003cp\u003eMy career.\u003c/p\u003e\n\u003cp\u003eHer reputation.\u003c/p\u003e\n\u003cp\u003eMine and Caulder’s future.\u003c/p\u003e\n\u003cp\u003eHer future.\u003c/p\u003e\n\u003cp\u003eDoing the right thing. The responsible thing.\u003c/p\u003e\n\u003cp\u003eOut of all the reasons I can come up with for her to go, there’s only one reason I can come up with for her to stay. I love her. This one reason for her to stay is the only reason that derives from pure selfishness. If I continue whatever this is with her, it’ll be completely selfish of me. I’ll be putting everything I’ve worked for and everyone I love at risk, just to fulfill my own desires.\u003c/p\u003e\n\u003cp\u003eI drop her hand. “Go home, Layken. She needs you.”\u003c/p\u003e\n\u003cp\u003eI turn around.\u003c/p\u003e\n\u003cp\u003eI walk away.\u003c/p\u003e\n\u003cp\u003e14.\u003c/p\u003e\n\u003cp\u003ethe honeymoon\u003c/p\u003e\n\u003cp\u003eI’M HOLDING HER hand now and I have no intentions of letting her walk out of my life again.\u003c/p\u003e\n\u003cp\u003eLake can see the regret I have over that night, so she takes my face in her hands and smiles reassuringly at me. “You do realize you are the most selfless person I know, right?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “Lake, I’m not selfless. I put so much at risk every time I was around you, but I still couldn’t control myself. It’s like I couldn’t breathe unless I was near you.”\u003c/p\u003e\n\u003cp\u003e“You are not selfish. We were in love. Really in love. You warred with yourself to do the right thing and that says so much about your character. I respect you for that, Will Cooper.”\u003c/p\u003e\n\u003cp\u003eI knew I married her for a reason. I grab the back of her neck and pull her forehead toward mine and kiss it.\u003c/p\u003e\n\u003cp\u003eShe lays her head on my chest and wraps her arm around me. “Besides, there’s no way you could have been perfect the whole time we were forced apart,” she says. “It’s just too hard to not love me, considering how irresistible I am.”\u003c/p\u003e\n\u003cp\u003eI laugh and flip her off me and onto her back. “You got that right,” I say, tickling her ribs. I try to straddle her and pin her down, but she squirms beneath me and somehow breaks free, scooting off the bed. I grab her wrist and she pulls back, yanking me forward. She turns and tries to break free but trips over the desk chair. I grab her waist just as she falls to the floor, then I slide on top of her and pin her wrists to the carpet. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-girl-slammed-3/page-26.html","bookId":2781,"creation":"Oct 5, 2019 5:24:07 PM","modification":"Oct 5, 2019 5:24:07 PM"}
