{"id":87752,"no":27,"title":"Page 27","content":"\u003cp\u003e“See how irresistible I am?” She laughs. “You won’t even let me off the butterflying bed without you!”\u003c/p\u003e\n\u003cp\u003eMy eyes drink in every inch of her from head to toe. “Maybe if you’d put on some clothes I’d feel less inclined to attack you.”\u003c/p\u003e\n\u003cp\u003eShe pulls one of her hands from mine and reaches to the chair above her head where her robe landed earlier. “Fine,” she says, yanking it off the chair. “I’ll wear this until we leave tomorrow.”\u003c/p\u003e\n\u003cp\u003eI grab the robe from her hands and toss it behind me. “The hell you will. I told you what you were allowed to wear on this honeymoon, and that robe wasn’t on the list.”\u003c/p\u003e\n\u003cp\u003e“Well, everything that was on the list is sort of soaking wet, thanks to you.”\u003c/p\u003e\n\u003cp\u003eI laugh. “That’s only inconvenient for anyone who isn’t me.” As soon as I kiss her, she finds the one spot on my stomach that’s ticklish and she attacks. I’m immediately off her, trying to get away from her hands. I hop back onto the bed and she jumps on top of me. Once I realize she has me pinned to the bed, I immediately give up and let her win.\u003c/p\u003e\n\u003cp\u003eWho wouldn’t?\u003c/p\u003e\n\u003cp\u003e“Fun should have been the fourth thing on my mom’s list,” she says, dropping herself beside me, breathless from the effort she spent trying to attack me. I cock my eyebrow, curious about what list she’s referring to. She sees I’m not following, so she elaborates. “She said there were three things every woman should look for in a man. Having fun with him wasn’t on the list, but I think it should be.” She sits up and scoots back to the headboard. “Tell me about a fun time. A happy time. I need a break from all the sad memories for a while.”\u003c/p\u003e\n\u003cp\u003eI think back to the months after we first met, and struggle to come up with a positive one. “It’s hard, Lake. There were happy moments, but not really happy times. There was so much heartache under the surface of that entire year.”\u003c/p\u003e\n\u003cp\u003e“Then tell me one of your happy moments.”\u003c/p\u003e\n\u003cp\u003ecarving pumpkins\u003c/p\u003e\n\u003cp\u003eIT’S ALMOST FIVE, so after I unload the groceries I walk across the street to get Caulder. Julia and Lake need to talk, so I think I’ll offer to take Kel for a while, too. Before I knock, I take a deep breath and prepare for whatever reaction Lake might have. I gave her detention today so I could talk to her and Eddie, then I just left her and Eddie a blubbering mess in my classroom. I’m not sure if she’s pissed at me right now but I felt like I needed to make a point, which is the only reason I did it. Whether or not Lake got my point, I guess I’m about to find out.\u003c/p\u003e\n\u003cp\u003eWhen the door opens, I’m shocked to see Caulder. “Hey, buddy. You answering doors here now?”\u003c/p\u003e\n\u003cp\u003eHe smiles and grabs my hand, pulling me inside. “We’re carving pumpkins for Halloween. Come on, Julia bought one for you, too.”\u003c/p\u003e\n\u003cp\u003e“No, it’s fine. I’ll carve mine another time. I just wanted to bring you home so they can have some family time.”\u003c/p\u003e\n\u003cp\u003eI look up to see the four of them sitting at the bar carving pumpkins. I know Lake hasn’t had a chance to talk with Julia, since she had to have just gotten home, so I’m a little confused at the serene family appearing in front of me.\u003c/p\u003e\n\u003cp\u003eJulia pulls out a chair and pats it, indicating she wants me to stay. “Sit down, Will. We’re just carving pumpkins tonight. That’s all we’re doing. Just carving pumpkins.”\u003c/p\u003e\n\u003cp\u003eIt’s obvious from her tone that Lake must have told her she doesn’t want to talk about it again. That doesn’t surprise me. “Okay, then. I guess we’re carving pumpkins.” I sit in the chair Julia pulled out for me, directly across from Lake. We glance at each other as I take my seat. Her expression is soft but not very telling. I don’t know how she feels about what I said during detention today, but if her expression is any indication, she doesn’t seem angry. She almost seems apologetic.\u003c/p\u003e\n\u003cp\u003e“Why were you so late getting home today, Layken?” Kel asks. I glance away just as Lake snaps her head in his direction. I focus my attention on the pumpkin in front of me.\u003c/p\u003e\n\u003cp\u003e“Eddie and I had detention,” she says matter-of-factly.\u003c/p\u003e\n\u003cp\u003e“Detention? What were you in detention for?” Julia asks.\u003c/p\u003e\n\u003cp\u003eI can feel the blood pooling in my cheeks.\u003c/p\u003e\n\u003cp\u003eLie to her, Lake.\u003c/p\u003e\n\u003cp\u003e“We skipped class last week, took a nap in the courtyard.”\u003c/p\u003e\n\u003cp\u003eThat’s my girl. I silently let out a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Lake, why would you do something like that? What class did you skip?” Julia asks, obviously disappointed. Lake doesn’t respond, which causes me to look up. She and Julia are both staring at me.\u003c/p\u003e\n\u003cp\u003e“She skipped my class!” I laugh. “What was I supposed to do?”\u003c/p\u003e\n\u003cp\u003eJulia laughs and pats me on the back. “I’m buying you supper for that.”\u003c/p\u003e\n\u003cp\u003eI WALK TO the door with Julia when the pizza arrives and take it from the delivery guy while she pays him. I set it on the counter and make the boys a plate.\u003c/p\u003e\n\u003cp\u003e“I want to try this suck and sweet Kel keeps telling me about,” Julia says after we all sit down. Lake looks up at her, confused about what “suck and sweet” is, but she doesn’t ask for an explanation.\u003c/p\u003e\n\u003cp\u003e“Good idea, I’ll go first. Show you guys how it’s done,” I say. I take a sip of my drink and start with my suck.\u003c/p\u003e\n\u003cp\u003e“Mrs. Alex was my suck today,” I say.\u003c/p\u003e\n\u003cp\u003e“Who’s Mrs. Alex and why was she your suck?” Julia asks.\u003c/p\u003e\n\u003cp\u003e“She’s the secretary, and . . . let’s just say she favors me. Today I had to go turn in my absentee reports. We always place them in our boxes before the end of the day and Mrs. Alex collects them all in order to enter them into the system. When I looked at my name on my box, there were two purple hearts doodled over the Os in my last name. Mrs. Alex is the only one who writes with purple ink.”\u003c/p\u003e\n\u003cp\u003eLake and Julia both burst out laughing. “Mrs. Alex has a crush on you?” Lake says, laughing. “She’s . . . old. And married!”\u003c/p\u003e\n\u003cp\u003eI smile and nod, a little embarrassed. I try to turn my focus back to Julia, but seeing Lake finally laughing is captivating. It’s amazing how one smile from her can shift the mood of my entire day. Lake sighs and leans back in her chair. “So are you supposed to say a ‘sweet’ now? Is that how this works?”\u003c/p\u003e\n\u003cp\u003eI nod, unable to look away from her. Her smile meets her eyes, and even though I know she has a lot to deal with in the coming days, I feel a sense of relief just seeing her happiness break through, if only for a moment. The fact that she can still find something positive in her current situation reassures me that she’ll be okay.\u003c/p\u003e\n\u003cp\u003e“My sweet?” I say, staring directly at her. “My sweet is right now.”\u003c/p\u003e\n\u003cp\u003eFor a moment, it’s just the two of us in the room. I don’t hear or think about or acknowledge anyone else around us. She smiles at me and I smile back and neither of us breaks our stare. It’s as if a silent truce occurs between us and all is suddenly right in our little two-person world.\u003c/p\u003e\n\u003cp\u003eJulia clears her throat and leans forward. “Okay, I think we know how to play now,” she says, interrupting our moment. I glance at Julia and she’s looking at the boys. “Kel, you go next,” Julia says, pretending not to have noticed my and Lake’s little “moment.” I watch Kel, forcing myself to avoid looking at Lake again. If I do, I won’t be able to stop myself from jumping over the bar and kissing her.\u003c/p\u003e\n\u003cp\u003e“My suck is that I still can’t think of what to be for Halloween,” Kel says. “My sweet is that Will agreed to take us geocaching again this weekend.”\u003c/p\u003e\n\u003cp\u003e“I’m taking you geocaching?” This is the first I’ve heard of it.\u003c/p\u003e\n\u003cp\u003e“You are?” Kel says sarcastically. “Aww, gee, Will. That sounds like fun! I’d love to go geocaching this weekend.”\u003c/p\u003e\n\u003cp\u003eI laugh and look over at Caulder. “Your turn.”\u003c/p\u003e\n\u003cp\u003eHe nudges his head toward Kel. “Same thing,” he says.\u003c/p\u003e\n\u003cp\u003e“That’s a copout,” Julia says to Caulder. “You have to be original.”\u003c/p\u003e\n\u003cp\u003eCaulder rolls his eyes. “Fine,” he groans, setting down his pizza. “My suck today is that my best friend’s suck is that he can’t think of what he wants to be for Halloween. My sweet is that my best friend’s sweet is that Will agreed to take us geocaching this weekend.”\u003c/p\u003e\n\u003cp\u003e“You’re such a smart-ass,” I say to Caulder.\u003c/p\u003e\n\u003cp\u003e“My turn,” Julia says. “My sweet today is that we got to carve pumpkins together.” She leans back in her chair and smiles at all of us. I glance at Lake and she’s staring down at her hands, folded in front of her on the table. She’s picking at her nail polish, something I noticed she does when she’s stressed, just like Julia. I know she’s thinking what I’m thinking. That this is more than likely Julia’s last time to carve pumpkins. Lake brings her hand to her eyes and it looks like she’s trying to stop a tear from falling. I quickly turn to Julia to remove any focus from Lake.\u003c/p\u003e\n\u003cp\u003e“What’s your suck?” I ask.\u003c/p\u003e\n\u003cp\u003eJulia continues to watch Lake when she responds. “My suck is the same as my sweet,” Julia says quietly. “We’re still carving pumpkins.”\u003c/p\u003e\n\u003cp\u003eI’m beginning to understand that “carving pumpkins” has taken on a whole new meaning. Lake immediately stands up and grabs empty plates off the bar, completely ignoring her mother’s gaze.\u003c/p\u003e\n\u003cp\u003e“My suck is that it’s my night to do dishes,” Lake says. She walks to the sink and turns on the water. Kel and Caulder begin discussing Halloween costumes again, so Julia and I help throw out a few ideas.\u003c/p\u003e\n\u003cp\u003eNo one ever asks Lake what her sweet is.\u003c/p\u003e\n\u003cp\u003e15.\u003c/p\u003e\n\u003cp\u003ethe honeymoon\u003c/p\u003e\n\u003cp\u003e“I DID HAVE a sweet that night,” she says. “Remember the conversation we had when we took the trash out? When you told me about the first time you saw me?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“That was my sweet. Having that moment with you. All the little moments I got with you were always my sweets.” She kisses me on the forehead.\u003c/p\u003e\n\u003cp\u003e“That was my sweet, too,” I say. “That and the intense stare you gave me while we were playing suck and sweet.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “If you only knew what I was thinking.”\u003c/p\u003e\n\u003cp\u003eI cock my eyebrow at her. “Naughty thoughts?”\u003c/p\u003e\n\u003cp\u003e“As soon as you said ‘My sweet is right now,’ ” I wanted to jump across the bar and ravish you,” she says.\u003c/p\u003e\n\u003cp\u003eI laugh. I never would have thought we were both thinking the exact same thing. “I wonder what your mom would have done if we had both attacked each other, right there on the bar.”\u003c/p\u003e\n\u003cp\u003e“She would have kicked your ass,” she says. She rolls onto her side and faces the other direction. “Spoon me,” she says. I scoot closer to her and slide my arm underneath her head, wrapping my other arm tightly around her. She yawns a deep yawn into her pillow. “Tell me about The Lake. I want to know why you wrote it.”\u003c/p\u003e\n\u003cp\u003eI kiss her hair and rest my head on her pillow. “I wrote it the next night. After we had basagna with your mom,” I say. “When we all sat around the table that night and discussed how things with the boys were going to be handled during her treatments, I realized that you had done it. You were doing exactly what I wished my parents had done before they died. You were taking responsibility. You were preparing for the inevitable. You were facing death head-on, and you were doing it without fear.” I put my leg over her legs and tuck her in closer to me. “Every time I was around you, you inspired me to write. And I didn’t want to write about anything but you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/this-girl-slammed-3/page-27.html","bookId":2781,"creation":"Oct 5, 2019 5:24:07 PM","modification":"Oct 5, 2019 5:24:07 PM"}
