{"id":88064,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBrent gazed down at the desk in front of him. Massey had given him a nice clear shot of Tom Garfield in his last disguise. Garfield had been good at his work. He had infiltrated cartels in South Florida, Texas and California, fingering those who needed to be fingered, then getting away clean. He\u0027d been a good-looking? hardened man in his mid-thirties, and not even the scraggly beard and dirty countenance he\u0027d taken on really hid his inner strength. That would have worked well for him, trying to get close to the big leaguers. He\u0027d had the ability to bluff his way through the toughest situation.\u003c/p\u003e\n\u003cp\u003eBrent\u0027s gaze shifted from the photo before him on the desk back toward the conference room.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s looking for people she might have seen the night before her friend\u0027s death?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s got a \u0027hunch,\u0027\" Massey said wearily. \"She saw some guy when she was with her friend, and says she saw him again last night, out on the street. I tried to tell her that she might see the same tourist types over and over again. Even the same bums. And that it doesn\u0027t matter how many times she might have seen the guy—it wouldn\u0027t make him guilty of murder. But what the hell, I got nothing else. So she\u0027s looking through mug shots.\"\u003c/p\u003e\n\u003cp\u003e\"For a bum?\" Brent said a little sharply.\u003c/p\u003e\n\u003cp\u003eMassey frowned, looking at him. Not angry, just curious. \"Yeah, someone she saw begging at a café.\"\u003c/p\u003e\n\u003cp\u003e\"Would you mind?\" Brent asked Massey, indicating Garfield\u0027s photo.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to show her a dead guy?\" Massey said.\u003c/p\u003e\n\u003cp\u003e\"Hey, you got nothing else, right?\"\u003c/p\u003e\n\u003cp\u003e\"She couldn\u0027t have seen a dead guy on the street last night,\" Massey said.\u003c/p\u003e\n\u003cp\u003eBrent shrugged, smiling dryly. \"How many of those books have you got? This could go on a long, long time.\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s a dead guy.\"\u003c/p\u003e\n\u003cp\u003e\"Humor me.\"\u003c/p\u003e\n\u003cp\u003e\"Hey… go ahead. Knock yourself out.\"\u003c/p\u003e\n\u003cp\u003eNikki was tired. Faces swam before her.\u003c/p\u003e\n\u003cp\u003eNew Orleans had quite a photo gallery of suspicious types. She was glad they hadn\u0027t asked her to go through all the mug shots on the computer. She would have an even worse headache by now.\u003c/p\u003e\n\u003cp\u003eThey\u0027d even narrowed down the choices for her, looking specifically for a white guy in his late twenties to early forties.\u003c/p\u003e\n\u003cp\u003eScary… to see all the possible perps!\u003c/p\u003e\n\u003cp\u003e\"Nothing?\" Julian asked a little tensely.\u003c/p\u003e\n\u003cp\u003eShe shook her head. Julian was growing impatient. He\u0027d gotten her an emergency appointment with his shrink, and he was clearly anxious to get going.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she murmured.\u003c/p\u003e\n\u003cp\u003e\"No one even close, huh?\" That question came from Marc Joulette, Owen Massey\u0027s younger partner. \"People can change, you know. Minus a beard, dyed hair, that kind of thing,\" he pointed out helpfully. Whereas Massey was a big solid guy with a ruddy complexion, Joulette was taller, leaner, darker. Of mixed race, he was neither white nor black but a striking golden hue. Though he was too striking ever to blend into a crowd, Nikki assumed he must be one hell of a detective, because he had great people skills. His voice was gentle and melodic. Soothing, comforting. His manner was equally gentle. She had a feeling he could garner a confession before the suspect even knew he\u0027d been talking.\u003c/p\u003e\n\u003cp\u003eNikki sat back, rubbing her temples, shaking her head again. \"I\u0027m sorry. I really want to find this guy. I know you can\u0027t arrest people on feelings, but I can\u0027t help but believe he\u0027s involved somehow. But I can\u0027t find him, and I feel like I\u0027m wasting your time,\" she apologized.\u003c/p\u003e\n\u003cp\u003eJulian made a grunting sound. She ignored him.\u003c/p\u003e\n\u003cp\u003eDetective Joulette smiled. \"Hey, this job is pure tedium at times, and you\u0027re not wasting my time. It\u0027s the little things that sometimes get the job done, huh? We can go to the computer, or… \" He paused, turning.\u003c/p\u003e\n\u003cp\u003eNikki and Julian both looked toward the door, as well.\u003c/p\u003e\n\u003cp\u003eShe barely swallowed back a gasp.\u003c/p\u003e\n\u003cp\u003eThe man standing in the doorway was the same man who had come striding into the fight the night before.\u003c/p\u003e\n\u003cp\u003eLike Joulette, he would never blend into any crowd.\u003c/p\u003e\n\u003cp\u003eHe stood about six-two, with a solid, yet lean, agile-looking build. His dead-straight black hair was telltale, though Nikki vaguely remembered someone telling her once that hair couldn\u0027t really be black, only a very dark brown.\u003c/p\u003e\n\u003cp\u003eCould have fooled her. This man\u0027s hair was so dark it wasn\u0027t just black, but jet.\u003c/p\u003e\n\u003cp\u003eThen there were his eyes. A deep and startling green against the bronze of his skin.\u003c/p\u003e\n\u003cp\u003eShe met those eyes with surprise. And as her eyes touched his, she felt a strange tremor deep inside. Just as she had when their hands had met the night before.\u003c/p\u003e\n\u003cp\u003e\"You,\" Julian breathed.\u003c/p\u003e\n\u003cp\u003e\"You all know each other?\" Massey, who was behind the unnamed man, demanded in surprise.\u003c/p\u003e\n\u003cp\u003e\"We met at a minor street brawl last night,\" the man said, smiling. \"Well, actually, we didn\u0027t meet formally.\"\u003c/p\u003e\n\u003cp\u003eThe guy had a truly great face, Nikki thought. Full of character. A chin like concrete. High, broad cheekbones. Bone structure to die for…\u003c/p\u003e\n\u003cp\u003eDie for…\u003c/p\u003e\n\u003cp\u003eNot a term to use these days.\u003c/p\u003e\n\u003cp\u003e\"Thanks again for the help,\" Julian said, striding around the desk to shake hands.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make the formal introduction, then,\" Massey said. \"Nikki DuMonde, Julian Lalac, this is Brent Blackhawk. Brent, Nikki, Julian… \"\u003c/p\u003e\n\u003cp\u003e\"Pleased to meet you,\" Brent said, smiling in acknowledgment.\u003c/p\u003e\n\u003cp\u003e\"Are you a cop?\" Nikki asked.\u003c/p\u003e\n\u003cp\u003eHis smile deepened. He shook his head. \"Kind of a troubleshooter,\" he murmured vaguely.\u003c/p\u003e\n\u003cp\u003e\"Here as a guest,\" Massey said.\u003c/p\u003e\n\u003cp\u003eMarc Joulette rose, stretching. \"This is a good break. Nikki, you want a soda? A coffee? Julian? Anyone… ? I\u0027ve got to go get another book.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing for me, thanks,\" Brent Blackhawk said. \"Sorry, I didn\u0027t mean to interrupt. I kind of came in on a… well, I\u0027m curious. Thought you might have run into this guy.\"\u003c/p\u003e\n\u003cp\u003eHe strode to the desk, setting down a picture.\u003c/p\u003e\n\u003cp\u003eNikki gasped, stared at the picture, then back at Brent Blackhawk. His eyes were strangely knowing. She looked around at the others.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s him!\" she exclaimed. She looked around at the others, triumphant. \"That\u0027s him,\" she repeated.\u003c/p\u003e\n\u003cp\u003e\"Good. We know who it is, then,\" Julian said, pleased.\u003c/p\u003e\n\u003cp\u003eBut the others didn\u0027t say a word. They were staring at her strangely. Massey and Joulette looked stunned. Brent Blackhawk seemed to be seeing something beneath the surface that brought a pensive look to his eyes as he studied her.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter? Who is he?\" Nikki asked, feeling a headache coming on strong.\u003c/p\u003e\n\u003cp\u003e\"You have to be mistaken,\" Joulette said softly.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not,\" Nikki said firmly.\u003c/p\u003e\n\u003cp\u003e\"Nikki, you\u0027ve been through a lot,\" Massey said.\u003c/p\u003e\n\u003cp\u003e\"This is the man I saw,\" Nikki said indignantly. \"I know it. So what\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003e\"You couldn\u0027t have seen him,\" Massey said. \"Not last night.\"\u003c/p\u003e\n\u003cp\u003e\"And why not?\"\u003c/p\u003e\n\u003cp\u003e\"Because he\u0027s dead,\" Joulette explained very softly.\u003c/p\u003e\n\u003cp\u003eThe room spun. Nikki was suddenly afraid she was going to pass out. Fear washed over her in terrible, sweeping waves.\u003c/p\u003e\n\u003cp\u003eShe fought the sensation furiously.\u003c/p\u003e\n\u003cp\u003eShe gritted her teeth hard and rose.\u003c/p\u003e\n\u003cp\u003e\"He has a double, a twin or something, then. Or you\u0027ve been deceived. I saw this man last night. I saw him. I have excellent eyesight. Twenty-twenty.\" When no one said anything in response, she went on, \"Excuse me, it\u0027s obvious you don\u0027t intend to believe me.\"\u003c/p\u003e\n\u003cp\u003eShe started out of the room. Brent Blackhawk was watching her just as intently as the others. And he was in her way.\u003c/p\u003e\n\u003cp\u003eIt suddenly seemed to be all his fault. After all, he\u0027d brought in the picture.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" she said, trying to get past him.\u003c/p\u003e\n\u003cp\u003e\"Miss DuMonde,\" he said, \"I\u0027d really like to talk to you—\"\u003c/p\u003e\n\u003cp\u003e\"Not now.\" Julian was behind her. Both Joulette and Massey were silent.\u003c/p\u003e\n\u003cp\u003e\"Not now,\" she agreed icily. She had to get out of there. She had to get away from the police station, out onto the street.\u003c/p\u003e\n\u003cp\u003eFor a moment she was afraid he was going to stop her. That he was going to take her bodily by the shoulders and insist on speaking with her.\u003c/p\u003e\n\u003cp\u003eBut he stepped back. Suddenly she was aware only of his eyes, and she had the most bizarre thought.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have to stop her physically. He knew, knew, that he would find her, that he would speak to her.\u003c/p\u003e\n\u003cp\u003e\"I have to get out of here,\" she insisted, and she pushed blindly past him.\u003c/p\u003e\n\u003cp\u003eShe fought for control as she pushed her way outside, back to the busy street, the tourists and the vendors, the ever-present music.\u003c/p\u003e\n\u003cp\u003eJulian was close behind, and when she stopped on the sidewalk, he was right beside her.\u003c/p\u003e\n\u003cp\u003eControl. She took a deep breath and tried to sound completely casual. \"We should have lunch, or something.\"\u003c/p\u003e\n\u003cp\u003e\"We should head straight to Dr. Boulet\u0027s,\" he said, and taking her firmly by the elbow, he led her along the sidewalk, past a voodoo shop, an antique shop, a toy store… and a strip club.\u003c/p\u003e\n\u003cp\u003eIt was New Orleans, after all.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re mistaken,\" she said. \"That guy has to be alive. Or there\u0027s someone who looks just like him.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and Andy\u0027s alive, too?\" he asked softly.\u003c/p\u003e\n\u003cp\u003eShe fell silent and didn\u0027t say anything else the rest of the way to the doctor\u0027s office, which was above a souvenir shop, next to another strip joint. Yup, this was New Orleans.\u003c/p\u003e\n\u003cp\u003e\"Who exactly is Nikki DuMonde?\" Brent asked the detectives.\u003c/p\u003e\n\u003cp\u003eMassey snorted. \"A wacko, that\u0027s what it\u0027s beginning to look like,\" he said, shaking his head.\u003c/p\u003e\n\u003cp\u003eJoulette shrugged with a wry grin. \"Damn gorgeous wacko. I think she was serious, though. She really believes she saw this guy. Hey,\" he said to his partner, \"you\u0027ve spent more time with her than I have, but she\u0027s never seemed to be anything less than intelligent.\"\u003c/p\u003e\n\u003cp\u003eOwen Massey let out a sigh. \"Yeah, yeah. But she\u0027s high-strung.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s convinced her friend was murdered, what do you want?\" Joulette asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-15.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
