{"id":88072,"no":23,"title":"Page 23","content":"\u003cp\u003eNikki realized that she was still covered in goose bumps.\u003c/p\u003e\n\u003cp\u003eAnd she was afraid. Afraid as she had never been before.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know what she was up to herself when she then said, \"Andy shows up in the middle of the night sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"I fall asleep with the TV on. She always liked television.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s watching over you.\"\u003c/p\u003e\n\u003cp\u003eThe words tumbled out of her mouth then in a rush. \"I have a guest room. If you really want a chance to meet Andy, you can stay in it, and if she appears… I can call you. I can tell her about you, and you can meet her right there and then.\" Oh, God! Her words sounded really and truly insane.\u003c/p\u003e\n\u003cp\u003e\"I told you, I don\u0027t want to push things with you,\" he said very gently. \"I want you to know me and trust me.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit,\" she said, standing. \"You want me to know you and trust you. Well, so far, you\u0027ve managed to scare me half out of my wits. What do you want, an engraved invitation? There\u0027s a guest room upstairs. Since I\u0027m now afraid of my own shadow, I would deeply appreciate it if you would sleep there.\"\u003c/p\u003e\n\u003cp\u003eShe watched his slow smile appear, that smile that changed his face from hard as rock to something that was entirely beguiling.\u003c/p\u003e\n\u003cp\u003e\"Well, all right. If you put it that way.\"\u003c/p\u003e\n\u003cp\u003eShe turned away, shaking, afraid of saying even more. The next thing, she would be begging him to stay in her room, to sleep with her… to hold her.\u003c/p\u003e\n\u003cp\u003e\"Are ghosts mischievous?\" she asked him.\u003c/p\u003e\n\u003cp\u003e\"How do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Do they play tricks? Move things?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged, hesitating. Then he asked, \"You mean… like poltergeists?\"\u003c/p\u003e\n\u003cp\u003e\"I guess.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just curious.\"\u003c/p\u003e\n\u003cp\u003eAgain he hesitated, then said, \"I don\u0027t have all the answers. Have I seen ghosts move things? Yes. There\u0027s one old guy in St. Louis Number 1 who likes to throw pebbles and things at vandals who sneak over the walls. He\u0027s very protective. But… okay, there are young ghosts and old ghosts. And moving things takes trial and error and experience. Even materializing when they want to can be difficult, especially at first. When they\u0027re frightened, it\u0027s almost impossible for them.\"\u003c/p\u003e\n\u003cp\u003e\"How can a ghost be frightened?\" she demanded.\u003c/p\u003e\n\u003cp\u003e\"Okay, let\u0027s forget that most people think you\u0027re insane if you see ghosts. Now think of what a ghost would be. Made up of heart and soul and personality. If the person that they were could be frightened, so can their ghost. Especially a young ghost. Anything the person could feel, their ghost can feel.\"\u003c/p\u003e\n\u003cp\u003eShe knew she was looking at him as if he were completely insane.\u003c/p\u003e\n\u003cp\u003eShe lowered her head. \"Could Andy have moved my coffeepot?\" she asked him.\u003c/p\u003e\n\u003cp\u003eHis brows shot up. Then he looked downward, playing with his teacup, a slight smile tugging at his lips. \"Your coffeepot moved? You\u0027re certain?\"\u003c/p\u003e\n\u003cp\u003e\"Well, no. Not certain.\"\u003c/p\u003e\n\u003cp\u003eHe looked straight at her then. \"Perhaps you want to look around your house. Find out if anything is missing. Is everything as it should be… here?\"\u003c/p\u003e\n\u003cp\u003eShe looked around the living room. \"Seems to be.\"\u003c/p\u003e\n\u003cp\u003e\"Want to check out the upstairs?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eHe followed her.\u003c/p\u003e\n\u003cp\u003eHe hovered in her bedroom doorway as she looked into her jewelry cases, drawers and closet.\u003c/p\u003e\n\u003cp\u003e\"Anything?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I really am losing my mind,\" she said.\u003c/p\u003e\n\u003cp\u003e\"No you\u0027re not,\" he promised gently.\u003c/p\u003e\n\u003cp\u003e\"The guest room is next,\" she said.\u003c/p\u003e\n\u003cp\u003eBut there seemed to be nothing out of the ordinary there, either. She let out a soft sigh. \"I guess I just left the pot out farther than usual,\" she told him with a shrug.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s always safer to check things out,\" he told her simply.\u003c/p\u003e\n\u003cp\u003e\"Well, then, I\u0027ll secure the balcony doors in my room, if you wouldn\u0027t mind checking out the rest of the place… ?\"\u003c/p\u003e\n\u003cp\u003e\"Not at all.\"\u003c/p\u003e\n\u003cp\u003eBack in her room, she made sure that the balcony doors were locked and secure. They hadn\u0027t been left open, she noted.\u003c/p\u003e\n\u003cp\u003e\"All locked up,\" Brent called to her from the hallway.\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re all right?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely. Um… you should be comfortable, I hope. Good night.\"\u003c/p\u003e\n\u003cp\u003e\"Good night. And don\u0027t worry. I\u0027m here. Just call out if anything frightens you in any way. Any way at all.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Thanks again. Good night.\"\u003c/p\u003e\n\u003cp\u003eShe closed her own door but didn\u0027t lock it. Then she went through her bedtime ritual—brushing her teeth, washing her face, changing clothes—by rote.\u003c/p\u003e\n\u003cp\u003eIn the bathroom, she hesitated again. In the cabinet above the sink, it seemed that one of the large bottles of her favorite perfume—a Christmas gift from Patricia—had been moved just slightly, too. It was a wee bit too close to the edge of the shelf.\u003c/p\u003e\n\u003cp\u003eIt was ridiculous, she told herself. She could be too organized—she knew that. But, especially now, there was no reason to believe she was putting things back exactly as they had been. She had used the perfume that morning. Just as she had used the coffeepot that morning. She just hadn\u0027t been as precise as usual when she put them back.\u003c/p\u003e\n\u003cp\u003eStill…\u003c/p\u003e\n\u003cp\u003eIt disturbed her.\u003c/p\u003e\n\u003cp\u003eEverything was disturbing her, she thought; she was undoubtedly making mountains out of molehills. She would start to see something evil in every face on the street soon if she didn\u0027t get a handle on her emotions.\u003c/p\u003e\n\u003cp\u003eWith that she determined she was going to bed.\u003c/p\u003e\n\u003cp\u003eShe lay down, certain she would never get to sleep.\u003c/p\u003e\n\u003cp\u003eHer things had been moved.\u003c/p\u003e\n\u003cp\u003eThat was ridiculous. No one broke into an apartment to shift around a coffeepot and a perfume bottle.\u003c/p\u003e\n\u003cp\u003eMaybe it had been Andy. Whether she was a young ghost or not.\u003c/p\u003e\n\u003cp\u003eAnd maybe she was really nuts right now.\u003c/p\u003e\n\u003cp\u003eSleep. She needed sleep.\u003c/p\u003e\n\u003cp\u003eNo, she would never be able to sleep.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eHer eyes were closing, and she was definitely in a comfortable drowsy state. She\u0027d invited a near stranger to stay in her house. But because he was there, she felt safe. Safe and secure as she hadn\u0027t since…\u003c/p\u003e\n\u003cp\u003eSince Andy.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes.\u003c/p\u003e\n\u003cp\u003eAnd the next thing she knew, it was morning.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003ePatricia woke early and was annoyed with herself. She hated it when she awoke before her alarm rang. Their nights could run late, and she treasured her sleep in the morning.\u003c/p\u003e\n\u003cp\u003eThe room was still dark. There was nothing to have awakened her.\u003c/p\u003e\n\u003cp\u003eAt her side, Nathan still slept soundly. She was glad of him being there.\u003c/p\u003e\n\u003cp\u003eThings had been perfect, in her job and her life, until…\u003c/p\u003e\n\u003cp\u003eUntil Andy had died.\u003c/p\u003e\n\u003cp\u003eShe felt a little shiver of fear, and a rush of empathy for Andy swept through her. She hadn\u0027t known her that well, but that didn\u0027t really matter—she had known her, and what had happened to her had been terrible. No, terrible wasn\u0027t nearly adequate to describe the fact that a gorgeous, vivacious young woman with everything in the world to live for was gone.\u003c/p\u003e\n\u003cp\u003eBy her own hand? Or, as Nikki seemed to believe, with the help of another?\u003c/p\u003e\n\u003cp\u003eHad Andy fallen back into her old ways?\u003c/p\u003e\n\u003cp\u003eOr had she really been a victim?\u003c/p\u003e\n\u003cp\u003eHad she known her fate? Had she been terrified? Had she fought, then lost her fight?\u003c/p\u003e\n\u003cp\u003ePatricia swallowed, glancing to her side again. Nathan\u0027s dark hair was just discernible against the pillow in the pale light that filtered into the room. She heard his even breathing.\u003c/p\u003e\n\u003cp\u003eWith Nikki being so insistent, the police had been forced to give Andy\u0027s case serious thought. But they had nothing. Detective Massey had been honest with them about that.\u003c/p\u003e\n\u003cp\u003eIf Andy had been attacked, no one had heard anything. But then again, who had been around to hear? Just poor old deaf Mrs. Montobello?\u003c/p\u003e\n\u003cp\u003ePatricia wished suddenly and desperately that they\u0027d never met Andy Ciello. Whatever happened to her must have happened because of her past.\u003c/p\u003e\n\u003cp\u003eMaybe not. Maybe she had been the random victim of a psychopath.\u003c/p\u003e\n\u003cp\u003eOne who didn\u0027t leave behind a fingerprint, a fiber or a hair.\u003c/p\u003e\n\u003cp\u003eNo, psychopaths didn\u0027t run around making it appear that someone had died from a drug overdose.\u003c/p\u003e\n\u003cp\u003e\"Hey there.\"\u003c/p\u003e\n\u003cp\u003eShe nearly hit the ceiling, the sound of Nathan\u0027s voice was so startling.\u003c/p\u003e\n\u003cp\u003e\"Oh, jeez!\" she gasped out.\u003c/p\u003e\n\u003cp\u003e\"Patricia, what\u0027s the matter with you?\" he demanded, slipping an arm around her. \"You\u0027re cold as ice and shaking like a leaf.\"\u003c/p\u003e\n\u003cp\u003e\"You startled me.\"\u003c/p\u003e\n\u003cp\u003e\"How could I startle you? I\u0027ve been here all night.\"\u003c/p\u003e\n\u003cp\u003eBeen here all night.\u003c/p\u003e\n\u003cp\u003eNathan. She had fallen into lust with him first—he\u0027d walked her home after one of their tours, and somehow they\u0027d looked at each other and started stripping themselves and each other—and only later had she discovered just how head over heels she was with him.\u003c/p\u003e\n\u003cp\u003eShe was grateful that they\u0027d discovered their passion for one another. She wasn\u0027t alone now.\u003c/p\u003e\n\u003cp\u003eWasn\u0027t alone.\u003c/p\u003e\n\u003cp\u003eBut that night…\u003c/p\u003e\n\u003cp\u003eThe night Andy had died…\u003c/p\u003e\n\u003cp\u003eThey\u0027d all been out together, drinking. Too much. She and Nathan had gone home together. And in the middle of the night, she\u0027d gotten up for aspirin. Staggered into the bathroom and back, falling down onto the sheets. And there had been something, something not quite right…\u003c/p\u003e\n\u003cp\u003eThe bed had been…\u003c/p\u003e\n\u003cp\u003eEmpty.\u003c/p\u003e\n\u003cp\u003eOr had it?\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t really know. She\u0027d had too much to drink, and she\u0027d been exhausted. She\u0027d gone back to bed, thinking something was ever so slightly wrong, nothing warm touching her, but she\u0027d crashed out again, and when she had awakened, he\u0027d been next to her, just as if he had been there all night, and she figured she had just imagined in her silly drunken stupor that she had been alone.\u003c/p\u003e\n\u003cp\u003e\"I was just… thinking about poor Andy,\" she whispered.\u003c/p\u003e\n\u003cp\u003eHe drew her close. His arms felt warm and sure and strong.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t spend our lives dwelling on what happened to her,\" he told her quietly.\u003c/p\u003e\n\u003cp\u003e\"I know. But it isn\u0027t easy to forget.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. And we\u0027d be terrible human beings if it didn\u0027t cut to the core.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-23.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
