{"id":88079,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Well, not right away. But trust me. I\u0027m going to wear you out. Then you\u0027ll sleep.\"\u003c/p\u003e\n\u003cp\u003eOnly when he fell asleep and lay deeply, peacefully breathing beside her did she think about the fact that he\u0027d been wearing his jeans.\u003c/p\u003e\n\u003cp\u003eAnd he\u0027d left his shoes, with bits of damp dirt clinging to the soles, in the kitchen.\u003c/p\u003e\n\u003cp\u003eHad he been out?\u003c/p\u003e\n\u003cp\u003eThe city was always alive somewhere.\u003c/p\u003e\n\u003cp\u003eBut if he\u0027d been out, why hadn\u0027t he mentioned it?\u003c/p\u003e\n\u003cp\u003eNikki couldn\u0027t remember a time when she\u0027d been out on the streets quite this late—or early. Though there was activity—music pulsing faintly from the strip joints—the relative quiet was actually kind of nice. Building facades were ever so slightly ghostly; lights created color as well as shadow. A few people were about—mostly drunks—but there was still something oddly enchanting about the darkened city.\u003c/p\u003e\n\u003cp\u003eShe brought Brent to a place called Maxie\u0027s. It was near the casino, which provided a twenty-four-hour clientele.\u003c/p\u003e\n\u003cp\u003eIt offered little other than sandwiches, but those were excellent. Nikki was ravenous, and still feeling a sense of exhilaration. She wondered if she looked flushed, her eyes as brilliant as diamonds. There was probably a lot of truth in the belief that sex made the entire world better.\u003c/p\u003e\n\u003cp\u003eBrent seemed pleased by the place, and at least as hungry as she was.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve never been here?\" she asked him when they had both been served iced tea and po\u0027boys.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"And see—I thought I knew the city backward and forward.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, you do. You came up with all kinds of tidbits today that I knew nothing about. Like the slave, Huey. That was certainly extraordinary, that a descendant of his old master was in the group.\"\u003c/p\u003e\n\u003cp\u003eBrent shrugged, looking down at his food. \"Maybe not so extraordinary. McManus left three children all those years ago. By now there could be lots of descendants. And people have a tendency to want to explore their roots.\"\u003c/p\u003e\n\u003cp\u003e\"Still, that she was in the crowd yesterday—that was pretty amazing.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Interesting, certainly.\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t looking at her, he realized. He was staring past her. He was seated with his back against the wall, facing the door, while she had her back to it.\u003c/p\u003e\n\u003cp\u003e\"What?\" she said, turning to look. \"Mitch,\" she said in surprise.\u003c/p\u003e\n\u003cp\u003eMitch was at the entrance, waiting to be shown to a table. He heard her and turned quickly. Seeing her and Brent, he appeared startled at first; then he smiled, and walked over to join them.\u003c/p\u003e\n\u003cp\u003e\"What on earth are you doing out at this hour?\" she asked him.\u003c/p\u003e\n\u003cp\u003eHe brushed back a strand of tawny hair that had fallen over his forehead and pulled out the chair next to Nikki\u0027s. \"I\u0027m hungry. What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Same,\" Brent said.\u003c/p\u003e\n\u003cp\u003eMitch grinned at Nikki. \"But you—awake? That\u0027s amazing.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head and glanced at Brent. \"I\u0027m known as the deadbeat in the crowd. I\u0027m not a late-night person.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m from a place in Pennsylvania where everything shuts down at ten, and I love it that any time of the day or night, there\u0027s something going on here,\" he said to Brent.\u003c/p\u003e\n\u003cp\u003e\"Are you always such a night owl?\" Brent asked him. His tone was casual, his smile open, but Nikki was certain that his interest wasn\u0027t casual at all.\u003c/p\u003e\n\u003cp\u003e\"Actually, no. But that\u0027s my point. You may not want to be out at three or four in the morning all the time, but when you are awake, there\u0027s always something to do.\"\u003c/p\u003e\n\u003cp\u003eHe twisted around, searching the restaurant as if he was looking for someone, Nikki thought.\u003c/p\u003e\n\u003cp\u003eWhether that had been the case or not, he found someone.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said softly. \"Over there… in that back booth… isn\u0027t that the cop working Andy\u0027s case?\"\u003c/p\u003e\n\u003cp\u003eBoth Nikki and Brent twisted to look in the direction Mitch was indicating.\u003c/p\u003e\n\u003cp\u003eIndeed, it was Owen Massey. Head down, he looked haggard and worn as he leafed through a stack of pages.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Massey all right,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Well,\" Mitch said, glancing at his watch, \"it\u0027s really late. Or early. I should get going.\"\u003c/p\u003e\n\u003cp\u003e\"Get going?\" Brent said to him, those steely green eyes sharp. \"You just got here. Thought you were hungry.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, hell, yeah. I forgot to order and eat,\" Mitch said. He raised a hand, and their waitress came over. \"I\u0027ll just have tea and that same chicken po\u0027boy the lady is having,\" he said, indicating Nikki\u0027s plate.\u003c/p\u003e\n\u003cp\u003eThe woman nodded and left them.\u003c/p\u003e\n\u003cp\u003e\"So… how did you like your first day?\" Mitch asked Brent.\u003c/p\u003e\n\u003cp\u003e\"It was fun.\"\u003c/p\u003e\n\u003cp\u003e\"It is fun, working with people,\" Mitch agreed. \"Hey, should we go say hello to the detective, see if he\u0027s got anything new?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, we should,\" Nikki agreed, looking at Brent for confirmation.\u003c/p\u003e\n\u003cp\u003eBrent lifted his hands. \"Sure.\"\u003c/p\u003e\n\u003cp\u003eAs they approached his table, Massey looked up. He quickly closed the manila file that contained whatever papers he\u0027d been reading.\u003c/p\u003e\n\u003cp\u003e\"Hi, Detective,\" Nikki said, smiling. \"We saw you and just thought we should say hello.\"\u003c/p\u003e\n\u003cp\u003eMassey nodded gravely, looking at the three of them. \"I saw you all come in,\" he said. \"Didn\u0027t know if you wanted to be bothered or not. Especially by me.\"\u003c/p\u003e\n\u003cp\u003eNikki was quick to speak. \"Hey, you\u0027ve been nothing but great to me. I know how hard you\u0027re trying. I appreciate your effort.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing new, is there?\" Mitch asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid not,\" Massey said. \"It could be a long haul,\" he said gently. He looked at Brent oddly, Nikki thought. Maybe, whether he believed in ghosts or not, Massey was hoping that Brent would come up with something for him.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s late for you to be out, isn\u0027t it?\" Brent asked Massey casually.\u003c/p\u003e\n\u003cp\u003e\"Couldn\u0027t sleep. I\u0027m not due in for hours, but…\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t sleep, either,\" Mitch said. \"Strange night, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe there\u0027s something in the air. Saw a few more of your group in here not too long ago,\" Massey said.\u003c/p\u003e\n\u003cp\u003eNikki was both startled and curious. \"Who?\"\u003c/p\u003e\n\u003cp\u003e\"The handsome young fellow who\u0027s always hanging around with you, for one,\" Massey said.\u003c/p\u003e\n\u003cp\u003e\"Julian?\"\u003c/p\u003e\n\u003cp\u003e\"Yep. He was over in that corner.\" Massey pointed across the room. The opposite corner was very private. \"He was with a woman so I didn\u0027t intrude.\"\u003c/p\u003e\n\u003cp\u003e\"Who else was here?\" Brent asked.\u003c/p\u003e\n\u003cp\u003e\"That pseudo French woman.\"\u003c/p\u003e\n\u003cp\u003eHe said it with the slightest indication of distaste.\u003c/p\u003e\n\u003cp\u003e\"Pseudo French woman?\" Mitch said, puzzled.\u003c/p\u003e\n\u003cp\u003e\"Madame?\" Nikki said. \"She\u0027s nice, even if she\u0027s not really French,\" she said, laughing. \"Her place is wonderful. Haven\u0027t you ever gotten anything there?\"\u003c/p\u003e\n\u003cp\u003e\"Her prices are a bit high, if you ask me.\" He pointed. \"Looks like they just served more food over at your table.\"\u003c/p\u003e\n\u003cp\u003e\"My sandwich,\" Mitch said.\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027ll see you, Detective,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Yep. You know, call me—\"\u003c/p\u003e\n\u003cp\u003e\"If I think of anything at all. Thanks,\" Nikki said.\u003c/p\u003e\n\u003cp\u003eShe realized only after she followed Mitch back to their table that Brent had lingered and slid into the booth opposite Massey. The two were talking intently.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that all about?\" Mitch asked Nikki.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, you think Julian got lucky with that girl from the cemetery today?\" Mitch asked.\u003c/p\u003e\n\u003cp\u003e\"Well, I guess he got lucky with someone,\" Nikki said.\u003c/p\u003e\n\u003cp\u003eMitch frowned suddenly. \"And you… who is this guy? You need to be careful right now, too. I mean, I\u0027m not saying he doesn\u0027t seem decent enough, but… he looks pretty cozy over there right now, talking to Detective Massey.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine, don\u0027t worry. He\u0027s got an in with the police,\" Nikki assured Mitch.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah?\" Mitch queried.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"He does work for an agency that does some work for the police. I don\u0027t know the whole story, but he\u0027s definitely all right,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I thought he was working for us now.\"\u003c/p\u003e\n\u003cp\u003e\"As long as he shows up for his tours, I don\u0027t care what else he does with his time.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm.\" Mitch chewed and studied the two men in the back booth.\u003c/p\u003e\n\u003cp\u003e\"I think you guys are just worried about having another male in the mix.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. But I think I\u0027ll just keep my eye on him anyway,\" Mitch said, sounding very much like an older brother.\u003c/p\u003e\n\u003cp\u003eShe grinned. \"Okay. You do that.\"\u003c/p\u003e\n\u003cp\u003eA few minutes later Brent returned to their table, offering no explanation. They lingered for a few more minutes, Mitch raising the idea that they should write a book of ghostly legends. \"Everyone is doing it,\" he assured them.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the problem, isn\u0027t it? Everyone is already doing it,\" Nikki told him.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"We would use our stories—\"\u003c/p\u003e\n\u003cp\u003e\"Most of the people working in New Orleans have the same stories. They\u0027re part of history, remember?\" Nikki reminded him.\u003c/p\u003e\n\u003cp\u003eBut Mitch shook his head. \"Hey, Brent had great stories I hadn\u0027t heard before today. And besides, ours will be more dramatic and wonderful, like we are.\"\u003c/p\u003e\n\u003cp\u003e\"Get started on it, then,\" Nikki told him.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have a truly unique book. We can put in our own ghosts, right?\"\u003c/p\u003e\n\u003cp\u003ePut in their own ghosts. Like Andy.\u003c/p\u003e\n\u003cp\u003eNikki stood abruptly. \"It\u0027s really late,\" she said. \"We have to get some sleep.\"\u003c/p\u003e\n\u003cp\u003e\"We have to pay the check,\" Brent reminded her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got it,\" Mitch assured them. \"Go ahead—I\u0027ll turn it in with my expenses,\" he told Nikki with a grin.\u003c/p\u003e\n\u003cp\u003eAs Brent rose to join her, Massey was hurrying from his booth at the back. He shook his head. \"Fool kids. There\u0027s been an attack over by St. Louis Number 1. Take care. Call me,\" he reminded them distractedly.\u003c/p\u003e\n\u003cp\u003eOutside, Nikki linked arms with Brent. \"So what was that all about?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-30.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
