{"id":88080,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"What?\" He looked at her, green eyes like gems, giving away nothing.\u003c/p\u003e\n\u003cp\u003eShe sighed. \"You and Massey.\"\u003c/p\u003e\n\u003cp\u003e\"Just a rehash,\" he said briefly. \"Strange, though, huh? Everybody out tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027re out,\" she reminded him.\u003c/p\u003e\n\u003cp\u003e\"And Mitch. And Julian. And that woman who runs the café.\"\u003c/p\u003e\n\u003cp\u003e\"And Detective Massey,\" she said impatiently. \"What are you getting at?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" he said. His eyes were on the street. More people were beginning to stir, but it was still dark and fairly quiet. \"It\u0027s just a strange night. So many of the living about, and other than that… \"\u003c/p\u003e\n\u003cp\u003eShe frowned, looking at him. A little shiver stirred in her. \"Do you see ghosts all the time?\" The question seemed absurd. But it was real. And unnerving.\u003c/p\u003e\n\u003cp\u003e\"No. Not all the time.\" He hesitated. She knew that he didn\u0027t like to sound absurd himself. \"New Orleans… it\u0027s one of those places,\" he said simply. Then he said flatly. \"The dead are quiet tonight. The living seem to be in an uproar.\"\u003c/p\u003e\n\u003cp\u003e\"Hardly an uproar,\" she murmured.\u003c/p\u003e\n\u003cp\u003e\"We need to take a left. To get to my bed-and-breakfast. And my clothes,\" he said.\u003c/p\u003e\n\u003cp\u003eShe knew the house off Conte where he had chosen to stay. It dated back to the mid-Victorian period. He fitted his key quietly in the front door, and they made their way even more quietly to his bedroom. He packed a small leather duffel bag, while she sat on the bed, waiting. Then they slipped back out, Brent testing the door to make sure it was locked when they left.\u003c/p\u003e\n\u003cp\u003eThe very first streaks of dawn were beginning to appear in the sky as they headed for her apartment.\u003c/p\u003e\n\u003cp\u003e\"Curious,\" Brent said, almost to himself.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Your friends all being up and about.\"\u003c/p\u003e\n\u003cp\u003eA knot of tension formed in her midriff. \"Why is that curious?\"\u003c/p\u003e\n\u003cp\u003eHe looked straight ahead. Instead of answering her, he said, \"There was no sign of forced entry at Andrea Ciello\u0027s apartment,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh, I get it. So she was murdered by someone she knew.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t reply.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t go getting suspicious of any of my group,\" she warned him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t go getting angry,\" he said. \"Whenever you\u0027re looking for anything, you get rid of the impossible. Then you look at what you\u0027re left with. No matter how improbable, your answers have to be there.\"\u003c/p\u003e\n\u003cp\u003eShe pulled away from him, staring at him. \"Ghosts are supposedly impossible,\" she said angrily, then walked on quickly.\u003c/p\u003e\n\u003cp\u003eShe suddenly had a feeling, like a premonition.\u003c/p\u003e\n\u003cp\u003eHer world was about to split wide open.\u003c/p\u003e\n\u003cp\u003eTreacherous times loomed ahead. Fear, anger… mistrust.\u003c/p\u003e\n\u003cp\u003eShe suddenly, desperately, wanted the future never to come.\u003c/p\u003e\n\u003cp\u003eWhen they entered her apartment, she turned to him, pulling the duffel from his shoulder, casting it to the floor. \"We can fight later.\" She realized that her voice grew thin as she spoke. \"But this morning… let\u0027s pretend that we don\u0027t see ghosts. Let\u0027s not think or talk about anything that\u0027s terrible or frightening or… deadly. Please.\"\u003c/p\u003e\n\u003cp\u003eShe touched his cheek with the palm of her hand, gentle, entreating.\u003c/p\u003e\n\u003cp\u003eHe caught her fingers, keeping them there, against his face.\u003c/p\u003e\n\u003cp\u003eA split second later, she was in his arms.\u003c/p\u003e\n\u003cp\u003eClothing was strewn even as they moved up the stairs. She felt his touch on the naked flesh of her back, and then they were in her room, in her bed.\u003c/p\u003e\n\u003cp\u003eThe sun rose over New Orleans, and the new day began in earnest.\u003c/p\u003e\n\u003cp\u003eIn the draped shadows of her bedroom, Nikki chose not to notice.\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eNikki and Brent made it to Madame\u0027s at about nine-thirty. Mitch was already at their regular table, Patricia and Nathan arrived a few minutes later, and then Julian.\u003c/p\u003e\n\u003cp\u003e\"So you had a wild night, huh?\" Mitch teased Julian.\u003c/p\u003e\n\u003cp\u003e\"What?\" Julian said, startled as he took a seat.\u003c/p\u003e\n\u003cp\u003e\"We heard you had a tête-à-tête last night at Maxie\u0027s,\" Mitch informed him.\u003c/p\u003e\n\u003cp\u003eJulian stared at Mitch, then the others. \"Wow. I didn\u0027t think the city was that small,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Brent and I went out to Maxie\u0027s, too,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"And Mitch… ?\" Julian asked, puzzled.\u003c/p\u003e\n\u003cp\u003e\"Showed up separately,\" Brent offered.\u003c/p\u003e\n\u003cp\u003e\"Give,\" Patricia teased. \"Who were you with?\"\u003c/p\u003e\n\u003cp\u003eJulian grinned. He didn\u0027t seem disturbed that everyone knew he\u0027d had a date. Brent wondered if Nikki really had heard someone at her door, trying to connect that to the others, given that everyone he had recently met in New Orleans seemed to be running around at all hours of the night.\u003c/p\u003e\n\u003cp\u003e\"Was it that girl you met in Lafayette Number 1 yesterday?\" Nikki asked, smiling.\u003c/p\u003e\n\u003cp\u003e\"Yes, and I guess I owe you my thanks,\" Julian said. \"Wouldn\u0027t have met her without you, Nikki.\" He looked pleadingly at her. \"Nikki, can you and Brent take the Lafayette tour first this afternoon? Patricia and Nathan can do the St. Louis, and I\u0027ll pick up on the Vieux Carré tour tonight with Mitch—if that works for everyone. Please?\" he entreated.\u003c/p\u003e\n\u003cp\u003e\"Another hot date—in the afternoon?\" Mitch queried.\u003c/p\u003e\n\u003cp\u003eNikki was smiling at Julian. She seemed to be having a good time, Brent thought.\u003c/p\u003e\n\u003cp\u003eIt was almost as if, since they had returned to her place last night, she had allowed herself to forget, for a few hours, what had happened.\u003c/p\u003e\n\u003cp\u003eMadame made an appearance just then with her coffee urn. \"Any refills here, mes petites?\" she queried.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love more coffee, Madame,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Brent agreed. \"So you were out late last night, huh, Madame?\"\u003c/p\u003e\n\u003cp\u003eShe arched a brow at him. \"Goodness, how do you know that?\"\u003c/p\u003e\n\u003cp\u003e\"Our friendly local police detective was out dining on po\u0027boys, too,\" Nikki replied.\u003c/p\u003e\n\u003cp\u003eMadame laughed. \"Well, he sure keeps his eye on us. Then again, it\u0027s hard not to notice when people you know are around. Let\u0027s hope he also keeps his eye on things that matter a bit more, eh?\" She smiled. \"Strange night, though. I simply couldn\u0027t sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t be walking around alone at night, Madame,\" Julian said firmly.\u003c/p\u003e\n\u003cp\u003e\"Oh, good heavens, child, I know this city. I\u0027m careful. I know where to be—and where not to be.\"\u003c/p\u003e\n\u003cp\u003eThe fact that Andy Ciello had considered her apartment a safe place suddenly seemed to hover unspoken on the air between them. Brent was dismayed to see Nikki suddenly turn ashen.\u003c/p\u003e\n\u003cp\u003e\"Just be careful,\" Julian said.\u003c/p\u003e\n\u003cp\u003e\"I will. And thank you for being concerned,\" Madame said. \"But I also travel with my trusty pepper spray at all times.\" She smiled, then looked past them. \"Goodness, that\u0027s Harold Grant coming into my place for coffee!\" She seemed pleased. \"He must think he\u0027s about to lose his seat to that young whippersnapper Billy Banks. He\u0027s looking positively haggard.\"\u003c/p\u003e\n\u003cp\u003eBrent turned to look. Harold Grant had to be somewhere around sixty years old. He was sturdy looking, tall, broad shouldered, with a thick crop of iron-gray hair. He had a reputation for grave care in his decisions, but not a lot of humor or charm.\u003c/p\u003e\n\u003cp\u003e\"He and Billy Banks are having a debate in Jackson Square this afternoon,\" Madame said. \"There will be cops all over today, that\u0027s for sure. That means a brisk business for me. Our boys in blue do love my café au lait and beignets.\" She gave them a wave and left the table.\u003c/p\u003e\n\u003cp\u003eBrent\u0027s cell phone started to ring, startling them all. With an apologetic look, he answered it. \"Blackhawk.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Massey. Can you come down to the station for a minute?\"\u003c/p\u003e\n\u003cp\u003eHe looked at the others. They were all staring at him. \"Sure. What\u0027s up?\" he asked tensely.\u003c/p\u003e\n\u003cp\u003e\"Just get down here as soon as you can.\" There was no accusation in the words, just weariness.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right there.\"\u003c/p\u003e\n\u003cp\u003eHe snapped his phone shut. \"We start at Lafayette at twelve, right?\" he said to Nikki.\u003c/p\u003e\n\u003cp\u003e\"Twelve,\" she agreed, studying him with a curious frown.\u003c/p\u003e\n\u003cp\u003e\"Will you two stay with her… go with her over to Lafayette?\" he asked Patricia and Nathan.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s broad daylight—there are tourists everywhere,\" Nikki said. \"And there are cops all over the city, too—didn\u0027t you hear what Madame just said?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be happy to hang around with Nikki and get her over to Lafayette,\" Patricia said.\u003c/p\u003e\n\u003cp\u003e\"Sure… we can even hang around and help with the tour, if you want,\" Nathan said.\u003c/p\u003e\n\u003cp\u003e\"Please,\" Nikki protested. \"I repeat—it\u0027s broad daylight, there are cops roaming the city as thick as flies.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, that\u0027s great. You all stick together,\" Brent said as if she hadn\u0027t spoken, rising.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need anyone,\" Nikki insisted.\u003c/p\u003e\n\u003cp\u003e\"We all need someone,\" Brent said wryly. \"Nikki, please, your friends want to hang with you. Let them,\" he said.\u003c/p\u003e\n\u003cp\u003eShe threw up her hands.\u003c/p\u003e\n\u003cp\u003e\"Hey, let\u0027s wander over to Contessa Moodoo\u0027s Hoodoo Voodoo shop, huh?\" Patricia suggested.\u003c/p\u003e\n\u003cp\u003e\"For what?\" Nikki demanded. She didn\u0027t want to say, certainly not when they were all behaving this way to begin with, that she was uneasy, that she had been there with Andrea not long before she had been murdered.\u003c/p\u003e\n\u003cp\u003e\"Oh, I don\u0027t know. Maybe you should buy some chicken feet, dance around, raise a little ruckus,\" Julian told her. \"I thought you liked the place.\"\u003c/p\u003e\n\u003cp\u003e\"Go with her,\" Brent said firmly to Nikki. Something was bothering her. Being with her friends? He doubted that. Going to a voodoo shop?\u003c/p\u003e\n\u003cp\u003eShe offered him a smile, aware that he wouldn\u0027t go if he wasn\u0027t feeling secure about her. \"If you\u0027ve never been there, I\u0027ll have to take you some time,\" she told Brent.\u003c/p\u003e\n\u003cp\u003eHe smiled and nodded. He knew the place. The woman had been around a long time.\u003c/p\u003e\n\u003cp\u003eCertain that Nikki wouldn\u0027t be alone, Brent turned and left them on the terrace, hurrying toward Royal Street, anxious by then about what Massey wanted.\u003c/p\u003e\n\u003cp\u003eWhen he arrived, Massey was waiting for him alone in his cruiser. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-31.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
