{"id":88083,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNikki nodded uncomfortably, swallowed and looked away. Her arms were crossed over her chest. \"When she died… is that when you began to… see ghosts?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"No. I\u0027ve seen them from the time I was a child. When my parents died.\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened. \"When your parents died?\" she repeated.\u003c/p\u003e\n\u003cp\u003eHe knew, of course. Nikki hadn\u0027t realized all these years that she\u0027d had the same sense. She\u0027d recognized only shadows, only the feel of what had been. But for her, it had been the same. The extra ability had been hers for many years.\u003c/p\u003e\n\u003cp\u003eIt had only been since Andy died that Nikki had come to realize just what she was capable of seeing, hearing, feeling.\u003c/p\u003e\n\u003cp\u003eHe smiled, tilting his head to the side. \"Hey, I think we\u0027re supposed to be doing a tour.\"\u003c/p\u003e\n\u003cp\u003e\"Um, yeah. You\u0027re all right?\" she asked him.\u003c/p\u003e\n\u003cp\u003e\"I am. You can read the stone. Tania died a long time ago. How about you?\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" she told him.\u003c/p\u003e\n\u003cp\u003eStill, he thought there was something a little strange about the way she said it. \"You saw Andy again?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"I really haven\u0027t seen her. But maybe she\u0027ll show up again this afternoon.\" Nikki shrugged. \"I guess this is kind of… her place.\"\u003c/p\u003e\n\u003cp\u003eBut Andy didn\u0027t show up that afternoon.\u003c/p\u003e\n\u003cp\u003eThe tour went off like clockwork, which felt strange to Nikki, since she had been so unnerved ever since leaving the voodoo shop.\u003c/p\u003e\n\u003cp\u003eShe had been determined that she wasn\u0027t going to say a word to anyone about the strange comments Contessa had made to her. After all, Julian already had her going to a shrink. And there were voodoo queens throughout the city. There was no reason to take Contessa seriously.\u003c/p\u003e\n\u003cp\u003eExcept that Contessa had also seen something strange surrounding Andy. And it had been evident that day.\u003c/p\u003e\n\u003cp\u003eStill, she had been determined not to say anything to anyone. Including Brent. And she had made that decision before she found him so deep in thought before his wife\u0027s tomb that he hadn\u0027t even noticed her at first.\u003c/p\u003e\n\u003cp\u003eAs the tour ended uneventfully, they decided that Brent would give the night tour with Mitch as his backup, giving Julian the night off.\u003c/p\u003e\n\u003cp\u003e\"I can do the tour tonight, but I might not always be available,\" Brent warned them.\u003c/p\u003e\n\u003cp\u003eNathan stared at him suspiciously. \"Pressing business?\" he demanded.\u003c/p\u003e\n\u003cp\u003e\"Sometimes.\" Brent cast Nathan a cool stare, and Nathan looked uneasily away.\u003c/p\u003e\n\u003cp\u003e\"Fine. Just fill in tonight. Patricia and I need a night off. And Julian does, too.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, time for the new love in his life,\" Patricia teased.\u003c/p\u003e\n\u003cp\u003eBack in the Vieux Carré, Mitch asked Brent and Nikki if they minded him tagging along for dinner, and Brent assured him that he didn\u0027t. Nikki was glad of the company, feeling suddenly shy around Brent, though she wasn\u0027t certain why. He hadn\u0027t lied to her; he\u0027d never said he hadn\u0027t been married. She\u0027d just never thought he might be a widower. And having come upon him at the grave site, she felt slightly like an interloper.\u003c/p\u003e\n\u003cp\u003eThey chose an Italian restaurant. The food was good, the service even better, and it was a pleasant, casual evening.\u003c/p\u003e\n\u003cp\u003eAt one point Brent set a hand on Nikki\u0027s knee. She barely managed not to jump. When she looked at him, he smiled, and she realized that he had known she felt awkward and didn\u0027t want her to.\u003c/p\u003e\n\u003cp\u003eShe smiled back and curled her fingers around his hand, where it lay on her knee.\u003c/p\u003e\n\u003cp\u003eAs they sipped coffee, a shiver ripped through her;\u003c/p\u003e\n\u003cp\u003eContessa\u0027s words seemed to come back to haunt her. The same color that had surrounded Andy was now surrounding her. A deep purple. A warning, though Contessa hadn\u0027t exactly said so, of death.\u003c/p\u003e\n\u003cp\u003eShe told herself that she didn\u0027t believe in omens.\u003c/p\u003e\n\u003cp\u003eBut maybe she did. Andy was certainly dead.\u003c/p\u003e\n\u003cp\u003eShe glanced at Brent. He was watching her strangely, as if he was aware that something was going on in her mind. She forced a brighter smile. She wasn\u0027t going to tell him about Contessa\u0027s words at the voodoo shop. She wasn\u0027t going to be such a mouse.\u003c/p\u003e\n\u003cp\u003eIn fact, she was suddenly determined that she wasn\u0027t going to be afraid to see Andy anymore. She wanted to see Andy. She was going to find out what had happened, to make sure it didn\u0027t happen to her.\u003c/p\u003e\n\u003cp\u003eMitch yawned, stretched and sighed. \"I think I should have been rich. I like being a tour guide, but I think I could be happy just being rich. I\u0027d just sit on my porch and sip mint juleps all day.\"\u003c/p\u003e\n\u003cp\u003eNikki laughed. \"You told me once that you didn\u0027t care for mint juleps.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d get used to them,\" Mitch assured her.\u003c/p\u003e\n\u003cp\u003e\"But none of us is filthy rich,\" Nikki said. She frowned, looking at Brent. \"You\u0027re not filthy rich, are you?\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m definitely not, so let\u0027s head for Madame\u0027s and pick up our tour, huh?\" Nikki suggested.\u003c/p\u003e\n\u003cp\u003eThere was a huge crowd around Madame\u0027s when they arrived.\u003c/p\u003e\n\u003cp\u003e\"Is this all for us?\" Mitch murmured.\u003c/p\u003e\n\u003cp\u003e\"No,\" Brent said, his gaze directed through the glass panes in the front of the café. \"There\u0027s a politician inside.\"\u003c/p\u003e\n\u003cp\u003eNikki craned her neck and saw Billy Banks. Handsome and charming, seated at one of the inside tables, he appeared to be speaking with his public and signing autographs as he greeted voters.\u003c/p\u003e\n\u003cp\u003eMadame was behind the counter, looking flushed and pleased.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s young and passionate and energetic,\" Nikki mused. \"He may just make it.\"\u003c/p\u003e\n\u003cp\u003e\"What are his issues?\" Brent asked her.\u003c/p\u003e\n\u003cp\u003e\"Crime is his main issue. But then, it\u0027s Harold Grant\u0027s main issue, too. I don\u0027t know. I don\u0027t think Harold Grant has done such a bad job.\" She wrinkled her nose. \"I just think Billy Banks is kind of a funny name for a politician. Do you think I\u0027m holding that against him?\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re conservative by nature,\" Mitch said.\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I don\u0027t ever vote by party—I vote by what I believe. And I\u0027m not all that conservative. Madame must be in seventh heaven, though. Harold Grant was in here a while ago, and now Billy Banks. This is really becoming the in place.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" a voice said quietly.\u003c/p\u003e\n\u003cp\u003eNikki turned. A pretty woman with three teenage children and a skinny-legged man in shorts were at her side. \"This is where the tour meets, right?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely,\" Nikki said. \"We leave in—\" she glanced at her watch \"—ten minutes.\" She pointed to Mitch. \"There\u0027s your moneyman, Mitch. The other gentleman is Brent Blackhawk. He\u0027ll be leading the tour. Go ahead and ask him questions now, if you like.\" She arched a brow and offered a wry grin to the men, indicating that she was only along for the ride. It was their tour.\u003c/p\u003e\n\u003cp\u003eWhile the tour-takers began to surround Brent and Mitch, Nikki found herself looking into the coffee shop. Madame had come out from behind the counter. Wiping her hands on her apron, she was standing in front of Billy Banks, flushing, smiling, pleased, as she got him to sign one of her menus.\u003c/p\u003e\n\u003cp\u003e\"Hey!\"\u003c/p\u003e\n\u003cp\u003eNikki turned. Mitch gave her a \"we\u0027re going that-away\" sign with his forefinger. She nodded and waited for the last of the group—a sizable one that night—as they moved forward.\u003c/p\u003e\n\u003cp\u003eFrom a distance, she watched Brent and felt a sweet warmth inside. He was damn good.\u003c/p\u003e\n\u003cp\u003eHe seemed to honestly like people, and he enjoyed answering questions. His voice was deep and rich, his smile quick. She liked everything about him.\u003c/p\u003e\n\u003cp\u003eMaybe too much.\u003c/p\u003e\n\u003cp\u003eThey stopped on a corner of Royal Street where there was an antique shop. He told a story about a Civil War soldier that she\u0027d never heard before.\u003c/p\u003e\n\u003cp\u003eShe wondered if he\u0027d learned the story from the soldier himself.\u003c/p\u003e\n\u003cp\u003eA block later she was leaning against the wall, idly listening to a story about Andrew Jackson, when she stiffened.\u003c/p\u003e\n\u003cp\u003eWhat had caught her attention earlier was the bum. The bum who was really a government agent. Tom Garfield.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t recognized him because he was dressed in a handsome suit. Shaven. Hair trimmed. Clean and handsome.\u003c/p\u003e\n\u003cp\u003eAnd she was seeing him again.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t next to her. He wasn\u0027t even looking at her. He was in the midst of the crowd, apparently deeply intent on the story as he listened to Brent. Nikki moved away from the wall.\u003c/p\u003e\n\u003cp\u003eFor some reason this man apparently trusted her. And Brent was desperate to get to him.\u003c/p\u003e\n\u003cp\u003eBut they were in the middle of the tour. She could hardly just shout out, \"Ghost! Ghost of the FBI guy, right in the crowd.\"\u003c/p\u003e\n\u003cp\u003eShe had to reach the man herself, actually talk to him.\u003c/p\u003e\n\u003cp\u003eAs she hesitated, still half-frozen, the story ended and the crowd began to move.\u003c/p\u003e\n\u003cp\u003eNikki walked as quickly as she could, threading her way toward him.\u003c/p\u003e\n\u003cp\u003eBut just as she neared the ghost, he looked to the right and frowned.\u003c/p\u003e\n\u003cp\u003eThen, instead of following the crowd, he ducked into a little alleyway in the middle of the block, which was partly residential, filled with courtyard homes, B \u0026amp; Bs and a few businesses.\u003c/p\u003e\n\u003cp\u003eNikki almost ran, but by the time she reached the dark walkway, the man had disappeared.\u003c/p\u003e\n\u003cp\u003e\"Damn,\" she swore.\u003c/p\u003e\n\u003cp\u003eShe jogged about twenty feet down the shadowed trail.\u003c/p\u003e\n\u003cp\u003e\"Sir? Mr. Garfield? Oh, please. Where are you? Help me now, please. I can help you, too. Please, I know you\u0027re here, I saw you. Please, don\u0027t take off on me.\"\u003c/p\u003e\n\u003cp\u003eWhere to go?\u003c/p\u003e\n\u003cp\u003eThere was a brick wall to her left, the backside of someone\u0027s courtyard. There were garbage cans, a gravel parking area and the sounds of jazz coming from her right. A few steps farther and she reached a low red brick property divider. There was the slight scent of restaurant refuse from the opposite side.\u003c/p\u003e\n\u003cp\u003e\"Mr. Garfield?\"\u003c/p\u003e\n\u003cp\u003eShe felt the rush of wind before she heard the footsteps pounding up behind her. She spun around in a split second, in time to see the figure rushing at her, but not much more.\u003c/p\u003e\n\u003cp\u003eHe was wearing a ski mask and gloves. In the heat of New Orleans.\u003c/p\u003e\n\u003cp\u003eShe screamed, loud and shrill. In an instant she realized that he intended to silence her with a black sheet or sack of some kind.\u003c/p\u003e\n\u003cp\u003eBefore he could reach her, she kicked out for all she was worth. Her purse tended to be heavy, and she swung it at the same time. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-34.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
