{"id":88091,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMax, apparently oblivious to Brent\u0027s assessment, glanced at his watch. \"Hell, not coffee. It\u0027s well past cocktail hour. Let\u0027s have a drink. On me. I\u0027ve got my car, so we\u0027ll head back into the Quarter, if that\u0027s all right with you two?\"\u003c/p\u003e\n\u003cp\u003eNikki shrugged, frowning as she watched Brent. She seemed concerned, he thought, shrugging as he looked back at her. \"Fine with me,\" he said.\u003c/p\u003e\n\u003cp\u003eMax started walking; Nikki did the same.\u003c/p\u003e\n\u003cp\u003eBrent held back for a few seconds. He touched the tomb, feeling that little stir of pain and nostalgia.\u003c/p\u003e\n\u003cp\u003eAnd he noticed the flowers that someone had brought. Nikki?\u003c/p\u003e\n\u003cp\u003e\"Brent?\" Nikki had turned back.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"I\u0027m with you. Right with you.\"\u003c/p\u003e\n\u003cp\u003eMax\u0027s car was a Lexus. The inside was clean—a surprise, since the outside of the car looked as if he had been driving through a swamp.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Max apologized. \"I had her down to the bayou country. I was meeting with some shrimpers.\"\u003c/p\u003e\n\u003cp\u003eNikki laughed. \"Max, it looks as if you took the car straight into the bayou.\"\u003c/p\u003e\n\u003cp\u003eNikki sat in front; Brent in the rear. Max was a good driver. He dexterously made a U-turn to head back to the Vieux Carré.\u003c/p\u003e\n\u003cp\u003eHe caught Brent\u0027s eyes in the rearview mirror. \"The shrimpers are having a rough time. They need legislation to stay afloat. We\u0027re shipping in foreign-caught, frozen shrimp, and families that have been in the industry for years are going to go down if new laws aren\u0027t passed. And the thing is, fresh shrimp, caught in our own waters, taste better. That\u0027s why you get some of the finest seafood you\u0027ll ever have right here in New Orleans. The thing is, I think folks would be furious about what\u0027s going on and they\u0027d change things themselves if they were a bit more educated. If restaurants had to tell them where their seafood came from.\"\u003c/p\u003e\n\u003cp\u003e\"Max, I thought you were in Colorado,\" Nikki said, mystified. \"Don\u0027t get me wrong. I\u0027m delighted that you\u0027re fighting for the shrimpers.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the deal with the politicians?\" Brent asked.\u003c/p\u003e\n\u003cp\u003eMax flashed him a rueful smile. \"They all lie?\" he suggested, then shrugged. \"Who really knows? I\u0027ll say this, Harold Grant has done a lot of work for the industry, but… not enough. Billy Banks claims he\u0027s a powerhouse, and that things will get done when he\u0027s in office. Are you a local?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and no,\" Brent told him, leaning back. They had reached the Vieux Carré.\u003c/p\u003e\n\u003cp\u003e\"Oh my God!\" Nikki gasped suddenly.\u003c/p\u003e\n\u003cp\u003e\"What?\" both men asked.\u003c/p\u003e\n\u003cp\u003e\"I forgot Julian.\"\u003c/p\u003e\n\u003cp\u003e\"You forgot him?\"\u003c/p\u003e\n\u003cp\u003e\"He was in the cemetery with me for the tour,\" Nikki explained, pulling out her cell phone. Just as she did so, it rang.\u003c/p\u003e\n\u003cp\u003e\"Julian?\" Nikki said.\u003c/p\u003e\n\u003cp\u003eHe and Max could vaguely hear the agitated sound of Julian\u0027s voice. Then Nikki said, \"Okay, okay… okay… okay.\"\u003c/p\u003e\n\u003cp\u003eShe clicked the phone closed and looked at Max. \"Can we take a run back to the cemetery?\" she asked.\u003c/p\u003e\n\u003cp\u003eMax laughed, and turned the car around.\u003c/p\u003e\n\u003cp\u003e\"We have a meeting, a must-have meeting, because Max is back,\" she said.\u003c/p\u003e\n\u003cp\u003e\"We do?\" Max asked.\u003c/p\u003e\n\u003cp\u003eShe frowned at him. \"Please?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. I\u0027m a vicious boss, huh?\"\u003c/p\u003e\n\u003cp\u003e\"For today,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Are you two speaking another language?\" Brent asked.\u003c/p\u003e\n\u003cp\u003eNikki turned, grinning. \"Julian got himself too entangled too quickly. His sudden roommate found him in the cemetery. He told her that he has an important meeting.\"\u003c/p\u003e\n\u003cp\u003e\"Ah,\" Brent murmured.\u003c/p\u003e\n\u003cp\u003eJulian was waiting at the cemetery gates. Susan had her arm looped through his.\u003c/p\u003e\n\u003cp\u003eJulian quickly introduced her to Max and Brent. As soon as they reached her hotel, Julian saw her out, disentangled himself quickly, slipped in next to Brent again and said, \"Max, step on it.\"\u003c/p\u003e\n\u003cp\u003eMaking a tsking sound in his throat, Max did so.\u003c/p\u003e\n\u003cp\u003eJulian leaned back in the seat, closing his eyes. Then they flew open again. \"Nikki, how could you do that to me?\"\u003c/p\u003e\n\u003cp\u003e\"Julian, I didn\u0027t know where you were.\"\u003c/p\u003e\n\u003cp\u003e\"But you didn\u0027t look for me.\"\u003c/p\u003e\n\u003cp\u003e\"Honestly, Julian, I\u0027m so sorry. Max showed up, and then Brent came and nearly decked Max, and—\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Julian said, puzzled.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know who he was,\" Brent explained. \"I thought he was hitting on Nikki.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t almost decked,\" Max protested.\u003c/p\u003e\n\u003cp\u003e\"I tackled him,\" Brent said diplomatically. \"He was with Nikki, and after what\u0027s been happening, I just jumped to conclusions.\"\u003c/p\u003e\n\u003cp\u003eMax shook his head. \"Nikki is probably more at home in any of these cemeteries than anyone I know. If she thought she was in danger, she\u0027d know just where to go. She knows which crypts have been abandoned. I bet she could hide out in any one of our cemeteries for a week and not be found. I\u0027ve been around with her. I know a few of her little secret spots.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you\u0027re right—unless Nikki didn\u0027t know she should be hiding,\" Brent said.\u003c/p\u003e\n\u003cp\u003e\"Where are we heading?\" Julian asked Max.\u003c/p\u003e\n\u003cp\u003e\"Wait a minute,\" Nikki interjected suddenly, glaring at Max. \"You were in the bayou country, not far away, and you didn\u0027t come to Andy\u0027s funeral?\"\u003c/p\u003e\n\u003cp\u003eMax shot her a quick glance. \"Nikki, I\u0027d only met her twice. And I was out on a shrimp boat.\"\u003c/p\u003e\n\u003cp\u003e\"You were on a shrimp boat?\" Julian demanded, stunned.\u003c/p\u003e\n\u003cp\u003e\"Max, you were her boss,\" Nikki said, aggravated.\u003c/p\u003e\n\u003cp\u003e\"Nikki, I gave you credit. You hired her.\" He hesitated for a minute. \"You said she was clean.\"\u003c/p\u003e\n\u003cp\u003e\"She was.\"\u003c/p\u003e\n\u003cp\u003eMax let out a sigh. \"Oh, Nikki… one of your greatest virtues is your belief in people. Your insistence that the rest of the world is open and honest and good.\"\u003c/p\u003e\n\u003cp\u003e\"Max, I\u0027m not a blind idiot,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Max,\" Brent interjected evenly, \"even the police feel that Andy might well have been helped into the grave.\"\u003c/p\u003e\n\u003cp\u003eMax gave Brent a startled glance in the rearview mirror. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because of another similar death,\" Brent said. \"Even if you were in the bayou country you must have heard the news. An FBI agent named Tom Garfield—a man who was definitely as clean as a whistle—was found with enough heroin in his veins to kill an elephant.\"\u003c/p\u003e\n\u003cp\u003e\"What would Andy have had to do with an FBI agent?\" Max demanded, scowling.\u003c/p\u003e\n\u003cp\u003e\"We met him at Madame\u0027s,\" Nikki explained. \"Well, we didn\u0027t exactly meet him—we ran into him. I thought that he was a bum.\"\u003c/p\u003e\n\u003cp\u003e\"She gave him a twenty,\" Julian said.\u003c/p\u003e\n\u003cp\u003e\"Nikki, I\u0027m sorry,\" Max said. \"To tell you the truth, I was aggravated with you. I thought you made me hire a woman who ended up causing major problems.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure she\u0027s sorry that her death inconvenienced you,\" Nikki said sharply.\u003c/p\u003e\n\u003cp\u003eMax let out a sigh. \"I didn\u0027t mean it that way.\"\u003c/p\u003e\n\u003cp\u003eThe tension in the car was thick, worrying Brent. He was supposed to meet Massey outside St. Louis Number 1 later, and he really didn\u0027t want Nikki with him.\u003c/p\u003e\n\u003cp\u003eBut he wasn\u0027t sure he wanted to leave her with either of the men in the car.\u003c/p\u003e\n\u003cp\u003e\"So,\" Julian grumbled, \"where are we going? Max, are you buying your hardworking employees a drink?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. I\u0027ll park at the office, and we\u0027ll walk over to that French place on Canal.\"\u003c/p\u003e\n\u003cp\u003eBrent glanced at his watch. It was after five o\u0027clock.\u003c/p\u003e\n\u003cp\u003eAs Max pulled into a spot in a narrow alley next to a door that advertised \"Legends and Myths of New Orleans,\" Brent realized that he\u0027d yet to see the office. The guides pretty much never used it, he realized, because they met one another and their groups at Madame\u0027s.\u003c/p\u003e\n\u003cp\u003e\"When\u0027s the last time you were in here?\" Max asked Nikki.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. About two weeks ago, I think.\"\u003c/p\u003e\n\u003cp\u003e\"Then I guess I should check the mail,\" Max said.\u003c/p\u003e\n\u003cp\u003eHe parked the car, and as they all got out, he headed for the door with his keys out, calling over his shoulder, \"Just a second. I\u0027ll grab the mail, toss it in the car, and we\u0027ll be on our way.\"\u003c/p\u003e\n\u003cp\u003eHe opened the door and went in, turning on lights. \"I guess I should check the answering machine,\" Nikki said.\u003c/p\u003e\n\u003cp\u003eShe stepped past Max, who was busy picking up piles of mail from the floor where it had fallen in from the slot.\u003c/p\u003e\n\u003cp\u003eHovering near the door with Julian, Brent studied the office space. It was small and attractive. There was only one desk, and the walls were filled with prints by local artists. There was a comfortable-looking chesterfield sofa by the wall, and scattered chairs were casually set near the desk. There were several file cabinets, and a computer.\u003c/p\u003e\n\u003cp\u003eNikki hit a button on the machine and the message kicked in, Nikki\u0027s voice saying, \"Press one for a description of our tours. Press two for times… \"\u003c/p\u003e\n\u003cp\u003eHer disembodied voice went on to say that no reservations were required, that potential tour-takers should arrive at Madame\u0027s fifteen minutes before the tour, or, in the case of Lafayette Number 1, arrive at the cemetery fifteen minutes ahead of time.\u003c/p\u003e\n\u003cp\u003eNikki listened to the few messages, all of which had been forwarded to her cell phone, then reset the machine.\u003c/p\u003e\n\u003cp\u003eShe was disturbed, and trying not to look it, Brent thought.\u003c/p\u003e\n\u003cp\u003e\"Come on, Nikki. We\u0027re ready to go here,\" Max said.\u003c/p\u003e\n\u003cp\u003eShe nodded, and came out from behind the desk, smiling far too brightly.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t been in the office yet, I take it,\" Max said dryly to Brent. He glanced at Nikki. \"The government will be on my ass if we don\u0027t fill out those papers.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been busy, Max,\" she said. \"And with Andy… Besides, it\u0027s your company,\" she reminded him a little sharply.\u003c/p\u003e\n\u003cp\u003eMax only shrugged, looking at Brent. \"Tomorrow, if you like the job and plan on keeping it, you\u0027ll have to fill out some IRS forms.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure how long I\u0027ll really be hanging out in New Orleans.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Max inquired.\u003c/p\u003e\n\u003cp\u003eBrent shrugged. \"Let\u0027s see how it goes, all right?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-42.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
