{"id":88094,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Right,\" Julian called after him. He grimaced, looking at Nikki. \"Want another drink? Wait, you didn\u0027t actually have a first one. That was iced tea, right?\"\u003c/p\u003e\n\u003cp\u003eNikki slid off her stool. \"I have to get home, Julian.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming with you,\" he said firmly.\u003c/p\u003e\n\u003cp\u003e\"Julian, you don\u0027t have to come with me. Brent will be there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not letting you walk back alone.\"\u003c/p\u003e\n\u003cp\u003eShe sighed, growing nervous. She didn\u0027t want Julian with her tonight. Brent would probably be unhappy to see him. She was sure Brent didn\u0027t want to explain what they were up to.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, Julian, honestly. You\u0027ve been the best friend in the world. I appreciate everything you\u0027ve done.\"\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s why you have to be a friend back tonight,\" he told her. \"Nikki, I can\u0027t go back to my place. Please don\u0027t make me go back there.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a kid, Julian. Tell her how you feel. It\u0027s your place. You\u0027ve got to get her out of it.\"\u003c/p\u003e\n\u003cp\u003e\"All right, but I\u0027m still going to walk you home first.\"\u003c/p\u003e\n\u003cp\u003eWhen they reached her place, she opened the gate, and he followed her in. \"Hey… I can go hole up in the guest room. I\u0027m sure Brent isn\u0027t sleeping there.\"\u003c/p\u003e\n\u003cp\u003e\"Julian, go home. Explain nicely that you\u0027re just not ready for the kind of commitment she seems to need.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, but he still stood there at her front door. \"Julian? What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I just… I\u0027m not leaving until Brent shows up.\"\u003c/p\u003e\n\u003cp\u003eShe groaned and opened the door wide. \"Fine. Come on in.\"\u003c/p\u003e\n\u003cp\u003eNikki had a strange look when she opened her door again a few minutes later. Brent arched a brow, hoping that Andy Ciello, or her spirit, had stopped in once again.\u003c/p\u003e\n\u003cp\u003eBut Andy wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eInstead, he found someone very much alive.\u003c/p\u003e\n\u003cp\u003eJulian.\u003c/p\u003e\n\u003cp\u003e\"Julian didn\u0027t want me to be alone,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Thanks, Julian. But I\u0027m back,\" Brent said pointedly.\u003c/p\u003e\n\u003cp\u003eJulian stood up and looked at them both, suddenly serious as he stared at Brent. \"I don\u0027t know what you two are doing,\" he said flatly, \"but you\u0027re not doing it without me.\"\u003c/p\u003e\n\u003cp\u003eNikki laughed softly, and though she tried to speak teasingly, her nerves were apparent in her voice. \"Julian, I\u0027m sorry your love life is more than you could take, but mine is going great. I don\u0027t need a chaperone.\"\u003c/p\u003e\n\u003cp\u003e\"You two aren\u0027t headed out on a hot date,\" Julian said flatly, staring at Brent.\u003c/p\u003e\n\u003cp\u003eBrent crossed his arms over his chest, intrigued. Why the hell would Julian suddenly be so suspicious of their movements?\u003c/p\u003e\n\u003cp\u003e\"Nikki was behaving strangely at the cemetery this morning,\" Julian said. \"I don\u0027t know what she thinks she saw, but I watched her during the afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"You were sleeping all afternoon,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what you think. Nikki, I know you. I know you better than this guy,\" Julian argued.\u003c/p\u003e\n\u003cp\u003eBrent clenched his teeth. Time was ticking away. This was his chance to discover the truth about Julian.\u003c/p\u003e\n\u003cp\u003eBut at what cost?\u003c/p\u003e\n\u003cp\u003eMassey and Joulette would be there. Maybe he should take this opportunity to test the man.\u003c/p\u003e\n\u003cp\u003eHe lifted his hands. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Nikki demanded.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go. But get out of that shirt, Julian, into something black. When you\u0027re trying to meld with the dark, you need to wear dark clothing.\"\u003c/p\u003e\n\u003cp\u003eJulian seemed startled to have won so easily. He jumped up, stared at Brent, then headed for the stairs. He paused halfway up. \"Listen, you\u0027re not going to run out while I\u0027m changing… ?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Brent said.\u003c/p\u003e\n\u003cp\u003eWhen Julian had disappeared, Nikki stared at Brent, baffled. \"You\u0027re letting him come?\"\u003c/p\u003e\n\u003cp\u003e\"I think he\u0027s going to be at the cemetery whether we let him come with us or not.\"\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t trust him,\" Nikki reminded him. \"You don\u0027t trust anyone.\"\u003c/p\u003e\n\u003cp\u003e\"Like I said, I think he intends to go, with us or without us. If he\u0027s with us, we\u0027ll know where he is.\"\u003c/p\u003e\n\u003cp\u003e\"For our own safety, right?\" Nikki said a little tightly.\u003c/p\u003e\n\u003cp\u003e\"And his,\" Brent assured her.\u003c/p\u003e\n\u003cp\u003eJulian raced back down the stairs then, anxiously looking at them as if he was afraid they\u0027d been lying to him.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" Brent said.\u003c/p\u003e\n\u003cp\u003eThey saw to it that Nikki\u0027s door was locked, then started down the street. As they walked, Julian said, \"Shouldn\u0027t we be slinking along or something like that?\"\u003c/p\u003e\n\u003cp\u003eBrent stared at him, trying not to laugh; it had sounded like a serious question.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think we need to slink around on this part of Canal—there are a lot of people out.\"\u003c/p\u003e\n\u003cp\u003e\"Uh, right.\"\u003c/p\u003e\n\u003cp\u003eBut when they moved away from the center of activity in the Quarter, Brent did start to walk in the shadows, and when they neared the cemetery, he had them walk single file by the wall.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a good place to hop over,\" Julian whispered.\u003c/p\u003e\n\u003cp\u003e\"The gate will be opened,\" Brent said.\u003c/p\u003e\n\u003cp\u003e\"How do you know?\"\u003c/p\u003e\n\u003cp\u003e\"Just a feeling.\"\u003c/p\u003e\n\u003cp\u003eIt was open. Either someone had come before them, or Huey had managed to get the gate open. They slipped in. The graveyard was heavy with the sound of silence.\u003c/p\u003e\n\u003cp\u003eBrent inhaled.\u003c/p\u003e\n\u003cp\u003eClosed his eyes.\u003c/p\u003e\n\u003cp\u003eOpened them.\u003c/p\u003e\n\u003cp\u003eAnd Huey was there. \"Not yet. Maybe not at all, but not yet,\" the old haunt said softly.\u003c/p\u003e\n\u003cp\u003eBrent nodded, indicating that they needed to find hiding places. He knew a few, but he wasn\u0027t surprised when Nikki lifted a hand, pointing. They hurried past a society tomb and on to one with classic Greek columns and a wrought-iron gate.\u003c/p\u003e\n\u003cp\u003eThe gate was open, and they slipped inside.\u003c/p\u003e\n\u003cp\u003eCoffins lined the walls. Dust lay heavy on the concrete flooring. Broken stained-glass windows looked out onto the rest of the site. A slender thread of moonlight dusted the angels, cherubs, tombs and mausoleums beyond.\u003c/p\u003e\n\u003cp\u003e\"What now?\" Julian mouthed.\u003c/p\u003e\n\u003cp\u003e\"We wait,\" Brent said.\u003c/p\u003e\n\u003cp\u003eJulian nodded. He sat against one of the inner sarcophagi in the small space.\u003c/p\u003e\n\u003cp\u003eOutside, the heated earth met the cooler air of the night. A soft ground fog was swirling.\u003c/p\u003e\n\u003cp\u003eAs Brent stared through a ragged break in the once-beautiful glass, he saw forms of thicker mist moving within the fog.\u003c/p\u003e\n\u003cp\u003eAn eerie light drifted toward the mausoleum where they waited.\u003c/p\u003e\n\u003cp\u003eHe held his breath, praying that it would not disappear.\u003c/p\u003e\n\u003cp\u003eIt came closer, closer…\u003c/p\u003e\n\u003cp\u003eHe felt Nikki at his shoulder. He could hear the pounding of her heart. It was a drumbeat, loud and staccato.\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" she whispered.\u003c/p\u003e\n\u003cp\u003eAnd he knew. She didn\u0027t want to be afraid. She didn\u0027t want to fear the fog.\u003c/p\u003e\n\u003cp\u003eBut it was growing…\u003c/p\u003e\n\u003cp\u003eAnd a sense of cold was forming all around them.\u003c/p\u003e\n\u003cp\u003e\"Man, what the hell are we doing out here?\" Joulette demanded.\u003c/p\u003e\n\u003cp\u003eHe was in the passenger seat. Massey had driven.\u003c/p\u003e\n\u003cp\u003e\"Staring at a cemetery,\" Massey said.\u003c/p\u003e\n\u003cp\u003eJoulette looked at his watch. He shook his head, then sipped at the coffee in his hand. \"What the hell is wrong with us?\" he asked. \"Why don\u0027t we work normal hours?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re cops,\" Massey said.\u003c/p\u003e\n\u003cp\u003e\"Shit!\" Joulette said, straightening.\u003c/p\u003e\n\u003cp\u003e\"What? Where?\"\u003c/p\u003e\n\u003cp\u003eJoulette pointed with the hand that held his cup. And Massey saw that a figure, dark as the night, was moving along the fence.\u003c/p\u003e\n\u003cp\u003e\"Shit,\" Massey repeated.\u003c/p\u003e\n\u003cp\u003eHe started to get out of the car. As he opened the door, it slammed back at him. Stunned, he looked up.\u003c/p\u003e\n\u003cp\u003eThere was another figure in the night.\u003c/p\u003e\n\u003cp\u003eAnd that one was right at his window.\u003c/p\u003e\n\u003cp\u003eThe form began to materialize in front of the mausoleum. Julian, still seated against the tomb, suddenly seemed frozen there.\u003c/p\u003e\n\u003cp\u003e\"What… what… ?\" he whispered.\u003c/p\u003e\n\u003cp\u003eNikki ignored him. She touched Brent\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s him?\" Brent asked quietly.\u003c/p\u003e\n\u003cp\u003e\"I think,\" Nikki said.\u003c/p\u003e\n\u003cp\u003eThe terrible sense of cold was filling the tomb. Nikki felt it seeping down her spine. She closed her eyes for a moment, then turned.\u003c/p\u003e\n\u003cp\u003eAndy was with them.\u003c/p\u003e\n\u003cp\u003e\"Andy, we need you,\" she said, her voice light as the air.\u003c/p\u003e\n\u003cp\u003eBrent turned, too, looking at Andy. \"We need his help, too,\" Brent said. \"For justice. For him and for you.\"\u003c/p\u003e\n\u003cp\u003eAndy nodded, frowning. \"It\u0027s difficult… difficult to be here. I don\u0027t know why. But I\u0027ll try… I\u0027ll try.\"\u003c/p\u003e\n\u003cp\u003e\"His name is Tom Garfield,\" Brent reminded her. \"Tom Garfield. I need him. I need his help.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do what I can,\" Andy murmured.\u003c/p\u003e\n\u003cp\u003eJulian spoke up from his place against the tomb. Shivering, lips chattering, he said, \"You\u0027re both… you\u0027re both crazy. Talking to the air. Oh my God, it\u0027s cold in here. Cold, in New Orleans, at this time of year. It\u0027s the stone, of course… all the stone.\" There was no conviction in his voice.\u003c/p\u003e\n\u003cp\u003eAndy looked at Julian and shrugged. \"He\u0027s still a good guy,\" she murmured.\u003c/p\u003e\n\u003cp\u003eThen she walked out of the tomb, a moving trail of light, mist and cold. The somber spirit of Tom Garfield stood dead still, wary as ever as he watched Andy approach. But she reached him. And as her astral hand touched his shoulder, she spoke softly, men turned to face the mausoleum.\u003c/p\u003e\n\u003cp\u003e\"You go first. You\u0027re the one he\u0027s trying to reach,\" Brent said.\u003c/p\u003e\n\u003cp\u003e\"Crazy, both crazy,\" Julian said, shivering still.\u003c/p\u003e\n\u003cp\u003e\"Julian, you\u0027ve got to be quiet,\" Nikki said.\u003c/p\u003e\n\u003cp\u003e\"Maybe spending the night with that sexual barracuda would have been better,\" Julian said, arms clenched over his chest.\u003c/p\u003e\n\u003cp\u003e\"Julian,\" Brent said in a low voice, but sharply. Julian looked up at him. \"You\u0027ve got to shut up. The ghosts in this cemetery are not the danger.\"\u003c/p\u003e\n\u003cp\u003eJulian stared at him, nodded, and seemed to find some resolve. \"Right.\" He only mouthed the word.\u003c/p\u003e\n\u003cp\u003eNikki looked out. Tom Garfield was standing next to Andy, not moving, looking from her to the mausoleum. He seemed faint and pale at first, made of narrow light and nothing more. Then his form became more solid. At first his feet weren\u0027t there, and then, slowly, they were, and he appeared as much alive to Nikki as he had in the street, as he had every time she had seen him. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-45.html","bookId":2268,"creation":"Oct 5, 2019 5:26:23 PM","modification":"Oct 5, 2019 5:26:23 PM"}
