{"id":75472,"no":10,"title":"Page 10","content":"\u003cp\u003eThey had scraped by, living off her gran’s pension and a small trust fund her grandfather had set up for his wife. After her grandmother’s death just two months before, the balance of the fund had been spent on the funeral and Bronwyn had been forced to sell their small semi-detached house. Most of the money made from the sale had gone toward settling outstanding hospital bills, with barely enough left over for Bronwyn to pay the deposit on the tiny flat that she was now renting.\u003c/p\u003e\n\u003cp\u003eSo here she was, trying desperately to do well at her new job, but she couldn’t take her eyes off the man who had just walked into the restaurant. He was tall, blond, and beautiful, and he was absorbed in the conversation he was having with the lean, dark man beside him. The two men were as opposite as night and day. The blond was big and bulky, almost Nordic in appearance, while the dark one was lean and lithe, with a definite sexy Gallic look to him. They sat down at one of her tables and her mouth went dry. She hurried over, not wanting to keep such important-looking men waiting and thankfully stumbled only once along the way.\u003c/p\u003e\n\u003cp\u003e“Good morning . . . Uh, hello . . . How may I . . .” She blanked, having already stuffed up the perky greeting that had been drilled into her during training. The men were looking at her expectantly, and she faltered even more beneath the blond man’s icy stare. “Your order,” she concluded abruptly. “What is it, please?”\u003c/p\u003e\n\u003cp\u003eThe dark man’s eyebrows climbed in astonishment, but the blond remained impassive even though Bronwyn, for a fleeting moment, thought that she spotted amusement flashing in those seemingly cold eyes of his.\u003c/p\u003e\n\u003cp\u003e“Drinks,” she continued desperately. “You probably drink. So you probably want some, a lot, I mean . . .” She felt her face going blood red with embarrassment. The dark man was staring at her in complete amazement, with his jaw dropped practically to his chest. The other man though, his jaw was clenched; he looked like he was exerting enormous control over his emotions. She panicked. He was probably angry, probably used to vastly superior service from this restaurant. She floundered again . . . at a complete loss.\u003c/p\u003e\n\u003cp\u003e“You look thirsty,” she murmured, hoping to prompt them into saying something, anything. “And we have plenty of drinks.”\u003c/p\u003e\n\u003cp\u003e“What would you recommend?” the blond asked unexpectedly. His voice was warm and mellifluous and much gentler than she had expected. It seemed completely at odds with the craggy planes of his face, as well as with his tightly controlled expression. His voice flowed over her like warm honey, and she stood staring at him dreamily without being aware of it for the longest time.\u003c/p\u003e\n\u003cp\u003e“Miss?” the dark man prompted impatiently. “What do you recommend?”\u003c/p\u003e\n\u003cp\u003e“Uh”—she snapped out of her daze, embarrassingly aware that she had been caught staring at the blond. “Recommend?”\u003c/p\u003e\n\u003cp\u003e“Drinks,” the blond reminded gently.\u003c/p\u003e\n\u003cp\u003e“Yes of course . . .” She scanned her memory frantically. “Wine . . . we have wine, and of course we have . . . you might like it, because I quite like it, you see?” They didn’t seem to see. God, she was being such a socially awkward ditz. She wasn’t usually this bad.\u003c/p\u003e\n\u003cp\u003e“Like what?” the blond asked.\u003c/p\u003e\n\u003cp\u003e“The . . . um . . . the milkshake. Chocolate especially.” The dark man’s brows lowered in complete consternation; he really had the most expressive eyebrows.\u003c/p\u003e\n\u003cp\u003e“You recommend the . . .” He sounded like he was choking, and his face was going an unbecoming shade of red. “The milkshake?”\u003c/p\u003e\n\u003cp\u003e“I didn’t even know they had milkshakes here,” the blond said conversationally. “Did you, Pierre?” The other man, Pierre, seemed incapable of replying, and Bronwyn wished the ground would open up and swallow her, she was so humiliated. Milkshake? What was she thinking recommending the milkshake to a pair of men who had doubtless not had one since hitting puberty?\u003c/p\u003e\n\u003cp\u003e“We have other—” she began miserably but was interrupted by Jake, the manager. Sensing a problem, he had come over to intervene.\u003c/p\u003e\n\u003cp\u003e“Excuse me, is everything all right here?” he asked politely, sending a surreptitious glare toward the flustered Bronwyn. Bronwyn suspected that he knew she had lied about her previous experience, and it seemed that the owner had hired her against Jake’s advice. Now Jake seemed desperate for her to mess up so that he could have an excuse to fire her. She hung her head and waited miserably for the men to complain. The darker one, Pierre, opened his mouth to say something, but the blond forestalled him.\u003c/p\u003e\n\u003cp\u003e“No problem at all,” he murmured smoothly. “My colleague and I were just having some difficulty deciding what to order.” Jake had no option but to retreat, but not before sending a warning glare toward Bronwyn.\u003c/p\u003e\n\u003cp\u003e“Very well, Mr. Palmer.” He practically genuflected as he stepped back. “But if you need anything, please ask for Jake.”\u003c/p\u003e\n\u003cp\u003e“Now why would we do that when we already have an excellent server right here?” the blond, Mr. Palmer, asked smoothly before dismissing Jake with a casual flick of the hand. His colleague gaped at him in disbelief.\u003c/p\u003e\n\u003cp\u003e“Bryce . . .” Pierre started to say. His name was Bryce! He ignored his friend and refocused his beautiful ice-blue eyes on Bronwyn’s flushed face.\u003c/p\u003e\n\u003cp\u003e“Now where were we?” he asked mildly, his eyes running over her face intently. “Ah, yes . . . I think I’ll have the chocolate milkshake.”\u003c/p\u003e\n\u003cp\u003e“Uh . . .” She gaped at him stupidly. “Uh . . . what?”\u003c/p\u003e\n\u003cp\u003e“The milkshake, I’ll have that. Chocolate of course.” She nodded dazedly and scribbled down the order before reluctantly turning her attention to Pierre. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-husband-s-regret-unwanted-2/page-10.html","bookId":1837,"creation":"Oct 5, 2019 10:35:50 AM","modification":"Oct 5, 2019 10:35:50 AM"}
