{"id":75501,"no":39,"title":"Page 39","content":"\u003cp\u003e“. . . If she’s telling the truth about trying to call you, she may well be telling the truth about everything else, right?” He hid a wince as Lisa verbalized the words he had been unable to speak, and his eyes shut in horror at the mere idea of such an atrocity. God, how could he live with himself if his terrible treatment of her since her return had been unjustified? He met Rick’s gaze, wondering if the misery and overwhelming dread he felt were evident in his eyes.\u003c/p\u003e\n\u003cp\u003e“She also said that she wasn’t there when I had my accident. That she didn’t leave me to . . .” He couldn’t even bring himself to say it, realizing now how ridiculous it was to believe that his soft-hearted wife would ever leave him, or anyone else for that matter, injured and alone at the scene of an accident. He sat down on the closest chair with a thump, feeling bewildered and sick to his stomach.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” he groaned. “Oh my God! I was so determined to blame her for this, but what if I was wrong, Rick? Do you know what that means? The things she went through on her own . . . how she struggled to make a decent life for Kayla and herself. She nearly died having our baby, and I wasn’t there for her. Even if she’s lying about everything, there’s just no excuse for letting her go through all of that on her own!” His brother put a firm hand on his shoulder, forcing Bryce to look up to meet his gaze.\u003c/p\u003e\n\u003cp\u003e“Calm down, Bryce, you tried to find her, remember? Even believing what you did about her, you still tried your damnedest to find her. Let’s just figure out what the truth is before you start with the self-recriminations.”\u003c/p\u003e\n\u003cp\u003eBryce covered his face with his hands, not sure what to do next, feeling helpless and completely lost. It was a feeling he was all-too familiar with since losing his hearing, but it wasn’t a feeling he would ever learn to live with. He got up abruptly, his head swimming with chaotic thoughts, his objective clear.\u003c/p\u003e\n\u003cp\u003e“I have to talk with her.” His eyes blindly sought out his brother and sister-in-law. “I . . . excuse me.” He saw Rick start to sign something but Lisa reached out and stayed his brother’s hands before nodding encouragingly at Bryce.\u003c/p\u003e\n\u003cp\u003eShe was on the nursery floor, playing with an active Kayla, who looked refreshed after her afternoon nap. Bronwyn had her back to the door and didn’t see him at first. In fact, it was Kayla who alerted her to his presence. The little girl saw him hovering in the doorway, and her whole face lit up as she squealed excitedly.\u003c/p\u003e\n\u003cp\u003e“Daddy!” She toddled toward him, her chubby arms outstretched. Bryce smiled at the little girl as he swept her up into his arms, keeping his eyes on Bronwyn’s slender back, noting how it tensed, before she squared her shoulders and stood up to face him. Bryce was trying to handle the little girl’s effusive chatter and watch Bronwyn’s face at the same time. Eventually he gave up on trying to follow Kayla’s confusing baby talk and focused entirely on Bronwyn, nodding now and then to keep Kayla happy.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asked her quietly, noting the stubborn tilt of her jaw and the unshed tears in her luminous eyes. He felt like an absolute bastard driving her to the brink of tears . . . again!\u003c/p\u003e\n\u003cp\u003e“I’m fine.” She nodded, folding her arms defensively over her chest.\u003c/p\u003e\n\u003cp\u003e“I . . .” he began, but Kayla was bouncing up and down, demanding that he play horsey with her. He kissed the little girl, before going to the door and hollering for Rick, immediately quieting Kayla, who looked up at him uncertainly, wondering if her daddy was mad at her. Bryce grinned down at her reassuringly, making airplane noises and flying her around the room for a few moments, before Rick came panting up the stairs.\u003c/p\u003e\n\u003cp\u003e“What?” he asked urgently.\u003c/p\u003e\n\u003cp\u003e“Kayla . . .” Bryce planted an affectionate kiss on his daughter’s silky cheek. “This is your Uncle Rick!”\u003c/p\u003e\n\u003cp\u003e“Unca?” The girl wondered doubtfully.\u003c/p\u003e\n\u003cp\u003e“Yes and he likes to play horsey!” Rick, who had been grinning foolishly down at the little girl, abruptly stopped smiling and met his brother’s eyes in horror.\u003c/p\u003e\n\u003cp\u003e“Unca, horsey?” the little girl asked excitedly.\u003c/p\u003e\n\u003cp\u003e“You want to play horsey with Uncle Rick while Mummy and Daddy talk?” Bryce asked gently, knowing that she wouldn’t understand anything but “play horsey” and “Uncle Rick.”\u003c/p\u003e\n\u003cp\u003e“Uh, Bryce . . .” Rick began while back-pedaling frantically; he stopped abruptly when Kayla bestowed her most radiantly trusting smile on him and held out her arms.\u003c/p\u003e\n\u003cp\u003e“Horsey, Unca Wick?” she asked coyly, and Rick swallowed visibly before stepping forward and lifting the little girl from her father’s arms.\u003c/p\u003e\n\u003cp\u003e“What an accomplished little flirt you already are.” He chuckled before meeting Bryce’s eyes.\u003c/p\u003e\n\u003cp\u003e“You’re going to have your hands full with this one, in twelve or so years’ time, big brother.” Bryce grinned halfheartedly and shrugged.\u003c/p\u003e\n\u003cp\u003e“I’ll cross that bridge when I come to it. Please keep her busy, Rick. Bron and I need to—”\u003c/p\u003e\n\u003cp\u003e“Say no more,” Rick interrupted cheerfully while Kayla tugged at his hair and shirt, impatient to be off. “Come along, Kayla, let’s go and meet your cousin and your auntie Lisa. She loves to play horsey too!” He carried the friendly little girl, who seemed to have forgotten all about her parents at the prospect of playing with exciting new people, out of the room and left Bronwyn and Bryce to contemplate each other quietly for a few moments.\u003c/p\u003e\n\u003cp\u003e“What’s the problem this time, Bryce?” Bronwyn asked with what appeared to be sarcasm, if her face was any indication. “I’m so sorry I stormed out and ruined your perfect little party.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-husband-s-regret-unwanted-2/page-39.html","bookId":1837,"creation":"Oct 5, 2019 10:35:50 AM","modification":"Oct 5, 2019 10:35:50 AM"}
