{"id":75553,"no":91,"title":"Page 91","content":"\u003cp\u003e“You’re pregnant?” he said on a slow exhalation of breath, and Bronwyn nodded down at him with a grin. He felt his own lips stretching into a matching grin. They had suspected that she might be even though they’d only recently decided to try for a second child. Bronwyn had just taken on a partner at her veterinary clinic, precisely for this purpose, and Kayla had just started her second year at school. Their dramatic daughter had recently been making smart-arsed comments about not wanting to be an only child for the rest of her life. Especially since her cousin Rhys had recently acquired a baby sister and even little Lily De Lucci—whom Kayla seemed to consider both rival and friend—was a big sister twice over thanks to the twin girls her mother had given birth to a few years before. Hating to be left out of anything, Kayla had placed an order for a little brother because neither Rhys nor Lily had one.\u003c/p\u003e\n\u003cp\u003e“Oh my God.” Bryce leaped to his feet and swung Bronwyn up into a hug. “That’s fantastic news, sweetheart.” He dropped her back onto her feet and gave her a quick, concerned once-over. “What did the doctor say? Is everything okay?” he asked worriedly.\u003c/p\u003e\n\u003cp\u003eI’m healthy as a horse. Baby’s due in about seven months’ time. Just before Christmas.\u003c/p\u003e\n\u003cp\u003e“You always know just what to get us for Christmas,” he teased.\u003c/p\u003e\n\u003cp\u003e“I try my best.” She shrugged modestly.\u003c/p\u003e\n\u003cp\u003eGod, he loved her so much. They had remarried nearly five years ago, less than a month after his proposal. Their marriage, even now, was filled with surprise after surprise. He wanted to create amazing memories with spontaneous trips to Europe when she wasn’t busy with work, hot-air-balloon rides, flowers, jewelry, and toys for Kayla. And even more disastrous romantic meals that he had cooked himself. In the interests of self-preservation, Bronwyn had enrolled him in a Cordon Bleu cooking course. He’d had minimal success in the class. Now, instead of merely burning steaks, he burned things like glazed duck and stuffed pheasant. He pretended not to notice his wife and daughter’s exchanged grimaces when they knew that he would be cooking dinner. He was damned determined to conquer the cooking thing. He couldn’t imagine not succeeding at it . . . okay, so it was taking him a little longer than he’d anticipated—years really—but he knew that he could do it.\u003c/p\u003e\n\u003cp\u003eBryce absolutely doted on his “girls” and loved spoiling them, and Bronwyn had stopped protesting at the extravagance when she had seen how much pleasure he got out of his surprises. He couldn’t imagine his life without them and was grateful every day for the miracle that had been granted to an undeserving man like him.\u003c/p\u003e\n\u003cp\u003e“You’re amazing,” he murmured, sitting back down behind his desk and dragging her into his lap. He was well on his way to showing her just how amazing he thought she was when the study door was flung open unceremoniously, and their daughter dashed into the room. Oliver, their excitable and yappy little red miniature pinscher, followed her into the room. Kayla was still wearing her school uniform, and her braid was an unraveling mess that created a halo of escaped hair around her gamine little face.\u003c/p\u003e\n\u003cp\u003e“Guess what?” she asked breathlessly, so used to seeing her parents snuggling that she didn’t even pause on her way to his desk.\u003c/p\u003e\n\u003cp\u003e“What?” Bronwyn asked with a grin.\u003c/p\u003e\n\u003cp\u003e“Ms. Williams gave me two gold stars today!” the little girl boasted, practically bouncing up and down in excitement.\u003c/p\u003e\n\u003cp\u003e“She did?” Bronwyn smiled, signing at the same time so that Bryce could follow the conversation.\u003c/p\u003e\n\u003cp\u003e“That’s fantastic, munchkin,” Bryce said. He had his head on Bronwyn’s shoulder and one hand protectively tucked against her flat stomach. “What for?”\u003c/p\u003e\n\u003cp\u003eI got ten out of ten for my spelling and for my math, she signed a mile a minute, her little hands practically a blur.\u003c/p\u003e\n\u003cp\u003e“Wow, I think that calls for a celebration, don’t you?” he asked them indulgently, and Bronwyn nodded, knowing that he meant to celebrate more than Kayla’s gold stars. Naturally they wouldn’t tell Kayla about the baby for a while. She would be an unholy, impatient little terror if she found out and then had to wait months before the baby was born.\u003c/p\u003e\n\u003cp\u003e“It’s definitely cause for celebration,” Bronwyn agreed with a smile. “Kayla, go and have a bath and put on your prettiest dress, we’re going out to dinner.”\u003c/p\u003e\n\u003cp\u003e“Really?” Her beautiful blue eyes shone with pride and her parents nodded. She squealed in excitement and careened back out of the room with Oliver racing out after her.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Bryce whispered quietly, and Bronwyn craned her neck to meet his eyes.\u003c/p\u003e\n\u003cp\u003e“For?” she asked.\u003c/p\u003e\n\u003cp\u003e“Everything,” he said expansively before elaborating. “For the small, everyday things and the huge, life-altering things.” His eyes went misty, and he blinked in embarrassment. When he was able to see her face clearly again, she was smiling luminously. He watched her hands and her face as they spelled out her inevitable response, the one that never failed to bring a lump to his throat and tears to his eyes.\u003c/p\u003e\n\u003cp\u003eThere’s the man I married. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-husband-s-regret-unwanted-2/page-91.html","bookId":1837,"creation":"Oct 5, 2019 10:35:50 AM","modification":"Oct 5, 2019 10:35:50 AM"}
