{"id":104872,"no":36,"title":"Page 36","content":"\u003cp\u003eLetters?\u003c/p\u003e\n\u003cp\u003e“I’m not sure they’re for sale,” I said.\u003c/p\u003e\n\u003cp\u003e“They hold no value for you, Mr. McKenzie. You could not possibly decipher their meaning.”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know. I went to college, too.”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie, unlike our dear friend Heavenly, I am not ruled by avarice. I am prepared to be generous. I will give you a healthy share of the proceeds.”\u003c/p\u003e\n\u003cp\u003e“How healthy?”\u003c/p\u003e\n\u003cp\u003e“A third.”\u003c/p\u003e\n\u003cp\u003e“Heavenly offered me half this morning.”\u003c/p\u003e\n\u003cp\u003e“Half? From Heavenly? Surely you did not accept such an unlikely bargain.”\u003c/p\u003e\n\u003cp\u003e“I’m not saying I did, I’m not saying I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Speaking from experience, I can assure you that any contract with Ms. Petryk will be summarily nullified the moment she lays hands on the letters.”\u003c/p\u003e\n\u003cp\u003e“I don’t doubt it.”\u003c/p\u003e\n\u003cp\u003e‘Then, sir, you can do no better than by allying yourself with me.”\u003c/p\u003e\n\u003cp\u003e“There’s Ivy.”\u003c/p\u003e\n\u003cp\u003e“Ahh, yes, the lovely Ms. Flynn. I ask you, sir, what can she offer? Besides the obvious?”\u003c/p\u003e\n\u003cp\u003e“People keep insulting my friends. It’s beginning to annoy me.”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie, I will match Ms. Petryk’s offer. I will give you half of what we realize on Mr. Nash’s gold. However, whatever agreement you have with Ms. Flynn must be satisfied through your share. Now, sir, is that not equitable?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then let us discuss the letters.”\u003c/p\u003e\n\u003cp\u003e“Let’s.”\u003c/p\u003e\n\u003cp\u003e“Do you have them?”\u003c/p\u003e\n\u003cp\u003e“I can get them.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“When I’m ready.”\u003c/p\u003e\n\u003cp\u003e“There’s no time like the present.”\u003c/p\u003e\n\u003cp\u003e“How did you know to contact me? How did you know I have access to the letters?”\u003c/p\u003e\n\u003cp\u003e“I have my resources.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t care to elaborate?”\u003c/p\u003e\n\u003cp\u003e“Not at this time.”\u003c/p\u003e\n\u003cp\u003e“Do you think the contents of the letters will lead us to Jelly’s gold?”\u003c/p\u003e\n\u003cp\u003eWhitlow seemed surprised by the question. He leaned back in his chair and took the coffee mug in his outstretched hand. He turned the mug slowly on the tabletop until the handle had made three complete revolutions.\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie, who wrote the letters?” he asked.\u003c/p\u003e\n\u003cp\u003e“You tell me.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought,” Whitlow said. “You haven’t read them. You don’t possess them.”\u003c/p\u003e\n\u003cp\u003e“I said I could get them.”\u003c/p\u003e\n\u003cp\u003e“At the risk of being insulting, sir, I question your veracity.”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003e“It would seem I have committed the great sin—I have assumed too much. I had thought the late Mr. Berglund had shared the letters with you. I now believe that until I spoke so carelessly, you did not know they existed. So it goes.” Whitlow stood abruptly. “No, sir. I do not believe that we can continue doing business along these lines. If, however, you should indeed secure the letters in question, contact me.” He took a loose business card from his pocket and slid it across the table. “Until then, I bid you good morning.”\u003c/p\u003e\n\u003cp\u003eWhitlow turned and walked swiftly from the club. I didn’t know if he was angry or embarrassed. I read his card as he went. Boston Whitlow, with the words WRITER RESEARCHER printed in smaller letters beneath followed by phone numbers and an address.\u003c/p\u003e\n\u003cp\u003eJenness appeared next to the table. “He was kinda cute,” she said.\u003c/p\u003e\n\u003cp\u003e“I hadn’t noticed.”\u003c/p\u003e\n\u003cp\u003e“You don’t suppose he’s gay, do you?”\u003c/p\u003e\n\u003cp\u003e“What makes you ask that?”\u003c/p\u003e\n\u003cp\u003e“The way he dresses, the way he talks.”\u003c/p\u003e\n\u003cp\u003eI thought about his gun—an Undercoverette, for God’s sake—yet decided not to hold it against him. “I know a lot of guys who are gay,” I said. “Some dress well, some don’t; none of them speak like Whitlow.”\u003c/p\u003e\n\u003cp\u003e“Hmmm.”\u003c/p\u003e\n\u003cp\u003e“If you must know, he did ask if you were attached.”\u003c/p\u003e\n\u003cp\u003e“What did you tell him?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Nothing? Geez, McKenzie. A little help.”\u003c/p\u003e\n\u003cp\u003e“If I hear from him again, I’ll tell him you’re interested.”\u003c/p\u003e\n\u003cp\u003e“Maybe you shouldn’t.”\u003c/p\u003e\n\u003cp\u003e“Make up your mind.”\u003c/p\u003e\n\u003cp\u003e“He was a little odd. What do you think?”\u003c/p\u003e\n\u003cp\u003e“Hell, Jen, I don’t know. Maybe he’s from Canada.”\u003c/p\u003e\n\u003cp\u003eI pulled my cell phone from the pocket of my sports jacket while Jenness returned to the bar. We had come to an understanding. If Whitlow asked about her, I was to tell him that she’s interested. If not, then say nothing. I asked her if she wanted me to slip him a note, like in high school—Do you like Jenness? Circle one below: Yes No Maybe. She whacked the side of my head with a bar towel.\u003c/p\u003e\n\u003cp\u003eI found the appropriate number stored in my cell’s phone book and hit Send. A few moments later the call was answered.\u003c/p\u003e\n\u003cp\u003e“Lieutenant Dunston,” a voice said.\u003c/p\u003e\n\u003cp\u003e“Hey, Bobby, it’s me.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, you are such a jerk.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Sending Kelly Bressandes to my office. I’ve been up all night with this and you give me a pushy reporter. Because of your phone call, the woman thinks I’m holding you as a material witness in Berglund’s homicide and deliberately keeping you from speaking to the media. The more I say it’s not true, the more she refuses to believe me. Thanks, pal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-36.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
