{"id":104885,"no":49,"title":"Page 49","content":"\u003cp\u003e“Did you?”\u003c/p\u003e\n\u003cp\u003eHeavenly circled the table and sidled up to me. She rested her hands on the points of my shoulders. “I meant what I said yesterday morning. You and I. A fifty-fifty split.”\u003c/p\u003e\n\u003cp\u003e“Whitlow made the same offer.”\u003c/p\u003e\n\u003cp\u003e“You didn’t make a deal with him?”\u003c/p\u003e\n\u003cp\u003e“Nothing was decided either way.”\u003c/p\u003e\n\u003cp\u003e“You can’t trust him.”\u003c/p\u003e\n\u003cp\u003e“He said the same thing about you.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, I’m throwing myself on your mercy. I need your help. I need your protection. I’ll give you anything.”\u003c/p\u003e\n\u003cp\u003e“Anything?”\u003c/p\u003e\n\u003cp\u003eHeavenly took my face in her hands and kissed me hard on the mouth. While she kissed me her arms wrapped around my back and pulled me close, her body grooved to mine. My own hands rested on the lovely curve where her waist met her hips, and for a moment I was this close to doing something very dumb. Only the gods were kind to me. The doorbell rang. It rang more than once. I eased Heavenly away.\u003c/p\u003e\n\u003cp\u003e“You’re a helluva negotiator,” I told her.\u003c/p\u003e\n\u003cp\u003eThe doorbell rang again.\u003c/p\u003e\n\u003cp\u003e“Who is that?” she asked. There was a trill of anxiety in her voice.\u003c/p\u003e\n\u003cp\u003e“Wait here and I’ll see.”\u003c/p\u003e\n\u003cp\u003eHeavenly was sitting at the table and smiling when I returned with Boston Whitlow. With one look at him, the smile became faint, then confused, and finally vanished for good.\u003c/p\u003e\n\u003cp\u003e“Heavenly,” Whitlow said when he saw her. The word spilled from his mouth like a compliment. The expression on his own face was transformed from careful neutrality to joy to anger to bemusement.\u003c/p\u003e\n\u003cp\u003eShe rose quickly from the table. “What are you doing here?” she asked.\u003c/p\u003e\n\u003cp\u003eWhitlow waved a hand at her. “I’ve always liked that dress,” he said. “I remember when you wore it for me.”\u003c/p\u003e\n\u003cp\u003eHeavenly quickly buttoned five buttons, three at the bottom and two at the top. I can’t say what message she was sending to Whitlow. As for me, I turned my back so I could take a deep breath without either of them noticing.\u003c/p\u003e\n\u003cp\u003e“McKenzie, what is he doing here?” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“I thought it was time we all had a heart-to-heart.”\u003c/p\u003e\n\u003cp\u003e“My previous entreaties have nothing to do with Ms. Petryk,” Whitlow said.\u003c/p\u003e\n\u003cp\u003e“I have nothing to say to him,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“Not even to accuse each other of murder?” I asked.\u003c/p\u003e\n\u003cp\u003e“Boston, how could you?” Heavenly said. Her expression had become hard and unforgiving. She looked away from Whitlow, refusing to meet his eyes.\u003c/p\u003e\n\u003cp\u003e“Have you spoken to the police yet?” I asked.\u003c/p\u003e\n\u003cp\u003e“I have indeed,” Whitlow said. “It was a most disagreeable experience.”\u003c/p\u003e\n\u003cp\u003e“It usually is. Did they take your gun?”\u003c/p\u003e\n\u003cp\u003e“I volunteered to give it up for testing.”\u003c/p\u003e\n\u003cp\u003e“I bet you did,” I said. “What alibi did you give them?”\u003c/p\u003e\n\u003cp\u003eThey both continued to look everywhere except at each other, yet they seemed to drift closer until they were within hugging—or at least punching—distance. It was as if they had a compulsion to touch. I didn’t know anything about their previous relationship, but I would have wagered that they both missed it.\u003c/p\u003e\n\u003cp\u003e“I had none to offer,” Whitlow said. “I had been at home reading when the crime occurred.”\u003c/p\u003e\n\u003cp\u003e“Hmmph,” Heavenly snorted.\u003c/p\u003e\n\u003cp\u003e“Where were you when Berglund was killed?” I asked her.\u003c/p\u003e\n\u003cp\u003e“I was in bed.”\u003c/p\u003e\n\u003cp\u003e“Alone?” Whitlow asked.\u003c/p\u003e\n\u003cp\u003eShe stepped forward with her left foot, pushed off with her right, and swung her hand in a low arc toward Whitlow’s face—she looked a little like Josh Beckett pitching from the stretch. Whitlow blocked the blow with his wrist before it could land. Their faces were inches apart; their breath was coming much harder than their exertions justified.\u003c/p\u003e\n\u003cp\u003eI probably should have moved to intervene, but the drama was just too good. I wondered if I had time to make popcorn.\u003c/p\u003e\n\u003cp\u003e“Did you expect civility, Hep?” Whitlow said. His voice was low, hoarse. “You broke my heart.”\u003c/p\u003e\n\u003cp\u003eHeavenly lowered her hand to her side and stepped backward. Her blue eyes were bright and glistening. “You broke mine first,” she said. “Oh, McKenzie, why did you bring him here?”\u003c/p\u003e\n\u003cp\u003e“Sit down,” I said. “Both of you.”\u003c/p\u003e\n\u003cp\u003eHeavenly found a chair and sat at the table. Whitlow sat, too, across the table and two places down from her. They tried not to look at each other yet couldn’t help themselves.\u003c/p\u003e\n\u003cp\u003eI stood at the head of the table. “Let’s talk about the letters,” I said.\u003c/p\u003e\n\u003cp\u003e“What letters?” Heavenly asked.\u003c/p\u003e\n\u003cp\u003e“The letters that Whitlow here thinks Berglund found, the ones that he offered to buy from me for fifty percent of the gold.”\u003c/p\u003e\n\u003cp\u003e“Do you have them?” Heavenly asked. “If you have the letters, we can get the gold without Boston.”\u003c/p\u003e\n\u003cp\u003e“Don’t get so excited, Hep,” Whitlow said. “McKenzie doesn’t have the letters.”\u003c/p\u003e\n\u003cp\u003e“I can get them,” I said.\u003c/p\u003e\n\u003cp\u003eWhitlow didn’t buy the lie any more than he had before. “I don’t believe him,” he said. “Do you?”\u003c/p\u003e\n\u003cp\u003eFrom her expression, Heavenly wasn’t sure.\u003c/p\u003e\n\u003cp\u003e“Okay,” I said. “Let’s talk about Brent Messer.” I smiled at Heavenly. “That’s your cue.” \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-49.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
