{"id":104886,"no":50,"title":"Page 50","content":"\u003cp\u003e“I don’t know anything about him,” she said.\u003c/p\u003e\n\u003cp\u003e“So you said. I assumed you were lying.”\u003c/p\u003e\n\u003cp\u003e“Don’t talk to her like that,” Whitlow said. He impressed me by pushing his chair back so he could leap out of it at a moment’s notice.\u003c/p\u003e\n\u003cp\u003eWhat do we have here? my inner voice asked.\u003c/p\u003e\n\u003cp\u003e“Relax, kid,” I said.\u003c/p\u003e\n\u003cp\u003e“You offended the lady,” Whitlow told me.\u003c/p\u003e\n\u003cp\u003e“Did I? How ’bout it, Heavenly? Are you offended?”\u003c/p\u003e\n\u003cp\u003e“Why did you bring us here, McKenzie?” she asked.\u003c/p\u003e\n\u003cp\u003e“I had hoped to frighten you both into cooperating with me. I have information, but I don’t know what it means. You have both offered to partner with me in order to get the information, even agreeing to a fifty-fifty split. Except in both cases you insist I tell you what I know, yet you refuse to tell me what you know. Now, I can keep blindly moving forward on my own until I get it all figured out—and I’m willing to do that, make no mistake, lady and gentleman—but it seems like a lot of work to me. So now I’m willing to formally accept the offer of whichever one of you tells me the truth first. Or, if you prefer, we can all go in on this together, equal shares all around. Thirty-three and a third percent of eight million plus is more than enough for me. What do you say?”\u003c/p\u003e\n\u003cp\u003e“You say you brought us here to frighten us,” Whitlow said. “I’m not frightened.”\u003c/p\u003e\n\u003cp\u003e“McKenzie.” Heavenly’s voice was low, cautious. “Are you saying—did you kill Josh?”\u003c/p\u003e\n\u003cp\u003e“Don’t be ridiculous.”\u003c/p\u003e\n\u003cp\u003e“Then why should we be frightened?”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean that you should be scared of me. I wouldn’t harm a hair on your head.” I gestured toward Whitlow. “Yours, either. On the other hand, there’s the young man sitting in the Toyota Corolla across the street.”\u003c/p\u003e\n\u003cp\u003eBoth Heavenly and Whitlow turned in their seats and stared at the large bay window in the living room as if they were sure the car would burst through it at any moment. Whitlow was the first to move to the window, Heavenly following close behind. They peeked through an opening in the drapes as I had done earlier.\u003c/p\u003e\n\u003cp\u003e“Do you think it’s him?” Heavenly asked.\u003c/p\u003e\n\u003cp\u003e“Not him, but—he must be someone who’s employed by him.”\u003c/p\u003e\n\u003cp\u003e“Do you think he killed Josh?”\u003c/p\u003e\n\u003cp\u003e“Don’t you?” Whitlow pivoted away from the window to face me. “How could you put Hep in danger like this?”\u003c/p\u003e\n\u003cp\u003eHeavenly’s friends call her Hep, my inner voice reminded me. Unless he called her that out of habit, Whitlow is still her friend.\u003c/p\u003e\n\u003cp\u003e“Is she in danger?” I asked.\u003c/p\u003e\n\u003cp\u003eWhitlow didn’t reply.\u003c/p\u003e\n\u003cp\u003e“Are you in danger?” I asked Heavenly.\u003c/p\u003e\n\u003cp\u003eShe didn’t answer, either.\u003c/p\u003e\n\u003cp\u003e“Who is this guy? Who does he work for?”\u003c/p\u003e\n\u003cp\u003eSilence and blank stares.\u003c/p\u003e\n\u003cp\u003e“We were getting along so well, too. All right, you’re on your own.”\u003c/p\u003e\n\u003cp\u003eI left them both standing there and went into my kitchen. I pulled two Summit Ales from the refrigerator and headed for the front door.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” Whitlow asked.\u003c/p\u003e\n\u003cp\u003eI recited a song Bobby and Shelby Dunston’s daughters once sang to me while pitching Girl Scout cookies. “Make new friends but keep the old. One is silver and the other’s gold.” I waved the beer bottles at them. “You two can let yourselves out.”\u003c/p\u003e\n\u003cp\u003eI walked out of my house, across the porch, and over the lawn as if I owned the place. I was carrying a bottle in each hand so the driver of the Toyota wouldn’t worry that I was armed as I approached. Truthfully, Allen didn’t seem nervous. The driver’s side window was rolled down and he had propped his elbow on the door frame, his cheek resting against the knuckles of his hand. He could have been waiting for a light to change for all the emotion he displayed.\u003c/p\u003e\n\u003cp\u003eI stopped in front of the door. “Hey, Allen,” I said. I extended my hand, offering him one of the Summits. He took the bottle as if we were barbecuing in my backyard and read the label.\u003c/p\u003e\n\u003cp\u003e“Good stuff,” he said.\u003c/p\u003e\n\u003cp\u003e“I like it.” I twisted the cap off my bottle and took a sip.\u003c/p\u003e\n\u003cp\u003eHe did the same. “You know who I am,” he said.\u003c/p\u003e\n\u003cp\u003eI told him I’d known who he was since he started following me at Rickie’s two days ago. He didn’t seem impressed.\u003c/p\u003e\n\u003cp\u003e“You know, Allen, you’re on the St. Paul side of the street,” I said.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“This side of Hoyt Avenue is St. Paul. If I call the cops, the SPPD will be here in about two and a half minutes, three tops. The other side of the street, that’s Falcon Heights. They have a contract with the St. Anthony Police Department. I call them, they might take a minute or two longer.”\u003c/p\u003e\n\u003cp\u003e“What would they arrest me for?”\u003c/p\u003e\n\u003cp\u003eI pointed at the beer in his hand. “Open bottle.”\u003c/p\u003e\n\u003cp\u003eAllen thought that was pretty funny. When he stopped laughing, I said, “Who’s your boss?”\u003c/p\u003e\n\u003cp\u003e“Boss?”\u003c/p\u003e\n\u003cp\u003e“Yeah, okay. You’re not going to tell me. You’re a good kid.” \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-50.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
