{"id":104889,"no":53,"title":"Page 53","content":"\u003cp\u003e“Apparently not,” Heavenly agreed. “So, there we were, suddenly out of a job. Boston and I decided to keep digging. At first we thought there might be a magazine article in it, something about St. Paul’s most prominent families being involved with gangsters, that sort of thing. Eventually, our research led us to conclude that Nash hid his gold in St. Paul before he was killed and that it’s still here. We’ve been looking for it ever since.”\u003c/p\u003e\n\u003cp\u003e“Why did you and Boston break up? Was it really over shares?”\u003c/p\u003e\n\u003cp\u003e“He cheated on me.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding. Where did he find someone smarter and prettier than you?”\u003c/p\u003e\n\u003cp\u003e“Thank you, McKenzie.” Heavenly spoke in a hushed voice and shook her head from side to side. “I don’t know who he was spending time with. I blame myself.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“You said it earlier—I’m high maintenance.”\u003c/p\u003e\n\u003cp\u003e“So is a Ferrari, yet everybody wants one.”\u003c/p\u003e\n\u003cp\u003eThe laugh started low in her throat and increased in volume until it came out loud. “Thank you again, McKenzie,” she said and laughed some more. “Thank you for that.”\u003c/p\u003e\n\u003cp\u003e“How did you hook up with Berglund?”\u003c/p\u003e\n\u003cp\u003e“I knew him from school,” Heavenly said. “I knew he was a competent researcher, and I didn’t want to look for the gold alone. After Boston and I broke up—ahh, I don’t know what I was thinking. I guess I grabbed hold of Josh to prove to myself that I could, that I didn’t need Boston.”\u003c/p\u003e\n\u003cp\u003e“Only he cheated on you, too.”\u003c/p\u003e\n\u003cp\u003e“I know how to pick ’em, don’t I?” Heavenly said. “At least with Ivy Flynn—she’s your friend, but I can’t pretend to like her.”\u003c/p\u003e\n\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003e“At least Ivy—she’s really quite lovely, so I don’t feel like I’ve been traded in for an SUV or a station wagon or something. It makes a difference. Not a lot, but some.”\u003c/p\u003e\n\u003cp\u003eHeavenly drained her wineglass and filled it again with what was left in the bottle.\u003c/p\u003e\n\u003cp\u003e“What about the letters Whitlow referred to?” I asked.\u003c/p\u003e\n\u003cp\u003e“We’ve always maintained that the key to the gold would be found in letters or diaries or some other correspondence of someone close to the events. There is nothing else to go by, no one to interview, no official record. I want to believe that Josh found something. That’s why he was killed. How Whitlow would know about it, I can’t say. Maybe he’s just guessing, like the rest of us.”\u003c/p\u003e\n\u003cp\u003eHeavenly took another sip of wine. I waited until she was finished before I said, “The kid outside earlier. Allen Frans. Do you believe he works for Dahlin?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why would Dahlin care about Jelly’s gold?”\u003c/p\u003e\n\u003cp\u003e“I don’t know that he does. He already has so much money.”\u003c/p\u003e\n\u003cp\u003e“Some people can never have enough.”\u003c/p\u003e\n\u003cp\u003e“I guess. Only I think it’s more likely that he’s afraid that the true story of his origins will get out somehow.”\u003c/p\u003e\n\u003cp\u003e“Afraid enough to kill?”\u003c/p\u003e\n\u003cp\u003eHeavenly nodded. “I blamed Boston before, but I was just being pissy. I think Dahlin did it. Or had it done. He’s a proud man.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’ve met proud men before.”\u003c/p\u003e\n\u003cp\u003e“Are you going to talk to him?”\u003c/p\u003e\n\u003cp\u003e“I hope to,” I said. “If the kid doesn’t deliver my invitation, I’ll find a way to deliver it personally.”\u003c/p\u003e\n\u003cp\u003eHeavenly spoke in a hushed, timid voice. “If you do speak to him, will you tell him—McKenzie, tell him that we’re honoring his confidentiality agreement, Boston and I. We’re not trying to embarrass him. He doesn’t have to worry about us.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell him.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Heavenly slowly finished the last of her wine and then sighed dramatically. “Where does that leave us?”\u003c/p\u003e\n\u003cp\u003eI tried to keep it light—“In my kitchen,” I said—only Heavenly didn’t take it that way.\u003c/p\u003e\n\u003cp\u003e“In your kitchen, but not your bedroom,” she said.\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“You don’t like me, either.”\u003c/p\u003e\n\u003cp\u003e“Heavenly, I like you fine. Only if I cheated on Nina with you, how would I be different from the other guys you know?”\u003c/p\u003e\n\u003cp\u003eShe chuckled again. “Like I said, I really know how to pick ’em.”\u003c/p\u003e\n\u003cp\u003e“Want some fatherly advice?”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Don’t try so hard.”\u003c/p\u003e\n\u003cp\u003eShe moved close to me, reaching out with her arms until her hands circled my waist. “Maybe I should try harder,” she said.\u003c/p\u003e\n\u003cp\u003eI pulled her hands away. “Maybe it’s time for you to go.”\u003c/p\u003e\n\u003cp\u003eShe licked her lips. “Maybe I—”\u003c/p\u003e\n\u003cp\u003e“Stop it,” I said. I turned her toward the living room and gave her a gentle shove. “C’mon. Off with you.”\u003c/p\u003e\n\u003cp\u003e“You’re throwing me out? Again?”\u003c/p\u003e\n\u003cp\u003eHeavenly must have thought that was pretty funny because she laughed all the way to the front door, or possibly it was the several glasses of wine that I was hearing. “I can’t believe you’re turning me down,” she said. “Not many men have.”\u003c/p\u003e\n\u003cp\u003e“Is that right?”\u003c/p\u003e\n\u003cp\u003e“In fact, you’re the only one.”\u003c/p\u003e\n\u003cp\u003e“There’s a first time for everything.”\u003c/p\u003e\n\u003cp\u003e“Second. You’ve done it twice.”\u003c/p\u003e\n\u003cp\u003eI opened the door.\u003c/p\u003e\n\u003cp\u003e“McKenzie, I like you,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“So I’ve gathered.”\u003c/p\u003e\n\u003cp\u003e“No.” She held the door to keep me from closing it. Her face had become serious. She bit her lower lip before she spoke. “I mean it this time. I really like you. You’re a good man, and I haven’t met many good men. Or maybe I have and they stopped being good after meeting me. I don’t know. I do know that this girlfriend of yours, this Nina—she’s a lucky woman.” \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-53.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
