{"id":104909,"no":74,"title":"Page 74","content":"\u003cp\u003eI might have pressed the matter, except at that moment my cell phone rang. I glanced at the display and said, “Huh.”\u003c/p\u003e\n\u003cp\u003e“What?” Heavenly asked.\u003c/p\u003e\n\u003cp\u003e“My security service. Apparently someone has just broken into my house.”\u003c/p\u003e\n\u003cp\u003e“Your house? Maybe it’s the same men who came here.”\u003c/p\u003e\n\u003cp\u003eI flashed on an incident that took place when I was in college. Bobby Dunston and I had gone to an open house for a newly married couple that we knew; they had a twenty-four-gallon keg of beer on the back porch. During the evening, the cops arrived to investigate complaints of a wild party. All of the guests drifted to the front of the house and swore that the complaints were inaccurate, that the party was actually quite subdued. The cops went away, and we returned to the back porch to find that the keg had been stolen.\u003c/p\u003e\n\u003cp\u003e“Yeah, it could be the same men,” I said. “Only if they’re after the letters, they’re going to be disappointed.”\u003c/p\u003e\n\u003cp\u003e“Because you don’t have the letters,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“Actually, I do.”\u003c/p\u003e\n\u003cp\u003e“What? You said you didn’t have them. You lied to me.”\u003c/p\u003e\n\u003cp\u003e“I didn’t get the letters until last night—after you left Rickie’s.”\u003c/p\u003e\n\u003cp\u003e“Did you read them? Can they lead us to the gold? Where are they?\u003c/p\u003e\n\u003cp\u003eWhere are the letters now? Are they safe?”\u003c/p\u003e\n\u003cp\u003e“Don’t get so excited, Heavenly.”\u003c/p\u003e\n\u003cp\u003e“How can you be calm? Someone is trying to steal the letters.”\u003c/p\u003e\n\u003cp\u003e“The letters are not in my house.”\u003c/p\u003e\n\u003cp\u003e“Where are they?”\u003c/p\u003e\n\u003cp\u003e“Locked in the trunk of my car.”\u003c/p\u003e\n\u003cp\u003e“Why did you put them there?”\u003c/p\u003e\n\u003cp\u003eBecause I’m going to deliver them to Bobby Dunston before he becomes even more pissed off at me than he already is, my inner voice said.\u003c/p\u003e\n\u003cp\u003eFor Heavenly’s benefit, I held up the cell phone and said aloud, “It seemed like a good idea at the time.”\u003c/p\u003e\n\u003cp\u003eThere were enough St. Anthony police cars and private security company vehicles on Hoyt Avenue and in my driveway that I was forced to park a couple of houses down. About a dozen neighbors had gathered on the sidewalk in front of my house, some of them coming back from early morning jogs, others getting a late start to work. There wasn’t much to see—an officer from the SAPD and a couple of private security guards standing in the middle of my yard, talking it over. I joined my neighbors, yet they were so intent on the cops that they didn’t notice until I spoke in a loud voice.\u003c/p\u003e\n\u003cp\u003e“What did the sonuvabitch do this time?”\u003c/p\u003e\n\u003cp\u003eOver the years I’ve developed a kind of love-hate relationship with my neighbors. I think some of them secretly love that I’ve added a little excitement to the neighborhood and given them stories to tell. Yet most of them hate that I live there and have even gone so far as to get up a petition asking me to move. I can’t say that I blame them. Because of me there have been gunfights on Hoyt Avenue; people have been shot off of my front porch. Cops gathering on my doorstep—gee, that hasn’t happened since last September.\u003c/p\u003e\n\u003cp\u003eMy neighbors edged away as if they were afraid I might be contagious, and I crossed the lawn toward my house. One of the security guards moved to intercept me, and I had to identify myself. He escorted me to the front door. It opened just as we reached it, and two officers from the St. Anthony Police Department stepped outside. Each was holding on to one of the arms of a suspect, whose hands had been cuffed behind his back.\u003c/p\u003e\n\u003cp\u003eThe suspect was Allen J. Frans, Timothy Dahlin’s hired hand.\u003c/p\u003e\n\u003cp\u003eHe glared at me; his mouth was clenched so tightly I swear I could hear his teeth grinding.\u003c/p\u003e\n\u003cp\u003e“Tsk, tsk, tsk, tsk, tsk,” I clucked. Then I gave him my best Desi Arnaz—“Lucy, ju got some ’splainin’ to do.”\u003c/p\u003e\n\u003cp\u003eA third officer stepped out of the door. I recognized him, a sergeant named Martin Sigford. He recognized me.\u003c/p\u003e\n\u003cp\u003e“Hey, McKenzie,” he said. “Look what we found. Asshole tripped your alarm at 8:17 A.M. Seeing as how it was your place, we took our time, didn’t get here until 8:22—”\u003c/p\u003e\n\u003cp\u003e“We arrived moments later,” the security guard behind me said.\u003c/p\u003e\n\u003cp\u003e“I really appreciate how quickly you all responded,” I said just to be polite.\u003c/p\u003e\n\u003cp\u003e“Found dipshit here in your bedroom,” Sigford said. “So fucking busy going through your closet, he didn’t even know we were there until we drew down on him. He must really like those Armani suits of yours.”\u003c/p\u003e\n\u003cp\u003eThroughout it all, Allen stared straight ahead. If he blinked, I hadn’t noticed.\u003c/p\u003e\n\u003cp\u003e“You ever see him before?” Sigford asked.\u003c/p\u003e\n\u003cp\u003e“Can’t say that I have,” I said. “Why? Does he claim he knows me?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t claim anything. Has no ID on ’im.” Sigford gave Allen an idiot slap to the back of his head. “Says he won’t even tell us his name until he’s made his phone call.”\u003c/p\u003e\n\u003cp\u003e“Was he carrying?”\u003c/p\u003e\n\u003cp\u003eSigford held up a plastic evidence bag. Inside the bag was a silver-plated revolver.\u003c/p\u003e\n\u003cp\u003e“Man is caught by the police creeping a house while armed with a gun, what do they call that, Sarge?” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-74.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
