{"id":104912,"no":77,"title":"Page 77","content":"\u003cp\u003eBecause of my earlier visit, I knew exactly where Heavenly’s duplex was located. Instead of having to search for it on Fifth Street and maybe tip my hand to anyone who might be watching, I was able to park the Audi, cut through a few yards, and approach it from behind.\u003c/p\u003e\n\u003cp\u003eI was carrying a 9 mm Beretta in a holster on my right hip; I had retrieved it from the safe recessed into the floor of my basement and concealed it beneath a black sports jacket. It had been a pleasant morning, about sixty-five degrees—average for May—and I didn’t feel warm in the jacket until I was leaning against the white stucco wall on Heavenly’s side of the duplex. I wiped sweat off my hands before I pulled the Beretta and thumbed off the safety.\u003c/p\u003e\n\u003cp\u003eI remembered what I had told Ivy and Berglund back at Lori’s Coffeehouse. I’m not going to shoot anyone. Let’s be clear about that, kids. No guns. Yet there I was.\u003c/p\u003e\n\u003cp\u003eI began moving slowly along the wall; some of the white rubbed off onto the shoulder of my jacket, although I wouldn’t notice that until much later. There was a small window that revealed Heavenly’s empty kitchen. I ducked beneath it and slid forward, carrying the Beretta in a two-handed grip, until I reached two windows that faced the dining and living rooms. I looked quickly, then pulled my head back. There were two men, one standing at the front window near the door, watching the street. The second was standing in that space between the two rooms, watching his friend watch the street. Their backs were to the window, so I looked again.\u003c/p\u003e\n\u003cp\u003eThe first man seemed impatient, grunting at nearly every car that passed the duplex without slowing or stopping. He was holding a revolver—I couldn’t identify the make or model. He kept tapping the barrel against his thigh. The window was open, and I could hear him through the screen. “Where the hell is he?” he said. “You called him, right? You did call him?”\u003c/p\u003e\n\u003cp\u003eHe turned when he spoke, and I pulled my head away from the window. I recognized him instantly—Ted. He hadn’t changed much since I tried to frighten him at Rickie’s.\u003c/p\u003e\n\u003cp\u003e“I called him,” a female voice spoke urgently in reply. “You heard me call him.”\u003c/p\u003e\n\u003cp\u003eI took a chance and glanced through the screen again. Ted had returned to his vigil at the front window. I moved my gaze to the second man. He turned to his left and looked down. It was Wally. He also had a gun in his hand, probably his .38, I decided. He was looking down at the woman seated next to him.\u003c/p\u003e\n\u003cp\u003eHeavenly’s arms and legs had been bound to a wooden chair with duct tape. Her hair was artfully disheveled, and she had changed clothes since I saw her last and was now wearing a ruffled white top and a frilly white gauze skirt—the perfect outfit for a damsel in distress.\u003c/p\u003e\n\u003cp\u003e“It bothers me that McKenzie isn’t here,” Wally said. “Are you sure he’ll come?”\u003c/p\u003e\n\u003cp\u003e“How many times do I have to tell you?” Heavenly said. “He’ll be here. He can’t help himself. He’s a born hero.”\u003c/p\u003e\n\u003cp\u003e“Then where is he?”\u003c/p\u003e\n\u003cp\u003e“Would you relax? He’ll be here. Just remember, no one gets hurt.”\u003c/p\u003e\n\u003cp\u003e“Whaddaya mean?” Wally said. He pointed at his face. “He broke my nose. He’s going to pay for that.”\u003c/p\u003e\n\u003cp\u003e“No. Listen. Both of you. All we want is the letters. You pretend to threaten me. He gives you the letters. You leave. We meet up later. That’s the plan.”\u003c/p\u003e\n\u003cp\u003e“Na-uh.” Ted was shouting from the window. “Na-uh. So-and-so threatens us, pushes us around—he hurt Wally. No, we’re going to open up a can of whoop-ass on that boy.”\u003c/p\u003e\n\u003cp\u003eI almost laughed out loud when I heard that.\u003c/p\u003e\n\u003cp\u003e“Yeah, whoop-ass,” Wally said. “He broke my nose.”\u003c/p\u003e\n\u003cp\u003e“You’re behaving like children,” Heavenly said.\u003c/p\u003e\n\u003cp\u003eTed turned away from the window again. This time I didn’t bother to hide. I didn’t care if he saw me or not. Truth was, I came very close to just leaving the three of them there, maybe calling Heavenly in a couple of hours and asking her how things worked out, when something happened to make me think better of it.\u003c/p\u003e\n\u003cp\u003eTed walked slowly to Heavenly’s chair and leaned in. “You don’t think we can handle him, do you?” he said.\u003c/p\u003e\n\u003cp\u003e“It’s not necessary,” Heavenly said. “All we want is the letters.”\u003c/p\u003e\n\u003cp\u003e“You think he’ll open a can of whoop-ass on us.”\u003c/p\u003e\n\u003cp\u003e“If you push him, yes, I do. That’s not the point.”\u003c/p\u003e\n\u003cp\u003eTed made a fist and drove it hard into Heavenly’s mouth. Her head snapped back with the blow, then fell forward. She made a low, painful, guttural sound and rested her chin against her shoulder. Blood trickled from her mouth and stained her white shirt. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-77.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
