{"id":104913,"no":78,"title":"Page 78","content":"\u003cp\u003e“Whoa, Ted,” Wally said. “Whoa, whoa, whoa …”\u003c/p\u003e\n\u003cp\u003eTed stepped backward. “Ow,” he said, and shook his hand the way some people do when they hurt it. He then clenched it into a fist again and waved it in Heavenly’s face. “You deserve it. Do you hear me? I am so tired of you. Being insulted by you. Being used by you. You wave your backside in our faces and you think we’ll do whatever you ask, put up with whatever crap you give us. I got news. You ain’t that pretty.”\u003c/p\u003e\n\u003cp\u003e“Well,” said Wally.\u003c/p\u003e\n\u003cp\u003eTeddy shot him a glance that could have killed ducks in flight.\u003c/p\u003e\n\u003cp\u003e“No, no,” Wally said. “Not even a little bit.”\u003c/p\u003e\n\u003cp\u003eHeavenly raised her head. “Teddy,” she said.\u003c/p\u003e\n\u003cp\u003eHe responded by slapping her with the flat of his hand.\u003c/p\u003e\n\u003cp\u003e“Shut up,” he said. “You just, you just… You aren’t in charge anymore. We’re running things now.”\u003c/p\u003e\n\u003cp\u003eTed looked at Wally.\u003c/p\u003e\n\u003cp\u003eWally nodded. “Fuckin’ eh,” he said.\u003c/p\u003e\n\u003cp\u003e“We’re here for one thing,” Ted said. “The gold. Those letters you say McKenzie’s got, they better lead us to the gold. If they don’t”—Ted grabbed the lapel of Heavenly’s shirt—“we’ll just have to settle for something else.” He yanked hard. Material tore and buttons flew.\u003c/p\u003e\n\u003cp\u003e“Ted,” Wally said. There was a note of astonishment in his voice. “Really?”\u003c/p\u003e\n\u003cp\u003e“Don’t, don’t,” Heavenly said.\u003c/p\u003e\n\u003cp\u003eTed stepped back. He and Wally stared down at the helpless woman, at her white lace bra and milky skin, at the red scratch marks Ted had made above her breast.\u003c/p\u003e\n\u003cp\u003e“Don’t do this,” Heavenly said.\u003c/p\u003e\n\u003cp\u003eTed sighed deeply. I could hear him all the way across the room and through the window screen. He pointed at Heavenly. “Remember what I said,” he told her.\u003c/p\u003e\n\u003cp\u003e“Wally, Wally,” Heavenly chanted. “Talk to him. You have to make him understand what he’s doing.”\u003c/p\u003e\n\u003cp\u003e“Shut her up,” Ted said.\u003c/p\u003e\n\u003cp\u003e“How?” Wally asked.\u003c/p\u003e\n\u003cp\u003e“Use the tape.”\u003c/p\u003e\n\u003cp\u003eWally found the duct tape and peeled off six inches while Ted returned to his window.\u003c/p\u003e\n\u003cp\u003e“Wally, no,” Heavenly said. She rotated her head around, trying to stay out of his reach.\u003c/p\u003e\n\u003cp\u003e“C’mon,” Wally said. “Be still.” Finally, he grabbed a fistful of golden hair and held her motionless while he sealed her mouth. “There. Maybe now we’ll get some peace and quiet.”\u003c/p\u003e\n\u003cp\u003eTed chuckled from the window. After a moment he said, “Where the hell is McKenzie?”\u003c/p\u003e\n\u003cp\u003eWhere indeed.\u003c/p\u003e\n\u003cp\u003eLooks like Heavenly needs rescuing after all, my inner voice said.\u003c/p\u003e\n\u003cp\u003eI retreated to the back of the duplex. Heavenly hadn’t secured her screen door—another security breach to go along with the cheap lock on her interior door that I managed to loid in about ten seconds with a credit card. The door swung open silently, and I slid into the kitchen, my Beretta leading the way.\u003c/p\u003e\n\u003cp\u003eI waited for a few seconds, heard nothing, and eased to the arched doorway that led to the dining room. I poked my head past the opening and quickly pulled it back again. It was the same scene as before, Ted watching the traffic outside the front window, Wally watching Ted.\u003c/p\u003e\n\u003cp\u003eI brought the gun up in a two-handed grip until my knuckles were grazing my cheek and turned into the room. I came up swiftly and silently behind Ted, leveling the Beretta at the back of his head with both hands. He didn’t hear a thing until I said, “Hey.”\u003c/p\u003e\n\u003cp\u003eWally turned toward me as if it were the most natural thing in the world. I dropped my hands down and swung the Beretta up in an arc toward his face like a ballplayer swinging for the bleachers. I caught the base of his nose with the barrel of the gun and swung through. I heard cartilage crack as Wally’s head twisted, followed by the rest of his body. He fell as if he had leapt backward, diving into an end table, breaking the table and the lamp that stood on top of it, and rolling onto his side. He dropped his revolver and brought his hands up to cover his face. Blood spewed through his fingers.\u003c/p\u003e\n\u003cp\u003eI kicked the gun away and turned toward Ted. He was still standing at the window. The sounds of the table and lamp smashing and Wally’s moaning turned him around, but other than that, he hadn’t moved.\u003c/p\u003e\n\u003cp\u003eI went into a pyramid stance, feet about sixteen inches apart, knees slightly bent, both hands holding the Beretta directly in front of me, my arms forming a triangle with my chest, and set the sight on Ted’s face. The idea of blowing Ted’s head off appealed to me greatly, except out of the corner of my eye I could see Heavenly’s terrified eyes, and I could hear her screams, muffled by the duct tape. That influenced me enough to lower the sight until I was aiming the gun at Ted’s lower left side just above his hip. There were no major organs on that side of his body and no arteries to blow. Odds were good that if I shot him there, he wouldn’t die.\u003c/p\u003e\n\u003cp\u003eOnly I didn’t squeeze the trigger.\u003c/p\u003e\n\u003cp\u003e“Wally,” Ted said. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-78.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
