{"id":104916,"no":81,"title":"Page 81","content":"\u003cp\u003e“Oh, it gets better.”\u003c/p\u003e\n\u003cp\u003eI told him about Allen and the gun. Bobby said that he had already received a call from Sergeant Sigford.\u003c/p\u003e\n\u003cp\u003e“It’s the wrong caliber,” Bobby said. “Berglund was killed with a .25. Nice try, though.”\u003c/p\u003e\n\u003cp\u003e“Maybe you’ll have better luck with these,” I said. I gave him Ted and Wally’s guns and explained how I came to have them. Bobby examined each. Neither was a .25, but he slipped them into his jacket pockets just the same. He pressed his hand against the small of his back and spoke between clenched teeth.\u003c/p\u003e\n\u003cp\u003e“I don’t have a quarrel with either of them as long as they don’t shoot you in my jurisdiction,” he said.\u003c/p\u003e\n\u003cp\u003e“I don’t know what alibi they had for Berglund’s murder—”\u003c/p\u003e\n\u003cp\u003e“C’mon, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“But I think you’re obligated to check them out—”\u003c/p\u003e\n\u003cp\u003e“McKenzie—”\u003c/p\u003e\n\u003cp\u003e“Considering the trouble they went through to get the letters from me.”\u003c/p\u003e\n\u003cp\u003e“I know my job.”\u003c/p\u003e\n\u003cp\u003e“I know you do. I’m counting on it.”\u003c/p\u003e\n\u003cp\u003eBobby sighed deeply. “I appreciate what you’re trying to do, McKenzie,” he said. “Maybe I would do the same thing if I were in your position, but it won’t work. You have to know that.”\u003c/p\u003e\n\u003cp\u003e“You’re probably right,” I said.\u003c/p\u003e\n\u003cp\u003e“Is there anything else you feel compelled to tell me?”\u003c/p\u003e\n\u003cp\u003e“I expect that you’ll get another visit from Kelly Bressandes,” I said. “She’ll probably want to know why you’re granting favorable treatment to a prominent suspect in the killing of Berglund.”\u003c/p\u003e\n\u003cp\u003e“What prominent suspect?”\u003c/p\u003e\n\u003cp\u003e“Timothy Dahlin.”\u003c/p\u003e\n\u003cp\u003eBobby made a kind of moaning sound as he stretched the way he had the night Berglund was killed—I don’t know if it was me or his spine that troubled him.\u003c/p\u003e\n\u003cp\u003e“Did you hurt your back?” I asked.\u003c/p\u003e\n\u003cp\u003e“Just wrenched it a little bit playing soccer with the girls.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should see a therapist or chiropractor or something.”\u003c/p\u003e\n\u003cp\u003e“I’ll be fine.” ’Course, he said the same thing when we were kids and he broke his wrist diving for a line drive.\u003c/p\u003e\n\u003cp\u003e“I know a guy,” I said.\u003c/p\u003e\n\u003cp\u003e“I’m not surprised. Seriously, I’m all right.”\u003c/p\u003e\n\u003cp\u003eI stood in front of him, looking for an excuse not to do what I was about to do.\u003c/p\u003e\n\u003cp\u003e“Something else, McKenzie?”\u003c/p\u003e\n\u003cp\u003eYou ’re not a cop anymore, my inner voice reminded me.\u003c/p\u003e\n\u003cp\u003eBobby must have seen something in my eyes because he dropped his voice half a dozen octaves. “McKenzie?” he said.\u003c/p\u003e\n\u003cp\u003eYeah, you are.\u003c/p\u003e\n\u003cp\u003eI reached into my pocket and removed the apartment key that Boston Whitlow had given me the evening before. “I was saving the best for last,” I said.\u003c/p\u003e\n\u003cp\u003eBobby took the key from my outstretched hand as I explained how I got it, repeating everything that Whitlow had told me about him and Ivy.\u003c/p\u003e\n\u003cp\u003e“Damn, McKenzie,” he said. “That must hurt, giving her up like this.”\u003c/p\u003e\n\u003cp\u003e“I have to.”\u003c/p\u003e\n\u003cp\u003e“I know you do. You understand, I could bust you for obstruction, bust you for tampering with evidence.”\u003c/p\u003e\n\u003cp\u003e“Or you could say that I secured the evidence before Whitlow could destroy it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m sure that’s what you had in mind.” Bobby stretched his back again. When he finished, he tapped the carton of letters under his arm with the key. “I’m trying real hard not to be pissed off at you right now.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eHe waved his hand at me. “Go do what you think you have to do. Just don’t expect any favors.”\u003c/p\u003e\n\u003cp\u003eI turned and walked to my car.\u003c/p\u003e\n\u003cp\u003eIvy Flynn was smiling when she opened the door. The smile vanished when she saw the expression on my face. “McKenzie, what’s happened?” she said.\u003c/p\u003e\n\u003cp\u003e“I spoke to the police a little while ago.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003e“Ivy, I think you should sit down.”\u003c/p\u003e\n\u003cp\u003eIvy led me deeper into the apartment. She didn’t sit, so I didn’t, either.\u003c/p\u003e\n\u003cp\u003e“What’s this about, McKenzie?” she said.\u003c/p\u003e\n\u003cp\u003e“The clock is striking midnight, sweetie. It’s pumpkin time.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“You’re my friend and I care about you, but you killed Josh Berglund. You have to pay for that. I’ll help you; I’ve been helping you. I’ve done everything I could to protect you so the price won’t be too high. Only you killed him, so whatever it is, you have to pay it. There is no other way.”\u003c/p\u003e\n\u003cp\u003e“No, McKenzie. You’re wrong.”\u003c/p\u003e\n\u003cp\u003eI pulled G. K. Bonalay’s card out of my pocket and pressed it into Ivy’s hand.\u003c/p\u003e\n\u003cp\u003e“This belongs to a very good lawyer,” I said. “A friend of mine. She’s agreed to represent you. Don’t worry about her fee. I’ll pay the bills. I need you to call her. I need you to call her right now. The cops will be here soon. They’re probably already on the way.” \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-81.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
