{"id":104922,"no":87,"title":"Page 87","content":"\u003cp\u003eI found her eyes. She looked away.\u003c/p\u003e\n\u003cp\u003e“Fine,” she said. “I have the missing letter.” She shook her head vigorously side to side. “I’m lousy at poker. I watch all the tournaments on ESPN and the Travel Channel. Doesn’t do me any good.”\u003c/p\u003e\n\u003cp\u003e“Why did you keep the letter?”\u003c/p\u003e\n\u003cp\u003e“I didn’t want to embarrass Katie. I don’t know how I could have; she’s been dead for thirty years. Anyway, I read through the letters when Berglund called and said he’d like to see them. There was this one—I was in college when Katie died. I remember sitting in a pew behind Nana and my mother at the service. Jim—James Dahlin—was speaking about his wife, giving a eulogy. He was bragging about how supportive and faithful Katie had been throughout their long marriage, and Nana leaned over and whispered to my mother just loud enough for me to hear, ‘Tell that to Brent Messer and Frank Nash.’ I didn’t know who Messer or Nash were, not then. I figured they were just guys that Katie might have slept with, and I remembered thinking at the time, ‘Good for you, Katie,’ which I suppose a lot of smart-aleck college girls might have thought in the mid-seventies. Only, when I read the letter, what, thirty, thirty-five years later, I wasn’t so sure it was such a good thing. What I thought was exciting when I was a kid seemed sordid now. So I took it out of the carton.”\u003c/p\u003e\n\u003cp\u003e“May I read it?” I said.\u003c/p\u003e\n\u003cp\u003e“Do you think it will lead you to Frank Nash’s gold?” Shelly asked.\u003c/p\u003e\n\u003cp\u003e“Oh. You know about that.”\u003c/p\u003e\n\u003cp\u003e“The police said the other day that Berglund might have been killed for the gold. Funny, I don’t recall you mentioning it when you were here. Why is that?”\u003c/p\u003e\n\u003cp\u003e“Must have slipped my mind.”\u003c/p\u003e\n\u003cp\u003e“You weren’t trying to keep it all to yourself, were you, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Lady, I have more partners than I can shake a stick at.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. So one more would have been one too many, is that what you’re telling me?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Shelly.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, don’t worry about it. I read the letter. I read it several times.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“Wait here.”\u003c/p\u003e\n\u003cp\u003eShelly left the living room. When she returned, she was holding a small pale blue envelope. “Read it yourself,” she said.\u003c/p\u003e\n\u003cp\u003eI pulled the well-creased pages out of the envelope.\u003c/p\u003e\n\u003cp\u003eSeptember 16, 1933\u003c/p\u003e\n\u003cp\u003eParis—Hotel Crystal\u003c/p\u003e\n\u003cp\u003eDarling Rose:\u003c/p\u003e\n\u003cp\u003eI am taking a desperate gamble, I know, but I must have my freedom and I see no other alternative available to me. Yesterday I sent yet another missive to Brent. Again I begged him to grant me a divorce. This time, I told him if he refused, I would inform the authorities about the bars of gold he has hidden in the wall behind the desk in his office. I reminded him that President Roosevelt has made it an act of treason to hoard gold during these troubled times. Do not be mistaken for a moment, dear sister, that I have taken this course with any thought that I possess the upper hand. The knowledge and pain of Frank Nash’s murder is still fresh in my heart. Yet I am willing to risk all to be free to marry Jim Dahlin. Oh, how different my life should be if I had not met Frank, if we had not behaved with such imprudence in the bedroom above the Hollyhocks. A single reckless act resulting in so much heartache. However, I am certain we shall soon see the better side of this affair …\u003c/p\u003e\n\u003cp\u003eThe rest of the text dealt with Kathryn’s love for both James Dahlin and Paris—for her, the two seemed interchangeable. I looked up from the letter to find Shelly staring at me. My heart was pounding at about one hundred beats a minute, yet she was perfectly calm.\u003c/p\u003e\n\u003cp\u003e“I don’t suppose you know where Brent Messer’s office was located,” I said.\u003c/p\u003e\n\u003cp\u003eIn response, Shelly gave me a thick, heavy coffee-table book—Lost Twin Cities by Larry Millet, the former architecture writer and critic for the St. Paul Pioneer Press.\u003c/p\u003e\n\u003cp\u003e“Page two-sixteen,” she said.\u003c/p\u003e\n\u003cp\u003eI turned to the correct page and began reading about the palatial Guardian Life Insurance Building on the southwest corner of Fourth and Minnesota streets in downtown St. Paul. It was originally dubbed the Germania Life Insurance Building; however, its name was changed following our entry into World War I.\u003c/p\u003e\n\u003cp\u003e“This is where Messer kept his offices?” I said.\u003c/p\u003e\n\u003cp\u003e“Yes, on the sixth floor,” Shelly said.\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eAccording to Millet, the base of the building was rusticated walls of red granite framing tall, arched windows, while the upper floors were faced in rugged Lake Superior sandstone in the fashion of the Renaissance Revival. Supposedly, the building proved that aging architect Edward Bassford could still hold his own with St. Paul’s young Turks. Well, good for him, I thought.\u003c/p\u003e\n\u003cp\u003eThe only part of the chronicle that really interested me was the last paragraph.\u003c/p\u003e\n\u003cp\u003eI read it twice.\u003c/p\u003e\n\u003cp\u003eThe building itself survived until 1970, when it was demolished for the Kellogg Square apartment complex.\u003c/p\u003e\n\u003cp\u003eWhen I finished, I gazed up at Shelly. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-87.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
