{"id":104929,"no":94,"title":"Page 94","content":"\u003cp\u003eMike was dressed as he had been the other day, in black slippers, black slacks, and black shirt, only this time he wore a sky blue cardigan sweater and matching dress cap. I asked him if he played golf.\u003c/p\u003e\n\u003cp\u003e“Not so much anymore,” Mike said, “but back in the day, yeah, I chased the little white ball. We all did. It was a dangerous hobby. You know, that’s how the Feds got Jimmy Keating, Tommy Holden, and Harv Bailey. Grabbed ’em up on the eighth hole at the Mission Hills Country Club in Kansas City. Almost got Dillinger the same way over here in Maplewood at the Keller Golf Course. Tried to nab ’im on the third hole, only he escaped. Yeah, dangerous hobby. We used to have two caddies. One to carry the clubs and the other to carry sub guns and rifles. How ’bout you, copper? You play?”\u003c/p\u003e\n\u003cp\u003e“Yes, but I never carry. The way I score, someone might get hurt.”\u003c/p\u003e\n\u003cp\u003eHe gestured as if he were holding a tommy gun. “I once shot up a green to teach it a lesson. You know what I mean.”\u003c/p\u003e\n\u003cp\u003eI told him I did as we moved deeper into the room. Mike glanced about carefully. We were alone.\u003c/p\u003e\n\u003cp\u003e“I remember one time I was playing with Leon Gleckman,” he said. “If it wasn’t for his bodyguards, I would have shot him down on—what’s the hole on Keller, the one that overlooks the big lake?”\u003c/p\u003e\n\u003cp\u003e“Eleven.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I would have shot him down on the eleventh hole. The sonuvabitch was cheating. Cheating at golf. Imagine that! How low can you get?”\u003c/p\u003e\n\u003cp\u003eMike took three cautious steps backward, putting distance between us. “That’s not what you call a rhetorical question,” he said. He reached behind his back and produced a small, shiny revolver from under his sweater. He pointed it at my chest. “How low can you get, McKenzie, jamming up a sweet kid like Genevieve with the cops? What, you didn’t think I’d find out?”\u003c/p\u003e\n\u003cp\u003eI looked first at the gun, then up at Mike. His words came flooding back to me.\u003c/p\u003e\n\u003cp\u003eYou see me as this nice, harmless old man, maybe colorful, I don’t know. Only I wasn’t so nice back then. I sure wasn’t harmless … I had a rule like everybody else. If it was between you getting hurt and me going to prison, it wasn’t going to end good for you. I didn’t like guns. Didn’t like to hurt. But if it was a choice of you or me or if you messed with my family—I would do what needed to be done.”\u003c/p\u003e\n\u003cp\u003eI slowly raised my hands and began backing away. “You don’t want to do this.”\u003c/p\u003e\n\u003cp\u003e“Why not? It’s not like I haven’t done it before.”\u003c/p\u003e\n\u003cp\u003e“Berglund?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003eI kept moving backward, casually, cautiously, trying not to call attention to it. Chairs and sofas facing the TV were behind me and to the right. My plan was to get behind one, use it for cover while I tried to get through the door into the hallway. I didn’t like my chances. Mike might have been ninety-five, but the handgun made him as tough as any gangbanger.\u003c/p\u003e\n\u003cp\u003e“Berglund messed with Sugar,” Mike said. “Now you’re messin’ with her, too.”\u003c/p\u003e\n\u003cp\u003e“You think of Genevieve as family,” I said.\u003c/p\u003e\n\u003cp\u003e“All the family I got left.”\u003c/p\u003e\n\u003cp\u003eI kept glancing from his face to the gun. He held it loosely in his hand, continued to point it at the center of my chest; it didn’t waver.\u003c/p\u003e\n\u003cp\u003eHe’s a ninety-five-year-old man, my inner voice screamed. How come his hands aren’t shaking?\u003c/p\u003e\n\u003cp\u003e“You’ll die in prison,” I said.\u003c/p\u003e\n\u003cp\u003e“Gotta die somewhere.” He tightened his grip on the gun.\u003c/p\u003e\n\u003cp\u003e“Just tell me one thing, Mike,” I said. “Will you answer just one question?”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Did Frank Nash play golf?”\u003c/p\u003e\n\u003cp\u003e“What? No.”\u003c/p\u003e\n\u003cp\u003eI turned and leapt sideways behind a chair. Mike rushed his shot. There was a high-pitched crack, and a small-caliber bullet plowed harmlessly into the arm of the chair—harmlessly unless you happened to be the chair. I moved quickly in a low crouch past the chair and past a sofa, making my way toward the large door leading to the corridor. He moved to his left, covering the wide gap between the furniture and the door. He fired again, but it was just to remind me that he was there. I grabbed a large pillow, thinking I could distract him. I raised my head to see above the sofa.\u003c/p\u003e\n\u003cp\u003eMike used both hands to level the gun at my face.\u003c/p\u003e\n\u003cp\u003eI flung the pillow as hard as I could at him and moved toward the corridor.\u003c/p\u003e\n\u003cp\u003eMike tried to bring his hands up to take the blow, but he moved too slowly. The pillow caught the old man square in the face. The force of the blow was enough to send him staggering backward. He stumbled, tripped. He seemed to fall in stages, first his legs, then his rear, then his back, then his head. I heard the air escaping from his lungs.\u003c/p\u003e\n\u003cp\u003eA voice called out.\u003c/p\u003e\n\u003cp\u003e“Uncle Mike!”\u003c/p\u003e\n\u003cp\u003eGenevieve rushed into the room from the door nearest the elevator. She knelt at Mike’s side. I did the same thing. She gently cradled his head in her hands; the hat had fallen away, leaving a ring of wispy white hair. I yanked the gun out of his fist.\u003c/p\u003e\n\u003cp\u003eMike gasped and wheezed and shook; his face was a ghastly white, and his eyes seemed to roll back into his head.\u003c/p\u003e\n\u003cp\u003e“Mike, Mike,” Genevieve chanted. “I’ll get help.”\u003c/p\u003e\n\u003cp\u003eMike grasped her wrist in his frail hand. “No,” he said. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-94.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
