{"id":104930,"no":95,"title":"Page 95","content":"\u003cp\u003e“Why not, Mike? You’re hurt.”\u003c/p\u003e\n\u003cp\u003eI sat on the arm of the chair that Mike had shot, the gun in my hands. It was a .25. I looked down at him, and he looked up at me.\u003c/p\u003e\n\u003cp\u003e“Fucking copper,” he said.\u003c/p\u003e\n\u003cp\u003e“Convict,” I said.\u003c/p\u003e\n\u003cp\u003eHe was so old, his body so susceptible to damage, I wondered if the fall had killed him. Yet even as I watched, the color returned to his face and he began to regain his breath.\u003c/p\u003e\n\u003cp\u003e“Anything broken?” I said.\u003c/p\u003e\n\u003cp\u003e“I don’t think so.” He tried to rise, but it was too much effort and he slumped back against the floor. “Got taken out by a pillow. I don’t believe it.”\u003c/p\u003e\n\u003cp\u003e“It was a hard pillow,” I said.\u003c/p\u003e\n\u003cp\u003e“It’s embarrassing, that’s what it is.”\u003c/p\u003e\n\u003cp\u003e“Just rest easy,” I said. “Genevieve, why don’t you go for help. We’ll make sure Mike is all right and then we’ll call the police.”\u003c/p\u003e\n\u003cp\u003e“The police?” she said.\u003c/p\u003e\n\u003cp\u003e“Goin’ all the way, huh, copper?” Mike said.\u003c/p\u003e\n\u003cp\u003e“You have your code, convict. I have mine.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Genevieve said.\u003c/p\u003e\n\u003cp\u003e“Ahh, Sugar,” Mike said. “I killed that weasel Berglund. I knew what he did to you, knew how he treated you, so I shot him. I was gonna shoot the copper, too.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eFrom the expression on his face, Mike seemed surprised by the question. “Cuz you’re family,” he said.\u003c/p\u003e\n\u003cp\u003e“How did you kill Berglund?” I said.\u003c/p\u003e\n\u003cp\u003e“Wasn’t hard. He gave me his business card, so I knew where he lived. I just walked over to the shopping mall and grabbed a cab to a place not far from his apartment.”\u003c/p\u003e\n\u003cp\u003e“You walked,” I said.\u003c/p\u003e\n\u003cp\u003e“Gotta draw you a picture?”\u003c/p\u003e\n\u003cp\u003eI remembered what Ivy had said about Berglund’s killer. He walked so slowly, and he used the wall for support, like he was sick or something.\u003c/p\u003e\n\u003cp\u003e“I’ll be damned.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, anyway, when I got there, to the apartment, the door was wide open. I called, but no one answered.”\u003c/p\u003e\n\u003cp\u003eWhitlow, that putz, my inner voice said. He didn’t close and lock the door before he left.\u003c/p\u003e\n\u003cp\u003e“I went inside,” Mike said. “Didn’t take me long to understand that this was a woman’s apartment—the furniture, the clothes. I realized then that Berglund had not only messed with Sugar, he was cheating on his own woman. So I waited. Waiting made me think how foolish it all was, made me think I was getting too old for this kinda ruckus. I decided to leave. Only when I opened the door, Berglund was standing there.”\u003c/p\u003e\n\u003cp\u003e“Why did you shoot him?” I said.\u003c/p\u003e\n\u003cp\u003e“Way I saw it, he was standing between me and my freedom.”\u003c/p\u003e\n\u003cp\u003eOld habits die hard, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“Where did you get the gun?” I said aloud.\u003c/p\u003e\n\u003cp\u003e“Had it for years,” Mike said. “Kept it hidden from the keepers.”\u003c/p\u003e\n\u003cp\u003e“Do you have a license for it?”\u003c/p\u003e\n\u003cp\u003e“McKenzie, please.”\u003c/p\u003e\n\u003cp\u003eFoolish question.\u003c/p\u003e\n\u003cp\u003e“It just keeps getting better and better,” I said. I made sure the safety was engaged and slipped the gun into my pocket.\u003c/p\u003e\n\u003cp\u003e“What happens now?” Mike said.\u003c/p\u003e\n\u003cp\u003e“That’s up to the courts,” I said.\u003c/p\u003e\n\u003cp\u003e“No,” Genevieve said.\u003c/p\u003e\n\u003cp\u003e“He killed a man,” I said. “He has to pay for that.”\u003c/p\u003e\n\u003cp\u003e“You get caught, you do the time, Sugar,” Mike said. “That’s how it works. Me and McKenzie, we know the rules.”\u003c/p\u003e\n\u003cp\u003e“Besides,” I said, “my friend is on the spot for it.”\u003c/p\u003e\n\u003cp\u003e“The friend you told me about,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m sorry ’bout that,” Mike said from the floor.\u003c/p\u003e\n\u003cp\u003e“But, but…” Genevieve chanted.\u003c/p\u003e\n\u003cp\u003e“There are no buts,” I said.\u003c/p\u003e\n\u003cp\u003e“You said—you told me that you were trying to help your friend. When we were on the phone, remember?”\u003c/p\u003e\n\u003cp\u003e“I remember.”\u003c/p\u003e\n\u003cp\u003e“Could you, would you … McKenzie, can you help Mike?”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?”\u003c/p\u003e\n\u003cp\u003e“He’s my friend.”\u003c/p\u003e\n\u003cp\u003eI looked down at the ancient gangster. He was smiling as if he already knew my answer. The sonuvabitch tried to shoot you! my inner voice reminded me. Yet something about him, or maybe about Genevieve—or maybe I just wanted to redeem myself for hurting both Genevieve and Ivy unnecessarily … I shook my head at the wonder of my own generosity.\u003c/p\u003e\n\u003cp\u003e“Ahh, hell, Sugar,” I said. “Any friend of yours is a friend of mine.”\u003c/p\u003e\n\u003cp\u003e22\u003c/p\u003e\n\u003cp\u003eI don’t know what I was feeling when I entered Rickie’s. Happy, sad, angry, frustrated, embarrassed—all of the above. I had called Ivy after I gave my statement to Bobby Dunston and Jeannie Shipman at the James S. Griffin Building—they let me in after all. I told her that Uncle Mike had confessed to shooting Josh Berglund and produced the murder weapon in case there was any doubt. I told her that I had hired G. K. Bonalay to defend him. I told her that she had nothing more to fear. I expected Ivy to be thrilled, and I suppose she was. Even so, her response to the good news was to point out how wrong I had been about her. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-95.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
