{"id":104932,"no":97,"title":"Page 97","content":"\u003cp\u003e“Can’t wait,” I said. I was loud enough that Whitlow must have heard, but he pretended to ignore me. “Where’s Heavenly?” I said. “Don’t tell me you kids had another falling-out.” He ignored me some more.\u003c/p\u003e\n\u003cp\u003eI saw the question in her eyes, so I leaned down and told Nina in whispers who Whitlow was. She glanced at him once, then pretended to ignore him, too.\u003c/p\u003e\n\u003cp\u003eThe parade was just beginning. A black limousine pulled up, a door opened, and Allen stepped out. He saw us instantly. His reaction was to bend down and speak earnestly to someone inside the car. A moment later, Timothy Dahlin emerged. He studied Nina, Whitlow, and me for a hard ten seconds, then decided to disregard our presence. While he approached the canopy, Heavenly arrived, smiling happily as if she knew her birthday wish was about to be granted, swinging her purse as she hustled up the avenue. She saw us, stopped, spun around, and showed us her back for half a minute before turning again and advancing toward the house. This time she looked as if she had failed to blow out all the candles.\u003c/p\u003e\n\u003cp\u003eEventually the six of us were huddled near the front door, behaving as if we were all strangers.\u003c/p\u003e\n\u003cp\u003e“I’m guessing everyone here reads the St. Paul Pioneer Press,” I said.\u003c/p\u003e\n\u003cp\u003eNo one replied.\u003c/p\u003e\n\u003cp\u003eThere were several displays trumpeting the services of both the architectural firm and the interior designers who were responsible for renovating the Presswood House; brochures and business cards were available to whomever wanted one. Dahlin skimmed a brochure while he spoke, his voice flat, quiet, and without emotion.\u003c/p\u003e\n\u003cp\u003e“The gold belongs to me,” he said. “It’s my inheritance.”\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t want the gold,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“If you had to, could you walk into a courtroom tomorrow and prove your relationship to Jelly Nash?” I asked. Dahlin didn’t reply. “How ’bout Brent Messer? Robert Presswood?”\u003c/p\u003e\n\u003cp\u003e“I’m the one who found out about the gold,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“No, it was me,” said Whitlow.\u003c/p\u003e\n\u003cp\u003eAllen stepped in front of them. “You did it while you were both employed by Mr. Dahlin, don’t forget,” he said.\u003c/p\u003e\n\u003cp\u003eBoth Heavenly and Whitlow ignored him.\u003c/p\u003e\n\u003cp\u003e“It’s mine,” she said.\u003c/p\u003e\n\u003cp\u003e“It’s mine,” he said.\u003c/p\u003e\n\u003cp\u003e“Technically, it belongs to the United States Treasury Department,” I said.\u003c/p\u003e\n\u003cp\u003e“Screw you,” Whitlow said. “You knew about Messer’s home office. You were holding out on us.”\u003c/p\u003e\n\u003cp\u003e“Us,” Heavenly said. “When did it become ‘us’?”\u003c/p\u003e\n\u003cp\u003e“What’s it going to take to make you people disappear?” Dahlin said.\u003c/p\u003e\n\u003cp\u003e“Let’s not start that again,” I told him.\u003c/p\u003e\n\u003cp\u003e“I’m not leaving,” Heavenly said.\u003c/p\u003e\n\u003cp\u003e“Neither am I,” Whitlow said.\u003c/p\u003e\n\u003cp\u003e“Oh, for goodness sake, what are you, children?” Nina said. “Didn’t you learn anything in kindergarten? Didn’t you learn to share?”\u003c/p\u003e\n\u003cp\u003eThat silenced us for a few beats.\u003c/p\u003e\n\u003cp\u003e“I have a suggestion,” I said.\u003c/p\u003e\n\u003cp\u003eDahlin knew what I was going to propose before I proposed it. He threw up his hands and said, “Fine. I’ll go along.”\u003c/p\u003e\n\u003cp\u003e“Go along with what?” Whitlow said.\u003c/p\u003e\n\u003cp\u003e“An equal split—four shares,” I said.\u003c/p\u003e\n\u003cp\u003e“An equal split,” Heavenly repeated, but she wasn’t giving in.\u003c/p\u003e\n\u003cp\u003e“What alternative do we have?” I said. “We all know where the gold is—at least we think we do. No one is willing to leave it to the others.”\u003c/p\u003e\n\u003cp\u003eHeavenly covered her face with her hands, inhaled between her fingers, and held her breath like a little girl desperate to get her way. When she exhaled she found Whitlow’s eyes. The two of them stared at each other, communicating without speaking, until Whitlow said, “What about it, Hep?”\u003c/p\u003e\n\u003cp\u003e“Agreed,” she said, although it sounded like she was agreeing to a flu shot.\u003c/p\u003e\n\u003cp\u003eHeavenly extended her hand, and Whitlow shook it. I shook Dahlin’s hand. Pretty soon everyone was shaking everybody’s hand.\u003c/p\u003e\n\u003cp\u003e“Wow, man,” I said. “We got the band back together.”\u003c/p\u003e\n\u003cp\u003eFinally a young woman dressed in all natural fibers led us forward. She was very pleasant and very knowledgeable and spoke with a nice, melodic voice, and she drove me nuts. Apparently she was under the impression that the group—we had swelled to over a dozen by the time she took us in hand—was actually interested in the building’s architecture and elegant furnishings. I blamed Nina and Heavenly because of the way they oohed and ahhed over every little thing. In the dining room there was a meticulously constructed cabinet built to store wineglasses that resembled a dollhouse.\u003c/p\u003e\n\u003cp\u003e“Isn’t it darling?” Nina said.\u003c/p\u003e\n\u003cp\u003e“Look, it has different rooms for different types of glasses,” said Heavenly. “Oh, how cute.”\u003c/p\u003e\n\u003cp\u003e“For God’s sake, keep your eyes on the prize, wouldja?” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-97.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
