{"id":104934,"no":99,"title":"Page 99","content":"\u003cp\u003e“Oh, well,” I said.\u003c/p\u003e\n\u003cp\u003eDahlin and Allen, with Whitlow adding a kick or two, smashed in the wood paneling—it was a false wall, as Kathryn’s letter had predicted—and they began prying it away with their hands. It gave slowly, with a long, painful cry followed by a resounding snap. Dahlin and Allen fell back against the desk, a thin chunk of oak in their hands. Whitlow reached in and grabbed another board and pulled. It gave, but not without a struggle. Dahlin and Allen pulled on a board on the other side of the hole. They had an easier job of it.\u003c/p\u003e\n\u003cp\u003eThe three of them stopped abruptly.\u003c/p\u003e\n\u003cp\u003eThe hole was now about two feet wide and three feet high.\u003c/p\u003e\n\u003cp\u003eNina, Heavenly, and I crowded forward.\u003c/p\u003e\n\u003cp\u003e“Oh. My. God.” Nina said.\u003c/p\u003e\n\u003cp\u003eThere, neatly stacked in four rows between the wall studs, eight bars to a row, shrouded in a thick layer of dust, yet glistening all the same, was Jelly’s gold!\u003c/p\u003e\n\u003cp\u003eI remember Nina hugging me. I think Heavenly did, too. It seemed to me that Dahlin sat down in Messer’s chair and said nothing while Allen and Whitlow whooped it up and exchanged high fives. I could be mistaken. My memory of those few minutes is all kind of jumbled. The only thing I’m sure of is that the tour guide entered the office soon after we found the gold and said, “You’re all going to get it.”\u003c/p\u003e\n\u003cp\u003eJust So You Know\u003c/p\u003e\n\u003cp\u003eOne and a quarter percent. That’s what we each earned for our efforts. A lousy 1.25 percent of the $9,233,536 in gold that we recovered. For those keeping score at home, that amounted to a measly $115,419.20. Okay, not measly, but still. Half of my share went to Ivy Flynn as per our agreement, and 20 percent of what was left to me was divided between Genevieve Antonello and Mike—he had no use for his share, but a deal is a deal. Meanwhile, the Ramsey County Historical Society received 5 percent, and so did the new owners of Presswood House. The United States Treasury Department claimed the rest.\u003c/p\u003e\n\u003cp\u003e“A total of fifteen percent,” I told Nina. “That’s not even a decent tip.”\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t care about the money, that you did it for the fun.”\u003c/p\u003e\n\u003cp\u003e“Are you crazy? Of course I cared about the money. Man, nine million bucks shot to hell.”\u003c/p\u003e\n\u003cp\u003e“You know, we never did discuss my share.”\u003c/p\u003e\n\u003cp\u003e“Your share?”\u003c/p\u003e\n\u003cp\u003e“I’m the one who told you about the open house.”\u003c/p\u003e\n\u003cp\u003e“So you did,” I said. “Tell you what. You can have half of what I have left. Only after federal and state taxes, I doubt it’ll be enough to buy Erica a decent secondhand car.”\u003c/p\u003e\n\u003cp\u003e“It was a nice party, though,” Nina said.\u003c/p\u003e\n\u003cp\u003eTrue. The RCHS was delighted by the unexpected boost to its fund-raising efforts and threw a party at Presswood House to celebrate; the owners were pleased, too, and catered the affair. Dahlin scored a lot of media points when he donated his share of the reward—as paltry as it was—to the RCHS. He even volunteered to pay for the hole we had kicked into the wall, but the new owners would have none of it. They said they were going to leave Messer’s office just the way it was.\u003c/p\u003e\n\u003cp\u003eThe highlight of the evening was a recounting of how we discovered Jelly’s gold in the first place. Dahlin, Heavenly, and Whitlow did most of the telling at the party and to the news media; Kelly Bressandes got the scoop I had promised her. Dahlin later included an account in his book that noted his relationship with Brent Messer—but not Jelly Nash—and both Heavenly and Whitlow added magazine articles. Heavenly even scored a movie option; I heard they were negotiating with Naomi Watts to play her part. Personally, I didn’t know what a wonderfully adventurous story it was until I heard their versions—right up there with the tales of Indiana Jones and Dirk Pitt. Nor did I realize, according to the three of them, how very little I had contributed to it all. Dahlin mentioned my name only once.\u003c/p\u003e\n\u003cp\u003eHe didn’t mention Uncle Mike at all. Just as well.\u003c/p\u003e\n\u003cp\u003eMike’s confession and the recovery of the murder weapon made all the suspects I had gathered moot. Still, some smart lawyering on G. K. Bonalay’s part, plus his advanced age, earned Mike a deal. He pleaded guilty to second-degree manslaughter and took a twenty-eight-month jolt, just over half of what the sentencing guidelines recommended, in the minimum-security prison in Lino Lakes, where he soon gained fame as the oldest guest of the Minnesota Corrections Department. Genevieve Antonello visited Mike at least once a week for the thirteen months that he actually served. He died in his sleep two months after his release.\u003c/p\u003e\n\u003cp\u003eSo it goes.\u003c/p\u003e\n\u003cp\u003eAfterword \u003c/p\u003e","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-99.html","bookId":2220,"creation":"Oct 5, 2019 10:41:33 PM","modification":"Oct 5, 2019 10:41:33 PM"}
