{"id":96328,"no":16,"title":"Page 16","content":"\u003cp\u003eWe were not then powerful enough to erase all evidence of the Precursors, to destroy their star roads and citadels and other artifacts. And so we left at least one Precursor behind, to live out dreams of vengeance and hatred, to lay down plans in cold and darkness at the heart of a lost asteroid—over millions of years.\u003c/p\u003e\n\u003cp\u003eThat is my evidence of a great crime, of a crime against the Mantle.\u003c/p\u003e\n\u003cp\u003eNow that I tell you, Catalog, will you tell Haruspis? Will this story finally become accessible in the Domain? The Domain is far from static. Don’t records stored in the Domain change because Information seeks its own patterns and becomes more complete? Because future generations layer their own knowledge over the old? Yet the Domain is more and more often blocked to us, confusing, reticent.\u003c/p\u003e\n\u003cp\u003ePerhaps there is no more history to add. Perhaps we are the last generation of Forerunners.\u003c/p\u003e\n\u003cp\u003eWhat other testimony have you absorbed from your network? Does someone out there confirm my story with his own? Do I feel him through you? I am tired.\u003c/p\u003e\n\u003cp\u003eThere is much work left to do, and so little time.\u003c/p\u003e\n\u003cp\u003e[TT: The following five strings are anomalous in that they do not reflect the testimony of individuals. They may be internal Juridical reports or observations, or reports issued by Forerunner commanders in the field, or reports generally distributed by the New Council.]\u003c/p\u003e\n\u003cp\u003eSTRING 16\u003c/p\u003e\n\u003cp\u003eSTRATEGIC REPORT, DESCRIPTION OF OPPOSITION\u003c/p\u003e\n\u003cp\u003eTHERE IS CONFIRMATION from multiple engagements that combined Warrior-Servant and former Builder Security positions are encountering subverted Forerunner ships and weapon systems, many in tremendous numbers. These subverted forces are operated both by Flood-infected Forerunners and corrupted monitors. It is presumed that these opposition forces were marshalled in the years since Mendicant Bias first encountered the Primordial.\u003c/p\u003e\n\u003cp\u003eMany of our losses have been due to subverted Forerunner ships being welcomed by unaware forces and planets.\u003c/p\u003e\n\u003cp\u003eOnce within a protected zone, the Flood spreads rapidly. Spore mountains have been sighted by scouts in two thousand systems, many of them key to the maintenance of defensive cordons.\u003c/p\u003e\n\u003cp\u003eThis cannot continue unchecked or we are lost.\u003c/p\u003e\n\u003cp\u003eSTRING 17\u003c/p\u003e\n\u003cp\u003eMENDICANT BIAS, PREVIOUSLY believed to be detained, has somehow returned and is spreading its influence …\u003c/p\u003e\n\u003cp\u003e[TT: Lacuna]\u003c/p\u003e\n\u003cp\u003eWhere necessary, all metarch-level command and control ancillas are undergoing thorough reprogramming or replacement. Complete success is doubtful. Purging Mendicant Bias appears to be the only solution.\u003c/p\u003e\n\u003cp\u003eSTRING 18\u003c/p\u003e\n\u003cp\u003eFLOOD EVOLUTION: KEY MINDS\u003c/p\u003e\n\u003cp\u003eIDENTIFICATION OF NEW categories of Flood components and forms will be distributed upon confirmation.\u003c/p\u003e\n\u003cp\u003eTentative conclusions: the Flood is mutating to form Graveminds of unprecedented size and complexity, incorporating many species. Entire planetary ecosystems have apparently undergone conversion to what are being referred to as Key Minds.\u003c/p\u003e\n\u003cp\u003eEvidence of the extraordinary strategic planning abilities of these Key Minds is rapidly increasing. They appear to be more than a match for any metarch-level ancilla, capable of assuming complete control of besieged sectors, and sending converted battle fleets through unprecedented number of slipspace portals utilizing unfamiliar technology.\u003c/p\u003e\n\u003cp\u003eThis technology also appears to be capable of blocking delivery of our forces to battle fronts. Vessels showing signs of extreme reconciliation failure have been witnessed at the arrival points of major Forerunner portals.\u003c/p\u003e\n\u003cp\u003ePerhaps most alarming, reports arrive each hour of reawakened Precursor artifacts, including orbital ribbons, star roads, planetary fortresses, and citadels. Combined defense forces are inadequate to investigate and confirm all instances of these reactivations.\u003c/p\u003e\n\u003cp\u003eThey appear to be galaxy-wide.\u003c/p\u003e\n\u003cp\u003eSTRING 19\u003c/p\u003e\n\u003cp\u003eBATTLE BRIEFING: KAN PAKKO\u003c/p\u003e\n\u003cp\u003eWE’VE ENTERED ORBIT around an unexploited gas giant and are using it as a shield. All feasible orbital solutions for leaving this system are blockaded.…\u003c/p\u003e\n\u003cp\u003e“We are surrounded by over a thousand Forerunner vessels of all classes.\u003c/p\u003e\n\u003cp\u003e“More alarming, we cannot open slipspace portals; three of our ships have ‘echoed’ from attempted transits and show powerful causality mutations. Some clearly were caught between our continuum and incomplete, inefficient universes. Status of their crews and ancillas is unknown, but communication has ceased.\u003c/p\u003e\n\u003cp\u003e“This system was once a prime site for Precursor artifacts. They are no longer dormant. Suppression fields of enormous power appear to be magnified by local star roads, which are taking on new and startling configurations.\u003c/p\u003e\n\u003cp\u003e“Our weapons are no longer usable.\u003c/p\u003e\n\u003cp\u003e“Hundreds of infected ships have attempted to blast or cut into our own. With protective fields suppressed, we may not be able to withstand them much longer.\u003c/p\u003e\n\u003cp\u003e“We have no means of returning to Forerunner lines. Unless we can formulate a viable escape, we will, within a few hours, sacrifice ourselves in dubious battle against overwhelming forces.\u003c/p\u003e\n\u003cp\u003e“We will reduce their strength and numbers as best we can.”\u003c/p\u003e\n\u003cp\u003eSTRING 20\u003c/p\u003e\n\u003cp\u003eREPORT FROM JURIDICAL NETWORK (UNSIGNED)\u003c/p\u003e\n\u003cp\u003eFORERUNNER DEFENSES CONTINUE to collapse.\u003c/p\u003e\n\u003cp\u003eBurns now cover two thirds of Forerunner territory, and the Flood has assumed complete control of well over half a million stellar systems.\u003c/p\u003e\n\u003cp\u003eJuridicals have been evacuated from most of these regions. Where they have been captured, evidence of intrusion into the Juridical network is now clear, and so the network has been temporarily shut down.\u003c/p\u003e\n\u003cp\u003eForerunner legal proceedings are now on hold.\u003c/p\u003e\n\u003cp\u003eForerunner civilization is now on hold.\u003c/p\u003e\n\u003cp\u003e[TT: End of this series of anomalous strings.]\u003c/p\u003e\n\u003cp\u003eSTRING 21\u003c/p\u003e\n\u003cp\u003eTESTIMONY OF FABER, THE MASTER BUILDER\u003c/p\u003e\n\u003cp\u003eFABER: If I am guilty of any crime, why would I rescue my greatest enemy and bring him back to tell his story?\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: Our inquiry has not yet begun. You are answering questions not posed.\u003c/p\u003e\n\u003cp\u003eFABER: The Warden did not preserve me in the midst of all that destruction for reasons of sentiment. It knew my value.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: The Warden was bribed.\u003c/p\u003e\n\u003cp\u003eFABER: How the hell do you bribe a machine?\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: You found a way. We repeat, these statements are premature. We are drawing our inquest to a close. A few additional details need to be resolved; you may be able to help us in that regard.\u003c/p\u003e\n\u003cp\u003eFABER: I’m not being charged with any crime?\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: We are interested in your attempt, after you captured the Ur-Didact in the San’Shyuum quarantine system, to dispose of him in Flood-infested territory—in a Burn.\u003c/p\u003e\n\u003cp\u003eFABER: I know nothing about that.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: What did you do with the humans and the Manipular, Bornstellar, found on the same ship?\u003c/p\u003e\n\u003cp\u003eFABER: I returned the Manipular to his family.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: And the humans?\u003c/p\u003e\n\u003cp\u003eFABER: They were delivered to a Halo.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: Were you aware that that Halo had been commandeered by the Primordial?\u003c/p\u003e\n\u003cp\u003eFABER: I was placed under arrest. Needless to say, I lost control of my installations.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: You did not continue to influence Mendicant Bias?\u003c/p\u003e\n\u003cp\u003eFABER: Certainly not. He was primarily the Didact’s design … you know that, don’t you?\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: There is also the matter of Catalog.\u003c/p\u003e\n\u003cp\u003eFABER: Ah.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: The Ur-Didact informs us that Catalog and two others accompanied him into the Burn. Please explain this circumstance.\u003c/p\u003e\n\u003cp\u003eFABER: Why would I send anyone into a Burn, only to rescue them? I assume my underlings screwed up. Misinterpreted orders. Or, as I say, they all escaped.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: How was it, then, after sending the Didact into a Burn—\u003c/p\u003e\n\u003cp\u003eFABER: I deny that! I’ve said it over and over.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: How was it that you found him a second time?\u003c/p\u003e\n\u003cp\u003eFABER: An accident. I swear on the Mantle. I was busy with Flood defense.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: You had assembled your Builder Security and disgraced Warrior-Servants and cobbled together a posse of vessels.\u003c/p\u003e\n\u003cp\u003eFABER: Cobbled together? We fought the Flood. Even better that nobody knew I was still alive. I could operate with freedom, cut loose from the failures of our old strategies. Given time to think over new strategies. And I was effective! We held that salient for three years. Without credit, mind you.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: How did the rescue come about?\u003c/p\u003e\n\u003cp\u003eFABER: I found the Didact—the original Didact—on a cruiser attempting to break our cordon. We were doing our best to protect a vulnerable flank against the Flood, arriving on Forerunner ships!—a flank opened wide by the failure of the Jat-Krula and its Line installations. I have no idea how the Didact secured that vessel.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: A very attractive bit of salvage.\u003c/p\u003e\n\u003cp\u003eFABER: All of its arms had been stripped away. That’s why we didn’t destroy it. It was harmless.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: What did you do with the Ur-Didact when you discovered he was aboard the cruiser?\u003c/p\u003e\n\u003cp\u003eFABER: Bringing back the Didact … bit of a coup, that. I decided to take the cruiser under tow and carry it to a research center.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: Was it possible you thought returning the Didact, the original Didact, might cause problems for his duplicate?\u003c/p\u003e\n\u003cp\u003eFABER: That’s harsh.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: After you recovered the Ur-Didact, did you notice a change in his behavior?\u003c/p\u003e\n\u003cp\u003eFABER: He was calm, sullen even. Seemed completely lacking in resentment or hatred. He told me he had experienced the Flood firsthand, knew much more about it … and it only confirmed his belief that Halos were not the best way to respond.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: He had not changed his opinions.\u003c/p\u003e\n\u003cp\u003eFABER: Not in the least. He seemed subdued, but otherwise, unchanged from the Didact who had disagreed with me for so many thousands of years. Still adamantly opposed to the use of the Halos. But it was clear he was hiding something from me, I do not know what. He wished to be taken to Requiem, his primary Shield World.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: He did not ask to be reunited with the Librarian?\u003c/p\u003e\n\u003cp\u003eFABER: No.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: How long has it been since you last communicated with the Librarian?\u003c/p\u003e\n\u003cp\u003eFABER: Years. Not at all after I was taken into custody and charged with corruption and unauthorized use of a strategic weapon.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: You have never had contact with the Primordial, nor with any advanced form of Gravemind?\u003c/p\u003e\n\u003cp\u003eFABER: I have not … but the Didact may be another story. Have you questioned him?\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: Your testimony shows internal inconsistencies. How do you explain them?\u003c/p\u003e\n\u003cp\u003eFABER: I’ve been on the front lines, fighting for years now, without credit and with very little support. Thankfully, my Builder Security forces have proven strong and loyal. We accomplished much.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: In fact, you were capturing smaller, weaker Flood-infested ships and putting them through inadequate decontamination before handing them over to Warrior-Servant crews, and doing this for extortionately high payment, under a regional commandant’s Letter of Marque. Many of the crews assigned to those captured vessels were in turn overwhelmed by undetected Flood components. The cruiser carrying the Didact was taken with that business in mind, was it not?\u003c/p\u003e\n\u003cp\u003eFABER: I know nothing about that.\u003c/p\u003e\n\u003cp\u003eMASTER JURIDICAL: The rate of Forerunner retreat and defeat in the area you claim to have been defending was more than five times greater than in neighboring themas. Your contingent of ships began with five hundred, of which only twenty survive.\u003c/p\u003e\n\u003cp\u003eFABER: It was hard duty. We did our best.\u003c/p\u003e\n\u003cp\u003eSTRING 22\u003c/p\u003e\n\u003cp\u003eRETURN OF THE DIDACT\u003c/p\u003e\n\u003cp\u003eTHE LIBRARIAN RESTS with her recovery team for the first moment in two months. She has invited Catalog to accompany her, assuming rightly that I am the most secure repository of her activities, and the least likely to be corrupted should a political crisis shake up the New Council—which is distinctly possible, given the scale of Forerunner losses. Most communications within the ecumene, including the Juridical network, have been temporarily blocked pending identification of the extent to which Flood-contaminated ships and systems are capable of listening in.\u003c/p\u003e\n\u003cp\u003eThe Librarian’s core team—the same Lifeworker team that accompanied her centuries before to the Path Kethona—gathers after processing their most recent acquisitions. The vessels in her research flotilla are now at full capacity, both for live specimens and genetic samplings.\u003c/p\u003e\n\u003cp\u003eThe Librarian appears exhausted. She is calm, quiet, listening to the team reports but saying little. She has removed her armor and is surrounded by flowing undergarments, while the armor undergoes self-repair and replenishment. The Librarian has worn the same armor for over a thousand years and exhibits an unusual attachment—for a Lifeworker—to her ancilla. But then, everything else familiar to her is either lost or far away—her children, her husband, and now her husband’s duplicate, whom she never refers to as other than “my Didact.” Even with all of these comings and goings, the reports of her subordinates, briefings from her flotilla commandant—all of her manifold, minute-by-minute duties and distractions—the Lifeshaper seems terribly alone.\u003c/p\u003e\n\u003cp\u003eIt has been four years since the IsoDidact left the Erde-Tyrene system to assume command of Orion complex Defense Operations, leading forces reconstituted from both former Warrior-Servants and Builder Security.\u003c/p\u003e\n\u003cp\u003eEventually, as her ship begins its journey to the greater Ark, the work passes behind her. Her quarters empty.\u003c/p\u003e\n\u003cp\u003eI alone am left to listen.\u003c/p\u003e\n\u003cp\u003e“Do you have any cheerful stories in your inventory?” she asks softly.\u003c/p\u003e\n\u003cp\u003eA great transparent panel spreads wide, so that we are able to see the last of the Lifeworker ships gleaming in fading starlight, anticipating the beautiful, awesome show that is portal-formation, a few minutes or hours before the commandant is reassured of transit and we begin our journey away from this system.\u003c/p\u003e\n\u003cp\u003e“There are many cases long resolved that are part of public record,” I say. “Few of which I gathered myself, however. Some are, I suppose, amusing—but what entertains Juridicals may not entertain such as you.”\u003c/p\u003e\n\u003cp\u003e“You are young in your calling?”\u003c/p\u003e\n\u003cp\u003e“I am, Lifeshaper. I have not served the requisite centuries.”\u003c/p\u003e\n\u003cp\u003e“Interesting that those not so young should entrust you with my deposition.”\u003c/p\u003e\n\u003cp\u003e“Older Juridical units tend to be more cynical, less pleasant to deal with,” I explain. “Most remove themselves from gathering evidence and serve in other capacities.” \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-silentium-the-forerunner-saga-3/page-16.html","bookId":1630,"creation":"Oct 5, 2019 6:20:36 PM","modification":"Oct 5, 2019 6:20:36 PM"}
