{"id":96331,"no":19,"title":"Page 19","content":"\u003cp\u003e“Perhaps they were powerful but naive,” the IsoDidact says. “But they’ve had ten million years to contemplate those mistakes.”\u003c/p\u003e\n\u003cp\u003e“Yes … The Graveminds suck experience from all sentient history. One of them did everything but absorb me. Saw right through me, understood every strategy I’ve ever devised. They’ve advanced far beyond the Primordial. In absence of old strategies, new ones must be made.”\u003c/p\u003e\n\u003cp\u003e“I don’t believe so,” the IsoDidact says. “What we saw years ago at Charum Hakkor—before you imprinted me—the result of a unique Halo test. Complete destruction of all Precursor artifacts. Back then, it seemed an awful aberration … But now we know what Halos are really capable of. They can destroy any structure that relies on neural physics. They are our last hope.”\u003c/p\u003e\n\u003cp\u003eThe Ur-Didact turns aside, fists clenching. “And loose damnation on the stars?” he shouts. The IsoDidact is silent. The sky above is no less grim than these walls. “My wife sympathizes with our enemies,” the Ur-Didact says. “This quest to fulfill the Mantle has haunted me my entire life. And for countless millennia, we have failed to realize the one truth that could have saved us from the beginning. The Mantle isn’t to be inherited by the noble, it is to be taken by the strong.”\u003c/p\u003e\n\u003cp\u003eThe Librarian enters the room unannounced and alone. It takes a few minutes for this pair, like figures in a broken mirror, to realize that she has arrived.\u003c/p\u003e\n\u003cp\u003e“Beloved!” she says, stepping forward, arms out, and for a moment, her face is wreathed with hope. Her joy is radiant. And then it fades. The two Didacts observe her with very different expressions. What should have been heartfelt reunion feels painful and incomplete.\u003c/p\u003e\n\u003cp\u003e“Did you hear my blasphemy, wife?” the Ur-Didact grumbles, looking away. “Do I discredit your belief in the Mantle?”\u003c/p\u003e\n\u003cp\u003e“It is not ours to receive, not theirs to give, not now,” she says. “Tell me, my husband.” She looks long and hard at the Ur-Didact. “Is this anger, this hatred for your enemies, what stands between us and the joy of reunion?”\u003c/p\u003e\n\u003cp\u003eThe Ur-Didact moves toward his wife with a strangely dominant delicacy, his gaze fixed on her. She regards him with cautious fascination.\u003c/p\u003e\n\u003cp\u003e“Humans drowned out entire civilizations with the Flood,” he says. “They brought this horrific parasite to our people. Had we acted quicker, had we taken what was rightfully ours, we could have cut off the infection at its source. Know this: the universe will now be turned star by star, world by world, organism by living thing, into even more of a tortured mockery than it already is. Look what it’s done to me!” He spreads wide his powerful arms, bowing his head, as if opening to her gentle fingers, her probing, deep-feeling examination.\u003c/p\u003e\n\u003cp\u003eInstinctively, she reaches toward him—but holds back at the last instant. He notes her reticence; it may be the final breaking strain on thousands of years of love.\u003c/p\u003e\n\u003cp\u003e“Everything it touches is afflicted with madness,” he cries out. “It has touched me. I am myself mad!”\u003c/p\u003e\n\u003cp\u003eThe Librarian is stunned. She searches her husband’s features, but he turns aside.\u003c/p\u003e\n\u003cp\u003eHis duplicate cannot convey what he feels. He stands mute before them.\u003c/p\u003e\n\u003cp\u003eDEPARTURE AND PURSUIT\u003c/p\u003e\n\u003cp\u003eThe reuniting has not gone well.\u003c/p\u003e\n\u003cp\u003eThe Ur-Didact has taken a sphinx to the other side of the planet, where, he says, monitors report a possible intruder. As the arrival of spore-carrying ships cannot be ruled out, he will carry out a direct inspection.\u003c/p\u003e\n\u003cp\u003eThe IsoDidact has returned to orbit to ready their fastest remaining ship—the Audacity, ceded to the Librarian after her historic voyage.\u003c/p\u003e\n\u003cp\u003eWhen we depart, the entire planet will be super-cooled, then powered down. From any distance greater than a few dozen kilometers, it will resemble a rocky, frozen residue of recent battles, abandoned for years, stripped of all resources. When we depart, the entire planet will be super-cooled, then powered down. Perhaps this effort, though seemingly futile, will save Nomdagro.\u003c/p\u003e\n\u003cp\u003eOn a parapet, monitors gather in long rows, like servants of old awaiting the departure of their mistress.\u003c/p\u003e\n\u003cp\u003eShe stands near the outer wall of the parapet, looking out over the great river valley where their children once played—and were trained by the Ur-Didact. Pleasant and now intensely painful memories. Most of her life has been centered on this world.\u003c/p\u003e\n\u003cp\u003e“We may never return,” she says. “All of this…”\u003c/p\u003e\n\u003cp\u003eShe cannot complete her thoughts. She flees from the parapet, leaving the machines to finish their final tasks.\u003c/p\u003e\n\u003cp\u003eThe IsoDidact does not stop at preparing Audacity for departure. He orders the ship to pass over the far side of the planet. Catalog is with him; two parts of the triad are with the Librarian.\u003c/p\u003e\n\u003cp\u003eBut the Ur-Didact is alone, on a continent set aside for primitive life-forms, its quietness, until now, undisturbed. The IsoDidact surveys the continent from space, then makes inquiries of a local tectonics monitor. The monitor is sluggish, preparing to power down for the long sleep this world will soon endure. But there has been no impact, of that it is certain.\u003c/p\u003e\n\u003cp\u003eThe IsoDidact finds his original on a long, sinuous island of ancient basalt. Great expanses of wort and moss and slime-molds flourish here, bathed in creeping mists, on the edges of a shallow sea where bacterial nodules and mats compete with stalk-rooted, pillow-frond forests; where the most primary, first-form animals creep through waters now lit by day and warmed by the sun, while night has returned to the river valley.\u003c/p\u003e\n\u003cp\u003eHere also is the only Precursor artifact on the entire planet, a circular, temple-like structure of no apparent purpose, perhaps half a billion years old. It is so small that only the most complete listings mention it. It consists of a ring of blunt, rounded towers rising from a flat and featureless base, mottled gray and white, covered in places by blankets of moss, though they draw no sustenance from its impassive surface.\u003c/p\u003e\n\u003cp\u003eWhile immobile and eternal, as all Precursor structures were, until now, this one has no apparent purpose; perhaps it once served as a kind of marker, a testimonial to a far-ranging expedition, or the foundation of some other structure long removed or decayed.\u003c/p\u003e\n\u003cp\u003eThe IsoDidact descends in a seeker and lands nearby. The Ur-Didact ignores the interruption, plodding through shallow, brackish ponds, toward the ring of towers, under the flowing and ever-present mist, an intruder in the peace. He squats before the artifact, clasping and unclasping his hands.\u003c/p\u003e\n\u003cp\u003eHis duplicate approaches across a low, mossy glade.\u003c/p\u003e\n\u003cp\u003eThe Ur-Didact acknowledges his presence. “Humans would have prayed to this,” he says. “Everywhere they found powers and forces, in oceans and rivers, in trees, in animals—even in rocks. Forerunners pray their sorts of prayers only to the Mantle. Who, then, is more deserving?”\u003c/p\u003e\n\u003cp\u003e“Why have you come here?” the IsoDidact asks.\u003c/p\u003e\n\u003cp\u003e“When we first met, Bornstellar, you were looking for treasure. Perhaps it’s here and we never recognized it.”\u003c/p\u003e\n\u003cp\u003e“Nothing’s changed here. We should return now.”\u003c/p\u003e\n\u003cp\u003e“You don’t sense it?” The Ur-Didact continues to stare at the ring of pillars. “This is how we will know they’re coming.” He turns and glares angrily. “What wisdom have you acquired, buried in my pattern, in the shape of my flesh? Am I to be set aside, and you, no doubt screaming under all that pattern, perhaps hope to return to what you were? Or do you find this pattern more suitable—and hope to replace me?”\u003c/p\u003e\n\u003cp\u003e“The Lifeshaper and I have work to finish. And so do you. There are no plans to set you aside.”\u003c/p\u003e\n\u003cp\u003e“You still can’t read her as well as I. She is stubborn, brilliant as a nova, dark as a singularity, with infinite depths. I’ve never discovered the core of her emotions, her self. I wonder what her duplicate would be like, what it would feel like to wear her imprint. To so many species she has made herself like unto a god, that they will remember her, that she can manipulate them in future times. She’s explained that to you, hasn’t she?”\u003c/p\u003e\n\u003cp\u003e“I remember.”\u003c/p\u003e\n\u003cp\u003e“Second-hand memory!” The Ur-Didact rises and stretches out his armor. The hard light sparks with emotion. “You’re a poor copy at best, aren’t you?”\u003c/p\u003e\n\u003cp\u003eCatalog is concerned that the long conflict may now turn physical.\u003c/p\u003e\n\u003cp\u003eThe Ur-Didact approaches his duplicate.\u003c/p\u003e\n\u003cp\u003eThey stand barely separated by the reach of their great arms, surrounded by the swirling mist, the sough of the light breeze, the rhythmic lap of wavelets.\u003c/p\u003e\n\u003cp\u003e“There is no hope, continuing with your strategy, not in our time, not in this galaxy,” the Ur-Didact says. “That is a cold, simple fact.”\u003c/p\u003e\n\u003cp\u003e“I hold another opinion.”\u003c/p\u003e\n\u003cp\u003e“Your privilege … Manipular.” The Ur-Didact’s expression is disdainful. “The Halos? Violating the Mantle all over again, with even greater destruction! Wiping out all intelligent life across this galaxy! By itself that proves you are a poor version. You’ve altered your strategic vision.”\u003c/p\u003e\n\u003cp\u003e“According to circumstance, as every commander must.”\u003c/p\u003e\n\u003cp\u003e“Don’t you feel the truth of it? We gave the Precursors reason to retreat into madness. A passion for vengeance. And the Gravemind gave it all right back to me. I am filled with that passion, that madness, that poison! If we fire Halo, we lose everything.”\u003c/p\u003e\n\u003cp\u003eThe two Didacts stand opposite each other, barely moving, barely breathing, as if sizing each other up. Their armor is evenly matched. Their weapons are identical, their defenses, identical.\u003c/p\u003e\n\u003cp\u003eBut the Didacts themselves—no longer identical.\u003c/p\u003e\n\u003cp\u003e“I leave the Lifeshaper to you, Bornstellar,” the Ur-Didact says. “She has obviously chosen your way, not mine. I will take my own ship and you will show me where the Ark has been hidden.”\u003c/p\u003e\n\u003cp\u003eCatalog is taking sides, and should not, but the rule of law, for Juridicals, is that hope must never be lost, justice and balance never abandoned. The Mantle, after all, is about the diversity and eternal prospect of living change in a universe filled with life! Is that no longer true? Is this what Catalog felt, facing the Gravemind—a total consumption of alien reason, of ancient, mad hopelessness?\u003c/p\u003e\n\u003cp\u003eAnd then it happens.\u003c/p\u003e\n\u003cp\u003eThere is a soft, liquid sound from the center of the island. Both turn to see what it might be. The artifact, the circle of blunted towers, is moving. The towers extend, connect, form a nested cage. The base expands.\u003c/p\u003e\n\u003cp\u003e“The Flood,” the Ur-Didact says. “We have to leave now!”\u003c/p\u003e\n\u003cp\u003eThrough low gray clouds, we witness another change—in the skies above the planet. Arc by arc, curve by curve, star roads appear where none were before, surrounded by a purple fringe of Precursor superluminal passage—a kind of motion, of travel, not seen for ten million years, but now apparent around the ecumene, perhaps across the galaxy.\u003c/p\u003e\n\u003cp\u003eThen, something screams down from the sky—a single mottled gray and white ovoid ten meters long. It plunges upright into shallow water, shooting out a spray of steam and burying one end in the muck, while the other end is already dissolving.\u003c/p\u003e\n\u003cp\u003e“Spore capsule!” the IsoDidact says. “No time remains.”\u003c/p\u003e\n\u003cp\u003eThe two Didacts agree at least on this.\u003c/p\u003e\n\u003cp\u003eFor the last time, the two Didacts stand barely a long arm’s length apart and then, slowly, back away, neither turning, before they are many paces separated—to return to their separate craft, to rise to orbit in separate ships.\u003c/p\u003e\n\u003cp\u003eCatalog is refused entry into the Ur-Didact’s sphinx. Something is wrong.\u003c/p\u003e\n\u003cp\u003eEven as we pick up the Librarian, prepare to rise to Audacity, and witness Mantle’s Approach climb up behind us, matching our destination vector—the air is pierced by a plunging haze of millions of spore capsules. Some drop into ocean or land, more yet explode high in the atmosphere. Spore clouds tower into gray-brown thunderhead plumes, then fan out in winding drifts, dominating, covering, concealing.\u003c/p\u003e\n\u003cp\u003eThe triad of Catalog can do nothing but observe. And what I observe, far below, is the clearing of the brownish-gray clouds, revealing a warty formation of spore mountains. Any organisms remaining will soon be absorbed by the Flood.\u003c/p\u003e\n\u003cp\u003eAudacity has determined there is enough local potential that it can carry us all swiftly to the margins of Thema 34 before making the final jump to the greater Ark. Keyships will soon be the only vessels allowed to approach the installation.\u003c/p\u003e\n\u003cp\u003eThe IsoDidact and the Librarian link arms on the bridge. “He’s coming to the Ark with us,” he tells her.\u003c/p\u003e\n\u003cp\u003eShe appears stricken, uncertain, lost. “What are his plans now? To sit in his fortress like a trapdoor spider, so that he can leap out and destroy ages from now?”\u003c/p\u003e\n\u003cp\u003e“You don’t know that.”\u003c/p\u003e\n\u003cp\u003e“Don’t I? I see it so clearly! Oh, what did that thing do to him—what have we all done to him?”\u003c/p\u003e\n\u003cp\u003eThe IsoDidact says nothing.\u003c/p\u003e\n\u003cp\u003eAs we leave the blighted system, the silence on Audacity is awful.\u003c/p\u003e\n\u003cp\u003eSTRING 27\u003c/p\u003e\n\u003cp\u003eJOURNEY TO THE GREATER ARK\u003c/p\u003e\n\u003cp\u003eTHE ARK NO longer makes Halos and now serves as the Librarian’s main repository for specimens. It is rumored that only a single Halo remains, that the others have been hunted down and destroyed by the Flood.\u003c/p\u003e\n\u003cp\u003eThis much I am told by the IsoDidact as we watch our passage into slipspace. But in truth, nobody knows the present situation, communications being so very difficult.\u003c/p\u003e\n\u003cp\u003eCatalog is particularly susceptible to unease during a jump, but this is a beautifully executed transit, and I feel hardly any discomfort. Nevertheless, the IsoDidact is tense.\u003c/p\u003e\n\u003cp\u003eThe borders of Forerunner themas are marked by large-scale galactic magnetic fields, convenient if somewhat fluid indicators. These fields show up in Audacity’s displays as undulating curtains of green and purple, not unlike aurora in a planetary atmosphere. They seem as sensitive as the bells of jellyfish in the Librarian’s tidal sea. Though infinitely slower and far more majestic, they still seem to possess a reactive kind of life.\u003c/p\u003e\n\u003cp\u003eCatalog is not immune to beauty. I have seen much beauty in the last year; the beauty of living things in the Librarian’s care, the courage displayed by the Librarian and the IsoDidact while facing insurmountable odds.\u003c/p\u003e\n\u003cp\u003eWe watch the changing patterns from slipspace: the displays designed to simplify hugely complex variables down to their most important components. To me, the flowing curtains of purple and green still seem beautiful, but to the IsoDidact and Audacity the changing hues and increasingly complex vortices point to looming difficulties. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-silentium-the-forerunner-saga-3/page-19.html","bookId":1630,"creation":"Oct 5, 2019 6:20:36 PM","modification":"Oct 5, 2019 6:20:36 PM"}
