{"id":89906,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Sad, very sad,” Andrew said.\u003c/p\u003e\n\u003cp\u003e“Right. Thank God corruption no longer exists,” Jude said.\u003c/p\u003e\n\u003cp\u003e“Hey!” Andrew protested. “We’ve come a long way.”\u003c/p\u003e\n\u003cp\u003e“Yes, we have. But, then again, as human beings, it seems that we haven’t come so far.” He hesitated. “Look at the victim we found today,” he said quietly. “And I don’t believe that we’ve unearthed the body or soul of Jonathan Black and that he’s terrorizing Lower Manhattan. There’s someone out there, a psychotic but organized killer, with an agenda.”\u003c/p\u003e\n\u003cp\u003e“Agreed—but what if he is someone who knows all the history of the area?” Whitney asked. “Someone who is working to re-create the crimes.”\u003c/p\u003e\n\u003cp\u003e“Angus Avery seems to know all about it,” Jude said.\u003c/p\u003e\n\u003cp\u003e“And this will give his movie more publicity than money could ever buy,” Andrew noted.\u003c/p\u003e\n\u003cp\u003eDon’t argue with the man! Whitney warned herself.\u003c/p\u003e\n\u003cp\u003eJude wanted to bring her back to Blair House after dinner; she didn’t have to stay up with him. He was just going to make the proper calls to assure himself that Angus Avery had indeed spoken at a dinner that took place in Midtown, and talk with the driver who had been assigned to get him around the city. He was going to have records pulled on the major players in the movie, and also get an interview with the ex-cop who had last been on duty at the site.\u003c/p\u003e\n\u003cp\u003e“I don’t do shift work—I’m here to work the case,” Whitney told him.\u003c/p\u003e\n\u003cp\u003e“I know. I’ll pick you up at seven-thirty for the task force meeting,” he assured her. “I’m on to paperwork and phone work, mundane telephone stuff. There’s no reason for you not to settle in and get some sleep.”\u003c/p\u003e\n\u003cp\u003eWhen they arrived at Blair House, though, he hesitated in the car.\u003c/p\u003e\n\u003cp\u003eThey’d passed several patrol cars—the police were making their presence known in the area.\u003c/p\u003e\n\u003cp\u003eBut Blair House was dark, except for the slender porch light, and the street lamps illuminating the construction site were sadly lacking in strength.\u003c/p\u003e\n\u003cp\u003e“Hey, I’m not afraid of the dark,” she told him.\u003c/p\u003e\n\u003cp\u003e“Maybe you should be.”\u003c/p\u003e\n\u003cp\u003eWhitney grinned. “You don’t believe in ghosts, and they’re not going to bother me. And if there’s a real human threat, remember, I have a gun, and I know how to use it.”\u003c/p\u003e\n\u003cp\u003e“No one is ever invulnerable,” he said.\u003c/p\u003e\n\u003cp\u003e“I’m all right, really,” she assured him.\u003c/p\u003e\n\u003cp\u003eAs she was about to get out of the car, she felt her phone buzz. She paused to see the message she was receiving.\u003c/p\u003e\n\u003cp\u003eWhitney sucked in her breath.\u003c/p\u003e\n\u003cp\u003e“What?” Jude asked her.\u003c/p\u003e\n\u003cp\u003eShe passed him the phone. There was a likeness on the screen. “I know you have police artists, and that they’ve surely worked with what you have. But Jake Mallory is really a technical wizard. He’s worked every angle of the pictures I’ve sent him, and this is the likeness he has created from ‘Jane Doe wet’ that I sent him today.”\u003c/p\u003e\n\u003cp\u003eJude stared at the image. “You’ve got a computer in the house?”\u003c/p\u003e\n\u003cp\u003e“Of course. And I have a mobile broadband card, so we can connect anywhere you like.”\u003c/p\u003e\n\u003cp\u003eHe seemed to be appraising her with new eyes; she had proven that the team might just be of use.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eShe still had all the keys for the team on the band that the driver had given her, and it took her a minute to open the gate and then the front door to the house. Once inside, she told him that it would take her a minute to set up her computer, but he assured her that it was no problem. She moved quickly, racing upstairs to the room she had chosen, hurrying back down and finding that she could easily set up in the broad hallway at an old desk situated below the stairs. In another minute, she had the image on the large screen, and it was so good that it looked like a photograph. Jake had sent her a note next to the image: Naturally, don’t know about eye color, but from what you sent, computer said her hair was brown. Hope this helps; see you tomorrow.\u003c/p\u003e\n\u003cp\u003eJude leaned over her shoulder, staring at the image on the screen. The woman pictured appeared to be in her mid-thirties. She looked a little the worse for wear, as if she had spent long years abusing alcohol or drugs.\u003c/p\u003e\n\u003cp\u003e“Just about thirty-five,” Jude said as if reading her thoughts. “That’s the age Fullbright estimated as well.” He looked at her. His face was close; the lamplight gave his skin a bronze cast. She felt a little tremor shoot through her. She liked his face. She wished that she didn’t.\u003c/p\u003e\n\u003cp\u003e“Our next step,” he told her, “was going to be to remove the head, dissolve the flesh—Fullbright likes maggots, actually—and then send the skull to a woman down at the Smithsonian. But…may I?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eShe stood, letting him take the chair at the desk. She watched as he emailed the likeness to someone, typing, “I know it’s late. Use any newspaper contact. I need this out there—neighborhood websites, flyers, too. Copy should just read, ‘Do you know this woman?’”\u003c/p\u003e\n\u003cp\u003eA second later, he got his reply. “On it, Jude. Not too late. I can get it in for tomorrow morning.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry to bother you now.”\u003c/p\u003e\n\u003cp\u003e“Hey, I was up. I’ve kind of got a guy, Jude. We have coffee. We chat. Who knows… I was on the phone with him when you emailed.”\u003c/p\u003e\n\u003cp\u003e“Good for you, girl.”\u003c/p\u003e\n\u003cp\u003e“But don’t worry—I’m always your girl first, Jude.”\u003c/p\u003e\n\u003cp\u003eJude replied, “You’re a good egg, Hannah.”\u003c/p\u003e\n\u003cp\u003e“I’m the best.”\u003c/p\u003e\n\u003cp\u003eHe eased back in the chair, and then sat forward again, emailing the likeness to himself. Then he rose, looking at her strangely. “Thanks. Yes, we’ve had some sketches done. But…this is—detailed. It’s as if she could walk off the page. I don’t know if we can find out who she was, and if we do, if that can help us catch her killer, but…hey. Everyone deserves a burial, and no one deserves to die like that.”\u003c/p\u003e\n\u003cp\u003eWhitney nodded. “Sure. I agree.”\u003c/p\u003e\n\u003cp\u003eShe felt as if they shared a bizarrely awkward moment. He had discovered that he didn’t dislike her and she just might be useful.\u003c/p\u003e\n\u003cp\u003eShe had just discovered that she liked way too much about him.\u003c/p\u003e\n\u003cp\u003e“Listen, I have a two-bedroom place in Hell’s Kitchen and you’re more than welcome to come back with me. I’d appreciate it, actually. I don’t like thinking about you down here by yourself.”\u003c/p\u003e\n\u003cp\u003e“You live in Hell’s Kitchen, too?” she asked him.\u003c/p\u003e\n\u003cp\u003eHe laughed. “The apartment next to my father. He was bright enough to buy when things went co-op a couple of decades ago, and I just pay him a minimum rent—his pleasure money, as he calls it. I think he charges me because he knew I wouldn’t accept the place if I didn’t pay him something. And, hey, I’m sure he’d be happy to have you for the night, too.”\u003c/p\u003e\n\u003cp\u003eShe was tempted. Really tempted. She wasn’t afraid of Blair House, or of being alone. She was afraid that the more she was with him, the more she liked him, and the more she was close to him, the more she realized that he was really an attractive man—and she was attracted to him. Not a good thing on the first day of a new investigation.\u003c/p\u003e\n\u003cp\u003eWhitney certainly had no desire to appear to be afraid just to be with him—or anyone.\u003c/p\u003e\n\u003cp\u003eAnd he probably didn’t understand that she needed to be in the house by herself for the night.\u003c/p\u003e\n\u003cp\u003e“I’m all right, honestly. Like I told you earlier, I’m not the fearful type. And I have some work to do tonight. I have to decide where I think we’ll need our camera equipment, and just what we may want to film or record on tape…”\u003c/p\u003e\n\u003cp\u003eHe stared at her blankly.\u003c/p\u003e\n\u003cp\u003e“We always keep track of what happens around us,” she said. “And, of course, we’ll want to watch the property next door.”\u003c/p\u003e\n\u003cp\u003eHe still stared at her.\u003c/p\u003e\n\u003cp\u003e“Oh. For shadows and ghosts and things?” he asked. His tone was polite.\u003c/p\u003e\n\u003cp\u003e“For anything that’s going on,” she said. “Trust me—it’s good.”\u003c/p\u003e\n\u003cp\u003e“I believe you.”\u003c/p\u003e\n\u003cp\u003e“Good. And I’m okay, really. I’m not a fool.”\u003c/p\u003e\n\u003cp\u003eHe smiled, and it was a real smile.\u003c/p\u003e\n\u003cp\u003e“Maybe not staying here would make you the intelligent type,” he told her.\u003c/p\u003e\n\u003cp\u003eShe grinned at that. “Thank you. Sincerely, thank you. But I have a phone. There are cruisers in the street tonight. I’m not going back out, and I’ll sleep with my gun under my pillow.”\u003c/p\u003e\n\u003cp\u003eHe nodded; her words were rational.\u003c/p\u003e\n\u003cp\u003e“All right, then. I’ll be here at seven-thirty, sharp. You need a wake-up call or anything?”\u003c/p\u003e\n\u003cp\u003eShe laughed at that. “No, but thanks again. I have an alarm on my phone. I’ll be fine. Honestly.”\u003c/p\u003e\n\u003cp\u003eShe walked him to the door. “Good night, and…”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003eHe hesitated just a minute, gray eyes guarded. “I look forward to meeting the rest of your team.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said.\u003c/p\u003e\n\u003cp\u003eAgain, the moment felt slightly awkward; almost as if they’d been on a strange date all day.\u003c/p\u003e\n\u003cp\u003eShe made sure he heard her sliding the bolts on the front door as he left, and she watched through one of the etched-glass windows in the door as he walked back out to his car.\u003c/p\u003e\n\u003cp\u003eWhen he was gone, Whitney walked through the house, leaving the large hallway light on as she wandered the downstairs. She could well imagine that it would be a fine tourist attraction when the renovations were done.\u003c/p\u003e\n\u003cp\u003eShe didn’t have any of the equipment; that would arrive with the others. But it would be good to have a sense of where she wanted cameras and recording devices.\u003c/p\u003e\n\u003cp\u003eUpstairs, Whitney took stock of the bedrooms. There were six of them, and everything in the house seemed to be proportionate. Three on one side, three on the other.\u003c/p\u003e\n\u003cp\u003eShe paused at a window that overlooked the construction site next door. The book she read that day had shown pictures of the structure that had been there when it had been the House of Spiritualism; then, a two-story building with a circular porch had stood. The steeple was still standing toward what had been the rear of the structure. People had entered from the same sidewalk that led to the path to Blair House. \u003c/p\u003e","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-14.html","bookId":2277,"creation":"Oct 5, 2019 5:39:15 PM","modification":"Oct 5, 2019 5:39:15 PM"}
