{"id":89941,"no":49,"title":"Page 49","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe sound of the pickaxes striking hard brick seemed loud in the night. Jude felt his shoulders bunch and his muscles burn as he heaved hard and hit brick, and then brick again.\u003c/p\u003e\n\u003cp\u003eAnd then, something soft. He paused; the others had paused as well, hearing a hollowlike sound of emptiness.\u003c/p\u003e\n\u003cp\u003eHe fell to his knees, digging at the mortar and earth around the bricks. The others were down beside him; they looked like a group of pups themselves, searching for a bone.\u003c/p\u003e\n\u003cp\u003eNothing, just dirt, and more dirt.\u003c/p\u003e\n\u003cp\u003e“Keep going, please!” Whitney urged.\u003c/p\u003e\n\u003cp\u003e“Get the whisks from the other side,” Angela suggested.\u003c/p\u003e\n\u003cp\u003eThe others stepped back while Jude and Whitney carefully dusted away at the dirt. They came to the remnants of a large pine box and pulled it away.\u003c/p\u003e\n\u003cp\u003eJude sat back on his haunches, stunned.\u003c/p\u003e\n\u003cp\u003eThey hadn’t found another victim.\u003c/p\u003e\n\u003cp\u003e“It’s Jonathan Black,” Whitney said. “The man who probably killed Carrie Brown, and made the world wonder if the Ripper had come to New York.”\u003c/p\u003e\n\u003cp\u003eThere, in a little cache that had been protected by the pine, lay another skeleton. A crushed stovepipe hat lay halfway over the disarticulated skull. Remnants of a cloak, vest and shirt seemed glued to bone by dark matter.\u003c/p\u003e\n\u003cp\u003eWhitney reached for a chain that lay around the neck.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Jude asked her, grabbing her arm.\u003c/p\u003e\n\u003cp\u003e“It’s gone,” she said.\u003c/p\u003e\n\u003cp\u003e“What’s gone?” he asked her.\u003c/p\u003e\n\u003cp\u003eShe looked at him. “Our killer was obsessed with Jonathan Black. He discovered where the cultists buried him when he went so berserk they were terrified of him themselves. The killer found the grave site, and he took the relic—the supposed finger bone of Gilles de Rais—for his own. He thinks it gives him power. The power of evil—or of Satan.”\u003c/p\u003e\n\u003cp\u003eJude was still puzzled. “Don’t touch anything,” Jude said. “Maybe…maybe here he left a trace.”\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eIt seemed that their nights were destined to be long.\u003c/p\u003e\n\u003cp\u003eOnce again, scores of people were quickly called out.\u003c/p\u003e\n\u003cp\u003eThe crime scene unit, let by Judith Garner, arrived, along with the anthropologists and the historians; evidence was sought while the historical scientists tried to preserve the integrity of the find. Jude had to control his impatience—he understood the importance of discovery for the sake of history, society and life to come.\u003c/p\u003e\n\u003cp\u003eHe stepped in when Judith argued with one of the historians.\u003c/p\u003e\n\u003cp\u003e“Crime scene unit first,” insisted Jude.\u003c/p\u003e\n\u003cp\u003eTurning, he realized that Deputy Chief Green was on-site himself. He nodded, agreeing with Jude’s action.\u003c/p\u003e\n\u003cp\u003e“I don’t think there’s anything more you can do here, Jude,” Green told him. “And you look like hell—you should get some sleep. We’ve got more units from the FBI following up on the massive number of people to be interviewed, regarding all the victims. We have people on this, Jude. You’re still lead, but you have to let others do more of the legwork. Right now, I want you at the station. I want a thorough report regarding this situation tonight. Then, I’m ordering you to go home. Don’t show your face again for at least ten hours, do you understand?”\u003c/p\u003e\n\u003cp\u003eHe opened his mouth to protest, and then he realized that Green was right; he would be worthless if he didn’t get some sleep.\u003c/p\u003e\n\u003cp\u003eHe walked over to where Whitney stood with her team, watching the proceedings. “I’ve been ordered to headquarters, and then to bed,” he said dryly.\u003c/p\u003e\n\u003cp\u003e“Jude,” Jackson asked him, “you keep files and notes at home as well, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Of course. My files can be accessed from the station or my apartment,” he said.\u003c/p\u003e\n\u003cp\u003e“The one thing we’re not up to speed on is the state of your investigation when you had your first two victims—Sarah Larson and Jane Doe dry,” Jackson said. “I thought I’d have you bring Whitney with you. When you’re finished at the station, you two can sift through those notes and see if there’s something that might be pertinent now that we’re sure the murders are connected.”\u003c/p\u003e\n\u003cp\u003e“We really weren’t certain that they were connected—until the third murder,” Jude said.\u003c/p\u003e\n\u003cp\u003e“I’m too restless to sleep right now,” Whitney said. “It’s still the middle of the night. Jackson needs to get some sleep because he’ll have to coordinate with the other FBI units tomorrow, Will and Jake are going to stay on the screens and research and Angela will watch over the dig here. Maybe I can be of use going through your old notes.”\u003c/p\u003e\n\u003cp\u003e“I’ll drop you off on the way to the station,” Jude told Whitney.\u003c/p\u003e\n\u003cp\u003eBefore he left, he walked back to speak with Judith Garner. “Judith—”\u003c/p\u003e\n\u003cp\u003e“Jude,” she said patiently, “I know. Call you if I get anything at all. Well, we’ll have all kinds of trace from the hole, I believe, but it will take time.” She set a hand on his shoulder. “For a hot young man, you look like a dead rat the cat dragged in. You have to accept it—you cannot work this alone. And none of us can stop crime from happening.”\u003c/p\u003e\n\u003cp\u003e“Judith, we have to stop the next murder,” he said.\u003c/p\u003e\n\u003cp\u003e“We,” she told him. “Don’t take this all on yourself. I have a night team working away on fingerprints on that hundred, so just maybe—it’s a long shot—but maybe we’ll get a hit on someone, a print that matches up to a suspect, new or old.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Judith.”\u003c/p\u003e\n\u003cp\u003eHe left her, and Whitney joined him as they moved off from the site and headed down the walkway to the other side of the block, where he’d left his car.\u003c/p\u003e\n\u003cp\u003e“You can find your way around the computer room, right? I’ll make sure you have all my access codes, and you can also go through the folders. I have tapes from interviews and hand-written notes in there.”\u003c/p\u003e\n\u003cp\u003e“I’ll manage fine,” Whitney assured him.\u003c/p\u003e\n\u003cp\u003eHe was still uneasy, though Whitney did carry a gun. Besides, no matter how special their team might be, she wouldn’t officially be FBI if she hadn’t passed strict standards on the target range.\u003c/p\u003e\n\u003cp\u003eAt his apartment, he left the car in the street and walked her up to his door. He made a thorough search of the place.\u003c/p\u003e\n\u003cp\u003eAllison purred, standing by Whitney’s ankles as she watched him. “What are you doing?” Whitney asked. “Being paranoid.”\u003c/p\u003e\n\u003cp\u003eHe walked back to her, taking her shoulders and keeping his distance. “Whitney, what the hell happened tonight?”\u003c/p\u003e\n\u003cp\u003eHe saw something pass through her eyes. “I guess I figured out something that I’d read somewhere,” she said.\u003c/p\u003e\n\u003cp\u003e“You’re lying.”\u003c/p\u003e\n\u003cp\u003eHer head fell back, and she offered him a rueful smile. “You won’t believe the truth,” she told him. “And then again, maybe it is the truth—I read something, and it registered in my subconscious mind.”\u003c/p\u003e\n\u003cp\u003e“What is the truth—as you see it?” he demanded. “Whitney, please, don’t lie to me.”\u003c/p\u003e\n\u003cp\u003eShe looked at his face for a long moment. She was almost sad when she spoke at last, as if there was no choice but to say goodbye to a loved one. “There’s a ghost dog that seems to like me. He belonged to Annie Doherty, one of Jonathan Black’s victims. He apparently loved his mistress—he’s trying to help us. Actually, I see the ghosts of the victims, too, but they’re silent.”\u003c/p\u003e\n\u003cp\u003eHe stepped away, chills racing along his spine again. Was it true? Was it possible? He couldn’t accept it.\u003c/p\u003e\n\u003cp\u003eAnd yet, he’d heard the barking of the dog that night at the site, and then all the local dogs had set up howling, as if in kindred spirit.\u003c/p\u003e\n\u003cp\u003e“I’m going to get through the report as quickly as I can,” he said. His voice sounded hollow.\u003c/p\u003e\n\u003cp\u003e“You don’t believe me,” she said simply.\u003c/p\u003e\n\u003cp\u003e“I—I don’t know what I believe. It doesn’t matter what I believe. It matters that we find the killer. I’ll be back as soon as I can.”\u003c/p\u003e\n\u003cp\u003e“Jude, you’re blaming yourself for all this,” she said. “You can’t do that.”\u003c/p\u003e\n\u003cp\u003eHe headed for the door, and then turned back. “Lock yourself in.”\u003c/p\u003e\n\u003cp\u003e“You are paranoid.”\u003c/p\u003e\n\u003cp\u003e“Yes. There are three bolts on the front door. Lock them all. There’s only one bolt on each of the windows, but I’ve checked them all. And, of course, my father is right next door.”\u003c/p\u003e\n\u003cp\u003e“Right,” she said, staring at him.\u003c/p\u003e\n\u003cp\u003eHe looked at her for one more minute, and then he turned and headed out the door.\u003c/p\u003e\n\u003cp\u003eWhitney felt as if she had been deflated. She had never felt about anyone the way she felt about Jude. Never. It had happened so quickly, and yet, it even seemed as if she knew him as she had never known anyone before. He was so intense. Honorable, reasonable… She loved the way his mind worked, she loved watching him when he was trying to be patient, and she even loved it when he felt he knew what was right or wrong, and bullied on in with his thoughts, opinions or actions.\u003c/p\u003e\n\u003cp\u003eAnd now he thought that she was a crazy woman, haunted by a dog.\u003c/p\u003e\n\u003cp\u003eHe probably thought now too that every horrible twist the movies had accredited to voodoo was true. Maybe he was beginning to wonder if she kept a dozen constricting snakes somewhere to dance with in rituals, too, and enjoyed sticking pins in dolls as a pastime.\u003c/p\u003e\n\u003cp\u003eShe gave herself a stern mental shake. What anyone believed right now was of no importance, unless it pertained to the case.\u003c/p\u003e\n\u003cp\u003eShe sat down at Jude’s computer desk and keyed in his file code, bringing up the notes on Sarah Larson. She found herself smiling sadly as she read them. He had interviewed everyone on the waterfront, he’d gone through the Port Authority. There had been no way to trace the woman’s movements because no one had known who she was.\u003c/p\u003e\n\u003cp\u003eShe closed the file and opened the one on Jane Doe dry—the girl who was still unidentified, despite the fact that her picture had run in the newspapers and on television screens. How had she come to the city without anyone knowing or caring?\u003c/p\u003e\n\u003cp\u003eThe world could be horrible, sad and cruel!\u003c/p\u003e\n\u003cp\u003eShe’d arrived at the hospital, dripping and bleeding, from massive wounds. Unlike the other victims, she had been sexually assaulted. She had never spoken; she’d died en route. \u003c/p\u003e","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-49.html","bookId":2277,"creation":"Oct 5, 2019 5:39:15 PM","modification":"Oct 5, 2019 5:39:15 PM"}
