{"id":110773,"no":17,"title":"Page 17","content":"\u003cp\u003eAs on any other morning, his lids fell back, his eyes opened. For a moment he stared up blankly, his mind still thick with sleep. Then he remembered and his heart seemed to stop. With a startled grunt, he jolted up to a sitting position and looked around incredulously, his mind alive with one word:\u003c/p\u003e\n\u003cp\u003eWhere?\u003c/p\u003e\n\u003cp\u003eHe looked up at the sky, but there was no sky, only a ragged blueness, as if the sky had been torn and stretched and squeezed and poked full of giant holes, through which light speared. His wide, unblinking gaze moved slowly, wonderingly. He seemed to be in a vast, endless cavern. Not far over to his right the cavern ended and there was light. He stood up hastily and found himself naked. Where was the sponge?\u003c/p\u003e\n\u003cp\u003eHe looked up again at the jagged blue dome. It stretched away for hundreds of yards. It was the bit of sponge he\u0027d worn.\u003c/p\u003e\n\u003cp\u003eHe sat down heavily, looking over himself. He was the same. He touched himself. Yes, the same. But how much had he shrunk during the night?\u003c/p\u003e\n\u003cp\u003eHe remembered lying on the bed of leaves the night before, and he glanced down. He was sitting on a vast plain of speckled brown and yellow. There were great paths angling out from a gigantic avenue. They went as far as he could see.\u003c/p\u003e\n\u003cp\u003eHe was sitting on the leaves.\u003c/p\u003e\n\u003cp\u003eHe shook his head in confusion.\u003c/p\u003e\n\u003cp\u003eHow could he be less than nothing?\u003c/p\u003e\n\u003cp\u003eThe idea came. Last night he\u0027d looked up at the universe without. Then there must be a universe within, too. Maybe universes.\u003c/p\u003e\n\u003cp\u003eHe stood again. Why had he never thought of it; of the microscopic and the submicroscopic worlds?\u003c/p\u003e\n\u003cp\u003eThat they existed he had always known. Yet never had he made the obvious connection. He\u0027d always thought in terms of man\u0027s own world and man\u0027s own limited dimensions. He had presumed upon nature. For the inch was man\u0027s concept, not nature\u0027s. To a man, zero inches meant nothing. Zero meant nothing. But to nature there was no zero. Existence went on in endless cycles. It seemed so simple now. He would never disappear, because there was no point of non-existence in the universe. It frightened him at first. The idea of going on endlessly through one level of dimension after another was alien.\u003c/p\u003e\n\u003cp\u003eThen he thought: If nature existed on endless levels, so also might intelligence. He might not have to be alone.\u003c/p\u003e\n\u003cp\u003eSuddenly he began running toward the light.\u003c/p\u003e\n\u003cp\u003eAnd, when he\u0027d reached it, he stood in speechless awe looking at the new world with its vivid splashes of vegetation, its scintillate hills, its towering trees, its sky of shifting hues, as though the sunlight were being filtered through moving layers of pastel glass.\u003c/p\u003e\n\u003cp\u003eIt was a wonderland.\u003c/p\u003e\n\u003cp\u003eThere was much to be done and more to be thought about. His brain was teeming with questions and ideas and yes, hope again. There was food to be found, water, clothing, shelter. And, most important, life. Who knew? It might be, it just might be there.\u003c/p\u003e\n\u003cp\u003eScott Carey ran into his new world, searching.\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/the-incredible-shrinking-man/page-17.html","bookId":2544,"creation":"Oct 6, 2019 12:07:53 AM","modification":"Oct 6, 2019 12:07:53 AM"}
