{"id":101052,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWe were trapped in a hideous nightmare.\u003c/p\u003e\n\u003cp\u003e“Father, we must leave,” I whispered. “Please, Father, we need to leave.”\u003c/p\u003e\n\u003cp\u003e“I know, Glynis. I know. Damn it all, Ovidiu, get this carriage moving!”\u003c/p\u003e\n\u003cp\u003eOvidiu’s dark face appeared at the window, his eyes wide with fear. “The fire, Lord Edric, it is the devil’s fire. The horses will not go near it!”\u003c/p\u003e\n\u003cp\u003eEven though his face remained stoic, Father’s eyes clearly revealed how frightened he truly was. “Then we leave on foot!”\u003c/p\u003e\n\u003cp\u003e“Oh, Edric!”\u003c/p\u003e\n\u003cp\u003e“It is the only way, Antoinetta. Girls, gather only what you can carry and move swiftly.”\u003c/p\u003e\n\u003cp\u003eFather thrust open the carriage door and began to step down as we hurriedly grabbed up our things and prepared to flee.\u003c/p\u003e\n\u003cp\u003eThe great door to the castle swung open. Dark gypsy men poured out, torches held high. They quickly encircled the carriage, their eyes menacing. The torches crackled and popped as they threw menacing shadows across the face of the castle.\u003c/p\u003e\n\u003cp\u003e“Edric,” Mother whispered, her hand grasping his arm.\u003c/p\u003e\n\u003cp\u003ePrince Vlad swept out of the castle, his long black coat flaring out about him. I could feel tendrils of dark power pulling on me as reluctantly my gaze was drawn to him. His long auburn hair fell down his back in thick curls and his mustache was longer, the ends pointed downward at the corners of his cruel mouth. His flesh seemed unearthly pale and his green eyes flickered with light as cat’s eyes do. He smiled a fiendish smile and I saw clearly two long teeth.\u003c/p\u003e\n\u003cp\u003e“Father!” I gripped his arm tightly.\u003c/p\u003e\n\u003cp\u003e“I see,” my father whispered.\u003c/p\u003e\n\u003cp\u003e“Welcome home, my bride,” Prince Vlad said throwing out his arms. He laughed low in his throat, enjoying the sight of us cowering in the carriage behind my father.\u003c/p\u003e\n\u003cp\u003e“You monster! What sorcery did you use to bring us here?” Mother was trembling with rage and fear. “We are Christian people!”\u003c/p\u003e\n\u003cp\u003e“We are citizens of the British Empire,” Father said in a low voice. “To treat us in this manner is barbaric. You are a monster, sir, a monster.”\u003c/p\u003e\n\u003cp\u003ePrince Vlad seemed amused by my parents’ outbursts. “I have been called a monster many a time before, Earl Wright, dear Countess. I find it to be a compliment to my power. I do not care if you are Christian people. I, too, once served the Church. I was once a defender of the faith.” As he spoke, his voice became lower, harsher. “But those days are long past. I do have every right to do with you as I please. This is my country. My land.” Vlad’s eyes flashed a deep red as they narrowed, his posture becoming threatening. He regarded my parents with disdain. “You were guests in my house. I offered you my hospitality, yet you denied me what I desire.”\u003c/p\u003e\n\u003cp\u003ePrince Vlad’s eyes flicked to me, and I shrank back from his potent gaze.\u003c/p\u003e\n\u003cp\u003e“You cannot coerce me to give you my daughter’s hand!”\u003c/p\u003e\n\u003cp\u003ePrince Vlad chuckled, stroking his mustache slowly. “Ah, Edric, your words mean nothing me. We are in my country. I rule here. I have the power of life and death in this land.” Vlad’s menacing laughter rang out. “And I will have what I desire. Come to me, Glynis.”\u003c/p\u003e\n\u003cp\u003eTrembling with fear, I looked upon him and began to weep. His voice had resounded within me, calling me to him. I could feel my body struggling to rise.\u003c/p\u003e\n\u003cp\u003e“No!” My mother screamed, clutching me to her. “You cannot have her! Never!”\u003c/p\u003e\n\u003cp\u003eFather pressed me back behind him as he blocked the carriage doorway.\u003c/p\u003e\n\u003cp\u003eI felt as if my breath was leaving me, and I could feel my body coiling to fight him. I covered my face with my hands as I felt his power continue to pull on me. I was doomed and knew it.\u003c/p\u003e\n\u003cp\u003e“I asked you before with proper respect for your rank for your daughter’s hand in marriage. I asked you to leave her here as my bride. You ungraciously refused me and denounced my position as lowly. But now you will see my power. I have brought you here with my will. It was my power that drew you. And now, Edric, you have damned your family, and you shall never leave alive.”\u003c/p\u003e\n\u003cp\u003eMy father was stunned for a moment, then he shouted, “You cannot do this!”\u003c/p\u003e\n\u003cp\u003eWe cowered behind him, in a heap of silk petticoats, crying and holding each other tightly. I embraced my sister and mother with all my strength, ignoring the sickening pull I felt ripping at me. If he called me again, I knew I would go to the Prince.\u003c/p\u003e\n\u003cp\u003eIt was then that the driver and Ovidiu dashed away. They managed to avoid the gypsy guards and raced toward a path leading away from the castle. The gypsies began to pursue them, but Vlad lifted his hand and motioned them back.\u003c/p\u003e\n\u003cp\u003e“No! Let my Brides feast tonight!”\u003c/p\u003e\n\u003cp\u003eThe mysterious blue fire eerily began to pursue the two frantic men. Ovidiu was almost to the path, the driver close behind, when the flames whirled up, then down upon them. Terrified screams rang out. As the men shrieked in pain and fear, I thought I heard the soft laughter of women.\u003c/p\u003e\n\u003cp\u003ePrince Vlad watched with delight as the blue fire completely enveloped the fleeing men. The twisting blue fire danced wildly for a moment, then drew in upon itself and was gone. The screams of the men abruptly ceased, and they were nowhere to be seen.\u003c/p\u003e\n\u003cp\u003e“What madness is this?” Father whispered in horror.\u003c/p\u003e\n\u003cp\u003eTwo gypsies moved forward and grabbed hold of Father. Screaming, we tried to draw him back into the false safety of the carriage, but they wrenched him from us.\u003c/p\u003e\n\u003cp\u003e“Leave him be!” Mother shouted, her face fierce in the torchlight.\u003c/p\u003e\n\u003cp\u003ePrince Vlad moved swiftly toward the carriage, and Mother threw herself in front of us.\u003c/p\u003e\n\u003cp\u003e“Let us be! We never meant you any harm!”\u003c/p\u003e\n\u003cp\u003eHe smirked at her, reached in, shoved her to one side, and grabbed hold of my arm. All three of us began to shriek. Mother began to hit him with her fists as May scratched at his hand. I tried to hold onto my mother and sister, but he easily pulled me from them. Drawing me out of the carriage, Prince Vlad wound his fingers in my red hair and pulled back my head.\u003c/p\u003e\n\u003cp\u003e“You, my darling, are mine,” he whispered in my ear, and licked my throat with his long, thick tongue.\u003c/p\u003e\n\u003cp\u003e“You bastard!” Father’s voice shouted.\u003c/p\u003e\n\u003cp\u003eThrough my tears, I could see my father trying to break free of his captors.\u003c/p\u003e\n\u003cp\u003eVlad laughed, turned back into the castle, and dragged me behind him. “Bring the others!”\u003c/p\u003e\n\u003cp\u003eI clutched at his wrist, trying to keep him from pulling my hair from my scalp. I stumbled behind him, crying out in pain, anger, and frustration.\u003c/p\u003e\n\u003cp\u003e“All this is yours now. I give you all I possess!”\u003c/p\u003e\n\u003cp\u003e“I do not want it! Let me go! I hate you! Let me go! I want to be with my family!”\u003c/p\u003e\n\u003cp\u003eHe ignored my screams and laughed at me. He threw me into the arms of two gypsy women, and said, “Prepare her for tonight.”\u003c/p\u003e\n\u003cp\u003e“No! No! Release me! I want to go home! I do not want to be here!”\u003c/p\u003e\n\u003cp\u003eI fought the gypsy women, but their fingers bit into my skin as they dragged me up the stairs. I kicked and fought them, but they steadily drew me away from my family.\u003c/p\u003e\n\u003cp\u003eLooking over my shoulder, I could see my family being led into the castle. Mother was holding May in her arms, my sister’s eyes closed, her long hair spilling over her shoulder. It was apparent that she had collapsed. My mother looked fierce in the flickering light from the torches, tears staining her face. Father’s face was flushed with anger as he continued to struggle to free himself from the guards. I watched as Prince Vlad approached, and Father finally broke free from the guards.\u003c/p\u003e\n\u003cp\u003eBravely, my father launched himself at the Prince. “You bastard! I will kill you!”\u003c/p\u003e\n\u003cp\u003eFather tried to strike the Prince, but Vlad’s hand moved so quickly, I could only hear the impact of his hand against my father’s cheek. In horror, I watched Father fall at Prince Vlad’s feet, stunned.\u003c/p\u003e\n\u003cp\u003e“For that, you shall die first.”\u003c/p\u003e\n\u003cp\u003eMother and I both began to scream. The gypsies pulled me up the steep staircase and my last vision was of my mother slumping to the floor, May falling from her grasp as she held out her hands to Prince Vlad imploring him for mercy.\u003c/p\u003e\n\u003cp\u003eThe gypsies wrenched me away from the stairs and down a long corridor, my sobs echoing around me. I knew, in my heart that Father would die on this dreadful night. I collapsed to my knees, but the women pulled me up, holding me tightly between them, to march me down the hall.\u003c/p\u003e\n\u003cp\u003e“Please, let me go,” I pleaded with them. My strength was gone. “Please, let me go.”\u003c/p\u003e\n\u003cp\u003eThey led me on as they would a small child.\u003c/p\u003e\n\u003cp\u003eIt was then I heard my father cry out and my mother began to scream. I fell to the ground, my heart shattering within me. I knew that Prince Vlad had murdered my father.\u003c/p\u003e\n\u003cp\u003eFor a short moment, the gypsies released my arms. I buried my face in my hands, rocking before them. Their faces showed no emotion as my mother’s screams grew louder and rang throughout the castle.\u003c/p\u003e\n\u003cp\u003eAs the low, seductive laughter of Prince Vlad swelled up from below us, they reached down and drew me to my feet.\u003c/p\u003e\n\u003cp\u003e“Please, please,” I begged.\u003c/p\u003e\n\u003cp\u003eBut there was no mercy for me. I was taken far from the staircase and deep into the castle. So deep, my mother’s screams faded away.\u003c/p\u003e\n\u003cp\u003eThis was madness! Madness!\u003c/p\u003e\n\u003cp\u003eI must be mad, I thought. This could not be happening! And yet, it was.\u003c/p\u003e\n\u003cp\u003eThe gypsies tore my clothes from my body and forced me into a tub of water where they set about roughly bathing me. I let them do as they pleased as I wept, my tears falling into the cold water. My body shuddered with my tormented sobs. I was drawn from the water and laid on the floor. They dried me with huge rough cloths.\u003c/p\u003e\n\u003cp\u003e“Stop crying,” one of them finally said in English.\u003c/p\u003e\n\u003cp\u003e“My father…”\u003c/p\u003e\n\u003cp\u003e“He never should have defied the Prince,” she answered. Her strong fingers gripped my damp hair and she looked fiercely into my eyes. “Always do as he tells you. Always.”\u003c/p\u003e\n\u003cp\u003eTogether, they pulled me to my feet and led me into another chamber. It was there they dressed me in a fine white nightgown of purest silk and brushed out my long hair.\u003c/p\u003e\n\u003cp\u003eI sat with my hands in my lap as they tugged at my curls, shaping them with their hands and brushes. My face hurt from crying, and the tears were now just a mere trickle down my cheeks. It hurt to breathe and it hurt to ponder the terrible events of the night. I did not want to think or feel. I sat and stared at a crack in the stone floor, ignoring the women around me.\u003c/p\u003e\n\u003cp\u003eThe gypsies finished preparing me for whatever horrible plans the Prince had for me, and led me to the bedchamber I had slept in the two nights before. They left me there to wait for him. I covered my face with my hands and trembled in terror.\u003c/p\u003e\n\u003cp\u003eI wanted to die and join my father in heaven. But, alas, I knew I was not going to die. I was going to wait. I was going to wait in that awful, cold room where terrible nightmares had plagued me. I was going to wait for the monster that called himself Prince Vlad.\u003c/p\u003e\n\u003cp\u003eSo, reluctantly, I waited in trembling silence.\u003c/p\u003e\n\u003cp\u003eTrying to calm my wildly beating heart, I began to recite the Lord\u0027s Prayer.\u003c/p\u003e\n\u003cp\u003eAs midnight approached and my fear deepened, I stood watch in the dusty, dark bedchamber, listening to the distant cries of wolves. Shivering in my flimsy nightgown, pale with fear and despair, I waited.\u003c/p\u003e\n\u003cp\u003eI could not let myself ponder the fate of my family anymore. If I did, I would go surely mad. I had to wait and see what horror the Prince would visit upon me. In my heart, I wanted him to kill me as he had my Father. I knew that I would never escape this place except to die. I also knew he would come tonight. I had seen it in his eyes. The way those dark green eyes had rested on me with unholy lust had been a promise. A dark, evil promise.\u003c/p\u003e\n\u003cp\u003eI held my hands close to my breast, listening to the awful ragged sound of my own tortured breathing. The night was full of shadows and half-heard whispers. It was as if the very darkness had sprung to life, reaching for me, trying to claim me.\u003c/p\u003e\n\u003cp\u003eOutside the one long narrow window, the moon was full, glowing a pale unearthly light. It washed the mountains in a pale blue light, creating chilling shadows.\u003c/p\u003e\n\u003cp\u003eThere was no comfort to be found.\u003c/p\u003e\n\u003cp\u003eThe words of the Lord’s Prayer faded from my dry lips. Fear finally robbed me of my voice. Even my body was paralyzed. My only movement was the nervous rocking of my body as I stood in the center of the bed chamber waiting. Waiting for the Prince. Waiting for my fate. Waiting to endure whatever evil the Prince had designed for me. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-10.html","bookId":2614,"creation":"Oct 5, 2019 9:56:26 PM","modification":"Oct 5, 2019 9:56:26 PM"}
