{"id":99632,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI shifted in my seat, uncomfortable with his words. I knew their rationale all too well. “Master, they have not lived in this land. They do not know the secrets I have learned.”\u003c/p\u003e\n\u003cp\u003e“Ah, but I remember your protest, my good friend. I remember when I first came to you for assistance in establishing myself in the world of mortals.”\u003c/p\u003e\n\u003cp\u003eI hate the way Dracula’s eyes glow like dark coals in the darkness of the night. The Count was in good humor tonight, his visit to Buda being the success he had desired. But Dracula being in good humor can be even more dangerous than his dark moods. I could tell he was chiding me and playing with me like a mere child. But perhaps that is all I am when compared with his great years.\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” I said, trying to smile. “I was foolish and naive. But I have served you well, have I not, Master?”\u003c/p\u003e\n\u003cp\u003e“Yes, you have, my dear friend.”\u003c/p\u003e\n\u003cp\u003eI glanced out of the carriage window. A storm was moving swiftly over the valley, obscuring the moon. “Did you call that storm?”\u003c/p\u003e\n\u003cp\u003eCount Dracula looked at the dark mass gliding resolutely across the sky and dismissed the storm clouds with a motion of his hand. “No, that one is of God. Did I tell you I sent a rather marvelous storm after the Earl when he tried to escape me with his family?”\u003c/p\u003e\n\u003cp\u003e“No, you did not. I am sure it was quite impressive.” Vastly uncomfortable at the thought of the demise of my friend, Edric, and his family and the significant role I had played, I squirmed in my seat. Now I knew he was trying to make me uncomfortable. His good humor was a mask hiding his disappointment, nay, his anger with me.\u003c/p\u003e\n\u003cp\u003e“It was lovely. Almost as lovely as my new Bride. She is a most beautiful creature.” His eyes narrowed slightly. “Do you not think so?”\u003c/p\u003e\n\u003cp\u003e“So only Glynis remains, I assume,” I said softly, avoiding answering him. I stared at the window at the storm, attempting to distract myself. But I could not. I squirmed, averting my gaze from the Master.\u003c/p\u003e\n\u003cp\u003eCount Dracula watched me with amusement. “How easily you sent them to me knowing their possible fate. Your guilt does not quite suit you.”\u003c/p\u003e\n\u003cp\u003eI choked for a moment, startled by his words. The Master knew me well. For it was not guilt I felt, but the fear my actions would be discovered by the authorities. “He was a friend, but a friend is not as important to me as you are, Master. I serve you.” I knew my words would please him.\u003c/p\u003e\n\u003cp\u003eHe smiled slightly. “And I pay you well.”\u003c/p\u003e\n\u003cp\u003e“Yes, my Master. But beyond the monetary rewards of my service, I cling to your promise of an immortal life. To serve a man such as you for an eternity would be the greatest pleasure. My wife’s father often speaks of your great victories over the Turks.”\u003c/p\u003e\n\u003cp\u003eCount Dracula smiled, but his eyes remained shrewd and considering as he gazed at me. “Yes, I remember the victories of my mortal life. And one day, I will not remain trapped in my own country, but take my place once more in the halls of power.”\u003c/p\u003e\n\u003cp\u003eEvery time Count Dracula speaks of power, it thrills me, for I capture a glimpse of the world I will one day join.\u003c/p\u003e\n\u003cp\u003eSince the first time Count Dracula entered my bedroom in the night and seduced me with the promise of immortality, I knew I was destined for greatness. I have labored long and hard for Count Dracula, building up his wealth and once more establishing him in Hungarian society as Count Vlad Dracula, a distant descendent of Vlad Tepes the Impaler, of the Dracul family. I may not be the most handsome of men or the most charming, but I am an aristocrat with connections and a shrewd businessman with all the necessary connections in the mortal world that Count Dracula needs. Over the years, Count Dracula has occasionally spoken of being a prisoner to this land and his desire to move freely in the mortal world, but I cannot understand what he means. He travels to and fro through the empire and wields power that mere men cannot imagine.\u003c/p\u003e\n\u003cp\u003eI often wonder if there is a vampire society I am not aware of. Is he their ruler? Will I one day - err, night - rule at his side?\u003c/p\u003e\n\u003cp\u003eI will do anything to protect my position as Count Dracula’s trusted adviser. Even betray an old school chum and his family by sending them to Count Dracula. Edric had been pleasant enough, but I admit, I always resented his great success and wealth. I do feel badly about Antoinetta and May, but that little twit Glynis can suffer her fate. In a moment of weakness, I had tried to plant a kiss on her lovely mouth, but she rebuffed me. She should never be so talkative and witty if she does not expect a man to respond to her seductions. Yes, she deserved her fate, the little tramp. But it is really too bad about the rest of the family.\u003c/p\u003e\n\u003cp\u003eBut I digress…I found Count Dracula staring at me intently. I had been so deep in my own thoughts, I wondered if I had missed part of the conversation.\u003c/p\u003e\n\u003cp\u003e“Yes, my Master,” I said anxiously.\u003c/p\u003e\n\u003cp\u003e“You are a cunning man, Stephen. Such dreams you have,” the Count said smiling, then sank back into the shadows of the carriage as only he can do.\u003c/p\u003e\n\u003cp\u003eI swallowed hard and wondered if he could read my thoughts.\u003c/p\u003e\n\u003cp\u003eOur escort of armed guards riding on black horses drew up to the carriage. The guards are for me, not Count Dracula. These are dangerous parts. All sorts of horrible deaths await travelers in the Carpathian Mountains, not just at the hands of the vampires, but thieves, bandits and dangerous bands of Gypsies. Though I know the guards are merely well-dressed mercenaries, I do feel safe within their care.\u003c/p\u003e\n\u003cp\u003eThunder churned in the distance and the wind rocked the carriage even more than the treacherous pass we were traveling. But beyond the sounds of the night, I heard something more.\u003c/p\u003e\n\u003cp\u003eLeaning toward the window, I stared out toward the castle we were quickly advancing on. Faintly, just beyond the edges of my hearing, I heard the strangest of sounds. It was like the gentle sigh of a woman mixed with a raging scream…no…like a seductive song whispered…nay…a low growl. It was confusion to my ears yet alluring. Even now, I cannot describe what I heard.\u003c/p\u003e\n\u003cp\u003eCount Dracula was virtually invisible in his cloak of shadows, only his ominously glowing eyes visible through the gloom.\u003c/p\u003e\n\u003cp\u003eI absolutely abhor visiting the castle.\u003c/p\u003e\n\u003cp\u003eAs the carriage turned into the courtyard, Count Dracula’s eyes seemed to burn even brighter. “Ah, what is this?”\u003c/p\u003e\n\u003cp\u003eI leaned toward the window and my breath caught.\u003c/p\u003e\n\u003cp\u003eThe great door to the castle was thrown open and four beautifully exotic women were gathered in the doorway. Their gossamer gowns, pale as the purest moonlight, and their long billowing hair danced around their voluptuous bodies as the cool breeze caressed them. Strange words, whispered and fervent escaped from their blood red lips, their pink tongues darting between glistening white fangs. Arms moving in fluid, seductive motions beckoned to me. The intoxicating sound that wafted on the night breeze called to me.\u003c/p\u003e\n\u003cp\u003eI found myself fumbling with the carriage door latch, my eyes riveted to the pale beautiful women with the sharp features and blood red lips.\u003c/p\u003e\n\u003cp\u003eTheir voices…their voices…even now..I remember how they whispered to me…\u003c/p\u003e\n\u003cp\u003eCome to us…\u003c/p\u003e\n\u003cp\u003eLet us kiss you…\u003c/p\u003e\n\u003cp\u003eLet us caress you…\u003c/p\u003e\n\u003cp\u003eWe want you…\u003c/p\u003e\n\u003cp\u003eDesire you…\u003c/p\u003e\n\u003cp\u003eNeed you…\u003c/p\u003e\n\u003cp\u003eLove you…\u003c/p\u003e\n\u003cp\u003eLet us love you…\u003c/p\u003e\n\u003cp\u003eKiss you…\u003c/p\u003e\n\u003cp\u003eTaste you…\u003c/p\u003e\n\u003cp\u003eEven now I feel the heat of their words and, in that horrible moment, I wanted to escape the confines of the damned carriage and throw myself into their waiting arms. Already, I could feel their lips against mine, their hands on my body, their bodies against mine…\u003c/p\u003e\n\u003cp\u003e“Foolish little man!”\u003c/p\u003e\n\u003cp\u003eI was struck forcefully and knocked back into my seat. Thank goodness, the Count struck me down in my foolish lust. I still wanted to go to them, but I felt the force of Count Dracula’s power holding me in place.\u003c/p\u003e\n\u003cp\u003e“I need you, so do not be a fool!”\u003c/p\u003e\n\u003cp\u003eMy body was shivering violently as I blurted out, “But, they called…”\u003c/p\u003e\n\u003cp\u003eCount Dracula dismissed me with a flick of his hand, and said, “Another fool approaches them.”\u003c/p\u003e\n\u003cp\u003eA guard moved toward the Brides of Dracula answering their siren call. He nearly stumbled over the body of what appeared to be a hunter prostrate at the feet of the women, but he caught himself. Extending his hands toward them, the handsome, swarthy young man relinquished his life. The Brides caught hold of him and drew him into their arms. Closing in around him, their sly seductive laughter slithered through the air.\u003c/p\u003e\n\u003cp\u003eI watched in horror, unable to look away. After a long moment, a Bride raised her head and seemed to look directly at me. It took me a few moments to recognize that the beauty with the long rivulet of blood tracing down her chin was the red haired Lady Glynis. It gave me an awful start. I turned away and cowered in the darkness of the carriage. And still, I felt the coldness of her stare.\u003c/p\u003e\n\u003cp\u003e“I shall be in contact with you soon, my friend,” the Count said coolly.\u003c/p\u003e\n\u003cp\u003eCount Dracula gracefully descended from the carriage and moved toward the castle. He must have signaled the coachman, for the carriage lurched forward.\u003c/p\u003e\n\u003cp\u003eI sat back, trembling. Deathly cold fingers traced down my spine. I felt as if I had witnessed my own death. How easily I had almost gone to them. To her! Her gaze upon me has left me cold and only the sight of the rising sun this morning has given me any measure of peace.\u003c/p\u003e\n\u003cp\u003eThe Journal of Lady Glynis Wright\u003c/p\u003e\n\u003cp\u003eThe Castle\u003c/p\u003e\n\u003cp\u003e5th of September, 1819\u003c/p\u003e\n\u003cp\u003eLast night, when Vlad returned, I stood in the doorway and watched the carriage depart carrying the man who had betrayed my family try and hide from my gaze. Sir Stephen had not seemed surprised to see what we truly are and now I fully realize that he sent us to our deaths in service to his Master. The bitter taste of his betrayal made the blood I had consumed lose its flavor and I almost spat on the floor.\u003c/p\u003e\n\u003cp\u003eBehind me, Vlad stood over the other Brides. I glanced back at him and saw his green eyes glimmering with dark satisfaction.\u003c/p\u003e\n\u003cp\u003eThe unfortunate young man that had answered our call was completely drained of his rich life blood and lay on the floor, nothing more than a pale bloodless body cluttering up the doorway to the castle. I remember gazing at him almost with disgust. How easily he had come to us.\u003c/p\u003e\n\u003cp\u003eThe Brides slowly gathered about Vlad, cooing and whispering, holding out their hands in supplication, as I stood and watched the carriage disappear.\u003c/p\u003e\n\u003cp\u003e“You have returned, Master, sweet Master,” Ariana exclaimed emotionally, kissing his hands.\u003c/p\u003e\n\u003cp\u003e“We longed for your return,” Elina declared breathlessly as she ran her hands over his hair.\u003c/p\u003e\n\u003cp\u003e“We were starving,” Cneajna dared to say. “We needed you!”\u003c/p\u003e\n\u003cp\u003eLike fawning cats, they rubbed seductively against him, caressing him with their bodies and hands.\u003c/p\u003e\n\u003cp\u003eSave for me.\u003c/p\u003e\n\u003cp\u003eI stood over the dead guard, staring into his hollow eyes.\u003c/p\u003e\n\u003cp\u003e“Come to me, my Bride,” Vlad called to me.\u003c/p\u003e\n\u003cp\u003eI lifted my gaze. I knew in that moment they were burning with defiance. “You must bring us another.”\u003c/p\u003e\n\u003cp\u003eVlad hardly seemed to notice my outburst. He amorously kissed Elina with his thick lips.\u003c/p\u003e\n\u003cp\u003e“Do you hear me? It is not enough, damn you! It is not enough! It is never enough,!” I cried in anguish.\u003c/p\u003e\n\u003cp\u003eThe blood of the hunter who had stumbled across us earlier and the guard had made us soft, pale, and rosy once more with our hearts beating in our chest, but still the hunger was there. Clawing, pleading, needing to be fed.\u003c/p\u003e\n\u003cp\u003e“It is enough for tonight,” Vlad said softly. Staring down into Ariana’s adoring eyes, he gently smoothed her tangled hair. “Tomorrow, I shall bring you another.”\u003c/p\u003e\n\u003cp\u003e“We need more now! I feel the hunger deep within me! The need is gnawing at me!” I trembled with rage and desire. “We need to feed now.!”\u003c/p\u003e\n\u003cp\u003eVlad pointedly ignored me as he caressed his wives\u0027 faces and kissed their lips.\u003c/p\u003e\n\u003cp\u003e“Do you hear me, you stupid bastard? Call back your carriage and give us those men! Give me Sir Stephen!”\u003c/p\u003e\n\u003cp\u003eSlowly, Vlad’s darkly burning eyes slid toward me, his most defiant Bride. “Do not task me, Glynis,” he said in a low, threatening voice.\u003c/p\u003e\n\u003cp\u003e“You made us what we are. You have starved us since you left. You cannot let us starve any longer!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-27.html","bookId":2614,"creation":"Oct 5, 2019 6:46:06 PM","modification":"Oct 5, 2019 6:46:06 PM"}
