{"id":99659,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAndrew wrapped his arms tightly around me, fresh tears falling down his ruddy cheeks. “Oh, Glynis, Glynis. I love you, dear sister. I will do as you ask. I cannot deny your request. It just seemed so odd to see you this way. I do not know what I thought, but I was afraid that you were unhappy. I wanted to free you from Vlad.”\u003c/p\u003e\n\u003cp\u003e“Andrew, just help us move to England and that will make me so very happy. It is all I ask of you. Please promise me, you will do what Vlad requests,” I urgently whispered.\u003c/p\u003e\n\u003cp\u003e“I promise, Glynis,” my brother swore passionately. “I promise you that I will help you.”\u003c/p\u003e\n\u003cp\u003eI wept with relief and despair. Andrew is snagged in Vlad’s web and I have lured him into it. Bitterness filled me as I clung to Andrew in desperation.\u003c/p\u003e\n\u003cp\u003eIt still fills me as I write this. I swear that no matter what happens, I will not allow my brother to endure the same fate as the rest of my family. In the end, I would rather kill myself and destroy Vlad’s plans then ever allow Andrew to suffer.\u003c/p\u003e\n\u003cp\u003eChapter 27\u003c/p\u003e\n\u003cp\u003eThe Journal of Lady Glynis Wright\u003c/p\u003e\n\u003cp\u003e8th of April, 1820\u003c/p\u003e\n\u003cp\u003eBuda, Hungary\u003c/p\u003e\n\u003cp\u003eThis last month has been the most marvelous yet nerve wracking time of my short life as a vampire. After my emotional plea to my brother, Andrew has endeavored to accept my new life. Though a hint of suspicion has lingered in his blue eyes, Andrew has held his tongue. Around Vlad he is quite civil, bordering on extreme politeness.\u003c/p\u003e\n\u003cp\u003eI suspect that he is a little fearful of Vlad. Even dressed in modern clothing with his hair neatly trimmed, there is still a certain quickness to his movements and a coldness in his eyes that subtly reveal his predatory nature. Wisely, Andrew has been reticent about discussing his own life in front of Vlad and always keeps the conversation geared toward Vlad’s own plans. My brother is very clever. I suppose it is a family trait.\u003c/p\u003e\n\u003cp\u003eI regret that I have not kept up with my journal. I simply have not the time. Every evening Andrew arrives at the mansion and visits until early in the morning. Sometimes Emil comes along, but mostly Andrew visits alone. Much to my relief, now that Vlad is satisfied that my brother will assist us, he has lost interest in supervising my brother’s visits. Very often he leaves us alone to reminisce.\u003c/p\u003e\n\u003cp\u003eMy time alone with Andrew means so very much to me. After his initial awkwardness due to my veiled appearance and his displeasure over my new husband, Andrew has now taken up his old role of pesky, elder brother.\u003c/p\u003e\n\u003cp\u003eI adore him, yet his presence has caused me some difficulties. I have found it quite difficult to hunt efficiently. In order to hunt, I have to beg off from our visits, sending a messenger during the day to inform my brother I am not well. Of course, this only concerns him more and being as stubborn as I, he has shown up while I was hunting and insisted that he see me immediately. Unfortunately, Vlad often has to play the role of protective husband during these times and it has not helped them be fond of each other.\u003c/p\u003e\n\u003cp\u003eSadder yet, I have not able to meet my beloved Ignatius at the appointed time. My brother and Emil stayed quite late the night I had agreed to meet my new lover and Vlad had decided to join us. I had considered sending Ignatius a message, but I cannot truly trust the servants. I fear they are totally within the thrall of Vlad’s power. I was quite morose that night, my despair threatening to overwhelm me. My brother realized my state of mind and tried to comfort me, but it only made Vlad angry.\u003c/p\u003e\n\u003cp\u003eIt was most difficult explaining to Vlad that I was not in the mood for visitors, even my own brother, and that the source of my despair was simply me being moody. I fear he suspects that I am hiding much from him, and, of course, I am.\u003c/p\u003e\n\u003cp\u003eTonight, we were especially jovial though. We took a long walk and I felt much better. I was able to hunt yesterday and the blood has refreshed me greatly. As we strolled along the banks of the river, we could not help but speak of the past.\u003c/p\u003e\n\u003cp\u003e“Do you remember when we managed to remove those old swords off the library wall and began to swing at each other,” Andrew asked me abruptly.\u003c/p\u003e\n\u003cp\u003e“Do I ever! Mother smacked my backside so hard I thought I would never be able to sit down again,” I said with a laugh.\u003c/p\u003e\n\u003cp\u003e“You very nearly decapitated me if I recall correctly,” Andrew answered with a wide grin.\u003c/p\u003e\n\u003cp\u003e“Oh, yes! And then I fell off the library table and drove that old sword straight through the back of a chair!” I laughed at the memory. I had been about ten at the time and always ready for adventure, which usually turned to mischief.\u003c/p\u003e\n\u003cp\u003e“I remember Mother’s tirade in Italian to this day,” Andrew recalled fondly. “You could always tell how angry she was by whether or not your scolding was in English or Italian.”\u003c/p\u003e\n\u003cp\u003e“Or by how fast she spoke,” I reminded him.\u003c/p\u003e\n\u003cp\u003e“Ah, yes. You and I were an awful nuisance to Mother,” Andrew said with a laugh.\u003c/p\u003e\n\u003cp\u003e“I know I was frightful to Mother, but in the end, we were at peace,” I said with a soft, bittersweet sigh.\u003c/p\u003e\n\u003cp\u003e“I am glad for it, Glynis. I always thought you were exactly like Mother. Both of you were full of opinions, fierce and absolute towers of strength on top of being amazingly beautiful,” Andrew said lovingly.\u003c/p\u003e\n\u003cp\u003eAt the thought of my last moments with my mother, I felt tears welling in my eyes and I raised a hand to wipe them away quickly. I could not risk blood seeping onto my veil.\u003c/p\u003e\n\u003cp\u003eAndrew became aware of my sniffling and immediately embraced me. “Glynis, darling, you are still beautiful to me. No matter what has happened, you are the most beautiful sister in the world.”\u003c/p\u003e\n\u003cp\u003eI began to laugh and nearly choked on my tears. Here Andrew thought I was horribly mutilated and in truth I was far more beautiful in my Undead condition than I had ever been in life. “Oh, Andrew, you are so wonderful to me.”\u003c/p\u003e\n\u003cp\u003eHe hugged me tightly and kissed the top of my head. “I adore you, Glynis. I do not want to leave you here.”\u003c/p\u003e\n\u003cp\u003e“I will be fine, Andrew. I promise you that. I made the same promise to Mother before she died. I am strong, Andrew, and no matter what happens in my life, I want you to know that I will be all right in the end. I will never stop loving you and Angeline and my darling little nephew.”\u003c/p\u003e\n\u003cp\u003e“I cannot wait for you to see him, Glynis. I swear he has your personality,” Andrew said fighting back his tears.\u003c/p\u003e\n\u003cp\u003e“Oh, dear! I do believe you are in for a bit of trouble then,” I exclaimed with delight.\u003c/p\u003e\n\u003cp\u003eAndrew tapped his chin with one finger, then said, “Yes, yes, I do believe I had better start hammering down everything in the house as soon as I return to England.”\u003c/p\u003e\n\u003cp\u003e“And remember the third floor banister. You must post a guard to watch it at all times,” I said with a bright laugh.\u003c/p\u003e\n\u003cp\u003e“We nearly broke our necks that day. How were we to know it was freshly polished that morning?”\u003c/p\u003e\n\u003cp\u003eWe both dissolved into laughter.\u003c/p\u003e\n\u003cp\u003eAs I sit here, writing this, I cannot help but smile. My brother’s presence restores me in a way I cannot describe. When I am with him, I nearly feel human. It is a gift that he could not possibly understand.\u003c/p\u003e\n\u003cp\u003eYet, I am sorrowful, for soon he shall leave and I have yet to see my beloved Ignatius.\u003c/p\u003e\n\u003cp\u003eI pray, though I do not know if God hears, that I will find my way through this darkness and find my own happiness.\u003c/p\u003e\n\u003cp\u003eThe Journal of Lady Glynis Wright - Buda\u003c/p\u003e\n\u003cp\u003e10th of April, 1820\u003c/p\u003e\n\u003cp\u003eOh, glorious night of nights! I have much to report.\u003c/p\u003e\n\u003cp\u003eI was quite happily arranging the flowers in the front hall when Magda approached me with the most solemn expression.\u003c/p\u003e\n\u003cp\u003e“Madam, this arrived earlier when you and the Master were sleeping,” she said.\u003c/p\u003e\n\u003cp\u003eI took the white enveloped proffered as I furrowed my brow. I admit I was positively puzzled. I could not imagine who would be sending me a formal invitation. Prying open the seal, I slipped out the card. I was surprised to see that the Count and Countess Dracula, according to the fine writing, were invited to an opera at the palace of one of the aristocratic families of Buda by the name of Dosza. I was so shocked by the invitation I froze where I stood, staring at Magda with open astonishment.\u003c/p\u003e\n\u003cp\u003eVlad strode down the stairs and spotted me standing like a marble statue in the foyer. “What have you got there?”\u003c/p\u003e\n\u003cp\u003eI just let out a small sound and extended the hand clutching the invitation toward him.\u003c/p\u003e\n\u003cp\u003eImpatiently, he marched over to me, and grabbed it from my hand. “What is this?”\u003c/p\u003e\n\u003cp\u003e“An invitation! For us,” I exclaimed.\u003c/p\u003e\n\u003cp\u003e“Really? From whom, I wonder?”\u003c/p\u003e\n\u003cp\u003eAs he read, a slow smile crept over Vlad’s long face. A delicate folded sheaf of paper slipped free of the envelope and fluttered to the floor. Magda quickly retrieved it and handed it to Vlad. He flipped it open and read it with an amused expression. “A Csilla, Baroness Dosza of Buda, was shocked to learn I had returned to the city without informing her. She was even more shocked to learn from Sir Stephen’s dear wife, Maria, that I had taken a wife from England. She is most anxious for us to attend her opera and is awaiting our reply.”\u003c/p\u003e\n\u003cp\u003eI snatched the letter from him without a thought and read it myself. “I think I remember her. I believe I met her at a dinner party. But who is she? How does she know about us?”\u003c/p\u003e\n\u003cp\u003e“I move in the finer circles of this city, Glynis. I am quite a mysterious figure to them. Baroness Dosza is a very beautiful, snobbish woman who must know everything that happens to anyone she deems to be in her circle of influence. I particularly intrigue her. It was a matter of time before she found out we were living in the house.” Vlad smiled with vague amusement. “Respond immediately. You do know how to write a decent letter of acceptance, do you not?”\u003c/p\u003e\n\u003cp\u003e“Of course,” I huffed, then realized what he meant. “You mean that we are actually going to attend?” I was utterly surprised. I could not believe what was happening. It was as if I was suddenly living a very normal aristocratic life. It felt so wonderfully familiar and lovely.\u003c/p\u003e\n\u003cp\u003e“Of course. And inform her that your brother and his friend will also be attending. The Baroness will be ecstatic. She adores foreigners.”\u003c/p\u003e\n\u003cp\u003e“It is in five days,” I said. “I have nothing to wear!”\u003c/p\u003e\n\u003cp\u003e“We shall take care of it. Now, write the answer immediately,” Vlad said, kissed my brow, and strode off in good spirits.\u003c/p\u003e\n\u003cp\u003eI stared at Magda for a long moment then blinked my eyes rapidly. “Am I dreaming, Magda?”\u003c/p\u003e\n\u003cp\u003e“No, madam,” the servant assured me.\u003c/p\u003e\n\u003cp\u003eI gave out a light laugh and clutched the invitation to my heart. “Then God is truly smiling on me.”\u003c/p\u003e\n\u003cp\u003eOh, wonders of wonders, I am truly ecstatic over this bit of news. An opera! A night of revelry! I am in heaven!\u003c/p\u003e\n\u003cp\u003eThe Journal of Lady Glynis Wright - Buda\u003c/p\u003e\n\u003cp\u003e15th of April, 1820\u003c/p\u003e\n\u003cp\u003eBear with me, dear diary. I am in ecstasy! I can barely write. My hand is trembling so. So much has happened. Some of it dreadful, some of it glorious. But truly, truly, tonight was beyond all expectations.\u003c/p\u003e\n\u003cp\u003eLet me go back and explain all that happened.\u003c/p\u003e\n\u003cp\u003eEarlier -\u003c/p\u003e\n\u003cp\u003eI rushed down the stairs, a vision to behold in a confection of black and gold. True to his word, Vlad had made sure I had the finest dress to wear to the opera. Waiting at the foot of the stairs was my handsome brother and the imposing man who claims to be my husband.\u003c/p\u003e\n\u003cp\u003eAs they gazed up at me, the ruddy faced redhead with the wide smile and the darkly sensual creature of the night, I could not help but notice the enormous difference between them. Andrew was alive with light and goodness while the atmosphere around Vlad was dark and menacing. But I had to admit that in their own way, they both looked very handsome in their frock coats and long trousers.\u003c/p\u003e\n\u003cp\u003eI felt radiant. Tonight I felt alive, not the undead creature I truly am. Perhaps it was the opulence of my new gown, but I felt every inch the Countess Dracula.\u003c/p\u003e\n\u003cp\u003eA delicate black veil edged with tiny gold beads fell to just below my chin and my red tresses were swept up into a fashionable knot with curls trailing down over my forehead. An elegant shimmering black feather sprang boldly over my head from a jeweled gold comb.\u003c/p\u003e\n\u003cp\u003eVlad had spared no expense in the making of my gown for this special night and it was magnificent. The high-waisted black silk dress had puffed sleeves that slipped provocatively off my pale shoulders. It was latest style sweeping through the aristocratic circles. The dress was so stiff from all the fine embroidery and tiny, fussy details, like the gold bows encircling the padded hem of my dress, I almost felt like a walking statue. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-54.html","bookId":2614,"creation":"Oct 5, 2019 6:46:06 PM","modification":"Oct 5, 2019 6:46:06 PM"}
