{"id":99665,"no":60,"title":"Page 60","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTrapped within this lewd creature’s mind, I knew he loved to hurt women and he was ecstatic at the thought of harassing some poor woman sleeping on the street.\u003c/p\u003e\n\u003cp\u003e“Hey, you there! You shouldn\u0027t be sleeping on the street, whore,” he declared in a brash voice.\u003c/p\u003e\n\u003cp\u003eThe shape shifted and a white face rose up from the blackness. It was a beautiful face, pale and fierce, with blazing eyes and a huge red mouth. No, no, dear journal, the mouth was not huge. Now I remember. It was smeared with blood.\u003c/p\u003e\n\u003cp\u003eThe butcher, with me trapped within him, stared stupidly as that red mouth opened and two long sharp teeth stood out starkly as the woman hissed at him.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” the butcher asked in confusion.\u003c/p\u003e\n\u003cp\u003eThe woman rose up and stood over the whore sprawled out on the cold ground. “You should have turned around and run.”\u003c/p\u003e\n\u003cp\u003eThe woman’s voice was soft, yet it sent chills down my spine and that of the butcher. Somewhere in the man’s muddled mind, the order to run resounded fruitlessly. But he stood there, gawking, not moving. The last thing he ever thought in his meager life was that a woman could never strike him down.\u003c/p\u003e\n\u003cp\u003eThen he was tossed through the air against the wall and his skull cracked open with a resounding crack.\u003c/p\u003e\n\u003cp\u003eThen I was free of his body and hovered over him as the woman drew closer.\u003c/p\u003e\n\u003cp\u003eIt was then I saw my sister’s face within the dark hood as she knelt down and sank her long teeth into the man’s throat.\u003c/p\u003e\n\u003cp\u003eI awoke with a gasp, horrified beyond comprehension.\u003c/p\u003e\n\u003cp\u003eWhat madness is this? What madness has taken me to this darkest of nightmares! I am tormented and I do not know how I shall sleep!\u003c/p\u003e\n\u003cp\u003eWhat does it mean? Dear God, in heaven above, what does it mean?\u003c/p\u003e\n\u003cp\u003eLater-\u003c/p\u003e\n\u003cp\u003eI am quite mad. I know it. After my last entry I finally fell into a deep, yet restless sleep. Once more, I had a nightmare. This one torments me even more.\u003c/p\u003e\n\u003cp\u003eIn my dream, I could see myself sprawled across the bed, one hand thrown casually over my head. My chest rose and fell with the rhythm of my breathing as I sank further into the depths of unconsciousness.\u003c/p\u003e\n\u003cp\u003eAcross the room, the curtains danced a little jig on the night breeze. Softly, in the distance, a night bird called out into the serene darkness of the night.\u003c/p\u003e\n\u003cp\u003eI sighed languorously.\u003c/p\u003e\n\u003cp\u003eThe curtains slowly calmed their dance until they were slowly billowing in and out to match my breathing. Slowly, silently, a mist began to pour over the window ledge, wispy tongues licking at the wall and floor. The mist rose up and swirled with sensual, exotic movements, twisting about as if to some unheard music of the night.\u003c/p\u003e\n\u003cp\u003eI whimpered slightly.\u003c/p\u003e\n\u003cp\u003eThe curtains suddenly fell flat as the mist began to rise up, slowly blossoming into a pillar of swirling blue. With dramatic flair, the curtains suddenly unfurled as the mist parted and a woman moved into the room.\u003c/p\u003e\n\u003cp\u003eThe long black dress trailed slightly behind her and a long cloak slipped from her pale shoulders and fell to the floor. Silently, stealthily she moved across the room until she stood over the bed. With fierce blue eyes, she stared down at my sleeping form.\u003c/p\u003e\n\u003cp\u003eIn my dream, my nightmare, I hovered like a spirit in the corner of the room watching all that was occurring.\u003c/p\u003e\n\u003cp\u003e“Andrew,” the woman whispered.\u003c/p\u003e\n\u003cp\u003eI saw myself stir slightly, then lapse back into the world of dreams.\u003c/p\u003e\n\u003cp\u003eThe mist flowed around the bed, undulating with dark power.\u003c/p\u003e\n\u003cp\u003e“Andrew, open your eyes,” the woman repeated, then I recognized the voice of my sister.\u003c/p\u003e\n\u003cp\u003eSlowly, almost reluctantly, I opened my eyes in the dream. Abruptly, I was in my own body staring up at my sister. The room was strangely transformed, the atmosphere languid and heavy against me. I had to fight to keep my eyes open to see my sister standing at the end of the bed.\u003c/p\u003e\n\u003cp\u003e“Glynis?” I queried in confusion.\u003c/p\u003e\n\u003cp\u003eThe creature before me was incredibly beautiful. The skin of the woman was so pale and translucent it almost seemed to glow with unearthly light. Her eyes were glittering like aquamarine jewels and there was a certain determination in them that made my hair rise on end. Her lips were red as blood and drawn into a somber line. As she stared down at me, I could see my sister’s features clearly, but yet, I was confused, for this creature oozed a sensuality my sister had never possessed.\u003c/p\u003e\n\u003cp\u003e“Andrew, it is I, your sister,” she said softly.\u003c/p\u003e\n\u003cp\u003e“Your face, Glynis, it is whole,” I answered. I tried to sit up, but I felt as though I was restrained by the wisps of mist flowing over me.\u003c/p\u003e\n\u003cp\u003e“Andrew, listen to me. This is a dream. A strange, exotic dream in a strange exotic land. But every word in this dream is truth and you must listen carefully,” Glynis said in a low voice.\u003c/p\u003e\n\u003cp\u003eI nodded slowly, unsure of what was happening, but I knew I must listen to the apparition of my sister.\u003c/p\u003e\n\u003cp\u003e“Andrew, your instincts were correct. Something is wrong here. Vlad is evil. He will destroy you and your family should he ever reach England. He already killed our parents and our beloved May. Do not fret over me, my darling brother. I am more powerful than you realize. It is important for you to move very slowly to assist Vlad. He cannot reach England. You must not help him move. Delay him, make excuses, but give me time to escape.”\u003c/p\u003e\n\u003cp\u003e“But Glynis you said you loved him,” I protested.\u003c/p\u003e\n\u003cp\u003e“Oh, Andrew, I loathe him. He holds me in his power and I cannot escape. At least, not yet. I need you to do as I say. This dream will haunt you, but you will not speak of it to another. You will do as I say but you will not give voice to your reason. I need time, Andrew. Time to escape. And when I do, I will come to you in England. Do you understand?”\u003c/p\u003e\n\u003cp\u003eThis woman who was my sister, yet something more than human, terrified me. “I want my sister to come home.”\u003c/p\u003e\n\u003cp\u003e“I will. When I can. But not with Vlad. If I go with him to England it will mean death for you, Angeline and your child.”\u003c/p\u003e\n\u003cp\u003eI felt a pressure against my head, and I fell back on the pillows breathing heavily.\u003c/p\u003e\n\u003cp\u003e“Do you understand? Please, Andrew, tell me you understand.”\u003c/p\u003e\n\u003cp\u003e“Yes, yes, I understand,” I whispered through slackened lips.\u003c/p\u003e\n\u003cp\u003eShe moved through the thick mist and leaned over me. Her beautiful face was so ethereal and deadly, but there was a kindness in those sparkling eyes.\u003c/p\u003e\n\u003cp\u003e“What are you?” I gasped.\u003c/p\u003e\n\u003cp\u003e“A dream with truths woven within. Remember,” Glynis whispered, then pressed her lips to my forehead.\u003c/p\u003e\n\u003cp\u003eI fell back onto the bed, then once more I was outside of my body, hovering in the corner.\u003c/p\u003e\n\u003cp\u003eI watched as my sister, beautiful and not human in anyway, stood over me weeping tears tinged with blood.\u003c/p\u003e\n\u003cp\u003eThen with a sudden whoosh, the mist rolled out of the window and the curtains fell flat against the wall and she was gone. Then slowly, they once more began to dance on the night breeze…\u003c/p\u003e\n\u003cp\u003eI awoke, truly awoke, but still I was confused and frightened. I crawled from the bed and staggered through the room to the desk where I now sit writing.\u003c/p\u003e\n\u003cp\u003eA dream interwoven with truths…\u003c/p\u003e\n\u003cp\u003eI believe that, even if I cannot accept the ungodly creature in my dreams as truly being my sister. I believe what she said in my slumbering mind. It makes no sense, I know this, but I believe the dream.\u003c/p\u003e\n\u003cp\u003eEven though it makes my heart weary, I shall do my best to delay Vlad Dracula from moving to England and give my sister the opportunity to escape him.\u003c/p\u003e\n\u003cp\u003eOh, God, dearest journal, this may sound insane, but my sister in my dream, I think she was a vampire and now my sleep-addled brain wonders, truly wonders, why was she veiled. Did her veils hide a terrible secret more horrible than scars? And what happened to me that first day in my sister’s home when I was gripped with that strange paralysis?\u003c/p\u003e\n\u003cp\u003eI must sleep, truly sleep, and get far away from this land and recover my sanity.\u003c/p\u003e\n\u003cp\u003eThen I will consider everything that I have endured here.\u003c/p\u003e\n\u003cp\u003eThe Journal of Lady Glynis Wright\u003c/p\u003e\n\u003cp\u003e21st of April, 1820\u003c/p\u003e\n\u003cp\u003eBuda, Hungary\u003c/p\u003e\n\u003cp\u003eI have done what I must to ensure that my brother is safe. I went to him as he slept and whispered into his dreams. I left him sleeping peacefully, but also with a heavy heart. I believe he will obey and delay Vlad, but I fear that I have revealed myself to him. He is as perceptive as I, and even as I pressed myself into his dreams, I could feel his own power pushing back, seeking to reveal me fully to him. I fear he has seen my true face.\u003c/p\u003e\n\u003cp\u003eI am unsure of what fruit my actions will bear, but I now feel that Andrew is at least safe from Vlad’s manipulations. My words should haunt him and prompt him to obey my instructions. I know that I have only confirmed his doubts concerning my new life and that terrifies me. I know he can be as headstrong as I, but I have to believe he will protect Angeline and Johnny and allow me to save myself.\u003c/p\u003e\n\u003cp\u003eAs I waded through the fine mist trailing over the lush lawn, a night bird called out questioningly. It was a sad, forlorn sound, and it echoed in the hollowness within me. I drew near the front gate and my hands lifted to draw the cloak more tightly about my shoulders. The night was so still that the only movement was the gentle swaying of the trees standing guard near the gate.\u003c/p\u003e\n\u003cp\u003eShadows slinked along the wall encircling the estate and as I drew near, I realized that one particular shadow seemed to remain stationary. I stopped in mid-step, my eyes focusing intently on this one shadow. My skin began to prickle as I realized I was being watched by another dark power. A stab of terror pierced through me as the horrible thought that Vlad might have followed me came sharply to mind.\u003c/p\u003e\n\u003cp\u003eThe shadow took on the form of a man as I watched in fearful anticipation. The fear that Vlad had found me overwhelmed me, and I began to draw up my power around me, preparing to flee. I knew that the dark power had seen me, but if it was Vlad I could think of nothing else but to run.\u003c/p\u003e\n\u003cp\u003eMoonlight fell through the tree branches flicking over the shape as it moved swiftly toward me. As the light from the moon washed over the figure, it cleansed away the shadows revealing the pale visage of a vampire. Slowly, the long pale face of Ignatius emerged from the gloom and he stood before me, clad completely in black.\u003c/p\u003e\n\u003cp\u003eRelieved, I flung out my hand toward him. “You frightened me!”\u003c/p\u003e\n\u003cp\u003e“My apologies,” he answered immediately. Tonight he wore a tidy beard and mustache, his long black hair curling slightly upon his shoulders.\u003c/p\u003e\n\u003cp\u003eI stomped my foot, my hands clenched. “I thought you were Vlad. I had the most awful start!”\u003c/p\u003e\n\u003cp\u003e“But I am not Vlad,” he answered, smiling.\u003c/p\u003e\n\u003cp\u003eI snorted and proceeded to walk down the street.\u003c/p\u003e\n\u003cp\u003eHe immediately fell into step beside me, his hands tucked behind his back. “Where are we going?”\u003c/p\u003e\n\u003cp\u003e“I was returning home,” I answered him rather tartly. I was annoyed at how frightened I had been, so I was a bit snappish.\u003c/p\u003e\n\u003cp\u003e“You think Vlad would mind if I visited?”\u003c/p\u003e\n\u003cp\u003e“Do not tease me!” I whirled about, facing him. “This is not humorous at all! There are lives at stake and I…I…” I flung up my hands, stomping my foot. “You do not understand.”\u003c/p\u003e\n\u003cp\u003eIgnatius tilted his head and arched an eyebrow. “Explain?”\u003c/p\u003e\n\u003cp\u003e“My brother is in danger. I warned him tonight, in a dream, to not help Vlad. This means all could come crashing down up on me rather swiftly, and I know not if I am prepared for it. I have seen Vlad do terrible things. I feel him inside of me and I fear he will detect my intentions. I do not know if I can win against him. I believe I can, but how can I be certain?”\u003c/p\u003e\n\u003cp\u003eHe blinked at the end of the gush of my words, then said, “You would have to attack him when he is weak, drain him of all his blood, decapitate him, burn his body, and then you would be free. Well, you could also drain all of his blood and entomb him, but Masters tend to come back from that more often then not.”\u003c/p\u003e\n\u003cp\u003eIt was my turn to stare at him, startled at his words, and a bit overwhelmed.\u003c/p\u003e\n\u003cp\u003e“Oh. I see.”\u003c/p\u003e\n\u003cp\u003e“But I would not advise that until you are a bit stronger in your abilities. Considering you are not even one year into your dark life, you are quite formidable. Perhaps because he is a powerful vampire. But you may not be able to destroy him that easily.”\u003c/p\u003e\n\u003cp\u003e“Could you?”\u003c/p\u003e\n\u003cp\u003eIgnatius sighed. “Perhaps. But I am bound by that which I cannot speak of.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-60.html","bookId":2614,"creation":"Oct 5, 2019 6:46:06 PM","modification":"Oct 5, 2019 6:46:06 PM"}
