{"id":73099,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Thank you for the warriors.” EenLi said, all business now. “They are proving to be very useful already.”\u003c/p\u003e\n\u003cp\u003e“Excellent.” He paused. “There’s something I need to speak with you about. In private.”\u003c/p\u003e\n\u003cp\u003e“Now is not the time, I’m afraid.”\u003c/p\u003e\n\u003cp\u003e“Make the time.” Devyn’s tone was hard, promising retribution if his request wasn’t met.\u003c/p\u003e\n\u003cp\u003eEenLi’s skin glowed a light red, meaning he was only mildly perturbed. His white eyes narrowed. “Very well. Shall we adjourn to my office?”\u003c/p\u003e\n\u003cp\u003e“That won’t be necessary.” One by one, the people inside the warehouse began dropping to the dirt. Snores soon abounded. I jumped up, unable to hold myself back a moment longer.\u003c/p\u003e\n\u003cp\u003eThis ended now. Knife or no knife.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” EenLi demanded, a look of confusion flittering over his face. His red skin turned to a dark, molten yellow.\u003c/p\u003e\n\u003cp\u003e“I believe you have unfinished business with my slave,” the Targon answered and stepped back.\u003c/p\u003e\n\u003cp\u003e“Not a slave,” I said, moving forward. “Assassin. You see, I plan to do to you what I did to your partner, Mris-ste.”\u003c/p\u003e\n\u003cp\u003eThe Mec’s color changed again, once again glowing that deep, dark red. “So it was you. I suspected Michael, not his daughter.” He backed a step away from me, one of his hands slowly slipping inside his pockets.\u003c/p\u003e\n\u003cp\u003e“Give me the knife,” I demanded of Devyn without ever turning my attention.\u003c/p\u003e\n\u003cp\u003e“No,” was his reply.\u003c/p\u003e\n\u003cp\u003eI stomped my foot.\u003c/p\u003e\n\u003cp\u003e“I’m doing you another favor, Eden. I once had an enemy I despised with the same intensity you have for EenLi. I know that if you kill him too quickly, you will always regret it. Fight him. Beat him. Make him pay.”\u003c/p\u003e\n\u003cp\u003eIn the next instant, EenLi whipped out a gun. Devyntsked under his tongue and mentally swept the weapon across the room. It hit the floor with a thump. EenLi gasped, and I slowly stalked toward him. With every step I tried to center my energy, but that proved impossible. Too many hot emotions clamored for release.\u003c/p\u003e\n\u003cp\u003e“Targon,” he said, casting the king a nervous glance. “Help me, and I will—”\u003c/p\u003e\n\u003cp\u003e“This is between you and the Raka,” Devyn said. He grinned. “Enjoy, both of you. I know I will. Is there any popcorn? I love Earth popcorn.” He continued to mutter about the popcorn as he hopped off the stage and sat in a chair.\u003c/p\u003e\n\u003cp\u003eI sprang. EenLi leapt to the side, but I managed to kick his shoulder. As he stumbled, he growled low in his throat. We circled each other. His white eyes continually darted toward the door, and I knew he planned to run.\u003c/p\u003e\n\u003cp\u003eRealizing he could go nowhere without me following, he tried another tactic. “Do you think I knew nothing about you, Eden?” There was an evilness to his tone, a darkness that made me shudder. “I know more than you think.”\u003c/p\u003e\n\u003cp\u003eI didn’t respond. I just edged closer.\u003c/p\u003e\n\u003cp\u003e“I took great pleasure in enslaving you,” he gloated. “You, a trained assassin. You, Michael Black’s beloved daughter.\u003c/p\u003e\n\u003cp\u003eCloser.Closer. Like a tiger moving in for the kill, I circled him.\u003c/p\u003e\n\u003cp\u003e“I’d hoped the Targon could control you,” he said. “And I liked that Michael would never see you again, that he would always wonder what happened to you.”\u003c/p\u003e\n\u003cp\u003eI went low and kicked his ankles. Contact. He fell with a whoosh, but sprang up quickly. He pulsed with the barest hint of blue. “Why do you want to kill me so desperately, hmm?”\u003c/p\u003e\n\u003cp\u003e“For the pleasure of it.”\u003c/p\u003e\n\u003cp\u003e“You should want to destroy the one who killed your parents. Why do you think Michael took you in? He’d been assigned to kill your father. But your mother got in the way, so he killed her, too.”\u003c/p\u003e\n\u003cp\u003eFury boiled inside me, hotter, hotter. I sprinted toward him and jumped, spinning midair, crunching the heel of my boot into his nose. It snapped, and black-hued blood sprayed across the platform. “Liar,” I lashed out.\u003c/p\u003e\n\u003cp\u003eEenLi stumbled to his feet, blood and spittle trickling down his face, onto his lips. He struggled for air as his skin turned a mottled hue of purple. “I used to work for him. Did he tell you that?”\u003c/p\u003e\n\u003cp\u003eI knew what EenLi was doing. Offering a truth to make his lie appear believable. “I don’t believe trash like you, EenLi, so save your breath.” I hopped from foot to foot, and I moved toward him. No more playing.\u003c/p\u003e\n\u003cp\u003eHe ran to one of the sleeping guards and grabbed a weapon. His eyes gleamed with victory as he aimed the pyre-gun, but I was already on him. I kicked the gun from his hand, and it flew across the room.\u003c/p\u003e\n\u003cp\u003eI punted him in the chest. He swung at me as he tumbled down. His fist connected with my jaw, and my head whipped to the side.\u003c/p\u003e\n\u003cp\u003eHe was up and on me before I could blink, pushing me down and trying to choke me. I rocked back and wound my legs around his neck. With one hard jerk, he was sailing backward. I used the momentum to gain my footing and leapt to an upright position. I lunged for him as he, too, jolted to his feet. My head butted into his stomach, causing him to double over as his breath whooshed from his mouth.\u003c/p\u003e\n\u003cp\u003eStraightening, I beat my fists into his face like I was a machine, over and over, again and again. He fell onto the wood. I fell with him, never pausing. Blood flung left and right with every blow.\u003c/p\u003e\n\u003cp\u003eDevyn called from below, “Here.” His words reached my haze of destruction. “I’m getting bored. Finish it,” and he tossed me a knife.\u003c/p\u003e\n\u003cp\u003eI caught the hilt midair. EenLi gurgled something, perhaps, “No, please,” and tried to crawl away. I grabbed his head and positioned my knife. Then I slit his throat the way I’d wanted to from the beginning.\u003c/p\u003e\n\u003cp\u003eWhen his eyes glazed, I dropped his head with a thud. It wasn’t enough, though. Devyn had been right. It wasn’t enough. I wanted EenLi to suffer longer. I wanted him to suffer for eternity.\u003c/p\u003e\n\u003cp\u003e“Nicely done,” the Targon said.\u003c/p\u003e\n\u003cp\u003e“Give me your phone,” I commanded, wiping the Mec’s black blood onto my pants.\u003c/p\u003e\n\u003cp\u003eHe did so without another comment. As I strode to Lucius’s slumped, sleeping form, I dialed Michael. When he answered, I told him where I was.\u003c/p\u003e\n\u003cp\u003e“I know where you are,” he barked. “I tracked you with the isotope. You’ll notice I trusted you enough not to send my men in.”\u003c/p\u003e\n\u003cp\u003e“Bring a van and medical supplies.”\u003c/p\u003e\n\u003cp\u003eA pause.A hiss of breath. “Are you hurt? What’s—”\u003c/p\u003e\n\u003cp\u003e“I’m fine, Lucius isn’t. Hurry.” I hung up on him. I’d never done that before, but I didn’t know what else to say to him right now.\u003c/p\u003e\n\u003cp\u003eI tossed the phone back to Devyn and knelt beside the only man who had ever made me feel complete. I caressed my hands over his heartbeat. My shoulders slumped with relief when I felt a steady, even thumping. He would live.\u003c/p\u003e\n\u003cp\u003eEenLi was dead, the slaves were free. We had won.\u003c/p\u003e\n\u003cp\u003eSo why did I feel so lost? A lone tear slithered its way down my cheek.\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eIdidn’t allow Devyn to awaken Lucius.\u003c/p\u003e\n\u003cp\u003eI used my lover’s slumber to my advantage and parted his robe, checking his body for more injuries. His left shoulder sported a thick white bandage, and he had an assortment of bruises across his chest. Other than that, he appeared fine.\u003c/p\u003e\n\u003cp\u003eWinding one arm around his waist, I used the other to cut the bonds at his wrists. His weight immediately hit me, and I eased him to the ground as gently as I could.\u003c/p\u003e\n\u003cp\u003eGod, I’d missed him. I traced a fingertip over his stubbled jaw. This man had believed in me when my own father hadn’t. He might have lied to me about his reasons for becoming my partner, but in the end he had believed enough in me to let me work without trying to shield me or keep me safe at home.\u003c/p\u003e\n\u003cp\u003eWithout any prompting from me, Devyn cut down the rest of the sleeping slaves. When he reached a curvy blonde, he glanced over at me. “We bought this one, didn’t we?”\u003c/p\u003e\n\u003cp\u003e“You can’t keep her,” I replied on a strangled laugh.\u003c/p\u003e\n\u003cp\u003e“You’re keeping that one,” he said, motioning to Lucius with his chin.\u003c/p\u003e\n\u003cp\u003e“Yeah, but he’s willing to be kept.”\u003c/p\u003e\n\u003cp\u003eHe looked at the blonde, then back at me. “This one might be willing, too. I just need five minutes alone with her.”\u003c/p\u003e\n\u003cp\u003eI shook my head. “You can ask her if she wants to spend five minutes with you, but you can’t force her.”\u003c/p\u003e\n\u003cp\u003eHe pouted.\u003c/p\u003e\n\u003cp\u003eMichael and ten other agents burst into the warehouse moments later, pyre-guns drawn. When they realized everyone was sleeping, they lowered their weapons but remained on alert.\u003c/p\u003e\n\u003cp\u003e“Over here,” I called. Two agents reached me before Michael. “Take this man to a medic, then to my apartment.” I gave them the address, and they nodded.\u003c/p\u003e\n\u003cp\u003eTogether, they lifted Lucius into their arms. He moaned, the sound one of pain.\u003c/p\u003e\n\u003cp\u003e“Careful,” I snapped. “He’s injured.”\u003c/p\u003e\n\u003cp\u003e“Take him to my house,” Michael interjected. “I’ll have our doctors patch him up there.”\u003c/p\u003e\n\u003cp\u003e“Take him to a medic, then to my apartment, or I’ll introduce both of you to my knife.”\u003c/p\u003e\n\u003cp\u003eThey looked fearfully to Michael, because they knew I’d do it. He gave an abrupt nod. “Do what she says.”\u003c/p\u003e\n\u003cp\u003eAs the men tromped off with Lucius, I faced my father. Our gazes met, locked. We still had business to settle. “Everyone on the scaffold was kidnapped by EenLi to be sold as slaves. There are a few on the ground, as well.”\u003c/p\u003e\n\u003cp\u003e“And EenLi?” he asked.\u003c/p\u003e\n\u003cp\u003eI stood, shrugged. “Dead. By my hand.”\u003c/p\u003e\n\u003cp\u003eHis shoulders relaxed, and he ran a hand over his ragged features. “Then it’s over.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’m proud of you, Eden.” He reached out and squeezed my shoulder. “I don’t tell you that enough.”\u003c/p\u003e\n\u003cp\u003e“You’re proud, yes, but do you finally believe in me?”\u003c/p\u003e\n\u003cp\u003e“I’ve always believed in you.”\u003c/p\u003e\n\u003cp\u003eI brushed away his hold. “You paid men to look out for me, Michael. You never trusted me to do it on my own.”\u003c/p\u003e\n\u003cp\u003e“I was scared for you. There’s a difference.” He rubbed his temples. “Let’s get you home. You can write me up a full report in the morning. We’ll have breakfast and then you can get started on your next job. I’ve already got one lined up—”\u003c/p\u003e\n\u003cp\u003e“I told you I don’t work for you anymore.”\u003c/p\u003e\n\u003cp\u003e“We both know you didn’t mean it.” When I didn’t say anything, he kicked sand with the tip of his shoe. “Fine, if you don’t want to work for me, you don’t have to. Claudia Chow has been worried about you and has been calling me for two days. You can always go back to her and continue being her interpreter.”\u003c/p\u003e\n\u003cp\u003eI wasn’t going to do that, either. I didn’t know what I was going to do, actually. Biting my lip, I stared down at my boots and tried to prepare myself for the conversation I was about to start. Bringing it up was harder than killing a target but if I didn’t do it now, I wouldn’t.Just say it. “EenLi mentioned something about my parents. You and I never talk about them, but I need to know if you ever found out who killed them.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything. And as the moments ticked by, guilt washed over his still handsome features.\u003c/p\u003e\n\u003cp\u003eI blinked over at him. “Michael?”\u003c/p\u003e\n\u003cp\u003e“Eden,” he began before cutting himself off. “I’m so sorry. So sorry. I’ve wanted to beg your forgiveness for so long, but I couldn’t bring it up. I just couldn’t.”\u003c/p\u003e\n\u003cp\u003eIn that moment, I realized it was true. EenLi hadn’t lied. Deep down, I think I’d expected Michael to tell me EenLi had done it. But no, Michael had actually dealt the death blows. A sharp pain lanced through my chest, and I almost moaned. He’d never told me; he’d kept it secret all these years. Hadn’t trusted me to love him anyway. To forgive.\u003c/p\u003e\n\u003cp\u003eWith the realization, something inside me snapped, released. Anger and impotence for all the years I hadn’t talked about my parents because I’d assumed Michael didn’t want the reminder that he wasn’t my biological father.\u003c/p\u003e\n\u003cp\u003eI backhanded him. His head whipped to the side. Slowly he faced me, rubbing his now-bleeding lip.\u003c/p\u003e\n\u003cp\u003e“I deserved that,” he said calmly.\u003c/p\u003e\n\u003cp\u003eI stared into his face, the face I loved and had worshiped for so long. “Tell me why.”\u003c/p\u003e\n\u003cp\u003e“They were a job, sweetie. Only a job. They might have loved you, protected you, and treated you as a precious treasure, but they still sold drugs. Drugs that killed humans. I did what I had to do, what I was paid to do. How many parents have you killed?” he asked quietly, darkly. Pointedly.\u003c/p\u003e\n\u003cp\u003eLow blow.So low. My knees almost buckled as his words slammed into my mind, echoing over and over. The truth was, I didn’t know the answer to that question. The most likely answer was many.Many . I didn’t know how many parents, brothers, sisters, aunts, and uncles I’d killed over the years. Perhaps I hadn’t let myself consider the possibility. I’d always embraced my job—just as Michael did.\u003c/p\u003e\n\u003cp\u003e“Eden, I—” He reached for my hand.\u003c/p\u003e\n\u003cp\u003eI slapped his wrist. “Save it. I can’t talk to you right now. I’ll forgive you, yes, and I even understand, but I just can’t talk to you right now.”\u003c/p\u003e\n\u003cp\u003eI turned away from him then and helped the other agents separate EenLi’s men from the slaves and auctiongoers. The guards would be kept alive for another day or two and questioned, just in case there were any other humans stashed away. Then they would be killed. I didn’t know what would happen to the auction bidders. At this point, I just didn’t care.\u003c/p\u003e\n\u003cp\u003eMichael worked alongside me, silent and brooding. He loved me. I knew he did. And that made the torment inside me even worse.\u003c/p\u003e\n\u003cp\u003eDevyn worked with me, too. Michael ignored him, most likely still upset that I’d enlisted the king’s help instead of his. Lord, I felt so raw. I needed Lucius. His strength. His comforting arms.\u003c/p\u003e\n\u003cp\u003eWhen we finished clearing out the warehouse, I pulled Devyn aside. “Will you drive me home?” \u003c/p\u003e","sourceLink":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2/page-33.html","bookId":1767,"creation":"Oct 5, 2019 10:26:54 AM","modification":"Oct 5, 2019 10:26:54 AM"}
