{"id":72842,"no":1,"title":"Page 1","content":"\u003cp\u003eDetective Rico Santana knew there was going to be hell to pay. One way or the other, there always was when she was involved. If not from Rivera, his captain, then from the unrelenting ache in his cock and the lack of sleep that always followed any encounter with Skye Delano.\u003c/p\u003e\n\u003cp\u003eCarajo! He lusted after her. Maybe if he fucked her, it would get her out of his system.\u003c/p\u003e\n\u003cp\u003eRico gritted his teeth against the need he could already feel building, the anticipation. Now he was sorry he\u0027d brought along backup. If he just had some time alone with her he\u0027d...\u003c/p\u003e\n\u003cp\u003eShit. He needed saving...from himself. Fucking Skye would be professional suicide-maybe even personal suicide. Rico had a feeling that once would never be enough with her.\u003c/p\u003e\n\u003cp\u003eHe hit the turn signal and eased the unmarked police car toward an empty parking space. Out of the corner of his eye he saw Cia Caldwell\u0027s tight disapproving frown. She was the newest member of the department, and as far as he knew, she\u0027d never had any personal contact with Skye. She\u0027d heard the stories though, and read the captain\u0027s file.\u003c/p\u003e\n\u003cp\u003eHis mistake was calling Skye from the bullpen. When he\u0027d looked up, Detective Caldwell was standing next to his cubicle. \"Rivera is going to ream you,\" she\u0027d said before the phone had even hit its cradle.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be dark soon. They\u0027re not going to find those kids without Skye\u0027s help.\"\u003c/p\u003e\n\u003cp\u003eCia squared her shoulders. \"I\u0027m going with you.\"\u003c/p\u003e\n\u003cp\u003eA ripple of anger shot through Rico. He didn\u0027t need a babysitter.\u003c/p\u003e\n\u003cp\u003eA flash of sanity followed. Yeah, maybe it\u0027d be better.\u003c/p\u003e\n\u003cp\u003eThe captain was going to be pissed enough. At least this way Rivera would see it was all about finding the kids-not about finding an excuse to see Skye again.\u003c/p\u003e\n\u003cp\u003eCarajo! How could he be so hard when right now the only thing he should be thinking about was two missing kids?\u003c/p\u003e\n\u003cp\u003eRico parked the sedan in front of Skye\u0027s apartment complex. Caldwell had her door open before he could even turn off the engine. He grimaced and looked down at the bulge in the front of his pants. \"Wait here,\" he said.\u003c/p\u003e\n\u003cp\u003eCaldwell\u0027s mutinous expression let him know what she thought of his order. But he was the senior detective and she was new.\u003c/p\u003e\n\u003cp\u003eHe got out of the car, heart beating and cock throbbing. Every time he saw Skye the lust that rolled through his system made him think of standing in front of a wave of molten lava.\u003c/p\u003e\n\u003cp\u003eRico braced himself as he took the stairs up to her apartment and rang the bell. It was going to be worse this time. He knew that. Always before he\u0027d seen her at a crime scene or the station. He\u0027d never been alone with her in a place that might lead to something physical.\u003c/p\u003e\n\u003cp\u003eThe cop in him said he was crazy to go into this situation without backup. The man said he was a fool not to try and fuck her.\u003c/p\u003e\n\u003cp\u003eWhen the door swung open, Rico knew he couldn\u0027t keep denying what his body was telling him. Shit. Everything about Skye whispered of sex and dark mystery, danger. She was beautiful temptation, silver-blonde hair and jet-black lashes framing hypnotic pale blue eyes.\u003c/p\u003e\n\u003cp\u003eIn that second he didn\u0027t care whether the rumors about her were true or not. She was a fantasy. His fantasy.\u003c/p\u003e\n\u003cp\u003eRivera had warned him off her after the last search, when the perps responsible for kidnapping a couple of kids had turned up dead. The captain had told him more as a friend than as a commanding officer that a personal relationship with Skye could be the end of his career.\u003c/p\u003e\n\u003cp\u003eRico was a cop first. Came from a family of cops. Above everything else, that\u0027s what he was, what he\u0027d always wanted to be. A cop.\u003c/p\u003e\n\u003cp\u003eSo he\u0027d kept his distance. Avoided her. Until now.\u003c/p\u003e\n\u003cp\u003eNow the only thing he could think about was pressing her back into the apartment and taking her against the wall. On the floor. Eventually in the bed.\u003c/p\u003e\n\u003cp\u003eCarajo! The things he wanted to do to her, the things he wanted to let her do to him, actually shocked him.\u003c/p\u003e\n\u003cp\u003eShe half-smiled and it was like a fist around his dick, the ache was so bad. \"You came quick,\" she said and his heart jumped at her choice of words. He wondered if she\u0027d guessed how badly he wanted her. Fuck, he\u0027d be lucky if he lasted one stroke before shooting his load into her.\u003c/p\u003e\n\u003cp\u003eFor a minute all he could do was stare into her eyes. He thought he saw desire in them but he wasn\u0027t sure if it was real or imagined. All his cop instincts failed him when he was around her.\u003c/p\u003e\n\u003cp\u003eHe tried to focus on the reason he was here. The kids.\u003c/p\u003e\n\u003cp\u003eIt helped-some. \"Are you ready?\" he asked.\u003c/p\u003e\n\u003cp\u003eSkye studied the raven-haired cop standing in front of her. She could feel the lust pouring off of him, could read the fantasies even without delving into his mind.\u003c/p\u003e\n\u003cp\u003eHer body craved his, had from the first moment they\u0027d met.\u003c/p\u003e\n\u003cp\u003eIt\u0027d be so easy to get involved with him.\u003c/p\u003e\n\u003cp\u003eSo easy but so dangerous.\u003c/p\u003e\n\u003cp\u003eSo very, very dangerous.\u003c/p\u003e\n\u003cp\u003eShe stepped out of the apartment and locked the door behind her. \"Ready.\"\u003c/p\u003e\n\u003cp\u003eThere were still plenty of police cars present when they got to the search site. Without getting out of the car, Skye could sense the frustration and fatigue and worry that hovered over the group of cops.\u003c/p\u003e\n\u003cp\u003eThe search was winding down. If the kids were here, still alive, their chances decreased with another night spent in the woods. If they were somewhere else, the odds of being found alive dropped with every passing hour. Rico had told her that the abandoned rental car was the only lead-so far.\u003c/p\u003e\n\u003cp\u003eThey got out of the unmarked police car and Skye immediately felt Captain Rivera\u0027s frown. His hand twitched in an involuntary move to cross himself. He barked out an order to Rico, \"Santana, get over here!\"\u003c/p\u003e\n\u003cp\u003eShe half-smiled as she watched the female detective stick to Rico\u0027s side in an outward show of moral support even though Caldwell\u0027s tightly compressed lips let everyone know that she didn\u0027t approve of what Rico had done. It had been a chilly ride to the scene.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s she doing here?\" Rivera demanded. He didn\u0027t bother to keep his voice down, to keep the censure out of it. It was no secret that suspicion still burned in his gut from the last time she\u0027d been called in.\u003c/p\u003e\n\u003cp\u003eRico answered, \"She\u0027s here as a volunteer, Captain. The search is shutting down. I\u0027ll be off-duty and assisting her.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll also be off-duty and assisting,\" Detective Caldwell said.\u003c/p\u003e\n\u003cp\u003eA distraught couple huddled next to Captain Rivera, their eyes swinging from one cop to another. The man was rail-thin, tall, pale as an office worker. He cleared his throat. \"We\u0027d appreciate any help we can get.\" The woman clutched his arm, nodding at the officers. She was much shorter than the man, rounded in a way that suggested comfort, old-fashioned motherhood.\u003c/p\u003e\n\u003cp\u003eThe parents.\u003c/p\u003e\n\u003cp\u003eSkye pitied them.\u003c/p\u003e\n\u003cp\u003eJon and Karen Armstrong had come to Las Vegas on a family vacation, bringing with them their nineteen-year-old niece and their five-year-old daughter. It was supposed to be a win-win situation. The niece was having some family problems, so the trip would give her some time away from her parents. Jon and Karen would get a babysitter. Now the Armstrongs were trapped in an incomprehensible nightmare.\u003c/p\u003e\n\u003cp\u003eThey\u0027d gone out for dinner and gambling last night, left the niece, Brittany, babysitting their daughter, Callie, in the hotel room. When they got back at three in the morning, the kid, the niece, and the rental car were gone.\u003c/p\u003e\n\u003cp\u003eShortly after noon, the car had been located about thirty minutes outside of the city limits. The cops had been searching since then.\u003c/p\u003e\n\u003cp\u003eThe Armstrongs\u0027 grief and pain rolled over Skye, chased by Rivera\u0027s angry frustration. He was in a corner and hated it. There\u0027d be hell to pay if he tried to send her home now. Everybody watching the scene unfold knew it.\u003c/p\u003e\n\u003cp\u003e\"Get on with it,\" he growled to Rico. \"Anything goes wrong and it\u0027s your ass on the line.\" He expanded his glance to include Caldwell. \"Both of your asses.\"\u003c/p\u003e\n\u003cp\u003e\"Yes sir,\" Caldwell said.\u003c/p\u003e\n\u003cp\u003eRico nodded.\u003c/p\u003e\n\u003cp\u003eA dog and its handler emerged from the woods. \"Here\u0027s the last team, Captain,\" one of the cops standing nearby said.\u003c/p\u003e\n\u003cp\u003eSkye walked over to the rental car, knelt down next to the driver\u0027s door, let her senses flare out, flow backward with information. It was all part of her ability to hypnotize, only instead of applying it to others, it was self-directed. For periods of time she could become other-human in form but with the skills and instincts of an animal. The more she knew of the chosen animal, of its abilities, the closer the melding.\u003c/p\u003e\n\u003cp\u003eAs the scent washed over her, she briefly let herself become wolfen. Hunter. Tracker. Unashamed predator.\u003c/p\u003e\n\u003cp\u003eThe odor near the car was so strong that it burned her nostrils. Tainted blood. Rancid. Foul-smelling. Unnatural. Like the smell of death, and yet it wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eThe scent belonged to someone who\u0027d been in the car. The odor lingered on the door handle, went around the car and headed toward the woods.\u003c/p\u003e\n\u003cp\u003eThere were other scents around the car. A female, young, healthy. Another person whose blood reeked of something horrible. A new drug? A new disease? It wasn\u0027t cancer in any one of its numerous forms. It wasn\u0027t HIV or AIDS. Skye knew those smells too well.\u003c/p\u003e\n\u003cp\u003eAll of the scents led to the woods. She followed them to the edge, found they were joined by other scents. More tainted blood. Altogether, five different people with it. Skye couldn\u0027t tell whether they were male or female. That had never happened before.\u003c/p\u003e\n\u003cp\u003eShe tracked the other smells backward, stopped at the cluster of parked cars. The five people had all been here, had probably left together in another car. The healthy female didn\u0027t go with them.\u003c/p\u003e\n\u003cp\u003eDetective Caldwell moved alongside Skye. \"You ready to start now? Everybody is standing around waiting.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Skye\u0027s voice came out with a hint of humor but the detective didn\u0027t notice.\u003c/p\u003e\n\u003cp\u003eThey walked back to the rental car. The parents were there. They looked at Skye with desperate hope.\u003c/p\u003e\n\u003cp\u003e\"Thank you for coming,\" the woman said. Skye nodded, inhaled, would know which scent belonged to the mother.\u003c/p\u003e\n\u003cp\u003eThe man offered a handshake, \"I\u0027m Jon Armstrong, this is my wife Karen.\" Skye accepted the extended hand, took his scent along with it.\u003c/p\u003e\n\u003cp\u003eRico asked, \"You ready for the inside of the car? The crime scene guys have already come and gone.\" Skye nodded and he opened the door.\u003c/p\u003e\n\u003cp\u003eThe smell of tainted blood was even stronger in the closed confines of the car. It almost gagged her. She took a minute to focus, to begin the task of separating out the different scents-Jon Armstrong, Karen, foul blood times two-close in smell but slightly different, the healthy female who went into the woods, another healthy female, this one a child with a hint of shampoo-not baby shampoo but something else. Skye sorted through the scents lodged in her memory until she found the one she was looking for-Pert shampoo. There were other smells, cops, then fainter scents-rental car workers probably, or people who\u0027d rented the car before the Armstrongs.\u003c/p\u003e\n\u003cp\u003eShe stood up, stepped back from the car and nodded to Rico. He closed the door, shifting so he was standing next to the parents and the captain. A small cluster of cops was huddled with them.\u003c/p\u003e\n\u003cp\u003eThe dog and handler stood off to the side. \"Need a scent article?\" the handler asked, part serious, part joking, in large part frustrated by lack of success. He held up a plastic bag with a stuffed animal in it. Skye\u0027s lips tilted up for a second. \"No thanks.\"\u003c/p\u003e\n\u003cp\u003eShe turned to the waiting cops and parents. \"The child was never here. The niece was. She went into the woods with five other people. Two came in the car with her. Three arrived in another car. The five probably left together in the other vehicle.\"\u003c/p\u003e\n\u003cp\u003eThe search-and-rescue dog handler scowled at Rico. \"You tipped her off.\"\u003c/p\u003e\n\u003cp\u003eSkye looked at Rico and raised an eyebrow in question. He shrugged. \"The dogs haven\u0027t been able to pick up a trace of Callie, either. They get a start on Brittany but lose it.\"\u003c/p\u003e\n\u003cp\u003eThe woman began weeping. Her husband pulled her against his shoulder. \"Are you sure Callie was never here?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. She uses Pert shampoo. Her scent doesn\u0027t leave the car here.\" The woman\u0027s weeping grew more intense.\u003c/p\u003e\n\u003cp\u003e\"Mr. Armstrong, is that the shampoo your daughter uses?\" Captain Rivera asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. Yes. She\u0027s got her own little bottle of it. She\u0027s the only one who uses it.\" Jon Armstrong\u0027s voice was strained, tight with emotion.\u003c/p\u003e\n\u003cp\u003eRivera sighed and gave the order, \"Okay, Santana, get the civilian outfitted with a tracking unit and a radio. I\u0027m considering you and Caldwell officially on duty and in charge of supervising the civilian. I expect you to keep me current on the situation out here. Is that understood?\"\u003c/p\u003e\n\u003cp\u003eThe detectives agreed and returned to the unmarked car with Skye. She strapped a leather sheath onto her leg, checking to make sure the knife it held was secure. She could feel the captain\u0027s gaze burn into her back. He\u0027d arrest her if he could do a search and find the switchblade she always carried.\u003c/p\u003e\n\u003cp\u003e\"The knife is driving the captain crazy,\" Rico said, standing so close that Skye could smell his aftershave and feel his body heat. She let it fill her senses, wrap around her like a warm blanket.\u003c/p\u003e\n\u003cp\u003eSkye half-smiled. \"Does he want me to go in unarmed?\"\u003c/p\u003e\n\u003cp\u003eRico pulled his eyes away from the long knife. His expression was all cop. Against his will he was thinking about the last search, about the men who\u0027d kidnapped a young brother and sister to use in their porn movies.\u003c/p\u003e\n\u003cp\u003eAfter the children were found the trail had gone cold...until a couple of cops from another department had stumbled on the perps. They were in a motor home parked in the desert but they weren\u0027t alive and hadn\u0027t been for days. They\u0027d been knifed and left to rot.\u003c/p\u003e\n\u003cp\u003eLooking at the knife Rico wondered...and he didn\u0027t want to. He knew what the captain thought. Everyone knew what Rivera suspected.\u003c/p\u003e\n\u003cp\u003eShe\u0027d voluntarily surrendered the knife for testing. It didn\u0027t match the murder weapon. But she could own other knives.\u003c/p\u003e\n\u003cp\u003eRico shook his head to clear the unwelcome speculation from his mind. He didn\u0027t want to think she could kill like that. \"You know Rivera would rather you didn\u0027t go in at all,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"You asked me, Rico.\" Her eyes met his. \"Sorry now?\" It was barely a whisper, yet it slipped past his guard. His dark eyes locked to hers though she made no effort to pull him into their depths.\u003c/p\u003e\n\u003cp\u003eRico couldn\u0027t keep his pulse from racing. When this was over... He tried to close his mind against the fantasy, against the need. \"No, I\u0027m not sorry.\"\u003c/p\u003e\n\u003cp\u003eCaldwell saw the look pass between the two of them. Her lips tightened until they almost disappeared altogether. \"Ready?\" Her voice came out more strident than she\u0027d intended but it achieved its goal. The heated, unspoken exchange between Rico and Skye ended. Their gazes broke apart.\u003c/p\u003e\n\u003cp\u003eSkye positioned the camelback full of water onto her back then double-checked the medical supplies and power bars zipped into its pockets. Rico handed her the police tracking unit and radio so that she could slide them onto a belt around her waist.\u003c/p\u003e\n\u003cp\u003eHe knew there was no point in suggesting that someone go with her. Even if she agreed, she\u0027d soon lose them. On the last search she\u0027d traveled miles by foot, run most of it, outdistanced and outlasted the team following her. \"Check in at intervals. Okay?\"\u003c/p\u003e\n\u003cp\u003eAlready Skye could feel the pull of the hunt, the call to be other. \"Sure.\"\u003c/p\u003e\n\u003cp\u003eRico saw the way her eyes changed, deepened into bottomless blue pools of color. It was one of the things that bothered the captain so much. Rico cursed himself. He should be spooked by her, not turned on. \"Don\u0027t use the knife unless it\u0027s life or death,\" he said.\u003c/p\u003e\n\u003cp\u003eAnother half-smile but no reply. She was already hunting. Rico stepped away and Skye went to the edge of the woods, focused on the stench of tainted blood. It was so strong that she didn\u0027t have to bend down to smell it. The dogs could have easily tracked it but they had no way to tell their handlers it was there.\u003c/p\u003e\n\u003cp\u003eMiles passed. Hours passed. She was not aware of either. Her sole focus remained on the stench of tainted blood. Somewhere along the way the scent of healthy female faded, became so faint that it almost disappeared. But not completely.\u003c/p\u003e\n\u003cp\u003eOccasionally the radio came to life, startling her. The intervals became more frequent as the night wore on.\u003c/p\u003e\n\u003cp\u003eMidnight came and went.\u003c/p\u003e\n\u003cp\u003eHer adrenaline began to surge. Had she been an animal she might have lifted her face to the sky and howled. She was close. Instinct told her she was close now.\u003c/p\u003e\n\u003cp\u003eThe woods opened to a clearing. Here she sensed death. Felt it. Smelled it.\u003c/p\u003e\n\u003cp\u003eIt was not the obvious smell of a carcass left in the open.\u003c/p\u003e\n\u003cp\u003eBut more the lingering presence of a life violently taken.\u003c/p\u003e\n\u003cp\u003eShe halted in the clearing. Absorbed her surroundings.\u003c/p\u003e\n\u003cp\u003eThere was a partially erased circle traced in the ground. Tainted blood had been sprinkled along the edges of it. Death had come here. In this circle.\u003c/p\u003e\n\u003cp\u003eThe scent trail led out of the circle, across the clearing, to a pile of rocks in a shallow ravine. The animals had helped themselves to what they could dig out. Part of an arm protruded from a pile of rocks, its skin shredded. An upper leg bone glistened, stripped clean of meat.\u003c/p\u003e\n\u003cp\u003eSkye didn\u0027t need to uncover the face to know it was the niece. Her scent lingered over the body like a disenfranchised spirit.\u003c/p\u003e\n\u003cp\u003eThe radio crackled. This time it was Caldwell. \"Anything to report?\"\u003c/p\u003e\n\u003cp\u003e\"I found the niece. She\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"Do not touch the body!\" Caldwell barked through the radio. \"Do not contaminate the scene!\" In the darkness Skye shook her head, almost laughing out loud. She\u0027d be glad when this was over, when Caldwell could disappear back into the sea of police blue.\u003c/p\u003e\n\u003cp\u003eA second later Rico\u0027s voice flowed out of the radio. \"What\u0027s the situation there?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in a shallow ravine. The niece is buried under rock. One arm and part of a thigh have been exposed by animals. Actual scene of death took place in a clearing approximately forty yards behind me.\"\u003c/p\u003e\n\u003cp\u003e\"Stand by while I contact the captain.\"\u003c/p\u003e\n\u003cp\u003eSkye knelt next to the body and examined the wrist more closely. The tear there was too smooth to be from an animal and there was very little blood on the ground. She let her senses flare out, flow backward with information. Most of the blood was missing from the body.\u003c/p\u003e\n\u003cp\u003eThe hairs on the back of her neck moved away from her skin. She stood and walked to the clearing, looked at the broken circle, smelled the stench of tainted blood, and knew that whatever had transpired here, it was dark and evil. Something to be avoided.\u003c/p\u003e\n\u003cp\u003eA coyote song erupted in the distance. Joyous, excited. There was prey nearby, it sang. The hunt was on. The kill was near. Other voices joined the song, filling the night air with their excited cadence.\u003c/p\u003e\n\u003cp\u003eSkye drank it in, allowed it to flow through her then stilled as thoughts of the missing five year old filled her. Intuition or uncanny ability, it didn\u0027t matter which, she knew with certainty that the coyotes had found Callie. And that the little girl was still alive.\u003c/p\u003e\n\u003cp\u003eOnce again the radio came to life. Rico said, \"A team is on its way. We\u0027ve got your coordinates. Stay put. We\u0027ll come in as soon as they get here.\"\u003c/p\u003e\n\u003cp\u003eSkye lifted the radio to her mouth. \"Can you hear the coyotes?\"\u003c/p\u003e\n\u003cp\u003e\"Jesus, yes, it\u0027s giving me the creeps.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve found the little girl. I\u0027m going to cut across land and follow the sound.\"\u003c/p\u003e\n\u003cp\u003e\"No. Stay put. That\u0027s an order.\" This from Caldwell.\u003c/p\u003e\n\u003cp\u003eSkye grimaced. \"I\u0027ll leave the tracking device on a tree near the body, in case you need the signal to find it.\"\u003c/p\u003e\n\u003cp\u003e\"Stay put!\" If Caldwell could have come through the radio and physically restrained Skye, she would have.\u003c/p\u003e\n\u003cp\u003eSkye ignored her. \"Rico, are you there?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll keep the radio. But it\u0027ll be off. I\u0027ll call you when I can. I can\u0027t risk the coyotes hearing it before I get close.\"\u003c/p\u003e\n\u003cp\u003eShe could hear his sigh. Knew he wouldn\u0027t argue with her. This was why he\u0027d contacted her and asked her to come to the site. This was why he\u0027d risked pissing off his friend and captain.\u003c/p\u003e\n\u003cp\u003e\"Do you think she\u0027s still alive?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"At this moment. Yes.\"\u003c/p\u003e\n\u003cp\u003eAnother song went up in the distance. More excited. More urgent.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be in touch.\" Skye turned off the radio before either of the cops could respond. She secured the tracking unit to a tree then let the sound of the coyotes fill her again, let herself sink more deeply into their world. There was little time left now, not if the child was to stay alive. \u003c/p\u003e","sourceLink":"https://allnovel.net/skye-s-trail-the-angelini-1/page-1.html","bookId":1765,"creation":"Oct 5, 2019 10:25:54 AM","modification":"Oct 5, 2019 10:25:54 AM"}
