{"id":42593,"no":10,"title":"CHAPTER X. SETH LAWTON.","content":"\"Mr. Lawton,\" said Loammi, \"this boy is Scott Walton. His mother was a cousin of ours. Pa has given him a place in the store, because he hasn\u0027t any money.\"\n\u003cbr\u003e \n\u003cbr\u003e Seth Lawton looked at Scott eagerly.\n\u003cbr\u003e \n\u003cbr\u003e \"My boy,\" he said, grasping Scott\u0027s hand, \"your mother was my favorite cousin. Poor Lucy, when I last saw her she was just married to your father. Is she—is she dead?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir,\" answered Scott. \"She died when I was but five years old.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Poor Lucy, poor girl!\" said the old man, sighing. \"And your father?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is dead, too. He died but a few weeks since on the ship that brought us over from Liverpool.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And there were no other children?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I was the only one.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 81]\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Lawton,\" said Loammi, who had been listening impatiently, \"you must excuse me, as I must go upstairs and prepare for dinner.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Lawton scarcely noticed Loammi\u0027s unceremonious exit, he was so occupied with Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"So you are my cousin, too,\" he said, in a softened voice. \"I never saw you before, but I know I shall like you. You have a look like your mother.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I was thought to look like mother,\" said Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"How old are you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall be sixteen in a few weeks.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are young to be an orphan. I judge from what your cousin says that you were left poor.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, father was unfortunate. He was so honest himself that he allowed people to cheat him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"There are too many such cases. But I am glad that Cousin Ezra has opened his heart and given you a home.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Scott, briefly.\n\u003cbr\u003e \n\u003cbr\u003e He was not disposed to be ungrateful, but it did not seem to him that he owed a very large debt of gratitude to Mr. Little, who had taken[Pg 82] all his money and merely gave him his board in return for his services in the store.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you find your cousin—what is his name?—a pleasant companion?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Loammi and I do not see much of each other, Mr. Lawton.\"\n\u003cbr\u003e \n\u003cbr\u003e Seth Lawton looked at Scott shrewdly.\n\u003cbr\u003e \n\u003cbr\u003e \"I am not surprised to hear it,\" he said. \"Loammi reminds me of his father very strongly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He looks upon me as a poor relation,\" continued Scott, smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you mind that much?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A little. I don\u0027t mean to be poor always.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A wise determination. So you have a place in the store?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How do you like that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very much. I like business. I don\u0027t have much to do with Mr. Little there, but the superintendent, Mr. Allen, is just, and encourages me to do my best.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad to hear that. Do you think Ezra is prosperous?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I should think so. He seems to be doing a good business.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Does he strike you as a good manager?\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 83]\n\u003cbr\u003e \n\u003cbr\u003e \"He keeps down expenses. The clerks say that he pays poorer wages than anyone in the trade.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That isn\u0027t always the sign of a good manager,\" said Seth Lawton, slowly. \"Clerks will always work better for a generous employer. So, on the whole, Ezra may be considered well-to-do?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am always glad to hear that my friends—and relatives are prospering.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t look as if you were very prosperous yourself,\" thought Scott. \"I suppose you, too, are a poor relation.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How much does Ezra pay you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"My board.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That wouldn\u0027t be bad if you were a stranger. But how do you manage about clothes?\"\n\u003cbr\u003e \n\u003cbr\u003e \"My father left me fifty dollars. Mr. Little took charge of it, and I suppose he will buy me clothing out of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Humph!\" said Seth Lawton, dryly. \"He seems to put everything on a business basis.\"\n\u003cbr\u003e \n\u003cbr\u003e Just then the door opened, and Ezra Little entered the room. He was prepared to see Mr. Lawton, Loammi having apprised him of his arrival.\n\u003cbr\u003e \n\u003cbr\u003e He came forward, eying Mr. Lawton closely.\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027s as poor as poverty!\" he said to himself.[Pg 84] \"He doesn\u0027t seem to have made much of a success.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This is a surprise, Seth,\" said he, offering his hand coldly. \"I had almost forgotten you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very natural, Cousin Ezra,\" said the old man, smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"Where have you been all these years?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have been a wanderer, Ezra. I have been in America for the last few years. I came from Michigan last.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you married?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; I am alone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps it is just as well. You have been at less expense.\"\n\u003cbr\u003e \n\u003cbr\u003e \"True. You, however, have married, and, as I judge, are prosperous.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I have a good business on Eighth Avenue,\" said Ezra Little, complacently. \"I haven\u0027t been a rolling stone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Like me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, yes, like you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And so you have gathered some moss.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; I think it a duty to succeed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"If possible.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A man can succeed if he goes to work the right way,\" said Ezra, dogmatically.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 85]\n\u003cbr\u003e \n\u003cbr\u003e \"Well, perhaps so,\" admitted Seth, slowly.\n\u003cbr\u003e \n\u003cbr\u003e \"How long have you been in New York?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I arrived last week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"From Michigan?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you plan to stay here?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I have not quite decided. I took a little while to get settled, and then I looked you up in the directory. But I have found more than I bargained for. I did not know that any of Lucy\u0027s family were in America,\" and he nodded in the direction of Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered Ezra, with a slight frown; \"Scott\u0027s father took it into his head to come to America when he was in the last stages of consumption. He died on the passage leaving his son to the cold mercies of the world.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you kindly took him into your home?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I couldn\u0027t see him starve,\" said Mr. Little, ungraciously. \"So I gave him a place in my store.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hope he is doing well there.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, yes, he is doing well enough. The work is not hard.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So that you receive some equivalent for your kindness.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 86]\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I could get a boy to do the same work for three dollars a week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Ezra, I think you won\u0027t lose anything by your kindness to an orphan relative.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will do what I can for him, but I can\u0027t undertake to help any more poor relations.\"\n\u003cbr\u003e \n\u003cbr\u003e His tone was significant, and Seth understood it, but his feelings did not seem to be hurt.\n\u003cbr\u003e \n\u003cbr\u003e \"Possibly you were thinking of me, Ezra,\" he said, mildly.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you a poor relation?\" asked Ezra Little, bluntly.\n\u003cbr\u003e \n\u003cbr\u003e \"That is hard to tell. Ideas of poverty are comparative. I have always supported myself, and I hope I shall continue to do so. In a great city like this I can surely find something to do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think you would better have remained in Michigan. What were you doing there?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I kept books for a man in the lumber business,\" answered Seth.\n\u003cbr\u003e \n\u003cbr\u003e \"You couldn\u0027t get a chance to keep books here. Your age would be against you, for one thing, Seth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am only fifty-six, Ezra.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is old when you are seeking a position.[Pg 87] I hope you have some money to fall back upon.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have a little, and then I was always able to live frugally.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is wise. You might, perhaps, expect that I would give you a place in my store, but you would not do for the dry-goods business.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think I should,\" said the old man, candidly. \"I have never been accustomed to very close confinement.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Pa, supper\u0027s ready!\" announced Loammi, opening the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you walk out and take supper with us, Seth?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Ezra. It will be pleasant to sit down with relations. It is many years since I have done so.\"\n\u003cbr\u003e \n\u003cbr\u003e Seth Lawton was introduced to Mrs. Little, who greeted him kindly, though, like her husband and son, she looked upon him as a poor relation. She had a better disposition than they, and was not so worldly minded.\n\u003cbr\u003e \n\u003cbr\u003e Seth Lawton was seated next to Scott on one side of the table. Opposite sat Loammi.\n\u003cbr\u003e \n\u003cbr\u003e \"Put the two poor relations together, ma,\" he had said to his mother, beforehand. \"Pa\u0027ll have his hands full if any more come to the city.\"[Pg 88]\n\u003cbr\u003e \n\u003cbr\u003e \"They are not to blame for their poverty,\" returned Mrs. Little.\n\u003cbr\u003e \n\u003cbr\u003e \"I should hate to be poor,\" said Loammi, emphatically.\n\u003cbr\u003e \n\u003cbr\u003e \"Your father and I were poor once.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you got bravely over it. That\u0027s because pa was smart. This old man—Seth Lawton—looks as if he wasn\u0027t worth a hundred dollars, and he must be ten years older than pa.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57972.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
