{"id":42611,"no":28,"title":"CHAPTER XXVIII. ON WATCH.","content":"There was nothing especially noticeable about the chamber into which Scott and the earl were ushered. It was a corner apartment, and had two windows on different sides of the room.\n\u003cbr\u003e \n\u003cbr\u003e There was a double bed, a washstand, a small table, and two chairs, besides a plain pine bureau. There was no carpet on the floor, but beside the bed was a cheap rug.\n\u003cbr\u003e \n\u003cbr\u003e \"Will this do you?\" asked the woman, as she set the candle on the table.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered the earl, after a comprehensive glance around the room.\n\u003cbr\u003e \n\u003cbr\u003e \"We don\u0027t keep a hotel. If we did——\"\n\u003cbr\u003e \n\u003cbr\u003e \"My good lady, make no apologies. We are obliged to you for taking us in.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hope you\u0027ll sleep well,\" said the woman, with her hand on the latch.\n\u003cbr\u003e \n\u003cbr\u003e \"We generally do,\" replied the earl.\n\u003cbr\u003e \n\u003cbr\u003e \"Ah!\" she said, and there seemed something significant in her tone.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 236]\n\u003cbr\u003e \n\u003cbr\u003e She opened the door and went downstairs, leaving the two travelers alone.\n\u003cbr\u003e \n\u003cbr\u003e \"This isn\u0027t very luxurious, Mr. Grant,\" remarked Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose you are used to a luxurious house?\"\n\u003cbr\u003e \n\u003cbr\u003e \"When I am at home—yes; but I have knocked about the world so much that I can stand a little discomfort. How is the bed?\"\n\u003cbr\u003e \n\u003cbr\u003e He felt of the mattress, and found that it was of straw. Had there been a feather bed over it there would have been greater comfort.\n\u003cbr\u003e \n\u003cbr\u003e \"Only a straw bed,\" he said. \"This is, certainly, Spartan simplicity. I don\u0027t think Red Ralph would be a success as an innkeeper.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think I can sleep, Mr. Grant,\" rejoined Scott. \"I feel quite tired.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is there a lock on the door?\"\n\u003cbr\u003e \n\u003cbr\u003e Scott went forward to examine.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he reported, \"there is a lock, but no key.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is there a bolt?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I wonder,\" said the earl, very thoughtfully, \"whether the key has been lost or intentionally removed?\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 237]\n\u003cbr\u003e \n\u003cbr\u003e \"We might ask for a key.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No. That would make it evident that we were distrustful. Besides, it may be that the people below are not aware that there is no means of locking them out. On the whole, we will not call attention to our defenseless condition.\"\n\u003cbr\u003e \n\u003cbr\u003e While they were talking, a step was heard on the stairs—a heavy step, too heavy for the woman. Then came a knock at the door.\n\u003cbr\u003e \n\u003cbr\u003e Scott opened it.\n\u003cbr\u003e \n\u003cbr\u003e There stood Red Ralph, holding in his hand a pitcher and glass.\n\u003cbr\u003e \n\u003cbr\u003e \"I have brought you a nightcap,\" he said. \"I had my wife mix some whisky and water. It is good for the stomach. I drink some every night before I go to bed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you,\" returned the earl, politely. \"You are very considerate.\"\n\u003cbr\u003e \n\u003cbr\u003e He took the pitcher and set it down on the table. Red Ralph lingered a moment, and his eyes wandered about the apartment.\n\u003cbr\u003e \n\u003cbr\u003e There was nothing to see, however, as the travelers had brought no luggage with them, not expecting to be detained overnight.\n\u003cbr\u003e \n\u003cbr\u003e \"I hope that you will be comfortable,\" he said, cordially.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 238]\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you sleep sound?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Generally. Do you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I never wake from the time I strike the bed. At what hour shall I wake you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"At seven.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good! I will tell the wife to have breakfast at half-past seven.\"\n\u003cbr\u003e \n\u003cbr\u003e \"By the way, may I trouble you to look after my horse? I meant to go out to the barn before I retired.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will look after him. I am used to horses. I am a horse trader.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you. Good-night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good-night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Our friend is unusually attentive,\" said the earl, with a glance at the pitcher.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; perhaps we have misjudged him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps, but I am not sure. Scott, will you hold the candle?\"\n\u003cbr\u003e \n\u003cbr\u003e He took the pitcher and peered into it attentively, rather to Scott\u0027s surprise. Then he poured out a small quantity, and tasted it.\n\u003cbr\u003e \n\u003cbr\u003e \"I hope you will excuse me from drinking, Mr. Grant,\" said Scott. \"I promised my father I would never drink whisky.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 239]\n\u003cbr\u003e \n\u003cbr\u003e \"Even if you did indulge, I should not advise you to drink any of this.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why not? Is it of poor quality?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am quite confident that it is drugged. It has a peculiar taste, and I detect minute particles of some foreign substance which has been mixed with it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Poison?\" asked Scott, looking startled.\n\u003cbr\u003e \n\u003cbr\u003e \"Not so bad as that. It is only a sleeping potion. Our friend had an object in asking if we slept soundly. He means that we shall.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you quite sure the whisky has been tampered with, Mr. Grant?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am reasonably sure of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then of course we won\u0027t drink it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly not, but we will appear to have done so. Open the window.\"\n\u003cbr\u003e \n\u003cbr\u003e The earl poured out a glass of the whisky and emptied it out of the window. He filled the glass a second time, and again emptied it.\n\u003cbr\u003e \n\u003cbr\u003e \"That is better than to have swallowed it,\" he said. \"I will leave a small portion in the pitcher to disarm suspicion.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What do you think Red Ralph intends to do?\" asked Scott, in a low tone.\n\u003cbr\u003e \n\u003cbr\u003e \"I think he intends to make us a visit during[Pg 240] the night. As there is no way of locking the door, that will be very easily managed. Had we drunk the whisky, we should have slept so profoundly that Ralph could have ransacked the room without interference.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you a pistol, Mr. Grant?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, but I might as well be without one. I have no means of loading it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What, then, do you propose to do?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is not easy to decide.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Can we secure the door in any way?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I can think of no way.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We might put the bureau against it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; I will consider whether that is best. It interposes only a temporary obstacle. Then Ralph and his companion may be armed, while we are not. The two would be more than a match for us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose they would be satisfied if you would give up your money.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Probably, but though the loss of the money would not seriously embarrass me—it is only five hundred dollars—I decidedly object to being robbed of it. By the way, have you a newspaper with you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, Mr. Grant. Here it is.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 241]\n\u003cbr\u003e \n\u003cbr\u003e The earl took the paper, and carefully tore it into strips about the size of a bank bill. Then he removed the bank bills from his wallet, put them in an inside pocket in his vest, and replaced them with strips of newspaper.\n\u003cbr\u003e \n\u003cbr\u003e \"It is a good plan to oppose roguery with artifice,\" he said. \"Possibly this will help to circumvent the enemy.\"\n\u003cbr\u003e \n\u003cbr\u003e Scarcely had he done this when Ralph\u0027s step was heard on the staircase, and a moment afterward there was a knock at the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Open it, Scott.\"\n\u003cbr\u003e \n\u003cbr\u003e There stood Ralph, smiling craftily.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you drunk the whisky, gentlemen?\" he asked. \"Would you like to have me fill the pitcher again?\"\n\u003cbr\u003e \n\u003cbr\u003e \"We shall not need any more, thank you,\" said the earl. \"Perhaps you will kindly take the pitcher?\"\n\u003cbr\u003e \n\u003cbr\u003e Ralph looked into the pitcher, and his face indicated satisfaction. From the little that remained he felt assured that both his guests had drunk liberally.\n\u003cbr\u003e \n\u003cbr\u003e \"I hope you liked it,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"You were very kind to think of us,\" rejoined the earl, avoiding a reply to his question.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 242]\n\u003cbr\u003e \n\u003cbr\u003e \"Won\u0027t you let me fill the pitcher?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, we shall not need any more. I think you said it would make us sleep sound?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It has that effect upon me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think you are right. I can hardly keep my eyes open,\" and the earl yawned ostentatiously.\n\u003cbr\u003e \n\u003cbr\u003e \"I feel the same way,\" added Scott.\n\u003cbr\u003e \n\u003cbr\u003e Red Ralph smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, \"I am sure you will have a good night\u0027s sleep. I will remember to call you at seven. I won\u0027t stay any longer, for you must wish to retire.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good-night, then.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Now,\" said the earl, when the coast was clear, \"we must decide what to do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Shall we go to bed?\"\n\u003cbr\u003e \n\u003cbr\u003e \"We will lie on the bed, but it will be better not to undress. We must be prepared for any contingency.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Shall I move the bureau against the door?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No. We will try to keep awake for an hour. My opinion is that our friend will make us a visit within that time.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57990.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
