{"id":42615,"no":32,"title":"CHAPTER XXXII. A LARGE OPERATION.","content":"Scott found a letter awaiting him at the hotel, of the following purport:\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"We are notified that the stock of Frost, Burks \u0026amp; Co., of Buffalo, will be sold at a great sacrifice. We append a list of articles that we would like to buy if they will be sold at, say sixty per cent. of the ordinary wholesale price. At that rate, you may buy without limit, or you can take the whole stock if a commensurate reduction should be made.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Tower, Douglas \u0026amp; Co.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott went to Buffalo in the same train as Ezra Little, but in a different car, so that the latter did not know his humble cousin was on board. The earl went along, and proposed to look about the city while his young companion was engaged.\n\u003cbr\u003e \n\u003cbr\u003e Scott took a cab, feeling that the emergency justified it, while Ezra Little waited a considerable time for a horse car. The result was that Scott[Pg 271] was with the assignee twenty minutes before Mr. Little arrived.\n\u003cbr\u003e \n\u003cbr\u003e When Scott was introduced, the assignee, a gentleman named Clark, regarded him impatiently.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ve no time to waste with boys,\" he said. \"I am very busy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am a boy,\" replied Scott, quietly, \"but I represent the firm of Tower, Douglas \u0026amp; Co., of New York. There is my card.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is this really so?\" asked the assignee, almost incredulous.\n\u003cbr\u003e \n\u003cbr\u003e \"You can rely upon it. What could be my object in making a false representation?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well, Mr. Walton. Are you empowered to purchase?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To what extent?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That depends on the terms I obtain. I may take your whole stock if there\u0027s sufficient inducement.\"\n\u003cbr\u003e \n\u003cbr\u003e The assignee looked amazed.\n\u003cbr\u003e \n\u003cbr\u003e \"We shall certainly prefer to sell the entire stock to one purchaser.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And will you make it worth my while?\"\n\u003cbr\u003e \n\u003cbr\u003e \"What terms do you offer?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Half cash, half on thirty days.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 272]\n\u003cbr\u003e \n\u003cbr\u003e \"That will be satisfactory.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you an inventory?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott looked it carefully over. He was offered even better terms than his employers had stipulated for.\n\u003cbr\u003e \n\u003cbr\u003e At the end of half an hour he had agreed to purchase the entire stock, conditioned upon the amount and quality of goods being as represented. He knew enough of the value of goods to feel that he had made a good bargain for the firm.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, Ezra Little and Loammi had arrived.\n\u003cbr\u003e \n\u003cbr\u003e \"There\u0027s a gentleman with Mr. Clark,\" said a clerk.\n\u003cbr\u003e \n\u003cbr\u003e \"Please carry in my card,\" ordered Mr. Little, pompously.\n\u003cbr\u003e \n\u003cbr\u003e He felt that his name would secure respectful consideration.\n\u003cbr\u003e \n\u003cbr\u003e But he had to wait half an hour. Then, on entering the office, he found to his surprise Scott ahead of him. He nodded to him coolly, and in a tone of some importance said: \"Mr. Clark, I have come to look over your stock, and if I find it and your terms satisfactory I may make considerable purchases.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 273]\n\u003cbr\u003e \n\u003cbr\u003e \"I am sorry to disappoint you, Mr. Little,\" said the assignee, referring to the card in his hand, \"but you are too late.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How am I too late?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have sold the entire stock to one party.\"\n\u003cbr\u003e \n\u003cbr\u003e Ezra Little looked astonished and disappointed.\n\u003cbr\u003e \n\u003cbr\u003e \"May I ask to whom you have sold?\" he inquired.\n\u003cbr\u003e \n\u003cbr\u003e \"To this young man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To that boy?\" ejaculated Ezra Little.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; he represents the great New York firm of Tower, Douglas \u0026amp; Co.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is a mistake,\" said Ezra, indignantly. \"He is an impostor. He was employed by them, but has been discharged.\"\n\u003cbr\u003e \n\u003cbr\u003e The assignee looked alarmed.\n\u003cbr\u003e \n\u003cbr\u003e \"What do you say to this, Mr. Walton?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Simply that it is false,\" returned Scott. \"If you have any doubts as to my being in the employ of the firm, you can look at this letter received this morning.\"\n\u003cbr\u003e \n\u003cbr\u003e The assignee read the letter given at the commencement of this chapter.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Little, you appear to be mistaken,\" he said, severely. \"What can be your object in [Pg 274]trying to discredit Mr. Walton, I will not inquire, though I can guess at it. If you wish to negotiate for any of the stock I refer you to him. He obtained it on such terms that he can afford to deal with you liberally.\"\n\u003cbr\u003e \n\u003cbr\u003e This was gall and wormwood to Mr. Little, but he wished to make his journey pay, and broached the subject to Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you sell me what I want at the price you paid?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"No, Mr. Little, I cannot do that, but I will sell at five per cent. profit.\"\n\u003cbr\u003e \n\u003cbr\u003e When Mr. Little made an examination of prices, he ascertained that even on these terms he would make a better bargain than he anticipated. The result was that he bought five thousand dollars\u0027 worth of goods from Scott, and felt sure that even then he would clear more than a thousand dollars on his purchases.\n\u003cbr\u003e \n\u003cbr\u003e As he left the office with Scott, Loammi questioned him eagerly.\n\u003cbr\u003e \n\u003cbr\u003e \"Did you buy many goods of the assignee?\" he inquired.\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But I thought you meant to.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I bought of Scott.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 275]\n\u003cbr\u003e \n\u003cbr\u003e \"What has he to do with it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I found that he had bought the entire stock before I got into the office.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What do you mean, pa? You\u0027re joking, ain\u0027t you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course, Mr. Little,\" said Scott, \"the sale must be ratified by my firm. I will, however, make a special request to that effect, and I don\u0027t anticipate that they will interfere with my arrangements.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going back to Niagara on the next train, Scott?\" asked Ezra Little.\n\u003cbr\u003e \n\u003cbr\u003e \"No; I must wire the firm of what I have done. Then I have agreed to meet the earl at the Mansion House, where we shall dine.\"\n\u003cbr\u003e \n\u003cbr\u003e \"When will you return to New York?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Probably I shall take the night train.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall wait a day or two. I have not yet had a chance to see the falls.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then if I don\u0027t see you again, Cousin Ezra, I shall bid you good-by.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good-by, Scott. If you leave your present employer at any time I will give you five dollars a week and your board.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you,\" said Scott, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 276]\n\u003cbr\u003e \n\u003cbr\u003e He was not conceited, but it struck him that one who had been intrusted with such a responsible commission was worth considerably more than this small sum.\n\u003cbr\u003e \n\u003cbr\u003e \"How have you succeeded, Scott?\" asked the earl, when they met at the Mansion House.\n\u003cbr\u003e \n\u003cbr\u003e Scott told him.\n\u003cbr\u003e \n\u003cbr\u003e \"How much will your purchases amount to, Scott?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Probably to eighty thousand dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is wonderful. And you are only seventeen years old!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I believe so,\" said Scott, smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"I am not sure but it would be for my advantage to go into business with you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What shall be the style of the firm? The Earl of Windermere \u0026amp; Co.?\"\n\u003cbr\u003e \n\u003cbr\u003e \"We will consider that. When do you propose to return to New York?\"\n\u003cbr\u003e \n\u003cbr\u003e \"This evening.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry I can\u0027t go with you. I shall start in three days, and when I take up my residence in New York it will be at the Windsor Hotel. Will you call and see me there?\"\n\u003cbr\u003e \n\u003cbr\u003e \"With the greatest pleasure, my lord.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You mean Mr. Grant.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 277]\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Mr. Grant. But when others are present I will use your title.\"\n\u003cbr\u003e \n\u003cbr\u003e Some time during the next day Scott reached New York. He lost no time in calling at the store, and reported his business operations in detail.\n\u003cbr\u003e \n\u003cbr\u003e He was received with great cordiality.\n\u003cbr\u003e \n\u003cbr\u003e \"Scott,\" said Mr. Tower, \"you have quite surpassed my expectations. I own I had some hesitation about intrusting you with the Buffalo business, but you have managed it to my satisfaction.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott told him of his transaction with Mr. Little.\n\u003cbr\u003e \n\u003cbr\u003e \"I told him it would depend on your ratification,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I will ratify it,\" said Mr. Tower, \"and the five per cent. shall be your commission.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Mr. Tower. You are very liberal. Two hundred and fifty dollars will make me feel rich.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We will pay you five hundred dollars besides for your general services during the six weeks you have been absent, and your salary will be raised to forty dollars a week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know how to thank you, Mr. Tower. It is only fair to tell you that I have an offer from another firm.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did they offer you more? What firm is it?\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 278]\n\u003cbr\u003e \n\u003cbr\u003e \"Ezra Little. He offered me five dollars a week and my board, in case I ever leave you.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Tower seemed much amused.\n\u003cbr\u003e \n\u003cbr\u003e \"You can accept the offer if you desire,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I prefer to stay with you, if you are willing,\" said Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"You can stay as long as you like. We should be sorry to lose you.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57994.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
