{"id":42620,"no":37,"title":"CHAPTER XXXVII. CONCLUSION.","content":"Three days later, in the early evening, Loammi Little met Harold in the street.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, you boy!\" he said, with malicious pleasure; \"you lost your place at my father\u0027s store, didn\u0027t you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered Harold, calmly.\n\u003cbr\u003e \n\u003cbr\u003e \"That will teach you to treat me with respect hereafter.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose I am indebted to you for getting me discharged.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered Loammi, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e \"Then I want to thank you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To thank me!\" exclaimed Loammi, in surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, for I have now a better place.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where?\"\n\u003cbr\u003e \n\u003cbr\u003e \"With Tower, Douglas \u0026amp; Co.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did Scott Walton get it for you?\" asked Loammi, quickly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 311]\n\u003cbr\u003e \n\u003cbr\u003e \"Then he had better mind his own business. My father may get him discharged from his place there.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is more than he can do. Mr. Tower puts great confidence in Scott.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know what he pays him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Forty dollars a week.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nonsense!\" said Loammi, angrily.\n\u003cbr\u003e \n\u003cbr\u003e \"It is true.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then Mr. Tower is a fool.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why don\u0027t you call and tell him so?\"\n\u003cbr\u003e \n\u003cbr\u003e A really mean person can receive no heavier blow than to find his malicious attempt to injure another of no avail. This was the case with Loammi.\n\u003cbr\u003e \n\u003cbr\u003e When he was forced to believe that Scott really received the high salary he had contemptuously scoffed at, he became more discontented than ever. He tried to get his father to increase his allowance, but without success. He was mortified to find that even Harold vied with him in dress.\n\u003cbr\u003e \n\u003cbr\u003e \"How these beggarly upstarts are coming up!\" he said to himself, bitterly. \"It makes me sick.\"\n\u003cbr\u003e \n\u003cbr\u003e But a heavier blow was in store for him. Dull times came in business, retail trade fell off, and one[Pg 312] morning it was announced in the papers that the great house of Ezra Little had suspended.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Little made desperate efforts to secure financial assistance, but in vain. No one liked him, and it looked as if he was irretrievably ruined.\n\u003cbr\u003e \n\u003cbr\u003e When things looked darkest, a plain-looking old man entered the store, and asked to see Mr. Little.\n\u003cbr\u003e \n\u003cbr\u003e \"Seth Lawton!\" exclaimed the merchant. \"I can\u0027t see you. I am very busy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hear you are in trouble,\" said Cousin Seth.\n\u003cbr\u003e \n\u003cbr\u003e \"And I suppose you are glad of it,\" replied Ezra, bitterly.\n\u003cbr\u003e \n\u003cbr\u003e \"No, I have come to help you,\" responded Mr. Lawton.\n\u003cbr\u003e \n\u003cbr\u003e \"You help me!\" repeated Ezra, scornfully. \"What good will a few hundred dollars do?\"\n\u003cbr\u003e \n\u003cbr\u003e \"How much help do you need?\"\n\u003cbr\u003e \n\u003cbr\u003e \"With forty thousand dollars I could weather the storm handsomely,\" replied Mr. Little.\n\u003cbr\u003e \n\u003cbr\u003e \"You shall have it, if you will secure me well.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you got forty thousand dollars? I thought you a poor man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It isn\u0027t the only mistake you have made, Cousin Ezra. At the time you looked down upon me I was richer than yourself. But I will only help you on conditions.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 313]\n\u003cbr\u003e \n\u003cbr\u003e \"I will agree to any conditions,\" said Ezra, his pride humbled. \"Only help me out of my present trouble.\"\n\u003cbr\u003e \n\u003cbr\u003e So the house of Ezra Little was saved, and its head received a lesson. His pride had had a fall. Those whom he looked down upon proved to surpass him in the only thing on which he prided himself—the possession of money.\n\u003cbr\u003e \n\u003cbr\u003e One of Cousin Seth\u0027s conditions was that Loammi should go into his father\u0027s store, and exchange his elegant leisure for honest work. He complained a good deal, but Seth Lawton and his father insisted. He may in time become a useful, hard-working man of business, but he has a good deal to learn first.\n\u003cbr\u003e \n\u003cbr\u003e Scott continues to prosper, and next year will become a partner in the firm of Tower, Douglas \u0026amp; Co. Harold is earning a good salary now, and his father\u0027s troubles are over. He gets more remunerative work at his profession, and, with his family, occupies a pleasant home in Bayonne.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Lawton has leased a handsome house uptown, and Scott lives with him. He is rich—how rich no one knows—and Scott is generally supposed to be his heir.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eTHE END\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57999.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
