{"id":42588,"no":5,"title":"CHAPTER V. AN UNPLEASANT SURPRISE.","content":"Crawford Lane was considerably disconcerted.\n\u003cbr\u003e \n\u003cbr\u003e \"I will call later and buy the ticket,\" he said to the broker. \"At present I have some business with this young rascal, who robbed me this morning of a considerable sum of money. Now he has the assurance to make a charge against me.\"\n\u003cbr\u003e \n\u003cbr\u003e The broker looked from one to the other. He was bewildered, and could not decide which to believe.\n\u003cbr\u003e \n\u003cbr\u003e Crawford Lane and the two boys went out into the street.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, Mr. Lane,\" said Scott, in a resolute tone, \"please hand over that money.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So you are acting the part of a highway robber, are you? If you know what is best for yourself you will get away from here as soon as possible.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 37]\n\u003cbr\u003e \n\u003cbr\u003e \"I am ready to go as soon as you give me my money. If not——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, if not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will summon a policeman.\"\n\u003cbr\u003e \n\u003cbr\u003e It chanced that a member of the Broadway squad was within hearing.\n\u003cbr\u003e \n\u003cbr\u003e He stopped and said: \"Am I wanted here?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" replied Lane, quickly; \"I want you to arrest that boy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"On what charge?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Robbery. I took pity on him, and though I knew scarcely anything of him, I let him occupy the same room with myself at a hotel on the Bowery last night. He stole some Bank of England notes from my pocket while I was sleeping, and I want him arrested.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott\u0027s breath was quite taken away by the audacious misrepresentation of his treacherous acquaintance.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, what have you to say?\" asked the policeman.\n\u003cbr\u003e \n\u003cbr\u003e \"Only that this man was himself the thief, and stole the notes from me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You young rascal!\" exclaimed Lane, in assumed indignation. \"That is a likely story. I leave it to the officer which was more likely to[Pg 38] have money to be taken—a gentleman like myself, or a boy like you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think you will have to come with me,\" said the officer to Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"But,\" put in John Schickling, \"that man has told you a lie. He owes my mother nine dollars for room rent.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I never saw the boy before in the whole course of my life,\" said Lane, boldly. \"He seems to be a confederate of the boy who robbed me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can tell your story at the police station,\" said the policeman to Scott. \"You, sir, can go with me and prefer a charge.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am in a great hurry,\" replied Lane, taking out his watch. \"I will call at the police station in an hour. Now I have an important engagement.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You will have to come now,\" said the officer, beginning to be suspicious.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, well, if it is necessary,\" said Lane, determined to brazen it out.\n\u003cbr\u003e \n\u003cbr\u003e Scott was considerably taken aback at the unexpected turn which matters had taken, and felt some anxiety.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you come with me?\" he said, addressing John Schickling.\n\u003cbr\u003e \n\u003cbr\u003e \"You bet I will,\" responded John, briskly. \"I[Pg 39] ain\u0027t goin\u0027 back on a friend. I\u0027ll tell you what I know about this man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027d better clear out,\" said Lane, \"if you know what is best for you, or you\u0027ll find yourself in hot water, too.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll take the risk,\" rejoined John, not at all alarmed.\n\u003cbr\u003e \n\u003cbr\u003e So they started for the station house in the City Hall, when something unexpected happened.\n\u003cbr\u003e \n\u003cbr\u003e A young man, handsomely dressed, met the procession, as he was himself walking up Broadway. His eyes lighted up when they rested on Crawford Lane.\n\u003cbr\u003e \n\u003cbr\u003e He darted forward, and grasped him by the arm.\n\u003cbr\u003e \n\u003cbr\u003e \"At last I have found you!\" he exclaimed. \"Officer, I call upon you to arrest this man.\"\n\u003cbr\u003e \n\u003cbr\u003e The officer stared, surprised as he might well be.\n\u003cbr\u003e \n\u003cbr\u003e Crawford Lane tried to release himself from the grasp of the speaker, and had he succeeded would have fled unceremoniously.\n\u003cbr\u003e \n\u003cbr\u003e \"What does this mean?\" asked the policeman. \"He is going with me to the station house to prefer a charge against this boy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s a good joke! He prefer a charge!\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 40]\n\u003cbr\u003e \n\u003cbr\u003e \"He says the boy has robbed him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you may conclude that he has robbed the boy. He robbed me in London some weeks since, and I have just caught him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This is all a mistake,\" said Lane, hurriedly. \"Officer, you may let the boy go.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you withdraw the charge?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I prefer to go to the station house,\" said Scott, quietly. \"I wish to tell my story there. This man stole ten pounds from me in English money.\"\n\u003cbr\u003e \n\u003cbr\u003e At this moment there was a sudden excitement in the street. A man had been knocked over by a passing truck, and all eyes were turned toward the scene of the accident.\n\u003cbr\u003e \n\u003cbr\u003e Justin Wood removed his hand from the arm of Crawford Lane, and the latter lost no time in taking advantage of his freedom. He darted down a side street, and when his companions turned to look for him he had disappeared.\n\u003cbr\u003e \n\u003cbr\u003e Justin Wood looked annoyed.\n\u003cbr\u003e \n\u003cbr\u003e \"He has escaped this time,\" he exclaimed, \"but I will have him yet.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then I shall not be needed,\" said the officer, as he resumed his beat.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 41]\n\u003cbr\u003e \n\u003cbr\u003e \"How did this man get a chance to rob you?\" asked Justin Wood, turning to Scott.\n\u003cbr\u003e \n\u003cbr\u003e Scott briefly explained.\n\u003cbr\u003e \n\u003cbr\u003e \"Did he take all your money?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir. I have ten pounds left.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Pardon me, but is this all you have?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you have a home?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Only such a home as I may be able to make for myself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you no relatives in this city?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir, I have one. I am going to see him if I can, this afternoon.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Wood took a card from his pocket.\n\u003cbr\u003e \n\u003cbr\u003e \"I am staying at the Gilsey House,\" he said. \"If you need help or advice, call there and send up your name. By the way, what is your name, my boy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Scott Walton.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall remember it. Now I must leave you as, like your late friend, I have an important engagement.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose I must be getting back,\" said John, \"as my brother will need me. I am sorry I didn\u0027t collect the nine dollars from that jay.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He has got the best of all of us,\" returned[Pg 42] Scott. \"Where do you live? I may want to look you up some day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"In West Thirty-sixth Street,\" said John. \"I haven\u0027t got any card with me, but I can give you the number.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I won\u0027t forget it. You have been my first friend in New York, and I don\u0027t want to lose you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I never thought I would like an English boy before,\" said John, \"but I like you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you. I hope we shall remain friends.\"\n\u003cbr\u003e \n\u003cbr\u003e When Scott was left alone it occurred to him that he had not yet exchanged his English money, and he returned to the broker\u0027s office, where he made the exchange, receiving about fifty dollars in greenbacks.\n\u003cbr\u003e \n\u003cbr\u003e \"This is all I have to depend upon,\" reflected Scott. \"It won\u0027t do for me to remain at the hotel much longer. My money would soon be gone.\"\n\u003cbr\u003e \n\u003cbr\u003e He had ascertained that the rates at the hotel were two dollars a day, including board.\n\u003cbr\u003e \n\u003cbr\u003e This was not a large price, but Scott felt that it was more than he could afford to pay. It was absolutely necessary that he should begin to earn something as soon as possible.\n\u003cbr\u003e \n\u003cbr\u003e He could decide upon nothing till he had seen[Pg 43] his mother\u0027s cousin, Ezra Little. If that gentleman should agree to take him into his store in any capacity, he felt that his anxieties would be at an end. Hence, it was desirable that he should see Mr. Little as soon as possible. He had already ascertained that his relative was in the dry-goods business on Eighth Avenue, but he felt that it would be better to call upon him at his residence on West Forty-seventh Street. Probably Mr. Little would have more leisure to talk with him there.\n\u003cbr\u003e \n\u003cbr\u003e It was with a fast-beating heart that Scott, standing on the steps of a three-story brick house on West Forty-seventh Street, rang the bell.\n\u003cbr\u003e \n\u003cbr\u003e The door was opened by a servant girl.\n\u003cbr\u003e \n\u003cbr\u003e Just behind her was a boy who looked to be about Scott\u0027s age, and who listened inquisitively to what Scott had to say.\n\u003cbr\u003e \n\u003cbr\u003e \"Is Mr. Little at home?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He will be in in a few minutes. You can come in and wait for him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I should like to do so.\"\n\u003cbr\u003e \n\u003cbr\u003e The servant opened the door leading into a small reception room to the left of the front hall, and Scott, entering, seated himself.\n\u003cbr\u003e \n\u003cbr\u003e The boy already referred to entered also. He[Pg 44] was a very plain-looking youth with light red hair.\n\u003cbr\u003e \n\u003cbr\u003e \"Did you have business with Mr. Little?\" he asked, curiously. \"I am his son.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you come from the store?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps you are meaning to apply for a place there?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I should be glad if your father would give me a place. I have just come from England. My mother was a cousin of Mr. Little.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57967.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
