{"id":42589,"no":6,"title":"CHAPTER VI. SCOTT FINDS A RELATIVE AND A PLACE.","content":"Loammi Little, for this was the name of the red-haired boy, regarded Scott with curiosity mingled with surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"What is your name?\" he asked, abruptly.\n\u003cbr\u003e \n\u003cbr\u003e \"Scott Walton.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I never heard of you, though I have heard pa say that a cousin of his married a man named Walton. Where is your father?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is dead,\" answered Scott, sadly. \"He died on the voyage over.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Humph!\" said Loammi, in a tone far from sympathetic. \"I suppose you are poor.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am not rich,\" replied Scott, coldly.\n\u003cbr\u003e \n\u003cbr\u003e He began to resent the unfeeling questions with which his cousin was plying him.\n\u003cbr\u003e \n\u003cbr\u003e \"If you have come over here to live on pa, I don\u0027t think he will like it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t want to live on anyone,\" said Scott, his[Pg 46] cheek flushing with anger. \"I am ready to earn my own living.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s the way pa did. He came over here a poor boy, or rather a poor young man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I respect him the more for it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"All the same I would rather begin life with a little money,\" said Loammi.\n\u003cbr\u003e \n\u003cbr\u003e \"I have a little money,\" rejoined Scott, with a half smile.\n\u003cbr\u003e \n\u003cbr\u003e \"How much?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would rather wait and tell your father my circumstances.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, well, if you don\u0027t like to tell. Pa\u0027ll tell me all about it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is as he chooses—but I would rather tell him first.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How old are you?\" asked Loammi, after a pause.\n\u003cbr\u003e \n\u003cbr\u003e \"Sixteen.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So am I.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Your father has a store on Eighth Avenue?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; have you been in it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not yet. I only arrived in New York yesterday.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where are you living?\"\n\u003cbr\u003e \n\u003cbr\u003e \"In a hotel on the Bowery.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 47]\n\u003cbr\u003e \n\u003cbr\u003e \"That isn\u0027t a fashionable street.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So I judge; but I can\u0027t afford to board on a fashionable street.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I suppose not. You are pretty well dressed, though.\"\n\u003cbr\u003e \n\u003cbr\u003e \"My father bought me this suit in London before we started for America. Are you working in your father\u0027s store?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I am attending school. I am not a poor boy, and don\u0027t have to work. Did you work any before you left the old country?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I was at school.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you a good scholar?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That isn\u0027t for me to say. I stood very well in school.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am studying Latin and Greek,\" observed Loammi, proudly.\n\u003cbr\u003e \n\u003cbr\u003e \"I have studied them both,\" said Scott, quietly.\n\u003cbr\u003e \n\u003cbr\u003e \"How far were you in Latin?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I was reading Cicero\u0027s orations when I left school.\"\n\u003cbr\u003e \n\u003cbr\u003e As this was considerably beyond the point to which Loammi had attained, he made no comment. He was considering what question to ask next, when his father entered the room.\n\u003cbr\u003e \n\u003cbr\u003e There was a strong resemblance between father[Pg 48] and son. Ezra Little was a slender man, about five feet ten inches in height, with hair of a yellowish-red, inclined to be thin toward the top of the head.\n\u003cbr\u003e \n\u003cbr\u003e There was a feeble growth of side whiskers extending halfway down each cheek. His eyes were of a pale blue, and his look was shrewd and cold.\n\u003cbr\u003e \n\u003cbr\u003e He gazed inquiringly at Scott.\n\u003cbr\u003e \n\u003cbr\u003e \"This boy says his mother was your cousin, pa,\" exclaimed Loammi.\n\u003cbr\u003e \n\u003cbr\u003e \"What name?\" asked Ezra.\n\u003cbr\u003e \n\u003cbr\u003e \"Scott Walton.\"\n\u003cbr\u003e \n\u003cbr\u003e Ezra Little nodded.\n\u003cbr\u003e \n\u003cbr\u003e \"I see. Your father was an artist?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where is he?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He died on the voyage over.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Leaving you alone in the world?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered Scott, sadly.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, what are your plans?\"\n\u003cbr\u003e \n\u003cbr\u003e This question was asked coldly.\n\u003cbr\u003e \n\u003cbr\u003e \"My father died so lately that I haven\u0027t had time to form any plans. I thought I would like to consult you about them.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose you haven\u0027t much money?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 49]\n\u003cbr\u003e \n\u003cbr\u003e \"You have some?\"\n\u003cbr\u003e \n\u003cbr\u003e \"About ten pounds.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Fifty dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And that is all?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That won\u0027t keep you long,\" said Loammi, disdainfully. \"I s\u0027pose you\u0027ll expect pa to take care of you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have I hinted anything of the kind?\" demanded Scott, indignantly. \"I am young and strong, and I am quite ready to earn my own living. I don\u0027t want anybody to support me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well spoken, lad!\" said Ezra, in a tone of approval. \"I\u0027ll think over your case. Loammi, tell your mother that Scott will stay to supper.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Little was as plain in appearance as her husband and son, but Scott liked her better. She appeared to have a kindly disposition, and expressed sympathy for him when she heard of his father\u0027s death.\n\u003cbr\u003e \n\u003cbr\u003e This was in contrast to Mr. Little and Loammi, upon whom it seemed to make no impression.\n\u003cbr\u003e \n\u003cbr\u003e \"And where are you staying, Scott?\" she asked, in a tone of friendly interest.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 50]\n\u003cbr\u003e \n\u003cbr\u003e \"At a hotel on the Bowery.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How much do they charge you?\" inquired Ezra Little.\n\u003cbr\u003e \n\u003cbr\u003e \"Two dollars a day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is very extravagant for a boy with your small stock of money to pay such a price.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know it, sir, but I only went there yesterday, I shall not think of staying.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott had decided not to mention his loss to Mr. Little, as he felt sure that it would bring upon him a reproof for his credulity in trusting a man of whom he knew so little as Crawford Lane.\n\u003cbr\u003e \n\u003cbr\u003e \"Why couldn\u0027t he come here, Ezra?\" suggested Mrs. Little, turning to her husband.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Little coughed.\n\u003cbr\u003e \n\u003cbr\u003e \"After supper I shall speak to Scott about business,\" he said, \"and that point will be discussed.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott looked forward to the interview with interest and anxiety. For him a great deal depended on it.\n\u003cbr\u003e \n\u003cbr\u003e He hoped that Mr. Little would give him a place in the store where he would be in the line of promotion, and be able to earn his living.\n\u003cbr\u003e \n\u003cbr\u003e He followed Mr. Little from the dining room into what might be called a library, though there[Pg 51] were only about fifty books in a small bookcase. There was a desk, however, used by Mr. Little for letter writing, and for the keeping of his accounts. Here, too, he received business visitors.\n\u003cbr\u003e \n\u003cbr\u003e \"Well,\" he said, pointing Scott to a chair, \"now we will discuss your plans. You want a chance to work?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I may find a place for you in my store, but I warn you that you can\u0027t expect much pay to begin with.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t expect much pay, sir. If I can earn enough to support myself it will satisfy me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Eh, but that would require high pay. It costs a good deal to support a boy in New York.\"\n\u003cbr\u003e \n\u003cbr\u003e This rather alarmed Scott, for he felt that he must manage somehow to support himself on what he earned.\n\u003cbr\u003e \n\u003cbr\u003e \"We generally pay a beginner only three dollars a week,\" proceeded Mr. Little.\n\u003cbr\u003e \n\u003cbr\u003e \"Three dollars a week!\"\n\u003cbr\u003e \n\u003cbr\u003e Why, Scott was paying two dollars a day for board and lodging at the hotel.\n\u003cbr\u003e \n\u003cbr\u003e He looked at Mr. Little in dismay.\n\u003cbr\u003e \n\u003cbr\u003e \"I shouldn\u0027t think I could support myself on three dollars a week,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 52]\n\u003cbr\u003e \n\u003cbr\u003e \"We might strain a point and pay you three dollars and a half.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is there any boarding house where I could live on three dollars and a half?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, no; perhaps not; but you have some money, you tell me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir, I have fifty dollars.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Just at first you can use a part of that to supply deficiencies.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I thought I might need that for clothes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ahem!\" said Mr. Little. \"I have thought a way out of the difficulty.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott looked at him hopefully.\n\u003cbr\u003e \n\u003cbr\u003e \"I think Mrs. Little can find a small room for you upstairs, and you can live here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course what you earn in the store won\u0027t pay for your keep, so I suggest that you hand me the fifty dollars to make up.\"\n\u003cbr\u003e \n\u003cbr\u003e Scott did not like that suggestion. He did not feel like giving up the money bequeathed him by his father. It would make him feel helpless and dependent.\n\u003cbr\u003e \n\u003cbr\u003e Besides, when he wanted clothing, where should he find money to pay for it? Yet, if he declined Mr. Little\u0027s offer, he knew that the fifty dollars[Pg 53] would soon be exhausted, and he might have no other place offered him.\n\u003cbr\u003e \n\u003cbr\u003e \"When could I move here?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"To-morrow, and on Monday morning, you can begin work at the store.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can give me the money now.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will give you forty dollars, but I shall have to pay my hotel bill.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can keep five dollars for that. It will be sufficient.\"\n\u003cbr\u003e \n\u003cbr\u003e So Scott handed over forty-five dollars to Mr. Little, who counted it over with evident satisfaction. Then the English boy started for the hotel.\n\u003cbr\u003e \n\u003cbr\u003e He had secured a place, but somehow he felt depressed. His prospects did not seem very bright, after all.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2037/57968.html","bookId":614,"creation":"Aug 11, 2019 6:07:53 AM","modification":"Aug 11, 2019 6:07:53 AM"}
