{"id":84827,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhen the dizziness is finished with me, the memories take over.\u003c/p\u003e\n\u003cp\u003eIn the blinding light from the sun, I could barely make her out. The light hit the small crack I stared out of with white heat. The hole was hot, too hot but I could see the girl and Em. The lady had made them play together, forcing Em. Em had cried and not wanted to play with the dolls, not like the dead-eyed girl who danced them along. I think she only saw what she wanted to. She didn’t see me, not right away.\u003c/p\u003e\n\u003cp\u003eThe dirt stains on Em\u0027s legs were something I’d never seen before. If Emalyn hated anything, it was being dirty. She hated everything that wasn’t shopping or playing dolls. She was a little princess. I had hated that about her. Then, sweating and exhausted, I didn’t hate her anymore. I kept making myself take mental images of her doing everything, so it would be the last thing I saw when I died. I could replay it as the man strangled me or beat me again.\u003c/p\u003e\n\u003cp\u003eI looked down at the drawings on the wall of the concrete hole. Triangles, trees, and people were drawn like murals on the circular walls. Triangles seemed to be the constant. The drawings got better as they got higher up the walls but the triangles were still there.\u003c/p\u003e\n\u003cp\u003eA scream brought my attention back out of the hole. I scrambled in the dirt to the edge of the hole and peeked through the tiny crack, where the hot air came in.\u003c/p\u003e\n\u003cp\u003eI panicked when I saw her tiny knees buckle under the swinging hand.\u003c/p\u003e\n\u003cp\u003eFury built inside of me as I watched though the slit of light as her small body vibrated from each strike.\u003c/p\u003e\n\u003cp\u003eThe foot of the angry, shouting woman swung back but a shout stopped it…froze it mid-air, hovering over my sister, Emalyn\u0027s crouched body.\u003c/p\u003e\n\u003cp\u003e“NO!” the man shouted and walked toward Em. He reached his hands down, lifting her sobbing face to his. He kissed her cheek and took her hand in his, pulling her to her filth-stained feet. She struggled against the kiss and the hands. Her face was still so alive and scared, compared to the other girl who sat in the corner. It made me sick and panicked and weak. I pushed on the lid but it didn’t budge.\u003c/p\u003e\n\u003cp\u003eThe knees of the girl in the corner pulled in as Em screamed. I could see the feet of her Barbies touching down on the dirty ground.\u003c/p\u003e\n\u003cp\u003eWhen the screaming got worse the Barbies dropped.\u003c/p\u003e\n\u003cp\u003eMy fury returned with the screams of my sister. I clawed at the hole as the hands of the other girl covered her ears. The girl screaming was my sister, but I couldn’t see her anymore. She was fighting something I could imagine, but I slapped my head and forced the thoughts away.\u003c/p\u003e\n\u003cp\u003eI reached my hand through the slit, \"Help me!\" I cried to the girl, but she held her hands over her ears and rocked back and forth.\u003c/p\u003e\n\u003cp\u003eSomething inside of me snapped. I pushed at the concrete and metal surrounding me. Blood dripped down my fingers as I pushed and clawed in a frenzy. I screamed for the girl to help me but I could see she had shut down. She started to rock harder, removing her hands only to touch the walls of the corner, as if checking to see if they were still there. She sat in the triangle, safe from everything else.\u003c/p\u003e\n\u003cp\u003eI screamed and clawed until the girl stood. I hoped she was coming to help me, but she went in the door of the dirty house, leaving the Barbies in the dirt. The dead look in her eyes made contact with mine as she rounded the corner. Suddenly there was something in her eyes, something that didn’t match the dead look that had been there all along. She looked scared.\u003c/p\u003e\n\u003cp\u003eI swallowed and waited but she never came back, so I clawed until my fingers ripped and tore, and managed to move the metal lid enough.\u003c/p\u003e\n\u003cp\u003eFrantic sobs left my lips and I gasped, dragging my body from the bleak hole.\u003c/p\u003e\n\u003cp\u003eI kicked and squirmed until I was free, moving so fast I tripped trying to get to the house quick enough, but the gunshot stopped me. My feet skidded across the filthy floor. I paused, holding everything…waiting. I knew I was waiting for the sound of my sister. The unknown and the fear overwhelmed me. I ran for the screaming I knew didn’t belong to Em.\u003c/p\u003e\n\u003cp\u003eThe narrow walls and rubbish everywhere made it hard for me to see them. My eyes wouldn’t adjust from the blinding light of the hole. Finally reaching the room and the disaster that lie before me, I shook my head. It was involuntary. I shook, as if it would change the outcome. Her dirty legs lay on the bed behind his shaking, angry body. The angry man’s fists came down on the other girl. Her dead eyes were back.\u003c/p\u003e\n\u003cp\u003eSomething caught my eyes. I turned, seeing the gun on the floor.\u003c/p\u003e\n\u003cp\u003eI needed to save us. That was what a man did and I needed to be a man. I wavered for a second, not sure if I could, but the fists landing on the girl and the lifeless legs of my sister filled me with rage. It was hot like the white heat of the hole. It blinded me and made a sound inside of me like white noise on the radio.\u003c/p\u003e\n\u003cp\u003eI picked up the gun; it was heavy and hard. I lifted it and pulled the trigger. I fired the shots and soon the only people standing were the girl and me. I didn’t even see the woman come back into the room. She was just there and I shot her.\u003c/p\u003e\n\u003cp\u003eThe girl\u0027s eyes were black and filled with fear.\u003c/p\u003e\n\u003cp\u003eThe resonating sound of the gun dropping echoed around us.\u003c/p\u003e\n\u003cp\u003eMy feet couldn’t move fast enough. They took the steps my brain refused and my heart feared.\u003c/p\u003e\n\u003cp\u003eI walked past the girl, touching the still-warm arm of my sister. My fingers bit into her skin but she didn’t wake.\u003c/p\u003e\n\u003cp\u003eI shook her and yet she slept. The crimson stain upon her chest was becoming larger with the movements I forced upon her. It seeped. That was the only word for it. It seeped.\u003c/p\u003e\n\u003cp\u003eI shook her again, my eyes searched her tiny body for a breath. I pushed on her chest but the seeping got worse. I started shaking her, but there was nothing. She had left me, left to sleep with the angels and ride on a cloud. Free from the things that surrounded me. I couldn’t forgive her for that.\u003c/p\u003e\n\u003cp\u003eI screamed into the ceiling. The sound of it made the girl drop to the floor and curl into a ball after she crawled backwards for the corner, touching either side of it as I screamed and shouted at Em. There was nothing left of my sister. I didn’t have a reaction for it. The pain was stuck in my seized-up heart. Everything was too big and too scary, and I had to be a man. A man that saved his little sister. A man that saved the day. A hero.\u003c/p\u003e\n\u003cp\u003eInstead, I was a lost boy. I cried out for help like a child.\u003c/p\u003e\n\u003cp\u003eI wanted to cry. The tears were there, but the girl with the dead eyes and the twitching head needed me. I could save her. I lifted my sister from the bed and slung her limp body over my shoulder. The weight of her was more than I expected. I looked at the sobbing girl and put my hand out for her to take.\u003c/p\u003e\n\u003cp\u003eWhen her hand lifted into mine, I noticed the difference between us. The level of filth in her pores and nails was disturbing. Her hand shook with uncertainty and fear.\u003c/p\u003e\n\u003cp\u003eI reached the extra inch she couldn’t go and pulled her up and dragged her from the house. Emalyn got heavy on my shoulder, like she was trying to push me to the ground. I gripped her tightly, trying to get one foot in front of the other. Dragging the girl and carrying Em was too much. One of them had to go. I let go of the girl\u0027s hand, taking one step in the dusty driveway before I realized I had chosen the wrong girl. My shoulders cried for release. I slumped to the ground, laying Em down on the dirt. I brushed her hair from her face, \"I\u0027ll be back, Em. I\u0027m not leaving you. I\u0027m getting help. I swear, I won\u0027t leave you here.\"\u003c/p\u003e\n\u003cp\u003eI let myself take in the seconds of her and me and everything that had gone wrong. I had done it all wrong. I almost couldn’t turn back to the girl and look in her eyes, her swollen eyes.\u003c/p\u003e\n\u003cp\u003eI ran a hand along Em\u0027s peaceful face, \"I’ve gotta go, Em.\"\u003c/p\u003e\n\u003cp\u003eI needed to save at least one of them. I left her there, in the dirt, swearing to myself I would be back for her. I put my hand out for the mess of the girl standing behind me, lost and dead inside. She took my hand again. I pulled her across the dusty ground for a long time. I didn’t know where we were going, but I knew we needed people. There were no power lines and the driveway seemed like it went on forever.\u003c/p\u003e\n\u003cp\u003eI turned into the field, hoping to arrive at a town. The girl\u0027s legs gave out across the field; I turned and lifted her into my boyish arms. I carried her the rest of the way to the barn we found. My back was aching and my heart was hollow. I was gasping for air when I placed her down, stroking her hair as she lost control of the tiny hold she had. She stopped shaking and started bawling.\u003c/p\u003e\n\u003cp\u003e“I shot her,” she whispered.\u003c/p\u003e\n\u003cp\u003eI didn’t understand.\u003c/p\u003e\n\u003cp\u003eShe cried again, \"I meant to shoot him but it hit her. I wanted her to stop screaming. I wanted him to stop hurting her.\"\u003c/p\u003e\n\u003cp\u003eThe girl had shot Em. I closed my eyes, containing the devil inside of me. I shook my head, “It wasn’t your fault.” It was though. I wanted to shake her and tell her Em was dead because of her. I wished that it had been her and Emalyn were the one alive. The wish made me sick but my mind couldn’t stop it. Her delicate, malnourished, heaving body told me that the wish was a bad one. But I couldn’t stop my brain from thinking it.\u003c/p\u003e\n\u003cp\u003eInstead, I did what I thought I should, I hugged her. I wrapped myself around her.\u003c/p\u003e\n\u003cp\u003e“I sh-sh-shot h-h-h-her,” she sobbed.\u003c/p\u003e\n\u003cp\u003eI would take the blame. I would take the darkness from her. “I should have saved you both. It was my fault.”\u003c/p\u003e\n\u003cp\u003eHer tiny, messy head twitched a no, “My fault. I wanted him to stop. M-m-my fault.”\u003c/p\u003e\n\u003cp\u003eI held her tightly, “We need to go for help. Where are we?”\u003c/p\u003e\n\u003cp\u003eShe shook her head, refusing to open her eyes. I tried to stand but a scream came from her lips, like a natural-defense mechanism she had no control of.\u003c/p\u003e\n\u003cp\u003eWe stayed there for days, eating the fruit that had been left to go bad and drinking from the stream nearby. I held her and waited for her to fall asleep so I could go for help, but she was traumatized and every time I moved, she freaked out.\u003c/p\u003e\n\u003cp\u003eI needed to find help but she was too scared to tell them what she had done. I would go first and explain. It wasn’t her fault, it was mine. I failed them both.\u003c/p\u003e\n\u003cp\u003eI closed my eyes, not meaning to, but I was exhausted. The throbbing in my fingers was the last thing I felt before I drifted off with her.\u003c/p\u003e\n\u003cp\u003eI woke to darkness, panicking momentarily until I realized the small child next to me was still breathing. She whimpered in her sleep and curled away from me.\u003c/p\u003e\n\u003cp\u003eI pulled myself away from her farther, sliding off of the hay and tiptoed out of the barn. \u003c/p\u003e","sourceLink":"https://allnovel.net/lost-boy-the-lonely-2/page-2.html","bookId":1889,"creation":"Oct 5, 2019 5:02:31 PM","modification":"Oct 5, 2019 5:02:31 PM"}
