{"id":96256,"no":7,"title":"Page 7","content":"\u003cp\u003eThe following night, Alexander had planned to take Stormy and me to the movies. Night of the Living Dead was showing at the downtown art theater, and it was one of my favorite movies. There wasn\u0027t much to do in Dullsville, and going to see a movie was a big deal for me. I\u0027d get to sit next to Alexander and hold his hand in the darkness and pig out on popcorn while watching a scary movie. What more could a girl want?\u003c/p\u003e\n\u003cp\u003eI wandered around the upstairs hallway, waiting for Alexander to come down from the attic. I found Stormy waiting in her room, dressed in black jeans and a studded belt, with a ripped, dark blue shirt that had the word TRAGIC spelled out in red letters. She stood at the dresser and applied the final touches of stormy blue makeup to her eyes.\u003c/p\u003e\n\u003cp\u003eI watched in awe. What took most girls hours in front of the mirror took only a few minutes for Stormy to do without a reflection to look at. She even applied burgundy lip liner and eggplant-colored mascara without so much as a smudge or mistake. She got ready and adjusted her outfit with such ease, I was greatly impressed. I wondered if I were a vampire how I\u0027d ever manage to do such simple tasks without a mirror. I was sure that to have makeup smeared around my face like a clown.\u003c/p\u003e\n\u003cp\u003eHowever, I did feel a tinge of pain in my stomach thinking that even though I, too, wanted to be a vampire, Stormy couldn\u0027t see how cute she was. She\u0027d always been different in that way from every mortal girl, and I felt lonely for her.\u003c/p\u003e\n\u003cp\u003eShe began brushing her jet-black hair when she spotted me standing by her doorway.\u003c/p\u003e\n\u003cp\u003e\"Did you have a good time on your overnight - or over-day?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I had a blast!\" Her eyes lit up as if she were Cinderella back from the prince\u0027s ball.\u003c/p\u003e\n\u003cp\u003e\"You must still be exhausted from traveling and now dancing and hanging out with friends,\" I said. Phantom raced over to me and rubbed her head against my boot.\"I feel great,\" she responded enthusiastically.\u003c/p\u003e\n\u003cp\u003e\"Where did you sleep?\" I asked. I picked Phantom up and petted her.\u003c/p\u003e\n\u003cp\u003e\"I shared a coffin with Luna. We talked most of the day.\"\u003c/p\u003e\n\u003cp\u003eI imagined the two girls as being inseparable. I bet they talked about Alexander, Romania, boys, and being vampires. I wish it could have been me.\u003c/p\u003e\n\u003cp\u003e\"I bet that was fun,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I had the best time ever.\"\u003c/p\u003e\n\u003cp\u003eI guess \"ever\" included our dinner last night. Or was I being paranoid? I had to give it more time for us to really connect. And to not be so competitive.\u003c/p\u003e\n\u003cp\u003e\"It must be nice for the two of you to catch up,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I haven\u0027t seen her in a while. Especially since she was...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Uh ... turned.\"\u003c/p\u003e\n\u003cp\u003e\"Is she much different?\" I asked. I really wanted to know. It might be an indication of what I might go through someday.\u003c/p\u003e\n\u003cp\u003e\"Oh yes.\"\u003c/p\u003e\n\u003cp\u003eI was hoping for that. In Luna\u0027s case maybe she wasn\u0027t as good a friend to her or she\u0027d become more sinister.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s even more fun!\" she exclaimed. \"If you can imagine.\"\u003c/p\u003e\n\u003cp\u003eI mumbled quietly to myself.\u003c/p\u003e\n\u003cp\u003e\"Well, I am glad you are here,\" I said. \"Once I found out about you, I was dying to meet you.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean once you found out?\" she asked quizzically.\u003c/p\u003e\n\u003cp\u003eI\u0027d just stuck my combat-shoed foot in my mouth. \"I mean because Alexander is so cryptic. He didn\u0027t talk much about your family at first. I realized it was because he missed you all so much.\"\u003c/p\u003e\n\u003cp\u003eStormy smiled, her purple and black bands glowing on her teeth. She seemed pleased with my answer and to find out that Alexander was pained, too, by his leaving home. \"Yes, it is very hard to get information from my brother. It\u0027s like pulling fangs.\"\u003c/p\u003e\n\u003cp\u003e\"Well, let\u0027s go,\" Alexander said, coming down from his attic room and reaching me in the hallway.\u003c/p\u003e\n\u003cp\u003eDullsville\u0027s artsy movie theater was really different from the suburban megaplexes. The theater and screen were dinky in comparison, and there was only one concession stand. However, it made the movie-viewing experience cozy and intimate. The seats were practically centuries old, red upholstered, and the floor was always still sticky from the popcorn and spilled drinks from the movie before.\u003c/p\u003e\n\u003cp\u003eAlexander bought his sister all the items she wanted - which was quite a lot. She tried to hold the supersized drink and popcorn, and it was almost impossible to see her behind them.\u003c/p\u003e\n\u003cp\u003eWe walked into the empty theater. I was excited to sit in between them, or at least have Alexander in the middle, but Stormy squeezed between us both as we headed into the aisle. I wasn\u0027t sure if she was trying to separate us or hoped to be the one in the middle for the attention. I was actually flattered that she wanted to sit next to me. Either way, as the lights dimmed and the macabre music played, she and I stuffed our faces with popcorn, gummy bears, and submarine-sized colas.\u003c/p\u003e\n\u003cp\u003eShe even grabbed my arm a few times during the movie when the zombies marched after the mortals for their own feeding frenzy.\u003c/p\u003e\n\u003cp\u003eWhen the movie was over, she jumped up and asked to see it again.\u003c/p\u003e\n\u003cp\u003e\"Another time and another day,\" Alexander said. \"But we can see another zombie movie. They are killer.\" We all headed to the car with smiles on our faces. When Alexander dropped me off, he finally gave me the kiss I\u0027d been waiting for the whole night.\u003c/p\u003e\n\u003cp\u003eInstead of watching us or honking the horn, Stormy just sat in the front seat.\u003c/p\u003e\n\u003cp\u003e\"Tomorrow she\u0027s all yours,\" Alexander said as he walked down the drive and blew me a last-minute kiss.\u003c/p\u003e\n\u003cp\u003eThe following evening, I anxiously waited for Alexander to drop Stormy off at my house. She and I were going to have our own girls\u0027 night. Forget Luna Maxwell. Forget the Crypt. I was going to be hang out with my boyfriend\u0027s sister. I wasn\u0027t sure how our evening was going to go - it could swing either way. Stormy and I could get along perfectly or she could find me a rival for the attention of her big brother. I\u0027d never tried to impress anyone in Dullsville, and it was unlike me to be so concerned with what anyone thought about me, but I couldn\u0027t help wanting to have a great relationship with Stormy. I didn\u0027t know what to do to entertain her in a town that wasn\u0027t filled with excitement. We\u0027d already gone to a movie and partied at the Crypt. I had Becky on speed dial in case I ran out of things to occupy her on my own.\u003c/p\u003e\n\u003cp\u003eI heard the sound of a car door shutting and raced down the stairs to open the front door.\u003c/p\u003e\n\u003cp\u003eStormy sauntered up our front walk alongside Alexander. I could see a slight resemblance in their gait, pale features and dark locks, and gorgeous smiles.\u003c/p\u003e\n\u003cp\u003eStormy appeared eager to arrive as she gave me a friendly wave. She looked sweet in black jean cutoff shorts, purple tights, and a V-neck, blood-red cardigan Stormy appeared eager to arrive as she gave me a friendly wave. She looked sweet in black jean cutoff shorts, purple tights, and a V-neck, blood-red cardigan she wore backward, exposing the top of her petite back. A tiny purple Hello Batty backpack purse hung from her shoulders and rested slightly above her waist.\u003c/p\u003e\n\u003cp\u003eI winked at Alexander as Stormy entered my house. He gave me a quick \"hello\" kiss while she took a moment to examine our family room.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pick you up in a few hours,\" Alexander said. \"Don\u0027t get into too much trouble,\" he said half seriously.\u003c/p\u003e\n\u003cp\u003eBut Stormy was entranced with my house as if she\u0027d never experienced a smaller-than-a-Mansion-type home.\u003c/p\u003e\n\u003cp\u003eI was reluctant to let Alexander leave. I loathed any time that we were apart when we could be together. But I reminded myself that I\u0027d be in the company of the next-best thing, his little vampire sister.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come back later,\" he said. \"Or if you guys go out, I can pick you up there, too. Just let me know.\" Alexander gave me a quick kiss on the cheek and patted Stormy on the arm.\u003c/p\u003e\n\u003cp\u003e\"Wow, this house is cute,\" she said when I closed the door.\u003c/p\u003e\n\u003cp\u003e\"I guess you are used to mansions,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I like this better. It\u0027s not so lonely,\" she said under her breath, as if she hadn\u0027t even meant for me to hear.\u003c/p\u003e\n\u003cp\u003eIs that how the younger sibling felt at the Mansion and at their home in Romania? The vast expanse of an estate was not comforting but rather reinforced the physical space between herself and her family? I\u0027d always wanted to be yards away from my family, so the thought of huge rooms and multiple places to hide seemed like a Barbie Dream House for me.\u003c/p\u003e\n\u003cp\u003eI heard my mom pulling her car Slinuse finto the garage.\u003c/p\u003e\n\u003cp\u003eThat was quick, I thought. Billy Boy was upstairs tucked away in his hobbit hole, but I knew once my mother came in she\u0027d dominate the conversation with her polite motherly banter.\u003c/p\u003e\n\u003cp\u003eI tried to continue to show Stormy around, but within a few moments, my mom was inside.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t sure you\u0027d be home,\" she said, holding several reusable bags filled with groceries. Then she noticed Stormy. \"I didn\u0027t know you had company.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, this is Alexander\u0027s sister, Stormy. Stormy, this is my mom.\"\u003c/p\u003e\n\u003cp\u003eMy mom set down her bags on our kitchen island and greeted Stormy. \"Oh, it\u0027s so nice to meet you,\" she exclaimed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a pleasure to meet you, Mrs. Madison,\" the younger Sterling said. She extended her hand.\u003c/p\u003e\n\u003cp\u003eBut instead of shaking it, my mom reached out and gave her a warm hug. \"You can call me Sarah.\" I grumbled inside. My mom had those swift moves that only a mother possessed. I couldn\u0027t have been so friendly to Stormy when I met her. But my mom - she filled the room with such positive maternal energy. And Stormy seemed to lap it up as she hugged my mom back as if she were her own.\u003c/p\u003e\n\u003cp\u003e\"Have you both eaten dinner?\" my mother asked. \"I bought some frozen pizza. It won\u0027t take long to heat up.\"\u003c/p\u003e\n\u003cp\u003e\"That is so kind of you, but I had dinner when I woke up,\" Stormy said.\u003c/p\u003e\n\u003cp\u003eMy mom paused as if Stormy had misspoken.\u003c/p\u003e\n\u003cp\u003e\"Uh ... yes, we\u0027ve both eaten,\" I said. \"We\u0027re just going up to my room to figure out what we want to do.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s so nice to meet you. How long will you be in town?\" my mom asked.\u003c/p\u003e\n\u003cp\u003e\"I hope for a while,\" she answered.\u003c/p\u003e\n\u003cp\u003eStormy followed me up the staircase and ran her fingers against the banister.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure there\u0027s tons of dust,\" I said.\u003c/p\u003e\n\u003cp\u003e\"No, not really,\" she said as if she was disappointed.\u003c/p\u003e\n\u003cp\u003e\"Wow - \" she said as I showed her into my room. \"This is cool.\"\u003c/p\u003e\n\u003cp\u003eMy room was broody and moody even with the lights on. I couldn\u0027t take my dresser mirror down, nor my full-length one on the back of my door. So instead, to avoid any issues for Sto Sssuignrmy, I had covered them with sheets. She didn\u0027t even mention it.\u003c/p\u003e\n\u003cp\u003eShe was intrigued by the macabre decor and rummaged through my closets as if they were her own. I sat back and watched with ease at the genuine interest she displayed examining my things. It was only afterward that she thought she was being rude.\u003c/p\u003e\n\u003cp\u003e\"I guess I shouldn\u0027t be doing this,\" she said. \"Mother would kill me if she saw me acting this way.\"\u003c/p\u003e\n\u003cp\u003e\"No, please, go ahead. It\u0027s really awesome to see someone interested in my stuff.\"\u003c/p\u003e\n\u003cp\u003e\"This is so fabulous. You have the best room.\"\u003c/p\u003e\n\u003cp\u003e\"You think so? No one\u0027s ever said that,\" I admitted truthfully. Now, maybe Alexander liked my room - but no one else had complimented my decor.\u003c/p\u003e\n\u003cp\u003e\"And my room at the Mansion is fabulous, too,\" she said with a grin.\u003c/p\u003e\n\u003cp\u003e\"Do you really like your room there?\" I asked. \"I wasn\u0027t sure what you\u0027d think of it.\"\u003c/p\u003e\n\u003cp\u003e\"I do. No one has ever done something like that for me,\" she said, genuinely.\u003c/p\u003e\n\u003cp\u003e\"Really?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eNot even Luna? I wanted to say. But I didn\u0027t want to bring up her name or hint that I might be envious of their prior friendship.\u003c/p\u003e\n\u003cp\u003e\"I expected your room to be different somehow,\" she said.\u003c/p\u003e\n\u003cp\u003e\"How do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Luna\u0027s room was really girlie.\"\u003c/p\u003e\n\u003cp\u003eThere it was! Not a moment later. That name. I bit my lavender-stained lip.\u003c/p\u003e\n\u003cp\u003e\"Like a fairy\u0027s room,\" she continued.\u003c/p\u003e\n\u003cp\u003e\"I can only imagine it\u0027s really cool,\" I said, trying to hide any tension in my voice.\u003c/p\u003e\n\u003cp\u003e\"Yes, it is very pretty.\"\u003c/p\u003e\n\u003cp\u003eI nodded my head and grinned.\u003c/p\u003e\n\u003cp\u003e\"But yours is like what I\u0027d want mine to be,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Really?\" I asked, surprised.\u003c/p\u003e\n\u003cp\u003e\"Yes, I mean, besides the one you decorated at the Mansion. I mean, this is what I like, too. I didn\u0027t S. Ight\u003d\"0emexpect you\u0027d have a room that I\u0027d want to have.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure what she meant, but I assumed it was a compliment.\u003c/p\u003e\n\u003cp\u003e\"So what did you think it would be like?\" I pressed, wanting more information from her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure, really. I just didn\u0027t think it would be so cool.\"\u003c/p\u003e\n\u003cp\u003eThat was the key to Stormy. I thought she didn\u0027t think she\u0027d like Alexander\u0027s girlfriend - one that wasn\u0027t Luna. And now that she found we did have things in common, it wasn\u0027t something she\u0027d expected.\u003c/p\u003e\n\u003cp\u003eJust then Nightmare darted into my room and jumped on my windowsill, curling up next to the curtain.\u003c/p\u003e\n\u003cp\u003e\"You have a cat, too?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, her name is Nightmare.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s so cute. Can I hold her?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\"\u003c/p\u003e\n\u003cp\u003eI scooped up my cat and petted her as I took her over to Stormy. \"Alexander gave her to me. He found her in an old railroad car when she was a kitten.\" I placed Nightmare in her arms. Stormy snuggled up to the black feline and caressed the bridge of her nose.\u003c/p\u003e\n\u003cp\u003e\"I think she likes you,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I have Phantom, and you have Nightmare.\"\u003c/p\u003e\n\u003cp\u003eI could hear Nightmare softly purring. \"I wonder if they\u0027d get along.\"\u003c/p\u003e\n\u003cp\u003e\"That would be cool to find out,\" I agreed. \"I think Nightmare would love the Mansion.\" Stormy played with Nightmare for a bit before she placed her back on the windowsill. \"Can I look around some more?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Of course you can.\" I sat at my computer chair and watched as she held up outfits in front of herself. \"You have some really awesome clothes. Where did you find this?\"\u003c/p\u003e\n\u003cp\u003eShe held up a three-quarter-length black-and-red knitted shirt.\u003c/p\u003e\n\u003cp\u003e\"I got it at a thrift store and poked some holes in it.\"\u003c/p\u003e\n\u003cp\u003e\"Fabulous!\" she said. \"I like this.\" She held up a black lace minidress. \"I wish I had it.\" I wasn\u0027t sure how to respond. No one had ever wanted to have some S toidtthing of mine, unless it was Billy Boy asking for computer paper.\u003c/p\u003e\n\u003cp\u003e\"Uh... I think it might be a little big,\" I said. \"But maybe - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I shouldn\u0027t have said anything.\" She began putting it back. It was as if her mind had caught up to her mouth. She avoided eye contact, and she appeared slightly embarrassed.\u003c/p\u003e\n\u003cp\u003e\"No - you can take it,\" I said. I had such trouble finding clothes in Dullsville that each outfit I did find meant something special to me. But this was the first time in my life that someone else appreciated them. \"Please take it,\" I insisted. \"I\u0027m sure Jameson can find a tailor in town to fit it for you.\"\u003c/p\u003e\n\u003cp\u003e\"You think?\" she asked, excited, as if I\u0027d given her a hundred dollars.\u003c/p\u003e\n\u003cp\u003e\"Yes, I think it would look great on you.\"\u003c/p\u003e\n\u003cp\u003e\"I can wear it to a dance,\" she said, modeling it.\u003c/p\u003e\n\u003cp\u003eJust then Billy walked by my door.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"My dopey brother.\"\u003c/p\u003e\n\u003cp\u003e\"You have a brother?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Didn\u0027t Alexander tell you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Has Alexander told you anything about me?\" I pried, but Stormy now appeared more interested in my brother than hers as she continued to stare out the doorway.\u003c/p\u003e\n\u003cp\u003e\"Can I meet him?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Billy?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But he\u0027s not cool like Alexander. He\u0027s a dork.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine a brother of yours who\u0027s a dork.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you don\u0027t have to imagine - you can see for yourself.\" I rose from my chair and headed for the doorway.\u003c/p\u003e\n\u003cp\u003e\"Hey, Billy. Get in here,\" I called.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m busy,\" he answered.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s someone I want you to meet.\"\u003c/p\u003e\n\u003cp\u003eWhen I didn\u0027t hear any movement, I said, \"Excuse me\" to my, headed down the hallway, and pounded on Billy\u0027s door.\u003c/p\u003e\n\u003cp\u003e\"I need to talk to you,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"I said I\u0027m busy.\"\u003c/p\u003e\n\u003cp\u003e\"I have someone I want you to meet.\"\u003c/p\u003e\n\u003cp\u003e\"Me?\" he asked skeptically. \"Go away.\"\u003c/p\u003e\n\u003cp\u003e\"No, really. It\u0027s Alexander\u0027s sister. Please be polite, for once.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"Open up, already!\" I demanded. I was seconds from storming into his room and pulling him out by his ear.\u003c/p\u003e\n\u003cp\u003eBut then he opened his door. \"I\u0027m the one in this house with manners,\" he snarled. \"It\u0027s you who acts like you live in a zoo.\" Billy finally came out of his room and followed me into mine. Stormy smiled brightly.\u003c/p\u003e\n\u003cp\u003e\"This is Stormy,\" I said. \"Stormy, this is Billy.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a pleasure to meet you,\" she said, extending her hand. He wasn\u0027t sure what to do with the formality and finally shook it.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" he said. \"I heard you were coming to town.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m visiting my brother.\"\u003c/p\u003e\n\u003cp\u003e\"Well ... it was nice meeting you,\" he said.\u003c/p\u003e\n\u003cp\u003eThere was an awkward pause between the two of them.\u003c/p\u003e\n\u003cp\u003e\"Okay, thanks for saying hi,\" I said. \"Now let\u0027s get back to the clothes and our plans for the evening.\" Billy Boy returned to his room as Stormy continued to beam.\u003c/p\u003e\n\u003cp\u003e\"Want to go to Hatsy\u0027s Diner for some shakes?\" I asked her.\u003c/p\u003e\n\u003cp\u003e\"Yes! And maybe Billy can come with us,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Uh ... he\u0027s not into anything that doesn\u0027t involve microchips.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027ll just have to change that for next time,\" she said as we grabbed our things and headed out of the house.\u003c/p\u003e\n\u003cp\u003eStormy was super impressed with the jukeboxes on the tables and the framed records on the walls. Conservative customers gawked at us, since we stood out like tombstones on a lawn. I was used to this treatment f Ss tfonrom my fellow Dullsvillians, but I felt protective of Alexander\u0027s sibling. I glared back hard at anyone who looked, and most turned back to their meals. Stormy was so caught up in the nostalgic restaurant that she didn\u0027t even notice.\u003c/p\u003e\n\u003cp\u003e\"This is so American!\" she said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I guess it is.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen places like this in movies.\"\u003c/p\u003e\n\u003cp\u003e\"You can get anything you want,\" I offered.\u003c/p\u003e\n\u003cp\u003e\"Do they have Romanian smoothies? Or steak tartare?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so. I think most things are cooked here.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay,\" she said. \"I brought this with me just in case,\" she said. She pulled out a water bottle, only instead of water it appeared to be filled with blood.\u003c/p\u003e\n\u003cp\u003eDixie, in her fifties-diner red-with-white-piping waitress uniform, shimmied her behind as she walked over to the table.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Dixie asked.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Dixie asked.\u003c/p\u003e\n\u003cp\u003e\"Uh ... it\u0027s Kool-Aid,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t look like Kool-Aid to me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an energy drink,\" Stormy tried to explain.\u003c/p\u003e\n\u003cp\u003e\"Well, if you came here for a nutritious meal,\" Dixie said, \"you came to the wrong place. If it\u0027s not fried, burnt, or floured, we don\u0027t serve it.\" She chomped her gum and blew a bubble.\u003c/p\u003e\n\u003cp\u003e\"No, we are indulging tonight,\" I said as Stormy surreptitiously slid her bottle back into her bag.\u003c/p\u003e\n\u003cp\u003e\"Two chocolate malts, please,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. We just had dinner.\"\u003c/p\u003e\n\u003cp\u003eDixie shimmied away, displeased that she didn\u0027t have a big order on her hands to increase her chances of a bigger tip.\u003c/p\u003e\n\u003cp\u003eWe both laughed as she placed our order at the counter.\u003c/p\u003e\n\u003cp\u003e\"This is fabulous,\" Stormy said.\u003c/p\u003e\n\u003cp\u003e\"You think? I\u0027ve been coming here for years with my best friend. Dixie has been working here since it opened.\" Stormy flipped through the jukebox songs on our table.\u003c/p\u003e\n\u003cp\u003e\"What is your favorite music?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I like the Skeletons.\"\u003c/p\u003e\n\u003cp\u003e\"You do? So do I. I don\u0027t think they are on there. They only have fifties artists.\"\u003c/p\u003e\n\u003cp\u003e\"What about Elvis?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Alexander loves him,\" I noted.\u003c/p\u003e\n\u003cp\u003e\"I know. So do I.\"\u003c/p\u003e\n\u003cp\u003eI found a quarter in my pocket and placed it in the jukebox. \"Play your favorite,\" I said. A moment later, \"(Let Me Be Your) Teddy Bear\" began to play overhead.\u003c/p\u003e\n\u003cp\u003eShe seemed fascinated by the music and the power of her pushing the button and it playing.\u003c/p\u003e\n\u003cp\u003eThen I remembered the Sterlings lived by candlelight. Modern technology wasn\u0027t something they dealt with every day.\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s Alexander like as a big brother?\" I asked.\u003c/p\u003e\n\u003cp\u003eI was always dying to know more about my boyfriend - especially because he was so mysterious that I didn\u0027t even know until recently that he had a sister.\u003c/p\u003e\n\u003cp\u003e\"He played with me when I was little, but when he got older, he went to his room most of the time and painted.\"\u003c/p\u003e\n\u003cp\u003e\"What did you play?\"\u003c/p\u003e\n\u003cp\u003e\"Games mostly. He loved checkers, so I did, too. But when I pulled out my fashion dolls he ran for his room.\" I laughed, and so did she.\u003c/p\u003e\n\u003cp\u003e\"Do you always get along with him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I guess so. I get on his nerves a lot,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine that.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, it\u0027s true. When he and Luna were going to their ceremony - \" Then she stopped. \"I mean...\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s okay, you can tell me.\"\u003c/p\u003e\n\u003cp\u003e\"I was dressed as the flower girl. I had dead black roses and held them in a small urn.\"\u003c/p\u003e\n\u003cp\u003e\"I bet you were pretty,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Thank you. Luna was waiting for him to start the ceremony, and everyone was getting impatient. We couldn\u0027t find Alexander.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"I was the one who found him sitting by himself outside a crypt. He told me that he wasn\u0027t going to the covenant altar with Luna. I got mad and poured the flowers on his shoes. And then I told my mother where he was.\"\u003c/p\u003e\n\u003cp\u003eI had never heard this story before, and from Stormy\u0027s point of view, Alexander\u0027s arranged eternal betrothal caused disappointment for many besides himself and Luna.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure he understood.\" I tried to ease her guilt.\u003c/p\u003e\n\u003cp\u003e\"When my mother got to the crypt, he was gone.\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"He eventually came home. But the Maxwells wanted revenge. Then he had to leave for Grandmother\u0027s Mansion here. But he didn\u0027t come back.\" I didn\u0027t know what to say. \"Well, you\u0027re together now,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said. \"Finally.\"\u003c/p\u003e\n\u003cp\u003e\"What do you like to do?\"\u003c/p\u003e\n\u003cp\u003e\"I like to write poems.\"\u003c/p\u003e\n\u003cp\u003e\"What about?\"\u003c/p\u003e\n\u003cp\u003e\"Boys.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a great subject.\"\u003c/p\u003e\n\u003cp\u003e\"I hope to have them published someday.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure they will be,\" I assured her.\u003c/p\u003e\n\u003cp\u003e\"I bet you are glad to see Jameson, too. He\u0027s so cool,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027ve missed him. He\u0027s funny.\"\u003c/p\u003e\n\u003cp\u003e\"Funny?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"When I was little, he liked to hide my dolls during the day. So when I woke up, I\u0027d have to search every room for them. I\u0027d find them resting under the stairs, poking out from behind an antique vase, or sticking out from my coat pocket. It was a fabulous game.\" I laughed, imagining Jameson sneaking around their Romanian mansion with dolls under his bony arms.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a half vamp; that\u0027s why he can be out all Sn b\u003c/p\u003e\n\u003cp\u003e\"He is?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, you didn\u0027t know?\" She appeared surprised.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t want to fib, but I also didn\u0027t want to appear like I hadn\u0027t been \"in the know.\" \"Uh...\"\u003c/p\u003e\n\u003cp\u003e\"Yes, he\u0027s mortal,\" she continued. \"He can be out in day and night but needs a vein like we do to exist.\" She said it so matter-of-fact that I was almost taken aback. I had to remind myself that I was, after all, sitting with a young vampire. But where Alexander was mysterious and kept much of this identity to himself, Stormy blurted out her information like any other girl without a secret.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why I love his Romanian smoothies,\" she continued. \"His California smoothies are terrible. They don\u0027t have blood.\"\u003c/p\u003e\n\u003cp\u003e\"Blood?\" a familiar voice said as someone scooted into the booth with me.\u003c/p\u003e\n\u003cp\u003e\"Blood?\" a familiar voice said as someone scooted into the booth with me.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" I asked Trevor. Then he gazed at Stormy.\u003c/p\u003e\n\u003cp\u003e\"Ditched Becky for the evening?\" Trevor asked.\u003c/p\u003e\n\u003cp\u003eDixie returned with our malts and placed them on our table. Trevor grabbed mine before I could and stuck my spoon in it. He took a scoop of my malt and put it in his mouth.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t about to be bullied in front of Stormy. It was uncomfortable enough for me to experience it without her having to experience it, too.\u003c/p\u003e\n\u003cp\u003e\"That was Raven\u0027s,\" Stormy said forcefully. I was surprised that she was defending me. I was proud of her. She was feisty like I was. But ultimately I didn\u0027t want her to be involved in my torment.\u003c/p\u003e\n\u003cp\u003e\"Raven likes to share,\" he said to her. \"I didn\u0027t know you had a little sister,\" he said to me.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t. This is Alexander\u0027s sister.\" I stressed Alexander, hoping that he\u0027d pick up on not picking on her. That Alexander would seek revenge if he did. And that I\u0027d stop him, too, if he tried.\u003c/p\u003e\n\u003cp\u003e\"Oh ... so Monster Girl has a Mini-Monster.\"\u003c/p\u003e\n\u003cp\u003eI was ready to dump the malt on his head, but I worried it wasn\u0027t the best example of proper behavior in front of Stormy. Instead I slid my hand underneath the table and pinched his leg with all my might.\u003c/p\u003e\n\u003cp\u003e\"Ouch!\" he said, putting the malt down.\u003c/p\u003e\n\u003cp\u003eI let go and gave him a death stare. \"You can address her by her real name. Athe Sall \u003d\"2em\" na. Other than that, any name is a violation.\"\u003c/p\u003e\n\u003cp\u003e\"A violation?\" he chuckled.\u003c/p\u003e\n\u003cp\u003e\"Yes, of Raven\u0027s law.\"\u003c/p\u003e\n\u003cp\u003e\"I see. And if I break it, will you arrest me? Please?\" He was as menacing as he was attractive. His blond hair flopped perfectly in place like a model\u0027s.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time for you to go,\" I said. \"Before you turn into a pumpkin.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he said. \"It was nice meeting you, Athena.\"\u003c/p\u003e\n\u003cp\u003eShe extended her hand. He paused for a moment, surprised by her formality.\u003c/p\u003e\n\u003cp\u003eThen he shook her hand.\u003c/p\u003e\n\u003cp\u003e\"Wow - you can learn a thing or two about manners from her,\" he said to me.\u003c/p\u003e\n\u003cp\u003e\"Uh ... so could you.\"\u003c/p\u003e\n\u003cp\u003eTrevor walked off to the counter.\u003c/p\u003e\n\u003cp\u003eI pushed my malt away from me. I wasn\u0027t about to drink it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry about that,\" I said. \"He\u0027s been bugging me since he was born.\"\u003c/p\u003e\n\u003cp\u003e\"I think he\u0027s cute!\"\u003c/p\u003e\n\u003cp\u003e\"Trevor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, this town is full of good-looking guys!\"\u003c/p\u003e\n\u003cp\u003e\"I think that\u0027s the jet lag talking,\" I said.\u003c/p\u003e\n\u003cp\u003e\"He really likes you. That\u0027s why he picks on you,\" she said.\u003c/p\u003e\n\u003cp\u003eI was shocked by her keen insight into Trevor. \"It\u0027s time to call Alexander,\" I declared.\u003c/p\u003e\n\u003cp\u003eJust then Dixie sashayed over and handed me another malt. \"It\u0027s from Trevor.\"\u003c/p\u003e\n\u003cp\u003e\"Ah,\" I said to Stormy. \"I think your good manners are rubbing off on him.\"\u003c/p\u003e\n\u003cp\u003eA short time later, Alexander met us in the diner\u0027s parking lot. This time Stormy hopped in the back of the car.\u003c/p\u003e\n\u003cp\u003e\"You can sit up front,\" I said.\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s okay. I like being chauffeured,\" she said. I thought it was cute how she was slowly warming up to me.\u003c/p\u003e\n\u003cp\u003e\"So, did you kids have fun?\" Alexander teased.\u003c/p\u003e\n\u003cp\u003e\"I did,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, Raven gave me this dress,\" she said, pulling it out of the bag.\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t be taking clothes from her,\" Alexander scolded. Normally the driver looks in the rearview mirror when talking to the passenger in the backseat.\u003c/p\u003e\n\u003cp\u003eBut Alexander didn\u0027t. He knew he wouldn\u0027t be able to see his sister in the reflection.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" I assured him. \"I want her to have it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve done enough already,\" he said.\u003c/p\u003e\n\u003cp\u003e\"And I met her brother, Billy,\" Stormy added.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s cool. He\u0027s your age.\"\u003c/p\u003e\n\u003cp\u003e\"I know...\" Stormy giggled under her breath.\u003c/p\u003e\n\u003cp\u003e\"Sounds like you guys had too much fun without me. I\u0027m not sure you need me anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Of course we do,\" I said, putting my hand on his shoulder.\u003c/p\u003e\n\u003cp\u003e\"Well, maybe not...\" Stormy teased. I thought she liked the attention she was getting, no matter who it was from.\u003c/p\u003e\n\u003cp\u003e\"And I met this guy named Trevor,\" she continued.\u003c/p\u003e\n\u003cp\u003e\"You did?\" Alexander asked. There was a hint of concern in his voice.\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t a big deal,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I think he likes Raven,\" she said.\u003c/p\u003e\n\u003cp\u003eAlexander paused.\u003c/p\u003e\n\u003cp\u003e\"Are you trying to start trouble?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just being honest.\"\u003c/p\u003e\n\u003cp\u003e\"Well, he\u0027s going out with our friend Scarlet,\" I said. \"Besides, Alexander doesn\u0027t have to worry about anyone.\"\u003c/p\u003e\n\u003cp\u003e\"You should keep an eye on him,\" she warned Alexander. \"I don\u0027t trust him.\"\u003c/p\u003e\n\u003cp\u003e\"I have to keep my eyes on you,\" Alexander said. \"One night out and you\u0027re already meeting boys and getting new dresses and hanging around the town bully.\"\u003c/p\u003e\n\u003cp\u003eStormy giggled again. \"Too bad you didn\u0027t come.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you\u0027ve both had a full evening,\" he said, pulling into my driveway.\u003c/p\u003e\n\u003cp\u003eI stepped out of the car, and Stormy jumped out of the Mercedes, too. Instead of extending her hand to say good night, she smiled and leaned in to me. She wrapped her lithe arms around my waist and gave me a hug so hard I melted inside. Then she hopped into the front seat.\u003c/p\u003e\n\u003cp\u003eI was so flattered. I had had a great time, and so had Stormy.\u003c/p\u003e\n\u003cp\u003eAlexander took my hand and walked me to the door.\u003c/p\u003e\n\u003cp\u003e\"I see you\u0027ve made a good impression on her.\"\u003c/p\u003e\n\u003cp\u003e\"I really had a blast,\" I said. \"I wish I had a little sister.\"\u003c/p\u003e\n\u003cp\u003eWe turned around and saw Stormy watching us from the car. I knew she was dying to see if her brother would kiss me.\u003c/p\u003e\n\u003cp\u003eShe turned away like she hadn\u0027t been looking. She leaned over and got the dress out of the bag and began eyeing it instead.\u003c/p\u003e\n\u003cp\u003eShe turned away like she hadn\u0027t been looking. She leaned over and got the dress out of the bag and began eyeing it instead.\u003c/p\u003e\n\u003cp\u003eAlexander took the now private opportunity and leaned in and kissed me. His lips were so tender that I became lost in them. Suddenly the car horn honked and we both jumped.\u003c/p\u003e\n\u003cp\u003eI tried to catch my breath, and Alexander was now frustrated with his sibling. Then we both burst out laughing.\u003c/p\u003e\n\u003cp\u003e\"See, she\u0027s not so mannerly after all,\" my boyfriend said. \"Thanks so much,\" he added as I unlocked the door. \"This meant a lot to me.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to thank me,\" I said truthfully. \"I\u0027ve been waiting for nights like these for all my life.\" d \u003c/p\u003e","sourceLink":"https://allnovel.net/immortal-hearts-vampire-kisses-9/page-7.html","bookId":2147,"creation":"Oct 5, 2019 6:20:23 PM","modification":"Oct 5, 2019 6:20:23 PM"}
