{"id":96453,"no":13,"title":"Page 13","content":"\u003cp\u003eThe following morning, Nash stumbled into class. His hair wasn\u0027t gelled and meticulously unkempt but rather tousled as if he\u0027d just crawled out of bed. His eyelids were droopy and his preppy clothes were wrinkled, with half of his polo collar sticking up. He carried his books like they were a football.\u003c/p\u003e\n\u003cp\u003eA few of the girls snickered at his appearance.\u003c/p\u003e\n\u003cp\u003e\"Had a late night with Celeste?\" Dylan asked.\u003c/p\u003e\n\u003cp\u003eNash high-fived him. But we girls knew differently.\u003c/p\u003e\n\u003cp\u003eAbby winked at me while Ivy didn\u0027t even turn around.\u003c/p\u003e\n\u003cp\u003eThe next several days, Nash continued to arrive late for class, and Ivy continued to ignore my pleas for forgiveness.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m benched for a few baseball practices until this thing heals,\" Nash said, looking bummed at lunch.\u003c/p\u003e\n\u003cp\u003eIvy still sat on the opposite end of the table from me. The tension was as thick as the meat loaf the cafeteria served.\u003c/p\u003e\n\u003cp\u003eHer scorn didn\u0027t go unnoticed by the guys at the table.\u003c/p\u003e\n\u003cp\u003e\"You barely even look at Celeste,\" Dylan said. \"Catfight?\"\u003c/p\u003e\n\u003cp\u003e\"You can ask her,\" Ivy said.\u003c/p\u003e\n\u003cp\u003e\"Nothing wrong over here,\" I said.\u003c/p\u003e\n\u003cp\u003e\"She would think that,\" I heard her mumble.\u003c/p\u003e\n\u003cp\u003e\"We are one big, happy family,\" Abby said to Dylan.\u003c/p\u003e\n\u003cp\u003eAbby was stuck in the middle of our feud and was doing her best not to draw attention to it.\u003c/p\u003e\n\u003cp\u003eBut I was dying inside. My best friend was now acting as if I were her enemy - and maybe to her I was. It turned me inside out and made me upset to be ignored - especially by my own best friend.\u003c/p\u003e\n\u003cp\u003eI decided to do something about it, sooner rather than later.\u003c/p\u003e\n\u003cp\u003e\"I want to make a peace offering to Ivy,\" I said to Abby later that day.\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\" she asked. Abby hadn\u0027t told Ivy her secret; if Ivy and I reconciled, then she\u0027d be the odd girl out once she revealed hers.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t take her ignoring me any longer.\"\u003c/p\u003e\n\u003cp\u003e\"What do you want to do?\"\u003c/p\u003e\n\u003cp\u003e\"Go back to Dr. Meadows\u0027s shop.\"\u003c/p\u003e\n\u003cp\u003eAbby perked up. \"For another fortune?\"\u003c/p\u003e\n\u003cp\u003e\"No, I want to avoid that at all costs.\"\u003c/p\u003e\n\u003cp\u003e\"Then what for?\"\u003c/p\u003e\n\u003cp\u003e\"Something blue.\"\u003c/p\u003e\n\u003cp\u003eAbby and I entered Penny for Your Thoughts, and I rushed over to one of the jewelry tables with bated breath, hoping the earrings were still there. I spun the rack of earrings around when I saw the blue crystals glistening back at me.\u003c/p\u003e\n\u003cp\u003e\"Can I be mad at you, too?\" Abby asked as I held up the sparkling jewelry in the light.\u003c/p\u003e\n\u003cp\u003eThe earrings were way more than I\u0027d ever spent on jewelry for myself or my friends. I was known more to make earrings or buy them at mall boutiques. But these were real rocks, not plastic, and cost the amount of two trips to the movies including a tub of popcorn. But today I was going to splurge for the girl who had always saved a seat on the bus for me for the past eleven years.\u003c/p\u003e\n\u003cp\u003eI was nervous about seeing Dr. Meadows, however.\u003c/p\u003e\n\u003cp\u003e\"Hello, ladies . . .\" she said as she greeted us at the counter. \"Where is your friend?\"\u003c/p\u003e\n\u003cp\u003e\"Ivy?\" Abby said. \"We are here for a surprise. But you probably already knew,\" she said with a giggle.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t want to give any information to Dr. Meadows - my plan was to get in the shop, pay, and get out without so much as a future warning about moons.\u003c/p\u003e\n\u003cp\u003eBut Abby was all about telling Dr. Meadows our story, like she was a therapist instead of a psychic.\u003c/p\u003e\n\u003cp\u003e\"Yes. She\u0027s a bit mad, and Celeste thought it would be awesome to give her a \u0027forgive me\u0027 gift.\"\u003c/p\u003e\n\u003cp\u003e\"Uh . . . yes,\" I politely agreed. \"Ivy really liked these earrings last time we were here.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that is a good friend,\" Dr. Meadows said, \"to think that much of her to remember what she liked and buy them for her. I can\u0027t imagine why she\u0027d be mad at you.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s mad because Celeste was going out with this guy and she didn\u0027t tell her.\"\u003c/p\u003e\n\u003cp\u003eAbby couldn\u0027t stop talking to Dr. Meadows.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. I felt like I was with my mother when she\u0027d blab my bra size to the saleswoman even though I could look in the bin myself. Too much information.\u003c/p\u003e\n\u003cp\u003e\"Ahh . . . you have a boyfriend?\"\u003c/p\u003e\n\u003cp\u003eI shrugged my shoulders.\u003c/p\u003e\n\u003cp\u003e\"But I think I already knew that,\" she said.\u003c/p\u003e\n\u003cp\u003e\"You did?\" Abby said, surprised. \"Celeste told you? Ah . . . of course you knew. You read her mind.\"\u003c/p\u003e\n\u003cp\u003eBut in fact I was the one who had told Dr. Meadows that I had feelings for a guy who I thought was changing into a werewolf.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d just like to buy these, please,\" I said, trying to change the subject.\u003c/p\u003e\n\u003cp\u003e\"So who is this mystery man?\" Dr. Meadows pried. She knew whoever he was must be the guy that I thought was a werewolf but refused to reveal to her.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t about to tell her. Not now or ever.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Brandon Maddox!\" Abby blurted out. \"Do you know him? He lives around here.\"\u003c/p\u003e\n\u003cp\u003eMy mouth dropped wide open. I was shocked and horrified by Abby\u0027s blabbing. I didn\u0027t even have the chance to hush, nudge, or quiet her before his name and location were handed to the one woman I didn\u0027t want to have the information.\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think I know him,\" Dr. Meadows said.\u003c/p\u003e\n\u003cp\u003eI was only slightly relieved, because as long as she knew his name, she could search him out.\u003c/p\u003e\n\u003cp\u003e\"Is he related to Sophie and Franklin Maddox?\" Dr. Meadows suddenly asked.\u003c/p\u003e\n\u003cp\u003eThose were Brandon\u0027s grandparents, but I wasn\u0027t about to give her any more information.\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s time we go,\" I said. \"Abby is almost late for volleyball practice.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" Abby said, realizing the time.\u003c/p\u003e\n\u003cp\u003eI handed Dr. Meadows my money, and she placed the earrings in a box.\u003c/p\u003e\n\u003cp\u003e\"Would you like me to wrap this?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"No, thank you,\" I said hurriedly. \"I can do that at home.\"\u003c/p\u003e\n\u003cp\u003e\"Please come again, girls, and bring Ivy with you. I know she\u0027ll cool off after she sees what she means to you.\"\u003c/p\u003e\n\u003cp\u003eThat was one prediction she\u0027d made that I hoped would come true.\u003c/p\u003e\n\u003cp\u003e\"Okay!\" we both said as we headed for the door.\u003c/p\u003e\n\u003cp\u003e\"Oh, and Celeste,\" she called after me. \"Be sure to bring Brandon, too.\"\u003c/p\u003e\n\u003cp\u003eI scowled inside but smiled sweetly on the outside. Before she could come from behind the counter and attempt to give me another of her unwanted psychic predictions, I raced out of the shop and into the safety of my car.\u003c/p\u003e\n\u003cp\u003eThe next morning, I unlocked Ivy\u0027s locker. We all knew one another\u0027s combos as if they were our own. The inside of her locker was decorated with pictures of our sixsome together.\u003c/p\u003e\n\u003cp\u003eI placed the package I\u0027d wrapped with pink paper and a whimsical purple bow on the top shelf, along with a card I\u0027d made for her.\u003c/p\u003e\n\u003cp\u003eI waited at the end of the hallway with a watchful gaze. When she arrived at her locker and opened it, she picked up the gift.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s from Celeste,\" she whispered. She must have recognized my handwriting.\u003c/p\u003e\n\u003cp\u003eAbby nodded. \"You should open it.\"\u003c/p\u003e\n\u003cp\u003e\"Of course I\u0027m going to open it. It\u0027s a present. Hey, maybe this is that unexpected gift Dr. Meadows told me about!\"\u003c/p\u003e\n\u003cp\u003eIvy opened the card and read my touching note. \"Aww . . .\" she said.\u003c/p\u003e\n\u003cp\u003eThen she unwrapped the gift.\u003c/p\u003e\n\u003cp\u003e\"She bought me the earrings I loved!\" she said. \"That was so nice of her!\"\u003c/p\u003e\n\u003cp\u003eI headed over to her locker as she caught sight of me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry - \" I began.\u003c/p\u003e\n\u003cp\u003e\"Me too!\" She opened her arms for a best friends embrace. \"I missed you!\"\u003c/p\u003e\n\u003cp\u003e\"Me too!\"\u003c/p\u003e\n\u003cp\u003eWe squeezed each other so hard I knew that she, too, had really missed me during the days we\u0027d spent apart.\u003c/p\u003e\n\u003cp\u003e\"I love these earrings,\" she said. She quickly took off the gazillion-dollar ones she was wearing and replaced them with the ones I\u0027d bought for her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so glad you do,\" I said, relieved we were back to normal. The blue crystals shined brightly against her lustrous blond hair.\u003c/p\u003e\n\u003cp\u003e\"I wanted to tell you,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I shouldn\u0027t have made fun of him,\" she apologized.\u003c/p\u003e\n\u003cp\u003eAbby stood with her arms folded as Ivy and I ended our feud.\u003c/p\u003e\n\u003cp\u003eI was so happy to have my friend back, I almost teared up.\u003c/p\u003e\n\u003cp\u003eWe headed into class and chatted like we\u0027d been doing every day since elementary school until the ringing bell ceased our gossip session. \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-of-the-moonlight-full-moon-2/page-13.html","bookId":2149,"creation":"Oct 5, 2019 6:21:29 PM","modification":"Oct 5, 2019 6:21:29 PM"}
