{"id":102134,"no":11,"title":"Page 11","content":"\u003cp\u003e“Finish your coffee,” he said. “We’ll be leaving in a couple of minutes.”\u003c/p\u003e\n\u003cp\u003e“It’s not coffee. It’s latte. Eggnog-flavored.” She had to argue about everything. But she obediently drained the large cup.\u003c/p\u003e\n\u003cp\u003eOliver taxied to the end of the runway and waited for approval to take off. It wasn’t long in coming. He was in the air before he realized that Emma’s eyes were squeezed shut. Like yesterday, she held on to the bar above the door with what could only be described as a death grip. But at least she wasn’t confessing at the top of her lungs that she’d lied about her weight. The memory produced a grin and for a moment he forgot that he was annoyed with her.\u003c/p\u003e\n\u003cp\u003eThey hardly spoke the entire flight. Every now and then he felt her glance in his direction, as if to gauge his mood. An hour outside of Colville, he saw that she was squirming in her seat.\u003c/p\u003e\n\u003cp\u003e“What’s the problem now?” he asked.\u003c/p\u003e\n\u003cp\u003eEmma shifted from one side to the other. “If you must know, I have to use the, uh, facilities.”\u003c/p\u003e\n\u003cp\u003e“You should’ve gone before we left.”\u003c/p\u003e\n\u003cp\u003e“I did,” she said, not bothering to hide her indignation.\u003c/p\u003e\n\u003cp\u003e“There isn’t a toilet on the plane.”\u003c/p\u003e\n\u003cp\u003eShe turned and scowled at him. “I noticed. Do you have any other suggestions?”\u003c/p\u003e\n\u003cp\u003e“You can do what I do,” he told her. Reaching behind him, he grabbed a wide-mouth red plastic container.\u003c/p\u003e\n\u003cp\u003eShe looked at it as if he’d just handed her a dead rat. “You aren’t serious, are you?”\u003c/p\u003e\n\u003cp\u003e“You said you had to go.”\u003c/p\u003e\n\u003cp\u003e“You don’t honestly expect me to…go,” she said, apparently not finding a more suitable verb, “in that.”\u003c/p\u003e\n\u003cp\u003e“I use it.”\u003c/p\u003e\n\u003cp\u003e“It’s different for a man. There’s a bit more effort involved for a woman.”\u003c/p\u003e\n\u003cp\u003e“We’re a little less than an hour from Colville.”\u003c/p\u003e\n\u003cp\u003eShe crossed her legs. “I guess I can wait.”\u003c/p\u003e\n\u003cp\u003e“I thought you’d say that.”\u003c/p\u003e\n\u003cp\u003eBy the time he approached the Colville runway, Oliver’s sympathies were with Emma. She was clearly uncomfortable, if the number of times she’d crossed and uncrossed her legs was any indication. He didn’t have the heart to tell her there wasn’t a terminal in Colville. The runway was next to a cow pasture, and while there was an office, that didn’t necessarily mean anyone would be there to let her in. It’d been a while since his last visit and he didn’t recall if there was a restroom of any kind in the hangar. For her sake, he hoped there was.\u003c/p\u003e\n\u003cp\u003eEmma bit her lower lip when the wheels touched down. Oliver taxied and parked the plane and leaped out. Just as he’d suspected, no one emerged from the office.\u003c/p\u003e\n\u003cp\u003e“There’s a toilet in there,” he said, helping her down. “But I’m not sure it’s open….”\u003c/p\u003e\n\u003cp\u003eShe had a desperate look.\u003c/p\u003e\n\u003cp\u003eEmma hurried toward the office, but no one answered her frantic knock. When she glanced over her shoulder, he shrugged, pointing at the hangar.\u003c/p\u003e\n\u003cp\u003eWith that, she bolted for the large metal shed. She must have found what she needed because she didn’t immediately reappear. While he waited, Oliver got on his cell and phoned the Spokane restaurant with his ETA. Someone would meet him at the airfield to pick up the salmon delivery.\u003c/p\u003e\n\u003cp\u003eWhen she returned from the hangar she was frowning. “The conditions in there were deplorable. Downright primitive.”\u003c/p\u003e\n\u003cp\u003e“Hey,” he said, holding up both hands in a gesture of surrender. “It wasn’t me who gulped down that eggnog latte.”\u003c/p\u003e\n\u003cp\u003eShe threw him an irate look. “The least you could’ve done was warn me how long the flight was going to take.”\u003c/p\u003e\n\u003cp\u003e“You’re a reporter. You could’ve done the research.” He was about to say something else when he saw the small black dog.\u003c/p\u003e\n\u003cp\u003eEmma had noticed the mutt, too, a curly-haired mixed breed, probably part poodle. From the matted hair and the lost expression in her brown eyes, Oliver could tell the dog was a stray.\u003c/p\u003e\n\u003cp\u003e“Where did you come from?” Emma asked, gently petting her. The dog stared longingly up at her and started to shake. “She’s cold,” Emma said.\u003c/p\u003e\n\u003cp\u003eOliver felt bad, but there was little he could do. As it was, Oscar had seen her, jumped down, barking loudly, and then promptly did what dogs always do when they meet another of their kind. He sniffed her butt.\u003c/p\u003e\n\u003cp\u003e“I had no idea this town was so small,” Emma commented. She looked over the cow pasture and wrapped her coat more securely around her. “Do you have anything to eat?”\u003c/p\u003e\n\u003cp\u003e“You’re hungry?”\u003c/p\u003e\n\u003cp\u003e“No, but the dog is. I don’t usually carry food with me.” She checked the inside of her purse; the best she had to offer was a half-used package of antacid mints. Unfortunately, Oliver wasn’t much help, either.\u003c/p\u003e\n\u003cp\u003eA lone car drove past the road next to the airfield. “Do you have my cell phone number?” he asked, following the vehicle with his eyes.\u003c/p\u003e\n\u003cp\u003e“You gave it to me in Yakima.”\u003c/p\u003e\n\u003cp\u003e“Right.” He remembered that now. “Call me when you’re finished, all right?” As soon as she was picked up, he’d fly into Spokane.\u003c/p\u003e\n\u003cp\u003e“When will you be back?” she asked.\u003c/p\u003e\n\u003cp\u003eSo she was going to miss him, he thought, warmed by the question. She wouldn’t admit it, of course, but she was attracted to him. He decided it was better not to react.\u003c/p\u003e\n\u003cp\u003e“You’re sure you have a ride,” he confirmed.\u003c/p\u003e\n\u003cp\u003e“Sophie McKay said she’d come and get me.”\u003c/p\u003e\n\u003cp\u003eShe pulled out her cell and punched in a number from her little daybook. After a short conversation, she nodded in his direction, letting him know her ride was on the way.\u003c/p\u003e\n\u003cp\u003eOliver hesitated. He didn’t feel entirely comfortable about leaving her here alone, in what was virtually a deserted field.\u003c/p\u003e\n\u003cp\u003e“You can go,” she said, her shoulders hunched against the wind. “Ms. McKay will be here any minute.”\u003c/p\u003e\n\u003cp\u003e“How long will the interview be?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. I imagine an hour, two at the most.”\u003c/p\u003e\n\u003cp\u003eOliver estimated that he wouldn’t be away more than a couple of hours himself, but it wasn’t a problem if Emma required more time. The Indian casino was a few miles down the road, and if she was occupied, the gaming tables offered him ample entertainment. Emma might not want to ride his folding bicycle, but he didn’t mind using it. He welcomed the excuse to try his hand at blackjack. The slot machines were pretty much a bust, but he did fairly well with a deck of cards.\u003c/p\u003e\n\u003cp\u003e“Take all the time you need.”\u003c/p\u003e\n\u003cp\u003eShe smiled and frankly he wished she hadn’t. When she acted this pleasant, it was hard to remember what a pain she really was.\u003c/p\u003e\n\u003cp\u003eEmma wrapped the plaid wool scarf around her face to ward off the chill wind, then buried her hands in her pockets. At the moment, she looked about as pitiful as the stray dog huddled next to her feet.\u003c/p\u003e\n\u003cp\u003e“Just call my cell and I’ll be back as soon as I can.”\u003c/p\u003e\n\u003cp\u003e“I will,” she assured him, her words muffled. “You’d better go or you’ll be late.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eHe hesitated a moment longer, then returned to the plane and opened the cargo hatch. To his surprise, Emma followed him.\u003c/p\u003e\n\u003cp\u003e“You’re upset because you found out I didn’t want to fly with you again,” she said. Her hands remained in her pockets.\u003c/p\u003e\n\u003cp\u003eHe shrugged as if it didn’t matter either way.\u003c/p\u003e\n\u003cp\u003e“If not that, then is it because…” She stopped, her expression mildly embarrassed.\u003c/p\u003e\n\u003cp\u003e“What?” he demanded.\u003c/p\u003e\n\u003cp\u003e“Never mind.”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “I want to know.”\u003c/p\u003e\n\u003cp\u003eShe looked at him hard. “Is it because I…I didn’t react the way you wanted when you kissed me?”\u003c/p\u003e\n\u003cp\u003eHe didn’t want to answer that and climbed aboard the plane.\u003c/p\u003e\n\u003cp\u003e“I didn’t see any fireworks when we kissed. Did you?” she asked, sticking her head in the cargo hold.\u003c/p\u003e\n\u003cp\u003eHe snorted.\u003c/p\u003e\n\u003cp\u003e“Then it isn’t any big deal, right?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Friends?” she asked.\u003c/p\u003e\n\u003cp\u003eWithout meaning to be rude, Oliver paused. “I guess. Why do you care?”\u003c/p\u003e\n\u003cp\u003eHis question appeared to catch her off guard. “I don’t know, but I do. If we’re going to be spending time together for the next week or so, then I think it’s preferable to get along.”\u003c/p\u003e\n\u003cp\u003e“Of course. You have nothing to worry about.”\u003c/p\u003e\n\u003cp\u003eShe glanced nervously away. “My mother told me that when a man uses that line, I should start to worry.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “No, you don’t. You’re perfectly safe with me.”\u003c/p\u003e\n\u003cp\u003eAs if in disagreement, the little black dog at her feet snarled up at him.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eFruitcake is one of those foods that evoke lots of different feelings in people. For me it marks the holiday season that is accompanied by traditions and family. Sharing foods that you eat during certain times of the year is something that I look forward to. A warmed thin slice of fruitcake with freshly made ice cream is the way to go.\u003c/p\u003e\n\u003cp\u003e—Craig Strong, chef de cuisine, The Dining Room,\u003c/p\u003e\n\u003cp\u003eThe Ritz-Carlton in Pasadena, California\u003c/p\u003e\n\u003cp\u003eSophie McKay arrived at the airfield five minutes after Oliver left. Although Emma would never admit it, she found his reluctance to leave her somewhat comforting. She just might have to change her opinion of Oliver Hamilton.\u003c/p\u003e\n\u003cp\u003eEmma spent those five minutes alone paying attention to the small stray, whom she called Boots because she had two white paws and otherwise black fur. The poor thing shivered in the cold.\u003c/p\u003e\n\u003cp\u003eWhen a compact car turned off the road and onto the airfield, Emma straightened. The vehicle came to a stop not far from her, and the driver rolled down her window.\u003c/p\u003e\n\u003cp\u003eShe was an elegant eighty or so, with thick white hair, fashionably styled. Her face glowed with pleasure. “Are you the reporter from The Examiner?”\u003c/p\u003e\n\u003cp\u003eEmma nodded. “And you must be Sophie McKay.”\u003c/p\u003e\n\u003cp\u003e“I am. You seem half-frozen. Come on, I’ll drive you to my house. It’s warm and cozy, and I’ll put on a pot of tea.”\u003c/p\u003e\n\u003cp\u003eEmma looked down at the little dog. Crouching, she petted Boots.\u003c/p\u003e\n\u003cp\u003e“I see you have a friend,” Sophie commented.\u003c/p\u003e\n\u003cp\u003e“Does she have an owner?” Emma asked hopefully, but considering the dog’s appearance, she agreed with Oliver that Boots was most likely a stray.\u003c/p\u003e\n\u003cp\u003e“Not that I know of. The poor dog’s been hanging around the area for a while. I put food out for her a few times, and I know other people have, too, but she’s skittish. I think someone must’ve mistreated her because she doesn’t let anyone get too close. Except for you, apparently.”\u003c/p\u003e\n\u003cp\u003eBoots had taken to Emma right away, and she hated to leave the dog behind. “Would you mind if I brought her with me?” What she’d do with Boots after that was a quandary, but Emma didn’t feel she could just walk away.\u003c/p\u003e\n\u003cp\u003e“That might be a problem because of my cats.”\u003c/p\u003e\n\u003cp\u003eEmma gazed down at the dog, unsure what to do.\u003c/p\u003e\n\u003cp\u003e“Could you find somewhere warm for her to stay until later?” Sophie suggested. “Maybe in the hangar? I’ll give you some food to bring back for her.”\u003c/p\u003e\n\u003cp\u003e“Good idea.” Emma hadn’t thought of that. Boots followed her inside while Sophie dug up an old blanket from the trunk of her car. Emma folded it and placed it on the bathroom floor. Boots didn’t object when Emma shut her inside the small room. At least the dog was out of the cold and out of danger. Squatting down, Emma stroked her thin sides and spoke in low, soothing tones, assuring her she’d be back soon. \u003c/p\u003e","sourceLink":"https://allnovel.net/glad-tidings/page-11.html","bookId":2631,"creation":"Oct 5, 2019 10:14:03 PM","modification":"Oct 5, 2019 10:14:03 PM"}
