{"id":102137,"no":14,"title":"Page 14","content":"\u003cp\u003eHe sighed. “I was on a winning streak. I didn’t know how long it was going to last. But sending for you was the stupidest thing I could’ve done. The minute you showed up, I started losing.”\u003c/p\u003e\n\u003cp\u003e“You’re blaming me?” Emma had to get away from this Neanderthal. “Go ahead without me,” she told him. “I’ll phone for a taxi.”\u003c/p\u003e\n\u003cp\u003eOliver nearly doubled over as he burst into laughter. “La-di-da. Her highness requires a private conveyance. Do you actually believe a town the size of Colville has a taxi service?”\u003c/p\u003e\n\u003cp\u003e“Oh.” Emma had assumed there was one.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I’m the forgiving sort. I’ll still let you ride with me and if you’re real nice I won’t make you sit in the back of the truck.”\u003c/p\u003e\n\u003cp\u003eBy this time Emma was so angry with Oliver, she wanted to smack him upside the head. “Have you been drinking?” she snapped.\u003c/p\u003e\n\u003cp\u003e“Absolutely not.” His smile faded. “FAA regulations don’t permit it. I worked too hard for this license to mess it up over a beer.”\u003c/p\u003e\n\u003cp\u003eShe had half a mind to lean over and smell his breath. She didn’t, for fear he’d try to kiss her again. And yet…the thought was strangely appealing.\u003c/p\u003e\n\u003cp\u003eShe and Oliver clambered into a rickety old truck driven by a bearded taciturn man named Michael Michaels—known as Mike-Mike. He had remarkably little to say, which was fine with Emma. Preferable to Grizzly’s idea of conversation, anyway.\u003c/p\u003e\n\u003cp\u003eOn the ride back to Colville Emma reminded herself that she wasn’t attracted to Oliver Hamilton. Still, if he wanted to kiss her—not now, of course, but later—she was afraid she might let him. Perhaps she was experiencing altitude sickness. There was definitely something in the air, but it wasn’t Christmas and it sure wasn’t love.\u003c/p\u003e\n\u003cp\u003eEmma sat between the two men with Boots, plus her purse and briefcase, on her lap and Oscar down by Oliver’s feet. When they arrived at the field, Emma climbed out of the truck once Oliver had leaped to the ground. She thanked Mike-Mike politely for the ride.\u003c/p\u003e\n\u003cp\u003eOliver handed his new friend a few dollars. With the two dogs trotting behind them, Emma and Oliver headed toward the Cessna.\u003c/p\u003e\n\u003cp\u003e“How’d the interview go?” Oliver asked as they approached the plane.\u003c/p\u003e\n\u003cp\u003eThe tension left her shoulders. “I think Sophie is one of the most interesting women I’ve ever met.”\u003c/p\u003e\n\u003cp\u003e“Really.” Oliver walked around the Cessna, giving it the usual inspection.\u003c/p\u003e\n\u003cp\u003e“She’s loved one man her entire life.”\u003c/p\u003e\n\u003cp\u003eHe nodded, although she doubted he was listening.\u003c/p\u003e\n\u003cp\u003e“Harry died twenty years ago, and she’s loved him and only him all these years. I find that so romantic.”\u003c/p\u003e\n\u003cp\u003e“Romantic,” he repeated absently.\u003c/p\u003e\n\u003cp\u003e“Did you hear me?” she asked.\u003c/p\u003e\n\u003cp\u003eOliver glanced back at her. “I heard you. So what’s the big deal? Men and women stay in love all the time.”\u003c/p\u003e\n\u003cp\u003e“They don’t,” Emma said. “Do you know what the divorce rate is in this country? One out of every two marriages fails. That’s a fifty-percent failure rate. Men and women don’t stay in love, and do you know why?”\u003c/p\u003e\n\u003cp\u003eHe yawned.\u003c/p\u003e\n\u003cp\u003e“It’s because there aren’t any genuinely romantic men left in this world. Where’s Cary Grant when we need him? What about Humphrey Bogart? Rock Hudson? No, wait. Not him. Although he was very romantic in all those Doris Day movies.”\u003c/p\u003e\n\u003cp\u003e“Donald Duck. Daisy thought he was pretty romantic.”\u003c/p\u003e\n\u003cp\u003eThis time she couldn’t resist and slapped his shoulder. “It’s all one big joke to you, isn’t it?” Without giving him a chance to respond, she said, “I’m serious.”\u003c/p\u003e\n\u003cp\u003e“There are romantic men in this world, Emma. Lots of them, and they don’t look anything like a bunch of old movie stars, either. Real romance isn’t about candlelit dinners or diamonds or champagne. As for couples staying in love, my parents have been married for thirty-six years.”\u003c/p\u003e\n\u003cp\u003eSuddenly Oliver Hamilton was the expert. “You know all about this subject, do you?” She let him hear the sarcasm in her voice.\u003c/p\u003e\n\u003cp\u003e“You’d probably consider my brother a romantic. At least he tried to be. Unfortunately, the whole thing backfired on him.”\u003c/p\u003e\n\u003cp\u003eEmma knew he wanted her to ask what happened and she refused to. She needn’t have worried because Oliver was intent on telling her, whether she wanted to be told or not.\u003c/p\u003e\n\u003cp\u003e“Jack took his girlfriend to a fancy restaurant in order to propose. He wanted to do it up big, you know. So he had the chef bake the engagement ring into a piece of chocolate cake.” He was smiling as he described the details of his brother’s attempt at romance. “The problem is that when Ginny ate the cake, she swallowed the diamond ring.” He slapped his knee now, overcome by mirth.\u003c/p\u003e\n\u003cp\u003e“Oh, let’s just get in the plane.”\u003c/p\u003e\n\u003cp\u003eBut Oliver seemed determined to finish his story. “I told him he was lucky Ginny didn’t choke to death on that diamond. They’ve been married for six years now and have two little rug rats, both as cute as can be.”\u003c/p\u003e\n\u003cp\u003eEmma was about to comment when a white van drove into the airfield. Boots started barking frantically. Emma bent over and picked up the dog in order to calm her. She’d welcome the opportunity to clean her up. Maybe she could sneak her into the apartment and do that later today.\u003c/p\u003e\n\u003cp\u003eThe van pulled up next to the plane. Emma read the lettering on the side of the vehicle and groaned. Animal Control.\u003c/p\u003e\n\u003cp\u003e“It’s the dogcatcher,” Oliver said out of the side of his mouth, in case she wasn’t smart enough to read it for herself.\u003c/p\u003e\n\u003cp\u003e“I can see that.”\u003c/p\u003e\n\u003cp\u003e“Afternoon, folks,” the tall thin man said as he climbed down from the van.\u003c/p\u003e\n\u003cp\u003eBoots growled and Oscar joined him in perfect harmony.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Officer Wilson,” Emma said formally, reading the nametag on his jacket.\u003c/p\u003e\n\u003cp\u003e“Do you know that dog?”\u003c/p\u003e\n\u003cp\u003e“Ah…we only just met.”\u003c/p\u003e\n\u003cp\u003e“Before you ask,” Oliver said, distracting Officer Wilson. “Oscar’s license is paid in full. He’s not a local but he’s legal.” He grinned, apparently at his own cleverness.\u003c/p\u003e\n\u003cp\u003e“I’m more concerned with the stray your lady friend’s holding.”\u003c/p\u003e\n\u003cp\u003e“I named her Boots.”\u003c/p\u003e\n\u003cp\u003eThe dogcatcher nodded in a friendly fashion; he seemed to approve of her choice of names. “Do you plan to adopt Boots officially?”\u003c/p\u003e\n\u003cp\u003e“Ah…” Emma didn’t know how to respond. She needed time to work something out. If Mr. Scott discovered she had a dog, he’d evict her from the apartment so fast her head would spin. She’d probably end up living at the office.\u003c/p\u003e\n\u003cp\u003e“It seems she’s taken a liking to you.” His expression grew somber. “You know, for some reason she’s been hanging around the airfield lately. That’s dangerous, for her and for the pilots.”\u003c/p\u003e\n\u003cp\u003eBoots growled again and squirmed as if begging for the opportunity to nip at the dogcatcher’s heels.\u003c/p\u003e\n\u003cp\u003e“This dog doesn’t have an owner,” Officer Wilson informed her, “and we’ve had complaints. That’s not good.”\u003c/p\u003e\n\u003cp\u003eEmma gathered Boots closer to her side.\u003c/p\u003e\n\u003cp\u003e“If I take her to Animal Control, I’m afraid she’ll be euthanized.”\u003c/p\u003e\n\u003cp\u003e“No!” Emma’s protest was immediate. She looked to Oliver for help, although she didn’t know what he could do.\u003c/p\u003e\n\u003cp\u003e“Emma wants to adopt Boots,” Oliver said. “It’s obvious those two have bonded. What are the fees?” Oliver pulled a wad of cash from his pocket.\u003c/p\u003e\n\u003cp\u003eOfficer Wilson frowned. “Adoption isn’t my department. But…” He gave Emma an assessing glance. “I’ll turn the other way if you want to take her with you.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Oliver said, steering Emma toward the plane.\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll take her,” Emma cried. She couldn’t bear the thought of Boots going to the shelter. She didn’t know how long the poor thing had fended for herself, but that was about to end. Somehow or other, she’d figure out a way to keep the dog hidden until she found an apartment that accepted pets.\u003c/p\u003e\n\u003cp\u003eThe dogcatcher pulled two dog biscuits from his pocket and offered one to Oscar and the second to Boots. “No hard feelings, girl, I was only doing my job.” He gently petted the small dog’s head. “Glad it worked out for you.”\u003c/p\u003e\n\u003cp\u003eAs if accepting Officer Wilson’s apology, Boots licked the man’s hand.\u003c/p\u003e\n\u003cp\u003e“You’ll see to buying Boots a license when you get home?” he reminded them.\u003c/p\u003e\n\u003cp\u003e“We will,” Oliver promised.\u003c/p\u003e\n\u003cp\u003eMr. Wilson seemed pleased and drove off with a “Merry Christmas” and a jolly wave.\u003c/p\u003e\n\u003cp\u003eSophie McKay’s Chocolate Fruitcake\u003c/p\u003e\n\u003cp\u003eMake 3-4 weeks in advance. Store in refrigerator.\u003c/p\u003e\n\u003cp\u003ePlace into large bowl:\u003c/p\u003e\n\u003cp\u003e2 cups maraschino cherries, sliced in half\u003c/p\u003e\n\u003cp\u003e2 cups chopped dates\u003c/p\u003e\n\u003cp\u003e2 cups pineapple tidbits, well drained\u003c/p\u003e\n\u003cp\u003e1 cup coconut\u003c/p\u003e\n\u003cp\u003e2 cups walnuts\u003c/p\u003e\n\u003cp\u003e2 cups pecan halves\u003c/p\u003e\n\u003cp\u003e2 12 oz. packages semisweet chocolate chips\u003c/p\u003e\n\u003cp\u003eBeat the following ingredients on low for thirty seconds, then on high for three minutes:\u003c/p\u003e\n\u003cp\u003e3 cups flour\u003c/p\u003e\n\u003cp\u003e1 ½ cups sugar\u003c/p\u003e\n\u003cp\u003e1 tbsp. baking powder\u003c/p\u003e\n\u003cp\u003e½ tsp. salt\u003c/p\u003e\n\u003cp\u003e¾ cup shortening\u003c/p\u003e\n\u003cp\u003e¾ cup butter\u003c/p\u003e\n\u003cp\u003e2/3 cup crème de cacao\u003c/p\u003e\n\u003cp\u003e½ cup cocoa powder\u003c/p\u003e\n\u003cp\u003e9 eggs\u003c/p\u003e\n\u003cp\u003ePour batter over fruit and nut mixture. Pour into two well-greased loaf pans. Bake at 275 degrees for 2 ½ to 3 hours. After two hours, check with a toothpick every fifteen minutes.\u003c/p\u003e\n\u003cp\u003eWhen cool, set each loaf on a large piece of plastic wrap and pour a jigger of crème de cacao over them. Wrap tightly and place inside a Ziploc bag and keep refrigerated for 3-4 weeks.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eIt was dark by the time Oliver and Emma landed back at the airstrip in Puyallup. They hadn’t talked much during the flight, which was unexpectedly turbulent. Emma had white-knuckled it, choosing to close her eyes and pray. She hadn’t prayed this much since grade school.\u003c/p\u003e\n\u003cp\u003eAs soon as they taxied to the end of the runway, Oliver parked the plane. Emma climbed out and reached for Boots, who came willingly into her arms. The poor dog trembled, and Emma realized it hadn’t been an easy flight for her, either.\u003c/p\u003e\n\u003cp\u003e“I’ll be in touch,” Oliver said after Emma had collected her things.\u003c/p\u003e\n\u003cp\u003eHer legs felt shaky and her stomach queasy, so she merely nodded, eager to get home. It was too late to return to the office; besides, she had more pressing concerns that had nothing to do with her job. Somehow, she had to find a way to smuggle Boots into her apartment. Even more of a challenge would be keeping the dog hidden until she located someplace else to live. Maybe Phoebe could help. Money was tight already, this close to payday, and she needed to make a veterinary appointment, plus obtain a license for Boots and buy a collar and leash. Groceries weren’t necessary, Emma decided; besides, she needed to lose a few pounds. Somehow she’d make it to the end of the month, despite the unexpected drain on her cash reserves. There were real advantages to avoiding Christmas, and this proved it.\u003c/p\u003e\n\u003cp\u003eOn the drive back to her apartment, Emma explained the tricky situation to Boots. She took her eyes from the road for just a second to smile at the little black dog. Boots gazed at her adoringly, but it would be ridiculous to assume the dog understood her dilemma and would voluntarily remain out of sight. And what about walks? She’d have to sneak Boots in and out for her walks. \u003c/p\u003e","sourceLink":"https://allnovel.net/glad-tidings/page-14.html","bookId":2631,"creation":"Oct 5, 2019 10:14:03 PM","modification":"Oct 5, 2019 10:14:03 PM"}
