{"id":102141,"no":18,"title":"Page 18","content":"\u003cp\u003e“Other plans? Like being with another man?”\u003c/p\u003e\n\u003cp\u003ePhoebe gave a careless shrug. “Never mind. It’ll do him good to wonder where I am.”\u003c/p\u003e\n\u003cp\u003e“I really do appreciate the help,” Emma said earnestly as they both walked out to the parking lot with loaded boxes.\u003c/p\u003e\n\u003cp\u003e“I know. You’d do the same for me,” Phoebe said again. “When’s the next fruitcake interview?” she asked, although Emma wasn’t sure why she’d changed the subject.\u003c/p\u003e\n\u003cp\u003e“Next week—Tuesday, I think.”\u003c/p\u003e\n\u003cp\u003eEmma didn’t welcome the reminder that Oliver was scheduled to fly her into Friday Harbor. She didn’t want to think about him—or the fact that she’d soon be in the air again.\u003c/p\u003e\n\u003cp\u003e“Are you ready to take these over to the new place?” Emma asked in an effort to derail her thoughts. She was eager to show off her apartment. An apartment she wouldn’t have if it wasn’t for Oliver, her conscience pointed out.\u003c/p\u003e\n\u003cp\u003e“Sure,” Phoebe said. “Let’s go.” But her enthusiasm seemed forced.\u003c/p\u003e\n\u003cp\u003eEmma hesitated. “Do you want to talk some more?” This disagreement with Walt had really depressed her friend.\u003c/p\u003e\n\u003cp\u003e“Not especially,” Phoebe murmured, revealing a little more life. “Let’s go,” she said again.\u003c/p\u003e\n\u003cp\u003eIt was nearly seven and completely dark out. The first thing Emma noticed when she pulled up in front of the complex on Cherry Street was that Oliver’s apartment lights were off; only his Christmas lights flashed a festive message. He was probably out on some hot date, she thought glumly. Despite her best efforts, her spirits sank. It shouldn’t matter where he was or with whom—and yet, it did.\u003c/p\u003e\n\u003cp\u003eShe stood by her car, fumbling for the door key, as Phoebe’s SUV drove up behind her. Carrying a couple of plants she’d transported on the front seat, she joined Emma. “What’s wrong, Em?”\u003c/p\u003e\n\u003cp\u003eEmma looked at her blankly.\u003c/p\u003e\n\u003cp\u003e“You just growled.”\u003c/p\u003e\n\u003cp\u003e“I did? I was thinking what a bother moving is,” she said, inventing an explanation that was also the truth.\u003c/p\u003e\n\u003cp\u003e“I’ll work as long as you want tonight.”\u003c/p\u003e\n\u003cp\u003eEmma nodded her thanks. She wanted out of the old place as quickly as possible. Because she didn’t own much, it hadn’t taken long to pack. Books, bedding and towels, clothes, kitchen stuff. Her TV and CD player. Odds and ends. Only a few pieces of furniture remained.\u003c/p\u003e\n\u003cp\u003eThey made two trips, with both her car and Phoebe’s loaded, rooftop and all. Back at the old apartment, they surveyed the things that still had to be moved.\u003c/p\u003e\n\u003cp\u003e“We should take the bed over tonight,” Phoebe suggested, hands on her hips as she stood in the almost-empty bedroom. “That way you’ll be able to sleep at the new place.”\u003c/p\u003e\n\u003cp\u003eThe idea appealed to Emma. “Are you sure you’re up to this?”\u003c/p\u003e\n\u003cp\u003ePhoebe nodded.\u003c/p\u003e\n\u003cp\u003eOliver’s lights were on when they arrived with the bed and nightstand. So he was home. Not that she cared.\u003c/p\u003e\n\u003cp\u003eThe mattress was the most difficult to handle. With Phoebe on one end and Emma on the other, they wrestled it out of the SUV.\u003c/p\u003e\n\u003cp\u003e“I’m starved,” Emma said as she paused to take a breath. She hadn’t eaten lunch; her only sustenance had come from a vending-machine pack of peanuts. “When we finish, I’m treating you to dinner. What time is it, anyway?”\u003c/p\u003e\n\u003cp\u003ePhoebe didn’t answer. When Emma looked around the protruding mattress, she saw why.\u003c/p\u003e\n\u003cp\u003eOliver’s apartment door was open, and Walt Berwald and Oliver stood just outside the doorway, watching them struggle.\u003c/p\u003e\n\u003cp\u003ePhoebe dropped her end of the mattress. “Walt,” she said in a choked voice.\u003c/p\u003e\n\u003cp\u003e“Oh, could you use some help?” Oliver asked coolly as he stepped forward.\u003c/p\u003e\n\u003cp\u003e“Phoebe?” Walt sounded nervous.\u003c/p\u003e\n\u003cp\u003eEven in the dark, Emma swore her friend’s cheeks blossomed brighter than the cherry trees across the street ever would. She looked directly at Walt and then—reluctantly—at Oliver. She realized she owed him an apology. Her ungracious and ungrateful behavior toward him had worried her all day, and she needed to make it right.\u003c/p\u003e\n\u003cp\u003e“I’ll take that,” he said, hurrying toward her end of the mattress.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she whispered, and moved aside so he could grab the mattress. “For everything.”\u003c/p\u003e\n\u003cp\u003eOliver nearly stumbled. He dropped his corner of the mattress. “What did you just say?”\u003c/p\u003e\n\u003cp\u003e“I, ah, was attempting to apologize.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought,” he said. “It felt good to hear that. Would you mind saying it again?”\u003c/p\u003e\n\u003cp\u003eEmma considered refusing, since he just wanted to rub it in. Oh, well, she supposed he deserved to hear her apology twice. Not that she intended to use the word sorry even once. She cleared her throat. “I wanted to thank you for all your help,” she said more loudly.\u003c/p\u003e\n\u003cp\u003eHe seemed gratified. Nodding his head, he said, “You’re welcome.” He lifted his end of the mattress again and grappled with it for a moment until he noticed that Walt hadn’t taken hold of the other side. He propped the mattress against the back of the vehicle.\u003c/p\u003e\n\u003cp\u003eEmma saw that Walt and Phoebe were staring at each other. He’d come to stand beside her, ignoring the mattress, Emma, everything.\u003c/p\u003e\n\u003cp\u003e“When you said you had ‘other plans,’ you let me think they were with someone else,” Walt murmured, frowning.\u003c/p\u003e\n\u003cp\u003e“It was what you deserved to think.”\u003c/p\u003e\n\u003cp\u003e“What’s going on with those two?” Oliver whispered, moving closer to Emma.\u003c/p\u003e\n\u003cp\u003e“They had a disagreement.”\u003c/p\u003e\n\u003cp\u003e“They’re seeing each other?” This seemed news to him. “They’re a couple?”\u003c/p\u003e\n\u003cp\u003eEmma nodded, watching her friend and their boss.\u003c/p\u003e\n\u003cp\u003e“I wasn’t joking, Walt.” Phoebe held her ground. She crossed her arms.\u003c/p\u003e\n\u003cp\u003eWalt exhaled and looked at Oliver. “Did I just hear you ask if Phoebe and I are a couple?”\u003c/p\u003e\n\u003cp\u003e“That’s your business, man.”\u003c/p\u003e\n\u003cp\u003e“No,” Walt countered, “I want you to know. I love Phoebe and she loves me.” He turned to face her. “There, does that satisfy you?”\u003c/p\u003e\n\u003cp\u003ePhoebe grinned. “It’s a start.”\u003c/p\u003e\n\u003cp\u003eWith that, Walt opened his arms and Phoebe walked into his embrace. A second later, they had their arms around each other and were locked in a passionate kiss.\u003c/p\u003e\n\u003cp\u003e“Hey, about this mattress?” Oliver whispered to Emma.\u003c/p\u003e\n\u003cp\u003e“Shh,” she whispered back. This was a scene normally reserved for the movies; all it lacked was a soundtrack. Emma didn’t think she’d seen anything more romantic in her life. “Isn’t this just so…so perfect?”\u003c/p\u003e\n\u003cp\u003e“What?” Oliver demanded, leaning against the mattress.\u003c/p\u003e\n\u003cp\u003eShe scowled up at him, then understood that he really didn’t get it.\u003c/p\u003e\n\u003cp\u003e“Hey, anyone interested in Chinese?” Oliver asked.\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eFruitcake—love it or hate it—is about the ritual of a family recipe. The longer the ritual is repeated, the more it becomes part of what is “done” at the holidays. With that in mind, there are only two fruitcakes that matter to me, and I eat them over the Christmas holidays every year. One is the recipe of my Grandma Prendergast, which my dad now makes at Christmas. It never turns out exactly the same as Grandma’s did, but it tastes good because it reminds me of her at the best time of year—when I’m with family. I eat it spread with butter, just the way Grandma served it. The other belongs to my mother-in-law, who labors over her version for weeks on end. In addition to the obvious fact that everyone should eat what their mother-in-law serves, hers are actually moist.\u003c/p\u003e\n\u003cp\u003e—Kevin Prendergast, executive chef,\u003c/p\u003e\n\u003cp\u003eNew York Marriott Marquis\u003c/p\u003e\n\u003cp\u003eBright and early the next Tuesday morning, Oliver pounded on Emma’s apartment door. When she didn’t immediately answer, he peered inside her front window. He saw her run into the living room and stare back. Smiling, he raised a small white bag and a large cup of coffee.\u003c/p\u003e\n\u003cp\u003eIf she needed any inducement to unlock her door, that was it. She was dying for a latte.\u003c/p\u003e\n\u003cp\u003e“You sweetheart,” she said, letting him into her apartment. Boots was at her feet, the ready protector. She’d been pronounced healthy and was scheduled to be spayed right after Christmas.\u003c/p\u003e\n\u003cp\u003eOliver smiled and handed her the take-out latte. “I have another surprise for you.”\u003c/p\u003e\n\u003cp\u003e“Another surprise?”\u003c/p\u003e\n\u003cp\u003e“More of a Christmas surprise.”\u003c/p\u003e\n\u003cp\u003e“All right.” Emma didn’t trust that gleam in his eyes, and adding Christmas wasn’t a bonus. “Tell me.”\u003c/p\u003e\n\u003cp\u003e“I got us a float plane for the trip to Friday Harbor.” He smiled again, as if this was something that should excite her.\u003c/p\u003e\n\u003cp\u003e“A float plane,” she repeated slowly. It’d been difficult enough to deal with an aircraft that landed on the ground. “As in a plane that lands on water?”\u003c/p\u003e\n\u003cp\u003e“Yup.” He positively glowed with the news. “You’ll love it.”\u003c/p\u003e\n\u003cp\u003eThe one small sip of latte she’d taken curdled in her stomach. “I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“Sure you do. We’re flying out of Lake Union. A friend of mine is letting me use his plane and—”\u003c/p\u003e\n\u003cp\u003eShe felt the sudden urge to sit down, but didn’t.\u003c/p\u003e\n\u003cp\u003e“Now, listen,” Oliver said, steering her into the kitchen and placing the white sack on the counter. It contained a large cranberry muffin, but Emma couldn’t eat, nauseated as she was by the thought of flying—and worse, landing—in a float plane. “Everything’ll be fine,” he said soothingly. “Just one thing.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You should wear sensible shoes because those docks can get slippery.”\u003c/p\u003e\n\u003cp\u003e“In other words, there’s a chance I could fall in the water?”\u003c/p\u003e\n\u003cp\u003e“It’s not likely, but it’s been known to happen, so be extra-cautious when you’re climbing into the plane, okay?”\u003c/p\u003e\n\u003cp\u003e“Is this a trick?”\u003c/p\u003e\n\u003cp\u003e“Of course not.” He marched out of the kitchen, and Emma followed. Boots hung behind, gazing eagerly at the white sack.\u003c/p\u003e\n\u003cp\u003e“You can bring Boots,” Oliver said before she could even ask.\u003c/p\u003e\n\u003cp\u003eEmma threw on her coat, scooped up Boots and grabbed her briefcase for this last interview, which would be in the San Juan Islands. Emma had spoken to Peggy Lucas by phone, and she sounded like a woman in her thirties, much younger than the other finalists. Emma was looking forward to chatting with her about her No-Bake Fruitcake recipe.\u003c/p\u003e\n\u003cp\u003eOliver opened the truck door for her and Boots, and Emma thanked him politely.\u003c/p\u003e\n\u003cp\u003e“It’s all part of being a romantic hero,” he reminded her with what she thought was a smirk.\u003c/p\u003e\n\u003cp\u003eBoth dogs were in the truck, and the cab was crowded. “If I slip off the dock, I’m going to blame you,” she said as she fastened the seat belt around her and Boots. Before they left, Emma had changed her shoes twice. In the end, she’d decided on tennis shoes with rubber soles, although they didn’t do much for her dark-gray pantsuit.\u003c/p\u003e\n\u003cp\u003e“Why would you blame me?” Oliver asked as they merged into the traffic on Interstate 5.\u003c/p\u003e\n\u003cp\u003eShe tapped her finger against her temple. “You’re the one who put the idea in my head.” He’d added a brand-new element to her fears, as if she needed more to worry about. \u003c/p\u003e","sourceLink":"https://allnovel.net/glad-tidings/page-18.html","bookId":2631,"creation":"Oct 5, 2019 10:14:03 PM","modification":"Oct 5, 2019 10:14:03 PM"}
