{"id":102142,"no":19,"title":"Page 19","content":"\u003cp\u003e“You can swim, right?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Actually, Emma was a capable swimmer. “Why do you ask?”\u003c/p\u003e\n\u003cp\u003e“Well, it’s only fair to let you know that if you go in the water you’re on your own.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “My hero.”\u003c/p\u003e\n\u003cp\u003e“My hero, nothing. The water this time of year is damn cold.”\u003c/p\u003e\n\u003cp\u003eEmma performed some contortions to look at the soles of her shoes once more, checking the treads.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, you’ll be fine.” His eyes sparkled with delight; Oliver Hamilton was enjoying himself far too much.\u003c/p\u003e\n\u003cp\u003eLake Union was situated between Puget Sound and Lake Washington, with canals that connected both. One of Emma’s favorite movies was Sleepless in Seattle, and she remembered that the houseboat the Tom Hanks character and his son had lived in was situated on Lake Union. She knew these houseboats were very expensive, and as Oliver drove closer, Emma saw a number of them in the distance. Cheerful, flashing Christmas lights strung around the decks were reflected on the still surface of the lake. One houseboat had Santa poised on the roof with a sleigh and eight reindeer. Everyone who lived on the lake was apparently serious about observing the holiday spirit. Just like all her new neighbors….\u003c/p\u003e\n\u003cp\u003eAs they continued on the road around the lake, the float planes came into view, and Emma immediately tensed. From her long-ago yoga classes, she knew the best cure for that was to draw in deep, even breaths. In to the count of eight, out to the—\u003c/p\u003e\n\u003cp\u003e“What’s with you?” Oliver asked.\u003c/p\u003e\n\u003cp\u003e“I’m practicing my breathing exercises.”\u003c/p\u003e\n\u003cp\u003e“I thought that was for when you’re in labor.”\u003c/p\u003e\n\u003cp\u003e“You’ve spent time in labor rooms, have you?”\u003c/p\u003e\n\u003cp\u003e“No, but my sister has, and she told me all about that breathing thing.”\u003c/p\u003e\n\u003cp\u003e“I’m just trying to remain calm.”\u003c/p\u003e\n\u003cp\u003e“Driving frightens you, too?”\u003c/p\u003e\n\u003cp\u003eEmma looked out the window. “Never mind.”\u003c/p\u003e\n\u003cp\u003eOnce they arrived at the dock where the float planes were tied up, it was immediately apparent that Oliver was well-known and well-liked. He introduced her to his friends and then led her out to the dock. Emma tested her footing with each step.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to fall from the middle of the dock,” Oliver said scathingly. Boots and Oscar ran circles around them both, barking and playing.\u003c/p\u003e\n\u003cp\u003e“Can’t be too careful.”\u003c/p\u003e\n\u003cp\u003eHe said something under his breath that she couldn’t understand, but considering the irritation lining his mouth and eyes, that was probably for the best. Taking slow, careful steps, it took her five minutes to get to the end of the dock. Oliver got there maybe three minutes earlier, and he didn’t conceal his impatience for one second of that time.\u003c/p\u003e\n\u003cp\u003eStepping onto the pontoon, he opened the door to the cockpit. Then he lifted Oscar and placed the terrier in the back. Next he swooped Boots into his arms and set her inside, as well. Emma stood there frozen, afraid to inch forward.\u003c/p\u003e\n\u003cp\u003e“Will you put my briefcase and purse in, too?” she asked, pushing them toward Oliver.\u003c/p\u003e\n\u003cp\u003eOliver did as she requested and then extended his arm, urging her forward. “You ready?” he asked. He was balancing one foot on the dock and the other on the pontoon.\u003c/p\u003e\n\u003cp\u003eShe nodded anxiously. Her heart was beating so fast she could hear the echo in her ears. Putting all her faith in Oliver, she stretched her arm toward his and stepped off the deck. She made the transition from dock to plane easily and was astonished that she’d allowed his warnings to fill her with dread.\u003c/p\u003e\n\u003cp\u003e“I did it!” she said, feeling triumphant.\u003c/p\u003e\n\u003cp\u003e“Yes, you did.” Oliver smiled. “I’m proud of you.”\u003c/p\u003e\n\u003cp\u003eEmma crawled into the passenger seat, pulled the seat belt toward her and locked it into place. Both Oscar and Boots were in the back, next to her purse and briefcase.\u003c/p\u003e\n\u003cp\u003eA boat went past and the wake rocked the plane. Standing on the dock, Oliver untied the craft and pushed off. Not a second later, Emma heard a tremendous splash. She didn’t immediately understand what had happened. Then it hit her.\u003c/p\u003e\n\u003cp\u003eOliver had slipped and fallen into the lake.\u003c/p\u003e\n\u003cp\u003eCaught in the boat’s wake, the plane drifted toward the middle of Lake Union.\u003c/p\u003e\n\u003cp\u003eScrambling out of her seat belt, Emma was on her knees in the pilot’s seat. “Oliver! Oliver! What should I do?”\u003c/p\u003e\n\u003cp\u003eIn response, he started swimming out after her. She covered her mouth. With part of her she wanted to laugh, and with the other she was holding back tears.\u003c/p\u003e\n\u003cp\u003eOliver reached the plane a moment later. He levered himself up onto the pontoon and glared at her. “Don’t you dare say a word,” he managed from between clenched teeth.\u003c/p\u003e\n\u003cp\u003e“But Oliver…”\u003c/p\u003e\n\u003cp\u003eHe stood on the pontoon, water streaming off him, and grabbed the plane’s wheel, steering the aircraft back toward the dock. A couple of pilots were waiting for him. Oliver tossed them the rope and they efficiently tied down the plane. One handed him a towel as he climbed onto the dock. There was a lot of good-natured teasing, but she noticed that Oliver didn’t have a whole lot to say.\u003c/p\u003e\n\u003cp\u003e“It happens to all of us at one time or another,” his friend consoled him.\u003c/p\u003e\n\u003cp\u003eOliver threw the towel over his shoulders, shivering visibly.\u003c/p\u003e\n\u003cp\u003eHis lips were blue.\u003c/p\u003e\n\u003cp\u003eEmma felt terrible.\u003c/p\u003e\n\u003cp\u003e“I’ve got an extra set of clothes,” she heard one of the other pilots tell him as they led him away.\u003c/p\u003e\n\u003cp\u003eShe stayed where she was, unwilling to risk climbing onto the dock again. Twenty minutes passed before Oliver reappeared. His mood didn’t seem to have improved.\u003c/p\u003e\n\u003cp\u003e“You okay?” she asked tentatively.\u003c/p\u003e\n\u003cp\u003e“I feel like a damn fool.”\u003c/p\u003e\n\u003cp\u003e“Oh, Oliver, you were wonderful.”\u003c/p\u003e\n\u003cp\u003eHer comment didn’t amuse him. “So you enjoyed that spectacle, did you?”\u003c/p\u003e\n\u003cp\u003e“Well, no, not really, but you swam after me. That was the most romantic thing you’ve done.”\u003c/p\u003e\n\u003cp\u003e“It was?” He sounded a bit puzzled.\u003c/p\u003e\n\u003cp\u003eShe nodded. “You truly are my hero.”\u003c/p\u003e\n\u003cp\u003e“I knew that,” he said confidently.\u003c/p\u003e\n\u003cp\u003e“Oh, for goodness’ sake.”\u003c/p\u003e\n\u003cp\u003eThey taxied farther onto Lake Union with only a minimum of fuss and took off.\u003c/p\u003e\n\u003cp\u003eUnexpectedly, Emma enjoyed the flight. She wasn’t nearly as afraid as she’d been in the Cessna Caravan. Thinking about it, she realized it was because of the pontoons—if the plane went down, they’d float. That might be false security, of course; if they did crash on the water the plane would probably disintegrate on impact, but she didn’t let that destroy her illusions of safety.\u003c/p\u003e\n\u003cp\u003eWhile flying, Oliver acted as a tour guide, showing her various points of interest. The San Juan Islands, she learned, were a cluster of 743 rocky islands of different sizes, situated in the Strait of Juan de Fuca and Puget Sound. Only about sixty of the islands were populated, according to Oliver, who seemed to know the area quite well.\u003c/p\u003e\n\u003cp\u003eThe largest of the islands, San Juan Island, was home to the bustling town of Friday Harbor. Emma remembered reading about the annual jazz festival in late summer. The island was also a popular site for whale watching. Emma hoped to join one of the expeditions next summer, since she’d never seen a whale in the wild. She didn’t think she could count visiting Sea World.\u003c/p\u003e\n\u003cp\u003e“I have a confession,” Oliver said, frowning. “I’m not as much of a hero as you seem to think.”\u003c/p\u003e\n\u003cp\u003e“You are. You swam out and saved me.”\u003c/p\u003e\n\u003cp\u003e“I hate to disillusion you, Emma, but I wasn’t swimming after you. I was going for the plane. Do you know how much one of these is worth?”\u003c/p\u003e\n\u003cp\u003e“In other words, if I’d been in a canoe you would’ve let me drift off into the sunset?”\u003c/p\u003e\n\u003cp\u003e“Well…”\u003c/p\u003e\n\u003cp\u003e“Come on,” she said, “be honest.”\u003c/p\u003e\n\u003cp\u003e“I would’ve taken a hot shower and changed clothes and then gone looking for you in a speedboat.”\u003c/p\u003e\n\u003cp\u003eOkay, so maybe he was right. He wasn’t as much of a hero as she’d assumed.\u003c/p\u003e\n\u003cp\u003eHe sneezed violently.\u003c/p\u003e\n\u003cp\u003e“You’re catching a cold. You should take care of yourself.”\u003c/p\u003e\n\u003cp\u003eHe dismissed her concern. “I’ll live.”\u003c/p\u003e\n\u003cp\u003e“You need hot soup and extra vitamin C and—”\u003c/p\u003e\n\u003cp\u003eHe placed his hand on her arm. “And a whole lot of lovin’.”\u003c/p\u003e\n\u003cp\u003eBoy, had she asked for that.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” he said with a smirk. “Go do your interview. I’ll be waiting here when you’re finished.”\u003c/p\u003e\n\u003cp\u003eEmma had been looking forward to this interview ever since she’d spoken to Peggy on Monday afternoon. Her sudden reluctance to leave Oliver was hard to explain.\u003c/p\u003e\n\u003cp\u003eHe climbed out, tied up the float plane and then helped her out. Clasping his hand, Emma leaped from the plane onto the dock, which rocked gently when she landed.\u003c/p\u003e\n\u003cp\u003eOliver retrieved her purse and briefcase and handed them to her.\u003c/p\u003e\n\u003cp\u003eOne of Peggy’s neighbors was waiting to drive her to the Lucas home.\u003c/p\u003e\n\u003cp\u003e“I won’t be gone long,” she promised.\u003c/p\u003e\n\u003cp\u003e“The dogs and I will be fine. Now go.” For the first time since he’d crashed into the water, Oliver grinned.\u003c/p\u003e\n\u003cp\u003eEmma couldn’t stop herself. Still holding tightly to her purse and briefcase, she kissed Oliver. He slid his arms around her and kissed her back. Soon they were so involved in each other, it was a wonder they both didn’t slip off the dock.\u003c/p\u003e\n\u003cp\u003eThat was when Emma knew she’d fallen in love with Oliver Hamilton.\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eThose who don’t like fruitcake have never had a white fruitcake.\u003c/p\u003e\n\u003cp\u003e—Nathalie Dupree,\u003c/p\u003e\n\u003cp\u003ecookbook author and television personality\u003c/p\u003e\n\u003cp\u003ePeggy Lucas’s matter-of-fact humor had Emma laughing even before she was in the front door of the fifties-style tract home in Friday Harbor. The neighbor, Sally, had dropped her off with a cheerful goodbye, after telling her repeatedly how proud everyone was of Peggy, how delicious her fruitcake was, how they were all convinced she’d win.\u003c/p\u003e\n\u003cp\u003ePeggy and her husband, Larry, had four small children. Children’s toys littered the lawn surrounding a bigger-than-life blow-up snowman that was anchored to the ground.\u003c/p\u003e\n\u003cp\u003eThe oldest child, Rosalie, was in first grade and the second daughter, Abby, was a year younger. Two little boys, Trevor and Dylan, rushed onto the small front porch to greet her, hiding behind their mother’s legs. Emma guessed the boys’ ages to be around four and two. The two younger ones seemed to be best buddies, although they were constantly bickering.\u003c/p\u003e\n\u003cp\u003e“Please excuse the mess,” Peggy said as she ushered Emma into the living room. A small Christmas tree stood in the corner, decorated with what appeared to be hand-crafted ornaments. It reminded Emma of the tree in the “Peanuts” cartoons, the Charlie Brown tree—a little skimpy and with a definite homemade quality. The children had made a chain of colored paper loops and strung popcorn and cranberries. A small array of badly wrapped gifts circled the base.\u003c/p\u003e\n\u003cp\u003ePeggy hurriedly removed clean laundry from the recliner and motioned for Emma to take what was clearly the best seat in the house.\u003c/p\u003e\n\u003cp\u003eEmma appeared to be the main attraction. All four children gathered around their mother and stared at the stranger in their living room. Rosalie was still dressed in her pajamas.\u003c/p\u003e\n\u003cp\u003e“She’s home from school today because of a cold,” Peggy explained. “Abby, too. This is cold and flu season. It’s the last week of classes, and I hate to have them miss out, but I can’t expose the entire class to their germs.” \u003c/p\u003e","sourceLink":"https://allnovel.net/glad-tidings/page-19.html","bookId":2631,"creation":"Oct 5, 2019 10:14:03 PM","modification":"Oct 5, 2019 10:14:03 PM"}
