{"id":35155,"no":74,"title":"SECTION 10.","content":"\u0026nbsp;Hal went on to question Keating about the apple-blossom girl. “Maybe I could guess who she is. What colour was her hair?” \n\u003cdiv\u003e\n “The colour of molasses taffy when you\u0027ve pulled it,” said Billy; “but all fluffy and wonderful, with star-dust in it. Her eyes were brown, and her cheeks pink and cream.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She had two rows of pearly white teeth, that flashed at you when she smiled?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She didn\u0027t smile, unfortunately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then her brown eyes gazed at you, wide open, full of wonder?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, they did—only it was into the drug-store window.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did she wear a white hat of soft straw, with a green and white flower garden on it, and an olive green veil, and maybe cream white ribbons?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By George, I believe you\u0027ve seen her!” exclaimed the reporter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe,” said Hal. “Or maybe I\u0027m describing the girl on the cover of one of the current magazines!” He smiled; but then, seeing the other\u0027s curiosity, “Seriously, I think I do know your young lady. If you announce that Miss Jessie Arthur is a member of the Harrigan party, you won\u0027t be taking a long chance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t afford to take any chance at all,” said the reporter. “You mean Robert Arthur\u0027s daughter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Heiress-apparent of the banking business of Arthur and Sons,” said Hal. “It happens I know her by sight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How\u0027s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I worked in a grocery-store where she used to come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whereabouts?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Peterson and Company, in Western City.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oho! And you used to sell her candy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stuffed dates.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And your little heart used to go pit-a-pat, so that you could hardly count the change?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gave her too much, several times!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you wondered if she was as good as she was beautiful! One day you were thrilled with hope, the next you were cynical and bitter—till at last you gave up in despair, and ran away to work in a coal-mine!”\n\u003c/div\u003e \n\u003cdiv\u003e\n They laughed, and MacKellar and Edstrom joined in. But suddenly Keating became serious again. “I ought to be away on that story!” he exclaimed. “I\u0027ve got to get something out of that crowd about the disaster. Think what copy it would make!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how can you do it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know; I only know I ought to be trying. I\u0027ll hang round the train, and maybe I can get one of the porters to talk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Interview with the Coal King\u0027s porter!” chuckled Hal. “How it feels to make up a multi-millionaire\u0027s bed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How it feels to sell stuffed dates to a banker\u0027s daughter!” countered the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n But suddenly it was Hal\u0027s turn to become serious. “Listen, Mr. Keating,” said he, “why not let me interview young Harrigan?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes! I\u0027m the proper person—one of his miners! I help to make his money for him, don\u0027t I? I\u0027m the one to tell him about North Valley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hal saw the reporter staring at him in sudden excitement; he continued: “I\u0027ve been to the District Attorney, the Justice of the Peace, the District Judge, the Mayor and the Chief of Police. Now, why shouldn\u0027t I go to the Owner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By thunder!” cried Billy. “I believe you\u0027d have the nerve!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe I would,” replied Hal, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The other scrambled out of his chair, wild with delight. “I dare you!” he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m ready,” said Hal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I mean it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that costume?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly. I\u0027m one of his miners.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it won\u0027t go,” cried the reporter. “You\u0027ll stand no chance to get near him unless you\u0027re well dressed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you sure of that? What I\u0027ve got on might be the garb of a railroad-hand. Suppose there was something out of order in one of the cars—the plumbing, for example?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you couldn\u0027t fool the conductor or the porter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might be able to. Let\u0027s try it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a pause, while Keating thought. “The truth is,” he said, “it doesn\u0027t matter whether you succeed or not—it\u0027s a story if you even make the attempt. The Coal King\u0027s son appealed to by one of his serfs! The hard heart of Plutocracy rejects the cry of Labour!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Hal, “but I really mean to get to him. Do you suppose he\u0027s got back to the train yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were starting to it when I left.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where is the train?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two or three hundred yards east of the station, I was told.”\n\u003c/div\u003e \n\u003cdiv\u003e\n MacKellar and Edstrom had been listening enthralled to this exciting conversation. “That ought to be just back of my house,” said the former.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a short train—four parlour-cars and a baggage-car,” added Keating. “It ought to be easy to recognise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old Scotchman put in an objection. “The difficulty may be to get out of this house. I don\u0027t believe they mean to let you get away to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By Jove, that\u0027s so!” exclaimed Keating. “We\u0027re talking too much—let\u0027s get busy. Are they watching the back door, do you suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They\u0027ve been watching it all day,” said MacKellar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen,” broke in Hal—“I\u0027ve an idea. They haven\u0027t tried to interfere with your going out, have they, Mr. Keating?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, not yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor with you, Mr. MacKellar?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, not yet,” said the Scotchman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” Hal suggested, “suppose you lend me your crutches?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereat Keating gave an exclamation of delight. “The very thing!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll take your over-coat and hat,” Hal added. “I\u0027ve watched you get about, and I think I can give an imitation. As for Mr. Keating, he\u0027s not easy to mistake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Billy, the fat boy!” laughed the other. “Come, let\u0027s get on the job!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll go out by the front door at the same time,” put in Edstrom, his old voice trembling with excitement. “Maybe that\u0027ll help to throw them off the track.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3236/88608.html","bookId":681,"creation":"Aug 5, 2019 6:12:55 AM","modification":"Aug 5, 2019 6:12:55 AM"}
