{"id":17758,"no":16,"title":"Chapter 17","content":"\u0026nbsp;It happens that I was brought up in a highly conscientious family. To my dear mother, and to her worthy sisters, there is nothing in the world more painful than what they call a “scene”—unless possibly it is what they call a “situation.” And here we had certainly had a “scene,” and still had a “situation.” So I sat, racking my brains to think of something safe to talk about. I recalled that T-S had had pretty good success with his “Tale of Two Cities” as a topic of conversation, so I began: \n\u003cdiv\u003e\n “Mr. Carpenter, the spectacle you are going to see this evening is rather remarkable from the artistic point of view. One of the greatest scenic artists of Paris has designed the set, and the best judges consider it a real achievement, a landmark in moving picture work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me about it,” said Carpenter; and I was grateful for his tone of interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don\u0027t know how much you know about picture making—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better explain everything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mr. T-S has built a large set, representing a street scene in Paris over a century ago. He has hired a thousand men—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two tousand!” broke in T-S.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In the advertisements?” I suggested, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no,” insisted the other. “Two tousand, really. In de advertisements, five tousand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said I, “these men wear costumes which T-S has had made for them, and they pretend to be a mob. They have been practicing all day, and by now they know what to do. There is a man with a megaphone, shouting orders to them, and enormous lights playing upon them, so that men with cameras can take pictures of the scene. It is very vivid, and as a portrayal of history, is truly educational.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when it is done—what becomes of the men?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Utterly hopeless, you see! We were right back on the forbidden ground! “How do you mean?” I evaded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean, how do they live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dey got deir five dollars, ain\u0027t dey?” It was T-S, of course.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but that won\u0027 last very long, will it? What is the cost of this dinner we are eating?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The magnate of the movies looked to the speaker, and then burst into a laugh. “Ho, ho, ho! Dat\u0027s a good vun!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Said I, hastily: “Mr. T-S means that there are cheaper eating places to be found.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Carpenter, “why don\u0027t we find one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s no use, Billy. He thinks it\u0027s up to me to feed all de bums on de lot. Is dat it, Mr. Carpenter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t say, Mr. T-S; I don\u0027t know how many there are, and I don\u0027t know how rich you are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vell, dey got five million out o\u0027 verks in this country now, and if I vanted to bust myself, I could feed \u0027em vun day, maybe two. But ven I got done, dey vouldn\u0027t be nobody to make pictures, and somebody vould have to feed old Abey—or maybe me and Maw could go back to carryin\u0027 pants in a push cart! If you tink I vouldn\u0027t like to see all de hungry fed, you got me wrong, Mr. Carpenter; but vot I learned is dis—if you stop fer all de misery you see in de vorld about you, you vouldn\u0027t git novhere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Carpenter, “what difference would that make?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The proprietor of Eternal City really wanted to make out the processes of this abnormal mind. He wrinkled his brows, and thought very hard over it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “See here, Mr. Carpenter,” he began at last, “I tink you got hold o\u0027 de wrong feller. I\u0027m a verkin\u0027 man, de same as any mechanic on my lot. I verked ever since I vas a liddle boy, and if I eat too much now, maybe it\u0027s because I didn\u0027t get enough ven I vas liddle. And maybe I got more money dan vot I got a right to, but I know dis—I ain\u0027t never had enough to do half vot I vant to! But dere\u0027s plenty fellers got ten times vot I got, and never done a stroke o\u0027 vork fer it. Dey\u0027re de vuns y\u0027oughter git after!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Said Carpenter: “I would, if I knew how.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dey\u0027s plenty of \u0027em right in dis room, I bet.” And Mary added: “Ask Billy; he knows them all!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You flatter me, Mary,” I laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ain\u0027t dey some of \u0027em here?” demanded T-S.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that\u0027s true. There are some not far away, who are developing a desire to meet Mr. Carpenter, unless I miss the signs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vere are dey at?” demanded T-S.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won\u0027t tell you that,” I laughed, “because you\u0027d turn and stare into their faces.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he vould!” broke in Maw. “How often I gotta tell you, Abey? You got no more manners dan if you vas a jimpanzy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said the magnate, grinning good naturedly. “I\u0027ll keep a-eatin\u0027 my dinner. Who is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s Mrs. Parmelee Stebbins,” said I. “She boasts a salon, and has to have what are called lions, and she\u0027s been watching Mr. Carpenter out of the corner of her eye ever since he came into the room—trying to figure out whether he\u0027s a lion, or only an actor. If his skin were a bit dark, she would be sure he was an Eastern potentate; as it, she\u0027s afraid he\u0027s of domestic origin, in which case he\u0027s vulgar. The company he keeps is against him; but still—Mrs. Stebbins has had my eye three times, hoping I would give her a signal, I haven\u0027t given it, so she\u0027s about to leave.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vell, she can go to hell!” said T-S, keeping his promise to devote himself to his dinner. “I offered Parmelee Stebbins a tird share in \u0027De Pride o\u0027 Passion\u0027 fer a hunded tousand dollars, and de damn fool turned me down, and de picture has made a million and a quarter a\u0027ready.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said I, “he\u0027s probably paying for it by sitting up late to buy the city council on this new franchise grab of his; and so he hasn\u0027t kept his date to dine with his expensive family at Prince\u0027s. Here is Miss Lucinda Stebbins; she\u0027s engaged to Babcock, millionaire sport and man about town, but he\u0027s taking part in a flying race over the Rocky Mountains tonight, and so Lucinda feels bored, and she knows the vaudeville show is going to be tiresome, but still she doesn\u0027t want to meet any freaks. She has just said to her mother that she can\u0027t see why a person in her mother\u0027s position can\u0027t be content to meet proper people, but always has to be getting herself into the newspapers with some new sort of nut.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My Gawd, Billy!” cried Maw. “You got a dictaphone on dem people?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I know the type so well, I can tell by their looks. Lucinda is thinking about their big new palace on Grand Avenue, and she regards everyone outside her set as a burglar trying to break in. And then there\u0027s Bertie Stebbins, who\u0027s thinking about a new style of collar he saw advertised to-day, and how it would look on him, and what impression it would make on his newest girl.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Mary who spoke now: “I know that little toad. I\u0027ve seen him dancing at the Palace with Dorothy Doodles, or whatever her name is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said I, “Mrs. Stebbins runs the newer set—those who hunt sensations, and make a splurge in the papers. It costs like smoke, of course—” And suddenly I stopped. “Look out!” I whispered. “Here she comes!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3227/88121.html","bookId":699,"creation":"Aug 2, 2019 8:59:47 AM","modification":"Aug 2, 2019 8:59:47 AM"}
