{"id":17791,"no":49,"title":"Chapter 49","content":"\u0026nbsp;Comrade Abell told us where the police-court was located, and we agreed to be there at nine o\u0027clock next morning. Then I parted from the rest, and walked until I met a taxi and drove to my rooms. \n\u003cdiv\u003e\n I felt desolate and forlorn. Nothing in my old life had any interest for me. This was the afternoon when I usually went to the Athletic Club to box; but now I found myself wondering, what would Carpenter say to such imitation fighting? I decided I would stay by myself for a while, and take a walk and think things over. I had been dissatisfied with my life for a long time; the glamor had begun to wear off the excitement of youth, and I had begun to suspect that my life was idle and vain. Now I knew that it was: and also I knew that the world was a place of torment and woe.\n\u003c/div\u003e \n\u003cdiv\u003e\n I returned late in the afternoon, and a few minutes afterwards my telephone rang, and I discovered that somebody else was dissatisfied with life.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hello, Billy,” said the voice of T-S. “I see dat feller Carpenter is in jail. Vy don\u0027t you bail him out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He won\u0027t let me,” I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vell, maybe it might be a good ting to leave him in jail a veek, till dis Brigade convention gits over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Funny!” said I. “I had the same idea!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen,” continued the other, “I been feelin\u0027 awful bad because I told dem fellers I didn\u0027t know him. D\u0027 you suppose he knows I said dat, Billy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said I, “he knew you were going to say it, so probably he knows you said it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vell,” said T-S, “maybe you laugh at me, but I been tinkin\u0027 I tell dem fellows to go to hell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What fellows?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “De whole damn vorld! Billy, I like dat feller Carpenter! I never met a feller like him before. You tink he vould let me go to see him in de jail?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m sure he\u0027d be glad to see you,” I said; “if the jailers didn\u0027t object.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure, I fix de jailers all right!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But T-S,” I added, “I don\u0027t believe he\u0027ll sign any contract.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Contract nuttin\u0027,” said T-S. “I shoost vant to see him, Billy. Is dere anyting I could do fer him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n I thought for a moment; then I said: “You might do something for one of his friends, and that\u0027s young Everett. He got pretty badly hurt, and he\u0027s sticking at the job of taking down all Carpenter\u0027s speeches. He ought to have a surgeon, and also a first class stenographer to take turns with him. Have you got another man like him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dunno,” said T-S. “You don\u0027t find a young feller like Matt Everett everyday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n I started. “What do you say is his name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Matthew,” said T-S. “Vy you ask?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing,” said I; “just a coincidence!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Our conversation ended with the remark by T-S that he would call up the station-house and arrange to see Carpenter. Five minutes later the telephone rang again, and I heard the magnate\u0027s voice: “Billy, dey say he\u0027s been bailed out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What?” I cried. “He declared he wouldn\u0027t have it done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody done it vitout askin\u0027 him! De money vas paid, and dey turned him out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who did it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Guess!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean it was you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I vouldn\u0027t \u0027a dared. I only shoost found out about it. Mary Magna done it, and she\u0027s took him avay somevere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good Lord!” I exclaimed; and before my mind\u0027s eye flashed another headline:\n\u003c/div\u003e \n\u003cdiv\u003e\n FAIR FILM STAR FREES LOVE-CULT PROPHET\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I promised to try to find out about the prophet at once. “He won\u0027t get away,” I said, “because he doesn\u0027t ride in automobiles, and he and Mary can\u0027t walk very far on the street without the newspapers finding them!”\n\u003c/div\u003e \n\u003cdiv\u003e\n I took my telephone-book, and looked up the name Abell. It is an unusual name, and there was only one attorney bearing it. (I was struck by the fact that the first name of this attorney was Mark.) I called him on the phone, and heard the familiar gentle voice. Yes, Comrade Carpenter had just arrived, and Miss Magna was with him. They were going to have a little party, and they would be glad to have me come. Yes, Mr. T-S would be welcome, of course. So then I called up the magnate of the pictures, and not without an inward smile, conferred on him the gracious permission to spend the evening at the headquarters of Local Western City of the Socialist Party!\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3227/88154.html","bookId":699,"creation":"Aug 2, 2019 9:01:13 AM","modification":"Aug 2, 2019 9:01:13 AM"}
