{"id":17795,"no":53,"title":"Chapter 53","content":"\u0026nbsp;Now, you may find it hard to believe a confession which I have put off making—the fact that at this time I was engaged to be married. There was a certain member of what is called the “younger set,” whom I had given reason to expect that I would think about her at least once in a while. But here for precisely three days I had been chasing about at the skirts of a prophet fresh from God, getting my name into the newspapers in scandalous fashion, and not daring even to call the young lady on the telephone and make apologies. That evening there was a dinner-dance at her home, and I supposed I was supposed to be there; but no one had bothered to invite me, and as a matter of fact I would not have known of the affair if I had not seen the announcement in the papers. I was too late for the dinner, but I got myself a taxicab, and drove to my room and changed my clothes, and hurried in my own car to the dance. \n\u003cdiv\u003e\n You would not be interested in the fact that when I arrived I was treated as an unwelcome guest, and Miss Betty even went so far as to remind me that I had not been invited. But after I had pleaded, she consented to dance with me; and so for an hour or two I tried to forget there were any people in the world who had anything to do but be happy. Just as I was succeeding, the butler came, calling me to the telephone, and I answered, and who should it be but Old Joe!\n\u003c/div\u003e \n\u003cdiv\u003e\n My surprise became consternation at his first words: “Billy, your friend Carpenter is in peril!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are going to get him tonight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good God! How do you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a long story, and no time to tell it. Somebody\u0027s tipped me off. Where can I meet you? Every minute is precious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you?” I asked, and learned that he was at his home, not far away. I said I would come there, and I hurried to Betty and had another scene with her, and left her weeping, vowing that she would never see me again. I ran out and jumped into my car—and I would hate to tell what I did to the speed laws of Western City. Suffice it to say that a few minutes later I was in Old Joe\u0027s den, and he was telling me his story.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3227/88158.html","bookId":699,"creation":"Aug 2, 2019 9:01:24 AM","modification":"Aug 2, 2019 9:01:24 AM"}
