{"id":17748,"no":6,"title":"Chapter 7","content":"\u0026nbsp;“Hello, Billy! Who\u0027s your good-looking friend?” Rosythe was in full sail before a breeze of his own making. \n\u003cdiv\u003e\n How could I answer. “Why—er—”\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger spoke. “They call me Carpenter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” said the critic. “Mr. Carpenter, delighted to meet you.” He gave the stranger a hearty grip of the hand. “Are you on location?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Location?” said the other; and Rosythe shot an arrow of laughter towards me. Perhaps he knew about the vagaries of my Aunt Caroline; anyhow, he would have a fantastic tale to tell about me, and was going to exploit it to the limit!\n\u003c/div\u003e \n\u003cdiv\u003e\n I made a pitiful attempt to protect my dignity. “Mr. Carpenter has just arrived,” I began\u0026amp;\u0026amp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just arrived, hey?” said the critic. “Oviparous, viviparous, or oviviparous?” He raised his hand; actually, in the glory of his wit, he was going to clap the stranger on the shoulder!\n\u003c/div\u003e \n\u003cdiv\u003e\n But his hand stayed in the air. Such a look as came on Carpenter\u0027s face! “Hush!” he commanded. “Be silent!” And then: “Any man will join in laughter; but who will join in disease?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hey?” said Rosythe; and it was my turn to grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Carpenter has just done me a great service,” I explained. “I got badly mauled in the mob—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” cried the other. “At the Excelsior Theatre!” Here was something to talk about, to cover his bewilderment. “So you were in it! I was watching them just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they still at it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure thing!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A fine set of boobs,” I began—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boobs, nothing!” broke in the other. “What do you suppose they\u0027re doing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Saving us from Hun propaganda, so they told me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The hell of a lot they care about Hun propaganda! They are earning five dollars a head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure as you\u0027re born!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You really know that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Know it? Pete Dailey was at a meeting of the Motion Picture Directors\u0027 Association last night, and it was arranged to put up the money and hire them. They\u0027re a lot of studio bums, doing a real mob scene on a real location!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I\u0027ll be damned!” I said. “And what about the police?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Police?” laughed the critic. “Would you expect the police to work free when the soldiers are paid? Why, Jesus Christ——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I beg pardon?” said Carpenter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why—er—” said Rosythe; and stopped, completely bluffed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought not swear,” I remarked, gravely; and then, “I must explain. I got pounded by that mob; I was knocked quite silly, and this gentleman found me, and healed me in a wonderful way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” said the critic, with genuine interest. “Mind cure, hey? What line?”\n\u003c/div\u003e \n\u003cdiv\u003e\n I was about to reply, but Carpenter, it appeared, was able to take care of himself. “The line of love,” he answered, gently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “See here, Rosythe,” I broke in, “I can\u0027t stand on the street. I\u0027m beginning to feel seedy again. I think I\u0027ll have a taxi.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said the critic. “Come with me. I\u0027m on the way to pick up the missus. Right around the corner—a fine place to rest.” And without further ado he took me by the arm and led me along. He was a good-hearted chap inside; his rowdyisms were just the weapons of his profession. We went into an office building, and entered an elevator. I did not know the building, or the offices we came to. Rosythe pushed open a door, and I saw before me a spacious parlor, with birds of paradise of the female sex lounging in upholstered chairs. I was led to a vast plush sofa, and sank into it with a sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger stood beside me, and put his hand on my head once more. It was truly a miracle, how the whirling and roaring ceased, and peace came back to me; it must have shown in my face, for the moving picture critic of the Western City “Times” stood watching me with a quizzical smile playing over his face. I could read his thoughts, as well as if he had uttered them: “Regular Svengali stuff, by God!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3227/88111.html","bookId":699,"creation":"Aug 2, 2019 8:59:16 AM","modification":"Aug 2, 2019 8:59:16 AM"}
