{"id":89471,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe smiled. “Tease.”\u003c/p\u003e\n\u003cp\u003e“I’m sitting right here, kids.”\u003c/p\u003e\n\u003cp\u003e“Sorry, Dad,” David replied. “But you’re not exactly lily white on this one.”\u003c/p\u003e\n\u003cp\u003e“I gotta take shit from a punk like you?”\u003c/p\u003e\n\u003cp\u003e“I know!” Nicky said, squeezing his muffin so hard it imploded in a spray of crumbs and blueberries. “The day Dad dies, Nicole can abdicate! Then everything will go back to the way it was.”\u003c/p\u003e\n\u003cp\u003e“I’m sitting right here.”\u003c/p\u003e\n\u003cp\u003e“My mother didn’t raise me to shirk my responsibilities,” Nicole said quietly, and that was the end of that.\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003e“H i!” a cheerful redhead about ten years older than Nicole said. “I’m Holly Bragon, rhymes with dragon. I’m the king’s official biographer.”\u003c/p\u003e\n\u003cp\u003e“Hi.” Nicole shook hands with the woman.\u003c/p\u003e\n\u003cp\u003e“I don’t suppose you’re in the mood to talk about your mother.”\u003c/p\u003e\n\u003cp\u003e“Not hardly.”\u003c/p\u003e\n\u003cp\u003e“Or how all this feels right now?”\u003c/p\u003e\n\u003cp\u003e“Nuh-uh.”\u003c/p\u003e\n\u003cp\u003e“Or what it’s like to go from a commoner to first in line for the throne, set to inherit one of the world’s largest fortunes?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“I figured.” The redhead looked around the suite of rooms. “Is this gonna be yours, then?”\u003c/p\u003e\n\u003cp\u003e“Guess so.”\u003c/p\u003e\n\u003cp\u003e“A taciturn girl, I like that. The others can be a bit of a handful.”\u003c/p\u003e\n\u003cp\u003e“Not me. I’m a pussycat.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and I’m an amoeba.”\u003c/p\u003e\n\u003cp\u003eHolly pushed past Nicole—a relief from bowing and “Your Highness” this and “Your Highness” that. Nicole pegged her accent as deep South United States, Texas or Georgia or someplace like that.\u003c/p\u003e\n\u003cp\u003eHolly peered out the five-foot-high windows. “Hmmm. It looks like we’re three stories up, but the south pavilion roof is right down there, ain’t it? And from there it’s not much of a drop for a tall girl like you.”\u003c/p\u003e\n\u003cp\u003eNicole raised her eyebrows. Holly “rhymes with dragon” was a quick one. “Really? I hadn’t noticed.”\u003c/p\u003e\n\u003cp\u003e“My big ole Texan butt you hadn’t.” She slapped herself on the flank. “Ain’t it great?”\u003c/p\u003e\n\u003cp\u003e“Uh…it’s very nice.”\u003c/p\u003e\n\u003cp\u003e“But if I had to make that drop, I’d mess up my fabulous underwear. Heights give me the creeps. But not you, I bet.”\u003c/p\u003e\n\u003cp\u003e“I once followed a bear over a cliff.”\u003c/p\u003e\n\u003cp\u003e“I’m making a memo to me to follow up with you on that story. But why?”\u003c/p\u003e\n\u003cp\u003e“Well, I shot him but didn’t kill him, so I was morally obligated to—”\u003c/p\u003e\n\u003cp\u003e“No, no. Why this suite, why the setup so you can slip off the grounds? You’re not a prisoner, like Rapunzel in her tower.”\u003c/p\u003e\n\u003cp\u003e“I like to come and go as I like. Do you have any idea how long it takes just to arrange to go into town for, I dunno, a cup of coffee?”\u003c/p\u003e\n\u003cp\u003e“I got an idea.”\u003c/p\u003e\n\u003cp\u003e“First you gotta tell Edmund. Then he tells your security detail. Then they waste tons of time getting organized. Then, an hour or two later, finally, you can leave. Except you’re not alone, of course. And with all the bodyguards and royal cars and all, everybody stares. And you can’t pay for anything; the store owner comes out and practically genuflects. Then, finally, you come back to the gilded cage.”\u003c/p\u003e\n\u003cp\u003e“Prob’ly easier to stay in and have someone bring you a cuppa joe.”\u003c/p\u003e\n\u003cp\u003e“That’s not the point. The point is, I used to be able to come and go as I please, and now I can’t.” She resisted the urge to kick something. “Rapunzel’s got nothing on me.”\u003c/p\u003e\n\u003cp\u003e“Poor baby,” the Dragon yawned. “How do you find the strength to go on?”\u003c/p\u003e\n\u003cp\u003e“Now you’re just messing with me.”\u003c/p\u003e\n\u003cp\u003eThe Dragon turned and beamed at her. “It’s what I do, darlin’. Excuse me: Princess Darlin’. So if you don’t mind my asking, what’s next for you?”\u003c/p\u003e\n\u003cp\u003e“Princess lessons, I guess. Maybe smashing champagne bottles on a few cruise ships.”\u003c/p\u003e\n\u003cp\u003e“Well, there’s worse royal families to end up in, you ask me.”\u003c/p\u003e\n\u003cp\u003e“That’s hard to imagine.”\u003c/p\u003e\n\u003cp\u003e“Ha! Honey, I’m a history major and a writer. Know what that makes me? The biggest snoop you ever met.”\u003c/p\u003e\n\u003cp\u003e“With a wonderful ass.”\u003c/p\u003e\n\u003cp\u003e“Well, yeah. And historically speaking, most princesses were ugly and dumb from all the inbreeding.”\u003c/p\u003e\n\u003cp\u003e“What a lovely thought,” she said, appalled.\u003c/p\u003e\n\u003cp\u003e“History ain’t lovely, honey. At least in this country, they don’t much care if you marry one a’ the hoi polloi.”\u003c/p\u003e\n\u003cp\u003e“I have noticed they’re all ridiculously good looking,” she admitted. “Guess it pays not to keep marrying your cousin.”\u003c/p\u003e\n\u003cp\u003e“Check your mirror sometime, honey, speaking of ridiculous.”\u003c/p\u003e\n\u003cp\u003e“Well, biggest snoop I ever met, expert on the royal family, I have to admit I’m curious about something.”\u003c/p\u003e\n\u003cp\u003e“Shoot, darlin’.”\u003c/p\u003e\n\u003cp\u003e“What’s your theory about Prince Nicky’s parentage?”\u003c/p\u003e\n\u003cp\u003eHolly snapped her notebook shut and gave Nicole a look over her bifocals. “That’s generally considered the rudest question you can ask in these here parts. You want to get along with your new family, I wouldn’t bring it up. Ever.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the advice.”\u003c/p\u003e\n\u003cp\u003eThe sunny smile returned. “All part of the service, darlin’.”\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003eJ effrey had spent the last two hours guarding Nicole’s closed bedroom door, then went to stroll the grounds on a break. And like a lovesick school boy, he was standing on the lawn beneath Nicole’s suite, staring up at the windows.\u003c/p\u003e\n\u003cp\u003eGet it together, man.\u003c/p\u003e\n\u003cp\u003eHe’d had flings before. He’d even been in love before. But no one had ever made him feel like this. Hot and cold and urgent and lusty and protective and angry and happy all at once or one right after the other.\u003c/p\u003e\n\u003cp\u003eIt was…disconcerting.\u003c/p\u003e\n\u003cp\u003eHe doubted Nicole had a clue. He prayed she didn’t have a clue. It was too embarrassing, almost a cliché; he was not in a Whitney Houston movie, for the love of God. And he outweighed Kevin Costner by forty pounds.\u003c/p\u003e\n\u003cp\u003eWhile he watched the window, he thought about the kiss. Thought about her scent—she smelled like the outdoors, fresh and cottony—and her sweetly yielding mouth. Thought about how he almost took her on the floor of her living room like a—like a—\u003c/p\u003e\n\u003cp\u003eHe tried to shake it off. Never had he been so easily distracted while on duty; it was shameful. He was doing her no good if all he could think about was how she looked without her—\u003c/p\u003e\n\u003cp\u003eNow what the hell was this?\u003c/p\u003e\n\u003cp\u003eThe darkened window was silently swinging open and he grabbed for his gun out of pure ingrained training. Which would have been fine if someone was going in.\u003c/p\u003e\n\u003cp\u003eInstead, a lithe figure in dark clothes climbed out, hung from her hands by the sill, and dropped almost noiselessly to the roof of the pavilion. Swung over again, hung until her legs only dangled about four-and-a-half feet above the ground, and dropped yet again. Then stood, looked around, and walked away without the slightest trace of a limp.\u003c/p\u003e\n\u003cp\u003eHe holstered his gun and nearly fell to his knees, his relief was so great. The twit could have broken every bone in her body! Talk about your personal and professional disasters. He could imagine the conversation: “My king, the first night I was in charge of Princess Nicole’s detail, she broke both her legs. Very sorry.”\u003c/p\u003e\n\u003cp\u003eHe stepped out of the shadows to intercept her. “Going somewhere, Your Highness?”\u003c/p\u003e\n\u003cp\u003e“Gaaaaah! Jeez! Don’t do that!”\u003c/p\u003e\n\u003cp\u003e“So very sorry, Your Highness.”\u003c/p\u003e\n\u003cp\u003e“Jeffrey, you bum, were you watching my window?”\u003c/p\u003e\n\u003cp\u003e“Of course. You didn’t think we just hung around in doorways, did you?”\u003c/p\u003e\n\u003cp\u003eHands on her hips, she advanced on him. He wondered how heavily armed she was. “I just want to take a walk, get it? And I don’t want to bring the whole damn circus along, either.”\u003c/p\u003e\n\u003cp\u003e“How about just me, Your Highness?”\u003c/p\u003e\n\u003cp\u003eShe chewed on her lip, which made him want to chew on her lip, and finally said, “Well, I s’pose. Let’s hit the bricks.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Highness.”\u003c/p\u003e\n\u003cp\u003e“Like you wouldn’t rat me out if I didn’t let you tag along.”\u003c/p\u003e\n\u003cp\u003e“So astute, Your Highness.”\u003c/p\u003e\n\u003cp\u003e“And that’s another thing. I saw you yesterday. On your break.” They were walking across the vast lawn, staying out of the pools of brightness cast by the floodlights. “Doing the New York Times crossword.”\u003c/p\u003e\n\u003cp\u003eShe saw him? Well, that seemed fair, as he was acutely aware whenever she was within twenty yards of him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“In ink.”\u003c/p\u003e\n\u003cp\u003e“I was all out of chisels.”\u003c/p\u003e\n\u003cp\u003e“But I’ve seen footmen treat you like your knuckles drag on the ground when you walk.”\u003c/p\u003e\n\u003cp\u003e“I know. Isn’t it splendid?”\u003c/p\u003e\n\u003cp\u003eShe stared at him, then laughed. “Ah. Ah-ha! I get it. Me big dumb bodyguard, me easily tricked, come into my web said the spider to the fly.”\u003c/p\u003e\n\u003cp\u003e“Or words to that effect,” he agreed, hands in his pockets so he wouldn’t grab her for another kiss. “Let them think what they like. Let them assume a man my size is slow and/or stupid. I like it when they can’t see me coming.”\u003c/p\u003e\n\u003cp\u003e“Now that’s a philosophy I can get behind,” she said approvingly, and he grinned in the dark. “So where’d you learn to fish?”\u003c/p\u003e\n\u003cp\u003e“My dad, when he wasn’t guarding the late king and queen. His dad before him. How about you?”\u003c/p\u003e\n\u003cp\u003e“I found guides and they taught me. I’ve spent more of my life in Los Angeles than Alaska, but I was always…I don’t know…pulled?”\u003c/p\u003e\n\u003cp\u003e“Pulled,” he agreed. It was as fine a word for duty as any. Duty to country, or to self.\u003c/p\u003e\n\u003cp\u003e“I always wanted trees and rivers and green. I feel like there’s a plan when I’m in the forest instead of all this—this”—she gestured vaguely and he wondered if she realized she was pointing at the palace—“chaos.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-mess-alaskan-royal-family-3/page-10.html","bookId":2791,"creation":"Oct 5, 2019 5:36:22 PM","modification":"Oct 5, 2019 5:36:22 PM"}
