{"id":89474,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You thought you’d give this tin-shit operation some much-needed publicity. Never mind that you sold me down the river at the same time.”\u003c/p\u003e\n\u003cp\u003e“But they all—I mean, the royal family all knew you were—”\u003c/p\u003e\n\u003cp\u003e“Yes, but they couldn’t prove it unless their own doctor did the test. Something I was managing to avoid very neatly, by the way. Until you wrecked any chance I had of a normal life.” She was leaning over his desk now, and he was cringing back in his chair. Since he had seen her shoot, this was a wise move. “So I figure the least you deserve is a wrecked door and the penalty of my displeasure.”\u003c/p\u003e\n\u003cp\u003eJeffrey whispered in her ear. She smiled. Her former boss went, if possible, whiter. “The penalty of our displeasure. That’s the royal ‘our,’ by the way.”\u003c/p\u003e\n\u003cp\u003e“Nic—Your Highness, give me a break. Except for the occasional Sandra Dee, we’re struggling to stay out of the red. Now I’ve got bookings through the end of next year!”\u003c/p\u003e\n\u003cp\u003e“And all you had to do,” she said sweetly, “was sell us down the river.” Hmm. She could get used to the “royal we” thing. “Well, enjoy your success, Mike. You’ve earned it. By the way, don’t be surprised if you’re audited every month until the end of time.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t.”\u003c/p\u003e\n\u003cp\u003e“Hello, have we met? Jeffrey, we’re out of here.”\u003c/p\u003e\n\u003cp\u003e“Hey, you were never exactly Employee of the Month!” Freeborg yelled back. “With that mouth?”\u003c/p\u003e\n\u003cp\u003e“Feel better?” Jeffrey murmured, tapping his earpiece.\u003c/p\u003e\n\u003cp\u003e“Loads,” she said, and smiled at him.\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eB ack in the car, Jeffrey tapped his earpiece again. “Rodinov and Hunter en route to the palace.” He listened, then tapped it again.\u003c/p\u003e\n\u003cp\u003eNicole figured it was a two-way communication piece, kind of like the ones they used in the old Star Trek: The Next Generation episodes. Tap to open broadcast, tap to close. Neat.\u003c/p\u003e\n\u003cp\u003e“Hunter, huh?”\u003c/p\u003e\n\u003cp\u003e“That’s your call sign.”\u003c/p\u003e\n\u003cp\u003e“Why not just use my name?”\u003c/p\u003e\n\u003cp\u003e“Because then the bad guys will know who we’re talking about.”\u003c/p\u003e\n\u003cp\u003eShe mused in the passenger seat. She had flatly refused to ride in the back like an invalid. “What’s the king’s call sign?”\u003c/p\u003e\n\u003cp\u003e“Warrior.”\u003c/p\u003e\n\u003cp\u003e“Alexander’s?”\u003c/p\u003e\n\u003cp\u003e“Poet.”\u003c/p\u003e\n\u003cp\u003ePoet? Weird. “Alexandria’s?”\u003c/p\u003e\n\u003cp\u003e“Sleepwalker.”\u003c/p\u003e\n\u003cp\u003eWeirder and weirder. “David’s?”\u003c/p\u003e\n\u003cp\u003e“Mini-Me.”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s good. Christina’s?”\u003c/p\u003e\n\u003cp\u003e“Cookie.”\u003c/p\u003e\n\u003cp\u003e“Kathryn’s?”\u003c/p\u003e\n\u003cp\u003e“Mime.”\u003c/p\u003e\n\u003cp\u003eWhat the blue hell? Those were some pretty fucked up call signs. “Nicholas?”\u003c/p\u003e\n\u003cp\u003e“Rebel.”\u003c/p\u003e\n\u003cp\u003e“Well, all you have to do is read People to figure that one out.” She was forgetting someone, she just knew—ah! Alexandria had married an American two years ago, but he was currently out of the country. In fact, Alex herself was leaving tomorrow to be with him, according to the schedule.\u003c/p\u003e\n\u003cp\u003eYeah, the schedule. She got one of her very own, first thing in the morning, along with all the major newspapers. Every little thing any of the family had to do was spelled out in excruciatingly dull detail. Every morning. With hourly updates.\u003c/p\u003e\n\u003cp\u003e“So!” she said brightly. “Given any thought to our little chat last night?”\u003c/p\u003e\n\u003cp\u003e“You mean the chat and the piggyback ride that almost got me fired?”\u003c/p\u003e\n\u003cp\u003e“Nobody’s firing you without my say-so. Wait a minute. If I fire you, will you sleep with me?”\u003c/p\u003e\n\u003cp\u003e“Do you hear yourself?”\u003c/p\u003e\n\u003cp\u003e“All too well. Never mind, that’d mean you could sue me for sexual harassment. I’d hate to inadvertently bring a lawsuit against the royal family my first week in residence.”\u003c/p\u003e\n\u003cp\u003e“You’ve never done anything inadvertently.”\u003c/p\u003e\n\u003cp\u003e“Well, thank you. Neither have they.”\u003c/p\u003e\n\u003cp\u003e“The royal family. Them. They.”\u003c/p\u003e\n\u003cp\u003e“What? Did you skip breakfast? Blood sugar a little low?”\u003c/p\u003e\n\u003cp\u003e“Your royal family. Us. We.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, give me time. Anyway, quit trying to change the subject. Have you thought about our chat or haven’t you?”\u003c/p\u003e\n\u003cp\u003eJeffrey, who usually drove like a robot, actually took his gaze off the road and looked at her. “It’s all I’ve thought about. I didn’t sleep a wink last night.”\u003c/p\u003e\n\u003cp\u003e“Really? That’s odd. I slept great.” And she had, because she hadn’t slept a wink the night before. “So? What’s it going to be?”\u003c/p\u003e\n\u003cp\u003e“Ni—Your Highness, there’s a car behind us with two more bodyguards in it. You want me to just—to just pull over and do you?”\u003c/p\u003e\n\u003cp\u003e“In a perfect world,” she admitted, “yes.”\u003c/p\u003e\n\u003cp\u003e“In a perfect world…”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Never mind.”\u003c/p\u003e\n\u003cp\u003e“Come on, spit it out.”\u003c/p\u003e\n\u003cp\u003e“In a perfect world you wouldn’t be a princess and I wouldn’t be your subject,” he said in a rush of words.\u003c/p\u003e\n\u003cp\u003e“Jeez, take a breath or you’re gonna pass out at the wheel.”\u003c/p\u003e\n\u003cp\u003eHe did as she asked, he took a deep breath and tightened his grip on the wheel. She was surprised the wheel didn’t creak from the pressure.\u003c/p\u003e\n\u003cp\u003e“And for the record,” she added, “I agree one hundred percent. But we’re not in a perfect world. If we were, my mom would be alive and French fries would help you lose weight.”\u003c/p\u003e\n\u003cp\u003eHe barked a laugh.\u003c/p\u003e\n\u003cp\u003e“But we’re not. And she isn’t. And they don’t. So what’s the plan?”\u003c/p\u003e\n\u003cp\u003e“The plan is, I drive you back to the Sitka Palace, Princess, and then you do as you will.”\u003c/p\u003e\n\u003cp\u003e“Like that, is it?”\u003c/p\u003e\n\u003cp\u003e“Yes, it’s like that.”\u003c/p\u003e\n\u003cp\u003e“Too bad. I get the feeling we would have been pretty good between the sheets.”\u003c/p\u003e\n\u003cp\u003e“I, too,” he said quietly, and wouldn’t speak to her for the rest of the drive.\u003c/p\u003e\n\u003cp\u003eChapter 30\u003c/p\u003e\n\u003cp\u003e“Y ou sure you’re ready for this, kiddo?”\u003c/p\u003e\n\u003cp\u003e“Sure, Al.”\u003c/p\u003e\n\u003cp\u003e“Because we can put it off for a few more days. It’s no problem.”\u003c/p\u003e\n\u003cp\u003e“It’s a huge problem; they’re already waiting for us.”\u003c/p\u003e\n\u003cp\u003eThe king snorted. He was actually dressed up in a tailored navy blue suit, sky blue shirt, and red-and-blue-striped tie. “Believe me, they’ll come back.”\u003c/p\u003e\n\u003cp\u003e“Dad, she wants to do it,” David said, equally dressed to the nines. “Let her do it.”\u003c/p\u003e\n\u003cp\u003e“It’s fine, Al.” “Al” was as close as Nicole could come. She had dropped the “king” but couldn’t bring herself to call him Dad, or even Father. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eThey were in a spacious salon, and sun streamed through the Eastern windows. The king was there, she was there, and David was there. And their bodyguards were there, of course. Also the redhead who, wonderfully, seemed to irritate the piss out of Al.\u003c/p\u003e\n\u003cp\u003eThe other royals had other duties or had gotten out of this one.\u003c/p\u003e\n\u003cp\u003eNicole also was dressed in a suit; her closet had mysteriously filled overnight with clothes that fit perfectly. She was dressed in black, with a white blouse and her mother’s gold earrings.\u003c/p\u003e\n\u003cp\u003eThe Alaskan Olympic Ski Team marched in, fresh from two silvers and a gold at the Winter Olympics in Gstaad. Nicole, David, and Al were supposed to pat them on the back, have a nice lunch, and in general tell them they were the pride of Alaska.\u003c/p\u003e\n\u003cp\u003eWhich, to be fair, they were.\u003c/p\u003e\n\u003cp\u003eNicole sighed and prepared to be bored.\u003c/p\u003e\n\u003cp\u003eShe wasn’t bored. Not at all. Because the Olympian on her left—Yanos somebody—and the one across the table from her—Thomas somebody—were both excellent flirts with truly marvelous physiques.\u003c/p\u003e\n\u003cp\u003eThey were full of charming questions about her status as the bastard princess (The papers had given her the nickname, and it had stuck…and she didn’t mind. It was better than just princess.) and what she had been up to and how she was coping.\u003c/p\u003e\n\u003cp\u003e“Truly remarkable,” Thomas somebody was saying. “And how are you adjusting to life at the palace?”\u003c/p\u003e\n\u003cp\u003e“Oh, you know. Good days and bad. Hey, don’t hog the last roll.”\u003c/p\u003e\n\u003cp\u003e“As my princess commands,” Thomas teased, and tossed it to her.\u003c/p\u003e\n\u003cp\u003e“Very funny, Skier Boi. So what do you guys do when you’re not shushing down mountains?”\u003c/p\u003e\n\u003cp\u003e“Beguile beautiful women,” Yannos teased.\u003c/p\u003e\n\u003cp\u003e“And beg for their favors,” Thomas added.\u003c/p\u003e\n\u003cp\u003e“Beg for their favors? What century do you live in?”\u003c/p\u003e\n\u003cp\u003e“Any century where you are, Highness.”\u003c/p\u003e\n\u003cp\u003e“Really?” Hmm. She was eating with two men who were literally the best in the world at what they did, who had the bodies of gods and, one hoped, appetites to match. “I don’t suppose one of you guys would be open to a royal command, huh?”\u003c/p\u003e\n\u003cp\u003e“We would be open to anything Your Highness wishes.”\u003c/p\u003e\n\u003cp\u003e“Some things more than others,” Thomas asked, giving her a wicked grin.\u003c/p\u003e\n\u003cp\u003eNow this she could get used to. “Oh! In that case, I—shit! I dropped one of my eight forks.”\u003c/p\u003e\n\u003cp\u003e“Here, Princess, you can use mine to—”\u003c/p\u003e\n\u003cp\u003e“Code twenty-nine!” Jeffrey bellowed. Then he yanked Thomas’s chair away from the table, yanked Thomas out of said chair, and tossed him four feet through the air. The skier hit the wooden floor with a spectacular slam.\u003c/p\u003e\n\u003cp\u003eNicole saw that the other royals had been hauled away from the table and their guards were standing protectively in front of them.\u003c/p\u003e\n\u003cp\u003e“What the hell?” the king roared, spraying soup.\u003c/p\u003e\n\u003cp\u003e“He was trying to stab the princess,” Jeffrey replied stonily.\u003c/p\u003e\n\u003cp\u003eNicole was on her feet. She didn’t remember pushing her chair back or standing. “He was lending me his fork.”\u003c/p\u003e\n\u003cp\u003eSix more bodyguards came out of nowhere and they were all pointing their guns at Thomas, who was lying on his back like a stunned beetle.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” David asked sharply, peeking around his bodyguard. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-mess-alaskan-royal-family-3/page-13.html","bookId":2791,"creation":"Oct 5, 2019 5:36:22 PM","modification":"Oct 5, 2019 5:36:22 PM"}
