{"id":89475,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe raised her voice. “He was lending me his fork. Of course I’m all right!”\u003c/p\u003e\n\u003cp\u003e“Weapons check?” somebody said.\u003c/p\u003e\n\u003cp\u003e“Clear.”\u003c/p\u003e\n\u003cp\u003e“Perimeter?”\u003c/p\u003e\n\u003cp\u003e“Clear.”\u003c/p\u003e\n\u003cp\u003e“Code canceled. Comply?”\u003c/p\u003e\n\u003cp\u003e“Complied.”\u003c/p\u003e\n\u003cp\u003e“Are you well, Highness?” Jeffrey had the nerve to ask, holstering his weapon.\u003c/p\u003e\n\u003cp\u003e“You big bag of—come with me!”\u003c/p\u003e\n\u003cp\u003e“Princess—”\u003c/p\u003e\n\u003cp\u003e“Right now!”\u003c/p\u003e\n\u003cp\u003e“Wait a minute,” the king started, but by then she was out of the dining hall.\u003c/p\u003e\n\u003cp\u003eJeffrey followed her into the next room, which Nicole saw was a hallway.\u003c/p\u003e\n\u003cp\u003e“You prick! You did that because he was flirting with me.”\u003c/p\u003e\n\u003cp\u003e“And trying to stab you.”\u003c/p\u003e\n\u003cp\u003eShe nearly choked on the urge to punch him in his smug face. “He was not trying to stab me and you know it! You saw us getting cozy, and for whatever weird reason, you didn’t like it.”\u003c/p\u003e\n\u003cp\u003eHe frowned at her. “Weird reason?”\u003c/p\u003e\n\u003cp\u003e“You’ve made it clear you don’t want the job, so now…what? You’re gonna immobilize any decent prospect that comes along?”\u003c/p\u003e\n\u003cp\u003eHe folded his arms across his massive chest and didn’t reply.\u003c/p\u003e\n\u003cp\u003e“Answer me, Jeffrey.”\u003c/p\u003e\n\u003cp\u003e“They’re waiting for you at the luncheon. And I need to get back to reassess the threat.”\u003c/p\u003e\n\u003cp\u003e“You’re impossible. Try that again and I’ll shoot you with your own gun. Now get lost!”\u003c/p\u003e\n\u003cp\u003e“Princess, I’m currently on duty and—”\u003c/p\u003e\n\u003cp\u003e“Am I being unclear? Slurring my words? I want you out of my face. Go away. Run away. What the fuck ever. Just get in the wind, buddy boy, and you can consider that a royal command.”\u003c/p\u003e\n\u003cp\u003eShe ignored the stricken look on his face. She was completely immune to it. It didn’t make her feel bad at all. Nope. Not one bit.\u003c/p\u003e\n\u003cp\u003eFuming and heart sore, she went back to the luncheon just in time to hear the king scream, “Well, somebody better tell me what the hell is going on!”\u003c/p\u003e\n\u003cp\u003e“Shut up, Al. Eat your soup.”\u003c/p\u003e\n\u003cp\u003eHe pointed his spoon at her, then seemed to think better of it and didn’t say anything.\u003c/p\u003e\n\u003cp\u003eThe rest of the conversation was strained, to say the least.\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003eJ effrey knocked on the door he had leaned against thousands of times.\u003c/p\u003e\n\u003cp\u003e“Come!”\u003c/p\u003e\n\u003cp\u003eHe opened it but stayed on the threshold. “You wished to see me, my king?”\u003c/p\u003e\n\u003cp\u003e“Yeah, come on in, Jeff.”\u003c/p\u003e\n\u003cp\u003eJeffrey walked into the office. “Majesty?”\u003c/p\u003e\n\u003cp\u003e“Have a seat, Jeff.”\u003c/p\u003e\n\u003cp\u003eFor the first time in his career, Jeffrey took the seat opposite the king. “How may I assist you, my king?”\u003c/p\u003e\n\u003cp\u003e“You can settle down and unclench. Want a drink? Something to eat?”\u003c/p\u003e\n\u003cp\u003e“No, sir.”\u003c/p\u003e\n\u003cp\u003e“How about a vacation?”\u003c/p\u003e\n\u003cp\u003e“No, sir!”\u003c/p\u003e\n\u003cp\u003e“Calm down, you’re so tense you’re making me nervous. Granted, your last vacation wasn’t much fun—”\u003c/p\u003e\n\u003cp\u003e“You nearly died. By the time the border patrol eased up enough for me to get back into the country, it was all over.”\u003c/p\u003e\n\u003cp\u003e“—but your last vacation was also four years ago. I think, after what happened at lunch, that you’re a little overdue.”\u003c/p\u003e\n\u003cp\u003e“Does the king require my resignation?” he asked stiffly.\u003c/p\u003e\n\u003cp\u003e“Shit, no!” The king looked honestly stressed, and even worried. Jeffrey had often wished someone would try something on his watch, just so he could have the pleasure of taking a bullet for Alexander Baranov II. And he always felt guilty when he had such thoughts. “I’m just worried about you, Jeff. Nicole popping up out of the woodwork has been stressful for all of us—”\u003c/p\u003e\n\u003cp\u003eMy king, you have no idea.\u003c/p\u003e\n\u003cp\u003e“—everybody’s on edge and—”\u003c/p\u003e\n\u003cp\u003eShe talked to me like she hated me.\u003c/p\u003e\n\u003cp\u003e“—stressful, sure, and—”\u003c/p\u003e\n\u003cp\u003eHated me.\u003c/p\u003e\n\u003cp\u003e“—a handful, but she’s had to adjust to a lot—”\u003c/p\u003e\n\u003cp\u003eI couldn’t bear it if she felt the way she sounded.\u003c/p\u003e\n\u003cp\u003e“Okay?”\u003c/p\u003e\n\u003cp\u003e“Of course, my king.”\u003c/p\u003e\n\u003cp\u003e“Okay.” King Alexander beamed. “So it’s settled. Effective tomorrow, you’re on vacation for the rest of the week.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Okay, okay, take two weeks. See what a softy I am?”\u003c/p\u003e\n\u003cp\u003eHe cursed himself for not paying more attention. Then he realized: the king was right. He couldn’t even focus on orders from the sovereign. What good was he to Nicole in this state?\u003c/p\u003e\n\u003cp\u003e“That, ah, that won’t be necessary, sir. I’ll see you Monday morning.”\u003c/p\u003e\n\u003cp\u003e“Take ’er easy, Jeff. Oh, and Jeff! Where’s the Dragon right now?”\u003c/p\u003e\n\u003cp\u003eHe consulted his Palm Pilot. “Third floor, north wing. I would guess she’s taking more pictures of the family portraits.”\u003c/p\u003e\n\u003cp\u003e“Great. That’s fine. Thousand of feet away. Okay. Thanks. Enjoy your time off. You’ve earned it.”\u003c/p\u003e\n\u003cp\u003eThen why did it feel more like a punishment than a reward?\u003c/p\u003e\n\u003cp\u003eChapter 32\u003c/p\u003e\n\u003cp\u003eC hristina Baranov, once Crown Princess of Alaska, now just plain Princess, came at once to answer her daughter’s cries.\u003c/p\u003e\n\u003cp\u003eShe cursed Dara’s grandfather for letting the almost-four-year-old watch Lord of the Rings. This was the third night in a row Dara had dreamed of catapulting severed heads. She soothed her daughter, named for a dead queen, David’s mother. And soon enough, the child drifted back to sleep.\u003c/p\u003e\n\u003cp\u003eDavid hadn’t come to help her. And when David was home, he always came when Dara cried.\u003c/p\u003e\n\u003cp\u003eChristina was hot tempered, but a good wife who loved her husband beyond all reason, and she said nothing to David when she returned to their bedroom.\u003c/p\u003e\n\u003cp\u003e“She okay?” David said, not looking away from the television. That in itself was super weird; David never watched television. He never had time. If he wasn’t tending the penguins or speaking at an aquarium or studying law or history, he had almost as much paperwork to juggle as Al, or Edmund.\u003c/p\u003e\n\u003cp\u003eNot anymore.\u003c/p\u003e\n\u003cp\u003e“Another nightmare about flying severed heads. Remind me to kick your dad’s butt up to his shoulder blades tomorrow.”\u003c/p\u003e\n\u003cp\u003eDavid smiled, clicking rapidly through the channels. “You know he can’t refuse her anything.”\u003c/p\u003e\n\u003cp\u003e“He’s spoiling her rotten and giving her nightmares. The worst of both worlds.”\u003c/p\u003e\n\u003cp\u003e“Don’t bug Dad. He’s got enough on his mind. Especially after that balls-up of a luncheon.”\u003c/p\u003e\n\u003cp\u003eShockeroo number eighty-seven, and it had already been a helluva week. David didn’t normally talk crude; he left it to her.\u003c/p\u003e\n\u003cp\u003eShe sat on the edge of the bed, trying for noncommittal. “Yeah, I heard Jeffrey had kind of an overreaction. But all those guys are wound so tight I can’t believe it hasn’t happened before.”\u003c/p\u003e\n\u003cp\u003e“Mmm.”\u003c/p\u003e\n\u003cp\u003e“So how’d it go? Nicole’s first official thingamabob?”\u003c/p\u003e\n\u003cp\u003e“Before or after our gold medalist nearly got concussed?”\u003c/p\u003e\n\u003cp\u003e“Right. So. Uh. What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” Click click click click click. “At all.”\u003c/p\u003e\n\u003cp\u003e“Yeah, uh, we haven’t really talked about this.”\u003c/p\u003e\n\u003cp\u003e“Talked about what?”\u003c/p\u003e\n\u003cp\u003e“How you’re suddenly out of the job you’ve been training for since you were in diapers.”\u003c/p\u003e\n\u003cp\u003eAt last, at last he looked at her. “There’s nothing to discuss. It’s just as much my duty to step aside for the true heir as it was my duty to learn how to—to run things after Dad. You know.”\u003c/p\u003e\n\u003cp\u003eShe threw up her hands. “Duty! If I hear that word again this week I’ll puke! Fuck duty, how do you feel?”\u003c/p\u003e\n\u003cp\u003e“Fine.” Click. Click. Click.\u003c/p\u003e\n\u003cp\u003eShe jerked the remote out of his hand, shut off the television, and tossed the remote across the room.\u003c/p\u003e\n\u003cp\u003e“Oh,” her husband observed, “now that’s mature.”\u003c/p\u003e\n\u003cp\u003e“David! Stop being such a damn guy and talk to me! Tell me you’re pissed, tell me you’re sad, tell me you’re thrilled to be off the hook. I don’t give a shit, just speak.”\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003e“Speak!”\u003c/p\u003e\n\u003cp\u003e“Arf.”\u003c/p\u003e\n\u003cp\u003e“I hate you,” she muttered, getting up from the bed, but he rolled across the mattress, grabbed her arm, and pulled her back down.\u003c/p\u003e\n\u003cp\u003e“You worship the very ground I walk on and we both know it.”\u003c/p\u003e\n\u003cp\u003e“Don’t press your luck.”\u003c/p\u003e\n\u003cp\u003e“Chris, I can’t tell you how I feel because I don’t know how I feel. I really don’t. I’m just—” He groped for words, seemingly at a loss. Or perhaps actually at a loss.\u003c/p\u003e\n\u003cp\u003e“Well, I don’t really care if I’m ever queen. You know that. You always knew that.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“But you’ve got to have feelings about not being the king.”\u003c/p\u003e\n\u003cp\u003e“I do have feelings.” He paused. “I just have no idea what they are.”\u003c/p\u003e\n\u003cp\u003eShe understood. She had spent her time as a royal dreading Al’s death, dreading the crown. And now that she never had to worry about it again, she wasn’t sure if she was relieved or out of sorts. And if she, who’d only been in the royal family a little over four years, didn’t know, how could David possibly know?\u003c/p\u003e\n\u003cp\u003e“You want something? An omelet?” Their suite was the only one equipped with a kitchen; Christina had been a cook in her old life. “Coddled eggs?”\u003c/p\u003e\n\u003cp\u003e“I’m sick of eggs. I’d rather have you.”\u003c/p\u003e\n\u003cp\u003e“Oooooh,” she said, letting him drag her across the bed and into his lap. “Now if only you had the remote back, you’d be the happiest guy in the country.”\u003c/p\u003e\n\u003cp\u003eChapter 33\u003c/p\u003e\n\u003cp\u003e“U h, hello.” Nicole blinked at the stranger standing opposite her door. “Who are you?”\u003c/p\u003e\n\u003cp\u003e“Natalia Burdenov, Your Highness. I’m new to your detail, effective 0800 today.”\u003c/p\u003e\n\u003cp\u003eNicole blinked harder. Yesterday had been a disaster—the botched luncheon, her screaming at Jeffrey—complete and total nightmare. She’d spent the rest of the day hiding in a library she’d found. No one had disturbed her, and she’d worked her way through four Hardy Boys books. She had declined to eat with the royal family and had hit the sheets early after someone sent up a sandwich and decaf. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-mess-alaskan-royal-family-3/page-14.html","bookId":2791,"creation":"Oct 5, 2019 5:36:22 PM","modification":"Oct 5, 2019 5:36:22 PM"}
