{"id":89469,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe awful thing was, the Dragon did look glorious. About fifteen years younger than him, she was a fine-looking, brown-eyed redhead with the lush figure of a fifties pinup girl. None of that anorexia chic for the Dragon.\u003c/p\u003e\n\u003cp\u003eThe only concession to her age were her purple-rimmed bifocals. Her tailored suit was the same shade. When she crossed her legs, he observed that she had not given up the odd habit of wearing tennis shoes with designer suits.\u003c/p\u003e\n\u003cp\u003e“You look like a Goddamned eggplant in that thing.”\u003c/p\u003e\n\u003cp\u003e“Oh, Big Al, every word out of your mouth is pure honeycomb.” Hun-ahh-cooom.\u003c/p\u003e\n\u003cp\u003e“And you sound like pure cornpone. When are you going to ditch that awful accent?”\u003c/p\u003e\n\u003cp\u003e“Big Al, I’m gonna give your funeral service in my cornpone accent, and every fellow Texan is gonna cheer me on.” Give yer fun’rul sur-vuss. Gone cheer me awn.\u003c/p\u003e\n\u003cp\u003eHe slumped back in his chair and massaged his temples. “God, I think my ears are actually bleeding.”\u003c/p\u003e\n\u003cp\u003e“It’s that high-cholesterol lifestyle you lead, big guy. So tell me about the new girl. Word on the wires is, she’s a bit older than Davey.”\u003c/p\u003e\n\u003cp\u003e“Prince David.”\u003c/p\u003e\n\u003cp\u003e“O’course, Big Al.”\u003c/p\u003e\n\u003cp\u003e“That’s King Al!” Fucking Americans. Too casual by far. Right now, he could stand a little awe.\u003c/p\u003e\n\u003cp\u003e“Whatever you say, Big Al.” She crossed her legs and even the whisper of her pantyhose rubbing together got on his nerves. “Anyhoo, that puts her in line for your job after you fall overboard and drown on one a’your clandestine fishin’ trips that don’t fool no one no how. Right?”\u003c/p\u003e\n\u003cp\u003e“Are you speaking English? At all?”\u003c/p\u003e\n\u003cp\u003e“Ah can speak anuhthin.” She occasionally tortured him by deepening her already annoying Texan accent, and could keep it up for hours.\u003c/p\u003e\n\u003cp\u003eShe had been fired nine times.\u003c/p\u003e\n\u003cp\u003eShe had been escorted out by Jeffrey seventeen times.\u003c/p\u003e\n\u003cp\u003eShe had reduced him to shouting at her so many times he lost count after her second visit. But like roaches and disco, she kept coming back.\u003c/p\u003e\n\u003cp\u003eAnd far, far worst of all? The Dragon was his official biographer. She had a doctorate in Alaskan history, gotten published at age nineteen, and written four books on the history of Alaska.\u003c/p\u003e\n\u003cp\u003eAnd as usual, the royal family had chosen a foreigner for the job of chronicling the current monarch’s life. Subjects tended to be a little too overawed to ask the tough questions.\u003c/p\u003e\n\u003cp\u003e“So? It’s true, raht?”\u003c/p\u003e\n\u003cp\u003eHe rubbed his eyes. “Yes, it’s true. I had a—a relationship before I married the queen. Forget it, not tellin’.”\u003c/p\u003e\n\u003cp\u003e“Aw, Big Al, an’ here I was on the edge of my seat waiting to hear about your naked shenanigans.”\u003c/p\u003e\n\u003cp\u003e“Shenanigans? Did you just curse me in Texan? Never mind. Point is, yeah, I wasn’t exactly a virgin on my wedding night.” Then again, neither was my bride. “And Nicole Krenski Baranov was the result.”\u003c/p\u003e\n\u003cp\u003eThe Dragon didn’t write any of that down in her ever-present notebook. “Why, Big Al, I’ve never known you to go out on a limb. I hear the DNA ain’t been confirmed.”\u003c/p\u003e\n\u003cp\u003e“Hasn’t been confirmed, you illiterate twit!”\u003c/p\u003e\n\u003cp\u003e“Thay-ets Daktuh Illiterate Twee-it, Big Al,” she corrected him sweetly.\u003c/p\u003e\n\u003cp\u003e“Okay, okay, stop it, you’re killing me. You hear me? After I fired you the fourth time my doctor said my blood pressure was ten points higher than normal! You are literally killing me!”\u003c/p\u003e\n\u003cp\u003e“All part of the big plan, Big Al,” she said, easing up on the accent. “I’m the Texan Secret Weapon, sent up here to kill you.”\u003c/p\u003e\n\u003cp\u003e“I fucking knew it!”\u003c/p\u003e\n\u003cp\u003e“Anyway, like I said, DNA hasn’t been confirmed. So why take the risk of telling me?”\u003c/p\u003e\n\u003cp\u003e“Because I’m old and tired and it’s been a weird damned week.”\u003c/p\u003e\n\u003cp\u003eShe laughed at him. He made a mental note to check with Parliament to see if he could bomb Texas. “You! Old!” She laughed so hard she almost fell out of her chair. Unfortunately, no such luck. “You! Oh my Gawd! Haw haw haw!”\u003c/p\u003e\n\u003cp\u003eHe surreptitiously checked to make sure his ears hadn’t begun to bleed. “You really were sent by America to kill me, weren’t you?” he asked gloomily.\u003c/p\u003e\n\u003cp\u003e“Big Al, the grand ole You Ess of America don’t need me. They could turn Juneau into a smokin’ pile of cinders with no trouble a’tall. Now. Tell me about the new girl.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Aw, Al. You know I’m gonna get it out of you even-’chally.”\u003c/p\u003e\n\u003cp\u003e“Shut up. You will not. Where the hell were we when I last fired your ass?”\u003c/p\u003e\n\u003cp\u003eShe leaned over in her chair and slapped a thigh. “My extremely shapely ass, don’t pretend you never noticed, and we were talking about how you flew fighters in Korea.”\u003c/p\u003e\n\u003cp\u003e“Right. Okay. So…”\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eJ effrey had driven her to Mr. Dante’s house, waited silently and patiently in the car—Mr. Dante had never even seen him—then had driven her back home. He had taken in her swollen eyes at a glance and, thank God, said nothing.\u003c/p\u003e\n\u003cp\u003eShe didn’t speak a word for forty miles, but weirdly, it wasn’t awkward. Jeffrey hummed along with the fifties oldies station he played softly and seemed content to let her think. Or (what she was really doing) stew.\u003c/p\u003e\n\u003cp\u003e“Come in for a moment?” she asked when he pulled up to her trailer.\u003c/p\u003e\n\u003cp\u003e“That depends. How’s your artillery?”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s hilarious.”\u003c/p\u003e\n\u003cp\u003e“I prefer the word cautious.”\u003c/p\u003e\n\u003cp\u003eWhen they were inside, she offered him a drink, which he declined. Oh…duh. He probably considered himself on duty.\u003c/p\u003e\n\u003cp\u003e“Uh, can you give me a ride to the palace tomorrow?”\u003c/p\u003e\n\u003cp\u003eHe had been glancing around her living room, and spun around so fast she nearly took a step backward. For a big guy, he was quick on his feet. “The palace? You want to go to the palace? Our palace?”\u003c/p\u003e\n\u003cp\u003e“No, Buckingham Palace,” she snapped. “Of course our palace. Can you give me a ride? And get me in to talk to the king?”\u003c/p\u003e\n\u003cp\u003e“Of course. But as the head of his detail, I’d like to know your intentions. You realize that killing him will only—”\u003c/p\u003e\n\u003cp\u003e“I’m not going to kill him! My intentions are to submit to a DNA test.”\u003c/p\u003e\n\u003cp\u003e“You’re taking a DNA test?”\u003c/p\u003e\n\u003cp\u003e“Are you partially deaf with that earpiece clogging up your left ear? Yes.”\u003c/p\u003e\n\u003cp\u003eShe observed his eyebrows knit together. “Tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Yup.” Gorgeous, but slow on the uptake, this guy.\u003c/p\u003e\n\u003cp\u003e“And then it will be official. You will be, to the world, Her Royal Highness, Crown Princess Nicole.”\u003c/p\u003e\n\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003e“Oh. Then I better do this now.”\u003c/p\u003e\n\u003cp\u003e“Do what?”\u003c/p\u003e\n\u003cp\u003eBut he was moving with that lithe speed again and before she knew it, he was holding her in his arms and kissing her on the mouth. She was so surprised she forgot to bite.\u003c/p\u003e\n\u003cp\u003eAnd then she pretty much forgot everything else, too, for the first time since this crazy shit started up.\u003c/p\u003e\n\u003cp\u003eHe was holding her firmly, but she had no sense of being restrained. He was taking her mouth without permission, but she had no sense of being violated.\u003c/p\u003e\n\u003cp\u003eBest of all, he wasn’t stopping, and she had no sense of being not in control of the situation.\u003c/p\u003e\n\u003cp\u003eBecause the truth was, she was kissing him back just as hard as he was kissing her.\u003c/p\u003e\n\u003cp\u003eFinally, after a time that might have been ten seconds or ten minutes, he let go of her and spun away, leaning on the counter between the kitchen and the living room. Clutching the counter, really. She saw with some astonishment that his knuckles were white.\u003c/p\u003e\n\u003cp\u003e“Why—why did you do that?”\u003c/p\u003e\n\u003cp\u003e“Because tomorrow you’ll be Princess Nicole, and I won’t be able to do it. I’ll never be able to do it again.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Good night, Nicole.”\u003c/p\u003e\n\u003cp\u003eShe was so amazed she forgot to stop him.\u003c/p\u003e\n\u003cp\u003eChapter 19\u003c/p\u003e\n\u003cp\u003eA discreet rap on the door. King Al, grumpy after a long session spilling his life to the Dragon, and five more Buds, and four hours of sleep, massaged his temples. The discreet rap sounded like a giant was pounding on the wood with a ball-peen hammer.\u003c/p\u003e\n\u003cp\u003eHis breakfast sat before him, untouched. At the moment, he doubted he’d ever be able to eat again. And he was swearing off beer! Again!\u003c/p\u003e\n\u003cp\u003eAnother discreet rap.\u003c/p\u003e\n\u003cp\u003eHe made a bet with himself. It would be Edmund, with the morning mail.\u003c/p\u003e\n\u003cp\u003e“Come in, Edmund.”\u003c/p\u003e\n\u003cp\u003eOnly Edmund’s head came in; he had opened the door and stuck his head through. “Your Majesty? Drink your juice.”\u003c/p\u003e\n\u003cp\u003e“I fucking hate tomato juice! It’s like drinking red snot.”\u003c/p\u003e\n\u003cp\u003e“A master of poetry, even during the largest of hangovers. Majesty, I have a surprise for you.”\u003c/p\u003e\n\u003cp\u003e“Edmund, if I have one more surprise this week, I’m firing you.”\u003c/p\u003e\n\u003cp\u003e“Do not tease, Majesty. Are you ready?”\u003c/p\u003e\n\u003cp\u003e“Oh God,” he sighed. Then, “Hit me.”\u003c/p\u003e\n\u003cp\u003eEdmund’s head disappeared, and then Nicole walked in.\u003c/p\u003e\n\u003cp\u003e“Holy mother of God!”\u003c/p\u003e\n\u003cp\u003e“It’s nice to see you too, Al.” Nicole had a wry expression on her face. Cute as a bug, too, and—was she wearing a dress? A perfectly lovely dress with black tights and sensible black flats?\u003c/p\u003e\n\u003cp\u003e“Wh—what—how—why—”\u003c/p\u003e\n\u003cp\u003e“A man of letters, just like Mr. Dante said. Awesome.”\u003c/p\u003e\n\u003cp\u003e“I have a brain tumor, so please stop yanking my chain,” he begged.\u003c/p\u003e\n\u003cp\u003e“It’s just a headache, you infant. Look, I went over to Mr. Dante’s house yesterday and talked it over with him and here I am, so shut up about it now.”\u003c/p\u003e\n\u003cp\u003e“But how the hell did you even know where he lived?”\u003c/p\u003e\n\u003cp\u003e“Who cares? I’m here, right?”\u003c/p\u003e\n\u003cp\u003e“Damn right! Hell, it’s great to see you again, kiddo!” He got up and practically ran around his desk, holding his arms out without thinking.\u003c/p\u003e\n\u003cp\u003eHe would have bet the east wing that she had no idea how horrified she looked at that moment, so he dropped his arms and stuck out a hand instead. Thawing an inch or two, she shook it. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-mess-alaskan-royal-family-3/page-8.html","bookId":2791,"creation":"Oct 5, 2019 5:36:22 PM","modification":"Oct 5, 2019 5:36:22 PM"}
