{"id":43197,"no":3,"title":"CHAPTER III.","content":"The fancy-dress masquerade cycle carnival had been the talk of fashionable circles in Newport for the last fortnight, and now, as the auspicious evening drew near, excitement was almost at fever heat.\n\u003cbr\u003e \n\u003cbr\u003e The tickets of admission had been closely guarded; gold could not buy them. The tickets, which were strictly not transferable, had been duly delivered by messengers to the different members whose names they bore, and the promoters of the affair felt duly satisfied that no one outside the charmed circle of Newport\u0027s fashionable Four Hundred could by any possibility invade the sacred precincts.\n\u003cbr\u003e \n\u003cbr\u003e A whole army of officers were to guard against intruders. There was to be a banquet in the supper-room at midnight, after the masks of the merry cyclers had been removed, that would be so startling in its sumptuousness that the whole country would be talking about it, and those who had been fortunate enough to attend would never forget it in their after lives.\n\u003cbr\u003e \n\u003cbr\u003e Philip Ravenswood had indeed done his utmost to secure the admittance of his friend; but even he had failed signally. The officers were inexorable in their polite but firm refusal to his request.\n\u003cbr\u003e \n\u003cbr\u003e Two hours later the grand masquerade cycle carnival was at its height. The marble walls of the millionaire club never held a more brilliant gathering of ladies fair, with eyes behind silken masks brighter than the diamonds they wore, and men braver than the famous knights of old in their powdered wigs, satin knee-breeches and spangled waistcoats.\n\u003cbr\u003e \n\u003cbr\u003e [14]\n\u003cbr\u003e \n\u003cbr\u003e One wheelman, in the costume of handsome Romeo, sprung from his wheel near one of the fountains, and watched with keen eyes through his mask the cyclers as they passed him one after another.\n\u003cbr\u003e \n\u003cbr\u003e \"Aha! I have them at last,\" he muttered, as he noted three wood-nymphs hovering close together. \"Well, I declare, I thought I should have little difficulty in distinguishing one from the other,\" he muttered; \"but to save my life, I can not tell them apart. I shall trust to fate to choose for me, hoping it will be the beauteous Hildegarde.\"\n\u003cbr\u003e \n\u003cbr\u003e Suddenly two plumed cavaliers sprung from their wheels before the two foremost wood-nymphs, and asked permission in silent pantomime to ride as their escorts around the rink, which request was graciously acceded to, but with the dignity of young princesses.\n\u003cbr\u003e \n\u003cbr\u003e \"This is my opportunity,\" thought Romeo. \"I must claim the remaining wood-nymph before some other fellow has the chance to capture her.\"\n\u003cbr\u003e \n\u003cbr\u003e The next instant he was bowing low before her.\n\u003cbr\u003e \n\u003cbr\u003e \"May I have the great honor of riding as your escort around the rink, fair wood-nymph?\" he whispered in a low, melodious voice. \"Ah, pardon my speaking; it was purely a slip of the tongue. I should have made known my request in pantomime. But pray forgive, and do not betray me, fairest of all maidens, to the floor manager, pray, or I shall be ordered from the floor in deep disgrace.\"\n\u003cbr\u003e \n\u003cbr\u003e \"If she answers, I shall know by her voice which one of the three heiresses she is,\" he thought.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I shall not betray you, Mr. Ainsley,\" replied the girl, with a jolly little laugh, showing the whitest of pearly teeth, \"and I accept your escort to ride with[15] me. I—I am so afraid of tumbling off my wheel, this gay throng and the flashing lights bewilder me so. I—I was just wondering if you would be here to-night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Fair maid, you know me?\" he whispered, in apparent amazement. \"I am astounded, yet flattered. Pray be kind enough to exchange confidences. I have been hoping against hope that you are the one whom I longed to see here. Surely the throbbings of my heart tell me who you are, fair nymph. Shall I breathe to you the name of her whom I ardently wish it to be?\" he asked, softly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" she answered, eagerly; and there was no mistaking the characteristic catching of the breath, and the intense, eager gaze in the velvety eyes behind the silken mask.\n\u003cbr\u003e \n\u003cbr\u003e He crushed the furtive hope that had stirred his heart for an instant that it might be Hildegarde, and answered, boldly:\n\u003cbr\u003e \n\u003cbr\u003e \"I prayed the fates to lead me to the feet of beauteous Ida May! Oh, tell me—am I right? Do be kind, and tell me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then the fates have answered your prayer,\" she replied. \"I suppose I ought not to tell you until unmasking time, but really I can not help it. I am Ida May.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thanks, ten thousand thanks for ending my suspense, dear girl,\" he murmured, as only Royal Ainsley could utter the words. A few sweeps around the rink, where handsome Romeo, with his superb fancy riding, was the cynosure of all eager feminine eyes, midst murmurs of admiration, then he whispered to his companion: \"Come into the conservatory; the air is too close here. You are riding as though you were dizzy. Are you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" she answered. \"I must have air. I——\"\n\u003cbr\u003e \n\u003cbr\u003e [16]\n\u003cbr\u003e \n\u003cbr\u003e The wheel suddenly wobbled recklessly from side to side, as though its rider had lost control of it entirely.\n\u003cbr\u003e \n\u003cbr\u003e Royal Ainsley sprung from his wheel just in time to prevent her from falling, and in that instant he crushed her closely to his heart, then as quickly released her.\n\u003cbr\u003e \n\u003cbr\u003e The excitement was so great, no one noticed this little by-play, or saw Romeo lead the fair wood-nymph from amid the glittering lights to the shadowy depths of the cool conservatory. Standing their wheels against a marble Flora, he found a rustic bench on which he placed her, taking a seat beside her, dangerously near, his hand closing over the fluttering little white one, his handsome head, with its fair, clustering hair, bent near her own. A half hour they spent amid the dim, cool shadows, the perfume of the roses enfolding them, the soft, low, bewildering echo of the delicious music floating out to them.\n\u003cbr\u003e \n\u003cbr\u003e Remember, the young girl was only seventeen, dear reader, otherwise the place, and the scene, and the fair, handsome lover by her side could not have infatuated her so quickly or so deeply.\n\u003cbr\u003e \n\u003cbr\u003e \"This is heaven!\" he whispered. \"How I wish we could linger here forever, Ida—I your devoted knight, and you my queen, the world forgetting, by the world forgot! Do you wish it could be so?\"\n\u003cbr\u003e \n\u003cbr\u003e The low cadence of his voice; the thrilling touch of that strong, white hand that was stealing around the supple waist, drawing her toward him; the panting of his breath, which she could feel on her flushed cheek; the mesmeric, steady gaze of those bright blue, shining eyes, bewildered her—made her heart flutter as it had never fluttered before.\n\u003cbr\u003e \n\u003cbr\u003e [17]\n\u003cbr\u003e \n\u003cbr\u003e \"Do you wish we could be always together, Ida?\" he persisted.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" answered the girl, with a half sob of affright, trembling under the strange spell that had slowly but surely been cast over her.\n\u003cbr\u003e \n\u003cbr\u003e \"Then marry me, Ida!\" he cried, \"this very night—within the hour, and no one can ever part us after that! Oh, Ida, do not refuse me!\" he urged. \"I love you so that I would die for you. Fate surely intended us for each other, or we would never have met and loved as we do. Oh, my darling, you can not deny it! You do love me, Ida May?\"\n\u003cbr\u003e \n\u003cbr\u003e She strove with all her might to deny it; but, in spite of herself, he wrung the truth from her lips—that she did love him. A sudden light that she could not quite understand leaped up into his eyes for a moment, and a triumphant smile curved his lips.\n\u003cbr\u003e \n\u003cbr\u003e \"We shall be married to-night, Ida!\" he cried. \"I will arrange it somehow;\" and as he uttered the words, he told himself that the great heiress was as good as won.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1691/49775.html","bookId":1156,"creation":"Aug 11, 2019 6:40:07 AM","modification":"Aug 11, 2019 6:40:07 AM"}
