{"id":43235,"no":41,"title":"CHAPTER XLI.","content":"Although scarcely five minutes had elapsed since Eugene Mallard dashed into the house in search of his revolver, when he returned to the brook-side neither his wife nor Arthur Hollis was to be seen.\n\u003cbr\u003e \n\u003cbr\u003e His rage was so great that he could scarcely contain himself. In his present state of mind he did not dare return to his guests, lest his emotion should betray him.\n\u003cbr\u003e \n\u003cbr\u003e He thought they were planning an elopement; but he would nip that in the bud.\n\u003cbr\u003e \n\u003cbr\u003e The woman to whom he had given his name should not disgrace him. He determined upon that as he hurried up a rear stair-way to his wife\u0027s apartments to verify his suspicions.\n\u003cbr\u003e \n\u003cbr\u003e To his utter surprise, as he flung open the door, he saw her sitting by the window. She sprung to her feet, looking at him with widely distended eyes.\n\u003cbr\u003e \n\u003cbr\u003e It was the first time that her husband had ever crossed the threshold of her apartments.\n\u003cbr\u003e \n\u003cbr\u003e He entered the room, closed the door behind him, and stood with folded arms before her.\n\u003cbr\u003e \n\u003cbr\u003e Husband and wife looked at each other.\n\u003cbr\u003e \n\u003cbr\u003e It was he who broke the awful silence. He strode up to her, and seized her wrist in a vise-like grasp.\n\u003cbr\u003e \n\u003cbr\u003e \"There is little use in making a preliminary speech,\" he cried, hoarsely. \"I will come to the point at once!\"\n\u003cbr\u003e \n\u003cbr\u003e His face was ghastly, his lips trembled with uncontrollable rage.\n\u003cbr\u003e \n\u003cbr\u003e Ida, pale, terrified, wondering, gazed at him with undisguised terror in her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"What is it?\" she gasped.\n\u003cbr\u003e \n\u003cbr\u003e \"You guilty woman!\" cried Eugene Mallard—\"you cruel, guilty woman, I have interrupted you in your preparation for flight, it seems!\"\n\u003cbr\u003e \n\u003cbr\u003e His stern face, the anger that shone in his eyes, and the harsh voice frightened her. She shrunk back as[175] though he had struck her. Her lips parted as though she would speak; but all sound died away on them.\n\u003cbr\u003e \n\u003cbr\u003e \"It is time,\" said Eugene Mallard, \"that we came to a clear understanding. In every way you have deceived me! I have been fatally betrayed! Your shameless flirtation has tarnished my name and lowered my position! I am ashamed to look men in the face! Where is he?\" he demanded, looking about him, as though he expected to see Arthur Hollis in the room.\n\u003cbr\u003e \n\u003cbr\u003e \"Down by the brook,\" she faltered.\n\u003cbr\u003e \n\u003cbr\u003e Eugene laughed a harsh, satirical laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"He must have seen me coming while he waited there for you, and fled from my wrath.\" He turned on his heel. \"I repeat, if you stir from this room until I give you leave, it will end in a tragedy!\"\n\u003cbr\u003e \n\u003cbr\u003e In his anger, he did not see that he was trampling under foot a noble heart. If she had been able to calmly explain to him just what had occurred, she might have been saved. She attempted to speak, but he held up his hand.\n\u003cbr\u003e \n\u003cbr\u003e \"Not one word!\" he cried. \"I will not listen!\"\n\u003cbr\u003e \n\u003cbr\u003e He turned suddenly, hurried from the room, closed the door after him, and went quickly to his library, where he could be alone.\n\u003cbr\u003e \n\u003cbr\u003e Ida, left alone, reeled into the nearest chair. She shook as if in an ague; she was cold, and her head reeled. Her keen pain and agony kept her from fainting.\n\u003cbr\u003e \n\u003cbr\u003e She tried to imagine her future life. What was Eugene Mallard about to do? Her future was now ruined, sacrificed. Eugene Mallard had been cold and indifferent to her before, now he hated her.\n\u003cbr\u003e \n\u003cbr\u003e He said she was to remain in that room until he should return. She flung herself face downward upon the floor. He had called her guilty and cruel; he had vented his rage upon her. Her brain was dizzy with the unusual excitement.\n\u003cbr\u003e \n\u003cbr\u003e When Vivian Deane glided into Ida\u0027s room to find out what was going on, to see whether Ida had really eloped, she found her in a deep swoon. She did not call the servants, but set about reviving her herself.\n\u003cbr\u003e \n\u003cbr\u003e [176]\n\u003cbr\u003e \n\u003cbr\u003e Ida lay white and still as one dead. Above her bent Vivian Deane, half terrified at the result of her work. Very soon her labors were rewarded, and Ida opened her large, dark eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"Vivian—Vivian!\" she murmured, catching at the arms of her false friend, her teeth chattering.\n\u003cbr\u003e \n\u003cbr\u003e The blinding tears that now fell from Ida\u0027s eyes was a mercy sent directly from Heaven, for they saved the hapless young wife from going mad.\n\u003cbr\u003e \n\u003cbr\u003e \"Something has gone wrong with you, my dear,\" said Vivian, in her sweetest, most cooing voice. \"Tell me what it is, Ida, dear. Let me console and comfort you.\"\n\u003cbr\u003e \n\u003cbr\u003e Another fit of sobbing more violent than the first, and Ida threw herself into the arms of her treacherous friend, sobbing out:\n\u003cbr\u003e \n\u003cbr\u003e \"Oh! Vivian, I must tell some one.\"\n\u003cbr\u003e \n\u003cbr\u003e In a voice that shook with emotion, she proceeded to confide to her enemy what had happened down by the brook-side, adding that her husband had discovered it in some way, and accused her of encouraging Arthur Hollis.\n\u003cbr\u003e \n\u003cbr\u003e \"Even if you had given him encouragement, no one could have blamed you,\" Vivian said in a soft, purring voice, \"for your husband\u0027s neglect has been noticeable by every one!\"\n\u003cbr\u003e \n\u003cbr\u003e \"But I did not encourage him!\" cried Ida, in agony. \"He was pleasant company, but I thought no more of him, even though I spent so much of my time in his society, than I did of Captain Drury, or any of the other guests beneath this roof. Oh! I do wish I were dead—I do—I do!\"\n\u003cbr\u003e \n\u003cbr\u003e In this exaggerated feeling of one ill in body and in mind, in a state of nervous tension, a true friend would have shown the unhappy Ida that her position was not so desperate and hopeless as she imagined. Matters could not, however, be carried to an extremity without an explanation.\n\u003cbr\u003e \n\u003cbr\u003e \"He bid me to remain here until he should return,\" sobbed Ida. \"What do you suppose he means to do?\"\n\u003cbr\u003e \n\u003cbr\u003e [177]\n\u003cbr\u003e \n\u003cbr\u003e \"Do you really want my honest opinion?\" asked Vivian, with a steely glitter in her blue eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes!\" said the young wife, anxiously, fairly holding her breath in suspense.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, then, my dear, if you must have it, here it is: I, who know the fierce temper of the Mallards, say to you that I think he intends to call all the guests here, to openly denounce you before them, and then turn you away from his house!\"\n\u003cbr\u003e \n\u003cbr\u003e The face of the girl-wife who listened grew ghastly.\n\u003cbr\u003e \n\u003cbr\u003e \"I would never stay beneath this roof to face his anger,\" said Vivian, her eyes glistening. \"I would gather up what money and jewels I could lay my hands on, and run away—go as far away as possible.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Would you?\" cried Ida, in a hushed, awful voice.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" advised Vivian, firmly. \"And every moment of delay brings you nearer and nearer to face the terrible ordeal that I am sure he intends to mete out to you!\"\n\u003cbr\u003e \n\u003cbr\u003e Ida rose suddenly to her feet\n\u003cbr\u003e \n\u003cbr\u003e \"I will do as you advise, Vivian,\" she whispered, her dark eyes filled with terror. \"I will fly at once!\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1691/49813.html","bookId":1156,"creation":"Aug 11, 2019 6:40:07 AM","modification":"Aug 11, 2019 6:40:07 AM"}
