{"id":43253,"no":59,"title":"CHAPTER LIX.","content":"When Royal Ainsley shook himself free from old Joe\u0027s detaining grasp, his first impulse was to get as far away from the place as possible.\n\u003cbr\u003e \n\u003cbr\u003e With second thoughts, however, came another decision. No; he must learn all that was taking place.\n\u003cbr\u003e \n\u003cbr\u003e Quickly circling the grounds, he soon gained a vantage-place behind a group of bushes not far from the house. There he could easily see and hear all that transpired without being seen himself.\n\u003cbr\u003e \n\u003cbr\u003e He saw Eugene Mallard as he drew the girl beneath the swinging lamp in the hall, and heard the conversation that passed between them.\n\u003cbr\u003e \n\u003cbr\u003e \"So!\" he muttered, grinding his white teeth savagely,[245] \"the girl is my lady\u0027s maid, eh? I dare say, she sent her with some message to me when she was intercepted by Eugene Mallard. But Ida will find that this will not work with me. See her I shall, if I have to stay in these grounds till broad daylight.\"\n\u003cbr\u003e \n\u003cbr\u003e He watched and waited until he saw even old Joe relax his vigilance and go into the house.\n\u003cbr\u003e \n\u003cbr\u003e Royal Ainsley waited there until the old mansion was wrapped in gloom and darkness, then he slipped from his hiding-place, passed noiselessly over the graveled walk, and stood beneath Ida\u0027s window.\n\u003cbr\u003e \n\u003cbr\u003e Stooping, he caught up a handful of pebbles. One by one he flung them up against the window-pane. Just as he had expected, he saw a white, terrified face appear at the window, and two white hands threw up the sash.\n\u003cbr\u003e \n\u003cbr\u003e He saw at once that it was Ida. He moved out from the shadow of the trees. She saw him at once, and recognized him.\n\u003cbr\u003e \n\u003cbr\u003e \"Is it you?\" she cried, in the greatest alarm. \"What in Heaven\u0027s name are you doing there, pray?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Your common sense ought to tell you that;\" he retorted, harshly. \"Come down here at once, I tell you, and be sure to bring that money with you!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, no! no! I can not!\" she answered him, piteously.\n\u003cbr\u003e \n\u003cbr\u003e \"Why?\" he demanded, with something very much like an imprecation upon his lips.\n\u003cbr\u003e \n\u003cbr\u003e \"I dropped the money in the dining-room as I was passing through it to get out into the grounds. The room is locked; I can not get it until to-morrow morning. Old Joe always carries the key with him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is a lie!\" he cried, fiercely.\n\u003cbr\u003e \n\u003cbr\u003e \"No! no! On my life, it is true!\" she answered, with a piteous quiver in her voice; adding: \"I was hurrying[246] through the room, and there I must have dropped it. I searched for it in every other place.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then hear what I say,\" he retorted, with an oath, \"in these very grounds I shall stay until you come to me. I know well that old Joe is astir at dawn. You must be up then, find the money which you say you dropped, and bring it out to me. I will be waiting for you at the same place.\"\n\u003cbr\u003e \n\u003cbr\u003e Before she could utter a word of protest, he had turned and disappeared in the darkness.\n\u003cbr\u003e \n\u003cbr\u003e All night long Ida Mallard paced the floor of her room, scarcely heeding the hours that dragged their slow lengths by. Dawn came before she realized it. She was startled from her reverie by hearing old Joe throwing open the shutters about the house. That recalled her to a realization of passing events.\n\u003cbr\u003e \n\u003cbr\u003e Joe had unlocked the door of the dining-room at last, but his sight was so poor that he could not espy a small roll of bills lying on the floor.\n\u003cbr\u003e \n\u003cbr\u003e Ida, gliding into the room as soon as his footsteps echoed down the corridor, found the package.\n\u003cbr\u003e \n\u003cbr\u003e She stole to the door as soon as it was unlocked.\n\u003cbr\u003e \n\u003cbr\u003e Ah! how sweet and fragrant was the early morning. How cool and green the grass looked, wet with the morning dew! Little she dreamed that ere the day waned that same grass would be dyed with a human being\u0027s blood.\n\u003cbr\u003e \n\u003cbr\u003e She shivered as she stepped forth into the grounds. With hurried steps she crossed the lawn, and went into the rose-garden beyond. There she saw Royal Ainsley. He was pacing the little path by the brook, his face white, his eyes angry-looking, downcast and sullen.\n\u003cbr\u003e \n\u003cbr\u003e [247]\n\u003cbr\u003e \n\u003cbr\u003e \"So you have come at last, eh?\" he exclaimed, angrily.\n\u003cbr\u003e \n\u003cbr\u003e \"I am here,\" she responded, tremulously.\n\u003cbr\u003e \n\u003cbr\u003e \"I was just about to go and wake up the household,\" he cried, his rage increasing.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, that I am here, you will not have to do that,\" she answered, wearily.\n\u003cbr\u003e \n\u003cbr\u003e \"Where is the money?\" he asked, abruptly.\n\u003cbr\u003e \n\u003cbr\u003e She held it in her hand, but clutched it more tightly.\n\u003cbr\u003e \n\u003cbr\u003e \"I have it with me,\" she responded; \"but it is not yours until you carry out your promises!\"\n\u003cbr\u003e \n\u003cbr\u003e He looked at her with a cunning gleam in his eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"To be sure I will carry out my agreement,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"But I must have proof that you will do so before I part with so much money,\" she said. \"You must give me your written word that you will never trouble me again. You must also tell me where I can find my child, for I see that you have not kept your word about bringing her with you!\"\n\u003cbr\u003e \n\u003cbr\u003e He laughed aloud—a harsh, mocking laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"I am not surprised at hearing a remark like that from your lips. A woman who could abandon her child as easily as you did, without so much as knowing its fate, and who is content to live here as Eugene Mallard\u0027s wife, whenever he is ready to take you to his heart, is capable of doing anything. I do not wonder that you supposed the little one was here in the grounds all night long awaiting your fancy to appear!\"\n\u003cbr\u003e \n\u003cbr\u003e She recoiled at the words as though he had struck her a blow.\n\u003cbr\u003e \n\u003cbr\u003e \"Let me tell you where your child is,\" he said, hoarsely. \"You shall know its fate!\"\n\u003cbr\u003e \n\u003cbr\u003e As he spoke, he seized the hand that held the money, and tore the bills from her grasp.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1691/49831.html","bookId":1156,"creation":"Aug 11, 2019 6:40:07 AM","modification":"Aug 11, 2019 6:40:07 AM"}
