{"id":34776,"no":14,"title":"BOOK XII.","content":"ARGUMENT.\n\u003cbr\u003e \n\u003cbr\u003e THE BATTLE AT THE GRECIAN WALL.\n\u003cbr\u003e \n\u003cbr\u003e The Greeks having retired into their intrenchments, Hector attempts to force them; but it proving impossible to pass the ditch, Polydamas advises to quit their chariots, and manage the attack on foot. The Trojans follow his counsel; and having divided their army into five bodies of foot, begin the assault. But upon the signal of an eagle with a serpent in his talons, which appeared on the left hand of the Trojans, Polydamas endeavours to withdraw them again. This Hector opposes, and continues the attack; in which, after many actions, Sarpedon makes the first breach in the wall. Hector also, casting a stone of vast size, forces open one of the gates, and enters at the head of his troops, who victoriously pursue the Grecians even to their ships.\n\u003cbr\u003e While thus the hero\u0027s pious cares attend\n\u003cbr\u003e The cure and safety of his wounded friend,\n\u003cbr\u003e Trojans and Greeks with clashing shields engage,\n\u003cbr\u003e And mutual deaths are dealt with mutual rage.\n\u003cbr\u003e Nor long the trench or lofty walls oppose;\n\u003cbr\u003e With gods averse the ill-fated works arose;\n\u003cbr\u003e Their powers neglected, and no victim slain,\n\u003cbr\u003e The walls were raised, the trenches sunk in vain.\n\u003cbr\u003e Without the gods, how short a period stands\n\u003cbr\u003e The proudest monument of mortal hands!\n\u003cbr\u003e This stood while Hector and Achilles raged.\n\u003cbr\u003e While sacred Troy the warring hosts engaged;\n\u003cbr\u003e But when her sons were slain, her city burn\u0027d,\n\u003cbr\u003e And what survived of Greece to Greece return\u0027d;\n\u003cbr\u003e Then Neptune and Apollo shook the shore,\n\u003cbr\u003e Then Ida\u0027s summits pour\u0027d their watery store;\n\u003cbr\u003e Rhesus and Rhodius then unite their rills,\n\u003cbr\u003e Caresus roaring down the stony hills,\n\u003cbr\u003e ?sepus, Granicus, with mingled force,\n\u003cbr\u003e And Xanthus foaming from his fruitful source;\n\u003cbr\u003e And gulfy Simois, rolling to the main224\n\u003cbr\u003e [pg 218]\n\u003cbr\u003e Helmets, and shields, and godlike heroes slain:\n\u003cbr\u003e These, turn\u0027d by Phoebus from their wonted ways,\n\u003cbr\u003e Deluged the rampire nine continual days;\n\u003cbr\u003e The weight of waters saps the yielding wall,\n\u003cbr\u003e And to the sea the floating bulwarks fall.\n\u003cbr\u003e Incessant cataracts the Thunderer pours,\n\u003cbr\u003e And half the skies descend in sluicy showers.\n\u003cbr\u003e The god of ocean, marching stern before,\n\u003cbr\u003e With his huge trident wounds the trembling shore,\n\u003cbr\u003e Vast stones and piles from their foundation heaves,\n\u003cbr\u003e And whelms the smoky ruin in the waves.\n\u003cbr\u003e Now smooth\u0027d with sand, and levell\u0027d by the flood,\n\u003cbr\u003e No fragment tells where once the wonder stood;\n\u003cbr\u003e In their old bounds the rivers roll again,\n\u003cbr\u003e Shine \u0027twixt the hills, or wander o\u0027er the plain.225\n\u003cbr\u003e But this the gods in later times perform;\n\u003cbr\u003e As yet the bulwark stood, and braved the storm;\n\u003cbr\u003e The strokes yet echoed of contending powers;\n\u003cbr\u003e War thunder\u0027d at the gates, and blood distain\u0027d the towers.\n\u003cbr\u003e Smote by the arm of Jove with dire dismay,\n\u003cbr\u003e Close by their hollow ships the Grecians lay:\n\u003cbr\u003e Hector\u0027s approach in every wind they hear,\n\u003cbr\u003e And Hector\u0027s fury every moment fear.\n\u003cbr\u003e He, like a whirlwind, toss\u0027d the scattering throng,\n\u003cbr\u003e Mingled the troops, and drove the field along.\n\u003cbr\u003e So \u0027midst the dogs and hunters\u0027 daring bands,\n\u003cbr\u003e Fierce of his might, a boar or lion stands;\n\u003cbr\u003e Arm\u0027d foes around a dreadful circle form,\n\u003cbr\u003e And hissing javelins rain an iron storm:\n\u003cbr\u003e His powers untamed, their bold assault defy,\n\u003cbr\u003e And where he turns the rout disperse or die:\n\u003cbr\u003e He foams, he glares, he bounds against them all,\n\u003cbr\u003e And if he falls, his courage makes him fall.\n\u003cbr\u003e With equal rage encompass\u0027d Hector glows;\n\u003cbr\u003e Exhorts his armies, and the trenches shows.\n\u003cbr\u003e The panting steeds impatient fury breathe,\n\u003cbr\u003e And snort and tremble at the gulf beneath;\n\u003cbr\u003e Just at the brink they neigh, and paw the ground,\n\u003cbr\u003e And the turf trembles, and the skies resound.\n\u003cbr\u003e Eager they view\u0027d the prospect dark and deep,\n\u003cbr\u003e Vast was the leap, and headlong hung the steep;\n\u003cbr\u003e The bottom bare, (a formidable show!)\n\u003cbr\u003e And bristled thick with sharpen\u0027d stakes below.\n\u003cbr\u003e The foot alone this strong defence could force,\n\u003cbr\u003e And try the pass impervious to the horse.\n\u003cbr\u003e [pg 219]\n\u003cbr\u003e This saw Polydamas; who, wisely brave,\n\u003cbr\u003e Restrain\u0027d great Hector, and this counsel gave:\n\u003cbr\u003e \"O thou, bold leader of the Trojan bands!\n\u003cbr\u003e And you, confederate chiefs from foreign lands!\n\u003cbr\u003e What entrance here can cumbrous chariots find,\n\u003cbr\u003e The stakes beneath, the Grecian walls behind?\n\u003cbr\u003e No pass through those, without a thousand wounds,\n\u003cbr\u003e No space for combat in yon narrow bounds.\n\u003cbr\u003e Proud of the favours mighty Jove has shown,\n\u003cbr\u003e On certain dangers we too rashly run:\n\u003cbr\u003e If \u0027tis will our haughty foes to tame,\n\u003cbr\u003e Oh may this instant end the Grecian name!\n\u003cbr\u003e Here, far from Argos, let their heroes fall,\n\u003cbr\u003e And one great day destroy and bury all!\n\u003cbr\u003e But should they turn, and here oppress our train,\n\u003cbr\u003e What hopes, what methods of retreat remain?\n\u003cbr\u003e Wedged in the trench, by our own troops confused,\n\u003cbr\u003e In one promiscuous carnage crush\u0027d and bruised,\n\u003cbr\u003e All Troy must perish, if their arms prevail,\n\u003cbr\u003e Nor shall a Trojan live to tell the tale.\n\u003cbr\u003e Hear then, ye warriors! and obey with speed;\n\u003cbr\u003e Back from the trenches let your steeds be led;\n\u003cbr\u003e Then all alighting, wedged in firm array,\n\u003cbr\u003e Proceed on foot, and Hector lead the way.\n\u003cbr\u003e So Greece shall stoop before our conquering power,\n\u003cbr\u003e And this (if Jove consent) her fatal hour.\"\n\u003cbr\u003e \n\u003cbr\u003e Illustration: POLYDAMAS ADVISING HECTOR.\n\u003cbr\u003e POLYDAMAS ADVISING HECTOR.\n\u003cbr\u003e This counsel pleased: the godlike Hector sprung\n\u003cbr\u003e Swift from his seat; his clanging armour rung.\n\u003cbr\u003e The chief\u0027s example follow\u0027d by his train,\n\u003cbr\u003e Each quits his car, and issues on the plain,\n\u003cbr\u003e By orders strict the charioteers enjoin\u0027d\n\u003cbr\u003e Compel the coursers to their ranks behind.\n\u003cbr\u003e [pg 220]\n\u003cbr\u003e The forces part in five distinguish\u0027d bands,\n\u003cbr\u003e And all obey their several chiefs\u0027 commands.\n\u003cbr\u003e The best and bravest in the first conspire,\n\u003cbr\u003e Pant for the fight, and threat the fleet with fire:\n\u003cbr\u003e Great Hector glorious in the van of these,\n\u003cbr\u003e Polydamas, and brave Cebriones.\n\u003cbr\u003e Before the next the graceful Paris shines,\n\u003cbr\u003e And bold Alcathous, and Agenor joins.\n\u003cbr\u003e The sons of Priam with the third appear,\n\u003cbr\u003e Deiphobus, and Helenas the seer;\n\u003cbr\u003e In arms with these the mighty Asius stood,\n\u003cbr\u003e Who drew from Hyrtacus his noble blood,\n\u003cbr\u003e And whom Arisba\u0027s yellow coursers bore,\n\u003cbr\u003e The coursers fed on Selle\u0027s winding shore.\n\u003cbr\u003e Antenor\u0027s sons the fourth battalion guide,\n\u003cbr\u003e And great ?neas, born on fountful Ide.\n\u003cbr\u003e Divine Sarpedon the last band obey\u0027d,\n\u003cbr\u003e Whom Glaucus and Asteropaeus aid.\n\u003cbr\u003e Next him, the bravest, at their army\u0027s head,\n\u003cbr\u003e But he more brave than all the hosts he led.\n\u003cbr\u003e Now with compacted shields in close array,\n\u003cbr\u003e The moving legions speed their headlong way:\n\u003cbr\u003e Already in their hopes they fire the fleet,\n\u003cbr\u003e And see the Grecians gasping at their feet.\n\u003cbr\u003e While every Trojan thus, and every aid,\n\u003cbr\u003e The advice of wise Polydamas obey\u0027d,\n\u003cbr\u003e Asius alone, confiding in his car,\n\u003cbr\u003e His vaunted coursers urged to meet the war.\n\u003cbr\u003e Unhappy hero! and advised in vain;\n\u003cbr\u003e Those wheels returning ne\u0027er shall mark the plain;\n\u003cbr\u003e No more those coursers with triumphant joy\n\u003cbr\u003e Restore their master to the gates of Troy!\n\u003cbr\u003e Black death attends behind the Grecian wall,\n\u003cbr\u003e And great Idomeneus shall boast thy fall!\n\u003cbr\u003e Fierce to the left he drives, where from the plain\n\u003cbr\u003e The flying Grecians strove their ships to gain;\n\u003cbr\u003e Swift through the wall their horse and chariots pass\u0027d,\n\u003cbr\u003e The gates half-open\u0027d to receive the last.\n\u003cbr\u003e Thither, exulting in his force, he flies:\n\u003cbr\u003e His following host with clamours rend the skies:\n\u003cbr\u003e To plunge the Grecians headlong in the main,\n\u003cbr\u003e Such their proud hopes; but all their hopes were vain!\n\u003cbr\u003e To guard the gates, two mighty chiefs attend,\n\u003cbr\u003e Who from the Lapiths\u0027 warlike race descend;\n\u003cbr\u003e This Polypoetes, great Perithous\u0027 heir,\n\u003cbr\u003e And that Leonteus, like the god of war.\n\u003cbr\u003e As two tall oaks, before the wall they rise;\n\u003cbr\u003e Their roots in earth, their heads amidst the skies:\n\u003cbr\u003e Whose spreading arms with leafy honours crown\u0027d,\n\u003cbr\u003e Forbid the tempest, and protect the ground;\n\u003cbr\u003e [pg 221]\n\u003cbr\u003e High on the hills appears their stately form,\n\u003cbr\u003e And their deep roots for ever brave the storm.\n\u003cbr\u003e So graceful these, and so the shock they stand\n\u003cbr\u003e Of raging Asius, and his furious band.\n\u003cbr\u003e Orestes, Acamas, in front appear,\n\u003cbr\u003e And OEnomaus and Thoon close the rear:\n\u003cbr\u003e In vain their clamours shake the ambient fields,\n\u003cbr\u003e In vain around them beat their hollow shields;\n\u003cbr\u003e The fearless brothers on the Grecians call,\n\u003cbr\u003e To guard their navies, and defend the wall.\n\u003cbr\u003e Even when they saw Troy\u0027s sable troops impend,\n\u003cbr\u003e And Greece tumultuous from her towers descend,\n\u003cbr\u003e Forth from the portals rush\u0027d the intrepid pair,\n\u003cbr\u003e Opposed their breasts, and stood themselves the war.\n\u003cbr\u003e So two wild boars spring furious from their den,\n\u003cbr\u003e Roused with the cries of dogs and voice of men;\n\u003cbr\u003e On every side the crackling trees they tear,\n\u003cbr\u003e And root the shrubs, and lay the forest bare;\n\u003cbr\u003e They gnash their tusks, with fire their eye-balls roll,\n\u003cbr\u003e Till some wide wound lets out their mighty soul.\n\u003cbr\u003e Around their heads the whistling javelins sung,\n\u003cbr\u003e With sounding strokes their brazen targets rung;\n\u003cbr\u003e Fierce was the fight, while yet the Grecian powers\n\u003cbr\u003e Maintain\u0027d the walls, and mann\u0027d the lofty towers:\n\u003cbr\u003e To save their fleet their last efforts they try,\n\u003cbr\u003e And stones and darts in mingled tempests fly.\n\u003cbr\u003e As when sharp Boreas blows abroad, and brings\n\u003cbr\u003e The dreary winter on his frozen wings;\n\u003cbr\u003e Beneath the low-hung clouds the sheets of snow\n\u003cbr\u003e Descend, and whiten all the fields below:\n\u003cbr\u003e So fast the darts on either army pour,\n\u003cbr\u003e So down the rampires rolls the rocky shower:\n\u003cbr\u003e Heavy, and thick, resound the batter\u0027d shields,\n\u003cbr\u003e And the deaf echo rattles round the fields.\n\u003cbr\u003e With shame repulsed, with grief and fury driven,\n\u003cbr\u003e The frantic Asius thus accuses Heaven:\n\u003cbr\u003e \"In powers immortal who shall now believe?\n\u003cbr\u003e Can those too flatter, and can Jove deceive?\n\u003cbr\u003e What man could doubt but Troy\u0027s victorious power\n\u003cbr\u003e Should humble Greece, and this her fatal hour?\n\u003cbr\u003e But like when wasps from hollow crannies drive,\n\u003cbr\u003e To guard the entrance of their common hive,\n\u003cbr\u003e Darkening the rock, while with unwearied wings\n\u003cbr\u003e They strike the assailants, and infix their stings;\n\u003cbr\u003e A race determined, that to death contend:\n\u003cbr\u003e So fierce these Greeks their last retreats defend.\n\u003cbr\u003e Gods! shall two warriors only guard their gates,\n\u003cbr\u003e Repel an army, and defraud the fates?\"\n\u003cbr\u003e These empty accents mingled with the wind,\n\u003cbr\u003e Nor moved great Jove\u0027s unalterable mind;\n\u003cbr\u003e [pg 222]\n\u003cbr\u003e To godlike Hector and his matchless might\n\u003cbr\u003e Was owed the glory of the destined fight.\n\u003cbr\u003e Like deeds of arms through all the forts were tried,\n\u003cbr\u003e And all the gates sustain\u0027d an equal tide;\n\u003cbr\u003e Through the long walls the stony showers were heard,\n\u003cbr\u003e The blaze of flames, the flash of arms appear\u0027d.\n\u003cbr\u003e The spirit of a god my breast inspire,\n\u003cbr\u003e To raise each act to life, and sing with fire!\n\u003cbr\u003e While Greece unconquer\u0027d kept alive the war,\n\u003cbr\u003e Secure of death, confiding in despair;\n\u003cbr\u003e And all her guardian gods, in deep dismay,\n\u003cbr\u003e With unassisting arms deplored the day.\n\u003cbr\u003e Even yet the dauntless Lapithae maintain\n\u003cbr\u003e The dreadful pass, and round them heap the slain.\n\u003cbr\u003e First Damasus, by Polypoetes\u0027 steel,\n\u003cbr\u003e Pierced through his helmet\u0027s brazen visor, fell;\n\u003cbr\u003e The weapon drank the mingled brains and gore!\n\u003cbr\u003e The warrior sinks, tremendous now no more!\n\u003cbr\u003e Next Ormenus and Pylon yield their breath:\n\u003cbr\u003e Nor less Leonteus strews the field with death;\n\u003cbr\u003e First through the belt Hippomachus he gored,\n\u003cbr\u003e Then sudden waved his unresisted sword:\n\u003cbr\u003e Antiphates, as through the ranks he broke,\n\u003cbr\u003e The falchion struck, and fate pursued the stroke:\n\u003cbr\u003e Iamenus, Orestes, Menon, bled;\n\u003cbr\u003e And round him rose a monument of dead.\n\u003cbr\u003e Meantime, the bravest of the Trojan crew,\n\u003cbr\u003e Bold Hector and Polydamas, pursue;\n\u003cbr\u003e Fierce with impatience on the works to fall,\n\u003cbr\u003e And wrap in rolling flames the fleet and wall.\n\u003cbr\u003e These on the farther bank now stood and gazed,\n\u003cbr\u003e By Heaven alarm\u0027d, by prodigies amazed:\n\u003cbr\u003e A signal omen stopp\u0027d the passing host,\n\u003cbr\u003e Their martial fury in their wonder lost.\n\u003cbr\u003e Jove\u0027s bird on sounding pinions beat the skies;\n\u003cbr\u003e A bleeding serpent of enormous size,\n\u003cbr\u003e His talons truss\u0027d; alive, and curling round,\n\u003cbr\u003e He stung the bird, whose throat received the wound:\n\u003cbr\u003e Mad with the smart, he drops the fatal prey,\n\u003cbr\u003e In airy circles wings his painful way,\n\u003cbr\u003e Floats on the winds, and rends the heaven with cries:\n\u003cbr\u003e Amidst the host the fallen serpent lies.\n\u003cbr\u003e They, pale with terror, mark its spires unroll\u0027d,\n\u003cbr\u003e And Jove\u0027s portent with beating hearts behold.\n\u003cbr\u003e Then first Polydamas the silence broke,\n\u003cbr\u003e Long weigh\u0027d the signal, and to Hector spoke:\n\u003cbr\u003e \"How oft, my brother, thy reproach I bear,\n\u003cbr\u003e For words well meant, and sentiments sincere?\n\u003cbr\u003e True to those counsels which I judge the best,\n\u003cbr\u003e I tell the faithful dictates of my breast.\n\u003cbr\u003e [pg 223]\n\u003cbr\u003e To speak his thoughts is every freeman\u0027s right,\n\u003cbr\u003e In peace, in war, in council, and in fight;\n\u003cbr\u003e And all I move, deferring to thy sway,\n\u003cbr\u003e But tends to raise that power which I obey.\n\u003cbr\u003e Then hear my words, nor may my words be vain!\n\u003cbr\u003e Seek not this day the Grecian ships to gain;\n\u003cbr\u003e For sure, to warn us, Jove his omen sent,\n\u003cbr\u003e And thus my mind explains its clear event:\n\u003cbr\u003e The victor eagle, whose sinister flight\n\u003cbr\u003e Retards our host, and fills our hearts with fright,\n\u003cbr\u003e Dismiss\u0027d his conquest in the middle skies,\n\u003cbr\u003e Allow\u0027d to seize, but not possess the prize;\n\u003cbr\u003e Thus, though we gird with fires the Grecian fleet,\n\u003cbr\u003e Though these proud bulwalks tumble at our feet,\n\u003cbr\u003e Toils unforeseen, and fiercer, are decreed;\n\u003cbr\u003e More woes shall follow, and more heroes bleed.\n\u003cbr\u003e So bodes my soul, and bids me thus advise;\n\u003cbr\u003e For thus a skilful seer would read the skies.\"\n\u003cbr\u003e To him then Hector with disdain return\u0027d:\n\u003cbr\u003e (Fierce as he spoke, his eyes with fury burn\u0027d:)\n\u003cbr\u003e \"Are these the faithful counsels of thy tongue?\n\u003cbr\u003e Thy will is partial, not thy reason wrong:\n\u003cbr\u003e Or if the purpose of thy heart thou vent,\n\u003cbr\u003e Sure heaven resumes the little sense it lent.\n\u003cbr\u003e What coward counsels would thy madness move\n\u003cbr\u003e Against the word, the will reveal\u0027d of Jove?\n\u003cbr\u003e The leading sign, the irrevocable nod,\n\u003cbr\u003e And happy thunders of the favouring god,\n\u003cbr\u003e These shall I slight, and guide my wavering mind\n\u003cbr\u003e By wandering birds that flit with every wind?\n\u003cbr\u003e Ye vagrants of the sky! your wings extend,\n\u003cbr\u003e Or where the suns arise, or where descend;\n\u003cbr\u003e To right, to left, unheeded take your way,\n\u003cbr\u003e While I the dictates of high heaven obey.\n\u003cbr\u003e Without a sign his sword the brave man draws,\n\u003cbr\u003e And asks no omen but his country\u0027s cause.\n\u003cbr\u003e But why should\u0027st thou suspect the war\u0027s success?\n\u003cbr\u003e None fears it more, as none promotes it less:\n\u003cbr\u003e Though all our chiefs amidst yon ships expire,\n\u003cbr\u003e Trust thy own cowardice to escape their fire.\n\u003cbr\u003e Troy and her sons may find a general grave,\n\u003cbr\u003e But thou canst live, for thou canst be a slave.\n\u003cbr\u003e Yet should the fears that wary mind suggests\n\u003cbr\u003e Spread their cold poison through our soldiers\u0027 breasts,\n\u003cbr\u003e My javelin can revenge so base a part,\n\u003cbr\u003e And free the soul that quivers in thy heart.\"\n\u003cbr\u003e Furious he spoke, and, rushing to the wall,\n\u003cbr\u003e Calls on his host; his host obey the call;\n\u003cbr\u003e With ardour follow where their leader flies:\n\u003cbr\u003e Redoubling clamours thunder in the skies.\n\u003cbr\u003e [pg 224]\n\u003cbr\u003e Jove breathes a whirlwind from the hills of Ide,\n\u003cbr\u003e And drifts of dust the clouded navy hide;\n\u003cbr\u003e He fills the Greeks with terror and dismay,\n\u003cbr\u003e And gives great Hector the predestined day.\n\u003cbr\u003e Strong in themselves, but stronger in his aid,\n\u003cbr\u003e Close to the works their rigid siege they laid.\n\u003cbr\u003e In vain the mounds and massy beams defend,\n\u003cbr\u003e While these they undermine, and those they rend;\n\u003cbr\u003e Upheaved the piles that prop the solid wall;\n\u003cbr\u003e And heaps on heaps the smoky ruins fall.\n\u003cbr\u003e Greece on her ramparts stands the fierce alarms;\n\u003cbr\u003e The crowded bulwarks blaze with waving arms,\n\u003cbr\u003e Shield touching shield, a long refulgent row;\n\u003cbr\u003e Whence hissing darts, incessant, rain below.\n\u003cbr\u003e The bold Ajaces fly from tower to tower,\n\u003cbr\u003e And rouse, with flame divine, the Grecian power.\n\u003cbr\u003e The generous impulse every Greek obeys;\n\u003cbr\u003e Threats urge the fearful; and the valiant, praise.\n\u003cbr\u003e \"Fellows in arms! whose deeds are known to fame,\n\u003cbr\u003e And you, whose ardour hopes an equal name!\n\u003cbr\u003e Since not alike endued with force or art;\n\u003cbr\u003e Behold a day when each may act his part!\n\u003cbr\u003e A day to fire the brave, and warm the cold,\n\u003cbr\u003e To gain new glories, or augment the old.\n\u003cbr\u003e Urge those who stand, and those who faint, excite;\n\u003cbr\u003e Drown Hector\u0027s vaunts in loud exhorts of fight;\n\u003cbr\u003e Conquest, not safety, fill the thoughts of all;\n\u003cbr\u003e Seek not your fleet, but sally from the wall;\n\u003cbr\u003e So Jove once more may drive their routed train,\n\u003cbr\u003e And Troy lie trembling in her walls again.\"\n\u003cbr\u003e Their ardour kindles all the Grecian powers;\n\u003cbr\u003e And now the stones descend in heavier showers.\n\u003cbr\u003e As when high Jove his sharp artillery forms,\n\u003cbr\u003e And opes his cloudy magazine of storms;\n\u003cbr\u003e In winter\u0027s bleak un comfortable reign,\n\u003cbr\u003e A snowy inundation hides the plain;\n\u003cbr\u003e He stills the winds, and bids the skies to sleep;\n\u003cbr\u003e Then pours the silent tempest thick and deep;\n\u003cbr\u003e And first the mountain-tops are cover\u0027d o\u0027er,\n\u003cbr\u003e Then the green fields, and then the sandy shore;\n\u003cbr\u003e Bent with the weight, the nodding woods are seen,\n\u003cbr\u003e And one bright waste hides all the works of men:\n\u003cbr\u003e The circling seas, alone absorbing all,\n\u003cbr\u003e Drink the dissolving fleeces as they fall:\n\u003cbr\u003e So from each side increased the stony rain,\n\u003cbr\u003e And the white ruin rises o\u0027er the plain.\n\u003cbr\u003e Thus godlike Hector and his troops contend\n\u003cbr\u003e To force the ramparts, and the gates to rend:\n\u003cbr\u003e Nor Troy could conquer, nor the Greeks would yield,\n\u003cbr\u003e Till great Sarpedon tower\u0027d amid the field;\n\u003cbr\u003e [pg 225]\n\u003cbr\u003e For mighty Jove inspired with martial flame\n\u003cbr\u003e His matchless son, and urged him on to fame.\n\u003cbr\u003e In arms he shines, conspicuous from afar,\n\u003cbr\u003e And bears aloft his ample shield in air;\n\u003cbr\u003e Within whose orb the thick bull-hides were roll\u0027d,\n\u003cbr\u003e Ponderous with brass, and bound with ductile gold:\n\u003cbr\u003e And while two pointed javelins arm his hands,\n\u003cbr\u003e Majestic moves along, and leads his Lycian bands.\n\u003cbr\u003e So press\u0027d with hunger, from the mountain\u0027s brow\n\u003cbr\u003e Descends a lion on the flocks below;\n\u003cbr\u003e So stalks the lordly savage o\u0027er the plain,\n\u003cbr\u003e In sullen majesty, and stern disdain:\n\u003cbr\u003e In vain loud mastiffs bay him from afar,\n\u003cbr\u003e And shepherds gall him with an iron war;\n\u003cbr\u003e Regardless, furious, he pursues his way;\n\u003cbr\u003e He foams, he roars, he rends the panting prey.\n\u003cbr\u003e Resolved alike, divine Sarpedon glows\n\u003cbr\u003e With generous rage that drives him on the foes.\n\u003cbr\u003e He views the towers, and meditates their fall,\n\u003cbr\u003e To sure destruction dooms the aspiring wall;\n\u003cbr\u003e Then casting on his friend an ardent look,\n\u003cbr\u003e Fired with the thirst of glory, thus he spoke:\n\u003cbr\u003e \"Why boast we, Glaucus! our extended reign,226\n\u003cbr\u003e Where Xanthus\u0027 streams enrich the Lycian plain,\n\u003cbr\u003e Our numerous herds that range the fruitful field,\n\u003cbr\u003e And hills where vines their purple harvest yield,\n\u003cbr\u003e Our foaming bowls with purer nectar crown\u0027d,\n\u003cbr\u003e Our feasts enhanced with music\u0027s sprightly sound?\n\u003cbr\u003e Why on those shores are we with joy survey\u0027d,\n\u003cbr\u003e Admired as heroes, and as gods obey\u0027d,\n\u003cbr\u003e Unless great acts superior merit prove,\n\u003cbr\u003e And vindicate the bounteous powers above?\n\u003cbr\u003e \u0027Tis ours, the dignity they give to grace;\n\u003cbr\u003e The first in valour, as the first in place;\n\u003cbr\u003e That when with wondering eyes our martial bands\n\u003cbr\u003e Behold our deeds transcending our commands,\n\u003cbr\u003e Such, they may cry, deserve the sovereign state,\n\u003cbr\u003e Whom those that envy dare not imitate!\n\u003cbr\u003e Could all our care elude the gloomy grave,\n\u003cbr\u003e Which claims no less the fearful and the brave,\n\u003cbr\u003e For lust of fame I should not vainly dare\n\u003cbr\u003e In fighting fields, nor urge thy soul to war.\n\u003cbr\u003e But since, alas! ignoble age must come,\n\u003cbr\u003e [pg 226]\n\u003cbr\u003e Disease, and death\u0027s inexorable doom\n\u003cbr\u003e The life, which others pay, let us bestow,\n\u003cbr\u003e And give to fame what we to nature owe;\n\u003cbr\u003e Brave though we fall, and honour\u0027d if we live,\n\u003cbr\u003e Or let us glory gain, or glory give!\"\n\u003cbr\u003e He said; his words the listening chief inspire\n\u003cbr\u003e With equal warmth, and rouse the warrior\u0027s fire;\n\u003cbr\u003e The troops pursue their leaders with delight,\n\u003cbr\u003e Rush to the foe, and claim the promised fight.\n\u003cbr\u003e Menestheus from on high the storm beheld\n\u003cbr\u003e Threatening the fort, and blackening in the field:\n\u003cbr\u003e Around the walls he gazed, to view from far\n\u003cbr\u003e What aid appear\u0027d to avert the approaching war,\n\u003cbr\u003e And saw where Teucer with the Ajaces stood,\n\u003cbr\u003e Of fight insatiate, prodigal of blood.\n\u003cbr\u003e In vain he calls; the din of helms and shields\n\u003cbr\u003e Rings to the skies, and echoes through the fields,\n\u003cbr\u003e The brazen hinges fly, the walls resound,\n\u003cbr\u003e Heaven trembles, roar the mountains, thunders all the ground\n\u003cbr\u003e Then thus to Thoos: \"Hence with speed (he said),\n\u003cbr\u003e And urge the bold Ajaces to our aid;\n\u003cbr\u003e Their strength, united, best may help to bear\n\u003cbr\u003e The bloody labours of the doubtful war:\n\u003cbr\u003e Hither the Lycian princes bend their course,\n\u003cbr\u003e The best and bravest of the hostile force.\n\u003cbr\u003e But if too fiercely there the foes contend,\n\u003cbr\u003e Let Telamon, at least, our towers defend,\n\u003cbr\u003e And Teucer haste with his unerring bow\n\u003cbr\u003e To share the danger, and repel the foe.\"\n\u003cbr\u003e Swift, at the word, the herald speeds along\n\u003cbr\u003e The lofty ramparts, through the martial throng,\n\u003cbr\u003e And finds the heroes bathed in sweat and gore,\n\u003cbr\u003e Opposed in combat on the dusty shore.\n\u003cbr\u003e \"Ye valiant leaders of our warlike bands!\n\u003cbr\u003e Your aid (said Thoos) Peteus\u0027 son demands;\n\u003cbr\u003e Your strength, united, best may help to bear\n\u003cbr\u003e The bloody labours of the doubtful war:\n\u003cbr\u003e Thither the Lycian princes bend their course,\n\u003cbr\u003e The best and bravest of the hostile force.\n\u003cbr\u003e But if too fiercely, here, the foes contend,\n\u003cbr\u003e At least, let Telamon those towers defend,\n\u003cbr\u003e And Teucer haste with his unerring bow\n\u003cbr\u003e To share the danger, and repel the foe.\"\n\u003cbr\u003e Straight to the fort great Ajax turn\u0027d his care,\n\u003cbr\u003e And thus bespoke his brothers of the war:\n\u003cbr\u003e \"Now, valiant Lycomede! exert your might,\n\u003cbr\u003e And, brave Oileus, prove your force in fight;\n\u003cbr\u003e To you I trust the fortune of the field,\n\u003cbr\u003e Till by this arm the foe shall be repell\u0027d:\n\u003cbr\u003e That done, expect me to complete the day\n\u003cbr\u003e [pg 227]\n\u003cbr\u003e Then with his sevenfold shield he strode away.\n\u003cbr\u003e With equal steps bold Teucer press\u0027d the shore,\n\u003cbr\u003e Whose fatal bow the strong Pandion bore.\n\u003cbr\u003e High on the walls appear\u0027d the Lycian powers,\n\u003cbr\u003e Like some black tempest gathering round the towers:\n\u003cbr\u003e The Greeks, oppress\u0027d, their utmost force unite,\n\u003cbr\u003e Prepared to labour in the unequal fight:\n\u003cbr\u003e The war renews, mix\u0027d shouts and groans arise;\n\u003cbr\u003e Tumultuous clamour mounts, and thickens in the skies.\n\u003cbr\u003e Fierce Ajax first the advancing host invades,\n\u003cbr\u003e And sends the brave Epicles to the shades,\n\u003cbr\u003e Sarpedon\u0027s friend. Across the warrior\u0027s way,\n\u003cbr\u003e Rent from the walls, a rocky fragment lay;\n\u003cbr\u003e In modern ages not the strongest swain\n\u003cbr\u003e Could heave the unwieldy burden from the plain:\n\u003cbr\u003e He poised, and swung it round; then toss\u0027d on high,\n\u003cbr\u003e It flew with force, and labour\u0027d up the sky;\n\u003cbr\u003e Full on the Lycian\u0027s helmet thundering down,\n\u003cbr\u003e The ponderous ruin crush\u0027d his batter\u0027d crown.\n\u003cbr\u003e As skilful divers from some airy steep\n\u003cbr\u003e Headlong descend, and shoot into the deep,\n\u003cbr\u003e So falls Epicles; then in groans expires,\n\u003cbr\u003e And murmuring to the shades the soul retires.\n\u003cbr\u003e While to the ramparts daring Glaucus drew,\n\u003cbr\u003e From Teucer\u0027s hand a winged arrow flew;\n\u003cbr\u003e The bearded shaft the destined passage found,\n\u003cbr\u003e And on his naked arm inflicts a wound.\n\u003cbr\u003e The chief, who fear\u0027d some foe\u0027s insulting boast\n\u003cbr\u003e Might stop the progress of his warlike host,\n\u003cbr\u003e Conceal\u0027d the wound, and, leaping from his height\n\u003cbr\u003e Retired reluctant from the unfinish\u0027d fight.\n\u003cbr\u003e Divine Sarpedon with regret beheld\n\u003cbr\u003e Disabled Glaucus slowly quit the field;\n\u003cbr\u003e His beating breast with generous ardour glows,\n\u003cbr\u003e He springs to fight, and flies upon the foes.\n\u003cbr\u003e Alcmaon first was doom\u0027d his force to feel;\n\u003cbr\u003e Deep in his breast he plunged the pointed steel;\n\u003cbr\u003e Then from the yawning wound with fury tore\n\u003cbr\u003e The spear, pursued by gushing streams of gore:\n\u003cbr\u003e Down sinks the warrior with a thundering sound,\n\u003cbr\u003e His brazen armour rings against the ground.\n\u003cbr\u003e Swift to the battlement the victor flies,\n\u003cbr\u003e Tugs with full force, and every nerve applies:\n\u003cbr\u003e It shakes; the ponderous stones disjointed yield;\n\u003cbr\u003e The rolling ruins smoke along the field.\n\u003cbr\u003e A mighty breach appears; the walls lie bare;\n\u003cbr\u003e And, like a deluge, rushes in the war.\n\u003cbr\u003e At once bold Teucer draws the twanging bow,\n\u003cbr\u003e And Ajax sends his javelin at the foe;\n\u003cbr\u003e Fix\u0027d in his belt the feather\u0027d weapon stood,\n\u003cbr\u003e [pg 228]\n\u003cbr\u003e And through his buckler drove the trembling wood;\n\u003cbr\u003e But Jove was present in the dire debate,\n\u003cbr\u003e To shield his offspring, and avert his fate.\n\u003cbr\u003e The prince gave back, not meditating flight,\n\u003cbr\u003e But urging vengeance, and severer fight;\n\u003cbr\u003e Then raised with hope, and fired with glory\u0027s charms,\n\u003cbr\u003e His fainting squadrons to new fury warms.\n\u003cbr\u003e \"O where, ye Lycians, is the strength you boast?\n\u003cbr\u003e Your former fame and ancient virtue lost!\n\u003cbr\u003e The breach lies open, but your chief in vain\n\u003cbr\u003e Attempts alone the guarded pass to gain:\n\u003cbr\u003e Unite, and soon that hostile fleet shall fall:\n\u003cbr\u003e The force of powerful union conquers all.\"\n\u003cbr\u003e This just rebuke inflamed the Lycian crew;\n\u003cbr\u003e They join, they thicken, and the assault renew:\n\u003cbr\u003e Unmoved the embodied Greeks their fury dare,\n\u003cbr\u003e And fix\u0027d support the weight of all the war;\n\u003cbr\u003e Nor could the Greeks repel the Lycian powers,\n\u003cbr\u003e Nor the bold Lycians force the Grecian towers.\n\u003cbr\u003e As on the confines of adjoining grounds,\n\u003cbr\u003e Two stubborn swains with blows dispute their bounds;\n\u003cbr\u003e They tug, they sweat; but neither gain, nor yield,\n\u003cbr\u003e One foot, one inch, of the contended field;\n\u003cbr\u003e Thus obstinate to death, they fight, they fall;\n\u003cbr\u003e Nor these can keep, nor those can win the wall.\n\u003cbr\u003e Their manly breasts are pierced with many a wound,\n\u003cbr\u003e Loud strokes are heard, and rattling arms resound;\n\u003cbr\u003e The copious slaughter covers all the shore,\n\u003cbr\u003e And the high ramparts drip with human gore.\n\u003cbr\u003e As when two scales are charged with doubtful loads,\n\u003cbr\u003e From side to side the trembling balance nods,\n\u003cbr\u003e (While some laborious matron, just and poor,\n\u003cbr\u003e With nice exactness weighs her woolly store,)\n\u003cbr\u003e Till poised aloft, the resting beam suspends\n\u003cbr\u003e Each equal weight; nor this, nor that, descends:227\n\u003cbr\u003e So stood the war, till Hector\u0027s matchless might,\n\u003cbr\u003e With fates prevailing, turn\u0027d the scale of fight.\n\u003cbr\u003e Fierce as a whirlwind up the walls he flies,\n\u003cbr\u003e And fires his host with loud repeated cries.\n\u003cbr\u003e \"Advance, ye Trojans! lend your valiant hands,\n\u003cbr\u003e Haste to the fleet, and toss the blazing brands!\"\n\u003cbr\u003e They hear, they run; and, gathering at his call,\n\u003cbr\u003e Raise scaling engines, and ascend the wall:\n\u003cbr\u003e Around the works a wood of glittering spears\n\u003cbr\u003e Shoots up, and all the rising host appears.\n\u003cbr\u003e A ponderous stone bold Hector heaved to throw,\n\u003cbr\u003e Pointed above, and rough and gross below:\n\u003cbr\u003e [pg 229]\n\u003cbr\u003e Not two strong men the enormous weight could raise,\n\u003cbr\u003e Such men as live in these degenerate days:\n\u003cbr\u003e Yet this, as easy as a swain could bear\n\u003cbr\u003e The snowy fleece, he toss\u0027d, and shook in air;\n\u003cbr\u003e For Jove upheld, and lighten\u0027d of its load\n\u003cbr\u003e The unwieldy rock, the labour of a god.\n\u003cbr\u003e Thus arm\u0027d, before the folded gates he came,\n\u003cbr\u003e Of massy substance, and stupendous frame;\n\u003cbr\u003e With iron bars and brazen hinges strong,\n\u003cbr\u003e On lofty beams of solid timber hung:\n\u003cbr\u003e Then thundering through the planks with forceful sway,\n\u003cbr\u003e Drives the sharp rock; the solid beams give way,\n\u003cbr\u003e The folds are shatter\u0027d; from the crackling door\n\u003cbr\u003e Leap the resounding bars, the flying hinges roar.\n\u003cbr\u003e Now rushing in, the furious chief appears,\n\u003cbr\u003e Gloomy as night! and shakes two shining spears:228\n\u003cbr\u003e A dreadful gleam from his bright armour came,\n\u003cbr\u003e And from his eye-balls flash\u0027d the living flame.\n\u003cbr\u003e He moves a god, resistless in his course,\n\u003cbr\u003e And seems a match for more than mortal force.\n\u003cbr\u003e Then pouring after, through the gaping space,\n\u003cbr\u003e A tide of Trojans flows, and fills the place;\n\u003cbr\u003e The Greeks behold, they tremble, and they fly;\n\u003cbr\u003e The shore is heap\u0027d with death, and tumult rends the sky.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: GREEK ALTAR.\n\u003cbr\u003e GREEK ALTAR.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/45999.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
