{"id":34777,"no":15,"title":"BOOK XIII.","content":"ARGUMENT.\n\u003cbr\u003e \n\u003cbr\u003e THE FOURTH BATTLE CONTINUED, IN WHICH NEPTUNE ASSISTS THE GREEKS: THE ACTS OF IDOMENEUS.\n\u003cbr\u003e \n\u003cbr\u003e Neptune, concerned for the loss of the Grecians, upon seeing the fortification forced by Hector, (who had entered the gate near the station of the Ajaces,) assumes the shape of Calchas, and inspires those heroes to oppose him: then, in the form of one of the generals, encourages the other Greeks who had retired to their vessels. The Ajaces form their troops in a close phalanx, and put a stop to Hector and the Trojans. Several deeds of valour are performed; Meriones, losing his spear in the encounter, repairs to seek another at the tent of Idomeneus: this occasions a conversation between those two warriors, who return together to the battle. Idomeneus signalizes his courage above the rest; he kills Othryoneus, Asius, and Alcathous: Deiphobus and ?neas march against him, and at length Idomeneus retires. Menelaus wounds Helenus, and kills Pisander. The Trojans are repulsed on the left wing; Hector still keeps his ground against the Ajaces, till, being galled by the Locrian slingers and archers, Polydamas advises to call a council of war: Hector approves of his advice, but goes first to rally the Trojans; upbraids Paris, rejoins Polydamas, meets Ajax again, and renews the attack.\n\u003cbr\u003e \n\u003cbr\u003e The eight-and-twentieth day still continues. The scene is between the Grecian wall and the sea-shore.\n\u003cbr\u003e When now the Thunderer on the sea-beat coast\n\u003cbr\u003e Had fix\u0027d great Hector and his conquering host,\n\u003cbr\u003e He left them to the fates, in bloody fray\n\u003cbr\u003e To toil and struggle through the well-fought day.\n\u003cbr\u003e Then turn\u0027d to Thracia from the field of fight\n\u003cbr\u003e Those eyes that shed insufferable light,\n\u003cbr\u003e To where the Mysians prove their martial force,\n\u003cbr\u003e And hardy Thracians tame the savage horse;\n\u003cbr\u003e And where the far-famed Hippomolgian strays,\n\u003cbr\u003e Renown\u0027d for justice and for length of days;229\n\u003cbr\u003e [pg 231]\n\u003cbr\u003e Thrice happy race! that, innocent of blood,\n\u003cbr\u003e From milk, innoxious, seek their simple food:\n\u003cbr\u003e Jove sees delighted; and avoids the scene\n\u003cbr\u003e Of guilty Troy, of arms, and dying men:\n\u003cbr\u003e No aid, he deems, to either host is given,\n\u003cbr\u003e While his high law suspends the powers of Heaven.\n\u003cbr\u003e Meantime the monarch of the watery main\n\u003cbr\u003e Observed the Thunderer, nor observed in vain.\n\u003cbr\u003e In Samothracia, on a mountain\u0027s brow,\n\u003cbr\u003e Whose waving woods o\u0027erhung the deeps below,\n\u003cbr\u003e He sat; and round him cast his azure eyes\n\u003cbr\u003e Where Ida\u0027s misty tops confusedly rise;\n\u003cbr\u003e Below, fair Ilion\u0027s glittering spires were seen;\n\u003cbr\u003e The crowded ships and sable seas between.\n\u003cbr\u003e There, from the crystal chambers of the main\n\u003cbr\u003e Emerged, he sat, and mourn\u0027d his Argives slain.\n\u003cbr\u003e At Jove incensed, with grief and fury stung,\n\u003cbr\u003e Prone down the rocky steep he rush\u0027d along;\n\u003cbr\u003e Fierce as he pass\u0027d, the lofty mountains nod,\n\u003cbr\u003e The forest shakes; earth trembled as he trod,\n\u003cbr\u003e And felt the footsteps of the immortal god.\n\u003cbr\u003e From realm to realm three ample strides he took,\n\u003cbr\u003e And, at the fourth, the distant ?gae shook.\n\u003cbr\u003e Far in the bay his shining palace stands,\n\u003cbr\u003e Eternal frame! not raised by mortal hands:\n\u003cbr\u003e This having reach\u0027d, his brass-hoof\u0027d steeds he reins,\n\u003cbr\u003e Fleet as the winds, and deck\u0027d with golden manes.\n\u003cbr\u003e Refulgent arms his mighty limbs infold,\n\u003cbr\u003e Immortal arms of adamant and gold.\n\u003cbr\u003e He mounts the car, the golden scourge applies,\n\u003cbr\u003e He sits superior, and the chariot flies:\n\u003cbr\u003e His whirling wheels the glassy surface sweep;\n\u003cbr\u003e The enormous monsters rolling o\u0027er the deep\n\u003cbr\u003e Gambol around him on the watery way,\n\u003cbr\u003e And heavy whales in awkward measures play;\n\u003cbr\u003e The sea subsiding spreads a level plain,\n\u003cbr\u003e Exults, and owns the monarch of the main;\n\u003cbr\u003e The parting waves before his coursers fly;\n\u003cbr\u003e The wondering waters leave his axle dry.\n\u003cbr\u003e Deep in the liquid regions lies a cave,\n\u003cbr\u003e Between where Tenedos the surges lave,\n\u003cbr\u003e And rocky Imbrus breaks the rolling wave:\n\u003cbr\u003e There the great ruler of the azure round\n\u003cbr\u003e Stopp\u0027d his swift chariot, and his steeds unbound,\n\u003cbr\u003e Fed with ambrosial herbage from his hand,\n\u003cbr\u003e And link\u0027d their fetlocks with a golden band,\n\u003cbr\u003e Infrangible, immortal: there they stay:\n\u003cbr\u003e The father of the floods pursues his way:\n\u003cbr\u003e Where, like a tempest, darkening heaven around,\n\u003cbr\u003e Or fiery deluge that devours the ground,\n\u003cbr\u003e [pg 232]\n\u003cbr\u003e The impatient Trojans, in a gloomy throng,\n\u003cbr\u003e Embattled roll\u0027d, as Hector rush\u0027d along:\n\u003cbr\u003e To the loud tumult and the barbarous cry\n\u003cbr\u003e The heavens re-echo, and the shores reply:\n\u003cbr\u003e They vow destruction to the Grecian name,\n\u003cbr\u003e And in their hopes the fleets already flame.\n\u003cbr\u003e But Neptune, rising from the seas profound,\n\u003cbr\u003e The god whose earthquakes rock the solid ground,\n\u003cbr\u003e Now wears a mortal form; like Calchas seen,\n\u003cbr\u003e Such his loud voice, and such his manly mien;\n\u003cbr\u003e His shouts incessant every Greek inspire,\n\u003cbr\u003e But most the Ajaces, adding fire to fire.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: NEPTUNE RISING FROM THE SEA.\n\u003cbr\u003e NEPTUNE RISING FROM THE SEA.\n\u003cbr\u003e \"\u0027Tis yours, O warriors, all our hopes to raise:\n\u003cbr\u003e Oh recollect your ancient worth and praise!\n\u003cbr\u003e \u0027Tis yours to save us, if you cease to fear;\n\u003cbr\u003e Flight, more than shameful, is destructive here.\n\u003cbr\u003e On other works though Troy with fury fall,\n\u003cbr\u003e And pour her armies o\u0027er our batter\u0027d wall:\n\u003cbr\u003e There Greece has strength: but this, this part o\u0027erthrown,\n\u003cbr\u003e Her strength were vain; I dread for you alone:\n\u003cbr\u003e Here Hector rages like the force of fire,\n\u003cbr\u003e Vaunts of his gods, and calls high Jove his sire:\n\u003cbr\u003e If yet some heavenly power your breast excite,\n\u003cbr\u003e Breathe in your hearts, and string your arms to fight,\n\u003cbr\u003e Greece yet may live, her threaten\u0027d fleet maintain:\n\u003cbr\u003e And Hector\u0027s force, and Jove\u0027s own aid, be vain.\"\n\u003cbr\u003e Then with his sceptre, that the deep controls,\n\u003cbr\u003e He touch\u0027d the chiefs, and steel\u0027d their manly souls:\n\u003cbr\u003e Strength, not their own, the touch divine imparts,\n\u003cbr\u003e [pg 233]\n\u003cbr\u003e Prompts their light limbs, and swells their daring hearts.\n\u003cbr\u003e Then, as a falcon from the rocky height,\n\u003cbr\u003e Her quarry seen, impetuous at the sight,\n\u003cbr\u003e Forth-springing instant, darts herself from high,\n\u003cbr\u003e Shoots on the wing, and skims along the sky:\n\u003cbr\u003e Such, and so swift, the power of ocean flew;\n\u003cbr\u003e The wide horizon shut him from their view.\n\u003cbr\u003e The inspiring god Oileus\u0027 active son\n\u003cbr\u003e Perceived the first, and thus to Telamon:\n\u003cbr\u003e \"Some god, my friend, some god in human form\n\u003cbr\u003e Favouring descends, and wills to stand the storm.\n\u003cbr\u003e Not Calchas this, the venerable seer;\n\u003cbr\u003e Short as he turned, I saw the power appear:\n\u003cbr\u003e I mark\u0027d his parting, and the steps he trod;\n\u003cbr\u003e His own bright evidence reveals a god.\n\u003cbr\u003e Even now some energy divine I share,\n\u003cbr\u003e And seem to walk on wings, and tread in air!\"\n\u003cbr\u003e \"With equal ardour (Telamon returns)\n\u003cbr\u003e My soul is kindled, and my bosom burns;\n\u003cbr\u003e New rising spirits all my force alarm,\n\u003cbr\u003e Lift each impatient limb, and brace my arm.\n\u003cbr\u003e This ready arm, unthinking, shakes the dart;\n\u003cbr\u003e The blood pours back, and fortifies my heart:\n\u003cbr\u003e Singly, methinks, yon towering chief I meet,\n\u003cbr\u003e And stretch the dreadful Hector at my feet.\"\n\u003cbr\u003e Full of the god that urged their burning breast,\n\u003cbr\u003e The heroes thus their mutual warmth express\u0027d.\n\u003cbr\u003e Neptune meanwhile the routed Greeks inspired;\n\u003cbr\u003e Who, breathless, pale, with length of labours tired,\n\u003cbr\u003e Pant in the ships; while Troy to conquest calls,\n\u003cbr\u003e And swarms victorious o\u0027er their yielding walls:\n\u003cbr\u003e Trembling before the impending storm they lie,\n\u003cbr\u003e While tears of rage stand burning in their eye.\n\u003cbr\u003e Greece sunk they thought, and this their fatal hour;\n\u003cbr\u003e But breathe new courage as they feel the power.\n\u003cbr\u003e Teucer and Leitus first his words excite;\n\u003cbr\u003e Then stern Peneleus rises to the fight;\n\u003cbr\u003e Thoas, Deipyrus, in arms renown\u0027d,\n\u003cbr\u003e And Merion next, the impulsive fury found;\n\u003cbr\u003e Last Nestor\u0027s son the same bold ardour takes,\n\u003cbr\u003e While thus the god the martial fire awakes:\n\u003cbr\u003e \"Oh lasting infamy, oh dire disgrace\n\u003cbr\u003e To chiefs of vigorous youth, and manly race!\n\u003cbr\u003e I trusted in the gods, and you, to see\n\u003cbr\u003e Brave Greece victorious, and her navy free:\n\u003cbr\u003e Ah, no—the glorious combat you disclaim,\n\u003cbr\u003e And one black day clouds all her former fame.\n\u003cbr\u003e Heavens! what a prodigy these eyes survey,\n\u003cbr\u003e Unseen, unthought, till this amazing day!\n\u003cbr\u003e Fly we at length from Troy\u0027s oft-conquer\u0027d bands?\n\u003cbr\u003e [pg 234]\n\u003cbr\u003e And falls our fleet by such inglorious hands?\n\u003cbr\u003e A rout undisciplined, a straggling train,\n\u003cbr\u003e Not born to glories of the dusty plain;\n\u003cbr\u003e Like frighted fawns from hill to hill pursued,\n\u003cbr\u003e A prey to every savage of the wood:\n\u003cbr\u003e Shall these, so late who trembled at your name,\n\u003cbr\u003e Invade your camps, involve your ships in flame?\n\u003cbr\u003e A change so shameful, say, what cause has wrought?\n\u003cbr\u003e The soldiers\u0027 baseness, or the general\u0027s fault?\n\u003cbr\u003e Fools! will ye perish for your leader\u0027s vice;\n\u003cbr\u003e The purchase infamy, and life the price?\n\u003cbr\u003e \u0027Tis not your cause, Achilles\u0027 injured fame:\n\u003cbr\u003e Another\u0027s is the crime, but yours the shame.\n\u003cbr\u003e Grant that our chief offend through rage or lust,\n\u003cbr\u003e Must you be cowards, if your king\u0027s unjust?\n\u003cbr\u003e Prevent this evil, and your country save:\n\u003cbr\u003e Small thought retrieves the spirits of the brave.\n\u003cbr\u003e Think, and subdue! on dastards dead to fame\n\u003cbr\u003e I waste no anger, for they feel no shame:\n\u003cbr\u003e But you, the pride, the flower of all our host,\n\u003cbr\u003e My heart weeps blood to see your glory lost!\n\u003cbr\u003e Nor deem this day, this battle, all you lose;\n\u003cbr\u003e A day more black, a fate more vile, ensues.\n\u003cbr\u003e Let each reflect, who prizes fame or breath,\n\u003cbr\u003e On endless infamy, on instant death:\n\u003cbr\u003e For, lo! the fated time, the appointed shore:\n\u003cbr\u003e Hark! the gates burst, the brazen barriers roar!\n\u003cbr\u003e Impetuous Hector thunders at the wall;\n\u003cbr\u003e The hour, the spot, to conquer, or to fall.\"\n\u003cbr\u003e These words the Grecians\u0027 fainting hearts inspire,\n\u003cbr\u003e And listening armies catch the godlike fire.\n\u003cbr\u003e Fix\u0027d at his post was each bold Ajax found,\n\u003cbr\u003e With well-ranged squadrons strongly circled round:\n\u003cbr\u003e So close their order, so disposed their fight,\n\u003cbr\u003e As Pallas\u0027 self might view with fix\u0027d delight;\n\u003cbr\u003e Or had the god of war inclined his eyes,\n\u003cbr\u003e The god of war had own\u0027d a just surprise.\n\u003cbr\u003e A chosen phalanx, firm, resolved as fate,\n\u003cbr\u003e Descending Hector and his battle wait.\n\u003cbr\u003e An iron scene gleams dreadful o\u0027er the fields,\n\u003cbr\u003e Armour in armour lock\u0027d, and shields in shields,\n\u003cbr\u003e Spears lean on spears, on targets targets throng,\n\u003cbr\u003e Helms stuck to helms, and man drove man along.\n\u003cbr\u003e The floating plumes unnumber\u0027d wave above,\n\u003cbr\u003e As when an earthquake stirs the nodding grove;\n\u003cbr\u003e And levell\u0027d at the skies with pointing rays,\n\u003cbr\u003e Their brandish\u0027d lances at each motion blaze.\n\u003cbr\u003e Thus breathing death, in terrible array,\n\u003cbr\u003e The close compacted legions urged their way:\n\u003cbr\u003e Fierce they drove on, impatient to destroy;\n\u003cbr\u003e [pg 235]\n\u003cbr\u003e Troy charged the first, and Hector first of Troy.\n\u003cbr\u003e As from some mountain\u0027s craggy forehead torn,\n\u003cbr\u003e A rock\u0027s round fragment flies, with fury borne,\n\u003cbr\u003e (Which from the stubborn stone a torrent rends,)\n\u003cbr\u003e Precipitate the ponderous mass descends:\n\u003cbr\u003e From steep to steep the rolling ruin bounds;\n\u003cbr\u003e At every shock the crackling wood resounds;\n\u003cbr\u003e Still gathering force, it smokes; and urged amain,\n\u003cbr\u003e Whirls, leaps, and thunders down, impetuous to the plain:\n\u003cbr\u003e There stops—so Hector. Their whole force he proved,230\n\u003cbr\u003e Resistless when he raged, and, when he stopp\u0027d, unmoved.\n\u003cbr\u003e On him the war is bent, the darts are shed,\n\u003cbr\u003e And all their falchions wave around his head:\n\u003cbr\u003e Repulsed he stands, nor from his stand retires;\n\u003cbr\u003e But with repeated shouts his army fires.\n\u003cbr\u003e \"Trojans! be firm; this arm shall make your way\n\u003cbr\u003e Through yon square body, and that black array:\n\u003cbr\u003e Stand, and my spear shall rout their scattering power,\n\u003cbr\u003e Strong as they seem, embattled like a tower;\n\u003cbr\u003e For he that Juno\u0027s heavenly bosom warms,\n\u003cbr\u003e The first of gods, this day inspires our arms.\"\n\u003cbr\u003e He said; and roused the soul in every breast:\n\u003cbr\u003e Urged with desire of fame, beyond the rest,\n\u003cbr\u003e Forth march\u0027d Deiphobus; but, marching, held\n\u003cbr\u003e Before his wary steps his ample shield.\n\u003cbr\u003e Bold Merion aim\u0027d a stroke (nor aim\u0027d it wide);\n\u003cbr\u003e The glittering javelin pierced the tough bull-hide;\n\u003cbr\u003e But pierced not through: unfaithful to his hand,\n\u003cbr\u003e The point broke short, and sparkled in the sand.\n\u003cbr\u003e The Trojan warrior, touch\u0027d with timely fear,\n\u003cbr\u003e On the raised orb to distance bore the spear.\n\u003cbr\u003e The Greek, retreating, mourn\u0027d his frustrate blow,\n\u003cbr\u003e And cursed the treacherous lance that spared a foe;\n\u003cbr\u003e Then to the ships with surly speed he went,\n\u003cbr\u003e To seek a surer javelin in his tent.\n\u003cbr\u003e Meanwhile with rising rage the battle glows,\n\u003cbr\u003e The tumult thickens, and the clamour grows.\n\u003cbr\u003e By Teucer\u0027s arm the warlike Imbrius bleeds,\n\u003cbr\u003e The son of Mentor, rich in generous steeds.\n\u003cbr\u003e Ere yet to Troy the sons of Greece were led,\n\u003cbr\u003e In fair Pedaeus\u0027 verdant pastures bred,\n\u003cbr\u003e The youth had dwelt, remote from war\u0027s alarms,\n\u003cbr\u003e And blest in bright Medesicaste\u0027s arms:\n\u003cbr\u003e (This nymph, the fruit of Priam\u0027s ravish\u0027d joy,\n\u003cbr\u003e [pg 236]\n\u003cbr\u003e Allied the warrior to the house of Troy:)\n\u003cbr\u003e To Troy, when glory call\u0027d his arms, he came,\n\u003cbr\u003e And match\u0027d the bravest of her chiefs in fame:\n\u003cbr\u003e With Priam\u0027s sons, a guardian of the throne,\n\u003cbr\u003e He lived, beloved and honour\u0027d as his own.\n\u003cbr\u003e Him Teucer pierced between the throat and ear:\n\u003cbr\u003e He groans beneath the Telamonian spear.\n\u003cbr\u003e As from some far-seen mountain\u0027s airy crown,\n\u003cbr\u003e Subdued by steel, a tall ash tumbles down,\n\u003cbr\u003e And soils its verdant tresses on the ground;\n\u003cbr\u003e So falls the youth; his arms the fall resound.\n\u003cbr\u003e Then Teucer rushing to despoil the dead,\n\u003cbr\u003e From Hector\u0027s hand a shining javelin fled:\n\u003cbr\u003e He saw, and shunn\u0027d the death; the forceful dart\n\u003cbr\u003e Sung on, and pierced Amphimachus\u0027s heart,\n\u003cbr\u003e Cteatus\u0027 son, of Neptune\u0027s forceful line;\n\u003cbr\u003e Vain was his courage, and his race divine!\n\u003cbr\u003e Prostrate he falls; his clanging arms resound,\n\u003cbr\u003e And his broad buckler thunders on the ground.\n\u003cbr\u003e To seize his beamy helm the victor flies,\n\u003cbr\u003e And just had fastened on the dazzling prize,\n\u003cbr\u003e When Ajax\u0027 manly arm a javelin flung;\n\u003cbr\u003e Full on the shield\u0027s round boss the weapon rung;\n\u003cbr\u003e He felt the shock, nor more was doom\u0027d to feel,\n\u003cbr\u003e Secure in mail, and sheath\u0027d in shining steel.\n\u003cbr\u003e Repulsed he yields; the victor Greeks obtain\n\u003cbr\u003e The spoils contested, and bear off the slain.\n\u003cbr\u003e Between the leaders of the Athenian line,\n\u003cbr\u003e (Stichius the brave, Menestheus the divine,)\n\u003cbr\u003e Deplored Amphimachus, sad object! lies;\n\u003cbr\u003e Imbrius remains the fierce Ajaces\u0027 prize.\n\u003cbr\u003e As two grim lions bear across the lawn,\n\u003cbr\u003e Snatch\u0027d from devouring hounds, a slaughter\u0027d fawn.\n\u003cbr\u003e In their fell jaws high-lifting through the wood,\n\u003cbr\u003e And sprinkling all the shrubs with drops of blood;\n\u003cbr\u003e So these, the chief: great Ajax from the dead\n\u003cbr\u003e Strips his bright arms; Oileus lops his head:\n\u003cbr\u003e Toss\u0027d like a ball, and whirl\u0027d in air away,\n\u003cbr\u003e At Hector\u0027s feet the gory visage lay.\n\u003cbr\u003e The god of ocean, fired with stern disdain,\n\u003cbr\u003e And pierced with sorrow for his grandson slain,\n\u003cbr\u003e Inspires the Grecian hearts, confirms their hands,\n\u003cbr\u003e And breathes destruction on the Trojan bands.\n\u003cbr\u003e Swift as a whirlwind rushing to the fleet,\n\u003cbr\u003e He finds the lance-famed Idomen of Crete,\n\u003cbr\u003e His pensive brow the generous care express\u0027d\n\u003cbr\u003e With which a wounded soldier touch\u0027d his breast,\n\u003cbr\u003e Whom in the chance of war a javelin tore,\n\u003cbr\u003e And his sad comrades from the battle bore;\n\u003cbr\u003e Him to the surgeons of the camp he sent:\n\u003cbr\u003e [pg 237]\n\u003cbr\u003e That office paid, he issued from his tent\n\u003cbr\u003e Fierce for the fight: to whom the god begun,\n\u003cbr\u003e In Thoas\u0027 voice, Andraemon\u0027s valiant son,\n\u003cbr\u003e Who ruled where Calydon\u0027s white rocks arise,\n\u003cbr\u003e And Pleuron\u0027s chalky cliffs emblaze the skies:\n\u003cbr\u003e \"Where\u0027s now the imperious vaunt, the daring boast,\n\u003cbr\u003e Of Greece victorious, and proud Ilion lost?\"\n\u003cbr\u003e To whom the king: \"On Greece no blame be thrown;\n\u003cbr\u003e Arms are her trade, and war is all her own.\n\u003cbr\u003e Her hardy heroes from the well-fought plains\n\u003cbr\u003e Nor fear withholds, nor shameful sloth detains:\n\u003cbr\u003e \u0027Tis heaven, alas! and Jove\u0027s all-powerful doom,\n\u003cbr\u003e That far, far distant from our native home\n\u003cbr\u003e Wills us to fall inglorious! Oh, my friend!\n\u003cbr\u003e Once foremost in the fight, still prone to lend\n\u003cbr\u003e Or arms or counsels, now perform thy best,\n\u003cbr\u003e And what thou canst not singly, urge the rest.\"\n\u003cbr\u003e Thus he: and thus the god whose force can make\n\u003cbr\u003e The solid globe\u0027s eternal basis shake:\n\u003cbr\u003e \"Ah! never may he see his native land,\n\u003cbr\u003e But feed the vultures on this hateful strand,\n\u003cbr\u003e Who seeks ignobly in his ships to stay,\n\u003cbr\u003e Nor dares to combat on this signal day!\n\u003cbr\u003e For this, behold! in horrid arms I shine,\n\u003cbr\u003e And urge thy soul to rival acts with mine.\n\u003cbr\u003e Together let us battle on the plain;\n\u003cbr\u003e Two, not the worst; nor even this succour vain:\n\u003cbr\u003e Not vain the weakest, if their force unite;\n\u003cbr\u003e But ours, the bravest have confess\u0027d in fight.\"\n\u003cbr\u003e This said, he rushes where the combat burns;\n\u003cbr\u003e Swift to his tent the Cretan king returns:\n\u003cbr\u003e From thence, two javelins glittering in his hand,\n\u003cbr\u003e And clad in arms that lighten\u0027d all the strand,\n\u003cbr\u003e Fierce on the foe the impetuous hero drove,\n\u003cbr\u003e Like lightning bursting from the arm of Jove,\n\u003cbr\u003e Which to pale man the wrath of heaven declares,\n\u003cbr\u003e Or terrifies the offending world with wars;\n\u003cbr\u003e In streamy sparkles, kindling all the skies,\n\u003cbr\u003e From pole to pole the trail of glory flies:\n\u003cbr\u003e Thus his bright armour o\u0027er the dazzled throng\n\u003cbr\u003e Gleam\u0027d dreadful, as the monarch flash\u0027d along.\n\u003cbr\u003e Him, near his tent, Meriones attends;\n\u003cbr\u003e Whom thus he questions: \"Ever best of friends!\n\u003cbr\u003e O say, in every art of battle skill\u0027d,\n\u003cbr\u003e What holds thy courage from so brave a field?\n\u003cbr\u003e On some important message art thou bound,\n\u003cbr\u003e Or bleeds my friend by some unhappy wound?\n\u003cbr\u003e Inglorious here, my soul abhors to stay,\n\u003cbr\u003e And glows with prospects of th\u0027 approaching day.\"\n\u003cbr\u003e \"O prince! (Meriones replies) whose care\n\u003cbr\u003e [pg 238]\n\u003cbr\u003e Leads forth the embattled sons of Crete to war;\n\u003cbr\u003e This speaks my grief: this headless lance I wield;\n\u003cbr\u003e The rest lies rooted in a Trojan shield.\"\n\u003cbr\u003e To whom the Cretan: \"Enter, and receive\n\u003cbr\u003e The wonted weapons; those my tent can give;\n\u003cbr\u003e Spears I have store, (and Trojan lances all,)\n\u003cbr\u003e That shed a lustre round the illumined wall,\n\u003cbr\u003e Though I, disdainful of the distant war,\n\u003cbr\u003e Nor trust the dart, nor aim the uncertain spear,\n\u003cbr\u003e Yet hand to hand I fight, and spoil the slain;\n\u003cbr\u003e And thence these trophies, and these arms I gain.\n\u003cbr\u003e Enter, and see on heaps the helmets roll\u0027d,\n\u003cbr\u003e And high-hung spears, and shields that flame with gold.\"\n\u003cbr\u003e \"Nor vain (said Merion) are our martial toils;\n\u003cbr\u003e We too can boast of no ignoble spoils:\n\u003cbr\u003e But those my ship contains; whence distant far,\n\u003cbr\u003e I fight conspicuous in the van of war,\n\u003cbr\u003e What need I more? If any Greek there be\n\u003cbr\u003e Who knows not Merion, I appeal to thee.\"\n\u003cbr\u003e To this, Idomeneus: \"The fields of fight\n\u003cbr\u003e Have proved thy valour, and unconquer\u0027d might:\n\u003cbr\u003e And were some ambush for the foes design\u0027d,\n\u003cbr\u003e Even there thy courage would not lag behind:\n\u003cbr\u003e In that sharp service, singled from the rest,\n\u003cbr\u003e The fear of each, or valour, stands confess\u0027d.\n\u003cbr\u003e No force, no firmness, the pale coward shows;\n\u003cbr\u003e He shifts his place: his colour comes and goes:\n\u003cbr\u003e A dropping sweat creeps cold on every part;\n\u003cbr\u003e Against his bosom beats his quivering heart;\n\u003cbr\u003e Terror and death in his wild eye-balls stare;\n\u003cbr\u003e With chattering teeth he stands, and stiffening hair,\n\u003cbr\u003e And looks a bloodless image of despair!\n\u003cbr\u003e Not so the brave—still dauntless, still the same,\n\u003cbr\u003e Unchanged his colour, and unmoved his frame:\n\u003cbr\u003e Composed his thought, determined is his eye,\n\u003cbr\u003e And fix\u0027d his soul, to conquer or to die:\n\u003cbr\u003e If aught disturb the tenour of his breast,\n\u003cbr\u003e \u0027Tis but the wish to strike before the rest.\n\u003cbr\u003e \"In such assays thy blameless worth is known,\n\u003cbr\u003e And every art of dangerous war thy own.\n\u003cbr\u003e By chance of fight whatever wounds you bore,\n\u003cbr\u003e Those wounds were glorious all, and all before;\n\u003cbr\u003e Such as may teach, \u0027twas still thy brave delight\n\u003cbr\u003e T\u0027oppose thy bosom where thy foremost fight.\n\u003cbr\u003e But why, like infants, cold to honour\u0027s charms,\n\u003cbr\u003e Stand we to talk, when glory calls to arms?\n\u003cbr\u003e Go—from my conquer\u0027d spears the choicest take,\n\u003cbr\u003e And to their owners send them nobly back.\"\n\u003cbr\u003e Swift at the word bold Merion snatch\u0027d a spear\n\u003cbr\u003e And, breathing slaughter, follow\u0027d to the war.\n\u003cbr\u003e [pg 239]\n\u003cbr\u003e So Mars armipotent invades the plain,\n\u003cbr\u003e (The wide destroyer of the race of man,)\n\u003cbr\u003e Terror, his best-beloved son, attends his course,\n\u003cbr\u003e Arm\u0027d with stern boldness, and enormous force;\n\u003cbr\u003e The pride of haughty warriors to confound,\n\u003cbr\u003e And lay the strength of tyrants on the ground:\n\u003cbr\u003e From Thrace they fly, call\u0027d to the dire alarms\n\u003cbr\u003e Of warring Phlegyans, and Ephyrian arms;\n\u003cbr\u003e Invoked by both, relentless they dispose,\n\u003cbr\u003e To these glad conquest, murderous rout to those.\n\u003cbr\u003e So march\u0027d the leaders of the Cretan train,\n\u003cbr\u003e And their bright arms shot horror o\u0027er the plain.\n\u003cbr\u003e Then first spake Merion: \"Shall we join the right,\n\u003cbr\u003e Or combat in the centre of the fight?\n\u003cbr\u003e Or to the left our wonted succour lend?\n\u003cbr\u003e Hazard and fame all parts alike attend.\"\n\u003cbr\u003e \"Not in the centre (Idomen replied:)\n\u003cbr\u003e Our ablest chieftains the main battle guide;\n\u003cbr\u003e Each godlike Ajax makes that post his care,\n\u003cbr\u003e And gallant Teucer deals destruction there,\n\u003cbr\u003e Skill\u0027d or with shafts to gall the distant field,\n\u003cbr\u003e Or bear close battle on the sounding shield.\n\u003cbr\u003e These can the rage of haughty Hector tame:\n\u003cbr\u003e Safe in their arms, the navy fears no flame,\n\u003cbr\u003e Till Jove himself descends, his bolts to shed,\n\u003cbr\u003e And hurl the blazing ruin at our head.\n\u003cbr\u003e Great must he be, of more than human birth,\n\u003cbr\u003e Nor feed like mortals on the fruits of earth.\n\u003cbr\u003e Him neither rocks can crush, nor steel can wound,\n\u003cbr\u003e Whom Ajax fells not on the ensanguined ground.\n\u003cbr\u003e In standing fight he mates Achilles\u0027 force,\n\u003cbr\u003e Excell\u0027d alone in swiftness in the course.\n\u003cbr\u003e Then to the left our ready arms apply,\n\u003cbr\u003e And live with glory, or with glory die.\"\n\u003cbr\u003e He said: and Merion to th\u0027 appointed place,\n\u003cbr\u003e Fierce as the god of battles, urged his pace.\n\u003cbr\u003e Soon as the foe the shining chiefs beheld\n\u003cbr\u003e Rush like a fiery torrent o\u0027er the field,\n\u003cbr\u003e Their force embodied in a tide they pour;\n\u003cbr\u003e The rising combat sounds along the shore.\n\u003cbr\u003e As warring winds, in Sirius\u0027 sultry reign,\n\u003cbr\u003e From different quarters sweep the sandy plain;\n\u003cbr\u003e On every side the dusty whirlwinds rise,\n\u003cbr\u003e And the dry fields are lifted to the skies:\n\u003cbr\u003e Thus by despair, hope, rage, together driven,\n\u003cbr\u003e Met the black hosts, and, meeting, darken\u0027d heaven.\n\u003cbr\u003e All dreadful glared the iron face of war,\n\u003cbr\u003e Bristled with upright spears, that flash\u0027d afar;\n\u003cbr\u003e Dire was the gleam of breastplates, helms, and shields,\n\u003cbr\u003e And polish\u0027d arms emblazed the flaming fields:\n\u003cbr\u003e [pg 240]\n\u003cbr\u003e Tremendous scene! that general horror gave,\n\u003cbr\u003e But touch\u0027d with joy the bosoms of the brave.\n\u003cbr\u003e Saturn\u0027s great sons in fierce contention vied,\n\u003cbr\u003e And crowds of heroes in their anger died.\n\u003cbr\u003e The sire of earth and heaven, by Thetis won\n\u003cbr\u003e To crown with glory Peleus\u0027 godlike son,\n\u003cbr\u003e Will\u0027d not destruction to the Grecian powers,\n\u003cbr\u003e But spared awhile the destined Trojan towers;\n\u003cbr\u003e While Neptune, rising from his azure main,\n\u003cbr\u003e Warr\u0027d on the king of heaven with stern disdain,\n\u003cbr\u003e And breathed revenge, and fired the Grecian train.\n\u003cbr\u003e Gods of one source, of one ethereal race,\n\u003cbr\u003e Alike divine, and heaven their native place;\n\u003cbr\u003e But Jove the greater; first-born of the skies,\n\u003cbr\u003e And more than men, or gods, supremely wise.\n\u003cbr\u003e For this, of Jove\u0027s superior might afraid,\n\u003cbr\u003e Neptune in human form conceal\u0027d his aid.\n\u003cbr\u003e These powers enfold the Greek and Trojan train\n\u003cbr\u003e In war and discord\u0027s adamantine chain,\n\u003cbr\u003e Indissolubly strong: the fatal tie\n\u003cbr\u003e Is stretch\u0027d on both, and close compell\u0027d they die.\n\u003cbr\u003e Dreadful in arms, and grown in combats grey,\n\u003cbr\u003e The bold Idomeneus controls the day.\n\u003cbr\u003e First by his hand Othryoneus was slain,\n\u003cbr\u003e Swell\u0027d with false hopes, with mad ambition vain;\n\u003cbr\u003e Call\u0027d by the voice of war to martial fame,\n\u003cbr\u003e From high Cabesus\u0027 distant walls he came;\n\u003cbr\u003e Cassandra\u0027s love he sought, with boasts of power,\n\u003cbr\u003e And promised conquest was the proffer\u0027d dower.\n\u003cbr\u003e The king consented, by his vaunts abused;\n\u003cbr\u003e The king consented, but the fates refused.\n\u003cbr\u003e Proud of himself, and of the imagined bride,\n\u003cbr\u003e The field he measured with a larger stride.\n\u003cbr\u003e Him as he stalk\u0027d, the Cretan javelin found;\n\u003cbr\u003e Vain was his breastplate to repel the wound:\n\u003cbr\u003e His dream of glory lost, he plunged to hell;\n\u003cbr\u003e His arms resounded as the boaster fell.\n\u003cbr\u003e The great Idomeneus bestrides the dead;\n\u003cbr\u003e \"And thus (he cries) behold thy promise sped!\n\u003cbr\u003e Such is the help thy arms to Ilion bring,\n\u003cbr\u003e And such the contract of the Phrygian king!\n\u003cbr\u003e Our offers now, illustrious prince! receive;\n\u003cbr\u003e For such an aid what will not Argos give?\n\u003cbr\u003e To conquer Troy, with ours thy forces join,\n\u003cbr\u003e And count Atrides\u0027 fairest daughter thine.\n\u003cbr\u003e Meantime, on further methods to advise,\n\u003cbr\u003e Come, follow to the fleet thy new allies;\n\u003cbr\u003e There hear what Greece has on her part to say.\"\n\u003cbr\u003e He spoke, and dragg\u0027d the gory corse away.\n\u003cbr\u003e This Asius view\u0027d, unable to contain,\n\u003cbr\u003e Before his chariot warring on the plain:\n\u003cbr\u003e [pg 241]\n\u003cbr\u003e (His crowded coursers, to his squire consign\u0027d,\n\u003cbr\u003e Impatient panted on his neck behind:)\n\u003cbr\u003e To vengeance rising with a sudden spring,\n\u003cbr\u003e He hoped the conquest of the Cretan king.\n\u003cbr\u003e The wary Cretan, as his foe drew near,\n\u003cbr\u003e Full on his throat discharged the forceful spear:\n\u003cbr\u003e Beneath the chin the point was seen to glide,\n\u003cbr\u003e And glitter\u0027d, extant at the further side.\n\u003cbr\u003e As when the mountain-oak, or poplar tall,\n\u003cbr\u003e Or pine, fit mast for some great admiral,\n\u003cbr\u003e Groans to the oft-heaved axe, with many a wound,\n\u003cbr\u003e Then spreads a length of ruin o\u0027er the ground:\n\u003cbr\u003e So sunk proud Asius in that dreadful day,\n\u003cbr\u003e And stretch\u0027d before his much-loved coursers lay.\n\u003cbr\u003e He grinds the dust distain\u0027d with streaming gore,\n\u003cbr\u003e And, fierce in death, lies foaming on the shore.\n\u003cbr\u003e Deprived of motion, stiff with stupid fear,\n\u003cbr\u003e Stands all aghast his trembling charioteer,\n\u003cbr\u003e Nor shuns the foe, nor turns the steeds away,\n\u003cbr\u003e But falls transfix\u0027d, an unresisting prey:\n\u003cbr\u003e Pierced by Antilochus, he pants beneath\n\u003cbr\u003e The stately car, and labours out his breath.\n\u003cbr\u003e Thus Asius\u0027 steeds (their mighty master gone)\n\u003cbr\u003e Remain the prize of Nestor\u0027s youthful son.\n\u003cbr\u003e Stabb\u0027d at the sight, Deiphobus drew nigh,\n\u003cbr\u003e And made, with force, the vengeful weapon fly.\n\u003cbr\u003e The Cretan saw; and, stooping, caused to glance\n\u003cbr\u003e From his slope shield the disappointed lance.\n\u003cbr\u003e Beneath the spacious targe, (a blazing round,\n\u003cbr\u003e Thick with bull-hides and brazen orbits bound,\n\u003cbr\u003e On his raised arm by two strong braces stay\u0027d,)\n\u003cbr\u003e He lay collected in defensive shade.\n\u003cbr\u003e O\u0027er his safe head the javelin idly sung,\n\u003cbr\u003e And on the tinkling verge more faintly rung.\n\u003cbr\u003e Even then the spear the vigorous arm confess\u0027d,\n\u003cbr\u003e And pierced, obliquely, king Hypsenor\u0027s breast:\n\u003cbr\u003e Warm\u0027d in his liver, to the ground it bore\n\u003cbr\u003e The chief, his people\u0027s guardian now no more!\n\u003cbr\u003e \"Not unattended (the proud Trojan cries)\n\u003cbr\u003e Nor unrevenged, lamented Asius lies:\n\u003cbr\u003e For thee, through hell\u0027s black portals stand display\u0027d,\n\u003cbr\u003e This mate shall joy thy melancholy shade.\"\n\u003cbr\u003e Heart-piercing anguish, at the haughty boast,\n\u003cbr\u003e Touch\u0027d every Greek, but Nestor\u0027s son the most.\n\u003cbr\u003e Grieved as he was, his pious arms attend,\n\u003cbr\u003e And his broad buckler shields his slaughter\u0027d friend:\n\u003cbr\u003e Till sad Mecistheus and Alastor bore\n\u003cbr\u003e His honour\u0027d body to the tented shore.\n\u003cbr\u003e Nor yet from fight Idomeneus withdraws;\n\u003cbr\u003e Resolved to perish in his country\u0027s cause,\n\u003cbr\u003e [pg 242]\n\u003cbr\u003e Or find some foe, whom heaven and he shall doom\n\u003cbr\u003e To wail his fate in death\u0027s eternal gloom.\n\u003cbr\u003e He sees Alcathous in the front aspire:\n\u003cbr\u003e Great ?syetes was the hero\u0027s sire;\n\u003cbr\u003e His spouse Hippodame, divinely fair,\n\u003cbr\u003e Anchises\u0027 eldest hope, and darling care:\n\u003cbr\u003e Who charm\u0027d her parents\u0027 and her husband\u0027s heart\n\u003cbr\u003e With beauty, sense, and every work of art:\n\u003cbr\u003e He once of Ilion\u0027s youth the loveliest boy,\n\u003cbr\u003e The fairest she of all the fair of Troy.\n\u003cbr\u003e By Neptune now the hapless hero dies,\n\u003cbr\u003e Who covers with a cloud those beauteous eyes,\n\u003cbr\u003e And fetters every limb: yet bent to meet\n\u003cbr\u003e His fate he stands; nor shuns the lance of Crete.\n\u003cbr\u003e Fix\u0027d as some column, or deep-rooted oak,\n\u003cbr\u003e While the winds sleep; his breast received the stroke.\n\u003cbr\u003e Before the ponderous stroke his corslet yields,\n\u003cbr\u003e Long used to ward the death in fighting fields.\n\u003cbr\u003e The riven armour sends a jarring sound;\n\u003cbr\u003e His labouring heart heaves with so strong a bound,\n\u003cbr\u003e The long lance shakes, and vibrates in the wound;\n\u003cbr\u003e Fast flowing from its source, as prone he lay,\n\u003cbr\u003e Life\u0027s purple tide impetuous gush\u0027d away.\n\u003cbr\u003e Then Idomen, insulting o\u0027er the slain:\n\u003cbr\u003e \"Behold, Deiphobus! nor vaunt in vain:\n\u003cbr\u003e See! on one Greek three Trojan ghosts attend;\n\u003cbr\u003e This, my third victim, to the shades I send.\n\u003cbr\u003e Approaching now thy boasted might approve,\n\u003cbr\u003e And try the prowess of the seed of Jove.\n\u003cbr\u003e From Jove, enamour\u0027d of a mortal dame,\n\u003cbr\u003e Great Minos, guardian of his country, came:\n\u003cbr\u003e Deucalion, blameless prince, was Minos\u0027 heir;\n\u003cbr\u003e His first-born I, the third from Jupiter:\n\u003cbr\u003e O\u0027er spacious Crete, and her bold sons, I reign,\n\u003cbr\u003e And thence my ships transport me through the main:\n\u003cbr\u003e Lord of a host, o\u0027er all my host I shine,\n\u003cbr\u003e A scourge to thee, thy father, and thy line.\"\n\u003cbr\u003e The Trojan heard; uncertain or to meet,\n\u003cbr\u003e Alone, with venturous arms the king of Crete,\n\u003cbr\u003e Or seek auxiliar force; at length decreed\n\u003cbr\u003e To call some hero to partake the deed,\n\u003cbr\u003e Forthwith ?neas rises to his thought:\n\u003cbr\u003e For him in Troy\u0027s remotest lines he sought,\n\u003cbr\u003e Where he, incensed at partial Priam, stands,\n\u003cbr\u003e And sees superior posts in meaner hands.\n\u003cbr\u003e To him, ambitious of so great an aid,\n\u003cbr\u003e The bold Deiphobus approach\u0027d, and said:\n\u003cbr\u003e \"Now, Trojan prince, employ thy pious arms,\n\u003cbr\u003e If e\u0027er thy bosom felt fair honour\u0027s charms.\n\u003cbr\u003e Alcathous dies, thy brother and thy friend;\n\u003cbr\u003e [pg 243]\n\u003cbr\u003e Come, and the warrior\u0027s loved remains defend.\n\u003cbr\u003e Beneath his cares thy early youth was train\u0027d,\n\u003cbr\u003e One table fed you, and one roof contain\u0027d.\n\u003cbr\u003e This deed to fierce Idomeneus we owe;\n\u003cbr\u003e Haste, and revenge it on th\u0027 insulting foe.\"\n\u003cbr\u003e ?neas heard, and for a space resign\u0027d\n\u003cbr\u003e To tender pity all his manly mind;\n\u003cbr\u003e Then rising in his rage, he burns to fight:\n\u003cbr\u003e The Greek awaits him with collected might.\n\u003cbr\u003e As the fell boar, on some rough mountain\u0027s head,\n\u003cbr\u003e Arm\u0027d with wild terrors, and to slaughter bred,\n\u003cbr\u003e When the loud rustics rise, and shout from far,\n\u003cbr\u003e Attends the tumult, and expects the war;\n\u003cbr\u003e O\u0027er his bent back the bristly horrors rise;\n\u003cbr\u003e Fires stream in lightning from his sanguine eyes,\n\u003cbr\u003e His foaming tusks both dogs and men engage;\n\u003cbr\u003e But most his hunters rouse his mighty rage:\n\u003cbr\u003e So stood Idomeneus, his javelin shook,\n\u003cbr\u003e And met the Trojan with a lowering look.\n\u003cbr\u003e Antilochus, Deipyrus, were near,\n\u003cbr\u003e The youthful offspring of the god of war,\n\u003cbr\u003e Merion, and Aphareus, in field renown\u0027d:\n\u003cbr\u003e To these the warrior sent his voice around.\n\u003cbr\u003e \"Fellows in arms! your timely aid unite;\n\u003cbr\u003e Lo, great ?neas rushes to the fight:\n\u003cbr\u003e Sprung from a god, and more than mortal bold;\n\u003cbr\u003e He fresh in youth, and I in arms grown old.\n\u003cbr\u003e Else should this hand, this hour decide the strife,\n\u003cbr\u003e The great dispute, of glory, or of life.\"\n\u003cbr\u003e He spoke, and all, as with one soul, obey\u0027d;\n\u003cbr\u003e Their lifted bucklers cast a dreadful shade\n\u003cbr\u003e Around the chief. ?neas too demands\n\u003cbr\u003e Th\u0027 assisting forces of his native bands;\n\u003cbr\u003e Paris, Deiphobus, Agenor, join;\n\u003cbr\u003e (Co-aids and captains of the Trojan line;)\n\u003cbr\u003e In order follow all th\u0027 embodied train,\n\u003cbr\u003e Like Ida\u0027s flocks proceeding o\u0027er the plain;\n\u003cbr\u003e Before his fleecy care, erect and bold,\n\u003cbr\u003e Stalks the proud ram, the father of the bold.\n\u003cbr\u003e With joy the swain surveys them, as he leads\n\u003cbr\u003e To the cool fountains, through the well-known meads:\n\u003cbr\u003e So joys ?neas, as his native band\n\u003cbr\u003e Moves on in rank, and stretches o\u0027er the land.\n\u003cbr\u003e Round dread Alcathous now the battle rose;\n\u003cbr\u003e On every side the steely circle grows;\n\u003cbr\u003e Now batter\u0027d breast-plates and hack\u0027d helmets ring,\n\u003cbr\u003e And o\u0027er their heads unheeded javelins sing.\n\u003cbr\u003e Above the rest, two towering chiefs appear,\n\u003cbr\u003e There great Idomeneus, ?neas here.\n\u003cbr\u003e Like gods of war, dispensing fate, they stood,\n\u003cbr\u003e [pg 244]\n\u003cbr\u003e And burn\u0027d to drench the ground with mutual blood.\n\u003cbr\u003e The Trojan weapon whizz\u0027d along in air;\n\u003cbr\u003e The Cretan saw, and shunn\u0027d the brazen spear:\n\u003cbr\u003e Sent from an arm so strong, the missive wood\n\u003cbr\u003e Stuck deep in earth, and quiver\u0027d where it stood.\n\u003cbr\u003e But OEnomas received the Cretan\u0027s stroke;\n\u003cbr\u003e The forceful spear his hollow corslet broke,\n\u003cbr\u003e It ripp\u0027d his belly with a ghastly wound,\n\u003cbr\u003e And roll\u0027d the smoking entrails on the ground.\n\u003cbr\u003e Stretch\u0027d on the plain, he sobs away his breath,\n\u003cbr\u003e And, furious, grasps the bloody dust in death.\n\u003cbr\u003e The victor from his breast the weapon tears;\n\u003cbr\u003e His spoils he could not, for the shower of spears.\n\u003cbr\u003e Though now unfit an active war to wage,\n\u003cbr\u003e Heavy with cumbrous arms, stiff with cold age,\n\u003cbr\u003e His listless limbs unable for the course,\n\u003cbr\u003e In standing fight he yet maintains his force;\n\u003cbr\u003e Till faint with labour, and by foes repell\u0027d,\n\u003cbr\u003e His tired slow steps he drags from off the field.\n\u003cbr\u003e Deiphobus beheld him as he pass\u0027d,\n\u003cbr\u003e And, fired with hate, a parting javelin cast:\n\u003cbr\u003e The javelin err\u0027d, but held its course along,\n\u003cbr\u003e And pierced Ascalaphus, the brave and young:\n\u003cbr\u003e The son of Mars fell gasping on the ground,\n\u003cbr\u003e And gnash\u0027d the dust, all bloody with his wound.\n\u003cbr\u003e Nor knew the furious father of his fall;\n\u003cbr\u003e High-throned amidst the great Olympian hall,\n\u003cbr\u003e On golden clouds th\u0027 immortal synod sate;\n\u003cbr\u003e Detain\u0027d from bloody war by Jove and Fate.\n\u003cbr\u003e Now, where in dust the breathless hero lay,\n\u003cbr\u003e For slain Ascalaphus commenced the fray,\n\u003cbr\u003e Deiphobus to seize his helmet flies,\n\u003cbr\u003e And from his temples rends the glittering prize;\n\u003cbr\u003e Valiant as Mars, Meriones drew near,\n\u003cbr\u003e And on his loaded arm discharged his spear:\n\u003cbr\u003e He drops the weight, disabled with the pain;\n\u003cbr\u003e The hollow helmet rings against the plain.\n\u003cbr\u003e Swift as a vulture leaping on his prey,\n\u003cbr\u003e From his torn arm the Grecian rent away\n\u003cbr\u003e The reeking javelin, and rejoin\u0027d his friends.\n\u003cbr\u003e His wounded brother good Polites tends;\n\u003cbr\u003e Around his waist his pious arms he threw,\n\u003cbr\u003e And from the rage of battle gently drew:\n\u003cbr\u003e Him his swift coursers, on his splendid car,\n\u003cbr\u003e Rapt from the lessening thunder of the war;\n\u003cbr\u003e To Troy they drove him, groaning from the shore,\n\u003cbr\u003e And sprinkling, as he pass\u0027d, the sands with gore.\n\u003cbr\u003e Meanwhile fresh slaughter bathes the sanguine ground,\n\u003cbr\u003e Heaps fall on heaps, and heaven and earth resound.\n\u003cbr\u003e Bold Aphareus by great ?neas bled;\n\u003cbr\u003e [pg 245]\n\u003cbr\u003e As toward the chief he turn\u0027d his daring head,\n\u003cbr\u003e He pierced his throat; the bending head, depress\u0027d\n\u003cbr\u003e Beneath his helmet, nods upon his breast;\n\u003cbr\u003e His shield reversed o\u0027er the fallen warrior lies,\n\u003cbr\u003e And everlasting slumber seals his eyes.\n\u003cbr\u003e Antilochus, as Thoon turn\u0027d him round,\n\u003cbr\u003e Transpierced his back with a dishonest wound:\n\u003cbr\u003e The hollow vein, that to the neck extends\n\u003cbr\u003e Along the chine, his eager javelin rends:\n\u003cbr\u003e Supine he falls, and to his social train\n\u003cbr\u003e Spreads his imploring arms, but spreads in vain.\n\u003cbr\u003e Th\u0027 exulting victor, leaping where he lay,\n\u003cbr\u003e From his broad shoulders tore the spoils away;\n\u003cbr\u003e His time observed; for closed by foes around,\n\u003cbr\u003e On all sides thick the peals of arms resound.\n\u003cbr\u003e His shield emboss\u0027d the ringing storm sustains,\n\u003cbr\u003e But he impervious and untouch\u0027d remains.\n\u003cbr\u003e (Great Neptune\u0027s care preserved from hostile rage\n\u003cbr\u003e This youth, the joy of Nestor\u0027s glorious age.)\n\u003cbr\u003e In arms intrepid, with the first he fought,\n\u003cbr\u003e Faced every foe, and every danger sought;\n\u003cbr\u003e His winged lance, resistless as the wind,\n\u003cbr\u003e Obeys each motion of the master\u0027s mind!\n\u003cbr\u003e Restless it flies, impatient to be free,\n\u003cbr\u003e And meditates the distant enemy.\n\u003cbr\u003e The son of Asius, Adamas, drew near,\n\u003cbr\u003e And struck his target with the brazen spear\n\u003cbr\u003e Fierce in his front: but Neptune wards the blow,\n\u003cbr\u003e And blunts the javelin of th\u0027 eluded foe:\n\u003cbr\u003e In the broad buckler half the weapon stood,\n\u003cbr\u003e Splinter\u0027d on earth flew half the broken wood.\n\u003cbr\u003e Disarm\u0027d, he mingled in the Trojan crew;\n\u003cbr\u003e But Merion\u0027s spear o\u0027ertook him as he flew,\n\u003cbr\u003e Deep in the belly\u0027s rim an entrance found,\n\u003cbr\u003e Where sharp the pang, and mortal is the wound.\n\u003cbr\u003e Bending he fell, and doubled to the ground,\n\u003cbr\u003e Lay panting. Thus an ox in fetters tied,\n\u003cbr\u003e While death\u0027s strong pangs distend his labouring side,\n\u003cbr\u003e His bulk enormous on the field displays;\n\u003cbr\u003e His heaving heart beats thick as ebbing life decays.\n\u003cbr\u003e The spear the conqueror from his body drew,\n\u003cbr\u003e And death\u0027s dim shadows swarm before his view.\n\u003cbr\u003e Next brave Deipyrus in dust was laid:\n\u003cbr\u003e King Helenus waved high the Thracian blade,\n\u003cbr\u003e And smote his temples with an arm so strong,\n\u003cbr\u003e The helm fell off, and roll\u0027d amid the throng:\n\u003cbr\u003e There for some luckier Greek it rests a prize;\n\u003cbr\u003e For dark in death the godlike owner lies!\n\u003cbr\u003e Raging with grief, great Menelaus burns,\n\u003cbr\u003e And fraught with vengeance, to the victor turns:\n\u003cbr\u003e [pg 246]\n\u003cbr\u003e That shook the ponderous lance, in act to throw;\n\u003cbr\u003e And this stood adverse with the bended bow:\n\u003cbr\u003e Full on his breast the Trojan arrow fell,\n\u003cbr\u003e But harmless bounded from the plated steel.\n\u003cbr\u003e As on some ample barn\u0027s well harden\u0027d floor,\n\u003cbr\u003e (The winds collected at each open door,)\n\u003cbr\u003e While the broad fan with force is whirl\u0027d around,\n\u003cbr\u003e Light leaps the golden grain, resulting from the ground:\n\u003cbr\u003e So from the steel that guards Atrides\u0027 heart,\n\u003cbr\u003e Repell\u0027d to distance flies the bounding dart.\n\u003cbr\u003e Atrides, watchful of the unwary foe,\n\u003cbr\u003e Pierced with his lance the hand that grasp\u0027d the bow.\n\u003cbr\u003e And nailed it to the yew: the wounded hand\n\u003cbr\u003e Trail\u0027d the long lance that mark\u0027d with blood the sand:\n\u003cbr\u003e But good Agenor gently from the wound\n\u003cbr\u003e The spear solicits, and the bandage bound;\n\u003cbr\u003e A sling\u0027s soft wool, snatch\u0027d from a soldier\u0027s side,\n\u003cbr\u003e At once the tent and ligature supplied.\n\u003cbr\u003e Behold! Pisander, urged by fate\u0027s decree,\n\u003cbr\u003e Springs through the ranks to fall, and fall by thee,\n\u003cbr\u003e Great Menelaus! to enchance thy fame:\n\u003cbr\u003e High-towering in the front, the warrior came.\n\u003cbr\u003e First the sharp lance was by Atrides thrown;\n\u003cbr\u003e The lance far distant by the winds was blown.\n\u003cbr\u003e Nor pierced Pisander through Atrides\u0027 shield:\n\u003cbr\u003e Pisander\u0027s spear fell shiver\u0027d on the field.\n\u003cbr\u003e Not so discouraged, to the future blind,\n\u003cbr\u003e Vain dreams of conquest swell his haughty mind;\n\u003cbr\u003e Dauntless he rushes where the Spartan lord\n\u003cbr\u003e Like lightning brandish\u0027d his far beaming sword.\n\u003cbr\u003e His left arm high opposed the shining shield:\n\u003cbr\u003e His right beneath, the cover\u0027d pole-axe held;\n\u003cbr\u003e (An olive\u0027s cloudy grain the handle made,\n\u003cbr\u003e Distinct with studs, and brazen was the blade;)\n\u003cbr\u003e This on the helm discharged a noble blow;\n\u003cbr\u003e The plume dropp\u0027d nodding to the plain below,\n\u003cbr\u003e Shorn from the crest. Atrides waved his steel:\n\u003cbr\u003e Deep through his front the weighty falchion fell;\n\u003cbr\u003e The crashing bones before its force gave way;\n\u003cbr\u003e In dust and blood the groaning hero lay:\n\u003cbr\u003e Forced from their ghastly orbs, and spouting gore,\n\u003cbr\u003e The clotted eye-balls tumble on the shore.\n\u003cbr\u003e And fierce Atrides spurn\u0027d him as he bled,\n\u003cbr\u003e Tore off his arms, and, loud-exulting, said:\n\u003cbr\u003e \"Thus, Trojans, thus, at length be taught to fear;\n\u003cbr\u003e O race perfidious, who delight in war!\n\u003cbr\u003e Already noble deeds ye have perform\u0027d;\n\u003cbr\u003e A princess raped transcends a navy storm\u0027d:\n\u003cbr\u003e In such bold feats your impious might approve,\n\u003cbr\u003e Without th\u0027 assistance, or the fear of Jove.\n\u003cbr\u003e [pg 247]\n\u003cbr\u003e The violated rites, the ravish\u0027d dame;\n\u003cbr\u003e Our heroes slaughter\u0027d and our ships on flame,\n\u003cbr\u003e Crimes heap\u0027d on crimes, shall bend your glory down,\n\u003cbr\u003e And whelm in ruins yon flagitious town.\n\u003cbr\u003e O thou, great father! lord of earth and skies,\n\u003cbr\u003e Above the thought of man, supremely wise!\n\u003cbr\u003e If from thy hand the fates of mortals flow,\n\u003cbr\u003e From whence this favour to an impious foe?\n\u003cbr\u003e A godless crew, abandon\u0027d and unjust,\n\u003cbr\u003e Still breathing rapine, violence, and lust?\n\u003cbr\u003e The best of things, beyond their measure, cloy;\n\u003cbr\u003e Sleep\u0027s balmy blessing, love\u0027s endearing joy;\n\u003cbr\u003e The feast, the dance; whate\u0027er mankind desire,\n\u003cbr\u003e Even the sweet charms of sacred numbers tire.\n\u003cbr\u003e But Troy for ever reaps a dire delight\n\u003cbr\u003e In thirst of slaughter, and in lust of fight.\"\n\u003cbr\u003e This said, he seized (while yet the carcase heaved)\n\u003cbr\u003e The bloody armour, which his train received:\n\u003cbr\u003e Then sudden mix\u0027d among the warring crew,\n\u003cbr\u003e And the bold son of Pylaemenes slew.\n\u003cbr\u003e Harpalion had through Asia travell\u0027d far,\n\u003cbr\u003e Following his martial father to the war:\n\u003cbr\u003e Through filial love he left his native shore,\n\u003cbr\u003e Never, ah, never to behold it more!\n\u003cbr\u003e His unsuccessful spear he chanced to fling\n\u003cbr\u003e Against the target of the Spartan king;\n\u003cbr\u003e Thus of his lance disarm\u0027d, from death he flies,\n\u003cbr\u003e And turns around his apprehensive eyes.\n\u003cbr\u003e Him, through the hip transpiercing as he fled,\n\u003cbr\u003e The shaft of Merion mingled with the dead.\n\u003cbr\u003e Beneath the bone the glancing point descends,\n\u003cbr\u003e And, driving down, the swelling bladder rends:\n\u003cbr\u003e Sunk in his sad companions\u0027 arms he lay,\n\u003cbr\u003e And in short pantings sobb\u0027d his soul away;\n\u003cbr\u003e (Like some vile worm extended on the ground;)\n\u003cbr\u003e While life\u0027s red torrent gush\u0027d from out the wound.\n\u003cbr\u003e Him on his car the Paphlagonian train\n\u003cbr\u003e In slow procession bore from off the plain.\n\u003cbr\u003e The pensive father, father now no more!\n\u003cbr\u003e Attends the mournful pomp along the shore;\n\u003cbr\u003e And unavailing tears profusely shed;\n\u003cbr\u003e And, unrevenged, deplored his offspring dead.\n\u003cbr\u003e Paris from far the moving sight beheld,\n\u003cbr\u003e With pity soften\u0027d and with fury swell\u0027d:\n\u003cbr\u003e His honour\u0027d host, a youth of matchless grace,\n\u003cbr\u003e And loved of all the Paphlagonian race!\n\u003cbr\u003e With his full strength he bent his angry bow,\n\u003cbr\u003e And wing\u0027d the feather\u0027d vengeance at the foe.\n\u003cbr\u003e A chief there was, the brave Euchenor named,\n\u003cbr\u003e For riches much, and more for virtue famed.\n\u003cbr\u003e [pg 248]\n\u003cbr\u003e Who held his seat in Corinth\u0027s stately town;\n\u003cbr\u003e Polydus\u0027 son, a seer of old renown.\n\u003cbr\u003e Oft had the father told his early doom,\n\u003cbr\u003e By arms abroad, or slow disease at home:\n\u003cbr\u003e He climb\u0027d his vessel, prodigal of breath,\n\u003cbr\u003e And chose the certain glorious path to death.\n\u003cbr\u003e Beneath his ear the pointed arrow went;\n\u003cbr\u003e The soul came issuing at the narrow vent:\n\u003cbr\u003e His limbs, unnerved, drop useless on the ground,\n\u003cbr\u003e And everlasting darkness shades him round.\n\u003cbr\u003e Nor knew great Hector how his legions yield,\n\u003cbr\u003e (Wrapp\u0027d in the cloud and tumult of the field:)\n\u003cbr\u003e Wide on the left the force of Greece commands,\n\u003cbr\u003e And conquest hovers o\u0027er th\u0027 Achaian bands;\n\u003cbr\u003e With such a tide superior virtue sway\u0027d,\n\u003cbr\u003e And he that shakes the solid earth gave aid.\n\u003cbr\u003e But in the centre Hector fix\u0027d remain\u0027d,\n\u003cbr\u003e Where first the gates were forced, and bulwarks gain\u0027d;\n\u003cbr\u003e There, on the margin of the hoary deep,\n\u003cbr\u003e (Their naval station where the Ajaces keep.\n\u003cbr\u003e And where low walls confine the beating tides,\n\u003cbr\u003e Whose humble barrier scarce the foe divides;\n\u003cbr\u003e Where late in fight both foot and horse engaged,\n\u003cbr\u003e And all the thunder of the battle raged,)\n\u003cbr\u003e There join\u0027d, the whole Boeotian strength remains,\n\u003cbr\u003e The proud Iaonians with their sweeping trains,\n\u003cbr\u003e Locrians and Phthians, and th\u0027 Epaean force;\n\u003cbr\u003e But join\u0027d, repel not Hector\u0027s fiery course.\n\u003cbr\u003e The flower of Athens, Stichius, Phidas, led;\n\u003cbr\u003e Bias and great Menestheus at their head:\n\u003cbr\u003e Meges the strong the Epaean bands controll\u0027d,\n\u003cbr\u003e And Dracius prudent, and Amphion bold:\n\u003cbr\u003e The Phthians, Medon, famed for martial might,\n\u003cbr\u003e And brave Podarces, active in the fight.\n\u003cbr\u003e This drew from Phylacus his noble line;\n\u003cbr\u003e Iphiclus\u0027 son: and that (Oileus) thine:\n\u003cbr\u003e (Young Ajax\u0027 brother, by a stolen embrace;\n\u003cbr\u003e He dwelt far distant from his native place,\n\u003cbr\u003e By his fierce step-dame from his father\u0027s reign\n\u003cbr\u003e Expell\u0027d and exiled for her brother slain:)\n\u003cbr\u003e These rule the Phthians, and their arms employ,\n\u003cbr\u003e Mix\u0027d with Boeotians, on the shores of Troy.\n\u003cbr\u003e Now side by side, with like unwearied care,\n\u003cbr\u003e Each Ajax laboured through the field of war:\n\u003cbr\u003e So when two lordly bulls, with equal toil,\n\u003cbr\u003e Force the bright ploughshare through the fallow soil,\n\u003cbr\u003e Join\u0027d to one yoke, the stubborn earth they tear,\n\u003cbr\u003e And trace large furrows with the shining share;\n\u003cbr\u003e O\u0027er their huge limbs the foam descends in snow,\n\u003cbr\u003e And streams of sweat down their sour foreheads flow.\n\u003cbr\u003e [pg 249]\n\u003cbr\u003e A train of heroes followed through the field,\n\u003cbr\u003e Who bore by turns great Ajax\u0027 sevenfold shield;\n\u003cbr\u003e Whene\u0027er he breathed, remissive of his might,\n\u003cbr\u003e Tired with the incessant slaughters of the fight.\n\u003cbr\u003e No following troops his brave associate grace:\n\u003cbr\u003e In close engagement an unpractised race,\n\u003cbr\u003e The Locrian squadrons nor the javelin wield,\n\u003cbr\u003e Nor bear the helm, nor lift the moony shield;\n\u003cbr\u003e But skill\u0027d from far the flying shaft to wing,\n\u003cbr\u003e Or whirl the sounding pebble from the sling,\n\u003cbr\u003e Dexterous with these they aim a certain wound,\n\u003cbr\u003e Or fell the distant warrior to the ground.\n\u003cbr\u003e Thus in the van the Telamonian train,\n\u003cbr\u003e Throng\u0027d in bright arms, a pressing fight maintain:\n\u003cbr\u003e Far in the rear the Locrian archers lie,\n\u003cbr\u003e Whose stones and arrows intercept the sky,\n\u003cbr\u003e The mingled tempest on the foes they pour;\n\u003cbr\u003e Troy\u0027s scattering orders open to the shower.\n\u003cbr\u003e Now had the Greeks eternal fame acquired,\n\u003cbr\u003e And the gall\u0027d Ilians to their walls retired;\n\u003cbr\u003e But sage Polydamas, discreetly brave,\n\u003cbr\u003e Address\u0027d great Hector, and this counsel gave:\n\u003cbr\u003e \"Though great in all, thou seem\u0027st averse to lend\n\u003cbr\u003e Impartial audience to a faithful friend;\n\u003cbr\u003e To gods and men thy matchless worth is known,\n\u003cbr\u003e And every art of glorious war thy own;\n\u003cbr\u003e But in cool thought and counsel to excel,\n\u003cbr\u003e How widely differs this from warring well!\n\u003cbr\u003e Content with what the bounteous gods have given,\n\u003cbr\u003e Seek not alone to engross the gifts of Heaven.\n\u003cbr\u003e To some the powers of bloody war belong,\n\u003cbr\u003e To some sweet music and the charm of song;\n\u003cbr\u003e To few, and wondrous few, has Jove assign\u0027d\n\u003cbr\u003e A wise, extensive, all-considering mind;\n\u003cbr\u003e Their guardians these, the nations round confess,\n\u003cbr\u003e And towns and empires for their safety bless.\n\u003cbr\u003e If Heaven have lodged this virtue in my breast,\n\u003cbr\u003e Attend, O Hector! what I judge the best,\n\u003cbr\u003e See, as thou mov\u0027st, on dangers dangers spread,\n\u003cbr\u003e And war\u0027s whole fury burns around thy head.\n\u003cbr\u003e Behold! distress\u0027d within yon hostile wall,\n\u003cbr\u003e How many Trojans yield, disperse, or fall!\n\u003cbr\u003e What troops, out-number\u0027d, scarce the war maintain!\n\u003cbr\u003e And what brave heroes at the ships lie slain!\n\u003cbr\u003e Here cease thy fury: and, the chiefs and kings\n\u003cbr\u003e Convoked to council, weigh the sum of things.\n\u003cbr\u003e Whether (the gods succeeding our desires)\n\u003cbr\u003e To yon tall ships to bear the Trojan fires;\n\u003cbr\u003e Or quit the fleet, and pass unhurt away,\n\u003cbr\u003e Contented with the conquest of the day.\n\u003cbr\u003e [pg 250]\n\u003cbr\u003e I fear, I fear, lest Greece, not yet undone,\n\u003cbr\u003e Pay the large debt of last revolving sun;\n\u003cbr\u003e Achilles, great Achilles, yet remains\n\u003cbr\u003e On yonder decks, and yet o\u0027erlooks the plains!\"\n\u003cbr\u003e The counsel pleased; and Hector, with a bound,\n\u003cbr\u003e Leap\u0027d from his chariot on the trembling ground;\n\u003cbr\u003e Swift as he leap\u0027d his clanging arms resound.\n\u003cbr\u003e \"To guard this post (he cried) thy art employ,\n\u003cbr\u003e And here detain the scatter\u0027d youth of Troy;\n\u003cbr\u003e Where yonder heroes faint, I bend my way,\n\u003cbr\u003e And hasten back to end the doubtful day.\"\n\u003cbr\u003e This said, the towering chief prepares to go,\n\u003cbr\u003e Shakes his white plumes that to the breezes flow,\n\u003cbr\u003e And seems a moving mountain topp\u0027d with snow.\n\u003cbr\u003e Through all his host, inspiring force, he flies,\n\u003cbr\u003e And bids anew the martial thunder rise.\n\u003cbr\u003e To Panthus\u0027 son, at Hector\u0027s high command\n\u003cbr\u003e Haste the bold leaders of the Trojan band:\n\u003cbr\u003e But round the battlements, and round the plain,\n\u003cbr\u003e For many a chief he look\u0027d, but look\u0027d in vain;\n\u003cbr\u003e Deiphobus, nor Helenus the seer,\n\u003cbr\u003e Nor Asius\u0027 son, nor Asius\u0027 self appear:\n\u003cbr\u003e For these were pierced with many a ghastly wound,\n\u003cbr\u003e Some cold in death, some groaning on the ground;\n\u003cbr\u003e Some low in dust, (a mournful object) lay;\n\u003cbr\u003e High on the wall some breathed their souls away.\n\u003cbr\u003e Far on the left, amid the throng he found\n\u003cbr\u003e (Cheering the troops, and dealing deaths around)\n\u003cbr\u003e The graceful Paris; whom, with fury moved,\n\u003cbr\u003e Opprobrious thus, th\u0027 impatient chief reproved:\n\u003cbr\u003e \"Ill-fated Paris! slave to womankind,\n\u003cbr\u003e As smooth of face as fraudulent of mind!\n\u003cbr\u003e Where is Deiphobus, where Asius gone?\n\u003cbr\u003e The godlike father, and th\u0027 intrepid son?\n\u003cbr\u003e The force of Helenus, dispensing fate;\n\u003cbr\u003e And great Othryoneus, so fear\u0027d of late?\n\u003cbr\u003e Black fate hang\u0027s o\u0027er thee from th\u0027 avenging gods,\n\u003cbr\u003e Imperial Troy from her foundations nods;\n\u003cbr\u003e Whelm\u0027d in thy country\u0027s ruin shalt thou fall,\n\u003cbr\u003e And one devouring vengeance swallow all.\"\n\u003cbr\u003e When Paris thus: \"My brother and my friend,\n\u003cbr\u003e Thy warm impatience makes thy tongue offend,\n\u003cbr\u003e In other battles I deserved thy blame,\n\u003cbr\u003e Though then not deedless, nor unknown to fame:\n\u003cbr\u003e But since yon rampart by thy arms lay low,\n\u003cbr\u003e I scatter\u0027d slaughter from my fatal bow.\n\u003cbr\u003e The chiefs you seek on yonder shore lie slain;\n\u003cbr\u003e Of all those heroes, two alone remain;\n\u003cbr\u003e Deiphobus, and Helenus the seer,\n\u003cbr\u003e Each now disabled by a hostile spear.\n\u003cbr\u003e [pg 251]\n\u003cbr\u003e Go then, successful, where thy soul inspires:\n\u003cbr\u003e This heart and hand shall second all thy fires:\n\u003cbr\u003e What with this arm I can, prepare to know,\n\u003cbr\u003e Till death for death be paid, and blow for blow.\n\u003cbr\u003e But \u0027tis not ours, with forces not our own\n\u003cbr\u003e To combat: strength is of the gods alone.\"\n\u003cbr\u003e These words the hero\u0027s angry mind assuage:\n\u003cbr\u003e Then fierce they mingle where the thickest rage.\n\u003cbr\u003e Around Polydamas, distain\u0027d with blood,\n\u003cbr\u003e Cebrion, Phalces, stern Orthaeus stood,\n\u003cbr\u003e Palmus, with Polypoetes the divine,\n\u003cbr\u003e And two bold brothers of Hippotion\u0027s line\n\u003cbr\u003e (Who reach\u0027d fair Ilion, from Ascania far,\n\u003cbr\u003e The former day; the next engaged in war).\n\u003cbr\u003e As when from gloomy clouds a whirlwind springs,\n\u003cbr\u003e That bears Jove\u0027s thunder on its dreadful wings,\n\u003cbr\u003e Wide o\u0027er the blasted fields the tempest sweeps;\n\u003cbr\u003e Then, gather\u0027d, settles on the hoary deeps;\n\u003cbr\u003e The afflicted deeps tumultuous mix and roar;\n\u003cbr\u003e The waves behind impel the waves before,\n\u003cbr\u003e Wide rolling, foaming high, and tumbling to the shore:\n\u003cbr\u003e Thus rank on rank, the thick battalions throng,\n\u003cbr\u003e Chief urged on chief, and man drove man along.\n\u003cbr\u003e Far o\u0027er the plains, in dreadful order bright,\n\u003cbr\u003e The brazen arms reflect a beamy light:\n\u003cbr\u003e Full in the blazing van great Hector shined,\n\u003cbr\u003e Like Mars commission\u0027d to confound mankind.\n\u003cbr\u003e Before him flaming his enormous shield,\n\u003cbr\u003e Like the broad sun, illumined all the field;\n\u003cbr\u003e His nodding helm emits a streamy ray;\n\u003cbr\u003e His piercing eyes through all the battle stray,\n\u003cbr\u003e And, while beneath his targe he flash\u0027d along,\n\u003cbr\u003e Shot terrors round, that wither\u0027d e\u0027en the strong.\n\u003cbr\u003e Thus stalk\u0027d he, dreadful; death was in his look:\n\u003cbr\u003e Whole nations fear\u0027d; but not an Argive shook.\n\u003cbr\u003e The towering Ajax, with an ample stride,\n\u003cbr\u003e Advanced the first, and thus the chief defied:\n\u003cbr\u003e \"Hector! come on; thy empty threats forbear;\n\u003cbr\u003e \u0027Tis not thy arm, \u0027tis thundering Jove we fear:\n\u003cbr\u003e The skill of war to us not idly given,\n\u003cbr\u003e Lo! Greece is humbled, not by Troy, but Heaven.\n\u003cbr\u003e Vain are the hopes that haughty mind imparts,\n\u003cbr\u003e To force our fleet: the Greeks have hands and hearts.\n\u003cbr\u003e Long ere in flames our lofty navy fall,\n\u003cbr\u003e Your boasted city, and your god-built wall,\n\u003cbr\u003e Shall sink beneath us, smoking on the ground;\n\u003cbr\u003e And spread a long unmeasured ruin round.\n\u003cbr\u003e The time shall come, when, chased along the plain,\n\u003cbr\u003e Even thou shalt call on Jove, and call in vain;\n\u003cbr\u003e Even thou shalt wish, to aid thy desperate course,\n\u003cbr\u003e [pg 252]\n\u003cbr\u003e The wings of falcons for thy flying horse;\n\u003cbr\u003e Shalt run, forgetful of a warrior\u0027s fame,\n\u003cbr\u003e While clouds of friendly dust conceal thy shame.\"\n\u003cbr\u003e As thus he spoke, behold, in open view,\n\u003cbr\u003e On sounding wings a dexter eagle flew.\n\u003cbr\u003e To Jove\u0027s glad omen all the Grecians rise,\n\u003cbr\u003e And hail, with shouts, his progress through the skies:\n\u003cbr\u003e Far-echoing clamours bound from side to side;\n\u003cbr\u003e They ceased; and thus the chief of Troy replied:\n\u003cbr\u003e \"From whence this menace, this insulting strain?\n\u003cbr\u003e Enormous boaster! doom\u0027d to vaunt in vain.\n\u003cbr\u003e So may the gods on Hector life bestow,\n\u003cbr\u003e (Not that short life which mortals lead below,\n\u003cbr\u003e But such as those of Jove\u0027s high lineage born,\n\u003cbr\u003e The blue-eyed maid, or he that gilds the morn,)\n\u003cbr\u003e As this decisive day shall end the fame\n\u003cbr\u003e Of Greece, and Argos be no more a name.\n\u003cbr\u003e And thou, imperious! if thy madness wait\n\u003cbr\u003e The lance of Hector, thou shalt meet thy fate:\n\u003cbr\u003e That giant-corse, extended on the shore,\n\u003cbr\u003e Shall largely feast the fowls with fat and gore.\"\n\u003cbr\u003e He said; and like a lion stalk\u0027d along:\n\u003cbr\u003e With shouts incessant earth and ocean rung,\n\u003cbr\u003e Sent from his following host: the Grecian train\n\u003cbr\u003e With answering thunders fill\u0027d the echoing plain;\n\u003cbr\u003e A shout that tore heaven\u0027s concave, and, above,\n\u003cbr\u003e Shook the fix\u0027d splendours of the throne of Jove.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: GREEK EARRINGS.\n\u003cbr\u003e GREEK EARRINGS.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/46000.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
