{"id":34779,"no":17,"title":"BOOK XV.","content":"ARGUMENT.\n\u003cbr\u003e \n\u003cbr\u003e THE FIFTH BATTLE AT THE SHIPS; AND THE ACTS OF AJAX.\n\u003cbr\u003e \n\u003cbr\u003e Jupiter, awaking, sees the Trojans repulsed from the trenches, Hector in a swoon, and Neptune at the head of the Greeks: he is highly incensed at the artifice of Juno, who appeases him by her submissions; she is then sent to Iris and Apollo. Juno, repairing to the assembly of the gods, attempts, with extraordinary address, to incense them against Jupiter; in particular she touches Mars with a violent resentment; he is ready to take arms, but is prevented by Minerva. Iris and Apollo obey the orders of Jupiter; Iris commands Neptune to leave the battle, to which, after much reluctance and passion, he consents. Apollo reinspires Hector with vigour, brings him back to the battle, marches before him with his aegis, and turns the fortune of the fight. He breaks down great part of the Grecian wall: the Trojans rush in, and attempt to fire the first line of the fleet, but are, as yet, repelled by the greater Ajax with a prodigious slaughter.\n\u003cbr\u003e Now in swift flight they pass the trench profound,\n\u003cbr\u003e And many a chief lay gasping on the ground:\n\u003cbr\u003e Then stopp\u0027d and panted, where the chariots lie\n\u003cbr\u003e Fear on their cheek, and horror in their eye.\n\u003cbr\u003e Meanwhile, awaken\u0027d from his dream of love,\n\u003cbr\u003e On Ida\u0027s summit sat imperial Jove:\n\u003cbr\u003e Round the wide fields he cast a careful view,\n\u003cbr\u003e There saw the Trojans fly, the Greeks pursue;\n\u003cbr\u003e These proud in arms, those scatter\u0027d o\u0027er the plain\n\u003cbr\u003e And, \u0027midst the war, the monarch of the main.\n\u003cbr\u003e Not far, great Hector on the dust he spies,\n\u003cbr\u003e (His sad associates round with weeping eyes,)\n\u003cbr\u003e Ejecting blood, and panting yet for breath,\n\u003cbr\u003e His senses wandering to the verge of death.\n\u003cbr\u003e The god beheld him with a pitying look,\n\u003cbr\u003e And thus, incensed, to fraudful Juno spoke:\n\u003cbr\u003e \"O thou, still adverse to the eternal will,\n\u003cbr\u003e For ever studious in promoting ill!\n\u003cbr\u003e Thy arts have made the godlike Hector yield,\n\u003cbr\u003e And driven his conquering squadrons from the field.\n\u003cbr\u003e Canst thou, unhappy in thy wiles, withstand\n\u003cbr\u003e Our power immense, and brave the almighty hand?\n\u003cbr\u003e [pg 269]\n\u003cbr\u003e Hast thou forgot, when, bound and fix\u0027d on high,\n\u003cbr\u003e From the vast concave of the spangled sky,\n\u003cbr\u003e I hung thee trembling in a golden chain,\n\u003cbr\u003e And all the raging gods opposed in vain?\n\u003cbr\u003e Headlong I hurl\u0027d them from the Olympian hall,\n\u003cbr\u003e Stunn\u0027d in the whirl, and breathless with the fall.\n\u003cbr\u003e For godlike Hercules these deeds were done,\n\u003cbr\u003e Nor seem\u0027d the vengeance worthy such a son:\n\u003cbr\u003e When, by thy wiles induced, fierce Boreas toss\u0027d\n\u003cbr\u003e The shipwreck\u0027d hero on the Coan coast,\n\u003cbr\u003e Him through a thousand forms of death I bore,\n\u003cbr\u003e And sent to Argos, and his native shore.\n\u003cbr\u003e Hear this, remember, and our fury dread,\n\u003cbr\u003e Nor pull the unwilling vengeance on thy head;\n\u003cbr\u003e Lest arts and blandishments successless prove,\n\u003cbr\u003e Thy soft deceits, and well-dissembled love.\"\n\u003cbr\u003e The Thunderer spoke: imperial Juno mourn\u0027d,\n\u003cbr\u003e And, trembling, these submissive words return\u0027d:\n\u003cbr\u003e \"By every oath that powers immortal ties,\n\u003cbr\u003e The foodful earth and all-infolding skies;\n\u003cbr\u003e By thy black waves, tremendous Styx! that flow\n\u003cbr\u003e Through the drear realms of gliding ghosts below;\n\u003cbr\u003e By the dread honours of thy sacred head,\n\u003cbr\u003e And that unbroken vow, our virgin bed!\n\u003cbr\u003e Not by my arts the ruler of the main\n\u003cbr\u003e Steeps Troy in blood, and ranges round the plain:\n\u003cbr\u003e By his own ardour, his own pity sway\u0027d,\n\u003cbr\u003e To help his Greeks, he fought and disobey\u0027d:\n\u003cbr\u003e Else had thy Juno better counsels given,\n\u003cbr\u003e And taught submission to the sire of heaven.\"\n\u003cbr\u003e \"Think\u0027st thou with me? fair empress of the skies!\n\u003cbr\u003e (The immortal father with a smile replies;)\n\u003cbr\u003e Then soon the haughty sea-god shall obey,\n\u003cbr\u003e Nor dare to act but when we point the way.\n\u003cbr\u003e If truth inspires thy tongue, proclaim our will\n\u003cbr\u003e To yon bright synod on the Olympian hill;\n\u003cbr\u003e Our high decree let various Iris know,\n\u003cbr\u003e And call the god that bears the silver bow.\n\u003cbr\u003e Let her descend, and from the embattled plain\n\u003cbr\u003e Command the sea-god to his watery reign:\n\u003cbr\u003e While Phoebus hastes great Hector to prepare\n\u003cbr\u003e To rise afresh, and once more wake the war:\n\u003cbr\u003e His labouring bosom re-inspires with breath,\n\u003cbr\u003e And calls his senses from the verge of death.\n\u003cbr\u003e Greece chased by Troy, even to Achilles\u0027 fleet,\n\u003cbr\u003e Shall fall by thousands at the hero\u0027s feet.\n\u003cbr\u003e He, not untouch\u0027d with pity, to the plain\n\u003cbr\u003e Shall send Patroclus, but shall send in vain.\n\u003cbr\u003e What youths he slaughters under Ilion\u0027s walls!\n\u003cbr\u003e Even my loved son, divine Sarpedon, falls!\n\u003cbr\u003e [pg 270]\n\u003cbr\u003e Vanquish\u0027d at last by Hector\u0027s lance he lies.\n\u003cbr\u003e Then, nor till then, shall great Achilles rise:\n\u003cbr\u003e And lo! that instant, godlike Hector dies.\n\u003cbr\u003e From that great hour the war\u0027s whole fortune turns,\n\u003cbr\u003e Pallas assists, and lofty Ilion burns.\n\u003cbr\u003e Not till that day shall Jove relax his rage,\n\u003cbr\u003e Nor one of all the heavenly host engage\n\u003cbr\u003e In aid of Greece. The promise of a god\n\u003cbr\u003e I gave, and seal\u0027d it with the almighty nod,\n\u003cbr\u003e Achilles\u0027 glory to the stars to raise;\n\u003cbr\u003e Such was our word, and fate the word obeys.\"\n\u003cbr\u003e The trembling queen (the almighty order given)\n\u003cbr\u003e Swift from the Idaean summit shot to heaven.\n\u003cbr\u003e As some wayfaring man, who wanders o\u0027er\n\u003cbr\u003e In thought a length of lands he trod before,\n\u003cbr\u003e Sends forth his active mind from place to place,\n\u003cbr\u003e Joins hill to dale, and measures space with space:\n\u003cbr\u003e So swift flew Juno to the bless\u0027d abodes,\n\u003cbr\u003e If thought of man can match the speed of gods.\n\u003cbr\u003e There sat the powers in awful synod placed;\n\u003cbr\u003e They bow\u0027d, and made obeisance as she pass\u0027d\n\u003cbr\u003e Through all the brazen dome: with goblets crown\u0027d239\n\u003cbr\u003e They hail her queen; the nectar streams around.\n\u003cbr\u003e Fair Themis first presents the golden bowl,\n\u003cbr\u003e And anxious asks what cares disturb her soul?\n\u003cbr\u003e To whom the white-arm\u0027d goddess thus replies:\n\u003cbr\u003e \"Enough thou know\u0027st the tyrant of the skies,\n\u003cbr\u003e Severely bent his purpose to fulfil,\n\u003cbr\u003e Unmoved his mind, and unrestrain\u0027d his will.\n\u003cbr\u003e Go thou, the feasts of heaven attend thy call;\n\u003cbr\u003e Bid the crown\u0027d nectar circle round the hall:\n\u003cbr\u003e But Jove shall thunder through the ethereal dome\n\u003cbr\u003e Such stern decrees, such threaten\u0027d woes to come,\n\u003cbr\u003e As soon shall freeze mankind with dire surprise,\n\u003cbr\u003e And damp the eternal banquets of the skies.\"\n\u003cbr\u003e The goddess said, and sullen took her place;\n\u003cbr\u003e Black horror sadden\u0027d each celestial face.\n\u003cbr\u003e To see the gathering grudge in every breast,\n\u003cbr\u003e Smiles on her lips a spleenful joy express\u0027d;\n\u003cbr\u003e While on her wrinkled front, and eyebrow bent,\n\u003cbr\u003e Sat stedfast care, and lowering discontent.\n\u003cbr\u003e Thus she proceeds—\"Attend, ye powers above!\n\u003cbr\u003e But know, \u0027tis madness to contest with Jove:\n\u003cbr\u003e Supreme he sits; and sees, in pride of sway.\n\u003cbr\u003e Your vassal godheads grudgingly obey:\n\u003cbr\u003e Fierce in the majesty of power controls;\n\u003cbr\u003e Shakes all the thrones of heaven, and bends the poles.\n\u003cbr\u003e Submiss, immortals! all he wills, obey:\n\u003cbr\u003e And thou, great Mars, begin and show the way.\n\u003cbr\u003e [pg 271]\n\u003cbr\u003e Behold Ascalaphus! behold him die,\n\u003cbr\u003e But dare not murmur, dare not vent a sigh;\n\u003cbr\u003e Thy own loved boasted offspring lies o\u0027erthrown,\n\u003cbr\u003e If that loved boasted offspring be thy own.\"\n\u003cbr\u003e Stern Mars, with anguish for his slaughter\u0027d son,\n\u003cbr\u003e Smote his rebelling breast, and fierce begun:\n\u003cbr\u003e \"Thus then, immortals! thus shall Mars obey;\n\u003cbr\u003e Forgive me, gods, and yield my vengeance way:\n\u003cbr\u003e Descending first to yon forbidden plain,\n\u003cbr\u003e The god of battles dares avenge the slain;\n\u003cbr\u003e Dares, though the thunder bursting o\u0027er my head\n\u003cbr\u003e Should hurl me blazing on those heaps of dead.\"\n\u003cbr\u003e With that he gives command to Fear and Flight\n\u003cbr\u003e To join his rapid coursers for the fight:\n\u003cbr\u003e Then grim in arms, with hasty vengeance flies;\n\u003cbr\u003e Arms that reflect a radiance through the skies.\n\u003cbr\u003e And now had Jove, by bold rebellion driven,\n\u003cbr\u003e Discharged his wrath on half the host of heaven;\n\u003cbr\u003e But Pallas, springing through the bright abode,\n\u003cbr\u003e Starts from her azure throne to calm the god.\n\u003cbr\u003e Struck for the immortal race with timely fear,\n\u003cbr\u003e From frantic Mars she snatch\u0027d the shield and spear;\n\u003cbr\u003e Then the huge helmet lifting from his head,\n\u003cbr\u003e Thus to the impetuous homicide she said:\n\u003cbr\u003e \"By what wild passion, furious! art thou toss\u0027d?\n\u003cbr\u003e Striv\u0027st thou with Jove? thou art already lost.\n\u003cbr\u003e Shall not the Thunderer\u0027s dread command restrain,\n\u003cbr\u003e And was imperial Juno heard in vain?\n\u003cbr\u003e Back to the skies wouldst thou with shame be driven,\n\u003cbr\u003e And in thy guilt involve the host of heaven?\n\u003cbr\u003e Ilion and Greece no more should Jove engage,\n\u003cbr\u003e The skies would yield an ampler scene of rage;\n\u003cbr\u003e Guilty and guiltless find an equal fate\n\u003cbr\u003e And one vast ruin whelm the Olympian state.\n\u003cbr\u003e Cease then thy offspring\u0027s death unjust to call;\n\u003cbr\u003e Heroes as great have died, and yet shall fall.\n\u003cbr\u003e Why should heaven\u0027s law with foolish man comply\n\u003cbr\u003e Exempted from the race ordain\u0027d to die?\"\n\u003cbr\u003e This menace fix\u0027d the warrior to his throne;\n\u003cbr\u003e Sullen he sat, and curb\u0027d the rising groan.\n\u003cbr\u003e Then Juno call\u0027d (Jove\u0027s orders to obey)\n\u003cbr\u003e The winged Iris, and the god of day.\n\u003cbr\u003e \"Go wait the Thunderer\u0027s will (Saturnia cried)\n\u003cbr\u003e On yon tall summit of the fountful Ide:\n\u003cbr\u003e There in the father\u0027s awful presence stand,\n\u003cbr\u003e Receive, and execute his dread command.\"\n\u003cbr\u003e She said, and sat; the god that gilds the day,\n\u003cbr\u003e And various Iris, wing their airy way.\n\u003cbr\u003e Swift as the wind, to Ida\u0027s hills they came,\n\u003cbr\u003e (Fair nurse of fountains, and of savage game)\n\u003cbr\u003e [pg 272]\n\u003cbr\u003e There sat the eternal; he whose nod controls\n\u003cbr\u003e The trembling world, and shakes the steady poles.\n\u003cbr\u003e Veil\u0027d in a mist of fragrance him they found,\n\u003cbr\u003e With clouds of gold and purple circled round.\n\u003cbr\u003e Well-pleased the Thunderer saw their earnest care,\n\u003cbr\u003e And prompt obedience to the queen of air;\n\u003cbr\u003e Then (while a smile serenes his awful brow)\n\u003cbr\u003e Commands the goddess of the showery bow:\n\u003cbr\u003e \"Iris! descend, and what we here ordain,\n\u003cbr\u003e Report to yon mad tyrant of the main.\n\u003cbr\u003e Bid him from fight to his own deeps repair,\n\u003cbr\u003e Or breathe from slaughter in the fields of air.\n\u003cbr\u003e If he refuse, then let him timely weigh\n\u003cbr\u003e Our elder birthright, and superior sway.\n\u003cbr\u003e How shall his rashness stand the dire alarms,\n\u003cbr\u003e If heaven\u0027s omnipotence descend in arms?\n\u003cbr\u003e Strives he with me, by whom his power was given,\n\u003cbr\u003e And is there equal to the lord of heaven?\"\n\u003cbr\u003e The all-mighty spoke; the goddess wing\u0027d her flight\n\u003cbr\u003e To sacred Ilion from the Idaean height.\n\u003cbr\u003e Swift as the rattling hail, or fleecy snows,\n\u003cbr\u003e Drive through the skies, when Boreas fiercely blows;\n\u003cbr\u003e So from the clouds descending Iris falls,\n\u003cbr\u003e And to blue Neptune thus the goddess calls:\n\u003cbr\u003e \"Attend the mandate of the sire above!\n\u003cbr\u003e In me behold the messenger of Jove:\n\u003cbr\u003e He bids thee from forbidden wars repair\n\u003cbr\u003e To thine own deeps, or to the fields of air.\n\u003cbr\u003e This if refused, he bids thee timely weigh\n\u003cbr\u003e His elder birthright, and superior sway.\n\u003cbr\u003e How shall thy rashness stand the dire alarms\n\u003cbr\u003e If heaven\u0027s omnipotence descend in arms?\n\u003cbr\u003e Striv\u0027st thou with him by whom all power is given?\n\u003cbr\u003e And art thou equal to the lord of heaven?\"\n\u003cbr\u003e \"What means the haughty sovereign of the skies?\n\u003cbr\u003e (The king of ocean thus, incensed, replies;)\n\u003cbr\u003e Rule as he will his portion\u0027d realms on high;\n\u003cbr\u003e No vassal god, nor of his train, am I.\n\u003cbr\u003e Three brother deities from Saturn came,\n\u003cbr\u003e And ancient Rhea, earth\u0027s immortal dame:\n\u003cbr\u003e Assign\u0027d by lot, our triple rule we know;\n\u003cbr\u003e Infernal Pluto sways the shades below;\n\u003cbr\u003e O\u0027er the wide clouds, and o\u0027er the starry plain,\n\u003cbr\u003e Ethereal Jove extends his high domain;\n\u003cbr\u003e My court beneath the hoary waves I keep,\n\u003cbr\u003e And hush the roarings of the sacred deep;\n\u003cbr\u003e Olympus, and this earth, in common lie:\n\u003cbr\u003e What claim has here the tyrant of the sky?\n\u003cbr\u003e Far in the distant clouds let him control,\n\u003cbr\u003e And awe the younger brothers of the pole;\n\u003cbr\u003e [pg 273]\n\u003cbr\u003e There to his children his commands be given,\n\u003cbr\u003e The trembling, servile, second race of heaven.\"\n\u003cbr\u003e \"And must I then (said she), O sire of floods!\n\u003cbr\u003e Bear this fierce answer to the king of gods?\n\u003cbr\u003e Correct it yet, and change thy rash intent;\n\u003cbr\u003e A noble mind disdains not to repent.\n\u003cbr\u003e To elder brothers guardian fiends are given,\n\u003cbr\u003e To scourge the wretch insulting them and heaven.\"\n\u003cbr\u003e \"Great is the profit (thus the god rejoin\u0027d)\n\u003cbr\u003e When ministers are blest with prudent mind:\n\u003cbr\u003e Warn\u0027d by thy words, to powerful Jove I yield,\n\u003cbr\u003e And quit, though angry, the contended field:\n\u003cbr\u003e Not but his threats with justice I disclaim,\n\u003cbr\u003e The same our honours, and our birth the same.\n\u003cbr\u003e If yet, forgetful of his promise given\n\u003cbr\u003e To Hermes, Pallas, and the queen of heaven,\n\u003cbr\u003e To favour Ilion, that perfidious place,\n\u003cbr\u003e He breaks his faith with half the ethereal race;\n\u003cbr\u003e Give him to know, unless the Grecian train\n\u003cbr\u003e Lay yon proud structures level with the plain,\n\u003cbr\u003e Howe\u0027er the offence by other gods be pass\u0027d,\n\u003cbr\u003e The wrath of Neptune shall for ever last.\"\n\u003cbr\u003e Thus speaking, furious from the field he strode,\n\u003cbr\u003e And plunged into the bosom of the flood.\n\u003cbr\u003e The lord of thunders, from his lofty height\n\u003cbr\u003e Beheld, and thus bespoke the source of light:\n\u003cbr\u003e \"Behold! the god whose liquid arms are hurl\u0027d\n\u003cbr\u003e Around the globe, whose earthquakes rock the world,\n\u003cbr\u003e Desists at length his rebel-war to wage,\n\u003cbr\u003e Seeks his own seas, and trembles at our rage;\n\u003cbr\u003e Else had my wrath, heaven\u0027s thrones all shaking round,\n\u003cbr\u003e Burn\u0027d to the bottom of his seas profound;\n\u003cbr\u003e And all the gods that round old Saturn dwell\n\u003cbr\u003e Had heard the thunders to the deeps of hell.\n\u003cbr\u003e Well was the crime, and well the vengeance spared;\n\u003cbr\u003e Even power immense had found such battle hard.\n\u003cbr\u003e Go thou, my son! the trembling Greeks alarm,\n\u003cbr\u003e Shake my broad aegis on thy active arm,\n\u003cbr\u003e Be godlike Hector thy peculiar care,\n\u003cbr\u003e Swell his bold heart, and urge his strength to war:\n\u003cbr\u003e Let Ilion conquer, till the Achaian train\n\u003cbr\u003e Fly to their ships and Hellespont again:\n\u003cbr\u003e Then Greece shall breathe from toils.\" The godhead said;\n\u003cbr\u003e His will divine the son of Jove obey\u0027d.\n\u003cbr\u003e Not half so swift the sailing falcon flies,\n\u003cbr\u003e That drives a turtle through the liquid skies,\n\u003cbr\u003e As Phoebus, shooting from the Idaean brow,\n\u003cbr\u003e Glides down the mountain to the plain below.\n\u003cbr\u003e There Hector seated by the stream he sees,\n\u003cbr\u003e His sense returning with the coming breeze;\n\u003cbr\u003e [pg 274]\n\u003cbr\u003e Again his pulses beat, his spirits rise;\n\u003cbr\u003e Again his loved companions meet his eyes;\n\u003cbr\u003e Jove thinking of his pains, they pass\u0027d away,\n\u003cbr\u003e To whom the god who gives the golden day:\n\u003cbr\u003e \"Why sits great Hector from the field so far?\n\u003cbr\u003e What grief, what wound, withholds thee from the war?\"\n\u003cbr\u003e The fainting hero, as the vision bright\n\u003cbr\u003e Stood shining o\u0027er him, half unseal\u0027d his sight:\n\u003cbr\u003e \"What blest immortal, with commanding breath,\n\u003cbr\u003e Thus wakens Hector from the sleep of death?\n\u003cbr\u003e Has fame not told, how, while my trusty sword\n\u003cbr\u003e Bathed Greece in slaughter, and her battle gored,\n\u003cbr\u003e The mighty Ajax with a deadly blow\n\u003cbr\u003e Had almost sunk me to the shades below?\n\u003cbr\u003e Even yet, methinks, the gliding ghosts I spy,\n\u003cbr\u003e And hell\u0027s black horrors swim before my eye.\"\n\u003cbr\u003e To him Apollo: \"Be no more dismay\u0027d;\n\u003cbr\u003e See, and be strong! the Thunderer sends thee aid.\n\u003cbr\u003e Behold! thy Phoebus shall his arms employ,\n\u003cbr\u003e Phoebus, propitious still to thee and Troy.\n\u003cbr\u003e Inspire thy warriors then with manly force,\n\u003cbr\u003e And to the ships impel thy rapid horse:\n\u003cbr\u003e Even I will make thy fiery coursers way,\n\u003cbr\u003e And drive the Grecians headlong to the sea.\"\n\u003cbr\u003e Thus to bold Hector spoke the son of Jove,\n\u003cbr\u003e And breathed immortal ardour from above.\n\u003cbr\u003e As when the pamper\u0027d steed, with reins unbound,\n\u003cbr\u003e Breaks from his stall, and pours along the ground;\n\u003cbr\u003e With ample strokes he rushes to the flood,\n\u003cbr\u003e To bathe his sides, and cool his fiery blood;\n\u003cbr\u003e His head, now freed, he tosses to the skies;\n\u003cbr\u003e His mane dishevell\u0027d o\u0027er his shoulders flies:\n\u003cbr\u003e He snuffs the females in the well-known plain,\n\u003cbr\u003e And springs, exulting, to his fields again:\n\u003cbr\u003e Urged by the voice divine, thus Hector flew,\n\u003cbr\u003e Full of the god; and all his hosts pursue.\n\u003cbr\u003e As when the force of men and dogs combined\n\u003cbr\u003e Invade the mountain goat, or branching hind;\n\u003cbr\u003e Far from the hunter\u0027s rage secure they lie\n\u003cbr\u003e Close in the rock, (not fated yet to die)\n\u003cbr\u003e When lo! a lion shoots across the way!\n\u003cbr\u003e They fly: at once the chasers and the prey.\n\u003cbr\u003e So Greece, that late in conquering troops pursued,\n\u003cbr\u003e And mark\u0027d their progress through the ranks in blood,\n\u003cbr\u003e Soon as they see the furious chief appear,\n\u003cbr\u003e Forget to vanquish, and consent to fear.\n\u003cbr\u003e Thoas with grief observed his dreadful course,\n\u003cbr\u003e Thoas, the bravest of the ?tolian force;\n\u003cbr\u003e Skill\u0027d to direct the javelin\u0027s distant flight,\n\u003cbr\u003e And bold to combat in the standing fight,\n\u003cbr\u003e [pg 275]\n\u003cbr\u003e Not more in councils famed for solid sense,\n\u003cbr\u003e Than winning words and heavenly eloquence.\n\u003cbr\u003e \"Gods! what portent (he cried) these eyes invades?\n\u003cbr\u003e Lo! Hector rises from the Stygian shades!\n\u003cbr\u003e We saw him, late, by thundering Ajax kill\u0027d:\n\u003cbr\u003e What god restores him to the frighted field;\n\u003cbr\u003e And not content that half of Greece lie slain,\n\u003cbr\u003e Pours new destruction on her sons again?\n\u003cbr\u003e He comes not, Jove! without thy powerful will;\n\u003cbr\u003e Lo! still he lives, pursues, and conquers still!\n\u003cbr\u003e Yet hear my counsel, and his worst withstand:\n\u003cbr\u003e The Greeks\u0027 main body to the fleet command;\n\u003cbr\u003e But let the few whom brisker spirits warm,\n\u003cbr\u003e Stand the first onset, and provoke the storm.\n\u003cbr\u003e Thus point your arms; and when such foes appear,\n\u003cbr\u003e Fierce as he is, let Hector learn to fear.\"\n\u003cbr\u003e The warrior spoke; the listening Greeks obey,\n\u003cbr\u003e Thickening their ranks, and form a deep array.\n\u003cbr\u003e Each Ajax, Teucer, Merion gave command,\n\u003cbr\u003e The valiant leader of the Cretan band;\n\u003cbr\u003e And Mars-like Meges: these the chiefs excite,\n\u003cbr\u003e Approach the foe, and meet the coming fight.\n\u003cbr\u003e Behind, unnumber\u0027d multitudes attend,\n\u003cbr\u003e To flank the navy, and the shores defend.\n\u003cbr\u003e Full on the front the pressing Trojans bear,\n\u003cbr\u003e And Hector first came towering to the war.\n\u003cbr\u003e Phoebus himself the rushing battle led;\n\u003cbr\u003e A veil of clouds involved his radiant head:\n\u003cbr\u003e High held before him, Jove\u0027s enormous shield\n\u003cbr\u003e Portentous shone, and shaded all the field;\n\u003cbr\u003e Vulcan to Jove the immortal gift consign\u0027d,\n\u003cbr\u003e To scatter hosts and terrify mankind,\n\u003cbr\u003e The Greeks expect the shock, the clamours rise\n\u003cbr\u003e From different parts, and mingle in the skies.\n\u003cbr\u003e Dire was the hiss of darts, by heroes flung,\n\u003cbr\u003e And arrows leaping from the bow-string sung;\n\u003cbr\u003e These drink the life of generous warriors slain:\n\u003cbr\u003e Those guiltless fall, and thirst for blood in vain.\n\u003cbr\u003e As long as Phoebus bore unmoved the shield,\n\u003cbr\u003e Sat doubtful conquest hovering o\u0027er the field;\n\u003cbr\u003e But when aloft he shakes it in the skies,\n\u003cbr\u003e Shouts in their ears, and lightens in their eyes,\n\u003cbr\u003e Deep horror seizes every Grecian breast,\n\u003cbr\u003e Their force is humbled, and their fear confess\u0027d.\n\u003cbr\u003e So flies a herd of oxen, scatter\u0027d wide,\n\u003cbr\u003e No swain to guard them, and no day to guide,\n\u003cbr\u003e When two fell lions from the mountain come,\n\u003cbr\u003e And spread the carnage through the shady gloom.\n\u003cbr\u003e Impending Phoebus pours around them fear,\n\u003cbr\u003e And Troy and Hector thunder in the rear.\n\u003cbr\u003e [pg 276]\n\u003cbr\u003e Heaps fall on heaps: the slaughter Hector leads,\n\u003cbr\u003e First great Arcesilas, then Stichius bleeds;\n\u003cbr\u003e One to the bold Boeotians ever dear,\n\u003cbr\u003e And one Menestheus\u0027 friend and famed compeer.\n\u003cbr\u003e Medon and Iasus, ?neas sped;\n\u003cbr\u003e This sprang from Phelus, and the Athenians led;\n\u003cbr\u003e But hapless Medon from Oileus came;\n\u003cbr\u003e Him Ajax honour\u0027d with a brother\u0027s name,\n\u003cbr\u003e Though born of lawless love: from home expell\u0027d,\n\u003cbr\u003e A banish\u0027d man, in Phylace he dwell\u0027d,\n\u003cbr\u003e Press\u0027d by the vengeance of an angry wife;\n\u003cbr\u003e Troy ends at last his labours and his life.\n\u003cbr\u003e Mecystes next Polydamas o\u0027erthrew;\n\u003cbr\u003e And thee, brave Clonius, great Agenor slew.\n\u003cbr\u003e By Paris, Deiochus inglorious dies,\n\u003cbr\u003e Pierced through the shoulder as he basely flies.\n\u003cbr\u003e Polites\u0027 arm laid Echius on the plain;\n\u003cbr\u003e Stretch\u0027d on one heap, the victors spoil the slain.\n\u003cbr\u003e The Greeks dismay\u0027d, confused, disperse or fall,\n\u003cbr\u003e Some seek the trench, some skulk behind the wall.\n\u003cbr\u003e While these fly trembling, others pant for breath,\n\u003cbr\u003e And o\u0027er the slaughter stalks gigantic death.\n\u003cbr\u003e On rush\u0027d bold Hector, gloomy as the night;\n\u003cbr\u003e Forbids to plunder, animates the fight,\n\u003cbr\u003e Points to the fleet: \"For, by the gods! who flies,240\n\u003cbr\u003e Who dares but linger, by this hand he dies;\n\u003cbr\u003e No weeping sister his cold eye shall close,\n\u003cbr\u003e No friendly hand his funeral pyre compose.\n\u003cbr\u003e Who stops to plunder at this signal hour,\n\u003cbr\u003e The birds shall tear him, and the dogs devour.\"\n\u003cbr\u003e Furious he said; the smarting scourge resounds;\n\u003cbr\u003e The coursers fly; the smoking chariot bounds;\n\u003cbr\u003e The hosts rush on; loud clamours shake the shore;\n\u003cbr\u003e The horses thunder, earth and ocean roar!\n\u003cbr\u003e Apollo, planted at the trench\u0027s bound,\n\u003cbr\u003e Push\u0027d at the bank: down sank the enormous mound:\n\u003cbr\u003e Roll\u0027d in the ditch the heapy ruin lay;\n\u003cbr\u003e A sudden road! a long and ample way.\n\u003cbr\u003e O\u0027er the dread fosse (a late impervious space)\n\u003cbr\u003e Now steeds, and men, and cars tumultuous pass.\n\u003cbr\u003e The wondering crowds the downward level trod;\n\u003cbr\u003e Before them flamed the shield, and march\u0027d the god.\n\u003cbr\u003e Then with his hand he shook the mighty wall;\n\u003cbr\u003e [pg 277]\n\u003cbr\u003e And lo! the turrets nod, the bulwarks fall:\n\u003cbr\u003e Easy as when ashore an infant stands,\n\u003cbr\u003e And draws imagined houses in the sands;\n\u003cbr\u003e The sportive wanton, pleased with some new play,\n\u003cbr\u003e Sweeps the slight works and fashion\u0027d domes away:\n\u003cbr\u003e Thus vanish\u0027d at thy touch, the towers and walls;\n\u003cbr\u003e The toil of thousands in a moment falls.\n\u003cbr\u003e The Grecians gaze around with wild despair,\n\u003cbr\u003e Confused, and weary all the powers with prayer:\n\u003cbr\u003e Exhort their men, with praises, threats, commands;\n\u003cbr\u003e And urge the gods, with voices, eyes, and hands.\n\u003cbr\u003e Experienced Nestor chief obtests the skies,\n\u003cbr\u003e And weeps his country with a father\u0027s eyes.\n\u003cbr\u003e \"O Jove! if ever, on his native shore,\n\u003cbr\u003e One Greek enrich\u0027d thy shrine with offer\u0027d gore;\n\u003cbr\u003e If e\u0027er, in hope our country to behold,\n\u003cbr\u003e We paid the fattest firstlings of the fold;\n\u003cbr\u003e If e\u0027er thou sign\u0027st our wishes with thy nod:\n\u003cbr\u003e Perform the promise of a gracious god!\n\u003cbr\u003e This day preserve our navies from the flame,\n\u003cbr\u003e And save the relics of the Grecian name.\"\n\u003cbr\u003e Thus prayed the sage: the eternal gave consent,\n\u003cbr\u003e And peals of thunder shook the firmament.\n\u003cbr\u003e Presumptuous Troy mistook the accepting sign,\n\u003cbr\u003e And catch\u0027d new fury at the voice divine.\n\u003cbr\u003e As, when black tempests mix the seas and skies,\n\u003cbr\u003e The roaring deeps in watery mountains rise,\n\u003cbr\u003e Above the sides of some tall ship ascend,\n\u003cbr\u003e Its womb they deluge, and its ribs they rend:\n\u003cbr\u003e Thus loudly roaring, and o\u0027erpowering all,\n\u003cbr\u003e Mount the thick Trojans up the Grecian wall;\n\u003cbr\u003e Legions on legions from each side arise:\n\u003cbr\u003e Thick sound the keels; the storm of arrows flies.\n\u003cbr\u003e Fierce on the ships above, the cars below,\n\u003cbr\u003e These wield the mace, and those the javelin throw.\n\u003cbr\u003e While thus the thunder of the battle raged,\n\u003cbr\u003e And labouring armies round the works engaged,\n\u003cbr\u003e Still in the tent Patroclus sat to tend\n\u003cbr\u003e The good Eurypylus, his wounded friend.\n\u003cbr\u003e He sprinkles healing balms, to anguish kind,\n\u003cbr\u003e And adds discourse, the medicine of the mind.\n\u003cbr\u003e But when he saw, ascending up the fleet,\n\u003cbr\u003e Victorious Troy; then, starting from his seat,\n\u003cbr\u003e With bitter groans his sorrows he express\u0027d,\n\u003cbr\u003e He wrings his hands, he beats his manly breast.\n\u003cbr\u003e \"Though yet thy state require redress (he cries)\n\u003cbr\u003e Depart I must: what horrors strike my eyes!\n\u003cbr\u003e Charged with Achilles\u0027 high command I go,\n\u003cbr\u003e A mournful witness of this scene of woe;\n\u003cbr\u003e I haste to urge him by his country\u0027s care\n\u003cbr\u003e [pg 278]\n\u003cbr\u003e To rise in arms, and shine again in war.\n\u003cbr\u003e Perhaps some favouring god his soul may bend;\n\u003cbr\u003e The voice is powerful of a faithful friend.\"\n\u003cbr\u003e He spoke; and, speaking, swifter than the wind\n\u003cbr\u003e Sprung from the tent, and left the war behind.\n\u003cbr\u003e The embodied Greeks the fierce attack sustain,\n\u003cbr\u003e But strive, though numerous, to repulse in vain:\n\u003cbr\u003e Nor could the Trojans, through that firm array,\n\u003cbr\u003e Force to the fleet and tents the impervious way.\n\u003cbr\u003e As when a shipwright, with Palladian art,\n\u003cbr\u003e Smooths the rough wood, and levels every part;\n\u003cbr\u003e With equal hand he guides his whole design,\n\u003cbr\u003e By the just rule, and the directing line:\n\u003cbr\u003e The martial leaders, with like skill and care,\n\u003cbr\u003e Preserved their line, and equal kept the war.\n\u003cbr\u003e Brave deeds of arms through all the ranks were tried,\n\u003cbr\u003e And every ship sustained an equal tide.\n\u003cbr\u003e At one proud bark, high-towering o\u0027er the fleet,\n\u003cbr\u003e Ajax the great, and godlike Hector meet;\n\u003cbr\u003e For one bright prize the matchless chiefs contend,\n\u003cbr\u003e Nor this the ships can fire, nor that defend:\n\u003cbr\u003e One kept the shore, and one the vessel trod;\n\u003cbr\u003e That fix\u0027d as fate, this acted by a god.\n\u003cbr\u003e The son of Clytius in his daring hand,\n\u003cbr\u003e The deck approaching, shakes a flaming brand;\n\u003cbr\u003e But, pierced by Telamon\u0027s huge lance, expires:\n\u003cbr\u003e Thundering he falls, and drops the extinguish\u0027d fires.\n\u003cbr\u003e Great Hector view\u0027d him with a sad survey,\n\u003cbr\u003e As stretch\u0027d in dust before the stern he lay.\n\u003cbr\u003e \"Oh! all of Trojan, all of Lycian race!\n\u003cbr\u003e Stand to your arms, maintain this arduous space:\n\u003cbr\u003e Lo! where the son of royal Clytius lies;\n\u003cbr\u003e Ah, save his arms, secure his obsequies!\"\n\u003cbr\u003e This said, his eager javelin sought the foe:\n\u003cbr\u003e But Ajax shunn\u0027d the meditated blow.\n\u003cbr\u003e Not vainly yet the forceful lance was thrown;\n\u003cbr\u003e It stretch\u0027d in dust unhappy Lycophron:\n\u003cbr\u003e An exile long, sustain\u0027d at Ajax\u0027 board,\n\u003cbr\u003e A faithful servant to a foreign lord;\n\u003cbr\u003e In peace, and war, for ever at his side,\n\u003cbr\u003e Near his loved master, as he lived, he died.\n\u003cbr\u003e From the high poop he tumbles on the sand,\n\u003cbr\u003e And lies a lifeless load along the land.\n\u003cbr\u003e With anguish Ajax views the piercing sight,\n\u003cbr\u003e And thus inflames his brother to the fight:\n\u003cbr\u003e \"Teucer, behold! extended on the shore\n\u003cbr\u003e Our friend, our loved companion! now no more!\n\u003cbr\u003e Dear as a parent, with a parent\u0027s care\n\u003cbr\u003e To fight our wars he left his native air.\n\u003cbr\u003e This death deplored, to Hector\u0027s rage we owe;\n\u003cbr\u003e [pg 279]\n\u003cbr\u003e Revenge, revenge it on the cruel foe.\n\u003cbr\u003e Where are those darts on which the fates attend?\n\u003cbr\u003e And where the bow which Phoebus taught to bend?\"\n\u003cbr\u003e Impatient Teucer, hastening to his aid,\n\u003cbr\u003e Before the chief his ample bow display\u0027d;\n\u003cbr\u003e The well-stored quiver on his shoulders hung:\n\u003cbr\u003e Then hiss\u0027d his arrow, and the bowstring sung.\n\u003cbr\u003e Clytus, Pisenor\u0027s son, renown\u0027d in fame,\n\u003cbr\u003e (To thee, Polydamas! an honour\u0027d name)\n\u003cbr\u003e Drove through the thickest of the embattled plains\n\u003cbr\u003e The startling steeds, and shook his eager reins.\n\u003cbr\u003e As all on glory ran his ardent mind,\n\u003cbr\u003e The pointed death arrests him from behind:\n\u003cbr\u003e Through his fair neck the thrilling arrow flies;\n\u003cbr\u003e In youth\u0027s first bloom reluctantly he dies.\n\u003cbr\u003e Hurl\u0027d from the lofty seat, at distance far,\n\u003cbr\u003e The headlong coursers spurn his empty car;\n\u003cbr\u003e Till sad Polydamas the steeds restrain\u0027d,\n\u003cbr\u003e And gave, Astynous, to thy careful hand;\n\u003cbr\u003e Then, fired to vengeance, rush\u0027d amidst the foe:\n\u003cbr\u003e Rage edged his sword, and strengthen\u0027d every blow.\n\u003cbr\u003e Once more bold Teucer, in his country\u0027s cause,\n\u003cbr\u003e At Hector\u0027s breast a chosen arrow draws:\n\u003cbr\u003e And had the weapon found the destined way,\n\u003cbr\u003e Thy fall, great Trojan! had renown\u0027d that day.\n\u003cbr\u003e But Hector was not doom\u0027d to perish then:\n\u003cbr\u003e The all-wise disposer of the fates of men\n\u003cbr\u003e (Imperial Jove) his present death withstands;\n\u003cbr\u003e Nor was such glory due to Teucer\u0027s hands.\n\u003cbr\u003e At its full stretch as the tough string he drew,\n\u003cbr\u003e Struck by an arm unseen, it burst in two;\n\u003cbr\u003e Down dropp\u0027d the bow: the shaft with brazen head\n\u003cbr\u003e Fell innocent, and on the dust lay dead.\n\u003cbr\u003e The astonish\u0027d archer to great Ajax cries;\n\u003cbr\u003e \"Some god prevents our destined enterprise:\n\u003cbr\u003e Some god, propitious to the Trojan foe,\n\u003cbr\u003e Has, from my arm unfailing, struck the bow,\n\u003cbr\u003e And broke the nerve my hands had twined with art,\n\u003cbr\u003e Strong to impel the flight of many a dart.\"\n\u003cbr\u003e \"Since heaven commands it (Ajax made reply)\n\u003cbr\u003e Dismiss the bow, and lay thy arrows by:\n\u003cbr\u003e Thy arms no less suffice the lance to wield,\n\u003cbr\u003e And quit the quiver for the ponderous shield.\n\u003cbr\u003e In the first ranks indulge thy thirst of fame,\n\u003cbr\u003e Thy brave example shall the rest inflame.\n\u003cbr\u003e Fierce as they are, by long successes vain;\n\u003cbr\u003e To force our fleet, or even a ship to gain,\n\u003cbr\u003e Asks toil, and sweat, and blood: their utmost might\n\u003cbr\u003e Shall find its match—No more: \u0027tis ours to fight.\"\n\u003cbr\u003e Then Teucer laid his faithless bow aside;\n\u003cbr\u003e [pg 280]\n\u003cbr\u003e The fourfold buckler o\u0027er his shoulder tied;\n\u003cbr\u003e On his brave head a crested helm he placed,\n\u003cbr\u003e With nodding horse-hair formidably graced;\n\u003cbr\u003e A dart, whose point with brass refulgent shines,\n\u003cbr\u003e The warrior wields; and his great brother joins.\n\u003cbr\u003e This Hector saw, and thus express\u0027d his joy:\n\u003cbr\u003e \"Ye troops of Lycia, Dardanus, and Troy!\n\u003cbr\u003e Be mindful of yourselves, your ancient fame,\n\u003cbr\u003e And spread your glory with the navy\u0027s flame.\n\u003cbr\u003e Jove is with us; I saw his hand, but now,\n\u003cbr\u003e From the proud archer strike his vaunted bow:\n\u003cbr\u003e Indulgent Jove! how plain thy favours shine,\n\u003cbr\u003e When happy nations bear the marks divine!\n\u003cbr\u003e How easy then, to see the sinking state\n\u003cbr\u003e Of realms accursed, deserted, reprobate!\n\u003cbr\u003e Such is the fate of Greece, and such is ours:\n\u003cbr\u003e Behold, ye warriors, and exert your powers.\n\u003cbr\u003e Death is the worst; a fate which all must try;\n\u003cbr\u003e And for our country, \u0027tis a bliss to die.\n\u003cbr\u003e The gallant man, though slain in fight he be,\n\u003cbr\u003e Yet leaves his nation safe, his children free;\n\u003cbr\u003e Entails a debt on all the grateful state;\n\u003cbr\u003e His own brave friends shall glory in his fate;\n\u003cbr\u003e His wife live honour\u0027d, all his race succeed,\n\u003cbr\u003e And late posterity enjoy the deed!\"\n\u003cbr\u003e This roused the soul in every Trojan breast:\n\u003cbr\u003e The godlike Ajax next his Greeks address\u0027d:\n\u003cbr\u003e \"How long, ye warriors of the Argive race,\n\u003cbr\u003e (To generous Argos what a dire disgrace!)\n\u003cbr\u003e How long on these cursed confines will ye lie,\n\u003cbr\u003e Yet undetermined, or to live or die?\n\u003cbr\u003e What hopes remain, what methods to retire,\n\u003cbr\u003e If once your vessels catch the Trojan fire?\n\u003cbr\u003e Make how the flames approach, how near they fall,\n\u003cbr\u003e How Hector calls, and Troy obeys his call!\n\u003cbr\u003e Not to the dance that dreadful voice invites,\n\u003cbr\u003e It calls to death, and all the rage of fights.\n\u003cbr\u003e \u0027Tis now no time for wisdom or debates;\n\u003cbr\u003e To your own hands are trusted all your fates;\n\u003cbr\u003e And better far in one decisive strife,\n\u003cbr\u003e One day should end our labour or our life,\n\u003cbr\u003e Than keep this hard-got inch of barren sands,\n\u003cbr\u003e Still press\u0027d, and press\u0027d by such inglorious hands.\"\n\u003cbr\u003e The listening Grecians feel their leader\u0027s flame,\n\u003cbr\u003e And every kindling bosom pants for fame.\n\u003cbr\u003e Then mutual slaughters spread on either side;\n\u003cbr\u003e By Hector here the Phocian Schedius died;\n\u003cbr\u003e There, pierced by Ajax, sunk Laodamas,\n\u003cbr\u003e Chief of the foot, of old Antenor\u0027s race.\n\u003cbr\u003e Polydamas laid Otus on the sand,\n\u003cbr\u003e [pg 281]\n\u003cbr\u003e The fierce commander of the Epeian band.\n\u003cbr\u003e His lance bold Meges at the victor threw;\n\u003cbr\u003e The victor, stooping, from the death withdrew;\n\u003cbr\u003e (That valued life, O Phoebus! was thy care)\n\u003cbr\u003e But Croesmus\u0027 bosom took the flying spear:\n\u003cbr\u003e His corpse fell bleeding on the slippery shore;\n\u003cbr\u003e His radiant arms triumphant Meges bore.\n\u003cbr\u003e Dolops, the son of Lampus, rushes on,\n\u003cbr\u003e Sprung from the race of old Laomedon,\n\u003cbr\u003e And famed for prowess in a well-fought field,\n\u003cbr\u003e He pierced the centre of his sounding shield:\n\u003cbr\u003e But Meges, Phyleus\u0027 ample breastplate wore,\n\u003cbr\u003e (Well-known in fight on Selle\u0027s winding shore;\n\u003cbr\u003e For king Euphetes gave the golden mail,\n\u003cbr\u003e Compact, and firm with many a jointed scale)\n\u003cbr\u003e Which oft, in cities storm\u0027d, and battles won,\n\u003cbr\u003e Had saved the father, and now saves the son.\n\u003cbr\u003e Full at the Trojan\u0027s head he urged his lance,\n\u003cbr\u003e Where the high plumes above the helmet dance,\n\u003cbr\u003e New ting\u0027d with Tyrian dye: in dust below,\n\u003cbr\u003e Shorn from the crest, the purple honours glow.\n\u003cbr\u003e Meantime their fight the Spartan king survey\u0027d,\n\u003cbr\u003e And stood by Meges\u0027 side a sudden aid.\n\u003cbr\u003e Through Dolops\u0027 shoulder urged his forceful dart,\n\u003cbr\u003e Which held its passage through the panting heart,\n\u003cbr\u003e And issued at his breast. With thundering sound\n\u003cbr\u003e The warrior falls, extended on the ground.\n\u003cbr\u003e In rush the conquering Greeks to spoil the slain:\n\u003cbr\u003e But Hector\u0027s voice excites his kindred train;\n\u003cbr\u003e The hero most, from Hicetaon sprung,\n\u003cbr\u003e Fierce Melanippus, gallant, brave, and young.\n\u003cbr\u003e He (ere to Troy the Grecians cross\u0027d the main)\n\u003cbr\u003e Fed his large oxen on Percote\u0027s plain;\n\u003cbr\u003e But when oppress\u0027d, his country claim\u0027d his care,\n\u003cbr\u003e Return\u0027d to Ilion, and excell\u0027d in war;\n\u003cbr\u003e For this, in Priam\u0027s court, he held his place,\n\u003cbr\u003e Beloved no less than Priam\u0027s royal race.\n\u003cbr\u003e Him Hector singled, as his troops he led,\n\u003cbr\u003e And thus inflamed him, pointing to the dead.\n\u003cbr\u003e \"Lo, Melanippus! lo, where Dolops lies;\n\u003cbr\u003e And is it thus our royal kinsman dies?\n\u003cbr\u003e O\u0027ermatch\u0027d he falls; to two at once a prey,\n\u003cbr\u003e And lo! they bear the bloody arms away!\n\u003cbr\u003e Come on—a distant war no longer wage,\n\u003cbr\u003e But hand to hand thy country\u0027s foes engage:\n\u003cbr\u003e Till Greece at once, and all her glory end;\n\u003cbr\u003e Or Ilion from her towery height descend,\n\u003cbr\u003e Heaved from the lowest stone; and bury all\n\u003cbr\u003e In one sad sepulchre, one common fall.\"\n\u003cbr\u003e Hector (this said) rush\u0027d forward on the foes:\n\u003cbr\u003e [pg 282]\n\u003cbr\u003e With equal ardour Melanippus glows:\n\u003cbr\u003e Then Ajax thus—\"O Greeks! respect your fame,\n\u003cbr\u003e Respect yourselves, and learn an honest shame:\n\u003cbr\u003e Let mutual reverence mutual warmth inspire,\n\u003cbr\u003e And catch from breast to breast the noble fire,\n\u003cbr\u003e On valour\u0027s side the odds of combat lie;\n\u003cbr\u003e The brave live glorious, or lamented die;\n\u003cbr\u003e The wretch that trembles in the field of fame,\n\u003cbr\u003e Meets death, and worse than death, eternal shame.\"\n\u003cbr\u003e His generous sense he not in vain imparts;\n\u003cbr\u003e It sunk, and rooted in the Grecian hearts:\n\u003cbr\u003e They join, they throng, they thicken at his call,\n\u003cbr\u003e And flank the navy with a brazen wall;\n\u003cbr\u003e Shields touching shields, in order blaze above,\n\u003cbr\u003e And stop the Trojans, though impell\u0027d by Jove.\n\u003cbr\u003e The fiery Spartan first, with loud applause.\n\u003cbr\u003e Warms the bold son of Nestor in his cause.\n\u003cbr\u003e \"Is there (he said) in arms a youth like you,\n\u003cbr\u003e So strong to fight, so active to pursue?\n\u003cbr\u003e Why stand you distant, nor attempt a deed?\n\u003cbr\u003e Lift the bold lance, and make some Trojan bleed.\"\n\u003cbr\u003e He said; and backward to the lines retired;\n\u003cbr\u003e Forth rush\u0027d the youth with martial fury fired,\n\u003cbr\u003e Beyond the foremost ranks; his lance he threw,\n\u003cbr\u003e And round the black battalions cast his view.\n\u003cbr\u003e The troops of Troy recede with sudden fear,\n\u003cbr\u003e While the swift javelin hiss\u0027d along in air.\n\u003cbr\u003e Advancing Melanippus met the dart\n\u003cbr\u003e With his bold breast, and felt it in his heart:\n\u003cbr\u003e Thundering he falls; his falling arms resound,\n\u003cbr\u003e And his broad buckler rings against the ground.\n\u003cbr\u003e The victor leaps upon his prostrate prize:\n\u003cbr\u003e Thus on a roe the well-breath\u0027d beagle flies,\n\u003cbr\u003e And rends his side, fresh-bleeding with the dart\n\u003cbr\u003e The distant hunter sent into his heart.\n\u003cbr\u003e Observing Hector to the rescue flew;\n\u003cbr\u003e Bold as he was, Antilochus withdrew.\n\u003cbr\u003e So when a savage, ranging o\u0027er the plain,\n\u003cbr\u003e Has torn the shepherd\u0027s dog, or shepherd\u0027s swain,\n\u003cbr\u003e While conscious of the deed, he glares around,\n\u003cbr\u003e And hears the gathering multitude resound,\n\u003cbr\u003e Timely he flies the yet-untasted food,\n\u003cbr\u003e And gains the friendly shelter of the wood:\n\u003cbr\u003e So fears the youth; all Troy with shouts pursue,\n\u003cbr\u003e While stones and darts in mingled tempest flew;\n\u003cbr\u003e But enter\u0027d in the Grecian ranks, he turns\n\u003cbr\u003e His manly breast, and with new fury burns.\n\u003cbr\u003e Now on the fleet the tides of Trojans drove,\n\u003cbr\u003e Fierce to fulfil the stern decrees of Jove:\n\u003cbr\u003e The sire of gods, confirming Thetis\u0027 prayer,\n\u003cbr\u003e [pg 283]\n\u003cbr\u003e The Grecian ardour quench\u0027d in deep despair;\n\u003cbr\u003e But lifts to glory Troy\u0027s prevailing bands,\n\u003cbr\u003e Swells all their hearts, and strengthens all their hands.\n\u003cbr\u003e On Ida\u0027s top he waits with longing eyes,\n\u003cbr\u003e To view the navy blazing to the skies;\n\u003cbr\u003e Then, nor till then, the scale of war shall turn,\n\u003cbr\u003e The Trojans fly, and conquer\u0027d Ilion burn.\n\u003cbr\u003e These fates revolved in his almighty mind,\n\u003cbr\u003e He raises Hector to the work design\u0027d,\n\u003cbr\u003e Bids him with more than mortal fury glow,\n\u003cbr\u003e And drives him, like a lightning, on the foe.\n\u003cbr\u003e So Mars, when human crimes for vengeance call,\n\u003cbr\u003e Shakes his huge javelin, and whole armies fall.\n\u003cbr\u003e Not with more rage a conflagration rolls,\n\u003cbr\u003e Wraps the vast mountains, and involves the poles.\n\u003cbr\u003e He foams with wrath; beneath his gloomy brow\n\u003cbr\u003e Like fiery meteors his red eye-balls glow:\n\u003cbr\u003e The radiant helmet on his temple burns,\n\u003cbr\u003e Waves when he nods, and lightens as he turns:\n\u003cbr\u003e For Jove his splendour round the chief had thrown,\n\u003cbr\u003e And cast the blaze of both the hosts on one.\n\u003cbr\u003e Unhappy glories! for his fate was near,\n\u003cbr\u003e Due to stern Pallas, and Pelides\u0027 spear:\n\u003cbr\u003e Yet Jove deferr\u0027d the death he was to pay,\n\u003cbr\u003e And gave what fate allow\u0027d, the honours of a day!\n\u003cbr\u003e Now all on fire for fame, his breast, his eyes\n\u003cbr\u003e Burn at each foe, and single every prize;\n\u003cbr\u003e Still at the closest ranks, the thickest fight,\n\u003cbr\u003e He points his ardour, and exerts his might.\n\u003cbr\u003e The Grecian phalanx, moveless as a tower,\n\u003cbr\u003e On all sides batter\u0027d, yet resists his power:\n\u003cbr\u003e So some tall rock o\u0027erhangs the hoary main,241\n\u003cbr\u003e By winds assail\u0027d, by billows beat in vain,\n\u003cbr\u003e Unmoved it hears, above, the tempest blow,\n\u003cbr\u003e And sees the watery mountains break below.\n\u003cbr\u003e Girt in surrounding flames, he seems to fall\n\u003cbr\u003e Like fire from Jove, and bursts upon them all:\n\u003cbr\u003e Bursts as a wave that from the cloud impends,\n\u003cbr\u003e And, swell\u0027d with tempests, on the ship descends;\n\u003cbr\u003e White are the decks with foam; the winds aloud\n\u003cbr\u003e Howl o\u0027er the masts, and sing through every shroud:\n\u003cbr\u003e Pale, trembling, tired, the sailors freeze with fears;\n\u003cbr\u003e And instant death on every wave appears.\n\u003cbr\u003e So pale the Greeks the eyes of Hector meet,\n\u003cbr\u003e The chief so thunders, and so shakes the fleet.\n\u003cbr\u003e [pg 284]\n\u003cbr\u003e As when a lion, rushing from his den,\n\u003cbr\u003e Amidst the plain of some wide-water\u0027d fen,\n\u003cbr\u003e (Where numerous oxen, as at ease they feed,\n\u003cbr\u003e At large expatiate o\u0027er the ranker mead)\n\u003cbr\u003e Leaps on the herds before the herdsman\u0027s eyes;\n\u003cbr\u003e The trembling herdsman far to distance flies;\n\u003cbr\u003e Some lordly bull (the rest dispersed and fled)\n\u003cbr\u003e He singles out; arrests, and lays him dead.\n\u003cbr\u003e Thus from the rage of Jove-like Hector flew\n\u003cbr\u003e All Greece in heaps; but one he seized, and slew:\n\u003cbr\u003e Mycenian Periphes, a mighty name,\n\u003cbr\u003e In wisdom great, in arms well known to fame;\n\u003cbr\u003e The minister of stern Eurystheus\u0027 ire\n\u003cbr\u003e Against Alcides, Copreus was his sire:\n\u003cbr\u003e The son redeem\u0027d the honours of the race,\n\u003cbr\u003e A son as generous as the sire was base;\n\u003cbr\u003e O\u0027er all his country\u0027s youth conspicuous far\n\u003cbr\u003e In every virtue, or of peace or war:\n\u003cbr\u003e But doom\u0027d to Hector\u0027s stronger force to yield!\n\u003cbr\u003e Against the margin of his ample shield\n\u003cbr\u003e He struck his hasty foot: his heels up-sprung;\n\u003cbr\u003e Supine he fell; his brazen helmet rung.\n\u003cbr\u003e On the fallen chief the invading Trojan press\u0027d,\n\u003cbr\u003e And plunged the pointed javelin in his breast.\n\u003cbr\u003e His circling friends, who strove to guard too late\n\u003cbr\u003e The unhappy hero, fled, or shared his fate.\n\u003cbr\u003e Chased from the foremost line, the Grecian train\n\u003cbr\u003e Now man the next, receding toward the main:\n\u003cbr\u003e Wedged in one body at the tents they stand,\n\u003cbr\u003e Wall\u0027d round with sterns, a gloomy, desperate band.\n\u003cbr\u003e Now manly shame forbids the inglorious flight;\n\u003cbr\u003e Now fear itself confines them to the fight:\n\u003cbr\u003e Man courage breathes in man; but Nestor most\n\u003cbr\u003e (The sage preserver of the Grecian host)\n\u003cbr\u003e Exhorts, adjures, to guard these utmost shores;\n\u003cbr\u003e And by their parents, by themselves implores.\n\u003cbr\u003e \"Oh friends! be men: your generous breasts inflame\n\u003cbr\u003e With mutual honour, and with mutual shame!\n\u003cbr\u003e Think of your hopes, your fortunes; all the care\n\u003cbr\u003e Your wives, your infants, and your parents share:\n\u003cbr\u003e Think of each living father\u0027s reverend head;\n\u003cbr\u003e Think of each ancestor with glory dead;\n\u003cbr\u003e Absent, by me they speak, by me they sue,\n\u003cbr\u003e They ask their safety, and their fame, from you:\n\u003cbr\u003e The gods their fates on this one action lay,\n\u003cbr\u003e And all are lost, if you desert the day.\"\n\u003cbr\u003e He spoke, and round him breathed heroic fires;\n\u003cbr\u003e Minerva seconds what the sage inspires.\n\u003cbr\u003e The mist of darkness Jove around them threw\n\u003cbr\u003e She clear\u0027d, restoring all the war to view;\n\u003cbr\u003e [pg 285]\n\u003cbr\u003e A sudden ray shot beaming o\u0027er the plain,\n\u003cbr\u003e And show\u0027d the shores, the navy, and the main:\n\u003cbr\u003e Hector they saw, and all who fly, or fight,\n\u003cbr\u003e The scene wide-opening to the blaze of light,\n\u003cbr\u003e First of the field great Ajax strikes their eyes,\n\u003cbr\u003e His port majestic, and his ample size:\n\u003cbr\u003e A ponderous mace with studs of iron crown\u0027d,\n\u003cbr\u003e Full twenty cubits long, he swings around;\n\u003cbr\u003e Nor fights, like others, fix\u0027d to certain stands\n\u003cbr\u003e But looks a moving tower above the bands;\n\u003cbr\u003e High on the decks with vast gigantic stride,\n\u003cbr\u003e The godlike hero stalks from side to side.\n\u003cbr\u003e So when a horseman from the watery mead\n\u003cbr\u003e (Skill\u0027d in the manage of the bounding steed)\n\u003cbr\u003e Drives four fair coursers, practised to obey,\n\u003cbr\u003e To some great city through the public way;\n\u003cbr\u003e Safe in his art, as side by side they run,\n\u003cbr\u003e He shifts his seat, and vaults from one to one;\n\u003cbr\u003e And now to this, and now to that he flies;\n\u003cbr\u003e Admiring numbers follow with their eyes.\n\u003cbr\u003e From ship to ship thus Ajax swiftly flew,\n\u003cbr\u003e No less the wonder of the warring crew.\n\u003cbr\u003e As furious, Hector thunder\u0027d threats aloud,\n\u003cbr\u003e And rush\u0027d enraged before the Trojan crowd;\n\u003cbr\u003e Then swift invades the ships, whose beaky prores\n\u003cbr\u003e Lay rank\u0027d contiguous on the bending shores;\n\u003cbr\u003e So the strong eagle from his airy height,\n\u003cbr\u003e Who marks the swans\u0027 or cranes\u0027 embodied flight,\n\u003cbr\u003e Stoops down impetuous, while they light for food,\n\u003cbr\u003e And, stooping, darkens with his wings the flood.\n\u003cbr\u003e Jove leads him on with his almighty hand,\n\u003cbr\u003e And breathes fierce spirits in his following band.\n\u003cbr\u003e The warring nations meet, the battle roars,\n\u003cbr\u003e Thick beats the combat on the sounding prores.\n\u003cbr\u003e Thou wouldst have thought, so furious was their fire,\n\u003cbr\u003e No force could tame them, and no toil could tire;\n\u003cbr\u003e As if new vigour from new fights they won,\n\u003cbr\u003e And the long battle was but then begun.\n\u003cbr\u003e Greece, yet unconquer\u0027d, kept alive the war,\n\u003cbr\u003e Secure of death, confiding in despair:\n\u003cbr\u003e Troy in proud hopes already view\u0027d the main\n\u003cbr\u003e Bright with the blaze, and red with heroes slain:\n\u003cbr\u003e Like strength is felt from hope, and from despair,\n\u003cbr\u003e And each contends, as his were all the war.\n\u003cbr\u003e \"Twas thou, bold Hector! whose resistless hand\n\u003cbr\u003e First seized a ship on that contested strand;\n\u003cbr\u003e [pg 286]\n\u003cbr\u003e The same which dead Protesilaus bore,242\n\u003cbr\u003e The first that touch\u0027d the unhappy Trojan shore:\n\u003cbr\u003e For this in arms the warring nations stood,\n\u003cbr\u003e And bathed their generous breasts with mutual blood.\n\u003cbr\u003e No room to poise the lance or bend the bow;\n\u003cbr\u003e But hand to hand, and man to man, they grow:\n\u003cbr\u003e Wounded, they wound; and seek each other\u0027s hearts\n\u003cbr\u003e With falchions, axes, swords, and shorten\u0027d darts.\n\u003cbr\u003e The falchions ring, shields rattle, axes sound,\n\u003cbr\u003e Swords flash in air, or glitter on the ground;\n\u003cbr\u003e With streaming blood the slippery shores are dyed,\n\u003cbr\u003e And slaughter\u0027d heroes swell the dreadful tide.\n\u003cbr\u003e Still raging, Hector with his ample hand\n\u003cbr\u003e Grasps the high stern, and gives this loud command:\n\u003cbr\u003e \n\u003cbr\u003e Illustration: AJAX DEFENDING THE GREEK SHIPS.\n\u003cbr\u003e AJAX DEFENDING THE GREEK SHIPS.\n\u003cbr\u003e \"Haste, bring the flames! that toil of ten long years\n\u003cbr\u003e Is finished; and the day desired appears!\n\u003cbr\u003e This happy day with acclamations greet,\n\u003cbr\u003e Bright with destruction of yon hostile fleet.\n\u003cbr\u003e The coward-counsels of a timorous throng\n\u003cbr\u003e Of reverend dotards check\u0027d our glory long:\n\u003cbr\u003e Too long Jove lull\u0027d us with lethargic charms,\n\u003cbr\u003e But now in peals of thunder calls to arms:\n\u003cbr\u003e In this great day he crowns our full desires,\n\u003cbr\u003e Wakes all our force, and seconds all our fires.\"\n\u003cbr\u003e He spoke—the warriors at his fierce command\n\u003cbr\u003e Pour a new deluge on the Grecian band.\n\u003cbr\u003e Even Ajax paused, (so thick the javelins fly,)\n\u003cbr\u003e Stepp\u0027d back, and doubted or to live or die.\n\u003cbr\u003e Yet, where the oars are placed, he stands to wait\n\u003cbr\u003e What chief approaching dares attempt his fate:\n\u003cbr\u003e [pg 287]\n\u003cbr\u003e Even to the last his naval charge defends,\n\u003cbr\u003e Now shakes his spear, now lifts, and now protends;\n\u003cbr\u003e Even yet, the Greeks with piercing shouts inspires,\n\u003cbr\u003e Amidst attacks, and deaths, and darts, and fires.\n\u003cbr\u003e \"O friends! O heroes! names for ever dear,\n\u003cbr\u003e Once sons of Mars, and thunderbolts of war!\n\u003cbr\u003e Ah! yet be mindful of your old renown,\n\u003cbr\u003e Your great forefathers\u0027 virtues and your own.\n\u003cbr\u003e What aids expect you in this utmost strait?\n\u003cbr\u003e What bulwarks rising between you and fate?\n\u003cbr\u003e No aids, no bulwarks your retreat attend,\n\u003cbr\u003e No friends to help, no city to defend.\n\u003cbr\u003e This spot is all you have, to lose or keep;\n\u003cbr\u003e There stand the Trojans, and here rolls the deep.\n\u003cbr\u003e \u0027Tis hostile ground you tread; your native lands\n\u003cbr\u003e Far, far from hence: your fates are in your hands.\"\n\u003cbr\u003e Raging he spoke; nor further wastes his breath,\n\u003cbr\u003e But turns his javelin to the work of death.\n\u003cbr\u003e Whate\u0027er bold Trojan arm\u0027d his daring hands,\n\u003cbr\u003e Against the sable ships, with flaming brands,\n\u003cbr\u003e So well the chief his naval weapon sped,\n\u003cbr\u003e The luckless warrior at his stern lay dead:\n\u003cbr\u003e Full twelve, the boldest, in a moment fell,\n\u003cbr\u003e Sent by great Ajax to the shades of hell.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: CASTOR AND POLLUX.\n\u003cbr\u003e CASTOR AND POLLUX.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/46002.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
