{"id":34786,"no":24,"title":"BOOK XXIII.","content":"ARGUMENT.\n\u003cbr\u003e \n\u003cbr\u003e FUNERAL GAMES IN HONOUR OF PATROCLUS.280\n\u003cbr\u003e \n\u003cbr\u003e Achilles and the Myrmidons do honours to the body of Patroclus. After the funeral feast he retires to the sea-shore, where, falling asleep, the ghost of his friend appears to him, and demands the rites of burial; the next morning the soldiers are sent with mules and waggons to fetch wood for the pyre. The funeral procession, and the offering their hair to the dead. Achilles sacrifices several animals, and lastly twelve Trojan captives, at the pile; then sets fire to it. He pays libations to the Winds, which (at the instance of Iris) rise, and raise the flames. When the pile has burned all night, they gather the bones, place them in an urn of gold, and raise the tomb. Achilles institutes the funeral games: the chariot-race, the fight of the caestus, the wrestling, the foot-race, the single combat, the discus, the shooting with arrows, the darting the javelin: the various descriptions of which, and the various success of the several antagonists, make the greatest part of the book.\n\u003cbr\u003e \n\u003cbr\u003e In this book ends the thirtieth day. The night following, the ghost of Patroclus appears to Achilles: the one-and-thirtieth day is employed in felling the timber for the pile: the two-and-thirtieth in burning it; and the three-and-thirtieth in the games. The scene is generally on the sea-shore.\n\u003cbr\u003e Thus humbled in the dust, the pensive train\n\u003cbr\u003e Through the sad city mourn\u0027d her hero slain.\n\u003cbr\u003e The body soil\u0027d with dust, and black with gore,\n\u003cbr\u003e Lies on broad Hellespont\u0027s resounding shore.\n\u003cbr\u003e The Grecians seek their ships, and clear the strand,\n\u003cbr\u003e All, but the martial Myrmidonian band:\n\u003cbr\u003e These yet assembled great Achilles holds,\n\u003cbr\u003e And the stern purpose of his mind unfolds:\n\u003cbr\u003e \"Not yet, my brave companions of the war,\n\u003cbr\u003e Release your smoking coursers from the car;\n\u003cbr\u003e But, with his chariot each in order led,\n\u003cbr\u003e Perform due honours to Patroclus dead.\n\u003cbr\u003e Ere yet from rest or food we seek relief,\n\u003cbr\u003e Some rites remain, to glut our rage of grief.\"\n\u003cbr\u003e [pg 406]\n\u003cbr\u003e The troops obey\u0027d; and thrice in order led281\n\u003cbr\u003e (Achilles first) their coursers round the dead;\n\u003cbr\u003e And thrice their sorrows and laments renew;\n\u003cbr\u003e Tears bathe their arms, and tears the sands bedew.\n\u003cbr\u003e For such a warrior Thetis aids their woe,\n\u003cbr\u003e Melts their strong hearts, and bids their eyes to flow.\n\u003cbr\u003e But chief, Pelides: thick-succeeding sighs\n\u003cbr\u003e Burst from his heart, and torrents from his eyes:\n\u003cbr\u003e His slaughtering hands, yet red with blood, he laid\n\u003cbr\u003e On his dead friend\u0027s cold breast, and thus he said:\n\u003cbr\u003e \"All hail, Patroclus! let thy honour\u0027d ghost\n\u003cbr\u003e Hear, and rejoice on Pluto\u0027s dreary coast;\n\u003cbr\u003e Behold! Achilles\u0027 promise is complete;\n\u003cbr\u003e The bloody Hector stretch\u0027d before thy feet.\n\u003cbr\u003e Lo! to the dogs his carcase I resign;\n\u003cbr\u003e And twelve sad victims, of the Trojan line,\n\u003cbr\u003e Sacred to vengeance, instant shall expire;\n\u003cbr\u003e Their lives effused around thy funeral pyre.\"\n\u003cbr\u003e Gloomy he said, and (horrible to view)\n\u003cbr\u003e Before the bier the bleeding Hector threw,\n\u003cbr\u003e Prone on the dust. The Myrmidons around\n\u003cbr\u003e Unbraced their armour, and the steeds unbound.\n\u003cbr\u003e All to Achilles\u0027 sable ship repair,\n\u003cbr\u003e Frequent and full, the genial feast to share.\n\u003cbr\u003e Now from the well-fed swine black smokes aspire,\n\u003cbr\u003e The bristly victims hissing o\u0027er the fire:\n\u003cbr\u003e The huge ox bellowing falls; with feebler cries\n\u003cbr\u003e Expires the goat; the sheep in silence dies.\n\u003cbr\u003e Around the hero\u0027s prostrate body flow\u0027d,\n\u003cbr\u003e In one promiscuous stream, the reeking blood.\n\u003cbr\u003e And now a band of Argive monarchs brings\n\u003cbr\u003e The glorious victor to the king of kings.\n\u003cbr\u003e From his dead friend the pensive warrior went,\n\u003cbr\u003e With steps unwilling, to the regal tent.\n\u003cbr\u003e The attending heralds, as by office bound,\n\u003cbr\u003e With kindled flames the tripod-vase surround:\n\u003cbr\u003e To cleanse his conquering hands from hostile gore,\n\u003cbr\u003e They urged in vain; the chief refused, and swore:282\n\u003cbr\u003e \"No drop shall touch me, by almighty Jove!\n\u003cbr\u003e The first and greatest of the gods above!\n\u003cbr\u003e Till on the pyre I place thee; till I rear\n\u003cbr\u003e The grassy mound, and clip thy sacred hair.\n\u003cbr\u003e Some ease at least those pious rites may give,\n\u003cbr\u003e And soothe my sorrows, while I bear to live.\n\u003cbr\u003e Howe\u0027er, reluctant as I am, I stay\n\u003cbr\u003e And share your feast; but with the dawn of day,\n\u003cbr\u003e [pg 407]\n\u003cbr\u003e (O king of men!) it claims thy royal care,\n\u003cbr\u003e That Greece the warrior\u0027s funeral pile prepare,\n\u003cbr\u003e And bid the forests fall: (such rites are paid\n\u003cbr\u003e To heroes slumbering in eternal shade:)\n\u003cbr\u003e Then, when his earthly part shall mount in fire,\n\u003cbr\u003e Let the leagued squadrons to their posts retire.\"\n\u003cbr\u003e He spoke: they hear him, and the word obey;\n\u003cbr\u003e The rage of hunger and of thirst allay,\n\u003cbr\u003e Then ease in sleep the labours of the day.\n\u003cbr\u003e But great Pelides, stretch\u0027d along the shore,\n\u003cbr\u003e Where, dash\u0027d on rocks, the broken billows roar,\n\u003cbr\u003e Lies inly groaning; while on either hand\n\u003cbr\u003e The martial Myrmidons confusedly stand.\n\u003cbr\u003e Along the grass his languid members fall,\n\u003cbr\u003e Tired with his chase around the Trojan wall;\n\u003cbr\u003e Hush\u0027d by the murmurs of the rolling deep,\n\u003cbr\u003e At length he sinks in the soft arms of sleep.\n\u003cbr\u003e When lo! the shade, before his closing eyes,\n\u003cbr\u003e Of sad Patroclus rose, or seem\u0027d to rise:\n\u003cbr\u003e In the same robe he living wore, he came:\n\u003cbr\u003e In stature, voice, and pleasing look, the same.\n\u003cbr\u003e The form familiar hover\u0027d o\u0027er his head,\n\u003cbr\u003e \"And sleeps Achilles? (thus the phantom said:)\n\u003cbr\u003e Sleeps my Achilles, his Patroclus dead?\n\u003cbr\u003e Living, I seem\u0027d his dearest, tenderest care,\n\u003cbr\u003e But now forgot, I wander in the air.\n\u003cbr\u003e Let my pale corse the rites of burial know,\n\u003cbr\u003e And give me entrance in the realms below:\n\u003cbr\u003e Till then the spirit finds no resting-place,\n\u003cbr\u003e But here and there the unbodied spectres chase\n\u003cbr\u003e The vagrant dead around the dark abode,\n\u003cbr\u003e Forbid to cross the irremeable flood.\n\u003cbr\u003e Now give thy hand; for to the farther shore\n\u003cbr\u003e When once we pass, the soul returns no more:\n\u003cbr\u003e When once the last funereal flames ascend,\n\u003cbr\u003e No more shall meet Achilles and his friend;\n\u003cbr\u003e No more our thoughts to those we loved make known;\n\u003cbr\u003e Or quit the dearest, to converse alone.\n\u003cbr\u003e Me fate has sever\u0027d from the sons of earth,\n\u003cbr\u003e The fate fore-doom\u0027d that waited from my birth:\n\u003cbr\u003e Thee too it waits; before the Trojan wall\n\u003cbr\u003e Even great and godlike thou art doom\u0027d to fall.\n\u003cbr\u003e Hear then; and as in fate and love we join,\n\u003cbr\u003e Ah suffer that my bones may rest with thine!\n\u003cbr\u003e Together have we lived; together bred,\n\u003cbr\u003e One house received us, and one table fed;\n\u003cbr\u003e That golden urn, thy goddess-mother gave,\n\u003cbr\u003e May mix our ashes in one common grave.\"\n\u003cbr\u003e \"And is it thou? (he answers) To my sight283\n\u003cbr\u003e [pg 408]\n\u003cbr\u003e Once more return\u0027st thou from the realms of night?\n\u003cbr\u003e O more than brother! Think each office paid,\n\u003cbr\u003e Whate\u0027er can rest a discontented shade;\n\u003cbr\u003e But grant one last embrace, unhappy boy!\n\u003cbr\u003e Afford at least that melancholy joy.\"\n\u003cbr\u003e He said, and with his longing arms essay\u0027d\n\u003cbr\u003e In vain to grasp the visionary shade!\n\u003cbr\u003e Like a thin smoke he sees the spirit fly,284\n\u003cbr\u003e And hears a feeble, lamentable cry.\n\u003cbr\u003e Confused he wakes; amazement breaks the bands\n\u003cbr\u003e Of golden sleep, and starting from the sands,\n\u003cbr\u003e Pensive he muses with uplifted hands:\n\u003cbr\u003e \"\u0027Tis true, \u0027tis certain; man, though dead, retains\n\u003cbr\u003e Part of himself; the immortal mind remains:\n\u003cbr\u003e The form subsists without the body\u0027s aid,\n\u003cbr\u003e Aerial semblance, and an empty shade!\n\u003cbr\u003e This night my friend, so late in battle lost,\n\u003cbr\u003e Stood at my side, a pensive, plaintive ghost:\n\u003cbr\u003e Even now familiar, as in life, he came;\n\u003cbr\u003e Alas! how different! yet how like the same!\"\n\u003cbr\u003e Thus while he spoke, each eye grew big with tears:\n\u003cbr\u003e And now the rosy-finger\u0027d morn appears,\n\u003cbr\u003e Shows every mournful face with tears o\u0027erspread,\n\u003cbr\u003e And glares on the pale visage of the dead.\n\u003cbr\u003e But Agamemnon, as the rites demand,\n\u003cbr\u003e With mules and waggons sends a chosen band\n\u003cbr\u003e To load the timber, and the pile to rear;\n\u003cbr\u003e A charge consign\u0027d to Merion\u0027s faithful care.\n\u003cbr\u003e With proper instruments they take the road,\n\u003cbr\u003e Axes to cut, and ropes to sling the load.\n\u003cbr\u003e First march the heavy mules, securely slow,\n\u003cbr\u003e O\u0027er hills, o\u0027er dales, o\u0027er crags, o\u0027er rocks they go:285\n\u003cbr\u003e Jumping, high o\u0027er the shrubs of the rough ground,\n\u003cbr\u003e Rattle the clattering cars, and the shock\u0027d axles bound\n\u003cbr\u003e But when arrived at Ida\u0027s spreading woods,286\n\u003cbr\u003e [pg 409]\n\u003cbr\u003e (Fair Ida, water\u0027d with descending floods,)\n\u003cbr\u003e Loud sounds the axe, redoubling strokes on strokes;\n\u003cbr\u003e On all sides round the forest hurls her oaks\n\u003cbr\u003e Headlong. Deep echoing groan the thickets brown;\n\u003cbr\u003e Then rustling, crackling, crashing, thunder down.\n\u003cbr\u003e The wood the Grecians cleave, prepared to burn;\n\u003cbr\u003e And the slow mules the same rough road return\n\u003cbr\u003e The sturdy woodmen equal burdens bore\n\u003cbr\u003e (Such charge was given them) to the sandy shore;\n\u003cbr\u003e There on the spot which great Achilles show\u0027d,\n\u003cbr\u003e They eased their shoulders, and disposed the load;\n\u003cbr\u003e Circling around the place, where times to come\n\u003cbr\u003e Shall view Patroclus\u0027 and Achilles\u0027 tomb.\n\u003cbr\u003e The hero bids his martial troops appear\n\u003cbr\u003e High on their cars in all the pomp of war;\n\u003cbr\u003e Each in refulgent arms his limbs attires,\n\u003cbr\u003e All mount their chariots, combatants and squires.\n\u003cbr\u003e The chariots first proceed, a shining train;\n\u003cbr\u003e Then clouds of foot that smoke along the plain;\n\u003cbr\u003e Next these the melancholy band appear;\n\u003cbr\u003e Amidst, lay dead Patroclus on the bier;\n\u003cbr\u003e O\u0027er all the corse their scattered locks they throw;\n\u003cbr\u003e Achilles next, oppress\u0027d with mighty woe,\n\u003cbr\u003e Supporting with his hands the hero\u0027s head,\n\u003cbr\u003e Bends o\u0027er the extended body of the dead.\n\u003cbr\u003e Patroclus decent on the appointed ground\n\u003cbr\u003e They place, and heap the sylvan pile around.\n\u003cbr\u003e But great Achilles stands apart in prayer,\n\u003cbr\u003e And from his head divides the yellow hair;\n\u003cbr\u003e Those curling locks which from his youth he vow\u0027d,287\n\u003cbr\u003e And sacred grew, to Sperchius\u0027 honour\u0027d flood:\n\u003cbr\u003e Then sighing, to the deep his locks he cast,\n\u003cbr\u003e And roll\u0027d his eyes around the watery waste:\n\u003cbr\u003e \"Sperchius! whose waves in mazy errors lost\n\u003cbr\u003e Delightful roll along my native coast!\n\u003cbr\u003e To whom we vainly vow\u0027d, at our return,\n\u003cbr\u003e These locks to fall, and hecatombs to burn:\n\u003cbr\u003e Full fifty rams to bleed in sacrifice,\n\u003cbr\u003e Where to the day thy silver fountains rise,\n\u003cbr\u003e And where in shade of consecrated bowers\n\u003cbr\u003e Thy altars stand, perfumed with native flowers!\n\u003cbr\u003e So vow\u0027d my father, but he vow\u0027d in vain;\n\u003cbr\u003e No more Achilles sees his native plain;\n\u003cbr\u003e [pg 410]\n\u003cbr\u003e In that vain hope these hairs no longer grow,\n\u003cbr\u003e Patroclus bears them to the shades below.\"\n\u003cbr\u003e Thus o\u0027er Patroclus while the hero pray\u0027d,\n\u003cbr\u003e On his cold hand the sacred lock he laid.\n\u003cbr\u003e Once more afresh the Grecian sorrows flow:\n\u003cbr\u003e And now the sun had set upon their woe;\n\u003cbr\u003e But to the king of men thus spoke the chief:\n\u003cbr\u003e \"Enough, Atrides! give the troops relief:\n\u003cbr\u003e Permit the mourning legions to retire,\n\u003cbr\u003e And let the chiefs alone attend the pyre;\n\u003cbr\u003e The pious care be ours, the dead to burn—\"\n\u003cbr\u003e He said: the people to their ships return:\n\u003cbr\u003e While those deputed to inter the slain\n\u003cbr\u003e Heap with a rising pyramid the plain.288\n\u003cbr\u003e A hundred foot in length, a hundred wide,\n\u003cbr\u003e The growing structure spreads on every side;\n\u003cbr\u003e High on the top the manly corse they lay,\n\u003cbr\u003e And well-fed sheep and sable oxen slay:\n\u003cbr\u003e Achilles covered with their fat the dead,\n\u003cbr\u003e And the piled victims round the body spread;\n\u003cbr\u003e Then jars of honey, and of fragrant oil,\n\u003cbr\u003e Suspends around, low-bending o\u0027er the pile.\n\u003cbr\u003e Four sprightly coursers, with a deadly groan\n\u003cbr\u003e Pour forth their lives, and on the pyre are thrown.\n\u003cbr\u003e Of nine large dogs, domestic at his board,\n\u003cbr\u003e Fall two, selected to attend their lord,\n\u003cbr\u003e Then last of all, and horrible to tell,\n\u003cbr\u003e Sad sacrifice! twelve Trojan captives fell.289\n\u003cbr\u003e On these the rage of fire victorious preys,\n\u003cbr\u003e Involves and joins them in one common blaze.\n\u003cbr\u003e Smear\u0027d with the bloody rites, he stands on high,\n\u003cbr\u003e And calls the spirit with a dreadful cry:290\n\u003cbr\u003e \"All hail, Patroclus! let thy vengeful ghost\n\u003cbr\u003e Hear, and exult, on Pluto\u0027s dreary coast.\n\u003cbr\u003e Behold Achilles\u0027 promise fully paid,\n\u003cbr\u003e Twelve Trojan heroes offer\u0027d to thy shade;\n\u003cbr\u003e But heavier fates on Hector\u0027s corse attend,\n\u003cbr\u003e Saved from the flames, for hungry dogs to rend.\"\n\u003cbr\u003e So spake he, threatening: but the gods made vain\n\u003cbr\u003e His threat, and guard inviolate the slain:\n\u003cbr\u003e Celestial Venus hover\u0027d o\u0027er his head,\n\u003cbr\u003e And roseate unguents, heavenly fragrance! shed:\n\u003cbr\u003e She watch\u0027d him all the night and all the day,\n\u003cbr\u003e And drove the bloodhounds from their destined prey.\n\u003cbr\u003e [pg 411]\n\u003cbr\u003e Nor sacred Phoebus less employ\u0027d his care;\n\u003cbr\u003e He pour\u0027d around a veil of gather\u0027d air,\n\u003cbr\u003e And kept the nerves undried, the flesh entire,\n\u003cbr\u003e Against the solar beam and Sirian fire.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: THE FUNERAL PILE OF PATROCLUS.\n\u003cbr\u003e THE FUNERAL PILE OF PATROCLUS.\n\u003cbr\u003e Nor yet the pile, where dead Patroclus lies,\n\u003cbr\u003e Smokes, nor as yet the sullen flames arise;\n\u003cbr\u003e But, fast beside, Achilles stood in prayer,\n\u003cbr\u003e Invoked the gods whose spirit moves the air,\n\u003cbr\u003e And victims promised, and libations cast,\n\u003cbr\u003e To gentle Zephyr and the Boreal blast:\n\u003cbr\u003e He call\u0027d the aerial powers, along the skies\n\u003cbr\u003e To breathe, and whisper to the fires to rise.\n\u003cbr\u003e The winged Iris heard the hero\u0027s call,\n\u003cbr\u003e And instant hasten\u0027d to their airy hall,\n\u003cbr\u003e Where in old Zephyr\u0027s open courts on high,\n\u003cbr\u003e Sat all the blustering brethren of the sky.\n\u003cbr\u003e She shone amidst them, on her painted bow;\n\u003cbr\u003e The rocky pavement glitter\u0027d with the show.\n\u003cbr\u003e All from the banquet rise, and each invites\n\u003cbr\u003e The various goddess to partake the rites.\n\u003cbr\u003e \"Not so (the dame replied), I haste to go\n\u003cbr\u003e To sacred Ocean, and the floods below:\n\u003cbr\u003e Even now our solemn hecatombs attend,\n\u003cbr\u003e And heaven is feasting on the world\u0027s green end\n\u003cbr\u003e With righteous Ethiops (uncorrupted train!)\n\u003cbr\u003e Far on the extremest limits of the main.\n\u003cbr\u003e But Peleus\u0027 son entreats, with sacrifice,\n\u003cbr\u003e The western spirit, and the north, to rise!\n\u003cbr\u003e Let on Patroclus\u0027 pile your blast be driven,\n\u003cbr\u003e And bear the blazing honours high to heaven.\"\n\u003cbr\u003e [pg 412]\n\u003cbr\u003e Swift as the word she vanish\u0027d from their view;\n\u003cbr\u003e Swift as the word the winds tumultuous flew;\n\u003cbr\u003e Forth burst the stormy band with thundering roar,\n\u003cbr\u003e And heaps on heaps the clouds are toss\u0027d before.\n\u003cbr\u003e To the wide main then stooping from the skies,\n\u003cbr\u003e The heaving deeps in watery mountains rise:\n\u003cbr\u003e Troy feels the blast along her shaking walls,\n\u003cbr\u003e Till on the pile the gather\u0027d tempest falls.\n\u003cbr\u003e The structure crackles in the roaring fires,\n\u003cbr\u003e And all the night the plenteous flame aspires.\n\u003cbr\u003e All night Achilles hails Patroclus\u0027 soul,\n\u003cbr\u003e With large libations from the golden bowl.\n\u003cbr\u003e As a poor father, helpless and undone,\n\u003cbr\u003e Mourns o\u0027er the ashes of an only son,\n\u003cbr\u003e Takes a sad pleasure the last bones to burn,\n\u003cbr\u003e And pours in tears, ere yet they close the urn:\n\u003cbr\u003e So stay\u0027d Achilles, circling round the shore,\n\u003cbr\u003e So watch\u0027d the flames, till now they flame no more.\n\u003cbr\u003e \u0027Twas when, emerging through the shades of night.\n\u003cbr\u003e The morning planet told the approach of light;\n\u003cbr\u003e And, fast behind, Aurora\u0027s warmer ray\n\u003cbr\u003e O\u0027er the broad ocean pour\u0027d the golden day:\n\u003cbr\u003e Then sank the blaze, the pile no longer burn\u0027d,\n\u003cbr\u003e And to their caves the whistling winds return\u0027d:\n\u003cbr\u003e Across the Thracian seas their course they bore;\n\u003cbr\u003e The ruffled seas beneath their passage roar.\n\u003cbr\u003e Then parting from the pile he ceased to weep,\n\u003cbr\u003e And sank to quiet in the embrace of sleep,\n\u003cbr\u003e Exhausted with his grief: meanwhile the crowd\n\u003cbr\u003e Of thronging Grecians round Achilles stood;\n\u003cbr\u003e The tumult waked him: from his eyes he shook\n\u003cbr\u003e Unwilling slumber, and the chiefs bespoke:\n\u003cbr\u003e \"Ye kings and princes of the Achaian name!\n\u003cbr\u003e First let us quench the yet remaining flame\n\u003cbr\u003e With sable wine; then, as the rites direct,\n\u003cbr\u003e The hero\u0027s bones with careful view select:\n\u003cbr\u003e (Apart, and easy to be known they lie\n\u003cbr\u003e Amidst the heap, and obvious to the eye:\n\u003cbr\u003e The rest around the margin will be seen\n\u003cbr\u003e Promiscuous, steeds and immolated men:)\n\u003cbr\u003e These wrapp\u0027d in double cauls of fat, prepare;\n\u003cbr\u003e And in the golden vase dispose with care;\n\u003cbr\u003e There let them rest with decent honour laid,\n\u003cbr\u003e Till I shall follow to the infernal shade.\n\u003cbr\u003e Meantime erect the tomb with pious hands,\n\u003cbr\u003e A common structure on the humble sands:\n\u003cbr\u003e Hereafter Greece some nobler work may raise,\n\u003cbr\u003e And late posterity record our praise!\"\n\u003cbr\u003e The Greeks obey; where yet the embers glow,\n\u003cbr\u003e Wide o\u0027er the pile the sable wine they throw,\n\u003cbr\u003e [pg 413]\n\u003cbr\u003e And deep subsides the ashy heap below.\n\u003cbr\u003e Next the white bones his sad companions place,\n\u003cbr\u003e With tears collected, in the golden vase.\n\u003cbr\u003e The sacred relics to the tent they bore;\n\u003cbr\u003e The urn a veil of linen covered o\u0027er.\n\u003cbr\u003e That done, they bid the sepulchre aspire,\n\u003cbr\u003e And cast the deep foundations round the pyre;\n\u003cbr\u003e High in the midst they heap the swelling bed\n\u003cbr\u003e Of rising earth, memorial of the dead.\n\u003cbr\u003e The swarming populace the chief detains,\n\u003cbr\u003e And leads amidst a wide extent of plains;\n\u003cbr\u003e There placed them round: then from the ships proceeds\n\u003cbr\u003e A train of oxen, mules, and stately steeds,\n\u003cbr\u003e Vases and tripods (for the funeral games),\n\u003cbr\u003e Resplendent brass, and more resplendent dames.\n\u003cbr\u003e First stood the prizes to reward the force\n\u003cbr\u003e Of rapid racers in the dusty course:\n\u003cbr\u003e A woman for the first, in beauty\u0027s bloom,\n\u003cbr\u003e Skill\u0027d in the needle, and the labouring loom;\n\u003cbr\u003e And a large vase, where two bright handles rise,\n\u003cbr\u003e Of twenty measures its capacious size.\n\u003cbr\u003e The second victor claims a mare unbroke,\n\u003cbr\u003e Big with a mule, unknowing of the yoke:\n\u003cbr\u003e The third, a charger yet untouch\u0027d by flame;\n\u003cbr\u003e Four ample measures held the shining frame:\n\u003cbr\u003e Two golden talents for the fourth were placed:\n\u003cbr\u003e An ample double bowl contents the last.\n\u003cbr\u003e These in fair order ranged upon the plain,\n\u003cbr\u003e The hero, rising, thus address\u0027d the train:\n\u003cbr\u003e \"Behold the prizes, valiant Greeks! decreed\n\u003cbr\u003e To the brave rulers of the racing steed;\n\u003cbr\u003e Prizes which none beside ourself could gain,\n\u003cbr\u003e Should our immortal coursers take the plain;\n\u003cbr\u003e (A race unrivall\u0027d, which from ocean\u0027s god\n\u003cbr\u003e Peleus received, and on his son bestow\u0027d.)\n\u003cbr\u003e But this no time our vigour to display;\n\u003cbr\u003e Nor suit, with them, the games of this sad day:\n\u003cbr\u003e Lost is Patroclus now, that wont to deck\n\u003cbr\u003e Their flowing manes, and sleek their glossy neck.\n\u003cbr\u003e Sad, as they shared in human grief, they stand,\n\u003cbr\u003e And trail those graceful honours on the sand!\n\u003cbr\u003e Let others for the noble task prepare,\n\u003cbr\u003e Who trust the courser and the flying car.\"\n\u003cbr\u003e Fired at his word the rival racers rise;\n\u003cbr\u003e But far the first Eumelus hopes the prize,\n\u003cbr\u003e Famed though Pieria for the fleetest breed,\n\u003cbr\u003e And skill\u0027d to manage the high-bounding steed.\n\u003cbr\u003e With equal ardour bold Tydides swell\u0027d,\n\u003cbr\u003e The steeds of Tros beneath his yoke compell\u0027d\n\u003cbr\u003e (Which late obey\u0027d the Dardan chiefs command,\n\u003cbr\u003e [pg 414]\n\u003cbr\u003e When scarce a god redeem\u0027d him from his hand).\n\u003cbr\u003e Then Menelaus his Podargus brings,\n\u003cbr\u003e And the famed courser of the king of kings:\n\u003cbr\u003e Whom rich Echepolus (more rich than brave),\n\u003cbr\u003e To \u0027scape the wars, to Agamemnon gave,\n\u003cbr\u003e (?the her name) at home to end his days;\n\u003cbr\u003e Base wealth preferring to eternal praise.\n\u003cbr\u003e Next him Antilochus demands the course\n\u003cbr\u003e With beating heart, and cheers his Pylian horse.\n\u003cbr\u003e Experienced Nestor gives his son the reins,\n\u003cbr\u003e Directs his judgment, and his heat restrains;\n\u003cbr\u003e Nor idly warns the hoary sire, nor hears\n\u003cbr\u003e The prudent son with unattending ears.\n\u003cbr\u003e \"My son! though youthful ardour fire thy breast,\n\u003cbr\u003e The gods have loved thee, and with arts have bless\u0027d;\n\u003cbr\u003e Neptune and Jove on thee conferr\u0027d the skill\n\u003cbr\u003e Swift round the goal to turn the flying wheel.\n\u003cbr\u003e To guide thy conduct little precept needs;\n\u003cbr\u003e But slow, and past their vigour, are my steeds.\n\u003cbr\u003e Fear not thy rivals, though for swiftness known;\n\u003cbr\u003e Compare those rivals\u0027 judgment and thy own:\n\u003cbr\u003e It is not strength, but art, obtains the prize,\n\u003cbr\u003e And to be swift is less than to be wise.\n\u003cbr\u003e \u0027Tis more by art than force of numerous strokes\n\u003cbr\u003e The dexterous woodman shapes the stubborn oaks;\n\u003cbr\u003e By art the pilot, through the boiling deep\n\u003cbr\u003e And howling tempest, steers the fearless ship;\n\u003cbr\u003e And \u0027tis the artist wins the glorious course;\n\u003cbr\u003e Not those who trust in chariots and in horse.\n\u003cbr\u003e In vain, unskilful to the goal they strive,\n\u003cbr\u003e And short, or wide, the ungovern\u0027d courser drive:\n\u003cbr\u003e While with sure skill, though with inferior steeds,\n\u003cbr\u003e The knowing racer to his end proceeds;\n\u003cbr\u003e Fix\u0027d on the goal his eye foreruns the course,\n\u003cbr\u003e His hand unerring steers the steady horse,\n\u003cbr\u003e And now contracts, or now extends the rein,\n\u003cbr\u003e Observing still the foremost on the plain.\n\u003cbr\u003e Mark then the goal, \u0027tis easy to be found;\n\u003cbr\u003e Yon aged trunk, a cubit from the ground;\n\u003cbr\u003e Of some once stately oak the last remains,\n\u003cbr\u003e Or hardy fir, unperish\u0027d with the rains:\n\u003cbr\u003e Inclosed with stones, conspicuous from afar;\n\u003cbr\u003e And round, a circle for the wheeling car.\n\u003cbr\u003e (Some tomb perhaps of old, the dead to grace;\n\u003cbr\u003e Or then, as now, the limit of a race.)\n\u003cbr\u003e Bear close to this, and warily proceed,\n\u003cbr\u003e A little bending to the left-hand steed;\n\u003cbr\u003e But urge the right, and give him all the reins;\n\u003cbr\u003e While thy strict hand his fellow\u0027s head restrains,\n\u003cbr\u003e And turns him short; till, doubling as they roll,\n\u003cbr\u003e [pg 415]\n\u003cbr\u003e The wheel\u0027s round naves appear to brush the goal.\n\u003cbr\u003e Yet (not to break the car, or lame the horse)\n\u003cbr\u003e Clear of the stony heap direct the course;\n\u003cbr\u003e Lest through incaution failing, thou mayst be\n\u003cbr\u003e A joy to others, a reproach to me.\n\u003cbr\u003e So shalt thou pass the goal, secure of mind,\n\u003cbr\u003e And leave unskilful swiftness far behind:\n\u003cbr\u003e Though thy fierce rival drove the matchless steed\n\u003cbr\u003e Which bore Adrastus, of celestial breed;\n\u003cbr\u003e Or the famed race, through all the regions known,\n\u003cbr\u003e That whirl\u0027d the car of proud Laomedon.\"\n\u003cbr\u003e Thus (nought unsaid) the much-advising sage\n\u003cbr\u003e Concludes; then sat, stiff with unwieldy age.\n\u003cbr\u003e Next bold Meriones was seen to rise,\n\u003cbr\u003e The last, but not least ardent for the prize.\n\u003cbr\u003e They mount their seats; the lots their place dispose\n\u003cbr\u003e (Roll\u0027d in his helmet, these Achilles throws).\n\u003cbr\u003e Young Nestor leads the race: Eumelus then;\n\u003cbr\u003e And next the brother of the king of men:\n\u003cbr\u003e Thy lot, Meriones, the fourth was cast;\n\u003cbr\u003e And, far the bravest, Diomed, was last.\n\u003cbr\u003e They stand in order, an impatient train:\n\u003cbr\u003e Pelides points the barrier on the plain,\n\u003cbr\u003e And sends before old Phoenix to the place,\n\u003cbr\u003e To mark the racers, and to judge the race.\n\u003cbr\u003e At once the coursers from the barrier bound;\n\u003cbr\u003e The lifted scourges all at once resound;\n\u003cbr\u003e Their heart, their eyes, their voice, they send before;\n\u003cbr\u003e And up the champaign thunder from the shore:\n\u003cbr\u003e Thick, where they drive, the dusty clouds arise,\n\u003cbr\u003e And the lost courser in the whirlwind flies;\n\u003cbr\u003e Loose on their shoulders the long manes reclined,\n\u003cbr\u003e Float in their speed, and dance upon the wind:\n\u003cbr\u003e The smoking chariots, rapid as they bound,\n\u003cbr\u003e Now seem to touch the sky, and now the ground.\n\u003cbr\u003e While hot for fame, and conquest all their care,\n\u003cbr\u003e (Each o\u0027er his flying courser hung in air,)\n\u003cbr\u003e Erect with ardour, poised upon the rein,\n\u003cbr\u003e They pant, they stretch, they shout along the plain.\n\u003cbr\u003e Now (the last compass fetch\u0027d around the goal)\n\u003cbr\u003e At the near prize each gathers all his soul,\n\u003cbr\u003e Each burns with double hope, with double pain,\n\u003cbr\u003e Tears up the shore, and thunders toward the main.\n\u003cbr\u003e First flew Eumelus on Pheretian steeds;\n\u003cbr\u003e With those of Tros bold Diomed succeeds:\n\u003cbr\u003e Close on Eumelus\u0027 back they puff the wind,\n\u003cbr\u003e And seem just mounting on his car behind;\n\u003cbr\u003e Full on his neck he feels the sultry breeze,\n\u003cbr\u003e And, hovering o\u0027er, their stretching shadows sees.\n\u003cbr\u003e Then had he lost, or left a doubtful prize;\n\u003cbr\u003e [pg 416]\n\u003cbr\u003e But angry Phoebus to Tydides flies,\n\u003cbr\u003e Strikes from his hand the scourge, and renders vain\n\u003cbr\u003e His matchless horses\u0027 labour on the plain.\n\u003cbr\u003e Rage fills his eye with anguish, to survey\n\u003cbr\u003e Snatch\u0027d from his hope the glories of the day.\n\u003cbr\u003e The fraud celestial Pallas sees with pain,\n\u003cbr\u003e Springs to her knight, and gives the scourge again,\n\u003cbr\u003e And fills his steeds with vigour. At a stroke\n\u003cbr\u003e She breaks his rival\u0027s chariot from the yoke:\n\u003cbr\u003e No more their way the startled horses held;\n\u003cbr\u003e The car reversed came rattling on the field;\n\u003cbr\u003e Shot headlong from his seat, beside the wheel,\n\u003cbr\u003e Prone on the dust the unhappy master fell;\n\u003cbr\u003e His batter\u0027d face and elbows strike the ground;\n\u003cbr\u003e Nose, mouth, and front, one undistinguish\u0027d wound:\n\u003cbr\u003e Grief stops his voice, a torrent drowns his eyes:\n\u003cbr\u003e Before him far the glad Tydides flies;\n\u003cbr\u003e Minerva\u0027s spirit drives his matchless pace,\n\u003cbr\u003e And crowns him victor of the labour\u0027d race.\n\u003cbr\u003e The next, though distant, Menelaus succeeds;\n\u003cbr\u003e While thus young Nestor animates his steeds:\n\u003cbr\u003e \"Now, now, my generous pair, exert your force;\n\u003cbr\u003e Not that we hope to match Tydides\u0027 horse,\n\u003cbr\u003e Since great Minerva wings their rapid way,\n\u003cbr\u003e And gives their lord the honours of the day;\n\u003cbr\u003e But reach Atrides! shall his mare outgo\n\u003cbr\u003e Your swiftness? vanquish\u0027d by a female foe?\n\u003cbr\u003e Through your neglect, if lagging on the plain\n\u003cbr\u003e The last ignoble gift be all we gain,\n\u003cbr\u003e No more shall Nestor\u0027s hand your food supply,\n\u003cbr\u003e The old man\u0027s fury rises, and ye die.\n\u003cbr\u003e Haste then: yon narrow road, before our sight,\n\u003cbr\u003e Presents the occasion, could we use it right.\"\n\u003cbr\u003e Thus he. The coursers at their master\u0027s threat\n\u003cbr\u003e With quicker steps the sounding champaign beat.\n\u003cbr\u003e And now Antilochus with nice survey\n\u003cbr\u003e Observes the compass of the hollow way.\n\u003cbr\u003e \u0027Twas where, by force of wintry torrents torn,\n\u003cbr\u003e Fast by the road a precipice was worn:\n\u003cbr\u003e Here, where but one could pass, to shun the throng\n\u003cbr\u003e The Spartan hero\u0027s chariot smoked along.\n\u003cbr\u003e Close up the venturous youth resolves to keep,\n\u003cbr\u003e Still edging near, and bears him toward the steep.\n\u003cbr\u003e Atrides, trembling, casts his eye below,\n\u003cbr\u003e And wonders at the rashness of his foe.\n\u003cbr\u003e \"Hold, stay your steeds—What madness thus to ride\n\u003cbr\u003e This narrow way! take larger field (he cried),\n\u003cbr\u003e Or both must fall.\"—Atrides cried in vain;\n\u003cbr\u003e He flies more fast, and throws up all the rein.\n\u003cbr\u003e Far as an able arm the disk can send,\n\u003cbr\u003e [pg 417]\n\u003cbr\u003e When youthful rivals their full force extend,\n\u003cbr\u003e So far, Antilochus! thy chariot flew\n\u003cbr\u003e Before the king: he, cautious, backward drew\n\u003cbr\u003e His horse compell\u0027d; foreboding in his fears\n\u003cbr\u003e The rattling ruin of the clashing cars,\n\u003cbr\u003e The floundering coursers rolling on the plain,\n\u003cbr\u003e And conquest lost through frantic haste to gain.\n\u003cbr\u003e But thus upbraids his rival as he flies:\n\u003cbr\u003e \"Go, furious youth! ungenerous and unwise!\n\u003cbr\u003e Go, but expect not I\u0027ll the prize resign;\n\u003cbr\u003e Add perjury to fraud, and make it thine—\"\n\u003cbr\u003e Then to his steeds with all his force he cries,\n\u003cbr\u003e \"Be swift, be vigorous, and regain the prize!\n\u003cbr\u003e Your rivals, destitute of youthful force,\n\u003cbr\u003e With fainting knees shall labour in the course,\n\u003cbr\u003e And yield the glory yours.\"—The steeds obey;\n\u003cbr\u003e Already at their heels they wing their way,\n\u003cbr\u003e And seem already to retrieve the day.\n\u003cbr\u003e Meantime the Grecians in a ring beheld\n\u003cbr\u003e The coursers bounding o\u0027er the dusty field.\n\u003cbr\u003e The first who mark\u0027d them was the Cretan king;\n\u003cbr\u003e High on a rising ground, above the ring,\n\u003cbr\u003e The monarch sat: from whence with sure survey\n\u003cbr\u003e He well observed the chief who led the way,\n\u003cbr\u003e And heard from far his animating cries,\n\u003cbr\u003e And saw the foremost steed with sharpen\u0027d eyes;\n\u003cbr\u003e On whose broad front a blaze of shining white,\n\u003cbr\u003e Like the full moon, stood obvious to the sight.\n\u003cbr\u003e He saw; and rising, to the Greeks begun:\n\u003cbr\u003e \"Are yonder horse discern\u0027d by me alone?\n\u003cbr\u003e Or can ye, all, another chief survey,\n\u003cbr\u003e And other steeds than lately led the way?\n\u003cbr\u003e Those, though the swiftest, by some god withheld,\n\u003cbr\u003e Lie sure disabled in the middle field:\n\u003cbr\u003e For, since the goal they doubled, round the plain\n\u003cbr\u003e I search to find them, but I search in vain.\n\u003cbr\u003e Perchance the reins forsook the driver\u0027s hand,\n\u003cbr\u003e And, turn\u0027d too short, he tumbled on the strand,\n\u003cbr\u003e Shot from the chariot; while his coursers stray\n\u003cbr\u003e With frantic fury from the destined way.\n\u003cbr\u003e Rise then some other, and inform my sight,\n\u003cbr\u003e For these dim eyes, perhaps, discern not right;\n\u003cbr\u003e Yet sure he seems, to judge by shape and air,\n\u003cbr\u003e The great ?tolian chief, renown\u0027d in war.\"\n\u003cbr\u003e \"Old man! (Oileus rashly thus replies)\n\u003cbr\u003e Thy tongue too hastily confers the prize;\n\u003cbr\u003e Of those who view the course, nor sharpest eyed,\n\u003cbr\u003e Nor youngest, yet the readiest to decide.\n\u003cbr\u003e Eumelus\u0027 steeds, high bounding in the chase,\n\u003cbr\u003e Still, as at first, unrivall\u0027d lead the race:\n\u003cbr\u003e [pg 418]\n\u003cbr\u003e I well discern him, as he shakes the rein,\n\u003cbr\u003e And hear his shouts victorious o\u0027er the plain.\"\n\u003cbr\u003e Thus he. Idomeneus, incensed, rejoin\u0027d:\n\u003cbr\u003e \"Barbarous of words! and arrogant of mind!\n\u003cbr\u003e Contentious prince, of all the Greeks beside\n\u003cbr\u003e The last in merit, as the first in pride!\n\u003cbr\u003e To vile reproach what answer can we make?\n\u003cbr\u003e A goblet or a tripod let us stake,\n\u003cbr\u003e And be the king the judge. The most unwise\n\u003cbr\u003e Will learn their rashness, when they pay the price.\"\n\u003cbr\u003e He said: and Ajax, by mad passion borne,\n\u003cbr\u003e Stern had replied; fierce scorn enhancing scorn\n\u003cbr\u003e To fell extremes. But Thetis\u0027 godlike son\n\u003cbr\u003e Awful amidst them rose, and thus begun:\n\u003cbr\u003e \"Forbear, ye chiefs! reproachful to contend;\n\u003cbr\u003e Much would ye blame, should others thus offend:\n\u003cbr\u003e And lo! the approaching steeds your contest end.\"\n\u003cbr\u003e No sooner had he spoke, but thundering near,\n\u003cbr\u003e Drives, through a stream of dust, the charioteer.\n\u003cbr\u003e High o\u0027er his head the circling lash he wields:\n\u003cbr\u003e His bounding horses scarcely touch the fields:\n\u003cbr\u003e His car amidst the dusty whirlwind roll\u0027d,\n\u003cbr\u003e Bright with the mingled blaze of tin and gold,\n\u003cbr\u003e Refulgent through the cloud: no eye could find\n\u003cbr\u003e The track his flying wheels had left behind:\n\u003cbr\u003e And the fierce coursers urged their rapid pace\n\u003cbr\u003e So swift, it seem\u0027d a flight, and not a race.\n\u003cbr\u003e Now victor at the goal Tydides stands,\n\u003cbr\u003e Quits his bright car, and springs upon the sands;\n\u003cbr\u003e From the hot steeds the sweaty torrents stream;\n\u003cbr\u003e The well-plied whip is hung athwart the beam:\n\u003cbr\u003e With joy brave Sthenelus receives the prize,\n\u003cbr\u003e The tripod-vase, and dame with radiant eyes:\n\u003cbr\u003e These to the ships his train triumphant leads,\n\u003cbr\u003e The chief himself unyokes the panting steeds.\n\u003cbr\u003e Young Nestor follows (who by art, not force,\n\u003cbr\u003e O\u0027erpass\u0027d Atrides) second in the course.\n\u003cbr\u003e Behind, Atrides urged the race, more near\n\u003cbr\u003e Than to the courser in his swift career\n\u003cbr\u003e The following car, just touching with his heel\n\u003cbr\u003e And brushing with his tail the whirling wheel:\n\u003cbr\u003e Such, and so narrow now the space between\n\u003cbr\u003e The rivals, late so distant on the green;\n\u003cbr\u003e So soon swift ?the her lost ground regain\u0027d,\n\u003cbr\u003e One length, one moment, had the race obtain\u0027d.\n\u003cbr\u003e Merion pursued, at greater distance still,\n\u003cbr\u003e With tardier coursers, and inferior skill.\n\u003cbr\u003e Last came, Admetus! thy unhappy son;\n\u003cbr\u003e Slow dragged the steeds his batter\u0027d chariot on:\n\u003cbr\u003e Achilles saw, and pitying thus begun:\n\u003cbr\u003e [pg 419]\n\u003cbr\u003e \"Behold! the man whose matchless art surpass\u0027d\n\u003cbr\u003e The sons of Greece! the ablest, yet the last!\n\u003cbr\u003e Fortune denies, but justice bids us pay\n\u003cbr\u003e (Since great Tydides bears the first away)\n\u003cbr\u003e To him the second honours of the day.\"\n\u003cbr\u003e The Greeks consent with loud-applauding cries,\n\u003cbr\u003e And then Eumelus had received the prize,\n\u003cbr\u003e But youthful Nestor, jealous of his fame,\n\u003cbr\u003e The award opposes, and asserts his claim.\n\u003cbr\u003e \"Think not (he cries) I tamely will resign,\n\u003cbr\u003e O Peleus\u0027 son! the mare so justly mine.\n\u003cbr\u003e What if the gods, the skilful to confound,\n\u003cbr\u003e Have thrown the horse and horseman to the ground?\n\u003cbr\u003e Perhaps he sought not heaven by sacrifice,\n\u003cbr\u003e And vows omitted forfeited the prize.\n\u003cbr\u003e If yet (distinction to thy friend to show,\n\u003cbr\u003e And please a soul desirous to bestow)\n\u003cbr\u003e Some gift must grace Eumelus, view thy store\n\u003cbr\u003e Of beauteous handmaids, steeds, and shining ore;\n\u003cbr\u003e An ample present let him thence receive,\n\u003cbr\u003e And Greece shall praise thy generous thirst to give.\n\u003cbr\u003e But this my prize I never shall forego;\n\u003cbr\u003e This, who but touches, warriors! is my foe.\"\n\u003cbr\u003e Thus spake the youth; nor did his words offend;\n\u003cbr\u003e Pleased with the well-turn\u0027d flattery of a friend,\n\u003cbr\u003e Achilles smiled: \"The gift proposed (he cried),\n\u003cbr\u003e Antilochus! we shall ourself provide.\n\u003cbr\u003e With plates of brass the corslet cover\u0027d o\u0027er,\n\u003cbr\u003e (The same renown\u0027d Asteropaeus wore,)\n\u003cbr\u003e Whose glittering margins raised with silver shine,\n\u003cbr\u003e (No vulgar gift,) Eumelus! shall be thine.\"\n\u003cbr\u003e He said: Automedon at his command\n\u003cbr\u003e The corslet brought, and gave it to his hand.\n\u003cbr\u003e Distinguish\u0027d by his friend, his bosom glows\n\u003cbr\u003e With generous joy: then Menelaus rose;\n\u003cbr\u003e The herald placed the sceptre in his hands,\n\u003cbr\u003e And still\u0027d the clamour of the shouting bands.\n\u003cbr\u003e Not without cause incensed at Nestor\u0027s son,\n\u003cbr\u003e And inly grieving, thus the king begun:\n\u003cbr\u003e \"The praise of wisdom, in thy youth obtain\u0027d,\n\u003cbr\u003e An act so rash, Antilochus! has stain\u0027d.\n\u003cbr\u003e Robb\u0027d of my glory and my just reward,\n\u003cbr\u003e To you, O Grecians! be my wrong declared:\n\u003cbr\u003e So not a leader shall our conduct blame,\n\u003cbr\u003e Or judge me envious of a rival\u0027s fame.\n\u003cbr\u003e But shall not we, ourselves, the truth maintain?\n\u003cbr\u003e What needs appealing in a fact so plain?\n\u003cbr\u003e What Greek shall blame me, if I bid thee rise,\n\u003cbr\u003e And vindicate by oath th\u0027 ill-gotten prize?\n\u003cbr\u003e Rise if thou darest, before thy chariot stand,\n\u003cbr\u003e [pg 420]\n\u003cbr\u003e The driving scourge high-lifted in thy hand;\n\u003cbr\u003e And touch thy steeds, and swear thy whole intent\n\u003cbr\u003e Was but to conquer, not to circumvent.\n\u003cbr\u003e Swear by that god whose liquid arms surround\n\u003cbr\u003e The globe, and whose dread earthquakes heave the ground!\"\n\u003cbr\u003e The prudent chief with calm attention heard;\n\u003cbr\u003e Then mildly thus: \"Excuse, if youth have err\u0027d;\n\u003cbr\u003e Superior as thou art, forgive the offence,\n\u003cbr\u003e Nor I thy equal, or in years, or sense.\n\u003cbr\u003e Thou know\u0027st the errors of unripen\u0027d age,\n\u003cbr\u003e Weak are its counsels, headlong is its rage.\n\u003cbr\u003e The prize I quit, if thou thy wrath resign;\n\u003cbr\u003e The mare, or aught thou ask\u0027st, be freely thine\n\u003cbr\u003e Ere I become (from thy dear friendship torn)\n\u003cbr\u003e Hateful to thee, and to the gods forsworn.\"\n\u003cbr\u003e So spoke Antilochus; and at the word\n\u003cbr\u003e The mare contested to the king restored.\n\u003cbr\u003e Joy swells his soul: as when the vernal grain\n\u003cbr\u003e Lifts the green ear above the springing plain,\n\u003cbr\u003e The fields their vegetable life renew,\n\u003cbr\u003e And laugh and glitter with the morning dew;\n\u003cbr\u003e Such joy the Spartan\u0027s shining face o\u0027erspread,\n\u003cbr\u003e And lifted his gay heart, while thus he said:\n\u003cbr\u003e \"Still may our souls, O generous youth! agree\n\u003cbr\u003e \u0027Tis now Atrides\u0027 turn to yield to thee.\n\u003cbr\u003e Rash heat perhaps a moment might control,\n\u003cbr\u003e Not break, the settled temper of thy soul.\n\u003cbr\u003e Not but (my friend) \u0027tis still the wiser way\n\u003cbr\u003e To waive contention with superior sway;\n\u003cbr\u003e For ah! how few, who should like thee offend,\n\u003cbr\u003e Like thee, have talents to regain the friend!\n\u003cbr\u003e To plead indulgence, and thy fault atone,\n\u003cbr\u003e Suffice thy father\u0027s merit and thy own:\n\u003cbr\u003e Generous alike, for me, the sire and son\n\u003cbr\u003e Have greatly suffer\u0027d, and have greatly done.\n\u003cbr\u003e I yield; that all may know, my soul can bend,\n\u003cbr\u003e Nor is my pride preferr\u0027d before my friend.\"\n\u003cbr\u003e He said; and pleased his passion to command,\n\u003cbr\u003e Resign\u0027d the courser to Noemon\u0027s hand,\n\u003cbr\u003e Friend of the youthful chief: himself content,\n\u003cbr\u003e The shining charger to his vessel sent.\n\u003cbr\u003e The golden talents Merion next obtain\u0027d;\n\u003cbr\u003e The fifth reward, the double bowl, remain\u0027d.\n\u003cbr\u003e Achilles this to reverend Nestor bears.\n\u003cbr\u003e And thus the purpose of his gift declares:\n\u003cbr\u003e \"Accept thou this, O sacred sire! (he said)\n\u003cbr\u003e In dear memorial of Patroclus dead;\n\u003cbr\u003e Dead and for ever lost Patroclus lies,\n\u003cbr\u003e For ever snatch\u0027d from our desiring eyes!\n\u003cbr\u003e Take thou this token of a grateful heart,\n\u003cbr\u003e [pg 421]\n\u003cbr\u003e Though \u0027tis not thine to hurl the distant dart,\n\u003cbr\u003e The quoit to toss, the ponderous mace to wield,\n\u003cbr\u003e Or urge the race, or wrestle on the field:\n\u003cbr\u003e Thy pristine vigour age has overthrown,\n\u003cbr\u003e But left the glory of the past thy own.\"\n\u003cbr\u003e He said, and placed the goblet at his side;\n\u003cbr\u003e With joy the venerable king replied:\n\u003cbr\u003e \"Wisely and well, my son, thy words have proved\n\u003cbr\u003e A senior honour\u0027d, and a friend beloved!\n\u003cbr\u003e Too true it is, deserted of my strength,\n\u003cbr\u003e These wither\u0027d arms and limbs have fail\u0027d at length.\n\u003cbr\u003e Oh! had I now that force I felt of yore,\n\u003cbr\u003e Known through Buprasium and the Pylian shore!\n\u003cbr\u003e Victorious then in every solemn game,\n\u003cbr\u003e Ordain\u0027d to Amarynces\u0027 mighty name;\n\u003cbr\u003e The brave Epeians gave my glory way,\n\u003cbr\u003e ?tolians, Pylians, all resign\u0027d the day.\n\u003cbr\u003e I quell\u0027d Clytomedes in fights of hand,\n\u003cbr\u003e And backward hurl\u0027d Ancaeus on the sand,\n\u003cbr\u003e Surpass\u0027d Iphyclus in the swift career,\n\u003cbr\u003e Phyleus and Polydorus with the spear.\n\u003cbr\u003e The sons of Actor won the prize of horse,\n\u003cbr\u003e But won by numbers, not by art or force:\n\u003cbr\u003e For the famed twins, impatient to survey\n\u003cbr\u003e Prize after prize by Nestor borne away,\n\u003cbr\u003e Sprung to their car; and with united pains\n\u003cbr\u003e One lash\u0027d the coursers, while one ruled the reins.\n\u003cbr\u003e Such once I was! Now to these tasks succeeds\n\u003cbr\u003e A younger race, that emulate our deeds:\n\u003cbr\u003e I yield, alas! (to age who must not yield?)\n\u003cbr\u003e Though once the foremost hero of the field.\n\u003cbr\u003e Go thou, my son! by generous friendship led,\n\u003cbr\u003e With martial honours decorate the dead:\n\u003cbr\u003e While pleased I take the gift thy hands present,\n\u003cbr\u003e (Pledge of benevolence, and kind intent,)\n\u003cbr\u003e Rejoiced, of all the numerous Greeks, to see\n\u003cbr\u003e Not one but honours sacred age and me:\n\u003cbr\u003e Those due distinctions thou so well canst pay,\n\u003cbr\u003e May the just gods return another day!\"\n\u003cbr\u003e Proud of the gift, thus spake the full of days:\n\u003cbr\u003e Achilles heard him, prouder of the praise.\n\u003cbr\u003e The prizes next are order\u0027d to the field,\n\u003cbr\u003e For the bold champions who the caestus wield.\n\u003cbr\u003e A stately mule, as yet by toils unbroke,\n\u003cbr\u003e Of six years\u0027 age, unconscious of the yoke,\n\u003cbr\u003e Is to the circus led, and firmly bound;\n\u003cbr\u003e Next stands a goblet, massy, large, and round.\n\u003cbr\u003e Achilles rising, thus: \"Let Greece excite\n\u003cbr\u003e Two heroes equal to this hardy fight;\n\u003cbr\u003e Who dare the foe with lifted arms provoke,\n\u003cbr\u003e [pg 422]\n\u003cbr\u003e And rush beneath the long-descending stroke.\n\u003cbr\u003e On whom Apollo shall the palm bestow,\n\u003cbr\u003e And whom the Greeks supreme by conquest know,\n\u003cbr\u003e This mule his dauntless labours shall repay,\n\u003cbr\u003e The vanquish\u0027d bear the massy bowl away.\"\n\u003cbr\u003e This dreadful combat great Epeus chose;291\n\u003cbr\u003e High o\u0027er the crowd, enormous bulk! he rose,\n\u003cbr\u003e And seized the beast, and thus began to say:\n\u003cbr\u003e \"Stand forth some man, to bear the bowl away!\n\u003cbr\u003e (Price of his ruin: for who dares deny\n\u003cbr\u003e This mule my right; the undoubted victor I)\n\u003cbr\u003e Others, \u0027tis own\u0027d, in fields of battle shine,\n\u003cbr\u003e But the first honours of this fight are mine;\n\u003cbr\u003e For who excels in all? Then let my foe\n\u003cbr\u003e Draw near, but first his certain fortune know;\n\u003cbr\u003e Secure this hand shall his whole frame confound,\n\u003cbr\u003e Mash all his bones, and all his body pound:\n\u003cbr\u003e So let his friends be nigh, a needful train,\n\u003cbr\u003e To heave the batter\u0027d carcase off the plain.\"\n\u003cbr\u003e The giant spoke; and in a stupid gaze\n\u003cbr\u003e The host beheld him, silent with amaze!\n\u003cbr\u003e \u0027Twas thou, Euryalus! who durst aspire\n\u003cbr\u003e To meet his might, and emulate thy sire,\n\u003cbr\u003e The great Mecistheus; who in days of yore\n\u003cbr\u003e In Theban games the noblest trophy bore,\n\u003cbr\u003e (The games ordain\u0027d dead OEdipus to grace,)\n\u003cbr\u003e And singly vanquish the Cadmean race.\n\u003cbr\u003e Him great Tydides urges to contend,\n\u003cbr\u003e Warm with the hopes of conquest for his friend;\n\u003cbr\u003e Officious with the cincture girds him round;\n\u003cbr\u003e And to his wrist the gloves of death are bound.\n\u003cbr\u003e Amid the circle now each champion stands,\n\u003cbr\u003e And poises high in air his iron hands;\n\u003cbr\u003e With clashing gauntlets now they fiercely close,\n\u003cbr\u003e [pg 423]\n\u003cbr\u003e Their crackling jaws re-echo to the blows,\n\u003cbr\u003e And painful sweat from all their members flows.\n\u003cbr\u003e At length Epeus dealt a weighty blow\n\u003cbr\u003e Full on the cheek of his unwary foe;\n\u003cbr\u003e Beneath that ponderous arm\u0027s resistless sway\n\u003cbr\u003e Down dropp\u0027d he, nerveless, and extended lay.\n\u003cbr\u003e As a large fish, when winds and waters roar,\n\u003cbr\u003e By some huge billow dash\u0027d against the shore,\n\u003cbr\u003e Lies panting; not less batter\u0027d with his wound,\n\u003cbr\u003e The bleeding hero pants upon the ground.\n\u003cbr\u003e To rear his fallen foe, the victor lends,\n\u003cbr\u003e Scornful, his hand; and gives him to his friends;\n\u003cbr\u003e Whose arms support him, reeling through the throng,\n\u003cbr\u003e And dragging his disabled legs along;\n\u003cbr\u003e Nodding, his head hangs down his shoulder o\u0027er;\n\u003cbr\u003e His mouth and nostrils pour the clotted gore;292\n\u003cbr\u003e Wrapp\u0027d round in mists he lies, and lost to thought;\n\u003cbr\u003e His friends receive the bowl, too dearly bought.\n\u003cbr\u003e The third bold game Achilles next demands,\n\u003cbr\u003e And calls the wrestlers to the level sands:\n\u003cbr\u003e A massy tripod for the victor lies,\n\u003cbr\u003e Of twice six oxen its reputed price;\n\u003cbr\u003e And next, the loser\u0027s spirits to restore,\n\u003cbr\u003e A female captive, valued but at four.\n\u003cbr\u003e Scarce did the chief the vigorous strife prop\n\u003cbr\u003e When tower-like Ajax and Ulysses rose.\n\u003cbr\u003e Amid the ring each nervous rival stands,\n\u003cbr\u003e Embracing rigid with implicit hands.\n\u003cbr\u003e Close lock\u0027d above, their heads and arms are mix\u0027d:\n\u003cbr\u003e Below, their planted feet at distance fix\u0027d;\n\u003cbr\u003e Like two strong rafters which the builder forms,\n\u003cbr\u003e Proof to the wintry winds and howling storms,\n\u003cbr\u003e Their tops connected, but at wider space\n\u003cbr\u003e Fix\u0027d on the centre stands their solid base.\n\u003cbr\u003e Now to the grasp each manly body bends;\n\u003cbr\u003e The humid sweat from every pore descends;\n\u003cbr\u003e Their bones resound with blows: sides, shoulders, thighs\n\u003cbr\u003e Swell to each gripe, and bloody tumours rise.\n\u003cbr\u003e Nor could Ulysses, for his art renown\u0027d,\n\u003cbr\u003e O\u0027erturn the strength of Ajax on the ground;\n\u003cbr\u003e Nor could the strength of Ajax overthrow\n\u003cbr\u003e The watchful caution of his artful foe.\n\u003cbr\u003e While the long strife even tired the lookers on,\n\u003cbr\u003e Thus to Ulysses spoke great Telamon:\n\u003cbr\u003e \"Or let me lift thee, chief, or lift thou me:\n\u003cbr\u003e Prove we our force, and Jove the rest decree.\"\n\u003cbr\u003e [pg 424]\n\u003cbr\u003e He said; and, straining, heaved him off the ground\n\u003cbr\u003e With matchless strength; that time Ulysses found\n\u003cbr\u003e The strength to evade, and where the nerves combine\n\u003cbr\u003e His ankle struck: the giant fell supine;\n\u003cbr\u003e Ulysses, following, on his bosom lies;\n\u003cbr\u003e Shouts of applause run rattling through the skies.\n\u003cbr\u003e Ajax to lift Ulysses next essays;\n\u003cbr\u003e He barely stirr\u0027d him, but he could not raise:\n\u003cbr\u003e His knee lock\u0027d fast, the foe\u0027s attempt denied;\n\u003cbr\u003e And grappling close, they tumbled side by side.\n\u003cbr\u003e Defiled with honourable dust they roll,\n\u003cbr\u003e Still breathing strife, and unsubdued of soul:\n\u003cbr\u003e Again they rage, again to combat rise;\n\u003cbr\u003e When great Achilles thus divides the prize:\n\u003cbr\u003e \"Your noble vigour, O my friends, restrain;\n\u003cbr\u003e Nor weary out your generous strength in vain.\n\u003cbr\u003e Ye both have won: let others who excel,\n\u003cbr\u003e Now prove that prowess you have proved so well.\"\n\u003cbr\u003e The hero\u0027s words the willing chiefs obey,\n\u003cbr\u003e From their tired bodies wipe the dust away,\n\u003cbr\u003e And, clothed anew, the following games survey.\n\u003cbr\u003e And now succeed the gifts ordain\u0027d to grace\n\u003cbr\u003e The youths contending in the rapid race:\n\u003cbr\u003e A silver urn that full six measures held,\n\u003cbr\u003e By none in weight or workmanship excell\u0027d:\n\u003cbr\u003e Sidonian artists taught the frame to shine,\n\u003cbr\u003e Elaborate, with artifice divine;\n\u003cbr\u003e Whence Tyrian sailors did the prize transport,\n\u003cbr\u003e And gave to Thoas at the Lemnian port:\n\u003cbr\u003e From him descended, good Eunaeus heir\u0027d\n\u003cbr\u003e The glorious gift; and, for Lycaon spared,\n\u003cbr\u003e To brave Patroclus gave the rich reward:\n\u003cbr\u003e Now, the same hero\u0027s funeral rites to grace,\n\u003cbr\u003e It stands the prize of swiftness in the race.\n\u003cbr\u003e A well-fed ox was for the second placed;\n\u003cbr\u003e And half a talent must content the last.\n\u003cbr\u003e Achilles rising then bespoke the train:\n\u003cbr\u003e \"Who hope the palm of swiftness to obtain,\n\u003cbr\u003e Stand forth, and bear these prizes from the plain.\"\n\u003cbr\u003e The hero said, and starting from his place,\n\u003cbr\u003e Oilean Ajax rises to the race;\n\u003cbr\u003e Ulysses next; and he whose speed surpass\u0027d\n\u003cbr\u003e His youthful equals, Nestor\u0027s son, the last.\n\u003cbr\u003e Ranged in a line the ready racers stand;\n\u003cbr\u003e Pelides points the barrier with his hand;\n\u003cbr\u003e All start at once; Oileus led the race;\n\u003cbr\u003e The next Ulysses, measuring pace with pace;\n\u003cbr\u003e Behind him, diligently close, he sped,\n\u003cbr\u003e As closely following as the running thread\n\u003cbr\u003e The spindle follows, and displays the charms\n\u003cbr\u003e [pg 425]\n\u003cbr\u003e Of the fair spinster\u0027s breast and moving arms:\n\u003cbr\u003e Graceful in motion thus, his foe he plies,\n\u003cbr\u003e And treads each footstep ere the dust can rise;\n\u003cbr\u003e His glowing breath upon his shoulders plays:\n\u003cbr\u003e The admiring Greeks loud acclamations raise:\n\u003cbr\u003e To him they give their wishes, hearts, and eyes,\n\u003cbr\u003e And send their souls before him as he flies.\n\u003cbr\u003e Now three times turn\u0027d in prospect of the goal,\n\u003cbr\u003e The panting chief to Pallas lifts his soul:\n\u003cbr\u003e \"Assist, O goddess!\" thus in thought he pray\u0027d!\n\u003cbr\u003e And present at his thought descends the maid.\n\u003cbr\u003e Buoy\u0027d by her heavenly force, he seems to swim,\n\u003cbr\u003e And feels a pinion lifting every limb.\n\u003cbr\u003e All fierce, and ready now the prize to gain,\n\u003cbr\u003e Unhappy Ajax stumbles on the plain\n\u003cbr\u003e (O\u0027erturn\u0027d by Pallas), where the slippery shore\n\u003cbr\u003e Was clogg\u0027d with slimy dung and mingled gore.\n\u003cbr\u003e (The self-same place beside Patroclus\u0027 pyre,\n\u003cbr\u003e Where late the slaughter\u0027d victims fed the fire.)\n\u003cbr\u003e Besmear\u0027d with filth, and blotted o\u0027er with clay,\n\u003cbr\u003e Obscene to sight, the rueful racer lay;\n\u003cbr\u003e The well-fed bull (the second prize) he shared,\n\u003cbr\u003e And left the urn Ulysses\u0027 rich reward.\n\u003cbr\u003e Then, grasping by the horn the mighty beast,\n\u003cbr\u003e The baffled hero thus the Greeks address\u0027d:\n\u003cbr\u003e \"Accursed fate! the conquest I forego;\n\u003cbr\u003e A mortal I, a goddess was my foe;\n\u003cbr\u003e She urged her favourite on the rapid way,\n\u003cbr\u003e And Pallas, not Ulysses, won the day.\"\n\u003cbr\u003e Thus sourly wail\u0027d he, sputtering dirt and gore;\n\u003cbr\u003e A burst of laughter echoed through the shore.\n\u003cbr\u003e Antilochus, more humorous than the rest,\n\u003cbr\u003e Takes the last prize, and takes it with a jest:\n\u003cbr\u003e \"Why with our wiser elders should we strive?\n\u003cbr\u003e The gods still love them, and they always thrive.\n\u003cbr\u003e Ye see, to Ajax I must yield the prize:\n\u003cbr\u003e He to Ulysses, still more aged and wise;\n\u003cbr\u003e (A green old age unconscious of decays,\n\u003cbr\u003e That proves the hero born in better days!)\n\u003cbr\u003e Behold his vigour in this active race!\n\u003cbr\u003e Achilles only boasts a swifter pace:\n\u003cbr\u003e For who can match Achilles? He who can,\n\u003cbr\u003e Must yet be more than hero, more than man.\"\n\u003cbr\u003e The effect succeeds the speech. Pelides cries,\n\u003cbr\u003e \"Thy artful praise deserves a better prize.\n\u003cbr\u003e Nor Greece in vain shall hear thy friend extoll\u0027d;\n\u003cbr\u003e Receive a talent of the purest gold.\"\n\u003cbr\u003e The youth departs content. The host admire\n\u003cbr\u003e The son of Nestor, worthy of his sire.\n\u003cbr\u003e Next these a buckler, spear, and helm, he brings;\n\u003cbr\u003e [pg 426]\n\u003cbr\u003e Cast on the plain, the brazen burden rings:\n\u003cbr\u003e Arms which of late divine Sarpedon wore,\n\u003cbr\u003e And great Patroclus in short triumph bore.\n\u003cbr\u003e \"Stand forth the bravest of our host! (he cries)\n\u003cbr\u003e Whoever dares deserve so rich a prize,\n\u003cbr\u003e Now grace the lists before our army\u0027s sight,\n\u003cbr\u003e And sheathed in steel, provoke his foe to fight.\n\u003cbr\u003e Who first the jointed armour shall explore,\n\u003cbr\u003e And stain his rival\u0027s mail with issuing gore,\n\u003cbr\u003e The sword Asteropaeus possess\u0027d of old,\n\u003cbr\u003e (A Thracian blade, distinct with studs of gold,)\n\u003cbr\u003e Shall pay the stroke, and grace the striker\u0027s side:\n\u003cbr\u003e These arms in common let the chiefs divide:\n\u003cbr\u003e For each brave champion, when the combat ends,\n\u003cbr\u003e A sumptuous banquet at our tents attends.\"\n\u003cbr\u003e Fierce at the word uprose great Tydeus\u0027 son,\n\u003cbr\u003e And the huge bulk of Ajax Telamon.\n\u003cbr\u003e Clad in refulgent steel, on either hand,\n\u003cbr\u003e The dreadful chiefs amid the circle stand;\n\u003cbr\u003e Louring they meet, tremendous to the sight;\n\u003cbr\u003e Each Argive bosom beats with fierce delight.\n\u003cbr\u003e Opposed in arms not long they idly stood,\n\u003cbr\u003e But thrice they closed, and thrice the charge renew\u0027d.\n\u003cbr\u003e A furious pass the spear of Ajax made\n\u003cbr\u003e Through the broad shield, but at the corslet stay\u0027d.\n\u003cbr\u003e Not thus the foe: his javelin aim\u0027d above\n\u003cbr\u003e The buckler\u0027s margin, at the neck he drove.\n\u003cbr\u003e But Greece, now trembling for her hero\u0027s life,\n\u003cbr\u003e Bade share the honours, and surcease the strife.\n\u003cbr\u003e Yet still the victor\u0027s due Tydides gains,\n\u003cbr\u003e With him the sword and studded belt remains.\n\u003cbr\u003e Then hurl\u0027d the hero, thundering on the ground,\n\u003cbr\u003e A mass of iron (an enormous round),\n\u003cbr\u003e Whose weight and size the circling Greeks admire,\n\u003cbr\u003e Rude from the furnace, and but shaped by fire.\n\u003cbr\u003e This mighty quoit Aetion wont to rear,\n\u003cbr\u003e And from his whirling arm dismiss in air;\n\u003cbr\u003e The giant by Achilles slain, he stow\u0027d\n\u003cbr\u003e Among his spoils this memorable load.\n\u003cbr\u003e For this, he bids those nervous artists vie,\n\u003cbr\u003e That teach the disk to sound along the sky.\n\u003cbr\u003e \"Let him, whose might can hurl this bowl, arise;\n\u003cbr\u003e Who farthest hurls it, take it as his prize;\n\u003cbr\u003e If he be one enrich\u0027d with large domain\n\u003cbr\u003e Of downs for flocks, and arable for grain,\n\u003cbr\u003e Small stock of iron needs that man provide;\n\u003cbr\u003e His hinds and swains whole years shall be supplied\n\u003cbr\u003e From hence; nor ask the neighbouring city\u0027s aid\n\u003cbr\u003e For ploughshares, wheels, and all the rural trade.\"\n\u003cbr\u003e Stern Polypoetes stepp\u0027d before the throng,\n\u003cbr\u003e [pg 427]\n\u003cbr\u003e And great Leonteus, more than mortal strong;\n\u003cbr\u003e Whose force with rival forces to oppose,\n\u003cbr\u003e Uprose great Ajax; up Epeus rose.\n\u003cbr\u003e Each stood in order: first Epeus threw;\n\u003cbr\u003e High o\u0027er the wondering crowds the whirling circle flew.\n\u003cbr\u003e Leonteus next a little space surpass\u0027d;\n\u003cbr\u003e And third, the strength of godlike Ajax cast.\n\u003cbr\u003e O\u0027er both their marks it flew; till fiercely flung\n\u003cbr\u003e From Polypoetes\u0027 arm the discus sung:\n\u003cbr\u003e Far as a swain his whirling sheephook throws,\n\u003cbr\u003e That distant falls among the grazing cows,\n\u003cbr\u003e So past them all the rapid circle flies:\n\u003cbr\u003e His friends, while loud applauses shake the skies,\n\u003cbr\u003e With force conjoin\u0027d heave off the weighty prize.\n\u003cbr\u003e Those, who in skilful archery contend,\n\u003cbr\u003e He next invites the twanging bow to bend;\n\u003cbr\u003e And twice ten axes casts amidst the round,\n\u003cbr\u003e Ten double-edged, and ten that singly wound\n\u003cbr\u003e The mast, which late a first-rate galley bore,\n\u003cbr\u003e The hero fixes in the sandy shore;\n\u003cbr\u003e To the tall top a milk-white dove they tie,\n\u003cbr\u003e The trembling mark at which their arrows fly.\n\u003cbr\u003e \"Whose weapon strikes yon fluttering bird, shall bear\n\u003cbr\u003e These two-edged axes, terrible in war;\n\u003cbr\u003e The single, he whose shaft divides the cord.\"\n\u003cbr\u003e He said: experienced Merion took the word;\n\u003cbr\u003e And skilful Teucer: in the helm they threw\n\u003cbr\u003e Their lots inscribed, and forth the latter flew.\n\u003cbr\u003e Swift from the string the sounding arrow flies;\n\u003cbr\u003e But flies unbless\u0027d! No grateful sacrifice,\n\u003cbr\u003e No firstling lambs, unheedful! didst thou vow\n\u003cbr\u003e To Phoebus, patron of the shaft and bow.\n\u003cbr\u003e For this, thy well-aim\u0027d arrow turn\u0027d aside,\n\u003cbr\u003e Err\u0027d from the dove, yet cut the cord that tied:\n\u003cbr\u003e Adown the mainmast fell the parted string,\n\u003cbr\u003e And the free bird to heaven displays her wing:\n\u003cbr\u003e Sea, shores, and skies, with loud applause resound,\n\u003cbr\u003e And Merion eager meditates the wound:\n\u003cbr\u003e He takes the bow, directs the shaft above,\n\u003cbr\u003e And following with his eye the soaring dove,\n\u003cbr\u003e Implores the god to speed it through the skies,\n\u003cbr\u003e With vows of firstling lambs, and grateful sacrific\n\u003cbr\u003e The dove, in airy circles as she wheels,\n\u003cbr\u003e Amid the clouds the piercing arrow feels;\n\u003cbr\u003e Quite through and through the point its passage found,\n\u003cbr\u003e And at his feet fell bloody to the ground.\n\u003cbr\u003e The wounded bird, ere yet she breathed her last,\n\u003cbr\u003e With flagging wings alighted on the mast,\n\u003cbr\u003e A moment hung, and spread her pinions there,\n\u003cbr\u003e Then sudden dropp\u0027d, and left her life in air.\n\u003cbr\u003e [pg 428]\n\u003cbr\u003e From the pleased crowd new peals of thunder rise,\n\u003cbr\u003e And to the ships brave Merion bears the prize.\n\u003cbr\u003e To close the funeral games, Achilles last\n\u003cbr\u003e A massy spear amid the circle placed,\n\u003cbr\u003e And ample charger of unsullied frame,\n\u003cbr\u003e With flowers high-wrought, not blacken\u0027d yet by flame.\n\u003cbr\u003e For these he bids the heroes prove their art,\n\u003cbr\u003e Whose dexterous skill directs the flying dart.\n\u003cbr\u003e Here too great Merion hopes the noble prize;\n\u003cbr\u003e Nor here disdain\u0027d the king of men to rise.\n\u003cbr\u003e With joy Pelides saw the honour paid,\n\u003cbr\u003e Rose to the monarch, and respectful said:\n\u003cbr\u003e \"Thee first in virtue, as in power supreme,\n\u003cbr\u003e O king of nations! all thy Greeks proclaim;\n\u003cbr\u003e In every martial game thy worth attest,\n\u003cbr\u003e And know thee both their greatest and their best.\n\u003cbr\u003e Take then the prize, but let brave Merion bear\n\u003cbr\u003e This beamy javelin in thy brother\u0027s war.\"\n\u003cbr\u003e Pleased from the hero\u0027s lips his praise to hear,\n\u003cbr\u003e The king to Merion gives the brazen spear:\n\u003cbr\u003e But, set apart for sacred use, commands\n\u003cbr\u003e The glittering charger to Talthybius\u0027 hands.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: CERES.\n\u003cbr\u003e CERES.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/46009.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
