{"id":34768,"no":6,"title":"BOOK IV.","content":"ARGUMENT.\n\u003cbr\u003e \n\u003cbr\u003e THE BREACH OF THE TRUCE, AND THE FIRST BATTLE.\n\u003cbr\u003e \n\u003cbr\u003e The gods deliberate in council concerning the Trojan war: they agree upon the continuation of it, and Jupiter sends down Minerva to break the truce. She persuades Pandarus to aim an arrow at Menelaus, who is wounded, but cured by Machaon. In the meantime some of the Trojan troops attack the Greeks. Agamemnon is distinguished in all the parts of a good general; he reviews the troops, and exhorts the leaders, some by praises and others by reproof. Nestor is particularly celebrated for his military discipline. The battle joins, and great numbers are slain on both sides.\n\u003cbr\u003e \n\u003cbr\u003e The same day continues through this as through the last book (as it does also through the two following, and almost to the end of the seventh book). The scene is wholly in the field before Troy.\n\u003cbr\u003e And now Olympus\u0027 shining gates unfold;\n\u003cbr\u003e The gods, with Jove, assume their thrones of gold:\n\u003cbr\u003e Immortal Hebe, fresh with bloom divine,\n\u003cbr\u003e The golden goblet crowns with purple wine:\n\u003cbr\u003e While the full bowls flow round, the powers employ\n\u003cbr\u003e Their careful eyes on long-contended Troy.\n\u003cbr\u003e When Jove, disposed to tempt Saturnia\u0027s spleen,\n\u003cbr\u003e Thus waked the fury of his partial queen,\n\u003cbr\u003e \"Two powers divine the son of Atreus aid,\n\u003cbr\u003e Imperial Juno, and the martial maid;125\n\u003cbr\u003e But high in heaven they sit, and gaze from far,\n\u003cbr\u003e The tame spectators of his deeds of war.\n\u003cbr\u003e Not thus fair Venus helps her favour\u0027d knight,\n\u003cbr\u003e The queen of pleasures shares the toils of fight,\n\u003cbr\u003e Each danger wards, and constant in her care,\n\u003cbr\u003e Saves in the moment of the last despair.\n\u003cbr\u003e Her act has rescued Paris\u0027 forfeit life,\n\u003cbr\u003e Though great Atrides gain\u0027d the glorious strife.\n\u003cbr\u003e Then say, ye powers! what signal issue waits\n\u003cbr\u003e To crown this deed, and finish all the fates!\n\u003cbr\u003e [pg 068]\n\u003cbr\u003e Shall Heaven by peace the bleeding kingdoms spare,\n\u003cbr\u003e Or rouse the furies, and awake the war?\n\u003cbr\u003e Yet, would the gods for human good provide,\n\u003cbr\u003e Atrides soon might gain his beauteous bride,\n\u003cbr\u003e Still Priam\u0027s walls in peaceful honours grow,\n\u003cbr\u003e And through his gates the crowding nations flow.\"\n\u003cbr\u003e Thus while he spoke, the queen of heaven, enraged,\n\u003cbr\u003e And queen of war, in close consult engaged:\n\u003cbr\u003e Apart they sit, their deep designs employ,\n\u003cbr\u003e And meditate the future woes of Troy.\n\u003cbr\u003e Though secret anger swell\u0027d Minerva\u0027s breast,\n\u003cbr\u003e The prudent goddess yet her wrath suppress\u0027d;\n\u003cbr\u003e But Juno, impotent of passion, broke\n\u003cbr\u003e Her sullen silence, and with fury spoke:\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \"Shall then, O tyrant of the ethereal reign!\n\u003cbr\u003e My schemes, my labours, and my hopes be vain?\n\u003cbr\u003e Have I, for this, shook Ilion with alarms,\n\u003cbr\u003e Assembled nations, set two worlds in arms?\n\u003cbr\u003e To spread the war, I flew from shore to shore;\n\u003cbr\u003e The immortal coursers scarce the labour bore.\n\u003cbr\u003e At length ripe vengeance o\u0027er their heads impends,\n\u003cbr\u003e But Jove himself the faithless race defends.\n\u003cbr\u003e Loth as thou art to punish lawless lust,\n\u003cbr\u003e Not all the gods are partial and unjust.\"\n\u003cbr\u003e The sire whose thunder shakes the cloudy skies,\n\u003cbr\u003e Sighs from his inmost soul, and thus replies:\n\u003cbr\u003e \"Oh lasting rancour! oh insatiate hate\n\u003cbr\u003e To Phrygia\u0027s monarch, and the Phrygian state!\n\u003cbr\u003e What high offence has fired the wife of Jove?\n\u003cbr\u003e Can wretched mortals harm the powers above,\n\u003cbr\u003e [pg 069]\n\u003cbr\u003e That Troy, and Troy\u0027s whole race thou wouldst confound,\n\u003cbr\u003e And yon fair structures level with the ground!\n\u003cbr\u003e Haste, leave the skies, fulfil thy stern desire,\n\u003cbr\u003e Burst all her gates, and wrap her walls in fire!\n\u003cbr\u003e Let Priam bleed! if yet you thirst for more,\n\u003cbr\u003e Bleed all his sons, and Ilion float with gore:\n\u003cbr\u003e To boundless vengeance the wide realm be given,\n\u003cbr\u003e Till vast destruction glut the queen of heaven!\n\u003cbr\u003e So let it be, and Jove his peace enjoy,126\n\u003cbr\u003e When heaven no longer hears the name of Troy.\n\u003cbr\u003e But should this arm prepare to wreak our hate\n\u003cbr\u003e On thy loved realms, whose guilt demands their fate;\n\u003cbr\u003e Presume not thou the lifted bolt to stay,\n\u003cbr\u003e Remember Troy, and give the vengeance way.\n\u003cbr\u003e For know, of all the numerous towns that rise\n\u003cbr\u003e Beneath the rolling sun and starry skies,\n\u003cbr\u003e Which gods have raised, or earth-born men enjoy,\n\u003cbr\u003e None stands so dear to Jove as sacred Troy.\n\u003cbr\u003e No mortals merit more distinguish\u0027d grace\n\u003cbr\u003e Than godlike Priam, or than Priam\u0027s race.\n\u003cbr\u003e Still to our name their hecatombs expire,\n\u003cbr\u003e And altars blaze with unextinguish\u0027d fire.\"\n\u003cbr\u003e At this the goddess rolled her radiant eyes,\n\u003cbr\u003e Then on the Thunderer fix\u0027d them, and replies:\n\u003cbr\u003e \"Three towns are Juno\u0027s on the Grecian plains,\n\u003cbr\u003e More dear than all the extended earth contains,\n\u003cbr\u003e Mycenae, Argos, and the Spartan wall;127\n\u003cbr\u003e These thou mayst raze, nor I forbid their fall:\n\u003cbr\u003e \u0027Tis not in me the vengeance to remove;\n\u003cbr\u003e The crime\u0027s sufficient that they share my love.\n\u003cbr\u003e Of power superior why should I complain?\n\u003cbr\u003e Resent I may, but must resent in vain.\n\u003cbr\u003e Yet some distinction Juno might require,\n\u003cbr\u003e Sprung with thyself from one celestial sire,\n\u003cbr\u003e A goddess born, to share the realms above,\n\u003cbr\u003e And styled the consort of the thundering Jove;\n\u003cbr\u003e Nor thou a wife and sister\u0027s right deny;128\n\u003cbr\u003e Let both consent, and both by terms comply;\n\u003cbr\u003e So shall the gods our joint decrees obey,\n\u003cbr\u003e And heaven shall act as we direct the way.\n\u003cbr\u003e See ready Pallas waits thy high commands\n\u003cbr\u003e To raise in arms the Greek and Phrygian bands;\n\u003cbr\u003e [pg 070]\n\u003cbr\u003e Their sudden friendship by her arts may cease,\n\u003cbr\u003e And the proud Trojans first infringe the peace.\"\n\u003cbr\u003e The sire of men and monarch of the sky\n\u003cbr\u003e The advice approved, and bade Minerva fly,\n\u003cbr\u003e Dissolve the league, and all her arts employ\n\u003cbr\u003e To make the breach the faithless act of Troy.\n\u003cbr\u003e Fired with the charge, she headlong urged her flight,\n\u003cbr\u003e And shot like lightning from Olympus\u0027 height.\n\u003cbr\u003e As the red comet, from Saturnius sent\n\u003cbr\u003e To fright the nations with a dire portent,\n\u003cbr\u003e (A fatal sign to armies on the plain,\n\u003cbr\u003e Or trembling sailors on the wintry main,)\n\u003cbr\u003e With sweeping glories glides along in air,\n\u003cbr\u003e And shakes the sparkles from its blazing hair:129\n\u003cbr\u003e Between both armies thus, in open sight\n\u003cbr\u003e Shot the bright goddess in a trail of light,\n\u003cbr\u003e With eyes erect the gazing hosts admire\n\u003cbr\u003e The power descending, and the heavens on fire!\n\u003cbr\u003e \"The gods (they cried), the gods this signal sent,\n\u003cbr\u003e And fate now labours with some vast event:\n\u003cbr\u003e Jove seals the league, or bloodier scenes prepares;\n\u003cbr\u003e Jove, the great arbiter of peace and wars.\"\n\u003cbr\u003e They said, while Pallas through the Trojan throng,\n\u003cbr\u003e (In shape a mortal,) pass\u0027d disguised along.\n\u003cbr\u003e Like bold Laodocus, her course she bent,\n\u003cbr\u003e Who from Antenor traced his high descent.\n\u003cbr\u003e Amidst the ranks Lycaon\u0027s son she found,\n\u003cbr\u003e The warlike Pandarus, for strength renown\u0027d;\n\u003cbr\u003e Whose squadrons, led from black ?sepus\u0027 flood,130\n\u003cbr\u003e With flaming shields in martial circle stood.\n\u003cbr\u003e To him the goddess: \"Phrygian! canst thou hear\n\u003cbr\u003e A well-timed counsel with a willing ear?\n\u003cbr\u003e What praise were thine, couldst thou direct thy dart,\n\u003cbr\u003e Amidst his triumph, to the Spartan\u0027s heart?\n\u003cbr\u003e What gifts from Troy, from Paris wouldst thou gain,\n\u003cbr\u003e Thy country\u0027s foe, the Grecian glory slain?\n\u003cbr\u003e Then seize the occasion, dare the mighty deed,\n\u003cbr\u003e Aim at his breast, and may that aim succeed!\n\u003cbr\u003e But first, to speed the shaft, address thy vow\n\u003cbr\u003e To Lycian Phoebus with the silver bow,\n\u003cbr\u003e And swear the firstlings of thy flock to pay,\n\u003cbr\u003e On Zelia\u0027s altars, to the god of day.\"131\n\u003cbr\u003e He heard, and madly at the motion pleased,\n\u003cbr\u003e [pg 071]\n\u003cbr\u003e His polish\u0027d bow with hasty rashness seized.\n\u003cbr\u003e \u0027Twas form\u0027d of horn, and smooth\u0027d with artful toil:\n\u003cbr\u003e A mountain goat resign\u0027d the shining spoil.\n\u003cbr\u003e Who pierced long since beneath his arrows bled;\n\u003cbr\u003e The stately quarry on the cliffs lay dead,\n\u003cbr\u003e And sixteen palms his brow\u0027s large honours spread:\n\u003cbr\u003e The workmen join\u0027d, and shaped the bended horns,\n\u003cbr\u003e And beaten gold each taper point adorns.\n\u003cbr\u003e This, by the Greeks unseen, the warrior bends,\n\u003cbr\u003e Screen\u0027d by the shields of his surrounding friends:\n\u003cbr\u003e There meditates the mark; and couching low,\n\u003cbr\u003e Fits the sharp arrow to the well-strung bow.\n\u003cbr\u003e One from a hundred feather\u0027d deaths he chose,\n\u003cbr\u003e Fated to wound, and cause of future woes;\n\u003cbr\u003e Then offers vows with hecatombs to crown\n\u003cbr\u003e Apollo\u0027s altars in his native town.\n\u003cbr\u003e Now with full force the yielding horn he bends,\n\u003cbr\u003e Drawn to an arch, and joins the doubling ends;\n\u003cbr\u003e Close to his breast he strains the nerve below,\n\u003cbr\u003e Till the barb\u0027d points approach the circling bow;\n\u003cbr\u003e The impatient weapon whizzes on the wing;\n\u003cbr\u003e Sounds the tough horn, and twangs the quivering string.\n\u003cbr\u003e But thee, Atrides! in that dangerous hour\n\u003cbr\u003e The gods forget not, nor thy guardian power,\n\u003cbr\u003e Pallas assists, and (weakened in its force)\n\u003cbr\u003e Diverts the weapon from its destined course:\n\u003cbr\u003e So from her babe, when slumber seals his eye,\n\u003cbr\u003e The watchful mother wafts the envenom\u0027d fly.\n\u003cbr\u003e Just where his belt with golden buckles join\u0027d,\n\u003cbr\u003e Where linen folds the double corslet lined,\n\u003cbr\u003e She turn\u0027d the shaft, which, hissing from above,\n\u003cbr\u003e Pass\u0027d the broad belt, and through the corslet drove;\n\u003cbr\u003e The folds it pierced, the plaited linen tore,\n\u003cbr\u003e And razed the skin, and drew the purple gore.\n\u003cbr\u003e As when some stately trappings are decreed\n\u003cbr\u003e To grace a monarch on his bounding steed,\n\u003cbr\u003e A nymph in Caria or Maeonia bred,\n\u003cbr\u003e Stains the pure ivory with a lively red;\n\u003cbr\u003e With equal lustre various colours vie,\n\u003cbr\u003e The shining whiteness, and the Tyrian dye:\n\u003cbr\u003e So great Atrides! show\u0027d thy sacred blood,\n\u003cbr\u003e As down thy snowy thigh distill\u0027d the streaming flood.\n\u003cbr\u003e With horror seized, the king of men descried\n\u003cbr\u003e The shaft infix\u0027d, and saw the gushing tide:\n\u003cbr\u003e Nor less the Spartan fear\u0027d, before he found\n\u003cbr\u003e The shining barb appear above the wound,\n\u003cbr\u003e Then, with a sigh, that heaved his manly breast,\n\u003cbr\u003e The royal brother thus his grief express\u0027d,\n\u003cbr\u003e And grasp\u0027d his hand; while all the Greeks around\n\u003cbr\u003e With answering sighs return\u0027d the plaintive sound.\n\u003cbr\u003e [pg 072]\n\u003cbr\u003e \"Oh, dear as life! did I for this agree\n\u003cbr\u003e The solemn truce, a fatal truce to thee!\n\u003cbr\u003e Wert thou exposed to all the hostile train,\n\u003cbr\u003e To fight for Greece, and conquer, to be slain!\n\u003cbr\u003e The race of Trojans in thy ruin join,\n\u003cbr\u003e And faith is scorn\u0027d by all the perjured line.\n\u003cbr\u003e Not thus our vows, confirm\u0027d with wine and gore,\n\u003cbr\u003e Those hands we plighted, and those oaths we swore,\n\u003cbr\u003e Shall all be vain: when Heaven\u0027s revenge is slow,\n\u003cbr\u003e Jove but prepares to strike the fiercer blow.\n\u003cbr\u003e The day shall come, that great avenging day,\n\u003cbr\u003e When Troy\u0027s proud glories in the dust shall lay,\n\u003cbr\u003e When Priam\u0027s powers and Priam\u0027s self shall fall,\n\u003cbr\u003e And one prodigious ruin swallow all.\n\u003cbr\u003e I see the god, already, from the pole\n\u003cbr\u003e Bare his red arm, and bid the thunder roll;\n\u003cbr\u003e I see the Eternal all his fury shed,\n\u003cbr\u003e And shake his aegis o\u0027er their guilty head.\n\u003cbr\u003e Such mighty woes on perjured princes wait;\n\u003cbr\u003e But thou, alas! deserv\u0027st a happier fate.\n\u003cbr\u003e Still must I mourn the period of thy days,\n\u003cbr\u003e And only mourn, without my share of praise?\n\u003cbr\u003e Deprived of thee, the heartless Greeks no more\n\u003cbr\u003e Shall dream of conquests on the hostile shore;\n\u003cbr\u003e Troy seized of Helen, and our glory lost,\n\u003cbr\u003e Thy bones shall moulder on a foreign coast;\n\u003cbr\u003e While some proud Trojan thus insulting cries,\n\u003cbr\u003e (And spurns the dust where Menelaus lies,)\n\u003cbr\u003e \u0027Such are the trophies Greece from Ilion brings,\n\u003cbr\u003e And such the conquest of her king of kings!\n\u003cbr\u003e Lo his proud vessels scatter\u0027d o\u0027er the main,\n\u003cbr\u003e And unrevenged, his mighty brother slain.\u0027\n\u003cbr\u003e Oh! ere that dire disgrace shall blast my fame,\n\u003cbr\u003e O\u0027erwhelm me, earth! and hide a monarch\u0027s shame.\"\n\u003cbr\u003e He said: a leader\u0027s and a brother\u0027s fears\n\u003cbr\u003e Possess his soul, which thus the Spartan cheers:\n\u003cbr\u003e \"Let not thy words the warmth of Greece abate;\n\u003cbr\u003e The feeble dart is guiltless of my fate:\n\u003cbr\u003e Stiff with the rich embroider\u0027d work around,\n\u003cbr\u003e My varied belt repell\u0027d the flying wound.\"\n\u003cbr\u003e To whom the king: \"My brother and my friend,\n\u003cbr\u003e Thus, always thus, may Heaven thy life defend!\n\u003cbr\u003e Now seek some skilful hand, whose powerful art\n\u003cbr\u003e May stanch the effusion, and extract the dart.\n\u003cbr\u003e Herald, be swift, and bid Machaon bring\n\u003cbr\u003e His speedy succour to the Spartan king;\n\u003cbr\u003e Pierced with a winged shaft (the deed of Troy),\n\u003cbr\u003e The Grecian\u0027s sorrow, and the Dardan\u0027s joy.\"\n\u003cbr\u003e With hasty zeal the swift Talthybius flies;\n\u003cbr\u003e Through the thick files he darts his searching eyes,\n\u003cbr\u003e [pg 073]\n\u003cbr\u003e And finds Machaon, where sublime he stands132\n\u003cbr\u003e In arms incircled with his native bands.\n\u003cbr\u003e Then thus: \"Machaon, to the king repair,\n\u003cbr\u003e His wounded brother claims thy timely care;\n\u003cbr\u003e Pierced by some Lycian or Dardanian bow,\n\u003cbr\u003e A grief to us, a triumph to the foe.\"\n\u003cbr\u003e The heavy tidings grieved the godlike man\n\u003cbr\u003e Swift to his succour through the ranks he ran.\n\u003cbr\u003e The dauntless king yet standing firm he found,\n\u003cbr\u003e And all the chiefs in deep concern around.\n\u003cbr\u003e Where to the steely point the reed was join\u0027d,\n\u003cbr\u003e The shaft he drew, but left the head behind.\n\u003cbr\u003e Straight the broad belt with gay embroidery graced,\n\u003cbr\u003e He loosed; the corslet from his breast unbraced;\n\u003cbr\u003e Then suck\u0027d the blood, and sovereign balm infused,133\n\u003cbr\u003e Which Chiron gave, and ?sculapius used.\n\u003cbr\u003e While round the prince the Greeks employ their care,\n\u003cbr\u003e The Trojans rush tumultuous to the war;\n\u003cbr\u003e Once more they glitter in refulgent arms,\n\u003cbr\u003e Once more the fields are fill\u0027d with dire alarms.\n\u003cbr\u003e Nor had you seen the king of men appear\n\u003cbr\u003e Confused, unactive, or surprised with fear;\n\u003cbr\u003e But fond of glory, with severe delight,\n\u003cbr\u003e His beating bosom claim\u0027d the rising fight.\n\u003cbr\u003e No longer with his warlike steeds he stay\u0027d,\n\u003cbr\u003e Or press\u0027d the car with polish\u0027d brass inlaid\n\u003cbr\u003e But left Eurymedon the reins to guide;\n\u003cbr\u003e The fiery coursers snorted at his side.\n\u003cbr\u003e On foot through all the martial ranks he moves\n\u003cbr\u003e And these encourages, and those reproves.\n\u003cbr\u003e \"Brave men!\" he cries, (to such who boldly dare\n\u003cbr\u003e Urge their swift steeds to face the coming war),\n\u003cbr\u003e \"Your ancient valour on the foes approve;\n\u003cbr\u003e Jove is with Greece, and let us trust in Jove.\n\u003cbr\u003e [pg 074]\n\u003cbr\u003e \u0027Tis not for us, but guilty Troy, to dread,\n\u003cbr\u003e Whose crimes sit heavy on her perjured head;\n\u003cbr\u003e Her sons and matrons Greece shall lead in chains,\n\u003cbr\u003e And her dead warriors strew the mournful plains.\"\n\u003cbr\u003e Thus with new ardour he the brave inspires;\n\u003cbr\u003e Or thus the fearful with reproaches fires:\n\u003cbr\u003e \"Shame to your country, scandal of your kind;\n\u003cbr\u003e Born to the fate ye well deserve to find!\n\u003cbr\u003e Why stand ye gazing round the dreadful plain,\n\u003cbr\u003e Prepared for flight, but doom\u0027d to fly in vain?\n\u003cbr\u003e Confused and panting thus, the hunted deer\n\u003cbr\u003e Falls as he flies, a victim to his fear.\n\u003cbr\u003e Still must ye wait the foes, and still retire,\n\u003cbr\u003e Till yon tall vessels blaze with Trojan fire?\n\u003cbr\u003e Or trust ye, Jove a valiant foe shall chase,\n\u003cbr\u003e To save a trembling, heartless, dastard race?\"\n\u003cbr\u003e This said, he stalk\u0027d with ample strides along,\n\u003cbr\u003e To Crete\u0027s brave monarch and his martial throng;\n\u003cbr\u003e High at their head he saw the chief appear,\n\u003cbr\u003e And bold Meriones excite the rear.\n\u003cbr\u003e At this the king his generous joy express\u0027d,\n\u003cbr\u003e And clasp\u0027d the warrior to his armed breast.\n\u003cbr\u003e \"Divine Idomeneus! what thanks we owe\n\u003cbr\u003e To worth like thine! what praise shall we bestow?\n\u003cbr\u003e To thee the foremost honours are decreed,\n\u003cbr\u003e First in the fight and every graceful deed.\n\u003cbr\u003e For this, in banquets, when the generous bowls\n\u003cbr\u003e Restore our blood, and raise the warriors\u0027 souls,\n\u003cbr\u003e Though all the rest with stated rules we bound,\n\u003cbr\u003e Unmix\u0027d, unmeasured, are thy goblets crown\u0027d.\n\u003cbr\u003e Be still thyself, in arms a mighty name;\n\u003cbr\u003e Maintain thy honours, and enlarge thy fame.\"\n\u003cbr\u003e To whom the Cretan thus his speech address\u0027d:\n\u003cbr\u003e \"Secure of me, O king! exhort the rest.\n\u003cbr\u003e Fix\u0027d to thy side, in every toil I share,\n\u003cbr\u003e Thy firm associate in the day of war.\n\u003cbr\u003e But let the signal be this moment given;\n\u003cbr\u003e To mix in fight is all I ask of Heaven.\n\u003cbr\u003e The field shall prove how perjuries succeed,\n\u003cbr\u003e And chains or death avenge the impious deed.\"\n\u003cbr\u003e Charm\u0027d with this heat, the king his course pursues,\n\u003cbr\u003e And next the troops of either Ajax views:\n\u003cbr\u003e In one firm orb the bands were ranged around,\n\u003cbr\u003e A cloud of heroes blacken\u0027d all the ground.\n\u003cbr\u003e Thus from the lofty promontory\u0027s brow\n\u003cbr\u003e A swain surveys the gathering storm below;\n\u003cbr\u003e Slow from the main the heavy vapours rise,\n\u003cbr\u003e Spread in dim streams, and sail along the skies,\n\u003cbr\u003e Till black as night the swelling tempest shows,\n\u003cbr\u003e The cloud condensing as the west-wind blows:\n\u003cbr\u003e [pg 075]\n\u003cbr\u003e He dreads the impending storm, and drives his flock\n\u003cbr\u003e To the close covert of an arching rock.\n\u003cbr\u003e Such, and so thick, the embattled squadrons stood,\n\u003cbr\u003e With spears erect, a moving iron wood:\n\u003cbr\u003e A shady light was shot from glimmering shields,\n\u003cbr\u003e And their brown arms obscured the dusky fields.\n\u003cbr\u003e \"O heroes! worthy such a dauntless train,\n\u003cbr\u003e Whose godlike virtue we but urge in vain,\n\u003cbr\u003e (Exclaim\u0027d the king), who raise your eager bands\n\u003cbr\u003e With great examples, more than loud commands.\n\u003cbr\u003e Ah! would the gods but breathe in all the rest\n\u003cbr\u003e Such souls as burn in your exalted breast,\n\u003cbr\u003e Soon should our arms with just success be crown\u0027d,\n\u003cbr\u003e And Troy\u0027s proud walls lie smoking on the ground.\"\n\u003cbr\u003e Then to the next the general bends his course;\n\u003cbr\u003e (His heart exults, and glories in his force);\n\u003cbr\u003e There reverend Nestor ranks his Pylian bands,\n\u003cbr\u003e And with inspiring eloquence commands;\n\u003cbr\u003e With strictest order sets his train in arms,\n\u003cbr\u003e The chiefs advises, and the soldiers warms.\n\u003cbr\u003e Alastor, Chromius, Haemon, round him wait,\n\u003cbr\u003e Bias the good, and Pelagon the great.\n\u003cbr\u003e The horse and chariots to the front assign\u0027d,\n\u003cbr\u003e The foot (the strength of war) he ranged behind;\n\u003cbr\u003e The middle space suspected troops supply,\n\u003cbr\u003e Inclosed by both, nor left the power to fly;\n\u003cbr\u003e He gives command to \"curb the fiery steed,\n\u003cbr\u003e Nor cause confusion, nor the ranks exceed:\n\u003cbr\u003e Before the rest let none too rashly ride;\n\u003cbr\u003e No strength nor skill, but just in time, be tried:\n\u003cbr\u003e The charge once made, no warrior turn the rein,\n\u003cbr\u003e But fight, or fall; a firm embodied train.\n\u003cbr\u003e He whom the fortune of the field shall cast\n\u003cbr\u003e From forth his chariot, mount the next in haste;\n\u003cbr\u003e Nor seek unpractised to direct the car,\n\u003cbr\u003e Content with javelins to provoke the war.\n\u003cbr\u003e Our great forefathers held this prudent course,\n\u003cbr\u003e Thus ruled their ardour, thus preserved their force;\n\u003cbr\u003e By laws like these immortal conquests made,\n\u003cbr\u003e And earth\u0027s proud tyrants low in ashes laid.\"\n\u003cbr\u003e So spoke the master of the martial art,\n\u003cbr\u003e And touch\u0027d with transport great Atrides\u0027 heart.\n\u003cbr\u003e \"Oh! hadst thou strength to match thy brave desires,\n\u003cbr\u003e And nerves to second what thy soul inspires!\n\u003cbr\u003e But wasting years, that wither human race,\n\u003cbr\u003e Exhaust thy spirits, and thy arms unbrace.\n\u003cbr\u003e What once thou wert, oh ever mightst thou be!\n\u003cbr\u003e And age the lot of any chief but thee.\"\n\u003cbr\u003e Thus to the experienced prince Atrides cried;\n\u003cbr\u003e He shook his hoary locks, and thus replied:\n\u003cbr\u003e [pg 076]\n\u003cbr\u003e \"Well might I wish, could mortal wish renew134\n\u003cbr\u003e That strength which once in boiling youth I knew;\n\u003cbr\u003e Such as I was, when Ereuthalion, slain\n\u003cbr\u003e Beneath this arm, fell prostrate on the plain.\n\u003cbr\u003e But heaven its gifts not all at once bestows,\n\u003cbr\u003e These years with wisdom crowns, with action those:\n\u003cbr\u003e The field of combat fits the young and bold,\n\u003cbr\u003e The solemn council best becomes the old:\n\u003cbr\u003e To you the glorious conflict I resign,\n\u003cbr\u003e Let sage advice, the palm of age, be mine.\"\n\u003cbr\u003e He said. With joy the monarch march\u0027d before,\n\u003cbr\u003e And found Menestheus on the dusty shore,\n\u003cbr\u003e With whom the firm Athenian phalanx stands;\n\u003cbr\u003e And next Ulysses, with his subject bands.\n\u003cbr\u003e Remote their forces lay, nor knew so far\n\u003cbr\u003e The peace infringed, nor heard the sounds of war;\n\u003cbr\u003e The tumult late begun, they stood intent\n\u003cbr\u003e To watch the motion, dubious of the event.\n\u003cbr\u003e The king, who saw their squadrons yet unmoved,\n\u003cbr\u003e With hasty ardour thus the chiefs reproved:\n\u003cbr\u003e \"Can Peleus\u0027 son forget a warrior\u0027s part.\n\u003cbr\u003e And fears Ulysses, skill\u0027d in every art?\n\u003cbr\u003e Why stand you distant, and the rest expect\n\u003cbr\u003e To mix in combat which yourselves neglect?\n\u003cbr\u003e From you \u0027twas hoped among the first to dare\n\u003cbr\u003e The shock of armies, and commence the war;\n\u003cbr\u003e For this your names are call\u0027d before the rest,\n\u003cbr\u003e To share the pleasures of the genial feast:\n\u003cbr\u003e And can you, chiefs! without a blush survey\n\u003cbr\u003e Whole troops before you labouring in the fray?\n\u003cbr\u003e Say, is it thus those honours you requite?\n\u003cbr\u003e The first in banquets, but the last in fight.\"\n\u003cbr\u003e Ulysses heard: the hero\u0027s warmth o\u0027erspread\n\u003cbr\u003e His cheek with blushes: and severe, he said:\n\u003cbr\u003e \"Take back the unjust reproach! Behold we stand\n\u003cbr\u003e Sheathed in bright arms, and but expect command.\n\u003cbr\u003e If glorious deeds afford thy soul delight,\n\u003cbr\u003e Behold me plunging in the thickest fight.\n\u003cbr\u003e Then give thy warrior-chief a warrior\u0027s due,\n\u003cbr\u003e Who dares to act whate\u0027er thou dar\u0027st to view.\"\n\u003cbr\u003e Struck with his generous wrath, the king replies:\n\u003cbr\u003e \"O great in action, and in council wise!\n\u003cbr\u003e With ours, thy care and ardour are the same,\n\u003cbr\u003e [pg 077]\n\u003cbr\u003e Nor need I to commend, nor aught to blame.\n\u003cbr\u003e Sage as thou art, and learn\u0027d in human kind,\n\u003cbr\u003e Forgive the transport of a martial mind.\n\u003cbr\u003e Haste to the fight, secure of just amends;\n\u003cbr\u003e The gods that make, shall keep the worthy, friends.\"\n\u003cbr\u003e He said, and pass\u0027d where great Tydides lay,\n\u003cbr\u003e His steeds and chariots wedged in firm array;\n\u003cbr\u003e (The warlike Sthenelus attends his side;)135\n\u003cbr\u003e To whom with stern reproach the monarch cried:\n\u003cbr\u003e \"O son of Tydeus! (he, whose strength could tame\n\u003cbr\u003e The bounding steed, in arms a mighty name)\n\u003cbr\u003e Canst thou, remote, the mingling hosts descry,\n\u003cbr\u003e With hands unactive, and a careless eye?\n\u003cbr\u003e Not thus thy sire the fierce encounter fear\u0027d;\n\u003cbr\u003e Still first in front the matchless prince appear\u0027d:\n\u003cbr\u003e What glorious toils, what wonders they recite,\n\u003cbr\u003e Who view\u0027d him labouring through the ranks of fight?\n\u003cbr\u003e I saw him once, when gathering martial powers,\n\u003cbr\u003e A peaceful guest, he sought Mycenae\u0027s towers;\n\u003cbr\u003e Armies he ask\u0027d, and armies had been given,\n\u003cbr\u003e Not we denied, but Jove forbade from heaven;\n\u003cbr\u003e While dreadful comets glaring from afar,\n\u003cbr\u003e Forewarn\u0027d the horrors of the Theban war.136\n\u003cbr\u003e Next, sent by Greece from where Asopus flows,\n\u003cbr\u003e A fearless envoy, he approach\u0027d the foes;\n\u003cbr\u003e Thebes\u0027 hostile walls unguarded and alone,\n\u003cbr\u003e Dauntless he enters, and demands the throne.\n\u003cbr\u003e The tyrant feasting with his chiefs he found,\n\u003cbr\u003e And dared to combat all those chiefs around:\n\u003cbr\u003e Dared, and subdued before their haughty lord;\n\u003cbr\u003e For Pallas strung his arm and edged his sword.\n\u003cbr\u003e Stung with the shame, within the winding way,\n\u003cbr\u003e To bar his passage fifty warriors lay;\n\u003cbr\u003e Two heroes led the secret squadron on,\n\u003cbr\u003e Mason the fierce, and hardy Lycophon;\n\u003cbr\u003e Those fifty slaughter\u0027d in the gloomy vale.\n\u003cbr\u003e He spared but one to bear the dreadful tale,\n\u003cbr\u003e Such Tydeus was, and such his martial fire;\n\u003cbr\u003e Gods! how the son degenerates from the sire!\"\n\u003cbr\u003e No words the godlike Diomed return\u0027d,\n\u003cbr\u003e But heard respectful, and in secret burn\u0027d:\n\u003cbr\u003e Not so fierce Capaneus\u0027 undaunted son;\n\u003cbr\u003e Stern as his sire, the boaster thus begun:\n\u003cbr\u003e \"What needs, O monarch! this invidious praise,\n\u003cbr\u003e Ourselves to lessen, while our sire you raise?\n\u003cbr\u003e Dare to be just, Atrides! and confess\n\u003cbr\u003e [pg 078]\n\u003cbr\u003e Our value equal, though our fury less.\n\u003cbr\u003e With fewer troops we storm\u0027d the Theban wall,\n\u003cbr\u003e And happier saw the sevenfold city fall,137\n\u003cbr\u003e In impious acts the guilty father died;\n\u003cbr\u003e The sons subdued, for Heaven was on their side.\n\u003cbr\u003e Far more than heirs of all our parents\u0027 fame,\n\u003cbr\u003e Our glories darken their diminish\u0027d name.\"\n\u003cbr\u003e To him Tydides thus: \"My friend, forbear;\n\u003cbr\u003e Suppress thy passion, and the king revere:\n\u003cbr\u003e His high concern may well excuse this rage,\n\u003cbr\u003e Whose cause we follow, and whose war we wage:\n\u003cbr\u003e His the first praise, were Ilion\u0027s towers o\u0027erthrown,\n\u003cbr\u003e And, if we fail, the chief disgrace his own.\n\u003cbr\u003e Let him the Greeks to hardy toils excite,\n\u003cbr\u003e \u0027Tis ours to labour in the glorious fight.\"\n\u003cbr\u003e He spoke, and ardent, on the trembling ground\n\u003cbr\u003e Sprung from his car: his ringing arms resound.\n\u003cbr\u003e Dire was the clang, and dreadful from afar,\n\u003cbr\u003e Of arm\u0027d Tydides rushing to the war.\n\u003cbr\u003e As when the winds, ascending by degrees,138\n\u003cbr\u003e First move the whitening surface of the seas,\n\u003cbr\u003e The billows float in order to the shore,\n\u003cbr\u003e The wave behind rolls on the wave before;\n\u003cbr\u003e Till, with the growing storm, the deeps arise,\n\u003cbr\u003e Foam o\u0027er the rocks, and thunder to the skies.\n\u003cbr\u003e So to the fight the thick battalions throng,\n\u003cbr\u003e Shields urged on shields, and men drove men along\n\u003cbr\u003e Sedate and silent move the numerous bands;\n\u003cbr\u003e No sound, no whisper, but the chief\u0027s commands,\n\u003cbr\u003e Those only heard; with awe the rest obey,\n\u003cbr\u003e As if some god had snatch\u0027d their voice away.\n\u003cbr\u003e Not so the Trojans; from their host ascends\n\u003cbr\u003e A general shout that all the region rends.\n\u003cbr\u003e As when the fleecy flocks unnumber\u0027d stand\n\u003cbr\u003e In wealthy folds, and wait the milker\u0027s hand,\n\u003cbr\u003e The hollow vales incessant bleating fills,\n\u003cbr\u003e The lambs reply from all the neighbouring hills:\n\u003cbr\u003e Such clamours rose from various nations round,\n\u003cbr\u003e Mix\u0027d was the murmur, and confused the sound.\n\u003cbr\u003e Each host now joins, and each a god inspires,\n\u003cbr\u003e These Mars incites, and those Minerva fires,\n\u003cbr\u003e Pale flight around, and dreadful terror reign;\n\u003cbr\u003e And discord raging bathes the purple plain;\n\u003cbr\u003e [pg 079]\n\u003cbr\u003e Discord! dire sister of the slaughtering power,\n\u003cbr\u003e Small at her birth, but rising every hour,\n\u003cbr\u003e While scarce the skies her horrid head can bound,\n\u003cbr\u003e She stalks on earth, and shakes the world around;139\n\u003cbr\u003e The nations bleed, where\u0027er her steps she turns,\n\u003cbr\u003e The groan still deepens, and the combat burns.\n\u003cbr\u003e Now shield with shield, with helmet helmet closed,\n\u003cbr\u003e To armour armour, lance to lance opposed,\n\u003cbr\u003e Host against host with shadowy squadrons drew,\n\u003cbr\u003e The sounding darts in iron tempests flew,\n\u003cbr\u003e Victors and vanquish\u0027d join\u0027d promiscuous cries,\n\u003cbr\u003e And shrilling shouts and dying groans arise;\n\u003cbr\u003e With streaming blood the slippery fields are dyed,\n\u003cbr\u003e And slaughter\u0027d heroes swell the dreadful tide.\n\u003cbr\u003e As torrents roll, increased by numerous rills,\n\u003cbr\u003e With rage impetuous, down their echoing hills\n\u003cbr\u003e Rush to the vales, and pour\u0027d along the plain.\n\u003cbr\u003e Roar through a thousand channels to the main:\n\u003cbr\u003e The distant shepherd trembling hears the sound;\n\u003cbr\u003e So mix both hosts, and so their cries rebound.\n\u003cbr\u003e The bold Antilochus the slaughter led,\n\u003cbr\u003e The first who struck a valiant Trojan dead:\n\u003cbr\u003e At great Echepolus the lance arrives,\n\u003cbr\u003e Razed his high crest, and through his helmet drives;\n\u003cbr\u003e Warm\u0027d in the brain the brazen weapon lies,\n\u003cbr\u003e And shades eternal settle o\u0027er his eyes.\n\u003cbr\u003e So sinks a tower, that long assaults had stood\n\u003cbr\u003e Of force and fire, its walls besmear\u0027d with blood.\n\u003cbr\u003e Him, the bold leader of the Abantian throng,140\n\u003cbr\u003e Seized to despoil, and dragg\u0027d the corpse along:\n\u003cbr\u003e But while he strove to tug the inserted dart,\n\u003cbr\u003e Agenor\u0027s javelin reach\u0027d the hero\u0027s heart.\n\u003cbr\u003e His flank, unguarded by his ample shield,\n\u003cbr\u003e Admits the lance: he falls, and spurns the field;\n\u003cbr\u003e The nerves, unbraced, support his limbs no more;\n\u003cbr\u003e The soul comes floating in a tide of gore.\n\u003cbr\u003e Trojans and Greeks now gather round the slain;\n\u003cbr\u003e The war renews, the warriors bleed again:\n\u003cbr\u003e As o\u0027er their prey rapacious wolves engage,\n\u003cbr\u003e Man dies on man, and all is blood and rage.\n\u003cbr\u003e In blooming youth fair Simoisius fell,\n\u003cbr\u003e Sent by great Ajax to the shades of hell;\n\u003cbr\u003e Fair Simoisius, whom his mother bore\n\u003cbr\u003e Amid the flocks on silver Simois\u0027 shore:\n\u003cbr\u003e The nymph descending from the hills of Ide,\n\u003cbr\u003e To seek her parents on his flowery side,\n\u003cbr\u003e [pg 080]\n\u003cbr\u003e Brought forth the babe, their common care and joy,\n\u003cbr\u003e And thence from Simois named the lovely boy.\n\u003cbr\u003e Short was his date! by dreadful Ajax slain,\n\u003cbr\u003e He falls, and renders all their cares in vain!\n\u003cbr\u003e So falls a poplar, that in watery ground\n\u003cbr\u003e Raised high the head, with stately branches crown\u0027d,\n\u003cbr\u003e (Fell\u0027d by some artist with his shining steel,\n\u003cbr\u003e To shape the circle of the bending wheel,)\n\u003cbr\u003e Cut down it lies, tall, smooth, and largely spread,\n\u003cbr\u003e With all its beauteous honours on its head\n\u003cbr\u003e There, left a subject to the wind and rain,\n\u003cbr\u003e And scorch\u0027d by suns, it withers on the plain\n\u003cbr\u003e Thus pierced by Ajax, Simoisius lies\n\u003cbr\u003e Stretch\u0027d on the shore, and thus neglected dies.\n\u003cbr\u003e At Ajax, Antiphus his javelin threw;\n\u003cbr\u003e The pointed lance with erring fury flew,\n\u003cbr\u003e And Leucus, loved by wise Ulysses, slew.\n\u003cbr\u003e He drops the corpse of Simoisius slain,\n\u003cbr\u003e And sinks a breathless carcase on the plain.\n\u003cbr\u003e This saw Ulysses, and with grief enraged,\n\u003cbr\u003e Strode where the foremost of the foes engaged;\n\u003cbr\u003e Arm\u0027d with his spear, he meditates the wound,\n\u003cbr\u003e In act to throw; but cautious look\u0027d around,\n\u003cbr\u003e Struck at his sight the Trojans backward drew,\n\u003cbr\u003e And trembling heard the javelin as it flew.\n\u003cbr\u003e A chief stood nigh, who from Abydos came,\n\u003cbr\u003e Old Priam\u0027s son, Democoon was his name.\n\u003cbr\u003e The weapon entered close above his ear,\n\u003cbr\u003e Cold through his temples glides the whizzing spear;141\n\u003cbr\u003e With piercing shrieks the youth resigns his breath,\n\u003cbr\u003e His eye-balls darken with the shades of death;\n\u003cbr\u003e Ponderous he falls; his clanging arms resound,\n\u003cbr\u003e And his broad buckler rings against the ground.\n\u003cbr\u003e Seized with affright the boldest foes appear;\n\u003cbr\u003e E\u0027en godlike Hector seems himself to fear;\n\u003cbr\u003e Slow he gave way, the rest tumultuous fled;\n\u003cbr\u003e The Greeks with shouts press on, and spoil the dead:\n\u003cbr\u003e But Phoebus now from Ilion\u0027s towering height\n\u003cbr\u003e Shines forth reveal\u0027d, and animates the fight.\n\u003cbr\u003e \"Trojans, be bold, and force with force oppose;\n\u003cbr\u003e Your foaming steeds urge headlong on the foes!\n\u003cbr\u003e Nor are their bodies rocks, nor ribb\u0027d with steel;\n\u003cbr\u003e Your weapons enter, and your strokes they feel.\n\u003cbr\u003e Have ye forgot what seem\u0027d your dread before?\n\u003cbr\u003e The great, the fierce Achilles fights no more.\"\n\u003cbr\u003e Apollo thus from Ilion\u0027s lofty towers,\n\u003cbr\u003e Array\u0027d in terrors, roused the Trojan powers:\n\u003cbr\u003e While war\u0027s fierce goddess fires the Grecian foe,\n\u003cbr\u003e [pg 081]\n\u003cbr\u003e And shouts and thunders in the fields below.\n\u003cbr\u003e Then great Diores fell, by doom divine,\n\u003cbr\u003e In vain his valour and illustrious line.\n\u003cbr\u003e A broken rock the force of Pyrus threw,\n\u003cbr\u003e (Who from cold ?nus led the Thracian crew,)142\n\u003cbr\u003e Full on his ankle dropp\u0027d the ponderous stone,\n\u003cbr\u003e Burst the strong nerves, and crash\u0027d the solid bone.\n\u003cbr\u003e Supine he tumbles on the crimson sands,\n\u003cbr\u003e Before his helpless friends, and native bands,\n\u003cbr\u003e And spreads for aid his unavailing hands.\n\u003cbr\u003e The foe rush\u0027d furious as he pants for breath,\n\u003cbr\u003e And through his navel drove the pointed death:\n\u003cbr\u003e His gushing entrails smoked upon the ground,\n\u003cbr\u003e And the warm life came issuing from the wound.\n\u003cbr\u003e His lance bold Thoas at the conqueror sent,\n\u003cbr\u003e Deep in his breast above the pap it went,\n\u003cbr\u003e Amid the lungs was fix\u0027d the winged wood,\n\u003cbr\u003e And quivering in his heaving bosom stood:\n\u003cbr\u003e Till from the dying chief, approaching near,\n\u003cbr\u003e The ?tolian warrior tugg\u0027d his weighty spear:\n\u003cbr\u003e Then sudden waved his flaming falchion round,\n\u003cbr\u003e And gash\u0027d his belly with a ghastly wound;\n\u003cbr\u003e The corpse now breathless on the bloody plain,\n\u003cbr\u003e To spoil his arms the victor strove in vain;\n\u003cbr\u003e The Thracian bands against the victor press\u0027d,\n\u003cbr\u003e A grove of lances glitter\u0027d at his breast.\n\u003cbr\u003e Stern Thoas, glaring with revengeful eyes,\n\u003cbr\u003e In sullen fury slowly quits the prize.\n\u003cbr\u003e Thus fell two heroes; one the pride of Thrace,\n\u003cbr\u003e And one the leader of the Epeian race;\n\u003cbr\u003e Death\u0027s sable shade at once o\u0027ercast their eyes,\n\u003cbr\u003e In dust the vanquish\u0027d and the victor lies.\n\u003cbr\u003e With copious slaughter all the fields are red,\n\u003cbr\u003e And heap\u0027d with growing mountains of the dead.\n\u003cbr\u003e Had some brave chief this martial scene beheld,\n\u003cbr\u003e By Pallas guarded through the dreadful field;\n\u003cbr\u003e Might darts be bid to turn their points away,\n\u003cbr\u003e And swords around him innocently play;\n\u003cbr\u003e The war\u0027s whole art with wonder had he seen,\n\u003cbr\u003e And counted heroes where he counted men.\n\u003cbr\u003e So fought each host, with thirst of glory fired,\n\u003cbr\u003e And crowds on crowds triumphantly expired.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/45991.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
