{"id":34771,"no":9,"title":"BOOK VII.","content":"ARGUMENT\n\u003cbr\u003e \n\u003cbr\u003e THE SINGLE COMBAT OF HECTOR AND AJAX.\n\u003cbr\u003e \n\u003cbr\u003e The battle renewing with double ardour upon the return of Hector, Minerva is under apprehensions for the Greeks. Apollo, seeing her descend from Olympus, joins her near the Scaean gate. They agree to put off the general engagement for that day, and incite Hector to challenge the Greeks to a single combat. Nine of the princes accepting the challenge, the lot is cast and falls upon Ajax. These heroes, after several attacks, are parted by the night. The Trojans calling a council, Antenor purposes the delivery of Helen to the Greeks, to which Paris will not consent, but offers to restore them her riches. Priam sends a herald to make this offer, and to demand a truce for burning the dead, the last of which only is agreed to by Agamemnon. When the funerals are performed, the Greeks, pursuant to the advice of Nestor, erect a fortification to protect their fleet and camp, flanked with towers, and defended by a ditch and palisades. Neptune testifies his jealousy at this work, but is pacified by a promise from Jupiter. Both armies pass the night in feasting but Jupiter disheartens the Trojans with thunder, and other signs of his wrath.\n\u003cbr\u003e \n\u003cbr\u003e The three and twentieth day ends with the duel of Hector and Ajax, the next day the truce is agreed; another is taken up in the funeral rites of the slain and one more in building the fortification before the ships. So that somewhat about three days is employed in this book. The scene lies wholly in the field.\n\u003cbr\u003e So spoke the guardian of the Trojan state,\n\u003cbr\u003e Then rush\u0027d impetuous through the Scaean gate.\n\u003cbr\u003e Him Paris follow\u0027d to the dire alarms;\n\u003cbr\u003e Both breathing slaughter, both resolved in arms.\n\u003cbr\u003e As when to sailors labouring through the main,\n\u003cbr\u003e That long have heaved the weary oar in vain,\n\u003cbr\u003e Jove bids at length the expected gales arise;\n\u003cbr\u003e The gales blow grateful, and the vessel flies.\n\u003cbr\u003e So welcome these to Troy\u0027s desiring train,\n\u003cbr\u003e The bands are cheer\u0027d, the war awakes again.\n\u003cbr\u003e Bold Paris first the work of death begun\n\u003cbr\u003e On great Menestheus, Areithous\u0027 son,\n\u003cbr\u003e Sprung from the fair Philomeda\u0027s embrace,\n\u003cbr\u003e The pleasing Arne was his native place.\n\u003cbr\u003e Then sunk Eioneus to the shades below,\n\u003cbr\u003e Beneath his steely casque he felt the blow177\n\u003cbr\u003e [pg 128]\n\u003cbr\u003e Full on his neck, from Hector\u0027s weighty hand;\n\u003cbr\u003e And roll\u0027d, with limbs relax\u0027d, along the land.\n\u003cbr\u003e By Glaucus\u0027 spear the bold Iphmous bleeds,\n\u003cbr\u003e Fix\u0027d in the shoulder as he mounts his steeds;\n\u003cbr\u003e Headlong he tumbles: his slack nerves unbound,\n\u003cbr\u003e drop the cold useless members on the ground.\n\u003cbr\u003e When now Minerva saw her Argives slain,\n\u003cbr\u003e From vast Olympus to the gleaming plain\n\u003cbr\u003e Fierce she descends: Apollo marked her flight,\n\u003cbr\u003e Nor shot less swift from Ilion\u0027s towery height.\n\u003cbr\u003e Radiant they met, beneath the beechen shade;\n\u003cbr\u003e When thus Apollo to the blue-eyed maid:\n\u003cbr\u003e \"What cause, O daughter of Almighty Jove!\n\u003cbr\u003e Thus wings thy progress from the realms above?\n\u003cbr\u003e Once more impetuous dost thou bend thy way,\n\u003cbr\u003e To give to Greece the long divided day?\n\u003cbr\u003e Too much has Troy already felt thy hate,\n\u003cbr\u003e Now breathe thy rage, and hush the stern debate;\n\u003cbr\u003e This day, the business of the field suspend;\n\u003cbr\u003e War soon shall kindle, and great Ilion bend;\n\u003cbr\u003e Since vengeful goddesses confederate join\n\u003cbr\u003e To raze her walls, though built by hands divine.\"\n\u003cbr\u003e To whom the progeny of Jove replies:\n\u003cbr\u003e \"I left, for this, the council of the skies:\n\u003cbr\u003e But who shall bid conflicting hosts forbear,\n\u003cbr\u003e What art shall calm the furious sons of war?\"\n\u003cbr\u003e To her the god: \"Great Hector\u0027s soul incite\n\u003cbr\u003e To dare the boldest Greek to single fight,\n\u003cbr\u003e Till Greece, provoked, from all her numbers show\n\u003cbr\u003e A warrior worthy to be Hector\u0027s foe.\"\n\u003cbr\u003e At this agreed, the heavenly powers withdrew;\n\u003cbr\u003e Sage Helenus their secret counsels knew;\n\u003cbr\u003e Hector, inspired, he sought: to him address\u0027d,\n\u003cbr\u003e Thus told the dictates of his sacred breast:\n\u003cbr\u003e \"O son of Priam! let thy faithful ear\n\u003cbr\u003e Receive my words: thy friend and brother hear!\n\u003cbr\u003e Go forth persuasive, and a while engage\n\u003cbr\u003e The warring nations to suspend their rage;\n\u003cbr\u003e Then dare the boldest of the hostile train\n\u003cbr\u003e To mortal combat on the listed plain.\n\u003cbr\u003e For not this day shall end thy glorious date;\n\u003cbr\u003e The gods have spoke it, and their voice is fate.\"\n\u003cbr\u003e He said: the warrior heard the word with joy;\n\u003cbr\u003e Then with his spear restrain\u0027d the youth of Troy,\n\u003cbr\u003e Held by the midst athwart. On either hand\n\u003cbr\u003e The squadrons part; the expecting Trojans stand;\n\u003cbr\u003e Great Agamemnon bids the Greeks forbear:\n\u003cbr\u003e They breathe, and hush the tumult of the war.\n\u003cbr\u003e The Athenian maid, and glorious god of day,178\n\u003cbr\u003e [pg 129]\n\u003cbr\u003e With silent joy the settling hosts survey:\n\u003cbr\u003e In form of vultures, on the beech\u0027s height\n\u003cbr\u003e They sit conceal\u0027d, and wait the future fight.\n\u003cbr\u003e The thronging troops obscure the dusky fields,\n\u003cbr\u003e Horrid with bristling spears, and gleaming shields.\n\u003cbr\u003e As when a general darkness veils the main,\n\u003cbr\u003e (Soft Zephyr curling the wide wat\u0027ry plain,)\n\u003cbr\u003e The waves scarce heave, the face of ocean sleeps,\n\u003cbr\u003e And a still horror saddens all the deeps;\n\u003cbr\u003e Thus in thick orders settling wide around,\n\u003cbr\u003e At length composed they sit, and shade the ground.\n\u003cbr\u003e Great Hector first amidst both armies broke\n\u003cbr\u003e The solemn silence, and their powers bespoke:\n\u003cbr\u003e \"Hear, all ye Trojan, all ye Grecian bands,\n\u003cbr\u003e What my soul prompts, and what some god commands.\n\u003cbr\u003e Great Jove, averse our warfare to compose,\n\u003cbr\u003e O\u0027erwhelms the nations with new toils and woes;\n\u003cbr\u003e War with a fiercer tide once more returns,\n\u003cbr\u003e Till Ilion falls, or till yon navy burns.\n\u003cbr\u003e You then, O princes of the Greeks! appear;\n\u003cbr\u003e \u0027Tis Hector speaks, and calls the gods to hear:\n\u003cbr\u003e From all your troops select the boldest knight,\n\u003cbr\u003e And him, the boldest, Hector dares to fight.\n\u003cbr\u003e Here if I fall, by chance of battle slain,\n\u003cbr\u003e Be his my spoil, and his these arms remain;\n\u003cbr\u003e But let my body, to my friends return\u0027d,\n\u003cbr\u003e By Trojan hands and Trojan flames be burn\u0027d.\n\u003cbr\u003e And if Apollo, in whose aid I trust,\n\u003cbr\u003e Shall stretch your daring champion in the dust;\n\u003cbr\u003e If mine the glory to despoil the foe;\n\u003cbr\u003e On Phoebus\u0027 temple I\u0027ll his arms bestow:\n\u003cbr\u003e The breathless carcase to your navy sent,\n\u003cbr\u003e Greece on the shore shall raise a monument;\n\u003cbr\u003e Which when some future mariner surveys,\n\u003cbr\u003e Wash\u0027d by broad Hellespont\u0027s resounding seas,\n\u003cbr\u003e Thus shall he say, \u0027A valiant Greek lies there,\n\u003cbr\u003e By Hector slain, the mighty man of war,\u0027\n\u003cbr\u003e The stone shall tell your vanquish\u0027d hero\u0027s name.\n\u003cbr\u003e And distant ages learn the victor\u0027s fame.\"\n\u003cbr\u003e This fierce defiance Greece astonish\u0027d heard,\n\u003cbr\u003e Blush\u0027d to refuse, and to accept it fear\u0027d.\n\u003cbr\u003e Stern Menelaus first the silence broke,\n\u003cbr\u003e And, inly groaning, thus opprobrious spoke:\n\u003cbr\u003e \"Women of Greece! O scandal of your race,\n\u003cbr\u003e Whose coward souls your manly form disgrace,\n\u003cbr\u003e How great the shame, when every age shall know\n\u003cbr\u003e That not a Grecian met this noble foe!\n\u003cbr\u003e Go then! resolve to earth, from whence ye grew,\n\u003cbr\u003e A heartless, spiritless, inglorious crew!\n\u003cbr\u003e Be what ye seem, unanimated clay,\n\u003cbr\u003e [pg 130]\n\u003cbr\u003e Myself will dare the danger of the day;\n\u003cbr\u003e \u0027Tis man\u0027s bold task the generous strife to try,\n\u003cbr\u003e But in the hands of God is victory.\"\n\u003cbr\u003e These words scarce spoke, with generous ardour press\u0027d,\n\u003cbr\u003e His manly limbs in azure arms he dress\u0027d.\n\u003cbr\u003e That day, Atrides! a superior hand\n\u003cbr\u003e Had stretch\u0027d thee breathless on the hostile strand;\n\u003cbr\u003e But all at once, thy fury to compose,\n\u003cbr\u003e The kings of Greece, an awful band, arose;\n\u003cbr\u003e Even he their chief, great Agamemnon, press\u0027d\n\u003cbr\u003e Thy daring hand, and this advice address\u0027d:\n\u003cbr\u003e \"Whither, O Menelaus! wouldst thou run,\n\u003cbr\u003e And tempt a fate which prudence bids thee shun?\n\u003cbr\u003e Grieved though thou art, forbear the rash design;\n\u003cbr\u003e Great Hectors arm is mightier far than thine:\n\u003cbr\u003e Even fierce Achilles learn\u0027d its force to fear,\n\u003cbr\u003e And trembling met this dreadful son of war.\n\u003cbr\u003e Sit thou secure, amidst thy social band;\n\u003cbr\u003e Greece in our cause shall arm some powerful hand.\n\u003cbr\u003e The mightiest warrior of the Achaian name,\n\u003cbr\u003e Though bold and burning with desire of fame,\n\u003cbr\u003e Content the doubtful honour might forego,\n\u003cbr\u003e So great the danger, and so brave the foe.\"\n\u003cbr\u003e He said, and turn\u0027d his brother\u0027s vengeful mind;\n\u003cbr\u003e He stoop\u0027d to reason, and his rage resign\u0027d,\n\u003cbr\u003e No longer bent to rush on certain harms;\n\u003cbr\u003e His joyful friends unbrace his azure arms.\n\u003cbr\u003e He from whose lips divine persuasion flows,\n\u003cbr\u003e Grave Nestor, then, in graceful act arose;\n\u003cbr\u003e Thus to the kings he spoke: \"What grief, what shame\n\u003cbr\u003e Attend on Greece, and all the Grecian name!\n\u003cbr\u003e How shall, alas! her hoary heroes mourn\n\u003cbr\u003e Their sons degenerate, and their race a scorn!\n\u003cbr\u003e What tears shall down thy silvery beard be roll\u0027d,\n\u003cbr\u003e O Peleus, old in arms, in wisdom old!\n\u003cbr\u003e Once with what joy the generous prince would hear\n\u003cbr\u003e Of every chief who fought this glorious war,\n\u003cbr\u003e Participate their fame, and pleased inquire\n\u003cbr\u003e Each name, each action, and each hero\u0027s sire!\n\u003cbr\u003e Gods! should he see our warriors trembling stand,\n\u003cbr\u003e And trembling all before one hostile hand;\n\u003cbr\u003e How would he lift his aged arms on high,\n\u003cbr\u003e Lament inglorious Greece, and beg to die!\n\u003cbr\u003e Oh! would to all the immortal powers above,\n\u003cbr\u003e Minerva, Phoebus, and almighty Jove!\n\u003cbr\u003e Years might again roll back, my youth renew,\n\u003cbr\u003e And give this arm the spring which once it knew\n\u003cbr\u003e When fierce in war, where Jardan\u0027s waters fall,\n\u003cbr\u003e I led my troops to Phea\u0027s trembling wall,\n\u003cbr\u003e And with the Arcadian spears my prowess tried,\n\u003cbr\u003e [pg 131]\n\u003cbr\u003e Where Celadon rolls down his rapid tide.179\n\u003cbr\u003e There Ereuthalion braved us in the field,\n\u003cbr\u003e Proud Areithous\u0027 dreadful arms to wield;\n\u003cbr\u003e Great Areithous, known from shore to shore\n\u003cbr\u003e By the huge, knotted, iron mace he bore;\n\u003cbr\u003e No lance he shook, nor bent the twanging bow,\n\u003cbr\u003e But broke, with this, the battle of the foe.\n\u003cbr\u003e Him not by manly force Lycurgus slew,\n\u003cbr\u003e Whose guileful javelin from the thicket flew,\n\u003cbr\u003e Deep in a winding way his breast assailed,\n\u003cbr\u003e Nor aught the warrior\u0027s thundering mace avail\u0027d.\n\u003cbr\u003e Supine he fell: those arms which Mars before\n\u003cbr\u003e Had given the vanquish\u0027d, now the victor bore:\n\u003cbr\u003e But when old age had dimm\u0027d Lycurgus\u0027 eyes,\n\u003cbr\u003e To Ereuthalion he consign\u0027d the prize.\n\u003cbr\u003e Furious with this he crush\u0027d our levell\u0027d bands,\n\u003cbr\u003e And dared the trial of the strongest hands;\n\u003cbr\u003e Nor could the strongest hands his fury stay:\n\u003cbr\u003e All saw, and fear\u0027d, his huge tempestuous sway\n\u003cbr\u003e Till I, the youngest of the host, appear\u0027d,\n\u003cbr\u003e And, youngest, met whom all our army fear\u0027d.\n\u003cbr\u003e I fought the chief: my arms Minerva crown\u0027d:\n\u003cbr\u003e Prone fell the giant o\u0027er a length of ground.\n\u003cbr\u003e What then I was, O were your Nestor now!\n\u003cbr\u003e Not Hector\u0027s self should want an equal foe.\n\u003cbr\u003e But, warriors, you that youthful vigour boast,\n\u003cbr\u003e The flower of Greece, the examples of our host,\n\u003cbr\u003e Sprung from such fathers, who such numbers sway,\n\u003cbr\u003e Can you stand trembling, and desert the day?\"\n\u003cbr\u003e His warm reproofs the listening kings inflame;\n\u003cbr\u003e And nine, the noblest of the Grecian name,\n\u003cbr\u003e Up-started fierce: but far before the rest\n\u003cbr\u003e The king of men advanced his dauntless breast:\n\u003cbr\u003e Then bold Tydides, great in arms, appear\u0027d;\n\u003cbr\u003e And next his bulk gigantic Ajax rear\u0027d;\n\u003cbr\u003e Oileus follow\u0027d; Idomen was there,180\n\u003cbr\u003e And Merion, dreadful as the god of war:\n\u003cbr\u003e With these Eurypylus and Thoas stand,\n\u003cbr\u003e And wise Ulysses closed the daring band.\n\u003cbr\u003e All these, alike inspired with noble rage,\n\u003cbr\u003e Demand the fight. To whom the Pylian sage:\n\u003cbr\u003e \"Lest thirst of glory your brave souls divide,\n\u003cbr\u003e What chief shall combat, let the gods decide.\n\u003cbr\u003e Whom heaven shall choose, be his the chance to raise\n\u003cbr\u003e His country\u0027s fame, his own immortal praise.\"\n\u003cbr\u003e The lots produced, each hero signs his own:\n\u003cbr\u003e Then in the general\u0027s helm the fates are thrown,181\n\u003cbr\u003e [pg 132]\n\u003cbr\u003e The people pray, with lifted eyes and hands,\n\u003cbr\u003e And vows like these ascend from all the bands:\n\u003cbr\u003e \"Grant, thou Almighty! in whose hand is fate,\n\u003cbr\u003e A worthy champion for the Grecian state:\n\u003cbr\u003e This task let Ajax or Tydides prove,\n\u003cbr\u003e Or he, the king of kings, beloved by Jove.\"\n\u003cbr\u003e Old Nestor shook the casque. By heaven inspired,\n\u003cbr\u003e Leap\u0027d forth the lot, of every Greek desired.\n\u003cbr\u003e This from the right to left the herald bears,\n\u003cbr\u003e Held out in order to the Grecian peers;\n\u003cbr\u003e Each to his rival yields the mark unknown,\n\u003cbr\u003e Till godlike Ajax finds the lot his own;\n\u003cbr\u003e Surveys the inscription with rejoicing eyes,\n\u003cbr\u003e Then casts before him, and with transport cries:\n\u003cbr\u003e \"Warriors! I claim the lot, and arm with joy;\n\u003cbr\u003e Be mine the conquest of this chief of Troy.\n\u003cbr\u003e Now while my brightest arms my limbs invest,\n\u003cbr\u003e To Saturn\u0027s son be all your vows address\u0027d:\n\u003cbr\u003e But pray in secret, lest the foes should hear,\n\u003cbr\u003e And deem your prayers the mean effect of fear.\n\u003cbr\u003e Said I in secret? No, your vows declare\n\u003cbr\u003e In such a voice as fills the earth and air,\n\u003cbr\u003e Lives there a chief whom Ajax ought to dread?\n\u003cbr\u003e Ajax, in all the toils of battle bred!\n\u003cbr\u003e From warlike Salamis I drew my birth,\n\u003cbr\u003e And, born to combats, fear no force on earth.\"\n\u003cbr\u003e He said. The troops with elevated eyes,\n\u003cbr\u003e Implore the god whose thunder rends the skies:\n\u003cbr\u003e \"O father of mankind, superior lord!\n\u003cbr\u003e On lofty Ida\u0027s holy hill adored:\n\u003cbr\u003e Who in the highest heaven hast fix\u0027d thy throne,\n\u003cbr\u003e Supreme of gods! unbounded and alone:\n\u003cbr\u003e Grant thou, that Telamon may bear away\n\u003cbr\u003e The praise and conquest of this doubtful day;\n\u003cbr\u003e Or, if illustrious Hector be thy care,\n\u003cbr\u003e That both may claim it, and that both may share.\"\n\u003cbr\u003e Now Ajax braced his dazzling armour on;\n\u003cbr\u003e Sheathed in bright steel the giant-warrior shone:\n\u003cbr\u003e He moves to combat with majestic pace;\n\u003cbr\u003e So stalks in arms the grisly god of Thrace,182\n\u003cbr\u003e When Jove to punish faithless men prepares,\n\u003cbr\u003e And gives whole nations to the waste of wars,\n\u003cbr\u003e Thus march\u0027d the chief, tremendous as a god;\n\u003cbr\u003e Grimly he smiled; earth trembled as he strode:183\n\u003cbr\u003e [pg 133]\n\u003cbr\u003e His massy javelin quivering in his hand,\n\u003cbr\u003e He stood, the bulwark of the Grecian band.\n\u003cbr\u003e Through every Argive heart new transport ran;\n\u003cbr\u003e All Troy stood trembling at the mighty man:\n\u003cbr\u003e Even Hector paused; and with new doubt oppress\u0027d,\n\u003cbr\u003e Felt his great heart suspended in his breast:\n\u003cbr\u003e \u0027Twas vain to seek retreat, and vain to fear;\n\u003cbr\u003e Himself had challenged, and the foe drew near.\n\u003cbr\u003e Stern Telamon behind his ample shield,\n\u003cbr\u003e As from a brazen tower, o\u0027erlook\u0027d the field.\n\u003cbr\u003e Huge was its orb, with seven thick folds o\u0027ercast,\n\u003cbr\u003e Of tough bull-hides; of solid brass the last,\n\u003cbr\u003e (The work of Tychius, who in Hyle dwell\u0027d\n\u003cbr\u003e And in all arts of armoury excell\u0027d,)\n\u003cbr\u003e This Ajax bore before his manly breast,\n\u003cbr\u003e And, threatening, thus his adverse chief address\u0027d:\n\u003cbr\u003e \"Hector! approach my arm, and singly know\n\u003cbr\u003e What strength thou hast, and what the Grecian foe.\n\u003cbr\u003e Achilles shuns the fight; yet some there are,\n\u003cbr\u003e Not void of soul, and not unskill\u0027d in war:\n\u003cbr\u003e Let him, unactive on the sea-beat shore,\n\u003cbr\u003e Indulge his wrath, and aid our arms no more;\n\u003cbr\u003e Whole troops of heroes Greece has yet to boast,\n\u003cbr\u003e And sends thee one, a sample of her host,\n\u003cbr\u003e Such as I am, I come to prove thy might;\n\u003cbr\u003e No more—be sudden, and begin the fight.\"\n\u003cbr\u003e \"O son of Telamon, thy country\u0027s pride!\n\u003cbr\u003e (To Ajax thus the Trojan prince replied)\n\u003cbr\u003e Me, as a boy, or woman, wouldst thou fright,\n\u003cbr\u003e New to the field, and trembling at the fight?\n\u003cbr\u003e Thou meet\u0027st a chief deserving of thy arms,\n\u003cbr\u003e To combat born, and bred amidst alarms:\n\u003cbr\u003e I know to shift my ground, remount the car,\n\u003cbr\u003e Turn, charge, and answer every call of war;\n\u003cbr\u003e To right, to left, the dexterous lance I wield,\n\u003cbr\u003e And bear thick battle on my sounding shield\n\u003cbr\u003e But open be our fight, and bold each blow;\n\u003cbr\u003e I steal no conquest from a noble foe.\"\n\u003cbr\u003e He said, and rising, high above the field\n\u003cbr\u003e Whirl\u0027d the long lance against the sevenfold shield.\n\u003cbr\u003e Full on the brass descending from above\n\u003cbr\u003e Through six bull-hides the furious weapon drove,\n\u003cbr\u003e Till in the seventh it fix\u0027d. Then Ajax threw;\n\u003cbr\u003e Through Hector\u0027s shield the forceful javelin flew,\n\u003cbr\u003e His corslet enters, and his garment rends,\n\u003cbr\u003e And glancing downwards, near his flank descends.\n\u003cbr\u003e The wary Trojan shrinks, and bending low\n\u003cbr\u003e Beneath his buckler, disappoints the blow.\n\u003cbr\u003e From their bored shields the chiefs their javelins drew,\n\u003cbr\u003e Then close impetuous, and the charge renew;\n\u003cbr\u003e [pg 134]\n\u003cbr\u003e Fierce as the mountain-lions bathed in blood,\n\u003cbr\u003e Or foaming boars, the terror of the wood.\n\u003cbr\u003e At Ajax, Hector his long lance extends;\n\u003cbr\u003e The blunted point against the buckler bends;\n\u003cbr\u003e But Ajax, watchful as his foe drew near,\n\u003cbr\u003e Drove through the Trojan targe the knotty spear;\n\u003cbr\u003e It reach\u0027d his neck, with matchless strength impell\u0027d!\n\u003cbr\u003e Spouts the black gore, and dims his shining shield.\n\u003cbr\u003e Yet ceased not Hector thus; but stooping down,\n\u003cbr\u003e In his strong hand up-heaved a flinty stone,\n\u003cbr\u003e Black, craggy, vast: to this his force he bends;\n\u003cbr\u003e Full on the brazen boss the stone descends;\n\u003cbr\u003e The hollow brass resounded with the shock:\n\u003cbr\u003e Then Ajax seized the fragment of a rock,\n\u003cbr\u003e Applied each nerve, and swinging round on high,\n\u003cbr\u003e With force tempestuous, let the ruin fly;\n\u003cbr\u003e The huge stone thundering through his buckler broke:\n\u003cbr\u003e His slacken\u0027d knees received the numbing stroke;\n\u003cbr\u003e Great Hector falls extended on the field,\n\u003cbr\u003e His bulk supporting on the shatter\u0027d shield:\n\u003cbr\u003e Nor wanted heavenly aid: Apollo\u0027s might\n\u003cbr\u003e Confirm\u0027d his sinews, and restored to fight.\n\u003cbr\u003e And now both heroes their broad falchions drew\n\u003cbr\u003e In flaming circles round their heads they flew;\n\u003cbr\u003e But then by heralds\u0027 voice the word was given.\n\u003cbr\u003e The sacred ministers of earth and heaven:\n\u003cbr\u003e Divine Talthybius, whom the Greeks employ.\n\u003cbr\u003e And sage Idaeus on the part of Troy,\n\u003cbr\u003e [pg 135]\n\u003cbr\u003e Between the swords their peaceful sceptres rear\u0027d;\n\u003cbr\u003e And first Idaeus\u0027 awful voice was heard:\n\u003cbr\u003e \n\u003cbr\u003e Illustration: HECTOR AND AJAX SEPARATED BY THE HERALDS.\n\u003cbr\u003e HECTOR AND AJAX SEPARATED BY THE HERALDS.\n\u003cbr\u003e \"Forbear, my sons! your further force to prove,\n\u003cbr\u003e Both dear to men, and both beloved of Jove.\n\u003cbr\u003e To either host your matchless worth is known,\n\u003cbr\u003e Each sounds your praise, and war is all your own.\n\u003cbr\u003e But now the Night extends her awful shade;\n\u003cbr\u003e The goddess parts you; be the night obey\u0027d.\"184\n\u003cbr\u003e To whom great Ajax his high soul express\u0027d:\n\u003cbr\u003e \"O sage! to Hector be these words address\u0027d.\n\u003cbr\u003e Let him, who first provoked our chiefs to fight,\n\u003cbr\u003e Let him demand the sanction of the night;\n\u003cbr\u003e If first he ask\u0027d it, I content obey,\n\u003cbr\u003e And cease the strife when Hector shows the way.\"\n\u003cbr\u003e \"O first of Greeks! (his noble foe rejoin\u0027d)\n\u003cbr\u003e Whom heaven adorns, superior to thy kind,\n\u003cbr\u003e With strength of body, and with worth of mind!\n\u003cbr\u003e Now martial law commands us to forbear;\n\u003cbr\u003e Hereafter we shall meet in glorious war,\n\u003cbr\u003e Some future day shall lengthen out the strife,\n\u003cbr\u003e And let the gods decide of death or life!\n\u003cbr\u003e Since, then, the night extends her gloomy shade,\n\u003cbr\u003e And heaven enjoins it, be the night obey\u0027d.\n\u003cbr\u003e Return, brave Ajax, to thy Grecian friends,\n\u003cbr\u003e And joy the nations whom thy arm defends;\n\u003cbr\u003e As I shall glad each chief, and Trojan wife,\n\u003cbr\u003e Who wearies heaven with vows for Hector\u0027s life.\n\u003cbr\u003e But let us, on this memorable day,\n\u003cbr\u003e Exchange some gift: that Greece and Troy may say,\n\u003cbr\u003e \u0027Not hate, but glory, made these chiefs contend;\n\u003cbr\u003e And each brave foe was in his soul a friend.\u0027\"\n\u003cbr\u003e With that, a sword with stars of silver graced,\n\u003cbr\u003e The baldric studded, and the sheath enchased,\n\u003cbr\u003e He gave the Greek. The generous Greek bestow\u0027d\n\u003cbr\u003e A radiant belt that rich with purple glow\u0027d.\n\u003cbr\u003e Then with majestic grace they quit the plain;\n\u003cbr\u003e This seeks the Grecian, that the Phrygian train.\n\u003cbr\u003e The Trojan bands returning Hector wait,\n\u003cbr\u003e And hail with joy the Champion of their state;\n\u003cbr\u003e Escaped great Ajax, they survey him round,\n\u003cbr\u003e Alive, unarm\u0027d, and vigorous from his wound;\n\u003cbr\u003e To Troy\u0027s high gates the godlike man they bear\n\u003cbr\u003e Their present triumph, as their late despair.\n\u003cbr\u003e But Ajax, glorying in his hardy deed,\n\u003cbr\u003e The well-arm\u0027d Greeks to Agamemnon lead.\n\u003cbr\u003e A steer for sacrifice the king design\u0027d,\n\u003cbr\u003e [pg 136]\n\u003cbr\u003e Of full five years, and of the nobler kind.\n\u003cbr\u003e The victim falls; they strip the smoking hide,\n\u003cbr\u003e The beast they quarter, and the joints divide;\n\u003cbr\u003e Then spread the tables, the repast prepare,\n\u003cbr\u003e Each takes his seat, and each receives his share.\n\u003cbr\u003e The king himself (an honorary sign)\n\u003cbr\u003e Before great Ajax placed the mighty chine.185\n\u003cbr\u003e When now the rage of hunger was removed,\n\u003cbr\u003e Nestor, in each persuasive art approved,\n\u003cbr\u003e The sage whose counsels long had sway\u0027d the rest,\n\u003cbr\u003e In words like these his prudent thought express\u0027d:\n\u003cbr\u003e \"How dear, O kings! this fatal day has cost,\n\u003cbr\u003e What Greeks are perish\u0027d! what a people lost!\n\u003cbr\u003e What tides of blood have drench\u0027d Scamander\u0027s shore!\n\u003cbr\u003e What crowds of heroes sunk to rise no more!\n\u003cbr\u003e Then hear me, chief! nor let the morrow\u0027s light\n\u003cbr\u003e Awake thy squadrons to new toils of fight:\n\u003cbr\u003e Some space at least permit the war to breathe,\n\u003cbr\u003e While we to flames our slaughter\u0027d friends bequeath,\n\u003cbr\u003e From the red field their scatter\u0027d bodies bear,\n\u003cbr\u003e And nigh the fleet a funeral structure rear;\n\u003cbr\u003e So decent urns their snowy bones may keep,\n\u003cbr\u003e And pious children o\u0027er their ashes weep.\n\u003cbr\u003e Here, where on one promiscuous pile they blazed,\n\u003cbr\u003e High o\u0027er them all a general tomb be raised;\n\u003cbr\u003e Next, to secure our camp and naval powers,\n\u003cbr\u003e Raise an embattled wall, with lofty towers;\n\u003cbr\u003e From space to space be ample gates around,\n\u003cbr\u003e For passing chariots; and a trench profound.\n\u003cbr\u003e So Greece to combat shall in safety go,\n\u003cbr\u003e Nor fear the fierce incursions of the foe.\"\n\u003cbr\u003e \u0027Twas thus the sage his wholesome counsel moved;\n\u003cbr\u003e The sceptred kings of Greece his words approved.\n\u003cbr\u003e Meanwhile, convened at Priam\u0027s palace-gate,\n\u003cbr\u003e The Trojan peers in nightly council sate;\n\u003cbr\u003e A senate void of order, as of choice:\n\u003cbr\u003e Their hearts were fearful, and confused their voice.\n\u003cbr\u003e Antenor, rising, thus demands their ear:\n\u003cbr\u003e \"Ye Trojans, Dardans, and auxiliars, hear!\n\u003cbr\u003e \u0027Tis heaven the counsel of my breast inspires,\n\u003cbr\u003e And I but move what every god requires:\n\u003cbr\u003e Let Sparta\u0027s treasures be this hour restored,\n\u003cbr\u003e And Argive Helen own her ancient lord.\n\u003cbr\u003e The ties of faith, the sworn alliance, broke,\n\u003cbr\u003e Our impious battles the just gods provoke.\n\u003cbr\u003e As this advice ye practise, or reject,\n\u003cbr\u003e So hope success, or dread the dire effect.\"\n\u003cbr\u003e [pg 137]\n\u003cbr\u003e The senior spoke and sate. To whom replied\n\u003cbr\u003e The graceful husband of the Spartan bride:\n\u003cbr\u003e \"Cold counsels, Trojan, may become thy years\n\u003cbr\u003e But sound ungrateful in a warrior\u0027s ears:\n\u003cbr\u003e Old man, if void of fallacy or art,\n\u003cbr\u003e Thy words express the purpose of thy heart,\n\u003cbr\u003e Thou, in thy time, more sound advice hast given;\n\u003cbr\u003e But wisdom has its date, assign\u0027d by heaven.\n\u003cbr\u003e Then hear me, princes of the Trojan name!\n\u003cbr\u003e Their treasures I\u0027ll restore, but not the dame;\n\u003cbr\u003e My treasures too, for peace, I will resign;\n\u003cbr\u003e But be this bright possession ever mine.\"\n\u003cbr\u003e \u0027Twas then, the growing discord to compose,\n\u003cbr\u003e Slow from his seat the reverend Priam rose:\n\u003cbr\u003e His godlike aspect deep attention drew:\n\u003cbr\u003e He paused, and these pacific words ensue:\n\u003cbr\u003e \"Ye Trojans, Dardans, and auxiliar bands!\n\u003cbr\u003e Now take refreshment as the hour demands;\n\u003cbr\u003e Guard well the walls, relieve the watch of night.\n\u003cbr\u003e Till the new sun restores the cheerful light.\n\u003cbr\u003e Then shall our herald, to the Atrides sent,\n\u003cbr\u003e Before their ships proclaim my son\u0027s intent.\n\u003cbr\u003e Next let a truce be ask\u0027d, that Troy may burn\n\u003cbr\u003e Her slaughter\u0027d heroes, and their bones inurn;\n\u003cbr\u003e That done, once more the fate of war be tried,\n\u003cbr\u003e And whose the conquest, mighty Jove decide!\"\n\u003cbr\u003e The monarch spoke: the warriors snatch\u0027d with haste\n\u003cbr\u003e (Each at his post in arms) a short repast.\n\u003cbr\u003e Soon as the rosy morn had waked the day,\n\u003cbr\u003e To the black ships Idaeus bent his way;\n\u003cbr\u003e There, to the sons of Mars, in council found,\n\u003cbr\u003e He raised his voice: the host stood listening round.\n\u003cbr\u003e \"Ye sons of Atreus, and ye Greeks, give ear!\n\u003cbr\u003e The words of Troy, and Troy\u0027s great monarch, hear.\n\u003cbr\u003e Pleased may ye hear (so heaven succeed my prayers)\n\u003cbr\u003e What Paris, author of the war, declares.\n\u003cbr\u003e The spoils and treasures he to Ilion bore\n\u003cbr\u003e (Oh had he perish\u0027d ere they touch\u0027d our shore!)\n\u003cbr\u003e He proffers injured Greece: with large increase\n\u003cbr\u003e Of added Trojan wealth to buy the peace.\n\u003cbr\u003e But to restore the beauteous bride again,\n\u003cbr\u003e This Greece demands, and Troy requests in vain.\n\u003cbr\u003e Next, O ye chiefs! we ask a truce to burn\n\u003cbr\u003e Our slaughter\u0027d heroes, and their bones inurn.\n\u003cbr\u003e That done, once more the fate of war be tried,\n\u003cbr\u003e And whose the conquest, mighty Jove decide!\"\n\u003cbr\u003e The Greeks gave ear, but none the silence broke;\n\u003cbr\u003e At length Tydides rose, and rising spoke:\n\u003cbr\u003e \"Oh, take not, friends! defrauded of your fame,\n\u003cbr\u003e Their proffer\u0027d wealth, nor even the Spartan dame.\n\u003cbr\u003e [pg 138]\n\u003cbr\u003e Let conquest make them ours: fate shakes their wall,\n\u003cbr\u003e And Troy already totters to her fall.\"\n\u003cbr\u003e The admiring chiefs, and all the Grecian name,\n\u003cbr\u003e With general shouts return\u0027d him loud acclaim.\n\u003cbr\u003e Then thus the king of kings rejects the peace:\n\u003cbr\u003e \"Herald! in him thou hear\u0027st the voice of Greece\n\u003cbr\u003e For what remains; let funeral flames be fed\n\u003cbr\u003e With heroes\u0027 corps: I war not with the dead:\n\u003cbr\u003e Go search your slaughtered chiefs on yonder plain,\n\u003cbr\u003e And gratify the manes of the slain.\n\u003cbr\u003e Be witness, Jove, whose thunder rolls on high!\"\n\u003cbr\u003e He said, and rear\u0027d his sceptre to the sky.\n\u003cbr\u003e To sacred Troy, where all her princes lay\n\u003cbr\u003e To wait the event, the herald bent his way.\n\u003cbr\u003e He came, and standing in the midst, explain\u0027d\n\u003cbr\u003e The peace rejected, but the truce obtain\u0027d.\n\u003cbr\u003e Straight to their several cares the Trojans move,\n\u003cbr\u003e Some search the plains, some fell the sounding grove:\n\u003cbr\u003e Nor less the Greeks, descending on the shore,\n\u003cbr\u003e Hew\u0027d the green forests, and the bodies bore.\n\u003cbr\u003e And now from forth the chambers of the main,\n\u003cbr\u003e To shed his sacred light on earth again,\n\u003cbr\u003e Arose the golden chariot of the day,\n\u003cbr\u003e And tipp\u0027d the mountains with a purple ray.\n\u003cbr\u003e In mingled throngs the Greek and Trojan train\n\u003cbr\u003e Through heaps of carnage search\u0027d the mournful plain.\n\u003cbr\u003e Scarce could the friend his slaughter\u0027d friend explore,\n\u003cbr\u003e With dust dishonour\u0027d, and deformed with gore.\n\u003cbr\u003e The wounds they wash\u0027d, their pious tears they shed,\n\u003cbr\u003e And, laid along their cars, deplored the dead.\n\u003cbr\u003e Sage Priam check\u0027d their grief: with silent haste\n\u003cbr\u003e The bodies decent on the piles were placed:\n\u003cbr\u003e With melting hearts the cold remains they burn\u0027d,\n\u003cbr\u003e And, sadly slow, to sacred Troy return\u0027d.\n\u003cbr\u003e Nor less the Greeks their pious sorrows shed,\n\u003cbr\u003e And decent on the pile dispose the dead;\n\u003cbr\u003e The cold remains consume with equal care;\n\u003cbr\u003e And slowly, sadly, to their fleet repair.\n\u003cbr\u003e Now, ere the morn had streak\u0027d with reddening light\n\u003cbr\u003e The doubtful confines of the day and night,\n\u003cbr\u003e About the dying flames the Greeks appear\u0027d,\n\u003cbr\u003e And round the pile a general tomb they rear\u0027d.\n\u003cbr\u003e Then, to secure the camp and naval powers,\n\u003cbr\u003e They raised embattled walls with lofty towers:186\n\u003cbr\u003e [pg 139]\n\u003cbr\u003e From space to space were ample gates around,\n\u003cbr\u003e For passing chariots, and a trench profound\n\u003cbr\u003e Of large extent; and deep in earth below,\n\u003cbr\u003e Strong piles infix\u0027d stood adverse to the foe.\n\u003cbr\u003e So toil\u0027d the Greeks: meanwhile the gods above,\n\u003cbr\u003e In shining circle round their father Jove,\n\u003cbr\u003e Amazed beheld the wondrous works of man:\n\u003cbr\u003e Then he, whose trident shakes the earth, began:\n\u003cbr\u003e \"What mortals henceforth shall our power adore,\n\u003cbr\u003e Our fanes frequent, our oracles implore,\n\u003cbr\u003e If the proud Grecians thus successful boast\n\u003cbr\u003e Their rising bulwarks on the sea-beat coast?\n\u003cbr\u003e See the long walls extending to the main,\n\u003cbr\u003e No god consulted, and no victim slain!\n\u003cbr\u003e Their fame shall fill the world\u0027s remotest ends,\n\u003cbr\u003e Wide as the morn her golden beam extends;\n\u003cbr\u003e While old Laomedon\u0027s divine abodes,\n\u003cbr\u003e Those radiant structures raised by labouring gods,\n\u003cbr\u003e Shall, razed and lost, in long oblivion sleep.\"\n\u003cbr\u003e Thus spoke the hoary monarch of the deep.\n\u003cbr\u003e The almighty Thunderer with a frown replies,\n\u003cbr\u003e That clouds the world, and blackens half the skies:\n\u003cbr\u003e \"Strong god of ocean! thou, whose rage can make\n\u003cbr\u003e The solid earth\u0027s eternal basis shake!\n\u003cbr\u003e What cause of fear from mortal works could move187\n\u003cbr\u003e The meanest subject of our realms above?\n\u003cbr\u003e Where\u0027er the sun\u0027s refulgent rays are cast,\n\u003cbr\u003e Thy power is honour\u0027d, and thy fame shall last.\n\u003cbr\u003e But yon proud work no future age shall view,\n\u003cbr\u003e No trace remain where once the glory grew.\n\u003cbr\u003e The sapp\u0027d foundations by thy force shall fall,\n\u003cbr\u003e And, whelm\u0027d beneath the waves, drop the huge wall:\n\u003cbr\u003e Vast drifts of sand shall change the former shore:\n\u003cbr\u003e The ruin vanish\u0027d, and the name no more.\"\n\u003cbr\u003e Thus they in heaven: while, o\u0027er the Grecian train,\n\u003cbr\u003e The rolling sun descending to the main\n\u003cbr\u003e Beheld the finish\u0027d work. Their bulls they slew;\n\u003cbr\u003e Back from the tents the savoury vapour flew.\n\u003cbr\u003e And now the fleet, arrived from Lemnos\u0027 strands,\n\u003cbr\u003e With Bacchus\u0027 blessings cheered the generous bands.\n\u003cbr\u003e Of fragrant wines the rich Eunaeus sent\n\u003cbr\u003e A thousant measures to the royal tent.\n\u003cbr\u003e (Eunaeus, whom Hypsipyle of yore\n\u003cbr\u003e To Jason, shepherd of his people, bore,)\n\u003cbr\u003e [pg 140]\n\u003cbr\u003e The rest they purchased at their proper cost,\n\u003cbr\u003e And well the plenteous freight supplied the host:\n\u003cbr\u003e Each, in exchange, proportion\u0027d treasures gave;188\n\u003cbr\u003e Some, brass or iron; some, an ox, or slave.\n\u003cbr\u003e All night they feast, the Greek and Trojan powers:\n\u003cbr\u003e Those on the fields, and these within their towers.\n\u003cbr\u003e But Jove averse the signs of wrath display\u0027d,\n\u003cbr\u003e And shot red lightnings through the gloomy shade:\n\u003cbr\u003e Humbled they stood; pale horror seized on all,\n\u003cbr\u003e While the deep thunder shook the aerial hall.\n\u003cbr\u003e Each pour\u0027d to Jove before the bowl was crown\u0027d;\n\u003cbr\u003e And large libations drench\u0027d the thirsty ground:\n\u003cbr\u003e Then late, refresh\u0027d with sleep from toils of fight,\n\u003cbr\u003e Enjoy\u0027d the balmy blessings of the night.\n\u003cbr\u003e \n\u003cbr\u003e Illustration: GREEK AMPHORA—WINE VESSELS.\n\u003cbr\u003e GREEK AMPHORA—WINE VESSELS.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1549/45994.html","bookId":1297,"creation":"Aug 5, 2019 5:54:27 AM","modification":"Aug 5, 2019 5:54:27 AM"}
