{"id":10874,"no":1,"title":"VOLUME I Chapter 1. Alice Maybell.","content":"In the small breakfast parlour of Oulton, a pretty girl, Miss Alice Maybell, with her furs and wrappers about her, and a journey of forty miles before her—not by rail—to Wyvern, had stood up to hug and kiss her old aunt, and bid her good-bye.\n\u003cbr\u003e \n\u003cbr\u003e “Now, do sit down again; you need not be in such a hurry—you’re not to go for ten minutes or more,” said the old lady; “do, there’s a darling.”\n\u003cbr\u003e \n\u003cbr\u003e “If I’m not home before the sun goes down, aunt, Mr. Fairfield will be so angry,” said the girl, laying a hand on each shoulder of kind old Lady Wyndale, and looking fondly, but also sadly, into her face.\n\u003cbr\u003e \n\u003cbr\u003e “Which Mr. Fairfield, dear—the old or the young one?”\n\u003cbr\u003e \n\u003cbr\u003e “Old Mr. Fairfield, the Squire, as we call him at Wyvern. He’ll really be angry, and I’m a little bit afraid of him, and I would not vex him for the world—he has always been so kind.”\n\u003cbr\u003e \n\u003cbr\u003e As she answered, the young lady blushed a beautiful crimson, and the old lady, not observing it, said—\n\u003cbr\u003e \n\u003cbr\u003e “Indeed, I don’t know why I said young—young Mr. Fairfield is old enough, I think, to be your father; but I want to know how you liked Lord Tremaine. I told you how much he liked you. I’m a great believer in first impressions. He was so charmed with you, when he saw you in Wyvern Church. Of course he ought to have been thinking of something better ; but no matter—the fact was so, and now he is, I really think, in love—very much—and who knows? He’s such a charming person, and there is everything to make it—I don’t know what word to use—but you know Tremaine is quite a beautiful place, and he does not owe a guinea.”\n\u003cbr\u003e \n\u003cbr\u003e “You dear old auntie,” said the girl, kissing her again on the cheek, “wicked old darling—always making great matches for me. If you had remained in India, you’d have married me, I’m sure, to a native prince”.\n\u003cbr\u003e \n\u003cbr\u003e “Native fiddlestick; of course I could if I had liked, but you never should have married a Mahomedan with my consent. Never mind though; you’re sure to do well; marriages are made in heaven, and I really believe there is no use in plotting and planning. There was your darling mamma, when we were both girls together, I said I should never consent to marry a soldier, or live out of England, and I did marry a soldier, and lived twelve years of my life in India; and she, poor darling, said again and again, she did not care who her husband might be, provided he was not a clergyman, nor a person living all the year round in the country—that no power could induce her to consent to, and yet she did consent, and to both one and the other, and married a clergyman, and a poor one, and lived and died in the country. So, after all, there’s not much use in planning beforehand.”\n\u003cbr\u003e \n\u003cbr\u003e “Very true, auntie; none in the world, I believe.”\n\u003cbr\u003e \n\u003cbr\u003e The girl was looking partly over her shoulder, out of the window, upward towards the clouds, and she sighed heavily; and recollecting herself, looked again in her aunt’s face and smiled.\n\u003cbr\u003e \n\u003cbr\u003e “I wish you could have stayed a little longer here,” said her aunt.\n\u003cbr\u003e \n\u003cbr\u003e “I wish I could,” she answered slowly, “I was thinking of talking over a great many things with you—that is, of telling you all my long stories; but while those people were staying here I could not, and now there is not time.”\n\u003cbr\u003e \n\u003cbr\u003e “What long stories, my dear?”\n\u003cbr\u003e \n\u003cbr\u003e “Stupid stories, I should have said,” answered Alice.\n\u003cbr\u003e \n\u003cbr\u003e “Well come, is there anything to tell?” demanded the old lady, looking in her large, dark eyes.\n\u003cbr\u003e \n\u003cbr\u003e “Nothing worth telling—nothing that is—“and she paused for the continuation of her sentence.\n\u003cbr\u003e \n\u003cbr\u003e “That is what?” asked her aunt.\n\u003cbr\u003e \n\u003cbr\u003e “I was going to talk to you, darling,” answered the girl, “but I could not in so short a time—so short a time as remains now,” and she looked at her watch—a gift of old Squire Fairfield’s. “I should not know how to make myself understood, I have so many hundred things, and all jumbled up in my head, and should not know how to begin.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, I’ll begin for you. Come—have any visitors looked in at Wyvern lately?” said her aunt.\n\u003cbr\u003e \n\u003cbr\u003e “Not one,” she answered.\n\u003cbr\u003e \n\u003cbr\u003e “No new faces?”\n\u003cbr\u003e \n\u003cbr\u003e “No, indeed.”\n\u003cbr\u003e \n\u003cbr\u003e “Are there any new neighbours?” persisted the old lady.\n\u003cbr\u003e \n\u003cbr\u003e “Not one. No, aunt, it isn’t that.”\n\u003cbr\u003e \n\u003cbr\u003e “And where are these elderly young gentlemen, the two Mr. Fairfields?” asked the old lady.\n\u003cbr\u003e \n\u003cbr\u003e The girl laughed, and shook her head.\n\u003cbr\u003e \n\u003cbr\u003e “Wandering at present. Captain Fairfield is in London.”\n\u003cbr\u003e \n\u003cbr\u003e “And his charming younger brother—where is he?” asked Lady Wyndale.\n\u003cbr\u003e \n\u003cbr\u003e “At some fair, I suppose, or horse-race; or, goodness knows where,” answered the girl.\n\u003cbr\u003e \n\u003cbr\u003e “I was going to ask you whether there was an affair of the heart,” said her aunt. “But there does not seem much material; and what was the subject? Though I can’t hear it all, you may tell me what it was to be about.”\n\u003cbr\u003e \n\u003cbr\u003e “About fifty things, or nothings. There’s no one on earth, auntie, darling, but you I can talk anything over with; and I’ll write, or, if you let me, come again for a day or two, very soon—may I?”\n\u003cbr\u003e \n\u003cbr\u003e “Of course, no” said her aunt gaily. “But we are not to be quite alone, all the time, mind. There are people who would not forgive me if I were to do anything so selfish, but I promise you ample time to talk—you and I to ourselves; and now that I think, I should like to hear by the post, if you will write and say anything you like. You may be quite sure nobody shall hear a word about it.”\n\u003cbr\u003e \n\u003cbr\u003e By this time they had got to the hall-door.\n\u003cbr\u003e \n\u003cbr\u003e “I’m sure of that, darling,” and she kissed the kind old lady.\n\u003cbr\u003e \n\u003cbr\u003e “And are you quite sure you would not like a servant to travel with you; he could sit beside the driver?”\n\u003cbr\u003e \n\u003cbr\u003e “No, dear auntie, my trusty old Dulcibella sits inside to take care of me.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, dear, are you quite sure? I should not miss him the least.”\n\u003cbr\u003e \n\u003cbr\u003e “Quite, dear aunt, I assure you.”\n\u003cbr\u003e \n\u003cbr\u003e “And you know you told me you were quite happy at Wyvern,” said Lady Wyndale, returning her farewell caress, and speaking low, for a servant stood at the chaise-door.\n\u003cbr\u003e \n\u003cbr\u003e “Did I? Well, I shouldn’t have said that, for—I’m not happy,” whispered Alice Maybell, and the tears sprang to her eyes as she kissed her old kinswoman; and then, with her arms still about her neck, there was a brief look from her large, brimming eyes, while her lip trembled; and suddenly she turned, and before Lady Wyndale had recovered from that little shock, her pretty guest was seated in the chaise, the door shut, and she drove away.\n\u003cbr\u003e \n\u003cbr\u003e “What can it be, poor little thing?” thought Lady Wyndale, as her eyes anxiously followed the carriage in its flight down the avenue.\n\u003cbr\u003e \n\u003cbr\u003e “They have shot her pet-pigeon, or the dog has killed her guinea-pig, or old Fairfield won’t allow her to sit up till twelve o’clock at night, reading her novel. Some childish misery, I dare say, poor little soul!”\n\u003cbr\u003e \n\u003cbr\u003e But for all that she was not satisfied, and her poor, pale, troubled look haunted her.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1434/43152.html","bookId":1373,"creation":"Aug 2, 2019 3:28:12 AM","modification":"Aug 2, 2019 3:28:12 AM"}
