{"id":18662,"no":2,"title":"Chapter 2","content":"\u0026nbsp;For a moment it was silent in the room, except for the sound of the electricians outside the door. \"Goddamit,\" said an electrician. \"You can\u0027t use that hookup on the Y-circuit. You\u0027ll cut out the monitors.\" \n\u003cdiv\u003e\n Ralph Rodkey tiptoed to the bedroom door and closed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surely you\u0027re joking,\" said Dr. Bruber. \"Quite a sense of humor. Ha-Ha.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027m not. We discovered there was at least one habitable planet here—and where there are habitable planets, there are likely to be human beings. Human beings are dangerous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rodkey cleared his throat. \"Gentlemen. Far be it from me to interfere in a scientific discussion like this, but if I were you I\u0027d try another tack. A large number of our viewers might not understand it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think it would be better, perhaps, if we killed them all without warning?\" Olbu said, turning toward the director.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, Mr. Olbu,\" said Rodkey. \"You don\u0027t intend to blot us out, do you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That decision is hardly mine to make,\" said Olbu. \"I\u0027ll have to report to my superiors. If you\u0027re dangerous, you\u0027ll have to be erased, and there\u0027s nothing that can be done about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excuse me a moment.\" Rodkey rose, went to the phone and ordered liquor sent up to the room. He hung up the receiver. \"I think it\u0027s best that we make your stay here a pleasant one, Olbu.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you intend to bribe me, I\u0027m afraid you\u0027ll have no success,\" said Olbu. \"I was chosen because I am impeccable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m quite sure of it,\" said Dr. Bruber. \"And perhaps there is something in your premise that not all human beings are desirable. I should like to know how Earth is making out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Olbu shrugged his shoulders. \"So far I\u0027ve seen nothing worth saving,\" he said. \"You\u0027re a vain lot. You\u0027re trivial. You have no respect for the dignity of Man. And your worst fault is ambition. I suppose you have wars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not for a long time. Two or three years anyhow,\" said Rodkey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long is a year? Ah yes, I forgot. It is the period of the planet on its journey around the sun. And how long does that take? One year. The usual nonsensical way you have of defining things. You don\u0027t even know how to measure time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How very interesting!\" exclaimed Dr. Bruber. \"Actually it never occurred to me that there might be an absolute method of measuring time. What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the Mpto. Forty-three and a third Mptos make an Anup, and twelve million Anups make a Zorex. It\u0027s a lot simpler than seconds, minutes, hours, days, weeks and so on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I see,\" said Dr. Bruber. \"But getting back to our topic. Just what should we have that would make us worth saving?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stability,\" said Olbu. \"Earthmen lack stability.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you think you should talk more about your trip?\" Rodkey asked. \"How did Saturn look when you passed it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Saturn wasn\u0027t in the right place to be seen at all,\" Dr. Bruber said. \"But you did see Pluto. How did it look?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There was nothing about it and it looked awful,\" said Olbu.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hate to be injecting my own personal ideas into this conversation,\" said Rodkey, \"because after all, I know nothing about science. But don\u0027t you suppose it would please our viewers if we talked more about space flight than about the destruction of the human race?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see,\" said Olbu to Dr. Bruber. \"That\u0027s what I mean. No stability.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"After all, the poor man doesn\u0027t want to lose his job,\" Bruber explained. \"I\u0027d say that was a desire to be stable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he\u0027s going to be dead, which he will be when I get word from my superiors, he\u0027ll lose his job whether he wants to or not,\" said Olbu.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go along with a joke as well as anyone,\" said Rodkey, \"but gentlemen, we\u0027ve only got twelve minutes till we go on the air. Now let\u0027s cut out this nonsense about destroying Earth and talk about something pleasant.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly,\" said Dr. Bruber. \"What planet did you come from?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Xvik,\" said Olbu. \"It\u0027s the fourth planet of a star you call GC1242.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good old GC1242!\" said Dr. Bruber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you know that star?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it\u0027s a minor variable loosely attached to Lyra.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s nothing loose about my star,\" said Olbu.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sure Dr. Bruber didn\u0027t mean it that way,\" said Rodkey hastily. He looked nervously at Dr. Bruber. \"Did you, doctor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s one of the things I don\u0027t know,\" he said, wiping his glasses on his handkerchief. \"Tell me, Olbu, if you should decide we aren\u0027t worth saving, how would you communicate with your superiors, considering they\u0027re 32 light years away. Wouldn\u0027t it take 64 years—thirty-two going and thirty-two coming—to get a message through?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no! I communicate by instantaneous telepathy,\" said Olbu. \"It\u0027s much faster than energy forms of communication.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you\u0027d talk about something else,\" said Rodkey. \"Only ten minutes to go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dr. Bruber disregarded the request. \"I don\u0027t know why people on a planet 32 light years away should consider Earth dangerous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Earth isn\u0027t. It\u0027s only the people on it,\" said Olbu.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you know about the people?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We have a method of enlarging telescopic photos to bring out every detail. We know all about Man, we\u0027ve watched you from the days when your ancestors lived in caves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Goodness! You know more about us than we know ourselves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you tell our viewers about that!\" exclaimed Rodkey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" went on Olbu, who also seemed to have forgotten the existence of Rodkey, \"we saw your ancestors fight with sticks and stones. We saw them use spears, then gunpowder. Then we saw the atom bomb and the Council decided to send me to see if anything could be salvaged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But the bomb was 200 years ago,\" said Dr. Bruber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Twelve Zorax,\" corrected Olbu. \"I\u0027ve been on the way here for twelve Zorax—or if you will—thirty-two light years, two hundred time years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surely the atom bomb can\u0027t affect your existence when we don\u0027t even have space flight,\" said Dr. Bruber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My race has developed a type of logic that can look into the future,\" said Olbu. \"We know that certain patterns develop from past events. In your case, you\u0027ll follow the Atom bomb with the Hydrogen bomb, and the Hydrogen bomb with the Cobalt bomb—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We have them both.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! You see. Our logical foresight is infallible,\" said Olbu. \"Next you\u0027ll wipe out nations; when only one is left, you\u0027ll fight neighboring planets. Since you haven\u0027t any inhabited near neighbors, you\u0027ll have to invade Alpha Centauri. After that you\u0027ll battle with other stars, until you\u0027ve conquered the cluster, then the galaxy, finally the universe. It\u0027s a very unstable state of affairs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Slowly Dr. Bruber nodded. \"You\u0027re right. I never realized where science was taking us. You have something ready to wipe us out with?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Olbu. \"Just beyond the moon, circling the Earth and the moon as a satellite, is a missile which I can bring here by instantaneous telepathy, as soon as I have my orders from my superior.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I trust you\u0027ll postpone the fateful message until after our telecast?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Olbu smiled graciously. \"A dying man is usually granted his last request.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen,\" said Rodkey, wiping his brow with a damp handkerchief, \"they\u0027re waiting for us in the next room. We\u0027re on in a minute.\" He opened the door, allowed Olbu to pass through first, and then whispered to Dr. Bruber. \"I guess my job doesn\u0027t matter now. At least we\u0027ll scoop the other networks on the end of the world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tish, tosh, old man,\" said Dr. Bruber. \"Your job\u0027s safe and so is the world. But if I should resort to murder in the next fifteen minutes, I hope you\u0027ll testify in my behalf.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3198/87414.html","bookId":765,"creation":"Aug 2, 2019 10:21:45 AM","modification":"Aug 2, 2019 10:21:45 AM"}
