{"id":73883,"no":19,"title":"Page 19","content":"\u003cp\u003eBut he never says a word about his mother.\u003c/p\u003e\n\u003cp\u003eAdam says that no one knows anything about Warner’s mother—that she’s never been discussed and no one has any idea who she is. He says that Warner is only known to be the consequence of ruthless parenting, and a cold, calculated desire for power. He hates happy children and happy parents and their happy lives.\u003c/p\u003e\n\u003cp\u003eI think Warner thinks that I understand. That I understand him.\u003c/p\u003e\n\u003cp\u003eAnd I do. And I don’t.\u003c/p\u003e\n\u003cp\u003eBecause we’re not the same.\u003c/p\u003e\n\u003cp\u003eI want to be better.\u003c/p\u003e\n\u003cp\u003eAdam and I have little time together but nighttime. And even then, not so much. Warner watches me more closely every day; disabling the cameras only made him more suspicious. He’s always walking into my room unexpectedly, taking me on unnecessary tours around the building, talking about nothing but his plans and his plans to make more plans and how together we’ll conquer the world. I don’t pretend to care.\u003c/p\u003e\n\u003cp\u003eMaybe it’s me who’s making this worse.\u003c/p\u003e\n\u003cp\u003e“I can’t believe Warner actually agreed to get rid of your cameras,” Adam said to me one night.\u003c/p\u003e\n\u003cp\u003e“He’s insane. He’s not rational. He’s sick in a way I’ll never understand.”\u003c/p\u003e\n\u003cp\u003eAdam sighed. “He’s obsessed with you.”\u003c/p\u003e\n\u003cp\u003e“What?” I nearly snapped my neck in surprise.\u003c/p\u003e\n\u003cp\u003e“You’re all he ever talks about.” Adam was silent a moment, his jaw too tight. “I heard stories about you before you even got here. That’s why I got involved—it’s why I volunteered to go get you. Warner spent months collecting information about you: addresses, medical records, personal histories, family relations, birth certificates, blood tests. The entire army was talking about his new project; everyone knew he was looking for a girl who’d killed a little boy in a grocery store. A girl named Juliette.”\u003c/p\u003e\n\u003cp\u003eI held my breath.\u003c/p\u003e\n\u003cp\u003eAdam shook his head. “I knew it was you. It had to be. I asked Warner if I could help with the project—I told him I’d gone to school with you, that I’d heard about the little boy, that I’d seen you in person.” He laughed a hard laugh. “Warner was thrilled. He thought it would make the experiment more interesting,” he added, disgusted. “And I knew that if he wanted to claim you as some kind of sick project—” He hesitated. Looked away. Ran a hand through his hair. “I just knew I had to do something. I thought I could try to help. But now it’s gotten worse. Warner won’t stop talking about what you’re capable of or how valuable you are to his efforts and how excited he is to have you here. Everyone is beginning to notice. Warner is ruthless—he has no mercy for anyone. He loves the power, the thrill of destroying people. But he’s starting to crack, Juliette. He’s so desperate to have you . . . join him. And for all his threats, he doesn’t want to force you. He wants you to want it. To choose him, in a way.” He looked down, took a tight breath. “He’s losing his edge. And whenever I see his face I’m always about two inches away from doing something stupid. I’d love to break his jaw.”\u003c/p\u003e\n\u003cp\u003eYes. Warner is losing his edge.\u003c/p\u003e\n\u003cp\u003eHe’s paranoid, though with good reason. But then he’s patient and impatient with me. Excited and nervous all the time. He’s a walking oxymoron.\u003c/p\u003e\n\u003cp\u003eHe disables my cameras, but some nights he orders Adam to sleep outside my door to make sure I don’t escape. He says I can eat lunch alone, but always ends up summoning me to his side. The few hours Adam and I would’ve had together are stolen from us, but the fewer nights Adam is allowed to sleep inside my room I manage to spend huddled in his arms.\u003c/p\u003e\n\u003cp\u003eWe both sleep on the floor now, wrapped up in each other for warmth even with the blanket covering our bodies. Every time he touches me it’s like a burst of fire and electricity that ignites my bones in the most amazing way. It’s the kind of feeling I wish I could hold in my hand.\u003c/p\u003e\n\u003cp\u003eAdam tells me about new developments, whispers he’s heard around the other soldiers. He tells me how there are multiple headquarters across what’s left of the country. How Warner’s dad is at the capital, how he’s left his son in charge of this entire sector. He says Warner hates his father but loves the power. The destruction. The devastation. He strokes my hair and tells me stories and tucks me close like he’s afraid I’ll disappear. He paints pictures of people and places until I fall asleep, until I’m drowning in a drug of dreams to escape a world with no refuge, no relief, no release but his reassurances in my ear. Sleep is the only thing I look forward to these days. I can hardly remember why I used to scream.\u003c/p\u003e\n\u003cp\u003eThings are getting too comfortable and I’m beginning to panic.\u003c/p\u003e\n\u003cp\u003e“Put these on,” Warner says to me.\u003c/p\u003e\n\u003cp\u003eBreakfast in the blue room has become routine. I eat and don’t ask where the food comes from, whether or not the workers are being paid for what they do, how this building manages to sustain so many lives, pump so much water, or use so much electricity. I bide my time now. I cooperate.\u003c/p\u003e\n\u003cp\u003eWarner hasn’t asked me to touch him again, and I don’t offer.\u003c/p\u003e\n\u003cp\u003e“What are they for?” I eye the small pieces of fabric in his hands and feel a nervous twinge in my gut.\u003c/p\u003e\n\u003cp\u003eHe smiles a slow, sneaky smile. “An aptitude test.” He grabs my wrist and places the bundle in my hand. “I’ll turn around, just this once.”\u003c/p\u003e\n\u003cp\u003eI’m almost too nervous to be disgusted by him.\u003c/p\u003e\n\u003cp\u003eMy hands shake as I change into the outfit that turns out to be a tiny tank top and tinier shorts. I’m practically naked. I’m practically convulsing in fear of what this might mean. I clear my throat just the tiniest bit and Warner spins around.\u003c/p\u003e\n\u003cp\u003eHe takes too long to speak; his eyes are busy traveling the road map of my body. I want to rip up the carpet and sew it to my skin. He smiles and offers me his hand.\u003c/p\u003e\n\u003cp\u003eI’m granite and limestone and marbled glass. I don’t move.\u003c/p\u003e\n\u003cp\u003eHe drops his hand. He cocks his head. “Follow me.”\u003c/p\u003e\n\u003cp\u003eWarner opens the door. Adam is standing outside. He’s gotten so good at masking his emotions that I hardly register the look of shock that shifts in and out of his features. Nothing but the strain in his forehead, the tension in his temples, gives him away. He knows something’s not right. He actually turns his neck to take in my appearance. He blinks. “Sir?”\u003c/p\u003e\n\u003cp\u003e“Remain where you are, soldier. I’ll take it from here.”\u003c/p\u003e\n\u003cp\u003eAdam doesn’t answer doesn’t answer doesn’t answer— “Yes, sir,” he says, his voice suddenly hoarse.\u003c/p\u003e\n\u003cp\u003eI feel his eyes on me as I turn down the hall.\u003c/p\u003e\n\u003cp\u003eWarner takes me somewhere new. We’re walking through corridors I’ve never seen, blacker and bleaker and more narrow as we go. I realize we’re heading downward.\u003c/p\u003e\n\u003cp\u003eInto a basement.\u003c/p\u003e\n\u003cp\u003eWe pass through 1, 2, 4 metal doors. Soldiers everywhere, their eyes everywhere, appraising me with both fear and something else I’d rather not consider. I’ve realized there are very few females in this building.\u003c/p\u003e\n\u003cp\u003eIf there were ever a place to be grateful for being untouchable, it’d be here.\u003c/p\u003e\n\u003cp\u003eIt’s the only reason I have asylum from the preying eyes of hundreds of lonely men. It’s the only reason Adam is staying with me—because Warner thinks Adam is a cardboard cutout of vanilla regurgitations. He thinks Adam is a machine oiled by orders and demands. He thinks Adam is a reminder of my past, and he uses it to make me uncomfortable. He’d never imagine Adam could lay a finger on me.\u003c/p\u003e\n\u003cp\u003eNo one would. Everyone I meet is absolutely petrified.\u003c/p\u003e\n\u003cp\u003eThe darkness is like a black canvas punctured by a blunt knife, with beams of light peeking through. It reminds me too much of my old cell. My skin ripples with uncontrollable dread.\u003c/p\u003e\n\u003cp\u003eI’m surrounded by guns.\u003c/p\u003e\n\u003cp\u003e“In you go,” Warner says. I’m pushed into an empty room smelling faintly of mold. Someone hits a switch and fluorescent lights flicker on to reveal pasty yellow walls and carpet the color of dead grass. The door slams shut behind me.\u003c/p\u003e\n\u003cp\u003eThere’s nothing but cobwebs and a huge mirror in this room. The mirror is half the size of the wall. Instinctively I know Warner and his accomplices must be watching me. I just don’t know why.\u003c/p\u003e\n\u003cp\u003eThere are secrets everywhere.\u003c/p\u003e\n\u003cp\u003eThere are answers nowhere.\u003c/p\u003e\n\u003cp\u003eMechanical clinks/cracks/creaks and shifts shake the space I’m standing in. The ground rumbles to life. The ceiling trembles with the promise of chaos. Metal spikes are suddenly everywhere, scattered across the room, puncturing every surface at all different heights. Every few seconds they disappear only to reappear with a sudden jolt of terror, slicing through the air like needles.\u003c/p\u003e\n\u003cp\u003eI realize I’m standing in a torture chamber.\u003c/p\u003e\n\u003cp\u003eStatic and feedback from speakers older than my dying heart crackle to life. I’m a racehorse galloping toward a false finish line, breathing hard for someone else’s gain.\u003c/p\u003e\n\u003cp\u003e“Are you ready?” Warner’s amplified voice echoes around the room.\u003c/p\u003e\n\u003cp\u003e“What am I supposed to be ready for?” I yell into the empty space, certain that someone can hear me. I’m calm. I’m calm. I’m calm. I’m petrified.\u003c/p\u003e\n\u003cp\u003e“We had a deal, remember?” the room responds.\u003c/p\u003e\n\u003cp\u003e“Wha—”\u003c/p\u003e\n\u003cp\u003e“I disabled your cameras. Now it’s your turn to hold up your end of the bargain.”\u003c/p\u003e\n\u003cp\u003e“I won’t touch you!” I shout, spinning in place, terrified, horrified, worried I might faint at any moment.\u003c/p\u003e\n\u003cp\u003e“That’s all right,” he says. “I’m sending in my replacement.”\u003c/p\u003e\n\u003cp\u003eThe door squeals open and a toddler waddles in wearing nothing but a diaper. He’s blindfolded and hiccupping sobs, shuddering in fear.\u003c/p\u003e\n\u003cp\u003eOne pin pops my entire existence into nothing.\u003c/p\u003e\n\u003cp\u003e“If you don’t save him,” Warner’s words crackle through the room, “we won’t, either.”\u003c/p\u003e\n\u003cp\u003eThis child.\u003c/p\u003e\n\u003cp\u003eHe must have a mother a father someone who loves him this child this child this child stumbling forward in terror. He could be speared through by a metal stalagmite at any second.\u003c/p\u003e\n\u003cp\u003eSaving him is simple: I need to pick him up, find a safe spot of ground, and hold him in my arms until the experiment is over.\u003c/p\u003e\n\u003cp\u003eThere’s only one problem.\u003c/p\u003e\n\u003cp\u003eIf I touch him, he might die.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Five\u003c/p\u003e\n\u003cp\u003eWarner knows I don’t have a choice. He wants to force me into another situation where he can see the impact of my abilities, and he has no problem torturing an innocent child to get exactly what he wants.\u003c/p\u003e\n\u003cp\u003eRight now I have no options.\u003c/p\u003e\n\u003cp\u003eI have to take a chance before this little boy steps forward in the wrong direction.\u003c/p\u003e\n\u003cp\u003eI quickly memorize as much as I can of the traps and dodge/hop/narrowly avoid the spikes until I’m as close as possible.\u003c/p\u003e\n\u003cp\u003eI take a deep, shaky breath and focus on the shivering limbs of the boy in front of me and pray to God I’m making the right decision. I’m about to pull off my shirt to use as a barrier between us when I notice the slight vibration in the ground. The tremble that precedes the terror. I know I have half of a second before the spikes slice up through the air and even less time to react.\u003c/p\u003e\n\u003cp\u003eI yank him up and into my arms.\u003c/p\u003e\n\u003cp\u003eHis screams pierce through me like I’m being shot to death, one bullet for every second. He’s clawing at my arms, my chest, kicking my body as hard as he can, crying out in agony until the pain paralyzes him. He goes weak in my grip and I’m being ripped to pieces, my eyes, my bones, my veins all tumbling out of place, all turning on me to torture me forever with memories of the horrors I’m responsible for. \u003c/p\u003e","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-19.html","bookId":1771,"creation":"Oct 5, 2019 10:29:23 AM","modification":"Oct 5, 2019 10:29:23 AM"}
