{"id":73889,"no":25,"title":"Page 25","content":"\u003cp\u003eHis heart is racing so fast I can’t distinguish it from my own. It’s 5,000 degrees in the air between us. His fingers are at the dip right below my hip bone, teasing the small piece of fabric keeping me halfway decent. “Juliette . . .”\u003c/p\u003e\n\u003cp\u003e“Adam?”\u003c/p\u003e\n\u003cp\u003eMy neck snaps up in surprise. Fear. Anxiety. Adam stops moving, frozen in front of me. I’m not sure he’s breathing. I look around but can’t find a face to match the voice that called his name and begin to panic before Adam is slamming open the door, flying out before I hear it again.\u003c/p\u003e\n\u003cp\u003e“Adam . . . is that you?”\u003c/p\u003e\n\u003cp\u003eIt’s a boy.\u003c/p\u003e\n\u003cp\u003e“James!”\u003c/p\u003e\n\u003cp\u003eThe muffled sound of impact, 2 bodies colliding, 2 voices too happy to be dangerous.\u003c/p\u003e\n\u003cp\u003e“I can’t believe it’s really you! I mean, well, I thought it was you because I thought I heard something and at first I figured it was nothing but then I decided I should probably check just to be sure because what if it was you and—” He pauses. “Wait—what are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I’m home.” Adam laughs a little.\u003c/p\u003e\n\u003cp\u003e“Really?” James squeaks. “Are you home for good?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He sighs. “Damn it’s good to see you.”\u003c/p\u003e\n\u003cp\u003e“I missed you,” James says, suddenly quiet.\u003c/p\u003e\n\u003cp\u003eOne deep breath. “Me too, kid. Me too.”\u003c/p\u003e\n\u003cp\u003e“Hey, so, have you eaten anything? Benny just delivered my dinner package, and I could share some with y—”\u003c/p\u003e\n\u003cp\u003e“James?”\u003c/p\u003e\n\u003cp\u003eHe pauses. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“There’s someone I want you to meet.”\u003c/p\u003e\n\u003cp\u003eMy palms are sweaty. My heart is in my throat. I hear Adam walk back toward the tank and don’t realize he’s popped his head inside until he hits a switch. A faint emergency light illuminates the cabin. I blink a few times and see a young boy standing about 5 feet away, dirty-blond hair framing a round face with blue eyes that look too familiar. He’s pressed his lips together in concentration. He’s staring at me.\u003c/p\u003e\n\u003cp\u003eAdam is opening my door. He helps me to my feet, barely able to control the smile on his face and I’m stunned by the level of my own nervousness. I don’t know why I’m so nervous but God I’m nervous. This boy is obviously important to Adam. I don’t know why but I feel like this moment is important, too. I’m so worried I’m going to ruin everything. I try to fix the ripped folds of my dress, try to soften the wrinkles ironed into the fabric. I run haphazard fingers through my hair. It’s useless.\u003c/p\u003e\n\u003cp\u003eThe poor kid will be petrified.\u003c/p\u003e\n\u003cp\u003eAdam leads me forward. James is a handful of inches short of my height, but it’s obvious in his face that he’s young, unblemished, untouched by most of the world’s harsh realities. I want to revel in the beauty of his innocence.\u003c/p\u003e\n\u003cp\u003e“James? This is Juliette.” Adam glances at me.\u003c/p\u003e\n\u003cp\u003e“Juliette, this is my brother, James.”\u003c/p\u003e\n\u003cp\u003eChapter Thirty-One\u003c/p\u003e\n\u003cp\u003eHis brother.\u003c/p\u003e\n\u003cp\u003eI try to shake off the nerves. I try to smile at the boy studying my face, studying the pathetic pieces of fabric barely covering my body. How did I not know Adam had a brother? How could I have never known?\u003c/p\u003e\n\u003cp\u003eJames turns to Adam. “This is Juliette?”\u003c/p\u003e\n\u003cp\u003eI’m standing here like a lump of nonsense. I don’t remember my manners. “You know who I am?”\u003c/p\u003e\n\u003cp\u003eJames spins back in my direction. “Oh yeah. Adam talks about you a lot.”\u003c/p\u003e\n\u003cp\u003eI flush and can’t help but glance at Adam. He’s staring at a point on the floor. He clears his throat.\u003c/p\u003e\n\u003cp\u003e“It’s really nice to meet you,” I manage.\u003c/p\u003e\n\u003cp\u003eJames cocks his head. “So do you always dress like that?”\u003c/p\u003e\n\u003cp\u003eI’d like to die a little.\u003c/p\u003e\n\u003cp\u003e“Hey, kid,” Adam interrupts. “Juliette is going to be staying with us for a little while. Why don’t you go make sure you don’t have any underwear lying on the floor, huh?”\u003c/p\u003e\n\u003cp\u003eJames looks horrified. He darts into the darkness without another word.\u003c/p\u003e\n\u003cp\u003eIt’s quiet for so many seconds I lose count. I hear some kind of drip in the distance.\u003c/p\u003e\n\u003cp\u003eI take a deep breath. Bite my bottom lip. Try to find the right words. Fail. “I didn’t know you had a brother.”\u003c/p\u003e\n\u003cp\u003eAdam hesitates. “Is it okay . . . that I do? We’ll all be sharing the same space and I—”\u003c/p\u003e\n\u003cp\u003eMy stomach drops onto my knees. “Of course it’s okay! I just—I mean—are you sure it’s okay—for him? If I’m here?”\u003c/p\u003e\n\u003cp\u003e“There’s no underwear anywhere,” James announces, marching forward into the light. I wonder where he disappeared to, where the house is. He looks at me. “So you’re going to be staying with us?”\u003c/p\u003e\n\u003cp\u003eAdam intervenes. “Yeah. She’s going to crash with us for a bit.”\u003c/p\u003e\n\u003cp\u003eJames looks from me to Adam back to me again. He sticks out his hand. “Well, it’s nice to finally meet you.”\u003c/p\u003e\n\u003cp\u003eAll the color drains from my face. My heart is pounding in my ears. My knees are about to break. I can’t stop staring at his small hand outstretched, offered to me.\u003c/p\u003e\n\u003cp\u003e“James,” Adam says a little curtly.\u003c/p\u003e\n\u003cp\u003eJames starts laughing. “I was only kidding.” He drops his hand.\u003c/p\u003e\n\u003cp\u003e“What?” I can barely breathe. My head is spinning, confused.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” James says, still chuckling. “I won’t touch you. Adam told me all about your magical powers.” He rolls his eyes.\u003c/p\u003e\n\u003cp\u003e“Adam—told—he—what?”\u003c/p\u003e\n\u003cp\u003e“Hey, maybe we should go inside.” Adam clears his throat a little too loudly. “I’ll just grab our bags real quick—” And he jogs off toward the tank. I’m left staring at James. He doesn’t conceal his curiosity.\u003c/p\u003e\n\u003cp\u003e“How old are you?” he asks me.\u003c/p\u003e\n\u003cp\u003e“Seventeen.”\u003c/p\u003e\n\u003cp\u003eHe nods. “That’s what Adam said.”\u003c/p\u003e\n\u003cp\u003eI bristle. “What else did Adam tell you about me?”\u003c/p\u003e\n\u003cp\u003e“He said you don’t have parents, either. He said you’re like us.”\u003c/p\u003e\n\u003cp\u003eMy heart is a stick of butter, melting recklessly on a hot summer day. My voice softens. “How old are you?”\u003c/p\u003e\n\u003cp\u003e“I’ll be eleven next year.”\u003c/p\u003e\n\u003cp\u003eI grin. “So you’re ten years old?”\u003c/p\u003e\n\u003cp\u003eHe crosses his arms. Frowns. “I’ll be twelve in two years.”\u003c/p\u003e\n\u003cp\u003eI think I already love this kid.\u003c/p\u003e\n\u003cp\u003eThe cabin light shuts off and for a moment we’re immersed in absolute darkness. A soft click and a faint circular glow illuminates the view. Adam has a flashlight.\u003c/p\u003e\n\u003cp\u003e“Hey, James? Why don’t you lead the way for us?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir!” He skids to a halt in front of Adam’s feet, offers us an exaggerated salute, and runs off so quickly there’s no possible way to follow him. I can’t help the smile spreading across my face.\u003c/p\u003e\n\u003cp\u003eAdam’s hand slips into mine as we move forward. “You okay?”\u003c/p\u003e\n\u003cp\u003eI squeeze his fingers. “You told your ten-year-old brother about my magical powers?”\u003c/p\u003e\n\u003cp\u003eHe laughs. “I tell him a lot of things.”\u003c/p\u003e\n\u003cp\u003e“Adam?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Isn’t your house the first place Warner will go looking for you? Isn’t this dangerous?”\u003c/p\u003e\n\u003cp\u003e“It would be. But according to public records, I don’t have a home.”\u003c/p\u003e\n\u003cp\u003e“And your brother?”\u003c/p\u003e\n\u003cp\u003e“Would be Warner’s first target. It’s safer for him where I can watch over him. Warner knows I have a brother, he just doesn’t know where. And until he figures it out—which he will—we have to prepare.”\u003c/p\u003e\n\u003cp\u003e“To fight?”\u003c/p\u003e\n\u003cp\u003e“To fight back. Yeah.” Even in the dim light of this foreign space I can see the determination holding him together. It makes me want to sing.\u003c/p\u003e\n\u003cp\u003eI close my eyes. “Good.”\u003c/p\u003e\n\u003cp\u003e“What’s taking you so long?” James shouts in the distance.\u003c/p\u003e\n\u003cp\u003eAnd we’re off.\u003c/p\u003e\n\u003cp\u003eThe parking garage is located underneath an old abandoned office building buried in the shadows. A fire exit leads directly up to the main floor.\u003c/p\u003e\n\u003cp\u003eJames is so excited he’s jumping up and down the stairs, running forward a few steps only to run back to complain we’re not coming fast enough. Adam catches him from behind and lifts him off the floor. He laughs. “You’re going to break your neck.”\u003c/p\u003e\n\u003cp\u003eJames protests but only halfheartedly. He’s all too happy to have his brother back.\u003c/p\u003e\n\u003cp\u003eA sharp pang of some distant kind of emotion hits me in the heart. It hurts in a bittersweet way I can’t place. I feel oddly warm and numb at the same time.\u003c/p\u003e\n\u003cp\u003eAdam punches a pass code into a keypad by a massive steel door. There’s a soft click, a short beep, and he turns the handle.\u003c/p\u003e\n\u003cp\u003eI’m stunned by what I see inside.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Two\u003c/p\u003e\n\u003cp\u003eIt’s a full living room, open and plush. A thick rug, soft chairs, one sofa stretched across the wall. Green and red and orange hues, warm lamps softly lit in the large space. It feels more like a home than anything I’ve ever seen. The cold, lonely memories of my childhood can’t even compare. I feel so safe so suddenly it scares me.\u003c/p\u003e\n\u003cp\u003e“You like it?” Adam is grinning at me, amused no doubt by the look on my face. I manage to pick my jaw up off the floor.\u003c/p\u003e\n\u003cp\u003e“I love it,” I say, out loud or in my head I’m unsure.\u003c/p\u003e\n\u003cp\u003e“Adam did it,” James says, proud, puffing his chest out a little more than necessary. “He made it for me.”\u003c/p\u003e\n\u003cp\u003e“I didn’t make it,” Adam protests, chuckling. “I just . . . cleaned it up a bit.”\u003c/p\u003e\n\u003cp\u003e“You live here by yourself?” I ask James.\u003c/p\u003e\n\u003cp\u003eHe shoves his hands into his pockets and nods. “Benny stays with me a lot, but mostly I’m here alone. I’m lucky, though.”\u003c/p\u003e\n\u003cp\u003eAdam is dropping our bags onto the couch. He runs a hand through his hair and I watch as the muscles in his back flex, tight, pulled together. I watch as he exhales the tension from his body.\u003c/p\u003e\n\u003cp\u003eI know why, but I ask anyway. “Why are you lucky?”\u003c/p\u003e\n\u003cp\u003e“Because I have a visitor. None of the other kids have visitors.”\u003c/p\u003e\n\u003cp\u003e“There are other kids here?” I hope I don’t look as horrified as I feel.\u003c/p\u003e\n\u003cp\u003eJames is nodding so quickly his head is wobbling on his neck. “Oh yeah. This whole street. All the kids are here. I’m the only one with my own room, though.” He gestures around the space. “This is all mine because Adam got it for me. But everyone else has to share. We have school, sort of. And Benny brings me my food packages. Adam says I can play with the other kids but I can’t bring them inside.” He shrugs. “It’s okay.”\u003c/p\u003e\n\u003cp\u003eThe reality of what he’s saying spreads like poison in the pit of my stomach.\u003c/p\u003e\n\u003cp\u003eA street dedicated to orphaned children.\u003c/p\u003e\n\u003cp\u003eI wonder how their parents died. I don’t wonder for long.\u003c/p\u003e\n\u003cp\u003eI take inventory of the room and notice a tiny refrigerator and a tiny microwave perched on top, both nestled into a corner, see some cabinets set aside for storage. Adam brought as much stuff as he could—all sorts of canned food and nonperishable items. We both brought our toiletries and multiple sets of clothes. We packed enough to survive for at least a little while.\u003c/p\u003e\n\u003cp\u003eJames pulls a tinfoil package out of the fridge and sticks it in the microwave.\u003c/p\u003e\n\u003cp\u003e“Wait—James—don’t—” I try to stop him.\u003c/p\u003e\n\u003cp\u003eHis eyes are wide, frozen. “What?” \u003c/p\u003e","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-25.html","bookId":1771,"creation":"Oct 5, 2019 10:29:23 AM","modification":"Oct 5, 2019 10:29:23 AM"}
