{"id":73901,"no":37,"title":"Page 37","content":"\u003cp\u003eA moment of confusion. “Sir?”\u003c/p\u003e\n\u003cp\u003e“There’s someone I’d like for you to meet.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eBrendan and Castle step around the corner. Come into view. And I have to make a conscious effort to keep my jaw from unhinging. I can’t stop staring.\u003c/p\u003e\n\u003cp\u003eCastle’s companion is white from head to toe.\u003c/p\u003e\n\u003cp\u003eNot just his strange uniform, which is a blinding shade of shimmering white, but his skin is paler than mine. Even his hair is so blond it can only be accurately described as white. His eyes are mesmerizing. They’re the lightest shade of blue I’ve ever seen. Piercing. Practically transparent. He looks to be my age.\u003c/p\u003e\n\u003cp\u003eHe doesn’t seem real.\u003c/p\u003e\n\u003cp\u003e“Brendan, this is Juliette,” Castle introduces us. “She arrived just yesterday. I was giving her an overview of Omega Point.”\u003c/p\u003e\n\u003cp\u003eBrendan’s smile is so bright I nearly flinch. He sticks out his hand and I almost panic before he frowns. Pulls back, says, “Er, wait—sorry—,” and flexes his hands. Cracks his knuckles. A few sparks fly out of his fingers. I’m gaping at him.\u003c/p\u003e\n\u003cp\u003eHe shrinks back. Smiles a bit sheepishly. “Sometimes I electrocute people by accident.”\u003c/p\u003e\n\u003cp\u003eSomething in my heavy armor snaps off. Melts away. I feel suddenly understood. Unafraid of being myself. I can’t help my grin. “Don’t worry,” I tell him. “If I shake your hand I might kill you.”\u003c/p\u003e\n\u003cp\u003e“Blimey.” He blinks. Stares. Waits for me to take it back. “You’re serious?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003eHe laughs. “Right then. No touching.” Leans in. Lowers his voice. “I have a bit of a problem with that myself, you know. Girls are always talking about electricity in their romance, but none are too happy to actually be electrocuted, apparently. Bloody confusing, is what it is.” He shrugs.\u003c/p\u003e\n\u003cp\u003eMy smile is wider than the Pacific Ocean. My heart is so full of relief, comfort, acceptance. Adam was right. Maybe things can be okay. Maybe I don’t have to be a monster. Maybe I do have a choice.\u003c/p\u003e\n\u003cp\u003eI think I’m going to like it here.\u003c/p\u003e\n\u003cp\u003eBrendan winks. “It was very nice meeting you, Juliette. I’ll be seeing you?”\u003c/p\u003e\n\u003cp\u003eI nod. “I think so.”\u003c/p\u003e\n\u003cp\u003e“Brilliant.” He shoots me another smile. Turns to Castle. “I’ll let you know if I hear anything, sir.”\u003c/p\u003e\n\u003cp\u003e“Perfect.”\u003c/p\u003e\n\u003cp\u003eAnd Brendan disappears.\u003c/p\u003e\n\u003cp\u003eI turn to the glass wall keeping me from the other half of my heart. Press my head against the cool surface. Wish he would wake up.\u003c/p\u003e\n\u003cp\u003e“Would you like to say hello?”\u003c/p\u003e\n\u003cp\u003eI look up at Castle, who is still studying me. Always analyzing me. Somehow his attention doesn’t make me uncomfortable. “Yes,” I tell him. “I want to say hello.”\u003c/p\u003e\n\u003cp\u003eChapter Forty-Eight\u003c/p\u003e\n\u003cp\u003eCastle uses the key in his hand to open the door.\u003c/p\u003e\n\u003cp\u003e“Why does the medical wing have to be locked?” I ask him.\u003c/p\u003e\n\u003cp\u003eHe turns to me. He’s not very tall, I realize for the first time. “If you’d known where to find him—would you have waited patiently behind this door?”\u003c/p\u003e\n\u003cp\u003eI drop my eyes. Don’t answer. Hope I’m not blushing.\u003c/p\u003e\n\u003cp\u003eHe tries to be encouraging. “Healing is a delicate process. It can’t be interrupted or influenced by erratic emotions. We’re lucky enough to have two healers among us—a set of twins, in fact. But most fascinating is that they each focus on a different element—one on the physical incapacitations, and one on the mental. Both facets must be addressed, otherwise the healing will be incomplete, weak, insufficient.” He turns the door handle. “But I think it’s safe for Adam to see you now.”\u003c/p\u003e\n\u003cp\u003eI step inside and my senses are almost immediately assaulted by the scent of jasmine. I search the space for the flowers but find none. I wonder if it’s a perfume. It’s intoxicating.\u003c/p\u003e\n\u003cp\u003e“I’ll be just outside,” Castle says to me.\u003c/p\u003e\n\u003cp\u003eThe room is filled with a long row of beds, simply made. All 20 or so of them are empty except for Adam’s. There’s a door at the end of the room that probably leads to another space, but I’m too nervous to be curious right now.\u003c/p\u003e\n\u003cp\u003eI pull up an extra chair and try to be as quiet as possible. I don’t want to wake him, I just want to know he’s okay. I clasp and unclasp my hands. I’m too aware of my racing heart. And I know I probably shouldn’t touch him, but I can’t help myself. I cover his hand with mine. His fingers are warm.\u003c/p\u003e\n\u003cp\u003eHis eyes flutter for just a moment. They don’t open. He takes a sudden breath and I freeze.\u003c/p\u003e\n\u003cp\u003eI almost collapse into tears.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003eMy neck snaps at the sound of Castle’s panicked voice.\u003c/p\u003e\n\u003cp\u003eI drop Adam’s hand. Push away from the bed, eyes wide, worried. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Why are you—you just—you can touch him—?” I never thought I’d see Castle so confused, so perplexed. He’s lost his composure, one arm half extended in an effort to stop me.\u003c/p\u003e\n\u003cp\u003e“Of course I can tou—” I stop. Try to stay calm. “Kenji didn’t tell you?”\u003c/p\u003e\n\u003cp\u003e“This young man has immunity from your touch?” Castle’s words are whispered, astonished.\u003c/p\u003e\n\u003cp\u003e“Yes.” I look from him to Adam, still sound asleep. So does Warner.\u003c/p\u003e\n\u003cp\u003e“That’s . . . astounding.”\u003c/p\u003e\n\u003cp\u003e“Is it?”\u003c/p\u003e\n\u003cp\u003e“Very.” Castle’s eyes are bright, so eager. “It certainly isn’t coincidence. There is no coincidence in these kinds of situations.” He pauses. Paces. “Fascinating. So many possibilities—so many theories—” He’s not even talking to me anymore. His mind is working too quickly for me to keep up. He takes a deep breath. Seems to remember I’m still in the room. “My apologies. Please, carry on. The girls will be out soon—they’re assisting James at the moment. I must report this new information as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Wait—”\u003c/p\u003e\n\u003cp\u003eHe looks up. “Yes?”\u003c/p\u003e\n\u003cp\u003e“You have theories?” I ask him. “You—you know why these things are happening . . . to me?”\u003c/p\u003e\n\u003cp\u003e“You mean to us?” Castle offers me a gentle smile.\u003c/p\u003e\n\u003cp\u003eI try not to blush. I manage to nod.\u003c/p\u003e\n\u003cp\u003e“We have been doing extensive research for years,” he says. “We think we have a pretty good idea.”\u003c/p\u003e\n\u003cp\u003e“And?” I can hardly breathe.\u003c/p\u003e\n\u003cp\u003e“If you should decide to stay at Omega Point, we’ll have that conversation very soon, I promise. Besides, I’m sure now is probably not the best time.” He nods at Adam.\u003c/p\u003e\n\u003cp\u003e“Oh.” I feel my cheeks burn. “Of course.”\u003c/p\u003e\n\u003cp\u003eCastle turns to leave.\u003c/p\u003e\n\u003cp\u003e“But do you think that Adam—” The words tumble out of my mouth too quickly. I try to pace myself. “Do you think he’s . . . like us, too?”\u003c/p\u003e\n\u003cp\u003eCastle pivots back around. Studies my eyes. “I think,” he says carefully, “that it is entirely possible.”\u003c/p\u003e\n\u003cp\u003eI gasp.\u003c/p\u003e\n\u003cp\u003e“My apologies,” he says, “but I really must get going. And I wouldn’t want to interrupt your time together.”\u003c/p\u003e\n\u003cp\u003eI want to say yes, sure, of course, absolutely. I want to smile and wave and tell him it’s no problem. But I have so many questions, I think I might explode; I want him to tell me everything he knows.\u003c/p\u003e\n\u003cp\u003e“I know this is a lot of information to take in at once.” Castle pauses at the door. “But we’ll have plenty of opportunities to talk. You must be exhausted and I’m sure you’d like to get some sleep. The girls will take care of you—they’re expecting you. In fact, they’ll be your new roommates at Omega Point. I’m sure they’ll be happy to answer any questions you might have.” He clasps my shoulders before he goes. “It’s an honor to have you with us, Ms. Ferrars. I hope you will seriously consider joining us on a permanent basis.”\u003c/p\u003e\n\u003cp\u003eI nod, numb.\u003c/p\u003e\n\u003cp\u003eAnd he’s gone.\u003c/p\u003e\n\u003cp\u003eWe have been doing extensive research for years, he said. We think we have a pretty good idea, he said. We’ll have that conversation very soon, I promise.\u003c/p\u003e\n\u003cp\u003eFor the first time in my life I might finally understand what I am and it doesn’t seem possible. And Adam. Adam. I shake myself and take my seat next to him. Squeeze his fingers. Castle could be wrong. Maybe this is all coincidence.\u003c/p\u003e\n\u003cp\u003eI have to focus.\u003c/p\u003e\n\u003cp\u003eI wonder if anyone has heard from Warner lately.\u003c/p\u003e\n\u003cp\u003e“Juliette?”\u003c/p\u003e\n\u003cp\u003eHis eyes are half open. He’s staring at me like he’s not sure if I’m real.\u003c/p\u003e\n\u003cp\u003e“Adam!” I have to force myself to be still.\u003c/p\u003e\n\u003cp\u003eHe smiles and the effort seems to exhaust him. “God it’s good to see you.”\u003c/p\u003e\n\u003cp\u003e“You’re okay.” I grip his hand, resist pulling him into my arms. “You’re really okay.”\u003c/p\u003e\n\u003cp\u003eHis grin gets bigger. “I’m so tired. I feel like I could sleep for a few years.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry, the sedative will wear off soon.”\u003c/p\u003e\n\u003cp\u003eI spin around. Two girls with exactly the same green eyes are staring at us. They smile at the same time. Their long brown hair is thick and stick-straight in high ponytails on their heads. They’re wearing matching silver bodysuits. Gold ballet flats.\u003c/p\u003e\n\u003cp\u003e“I’m Sonya,” the girl on the left says.\u003c/p\u003e\n\u003cp\u003e“I’m Sara,” her sister adds.\u003c/p\u003e\n\u003cp\u003eI have no idea how to tell them apart.\u003c/p\u003e\n\u003cp\u003e“It’s so nice to meet you,” they say at exactly the same time.\u003c/p\u003e\n\u003cp\u003e“I’m Juliette,” I manage. “It’s a pleasure to meet you, too.”\u003c/p\u003e\n\u003cp\u003e“Adam is almost ready for release,” one says to me.\u003c/p\u003e\n\u003cp\u003e“Sonya is an excellent healer,” the other one chimes in.\u003c/p\u003e\n\u003cp\u003e“Sara is better than I am,” says the first.\u003c/p\u003e\n\u003cp\u003e“He should be okay to leave just as soon as the sedative is out of his system,” they say together, smiling.\u003c/p\u003e\n\u003cp\u003e“Oh—that’s great—thank you so much—” I don’t know who to look at. Who to answer. I glance back at Adam. He seems thoroughly amused.\u003c/p\u003e\n\u003cp\u003e“Where’s James?” he asks.\u003c/p\u003e\n\u003cp\u003e“He’s playing with the other children.” I think it’s Sara who says it.\u003c/p\u003e\n\u003cp\u003e“We just took him on a bathroom break,” says the other.\u003c/p\u003e\n\u003cp\u003e“Would you like to see him?” Back to Sara.\u003c/p\u003e\n\u003cp\u003e“There are other children?” My eyes are as wide as my face.\u003c/p\u003e\n\u003cp\u003eThe girls nod at the same time.\u003c/p\u003e\n\u003cp\u003e“We’ll go get him,” they chorus. And disappear.\u003c/p\u003e\n\u003cp\u003e“They seem nice,” Adam says after a moment.\u003c/p\u003e\n\u003cp\u003e“Yeah. They do.” This whole place seems nice.\u003c/p\u003e\n\u003cp\u003eSonya and Sara come back with James, who seems happier than I’ve ever seen him, almost happier than seeing Adam for the first time. He’s thrilled to be here. Thrilled to be with the other kids, thrilled to be with “the pretty girls who take care of me because they’re so nice and there’s so much food and they gave me chocolate, Adam—have you ever tasted chocolate?” and he has a big bed and tomorrow he’s going to class with the other kids and he’s already excited.\u003c/p\u003e\n\u003cp\u003e“I’m so happy you’re awake,” he says to Adam, practically jumping up and down on his bed. “They said you got sick and that you were resting and now you’re awake so that means you’re better, right? And we’re safe? I don’t really remember what happened on our way here,” he admits, a little embarrassed. “I think I fell asleep.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-37.html","bookId":1771,"creation":"Oct 5, 2019 10:29:23 AM","modification":"Oct 5, 2019 10:29:23 AM"}
