{"id":8459,"no":10,"title":"CHAPTER VIII FRANK LOOKS FOR WORK","content":"\u0026nbsp;When Frank arrived home he found that his father had been given all the particulars of the conflagration by the other members of the family and by several neighbors who had dropped in to tell him the news and sympathize with him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The exact origin of the fire was a mystery, but it was generally accepted as being due to the Fourth of July celebration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you are insured, father,” said Frank, after the last of the neighbors had departed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am insured, Frank, but I have forgotten the exact amount,” was the reply. “I want you to look over the papers for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The papers call for twenty-five hundred dollars on stock and two hundred dollars on fixtures,” said our hero, after a careful reading of the insurance papers, three in number.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am fully covered. The stock on hand did not amount to over eighteen hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then for stock and fixtures you ought to get two thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—if I can make the insurance companies toe the mark.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is more than you would have gotten from Mr. Benning or Mr. Peterson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Frank; I doubt if they would have given me over twelve hundred dollars—perhaps not over a thousand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case—if you can make the insurance companies pay up—the fire won’t have been such a bad happening after all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it will be quite a good thing for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Early on the following morning two insurance men put in an appearance, and surveyed the ruins carefully. Nothing had been saved of Mr. Hardy’s belongings, even the safe being rendered absolutely worthless by the intense heat. After looking around, the insurance men called upon the sufferer at his home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mr. Hardy, you seem to be suffering in more ways than one,” said one of the men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true, Mr. Lane. The town celebrated yesterday at my expense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should say at our expense,” put in the second insurance man, with a grim smile. “We are the ones to foot the bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I am glad, Mr. Watson, that the loss does not fall on me, for it would ruin me utterly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you figure your loss at?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been looking over the accounts with my son, Frank, who has been running the store lately, and we figure the stock at eighteen hundred and forty dollars, and the fixtures at the figure in the papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you claim two thousand and forty dollars?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t that fair?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you let us go over the stock sheet with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was done, and at the end of an hour the insurance men said they would recommend that the company pay Mr. Hardy nineteen hundred dollars in full for his claims. As this was not such a big cut as he had feared, Frank’s father said he would accept the amount if the sum was forthcoming inside of thirty days.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure I have made a good bargain with the insurance people,” said Mr. Hardy to his wife, when they were alone. “I have done much better than if I had sold out to any of my rivals.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and the best of it is, you are now under no obligations to your rivals,” returned Mrs. Hardy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not get exactly what I think the stock was worth, but one cannot expect to get that when one is burnt out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you do, Thomas, when they pay the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Settle the Garrison matter first of all, and then put the balance of the money in the bank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And after that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have to get well before I make up my mind. I can do nothing so long as I am tied down to the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With the store burnt out, Frank scarcely knew what to do with himself. When the débris was cleared away by the owner of the property, he went around to hunt for anything of value, but nothing was forthcoming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank was very thoughtful when he came home the following Saturday. He chopped a big pile of wood, and cleaned up the garden and the cellar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going to find something to do next week,” he told his mother. “With father laid up and the store gone, it won’t do for me to remain idle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid you’ll not find it easy to get a position in Claster,” answered Mrs. Hardy, as she placed an affectionate hand on his shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was thinking of looking for a place in Philadelphia, mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What, away from home!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got to strike out for myself some day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I hadn’t thought of your leaving home yet, Frank,” his mother went on, in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’ll look around in Claster first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you would, and in Porthaven, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank was enthusiastic about doing something, and that very Saturday night he asked half a dozen persons he knew for a situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But as his mother had intimated, it was next to impossible to find an opening. Only at one store was anything offered, and the pay there was but two dollars a week.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot afford to work for such an amount, Mr. Grimes,” said Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, that’s all I am willing to pay,” returned the storekeeper. “Plenty of boys would jump at the chance. I thought I’d give you a trial on your father’s account.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, but I’ll look further.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Early Monday morning Frank went to Porthaven. As he did not want to pay the stage fare, which was twenty cents each way, he determined to walk the distance. But he was scarcely out of town when a boy in a grocery wagon came up behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hullo, Frank!” called out the boy. “If you are going my way, jump in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am bound for Porthaven, Joe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So am I. Glad I met you,” replied Joe Franklin, who worked for a local grocer. “I hate to travel such a distance all alone. Where are you going?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to look for work,” answered Frank, as he took a seat beside the grocer’s boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t you get anything to do in Claster?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, one job. Mr. Grimes wants me to work for him for two dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you work for him, Frank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t intend to. I must earn more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Old Grimes is the hardest man in town to get along with. All of his clerks are in hot water with him every day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Wilkins must pay you more than two dollars, Joe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He pays me three and a half, and I am to have four after New Year’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is something like. But I want to earn even more—if I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you’ve got to do it, now your dad is out of work and laid up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody told my dad you folks had lost a lot of money on some rascal in Philadelphia.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is true, and that’s all the more reason I want to earn something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t your father get anything out of the railroad company for the accident?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I trust so. But it is pretty hard to fight a big railroad company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will your father start in the feed business again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think so. Still, he doesn’t know what he will do. He wants to get well first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the talk ran until the outskirts of Porthaven were reached. Then Frank left the wagon and thanked his comrade for the ride.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When are you going back?” asked Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going back in half an hour. You can ride with me if you will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Joe, but I guess I’ll have to stay a little longer,” answered Frank; and then the two boys separated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Porthaven was a town considerably larger than Claster and consequently Frank had a great many more stores and offices to visit. But his quest for employment here was even less encouraging than at home. Not a single opening of any kind presented itself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is certainly hard luck,” he thought, as he found himself at the end of the main street. “I did think there would be at least one opening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had brought a lunch with him, and now walked down to the edge of the small river which ran through Porthaven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At a beautiful spot bordering the river somebody had placed a bench, and here he sat down to enjoy the sandwiches and piece of pie his mother had thoughtfully provided for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank’s appetite, like that of most growing boys, was good, and it did not take him long to dispose of his meal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wish I had another sandwich,” he thought, after it was gone. “Tramping around gives one a very hungry feeling, especially if he doesn’t get any work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not knowing what to do next, Frank remained where he was, and presently a young man, carrying a small, square hand-bag of black leather, came strolling towards him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you tell me how much further it is to Porthaven?” the young man asked, as he came to a halt, and rested his bag on the end of the bench.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are on the outskirts of the town, now,” was our hero’s reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good! I was afraid I had still a mile or so to go. I missed the stage from River Bend, and I did not want to waste the time, so I walked over. It’s pretty hot, isn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.” And now Frank made room so the stranger could sit down, which he did.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you acquainted in Porthaven?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pretty well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then perhaps you won’t mind telling me where some of these folks live,” and the young man brought out a notebook from his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you what I know willingly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Live around here, I suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I come from Claster. I’m looking for work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” The young man gazed at Frank curiously. “Hard job, isn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Struck anything yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can sympathize with you. I was out looking for work, myself, last summer, and I couldn’t get a single thing that was worth anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you are working now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, yes; but I haven’t got anything steady. I’m a book agent, and I get paid for what orders I get, that’s all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3013/83264.html","bookId":278,"creation":"Aug 1, 2019 8:33:51 AM","modification":"Aug 1, 2019 8:33:51 AM"}
