{"id":8460,"no":11,"title":"CHAPTER IX FRANK MEETS A BOOK AGENT","content":"\u0026nbsp;“So you are a book agent?” said Frank, and now looked at the young man with increased interest. “May I ask what books you sell?” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am taking orders for three works—a new and beautifully illustrated set of Cooper’s works, an Illustrated History of the United States, and a new cook-book. Here are some samples,” and the young man brought them forth from his bag.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They certainly look very fine,” answered Frank, after inspecting the volumes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I can sell you a set of the Cooper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you; I can’t afford them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or a cook-book for your wife,” and the book agent laughed. “Get her a cook-book and she won’t kill you off when she cooks for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have to get the wife first—and means to support her,” and now Frank laughed, too. “May I ask if there is much money in selling books? If I can’t get a steady job I might take it up,” he went on, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Selling books is a great speculation, my friend. You might make fifty dollars a week at it, and you might not make a dollar. It all depends on what you have to sell, what territory you cover, and what your abilities as a salesman are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that must be true. But, somehow, I think I could sell books, if I had the right kind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Many think they can do the same, but out of a hundred who try, not a dozen succeed. It’s very discouraging at the start. To make a success you’ve got to have lots of ‘stick-to-it’ in you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I ask what firm you represent? Or, perhaps you don’t care to tell?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I’m perfectly willing to tell you, and if you want to try your luck with them go ahead. My name is Oscar Klemner, and I represent the Barry Marden Publishing Company, of Philadelphia—one of the largest publishing houses in the subscription book business. Here is their card,” and Oscar Klemner handed it over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you. My name is Frank Hardy, and I come from Claster.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Glad to know you, Hardy, and if you take up books I hope you make a big success of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you tell me how they pay for the work?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly. An agent gets twenty per cent. for getting an order, and twenty per cent. more if he delivers and collects.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you do both?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sometimes; but at other times I merely take orders, and when I can’t get orders I take to delivering the orders some fellow more lucky than myself has obtained.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You wanted me to tell you about some folks here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. Here is a list of names. I want to visit the people in regular order, according to where they live, if I can. I don’t want to waste my time skipping from one end of the town to the other and back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank looked over the list carefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know all these people, and if you wish it, I’ll go around with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won’t it be too much trouble?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. And besides, it will give me a little insight into the business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, then. Come ahead, Hardy. I’ll give you a practical lesson in both the art of delivering books and in taking new orders. You see, some of these people have merely asked about the books, not ordered them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Having rested himself, Oscar Klemner said he was ready to start, and Frank offered to carry the leather hand-bag for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind; I’ll carry it myself. I’m so used to it, I’d feel lost without it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were soon at the first house, where the book agent delivered a cook-book and collected three dollars for it. The transaction was quickly over, and they passed on to the next place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was certainly a quick way to make sixty cents,” thought our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We don’t always have it so easy,” said the agent, as if reading what was in Frank’s mind. “Sometimes folks won’t take the books they have ordered.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you do then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It depends. If it’s a written order, we show it, and demand that it be honored.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next place to stop at was one where a minister had written that he wished to look at the illustrated history. The book agent showed the history and dilated eloquently on its worth and cheapness, but the man of the church refused to order just then, although he said he might do so later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was a disappointment,” said Frank, as they hurried off, after half an hour had been wasted in the effort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you’ll get used to them, if you ever get into this business,” answered Oscar Klemner, cheerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank remained with the agent until dark, visiting twelve homes and three places of business. He took note of the fact that Oscar Klemner collected eight dollars, and took orders for twenty-eight dollars’ worth of books. This made thirty-six dollars in all, upon which the agent’s commission, at twenty per cent., was $7.20.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is certainly a good day’s wages,” thought our hero. “I’d like to do half as well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you like it?” asked the book agent, when the work was over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I like it first-rate,” answered Frank. “I’m going to try it, if they’ll let me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you do, I wish you luck. But I wouldn’t work around here. Our men have been through this territory pretty thoroughly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On parting with Frank, Oscar Klemner offered our hero a fifty-cent piece.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve earned it,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want the money. I am glad I got the experience,” said Frank, and refused to accept the coin. Soon they parted; and it was many a day before our hero saw Oscar Klemner again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank did not relish the walk back to Claster, after his tramp all over Porthaven. But there seemed no help for it, and he struck out as swiftly as his tired limbs would permit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I’m going to be a book agent, I may as well get used to walking first as last,” he told himself. Yet, when a lumber wagon bound for Claster came along, he was glad enough to hop up beside the driver and ride the last half of the journey. Even then, it was nearly ten o’clock when he got to his home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you’ve had no luck, Frank?” said Mrs. Hardy. “I am sorry for you. Have you had any supper?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, mother. But don’t worry; I’ll find a couple of slices of bread or so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is some tea on the stove, and some beans and rice pudding in the pantry, and some cake and berries. You must be very hungry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got a plan,” said Frank, when he was eating. “I’ll tell you about it in the morning. It’s too late now.” And as soon as he had satisfied his hunger he went to bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When our hero told his father and his mother of his plan, on the following morning, both were much surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A book agent!” cried Mr. Hardy. “I don’t think they earn their salt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Father, you are mistaken,” Frank answered, and then told of his experience of the day previous. Both of his parents listened with keen interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That agent must be a remarkable man to earn so much,” said Mrs. Hardy. “I knew a man here who tried it once, old Randolph Winter. He earned only a few dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess he wasn’t cut out for an agent,” answered Frank, who knew the man mentioned to be very lazy and shiftless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And so you think you are cut out for an agent, Frank?” demanded his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I wouldn’t say that. But I thought it might be worth trying—more especially as I can’t get anything else to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it won’t do any harm to try. But don’t fill your head with any false hopes, for you may be sadly disappointed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I try it, I’ll make up my mind to do my level best, and then take what comes. But I’d like to go to Philadelphia and see those book publishers first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; I’ll give you the necessary money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While Frank was talking the matter over with his parents, Ruth came in with several letters, and a big package from the post office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here are some books for Frank!” she called out. “And a letter, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The package is from Mr. Philip Vincent, the gentleman whose spectacles I picked up at the wreck,” said Frank. “And one of the letters is from him, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does he say, Frank?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll read his letter out loud, mother,” answered our hero, and proceeded to do so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My Dear Young Friend [so ran the communication]: I must ask you to pardon me for the delay in sending you the story book I promised. The fact of the matter is, I had a sudden call to Chicago on business, and just arrived in New York again yesterday.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By this same mail I send you two illustrated story books, which I trust will please you in every way. Later on I shall send you a new book I am about to issue, called the Illustrated Lives of Our Presidents, which should prove an inspiration to all young Americans like yourself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you ever come to New York, I shall be glad to see you.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yours very truly,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Philip Vincent”.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What beautiful books!” cried Ruth, as she and Frank looked them over. “I’m sure they’ll be interesting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hullo! I’ve made a discovery!” ejaculated Frank, who was reading the printed matter at the head of the letter sheet. “Mr. Vincent is in the subscription book business besides running a book store.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If that is so, you had better apply to him for a position,” put in his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know but what I will, father. But it might look forward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if you explained matters. Tell him how you met that young fellow, and how you were on the point of applying to that Philadelphia house for an opening when his books and the letter came.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right; I’ll do it, and at once.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3013/83265.html","bookId":278,"creation":"Aug 1, 2019 8:33:53 AM","modification":"Aug 1, 2019 8:33:53 AM"}
