{"id":8462,"no":13,"title":"CHAPTER XI FRANK AS AN AGENT","content":"\u0026nbsp;Frank remained with Mr. Philip Vincent the best part of half an hour, and then excused himself, for he realized that the book publisher’s time was valuable. After the interview he was introduced to a clerk, who gave him his samples with the case, and also the pamphlet on selling, order blanks, and circulars advertising the books. The clerk also went over the volumes with our hero, pointing out the good points and the best illustrations. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t be discouraged if you don’t get an order the first day you are out,” said the clerk, on parting. “One of our best agents was out two days before he received an order.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll give it a week’s trial and stick to it like a bulldog to a man’s leg,” answered Frank, and this raised a laugh, in which he joined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now he was in New York, Frank could not resist the temptation to look around a little. Saying he would call for his sample case later, he left Mr. Vincent’s store and strolled up Nassau Street until he reached City Hall Park, and crossing the Park back of the post office, came out on Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “New York is certainly a busy place,” was his mental comment, as he gazed at the crowds of people, and the broad highway filled with trucks and surface cars. “It’s a regular bee-hive for business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Having ample time to spare, he determined to ride uptown as far as Forty-second Street and take a look at the shops and the Grand Central Depot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was soon on the car, and took a seat near the front door. Scarcely had he got settled when the door opened and a tall, slab-sided individual, on whose calculating features “Yankee” was plainly written, stepped into the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Extry fine day this is,” he remarked to Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It certainly is,” was our hero’s polite reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Been a fine summer right along.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment the conductor came up and Frank handed him a nickel, which was promptly rung up on the register.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fare, please?” said the conductor to the down-east countryman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much’ll it be?” asked the individual addressed, as he pulled out his wallet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five cents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five cents! Why, that’s what you charge fer going the hull trip, don’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you carry a feller five miles fer five cents?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We do,” and now the conductor, a bright young man, began to smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s just a cent a mile. Well, now, I ain’t going but a mile—little short if anything. Thet’ll be just a cent. Here’s the copper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So speaking, the countryman drew out a dingy copper cent which had evidently been stored away for some years. He tried to pass it over, but the conductor shook his head, while several began to laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter, mister?” asked the individual from down east.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t take that, Mr. Smith. Our charge is five cents without regard to distance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gee shoo! Say, my name ain’t Smith. It’s Perkins—Joel Perkins.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Mr. Perkins. We charge five cents no matter how far you go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And do you count that fair?” demanded Joel Perkins. “I’d like to argy the p’int a little with you. Just supposin’ you was a trader an’ kept flour to sell, and I and another man came to buy flour. Now, if I took one barrel and tudder man took five would you think it fair to charge me jest as much as the other man; come now, answer me fair and square?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t stop to argue,” answered the conductor, who was in a hurry to collect other fares. “Just you pay your five cents, or I’ll call the police.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gee shoo! I don’t want no police, nohow!” cried Joel Perkins, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then pay up, and do it right away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here’s your money,” groaned the countryman, and passed over five cents. “But it’s a swindle just the same,” he added defiantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank had been much amused, and it was all he could do to keep from laughing outright. “I’m glad I’m not so jolly green as all that,” he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bound to get your money away from you somehow,” remarked the countryman to him, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know how you can get square,” answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How’s thet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ride your five miles, and more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By gosh! Thet’s an idee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can ride more than five miles if you wish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but if I go too far, I’ll have to pay another five cents to git back, won’t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I ain’t goin’ to do it,” answered Joel Perkins. “Where be you a-going?” he asked, after another pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going up to the Grand Central Depot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thet’s where I cum in yesterday. I’m from Stoneville, Vermont. Ever been up that way?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “’Tain’t much of a place. Squire Rasperwick owns almost the hull of it. His daughter is engaged to marry my nephew, Joe Swallowtail.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I come down to the city to buy my nephew something nice fer the wedding. But they ask a pile fer nice things down here. I priced a rug an’ they wanted twenty-eight dollars fer it. ‘Say, mister,’ sez I, ‘I don’t want the hull dozen, I only want one.’ And then he told me to git out o’ the shop.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you’ll find a cheaper rug somewhere else?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sumbuddy told me to go to the Bowery, but I ain’t going. I know a feller that went there onct, an’ he got drugged an’ robbed o’ nine dollars and thirty-four cents. They ain’t going to rob me, not much they ain’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you belong in New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I come from New Jersey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gosh! Ain’t you afraid to travel around here alone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you work here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you work?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to start out to-morrow as a book agent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gee shoo! A book agent. I thought most o’ them fellers was swindlers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do I look like a swindler?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t say as you do, but a feller has to be careful. Wot books do you sell?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As well as he was able, Frank described the various volumes to Joel Perkins. The countryman grew very much interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like to see thet family doctor book, an’ the cattle book,” he remarked. “Perhaps they would make good wedding presents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You certainly ought to have those books on the farm,” returned Frank, quickly, and then, seized with a sudden idea, he went on: “Why not come back with me and let me show you the books? It won’t cost you a cent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But we’ve got to ride back, ain’t we?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I’ll pay your fare. I know you’ll think the books a bargain when you see them. Every family ought to have a good doctor’s book, and every farmer ought to have a good cattle book.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has thet doctor’s book got in it about rheumatism and liver trouble?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To be sure it has.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And does the cattle book tell about sheep and sech?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; and both books have hundreds of pictures, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll look at ’em, an’ if they are good fer anything, I’ll buy ’em,” concluded Joel Perkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank at once stopped the car and he and the countryman alighted. Then a car going in the other direction was hailed, and both got on board, and Frank paid the fare as he had agreed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must be rich?” remarked the countryman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Mr. Perkins; if I was I wouldn’t be selling books for a living.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose thet’s so. You look like a smart, clever boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I like to see a feller strikin’ out fer himself. It shows he’s got backbone in him. Now, I had to strike out fer myself when I was twelve years old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it possible?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Worked on old Jed Scudder’s farm fer a dollar a month an’ found—and Jed didn’t find me none too good nuther. Sometimes I didn’t git half enough to eat. But I watched my chances an’ saved every cent, an’ now I got a farm o’ my own.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure you deserve it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do. I work hard yet—gitting up at five every morning, winter an’ summer, and milkin’ twelve to sixteen keows.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the talk ran on until the post office was reached, when both left the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, if you will wait here a minute, I’ll get my case of books,” said Frank. “I left them in a store a short distance away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wot place is this?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is the New York post office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thought it might be, but I wasn’t sure. It’s about the biggest post office I ever see. Wonder if there’s a letter fer me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can easily find out, Mr. Perkins. Wait till I find the proper window for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t a feller go to any winder?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To hum, there ain’t but one winder. The post office is in Si Hopper’s grocery store,” and Joel Perkins chuckled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank found the proper window of the General Delivery, and leaving the countryman to ask for letters, he ran off down Nassau Street to get his case of sample goods.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he got back he found Joel Perkins reading a letter he had received from one of his daughters. He was greatly pleased over the communication, and doubly pleased to think it had reached him through such a big establishment as the New York post office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It beats all how they kin keep track o’ a feller,” he remarked. “I didn’t no more than ask fer a letter than the fellow inside handed it over. He seemed to be a-waiting fer me to call.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Having finished his letter, Joel Perkins looked at the two books which Frank had brought forth for his inspection. Frank showed him the most important illustrations, and pointed out the chapters on rheumatism in one volume, and the chapters on sheep and their diseases in the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wot about liver complaints?” questioned the countryman. “I allow as how there’s some o’ thet in our family.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is a whole chapter on liver troubles, with eight pictures of the liver,” answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Putty good books, ain’t they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. If you buy them you’ll never regret it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And how much did you say they were?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Six dollars for the two. They ought to bring five dollars each, but the publishers want to make them popular, so they put the price at three dollars per volume.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, I’ll take ’em.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mr. Perkins. If you’ll come with me I’ll get you two copies that have never been handled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I want brand-new ones—in case I give ’em to my nephew. But maybe I’ll keep ’em,” concluded the countryman.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3013/83267.html","bookId":278,"creation":"Aug 1, 2019 8:33:57 AM","modification":"Aug 1, 2019 8:33:57 AM"}
