{"id":8477,"no":28,"title":"CHAPTER XXVI AN ESCAPE","content":"\u0026nbsp;“I’ll fix you for this,” cried Gabe Flecker, in Frank’s ear, while they were awaiting the arrival of the police. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You brought it on yourself, Flecker,” answered the young book agent, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He owes me for two weeks’ board,” said Mrs. Larkspur, timidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shall not get a cent of it, madam,” snapped the swindler.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s more than likely he hasn’t a dollar with which to pay,” put in Frank. He turned to Flecker: “I guess you’ll get free board for awhile, from now on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just wait!” hissed the swindler, and grated his teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two policemen soon put in an appearance, and Frank explained matters, and then Mrs. Larkspur told her story.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess the young man is right, Mrs. Larkspur,” said one of the officers. “I’ve heard of this fellow. There’s a reward out for him. He is an old offender.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank was asked to make a complaint, and Mrs. Larkspur said she would do the same. Then the policemen marched Gabe Flecker away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must thank you for doing what you did, young man,” said the boarding house mistress to the young book agent. “Had you not been here, he would have swindled me most cleverly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m glad I was here,” returned our hero. “I’d like first rate to get that reward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you certainly deserve it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Larkspur did not wish any books, but told him of several parties who might buy, so in the end he made sales through her which profited him over five dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two policemen felt certain that Gabe Flecker could not get away from them, so they merely made him walk between them, without taking the trouble to handcuff him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, Flecker did not intend to go to the station house if he could possibly avoid it. He knew that his record was a black one, and once before the bar of justice he would be sure to get a sentence of at least several years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Goshen boasts of a race track at which each year a number of important horse races are run. The races were now on, and the town was filled with folks who had come in by train and in carriages.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the policemen and their prisoner were crossing one of the main streets, a cry arose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look out for the runaway!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A horse attached to a buggy was tearing along the street at topmost speed. The vehicle was empty, and was swaying from side to side as if about to go over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look out there!” yelled one of the policemen to some children who were crossing the street near by. And then he ran out to go to their assistance, and so did the other policeman, for the runaway horse was now dangerously close.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was an opportunity not to be missed by Gabe Flecker, and without an instant’s hesitation he slipped around a corner and ran down the side street towards the railroad. Here he watched his chance, and boarded a freight train running towards New York.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just my luck,” he told himself, smilingly, when safe on the train. “They don’t get Gabe Flecker in jail as easily as they think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The policemen soon had the children out of the way, and a moment later the runaway horse was stopped without doing much damage. Then both policemen looked for their prisoner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s gone!” cried one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where to?” queried the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hang me if I know. Why didn’t you watch him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you watch him yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I left him with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, you didn’t. I left him with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It ain’t so!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the talk ran on until a crowd began to collect, wanting to know the cause of the dispute. But the policemen would not tell, and went off to hunt for the missing prisoner. Of course they were unsuccessful, and had to go the station house empty-handed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Frank and Mrs. Larkspur presented themselves they were told that Gabe Flecker had escaped by the aid of two accomplices.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two accomplices?” queried Frank, in astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Exactly,” said the officer in charge. “The two policemen who had the prisoner were set upon by two rascals, and in the mêlée to follow the prisoner got away.” This was the story told by the policemen, who had been negligent in their duty, although, in a way, they had done well to rescue the little children.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s very strange,” said Frank to the boarding house mistress, as they walked away. “I didn’t know he had any accomplices.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I have heard that swindlers often work in pairs, or in a crowd of three or four,” answered Mrs. Larkspur. “Perhaps the races attracted them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must be it,” answered Frank. “I’m going to watch the crowd coming from the races and see if I can learn anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did this, but his watching brought him no satisfaction. He spent the night at Mrs. Larkspur’s house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The contents of the trunks left here are of no value,” said the lady. “I doubt if he ever tries to claim his baggage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank had fairly good success in Goshen, and then returned to Middletown. Here, money seemed to be plentiful, and by good luck he took orders for three sets of famous authors in one day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is what I call business,” he thought. “If I could keep up such a record, I’d be making money hand over fist.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While in Middletown, the young book agent had one experience which was amusing in the extreme. He called on an old gentleman, who seemed to be much pleased to see him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would like to show you a set of famous novels,” said our hero, and brought forth his sample book.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this the old gentleman nodded and smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “As you can see, these novels are well illustrated,” went on the young book agent. “Each illustration is by a well-known artist, so the set of books is quite valuable for the pictures alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again the old gentleman nodded and smiled quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will tell you of the merits of each volume,” pursued Frank, and launched forth in a description that lasted ten or fifteen minutes. The old gentleman appeared to be very attentive, but made no reply to what was said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, sir, don’t you think you want this set of books?” asked the young agent at last.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Still the old gentleman made no reply. But he drew a pad from his pocket, and with a pencil, wrote the following:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am deaf and dumb. What did you show me the books for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I never!” murmured our hero to himself, and then, realizing the humor of the situation, he burst into a merry laugh. “Here I’ve been talking my prettiest, and this man hasn’t heard a single word.” And he laughed again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A moment later he took the pad and wrote down that he wanted to sell a set of the books. But the old man shook his head, and wrote in reply:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never buy books. I borrow them from my children.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case, I’ll bid you good-day,” said Frank, and gathering up his books, he bowed himself out of the house. Ever after he had to laugh when he thought of the deaf and dumb man, and he often told the joke as a good one on himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From Middletown our hero went to Paterson, and then returned to the vicinity of his home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One day he went over to the village of Oakwood to see what he could sell. Here, on the main street, he ran into Bobby Frost.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hullo!” cried the boy who had once run away from home. “What are you doing here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am trying to sell books,” replied Frank. “How are you, Bobby?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “First-rate. I’m going to school again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you chop the wood, too,” went on our hero, with a faint smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You just bet I do,” ejaculated Bobby. “I’m glad to do most anything now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you got home safe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did. But, say, dad did give me an everlasting thrashing for running away,” added Bobby. “I’ll never forget it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think you’ll make more of a fortune around home than in the city, Bobby.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I will. Anyway, I’ve given up reading those trashy five- and ten-cent libraries.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a good job done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come on over to my house,” went on the younger boy. “I guess the folks will be glad to see you. I told them all about you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that white house over yonder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right; I’ll go,” answered our hero. “Maybe your folks will want to buy some books,” he continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps. Mother is a great reader—when she gets time. But she doesn’t care for what they call sensational literature.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got a set of famous novels which may please her. They are not in the least sensational,” answered Frank.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3013/83282.html","bookId":278,"creation":"Aug 1, 2019 8:34:35 AM","modification":"Aug 1, 2019 8:34:35 AM"}
