{"id":8480,"no":31,"title":"CHAPTER XXIX A SCENE ON THE TRAIN","content":"\u0026nbsp;“Gabe Flecker, by all that is wonderful!” murmured the young book agent to himself. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was about to accost the fellow, but suddenly changed his mind, and passed on to the dining car without letting the rascal catch sight of his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When will this train make the next stop?” he asked of a train hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The man consulted his watch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In about two hours and a half.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank sat down to his breakfast in a corner of the dining car. He had scarcely begun eating when Gabe Flecker came in, accompanied by a man who looked to be a Southern planter. The pair went to the table next to the one our hero occupied, and Flecker sat down with his back directly behind that of the young book agent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mr. Lee, this real-estate deal will make you a rich man,” Frank heard Flecker remark, during the course of the meal. “It is really one chance out of a hundred.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are certain that the property is free and clear?” questioned the planter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perfectly clear, sir—I’ll give you my personal guarantee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you are authorized to sell the land for eight thousand dollars?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the figure—providing I can get a customer this week. You see, the family need ready money, otherwise they would hold out for ten or fifteen thousand dollars. It’s a snap—the biggest snap I ever heard of,” went on Gabe Flecker, glibly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is certainly a low figure,” replied Mr. Lee. “Colonel Moss wanted to buy the place three years ago, and they asked sixteen thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you will take the property?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon I will. I’ll think it over first, though.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better make a deposit and close the bargain. If you don’t I’ll have to offer it to somebody else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see.” The planter stroked his beard for a moment. “Well, I reckon after all I’ll take it. I’ve always wanted the place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you will make a deposit now, to bind the bargain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much of a deposit?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Gabe Flecker hesitated. In his mind he was wondering how much the old planter had with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was told to get a deposit of a thousand dollars if I could,” he said, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have only four hundred and fifty dollars with me, Mr. Wardell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll take that. Of course you’ll be prepared to pay the balance by a week from to-day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—as soon as I can get a clear deed. But I can’t let you have more than four hundred. I must keep some money for traveling expenses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right; I’ll take the four hundred dollars,” said Gabe Flecker, quickly. “I’ll write you out a receipt at once. I don’t generally do business when I am eating, but I’ll make an exception this time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old planter brought forth a large wallet, and counted out four hundred dollars in twenty-dollar bills. In the meantime, Gabe Flecker began to write out a receipt, which he signed Thomas C. Wardell, Agent for the Paramore Estate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s the receipt,” said he, and passed it over. As he did so, Frank arose and confronted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait a minute, please,” he said to the planter. “Don’t pay any money to this man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” began Gabe Flecker, and then, as he recognized our hero, he stared as if he saw a ghost.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the trouble?” came from Gasper Lee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This man is not a real-estate agent. He is a swindler.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A swindler!” cried the planter, and put his hand to his hip pocket, as if to draw a pistol.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t shoot!” cried Gabe Flecker, in alarm. “It—it’s a mistake. I—er—I don’t know this boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This man is Gabe Flecker, and he is wanted by more than one person for swindling,” continued Frank, calmly. “You had better have nothing to do with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doesn’t he hail from Charleston?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all. The last I heard of him he escaped from the police of Goshen, New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it possible!” The planter put his money away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Seeing this action, Gabe Flecker started to tear up the receipt he had written. But, like a flash, Frank drew it from his grasp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hi! give that back!” roared the swindler.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not just yet, Mr. Flecker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t give it back I’ll make it hot for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are sure you are right, young man?” questioned the planter, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then the best thing we can do is to have this fellow held for the police.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Exactly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you be a witness against him? I personally cannot prove that he is not what he pretends to be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course, I’ll be a witness against him. I am well acquainted with a gentleman—an ex-mayor of a New Jersey town—who was swindled out of sixty-five dollars by this fellow. He got my friend’s autograph, and then used the autograph on a check.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The scoundrel!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s all a mistake!” roared Gabe Flecker. “I never swindled anybody out of a cent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time a crowd was beginning to collect, and the conductor of the train came hurrying to the spot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can’t quarrel here,” he said. “Come to the smoker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing,” said Frank, and Gasper Lee said the same. As there appeared to be no help for it, Gabe Flecker marched to the smoker. There, surrounded by a number of men, our hero told his story, and Gasper Lee related how he had met Flecker in New York, and how the sharper had gotten into his good graces, and mentioned some valuable property on the outskirts of Charleston as being for sale.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should have handed over my money had it not been for this young man,” concluded the planter. “I was fairly talked into making a bargain with this rascal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you going through to Charleston?” asked the conductor of Gabe Flecker.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was; but I guess I’ll get off at the next station, now,” growled the swindler.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you do, I’ll put you in the hands of the police,” came from Gasper Lee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just what I have in mind to do,” added Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The matter was talked over for several minutes, and at last it was decided that the swindler, Frank, and the planter, should get off at the next station, which was Greensboro. A brief stop was made at a small crossing, where there was a telegraph office, and a message was sent to the Greensboro police to be on hand when the train arrived.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just wait; I’ll even up with you, some day, young man,” said Gabe Flecker to Frank, when he saw that further resistance for the time being was useless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not afraid of you, Flecker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you happen to be on this train?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you following me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you were, I don’t see why you didn’t have me arrested between New York and Philadelphia.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me ask a question. How did you happen to go south?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you going to swindle somebody in Charleston?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I was going down there to meet an old friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m not telling you, Hardy,” growled Gabe Flecker, and then would say no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not long after this that Greensboro was reached and the train came to a halt. Two policemen were at the station, and the swindler was handed over to them, and Frank and Gasper Lee accompanied the officers and their prisoner to the station house. Here a formal complaint was made against Gabe Flecker, and Frank told all he knew about the man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will have to be detained as witnesses,” said the officer who took charge of the case. “That is, unless you can furnish satisfactory security for your appearance when wanted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean you’ll lock me up as a witness?” ejaculated our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll have to detain you, and also Mr. Lee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I must get to Charleston as soon as I can,” urged the young book agent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this the officer of the law shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry for you, but I cannot do otherwise than my duty in this matter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s right; lock him up,” came from Gabe Flecker, who enjoyed the quandary in which our hero was thus placed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank’s heart sank within him. This was a situation of which he had not dreamed. He had caught Gabe Flecker, but by doing so, it was possible that he would miss catching that greater rascal, Jabez Garrison.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3013/83285.html","bookId":278,"creation":"Aug 1, 2019 8:34:43 AM","modification":"Aug 1, 2019 8:34:43 AM"}
