{"id":32097,"no":12,"title":"CHAPTER XI. THE ADVERTISEMENT IN THE HERALD.","content":"\u0026nbsp;About eight o\u0027clock Rough and Ready bade goodnight to Miss Manning and his sister, and went round to the Newsboys\u0027 Lodge to sleep. \n\u003cdiv\u003e\n On entering the room he went up to the superintendent, and said, \"Mr. O\u0027Connor, I want to ask your advice about something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Rufus, I will give you the best advice in my power. Now what is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Hereupon the newsboy told the story of his finding the pocket-book.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you see any one to whom you think it was likely to belong?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long did you remain after you found it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I waited about half an hour, thinking that the loser might come back for it; but no one came.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did you not give it to the bar-keeper?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I knew it did not belong to him, and I judged from his looks that, if he once got hold of it, the true owner would never see it again, even if he came back for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no doubt you are right. I only asked to learn your own idea about it. Now, what do you think of doing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wouldn\u0027t it be a good plan to advertise it in the \u0027Herald\u0027?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I think it might. Besides, there is the chance of its loss being advertised there, so that we can examine the advertisements of articles lost.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; will you write an advertisement?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you wish me to do so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The superintendent took pen and paper, and drew up the following advertisement:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"FOUND.—A pocket-book, containing a considerable\n\u003c/div\u003e \n\u003cdiv\u003e\n sum of money. The owner can have the same by calling on\n\u003c/div\u003e \n\u003cdiv\u003e\n the Superintendent of the Newsboys\u0027 Lodging House, proving\n\u003c/div\u003e \n\u003cdiv\u003e\n property, and paying the expense of this advertisement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How will that do?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s just the thing,\" said Rough and Ready. \"How many times shall I put it in?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three times will answer, I think. I will give you enough of the money to pay for the advertisement, and you can carry it round to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This was done. The charge was found to be four dollars and eighty cents, as the \"Herald\" charges forty cents per line, and the three insertions made twelve lines.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no doubt,\" said Mr. O\u0027Connor, \"I shall have some applications from adventurers, who will pretend that they have lost a pocket-book; but I will take care that it shall be surrendered only to the real owner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The superintendent was right in this matter. Early the next morning, a flashily attired individual mounted the long flights of stairs, and inquired for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your business, sir?\" inquired Mr O\u0027Connor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I called about that pocket-book which you advertise in the \u0027Herald.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you lost one?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and I have no doubt that is the one. How much did you pay for advertising? I don\u0027t mind giving you a trifle extra for your trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait a moment. Where did you lose your pocket-book?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really I can\u0027t say. I was at a good many places down town.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you couldn\u0027t give any idea as to where you lost it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I must have dropped it somewhere in Nassau Street or Fulton Street. Where was it found?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not intend giving information, but to require it. It is important that I should not give it to the wrong party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you doubt that the pocket-book is mine?\" said the other, in an offended tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know nothing about it. If it is yours you can describe the pocket-book, and tell me how much money there is in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said the flashy individual, hesitating, \"it wasn\u0027t a very large pocket-book.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Brown?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how much money was there in it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, I couldn\u0027t tell exactly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you can give me some idea?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There was somewhere from fifty to seventy-five dollars,\" said the adventurer, hazarding a guess.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it doesn\u0027t belong to you,\" said the superintendent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There might have been a little more. Now I think of it, there must have been over eighty dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are wasting your time, sir; you will have to look elsewhere for your pocket-book.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The man went off, muttering that he had no doubt it was his; but he saw clearly that he had failed. However, he was not yet at the end of his resources. At the corner of Broadway and Fulton Streets he was greeted by another young man of similar appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Jack, what luck?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came away as poor as I went.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you couldn\u0027t hit the description?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he was too many for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anyway, you found out something. Give me a few hints, and I\u0027ll try my luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He asked me if the pocket-book was brown, and I said yes. That\u0027s wrong. You\u0027d better say it\u0027s black, or some other color.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right. I\u0027ll remember. What else did he ask you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where I lost it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In Nassau or Fulton Street, I couldn\u0027t say which.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was that wrong?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, he didn\u0027t say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What next?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He asked how much money there was. I said from fifty to seventy-five dollars, though I afterwards said there might be over eighty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s too wide a margin. I think I\u0027ll say a hundred and fifty, more or less.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That might do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As soon as I\u0027ve smoked out my cigar, I\u0027ll go up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good luck to you, Bob. Mind we are to divide if you get it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shall have a third.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, half.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll see about it; but I haven\u0027t got it yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n In a few moments the superintendent received a second applicant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning, sir,\" said the individual named \"Bob.\" \"You\u0027ve found a pocket-book, I think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m glad of it. I lost mine yesterday, with a pretty stiffish sum of money in it. I suppose one of your newsboys picked it up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you lose it in this street?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I expect so. I was coming from the Fulton Ferry in a great hurry, and there was a big hole in my pocket, that I didn\u0027t know of. I had just got the money for a horse that I sold to a man over there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you describe the pocket-book? What color was it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Black, that is to say, not perhaps exactly black, but it might be called black,\" said Bob, getting over this question as well as he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well. Now for the amount of money in the pocket-book.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A hundred and fifty dollars, more or less,\" said Bob, boldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In three bills of fifty dollars each?\" asked the superintendent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, precisely,\" said Bob, eagerly. \"That was what was paid for the horse I sold.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I regret to say that the pocket-book in my possession cannot be yours. When I find one answering your description as to color and contents, I will hold it at your disposal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sold!\" muttered Bob to himself, as he slunk downstairs without another word.\n\u003c/div\u003e \n\u003cdiv\u003e\n He rejoined his confederate, who was waiting for him at the corner, and informed him in expressive language that it was \"no go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"P\u0027r\u0027aps, if we\u0027d consulted a medium, we might have found out all about the color and amount,\" suggested Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you believe it,\" said Bob. \"If the mediums could tell that, they\u0027d be after it themselves. Where\u0027s your \u0027Herald\u0027? We may get or better at some other place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They found an advertisement of a diamond ring found, and started in pursuit of the finder. As Jack? said, \"We might get it, you know; and if we don\u0027t, there\u0027s no harm done.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. O\u0027Connor had various other applications for the pocket-book, of which we will only describe one.\n\u003c/div\u003e \n\u003cdiv\u003e\n A woman dressed in black presented herself about noon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this the superintendent?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, ma\u0027am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came to see you about that pocket-book you advertise. I am a widow with six children, and I have hard work to get along. Yesterday I sent out my oldest boy to pay the rent; but he is a careless boy, and I suppose he got to playing in the street, and it fell out of his pocket. It was a great loss to me, and a widow\u0027s blessings shall rest upon you, sir, if you restore it. My boy\u0027s name is Henry, and I can bring you the best recommendations that I am a respectable woman, and my word can be relied upon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This speech was delivered with such volubility, and with such a steady flow of words, that the superintendent had no opportunity of interrupting her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask your name, madam?\" he said at length.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name is Manson, sir, Mrs. Manson. My husband was an honest man,—he was a blacksmith,—but he was took down sudden with a fever about three years ago, that carried him off, and left me to get along as well as I could with my family of children. I ought to be back now; so if you\u0027ll give it to me, you can take what you like for the advertising, and to pay you for your trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a little too fast, Mrs. Manson. How am I to know that the pocket-book is yours?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll bring my son Henry to prove that he lost the pocket-book when he was going to pay the rent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will not be necessary. All you will have to do will be to describe the pocket-book and its contents, and, if your description is correct, I will take it for granted that it belongs to you, and give it to you at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Describe it, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, what was the color?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t justly say, sir, for it was Henry\u0027s pocket-book,\" said Mrs. Manson, hesitating; \"but I think it was black.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how much money was there in it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thirty dollars,\" said the widow, with a little hesitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then the pocket-book isn\u0027t yours. Good morning, madam.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s hard upon a poor widow to lose her money, sir, and then have the finder refuse to give it up,\" whined Mrs. Manson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be, no doubt; but it would be equally hard for the real owner of the money for me to give it to the wrong person.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I think the pocket-book is mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are mistaken, madam.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Manson, who, by the way, was not a widow, and didn\u0027t have six children as represented, went away crestfallen.\n\u003c/div\u003e \n\u003cdiv\u003e\n A week passed, and the money still remained in the hands of Mr. O\u0027Connor. Numerous applicants had been drawn by the advertisement, one or two of whom had met with genuine losses, but the greater part were adventurers who trusted to lucky guessing to get hold of money that did not belong to them. The advertisements of money lost were also carefully examined daily; but there was none that answered to the sum found by the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am beginning to think,\" said Mr. O\u0027Connor, after a week had passed, \"that you won\u0027t find an owner for this money, Rufus. What do you intend to do with it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll put it in some bank, sir,\" said the newsboy, promptly. \"I don\u0027t need to use it at present, but I may some time. It\u0027ll be something for me to fall back upon, if I get sick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad you do not mean to live upon it. I was afraid it might encourage you to idleness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, it won\u0027t do that,\" said Rough and Ready, promptly. \"I\u0027m not such a fool as that. I\u0027ve got a little sister to take care of, and I\u0027ve thought sometimes, \u0027What if I should get sick?\u0027 but with this money, I shan\u0027t feel afraid. I think it\u0027ll make me work harder. I should like to add something to it if I could.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is the right way to talk, Rufus,\" said the superintendent, approvingly. \"I think you are a good boy, and I shall be glad to help you with advice, or in any other way, whenever you need it. I wish you could get an education; it would help you along in life hereafter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am studying every evening, sir,\" said the newsboy. \"Miss Manning, a friend of mine, that my sister boards with, is helping me. I hope to be something higher than a newsboy some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The superintendent warmly applauded his determination, and a week later gave the pocket-book up to Rough and Ready, feeling that every reasonable effort to find an owner had been tried.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2999/82745.html","bookId":302,"creation":"Aug 5, 2019 3:54:14 AM","modification":"Aug 5, 2019 3:54:14 AM"}
