{"id":32098,"no":13,"title":"CHAPTER XII. A VISIT TO GREENWOOD CEMETERY.","content":"\u0026nbsp;One day Rough and Ready came to see his sister, and displayed a bank-book on one of the city savings-banks, containing an entry of three hundred dollars to his credit. \n\u003cdiv\u003e\n \"What do you think of that, Rosie?\" he said. \"Don\u0027t you think I am rich?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see anything but a little book,\" said Rose, who knew nothing of the way in which savings-banks were conducted. \"There isn\u0027t any money in it,\" she continued, turning over the leaves with the expectation of finding some bills folded between them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t understand it, Rose. That little book is worth three hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three hundred dollars! Why, I wouldn\u0027t give five cents for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The newsboy laughed. \"It shows that I have three hundred dollars in the bank, which they will pay me whenever I want it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is nice,\" said Rose. \"I am so glad you are rich, Rufie.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you have heard nothing of the owner of the money, Rufus?\" said Miss Manning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I have heard nothing. Mr. O\u0027Connor says I shall be right in keeping the money now, as I have tried to find the owner, and cannot.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you propose to do with it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall keep it in the bank at present, until I need it. But there is one thing I would like to do, Miss Manning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would like to make you a present,—a dress, or shawl, or whatever you need most.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Rufus; you are very kind,\" said the seamstress; \"but I would prefer that you would leave the money untouched. Since I made the arrangement with you about Rose, I am doing much better than I did before, and I feel much better, because I have more sustaining food. I feel now as if I could afford to take a little time to sew for myself. I bought a dress-pattern yesterday, and I shall make it up next week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I should like very much to make you a present, Miss Manning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you shall, Rufus, whenever you have a thousand dollars laid aside. At present I do not need anything, and I would rather you would keep your money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n To this resolution Miss Manning adhered, in spite of the newsboy\u0027s urgent persuasion. She knew very well that three hundred dollars, though it seemed a large sum to him, would rapidly melt away if it was once broken in upon, and she wished it to be kept as a \"nest-egg,\" and an encouragement for future accumulations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At any rate,\" said Rufus, \"I want to celebrate my good luck, and I want you to help me do it. Let us go to-morrow afternoon to Greenwood Cemetery. I think Rose will like it, and as it is a beautiful place it will be pleasant for us all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" said the seamstress, \"I will agree to that, if you will wait till I have finished my dress. I think I can have it done, so that we can go on Wednesday afternoon. Will that do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that will suit me very well. I hope it will be a pleasant day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it is not, we can defer it to the next day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It will need to be explained that Rufus had already five dollars in the bank previous to his coming into possession of the contents of the pocket-book. That had originally contained three hundred dollars, but five dollars had been taken out to defray the expenses of advertising in the \"Herald.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rose was informed of the contemplated excursion, she was filled with delight. The poor child had had very little pleasure or variety, and the excursion, brief as it was, she anticipated with eager enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n The day opened auspiciously. The early morning hours the newsboy devoted to his business, being unwilling to lose a day\u0027s earnings. At eleven o\u0027clock he came to Miss Manning\u0027s lodgings. \"Well, I am through with my day\u0027s work,\" he said. \"How much do you think I have earned?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Seventy-five cents?\" said the seamstress, inquiringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A dollar and twenty cents,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have been very smart. What a number of papers you must have sold!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t make it all that way. There were two boys who were hard up, and hadn\u0027t any blacking-brushes; so I bought them some, and they are to pay me ten cents a day, each of them, for a month, then I shall let them keep the brushes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do the boys often make such arrangements?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, they generally go whacks. The boy who borrows agrees to pay half his earnings to the boy that sets him up in business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is rather a hard bargain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I didn\u0027t want to charge so much. So I only charged ten cents a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will pay you a good profit; but how do you know but the boys will keep the brushes, and won\u0027t pay you anything?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, they won\u0027t do that. They\u0027ll keep their promises, or nobody would help \u0027em next time they get hard up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Manning had prepared an early dinner, to which they all sat down. This was soon despatched, and they set out together for the South Ferry, from which cars ran to the cemetery.\n\u003c/div\u003e \n\u003cdiv\u003e\n They reached the ferry about noon, and at once crossed over. Rose enjoyed the ride upon the boat, for, though New York is surrounded by ferries, she had hardly ever ridden on a ferry-boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish we didn\u0027t get out so quick,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like being on the water, Rosie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ever so much,\" replied the little girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we will take a longer excursion some day soon. We can go to Staten Island. That will be six miles each way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will be nice. I hope we can go soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They soon reached the Brooklyn side, and disembarked with the throng of fellow-passengers. A car was waiting the boat\u0027s arrival, on which they saw \"Greenwood\" printed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jump on board quick,\" said Rough and Ready, \"or you won\u0027t get seats.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Manning barely got a seat. She took Rose in her lap, and the newsboy stood out on the platform with the conductor. The ride was a pleasant one to all three, but no incidents happened worth noting. When Rufus settled the fare, the conductor said jocosely, \"Your wife and child, I suppose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said the newsboy, \"all my children are grown up and out of the way. They don\u0027t give me any trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s where you\u0027re lucky,\" said the conductor. \"It\u0027s more than I can say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you a family?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I have a wife and four children, and precious hard work I find it to support them on my small wages. But it\u0027s no use asking any more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s my sister, the little girl I mean,\" said Rufus, \"The other is a friend who looks after her. I have to support her; but that\u0027s only one, while you have five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She looks like a nice little girl. She is about the size of my oldest girl.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027s a dear little sister,\" said the newsboy, warmly. \"I should feel very lonely without her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He little thought as he spoke that the loneliness to which he referred was speedily to come upon him. But we will not anticipate.\n\u003c/div\u003e \n\u003cdiv\u003e\n They got out at the entrance of the cemetery, and entered the grounds. Greenwood Cemetery, of which all my readers have probably heard, is very extensive, the grounds comprising over three hundred acres. It is situated about two and a half miles from the South Ferry, on what is now known as Gowanus Heights. Its elevated position enables it to command charming views of the bay and harbor of New York; with its islands and forts, the twin cities of New York and Brooklyn, the New Jersey shore, the long lines of city wharves, with their forests of masts, and an extensive view of the ocean. The numerous and beautiful trees crowning the elevations, the costly monuments, the winding paths, so intersecting each other as almost to make a labyrinth, render this a charming spot, and death assumes a less repulsive aspect amid such surroundings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How beautiful it is!\" said Miss Manning, gazing about her thoughtfully. \"I have never been here before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never came but once,\" said the newsboy, \"and that was a good while ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Little Rose was charmed, and darted first into one path, then into another, and was about to pluck some flowers, until she was told that this was against the regulations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a lot of dead people live here!\" she said, as from a little height they saw white stones and monuments rising on every side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She has used the right word, after all, Rufus,\" said Miss Manning; \"for death is only the introduction to another life. I sometimes think that those whose bodies lie here are not wholly insensible to the beauty by which they are surrounded.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" said the newsboy, \"I never thought much about it till mother died. I wish she had been buried here. I think it would be a comfort to me. Poor mother! she had a hard life;\" and he sighed. \"I want Rose to have a happier one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let us hope she will. Have you heard anything of Mr. Martin lately?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She carefully avoided using the word \"stepfather\" for she had observed that even this recognition of relationship was distasteful to the boy, who had imbibed a bitter prejudice against the man who had wrecked his mother\u0027s happiness, and undoubtedly abridged her life by several years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I have not seen him since the day after I took Rose away from Leonard Street. I think he cannot be in the city, or he would have come round to where I was selling papers. I expected he would be round before to ask me for some money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think has become of him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe he has gone back into the country. I hope he has, for I should feel safer about Rose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the conversation closed for the time. They rambled on without any particular aim, wherever fancy dictated. They came upon most of the notable monuments, including that of the sea-captain, and that of Miss Canda, the young heiress, who, dying by a violent accident, with no one to inherit her wealth, it was decided that it should all be expended upon a costly monument, which has ever since been one of the chief ornaments of the cemetery.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length they began to think of returning, but had some difficulty at first in finding their way to the gate, so perplexing is the maze of paths.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know but we shall have to stay here all night,\" said Rufus. \"How should you like that, Rose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t care,\" said the little girl. \"I think the grass would make a nice soft bed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But to this necessity they were not reduced, as after a while they emerged into a broad path that led down to the gateway. They passed through it, and got on board a horse-car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we will go to Fulton Ferry this time,\" said Rough and Ready. \"It will give us a little change.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not realize to what misfortune this choice of his would lead, or he would not have made it; but we cannot foresee what our most trifling decisions may lead to. In due time they got on board the Fulton ferry-boat, and went into the ladies\u0027 cabin. They didn\u0027t see a man who followed their motions with an eager gaze, mingled with malice. It was James Martin, who saw Rose now for the first time since she was taken from Leonard Street by her brother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is lucky!\" he muttered to himself. \"I will find out where she lives, and then it will be a pretty tight cage, or I shall be able to secure the bird.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was danger that, if he followed in person, the newsboy might look back, and, perceiving his design, foil it by going in the wrong direction. He quickly decided what to do. There was a half-grown boy near by whom he knew slightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here, boy,\" said he,\"do you want to earn half a dollar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you must follow some people whom I will point out to you, and find out where they live. Don\u0027t let them see that they are followed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rough and Ready got out of the boat with his two companions, they were followed at a little distance by this boy; but of this they were quite unaware.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2999/82746.html","bookId":302,"creation":"Aug 5, 2019 3:54:14 AM","modification":"Aug 5, 2019 3:54:14 AM"}
