{"id":32090,"no":5,"title":"CHAPTER IV. A FORTUNATE MEETING.","content":"\u0026nbsp;\"Where are we going, Rufus?\" asked Rose, as they left the subterranean shop. \n\u003cdiv\u003e\n \"That\u0027s what I\u0027m trying to think, Rose,\" said her brother, not a little perplexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n To tell the truth, Rough and Ready had acted from impulse, and without any well-defined plan in his mind. He had resolved to take Rose from her old home, if it deserved the name, and for reasons which the reader will no doubt pronounce sufficient; but he had not yet had time to consider where they should live in future.\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a puzzling question.\n\u003c/div\u003e \n\u003cdiv\u003e\n If the newsboy had been a capitalist, or in receipt of a handsome income, the question would have been a very simple one. He would only need to have bought a \"Morning Herald,\" and, from the long list of boarding and lodging houses, have selected one which he judged suitable. But his income was small, and he had himself and his sister to provide for. He knew that it must be lonely for Rose to pass the greater part of the day without him; yet it seemed to be necessary. If only there was some suitable person for her to be with. The loss of her mother was a great one to Rose, for it left her almost without a companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n So Rough and Ready knit his brows in perplexing thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell where we\u0027d better go, Rose, yet,\" he said at last. \"We\u0027ll have to look round a little, and perhaps we\u0027ll come across some good place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope it\u0027ll be some place where father won\u0027t find us,\" said Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t call him father,\" said the newsboy, hastily. \"He isn\u0027t our father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Rose, \"I know that,—that is not our own father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you remember our own father, Rose? But of course you don\u0027t, for you were only a year old when he died.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How old were you, Rufus?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was nine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell me about father. Mother used to tell me about him sometimes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was always kind and good. I remember his pleasant smile whenever he came home. Once he was pretty well off; but he failed in business, and had to give up his store, and, soon after, he died, so that mother was left destitute. Then she married Mr. Martin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made her?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was for our sake, Rose. She thought he would give us a good home. But you know how it turned out. Sometimes I think mother might have been alive now, if she hadn\u0027t married him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I wish she was,\" said Rose, sighing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Rose, we won\u0027t talk any more of Mr. Martin. He hasn\u0027t got any more to do with us. He can take care of himself, and we will take care of ourselves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, Rufie,\" said the little girl; \"I\u0027m afraid he\u0027ll do us some harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be afraid, Rose; I aint afraid of him, and I\u0027ll take care he don\u0027t touch you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The little girl\u0027s apprehensions were not without good reason. They had not done with this man Martin. He was yet to cause them considerable trouble. What that trouble was will be developed in the course of the story. Our business now is to follow the course of the two orphans.\n\u003c/div\u003e \n\u003cdiv\u003e\n They had reached and crossed the City Hall Park, and now stood on the Broadway pavement, opposite Murray Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are we going to cross Broadway, Rufus?\" asked his little sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Rose. I\u0027ve been thinking you would feel more comfortable to be as far away from our old room as possible. If we can get a lodging on the west side of Broadway somewhere, we shan\u0027t be so apt to meet Mr. Martin. You\u0027d like that better, wouldn\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, I should like that better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now we\u0027ll cross. Keep firm hold of my hand Rose, or you\u0027ll get run over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n During the hours of daylight, except on Sunday, there is hardly a pause in the long line of vehicles of every description that make their way up and down the great central thoroughfare of the city. A quick eye and a quick step are needed to cross in safety. But the practised newsboy found no difficulty. Dodging this way and that, he led his sister safely across.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let us go up Broadway, Rufus,\" said the little girl, who, living always in the eastern part of the city, was more used to Chatham Street and the Bowery than the more fashionable Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, Rose. We can turn off higher up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n So the newsboy walked up Broadway, on the west side, his little sister clinging to his arm. Occasionally, though they didn\u0027t know it, glances of interest were directed towards them. The attractive face of little Rose, set off by her neat attire, and the frank, open countenance of our young hero, who looked more manly in his character of guardian to his little sister, made a pleasant impression upon the passers-by, or at least such as could spare a thought from the business cares which are apt to engross the mind to the exclusion of everything.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I only had two such children!\" thought a childless millionaire, as he passed with a hurried step. His coffers were full of gold, but his home was empty of comfort and happiness. He might easily have secured it by diverting a trifling rill, from his full stream of riches, to the channel of charity; but this never entered his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n So the children walked up the street, jostled by hurrying multitudes, little Rose gazing with childish interest at the shop windows, and the objects they presented. As for Rough and Ready, Broadway was no novelty to him. His busy feet had traversed every portion of the city, or at least the lower part, and he felt at home everywhere. While his sister was gazing at the shop windows, he was engaged in trying to solve the difficult question which was still puzzling him,—\"Where should he find a home for his sister?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The solution of the question was nearer than he anticipated.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they passed a large clothing-house, the little girl\u0027s attention was suddenly attracted to a young woman, who came out of the front entrance with a large bundle under her arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"O Miss Manning,\" she cried, joyfully, \"how do you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, little Rose!\" exclaimed the seamstress, a cordial smile lighting up her face, pale from confinement and want of exercise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How are you, Miss Manning?\" said the newsboy, in an off-hand manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see you, Rufus,\" said the young woman, shaking hands with him. \"How you have grown!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have I?\" said Rough and Ready, pleased with what he regarded as a compliment. \"I\u0027m glad I\u0027m getting up in the world that way, if I can\u0027t in any other.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you sell papers now, Rufus?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I expect all the newspaper editors would fail if I didn\u0027t help \u0027em off with their papers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are both looking fresh and rosy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Particularly Rose,\" said the newsboy, laughing. \"But you are not looking very well, Miss Manning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I\u0027m pretty well,\" said the seamstress; \"but I don\u0027t get much chance to get out into the air.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You work too hard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have to work hard,\" she replied, smiling faintly. \"Sewing is not very well paid, and it costs a great deal to live. Where are you living now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are not living anywhere,\" said Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are living on Broadway just at present,\" said Rough and Ready.\n\u003c/div\u003e \n\u003cdiv\u003e\n The seamstress looked from one to the other in surprise, not understanding what they meant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is your father now?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no father,\" said the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Mr. Martin dead, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he\u0027s alive, but he isn\u0027t my father, and I won\u0027t own him as such. If you want to know where he is, I will tell you. He is lying drunk on the floor of a room on Leonard Street, or at least he was half an hour ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The newsboy spoke with some bitterness, for he never could think with any patience of the man who had embittered the last years of his mother\u0027s life, and had that very morning nearly deprived his little sister of the clothing which he had purchased for her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you left him, then?\" asked the seamstress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, we have left him, and we do not mean to go near him again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you mean to take the whole care of your little sister, Rufus?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a great responsibility for a boy like you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is what I have been doing all along. Mr. Martin hasn\u0027t earned his share of the expenses. I\u0027ve had to take care of us both, and him too, and then he didn\u0027t treat us decently. I\u0027ll tell you what he did this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Here he told the story of the manner in which his little sister had been robbed of her dress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t think I\u0027d stand that, Miss Manning, do you?\" he said, lifting his eyes to hers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Rufus; it seemed hard treatment. So you\u0027re going to find a home somewhere else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you expect to go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that is what puzzles me,\" said the newsboy. \"I want some place in the west part of the city, so as to be out of Martin\u0027s way. Where do you live?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In Franklin Street, not far from the river.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it a good place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As good as I can expect. You know that I am poor as well as you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is there any chance for us in the house?\" asked Rufus, with a sudden idea touching the solution of the problem that had troubled him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, there is no room vacant, I believe,\" said the seamstress, thoughtfully. \"If there were only Rose, now,\" she added, \"I could take her into the room with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s just the thing,\" said Rufus, joyfully. \"Rose, wouldn\u0027t you like to be with Miss Manning? Then you would have company every day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Rose, \"I should like it ever so much; but where would you be?\" she asked, doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go to the Newsboys\u0027 Lodging House to sleep, but I\u0027ll come every afternoon and evening to see you. I\u0027ll give Miss Manning so much a week for your share of the expenses, and then I\u0027ll feel easy about you. But wouldn\u0027t she be a trouble to you, Miss Manning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A trouble,\" repeated the seamstress. \"You don\u0027t know how much I shall enjoy her company. I get so lonely sometimes. If you\u0027ll come with me now, I\u0027ll show you my room, and Rose shall find a home at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Much relieved in mind, Rough and Ready, with his sister still clinging to his arm, followed the seamstress down Franklin Street towards her home near the river.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2999/82738.html","bookId":302,"creation":"Aug 5, 2019 3:54:14 AM","modification":"Aug 5, 2019 3:54:14 AM"}
