{"id":32094,"no":9,"title":"CHAPTER VIII. ROSE IN HER NEW HOME.","content":"\u0026nbsp;At the close of the afternoon the newsboy, counting up his gains, found that he had made a dollar and a half by selling papers, and twenty-five cents besides, by an errand which he had done for a shopkeeper whose boy was sick. If he could keep up this rate of wages every day, he would be able to get along very well. But, in the first place, it was not often that he made as much as a dollar and a half by selling papers, nor was there a chance to do errands every day. When it was rainy his sales of papers fell off, as there were not so many people about Rufus began to feel like a family man, with the responsibility of supporting a family on his hands. \n\u003cdiv\u003e\n He was determined that his little sister should not be obliged to go out into the street to earn anything, though there are many girls, no older than she, who are sent out with matches, or papers, or perhaps to beg. But Rufus was too proud to permit that.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A stout boy like me ought to earn money enough to take care of two persons,\" he said to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n About half-past five he started for Franklin Street, for it will be remembered that he had arranged to take supper with his sister and Miss Manning.\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose had been listening for his step, and as soon as she heard it on the stairs, she ran out on the landing, and called out, joyfully, \"Is that you, Rufie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Rosie,\" said the newsboy. \"What have you been doing to-day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve had such a nice time, Rufie,\" said the little girl, clinging to her brother\u0027s arm. \"Miss Manning began to teach me my letters to-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How does she get along, Miss Manning?\" asked Rough and Ready, who by this time had entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Famously,\" said Miss Manning. \"She\u0027s very quick. I think she\u0027ll be able to read in three months, if she keeps on doing as well as to-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s good,\" said the newsboy, with satisfaction. \"I\u0027ve always been afraid that she would grow up ignorant, and I shouldn\u0027t like that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m no great scholar,\" said Miss Manning, modestly; \"but I shall be glad to teach Rose all I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid it will be a good deal of trouble for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, it is very little. Rose sits beside me, learning, while I am sewing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you have to leave off to hear her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Leaving off now and then rests me. Besides, as you pay part of my rent, I do not need to work so steadily as I used to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve a great mind to ask you to teach me a little, too, Miss Manning,\" said the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do it with pleasure, as far as I am capable. How much do you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Precious little,\" said Rufus. \"I can read some, but when I get out of easy reading I can\u0027t do much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you write?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little, but not much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will help you all I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll bring a writing book to-morrow evening, and a book to read out of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rough and Ready, though not as ignorant as many in his situation in life, had long deplored his ignorance, and wished that he knew more. But he had been obliged to work early and late, and his stepfather was not one to give him assistance, or take any interest in his improvement. So he had grown up ignorant, though possessed of excellent abilities, because he saw no way of obtaining the knowledge he desired. Now, however, he thought, with Miss Manning\u0027s help, he might enter upon a career of improvement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you seen father yet, Rufie?\" asked Rose, uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw Mr. Martin this morning,\" said the newsboy, emphasizing the name, for he would not recognize any relationship between them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean Mr. Martin,\" said Rose. \"What did he say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wanted to know where you were.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he?\" asked Rose, looking frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be afraid, Rosie,\" said her brother, putting his arm round his little sister\u0027s neck. \"He doesn\u0027t know, and I shan\u0027t let him find out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose and her Enemy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But if he should find out,\" said Rose, in terror. \"You won\u0027t let him carry me off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t. Don\u0027t be frightened. Do you like this better than Leonard Street, Rosie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, ever so much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rufus looked pleased. He felt that he had made the best arrangement in his power for his sister\u0027s comfort and happiness, and that he had been very lucky to find so suitable a person as Miss Manning to place her with.\n\u003c/div\u003e \n\u003cdiv\u003e\n While he was talking with Rose, the seamstress had been moving about quietly, and by this time the little table was neatly spread in the centre of the room. On it were placed knives, forks, and plates for three. The teakettle had boiled, and, taking out her little teapot, the seamstress put it on the stove for the tea to steep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like toast, Rufus?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Miss Manning; but I don\u0027t want you to take too much trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s very little trouble. I think Rose would like toast too. I\u0027ve got a little meat too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She took from the cupboard about half a pound of steak, which she put on the coals to broil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m afraid you\u0027re giving us too good a supper,\" said the newsboy. \"Beefsteak costs considerable. I don\u0027t want you to lose money by Rose and me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no danger of that,\" said Miss Manning. \"It doesn\u0027t cost as much as you think for. The steak only cost me twelve cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But there\u0027s the tea and the toast,\" suggested Rough and Ready.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Toast costs no more than bread, and six cents pays for all the bread we eat at night. Then I only need a spoonful or two of tea, and that, and the sugar and butter altogether, don\u0027t cost more than eighteen cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean that we can live like this for thirty cents a meal?\" asked the newsboy, incredulously. \"Why, I have about as much as that to pay for my dinner at the eating-house, and the meat isn\u0027t as good as this, I am sure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, they charge considerable for the cooking and the profits,\" said Miss Manning. \"I do the cooking myself, and save all that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time dinner, as we may call it, was ready, and the three sat down to the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was, to be sure, an humble meal; but it looked very attractive and inviting for all that, with the steak on a plate in the centre, the well-browned toast on one side, and the little plate of butter on the other, while the little teapot steamed with its fragrant beverage. It was so different from the way in which they had lived in Leonard Street, that it seemed very pleasant to the two children.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Isn\u0027t it nice, Rufie?\" said Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said the newsboy. \"It\u0027s what I call reg\u0027larly jolly. Besides, it cost so little money, I can\u0027t get over that. I\u0027m sure we\u0027re much obliged to Miss Manning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But,\" said the seamstress, \"you must remember that if it\u0027s better for you, it\u0027s better and pleasanter for me too. You mustn\u0027t think I used to live like this before Rose came to me. I couldn\u0027t afford to. Sometimes I had a little tea, but not often, and it was very seldom that I ate any meat. The rent came hard for me to pay, and I had to work so steadily that I didn\u0027t feel as if I could afford time to cook anything, even if I had the money to buy it with.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did you have for supper, Miss Manning?\" inquired Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Generally I didn\u0027t get anything but dry bread, without butter or tea.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I should think you would have felt hungry for something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t have much appetite. I sat so steadily at my work, without a chance to breathe the fresh air, that I cared very little about eating. My appetite is beginning to come now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you and Rose had better take a walk every day,\" said Rufus. \"You both need to breathe the fresh air. That is, if you think you can spare the time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, I can spare the time, now that I get paid so well for my boarder,\" said the seamstress, playfully. \"An hour or two of my time is worth very little. How much do you think I earn when I sit over my work all day,—about fourteen hours?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" said Rufus. \"I think you ought to earn as much as a dollar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Manning shook her head, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you know very little about the wages paid to us poor seamstresses,\" she said. \"If I were paid a dollar for my day\u0027s work I should feel as if I were worth a fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you earn near that,\" said the newsboy, \"don\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When I work steadily, I earn about three shillings,\" said Miss Manning.\n\u003c/div\u003e \n\u003cdiv\u003e\n I must here remind my New England reader, who is accustomed to consider a shilling about seventeen cents, that in New York eight shillings are reckoned to the dollar, and a shilling, therefore, only represents twelve and a half cents; Miss Manning\u0027s day\u0027s work thus brought her thirty-seven and a half cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three shillings!\" repeated Rough and Ready, in surprise. \"That\u0027s very poor pay. I think I do very poorly if I don\u0027t make as much as a dollar. Won\u0027t they pay you any more?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, they find plenty who are ready to take their work at the price they are willing to pay. If anybody complains, they take away their work and employ somebody else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much do you think I made to day?\" asked the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A dollar and a quarter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I made a dollar and seventy-five cents,\" said Rough and Ready, with satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rufie\u0027s real smart,\" said Rose, who was proud of her brother, in whom she felt implicit confidence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t believe all she says, Miss Manning,\" said the newsboy, laughing. \"Rose thinks more of me than anybody else does. But what were we talking about? Oh, about going out for a walk every day. If you think you can spare the time to go out with Rose, I think it will do you both good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We can come round and see you sell papers sometimes, Rufie,\" said his little sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said the newsboy, hastily, \"I don\u0027t want you to do that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\" said Rose, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because Mr. Martin is on the lookout for Rose, and will very likely be prowling round somewhere near me, ready to pounce on Rose if he happens to see her. So I\u0027d rather you\u0027d keep on the west side with her Miss Manning. If you go on Broadway, let it be somewhere above Chamber Street, where you won\u0027t be seen from the Park. In that way Martin won\u0027t be likely to meet you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is best to be prudent, no doubt,\" said Miss Manning. \"I will remember your wishes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The next evening, Rufus began to study, under the guidance and direction of Miss Manning. He generally left the room about nine o\u0027clock, and made his way to the Newsboys\u0027 Lodge, where he now passed his nights regularly.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2999/82742.html","bookId":302,"creation":"Aug 5, 2019 3:54:14 AM","modification":"Aug 5, 2019 3:54:14 AM"}
