{"id":96070,"no":19,"title":"Page 19","content":"\u003cp\u003e“That I know about you?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“That your life has been filled with violence, but I think I already mentioned that.”\u003c/p\u003e\n\u003cp\u003e“You said I was gentle and not full of anger.”\u003c/p\u003e\n\u003cp\u003e“But you’ve had to kill people, John.”\u003c/p\u003e\n\u003cp\u003e“Who told you that?” She was no longer holding his hand. Had she released it? Or had he taken it away from her?\u003c/p\u003e\n\u003cp\u003e“Who told me?”\u003c/p\u003e\n\u003cp\u003eMaggie, he thought. Who else could it have been? Maggie was the only person they knew in common. But how did Maggie know? In her eyes he was a corporate suburbanite, even if he lived alone in the heart of the city.\u003c/p\u003e\n\u003cp\u003e“Actually,” she was saying, “I had several informants.”\u003c/p\u003e\n\u003cp\u003eHis heart was hammering. What was she saying? How could it be true?\u003c/p\u003e\n\u003cp\u003e“Let me see, John. There was Saturn, and Mars, and we don’t want to forget Mercury.” Her tone was soft, her gaze so gentle. “John,” she said, “it’s in your chart.”\u003c/p\u003e\n\u003cp\u003e“My chart.”\u003c/p\u003e\n\u003cp\u003e“I picked up on it right away. I got a very strong hit while I was working on your chart, and when you rang the bell I knew I would be opening the door to a man who had done a great deal of killing.”\u003c/p\u003e\n\u003cp\u003e“I’m surprised you didn’t cancel the appointment.”\u003c/p\u003e\n\u003cp\u003e“I considered it. Something told me not to.”\u003c/p\u003e\n\u003cp\u003e“A little bird?”\u003c/p\u003e\n\u003cp\u003e“An inner prompting. Or maybe it was curiosity. I wanted to see what you looked like.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“Well, I knew right away I hadn’t made a mistake with your chart.”\u003c/p\u003e\n\u003cp\u003e“Because of my thumb?”\u003c/p\u003e\n\u003cp\u003e“No, though it was interesting to have that extra bit of confirmation. And the most revealing thing about your thumb was the effort you made to conceal it. But the vibration I picked up from you was far more revealing than anything about your thumb.”\u003c/p\u003e\n\u003cp\u003e“The vibration.”\u003c/p\u003e\n\u003cp\u003e“I don’t know a better way to put it. Sometimes the intuitive part of the mind picks up things the five senses are blind and deaf to. Sometimes a person just knows something.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I knew you were…”\u003c/p\u003e\n\u003cp\u003e“A killer,” he supplied.\u003c/p\u003e\n\u003cp\u003e“Well, a man who has killed. And in a very dispassionate way, too. It’s not personal for you, is it, John?”\u003c/p\u003e\n\u003cp\u003e“Sometimes a personal element comes into it.”\u003c/p\u003e\n\u003cp\u003e“But not often.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“It’s business.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“John? You don’t have to be afraid of me.”\u003c/p\u003e\n\u003cp\u003eCould she read his mind? He hoped not. Because what came to him now was that he was not afraid of her, but of what he might have to do to her.\u003c/p\u003e\n\u003cp\u003eAnd he didn’t want to. She was a nice woman, and he sensed she would be able to tell him things it would be good for him to hear.\u003c/p\u003e\n\u003cp\u003e“You don’t have to fear that I’ll do anything, or say anything to anyone. You don’t even need to fear my disapproval.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“I don’t make many moral judgments, John. The more I see, the less I’m sure I know what’s right and what’s wrong. Once I accepted myself”-she reached, grinning, for a chocolate-“I found it easier to accept other people. Thumbs and all.”\u003c/p\u003e\n\u003cp\u003eHe looked at his thumb, then raised his eyes to meet hers.\u003c/p\u003e\n\u003cp\u003e“Besides,” she said, very gently, “I think you’ve done wonderfully in life, John.” She tapped his chart. “I know what you started with. I think you’ve turned out just fine.”\u003c/p\u003e\n\u003cp\u003eHe tried to say something, but the words got stuck in his throat.\u003c/p\u003e\n\u003cp\u003e“It’s all right,” she said. “Go right ahead and cry. Never be ashamed to cry, John. It’s all right.”\u003c/p\u003e\n\u003cp\u003eAnd she drew his head to her breast and held him while, astonished, he sobbed his heart out.\u003c/p\u003e\n\u003cp\u003eTen\u003c/p\u003e\n\u003cp\u003e“Well, that’s a first,” he said. “I don’t know what I expected from astrology, but it wasn’t tears.”\u003c/p\u003e\n\u003cp\u003e“They wanted to come out. You’ve had them stored up for a while, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“Forever. I was in therapy for a while and never even got choked up.”\u003c/p\u003e\n\u003cp\u003e“That would have been when? Three years ago?”\u003c/p\u003e\n\u003cp\u003e“How did you… It’s in my chart?”\u003c/p\u003e\n\u003cp\u003e“Not therapy per se, but I saw there was a period when you were ready for self-exploration. But I don’t believe you stayed with it for very long.”\u003c/p\u003e\n\u003cp\u003e“A few months. I got a lot of insight out of it, but in the end I felt I had to put an end to it.”\u003c/p\u003e\n\u003cp\u003eDr. Breen, the therapist, had had his own agenda, and it had conflicted seriously with Keller’s. The therapy had ended abruptly, and so, not coincidentally, had Breen.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t let that happen with Louise Carpenter.\u003c/p\u003e\n\u003cp\u003e“This isn’t therapy,” she told him now, “but it can be a powerful experience. As you just found out.”\u003c/p\u003e\n\u003cp\u003e“I’ll say. But we must have used up our fifty minutes.” He looked at his watch. “We went way over. I’m sorry. I didn’t realize.”\u003c/p\u003e\n\u003cp\u003e“I told you it’s not therapy, John. We don’t worry about the clock. And I never book more than two clients a day, one in the morning and one in the afternoon. We have all the time we need.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“And we need to talk about what you’re going through. This is a difficult time for you, isn’t it?”\u003c/p\u003e\n\u003cp\u003eWas it?\u003c/p\u003e\n\u003cp\u003e“I’m afraid the coming twelve months will continue to be difficult,” she went on, “as long as Saturn’s where it is. Difficult and dangerous. But I suppose danger is something you’ve learned to live with.”\u003c/p\u003e\n\u003cp\u003e“It’s not that dangerous,” he said. “What I do.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eDangerous to others, he thought. “Not to me,” he said. “Not particularly. There’s always a risk, and you have to keep your guard up, but it’s not as though you have to be on edge all the time.”\u003c/p\u003e\n\u003cp\u003e“What, John?”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“You had a thought, it just flashed across your face.”\u003c/p\u003e\n\u003cp\u003e“I’m surprised you can’t tell me what it was.”\u003c/p\u003e\n\u003cp\u003e“If I had to guess,” she said, “I’d say you thought of something that contradicted the sentence you just spoke. About not having to be on edge all the time.”\u003c/p\u003e\n\u003cp\u003e“That’s what it was, all right.”\u003c/p\u003e\n\u003cp\u003e“This would have been fairly recent.”\u003c/p\u003e\n\u003cp\u003e“You can really tell all that? I’m sorry, I keep doing that. Yes, it was recent. A few months ago.”\u003c/p\u003e\n\u003cp\u003e“Because the period of danger would have begun during the fall.”\u003c/p\u003e\n\u003cp\u003e“That’s when it was.” And, without getting into specifics at all, he talked about his trip to Louisville, and how everything had seemed to be going wrong. “And there was a knock on the door of my room,” he said, “and I panicked, which is not like me at all.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I grabbed something”-a gun-“and stood next to the door, and my heart was hammering, and it was nothing but some drunk who couldn’t find his friend. I was all set to kill him in self-defense, and all he did was knock on the wrong door.”\u003c/p\u003e\n\u003cp\u003e“It must have been upsetting.”\u003c/p\u003e\n\u003cp\u003e“The most upsetting part was seeing how upset I got. That didn’t get my pulse racing like the knock on the door did, but the effects lasted longer. It still bothers me, to tell the truth.”\u003c/p\u003e\n\u003cp\u003e“Because the reaction was unwarranted. But maybe you really were in danger, John. Not from the drunk, but from something invisible.”\u003c/p\u003e\n\u003cp\u003e“Like what, anthrax spores?”\u003c/p\u003e\n\u003cp\u003e“Invisible to you, but not necessarily to the naked eye. Some unknown adversary, some secret enemy.”\u003c/p\u003e\n\u003cp\u003e“That’s how it felt. But it doesn’t make any sense.”\u003c/p\u003e\n\u003cp\u003e“Do you want to tell me about it?”\u003c/p\u003e\n\u003cp\u003eDid he?\u003c/p\u003e\n\u003cp\u003e“I changed my room,” he said.\u003c/p\u003e\n\u003cp\u003e“Because of the drunk who knocked on your door?”\u003c/p\u003e\n\u003cp\u003e“No, why would I do that? But a couple of nights later I couldn’t sleep because of noise from the people upstairs. I had to keep my room that night, the place was full, but I let them put me in a new room first thing the next morning. And that night…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Two people checked into my old room. A man and a woman. They were murdered.”\u003c/p\u003e\n\u003cp\u003e“In the room you’d just moved out of.”\u003c/p\u003e\n\u003cp\u003e“It was her husband. She was there with somebody else, and the husband must have followed them. Shot them both. But I couldn’t get past the fact that it was my room. Like if I hadn’t changed my room, her husband would have come after me.”\u003c/p\u003e\n\u003cp\u003e“But he wasn’t anyone you knew.”\u003c/p\u003e\n\u003cp\u003e“No, far from it.”\u003c/p\u003e\n\u003cp\u003e“And yet you felt as though you’d had a narrow escape.”\u003c/p\u003e\n\u003cp\u003e“But of course that’s ridiculous.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “You could have been killed, John.”\u003c/p\u003e\n\u003cp\u003e“How? I kept thinking the same thing myself, but it’s just not true. The only reason the killer came to the room was because of the two people who were in it. They were what drew him, not the room itself. So how could he have ever been a danger to me?”\u003c/p\u003e\n\u003cp\u003e“There was a danger, though.”\u003c/p\u003e\n\u003cp\u003e“The chart tells you that?”\u003c/p\u003e\n\u003cp\u003eShe nodded solemnly, holding up one hand with the thumb and forefinger half an inch apart. “You and Death,” she said, “came this close to one another.”\u003c/p\u003e\n\u003cp\u003e“That’s how it felt! But-“\u003c/p\u003e\n\u003cp\u003e“Forget the husband, forget what happened in that room. The woman’s husband was never a threat to you, but someone else was. You were out there where the ice was very thin, John, and that’s a good metaphor, because a skater never realizes the ice is thin until it cracks.”\u003c/p\u003e\n\u003cp\u003e“But-“\u003c/p\u003e\n\u003cp\u003e“But it didn’t,” she said. “Whatever endangered you, the danger passed. Then those two people were killed, and that got your attention.”\u003c/p\u003e\n\u003cp\u003e“Like ice cracking,” he said, “but on another pond. I’ll have to think about this.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you will.”\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “Louise? Is it all written in the stars, and do we just walk through it down here on earth?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You can look at that piece of paper,” he said, “and you can say, ‘Well, you’ll come very close to death on such and such of a day, but you’ll get through it safe and sound.’ “\u003c/p\u003e\n\u003cp\u003e“Only the first part. ‘You’ll come very close to death’-I could have looked at this and told you that much. But I wouldn’t have been able to tell you that you’d survive. The stars show propensities and dictate probabilities, but the future is never entirely predictable. And we do have free will.”\u003c/p\u003e\n\u003cp\u003e“If those people hadn’t been killed, and if I’d just gone on home-“\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Well, I’d be here having this conversation, and you’d tell me what a close shave I’d had, and I’d figure it for just so much starshine. I’d had a feeling, but I would have forgotten all about it. So I’d look at you and say, ‘Yeah, right,’ and turn the page.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-list-keller-2/page-19.html","bookId":2313,"creation":"Oct 5, 2019 6:18:38 PM","modification":"Oct 5, 2019 6:18:38 PM"}
