{"id":105316,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJonesy\u0027s eyes went to hers. With her heels on, they were about the same height.\u003c/p\u003e\n\u003cp\u003e\"Saving you from this dumbass!\" Jonesy said like, obviously. He folded his arms across a chest ripped with muscles from working all summer as a yard slave like the rest of us.\u003c/p\u003e\n\u003cp\u003eJohn and I were right behind Jonesy when Brody, Diego, Carson and Brett showed up.\u003c/p\u003e\n\u003cp\u003eThis couldn\u0027t get any worse if I\u0027d choreographed the whole tamale myself. I did a mental forehead slap and shifted my gaze to Jade. I wanted to know her position when Brett was in attendance. I didn\u0027t put anything past his weaselly carcass.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t take a brain surgeon to see he\u0027d picked up on the tension. Both mine and Jonesy\u0027s. I saw Brett drink in the sight of Jade and my heart sped. We\u0027d managed the first two months of school pretty good without any problems. But now, the school quarter was coming to an end and we just couldn\u0027t seem to slide by without an altercation with these clowns.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need saving, if you hadn\u0027t noticed. Remember, you\u0027re the one that wants to go out with whatever,\" Sophie said disdainfully and leaned back against Buddy, who was a good shot taller than her... and Jonesy.\u003c/p\u003e\n\u003cp\u003eA vein in Jonesy\u0027s temple kept time with his heartbeat. He looked at Sophie for a long moment and I could see him trying to calm down with an effort. Restraint wasn\u0027t a Jonesy strong point.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the problem here, Buddy?\" Carson asked, all smirk.\u003c/p\u003e\n\u003cp\u003eJonesy wrecked it again by saying, \"It\u0027s your Buddy here, ya know, your butt-buddy? He\u0027s making the moves on Soph... and I don\u0027t think he\u0027s good for her.\"\u003c/p\u003e\n\u003cp\u003eCarson\u0027s eyes narrowed and he came forward. \"And you\u0027re so great for her, Jones. Right? Cuz, how I see it, you\u0027ll go out with anything that\u0027s female with two legs.\" His eyebrows raised to his hairline.\u003c/p\u003e\n\u003cp\u003eHe had him there. Carson was a supreme dick, but that was Jonesy, non-committer extraordinaire.\u003c/p\u003e\n\u003cp\u003e\"No comment, Jones?\" Buddy asked, talking for the first time, voice laced with sarcasm.\u003c/p\u003e\n\u003cp\u003eThunder rode Jonesy\u0027s face, the dark skin of his face taking on a purple hue.\u003c/p\u003e\n\u003cp\u003eSophie huffed and crossed her arms.\u003c/p\u003e\n\u003cp\u003eTiff saved Jonesy\u0027s face by sidling up to Carson and saying, \"Don\u0027t you have your own dick to scorch off or something? Hell,\" she swung her arm around to encompass the whole group of brainiacs, \"you could probably do the whole group in like... five seconds.\"\u003c/p\u003e\n\u003cp\u003eCarson moved toward her. And since Tiff so didn\u0027t know when to quit she continued as she was backing up, \"I mean, a pile of millimeter sausages like you queers would be rudimentary for you?\" Her gum snapped, momentarily blinding her because of size. She was brought up short by John, who\u0027d moved behind her protectively. His long fingers wrapped her upper arms.\u003c/p\u003e\n\u003cp\u003e\"Tiff... quiet,\" John said in a low voice above her head.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay, Terran. Carson can\u0027t do anything, he\u0027d get his pecker in a twist for sure,\" she said, supremely confident.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t, because I didn\u0027t think Carson gave a shit. After all, daddy would bail his ass out no matter what he did.\u003c/p\u003e\n\u003cp\u003eCarson got right up in Terran\u0027s grill and Tiff had a bird\u0027s-eye view of his chest. Her head leaned into John\u0027s chest and she turned her face away.\u003c/p\u003e\n\u003cp\u003e\"Keep the corpse-lover in line, Terran. Or I\u0027m gonna rethink my position on female beating. Maybe she needs to find out first hand what kinda junk I carry?\" He leaned down close to her face and whispered with menace, \"Up close package patrol for you, right?\"\u003c/p\u003e\n\u003cp\u003eJohn\u0027s face became a mask of rage, his cool demeanor replaced by heat. He pulled Tiff back and even I could see Carson had rattled her cage. No small feat.\u003c/p\u003e\n\u003cp\u003eShe recovered, unfortunately. \"I wouldn\u0027t do you with my dog\u0027s dick, Hamilton. Keep your pathetic parts in your pants.\"\u003c/p\u003e\n\u003cp\u003eCarson moved toward her again and John put Tiff behind him as Brett grabbed Carson\u0027s arm. \"Not worth it, man. Just take a chunk out of her brother\u0027s ass. Hell, she\u0027s got five. Pick one,\" Brett said with his logic.\u003c/p\u003e\n\u003cp\u003eBrett-logic was so flawed.\u003c/p\u003e\n\u003cp\u003eJade spoke and I died a little as the males from this group trained their eyes on my girl. My beautiful, vulnerable girl.\u003c/p\u003e\n\u003cp\u003e\"Listen, let\u0027s just... agree to disagree,\" she started.\u003c/p\u003e\n\u003cp\u003eDiego laughed. \"Your friend just told us we had no dicks. Not gonna get over it fast, sweetheart.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure she didn\u0027t mean it,\" Jade said weakly.\u003c/p\u003e\n\u003cp\u003eTiff snapped her gum. \"Totally. Meant. It.\"\u003c/p\u003e\n\u003cp\u003eWow.\u003c/p\u003e\n\u003cp\u003eThe bell shrilled and Carson gave Tiff a grim look, then turned his eyes to Jonesy. \"You don\u0027t have territory rights here, Jones. She doesn\u0027t want you. Go hump some willing girl, you\u0027re good at that.\"\u003c/p\u003e\n\u003cp\u003eI saw the knife dig deep on Sophie\u0027s face. I didn\u0027t believe that Jonesy was having sex with a bunch of girls. He was a female appreciator though. That last had been for Sophie\u0027s benefit. If Carson could cause trouble in our group, he was all for it. The jackass.\u003c/p\u003e\n\u003cp\u003eBuddy gave a slow stroke on Sophie\u0027s arm and she gave Jade the thumb signal for a pulse in the future, her face carefully neutral. Like she hadn\u0027t just heard that Jonesy was a man-whore. Jade nodded, her face solemn.\u003c/p\u003e\n\u003cp\u003eThey walked off, Jonesy\u0027s eyes trained on Sophie\u0027s back. I didn\u0027t think he was watching her butt. Unless that included Buddy\u0027s hand in her pocket.\u003c/p\u003e\n\u003cp\u003eCarson glanced over his shoulder, pegging Tiff with a look. She smoldered back at him in anger and he smirked, disappearing into the crowd.\u003c/p\u003e\n\u003cp\u003eJohn\u0027s eyes met mine over Tiff\u0027s head. Only two months into sophomore year and already a fire was burning.\u003c/p\u003e\n\u003cp\u003eGuess who the match was?\u003c/p\u003e\n\u003cp\u003eCHAPTER 2\u003c/p\u003e\n\u003cp\u003eI walked Jade to her next class, my mind turning over the events of Jonesy and Sophie. My arm was around Jade\u0027s shoulders, slowing my stride to match hers.\u003c/p\u003e\n\u003cp\u003eShe had her hand on my bare forearm, lightly stroking it, breaking my concentration she said, \"You can\u0027t fix it, Caleb.\"\u003c/p\u003e\n\u003cp\u003eBusted.\u003c/p\u003e\n\u003cp\u003eI looked down at her with a small smile, the door to Language Arts coming into view. \"Yeah,\" I sighed, \"I know. But.. \" I looked deeply into those green eyes like swimming pools and swallowed, \"just, I don\u0027t want you saying anything to him. He\u0027s spoiling to take care of that tard Buddy... what you said today...\"\u003c/p\u003e\n\u003cp\u003eWe stopped and she turned into me, her hands wrapping my flesh... she was getting a lot of what I was feeling. We\u0027d been working on me blocking some of my emotions from her with some success. But when I was feeling something hard enough, she usually got some overflow.\u003c/p\u003e\n\u003cp\u003eI finished my thought, \"... it just gets him all fired up.\"\u003c/p\u003e\n\u003cp\u003eShe stroked my skin again and my eyes fell into hers, drowning. She made me want to start kissing her right in the hallway.\u003c/p\u003e\n\u003cp\u003eShe smiled.\u003c/p\u003e\n\u003cp\u003e\"Knock it off, vixen.\"\u003c/p\u003e\n\u003cp\u003eShe laughed and replied, \"Just putting some moves on you.\"\u003c/p\u003e\n\u003cp\u003eI released the breath that I\u0027d been holding and kissed the top of her forehead. Keeping my lips against her skin I said, \"Just cut him some slack. He\u0027s gotta realize on his own that he cares about her.\"\u003c/p\u003e\n\u003cp\u003eShe nodded, pulling away. \"I know. But sometimes Jonesy needs a little push to see what the rest of us are seeing.\" She shrugged and I watched her sexy top slide a little further off her shoulder, balanced on there precariously. I was thinking about what was underneath the material.\u003c/p\u003e\n\u003cp\u003eShe giggled, blushing. \"Stop,\" she mock slapped my arm and I grinned. She gave me a peck on my mouth and I wrapped my hand on the back of her head, pressing her mouth harder into mine then reluctantly releasing her.\u003c/p\u003e\n\u003cp\u003eShe turned out of the circle of my arms and walked into English without me. My arms felt empty without her in them.\u003c/p\u003e\n\u003cp\u003eI went to class, my friends\u0027 romantic entanglements swirling in my head like messy fog.\u003c/p\u003e\n\u003cp\u003eI walked up the exposed aggregate walkway, passing underneath the rafters of the atrium that signaled the entrance to my house and saw a flash of black in the window.\u003c/p\u003e\n\u003cp\u003eOnyx.\u003c/p\u003e\n\u003cp\u003eI smiled, he was faithful. Somehow he knew when I was going to be getting home from school. Some kind of weird dog-wisdom.\u003c/p\u003e\n\u003cp\u003eThe Dog smelled a change in the air, lifting his nose and scenting expectantly. His Boy would be coming through the portal that sometimes opened but he could not see through. The Dog looked studiously at the light level that filtered in through the holes that did not open and sensed that the time was near for his arrival. He stood, stretching from the stiffness of relaxing and caught sight of the fragrant mass that the Boy would throw for him and picked it up, mindful of the sharp things inside his mouth. Soft mouth was important. He was not sure why, but the directive was firmly ingrained. He trotted to the narrow hole that did not open and waited.\u003c/p\u003e\n\u003cp\u003eThe Boy would arrive soon.\u003c/p\u003e\n\u003cp\u003eWag-thunk-wag.\u003c/p\u003e\n\u003cp\u003eI saw Onyx had that gross dog toy and sighed. Mom just had to get a new one. The thing was gray and dingy from reuse, slobber... and whatever else.\u003c/p\u003e\n\u003cp\u003eI opened the door and Onyx dropped the toy at my feet. I chucked the thing down the hall and he tore after it.\u003c/p\u003e\n\u003cp\u003e\"Caleb?\" Mom asked.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" I said, already making my way to the kitchen. I could smell the banana bread from the foyer.\u003c/p\u003e\n\u003cp\u003eI slung my backpack on the hook in a maneuver to avoid a \"neatness rant\" and plopped down on one of the stools that lined the breakfast bar.\u003c/p\u003e\n\u003cp\u003eMom smiled and the light caught a hoop dangling from her ear. I smiled back. \"How was school?\" she asked, cutting off a hunk of the delicious bread, slathering it with butter and placing it in front of me.\u003c/p\u003e\n\u003cp\u003eI stood, walking to the dishwasher and feeling it. It was hot. I turned and went to the cabinet instead, picking out a fave cup. I walked over to the fridge and filled it with milk. I sat back down heavily.\u003c/p\u003e\n\u003cp\u003eMom\u0027s brows drew together as I shoveled half the slice in my mouth; no girlfriend around to impress and my stomach making the decisions for me.\u003c/p\u003e\n\u003cp\u003eMom grinned. \"What... not a good day?\"\u003c/p\u003e\n\u003cp\u003eI shrugged. Less was definitely more with Mom. \"It was okay. Jonesy kinda got into it with a butt-wipe from that group.\" I edited my language for her benefit with effort. It wasn\u0027t an easy pulse-switch to turn off but I was becoming expert, finally.\u003c/p\u003e\n\u003cp\u003e\"Oh... Carson and...?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Yeah, that\u0027s the one.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eI thought about how much she should know about Jonesy.\u003c/p\u003e\n\u003cp\u003eLess.\u003c/p\u003e\n\u003cp\u003e\"Ah... Sophie is dating this tard... \" she raised an eyebrow and I edited again, \"this mouth-breather named Buddy.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s surprising. I thought she had better discernment than that.\"\u003c/p\u003e\n\u003cp\u003eI shifted, uncomfortable, thinking of the AP sex. \"Ah... he\u0027s AP like her and Jonesy hasn\u0027t exactly been...\" I didn\u0027t know how to finish without making Jonesy into being a jerk. He actually was being one a little. Not that I\u0027d admit that to The Parents.\u003c/p\u003e\n\u003cp\u003eMom pursed her lips. \"I know Jonesy is in a run of... \" Mom paused and it made me stop eating.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t speechless or something, was she?\u003c/p\u003e\n\u003cp\u003e\"Experimentation,\" she finished.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if that\u0027s it. He just seems like he doesn\u0027t want to go out with just one girl.\"\u003c/p\u003e\n\u003cp\u003e\"Sowing his wild oats. Hmm?\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. \"No, Mom. He likes Sophie, he just doesn\u0027t like the idea of being tied down.\"\u003c/p\u003e\n\u003cp\u003e\"Well what type of girl is he dating?\"\u003c/p\u003e\n\u003cp\u003eSkanks. Edit: \"They\u0027re not as cool as Sophie.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s dealing with his baby sister right now too.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, Helen had her baby and now he\u0027s the built-in baby sitter.\"\u003c/p\u003e\n\u003cp\u003eYeah, he was so into it. Tiff was having a lot of fun with that.\u003c/p\u003e\n\u003cp\u003eI smiled and Mom said, \"Penny for your thoughts.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think he\u0027s much for the crappy diapers and screaming.\"\u003c/p\u003e\n\u003cp\u003e\"There is that,\" Mom said and we smiled at each other.\u003c/p\u003e\n\u003cp\u003eOnyx knocked my hand and I gave him his morsel for patiently waiting in his beg-spot.\u003c/p\u003e\n\u003cp\u003eThe Boy was the very best master, the Dog thought as he inhaled the deliciously warm People Food. It flooded his sensitive olfactory senses, springing them to life. A little drool began and the Dog tried to camouflage his excitement from the Alpha Female. She would punish the Dog for begging.\u003c/p\u003e\n\u003cp\u003eHe gave a small wag for the Boy.\u003c/p\u003e\n\u003cp\u003eI noticed Onyx\u0027s discreet wag and smiled. He just had to give a small signal of appreciation. I thought at him, good dog. And saw his mental dog wheels turning. Must-show-restraint.\u003c/p\u003e\n\u003cp\u003eMom interrupted my thoughts, \"judo today.\"\u003c/p\u003e\n\u003cp\u003eI nodded, thinking, judo every day but the weekend. Sometimes I wondered if it was worth it. But then I\u0027d think back on my life and know that without some basic training, I wouldn\u0027t have been able to defend myself.\u003c/p\u003e\n\u003cp\u003eJade.\u003c/p\u003e\n\u003cp\u003eI frowned as I stood with my plate and cup. \"Hey Mom?\"\u003c/p\u003e\n\u003cp\u003eShe turned and looked at me, her hands already washing the bread pan, the soapy water sliding off and uncovering her wedding ring.\u003c/p\u003e\n\u003cp\u003e\"What kinda progress has Dad made on that restraining order for Jade\u0027s dad?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/death-screams-death-4/page-2.html","bookId":2492,"creation":"Oct 5, 2019 10:46:03 PM","modification":"Oct 5, 2019 10:46:03 PM"}
