{"id":105338,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGarcia got down on his knees, staring intently. \"Tell me.\"\u003c/p\u003e\n\u003cp\u003eJade tucked a hair behind her ear, looking shamefaced. \"I don\u0027t know a name.\"\u003c/p\u003e\n\u003cp\u003eGarcia exhaled in a frustrated rush.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Jade said, her lip trembling.\u003c/p\u003e\n\u003cp\u003eI came forward. Garcia wasn\u0027t going to bully Jade just because she didn\u0027t have all the answers.\u003c/p\u003e\n\u003cp\u003e\"I know the impression,\" she said hesitatingly. \"I\u0027ve felt it somewhere before. I recognize it.\"\u003c/p\u003e\n\u003cp\u003eHe stood, planting his hands on his hips, legs spread, brows furrowed. \"But no name?\"\u003c/p\u003e\n\u003cp\u003e\"I have a face,\" Buddy interrupted. \"Obviously,\" he added.\u003c/p\u003e\n\u003cp\u003eYou fight a guy and ya tend to remember it pretty well. The face. Before it becomes unrecognizable. Like Brett\u0027s, I thought with mild satisfaction.\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t know who he is?\" Gale asked, standing beside Garcia.\u003c/p\u003e\n\u003cp\u003e\"Nah.\"\u003c/p\u003e\n\u003cp\u003eGarcia flipped open the notebook, pen poised. \"Description?\"\u003c/p\u003e\n\u003cp\u003eBuddy crossed his arms over his chest and shrugged. \"Maybe five-nine, two hundred...\" he combed a frustrated hand through his hair.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it? Big guy,\" Garcia said, indicating a Santa Claus belly with his hands.\u003c/p\u003e\n\u003cp\u003eBuddy shook his head. \"No way, this dude was solid.\"\u003c/p\u003e\n\u003cp\u003e\"Two hundred pounds?\" Garcia asked, doubting. \"That\u0027s what I weigh.\"\u003c/p\u003e\n\u003cp\u003eBuddy looked at him. \"Me too. What, we\u0027re both six foot? That\u0027s about right. This guys spends time at the gym. Real time.\"\u003c/p\u003e\n\u003cp\u003eGarcia made a low sound in the back of his throat, insulted. Obviously he spent some time at the gym too.\u003c/p\u003e\n\u003cp\u003eBuddy corrected Garcia\u0027s assumption with, \"No, like a couple hours a day. He knows martial arts too, hand to hand, the works.\"\u003c/p\u003e\n\u003cp\u003eGarcia\u0027s eyes narrowed on him. \"How old are you...?\"\u003c/p\u003e\n\u003cp\u003e\"Buddy Hughes,\" he said, supplying his name.\u003c/p\u003e\n\u003cp\u003eGarcia waited.\u003c/p\u003e\n\u003cp\u003e\"Senior,\" he said.\u003c/p\u003e\n\u003cp\u003eGarcia began at his feet and when he got to the top of his head he said, \"How\u0027d you manage to be Johnny-on-the-spot here?\"\u003c/p\u003e\n\u003cp\u003eBuddy looked at Sophie and said, \"I was waiting for Sophie. We\u0027re goin\u0027 out.\"\u003c/p\u003e\n\u003cp\u003eGarcia looked at Jonesy and he took that as his cue to leave, having been quiet this whole time. Subdued. Very un-Jonesy like.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m gonna take off,\" Jonesy said, looking at Sophie one more time. \"You gonna be okay?\" he asked her.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Buddy\u0027s here, it\u0027s okay Jonesy.\"\u003c/p\u003e\n\u003cp\u003eJonesy\u0027s eyes tightened but he nodded, looking at me and Jade and gave us a guy salute then he was out the door.\u003c/p\u003e\n\u003cp\u003eBuddy watched him go with something like relief.\u003c/p\u003e\n\u003cp\u003eJade watched him go with knowledge in her eyes. I didn\u0027t have to be an Empath to see his frustration, his concern over her nearness to danger. He wore it all the time now. Buddy saw it too.\u003c/p\u003e\n\u003cp\u003eGarcia watched the empty doorway where Jonesy had exited, missing nothing. Every dynamic of the group was naked to his knowing eyes.\u003c/p\u003e\n\u003cp\u003e\"So Buddy?\" Garcia began, pen poised. \"You spend some time on the mat?\"\u003c/p\u003e\n\u003cp\u003e\"Enough,\" he shrugged.\u003c/p\u003e\n\u003cp\u003eGarcia turned to me, \"Didn\u0027t you guys get into a scrape not long ago?\"\u003c/p\u003e\n\u003cp\u003eWe nodded, saying nothing and he snorted out a laugh. The dead techs frowned at him. \"What was so funny?\" their expressions said.\u003c/p\u003e\n\u003cp\u003eHe sobered up. \"Not chatty about it?\"\u003c/p\u003e\n\u003cp\u003eWe shook our heads. \"Fine,\" he said.\u003c/p\u003e\n\u003cp\u003eSophie stood, with Jade\u0027s help. \"I can help with the description.\"\u003c/p\u003e\n\u003cp\u003eGarcia\u0027s face lightened. \"What can you add?\"\u003c/p\u003e\n\u003cp\u003e\"Well, he kinda looks like every dude. He\u0027s a...\"\u003c/p\u003e\n\u003cp\u003eJohn was outside in the hall and said loudly, \"Nondescript.\"\u003c/p\u003e\n\u003cp\u003eSophie looked at him. \"What he said.\"\u003c/p\u003e\n\u003cp\u003eGarcia went to the open door and closed it on Terran\u0027s face. Terran pressed his nose practically against the glass of the small window that bisected the door. I stifled a laugh.\u003c/p\u003e\n\u003cp\u003e\"But... he has a scar,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Great. That\u0027s a good detail to remember Sophie.\"\u003c/p\u003e\n\u003cp\u003eShe pointed to her temple and said, \"It\u0027s here,\" she pressed her finger very close to her eyebrow, \"and it\u0027s like a star.\"\u003c/p\u003e\n\u003cp\u003eGale frowned, inching away from the teacher\u0027s body that was being encased in the body bag behind her. \"Like an injury scar?\" she asked and I looked at her quickly, that was kind of a brilliant leap of logic.\u003c/p\u003e\n\u003cp\u003eSophie shook her head. \"No, it was perfect, like it was made.\"\u003c/p\u003e\n\u003cp\u003eGarcia palmed his chin, thinking. Finally, he tapped his pen to his notepad and made it disappear into his pocket.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve pulsed your parents, Sophie,\" Gale said. She turned her attention to Buddy. \"I couldn\u0027t reach your guardians.\"\u003c/p\u003e\n\u003cp\u003eWe all waited for Buddy to speak.\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Been emancipated for going on two years now. Out on my own.\"\u003c/p\u003e\n\u003cp\u003e\"Really? That\u0027s a very independent situation you have there Mr. Hughes.\"\u003c/p\u003e\n\u003cp\u003eThey stared at each other. I was starting to get that Buddy Hughes was a self-contained guy. He didn\u0027t rush in to fill those awkward silences where the other person waited for you to talk. He just didn\u0027t.\u003c/p\u003e\n\u003cp\u003eIn other circumstances, I thought we might have been friends.\u003c/p\u003e\n\u003cp\u003eGarcia opened his mouth to say something more but Gale interrupted, \"Look Raul, let\u0027s have the kids go home.\"\u003c/p\u003e\n\u003cp\u003e\"Is there gonna be someone assigned to Sophie?\" Buddy asked.\u003c/p\u003e\n\u003cp\u003eGood question, I thought.\u003c/p\u003e\n\u003cp\u003eGarcia nodded. \"Protocol. Although she is no longer a minor, there was an attempt on her life.\"\u003c/p\u003e\n\u003cp\u003eThe nurse walked up to Garcia. \"I need to speak to you privately for a moment.\"\u003c/p\u003e\n\u003cp\u003eGarcia held up a finger and said, \"Just a sec, kids.\"\u003c/p\u003e\n\u003cp\u003eThey walked over to a corner, speaking intently to each other for a few minutes. We shifted our weight, none of us talking. Jade and Sophie\u0027s eyes kept turning to the shroud of black plastic zipped over Proctor. Sophie\u0027s eyes welled with tears that ran over her wounded face. Buddy pulled her in against him, stroking her hair flat, where it would bounce back as soon as his palm left it.\u003c/p\u003e\n\u003cp\u003eGarcia walked back over to the group, a troubled expression on his face.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"The depressant...\"\u003c/p\u003e\n\u003cp\u003eWe nodded.\u003c/p\u003e\n\u003cp\u003e\"Miss Connolly here, administered it to take you kids out of realm. That\u0027s not really its intended purpose.\"\u003c/p\u003e\n\u003cp\u003eJade asked, \"Isn\u0027t it supposed to suppress paranormal ability during sleep?\"\u003c/p\u003e\n\u003cp\u003eHe nodded slowly. \"Yes. But when,\" he looked at Randi, \"she got help, the nurse knew that if you were already using your Astral Projection ability, already engaged, as it were, that it would take you out of it, quickly.\"\u003c/p\u003e\n\u003cp\u003eHe watched us make sense of it.\u003c/p\u003e\n\u003cp\u003e\"So, if you\u0027re not using but you\u0027re asleep, it keeps you from using it. But if you are using it stops it mid-use?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eSo, it was like a weapon. You could inject that crap in a gun and hit somebody with it and it\u0027d halt their ability.\u003c/p\u003e\n\u003cp\u003eAlmost Null-like.\u003c/p\u003e\n\u003cp\u003ePowerful. And not good. If that stuff got passed for more than a depressant used for suppression during sleep, there\u0027d be a buttload of misuses. Abuse. Exploitation.\u003c/p\u003e\n\u003cp\u003eThe Graysheets would love it.\u003c/p\u003e\n\u003cp\u003eNifty little drug. An inhibitor and suppressant, both.\u003c/p\u003e\n\u003cp\u003eOkay interesting but, so what?\u003c/p\u003e\n\u003cp\u003eThe nurse looked really uncomfortable. Finally, she said what the problem was, nailing us with the horribleness of it, \"There is a residual of twenty-four hours.\"\u003c/p\u003e\n\u003cp\u003eWell shit, maybe it wasn\u0027t what I was thinking.\u003c/p\u003e\n\u003cp\u003eIt was.\u003c/p\u003e\n\u003cp\u003e\"Both Buddy and Sophie will be vulnerable tonight for sleep. They may go into realm, beyond realm, to a Point of Acquisition. If the attacker were to meet them there... \" she let the sentence trail off. Then continued, \"It\u0027s not safe for either of you to sleep tonight,\" she said, looking into their eyes, hers full of worry. \"We can\u0027t give you a stimulant, it will be dangerous with the depressant already in your system. I\u0027m sorry. I did what I needed to so I could get you out of realm. Unfortunately, now you are still in danger.\"\u003c/p\u003e\n\u003cp\u003eShe looked at Garcia. \"Do you have a Null on staff? Somebody that can watch over the kids?\" She gave Buddy a considering look. \"Young adults,\" she corrected.\u003c/p\u003e\n\u003cp\u003eGarcia thought about it, giving me a surreptitious glance.\u003c/p\u003e\n\u003cp\u003eSmith, we were both thinking. He\u0027d been a helluva Null.\u003c/p\u003e\n\u003cp\u003eOf course, he\u0027d been a lot more than that.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I think I can find somebody.\"\u003c/p\u003e\n\u003cp\u003eHe looked at Buddy and Sophie. \"You two will have to be together tonight. No arguments.\" He looked at Sophie, seeing the damage to her face, his expression softening. \"Let him stay at your place. You\u0027re younger and there is no one living with him,\" Garcia jerked a thumb at Buddy and I got the feeling that Garcia wasn\u0027t thrilled with him. He should have thought he was great, saving the day and all, but Garcia was slow to trust.\u003c/p\u003e\n\u003cp\u003eProbably a good way to be.\u003c/p\u003e\n\u003cp\u003eCHAPTER 19\u003c/p\u003e\n\u003cp\u003e\"That\u0027s quite a story, Caleb,\" Dad said, his stare telling me that there may be more to it.\u003c/p\u003e\n\u003cp\u003eI threw my hands up while Mom bustled around in the kitchen, getting the last of supper on the table.\u003c/p\u003e\n\u003cp\u003e\"I swear, for once, I didn\u0027t have anything to do with it.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me, his stare level. \"It\u0027s extremely alarming that Sophie was attacked. And the depressant they\u0027re using... \" Dad shook his head, mildly disgusted.\u003c/p\u003e\n\u003cp\u003e\"What Dad? We all got the dose last week. I thought you were for it.\"\u003c/p\u003e\n\u003cp\u003eDad nodded. \"In theory I think it\u0027s a stupendous advancement. But that\u0027s not what this nurse told you,\" he took off his reading glasses and began cleaning them with the end of his work shirt. \"What she\u0027s advocating is something that works in a latent context, inert. It\u0027s duality makes it dangerous. Take the case in point.\" He finished, indicating the problem with Sophie and Buddy needing a Null to stand watch in case the attacker tried for her again.\u003c/p\u003e\n\u003cp\u003eMom plopped down on the bench, putting her chin in her hands, elbows on the table, foot swinging a mile a minute. \"If I were Sophie\u0027s mom I\u0027d want some assurance that horrible attacker couldn\u0027t enter her... realm?\" she asked like a question and I nodded. She had it right.\u003c/p\u003e\n\u003cp\u003e\"And the teacher dead,\" Mom shook her head sadly. \"It\u0027s a tragedy. That someone can enter another person\u0027s realm and whatever they inflict manifests on their body.\" Mom shuddered.\u003c/p\u003e\n\u003cp\u003eIt was worth a shudder.\u003c/p\u003e\n\u003cp\u003e\"Die in realm, die in life,\" I said cryptically and Mom frowned. I shrugged, it was the truth. And it was taught in Sophie\u0027s class.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" Mom remembered. \"Sensei Anderson phoned.\"\u003c/p\u003e\n\u003cp\u003ePulsed, I translated.\u003c/p\u003e\n\u003cp\u003e\"And he wanted to remind you that lessons will resume next week. You remember he was getting the dojo overhauled?\" She asked, popping a hot bite of mashed potato in her mouth and doing the food juggle.\u003c/p\u003e\n\u003cp\u003eI did remember but I thought it\u0027d been scheduled for next week and told her that.\u003c/p\u003e\n\u003cp\u003eShe dismissed me with a hand. \"I think I am pretty capable of keeping track of things, Caleb. It was always next week.\"\u003c/p\u003e\n\u003cp\u003eDad raised his eyebrows. \"We know you\u0027re capable, Ali.\"\u003c/p\u003e\n\u003cp\u003eThey exchanged a look and I rolled my eyes.\u003c/p\u003e\n\u003cp\u003eParents.\u003c/p\u003e\n\u003cp\u003eSometimes they were so lame they sucked the oxygen out of the universe. My universe.\u003c/p\u003e\n\u003cp\u003eI stood after giving Onyx a covert morsel. I walked my dishes over to the sink and jerked on the hot water, scraping the respective scraps into their proper place. Mom thought she was training me. But what it really was is I was training her not to hassle me every time I did the boring daily crap.\u003c/p\u003e\n\u003cp\u003eI turned and she had a look of pride on her face.\u003c/p\u003e\n\u003cp\u003eWho knew separating the trash was such a big deal?\u003c/p\u003e\n\u003cp\u003eI grabbed Onyx\u0027s disgusting ball and headed for the door to throw it in the forty degree weather. It was fall but winter was coming, the temperature hovering above freezing. Rain would drive down what wanted to fall as snow but without the commitment. Typical Kent weather. I thought about that. We\u0027d get six months of this then spring would come.\u003c/p\u003e\n\u003cp\u003eI threw on a hoodie with Onyx at my heels.\u003c/p\u003e\n\u003cp\u003eIt smelled like rain, a storm coming.\u003c/p\u003e\n\u003cp\u003eI had that right.\u003c/p\u003e\n\u003cp\u003ePrincipal Chen cruised back and forth on the stage. All black and in mourning even when one of her teachers hadn\u0027t just got creamed by a whack-job.\u003c/p\u003e\n\u003cp\u003eShe was extolling his virtues and I hadn\u0027t known him so I was kinda unfazed. And secretly thrilled I wasn\u0027t being called to raise him or any exciting crap like that. It would\u0027ve sucked balls.\u003c/p\u003e\n\u003cp\u003eSophie sat next to Buddy, with dark circles under her eyes. Well, eye, that was. The other one was a slit, the side of her face pretty bashed looking. I had a hard time wrapping my mind around a man doing that to a girl. There were a lot of guys that felt that way. Some that didn\u0027t. Jade sat at my right and Jonesy on my left. He\u0027d been awfully quiet since yesterday. Jade held hands with me and Sophie. Jade had been at Sophie\u0027s last night. Which had made me vaguely uneasy. It didn\u0027t make sense that I would worry. Buddy was there, a Null that was a cop and Jade wasn\u0027t AP but somehow, I didn\u0027t like it. \u003c/p\u003e","sourceLink":"https://allnovel.net/death-screams-death-4/page-26.html","bookId":2492,"creation":"Oct 5, 2019 10:46:03 PM","modification":"Oct 5, 2019 10:46:03 PM"}
