{"id":105344,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI looked at Garcia, his patience on thin ice. \"Yeah, it was a tomahawk.\"\u003c/p\u003e\n\u003cp\u003eHe inclined his head as if he\u0027d already known that. \"Anyway, if Brett hadn\u0027t struck first,\" he shrugged his shoulders, \"it would have been bad for you.\"\u003c/p\u003e\n\u003cp\u003eDad looked at him, his brows jacked down over his eyes. \"I am sorry, this is so confusing to me.\"\u003c/p\u003e\n\u003cp\u003eMy dad was never confused about anything. Gramps looked on with interest.\u003c/p\u003e\n\u003cp\u003e\"How is my son, in a position of defense for his life against a known felon, in any way compromised by his actions? Further, he is able to use whatever is at his disposal to protect his physical body and those around him. Unless I misunderstand my constitutional rights?\" Dad straightened.\u003c/p\u003e\n\u003cp\u003eGarcia waited and Gramps said, \"Yeah, that about sums it up.\"\u003c/p\u003e\n\u003cp\u003eGarcia sighed. \"That is how it will work with Brett. The weapon is illegal, his use to defend himself... not. But it leaves us in a conundrum. He used a weapon he should not have had access to. He then used it to murder the attacker. It is clear cut. He will be punished for the possession, not the use.\" He paused then gave me cop eyes. \"But you... you\u0027re different. You will set a precedence, Caleb. You and your zombies. Parker\u0027s zombies too.\"\u003c/p\u003e\n\u003cp\u003eHe looked at my folks and they shifted their weight. He had them in the cross hairs. \"Your boy has a powerful weapon at his disposal. If he were to fall into the wrong hands,\" he turned his attention to me, \"or decide on a different life path, it could end badly. And let\u0027s face the facts here, Caleb. Zombies are not inanimate objects to be wielded. They move, they breathe, they think, somehow. They could be assassins.\"\u003c/p\u003e\n\u003cp\u003eI thought of Clyde and all that he was.\u003c/p\u003e\n\u003cp\u003eAll that he was becoming.\u003c/p\u003e\n\u003cp\u003eGarcia was right. I had the potential Arsenal of Assassins for use.\u003c/p\u003e\n\u003cp\u003eFor hire.\u003c/p\u003e\n\u003cp\u003e\"Our son is not like that, Officer Garcia,\" Mom said in a deeply offended tone.\u003c/p\u003e\n\u003cp\u003eHis eyes shifted to hers. \"It may not be up to him, Mrs. Hart.\" His eyes traveled back to me. \"Someday you could command many and someone could command what you control. It\u0027s not simple.\"\u003c/p\u003e\n\u003cp\u003eNo shit Sherlock.\u003c/p\u003e\n\u003cp\u003eGramps said, \"What are we talking here?\"\u003c/p\u003e\n\u003cp\u003e\"Graysheets,\" Gale whispered.\u003c/p\u003e\n\u003cp\u003eThey\u0027d made a try for me twice this year. But without a kidnapping. Only warnings.\u003c/p\u003e\n\u003cp\u003eTheir executions of said warnings needed work.\u003c/p\u003e\n\u003cp\u003e\"Parker\u0027s got something up his sleeve, I\u0027ll admit it. But it\u0027s speculation as to what.\" I shrugged.\u003c/p\u003e\n\u003cp\u003e\"The only good thing that came of this was we know who the DI is,\" Gale said.\u003c/p\u003e\n\u003cp\u003eI guess there was that.\u003c/p\u003e\n\u003cp\u003e\"Duly noted,\" Gramps said for me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m your friend here, Caleb. I just want you aware of how close this came to you being in irrevocable trouble.\"\u003c/p\u003e\n\u003cp\u003eI nodded, I was getting that.\u003c/p\u003e\n\u003cp\u003e\"I think I want to go talk to Brett,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not a good idea,\" Dad said immediately.\u003c/p\u003e\n\u003cp\u003eI shook my head. \"If he hadn\u0027t been watching out for Jade,\" my words squeezing out from between my teeth, \"she might be dead. He saved her. As much as I hate his ass,\" I looked at Mom, daring her to correct my language but she was still shell shocked, \"because I do. He deserves my thanks. And I did rip off his life force.\" I shrugged.\u003c/p\u003e\n\u003cp\u003eThat had to suck balls.\u003c/p\u003e\n\u003cp\u003eMom said quietly, \"I feel sorry for him, Kyle.\"\u003c/p\u003e\n\u003cp\u003eDad looked at her in surprise. But her stare was all for me, standing tears in her eyes. I couldn\u0027t begin to understand what about Brett could make her sad.\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027ll be his first visitor, Caleb,\" she said, answering my unspoken question.\u003c/p\u003e\n\u003cp\u003eI let that sink home.\u003c/p\u003e\n\u003cp\u003eHis friends hadn\u0027t come.\u003c/p\u003e\n\u003cp\u003eHis family.\u003c/p\u003e\n\u003cp\u003eNobody came.\u003c/p\u003e\n\u003cp\u003eI nodded, decision made.\u003c/p\u003e\n\u003cp\u003eAs I walked away Garcia called my name and I turned back. \"I have to know.\" He stared at me and I watched him think about his words. \"How many do you think you could raise, Caleb. How many zombies?\"\u003c/p\u003e\n\u003cp\u003eI thought about how much power it took to subdue myself so I could raise just one zombie when the whole graveyard pulsed in response to the call. The zombies coming to my distress. Not needing any juice from Tiff or Jade anymore. How my ability simmered underneath the surface of who I was in a constant river of power. The current sure and swift.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to respond but it was Gramps that said it best, \"Legion,\" he said as an absolute.\u003c/p\u003e\n\u003cp\u003eGale\u0027s eyes widened and Garcia nodded with resignation, unsurprised by the answer.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t refute Gramps\u0027 tally. As markers went, it was dead accurate.\u003c/p\u003e\n\u003cp\u003eNo pun intended.\u003c/p\u003e\n\u003cp\u003eI headed to Brett\u0027s room, gratefulness and resentment combining in a sour play of emotions, the cheeseburgers a churning lump in my stomach.\u003c/p\u003e\n\u003cp\u003eCHAPTER 23\u003c/p\u003e\n\u003cp\u003e\"Hart,\" Brett croaked out a greeting as I came in, the door shutting itself behind me.\u003c/p\u003e\n\u003cp\u003eThe first thing I noticed was he looked like shit. His skin was ashen, the platinum blond of his hair making it appear more washed out, not less. His eyes looked like two black piss holes in a snow bank.\u003c/p\u003e\n\u003cp\u003eI restrained a grimace and walked over to his bedside.\u003c/p\u003e\n\u003cp\u003eWe stared at each other uncomfortably for several seconds.\u003c/p\u003e\n\u003cp\u003eFinally, I said, \"Thanks, man.\"\u003c/p\u003e\n\u003cp\u003eHis eyebrows rose.\u003c/p\u003e\n\u003cp\u003e\"Ya know, for saving Jade.\"\u003c/p\u003e\n\u003cp\u003eSlight color rose on his cheeks. \"Yeah, it was no big deal. I was just there. I wasn\u0027t gonna let that asshole lay hands on her again.\"\u003c/p\u003e\n\u003cp\u003eRight, I thought, my bullshit meter singing a tune to beat the band.\u003c/p\u003e\n\u003cp\u003eSome of what I thought must\u0027ve shown on my face because he pressed his lips together. \"Listen, don\u0027t bust my balls, Hart. I know she\u0027s your girlfriend. Hell, you all but brand her in the hall every day.\"\u003c/p\u003e\n\u003cp\u003eI do? I scowled at that.\u003c/p\u003e\n\u003cp\u003e\"But I live close, I got a bead on LeClerc. I knew he was getting ready to do something.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re no precog, Mason,\" I stated.\u003c/p\u003e\n\u003cp\u003eHe nodded, the first genuine smile of the day appearing on his bloodless lips. \"True. But that\u0027s the difference between you and me, Hart. I\u0027ve learned through hard lessons when violence is coming. I\u0027ve read the signs. I don\u0027t need no paranormal skills to see.\" He tapped the side of his head. \"I got built in radar right here.\"\u003c/p\u003e\n\u003cp\u003eI thought of his dad beating the tar out of him, the gophers attacking daddy dearest on the front lawn. Yeah, he might have a small point.\u003c/p\u003e\n\u003cp\u003eOr a big one.\u003c/p\u003e\n\u003cp\u003e\"The cops said you\u0027d been watching her house for months.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Yeah. I always kept Jade in my sights.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I asked, frustration leaking out of my voice.\u003c/p\u003e\n\u003cp\u003e\"Girls like Jade, they don\u0027t go for dudes like me. But,\" he made serious eye contact, \"she was one of the only people that was nice to me when things turned to shit at the house. The only one. I never forgot, Hart. Never.\"\u003c/p\u003e\n\u003cp\u003eI took in his expression. I could see he hadn\u0027t.\u003c/p\u003e\n\u003cp\u003eSwell.\u003c/p\u003e\n\u003cp\u003e\"So the cops said I was in trouble for the weapon. But not the deed.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Yeah, you lucked out.\" I paused for a second, \"You okay with... all this.\"\u003c/p\u003e\n\u003cp\u003eThe murder.\u003c/p\u003e\n\u003cp\u003eHe nodded slowly. \"Yeah I am. He was a fuck. He would\u0027ve killed Jade. Ya got that, right?\"\u003c/p\u003e\n\u003cp\u003eI did, my eyes told him so.\u003c/p\u003e\n\u003cp\u003eI shrugged. \"Well, he killed Andrea but only because he got to her first. And you saw Mia?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e\"Broke her nose, punched her face,\" I said, thinking of her beauty being covered in battery, a patchwork quilt of abuse. An image of LeClerc as my zombie to torture came as an unbidden image again. I shook it off with regret.\u003c/p\u003e\n\u003cp\u003eBrett closed his eyes for a second then opened them. \"He deserved it.\"\u003c/p\u003e\n\u003cp\u003eI nodded in perfect agreement.\u003c/p\u003e\n\u003cp\u003e\"Okay, well, that\u0027s all I wanted to tell ya,\" I said, walking away.\u003c/p\u003e\n\u003cp\u003e\"Hart,\" he called in a hoarse voice.\u003c/p\u003e\n\u003cp\u003eI turned, my hand on the door, my foot in the hallway.\u003c/p\u003e\n\u003cp\u003e\"Your zombie did okay,\" his eyes were steady.\u003c/p\u003e\n\u003cp\u003eTranslation: you\u0027re not a total dick.\u003c/p\u003e\n\u003cp\u003eI nodded and left.\u003c/p\u003e\n\u003cp\u003eAn uneasy truce established. Did it give me relief? Make me feel like our shit together was done?\u003c/p\u003e\n\u003cp\u003eNot on your life.\u003c/p\u003e\n\u003cp\u003eOr death.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t three days until Jade came back to school, it was four. I stuck to her like a wart on her sexy booty (not that her hotness could ever have a blemish). She looked weak and it made me sick and anxious, not necessarily in that order. LeClerc\u0027s death should have made me feel she was safer. Instead it had heightened something primal deep within me and I\u0027d learned to listen to that warning.\u003c/p\u003e\n\u003cp\u003eThrough hard experience.\u003c/p\u003e\n\u003cp\u003eIt was completely creepy that Jade, Sophie and Mia were sporting a ton of bruises and cuts on their faces. The story swirled around the school in a siege of gossip that swept away talk of anything else.\u003c/p\u003e\n\u003cp\u003eEverything else.\u003c/p\u003e\n\u003cp\u003eThank God there were only three days this week. Thanksgiving made the usual lame Monday feel like Wednesday.\u003c/p\u003e\n\u003cp\u003eI was constantly feeling like I needed to bash heads. Everyone was so insensitive. They\u0027d see Jade walk by, weak, pale and battered and whisper. I wanted to tear their heads off and shit down their throats.\u003c/p\u003e\n\u003cp\u003eA Gramps-ism I really believed in.\u003c/p\u003e\n\u003cp\u003eInstead, I stood by her while she was beyond embarrassment, mortified. She was alone and vulnerable. Her aunt gone, her dad dead, his status of abuser and murderer firmly established forever in the archives of KPH gossip. A legacy that Jade had to shoulder.\u003c/p\u003e\n\u003cp\u003eBut not without me.\u003c/p\u003e\n\u003cp\u003eThe worst part was that she couldn\u0027t live in her own house until the probate people figured it all out. They said as much as a half year. Meanwhile, she was hangin\u0027 at Sophie\u0027s.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter that she was emancipated. She was still in school, her high school education negating her ability to live independently. That meant foster care. Those knuckle-draggin\u0027-mouth breathers didn\u0027t care about the trauma she\u0027d just experienced. To them, she was a sixteen-year old girl that needed to be placed within the Kent School District. Period, end of discussion.\u003c/p\u003e\n\u003cp\u003eJade didn\u0027t know where she\u0027d live. Neither did I. It drove me crazy. Her future determined by adults that didn\u0027t know her, didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eWe walked down the hall together, her body tucked against mine, my arm around her waist. She didn\u0027t say hi to anyone or look at them. They were leaking their communal feelings all over her. We got to her Empath Core and she turned to me. \"I want to go back to my house, Caleb.\"\u003c/p\u003e\n\u003cp\u003eI put a finger under her chin and held it softly while I looked into her eyes. \"We can go together, Jade.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d been having panic attacks about the beating and one looked like it was comin\u0027 on. She breathed deeply, evenly, trying to stave it off. \"I want to get my stuff. My dream catcher.\"\u003c/p\u003e\n\u003cp\u003eI raised an eyebrow. Of all the things she could get from her room, I wouldn\u0027t have thought that would be the priority.\u003c/p\u003e\n\u003cp\u003eShe nodded, feeling my questions burning a pathway through our skin connection. \"I can\u0027t stay at Sophie\u0027s forever. They\u0027re gonna place me, then I\u0027ll have to go somewhere... \" her eyes slid away from mine but then they flicked back. \"It\u0027s always helped me sleep. I don\u0027t have dreams when it\u0027s there.\"\u003c/p\u003e\n\u003cp\u003e\"Are you having nightmares, Jade?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Oh yeah.\" Her eyes full of fear.\u003c/p\u003e\n\u003cp\u003eI stroked her hair, careful to miss the scalp laceration. \"Okay,\" I whispered against her hair, \"we\u0027ll get it tonight.\" I pulled away, the vanilla smell of her a taste in my nose and stared at her until she smiled. \"Okay,\" she responded on a shaky exhale.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be okay Jade,\" I said.\u003c/p\u003e\n\u003cp\u003eOf course it was gonna be okay.\u003c/p\u003e\n\u003cp\u003eIt was later when we were so far from okay words were not sufficient.\u003c/p\u003e\n\u003cp\u003eI was complacent in the immediate threats having been neutralized.\u003c/p\u003e\n\u003cp\u003eDumb.\u003c/p\u003e\n\u003cp\u003e\"Pass the taters!\" Jonesy shouted, from the far reaches of Gramps\u0027 old table. I was guessing he had all four leaves in the sucker, it was about fifteen feet long right now.\u003c/p\u003e\n\u003cp\u003eGramps frowned and Helen said, \"Ask correctly or starve.\" She had baby Micah balanced on her shoulder, doing an alarming bounce maneuver while Micah\u0027s small head jiggled around and she looked ready to spew something gross somewhere.\u003c/p\u003e\n\u003cp\u003eI gulped. Disgusting. Babies, barfing... the noise. Then there was the whole feeding thing. Uber-awkward.\u003c/p\u003e\n\u003cp\u003eI watched as the potato bowl was lugged through a bunch of hands to Jonesy, who scooped his second helping onto a plate that had two slabs of turkey and four rolls piled up on it already.\u003c/p\u003e\n\u003cp\u003eMom sighed. She wasn\u0027t for gluttony. I wasn\u0027t sure why since she\u0027d had to cave to my Feeding Needs awhile ago.\u003c/p\u003e\n\u003cp\u003eI watched Jonesy as he Worked the Food. This was a special ritual in which he added just the right amount of grated cheese, real butter, salt, freshly ground pepper and sour cream in an unseemly blob in the middle. He then rotated the whole sloppy mess into some kind of a crooked tower and began shoveling. It was a conversation stopper. \u003c/p\u003e","sourceLink":"https://allnovel.net/death-screams-death-4/page-32.html","bookId":2492,"creation":"Oct 5, 2019 10:46:03 PM","modification":"Oct 5, 2019 10:46:03 PM"}
