{"id":105347,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe came into the cave that contained the enemy pack of feral and instantly felt the injury to the Boy. With primal glee he was able to sense many injuries, small and large, to the alien pack.\u003c/p\u003e\n\u003cp\u003eThe Dog wagged his tail. That was very good. He looked up at the Dead One. He was a fierce Alpha, the Dog would wait for his signal.\u003c/p\u003e\n\u003cp\u003eWhen it came, the Dog would be ready.\u003c/p\u003e\n\u003cp\u003eI watched Onyx wag his tail and shook my head slightly, I couldn\u0027t believe my eyes.\u003c/p\u003e\n\u003cp\u003eIt couldn\u0027t get any weirder but then Clyde asked, \"What assistance do you require, Master?\"\u003c/p\u003e\n\u003cp\u003eAnd my mind screamed Jade, help Jade. But he couldn\u0027t. I could raise a thousand zombies but she was somewhere I couldn\u0027t rescue her.\u003c/p\u003e\n\u003cp\u003eClyde got it though. \"Where is the one that would dispatch the young women?\"\u003c/p\u003e\n\u003cp\u003eI pointed to the bars where Skinny-Smoker stood, his pistol drawn, his other hand holding his chest where I\u0027d jammed him with the locked gun. Clyde moved toward him with fluid grace, his stride never breaking.\u003c/p\u003e\n\u003cp\u003eHe wore his old-fashioned, three piece suit like a uniform, the suit open to reveal a vest that was buttoned up, a long chain for his watch winking softly under the LED\u0027s that had automatically pulsed on as darkness descended.\u003c/p\u003e\n\u003cp\u003eOne of the Graysheets came forward and Gramps said, \"Can\u0027t take them all, Caleb!\"\u003c/p\u003e\n\u003cp\u003eHe had the puppy held on two of the Graysheets while a third lay bleeding out on the mat where I had practiced a thousand times. But that left Skinny-Smoker and the one that came toward Clyde, a switchblade sprung and ready in one hand and a small pistol in the other hand.\u003c/p\u003e\n\u003cp\u003eHe got a shot off as Clyde came and the slug struck him in the torso, tearing the material of his vest, shredding it as it entered.\u003c/p\u003e\n\u003cp\u003eI ran forward as Gramps yelled, \"Stay put, Caleb.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t much for listening. I grabbed a fistful of the back of Clyde\u0027s suit and my power surged through him.\u003c/p\u003e\n\u003cp\u003eThat\u0027s when I felt it.\u003c/p\u003e\n\u003cp\u003eTiff had barreled into me like a caboose on the corpse train, lending me her juice so I could do Clyde.\u003c/p\u003e\n\u003cp\u003eI did.\u003c/p\u003e\n\u003cp\u003eLeveling our combined power and shoving it into him with a guttural surge that caused him to stumble, Clyde righted himself as the agent tossed the gun, shells expended. He spun back, jabbing the knife into Clyde\u0027s chest cavity.\u003c/p\u003e\n\u003cp\u003eClyde grunted softly as I poured more juice into him, desperately trying to mend the damage as it happened. Clyde encircled the agent\u0027s windpipe with his hand, lifting him to his tiptoes.\u003c/p\u003e\n\u003cp\u003eHe met his fingers around the agents neck and squeezed. I could hear the vertebrae grind against one another in a futile attempt at resistance. Then, succumbing to the pressure, they were crushed to dust inside the column of flesh.\u003c/p\u003e\n\u003cp\u003eClyde, being a practical man in life, was one in death as well. Turning the dead agent, he used him as a meat shield of sorts, the head bobbing around grotesquely. When Skinny-Smoker began shooting at Clyde, he plugged the dead agent instead. Tiff and I moved with him, behind him.\u003c/p\u003e\n\u003cp\u003eWhen he reached Skinny-Smoker, Clyde hit the gun that Skinny held and there was a sharp crack as it smacked into one of the mirrors, the shattering glass raining down on the floor.\u003c/p\u003e\n\u003cp\u003eClyde threw a wicked punch and Skinny-Smoker deflected it smoothly. I came around the side of Clyde and the agent\u0027s eyes followed me, turning his attention to me instead of Clyde.\u003c/p\u003e\n\u003cp\u003e\"As long as I don\u0027t kill you, I\u0027m in the clear,\" he said, swinging at me and I felt the air press against me as I narrowly avoided it. I began my offensive jabs right away and he should have buckled under the weight of the onslaught, his nasty smoking habit making him weak.\u003c/p\u003e\n\u003cp\u003eHe was not, he did not.\u003c/p\u003e\n\u003cp\u003eSkinny-Smoker whirled with a roundhouse style kick on Clyde, making him pinwheel his arms backward into Tiff. They hit the floor together in an ungainly pile.\u003c/p\u003e\n\u003cp\u003eI faced Skinny-Smoker just as Onyx launched himself on his exposed forearm, the suit long shredded. Onyx sunk his teeth into his bare flesh and Skinny howled in pain.\u003c/p\u003e\n\u003cp\u003eBut mainly frustration. In a smooth move, he landed his opposite fist on Onyx\u0027s head and Onyx slid down to the floor. Hurt.\u003c/p\u003e\n\u003cp\u003eHe hurt my dog.\u003c/p\u003e\n\u003cp\u003eJade was in danger.\u003c/p\u003e\n\u003cp\u003eThose thoughts collided together and adrenaline and death got tangled together in a body numbing surge of energy.\u003c/p\u003e\n\u003cp\u003eMy zombie was struggling off of Tiff and I looked at Skinny-Smoker.\u003c/p\u003e\n\u003cp\u003eI charged. The tension of the day like an oil slick on fire, the flame a thing of unending heat and destruction.\u003c/p\u003e\n\u003cp\u003eHe met my charge with one of his own and we grappled. Our sizes were similar but he didn\u0027t have his girlfriend in jeopardy as a motivator.\u003c/p\u003e\n\u003cp\u003eOr a zombie that was becoming something else.\u003c/p\u003e\n\u003cp\u003eClyde pulled him off of me and tossed him by the seat of his pants into the one mirror that was unbroken.\u003c/p\u003e\n\u003cp\u003eHe crashed into it, a shard of glass the size of a ruler, stabbing him through the chest, one end sticking out of his back.\u003c/p\u003e\n\u003cp\u003eSlick with blood and other things.\u003c/p\u003e\n\u003cp\u003eHis mouth opened in an \"O\" of surprise. He fell backwards, tumbling to his back. As we watched the shard pushed through in reverse, gutting him again. His hands wrapped around it but he died as we watched.\u003c/p\u003e\n\u003cp\u003eThe Telekinetic agent used the distraction of his fallen comrade to throw the puppy across the room. John, too tired to keep a hold on both the Null and the Telekinetic, looked at me, \"Sorry Caleb.\" His face a solemn as the tomb.\u003c/p\u003e\n\u003cp\u003eSpeaking of which, Clyde faced the two agents, trying to protect me from them as Gramps launched himself at the Null.\u003c/p\u003e\n\u003cp\u003eI realized it was the guy who had almost had his arm hacked off by the Skopamish.\u003c/p\u003e\n\u003cp\u003eIt was working pretty well now as he began to try and beat the snot out of Gramps.\u003c/p\u003e\n\u003cp\u003eI wanted to protect him but had the Telekinetic to deal with.\u003c/p\u003e\n\u003cp\u003eI let my power go, sliding into the dead agent with the glass poking out of his chest.\u003c/p\u003e\n\u003cp\u003eI was betting he was as good of a fighter dead as alive.\u003c/p\u003e\n\u003cp\u003eHis eyes sprung open finding mine immediately. He sat bolt upright, tearing the shard of glass out of his chest and launching it like a torpedo at the Telekinetic.\u003c/p\u003e\n\u003cp\u003eSee how that works? I thought wildly.\u003c/p\u003e\n\u003cp\u003eIt made a meaty sound as it struck the Telekinetic. Who with a shocked gasp, turned his energy on the agent that was now my zombie, flinging him into the framework from the mirror that had been shattered.\u003c/p\u003e\n\u003cp\u003eThe Telekinetic held him pinned there like a macabre butterfly while he writhed around.\u003c/p\u003e\n\u003cp\u003eGramps beat the Null into the ground, the knuckles of his big hands shredded. He scooped up the puppy and twirled it around like a baton and made a quick jab at the back of the Telekinetic\u0027s head.\u003c/p\u003e\n\u003cp\u003eHe slid to the floor. Out.\u003c/p\u003e\n\u003cp\u003eSkinny-Smoker stood at the ready.\u003c/p\u003e\n\u003cp\u003eWaiting.\u003c/p\u003e\n\u003cp\u003eHis dead gaze trained on me, his devotion obvious. I turned my back on his stare.\u003c/p\u003e\n\u003cp\u003eGramps turned to me and I sucked in my breath when I saw the mess of his face. Then I looked at the floor. The Null was a bloody pulp.\u003c/p\u003e\n\u003cp\u003e\"Gramps, get Jade awake!\" I pointed to the Camaro and he ran out there. Using the but of his puppy, he jammed it against the glass and Clyde and I moved forward.\u003c/p\u003e\n\u003cp\u003eIt was Archer that grabbed my ankle.\u003c/p\u003e\n\u003cp\u003e\"Help me get over there and I\u0027ll get you to the guy.\"\u003c/p\u003e\n\u003cp\u003eI looked at the bars and realized they were locked. Even Clyde couldn\u0027t tear them open.\u003c/p\u003e\n\u003cp\u003eBut he could and did drag Archer up by his armpits.\u003c/p\u003e\n\u003cp\u003eWe hauled him over to the prison type bars and he held his palm out, swiping it against the plate sized pulse pad. It slid open with a whisper and a hiss.\u003c/p\u003e\n\u003cp\u003eWe moved toward Sensei Anderson, murder in our step.\u003c/p\u003e\n\u003cp\u003eSensei Anderson\u003c/p\u003e\n\u003cp\u003eThe agent looked at the delectably vulnerable girls that stood before him, dressed in clothes their subconscious\u0027s had fashioned for them and nearly sighed.\u003c/p\u003e\n\u003cp\u003eTo finally be allowed to cause suffering amongst the weak and vulnerable. To know the girlfriend of Caleb, who had been abused in the past, to taste her fear like subtle and fine wine upon his tongue was an aphrodisiac of the highest order.\u003c/p\u003e\n\u003cp\u003eHe moved toward them, the fear from his approach clenching the lovely features of the diminutive and finely sculpted Jade. He would have her underneath him and begging for mercy momentarily.\u003c/p\u003e\n\u003cp\u003eThe other agents would be holding the boy and dispatching whom they deemed necessary. By the time they discovered his treason, the young women would be beaten and broken dolls, simple vessels for his abuse and release.\u003c/p\u003e\n\u003cp\u003eHe moved toward them with a light heart.\u003c/p\u003e\n\u003cp\u003eJade\u003c/p\u003e\n\u003cp\u003eJade\u0027s heart lay broken. She would never say goodbye to Caleb, she would suffer and die in this place of abject neutrality, never seeing anyone she cared about again. Sophie alongside her. Permanently gone.\u003c/p\u003e\n\u003cp\u003ePermanently.\u003c/p\u003e\n\u003cp\u003eShe could feel his evil from where she and Sophie stood shaking and terrified. She knew what he planned. It was a mercy that she could not inadvertently convey it to Sophie.\u003c/p\u003e\n\u003cp\u003eThen Jade saw Buddy slide out of the mist of the wall and tackle the judo teacher from behind.\u003c/p\u003e\n\u003cp\u003eThey grappled. When Anderson caught sight of Buddy he yelled, \"What are you doing? You\u0027re supposed to be protecting Parker!\"\u003c/p\u003e\n\u003cp\u003eWhat? Jade thought, stunned.\u003c/p\u003e\n\u003cp\u003eSophie and she looked at each other, then back at the fight.\u003c/p\u003e\n\u003cp\u003eBuddy was not who he said he was. He brought that to light when he screamed back, his hand buried in Anderson\u0027s hair, delivering a knee to his chiseled gut, \"I can\u0027t let you kill her!\"\u003c/p\u003e\n\u003cp\u003eThey fought. Sensei Anderson, or whoever he was, systematically tearing down Buddy\u0027s defenses, crippling him slowly.\u003c/p\u003e\n\u003cp\u003e\"No!\" Sophie shrieked and rushed Sensei.\u003c/p\u003e\n\u003cp\u003e\"No Sophie!\" Jade screamed, trying to catch her as she ran away, grabbing air instead.\u003c/p\u003e\n\u003cp\u003eSensei anticipated her so smoothly it made Jade ill. He hit Sophie once and she fell, her slender body crumpling to the softness of the floor of realm. Buddy was a broken and bleeding heap at her feet.\u003c/p\u003e\n\u003cp\u003eAnderson looked at Jade. \"Now where were we? Oh yes, I was going to rape you.\"\u003c/p\u003e\n\u003cp\u003eHe gave her a chilling smile and with a last kick in Buddy\u0027s ribs he made his way to Jade.\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003e\"Hart!\" Alex shouted.\u003c/p\u003e\n\u003cp\u003eI turned, my hands itching to grab a hold of a mentor turned attacker.\u003c/p\u003e\n\u003cp\u003eBuddy\u0027s nose moved and became crooked as I watched, blood spouting from both nostrils. Bruises appeared, peppering his skin as we stared.\u003c/p\u003e\n\u003cp\u003e\"Caleb!\" John shouted. \"You\u0027ve got to kill him. If the girls aren\u0027t woken up, he\u0027ll get to them.\"\u003c/p\u003e\n\u003cp\u003eWe stared at each other, the window open to the elements. Jonesy peered in, holding Sophie\u0027s head in his lap, her face having a new welt swelling on her temple.\u003c/p\u003e\n\u003cp\u003e\"Please Caleb,\" he said, naked terror in his eyes. \"Kill his ass.\"\u003c/p\u003e\n\u003cp\u003eWe turned, my decision made.\u003c/p\u003e\n\u003cp\u003eDeath Intent beat in my brain, its rhythm true.\u003c/p\u003e\n\u003cp\u003eJade\u003c/p\u003e\n\u003cp\u003eJade screamed and ran. His hands wrapped her from behind before she had begun to turn. She could feel the strength in them and was so afraid she felt her bladder burn for release. He turned her around, tearing the straps from her gown as he did and she screamed, her mouth filling with air and screaming again, one on top of the other.\u003c/p\u003e\n\u003cp\u003eUntil he hit her.\u003c/p\u003e\n\u003cp\u003eShe saw stars as he fumbled with her dress, tearing it down to her waist, her upper body naked before him. She lay there stunned as he tore at his pants.\u003c/p\u003e\n\u003cp\u003eSuddenly, when she was utterly without hope, he began to fade, his body becoming transparent. Then she heard someone trying to call her name.\u003c/p\u003e\n\u003cp\u003eHe sounded so worried.\u003c/p\u003e\n\u003cp\u003eShe knew that voice.\u003c/p\u003e\n\u003cp\u003eShe opened her eyes and the attacker was gone and Caleb\u0027s grandpa looked down at her, shaking her shoulder.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003e\"Ouch!\" she yelped.\u003c/p\u003e\n\u003cp\u003e\"Little Missy! Thank everything in heaven,\" Mac said, shaky.\u003c/p\u003e\n\u003cp\u003eHe drew her up into his arms and lifted her out of the car like she weighed nothing, carrying her to where the others were gathered.\u003c/p\u003e\n\u003cp\u003eBroken glass bits glittered on the top of her puffy like dull jewels.\u003c/p\u003e\n\u003cp\u003eJade looked up into her savior\u0027s eyes and realized he was badly beaten.\u003c/p\u003e\n\u003cp\u003eShe also realized she was alive.\u003c/p\u003e\n\u003cp\u003eJade wept.\u003c/p\u003e\n\u003cp\u003eCHAPTER 27\u003c/p\u003e\n\u003cp\u003eI saw Gramps bring Jade in about the same time that I saw Sophie stir in Jonesy\u0027s arms.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t even make a pretense of being indifferent.\u003c/p\u003e\n\u003cp\u003eStreaming tears ran down his dark face, his hands clutching her against him as he kissed her face everywhere, missing only the darkening bruise at her temple.\u003c/p\u003e\n\u003cp\u003e\"Got her!\" Gramps said, holding Jade close to his chest.\u003c/p\u003e\n\u003cp\u003eI swung my attention back to Sensei too late.\u003c/p\u003e\n\u003cp\u003eHe was awake and gave me a jab to my vulnerable neck. It would have been a killing blow if Clyde had not broken his hand blocking it.\u003c/p\u003e\n\u003cp\u003eBut zombies don\u0027t feel pain and there wasn\u0027t a blow torch handy so we were in luck.\u003c/p\u003e\n\u003cp\u003eI crouched as another jab, intended for my head, missed its mark and I struck my foot out in an inelegant and unbalanced move toward his knee.\u003c/p\u003e\n\u003cp\u003eIt worked and he fell, grabbing my forearm as he went down. I rolled into the maneuver with practiced smoothness.\u003c/p\u003e\n\u003cp\u003eFighting your teacher was a little like a chess game you couldn\u0027t win. I didn\u0027t know anything but what he\u0027d taught me and he was outmaneuvering me. Alex was down, Gramps had Jade, John was useless physically and Clyde\u0027s hand was wrecked. \u003c/p\u003e","sourceLink":"https://allnovel.net/death-screams-death-4/page-36.html","bookId":2492,"creation":"Oct 5, 2019 10:46:03 PM","modification":"Oct 5, 2019 10:46:03 PM"}
