{"id":5793,"no":5,"title":"Chapter 5","content":"5:1 [hgb]\u0026nbsp; 推 罗 王 希 兰 ， 平 素 爱 大 卫 。 他 听 见 以 色 列 人 膏 所 罗 门 ， 接 续 他 父 亲 作 王 ， 就 差 遣 臣 仆 来 见 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Hiram king of Tyre sent his servants unto Solomon; for he had heard that they had anointed him king in the room of his father: for Hiram was ever a lover of David. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Now Hiram, king of Tyre, hearing that Solomon had been made king in place of his father, sent his servants to him; for Hiram had ever been a friend to David. \n\u003cbr\u003e5:2 [hgb]\u0026nbsp; 所 罗 门 也 差 遣 人 去 见 希 兰 ， 说 ：\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Solomon sent to Hiram, saying, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Solomon sent back word to Hiram, saying, \n\u003cbr\u003e5:3 [hgb]\u0026nbsp; “ 你 知 道 我 父 亲 大 卫 因 四 围 的 争 战 ， 不 能 为 耶 和 华 他 神 的 名 建 殿 ， 直 等 到 耶 和 华 使 仇 敌 都 服 在 他 脚 下 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou knowest how that David my father could not build an house unto the name of the LORD his God for the wars which were about him on every side, until the LORD put them under the soles of his feet. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You have knowledge that David my father was not able to make a house for the name of the Lord his God, because of the wars which were round him on every side, till the Lord put all those who were against him under his feet. \n\u003cbr\u003e5:4 [hgb]\u0026nbsp; 现 在 耶 和 华 我 的 神 使 我 四 围 平 安 ， 没 有 仇 敌 ， 没 有 灾 祸 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But now the LORD my God hath given me rest on every side, so that there is neither adversary nor evil occurrent. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But now the Lord my God has given me rest on every side; no one is making trouble, and no evil is taking place. \n\u003cbr\u003e5:5 [hgb]\u0026nbsp; 我 定 意 要 为 耶 和 华 我 神 的 名 建 殿 ， 是 照 耶 和 华 应 许 我 父 亲 大 卫 的 话 说 ， 我 必 使 你 儿 子 接 续 你 坐 你 的 位 ， 他 必 为 我 的 名 建 殿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And, behold, I purpose to build an house unto the name of the LORD my God, as the LORD spake unto David my father, saying, Thy son, whom I will set upon thy throne in thy room, he shall build an house unto my name. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And so it is my purpose to make a house for the name of the Lord my God, as he said to David my father, Your son, whom I will make king in your place, will be the builder of a house for my name. \n\u003cbr\u003e5:6 [hgb]\u0026nbsp; 所 以 求 你 吩 咐 你 的 仆 人 在 利 巴 嫩 为 我 砍 伐 香 柏 木 ， 我 的 仆 人 也 必 帮 助 他 们 ， 我 必 照 你 所 定 的 ， 给 你 仆 人 的 工 价 。 因 为 你 知 道 ， 在 我 们 中 间 没 有 人 像 西 顿 人 善 于 砍 伐 树 木 。 ”\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Now therefore command thou that they hew me cedar trees out of Lebanon; and my servants shall be with thy servants: and unto thee will I give hire for thy servants according to all that thou shalt appoint: for thou knowest that there is not among us any that can skill to hew timber like unto the Sidonians. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So now, will you have cedar-trees from Lebanon cut down for me, and my servants will be with your servants; and I will give you payment for your servants at whatever rate you say; for it is common knowledge that we have no such wood-cutters among us as the men of Zidon. \n\u003cbr\u003e5:7 [hgb]\u0026nbsp; 希 兰 听 见 所 罗 门 的 话 ， 就 甚 喜 悦 ， 说 ， 今 日 应 当 称 颂 耶 和 华 。 因 他 赐 给 大 卫 一 个 有 智 慧 的 儿 子 ， 治 理 这 众 多 的 民 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And it came to pass, when Hiram heard the words of Solomon, that he rejoiced greatly, and said, Blessed be the LORD this day, which hath given unto David a wise son over this great people. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And these words of Solomon made Hiram glad, and he said, Now may the Lord be praised who has given to David a wise son to be king over this great people. \n\u003cbr\u003e5:8 [hgb]\u0026nbsp; 希 兰 打 发 人 去 见 所 罗 门 ， 说 ， 你 差 遣 人 向 我 所 提 的 那 事 ， 我 都 听 见 了 。 论 到 香 柏 木 和 松 木 ， 我 必 照 你 的 心 愿 而 行 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Hiram sent to Solomon, saying, I have considered the things which thou sentest to me for: and I will do all thy desire concerning timber of cedar, and concerning timber of fir. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then Hiram sent to Solomon, saying; The words you sent have been given to me: I will do all your desire in the question of cedar-wood and cypress-wood. \n\u003cbr\u003e5:9 [hgb]\u0026nbsp; 我 的 仆 人 必 将 这 木 料 从 利 巴 嫩 运 到 海 里 ， 扎 成 筏 子 ， 浮 海 运 到 你 所 指 定 我 的 地 方 ， 在 那 里 拆 开 ， 你 就 可 以 收 取 ， 你 也 要 成 全 我 的 心 愿 ， 将 食 物 给 我 的 家 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My servants shall bring them down from Lebanon unto the sea: and I will convey them by sea in floats unto the place that thou shalt appoint me, and will cause them to be discharged there, and thou shalt receive them: and thou shalt accomplish my desire, in giving food for my household. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My men will take them down from Lebanon to the sea, where I will have them corded together to go by sea to whatever place you say, and I will have them cut up there so that you may take them away; as for payment, it will be enough if you give me food for my people. \n\u003cbr\u003e5:10 [hgb]\u0026nbsp; 于 是 希 兰 照 着 所 罗 门 所 要 的 ， 给 他 香 柏 木 和 松 木 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So Hiram gave Solomon cedar trees and fir trees according to all his desire. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So Hiram gave Solomon all the cedar-wood and cypress-wood he had need of; \n\u003cbr\u003e5:11 [hgb]\u0026nbsp; 所 罗 门 给 希 兰 麦 子 二 万 歌 珥 ， 清 油 二 十 歌 珥 ， 作 他 家 的 食 物 。 所 罗 门 每 年 都 是 这 样 给 希 兰 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Solomon gave Hiram twenty thousand measures of wheat for food to his household, and twenty measures of pure oil: thus gave Solomon to Hiram year by year. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Solomon gave Hiram twenty thousand measures of grain, as food for his people, and twenty measures of clear oil; this he did every year. \n\u003cbr\u003e5:12 [hgb]\u0026nbsp; 耶 和 华 照 着 所 应 许 的 赐 智 慧 给 所 罗 门 。 希 兰 与 所 罗 门 和 好 ， 彼 此 立 约 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD gave Solomon wisdom, as he promised him: and there was peace between Hiram and Solomon; and they two made a league together. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Now the Lord had given Solomon wisdom, as he had said to him; and there was peace between Hiram and Solomon, and they made an agreement together. \n\u003cbr\u003e5:13 [hgb]\u0026nbsp; 所 罗 门 王 从 以 色 列 人 中 挑 取 服 苦 的 人 共 有 三 万 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And king Solomon raised a levy out of all Israel; and the levy was thirty thousand men. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then King Solomon got together men for the forced work through all Israel, thirty thousand men in number; \n\u003cbr\u003e5:14 [hgb]\u0026nbsp; 派 他 们 轮 流 每 月 一 万 人 上 利 巴 嫩 去 。 一 个 月 在 利 巴 嫩 ， 两 个 月 在 家 里 。 亚 多 尼 兰 掌 管 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he sent them to Lebanon, ten thousand a month by courses: a month they were in Lebanon, and two months at home: and Adoniram was over the levy. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And sent them to Lebanon in bands of ten thousand every month: for a month they were working in Lebanon and for two months in their country, and Adoniram was in control of them. \n\u003cbr\u003e5:15 [hgb]\u0026nbsp; 所 罗 门 用 七 万 扛 抬 的 ， 八 万 在 山 上 凿 石 头 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Solomon had threescore and ten thousand that bare burdens, and fourscore thousand hewers in the mountains; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then he had seventy thousand for the work of transport, and eighty thousand stone-cutters in the mountains; \n\u003cbr\u003e5:16 [hgb]\u0026nbsp; 此 外 ， 所 罗 门 用 三 千 三 百 督 工 的 ， 监 管 工 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Beside the chief of Solomon\u0027s officers which were over the work, three thousand and three hundred, which ruled over the people that wrought in the work. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In addition to the chiefs of the responsible men put by Solomon to oversee the work, three thousand and three hundred in authority over the workmen. \n\u003cbr\u003e5:17 [hgb]\u0026nbsp; 王 下 令 ， 人 就 凿 出 又 大 又 宝 贵 的 石 头 来 ， 用 以 立 殿 的 根 基 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the king commanded, and they brought great stones, costly stones, and hewed stones, to lay the foundation of the house. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; By the king\u0027s orders great stones, stones of high price, were cut out, so that the base of the house might be made of squared stone. \n\u003cbr\u003e5:18 [hgb]\u0026nbsp; 所 罗 门 的 匠 人 和 希 兰 的 匠 人 ， 并 迦 巴 勒 人 ， 都 将 石 头 凿 好 ， 预 备 木 料 和 石 头 建 殿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Solomon\u0027s builders and Hiram\u0027s builders did hew them, and the stonesquarers: so they prepared timber and stones to build the house. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Solomon\u0027s builders and Hiram\u0027s builders did the work of cutting them, and put edges on them, and got the wood and the stone ready for the building of the house.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/107/1538.html","bookId":187,"creation":"Aug 1, 2019 6:24:51 AM","modification":"Aug 1, 2019 6:24:51 AM"}
