{"id":88728,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut she was tired. She wanted to sleep.\u003c/p\u003e\n\u003cp\u003eShe tossed around for a while, forcing herself to lie still with her eyes closed, half listening to the television.\u003c/p\u003e\n\u003cp\u003eThen, head on the pillow, eyes closed, she felt a strange prickling sensation. She couldn’t pinpoint anything different about the air around her or the sounds she was hearing. It was an old house, and it creaked. But she knew every creak, and she wasn’t hearing anything she shouldn’t have been.\u003c/p\u003e\n\u003cp\u003eBut the sensation stayed with her.\u003c/p\u003e\n\u003cp\u003eShe felt as if she were a child again, frightened as she watched a spooky movie, closing her eyes…\u003c/p\u003e\n\u003cp\u003eIf this had been a movie, though, she would have felt compelled to open her eyes, but this was real life, and she fought the desire. If she kept her eyes closed, she would be all right. It would be like hiding beneath the bed or taking refuge in a closet.\u003c/p\u003e\n\u003cp\u003eI won’t. I won’t open my eyes, she thought. And it will go away.\u003c/p\u003e\n\u003cp\u003eBut the feeling didn’t go away, and finally she had to open her eyes and look into the shadows, just to prove that there was nothing there.\u003c/p\u003e\n\u003cp\u003eShe opened one eye slowly.\u003c/p\u003e\n\u003cp\u003eIf felt as if her blood congealed and her heart froze.\u003c/p\u003e\n\u003cp\u003eShe closed her eye again. She must have imagined what she thought she’d seen. A shadow. A shadow in the shape of a man. Standing at the end of the bed.\u003c/p\u003e\n\u003cp\u003eHer frozen heart began to thunder.\u003c/p\u003e\n\u003cp\u003eA normal response, she told herself, given that there was a killer on the loose.\u003c/p\u003e\n\u003cp\u003eThis was all nonsense, she thought. No one could possibly be there.\u003c/p\u003e\n\u003cp\u003eShe opened both eyes, bolting up to a sitting position at the same time.\u003c/p\u003e\n\u003cp\u003eSomeone was there.\u003c/p\u003e\n\u003cp\u003eA tall, solid, yet somehow shadowy figure standing at the foot of her bed.\u003c/p\u003e\n\u003cp\u003eChristina screamed and leapt out of bed, then practically flew out of the room.\u003c/p\u003e\n\u003cp\u003eShe raced to the door, out to the hall and down the stairs. She burst out the front door, onto the porch and leapt over the two steps that led to the ground. She ran until she reached the end of the driveway, and then she finally turned back, gasping, checking to see if he was in pursuit.\u003c/p\u003e\n\u003cp\u003eIt was difficult to see, though, because it was such a strange night. The fog was still lying low to the ground, while above, shimmering through with an illumination like silver, was the great orb of the full moon.\u003c/p\u003e\n\u003cp\u003eInstinct was kicking in. Fog or not, she would see him coming from the front of the house, and he clearly wasn’t in pursuit. But she didn’t have her keys. That was okay; she could just go next door to Tony’s house, and she would be safe.\u003c/p\u003e\n\u003cp\u003eIn her mind’s eye, she pictured the figure coming after her, catching her, tackling her right before she could reach Tony’s door.\u003c/p\u003e\n\u003cp\u003eThen there was a tap on her shoulder.\u003c/p\u003e\n\u003cp\u003eShe froze.\u003c/p\u003e\n\u003cp\u003eSpun around.\u003c/p\u003e\n\u003cp\u003eScreamed.\u003c/p\u003e\n\u003cp\u003eHe was there.\u003c/p\u003e\n\u003cp\u003eIt was impossible, but he was there. He’d somehow gotten out of the house without her seeing and ended up behind her.\u003c/p\u003e\n\u003cp\u003eAnd he wasn’t a shadow, either. Not only that, she had seen his face before.\u003c/p\u003e\n\u003cp\u003eIt took her a moment to remember where she had seen it, and when.\u003c/p\u003e\n\u003cp\u003eThen she knew.\u003c/p\u003e\n\u003cp\u003eShe had seen it, plastered all over the newspapers after Beau Kidd had been shot kneeling over the body of his latest victim.\u003c/p\u003e\n\u003cp\u003e“Christie…”\u003c/p\u003e\n\u003cp\u003eDid he say her name, or was it the breeze? Or was she only deep in some horrible nightmare where the dew-damp grass beneath her bare toes was ridiculously real and the face of the man before her was bizarrely vivid?\u003c/p\u003e\n\u003cp\u003e“Christie…”\u003c/p\u003e\n\u003cp\u003eThe world seemed to be fading, getting lost in the fog.\u003c/p\u003e\n\u003cp\u003e“Please…help me.”\u003c/p\u003e\n\u003cp\u003eShe had never passed out before in her life, but she did then, dropping flat onto soft, wet earth, seeing nothing but stygian darkness.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003e“H ey.”\u003c/p\u003e\n\u003cp\u003eChristina became aware of the deep, rich voice at the same time as she felt the chilling discomfort of the ground beneath her.\u003c/p\u003e\n\u003cp\u003eThe sun was rising, she realized, feeling completely disoriented.\u003c/p\u003e\n\u003cp\u003e“Christie?”\u003c/p\u003e\n\u003cp\u003eShe blinked. The sun created a haze as it burned off the last of the fog, so she blinked again, turning her head slightly to make out someone standing above her. For a moment she felt a resurgence of fear. But the sunlight was bright, and when she blinked a third time, her vision cleared and she finally saw who was standing there.\u003c/p\u003e\n\u003cp\u003eJed Braden.\u003c/p\u003e\n\u003cp\u003eHe hunkered down by her side.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” His tone was anxious, harsh.\u003c/p\u003e\n\u003cp\u003eShe realized that she was lying on her lawn and frowned.\u003c/p\u003e\n\u003cp\u003e“Are you hurt?” he demanded anxiously, his hands on her shoulders, his face close, his features tense.\u003c/p\u003e\n\u003cp\u003e“No, I’m not hurt. I’m fine.”\u003c/p\u003e\n\u003cp\u003eShe saw relief fill his face.\u003c/p\u003e\n\u003cp\u003e“Fine? Really?”\u003c/p\u003e\n\u003cp\u003e“Absolutely. I swear it.”\u003c/p\u003e\n\u003cp\u003e“Thank God you’re alive,” he murmured.\u003c/p\u003e\n\u003cp\u003eShe struggled to rise up on her elbows. “I guess I…fell asleep.”\u003c/p\u003e\n\u003cp\u003e“You’re joking, right?” he said. His voice hardened to a sharper edge. “You told me you were smart, remember? You said you didn’t do stupid things.”\u003c/p\u003e\n\u003cp\u003eShe stared at him. She must have had a nightmare. She couldn’t possibly have seen the ghost of Beau Kidd. There in the light of day, the idea was just too ridiculous. But she really was lying on the grass, so she really had run out of the house. And she had run because someone had been there. Hadn’t he?\u003c/p\u003e\n\u003cp\u003eShe blurted the words without thinking. “There was someone in my house.”\u003c/p\u003e\n\u003cp\u003eJed stared at her, slowly arching a brow. “Someone was in your house?” He sounded both concerned and doubtful.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eAnxiety tightened his features. “So someone broke in and chased you out, then…forced you to sleep on the ground?”\u003c/p\u003e\n\u003cp\u003eShe stared at him. “I’m telling you, there was a man at the foot of my bed.”\u003c/p\u003e\n\u003cp\u003e“But you’re also telling me you weren’t attacked, right?”\u003c/p\u003e\n\u003cp\u003e“No. He was just…there.”\u003c/p\u003e\n\u003cp\u003e“What was he doing?”\u003c/p\u003e\n\u003cp\u003e“Staring at me. I…felt him there, opened my eyes and saw him, then jumped up and ran out,” she explained.\u003c/p\u003e\n\u003cp\u003e“You locked up, right? You made sure you locked up after everyone left?”\u003c/p\u003e\n\u003cp\u003eHe stood then, and reached down to help her to her feet. He was in jeans, a knit polo shirt and a casual suede jacket, towering and at ease. “Christina, usually people run somewhere when they’re running away from danger. They don’t just curl up and go to sleep on the front lawn.”\u003c/p\u003e\n\u003cp\u003e“I didn’t just curl up and go to sleep!” she flashed angrily.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“Look, I’m not kidding.”\u003c/p\u003e\n\u003cp\u003e“Christie, bad things are happening,” he said softly, dark eyes on her like onyx. “This is no time to cry wolf.”\u003c/p\u003e\n\u003cp\u003e“I would never do that,” she said, her temper growing, her tone an aggrieved growl.\u003c/p\u003e\n\u003cp\u003e“All right, so exactly what happened?”\u003c/p\u003e\n\u003cp\u003e“I came running out here and…”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And I’m not sure.”\u003c/p\u003e\n\u003cp\u003eHis voice went very soft then. “You’re sure you weren’t molested in any way?”\u003c/p\u003e\n\u003cp\u003eWas she? She’d passed out cold. But she hadn’t been assaulted or anything. She was certain of it.\u003c/p\u003e\n\u003cp\u003e“No. I wasn’t hurt. I wasn’t even touched,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Okay, so this man broke into your house to stare at you and then did…what when you ran out? Ransacked the place?”\u003c/p\u003e\n\u003cp\u003eNo…somehow he moved faster than I did. He tapped me on the shoulder and scared me so badly I fainted. But she could hardly say that.\u003c/p\u003e\n\u003cp\u003eShe lowered her head, lashes falling, flushing. “I’m not sure.”\u003c/p\u003e\n\u003cp\u003e“Well, let’s take a look around, huh?” He strode toward the house. For a moment she stood watching him; then she hurried after him.\u003c/p\u003e\n\u003cp\u003e“Jed, what are you doing here, anyway?” she asked.\u003c/p\u003e\n\u003cp\u003e“I came over to have coffee with Ana, and then I saw you lying out here.” He motioned for her to stay on the porch, his face wearing a stern mask of warning.\u003c/p\u003e\n\u003cp\u003e“He could still be here,” he said, and it made sense—except that she knew he didn’t believe her that anyone had been there in the first place.\u003c/p\u003e\n\u003cp\u003eBut she knew he didn’t dare ignore her. He might think that she was crazy, that she’d had too much to drink while playing with the occult, but there was a killer in the area, and he couldn’t take chances.\u003c/p\u003e\n\u003cp\u003e“I think I’d be safer with you,” she called as he disappeared into the house. “In all those slasher movies, when the guy goes off and leaves the girl she ends up dead!”\u003c/p\u003e\n\u003cp\u003eThere was no answer.\u003c/p\u003e\n\u003cp\u003eShe stood nervously on the porch, feeling like a fool. Despite the fact that this was Florida, autumn was well on the way, and she was chilled, standing there in her damp cotton nightgown and bare feet.\u003c/p\u003e\n\u003cp\u003e“Jed?”\u003c/p\u003e\n\u003cp\u003eThere was still no answer. She looked around, since there was nothing else to do. The day was coming on nicely. By midafternoon, it would be hot. The sky was crystal-blue now, but no doubt this afternoon the thunderclouds would come rolling through.\u003c/p\u003e\n\u003cp\u003eJed returned at last, startling her out of her reverie as he stepped outside and shook his head. “Nothing. There’s no one in there now.”\u003c/p\u003e\n\u003cp\u003eShe let out a long breath. “Jed, it was real. He was real. I opened my eyes, and I saw a man standing at the foot of my bed.”\u003c/p\u003e\n\u003cp\u003e“We’ll walk through the house together,” he told her, the expression in his dark eyes an enigma. “You can see if anything is out of place.”\u003c/p\u003e\n\u003cp\u003eShe followed him into the house. “Upstairs first?” he suggested.\u003c/p\u003e\n\u003cp\u003eUpstairs, the rooms that her family had claimed in earlier days were empty and undisturbed. Even in her bedroom, everything looked normal. The sheets were tossed back, as they had been when she bolted, but everything else looked just as she had left it.\u003c/p\u003e\n\u003cp\u003e“Anything?” Jed asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003eHe stared at her. “You and Ana shouldn’t have been playing with that stupid Ouija board.”\u003c/p\u003e\n\u003cp\u003e“Oh, so now you believe in Ouija boards?” she said.\u003c/p\u003e\n\u003cp\u003e“No. But I do believe in the power of suggestion.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-10.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
