{"id":88731,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe unfolded the newspaper she’d bought and idly read the local section, noting all the advertisements for the Halloween-themed events taking place at the parks. She wondered idly if Dan was going to play Raccoon Ralph with fangs or dress up as Franken-coon.\u003c/p\u003e\n\u003cp\u003eAs she sat there, still looking at her paper, she suddenly realized that she wasn’t alone, that someone had joined her at the little table with the umbrella overhead.\u003c/p\u003e\n\u003cp\u003eThen it started.\u003c/p\u003e\n\u003cp\u003eA sense of chills like icy water sweeping down her spine.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to look up.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eShe felt as if she had to.\u003c/p\u003e\n\u003cp\u003eThe breeze stirred, and it was almost as if she felt a touch. A gentle, silken touch, nostalgic, poignant…\u003c/p\u003e\n\u003cp\u003eIt was the breeze, she told herself, and finally looked up.\u003c/p\u003e\n\u003cp\u003eShe exhaled, feeling like a fool. There was no one there.\u003c/p\u003e\n\u003cp\u003eSmiling in embarrassment at her own lunacy, she picked up her coffee and headed for her car. Ten minutes later, she turned down her street and pulled into her driveway.\u003c/p\u003e\n\u003cp\u003eThe moment she was inside, she felt it again. That terrible, chilling sensation. As if she was not alone. As if someone was with her, watching her.\u003c/p\u003e\n\u003cp\u003eThere’s no one here, she told herself. No one. This was the same silly thing that had happened at the coffee shop.\u003c/p\u003e\n\u003cp\u003eStill, she immediately stepped back outside. She wasn’t going in alone. She sat on the porch and tried Mike’s number first, but hung up when she got his answering machine. She tried Dan next, and he answered.\u003c/p\u003e\n\u003cp\u003e“What’s up, cuz?” he asked.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Watching TV, killing time till my evening shift,” he told her. Then, carefully, he asked, “Why?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Is there any chance you can come over?” she asked him.\u003c/p\u003e\n\u003cp\u003e“I guess. Why?” he asked again.\u003c/p\u003e\n\u003cp\u003e“I…it’s silly. I keep thinking someone is in the house,” she admitted.\u003c/p\u003e\n\u003cp\u003eHe was quiet for a minute. She heard him sigh. “Christie…are you afraid that Gran is haunting the house or something?”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“All right. I’ll be there in a few minutes.”\u003c/p\u003e\n\u003cp\u003eShe waited, wincing at the thought that she’d had to call her cousin to come over. But better to call him than do something stupid. Like go into a house where a murderer might be waiting.\u003c/p\u003e\n\u003cp\u003eDan made it to the house in record time. She rose from the porch steps as soon as he pulled up and got out of the car. “Let’s see what’s up, kid,” he said, stepping past her and entering the house. She followed him, but Dan was moving quickly. He cut a circular path through the ground floor, and she only caught up with him as he hurried up the stairs.\u003c/p\u003e\n\u003cp\u003eThere was no one downstairs, and not a sound—other than the old floorboards creaking beneath their feet—could be heard as they went to check the bedrooms.\u003c/p\u003e\n\u003cp\u003eOn the upstairs landing, Dan paused, hands on hips, staring at her. “Maybe you should sell this place,” he said softly.\u003c/p\u003e\n\u003cp\u003e“No way,” she said firmly. “Gran left me this place, and I’m not leaving.”\u003c/p\u003e\n\u003cp\u003eWith a groan, he checked the bedrooms one by one, then pulled down the stairs to the attic. It wasn’t a spooky attic; it was well used and even well lit. There was a rocker by the little window that now looked over the neighbor’s yard but had once offered a view of a sloping green hill. There were trunks and boxes, an old love seat and an overstuffed chair, and even a braided rug set between those so people could sit and play games.\u003c/p\u003e\n\u003cp\u003eIt had always been a family home.\u003c/p\u003e\n\u003cp\u003eBut there wasn’t a hint of a stranger, a presence, or anyone who shouldn’t have been there.\u003c/p\u003e\n\u003cp\u003e“Basement,” she said.\u003c/p\u003e\n\u003cp\u003eDan rolled his eyes impatiently. “Sure,” he agreed, and they traipsed back down the stairs.\u003c/p\u003e\n\u003cp\u003eThe door to the basement was in the kitchen. Christina hit the light switch, and they headed down into another bright, comfortable space. There was a Ping-Pong table in the center of the main area, surrounded by lounge chairs. There was a wet bar in the corner, and the laundry room was off to one side.\u003c/p\u003e\n\u003cp\u003eAnd nothing else.\u003c/p\u003e\n\u003cp\u003e“Okay?” Dan asked.\u003c/p\u003e\n\u003cp\u003e“Yeah, thanks,” she said awkwardly. “I’m…uh…sorry I bothered you.”\u003c/p\u003e\n\u003cp\u003eHe set an arm around her shoulders, pulled her close and lightly patted the top of her head. “Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” she said lightly.\u003c/p\u003e\n\u003cp\u003e“And…well, you are living here alone. You’re right to be careful. Call anytime, Christie. I’ll be here.”\u003c/p\u003e\n\u003cp\u003eBack upstairs, she asked him if he wanted something to eat or drink.\u003c/p\u003e\n\u003cp\u003e“No, thanks. In fact, I’d better get going. I’m going to be doing some extra work at the park, so I need to go in for a costume fitting. I’m the Grim Reader,” he told her. “Like the Grim Reaper, get it? You going to come see me read scary stories to the kiddies?”\u003c/p\u003e\n\u003cp\u003e“Of course,” she told him.\u003c/p\u003e\n\u003cp\u003e“I’ll call you later with my schedule,” he said.\u003c/p\u003e\n\u003cp\u003e“Super. And thanks again.”\u003c/p\u003e\n\u003cp\u003eShe walked him to the door. He left with a wave, and she locked the door immediately, telling herself that maybe it was natural to feel uneasy in a house she’d never really lived in before, and never alone.\u003c/p\u003e\n\u003cp\u003eShe walked into the parlor and sat idly on the piano bench, planning just to fool around.\u003c/p\u003e\n\u003cp\u003eThere was music on the stand, she realized.\u003c/p\u003e\n\u003cp\u003eShe frowned. She hadn’t left any music out. Had she?\u003c/p\u003e\n\u003cp\u003eNo, damn it, she knew she hadn’t.\u003c/p\u003e\n\u003cp\u003eGreat. Who broke into a house to put music up on a stand?\u003c/p\u003e\n\u003cp\u003eShe looked around the room. She was far from obsessive-compulsive, but…\u003c/p\u003e\n\u003cp\u003eThings had moved.\u003c/p\u003e\n\u003cp\u003eThe changes were subtle. A chair facing in a slightly different direction. The drapes drawn back just a bit farther than they had been.\u003c/p\u003e\n\u003cp\u003eHer heart started to beat hard. She was tempted to leap to her feet and flee the house again.\u003c/p\u003e\n\u003cp\u003eShe gritted her teeth, suddenly fighting tears.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eIt had to be her imagination. Emotions seeping from her subconscious and coloring the world. There was no denying the fact that there had been far too much loss in her life.\u003c/p\u003e\n\u003cp\u003e“I am not running away again,” she said softly.\u003c/p\u003e\n\u003cp\u003eDusk fell as she sat there, unmoving.\u003c/p\u003e\n\u003cp\u003eThen she nearly jumped straight over the piano as a shrill noise suddenly reverberated through the house.\u003c/p\u003e\n\u003cp\u003e5\u003c/p\u003e\n\u003cp\u003eT he first patrolman on the scene had done his job; a huge perimeter had been marked off around the body, keeping voyeurism from the highway to a minimum. Doc Martin was already on the scene, speaking to Jerry’s partner, Mal O’Donnell, when they arrived.\u003c/p\u003e\n\u003cp\u003eO’Donnell swept a long gaze over Jed but made no protest at his appearance. Doc Martin gave both the newcomers a nod.\u003c/p\u003e\n\u003cp\u003e“You know I can’t say anything definitive until I’ve completed the autopsy. But…” Martin let out a weary sigh. “This does echo Sherri Mason’s murder to a T. She was definitely dumped here. I’d estimate time of death to have been very late last night or very early this morning. I’d say she was laid out before dawn.”\u003c/p\u003e\n\u003cp\u003e“Jesus,” Jerry muttered. “And it took this long for someone to spot her?”\u003c/p\u003e\n\u003cp\u003e“Over there,” Jed said, pointing. “The bushes. They hid her from the road. And let’s face it, people going by at sixty miles an hour don’t have time to notice much.”\u003c/p\u003e\n\u003cp\u003eSince he hadn’t been thrown out, he hunkered down by the body while the others digested the fact that the bushes had evidently hidden the victim from the road.\u003c/p\u003e\n\u003cp\u003e“He must have not have realized his mistake,” Jerry said.\u003c/p\u003e\n\u003cp\u003e“I agree,” O’Donnell said. “He likes—needs—the attention that comes from the bodies being discovered naked and posed.”\u003c/p\u003e\n\u003cp\u003e“And vulnerable,” Jed agreed. He realized that the cops and the M.E. were staring at him, and he knew why. Everyone knew he had copies of the old files. That he had interviewed scores of people for his book. That he’d become friends with the FBI agent who had profiled the killer for them.\u003c/p\u003e\n\u003cp\u003eJed looked down at the dead woman. Her face was lovely; her brown hair long and highlighted with wide streaks of red. The strangulation marks on her neck were the only apparent giveaway to her violent end. She was stretched out naked, arms crossed over her chest, mummy-style.\u003c/p\u003e\n\u003cp\u003eOr in a way she might have been laid out in a funeral parlor.\u003c/p\u003e\n\u003cp\u003e“Patti Jo Buhler,” Mal O’Donnell said quietly. “Twenty-nine. There’s an employee ID in her purse, which was found to the left there.” He paused to point out the location where an officer had discovered her bag. “She’s an entertainer at one of the parks.”\u003c/p\u003e\n\u003cp\u003e“Usual victim,” Jerry said dryly.\u003c/p\u003e\n\u003cp\u003eJed stared at the girl. His heart seemed to lurch. Without the marks, she might have been sleeping. She almost looked as if she could open her eyes, smile and get to her feet. She might be at peace in death, but her dreams were over.\u003c/p\u003e\n\u003cp\u003e“Any other bruising?” he asked Doc Martin.\u003c/p\u003e\n\u003cp\u003e“I’m seeing a few spots where it looks like postmortem bruising will appear,” Doc said. With a gloved forefinger he pointed to her arms. “See there? She was shoved around, but she wasn’t beaten.”\u003c/p\u003e\n\u003cp\u003eJed looked down at what was left of Patti Jo Buhler. He’d seen all the crime photos when he’d written the book, and this could have been one of them. Like the others, she’d been a beautiful young woman with everything to live for.\u003c/p\u003e\n\u003cp\u003eBut now…\u003c/p\u003e\n\u003cp\u003eHe thanked God he was no longer a cop. That he wasn’t the one who would have to inform her family. That he wouldn’t have to feel their pain, so much greater than anything a cop learned to live with.\u003c/p\u003e\n\u003cp\u003eA redhead lying there….\u003c/p\u003e\n\u003cp\u003eShe could too easily have been Beau Kidd’s sister.\u003c/p\u003e\n\u003cp\u003eWorse.\u003c/p\u003e\n\u003cp\u003eA flash of vision taunted his mind’s eye, and for just a moment he saw Christina Hardy lying there.\u003c/p\u003e\n\u003cp\u003eHe stiffened, then shrugged to ease the tension in his shoulders. He was getting too involved. Too wrapped up in this. Letting it eat him up inside.\u003c/p\u003e\n\u003cp\u003eO’Donnell’s phone rang. He answered it, stating his name in a monotone, then listened expressionlessly for a moment. “Thanks,” he said then, and hung up. He looked at the others. “Patti Jo was officially reported missing by her roommate two days ago, after they made her wait the mandatory twenty-four hours, so we can assume she was nabbed somewhere between work and home three days ago. A dozen people saw her leave the park. No one’s found anyone who’s seen her since.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-13.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
