{"id":88735,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’d love some,” Ana said.\u003c/p\u003e\n\u003cp\u003eJed shrugged, staring at Christina, who headed for the kitchen, tossing a question over her shoulder. “So what are you doing here, Jed?”\u003c/p\u003e\n\u003cp\u003e“I guess I just came by to check on you.”\u003c/p\u003e\n\u003cp\u003eThe others had followed her to the kitchen, where they perched on bar stools at the pass-through counter.\u003c/p\u003e\n\u003cp\u003e“We heard the news while we were out,” Christina said. “That they found another girl.”\u003c/p\u003e\n\u003cp\u003eShe was certain she saw concern in his eyes. She let out a breath.\u003c/p\u003e\n\u003cp\u003e“A redhead,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Like I said, I just came by to say hi, make sure things were all right,” Jed said, still staring at Christina with concern—and wariness.\u003c/p\u003e\n\u003cp\u003e“Well, it’s nice to see you,” Christina said, privately thinking that she and Ana must be quite a sight, with tangled hair and scrubbed faces, and wearing pajamas.\u003c/p\u003e\n\u003cp\u003eAdmittedly, he was just a friend, but still, she wished she looked a bit more dignified. Or even…sexy.\u003c/p\u003e\n\u003cp\u003eNot like the kid he had known forever.\u003c/p\u003e\n\u003cp\u003e“Did I wake you guys up?” he asked.\u003c/p\u003e\n\u003cp\u003e“No,” Ana said. “We weren’t asleep, we were staring out the window. We should have Jed look around the place, too,” Ana said.\u003c/p\u003e\n\u003cp\u003e“There’s no one here,” Christina assured her.\u003c/p\u003e\n\u003cp\u003e“Because whoever was here just put the coffee on and left?” Ana asked flatly.\u003c/p\u003e\n\u003cp\u003eChristina stared hard at Ana again. Didn’t her friend realize that she was adding to Jed’s perception that she was crazy, or at least overemotional?\u003c/p\u003e\n\u003cp\u003eChristina knew that she’d had a crush on the guy all her life, which was making her current embarrassment worse, but she couldn’t help it. She didn’t want him thinking she needed serious therapy.\u003c/p\u003e\n\u003cp\u003e“No harm in looking,” Jed told her. “I’ll just take a walk through the house.”\u003c/p\u003e\n\u003cp\u003e“I’ll go with you,” Christina said.\u003c/p\u003e\n\u003cp\u003e“Hey, you’re not leaving me here alone,” Ana warned them. “Haven’t you ever seen a slasher film?”\u003c/p\u003e\n\u003cp\u003e“Not many,” Christina said, and almost added, Real life is worse.\u003c/p\u003e\n\u003cp\u003eThey followed Jed from room to room, floor to floor. Occasionally he asked Christina if anything looked odd or out of place, and once he asked if she could think of any reason why someone would come in to make coffee for her.\u003c/p\u003e\n\u003cp\u003e“The thing is,” he said when they were once again in the front hall, “no one has broken in. Your lock hasn’t been picked.”\u003c/p\u003e\n\u003cp\u003eHe was right, she realized.\u003c/p\u003e\n\u003cp\u003eIf someone had been in the house, that someone had used a key. There was absolutely no sign of forced entry.\u003c/p\u003e\n\u003cp\u003e“Does Dan or Mike have a key?” Jed asked.\u003c/p\u003e\n\u003cp\u003e“I…I don’t know. But I just can’t see either one of them coming in to set up the coffeemaker.”\u003c/p\u003e\n\u003cp\u003e“Then there’s just one answer,” Ana said softly.\u003c/p\u003e\n\u003cp\u003eChristina glared at her. “But I didn’t do it.” They were both staring at her. Irritated, she said sharply, “Whatever!”\u003c/p\u003e\n\u003cp\u003eJed looked away and cleared his throat. She remained stubbornly silent. He looked back at her and asked, “What else could it be?”\u003c/p\u003e\n\u003cp\u003e“Dan’s the type to play a practical joke,” Ana suggested.\u003c/p\u003e\n\u003cp\u003e“Mike isn’t,” Christina replied.\u003c/p\u003e\n\u003cp\u003eThey were all startled by a knock at the door, and Jed arched a brow questioningly. As if she should know who would be stopping by in the middle of the night, Christina thought, her irritation growing.\u003c/p\u003e\n\u003cp\u003eJed opened the door to reveal Tony standing on the front steps.\u003c/p\u003e\n\u003cp\u003e“I saw all the lights on and came over to check up on Christina,” he said, looking questioningly at Jed. “Is everything all right?”\u003c/p\u003e\n\u003cp\u003e“Everything’s fine, Tony. Thanks for looking out for me,” Christina said. “Do you want to come in? Would you like some tea or something?”\u003c/p\u003e\n\u003cp\u003e“Tony, you haven’t seen anyone hanging around the house, have you?” Jed asked before Tony could answer.\u003c/p\u003e\n\u003cp\u003e“No, why?” Tony frowned in thought.\u003c/p\u003e\n\u003cp\u003e“No reason,” Christina said firmly. “We’re just a bunch of nervous Nellies, as Gran would say. So…would you like something?”\u003c/p\u003e\n\u003cp\u003e“No, no, I’ve got to get back. Ilona will be worried.”\u003c/p\u003e\n\u003cp\u003eChristina smiled. “Thanks for checking on me,” she said with genuine gratitude.\u003c/p\u003e\n\u003cp\u003e“Good night, then,” Tony told them.\u003c/p\u003e\n\u003cp\u003e“Night,” Ana echoed.\u003c/p\u003e\n\u003cp\u003eAfter Tony left and the door was shut, the three of them stood awkwardly in the hall once again.\u003c/p\u003e\n\u003cp\u003e“All right, I’m out of here, too,” Jed said. He kissed his cousin on the cheek; then a beat passed before he took Christina by the shoulders and kissed her cheek, too. It was casual, one friend to another.\u003c/p\u003e\n\u003cp\u003eThe warmth of his lips on her cheek seemed to rush through Christina like lava. Sensual. Sexual. She tried not to react visibly. Had her crush on the man always been this strong? It had always been there, that quality in him that made her want to be near him. Only now that she was older, she could see—no, feel—that she wanted so much more than just to be there in his shadow. The man who stood before her now was far more than just a handsome high school jock or a brooding Heathcliff on the moors. Shaped by the good and the bad he’d faced in life, as were they all, he was the complete package now, a man worth loving.\u003c/p\u003e\n\u003cp\u003e“Good night, Jed,” Ana said cheerfully.\u003c/p\u003e\n\u003cp\u003e“Good night,” Christina managed politely, then stood there with a pleasant smile plastered to her face. If only Ana were leaving and Jed were staying.\u003c/p\u003e\n\u003cp\u003eBut that wasn’t the way of things, and in a moment he was gone.\u003c/p\u003e\n\u003cp\u003e“Lock the door. Carefully,” Ana said gravely.\u003c/p\u003e\n\u003cp\u003eChristina wasn’t sure if a door could be locked carefully, but she slid both bolts home as firmly as she could.\u003c/p\u003e\n\u003cp\u003e“Let’s get some sleep,” Ana said.\u003c/p\u003e\n\u003cp\u003e“Let me just make sure the burners are off,” Christina said. “You run on up.”\u003c/p\u003e\n\u003cp\u003e“Not on your life,” Ana said, and trailed behind her to check out the kitchen before they went upstairs, where they left the hallway and bathroom lights on again.\u003c/p\u003e\n\u003cp\u003eChristina was half asleep when Ana said, “It’s strange, really. You’ve always been afraid of the dark.”\u003c/p\u003e\n\u003cp\u003e“I’m not afraid of the dark,” Christina heard herself reply, the response instant—and defensive. “I just hate it,” she said, “when it’s pitch dark…you can trip on things. You can’t see.”\u003c/p\u003e\n\u003cp\u003e“That’s the point. For sleeping, anyway.”\u003c/p\u003e\n\u003cp\u003e“Do you want more lights out?”\u003c/p\u003e\n\u003cp\u003e“Good God, no.”\u003c/p\u003e\n\u003cp\u003eAna fell asleep quickly moments later, while Christina found herself lying awake and wondering.\u003c/p\u003e\n\u003cp\u003eWhat was it about the darkness?\u003c/p\u003e\n\u003cp\u003eIt could be the idea of the unknown, always lying hidden in the dark.\u003c/p\u003e\n\u003cp\u003eOr was it that, somewhere deep inside, to everyone, darkness meant death? Death without reprieve. Just a coffin in the earth, and nothingness…\u003c/p\u003e\n\u003cp\u003eShe rolled over, and at last she slept.\u003c/p\u003e\n\u003cp\u003eAna was a freelance makeup artist, a good one. She’d been offered a permanent position by all the local theme parks, but she preferred to work her own schedule. This being October, though, business was booming. There were haunted houses everywhere, and haunted houses meant hundreds of performers dressing up as zombies, mummies, vampires, movie killers and creatures from lagoons of every color on a daily basis. She complained as she dressed, “It’s so busy! And I’m an idiot. A greedy idiot. I said yes to way too many people. I start off at one park this morning, then go to another in the afternoon, and then the park where Dan is working tonight.”\u003c/p\u003e\n\u003cp\u003e“I don’t get it. How can you do makeup for that many people every day?” Christina asked her.\u003c/p\u003e\n\u003cp\u003e“I don’t do them all. I only do the major players. With most people, I help them at the beginning, teach them how to do what they need to. Plus all the parks have people in-house to fix up anyone who can’t do it themselves. How about you? What are you up to today?”\u003c/p\u003e\n\u003cp\u003e“I’m going to have the locks changed, and I’m going to buy a dog,” Christina told her.\u003c/p\u003e\n\u003cp\u003e“The locks being changed sounds good, but…a dog? That’s a big responsibility. Who’ll take care of it when you travel?”\u003c/p\u003e\n\u003cp\u003e“You’ll come over and feed it.”\u003c/p\u003e\n\u003cp\u003e“What if I’m traveling?”\u003c/p\u003e\n\u003cp\u003e“I’ll find a good vet.”\u003c/p\u003e\n\u003cp\u003eAna stared at her, then shrugged. “A guard dog?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” Christina told her. “And the bigger the better.”\u003c/p\u003e\n\u003cp\u003e“The food will cost you an arm and a leg. A cat would be better, you know.”\u003c/p\u003e\n\u003cp\u003e“I should go out a buy a guard cat?” Christina asked.\u003c/p\u003e\n\u003cp\u003e“Hey, Fuzzball can be ferocious,” Ana said, defending her own beloved pet. Fuzzball had come from a shelter when Ana had been about twelve, and he was still going strong.\u003c/p\u003e\n\u003cp\u003eFuzzball could be ferocious, Christina had to admit. He liked to lie in wait on top of a bookcase and whack people when they walked by. But he wouldn’t—couldn’t—bark if someone broke in.\u003c/p\u003e\n\u003cp\u003e“A dog. A brute. A massive German shepherd, maybe,” Christina said. “I could look around for a trained one, I guess, but I’d rather go to a shelter. The people there can help me, I’m certain. So many pets need homes, and, anyway, what I mostly want is the companionship.”\u003c/p\u003e\n\u003cp\u003e“A cat is a great companion,” Ana advised.\u003c/p\u003e\n\u003cp\u003e“I want a companion that will warn me if someone is around.”\u003c/p\u003e\n\u003cp\u003e“Suit yourself,” Ana said with a smile. “I’ve got to get going. Oh, and whoever set the coffeepot? They did a nice job. The coffee was just the right strength.”\u003c/p\u003e\n\u003cp\u003eIn seconds she was out the door, totally unaware of how chilling her last statement had been.\u003c/p\u003e\n\u003cp\u003eChristina had planned to call a locksmith as soon as Ana left. Instead, she grabbed her purse and headed out to her car.\u003c/p\u003e\n\u003cp\u003eWhen she reached it, she hesitated and looked back. She loved this house. And she refused to let herself become terrified of it. And she wasn’t, she realized. She didn’t think there was anything evil about the house itself, and yet…she was still afraid. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-17.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
