{"id":88738,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Killer?” Jed asked again.\u003c/p\u003e\n\u003cp\u003e“When I adopted him, that was already his name.”\u003c/p\u003e\n\u003cp\u003e“Christina, this is a Jack Russell terrier.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Sit,” Jed firmly ordered the dog. Killer did so, sitting calmly on his lap and staring at him as if he were the most marvelous human ever to occupy the earth.\u003c/p\u003e\n\u003cp\u003e“He’s very well behaved,” Christina said.\u003c/p\u003e\n\u003cp\u003e“I…uh, don’t want to burst any bubbles here, but Jack Russells aren’t what usually come to mind when someone is thinking guard dog,” Jed told her, looking a little bemused. His hair was slightly ruffled, and the rueful smile tugging at his features was extremely attractive, she thought.\u003c/p\u003e\n\u003cp\u003e“He has a great bark,” Christina said, defending her dog.\u003c/p\u003e\n\u003cp\u003e“Yes, he has a great bark.” Jed cleared his throat. “Were they all out of German shepherds?”\u003c/p\u003e\n\u003cp\u003e“They were.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t second best or anything. They had lots of bigger dogs. It was just that he came flying out and…and…”\u003c/p\u003e\n\u003cp\u003e“And picked you,” Jed said.\u003c/p\u003e\n\u003cp\u003e“Kind of,” Christina agreed.\u003c/p\u003e\n\u003cp\u003e“And the idea is that he’ll warn you if anyone comes around?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “Why are you so worried? You don’t believe anyone has been here. You think I’m emotionally disturbed.”\u003c/p\u003e\n\u003cp\u003e“Not emotionally disturbed,” Jed protested. “Just…hurting,” he said after a moment.\u003c/p\u003e\n\u003cp\u003eHe patted the dog for a few moments, which somehow kept the silence from growing too awkward as it stretched between them.\u003c/p\u003e\n\u003cp\u003e“I hear you were out at the new park,” she said at last. “Dan told me the second woman who was murdered was one of his friends.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Jed said, looking down at the dog.\u003c/p\u003e\n\u003cp\u003e“Are you…investigating?” she queried.\u003c/p\u003e\n\u003cp\u003e“Sort of.”\u003c/p\u003e\n\u003cp\u003e“But you’re not on the force anymore,” she reminded him.\u003c/p\u003e\n\u003cp\u003eHe lifted his eyes to stare at her then. “Actually,” he said, “I have a client.”\u003c/p\u003e\n\u003cp\u003e“A client?” she echoed with a frown.\u003c/p\u003e\n\u003cp\u003e“Beau Kidd had a younger sister.”\u003c/p\u003e\n\u003cp\u003eChristina almost fell off the piano bench. “Beau Kidd had a younger sister…and she’s hired you to investigate?”\u003c/p\u003e\n\u003cp\u003e“Go figure, huh?” he murmured.\u003c/p\u003e\n\u003cp\u003e“But…your book really did kind of…”\u003c/p\u003e\n\u003cp\u003eHer voice trailed away weakly.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“So what’s his sister like?” she inquired.\u003c/p\u003e\n\u003cp\u003e“I haven’t really gotten to know her,” he said.\u003c/p\u003e\n\u003cp\u003e“Did she…call you up? How did she find you?”\u003c/p\u003e\n\u003cp\u003e“We were both in the cemetery,” he said as he picked up the dog and stood, then set Killer down on the floor. “Congratulations on the new addition to the family.”\u003c/p\u003e\n\u003cp\u003eShe ignored his last comment and said, “You met Beau Kidd’s sister in the cemetery—and she hired you?”\u003c/p\u003e\n\u003cp\u003e“Kind of.”\u003c/p\u003e\n\u003cp\u003e“But…” she began, and then the rest of the words froze in her throat. The cemetery was one of the oldest in the area, but it was still accepting the dead. Her grandparents were both there, as were her parents.\u003c/p\u003e\n\u003cp\u003eAnd so was his wife. He must have been at Margaritte’s grave.\u003c/p\u003e\n\u003cp\u003eHe stared at her, and a strange look came over his face. When he spoke, his words sounded harsh. “Actually, I don’t know why, but I went to see Beau Kidd’s grave.”\u003c/p\u003e\n\u003cp\u003e“I see,” she murmured, though she didn’t see at all. He seemed so distant, all of a sudden, even though she’d known him for so long.\u003c/p\u003e\n\u003cp\u003eShe admitted that she had spent most of her life being fascinated with Jed. When he had married Margaritte, she had told herself that he was just Ana’s older cousin, someone she’d idolized but not someone she’d ever really hoped to end up with. She had a life, loved her music, had a few serious relationships along the way.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eHe’d always been there for her. Strong, quiet, always saying the right things.\u003c/p\u003e\n\u003cp\u003eAs she watched him sit there, she knew that she loved the contours of his face, the power of his build. But that wasn’t why he stayed in her mind, like something etched into her heart.\u003c/p\u003e\n\u003cp\u003eThere was something deeper in him. In those eyes, in the sound of his voice, in his soul, his mind.\u003c/p\u003e\n\u003cp\u003eSomething that made her long to see him.\u003c/p\u003e\n\u003cp\u003eSomething that made her draw back when she did.\u003c/p\u003e\n\u003cp\u003eHe seemed to be deep in thought, but finally he spoke. “There’s a chance Beau was innocent. If so, I need to do everything in my power to help clear his name. Naturally his sister wants the same thing.”\u003c/p\u003e\n\u003cp\u003e“Damn it, Jed, none of it was your fault. It wasn’t your case. You’re a writer.”\u003c/p\u003e\n\u003cp\u003e“I’m a private eye, when I choose to be,” he said coolly. “I have the license to prove it.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she said at last. “I think getting involved in this could be dangerous.”\u003c/p\u003e\n\u003cp\u003eHe walked over to her and, to her surprise, lifted her chin with his thumb. “I can’t help feeling that not looking into it could prove to be even more dangerous,” he told her. He stepped back then. “Well, I guess I should get going. The, uh…hmm, is it really a whole dog?” he said lightly, teasingly. “The little mutt is great.”\u003c/p\u003e\n\u003cp\u003e“Killer,” she said indignantly.\u003c/p\u003e\n\u003cp\u003e“Killer. Right.”\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003eShe was in love, she thought.\u003c/p\u003e\n\u003cp\u003e“If he’ll keep you from imagining that things in the house are moving around, he’ll definitely be worth his Alpo,” he told her.\u003c/p\u003e\n\u003cp\u003eHer spine stiffened. “Right. Thanks so much for coming by, Jed.”\u003c/p\u003e\n\u003cp\u003e“You should probably get those locks changed, though, you know.”\u003c/p\u003e\n\u003cp\u003e“I was already planning to. Maybe I should lock up my imagination, too,” she suggested.\u003c/p\u003e\n\u003cp\u003e“Christie, I wasn’t trying to—”\u003c/p\u003e\n\u003cp\u003e“It’s all right.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well…those locks are older than the hills. Who knows who has a key? Your gran might have given them to anyone. It won’t hurt to change them.”\u003c/p\u003e\n\u003cp\u003eShe nodded and rose. “For the moment, I’ll just have to use the locks I have.”\u003c/p\u003e\n\u003cp\u003eHe took the hint. “Take care.”\u003c/p\u003e\n\u003cp\u003eWith Killer in her arms, she followed him to the door. The dog whined as she watched Jed head down the walk to his car, then looked at her.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know, he looks great, sounds great, even smells great. But he can be a real asshole,” she told the dog.\u003c/p\u003e\n\u003cp\u003eKiller just wagged his tail.\u003c/p\u003e\n\u003cp\u003eMichael McDuff’s offices were on International Drive, and he was very glad to be far away from the insanity of the parks. He liked what he did; he made a decent income by putting together the pieces of a production: talent, direction and money, even costuming and effects, but he was grateful he didn’t have to be physically on the spot when everything merged. On the side, he’d also been working on the creation of a children’s show, driven by a desire to overcome the prejudice he so often saw in the business.\u003c/p\u003e\n\u003cp\u003eAll the parks employed actors, and they weren’t usually discriminated against because of color, nationality, religion or sexual persuasion. But there was a pecking order, and it wasn’t controlled by talent but by what amounted to luck: who’d been on a TV show, who had been in a commercial, who had at least been in a park show before, all the way down to the hopefuls with no experience at all but lots of drive and often more talent than those at the top.\u003c/p\u003e\n\u003cp\u003eFar too often he had to deal with a nasty little ten-year-old who thought the world owed her everything because she’d lucked into the role of fairy princess, or a fifteen-year-old who bossed around his parents and made sure to tell everyone he was tops because some commercial director thought he looked cute drinking a big glass of Florida orange juice. He wanted to create a show that gave lots of children with real talent a chance to get experience, so they would have a chance, now and later, to showcase that talent not just locally but anywhere there were performing jobs.\u003c/p\u003e\n\u003cp\u003eFor now, though, he was done for the day, and he was glad of it. He felt tired of everything and suddenly anxious to get out, head to a pub, watch a football game.\u003c/p\u003e\n\u003cp\u003eClosing his desk drawer, he hesitated. He knew, of course, why this day had been so bitter.\u003c/p\u003e\n\u003cp\u003eAngie.\u003c/p\u003e\n\u003cp\u003eAngie, who still went by McDuff, since she thought it looked better on paper—and in lights—than Vladilovskya.\u003c/p\u003e\n\u003cp\u003eHe felt his hands knot into fists and made a point of straightening his fingers. Angie. Tall, slim, silicone-breasted Angie.\u003c/p\u003e\n\u003cp\u003eHe’d paid for that silicone.\u003c/p\u003e\n\u003cp\u003eJust as he’d paid for the tummy tuck—not really necessary, he’d been told by her surgeon—and the liposuction. He’d been madly in love. He’d met her when she’d auditioned for a show he was putting together, and she’d fallen in love with him, too. Until she’d gotten the role. And a few other roles. And the boobs, the lipo and the tummy tuck.\u003c/p\u003e\n\u003cp\u003eThen she’d started to gain a reputation, even gotten a small role in a movie.\u003c/p\u003e\n\u003cp\u003eAnd he’d been out on his heels like an old, used-up has-been.\u003c/p\u003e\n\u003cp\u003eHer name had come up in a meeting today. He’d done all he could to keep his mouth closed. He hadn’t dissed her, even agreed that she might be right for a role in a Christmas special one of the networks had asked him to pull together at the biggest theme park in the area. A role that could lead to more and better—and bigger—things in the future.\u003c/p\u003e\n\u003cp\u003eAbout to rise, he paused when he heard a tentative knock on his door. “Yes?” he snapped.\u003c/p\u003e\n\u003cp\u003eTo his amazement, she walked in. Angie McDuff. His ex. Tall, slim and now all but perfect. Her eyes were huge and light green, and her hair was tinted to the color of burnished copper, though she’d been a brunette when he’d met her.\u003c/p\u003e\n\u003cp\u003e“Mike,” she said softly.\u003c/p\u003e\n\u003cp\u003e“Hello, Angie. I was just on my way out.”\u003c/p\u003e\n\u003cp\u003e“Sure. I just came by to say thank you.”\u003c/p\u003e\n\u003cp\u003e“For what?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-20.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
