{"id":88744,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You prove it,” Forest Kidd told him as Jed started down the hallway. “You know, if you can prove it, maybe you can live with yourself again,” Kidd called after him.\u003c/p\u003e\n\u003cp\u003eJed didn’t respond.\u003c/p\u003e\n\u003cp\u003e“I know your wife died of cancer,” Kidd said. “No man out there can change that. And that includes you, Mr. Braden. But maybe you can change things for the better if you prove that Beau was innocent. Go for it. Please.”\u003c/p\u003e\n\u003cp\u003eWhen Jed reached the front door and looked back, Forest Kidd had disappeared.\u003c/p\u003e\n\u003cp\u003eJed let himself out.\u003c/p\u003e\n\u003cp\u003eDan was at the door of the old family house, about to ring the bell, when he saw Ilona come outside. She saw him, too, and waved. “Hey, there!” he called to her.\u003c/p\u003e\n\u003cp\u003e“Hey!” she called back, but she didn’t come over. Was she looking at him suspiciously? he wondered.\u003c/p\u003e\n\u003cp\u003e“Have you seen Christie?” he asked.\u003c/p\u003e\n\u003cp\u003e“She went out a while ago,” Ilona told him.\u003c/p\u003e\n\u003cp\u003e“Did she say where she was going?”\u003c/p\u003e\n\u003cp\u003eIlona shook her head. “I didn’t ask her. I just happened to see her car drive by. Can I help you? Hey, don’t you guys all have keys to that place?”\u003c/p\u003e\n\u003cp\u003e“I’m sure I had a key at some point,” Dan told her. “Oh, well. It’s not that important. I had some spare time before work, and I just thought I’d stop by.”\u003c/p\u003e\n\u003cp\u003e“I see,” Ilona said.\u003c/p\u003e\n\u003cp\u003eDan felt a cold sweat break out at his nape. She was looking at him suspiciously. “Well, I guess I’ll get going,” he said.\u003c/p\u003e\n\u003cp\u003e“Good to see you, Dan.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Tell Tony hello for me, okay?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eHe got into his car. Just as he did, he saw Christina coming around the corner. She waved to him cheerfully as she pulled into the driveway.\u003c/p\u003e\n\u003cp\u003eIlona was still watching them, Dan thought as he got back out of his car and waited while Christina stepped from hers, a cup of take-out coffee in her hand.\u003c/p\u003e\n\u003cp\u003eHer new dog jumped from the car. He barked happily at Dan, his tail wagging.\u003c/p\u003e\n\u003cp\u003e“Hiya.” Christina walked over, and gave him a hug and a kiss on the cheek. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“I had about an hour, so I thought I’d stop by.”\u003c/p\u003e\n\u003cp\u003e“Cool. I’m waiting for the locksmith.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah?” He looked at her questioningly. “You really think Mike or I would break in just to play a joke on you?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” she told him, shaking her head. “I just don’t know how many keys might have wandered out over the years. That’s all.”\u003c/p\u003e\n\u003cp\u003e“Good point,” Dan said.\u003c/p\u003e\n\u003cp\u003eWhen they went into the house, it seemed to Dan that she was behaving strangely. She kept walking around, looking into every room, almost as if she expected to catch someone there.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Do you think the dog—and the new locks—with be enough?”\u003c/p\u003e\n\u003cp\u003e“Enough?” she asked him.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I don’t know. I’m feeling edgy, I guess. The newspaper headlines, the warnings on the news…I knew her, Christie. I knew Patti Jo.”\u003c/p\u003e\n\u003cp\u003eChristina walked over to him, setting an arm around his shoulders. “I’m okay, Dan. I’m really okay. I’m always careful, and I’ve got Tony and Ilona right next door.”\u003c/p\u003e\n\u003cp\u003eJust then the dog began to bark. He really did sound quite ferocious, Dan thought.\u003c/p\u003e\n\u003cp\u003eThe locksmith was at the door.\u003c/p\u003e\n\u003cp\u003eWhile the man worked, Christina played some of her newest tunes for Dan. He’d worked for her a few times, and he liked doing jingles. She had a nice voice herself. They had both loved singing with their grandfather when they were kids.\u003c/p\u003e\n\u003cp\u003e“Shit!” he swore suddenly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Work. I’ve got to go. The Grim Reader has a gig tonight.”\u003c/p\u003e\n\u003cp\u003eWhen she walked him to the door, the locksmith was just finishing.\u003c/p\u003e\n\u003cp\u003e“All right. You got good old Killer and your new locks, so I’m out of here. Don’t forget, you said you’d come see me.”\u003c/p\u003e\n\u003cp\u003e“I’ll talk to Ana. Tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“Sounds good to me. I’m off Saturday.”\u003c/p\u003e\n\u003cp\u003e“Maybe we can have a get-together here again.”\u003c/p\u003e\n\u003cp\u003eThey hugged briefly, and he left. He was halfway down the path when she caught up with him, holding out something toward him.\u003c/p\u003e\n\u003cp\u003eIt was a key.\u003c/p\u003e\n\u003cp\u003e“Should I have this?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Of course. Someone else has to have the key to the house. What if I lock myself out? And I’ve told you and Mike, this will always be your house, too.”\u003c/p\u003e\n\u003cp\u003eHe hefted the key in his hand.\u003c/p\u003e\n\u003cp\u003eHe shouldn’t take it, he thought. He wasn’t sure why, but he just had a feeling he shouldn’t have the key.\u003c/p\u003e\n\u003cp\u003e“Christie…” he murmured.\u003c/p\u003e\n\u003cp\u003e“Take it and get going. You have to go to work.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “All right. Love ya.”\u003c/p\u003e\n\u003cp\u003eHe hurried on to his car.\u003c/p\u003e\n\u003cp\u003eJed called Jerry and arranged to meet him for coffee.\u003c/p\u003e\n\u003cp\u003eWhen Jerry arrived, he looked at Jed hopefully. “Anything?”\u003c/p\u003e\n\u003cp\u003e“Nothing—other than the fact that I’m convinced Beau Kidd never murdered anyone. I can’t even find anything that resembles real evidence against him. When Larry Atkins shot him and Beau died, that seems to have created the case.”\u003c/p\u003e\n\u003cp\u003eJerry looked at him and shook his head. “Okay, say you’re right. So whoever is out there kills five women. Then he lets twelve years go by and starts again. Now what?”\u003c/p\u003e\n\u003cp\u003e“That’s where you come in.”\u003c/p\u003e\n\u003cp\u003eJerry groaned.\u003c/p\u003e\n\u003cp\u003e“Come on, you guys have to be on this already. Whoever the killer is, no, I don’t think he stopped, not unless he was in prison or otherwise out of commission. Maybe he slowed down. Maybe he left town. Maybe he even changed some of his methods. I don’t know. But the facts on Beau Kidd are clear. The man was railroaded.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Jerry protested. “You’re the one who wrote the book.”\u003c/p\u003e\n\u003cp\u003e“Yeah, a novel. And I was suckered in by the fact that the man was dead and the killings had stopped.”\u003c/p\u003e\n\u003cp\u003eJerry leaned back in his chair. “What’s up with this? You get bought off by the family or something? I hear the sister is really good-looking.”\u003c/p\u003e\n\u003cp\u003e“She is. I’ve met her,” Jed said. “She’s a beautiful redhead.”\u003c/p\u003e\n\u003cp\u003eJerry threw up his hands. “There you go. Maybe it was Beau and it was some Freudian thing.”\u003c/p\u003e\n\u003cp\u003e“Jerry, she was twelve when this whole thing started,” he said.\u003c/p\u003e\n\u003cp\u003eJerry picked up his coffee cup, giving Jed a morose look. “I have a twelve-year-old daughter, Jed. You should see the way she dresses, the way she acts. It’s scary.”\u003c/p\u003e\n\u003cp\u003eJed shook his head impatiently. “That’s not it. And you don’t believe it, either. That’s why you called me. That’s why you let me back in on this.”\u003c/p\u003e\n\u003cp\u003eJerry shrugged.\u003c/p\u003e\n\u003cp\u003e“I need everything you get, Jerry. You can talk to the FBI, looking for links to deaths in other states, and I need to know what you find out.”\u003c/p\u003e\n\u003cp\u003eJerry nodded, looking down at his hands. “Do you know that the FBI believes there may be hundreds of serial killers at work in the United States at any given time?” he asked wearily.\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Do you know how many are never caught?”\u003c/p\u003e\n\u003cp\u003e“Jerry, we’re going to get this one,” Jed told him.\u003c/p\u003e\n\u003cp\u003e“Actually, I have a meeting tomorrow with a behaviorist, if you want in on it. Tiggs, he doesn’t care if you make an appearance.”\u003c/p\u003e\n\u003cp\u003e“Great. I’ll be there.”\u003c/p\u003e\n\u003cp\u003eDan and the locksmith were both gone. But once she had locked the door behind them and headed down the hall, she hesitated, her footsteps slowing with dread. Then she squared her shoulders and forced herself to keep going to the parlor.\u003c/p\u003e\n\u003cp\u003eAnd when she looked into the room, he was there.\u003c/p\u003e\n\u003cp\u003eOnce again Beau Kidd was at her piano, petting Killer, who was clearly fond of him.\u003c/p\u003e\n\u003cp\u003eShe groaned.\u003c/p\u003e\n\u003cp\u003eBeau turned and grimaced ruefully. “I’m sorry,” he told her softly.\u003c/p\u003e\n\u003cp\u003e“Can’t you go haunt someone else?” she asked him. “Someone who could actually help you?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I can’t. I…I have a connection to you.”\u003c/p\u003e\n\u003cp\u003e“Just because I tossed a flower on your grave when I was a kid?” she asked.\u003c/p\u003e\n\u003cp\u003e“Well…that, and the Ouija board,” he said. But he looked puzzled. “That and the Ouija board…and something else. But I don’t know what. Only that there is something else, another link.”\u003c/p\u003e\n\u003cp\u003e“If we discovered that link, would you go away?” she asked hopefully.\u003c/p\u003e\n\u003cp\u003eHe lifted his hands. “If you would just help me…”\u003c/p\u003e\n\u003cp\u003e“I can’t help you. I would help you if I could. But I’m not a cop.”\u003c/p\u003e\n\u003cp\u003e“Jed Braden could help you help me.”\u003c/p\u003e\n\u003cp\u003eShe ignored that and sat at the far end of the piano bench, setting Killer on her lap. “It’s so strange,” she murmured. “Killer seems to know you’re here.”\u003c/p\u003e\n\u003cp\u003e“Dogs have special senses,” he said. “Cute pooch, too.”\u003c/p\u003e\n\u003cp\u003e“Yeah. My Rottweiler,” she joked.\u003c/p\u003e\n\u003cp\u003eHe grinned. “You knew no one was breaking in, right? I was trying to be a good guest, trying to be helpful and make the coffee and stuff.”\u003c/p\u003e\n\u003cp\u003e“You nearly gave me a heart attack.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t,” he said softly. “Because you knew.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I knew not to play with that stupid Ouija board,” she said.\u003c/p\u003e\n\u003cp\u003e“Maybe you should play with it again,” he told her.\u003c/p\u003e\n\u003cp\u003eScowling fiercely, she stared at him.\u003c/p\u003e\n\u003cp\u003e“Or, maybe a séance,” he suggested.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“A séance might be good.”\u003c/p\u003e\n\u003cp\u003e“You…” She pointed at him in exasperation. “You really have to go away. People already think I’m some kind of emotionally fragile flower. I don’t need a damn ghost hanging around, driving me crazy for real.”\u003c/p\u003e\n\u003cp\u003eShe stood and headed for the kitchen, but he followed her and leaned against the wall, wistfully watching her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-26.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
