{"id":88745,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You can’t ignore me, you know.”\u003c/p\u003e\n\u003cp\u003e“I can’t? Watch me.” She started singing.\u003c/p\u003e\n\u003cp\u003eBut then she felt him. He had set his hands on her shoulders.\u003c/p\u003e\n\u003cp\u003eShe spun around and stared at him. “What?”\u003c/p\u003e\n\u003cp\u003e“You can’t ignore me because I’m not just talking about clearing my name,” he said very softly.\u003c/p\u003e\n\u003cp\u003e“No?” she whispered.\u003c/p\u003e\n\u003cp\u003e“No. I’m talking about saving the lives of all the other women some monster out there is planning to murder.”\u003c/p\u003e\n\u003cp\u003e10\u003c/p\u003e\n\u003cp\u003eF iles and notes were spread out before Jed when the phone rang. He picked it up and said, “Hello?”\u003c/p\u003e\n\u003cp\u003e“Jed? Jed Braden?”\u003c/p\u003e\n\u003cp\u003eHe didn’t recognize the female voice on the other end of the line.\u003c/p\u003e\n\u003cp\u003e“Yes, this is he.”\u003c/p\u003e\n\u003cp\u003eFor a moment there was silence. He kept his number listed and sometimes got calls from nuts. Was this one? “Who is this?”\u003c/p\u003e\n\u003cp\u003e“Katherine.”\u003c/p\u003e\n\u003cp\u003e“Katherine…?”\u003c/p\u003e\n\u003cp\u003e“Katherine Kidd.”\u003c/p\u003e\n\u003cp\u003e“Of course,” he said, wondering why he hadn’t realized who it was as soon as she said her first name. “Hello. How are you?”\u003c/p\u003e\n\u003cp\u003e“Fine. I wanted to know…how are you coming along?”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “How am I coming along? Fine. I guess you know I went to visit your father. I no longer believe your brother was guilty. But I’m not a cop. And though I believe I know who the killer wasn’t, I’ll be damned if I have any idea who it is.”\u003c/p\u003e\n\u003cp\u003e“Thank you for that. It means a lot.” She hesitated. “Would you have coffee with me?” she asked softly.\u003c/p\u003e\n\u003cp\u003e“I’m not sure—”\u003c/p\u003e\n\u003cp\u003e“Right. You don’t think it would be such a great idea to get personally involved with a client. I’m not looking to go on a date,” she told him. “But if we talked…I think I might be able to help.”\u003c/p\u003e\n\u003cp\u003e“Where should I meet you?”\u003c/p\u003e\n\u003cp\u003eHe couldn’t see much that was going on inside the house. The old lace Victorian curtains hid pretty much everything, other than the shadow of her figure as she moved from room to room.\u003c/p\u003e\n\u003cp\u003eHe should have gone inside when he had the chance. Too late. Now all he could do was watch. But he loved to watch. He always watched first. Half the pleasure was always in the anticipation. And talking and sharing, of course.\u003c/p\u003e\n\u003cp\u003eBut tonight there was no chance to talk, so he settled for watching her as she moved through the old house.\u003c/p\u003e\n\u003cp\u003eShe was so pretty. Just his type. Tall, with that rich, red long hair. And those eyes…But since he couldn’t see any of those details tonight, a lot had to be left to his imagination. What he could see, even with the curtains in the way, was the elegance of her movements.\u003c/p\u003e\n\u003cp\u003eHe felt a deep hunger, a pain that was almost agony, seize him. If only…\u003c/p\u003e\n\u003cp\u003eNo, not tonight. Not tonight.\u003c/p\u003e\n\u003cp\u003eBut the jaggedly slicing pain shot through him again. He had to have something, someone, to ease this agony.\u003c/p\u003e\n\u003cp\u003eHe should go home, he told himself, and from there he could take care of everything.\u003c/p\u003e\n\u003cp\u003eHe calmed himself by reminding himself that the time would come. And thinking that he could make history repeat itself…\u003c/p\u003e\n\u003cp\u003eThat was even better.\u003c/p\u003e\n\u003cp\u003eChristina sat on the floor in the middle of the parlor, a box in front of her, and looked around warily. Beau Kidd was nowhere in sight. She hadn’t seen him since he’d followed her into the kitchen. Of course, even when he was gone, she couldn’t stop doubting her own sanity.\u003c/p\u003e\n\u003cp\u003eShe dug into the box in front of her, glad that Gran had never thrown anything away. The box was full of newspaper clippings, including the entire local paper from the day of her grandfather’s funeral. She took a moment to read the memorial to him that had run right on the front page. Unfortunately, her grandfather’s article had been shortened to make way for a long recap about the just-identified Interstate Killer. She read through it carefully, searching for clues.\u003c/p\u003e\n\u003cp\u003eEach girl had been on her way to or from her car when she disappeared. All the cars had been found abandoned in the same parking lot where the victim had left it. Other than that and the fact that all the women had been young, attractive and red-haired, there were no clues at all.\u003c/p\u003e\n\u003cp\u003eShe set the paper down and sighed. No wonder everyone had been so willing to believe that Beau Kidd had been the murderer. The evidence pointing to him had been slight, but it was more than they had to incriminate anyone else.\u003c/p\u003e\n\u003cp\u003eDepressed over reaching a dead end, she decided to go through some of her own boxes and see what she could organize. Almost immediately, she came across a huge article from the Miami paper about a treasure ship. One of the divers who’d found it was a friend of hers, Genevieve Wallace. She remembered going down to the Keys for her friend’s wedding and meeting several people who worked for something called Harrison Investigations, a firm specializing in paranormal research. Now, why hadn’t she remembered that sooner?\u003c/p\u003e\n\u003cp\u003eShe jumped up and headed to the dining-room table, where she’d set up her computer. As soon as she got online, she began to search for Harrison Investigations. Their Web site certainly made for interesting reading. They sounded like nothing less than real live ghostbusters.\u003c/p\u003e\n\u003cp\u003eShe clicked on the Contact Us link, then hesitated and instead picked up her cell phone, went through her contacts and called Genevieve.\u003c/p\u003e\n\u003cp\u003e“Christina!” Genevieve said happily when she answered. “How are things going up there? Are you finding enough work?”\u003c/p\u003e\n\u003cp\u003e“Work is fine. With all the theme parks, it’s an advertising Mecca.”\u003c/p\u003e\n\u003cp\u003e“You’re safe, though, aren’t you?” Gen asked, suddenly serious. “The news media down here keep talking about those highway killings.”\u003c/p\u003e\n\u003cp\u003eChristina paused for a minute. “Actually, that’s sort of what I’m calling you about.”\u003c/p\u003e\n\u003cp\u003e“The highway killings?” Gen asked, puzzled.\u003c/p\u003e\n\u003cp\u003e“I met some friends of yours at your wedding. The ones from Harrison Investigations.”\u003c/p\u003e\n\u003cp\u003eThere was a brief silence; then Gen said warily, “Yes?”\u003c/p\u003e\n\u003cp\u003e“Gen, I need help.”\u003c/p\u003e\n\u003cp\u003e“In what way?”\u003c/p\u003e\n\u003cp\u003e“I have a ghost living in my house.” She rushed to get the words out, then waited for Genevieve to laugh at her.\u003c/p\u003e\n\u003cp\u003e“Are you joking?” Genevieve asked sharply.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThere was another silence. Then Gen asked, “Do you know who this ghost is?”\u003c/p\u003e\n\u003cp\u003e“Beau Kidd,” Christina said.\u003c/p\u003e\n\u003cp\u003eAgain silence. Then, “You’re really not joking?”\u003c/p\u003e\n\u003cp\u003e“I wish I was.” She hesitated, then asked, “Do you think you could call them for me, since you know them and all?”\u003c/p\u003e\n\u003cp\u003e“I’ll make the arrangements as soon as I can,” Genevieve told her. “In the meantime…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“In the meantime, be careful. Don’t trust anyone, even people you think are your closest friends, your nearest relatives. Okay?”\u003c/p\u003e\n\u003cp\u003eChristina felt a chill and bit her lower lip. The locks were brand-new. She was safe.\u003c/p\u003e\n\u003cp\u003e“I’ll be very careful. I promise.”\u003c/p\u003e\n\u003cp\u003eThey met in a café right on International Drive. Katherine Kidd was already there, a large iced tea in front of her, when Jed arrived. He greeted her, went in for a cup of black coffee, then joined her at the table. This town was certainly tourist central, he thought, dodging the crowds on his way. Across a dozen lanes of traffic, he could see the dramatic facade advertising a dinner show. More signs touted an Arabian horse show and various theme parks. Two feet from where they were sitting, a wire rack held brochures and coupons for dozens of area attractions.\u003c/p\u003e\n\u003cp\u003eOnce upon a time, and not so very long ago, the only thing here had been orange groves.\u003c/p\u003e\n\u003cp\u003e“Amazing, isn’t it?” Katherine said to him. “They all know there’s a killer out there, but they just keep going, no matter what. In a small town, a college town, something happens and everything comes to a stop. But here…”\u003c/p\u003e\n\u003cp\u003eHe reached across the table and took her hand, squeezing it. “Have you thought about the fact that you fit the profile of the victims?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded. “Of course. That’s one of the things driving me crazy. Some people think my brother was some kind of sicko who was trying to kill me with every victim. It’s ridiculous. I was just a gawky kid when everything happened.” She shook her head as if to clear it of unhappy thoughts. “You said you believe my brother was innocent,” she told him.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Well, here’s something you should know. He didn’t start dating either one of those women until after the killings began. I doubt if you’ll find that in all your files. I think the case was a personal thing for Beau—because of me. Because I said something about how the killer kept going after girls with red hair. So he started warning women who fit the description, and that’s how he ended up dating two of the victims.” She looked around and focused on a poster advertising the seasonal goings-on at one of the parks. “You’d think that they’d stop some of this gruesome Halloween stuff, what with a killer being out there and all,” she said.\u003c/p\u003e\n\u003cp\u003e“It’s hard to stop a money machine,” Jed told her.\u003c/p\u003e\n\u003cp\u003eAs they talked, he saw a woman entering the café who looked vaguely familiar.\u003c/p\u003e\n\u003cp\u003eTall. Long reddish-brown hair. He knew her from somewhere, though he was sure it had been a very long time since he had seen her.\u003c/p\u003e\n\u003cp\u003e“All right, so the news you have is that Beau didn’t know any of the victims until he tried to protect them,” Jed said.\u003c/p\u003e\n\u003cp\u003eKatherine nodded. “And because of that, I think someone out there thought Beau would make a good scapegoat.”\u003c/p\u003e\n\u003cp\u003e“Do you think the killer might have been Larry Atkins?”\u003c/p\u003e\n\u003cp\u003eShe let out a long sigh. “Maybe.”\u003c/p\u003e\n\u003cp\u003eJed mulled that over for a moment. Larry Atkins certainly had a remote place where he could be hiding women now…. But where had he lived twelve years ago? Jed thought back to his previous interviews with the man. Larry had lived in a town house. That didn’t clear him, but…\u003c/p\u003e\n\u003cp\u003eThe woman left the counter carrying a to-go cup with steam emanating from it. She paused by the table. “Hi, Jed, how are you doing?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-27.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
