{"id":88748,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhen he still didn’t move, she ran up behind him and scooped him into her arms, then ran toward the house as if she were being chased. She slammed the door closed behind her, and her fingers trembled as she slid the bolt home.\u003c/p\u003e\n\u003cp\u003eShe turned, looking around to see if Beau Kidd was there. Maybe his presence was what was making her so uneasy. But no sooner had she walked through the downstairs and assured herself that he wasn’t in sight than the doorbell rang. Somehow she kept from screaming as she hurried to the door and looked through the peephole.\u003c/p\u003e\n\u003cp\u003eMichael.\u003c/p\u003e\n\u003cp\u003eShe exhaled in relief and opened the door. “Are you all right?” he asked, a smile fading from his lips, a frown furrowing his brow as soon as he saw her.\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003e“You’re not fine. You look…white.”\u003c/p\u003e\n\u003cp\u003e“Um…have you heard the news?” she asked him.\u003c/p\u003e\n\u003cp\u003e“No, why? What’s up?”\u003c/p\u003e\n\u003cp\u003e“They found another victim of the Interstate Killer,” she said.\u003c/p\u003e\n\u003cp\u003e“Oh, God. That’s awful.”\u003c/p\u003e\n\u003cp\u003eAs she stepped back to let him in, Killer barked. “Killer, this is Michael.”\u003c/p\u003e\n\u003cp\u003e“Killer?” Michael said, arching a brow.\u003c/p\u003e\n\u003cp\u003e“Oh, shut up and come in. That was the name he had when I adopted him. Can I get you something? Did you just leave work?”\u003c/p\u003e\n\u003cp\u003e“Just a few minutes ago, yeah. I was working late. I talked to Dan earlier, and he said you promised to go see him as the Grim Reader tomorrow. I figured I’d just stop by now and make sure you were all right, and ask if I can crash the festivities. Is it okay if I go with you guys?”\u003c/p\u003e\n\u003cp\u003e“Of course. If it’s still open.”\u003c/p\u003e\n\u003cp\u003e“Still open?” Mike said.\u003c/p\u003e\n\u003cp\u003e“Didn’t you hear me? They found another dead woman.”\u003c/p\u003e\n\u003cp\u003e“Did she work at Dan’s park?” he asked.\u003c/p\u003e\n\u003cp\u003e“No, in fact…she was going to work for me,” she told him.\u003c/p\u003e\n\u003cp\u003e“Oh, Christie!” He took a step closer and threw his arms around her, pulling her close. “I’m so sorry. I mean, someone you knew…”\u003c/p\u003e\n\u003cp\u003eShe accepted his hug for a minute, then pulled away when Killer gave a nervous bark. “It’s okay, boy,” she chided him. “This is your cousin Mike.”\u003c/p\u003e\n\u003cp\u003e“I am not a dog’s cousin,” Mike said indignantly.\u003c/p\u003e\n\u003cp\u003e“Be quiet. You’ll hurt his feelings,” she said lightly, then turned to lead the way down the hallway. Once again she felt that eerie sensation and paused.\u003c/p\u003e\n\u003cp\u003eShe nearly jumped a mile when her cell phone rang.\u003c/p\u003e\n\u003cp\u003eIt was in the dining room, she realized. “Hang on,” she called over her shoulder to Mike as she hurried into the dining room. Mike followed, and she noticed absently that he was wearing a trench coat. He looked like such an executive, she thought as she flipped open her phone and said, “Hello.”\u003c/p\u003e\n\u003cp\u003e“Hey, you all right?”\u003c/p\u003e\n\u003cp\u003eIt was Dan.\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003eKiller started to bark, and the doorbell rang again. She frowned. What was going on tonight?\u003c/p\u003e\n\u003cp\u003eMike shrugged. “I’ll get it.”\u003c/p\u003e\n\u003cp\u003eShe smiled her thanks and returned her attention to the phone.\u003c/p\u003e\n\u003cp\u003e“I saw that they found another dead woman, Christie. Another redhead,” Dan said. “I’m worried about you.”\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003e“Because you have Killer?” Dan said doubtfully over the line.\u003c/p\u003e\n\u003cp\u003eShe looked up. Mike was returning, and Ilona Nelson was with him. Christina smiled at her while still listening to Dan. She mouthed the words, Where’s Tony?\u003c/p\u003e\n\u003cp\u003e“Tony is still next door,” Ilona said cheerfully.\u003c/p\u003e\n\u003cp\u003e“You have a houseful?” Dan asked over the line.\u003c/p\u003e\n\u003cp\u003e“Your big bro is here, and now Ilona.”\u003c/p\u003e\n\u003cp\u003e“Tell them hi,” Dan said.\u003c/p\u003e\n\u003cp\u003e“Dan says hi,” Christina repeated. “Mike says he’s going to come with us tomorrow night,” she explained to Dan.\u003c/p\u003e\n\u003cp\u003e“Yeah? Cool.”\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Ilona asked.\u003c/p\u003e\n\u003cp\u003e“To see Dan as the Grim Reader,” Mike explained.\u003c/p\u003e\n\u003cp\u003e“Tony and I will come, too. If that’s all right?”\u003c/p\u003e\n\u003cp\u003e“Of course they can come,” Dan said, apparently having heard the entire exchange.\u003c/p\u003e\n\u003cp\u003e“Dan says of course you guys can come.” She frowned and turned to Ilona. “Neither of you has to work?”\u003c/p\u003e\n\u003cp\u003eTony owned a bar and restaurant on International Drive, where he worked most nights, and Ilona helped out.\u003c/p\u003e\n\u003cp\u003eIlona shook her head. “Nope, we’re off tomorrow.”\u003c/p\u003e\n\u003cp\u003e“We’re all coming, Dan,” she said into the phone, feeling a sudden desire to scream.\u003c/p\u003e\n\u003cp\u003eThe Interstate Killer had claimed another victim, someone Christina had known, and they were talking about the next evening’s social events.\u003c/p\u003e\n\u003cp\u003eAt least she wasn’t alone, waiting for Jed to come back from seeing Jerry. Before he left, he’d told her to lock herself in and not to open the door for anyone. But Killer had needed to go out, and she could hardly have refused, could she? And Mike and Ilona weren’t exactly strangers.\u003c/p\u003e\n\u003cp\u003eMike took the phone from her. “Hey, Dan. Christie isn’t having a great night. Have you seen the news? She knew that last girl who was killed.”\u003c/p\u003e\n\u003cp\u003eShe took the phone back. “I’m okay, Dan.”\u003c/p\u003e\n\u003cp\u003e“Christie, I’m so sorry. I know how you feel. I was friends with Patti Jo. This is getting…scary.”\u003c/p\u003e\n\u003cp\u003e“I’m okay, honest. We’ll all see you tomorrow night, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay. Love ya, cuz.”\u003c/p\u003e\n\u003cp\u003e“You, too,” she said, and hung up.\u003c/p\u003e\n\u003cp\u003eIlona offered Christina a sympathetic smile. “I’m so sorry,” she said softly.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“Well, I guess I’d better get back. Tony will be waiting, and…”\u003c/p\u003e\n\u003cp\u003e“And?” Christina said.\u003c/p\u003e\n\u003cp\u003eIlona glanced at Michael. “Well, your cousin is here now, and you have that little cutie,” she said, indicating Killer. “Tony worries about you, that’s all. I hope you know we’re both next door anytime you need us.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Christina said. At the moment her head was pounding and she wanted everyone to leave. “Mike, will you walk Ilona home?” she asked. “I think I’d just like to be alone for a while.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Mike said. “Meet you here tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“Sounds good,” she said.\u003c/p\u003e\n\u003cp\u003eAs soon as they left, Christina locked the door behind them, then got the feeling that someone was behind her. She spun around and stared at Beau.\u003c/p\u003e\n\u003cp\u003e“Stop that,” she snapped. “I mean it.”\u003c/p\u003e\n\u003cp\u003e“Stop what?”\u003c/p\u003e\n\u003cp\u003e“Showing up out of the blue like that,” she told him.\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“Knock. Rattle chains. Do something,” she said.\u003c/p\u003e\n\u003cp\u003eChristina heard a car door slam and looked out the peephole.\u003c/p\u003e\n\u003cp\u003eJed was back.\u003c/p\u003e\n\u003cp\u003eShe watched him get out of his car. She could almost feel Beau wince behind her.\u003c/p\u003e\n\u003cp\u003e“He…he went to see the body,” he whispered softly.\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“I was a cop. I know how a guy looks when he’s seen what a killer has done…and he can’t stop him.”\u003c/p\u003e\n\u003cp\u003e“You have to get out of here.”\u003c/p\u003e\n\u003cp\u003e“I don’t think he can see me.”\u003c/p\u003e\n\u003cp\u003e“But I’ll forget and talk to you, and he’ll think I’m insane,” she said, and turned slightly.\u003c/p\u003e\n\u003cp\u003eHe was smiling, but his expression was pained. “You’ve accepted it, haven’t you? You have a gift. You can see ghosts. You can talk to them.”\u003c/p\u003e\n\u003cp\u003e“Go away, please.”\u003c/p\u003e\n\u003cp\u003e“I’m gone.”\u003c/p\u003e\n\u003cp\u003eShe believed him and swung the door open as Jed approached the house. He walked in, but when she would have touched him, he lifted a hand. “Can I use your shower?” he asked.\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eHe knew the way, so when he headed upstairs, she went into the kitchen, where she hesitated, then poured a large whiskey.\u003c/p\u003e\n\u003cp\u003eIrish medicine, she taunted herself.\u003c/p\u003e\n\u003cp\u003eAnd maybe it was, in a way. If so, this was certainly the right time for it.\u003c/p\u003e\n\u003cp\u003eShe walked up the stairs to the bedroom. She could hear the water running as she walked into the bathroom. He was sitting on the shower floor, the water cascading over him.\u003c/p\u003e\n\u003cp\u003e“Jed?”\u003c/p\u003e\n\u003cp\u003eHe didn’t seem to hear her.\u003c/p\u003e\n\u003cp\u003eShe opened the frosted door. Forgetting her clothes and her shoes, she stepped in and hunkered down by him. As the water poured over them both, she could smell the heavy scent of soap. Somehow she knew that he had scrubbed with it, then scrubbed again.\u003c/p\u003e\n\u003cp\u003e“Hey,” she said softly.\u003c/p\u003e\n\u003cp\u003eHe looked at her then. Looked at her as if he had just realized she was there, fully clothed and totally soaked.\u003c/p\u003e\n\u003cp\u003e“Christie,” he murmured. “Christie, I’m so sorry. I shouldn’t have come here.”\u003c/p\u003e\n\u003cp\u003e“But you did. Now, come on out of there.”\u003c/p\u003e\n\u003cp\u003eShe stepped out herself, turning off the water, then handed him a towel. He seemed impatient with himself then, all masculine and silent again. Wrapped in a towel, he found another one, drying her off as he stripped her of her wet clothing. She had meant to offer solace; instead, she found herself swept up in his arms and carried into her room, where he set her on the large upholstered chair by the bed. Then he found some logs in the basket beside the fireplace and set them in the grate on the hearth. It took him only a moment to get a fire started. She thought how striking and grave he looked, his features hard and chiseled in the light of the fire, and she wondered about the thoughts that went through his head. He’d been a cop. He’d seen so much.\u003c/p\u003e\n\u003cp\u003eBut that didn’t mean that what you saw couldn’t tear at your heart.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” she asked. “I brought you a whiskey. There, on the night table.”\u003c/p\u003e\n\u003cp\u003eHe glanced at her with just a trace of amusement in his eyes. “A whiskey, huh?”\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eHe swallowed the generous shot she had poured without a breath, then winced slightly. He poked the fire, then walked over to her. She didn’t know what to say, so she didn’t speak. She simply stood and opened her arms. He stepped into her embrace and just held her for a long moment, then sat down on the bed with her on his lap. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-30.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
