{"id":88758,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhen they reached her house, he turned off the engine and sat in the drive. She didn’t seem to notice at first.\u003c/p\u003e\n\u003cp\u003eBeing at the wake had been hard for her, he knew, but he couldn’t change the way he was feeling right then, and he just didn’t have any sympathy to give—especially when he knew she was lying to him about what she thought she was seeing and what Adam Harrison was doing there. Finally he said, “I’ll walk you in.”\u003c/p\u003e\n\u003cp\u003eShe stared at him with a slightly puzzled expression on her face. Then her expression changed, resigned at first, followed by full-scale angry.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I can find my door from here,” she told him. He caught her arm with a groan when she started to exit the car, and she turned and glared at him angrily. “I’m sorry. I apologize for embarrassing you with Katherine Kidd,” she said politely.\u003c/p\u003e\n\u003cp\u003e“Look, I just don’t believe in ghosts. I’m sure you’ve got your reasons for thinking you see the dead rising, but I just don’t believe in the possibility myself.”\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003e“You are seeing ghosts, right?” he demanded.\u003c/p\u003e\n\u003cp\u003e“Singular, sorry,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Beau Kidd.”\u003c/p\u003e\n\u003cp\u003e“Look, I’m not trying to hurt Katherine or anyone else,” she said. “I don’t want to see Beau Kidd. And I’m sorry you got involved with someone you think is a fruitcake. But don’t worry. You can walk away. Ana and I will still be friends, but you don’t have to have anything to do with me.” She stared at him, her eyes cobalt with indignation. “Now let me go.”\u003c/p\u003e\n\u003cp\u003eHe had no choice but to do so, and the minute he did, she slammed her way out of the car.\u003c/p\u003e\n\u003cp\u003e“Christina!” he said, following, catching her arm again.\u003c/p\u003e\n\u003cp\u003eJust then Tony Lowell’s minivan, with Tony at the wheel and Ilona beside him, pulled into their drive next door. Jed groaned inwardly at the thought that they could see what was going on, and who the hell knew what they would think. It looked like trouble in paradise over here for sure, and they were both looking at him with disapproval.\u003c/p\u003e\n\u003cp\u003e“Hey, guys!” Christina called to them, and forced a smile.\u003c/p\u003e\n\u003cp\u003eThey drove on toward their garage, but they didn’t look convinced.\u003c/p\u003e\n\u003cp\u003e“Look, Christina—”\u003c/p\u003e\n\u003cp\u003e“Please, just let me go. I’m safe. I have friends staying with me. Go keep an eye on Katherine Kidd, why don’t you? I’m sure she could use your help.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t tell whether she sincerely meant that he should be looking after another potential victim, or if there was a touch of jealousy in her words.\u003c/p\u003e\n\u003cp\u003eMaybe he wanted her to be a little bit jealous, he thought.\u003c/p\u003e\n\u003cp\u003e“What does that mean?” he asked her.\u003c/p\u003e\n\u003cp\u003eShe shook her head, staring at him. “I don’t know. I don’t know what anything means at the moment. Good night.”\u003c/p\u003e\n\u003cp\u003eAs she started toward the house, the door opened. Genevieve was standing there, another witness to the whole thing, he suspected.\u003c/p\u003e\n\u003cp\u003eKiller came rushing out to meet his mistress. He jumped up and down, happy to see Christina, then made a beeline for Jed, who bent down to pet the dog.\u003c/p\u003e\n\u003cp\u003e“Killer, come on in now,” Christina called, and the little dog ran back over to her. From the doorway, Genevieve said something to her, and she turned and stared at Jed. “You are coming tomorrow night, aren’t you?” she asked.\u003c/p\u003e\n\u003cp\u003e“Why? What’s the big deal with tomorrow night?” he asked, pushing, hoping for the truth at last.\u003c/p\u003e\n\u003cp\u003e“Adam thinks…” Her voice trailed off, and she looked away.\u003c/p\u003e\n\u003cp\u003e“What?” he asked harshly. “What does Adam think?”\u003c/p\u003e\n\u003cp\u003eShe looked at him again, and said in a rush, “Adam thinks we should have a séance. He thinks it might help catch the killer.” Her eyes met his pleadingly. “Will you come? Please?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Whatever,” she said lightly, then walked inside.\u003c/p\u003e\n\u003cp\u003eHe didn’t have to tell her to lock the door. He heard the bolt snap into place.\u003c/p\u003e\n\u003cp\u003e“Do you think he was there?” Adam asked.\u003c/p\u003e\n\u003cp\u003eShe jumped, having lost total track of the conversation. She had tried not to appear upset about Jed, since no one there knew about the details of their relationship. Actually, she didn’t really know the details of it herself, she realized in mocking silence. Still, there was no reason to let anyone else know she was upset, so when she’d come in, she had started talking about the wake.\u003c/p\u003e\n\u003cp\u003e“It’s very possible that the killer was there,” Adam said, answering his own question.\u003c/p\u003e\n\u003cp\u003e“I think half the state was there,” she told him.\u003c/p\u003e\n\u003cp\u003e“What about Beau?” Adam asked. “Is he here?”\u003c/p\u003e\n\u003cp\u003eGenevieve had made tea, which they were all sipping now in the parlor. She hadn’t seen Beau Kidd since she’d come in, though. Great. No Jed, and now no Beau.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Beau isn’t here. But the problem is, he doesn’t know anything. He thinks the real killer was somewhere behind Larry Atkins, his partner, and that’s why he pulled his weapon. But Larry thought Beau was aiming at him, so he shot him. And since he died and never got the chance to explain, everyone decided he was the Interstate Killer and they stopped looking for anyone else. So he’s haunting me, haunting this house…but he can’t help.”\u003c/p\u003e\n\u003cp\u003eAdam was quiet, thoughtful. “What about the funeral?” he finally asked her.\u003c/p\u003e\n\u003cp\u003e“It was sad.”\u003c/p\u003e\n\u003cp\u003e“I mean…”\u003c/p\u003e\n\u003cp\u003e“He wants to know if the victim haunted her own services,” Genevieve explained.\u003c/p\u003e\n\u003cp\u003eChristina shook her head. “No,” she said softly. “Or if she did, she didn’t show herself to me.”\u003c/p\u003e\n\u003cp\u003e“I still say that tomorrow’s séance will change things,” Adam said.\u003c/p\u003e\n\u003cp\u003e“How?” Christina asked. “Will other people be able to see Beau?”\u003c/p\u003e\n\u003cp\u003e“Maybe, maybe not,” Adam told her.\u003c/p\u003e\n\u003cp\u003e“Then what…?”\u003c/p\u003e\n\u003cp\u003eThor came over and sat on the couch next to her, taking her hands. “Hey, look at me. You can’t imagine a bigger doubter than me.”\u003c/p\u003e\n\u003cp\u003eShe smiled, thinking, Oh, yes, I can. He just left a few minutes ago.\u003c/p\u003e\n\u003cp\u003e“We will discover something tomorrow night,” Thor promised her.\u003c/p\u003e\n\u003cp\u003e“I’m not sure Jed will be here, though,” Christina said.\u003c/p\u003e\n\u003cp\u003e“He’ll show. I guarantee you,” Adam said. “He’ll show.”\u003c/p\u003e\n\u003cp\u003eLife could be a real bitch sometimes, she thought. She’d slept alone most of her life. Jed Braden had slept with her for only two days, yet she felt the loss as if she were bereft of a limb. What an idiot she was. She should have known better than to fall so quickly. Hell, hadn’t she known her whole life not to fall for him at all?\u003c/p\u003e\n\u003cp\u003e“Hey, you okay?”\u003c/p\u003e\n\u003cp\u003eShe had been brushing her hair in front of the old full-length mirror by her bureau. She could see Beau in the mirror, making himself comfortable in the overstuffed chair.\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to…chase Jed away.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I did that all on my own.”\u003c/p\u003e\n\u003cp\u003eHe smiled sympathetically, then moved on to what was really concerning him. “I wish Kitty would believe you…believe in me.”\u003c/p\u003e\n\u003cp\u003eChristina wasn’t feeling all that generous toward Katherine Kidd at that particular moment, but she refrained from saying so to Beau. “She does believe in you, Beau. She’s believed in your innocence all these years. And I’m sure there were many times when it wasn’t easy.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess,” he said. “I just wish she believed I was here now.”\u003c/p\u003e\n\u003cp\u003eShe turned to face him. “You’re a ghost—that’s pretty hard for most people to believe. But you’re here for a reason. We have to figure out this case, Beau. I went to Allison’s wake tonight. It’s so unfair. There has to be a reason why you’re here. Can’t you tell me anything?”\u003c/p\u003e\n\u003cp\u003e“I’ve told you everything I know,” he said irritably.\u003c/p\u003e\n\u003cp\u003eShe walked over to the foot of the bed, sat across from him and set a hand on his knee. It felt real, as if she really were touching something. Someone.\u003c/p\u003e\n\u003cp\u003e“We’re having a séance tomorrow night. Adam thinks it will help.”\u003c/p\u003e\n\u003cp\u003e“I hope so,” he said, though he didn’t sound entirely convinced. “Where is Jed, anyway?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Looking after your sister, I hope,” she said lightly.\u003c/p\u003e\n\u003cp\u003e“Yeah, I hope so, too. Oh, sorry. I hope that I’m not ruining your relationship. I do take off whenever it seems that…well, let’s just say I’m not a voyeur.”\u003c/p\u003e\n\u003cp\u003e“I don’t think it matters anymore, anyway,” she murmured, rising. “I’m going to brush my teeth, wash my face, turn in.” As she walked toward the bathroom, she heard Killer barking at her bedroom door. “Hey, let him in, will you?” she asked.\u003c/p\u003e\n\u003cp\u003eThe door opened, and Killer bounded in. It wasn’t until she had a mouthful of toothpaste that she realized she had asked a ghost to open a door, and he had done so.\u003c/p\u003e\n\u003cp\u003eShe walked back out. “You opened the door.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I make coffee, too, remember?” Beau said.\u003c/p\u003e\n\u003cp\u003eShe smiled. “I just…well, you know. Ghosts are supposed to be insubstantial, able to walk through walls, stuff like that.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Sometimes I know where you are, and I can just…be there. Sometimes I can’t. Sometimes I can move things, and other times I can’t. I didn’t get instructions on how to be a ghost, you know.”\u003c/p\u003e\n\u003cp\u003e“I guess not.”\u003c/p\u003e\n\u003cp\u003eHe smiled at her. “Go to bed. I guess I cost you the guy of your dreams tonight, but I’ll be watching over you. I guess that doesn’t mean much, huh?”\u003c/p\u003e\n\u003cp\u003eShe walked around and kissed his cheek. He really did feel solid, and even warm.\u003c/p\u003e\n\u003cp\u003e“Thank you, Beau,” she said. “Good night.”\u003c/p\u003e\n\u003cp\u003eKiller curled up at the bottom of the bed. She missed Jed with a longing that was both emotional and physical, but it was still good to have the dog at her feet.\u003c/p\u003e\n\u003cp\u003eAnd the ghost of Beau Kidd standing watch. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-40.html","bookId":2271,"creation":"Oct 5, 2019 5:30:57 PM","modification":"Oct 5, 2019 5:30:57 PM"}
