{"id":81244,"no":37,"title":"Page 37","content":"\u003cp\u003e“Why Paris?”\u003c/p\u003e\n\u003cp\u003e“Why the fuck not?”\u003c/p\u003e\n\u003cp\u003e“Because you have a fight in three days!” He makes me laugh when he’s like this. I grab him and kiss him back, deep and fast, before anyone else boards, and I whisper, “Let’s go anywhere with a bed.”\u003c/p\u003e\n\u003cp\u003e“Let’s do it on a swing.”\u003c/p\u003e\n\u003cp\u003e“Remington!”\u003c/p\u003e\n\u003cp\u003e“Let’s do it in an elevator,” he insists.\u003c/p\u003e\n\u003cp\u003eLaughing, I shake an index finger at my big, bad, naughty boy. “I’m never, ever, doing it in an elevator so you’re going to have to find someone else.”\u003c/p\u003e\n\u003cp\u003e“I want you. In an elevator.”\u003c/p\u003e\n\u003cp\u003e“And I want you. In a bed. Like normal people.”\u003c/p\u003e\n\u003cp\u003eHis gaze dips below my waist, and his expression morphs from a playful, smiling sex-god to a dark, sex-starved sex-god. “I want you in those pants you’re wearing.”\u003c/p\u003e\n\u003cp\u003eFeeling warm and wanted, I nod, grin, and lace my fingers through his, kissing each one of his bruised knuckles.\u003c/p\u003e\n\u003cp\u003eHis head tilts in curiosity, and his dimples slowly vanish. He looks like he\u0027s never been given these kinds of attentions until me. Suddenly, it makes me want to give him more.\u003c/p\u003e\n\u003cp\u003eSo I do.\u003c/p\u003e\n\u003cp\u003eCrawling closer to him, I cup his jaw and kiss his hard cheek and run my hands through his hair, watching his gaze go heavy with desire along with something else. Something that makes his eyes look mysteriously dark and liquid.\u003c/p\u003e\n\u003cp\u003eCar doors open.\u003c/p\u003e\n\u003cp\u003eIt appears Coach is riding up front in the limo, so Pete, Riley, and Diane settle on the bench across us. Remy squeezes my fingers as I try to ease away—that action alone telling me not to—then he slides down the edge of his seat and slumps his big shoulders as if he’s trying to make himself less bulky. When that proves impossible due to his size and muscles, he grabs me closer and ducks to settle his head on the soft part of my chest, grunting softly and then sighing.\u003c/p\u003e\n\u003cp\u003eI’m so surprised I don’t move.\u003c/p\u003e\n\u003cp\u003ePete lifts one eyebrow as he watches Remington wrap his arms even tighter around my hips and draws me closer until the side of his head is perfectly cushioned on my breast. He grunts and sighs again. Riley lifts two eyebrows. Diane smiles tenderly, like she just melted.\u003c/p\u003e\n\u003cp\u003eI am not only melted. I’m liquid beneath him.\u003c/p\u003e\n\u003cp\u003eMy parents, a coach and a teacher, are wonderful people but not big on hugs and kisses like, for example, my friend Melanie is, who was showered with affection and spreads it around the world like it’s her duty to. But the way Remington looks at me, the way he doesn’t hide his attraction to me even to his public during his fights, and the way he just cuddled me like a big hibernating bear who just found a cave, makes me ache in inexplicably deep places.\u003c/p\u003e\n\u003cp\u003eQuietly, and with all the tenderness in the world, I run my nails through his spiky dark hair, then trace one fingernail along his ear. He holds both arms securely around my waist, somehow trapping me to him like he’d trap a pillow.\u003c/p\u003e\n\u003cp\u003e“You guys want a time out when we get to the hotel?” Pete asks us, and his timbre vibrates as if some deep emotion touched him.\u003c/p\u003e\n\u003cp\u003eI’m engrossed sifting my fingers through his hair when I feel Remington nod against my chest, not even bothering to lift his heavy head.\u003c/p\u003e\n\u003cp\u003eI’ve never seen him so quiet when he’s manic.\u003c/p\u003e\n\u003cp\u003eOr sit so utterly still.\u003c/p\u003e\n\u003cp\u003ePete and Riley’s stunned expressions completely confirm that they haven’t either.\u003c/p\u003e\n\u003cp\u003eWhen we hit the rooms, we receive our suitcases in our suite, and then I do what I always do. I unzip mine and set my small cosmetics bag hidden under the sink, to begin with.\u003c/p\u003e\n\u003cp\u003eRemy watches me from the door with such fierce longing, I stop brushing my teeth, my mouth full of foam when I notice his stare. He looks hungry. Feral. Almost desperate. I quickly rinse as he approaches and towel off my hands. He’s not smiling. His black eyes swallow me in their depths. He lifts me easily in his arms and carries me back to the room.\u003c/p\u003e\n\u003cp\u003eI can’t help the way my insides flutter as I cuddle into his neck and breathe him in while he lowers us to the bed. I think I know what he wants, but I’m not sure. So I wait and watch him for a moment.\u003c/p\u003e\n\u003cp\u003eHe pulls off my shoes and tosses them aside, then I hear the big thunk of his own crashing to the floor. “I want your hands on my head.”\u003c/p\u003e\n\u003cp\u003eI nod and edge back to make room for him. “Does it calm your racing thoughts?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head, then takes my hand and spreads it open over his wide chest, his voice textured as he traps my gaze with his. “It calms me here.”\u003c/p\u003e\n\u003cp\u003eA tangle of emotion hits me as I feel his heart beating, slow and powerful like only great athletes’ hearts can beat, under my palm. I stare into his eyes, seeing that same fierce longing in them I just saw, and I love him to such a degree I swear that my heart just picked up the rhythm of his.\u003c/p\u003e\n\u003cp\u003eHe slides next to me, both of us dressed as we settle on the bed comforter. He drops his head to my chest and snuggles every bit of his huge muscles into me, inhaling my neck. I lower my face and kiss the top of his head as I start running my fingertips through his scalp.\u003c/p\u003e\n\u003cp\u003eHe hasn’t slept in long, endless, restless, crazy days.\u003c/p\u003e\n\u003cp\u003eDays where I’ve felt him stroking my hair and my back at night. Where I’ve heard the low muted noise of him listening to his music. I’ve heard him eating in the kitchen at midnight, taking cold showers, and when those showers don’t seem like enough, I’ve woken up to find him well on his way to making love to me.\u003c/p\u003e\n\u003cp\u003eBut I haven’t heard him sleep for so long…\u003c/p\u003e\n\u003cp\u003eSo when his breathing evens out, and I realize that he’s fallen asleep in my arms, in the middle of the day, in the middle of a manic episode, I don’t know how I can contain the emotions swelling in my chest.\u003c/p\u003e\n\u003cp\u003eQuietly, I wipe a tear from my cheek, and then another. I never imagined this kind of man existed. Or that I could ever have something like this for myself. These moments. This…connection. I never thought that the desperate, almost painful longing I feel for him could ever be reciprocated from him, to me.\u003c/p\u003e\n\u003cp\u003eCrying in happiness for the first time in my life, I stroke his hair, his jaw, his neck, down his arms, looking down at his perfect, full lips, his hard, strong jaw and forehead, his perfect nose, quietly loving every inch of him.\u003c/p\u003e\n\u003cp\u003eSunlight steals through the room and illuminates him completely, allowing me to drink his perfection in like a junkie. Our shoes are discarded on the floor, our suitcases still bursting full near the door. We’re in yet another beautiful suite of another luxurious hotel, and I swear in my life, I’ve never felt so complete as I do this moment, with this man sleeping in my arms, with his thick arms around me, his nose into my cleavage, his breath warm on my skin. In a strange place, in a new room, far away from everything I’ve known…\u003c/p\u003e\n\u003cp\u003eI touch my lips to his ear. “It’s because of you,” I whisper, closing my eyes. “I’m deliriously happy. Completely at home anywhere you are.”\u003c/p\u003e\n\u003cp\u003eI’m so determined to guard his sleep, I skip dinner even when my stomach rumbles. Soon it calms down, and all the time, I keep giving his big, beautiful body little touches that quietly say—I love you, Remington.\u003c/p\u003e\n\u003cp\u003eHe stirs in the middle of the night, and by this time, I’m exhausted but as determined as ever, my arms heavy as I caress him and pet him.\u003c/p\u003e\n\u003cp\u003eComing awake with a soft groan, he easily grabs me and tucks my body into his so that now I’m the one cuddled into his deep chest as he languorously kisses the hollow of my ear. “Brooke,” he says.\u003c/p\u003e\n\u003cp\u003eJust one word.\u003c/p\u003e\n\u003cp\u003eThick with sleep, and so low and intimate, it could have been a proposal, any proposal, to which my reply would be and always will be, yes.\u003c/p\u003e\n\u003cp\u003e“Yes, Remy,” I whisper, my voice just as groggy as his as I nuzzle his collarbone.\u003c/p\u003e\n\u003cp\u003eHe growls and slowly inhales me. “My Brooke.” Voice still thick and raspy, he fingers the top button of my skinny jeans and lovingly kisses my neck as he pats my butt with one big hand. “Why are you still wearing these?”\u003c/p\u003e\n\u003cp\u003eBefore I can remind him why, I hear him flick open the button and slide the zipper purposely downward.\u003c/p\u003e\n\u003cp\u003eMy every muscle clenches. I groan softly and press my nose to his neck, pressing closer like a kitten aching for his petting. “I was waiting for the sexiest man in the world to take them off me.”\u003c/p\u003e\n\u003cp\u003eAround 3 a.m., Remington grumbles “hungry” in my ear and gets up to assault the kitchen, and as I lie in bed and stretch, my stomach instantly agrees.\u003c/p\u003e\n\u003cp\u003eI turn on a lamp and slide into the first thing that pops out of his suitcase, which ends up being one of his RIPTIDE red satin robes.\u003c/p\u003e\n\u003cp\u003eI tie the sash tightly around my waist, and the fabric feels delicious and cool against my skin. The robe is huge on me, reaching all the way to the bottom of my calves, but I grin because I just love wearing his things. I pad out after him to inspect whatever Diane left for us in the kitchen.\u003c/p\u003e\n\u003cp\u003eInside the hot drawer are two warm plates of parmesan crusted chicken and a spinach and beet salad with a side of red potatoes. I pull them out and get our utensils when I spot Remington already lounging at the dining table, gloriously bare-chested and in a pair of low slung sweat pants.\u003c/p\u003e\n\u003cp\u003eHe’s scooping up peanut butter on a celery stick and munching, but he stops eating when he spots me and immediately swallows whatever he had in his mouth.\u003c/p\u003e\n\u003cp\u003eHis eyes widen, and he drops the remaining celery stick and leans back in his chair, crossing his muscled arms so the ink vines at the top of his biceps look dark and sexy. “Look at you,” he says, the words a growl of pure male pleasure.\u003c/p\u003e\n\u003cp\u003eThe word RIPTIDE burns deliciously into my back as I head over with the plates, grinning. “I’ll return it when we get back to bed.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head and pats his lap. “If it’s mine, it’s yours.”\u003c/p\u003e\n\u003cp\u003eI set the food on the table, and he cups my hips through the satin and draws me to sit on his lap. “I’m so fucking starved.”\u003c/p\u003e\n\u003cp\u003eHe grabs a slice of red potato with his fingers and pops it into his mouth, licking his fingertips.\u003c/p\u003e\n\u003cp\u003e“You would love my mom’s red potatoes. She adds cayenne pepper and gives them just a little kick,” I tell him as I fork one up and munch, and the taste of rosemary and the perfectly cooked potato melt on my tongue.\u003c/p\u003e\n\u003cp\u003e“Do you miss home?”\u003c/p\u003e\n\u003cp\u003eThe question makes me look at him as he finishes another potato, and I realize he hasn’t ever really had a home. Has he?\u003c/p\u003e\n\u003cp\u003eHis home has been a fighting ring and tons of hotels. His family has been his team and his fans.\u003c/p\u003e\n\u003cp\u003eMy chest swells to near bursting for him.\u003c/p\u003e\n\u003cp\u003eThe time he locked me with him in his hotel suite, just after I saw Pete sedate him that first time, Remy had been in a depression and I hadn’t even known. He’d been holding onto me to stay sane, but I hadn’t known this either.\u003c/p\u003e\n\u003cp\u003eAll I’d known was that he didn’t want me to leave that room and he didn’t want anyone in. He wanted me there. He wanted my touch as if it grounded him, and my mouth was the only warmth in his cold, the only light in his dark.\u003c/p\u003e\n\u003cp\u003eRemington is not a man of words. He is a man of gut and actions.\u003c/p\u003e\n\u003cp\u003eThis big, strong man sometimes needs to be taken care of, and I swear I’m dying to be the girl who takes care of him more than I’ve wanted to be anything else.\u003c/p\u003e\n\u003cp\u003eHe, who’s never had a home, wants to know if I miss home?\u003c/p\u003e\n\u003cp\u003eWhen I sleep like a queen, in a soft bed, in his arms, and eat the best food there is, and do my job, and spend time with him when he is sometimes cocky, sometimes grumpy, and always adorable? \u003c/p\u003e","sourceLink":"https://allnovel.net/real-real-1/page-37.html","bookId":2736,"creation":"Oct 5, 2019 4:35:06 PM","modification":"Oct 5, 2019 4:35:06 PM"}
