{"id":81251,"no":44,"title":"Page 44","content":"\u003cp\u003e“With Remington?” Nora asks.\u003c/p\u003e\n\u003cp\u003e“Nora, your sister is, despite her not being the type to fall so hard, head over heels, crazy in love with this guy. And he’s been after her for months,” Mel tells her, handing me back the card.\u003c/p\u003e\n\u003cp\u003eWe both gauge her reaction, and her mouth parts in surprise as she points at herself. “Oh. You thought I…? I wasn’t talking about Remington wanting me. I said Remington is super hot, but I was talking about Pete.”\u003c/p\u003e\n\u003cp\u003e“Pete!” I laugh in delight and relief and squish her between my arms again. “Oh, Pedro is such a great guy. If I go back to work, I have a feeling you’ll be seeing him.”\u003c/p\u003e\n\u003cp\u003e“Brooke, I realize I’ve always been a bit too … romantic, but what he did,” she tells me, her eyes serious. “Remington, I mean… Brooke, I’ve never, ever, seen a man fight like that for anyone.”\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I nod and hold one arm around her shoulders until Melanie squeals, “Sandwich!” and comes to hug me from the other side until they’re both almost killing me with love.\u003c/p\u003e\n\u003cp\u003e“You’re going to fly me up often?” Mel murmurs in my ear when she moves back.\u003c/p\u003e\n\u003cp\u003e“Both of you,” I promise. Even if I have to save like crazy to do so.\u003c/p\u003e\n\u003cp\u003eThirty-six hours later, I’ve settled Nora with Mom and Dad, and they keep asking her about those crocodiles. Poor Nora is going to have to pay for all her lies now that she’s being asked about the Indian culture and the Eiffel Tower and the works.\u003c/p\u003e\n\u003cp\u003eMelanie helped me pack and was a little tearful when she waved me off in the taxi, but I kept telling her, “It’s not forever! It’s seasonal, you little wimp. And I’ll be flying you up like crazy.”\u003c/p\u003e\n\u003cp\u003eMy voice was confident, but honestly, I don’t even know how my meeting or interview or whatever it’s going to be called will go this evening. I just know that I’m heading for Remy, and my body already feels like a battlefield of desire, fear, longing, love, need, and regret.\u003c/p\u003e\n\u003cp\u003eI’m not sure which Remy I’m going to get tonight. All I know is that Remington Tate is not a man people plan long-term relationships with. He’s a magnet to women and trouble, and he has a dark side that’s not easily controlled.\u003c/p\u003e\n\u003cp\u003eHe’s my beast. My dark and my light. Mine.\u003c/p\u003e\n\u003cp\u003eThere’s just no other option for me except ending up with him.\u003c/p\u003e\n\u003cp\u003e“We’re so damned glad to see you! I’d hug you if I wasn’t afraid of losing my neck later in the day,” Riley says when he spots me across the threshold, and he’s grinning so hard, his sad surfer eyes seem to light up in real glee.\u003c/p\u003e\n\u003cp\u003e“Hey, I thought you guys were poor. Poor people don’t rent presidential suites,” I say as I come in and drop my bags at the door.\u003c/p\u003e\n\u003cp\u003e“Poor by Remy’s former standards.” Pete comes over to carry my bags into one of the rooms. “He spends several million a year, so naturally, he has to keep producing as much, but he sold the Austin house, and we’re working on getting some endorsements as we speak.”\u003c/p\u003e\n\u003cp\u003eNodding, I steal a longing glance down the hall at the bedrooms, wondering if he’s here. When the guys usher me to the living room, I finally break down and say, “All right, so I need to know if Mr. Tate is still interested in my services? As a rehab specialist?”\u003c/p\u003e\n\u003cp\u003e“Of course,” Pete assures, plopping down on a couch and playing with his tie like he always does. “He wants to focus on what’s important. He wants you, and he’s been very specific about wanting no one else.”\u003c/p\u003e\n\u003cp\u003eI laugh, then go sober when they both stare at me like I’m a falling star and they’ve just caught me. “Guys,” I say, rolling my eyes. “Don’t be obtuse. Is he here? Did he tell you to torture me endlessly?”\u003c/p\u003e\n\u003cp\u003e“Never!” They both laugh, and Pete recovers first, his expression sobering. “He’s paced the length a thousand times these past days. He went out for a run now.” He holds my gaze in a haunted way, his voice dropping considerably as he sits up and leans on his knees. “Your letter, Brooke. He’s read it about a thousand times. He won’t talk to us. We don’t know what he’s feeling.”\u003c/p\u003e\n\u003cp\u003eThe sound of a closing door reaches me, and when I leap to my feet, my breath goes.\u003c/p\u003e\n\u003cp\u003eStanding across the room, covered in sweat, is the reason I’m ready to go all out and gamble everything on my love for him. My heart stays still for a moment, and then it jumps at full speed, because this man does that to me. I sprint for him even when I’m standing still.\u003c/p\u003e\n\u003cp\u003eHis hair is perfectly messy, and he stands there, the sex god of my dreams, my blue-turned-black-eyed devil of my dreams. He looks at me, then at Pete, then at Riley, then he starts for me, his kick-ass running shoes muffled in the carpet. I can see the emotions evolve in his eyes, starting with surprise, with a hint of anger, and then pure red-hot need.\u003c/p\u003e\n\u003cp\u003eI don’t know how long I stare at him, but it’s long, until I feel the chemistry crackle in the air like something unreal and electric leaping between us. His chest rises and falls, and a wild desperate need to close the emotional distance between us makes my chest ache.\u003c/p\u003e\n\u003cp\u003e“I’d like to talk to you, Remington, if you have a moment.”\u003c/p\u003e\n\u003cp\u003e“Yes, Brooke, I want to talk to you too.”\u003c/p\u003e\n\u003cp\u003eHis flat tone does nothing to help my rapidly fleeing confidence, but I follow closely at his heels. The slight autumn smell mingled with a scent of ocean clinging to his skin gets me awfully hot, and I’m almost cross-eyed with desire when he leads me into the master bedroom.\u003c/p\u003e\n\u003cp\u003eHe closes the door behind him and turns to me, and a shot of heat shoots through me as he curls a hot, big hand around my neck and bends to scent me. Undone by the possessive gesture of his nose buried in my hair as he drags in a long, deep inhale, I grab his t-shirt in all my fingers and bury my face in it, aching for him. “Don’t let me go please,” I beg. He wrenches free of my grip and releases me, almost as if he’s annoyed he grabbed me in the first place.\u003c/p\u003e\n\u003cp\u003e“If you want me so much, then why’d you leave?” He unnerves me as he watches me sit down on the bench at the foot of the bed and crosses his powerful arms, his eyebrows drawn together as he widens his stance almost threateningly. “Did I say anything when I was manic?”\u003c/p\u003e\n\u003cp\u003eWith a sudden vivid recollection, I remember every amazing memory, and I seize on one. “You wanted to take me to Paris.”\u003c/p\u003e\n\u003cp\u003e“That’s a bad thing?”\u003c/p\u003e\n\u003cp\u003e“And make love to me in an elevator.”\u003c/p\u003e\n\u003cp\u003e“Did I?”\u003c/p\u003e\n\u003cp\u003e“And to have me in my pink pants,” I thickly admit, and an unexpected warmth climbs up my cheeks.\u003c/p\u003e\n\u003cp\u003eHe keeps staring at me, his face taut in an unreadable mask. His arms are crossed tight as if he’s holding his raging emotions in. I’m shaking because I can’t determine if the look in his eyes is love, or hate. It is simply consuming. Consuming me.\u003c/p\u003e\n\u003cp\u003e“You forgot the part where we played each other a song,” he tells me in a quiet murmur, and the realization that he probably remembers the tender way he made love to me after that causes a burning emotion in my chest to quickly spread up my throat.\u003c/p\u003e\n\u003cp\u003eI hold my breath in silent shock when he reaches for my hand and takes it in his dry, firm grasp, lifting my fingers to his lips.\u003c/p\u003e\n\u003cp\u003eMy heart speeds up as I stay in my seat, watching in delicious agony as he turns my hand in his grip. He stares down at the center of my palm before he bends to flatten his tongue over my skin and gently licks me. Need explodes in my tummy.\u003c/p\u003e\n\u003cp\u003e“That picture made me very angry, Brooke,” he rasps into my skin, as he drags his tongue wetly across the sensitive nerves at the center of my palm. “When you belong to someone … you don’t kiss anyone else. You don’t kiss his enemy. You don’t lie to him. Betray him.”\u003c/p\u003e\n\u003cp\u003eMy systems roar back to life as his teeth graze the heel of my palm.\u003c/p\u003e\n\u003cp\u003eMy voice shudders out of me. “I’m sorry. I wanted to protect you, like you protect me. I won’t ever go behind your back again, Remy. I didn’t leave because you were manic, I just didn’t want you to get manic or low because of me.”\u003c/p\u003e\n\u003cp\u003eHe gives me a dark nod as he rakes a quick, thirsty look over me, and he lowers my hand back to my lap. “There’s something I might have missed then. Because I still can’t understand why, the fuck, you would leave me when I fucking needed you!”\u003c/p\u003e\n\u003cp\u003eThe pain in his voice strikes a chord within me, and instantly my eyes sting.\u003c/p\u003e\n\u003cp\u003e“Remy, I’m sorry!” I cry wretchedly.\u003c/p\u003e\n\u003cp\u003eHe groans, agitated, then he pulls out the letter I wrote from the pocket of the jeans draped haphazardly on a chair by the corner. The paper is crumpled and broken in the middle from so many reads. “Did you mean what you wrote to me?” Hearing his dense, distressed voice causes the little hairs on my body to jump.\u003c/p\u003e\n\u003cp\u003e“Which part?”\u003c/p\u003e\n\u003cp\u003eHe grabs the paper, and yanks it open, ramming a thick finger to the words:\u003c/p\u003e\n\u003cp\u003eI love you, Remy.\u003c/p\u003e\n\u003cp\u003eThen, he crumples it in his fist again, watching me in anger and despair. My heart constricts as I realize he can’t even say the word out loud to me.\u003c/p\u003e\n\u003cp\u003eWho has ever told him that they love him?\u003c/p\u003e\n\u003cp\u003eI have.\u003c/p\u003e\n\u003cp\u003eIn a letter.\u003c/p\u003e\n\u003cp\u003eIn a thousand songs.\u003c/p\u003e\n\u003cp\u003eBut not out loud.\u003c/p\u003e\n\u003cp\u003eEven his parents only wanted money. They never accepted him or gave him the love he deserved. And me? Oh, god, I left him. Just like everyone else. Throat thick, I nod up and down really fast, and his jaw clamps as hard as rock, as if he’s holding some wild feeling back. “Say it,” he coarsely whispers.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I need to hear it.”\u003c/p\u003e\n\u003cp\u003e“Why do you need to hear it?”\u003c/p\u003e\n\u003cp\u003e“Is that the reason you left after the fight?”\u003c/p\u003e\n\u003cp\u003eBurning tears fill my eyes.\u003c/p\u003e\n\u003cp\u003eThere’s desperation in his question, and I think he wants to know so badly because it might be the only reason he’ll be able to get over my leaving.\u003c/p\u003e\n\u003cp\u003eRaw pain opens new in my chest as I imagine him waking up in that hospital bed, after what he did for me, to realize that I left. When I’d said I’d never get enough of him …\u003c/p\u003e\n\u003cp\u003e“Is it, Brooke? Why you left? Or because you’re ready to quit on me? I thought you had more mettle, little firecracker, I really did.”\u003c/p\u003e\n\u003cp\u003eHe’s wildly searching my face, and I feel just as wild looking back at his breathtakingly handsome features, noting the slight scar above his eyebrows remains.\u003c/p\u003e\n\u003cp\u003eI touch it on impulse, and the instant my finger connects with his healing skin, the words burst out of me.\u003c/p\u003e\n\u003cp\u003e“I love you. I love you.” His breath seizes in his chest, and I continue in a rush. “More than I’ve ever thought it possible to love any other human being. I left because you broke my heart, again and again that night, with every one of your bones. I left because I couldn’t take it anymore!”\u003c/p\u003e\n\u003cp\u003eHe closes his eyes, and his torment reaches me so deep, my own confession opening me, making me vulnerable. I hear his ragged exhale of breath, and I’m hurting all over at the memory of what he did for me, to rescue Nora. I drop my hand, and my voice trembles fiercely. “I don’t want you to ever let anyone hurt you deliberately again. Ever. Not even for me, Remy. Never. You are worth. Too. Much! Do you hear me?”\u003c/p\u003e\n\u003cp\u003eHe lifts his hand and cups my face in fiercely trembling hands and draws me up against him, and I shudder as I absorb the feeling of his arms again. My heart pounds because I know this is the first night of the rest of my life, and I want it to be. \u003c/p\u003e","sourceLink":"https://allnovel.net/real-real-1/page-44.html","bookId":2736,"creation":"Oct 5, 2019 4:35:06 PM","modification":"Oct 5, 2019 4:35:06 PM"}
