{"id":81253,"no":46,"title":"Page 46","content":"\u003cp\u003eHe hauls me back, naked on his lap, taking my mouth again. He has me so wound up with his kisses, I’m afraid I’m going to climax the instant he thrusts inside me.\u003c/p\u003e\n\u003cp\u003eOh, god, I need it so bad, I don’t even realize I’m curling my legs to straddle him, rubbing myself over his hard-on. I want it. Inside me. I want him so fiercely I can’t stop trembling. “I love you,” I breathe.\u003c/p\u003e\n\u003cp\u003eIt’s incredible. I lived my entire life without him, but we made this crazy connection, and I just feel empty without him.\u003c/p\u003e\n\u003cp\u003eHe drugs me with another kiss as I undulate my body against his, teased with his hardness, his hot mouth, his groans. He’s making me want him in the wildest, most intense ways. He pulls free, reaching into his running shorts.\u003c/p\u003e\n\u003cp\u003e“I want to play you Avril Lavigne’s ‘I Love You’ again,” I say as he tries pushing them off without sacrificing my spot on his lap.\u003c/p\u003e\n\u003cp\u003e“I’ll get my headphones when we finish,” he murmurs, successfully shoving them off one leg, and now his arms bulge as he works to get them off the other.\u003c/p\u003e\n\u003cp\u003eI moan in gratitude at the thought of being able to hear music again with joy, especially when all I could think of was listening to “Iris” again and fearing how deeply it would cut me. Every single song, without Remy to play to, cut me open.\u003c/p\u003e\n\u003cp\u003eI’m inundated with emotion as I nuzzle his hair, sliding my fingers in it. “And also ‘That’s When I Knew’ by Alicia Keys.” I start to sing this heartbreakingly romantic song in his ear and he makes an odd sound between a chuckle and a groan.\u003c/p\u003e\n\u003cp\u003e“You don’t sing for shit, baby,” he murmurs.\u003c/p\u003e\n\u003cp\u003eWe stop laughing when he enters me. I gasp. He groans.\u003c/p\u003e\n\u003cp\u003eHis mouth crushes mine, and our thirst is unquenchable. He rocks his hips powerfully, his muscles clenching, his thighs underneath me, his abs against mine, his biceps around me. I love feeling his strength when he makes love to me, in his rocking motions, in his arms, in his powerful erection. I love…\u003c/p\u003e\n\u003cp\u003eHere I go again.\u003c/p\u003e\n\u003cp\u003eI love everything about him.\u003c/p\u003e\n\u003cp\u003e“Brooke Dumas,” he murmurs, licking into my ear, his eyes sparkling. “I’m Remington.”\u003c/p\u003e\n\u003cp\u003eI laugh, then moan and dissolve into him.\u003c/p\u003e\n\u003cp\u003eSeriously, he’s so fucking sexy I can’t stand it.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eREMINGTON\u003c/p\u003e\n\u003cp\u003eI still sometimes can’t believe Brooke loves me.\u003c/p\u003e\n\u003cp\u003eI get crazy when she talks to Pete and Riley, and sometimes, I can’t sleep for fear of waking up and finding she’s not next to me. I start getting jealous of myself and fear I’m going to lose my shit, but when she touches me, I find anchor.\u003c/p\u003e\n\u003cp\u003eI fight for her tonight, and I want her eyes only on me. I want her hands on me later. And the way she tells me she loves me. She shows it too, but I have never in my life heard it before. She puts love songs to me, and I cling to the lyrics like she wrote them for me. Sometimes, I have trouble putting to words how I feel. Sometimes, I feel a thousand things at once and can’t find a single word to tell her what I want to say. That’s why I look for songs, and as soon as it hits a chord in me, I can’t wait to play it to her. I played “Iris” for her because I wanted her to know that I’d do all kinds of crazy shit just to be with her, and more than that, I wanted her to know me.\u003c/p\u003e\n\u003cp\u003eShe does.\u003c/p\u003e\n\u003cp\u003eShe may know parts of me even I don’t.\u003c/p\u003e\n\u003cp\u003eEvery time I wake up, I check her out. “Did I hurt you?” I ask.\u003c/p\u003e\n\u003cp\u003eSometimes I remember when I’m black, but other times I don’t. All my life falls apart when I’m black.\u003c/p\u003e\n\u003cp\u003eI’m afraid to hurt her.\u003c/p\u003e\n\u003cp\u003eI’m afraid she’s gonna go again.\u003c/p\u003e\n\u003cp\u003eBut then, she tells me she promises to let me know the shit I did or said, and that appeases me. Honestly, I don’t think I have it in me to hurt her. It’s grounded in me to protect her even from myself. I think even black Remington will kill himself before he hurts her.\u003c/p\u003e\n\u003cp\u003eBut I still dream I wake up and hear that I did something stupid and she’s gone.\u003c/p\u003e\n\u003cp\u003eShe tells me every night I’m her real.\u003c/p\u003e\n\u003cp\u003eShe’s my real. She’s my only.\u003c/p\u003e\n\u003cp\u003eBut I want it on paper.\u003c/p\u003e\n\u003cp\u003eI want to win this year and when I do, I’m going to ask her for it.\u003c/p\u003e\n\u003cp\u003eBecause she’s mine.\u003c/p\u003e\n\u003cp\u003eTonight, I hear the crowd as I come up on the ring, and I suck it in me, let it feed me, but I’m already turning to stop at the point where she’s sitting. Every detail of what she is wearing tonight is in my head. I see a face that has eyes so gold, I feel richer than a country. Her cheeks rosy. Her smile wide.\u003c/p\u003e\n\u003cp\u003eAnd the sight of her hits me like adrenaline.\u003c/p\u003e\n\u003cp\u003eA rise on dopamine.\u003c/p\u003e\n\u003cp\u003eTestosterone.\u003c/p\u003e\n\u003cp\u003eEndorphins.\u003c/p\u003e\n\u003cp\u003eI’m jacked with it. She jacks me with it, and I smile and point at her, as I plan to do from now on so she knows, “This one’s for you.”\u003c/p\u003e\n\u003cp\u003eIt’s all.\u003c/p\u003e\n\u003cp\u003eFor you.\u003c/p\u003e\n\u003cp\u003eBrooke Dumas.\u003c/p\u003e\n\u003cp\u003eShe blows me a kiss and I catch it in my palm.\u003c/p\u003e\n\u003cp\u003eCrowd loves it like I love her.\u003c/p\u003e\n\u003cp\u003eAnd then I put it in my mouth, and they roar.\u003c/p\u003e\n\u003cp\u003eAnd I point at her, laughing, seeing the lights in her eyes, and I can’t wait to be inside her, hear her sigh for me, come for me.\u003c/p\u003e\n\u003cp\u003eI’m high already. The surge of adrenaline pumps through me. I’m going to beat anything they put in my way just to be the victor. To show this female that I, me, Remington Fucking Tate, is the male she wants.\u003c/p\u003e\n\u003cp\u003e“The one and only, Remington ‘Riptide’ Tate!”\u003c/p\u003e\n\u003cp\u003eI hear my name once more, and I’m high with the crowd, high with her smile.\u003c/p\u003e\n\u003cp\u003eHigh on her. \u003c/p\u003e","sourceLink":"https://allnovel.net/real-real-1/page-46.html","bookId":2736,"creation":"Oct 5, 2019 4:35:06 PM","modification":"Oct 5, 2019 4:35:06 PM"}
