{"id":39033,"no":18,"title":"The Problem of the Broken Bracelet","content":"The girl in the green mask leaned against the foot of the bed and idly fingered a revolver which lay in the palm of her daintily gloved hand. The dim glow of the night lamp enveloped her softly, and added a sinister glint to the bright steel of the weapon. Cowering in the bed was another figure — the figure of a woman. Sheets and blankets were drawn up tightly to her chin, and startled eyes peered anxiously, as if fascinated, at the revolver.\n\u003cbr\u003e \n\u003cbr\u003e “Now please don’t scream!” warned the masked girl. Her voice was quite casual, the tone in which one might have discussed an affair of far removed personal interest. “It would be perfectly useless, and besides dangerous.”\n\u003cbr\u003e \n\u003cbr\u003e “Who are you?” gasped the woman in the bed, staring horror stricken at the inscrutable mask of her visitor. “What do you want?”\n\u003cbr\u003e \n\u003cbr\u003e A faint flicker of amusement lay in the shadowy eyes of the masked girl, and her red lips twitched slightly. “I don’t think I can be mistaken,” she said inquiringly. “This is Miss Isabel Leigh Harding?”\n\u003cbr\u003e \n\u003cbr\u003e “Y-yes,” was the chattering reply.\n\u003cbr\u003e \n\u003cbr\u003e “Originally of Virginia?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Great-granddaughter of William Tremaine Harding, an officer in the Continental Army about 1775?”\n\u003cbr\u003e \n\u003cbr\u003e The inflection of the questioning voice had risen almost imperceptibly; but the tone remained coldly, exquisitely courteous. At the last question the masked girl leaned forward a little expectantly.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” faltered Miss Harding faintly.\n\u003cbr\u003e \n\u003cbr\u003e “Good, very good,” commented the masked girl, and there was a note of repressed triumph in her voice. “I congratulate you, Miss Harding, upon your self possession. Under the same circumstances most women would have begun by screaming. I should have myself.”\n\u003cbr\u003e \n\u003cbr\u003e “But who are you?” demanded Miss Harding again. “How did you get in here? What do you want?”\n\u003cbr\u003e \n\u003cbr\u003e She sat bolt upright in bed, with less of fear now than curiosity in her manner, and her luxuriant hair tumbled about her semibare shoulders in profuse dishevelment.\n\u003cbr\u003e \n\u003cbr\u003e At the sudden movement the masked girl took a firmer grip on the revolver, and moved it forward a little threateningly. “Now please don’t make any mistake!” she advised Miss Harding pleasantly. “You will notice that I have drawn the bell rope up beyond your reach and knotted it. The servants are on the floor above in the extreme rear, and I doubt if they would hear a scream. Your companion is away for the night, and besides there is this.” She tapped her weapon significantly. “Furthermore, you may notice that the lamp is beyond your reach; so that you cannot extinguish it as long as you remain in bed.”\n\u003cbr\u003e \n\u003cbr\u003e Miss Harding saw all these things, and was convinced.\n\u003cbr\u003e \n\u003cbr\u003e “Now as to your question,” continued the masked girl quietly. “My identity is of absolutely no concern or importance to you. You would not even recognize my name if I gave it to you. How did I get here? By opening an unfastened window in the drawing room on the first floor and walking in. I shall leave it unlatched when I go; so perhaps you had better have some one fasten it, otherwise thieves may enter.” She smiled a little at the astonishment in Miss Harding’s face. “Now as to why I am here and what I want.”\n\u003cbr\u003e \n\u003cbr\u003e She sat down on the foot of the bed, drew her cloak more closely about her, and folded her hands in her lap. Miss Harding placed a pillow and lounged against it comfortably, watching her visitor in astonishment. Except for the mask and the revolver, it might have been a cozy chat in any woman’s boudoir.\n\u003cbr\u003e \n\u003cbr\u003e “I came here to borrow from you — borrow, understand,” the masked girl went on, “the least valuable article in your jewel box.”\n\u003cbr\u003e \n\u003cbr\u003e “My jewel box!” gasped Miss Harding suddenly. She had just thought of it, and glanced around at the table where it lay open.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t alarm yourself,” the masked girl remarked reassuringly; “I have removed nothing from it.”\n\u003cbr\u003e \n\u003cbr\u003e The light of the lamp fell full upon the open casket whence radiated multicolored flashes of gems. Miss Harding craned her neck a little to see, and seeing sank back against her pillow with a sigh of relief.\n\u003cbr\u003e \n\u003cbr\u003e “As I said, I came to borrow one thing,” the masked girl continued evenly. “If I cannot borrow it, I shall take it.”\n\u003cbr\u003e \n\u003cbr\u003e Miss Harding sat for a moment in mute contemplation of her visitor. She was searching her mind for some tangible explanation of this nightmarish thing. After awhile she shook her head, meaning thereby that even conjecture was futile. “What particular article do you want?” she asked finally.\n\u003cbr\u003e \n\u003cbr\u003e “Specifically by letter, from the prison in which he was executed by order of the British commander, your great-grandfather, William Tremaine Harding, left a gold bracelet, a plain band, to your grandfather,” the masked girl explained; “Your grandfather, at that time a child, received the bracelet, when twenty-one years old, from the persons who held it in trust for him, and on his death, March 25, 1853, left it to your father. Your father died intestate in April, 1898, and the bracelet passed into your mother’s keeping, there being no son. Your mother died within the last year. Therefore, the bracelet is now, or should be, in your possession. You see,” she concluded, “I have taken pains to acquaint myself with your family history.”\n\u003cbr\u003e \n\u003cbr\u003e “You have,” Miss Harding assented. “And may I ask why you want this bracelet?”\n\u003cbr\u003e \n\u003cbr\u003e “I should answer that it was no concern of yours.”\n\u003cbr\u003e \n\u003cbr\u003e “You said borrow it, I believe?”\n\u003cbr\u003e \n\u003cbr\u003e “Either I will borrow it or take it.”\n\u003cbr\u003e \n\u003cbr\u003e “Is there any certainty that it will ever be returned? And if so, when?”\n\u003cbr\u003e \n\u003cbr\u003e “You will have to take my word for that, of course,” replied the masked girl. “I shall return it within a few days.”\n\u003cbr\u003e \n\u003cbr\u003e Miss Harding glanced at her jewel box. “Have you looked there?” she inquired.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” replied the masked girl. “It isn’t there.”\n\u003cbr\u003e \n\u003cbr\u003e “Not there?” repeated Miss Harding.\n\u003cbr\u003e \n\u003cbr\u003e “If it had been there I should have taken it and gone away without disturbing you,” the masked girl went on. “Its absence is what caused me to wake you.”\n\u003cbr\u003e \n\u003cbr\u003e “Not there!” said Miss Harding again wonderingly, and she moved as if to get up.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t do that, please!” warned the masked girl quickly. “I shall hand you the box if you like.”\n\u003cbr\u003e \n\u003cbr\u003e She arose and passed the casket to Miss Harding, who spilled out the contents in her lap.\n\u003cbr\u003e \n\u003cbr\u003e “Why, it is gone!” she exclaimed.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, from there,” said the other a little grimly. “Now please tell me immediately where it is. It will save trouble.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know,” replied Miss Harding hopelessly.\n\u003cbr\u003e \n\u003cbr\u003e The masked girl stared at her coldly for a moment, then drew back the hammer of the revolver until it clicked.\n\u003cbr\u003e \n\u003cbr\u003e Miss Harding stared in sudden terror.\n\u003cbr\u003e \n\u003cbr\u003e “All this is merely time wasted,” said the masked girl sternly, coldly. “Either the bracelet or this!” Again she tapped the revolver.\n\u003cbr\u003e \n\u003cbr\u003e “If it is not here, I don’t know where it is,” Miss Harding rushed on desperately. “I placed it here at ten o’clock tonight — here in this box — when I undressed. I don’t know — I can’t imagine —”\n\u003cbr\u003e \n\u003cbr\u003e The masked girl tapped the revolver again several times with one gloved finger. “The bracelet!” she demanded impatiently.\n\u003cbr\u003e \n\u003cbr\u003e Fear was in Miss Harding’s eyes now, and she made a helpless, pleading gesture with both white hands. “You wouldn’t kill me — murder me!” she gasped. “I don’t know. I— Here, take the other jewels. I can’t tell you.”\n\u003cbr\u003e \n\u003cbr\u003e “The other jewels are of absolutely no use to me,” said the girl coldly. “I want only the bracelet.”\n\u003cbr\u003e \n\u003cbr\u003e “On my honor,” faltered Miss Harding, “I don’t know where it is. I can’t imagine what has happened to it. I— I—” she stopped helplessly.\n\u003cbr\u003e \n\u003cbr\u003e The masked girl raised the weapon threateningly, and Miss Harding stared in cringing horror.\n\u003cbr\u003e \n\u003cbr\u003e “Please, please, I don’t know!” she pleaded hysterically.\n\u003cbr\u003e \n\u003cbr\u003e For a little while the masked girl was thoughtfully silent. One shoe tapped the floor rhythmically; the eyes were contracted. “I believe you,” she said slowly at last. She arose suddenly and drew her coat closely about her. “Good night,” she added as she started toward the door. There she turned back. “It would not be wise for you to give an alarm for at least half an hour. Then you had better have some one latch the window in the drawing room. I shall leave it unfastened. Good night.”\n\u003cbr\u003e \n\u003cbr\u003e And she was gone.\n\u003cbr\u003e \n\u003cbr\u003e Hutchinson Hatch, reporter, had just finished relating the story to The Thinking Machine, incident by incident, as it had been reported to Chief of Detectives Mallory, when the eminent scientist’s aged servant, Martha, tapped on the door of the reception room and entered with a card.\n\u003cbr\u003e \n\u003cbr\u003e “A lady to see you, sir,” she announced.\n\u003cbr\u003e \n\u003cbr\u003e The scientist extended one slender white hand, took the card, and glanced at it.\n\u003cbr\u003e \n\u003cbr\u003e “Your story is merely what Miss Harding told the police?” he inquired of the reporter. “You didn’t get it from Miss Harding herself?”\n\u003cbr\u003e \n\u003cbr\u003e “No, I didn’t see her.”\n\u003cbr\u003e \n\u003cbr\u003e “Show the lady in, Martha,” directed The Thinking Machine. She turned and went out, and he passed the card to the reporter.\n\u003cbr\u003e \n\u003cbr\u003e “By George! it’s Miss Harding herself!” Hatch exclaimed. “Now we can get it all straight.”\n\u003cbr\u003e \n\u003cbr\u003e There was a little pause, and Martha ushered a young woman into the room. She was girlish, slender, daintily yet immaculately attired, with deep brown eyes, firmly molded chin and mouth, and wavy hair. Hatch’s expression of curiosity gave way to one of frank admiration as he regarded her. There was only the most impersonal sort of interest in the watery blue eyes of The Thinking Machine. She stood for a moment with gaze alternating between the distinguished man of science and the reporter.\n\u003cbr\u003e \n\u003cbr\u003e “I am Mr. Van Dusen,” explained The Thinking Machine. “Allow me, Miss Harding — Mr. Hatch.”\n\u003cbr\u003e \n\u003cbr\u003e The girl smiled and offered a gloved hand cordially to each of the two men. The Thinking Machine merely touched it respectfully; Hatch shook it warmly. The eyes were veiled demurely for an instant, then the lids were lifted suddenly, and she favored the newspaper man with a gaze that sent the blood to his cheeks.\n\u003cbr\u003e \n\u003cbr\u003e “Be seated, Miss Harding,” the scientist invited.\n\u003cbr\u003e \n\u003cbr\u003e “I hardly know just what I came to say, and just how to say it,” she began uncertainly, and smiled a little. “And anyway I had hoped that you were alone; so —”\n\u003cbr\u003e \n\u003cbr\u003e “You may speak with perfect freedom before Mr. Hatch,” interrupted The Thinking Machine. “Perhaps I shall be able to aid you; but first will you repeat the history of the bracelet as nearly as you can in the words of the masked woman who called upon you so — so unconventionally.”\n\u003cbr\u003e \n\u003cbr\u003e The girl’s brows were lifted inquiringly, with a sort of start.\n\u003cbr\u003e \n\u003cbr\u003e “We were discussing the case when your card was brought in,” continued The Thinking Machine tersely. “We shall continue from that point, if you will be so good.”\n\u003cbr\u003e \n\u003cbr\u003e The young woman recited the history of the bracelet, slowly and carefully.\n\u003cbr\u003e \n\u003cbr\u003e “And that statement of the case is correct?” queried the scientist.\n\u003cbr\u003e \n\u003cbr\u003e “Absolutely, so far as I know,” was the reply.\n\u003cbr\u003e \n\u003cbr\u003e “And as I understand it, you were in the house alone; that is, alone except for the servants?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I live there alone, except for a companion and two servants. The servants were not within the sound of my voice, even if I had screamed, and Miss Talbott, my companion, it happened, was out for the night.”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine had dropped back into his chair, with squint eyes turned upward, and long white fingers pressed tip to tip. He sat thus silently for a long time. The girl at last broke the silence.\n\u003cbr\u003e \n\u003cbr\u003e “Naturally I was a little surprised,” she remarked falteringly, “that I should have appeared just in time to interrupt a discussion of the singular happenings in my home last night; but really —”\n\u003cbr\u003e \n\u003cbr\u003e “This bracelet,” interrupted the little scientist again. “It was of oval form, perhaps, with no stones set in it, or anything of that sort — merely a band that fastened with an invisible hinge. That’s right, I believe?”\n\u003cbr\u003e \n\u003cbr\u003e “Quite right, yes,” replied the girl readily.\n\u003cbr\u003e \n\u003cbr\u003e It occurred to Hatch suddenly that he himself did not know — in fact, had not inquired — the shape of the bracelet. He knew only that it was gold, and of no great value. Knowing nothing about what it looked like, he had not described it to The Thinking Machine; therefore he raised his eyes inquiringly now. The drawn face of the scientist was inscrutable.\n\u003cbr\u003e \n\u003cbr\u003e “As I started to say,” the girl went on, “the bracelet and the events of last night have no direct connection with the purpose of my visit here.”\n\u003cbr\u003e \n\u003cbr\u003e “Indeed?” commented the scientist.\n\u003cbr\u003e \n\u003cbr\u003e “No; I came to see if you could assist me in another way. For instance,” and she fumbled in her pocket book, “I happened to know, Professor Van Dusen, of some of the remarkable things you have accomplished, and I should like to ask if you can throw any light on this for me.”\n\u003cbr\u003e \n\u003cbr\u003e She drew from the pocketbook a crumpled, yellow sheet of paper — a strip perhaps an inch wide, thin as tissue, glazed, and extraordinarily wrinkled. The Thinking Machine squinted at its manifold irregularities for an instant curiously, nodded, sniffed at it, then slowly began to unfold it, smoothing it out carefully as he went. Hatch leaned forward eagerly and stared. He was a little more than astonished at the end to find that the sheet was blank. The Thinking Machine examined both sides of the paper thoughtfully.\n\u003cbr\u003e \n\u003cbr\u003e “And where did you find the bracelet at last?” he inquired casually.\n\u003cbr\u003e \n\u003cbr\u003e “I have reason to believe,” the girl rushed on suddenly, regardless of the question, “that this strip of paper has been substituted for one of real value — I may say one of great value — and I don’t know how to proceed, unless —”\n\u003cbr\u003e \n\u003cbr\u003e “Where did you find the bracelet?” demanded The Thinking Machine again impatiently.\n\u003cbr\u003e \n\u003cbr\u003e Hatch would have hesitated a long time before he would have said the girl was disconcerted at the question, or that there had been any real change in the expression of her pretty face. And yet —\n\u003cbr\u003e \n\u003cbr\u003e “After the masked woman had gone,” she went on calmly, “I summoned the servants and we made a search. We found the bracelet at last. I thought I had tossed it into my jewel box when I removed it last night; but it seems I was careless enough to let it fall down behind my dressing table, and it was there all the time the — the masked woman was in my room.”\n\u003cbr\u003e \n\u003cbr\u003e “And when did you make this discovery?” asked The Thinking Machine.\n\u003cbr\u003e \n\u003cbr\u003e “Within a few minutes after she went out.”\n\u003cbr\u003e \n\u003cbr\u003e “In making your search, you were guided, perhaps, by a belief that in the natural course of events the bracelet could not have disappeared from your jewel box unless some one had entered the room before the masked woman entered; and further that if anyone had entered you would have been awakened?”\n\u003cbr\u003e \n\u003cbr\u003e “Precisely.” There was another pause. “And now please,” she went on, “what does this blank strip of paper mean?”\n\u003cbr\u003e \n\u003cbr\u003e “You had expected something with writing on it, of course?”\n\u003cbr\u003e \n\u003cbr\u003e “That’s just what I had expected,” and she laughed nervously. “You may rest assured I was considerably surprised at finding that.”\n\u003cbr\u003e \n\u003cbr\u003e “I can imagine you were,” remarked the scientist dryly.\n\u003cbr\u003e \n\u003cbr\u003e The conversation had reached a point where Hatch was hopelessly lost. The young woman and the scientist were talking with mutual understanding of things that seemed to have no connection with anything that had gone before. What was the paper anyway? Where did it come from? What connection did it have with the affairs of the previous night? How did —\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Hatch, a match, please,” requested The Thinking Machine.\n\u003cbr\u003e \n\u003cbr\u003e Wonderingly the reporter produced one and handed it over. The imperturbable man of science lighted it and thrust the mysterious paper into the blaze. The girl arose with a sudden, startled cry, and snatched at the paper desperately, extinguishing the match as she did so. The Thinking Machine turned disapproving eyes on her.\n\u003cbr\u003e \n\u003cbr\u003e “I thought you were going to burn it!” she gasped.\n\u003cbr\u003e \n\u003cbr\u003e “There is not the slightest danger of that, Miss Harding,” declared The Thinking Machine coldly. He examined the blank sheet again. “This way, please.”\n\u003cbr\u003e \n\u003cbr\u003e He arose and led the way into his tiny laboratory across the narrow hall, with the girl following. Hatch trailed behind, wondering vaguely what it was all about. A small brazier flashed into flame as The Thinking Machine applied a match, and curious eyes peered over his shoulders as he held the blank strip, now smoothed out, so that the rising heat would strike it.\n\u003cbr\u003e \n\u003cbr\u003e For a long time three pairs of eyes were fastened on the mysterious paper, all with understanding now, but nothing appeared. Hatch glanced round at the young woman. Her face wore an expression of tense excitement. The red lips were slightly parted in anticipation, the eyes sparkling, and the cheeks flushed deeply. In staring at her the reporter forgot for the instant everything else, until suddenly:\n\u003cbr\u003e \n\u003cbr\u003e “There! There! Do you see?”\n\u003cbr\u003e \n\u003cbr\u003e The exclamation burst from her triumphantly, as faint, scrawly lines grew on the strip suspended over the brazier. Totally oblivious of their presence apparently, The Thinking Machine was squinting steadily at the paper, which was slowly crinkling up into wavy lines under the influence of the heat. Gradually the edges were charring, and the odor of scorched paper filled the room. Still the scientist held the paper over the fire. Just as it seemed inevitable that it would burst into flame, he withdrew it and turned to the girl.\n\u003cbr\u003e \n\u003cbr\u003e “There was no substitution,” he remarked tersely. “It is sympathetic ink.”\n\u003cbr\u003e \n\u003cbr\u003e “What does it say?” demanded the young woman abruptly. “What does it mean?”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine spread the scorched strip of paper on the table before them carefully, and for a long time studied it minutely.\n\u003cbr\u003e \n\u003cbr\u003e “Really, my dear young woman, I don’t know,” he said crabbedly at last. “It may take days to find out what it means.”\n\u003cbr\u003e \n\u003cbr\u003e “But something’s written there! Read it!” the girl insisted.\n\u003cbr\u003e \n\u003cbr\u003e “Read it for yourself,” said the scientist impatiently. “I am frank to say it’s beyond me as it is now. No, don’t touch it. It will crumble to pieces.”\n\u003cbr\u003e \n\u003cbr\u003e Faintly, yet decipherable under a magnifying glass, the three were able to make out this on the paper:\n\u003cbr\u003e \n\u003cbr\u003e Stonehedge — idim-serpa’l ed serueh siort tnaeG ed eteT al rap eetej erbmo’l ed tniop ud zerit sruO’d rehcoR ud eueuq ud dron ua sdeip tnec.\n\u003cbr\u003e \n\u003cbr\u003e W.F.H.\n\u003cbr\u003e \n\u003cbr\u003e “What does it mean? What does it mean?” demanded the young woman impatiently. “What does it mean?”\n\u003cbr\u003e \n\u003cbr\u003e The sudden hardening of her tone caused both Hatch and The Thinking Machine to turn and stare at her. Some strange change had come over her face. There was chagrin, perhaps, and there was more than that — a merciless glitter in the brown eyes, a grim expression about the chin and mouth, a greedy closing and unclosing of the small, well shaped hands.\n\u003cbr\u003e \n\u003cbr\u003e “I presume it’s a cipher of some sort,” remarked The Thinking Machine curtly. “It may take time to read it and to learn definitely just where the treasure is hidden, and you may have to wait for —”\n\u003cbr\u003e \n\u003cbr\u003e “Treasure!” exclaimed the girl. “Did you say treasure? There is treasure, then?”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine shrugged his shoulders. “What else?” he asked. “Now, please, let me see the bracelet.”\n\u003cbr\u003e \n\u003cbr\u003e “The bracelet!” the girl repeated, and again Hatch noted that quick change of expression on the pretty face. “I— er — must you see it? I— er —” And she stopped.\n\u003cbr\u003e \n\u003cbr\u003e “It is absolutely necessary, if I make anything of this,” and the scientist indicated the charred paper. “You have it in your pocketbook, of course.”\n\u003cbr\u003e \n\u003cbr\u003e The girl stepped forward suddenly and leaned over the laboratory table, intently studying the mysterious strip of paper. At last she raised her head as if she had reached a decision.\n\u003cbr\u003e \n\u003cbr\u003e “I have only a — a part of the bracelet,” she announced, “only half. It was unavoidably broken, and —”\n\u003cbr\u003e \n\u003cbr\u003e “Only half?” interrupted The Thinking Machine, and he squinted coldly into the young woman’s eyes.\n\u003cbr\u003e \n\u003cbr\u003e “Here it is,” she said at last, desperately almost. “I don’t know where the other half is; it would be useless to ask me.”\n\u003cbr\u003e \n\u003cbr\u003e She drew an aged, badly scratched half circlet of gold from her pocketbook, handed it to the scientist, then went and looked out the window. He examined it — the delicate decorative tracings, then the invisible hinge where the bracelet had been rudely torn apart. Twice he raised his squint eyes and stared at the girl as she stood silhouetted against the light of the window. When he spoke again there was a deeper note in his voice — a singular softening, an unusual deference.\n\u003cbr\u003e \n\u003cbr\u003e “I shall read the cipher of course, Miss Harding,” he said slowly. “It may take an hour, or it may take a week, I don’t know.” Again he scrutinized the charred paper. “Do you speak French?” he inquired suddenly.\n\u003cbr\u003e \n\u003cbr\u003e “Enough to understand and to make myself understood,” replied the girl. “Why?”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine scribbled off a copy of the cipher and handed it to her.\n\u003cbr\u003e \n\u003cbr\u003e “I’ll communicate with you when I reach a conclusion,” he remarked. “Please leave your address on your card here,” and he handed her the card and pencil.\n\u003cbr\u003e \n\u003cbr\u003e “You know my home address,” she said. “Perhaps it would be better for me to call this afternoon late or tomorrow.”\n\u003cbr\u003e \n\u003cbr\u003e “I’d prefer to have your address,” said the scientist. “As I say, I don’t know when I shall be able to speak definitely.”\n\u003cbr\u003e \n\u003cbr\u003e The girl paused for a moment and tapped the blunt end of the pencil against her white teeth thoughtfully with her left hand. “As a matter of fact,” she said at last, “I am not returning home now. The events of last night have shaken me considerably, and I am now on my way to Blank Rock, a little sea shore town where I shall remain for a few days. My address there will be the High Tower.”\n\u003cbr\u003e \n\u003cbr\u003e “Write it down, please!” directed The Thinking Machine tersely. The girl stared at him strangely, with a challenge in her eyes, then leaned over the table to write. Before the pencil had touched the card, however, she changed her mind and handed both to Hatch, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e “Please write it for me,” she requested. “I write a wretched hand anyway, and besides I have on my gloves.” She turned again to the little scientist, who stood squinting over her head. “Thank you so much for your trouble,” she said in conclusion. “You can reach me at this address either by wire or letter for the next fortnight.”\n\u003cbr\u003e \n\u003cbr\u003e And a few minutes later she was gone. For awhile The Thinking Machine was silent as he again studied the faint writing on the strip of paper.\n\u003cbr\u003e \n\u003cbr\u003e “The cipher,” he remarked to Hatch at last, “is no cipher at all; it’s so simple. But there are some other things I shall have to find out first, and — suppose you drop by early tomorrow to see me.”\n\u003cbr\u003e \n\u003cbr\u003e Half an hour later The Thinking Machine went to the telephone, and after running through the book called a number.\n\u003cbr\u003e \n\u003cbr\u003e “Is Miss Harding home yet?” he demanded, when an answer came.\n\u003cbr\u003e \n\u003cbr\u003e “No, sir,” was the reply, in a woman’s voice.\n\u003cbr\u003e \n\u003cbr\u003e “Would you mind telling me, please, if she is left handed?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, no, sir. She’s right handed. Who is this?”\n\u003cbr\u003e \n\u003cbr\u003e “I knew it, of course. Good by.”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine was squinting into the inquiring eyes of Hutchinson Hatch.\n\u003cbr\u003e \n\u003cbr\u003e “The reason why the police are so frequently unsuccessful in explaining the mysteries of crime,” he remarked, “is not through lack of natural intelligence, or through lack of a birthgiven aptitude for the work, but through the lack of an absolutely accurate knowledge which is wide enough to enable them to proceed. Now here is a case in point. It starts with a cipher, goes into an intricate astronomical calculation, and from that into simple geometry. The difficulty with the detectives is not that they could not work out each of these as it was presented, perhaps with the aid of some outsider, but that they would not recognize the existence of the three phases of the problem in the first place.\n\u003cbr\u003e \n\u003cbr\u003e “You have heard me say frequently, Mr. Hatch, that logic is inevitable — as inevitable as that two and two make four not sometimes, but all the time. That is true; but it must have an indisputable starting point — the one unit which is unassailable. In this case unit produces unit in order, and the proper array of these units gives a coherent answer. Let me demonstrate briefly just what I mean.\n\u003cbr\u003e \n\u003cbr\u003e “A masked woman, employing the method at least of a thief, demands a certain bracelet of this Miss — Miss Harding. (Is that her name?) She doesn’t want jewels; she wants that bracelet. Whatever other conjectures may be advanced, the one dominant fact is that that bracelet, itself of little comparative value, is worth more than all the rest to her — the masked woman, I mean — and she has endangered liberty and perhaps life to get it. Why? The history of the bracelet as she herself stated it to Miss Harding gives the answer. A man in prison, under sentence of death, had that bracelet at one time. We can conjecture immediately, therefore, that the masked woman knew that the fact of its having been in this man’s possession gave him an opportunity at least of so marking the bracelet — or of confiding in it, I may say, a valuable secret. One’s first thought, therefore, is of treasure — hidden treasure. We shall go further and say treasure hidden by a Continental officer to prevent its falling into other hands as loot. This officer under sentence of death, and therefore cut off from all communication with the outside, took a desperate means of communicating the location of the treasure to his heirs. That is clear, isn’t it?”\n\u003cbr\u003e \n\u003cbr\u003e The reporter nodded.\n\u003cbr\u003e \n\u003cbr\u003e “I described the bracelet — you heard me — and yet I had never seen it, nor had I a description of it. That description was merely a forward step, a preliminary test of the truth of the first assumptions. I reasoned that the bracelet must be of a type which could be employed to carry a message safely past prying eyes; and there is really only one sort which is feasible, and that is the one I described. These bracelets are always hollow, the invisible hinges hold them together on one side, and they lock on the other. It would be perfectly possible, therefore, to write the message the prisoner wanted to send out on a strip of tissue paper, or any thin paper, and cram it into the bracelet at the lock end. In that event it would certainly pass minute inspection; the only difficulty would be for the outside person to find it. That was a chance; but it was all a chance anyway.\n\u003cbr\u003e \n\u003cbr\u003e “When the young woman came here and produced a strip of thin paper, apparently blank, with the multitude of wrinkles in it, I immediately saw that that paper had been recovered from the bracelet. It was old, yellow, and worn. Therefore, blank or not, that was the message which the prisoner had sent out. You saw me hold it over the brazier, and saw the characters appear. It was sympathetic ink, of course.\n\u003cbr\u003e \n\u003cbr\u003e “Hard to make in prison, you say? Not at all. Writing either with lemon juice or milk, once dry, is perfectly invisible on paper; but when exposed to heat at any time afterward, it will appear. That is a chemical truth.\n\u003cbr\u003e \n\u003cbr\u003e “Now the thing that appeared was a cipher — an absurd one, still a cipher. Extraordinary precaution of the prisoner who was about to die! This cipher — let me see exactly,” and the scientist spelled it out:\n\u003cbr\u003e \n\u003cbr\u003e “‘Stonehedge — idim-serpa’l ed serueh siort tnaeG ed eteT al rap eetej erbmo’l ed tniop ud zerit sruO’d rehcoR ud eueuq ud dron ua sdeip tnec.’\n\u003cbr\u003e \n\u003cbr\u003e “If you know anything of languages, Mr. Hatch,” he continued, “you know that French is the only language where the apostrophe and the accent marks play a very important part. A moment’s study of this particular cipher therefore convinced me that it was in French. I tried the simple expedient of reading it backward, with this result:\n\u003cbr\u003e \n\u003cbr\u003e “‘Stonehedge. Cent pieds au nord du queue du Rocher d’Ours tirez du point de l’ombre jetee par La Tete de Geant trois heures de l’apres-midi.’\n\u003cbr\u003e \n\u003cbr\u003e “Here, therefore, was a sensible statement in French, which translated freely into English is simply:\n\u003cbr\u003e \n\u003cbr\u003e “‘Stonehedge. Hundred feet due north from tail Bear Rock through apex (or point) of shadow cast by Giant’s Head, three P.M.’\n\u003cbr\u003e \n\u003cbr\u003e “I had read the cipher and knew its English before I gave a copy of it to the young woman who was here. I specifically asked her if she knew French, to give her a clue by which she might interpret the cipher herself. And thus I blazed the way within a few minutes to the point where astronomical and geometrical calculations were next. Please bear in mind that this message from the dead was not dated.\n\u003cbr\u003e \n\u003cbr\u003e “Now, about the young woman herself,” continued the scientist after a moment. “The statement of how she came to find the bracelet was obviously untrue; particularly are we convinced of this when she cannot, or will not, explain how it was broken. Therefore, another field is open for scrutiny. The bracelet was broken. If we assume that it is the bracelet, and there is no reason to doubt it, and we know it is in her possession, we know also that more than one person had been searching for it. We know positively that that other person — not the masked girl, but the one who had preceded her to Miss Harding’s room on the same night — got the bracelet from Miss Harding, and we are safe in assuming that it passed out of that other person’s hand by force. The bracelet had been literally torn apart at the hinge. In other words, there had been a physical contest, and one piece of the circlet — the piece with the message — passed out of the hands of the person who had preceded the masked woman and stolen the bracelet.\n\u003cbr\u003e \n\u003cbr\u003e “But this is by the way. Stonehedge is the name of the old Tremaine Harding estate, about twenty miles out, and there the Tremaine Harding family valuables were hidden by William Tremaine Harding, who died by bullet, a martyr to the cause of freedom. We shall get the treasure this afternoon, after I have settled one or two dates and made the astronomical and geometrical calculations which are necessary.”\n\u003cbr\u003e \n\u003cbr\u003e There was silence for a minute or more, broken at last by the impatient “Honk, honk!” of an automobile outside.\n\u003cbr\u003e \n\u003cbr\u003e “We’ll go now,” announced The Thinking Machine as he arose. “There is a car for us.”\n\u003cbr\u003e \n\u003cbr\u003e He led the way out, Hatch following. A heavy touring car, with three seats, driven by a young woman, was waiting at the door. The woman was a stranger to the reporter; but there was no introduction.\n\u003cbr\u003e \n\u003cbr\u003e “Did you get the date of Captain Harding’s imprisonment?” asked The Thinking Machine.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” was the reply — “June 3, 1776.”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine clambered in, Hatch following silently, and the car rushed away. It paused in a suburb long enough to pick up two workmen with picks and shovels, who took their places in the back seat, and then the automobile with its strange company — a pretty woman, a newspaper reporter, a distinguished scientist, and two laborers — proceeded on its way. Hatch, alone in the second seat, heard only one remark by the scientist, and this was:\n\u003cbr\u003e \n\u003cbr\u003e “Of course she was clever enough to read the cipher, after I gave her the hint that it was in French; so we shall find that the place has been dug over; but there is only one chance in three hundred and sixty-five that the treasure was found. I give her credit for extraordinary cleverness; but not enough to make the necessary astronomical calculations.”\n\u003cbr\u003e \n\u003cbr\u003e A run of an hour and a half brought them to Stonehedge, a huge old estate with ramshackle dwelling and acres of rock ridden ground. Away off in the northwest corner were two large stones — Bear Rock and Giants Head — rising fifteen or twenty feet above the ground. The car was driven over a rough road and stopped near them.\n\u003cbr\u003e \n\u003cbr\u003e “You see, she did read the cipher,” remarked the scientist placidly. “Workmen have already been here.”\n\u003cbr\u003e \n\u003cbr\u003e Straight ahead of them was an excavation ten feet or more square. Hatch peered into it, while The Thinking Machine busied himself by planting a stake at the so-called tail of Bear Rock. Then he glanced at his watch — it was half past two o’clock — and sat down with the young woman in the shadow of Giants Head. Hatch lounged on the ground near them, and the workmen made themselves comfortable in their own way.\n\u003cbr\u003e \n\u003cbr\u003e “We can’t do anything till three o’clock,” remarked The Thinking Machine.\n\u003cbr\u003e \n\u003cbr\u003e “And just what shall we do then?” inquired the young woman expectantly. It was the first time she had spoken since they started.\n\u003cbr\u003e \n\u003cbr\u003e “It is rather difficult to explain,” said The Thinking Machine. “The hole there proves that the young woman read the cipher, of course. Now here briefly is why the treasure was not found. Today is September 17. A measurement was made, according to instructions, from the tail of Bear Rock through the apex of the shadow of Giants Head precisely at three o’clock yesterday, one hundred feet due north, or as near north as possible. The hole shows the end of the hundred-foot line. Now, we know that Captain Harding was imprisoned on June 3, 1776; we know he buried the treasure before that date; we have a right to assume that it was only shortly before. On June 3 of any year the apex of the shadow will be in a totally different place from September 17, because of the movement of the earth about the sun and the relative changes in the sun’s position. What we must do now is to find precisely where the shadow falls at three o’clock today, then make our calculations to show where it will fall say one week before June 3. Do you follow me? In other words, a difference of half a foot in the location of the apex of the shadow will make a difference of many feet at the end of one hundred feet when we follow the cipher.”\n\u003cbr\u003e \n\u003cbr\u003e At precisely three o’clock The Thinking Machine noted the position of the shadow, and then began a calculation which covered two sheets of blank paper which Hatch had in his pocket.\n\u003cbr\u003e \n\u003cbr\u003e “This is correct,” said The Thinking Machine at last as he arose and planted another stake in the ground. “There is a chance of course that we miss fire the first time because of possible seismic disturbances at sometime past or of a change in the surface of the ground; but this is mathematically correct.”\n\u003cbr\u003e \n\u003cbr\u003e Then, with the assistance of the newspaper man and the young woman, he drew his hundred-foot line, and planted a third stake.\n\u003cbr\u003e \n\u003cbr\u003e “Dig here!” he told the workmen.\n\u003cbr\u003e \n\u003cbr\u003e One hour later the long lost family plate and jewels of the ancient Harding family had been unearthed. The Thinking Machine and the others stooped over the rotting box which had been brought to the surface and noted the contents. Roughly the value was above two hundred thousand dollars.\n\u003cbr\u003e \n\u003cbr\u003e “And I think that is all, Miss Harding,” said the scientist at last. “It is yours. Load it into your car there and drive home.”\n\u003cbr\u003e \n\u003cbr\u003e “Miss Harding!” Hatch repeated quickly, with a glance at the young woman. “Miss Harding?”\n\u003cbr\u003e \n\u003cbr\u003e The Thinking Machine turned and squinted at the reporter for a moment. “Didn’t you know that the young woman who called on me was not Miss Harding?” he demanded. “It was evident in her every act — in her failing to explain the broken bracelet; and in the fact that she was left handed. You must have noticed that. Well, this is Miss Harding, and she is right handed.”\n\u003cbr\u003e \n\u003cbr\u003e The girl smiled at Hatch’s astonishment.\n\u003cbr\u003e \n\u003cbr\u003e “Then the other young woman merely impersonated Miss Harding?” he asked at last.\n\u003cbr\u003e \n\u003cbr\u003e “That is all, and cleverly,” replied The Thinking Machine. “She merely wanted me to read the cipher for her. I put her on the track of reading it herself purposely, and she and the persons associated with her are responsible for the excavation over there.”\n\u003cbr\u003e \n\u003cbr\u003e “But who is the other young woman?”\n\u003cbr\u003e \n\u003cbr\u003e “She is the one who visited Miss Harding, wearing a mask.”\n\u003cbr\u003e \n\u003cbr\u003e “But what is her name?”\n\u003cbr\u003e \n\u003cbr\u003e “I’m sure I haven’t the faintest idea, Mr. Hatch,” responded the little scientist shortly. “We have her to thank, however, for placing a solution of the affair into our hands. Who she is and what she is, is of no real consequence, particularly as Miss Harding has this.”\n\u003cbr\u003e \n\u003cbr\u003e The scientist indicated the box with one small foot, then turned and clambered into the waiting automobile.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1349/40543.html","bookId":1466,"creation":"Aug 5, 2019 11:03:16 AM","modification":"Aug 5, 2019 11:03:16 AM"}
