{"id":89165,"no":12,"title":"Page 12","content":"\u003cp\u003eRELENTLESS KAMIKAZE PILOTS FIRED WEAPONS inside my brain. I woke to an excruciating headache, as if someone were operating on my skull with rusty knitting needles. When I rolled over, it took a full eleven seconds for my stomach to catch up. Then memories of my disgraceful behavior flooded over me. I had cried. I had sat at that lovely restaurant in my sultry red dress and my strappy sandals and let some stupid boy make me cry. No, even worse. I\u0027d let some skanky ho make me cry. I\u0027d made a complete fool of myself. A YouTube video of me dancing the hokeypokey naked with a weasel on my head would have been less humiliating.\u003c/p\u003e\n\u003cp\u003eDes must think I\u0027m psychotic. But then again, so what? We were only neighbors, right? It\u0027s not like I gave a flying rat\u0027s ass what he thought of me anyway. And now I didn\u0027t have to wonder if he was attracted to me. I\u0027d ruined any chance of that and saved myself a lot of time and trouble.\u003c/p\u003e\n\u003cp\u003eSo why did I feel like my body was rejecting an organ transplant?\u003c/p\u003e\n\u003cp\u003eOutside my window the gorgeous blue sky and beaming sunshine mocked me. It was a beautiful new day. Against my will, I started to cry again. I didn\u0027t want a new day full of the same shit as yesterday. I didn\u0027t want to be alone. But I didn\u0027t have the courage not to be.\u003c/p\u003e\n\u003cp\u003e\"Mommy?\" Paige opened my bedroom door and peeked inside.\u003c/p\u003e\n\u003cp\u003eI swiped away my hot tears. Oh, that\u0027s right! I wasn\u0027t alone! I had my children. They would comfort me in my dotage when I started wearing orthopedic shoes and a bra on the outside of my blouse. Jordan would pick me up from the Golden Years old folks\u0027 home every Sunday for church, and then we\u0027d go to the park to feed the ducks. On Wednesdays, I\u0027d wear my ratty gray cardigan and Paige would take me grocery shopping. It wasn\u0027t a very exciting future, but it was good enough for me.\u003c/p\u003e\n\u003cp\u003e\"Come in, sweetie,\" I said listlessly.\u003c/p\u003e\n\u003cp\u003eShe scampered over, her exuberance widening the chasm between her vitality and my imminent spiral into miserable old age. She climbed up and over, bumping her knee into my stomach, making it churn again.\u003c/p\u003e\n\u003cp\u003e\"Did you have fun on your playdate with Des?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, honey.\" No sense in telling her the truth until it was absolutely necessary. Let her be the fairy princess a little longer.\u003c/p\u003e\n\u003cp\u003e\"What did you do?\"\u003c/p\u003e\n\u003cp\u003e\"We had supper at a restaurant.\"\u003c/p\u003e\n\u003cp\u003e\"Did you have macaroni and cheese?\" She picked at the fringe on one of the bed pillows.\u003c/p\u003e\n\u003cp\u003e\"No, I had fish.\"\u003c/p\u003e\n\u003cp\u003eShe wrinkled her nose. \"Yuck. I don\u0027t like fish. Did you have ice cream for dessert?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm.\" She looked down at my face. \"Why are your eyes all fat?\"\u003c/p\u003e\n\u003cp\u003eI rubbed them with both hands. \"I\u0027m just tired.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you tired? It\u0027s morning.\"\u003c/p\u003e\n\u003cp\u003eShould I tell her I was tired because her father is a deplorable excuse for a man who ruined my outlook on life? Or that I was boarding the Solitaire Express with a one-way ticket to Lonely-ville? And most of all, should I warn her that no matter how much a man might pretend to like her, he\u0027d always have his eye on other women?\u003c/p\u003e\n\u003cp\u003e\"Oh, no reason,\" I said. \"Where\u0027s Jordan?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s downstairs watching Fontaine do Yoda.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Please tell me she meant something else.\u003c/p\u003e\n\u003cp\u003ePaige swayed her arms up, clasping her hands over her head then bringing them down slowly in front of her tummy. \"The bendy exercise. Yoda.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Yoga. OK. Well, anyway, Mommy has to get dressed now. Why don\u0027t you go downstairs and I\u0027ll be there in a minute.\" I pushed off the covers and took a very deep breath.\u003c/p\u003e\n\u003cp\u003e\"Can we go swimming?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to see, honey. Mommy doesn\u0027t feel very good right now.\"\u003c/p\u003e\n\u003cp\u003e\"Des says it looks like a good day for swimming.\"\u003c/p\u003e\n\u003cp\u003eMy churning stomach nearly dumped into my mouth. \"When did he say that?\"\u003c/p\u003e\n\u003cp\u003e\"This morning.\"\u003c/p\u003e\n\u003cp\u003e\"You talked to him this morning?\" Neurons fired in every direction in my brain, with not one making a logical connection.\u003c/p\u003e\n\u003cp\u003ePaige nodded, her little curls bobbing in her face.\u003c/p\u003e\n\u003cp\u003e\"When this morning?\"\u003c/p\u003e\n\u003cp\u003eShe wiggled off the bed. \"When we were having breakfast on the deck and he was jogging.\"\u003c/p\u003e\n\u003cp\u003eOnly my maternal instinct prevented me from grabbing my precious child and shaking her by the shoulders. \"What else did he say?\"\u003c/p\u003e\n\u003cp\u003eTaking me literally, she replied, \"He said, \u0027Hi, Paige. Hey, Jordan.\u0027 I think he said, \u0027What\u0027s up, Fontaine?\u0027 Then he told a grown-up joke and I couldn\u0027t hear them.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know it was a grown-up joke?\"\u003c/p\u003e\n\u003cp\u003e\"Because when I asked what was funny they said it was a grown-up joke.\"\u003c/p\u003e\n\u003cp\u003eAnd there it was. Word was out. At least I\u0027d be spared the indignity of having to share it myself. \"Is he still here?\"\u003c/p\u003e\n\u003cp\u003ePaige shook her head and walked to the door. \"Nope. See you later, alligator.\"\u003c/p\u003e\n\u003cp\u003eShe left with a flip of her curls. I sat up, with effort, and tried to come to grips with the last twenty-four hours, dreading the knowledge that the next twenty-four could be even worse.\u003c/p\u003e\n\u003cp\u003eI pulled on some loose pants and a huge T-shirt and tried to brush my teeth. Working up a lather with the toothpaste was tougher than usual. Maybe because my mouth was as dry as if I\u0027d slept with a Shop-Vac in it all night.\u003c/p\u003e\n\u003cp\u003eI tiptoed downstairs, hearing murmured voices on the sunporch. If I could get to the coffee and ibuprofen before anyone saw me, maybe I could grab it and sneak back to my room. But the minute my big toe hit the hardwood, Fontaine pounced like paparazzi on the latest teen sensation.\u003c/p\u003e\n\u003cp\u003e\"Hold up, kitten chow! There you are!\"\u003c/p\u003e\n\u003cp\u003eI crouched, my reaction time so slow my body still thought it could hide. I\u0027d never noticed how shrill Fontaine\u0027s voice was. Was it always like that? He could frighten bats with a screech like that.\u003c/p\u003e\n\u003cp\u003eHe walked into the kitchen wearing bicycle shorts and a nylon shirt the color of circus peanuts. \"How was your date last night?\"\u003c/p\u003e\n\u003cp\u003e\"Very funny,\" I said, reaching toward the coffee mugs with a trembling hand.\u003c/p\u003e\n\u003cp\u003eHis dark brows furrowed. \"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"You already know I made a fool of myself.\"\u003c/p\u003e\n\u003cp\u003eFurrowed brows rose up. \"What are you talking about? What happened?\"\u003c/p\u003e\n\u003cp\u003eI set the coffee pot back in the holder and took a gulp. It burned all the way down my throat yet somehow managed to not leave any moisture behind. I looked at Fontaine through bloodshot eyes. \"Des didn\u0027t tell you?\"\u003c/p\u003e\n\u003cp\u003eFontaine shook his head, his bangs flopping from side to side. He pulled out a chair and sat down. \"No, he didn\u0027t, but you\u0027d better!\"\u003c/p\u003e\n\u003cp\u003eWas it possible Des had not revealed my humiliation? Richard would have made a huge production of such an occasion. He loved to repeat stories of my misadventures. Like the time I accidentally ripped an incredibly loud fart during a funeral at precisely the moment the priest asked if anyone had something they\u0027d like to share. Or the time we were out to dinner with Richard\u0027s boss and I discovered I had Jordan\u0027s baby poo all over my sleeve.\u003c/p\u003e\n\u003cp\u003e\"Des didn\u0027t tell you anything?\"\u003c/p\u003e\n\u003cp\u003eFontaine smacked his hand on the table with impatience. \"All he said was you had a nice time. So what\u0027s your story?\"\u003c/p\u003e\n\u003cp\u003e\"I cried.\"\u003c/p\u003e\n\u003cp\u003e\"You what?\"\u003c/p\u003e\n\u003cp\u003e\"Yep. Bawled like a little girl.\" I might as well tell it straight up.\u003c/p\u003e\n\u003cp\u003eFontaine smacked both palms against his cheeks, sufficiently aghast. \"Why? Why did you do that?\"\u003c/p\u003e\n\u003cp\u003eMy next slug of coffee didn\u0027t burn nearly so badly now that my throat was scarred over from the last swallow.\u003c/p\u003e\n\u003cp\u003e\"Oh...I\u0027d say it was thirty percent sake and seventy percent because he introduced me to some gorgeous whore as \u0027just a neighbor.\u0027\"\u003c/p\u003e\n\u003cp\u003eFontaine sucked air in through clenched teeth. \"That bastard.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"I know, right?\"\u003c/p\u003e\n\u003cp\u003eDody breezed into the kitchen wearing a silky yellow caftan. \"Good morning, sunshine. How was your evening?\"\u003c/p\u003e\n\u003cp\u003e\"We were just getting to that,\" Fontaine said. \"Apparently our Sadie here had a bit of a meltdown.\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t that little,\" I said.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not kidding. I was there,\" Jasper called out, thumping down the stairs two at a time.\u003c/p\u003e\n\u003cp\u003eWonderful. Now we could all share the postmortem details of my evening together.\u003c/p\u003e\n\u003cp\u003eJasper kissed Dody on the cheek, flicked Fontaine in the ear, and made a face at me. Then he poured himself a cup of coffee.\u003c/p\u003e\n\u003cp\u003eFontaine put his elbows on the table and laced his fingers together.\u003c/p\u003e\n\u003cp\u003e\"All right, let\u0027s have it. What\u0027s the real four-one-one?\"\u003c/p\u003e\n\u003cp\u003eI shrugged and shook my head. \"I drank too much. He called me his neighbor. I cried. He\u0027s never going to ask me out again. What else is there to say?\"\u003c/p\u003e\n\u003cp\u003eFontaine frowned. \"When you say you cried, do you mean you had a delicate little tear on your cheek or did you do the whole gasping for breath, hiccupping, scary face thing?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d say it was somewhere in the middle,\" Jasper answered.\u003c/p\u003e\n\u003cp\u003e\"It was not! It wasn\u0027t that bad.\"\u003c/p\u003e\n\u003cp\u003e\"Sadie, you wiped your nose with the tablecloth.\"\u003c/p\u003e\n\u003cp\u003e\"I did not! It was my napkin!\"\u003c/p\u003e\n\u003cp\u003e\"No, trust me. You pulled up the tablecloth. Des had to grab the glasses so they didn\u0027t tip over.\"\u003c/p\u003e\n\u003cp\u003eOh God. It was possible to feel even worse. I didn\u0027t remember any of that!\u003c/p\u003e\n\u003cp\u003eDody hugged me tightly, patting my back. \"Don\u0027t worry, darling. These things happen. Des will understand. Did you at least remember to stroke his eagle?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I gasped.\u003c/p\u003e\n\u003cp\u003e\"His eagle. You know how much men like to talk about themselves.\"\u003c/p\u003e\n\u003cp\u003e\"Ego,\" Fontaine said, interpreting.\u003c/p\u003e\n\u003cp\u003e\"Oh, um, yeah, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"It couldn\u0027t have been that bad. Des was here this morning,\" Fontaine noted.\u003c/p\u003e\n\u003cp\u003e\"Maybe he wanted to view the body,\" Jasper teased.\u003c/p\u003e\n\u003cp\u003eI pinched his arm. \"You are not helping!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not trying to.\"\u003c/p\u003e\n\u003cp\u003e\"Clearly!\"\u003c/p\u003e\n\u003cp\u003eJasper laughed and twisted away from my reach. \"OK, OK. I\u0027ll be nice. You weren\u0027t so bad last night.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t? Then I didn\u0027t wipe my nose on the tablecloth?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah. You totally did that. But I think Des thought it was kind of funny.\"\u003c/p\u003e\n\u003cp\u003e\"He did?\" Fontaine was disbelieving. \"But that\u0027s disgusting.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, like you haven\u0027t done worse?\" I challenged.\u003c/p\u003e\n\u003cp\u003e\"Hey, what two consenting adults choose to do in the privacy of their own room, or an elevator, is not in question here. And I have never blown my nose on a restaurant tablecloth.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t blow it. I dabbed it.\" The memory was starting to come back to me.\u003c/p\u003e\n\u003cp\u003eJasper tipped his head, conceding, \"It was more of a dab than a blow.\"\u003c/p\u003e\n\u003cp\u003e\"See!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m confused,\" Dody said. \"Why did you cry?\"\u003c/p\u003e\n\u003cp\u003e\"Because he introduced me as his neighbor.\"\u003c/p\u003e\n\u003cp\u003eJasper snorted. \"You are his neighbor, dumb-ass. How is that an insult?\"\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t understand,\" I sniffed.\u003c/p\u003e\n\u003cp\u003e\"You got that right.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I don\u0027t understand either, dear. Why did that upset you?\" Dody asked.\u003c/p\u003e\n\u003cp\u003eGeez, what was wrong with these people?\u003c/p\u003e\n\u003cp\u003e\"Never mind. It doesn\u0027t matter now. It\u0027s because Des is so...\" I flapped my hands as if the words were dangling invisibly around me but I couldn\u0027t grasp them. \"And I\u0027m so...well, it\u0027s better this way,\" I said with finality. I looked around to see if they understood all that I was not saying.\u003c/p\u003e\n\u003cp\u003eDody scowled. \"Humph! Young lady, do you think that rainy day when I got into Walter\u0027s car for the first time I wasn\u0027t nervous? He was mature and debonair and I was a skinny bit of a girl, soaking wet in a hand-me-down dress with freckles from here till next Sunday. I wasn\u0027t always this put together, you know!\" She patted her hair, pulling out a pink foam curler. \"But I set my cap for him, and nothing was going to stop me.\"\u003c/p\u003e\n\u003cp\u003eFontaine and Jasper smiled at each other. They\u0027d heard this story before.\u003c/p\u003e\n\u003cp\u003e\"He drove me home that day, and I tell you what, he came back the next day and the next day and the day after that. And do you know why?\"\u003c/p\u003e\n\u003cp\u003eI was tempted to answer, \"Because Uncle Walter was a boob man?\"\u003c/p\u003e\n\u003cp\u003eDody went on, \"Because he said I was the sunshiniest girl he\u0027d ever met. Being around me made him happy, because I was happy. He said I could find the silver lining in a mushroom cloud, whatever that means. So maybe I wasn\u0027t the prettiest back then, or the smartest, or the richest, but I made him happy. So he married me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great for you, Dody. But I\u0027m not that kind of person. And none of this matters anyway. I\u0027m leaving at the end of the summer, so even if I did like him, and he liked me, what good would it do?\"\u003c/p\u003e\n\u003cp\u003eShe poked her finger at my nose. \"Glenville is not that far away, young lady. You are using that as an excuse. You have an excuse for everything, but not one good reason.\"\u003c/p\u003e\n\u003cp\u003e\"So you think I should pretend to be happy so Des will like me? That\u0027s a little Stepford Wife, don\u0027t you think?\"\u003c/p\u003e\n\u003cp\u003e\"No, silly. Don\u0027t pretend to be happy. Choose to be happy.\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t making any sense at all. You didn\u0027t choose happiness. It was pure dumb luck. Either it came your way or it didn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"Dody, it\u0027s not that simple.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is. You\u0027re the one making it complicated.\"\u003c/p\u003e\n\u003cp\u003eI looked to my cousins for backup. Jasper shook his head and walked away but Fontaine nodded, his lips pursed in agreement.\u003c/p\u003e\n\u003cp\u003eDody patted me again. \"You know what they say, darling. When life gives you oranges, have some juice.\"\u003c/p\u003e\n\u003cp\u003eMaybe my sister would know what I was talking about. Penny was pretty good about this kind of stuff.\u003c/p\u003e\n\u003cp\u003e\"Oh for God\u0027s sake,\" she groaned into the phone, \"screw somebody already, will you?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s your advice?\" I flopped back on my bed with my feet up on the wall, my standard phone call to Penny position.\u003c/p\u003e\n\u003cp\u003e\"Yes. Honestly, Sade! This whole woe-is-me, my husband cheated on me thing is so last year. Richard was an asshole. Get over it! I mean, seriously, so what if this Des guy went out with the blonde from the restaurant? He wasn\u0027t with her last night. He asked you out instead, so clearly he wanted to be with you.\"\u003c/p\u003e\n\u003cp\u003e\"But she was totally coming on to him and he let her. Right in front of me.\"\u003c/p\u003e\n\u003cp\u003e\"What was he supposed to do? Punch her in the face?\"\u003c/p\u003e\n\u003cp\u003e\"He could have at least introduced me by name. But whatever. I gave it a shot. There\u0027s no point in dating him anyway.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Because you don\u0027t want to get married again? If you don\u0027t, that\u0027s fine. But does that mean you\u0027re never going out with a man again for the rest of your life? That\u0027s stupid.\"\u003c/p\u003e\n\u003cp\u003eI tapped my feet against the wall. \"You\u0027re stupid.\"\u003c/p\u003e\n\u003cp\u003ePenny chuckled at last. \"No, you\u0027re stupid, because you\u0027re acting like every date should be a job interview for your next baby daddy. Why must you overthink everything? Go out and have some fun and stop worrying all the time. You exhaust me.\"\u003c/p\u003e\n\u003cp\u003eIt was unanimous. Everyone in my family, including me, thought I was an idiot. \u003c/p\u003e","sourceLink":"https://allnovel.net/crazy-little-thing-bell-harbor-1/page-12.html","bookId":2788,"creation":"Oct 5, 2019 5:33:52 PM","modification":"Oct 5, 2019 5:33:52 PM"}
