{"id":89171,"no":18,"title":"Page 18","content":"\u003cp\u003e\"DO YOU REALLY THINK THIS is going to work?\" I asked, wrist deep in sticky cookie batter.\u003c/p\u003e\n\u003cp\u003eJasper was watching from his stool at the kitchen island. \"You can\u0027t make him plain chocolate chip cookies. That doesn\u0027t say, \u0027I\u0027m spectacular. Don\u0027t let me get away.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t?\" Dody adjusted her ruffled apron.\u003c/p\u003e\n\u003cp\u003e\"No. It says, \u0027Lonely hausfrau bartering cookies for sex.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s a bad thing?\" Fontaine asked from his spot at the table, where he was perusing fabric samples.\u003c/p\u003e\n\u003cp\u003eThis was hopeless. Des was never going to forgive me. For those keeping score, this was my third strike.\u003c/p\u003e\n\u003cp\u003eDody argued, \"We start with regular cookies, then add some secret special ingredients.\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\" Jasper, the professional chef, was skeptical.\u003c/p\u003e\n\u003cp\u003e\"Like flaxseed,\" Dody answered.\u003c/p\u003e\n\u003cp\u003e\"Flaxseed?\" Jasper laughed. \"Are you trying to make him fall for Sadie or have an impressive bowel movement?\"\u003c/p\u003e\n\u003cp\u003e\"Ixnay on the axflay eedsay,\" Fontaine muttered.\u003c/p\u003e\n\u003cp\u003e\"The cookies aren\u0027t going to make any difference,\" I pouted, my fragile optimism wavering.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not really about the cookies. These give you a reason to go down there. Once you\u0027re at his house and he sees how sorry you are, it\u0027ll make all the difference. He\u0027ll forgive you.\" Dody snapped her fingers. \"Bee pollen. And agave nectar. That\u0027ll get him for sure.\"\u003c/p\u003e\n\u003cp\u003e\"Unless he\u0027s allergic to bees, in which case the cookies will kill him,\" Fontaine added.\u003c/p\u003e\n\u003cp\u003eAllergic? This was impossible.\u003c/p\u003e\n\u003cp\u003e\"Fontaine, dear, your commentary is not very helpful right now. Look at what you\u0027re doing to Sadie.\"\u003c/p\u003e\n\u003cp\u003eMy mind went into overdrive. What was the penalty for accidentally poisoning the object of one\u0027s affection with irresponsibly made cookies? Life behind bars? Community service at a Mrs. Fields?\u003c/p\u003e\n\u003cp\u003eIt was too much to contemplate, all the pooping and the allergies. Maybe I should take him a six-pack and a bag of chips instead. Or bar nuts. Men liked bar nuts, didn\u0027t they?\u003c/p\u003e\n\u003cp\u003eJasper was right. I was trying to buy affection with confections, and it wasn\u0027t going to work.\u003c/p\u003e\n\u003cp\u003eI checked my reflection in the mirror, hoping to look both lovely and contrite. I had to settle for flushed and anxious.\u003c/p\u003e\n\u003cp\u003eDody had taken the kids to the park after making me promise to deliver my mea culpa cookies.\u003c/p\u003e\n\u003cp\u003eI rang Des\u0027s doorbell with a basket of goodies on my arm like Little Red Riding Hood. Fontaine had lined the basket and wrapped the cookies with a plaid napkin and a dotted bow. I had serious doubts about my chance of success but was willing to give it a try.\u003c/p\u003e\n\u003cp\u003eDes opened the door, looking resigned. He had on a white T-shirt with scrub pants and was eating an apple.\u003c/p\u003e\n\u003cp\u003eI held up the basket, batting my lashes.\u003c/p\u003e\n\u003cp\u003eHe took a bite of apple.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" His tone of voice matched his grumpy face.\u003c/p\u003e\n\u003cp\u003e\"An incredibly lame peace offering.\" I batted again.\u003c/p\u003e\n\u003cp\u003eHe ignored me, staring instead at the basket, noting the tidy little napkin and bow.\u003c/p\u003e\n\u003cp\u003e\"Can I eat it?\" He still didn\u0027t smile.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I wiggled the basket a little to make it more enticing.\u003c/p\u003e\n\u003cp\u003e\"Then come in. I\u0027m starving.\" He turned around and walked back into the kitchen.\u003c/p\u003e\n\u003cp\u003eIt was not quite the warm welcome I was hoping for, but it also wasn\u0027t the cold rebuke I probably deserved. I followed him inside, gingerly setting the basket on the kitchen counter.\u003c/p\u003e\n\u003cp\u003eHe tossed the apple core into the sink, then unceremoniously flicked open the napkin.\u003c/p\u003e\n\u003cp\u003e\"Cookies,\" he said sullenly. \"Did you make them?\"\u003c/p\u003e\n\u003cp\u003eI wanted to be honest. \"Mostly. Dody and Jasper helped some.\"\u003c/p\u003e\n\u003cp\u003e\"Dody?\" He frowned, holding up a cookie and examining it in the light. \"Did she put any of her crazy shit in here?\"\u003c/p\u003e\n\u003cp\u003eMy vow of truth wavered. \"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003eNow I\u0027d be racked with guilt if he ended up spending the night on the toilet. Maybe we should have skipped the flaxseed.\u003c/p\u003e\n\u003cp\u003eHe sighed, dropping the cookie back in the basket and staring at me. He was still mad. That much was obvious.\u003c/p\u003e\n\u003cp\u003eI fiddled with the edge of my shirt. \"So that was your cousin, huh?\"\u003c/p\u003e\n\u003cp\u003eHe crossed his arms and leaned back against the counter. \"Yep.\"\u003c/p\u003e\n\u003cp\u003e\"I guess I owe you an apology then.\"\u003c/p\u003e\n\u003cp\u003e\"That depends.\"\u003c/p\u003e\n\u003cp\u003e\"On what?\"\u003c/p\u003e\n\u003cp\u003e\"On if you\u0027re actually sorry, Sadie. Don\u0027t say it if you don\u0027t mean it. And don\u0027t think acting cute and bringing me cookies will distract me. You were way off base. I don\u0027t like being called a liar. I don\u0027t deserve it.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t really considered it that way. I was so wrapped up in how he\u0027d hurt my feelings I never stopped to consider I might be hurting his.\u003c/p\u003e\n\u003cp\u003e\"I am sorry. I didn\u0027t think it would matter much to you.\"\u003c/p\u003e\n\u003cp\u003eHis arms fell loose, as if the strength had gone out of them. I don\u0027t think I understood the word incredulous before. But that was how he looked. Incredulous. He rubbed a hand across his face.\u003c/p\u003e\n\u003cp\u003e\"Sadie, when I told you I wanted company, I didn\u0027t mean some random warm body in my bed. Is that the kind of guy you think I am? Is that your opinion of me?\"\u003c/p\u003e\n\u003cp\u003eA foreign concept began to gel in my mind. I was so used to Richard trampling over my emotions, crushing me with his will, and here I was doing the same thing to Des. It never occurred to me I might have that power, because I had none over Richard. But Des seemed genuinely upset.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Des. I overreacted and I was wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you were! What\u0027s it going to take to make you trust me? Because if you can\u0027t, then whatever this is between us isn\u0027t going to get very far. And I\u0027d like it to.\"\u003c/p\u003e\n\u003cp\u003eHis intensity was unnerving, heating my skin. His words heated everything else.\u003c/p\u003e\n\u003cp\u003e\"I would too,\" I said, and acknowledged deep down it was true. Of course I wanted something more. I was not a fling kind of gal.\u003c/p\u003e\n\u003cp\u003eI scuffed my sandal on the floor. \"I don\u0027t know how many chances you\u0027re willing to give me, but how about one more? Dody says I never see the good in people, but I see it in you. I\u0027m just not used to it.\"\u003c/p\u003e\n\u003cp\u003eHis jaw relaxed the least little bit. \"I\u0027m not particularly good at being good. You\u0027ll have to look pretty hard. But I don\u0027t lie. And I tend to stick with one woman at a time, because otherwise I get confused.\"\u003c/p\u003e\n\u003cp\u003eI smiled and my eyes got watery. If he was making jokes, I was halfway there. \"Well, you may not have noticed, but I\u0027m kind of high maintenance. Still, you\u0027ve seen the worst of me so there shouldn\u0027t be any more surprises.\"\u003c/p\u003e\n\u003cp\u003eDes sniffed. And sighed. And crossed his arms. He wasn\u0027t quite finished being annoyed. \"Look, I like you, Sadie. But it seems like you\u0027re waiting for me to screw up to prove I\u0027m as bad as your ex-husband. I\u0027m not. So you need to stop doing that. OK?\"\u003c/p\u003e\n\u003cp\u003eHe was right. I was doing that. And I should stop.\u003c/p\u003e\n\u003cp\u003e\"Yes, I will. I promise.\"\u003c/p\u003e\n\u003cp\u003eWe stood on opposite sides of the kitchen, staring. Absorbing what had been said.\u003c/p\u003e\n\u003cp\u003e\"OK,\" he said again, finally stepping forward and closing the distance between us. \"So no more running away when you\u0027re flustered and half-naked. No more getting pissed without telling me why. And no more crying at restaurants.\" He smiled at last. \"Agreed?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Agreed.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" He put his hands on my waist, pulling me against him. \"Because I\u0027ve missed you these last few days.\"\u003c/p\u003e\n\u003cp\u003e\"You have?\" I bit my lip.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Especially that.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I whispered.\u003c/p\u003e\n\u003cp\u003eHis eyes dropped to my mouth. \"The way you bite your lip when you get nervous. God, it gets me every time.\"\u003c/p\u003e\n\u003cp\u003eThen he kissed me with days\u0027 worth of pent-up longing.\u003c/p\u003e\n\u003cp\u003eRelief and joy intertwined like our bodies. He lifted me up and set my bottom on the counter. I wrapped my legs around his waist, feeling uncharacteristically bold. His touch was addictive. I craved more with every caress.\u003c/p\u003e\n\u003cp\u003eIt\u0027s true. I\u0027d wanted Des from the first moment I saw him running down the beach. My desire then had been equal parts curiosity and deprivation. But that longing paled in comparison to this intensity.\u003c/p\u003e\n\u003cp\u003eWe kissed and clung so tightly not a molecule could slide between us. This was how it was supposed to be. Passionate, fearless, fun. He lifted me again as if I were weightless and carried me into his bedroom. We fell with a bounce and a breathless giggle onto the mattress.\u003c/p\u003e\n\u003cp\u003eBitchy the cat was there. She hissed and walked out of the room. And it was quite a while before we got to those cookies. \u003c/p\u003e","sourceLink":"https://allnovel.net/crazy-little-thing-bell-harbor-1/page-18.html","bookId":2788,"creation":"Oct 5, 2019 5:33:52 PM","modification":"Oct 5, 2019 5:33:52 PM"}
