{"id":92272,"no":10,"title":"Page 10","content":"\u003cp\u003eChapter Twenty-Eight\u003c/p\u003e\n\u003cp\u003eI woke up in the middle of the night, a teasing trickle of ice water cascading over my breasts. The invading cold made me sit upright, clutching for the ebbing neckline of the old-fashioned brushed-cotton nightgown that I\u0027d found in the closet, now far enough off my shoulders to suit a Gothic heroine.\u003c/p\u003e\n\u003cp\u003eThen I understood what was happening. A couple dozen alien, icy metal snakes were writhing over my collarbones, nipping at my breasts with needle-sharp fangs! I switched on the bedside lamp and jumped out of bed, hopping to escape the nasty feeling. I only agitated the metal-scaled serpents into a faster, colder dance over my flesh.\u003c/p\u003e\n\u003cp\u003eThe mirror above the dresser flashed back a chorus-girl sparkle. I was wearing a glittering rhinestone Egyptian-type collar from the base of my throat and down my cleavage, writhing serpent-chains that ended with arrowhead-shaped heads with vampire-sharp fangs.\u003c/p\u003e\n\u003cp\u003eSnow! Sending his costume jewelry flunkies to belly dance on my bod when I was out cold. What a bastard! He made Haskell seem like a small-time gnat. He made Hector Nightwine look like a slightly kinked teenager by comparison.\u003c/p\u003e\n\u003cp\u003eI lifted the cold, dead writhing lengths off of my living flesh. Necklaces this flashy were for sale in every Las Vegas hotel glitz shop, but none so carefully wrought. What was happening here?\u003c/p\u003e\n\u003cp\u003eThe answer hit me with a sharp new chill: Snow was thinking about me. The shape-changing jewelry echoed his thoughts, desires. He was reminding me of the leash he had put on me, the soft loop of his albino hair that had become metal... had now become chains of rhinestones. Except... I lifted the stones to the mirror to study their electric sparkle. These were diamonds. Holy Hell!\u003c/p\u003e\n\u003cp\u003eI sat up in bed, my arms clasped around my knees. I was wearing a gently used granny gown and probably a hundred-some carats of supernaturally lustful diamonds.\u003c/p\u003e\n\u003cp\u003eAs I breathed in and out, trying for calm, the necklace shrank into a modest silver circlet. Maybe Snow hadn\u0027t expected me to sense his midnight invasion. Maybe he hadn\u0027t expected calm. Maybe he hadn\u0027t expected me to come calling on him the first thing the next morning.\u003c/p\u003e\n\u003cp\u003eI sure hoped so, because I would, and then there\u0027d be Hell to pay.\u003c/p\u003e\n\u003cp\u003eWhen I hit the Inferno I went straight for my inside man, Nicky.\u003c/p\u003e\n\u003cp\u003eIt was only 10:00 am. I expected a headliner like Snow to be zonked out somewhere decadent with a bevy of groupies until late afternoon. I even expected Nick Charles to be off someplace where CinSims kick back when off-screen.\u003c/p\u003e\n\u003cp\u003eNo. Nick was at the bar, as debonair as ever, still dressed in a formal black-and-white tux.\u003c/p\u003e\n\u003cp\u003e\"My dear girl,\" he said, rising like a robot to the occasion of my striding in on a rush of fury. \"You\u0027re looking quite... flushed. Did you win at the slots?\"\u003c/p\u003e\n\u003cp\u003eThe blackboard above Nicky\u0027s amiable, sloshed face snared my attention. In pink neon chalk, it announced: House specialty: Albino Vampires.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s highway robbery!\" I said.\u003c/p\u003e\n\u003cp\u003e\"Noooo.\" Nicky focused carefully on where I was looking. \"It\u0027s not a Highway Robbery; that\u0027s made with rum. That is the hot new house drink. The boss ordered me to forsake my martinis for it. Didn\u0027t you already order one the other night?\"\u003c/p\u003e\n\u003cp\u003e\"Order it? I invented it!\" While I tapped my fingernails on the heavily varnished bar I noticed that I was wearing a half-handcuff bracelet again.\u003c/p\u003e\n\u003cp\u003eBastard! Lech by remote fondling! Thief!\u003c/p\u003e\n\u003cp\u003eI felt a presence behind me and turned. Snow, of course, long white hair, night-black sunglasses, white silk tee, slacks, and jacket. The man must bathe in bleach!\u003c/p\u003e\n\u003cp\u003e\"That\u0027s my drink,\" I opened.\u003c/p\u003e\n\u003cp\u003e\"If you order it.\"\u003c/p\u003e\n\u003cp\u003e\"I made it to order, right here. Just the other night. I named it.\"\u003c/p\u003e\n\u003cp\u003e\"Catchy title. You used my ingredients, my bartender.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s still mine.\"\u003c/p\u003e\n\u003cp\u003e\"My version is slightly different. That\u0027s all it takes for legal ownership. Try one.\"\u003c/p\u003e\n\u003cp\u003eHe snapped his fingers. I again noticed bloodless, manicured nails as slick and opaque as white gloss-enamel paint.\u003c/p\u003e\n\u003cp\u003eA martini glass as albino as my concoction of the other night was soon wafted down in front of me, exact to the topping-off drizzle of raspberry liqueur. Also wafted down was the bill: twelve-fifty.\u003c/p\u003e\n\u003cp\u003e\"Highway robbery,\" I repeated, for the record.\u003c/p\u003e\n\u003cp\u003e\"You need to taste it to be sure.\"\u003c/p\u003e\n\u003cp\u003eI did, recognizing my own yummy ingredients. Nothing added, nothing subtracted.\u003c/p\u003e\n\u003cp\u003e\"My recipe.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t finished it.\"\u003c/p\u003e\n\u003cp\u003eWhat? He wanted to get me drunk? I tilted the wide glass lip to mine and chug-a-lugged a lot of heavy-proof liquor. I was so mad I knew my system would burn it up and spit out very sober nails.\u003c/p\u003e\n\u003cp\u003eSomething soft and sweet bobbed against my teeth. Something from the bottom of the glass. I slurped stinging vodka and sweet liqueurs until I saw bottom. Oh. A drunken maraschino cherry, skewered by an arrow of white chocolate. Sweet, plump, succulent. Nice touch. I left it.\u003c/p\u003e\n\u003cp\u003e\"The cherry,\" Snow said, \"is a tribute to your bartender expertise and your undercover skills. Otherwise, nothing personal.\"\u003c/p\u003e\n\u003cp\u003eI knew an insult when I heard it. Also, a reference to my quasi-state of virtue, that even I didn\u0027t know for sure. \"I want to talk to you. In private.\"\u003c/p\u003e\n\u003cp\u003e\"My office?\"\u003c/p\u003e\n\u003cp\u003e\"No tigers.\"\u003c/p\u003e\n\u003cp\u003e\"No invisible allies.\"\u003c/p\u003e\n\u003cp\u003eI stood and let him precede me through the crowded casino to the place we\u0027d last negotiated.\u003c/p\u003e\n\u003cp\u003eWhen we were alone in the office, I looked around, tapping my toes. No tigers.\u003c/p\u003e\n\u003cp\u003eAs he went around the desk, I held out my half-handcuffed right wrist. \"I don\u0027t appreciate this.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"I took it to a jewelry shop before I came here. Nothing will take it off. Not a jeweler\u0027s diamond-toothed saw, not a pinpoint acetylene torch. I want out of it.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you think I can help you with that?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your sick toy!\"\u003c/p\u003e\n\u003cp\u003e\"How so?\"\u003c/p\u003e\n\u003cp\u003e\"Your hair?\"\u003c/p\u003e\n\u003cp\u003e\"And how did my hair become your hair shirt?\"\u003c/p\u003e\n\u003cp\u003e\"I-\" Time to own up. \"I touched it.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Because it was mine and you couldn\u0027t resist?\"\u003c/p\u003e\n\u003cp\u003eWhat ego! Pride incarnate of course.\u003c/p\u003e\n\u003cp\u003e\"Because it was white and long like the coat of my dead dog.\"\u003c/p\u003e\n\u003cp\u003e\"Which you loved.\"\u003c/p\u003e\n\u003cp\u003e\"A dog that had earned my love. Brave. Protective. True.\"\u003c/p\u003e\n\u003cp\u003e\"Hardly like me, of course. So you claimed the lock of my hair because it reminded you of a dead dog. I can\u0027t say I\u0027m flattered.\"\u003c/p\u003e\n\u003cp\u003e\"You should be! Achilles was worth six of you. He got blood poisoning from biting a vampire ten times his size. You tackle anything like that lately? No, you pick on passing strangers. Achilles didn\u0027t need to harass hapless women with bewitched hairs.\"\u003c/p\u003e\n\u003cp\u003e\"Yet the echo of his hair bewitched you. Just that. Nothing to do with me.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing to do with you. Look. I\u0027m the last woman in the world who\u0027d ever be in your fan club. I think you\u0027re despicable, the way you encourage your worshipping fans, poor, deluded creatures. It\u0027s immoral to kiss them into insensibility so they become mindless zombies. It\u0027d be normal if you\u0027d screw them, but, no, you keep them lost in permanent unfulfilled infatuation. I\u0027ve seen them wandering around the Inferno, drinking, gambling mindlessly. Maybe doing drugs. That\u0027s a shitty way of drumming up loyal customers, Snow. I\u0027ve even been suspected of killing one of them because she fixated on me after you mauled me in the Inferno Bar.\"\u003c/p\u003e\n\u003cp\u003eHe leaned back in his white leather executive chair, balancing a black Mont Blanc pen on his pallid fingertips. \"You weren\u0027t exactly stopping me.\"\u003c/p\u003e\n\u003cp\u003e\"I took you for an amusing freak,\" I said, very deliberately.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t see any expression behind the dark glasses but his fingertips pressed so hard on the pen that I actually saw them grow whiter, or maybe they looked that way because a blush of pale pink blood showed through his skin above the pressure points.\u003c/p\u003e\n\u003cp\u003eInteresting. He had a circulatory system. That was a big argument in academic circles: did vampires have circulatory systems? Sure they drank blood, but since they were dead, they didn\u0027t have a heartbeat or a pulse. Given their rep as hot-blooded lovers as well as big drinkers, how the hell did they get it up without a pulse or heart beat? Assumption was only available to a few select saints, and they all skedaddled for heaven, not vampire games. Vamp tramps, totally hooked on the blood-sucker-as-Don-Juan mythology, would never tell. They were mesmerized by the vamp powers, and any tales they lived to tell were big on ecstasy and vague on details.\u003c/p\u003e\n\u003cp\u003e\"I took you,\" he said finally, \"for an amusing fool.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d been called worse. \"I want this off!\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t do it. It has a mind of its own, in case you hadn\u0027t noticed.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your familiar.\"\u003c/p\u003e\n\u003cp\u003e\"Now I\u0027m a witch as well as a freak?\"\u003c/p\u003e\n\u003cp\u003e\"Or a warlock.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know what I am.\"\u003c/p\u003e\n\u003cp\u003eHe had me there.\u003c/p\u003e\n\u003cp\u003e\"But you\u0027d love to find out.\" He leaned forward as I leaned away. \"You can\u0027t resist finding out, can you, Delilah? Your whole life has been about finding out... about other people, not yourself. You don\u0027t have a life.\"\u003c/p\u003e\n\u003cp\u003eI understood that calling him a freak had brought this challenge and I was momentarily ashamed. A reporter gets used to feeling like an advocate of the downtrodden. Snow? Downtrodden? What about my manacled wrist?\u003c/p\u003e\n\u003cp\u003eEven as I thought that, Snow said, sympathetically, \"It could be worse.\"\u003c/p\u003e\n\u003cp\u003eIn demonstration, my solo handcuff linked to one that appeared on my left wrist.\u003c/p\u003e\n\u003cp\u003eSnow grinned and picked up the pen again with unbound hands. \"Is your cuff half-empty, or half full?\"\u003c/p\u003e\n\u003cp\u003eThis kind of confinement ramped up my horizontal binding phobia, which Haskell had done nothing to help. I was stuffing panic down as fast as it raced up my esophagus to my throat, keeping cool.\u003c/p\u003e\n\u003cp\u003eOne cuff immediately snapped open and my left wrist dropped free.\u003c/p\u003e\n\u003cp\u003eSnow spoke seriously. \"The police didn\u0027t need to cuff you merely to bring you in for questioning.\"\u003c/p\u003e\n\u003cp\u003eI hated that he guessed, or knew, about my humiliating arrest. \"This police detective named Haskell did,\" I said. \"He\u0027s a bully and bigot.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s to be bigoted about you? Unless someone discriminates against annoying snoops.\"\u003c/p\u003e\n\u003cp\u003e\"It was about the company I keep.\"\u003c/p\u003e\n\u003cp\u003eHe digested that for a few seconds. \"I still haven\u0027t made my point.\" He nodded at the half-handcuff. \"It could be worse.\"\u003c/p\u003e\n\u003cp\u003eThe cuff thinned and wrapped itself around my wrist like a serpent, spilling chains over the top of my hands and ringing one finger.\u003c/p\u003e\n\u003cp\u003eI\u0027d seen some heavy metal bands. I knew this arrangement of chain-linked wrist bangle and ring was called a \"slave bracelet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a mammal person,\" I said, \"I don\u0027t agree.\"\u003c/p\u003e\n\u003cp\u003e\"Or even worse,\" Snow said.\u003c/p\u003e\n\u003cp\u003eI felt the icy swift shiver of the silver snake move up my arm and down my torso under my clothes, settling in a broad cold swath around my pelvis and streaking between my legs to harden into shape with a metal snick like a lock turning.\u003c/p\u003e\n\u003cp\u003eIt felt like a chain-mail bikini bottom, not that I\u0027d ever had a personal acquaintance with one. Haskell and his rough handcuffing were forgotten in the face of a medieval device turned bondage accessory: a freaking chastity belt. It recalled my recent nightmare. Fear became fury, then fear again.\u003c/p\u003e\n\u003cp\u003e\"Obviously, it\u0027s not my familiar,\" Snow said, yawning.\u003c/p\u003e\n\u003cp\u003eLiar! He loved hiding behind his sunglasses and manipulating me into cheesy bondage gear that made me feel naked in front of him, physically and mentally. Stooping to calling him a freak hadn\u0027t helped.\u003c/p\u003e\n\u003cp\u003e\"Still,\" he added, \"it\u0027s a good thing that coveting is a commandment and not a Deadly Sin.\"\u003c/p\u003e\n\u003cp\u003eBefore I could react or speak, the silver snake slid away again, ice water on the move, back to my wrist. Oh. It had morphed into a bracelet dripping charms: a circle of adorable Achilles faces, long-haired, hidden-eyed, sagacious.\u003c/p\u003e\n\u003cp\u003e\"An admirable breed.\" Snow dropped the pen to the desktop like a small bomb. \"I\u0027ve always been partial to Lhasas myself.\"\u003c/p\u003e\n\u003cp\u003eI was still fighting not to blush at the unexpectedly warm sensations the adventurous example of \"could be worse\" had caused. Snow was interested in me, in teasing me? Sexually? Didn\u0027t he have enough groupies? I eyed the lovely Achilles bracelet and melted a little. Why did I suddenly feel in the wrong for descending to name-calling? That didn\u0027t stop a retort.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got more to worry about than your migrating familiar or my hijacked drink recipe. My freedom is on the line.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Mine as well. Do your job, Delilah. That\u0027s the fastest route to the freedom you crave. And maybe mine.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know what he meant, didn\u0027t want to know. I did know it was a good exit line, so I took it.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eNowadays a whole encyclopedia could occupy a disk the size of my little fingernail, and here I sat again in the Clark County Library looking at late twentieth-century microfilm of mid-twentieth century personalities and events.\u003c/p\u003e\n\u003cp\u003eBut that\u0027s when Las Vegas was founded, in the post-World War II world of exploding prosperity and post-Prohibition mob expansion. I found it sad that banning liquor had spurred a drunken binge of organized crime in all areas of vice: gambling, prostitution, and racketeering. And the baby-booming Las Vegas founded by visionary psychopath Bugsy Siegel was at the heart of it all, where mobster and middle class met, each legitimizing the other.\u003c/p\u003e\n\u003cp\u003eOf course, like all visionaries, Bugsy had been punished for it: he had been found dead in 1947 of several bullets to the head at the age of forty-one. The thirties and forties and fifties were the era of drive-by shootings on an epic scale, like the St. Valentine\u0027s Day massacre. So they\u0027d shot up Bugsy\u0027s pretty-boy face through his living room window.\u003c/p\u003e\n\u003cp\u003eI unreeled the early history of Las Vegas. First came the El Rancho Grande and the Last Frontier. The 1948 founding of Bugsy\u0027s beloved Flamingo Hotel was the turning point. The first hotel-casinos were small, upgraded motels three hundred miles from Los Angeles and an endless drive from the rest of the country, but they were an adventure destination for those lost souls in search of glamour. Only a few years later a successful animator named Walt Disney would create an adventure destination for the whole family called Disneyland.\u003c/p\u003e\n\u003cp\u003eBugsyland had always been an adult playground, saturated with sex, booze, and gambling. And it had been worth fighting over.\u003c/p\u003e\n\u003cp\u003eI vaguely knew that the East Coast Italian Mob of Mobs, the Jewish mob (from whence Benjamin aka Bugsy Siegel), and other mobs, chiefly Chicago, which was Irish, met, maneuvered, kissed Judas cheeks and rubbed out each other in Las Vegas.\u003c/p\u003e\n\u003cp\u003eBut I\u0027d never heard of the French mobs until now. The Italian-Irish-Jewish mob triad made sense. All resulted from the massive influx of European immigrants through the Golden Door mentioned in the poem beneath the Statue of Liberty. The French had given the U.S. that Amazonian artwork and its defining image-not masses of refugees. Why would a French mob, small and superior, figure in the founding of Las Vegas?\u003c/p\u003e\n\u003cp\u003eSo little was said of it that I had to literarily read between the lines of microfilm. The word \"Inferno\" in one article riveted my attention, though. \"Monsieur Reynard, chevalier of France, has announced his plans to build a lavish hotel-casino called the Inferno, complete with Folies Bergere-style bare-breasted chorines, along the highway already occupied by El Rancho Vegas, the Last Frontier, and the late Bugsy Siegel\u0027s Flamingo hotel-casinos. French investment would indeed add luster to the thriving desert strip of nightclubs. Some have compared the future Inferno to Montmartre\u0027s Moulin Rouge in Paris.\"\u003c/p\u003e\n\u003cp\u003eI got it. The naughty French had invented the can-can and the topless chorus girl at the Moulin Rouge in the late nineteenth and early twentieth century. Why wouldn\u0027t they exhibit an interest in such a wide-open site of American adult entertainment as early Las Vegas? Even today, Nevada was the only state in the Union to legalize houses of prostitution.\u003c/p\u003e\n\u003cp\u003eBut a French mob? It defied imagination. Weren\u0027t the French far too refined to resort to machine guns and blood and guts... ? Well, yes, except during their own late-eighteenth century bloodbath of a Revolution. American gangsters had come up with the Tommy gun, the Thompson sub-machine gun. The French had come up with a really big butcher\u0027s cleaver, the guillotine, a hundred-and-fifty-years earlier. French. Christophe. Could it be-? I finally found Reynard\u0027s first name. Christophe. And Reynard, if I remembered my convent-school French, meant \"fox.\"\u003c/p\u003e\n\u003cp\u003eSo why was there no further reference to the Inferno for seventy-some years?\u003c/p\u003e\n\u003cp\u003eA few more turns of the microfilm reel made all that clear.\u003c/p\u003e\n\u003cp\u003eThe Jeanne d\u0027Arc Day massacre.\u003c/p\u003e\n\u003cp\u003eSt. Joan had been the French peasant girl who\u0027d led the French king\u0027s forces against the invading English in the fourteenth century, a peasant girl turned God\u0027s own general, then martyr and saint. She\u0027d been bound and burned at the stake as witch. Historically, the French had it in for werewolves. It was the English who burned witches-and Joan-at the stake, not the French. Centuries later, the French delegation to Las Vegas was found massacred on May 30,1946-the day Jeanne d\u0027Arc died in 1431 and, after she was finally canonized in 1920 as a Catholic saint, her feast day-literally torn apart on the site of Sunset Park. I needed to find out much more about this little-known fact of the city\u0027s history.\u003c/p\u003e\n\u003cp\u003eMuch as I hated to, I had to defer to Hector Nightwine\u0027s encyclopedic knowledge of Las Vegas and its history. When I got back to my Enchanted Cottage, I was forced to make an appointment through Godfrey. Dinner was decreed.\u003c/p\u003e\n\u003cp\u003eGiven my suspicions about Nightwine\u0027s menu-the man had a ghoulish interest in murder, death, decomposition, and dissection, but then, so did a huge proportion of the American reading and viewing public-I agreed with a sigh. I would take the diet books\u0027 advice and eat \"healthily\" before dining out.\u003c/p\u003e\n\u003cp\u003eSomething told me to dress for dinner. I riffled my vintage clothes rack and found an early fifties cocktail dress. Its black satin portrait neckline filled with a pricey rhinestone Weiss necklace from the same era as soon as I shimmied myself into its tight sheath skirt. I topped it off the look with a close-fitting black velvet cocktail hat that ended with a pompon of shiny blue-black cock feathers at my right temple. Just right for a human sacrifice. Black satin wrist-length gloves sported a rhinestone button at each wrist, and a three-inch wide rhinestone bracelet from my collection complemented the Snow necklace.\u003c/p\u003e\n\u003cp\u003eMan, I would accept this Weiss necklace if offered, even from Snow. It would bring at least six hundred dollars on eBay. Too bad Snow\u0027s decorative devices kept morphing and never added to my permanent collection. I guess Snow was like that, raining, freezing, and melting on my parade, all the time.\u003c/p\u003e\n\u003cp\u003eGodfrey welcomed me at the manse\u0027s front door.\u003c/p\u003e\n\u003cp\u003e\"Very chic,\" he said, eyeing my get-up. \"A bit past my heyday, but otherwise quite appealing. Somehow the fifties are so depressingly dedicated to... corsets.\"\u003c/p\u003e\n\u003cp\u003eGodfrey\u0027s era was the no-underwear-to-speak-of thirties of bathtub gin and speak-easies, but corsets would appeal to the expansively overflowing Nightwine, for sure.\u003c/p\u003e\n\u003cp\u003eIt struck me that a freelance investigative reporter had to be a woman of many faces. And figures.\u003c/p\u003e\n\u003cp\u003eThe Nightwine dining room rivaled Hearst Castle for expansiveness, with only us two at opposite ends of the endless table. The soup course was a beef consomm�� that didn\u0027t look yucky or make me think of yak blood, so I tried it.\u003c/p\u003e\n\u003cp\u003e\"Now,\" Nightwine said, \"what do you need to know?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing much. Only who founded Las Vegas.\"\u003c/p\u003e\n\u003cp\u003e\"Who? Or... what?\"\u003c/p\u003e\n\u003cp\u003e\"I like that \u0027or what\u0027? Intriguing, to say the least.\"\u003c/p\u003e\n\u003cp\u003eHe sank back into his own bulk, happy to be speaking and not moving, except for his right, fork-filled hand.\u003c/p\u003e\n\u003cp\u003e\"The vampires,\" he said, \"never had a chance.\"\u003c/p\u003e\n\u003cp\u003e\"Not my impression of vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Poor creatures. It\u0027s a matter of time zones.\"\u003c/p\u003e\n\u003cp\u003e\" Pacific Coast time is hard on vampires?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m speaking of more personal time zones,\" Nightwine said. \"Werewolves by nature are 24/7 creatures. The vamps are handicapped by their daily twelve hours of sleep during daylight hours. When it came to days of the month, werewolves could do 26/31 without losing half of every twenty-four hours to casket time. That\u0027s why werewolves are still a force in this town and vampires are on Skid Row.\"\u003c/p\u003e\n\u003cp\u003e\"Christophe?\"\u003c/p\u003e\n\u003cp\u003e\"You think he\u0027s a vampire, my dear?\" Hector smacked his lips. \"Very tasty.\"\u003c/p\u003e\n\u003cp\u003e\"Christophe?\" I asked, amazed. Hector hadn\u0027t yet shown any sexual preference besides dead or alive, and edible. Come to think of it, vampires might fit his double bill to a T as in, yes, Tasty.\u003c/p\u003e\n\u003cp\u003eHector regarded me soulfully. He dabbed his beard and mustache with his napkin as if mourning any tidbits that had escaped his voracious maw.\u003c/p\u003e\n\u003cp\u003e\"I was praising the oxblood soup you seem to be enjoying as well.\"\u003c/p\u003e\n\u003cp\u003eOxblood soup! I pushed away the shallow dish, trying to be a polite guest and not gag. \"I don\u0027t do raw.\"\u003c/p\u003e\n\u003cp\u003e\"Tsk. You\u0027ll miss out on many delicacies.\"\u003c/p\u003e\n\u003cp\u003e\"You can have my share.\" I decided to stick to salad for the rest of the meal. \"So you\u0027re saying werewolves are still a power in Las Vegas? That\u0027s not common knowledge, and the only werewolves I\u0027ve seen so far are those wretched half-weres and some pretty ordinary folks who like to dance and have a good time, then go for a four-footed midnight ramble in the mountains. If they run down anything and eat it, they aren\u0027t any worse than two-legged hunters and probably need the calories more.\"\u003c/p\u003e\n\u003cp\u003e\"The half-weres you\u0027ve seen are veterans of the Las Vegas Werewolf-Vampire War back in the forties and fifties of the last century. It\u0027s not in the history books, of course. Only the mob was here and they were the third leg on that triangular struggle. Some of the werewolves suffered vampire bites during the hostilities and found themselves frozen in a half-changed state. They also got the vamps\u0027 immortality but were shunned by the pure werewolves. So today they are about as low as most of the remaining vampires on the Vegas totem pole. No. Your Christophe is not a player from the old days, if he is a vampire. Why do you think so?\"\u003c/p\u003e\n\u003cp\u003e\"The so-called career as a rock star suits the vamp lifestyle. He\u0027s pale as death but as arrogant as all get-out. And he hypnotizes his slavish groupies and turns them into mindless zombies. He\u0027s got more brides than the social register.\"\u003c/p\u003e\n\u003cp\u003e\"Do I detect a soupcon of jealousy?\"\u003c/p\u003e\n\u003cp\u003e\"No!\" But I felt a bit hypocritical saying this while basking in the glitter of Snow\u0027s vintage necklace. \"From what you\u0027ve said, if he is a vampire, he\u0027s challenging the social and business order that\u0027s been mainstream in Vegas for almost seven decades.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think he could?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. He\u0027d have the nerve. Whether he\u0027d last... \"\u003c/p\u003e\n\u003cp\u003e\"My conclusion exactly.\"\u003c/p\u003e\n\u003cp\u003e\"Meanwhile, I\u0027m more worried about whether I\u0027ll last. You know that the Las Vegas Metropolitan police consider me a suspect for the murder of one of Christophe\u0027s groupies. I can\u0027t solve the murders at the park across the way if I\u0027m being held for Murder One myself. I appreciate your... producing... Perry Mason to spring me from custody, but I\u0027m hoping I won\u0027t need a trial lawyer.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t your FBI friend help you?\"\u003c/p\u003e\n\u003cp\u003e\"Ex-FBI. Besides, he\u0027s out of the country. I want to plough ahead on your assignment before Detective Haskell has me sent to the penitentiary.\"\u003c/p\u003e\n\u003cp\u003e\"Haskell!\" Hector grew so agitated he pushed away his blood-soup bowl. \"That bastard has done everything possible to interfere with my true-crime investigations. I think he\u0027s on somebody\u0027s payroll.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d never seen Hector Nightwine lose his Rhino of the Jungle cool before.\u003c/p\u003e\n\u003cp\u003e\"So where do I go to get to the bottom of these forties murders?\"\u003c/p\u003e\n\u003cp\u003e\"The werewolf-run Triad is the Magus-Gehenna-Megalith.\"\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t want to find the anointed kingpins. I want the malcontents. Where are the vampires who lost the Werewolf-Vampire war? You can\u0027t kill \u0027em, after all. They have to be somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"I told you. They were driven out.\"\u003c/p\u003e\n\u003cp\u003e\"They just left Las Vegas?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged those massive shoulders. \"Oh, there\u0027s one old wreck of a hotel they\u0027d tried to make the flagship of their Triad. It\u0027s deserted now. Steve Wynn is rumored to be interested in buying the property. Oddly enough, a deal has never gone through for all these years.\"\u003c/p\u003e\n\u003cp\u003eWhen it came to vampires, I didn\u0027t believe in \"oddly enough.\"\u003c/p\u003e\n\u003cp\u003e\"Abandoned hotels just sit here for years in Las Vegas?\"\u003c/p\u003e\n\u003cp\u003eHector shrugged and leaned back while the salad course was placed in front of him.\u003c/p\u003e\n\u003cp\u003eI could swear that some of the black olive slices were moving. Wriggling, sort of. That didn\u0027t stop Nightwine from holding forth.\u003c/p\u003e\n\u003cp\u003e\"In 1967 Elvis Presley married Priscilla Beaulieu at the Aladdin Hotel. By nineteen seventy-four, Elvis was dead. By nineteen eighty-five the Aladdin was a dying hulk. By two thousand, it had been bought, razed, and resurrected, if a bit shakily. By 2007, it was revamped as Planet Hollywood.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re saying the vamps-\"\u003c/p\u003e\n\u003cp\u003e\"In this case it is just an expression. Although, given the blood-sucking done in Hollywood... Las Vegas is about nothing if it is not about decay and resurrection.\"\u003c/p\u003e\n\u003cp\u003eSpeaking of which, my own plate of greens had been placed before me. From his position by the sideboard, Godfrey winked. My salad appeared to host no black olives, moving or not.\u003c/p\u003e\n\u003cp\u003e\"No doubt,\" Nightwine said, his fork chasing down an escaping olive, \"the property is tied up for eternity. One thing the vampires are masters at: they know how to protect what\u0027s theirs in legal perpetuity.\"\u003c/p\u003e\n\u003cp\u003eWhich meant they never gave up.\u003c/p\u003e\n\u003cp\u003eNeither did I. \"I need to talk to someone who was around at the time of the Werewolf-Vampire Wars.\"\u003c/p\u003e\n\u003cp\u003e\"You and sixteen hundred tabloid reporters.\"\u003c/p\u003e\n\u003cp\u003e\"I work for you, Hector. It would pay you to help me out more than some scummy scandal-seeker.\"\u003c/p\u003e\n\u003cp\u003e\"My dear Delilah! You have just put us on first-name terms. I\u0027m so... flattered. If you\u0027re not going to eat your blanched maggots, do let Godfrey bring the plate to me.\"\u003c/p\u003e\n\u003cp\u003eAnd here I took them for sliced almonds!\u003c/p\u003e\n\u003cp\u003eHector munched disgustingly, then spoke again, with his mouth full. \"You do realize, my dear, what anyone who had been around then and was still surviving would be?\"\u003c/p\u003e\n\u003cp\u003e\"An old vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Vilma Brazil,\" he mumbled between maggots.\u003c/p\u003e\n\u003cp\u003e\"She is the old vampire?\"\u003c/p\u003e\n\u003cp\u003e\"More like the old vamp. A B-movie actress from the forties, when the difference between a mistress and a whore was as thin as cigarette paper. Alas, she is still legitimately alive, more\u0027s the pity. She wrangles CinSim wardrobes at the Twin Peaks. You\u0027ll not want the management to know what you\u0027re up to, but give her an ear and a few twenty-dollar bills and you\u0027ll hear plenty.\"\u003c/p\u003e\n\u003cp\u003e\"Great.\" I stood.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not staying for the main course? It\u0027s fit for a king.\"\u003c/p\u003e\n\u003cp\u003e\"I eat like a bird.\"\u003c/p\u003e\n\u003cp\u003eEspecially after dining with Hector Nightwine! He had a real future as a diet guru, through aversion training.\u003c/p\u003e\n\u003cp\u003eIf I hurried, I might catch Vilma Brazil at the Twin Peaks.\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eDolly purred like a puma when I revved her out of the cottage\u0027s carriage house and through the gate onto Sunset Road.\u003c/p\u003e\n\u003cp\u003eI think she approved that my get-up matched her DOB: Date of Birth to us crime reporters.\u003c/p\u003e\n\u003cp\u003eI\u0027d freshened up at the cottage, putting in my gray contact lenses and running black lipstick over my original red. Moving among CinSymbiants and CinSims as either of them was a great disguise in Las Vegas. The hall mirror insisted on imprinting on my eyes as true blue, but my purse mirror told me I was passing as cinematic gray.\u003c/p\u003e\n\u003cp\u003eI left Dolly to the tender mercies of a parking valet who resembled a young Arnold Schwarzenegger and clattered solo into the Twin Peaks on my fifties spike heels. Where was Perry Mason when you needed him?\u003c/p\u003e\n\u003cp\u003eWhere fashion made forties women look statuesque and stern and seriously sexy in a dominatrix way, fifties women had looked fussy and frivolous and French maidish in a Trixie way. That look suited me fine right now. Nothing like being underestimated for collecting lots of information.\u003c/p\u003e\n\u003cp\u003eThe Twin Peaks had a CinSim transvestite revue. Now that\u0027ll blow your mind. Velma, I discovered, was wardrobe mistress. I found her backstage sewing chorines of indeterminate gender into torn costumes and gluing marabou feathers back onto pasties and posing pouches. Good thing I was a hardened reporter.\u003c/p\u003e\n\u003cp\u003e\"Vilma Brazil?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, dahlink?\"\u003c/p\u003e\n\u003cp\u003eShe looked ninety the way it would look on silicone and bleach, kind of like your brain on speed: scrambled. But beneath the drawn-on eyebrows reaching for the sky and the frizzled platinum curls, her eyes were blackberry-bright and nicely avaricious.\u003c/p\u003e\n\u003cp\u003eI sat on a plain wooden chair in front of a mirror dusted with powder and glitter. Funny, my CinSymbiant-gray contacts never registered in a mirror. I faced my blue-eyed self and then forgot about it.\u003c/p\u003e\n\u003cp\u003e\"If you have a tip for me,\" I told Vilma, \"I have a few tips for you.\" I let the corner of a twenty-dollar bill play Peeping Tom out of my evening purse. Luckily, legal tender doesn\u0027t change much through the decades.\u003c/p\u003e\n\u003cp\u003eThe twenty disappeared down her cavernous cleavage. One thing will never let a girl down: silicone.\u003c/p\u003e\n\u003cp\u003e\"Whatcha wanna know, baby doll?\"\u003c/p\u003e\n\u003cp\u003e\"I need to speak to a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Are you press, that it? You want, like, an interview?\u003c/p\u003e\n\u003cp\u003e\"I am press, and, yes, I want an interview, but not with just any vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Honey, any vamp is hard to come by in Vegas nowadays.\"\u003c/p\u003e\n\u003cp\u003e\"I need to speak with a vampire of the old school. One who was here during the Werewolf-Vampire Wars.\"\u003c/p\u003e\n\u003cp\u003e\"Shhh!\" She looked around, as if even the wig stands had ears.\u003c/p\u003e\n\u003cp\u003eWell, the Big Bad Wolf from Little Miss Riding Hood had had great big ears. And eyes. And teeth. One wondered what else big he had.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s so dangerous, dahlink,\" she whispered to me. \"If the WWs don\u0027t devour you for it, the Vs would drink you dry.\"\u003c/p\u003e\n\u003cp\u003e\"Then there are still... Vs in Vegas?\"\u003c/p\u003e\n\u003cp\u003e\"Just a bloody few. All the Old Ones left; only a few young hotheads stayed behind.\"\u003c/p\u003e\n\u003cp\u003e\"How young?\"\u003c/p\u003e\n\u003cp\u003e\"Pre-Millennium Revelation, but only by a few decades.\"\u003c/p\u003e\n\u003cp\u003e\"All I need is one that witnessed the wars.\"\u003c/p\u003e\n\u003cp\u003e\"There is only one of that vintage and he\u0027s kept under wraps so deep you could wear them on an Arctic expedition.\"\u003c/p\u003e\n\u003cp\u003eHe. The oldest living, sort of, relic of the wars. He\u0027d be at least a hundred-something, young in vampire years. A kid in their terms.\u003c/p\u003e\n\u003cp\u003e\"Where can I find him? How can I, um, interview him?\"\u003c/p\u003e\n\u003cp\u003eVelma\u0027s blood-shot old eyes were focusing hard on the poker hand of twenty-dollar bills that fanned through my ringers.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a way you might do it, but the odds of you getting out of there undead are pretty low.\"\u003c/p\u003e\n\u003cp\u003e\"Money talks, Velma honey. Now you talk to me.\"\u003c/p\u003e\n\u003cp\u003eSo she did. \u003c/p\u003e","sourceLink":"https://allnovel.net/dancing-with-werewolves-delilah-street-1/page-10.html","bookId":2113,"creation":"Oct 5, 2019 5:54:45 PM","modification":"Oct 5, 2019 5:54:45 PM"}
