{"id":70519,"no":38,"title":"Page 38","content":"\u003cp\u003eAgain, Janus Pitt sat there alone, enclosed.\u003c/p\u003e\n\u003cp\u003eThe red dwarf star was no longer an engine of death. It was just a red dwarf star to be pushed to one side by an ever more arrogant humanity, growing yet further in power.\u003c/p\u003e\n\u003cp\u003eBut Nemesis still existed, though it was no longer the star.\u003c/p\u003e\n\u003cp\u003eFor billions of years, life on Earth had been isolated, performing its separate experiment, rising and sinking, flourishing and undergoing vast extinctions, Perhaps there were other worlds on which life existed, each one isolated for billions of years.\u003c/p\u003e\n\u003cp\u003eAll experiments - all, or almost all, failures in the long run. One or perhaps two that were successes and worth all the rest.\u003c/p\u003e\n\u003cp\u003eBut that was only if the Universe were large enough to isolate all the experiments. If Rotor - their Ark - had been isolated as Earth and the Solar System had been, it might have been the one to work.\u003c/p\u003e\n\u003cp\u003eBut now-\u003c/p\u003e\n\u003cp\u003eHe clenched his fists in fury - and desperation. For he knew that humanity would run from star to star as easily as it had run from continent to continent and before that from region to region. There would be no isolation, no self-contained experiments. His grand experiment had been discovered, and doomed.\u003c/p\u003e\n\u003cp\u003eThe same anarchy, the same degeneration, the same thoughtless short-term thinking, all the same cultural and social disparities would continue to prevail - Galaxy-wide.\u003c/p\u003e\n\u003cp\u003eWhat would there be now? Galactic empires? All the sins and follies graduated from one world to millions? Every woe and every difficulty horribly magnified?\u003c/p\u003e\n\u003cp\u003eWho would be able to make sense out of a Galaxy, when no-one had ever made sense out of a single world? Who would learn to read the trends and foresee the future in a whole Galaxy teeming with humanity?\u003c/p\u003e\n\u003cp\u003eNemesis had indeed come. \u003c/p\u003e","sourceLink":"https://allnovel.net/nemesis/page-38.html","bookId":1743,"creation":"Oct 5, 2019 10:17:02 AM","modification":"Oct 5, 2019 10:17:02 AM"}
