{"id":8685,"no":10,"title":"CHAPTER IX. MRS. MERTON.","content":"\u0026nbsp;“We’ll go across Broadway, and take the Sixth Avenue cars, Tom,” said the captain. \n\u003cdiv\u003e\n “Are we goin’ to ride?” asked Tom, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you don’t catch me lugging this heavy carpet-bag up to Sixteenth Street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was rather surprised at this. She did not understand why her services were required to carry the bundle if they were going to ride. However, she very sensibly remained silent, not feeling called upon to comment on her employer’s arrangements.\n\u003c/div\u003e \n\u003cdiv\u003e\n At this time in the day there was no difficulty in obtaining a seat in the cars. Tom, however, was not disposed to sit down quietly:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll stand outside,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” said Captain Barnes, and he drew out a copy of a morning paper which he had purchased on leaving the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n 89Tom took her position beside the driver. She rather enjoyed the ride, for, though she had lived in the city for years, she had seldom been on the car as a passenger, though she had frequently stolen a ride on the steps of a Broadway omnibus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Johnny, are you going up town to look after your family?” asked the driver, good-naturedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d have to look a long time before I found ’em,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t you got any relations, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s an old woman that calls herself my granny.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does she live up on Fifth Avenue?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom; “next door to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve got me there,” said the driver, laughing. “Give my respects to your granny, and tell her she’s got a smart grand-daughter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will, when I see her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you live with her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not now. She aint my style.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the conductor tapped Tom on the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He pays for me,” said Tom, pointing back at Captain Barnes.\n\u003c/div\u003e \n\u003cdiv\u003e\n 90“I suppose he’s your grandfather,” said the driver, jocosely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish he was. He’s a trump. He gave me a stunnin’ breakfast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you like him better than your granny?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can bet on that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Barnes, sitting near the door, heard a part of this conversation, and it amused him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder,” he thought, “whether my sister will be willing to assume charge of this wild little girl? There’s enough in her to make a very smart woman, if she is placed under the right influences and properly trained. But I suspect that will require not a little patience and tact. Well, we shall see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After a while the car reached Sixteenth Street, and the captain left it, with Tom following him. They turned down Sixteenth Street from the avenue, and finally stopped before a fair-looking brick house. Captain Barnes went up the steps, and rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mrs. Merton at home?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said the servant, looking hard at Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll come in. Tell her her brother wishes to see her. Come in, Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 91Tom followed the captain, the servant continuing to eye her suspiciously. They entered the parlor, where Captain Barnes took a seat on the sofa, motioning Tom to sit beside him. Tom obeyed, surveying the sofa with some curiosity. The families in the tenement house with whom she had been on visiting terms did not in general possess sofas. She had sometimes seen them in furniture stores, but this was the first time she had sat upon one.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you thinking of, Tom?” asked the captain, desiring to draw her out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does your sister live here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s rich, isn’t she?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, she makes a living by keeping boarders. Perhaps you’d like to board with her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She don’t take the likes of me,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose you were rich enough, wouldn’t you like to board here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” said Tom, looking round. “It’s dark.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 92“All the rooms are not dark. Besides, you’d get three square meals every day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like that,” said Tom, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Their further conversation was interrupted by the entrance of the captain’s sister, Mrs. Merton. She was rather a stout woman, but there was an expression of care on her face, which was not surprising, for it is no light thing to keep a New York boarding-house.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When did you arrive in the city, Albert?” she asked, giving him her hand cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only just arrived, Martha. How does the world use you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t complain, though it’s a wearing thing looking after a household like this. Have you had any breakfast?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I took some down town.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Mrs. Merton’s eye fell for the first time upon Tom. She started in surprise, and looked doubtfully at her brother.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is this?” she asked. “Did she come with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n 93“It’s a young friend of mine. She met me at the wharf, and wanted to carry my carpet-bag.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You didn’t let her do it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bless you, no. It’s big enough to pack her away in. But I employed her to carry a bundle. Didn’t I, Tom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you call her?” asked his sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom. That’s her name, so she says.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What made you bring her here?” asked Mrs. Merton, who evidently regarded her brother’s conduct as very queer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you, but not before her. Tom, you can go out into the entry, and shut the door behind you. I’ll call you in a few minutes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom went out, and Captain Barnes returned to the subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s got no relations except an intemperate old grandmother,” he said. “I’ve taken a fancy to her, and want to help her along. Can’t you find a place for her in your kitchen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I take a girl from the street!” ejaculated Mrs. Merton. “Albert, you must be crazy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all. I am sure you can find something 94for her to do,—cleaning knives, running of errands, going to market, or something of that kind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a very strange proposal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why is it? At present she lives in the street, being driven from the only home she had, by the ill-treatment of a vicious grandmother. You can see what chance she has of growing up respectably.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But there are plenty such. I don’t see that it’s our business to look after them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know why it is, but I’ve taken a fancy to this little girl.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She looks perfectly wild.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t deny that she is rather uncivilized, but there’s a good deal in her. She’s as smart as a steel trap.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Smart enough to steal, probably.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, under temptation. I want to remove the temptation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a very strange freak on your part, Albert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know about that. You know I have no child of my own, and am well off, so far as this world’s goods are concerned. I have long thought I 95should like to train up a child in whom I could take an interest, and who would be a comfort to me when I am older.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can find plenty of attractive children without going into the street for them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want a tame child. She wouldn’t interest me. This girl has spirit. I’ll tell you what I want you to do, Martha. I’m going off on a year’s voyage. Take her into your house, make her as useful as you can, civilize her, and I will allow you a fair price for her board.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want her to go to school?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “After a while. At present she needs to be civilized. She is a young street Arab with very elementary ideas as to the way in which people live. She needs an apprenticeship in some house like this. My little niece must be about her age.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mary? How can I trust her to the companionship of such a girl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom isn’t bad. She is only untrained. She will learn more than she will teach at first. Afterwards Mary may learn something of her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 96“I am sure I don’t know what to say,” said Mrs. Merton, irresolutely.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the captain named the terms he was willing to pay for Tom’s board. This was a consideration to Mrs. Merton, who found that she had to calculate pretty closely to make keeping boarders pay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll try her,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Martha. You can let her go into the kitchen at first, till she is fit to be promoted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She must have some clothes. She had on a boy’s jacket.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and cap. In fact she is more of a boy than a girl at present.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not sure but some of Mary’s old dresses may fit her. Mary must be a little larger than she is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That reminds me I brought a doll for Fanny. She has not grown too large for dolls yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, she is just the age to enjoy them. She will be delighted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think we may call in Tom now, and inform her of our intention.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She must have another name. It won’t do to call a girl Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 97“She said her name used to be Jenny, but she has been nicknamed Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was opened, and Captain Barnes called in Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in, Tom,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Tom. “I’m on hand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ve been talking about you, Tom,” pursued the captain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you been sayin’?” asked Tom, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve been telling my sister that you had no home, and were obliged to earn your own living in the streets.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care much,” said Tom. “I’d rather do that than live with granny, and get licked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But wouldn’t you like better to have a nice home, where you would have plenty to eat, and a good bed to sleep in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe I would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve been asking my sister to let you stay here with her. Would you like that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom regarded Mrs. Merton attentively. The face was careworn, but very different from granny’s. On 98the whole, it inspired her with some degree of confidence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If she wouldn’t lick me very often,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How about that, Martha?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can promise that,” said Mrs. Merton, amused in spite of herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you will have to work. My sister will find something for you to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I aint afraid of work,” said Tom, “if I only get enough to eat, and aint licked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see, Tom, I feel an interest in you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re a brick!” said Tom, gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Little girl,” said Mrs. Merton, shocked, “you mustn’t use such language in addressing my brother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind, Martha; she means it as a compliment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A compliment to call you a brick!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly. But now about clothes. Can’t you rig her out with something that will make her presentable?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She needs a good washing first,” said Mrs. Merton, surveying Tom’s dirty face and hands with disfavor.\n\u003c/div\u003e \n\u003cdiv\u003e\n 99“A very good suggestion. You won’t mind being washed, I suppose, Tom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d just as lives,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n In fact she was quite indifferent on the subject. She was used to being dirty, but if she could oblige her new protector by washing, she was quite willing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got to go out for an hour or two,” said Captain Barnes, “but I will leave my carpet-bag here, and come back to lunch.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course, Albert. When do you sail?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In three days at farthest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you will remain here up to the day of sailing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, if you can find a spare corner to stow me in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be odd if I couldn’t find room for my only brother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So be it, then. You may expect me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose and taking his hat left the house. Tom and Mrs. Merton were now alone.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3007/83011.html","bookId":284,"creation":"Aug 1, 2019 8:41:52 AM","modification":"Aug 1, 2019 8:41:52 AM"}
