{"id":8687,"no":12,"title":"CHAPTER XI THE MISTAKES OF A MORNING.","content":"\u0026nbsp;On the way to the kitchen they met Sarah, the chambermaid, going upstairs to make the beds. \n\u003cdiv\u003e\n “Sarah,” said Mrs. Merton, “here is a little girl who is going to stay with me, and help about the house. You may take her upstairs, and show her how to help you make the beds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n If Tom had been in her street costume, Sarah would have preferred to dispense with her assistance, but she looked quite civilized and respectable now, and she accepted the offer. Tom accompanied her upstairs to the second floor. The first chamber was that of Mr. Craven,—a gentleman in business down town. It was of course vacant, therefore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom looked about her curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Sarah, “do you know anything about making beds?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n 110“Then stand on one side, and I will tell you what to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom followed directions pretty well, but, as the task was about finished, an impish freak seized her, and she caught the pillow and threw it at Sarah’s head, disarranging that young lady’s hair, and knocking out a comb.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that for?” demanded Sarah, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom sat down and laughed boisterously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s bully fun!” she said. “Throw it at me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll give you a shaking, you young imp,” said Sarah. “You’ve broke my comb.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She picked up the comb, and dashed round the bed after Tom, who, seeing no other way for escape, sprang upon the bed, where she remained standing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come down from there,” demanded Sarah.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me alone, then!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell the missis, just as sure as you live!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’ll she do? Will she lick me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This would not have checked Tom, but it occurred to her, all at once, that her freak would be reported to the captain, and might displease him.\n\u003c/div\u003e \n\u003cdiv\u003e\n 111“I’ll stop,” said she. “I was only in fun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time, Sarah had ascertained that the comb was not broken, after all, and this made her more inclined to overlook Tom’s offence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now behave decent!” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n She gave Tom further directions about the proper way of doing chamber-work, which Tom followed quite closely, being resolved apparently to turn over a new leaf. But her reformation was not thorough. She caught sight of Mr. Craven’s shaving materials, which he had carelessly left on the bureau, and before Sarah anticipated her intention, she had seized the brush and spread the lather over her cheeks.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing, you little torment?” asked Sarah.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m goin’ to shave,” said Tom. “It must feel funny.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Put that razor down!” said Sarah, approaching.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom brandished the razor playfully, in a manner that considerably startled the chamber-maid, who stopped short in alarm:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll go and tell the missis how you cut up,” said she, going to the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n 112This was unnecessary, however, for at this moment Mrs. Merton, desirous of learning how Tom was getting along, opened the door. She started back in dismay at the spectacle which greeted her view, and, in a tone unusually decided for so mild a woman, said, “Jenny, put down that razor instantly, and wipe the soap from your cheeks. Not so,” she added hastily, seeing that Tom was about to wipe it off upon her skirt. “Here, take the towel. Now, what do you mean by such conduct?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wouldn’t he like it?” asked Tom, somewhat abashed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean my brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, the sailor man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he would be very angry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I won’t do so again;” and Tom seemed quite decided in her repentance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What possessed you to touch those things, Jenny?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t all she did, mum,” said Sarah. “She threw the pillow at me, and almost druv the comb into my head. She’s the craziest creetur’ I ever sot eyes on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 113“Did you do that?” asked Mrs. Merton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom. “I told her she might pitch it at me. It’s bully fun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t allow such goings-on,” said Mrs. Merton. “If you do so again, I must send you back to your grandmother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t know where she lives,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “At any rate I won’t keep you here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom thought of the three square meals which she would receive daily, and decided to remain. She continued quiet, therefore, and really helped Sarah in the remaining rooms. When this task was completed she went downstairs. At this moment a ring was heard at the door-bell. Thinking that it might be the captain, Tom answered the summons herself. She opened the door suddenly, but found herself mistaken.\n\u003c/div\u003e \n\u003cdiv\u003e\n A young gentleman was the visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can I see Mrs. Merton?” he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom; “come in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped into the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come right along. I’ll show you where she is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She knew that the landlady was in the kitchen, and 114supposed that this was the proper place to lead the visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n The latter followed Tom as far as the head of the stairs, and then paused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you leading me?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s down in the kitchen. Come right along.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I will stay here. You may tell her there is a gentleman wishes to see her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom went down, and found the landlady.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s a feller upstairs wants to see you,” she said. “He wouldn’t come down here. I asked him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good gracious! You didn’t invite him down into the kitchen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You should have carried him into the parlor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Tom. “I’ll know better next time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Merton smoothed her hair, and went upstairs to greet her visitor, who proved to be an applicant for board.\n\u003c/div\u003e \n\u003cdiv\u003e\n Only fifteen minutes later Tom had a chance to improve on her first mistake. Again the door-bell rang, 115and again Tom opened the door. A wrinkled old woman, with a large basket, stood before her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m a poor widder,” she whined, “with four childer that have nothing to ate. Can’t you give me a few pennies, and may the blessings of Heaven rest upon you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman stepped into the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come right in here,” said Tom, opening the door of the parlor.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old beggar, not accustomed to being received with so much attention, paused doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in, if you’re comin’,” said Tom, impatiently. “The lady told me to put everybody in here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman followed, and took a seat on the edge of a sofa, placing her basket on the carpet. Before Tom had a chance to acquaint her mistress with the fact that a visitor awaited her, the bell rang again. This time Tom found herself confronted by a fashionably dressed and imposing-looking lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish to see Mrs. Merton,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n 116“All right!” said Tom. “Just you come in, and I’ll call her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The visitor entered, and was ushered also into the parlor. Leaving her to find a seat for herself, Tom disappeared in pursuit of the landlady.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Courtenay did not at first observe the other occupant of the room. When her eyes rested on the old crone sitting on the sofa, with her basket, which was partly stored with cold victuals, resting on the carpet, she started in mingled astonishment and disgust. Her aristocratic nostrils curved, and, taking a delicate handkerchief, she tried to shut out the unsavory presence. The old woman saw the action, and fidgeted nervously, feeling that she ought not to be there. While the two guests were in this uncomfortable state of feeling, Mrs. Merton, quite unsuspicious of anything wrong, opened the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is this Mrs. Merton?” asked Mrs. Courtenay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, madam.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I called to inquire about a servant who referred me to you,” continued Mrs. Courtenay, haughtily; “but I didn’t anticipate the company I should find myself in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 117Following her glance, Mrs. Merton was struck with dismay, as she saw the second visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How came you here?” she demanded hastily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The little gal brought me. It wasn’t my fault indeed, mum,” whined the old woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m a poor widder, mum. If you could be so kind as to give me a few pennies.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have nothing for you to-day. You can go,” said Mrs. Merton, who was too provoked to be charitable, as otherwise she might have been. She pointed to the door, and the applicant for charity hobbled out hastily, feeling that she was not likely to obtain anything under present circumstances.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must beg your pardon,” said Mrs. Merton, “for the mistake of an inexperienced child, who has never before waited upon the door; though, how she could have made such an absurd blunder, I cannot tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Courtenay deigned to be appeased, and opened her business. When she had left the house, Mrs. Merton called Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n 118“Jenny,” she said, “how came you to show that beggar into the parlor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She asked for you,” said Tom, “and you told me to take everybody that asked for you into the parlor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never take such a woman as that in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That comes of taking a girl in from the street,” thought Mrs. Merton. “I wish I hadn’t agreed to take her.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3007/83013.html","bookId":284,"creation":"Aug 1, 2019 8:42:00 AM","modification":"Aug 1, 2019 8:42:00 AM"}
