{"id":8680,"no":5,"title":"CHAPTER IV THE SIEGE.","content":"\u0026nbsp;“Open the door,” screamed granny, beside herself with rage, “or I’ll kill you.” \n\u003cdiv\u003e\n “You can’t get at me,” said Tom, triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman grasped the knob of the door and shook it vigorously. But the lock resisted her efforts. Tom’s spirit was up, and she rather enjoyed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shake away, granny,” she called through the key-hole.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I could only get at you!” muttered granny.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t let you in till you promise not to touch me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll skin you alive.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you can’t come in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman began alternately to pound and kick upon the door. Tom sat down coolly upon a chair, her dark eyes flashing exultingly. She knew 39her power, and meant to keep it. She had not reflected how it was to end. She supposed that in the end she would get a “lickin’,” as she had often done before. But in the mean while she would have the pleasure of defying and keeping the old woman at bay for an indefinite time. So she sat in placid enjoyment in her stronghold until she heard something that suggested a speedy raising of the siege.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m goin’ for a hatchet,” said granny, through the key-hole.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you break the door, you’ll have to pay for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never you mind!” said the old woman. “I know what I’m about.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She heard the retreating steps of granny, and, knowing only too well her terrible temper, made up her mind that she was in earnest. If so, the door must soon succumb. A hatchet would soon accomplish what neither kicks nor pounding had been able to effect.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What shall I do?” thought Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n She was afraid of something more than a lickin’ now. In her rage at having been so long baffled, the old woman might attack her with the hatchet. 40She knew very well that on previous occasions she had flung at her head anything she could lay hold of. Tom, brave and stout-hearted as she was, shrunk from this new danger, and set herself to devise a way of escape. She looked out of the window; but she was on the fourth floor, and it was a long distance to the court below. If it had been on the second floor she would have swung off.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another thing she could do. Granny had gone down below to borrow a hatchet. She might unlock the door, and run out upon the landing; but there was no place for hiding herself, and no way of getting downstairs without running the risk of rushing into granny’s clutches. In her perplexity her eyes fell upon a long coil of rope in one corner. It was a desperate expedient, but she resolved to swing out of the window, high as it was. She managed to fasten one end securely, and let the other drop from the window. As it hung, it fell short of reaching the ground by at least ten feet. But Tom was strong and active, and never hesitated a moment on this account. She was incited to extra speed, for 41she already heard the old woman ascending the stairs, probably provided with a hatchet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom got on the window-sill, and, grasping the rope, let herself down rapidly hand over hand, till she reached the end of the rope. Then she dropped. It was rather hard to her feet, and she fell over. But she quickly recovered herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tim, the recipient of her dinner, was in the court, and surveyed her descent with eyes and mouth wide open.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’d you come from, Tom?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t you see?” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you come downstairs?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “’Cause granny’s there waitin’ to lick me. I must be goin’ before she finds out where I am. Don’t you tell of me, Tim.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I won’t,” said Tim; and he was sure to keep his promise.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom sped through the arched passage to the street, and did not rest till she had got a mile away from the home which had so few attractions for her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Beyond the chance of immediate danger, the young Arab conjured up the vision of granny’s disappointment 42when she should break open the door, and find her gone; and she sat down on the curbstone and laughed heartily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you laughing at?” asked a boy, looking curiously at the strange figure before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it’s too rich!” said Tom, pausing a little, and then breaking out anew.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s too rich?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve run away from granny. She wanted to lick me, and now she can’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve been cutting up, I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it’s granny that’s been cuttin’ up. She’s at it all the time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you’ll catch it when you do go home, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe I won’t go home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not a street-boy that addressed her; but a boy with a comfortable home, who had a place in a store near by. He did not know, practically, what sort of a thing it was to wander about the streets, friendless and homeless; but it struck him vaguely that it must be decidedly uncomfortable. There was something in this strange creature—half boy in 43appearance—that excited his interest and curiosity, and he continued the conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What sort of a woman is your granny, as you call her?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s an awful old woman,” was the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn’t think you would like to speak so of your grandmother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe she is my grandmother. I only call her so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom!” repeated the boy, in surprise. “Aint you a girl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I expect so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s hard to tell from your clothes, you know;” and he scanned Tom’s queer figure attentively.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was sitting on a low step with her knees nearly on a level with her chin, and her hands clasped around them. She had on her cap of the morning, and her jacket, which, by the way, had been given to granny when on a begging expedition, and appropriated to Tom’s use, without special reference to her sex. Tom didn’t care much. It made 44little difference to her whether she was in the fashion or not; and if the street boys chaffed her, she was abundantly able to give them back as good as they sent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter with my clothes?” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve got on a boy’s cap and jacket.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I like it well enough. As long as it keeps a feller warm I don’t mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you call yourself a feller?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you’re a queer feller.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you call me names, ’cause I won’t stand it;” and Tom raised a pair of sharp, black eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t call you names, at least not any bad ones. Have you had any dinner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom, smacking her lips, as she recalled her delicious repast, “I had a square meal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you call a square meal?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Roast beef, cup o’ coffee, and pie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy was rather surprised, for such a dinner seemed beyond Tom’s probable resources.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your granny don’t treat you so badly, after all. That’s just the kind of dinner I had.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 45“Granny didn’t give it to me. I bought it. That’s what she wants to lick me for. All she give me was a piece of hard bread.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you get the money? Was it hers?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what she says. But if a feller works all the mornin’ for some money, hasn’t she got a right to keep some of it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So should I,” said Tom, decidedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got any money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I spent it all for dinner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then here’s some.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy drew from his vest-pocket twenty-five cents, and offered it to Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n The young Arab felt no delicacy in accepting the pecuniary aid thus tendered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said she. “You can call me names if you want to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What should I want to call you names for?” asked the boy, puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was a gent called me names this mornin’, and give me twenty cents for doin’ it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he call you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n 46“I dunno; but it must have been something awful bad, it was so long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re a strange girl, Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Am I? Well, I reckon I am. What’s your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Goodwin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Goodwin?” repeated Tom, by way of fixing it in her memory.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; haven’t you got any other name than Tom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dunno. I think granny called me Jane once. But it’s a good while ago. Everybody calls me Tom, now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Tom, I must be getting back to the store. Good-by. I hope you’ll get along.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Tom. “I’m goin’ into business with that money you give me.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3007/83006.html","bookId":284,"creation":"Aug 1, 2019 8:41:36 AM","modification":"Aug 1, 2019 8:41:36 AM"}
