{"id":8681,"no":6,"title":"CHAPTER V TOM GAINS A VICTORY.","content":"\u0026nbsp;Granny mounted the stairs two at a time; so eager was she to force a surrender on the part of the rebellious Tom. She was a little out of breath when she reached the fourth landing, and paused an instant to recover it. Tom was at that moment half-way down the rope; but this she did not suspect. \n\u003cdiv\u003e\n Recovering her breath, she strode to the door. Before making an assault with the hatchet, she decided to summon Tom to a surrender.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom!” she called out.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course there was no answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don’t you answer?” demanded granny, provoked.\n\u003c/div\u003e \n\u003cdiv\u003e\n She listened for a reply, but Tom remained obstinately silent, as she interpreted it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t speak, it’ll be the wuss for ye,” growled granny.\n\u003c/div\u003e \n\u003cdiv\u003e\n 48Again no answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll find a way to make you speak. Come and open the door, or I’ll break it down. I’ve got a hatchet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the old woman had the conversation all to herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Quite beside herself now with anger, she no longer hesitated; but with all her force dealt a blow which buried the hatchet deep in the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jest wait till I get in!” she muttered. “Will ye open it now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was no response.\n\u003c/div\u003e \n\u003cdiv\u003e\n While she was still battering at the door one of the neighbors came up from below.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doin’, Mrs. Walsh?” for such was granny’s name.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m tryin’ to get in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don’t you open the door?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom’s locked it. She won’t let me in,” said granny, finishing the sentence with a string of profane words which had best be omitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have a good bill to pay to the landlord, Mrs. Walsh.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 49“I don’t care,” said granny. “I’m goin’ to get at that trollop, and beat her within an inch of her life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Another vigorous blow broke the lock, and the door flew open.\n\u003c/div\u003e \n\u003cdiv\u003e\n Granny rushed in, after the manner of a devouring lion ready to pounce upon her prey. But she stopped short in dismay. Tom was not visible!\n\u003c/div\u003e \n\u003cdiv\u003e\n Thinking she might be in the closet, the old woman flung open the door: but again she was balked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What has ’come of the child?” she exclaimed, in bewilderment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She got out of the window,” said the neighbor, who had caught sight of the rope dangling from the open casement.\n\u003c/div\u003e \n\u003cdiv\u003e\n Granny hastened to the window, and the truth flashed upon her. Her prey had escaped her!\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a deep disappointment to the vindictive old woman, whose hand itched to exercise itself in punishing Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s a bold un,” said the neighbor, with some admiration of Tom’s pluck.\n\u003c/div\u003e \n\u003cdiv\u003e\n Granny answered with a strain of invective, which 50gave partial vent to the rage and disappointment she felt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I could only get at her!” she muttered between her teeth; “I’d give her half-a-dozen lickin’s in one. She’d wish she hadn’t done it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Not a doubt entered granny’s mind that Tom would return. It never occurred to her that her young servant had become tired of her bondage, and had already made up her mind to break her chains. She knew Tom pretty well, but not wholly. She did not realize that the days of her rule were at an end; and that by her tyranny she had driven from her the girl whose earnings she had found so convenient.\n\u003c/div\u003e \n\u003cdiv\u003e\n If there had been much chance of meeting Tom outside, granny would have gone out into the streets and hunted for her. But to search for her among the numerous streets, lanes, and alleys in the lower part of the city would have been like trying to find a needle in a haystack. Then, even if she found her, she could not very well whip her in the street. Tom would probably come home at night as usual, bringing money, and she could defer the punishment till then.\n\u003c/div\u003e \n\u003cdiv\u003e\n 51Fatigued with her exercise and excitement, the old woman threw herself down on her rude pallet, first drawing the contents of a jug which stood in the closet, and was soon in a drunken sleep. Leaving her thus, we go back to Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n She had made up her mind not to go back to sweeping the streets; partly, indeed, because she no longer had her broom with her. Moreover, she thought that she would in that case be more likely to fall into the clutches of the enemy she so much dreaded. With the capital for which she was indebted to her new boy acquaintance she decided to lay in a supply of evening papers, and try to dispose of them. It was not a new trade to her; for there was scarcely one of the street trades in which the young Arab had not more or less experience.\n\u003c/div\u003e \n\u003cdiv\u003e\n She bought ten copies of the “Express,” and selected the corner of two streets for the disposal of her stock in trade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here’s the ‘Express,’—latest news from the seat of war!” cried Tom; catching the cry from a boy engaged in the same business up on Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n 52“What’s the news?” asked one of two young men who were passing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The news is that you’re drafted,” said Tom, promptly. “Buy the paper, and you’ll find out all about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in the midst of the draft excitement in New York; and as it so happened that the young man had actually been drafted, his companion laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must buy a paper for that, Jack,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe I will,” said the first, laughing. “Here’s ten cents. Never mind about the change.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Tom. “Come round to-morrow, and I’ll sell you another.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have me drafted again, I am afraid. Perhaps you will go as my substitute?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would if I was old enough,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re a girl,—aint you? Girls can’t fight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Try me and see,” said Tom. “I can fight any boy of my size.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two young men passed on, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom soon had an opportunity to test her prowess. The corner where she had stationed herself was 53usually occupied by a boy somewhat larger than Tom, who considered that it belonged to him by right. He came up rather late, having a chance to carry a carpet-bag for a guest at French’s Hotel to the Hudson River station. Tom had disposed of half her papers when he came blustering up:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Clear out of here!” he said, imperiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who was you speakin’ to?” asked Tom, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To you. Just clear out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for?” asked Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve got my stand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have I?” said Tom, not offering to move.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’m goin’ to keep it. ’Ere’s the ‘Express,’—latest news from the seat of war.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here!” said the newsboy, menacingly, “if you don’t clear out, I’ll make you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you?” said Tom, independently, taking his measure, and deciding that she could fight him. “I aint afraid of you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Her rival advanced, and gave her a push which nearly thrust her from the sidewalk into the street. 54But he was rather astonished the next moment at receiving a blow in the face from Tom’s fist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you want to fight, come on!” said Tom, dropping her papers and squaring off.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not slow in accepting the defiance, being provoked by the unexpected blow, and aimed a blow at Tom’s nose. But Tom, who had some rudimental ideas of boxing, while her opponent knew nothing of it, fended off the blow, and succeeded in getting in another.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ho! ho!” laughed another boy, who had just come up; “you’re licked by a gal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob, for this was the newsboy’s name, felt all the disgrace of the situation. His face reddened, and he pitched in promiscuously, delivering blow after blow wildly. This gave a decided advantage to Tom, who inflicted considerably more damage than she received.\n\u003c/div\u003e \n\u003cdiv\u003e\n The fight would have gone on longer if a gentleman had not come up, and spoken authoritatively: “What is all this fighting about? Are you not ashamed to fight with a girl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n 55“No, I aint,” said Bob, sullenly. “She took my place, and wouldn’t give it up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that true?” turning to Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got as much right to it as he,” said Tom. “I’ll give it to him if I am a gal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you know it is wrong to fight?” asked the gentleman, this time addressing Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t,” said Tom. “Wouldn’t you fight if a feller pitched into you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was rather an embarrassing question, but the gentleman said, “It would be better to go away than to get into a fight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He fit me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is bad enough for boys to fight, but it is worse for girls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t see it,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n Had Tom been in a higher social position, it might have been suggested to her that to fight was not ladylike; but there was such an incongruity between Tom’s appearance and anything lady-like, that such an appeal would have been out of place. The fact is, Tom claimed no immunity or privilege on the score of sex, but regarded herself, to all intents and purposes, 56as a boy, and strongly wished that she were one.\n\u003c/div\u003e \n\u003cdiv\u003e\n The gentleman looked at her, rather puzzled, and walked away, satisfied with having stopped the fight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob did not seem inclined to renew hostilities, but crossed the street, and took his stand there. Tom, by right of conquest, held her place until she had sold out her whole stock of papers.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3007/83007.html","bookId":284,"creation":"Aug 1, 2019 8:41:39 AM","modification":"Aug 1, 2019 8:41:39 AM"}
