{"id":82424,"no":35,"title":"Page 35","content":"\u003cp\u003eI brought my knee straight up, tearing from Don’s grasp when he grunted and released me. Running to the door, I heard Erin’s cheerleader-voice rising over everyone else’s. She bounded across the room to hug me when I reached the safety zone, and over her shoulder, I watched Lucas’s expression. He’d removed his headgear and combed his sweaty hair back, so I could clearly see his face, and the familiar barely-there smile.\u003c/p\u003e\n\u003cp\u003eLucas: You did well this morning.\u003c/p\u003e\n\u003cp\u003eMe: Yeah?\u003c/p\u003e\n\u003cp\u003eLucas: Yeah\u003c/p\u003e\n\u003cp\u003eMe: Thanks\u003c/p\u003e\n\u003cp\u003eLucas: Coffee sunday? Pick you up around 3?\u003c/p\u003e\n\u003cp\u003eMe: Sure :)\u003c/p\u003e\n\u003cp\u003eSaturday night’s performance demanded my full attention, distracting me until I was in my room. Erin hadn’t returned from yet another sorority gathering, but was due back soon. The entire dorm was wide awake, studying for—or freaking out about—finals, enjoying the last full weekend before break, or well past ready to go home. The voices in the hall alternated between pre-finals tension and pre-holiday excitement.\u003c/p\u003e\n\u003cp\u003eA deep-toned bass line seeped through the wall opposite my bed, and my fingers moved with it. Occasionally, the fact that I played the bass would come up with strangers, who typically imagined an electric instrument and a garage band. Lucas looked more suited to that part than I did—dark hair falling into his eyes, small silver ring following the full curve of his bottom lip, not to mention the tattoos and lean, defined muscle that would look so hot onstage, peeking from a thin t-shirt. Or no t-shirt.\u003c/p\u003e\n\u003cp\u003eOh, God. Never. Getting. To. Sleep.\u003c/p\u003e\n\u003cp\u003eMy phone beeped and displayed a message from Erin.\u003c/p\u003e\n\u003cp\u003eErin: Talking to Chaz. May be late. You ok?\u003c/p\u003e\n\u003cp\u003eMe: I’m good. YOU ok?\u003c/p\u003e\n\u003cp\u003eErin: Confused. Maybe I’d feel better if I just kicked him.\u003c/p\u003e\n\u003cp\u003eMe: NUTSACK!!!!!!!!!\u003c/p\u003e\n\u003cp\u003eErin: Exactly.\u003c/p\u003e\n\u003cp\u003e“Those people are crazy.” Knees pulled to my chest, I cuddled close to Lucas as he sketched a couple of kayaks out on the lake. “It’s got to be even colder out there on the water than it is sitting here.”\u003c/p\u003e\n\u003cp\u003eHe smiled and reached behind me to pull my coat’s hood up over the wool and cashmere scarf and hat I was wearing. “You think this is cold?” He crooked an eyebrow at me.\u003c/p\u003e\n\u003cp\u003eI scowled and touched my gloved fingers to my nose, which had the anesthetized feeling that comes from a shot at the dentist, right before they drill a tooth. “My nose is numb! How dare you scoff at my sensitivity to ice-age temperatures. And I thought you were from the coast. Isn’t it warmer there?”\u003c/p\u003e\n\u003cp\u003eChuckling, he stuck his pencil above his ear, under his cap, closed the sketchpad and laid it on the bench. “Yeah, it’s definitely warmer on the coast, but that’s not where I grew up. I’m not sure you could survive a winter in Alexandria if you’re this much of a candy-ass.”\u003c/p\u003e\n\u003cp\u003eI gasped in pretend outrage, punching him in the shoulder while he feigned being unable to block the blow.\u003c/p\u003e\n\u003cp\u003e“Ow, jeez—I take it back! You’re tough as nails.” He turned and slid his arm around me, rewarding me with that full smile. “Total badass.”\u003c/p\u003e\n\u003cp\u003eBetween his proximity in the physical sense, and his embrace in the emotional sense, I hummed happily and cuddled closer, closing my eyes. “I throw a mean hammer-fist,” I mumbled into his hoodie. His leather jacket lay folded on the bench next to the sketchbook. He’d insisted it wasn’t cold enough to need it, except on the motorcycle.\u003c/p\u003e\n\u003cp\u003eHe echoed my hum, tipping my head back with an ungloved, curiously unfrozen finger. “You do. I’m actually a little scared of you.”\u003c/p\u003e\n\u003cp\u003eOur faces were inches apart, his breath mingling with mine in one evaporative cloud between us. “I don’t want you to be scared of me.” The words I couldn’t bring myself to add swirled through my mind: talk to me, talk to me. Barring that, I wanted him to kiss me so I wouldn’t feel the guilt escalate, threatening to spill out in one irrevocable confession. As if I’d made that request aloud, he lowered his head and kissed me softly.\u003c/p\u003e\n\u003cp\u003eChapter 24\u003c/p\u003e\n\u003cp\u003eMost people would take off as soon as they handed in the last final. Erin was leaving on Saturday, but I was staying because my favorite middle school student had invited me to his concert Monday night—he’d made first chair, and wanted to show off. We were required to vacate the dorms for winter break by Tuesday, so I would be going home that day, whether I wanted to or not.\u003c/p\u003e\n\u003cp\u003eMaggie, Erin and I met in the library to study for our last astronomy exam of the semester. Around 2 am, Maggie flopped face-down onto her open textbook with a dramatic sigh. “Uuuuugh… If we don’t take a break from this shit, my brain is going to be a black hole.”\u003c/p\u003e\n\u003cp\u003eErin said nothing, and when I looked at her, she was checking her phone, scrolling through a text, and then replying. She hit send and noticed I was looking at her.\u003c/p\u003e\n\u003cp\u003e“Huh?” Her brown eyes were a little wide. “Um, Chaz was just letting me know the guys are taking turns keeping an eye on Buck. Making sure he doesn’t leave the house.”\u003c/p\u003e\n\u003cp\u003e“I thought we weren’t talking to Chaz,” Maggie mumbled sleepily—eyes closed, cheek pressed to the page we were reviewing.\u003c/p\u003e\n\u003cp\u003eErin’s eyes landed anywhere but mine, and I knew she’d abandoned that plan. I decided to let her fidget a little longer before I let her off the hook. I’d always liked Chaz and could only fault him so much. I wouldn’t want to believe my best friend was a monster, either.\u003c/p\u003e\n\u003cp\u003eChecking my phone, I reread the texts I’d sent Lucas earlier, and his replies.\u003c/p\u003e\n\u003cp\u003eMe: Econ final: PWNED\u003c/p\u003e\n\u003cp\u003eLucas: All because of me, right?\u003c/p\u003e\n\u003cp\u003eMe: No, because of that Landon guy.\u003c/p\u003e\n\u003cp\u003eLucas: ;)\u003c/p\u003e\n\u003cp\u003eMe: My brain hurts. I have three more exams.\u003c/p\u003e\n\u003cp\u003eLucas: One more for me, friday. Then work. See you saturday.\u003c/p\u003e\n\u003cp\u003e“Mindi’s last final is tomorrow.” Erin doodled a design around an equation in her notebook.\u003c/p\u003e\n\u003cp\u003e“I heard her dad is sitting in the hall during all of her finals,” Maggie said.\u003c/p\u003e\n\u003cp\u003eI’d heard the same rumor. “I can’t blame him, if that’s true.”\u003c/p\u003e\n\u003cp\u003eWe watched Erin, who knew the truth between fact and campus gossip. She nodded. “He is. And she’s not coming back, except to testify. She’s transferring to some small community college back home.” The regret in her eyes was bottomless. “Her mom said she’s still having nightmares every night. I can’t believe I just left her there.”\u003c/p\u003e\n\u003cp\u003eMaggie sat up. “Hey. We left a lot of people there. It wasn’t our fault, Erin.”\u003c/p\u003e\n\u003cp\u003e“I know, but—”\u003c/p\u003e\n\u003cp\u003e“She’s right.” I made Erin look at me. “Put the fault where it goes. On him.”\u003c/p\u003e\n\u003cp\u003eI finally told my parents about Buck. I hadn’t talked to them since before Thanksgiving. Due to something left out of order in the pantry, Mom figured out that I’d been home, and called me. I guess she wanted to make sure a stranger hadn’t broken into the house and un-alphabetized her grains and condiments, so I had to fess up.\u003c/p\u003e\n\u003cp\u003e“But… you told me you were going to Erin’s?”\u003c/p\u003e\n\u003cp\u003eInstead of telling her that she’d come to that conclusion by herself—that I’d only mentioned Erin once, that she’d never bothered to verify what I was actually doing over Thanksgiving break—I lied. It was easier for both of us that way.\u003c/p\u003e\n\u003cp\u003e“Coming home was a last-minute decision. No big deal.”\u003c/p\u003e\n\u003cp\u003eShe started jabbering about the things we needed to do over the break—I was due for a dental appointment, and my truck’s registration would expire in January. “Do you need an appointment with Kevin, or have you found a stylist there?” she asked.\u003c/p\u003e\n\u003cp\u003eInstead of answering her question, I blurted it all out—Buck’s assault in the parking lot, Lucas saving me, Buck raping another girl, the charges we were pressing, the upcoming criminal case. There was no stopping it, once it started.\u003c/p\u003e\n\u003cp\u003eAt first I thought she hadn’t heard me, and I gripped my phone, thinking I’m not repeating all of that, if she’s too damned busy decorating for her party to listen to me for ten seconds.\u003c/p\u003e\n\u003cp\u003eAnd then she choked out, “Why didn’t you tell me?”\u003c/p\u003e\n\u003cp\u003eShe knew why, I think. I didn’t need to say it. They hadn’t been the best parents; they hadn’t been the worst, either.\u003c/p\u003e\n\u003cp\u003eI sighed. “I’m telling you now.”\u003c/p\u003e\n\u003cp\u003eShe was silent for another strained moment, but I heard her moving through the house. They were hosting their annual catered holiday party on Saturday, and I knew how control-freak and anal Mom was about the house being perfect for that. Growing up, I’d learned to make myself scarce during the entire week leading up to that party.\u003c/p\u003e\n\u003cp\u003e“I’m calling Marty right now to tell him I’m not coming in tomorrow.” Marty was Mom’s boss at her software consulting firm. “I can be there by eleven.” I recognized the sound of her dragging her wheeled suitcase out from the closet under the stairs.\u003c/p\u003e\n\u003cp\u003eI gaped into the phone for a moment before sputtering to life. “No—no, Mom, I’m fine. I’ll be home in less than a week.”\u003c/p\u003e\n\u003cp\u003eHer voice shook when she answered, shocking me further. “I’m so sorry, Jacqueline.” She said my name as though she was trying to find some way to touch me through the phone. “I’m so sorry this happened to you.” My God, I thought, she’s crying? My mother wasn’t a crier. “And I’m sorry I wasn’t here for you when you came home. You needed me and I wasn’t here.”\u003c/p\u003e\n\u003cp\u003eAlone in my room, I sat on my bed, dazed. “It’s okay, Mom. It’s not like you knew.” She’d known about my breakup with Kennedy… but I was ready to let that go, too. “You raised me to be strong, right? I’m good.” I realized as I said it that it was true.\u003c/p\u003e\n\u003cp\u003e“Can I—can I set up an appointment for you, with my therapist? Or one of her partners, if you’d rather?”\u003c/p\u003e\n\u003cp\u003eI’d forgotten Mom’s occasional therapy sessions. She’d been diagnosed with an eating disorder when I was really young. I didn’t even know what it was—bulimia, anorexia? We’d never really talked about it.\u003c/p\u003e\n\u003cp\u003e“Sure. That would be good.”\u003c/p\u003e\n\u003cp\u003eShe sighed, and I thought I heard relief. I’d given her something to do.\u003c/p\u003e\n\u003cp\u003eAfter we finished several cartons of Chinese takeout and a conversation about how we chose our respective majors, Lucas fished his iPod from his front pocket and handed me the earbuds. “I want you to hear this band I just found. You might like them.” We were sitting on the floor with our backs to my bed. Once I was plugged in, he pushed play, watching me as I listened.\u003c/p\u003e\n\u003cp\u003eHis eyes locked with mine as the music swelled in my ears. I couldn’t hear anything outside of it, couldn’t see anything but his eyes on me. He leaned closer and I inhaled the soothing scent of him. Cupping my face in his hand, he moved his mouth to mine, kissing me at a leisurely pace that somehow matched the rhythm of the song. He tasted like the wintergreen Tic Tacs he’d been sucking on.\u003c/p\u003e\n\u003cp\u003eHanding me the iPod, he picked me up, deposited me on the bed and lay next to me, drawing me into his arms and kissing me until the first song bled into the next, and the next. When he pulled back to trace a finger over the edge of my ear, I removed an earbud and handed it to him. We lay side-by-side on my narrow dorm bed—the length of which only just accommodated the length of his body comfortably—listening together, immersed. He opened a new playlist, and I knew that the song he chose was something for me—beyond a band he wanted to share, or something for us to discuss musically. \u003c/p\u003e","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-35.html","bookId":2743,"creation":"Oct 5, 2019 4:44:59 PM","modification":"Oct 5, 2019 4:44:59 PM"}
