{"id":82429,"no":40,"title":"Page 40","content":"\u003cp\u003eHe cupped my face in his palm and stared into my eyes, sighing. “First, this is a great job, and I’m excited about it.” When he tugged me closer and kissed me, I leaned across his chest, one hand slipping under his t-shirt. I forgot that he hadn’t finished his explanation until he whispered into my mouth, “Second, I’m ambitious, but I can succeed almost anywhere.” Standing, he continued kissing me as he carried me into his room. When he let me slide from his arms to the floor, I yanked my tank top off, scooting into the center of the bed and watching him pull his t-shirt over his head. I could put him on replay doing that and watch it all day… if I didn’t know what was coming next.\u003c/p\u003e\n\u003cp\u003eCrawling up from the foot of the bed, he lay over me slowly, dragging both of my arms above my head, gently, as he had the very first time he sketched me. With one hand, he crossed and secured my wrists. He’d taught me every possible way to escape this hold, but there was no way I wanted to get away. He was in a slow-motion mood—one of my favorites, though it meant I’d be driven crazy before we were done. I chewed the edge of my lip in anticipation.\u003c/p\u003e\n\u003cp\u003eHe stared down at me, and I examined his beautiful eyes up close, something I’d never tire of doing. “What I can’t do anywhere is be with you.” Leaning closer, he ran his tongue over my lips and his fingertips over my skin until I arched up and captured his mouth with mine.\u003c/p\u003e\n\u003cp\u003eHe released my wrists, and I wrapped my arms around his neck, feeling our hearts beat in sync as lips followed a meandering path from my ear down. “Choosing to be with you isn’t a difficult decision, Jacqueline,” he breathed, pulling back one final time to stare into my eyes. “It’s easy. Incredibly easy.”\u003c/p\u003e","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-40.html","bookId":2743,"creation":"Oct 5, 2019 4:44:59 PM","modification":"Oct 5, 2019 4:44:59 PM"}
