{"id":11272,"no":1,"title":"A LITTLE COLORED BOY.","content":"\u0026nbsp;“YOU can’t help thinking when you listen to that boy,” said Mrs. Warner, “that the Lord must want him in heaven. He has such a heavenly voice.” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think it more likely that God put an angel’s voice in Neddy’s throat to give us a taste of heavenly music,” said grandma, looking up from the apples she was paring.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bosh! you women folks are so everlastingly simple and silly that you encourage the boy in his mischief;” and Farmer Warner set down the milk pail with such a thud that the milk slopped over into the sauce his wife was dishing for supper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, Henry, you have ruined that dish of apple sauce,” expostulated Mrs. Warner; “and they’re the first apples of the season, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind,” said grandma, “we’ll find something else. Just call the boy to supper, Henry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed I won’t call him,” he sputtered. “For the past hour I’ve been calling him to help with the chores, and I’ll call no more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then, in sweet, rich tones, came in the melody—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “O, there is rest, O, there is rest,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yes, there is rest for my soul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And your body, too,” growled Mr. Warner. “If you women had the trials I have with Ned, you would not set so much store by him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t deny that he’s trying, Henry; but when one is weary and fretted with a long, hot day’s work, it is the most soothing thing in the world to hear the child singing in the twilight about rest for his soul. It rests me way to my toes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would rest me a heap more if he did his work. Now, you see when I called him to help he was singing about rest, but supper being ready, he comes along without being called even.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bare feet came pattering along the porch and a little black face peeped in the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you call me, Mis’ser Warner?” The farmer grunted and drew up to the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Henry called you a long time ago, Neddy; why did you not come?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I camed jes’ as soon as I heerd him, ’deed I did. I only stopped to pick these fur you,” and he placed his hat on the table lined with leaves and filled to the brim with luscious blackberries; then he laid a great bunch of wild flowers beside them. Mrs. Warner buried her face in the fragrant flowers. How long it was since anyone had brought her flowers! Henry used to keep her supplied; but he was too busy now.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Deary me,” said grandma; “these will just take the place of the apple sauce;” and she began to pick over the berries.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned sat at a side table and did full justice to an ample supper. When Mr. Warner called for pie his wife gave him half of one, and, notwithstanding his frown, gave the other half to Ned. After supper they both went out, but Ned soon returned and began helping clear the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Henry may need you, Ned,” said Mrs. Warner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No’m, he don’t; he tole me to clear out. You put some flowers on your dress an’ go out an’ get some air. I’ll clean up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a great temptation, and Mrs. Warner walked through the fields to a neighbor’s, while Ned warbled over the dishes and her husband finished the chores.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few months before this a lady from the South had brought Ned to sing in the church, and had told how anxious she was to get a home for him with Christian people who would educate him. Mrs. Warner’s heart had softened at once, and her husband was nothing loath to have a little helper and do God service at the same time. But they had not found it an easy task to train Ned up in the way he should go. A sweet-tempered little singing bird was he, as neat as a pin and as quick as a wink, but having no more idea of responsibilities than the little warblers he imitated in his throat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his kind thoughtfulness for others gave Mrs. Warner courage to keep on with him, and, as soon as she had, with very gentle teaching, made him to understand that promptness was the one thing required by Mr. Warner, and that the lack of it often caused serious inconvenience, the little fellow began to mend his ways.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was hard for him to understand at first. The fact that a thing would give pleasure to some one seemed reason enough for its being done at once. In fact, some of the unpleasant things seemed to him hardly worth the doing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Mrs. Warner was very patient, and the heart that beat under the dark skin was very loving and sweet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I see it now,” he said one day, as he dropped the first sweet harvest apple into grandma’s lap. “It took a good while, but I understand. If you are told to do a thing, you must do it. Then, if there’s any time left, or, if you can crowd the pleasant thing in along with it, all right. But sometimes it’s powerful hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s the sky. I s’pose he’d like to smile all the time and be bright and jolly. But sometimes God tells him to rain, and he just goes and does it, like a major.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t use to seem ’s if I was selfish if I kept the cows waiting while I picked some wild flowers for Mrs. Warner. But I really suppose it was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dear little Ned! God bless him!\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2794/77304.html","bookId":1289,"creation":"Aug 2, 2019 3:47:52 AM","modification":"Aug 2, 2019 3:47:52 AM"}
