{"id":11299,"no":28,"title":"THE FLOWERS AND THE WATER DROPS.","content":"\u0026nbsp;DOWN in an earth garden were some flowers all drooping and sad. Father Sun saw them, and calling his little children, the sunbeams, to him, said, “To-day, my little helpers, I need you to do some work for me. Go down to the big, round earth far below, and bring back to the sky country all the water dust that you can carry.” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little sunbeams started, and although it was a long, long journey, they were so bright and merry that it seemed like play to them. By and by they drew near to Mother Earth, and before long saw myriads of tiny drops of water, some taking hold of hands forming part of the great ocean, others rushing along in a strong, deep river, while some were dancing and tumbling in a merry little brook, singing sweet songs. But how could the sunbeams coax the water drops to come up into the sky country? Surely the ocean, or the river, or even the little laughing brooks could not be carried up so high!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the little workers were not a bit discouraged, and they began at once to shake the water drops apart. The little particles of water no sooner felt the sunbeams shaking them than they said to each other, “Come, now for a long ride.” And sure enough, up, up, up they sailed in the boats of air, helped on by the sunbeams. But as they rose higher in the air suddenly they began to shiver, for just then Mr. North Wind came rushing along. How the poor little vapor mass shook, and then suddenly began once more to form into drops! And some little children, far down on the earth below, looked up at the sky and exclaimed, “See the dark clouds up there!” while their mamma said, “It is going to rain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a few minutes the little drops felt as if they were being pulled back to earth, and starting from the cloud which was holding them, they said to one another, “Now for a race!” And soon, patter, patter, patter, came the sound of the rain, and the little drops once more were back in their earth home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah! how the flowers lifted their drooping heads and smiled then. If you had been very close, you might almost have heard them sing, “God is good! God is good!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2794/77331.html","bookId":1289,"creation":"Aug 2, 2019 3:48:55 AM","modification":"Aug 2, 2019 3:48:55 AM"}
