{"id":97081,"no":6,"title":"Page 6","content":"\u003cp\u003eThat was close enough, so I said yes. I told him I\u0027d call him in a day or two. I already had his office number in Utica, and he gave me his home number as well. \"But please try to call me at the office,\" he said.\u003c/p\u003e\n\u003cp\u003eBURGHASH Antiques Imports was on University Place between Eleventh and Twelfth. I stood in one aisle surrounded by the residue of half the attics in Western Europe. I was looking at a clock just like the one I had seen on Gordon Kalish\u0027s wall. It was priced at $225.\u003c/p\u003e\n\u003cp\u003e\"Are you interested in clocks? That\u0027s a good one.\"\u003c/p\u003e\n\u003cp\u003e\"Does it keep time?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, those pendulum clocks are indestructible. And they\u0027re extraordinarily accurate. You just raise or lower the weight to make them run faster or slower. The case of the one you\u0027re looking at is in particularly good condition. It\u0027s not a rare model, of course, but they\u0027re hard to find in such nice shape. The price might be somewhat negotiable if you\u0027re really interested.\"\u003c/p\u003e\n\u003cp\u003eI turned to take a good look at him. He was in his middle or late twenties, a trim young man wearing flannel slacks and a powder-blue turtleneck sweater. His hair had been expensively styled. His sideburns were even with the bottoms of his earlobes. He had a very precise moustache.\u003c/p\u003e\n\u003cp\u003eI said, \"Actually, I\u0027m not interested in clocks. I wanted to talk to someone about a boy who used to work here.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you must mean Richie! You\u0027re a policeman? Wasn\u0027t it the most unbelievable thing?\"\u003c/p\u003e\n\u003cp\u003e\"Did you know him well?\"\u003c/p\u003e\n\u003cp\u003e\"I hardly knew him at all. I\u0027ve only been here since just before Thanksgiving. I used to work at the auction gallery down the block, but it was terribly hectic.\"\u003c/p\u003e\n\u003cp\u003e\"How long had Richie worked here?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t honestly know. Mr. Burghash could tell you. He\u0027s in back in the office. It has been pure hell for all of us since that happened. I still can\u0027t believe it.\"\u003c/p\u003e\n\u003cp\u003e\"Were you working here the day it happened?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I saw him that morning. Thursday morning. Then I was on a delivery all afternoon, a load of perfectly hideous French country furniture for an equally hideous split-level chateau in Syosset. That\u0027s on Long Island.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I didn\u0027t. I lived all these many years in blissful ignorance that there even was a place known as Syosset.\" He remembered the gravity of what we were talking about, and his face turned serious again. \"I got back here at five, just in time to help close up shop. Richie had left early. Of course by then it had all happened, hadn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"The murder took place around four.\"\u003c/p\u003e\n\u003cp\u003e\"While I was fighting traffic on the Long Island Expressway.\" He shivered theatrically. \"I had no idea until I caught the eleven o\u0027clock news that night. And I couldn\u0027t believe it was our Richard Vanderpoel, but they mentioned the name of the firm and-\" He sighed and let his hands drop to his sides. \"One never knows,\" he said.\u003c/p\u003e\n\u003cp\u003e\"What was he like?\"\u003c/p\u003e\n\u003cp\u003e\"I hardly had time to know him. He was pleasant, he was courteous, he was anxious to please. He didn\u0027t have a great knowledge of antiques, but he had a good sense of them if you know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know he was living with a girl?\"\u003c/p\u003e\n\u003cp\u003e\"How would I have known that?\"\u003c/p\u003e\n\u003cp\u003e\"He might have mentioned it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, he didn\u0027t. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Does it surprise you that he was living with a girl?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure I never thought about it one way or the other.\"\u003c/p\u003e\n\u003cp\u003e\"Was he homosexual?\"\u003c/p\u003e\n\u003cp\u003e\"How on earth would I know?\"\u003c/p\u003e\n\u003cp\u003eI stepped closer to him. He backed away without moving his feet. I said, \"Why don\u0027t you cut the shit.\"\u003c/p\u003e\n\u003cp\u003e\"Pardon me?\"\u003c/p\u003e\n\u003cp\u003e\"Was Richie gay?\"\u003c/p\u003e\n\u003cp\u003e\"I certainly had no interest in him myself. And I never saw him with another man, and he never seemed to be cruising anyone.\"\u003c/p\u003e\n\u003cp\u003e\"Did you think he was gay?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I always assumed it, for heaven\u0027s sake. He certainly seemed gay.\"\u003c/p\u003e\n\u003cp\u003eI found Burghash in the office. He was a little man with a furrowed brow that went almost to the top of his head. He had a ragged moustache and two days\u0027 worth of beard. He told me he\u0027d had cops and newspapermen coming out of his ears and he had a business to run. I told him I wouldn\u0027t take much of his time.\u003c/p\u003e\n\u003cp\u003e\"I have a few questions,\" I said. \"Let\u0027s go back to Thursday, the day of the murder. Did Richie behave differently than usual?\"\u003c/p\u003e\n\u003cp\u003e\"Not really.\"\u003c/p\u003e\n\u003cp\u003e\"He wasn\u0027t agitated or anything like that?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"He went home early.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. He didn\u0027t feel well when he came back from lunch. He had some curry at the Indian place around the corner, and it didn\u0027t agree with him. I was always telling him to stay with bland food, ordinary American food. He had a sensitive digestive system, and he was always trying exotic foods that didn\u0027t agree with him.\"\u003c/p\u003e\n\u003cp\u003e\"What time did he leave here?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t keep track. He came back from lunch feeling lousy. I told him right away to take the rest of the day off. You can\u0027t work with your guts on fire. He wanted to tough it out, though. He was an ambitious kid, a hard worker. Sometimes he\u0027d have indigestion like that, and then an hour later he\u0027d be all right again, but this time it got worse instead of better, and I finally told him to get the hell out and go home. He must have left here, oh, I don\u0027t know. Three? Three thirty? Something like that.\"\u003c/p\u003e\n\u003cp\u003e\"How long had he been working for you?\"\u003c/p\u003e\n\u003cp\u003e\"Just about a year and a half. He went to work for me a year ago last July.\"\u003c/p\u003e\n\u003cp\u003e\"He moved in with Wendy Hanniford the following December. Did you have a previous address for him?\"\u003c/p\u003e\n\u003cp\u003e\"The YMCA on Twenty-third Street. That\u0027s where he was living when he came to work for me. Then he moved a few times. I don\u0027t have the addresses, and then I guess it was in December when he moved to Bethune Street.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know anything about Wendy Hanniford?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Never met her. Never knew her name.\"\u003c/p\u003e\n\u003cp\u003e\"You knew he was rooming with a girl?\"\u003c/p\u003e\n\u003cp\u003e\"I knew he said he was.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003eBurghash shrugged. \"I figured he was rooming with somebody, and if he wanted me to think it was a girl, I was willing to go along with it.\"\u003c/p\u003e\n\u003cp\u003e\"You thought he was homosexual.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. It\u0027s not exactly unheard of in this business. I don\u0027t care if my employees go to bed with orangutans. What they do on their own time is their own business.\"\u003c/p\u003e\n\u003cp\u003e\"Did he have any friends that you knew of?\"\u003c/p\u003e\n\u003cp\u003e\"Not that I knew of, no. He kept to himself most of the time.\"\u003c/p\u003e\n\u003cp\u003e\"And he was a good worker.\"\u003c/p\u003e\n\u003cp\u003e\"Very good. Very conscientious, and he had a feeling for the business.\" He fixed his eyes on the ceiling. \"I sensed that he had personal problems. He never talked about them, but he was, oh, how shall I put it? High-strung.\"\u003c/p\u003e\n\u003cp\u003e\"Nervous? Touchy?\"\u003c/p\u003e\n\u003cp\u003e\"No, not that, exactly. High-strung is the best adjective I can think of to describe him. You sensed that he had things weighing him down, keying him up. But you know, that was more noticeable when he first started here. For the past year he seemed more settled, as if he had managed to come to terms with himself.\"\u003c/p\u003e\n\u003cp\u003e\"The past year. Since he moved in with the Hanniford girl, in other words.\"\u003c/p\u003e\n\u003cp\u003e\"I hadn\u0027t thought of it that way, but I guess that\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"You were surprised when he killed her.\"\u003c/p\u003e\n\u003cp\u003e\"I was astonished. I simply could not believe it. And I\u0027m still astonished. You see someone five days a week for a year and a half, and you think you know them. Then you find out you don\u0027t know them at all.\"\u003c/p\u003e\n\u003cp\u003eOn my way out the young man in the turtleneck stopped me. He asked me if I had learned anything useful. I told him I didn\u0027t know.\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s all over,\" he said. \"Isn\u0027t it? They\u0027re both dead.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s the point in poking around in corners?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea,\" I said. \"Why do you suppose he was living with her?\"\u003c/p\u003e\n\u003cp\u003e\"Why does anybody live with anybody else?\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s assume he was gay. Why would he live with a woman?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he got tired of dusting and cleaning. Sick of doing his own laundry.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know that she was that domestic. It seems likely that she was a prostitute.\"\u003c/p\u003e\n\u003cp\u003e\"So I understand.\"\u003c/p\u003e\n\u003cp\u003e\"Why would a homosexual live with a prostitute?\"\u003c/p\u003e\n\u003cp\u003e\"Gawd, I don\u0027t know. Maybe she let him take care of her overflow. Maybe he was a closet heterosexual. For my own part, I\u0027d never live with anyone, male or female. I have trouble enough living with myself.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t argue with that. I started toward the door, then turned around again. There were too many things that didn\u0027t fit together, and they were scraping against each other like chalk on a blackboard. \"I just want to make sense out of this,\" I said, to myself as much as to him. \"Why in hell would he kill her? He raped her and he killed her. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Well, he was a minister\u0027s son.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all crazy,\" he said. \"Aren\u0027t they?\"\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003eThe Reverend Martin Vanderpoel didn\u0027t want to see me. \"I have spoken with enough reporters,\" he told me. \"I can spare no time for you, Mr. Scudder. I have my responsibilities to my congregation. What time remains, I feel the need to devote to prayer and meditation.\"\u003c/p\u003e\n\u003cp\u003eI knew the feeling. I explained that I wasn\u0027t a reporter, that I was representing Cole Hanniford, the father of the murdered girl.\u003c/p\u003e\n\u003cp\u003e\"I see,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t need much of your time, Reverend Vanderpoel. Mr. Hanniford has suffered a loss, even as you have. In a sense, he lost his daughter before she was killed. Now he wants to learn more about her.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d be a poor source of information, I\u0027m afraid.\"\u003c/p\u003e\n\u003cp\u003e\"He told me he wanted to see you himself, sir.\"\u003c/p\u003e\n\u003cp\u003eThere was a long pause. I thought for a moment that the phone had gone dead. Then he said, \"It is a difficult request to refuse. I will be occupied with church affairs this afternoon, I\u0027m afraid. Perhaps this evening?\"\u003c/p\u003e\n\u003cp\u003e\"This evening would be fine.\"\u003c/p\u003e\n\u003cp\u003e\"You have the address of the church? The rectory is adjacent to it. I will be waiting for you at-shall we say eight o\u0027clock?\"\u003c/p\u003e\n\u003cp\u003eI said eight would be fine. I found another dime and looked up another number and made a call, and the man I spoke to was a good deal less reticent to talk about Richard Vanderpoel. In fact he seemed relieved that I\u0027d called him and told me to come right on up.\u003c/p\u003e\n\u003cp\u003eHIS name was George Topakian, and he and his brother constituted Topakian and Topakian, Attorneys-at-Law. His office was on Madison Avenue in the low Forties. Framed diplomas on the wall testified that he had graduated from City College twenty-two years ago and had then gone on to Fordham Law.\u003c/p\u003e\n\u003cp\u003eHe was a small man, trimly built, dark complected. He seated me in a red leather tub chair and asked me if I wanted coffee. I said coffee would be fine. He buzzed his secretary on the intercom and had her bring a cup for each of us. While she was doing this, he told me he and his brother had a general practice with an emphasis on estate work. The only criminal cases he\u0027d handled, aside from minor work for regular clients, had come as a result of court assignments. Most of these had involved minor offenses-purse snatching, low-level assault, possession of narcotics-until the court had appointed him as counsel to Richard Vanderpoel. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1/page-6.html","bookId":2319,"creation":"Oct 5, 2019 6:24:56 PM","modification":"Oct 5, 2019 6:24:56 PM"}
