{"id":68550,"no":20,"title":"Page 20","content":"\u003cp\u003eJANE FELT PLEASED as she walked down the suburban driveway and climbed into the passenger seat of Ellis\u0027s car. It had been a successful afternoon. The pizzas had been good, and Petal had loved Flashdance. Ellis had been very tense about introducing his daughter to his girlfriend, but Petal had been thrilled by the eight-month-old Chantal, and everything had been easy. Ellis had felt so good about it that he had suggested, when they dropped Petal off, that Jane walk up the drive with him and say hello to Gill. Gill had invited them in, and had cooed over Chantal, so Jane had got to know his ex-wife as well as his daughter, and all in one afternoon.\u003c/p\u003e\n\u003cp\u003eEllis - Jane could not get used to the fact that his name was John, and she had decided always to call him Ellis -\u0026nbsp;\u0026nbsp;put Chantal on the back seat and got into the car beside Jane. \"Well, what do you think?\" he asked as they pulled away.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell me she was pretty,\" Jane said.\u003c/p\u003e\n\u003cp\u003e\"Petal is pretty?\"\u003c/p\u003e\n\u003cp\u003e\"I meant Gill,\" said Jane with a laugh.\u003c/p\u003e\n\u003cp\u003e\"Yes, she\u0027s pretty.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re fine people and they don\u0027t deserve to be mixed up with someone like you.\"\u003c/p\u003e\n\u003cp\u003eShe was joking, but Ellis nodded somberly.\u003c/p\u003e\n\u003cp\u003eJane leaned over and touched his thigh. \"I didn\u0027t mean it,\" she said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true, though.\"\u003c/p\u003e\n\u003cp\u003eThey drove on in silence for a while. It was six months to the day since they had escaped from Afghanistan. Now and again Jane would burst into tears for no apparent reason, but she no longer had nightmares in which she shot Jean-Pierre again and again. Nobody but she and Ellis knew what had happened - Ellis had even lied to his superiors about how Jean-Pierre died - and Jane had decided she would tell Chantal that her Daddy died in Afghanistan in the war: no more than that.\u003c/p\u003e\n\u003cp\u003eInstead of heading back to the city, Ellis took a series of back streets and eventually parked next to a vacant lot overlooking the water.\u003c/p\u003e\n\u003cp\u003e\"What are we going to do here?\" said Jane. \"Neck?\"\u003c/p\u003e\n\u003cp\u003e\"If you like. But I want to talk.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"It was a good day.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Petal was more relaxed with me today than she has ever been.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder why?\"\u003c/p\u003e\n\u003cp\u003e\"I have a theory,\" said Ellis. \"It\u0027s because of you and Chantal. Now that I\u0027m part of a family, I\u0027m no longer a threat to her home and her stability. I think that\u0027s it, anyway.\"\u003c/p\u003e\n\u003cp\u003e\"It makes sense to me. Is that what you wanted to talk about?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He hesitated. \"I\u0027m leaving the Agency.\"\u003c/p\u003e\n\u003cp\u003eJane nodded. \"I\u0027m very glad,\" she said fervently. She had been waiting for something like this. He was settling his accounts and closing the books.\u003c/p\u003e\n\u003cp\u003e\"The Afghan assignment is over, basically,\" he went on. \"Masud\u0027s training program is under way and they\u0027ve taken delivery of their first shipment. Masud is so strong now that he has negotiated a winter truce with the Russians.\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"Good!\" said Jane. \"I\u0027m in favor of anything that leads to a cease-fire.\"\u003c/p\u003e\n\u003cp\u003e\"While I was in Washington, and you were in London, I was offered another job. It\u0027s something I really want to do, plus it pays well.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\" said Jane, intrigued.\u003c/p\u003e\n\u003cp\u003e\"Working with a new presidential task force on organized crime.\"\u003c/p\u003e\n\u003cp\u003eFear stabbed Jane\u0027s heart. \"Is it dangerous?\"\u003c/p\u003e\n\u003cp\u003e\"Not for me. I\u0027m too old for undercover work now. It\u0027ll be my job to direct the undercover men.\"\u003c/p\u003e\n\u003cp\u003eJane could tell he was not being completely honest with her. \"Tell me the truth, you bastard,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s a lot less dangerous than what I\u0027ve been doing. But it\u0027s not as safe as teaching kindergarten.\"\u003c/p\u003e\n\u003cp\u003eShe smiled at him. She knew what this was leading to now, and it made her happy.\u003c/p\u003e\n\u003cp\u003eHe said: \"Also, I\u0027ll be based here in New York.\"\u003c/p\u003e\n\u003cp\u003eThat took her by surprise. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Why are you so astonished?\"\u003c/p\u003e\n\u003cp\u003e\"Because I\u0027ve applied for a job with the United Nations. Here in New York.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell me you were going to do that!\" he said, sounding hurt.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell me about your plans,\" she said indignantly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you now.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m telling you now.\"\u003c/p\u003e\n\u003cp\u003e\"But . . . would you have left me?\"\u003c/p\u003e\n\u003cp\u003e\"Why should we live where you work? Why shouldn\u0027t we live where I work?\"\u003c/p\u003e\n\u003cp\u003e\"In the month we\u0027ve been apart I completely forgot how goddam touchy you are,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eThere was a silence.\u003c/p\u003e\n\u003cp\u003eEventually Ellis said: \"Well, anyway, as we\u0027re both going to be living in New York ...\"\u003c/p\u003e\n\u003cp\u003e\"We could share housekeeping?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said hesitantly.\u003c/p\u003e\n\u003cp\u003eSuddenly she regretted flying off the handle. He wasn\u0027t really inconsiderate, just dumb. She had almost lost him, back there in Afghanistan, and now she could never be mad at him for very long because she would always remember how frightened she had been that they would be parted forever, and how inexpressibly glad she had been that they had stayed together and survived. \"Okay,\" she said in a softer voice. \"Let\u0027s share the housekeeping.\"\u003c/p\u003e\n\u003cp\u003e\"Actually ... I was thinking of making it official. If you want.\"\u003c/p\u003e\n\u003cp\u003eThis was what she had been waiting for. \"Official,\" she said, as if she did not understand.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" he said awkwardly. \"I mean we could get married. If you want.\"\u003c/p\u003e\n\u003cp\u003eShe laughed with pleasure. \"Do it right, Ellis!\" she said. \"Propose!\"\u003c/p\u003e\n\u003cp\u003eHe took her hand \"Jane, my dear, ! love you. Will you marry me?\"\u003c/p\u003e\n\u003cp\u003e\"Yes! Yes!\" she said. \"As soon as possible! Tomorrow! Today\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" he said.\u003c/p\u003e\n\u003cp\u003eShe leaned over and kissed him. \"I love you, too.\"\u003c/p\u003e\n\u003cp\u003eThey sat in silence then, holding hands and watching the sun go down. It was funny, Jane thought, but Afghanistan seemed unreal now, like a bad dream, vivid but no longer frightening. She remembered the people well enough -\u0026nbsp;\u0026nbsp;Abdullah the mullah and Rabia the midwife, handsome Mohammed and sensual Zahara and loyal Fara - but the bombs and the helicopters, the fear and the hardship, were fading from her memory. This was the real adventure, she felt; getting married and bringing up Chantal and making the world a better place for her to live in.\u003c/p\u003e\n\u003cp\u003e\"Shall we go?\" said Ellis.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She gave his hand a final squeeze, then let it go. \"We\u0027ve got a lot to do.\"\u003c/p\u003e\n\u003cp\u003eHe started the car and they drove back into the city. \u003c/p\u003e","sourceLink":"https://allnovel.net/lie-down-with-lions/page-20.html","bookId":2682,"creation":"Oct 5, 2019 10:09:35 AM","modification":"Oct 5, 2019 10:09:35 AM"}
