{"id":53402,"no":1077,"title":"Chapter 1073: Allheaven Immortal!","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003eAs Meng Hao\u0027s words rang out, he advanced toward the middle mountain peak. In the blink of an eye, he was upon it, and yet, the glittering light of a shield suddenly sprang up to block his way.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes flickered as he clenched his hand into a fist and punched the shield, causing it to ripple.\u003c/p\u003e\n\u003cp\u003eIn that exact moment, Long Tianhai sat in his Immortal\u0027s cave, a jade slip clutched in his hand. From the moment Meng Hao had begun to slaughter his way through the sect, he had been transmitting messages into the jade slip.\u003c/p\u003e\n\u003cp\u003e“Patriarch, where are you!?!?”\u003c/p\u003e\n\u003cp\u003eUnfortunately, there was no response at all from the jade slip.\u003c/p\u003e\n\u003cp\u003eMeng Hao was killing Demonic cultivators left and right. He destroyed the sea crab spell formation, causing blood to rain out of the sky, and terrifying the surrounding Demonic cultivators to the point where they wouldn\u0027t even get close to him. As for Long Tianhai, he had fallen into a state of despair.\u003c/p\u003e\n\u003cp\u003eHe looked up at Meng Hao outside of his Immortal\u0027s cave, and his bloodshot eyes gleamed with madness. Finally, he gritted his teeth and crushed the jade slip.\u003c/p\u003e\n\u003cp\u003e“Wanna kill me? It’s not gonna be that easy!” A flame of madness flickered in Long Tianhai’s eyes. He was a cautious person by nature, and was by no means unprepared. During his fight with Meng Hao outside of the sect’s gate, he had sensed how terrifying Meng Hao was, and had instantly begun to make last-minute preparations, just in case.\u003c/p\u003e\n\u003cp\u003eHowever, Meng Hao had shown up too soon. Everything happened in a matter of hours, which was too short of a time to complete all of his preparations. As of now, he would just have to risk using what he had on hand.\u003c/p\u003e\n\u003cp\u003e“Meng Hao, even if I, Long Tianhai, end up dying, well... I’ll take you out with me!” With that, he extended both hands and pushed them down onto the ground. Immediately, the entire Immortal’s cave shone with brilliant light, which swirled around and covered the entire mountain.\u003c/p\u003e\n\u003cp\u003eThe light spread out from the central mountain to cover the other two mountain peaks as well. Next, the other two mountains began to tremble violently, and then suddenly collapsed. Countless rocks and dirt fell down, and a cloud of dust spread out as two huge Stone Golems emerged.\u003c/p\u003e\n\u003cp\u003eThey roared loudly as they charged toward Meng Hao to block his way.\u003c/p\u003e\n\u003cp\u003eAstonishing ripples spread out from the enormous Stone Golems; shockingly, they were similar to Ancient Realm cultivators with three extinguished Soul Lamps.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the two gigantic Stone Golems had clenched their hands into fists and punched out toward Meng Hao, causing a huge wind to spring up. Up in midair, Meng Hao let out a cold snort, then performed an incantation gesture, causing a tempest to spring forth from his hand. He waved a finger, and the tempest rapidly grew to a size of 300 meters, and then shot toward the Stone Golems.\u003c/p\u003e\n\u003cp\u003eWhen they slammed together, a boom rang out. The windstorm vanished, and the two Stone Golems shuddered and then collapsed, sending countless chunks of rock tumbling to the ground.\u003c/p\u003e\n\u003cp\u003eHowever, almost as soon as the Stone Golems collapsed, the rocks flew back up and reshaped into their original form. This time, however, their cultivation bases were not that of three extinguished soul lamps, but rather, five!\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes flickered, then he pinched his fingers together in front of him. All of the light in the area surged together in the palm of his hand, where it formed into the shocking image of a sun. The sun floated above his hand, sucking in all the other light within the Nine Seas God World, causing the air around Meng Hao to twist and distort.\u003c/p\u003e\n\u003cp\u003eHis cultivation base rocketed up, and his 123 Immortal meridians merged together. 33 Heavens appeared, and at the same time, a violet moon materialized next to the sun.\u003c/p\u003e\n\u003cp\u003eThe sun and moon began to orbit each other as the Ninth Mountain appeared. The scene was completely dazzling as Meng Hao waved his hand, causing the sun and the moon to slam into each other and explode in a massive attack that swept out in all directions.\u003c/p\u003e\n\u003cp\u003eRumbling could be heard, along with cracking sounds from the Stone Golems. Meng Hao strode forward, and the bone-tip spear appeared in his hands. He flung it out violently, causing it to fly through the air in a beam of light. It stabbed through both Stone Golems, causing them to tremble violently and then explode. At the same time, the spear stabbed into the shield surrounding the central mountain.\u003c/p\u003e\n\u003cp\u003eThe shield distorted as if were about to fall apart.\u003c/p\u003e\n\u003cp\u003eInside the Immortal’s cave, Long Tianhai coughed up blood, and his body withered slightly. He then let out a miserable shriek as his body transformed into a 300-meter Sea Dragon, pitch black like a Black Dragon!\u003c/p\u003e\n\u003cp\u003eEspecially noteworthy was the shocking white scale that could be seen on his forehead. Apparently, that scale indicated that he had a very high position, even among the Sea Dragon Horde.\u003c/p\u003e\n\u003cp\u003eHe had to pay a heavy price of life force to materialize his true form!\u003c/p\u003e\n\u003cp\u003e“God World Grand Spell Formation! All plants and vegetation, all mountains and stones, become the spirit of the spell formation! I sacrifice my dragon\u0027s blood to the spell formation! Activate!” Long Tianhai roared as massive amounts of life force drained out of him, and he visibly withered up. However, the collapsed Stone Golems outside of his Immortal’s cave... suddenly formed back together and rose to their feet.\u003c/p\u003e\n\u003cp\u003eNow... the aura of seven or eight extinguished Soul Lamps erupted out of them.\u003c/p\u003e\n\u003cp\u003eMeng Hao\u0027s eyes widened. He was aware that Long Tianhai was cautious by nature, but he had never imagined that he would be this well prepared. Obviously, he had set up this spell formation in advance, just in case Meng Hao ended up coming here!\u003c/p\u003e\n\u003cp\u003e“So, he\u0027s borrowing the power of the Nine Seas God World’s protective grand spell formation...?” He looked down thoughtfully at the two Stone Golems, and could tell that they were somehow linked to the Nine Seas God World.\u003c/p\u003e\n\u003cp\u003e“However, he can’t sustain them for very long. At the most... the time it takes half an incense stick to burn!” He backed up, and was about to make his way off into the distance, when all of a sudden, his mind trembled.\u003c/p\u003e\n\u003cp\u003eLing Yunzi’s voice suddenly spoke into his ear.\u003c/p\u003e\n\u003cp\u003e“If you want to kill him, you\u0027d better hurry up. We can’t delay them any longer.”\u003c/p\u003e\n\u003cp\u003eAt the same time that the voice spoke into his ear, an enraged roar could be heard that caused everything to shake. The sound of it caused everyone to tremble; this was clearly... the voice of a Dao Realm expert.\u003c/p\u003e\n\u003cp\u003eThe crowd instantly responded.\u003c/p\u003e\n\u003cp\u003e“The Patriarch!!”\u003c/p\u003e\n\u003cp\u003e“The Patriarch is coming!!”\u003c/p\u003e\n\u003cp\u003eBack in the Immortal’s cave, Long Tianhai\u0027s eyes shone with wild joy as he sensed that the voice behind the roar was none other than the Dao Realm Patriarch of the Demonic Cultivator Horde.\u003c/p\u003e\n\u003cp\u003eIt was a critical moment. Meng Hao’s eyes flickered with determination, and he took a deep breath. He could also tell that the roar came from none other than the Demonic Dao Realm Patriarch, who was currently speeding toward this very location. Although Ling Yunzi and the others had been able to delay him, unfortunately... Meng Hao wouldn’t even have the time it takes for half an incense stick to burn to finish the fight.\u003c/p\u003e\n\u003cp\u003eHe thought for a moment, then extended his hand, within which appeared a Nirvana Fruit.\u003c/p\u003e\n\u003cp\u003e“If that’s how it is, then I have only one option,” he said softly. He hadn’t even resorted to using the Nirvana Fruit in his battle with Elder Hai Sheng. It wasn’t that he didn\u0027t want to use it, rather, the power drain he would experience because of it would render him incapable of fighting after a relatively short period of time.\u003c/p\u003e\n\u003cp\u003eHowever, if the Demonic Cultivator Horde\u0027s Dao Realm expert was coming, then that meant that Ling Yunzi and the others would be too. That meant that right now was a good opportunity to use the Nirvana Fruit.\u003c/p\u003e\n\u003cp\u003e“Exactly how powerful... is an Allheaven Immortal?” He suddenly very much anticipated what was about to happen. Without another moment’s hesitation, he quickly pushed the Nirvana Fruit down onto his forehead.\u003c/p\u003e\n\u003cp\u003eThe first thing he experienced was intense pain. It exploded out into his body, and even though he was tough, he still couldn’t help but throw his head back and howl. It was a hoarse howl that was accompanied by an explosive rise in cultivation base!\u003c/p\u003e\n\u003cp\u003eRumbling filled the air, and everything shook. The wind screamed around Meng Hao, sweeping across everything, crushing everything down as a huge pressure began to weigh down on the Nine Seas God World!\u003c/p\u003e\n\u003cp\u003eMeng Hao trembled, and blood spurted out all over his body. His energy began to shoot upward, past the Immortal Emperor Realm and into another terrifying level.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t stop, it just kept going higher and higher. He began to grow taller and bigger as both his fleshly body and his cultivation base rapidly grew more powerful!\u003c/p\u003e\n\u003cp\u003eConsidering he didn\u0027t know how long he could maintain this state, he didn\u0027t wait for the growth to complete. He advanced, taking a single step that placed him in front of one of the Stone Golems. The Stone Golem roared and punched toward him, but all Meng Hao did was raise his hand and tap it.\u003c/p\u003e\n\u003cp\u003eThat single finger motion caused a huge boom to echo out as the fist suddenly exploded. A moment later, the Stone Golem shattered into pieces and exploded as well.\u003c/p\u003e\n\u003cp\u003eThere was more to it than that, though. Meng Hao’s simple finger attack seemed to erupt with a unique power that covered over the rubble of the Stone Golem, and... severed its connection to natural law!\u003c/p\u003e\n\u003cp\u003eThe Stone Golem was forcibly scraped out from within the power of the Nine Seas God World spell formation. It was a domineering act that caused the entire protective grand spell formation to tremble, and not even dare to resist.\u003c/p\u003e\n\u003cp\u003eThis was only the first step and a single wave of a finger, but it left everyone flabbergasted. Even the incoming Dao Realm experts were shaken.\u003c/p\u003e\n\u003cp\u003eThen, Meng Hao took a second step, and tapped a second time. The second Stone Golem collapsed in exactly the same fashion as the first. It didn\u0027t even qualify to transform into rubble; it was shattered into dust! Meng Hao had no need to sever it from natural law, instead... he completely wiped it away from the Nine Seas God World!\u003c/p\u003e\n\u003cp\u003eMeng Hao hovered there, energy surging, screaming wind causing his hair and robes to whip wildly. It was as if he could stare down the entire world; the domineering air that he exuded only continued to rise.\u003c/p\u003e\n\u003cp\u003eNext, he stepped forward a third time, which caused the central mountain\u0027s shield to shatter, as if it feared him and didn\u0027t even dare to try to block his way. Next... even before he completed his third step, the mountain collapsed. Rock fragments flew out in all directions, revealing Long Tianhai there in the Immortal’s cave, coughing up blood, body withered, expression that of despair.\u003c/p\u003e\n\u003cp\u003e“Patriarch, save me!!” he howled with the last dregs of strength that he could scrape from his life force. Long Tianhai’s true form was that of a 300-meter Sea Dragon, but he was now so weak that he looked like a bag of bones.\u003c/p\u003e\n\u003cp\u003eMeng Hao completed his third step and appeared directly in front of Long Tianhai. Meng Hao was currently about thirty meters tall. He looked like an Immortal Divinity as he stretched out his hand... and clasped Long Tianhai\u0027s neck.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter how Long Tianhai struggled. Meng Hao’s vice-like grip was something that could ignore all divine abilities, magical techniques, and even natural laws. When he wanted to grab ahold of something... it would be grabbed ahold of!\u003c/p\u003e\n\u003cp\u003e“How dare you, Junior!” An enraged roar threatened to shatter the world. It exploded in Meng Hao’s ears, causing him to stagger backward. At the same time, the Nirvana Fruit appeared on his forehead, and his cultivation base began to sink back down. Without the slightest hesitation, he sealed Long Tianhai and threw him into his bag of holding. Then, face pale, he reached his hand out to grab the Nirvana Fruit.\u003c/p\u003e\n\u003cp\u003eHe did not pass out like last time. He still had a bit of energy left, allowing him to prop himself up on a nearby rock. He quickly took out some medicinal pills which he began to consume. Then, a bashful expression appeared on his face, and he looked up into the sky.\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t dare, Senior!”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 1073: Allheaven Immortal!\u003c/strong\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1072\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1074\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1073","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
