{"id":53409,"no":1084,"title":"Chapter 1080: Crimson Door of the Ancient Realm","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003eIt was at this point that two aura streams exploded out from the Nine Seas God World. They belonged to the Demonic Patriarchs, and they immediately shot up and then out of the Ninth Sea.\u003c/p\u003e\n\u003cp\u003eIt wasn’t just them. The two Dao Realm experts from the other two factions were shaken, and also sent divine sense out to examine the situation for themselves.\u003c/p\u003e\n\u003cp\u003eLing Yunzi looked shocked, then glanced back and Meng Hao with a profound look of anticipation.\u003c/p\u003e\n\u003cp\u003eGodmaster smiled faintly, then closed his eyes.\u003c/p\u003e\n\u003cp\u003eNo one but the Dao Realm cultivators could sense the aura up above the Ninth Sea. All they saw was Granny Nine throwing the medicinal pills to Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe medicinal pills and the medicinal pill bottle seemed completely beyond the ordinary.\u003c/p\u003e\n\u003cp\u003eMeng Hao grabbed the bottle, opened it, and took a whiff. Based on his skill in the Dao of alchemy, he was immediately able to determine the effect of the pills. They were pills of restoration that would be considered extravagant even for cultivators of the Ancient Realm. They were something Dao Realm experts might possess, but not in number. Even one could be considered extremely precious.\u003c/p\u003e\n\u003cp\u003eMeng Hao was moved, and once again clasped hands to Granny Nine, then unhesitatingly popped a pill into his mouth.\u003c/p\u003e\n\u003cp\u003eThe instant the medicinal pill entered his mouth, Meng Hao felt like he was shaking violently. His cultivation base was rapidly restored, and in the space of only a few breaths, his eyes began to shine brightly, and he was fully back at his peak state.\u003c/p\u003e\n\u003cp\u003eFurthermore, because of the way he had fought back against the pressure of the Ninth Sea, he was even more powerful than he had been before!\u003c/p\u003e\n\u003cp\u003e“I\u0027ve won the bet, and now those 300,000,000 Immortal jades belong to me!” he murmured, taking a deep breath. Then he turned to look at the first golden gate stone stele, and a wild ambition could be seen burning in his eyes.\u003c/p\u003e\n\u003cp\u003e“And now, my fleshly body has reached a critical juncture. In that case, I might as well go for broke....\u003c/p\u003e\n\u003cp\u003e“With the exception of the fifth stone stele, I want to be 1st in all of them!” Under the shocked eyes of the disciples of the Nine Seas God World, and the cold, venomous stares of the Demonic cultivators, he once again entered the first golden gate stone stele.\u003c/p\u003e\n\u003cp\u003eThe moment he vanished, the crowds of disciples went wild.\u003c/p\u003e\n\u003cp\u003e“He’s actually going back into the first golden gate? He already got into the top 10, could it be that he wants to get an even better ranking?”\u003c/p\u003e\n\u003cp\u003e“This trial by fire isn\u0027t something that you can complete in just one shot. It requires repeated cultivation and improvement. Meng Hao... is a bit impatient.”\u003c/p\u003e\n\u003cp\u003e“Even if he challenges it again now, he won\u0027t get higher than 5th place. He definitely won’t get into the top 4!”\u003c/p\u003e\n\u003cp\u003eFan Dong’er hesitated for a moment. She just couldn\u0027t believe that Meng Hao would be doing something like this rashly. In her judgement, he was a cunning person who never did things unless he knew they would benefit him. For him to make a choice like this meant that he had good reason to do so.\u003c/p\u003e\n\u003cp\u003eAs the discussions went on outside, Meng Hao once again appeared in the deep sea beneath the Nine Seas God World. This time, he sank down rapidly and without the slightest pause.\u003c/p\u003e\n\u003cp\u003eSoon, he he had reached his previous limit of 60,000 meters. There, he paused for a moment, allowing his cultivation base to erupt out and fight back against the pressure. Gritting his teeth, he continued to drop down.\u003c/p\u003e\n\u003cp\u003eHe wanted to advance his fleshly body into the Ancient Realm, to be more powerful. The only way to do that was to continue to sink downward. There, the pressure was more terrifying, and his body would be refined even further.\u003c/p\u003e\n\u003cp\u003eBy forcing himself past that final line of demarcation, and then exploding out... he was convinced that his fleshly body would become incredibly terrifying.\u003c/p\u003e\n\u003cp\u003eRUUUUUUMMMMBLLLLE!\u003c/p\u003e\n\u003cp\u003eBlood oozed out of his mouth, and cracking sounds could be heard inside of him. As he sank down, the pressure became terrifying to an astonishing degree. His body rippled and distorted as the pressure battered against him.\u003c/p\u003e\n\u003cp\u003eHowever, he continued to sink down. 75,000 meters. 84,000 meters....\u003c/p\u003e\n\u003cp\u003eHis mind filled with rumbling sounds, and his flesh was covered with splits and tears. The flame of his life force was fading, and his cultivation base was under such enormous pressure that it almost couldn’t budge.\u003c/p\u003e\n\u003cp\u003eHe felt like all of Heaven and Earth were weighing down on him, and his vision began to swim. However, he continued to go all out, to spare nothing to continue on downward.\u003c/p\u003e\n\u003cp\u003eAs he continued to sink to lower and lower levels, certain late Ancient Realm experts of the Nine Seas God World, who were currently in secluded meditation, suddenly opened their eyes and looked up into the sky, their expressions flickering slightly.\u003c/p\u003e\n\u003cp\u003eSoon, the mid Ancient Realm experts also noticed something happening in the outside world, and their eyes widened.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Meng Hao in his madness sank down into the Ninth Sea. He had already reached a depth of 90,000 meters, and the pressure was indescribably terrifying, dozens of times greater than the pressure at 60,000 meters.\u003c/p\u003e\n\u003cp\u003eEverything was pitch black, and by now, it almost felt like he wasn’t surrounded by water, but wind!\u003c/p\u003e\n\u003cp\u003ePerhaps that feeling was just an illusion; Meng Hao couldn’t sense things very clearly. By now, the flame of his life force was swaying weakly, as if it was about to be extinguished. His body was twisted and warped, as if it might be broken at any moment.\u003c/p\u003e\n\u003cp\u003eJust as he seemed to be on the verge of losing consciousness, he suddenly let out a shout in his heart.\u003c/p\u003e\n\u003cp\u003e“This is my final limit! Let the great Door of the Ancient Realm... come!”\u003c/p\u003e\n\u003cp\u003eAlmost in that same moment, even the Immortal Realm cultivators in the Nine Seas God World were able to detect that something was happening. Their faces flickered as they began to look up... whereupon everyone gasped.\u003c/p\u003e\n\u003cp\u003e“That’s...”\u003c/p\u003e\n\u003cp\u003e“The great Door of the Ancient Realm! That’s the great Door of the Ancient Realm which appears when someone breaks through from the Immortal Realm to the Ancient Realm!!”\u003c/p\u003e\n\u003cp\u003e“Someone is breaking out of the Immortal Realm and stepping into the Ancient Realm!!”\u003c/p\u003e\n\u003cp\u003e“No, that can\u0027t be right! How come that door is crimson? It should be gray!!”\u003c/p\u003e\n\u003cp\u003eThe Nine Seas God World was in chaos as voices echoed out everywhere. The entire Ninth Sea was roaring, and countless sea beasts trembled in hiding, too frightened even to peek out to see what was happening.\u003c/p\u003e\n\u003cp\u003eIn the starry sky up above... countless motes of starlight had formed together into the shape of a matchlessly shocking door.\u003c/p\u003e\n\u003cp\u003eThat door was completely crimson, but it radiated an ancient, primordial aura which caused the seawater to roil. It seemed to represent Heaven and Earth, the will of the Mountain and Sea Realm.\u003c/p\u003e\n\u003cp\u003e“A crimson Door of the Ancient Realm! That represents... the Ancient Realm fleshly body!”\u003c/p\u003e\n\u003cp\u003e“That’s definitely... Ancient Realm fleshly body!” Hoarse exclamations like this could be heard coming from the mouths of the wise and knowledgeable late Ancient Realm experts in the Nine Seas God World.\u003c/p\u003e\n\u003cp\u003eSoon, more and more people began to realize what the crimson Door of the Ancient Realm meant, and soon, the whole Nine Seas God World was abuzz. Almost everyone forgot about Meng Hao; after all, witnessing the appearance of an Ancient Realm expert was much more interesting than binge-watching Meng Hao challenge the golden gates.\u003c/p\u003e\n\u003cp\u003eFan Dong’er was the only one who, after sensing the fluctuations of the great Door of the Ancient Realm, suddenly looked at Meng Hao’s name on the first golden gate stone stele.\u003c/p\u003e\n\u003cp\u003eIn that same moment... the Door of the Ancient Realm above the Ninth Sea began to emit a crimson glow, which pierced down through the water into the Nine Seas God World, and then... landed on the first golden gate stone stele! Everyone’s minds reeled.\u003c/p\u003e\n\u003cp\u003e“It’s Meng Hao!!!”\u003c/p\u003e\n\u003cp\u003e“The only person in the first golden gate stone stele trial by fire is Meng Hao!!”\u003c/p\u003e\n\u003cp\u003e“How... how is this possible!? Meng Hao is entering the Ancient Realm? An Ancient Realm fleshly body?” People cried out in disbelief and shock. Fan Dong’er staggered backward and bit her lip. Meng Hao was truly an enormous mountain blocking the way of an entire generation of Chosen, a mountain that... was now growing even higher!\u003c/p\u003e\n\u003cp\u003eRumbling echoed out as the crimson glow pierced into the golden gate stone stele. and then appeared under the sect in the sea. In the blink of an eye, it was at the 90,000-meter mark... and was on Meng Hao!\u003c/p\u003e\n\u003cp\u003eMeng Hao\u0027s body was twisted and distorted. His divine sense was blurry, and he was on the verge of passing out. However, when the crimson glow enveloped him, his eyes began to shine brightly, and he quivered. The intense roaring that filled him knocked him to his senses.\u003c/p\u003e\n\u003cp\u003eIn that moment of clarity, he raised his head and shot upward from the 90,000 meter mark all the way until he left the golden gate and appeared once again in the middle of the Nine Seas God World.\u003c/p\u003e\n\u003cp\u003eEveryone, even the Dao Realm experts, were looking at him. Countless eyes could see him, bathed in crimson light, rising up into the air. He passed out of the Nine Seas God World’s spell formation, through the seawater... and up into the sky above the sea!\u003c/p\u003e\n\u003cp\u003eNumerous cultivators flew out of the Nine Seas God World to observe. The Ninth Sea itself was roaring, and countless people were looking up into the sky.\u003c/p\u003e\n\u003cp\u003eThey saw a gigantic crimson Door of the Ancient Realm, and they could sense a will that caused them to tremble. It was a will that seemed to represent Heaven and Earth, a will that left even the Dao Realm experts in awe.\u003c/p\u003e\n\u003cp\u003eAs he hovered within the red light, Meng Hao’s body rapidly recovered. He rose up, higher and higher, until he was directly in front of the Door of the Ancient Realm. By the time the glow vanished, Meng Hao was back at his peak.\u003c/p\u003e\n\u003cp\u003eHe could also sense his fleshly body growing incredibly powerful. Cracking sounds rang out as he rapidly grew to a height of nine meters.\u003c/p\u003e\n\u003cp\u003eHe almost looked like a giant, and although he was tiny in comparison to the Door of the Ancient Realm, his explosive, surging energy could shake Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eHe was the subject of countless gazes who had seen Immortal Realm cultivators step into the Ancient Realm. However, no one had ever witnessed such a feat when it came to the fleshly body!\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath. He could sense that his cultivation base was sealed, which meant that he could only rely on the power of his fleshly body. Although the shocking transformations of heaven and earth that were about to occur weren’t nearly as strong as when one’s cultivation base entered the Ancient Realm, it was still considered Ancient Tribulation!\u003c/p\u003e\n\u003cp\u003eHe suddenly flew toward the Door of the Ancient Realm, roaring as his hands formed, not fists, but palms, that slammed into the door. He did not rotate his cultivation base, but rather, relied only on his fleshly body to push forward.\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eThe great Door of the Ancient Realm shook, and opened a sliver, causing a wind to blow out that instantly weakened the flame of his life force.\u003c/p\u003e\n\u003cp\u003e“No magical techniques. This is my fleshly body Ancient Realm Tribulation. However, my secret techniques can still be utilized!” As his voice echoed out, his Immortal meridians, despite being sealed, did not prevent him from using that personal secret technique. His 123 Immortal meridians could still be transformed into a single fleshly body meridian.\u003c/p\u003e\n\u003cp\u003eSuddenly, his fleshly body grew even larger, and an intense power erupted out of him. At the same time, both hands slammed down onto the Door of the Ancient Realm. With a huge roar, he shoved with all his might.\u003c/p\u003e\n\u003cp\u003eRUUUUUUMMMMBLLLLE!\u003c/p\u003e\n\u003cp\u003eEveryone watched as the gigantic Door of the Ancient Realm... opened!!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 1080: Crimson Door of the Ancient Realm\u003c/strong\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1079\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1081\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1080","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
