{"id":53494,"no":1169,"title":"Chapter 1165: The Whole Clan Pays Respects!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1165: The Whole Clan Pays Respects!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGuru Heavencloud was destroyed in body and soul!\u003c/p\u003e\n\u003cp\u003eWhen he died, the four black-armored figures bowed to Meng Hao and then transformed into beams of prismatic light that shot back into the vortex. The vortex had long since ceased rotating, and now looked like a black hole in the void. The four figures disappeared inside, and the black hole vortex vanished.\u003c/p\u003e\n\u003cp\u003eAs it did, the ripples in the starry sky faded away, and the void ceased to tremble. The pressure that came with stepping into the Dao disappeared, and everything returned to normal.\u003c/p\u003e\n\u003cp\u003eHowever... the Heavencloud Bazaar forever had a new name. It became a new stronghold of the Fang Clan.\u003c/p\u003e\n\u003cp\u003eFang Shoudao took a deep breath and concealed the expression of shock which had been pasted onto his face. He looked deeply at Meng Hao for a moment, then waved his hand, causing the shield to be removed from around the asteroid field. The teleportation portals were no longer sealed. Immediately, the terrified cultivators in the area began to leave.\u003c/p\u003e\n\u003cp\u003eAs they did, they glanced over at Meng Hao with fear and dread. To them, Meng Hao was not some Immortal Realm cultivator, but instead a powerful expert of the Senior generation. He was an almighty figure who was completely removed from them.\u003c/p\u003e\n\u003cp\u003eAs can be imagined, the departure of all those cultivators almost immediately caused the news about Guru Heavencloud offending Meng Hao, and the resulting carnage, to begin to spread throughout the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eIt also ensured that Meng Hao’s name once again was talked about far and wide. All clans and sects were shaken, and everyone realized that Meng Hao was a person who could not be considered to be in the Junior generation anymore. He was on the same level as Quasi-Dao experts, or perhaps needed to be treated as even higher than that.\u003c/p\u003e\n\u003cp\u003eThe Fang Clan’s attitude in the whole matter explained everything. Everyone knew that if someone dared to treat Meng Hao with hostility, the entire Fang Clan would respond with explosive violence.\u003c/p\u003e\n\u003cp\u003eAs for the magenta-robed cultivators who used to be disciples of the Heavencloud Bazaar, they stood there trembling, having long since surrendered. They were assimilated into the Fang Clan, who had numerous ways of ensuring their future loyalty and devotion.\u003c/p\u003e\n\u003cp\u003eThe crowds departed, and soon, the only people left behind in the asteroid field were members of the Fang Clan. There were a few hundred in total, all of whom were now looking toward Meng Hao with fanatical devotion.\u003c/p\u003e\n\u003cp\u003eThis was... their Crown Prince!!\u003c/p\u003e\n\u003cp\u003eHe could fight with Quasi-Dao experts, and could even kill them. With a cultivation base and an identity like that, it was enough to cause the whole clan to be shaken and filled with zeal.\u003c/p\u003e\n\u003cp\u003eMost important was the Dao seed inside all of the Fang Clan cultivators. That naturally caused them to be even more respectful toward Meng Hao, although it was on a subconscious level that most of them weren’t aware of.\u003c/p\u003e\n\u003cp\u003eIt was a strong subconscious desire, but after witnessing the grand display of Meng Hao slaughtering a Quasi-Dao cultivator, it erupted out, causing their eyes to overflow with fanatical approval of Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe handful of Elders present were completely shaken. After exchanging glances, they looked around at the former Heavencloud Bazaar. Because of the scale and history of the place, it was a potential goldmine, and whichever clan member was assigned to watch over it would receive untold benefits.\u003c/p\u003e\n\u003cp\u003eIt was at this point that Grand Elder Fang Tongtian spoke up, immediately addressing the most important issue at hand regarding the bazaar. “Hao’er,” he said, “who in the clan do you think would be best suited to running this bazaar?”\u003c/p\u003e\n\u003cp\u003eHis words also indicated to the other Elders that Meng Hao... had the ultimate authority.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at the place in which Guru Heavencloud had vanished, then slowly turned around, clasped hands, and bowed to Fang Shoudao and Grand Elder Fang Tongtian.\u003c/p\u003e\n\u003cp\u003e“Great-Grandpa, Grand Elder, I feel that Fang Xi would be best suited to manage this bazaar,” he said with a smile. “After all, he has had limited chance to gain experience in the clan. This would be an excellent place for him to grow and mature.” Almost as soon as he had decided to rename this place as the Fang Clan Bazaar, he had thought about Fang Xi. Considering how much the place was worth, it would be far better to give it to him than anyone else. [1. Fang Xi appeared too many times for me to include links. Also of the direct bloodline, he helped Meng Hao with his escapades in the Dao of Alchemy Division, and also had some interaction with the parrot and meat jelly]\u003c/p\u003e\n\u003cp\u003e“Fang Xi’s a wonderful kid,” Fang Shoudao said with a kind smile. “Let’s give it to him, then.” To him, this place was just a mere bazaar, so he didn\u0027t even consider refusing Meng Hao. That wasn’t even to mention Meng Hao’s status, which caused even his heart to tremble.\u003c/p\u003e\n\u003cp\u003eHowever, it seemed that Meng Hao wasn’t interested in publically revealing the matter of his status in the clan. If word spread about that, it would send the entire Ninth Mountain and Sea into an uproar. In fact, it could even influence the balance of power in the entire Mountain and Sea Realm as a whole.\u003c/p\u003e\n\u003cp\u003eIn a similar vein, Fang Shoudao understood a bit about Allheaven Clans, but not too much. He would need to confer with Meng Hao about the subject, and decide on the best way to use it to lead the Fang Clan to prominence as quickly as possible, and become a true Allheaven Clan. When he thought about that matter, it caused Fang Shoudao to treat Meng Hao with even greater regard.\u003c/p\u003e\n\u003cp\u003e“Hao’er, let’s go,” he said with a laugh. “It\u0027s been a long time since you\u0027ve been back to Planet East Victory. Why don’t you let your Great-Grandpa here test out your cultivation base and battle prowess?”\u003c/p\u003e\n\u003cp\u003eMeng Hao clasped his hands respectfully, looked at Fang Shoudao and said, “Let’s not rush back to Planet East Victory, Great-Grandpa. Junior would like to head to Planet South Heaven first, to pay respects to father and mother.”\u003c/p\u003e\n\u003cp\u003eFang Shoudao stared in shock for a moment, then looked at Meng Hao thoughtfully. Finally, he smiled and nodded.\u003c/p\u003e\n\u003cp\u003e“You truly deserve to be called the qilin of the Fang Clan. Not only are you matchless and unrivaled, you’re also a filial son. Your idea is an excellent one. How careless of me! Of course we should go to Planet South Heaven first.\u003c/p\u003e\n\u003cp\u003e“Your father is the one who raised the qilin son of the Fang Clan, and even agreed to be dispatched to Planet South Heaven to stand guard. His service and contribution to the clan has involved numerous hardships. In fact, the Fang Clan... would be hard-pressed to be able to repay him.\u003c/p\u003e\n\u003cp\u003e“In fact, I hereby issue new orders. Fang Xiufeng will be the new Clan Chief!! It doesn\u0027t matter that Xiufeng is not on Planet East Victory, all cultivators of the clan should show their respect to him!\u003c/p\u003e\n\u003cp\u003e“I will personally act as Dharma Protector to help Xiufeng make a cultivation base breakthrough, to step from the Ancient Realm into the Dao Realm!” Fang Shoudao flicked his sleeve to make the order official.\u003c/p\u003e\n\u003cp\u003e“Tongtian, send orders to the clan. Any clan member who is a stage 5 Immortal or higher will prepare to immediately leave for Planet South Heaven. All Elders will go as well, to bear witness to the bestowing of the gift of Clan Chieftainship!\u003c/p\u003e\n\u003cp\u003e“All sects and powers in the Ninth Mountain and Sea will know that Fang Xiufeng is the new Clan Chief of the Fang Clan, and demands a show of respect from the entire Ninth Mountain and Sea!”\u003c/p\u003e\n\u003cp\u003eFang Shoudao’s proclamation caused rumbling sounds to fill the minds of all members of the Fang Clan. The Elders gasped in shock. For Fang Xiufeng to be named the Clan Chief was a huge matter. After all, even Fang Shoudao was only the acting Clan Chief.\u003c/p\u003e\n\u003cp\u003eA Clan Chief was the leader of an entire clan. Both in terms of position and status, it was an exalted rank. In terms of the Ninth Mountain and Sea as a whole, such a figure was a person of extreme importance.\u003c/p\u003e\n\u003cp\u003eThis act was an extreme show of goodwill on the part of Fang Shoudao toward Meng Hao. It was a way of making up for past issues, and to show how important Meng Hao was now.\u003c/p\u003e\n\u003cp\u003eIn this way, Meng Hao would well and truly be the legitimate Crown Prince!\u003c/p\u003e\n\u003cp\u003eAnd that was just the first great gift being given. The second was that Fang Shoudao, with the help of Fang Yanxu, both of whom were powerful Dao Realm experts, would assist Fang Xiufeng to step into the Dao Realm himself!\u003c/p\u003e\n\u003cp\u003eWith their help, and assuming the clan itself did not hold back any expense, it would be possible to significantly reduce the danger he would face when attempting to step into the Dao. If at that point he was still unable to succeed, it would not be the fault of the Fang Clan, but rather, Fang Xiufeng himself.\u003c/p\u003e\n\u003cp\u003eRegarding how many clans in the Ninth Mountain and Sea could afford to offer such complete support such as this, well, that number could be counted on a single hand!\u003c/p\u003e\n\u003cp\u003eThese two gifts were so incredible that they caused even Meng Hao to gasp in surprise. Then he turned to Fang Shoudao, clasped hands, and bowed deeply.\u003c/p\u003e\n\u003cp\u003eThe other direct bloodline Elders were very excited, and also bowed to Fang Shoudao, then turned and flew toward the teleportation portal along with Fang Tongtian.\u003c/p\u003e\n\u003cp\u003eBefore entering the teleportation portal himself, Fang Tongtian turned and gave Meng Hao a deep look. He knew he had made mistakes in the past, and hoped that his current actions would make up for that.\u003c/p\u003e\n\u003cp\u003eFang Shoudao laughed and looked over at Meng Hao. “Hao’er,” he said, “there’s no need to be in a rush. Come come, let’s you and I head off first. Once the rest of the clan mobilizes, we can all meet at Planet South Heaven to pay our respects to the Fang Clan Chief!”\u003c/p\u003e\n\u003cp\u003eMeng Hao immediately joined Fang Shoudao to enter a teleportation portal, upon which they vanished.\u003c/p\u003e\n\u003cp\u003eNaturally, Fang Shoudao had many things to discuss privately with Meng Hao, many questions that needed answering.\u003c/p\u003e\n\u003cp\u003eDespite their departure, the Fang Clan was just as aboil as before. After the clan members returned to Planet East Victory, word rapidly spread, and the entire clan surged into motion.\u003c/p\u003e\n\u003cp\u003eAlthough some people questioned the decision, no one dared to violate the orders given by Fang Shoudao. Furthermore, Fang Yanxu emerged from secluded meditation and used his status to oversee the unification of the clan. It didn’t take long before the Fang Clan was organized, and over 1,000,000 clan members formed ranks and entered the teleportation portals that led toward Planet South Heaven.\u003c/p\u003e\n\u003cp\u003eNews about the buzz of activity spread off of Planet East Victory and quickly came to be known by all the sects and clans, leading to quite a stir.\u003c/p\u003e\n\u003cp\u003eSeven days later, the glow of teleportation rose up outside of Planet South Heaven. Numerous shining lights filled the air as the members of the Fang Clan emerged, faces solemn. As they organized themselves in the starry sky outside of Planet South Heaven, their numbers swelled until it became virtually impossible to see the group from beginning to end.\u003c/p\u003e\n\u003cp\u003eAll of them wore the ceremonial attire of the Fang Clan as they hovered there, facing Planet South Heaven.\u003c/p\u003e\n\u003cp\u003eFang Yanxu was at their fore, joined by Pill Elder. Behind them were the Elders, then the direct bloodline clan members. Last were all the other ordinary clan members, arranged in ranks. It was a grand sight that caused the starry sky to tremble and the void to shake.\u003c/p\u003e\n\u003cp\u003eIt was at this time that Meng Hao and Fang Shoudao emerged from the glow of another teleportation portal. Fang Shoudao’s expression seemed the same as ever, but his eyes glowed with joy and excitement that were impossible to cover up. Fang Yanxu could see it clearly as Fang Shoudao approached. When Fang Shoudao saw him, he nodded.\u003c/p\u003e\n\u003cp\u003eOne thing that Fang Yanxu immediately noticed was that Fang Shoudao was actually positioned behind Meng Hao. He was only about half a step back, which might not seem like much, but to Fang Yanxu, it was very telling.\u003c/p\u003e\n\u003cp\u003eHis eyes suddenly gleamed with excitement.\u003c/p\u003e\n\u003cp\u003eMeng Hao hovered there, backed by what seemed like all of the most powerful experts of the Fang Clan. His heart surged with pride. He... had come home!\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1164\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1166\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-7-chapter-1165","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
