{"id":53547,"no":1222,"title":"Chapter 1218: Mutual Deception!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1218: Mutual Deception!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMassive rumbling could be heard as the 30,000-meter chunk of the Ruins of Immortality crushed the Blacksoul Society disciples beneath it to death!\u003c/p\u003e\n\u003cp\u003eSimultaneously, an intense shockwave spread out from the place where it landed, filling the entire planet. A massive blast of wind surged out, engulfing Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eCountless mountains were ripped up, and numerous rivers were transformed into raindrops. It was as if the entire planet had been punched!\u003c/p\u003e\n\u003cp\u003eThe disciples in the periphery were smashed by the shockwave and sent tumbling out of control through the air, blood spraying from their mouths. It was an incredible spectacle!\u003c/p\u003e\n\u003cp\u003eThe ground on the entire planet trembled and then sank downward; massive fissures spread out, and cracking sounds could be heard. The planet... had already been destabilized, and it was now showing signs that it would collapse. It was as if it had been pushed beyond the point where it could endure any longer, and... would begin to crumble at any moment!\u003c/p\u003e\n\u003cp\u003eThe Blacksoul Society disciples on the surface were hit by a deafening roar. Blood sprayed out of their mouths; they were struck dead on impact. Those who survived were now numb with fear. Trembling, they began to scream, and soon, all of them were in full retreat.\u003c/p\u003e\n\u003cp\u003eUnfortunately for them, all of the teleportation portals had been sealed tight, but even so they chose to attempt an escape. The all-consuming shadow of death loomed within the hearts of all present.\u003c/p\u003e\n\u003cp\u003ePatriarch Blacksoul’s face fell. Never in his wildest conjectures could he ever have imagined that Meng Hao would actually possess a part of the rarely-seen Ruins of Immortality, here in the Eighth Mountain!\u003c/p\u003e\n\u003cp\u003eEven as the planet showed signs that it was beginning to collapse and the disciples of the Blacksoul Society were scattering in terror, killing intent flickered in Meng Hao’s eyes.\u003c/p\u003e\n\u003cp\u003e“Terracotta soldier,” he growled, “your presence is requested!” Instantly, the terracotta soldier appeared from within the 30,000-meter chunk of the Ruins of Immortality, which was still crushing down into the planet. It leaped into the air, transforming into a beam of light that shot out of the ruins to appear directly in front of one of the disciples of the Blacksoul Society. It waved its hand sweeping its greatsword through the air in a flash of flickering light.\u003c/p\u003e\n\u003cp\u003eInstantly, an enemy was killed!\u003c/p\u003e\n\u003cp\u003eThe terracotta soldier’s eyes flickered and it attacked again.\u003c/p\u003e\n\u003cp\u003e“Quasi-Dao puppet!” Patriarch Blacksoul’s face flickered, and shot toward the terracotta soldier to destroy it. However, this time, Meng Hao didn’t fall back, but instead attacked.\u003c/p\u003e\n\u003cp\u003eHe stepped forward, transforming into an azure-colored roc that shot toward Patriarch Blacksoul with incredible speed.\u003c/p\u003e\n\u003cp\u003ePatriarch Blacksoul’s eyes flickered with killing intent. He hated the terracotta soldier which was slaughtering his disciples, but he hated Meng Hao even more.\u003c/p\u003e\n\u003cp\u003e“When I kill you, that Quasi-Dao puppet will belong to me!” he said, spinning in place. The wave of a sleeve caused the power of flame Essence to erupt out, transforming his surroundings into a sea of flames. A wind sprang up, and soil materialized. The power of three Essences exploded out, transforming into visible killing intent that shot toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao\u0027s eyes flickered almost imperceptibly. He still had not utilized his all-powerful Paragon Bridge, nor his Battle Weapon. Instead, he performed an incantation gesture, sending the Essence of Divine Flame out, backed by the will of an Allheaven Dao Immortal.\u003c/p\u003e\n\u003cp\u003eHe was relying on his own power alone to fight the three Essences of Patriarch Blacksoul. Blood sprayed out of Meng Hao’s mouth as he fell back. Patriarch Blacksoul grinned maliciously and advanced.\u003c/p\u003e\n\u003cp\u003eAs he neared, Meng Hao waved his right index finger, causing the Eighth Demon Sealing Hex to appear. After that was the Seventh Hex, the Sixth Hex, and the Fifth Hex, all in quick succession.\u003c/p\u003e\n\u003cp\u003ePatriarch Blacksoul lurched to a stop in midair. Karma Threads appeared around him, and soul blood flew out from his forehead. A massive rift opened up in front of him, which emanated the power of the Inside-Outside Hex as it tried to consume him.\u003c/p\u003e\n\u003cp\u003eAll of this happened in a brief moment. Meng Hao threw his head back and roared, and his energy surged up as he fused with the starstone in his eye and transformed into a shooting star, surrounded by scorching Divine Flame, swirling Immortal mountains, and even the explosive power of the sun and moon.\u003c/p\u003e\n\u003cp\u003eIt was even possible to see the faint image of nine mountains. Meng Hao was apparently using his most powerful divine abilities to attack Patriarch Blacksoul.\u003c/p\u003e\n\u003cp\u003eThey closed in with rapid speed as Patriarch Blacksoul threw his head back and roared. He waved his arm, casting off all the Hexing magics, then waved his right index finger out, tapping Meng Hao’s shooting star form.\u003c/p\u003e\n\u003cp\u003e“That Quasi-Dao puppet and these magical techniques are your trump cards, huh?” Patriarch Blacksoul said coldly. “I can crush them in an instant!” As his finger tapped down onto the shooting star, cracks spread out, and the One Thought Stellar Transformation formed from Meng Hao\u0027s starstone collapsed into pieces.\u003c/p\u003e\n\u003cp\u003eHowever, as that happened, Meng Hao appeared, his right hand already transformed into the Battle Weapon!!\u003c/p\u003e\n\u003cp\u003eShockingly, he had used the starstone to hide the transformed copper mirror. As soon as the power of the starstone fell apart, Meng Hao’s killing intent skyrocketed, as if he had been holding back and building it up. All of a sudden, his blade was flashing like lightning toward Patriarch Blacksoul.\u003c/p\u003e\n\u003cp\u003eThe attack was completely unexpected, and was backed by the terrifying power of numerous natural laws. Suddenly, fear welled up within Patriarch Blacksoul’s heart.\u003c/p\u003e\n\u003cp\u003eHe fell back rapidly, causing his cultivation base to explode out with its full power. He also called upon the full power of his Essences to attempt to block the blade. A massive boom rang out, and scintillating light shone out as if the Heavens were being split open. Blood oozed out of Patriarch Blacksoul’s mouth. However, a mocking gleam could be seen in his eyes.\u003c/p\u003e\n\u003cp\u003eAlthough the slash of the blade wounded him in a way that didn’t heal... it was only a slight wound. After all, Patriarch Blacksoul was a very cautious person. Everything he had been doing so far was an attempt to get Meng Hao to use his trump cards. He wanted to know for sure exactly what made Meng Hao so confident that he would take the Blacksoul Society on alone.\u003c/p\u003e\n\u003cp\u003eStupid people could not practice cultivation to his level. Not knowing exactly what trump cards his opponent had left him in a state of unease....\u003c/p\u003e\n\u003cp\u003e“So this is your trump card,” Patriarch Blacksoul said coldly. “Not bad. Unfortunately, although it’s pretty good, you used it at the wrong time. Or perhaps it’s better to say that it doesn\u0027t really matter how you use it, I have already taken precautions against something like that! You are doomed to be defeated.”\u003c/p\u003e\n\u003cp\u003eNow that he felt a bit less on edge, he smiled viciously and waved his finger through the air. Rumbling could be heard, and the air distorted as a huge incense burner suddenly appeared above his head.\u003c/p\u003e\n\u003cp\u003e“Well then, now it’s my turn to attack... and extract your soul!”\u003c/p\u003e\n\u003cp\u003eIn the instant that the incense burner appeared, Meng Hao looked at it closely. After confirming that it was what he was looking for, a grin appeared on his face, along with an emotional sigh.\u003c/p\u003e\n\u003cp\u003e“Well it took long enough,” he murmured softly, “and I even had to reveal my Battle Weapon. Finally you pull it out....”\u003c/p\u003e\n\u003cp\u003eAs soon as the words left his mouth, Patriarch Blacksoul gaped in shock!\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNote from Deathblade:\u003c/strong\u003e When I finished translating this chapter, I was amazed because of the record time it took to finish it. I translated it in a little over half the time it normally takes me. I even proudly told Madam Deathblade about this accomplishment. That was before I read the note of apology from Er Gen which said that the chapter is only about 2/3 the size of a normal chapter. It was about 2,000 words instead of 3,000, which translated to about 1,200 words instead of 2,000.\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1217\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1219\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1218","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
