{"id":53568,"no":1243,"title":"Chapter 1239: Body Refining!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1239: Body Refining!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe trembling cultivator could feel the incredible coldness radiating through Greed-possessed Meng Hao’s grip. It was like being held by a block of ice, and it filled his mind with sounds like howling. He was instantly overwhelmed by a feeling of imminent death, and his face went deathly pale.\u003c/p\u003e\n\u003cp\u003eJust when the cultivator felt that he couldn\u0027t endure it any longer, Meng Hao’s grip suddenly loosened. The cultivator screamed and shot backward, indescribably terrified of Meng Hao.\u003c/p\u003e\n\u003cp\u003eIgnoring the fleeing cultivator, Greed-possessed Meng Hao slowly rose to his feet. As he did, his head floated up from the ground and slowly dropped back into place on his neck. Then the flesh and bone rapidly grew back together and healed up.\u003c/p\u003e\n\u003cp\u003eHis injuries were also rapidly recuperating. Cracking sounds could be heard as the broken bones in his body were set straight and linked back together.\u003c/p\u003e\n\u003cp\u003eAll of this took place in the space of a few breaths of time, and then he was completely healed.\u003c/p\u003e\n\u003cp\u003eBy that point, the cultivator had discovered the location of the exit of the side chamber, and was going crazily all-out in his attempt to flee.\u003c/p\u003e\n\u003cp\u003eMeng Hao shook his head slightly and suddenly opened his eyes. As soon as they opened, a blue light spilled out, cold and merciless. His eyes seemed vastly ancient, and filled with a gleam of greed. He looked up, and then vanished.\u003c/p\u003e\n\u003cp\u003eWhen he reappeared, he was at the exit of the side chamber, directly in front of the fleeing cultivator. Before the man could react, Meng Hao\u0027s hand snaked out and grabbed onto his neck.\u003c/p\u003e\n\u003cp\u003eA cracking sound could be heard as his neck was subsequently crushed.\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath, then murmured, “Ah, slaughter.... It\u0027s been a long, long time since I\u0027ve had some good slaughtering.\u003c/p\u003e\n\u003cp\u003e“To have a body again feels... really good.” It was Meng Hao’s voice, and yet there was something husky about it, as if it was reverberating out from countless years in the past.\u003c/p\u003e\n\u003cp\u003e“This body… is something even I haven’t seen the likes of throughout the years. It has a unique bloodline too.... Excellent. Most excellent. Even more rare is its foundation.... With a body like this, I definitely have a chance to reach Heaven Trampling.” Meng Hao’s slight smile grew even more terrifying than before.\u003c/p\u003e\n\u003cp\u003e“Furthermore, this person’s injuries were significant, making the possession process go even smoother than I imagined it would. Ah, it must be the will of Heaven that I, Greed, can finally step out into the world again!” Hoarse laughter filled the side chamber.\u003c/p\u003e\n\u003cp\u003e“From this day forward, this is my body. Since that’s the case... I think I’ll make it even more powerful than it already is!” His eyes glittered as he performed a double-handed incantation gesture, then pushed down with his finger repeatedly on locations all over his body.\u003c/p\u003e\n\u003cp\u003eEvery time he pushed down, a tremor would run through him, and the spot he touched would wither. However, a powerful qi and blood force exploded out within him, causing his fleshly body, which was already at the very peak, to suddenly push toward a breakthrough!\u003c/p\u003e\n\u003cp\u003e10 times. 20 times. 30 times!\u003c/p\u003e\n\u003cp\u003eHis hands sped faster and faster, depressing numerous pressure points on his body and increasing the range of the withering. Soon, he looked like nothing more than a bag of bones, and yet his fleshly body power had reached an unbelievable degree. Furthermore, as the rumbling echoed out, he continued to grow more powerful!!\u003c/p\u003e\n\u003cp\u003ePreviously, his fleshly body had reached the great circle of the Ancient Realm, just half a step away from breaking out of the Ancient Realm and into the Dao Realm. However, that half a step was a vast and difficult gap to cross. Despite having considered many options, Meng Hao hadn’t been able to come up with one that would work.\u003c/p\u003e\n\u003cp\u003eBut now, after being possessed and having the pressure points on his body depressed, he was getting closer and closer to having a Dao Realm fleshly body.\u003c/p\u003e\n\u003cp\u003e“What does a Dao Realm fleshly body count for?” Greed said in a hoarse voice. “I just need some God blood, and I could break through easily. It seems that this body could have grown more powerful all along; it\u0027s just that its previous owner was inexperienced. Not so me. I won’t let things go to waste.” His hands suddenly stopped moving. As for his body, it looked almost like a skeleton.\u003c/p\u003e\n\u003cp\u003eAnd yet, the intense fleshly body power that radiated off of that skeleton was several times stronger than before. Although it wasn’t in the Dao Realm, in terms of power it was equivalent to it!\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath, then flickered into motion as he began to fly through the necropolis. As he proceeded along, he continued to refine his fleshly body. Soon, another Ancient Realm cultivator appeared up ahead.\u003c/p\u003e\n\u003cp\u003eIt was an old man who, upon catching sight of Meng Hao, stared in shock. Meng Hao didn’t look familiar at all to him; his skeletal body was shocking, causing the old man to fall back without the slightest hesitation.\u003c/p\u003e\n\u003cp\u003eHowever, in the moment that he fell back, a vicious smile appeared on Meng Hao’s face, and he vanished. When he reappeared, he was behind the old man, lifting his hand to clamp onto the top of the man’s head.\u003c/p\u003e\n\u003cp\u003eHe pressed down softly, and the man shuddered. Rumbling could be heard as he suddenly transformed into ash, as well as floating wisps of white mist. That mist flew out and fused into Meng Hao\u0027s body, causing a bit of flesh and blood to be restored to it.\u003c/p\u003e\n\u003cp\u003e“I can still get stronger. Now that I\u0027m finished refining the flesh and blood, it’s time to work on the bones!” Rumbling echoed out as a boundless sea of fire rose up around him and then poured into his body. Popping sounds could be heard, and intense pain radiated through him. And yet, he didn\u0027t so much as frown.\u003c/p\u003e\n\u003cp\u003eIn fact, he began to float forward, following the corridor as his bones were refined. After the process was complete, his power once again increased dramatically.\u003c/p\u003e\n\u003cp\u003e“And finally the qi passageways....” he said, taking a deep breath. A screaming wind erupted, surging into his qi passageways, opening them, sweeping through him. He trembled, but clenched his teeth hard and endured, continued to progress forward. Suddenly, he vanished, to reappear in another side chamber, behind another Ancient Realm cultivator.\u003c/p\u003e\n\u003cp\u003eThe cultivator’s scalp went numb, and as he turned around, his expression was one of shock. Suddenly, Meng Hao head-butted him, a violent collision which shattered the man into pieces.\u003c/p\u003e\n\u003cp\u003eA bang could be heard as his body transformed into ash, and a white mist appeared which Meng Hao absorbed, after which he proceeded along without the slightest pause.\u003c/p\u003e\n\u003cp\u003eAfter enough time passed for an incense stick to burn, Meng Hao’s eyes glittered as the refinement of his qi passageways was completed.\u003c/p\u003e\n\u003cp\u003e“And last, the blood!” His right index finger pressed down onto his chest, digging in deep, stabbing through his flesh and blood into his heart.\u003c/p\u003e\n\u003cp\u003eIn response, his soul began to radiate an Essence power unique to his own soul. That was the source of the power which maintained his existence and extended his longevity, but now, it was being unleashed in an effort to further strengthen his fleshly body.\u003c/p\u003e\n\u003cp\u003eThat was the Essence of his life force, and as soon as it poured into his heart, rumbling could be heard as all of the blood in his body began to boil. As it burned away and lessened, his body began to produce more blood to replace the old.\u003c/p\u003e\n\u003cp\u003eThe cycle continued; gradually the regeneration of his blood could not match the speed with which the new blood was being burned away. Eventually, the regenerative process of the blood itself was affected, and the color of his blood turned deep-gold!\u003c/p\u003e\n\u003cp\u003eLess and less blood existed inside of him, until, in the end, only thirty percent remained. However, his energy had risen explosively, making him far stronger than an ordinary Dao Realm cultivator. He was comparable to... a Dao Lord!\u003c/p\u003e\n\u003cp\u003eAnd yet, his fleshly body still wasn’t actually in the Dao Realm!\u003c/p\u003e\n\u003cp\u003e“Now this is a perfect fleshly body,” Meng Hao said, a smile breaking out on his face. He slowly pulled his hand out of his chest, which healed up instantly, without even a drop of blood emerging from the wound.\u003c/p\u003e\n\u003cp\u003e“Now it’s time to test it out and see if it\u0027s as strong as I think it is.” Smiling oddly, he strode forward, moving with speed that vastly exceeded what he was previously capable of. He left behind only afterimages as he shot off into the distance.\u003c/p\u003e\n\u003cp\u003eHe was like a ghost in the necropolis, harvesting all forms of life that he encountered.\u003c/p\u003e\n\u003cp\u003eCurrently, there were three Dao Realm cultivators in the necropolis: there were the two 2-Essences cultivators who had attempted to block Meng Hao’s path, then there was the most powerful of the three, Xuan Daozi.\u003c/p\u003e\n\u003cp\u003eAll three of them were in different locations, relying on the advantage they had because of their cultivation bases to search for Meng Hao.\u003c/p\u003e\n\u003cp\u003eAt this point, six Ancient Realm cultivators appeared up ahead of Meng Hao. They had banded together, and were proceeding along carefully. Everything about this burial ground left them terrorstruck, and at the moment, they weren’t thinking at all about good fortune, but rather, were merely looking for a way out.\u003c/p\u003e\n\u003cp\u003eAs they proceeded along, suddenly, one of the cultivators whispered, “What was that sound!?”\u003c/p\u003e\n\u003cp\u003eThe faces of the others around him flickered as they looked around in all directions.\u003c/p\u003e\n\u003cp\u003eWhen they saw nothing out of the ordinary, that made them even more nervous, so they picked up speed. However, it wasn’t long before all of them got a creepy sensation from the fact that the only sound to be heard in the area were footsteps.\u003c/p\u003e\n\u003cp\u003eThose footsteps originally belonged to the six of them, but now they all realized... that there was the sound of a seventh set of footsteps.\u003c/p\u003e\n\u003cp\u003eThe scalps of all six cultivators went numb. Transmitting messages to each other, their cultivation bases exploded with power, and they unleashed divine abilities in all directions. The glow of their magical techniques immediately revealed a skeletal figure.\u003c/p\u003e\n\u003cp\u003eBooms rang out, filling the necropolis, to be heard by quite a few of the cultivators there. However, to the six cultivators unleashing divine abilities, it was a completely shocking matter; all of their divine abilities and magical items slammed into the skeletal figure, but the only result was that they heard faint banging sounds. The figure itself wasn’t hurt at all.\u003c/p\u003e\n\u003cp\u003e“Too weak,” the skeletal figure said, smiling. He sped forward, his index finger flashing as fast as lightning as he stabbed into the foreheads of all six cultivators in quick succession.\u003c/p\u003e\n\u003cp\u003eIt happened in the blink of an eye. The skeletal Meng Hao was now directly in front of the six cultivators, who trembled as they transformed into ash. The white mist appeared, which he absorbed, restoring more of his fleshly body. Now he looked less like a skeleton, although he was still incredibly gaunt.\u003c/p\u003e\n\u003cp\u003e“Well,” murmured Meng Hao, “I’m in no hurry to test the limits of this fleshly body. It seems this fellow is sadly short when it comes to magical items. Too bad he’s a pauper; his bag of holding is virtually empty.” There really wasn’t much at all to be seen in Meng Hao’s bag of holding, only a cauldron, a spear, and a few swords.\u003c/p\u003e\n\u003cp\u003eGreed wasn\u0027t really aware of how suspicious it was that the bag of holding was so empty. Previously, it had also held a copper mirror, a parrot, a meat jelly, and an ocean of Immortal jades, promissory notes and magical items.\u003c/p\u003e\n\u003cp\u003eNow, though, all of that was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003e“Ah well, it doesn’t matter. This Meng Hao must have been engaged in an intense battle for quite a while. His expendable items have been used up, which is only natural. Presumably, these remaining items are quite nice. However, once I use my Essence power to refine them, they’ll be even more powerful.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1238\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1240\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1239","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
