{"id":53569,"no":1244,"title":"Chapter 1240: An Incredible Person!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1240: An Incredible Person!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGreed-possessed Meng Hao lifted his hand, within which appeared a long spear, which was none other than his World Tree bone-tip spear.\u003c/p\u003e\n\u003cp\u003e“Wow, this thing is pretty incredible.... The wood is rare, and the spearhead appears to have come from a Dao Realm beast.... Unfortunately, it was forged improperly, and has a lot of imperfections. Although, what’s even more important than that is... that the spear has been sealed.” Meng Hao hefted the long spear and looked at it closely for a moment before smiling.\u003c/p\u003e\n\u003cp\u003e“Interesting. It was actually sealed by a cultivator from home. It would be very troublesome for anyone here to unseal it. They might be able to forcefully wipe out the seal, but then the spear would be destroyed.\u003c/p\u003e\n\u003cp\u003e“To me, though, undoing the seal will be easy.” He waved his hand, causing a droning sound to emanate out from the spear as he flew through the necropolis, divine sense emanating out in all directions. Suddenly, he turned and headed in a different direction.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long before he was closing in on two Ancient Realm cultivators. Almost immediately, their faces fell. Just as they were about to retreat, the long spear appeared in Meng Hao’s hands, stabbing through the forehead of one of the cultivators, completely destroying him in body and spirit.\u003c/p\u003e\n\u003cp\u003eThe spear didn’t stop; it kept on going until it stabbed through the second cultivator’s heart, causing him to explode.\u003c/p\u003e\n\u003cp\u003eIn the instant that the two of them died, Meng Hao’s left hand flashed in a strange sealing gesture, which was not a magical technique of the Mountain and Sea Realm. Then he waved his finger, causing the cultivators’ souls to be forcefully extracted. Finally he clenched the souls hard in his hand, transforming them into two magical symbols, which he then placed onto the long spear.\u003c/p\u003e\n\u003cp\u003e“OPEN!” he growled. The spear in his hand shook, and then suddenly, cracks appeared all over its surface, almost as if it were shedding a layer of skin. Then, an intense aura rumbled out as the spear transformed into an Azure Dragon!\u003c/p\u003e\n\u003cp\u003eUnexpectedly, the spearhead transformed into the vicious image of a ghost with a violet body and a long horn on its head. It appeared to be an evil spirit, but was in fact a vicious beast from ancient times!\u003c/p\u003e\n\u003cp\u003eRumbling could be heard as pressure emanated from the spear. This was an explosive change that was almost like a rebirth compared to what the spear had been like before!\u003c/p\u003e\n\u003cp\u003e“Now that’s a bit more imposing,” Greed said with a sinister grin. With that, he put the spear away and then proceeded onward, taking out the Lightning Cauldron as he did.\u003c/p\u003e\n\u003cp\u003eAs he examined the cauldron, a strange gleam appeared in his eyes, almost as if he were recalling something from the past.\u003c/p\u003e\n\u003cp\u003e“It seems he and I really are connected by destiny. However, this cauldron has been refined via sacrifice.” He suddenly shoved his hand down, causing a boom to echo out as a ball of lightning flame shot out from his palm to surround the cauldron.\u003c/p\u003e\n\u003cp\u003eCracking sounds could be heard, and fissures spread out over the cauldron. In the blink of an eye, it shattered. However, at the same time, Meng Hao performed a double-handed incantation gesture, then spit out a mouthful of blood, causing the cauldron to re-form.\u003c/p\u003e\n\u003cp\u003e“Congeal!”\u003c/p\u003e\n\u003cp\u003eIn a short instant, the countless fragments of the cauldron formed back together into the shape of a cauldron, which now shone with boundless magical light. Mountains, rivers, and countless living beings could be seen on its surface, and most shocking of all was that far more lightning crackled around its surface than before.\u003c/p\u003e\n\u003cp\u003eA shocking pressure also emerged from the cauldron which far exceeded that from before. Apparently, this was the cauldron\u0027s most powerful state.\u003c/p\u003e\n\u003cp\u003eA hoarse laugh could be heard as Meng Hao waved his hand, sending the Lightning Cauldron floating up above his head. There it turned slowly, boundless lightning forming a pool which spread out, making Meng Hao look even more incredible than before.\u003c/p\u003e\n\u003cp\u003e“Form Displacement Transposition. How could it be limited to flesh and blood?!” Laughing heartily, he strode forward, suddenly slamming into a nearby wall and punching through it to the other side.\u003c/p\u003e\n\u003cp\u003e“The Five Elements Lightning Cauldron makes its comeback starting now!” After shooting through the hole in the wall, he appeared in another corridor, whereupon he waved his finger down the hall.\u003c/p\u003e\n\u003cp\u003eImmediately, the Lightning Cauldron rumbled, causing masses of lightning transform into tens of thousands of Silver Dragons to rush forward in the direction he was pointing.\u003c/p\u003e\n\u003cp\u003eDown the corridor was a middle-aged man, one of the two 2-Essences Dao Realm cultivators. His face fell, and he let out a roar, unleashing the power of his cultivation base, which happened to be that of wood-type power. It caused an enormous tree to materialize, which shot toward the lightning.\u003c/p\u003e\n\u003cp\u003eBacking up, he performed an incantation gesture with his right hand, then waved his finger at Meng Hao. Instantly, the corridor began to tremble as stone thorns burst out from everywhere to stab toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eSimultaneously, two hands formed from soil rose up and made a grab for his legs.\u003c/p\u003e\n\u003cp\u003e“Earth Essence Buries All!” roared the man. As he fell back, he waved both hands, causing rumbling to fill the air as the lands collapsed. A terrifying power then erupted out, threatening to inundate Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Five Elements Lightning Cauldron,” Meng Hao said coolly, “convert the five elements into lightning! Earth to lightning. Wood to lightning. Kill him!” Rumbling could be heard as the enormous tree distorted and then collapsed, transforming into numerous bolts of green-colored lightning, which spun around and shot toward the middle-aged man.\u003c/p\u003e\n\u003cp\u003eAt the same time, the earth-power was reversed, shattering and transforming into gray lightning bolts which rocketed toward the middle-aged man at an indescribable speed.\u003c/p\u003e\n\u003cp\u003eThe man’s face fell, and before he could even retreat, he looked down to find that a withered hand was stabbing into his chest.\u003c/p\u003e\n\u003cp\u003eHe had no idea when that hand had appeared, but it was grabbing at his heart. Although it seemed to only be gripping his heart... it felt like his soul, his life force, his everything, were being grabbed ahold of. His Nascent Divinity had no way to flee his fleshly body, as if it were sealed by that palm.\u003c/p\u003e\n\u003cp\u003e“Noooo....” the middle-aged man wailed madly. The withered hand clenched down viciously, and rumbling sounds could be heard as his heart shattered into countless pieces. The man’s body trembled, then transformed into ash. Moments later, Greed-possessed Meng Hao appeared behind him, licking his lips.\u003c/p\u003e\n\u003cp\u003eWhen that man died, vast amounts of white mist floated up into the air to pour into Meng Hao’s body. Cracking sounds rang out from inside of him as his withered fleshly body was restored even further. No longer did he look completely terrifying, just a bit pale.\u003c/p\u003e\n\u003cp\u003e“See Meng Hao, I\u0027m going along with many of your wishes! I\u0027m helping you... to exterminate everyone in here!” If anyone who knew Meng Hao could see him licking his lips as he was right now, they would definitely find it to be very bizarre.\u003c/p\u003e\n\u003cp\u003e“Next, let’s take a look at these swords.” He waved his hand, causing a handful of swords to fly out from his bag of holding. Shockingly, these were the wooden swords that Meng Hao had collected from the various corpses over the years!\u003c/p\u003e\n\u003cp\u003eAs soon as the Greed-possessed Meng Hao saw them, he shivered, and a strange light began to glow in his eyes.\u003c/p\u003e\n\u003cp\u003e“These were forged in the other great land mass... for the specific purpose of killing Immortals. They are... Immortal Murdering Swords!! They are also sealed.... This Meng Hao might have an empty bag, but the items he does possess are treasures!” Licking his lips, Greed tossed the swords out into the air. Eyes shining strangely, he took a deep breath and then spit out a mouthful of flame Essence.\u003c/p\u003e\n\u003cp\u003eAs soon as the fire touched the wooden swords, he performed a double-handed incantation gesture. Face somber, he occasionally uttered some complex spells, and tossed in further incantation gestures. After the time it takes an incense stick to burn, beads of sweat were pouring down his forehead, and his aura was weakening.\u003c/p\u003e\n\u003cp\u003eHowever, the swords were beginning to superimpose with each other, as if they were transforming into one single sword. When that single superimposed sword dropped down, Greed grabbed it and looked at it with a bit of disappointment.\u003c/p\u003e\n\u003cp\u003e“What a pity,” he sighed. “It\u0027s not the structure I’m familiar with, so I can only attempt to force it back together based on memory. I can’t fully restore them to their genuine state.” Then he sucked in a deep breath, causing the superimposed wooden swords to transform into a dark beam that shot into his mouth.\u003c/p\u003e\n\u003cp\u003e“Okay, now it\u0027s time for my cultivation base.” He took another deep breath, which caused peals of thunder to fill the necropolis, and a huge wind to spring up. His energy suddenly rose up rapidly, and the bloodline power of an Allheaven Dao Immortal exploded out. After a certain critical point was reached, the power of his cultivation base caused the Paragon Bridge inside of him to become visible.\u003c/p\u003e\n\u003cp\u003e“Is that....” Greed’s expression flickered with disbelief, and he began to shake with wild joy.\u003c/p\u003e\n\u003cp\u003e“It’s THAT bridge!! How is this possible! That’s...\u003c/p\u003e\n\u003cp\u003e“He actually has THAT bridge inside of him!!\u003c/p\u003e\n\u003cp\u003e“Good fortune! This is indescribable good fortune for me! Probably the greatest good fortune of my entire life!” Shaking, he threw his head back and laughed maniacally.\u003c/p\u003e\n\u003cp\u003e“My fleshly body power is perfect, but my cultivation base is a bit lacking. Well, that doesn’t matter, I have ways to improve this cultivation base right now!” He lifted his hand and produced Meng Hao’s fourth Nirvana Fruit, which he examined closely.\u003c/p\u003e\n\u003cp\u003e“What a pity that Meng Hao’s memories were obscured because of his incredible injuries. Thanks to his soul being damaged, I can\u0027t see very much, and have no idea what this thing is. However, I can sense that it has the ability to increase my cultivation base.” After a moment of thought, he pushed the Nirvana Fruit down onto his forehead.\u003c/p\u003e\n\u003cp\u003eHe trembled, throwing his head back and roaring as his cultivation base rocketed up. Moments later, though, the fourth Nirvana Fruit suddenly appeared back outside of his forehead; since it was impossible for him to absorb it fully, it fell back down.\u003c/p\u003e\n\u003cp\u003e“Get back in there!” Greed said, eyes flashing coldly. He performed an incantation gesture with his right hand, then pushed a finger down onto his forehead, once again using some of his life force Essence to create a seal, after which he tried to forcefully keep the fourth Nirvana Fruit inside.\u003c/p\u003e\n\u003cp\u003eThe real Meng Hao would not have been able to do something like this. Not only did he not have any ability with such a sealing mark, the life force power necessary to do such a thing was something he couldn\u0027t sustain.\u003c/p\u003e\n\u003cp\u003eBut now... when the matter was being controlled by the person possessing his body, his Nirvana Fruit was forced... to once again fuse into him. Forcefully causing the fruit to begin fusing with him caused his cultivation base to explode with power, but at the same time the life force absorption rate from the Nirvana Fruit soared.\u003c/p\u003e\n\u003cp\u003e“Life force essence!” Greed roared. Using the Essence power of his life force, he pushed the Fourth Nirvana Fruit into a state of fusion. Greed’s life force Essence could keep him alive in this land of the dead. It was the key to him being able to avoid death after he had been imprisoned here. That was normally his most prized possession, but right now, he could sense that Meng Hao’s body had so many desirable traits that he would risk anything and pay any price to enhance it as much as possible!\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1239\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1241\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1240","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
