{"id":53614,"no":1289,"title":"Chapter 1285: The Spell Formation Stirs!","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003eMeng Hao might be the future Lord of the Mountain and Sea Realm, but as far as he was concerned, the Heavengod Alliance wasn’t very important. They had even tried to track him down and kill him, so in some respects, they even counted as an enemy.\u003c/p\u003e\n\u003cp\u003eIn fact, were it not for the invasion of the Seventh Mountain and Sea, after Meng Hao’s identity was revealed within the Meng Clan, perhaps the Heavengod Alliance would have besieged them.\u003c/p\u003e\n\u003cp\u003eWhatever happened, Meng Hao didn\u0027t have strong feelings for this place. After all... it wasn’t the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eAnd yet... there was someone in the Heavengod Alliance that he cared about, his Master the Noble Ran, who had passed the Seal the Heavens Incantation on to him. Furthermore, after entering the Ancient Realm, he had begun to vaguely sense certain fluctuations from the Eighth Mountain, which he knew belonged to the Lord of the Eighth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eThose fluctuations seemed very familiar, and in fact reminded him of... the aura on his Grandpa Meng\u0027s command medallion, which was tucked away safely in his bag of holding.\u003c/p\u003e\n\u003cp\u003eHe hadn’t mentioned any of those things to his grandmother, because he actually did plan to eventually fight in the war, both for the Noble Ran, and for... those familiar fluctuations he felt coming from the Eighth Mountain.\u003c/p\u003e\n\u003cp\u003eBecause of those things, he felt that he had no choice but to join the war effort.\u003c/p\u003e\n\u003cp\u003eHowever, before he jumped into the fray, he needed to make sure that there was nothing that could be used against him. That was why, for the preceding two months, he had been constantly pouring power from the Mountains and Seas into the ground, to make... a spell formation!\u003c/p\u003e\n\u003cp\u003eOf course, all of these were things that Han Qinglei would have no way of knowing.\u003c/p\u003e\n\u003cp\u003eMeng Hao didn\u0027t want the Meng Clan to become... the next Han Clan. He didn’t want his grandmother to worry about such things either, nor did he want her to feel the pain of seeing fellow clan members die. Most importantly, he didn\u0027t want to see her hurt even a tiny bit.\u003c/p\u003e\n\u003cp\u003eHis Grandma Meng was a relative, one of the people he cared most about in the world.\u003c/p\u003e\n\u003cp\u003e“Soon. The spell formation will be finished soon,” he murmured to himself, looking out into the sky.\u003c/p\u003e\n\u003cp\u003eAnother half a month passed, during which the war in the Eighth Mountain and Sea intensified. Reports came in on a daily basis from various members of the Meng Clan, each of which Meng Hao studied in minute detail.\u003c/p\u003e\n\u003cp\u003eThe Heavengod Alliance had finally begun a counteroffensive... which was still under way. Both sides were taking heavy casualties.\u003c/p\u003e\n\u003cp\u003eOne of the most important bits of news was that among those killed were not just 1-Essence or 2-Essences Dao Realm experts. There were already Dao Lords among the dead.\u003c/p\u003e\n\u003cp\u003eMany of the sects in the Heavengod Alliance were no more. One planet after another was destroyed. If the Heavengod Alliance met complete defeat, then the remaining cultivators would have no choice but to fall back to the Eighth Mountain itself.\u003c/p\u003e\n\u003cp\u003eRecently, more and more voices were pleading for the Lord of the Eighth Mountain and Sea to come out.\u003c/p\u003e\n\u003cp\u003eUnfortunately... he never appeared.\u003c/p\u003e\n\u003cp\u003eThe only people who did appear were cultivators of the Heavengod Society. In fact, the Chief Dharma Protector of the Heavengod Society convened a war council to coordinate the fighting.\u003c/p\u003e\n\u003cp\u003eThe number of cultivators coming through the rift from the Seventh Mountain and Sea was growing increasingly fewer. However, there was a burning life force within that rift that even Meng Hao could sense from his position in the Meng Clan, and it was growing more and more distinct.\u003c/p\u003e\n\u003cp\u003eIt was a vigorous life force, a flame that could light up the entire starry sky. And it was slowly getting closer to the Eighth Mountain and Sea. It belonged to an entity who occupied a position of supreme power, and had a terrifying cultivation base. Because of that, passing from one of the Mountains and Seas to another was a slow process for this person.\u003c/p\u003e\n\u003cp\u003eThat person was none other than... Sima Dao, Mountain and Sea Lord from the Seventh Mountain and Sea!\u003c/p\u003e\n\u003cp\u003eMeng Hao could sense him just as much as he could sense that awakening entity on the Eighth Mountain.\u003c/p\u003e\n\u003cp\u003eSimultaneously, both that entity and Sima Dao could sense the existence of the person entrenched in the Meng Clan... Meng Hao!\u003c/p\u003e\n\u003cp\u003eThree days later, Meng Hao’s eyes snapped open, and at the same time, the surrounding nine continents of the Meng Clan began to emit droning sounds that sounded like earthquakes, as if some incredible power were rising up from the lands.\u003c/p\u003e\n\u003cp\u003eIt was a big shock to all members of the Meng Clan, and no one had any idea what was happening, not even the five Dao Realm Patriarchs, who immediately sent divine sense out.\u003c/p\u003e\n\u003cp\u003eWhat they discovered shocked them; the nine continents were filled with a Heaven-shaking, Earth-shattering power, a power which was building up toward an inevitable eruption.\u003c/p\u003e\n\u003cp\u003e“Is the Seventh Mountain and Sea coming!?!?”\u003c/p\u003e\n\u003cp\u003e“What’s going on!?” Everyone in the Meng Clan was astonished, including Han Qinglei and his people.\u003c/p\u003e\n\u003cp\u003eAs the alarm spread, Meng Hao emerged from secluded meditation and appeared within the ancestral mansion, in his grandmother\u0027s courtyard. The moment he appeared there, his grandmother walked out, looking quite apprehensive.\u003c/p\u003e\n\u003cp\u003e“Hao’er, what’s happening?” she asked. In the recent days, she had been administering affairs in the Meng Clan, and had transformed them into a clenched fist; they were no longer in a state of disorganized chaos like before.\u003c/p\u003e\n\u003cp\u003eNow that Meng Hao had come out, the five Patriarchs hurried over, along with other powerful experts from the various bloodlines.\u003c/p\u003e\n\u003cp\u003eHan Qinglei wasn’t a member of the Meng Clan, but because of his relationship with Meng Hao, the Han Clan wasn\u0027t excluded, and they also hastened over to Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked around at everyone, then finally turned to his grandmother, clasped hands and bowed deeply.\u003c/p\u003e\n\u003cp\u003eAfter Grandma Meng saw the complex expression in his eyes, she understood what he was thinking, and she shivered. “Hao’er, you....”\u003c/p\u003e\n\u003cp\u003eMeng Hao looked up at his grandmother and began to speak softly, “Grandma Meng, I failed to comply with one of your previous orders, and took it upon myself to take care of a certain matter.\u003c/p\u003e\n\u003cp\u003e“The Eighth Mountain and Sea has been struck with war. It’s a war that I normally wouldn’t fight in. I would rather stay here to protect the Meng Clan. However... because of a certain person, I must intervene.\u003c/p\u003e\n\u003cp\u003e“However, if I do fight in this war between two great Mountains and Seas, then the Meng Clan will also get dragged into the matter, and could end up being wiped out by the Seventh Mountain and Sea....\u003c/p\u003e\n\u003cp\u003e“Grandma Meng....”\u003c/p\u003e\n\u003cp\u003eGrandma Meng looked at him silently for a moment, then sighed softly. How could she not have come to realize what had been going through Meng Hao’s mind lately? She actually had no desire to see him fighting in the Mountain and Sea War either. He might be very powerful, but in her eyes, he was still only a member of the Junior generation.\u003c/p\u003e\n\u003cp\u003eIt might be a selfish decision to ask him not to fight, but to Grandma Meng, family was more important than politics, and the Meng Clan was more important than the Eighth Mountain and Sea. However, she had overlooked his feelings in the matter, and therefore, after another long moment passed, she spoke, her voice somewhat hoarse, “I understand. You... already made your decision. If you want to go, then go. Can I help in any way?”\u003c/p\u003e\n\u003cp\u003eSomehow, Grandma Meng seemed much older after those words left her mouth.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at her for a moment. Then, smiling slightly, he stepped forward and embraced her.\u003c/p\u003e\n\u003cp\u003e“Grandma,” he said softly, “I want to send the Meng Clan to the Ninth Mountain and Sea. There is no war there yet, so all of you will be safe.”\u003c/p\u003e\n\u003cp\u003eGrandma Meng was quiet for a moment, then slowly nodded. At the same time, she reached out with her wrinkled hand and gently stroked Meng Hao’s cheek, her eyes glowing with love. “You\u0027re a good kid. You\u0027ve done so much for me already. Perhaps my previous decision was a bit selfish. But… you have to promise me that you’ll stay safe....”\u003c/p\u003e\n\u003cp\u003eMeng Hao nodded, then looked back at the others present, and his face darkened a bit.\u003c/p\u003e\n\u003cp\u003e“Ladies and gentlemen, I’m going to send all of you to the Ninth Mountain and Sea. Let me remind you, though, that as long as I live, if you dare to harbor any evil thoughts regarding the people I care about... you will regret it.”\u003c/p\u003e\n\u003cp\u003eMeng Hao’s words caused everyone to suck in a deep breath, even the five Dao Realm Patriarchs. Although they were struck deeply with fear, they were also quite moved by the fact that Meng Hao planned to send them to safety in the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003e“Brother Han, how about the Han Clan go to the Ninth Mountain and Sea. What do you say?”\u003c/p\u003e\n\u003cp\u003eHan Qinglei’s jaw dropped in response to Meng Hao’s words. All of a sudden, he understood what Meng Hao had said half a month before about waiting for the right time to fight in the war.\u003c/p\u003e\n\u003cp\u003eIt wasn’t that he planned to hold back forever. He really was... waiting for the right time. And that time... was now.\u003c/p\u003e\n\u003cp\u003e“Many thanks!” Han Qinglei said, clasping hands and bowing deeply. For the Han Clan, the chance to go to the Ninth Mountain and Sea was an amazing opportunity. After all, they were no longer in a position to fight in the war.\u003c/p\u003e\n\u003cp\u003eOf course, it was difficult enough for one person to pass between two Mountains and Seas, let alone an entire continent and all its people like Meng Hao claimed he would do. Everyone was completely shocked.\u003c/p\u003e\n\u003cp\u003e“It doesn’t seem possible! That’s a huge amount of people, plus a continent. This....”\u003c/p\u003e\n\u003cp\u003e“Piercing through will expend an incredible amount of power. In fact, it’s incalculable!”\u003c/p\u003e\n\u003cp\u003e“The Ninth Mountain and Sea....”\u003c/p\u003e\n\u003cp\u003eEveryone looked at Meng Hao with even more alarm than before. If Meng Hao really could do as he said he would, then he would be even more awe-inspiring to them than he already was.\u003c/p\u003e\n\u003cp\u003eAs long as he was alive, no one would ever dare to challenge his grandmother\u0027s position or authority.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked over the crowd for a moment, then took a deep breath and raised both hands into the air. In almost the exact same instant, the power of the Mountains and Seas exploded out from within him. It was as if a fuse had been lit, which resulted in an enormous pillar of light shining up from one of the nine smaller continents. It shot up into the starry sky, sending out boundless ripples.\u003c/p\u003e\n\u003cp\u003eNext, a second continent exploded with light, then a third and a fourth....\u003c/p\u003e\n\u003cp\u003ePillars of light shot up from one continent after another, radiating intense power from the Mountain and Sea Realm, power that Meng Hao had been building up for months. Obviously, he didn’t have the power on his own to send a whole continent of people to the Ninth Mountain and Sea, so he had chosen to use the power of the Mountain and Sea Realm to accomplish that task.\u003c/p\u003e\n\u003cp\u003eEven with that extra help, he had spent months in preparation, so it was possible to imagine how much of a price the Seventh Mountain and Sea must have paid to invade the Eighth.\u003c/p\u003e\n\u003cp\u003eAlmost in the same instant that Meng Hao unleashed the power of the Mountains and Seas, as the pillars of light shot up into the starry sky, suddenly, tens of thousands of cultivators from the Seventh Mountain and Sea appeared, radiating killing intent.\u003c/p\u003e\n\u003cp\u003eThe person in the lead position was a middle-aged man... the same man whose son Meng Hao had killed... Marquis Lu of the Seventh Mountain and Sea!\u003c/p\u003e\n\u003cp\u003eThe man’s face was grim, and his murderous aura seethed. As he closed in on the Meng Clan, he spotted the distant pillars of light.\u003c/p\u003e\n\u003cp\u003e“You killed my son, so I’ll wipe out your whole clan! I don\u0027t care what a whit about the orders of the Mountain and Sea Lord. He might have let you off the hook because of your friendship, but… you should never have provoked me!”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 1285: The Spell Formation Stirs!\u003c/strong\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1284\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1286\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1285","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
