{"id":53641,"no":1316,"title":"Chapter 1312: Lord White Turns Outsider!","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003e“The Seas have three magics, the Commoner’s Magic, the Minister’s Magic, and the Emperor’s Magic!” Lord White roared. Three natural laws descended that seemed to supercede all other natural laws, affecting all minds as they crushed down onto Meng Hao.\u003c/p\u003e\n\u003cp\u003eA strange light shone in Meng Hao’s eyes as he waved his hand, summoning the Paragon Bridge. This Paragon Bridge was different than the bridges he had summoned before; the towering will of a Paragon swirled around it as it fought back against the three Sea magics, which subsequently shattered.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s face paled a bit, but almost immediately recovered. Then he frowned.\u003c/p\u003e\n\u003cp\u003e“It seems my biggest weakness now is this body of mine,” he murmured inwardly. Although his fleshly body had experienced growth when he extinguished his Soul Lamps, that growth was not incredibly significant. His fleshly body had already almost reached its total limit, and could not really make any more progress without a complete breakthrough.\u003c/p\u003e\n\u003cp\u003eConsidering how much energy he had built up in preparation for the breakthrough, once it occurred, his fleshly body would rapidly increase in power afterward.\u003c/p\u003e\n\u003cp\u003eHowever, before the breakthrough, all of that energy was essentially useless.\u003c/p\u003e\n\u003cp\u003e“The Dao Realm fleshly body requires... the blood of ancient Gods.” He then thought back to that trial by fire in the Nine Seas God World, and the words spoken to him by the old man who had passed on the three exterminating fist techniques.\u003c/p\u003e\n\u003cp\u003e“Ancient God blood....” Then he recalled that back in the Windswept Realm, Yuwen Jian from the Seventh Mountain and Sea had told him that there were ancient Gods where he came from.\u003c/p\u003e\n\u003cp\u003eEven as these things flashed through his mind, blood was spraying out of Lord White’s mouth from the backlash of his attack. His hair turned white, and his body withered. His entire aura weakened in the blink of an eye, and his Green Emperor’s Eternal Incantation immediately exploded into action.\u003c/p\u003e\n\u003cp\u003eHowever, he was bitterly aware that he had nowhere to flee to, no path of escape. The only tiny chance he had to survive was to go all out and fight to the death.\u003c/p\u003e\n\u003cp\u003eLord White threw his head back and laughed maniacally, performing a double-handed incantation gesture and simultaneously spitting out some blood. He did not use his Death Curse Magic, which Meng Hao had already overcome in their last battle. Meng Hao’s divine sense was now as powerful as a Paragon, so using the Death Curse Magic against him would do little good.\u003c/p\u003e\n\u003cp\u003eGritting his teeth, Lord White waved the index fingers of both hands toward Meng Hao. Instantly, the sabre and the sword that were swirling around him flared with red light and black smoke, which seemed to connect up into the 33 Heavens beyond the limits of the starry sky. It was like a Devilish flame that caused the Mountain and Sea Realm to rumble, and a power of expulsion to rise up.\u003c/p\u003e\n\u003cp\u003eHowever, even as that power of expulsion appeared, Lord White threw his head back and roared, Suddenly, a crown-like object appeared atop his head, flickering with dazzling light that instantly caused the Mountain and Sea power to settle down.\u003c/p\u003e\n\u003cp\u003eThat crown was the symbol that marked him as a Mountain and Sea Lord. With it, he was able to stifle the expulsion power of the Mountain and Sea Realm, and thus allow him to temporarily borrow power directly from the 33 Heavens!\u003c/p\u003e\n\u003cp\u003e“DIE!” he howled. The sabre and the sword hummed in unison, radiating intense killing intent as they shot toward Meng Hao!\u003c/p\u003e\n\u003cp\u003eLord White knew that although the sabre and sword were powerful, they were not enough to kill Meng Hao. Laughing bitterly, eyes aflame with madness, he decided to go all out in one final attack. This was an attack that would end with either Meng Hao dead, or himself!\u003c/p\u003e\n\u003cp\u003eHe raised his right hand up high, and the evil spirit totem tattoo on it seemed to come to life. Its eyes blinked open, causing an intense, vile aura to fill the starry sky.\u003c/p\u003e\n\u003cp\u003eBarely audible was the sound of roaring coming from the 33 Heavens beyond the limits of the starry sky, which pierced through the barriers to settle onto the battlefield where Meng Hao and Lord White were fighting!\u003c/p\u003e\n\u003cp\u003eThat roar did not come from Dao Fang, who had appeared during their last battle!\u003c/p\u003e\n\u003cp\u003eIt came from some other spirit!\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression flickered, and a strange light appeared in his eyes. After a moment of thought, he turned somberly to face the sabre and sword, and then reached out and made a grasping gesture. Instantly, the sabre and sword began to vibrate.\u003c/p\u003e\n\u003cp\u003eThe short sabre then began to shine with dazzling light, and then suddenly dissolved into a liquid which spread out to avoid Meng Hao’s grasp. Then it transformed into the outline of some gigantic beast.\u003c/p\u003e\n\u003cp\u003eIt was a vicious lizard, covered with innumerable spines that glittered with cold light. The lizard roared as it attacked Meng Hao.\u003c/p\u003e\n\u003cp\u003eAs for the short sword, it also dissolved, turning into a Silver Dragon, which howled as it charged forward.\u003c/p\u003e\n\u003cp\u003eMeng Hao snorted coldly, looking away from Lord White to the incoming lizard and Silver Dragon. In the same moment, his divine sense exploded out, turning into a crushing power that weighed down on the starry sky.\u003c/p\u003e\n\u003cp\u003eEverything distorted as a huge rift was torn open. The gigantic lizard trembled and then let out a bloodcurdling scream as it was torn to pieces.\u003c/p\u003e\n\u003cp\u003eAs for the Silver Dragon, the exact same thing happened to it. It didn\u0027t even qualify to fight back, and was instantly shredded.\u003c/p\u003e\n\u003cp\u003eThe sabre was destroyed and the sword was crushed!\u003c/p\u003e\n\u003cp\u003eThey were precious treasures that Lord White had prepared specifically to use against Meng Hao. But now, Meng Hao had divine sense that was eighty percent as powerful as that of a Paragon\u0027s, which caused the void to distort and the starry sky to crush down.\u003c/p\u003e\n\u003cp\u003eMeng Hao waved his sleeve, sweeping away the fragments of the sabre and sword, dispersing them.\u003c/p\u003e\n\u003cp\u003eIn that same instant, Lord White howled, a sound that could shake Heaven and Earth. Simultaneously, the roaring coming from the 33 Heavens beyond the starry sky caused everything to shake.\u003c/p\u003e\n\u003cp\u003eThe vicious spirit on the back of Lord White’s hand grinned ferociously. Even as Meng Hao turned his attention to it, it materialized into an evil ghost, which didn’t attack Meng Hao, but rather, turned and burrowed into Lord White’s body.\u003c/p\u003e\n\u003cp\u003eLord White spasmed, then threw his head back and roared.\u003c/p\u003e\n\u003cp\u003eROOOAARRRR!!\u003c/p\u003e\n\u003cp\u003eHis body began to grow, and in the blink of an eye, he was 30 meters tall, then 300 meters. His eyes were crimson, and radiated madness. Apparently, his mental faculties were crushed in that instant, and he went completely mad.\u003c/p\u003e\n\u003cp\u003eNumerous spines grew out of the pupils of his eyes, and scales rapidly spread out over his skin, giving him a completely shocking appearance. His face twisted with pain as he beat his chest with his fists. At the same time, his spine extending, causing a huge tail to appear, which was covered with viscous bodily fluid.\u003c/p\u003e\n\u003cp\u003eTwo brutish horns sprouted out of his head, and his aura exploded out to a Heaven-shaking, Earth-shattering degree.\u003c/p\u003e\n\u003cp\u003eThat aura was definitely not the aura of the Mountain and Sea Realm, but rather the aura of the Outsiders from the 33 Heavens!!\u003c/p\u003e\n\u003cp\u003eThis was not the first time Meng Hao had seen something like this happen. Back when he had fought Marquis Lu, something similar had occurred. However, the energy Lord White was giving off now was beyond compare to what he had seen before.\u003c/p\u003e\n\u003cp\u003eAnd yet... there was no power of expulsion from the Mountains and Seas. That crown still glittered on his head, which apparently caused a peculiar willpower to fill the area, isolating him from the Mountain and Sea Realm, so that it couldn’t even sense him!\u003c/p\u003e\n\u003cp\u003eClearly, Lord White’s status had something to do with why this was happening!\u003c/p\u003e\n\u003cp\u003e“Die, Die, DIE!” Lord White roared. Apparently, Lord White had some strange connection to the 33 Heavens, a connection that Meng Hao could sense. Although this caused him to frown slightly, it was not some huge shock.\u003c/p\u003e\n\u003cp\u003eAfter his fight with Marquis Lu, it was easy for Meng Hao to come to the conclusion that Lord White must have a similar magic at his disposal. Of course, the price involved was incomprehensible, so much so that Lord White wouldn’t use it unless it was his only chance at survival. In fact, that heavy price was also why he had chosen to flee during their last battle.\u003c/p\u003e\n\u003cp\u003eBut now, the rift was gone, and Meng Hao’s power left him in complete despair. He knew that today... he had a 0/100 chance of surviving unless he went completely all out!\u003c/p\u003e\n\u003cp\u003eROOOAARRRR!!\u003c/p\u003e\n\u003cp\u003eLord White turned into a black beam that shot toward Meng Hao with incredible speed, piercing through the starry sky. In the blink of an eye, he was in front of Meng Hao, stretching out his claw-like hands toward him.\u003c/p\u003e\n\u003cp\u003eRUMBLE!\u003c/p\u003e\n\u003cp\u003eHis claws shredded the starry sky with destructive power. Although that explosive power did not equal the 6-Essences level, it was immeasurably close.\u003c/p\u003e\n\u003cp\u003eAs the claws neared, Meng Hao’s eyes flickered, and his divine sense roiled out. The power of eighty percent of a Paragon’s divine sense crushed down onto Lord White, instantly causing him to grind to a halt, trembling.\u003c/p\u003e\n\u003cp\u003eIn that instant, Meng Hao’s right hand lifted up, and the copper mirror appeared, transforming instantly into the Battle Weapon. This version of the Battle Weapon was vastly sharper than before, and looked different as well. The murderous aura which surrounded it was greater, and the blade glow which flickered out shoved Lord White back thirty meters, howling.\u003c/p\u003e\n\u003cp\u003eA gaping wound appeared in his chest, but strangely, no blood flowed out from it. Roaring madly, he charged in again, whereupon Meng Hao snorted coldly and sent his divine sense crushing down once again.\u003c/p\u003e\n\u003cp\u003eA boom rang out as Lord White was once again halted in place by the terrifying pressure from Meng Hao. Try as he might to fight back, it was useless, and he was left trembling.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes flashed, and he took a step forward. The Battle Weapon slashed through the starry sky, sending out dazzling light that seemed to rend the starry sky.\u003c/p\u003e\n\u003cp\u003eMassive power slashed down onto Lord White, cutting him cleanly into two pieces. Yet again, no blood sprayed out, although he let out a bloodcurdling scream.\u003c/p\u003e\n\u003cp\u003eHowever, what was truly bizarre was that the two halves of his body wriggled and transformed into two versions of Lord White, which then charged madly toward Meng Hao from two different directions.\u003c/p\u003e\n\u003cp\u003eMeng Hao frowned, sending divine sense out and attacking with the Battle Weapon again. However, the only result of his slashing attack was that there were now four Lord Whites!\u003c/p\u003e\n\u003cp\u003e“Won’t die and can’t be killed?” Meng Hao’s eyes flashed coldly as he put the Battle Weapon away and then performed an incantation gesture and pointed out. Immediately, the Paragon Bridge rumbled out, emanating the power of the 6-Essences level, which completely shattered the four Lord Whites into a pulp.\u003c/p\u003e\n\u003cp\u003eRUUUUUUMMMMBLLLLE....\u003c/p\u003e\n\u003cp\u003eHowever, even as they shattered, Meng Hao’s frown deepened. There in front of him, the countless dust-like fragments formed back together, and this time, there weren’t four Lord Whites, but rather... dozens!\u003c/p\u003e\n\u003cp\u003e“Die, Die, DIE!” All of the Lord Whites howled and charged at Meng Hao from all directions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 1312: Lord White Turns Outsider!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1311\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1313\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1312","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
