{"id":53657,"no":1332,"title":"Chapter 1328: Vale of the Godgrave!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1328: Vale of the Godgrave!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYuwen Jian watched blankly as all of this happened. He gazed at the spot where the three Outsiders had just died. He looked at the other Outsiders, who were fleeing madly in all directions. Finally, he looked back at Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was grim as he eyed the retreating Outsiders, and then took a step toward the altar.\u003c/p\u003e\n\u003cp\u003eYuwen Jian hesitated for a moment before saying, “You know, it might waste a bit of time, but we could still kill at least thirty percent of these fleeing Outsiders.”\u003c/p\u003e\n\u003cp\u003eMeng Hao turned and replied, “Killing people isn’t as effective as killing hearts! The key to war is not just victory in battle. It lies within the spirit....\u003c/p\u003e\n\u003cp\u003e“They’ve lost their courage, because I crushed their hearts. Without spirit, these Outsiders will become the first stepping stone in raising the morale of the cultivators of the Mountain and Sea Realm.”\u003c/p\u003e\n\u003cp\u003eYuwen Jian revered Meng Hao, but still had an opinion to express. “Only one victory, or an impressive display by one powerful person... is probably not enough to make that happen.”\u003c/p\u003e\n\u003cp\u003e“You’re right. And that’s why I need to get into the Vale of the Godgrave as soon as possible, to get that God blood.” Meng Hao stepped onto the altar and looked up into the starry sky, and the giant land mass that was the 1st Heaven.\u003c/p\u003e\n\u003cp\u003eIn that moment, a flickering flame of madness could be seen in his eyes.\u003c/p\u003e\n\u003cp\u003e“Let me ask you a question,” Meng Hao murmured softly. “Imagine what would happen if the Outsiders from the 1st Heaven looked up and saw their entire world shattering into pieces and then falling down out of the sky. After that, do you think that their spirits, their hearts, and their courage... could remain intact?” His words were spoken in a quiet tone, but the meaning behind them was astonishing enough to rock Heaven and Earth!\u003c/p\u003e\n\u003cp\u003eYuwen Jian gasped. “You....” He felt almost as if he had been struck by lightning, and could hardly speak.\u003c/p\u003e\n\u003cp\u003eMeng Hao closed his eyes. “The key to winning a war... is destroying your enemy’s spirit! To these Outsiders, the 1st Heaven is their home, and their spirit....” With that, he vanished into the altar.\u003c/p\u003e\n\u003cp\u003eYuwen Jian was trembling, not from fear, but from excitement and anticipation. Meng Hao’s words echoed in his mind, and he could truly imagine what it would be like if he was in the middle of fighting the Outsiders, then suddenly looked up to see the 1st Heaven crumbling into pieces and falling out of the sky. To him, it would be something completely exhilarating and galvanizing.\u003c/p\u003e\n\u003cp\u003eIn sharp contrast, the Outsiders would find it... an utter catastrophe!\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe Vale of the Godgrave!\u003c/p\u003e\n\u003cp\u003eIt really was a shattered portion of an ancient battlefield. That was the only thing which existed there. Not even the will of the Mountain and Sea Realm could be detected. It was as if the only thing that existed in this place was an all-pervasive will to fight.\u003c/p\u003e\n\u003cp\u003eIn almost the exact same instant that Meng Hao entered the dimension, he heard the sounds of countless voices echoing in his ears like thunder.\u003c/p\u003e\n\u003cp\u003e“FIGHT!!”\u003c/p\u003e\n\u003cp\u003eIt was a voice belonging, not to any individual entity, but rather, the dimension itself, and the powerful will to fight that had existed in this place for countless years.\u003c/p\u003e\n\u003cp\u003eIt was like an undying soul throwing its head back and howling, consumed with the desire to slaughter its way through the Heavens, the starry sky, and all lands.\u003c/p\u003e\n\u003cp\u003eIf Meng Hao’s divine will were not as strong as it was, being at eighty percent of a Paragon\u0027s, that will to fight would have incited him to instantly attack something. But now, it was simply a slight stimulation that hardly affected him.\u003c/p\u003e\n\u003cp\u003eHowever, as soon as Yuwen Jian appeared, he began to shake, and his face drained of blood. Meng Hao waved his hand, and Yuwen Jian recovered. After looking around, he turned to face Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Brother Meng, I can do this myself!” With that, he clasped hands, and then sped off in another direction, eyes gleaming with determination and decisiveness. Meng Hao watched Yuwen Jian leave the area of protection he had offered, and could see both the difficulty with which he did so, and also the mad desire within his soul that drove him to such lengths. Meng Hao sighed.\u003c/p\u003e\n\u003cp\u003eYuwen Jian had his own path to follow. Meng Hao understood that, and thus would not intervene. He turned his head and looked off into the distance.\u003c/p\u003e\n\u003cp\u003eThe soil here was black, and littered with countless corpses.\u003c/p\u003e\n\u003cp\u003eSome had already petrified into stone, while others were still in a state of decay. In fact, the further one proceeded into the depths of the valley, the more slowly things seemed to be rotting and decaying. The Vale of the Godgrave was ring-shaped, with the outer areas being safer, and the danger increasing the closer one got to the center.\u003c/p\u003e\n\u003cp\u003eIf that were all there were to it, it might not be a big deal, but thunder boomed in the air up above, and countless lightning bolts crashed down, almost like a rain of lightning. And yet, what boomed loudest in his ears was not thunder, but rather, that echoing call to fight in battle!\u003c/p\u003e\n\u003cp\u003eThis place was like a Heaven-shaking and Earth-shattering sea of lightning, within which could be seen shadowy figures fighting each other. Normally, the rain of lightning which was pounding down would destroy everything beneath it, but in this case, the battle was so awe-inspiring that the effects of the lightning were negligible, whereas the intensity of the combat wreaked havoc upon all Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eIn one location, Meng Hao spotted an enormous giant made of lightning, which crackled with boundless electricity as it strode to and fro fighting invisible enemies.\u003c/p\u003e\n\u003cp\u003eFurther off, he saw war chariots flying about. As the lightning fell, it pierced through the chariots, and yet they passed through the sheets of lightning as if they weren’t even there.\u003c/p\u003e\n\u003cp\u003eThere were cultivators too, locked in magical combat, the sound of which transformed into a call to battle that caused everything to tremble.\u003c/p\u003e\n\u003cp\u003eOn the ground could be seen enormous, 3,000-meter long beasts, as well as cultivators wearing crude, ancient robes. There were also mighty mountains and rivers which seemed to be in a constant state of flux, rising, falling, and changing course with every passing moment.\u003c/p\u003e\n\u003cp\u003eMost disturbing of all were the illusory cities that popped in and out of existence, a sight that filled the heart with shock.\u003c/p\u003e\n\u003cp\u003eHowever, what was more surprising than all of that was what existed in the very center of the valley. After sending his divine sense out to cover everything, Meng Hao was able to see that there in the center... were two mountains!\u003c/p\u003e\n\u003cp\u003eExcept, they weren’t actually mountains, but giants! Each giant was fully 300,000 meters tall, with rough skin that was covered in complex magical symbols. Most notable were the stars which could be seen on their foreheads.\u003c/p\u003e\n\u003cp\u003eThose stars were gray, as if they had lost all life force. Even still, the corpses of these two giants had not rotted away, but instead, had transformed into mountains.\u003c/p\u003e\n\u003cp\u003eApparently, some sort of magical technique had been used on them, shrinking them down to only a portion of their true size.\u003c/p\u003e\n\u003cp\u003eAs soon as Meng Hao saw the two giants, and the rest of the dimension, he immediately thought back to the Ruins of Immortality in the Ninth Mountain, to that enormous tree he had seen... and the land mass beneath it... which was the corpse of a giant! [1. Meng Hao saw the corpse in the Ruins of Immortality back in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-865/\"\u003echapter 865\u003c/a\u003e and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-866/\"\u003e866\u003c/a\u003e]\u003c/p\u003e\n\u003cp\u003eThe feeling Meng Hao got from the aura of that corpse was very similar to the feeling he got from these two giants. The only difference was the disparity in size.\u003c/p\u003e\n\u003cp\u003e“Are these... Gods?” Meng Hao flickered into motion, entering into the world of lightning. He walked along casually, expression calm. With every step he took, endless amounts of lightning crashed down, and yet none of it even touched him.\u003c/p\u003e\n\u003cp\u003eThe illusory war chariots sped toward him with a towering desire to fight, but Meng Hao didn’t dodge. He let them come, and they passed right through him.\u003c/p\u003e\n\u003cp\u003eAs he walked along, he saw shocking beasts roaring, giants swinging their fists, and countless other creatures and beings.\u003c/p\u003e\n\u003cp\u003eHe saw corpses beneath his feet. At first most of the corpses were petrified stone, but more and more rotting corpses appeared, until everything was a mass of putrefying flesh.\u003c/p\u003e\n\u003cp\u003eSoon, he was passing through from the outer region of the Vale of the Godgrave into the central area. None of the illusory entities here had any effect on him.\u003c/p\u003e\n\u003cp\u003eNeither did the explosive pressure, which felt like nothing more than a cool breeze to him.\u003c/p\u003e\n\u003cp\u003eOccasionally he would stop in place to observe the illusory fighting going on around him. Often, his eyes would then flicker as if he had gained new enlightenment. After a few days passed, Meng Hao was in the central region of the Vale of the Godgrave, where he caught sight of a corpse.\u003c/p\u003e\n\u003cp\u003eAlthough it was buried in the ground beneath his feet, the entire area was being struck by so much lightning that some of the skin had become visible. It was a giant, at least 30,000 meters tall.\u003c/p\u003e\n\u003cp\u003eMeng Hao knelt down and smacked the ground with the palm of his hand. A boom echoed out, causing the soil in the area to disintegrate and reveal the enormous corpse.\u003c/p\u003e\n\u003cp\u003eHe placed his right hand on top of the giant’s head, and in the blink of an eye, the giant’s face turned crimson. A moment later, it then turned pale as a drop of blood flew out of its forehead and into Meng Hao’s hand.\u003c/p\u003e\n\u003cp\u003eHe looked thoughtfully at the golden drop of blood.\u003c/p\u003e\n\u003cp\u003eFinally, he shook his head and said, “Too many impurities. Not pure blood.” With that, he put the golden drop of blood away and proceeded along. Eventually he reached the very center of the Vale of the Godgrave. This area could be considered a restricted area for cultivators, a place where very few people could ever enter.\u003c/p\u003e\n\u003cp\u003eSeven days passed, during which time Meng Hao traveled to many places within the Vale of the Godgrave, searching high and low until he had collected fully a hundred drops of impure blood.\u003c/p\u003e\n\u003cp\u003eHe had even inspected the two gigantic corpses, from which he extracted some high quality God blood. However, all of that was not enough to experience the breakthrough he was aiming for.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Yuwen Jian had found his good fortune, and his fleshly body was currently experiencing Heaven-shaking, Earth-toppling transformations.\u003c/p\u003e\n\u003cp\u003eMeng Hao searched even longer, but couldn’t find any more God blood. His face darkened, and he felt disappointed, but at the same time, suspicious.\u003c/p\u003e\n\u003cp\u003e“I refuse to believe that the Outsiders would have the Vale of the Godgrave so heavily locked down, and yet not send any of their forces inside. There must be Outsiders in here, with the ones on the outside acting as Dharma Protectors.\u003c/p\u003e\n\u003cp\u003e“Well then, where are they?” Meng Hao flickered into motion, flying up into the air until he reached a high point where he could look down on all the lands below.\u003c/p\u003e\n\u003cp\u003eWhat he saw caused him to tremble, and a strange light to shine in his eyes. What he saw was that the lands that comprised the Vale of the Godgrave were actually about the same size as the giant upon whose back had grown the enormous tree in the Ruins of Immortality in the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eIn fact, the Vale of the Godgrave was actually a bit larger than that....\u003c/p\u003e\n\u003cp\u003eHowever, what was most shocking to Meng Hao was that the shape of the land itself... resembled a face!\u003c/p\u003e\n\u003cp\u003eThe highest mountain was the nose of that face, and the deepest valley was formed by the mouth!\u003c/p\u003e\n\u003cp\u003eFurthermore, in the forehead position, eight stars were visible, very faint, but still flickering with light! Each one of those stars was emanating fluctuations that caused Meng Hao to tremble. [1. This footnote contains some spoilers regarding Renegade Immortal. Yes, these are the same ancient Gods referred to in RI. In that novel, the cultivation system is based on stars, and an 8-star God would be somewhat analogous to the Dao Lord or Dao Sovereign level in ISSTH]\u003c/p\u003e\n\u003cp\u003e“That’s it!” he said, eyes shining brightly.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1327\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1329\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1328","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
