{"id":53676,"no":1351,"title":"Chapter 1347: A Cold Glow in the Eyes!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1347: A Cold Glow in the Eyes!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMeng Hao chuckled and suddenly raised his hand into the air, slowly clenching his fist in the direction of the painting within which hung the Outsider Dao Sovereign. It was as if he were crumpling a piece of paper into a ball; the canvas he had just created instantly transformed into ash.\u003c/p\u003e\n\u003cp\u003eThe Outsider Dao Sovereign within let out a miserable cry, and was then completely destroyed.\u003c/p\u003e\n\u003cp\u003eThe task left Meng Hao’s face slightly pale, and inwardly, he sighed. Because of the World Essence of the 1st Heaven, he had gained enlightenment of the Dao of the Eighth Hex’s Essence, which was even stronger than Meng Hao had imagined it would be. Although it was very draining, it only served to make him more convinced that his idea of using the Hexing Magics as the basis of his Essences was the correct course.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, considering my current cultivation base, I can only use this magic once per month.” That limit to the usefulness of the magical technique was the only thing that Meng Hao was disappointed in. It was based completely on the level of his cultivation base and the Essence power he could wield.\u003c/p\u003e\n\u003cp\u003eAfter all, his true cultivation base was actually in the Ancient Realm, with six extinguished Soul Lamps.\u003c/p\u003e\n\u003cp\u003e“With the Essence of Space, I can seal the 6-Essences level. That’s my limit. If I were fighting an Imperial Lord, losing would be a possibility. And as for a Paragon....” Meng Hao shook his head. He was well aware that everything was dependent on the rise of his cultivation base, and his control of more Essence power.\u003c/p\u003e\n\u003cp\u003eIn fact, his enlightenment of the Essence of Space could be likened to a vastly deep pit, at the bottom of which was a tiny lake. Eventually, though, that deep pit would become... a boundless sea of stars!\u003c/p\u003e\n\u003cp\u003eFurthermore, enlightenment of the Essence of the Eighth Hex was just the first benefit Meng Hao had gained from the World Essence. There was also a second!\u003c/p\u003e\n\u003cp\u003eAnd that was... transformations to his blood!\u003c/p\u003e\n\u003cp\u003eMeng Hao could clearly sense that, after absorbing the World Essence of the 1st Heaven, his Allheaven Dao Immortal bloodline had experienced a strange change. Although that change wasn’t large, it was a fundamental one that could shake the Heavens and topple the Earth.\u003c/p\u003e\n\u003cp\u003eHe wasn’t sure exactly what that change entailed, but he could sense that his Allheaven bloodline... was vastly different.\u003c/p\u003e\n\u003cp\u003eHe now knew that there was some completely extraordinary and astounding secret locked within the Allheaven bloodline, something that could perhaps raise him to unprecedented heights.\u003c/p\u003e\n\u003cp\u003eAfter that change occurred, his Allheaven Dao Immortal blood would experience another awakening, and he had the intense premonition... that he would reach an unbelievable level.\u003c/p\u003e\n\u003cp\u003ePerhaps that level was a Realm that had never been seen before!\u003c/p\u003e\n\u003cp\u003eAs for what that Realm was, Meng Hao didn’t know, but he did know that if he wanted to elicit such an awakening in his Allheaven blood, then he needed to absorb more World Essences.\u003c/p\u003e\n\u003cp\u003eAfter the World Essence of the 1st Heaven had been completely absorbed, a slight sliver of awakening could be detected.\u003c/p\u003e\n\u003cp\u003eIn almost the exact same instant that Meng Hao finished absorbing the World Essence, and his Allheaven Dao Immortal bloodline showed signs of another awakening, something happened back on Planet South Heaven. Shui Dongliu’s eyes suddenly flickered, and a tremor ran through him.\u003c/p\u003e\n\u003cp\u003e“Ever since that kid changed his fate, I\u0027ve been unable to see his future,” he murmured. “However, I have the feeling that he... has the chance to become... something above and beyond everything else... To reach the supreme Realm! [1. Shui Dongliu initially talked about Meng Hao “changing his fate” in the events in the Immortal Ancient Daoist Rite temple in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-819/\"\u003echapter 819\u003c/a\u003e]\u003c/p\u003e\n\u003cp\u003e“Perhaps, something even higher than that.... Perhaps he can become that which was legendary even in the Paragon Immortal Realm, that which people put faith in from the beginning of creation until now... the Immortal!\u003c/p\u003e\n\u003cp\u003e“In the Vast Expanse that is the starry sky, there is the God and the Devil, but no Immortal....” Shui Dongliu was trembling, and a look of keen anticipation and focus could be seen in his eyes as he peered out into the starry sky toward Meng Hao.\u003c/p\u003e\n\u003cp\u003e“The Immortal.... From the moment that word came to be, no person, no entity, has ever become the true Immortal.... The Immortal stands alongside the God, is on equal footing with the Devil.... Eternal in the starry sky!\u003c/p\u003e\n\u003cp\u003e“The uninformed think that the two great powers are coming because of a precious treasure. One of them seeks the return of the God, the other wishes to resurrect the Devil....\u003c/p\u003e\n\u003cp\u003e“However, the truth is that their purpose is not limited to those things. They wish to stop... the birth of the Immortal!\u003c/p\u003e\n\u003cp\u003e“By seizing the power unleashed by the birth of the Immortal, and combining it with that of their precious treasures, they can at long last accomplish their true ambitions!”\u003c/p\u003e\n\u003cp\u003eOut in the starry sky, floating in the vicinity of Meng Hao, was something no one could see. It was a ship, upon which an old man sat cross-legged, staring silently at Meng Hao. Mixed emotions could be seen in his eyes, as well as the gleam of enlightenment.\u003c/p\u003e\n\u003cp\u003eNot too far off in a different direction was Slaughter, dressed in a black robe, hovering there like an unsheathed sword. Although he was surrounded by a profoundly murderous aura, no one could sense him as he remained in place, studying Meng Hao thoughtfully.\u003c/p\u003e\n\u003cp\u003eAt the same time that Meng Hao gained a bit of enlightenment regarding the transformations to his bloodline, and a spark of anticipation rose up in his heart, something happened down in the Mountain and Sea Realm, where everyone was still reeling in shock from the sight of Meng Hao destroying the 1st Heaven and absorbing its World Essence.\u003c/p\u003e\n\u003cp\u003eAn astonishing, deafening roar rose up from the direction of the Fourth Mountain and Sea, and at the same time, a power like that of a Paragon suddenly erupted out. Simultaneously, Ksitigarbha bellowed, and yet was incapable of preventing a certain figure from bursting out from the Fourth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eIt was none other than the Outsider Imperial Lord!!\u003c/p\u003e\n\u003cp\u003eHe was at the peak of the 6-Essences level, half a step into being a Paragon!\u003c/p\u003e\n\u003cp\u003eOriginally, Ksitigarbha had been able to pin him down, but clearly he was now benefiting from the aid of the Outsider Paragon, who couldn’t break free from Sea Dream, and had apparently decided to help the Imperial Lord to break free. Now that Imperial Lord was bursting with his peak level of power, taking advantage of the fluctuations caused by the appearance of Meng Hao’s Essence to break free from Ksitigarbha and charge forth in attack.\u003c/p\u003e\n\u003cp\u003eHe was a sea of flames that shot through the void like a meteor, bursting with intense cultivation base power as he closed in on Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes glittered, and he momentarily glanced off in a different direction, which was none other than the location where Paragon Sea Dream was fighting the Outsider Paragon. Unfortunately, he was currently unable to transmit any information to Sea Dream, so he looked back at the Imperial Lord and then, instead of retreating, advanced.\u003c/p\u003e\n\u003cp\u003eThe Outsider Imperial Lord looked completely awe-inspiring, and his eyes were bursting with mad killing intent. Based on the fluctuations of his cultivation base, he was completely going all-out with his Essence power. The sea of flames transformed into a vortex, and after that, materialized five successive vortexes, each one larger than the one before it.\u003c/p\u003e\n\u003cp\u003eSix vortexes could be seen, all of them emanating Essence power that shook the starry sky and caused all onlookers to gasp.\u003c/p\u003e\n\u003cp\u003eThis terrifying power exceeded that of a Dao Sovereign; it was the most shocking level of power that existed beneath a Paragon’s.\u003c/p\u003e\n\u003cp\u003eThe power within any one of those vortexes was more than half of that of a Dao Sovereign, and in fact, two vortexes together could easily crush that level. When you added six of them together, the Essence power they emanated would enable the Imperial Lord who wielded it to crush any Dao Sovereign!\u003c/p\u003e\n\u003cp\u003eThis was the power of an Imperial Lord!\u003c/p\u003e\n\u003cp\u003eEven Ksitigarbha, who could rely on the river of reincarnation and the sea of the Yellow Springs, who had countless Yama palaces from the Fourth Mountain, and who could draw upon the Joss Flame power of innumerable dead souls, would not be able to fight back against the Outsider Imperial Lord in this state.\u003c/p\u003e\n\u003cp\u003eIn this situation, the reality was that the Outsider Imperial Lord now had enough power to wipe out Ksitigarbha. As he charged forth at top speed, he didn\u0027t rely on any magical technique or other tricks. Instead, he drew upon terrifying Essence power as he prepared to completely crush Meng Hao.\u003c/p\u003e\n\u003cp\u003eExtending both hands, he then clapped them together viciously. Rumbling sounds could then be heard as the first of the vortexes passed through him and shot toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eAs Meng Hao closed in, his hands flashed in a double-handed incantation gesture, summoning numerous mountains. He transformed into a huge azure roc, and then shot like lightning toward that incoming vortex.\u003c/p\u003e\n\u003cp\u003eA massive boom echoed out as the vortex collapsed, and Meng Hao’s mountains shattered. At the same time, his azure roc form continued to speed toward the Outsider Imperial Lord. At the same time, the second vortex screamed forth to appear directly in front of Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe resulting boom sent colors flashing through the sky and caused the stars to shudder. Meng Hao\u0027s azure roc form collapsed, and he appeared in his normal form, clenching his right hand into a fist and unleashing a fist strike!\u003c/p\u003e\n\u003cp\u003eThe vortex trembled, and then cracking sounds rang out as it collapsed into pieces. Meng Hao’s face was ashen, and he backed up a bit. It was at that point that the third and fourth vortexes closed in. The destructive power of extermination erupted out as the full power of an Imperial Lord was unleashed.\u003c/p\u003e\n\u003cp\u003eMeng Hao\u0027s face flickered. His fleshly body power was now thrumming at its peak, and his cultivation base exploded out. The Paragon Bridge appeared, and Divine Flame blasted out as he unleashed three successive fist strikes!\u003c/p\u003e\n\u003cp\u003eLife-Extermination Fist!\u003c/p\u003e\n\u003cp\u003eBedevilment Fist!\u003c/p\u003e\n\u003cp\u003eGod-Slaying Fist!!\u003c/p\u003e\n\u003cp\u003eThree fist strikes were joined by the crushing Paragon Bridge and the rumbling Divine Flame. The third vortex collapsed, and at the same time, Meng Hao coughed up a mouthful of blood. Then he fell back, relying on the strength of his fleshly body to bear the brunt of the terrifying fourth vortex and its Essence power.\u003c/p\u003e\n\u003cp\u003eA boom rang out, and blood sprayed out of Meng Hao’s mouth as he tumbled backward like a kite with its string cut. The direction in which he fell seemed to be in accord with the Outsider Imperial Lord’s plan. Unexpectedly, it was the direction leading toward where the Outsider Paragon was fighting Paragon Sea Dream.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s face fell, and he was apparently on the verge of trying to change directions when the Outsider Imperial Lord snorted coldly. Killing intent raging, he sent the fifth vortex flying forward in shocking fashion.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes glittered as his Green Emperor’s Eternal Incantation worked like mad to heal his injuries. At the same time, he raised his right hand and unleashed Demon Sealing Hexing magic. Rumbling could be heard as streams of Hexing magic shot out, bolstered by the power of the Mountains and Seas as they bore down on the fifth vortex.\u003c/p\u003e\n\u003cp\u003eSeventh Hex, Sixth Hex, Fifth Hex, Third Hex, Second Hex!\u003c/p\u003e\n\u003cp\u003eHis Eighth Hex had become Essence, but the other five Hexing magics turned into sealing marks which absorbed the power of the Mountains and Seas, causing them to grow in size to 3,000 meters as they neared the fifth vortex.\u003c/p\u003e\n\u003cp\u003eAs they slammed into the vortex, they were wiped out one by one, and Meng Hao coughed up successive mouthfuls of blood. He fell back again, the backlash power wreaking havoc upon his body. However, the fifth vortex also collapsed.\u003c/p\u003e\n\u003cp\u003eAt the same time, deep within his eyes was something that no observer would be able to detect, a cold, grim anticipation.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1346\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1348\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1347","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
