{"id":53713,"no":1388,"title":"Chapter 1385: Life or Death for the People of the Mountains and Seas!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1385: Life or Death for the People of the Mountains and Seas!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHowever, no one responded to Li Ling’er. Instead, more declarations of surrender began to ring out in the starry sky.\u003c/p\u003e\n\u003cp\u003e“I speak for the Heavenly Dao Sect....”\u003c/p\u003e\n\u003cp\u003e“I speak for the Sen Clan....”\u003c/p\u003e\n\u003cp\u003eIn the moments before the incense stick finished burning, one voice after another spoke out within the Ninth Mountain and Sea. With the exception of the sects from the Ninth Mountain itself, and some of the staunchest sects from the other Mountains and Seas, everyone seemed to be choosing to surrender....\u003c/p\u003e\n\u003cp\u003eEvery voice that spoke caused Meng Hao to sink further into silence, until... suddenly a calm voice rang out, ancient and womanly. As soon as Meng Hao heard that voice, he looked up.\u003c/p\u003e\n\u003cp\u003e“I am the will of the Ninth Sea, and I... choose to leave the Mountain and Sea Realm. I choose... to surrender.”\u003c/p\u003e\n\u003cp\u003eIn total, seven sects and eleven clans chose to surrender, as well as hundreds of thousands of individual cultivators. The final number of cultivators exceeded a million.\u003c/p\u003e\n\u003cp\u003eThe moment that those clans and sects chose to surrender, their only option was to follow the command of Shui Dongliu and leave the Mountain and Sea Realm. Staying behind was not a possibility.\u003c/p\u003e\n\u003cp\u003eThey were betrayers, and the Mountain and Sea Realm would not tolerate their presence in the final battle.\u003c/p\u003e\n\u003cp\u003eGradually, they began to make their way out of the Ninth Mountain, taking their resources and their experts with them.\u003c/p\u003e\n\u003cp\u003eThey did not delay or move slowly; they left as quickly as was possible.\u003c/p\u003e\n\u003cp\u003eThe vast number of people involved left the power of the Mountain and Sea Realm reduced by nearly thirty percent. The sight of so many cultivators taking flight caused those who remained behind to tremble inwardly; they had assumed that only a small number of people who would actually surrender.\u003c/p\u003e\n\u003cp\u003eWho could have imagined that so many would give in...? After all, even one person surrendering would be a serious blow to the morale of the Mountain and Sea Realm as a whole, especially considering that the final battle was about to be fought.\u003c/p\u003e\n\u003cp\u003eEven the Outsiders had never expected so many people to surrender. When they saw what was happening, contemptuous looks appeared on their faces, and some of them even began to laugh. A wide smile could be seen on the face of the 8-Essences male Paragon. The main reason he had attempted to drive a wedge into the forces of the Mountain and Sea Realm was because of his fear of Shui Dongliu.\u003c/p\u003e\n\u003cp\u003eAlthough the Outsider army seemed to have the upper hand, deep in his heart he wasn’t completely confident, so he wanted to reduce their power somehow.\u003c/p\u003e\n\u003cp\u003eAnd then the will of the Ninth Sea spoke out, causing the Mountain and Sea Realm cultivators’ minds to reel. The Ninth Sea was a part of the Mountain and Sea Realm, so for it to surrender....\u003c/p\u003e\n\u003cp\u003eThe meaning behind such an act was profound, and many people didn\u0027t dare to even contemplate it. That was because... the Ninth Sea declaring surrender indicated that the will of the Mountain and Sea Realm as a whole had been so weakened by the destruction of the other Mountains and Seas that it was unable to maintain control over the Ninth Sea.\u003c/p\u003e\n\u003cp\u003eIf you likened the will of the Mountain and Sea Realm to the commander in chief, then the Nine Mountains and Nine Seas were like generals. Now, sixteen of those generals were dead, and the commander in chief was so weak that of his remaining two generals, one of them chose to turn traitor.\u003c/p\u003e\n\u003cp\u003eApparently, not even Shui Dongliu had considered this would happen. An intense light began to shine in his eyes as his gaze came to rest upon the Ninth Sea, and then, he sighed.\u003c/p\u003e\n\u003cp\u003eMeng Hao trembled as he stared at the Ninth Sea, at the waves lapping across its surface, and the heads of the various sea denizens sticking up out of the water. As the Ninth Sea slowly began to move off, Meng Hao suddenly shouted in a voice like thunder, “Is this because of me?!”\u003c/p\u003e\n\u003cp\u003eIt was a question that perhaps should not have been asked, and yet, he couldn’t hold back from doing so.\u003c/p\u003e\n\u003cp\u003eAfter a long moment of silence, the will of the Ninth Sea spoke back.\u003c/p\u003e\n\u003cp\u003e“You’ve grown to the point that I regret being so stubborn back then. But... even if you didn’t exist, I would still make this choice. I am the the first and only Sea in the entire Realm to achieve self-awareness. If the Mountain and Sea Realm itself were not faced with such difficulties, then I could bow my head to its authority. But now... the Realm is about to disappear, and I don’t want to be buried along with it.” With that, the Ninth Sea flowed away from the Ninth Mountain like a retreating tide, until... the two of them were completely separated.\u003c/p\u003e\n\u003cp\u003eAs traitors left, the Mountain and Sea Realm cultivators who had chosen not to surrender felt as though their hearts were being stabbed by knives. By this point, their morale had reached rock bottom.\u003c/p\u003e\n\u003cp\u003eAnd then, the incense stick stopped burning....\u003c/p\u003e\n\u003cp\u003eHowever, the final battle didn’t begin immediately. The sects and clans who had surrendered, as well as the random cultivators, flew out in various directions, keeping their distance from each other.\u003c/p\u003e\n\u003cp\u003eAs they dispersed, the 8-Essences male Paragon hesitated for a moment before making the call for the final battle.\u003c/p\u003e\n\u003cp\u003eThe surrender of the Ninth Sea was something he took very seriously. It was with icy eyes that he examined the remaining cultivators of the Mountain and Sea, and saw how dejected they looked.\u003c/p\u003e\n\u003cp\u003eIt was in that exact same moment that someone in the Mountain and Sea Realm shouted out in rage that the traitors should be chased down and killed. Some people even began to demand of Sea Dream, Shui Dongliu, and Meng Hao, that they be allowed to do so.\u003c/p\u003e\n\u003cp\u003eSea Dream and Meng Hao maintained bitter silence, but Shui Dongliu waved his sleeve.\u003c/p\u003e\n\u003cp\u003e“If they want to go, let them go. From now on, they have nothing to do with the Mountain and Sea Realm!” Although his voice seemed calm, the 8-Essences male Paragon could detect the pain and disappointment therein.\u003c/p\u003e\n\u003cp\u003eThen, he began to laugh.\u003c/p\u003e\n\u003cp\u003eTime passed as all of the cultivators who had chosen to surrender left the Mountain and Sea Realm, and neared the Outsider army. Finally, the 8-Essences Paragon waved his hand.\u003c/p\u003e\n\u003cp\u003e“Let the final battle begin!”\u003c/p\u003e\n\u003cp\u003eRUUUUUUMMMMBLLLLE!!\u003c/p\u003e\n\u003cp\u003eInstantly, the Outsider army which surrounded the Ninth Mountain roared, and then charged toward it, bursting with killing intent and ferocity.\u003c/p\u003e\n\u003cp\u003eSoon, the front lines of the Outsider army crossed paths with the surrendering Mountain and Sea cultivators, who were trembling. Mixed feelings could be seen on their faces; after all, the Mountain and Sea Realm had once been their home....\u003c/p\u003e\n\u003cp\u003eHowever, even as the Outsider army swept past the surrendering Mountain and Sea cultivators, a lone rogue cultivator threw his head back and laughed.\u003c/p\u003e\n\u003cp\u003e“My name is Zhao Tianliang! Live for the Mountains and Seas, die for the Mountains and Seas!!”\u003c/p\u003e\n\u003cp\u003eWithout the slightest hesitation, he self-detonated. However, the sound of the explosion was insignificant compared to the army at large, and his final shout before death was similarly miniscule.\u003c/p\u003e\n\u003cp\u003eBut.... After that, more self-detonations occurred. Within the army of Outsiders that surrounded the Ninth Mountain, 1,000 self-detonations erupted. Then 10,000. Then 100,000!!\u003c/p\u003e\n\u003cp\u003eWith each self-detonation, a voice cried out, defiant, begrieved, and maddened.\u003c/p\u003e\n\u003cp\u003e“My name is Sun Youhai! Live for the Mountains and Seas, die for the Mountains and Seas!!”\u003c/p\u003e\n\u003cp\u003e“My name is Chang Yi! Live for the Mountains and Seas, die for the Mountains and Seas!!!”\u003c/p\u003e\n\u003cp\u003eRumbling echoed out that could shake Heaven and Earth. Self-detonations occurred that could strike fear into the hearts of celestial beings. Tens of thousands of explosions transformed into a mighty, destructive power. At one point, an entire sect chose to unleash all of their madness by means of self-detonation!!\u003c/p\u003e\n\u003cp\u003e“My name is Zhou Sheng! Fellow Daoists of the Mountains and Seas, if any of you manage to stay alive, commemorate this sacrifice that I make this day!!”\u003c/p\u003e\n\u003cp\u003e“My name is Liu Wenyu. If anyone survives this war, please... avenge my death!!”\u003c/p\u003e\n\u003cp\u003eMassive rumbling sounds echoed out as the entire sect self-detonated. The madness of the Mountain and Sea cultivators left the Outsiders completely shaken. As for the cultivators who stood on the Ninth Mountain, their hearts were trembling.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t just sects who made such a choice. Next, an entire clan suddenly scattered in all directions and then self-detonated, regardless of the level of their cultivation bases. As they exploded, they called out their names, and although they were loathe to part with the Mountains and Seas, their rage toward the Outsiders caused the power of their sacrifice to shake the starry sky!\u003c/p\u003e\n\u003cp\u003e“On this day, our Heavenly Dao Sect destroys our Dao. Mountain and Sea cultivators, remember what we have done this day!!”\u003c/p\u003e\n\u003cp\u003e“Our Sen Clan started this war a million strong, and now, only nine thousand remain. Our clan has been almost completely wiped out. Now, all nine thousand of us self detonate. Our bloodline will be wiped away, and yet we hesitate not. Mountain and Sea cultivators... avenge our deaths!!”\u003c/p\u003e\n\u003cp\u003e“The Li Clan... are the descendants of Lord Li. Perhaps we are not cultivators of the Mountain and Sea Realm, and perhaps we shouldn\u0027t even be here. But... this is our home! Today... we willingly destroy our Dao! Young Ling’er, you had no need to curse me, your Patriarch!!!”\u003c/p\u003e\n\u003cp\u003eMassive booms echoed out. This shocking turn of events threw the entire Outsider army into utter chaos. Even the 8-Essences male Paragon’s face fell; he could never have imagined that this would happen. At the same time, the cultivators of the Mountain and Sea Realm were trembling, and their morale erupted from the depths of despair.\u003c/p\u003e\n\u003cp\u003eThe desperate and bitter voices which echoed out caused the blood of all the cultivators of the Mountains and Seas to boil. Their eyes were crimson as they began to roar with madness.\u003c/p\u003e\n\u003cp\u003eThe words of her Patriarch echoed in Li Ling’er’s ears, and she shook as she watched her own Li Clan dying.\u003c/p\u003e\n\u003cp\u003eAs of this moment, even more self-detonations were occurring!\u003c/p\u003e\n\u003cp\u003e“Our Wintergate Sect shall destroy our Dao. Let Heaven and Earth bear witness, let the starry sky testify, that the blood of our sect shall curse the 33 Heavens to die a horrible death!!!”\u003c/p\u003e\n\u003cp\u003e“How could the Clearsky Society possibly betray the Mountains and Seas!? DIIIEEEEE!!”\u003c/p\u003e\n\u003cp\u003e“I, Dao Yunlai, am a cultivator of the Mountains and Seas. Remember my name, you villainous Outsiders!!”\u003c/p\u003e\n\u003cp\u003eBooms rang out as the self-detonations went on without end. From a distance, the glow of explosions lit up the starry sky of the Ninth Mountain, like countless blooming flowers. The only difference was that those flowers... were flowers of blood!\u003c/p\u003e\n\u003cp\u003eMeng Hao was trembling. As of this moment, he could sense that this was all part of Shui Dongliu’s plan. It had been obvious to him from the moment Shui Dongliu had mentioned allowing everyone to leave. Even still, he couldn’t help but be moved.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, he remembered something he had heard long ago, and now, the true meaning occurred to him.\u003c/p\u003e\n\u003cp\u003eAfter the Heavens were changed, the World Tree refused to surrender, and instead destroyed itself in the starry sky! [1. The World Tree destroying itself was mentioned several times throughout the story. When I went back to check some of the earlier chapters, I realized that my translation was a bit off in some of those parts. I’ve since cleaned up those passages. The most relevant and early references to the World Tree are in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-109/\"\u003echapters 109\u003c/a\u003e and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-158/\"\u003e158\u003c/a\u003e. Later chapters essentially say the same thing as those early chapters ]\u003c/p\u003e\n\u003cp\u003eIt was a Dao. It was the culmination of all types of natural and magical laws. Perhaps... it was the true Dao, the final evolution, which transformed... into something that was both illusory, and yet truly existed... the Dao!\u003c/p\u003e\n\u003cp\u003eSuddenly, Shui Dongliu called out, “Mountain and Sea Realm cultivators, if we don’t fight now, then when will we!?!?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1384\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1386\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1385","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
