{"id":53734,"no":1409,"title":"Chapter 1406: For Hope!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1406: For Hope!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis time, the bridge truly did explode, caused by Meng Hao forcibly wiping it away from his Dao. The shocking power blasted out, causing the three old men\u0027s faces to fall. They immediately had to abandon any ideas of continuing on, and instead, fell back.\u003c/p\u003e\n\u003cp\u003eNot including the muscular man, the forces of the Devil Realm Continent had three cultivators with 9-Essences cultivation bases. One was a woman, and two were men. One of those men, and the woman, were middle-aged, with the other being an old man who wore a voluminous robe and held a bone cane in one hand. All three of the 9-Essences Paragons shot toward the butterfly with all the speed they could muster.\u003c/p\u003e\n\u003cp\u003e“Nobody’s getting past me!” Meng Hao roared. He reached out with his right hand, and a bow appeared. Ignoring any potential injuries that the cold woman could inflict, Meng Hao fell back. Not taking the time to even wipe the blood from his lips, he unleashed ten arrows in quick succession!\u003c/p\u003e\n\u003cp\u003eTen shocking beams of light shot out toward the group of one woman and two men.\u003c/p\u003e\n\u003cp\u003eMassive booms rang out. Those ten arrows were backed by Meng Hao’s life force, and when they exploded, the powerful blast forced the group of three to fall back in retreat just like the three old men from the Immortal God Continent had.\u003c/p\u003e\n\u003cp\u003eAt the same time, a beam of light shot out from the Immortal God Continent, speeding toward Meng Hao in blinding fashion. The attack had been timed just as he had just unleashed ten arrows, which gave him literally no time to prepare or dodge.\u003c/p\u003e\n\u003cp\u003eRumbling sounds echoed out as the light enveloped Meng Hao within it.\u003c/p\u003e\n\u003cp\u003eBlood spurted out of wounds all over his body, and he was flung backward like a kite with its string cut. His aura was weakened, and yet, as the light faded, he teleported into the crowd of enemies. His hair was disheveled, and his chest was a mangled mass, but as he staggered to a stop he began to laugh, a shrill laughter that almost seemed like wailing.\u003c/p\u003e\n\u003cp\u003eHe faced a seemingly endless group of cultivators, including at least eight 9-Essences experts. All of them were incredibly powerful, and although none were at the peak of the 9-Essences level, merely being in the 9-Essences level at all qualified one to ride roughshod over virtually anything in the Vast Expanse.\u003c/p\u003e\n\u003cp\u003eAlmost as soon as Meng Hao teleported away from his original location, the eight 9-Essences cultivators instantly headed in his direction. Behind them were the two great land masses. Once again, a beam of bright light shot out from the Immortal God Continent, and at the same time, a roar echoed out from the Devil Realm Continent as an ancient Underworld Dragon appeared.\u003c/p\u003e\n\u003cp\u003eMeng Hao was shaking, but laughing just like before. He extended his right hand again, and the Sun Bow began to radiate boundless, dazzling light, as if it were a sun!\u003c/p\u003e\n\u003cp\u003e“No other options now. Fine... Detonate!” Meng Hao\u0027s laughter rang out as the bow, the precious treasure forged by Nine Seals himself, radiated intense light, then suddenly went still for a moment before... exploding!\u003c/p\u003e\n\u003cp\u003eThe bow transformed into a seemingly unending wave of shrapnel that exploded out in all directions. Meng Hao controlled the direction of the blast with his cultivation base, sending it tearing into the sea of his opponents.\u003c/p\u003e\n\u003cp\u003eInsane, unending power spread out in all directions. Even the eight 9-Essences experts could do nothing, and were halted in their tracks.\u003c/p\u003e\n\u003cp\u003eAs that happened, Meng Hao transformed into an azure roc, which charged forward. He only lasted for a moment before the roc was destroyed, and he was revealed, coughing up blood. However, in that moment he had managed to severely injure one of the old men from the Immortal God Continent.\u003c/p\u003e\n\u003cp\u003eThe starstone glittered in Meng Hao’s eye, transforming him into an asteroid which almost immediately crumbled to pieces. However, the result was that he managed to latch his teeth onto the head of the cold female Paragon.\u003c/p\u003e\n\u003cp\u003eShe let out a miserable shriek and shoved Meng Hao away from her, but he managed to leave her scalp bloody and mangled. Having been disfigured in such a way caused her fury to surge.\u003c/p\u003e\n\u003cp\u003eMeng Hao was coughing up blood, and his internal organs were ravaged, yet he spun and once again began to unleash carnage. Everywhere he went, countless enemies died. The Lightning Cauldron above his head flickered, and Form Displacement Transposition helped him to block the advance of the enemy forces.\u003c/p\u003e\n\u003cp\u003eApparently, it was just as he said, that he wouldn’t allow anyone to get past him!\u003c/p\u003e\n\u003cp\u003eBy this point, the butterfly was on the verge of entering the vortex. Rumbling could be heard as the beam of light from the Immortal God Continent closed in, passed by Meng Hao to strike out toward the butterfly. At the same time, the Underworld Dragon from the Devil Realm Continent roared, radiating a boundless, sinister aura of death. It was like a wind of from the underworld that covered over Meng Hao and began to rot away at his entire body.\u003c/p\u003e\n\u003cp\u003eMeng Hao once again flickered, vanishing. When he reappeared, he was in front of the beam of light, which he blocked physically with his own body.\u003c/p\u003e\n\u003cp\u003eA boom rang out, and blood spurted out of his wounds. The injury which had just been inflicted threatened to render him unconscious. And yet, his vision filled with red, and he began to laugh maniacally.\u003c/p\u003e\n\u003cp\u003e“You destroyed my Mountain and Sea Realm, you destroyed my home, you destroyed my clan, and you destroyed countless lives....\u003c/p\u003e\n\u003cp\u003e“One day, I will get my revenge for all of that. I will inflict the same pain that I feel back onto all of you, bit by excruciating bit!”\u003c/p\u003e\n\u003cp\u003eAs his bitingly venomous words rang out, the eight 9-Essences experts all had various reactions. Some sighed, some grew silent, and some appeared even more murderous than before. Others had various other mixed emotions. However, none of them ceased to attack. They simply couldn\u0027t allow Meng Hao to stay alive, nor could they allow the butterfly to escape.\u003c/p\u003e\n\u003cp\u003eThis war had been going on for many years. The first casualties had occurred tens upon tens of thousands of years ago, and therefore, it made little sense to suddenly just let the enemy get away!\u003c/p\u003e\n\u003cp\u003eAs the eight enemies closed in, followed by a sweeping flood of ordinary cultivators, Meng Hao shakily rose his hands and then spread them wide.\u003c/p\u003e\n\u003cp\u003e“Eighth Hex, Body-Spirit Hexing!\u003c/p\u003e\n\u003cp\u003e“Seventh Hex, Karmic Hexing!\u003c/p\u003e\n\u003cp\u003e“Sixth Hex, Life-Death Hexing!\u003c/p\u003e\n\u003cp\u003e“Fifth Hex....\u003c/p\u003e\n\u003cp\u003e“Fourth Hex.... Third Hex.... Second Hex.... First Hex!” Eight shining symbols appeared on Meng Hao’s forehead, which then began to swirl together into one image.\u003c/p\u003e\n\u003cp\u003e“Eight Hexes... combined!” Meng Hao roared as numerous Hexing magics appeared around him, fused together, and then transformed into an enormous vortex. The vortex rotated, rapidly growing larger as it rumbled toward his eight opponents.\u003c/p\u003e\n\u003cp\u003eTheir faces fell as they unleashed various divine abilities; the void around them shattered, and the starry sky trembled as an aura of complete extermination exploded out.\u003c/p\u003e\n\u003cp\u003eMeng Hao staggered backward, coughing up blood, and yet, it was the same with his eight opponents. All of them were injured in various ways. Behind Meng Hao, the butterfly had already begun to enter the black hole. Instead of passing into any of the rifts, it headed directly toward the deepest region, and the green coffin.\u003c/p\u003e\n\u003cp\u003eIt was at this point that a sigh rang out from the Devil Realm Continent, an ancient sigh of someone who had existed for countless, unending years.\u003c/p\u003e\n\u003cp\u003e“I had no desire to fight.... There are too many people opposed to this war, so... I’ve maintained my silence. But now, it doesn’t matter who is right and who is wrong. Since things have escalated to this point... I might as well do something.” As the words echoed out, a huge hand shot out from the Devil Realm Continent, a hand seemingly capable of pulling down the entire starry sky. Its target was the butterfly, which was now entering the black hole.\u003c/p\u003e\n\u003cp\u003eIt gently grabbed onto the butterfly, making it impossible for it to continue onward. Even as it struggled, it slowly began to be pulled back out from the black hole.\u003c/p\u003e\n\u003cp\u003eAn aura which exceeded all of the other 9-Essences cultivators erupted out. It was a 9-Essences aura to be sure, but the others could not compare to it in the slightest. If you divided up the 9-Essences level into early, mid, and late stages, then this old man was clearly in the late 9-Essences stage!\u003c/p\u003e\n\u003cp\u003eSeeing the butterfly in such danger cause a bitter smile to appear on Meng Hao’s face. But then his eyes shone with determination, and he waved both hands out, summoning the Mountain and Sea Realm with its Nine Mountains and Eight Seas.\u003c/p\u003e\n\u003cp\u003e“The Dao is in My Heart!\u003c/p\u003e\n\u003cp\u003e“The Will is in My Eyes!\u003c/p\u003e\n\u003cp\u003e“I Shall Possess the Mountains and Seas... Seal the Heavens Incantation!” Roaring, he waved his hands, and the Nine Mountains shot forward. Eight Seas exploded into motion. Massive power surged out, some of it toward the eight opponents he had been fighting, and some of it toward the huge hand from the Devil Realm Continent that was grasping the butterfly.\u003c/p\u003e\n\u003cp\u003eA sigh rang out from the Devil Realm Continent, and the hand transformed into a palm which struck out at the Nine Mountains and Eight Seas. As it closed in, the hand grew immeasurably larger, until it was just as large as the entire Mountain and Sea Realm. When it landed, the Mountains and Seas rumbled, then were summarily destroyed!\u003c/p\u003e\n\u003cp\u003eA huge shockwave blasted out that even the eight 9-Essences experts feared. And yet, without the slightest pause, they continued to fly toward Meng Hao, who was coughing up mouthfuls of blood.\u003c/p\u003e\n\u003cp\u003eThe Mountain and Sea Realm had been destroyed by a single palm strike. That was not because the Mountain and Sea Realm itself was not powerful, but rather, because Meng Hao’s cultivation base was insufficient to unleash its full power.\u003c/p\u003e\n\u003cp\u003e“My Mountain and Sea Realm....” Meng Hao said. “If I, Meng Hao, can live long enough, then the day will come when I will reforge the Mountains and Seas. If I can’t make enough Mountains, then I’ll take mountains from the Immortal God and Devil Realms. If I can\u0027t make enough Seas, then I’ll use your blood as a substitute!\u003c/p\u003e\n\u003cp\u003e“So... Mountain and Sea Realm, DETONATE!!” Blood sprayed out of Meng Hao’s mouth as his bitter words echoed out. At the same time, tears welled up in his eyes. The Mountain and Sea Realm was a precious treasure to be sure, but it was also his home.\u003c/p\u003e\n\u003cp\u003eHe was destroying his home to bury his enemies, all to make sure that his loved ones could stay alive....\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eA sound echoed out that was difficult to put into words. It was as if the entire world were roaring in fury as it fell into death. The Mountains of the Mountain and Sea Realm were destroyed!\u003c/p\u003e\n\u003cp\u003eThe Seas of the Mountain and Sea Realm shattered!\u003c/p\u003e\n\u003cp\u003eThis was a true collapse in every sense of the term, a true explosion!\u003c/p\u003e\n\u003cp\u003eThe starry sky in the vortex fell apart, and the vortex itself even seemed to stop rotating momentarily.\u003c/p\u003e\n\u003cp\u003eThe destruction of the Mountains and Seas unleashed a deadly power that swept out through the Vast Expanse. The old man who had just spoken out from the Devil Realm Continent shouted in fury and shock, but then, the voice was simply overwhelmed into nothing.\u003c/p\u003e\n\u003cp\u003eCountless cultivators from the Immortal God Continent and the Devil Realm were instantly transformed into ash. Even the eight 9-Essences experts coughed up blood and unleashed life-saving divine abilities to protect themselves.\u003c/p\u003e\n\u003cp\u003eAs for the butterfly, as the Mountain and Sea Realm exploded, it flapped its wings and shot through the black hole, carrying the Mountain and Sea cultivators toward the source of hope, the green coffin!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1405\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1407\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1406","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
