{"id":53746,"no":1421,"title":"Chapter 1418: Ninth Paragon!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1418: Ninth Paragon!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Sect Leader of the Vast Expanse School, along with the seven other Paragons, were all sitting cross-legged on the altars, looking very grim-faced.\u003c/p\u003e\n\u003cp\u003eAlthough they couldn\u0027t directly help the Ninth Paragon, the Soulseal Formation was still in place, exerting pressure onto Meng Hao’s soul.\u003c/p\u003e\n\u003cp\u003eBecause the formation only targeted cultivators who did not cultivate the magic of the Vast Expanse School, it was the most effective tool at their disposal. Unfortunately for them, when they tried to send their divine sense into Meng Hao, a powerful force rebuffed them. That only served to make Meng Hao seem more mystifying to them.\u003c/p\u003e\n\u003cp\u003eOf course, it was all because of the bronze lamp. Furthermore, it forced them to rely only on the general sensation they felt to understand what was happening. They couldn\u0027t directly observe. When you added in Meng Hao’s multifarious Demonic qi, it meant that what they sensed was often wrong.\u003c/p\u003e\n\u003cp\u003ePlus there was the fact that they couldn’t even tell exactly where Meng Hao’s soul was hiding, which made it difficult for them to judge exactly how effective the Soulseal Formation was.\u003c/p\u003e\n\u003cp\u003eIt was just as the Sect Leader had said: everything would come down to who was stronger: Meng Hao, or the Ninth Paragon.\u003c/p\u003e\n\u003cp\u003eOne of them had shocking natural talent, and had relied on his own cultivation base to become a 9-Essences Paragon in the Vast Expanse Society. He even possessed a Dao eye, which could cause shocking transformations in Heaven and Earth. The other had been propelled to the 9-Essences level via legacy, and yet regardless of whether it was in terms of his status or his background, he had reached the pinnacle of his home Realm. He had experienced countless dangers, had watched his world be destroyed, and had battled with both the Immortal God Continent and the Devil Realm Continent.\u003c/p\u003e\n\u003cp\u003eAs for which one of these two souls was stronger... the Sect Leader and the other Paragons had no way to say for sure.\u003c/p\u003e\n\u003cp\u003eThey could only wait.\u003c/p\u003e\n\u003cp\u003eDays passed one by one. Soon, half a month had gone by.\u003c/p\u003e\n\u003cp\u003eFrom the outside, there didn\u0027t seem to be anything special about Meng Hao. However, inside, a vicious battle was being fought with the soul of the Ninth Paragon. The bronze lamp ensured that the effects of the Soulseal Formation were blocked, allowing Meng Hao to fight with complete viciousness, a viciousness that the Ninth Paragon couldn’t even come close to matching.\u003c/p\u003e\n\u003cp\u003eEven more important was that Meng Hao’s soul was backed by his Demonic qi. Its maddening, multifarious nature was completely terrifying, and was a constant pressure on the Ninth Paragon.\u003c/p\u003e\n\u003cp\u003e“Dammit. Dammit!!” the Ninth Patriarch howled, although the sound was confined within the body. How could he ever have imagined that something like this would happen immediately upon his arrival?\u003c/p\u003e\n\u003cp\u003eAll of his grand aspirations, his wild ambitions, his complex machinations, and even his dream of Transcendence, were now being utterly shaken. In fact, he was even able to sense that his consciousness was starting to fade.\u003c/p\u003e\n\u003cp\u003eGradually, he had to admit that when it came to this battle of mutual consumption... he was not a match for Meng Hao!\u003c/p\u003e\n\u003cp\u003eHe wallowed in his bitterness as time passed. Meng Hao’s soul now controlled more than half of his body. In contrast, the Ninth Paragon was only growing weaker and weaker. Eventually, it reached the point where he was on the verge of being completely consumed.\u003c/p\u003e\n\u003cp\u003e“Give me a chance to live!” he wailed. “There is no enmity between us!!” Shaken, he refused to accept the idea of dying in this way.\u003c/p\u003e\n\u003cp\u003eIn almost the same moment that his words echoed out, Meng Hao’s soul paused for a moment, then swallowed what remained of the Ninth Paragon’s soul, leaving behind only a tiny strand, like a flickering spark.\u003c/p\u003e\n\u003cp\u003e“You’re right, there is no enmity between us,” Meng Hao said coolly. “I won’t kill you. I’ll leave you with this tiny soul seed. One day in the future, I’ll give you your freedom!” Even as his voice echoed out, memories and Daoist magics belonging to the Ninth Paragon exploded out within his soul.\u003c/p\u003e\n\u003cp\u003eThe power of his soul increased with maddening rapidity. In the blink of an eye, it broke past its previous limit. After all, consuming the soul of a 9-Essences Paragon counted as incredible good fortune. Although it didn\u0027t quite match up to what had happened with Shui Dongliu, it came close!!\u003c/p\u003e\n\u003cp\u003eIt was possible to imagine that, once Meng Hao regained complete control over himself, with his Vast Expanse Dao Body and increased soul power, then his battle prowess would exceed that of an ordinary 9-Essences Paragon. He wouldn\u0027t quite be at the peak, but he would definitely be in the mid 9-Essences level!\u003c/p\u003e\n\u003cp\u003eMeanwhile, the eight Paragons were still there on the altars, staring at Meng Hao with looks of vigilance and hesitation on their faces.\u003c/p\u003e\n\u003cp\u003eAfter half a month of observation, they could tell that there was no longer any chaos within Meng Hao. Clearly, one of the souls had consumed the other!\u003c/p\u003e\n\u003cp\u003eFurthermore, the soul which had emerged as the winner was now much more powerful!\u003c/p\u003e\n\u003cp\u003e“Which one of them was victorious?” said the old man in the violet-gold robe, his voice soft. The others were unwilling to offer any speculation.\u003c/p\u003e\n\u003cp\u003e“The Soulseal Formation isn\u0027t doing anything now. The Ninth Paragon must have succeeded....”\u003c/p\u003e\n\u003cp\u003e“If he did, then the Soulseal Formation would automatically cease to have any effect. However, if Meng Hao succeeded, and absorbed the Ninth Paragon’s soul, then he would also become equipped with the characteristics of Vast Expanse techniques, and the result could possibly be the same.”\u003c/p\u003e\n\u003cp\u003eEven as everyone hesitated, the Sect Leader’s eyes glittered. “We’ll know the answer soon enough!”\u003c/p\u003e\n\u003cp\u003eKilling intent swirled in his eyes, and deep inside, he sighed. As soon as he had laid eyes on Meng Hao, he had come up with the idea of using his corpse instead of the other 8-Essences Paragon corpse they had prepared. After all, a 9-Essences corpse would ensure that the Ninth Paragon’s Dao eye would retain the majority of its power.\u003c/p\u003e\n\u003cp\u003eThen the Vast Expanse Dao Body had appeared, and he was even more convinced to go through with his plan. Even though there was something suspicious about the corpse, he was confident that they could handle the situation.\u003c/p\u003e\n\u003cp\u003eActually, if it hadn’t been for the bronze lamp, the entire sequence of events would have been within his complete control.\u003c/p\u003e\n\u003cp\u003eKilling intent swirled amongst the other Paragons. If it turned out that the Ninth Paragon’s soul had been consumed in front of their very eyes, the sheer magnitude of such an affront would cause their desire to kill Meng Hao to grow even more intense.\u003c/p\u003e\n\u003cp\u003eThe same thought was running through all of their minds. “I truly hope that the Ninth Paragon was victorious!”\u003c/p\u003e\n\u003cp\u003eAs the eight Paragons looked on silently, Meng Hao continued on with the process of fully assimilating the soul. He saw the Ninth Paragon’s life, his techniques, his Dao eye, and his memories. However, he saw nothing regarding the world beyond the Vast Expanse. It was almost as if all information regarding the outside had been sealed, and though Meng Hao could sense its existence, he had no way of unlocking and viewing it.\u003c/p\u003e\n\u003cp\u003eHowever, he was made aware of the Vast Expanse School’s plans regarding the necropolis. Not a bit of that information was withheld.\u003c/p\u003e\n\u003cp\u003eTime passed. The consumption and absorption process took an entire month. Afterward, when Meng Hao had fully assimilated the Ninth Paragon\u0027s soul, he unleashed his own soul to completely fill his body.\u003c/p\u003e\n\u003cp\u003eAs that happened, he was flooded with the sensation of being able to control his own body again. His heartbeat was no longer slow and monotonous, but thrummed with life and energy, and his qi and blood flowed more and more quickly. Furthermore, his aura ceased emanating out, but was contained inside of him.\u003c/p\u003e\n\u003cp\u003eHowever, this indicated that Meng Hao’s battle prowess was completely different from before, and the pressure experienced by the other eight Paragons was now even more intense.\u003c/p\u003e\n\u003cp\u003eThe Sect Leader and the other Paragons all kept their eyes fixed fully on Meng Hao. They knew that the answer to their question would soon be revealed.\u003c/p\u003e\n\u003cp\u003eOne breath of time passed. Then another, and another....\u003c/p\u003e\n\u003cp\u003eMeng Hao’s finger twitched, and his eyelids trembled. After ten breaths of time passed, he had gathered enough strength that... his eyes opened!\u003c/p\u003e\n\u003cp\u003eWhen that happened, the surrounding eight Paragons all unleashed their power. A shapeless tempest sprang up, transforming into a power of extermination that could be sent crushing down onto Meng Hao at a moment’s notice.\u003c/p\u003e\n\u003cp\u003eHowever, Meng Hao’s expression didn\u0027t even flicker. He opened his eyes and looked up at the starry sky, blankly at first, but then with more and more lucidity.\u003c/p\u003e\n\u003cp\u003eHis mind filled with countless memories of the Mountain and Sea Realm, ending with the destruction of the Realm itself. He remembered the Mountain and Sea Butterfly fluttering toward the green coffin. He remembered the parrot wiping its mind.\u003c/p\u003e\n\u003cp\u003eMeng Hao saw all of that, and then buried it deep within him. What could be seen on his face now made him look very different from before. There was no smile, and no warmth. There was only... icy coldness.\u003c/p\u003e\n\u003cp\u003eHis entire person was like a block of ice!\u003c/p\u003e\n\u003cp\u003eHe seemed completely ambivalent toward the storm of killing intent around him as he slowly rose to a sitting position, looking around coldly at the other Paragons.\u003c/p\u003e\n\u003cp\u003eThe Paragons had been paying very close attention to everything about Meng Hao. They noticed the blankness in his eyes, and then saw them turn lucid. They could tell that he was reminiscing about the past, and they could see how cold he had become.\u003c/p\u003e\n\u003cp\u003eHowever, none of those things told them much. If the awakened soul was Meng Hao, it would make sense for him to look blank, then lucid, then recall memories, then turn icy cold.\u003c/p\u003e\n\u003cp\u003eHowever, if it was the Ninth Paragon, it would have been the same. He would have looked blankly around at the new world, then grown lucid as he realized where he was. No doubt, he would recall memories of his time outside the Vast Expanse, as well as the fight between himself and Meng Hao. In the end, he would look around at these Paragons who had dragged him into an almost fatal ambush, and of course his expression would be icy!\u003c/p\u003e\n\u003cp\u003e“Who are you?!” asked the Sect Leader. In addition to the killing intent, other mixed emotions could be seen in his eyes. Even now that Meng Hao was awake... he wasn\u0027t sure who he was.\u003c/p\u003e\n\u003cp\u003eMeng Hao turned, eyes icy as he stared at the Sect Leader. “Who do you think I am?”\u003c/p\u003e\n\u003cp\u003eTheir gazes met, and the Sect Leader’s eyes began to glow as his divine sense surged into a mighty, crushing force.\u003c/p\u003e\n\u003cp\u003e“You’re Meng Hao!!” In response to his words, the other Paragons’ faces flickered, and their killing intent surged, becoming corporeal as it bore down destructively on Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was the same as ever as he faced the combined killing intent of eight Paragons. Suddenly, a flash of light could be seen on his forehead, a violet streak that opened up to reveal an eye!\u003c/p\u003e\n\u003cp\u003eIt was none other than the Ninth Paragon’s Dao eye!\u003c/p\u003e\n\u003cp\u003eWhen the Dao eye opened, everything in the entire world went still. A consummate pressure radiated out, allowing him to stand up to the combined killing intent of all of his opponents.\u003c/p\u003e\n\u003cp\u003eIn response, their faces flickered. Simultaneously, Meng Hao rose to his feet, and as he did, wild colors flashed in the sky and a huge wind kicked up.\u003c/p\u003e\n\u003cp\u003eIt was as if a primordial and ancient will were awakening!\u003c/p\u003e\n\u003cp\u003e“I\u0027m the Ninth Paragon!” he said, his voice booming like thunder.\u003c/p\u003e\n\u003cp\u003eThe Sect Leader’s eyes flickered as he examined the Dao eye. Inwardly, he sighed and buried his suspicions deep within his heart. Suddenly, he laughed.\u003c/p\u003e\n\u003cp\u003e“Ah, you truly are the Ninth Paragon of our Vast Expanse School!” The other Paragons looked on silently. Mixed emotions could be seen in their eyes as they looked at the Dao eye, but after a moment, they also began to laugh.\u003c/p\u003e\n\u003cp\u003e“Welcome, Ninth Paragon. Welcome to the Vast Expanse!”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWho you really are doesn\u0027t matter. As long as you have that Dao eye, and can wield its power... then you are the Ninth Paragon! \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1417\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1419\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1418","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
