{"id":53756,"no":1431,"title":"Chapter 1428: The Passing of Ages in Frescoes","content":"\u003cp\u003e\u003cstrong\u003eChapter 1428: The Passing of Ages in Frescoes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTime passed, and soon Meng Hao began to tremble. His eyes grew clear, and he backed up a few steps, panting, waves of shock pounding his heart as he looked at the visions from the frescoes.\u003c/p\u003e\n\u003cp\u003e“Allheaven....” he murmured. Countless questions bubbled up in his heart, but after some thought, his eyes glittered as he left the stone chamber and proceeded along down the tunnel.\u003c/p\u003e\n\u003cp\u003eEven as he shot through the tunnel, on the bridge connecting to the first land mass up above, several figures were speeding along. With Meng Hao present, that final 30,000-meter stretch would not have taken long for the cultivators of the Vast Expanse School to pass, and would have been quite safe.\u003c/p\u003e\n\u003cp\u003eBut with Meng Hao gone, the group finally experienced the true danger of passing through that region. After only traveling 15,000 meters, they had already experienced several casualties.\u003c/p\u003e\n\u003cp\u003eEven the 9-Essences Paragons had experienced losses; all of their clones had been destroyed, and their true selves were in bad condition. In the final 15,000-meter journey, everyone drew fully on their most powerful abilities and trump cards to stay alive.\u003c/p\u003e\n\u003cp\u003eWith all of that, they eventually managed to reach the very end, although by that time, three more people had perished.\u003c/p\u003e\n\u003cp\u003eEven that was only because the Sect Leader and the other two peak 9-Essences cultivators had gone all out. Otherwise, there would have been even more casualties. In the end, all three peak 9-Essences cultivators ended up ashen-faced from the effort expended.\u003c/p\u003e\n\u003cp\u003eAlthough no words were exchanged, fury built up in the hearts of many. The stark difference between Meng Hao’s presence, and the lack thereof, caused many in the group, including the Sect Leader, to feel increasing rage toward the two other peak 9-Essences experts, as well as the Sixth and Eighth Paragons.\u003c/p\u003e\n\u003cp\u003eWhen they finally stepped off of the bridge and onto the land mass, grim expressions could be seen everywhere.\u003c/p\u003e\n\u003cp\u003eAfter a moment of silence, the Sect Leader glanced around, then looked icily at the other peak 9-Essences experts, and the Sixth and Eighth Paragons. “We walk different paths. I won’t be traveling with the four of you.”\u003c/p\u003e\n\u003cp\u003eThe others snorted coldly, then followed after him.\u003c/p\u003e\n\u003cp\u003e“Very well, that’s fine,” said Jin Yunshan, smiling. “Our mutual goal is the Transcendence Dais, which means they will also head there eventually. However, there must be other good fortune to be had in this place besides the Transcendence Dais.\u003c/p\u003e\n\u003cp\u003e“Since that’s the case, we can split up here and meet back up again at the Transcendence Dais.” With that, he waved his sleeve, sending a jade slip flying out to both the Sixth and Eighth Paragons. Then, he turned and left.\u003c/p\u003e\n\u003cp\u003eSha Jiudong shook his head and headed off in a different direction.\u003c/p\u003e\n\u003cp\u003eThe Sixth and Eighth Paragons exchanged a glance, then left with their subordinates.\u003c/p\u003e\n\u003cp\u003eMeanwhile, back in the tunnel deep below the surface of the land mass, Meng Hao was speeding along. A few days later, he arrived at a second stone chamber.\u003c/p\u003e\n\u003cp\u003eAs soon as he entered, he looked around and found that this place also had frescoes on the walls.\u003c/p\u003e\n\u003cp\u003eThe frescoes depicted numerous starry skies, each of which was filled with one Realm after another.... There were countless heavenly bodies, countless worlds, countless forms of life.\u003c/p\u003e\n\u003cp\u003eThe living beings were born and died in a ceaseless cycle of reincarnation. It was almost as if time were passing in some unique way within these frescoes. There were no written words to explain what was happening, but Meng Hao could tell that what was being depicted was the passage of endless time.\u003c/p\u003e\n\u003cp\u003eThe figure known as Allheaven gradually began to glow with light. The light grew more and more intense, until eventually, his entire person was a shining beacon. Then, unexpectedly... he began to fade away.\u003c/p\u003e\n\u003cp\u003eThe first things to disappear were his legs, then his body, and then his head. Soon, the only part of him remaining behind to prop up the boundless starry sky was his right hand. Everything else was gone.\u003c/p\u003e\n\u003cp\u003eEventually, his palm and thumb vanished, leaving behind only four fingers encircling the starry sky. Gradually, all the light was absorbed into those fingers, ensuring that they... didn\u0027t fade away, but rather, began to thrum with life force. Four unique auras began to stream out of them, indescribable auras that actually seemed more powerful than the figure itself when it was whole!\u003c/p\u003e\n\u003cp\u003eWhen Meng Hao saw what was happening, waves of shock battered at his heart.\u003c/p\u003e\n\u003cp\u003e“How could this be happening....?” he murmured.\u003c/p\u003e\n\u003cp\u003e“This... this....” Despite Meng Hao’s level of willpower, he was panting. Of those four fingers, the second had an aura that he realized was familiar.... It was a God-like aura. After a moment of confirmation, he was certain that this aura was the same as that of the statue on the Immortal God Continent.\u003c/p\u003e\n\u003cp\u003eFurthermore, the third finger of the statue radiated the same sensation as the wild and barbaric Devil Realm Continent. A Devil-like aura!\u003c/p\u003e\n\u003cp\u003eAnd then there was the first finger. Its aura was like an Immortal’s, and yet was not. It was rife with death, with the same aura as that in the necropolis of Patriarch Vast Expanse! It contained the same fluctuations as those in the Ghost City!\u003c/p\u003e\n\u003cp\u003eAnd the final finger... had a Demonic aura, which was exactly the same as Meng Hao\u0027s!\u003c/p\u003e\n\u003cp\u003e“Ghost, God, Devil, Demon!!” he thought, his mind reeling as he returned from the vision he had experienced when looking at the world in the frescoes. He began to pant as he looked at the images once again, and yet couldn’t enter that special vision he had just been in.\u003c/p\u003e\n\u003cp\u003eHis face was pale white as he stood there for a long period of time, regaining his composure. Finally, he looked up, and his eyes were shining.\u003c/p\u003e\n\u003cp\u003e“That figure was Allheaven. Perhaps he is not a living being, but... some unique entity. Because of him, the starry sky exists, the heavenly bodies exist, all life exists.... Allheaven, Allheaven....\u003c/p\u003e\n\u003cp\u003e“Clearly, he died, and was not a being that could last for all eternity. In the end, everything about him became four fingers, which are distinguished by the Ghost, God, Devil and Demon. But what about the Immortal...?\u003c/p\u003e\n\u003cp\u003e“Where is the Immortal...?” After a long moment of silence, Meng Hao flickered into motion, flashing down the tunnel, burning with the desire to lay eyes on the third set of frescoes.\u003c/p\u003e\n\u003cp\u003eA few days later, he was still speeding through the ancient tunnel. It almost felt as if he were passing through years of time until finally, there up ahead... was the third stone chamber.\u003c/p\u003e\n\u003cp\u003eHis pupils constricted, and his heart began to beat faster and faster. Almost as soon as he burst into the third stone chamber, he looked around for the frescoes.\u003c/p\u003e\n\u003cp\u003eAs expected, there was a third set of frescoes!\u003c/p\u003e\n\u003cp\u003eWhen he laid eyes on them, his mind spun, and he sank into the world depicted therein.\u003c/p\u003e\n\u003cp\u003eThis time, the world within the frescoes depicted a place Meng Hao had seen before. It was a city, in the very middle of which were nine land masses.... This fresco depicted... the necropolis of Patriarch Vast Expanse.\u003c/p\u003e\n\u003cp\u003eHowever, this was before it had become a Ghost City, back when it was still a thriving place of the living. There were countless buildings and structures, as well as innumerable cultivators. It was a bustling and flourishing place, clearly in its golden age.\u003c/p\u003e\n\u003cp\u003eHe saw a young man who looked very much like the statue of Patriarch Vast Expanse’s clone that he had seen. Perhaps this young man... was Patriarch Vast Expanse himself!\u003c/p\u003e\n\u003cp\u003eHe was sitting cross-legged in the air as countless lightning bolts struck down. Apparently, he was in the middle of facing Tribulation. Down below in the city, countless cultivators were looking on, faces filled with anticipation.\u003c/p\u003e\n\u003cp\u003ePowerful fluctuations emanated off of the young man, and when Meng Hao sensed them, he was visibly shaken. Those fluctuations exceeded the 9-Essences level, and were half a step into Transcendence. Even more shocking was that this young man’s aura... contained Immortal qi!\u003c/p\u003e\n\u003cp\u003eAbsolutely pure Immortal qi!\u003c/p\u003e\n\u003cp\u003eHe was attempting to Transcend, to pass this tribulation as the Immortal!\u003c/p\u003e\n\u003cp\u003eMeng Hao was panting as he looked at the city and the young man. It was then that he realized that the starry sky of the Vast Expanse that was depicted in this fresco had no mist in it. Instead, it was filled with countless bolts of Tribulation Lightning, seemingly endless amounts that crashed down toward the young man.\u003c/p\u003e\n\u003cp\u003eAs of this moment, Heaven and Earth, the starry sky, and the entire fresco seemed to flash with blinding lightning. Apparently it was completely unwilling to let this person Transcend as the Immortal!\u003c/p\u003e\n\u003cp\u003eAs the destructive Tribulation Lightning descended toward the young man to wipe him out, he rose to his feet and extended his hand as if to blot out the Heavens.\u003c/p\u003e\n\u003cp\u003eIn that moment, a beam of light fell from above, ripping the starry sky apart. A finger descended, a finger that Meng Hao recognized as... one of the four fingers he had seen in the second set of frescoes!\u003c/p\u003e\n\u003cp\u003eThat finger overtook the starry sky, and its descent caused everyone in the city, regardless of the level of their cultivation bases... to begin to tremble violently. Then, they were destroyed in body and soul, completely eradicated! The only ones who survived were the young man and a handful of other people!\u003c/p\u003e\n\u003cp\u003eOne finger exterminated all of the life in that huge city.\u003c/p\u003e\n\u003cp\u003eOne finger took a thriving world and transformed it into a place of death and corpses.\u003c/p\u003e\n\u003cp\u003eOne finger caused a Realm that was bursting with life force to, in the blink of an eye, be filled with nothing but an aura of death!\u003c/p\u003e\n\u003cp\u003eThe next thing that Meng Hao saw was that young man hovering there amidst the boundless aura of death, letting out a cry filled with the most profound anguish.\u003c/p\u003e\n\u003cp\u003eThen, the fresco changed. Unexpectedly, the corpses... all began to come to life again. However, their faces were twisted with bizarre smiles, as if they weren’t themselves any more. Then, they began to fly up into the air toward the young man, as if to kill him.\u003c/p\u003e\n\u003cp\u003eThe young man’s bitter laughter began to transform into wretched wailing.\u003c/p\u003e\n\u003cp\u003eThe vision ended there. It took Meng Hao a long moment to recover. When he did, he took a deep breath, and proceeded along. He wanted to see the fourth set of frescoes. He had the intense premonition that whatever was depicted on them would be... something profoundly shocking and mysterious.\u003c/p\u003e\n\u003cp\u003eWhatever secret was locked therein might even have something to do with him!\u003c/p\u003e\n\u003cp\u003eHe thought back to the destruction of the Mountain and Sea Realm, to the Demonic qi which had appeared on him, and how it had been said that the Immortal God Continent and the Devil Realm Continent didn\u0027t want the Immortal to appear in the Mountain and Sea Realm.\u003c/p\u003e\n\u003cp\u003e“Similar. Very similar. The only difference is that Patriarch Vast Expanse tried to Transcend as the Immortal, whereas in the Mountain and Sea Realm, the Immortal had only just appeared....\u003c/p\u003e\n\u003cp\u003e“Was it really the Immortal God and Devil Realm Continents who wanted to destroy the Mountains and Seas, or was it... someone else!?!?\u003c/p\u003e\n\u003cp\u003e“Why is there no text description, and why is it only possible to view the images in the fresco once...?\u003c/p\u003e\n\u003cp\u003e“What is being guarded against?\u003c/p\u003e\n\u003cp\u003e“Allheaven destroyed that whole world....” As Meng Hao flew along toward the fourth stone chamber, his mind spun with countless ideas and thoughts. At the same time, his face grew more and more grim.\u003c/p\u003e\n\u003cp\u003eBy now, he was getting the feeling that the destruction of the Mountain and Sea Realm... might not have been such a simple affair. Apparently... there was some profound secret at play!\u003c/p\u003e\n\u003cp\u003eAnd Meng Hao was uncovering a bit of that secret from these wall frescoes!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1427\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1429\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1428","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
