{"id":53762,"no":1437,"title":"Chapter 1434: Battling Jin Yunshan!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1434: Battling Jin Yunshan!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“I’ve heard that a lot in my life, you know,” Meng Hao said coolly. “When the critical moment arrives, people love to say ‘do you dare?’ Apparently, they think it actually stops people from doing something.\u003c/p\u003e\n\u003cp\u003e“I always answer in the same way....”\u003c/p\u003e\n\u003cp\u003eHis right hand flashed with an incantation gesture, and then he waved his finger toward the Eighth Paragon. It was as if a fuse had been lit. Rumbling sounds echoed out as the Eighth Paragon’s body swelled even larger, and then exploded with a huge bang.\u003c/p\u003e\n\u003cp\u003eBlood and gore splashed everywhere, becoming a rain that fell down onto the altar. It didn’t touch the Sect Leader, but landed all over Sha Jiudong and Jin Yunshan!\u003c/p\u003e\n\u003cp\u003eJin Yunshan’s face couldn’t be grimmer as he stared at Meng Hao, killing intent swirling in his eyes.\u003c/p\u003e\n\u003cp\u003e“Why don’t you say it again.” Meng Hao hovered in midair, looking coldly at Jin Yunshan. Truth be told, the only reason the Eighth Paragon fell so easily was because the long chase gave Meng Hao plenty of time to prepare. The end result was that he cut him down quickly and efficiently. Meng Hao said he would kill him, then followed up immediately!\u003c/p\u003e\n\u003cp\u003eIt was all because he had buried his Hexing magics inside the man one by one, resulting in that final shocking scene.\u003c/p\u003e\n\u003cp\u003eSilence reigned. Shangguan Hong and the other Paragons looked on silently, mixed emotions visible in their eyes as they looked at Meng Hao. Just now, Meng Hao had used his actions, not just his words, to explain to everyone what exactly it meant to be domineering!\u003c/p\u003e\n\u003cp\u003eJin Yunshan suddenly laughed in a very sinister fashion. As the sound echoed out, he slowly stood, eyes growing even icier as he stared at Meng Hao.\u003c/p\u003e\n\u003cp\u003e“You killed the Sixth and Eighth Paragons, so now you want to kill me?” Colors flashed in the sky and a huge wind kicked up. Everything twisted and distorted as an enormous, 5,000-kilometer windstorm appeared.\u003c/p\u003e\n\u003cp\u003eEveryone from the Vast Expanse School had serious expressions on their faces as they slowly backed up, not daring to get close to the enraged Jin Yunshan.\u003c/p\u003e\n\u003cp\u003eThey were all aware that although Jin Yunshan looked like a young man, he had actually practiced cultivation for ages upon ages, and was in fact on almost equal footing with the Sect Leader.\u003c/p\u003e\n\u003cp\u003eHe had an unstable personality inclined to fits of rage, and was incredibly vicious. The louder he laughed, the more infuriated he was.\u003c/p\u003e\n\u003cp\u003e“That’s exactly what I want,” Meng Hao said coolly.\u003c/p\u003e\n\u003cp\u003eWhen Jin Yunshan heard Meng Hao’s response, it was as if he had just heard the most hilarious joke in the entire world. He threw his head back and laughed uproariously. At the same time, lightning crackled in the sky and thunder boomed. Jin Yunshan suddenly stepped forward, turning into a blur of afterimages. The space between him and Meng Hao seemed to collapse, and countless rifts opened up.\u003c/p\u003e\n\u003cp\u003eJin Yunshan moved so quickly that apparently the air couldn’t withstand the speed and was destroyed. In the blink of an eye, he was directly in front of Meng Hao.\u003c/p\u003e\n\u003cp\u003e“You’re just a stray dog with no home to go back to, and you dare to challenge me to a fight?!” Jin Yunshan reached out and stabbed his finger toward Meng Hao’s chest.\u003c/p\u003e\n\u003cp\u003eHis finger immediately erupted with the intense power of a peak 9-Essences cultivation base. Jin Yunshan did not underestimate opponents in battle; he unleashed all of the power he had at his disposal.\u003c/p\u003e\n\u003cp\u003eAlthough he seemed to be in a fury, he was actually in complete control of his emotions. He realized that Meng Hao had killed the Eighth Paragon in an attempt to rile him mentally. To cultivators of this level, something like that could prove to be fatal!\u003c/p\u003e\n\u003cp\u003eIn fact, the words he had spoken to Meng Hao just now had likewise been intended to sow chaos.\u003c/p\u003e\n\u003cp\u003eMeng Hao remained completely calm in response to the unleashing of the finger attack. He extended his right hand and waved his sleeve, causing Essence of Divine Flame to erupt out, combined with Hexing magic as well as the power of his fleshly body. The Heaven-shaking, Earth-shattering power that resulted was a blow struck by an entire world. A huge boom echoed out, and Meng Hao staggered backward several paces. Even as he looked up, Jin Yunshan’s eyes flickered with killing intent, and he closed in for another attack.\u003c/p\u003e\n\u003cp\u003e“The peak of 9-Essences... is pretty impressive.” Meng Hao’s eyes gleamed with the desire to fight. He burst into motion, and in the blink of an eye, was fighting all out with Jin Yunshan.\u003c/p\u003e\n\u003cp\u003eMassive booms rang out. Meng Hao was like a monster. Sometimes he was completely domineering, and pressed the attack viciously. But in his multifariousness, he would then dance away like a wisp of smoke. A moment later, a brutal aura would rise up, like some monstrous beast.\u003c/p\u003e\n\u003cp\u003eJin Yunshan attacked with the power of the peak of 9-Essences. Although he didn’t use any majestic divine abilities, his cultivation base and fleshly body, in fact, everything about him, was in the great circle of his level; all of it merged together, allowing him to deliver attacks that could shake Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the two of them had exchanged so many volleys that it was impossible to keep track of how many. Blood was oozing out of Meng Hao’s mouth as he fell back. As for Jin Yunshan, his face was a bit ashen as he glared at Meng Hao, the killing intent in his eyes growing more intense. Apparently, he wasn’t too surprised at Meng Hao’s level of battle prowess. To him, it was only natural that Meng Hao would be beyond the ordinary 9-Essences level, considering that he had already killed the Sixth and Eighth Paragons.\u003c/p\u003e\n\u003cp\u003e“You overestimate yourself!” he said with a cold snort. Killing intent flickered as he waved his right hand. In response, boundless golden light shone as numerous razor-sharp golden thorns shot out.\u003c/p\u003e\n\u003cp\u003eUpon closer examination, they weren’t thorns, but were actual beams of golden light. In the blink of an eye, Jin Yunshan summoned a golden sun around him, which grew larger and more majestic by the moment. Everything began to shake violently; it was as if this sun had supplanted the sun of this entire world!!\u003c/p\u003e\n\u003cp\u003e“Dao of a Golden Sun; Magic of an Exalted Celestial!” Jin Yunshan spread his arms wide, causing massive amounts of the energy of Heaven and Earth, as well as the aura of the Vast Expanse, to surge toward him. His energy rocketed up, and grave expressions could be seen on the faces of the group from the Vast Expanse as they once again backed away, unwilling to get caught up in the power on display.\u003c/p\u003e\n\u003cp\u003eEven as they backed up, Jin Yunshan’s hands flashed in a double-handed incantation gesture, and he shoved them out violently. Rumbling sounds echoed out as the golden sun began to twist and distort, transforming into... a seemingly endless cloud of golden flying swords!\u003c/p\u003e\n\u003cp\u003eIt seemed impossible to count the number of swords, and everyone present felt their scalps tingling in shock at the sight. The 9-Essences Paragons reacted a bit less dramatically, but the 8-Essences Paragons gasped.\u003c/p\u003e\n\u003cp\u003eFrom the look of it, there were hundreds of millions of them!\u003c/p\u003e\n\u003cp\u003eHundreds of millions of golden flying swords shot out, swirling through the air to form the image of what looked like a sun.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1433\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1435\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1434","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
