{"id":53782,"no":1457,"title":"Chapter 1454: You Screwed Us Over....","content":"\u003cp\u003e\u003cstrong\u003eChapter 1454: You Screwed Us Over....\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn response to the Dao Protector’s words, a radiant smile broke out on the young man’s face. As the grandson of Patriarch Chi Feng of the Eighth Sect, he had free reign to do anything he wished in his sect.\u003c/p\u003e\n\u003cp\u003eAfter the Eighth Sect’s 9-Essences Paragon perished, Patriarch Chi Feng had returned from the excursion to the necropolis and worked hard at cultivation until he was on the verge of a breakthrough. He was the most powerful expert in the Eighth Sect, and if he broke through to the 9-Essences level, he would become the official leader of the Eighth Sect, and would also become one of the nine great Paragons of the Vast Expanse School.\u003c/p\u003e\n\u003cp\u003ePeople like that were truly at the pinnacle of the Vast Expanse School, and that was one of the reasons why this young man could have his pick of almost any female cultivator he wanted to use as a cultivation vessel.\u003c/p\u003e\n\u003cp\u003eOf course, he was very careful. If a girl had connections or a powerful background, then he would give up any notions of even so much as touching her. Because of that, Patriarch Chi Feng, despite being aware of the situation, felt that the young man was still relatively dependable, and wouldn’t do something that made him a liability.\u003c/p\u003e\n\u003cp\u003eSmiling in response to the Dao Protector’s words, the young man said, “Well, there’s no hurry. A cultivation vessel like that is a rare thing in the Eighth Sect nowadays. Who would have thought that I would get something so wonderful here? Excellent, excellent.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, we\u0027re still in the Ninth Sect, and the Patriarch reminded me before that I can’t act presumptuously here....\u003c/p\u003e\n\u003cp\u003e“Ah well, it doesn’t matter. I’ll just figure out a way to get this cultivation vessel back to the Eighth Sect.” The licentious gleam once again flickered in his eyes.\u003c/p\u003e\n\u003cp\u003eOver the following few days, Yan’er and her companions traveled with the group from the Eighth Sect. They came to realize what a high position the young man held, and treated him with the utmost respect. Eventually, they reached the location of the bazaar, and arranged for their accommodations. On the night of the first day, Yan’er was filled with excitement and anticipation for the following days. Just as she was about to slip into a trance to do some meditation, a vortex suddenly sprang up around her. It happened without any sound or warning, and before Yan’er was even aware of what had happened, it was on the verge of swallowing her up.\u003c/p\u003e\n\u003cp\u003eIn that moment, a howl rose up in the air outside of the bazaar. It was none other than the mastiff, who Meng Hao had arranged to secretly guard Yan’er on her trip.\u003c/p\u003e\n\u003cp\u003eThe mastiff’s eyes flickered with killing intent as it transformed into a beam of red light that flew into the air at high speed.\u003c/p\u003e\n\u003cp\u003eAt the same time, in a valley about 500 kilometers outside of the bazaar, Patriarch Chi Feng’s grandson was standing there looking at a vortex spinning in front of him. His Dao Protector, the middle-aged cultivator in the Dao Realm, stepped out holding an unconscious girl, who was none other than Yan’er.\u003c/p\u003e\n\u003cp\u003eWhen the young man saw Yan’er, he smiled and reached out to grab her, the carnal gleam in his eyes growing stronger.\u003c/p\u003e\n\u003cp\u003eThe Dao Protector’s expression softened. This sort of thing was a simple matter for him, and something he had done on numerous occasions. He cleared his throat, and was just about to say something, when a sudden howl ripped through the valley.\u003c/p\u003e\n\u003cp\u003eThe abruptness of the sound caused the Dao Protector\u0027s face to fall. Even as he turned, a red streak of light shot toward him.\u003c/p\u003e\n\u003cp\u003eRumbling sounds echoed out, and the entire valley began to collapse. The Dao Protector coughed up a mouthful of blood as he was sent tumbling off into the distance, seriously injured. An expression of astonishment filled his face at the sight of the large crimson dog which had just appeared.\u003c/p\u003e\n\u003cp\u003e“Th-that\u0027s... a Dao Realm beast!!\u003c/p\u003e\n\u003cp\u003e“Dammit, how could there be a Dao Realm beast here!?!?” The young man was so terrified he was shaking. Grabbing Yan’er, he shot backward. By this point, she had regained consciousness, and it took only a moment for her confusion to fade, whereupon she began to scream.\u003c/p\u003e\n\u003cp\u003e“Shut up!” the young man bellowed. Even as the words left his mouth, the mastiff’s eyes blazed with killing intent, and it began to speed in his direction.\u003c/p\u003e\n\u003cp\u003e“It’s... it\u0027s after the girl!” The Dao Protector was shaken. How could he ever have imagined that grabbing a young girl in the Foundation Establishment stage would attract the attention of a Dao Realm beast?\u003c/p\u003e\n\u003cp\u003e“Prince, get out of here. Something\u0027s off here! Something’s not right!” The Dao Protector had no time to think about the matter. However, he could tell that there was something very strange about what was happening. Almost as soon as the words left his mouth, the young man pulled out a jade pendant that had been hanging around his neck, and crushed it.\u003c/p\u003e\n\u003cp\u003eInstantly, a powerful teleportation force erupted out. However, it didn’t seem fast enough to get him away from the dog. The young man’s eyes suddenly flared with a vicious gleam. He might seem like a carefree young man, but he wasn’t stupid. His hand clamped around Yan’er’s neck, and he glared at the mastiff.\u003c/p\u003e\n\u003cp\u003e“If you take one more step, I’ll kill her!” he screamed. The mastiff stopped in place, and in that moment, the power of teleportation exploded out. The young man and Yan’er vanished in the blink of an eye. In that same instant, the mastiff howled and unleashed an attack, causing a huge crater to appear in the spot where the young man had just been standing.\u003c/p\u003e\n\u003cp\u003eThe Dao Protector’s scalp was tingling, but it was without any hesitation that he sped backward. His mind was in complete chaos; this Dao Realm beast had obviously been tamed, and anyone who could tame a Dao Realm beast would clearly have an incredible cultivation base.\u003c/p\u003e\n\u003cp\u003eSeeing Yan’er disappear caused the mastiff to throw its head back and let out an astonishing roar. It erupted with energy as its body grew larger, and it transformed into a beam of blood-colored light which sped toward the middle-aged Dao Protector. Before the man could even react, the mastiff chewed him up and swallowed him down.\u003c/p\u003e\n\u003cp\u003eOnly a bloodcurdling scream lingered behind. Even in the last moment before his death, he couldn’t fathom how a little Foundation Establishment cultivator could have caused such a disaster.\u003c/p\u003e\n\u003cp\u003eOf course, he had no way to know that the catastrophe resulting from what he and the young man had done, was only the beginning. As for the person he thought was a nobody in the sect, a trifling Inner Sect disciple named Fang Mu, even in death, he would never be able to guess his true identity.\u003c/p\u003e\n\u003cp\u003eAs Yan’er faded away, the mastiff howled.\u003c/p\u003e\n\u003cp\u003eDeep within Planet Vast Expanse, on the half-planet, was Ninth Paragon City.\u003c/p\u003e\n\u003cp\u003eThere, Meng Hao’s true self suddenly opened his eyes, and they shone with unprecedented coldness. Dragons usually have one weak scale on their bodies. People likewise have weak spots. For Meng Hao, it was the Mountain and Sea Realm, his family, and his friends. Originally, he had no such weakness now that he was living on Planet Vast Expanse.\u003c/p\u003e\n\u003cp\u003eBut when Chu Yuyan appeared, Meng Hao knew... that she was his weak spot!\u003c/p\u003e\n\u003cp\u003eAnyone who touched her was prodding the most sensitive part of Meng Hao!\u003c/p\u003e\n\u003cp\u003eTouching that weak spot would provoke wrath that could shake Heaven and Earth, and even the Vast Expanse!\u003c/p\u003e\n\u003cp\u003eThe clouds in the sky above Planet Vast Expanse were churning. Lightning crackled, and strange colors flashed in the sky. The wind screamed, and countless individuals on the surface of the planet looked up in shock.\u003c/p\u003e\n\u003cp\u003eAt the same time, all of Ninth Paragon City, all of the half-planet, all of the inner starry sky, and all of Planet Vast Expanse itself filled with rumbling sounds.\u003c/p\u003e\n\u003cp\u003eThis was the second time that such a thing had happened, the first being when Meng Hao had initially caught sight of Chu Yuyan’s soul. Now... for the second time, a towering murderous aura erupted out, causing everyone on Planet Vast Expanse, even the Paragons, to be shaken inwardly.\u003c/p\u003e\n\u003cp\u003eJin Yunshan, Sha Jiudong, and the Sect Leader were all in shock as they saw Meng Hao’s true self step out into the open.\u003c/p\u003e\n\u003cp\u003e“That murderous aura,” said Jin Yunshan with a gasp. “He’s... he’s going to kill someone!!” After sensing Meng Hao’s aura, his eyes filled with vigilance.\u003c/p\u003e\n\u003cp\u003eSha Jiudong had the same reaction, and as for the Sect Leader, he immediately left his meditation facilities. Other Paragons, both 8-Essences and 9-Essences, were all shaken.\u003c/p\u003e\n\u003cp\u003ePatriarch Chi Feng in the Eighth Sect was equally shaken. When he detected Meng Hao’s aura, he thought about how he had mercilessly cut down the Eighth Paragon years ago in the necropolis.\u003c/p\u003e\n\u003cp\u003e“I wonder what unlucky fellow managed to provoke that jinx....” he murmured. Then he paid the matter no more heed, and closed his eyes in meditation.\u003c/p\u003e\n\u003cp\u003eMeanwhile, on the eighth continent, in the Eighth Sect, teleportation light twinkled. Patriarch Chi Feng’s grandson, the young man, emerged with Yan’er. His face was pale, and he looked as if he had been roughed up, but his eyes glittered with viciousness.\u003c/p\u003e\n\u003cp\u003e“Dammit. Dammit!” he roared. “Who is it that dares to provoke me, the Prince!?!?\u003c/p\u003e\n\u003cp\u003e“That was some trifling Dao Realm beast, nothing more. I\u0027m gonna kill it. I\u0027m gonna... I’m gonna eat it!\u003c/p\u003e\n\u003cp\u003e“I don’t care who owns it. Anybody that provokes me will have their whole clan wiped out!!” He looked down at Yan’er, whose face was ashen and filled with terror.\u003c/p\u003e\n\u003cp\u003e“W-what... what are you going to do to me?” she stammered. “My Master won’t let you get away with this. He--”\u003c/p\u003e\n\u003cp\u003e“Shut up! Who’s your master? Fang Mu? A measly Inner Sect disciple? He’s a nobody that doesn’t even qualify to shine my shoes!” With that, the young man lifted his hand up and slapped Yan’er right across the face. Her cheek instantly swelled up, and blood oozed out of the corners of her mouth. She began to tremble, and a look of complete terror could be seen on her face.\u003c/p\u003e\n\u003cp\u003eHer entire life had been one free from care or worry, so what was happening now made her realize how fragile life really was. She felt helpless, as though she were about to be completely consumed by terror.\u003c/p\u003e\n\u003cp\u003e“Master... Master....” She began to weep in fear. She wanted to see her family, her Master, but instead, everything around her was strange. She wasn’t sure what was going to happen to her, and it left her shaking in fear.\u003c/p\u003e\n\u003cp\u003eThe young man’s expression was cruel as he threw his head back and roared, “Men, come!!\u003c/p\u003e\n\u003cp\u003e“Someone’s trying to kill me! Patriarch, save me!!” As the boy’s words echoed out, the Eighth Sect was thrown into an uproar. Countless figures emerged, and when they saw Yan’er, they frowned, but didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Someone’s trying to kill me!!” he bellowed.\u003c/p\u003e\n\u003cp\u003eThe young man’s shouting provoked a response, not from Chi Feng, but from a Dao Sovereign who flew out from within the Eighth Sect. “Who’s trying to kill you? I thought you just went to the ninth continent?”\u003c/p\u003e\n\u003cp\u003eAs soon as he appeared, everyone clasped hands respectfully.\u003c/p\u003e\n\u003cp\u003e“Dad, I was on the ninth continent when I took a liking to this cultivation vessel. Then a Dao Realm beast... tried to kill me! It really tried to kill me!” Considering his quavering voice, and the way his clothes were ripped and torn, it was obvious that he had been fleeing for his life, and had used the teleportation device given him by the Patriarch.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1453\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1455\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1454","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
