{"id":53784,"no":1459,"title":"Chapter 1456: Who Else?","content":"\u003cp\u003e\u003cstrong\u003eChapter 1456: Who Else?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt was the swollen mark left behind by a vicious slap to the face. When Meng Hao saw it there on Yan’er’s face, he said nothing. However, the coldness radiating off of his body grew with explosive intensity, filling the entire area. It was as if Heaven and Earth were furious, as if the entire world were trembling with rage.\u003c/p\u003e\n\u003cp\u003eCracking sounds echoed out as the ground shattered. The mountains which had previously collapsed were seemingly erased out of existence, transformed into nothing more than ash as an intense, indescribable pressure weighed down.\u003c/p\u003e\n\u003cp\u003eBlood sprayed out of the young man’s mouth as he was sent tumbling backward. The Dao Sovereign also coughed up blood, and his legs trembled so hard that it seemed as if his kneecaps would shatter. The crushing pressure forced him to kneel down onto the ground, as did all of the other cultivators in the area.\u003c/p\u003e\n\u003cp\u003eThey were incapable of standing up to the pressure, to the rage of Heaven and Earth, to the icy coldness radiating out of Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe pressure was such that they felt they couldn’t hold on for very much longer. Even Patriarch Chi Feng, an 8-Essences Paragon on the verge of breaking through to 9-Essences, had the same reaction.\u003c/p\u003e\n\u003cp\u003eIt was as if... an enormous hand had descended from up above... a hand to return the slap which had been inflicted onto Yan’er. Apparently, Meng Hao didn’t have to make an actual move at all: that pressure alone was enough to wipe the Eighth Sect completely off of Planet Vast Expanse.\u003c/p\u003e\n\u003cp\u003e“Exalted... exalted Ninth Paragon....” the Dao Sovereign stammered. He had no choice but to speak. If he didn’t, he would be wiped out of existence by that incredible pressure.\u003c/p\u003e\n\u003cp\u003eEven as the words left his mouth, colors flashed in the sky as numerous beams of light flew through the air at incredible speed. A moment later the Sect Leader appeared, along with the other 9-Essences Paragons.\u003c/p\u003e\n\u003cp\u003eEven Jin Yunshan and Sha Jiudong appeared, to hover there in midair, looking down. None of them spoke.\u003c/p\u003e\n\u003cp\u003eEven the Sect Leader was unsure of whether Meng Hao intended to actually destroy the entire Eighth Sect.\u003c/p\u003e\n\u003cp\u003eSome of them looked over at Yan’er, eyes glittering thoughtfully.\u003c/p\u003e\n\u003cp\u003eMeng Hao didn\u0027t seem to care at all that the group of 9-Essences Paragons had arrived. He had long since thought the matter through clearly. As of now, he was harboring no secrets. If people knew about Yan’er, fine. If they didn’t, it was also fine. In his current state of mind, he truly didn’t care what people thought.\u003c/p\u003e\n\u003cp\u003e“Who hit you?” he asked, looking over at Yan’er. Before she could even respond, his gaze fell upon the young man. “Was it him?”\u003c/p\u003e\n\u003cp\u003eAs the words left the mouth, power from seemingly nowhere crushed down onto the young man. He screamed and struggled to back up, blood spurting out of wounds all over his body.\u003c/p\u003e\n\u003cp\u003e“I didn’t do it on purpose!” he cried in a pleading voice. “I... I didn\u0027t know, I... I...” He was trembling from fear, true fear that had reached the pinnacle. He was even more scared than Yan’er had been only moments ago.\u003c/p\u003e\n\u003cp\u003eEven in his wildest dreams, he would never have imagined that a simple outing in which he took a liking to a cultivation vessel, would result in something like this. It was something he had done many times in the past, but this time... unexpectedly... he had provoked a disaster.\u003c/p\u003e\n\u003cp\u003eAs of this moment, hatred for his Dao Protector burned all the way down to his bones. He wished he could rip the man to shreds. After all, it was impossible to forget how the Dao Protector had told him... to enjoy himself with the girl.\u003c/p\u003e\n\u003cp\u003eWithout the Dao Protector\u0027s assurances, the young man would never have touched a girl with such incredibly high connections.\u003c/p\u003e\n\u003cp\u003eFurthermore, deep in his heart, he almost found it too fantastic to believe, this Yan’er had such a background, and yet... Why the hell didn’t you say anything? If you had said something, I would’ve at least confirmed it, even if I didn’t believe you. The worst thing is, you’re backed by someone so powerful he can kill us all with a single word, and yet... you didn\u0027t say anything!!\u003c/p\u003e\n\u003cp\u003eThe young man felt as if he had been deceived, wronged. However, before he could say another word, Yan’er glared at him and said in a loud voice: “Yeah, it was him!!”\u003c/p\u003e\n\u003cp\u003eHer words were like a death sentence. The young man’s vision turned dark as Meng Hao waved his finger, sending killing intent speeding toward his forehead.\u003c/p\u003e\n\u003cp\u003eA pop could be heard as the boy’s head exploded into a cloud of blood and gore, killing him instantly.\u003c/p\u003e\n\u003cp\u003eMeng Hao slaughtered him as easily as if he had popped the neck of a baby chicken. However, his rage was not sated.\u003c/p\u003e\n\u003cp\u003e“And him!” Yan’er cried, pointing at the Dao Sovereign. “He... he just said that he was going to go cause trouble for my Master!” Shock filled the Dao Sovereign’s face, and a sensation of deadly crisis exploded within him. His hatred for his own son was no less than the son’s hatred for his Dao Protector.\u003c/p\u003e\n\u003cp\u003e“Dammit! DAMMIT!” A tremor ran through him, and he was just about to say something in his defense when Meng Hao’s eyes flickered coldly. He waved his right finger, and the Dao Sovereign’s head exploded, killing him just as his son had been killed.\u003c/p\u003e\n\u003cp\u003eBefore dying, the Dao Sovereign’s venomous hatred rose to intense heights. Strangely, he didn’t hate Meng Hao so much as he hated his unfilial son. He could never have imagined that all the honor and glory he had built up in his lifetime would be wiped away by someone his own son had provoked.\u003c/p\u003e\n\u003cp\u003eEveryone in the area was trembling.\u003c/p\u003e\n\u003cp\u003e“And those people too!” Yan\u0027er said through gritted teeth, pointing out at the crowd. “All of them wanted to go cause trouble for my Master too!” Although it was impossible to tell exactly who she was pointing at, as her finger swept out over the crowd, they felt as if the gaze of the underworld were boring into their hearts.\u003c/p\u003e\n\u003cp\u003e“Him?” Meng Hao asked, pointing out an old man from Chi Feng’s bloodline, who had been coldly preparing to go to the ninth continent. The man trembled, and before he could even speak a word, his head exploded.\u003c/p\u003e\n\u003cp\u003e“And him?”\u003c/p\u003e\n\u003cp\u003e“Him too?”\u003c/p\u003e\n\u003cp\u003e“What about him?”\u003c/p\u003e\n\u003cp\u003eMeng Hao’s voice was cool. Every time he spoke, Yan’er would nod, and heads would explode. None of them even had a chance to cry out.\u003c/p\u003e\n\u003cp\u003eSoon, the ground was awash with blood. Meng Hao had killed dozens of people with brutal efficiency, all of whom had been preparing to join Chi Feng’s bloodline to go to the ninth continent.\u003c/p\u003e\n\u003cp\u003eAs for the ones who had been hesitating earlier, Meng Hao didn\u0027t ask about any of them.\u003c/p\u003e\n\u003cp\u003eThere were some people who had been preparing to join Chi Feng’s bloodline who stood there ashen-faced as they waited for Yan’er to call them out. However, because of some bit of confusion on her part, she shook her head when it came to them. Tears streamed out of the eyes of those cultivators as they realized that they had just narrowly escaped death. Their gratitude toward Yan’er simply couldn\u0027t be expressed in words.\u003c/p\u003e\n\u003cp\u003eThe entire Eighth Sect was as silent as death. Everyone was on their knees, trembling, as Meng Hao gave vent to his rage like a spirit of death.\u003c/p\u003e\n\u003cp\u003eIt was at this point that the Sect Leader cleared his throat.\u003c/p\u003e\n\u003cp\u003e“Ninth Paragon, calm down... the punishment has been carried out. You’re not really going to wipe out the entire Eighth Sect are you?”\u003c/p\u003e\n\u003cp\u003eMeng Hao looked over at the Sect Leader and asked, “I couldn’t possibly wipe out the entire sect. However, don’t think things are over yet.”\u003c/p\u003e\n\u003cp\u003eWith that, he looked into the depths of the Eighth Sect, and spoke out in a voice that crashed like thunder.\u003c/p\u003e\n\u003cp\u003e“Chi Feng, get the hell out here!” He flicked his sleeve, causing rumbling sounds to fill Heaven and Earth. Patriarch Chi Feng emerged from the depths of the sect, his heart filled with hatred toward his son and grandson. His face was taut with bitterness, and as pale as death. Inwardly, he was roaring in rage, although not toward Meng Hao, but rather, toward his son and grandson.\u003c/p\u003e\n\u003cp\u003eTo him, not even death could expunge the deeds committed by those two, which had sucked him into a catastrophe....\u003c/p\u003e\n\u003cp\u003eWithout the slightest hesitation, he flew through the air to appear directly in front of Meng Hao.\u003c/p\u003e\n\u003cp\u003eInstantly, he clasped hands and bowed deeply.\u003c/p\u003e\n\u003cp\u003e“Chi Feng... offers greetings... greetings to the exalted Ninth Paragon.” His heart trembled as he completely ignored the corpses of his son and grandson. If he could, he would have killed them himself.\u003c/p\u003e\n\u003cp\u003eOther people might not know what it was like to face an enraged Meng Hao, but how could he not know? He had personally witnessed Meng Hao cut down the Eighth Paragon in the necropolis, and had also watched his battle with Jin Yunshan. He was well aware that Meng Hao was invincible when inside the necropolis, and was a figure of incomparable terror.\u003c/p\u003e\n\u003cp\u003eChi Feng gritted his teeth. He knew full well that because of what had occurred today, he had to offer compensation, otherwise he would be killed. To the masses, he was a preeminent 8-Essences Paragon, someone who would soon reach the 9-Essences level and become the ruler of the Eighth Sect.\u003c/p\u003e\n\u003cp\u003eHowever, he knew that even if he became the new Eighth Paragon, he would still have to bow his head to the Ninth Paragon. He couldn\u0027t simply wait for Meng Hao to demand compensation for what had happened. He had to admit fault and take responsibility. Therefore, he quickly lifted his hand up and smashed his palm onto his forehead.\u003c/p\u003e\n\u003cp\u003eA boom rang out, and he shivered as a rift tore open on his forehead, from within which blood sprayed like a fountain. His body then exploded.\u003c/p\u003e\n\u003cp\u003eHis soul flew out, trembling and clasping hands toward Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Ninth Paragon, please calm your wrath....” he said, prostrating himself.\u003c/p\u003e\n\u003cp\u003eThe surrounding cultivators gasped in response to what they were seeing. Everyone in the Eighth Sect was paying rapt attention, and now their hearts trembled with fear and awe as they looked over at Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao eyed Chi Feng’s soul, and calmed down somewhat. If Chi Feng hadn’t been so straightforward, if he had waited for Meng Hao to speak, then he might not have ended up dead, but he would have been forever cut off from the 9-Essences level.\u003c/p\u003e\n\u003cp\u003eNow, his fleshly body was destroyed, which would be a big setback, but wouldn\u0027t prevent him from obtaining his ninth Essence.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked deeply at Patriarch Chi Feng, then turned away, taking Yan’er with him as he left the eighth continent.\u003c/p\u003e\n\u003cp\u003eAlong with his departure, the intense pressure weighing down on the Eighth Sect faded away. Everyone breathed sighs of relief. This day was one the cultivators of the Eighth Sect would never be able to forget.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1455\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1457\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1456","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
