{"id":53812,"no":1487,"title":"Chapter 1484: Extinguishing Soul Lamps on the Path!","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003eThree years passed.\u003c/p\u003e\n\u003cp\u003ePeople in the Vast Expanse School still talked about Fang Mu. As for the mountain he had lived on, only Yan’er occupied it now. It was not open to visitors, and her life was once again peaceful and quiet.\u003c/p\u003e\n\u003cp\u003eWithout Meng Hao there, there was no more playful pouting on her part. Sometimes, she just sat there in a daze, daydreaming about the past.\u003c/p\u003e\n\u003cp\u003eBut there was no avoiding the truth.... Her Master was gone.\u003c/p\u003e\n\u003cp\u003eOther than practicing cultivation, there was only one thing that she absolutely had to do every day, and that was to visit her Master’s secluded meditation facilities, where she had enshrined his soul fire.\u003c/p\u003e\n\u003cp\u003eAs long as that soul fire burned, her Master was alive.\u003c/p\u003e\n\u003cp\u003eOne day, she came to visit as she always did. She kowtowed to the soul fire, and then began to speak in a murmuring voice.\u003c/p\u003e\n\u003cp\u003e“Master, you\u0027ve been gone for three years. That’s not too long....\u003c/p\u003e\n\u003cp\u003e“Oh, last night when I was practicing cultivation, I finally understood that one magical technique.\u003c/p\u003e\n\u003cp\u003e“Another thing you don\u0027t know about, Master. I heard that yesterday, those jerks from the other sects started making trouble again. Supposedly, they’re going to start challenging the Vast Expanse Shrine once more.\u003c/p\u003e\n\u003cp\u003e“Master, there’s another thing....” Every time Yan’er came, she would speak to herself in his fashion, as if her Master were standing there in front of her. This time, even as she spoke, a tremor suddenly ran through her, and her voice faltered. Her expression flickered, and the blood drained from her face as she stared in shock at the soul fire.\u003c/p\u003e\n\u003cp\u003eFor three years, the soul fire hadn’t changed at all. But just now, it had faded a bit, as though it might wink out at any moment. The sight caused Yan’er to shake, and her mind to spin. She knew that this was the flame of her Master’s life force, and that if it went out, it meant that he was dead.\u003c/p\u003e\n\u003cp\u003eObviously, he must be experiencing some deadly situation on the Transcendence Path.\u003c/p\u003e\n\u003cp\u003eHer heart filled with bitterness and anxiety, and yet there was nothing she could do to help her Master. She could do nothing to change anything, really.\u003c/p\u003e\n\u003cp\u003e“Master, I\u0027m so useless....” Tears began to roll down her cheeks as she trembled, still staring at the soul fire.\u003c/p\u003e\n\u003cp\u003eThe truth was that Meng Hao really was facing a deadly test on the Transcendence Path. The pressure he was facing had just increased dramatically.\u003c/p\u003e\n\u003cp\u003eHe had continued to walk for three years, and gradually, had become used to the pressure. He had even reached the point where he could jog for a bit. But today, he crossed into a new region in which the pressure suddenly increased by, not double, but tenfold!\u003c/p\u003e\n\u003cp\u003eIt happened suddenly and without any warning whatsoever. Meng Hao had literally no time to even react before being slammed down onto the ground.\u003c/p\u003e\n\u003cp\u003eMany of his bones were fractured as he struggled against the pressure, and his flesh was smashed. Cracking sounds could be heard as his skeleton hovered on the brink of being shattered.\u003c/p\u003e\n\u003cp\u003eA sensation of imminent life-or-death crisis swept through him. On top of it all, his cultivation base was suppressed. He began to tremble, and his eyes were completely shot with blood as he let out a howl. However, at the moment, there was nothing he could do.\u003c/p\u003e\n\u003cp\u003eAny other person would have been destroyed instantly, but Meng Hao’s true self had created this clone following the pattern laid out by the bronze lamp, making it perfect in every aspect.\u003c/p\u003e\n\u003cp\u003eIt was pure, lacking any impurities or defilements, and possessed the ultimate Immortal aura. In fact, it was even possible to say that this clone was an Immortal body unto itself.\u003c/p\u003e\n\u003cp\u003eWhen you added in the terrifying divine will of Meng Hao’s true self, it meant that the clone was just barely able to survive under this sudden tenfold increase in pressure.\u003c/p\u003e\n\u003cp\u003eTime passed. After fifteen or sixteen hours, Meng Hao\u0027s vision was fading. However, beneath the intense, deadly pressure, he was able to extinguish one of his six remaining lit Soul Lamps.\u003c/p\u003e\n\u003cp\u003eInstantly, life force poured into him, healing his bones and mending his flesh. His cultivation base flourished, and his fading life force once again began to thrive.\u003c/p\u003e\n\u003cp\u003eHaving endured through the deadly crisis, Meng Hao struggled into a sitting position. His face was pale, and he was panting as he looked behind him at the path he had walked. As of this moment, he fully understood how the Transcendence Path worked. The pressure was not something that remained constant, instead, it would increase explosively.\u003c/p\u003e\n\u003cp\u003eObviously, the farther one traveled along the path, the more terrifying the pressure got. Furthermore, there was no warning; it would happen in an instant. Life and death were separated by a single step.\u003c/p\u003e\n\u003cp\u003eAs Meng Hao’s life force was restored, Yan’er was there in his secluded meditation facilities in the Ninth Sect of the Vast Expanse School, staring at his soul fire. When the flame began to burn brightly once again, she wiped her tears away, and made a decision.\u003c/p\u003e\n\u003cp\u003e“Master, I\u0027m going to get strong as quickly as possible. Then... I’ll walk the Transcendence Path with you.” Having made her decision, she took a deep breath and left the secluded meditation facilities.\u003c/p\u003e\n\u003cp\u003eFrom that day on, she didn’t remain holed up on the mountain. She left, and began to challenge the Vast Expanse Shrine. Although the tolling bells offered no benefit to her, the other good fortune within the Vast Expanse Shrine was still helpful.\u003c/p\u003e\n\u003cp\u003eThat was her choice: first challenge the Vast Expanse Shrine, then walk the Transcendence Path.\u003c/p\u003e\n\u003cp\u003eAnother three years passed. Meng Hao had now been on the Transcendence Path for six years. So far, he still hadn’t caught sight of anyone else. It was as if he were the only living being in all Heaven and Earth. As he proceeded onward under the incredible pressure, he gradually got used to it. Eventually, he reached the point where he could jog, just like he had before. However, he had the feeling that... an explosive increase in pressure was coming.\u003c/p\u003e\n\u003cp\u003eAs the feeling grew stronger, he pressed onward with increased caution. A few months later, he finally saw someone up ahead. It was a person wearing similar clothes to himself, who proceeded forward with great difficulty, his hair completely disheveled. However, he emanated the aura of the Dao Realm.\u003c/p\u003e\n\u003cp\u003eThis was the first fellow disciple he had seen so far on the Transcendence Path. However, before Meng Hao could even call out a greeting, the man up ahead took a step forward, then shuddered and immediately fell to the ground. Then, even as Meng Hao watched, he transformed into a blood mist. It only took a moment for that blood mist to be crushed down into the ground, and completely dispersed.\u003c/p\u003e\n\u003cp\u003eMoments later, there was no trace of blood left, nor any other indication that the man had existed. It was almost as if what Meng Hao had seen before was just an illusion.\u003c/p\u003e\n\u003cp\u003eMeng Hao stopped in place to think, his heart pounding. If he hadn’t witnessed the man’s death, things might have been a bit easier. Ever since three years before, when the explosive increase in pressure had happened without any warning, he had always thought it might be better to know beforehand so he could prepare himself.\u003c/p\u003e\n\u003cp\u003eBut now he wasn’t so sure.\u003c/p\u003e\n\u003cp\u003eNow that he knew where the border existed, he would be able to prepare ahead of time. And yet, that also opened the door for doubt and fear. Moments ago, he had seen a Dao Realm expert crushed into a blood mist, and that left him more than a little reluctant.\u003c/p\u003e\n\u003cp\u003eAfter a long moment passed, his eyes flickered brightly, and he took a deep breath. Rotating his cultivation base, he began to walk forward, filled with determination.\u003c/p\u003e\n\u003cp\u003eEventually, he reached the border; if he took another step he would be in exactly the same spot where the Dao Realm expert had been destroyed. He lifted his foot up, and without any trembling or hesitation, he stepped forward.\u003c/p\u003e\n\u003cp\u003eRumbling echoed out as incredible pressure exploded down onto him, pressure that was twenty times as powerful as the pressure he had faced upon entering the Transcendence Path.\u003c/p\u003e\n\u003cp\u003eA boom could be heard as Meng Hao’s body began to explode. Blood spattered everywhere, and the cracking of bones echoed out. The pain was so intense that anyone would scream in response, and yet Meng Hao gritted his teeth and held his breath. Massive rumbling sounds echoed out as he rotated his cultivation base and sent out divine sense. Simultaneously, all of his Soul Lamps exploded with power.\u003c/p\u003e\n\u003cp\u003eJust when he felt like he couldn\u0027t hold on any longer, when his body would fully collapse, one of his final five Soul Lamps winked out.\u003c/p\u003e\n\u003cp\u003eThe extinguishing of the Soul Lamp flooded him with life force, like rainfall onto a parched desert. He immediately began to recover, although it still took effort just to stand in place. He closed his eyes for a long time before finally continuing to plod along like a mortal.\u003c/p\u003e\n\u003cp\u003e“Four lamps left....” he murmured hoarsely, gritting his teeth as he walked along. Extinguishing one Soul Lamp in three years was a bit slow, but was a speed Meng Hao could accept. After all, on the outside, it would have taken hundreds of years to extinguish his remaining Soul Lamps.\u003c/p\u003e\n\u003cp\u003eHowever, the deadly pressure in this place could stimulate the potential of one’s life force; either you succeeded, or you died.\u003c/p\u003e\n\u003cp\u003eThree years later, Meng Hao had been on the Transcendence Path for nine years, and was facing pressure beyond imagination. He had originally assumed that the pressure in the next region beyond the twentyfold increase would be that of a thirtyfold increase. It was only upon stepping into that area that he found, not a thirtyfold increase, but fiftyfold increase!\u003c/p\u003e\n\u003cp\u003eThe explosive level of the pressure completely destroyed half of his body. Blood sprayed in all directions, and it was only by the extinguishing of his fourth Soul Lamp that he managed to survive. After some further rest and recovery, he proceeded on.\u003c/p\u003e\n\u003cp\u003e“Three more lamps!” he thought. His hair was a mess, and his face was ashen, but he clenched his jaw and proceeded along. It was in his twelfth year on the Transcendence Path that he finally caught sight of someone up ahead.\u003c/p\u003e\n\u003cp\u003eNot just one person, but four!\u003c/p\u003e\n\u003cp\u003eThey were seated cross-legged several hundred meters up ahead, doing breathing exercises. Their cultivation bases made them all 3-Essences Dao Lords, very close to the 4-Essences level.\u003c/p\u003e\n\u003cp\u003eAs Meng Hao neared, their eyes opened, and they couldn’t hold back from being shocked.\u003c/p\u003e\n\u003cp\u003e“Ancient Realm?”\u003c/p\u003e\n\u003cp\u003e“The third tribulation can\u0027t be passed by anyone below the Dao Lord level. How did he get here!?”\u003c/p\u003e\n\u003cp\u003e“From ancient times until now, Ancient Realm cultivators haven’t been prohibited from traveling this path. However, most of them stop before the third tribulation.”\u003c/p\u003e\n\u003cp\u003e“Could this be a new Chosen from the sect?” These four Dao Lords had been away from the sect for an entire sixty-year-cycle, and were thus unaware of the legendary Fang Mu. Their eyes began to shine brightly as Meng Hao walked up to them.\u003c/p\u003e\n\u003cp\u003eAs he neared, one of them called out in a hoarse voice, “What sect are you from, disciple?”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 1484: Extinguishing Soul Lamps on the Path!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1483\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1485\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1484","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
