{"id":53849,"no":1524,"title":"Chapter 1521: The Heavens Inflict Punishment!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1521: The Heavens Inflict Punishment!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA year later, in the dead of night, Little Treasure was in the middle of sculpting the statue that was the ninth sealing mark. Suddenly, the sculpture glimmered with a faint light; it was now half complete.\u003c/p\u003e\n\u003cp\u003eIt was in that very moment that thunder rumbled in the sky outside. It filled the first continent, as if some powerful will were expressing its anger by roaring in rage. The Heavens seemed to transform into an eye which scoured the lands below it, as if it were searching for something. In the end, the eye vanished.\u003c/p\u003e\n\u003cp\u003eEven as the clouds above seethed, Meng Hao’s true self was sitting in his home not too far away from Little Treasure. He slowly looked up into the sky, his eyes cold.\u003c/p\u003e\n\u003cp\u003eIn that moment, Little Treasure couldn’t shake the feeling that someone up above in the sky was looking down at him. He looked up, but of course, couldn’t see anything.\u003c/p\u003e\n\u003cp\u003eThat night, as the clouds churned, rain began to fall.\u003c/p\u003e\n\u003cp\u003eIt fell, not just on that particular city, but... upon the entire first continent.\u003c/p\u003e\n\u003cp\u003eRain was a natural occurence, so people didn’t pay much attention to it. The mortals didn\u0027t even care, much less the cultivators. But the rain continued to fall for a total of seven days!\u003c/p\u003e\n\u003cp\u003eBecause of the unending downpour, some low-lying areas began to fill up with water. A disaster was unfolding. Soon, the mortal empire began to get nervous, and started taking measures to control the flood of water.\u003c/p\u003e\n\u003cp\u003eThe rain didn\u0027t stop after seven days though. There was a brief respite with a bit of sunny sky, but then thunder boomed, and the rain began to fall again. It seemed to pour down without end. Rain fell for a second week, then a third, then a fourth....\u003c/p\u003e\n\u003cp\u003eThen a second month, a third, and a fourth....\u003c/p\u003e\n\u003cp\u003eNormally, a bit of rainfall was nothing anyone would worry about. But when the rain continued to fall for month after month, soaking the lands, completely inundating them, it was a completely different matter.\u003c/p\u003e\n\u003cp\u003eBy now, it was a true disaster, to the point where the cultivators in the first continent attempted to intervene and stop the rain. However, not even the Paragons were capable of doing so.\u003c/p\u003e\n\u003cp\u003eThe best they could do was create canals that led the rainwater to the oceans.\u003c/p\u003e\n\u003cp\u003eHowever, that was not a long-term solution. Furthermore, many of the cultivators who attempted to intervene would subsequently make critical errors when practicing cultivation, and then die.\u003c/p\u003e\n\u003cp\u003eIt was almost as if they had offended the will of the Heavens, and were being punished with death.\u003c/p\u003e\n\u003cp\u003eThe mortal world was completely saturated with water. The city Little Treasure lived in was no exception. Certain portions of the city wall were so soaked that they had collapsed, as had many buildings throughout the city. The citizens could do little more than brave the downpours to try to bolster their residences against the rain.\u003c/p\u003e\n\u003cp\u003eIt reached the point where virtually no one was able to prevent the water from flowing into their homes. As the water rose, sickness and disease spread.\u003c/p\u003e\n\u003cp\u003eLittle Treasure’s house was one of the few in which it was relatively dry. He had no idea why that was the case, nor did his daughter.\u003c/p\u003e\n\u003cp\u003eOnly his wife knew. She had taken certain measures to protect her family.\u003c/p\u003e\n\u003cp\u003e“When is this rain going to stop...?” Little Treasure said with a sigh. Because of what had been happening, business had ground to a halt. Thankfully, they had some food saved up, but if the rain kept on the way it was, that food wouldn’t last for very long.\u003c/p\u003e\n\u003cp\u003eLittle Treasure sat there quietly, sculpting away. With every stroke of his knife, another sliver of wood would fall, just like the rain outside.\u003c/p\u003e\n\u003cp\u003eMore and more cultivators were mobilized. They began to set up spell formations and hew out canals. However, all that did was alleviate a bit of the pressure, not solve the problem.\u003c/p\u003e\n\u003cp\u003eIt was in this fashion that three years passed.\u003c/p\u003e\n\u003cp\u003eDuring that time... the rain never stopped. People began to move to other locations on the continent as one village after another was swallowed up by water. Plains vanished, and eventually, even the city Little Treasure lived in sank beneath the waters.\u003c/p\u003e\n\u003cp\u003eLittle Treasure and his family left with the other refugees, heading to higher ground. Along the way, Little Treasure’s parents fell ill.\u003c/p\u003e\n\u003cp\u003eThey were old, and had grown frail, and nearly lost their lives to the illness. However, just when it seemed hopeless, they made a sudden recovery. Little Treasure was delighted, although he couldn’t see how ashen his wife’s face was in that moment.\u003c/p\u003e\n\u003cp\u003eThe rain fell harder. People died on a daily basis. Among all of the refugees who were traveling to higher ground, only Little Treasure and his family kept their spirits up. Furthermore, Little Treasure never stopped sculpting. Every day he would spend time working on his statue.\u003c/p\u003e\n\u003cp\u003eThe exodus took a full year. Eventually, they reached a tall mountain, which gradually came to be packed with more and more refugees. Suddenly, the rain stopped. Everyone began to cry out in joy, only to feel a frigid wind blow across their faces, a wind which seemed to drain them of all warmth. In that instant, their spirits turned as cold as ice.\u003c/p\u003e\n\u003cp\u003eThe rain had stopped. But the snow had just begun.\u003c/p\u003e\n\u003cp\u003eThe temperature on the first continent dropped rapidly.\u003c/p\u003e\n\u003cp\u003eSnow began to fall, and Little Treasure shivered. He felt the snow landing on his face, and he could hear everyone around him crying out in alarm.\u003c/p\u003e\n\u003cp\u003eIt was a depressing sound, a sound filled with death and despair....\u003c/p\u003e\n\u003cp\u003eBefore, everything had been wet, but now, everything was freezing cold. This sudden change in the weather took the disaster to a new, unprecedented level.\u003c/p\u003e\n\u003cp\u003eSnow filled the lands, and the temperature plummeted. The ground froze over, and vile coldness reached its claws everywhere. Not even the canals could escape, and were frozen solid.\u003c/p\u003e\n\u003cp\u003eMore cultivators attempted to interfere with the Heavens, but any who did would eventually drop dead with no warning. There was even an 8-Essences Paragon who, in the midst of attempting to stop the disaster, was suddenly blasted by a wind so cold it froze his soul, and he died instantly. After that, no one dared to do anything.\u003c/p\u003e\n\u003cp\u003eBecause of the rain, and then the snow, the First Sect was uprooted and forced to move. According to their understanding, the Heavens had sent this disaster to destroy the first continent.\u003c/p\u003e\n\u003cp\u003eThere was nothing that could be done. There was no resisting it. Even the Sect Leader could do nothing but shake his head bitterly. Furthermore, he had the feeling that the disaster was far from over.\u003c/p\u003e\n\u003cp\u003eThe First Sect evacuated.\u003c/p\u003e\n\u003cp\u003eOn that night, Little Treasure’s wife Yan’er was looking up at the falling snow. She knew that the First Sect was leaving, and finally decided that it was time to take Little Treasure and their daughter away from the first continent. However, just when she was about to unleash some magic, the energy of Heaven and Earth that existed in the first continent vanished.\u003c/p\u003e\n\u003cp\u003eJust like that, all of the spiritual energy, all of the energy of the Vast Expanse, was suddenly gone, as if it had been cut off. Not a single trace was left behind.\u003c/p\u003e\n\u003cp\u003eSomething shocking resulted because of the disappearance of the energy of Heaven and Earth. In that instant, all of the cultivators on the first continent gaped in shock. It was as if a huge pressure had suddenly descended onto them. All of their years of cultivation, all of their cultivation base power, was gone. No matter how they fought or struggled to keep it... as of this moment, all of them fell back down into the mortal realm. They... were now mortals!\u003c/p\u003e\n\u003cp\u003eIt was as if a huge blanket had been tossed over the lands of the first continent, making it impossible for anyone to leave, and also ensuring that no one dared to enter.\u003c/p\u003e\n\u003cp\u003eAny cultivator who cross the border into the first continent would instantly become a mortal.\u003c/p\u003e\n\u003cp\u003eThe entire Vast Expanse School was stirred into action. All of the 9-Essences Paragons gathered at the borders of the first continent, which they stared at in shock. All of them were trembling deep in their hearts.\u003c/p\u003e\n\u003cp\u003e“The wrath of the Heavens!!” the Sect Leader murmured inwardly. He looked up into the Heavens, into the starry sky of Allheaven, and based on the level of his cultivation base, he could tell that, for some reason, the entire starry sky seemed enraged at the first continent.\u003c/p\u003e\n\u003cp\u003eAt the same time, numerous cultivators who were proficient in prophesying and performing auguries began to call upon their skill to investigate. One after another, they were hit with backlashes that left them coughing up blood. And yet, they all came to the same conclusion.\u003c/p\u003e\n\u003cp\u003e“Punishment from the Heavens!”\u003c/p\u003e\n\u003cp\u003e“The Heavens are enraged!”\u003c/p\u003e\n\u003cp\u003e“Something happened which infuriated the Vast Expanse, right here on the first continent!”\u003c/p\u003e\n\u003cp\u003e“There is a power building up on the first continent, a power that the starry sky of the Vast Expanse views as an enemy!”\u003c/p\u003e\n\u003cp\u003e“We have to separate ourselves from that power. We have to seal this place off. Otherwise, the power might spread out from the first land mass and affect all of the starry sky!”\u003c/p\u003e\n\u003cp\u003eSuch predictions and explanations only grew more numerous. Eventually, the first continent was completely sealed off.\u003c/p\u003e\n\u003cp\u003eAll of the cultivators there who had lost their cultivation bases could do nothing but shiver as they looked in despair at the falling snow. Yan’er was among them. She smiled bitterly, and yet knew that there was nothing she could do to change the situation.\u003c/p\u003e\n\u003cp\u003eLittle Treasure wasn’t aware of how his wife had changed. However, he could feel death approaching. He knew the world had changed. It was unfamiliar now, and filled with rage and murder.\u003c/p\u003e\n\u003cp\u003eMore people died. Violent chaos filled the lands. In the midst of a disaster like this, the worst side of people was what showed. That was how people survived.\u003c/p\u003e\n\u003cp\u003eThe entire continent began to degenerate. As the snow fell and the temperature dropped, more people turned into corpses. The survivors could do nothing more than search for places to try to survive the cold.\u003c/p\u003e\n\u003cp\u003eSome survivors formed groups, which huddled together in caves in the mountains as they fought to live.\u003c/p\u003e\n\u003cp\u003eFood grew scarce, making it even more difficult to keep going. In order to get even a bit of food, many young women did things they would never have done before. People fought and killed others, and stories of cannibalism began to circulate.\u003c/p\u003e\n\u003cp\u003ePretty women often had it the worst, so Little Treasure’s wife, having lost her cultivation base, used a knife to disfigure her own face.\u003c/p\u003e\n\u003cp\u003eOn that night, Little Treasure wrapped his arms around his wife and daughter, and they all wept together.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1520\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1522\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1521","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
