{"id":53877,"no":1552,"title":"Chapter 1549: The Lands of the Sinners Shall Not Remain!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1549: The Lands of the Sinners Shall Not Remain!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMeng Hao didn’t accompany his actions with words. He simply pounded the man’s head into the ground over and over. The man screamed as his true form was gradually revealed. He had the body of a Flood Dragon, but with no tail. He almost looked like a serpent of some sort. Booms echoed out as Meng Hao used his head to batter a huge hole into the 15th land mass.\u003c/p\u003e\n\u003cp\u003eThe Outsider’s bones were smashed, his blood drained, his life force completely cut off. At that point, Meng Hao finally stopped. Extracting the Outsider’s soul, he rose to his feet.\u003c/p\u003e\n\u003cp\u003eBy now, the faces of the other Outsiders on the 15th land mass were completely ashen, and their minds were reeling. They were completely consumed by terror and hopelessness.\u003c/p\u003e\n\u003cp\u003eTo them, Meng Hao was absolutely the most terrifying entity in all of the starry sky.\u003c/p\u003e\n\u003cp\u003e9-Essences Paragons were looked up to by all of the Outsiders in the 33 Heavens. And yet they had just watched one of the supreme 9-Essences Paragons, someone who wielded the might of the Heavens, tossed screaming into a sea of flames by Meng Hao. His body was burned into nothing, and his soul sank into the flames, where it would remain for all eternity.\u003c/p\u003e\n\u003cp\u003eThe other Outsider in the black wind experienced incredible pain as his flesh was flayed off of his body as if by millions of blades.\u003c/p\u003e\n\u003cp\u003eThe third one he grabbed by the neck and proceeded to use him to bash another hole, both in the land mass, and in the hearts of the other Outsiders.\u003c/p\u003e\n\u003cp\u003eThat was especially the case because... up above, the 16th through 33rd Heavens were not visible. The only thing that could be seen was a boundless sea of flames, within which were the souls of countless dead Outsiders, screaming in torment.\u003c/p\u003e\n\u003cp\u003eAs the sound drifted down into the hearts of the Outsiders below, it became a wellspring of terror, causing the Outsiders to tremble in anxiety.\u003c/p\u003e\n\u003cp\u003eThe worst off were the ones who had participated in the war with the Mountain and Sea Realm, whose fear was especially intense and deep. Many of them had seen Meng Hao before, and remembered everything which had happened back in the war, how countless cultivators of the Mountain and Sea Realm had been killed. Meng Hao had been defiled, transformed from the Immortal into the Demon. Back then, he had thrown his head back and cackled in madness. That image now superimposed with the cold, merciless person in front of them, whose eyes burned with murder.\u003c/p\u003e\n\u003cp\u003ePleading, begging voices could be heard from the 15th Heaven, and especially from the land masses further down.\u003c/p\u003e\n\u003cp\u003eThey were completely and utterly filled with fear. To Meng Hao, this was revenge. To them, it was a massacre, an extermination. There was simply no way for them to fight back against the terrifying Meng Hao and the army he had at his back.\u003c/p\u003e\n\u003cp\u003eMany of the despairing Outsiders now realized that Meng Hao’s cultivation base was so powerful that he could simply wave his hand and destroy all of the 33 Heavens, and wipe the Outsiders away in body and soul.\u003c/p\u003e\n\u003cp\u003eBut he didn’t. He was using a much more brutal method, holding back his hand, going slowly but surely as he crushed them into powder.\u003c/p\u003e\n\u003cp\u003eIt was a method that went beyond horrifying.\u003c/p\u003e\n\u003cp\u003eMeng Hao stood there silently. From the 1st Heaven all the way to the 15th, despairing voices could be heard crying out. It was something that was familiar to him. Very familiar. Back when the Mountain and Sea Realm had been destroyed, it had been just like this.\u003c/p\u003e\n\u003cp\u003eThe aura of despair was the same, just like it had been for the Mountain and Sea Realm.\u003c/p\u003e\n\u003cp\u003e“Next,” he murmured, eyes flickering with killing intent, “I think I should force these Outsiders to fight to their deaths.\u003c/p\u003e\n\u003cp\u003e“The way you treated the Mountain and Sea Realm back then is how I will treat you today.\u003c/p\u003e\n\u003cp\u003e“That’s fair, isn’t it...?” When he thought back to all the people he had seen die, it almost was as if he were surrounded by countless ghosts, the ghosts of those valiant heroes of the Mountain and Sea Realm who had fallen in death.\u003c/p\u003e\n\u003cp\u003eMeng Hao laughed loudly as he stepped onto the fifteenth land mass. Just when the cultivators of the Vast Expanse School were about to follow him, he raised his hand to halt their progress.\u003c/p\u003e\n\u003cp\u003eAs of this point, Meng Hao didn’t plan to let anyone else participate. His divine sense spread out to cover all of the Outsiders of the 15th Heaven, and at the same time, a second version of himself stepped off to the side. Then another, and another, as numerous clones were created.\u003c/p\u003e\n\u003cp\u003eFirst there were 100,000. Then 1,000,000. Then 10,000,000. Then tens of millions.... They didn’t seem to end. Every Outsider on the land mass was suddenly facing a version of Meng Hao.\u003c/p\u003e\n\u003cp\u003eWithin a few breaths of time, Meng Hao’s clones filled the 15th Heaven. Then each clone reached out and grabbed an Outsider by the neck, regardless of that Outsider’s cultivation base level, regardless of how they struggled, regardless of how they evaded.\u003c/p\u003e\n\u003cp\u003eThe Outsiders begged for mercy and howled in despair and madness. To anyone who could hear it, it would sound like hell. But to Meng Hao, it was the sound of revenge.\u003c/p\u003e\n\u003cp\u003e“I hate the 33 Heavens. I hate these lands, and I hate everyone who lives in them!” Meng Hao closed his eyes as his clones suddenly clenched their hands down.\u003c/p\u003e\n\u003cp\u003eSilence ensued. The clones didn’t crush the necks of the Outsiders. They held them high up in the air, and poured cultivation base power into them, to wreak havoc inside their bodies.\u003c/p\u003e\n\u003cp\u003eThe Outsiders trembled, but because their throats were being squeezed shut, they couldn’t scream. Their bodies twisted as they tried to struggle, but they fundamentally didn’t even qualify to struggle.\u003c/p\u003e\n\u003cp\u003eUp above, gasps could be heard from within the army from the Vast Expanse School. From Meng Hao’s methods, they could sense that his hatred for the 33 Heavens had reached an indescribable level, a level which left them completely flabbergasted.\u003c/p\u003e\n\u003cp\u003eThere was no way for them to truly understand. They had not participated in the brutal and shocking war in the Mountain and Sea Realm. They had not watched the Mountains crumble, and the starry sky shatter.\u003c/p\u003e\n\u003cp\u003eThey had not watched the people of the numerous mortal worlds wiped out by the Outsiders. Men. Women. Old. Young. All of them had been slaughtered mercilessly.\u003c/p\u003e\n\u003cp\u003eMeng Hao couldn’t forget what he had seen back then, and couldn’t forget what had happened to the mortals during that war of genocide. The mortals were part of the Mountain and Sea Realm too, and he could remember all of their corpses. Even the pregnant women, and the babies. Endless numbers of them.\u003c/p\u003e\n\u003cp\u003eEven more revolting was how he had seen people being eaten alive by the Outsiders.\u003c/p\u003e\n\u003cp\u003e“Even if I did worse to these brutes, it would still be showing mercy.” Meng Hao never opened his eyes. His clones began to crush the Outsiders, until flowers of blood bloomed throughout the 15th Heaven.\u003c/p\u003e\n\u003cp\u003eAll of the Outsiders were killed. Their bodies were destroyed, and their souls were swept up by Meng Hao before they could dissipate.\u003c/p\u003e\n\u003cp\u003eThe souls were then cast into the sea of flames, where their screams echoed out into Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eCountless souls filled that sea of flames, all of them burning and in agony. What they were experiencing now was something the likes of which they had never experienced in their entire lives.\u003c/p\u003e\n\u003cp\u003e“The lands of the sinners shall not remain,” Meng Hao said, opening his eyes. In that moment, all of his clones on the fifteen land mass vanished.\u003c/p\u003e\n\u003cp\u003eFinally, he stamped his foot down.\u003c/p\u003e\n\u003cp\u003eA boom echoed out as the entire land mass collapsed, transforming into ash and rubble which rained down onto the 14th Heaven.\u003c/p\u003e\n\u003cp\u003eDown below, buildings were destroyed, and craters opened up. The lands of the 14th Heaven shook, and screams echoed up from the Outsiders. They seemed to be completely despairing, descending into madness as they flew up, ready to fight, glaring at Meng Hao with killing intent.\u003c/p\u003e\n\u003cp\u003eThe Outsiders from the 14th Heaven were in such a state of despair, their minds in such chaos from the intense pressure, that they automatically spoke out their true feelings.\u003c/p\u003e\n\u003cp\u003e“I only killed a few of the scumbags from the Mountain and Sea Realm that year. If there’s a next life after this one, I’ll definitely kill even more!”\u003c/p\u003e\n\u003cp\u003e“Hahaha! When I fought in the war against the Mountain and Sea Realm, I crushed dozens of cultivators, and even slaughtered an entire mortal kingdom. I also managed to consume a lot of their hearts. Now that I think about it, the flavor was wonderful!”\u003c/p\u003e\n\u003cp\u003e“The female cultivators from the Mountain and Sea Realm make excellent cultivation vessels, and they taste delicious too! I brought quite a few home with me after the war to be slaves. It’s too bad they were so weak, and ended up dying from it all.”\u003c/p\u003e\n\u003cp\u003eWhen Meng Hao heard their words, his eyes turned cold, and his murderous aura raged.\u003c/p\u003e\n\u003cp\u003eHe didn’t speak. Instead, he simply waved his finger at the incoming figures.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1548\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1550\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-9-chapter-1549","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
