{"id":53891,"no":1566,"title":"Chapter 1563: The Wind Stirs","content":"\u003cp\u003e\u003cstrong\u003eChapter 1563: The Wind Stirs\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNearest to Meng Hao at the moment was the Immortal God Continent, which was covered by an endless mist as it shot through the starry sky at incredible speed.\u003c/p\u003e\n\u003cp\u003eNormally, it was a trip that should have taken hundreds of years, but in this case, only a few short months had passed. Rumbling sounds echoed out as it got closer and closer.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked away from the starry sky. Down below, the green coffin was no longer visible. He took a step forward, placing him directly in front of the sea of flames. He extended his right hand, and the fire shrank down until it was the size of his palm, after which he put it away.\u003c/p\u003e\n\u003cp\u003eThe huge army from the Vast Expanse School all looked over at Meng Hao, their cultivation base power surging. However, none of them said a single word. As Meng Hao approached them, their energy rose higher and higher.\u003c/p\u003e\n\u003cp\u003eThey knew that the true war had yet to begin. All of them were fully aware that Meng Hao’s true enemies were the Immortal God Continent and the Devil Realm Continent. The 33 Heavens had been little more than a stepping stone.\u003c/p\u003e\n\u003cp\u003eMeng Hao took his place atop the old lizard, where he sat down cross-legged and then spoke in a voice that echoed like thunder.\u003c/p\u003e\n\u003cp\u003e“Three days. In three days’ time, the Immortal God Continent will arrive.” Immediately, the surrounding cultivators’ eyes flickered with the desire to kill.\u003c/p\u003e\n\u003cp\u003e“They shall die!” roared the Vast Expanse School troops, their cultivation bases surging, their expressions gleaming with madness. There were even some who licked their lips.\u003c/p\u003e\n\u003cp\u003eTo these cultivators, it didn\u0027t really matter that they never got a chance to slaughter all 33 Heavens. They were here to fight for Meng Hao, to fight for a Transcendent cultivator. As such, the truly worthy opponents were the Immortal God Continent and the Devil Realm Continent.\u003c/p\u003e\n\u003cp\u003eThey knew that the Immortal God Continent was considered a top power within the starry sky of the Vast Expanse, but that only made them more excited.\u003c/p\u003e\n\u003cp\u003eThey knew that their opponents... were not invincible, now that Meng Hao had Transcended!\u003c/p\u003e\n\u003cp\u003eMeng Hao was even more clear on that point. In fact, he was aware that if he wished to, it would be a simple matter for him to single-handedly wipe out the Immortal God Continent and the Devil Realm Continent. However, he didn\u0027t do that, the reason being... that his ultimate opponent was the will of the starry sky of the Vast Expanse.\u003c/p\u003e\n\u003cp\u003eThat will would most certainly take advantage of the situation to try to fight him. Therefore, he needed to stay at his peak state, and could not allow any distractions to influence him.\u003c/p\u003e\n\u003cp\u003eIf he focused too much on trying to destroy the Immortal God Continent and the Devil Realm personally, then it could leave an opening for the will of the starry sky to make a move. In fact, that will was hoping for just such a thing to occur. As long as Meng Hao could be distracted in some way, it would be worth it.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes glittered as his aura slowly grew still and calm. He looked out coldly into the stars, waiting for the final battle to begin.\u003c/p\u003e\n\u003cp\u003eThree days flew by. Suddenly, the stars off in the distance began to ripple and distort. Thunderous rumbling sounds echoed out, and a bizarre pressure filled the area. An enormous, majestic continent suddenly appeared.\u003c/p\u003e\n\u003cp\u003eThe pressure instantly grew more intense as the vague shape of a hand suddenly appeared and then shot toward the Vast Expanse School army.\u003c/p\u003e\n\u003cp\u003eThe Sect Leader snorted coldly. The golden-robed Jin Yunshan, Sha Jiudong, and Bai Wuchen all unleashed the power of their cultivation bases, sending a massive force flying out to defend against the hand. Everything shook wildly.\u003c/p\u003e\n\u003cp\u003eThe Immortal God Continent ripped through the starry sky. It was an enormous land mass, so huge that by the time only half of it was visible, it seemed to stretch out infinitely in all directions. Numerous peak 9-Essences auras erupted out, along with ordinary 9-Essences, 8-Essences, and 7-Essences auras.\u003c/p\u003e\n\u003cp\u003eCountless figures flew out from the Immortal God Continent in beams of brilliant light.\u003c/p\u003e\n\u003cp\u003eBehind them were hosts of cultivators, all of whom radiated bleak, ferocious auras. In the blink of an eye, their numbers swelled past the 1,000,000 mark, and rapidly reached 10,000,000.\u003c/p\u003e\n\u003cp\u003eBehind that group, even more cultivators flew out; it almost seemed like they would keep coming without end, for all eternity.\u003c/p\u003e\n\u003cp\u003eThe army from the Vast Expanse School didn’t speak, nor did they hesitate for even a moment. They... instantly began to power up their cultivation bases to fight!\u003c/p\u003e\n\u003cp\u003eIntense killing intent rose up from them, and yet they didn’t immediately begin to fly. Instead, they looked over at Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao pointed out at the Immortal God Continent, and then his eyes glittered as he said, “Exterminate all of the cultivators from this land mass!”\u003c/p\u003e\n\u003cp\u003eIt was as if an explosive wave had been unleashed as the cultivators of the Vast Expanse School surged into action. Their howls shook the starry sky as they began to fly forward in attack.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the two groups of cultivators clashed. The sound of fierce, shocking fighting rang out. The Sect Leader and other peak 9-Essences cultivators were like a sharp sword that slashed deeply into the enemy forces.\u003c/p\u003e\n\u003cp\u003eBehind them were the other 9, 8, and 7-Essences experts, the Dao Sovereigns, and countless others. It only took a moment for the fighting to reach a fever pitch.\u003c/p\u003e\n\u003cp\u003e“DIE!”\u003c/p\u003e\n\u003cp\u003e“DIE!!”\u003c/p\u003e\n\u003cp\u003e“DIE!!!”\u003c/p\u003e\n\u003cp\u003eThe roars of the fighting cultivators caused the Heavens to suddenly go dim. The stars shook, and even suns and moons seemed to cower in fear.\u003c/p\u003e\n\u003cp\u003eThe war... had truly begun!\u003c/p\u003e\n\u003cp\u003eThe Sect Leader took the lead in the charge. Following him, the army of the Vast Expanse School cut through the enemy like a hot knife through butter. Every advancement they made caused the front line of the Immortal God Continent forces crumbled a little bit more.\u003c/p\u003e\n\u003cp\u003eSoon, the reek of blood filled the sky, and countless casualties had been inflicted.\u003c/p\u003e\n\u003cp\u003eMeng Hao stood atop the old lizard, looking coldly at the Immortal God Continent. His vision pierced through the entire continent until it came to rest on a huge statue. That statue depicted the Immortal God Continent’s Transcendor, who had lived many years in the past. When Meng Hao’s gaze came to rest on the statue, he could sense a boundless dignity and might. However, it was in that moment that the mists around the statue swirled, and the statue distorted slightly. Suddenly it looked slightly different than before.\u003c/p\u003e\n\u003cp\u003e“Something’s different,” Meng Hao murmured.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1562\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1564\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1563","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
