{"id":53933,"no":1608,"title":"Chapter 1605: Final Allheaven Transformation!","content":"\u003cp\u003e\u003cstrong\u003eChapter 1605: Final Allheaven Transformation!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e(\u003ca href\u003d\"https://www.youtube.com/watch?v\u003d2b_W2iAjEbU\" target\u003d\"_blank\"\u003eclick here for soundtrack\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003eMeng Hao had previously used a lesser version of the Seal the Heavens Hex on the Demon pillar, leaving a huge crack on it. Now that the complete Seal the Heavens Hex was exploding out with incredible power, that crack grew larger, sending even more cracks out, filling the entire pillar.\u003c/p\u003e\n\u003cp\u003eRumbling sounds echoed out as the Demon pillar then shattered into pieces, into countless chunks of rubble which began to shower down like rain.\u003c/p\u003e\n\u003cp\u003eAt the same time, a roar of fury echoed out through the starry sky. Then, within the brilliant light cast by the Seal the Heavens Hex, something like an enormous hand appeared, which began to tear open a rift in the starry sky. A boundlessly ancient aura erupted out, as well as dense Vast Expanse mist. Simultaneously, an enormous eye emerged from within the rift.\u003c/p\u003e\n\u003cp\u003eMeng Hao was instantly able to tell that the eye was not illusory. It was... Allheaven’s true form!\u003c/p\u003e\n\u003cp\u003eIts ancient aura was not something that could be falsified, nor could the incredible sensation of weakness that it radiated. Most importantly, Meng Hao could sense the aura of the starry sky upon it.\u003c/p\u003e\n\u003cp\u003eHe was Allheaven, the former lord of the starry sky, the reason why all living beings could practice cultivation. It was because of him that people could even Transcend, and he had offered intelligence and civilization to the beings in the starry sky, countless years in the past.\u003c/p\u003e\n\u003cp\u003eLong ago, everything had been happy and harmonious. But then he had weakened, and as he neared death, he went mad....\u003c/p\u003e\n\u003cp\u003eMeng Hao watched the eye of Allheaven, his archenemy, fly out from the rift. As soon as Meng Hao sensed how weak he was, he sighed.\u003c/p\u003e\n\u003cp\u003e“You finally reveal yourself,” he said.\u003c/p\u003e\n\u003cp\u003eAllheaven stared back at him with hatred and other mixed emotions, but mostly coldness.\u003c/p\u003e\n\u003cp\u003e“I came from afar, and when I arrived, this place was nothing but chaos. The beings here had no intelligence, and lived on base instinct alone....\u003c/p\u003e\n\u003cp\u003e“It was me! I was the one who changed everything. Why must you resist me!?\u003c/p\u003e\n\u003cp\u003e“I provided the path of cultivation for all beings! You should be thanking me!\u003c/p\u003e\n\u003cp\u003e“I was also the one who protected this entire starry sky, allowing it to grow and prosper within the Universe. Why can\u0027t you be content with that!?\u003c/p\u003e\n\u003cp\u003e“I was the one who created the natural laws here. I replaced the mindless will that existed here. I became the lord of this starry sky!” The voice of Allheaven seemed melancholy, and yet it boomed like thunder.\u003c/p\u003e\n\u003cp\u003e“I created all of you! I created everything! Therefore, when I am in need, you should repay me! That is the natural law of the Universe. Why must you struggle?!\u003c/p\u003e\n\u003cp\u003e“You should never have reached this state! I need the power of your Nirvanic Rebirth. I need you as fuel. I need you... to die!” As Allheaven’s words of fury echoed out, an indescribable pressure exploded out, causing the starry sky to tremble. The light from Meng Hao\u0027s Seal the Heavens Hex was instantly crushed, and began to dissipate.\u003c/p\u003e\n\u003cp\u003eIf Meng Hao had never used the Seal the Heavens Hex before, such a thing wouldn’t have happened. Allheaven would never have been able to crush the Hex without having first seen it in use. But having been able to observe it earlier, he could remember it, duplicate it, and destroy it.\u003c/p\u003e\n\u003cp\u003eThat was why he was now revealing himself. He was weak, on the verge of dying completely, and thus had acted with extreme caution before. But now, he was completely confident regarding the Seal the Heavens Hex.\u003c/p\u003e\n\u003cp\u003eMeng Hao sighed quietly. It was hard for him to come to terms with exactly how he felt about Allheaven. However, there was one thing that could never change. Allheaven had plotted against him for his entire life. He had been responsible for destroying the Mountain and Sea Realm. To Meng Hao, the feeling of being manipulated and controlled went against his Dao.\u003c/p\u003e\n\u003cp\u003eHis Dao was that of freedom and independence. He desired to be unrestrained and unfettered, for all eternity.\u003c/p\u003e\n\u003cp\u003e“We have different Daos,” he said, eyes shining with a strange, cold light. With that, he extended his right hand, causing the aura of the Seal the Heavens Hex to explode out, sending boundless light out in all directions.\u003c/p\u003e\n\u003cp\u003e“We have different Daos....” Deep within Allheaven’s eye was a profound arrogance, and an even stronger killing intent. The way for him to change everything was to consume Meng Hao.\u003c/p\u003e\n\u003cp\u003eBy consuming Meng Hao, he could live again!\u003c/p\u003e\n\u003cp\u003eBut now he was weak. He had reached the point where he could only make a single attack. If that attack didn\u0027t kill Meng Hao, then he himself would have no other choice than to die.\u003c/p\u003e\n\u003cp\u003e“One attack will be enough!” he said, his voice echoing out into the starry sky as something pitch black appeared within his gaze.\u003c/p\u003e\n\u003cp\u003e“Ninth transformation!\u003c/p\u003e\n\u003cp\u003e“Allheaven Transformation!” In response to Allheaven’s voice, the starry sky outside the Vast Expanse collapsed. Everything withered up as vast quantities of energy began to converge upon the eye.\u003c/p\u003e\n\u003cp\u003eInstantly, Allheaven’s energy began to rise, and the pressure he exuded grew vastly more intense.\u003c/p\u003e\n\u003cp\u003eIt was as if the starry sky itself were transforming into an ocean of fury, and Meng Hao was a little boat floating on the waves, battered by the rain, in danger of sinking down into the depths.\u003c/p\u003e\n\u003cp\u003eHe could sense a level of madness that far exceeded what he had sensed from the three Transcendors. He was left shaking, and felt almost like he was a mere mortal facing the power of all Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eThe starry sky collapsed and withered, and power poured into the eye of Allheaven. As the eye stared furiously at Meng Hao, veins began to spread out from it, forming what looked like the overall shape of a human body. Soon, the outline of a person began to take shape in front of Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe outline was not unfamiliar. Meng Hao had seen this very thing years ago when he looked inside the Demon pillar.\u003c/p\u003e\n\u003cp\u003eThe enormous shape was now forming in front of him, complete with the ninety-eight shocking fruits. Those fruits then collapsed, spreading out to cover the outline of blood vessels. A scream of fury echoed out as, unexpectedly... another eye appeared.\u003c/p\u003e\n\u003cp\u003eA face could now be seen, complete with facial features. There were also four limbs!\u003c/p\u003e\n\u003cp\u003eThe change happened rapidly. As the starry sky collapsed and withered, life force and power converged onto the ninth transformation, feeding and fueling it.\u003c/p\u003e\n\u003cp\u003eThis was the ninth transformation, the true Allheaven Transformation.\u003c/p\u003e\n\u003cp\u003eMost accurately speaking... this was the complete Allheaven!\u003c/p\u003e\n\u003cp\u003eRumbling sounds echoed out in all directions, as well as sounds like howls of rage. Meng Hao began to pant; he suddenly felt completely unstable, as if the mere energy radiating off of Allheaven was enough to beat him back over and over again.\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003eCheck here for the \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/i-shall-seal-the-heavens-grande-finale-commenting-contest/\"\u003econtest rules\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eUse the hashtag #ISSTH on twitter!\u003c/p\u003e\n\u003cp\u003eThe winners for \"Best Comment\" will be announced along with the raffle winners some time after the contest! Thanks for the great comments. I\u0027m having a tough time picking my favorite!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1604\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1606\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1605","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
