{"id":53938,"no":1613,"title":"Chapter 1610: Whose Clone?","content":"\u003cp\u003e\u003cstrong\u003eChapter 1610: Whose Clone?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e(\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dADgVWA7G1w0\" target\u003d\"_blank\"\u003eclick here for soundtrack\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003eMeng Hao’s mind was shaken, and he was also shaken visibly. At some indeterminable point in the past, a sealing mark had appeared in his brain, which now flickered with the will of Heaven-Sealing. Radiant light spread out, and Meng Hao instinctively extended his right hand and waved his finger.\u003c/p\u003e\n\u003cp\u003e“I hereby... break my curse!” The words coming out of his mouth seemed strange, but for some reason, he felt as if they needed to be said.\u003c/p\u003e\n\u003cp\u003eInstantly, rumbling like that of thunder filled the starry sky. It was especially intense in the region where Meng Hao sat. A huge rift appeared on the ice mountain where all of the soul seeds were stored.\u003c/p\u003e\n\u003cp\u003eInstantly, the soul seeds, which had long since grown dim and dark, seemed to pulse like beating hearts. All of a sudden, they brimmed with life force.\u003c/p\u003e\n\u003cp\u003eIt was as if the gateway leading into reincarnation, which had once been shut tight, was now blown wide open for them.\u003c/p\u003e\n\u003cp\u003eAs the countless soul seeds were restored, Meng Hao’s mind experienced something like two huge hands ripping it apart. The pain was so intense that he screamed, and his eyes went completely bloodshot. He was shaking as countless memories suddenly flooded up inside of him.\u003c/p\u003e\n\u003cp\u003eHe remembered the Mountain and Sea Realm, his parents, Xu Qing, Chu Yuyan, Fatty, Wang Youcai, Patriarch Reliance, Guyiding Tri-Rain, and everything else....\u003c/p\u003e\n\u003cp\u003eHe remembered his battle with Allheaven, and he remembered going into meditation. He remembered Shui Dongliu... who, in the moments before dying, had handed Meng Hao a jade slip with a plan detailed inside.\u003c/p\u003e\n\u003cp\u003eRumbling sounds filled Meng Hao’s mind, and blood oozed out of his eyes, ears, nose, and mouth. He slowly looked up, and spoke out in a voice that was hoarse, and yet filled with determination.\u003c/p\u003e\n\u003cp\u003e“I am not Allheaven. I... am Meng Hao!\u003c/p\u003e\n\u003cp\u003e“I am... MENG HAO!” With that, he threw his head back and roared. His roar filled the starry sky, shaking it, causing the Ninth Mountain and Sea to tremble.\u003c/p\u003e\n\u003cp\u003eHe began to pant as he recalled the truth about everything. He remembered the brief moment in which he had possessed Allheaven during their final battle. He remembered making contact with Allheaven’s thoughts, and he remembered that discarnate will, which he had placed in his own mind like a seed. Gradually, that discarnate will from Allheaven grew, making something like a duplicate of Allheaven that Meng Hao intentionally allowed to possess him.\u003c/p\u003e\n\u003cp\u003eThat had been Shui Dongliu’s plan. It was an insane plan, and the slightest misstep could have led to Meng Hao losing himself forever, to fully transforming into Allheaven. But that was the only way to break the curse. That curse... could only be broken by Allheaven. Not even killing him could accomplish it. Allheaven had to do it of his own accord.\u003c/p\u003e\n\u003cp\u003eTherefore, the only way to break the curse... had been to become Allheaven!\u003c/p\u003e\n\u003cp\u003eAnd that was why everything played out the way it did.\u003c/p\u003e\n\u003cp\u003eTrembling, Meng Hao looked over at the broken ice mountain. He saw the awakening soul seeds, and then started to laugh, a clear, crisp laugh that spread out in all directions. He knew that he had finally... succeeded.\u003c/p\u003e\n\u003cp\u003e“I did it. I finally did it!” Tears streamed down his cheeks, and he struggled to stand up. With every breath he took, the starry sky trembled, and his body recovered itself. His divine sense, his soul, his will, and his cultivation base were all recovering from their state of being withered.\u003c/p\u003e\n\u003cp\u003eEventually, he managed to recover his composure. At that point, he looked out into the depths of the Universe, and remembered how Allheaven had done the same thing in the last moment before dying. Then he recalled what he had experienced after becoming Allheaven.\u003c/p\u003e\n\u003cp\u003eAfter recalling that memory, his heart began to pound. Although he could remember clearly what had occurred, he had a hard time believing it was true.\u003c/p\u003e\n\u003cp\u003eBack when Allheaven had been whole, he had had a profound impact on the entire starry sky. It was only by gaining enlightenment of his Essence that the Ghost, the Devil, the God, and the Demon appeared....\u003c/p\u003e\n\u003cp\u003eThose powerful Transcendors all came to be because of Allheaven. And Allheaven... was only a clone of some other entity!\u003c/p\u003e\n\u003cp\u003eThat entity existed somewhere else in the Universe, and had existed for countless, countless years. The clone’s connection with its true form had been severed, and he had become Allheaven.\u003c/p\u003e\n\u003cp\u003eMixed emotions could be seen in Meng Hao’s eyes as he looked out at the Universe. He knew that somewhere out there, Allheaven’s true form existed as an entity of unimaginable power. Furthermore, who was it that had managed to sever a clone from someone that powerful?\u003c/p\u003e\n\u003cp\u003eIt was in that moment that Meng Hao finally came to understand the meaning of that ancient saying.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAllheaven fears the Immortal!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eHe feared the Immortal because he feared his true self? Perhaps Allheaven’s true self was... the real Immortal!\u003c/p\u003e\n\u003cp\u003eTherefore, it was actually impossible for Meng Hao or any of the others to truly become the Immortal. Even if Allheaven did nothing to stop them from doing so, they still would have failed to become the Immortal!\u003c/p\u003e\n\u003cp\u003eIt was a secret unknown to the God, the Devil or even the Ghost. Perhaps they had come to have certain speculations, which was why they were traveling out in the Universe. Meng Hao was the only person to have glimpsed the truth.\u003c/p\u003e\n\u003cp\u003e“The Universe....” After some thought, a look of unprecedented anticipation appeared within his eyes. He didn\u0027t fear the truth. In contrast, it filled him with incredible hope.\u003c/p\u003e\n\u003cp\u003eHe looked forward with keen anticipation to traveling out into the Universe, to reaching its center. Perhaps one day, he would have the chance to fight that so-called Immortal!\u003c/p\u003e\n\u003cp\u003e“Now that I think about it, I bet the other three Transcendors would want to do the same thing!” With that, he waved his sleeve, wiping away all of the vestiges of Allheaven, and suppressing his desire to go out into the Universe. Now was not the time.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath, and looked over at the ice coffin where Xu Qing lay, his eyes filled with love. He walked over and looked at her beautiful face, then slowly leaned down. As he did, the ice melted, causing mist to roll out. Then his lips touched her forehead as he kissed her gently.\u003c/p\u003e\n\u003cp\u003eIt was impossible to count how many years had passed since he last kissed her. It was a kiss which carried profound longing, a kiss which contained a focus that had lasted for epochs upon epochs.\u003c/p\u003e\n\u003cp\u003e“Qing’er... my wife,“ he said softly. “You\u0027ve been sleeping for so long. It’s time to wake up.”\u003c/p\u003e\n\u003cp\u003eHer eyelashes fluttered, and she slowly opened her eyes. A blank expression could be seen at first, but her gaze quickly focused. She looked at Meng Hao, and then smiled. Her eyes were like deep pools of placid water.\u003c/p\u003e\n\u003cp\u003eSmiling, Meng Hao lifted her out of the ice coffin and helped her to her feet. Then he turned to look at the ice coffins containing his parents, and the parrot and meat jelly. It was only in that moment that he realized that the coffin containing the parrot and meat jelly had already melted, and they were standing there, looking at him with shocked expressions on their faces. Suddenly, miserable shrieks rang out.\u003c/p\u003e\n\u003cp\u003eScared out of their minds, the parrot and meat jelly embraced each other and began to cry out at the tops of their lungs.\u003c/p\u003e\n\u003cp\u003e“Don’t try to kiss me! Dammit! That\u0027s disgusting! Stop right there! Lord Fifth doesn\u0027t even like you! You have no fur! Don’t even think about touching me!!”\u003c/p\u003e\n\u003cp\u003e“Back the hell away from me, Meng Hao. Lord Third\u0027s chastity won’t be sullied by you, you bully! You can’t do that! That’s wrong! That\u0027s immoral....”\u003c/p\u003e\n\u003cp\u003eMeng Hao laughed. He was happier now than he had been in ages.\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1609\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1611\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-10-chapter-1610","bookId":1507,"creation":"Sep 10, 2019 5:03:27 AM","modification":"Sep 10, 2019 5:03:27 AM"}
