{"id":52344,"no":19,"title":"Chapter 19: The Wind Stirs Again","content":"\u003cp\u003e\u003cstrong\u003eChapter 19: The Wind Stirs Again\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMeng Hao opened his eyes and saw Fatty excitedly dragging over a young man. Short, sallow and emaciated, he made quite the contrast to pale, plump Fatty.\u003c/p\u003e\n\u003cp\u003eMeng Hao recognized him. He was one of the members of the group who had been brought to the Reliance Sect that day and taken along with Wang Youcai to a Servants’ Quarters on a different Mountain.\u003c/p\u003e\n\u003cp\u003eAt that time, he had looked strong and good-natured, but now he seemed gloomy and in poor circumstances. However, there was a certain hardness in his eyes that spoke of some unforgettable experiences in the Outer Reliance Sect.\u003c/p\u003e\n\u003cp\u003eFurthermore, he dared to enter the Public zone at only the first level of Qi Condensation.\u003c/p\u003e\n\u003cp\u003e“Greetings, Elder Brother Meng,” said the young man, looking a bit excited. But then it disappeared and he made an extremely respectful salute to Meng Hao with hands clasped.\u003c/p\u003e\n\u003cp\u003e“Did you just enter the Sect?” Meng Hao asked him, thinking back with a sigh to his own first days.\u003c/p\u003e\n\u003cp\u003e“It’s been about a month,” he said, lowering his head.\u003c/p\u003e\n\u003cp\u003e“What about Wang Youcai?”\u003c/p\u003e\n\u003cp\u003e“He died,” said the young man, a numb expression on his face. After the words left his mouth, a look of grief appeared in his eyes.\u003c/p\u003e\n\u003cp\u003e“Wang Youcai died?” said Fatty in shock. Meng Hao maintained his silence.\u003c/p\u003e\n\u003cp\u003e“In the Servants’ Quarter, we were responsible for drawing water,” he explained. “Big Bro Youcai thought I was too young, so he helped me a lot. Once on a mountain road, a powerful gust of wind hit us and knocked him off a cliff. I looked for his body for two months, but could only find some broken bones… he must have been eaten by wild animals.”\u003c/p\u003e\n\u003cp\u003eA look of sorrow appeared on Fatty’s face and Meng Hao let out a sigh. The four of them arrived at the same time, but in less than a year, one was already dead. Meng Hao felt bad, and even worse when he remembered that Uncle Wang the carpenter only had one son.\u003c/p\u003e\n\u003cp\u003e“Little Tiger, you stick with us. With Meng Hao around, no one will dare bully you.” Fatty clapped the young man emotionally on the shoulder.\u003c/p\u003e\n\u003cp\u003e“No, that’s okay, I’m… I’m fine.” The young man seemed to hesitate, and Meng Hao could tell that he was thinking about something. In the end, he shook his head and refused Fatty’s offer. He saluted them with clasped hands, then made his way away from the plateau.\u003c/p\u003e\n\u003cp\u003e“What’s the deal with him?” asked Fatty, still in shock.\u003c/p\u003e\n\u003cp\u003e“Everyone has secrets,” said Meng Hao slowly. “Perhaps he made some lucky break that he doesn’t want to talk about. Otherwise, why would he come here at only the first level of Qi Condensation?” Meng Hao seemed to be lost in thought as he watched the young man disappear into the distance.\u003c/p\u003e\n\u003cp\u003e“Even if Little Tiger has some secret, we could still find it out on our own if we wanted to. He’s looking down on us.” Fatty brooded. He had an open and straightforward personality, and didn\u0027t think in scheming ways. To offer someone something in good faith and be turned down this way obviously raised his indignation.\u003c/p\u003e\n\u003cp\u003eIn the lower regions of the lands of South Heaven, winter was short and passed almost in an instant. The warmth of Spring arrived, and the flowers bloomed. It was once again April. A year had passed since Meng Hao had arrived at the Reliance Sect.\u003c/p\u003e\n\u003cp\u003eWith Fatty’s help, he had accumulated quite a bit of Spirit Stones from the Low-Level Public Zone, and even more medicinal pills and magical items. He would often go into the wild mountains to hunt for demonic beasts. He even roamed close to the black mountain in his search, but always came up empty-handed. The roars which emanated from the black mountain region grew more and more intense, so Meng Hao didn’t dare to enter.\u003c/p\u003e\n\u003cp\u003eHe had one third-level Demonic Core which he duplicated multiple times with the copper mirror. Eventually, his Cultivation base reached the middle of the fourth level. But then, his progress virtually ceased. No matter how many medicinal pills he consumed, the only thing it did was make his spiritual energy a bit more pure.\u003c/p\u003e\n\u003cp\u003eHe had reached a bottle neck and could not break through to the fifth level and his much desired Wind Walking technique.\u003c/p\u003e\n\u003cp\u003eWith Meng Hao’s help, Fatty reached the second level of Qi Condensation, which left him feeling quite awe-inspiring.\u003c/p\u003e\n\u003cp\u003eThat April, all Outer Sect disciples higher than the fifth level, as well as Elder Sister Xu and Elder Brother Chen, were dispatched out of the sect. They each returned with two or three youths who possessed latent talent, who then became servants.\u003c/p\u003e\n\u003cp\u003eOnce per year. That was the Sect rule. This was the only way to ensure the continuation of the Sect’s existence.\u003c/p\u003e\n\u003cp\u003eThe spring wind blew across the land, taking the cold along with it. Heat returned. Soon, autumn arrived, and then it was October. During this period of time, two important things happened in the Reliance Sect. The first was related to one of the Sect’s Grand Elders. Other than the Sect leader, who everyone said had already reached the Core Formation stage, there were two other Grand Elders who had reached Foundation Establishment. One of them, who had reached the end of his longevity, passed away while meditating, at around one-hundred and fifty years of age. When Meng Hao caught wind of this, he asked around and confirmed that it had not been Grand Elder Ouyang.\u003c/p\u003e\n\u003cp\u003eWhen Cultivators reach Foundation Establishment, it expands their longevity to one hundred and fifty years. That seems like a long time, but it is actually a very intense period. If the Cultivator cannot reach Core Formation, then in later years, they can only sit in meditation, shrivelling up, their Qi and blood slowly dissipating.\u003c/p\u003e\n\u003cp\u003eHowever, after reaching Core Formation, longevity is then doubled to three hundred years.\u003c/p\u003e\n\u003cp\u003eBecause of the Grand Elder’s death in meditation, the Reliance Sect was put in a bad position. It was already in a weak standing in the State of Zhao, and was now in even more danger. Suddenly, Cultivators from other Sects began to appear near the Reliance Sect’s borders.\u003c/p\u003e\n\u003cp\u003eThey seemed to be searching for something, so the Reliance Sect set up defensive spells around the mountain. Everything within several thousand meters fell under their protection. Figurative storm clouds appeared, dark and thick, pressing down on the entire Sect.\u003c/p\u003e\n\u003cp\u003eMost disciples in the Outer Sect had their guesses. Some of them were more informed than others, and received bits and pieces of information. News spread, and soon, a rumor developed that the Cultivation world of the State of Zhao was stirring because of Patriarch Reliance, who had been missing for four hundred years.\u003c/p\u003e\n\u003cp\u003eAs for the details, none of the Outer Sect disciples were sure.\u003c/p\u003e\n\u003cp\u003eDuring this time, Meng Hao’s Cultivation base continued to be stuck in the middle of the fourth level. Nothing he did seemed to have any effect, and finally he grew to accept that he was stuck in a bottleneck.\u003c/p\u003e\n\u003cp\u003eHe sat cross-legged in the Immortal’s cave, frowning. “Elder Sister Xu told me that breaking through from the peak of the fourth level into the fifth level would involve a bottleneck. But why did my bottleneck come early… Is it really because I consumed too many Demonic Cores?\u003c/p\u003e\n\u003cp\u003e“If that’s the case, I need some medicinal pills especially designed for breaking through bottlenecks. Or perhaps I need some high level Demonic Cores.” He had quite a collection of Spirit Stones, but lacked the appropriate medicinal pills. He was confident that if he just had the right medicinal pills, he could break through to the fifth level of Qi Condensation.\u003c/p\u003e\n\u003cp\u003eThe anxiety in the Reliance Sect was palpable. Many disciples walked to and fro with troubled hearts, trying their best to hide their feelings. Meng Hao felt the nervousness too, and of course he was dealing with his own critical matter.\u003c/p\u003e\n\u003cp\u003eThe only person who seemed happy was Fatty. He was even more enthusiastic about their stall on the plateau than Meng Hao. Even when Meng Hao didn’t feel like going, he would take the banner there himself to do business.\u003c/p\u003e\n\u003cp\u003eThree days later, bells sounded out. Pill Distribution Day had come. When Meng Hao and Fatty arrived at the square, Meng Hao caught sight of a golden-robed old man on the platform, behind whom stood Elder Sister Xu and Elder Brother Chen.\u003c/p\u003e\n\u003cp\u003eSeeing this, Meng Hao’s heart began to thump, and a fire burned in his eyes.\u003c/p\u003e\n\u003cp\u003e“In the past year and a half, Master Uncle Shangguan has only appeared three times, and each time was an Individual Pill Distribution. My Cultivation base has been stuck in a bottleneck in the fourth level for almost a year. If there is a high level medicinal pill…” Other Outer Sect disciples had similar thoughts, and soon, conversations buzzed in the air. Of course, some disciples were thinking, “Please, don’t give it to me.”\u003c/p\u003e\n\u003cp\u003eThis was especially so because after what Meng Hao did with his pill that time, the Sect had made a new rule that prohibited gifting Individual Distribution medicinal pills to members of the Inner Sect.\u003c/p\u003e\n\u003cp\u003e“It’s… it’s a Dry Spirit Pill!”\u003c/p\u003e\n\u003cp\u003e“It is! A Dry Spirit Pill. There was one distributed last year, and now one more. Only one per year! That just shows how valuable it is!”\u003c/p\u003e\n\u003cp\u003e“If I can get my hands on it, I will definitely have a breakthrough in my Cultivation base.”\u003c/p\u003e\n\u003cp\u003eA louder buzz of excited talked arose as the gold-robed old man lifted the glowing, purple pill into the air.\u003c/p\u003e\n\u003cp\u003eWhen the pill appeared, Meng Hao’s eyes shone with a brilliant intensity. He had never before wanted a medicinal pill so much. In his eyes, it was not a medicinal pill, but his only hope of breaking through to the fifth level of Qi Condensation.\u003c/p\u003e\n\u003cp\u003eHe had been a member of the Sect for a while now, so he was now familiar with the various disciples. The Inner Sect had Elder Sister Xu and Elder Brother Chen, both of whom were at the seventh level of Qi Condensation. Rumor had it they would break through to the next level very soon.\u003c/p\u003e\n\u003cp\u003eUnder them was Wang Tengfei, who was stuck at the peak of the sixth level of Qi Condensation. To him, a Dry Spirit pill would be of little use. Besides him, there was one more disciple of the sixth level, the number two disciple Han Zong.\u003c/p\u003e\n\u003cp\u003eMeng Hao had seen him twice, and had pegged him to be wildly arrogant, someone who considered everyone to be beneath his notice. If he were here, he wouldn’t even cast a glance at the Dry Spirit Pill, just to show that he had a collection of even better medicinal pills.\u003c/p\u003e\n\u003cp\u003eAs for disciples of the fifth level of Qi Condensation, there were four in the Outer Sect and they could be considered to be virtual lords. They were rarely seen, as they often secluded themselves in meditation or traveled about the wild mountains in training.\u003c/p\u003e\n\u003cp\u003eThere weren’t many disciples of the fourth level. Including Meng Hao, there were seven in total. As for those under the fourth level, they might as well be bugs.\u003c/p\u003e\n\u003cp\u003e“Very well, quiet down everyone.” Wizened Shangguan Xiu’s voice reverberated out, as astonishingly powerful and suppressive as ever. However, compared to last year, Meng Hao was not as powerfully affected. Instead, his eyes shone with determination.\u003c/p\u003e\n\u003cp\u003e“In the past two years in which I have presided over Pill Distribution, I usually prefer to select a new disciple. The reason is that if we can continue to get new disciples, our sect will flourish.” He smiled, and his eyes swept over the crowd. Just when it seemed he had made his decision, his eyes fell upon Fatty, who stood next to Meng Hao filing away at his teeth with a sword. His face looked indifferent.\u003c/p\u003e\n\u003cp\u003eHe looked as round as a ball, and anyone who for the first time caught sight of him filing his teeth would find it hard pressed to decide whether to laugh or cry. Shangguan Xiu stared in amazement, then laughed.\u003c/p\u003e\n\u003cp\u003e“Never mind,” he said. “I’m going to give the pill to you.” He waved his right hand, and a purple light flickered as the Dry Spirit Pill shot toward Fatty. With a look of shock, he instinctively caught it, looking as if he didn’t even know what had just happened. Then, his expression changed and he let out a yelp. His body began to tremble as the blood drained from his face. He looked like he was about to cry.\u003c/p\u003e\n\u003cp\u003e“This… Me… Crap, why did it have to be me?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-1-chapter-18\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-1-chapter-20\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-1-chapter-19","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
