{"id":52595,"no":270,"title":"Chapter 269: He’s the Faceless Azure Hero!","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 269: He’s the Faceless Azure Hero!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Pipe down!” said Meng Hao coolly, completely ignoring the incoming beam of light and the large cauldron. He slapped his bag of holding, and instantly, a simple wooden sword appeared.\u003c/p\u003e\n\u003cp\u003eGripping the sword in his hand, he swiped it at the beam and the cauldron.\u003c/p\u003e\n\u003cp\u003eThe slash of the sword seemed to split the very air, sending ripples out, as well as a bright white glow. The seemingly casual slash appeared to contain some great Dao, as if great winds of Time were sweeping out through the ripples.\u003c/p\u003e\n\u003cp\u003eWithin the approaching beam of light was a flying axe. Storm winds filled with a sixty-year cycle worth of Time slammed into the flying axe. Immediately, black spots appeared on its surface, as if it were aging. The spiritual power of the axe began to decay. Within the blink of an eye, it was so decayed that it seemed as if it would wither away. It immediately dropped down onto the ground.\u003c/p\u003e\n\u003cp\u003eThe wind was still there; it rushed toward the illusory cauldron, which began to tremble and distort. A full sixty-year cycle worth of Time seemed to have passed. Something illusory like this could not withstand such a passage of Time. The previously seemingly impregnable cauldron suddenly began to dissipate.\u003c/p\u003e\n\u003cp\u003eThe wind landed onto Black Lands Dao Child Luo Chong, gently brushing across him. The vitality in his skin seemed to be carried away by the wind. Wrinkles appeared on his hands, and beneath his mask, his face began to age. A sixty-year cycle worth of life force was suddenly sucked out of him. An indescribable feeling of weakness welled up inside. An unprecedented expression of fear covered his face; his body trembled and he coughed up a mouthful of blood. He staggered backward, a look of disbelief filling his eyes.\u003c/p\u003e\n\u003cp\u003e“You….” His body trembled, and his face went pale. His skin continued to wither, and his entire body became emaciated. The mask suddenly fell off, revealing that his once black hair was now white. His face was that of an old man, a face that still contained a trace of its former bravery, but was now mostly covered with shock and dread. Everything was deathly silent.\u003c/p\u003e\n\u003cp\u003eThe three azure-masked Cultivators suddenly stood up, their eyes filled with serious expressions. On the ground, the tens of thousands of Cultivators from the Southern Domain were silent for a moment. Then a massive hubbub broke out.\u003c/p\u003e\n\u003cp\u003eThe other Dao Child, Xu Fei, subconsciously retreated a few steps, eyes filled with a look of dread as she looked at Meng Hao.\u003c/p\u003e\n\u003cp\u003eWang Lihai and Han Shandao both took in deep breaths, staring in shock. Their hearts were pounding.\u003c/p\u003e\n\u003cp\u003eA divine ability like this was enough to shock everyone under Heaven. The entire time, Meng Hao, had only made one swipe with his sword!\u003c/p\u003e\n\u003cp\u003eThe axe had been sent into a state of decay, the illusory cauldron had been dispelled, and Luo Chong had lost a sixty-year cycle of life. All of it gave rise to great waves of discussion.\u003c/p\u003e\n\u003cp\u003e“What… what magical technique was that?!?!”\u003c/p\u003e\n\u003cp\u003e“It was that sword! It must be a divine ability from that sword!!”\u003c/p\u003e\n\u003cp\u003e“No wonder he dares to challenge the Core Formation stage. Who is he…? He’s wearing azure-colored clothes. Don’t tell me….”\u003c/p\u003e\n\u003cp\u003eAs the buzz of conversation filled the air, Dao Child Luo Chong stood there trembling, his face pale. His expression was one of thorough confusion.\u003c/p\u003e\n\u003cp\u003eMeng Hao flicked his sleeve and, his voice cool, said, “I’ve taken a sixty-year cycle of Time away from you. Now do you understand the height of the Heavens and the depth of the Earth?” With that, he ignored him, focusing his gaze on Wang Lihai and Han Shandao.\u003c/p\u003e\n\u003cp\u003eWang Lihai looked at him and suddenly said, “It seems your excellency is wearing his true face today. I understand that you thoroughly defeated me that day. However, there is still another fight to be had between us in the future!”\u003c/p\u003e\n\u003cp\u003eHan Shandao from the Solitary Sword Sect clasped hands and bowed. “Faceless Azure Hero…. Sir, I’m much obliged for your pointers before.”\u003c/p\u003e\n\u003cp\u003eTheir words caused the surrounding Cultivators to instantly grow quiet. However, the silence only lasted for the space of a few breaths. Suddenly, a clamor arose which was loud enough to shake the land.\u003c/p\u003e\n\u003cp\u003e“What?! He’s the Faceless Azure Hero!”\u003c/p\u003e\n\u003cp\u003e“The Faceless Azure Hero! He’s made a sudden rise to prominence recently! He swept over Chosen and suppressed Dao Children. So, it’s him!!”\u003c/p\u003e\n\u003cp\u003e“I wonder what Sect the Faceless Azure Hero is from? Considering how incredible he is, he must be a Dao Child!”\u003c/p\u003e\n\u003cp\u003eAs the noise of the clamor lifted up, everyone stared with burning eyes at Meng Hao. The Faceless Azure Hero’s reputation was just too incredible. It was a mystery that few people within the western region of the Southern Domain weren’t talking about.\u003c/p\u003e\n\u003cp\u003eLuo Chong gasped, and immediately retreated several paces. Before coming to the Southern Domain, he had heard of the Faceless Azure Hero, and had come to view him as a formidable adversary. How could he have ever imagined that the person in front of him was none other than that Faceless Azure Hero? His heart filled with bitterness as he realized that he was decisively defeated.\u003c/p\u003e\n\u003cp\u003eConsidering that the defeat had been witnessed by tens of thousands of Cultivators, it was obvious that the word would quickly spread throughout the Southern Domain. Black Lands Dao Child Luo Cheng had lost a sixty-year cycle’s worth of Time in a single sword blow.\u003c/p\u003e\n\u003cp\u003eA fierce glow sprang up in Luo Chong’s eyes as he retreated. Suddenly, he cried out, “Azure-masked Elders, please kill this guy!” Suddenly, the eyes of the two other azure-masked Cultivators began to flicker with killing intent.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was the same as ever, without even the slightest change. The instant he made his decision to attack, he had anticipated that something like this would happen. Before the echo of Luo Chong’s words could die out, Meng Hao’s voice could be heard.\u003c/p\u003e\n\u003cp\u003eThis time, he spoke to the surrounding tens of thousands of Cultivators.\u003c/p\u003e\n\u003cp\u003e“Fellow Daoists of the Southern Domain. I am Fang Mu, a simple Furnace Lord of the Violet Fate Sect. A year ago, Black Lands Cultivators ambushed me and my Fellow Furnace Lord Zhou Dekun in the Barren Mountains. I escaped by a fluke, but I’m not sure if Zhou Dekun made it out alive or not. Because of enlightenment from this Dao Geyser, my Cultivation base has reached new heights. Today, I come to battle my opponent from that day in the Barren Mountains. Fellow Daoists of the Southern Domain, I would like to request that all of you bear witness to this battle!” His words rang out like thunder, causing a great stir among the tens of thousands of Cultivators below.\u003c/p\u003e\n\u003cp\u003e“Furnace Lord… he’s… actually a Furnace Lord from the East Pill Division!!”\u003c/p\u003e\n\u003cp\u003e“Fang Mu. I remember! A year ago there was a new Furnace Lord in the East Pill Division named Fang Mu!”\u003c/p\u003e\n\u003cp\u003e“He’s Fang Mu! A Furnace Lord!”\u003c/p\u003e\n\u003cp\u003eThe Cultivators were in an uproar as they looked at Meng Hao. Great waves of astonishment filled their hearts. The name of the Faceless Azure Hero already caused their hearts to shake, but what was even more shocking were the words ‘Furnace Lord.’\u003c/p\u003e\n\u003cp\u003eThe glittering eyes of all the Cultivators were now glued onto Meng Hao!\u003c/p\u003e\n\u003cp\u003e“No wonder he didn’t kill any of the heroes that he challenged in battle!”\u003c/p\u003e\n\u003cp\u003e“Grandmaster Fang Mu was doing it all to gain enlightenment! He had to attack, but he’s an alchemist, and didn’t want to make enemies. Therefore, he restrained his killing intent. This is an alchemist of our Southern Domain! This is a true Chosen Cultivator of the Southern Domain!!!”\u003c/p\u003e\n\u003cp\u003eAmidst the uproar, Black Lands Dao Child Luo Chong’s face suddenly changed. He stared blankly at Meng Hao, his mind reeling. Meng Hao’s identity was causing a huge commotion amongst the crowd, but it was completely rocking his mind and heart.\u003c/p\u003e\n\u003cp\u003eNext to him, Xu Fei was also panting and looking at Meng Hao with an expression of disbelief.\u003c/p\u003e\n\u003cp\u003eThe three azure-masked Cultivators had grim expressions in their faces. Two of them, not the skinny one, were frowning.\u003c/p\u003e\n\u003cp\u003eIntense killing intent poured from Meng Hao’s eyes, and his gaze shifted to the skinny, azure-masked Cultivator. “My battle today is with this man. If anyone interferes, if any other Black Lands Cultivators participate, then I request all the Fellow Daoists from the Southern Domain to stop them!”\u003c/p\u003e\n\u003cp\u003eWang Lihai’s eyes glittered, and he immediately said. “The Wang Clan of the Southern Domain will bear witness to this battle. If the Black Lands Cultivators interfere, then they will make an enemy of the entire Wang Clan!”\u003c/p\u003e\n\u003cp\u003e“The Solitary Sword Sect of the Southern Domain will bear witness to the battle. If a second Black Lands Cultivator makes a move, they will make an enemy of the Solitary Sword Sect.”\u003c/p\u003e\n\u003cp\u003e“The Golden Frost Sect of the Southern Domain will bear witness to the battle! If any Black Lands Cultivator dares to join the battle, the Golden Frost Sect will be forced to interfere!”\u003c/p\u003e\n\u003cp\u003e“The Blood Demon Sect of the Southern Domain will bear witness to the battle!”\u003c/p\u003e\n\u003cp\u003e“The Black Sieve Sect of the Southern Domain will bear witness to the battle!”\u003c/p\u003e\n\u003cp\u003e“The Song Clan of the Southern Domain will bear witness to the battle!”\u003c/p\u003e\n\u003cp\u003e“The….”\u003c/p\u003e\n\u003cp\u003eOne after another, voices rang out, without end. The tens of thousands of Cultivators were no longer sitting cross-legged. The were all standing, glaring up angrily at the Black Lands Cultivators.\u003c/p\u003e\n\u003cp\u003eAll the Clans. All the Sects. Their voices rang out, melding into a roar that shook heaven and earth. It was like an endless thunder.\u003c/p\u003e\n\u003cp\u003eThe Cultivators here were all of the Foundation Establishment stage. However, they represented countless Sects and Clans of the Southern Domain. Clearly, they could influence the attitude of their Sects as a whole. Considering that they were all giving voice to the same opinion, the Black Lands Cultivators were now pushed into a very narrow corner.\u003c/p\u003e\n\u003cp\u003eOne mistake could give rise to a great war between the Southern Domain and the Black Lands!\u003c/p\u003e\n\u003cp\u003eLuo Chong’s face twisted, and his body trembled. Next to him, Xu Fei was panting. The other black-robed Cultivators from their group all looked very nervous, and were currently rotating their Cultivation bases.\u003c/p\u003e\n\u003cp\u003eThe faces of the three azure-masked Cultivators immediately changed.\u003c/p\u003e\n\u003cp\u003eThe skinny Cultivator had a grim expression underneath his mask. He stepped forward and said, “This is a personal matter between this kid of the junior generation and I, Yang. Outsiders need not interfere. It has nothing to do with the Black Lands. Fang Mu, you pup, it seems you’re seeking to die. Very well, I shall help you!” His voice rang out, causing the surrounding Black Lands Cultivators to back up. In an instant, the only people floating in the air were him and Meng Hao.\u003c/p\u003e\n\u003cp\u003eThis was to be their battleground!\u003c/p\u003e\n\u003cp\u003e“It seems you’ve put a lot of thought into how you want to die,” said the azure-masked Cultivator coolly. “If I didn’t help you, I would feel bad.” Killing intent radiated out of his eyes. He lifted his hand, and suddenly a light yellow aura appeared. This was none other than his Core Qi!\u003c/p\u003e\n\u003cp\u003eThis Qi had ever-changing forms, and currently it transformed into the image of a sword.\u003c/p\u003e\n\u003cp\u003eMeng Hao watched on with concentration in his eyes. This was a crucial battle for him. His Cultivation base was constantly rotating, along with that imperceptible Qi. It seemed to thirst for Meng Hao to make an attack, to grow stronger. When he did, it would transform into a charging force that would lead to a breakthrough in his Cultivation base!\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Anonymous\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-3-chapter-268\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-3-chapter-270\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-3-chapter-269","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
