{"id":52640,"no":315,"title":"Chapter 313: She\u0027s an Immortal!","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 313: She\u0027s… an Immortal!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe intense feeling of life-or-death crisis caused the elders from the Ji and Li Clans to feel shaken at heart. Their eyes shone with intense astonishment.\u003c/p\u003e\n\u003cp\u003eConsidering their Cultivation bases, age, and vast experience, there were not very many things in the world which could truly cause them to be astonished.\u003c/p\u003e\n\u003cp\u003eBut now, deep feelings of danger welled up simultaneously within their hearts.\u003c/p\u003e\n\u003cp\u003eFor Nascent Soul Cultivators to feel crisis like this also filled them with vast terror.\u003c/p\u003e\n\u003cp\u003eIt was extremely difficult to practice cultivation all the way to the Nascent Soul Stage. Many, many people fell while treading such a path; for these men to reach this point meant that they possessed good luck and had experienced plenty of fortunate circumstances. Now, however, facing this life-or-death crisis had a profound effect on their hearts and minds.\u003c/p\u003e\n\u003cp\u003eFor the first time, these more than ten men suddenly felt regret….\u003c/p\u003e\n\u003cp\u003eHowever, before they had the chance to retreat, an intense roaring sound poured out from the three hundred meter wide blood-red screen. It seemed to be filled with enough power to destroy any obstacle in its way.\u003c/p\u003e\n\u003cp\u003eThe sound of it filled the air, causing everyone that heard it to be completely shaken in heart and mind. Some people with less powerful Cultivation bases coughed up blood. The ten or so old men watched on in shock as the massive blood-colored screen suddenly seemed to be rent open.\u003c/p\u003e\n\u003cp\u003eFrom within billowed a massive glowing red light. Within the red light… could be seen….\u003c/p\u003e\n\u003cp\u003eAn enormous, paw, stretching out toward them!\u003c/p\u003e\n\u003cp\u003eIt was only one paw, something that belonged to a gigantic wild beast. It possessed long, razor-sharp claws, and was covered with thick, red fur. It carried with it an indescribable, demonic aura. It was only one paw, about thirty meters in size, that emerged from the blood-red screen; it ignored the force which was suppressing Cultivation bases, and shot out.\u003c/p\u003e\n\u003cp\u003eThe instant the claw appeared, an intense, terrifying aura also could be clearly sensed. It exploded out, filling the area, causing the faces of the dozen or so old men to fill with shock. Their pupils constricted, and they retreated backward, minds reeling.\u003c/p\u003e\n\u003cp\u003e“That’s….”\u003c/p\u003e\n\u003cp\u003e“The aura of Spirit Severing!!”\u003c/p\u003e\n\u003cp\u003e“Dammit! How could this Meng Hao have a Spirit Severing aura with him!?!?”\u003c/p\u003e\n\u003cp\u003eThe scalps of the ten or so old men immediately went numb, and the sense of crisis grew even stronger. In the very instant in which they attempted to flee, the paw which had emerged from the blood-colored screen raised into the air. Then, it struck down toward them.\u003c/p\u003e\n\u003cp\u003eThis was of course the paw of the sleeping Blood Mastiff. During the fleeting ten years which had passed, it had been incapable of awakening. However, after Meng Hao reached Core Formation, a greater connection had appeared between them. Meng Hao’s repeated calls, and the critical moment of life-or-death he faced, were an intense provocation that caused the Blood Mastiff to suddenly wake up.\u003c/p\u003e\n\u003cp\u003eIn this moment, all it could do was extend its paw into the world and strike down.\u003c/p\u003e\n\u003cp\u003eA roaring sound filled heaven and earth. The mastiff, which had already evolved to the Spirit Severing level, sent its paw whistling down. Three of the elders from the Ji Clan had expressions filled with insanity as, unable to evade, their Cultivation bases exploded.\u003c/p\u003e\n\u003cp\u003eThe three men emitted blood-curdling screams. Blood sprayed from their mouths, and their bodies began to collapse. Their Nascent Souls made to flee, but before they could get very far, were shattered by the paw.\u003c/p\u003e\n\u003cp\u003eAmong the elders from the Li Clan, there were four who were too slow to evade. This slowness resulted in their instant death.\u003c/p\u003e\n\u003cp\u003eA boom could be heard as the Blood Mastiff’s massive paw descended onto the four of them. Their bodies were instantly turned into mutilated flesh; their Nascent Souls were incapable of fleeing, and were immediately crushed into powder!\u003c/p\u003e\n\u003cp\u003eThis scene caught everyone by surprise. In the blink of an eye, of the dozen or so Nascent Soul Cultivators, seven had been instantly slain!!\u003c/p\u003e\n\u003cp\u003eThese seven men were incapable of withstanding even a single blow from the paw of the Blood Mastiff, and were thoroughly and instantly exterminated. This instantly caused the rest of the old men to be filled with fear; the blood drained from their faces, their hearts began to race, and their scalps went numb. The only thing they could think of at the moment was to flee as quickly as possible.\u003c/p\u003e\n\u003cp\u003eEverything was going opposite to expectation, and was exceeding the limits of their imagination. How could they possibly have predicted that Meng Hao, a trifling Core Formation Cultivator, would be… so difficult to kill!\u003c/p\u003e\n\u003cp\u003eThey had no way of knowing that to Meng Hao, reaching Core Formation was merely the first stepping stone on his path to the top. After reaching Core Formation, he had a vast array of magical techniques and other methods that he could employ.\u003c/p\u003e\n\u003cp\u003eYou could say that Meng Hao had saved up everything for an explosive finale!\u003c/p\u003e\n\u003cp\u003eThe boom was still echoing out as the mastiff’s paw slowly began to fade away. The massive blood-colored screen also began to disappear. Meng Hao grabbed the mask as it fell toward the ground.\u003c/p\u003e\n\u003cp\u003eAt the moment, Han Bei and the others seemed to be incapable of even breathing. They stared at the oilless lamp which was Meng Hao. None of them had ever imagined that events could turn about in the way they had.\u003c/p\u003e\n\u003cp\u003e“Blood Divinity!” breathed Li Shiqi, trembling. “That was a Blood Divinity!!” The others immediately thought back to the Blood Immortal Legacy tournament, and the blood-colored mastiff.\u003c/p\u003e\n\u003cp\u003eBack then, they’d had no idea who the mastiff belonged to. Now, you could say that they understood, but had little time to think about it. Seeing everything that they just had, with their own eyes, caused their minds to spin.\u003c/p\u003e\n\u003cp\u003eClutching the blood-colored mask, Meng Hao produced some medicinal pills, which he consumed. Gritting his teeth, he struggled to his feet. He looked over at the group of people. His gaze lingered on Xu Qing for a moment, and then, he turned and continued to head toward the Rebirth Cave with as much speed as he could muster.\u003c/p\u003e\n\u003cp\u003e“Fang Mu….” cried Chu Yuyan. Seeing him turn to leave, she suddenly realized she had no way of knowing when she might see him again. If she didn’t call out, perhaps she would never have another chance to do so.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s body quivered slightly, but he continued onward.\u003c/p\u003e\n\u003cp\u003eHe was well aware that the Nascent Soul eccentrics had been intimidated by the sudden appearance of the Blood Mastiff, and its slaying of their seven compatriots. However, it wouldn’t take long for them to realize what was really going on. After a moment’s hesitation, they would surely see that Meng Hao might seem strong on the outside, but was actually incomparably weak. Then, it would only be moments before they went after him again.\u003c/p\u003e\n\u003cp\u003eAs for the Blood Mastiff, after attacking just now, it had instantly fallen back into slumber. Now, it didn’t matter how many times Meng Hao called to it, it wouldn’t be able to awaken.\u003c/p\u003e\n\u003cp\u003e“All paths to the outside are sealed tight. My only option is… the Rebirth Cave.” Gritting his teeth, Meng Hao whistled forward through the air.\u003c/p\u003e\n\u003cp\u003eIt was at this point that the remaining seven or eight old men who had not been slain, suddenly ceased their fleeing. Their expressions were now filled with hesitation. It seemed they were analyzing everything that had just happened. Considering their age and experience, it only took the space of about ten breaths for them to grasp the situation. Unsightly expressions appeared on their faces; they immediately turned and headed back.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, all of the fleeing Nascent Soul Cultivators once again headed in pursuit of Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao was only about twenty-five kilometers from the Rebirth Cave, when from within it, a soft sigh could suddenly be heard.\u003c/p\u003e\n\u003cp\u003eIt was the sigh of a woman. The sound was completely unexpected, but the instant it filled the air, the faces of the remaining Nascent Soul Cultivators flickered, and they coughed up blood as they tumbled backward, bodies shaking. Dumbstruck looks filled their faces; it seemed that whatever they had just encountered was even more intensely powerful than the Blood Mastiff.\u003c/p\u003e\n\u003cp\u003eWithin their trembling bodies, their Nascent Souls also shook, and their fear climbed to the pinnacle.\u003c/p\u003e\n\u003cp\u003eIt wasn’t just them. All of the Cultivators outside of the basin also heard the sigh, and it sent their minds and heart shaking. Blood sprayed from their mouths. Unprecedented looks filled the faces of the Spirit Severing Patriarchs from the various Sects.\u003c/p\u003e\n\u003cp\u003e“That’s….”\u003c/p\u003e\n\u003cp\u003eTheir faces fell and blood erupted from their mouths; they appeared to have received severe internal injuries!\u003c/p\u003e\n\u003cp\u003eWithin the fog of the basin, the Spirit Severing Cultivator from the Ji Clan also coughed up blood. The astonishment on his face could not be any more intense as he heard the sound from the Rebirth Cave.\u003c/p\u003e\n\u003cp\u003eThis was not the voice of one of the strange life forms that existed there; this was the sigh of a woman!\u003c/p\u003e\n\u003cp\u003eWithin the fog, the Wang Clan Patriarch, who was invisible to everyone, felt his entire body shaking. “Who is that…? She’s… an Immortal!!” It was as if a violent storm had kicked up within him; an intensely somber look filled his face, and his eyes glowed brightly. Threads of dread and shock filled his eyes as he looked toward the Rebirth Cave.\u003c/p\u003e\n\u003cp\u003eIt was at this moment that the voice of a woman could be heard coming from the Rebirth Cave.\u003c/p\u003e\n\u003cp\u003eThe voice was warm, and accompanied by another soft sigh. “Years ago, you accidentally loosened the seal which held me. That counts as sowing Karma…. You cannot come to the Rebirth Cave today. Go, I’ll help you to escape. This counts as reaping Karma.” As the voice echoed out from the cave, a white, glowing light could suddenly be seen flying out.\u003c/p\u003e\n\u003cp\u003eIt was a scale!\u003c/p\u003e\n\u003cp\u003eA fish scale!\u003c/p\u003e\n\u003cp\u003eEven as it flew forth, it suddenly also appeared to be a feather.\u003c/p\u003e\n\u003cp\u003eThe feather of a roc!\u003c/p\u003e\n\u003cp\u003eThe scale-like feather flew out with incredible speed, almost immediately appearing directly in front of Meng Hao. As it did, it immediately branded itself onto his forehead. Meng Hao’s entire body shook as a warm power surged out from the scale-like feather, filling his entire body.\u003c/p\u003e\n\u003cp\u003eImmediately, his Cultivation base became stable. It was no longer burning and collapsing. Instead, it was completely restored. As before, he was at the early Core Formation Stage. In the blink of an eye, his wounds were healed by nearly twenty percent.\u003c/p\u003e\n\u003cp\u003eIn fact, even his longevity was increased by a bit; Meng Hao’s face was no longer that of an old man. It looked young, as it had before. The paleness of it, however, could not be changed.\u003c/p\u003e\n\u003cp\u003eThe whiteness of his hair was also not possible to change.\u003c/p\u003e\n\u003cp\u003e“I will lend you the power of a roc. Go. Leave this place….” As the voice echoed out, Meng Hao’s body suddenly felt an incredible power pushing at him, sweeping up against his body, propelling him. Suddenly, he began to shoot forward like a roc.\u003c/p\u003e\n\u003cp\u003eThe eight Nascent Soul Cultivators hadn’t the slightest inclination to block him. The voice of the woman from the Rebirth Cave was enough to send terror into the hearts of anyone in the area.\u003c/p\u003e\n\u003cp\u003eMeng Hao had no time to think as he suddenly shot out of the basin and appeared in the outside world, in front of the eyes of the Cultivators of all the Sects and Clans of the Southern Domain.\u003c/p\u003e\n\u003cp\u003eWhat they saw was something like a shooting star. Within the shooting star was Meng Hao, his hair white, his robe the color of blood.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes glowed with confusion, but only for a moment, and then was replaced with understanding. He knew who it was that was helping him.\u003c/p\u003e\n\u003cp\u003e“The roc…. She’s the roc that was flying toward the Rebirth Cave that year…. But why is she saving me? How exactly did I sow Karma with her…?”\u003c/p\u003e\n\u003cp\u003e“Everyone in the League of Demon Sealers is heartless….” she said with a sigh. “You\u0027re on your own now.” As her words echoed in his ears, his eyes went wide.\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003eIf you would like to review chapters regarding the roc, check out chapters \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-104/\"\u003e104\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-110/\"\u003e110\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-111/\"\u003e111\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-112/\"\u003e112\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Jonas Lecok, James Cruce, Tjandra Johannes, and Scott Smith II\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-3-chapter-312\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-3-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-3-chapter-313","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
