{"id":52678,"no":353,"title":"Chapter 350: The Indomitability of Time","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 350: The Indomitability of Time\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhat is Time…?\u003c/p\u003e\n\u003cp\u003eMany years later, Dongluo Han would never be able to forget what he saw that day as he stood atop that bright green leaf. His eyes were blank, but his mind was awake. He saw his body beginning to grow old. He saw the green leaves around him growing decrepit and old. He saw the land around him becoming ancient.\u003c/p\u003e\n\u003cp\u003eAs the Lotus Sword Formation spun, and its power emanated out, Meng Hao hovered above the fog looking down inside, observing the effects of the power of Time which he wielded.\u003c/p\u003e\n\u003cp\u003eOn the one hand, it was something of ultimate flexibility within Heaven and Earth. On the other hand, it contained paramount indomitability.\u003c/p\u003e\n\u003cp\u003eNo person, no living thing, no creature could stand up to that gentle onslaught which is Time. It didn’t matter if you used spell formations or divine abilities, illusory or tangible items. All of it… would deteriorate under indomitable, smashing Time.\u003c/p\u003e\n\u003cp\u003eAnd this was a single Lotus Sword Formation formed with Time Swords. Only one of them contained three sixty-year cycles; the others were incomplete. If all the Time Swords contained three sixty-year cycles, then that combination would be a power of Time equal to one thousand eight hundred years. That was enough to shock the Heavens and rock the Earth.\u003c/p\u003e\n\u003cp\u003eThis is Time!\u003c/p\u003e\n\u003cp\u003eIn this moment, all of the surrounding Rogue Cultivators had lost the power to even breathe. They stared in shock at the land. It looked somewhat yellow, like an old painting which was slowly fading away into dust.\u003c/p\u003e\n\u003cp\u003eWithin the fog, the Dongluo Clan members who were under Meng Hao’s control were coming to their senses. However, even as they did, they wished they hadn’t. This was because as they recovered, they found themselves on the verge of becoming ancient.\u003c/p\u003e\n\u003cp\u003eDongluo Ling looked down at her hands; they were covered with wrinkles. Her body was withered. All she could do was stare out blankly.\u003c/p\u003e\n\u003cp\u003eThe green shield of leaves surrounding Dongluo City was in the process of rotting. It started to show signs of breakage, and there were some areas where the shield couldn’t even cover the city. Fog started to pour inside, along with the power of Time, and the hyper toxic poison.\u003c/p\u003e\n\u003cp\u003eThis all gave birth to intense dread within the city; all of the Dongluo Clan Cultivators felt their hearts and minds trembling.\u003c/p\u003e\n\u003cp\u003eBefore they could even take any countermeasures, the fog began to seethe violently. The parrot suddenly shot out from within, flying up into the air and giving out a piercing cry.\u003c/p\u003e\n\u003cp\u003eBeneath it, the fog began to transform into columns of black smoke. The boundless fog, which was nearly five thousand meters in diameter, congealed into hundreds of bands of black smoke, which shot up to circulate around the parrot. Within them were the more than one thousand Cultivators of the Church of the Golden Light. Their eyes were closed, and they were surrounded by black smoke, as if they were part of the spell formation itself.\u003c/p\u003e\n\u003cp\u003eThe trembling onlookers watched as the black smoke congealed rapidly to form into the shape of an enormous black raven!\u003c/p\u003e\n\u003cp\u003eThe raven’s body emanated a black aura. It let out a piercing cry which seemed capable of causing the living to close their eyes and the dead to open theirs. It echoed out throughout Heaven and Earth, then slammed down onto Dongluo City like a meteor falling from the Heavens.\u003c/p\u003e\n\u003cp\u003eThis spectacle was a familiar sight to some of the audience. They had seen something very similar that night some time ago in Dongluo City. [1. This is referring to when Lord Fifth fought the Dongluo Clan for the first time in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-329/\"\u003echapter 329\u003c/a\u003e] Here it was again; however, the amount of power they could sense was far, far greater than that from before.\u003c/p\u003e\n\u003cp\u003eThey watched on in awe as the black raven screamed through the air directly toward the green leaf shield of Dongluo City.\u003c/p\u003e\n\u003cp\u003eAn enormous, deafening boom filled the air. The defense shield had already been weakened. Now, it trembled, unable to stand up to the force which assailed it; it suddenly began to collapse.\u003c/p\u003e\n\u003cp\u003eAs it exploded, vast quantities of trees within Dongluo City also began to fall apart. The leaves shattered. The shield… was completely gone!\u003c/p\u003e\n\u003cp\u003eAt the same time, the black raven began to disperse; it transformed into vast quantities of fog, which once again dispersed out to cover Dongluo City.\u003c/p\u003e\n\u003cp\u003eMiserable shrieks filled the air, along with explosions. The hyper toxic poison, along with the power of Time, swept through the city. Outside the fog, everything was quiet. No one spoke. The hundreds of observing Cultivators watched on blankly, their minds spinning. Everything that was happening was being sealed onto their minds, never to be forgotten.\u003c/p\u003e\n\u003cp\u003eWithin Dongluo City, the two Nascent Soul Elders stood pale-faced. The vast fog which surrounded them made it impossible to see their fellow Clan members. All they could hear were bloodcurdling screams echoing about.\u003c/p\u003e\n\u003cp\u003eThey were Nascent Soul Cultivators. Compared to everyone else around them, they were at the pinnacle of power. However, within this spell formation, they weren’t even able to move. No matter what divine abilities they utilized, they could not escape, nor break through the fog.\u003c/p\u003e\n\u003cp\u003eRage sprang into being in their minds, but even their rage was useless against the spell formation.\u003c/p\u003e\n\u003cp\u003eOn the first day, they were still able to come up with ideas about how to break out. On the second day, it was the same. In fact, they maintained this optimism until the fifth day. After that, though, they no longer heard any bloodcurdling cries from their fellow Clan members. Hopelessness filled them, and their expressions filled with complete frenzy.\u003c/p\u003e\n\u003cp\u003eTheir features had been assaulted by the power of Time for over five days. They were Nascent Soul Cultivators, but they were unable to fight the changes that resulted from such an onslaught.\u003c/p\u003e\n\u003cp\u003eOn the sixth day, the fog covering Dongluo City suddenly began to lift. It left the city, no longer filling it, but surrounding it. Not a scrap of fog was left to be seen inside.\u003c/p\u003e\n\u003cp\u003eWhat was clearly visible inside of Dongluo city was decay. Trees, leaves, everything looked as if it had been rotting there for hundreds of years.\u003c/p\u003e\n\u003cp\u003eThere were only three people left inside of the city. They were none other than the Dongluo Clan’s Nascent Soul Elders. The one who had been trapped inside the fog for the longest looked around in surprise as soon as it lifted. Immediately, his breathing grew ragged, and astonishment filled his eyes.\u003c/p\u003e\n\u003cp\u003eFrom beginning to end, he had assumed he was still in the basin of the Church of the Golden Light. Only now did he find out where the battle had actually been fought.\u003c/p\u003e\n\u003cp\u003eAt the same time, he caught sight of the other two Nascent Soul Elders. They all exchanged glances, then looked up silently as Meng Hao strode out from within the fog.\u003c/p\u003e\n\u003cp\u003eThe instant they saw him, the three of them began to grow blurry, as they prepared to use minor teleportation if necessary. Now that Meng Hao had made an appearance, they were determined to be prepared for anything.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at the three old men, then lifted his right hand. Immediately, hundreds of figures began to emerge from the surrounding fog. They were none other than all the other members of the Dongluo Clan, unconscious, dragged out by the fog itself.\u003c/p\u003e\n\u003cp\u003eThe appearance of these people caused the three old men to give up any notions of using minor teleportation. With all of their Clan members here, they wouldn’t take the risk.\u003c/p\u003e\n\u003cp\u003eThey stood there silently.\u003c/p\u003e\n\u003cp\u003e“Enough,” said Meng Hao. “You know, the fault is yours. If I hadn’t fought back, you would have assimilated me. Joining you wouldn’t be that bad, I guess, except you lack a bit in the sincerity department. I didn’t kill very many of your Clan members. They’re all here. I’ll trade them back to you for this broken down city of yours.” He looked at them, awaiting their answer.\u003c/p\u003e\n\u003cp\u003eThe hearts of the three Nascent Soul Cultivators filled with bitterness. They exchanged glances, and then Second Elder gritted his teeth and nodded.\u003c/p\u003e\n\u003cp\u003e“Things being the way they are,” he said, “we agree with everything you’ve said. Except….” Before he finished speaking, he locked gazes with Meng Hao. It seemed as if he were engaged in a respectful interchange, but suddenly, the bodies of the three Elders vanished. Using minor teleportation, they reappeared off to the side, looking as if they were going to make a run for it.\u003c/p\u003e\n\u003cp\u003eEven as Meng Hao looked over at them, First Elder, who hadn’t spoken the entire time, suddenly grew blurry. As he did, killing intent filled his eyes. When he reappeared, he was standing behind Meng Hao. His hand shot out hatefully, slamming into Meng Hao.\u003c/p\u003e\n\u003cp\u003eA boom filled the air as the Meng Hao in front of First Elder exploded into pieces. However, what dissipated out was nothing more than vast quantities of Qi.\u003c/p\u003e\n\u003cp\u003eNext, Third Elder shot toward the mist. He wasn’t fleeing; no, his right hand flickered an incantation. His body began to emit a buzzing sound, and an enormous hand appeared behind him. It shot into the mist, where it grabbed someone.\u003c/p\u003e\n\u003cp\u003eThe person it grabbed was none other than Meng Hao!\u003c/p\u003e\n\u003cp\u003e“Die!!” cried Third Elder. A boom rang out as the man clenched his fist. However… even as the boom filled the air, the Meng Hao within the fist suddenly dissipated into Qi.\u003c/p\u003e\n\u003cp\u003eThe three Elders’ faces fell. First Elder, Second Elder, who had been speaking just now, and Third Elder, all felt their hearts begin to pound.\u003c/p\u003e\n\u003cp\u003eThey had come up with their plan based on a few mutual glances. However, their plan had been defeated in an instant. Suddenly, roughly a dozen people walked out from within the fog. All of them were Meng Hao!\u003c/p\u003e\n\u003cp\u003eTheir appearances were completely identical, and all of them glared coldly at the three Elders.\u003c/p\u003e\n\u003cp\u003e“Patriarch of the Church of the Golden Light,” said Third Elder of the Dongluo Clan, shamed into rage, “will you only rely on your spell formation? Or do you dare to fight one on one with any of us?!” The frustration he had felt over the past days exploded out. The power of his Nascent Soul Cultivation base also emanated out; his entire body brimmed with power.\u003c/p\u003e\n\u003cp\u003eOne among the dozen of Meng Haos cleared his throat and said. “No, I don’t.” He looked a bit embarrassed.\u003c/p\u003e\n\u003cp\u003eEven as the words came out of his mouth, Second Elder appeared in front of him and launched an attack. Meng Hao’s body dissipated into black mist. But then… ten more Meng Haos walked out from the fog.\u003c/p\u003e\n\u003cp\u003eThe three old Cultivators were now starting to be inundated with a feeling of helplessness.\u003c/p\u003e\n\u003cp\u003e“Elders, don’t you think your acting this way is a bit improper?” said one of the Meng Haos, looking a bit bashful. “I’m sincerely trying to discuss a way to resolve the situation. The Dongluo Clan is quite well known in the Black Lands. Your position in the United Nine might be weakening as of late, but if your entire Clan dies overnight, that would be really embarrassing for you. I would once again like to request that you three Elders agree to hand over the city to me. What do you say?”\u003c/p\u003e\n\u003cp\u003eEven as he spoke, the hundreds of Dongluo Clan Cultivators wrapped up in the fog started quivering as the fog began to wrap tightly around their necks.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-349\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-351\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-4-chapter-350","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
