{"id":52723,"no":398,"title":"Chapter 395: Really Set Something Off.","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 395: Really Set Something Off….\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs the sound rose up into the air, Meng Hao’s eyes glittered. He could sense the mania that had arisen because of the Demon Nurturing Pill. He glanced down at the pill and then looked over at the five little green-colored wolves. Then, he reached out his left hand and pushed it down onto the ground.\u003c/p\u003e\n\u003cp\u003eAs he did, an invisible shield sprang into being that covered the several dozen meter area around him. It immediately cut off the strange Qi that the neo-demons could sense but the Cultivators couldn’t.\u003c/p\u003e\n\u003cp\u003eHowever, his actions were a bit too late. Even as the shield appeared, seven or eight booms could be heard as nearly twenty different types of neo-demons suddenly appeared nearby, roaring. These were level 6 neo-demons, with power equivalent to the late Foundation Establishment stage. Their eyes were red and filled with madness as they flew back and forth in the sky.\u003c/p\u003e\n\u003cp\u003eHowever, they were unable to find the source of the Qi, which of course Meng Hao had covered over. In addition, the Neo-Demon Kennellist Cultivators immediately flew up to try to placate them. After a bit of time passed, things eventually grew quiet again.\u003c/p\u003e\n\u003cp\u003eBy this time, it was getting late, and night had fallen over the land. Everything was growing dark. Meng Hao looked out at the calmness outside and then back at the little green-colored wolves in their kennels. Their eyes were bright red, and if the wooden door wasn’t sturdy enough, they would have broken through it.\u003c/p\u003e\n\u003cp\u003eIt seemed this medicinal pill he had concocted was incredibly enticing to them.\u003c/p\u003e\n\u003cp\u003e“Interesting. The Frigid Snow Clan… or should I call it the Agarwood Clan, must have produced so many Grand Dragoneers not only because of their secret Dragoneer technique, but because of this medicinal pill!\u003c/p\u003e\n\u003cp\u003e“Neo-demons…. That time ago back in the Black Lands, I absorbed Demonic Qi using the art of Righteous Bestowal. That’s why that woman from the Western Desert thought I was a Demon Lord. Demonic Qi really is bizarre. There must be some connection between all of these things.” After thinking about the matter for a while, he duplicated some Demon Nurturing Pills and then suddenly pointed down toward the ground. [1. The woman called Meng Hao a Demon Lord in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-324/\"\u003echapter 324\u003c/a\u003e]\u003c/p\u003e\n\u003cp\u003e“Righteous Bestowal!” Immediately, invisible Demonic Qi seethed up, although not too much. Meng Hao only stirred the Demonic Qi in a roughly three hundred meter wide area.\u003c/p\u003e\n\u003cp\u003eThe Demonic Qi rushed over to swirl around Meng Hao’s finger. He looked over to find strange expressions on the faces of the five little wolves. It almost seemed as if the enticement they felt because of the Demon Nurturing Pill had lessened. They were all staring dead at Meng Hao.\u003c/p\u003e\n\u003cp\u003eHis eyes flickered. Muttering to himself for a moment, he put the medicinal pills away and then dispelled the invisible shield that surrounded him. He silently sent the Spiritual Sense of his peak Perfect Gold Core out in all directions. There was no neo-demon or Cultivator who could possibly sense this Spiritual Sense.\u003c/p\u003e\n\u003cp\u003eWith his Spiritual Sense, he could see all of the hundreds of neo-demons in the area. They seemed restless, but not crazy like they had been before.\u003c/p\u003e\n\u003cp\u003e“Interesting….” Meng Hao thought for a moment, whereupon a completely audacious plan sprung into his mind. He set up the shield again, then produced a Demon Nurturing Pill. His eyes glinting, he took the Demonic Qi that was swirling around his finger and tapped it onto the medicinal pill.\u003c/p\u003e\n\u003cp\u003eDoing this required no pill furnace. His invisible alchemic flame gradually fused the Demonic Qi into the medicinal pill. As soon as that happened, the silence of the night was broken as the hundred Neo-Demon Kennelist courtyards all erupted with roars. This was despite the shield that Meng Hao had put up!\u003c/p\u003e\n\u003cp\u003eThe level of the frenzy vastly exceeded that from before. Roaring echoed out, an indescribable howling that shook everything.\u003c/p\u003e\n\u003cp\u003eThis was not just a handful of neo-demons roaring; it was all of them! In a split second, a shocking roar filled the entirety of the Crow Scout Tribe!\u003c/p\u003e\n\u003cp\u003eThe sound of it vastly exceeded that of the riot caused by the first pill.\u003c/p\u003e\n\u003cp\u003eWu Hai was there among his fellow Tribe members, a blank look on his face. He wasn’t sure what was happening, nor did anyone else around him. What could possibly make all the neo-demons act in this way?\u003c/p\u003e\n\u003cp\u003eWithin the Crow Scout Tribe, one Tribe member after another woke up and was instantly shocked.\u003c/p\u003e\n\u003cp\u003e“All of the neo-demons are roaring. What happened?”\u003c/p\u003e\n\u003cp\u003e“What’s going on over in the Neo-Demon Kennelist district?”\u003c/p\u003e\n\u003cp\u003e“Something must have happened. This is impossible! This is.. hundreds of neo-demons all roaring together!”\u003c/p\u003e\n\u003cp\u003eHowever, even in the midst of their shock….\u003c/p\u003e\n\u003cp\u003eThe tall mountain which separated the front area of the Tribe from the Neo-demon Kennelist district in the rear was suddenly split by one shockingly powerful roar after another.\u003c/p\u003e\n\u003cp\u003eIn total there were five. The roars filled the air and echoed out as five beams of light shot up. Within each was a neo-demon dozens of meters long. Three were green wolves, one was a black turtle, and the last was a ferocious green-colored tiger.\u003c/p\u003e\n\u003cp\u003eThe power emanating from these five neo-demons was shockingly equivalent to the late Core Formation stage; these were level 9 neo-demons! The roars they emitted mixed together with those of the hundreds of other neo-demons to create a massive sound that rose up to the Heavens.\u003c/p\u003e\n\u003cp\u003eIf that were all there were to it, it wouldn’t be a big deal. However, as the shocking roar lifted up into the sky, within the thousands of members of the Crow Scout Tribe, many Tribe members\u0027 faces suddenly filled with astonishment. At this very moment, the totem tattoos on their bodies began to burn. The neo-demons that had already been bonded to them suddenly magically appeared, roaring to the skies as they charged forward.\u003c/p\u003e\n\u003cp\u003eThe sight of it was astonishing to the extreme. Nearly half of the thousands of Tribe members watched as their totem tattoos began to glow, and then neo-demons popped out, roaring.\u003c/p\u003e\n\u003cp\u003e“My Greenwood Wolf is out of control!!”\u003c/p\u003e\n\u003cp\u003e“Dammit, my Phoenix Hawk is going crazy!!”\u003c/p\u003e\n\u003cp\u003e“Just what is going on!? Is this a neo-demon revolt!?”\u003c/p\u003e\n\u003cp\u003eBuzzes of conversation filled the air. One by one, the Cultivators who had bonded neo-demons flew into the air.\u003c/p\u003e\n\u003cp\u003eAs they did, a dozen or so powerful figures shot up from the mountain toward the neo-demons.\u003c/p\u003e\n\u003cp\u003e“It’s the Elders! Even they showed up!”\u003c/p\u003e\n\u003cp\u003e“The Elders are usually busy with Tribal affairs, they hardly ever come out. But here they are!”\u003c/p\u003e\n\u003cp\u003eThe events of this night would be engraved in the hearts of the members of the Crow Scout Tribe for the rest of their lives. People began to cry out in alarm as a roaring sound suddenly emanated out from the top of the mountain, a sound which many of them hadn’t heard for a very, very long time.\u003c/p\u003e\n\u003cp\u003eAs the roaring echoed out, the mountain shook and the earth around it quaked. Suddenly, a tree branch flew out; it was ancient and withered, and emanated a profoundly archaic Qi. The branch flew out, emanating a flickering green glow, which then transformed into a roughly nine-meter tall Treant!\u003c/p\u003e\n\u003cp\u003eThe Treant’s face was ancient, and its body was formed from an incredibly thick tree branch which was covered with a vast quantity of dried leaves. It seemed to be in the decline of power. It hovered there in mid-air and then let out a massive roar.\u003c/p\u003e\n\u003cp\u003eThe instant the roaring began, the faces of all the Crow Scout Tribe members filled with astonishment and disbelief. Panting, they dropped to their knees.\u003c/p\u003e\n\u003cp\u003eIn addition to all of this, three more figures suddenly flew out from the mountain. Each one had a Cultivation base at the Nascent Soul stage, and one was in the mid Nascent Soul stage. They immediately shot toward the Treant, and as they did, the Crow Scout Tribe members below recognized them. One was the Greatfather of the Tribe and the other two were High Priests!\u003c/p\u003e\n\u003cp\u003ePriests and Greatfathers were the pinnacle of power in any Tribe!\u003c/p\u003e\n\u003cp\u003e“Greetings, oh Ancestor Greenwood!” said the Greatfather, an old man. As for the two High Priests, they wore long, enveloping green robes that hid their features. However, all three of these people emanated powerful Qi, and yet, looks of apprehension and fear could be seen in their eyes. It had been roughly two sixty-year cycles since they had seen the Greenwood Ancestor. It was with shocked hearts that they clasped hands and bowed toward the Treant.\u003c/p\u003e\n\u003cp\u003e“Demon. I sense a Demon….” said the enormous Treant. It let out a roar which echoed out, instigating even more roaring from the Crow Scout Tribe\u0027s neo-demons.\u003c/p\u003e\n\u003cp\u003eThe five Tribes that had once made up the Crow Divinity Tribe surrounded a restricted area in the centre of them all, almost like the five fingers of a hand. It was at this moment that in the next Tribe over, the Crow Soldier Tribe, all of the neo-demons lifted their heads up into a roar.\u003c/p\u003e\n\u003cp\u003eThe Crow Soldier Tribe was a metal-type Tribe, so the vast majority of their neo-demons were also made from metal. Flying swords, magical treasures and even giant Metal Golems. All of them suddenly flew out of control, as did the other neo-demons that the Tribe members had branded to exercise control over. One by one, they flew up into the air.\u003c/p\u003e\n\u003cp\u003eEven more shocking, a golden light appeared at the top of the Crow Soldier Tribe’s mountain. It transformed into a gigantic gold trident that blazed with brilliant golden glow, along with a shocking Qi.\u003c/p\u003e\n\u003cp\u003e“Demonic Qi… I sense Demonic Qi!!”\u003c/p\u003e\n\u003cp\u003eQi exploded out simultaneously as the neo-demons of the Crow Fighter Tribe, Crow Flame Tribe and the Crow Gloom Tribe began to roar. In the Crow Fighter Tribe, Earth-type ripples appeared. Suddenly, mud fountained up like a volcano. It floated there in mid-air, a mud lake hundreds of meters in diameter.\u003c/p\u003e\n\u003cp\u003eWithin the Crow Flame Tribe, a sea of flame shot through the air, within which was an enormous flaming black horse. It stared with scarlet eyes toward the Crow Scout Tribe.\u003c/p\u003e\n\u003cp\u003eWithin the Crow Gloom Tribe, a vapor emanated out, turning into clouds and rain!\u003c/p\u003e\n\u003cp\u003eAt this point, all of the Tribe members of the five Tribes, the Elders, Priests, Greatfathers, all stood there, their minds filled with unprecedented trembling. The Nascent Soul Patriarchs who had infiltrated these other Tribes also stood there in absolute shock, filled with various speculations about what was going on.\u003c/p\u003e\n\u003cp\u003eAs the shock rippled through the various Tribes, Meng Hao’s face was also surprised. He too had sensed how shocking the Qi was.\u003c/p\u003e\n\u003cp\u003e“Wow, I really set something off this time….” He had long since begun to attempt to seal the pill, but nothing was working. Not even putting it into his bag of holding did the trick. It was almost like the protective shield around him didn’t even exist. He could clearly sense that he had at the most twenty breaths worth of time before all the fearsome things in the outside would be able to determine his exact location.\u003c/p\u003e\n\u003cp\u003eIt was at this time that an even greater development occurred. An incredible pressure suddenly appeared!\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Anonymous, Rudolph Arreola, Arvind K Kutty, Yanuar Yaputra, Christian Kastberg and Anon\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-394\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-396\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-4-chapter-395","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
