{"id":52727,"no":402,"title":"Chapter 399: Senior, Save Me","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 399: Senior, Save Me\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSeveral days later….\u003c/p\u003e\n\u003cp\u003eOn the mountain in the middle of the Crow Scout Tribe was a string of extravagant houses. Although they were constructed from wood, the wood came from Spirit Trees in the surrounding forests that had grown for hundreds of years. Eventually, they built up a certain amount of spiritual energy, and when they were used to build houses, could provide quite a few benefits when it came to practicing cultivation.\u003c/p\u003e\n\u003cp\u003eThe only people who could live here were descendants of the three great bloodlines of the Tribe.\u003c/p\u003e\n\u003cp\u003eThis, of course, was where Wu Chen resided. At the moment, he was lividly throwing a ceramic jar onto the ground, where it shattered into pieces. Wu Chen’s infuriated voice roared out throughout the house.\u003c/p\u003e\n\u003cp\u003e“Wu Ali, you’ve gone too far!!” Wu Chen’s hair was in disarray, and his eyes radiated venomous madness. His body was shaking and he oozed killing intent. He slammed his fist into the wooden wall next to him, causing the entire house to shake. Ripples of spiritual energy appeared, resisting the power of his Cultivation base and even rebounding back into him. Wu Chen’s hand was now injured and dripped blood.\u003c/p\u003e\n\u003cp\u003eIgnoring the blood, he clenched his fists and continued to vent: “That totem medallion was awarded to my father years ago because of his service to the Tribe. Why the hell are they giving it to you now!?”\u003c/p\u003e\n\u003cp\u003eDespite his venting, his heart filled with helplessness. A bitter smile appeared on his face as he looked at the sky outside. As far as he was concerned the entire world was filled with darkness.\u003c/p\u003e\n\u003cp\u003eIt was at this point that the front door opened. Sunlight spilled in, piercing into his eyes. A woman entered, someone very familiar to Wu Chen.\u003c/p\u003e\n\u003cp\u003e“Sis….” he said, his voice filled with pain.\u003c/p\u003e\n\u003cp\u003eThe woman was tall and had long black hair. The clothing she wore was utilitarian, but it was impossible to conceal her natural beauty. However, the constant furrow in her brow made it seem like she was in a state of perpetual thought.\u003c/p\u003e\n\u003cp\u003e“I’ve already arranged everything for you,” she said, her voice gentle. “You and Wu Ali will have a fair neo-demon duel. Whoever wins will receive the totem medallion.”\u003c/p\u003e\n\u003cp\u003eShe looked down at the fragments of pottery on the ground and then back up at Wu Chen.\u003c/p\u003e\n\u003cp\u003e“WHAT?!?!” cried Wu Chen, his eyes bloodshot. “That medallion was given to father for his meritorious service!” His expression filled with savagery. His dissatisfaction with the Crow Scout Tribe couldn’t be greater. For the past few years, he had done everything his sister asked him to do. He had endured it all. But now, even his father’s totem medallion was being taken away. He truly valued the totem medallion, which made it much easier to congeal totems. It was actually a precious treasure that even had the ability to pass on some legacy power from the Tribal Ancestor.\u003c/p\u003e\n\u003cp\u003eSeeing Wu Chen in virtual hysterics, his sister soothingly said, “The whole matter was set by the Tribe Greatfather, so you have to comply. Listen, I’m going to go find Grandmaster Shui Mu, the rank 3 Dragoneer. I’ll buy a level 2 neo-demon for you, that way the duel will be fair.”\u003c/p\u003e\n\u003cp\u003e“Wu Ali’s neo-demon is a level 2 Flying Bat. It was personally raised by a rank 5 Dragoneer. An ordinary level 2 neo-demon couldn’t possibly beat it! Neo-demon duel…. Some ‘fair’ duel this is going to be!” Wu Chen felt like he just couldn’t accept it. It was at this point that an idea flashed like lightning in his head.\u003c/p\u003e\n\u003cp\u003e“Neo-demon duel…. Neo-demon…. Greenwood Wolves!” His eyes suddenly filled with an intense glow, as if suddenly he had risen from the depths of despair.\u003c/p\u003e\n\u003cp\u003e“If I beg that senior, maybe he’ll help me,” he thought. “Trifling Wu Ali will be defeated for sure! Then I can get the totem medallion that is rightfully mine, and begin my rise to prominence.” Wu Chen began to pant, and the glow in his eyes grew brighter. Filled with intense hope, he stood up and left, intent on seeking out that mysterious figure whom he found completely unfathomable. Of course, it was none other than the person he viewed as a master of the senior generation, Meng Hao.\u003c/p\u003e\n\u003cp\u003eWu Chen’s sister frowned as she watched him walk off. She did nothing to stop him, but instead followed along behind him.\u003c/p\u003e\n\u003cp\u003eWu Chen didn’t hesitate at all. Ignoring the fact that his sister was following him, he sped down the mountain toward the Neo-Demon Kennelist district. As he looked at the rows of courtyards, and smelled the strange odor in the air, his mind filled with worries regarding the potential losses and gains.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long for him to reach Meng Hao’s courtyard. He stood outside, his beautiful sister behind him, frowning. His sister didn’t understand why Wu Chen had suddenly rushed here as soon as she mentioned neo-demons.\u003c/p\u003e\n\u003cp\u003e“Wu Chen….” she said softly.\u003c/p\u003e\n\u003cp\u003eHe completely ignored her as he looked at the closed door leading into the courtyard. Gritting his teeth, he stepped forward and, putting his most respectful expression on, clasped hands and bowed, making no move to open the door.\u003c/p\u003e\n\u003cp\u003e“Wu Chen is here to pay respects, senior,” he said.\u003c/p\u003e\n\u003cp\u003eHis voice was loud, and echoed about. His sister’s eyes narrowed immediately. She knew her younger brother well, and was used to how aggressive he usually acted because of the grievances he felt. There were few people he would actually treat courteously.\u003c/p\u003e\n\u003cp\u003eShe hadn’t seen him act as respectfully as this in a long time. Actually… she could clearly see that the respect he was showing was not an act, but existed deep in his heart.\u003c/p\u003e\n\u003cp\u003e“This place….” She looked closely at the courtyard and the shut door.\u003c/p\u003e\n\u003cp\u003eA long moment passed. Wu Chen gritted his teeth and continued loudly, “Wu Chen of the junior generation pays respects to the senior generation. Senior, I would like to request an audience.” His voice echoed out, immediately attracting the attention of other nearby Neo-Demon Kennelists. Quite a few opened the doors of their courtyards to look over.\u003c/p\u003e\n\u003cp\u003eWhen they saw Wu Chen and his beautiful sister, it only took a moment’s thought to recognize who they were.\u003c/p\u003e\n\u003cp\u003eWu Chen’s sister was starting to feel a little irritated. From her perspective, Wu Chen was a descendant of the three great bloodlines. Vassals weren’t even members of the Tribe, so there was no need to show them such veneration. And yet, Wu Chen had bowed twice in greeting to the owner of this courtyard. She frowned and let out a cold harumph. She was just about to push the door open to see how skilled this Cultivator was, who her brother showed such politeness to.\u003c/p\u003e\n\u003cp\u003eHowever, as soon as she stepped forward, her brother moved to block her, an imploring look on his face.\u003c/p\u003e\n\u003cp\u003eWhen she saw his expression, her heart softened. With an inward sigh, she stepped back. Deep in her heart, her irritation at whoever was in the courtyard continued to grow.\u003c/p\u003e\n\u003cp\u003eMore Cultivators were looking at them now, and some of them were discussing the proceedings in low tones.\u003c/p\u003e\n\u003cp\u003e“Those are descendants of the three great bloodlines. I’ve heard of the two of them. Why would they possibly come here to pay respects to a mere Neo-Demon Kennelist?”\u003c/p\u003e\n\u003cp\u003e“If they were going to pay respects to anyone, it should be Grandmaster Shui Mu. The Cultivator in that courtyard is surnamed Meng, and there’s nothing special at all about him.”\u003c/p\u003e\n\u003cp\u003e“Maybe Grandmaster Shui Mu isn’t as polite as he seems, and refused to part with a neo-demon. Then, they had no choice but to lower their standards. Even still, why would they pick a Neo-Demon Kennelist with absolutely no reputation?”\u003c/p\u003e\n\u003cp\u003eWu Chen and his sister could hear what people were saying. As for Wu Chen, it didn’t change his mind at all. His sister, however, was looking grimmer and grimmer.\u003c/p\u003e\n\u003cp\u003eShe had already endured about as much as she could when the courtyard door slowly opened without a sound. From within, a pleasant voice could be heard: “Enter.”\u003c/p\u003e\n\u003cp\u003eWu Chen immediately got excited. He took a deep breath and then organized his garments. Bowing once more, he cautiously entered the courtyard. His sister followed, her face dark.\u003c/p\u003e\n\u003cp\u003eMeng Hao was sitting there cross-legged, surrounded by his five, napping Greenwood Wolves.\u003c/p\u003e\n\u003cp\u003eWhen she saw the wolves, Wu Chen’s sister’s eyes went wide. With the exception of one, the entire group seemed to be high quality level 2 neo-demons. Now, she understood why her brother was being so polite.\u003c/p\u003e\n\u003cp\u003e“But there are a lot of Cultivators in the Western Desert who are skilled in raising neo-demons,” she thought. “Wu Chen isn’t very experienced, so he mistakenly assumes that this guy is special. I wonder what this guy did to fool Wu Chen so well.” Her eyes glittered coldly, and in her heart she snorted coldly.\u003c/p\u003e\n\u003cp\u003eAs soon as he entered the courtyard, Wu Chen dropped to his knees. “Senior, I beg of you to save me….”\u003c/p\u003e\n\u003cp\u003eThis caused his sister to frown even more deeply.\u003c/p\u003e\n\u003cp\u003eMeng Hao opened his eyes. He looked over Wu Chen and his sister, taking note of her antagonistic bearing. Ignoring her, he focused on Wu Chen.\u003c/p\u003e\n\u003cp\u003e“You really aren’t capable of controlling these Greenwood Wolves,” he said calmly.\u003c/p\u003e\n\u003cp\u003e“Senior, I’m not here to request control of the Greenwood Wolves,” he said, his voice filled with cordiality and entreaty. “I need your help. Wu Ali is being an intolerable bully. I have to engage in a neo-demon duel with him. Senior, I have no neo-demons that are capable of standing up to him. Senior, please save me! I beg of you to stand at my side as a Dragoneer. I’ll do anything you want, even pledge my life to you!!”\u003c/p\u003e\n\u003cp\u003e“Wu Chen, get up!” said his sister, her voice harsh.\u003c/p\u003e\n\u003cp\u003eWu Chen ignored her and continued to stare fixedly at Meng Hao, his eyes pleading.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at him silently for a moment, his eyes glittering.\u003c/p\u003e\n\u003cp\u003e“I want the totem branding technique of the Crow Scout Tribe,” he said.\u003c/p\u003e\n\u003cp\u003eHearing his words, Wu Chen’s sister immediately replied, “Impossible! You’re just a vassal! Such a request is preposterous!” Two totem tattoos glittered on her, indicating that her Cultivation base was at the Foundation Establishment stage.\u003c/p\u003e\n\u003cp\u003eMeng Hao ignored her, continuing to look at Wu Chen as he waited for him to respond.\u003c/p\u003e\n\u003cp\u003eWu Chen hesitated for a moment. A totem branding technique was a Conclave magic of a Tribe. It would normally be very difficult for a vassal to acquire such a technique. According to custom, Wu Chen shouldn’t reveal such a technique to an outsider. Unless he was willing, the technique could not be extracted from him even by Soulsearch. Every Conclave Tribe member was blessed with a totem, which was branded onto their very soul.\u003c/p\u003e\n\u003cp\u003eHowever, when he considered all the injustice he had experienced in the past years, Wu Chen gritted his teeth. A look of madness filled his face.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-398\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-400\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-4-chapter-399","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
