{"id":52747,"no":422,"title":"Chapter 419: Outtie","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 419: Outtie\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“The parrot never came back after it went chasing the Outlander Beast. It’s impossible to tell what happened between the two of them. In any case, it seems… they came to some sort of agreement?” He ended the Celestial Vision technique. He was astonished, of course, but considering the parrot’s personality, anything was possible.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, Meng Hao felt a bit sorry for all the people from the other tribes who were making their way onto the platform within the golden shield.\u003c/p\u003e\n\u003cp\u003e“I would imagine Yan Song and the others are in that group….” he thought, looking the group over. Of course, Yan Song and the others were wily old foxes who would obviously have taken precautions to prevent anyone from realizing who they were. After looking at the twelve vassals from the other Tribes, even Meng Hao couldn’t discern any clues.\u003c/p\u003e\n\u003cp\u003eThis was a battle royal with fifteen Totem Cultivators from the five Tribes. As they stepped into the golden shield on the platform, they did not speak. Instead, booming sounds immediately filled the air as the fighting began.\u003c/p\u003e\n\u003cp\u003eEach group of three formed a unit, instantly become comrades-in-arms as they joined forces. At least, this was what happened with the other four Tribes. However… as for the three people from the Crow Scout Tribe, it was a different story.\u003c/p\u003e\n\u003cp\u003eThe man-form Outlander Beast stepped onto the platform, lifted his head with a roar, and then charged forward. He didn’t even look at his two compatriots, which caused them to stare in astonishment. They had a mind to follow in the charge, but the ferocity emanating from the man-form Outlander Beast seemed to indicate that he intended to fight solo. The two immediately backed up, trembling.\u003c/p\u003e\n\u003cp\u003eThis development caused the Cultivators from the other Tribes to stare wide-eyed in surprise. In fact, many of them assumed that this was some sort of pre-planned tactic on the part of the Crow Scout Tribe.\u003c/p\u003e\n\u003cp\u003eHowever, the Greatfather and Priest of the Crow Scout Tribe, as well as other influential members, were all clearly stunned. The Tribe members from the other four Tribes looked on thoughtfully.\u003c/p\u003e\n\u003cp\u003eRumbling filled the air, and Meng Hao’s eyes glittered. However, what he was looking at was not the man-form Outlander Beast, but rather the vassals from the other Tribes. He was still trying to figure out which ones were Yan Song and the others.\u003c/p\u003e\n\u003cp\u003eSuddenly, the man-form Outlander Beast howled, “You bunch of immoral bastards! I represent Outtie and my fifth kid bro! I’m here to convert all of you!”\u003c/p\u003e\n\u003cp\u003eThe sound of it was like thunder. In the blink of an eye, the man was in front of one of the three-man units. Immediately, a boom could be heard, and magical totemic lights sprang out.\u003c/p\u003e\n\u003cp\u003eThese three men were from the Crow Flame Tribe. They watched the man approached, then simultaneously attacked without hesitation. At once, an enormous boom rattled out as magical techniques collided.\u003c/p\u003e\n\u003cp\u003e“Waaaaaahhhhh!” shouted the man, sounding as if he felt wronged. “One, two, three… dammit! There’s three of you! THREE! Three against one is immoral!!” Hearing this caused strange expressions to appear on the faces of the surrounding Tribe members.\u003c/p\u003e\n\u003cp\u003eThey watched on as the big man retreated. As he did, his expression suddenly changed; now it looked somewhat vile.\u003c/p\u003e\n\u003cp\u003e“Bitches!” cried the man. “It looks like you people lack screwing! Well you wait. You just wait!” He no longer looked hurt, but rather, wildly pompous and arrogant. This time, he headed toward a different group of three.\u003c/p\u003e\n\u003cp\u003e“I thrust!\u003c/p\u003e\n\u003cp\u003e“I screw!\u003c/p\u003e\n\u003cp\u003e“Hahaha. And I thrust again!” The large man’s voice was now piercing, and even more arrogant. It was with incredible speed that he shot back and forth among the various people. He seemed to be incredibly thick skinned; no matter how people struck him, it didn’t do anything. The vassals were growing more furious; this man’s attacks were completely despicable and shameless. All his divine abilities seemed to be focused on one finger.\u003c/p\u003e\n\u003cp\u003eAnd that finger… specialized in attacking rear ends.\u003c/p\u003e\n\u003cp\u003eFurthermore, he didn’t differentiate between Tribes. He attacked anyone in his field of vision, even the two people from the Crow Scout Tribe. They, too, were jabbed by the man, which caused them to burst forth with fury. After all, they were from the same Tribe and shouldn’t be attacking each other.\u003c/p\u003e\n\u003cp\u003eBecause of this provocation, the battle royal immediately… was no longer a battle royal. Now, all of the members of the various Tribes were ganging up on this one, large man.\u003c/p\u003e\n\u003cp\u003eSubsequently, the faces of the Crow Scout Tribe members in the audience were quite unsightly. The Greatfather and the Priest, even the Grand Elder, all had extremely grim expressions on their faces.\u003c/p\u003e\n\u003cp\u003eThroughout all the years that this Ancestral Rite Competition had been held, nothing like this had ever happened. This was no battle royal; instead, it was a beat down.\u003c/p\u003e\n\u003cp\u003eMeng Hao gave a dry cough, and looked a little bit guilty. After all, if he hadn’t brought the parrot to this place, then this competition would not have turned out this way.\u003c/p\u003e\n\u003cp\u003e“The meat jelly can’t die…. The parrot’s twisted vices…. I’m afraid the savagery of the Outlander Beast is the next thing we will see. Heyyy… if nothing else out of the ordinary happens, the Crow Scout Tribe will most likely be the winner.” Even as Meng Hao was thinking these thoughts, a roar of rage could suddenly be heard from the platform as one of the other Crow Scout Tribe vassals charged in attack.\u003c/p\u003e\n\u003cp\u003eHe couldn’t take it any longer. Having been jabbed three times in succession was too much of a humiliation. Roaring furiously, he charged the large man, completely ignoring the fact that they were fellow vassals from the same Tribe.\u003c/p\u003e\n\u003cp\u003eThe other vassal next to him was about to block his way when suddenly, the large man flickered into being next to him. His finger jabbed out.\u003c/p\u003e\n\u003cp\u003e“Dammit, we’re together! You, you, you….” Infuriated, the vassal’s eyes turned red and he let out a furious shout. “Fine! To the death!”\u003c/p\u003e\n\u003cp\u003eOnce again the scene of the battle taking place inside the golden shield on the platform changed. Now, everyone was bombarding the big man. This was not even to mention the Tribe members on the outside, who were also preparing to attack him. After all, his attacks were completely shameless, despicable to the extreme.\u003c/p\u003e\n\u003cp\u003eIn their entire lives, none of them had ever seen someone as vulgar as this.\u003c/p\u003e\n\u003cp\u003eImmediately, the members of the other Tribes began to ridicule the Crow Scout Tribe members.\u003c/p\u003e\n\u003cp\u003e“This is the Ancestral Rite Competition! For the Crow Scout Tribe to have recruited a vassal like that, it’s… intentionally causing trouble!”\u003c/p\u003e\n\u003cp\u003e“Maybe the Crow Scout Tribe couldn’t find anyone else, and then this shameless fellow showed up!”\u003c/p\u003e\n\u003cp\u003eThe faces of the Crow Scout Tribe members were extremely unsightly. They wanted to offer up retorts, but there was really nothing they could say. The Greatfather’s eyes were filled with fury as he glared at the man up on the platform.\u003c/p\u003e\n\u003cp\u003eMeng Hao sighed inwardly, and felt even more guilty. However, he continued to study the members of the other Tribes up on the platform, hoping to see pick up on some clues as to the identities of Yan Song and the others.\u003c/p\u003e\n\u003cp\u003eSuddenly, his eyes flickered as they came to rest on a vassal standing with the Crow Gloom Tribe. It was a middle-aged man, tall and stalwart, his face filled with savagery. However, when the man-form Outlander Beast attacked him, his face looked different from that of the others. He looked a bit hesitant, even somewhat absentminded.\u003c/p\u003e\n\u003cp\u003eThe look quickly disappeared, to be replaced with fury. However, even as the fury filled his face, one of the vassals from the Crow Soldier Tribe suddenly shot forward in pursuit of the Outlander Beast.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes narrowed. Based on this development, he could now tell who these two people were. “Mo Li and Eccentric Wang!”\u003c/p\u003e\n\u003cp\u003eThe howling man-form Outlander Beast was now surrounded.\u003c/p\u003e\n\u003cp\u003e“Outtie, you wimp, it’s your turn!” Suddenly, a tremor ran through the man’s body. It was at this exact moment that the surrounding vassals all attacked.\u003c/p\u003e\n\u003cp\u003eA shocking boom echoed out. From the perspective of everyone watching, there was no way the man could possibly escape death. It was only Meng Hao that let out a sigh; he knew that the Outlander Beast was coming.\u003c/p\u003e\n\u003cp\u003eWithin the booming sound, an astonishing roar suddenly lifted up.The intensity of the roar turned into an attack that rippled out in all directions on the platform. The sight of this attack caused the observing members of the five Tribes to stop breathing and stare in disbelief.\u003c/p\u003e\n\u003cp\u003eWhat they saw was all of the vassals who were attacking the large man suddenly tumbling backward, their faces filled with disbelief and shock.\u003c/p\u003e\n\u003cp\u003eThe man who everyone had assumed would die stood there with an expression of savagery, his eyes bright red and his hair flying about. He lifted his head to the sky and roared with the madness of a neo-demon.\u003c/p\u003e\n\u003cp\u003eHis body flickered, and he suddenly appeared in front of one of the other vassals, his face filled with cruelty. His hands reached out with a strange motion and grabbed ahold of the vassal, who had no chance to evade. Then, he ripped.\u003c/p\u003e\n\u003cp\u003eA bloodcurdling scream filled the air as the Cultivator’s body was torn completely in half. Blood showered everywhere, and the large man flickered again.\u003c/p\u003e\n\u003cp\u003eMiserable screams filled the air. The gory scene instantly caused the surrounding members of the five great Tribes to feel incredible shock. They began to pant, their eyes wide.\u003c/p\u003e\n\u003cp\u003eIt took only a moment for three people to die. The big man was like an unmatchable Celestial warrior; to approach him was the same as approaching death.\u003c/p\u003e\n\u003cp\u003e“I forfeit!!” cried a vassal from the Crow Flame Tribe as he saw the man approaching him. Trembling, his body suddenly disappeared through the golden shield as he left the battlefield.\u003c/p\u003e\n\u003cp\u003e“I forfeit!!”\u003c/p\u003e\n\u003cp\u003e“I forfeit!!” The shouts rang out one after another, although some people were too late, and ended up getting ripped into pieces by the frenzied man.\u003c/p\u003e\n\u003cp\u003e“I for….” One vassal from the Crow Soldier Tribe was just beginning to speak when the man-form Outlander Beast appeared in front of him. The Outlander Beast opened his mouth wide and directly bit down onto the vassal’s neck, causing his words to instantly change into a bloodcurdling shriek.\u003c/p\u003e\n\u003cp\u003eIt took only moments for the platform to be completely empty except for the big man. He stood there, looking around savagely and roaring.\u003c/p\u003e\n\u003cp\u003e“Crow Scout Tribe,” he cried, “I have secured victory for you! Now give me the Pool of Destiny!!”\u003c/p\u003e\n\u003cp\u003eThe Crow Scout Tribe members’ minds were reeling. The Sky Priest was panting and the Grand Elder was staring with wide eyes. As for the Greatfather, his eyes flickered and he started to laugh.\u003c/p\u003e\n\u003cp\u003e“Exactly as it should be,” he said. “Fellow Daoist, you have secured yourself a spot in the Pool of Destiny!”\u003c/p\u003e\n\u003cp\u003eThe man gazed at the Greatfather and then nodded. He took a step, and then his body flickered and he left the golden shield. When he reappeared, the surrounding Tribe members all backed up and made room for him. Their hearts trembled as they avoided him. As the man neared, he seemed to almost be attempting to avoid Meng Hao\u0027s gaze.\u003c/p\u003e\n\u003cp\u003eEverything was quiet for the space of about ten breaths. Finally, a grim voice called out from the Crow Fighter Tribe.\u003c/p\u003e\n\u003cp\u003e“Second battle, Dragoneer Duel!”\u003c/p\u003e\n\u003cp\u003eMeng Hao looked up.\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Surasri Prapasiri, Forrest Jungck, Nam Tran and Muzaffer Akbay\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-418\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-420\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-4-chapter-419","bookId":1507,"creation":"Sep 10, 2019 5:03:25 AM","modification":"Sep 10, 2019 5:03:25 AM"}
