{"id":52877,"no":552,"title":"Chapter 549: I\u0027ve Returned!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eUp in mid-air, the Heavenly Pursuit Tribe’s Greatfather and High Priest looked down coldly at the battlefield. They were exhausted, but their killing intent filled the air. They very much approved of Zhang Wenzu’s plans….\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“This battle will be over soon,” said the Greatfather.\u003c/p\u003e\n\u003cp\u003eIn accord with the orders issued by Zhang Wenzu, the Tribe slashed into the Golden Crow Tribe from three directions. The sounds of slaughter immediately intensified.\u003c/p\u003e\n\u003cp\u003eWar chariots constructed from magical treasures pulsated with prismatic light as they crushed anything in their path, instantly putting the Golden Crow Tribe in grave danger.\u003c/p\u003e\n\u003cp\u003eThe peak level battle prowess of the more than one hundred Nascent Soul Cultivators and twenty totemic Sacred Ancients emitted crushing pressure that weighed down on everything. It was a force that would be equivalent even to a great Sect from the Southern Domain.\u003c/p\u003e\n\u003cp\u003eAs the brutal battle raged, the Golden Crow Tribe was forced to shrink back. The Thorn Rampart vines were in a frenzy, and the brilliant glow of magical techniques and divine abilities rose up into the sky.\u003c/p\u003e\n\u003cp\u003eThe parrot soared through midair, its eyes red. As more and more members of the Golden Crow Tribe perished, the parrot felt worse and worse. Everything that was happening made it think of a painful memory from the past.\u003c/p\u003e\n\u003cp\u003eThe meat jelly trembled as it looked around. Although its body was indestructible, when it saw the Cultivators dying all around, it felt grief similar to the parrot’s.\u003c/p\u003e\n\u003cp\u003e“Hey old bird, why the hell haven’t you opened the seal and gotten rid of these enemies?!”\u003c/p\u003e\n\u003cp\u003e“I can’t open it, bitch! It won’t open!” shouted the parrot, charging in attack.\u003c/p\u003e\n\u003cp\u003eThe Golden Crow Tribe fell back again. Booming roars rose up into the sky. They had long since given up on the thought of advancing. Everything was focused on defense. They were completely surrounded by the forces of the Heavenly Pursuit Tribe. The combined power of more than twenty totemic Sacred Ancients and over one hundred Nascent Soul Cultivators caused the Thorn Rampart vines to begin to collapse. From the look of things it wouldn’t be long before they died completely.\u003c/p\u003e\n\u003cp\u003eIt was at this moment that suddenly, a roaring sound could be heard from off in the distance. Thirteen Heavenly Pursuit Tribe Cultivators came into view, carrying with them a black-colored pillar that even five people couldn’t encircle with their arms.\u003c/p\u003e\n\u003cp\u003eThe pillar was carved with countless ferocious beasts, and emanated a primitive, archaic aura that made it seem as if it had existed for countless years. The thirteen Cultivators slowly proceeded forward with the pillar, their faces red and dripping with sweat. Apparently the pillar was incredibly heavy, and even with their combined strength, it was difficult to bear it on their shoulders for very long.\u003c/p\u003e\n\u003cp\u003eAs it turned out, there wasn’t just one column heading toward the battlefield. There were three!\u003c/p\u003e\n\u003cp\u003eThey slowly approached the Golden Crow Tribe from three directions, each one roughly three hundred meters in length.\u003c/p\u003e\n\u003cp\u003eFrom up above, the three black pillars looked like three gigantic spikes, pulsing with a black aura. They seemed to be filled with the rancor of countless ferocious beasts.\u003c/p\u003e\n\u003cp\u003eUp in mid-air, Zhang Wenzu’s eyes glittered and he suddenly cried out, “Crush them!”\u003c/p\u003e\n\u003cp\u003eIn response, all of the Heavenly Pursuit Tribe members instantly began to cry out strange incantations. The sounds of their voices shook everything, creating a roar that turned into a sound wave.\u003c/p\u003e\n\u003cp\u003eAs it echoed out, the three gigantic black spikes responded to the power of the incantation. They suddenly flew up of their own accord to drift in mid-air.\u003c/p\u003e\n\u003cp\u003eThe Greatfather and High Priest of the Heavenly Pursuit Tribe lifted their hands to press down hard on their foreheads. Their bodies trembled and blood sprayed from their mouths. Their faces twisted bizarrely as they uttered the final, awkward-sounding words of the incantation: “Hongmosan!”\u003c/p\u003e\n\u003cp\u003eThe incantation sucked in some of their life forces. The sound of it filled the entire battlefield, causing anyone who heard it to suddenly feel bedazzled, as if their souls were being tugged at.\u003c/p\u003e\n\u003cp\u003eNext, the three enormous black spikes suddenly shot downward. A rumbling bang could be heard as they stabbed into the ground.\u003c/p\u003e\n\u003cp\u003eInstantly, a black field of light sprang up between the black spikes, connecting them and completely enveloping the Golden Crow Tribe.\u003c/p\u003e\n\u003cp\u003eIn that instant, all of the members of the Golden Crow Tribe, men and women, the elderly and children, even the neo-demons, all felt signs of withering within their bodies.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the Heavenly Pursuit Tribe’s Nascent Soul Cultivators and totemic Sacred Ancients split into three groups, each one of which moved into the direction of one of the black spikes. After arriving, they unleashed the full power of their Cultivation bases to slam into the spikes.\u003c/p\u003e\n\u003cp\u003eEach successive blast sent the three spikes further into the ground by several meters. The black field of light grew stronger, and countless bolts of lightning appeared. The Golden Crow Tribe was completely enveloped, and the signs of withering grew stronger. The Tribe members’ faces filled with despair. It seemed as if what the Heavenly Pursuit Tribe said was true; they really were going to eradicate the entire Tribe and leave not a single person alive.\u003c/p\u003e\n\u003cp\u003e“Three Lives Spirit Extermination Spikes….” said the Heavenly Pursuit Tribe’s Greatfather. “They are precious treasures of the Heavenly Pursuit Tribe. Were it not for the fact that the Golden Crow Tribe has fought back the entire time and not given in a bit, we would never have used them.”\u003c/p\u003e\n\u003cp\u003e“Hopefully the life forces of this Tribe will be of some use to the Patriarch,” said the High Priest.\u003c/p\u003e\n\u003cp\u003eThe two of them let out soft sighs. The war had gone on for roughly half a month, but now it was finally going to conclude.\u003c/p\u003e\n\u003cp\u003eThey weren’t the only ones who heaved sighs of relief. Most of the surrounding Heavenly Pursuit Tribe members were the same, with the exception of Zhang Wenzu, whose expression was cold. The desire to kill still flickered in his eyes.\u003c/p\u003e\n\u003cp\u003e“They really are tenacious. However, the more they struggle, the more quickly their life forces will be drained, and the sooner they will die.”\u003c/p\u003e\n\u003cp\u003eRoaring filled the air as the spikes were driven deeper into the ground. The Golden Crow Tribe members were wasting away, even the Outlander Beast and Big Hairy. There were no exceptions.\u003c/p\u003e\n\u003cp\u003eThere was despair, but as they struggled, their eyes were filled enmity and frenzy. They fused together to form a hatred that could only be washed away with the blood of their enemies. All their enemies.\u003c/p\u003e\n\u003cp\u003e“There’s no need to struggle,” said the High Priest coolly.\u003c/p\u003e\n\u003cp\u003e“If you want to blame someone,” said the Greatfather, “blame that totemic Sacred Ancient of yours. He killed someone he shouldn’t have killed, and provoked someone he shouldn’t have provoked, the Patriarch of the Heavenly Pursuit Tribe. In fact, he’s most likely already dead at the hands of Patriarch Huyan’s clone.” He smiled, his expression one of arrogance and scorn as he looked down at the Golden Crow Tribe.\u003c/p\u003e\n\u003cp\u003eThe parrot flew in mid-air beneath within the field of light. “Who’s dead, bitch? If anyone died, he wouldn’t… uh… eee?” In the middle of its cursing, the parrot suddenly stared in shock. It immediately stopped speaking and looked off into the distance.\u003c/p\u003e\n\u003cp\u003eEven as the Golden Crow Tribe was struggling on the verge of collapse, even as the parrot stared in shock, suddenly, the ground began to shake. The shaking was not caused by the spikes being driven down. No, this shaking was much more intense, much more large in scale. It was as if the entire world was being turned upside down!\u003c/p\u003e\n\u003cp\u003eOff in the distance, huge forms could be seen, running with enormous strides that caused the entire land to quake.\u003c/p\u003e\n\u003cp\u003eSoon, the aroma of saltwater blasted against the faces of everyone present. A wild wind sprang up that caused dust to fly up all over the place. A towering killing intent spread out in all directions.\u003c/p\u003e\n\u003cp\u003eThe Heavenly Pursuit Tribe Cultivators sensed the shaking almost immediately. One after another, the more than one hundred Nascent Soul Cultivators and twenty totemic Sacred Ancients in mid-air looked up.\u003c/p\u003e\n\u003cp\u003eWhat they saw… was a gale force wind sweeping through the air!\u003c/p\u003e\n\u003cp\u003eThe wind was dark and sinister as it screamed toward them, and within it could be seen hundreds of thousands of specters!\u003c/p\u003e\n\u003cp\u003eWhen they saw the specters, the Nascent Soul Cultivators and totemic Sacred Ancients gasped. The rest of the surrounding Heavenly Pursuit Tribe members were also shocked.\u003c/p\u003e\n\u003cp\u003eAt the same time… the shaking grew more intense. Finally, the crowds could clearly see the seven giants leaping through the air. Every step they took slammed into the ground and caused it to quake. These were the three thousand meter tall Violet Sea Giants!\u003c/p\u003e\n\u003cp\u003eThe aroma of saltwater grew stronger. The appearance of these seven Violet Sea Giants caused all of the Heavenly Pursuit Tribe members to gasp.\u003c/p\u003e\n\u003cp\u003e“What are they…?” Zheng Wenzu was dumbstruck, his eyes wide and filled with astonishment. Then his mind began to fill with a roaring sound as he realized what the giants were made from.\u003c/p\u003e\n\u003cp\u003eThe Heavenly Pursuit Tribe High Priest, his voice hoarse and filled with disbelief, said, “The Violet Sea…. They’re giants made from the waters of the Violet Sea!”\u003c/p\u003e\n\u003cp\u003e“Violet Sea Giants…. And the one in the lead position is holding something in its hand. It’s….” The Heavenly Pursuit Tribe Greatfather’s eyes narrowed as he looked off into the distance.\u003c/p\u003e\n\u003cp\u003eIt was at this point that the High Priest and all the Nascent Soul Cultivators also looked closely in the same direction. In that instant, they suddenly stopped breathing for a moment.\u003c/p\u003e\n\u003cp\u003e“Golden Crow Tribe members!!”\u003c/p\u003e\n\u003cp\u003e“Those are the ones we captured and sent to the ten outposts!!”\u003c/p\u003e\n\u003cp\u003eEven as the Heavenly Pursuit Tribe members felt complete and utter astonishment, an enormous red shape appeared in the approaching wind. It moved with incredible speed and emitted intense killing intent. The sky dimmed and the clouds were thrown into upheaval. An intense, hair-raising pressure radiated out toward the Heavenly Pursuit Tribe.\u003c/p\u003e\n\u003cp\u003eThe intensity of the pressure felt to them like the strength of the Heavens.\u003c/p\u003e\n\u003cp\u003eIt was an enormous, blood-colored mastiff. Standing on its head was a man in a green robe. His hair whipped about in the wind, and his eyes were as cold as ice. His expression was grim, and he suddenly exploded with seemingly infinite killing intent.\u003c/p\u003e\n\u003cp\u003e“Meng Hao!” Zhang Wenzu’s breath came in ragged pants. He recognized Meng Hao from that day outside Blackgate Fort. Meng Hao had left a deep impression on him at that time.\u003c/p\u003e\n\u003cp\u003eThe Heavenly Pursuit Tribe Greatfather and High Priest also recognized Meng Hao, as well as some of the Nascent Soul Cultivators. As soon as they saw Meng Hao, their minds filled with roaring.\u003c/p\u003e\n\u003cp\u003eThey were well aware that the Patriarch’s Clone had gone to kill Meng Hao. However… here was Meng Hao now. There was only one thing that meant, and everyone knew it.\u003c/p\u003e\n\u003cp\u003eIt was in this moment that among the trembling Golden Crow Tribe members caught in the black field of light, older members of the Tribe finally caught sight of Meng Hao, standing there atop the mastiff. These were old-timers who had accompanied Meng Hao during the long migration years ago.\u003c/p\u003e\n\u003cp\u003eHe looked almost completely the same as he had a hundred years ago. Immediately, the old-timers began to tremble with excitement.\u003c/p\u003e\n\u003cp\u003e“Exalted Sacred Ancient, we welcome you back with deep respect!”\u003c/p\u003e\n\u003cp\u003eThe other Golden Crow Tribe members who had been born in the past hundred years, or perhaps had joined the Tribe, all gaped in astonishment. The instant they saw Meng Hao, they connected his visage to that the of the statue in the middle of the Tribe. They too were filled with excitement.\u003c/p\u003e\n\u003cp\u003e“Exalted Sacred Ancient, we welcome you back with deep respect!!”\u003c/p\u003e\n\u003cp\u003e“Exalted Sacred Ancient, we welcome you back with deep respect!!” Their voices roared out in all directions, filled with hope and frenzy. As the sound echoed about, Meng Hao’s voice could be heard.\u003c/p\u003e\n\u003cp\u003e“I’ve returned.”\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Jorge Rocha and Omar Hamad\u003c/em\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-548\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-4-chapter-550\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-4-chapter-549","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
