{"id":52997,"no":672,"title":"Chapter 669: You Cheated!","content":"\u003cp\u003e\u003cstrong\u003eChapter 669: You Cheated!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the moment in which the stone slab exploded, Saint Sun Soul sat in his tower in Seahold. His eyes suddenly snapped open, and he sent his Divine Sense down into the city. It immediately locked onto the location where Meng Hao was.\u003c/p\u003e\n\u003cp\u003eAfter examining the situation, his face twitched again.\u003c/p\u003e\n\u003cp\u003e“Trying to compete in Demon hearts with him? Those seven are courting death!\u003c/p\u003e\n\u003cp\u003e“He mustn’t be given any opportunity to flip out. If he seizes the moral high ground, he’s bound to cause a crisis to develop….” Saint Sun Soul looked up at the bottle gourd which was placed off to the side, and felt a bit of a headache coming on. When he thought about the alcohol inside, his face grew unsightly.\u003c/p\u003e\n\u003cp\u003eHe flicked his right sleeve, and immediately, a person approached from outside the tower. Once inside, he immediately dropped to his knees and kowtowed.\u003c/p\u003e\n\u003cp\u003e“Greetings, Master.”\u003c/p\u003e\n\u003cp\u003eIt was a middle-aged man wearing a long, violet gown. His expression was one of veneration, and his eyes sparkled with energy. His Cultivation base was at the great circle of the Nascent Soul stage, not far from Spirit Severing.\u003c/p\u003e\n\u003cp\u003e“Go to the Sect’s Demon heart exchange pavilion,” said Saint Sun Soul coolly. “There’s a man there I want you to invite here. Remember to be extremely courteous. Treat him as politely as you treat me.”\u003c/p\u003e\n\u003cp\u003eThe middle-aged man immediately nodded, but the fact that his Master spoke no more caused him to pause for a moment.\u003c/p\u003e\n\u003cp\u003e“Master, what is name of this respected member of the senior generation?”\u003c/p\u003e\n\u003cp\u003e“Just go, you’ll recognize him.” Saint Sun Soul didn’t appear to want to discuss the matter further.\u003c/p\u003e\n\u003cp\u003eThe middle-aged man stood up and, feeling a bit perplexed, left the tower.\u003c/p\u003e\n\u003cp\u003eMeanwhile, back on the second floor of the Sun Soul Society’s Demon heart exchange shop, Meng Hao stood there with hands clasped behind his back. He looked down at the shattered remnants of the Nine Dragons Demon Heart Scale, and then looked over at the old men, who stood there as dumbstruck as wooden chickens, completely speechless.\u003c/p\u003e\n\u003cp\u003eThey were struck thoroughly and completely senseless. Their heads filled with unprecedentedly large crashing waves, and they felt as if their minds were about to be torn into shreds.\u003c/p\u003e\n\u003cp\u003eThen, they began to calculate….\u003c/p\u003e\n\u003cp\u003e“Changing colors once indicates a complete doubling in the number of Demon hearts….\u003c/p\u003e\n\u003cp\u003e“In total, there were six changes in color, which means that the number of Demon hearts would be six times the amount before…. Before, there were 80,000 demon hearts. Don’t tell me that his bag of holding actually has 500,000 Demon hearts!?!?\u003c/p\u003e\n\u003cp\u003e“If you changed 500,000 Demon hearts into Spirit Stones, that… that would be….\u003c/p\u003e\n\u003cp\u003e“Over 300,000,000!!” Their minds roared as they looked over at Meng Hao, terrified.\u003c/p\u003e\n\u003cp\u003e“No way!!\u003c/p\u003e\n\u003cp\u003e“The Nine Dragons Demon Heart Scale does indeed have a limitation. According to the standard of low-grade Demon hearts, it’s supposedly able to accommodate 1,000,000. 500-600,000 wouldn’t cause it to shatter. Something’s going on here!” The old men gasped and looked over fixedly at Meng Hao.\u003c/p\u003e\n\u003cp\u003eHowever, before they could figure out where the problem lay, Honor Guard Zhou and Elder Sun, despite being thoroughly shaken, also suddenly realized that something was off. They too looked over at Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe eyes of nine people all turned red.\u003c/p\u003e\n\u003cp\u003eAs of now, the expressions of the seven old men were that of complete exasperation as they finally considered… the possibility of losing.\u003c/p\u003e\n\u003cp\u003e“You cheated!!” they roared, their voices hoarse.\u003c/p\u003e\n\u003cp\u003eIf they lost, their Demon hearts would become Meng Hao’s. It was a vast sum that they fundamentally couldn’t accept. After all, these weren’t their Demon hearts, but rather, the property of the various Sects and Clans that they represented.\u003c/p\u003e\n\u003cp\u003e“You definitely cheated! The Demon Heart Scale can accommodate 1,000,000 low-grade Demon hearts. I don’t believe that your bag of holding has more than 900,000!\u003c/p\u003e\n\u003cp\u003e“I don’t know how you did it, but it’s definitely not fair! Such actions deserve death!” The killing intent in the old men immediately grew more obvious.\u003c/p\u003e\n\u003cp\u003e“Do you, or do you not, dare to compete one more time!? Take the Demon hearts out of your bag of holding, and we can compare numbers directly!\u003c/p\u003e\n\u003cp\u003e“If you don’t dare, then it proves you cheated! To behave so treacherously in front of us means that you won’t step foot alive out the front door of this Demon heart exchange pavilion!”\u003c/p\u003e\n\u003cp\u003eThe seven old men were acting in a very domineering fashion. They strode forward, their Cultivation bases unleashed, transforming into an intangible tempest which spread out in all directions.\u003c/p\u003e\n\u003cp\u003eWei Li’s face was pale, and were she not hiding behind Meng Hao, she wouldn’t be able to take it, and would directly explode.\u003c/p\u003e\n\u003cp\u003eThe old man who had reached out to take Meng Hao’s bags of holding just now suddenly produced another bag of holding which he tossed onto the stone slab. The nine dragons flickered, and suddenly, a blue light appeared.\u003c/p\u003e\n\u003cp\u003eHowever, it wasn’t completely blue. Only about half of the first dragon had turned blue.\u003c/p\u003e\n\u003cp\u003e“98,000 low-grade Demon hearts. This is all the Demon hearts I possess. Do you dare to gamble again?!”\u003c/p\u003e\n\u003cp\u003eHonor Guard Zhou and Sun Yunliang stood off to the side silently watching. This time, even Honor Guard Zhou didn’t react; he didn’t want to be involved with the matter any more.\u003c/p\u003e\n\u003cp\u003eMeng Hao coldly looked over the seven old men, then waved his right hand. Instantly, all of his bags of holding flew out from the rubble of the destroyed stone slab. Seeing this, the several old men roared and closed in on him.\u003c/p\u003e\n\u003cp\u003eHowever, before they could get close, Meng Hao opened the last of the bags of holding, and expressionlessly removed a Demon heart. It emanated with bright colors, along with dense spiritual energy. Meng Hao waved his sleeve, causing the Demon heart to fly over to Sun Yunliang.\u003c/p\u003e\n\u003cp\u003e“Elder Sun, would you mind appraising that for me?” he said coolly.\u003c/p\u003e\n\u003cp\u003eThe seven old men stopped in their tracks and looked at the Demon heart in Sun Yunliang’s hand. Their faces fell. They didn’t need to look closely at it. Based on the spiritual energy, as well as its color and size, it was easy to determine….\u003c/p\u003e\n\u003cp\u003e“Mid-grade Demon heart!!” Sun Yunliang gasped. His words instantly crushed any last bit hope the seven old men had to come out on top.\u003c/p\u003e\n\u003cp\u003eSun Yunliang took a deep breath and gazed at the Demon heart. His face flickered through various emotions, and then he turned to stare at the bag of holding in Meng Hao’s hand. The seven old men were doing exactly the same. All of them were inwardly forming speculations about what was going on, which caused their faces to become more and more unsightly.\u003c/p\u003e\n\u003cp\u003e“The price of mid-grade Demon hearts doesn’t fluctuate very much,” said Sun Yunliang. “A single one is worth 10,000 Spirit Stones, or ten low-grade Demon hearts. Of course, it doesn’t work the other way around.” He looked up at Meng Hao and then slowly said, “Fellow Daoist, how many mid-grade Demon hearts do you possess?”\u003c/p\u003e\n\u003cp\u003eMeng Hao didn’t say anything in response. He simply waved his sleeve, causing a glittering, crystalline waterfall to spill out of his bag of holding. The entire area instantly filled with dense spiritual energy. The second floor turned into something like a land of Immortals.\u003c/p\u003e\n\u003cp\u003e10,000 mid-grade demon hearts piled up all around. Immediately, everyone present began to pant, and their minds shook.\u003c/p\u003e\n\u003cp\u003e“10… 10,000 mid-grade Demon hearts. That’s equal to 100,000 low-grade Demon hearts. They could be traded for… 100,000,000 Spirit Stones!” Sun Yunliang struggled to maintain his composure as he spoke.\u003c/p\u003e\n\u003cp\u003eHonor Guard Zhou, on the other hand, felt his vision growing dim, and he almost passed out. How could he ever have imagined that the person he scorned so openly would end up having so many mid-grade Demon hearts?\u003c/p\u003e\n\u003cp\u003eAs for the seven old men, they trembled in place and looked almost as if they had just aged ten years.\u003c/p\u003e\n\u003cp\u003e“There is no need to directly compare,” said Sun Yunliang, looking over at Meng Hao. He clasped his hands and bowed courteously. “Fellow Daoist, you are the victor.”\u003c/p\u003e\n\u003cp\u003eWei Li stood behind Meng Hao, her mind reeling. She knew Meng Hao was rich, but she had never imagined that he would be… THIS rich.\u003c/p\u003e\n\u003cp\u003eMeng Hao lifted his right hand, collecting up the bags of holding belonging to the seven men. The old men watched on with red eyes. Their killing intent was even more intense now, and seeing Meng Hao dare to take their bags of holding put them in the mood to go all out and attack.\u003c/p\u003e\n\u003cp\u003e“Hold on a minute!”\u003c/p\u003e\n\u003cp\u003e“Fellow Daoist, you certainly do possess more Demon hearts than us. However, you still haven’t explained the matter of the cheating earlier!”\u003c/p\u003e\n\u003cp\u003e“Even if you do have 10,000 mid-grade Demon hearts, that’s still not enough to destroy the Nine Dragons Demon Heart Scale! You cheated, which means the bet doesn’t stand! We refuse to accept this!” Of course, the seven old men were now resorting to sophistry, and they knew it. However, what else could they do? There was no way the could simply allow Meng Hao to take away their Demon hearts.\u003c/p\u003e\n\u003cp\u003e“Well then, I’ll just have to make you accept it,” said Meng Hao calmly. He waved his hand, causing the remaining 20,000 mid-grade Demon hearts in his bag of holding to fly out. They piled up everywhere, nearly completely filling the second floor.\u003c/p\u003e\n\u003cp\u003eThe eyes of the seven old men widened as Meng Hao then sent the high-grade Demon hearts flying out from the bag of holding. The splendor of the high-grade Demon hearts caused them to instantly become the focus of all eyes on the second floor.\u003c/p\u003e\n\u003cp\u003eThe spiritual energy they produced transformed into a pillar-like aura that shot up into the air above Seahold. Wild colors flashed in the sky, and the wind and clouds roiled.\u003c/p\u003e\n\u003cp\u003eEvery Cultivator in Seahold instantly looked over in stupefaction. The buzz of conversation instantly rose up from all areas of Seahold.\u003c/p\u003e\n\u003cp\u003eBack in the Demon heart exchange pavilion, Sun Yunliang stared with slack jaw at the high-grade Demon hearts. He picked one up and looked at it closely, then hoarsely said, “This… this… is a high-grade Demon heart!!”\u003c/p\u003e\n\u003cp\u003eSuch items were considered treasures, and were rarely seen. A single one would normally be sold at auction, and in all the past years, he had only seen less than a hundred.\u003c/p\u003e\n\u003cp\u003e“The starting auction price for high-grade Demon hearts is 500,000 Spirit Stones. They can be exchanged for 50 mid-grade Demon hearts, or 500 low-grade Demon hearts…. There are 10,000 here… that means they are worth… worth… 5,000,000,000!!”\u003c/p\u003e\n\u003cp\u003eHonor Guard Zhou’s vision now went completely dark.\u003c/p\u003e\n\u003cp\u003eAs for the seven old men, their faces were deathly pale, and their minds filled with roaring. How could they ever have imagined that they were actually gambling with someone so enigmatic and impossible to predict?\u003c/p\u003e\n\u003cp\u003eThey, who had Demon hearts worth a few dozen million Spirit Stones, were betting about who was richer… with someone who had 5,000,000,000.\u003c/p\u003e\n\u003cp\u003eMeng Hao cleared his throat, then waved his hand. Immediately, all of the Demon hearts flew back into his bag of holding, including the roughly 100,000 belonging to the seven old men. The seven old men lifted their heads up and roared. Their eyes were red as the complete power of their Cultivation bases exploded out and they charged Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression suddenly turned cold.\u003c/p\u003e\n\u003cp\u003e“Screw off!”\u003c/p\u003e\n\u003cp\u003eTwo words caused minds of the seven men to feel as if they were filled with lightning. Blood sprayed from their mouths. They weren’t able to even get close to Meng Hao before they were sent tumbling backward. They looked at him and coughed up blood, their expressions filled with unprecedented looks of astonishment and fear.\u003c/p\u003e\n\u003cp\u003e“Spirit… Spirit Severing!!” Their faces drained of blood, and they began to tremble violently. This time, Honor Guard Zhou really did pass out, falling flat onto the ground.\u003c/p\u003e\n\u003cp\u003eSun Yunliang gasped, stepped forward, and then bowed with clasped hands. “Junior offers greetings, senior!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-5-chapter-668\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-5-chapter-670\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-5-chapter-669","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
