{"id":53007,"no":682,"title":"Chapter 679: Battle!","content":"\u003cp\u003e\u003cstrong\u003eChapter 679: Battle!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“How can he be so strong!?!?\u003c/p\u003e\n\u003cp\u003e“A great Dao descended, making it a great Dao Spirit Severing, different from mine. But, it still doesn’t make sense for him to be so terrifying!\u003c/p\u003e\n\u003cp\u003e“He hasn’t even used any magical techniques or items! He’s only relying on his fleshly body!!\u003c/p\u003e\n\u003cp\u003e“Dammit! Just what level is his fleshly body at? Magical items are completely ineffective, nor could it be shaken by divine abilities! What type of fleshly body is it!?” Saint Flying Immortal’s fear had reached the pinnacle. In his entire life of practicing of cultivation, he had never encountered a Cultivator of the same stage who caused him to be so terrified.\u003c/p\u003e\n\u003cp\u003e“Damn you, 10th Wang Clan Patriarch, you conned me!! If I’d known this Meng Hao was so inhuman, you couldn’t have said anything to convince me to join you….” He flew forward at top speed, fearful of being pursued. He even spit out some blood and burned more life force to go faster.\u003c/p\u003e\n\u003cp\u003eBut it didn’t matter how fast he went, he couldn’t go faster than the war chariot.\u003c/p\u003e\n\u003cp\u003eMeng Hao was mounted on the war chariot, fueling it with a sliver of the Qi of Immortal Shows the Way. Thrumming, it caught up with Saint Flying Immortal in only a moment. Then it slammed violently toward him.\u003c/p\u003e\n\u003cp\u003eSaint Flying Immortal’s face fell. He was incapable of evading; he only had time to wave his sword of light behind him to block. A huge boom could be heard as the sword of light shattered into pieces. Saint Flying Immortal’s body then directly exploded.\u003c/p\u003e\n\u003cp\u003eHis Nascent Divinity flew out, clearly in a sorry state. Meng Hao exited the war chariot and waved his hand, employing the Eighth Demon Sealing Hex. Saint Flying Immortal didn’t even have a chance to move before countless invisible strands of Qi seemed to entwine his quivering Nascent Divinity.\u003c/p\u003e\n\u003cp\u003eHis mind was instantly inundated with a profound sense of imminent death. His eyes bulged and he struggled violently, but he could do nothing as Meng Hao waved his hand, causing a hundred Wooden Time Swords to fly out. They circulated around Saint Flying Immortal to form a swirling Lotus Sword Formation.\u003c/p\u003e\n\u003cp\u003eA miserable shriek could be heard as Saint Flying Immortal’s Nascent Divinity rapidly began to wither up. In the space of about ten breaths, it shrank, much like it would if it was being refined. Then, it withered into nothing; he was dead in body and spirit.\u003c/p\u003e\n\u003cp\u003eMeng Hao waved his hand to collect up Saint Flying Immortal’s bag of holding, and then looked over the Lotus Sword Formation.\u003c/p\u003e\n\u003cp\u003e“The lotus is also like the act of refining….” he thought. [1. In Chinese the world for lotus and the word for “refine” sound very similar]\u003c/p\u003e\n\u003cp\u003eIt was at this point that the crackling of thunder could be heard in the sky off in the distance. The wind whipped about, and in the blink of an eye, the sunny day turned dark. Countless pitch-black clouds surged up, forming a dense mass that looked like a gigantic face. It was none other than… the face of the 10th Wang Clan Patriarch.\u003c/p\u003e\n\u003cp\u003eThe face was surrounded by crisscrossing bolts of lightning and heralded by peals of thunder; on the forehead of the face, an old man could be seen, his eyes glittering brightly.\u003c/p\u003e\n\u003cp\u003e“Meng Hao!”\u003c/p\u003e\n\u003cp\u003eThe voice drowned out the thunder, like a Heavenly being’s majestic roar, blasting an enormous craterous depression into the Milky Way Sea down below, which rapidly transformed into a rumbling, spinning vortex.\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath and looked coldly at the 10th Wang Clan Patriarch.\u003c/p\u003e\n\u003cp\u003e“Another clone,” he said. His Divine Sense was much more powerful than before, and he understood a lot more about the 10th Wang Clan Patriarch now that he had fought two of his clones before. How could he not notice that this was indeed just a clone?\u003c/p\u003e\n\u003cp\u003eMeng Hao raised his right hand into a fist, and the Mountain Consuming Incantation appeared. One thousand mountains appeared around him, then more, until tens of thousand of mountains could be seen. The mountains were not small, and appeared to contain seawater. These represented all of the underwater mountains that existed in the range of Meng Hao’s Divine Sense.\u003c/p\u003e\n\u003cp\u003e“The Mountain Consuming Incantation is divided into three aspects; the mountain, the soul, and the will!\u003c/p\u003e\n\u003cp\u003e“Along with my Cultivation base breakthrough, I was enlightened regarding the soul.\u003c/p\u003e\n\u003cp\u003e“This soul aspect more or less can be controlled by means of my Demon Sealing powers. With the art of Righteous Bestowal, I can extract the souls of mountain and insert them into my mountains. That is the complete second stage of the great art of Mountain Consuming!”\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes shone with a strange light. As he faced up against the 10th Wang Clan Patriarch, he felt pressure bearing down on him, but at the same time, an intense desire to do battle. He raised his hand and then pushed it down toward the sea.\u003c/p\u003e\n\u003cp\u003e“Righteous Bestowal!\u003c/p\u003e\n\u003cp\u003e“Mountains of the Milky Way Sea, you are sunk beneath the waters, living in a world without daylight. Today, I, Meng Hao, will borrow your souls. I will split open the Heavens and Earth and allow you to bathe in the sunlight!\u003c/p\u003e\n\u003cp\u003e“EMERGE!”\u003c/p\u003e\n\u003cp\u003eIn response to his shout, the sea began to seethe as, one by one, the mountains within the sea began to tremble. At the same time, an invisible aura began to spread up from them toward the surface.\u003c/p\u003e\n\u003cp\u003eAs the sea blustered, the souls of the mountains appeared, merging into the mountains summoned by Meng Hao’s divine ability. Thousands upon tens of thousands of mountains, a world-shaking sight, completely incomparable!\u003c/p\u003e\n\u003cp\u003eAs the mountains spun around Meng Hao, he stretched his arms out wide. Hair flying around him, and eyes blazing with the desire to do battle, he suddenly swept his hands out in front of him. The tens of thousands of mountains all shot through the air with shocking rumbling sounds heading directly toward the gigantic face floating in mid-air.\u003c/p\u003e\n\u003cp\u003eThe 10th Wang Clan Patriarch’s face flickered as he performed an incantation gesture. The face that surrounded him immediately sped toward the mountains. They neared each other, and then slammed into each other, giving rise to a rumbling boom that filled the entirety of the Third Ring.\u003c/p\u003e\n\u003cp\u003eOne mountain after another collapsed, and the face was riddled with gaping wounds. A moment later, amidst deafening roars, all of the mountains collapsed, and the face fell apart into pieces.\u003c/p\u003e\n\u003cp\u003eMeng Hao didn’t pause for a moment. He flew up into the air, waving his arm to cause one hundred Wooden Time Swords to appear and form into the Lotus Sword Formation. Instantly, the formation shot toward the 10th Wang Clan Patriarch.\u003c/p\u003e\n\u003cp\u003eAt the same time, he began to clench and unclench his fist. Every time he did this, his energy would redouble. It was none other than the Nine Heavens Destruction!\u003c/p\u003e\n\u003cp\u003eNow that his Cultivation base was truly in the Spirit Severing stage, he had gained complete enlightenment of it.\u003c/p\u003e\n\u003cp\u003eThe 10th Wang Clan Patriarch’s pupils constricted. He could clearly sense that Meng Hao was completely different than he remembered, and was far, far more powerful.\u003c/p\u003e\n\u003cp\u003e“And yet, you are still… an insignificant bug!” he said with a cold snort. He waved his right hand, causing a red glow to appear in the cloud-choked sky.\u003c/p\u003e\n\u003cp\u003eIt was a sun! A red sun!\u003c/p\u003e\n\u003cp\u003e“Setting Sun!” he said coolly. The red glow spread out to fill Heaven and Earth, instantly causing Meng Hao’s one hundred Wooden Time swords to slow down.\u003c/p\u003e\n\u003cp\u003e“Time Combustion!” growled Meng Hao.\u003c/p\u003e\n\u003cp\u003eIn response to the words, the one hundred Wooden Time Swords and their ten sixty-year cycles of Time power, instantly began to burn. The combustion of Time caused their speed to increase dramatically. They pierced through the layers of redness to appear near the 10th Wang Clan Patriarch, where they spun around him slowly.\u003c/p\u003e\n\u003cp\u003eMerely a single rotation caused the 10th Wang Clan Patriarch’s face to flicker. He could sense that his clone had, in the blink of an eye, lost several thousand years of longevity.\u003c/p\u003e\n\u003cp\u003e“A trifling Time treasure? Shatter!” He gave a cold snort, and the red glow grew even more shocking. It now emanated intense heat that spread out and began to shatter the Wooden Time Swords.\u003c/p\u003e\n\u003cp\u003eMeng Hao was already moving forward. “Detonate!”\u003c/p\u003e\n\u003cp\u003eBOOOOOOOMMMMMMMM!\u003c/p\u003e\n\u003cp\u003eOf the one hundred Wooden Time Swords, seventy simultaneously exploded. When the Spring and Autumn trees detonated, they unleashed an insane power of Time that turned into a Time vortex. The 10th Wang Clan Patriarch’s face fell as the rumbling echoed out. His body began to wither, and he was just about to retreat when Meng Hao shot forward as fast as lightning. His right fist had already clenched eight times in a row; now it clenched for the ninth time and then punched toward the 10th Wang Clan Patriarch.\u003c/p\u003e\n\u003cp\u003e“Nine Heavens Destruction!”\u003c/p\u003e\n\u003cp\u003e“Setting Sun, Falling Clouds!” The 10th Wang Clan Patriarch’s body emanated a monstrous red glow that billowed out.\u003c/p\u003e\n\u003cp\u003eMeng Hao faced it head on, and his body ignited into flames. However, his fist still struck its target.\u003c/p\u003e\n\u003cp\u003eA huge boom rattled out, and the 10th Wang Clan Patriarch fell back, his face pale. Killing intent radiated from his eyes as he saw that Meng Hao, blood pouring from his mouth and body in flames, was actually pursuing him.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s hoarse voice once again rang out: “Detonate!”\u003c/p\u003e\n\u003cp\u003eThe detonation from before had been that of seventy Wooden Time Swords. There were still thirty left, all of which exploded at the same time. A tempest of Time was created in the 10th Wang Clan Patriarch’s path of retreat, finally managing to wound him.\u003c/p\u003e\n\u003cp\u003eBlood sprayed from his mouth, after which he lifted his head up and roared with rage. Of three clones, two had been slain. This third clone was somewhat weak, was not carrying any magical items, and was limited in the divine abilities it could use. However, it had a Dao Seeking Cultivation base! How could it be injured in this way?\u003c/p\u003e\n\u003cp\u003eTo the 10th Wang Clan Patriarch, it was a humiliation!\u003c/p\u003e\n\u003cp\u003eAfter panting a few times, he stifled his rage and then looked at Meng Hao approaching him. “He’s intentionally trying to exasperate me. I must under no circumstances come here with my true self. He may still be able to use that Immortal’s sword, and the threat that could pose to me… must not be underestimated!”\u003c/p\u003e\n\u003cp\u003eGlaring at Meng Hao, he cried, “Call the Wind, Summon the Rain!”\u003c/p\u003e\n\u003cp\u003eBlack clouds containing black dragons whistled around him as a deluge drenched the vicinity, each raindrop contained killing intent. The raindrops seemed to cover Heavens and Earth as they headed straight for Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Even if I have to sacrifice this clone, I need to draw out that Immortal’s sword. After he uses it, then my true self can come!”\u003c/p\u003e\n\u003cp\u003eMeng Hao, his body in flames, quickly retreated. A violet glow appeared in his eyes, and he burned life force to restore his flesh, which visibly healed at a rapid rate. Even as the 10th Wang Clan Patriarch neared him, Meng Hao stepped into the war chariot.\u003c/p\u003e\n\u003cp\u003eIt was in that moment that the black dragons roared, and the dense rain of killing intent began to close in.\u003c/p\u003e\n\u003cp\u003eMeng Hao pushed down onto the war chariot with his hand. Even while continuing to heal himself, he sent the Qi of Immortal Shows the Way into the war chariot. Then, instead of fleeing, he shot toward the 10th Wang Clan Patriarch with all the power the war chariot could muster.\u003c/p\u003e\n\u003cp\u003eOutside of the war chariot, one vicious beast after another materialized, roaring. The sounds of their chains echoed about as they charged at top speed toward the 10th Wang Clan Patriarch, whose face immediately flickered. He hadn’t sensed earlier that the war chariot was extraordinary, so seeing what was happening now left him shaken inwardly. He instantly moved to evade.\u003c/p\u003e\n\u003cp\u003eHowever, his speed was no match for the war chariot!\u003c/p\u003e\n\u003cp\u003eA boom could be heard as it slammed into him. Any black dragons along the way collapsed and the rainwater was destroyed. A massive energy swelled up, slamming into the 10th Wang Clan Patriarch. Blood poured from his mouth as he performed a double-handed incantation and then shoved his hands out forward. His face was twisted ferociously as he utilized the entire power of his Cultivation base.\u003c/p\u003e\n\u003cp\u003eEven still, he was shoved backward by three hundred meters. By the time he came to a stop, blood was gushing out of his mouth, but his body had not been destroyed.\u003c/p\u003e\n\u003cp\u003e“Before Spirit Severing, he was no weakling. However, I never imagined that after reaching Spirit Severing, he would be so swift and fierce.\u003c/p\u003e\n\u003cp\u003e“I must have this Perfect Dao foundation!”\u003c/p\u003e\n\u003cp\u003e-----\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis chapter was sponsored by Mototsugu Oba, Junior Fortytwo, and Seena Amidhozour\u003c/em\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-5-chapter-678\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-5-chapter-680\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-5-chapter-679","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
