{"id":53147,"no":822,"title":"Chapter 818: Changing Fate!","content":"\u003cp\u003e\u003cstrong\u003eChapter 818: Changing Fate!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“What are you staring at? Write out a promissory note! However much you think your life’s worth, write down that many spirit stones. Although, if the amount you write down is too small, don’t forget that I have a lot of spirit stones in my bag of holding, and I might just fork them over to buy you.”\u003c/p\u003e\n\u003cp\u003e“You!!” cried Taiyang Zi, almost coughing up a mouthful of blood as he glared at Meng Hao. After a long moment, he sighed and then wrote down a huge sum onto the promissory note. Meng Hao carefully placed it with his collection of other promissory notes.\u003c/p\u003e\n\u003cp\u003eWhen the people in the crowd, and Taiyang Zi, saw how many promissory notes Meng Hao had in his bag of holding, they gasped.\u003c/p\u003e\n\u003cp\u003e“How many people has he conned in the past…? I can’t believe he has so many promissory notes!”\u003c/p\u003e\n\u003cp\u003e“Just where exactly is he from? He couldn’t be a cultivator from the lands of South Heaven, could he?”\u003c/p\u003e\n\u003cp\u003e“There’s no way. South Heaven is a strange place, but how could it produce a shameless bastard like that!?!?”\u003c/p\u003e\n\u003cp\u003eTaiyang Zi looked at all the promissory notes and suddenly felt a bit better about his situation. With a forced smile, he looked at Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Elder Brother Meng….”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Meng Hao said earnestly. “Meng Hao is honest with all customers, and open and aboveboard in all matters. I would definitely never use the promissory note to coerce you.” Suddenly, he lowered his voice to a whisper. “Alright, you’ve been very cooperative. Come come, tell me who among all those bastards out there you have a beef with. I’ll grab that person next.\u003c/p\u003e\n\u003cp\u003e“Choose carefully.” With that, Meng Hao stepped to the side, dug another hole, and then put some medicinal pills in it.\u003c/p\u003e\n\u003cp\u003eTaiyang Zi stared at Meng Hao with wide eyes. The crowds outside gasped, and quite a few of their number began to back away. There were even a few who directly flew away.\u003c/p\u003e\n\u003cp\u003eTaiyang Zi was in a daze for a moment, until finally his eyes flickered and he turned to look out at the crowds. Then, his gaze locked with that of Wang Mu from the Wang Clan.\u003c/p\u003e\n\u003cp\u003e“Wang Mu!” cried Taiyang Zi, his face twisting with hatred. “He’s the one! He stole my good fortune that year. Him!”\u003c/p\u003e\n\u003cp\u003eWhen Wang Mu, who stood off in the distance, heard what Taiying Zi said, his eyes flickered. The Dao Protectors near him stepped forward, their eyes radiating coldness.\u003c/p\u003e\n\u003cp\u003e“Got it,” said Meng Hao. He quickly reached out and tied Taiyang Zi up, then tossed him over to the grapevine trellis. Then he produced the Lightning Cauldron, which glittered with electricity as he looked over at Wang Mu. Wang Mu instantly rotated his cultivation base with all his power.\u003c/p\u003e\n\u003cp\u003eHowever, in the next instant, Meng Hao shifted his gaze to Song Luodan. Instantly, the two of them vanished. Then, Song Luodan reappeared in the courtyard. However, he remained hovering in the air, and didn’t touch the ground.\u003c/p\u003e\n\u003cp\u003e“Do you really think it’s worth it to play such ridiculous games?” Song Luodan chuckled coldly. Most of the people in the crowd outside were now prepared for Meng Hao to use the Lightning Cauldron. However, it was at this moment that Meng Hao’s second true self violently stamped his foot onto the ground. Immediately, a boom could be heard as the medicinal pills beneath Song Luodan’s feet exploded.\u003c/p\u003e\n\u003cp\u003eSong Luodan coughed up blood as the explosion rippled out. He had no time to evade. His hair was thrown into disarray, and he let out a miserable shriek. At the same time, Meng Hao’s second true self closed in.\u003c/p\u003e\n\u003cp\u003eAs soon as Meng Hao appeared outside, booms filled the air as Li Ling’er, Fang Yunyi, Fang Xiangshan, as well as the Ji Clan members, and even Chosen from other sects, along with their Dao protectors, all attacked.\u003c/p\u003e\n\u003cp\u003eThe gleam of spell formations appeared on the ground, which had been set up in secret earlier in order to cause problems for Meng Hao.\u003c/p\u003e\n\u003cp\u003eSome people even used magical items. Massive roaring filled the area in the blink of an eye. Meng Hao coughed up a mouthful of blood, and then sped backward in the war chariot. Lightning flickered as he switched positions several times in a row before he was finally able to extricate himself. Just when he was almost back into the courtyard, a sword shot through the air toward him. The sword filled the darkness with brilliant light, and left a bright streak in the air as it bore down on Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe shocking sword caused Meng Hao’s face to flicker. He quickly performed an incantation gesture, causing divine abilities to explode out. At the same time, his Dharma Idol appeared and blocked the sword. Rumbling shook everything as the sword unexpectedly sliced through the Dharma Idol and then slashed down onto the war chariot.\u003c/p\u003e\n\u003cp\u003eA huge boom filled the air, and blood sprayed out of Meng Hao’s mouth. However, he borrowed the momentum from the blast to shoot back into the courtyard. Once inside, he coughed up another mouthful of blood and then suddenly looked up. At some point, Ji Yin had appeared right in front of the temple gate. His right hand stretched out, surrounded by swirling Karma power, clearly on the verge of passing into the courtyard.\u003c/p\u003e\n\u003cp\u003eThen, it did pass into the courtyard itself, apparently completely unaffected by the restrictive spells. Rumbling like thunder rippled out as he stretched his hand out about three inches into the courtyard. However, at that point, he could proceed no further and he slowly retracted his hand.\u003c/p\u003e\n\u003cp\u003eMany gasps could be heard from the crowd as they looked at Ji Yin, whose back was to them all, making it impossible for them to see his facial expression.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s pupils constricted, and his heart trembled. As of this point, he was now aware of how incredibly powerful Ji Yin was.\u003c/p\u003e\n\u003cp\u003e“Let me in, and I’ll spare your life,” said Ji Yin. It was hard to tell whether his voice was that of a man or a woman. However, it was completely cold-blooded, and filled with a lust for battle.\u003c/p\u003e\n\u003cp\u003eMeng Hao smiled and wiped the blood off of his mouth. He then turned and walked over to the seriously wounded Song Luodan, who had already been restrained and tied up by his second true self.\u003c/p\u003e\n\u003cp\u003eSong Luo glared hatefully at Meng Hao, killing intent flickering in his eyes.\u003c/p\u003e\n\u003cp\u003eMeng Hao wasn’t in the mood for chattering, so he simply slapped Song Luodan in the face a few times, which of course cause his rage to surge even higher. Without another word, he took Song Luodan’s bag of holdings, rifled through them, and then finally then pulled out a piece of paper and a pen.\u003c/p\u003e\n\u003cp\u003e“I won’t sign that thing even if you kill me!” raged Song Luodan, looking especially ferocious because of the scar running down his face.\u003c/p\u003e\n\u003cp\u003e“Won’t sign it?” Meng Hao responded coolly. He turned to look over at the swinging vine, from which the sounds of faint laughter and the drip of black blood could be heard. “Lily, weren’t you looking for a friend to swing with you?”\u003c/p\u003e\n\u003cp\u003eFrom what Meng Hao could tell, Inky and Lily had changed quite a bit ever since the crazy old man gave Meng Hao his approval.\u003c/p\u003e\n\u003cp\u003eAs soon as Meng Hao spoke, the swing stopped moving. Then, the astonished Song Luodan flew up into the air, his body clearly completely out of his own control. Next, his body began to shrink; in the blink of an eye, he looked like he was seven or eight years old. Finally, he floated down to land on the vine, where he began to swing back and forth.\u003c/p\u003e\n\u003cp\u003eHis expression was numb, but intense terror could be seen in his eyes.\u003c/p\u003e\n\u003cp\u003eAt this point, the faint glow of dawn was just becoming visible. Soon, the strange phenomena inside the courtyard would disappear.\u003c/p\u003e\n\u003cp\u003eKilling intent flickered in the eyes of the crowd outside. This was especially true of the cultivators from Mount Sun and the Song Clan, and the various Chosen who were smitten with Fan Dong’er from the Nine Seas God World.\u003c/p\u003e\n\u003cp\u003eMeng Hao frowned. After looking up at the sky, he walked back into the temple hall, where he looked around at the Dao Projections and the ancient bronze lamp. Finally, he sighed.\u003c/p\u003e\n\u003cp\u003e“49 days total, but only half of them have gone by. Obviously… there’s no way I can keep people out of this place for that long.\u003c/p\u003e\n\u003cp\u003e“There are simply too many of them outside. So far, I’ve only been able to stretch things out for two days….” He stood in front of the bronze lamp and looked at the flickering flame. During the day, the flame would go out, but after having observed the item for so long, Meng Hao knew that the flame itself wasn’t truly extinguished. The heart of the flame still existed.\u003c/p\u003e\n\u003cp\u003eThe lamp itself only burned brightly at night.\u003c/p\u003e\n\u003cp\u003eMuttering, Meng Hao once again poured some blood into the flames, which hissed and then emitted a delicate fragrance that left him feeling enlivened after smelling it.\u003c/p\u003e\n\u003cp\u003e“I’m not supposed to let anyone come inside to touch the lamp and contaminate it with their aura. It’s… fundamentally impossible to meet that requirement.” Meng Hao sighed. The more he thought about it, the more it seemed completely unfeasible. Furthermore, the sky was almost bright….\u003c/p\u003e\n\u003cp\u003eMeng Hao could sense the killing intent coming from the groups outside the courtyard. He was like a thorn in their sides, someone blocking their path to good fortune. Furthermore, some of that killing intent resulted directly from him offending people.\u003c/p\u003e\n\u003cp\u003e“Well, if I have to ask for help from dad and mom because of something as trivial as this, then I’m not Meng Hao!” His eyes began to shine with a cold gleam. Before reaching Dao Seeking, he had not relied on any assistance from his father and mother. He had stepped halfway into true Immortality all by himself.\u003c/p\u003e\n\u003cp\u003eHe had experienced multiple deadly situations, had battled the 10th Wang Clan Patriarch in the Milky Way Sea, had tread the narrow gap between life and death, had fought in the great war of the Southern Domain, and had risen to the pinnacle of prominence.\u003c/p\u003e\n\u003cp\u003eThose were all things that made Meng Hao feel quite proud of himself.\u003c/p\u003e\n\u003cp\u003e“Besides, my road leads beyond South Heaven, whereas dad and mom… must stay here for 100,000 years. I have to walk my path alone. If I want good fortune… I’ll take the risks myself and earn it myself!\u003c/p\u003e\n\u003cp\u003e“If I did it any differently, I’d be the same as all of those people out there.” The desire to fight gleamed in his eyes. He took a deep breath, when suddenly, a new idea appeared in his mind. He stopped in place, and a strange expression filled his face.\u003c/p\u003e\n\u003cp\u003e“Wait a second….\u003c/p\u003e\n\u003cp\u003e“That crazy old man said that I couldn’t let the flame be extinguished for 49 nights. He also said that I couldn’t let anyone come in here to touch the lamp.\u003c/p\u003e\n\u003cp\u003e“In other words, actually stepping foot into this place isn’t the problem. As long as no one touches the lamp, then the requirement will be met, right?” Meng Hao’s eyes sparkled.\u003c/p\u003e\n\u003cp\u003e“If that’s true, then it also goes to say that… it doesn’t matter what I do; I could even take the bronze lamp away from here. As long as nobody else touches it, and it remains unextinguished, then everything will be fine.”\u003c/p\u003e\n\u003cp\u003eHaving reached this point in his train of thought, he began to pant. A gleam of determination appeared in his eyes, and he decided that since he couldn’t prevent everyone from entering this place, he might as well… try out his new idea!\u003c/p\u003e\n\u003cp\u003eHe immediately stretched his hand out and grabbed the lamp. The instant he tried to actually pick it up, he realized that the lamp was completely immovable; there was no way for him to put it in his bag of holding. A strange light flickered in his eyes as he rotated his cultivation base at full power. His Dharma Idol appeared behind him, and Meng Hao used all the power he could muster to try to pull up the bronze lamp.\u003c/p\u003e\n\u003cp\u003eShocking rumbles could be heard coming from within the temple hall. The ground trembled and the entire temple shook. A deep, subterranean rumble could be heard, as well as the sound of laughing and crying from the courtyard. The mountain range, and in fact, the entire land, was shaking violently.\u003c/p\u003e\n\u003cp\u003eThe crowds outside the courtyard stared at the temple hall in shock.\u003c/p\u003e\n\u003cp\u003eIn that instant, all of the lands of South Heaven were shaken, to the extent that the entire planet temporarily ceased to rotate!\u003c/p\u003e\n\u003cp\u003eThe Milky Way Sea roared, and all the continents trembled. All the powerful experts in South Heaven were shaking in astonishment!\u003c/p\u003e\n\u003cp\u003eIn the Tower of Tang, Meng Hao’s father and mother were in the middle of playing a game of Go when suddenly his father’s face flickered. Even as he looked up, Meng Hao’s mother’s face also flickered.\u003c/p\u003e\n\u003cp\u003e“That’s….”\u003c/p\u003e\n\u003cp\u003e“The Immortal Ancient is in motion. Not good! There must have been some kind of accident!” Meng Hao’s father rose to his feet and was just about to fly up into the air, when both he and Meng Hao’s mother stopped in place. Their expressions flickered as they saw a figure approaching from off in the distance.\u003c/p\u003e\n\u003cp\u003eHe had long gray hair, an ordinary-looking robe, and looked completely archaic. His eyes were filled with the glow of heavenly bodies. Not only did he look like a person who existed inside a painting, he looked like the type of person who could paint a multitude of universes with a wave of his hand.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s parents were immediately shaken. They clasped hands and bowed.\u003c/p\u003e\n\u003cp\u003e“Xiufeng offers greetings, senior!”\u003c/p\u003e\n\u003cp\u003e“Meng Li offers respectful greetings, senior!”\u003c/p\u003e\n\u003cp\u003eThis was the same man who had appeared to them on Planet East Victory, and had indicated that they should come to Planet South Heaven. He was the one who had directed them to guard the planet for 100,000 years. He was… an Outsider!\u003c/p\u003e\n\u003cp\u003eIf Meng Hao were here, he would immediately recognize that this person was… Shui Dongliu! [1. Here is a brief refresher about Shui Dongliu. He was introduced in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-194/\"\u003echapters 194\u003c/a\u003e and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-2-chapter-197/\"\u003e197\u003c/a\u003e during the Song Clan search for a son-in-law. He helped Meng Hao seal the Resurrection Lily into a painting in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-3-chapter-208/\"\u003echapter 208\u003c/a\u003e. Er Gen joked about him in the interlude after \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-3-chapter-222-interlude/\"\u003echapter 222\u003c/a\u003e. He made a super brief appearance in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-383/\"\u003echapter 383\u003c/a\u003e, when Meng Hao refined the Eyeless Larva. He prevented Ji Nineteen from severing Meng Hao’s Karma in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-425/\"\u003echapter 425\u003c/a\u003e. Finally, he helped Meng Hao acquire the Eternal Stratum in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-5-chapter-693/\"\u003echapter 693\u003c/a\u003e.]\u003c/p\u003e\n\u003cp\u003e“The chance for the Immortal was consumed by the Dao of Heaven,” he murmured. “The Dao path has overlapped with the ancient. I saw nine fluttering butterflies once again flying in approach [2. This is not the first time nine butterflies have been mentioned in the story. If you don’t remember you can check out \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-555/\"\u003echapters 555\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-587/\"\u003e587\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-613/\"\u003e613\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-5-chapter-652/\"\u003e652\u003c/a\u003e and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-5-chapter-664/\"\u003echapter 664\u003c/a\u003e]. I saw the one who has vanished; and the look in his eyes as he turned his head to look back…. It can’t be predicted anymore, and I can’t see through it anymore…. He… actually managed to change his fate!” A strange gleam appeared in his eyes as he gazed toward the Immortal Ancient Daoist Rite Temple in the distant mountains.\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-817\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-819\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-818","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
