{"id":53154,"no":829,"title":"Chapter 825: Zhixiang Pays Her Debt!","content":"\u003cp\u003e\u003cstrong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e[/expand]\u003c/p\u003e\n\u003cp\u003eUnfortunately, time was a luxury that Meng Hao did not have!\u003c/p\u003e\n\u003cp\u003eHe was surrounded by Chosen and Dao Protectors from the various clans and sects of the Ninth Mountain and Sea. Virtually all were present, and even though he could use Form Displacement Transposition, he still had his limits.\u003c/p\u003e\n\u003cp\u003eFurthermore, the Chosen and Dao Protectors had now recovered from being stunned at Meng Hao’s escape from their ambush and were once again racing to catch up to him.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s face was pale as he sped along, pursued by Wang Mu and some other Chosen. Gradually, more and more figures began to gather in pursuit around him. Although Meng Hao couldn’t actually see any of them, he could sense them, and knew that there were many.\u003c/p\u003e\n\u003cp\u003eThe one-armed Fan Dong’er was clearly visible behind him giving chase, although Zhao Yifan was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003eMeng Hao could also see the Fang clan’s Fang Xiangshan in the crowd.\u003c/p\u003e\n\u003cp\u003eFrom the look of things, a grand battle was about to break out. However, it was at this point that a huge boom rang out. The ground beneath Meng Hao’s feet quaked, and massive fissures spread out as a mountain peak up ahead of Meng Hao collapsed into pieces.\u003c/p\u003e\n\u003cp\u003eAs it exploded, a huge beam of majestic light shot out from the ruins of the mountain. It appeared to be some sort of precious treasure manifesting itself, and it immediately attracted the attention of all of Meng Hao’s pursuers.\u003c/p\u003e\n\u003cp\u003eAt the same time, the ground seemed to be on the verge of collapsing. A huge depression appeared as an enormous yellow \u003ca href\u003d\"https://www.google.com/search?q\u003dloach\u0026amp;biw\u003d1397\u0026amp;bih\u003d674\u0026amp;source\u003dlnms\u0026amp;tbm\u003disch\u0026amp;sa\u003dX\u0026amp;ved\u003d0ahUKEwiZ2crClYTOAhVH02MKHTzSC60Q_AUIBigB#tbm\u003disch\u0026amp;q\u003d%E6%B3%A5%E9%B3%85\" target\u003d\"_blank\"\u003eloach\u003c/a\u003e suddenly exploded out of the ground that was nearly a thousand meters long. Actually, it was not one, but a total of nine that appeared.\u003c/p\u003e\n\u003cp\u003eIn an instant, the situation on the battlefield had completely changed.\u003c/p\u003e\n\u003cp\u003e“A Demon Loach!”\u003c/p\u003e\n\u003cp\u003e“How could there be a Demon Loach in this place!?!?”\u003c/p\u003e\n\u003cp\u003e“Dammit! Aren’t Demon Loaches native to Planet North Reed!?”\u003c/p\u003e\n\u003cp\u003eThe entire area was thrown into an uproar as the nine Demon Loaches roared onto the scene. The ground quaked, and all of a sudden, an urgent voice transmitted into Meng Hao’s mind.\u003c/p\u003e\n\u003cp\u003e“Meng Hao, head toward the third Demon Loach!”\u003c/p\u003e\n\u003cp\u003eBecause of the voice, Meng Hao awoke somewhat from his previously hazy mental state. He looked over at the third Demon Loach, and then instantly began to speed toward it. As he neared it, the enormous Demon Loach opened its mouth and swallowed him up, then dove back down toward the ground.\u003c/p\u003e\n\u003cp\u003ePeople on ground-level in the area began to call out, and several attempted to block the diving loach. However, it was at this point that the rest of the Demon Loaches spontaneously exploded. Massive booms rattled out over the land. At the same time, the bright light shining from the mountain reached a pinnacle of intensity, covering all the land until no one could see anything except the light.\u003c/p\u003e\n\u003cp\u003eEventually, the light got so bright that it turned into blackness!\u003c/p\u003e\n\u003cp\u003eAs for Meng Hao, everything went dark after being swallowed by the Demon Loach. However, he could feel that the creature was moving along at high speed, so he sat down cross-legged and rotated his cultivation base. He quickly began to exorcise the Demonic will, then consumed large quantities of medicinal pills to begin his healing process.\u003c/p\u003e\n\u003cp\u003eMeng Hao had been quite seriously injured in the battle just now. However, throughout his life, he had been seriously injured on many occasions, so from beginning to end, he was calm inside.\u003c/p\u003e\n\u003cp\u003eTime passed. A few days later, the Demon Loach finally stopped moving, and instead sank downward into the earth. Meng Hao’s eyes opened, and he saw that there were three people with him inside of the Demon Loach’s tunnel-like body.\u003c/p\u003e\n\u003cp\u003eThe person in the lead position was a woman wearing a veil. It was impossible to see her features clearly, but her eyes were beautiful, and from that it was possible to tell that the woman herself was stunning.\u003c/p\u003e\n\u003cp\u003eStanding on either side of her were two old women, both of whom were ancient, with faces covered with wrinkles. They seemed to have seen many years between them, and their eyes were dim. Of course, within that dimness was hidden storm-like violence.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at the woman and calmly said, “We haven’t seen each other for years.”\u003c/p\u003e\n\u003cp\u003eThe woman was none other than Zhixiang!\u003c/p\u003e\n\u003cp\u003eOne of the old women standing next to Zhixiang coolly said, “The kindness you showed to the Demon Immortal Sect has been paid back to you by us two this day. Our Demon Loach has already taken you away from the the deadly ambush set for you by Ji Yin.”\u003c/p\u003e\n\u003cp\u003eThe woman glanced at the bronze lamp above Meng Hao’s head, then looked away and said nothing further. She, along with the other Dao Protector, sat down cross-legged.\u003c/p\u003e\n\u003cp\u003eZhixiang stepped forward to stand in front of Meng Hao. After looking him over for a moment, she covered her mouth with her hand and laughed.\u003c/p\u003e\n\u003cp\u003eDespite the fact that her face was covered by a veil, her laughter was sweet and attractive.\u003c/p\u003e\n\u003cp\u003e“Like I said, the Demon Immortal Sect was deeply in your debt,” she said. She extended her right hand toward Meng Hao, within which was a jade bottle. “This is a medicinal pill, an ancient medicine from the Demon Immortal Sect. It should heal your wounds rapidly.”\u003c/p\u003e\n\u003cp\u003eMeng Hao didn’t respond, nor was he surprised by any of this. The urgent voice he had heard transmitted into his mind earlier had belonged to her.\u003c/p\u003e\n\u003cp\u003eHe took the jade bottle and opened it up. There was a red medicinal pill inside, which, based on his skill in the Dao of alchemy, he could instantly tell was extraordinary. After a moment of consideration, he picked up the medicinal pill, examined it closely, then swallowed it.\u003c/p\u003e\n\u003cp\u003e“You’re not afraid?” Zhixiang asked suddenly.\u003c/p\u003e\n\u003cp\u003e“There is nobody in the lands of South Heaven who can harm me,” Meng Hao said calmly.\u003c/p\u003e\n\u003cp\u003e“Oh? What about that deadly ambush just now?”\u003c/p\u003e\n\u003cp\u003e“I was tempering myself through training. If there was really a chance that I was going to die, things would have changed.” With that, he closed his eyes, which caused the two old women to open their own eyes and look at him.\u003c/p\u003e\n\u003cp\u003eThe pill contained no poison, and as soon as he consumed it, it transformed into a warm current that flowed through his body. The injury on his back immediately healed up, and black mist slowly seeped out of the palm of his right hand.\u003c/p\u003e\n\u003cp\u003eA few days passed, and by the time Meng Hao opened his eyes again, his hand was filled with a black mist that was the Devil Construct, which was now completely forced out of his body.\u003c/p\u003e\n\u003cp\u003eHaving expelled the Devil Construct, Meng Hao felt his heart pounding in trepidation. The danger he had faced in this incident was not the threat to his life, but rather, the influence of the Devilish will. Although the Devil Construct could give him access to incredible power, he had to pay a steep price for that.\u003c/p\u003e\n\u003cp\u003eNow that the Devil Construct was taken care of, Meng Hao’s injuries were nearly completely recovered.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he said to the two seated old women, and Zhixiang.\u003c/p\u003e\n\u003cp\u003eZhixiang looked at the Devil Construct in Meng Hao’s hand, thought for a moment, and then looked at Meng Hao.\u003c/p\u003e\n\u003cp\u003e“Ji Yin sealed your second true self and took him away.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes glittered coldly.\u003c/p\u003e\n\u003cp\u003e“That’s fine,” he replied. “I’ll just have to go get him back.” With that, he rose to his feet, clasped hands, and bowed deeply to Zhixiang and the two old women. “Many thanks to you.”\u003c/p\u003e\n\u003cp\u003e“There’s no need to be so polite,” replied Zhixiang. “We were simply repaying you for the favor from that year.” The two old women merely looked deeply at Meng Hao.\u003c/p\u003e\n\u003cp\u003eZhixiang smiled. Seeing that Meng Hao wished to depart, she waved her hand, causing a spinning vortex to appear behind him. Within the vortex could be seen the mountain range in the outside world.\u003c/p\u003e\n\u003cp\u003e“Regardless, I will remember what you have done for me this day,” said Meng Hao. He bowed again, then gave Zhixiang one final look. Zhixiang couldn’t prevent her heart from quivering a bit as she recalled everything that had happened back in the ancient Demon Immortal Sect.\u003c/p\u003e\n\u003cp\u003eMeng Hao turned and walked toward the portal.\u003c/p\u003e\n\u003cp\u003e“I heard you got married. Is it true?” asked Zhixiang.\u003c/p\u003e\n\u003cp\u003eMeng Hao stopped walking.\u003c/p\u003e\n\u003cp\u003e“It’s true.”\u003c/p\u003e\n\u003cp\u003e“Congratulations,” Zhixiang said with the same calm smile as ever. “Oh, there’s one other bit of news that I wanted to tell you. It won’t be long now before something big happens in the Ninth Mountain and Sea. The Three Great Daoist Societies will be hosting a disciple recruitment event, which will be supported by the Five Great Holy Lands, and the Three Churches and Six Sects!\u003c/p\u003e\n\u003cp\u003e“This sort of thing happens every so often, and when the time comes, any cultivator in the Ninth Mountain and Sea who is above the Nascent Soul stage and below the Immortal Realm may participate.\u003c/p\u003e\n\u003cp\u003e“Some people do it in the hopes of joining a sect. Others do it for the precious treasures that are prepared as rewards for the momentous occasion!”\u003c/p\u003e\n\u003cp\u003eMeng Hao’s eyes filled with a look of concentration. After a moment of thought, he nodded his head and then walked into the vortex, whereupon he vanished.\u003c/p\u003e\n\u003cp\u003eSilence reigned inside the Demon Loach. The two old women’s eyes flickered as they exchanged a hesitant glance.\u003c/p\u003e\n\u003cp\u003e“He did me a great favor,” said Zhixiang calmly.\u003c/p\u003e\n\u003cp\u003eThe two old women nodded.\u003c/p\u003e\n\u003cp\u003e“Oh well. He appeared to be injured, but he is obviously as cautious as ever. A Chosen like him would definitely have other tricks up his sleeve.\u003c/p\u003e\n\u003cp\u003e“Besides, after he woke up, he appeared to be confident in having someone to back him. Now that I think about it, that makes sense, especially considering he was able to get into the Immortal Ancient Daoist Rite Temple before everyone else.”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eMeng Hao left the Demon Loach via the vortex, emerging beneath an evening sky. A tongue of flame appeared in the bronze lamp above his head, which caused Meng Hao to breathe a sigh of relief.\u003c/p\u003e\n\u003cp\u003eThe lamp was still unextinguished, and if Meng Hao’s calculations were correct, there were only four more days left of the 49 day period.\u003c/p\u003e\n\u003cp\u003e“Four days….” he thought, a cold gleam appearing in his eyes.\u003c/p\u003e\n\u003cp\u003e“In four days, the good fortune of the bronze lamp will be completed. When that happens, I won’t have anything holding me back from making all of these people pay the price for coming here!” He snorted coldly and then disappeared as he flashed off into the distance.\u003c/p\u003e\n\u003cp\u003eThe first thing he did was find a suitable place to act as a hidden Immortal’s cave. He sat down cross-legged to meditate and wait for time to pass.\u003c/p\u003e\n\u003cp\u003eAs the days went by, the situation in the outside world reached a frenzy. In the boundless mountain range, numerous Chosen and Dao Protectors had spread out in all directions in their search for Meng Hao.\u003c/p\u003e\n\u003cp\u003eThey had set up sealing spells all over the mountains to ensure that Meng Hao couldn’t flee. They literally did everything in their power to find traces of him.\u003c/p\u003e\n\u003cp\u003eThe battle that had resulted from the ambush made it so that none of his pursuers looked down on him any more. In fact, to them, he was now viewed as the cream of the crop when it came to the Chosen.\u003c/p\u003e\n\u003cp\u003eAfter all, any other Chosen who ended up trapped in an ambush like he had been, would surely have been killed!\u003c/p\u003e\n\u003cp\u003eIn contrast, Meng Hao had seriously injured Zhao Yifan, severed Fan Dong’er’s limb, and severely hurt a Dao Protector. During the process, he himself had been seriously injured, and yet had managed to escape from the ambush.\u003c/p\u003e\n\u003cp\u003eAlthough quite a few people could tell that he had received aid in the end, his reputation was still rapidly growing!\u003c/p\u003e\n\u003cp\u003eOne could imagine how, after all these people left Planet South Heaven, they would spread word of Meng Hao’s escapades throughout the Ninth Mountain and Sea!\u003c/p\u003e\n\u003cp\u003eHe had suppressed Taiyang Zi, sealed Song Luodan, captured Li Ling’er and crushed Sun Hai and Fang Yunyi.\u003c/p\u003e\n\u003cp\u003eBecause of him, Fan Dong’er was transformed from being a Goddess into a woman haunted by a ghost, and had also lost a limb. Zhao Yifan was seriously injured, and had retreated from battle. He had injured a Dao Protector, and evaded the search of roughly a thousand people for days. All of that… was enough to leave any Chosen completely shaken.\u003c/p\u003e\n\u003cp\u003eAs of this point, Meng Hao’s tempering was complete.\u003c/p\u003e\n\u003cp\u003eAnd yet… he wasn’t satisfied!\u003c/p\u003e\n\u003cp\u003e“The end is almost here!”\u003c/p\u003e\n\u003cp\u003eThe four day period was over. As the search continued in the outside world, Meng Hao’s eyes opened, and were filled with anticipation regarding the bronze lamp.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChapter 825: Zhixiang Pays Her Debt!\u003c/strong\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-824\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-826\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-825","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
