{"id":53174,"no":849,"title":"Chapter 845: Rising Star!","content":"\u003cp\u003e\u003cstrong\u003eChapter 845: Rising Star!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs of this moment, all eyes were on Meng Hao!\u003c/p\u003e\n\u003cp\u003eIt wasn’t just the people watching in the outside world. The remaining cultivators on the Ancient Road of Dao Seeking couldn’t help but look over at Meng Hao. Although everyone was separated by large distances, within the void of the Ancient Road of Dao Seeking he was the only one who had been able to clear out everyone within 30,000 meters. The sight was enough to shock everyone.\u003c/p\u003e\n\u003cp\u003eEven the person who had previously been in first place, the masked young man, had only been able to clear an area around 20,000 meters wide to call his own.\u003c/p\u003e\n\u003cp\u003eAs of now, the high-level members of the Three Sects and Six Churches, the Five Great Holy Lands, and even the Four Great Clans, were all inwardly shaken. Their eyes glittered brightly, and many voices could be heard.\u003c/p\u003e\n\u003cp\u003e“Use any means necessary to send that man a message. Whatever his requirements are, get him to join the Burning Incense Stick Society!”\u003c/p\u003e\n\u003cp\u003e“Getting first in the rankings during the first stage doesn’t say too much. There are quite a few more stages to go, so there will certainly be others who rise to prominence. I’m afraid the person who came in second place won’t be shown much interest at the moment. However… the first place winner, even if he doesn’t do well in the following stages, showed such amazing strength in the first stage that we, the Church of the Emperor Immortal, must have him as a disciple! Send word down immediately!”\u003c/p\u003e\n\u003cp\u003e“His battle prowess is astonishing, and his temperament ruthless. A person like that is perfectly suitable to join us in the Church of the Blood Orchid!!”\u003c/p\u003e\n\u003cp\u003eQuite a few of the powers who made up the Three Churches and Six Sects were instantly attracted to Meng Hao because of his flashy display of power.\u003c/p\u003e\n\u003cp\u003eAs for the Five Great Holy Lands, the Four Great Clans, and the Three Great Daoist Societies, although they were astonished, none made any such proclamations. However, they definitely looked at him differently than the others.\u003c/p\u003e\n\u003cp\u003eAlso watching the Ancient Roads on the vortex screens were Meng Hao’s parents. They were in the Fang Clan in the vast Eastern Lands, looking up at the spectacle. Meng Hao might have changed appearances, but Fang Xiufeng and Meng Li could still recognize him instantly.\u003c/p\u003e\n\u003cp\u003eWhen they saw that he had taken first place in the first stage, both of them smiled. They were smiles filled with pride and anticipation. Of course, Meng Hao’s mother’s smile also contained a bit of concern. However, she knew that Meng Hao’s path… was his own to tread.\u003c/p\u003e\n\u003cp\u003eIn the Kunlun Society, Grandmaster Pill Demon was watching the Dao Seeking vortex screen. Although nobody else might recognize Meng Hao, how could Pill Demon not be able to identify that person who had once been called Fang Mu?\u003c/p\u003e\n\u003cp\u003eChu Yuyan stood next to Pill Demon, looking on silently. There were emotions in her heart which she would never be able or even willing to forget. After all this time, she had grown used to watching Meng Hao from a distance.\u003c/p\u003e\n\u003cp\u003eShe was Pill Demon’s apprentice, but in the Kunlun Society, Pill Demon had been directly accepted as Daoist Kunlun’s apprentice, and had instantly become a blazing sun. Because of that, Chu Yuyan also had a unique position. It only took a short time for her to become acquainted with many of the Chosen there. Furthermore, because of her incredible beauty, countless Kunlun Society disciples began to pursue her.\u003c/p\u003e\n\u003cp\u003eHer worldview was now completely different. There was no sky above her head now, but rather, stars. What she saw when she looked around were not towering mountains, but rather, a sea of heavenly bodies.\u003c/p\u003e\n\u003cp\u003eDespite all of that, though, the memories of everything that had happened on Planet South Heaven were etched deep into her soul.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe first stage was over. Vast numbers of competitors had been eliminated from the Ancient Roads of the Nascent Soul, Spirit Severing, and Dao Seeking. Those who had made it through now waited for the second stage, exhausted and anxious.\u003c/p\u003e\n\u003cp\u003eNext, archaic voices spoke out in the three different Ancient Roads. The words spoken were different, but the meaning was the same, as the voice notified everyone that the first stage was over, and at the same time… announced how many steps each competitor would be able to take!\u003c/p\u003e\n\u003cp\u003e“Those who extinguished fifty candles or less in the first stage may go forward 3,000 paces! One hundred candles or less, 5,000 paces!\u003c/p\u003e\n\u003cp\u003e“Two hundred candles or less, 7,000 paces. Three hundred candles or less, 9,000 paces… Five hundred candles, 10,000 paces!” For the first time, Ling Yunzi of the Nine Seas God World appeared personally in the Ancient Road of Dao Seeking. He was thin, and wore a long green robe. He had white eyebrows, and a blue mark could be seen on his forehead that seemed to contain an entire ocean!\u003c/p\u003e\n\u003cp\u003eHe stood there, his aura pulsing with monstrous power, as if he himself were made of a sea of stars!\u003c/p\u003e\n\u003cp\u003eShockingly, the illusory image of a nine-headed sea dragon could be seen behind him. Although it was illusory, when Meng Hao looked at it, he felt as if he were looking at some celestial force.\u003c/p\u003e\n\u003cp\u003eLing Yunzi could be considered one of the top most powerful experts in the whole Ninth Mountain and Sea!\u003c/p\u003e\n\u003cp\u003eHis eyes swept the area, lingering for a moment on Meng Hao.\u003c/p\u003e\n\u003cp\u003eAfter he finished speaking, Ling Yunzi waved his sleeve, causing everyone in the Ancient Road of Dao Seeking to disappear as they moved forward beyond their own control, traveling an exact amount of steps in accord with the explanation that had just been provided.\u003c/p\u003e\n\u003cp\u003eStep by step, they advanced, encountering no candles or platforms along their way. They floated through the void until they reached a stretch of endless ruins. The crumbled remains of buildings could be seen, as well as ancient statues, dried up forests, rivers, and mountain ranges.\u003c/p\u003e\n\u003cp\u003eThey were now in… the Ninth Mountain and Sea’s Ruins of Immortality.\u003c/p\u003e\n\u003cp\u003eThe void they had just been in was simply the entrance!\u003c/p\u003e\n\u003cp\u003eThe only words that could be used to describe this area were: lifeless, archaic, ancient, mysterious, silent, and enormous!\u003c/p\u003e\n\u003cp\u003eThose were the six words that floated in the minds of all the competitors as they laid eyes on the Ruins of Immortality for the first time. The last word was actually the most prominent feeling that they experienced.\u003c/p\u003e\n\u003cp\u003eIt was almost impossible to tell that this was a road of any sort. The one thing that stood out were the countless altars that stretched off in a line off into the distance. They seemed to be filled with an air of time, an ancientness. They were carved with complex magical symbols that were impossible for anyone to understand. The altars further off in the distance were covered even more thickly with magical symbols than the nearer ones, and gave off an air of incredible mystery.\u003c/p\u003e\n\u003cp\u003eIf you had to call this place a road, then perhaps… the way the altars stretched out made the shape of that road visible.\u003c/p\u003e\n\u003cp\u003eIt was impossible to tell how many altars there were; they extended out endlessly off into the distance.\u003c/p\u003e\n\u003cp\u003eUpon first glance, the altars didn’t seem very big. However… they were actually incredibly enormous. In fact, the smallest of them were about thirty percent of the size of the entire void they had just been in.\u003c/p\u003e\n\u003cp\u003eEach and every one of the altars was simply gargantuan!\u003c/p\u003e\n\u003cp\u003eFrom this, it can be imagined how shocking the Ruins of Immortality were. From the feeling Meng Hao got, it was as if this place had not been constructed for use by cultivators, but rather, but some enormous race of giants.\u003c/p\u003e\n\u003cp\u003eBut then, he suddenly changed his mind as he thought back to… what he had seen in the Immortal Ancient Daoist Rite Temple in the mountains in the Eastern Lands. In his vision, he had seen many things that seemed to indicate that many such things existed ancient times. Perhaps giants and cultivators were actually one and the same.\u003c/p\u003e\n\u003cp\u003eThe group that stopped at 3,000 paces was relatively small. They all ended up on one of the altars, and there was no crowding whatsoever. The largest group was made up of those who could go 5,000 paces. Despite the large number of people, each person still had a large area to call their own on that particular altar.\u003c/p\u003e\n\u003cp\u003eNext were those who could move 7,000 paces. There were fewer in that group, and they quickly spread out across the altar, eyeing each other.\u003c/p\u003e\n\u003cp\u003eWhen it came to 9,000 paces, there was only the masked young man and the person who could change his age. Currently, he had changed from being an old man to being young. He and the masked youth shared one enormous altar.\u003c/p\u003e\n\u003cp\u003eAs for Meng Hao, he was the last person to come to a stop, in the lead position. He was the only person to occupy an entire altar all by himself!\u003c/p\u003e\n\u003cp\u003eSimilar scenes were playing out on the Ancient Roads of the Nascent Soul and Spirit Severing.\u003c/p\u003e\n\u003cp\u003e“The second stage, is the stage of killing!” said Ling Yunzi, his voice cold.\u003c/p\u003e\n\u003cp\u003e“The first stage was a test of your ability to engage in magical combat. Cultivators practice cultivation to be able to fight. We fight people, we fight the Heavens, we fight Earth. Only by fighting can we hew out a Heaven-defying destiny!\u003c/p\u003e\n\u003cp\u003e“This second stage of killing tests exactly how powerful you are in the Dao Seeking stage!\u003c/p\u003e\n\u003cp\u003e“This stage seems similar to the first stage, but is actually very different. In the first stage, you all fought different opponents. Some were weak and some were strong. There was no way to objectively determine exactly how powerful you are.\u003c/p\u003e\n\u003cp\u003e“In the second stage, you will all be fighting exactly the same enemy!\u003c/p\u003e\n\u003cp\u003e“To us cultivators, the Dao is of utmost importance. Our magics are prepared to protect our Daos. Without sufficient magic, how can we achieve our Dao? Therefore, all of you must unleash all the power you can in this second stage!\u003c/p\u003e\n\u003cp\u003e“In this stage, the time limit will again be set at one incense stick. This test is not regarding the number of fatalities you can inflict, but rather… how fast you can kill!\u003c/p\u003e\n\u003cp\u003e“Kill everything that you see. Anyone who cannot complete the task in the time it takes one incense stick to burn will be eliminated. In this second stage, your lives will be at risk. If you wish, you may turn and leave of your own volition right now!” Ling Yunzi’s eyes swept across the crowd, but no one chose to withdraw. His expression cold, he swished his sleeve, and immediately, the magical symbols on the altars began to shine brightly. Rumbling filled the air, and brilliant light swirled everywhere.\u003c/p\u003e\n\u003cp\u003eThe light quickly spread out to cover the entirety of each altar, completely enveloping each and every person.\u003c/p\u003e\n\u003cp\u003e1,000 paces behind Meng Hao, the masked young man stood there, staring at Meng Hao as the light enveloped him. His eyes shone with a fierce gleam as he watched Meng Hao disappearing.\u003c/p\u003e\n\u003cp\u003e“You won the first stage, but the second stage will not belong to you!”\u003c/p\u003e\n\u003cp\u003eThe old man with the age-changing ability was now a teenager, and his eyes shone with a similar light.\u003c/p\u003e\n\u003cp\u003eBehind them were all the other contenders who had earned top marks in the first stage. Each one was looking at Meng Hao’s disappearing figure, their eyes filled with stubborn gleams.\u003c/p\u003e\n\u003cp\u003e“Earlier, he obviously used some trick at the last minute. This time… he’ll be forced to show his true colors!”\u003c/p\u003e\n\u003cp\u003eAt the same time, on the Ancient Roads of the Nascent Soul and Spirit Severing, everyone was also being covered up by the brilliant light. Soon no one was visible at all, and the only thing that could be seen within the glowing light was a list of names.\u003c/p\u003e\n\u003cp\u003eAfter each name was a number that indicated how many fatalities they had inflicted.\u003c/p\u003e\n\u003cp\u003eBack on Meng Hao’s altar, a cold voice suddenly rang out in his ear asking his name. Meng Hao’s face flickered slightly, and after muttering to himself for a moment, he responded with “Fang Mu.”\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, the characters Fang Mu 方木 appeared in the altar’s light. Immediately, everyone in the Ninth Mountain and Sea could see it.\u003c/p\u003e\n\u003cp\u003e“His name is Fang Mu!!”\u003c/p\u003e\n\u003cp\u003e“Could it be possible that he’s connected to the Fang Clan? Although, there are tons of people surnamed Fang who aren’t connected to the Fang Clan.”\u003c/p\u003e\n\u003cp\u003e“Fang Mu. Fang Mu…. He got first place in the first stage, I wonder how he’ll perform in the second stage….”\u003c/p\u003e\n\u003cp\u003e“Don’t think too much of it. There’s no way somebody could take first place in the first stage and then again in the second stage. I suspect that he used some sort of forbidden Daoist Magic at the very last minute. Otherwise, he would never have come to the fore in the first stage. That’s why he suddenly jumped into the spotlight at the last minute.”\u003c/p\u003e\n\u003cp\u003e“Be that as it may, if he takes first place again, it would be totally Heaven-defying. The sects would be thrown into an uproar!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-844\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-846\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-845","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
