{"id":53200,"no":875,"title":"Chapter 871: Invincible Power!","content":"\u003cp\u003e\u003cstrong\u003eChapter 871: Invincible Power!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe arena matches continued as the top 32 continued to fight. The dangers of the outside world had now become a sort of a tempering and assessment of their own.\u003c/p\u003e\n\u003cp\u003eBecause the young woman from the Five Colors Sect conceded, Meng Hao was the first to complete this round, and he sat there cross-legged in the arena, looking at the half-headed man outside. The man looked back at him.\u003c/p\u003e\n\u003cp\u003eAlthough there was a vast gap of empty space between them, as they looked at each other, Meng Hao could sense the feeling of a summons rising up within him.\u003c/p\u003e\n\u003cp\u003e“If I get the chance, I WILL take back that sword!” Meng Hao’s eyes flickered. Although the sword might not seem special to anyone else, to Meng Hao, it had the Sixth Demon Sealing Hex!\u003c/p\u003e\n\u003cp\u003eEach of the eight Demon Sealing Hexes were strange and mysterious. Both the Body Hexing and Karmic Hexing gave him superiority in flexibility when it came to fighting, and basically prevented anyone from guarding against his attacks.\u003c/p\u003e\n\u003cp\u003eAfter four hours passed, the various arena matches wound to a conclusion. The top 16 were now set. From over a thousand cultivators, successive victories had led these people into the top 16. Each and every one could be considered a peak expert of the Spirit Realm.\u003c/p\u003e\n\u003cp\u003eExperts like this could crush false Immortals, and could even compare to some extent to true Immortals. In fact, most of them would assuredly employ an Immortality Illumination Vine in the near future, after which it wouldn’t be long before they became true Immortals.\u003c/p\u003e\n\u003cp\u003eTheir path to Immortality would be a smooth one, and given their accumulated resources, it would only be a few short years before they were at the peak of the Immortal Realm.\u003c/p\u003e\n\u003cp\u003eThis sequence of events happened once every ten thousand years; since every true Immortal could cultivate at a speed that far exceeded a false Immortal, true Immortals always rose to prominence and became famous in all the Mountains and Seas.\u003c/p\u003e\n\u003cp\u003eWere it not for the incredible prizes being offered up during the arena matches, the various sects would not have sent their Chosen here, but would have kept them in secluded meditation to prepare for true Immortality.\u003c/p\u003e\n\u003cp\u003eActually, one of the reasons even more Chosen hadn’t joined the arena matches was that most of them were still in secluded meditation. Once they emerged, as long as they didn’t fail in the process, they would be true Immortals.\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath, rose to his feet and looked around at the top 16 competitors in the arena matches.\u003c/p\u003e\n\u003cp\u003eZhao Yifan was among them, as was Fan Dong’er. Sun Hai, surprisingly, was there too, as well as some of the other Chosen who Meng Hao had previously taken note of. As far as competitors from the trial by fire, Li Yan had been defeated, as had the young man with the mosquitoes and Junior Blood Immortal. Other than Meng Hao, the only remaining competitor from the trial by fire was the garrulous old man.\u003c/p\u003e\n\u003cp\u003eTop 16!\u003c/p\u003e\n\u003cp\u003e“Rest and recuperate for one day, and then the battle for the top 8 will begin!”\u003c/p\u003e\n\u003cp\u003eThe next day, the battle for the top 8 began!\u003c/p\u003e\n\u003cp\u003eOn the main trunk of the Dao Tree, at the very top, there was a single golden leaf. Beneath that were two silver leaves, further down were four bronze leaves, and beneath that were eight light green leaves.\u003c/p\u003e\n\u003cp\u003eThe battles for the top 8 would be fought on those eight light green leaves!\u003c/p\u003e\n\u003cp\u003eEight battles, fought simultaneously. All of the crowds in the Ninth Mountain and Sea were paying rapt attention.\u003c/p\u003e\n\u003cp\u003e“The top 8 will be selected from these sixteen people! Each one is a top expert of the Dao Seeking stage. This round is definitely going to be spectacular!”\u003c/p\u003e\n\u003cp\u003e“I wonder who exactly is going to win! Who’s going to be eliminated!? Even the top 16 experts have no way of knowing!”\u003c/p\u003e\n\u003cp\u003e“The thing I’m most curious about is whether that Fang Mu will be able to enter the top 8!”\u003c/p\u003e\n\u003cp\u003eIn the starry sky palace, the Patriarchs were also paying close attention.\u003c/p\u003e\n\u003cp\u003eBy this point, many people had already forgotten about the main reason why the arena matches of the trial by fire were being held to begin with. Whoever took first place would have a chance to be taken in by the Three Great Daoist Sects as a disciple. The three Patriarchs from the Three Great Daoist Societies did nothing to remind anyone of this.\u003c/p\u003e\n\u003cp\u003eIt was almost as if the taking of disciples wasn’t very important at all.\u003c/p\u003e\n\u003cp\u003eLight glittered in front of Meng Hao and next, he was standing on a light green leaf. In front of him, a thin, emaciated figure appeared.\u003c/p\u003e\n\u003cp\u003eAlthough he was skinny, amorphous flames spread out around him as he walked forward. They were invisible, but Meng Hao could feel them, as if what was walking toward him was not a cultivator, but a flame Devil!\u003c/p\u003e\n\u003cp\u003eWithin his eyes, flames could be seen flickering. He wore a long black robe, and his hair floated around him. He stood there, his energy surging, growing more and more powerful. In the blink of an eye, the air around him began to ripple and distort.\u003c/p\u003e\n\u003cp\u003eThis was the Chosen from the Bones of the Flamedevil, one of the Five Holy Lands… Chen Hao!\u003c/p\u003e\n\u003cp\u003eBack in the ten stages of the trial by fire, the masked Li Yan had repeatedly performed just behind Meng Hao. He had been defeated by Chen Hao, although he had ended up seriously wounding Chen Hao in the process.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at him calmly, and Chen Hao looked back at him.\u003c/p\u003e\n\u003cp\u003eNeither of them spoke. The flames in Chen Hao’s eyes burned bright, and the air around him distorted as the invisible flames burned. The flames seemed capable of scorching anything and everything as they shot toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eNo observer could see the fire, but by using divine sense, Meng Hao was able to sense them clearly. What he saw was an illusory body of flames rushing toward him.\u003c/p\u003e\n\u003cp\u003e“This is not the fire of the five elements!” Meng Hao thought, his eyes glittering. The fire of the five elements was a natural law of Heaven and Earth. In fact, the fire wielded by the young woman from the Five Colors Sect had contained that natural law. However, the flames unleashed by Chen Hao from the Bones of the Flamedevil had no natural law, but instead, a strange will!\u003c/p\u003e\n\u003cp\u003eAfter examining it closely for a moment, he realized that it seemed to be bound by some sort of summoning contract, as if… some all-powerful being had bestowed the power of the flames. It was as if this flame was actually a type of life force flame.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was normal as he clenched his right hand into a fist. As soon as he punched out, a vortex appeared, which sent ripples spreading out. Explosive rumbling could be heard as it slammed into the flames, and was then completely submerged by them.\u003c/p\u003e\n\u003cp\u003e“Eee?” said Meng Hao, falling back for the first time. Chen Hao’s eyes overflowed with the desire to fight, and as Meng Hao retreated, he advanced, performing an incantation gesture that caused more roaring flames to appear around him. Shockingly, they transformed into the shape of an enormous mouth that bit toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe sight of Meng Hao retreating caused quite a stir in the outside world. This was the first time they had ever seen him back up in a fight.\u003c/p\u003e\n\u003cp\u003eHowever, as the flame mouth closed in on him, Meng Hao stopped in place and set his jaw. A look of anticipation gleamed in his eyes as he performed an incantation gesture. Then, he punched out repeatedly, using the Nine Heavens Destruction once again.\u003c/p\u003e\n\u003cp\u003eBooms rattled out in all directions as Meng Hao then transformed into a vulture that shot toward Chen Hao like black lightning. Chen Hao’s face fell, and he performed an incantation gesture. Immediately, a set of flaming armor appeared around him. He reached out with his right hand in a grasping motion, causing an enormous flame spear to materialize. His hands closed around it, and he stabbed it toward the incoming Meng Hao.\u003c/p\u003e\n\u003cp\u003eThe scream of the spear was ear-splitting, and countless erupting volcanos appeared around it as it shot toward Meng Hao in shocking fashion.\u003c/p\u003e\n\u003cp\u003eMeng Hao snorted coldly as mountains of his own appeared and linked together into an equally shocking mountain range, although it appeared as a huge river to onlookers. It slammed into the volcanoes, causing a huge boom to rise into the air. It was at this point that Meng Hao’s shocking Dharma Idol appeared behind him.\u003c/p\u003e\n\u003cp\u003eIn that instant, Chen Hao tilted his back and roared. His own incredible Dharma Idol appeared, a corpse which was covered in scales and emanated black flames. It immediately began to contend with Meng Hao’s Dharma Idol.\u003c/p\u003e\n\u003cp\u003eWhen the Dharma Idols collided, Meng Hao employed the Star Plucking Magic. An incredible force that Chen Hao could not resist suddenly grabbed him, causing a sense of crisis to well up inside of him. Letting out a bellow of rage, Chen Hao caused his suit of flame armor to detonate, using the force of the mighty explosion to fight against Meng Hao’s Star Plucking Magic.\u003c/p\u003e\n\u003cp\u003eChen Hao’s face was ashen, and blood oozed out of the corners of his mouth. As of this point, he knew that he wasn’t a match for Meng Hao, and yet he chose to continue fighting anyway.\u003c/p\u003e\n\u003cp\u003eHowever, in the instant that his flame armor exploded, Meng Hao’s eyes began to shine with an intense desire to do battle. He strode forward; even the roaring flames could do nothing to prevent his charge. As he passed through the sea of flames, he let out a huge roar.\u003c/p\u003e\n\u003cp\u003eThe roar caused the entire leaf to tremble, and even passed outside of the Dao Tree itself. At the same time, his roar caused an enormous wind to spring up, slashing into the sea of flames and cutting a path through them directly to Chen Hao.\u003c/p\u003e\n\u003cp\u003eChen Hao’s face fell as he realized how powerful this Fang Mu was. It was only at this decisive moment of the battle that he realized that his opponent was completely terrifying. Magical techniques and divine abilities were secondary; the critical factor was his incredible energy.\u003c/p\u003e\n\u003cp\u003e“He has an aura of invincibility about him!” thought Chen Hao, madness glowing in his eyes. He bit his tongue and spit out some blood, which then transformed into lava, and then exploded into meteors that streaked through the air toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao snorted coldly, then pointed out with his right finger as he unleashed the Eighth Demon Sealing Hex onto the sea of flames and the shooting stars. No outsider would be able to tell what was happening, but Chen Hao’s face instantly fell as his cultivation base lurched to a standstill.\u003c/p\u003e\n\u003cp\u003eThe cost of that standstill was…\u003c/p\u003e\n\u003cp\u003eMeng Hao closed in, causing all of the shooting stars and the entire sea of flames to be sent spinning away. As Meng Hao bore down on Chen Hao, he punched out. A boom rang out as blood sprayed from Chen Hao’s mouth. It only took a moment for him to recover, after which a fierce flame appeared in his eyes. Taking advantage of his backward motion, he spun his right leg around rapidly toward Meng Hao’s head.\u003c/p\u003e\n\u003cp\u003eAt the same time, a look of determination appeared in his eyes.\u003c/p\u003e\n\u003cp\u003e“Flamedevil Transformation!” he cried out\u003c/p\u003e\n\u003cp\u003eThis battle was the complete focus of all eyes out in the Ninth Mountain and Sea. As of now, they were beginning to see how invincible Meng Hao’s power was. As for Chen Hao, he also possessed similar power. As they battled, neither of them spent any time on defense, but instead, consistently attacked!\u003c/p\u003e\n\u003cp\u003eMeng Hao did nothing to evade Chen Hao’s spinning back kick. He lifted his left hand and grabbed down hard onto Chen Hao’s leg, sending a massive power of vibration into it. Rumbling could be heard, and Chen Hao coughed up some blood. However, by this time his entire body was turning red!\u003c/p\u003e\n\u003cp\u003eThis red was not the red of blood, but rather, the red of flames!\u003c/p\u003e\n\u003cp\u003eIt was as if all the blood in his body had turned into lava. Flames burst out all around him, engulfing him entirely. His skin didn’t seem capable of bearing the flames, and began to split apart all over. Soon, the rips and tears covered him completely.\u003c/p\u003e\n\u003cp\u003eHowever, his energy exploded up, and despite the fact that Meng Hao was holding onto his leg tightly, he let out a bellow and caused flames to surge toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was calm as he released his hand, then kicked out viciously with his foot. A boom could be heard as Chen Hao was sent flying several dozen meters back.\u003c/p\u003e\n\u003cp\u003e“Body transformation magic, huh?” said Meng Hao coolly. “Well, I’ll just have to beat you back into your original state.” He suddenly transformed into the vulture, which shot forward at incredible speed. In the blink of an eye, it appeared in front of Chen Hao and slashed at him with its claws. Then Meng Hao returned to human form and punched out with a fist.\u003c/p\u003e\n\u003cp\u003eBOOOMMMM! After changing forms, Chen Hao thought that he would be even more powerful, capable of fighting Meng Hao. However, he never imagined that a few punches from Meng Hao would slam into him like wild tempests. The speed and power were incredible, and he was incapable of standing up to it. Just when he was about to try to resist, Meng Hao’s divine sense transformed into an incredible crushing power that slammed down onto him.\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-870\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-872\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-871","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
