{"id":53252,"no":927,"title":"Chapter 923: Meng Hao Concocts Pills!","content":"\u003cp\u003e\u003cstrong\u003eChapter 923: Meng Hao Concocts Pills!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMany of the apprentice alchemists in the outer mountains were listening to various alchemists giving lectures about plants and vegetation. When the drum echoed out, all of the apprentice alchemists lifted their heads up in shock. When they realized that the sound of the drum came from the Pill Pavilion, their faces flickered.\u003c/p\u003e\n\u003cp\u003e“That’s the sound of the drum from the Pill Pavilion! Someone’s trying to concoct one of the three legendary medical pills from the Dao of Alchemy Division!!”\u003c/p\u003e\n\u003cp\u003e“The simplest of them all requires a fee of 1,000,000 merit points! Unless you successfully concoct the pill, those merit points are wasted!”\u003c/p\u003e\n\u003cp\u003e“Who is it, I wonder?”\u003c/p\u003e\n\u003cp\u003eThe apprentice alchemists in the outer mountains weren’t the only ones to have such a reaction. The alchemists in the inner mountains also heard the sound of the drum, and their faces filled with shock. There were some who even subconsciously sneered.\u003c/p\u003e\n\u003cp\u003e“Nobody has tried to concoct one of those pills for years. I wonder which alchemist is going to try.”\u003c/p\u003e\n\u003cp\u003e“1,000,000 merit points is such a waste. It’s a real pity. Although, things like this only happen every so often, so I definitely need to go watch.”\u003c/p\u003e\n\u003cp\u003eMany alchemists flew up from the inner mountains. There were even many alchemists who rarely made public appearances, but still flew toward the Pill Pavilion. After all… this was a spectacle that could only be had at the cost of 1,000,000 merit points.\u003c/p\u003e\n\u003cp\u003eThe tier 7 alchemists in the inner mountains flew into the air with glittering eyes. Even the nineteen tier 8 alchemists heard the sound of the drum, and several of them immediately flew toward the Pill Pavilion.\u003c/p\u003e\n\u003cp\u003eIn the very center of the inner mountains, Pill Elder Fang Danyun sat cross-legged on his mountain peak, looking off toward the Pill Pavilion, his eyes shining with a light of curiosity.\u003c/p\u003e\n\u003cp\u003e“So, Fang Hao is finally going to try his hand at pill concocting.”\u003c/p\u003e\n\u003cp\u003eIt took only moments for tens of thousands of people to gather around the Pill Pavilion. Beams of light shot toward it continuously as more and more people arrived. When people saw that it was Meng Hao standing outside the Pill Pavilion, they were shocked.\u003c/p\u003e\n\u003cp\u003e“It’s Fang Hao!”\u003c/p\u003e\n\u003cp\u003e“Now it makes sense that someone could afford so many merit points. It turns out to be him! But… can he concoct pills? Even if he can, does he really dare to take on those legendary pills, a challenge that countless people have failed over the past tens of thousands of years?”\u003c/p\u003e\n\u003cp\u003e“He has too many merit points. You know, I think he’s just flaunting the 1,000,000 merit points to attract the attention of the whole Dao of Alchemy Division, and thus, gain more fame. That’s all.”\u003c/p\u003e\n\u003cp\u003eMeng Hao ignored the crowds that were gathering. As the sound of the drum reverberated out, he held out his identity jade medallion, and 1,000,000 merit points vanished.\u003c/p\u003e\n\u003cp\u003eSimultaneously, the sound of the drum seemed to enter Meng Hao’s body, and suddenly, a pill formula appeared in his mind. The pill formula was extremely mysterious: he could see it clearly, and yet was unable to commit it to memory.\u003c/p\u003e\n\u003cp\u003eIt was also impossible to imprint it onto a jade slip. Apparently, it was protected by some unique restrictive spell. Actually, Meng Hao was not unfamiliar with such a situation; he had experienced similar things in the ancient Demon Immortal Sect.\u003c/p\u003e\n\u003cp\u003e“They want to protect the pill formula, in order to make sure it doesn’t get leaked outside the clan.” His eyes flickered as the head of the drum in front of him suddenly rippled like water, and a set of medicinal plants floated out.\u003c/p\u003e\n\u003cp\u003eIn total, there were thirteen of them.\u003c/p\u003e\n\u003cp\u003eEach medicinal plant could be considered extremely precious. There were five of them that caused a shocking botanical aroma to spread out in all directions as soon as they appeared. Even Meng Hao’s pupils went wide because of that. There were two plants in particular that he found shocking.\u003c/p\u003e\n\u003cp\u003eOne was completely black, with a single delicate flower. It was beautiful, and at a single glance it was obvious that it had an aura of extreme heat circling around it.\u003c/p\u003e\n\u003cp\u003eSurprisingly, the other plant… was a Sun Blossom!\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath. He had thought Sun Blossoms to be virtually extinct in the outside world. He had never imagined that he would run into one here. Unfortunately, when compared to the Sun Blossom he had harvested in the Ruins of Immortality, this Sun Blossom was damaged and incomplete. However, it was still a Sun Blossom.\u003c/p\u003e\n\u003cp\u003e“Considering all of this, those 1,000,000 merit points were actually worth it….” he thought, taking a deep breath. However, he knew that he couldn’t simply take these medicinal plants away; he had to use them here and now to concoct a medicinal pill.\u003c/p\u003e\n\u003cp\u003eMeng Hao sat cross-legged in front of the Pill Pavilion and closed his eyes to analyze the pill formula. Time passed. More and more people arrived, and soon, 500,000 people were crowded around.\u003c/p\u003e\n\u003cp\u003eAll of them stared at Meng Hao. The sight of someone spending 1,000,000 merit points to concoct a pill was a sight that could only be come across serendipitously. And yet, such a scene was playing out right in front of them. Whether or not Meng Hao succeeded, all of the onlookers were happy to be able to watch this rare scene.\u003c/p\u003e\n\u003cp\u003eFour hours later, Meng Hao opened his eyes, and they shone brightly.\u003c/p\u003e\n\u003cp\u003e“This medicinal pill… will not be easy to concoct,” he murmured. “I’ve never come across anything like it before…. It might not be as difficult as concocting something from nothing, but it’s still very challenging. Most importantly, if I fail, the cost will be immense!” He frowned.\u003c/p\u003e\n\u003cp\u003e“The concocting method actually changes depending on the weather and the time of day. Furthermore, it must absorb Yang qi from each of the twelve two-hour periods in the day without interruption. Divine Will then comes into being, and it can become a sun spirit!\u003c/p\u003e\n\u003cp\u003e“However, that’s not all. The first word in the name of the pill, Skypalace, is important. It’s actually referring to that mythical celestial palace which exists beyond the clouds in the sky….”\u003c/p\u003e\n\u003cp\u003eMeng Hao frowned deeply. After a while, he patted his bag of holding to produce a pill furnace. It was pitch black, and a face was just barely visible on its surface, which stared fiercely at Meng Hao.\u003c/p\u003e\n\u003cp\u003eThis was the pill furnace Meng Hao had acquired years ago when he became a Violet Furnace Lord in the Violet Fate Sect. [1. Meng Hao got the black pill furnace in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-3-chapter-281/\"\u003echapter 281\u003c/a\u003e. The furnace initially resisted him, making it impossible for him to use. Later, he handed it over to the meat jelly in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-3-chapter-295/\"\u003echapter 295\u003c/a\u003e. Eventually he forced it to capitulate when he concocted the Perfect Gold Core Pill in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-336/\"\u003echapter 336\u003c/a\u003e. He also used it in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-394/\"\u003echapter 394\u003c/a\u003e, when he was in the Western Desert]\u003c/p\u003e\n\u003cp\u003eHe tapped the pill furnace, and a clear, crisp sound echoed out. The pill furnace shuddered, and the face’s vicious expression suddenly turned into one of fear and respect.\u003c/p\u003e\n\u003cp\u003eWhen the sound of the pill furnace spread out, the apprentice alchemists didn’t think much of it. However, the expressions on the faces of the tier 5 and higher alchemists all changed. No longer did they look at Meng Hao with scorn, but rather, with intense concentration.\u003c/p\u003e\n\u003cp\u003eWhenever masters go to work, the evidence of their foundation can be seen.\u003c/p\u003e\n\u003cp\u003eAll of the tier 5 and higher alchemists could tell that the method with which Meng Hao tapped the pill furnace contained the Dao of alchemy!\u003c/p\u003e\n\u003cp\u003e“All pill furnaces need to be warmed up! Even a pill furnace that has been used millions of times needs to be warmed up before its full power can be unleashed. But Fang Hao simply tapped the furnace… and produced the same result! Ingenious!”\u003c/p\u003e\n\u003cp\u003e“It’s a different technique for warming up the furnace! How domineering! He dispersed the medicinal qi within the furnace, making it easier for the pill to take shape!”\u003c/p\u003e\n\u003cp\u003e“To accomplish something like that requires incredible skill in the Dao of alchemy!”\u003c/p\u003e\n\u003cp\u003eMeng Hao ignored all of the comments from the audience, and focused all of his attention on the medicinal pill he was going to concoct. No matter how he went about it, he had to attempt to the concoct the pill in order to solve his spirit stone quandary.\u003c/p\u003e\n\u003cp\u003e“I’m actually not sure I can do it,” he thought. After reflecting for a moment, he reached out to grab one of the medicinal plants. As he held it there in his hand, it seemed to come to life. All of its impurities dissipated, and it turned transparent, like crystal. Then Meng Hao crushed it and placed it into the pill furnace.\u003c/p\u003e\n\u003cp\u003eThis action also caused the other alchemists to be visibly moved.\u003c/p\u003e\n\u003cp\u003eMeng Hao took a deep breath and looked up into the sky. Then, he placed his left hand onto the pill furnace, causing it to burn, although there was no flame. The medicinal plant instantly began to melt into a liquid.\u003c/p\u003e\n\u003cp\u003eTwo hours later, Meng Hao’s eyes flickered, and he selected another medicinal plant. Soon, 24 hours had passed. Last, he put the Sun Blossom into the mix, and then, he placed both hands onto the pill furnace.\u003c/p\u003e\n\u003cp\u003eEveryone was panting as they watched. During the last day in which they had watched Meng Hao work, they had been able to catch glimpses of his pill concocting techniques. People began to grow more and more shocked at Meng Hao’s proficiency in the Dao of alchemy.\u003c/p\u003e\n\u003cp\u003e“Time to look at this pill!” Meng Hao growled above the rumbling sound that echoed out from within the pill furnace. Suddenly, the pill furnace’s lid popped off, and a medicinal pill flew out.\u003c/p\u003e\n\u003cp\u003eAs soon as it appeared, it radiated incredible light for 300 meters in all directions, causing everyone’s minds to reel, and a collective gasp to ring out.\u003c/p\u003e\n\u003cp\u003e“He succeeded?”\u003c/p\u003e\n\u003cp\u003e“He… actually succeeded?”\u003c/p\u003e\n\u003cp\u003eMeng Hao closed his eyes. Cracking sounds could suddenly be heard from the medicinal pill, and it shattered, transforming into black sediment that appeared to be somewhat toxic. The sediment slowly transformed into wisps of black smoke.\u003c/p\u003e\n\u003cp\u003eFailure.\u003c/p\u003e\n\u003cp\u003eAfter a moment of silence, everyone burst out into conversation. Meng Hao sat there with his eyes closed, thinking. In truth, he had already known that he had failed about halfway through the concocting process.\u003c/p\u003e\n\u003cp\u003eHowever, a failure was exactly what he needed. Based on his skill in the Dao of Alchemy, his analysis of the Skypalace Sunspirit Pill formula told him that there were thousands of different possible concoction methods. Each one seemed as if it would lead to success, and yet simultaneously seemed doomed to lead to failure.\u003c/p\u003e\n\u003cp\u003eAfter an hour, Meng Hao’s eyes suddenly opened. “Based on what I learned from this failure, further analysis now reveals 791 possible concocting methods remaining.”\u003c/p\u003e\n\u003cp\u003eWith that, he extended his hand and struck the drum again. The sound of it echoed out, and 1,000,000 merit points vanished. Once again, thirteen medicinal plants flew out.\u003c/p\u003e\n\u003cp\u003eThe audience saw Meng Hao making another attempt and thought he was crazy. Despite the outrageous amount of merit points he was spending, he had decided to try again.\u003c/p\u003e\n\u003cp\u003e24 hours later, the pill furnace rumbled, and another medicinal pill flew out. This time, it radiated light for 3,000 meters. The pill itself was violet-gold in color, and looked like an inimitable treasure. However, a moment later, cracking sounds could be heard, and it collapsed into wisps of black smoke.\u003c/p\u003e\n\u003cp\u003e“As expected,” Meng Hao thought, “Based on what I learned this time, I’ve narrowed it down to 216 concocting methods!” Without stopping to rest, he hit the drum, paid another 1,000,000 merit points for thirteen more medicinal plants, and started a third concocting effort.\u003c/p\u003e\n\u003cp\u003eThe audience gaped in shock. When they saw him squandering such a vast amount of wealth, even they felt pain in their hearts.\u003c/p\u003e\n\u003cp\u003e“Just how many merit points does he have to squander them so freely? After all these years, nobody has ever successfully concocted that medicinal pill, what makes him think he can?”\u003c/p\u003e\n\u003cp\u003e“If he thinks he has too many merit points, he should just give some of them to me….”\u003c/p\u003e\n\u003cp\u003eAnother 24 hours passed, and rumbling could once again be heard. Meng Hao’s third concoction was a failure.\u003c/p\u003e\n\u003cp\u003eHowever, his expression lacked the slightest bit of dejection, and in fact, his eyes were glowing.\u003c/p\u003e\n\u003cp\u003e“From this third defeat, I’ve now narrowed it down to 17 possible methods that could lead to success!” He struck the drum a fourth time, shocking everyone. Even the tier 6 alchemists thought he was crazy.\u003c/p\u003e\n\u003cp\u003eAfter another 24 hours, four straight days of concocting, he failed again.\u003c/p\u003e\n\u003cp\u003e“From this fourth failure, I have now narrowed down the total possible methods to only 3!” Taking a deep breath, eyes completely bloodshot, he struck the drum again.\u003c/p\u003e\n\u003cp\u003eThe sound reverberated through the air as he began a fifth concoction.\u003c/p\u003e\n\u003cp\u003e24 hours later, a medicinal pill flew out of the furnace, shone with brilliant light, and then collapsed. Meng Hao suddenly shot to his feet.\u003c/p\u003e\n\u003cp\u003e“I understand now!” Eyes shining, he struck the drum a sixth time!\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-922\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-924\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-923","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
