{"id":53308,"no":983,"title":"Chapter 979: An Eruption of Good Fortune!","content":"\u003cp\u003e\u003cstrong\u003eChapter 979: An Eruption of Good Fortune!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Immortal character flew out, piercing through the starry sky, transforming into a spectacularly stunning beam of light.\u003c/p\u003e\n\u003cp\u003eIt looked like an Immortal flying through the sky. In the blink of an eye, it appeared outside of Planet East Victory, next to the Door of Immortality, where it once again materialized into an enormous Immortal character.\u003c/p\u003e\n\u003cp\u003eThe character emanated pressure comparable to that of the Door of Immortality, causing it to tremble as if it were being provoked. Ripples began to spread out as the character trembled and moved toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s mind was spinning as he looked at the huge Immortal character, and his whole body shook. That character looked very familiar... it was just like the character he had seen unleashed by the old man in the visions he had experienced back in the Immortal Ancient Daoist Rite Temple on Planet South Heaven. [1. Meng Hao’s visions in the Immortal Ancient Daoist Rite Temple were in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-807/\"\u003echapters 807\u003c/a\u003e and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-819/\"\u003e819\u003c/a\u003e]\u003c/p\u003e\n\u003cp\u003e“The Immortal Ancient Daoist Rite....” he thought. He gaped in shock as the Immortal character approached him. It rapidly shrank until it was only a few centimeters tall, whereupon it fused into Meng Hao’s forehead.\u003c/p\u003e\n\u003cp\u003eIn that instant, scintillating light filled with a primordial, savage aura exploded from within Meng Hao. Right now, he didn\u0027t even need a scrap of Immortal qi from the Door of Immortality. The Immortal character immediately transformed of its own volition into an Immortal meridian, becoming Meng Hao\u0027s 118th meridian!\u003c/p\u003e\n\u003cp\u003eIn the same moment, the Immortal meridian that had formed from the smoke of the bronze Soul Lamp began to glitter with a strange light, as if it were now reflecting the glory of this new Immortal meridian.\u003c/p\u003e\n\u003cp\u003eRumbling echoed out from within Meng Hao as an 118th Immortal dragon appeared outside of the Door of Immortality, where it roared and swirled through the starry sky. This dragon was completely golden, and seemed to embody everything Immortal. Its roars shook the hearts of everyone who could hear.\u003c/p\u003e\n\u003cp\u003e“That’s... that’s....”\u003c/p\u003e\n\u003cp\u003e“Am I seeing things? Was that actually an Immortal character that just fused with Fang Hao?”\u003c/p\u003e\n\u003cp\u003e“Where did that Immortal character come from?” The Ninth Mountain and Sea was abuzz with shock, and all onlookers were astonished. Only the Dao Realm Patriarchs from the various sects and clans looked with glittering eyes toward the Ninth Mountain.\u003c/p\u003e\n\u003cp\u003eObviously, they weren’t looking toward the Ji Clan, but rather, the other force that was qualified to occupy the Ninth Mountain... one of the Three Great Daoist Societies, the Immortal Ancient Daoist Rite!\u003c/p\u003e\n\u003cp\u003eMeng Hao also looked up in the direction of the Ninth Mountain. Although his cultivation base wasn’t strong enough to allow him to see it, he could still sense it. He knew that the Immortal character did not originate from Planet South Heaven.\u003c/p\u003e\n\u003cp\u003eHe also knew that outside of Planet South Heaven in the Ninth Mountain and Sea, there was another Immortal Ancient Daoist Rite Temple, one that was not in ruins. It was in fact one of the Three Great Daoist Societies!\u003c/p\u003e\n\u003cp\u003eMeng Hao didn\u0027t say anything, but he clasped hands and bowed deeply.\u003c/p\u003e\n\u003cp\u003eIt was a bow full of gratitude. He knew that the Immortal Ancient Daoist Rite had bestowed him with good fortune by opening another Immortal meridian for him. Giving him an Immortal meridian was a type of good fortune that was no simple task. Even with their deep reserves, they had surely paid a heavy price for what they had just done.\u003c/p\u003e\n\u003cp\u003e“Many thanks!” he said softly. His 118 Immortal meridians caused everything to shake, and Meng Hao knew... that everything was now over.\u003c/p\u003e\n\u003cp\u003e118 Immortal meridians was a level that Meng Hao was satisfied with. Now, he wanted to know... after the Door of Immortality closed, exactly how powerful he would be!\u003c/p\u003e\n\u003cp\u003eHowever, there was something Meng Hao wasn\u0027t aware of. Floating in the starry sky outside of Planet East Victory was someone who was feeling very torn at the moment. It was none other than the Fang Clan’s Dao Realm expert, the Earth Patriarch.\u003c/p\u003e\n\u003cp\u003eHe hovered cross-legged, acting as Dharma Protector for Meng Hao, and currently, his eyes were bright red, filled with a look that encompassed both struggle and hesitation.\u003c/p\u003e\n\u003cp\u003e“Damn you, Immortal Ancient Daoist Rite! What the hell do you people think you\u0027re doing, huh?\u003c/p\u003e\n\u003cp\u003e“So you\u0027re blessing the qilin son of the Fang Clan with some good fortune, not out of the kindness of your heart, but to undermine our clan? You think blessing him with some good fortune will fill him with enough gratitude to want to become your disciple?\u003c/p\u003e\n\u003cp\u003e“Dammit, that’s a good thing, but... but if you let everyone in the Ninth Mountain and Sea know, it will definitely cast the Fang Clan in a very bad light! What, you think we don\u0027t have our own Immortal meridians to hand out?” The Patriarch was incensed. It was like there were two rich people, one of whom had a son. Suddenly, another rich person came along and arranged for his own daughter to marry the son, and then loudly announced that he was fulfilling a responsibility of which the young man’s father was incapable.\u003c/p\u003e\n\u003cp\u003eTo a member of the Elder generation of the clan, something like this was like a slap to the face. He was now in a complete rage.\u003c/p\u003e\n\u003cp\u003e“Fudge! Stinking Immortal Ancient Daoist Rite! Our Fang Clan has existed for generations, we can do the same thing!” Enduring the pain of it, the Earth Patriarch gritted his teeth and performed an incantation gesture with his right hand, then pointed down toward Planet East Victory.\u003c/p\u003e\n\u003cp\u003eThat gesture caused Essence power to erupt out. Planet East Victory quaked violently, and even stopped rotating momentarily. At the same time, a drop of blood shot out from the forehead of all of the members of the Fang Clan.\u003c/p\u003e\n\u003cp\u003eThat included the Grand Elder, Fang Xiushan and even Fang Wei. They could exercise absolutely no control over the drop of blood that came out of them.\u003c/p\u003e\n\u003cp\u003e“NO!” cried Fang Wei. His eyes were wide, and his expression was one of fury. Considering the level of his cultivation base, though, how could he possibly resist? He could only watch as the drop of blood emerged and then flew away!\u003c/p\u003e\n\u003cp\u003e“Bloodline Dragon!” the Fang Clan Earth Patriarch roared. All of the drops of blood flew into the air, one for each and every member of the Fang Clan.\u003c/p\u003e\n\u003cp\u003eThere were no exceptions. All of the drops of blood merged together in midair to form a Blood Dragon, which roared as it shot through the air. A drop of blood even emerged from the Earth Patriarch’s forehead, and when it merged into the blood dragon, the dragon burst into flames, causing all of the blood from the Fang Clan to be refined and tempered to the ultimate degree.\u003c/p\u003e\n\u003cp\u003eAfter that, the Fang Clan Patriarch gritted his teeth and then pointed toward the Fang Clan again. The Fang Clan’s Dao bell materialized and tolled loudly. At the same time, an ancient bottle flew out from inside the bell, within which were three drops of blood, one of which flew out into the air.\u003c/p\u003e\n\u003cp\u003eIt was a single, tiny drop, but it caused Heaven and Earth to fill with flashing colors. A huge wind kicked up, and blood-red light shone onto the faces of all observing cultivators.\u003c/p\u003e\n\u003cp\u003e“That’s soul blood from the first generation Patriarch of the Fang Clan!”\u003c/p\u003e\n\u003cp\u003e“Crazy! The Immortal Ancient Daoist Rite pissed off Fang Shoudao so much that he actually pulled out a signature treasure of the Fang Clan! Everybody says that Fang Shoudao has a short temper and is easily provoked. Looks like it’s true!” [1. Fang Shoudao\u0027s name in Chinese is 方守道 fāng shǒu dào. Shou means “protect” or “guard.” Dao is “the Dao,” or also “path” or “way”]\u003c/p\u003e\n\u003cp\u003e“Those three drops of soul blood must have been left behind after the Fang Clan’s first generation Patriarch passed away into meditation. Even Lord Ji would covet that!” The Dao Realm Patriarch from the various sects and clans all looked on with gaping mouths.\u003c/p\u003e\n\u003cp\u003eDeep beneath the surface of the Fang Clan, the six Patriarchs’ minds were spinning.\u003c/p\u003e\n\u003cp\u003e“W-what... w-what is Eldest Brother doing?!”\u003c/p\u003e\n\u003cp\u003eThe Fang Clan’s Earth Patriarch had a vicious look on his face. After a moment of hesitation, he gritted his teeth and then waved his hand through the air. Immediately, the first generation Patriarch’s drop of soul blood shot toward the Bloodline Dragon, and then merged into it.\u003c/p\u003e\n\u003cp\u003eA boom could be heard as the dragon began to seethe again, and then rapidly shrink down to form a blood-colored character!\u003c/p\u003e\n\u003cp\u003eFang 方 !!\u003c/p\u003e\n\u003cp\u003eThis single character emanated a shocking sensation of bloodline power, including that of reincarnation. The power of four lives of reincarnation that pulsed in the blood of the Fang Clan now shook the entire Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eThe Fang character glittered and pulsed with shocking power as it shot toward Meng Hao, who stared with wide eyes at what was happening, but wasn\u0027t completely dazed. He could sense the bloodline aura coming from the character, and it set his own blood a-boil. A sensation of mutual attraction suddenly caused his heart and mind to tremble fiercely.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” he thought. “The Fang Clan is actually helping me?” Meng Hao\u0027s eyes were wide as he watched the blood-colored Fang character bear down on him and then merge into his forehead.\u003c/p\u003e\n\u003cp\u003eRumbling immediately filled his body, and his blood seemed to grow stronger than ever. At the same time, the Fang character caused a Bloodline Dragon to form inside of him.\u003c/p\u003e\n\u003cp\u003eA 119th Immortal meridian formed, stimulated by the soul blood of the first generation Patriarch, with the blood of all members of the Fang Clan as its foundation. Therefore, it did not need any Immortal power from the Door of Immortality.\u003c/p\u003e\n\u003cp\u003eAt the same time, a 119th Immortal dragon appeared next to the Door of Immortality. It emanated the aura of the Fang Clan bloodline, and caused everything in the area to shake violently.\u003c/p\u003e\n\u003cp\u003eMeng Hao could sense his cultivation base growing more powerful, and he could sense his Fang Clan bloodline become even stronger. Although he was not able to test it right now, he was sure that his Bloodline Gatebeam would no longer be 30,000 meters, but even more terrifyingly powerful.\u003c/p\u003e\n\u003cp\u003eApparently, this was the power of Ancestral Awakening!\u003c/p\u003e\n\u003cp\u003eNext, the voice of the Fang Clan’s Earth Patriarch echoed out through the starry sky into Meng Hao’s ears, causing him to gape.\u003c/p\u003e\n\u003cp\u003e“Alright Immortal Ancient Daoist Rite, if you people are so powerful, then bestow another Immortal meridian to my clan’s qilin son! If you do, the Fang Clan will match you!\u003c/p\u003e\n\u003cp\u003e“Come on! We’ll match you one meridian for another!” As soon as the Earth Patriarch\u0027s voice rang out, the Patriarchs of the various sects and clans of the Ninth Mountain and Sea all quieted down. The four old men in the Immortal Ancient Daoist Rite snorted coldly, but didn’t dare to respond.\u003c/p\u003e\n\u003cp\u003eThey... had no more meridians to send.\u003c/p\u003e\n\u003cp\u003eThe Fang Clan Earth Patriarch looked quite proud. Although it hurt him inwardly, and although it seemed like he was acting impulsively, anyone who reached his cultivation level would be able to control their own thoughts. Seeing that there was no response from the Immortal Ancient Daoist Rite, he frowned.\u003c/p\u003e\n\u003cp\u003e“Not gonna send another one?” he thought. “Well, it’s too bad that we couldn’t swindle another meridian out of them. In any case, this kid has reached this point all on his own, plus he doesn’t feel much loyalty to the clan. Therefore, it was necessary to give him that drop of soul blood.”\u003c/p\u003e\n\u003cp\u003eWhen Meng Hao heard the words spoken by the Fang Clan Earth Patriarch, his expression was a bit strange. He looked at the 119th Immortal dragon, then back down at Planet East Victory. Although it wouldn’t be correct to say that his feelings of detachment had completely dissipated, at least he didn\u0027t feel as much of an outsider as before.\u003c/p\u003e\n\u003cp\u003e“119 meridians,” he thought, looking back at the Door of Immortality. It was at this point that a new voice suddenly whispered in his ear, an ancient, archaic voice.\u003c/p\u003e\n\u003cp\u003e“Do you... still remember me?\u003c/p\u003e\n\u003cp\u003e“My name is... Choumen Tai!”\u003c/p\u003e\n\u003cp\u003eWhen Meng Hao heard those two sentences, and that name, his heart seized. He suddenly jerked his head to look out into the stars. What he was looking for seemed to be outside of the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003eFar away on another planet, a middle-aged man sat cross-legged. His eyes slowly opened, and he smiled.\u003c/p\u003e\n\u003cp\u003e“I didn’t perish.... My clone fell onto Planet South Heaven years ago, and left you with Immortal Shows the Way. I told you that when you reached Immortal Ascension, you could use its power to cause a starry sky to descend.\u003c/p\u003e\n\u003cp\u003e\"Today, I’ll give you... a bit of the starry sky of Pāramitā’s world to form an Immortal meridian, and help you to future glory....\u003c/p\u003e\n\u003cp\u003e“Remember, come to Planet Tiger Cage in the Seventh Mountain. I left a little gift for you there.\u003c/p\u003e\n\u003cp\u003e“There’s someone I want to resurrect and... I hope you can help me out with that in the future.... Therefore, I’m going to help you now.”\u003c/p\u003e\n\u003cp\u003eRUMBLE!\u003c/p\u003e\n\u003cp\u003eMeng Hao\u0027s mind spun as he recalled Choumen Tai, the Immortal’s corpse that had fallen from the sky way back when he was a mere Qi Condensation cultivator! [1. Please note that in my original translation of what Choumen Tai said, I misinterpreted some of his explanation of Immortal Shows the Way, but have since gone back and fixed that section. The part where he introduces himself and explains Immortal Shows the Way is in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-3-chapter-301/\"\u003echapter 301\u003c/a\u003e. He made a brief cameo in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-4-chapter-555/\"\u003echapter 555\u003c/a\u003e, when he woke up in the Rebirth Cave. Later, he showed up when Meng Hao went to the Rebirth Cave in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-5-chapter-689/\"\u003echapter 689\u003c/a\u003e and then was kicked off of the planet by Shui Dongliu in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-5-chapter-692/\"\u003echapter 692\u003c/a\u003e. His name was brought up in numerous other chapters, usually when Meng Hao reflected on the things he said]\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-978\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-980\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-979","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
