{"id":53319,"no":994,"title":"Chapter 990: Gods vs. Immortals!","content":"\u003cp\u003e\u003cstrong\u003eChapter 990: Gods vs. Immortals!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMeng Hao glanced over the three. Although he was a little taken aback by the appearance of Wang Tengfei, he still chose to speak in this manner.\u003c/p\u003e\n\u003cp\u003eThe faces of these three newcomers didn\u0027t flicker in the slightest in response to his words. As for Ji Yin, her face wasn\u0027t even visible.\u003c/p\u003e\n\u003cp\u003e“Elder Brother Meng, my master is from the Immortal Ancient Daoist Rite--” said Zhou Shui. He was smiling on the surface, but his heart was as cold as ice. Before he could finish speaking Meng Hao looked directly at him, his expression frigid.\u003c/p\u003e\n\u003cp\u003eHe said nothing further, but instead, advanced. 33 Immortal souls exploded with power, and his 123 meridians rotated, surging with shocking power. Instantly, he was in front of Zhou Shui, launching a punch.\u003c/p\u003e\n\u003cp\u003eZhou Shui’s eyes flickered with coldness as he performed an incantation gesture with his right hand. His energy rose up, causing ripples to spread out as power equivalent to 140 meridians exploded out. His Immortal souls appeared, and at the same time, a spark of flame appeared directly above his head, from within which emanated the sounds of scriptures being chanted. Instantly, Zhou Shui\u0027s aura exceeded that of Zhao Yifan.\u003c/p\u003e\n\u003cp\u003eHe quickly finished his incantation gesture and then formed his hand into a palm, which he thrust out to meet Meng Hao\u0027s blow.\u003c/p\u003e\n\u003cp\u003eA boom could be heard, and Zhou Shui\u0027s face fell as his entire arm vibrated. At the same time, he unleashed the full power of his cultivation base, after which a ripping sound could be heard, and the chanting of the scriptures grew louder.\u003c/p\u003e\n\u003cp\u003e“Nine Cycles Daoist Magic!” As soon as Zhou Shui\u0027s voice rang out, the chanting of scriptures surged, transforming into strange ripples that reduced the power of Meng Hao\u0027s attack, nine times in a row. After the ninth reduction, the attack was easily countered by Zhou Shui\u0027s palm.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was the same as ever as he looked over at Zhou Shui.\u003c/p\u003e\n\u003cp\u003e“Fellow Daoist Meng, is this the full power of the Immortal Realm Paragon\u0027s attack?” he asked coolly. However, deep inside, he was shocked. Seeing what he had just seen, and feeling it personally, left him greatly shaken.\u003c/p\u003e\n\u003cp\u003e“If that’s all you have, then it’s time to see how you like one of my attacks.” With that, rumbling emanated out of his body as... 99 Immortal dragons suddenly appeared around him.\u003c/p\u003e\n\u003cp\u003eThe Immortal dragons roared, causing strange colors to flash in the air, and the Heavens to tremble. This scene caused widespread shock among the cultivators of the Ninth Mountain and Sea.\u003c/p\u003e\n\u003cp\u003e“99 meridians!!”\u003c/p\u003e\n\u003cp\u003e“The Immortal Ancient Daoist Rite has profound resources hidden away! I can’t believe they have a disciple with 99 meridians!!”\u003c/p\u003e\n\u003cp\u003e“That’s only one short of 100. It looks like Zhou Shui isn’t too happy to be fighting Meng Hao. If the Immortal Ancient Daoist Rite had given HIM that meridian, he would have 100 right now!!”\u003c/p\u003e\n\u003cp\u003eZhou Shui’s eyes flickered as the 99 dragons roared, and his Immortal souls appeared. Even as the ripples of the Nine Cycles Daoist Magic spread out, he took a deep breath, and what he absorbed was the qi of Heaven and Earth from the starry sky.\u003c/p\u003e\n\u003cp\u003eAfter taking one breath, his Immortal meridians thrummed. Immediately, the number of dragons exceeded 99. Soon there were 100, 108, 115, 127, 136... until there were a total of 148!\u003c/p\u003e\n\u003cp\u003eThis scene caused everyone to be extremely shocked. Zhou Shui’s aura roared into the sky, and within his eyes appeared a cold light as he looked toward Meng Hao and barked, “One Breath, Slay Three Corpses!”\u003c/p\u003e\n\u003cp\u003eZhou Shui’s eyes flickered with killing intent. He knew that he had no hope of actually defeating Meng Hao, but he still hoped to be able to fight him to a draw, and prove that he was the true Chosen of the Ninth Mountain and Sea!\u003c/p\u003e\n\u003cp\u003eAs he spoke, his aura surged out, and his Immortal meridians caused strands of Immortal qi to form a huge stream of white smoke that shot toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eIt was only one stream, but it emanated a terrifying aura that seemed capable of slaughtering anyone in the Immortal Realm. Everyone in the Ninth Mountain and Sea was astonished.\u003c/p\u003e\n\u003cp\u003eThe only person whose expression was the same as ever was Meng Hao. His mouth twisted into a cold smile as his 123 Immortal meridians caused 123 portions of Immortal power to merge together into his fist. This could be counted as a secret magic that resulted from corroborating the Dao on his own to reach true Immortality.\u003c/p\u003e\n\u003cp\u003eYet again, one punch rocketed through the air.\u003c/p\u003e\n\u003cp\u003eWhen Meng Hao fought earlier, it might have seemed like he was using all of the power that his Immortal meridians could provide. However, he had actually employed no skill whatsoever in his attacks, and had relied only on brute force to crush everyone.\u003c/p\u003e\n\u003cp\u003eNow was the first time that he was using a true Immortal secret magic, unifying the power of his Immortal meridians into one force... to deliver a true Immortal Realm attack.\u003c/p\u003e\n\u003cp\u003eThe one punch generated a massive wind that caused the stars to flicker. Shockingly, numerous Soul Lamps appeared around Meng Hao, causing Zhou Shui to gape in shock. His eyes went wide, and even as the astonishment washed through him, Meng Hao\u0027s fist slammed into the stream of smoke.\u003c/p\u003e\n\u003cp\u003eA huge boom rang out as the smoke instantly collapsed. Blood sprayed from Zhou Shui’s mouth, and his body very nearly exploded. Shouting loudly, he utilized the Nine Cycles Daoist Magic, but even after reducing the power nine times, he was still sent flying backward like a kite with its string cut. Blood spurted out all over his body until he was soaked. His aura was vastly weakened, and the flame of his life force flickered on the verge of being extinguished.\u003c/p\u003e\n\u003cp\u003e“You....” he said. His face was pale, his scalp numb. Vibrations surged through his body to the point where all his Immortal meridians were about to collapse. In the midst of his astonishment, a look of terror appeared on his face, and without hesitation, he produced a jade slip which he crushed, teleporting him away immediately.\u003c/p\u003e\n\u003cp\u003eThe Ninth Mountain and Sea went deathly quiet as everyone mentally replayed the image of Meng Hao’s attack just now.\u003c/p\u003e\n\u003cp\u003e“That’s... the power of the Immortal Realm Paragon?!?!”\u003c/p\u003e\n\u003cp\u003e“Strong! So strong!!That strike was comparable to the Ancient Realm!!”\u003c/p\u003e\n\u003cp\u003e“That attack... even someone in the Ancient Realm with one extinguished soul lamp... might have a hard time fighting back against it!!”\u003c/p\u003e\n\u003cp\u003eThe Ninth Mountain and Sea was shaken as Meng Hao turned his head to face Wang Tengfei and Ji Yin.\u003c/p\u003e\n\u003cp\u003eJi Yin’s face was grim, and she backed up toward the teleportation portal. Apparently, she had decided not to attack Meng Hao. It was as if she had realized that Meng Hao, as of this moment, was someone others in the Immortal Realm couldn’t beat.\u003c/p\u003e\n\u003cp\u003eFan Dong’er’s eyes were wide, and Li Ling’er’s face was ashen. Zhao Yifan was smiling bitterly, and as for Taiyang Zi and the rest of the group of ten or so from earlier, all of them were sighing.\u003c/p\u003e\n\u003cp\u003eThey now knew that earlier... Meng Hao was only fighting to get used to his cultivation base. Therefore, he let them attack him. Now... he had no need for such a thing, and if they tried to attack him again, the result would be very different.\u003c/p\u003e\n\u003cp\u003eMeng Hao was someone not to be provoked!\u003c/p\u003e\n\u003cp\u003eWang Tengfei looked up, and the stars on his forehead flickered as he advanced by a pace.\u003c/p\u003e\n\u003cp\u003e“Meng Hao, I won’t waste your time. One punch. Just one punch!” His eyes flickered with obsession. He had been waiting for this moment for a long time, and in fact, there was no one except the two of them who truly knew all the details of their past.\u003c/p\u003e\n\u003cp\u003eMeng Hao looked at Wang Tengfei. He was still a bit shocked to find out that Wang Tengfei was alive, especially considering that he had personally seen him die at the hands of the 10th Wang Clan Patriarch.\u003c/p\u003e\n\u003cp\u003eWell aware of what Meng Hao was wondering, Wang Tengfei offered an explanation, his voice soft: “The 10th Patriarch helped me.”\u003c/p\u003e\n\u003cp\u003eMeng Hao looked back at Wang Tengfei silently, and his heart filled with complicated thoughts as he recalled how they had first met all those years ago. It was very likely that Wang Tengfei had seen the Flying Rain-Dragon that had become one of his Immortal meridians.\u003c/p\u003e\n\u003cp\u003e“Very well!” he said, nodding.\u003c/p\u003e\n\u003cp\u003eWang Tengfei\u0027s eyes gleamed with the desire to fight. As he looked at Meng Hao, his energy began to rise up. He possessed no secret magic, and the number of Immortal meridians that he had opened could not be considered especially outstanding in the current age.\u003c/p\u003e\n\u003cp\u003eHowever, he did have access to some of the deep resources built up by the 10th Wang Clan Patriarch. He also had Meng Hao’s Perfect Foundation, as well as the bloodline power he had acquired in the moment of becoming a true Immortal.\u003c/p\u003e\n\u003cp\u003eThat bloodline power was something shocking even in the Wang Clan because it was so rare!\u003c/p\u003e\n\u003cp\u003eIt was the power of Gods!\u003c/p\u003e\n\u003cp\u003eIn the Wang Clan, this bloodline power of Wang Tengfei was the power of a God!\u003c/p\u003e\n\u003cp\u003eWhat he walked, was not the path of Immortal Ascension. What he walked... was the path of Godly Ascension!\u003c/p\u003e\n\u003cp\u003eThis battle was a fight between Gods and Immortals!\u003c/p\u003e\n\u003cp\u003eWang Tengfei threw his head back and roared. Cracking sounds emanated out from his body, and in the blink of an eye.... he grew until he was 30 meters tall. 300 meters tall. 3,000 meters.... He looked completely and utterly shocking to anyone who saw him, and the area around him instantly filled with rifts and fissures.\u003c/p\u003e\n\u003cp\u003eHe continued to grow larger with maddening speed, and within a few breaths of time, he was directly in front of Meng Hao, a giant fully 6,000 meters tall!\u003c/p\u003e\n\u003cp\u003eThe sudden appearance of this giant filled Meng Hao’s mind with shock, and caused him to think back to the vision he had experienced in the Immortal Ancient Daoist Rite Temple, in which he saw a giant. That giant actually looked very similar to Wang Tengfei! [1. The visions of the giant were in \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-807/\"\u003echapters 807\u003c/a\u003e, \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-812/\"\u003e812\u003c/a\u003e, and \u003ca href\u003d\"http://www.wuxiaworld.com/issth-index/issth-book-6-chapter-819/\"\u003e819\u003c/a\u003e]\u003c/p\u003e\n\u003cp\u003eBoth had thick, tough skin covered with magical symbols, and both had stars on their foreheads. The main difference was that the giant in his vision had more stars than Wang Tengfei!\u003c/p\u003e\n\u003cp\u003eAll cultivators who saw what was happening were shocked. Wang Tengfei roared, causing a chaotic, primeval sensation to fill the hearts of anyone who heard it. His right hand clenched into a fist and he punched out toward Meng Hao.\u003c/p\u003e\n\u003cp\u003eThat fist flew like a gigantic meteor, heading toward Meng Hao with shocking speed.\u003c/p\u003e\n\u003cp\u003eMeng Hao’s expression was one of concentration. He was aware that there was something special about the Wang Clan. He had been able tell that from the strange divine ability used by Wang Mu earlier. In fact, he had even experienced other strange Wang Clan divine abilities on Planet South Heaven. However, he had never imagined that the Wang Clan blood contained... the power of Gods!\u003c/p\u003e\n\u003cp\u003e“Just exactly how powerful was the first Patriarch of the Wang Clan?” he thought. He had no idea what era that Wang Clan Patriarch lived in, but he was now intensely curious about him. However, now was not the time to ponder such matters. He clenched his right hand tightly into a fist, causing popping sounds to ring out. Then, he unleashed his secret magic, causing his 123 Immortal meridians to fuse with the power of his true Immortal fleshly body.\u003c/p\u003e\n\u003cp\u003eIt was as if his fleshly body was now 123 times more powerful, and as he punched out, the starry sky around him was shattered. The power contained in his fist caused the hearts of all observing cultivators to quiver.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, Meng Hao flew up to make contact with Wang Tengfei\u0027s fist. When the two slammed into each other, a huge boom echoed out. Stars collapsed and the Heavens went dark. A massive, ringlike shockwave spread out in all directions.\u003c/p\u003e\n\u003cp\u003eBlood sprayed out of Wang Tengfei’s mouth as he was sent staggering backward. His enormous body rapidly shrank in size, and after falling back more than ten paces, he was back to normal, his face ashen. He coughed up a few more mouthfuls of blood, and his right arm appeared to be completely shattered. He looked up at Meng Hao.\u003c/p\u003e\n\u003cp\u003e“I\u0027m definitely going to defeat you one day!” he said, sounding incredibly determined. With that, he turned, coughed up another mouthful of blood, and then transformed into a beam of light which shot off into the distance.\u003c/p\u003e\n\u003cp\u003eMeng Hao stood there silently. He slowly lowered his fist to find that his arm was trembling. Wang Tengfei’s staggering power contained a domineering force that could destroy everything. Meng Hao looked down at the back of his hand, and the wound that had been left behind there.\u003c/p\u003e\n\u003cp\u003eThis was actually the first time he had been injured while fighting these Chosen.\u003c/p\u003e\n\u003cp\u003e“Godly power....” he thought, eyes flickering with anticipation.\u003c/p\u003e\n\u003cp\u003e“Now, it’s time to take care of that personal matter....” He looked down toward Planet East Victory, and Fang Wei, who hovered there in midair. Once again, their gazes locked.\u003c/p\u003e\n\u003cp\u003e“Fang Wei!” he said softly, shooting toward Planet East Victory under the shocked gazes of everyone present!\u003c/p\u003e\n\u003cp\u003e“Fang Hao!” Fang Wei’s eyes gleamed with obsession as he began to fly up to meet Meng Hao.\u003c/p\u003e\n\u003cp\u003eDown on the ground below, Fang Xiushan’s eyes flickered with a venomous, murderous intent. Fang Wei’s grandfather narrowed his eyes. Within his hand was a jade slip that he was prepared to crush at a moment’s notice.\u003c/p\u003e\n\u003cp\u003eHowever, he seemed to be hesitating. Once he crushed that jade slip... there would be no turning back.\u003c/p\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-989\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/i-shall-seal-the-heavens/issth-book-6-chapter-991\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-6-chapter-990","bookId":1507,"creation":"Sep 10, 2019 5:03:26 AM","modification":"Sep 10, 2019 5:03:26 AM"}
