{"id":45036,"no":1,"title":"PREFACE.","content":"\"Si Klegg, of the 200th Ind., and Shorty, his Partner,\" were born more than 25 years ago in the brain of John McElroy, editor of The National Tribune, who invented the names and characters, outlined the general plan, and wrote a number of the chapters. Subsequently, the editor, having many other important things pressing upon his attention, called in an assistant to help on the work, and this assistant, under the direction and guidance of the editor, wrote some of these chapters. Subsequently, without the editor\u0027s knowledge or consent, the assistant adopted all the material as his own, and expanded it into a book which had a limited sale and then passed into the usual oblivion of shortlived subscription books.\n\u003cbr\u003e \n\u003cbr\u003e The sketches in this first number are the original ones published in The National Tribune in 1885-6, revised and enlarged somewhat by the editor.\n\u003cbr\u003e \n\u003cbr\u003e Those in the second and all following numbers appeared in The National Tribune when the editor, John McElroy, resumed the story in 1897, 12 years after the first publication, and continued it for the unprecedented period of seven years, with constantly growing interest and popularity. They gave \"Si Klegg\" a nation-wide and enduring celebrity. Gen. Lew Wallace, the foremost literary man of his day, pronounced \"Si Klegg\" the \"great idyll of the war.\"\n\u003cbr\u003e \n\u003cbr\u003e How true they are to nature every veteran can abundantly testify from his own service. Really, only the name of the regiment was invented. There is no doubt that there were several men of the name of Josiah Klegg in the union Army, and who did valiant service for the Government. They had experiences akin to, if not identical with, those narrated here, and substantially every man who faithfully and bravely carried a musket in defense of the best Government on earth had sometimes, if not often, experiences of with those of Si Klegg, Shorty and the boys are strong reminders.\n\u003cbr\u003e \n\u003cbr\u003e Many of the illustrations in this first number are by the late Geo. Y. Coffin, deceased, a talented artist, whose work embellished The National Tribune for many years. He was the artist of The National Tribune until his lamented and premature death, and all his military work was done by daily consultation, instruction and direction of the editor of The National Tribune.\n\u003cbr\u003e \n\u003cbr\u003e THE NATIONAL TRIBUNE. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2247/63188.html","bookId":439,"creation":"Aug 11, 2019 8:15:27 AM","modification":"Aug 11, 2019 8:15:27 AM"}
