{"id":67226,"no":11,"title":"Page 11","content":"\u003cp\u003e“You’re the right man for me,” she breathed, determined not to bring her father into the conversation. “Oh, Ian, I miss you so much.”\u003c/p\u003e\n\u003cp\u003e“I’ll be home soon.”\u003c/p\u003e\n\u003cp\u003eNot before the baby was born, but Cecilia couldn’t think about that. This time she wasn’t alone. Cathy Lackey would be with her and had promised to be her birthing coach. Cecilia had signed up for classes and they’d be starting soon. Cathy would go with her.\u003c/p\u003e\n\u003cp\u003eWhen Cecilia delivered Allison she’d been alone, not knowing a soul other than her father. The baby had arrived several weeks early. Her mother had intended to fly out, but couldn’t reach her in time. Friendless and frightened, Cecilia had gone to the hospital on her own.\u003c/p\u003e\n\u003cp\u003e“We need boy names, Ian,” she said, breaking off those painful memories.\u003c/p\u003e\n\u003cp\u003e“Ah…I can’t think of anything at the moment. Let me e-mail you a few suggestions. Okay?”\u003c/p\u003e\n\u003cp\u003e“Okay. But I think our son should have his daddy’s name.”\u003c/p\u003e\n\u003cp\u003e“Too confusing,” Ian said. “Maybe for his middle name.”\u003c/p\u003e\n\u003cp\u003e“That sounds fine.”\u003c/p\u003e\n\u003cp\u003e“Listen, sweetheart, I have to go, but before I do I need to ask a favor for a friend of mine. He asked if you’d mind checking on a girl for him.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“Her name is Rachel Pendergast and she works at a beauty place in Cedar Cove called Get Nailed.”\u003c/p\u003e\n\u003cp\u003e“I know it. Almost everyone gets their nails done there.”\u003c/p\u003e\n\u003cp\u003e“Nate went out with Rachel a couple of times and seems pretty interested in her, but she doesn’t have a computer. Apparently she writes him a lot, but it isn’t the same as being able to communicate on-line.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t she use the computer at the library?” Cecilia asked. That was the one Cecilia had used when she and Ian were separated and she needed to keep in touch with him. With all the expenses related to burying Allison and the attorney’s fees for their failed divorce, she’d had no money for anything extra.\u003c/p\u003e\n\u003cp\u003e“Apparently Rachel’s never been on-line and isn’t sure how it works. This is all new to her.”\u003c/p\u003e\n\u003cp\u003e“I’ll get her started,” Cecilia promised.\u003c/p\u003e\n\u003cp\u003e“Thanks, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome, my handsome, wonderful husband.”\u003c/p\u003e\n\u003cp\u003e“How long has it been since I told you I love you?”\u003c/p\u003e\n\u003cp\u003eCecilia smiled softly. “Too long.”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003eShe giggled with sheer happiness.\u003c/p\u003e\n\u003cp\u003e“A son,” Ian whispered. “A son.”\u003c/p\u003e\n\u003cp\u003eEleven\u003c/p\u003e\n\u003cp\u003eThis was moving day. Linnette’s brother had been a real help. He’d arrived at her Seattle apartment early Saturday morning with Lucky, his Australian Shepherd, and a couple of his friends who were volunteer firefighters with Mack. The only stuff left to move was her furniture and a few of the heavier boxes. Linnette had already taken over what she could, a little at a time, but the larger items required a truck, which she’d rented.\u003c/p\u003e\n\u003cp\u003e“I can’t begin to tell you how much I appreciate this,” Linnette told her brother after he and his friends had loaded up the truck. Bryan and Drew were carrying down the dining room chairs. Her roommate had left a month earlier, and the place was now completely empty.\u003c/p\u003e\n\u003cp\u003e“No problem,” Mack said. He’d stayed behind. Now he wiped the sweat from his brow. “I’m glad I can help. I’m hoping the two of us will have a chance to talk later.”\u003c/p\u003e\n\u003cp\u003eBefore Linnette could reply, Bryan stepped back into the room. “You ready to head out?” he asked. He seemed eager to get going. Drew followed him inside, chanting, “Hey, hey, hey. We’re on our way.”\u003c/p\u003e\n\u003cp\u003e“I’ll be down in a minute,” Mack told them.\u003c/p\u003e\n\u003cp\u003e“We’ll find a chance to talk,” Linnette promised.\u003c/p\u003e\n\u003cp\u003e“Good. Maybe after we’ve unloaded the big stuff, we can chat and then I’ll drive the truck back to the rental place.” It cost less to rent the vehicle if it was returned to the original location. Mack had graciously agreed to deliver it to Seattle for his sister.\u003c/p\u003e\n\u003cp\u003eJust as efficiently as he and his friends had loaded the U-Haul, they unpacked it, carted everything up the one flight of outdoor stairs and set her sofa, chair, lamp, coffee table and television in her small living room. Her bed and mattress, dresser and nightstand went into the larger of the two bedrooms. Her desk, chair and computer, which she’d carefully boxed, were in the second room. Eventually Linnette planned to add a sleeper-sofa and maybe a small work table. She wanted to start doing crafts again, which was something she hadn’t had time for while she was in school. The dining room table was a Salvation Army find, but it was pretty battered and Linnette hoped to replace it soon. With a regular income she’d have a few more options.\u003c/p\u003e\n\u003cp\u003eWhen Mack and his friends were finished, Linnette treated them to take-out hamburgers, fries and cold drinks. As soon as they’d wolfed those down, Drew and Bryan were on their way back to Seattle, with Linnette’s fervent thanks ringing in their ears.\u003c/p\u003e\n\u003cp\u003eMack sat on her sofa, leaned forward and set his wadded burger wrapper on her coffee table. Lucky, well-behaved dog that she was, had stayed obediently out of everyone’s way and now rested at his side. As if gathering his thoughts, her brother waited a moment, then looked at Linnette. “Do you know what’s going on with Mom and Dad?” he asked.\u003c/p\u003e\n\u003cp\u003eHer brother was astute, she’d give him that. “What makes you think anything’s going on?” She was interested in how he’d picked up on this so quickly. As far as Linnette knew, he wasn’t in regular communication with their parents.\u003c/p\u003e\n\u003cp\u003e“Mom’s been phoning me every Sunday afternoon. It’s gotten to be like clockwork. She hadn’t said anything outright, but just recently, I’d say in the last couple of weeks, she’s made some remarks that don’t add up.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003eMack hesitated. “For one thing, she casually mentioned that if anything were to happen to Dad, I should never doubt his love for me. I asked her if Dad was sick or there was something I should know, but she claimed there wasn’t. I don’t think she’d lie to me, but I’m pretty sure she’s not telling me the whole truth.”\u003c/p\u003e\n\u003cp\u003e“Go on,” Linnette encouraged. Her brother had good instincts and she wondered how much information he’d been able to glean.\u003c/p\u003e\n\u003cp\u003e“Every time Mom phones, she assures me everything’s fine. So, after a while, I started to think I might be imagining things.”\u003c/p\u003e\n\u003cp\u003e“You aren’t,” Linnette was quick to tell him, and then went on to describe the postcards her parents had received.\u003c/p\u003e\n\u003cp\u003e“They aren’t threatening?” Mack asked, frowning.\u003c/p\u003e\n\u003cp\u003e“I can’t say for sure,” Linnette said. “The only one I saw said, ‘Are you thinking yet?’”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003e“According to Mom, Dad assumes this has something to do with his work on the police force.”\u003c/p\u003e\n\u003cp\u003e“Some criminal he put away?” Mack speculated.\u003c/p\u003e\n\u003cp\u003e“Perhaps someone who has a vendetta against Dad. Whoever’s doing this seems intent on psychologically wearing him down.”\u003c/p\u003e\n\u003cp\u003e“That won’t work,” Mack said with a slow grin. “If this person wants to torment our father, all he needs to do is grow his hair long, refuse to play football, drop out of college and take a job at the post office. That’s enough to send the mighty Roy McAfee over the edge.”\u003c/p\u003e\n\u003cp\u003eLinnette laughed, noticing anew what an attractive man her brother was. His build was similar to their father’s, but as far as his looks went, he took after Grandpa Wilson, their mother’s father.\u003c/p\u003e\n\u003cp\u003e“Do you think they’re in any real danger?” Mack asked seriously.\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ve tried to get Mom to tell me how long this has been going on, but she doesn’t want to worry me. The fact that she won’t talk about it concerns me more. I told her that, and she got all teary and said Dad’s been completely unreasonable.”\u003c/p\u003e\n\u003cp\u003e“That’s unusual?” Mack teased.\u003c/p\u003e\n\u003cp\u003eLinnette shook her head, smiling. “Apparently there’s been more than the postcards.” She sat down on the sofa beside her brother and stroked Lucky’s head. “Mom said something about a fruit basket being delivered.”\u003c/p\u003e\n\u003cp\u003e“They didn’t eat any of it, did they?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what they did with it. I assume they threw it away. That one really freaked Mom out.”\u003c/p\u003e\n\u003cp\u003e“I can imagine. I wonder if it’s part of this person’s method. You know, kill them with kindness, confuse the enemy—and then move in with the real agenda.”\u003c/p\u003e\n\u003cp\u003eLinnette hadn’t thought of it that way. “You and Dad might not get along, but you’re more alike than you realize.”\u003c/p\u003e\n\u003cp\u003eMack cringed. “Don’t tell me that. The last person in the world I want to be like is my father.”\u003c/p\u003e\n\u003cp\u003e“He’s not so bad,” Linnette felt obliged to tell him. “And neither are you. One of these days, the two of you will come to an understanding.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Mack said doubtfully. “I hope we do, but I’m not holding my breath.”\u003c/p\u003e\n\u003cp\u003eA polite knock sounded at Linnette’s door. Lucky was suddenly alert; she gave one brief bark and stared intently.\u003c/p\u003e\n\u003cp\u003eBrother and sister glanced at each other, and then Linnette went to the door. A woman, dressed in a brown sheriff’s uniform, stood on the other side, holding a small pot of bronze chrysanthemums.\u003c/p\u003e\n\u003cp\u003e“Hello, I’m your neighbor, Gloria Ashton,” she said as she handed Linnette the plant.\u003c/p\u003e\n\u003cp\u003e“Linnette McAfee,” she said, admiring the rich color of the chrysanthemums. “Mom told me everyone in Cedar Cove is friendly. This is just so nice. Please come in.” She stood aside so Gloria could step into her apartment. Linnette gestured toward her brother. “Gloria, this is my brother, Mack. Mack, this is my next-door neighbor, Gloria Ashton.”\u003c/p\u003e\n\u003cp\u003eMack released the dog’s collar, then stood and offered Gloria his hand. She took a step forward and extended her own. “This is Lucky,” he said. The dog waved her plumy tail, then returned to her place by the couch.\u003c/p\u003e\n\u003cp\u003e“I’m two doors down in apartment 216. I saw your brother and a couple of other guys bringing in the furniture. I thought I’d stop by on my way to work and introduce myself. I didn’t mean to interrupt you, but I wasn’t sure when I’d get another opportunity.”\u003c/p\u003e\n\u003cp\u003e“You’re with the sheriff’s office here?” Linnette asked. Gloria stood with her feet braced slightly apart, hands on her belt. She was short, petite, dark-haired; her uniform fit as if it’d been especially designed for her. The belt that held her weapon and other paraphernalia only emphasized her femininity.\u003c/p\u003e\n\u003cp\u003eGloria shook her head in response to Linnette’s question. “I’m with the Bremerton office. I’ve been in the area a little less than a year.”\u003c/p\u003e\n\u003cp\u003eMack stared at her and narrowed his eyes, as if he was trying to place her. “You look familiar. Have I seen you somewhere before?”\u003c/p\u003e\n\u003cp\u003eGloria studied him, frowning, and then shook her head again. “I don’t believe we’ve met.”\u003c/p\u003e\n\u003cp\u003eMack shrugged. “I guess not. I don’t visit often, but when I do I always drive the speed limit.” \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-11.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
