{"id":67243,"no":28,"title":"Page 28","content":"\u003cp\u003eShe didn’t tell him about the baby until they were engaged. He used to wonder why she’d waited. But now he understood that if she’d told him before, she’d never be sure whether his proposal had been offered out of love—or guilt and regret. Waiting until she was utterly convinced of his love might have saved their marriage.\u003c/p\u003e\n\u003cp\u003eRoy leaned back in his chair and propped his feet on the desk. His best detective work was done in this old chair, a relic from his police days. The department had wanted to toss it, but Roy had saved it from a junkyard death, rolled it out to his car and brought it home. He’d been sitting in this chair ever since. Corrie hated it, pleaded with him to get rid of it. He wouldn’t.\u003c/p\u003e\n\u003cp\u003eThe office door opened and then closed. “Dad?”\u003c/p\u003e\n\u003cp\u003eRoy let his feet fall to the floor. “In here,” he called out to his daughter.\u003c/p\u003e\n\u003cp\u003eLinnette walked into his office and threw herself onto the chair opposite his desk. “Where’s Mom?”\u003c/p\u003e\n\u003cp\u003eRoy had exactly the same question. “Apparently she took an extended lunch hour. I guess that’s what I get for hiring family,” he joked.\u003c/p\u003e\n\u003cp\u003e“Oh.” Linnette looked as if she wanted to weep.\u003c/p\u003e\n\u003cp\u003e“You need to talk to her?”\u003c/p\u003e\n\u003cp\u003eHis daughter nodded. “Dad,” she said, straightening, “did you always love Mom? I mean, was there ever a time you had questions about the way you felt?”\u003c/p\u003e\n\u003cp\u003e“Sure,” he admitted, a little taken aback by the question, so close to his own recent thoughts. “Just the other day,” he teased, trying to lighten the mood. He wasn’t much good at giving advice. That was Corrie’s specialty.\u003c/p\u003e\n\u003cp\u003e“Dad, I’m serious.”\u003c/p\u003e\n\u003cp\u003e“I know you are,” he said, somber now. “Relationship problems?”\u003c/p\u003e\n\u003cp\u003eLinnette shrugged. “I screwed up.”\u003c/p\u003e\n\u003cp\u003eRoy hated to turn his daughter away, but he wasn’t comfortable with this heart-to-heart stuff. “You’d better talk to your mother.”\u003c/p\u003e\n\u003cp\u003e“She isn’t here. You are.”\u003c/p\u003e\n\u003cp\u003e“In other words, it’s any port in a storm?”\u003c/p\u003e\n\u003cp\u003eShe gave him a half smile. “You could say that.”\u003c/p\u003e\n\u003cp\u003e“All right.” He tried not to sigh. “Tell me what’s on your mind.”\u003c/p\u003e\n\u003cp\u003ePulling off her gloves, Linnette stood up for a moment and removed her coat.\u003c/p\u003e\n\u003cp\u003e“I did something I regret,” she said bluntly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Mom bought me a date with this guy in that Dog and Bachelor Auction last summer. Cal, his name is, and he’s a horse trainer. We went out, mainly because Mom pressured me into it. I didn’t want to, but I finally agreed.”\u003c/p\u003e\n\u003cp\u003e“Was it so bad?”\u003c/p\u003e\n\u003cp\u003e“Not at all. I enjoyed dinner and later, I went out with him again. I had an even better time, and then he kissed me and—”\u003c/p\u003e\n\u003cp\u003e“Hold on a minute.” Roy raised one hand. “I don’t want to hear any of that. Otherwise, I might be tempted to bash his teeth in.”\u003c/p\u003e\n\u003cp\u003eLinnette looked up and smiled. “You’re such a father.”\u003c/p\u003e\n\u003cp\u003e“Sorry, can’t help it. You’re my baby girl.”\u003c/p\u003e\n\u003cp\u003e“I am not a baby.”\u003c/p\u003e\n\u003cp\u003e“All I can say is wait until you have your own children and then decide.” He gestured for her to continue.\u003c/p\u003e\n\u003cp\u003e“I liked the way Cal kissed me—don’t worry, I’m not going to say any more about it, except that when he kissed me I got scared.”\u003c/p\u003e\n\u003cp\u003eThis got Roy’s attention. “Did he try any funny stuff?”\u003c/p\u003e\n\u003cp\u003e“No, nothing like that. He didn’t scare me—I’m explaining this badly. What I mean is, I knew that if he kept on kissing me, I’d want to see him again, and I couldn’t because there was someone else I liked better.”\u003c/p\u003e\n\u003cp\u003e“Hmm?” That was about as profound a comment as he could make. He was finding all this a bit difficult to follow. So she liked this horse guy but she didn’t? And who was the “someone else”?\u003c/p\u003e\n\u003cp\u003e“I wanted to be available for Chad,” she elaborated, “and I didn’t want to get sidetracked.”\u003c/p\u003e\n\u003cp\u003eOkay, now he got it. Sort of. “This is that doctor fellow?”\u003c/p\u003e\n\u003cp\u003eLinnette nodded. “The problem is, it didn’t work.”\u003c/p\u003e\n\u003cp\u003e“You mean the doctor fellow isn’t interested? Or you’ve been thinking about Cal?”\u003c/p\u003e\n\u003cp\u003e“Both. But I was incredibly rude to Cal, and I keep wondering, you know, what would’ve happened if we’d continued dating. I wonder if I might’ve let a wonderful man slip through my fingers—and all for nothing.”\u003c/p\u003e\n\u003cp\u003e“What’s happening with Chad?” Roy needed all the facts, logically presented.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No movement there. He’s handsome and sophisticated, and at one time I would’ve given my eyeteeth to go out with him, but he’s never asked. I doubt he ever will, and you know what? That’s fine. I’m pretty much over him. It’s Cal who interests me now. Except I’m not sure what I should do.”\u003c/p\u003e\n\u003cp\u003eOkay. Scratch the doctor. But Roy had no idea what he was supposed to say next. He was clean out of romantic advice.\u003c/p\u003e\n\u003cp\u003e“I wonder if I should phone Cal and apologize or just let it go.” She raised expectant eyes to him. “What do you think?”\u003c/p\u003e\n\u003cp\u003eThat was the million-dollar question, all right. “What do I think?” he repeated slowly. “You may not know this,” he began, “but your mother and I dated for a while and then split up.” He paused. “After almost two years, we met again. I’ve always felt fate put her in my path that day.”\u003c/p\u003e\n\u003cp\u003e“In other words, if it’s meant to be, I’ll see Cal again?”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “Something like that.”\u003c/p\u003e\n\u003cp\u003eLinnette seemed to be mulling over his words. She stood up, her expression thoughtful, and reached for her coat. “Thanks, Dad.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.” He leaned back in his chair and placed his feet on the desk once again, crossing his ankles. “Any other problems you want me to solve?”\u003c/p\u003e\n\u003cp\u003e“Not this afternoon. Tell Mom I came by, okay?”\u003c/p\u003e\n\u003cp\u003e“Will do.”\u003c/p\u003e\n\u003cp\u003eLinnette left and Roy was settling down to a short nap when the door opened and Corrie burst into his office. Roy took one look at his wife and dropped his feet to the carpet for the second time. “Corrie? What’s wrong?”\u003c/p\u003e\n\u003cp\u003eTears shone in her eyes as she sat in the chair just vacated by their daughter. “I—” She swallowed hard, fidgeting with a tissue.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“You refused to listen. You refused to consider what I said, so I took matters into my own hands.” She was so pale, he felt suddenly terrified.\u003c/p\u003e\n\u003cp\u003e“What did you do?” he asked, frowning.\u003c/p\u003e\n\u003cp\u003e“I—you aren’t the only one in this family capable of doing detective work. I have my own resources.”\u003c/p\u003e\n\u003cp\u003e“Corrie? What did you do?” he repeated.\u003c/p\u003e\n\u003cp\u003eShe finally met his gaze. “We had a daughter, Roy. I gave birth to a little girl.”\u003c/p\u003e\n\u003cp\u003eRoy came around from his side of the desk and placed his hand on her shoulder. Bending down, he looked into his wife’s eyes, loving her so intensely he felt a physical pull toward her. “I know,” he whispered.\u003c/p\u003e\n\u003cp\u003e“You know?”\u003c/p\u003e\n\u003cp\u003e“I found out, too.”\u003c/p\u003e\n\u003cp\u003eTwenty-Nine\u003c/p\u003e\n\u003cp\u003eRachel tried, but she couldn’t stop thinking about what she’d learned from Carol Greendale on Christmas Day. Nate was the son of a powerful East Coast politician. She was living in a dream world if she had any hopes for this relationship. The sooner she cut her losses, the better. And she decided to do just that, sending Nate a terse but perfectly polite e-mail. She hadn’t turned on her computer since.\u003c/p\u003e\n\u003cp\u003eFriday night, Bruce phoned her at the salon and suggested they get together. Rachel’s first inclination was to decline. She wasn’t in the mood to be sociable, but on second thought, she didn’t go out that often. Bruce was usually good company.\u003c/p\u003e\n\u003cp\u003e“What do you have in mind?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” He didn’t seem full of enthusiasm, either.\u003c/p\u003e\n\u003cp\u003eHalf the time Rachel figured the only reason he called her was that he didn’t know any other women. But that wasn’t true; he knew plenty of women. She suspected he had an irrational fear of unmarried females trying to trap him into marriage. That wasn’t an issue with her and he knew he was safe.\u003c/p\u003e\n\u003cp\u003e“Want to go to a movie?” she asked.\u003c/p\u003e\n\u003cp\u003e“We could.”\u003c/p\u003e\n\u003cp\u003e“Where’s Jolene going to be?” She tried to think of something that might appeal to both of them.\u003c/p\u003e\n\u003cp\u003e“Slumber party.”\u003c/p\u003e\n\u003cp\u003e“Dinner?” Rachel suggested.\u003c/p\u003e\n\u003cp\u003eThey didn’t even talk in full sentences anymore. They were like an old married couple so attuned to each other that their communication was a form of shorthand.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eThat was fine with Rachel, too. “Where?”\u003c/p\u003e\n\u003cp\u003e“You choose.”\u003c/p\u003e\n\u003cp\u003e“Taco Shack.”\u003c/p\u003e\n\u003cp\u003e“Meet you there?”\u003c/p\u003e\n\u003cp\u003e“Fine. Six?”\u003c/p\u003e\n\u003cp\u003e“Great.”\u003c/p\u003e\n\u003cp\u003eBy the time she left the salon and drove out to the Taco Shack, Bruce had arrived and scouted out a table. The Taco Shack was a popular Friday-night spot. The food was good and plentiful and, best of all, cheap.\u003c/p\u003e\n\u003cp\u003e“I already ordered for you,” he said when she joined him.\u003c/p\u003e\n\u003cp\u003e“How’d you know what I wanted?”\u003c/p\u003e\n\u003cp\u003e“Cheese enchiladas. That’s what you order every time.”\u003c/p\u003e\n\u003cp\u003e“I do?” Rachel hadn’t realized that. As a matter of fact, she read the entire wall-mounted menu on each visit. Apparently she was even more predictable than she’d known.\u003c/p\u003e\n\u003cp\u003eShe got herself a Diet Coke—Bruce had a bottle of water—and their dinner was delivered two minutes later. If she ordered the same thing every time, then so did Bruce. Without instructions, the server set the cheese plate in front of her and the chicken enchiladas in front of Bruce.\u003c/p\u003e\n\u003cp\u003eAs though synchronized, they both reached for their forks. “Do you want to watch a DVD later?” Rachel asked between bites.\u003c/p\u003e\n\u003cp\u003e“What have you got?”\u003c/p\u003e\n\u003cp\u003eShe named a few movies that had been going around the salon. The girls at Get Nailed had a better system than most rental places, and if a DVD didn’t get returned in a timely manner, the teasing was ruthless. Rachel had borrowed several for the weekend, a couple of comedies and an emotional drama, reputedly a tearjerker.\u003c/p\u003e\n\u003cp\u003e“I haven’t seen any of those.”\u003c/p\u003e\n\u003cp\u003eThey decided on one of the comedies, then ate in silence for a few minutes.\u003c/p\u003e\n\u003cp\u003e“Have you heard from lover boy?” Bruce asked, picking up his water.\u003c/p\u003e\n\u003cp\u003e“If you mean Nate, then no, I haven’t.”\u003c/p\u003e\n\u003cp\u003e“No?” This seemed to surprise Bruce.\u003c/p\u003e\n\u003cp\u003e“I ended it.”\u003c/p\u003e\n\u003cp\u003eBruce set down his water and studied her. “This is news. What happened?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Don’t give me that. You didn’t write this guy a Dear John letter for no reason. That’s not like you.”\u003c/p\u003e\n\u003cp\u003e“I e-mailed him.”\u003c/p\u003e\n\u003cp\u003e“Okay, a Dear John e-mail. Tell me what’s going on.”\u003c/p\u003e\n\u003cp\u003eBruce was right; she hadn’t done this lightly. She’d thought about the situation for almost two weeks and concluded that it couldn’t work. “If you don’t mind, I’d rather not discuss it.”\u003c/p\u003e\n\u003cp\u003e“All right.” \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-28.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
