{"id":67246,"no":31,"title":"Page 31","content":"\u003cp\u003eCorrie didn’t, either, which was the main reason she hadn’t informed him.\u003c/p\u003e\n\u003cp\u003e“I think it’s time we were honest with each other,” she said.\u003c/p\u003e\n\u003cp\u003eHer husband’s eyes flared. “I’ve never been dishonest with you.”\u003c/p\u003e\n\u003cp\u003e“Perhaps not openly, but it’s clear you were trying to get me out of the office this afternoon and I need to know why.”\u003c/p\u003e\n\u003cp\u003eRoy sighed deeply. “Okay,” he said with resignation. “I wanted to make a few calls and find out what I could about our…other daughter.”\u003c/p\u003e\n\u003cp\u003e“Without telling me?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I was going to let you know what I found out.”\u003c/p\u003e\n\u003cp\u003e“Eventually,” she said.\u003c/p\u003e\n\u003cp\u003eHe hesitated, then admitted it. “Eventually,” he echoed.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought. But why? Do you think I’m emotionally unstable? Did you assume I couldn’t deal with whatever information you unearthed?”\u003c/p\u003e\n\u003cp\u003e“No,” he denied hotly. “That’s ridiculous.”\u003c/p\u003e\n\u003cp\u003e“Then what possible reason is there for keeping me in the dark?”\u003c/p\u003e\n\u003cp\u003e“We have a daughter who’s thirty years old,” he said thoughtfully. “A daughter we know nothing about.”\u003c/p\u003e\n\u003cp\u003eShe stopped herself from reminding him that, until recently, they hadn’t even known their first child was female.\u003c/p\u003e\n\u003cp\u003e“All these years, I worked hard at pushing every thought of her—the baby—from my mind. I was comfortable doing it. I didn’t want to know—and yet I did. We’d vowed never to mention it again but now…now she’s out there and she refuses to be ignored.”\u003c/p\u003e\n\u003cp\u003eThat was painfully obvious to Corrie, as well. “You wanted to find her yourself. Contact her and then bring me in on what you’d done.”\u003c/p\u003e\n\u003cp\u003e“I need to find her,” he corrected. “I’ve gone into the adoption registries and entered our names.”\u003c/p\u003e\n\u003cp\u003e“Why exclude me?” Corrie blurted out.\u003c/p\u003e\n\u003cp\u003e“I’ll explain that in a moment. Like I said, I went on the Internet.”\u003c/p\u003e\n\u003cp\u003eConfession time for her, too. “I did the same thing.”\u003c/p\u003e\n\u003cp\u003eHer husband’s eyes connected with hers. “She hasn’t registered.”\u003c/p\u003e\n\u003cp\u003eCorrie knew that. She didn’t understand it. By whatever means, their daughter had been able to track them down without any of the adoption advocacy groups. And yet…\u003c/p\u003e\n\u003cp\u003e“That’s why you’ve kept me out of it,” Corrie murmured. “Because you’re not sure of her motives.”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “If she wanted us to find her, she would’ve registered, but she didn’t. That tells me all of this isn’t as innocent as it might seem. She found me, but doesn’t want to be found herself. She’s content to mail anonymous postcards, send flowers. She’s taunting me. This is all one big game to her, and for some reason she seems to have more of a problem with me than with you.”\u003c/p\u003e\n\u003cp\u003e“I wonder why,” Corrie mused aloud, “but I think you may be right.” Her husband had always been cautious, and perhaps more importantly, suspicious. He considered every angle of a situation, methodically catalogued each detail. The way he worked reminded her of people who did jigsaw puzzles, carefully studying every piece.\u003c/p\u003e\n\u003cp\u003e“The adoption laws in California are different from those in Washington,” Roy added. “I was thinking—”\u003c/p\u003e\n\u003cp\u003e“California?” Corrie broke in.\u003c/p\u003e\n\u003cp\u003eImmediately Roy had that chagrined look—he’d said more than he’d meant to. “Yes, California. That’s where the final adoption took place.”\u003c/p\u003e\n\u003cp\u003eCorrie hadn’t noticed where the baby’s home would be as she signed her name. Perhaps the attorney had told her, but if so, she had no recollection of it. “I don’t suppose you happened to notice the date, did you?”\u003c/p\u003e\n\u003cp\u003e“No, why?”\u003c/p\u003e\n\u003cp\u003eShe swallowed hard and shook her head. “No reason.”\u003c/p\u003e\n\u003cp\u003e“Corrie?”\u003c/p\u003e\n\u003cp\u003eShe glanced down, forcing back emotion, unwilling to say.\u003c/p\u003e\n\u003cp\u003e“I was wrong not to tell you everything I found out.”\u003c/p\u003e\n\u003cp\u003e“You mean there’s more?” she snapped. She felt angry that Roy had gone about this investigation and left her out. Yes, she was guilty of the same thing. But she had a good reason. Roy had claimed he didn’t want to know; he’d refused to discuss the subject, so she’d had to learn what she could on her own.\u003c/p\u003e\n\u003cp\u003e“No. I couldn’t find anything else. I’ve hit a brick wall with the California records. Only Alabama, Alaska, Kansas and Oregon are ‘open records states.’ The reason I was able to find out as much as I did was through an old friend who works for the California state government.” Looking at Corrie, he narrowed his eyes. “How did you discover we had a daughter?”\u003c/p\u003e\n\u003cp\u003eShe gazed down at her folded hands. “My mother’s diaries. I have them and I looked up the year and month. She knew. She never said a word to me, but she knew we’d had a daughter.”\u003c/p\u003e\n\u003cp\u003e“We’ll find her, sweetheart, and when we do we’ll explain everything.”\u003c/p\u003e\n\u003cp\u003eCorrie just hoped it was enough for this child to know she was loved and always had been, despite the fact that she’d sent her out of their lives.\u003c/p\u003e\n\u003cp\u003eThirty-Two\u003c/p\u003e\n\u003cp\u003eAllison Cox marched into the living room and sat down across from her father, who was in his recliner reading the paper. She waited patiently for him to lower it, which he did after a few minutes.\u003c/p\u003e\n\u003cp\u003e“Is there something you want to say?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, and looked down at her hands, struggling to find a way to broach the subject of Anson. He wasn’t her first boyfriend, but he was special, and she needed, somehow, to convey that to her father.\u003c/p\u003e\n\u003cp\u003e“Does this have anything to do with Anson?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She wondered how he’d figured that out. Or maybe she was more obvious than she thought.\u003c/p\u003e\n\u003cp\u003eHer father frowned darkly. “He hasn’t broken his word, has he?”\u003c/p\u003e\n\u003cp\u003e“No…”\u003c/p\u003e\n\u003cp\u003eHer mother stepped out from the kitchen and her parents exchanged glances. They did that a lot lately. Maybe it’d been going on a long time and Allison hadn’t noticed. She did now, because she and Anson communicated in the same way. He hadn’t talked to her since his court date, not even once, but they spoke with their eyes each and every day in French class.\u003c/p\u003e\n\u003cp\u003eHis gaze told her he loved her, and Allison wanted him to know she shared his feelings. Not that she’d ever let her parents find out. They’d say she was too young and insist Anson wasn’t right for her. They’d be wrong, but it was a waste of breath to argue. She knew she loved Anson and would for the rest of her life.\u003c/p\u003e\n\u003cp\u003e“Do you want me in here, too?” her mother asked.\u003c/p\u003e\n\u003cp\u003eAllison had never intended this to be such a big deal. “Ah, sure.”\u003c/p\u003e\n\u003cp\u003eAt least her little brother was in his bedroom. Eddie was mostly a pest, but he had his uses.\u003c/p\u003e\n\u003cp\u003eRosie sat on the arm of the recliner and placed her hand on Zach’s shoulder. “You were saying?” her mother gestured toward Allison.\u003c/p\u003e\n\u003cp\u003e“I hadn’t really started,” she explained. “Dad asked if Anson’s been talking to me.” Righteously, she added, “He hasn’t.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“It hasn’t been easy, you know.” Both her parents seemed to take it for granted that she’d kept her promise. She had, but it’d been the hardest thing she’d ever done. The temptation was so strong because she loved Anson so much. He was the resolute one, not her, and she wanted her parents to appreciate him.\u003c/p\u003e\n\u003cp\u003eThe next part was important. “Dad, I know you helped him get the job at The Lighthouse and I’d like to thank you.”\u003c/p\u003e\n\u003cp\u003eHer father shrugged, as if it was a small thing. “I checked with Seth Gunderson, and Anson appears to be a good employee.”\u003c/p\u003e\n\u003cp\u003e“Really?” Allison was sure this was true. She felt it in her heart, but having her father verify it made everything seem better.\u003c/p\u003e\n\u003cp\u003e“Yes.” Her dad smiled slightly. “According to Seth, Anson shows up early and works hard. He doesn’t drive, so he walks to the restaurant after school and pitches in until his shift starts. The only problem Anson had was with another kid who works there named Tony.”\u003c/p\u003e\n\u003cp\u003eAllison bit her lower lip. “What kind of problem?”\u003c/p\u003e\n\u003cp\u003eHer father shrugged. “Seth didn’t really say, but I got the impression that this Tony seems to think Anson makes the other employees look bad because he’s so eager to do a good job.”\u003c/p\u003e\n\u003cp\u003eAnson’s attitude pleased her. “If he walks from school to work, how does he get home?”\u003c/p\u003e\n\u003cp\u003eHer father shook his head. “Seth didn’t say, but I suspect one of the other crew drops him off.”\u003c/p\u003e\n\u003cp\u003e“Not Tony,” she said, musing out loud.\u003c/p\u003e\n\u003cp\u003e“Probably not,” her father agreed.\u003c/p\u003e\n\u003cp\u003eAllison hoped someone was giving Anson a ride. It had to be two miles between The Lighthouse restaurant and the trailer court where his mother lived. She knew for a fact that his mother wouldn’t come and get him. Anson had said enough for Allison to know the woman possessed virtually no maternal instincts.\u003c/p\u003e\n\u003cp\u003e“Maybe you should tell her what the attorney said,” Rosie advised, sharing another of those looks with Allison’s father.\u003c/p\u003e\n\u003cp\u003eZach nodded. “Anson’s turned every paycheck over to the city as reimbursement for the shed that was destroyed.”\u003c/p\u003e\n\u003cp\u003e“That’s wonderful.” Allison clasped her hands. She was so pleased, it was difficult to hold still. “As soon as it’s paid for, he can see me again, right?”\u003c/p\u003e\n\u003cp\u003eHer father grinned. “That was our agreement.”\u003c/p\u003e\n\u003cp\u003eThe doorbell rang, and before anyone could move, Eddie tore out of his bedroom and raced to the front door. They could hear him talking as he stood with the door open for a minute or two. Then he closed it and came into the family room. He looked around and saw everyone watching him.\u003c/p\u003e\n\u003cp\u003e“Who was it?” Rosie asked.\u003c/p\u003e\n\u003cp\u003e“Allison’s boyfriend. He says he wants to talk to Dad.”\u003c/p\u003e\n\u003cp\u003e“Anson?” Allison was immediately on her feet. “You left him standing out there in the cold?”\u003c/p\u003e\n\u003cp\u003e“He said that’s where he wants to wait, so don’t get all bent out of shape.”\u003c/p\u003e\n\u003cp\u003eZach set aside the newspaper and stood. He exchanged yet another glance with Rosie, arching his brows in obvious surprise. “I’ll be back in a moment.” He pointed his finger at Allison. “And no, I’m not letting him in the house. A deal is a deal.”\u003c/p\u003e\n\u003cp\u003eAllison felt the room close in on her as her father stepped outside. “Mom?” she cried, hardly knowing what she wanted. She found it torture to sit in the same classroom with Anson five days a week and not be allowed to speak. Now this. It killed her to know that the boy she loved was on the other side of the front door, talking to her father. She had no idea what their conversation could possibly be about, and that made it even worse.\u003c/p\u003e\n\u003cp\u003e“Everything will be fine,” her mother assured her as Allison sat down again.\u003c/p\u003e\n\u003cp\u003e“Dad’s not going to do anything, is he?” So far, her father had been cool. He’d been the only one willing to stand up with Anson in court, and he’d helped get him a job, too.\u003c/p\u003e\n\u003cp\u003eIt seemed forever before her father came back in. The instant he did, Allison jumped up and hurried over to him. “What did Anson say?” \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-31.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
