{"id":67249,"no":34,"title":"Page 34","content":"\u003cp\u003eHe didn’t quite meet her eyes, which told her this wasn’t going to be a pleasant conversation.\u003c/p\u003e\n\u003cp\u003e“Is there a problem with my work?” This was her immediate concern, although she couldn’t think of a single incident in which her ability as a P.A. might be questioned.\u003c/p\u003e\n\u003cp\u003e“No, no, nothing like that.” Still he hesitated. “Perhaps we could get a cup of coffee after work.”\u003c/p\u003e\n\u003cp\u003eHad he asked her this as little as three weeks ago, she would’ve leapt at the suggestion.\u003c/p\u003e\n\u003cp\u003e“Is tonight convenient?” he murmured.\u003c/p\u003e\n\u003cp\u003e“Ah…I guess.”\u003c/p\u003e\n\u003cp\u003e“Hey, you can’t go back there.” Sally’s voice rang down the hallway.\u003c/p\u003e\n\u003cp\u003eLinnette spun around and saw Cal.\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed as he read the physician’s name tag.\u003c/p\u003e\n\u003cp\u003eLinnette straightened. Chad had kept his voice low in order to talk privately and she’d leaned close so she could hear him. Anyone happening upon them would’ve assumed they were deep in conversation—a confidential, perhaps even intimate, conversation.\u003c/p\u003e\n\u003cp\u003e“No p-problem,” Cal said, and with that he wheeled around and walked out the door.\u003c/p\u003e\n\u003cp\u003eOnce more Linnette resisted the urge to run after him. She hated to let this relationship go, but no longer felt she had any other choice.\u003c/p\u003e\n\u003cp\u003eThirty-Five\u003c/p\u003e\n\u003cp\u003eOn Valentine’s Day, Grace drove out to visit Olivia rather than head home to an empty house. Jack had recently returned from the hospital where he’d had bypass surgery, and poor Olivia had her hands full. Apparently Jack wasn’t a good patient, which came as no surprise to Grace. Or Olivia either, Grace assumed.\u003c/p\u003e\n\u003cp\u003eShe rang the doorbell and waited a few minutes before Olivia answered, flustered and unkempt, which was completely unlike her. She stared at Grace and her small bouquet of red carnations and seemed about to burst into tears.\u003c/p\u003e\n\u003cp\u003e“Looks like you’ve had a rough day,” Grace said sympathetically.\u003c/p\u003e\n\u003cp\u003e“You don’t know the half of it,” Olivia muttered under her breath.\u003c/p\u003e\n\u003cp\u003eJack sat in the living room, arms crossed and eyes flashing defiance.\u003c/p\u003e\n\u003cp\u003e“Ah,” Grace said, glancing from one to the other. “Did I come at a bad time?”\u003c/p\u003e\n\u003cp\u003e“No,” Olivia insisted.\u003c/p\u003e\n\u003cp\u003e“Yes,” Jack countered.\u003c/p\u003e\n\u003cp\u003e“Perhaps I should come back later?”\u003c/p\u003e\n\u003cp\u003e“Absolutely not,” Olivia said, glaring at her husband.\u003c/p\u003e\n\u003cp\u003eJack sighed his capitulation. “You might as well stay.”\u003c/p\u003e\n\u003cp\u003e“Jack Griffin!”\u003c/p\u003e\n\u003cp\u003e“Sorry, Grace.” He rolled his eyes. “I just wonder if you know how stubborn your best friend can be.”\u003c/p\u003e\n\u003cp\u003e“Olivia?” Grace feigned shock. “Never.”\u003c/p\u003e\n\u003cp\u003e“Et tu, Brute!” Olivia muttered.\u003c/p\u003e\n\u003cp\u003eGrace handed her the flowers and while her friend retreated to the kitchen to find a vase, she sat down across from Jack. “A little overprotective, is she?”\u003c/p\u003e\n\u003cp\u003eHe snickered softly. “How’d you guess?”\u003c/p\u003e\n\u003cp\u003e“I know Olivia.”\u003c/p\u003e\n\u003cp\u003e“She’s become my shadow. I can’t even take a—use the bathroom without her running after me to make sure I’m not going to keel over.”\u003c/p\u003e\n\u003cp\u003e“That’s a natural reaction, don’t you think?” Grace asked. “She nearly lost you, in case you’ve forgotten.”\u003c/p\u003e\n\u003cp\u003e“She’s suffocating me.”\u003c/p\u003e\n\u003cp\u003eOlivia poked her head around the kitchen door. “Are you talking about me behind my back?”\u003c/p\u003e\n\u003cp\u003eGrace wasn’t about to lie. “Of course.”\u003c/p\u003e\n\u003cp\u003eOlivia frowned. “Don’t listen to him. Jack’s trying to do too much too soon.”\u003c/p\u003e\n\u003cp\u003e“I’m following doctor’s orders,” Jack shouted. He turned his attention to Grace again. “Tell her to go back to work. I need some breathing space.”\u003c/p\u003e\n\u003cp\u003eGrace disagreed. “Let her fuss over you. She needs to do that.”\u003c/p\u003e\n\u003cp\u003eJack regarded her, then slowly shook his head. “I suppose you’re right.”\u003c/p\u003e\n\u003cp\u003e“Grace, would you like a cup of tea?” Olivia called.\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003e“I’ll take coffee,” Jack said.\u003c/p\u003e\n\u003cp\u003e“Green tea is better for you.”\u003c/p\u003e\n\u003cp\u003eHe started to argue but apparently changed his mind. “Whatever you think, dear.”\u003c/p\u003e\n\u003cp\u003eThis time Olivia came all the way out of the kitchen. She pointed at Grace. “What did you say to him?”\u003c/p\u003e\n\u003cp\u003eHolding back a smile, Grace said airily, “Oh, just that you love him.”\u003c/p\u003e\n\u003cp\u003eOlivia’s eyes narrowed. “I’m reconsidering that. In all my born days, I’ve never known a man as pigheaded as Jack Griffin.”\u003c/p\u003e\n\u003cp\u003eGrace would hear none of it. “You’re crazy about this man. You love him—you can’t help loving him.”\u003c/p\u003e\n\u003cp\u003eTo her surprise, Olivia laughed. “I do, and he knows it.”\u003c/p\u003e\n\u003cp\u003eA smug look came over Jack. “The thing is, I love her, too.” He held out his hand to Olivia, who clasped it firmly. “I’m sorry, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“Me, too.” She sniffled, then abruptly went back to the kitchen.\u003c/p\u003e\n\u003cp\u003e“We argue,” Jack said. “I don’t think she’s used to that.”\u003c/p\u003e\n\u003cp\u003e“She isn’t,” Grace told him. Her friend, the judge, liked order and control; she rarely raised her voice or lost her cool. Marrying Jack had changed all that.\u003c/p\u003e\n\u003cp\u003e“But we make up, too,” Jack added. “That’s the best part.” He jiggled his eyebrows for effect.\u003c/p\u003e\n\u003cp\u003eGrace smiled. Her friend’s marriage might not be perfect, but she’d never seen Olivia happier. Jack was exactly the kind of man she needed in her life—irreverent, confrontational and fun.\u003c/p\u003e\n\u003cp\u003e“The tea will be ready in a minute,” Olivia said from the kitchen.\u003c/p\u003e\n\u003cp\u003eJack’s eyes softened and he seemed to have forgotten that Grace was in the room. After a moment, he said, “I was sorry to hear about you and Cliff.”\u003c/p\u003e\n\u003cp\u003eRather than comment, Grace nodded. It still hurt to think about Cliff. Much as she wanted to, she couldn’t dismiss him completely from her thoughts. In time, she reasoned, that would get easier.\u003c/p\u003e\n\u003cp\u003e“Things just didn’t work out,” she said as if it were a minor occurrence.\u003c/p\u003e\n\u003cp\u003eOlivia returned then, carrying a tray with three filled cups and a plate of oatmeal cookies.\u003c/p\u003e\n\u003cp\u003e“None for you,” she announced to Jack the instant his eyes widened with delight.\u003c/p\u003e\n\u003cp\u003e“This is cruel and unusual punishment,” he growled.\u003c/p\u003e\n\u003cp\u003e“The doctor wants you down twenty-five pounds.”\u003c/p\u003e\n\u003cp\u003e“Who made you the diet police?”\u003c/p\u003e\n\u003cp\u003e“I did. Do you want to argue some more?” she asked as she passed him a cup of tea.\u003c/p\u003e\n\u003cp\u003e“No, but it’s downright mean of you to tempt me.”\u003c/p\u003e\n\u003cp\u003eOlivia sighed. “All right, you can have one cookie.”\u003c/p\u003e\n\u003cp\u003eAs soon as Jack set down the tea, he grabbed Olivia about the waist and pulled her onto his lap.\u003c/p\u003e\n\u003cp\u003eShe let out a squeal of protest, then threw her arms around his neck. “Do I need to remind you we have company?” she asked.\u003c/p\u003e\n\u003cp\u003e“Am I embarrassing you?” Jack asked his wife.\u003c/p\u003e\n\u003cp\u003e“Terribly.”\u003c/p\u003e\n\u003cp\u003eHe grinned as if that had been his purpose all along. “Good.”\u003c/p\u003e\n\u003cp\u003eOlivia struggled into an upright position, patted her hair and then gave Grace her tea with an air of refinement.\u003c/p\u003e\n\u003cp\u003eGrace stayed long enough to drink her tea and have a cookie and then left. On her way home, she fought a deepening depression. This was Valentine’s Day, and she was alone again. She’d been alone for the last four years, but this year it felt a hundred times worse. Dan had never been much of a gift-giver. He’d made a few attempts over the years but she couldn’t recall a single Valentine card he’d given her, or flowers.\u003c/p\u003e\n\u003cp\u003eButtercup and Sherlock were at the door to greet her. They always showed great enthusiasm about having her home and she rewarded them both with lots of praise and attention. After filling their dishes, she turned on the television. She wasn’t interested in any of the programs, but the TV provided company, the sound of people talking and laughing.\u003c/p\u003e\n\u003cp\u003eWhen the doorbell chimed an hour or so later, she didn’t know who it could be. She wasn’t expecting anyone. Opening the front door, she saw Cliff, and her breath caught. After a slight hesitation, while she fortified her resolve, she opened the door.\u003c/p\u003e\n\u003cp\u003eHe waited on her porch, a bouquet of red roses in hand. At this time of year, Grace knew those flowers must have cost a fortune.\u003c/p\u003e\n\u003cp\u003eWithout a word, he opened the screen door and stepped into the house. He held out the roses. “Can we talk?”\u003c/p\u003e\n\u003cp\u003eThe desire to welcome him back into her life felt like an undertow, about to drag her beneath the waves. She took a deep breath as they just stood there, inside her front door. “I love you, Cliff—but no.”\u003c/p\u003e\n\u003cp\u003eHer answer appeared to shock him. “You won’t even talk to me?”\u003c/p\u003e\n\u003cp\u003e“Why? So you can apologize and then two weeks or two months down the road repeat the same behavior?”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “It won’t happen again. You have my word on that.”\u003c/p\u003e\n\u003cp\u003eShe wanted to believe him, but she couldn’t.\u003c/p\u003e\n\u003cp\u003eHe must have felt her indecision. “I love you, Grace.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you do, but you don’t trust me.”\u003c/p\u003e\n\u003cp\u003eCliff removed his Stetson and studied the floor. “I told you what my marriage was like.”\u003c/p\u003e\n\u003cp\u003e“And I’ve told you I’m not Susan. I made a mistake and I’ve paid dearly for it. I’m sorry, Cliff, truly sorry, but I think you should leave.” Her voice faltered, but her determination didn’t.\u003c/p\u003e\n\u003cp\u003eHe nodded, replacing his hat. “When you said we were through, I thought breaking it off completely might be for the best. What you said was right on target. The way I treated you wasn’t intentional—but in a sense it was. I see that now. I suppose I was hoping you’d put an end to the relationship….”\u003c/p\u003e\n\u003cp\u003eHis honesty hurt, but she kept her chin high and didn’t comment. He confirmed everything she’d suspected.\u003c/p\u003e\n\u003cp\u003e“Then you were out of my life, and I was more miserable than before. Every day I found myself missing you so much. I had a hole in my heart and in my life. I realized I was the biggest fool on earth to let you go.” He paused, shaking his head. “Lisa and I talk every week. Sometimes she knows me better than I do myself. She said if I let you walk away, I’d regret it the rest of my life.”\u003c/p\u003e\n\u003cp\u003e“So Lisa prompted this?” Cliff loved his daughter and listened to her when he would listen to no one else.\u003c/p\u003e\n\u003cp\u003e“No,” he said quickly. “She was just telling me what I already knew.” Before Grace could speak, he told her, “Lisa isn’t the only one. Cal said either I patch things up with you or he’s quitting.”\u003c/p\u003e\n\u003cp\u003eGrace managed a half smile. “I don’t believe that for a moment.”\u003c/p\u003e\n\u003cp\u003e“Believe it. If you turn down my proposal, Grace, I might as well not go home.”\u003c/p\u003e\n\u003cp\u003eTears filled her eyes. If Cliff Harding was proposing to her on Valentine’s Day, she didn’t think she’d ever forgive him for being so romantic. He made it almost impossible to say no.\u003c/p\u003e\n\u003cp\u003e“I love you, Grace,” he whispered. “I can’t live without you any longer. I tried, but nothing seemed any good. I’m working hard—and for what? I don’t need the money. At the end of the day, I walk in from the cold and the house is dark and lonely. That’s the way I feel without you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-34.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
