{"id":67258,"no":43,"title":"Page 43","content":"\u003cp\u003eHer friend had moved in with Cliff, bringing Buttercup and Sherlock, who seemed to be adjusting nicely to their new quarters.\u003c/p\u003e\n\u003cp\u003eAs she began to read her next brief, a knock sounded at her office door. It was Deputy Mike Lusk. “There’s a man asking to see you, name of David Rhodes. Says he’s your stepbrother. Should I bring him over?”\u003c/p\u003e\n\u003cp\u003eOlivia hesitated briefly, then said, “Please. Show him in.”\u003c/p\u003e\n\u003cp\u003eThe deputy nodded. “I’ll wait outside until you’re through.”\u003c/p\u003e\n\u003cp\u003e“I’d appreciate that.”\u003c/p\u003e\n\u003cp\u003eSoon, an attractive man, probably in his midforties, was escorted into her chambers. He smiled widely when he saw her. “Judge Olivia Griffin?” he asked, extending his hand.\u003c/p\u003e\n\u003cp\u003eShe nodded and they exchanged brisk handshakes.\u003c/p\u003e\n\u003cp\u003e“I’m David Rhodes, Ben’s son. It appears we’re related!”\u003c/p\u003e\n\u003cp\u003eOlivia remembered hearing some story about David; however, whatever it was didn’t immediately come to mind. She did recall that her mother and Ben had joined him in Seattle for dinner. Her mother had raved about the restaurant and the wonderful meal they’d had. Olivia also had a vague memory of something Justine had said; apparently she’d met him, too.\u003c/p\u003e\n\u003cp\u003e“I was hoping for a few minutes of your time, if that would be possible.” He didn’t wait for a response but walked into her office and immediately sat down in the guest chair.\u003c/p\u003e\n\u003cp\u003e“Of course,” she said, her tone a little ironic. “Make yourself comfortable.” She glanced at her watch. “I told my husband I’d be home by five-forty-five, so we can talk for ten or fifteen minutes.”\u003c/p\u003e\n\u003cp\u003e“That’s fine.” He leaned back, crossing his legs, and surveyed the room. The cut of his suit told Olivia it was expensive, possibly cashmere. The polished loafers, the silk tie—this was a man who liked to spend money.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?” she asked, getting directly to the point.\u003c/p\u003e\n\u003cp\u003e“Ah, a woman who prefers to skip the small talk.” He smiled approvingly. “I like a no-nonsense attitude.”\u003c/p\u003e\n\u003cp\u003eHis charm left her cold, although she could see why some people were swayed by it. David Rhodes was probably an experienced manipulator who relied on good looks and superficial wiles. “As I explained, I have an appointment.”\u003c/p\u003e\n\u003cp\u003e“But it’s with your husband.”\u003c/p\u003e\n\u003cp\u003eHe sounded as if he thought she didn’t need to worry, since it was only Jack. Olivia was almost sure she didn’t like Ben’s son and tried to remember what she’d heard. With Jack’s heart attack, she’d missed a lot of details during the last two months.\u003c/p\u003e\n\u003cp\u003e“I’ve been to Cedar Cove twice now,” David said conversationally. “This is a tight community, isn’t it? People know people, neighbors talk to neighbors. It’s that sort of town.”\u003c/p\u003e\n\u003cp\u003e“We think of ourselves as the kind of place anyone would like to call home.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “A good PR line,” he said, but before she could respond to his cynicism, he forged ahead. “I imagine you know the other judges fairly well.”\u003c/p\u003e\n\u003cp\u003e“Yes…” she said hesitantly.\u003c/p\u003e\n\u003cp\u003e“The police, too.”\u003c/p\u003e\n\u003cp\u003e“We’re proud of our low crime rate.” Cedar Cove had its share of crime; no community was immune. But Olivia liked to think she didn’t need to lock her door when she left for the day. As a matter of habit she did, but often wondered if it was necessary.\u003c/p\u003e\n\u003cp\u003eDavid clasped his hands loosely together. “I can understand why Dad enjoys life in Cedar Cove as much as he does. We had no connections to this town when he moved here, so my brother and I were both surprised. We assumed he’d want to live in Seattle, but Cedar Cove seems to have all the benefits of the big city.”\u003c/p\u003e\n\u003cp\u003e“We’re only a ferry ride away.” It was the best of both worlds, in Olivia’s opinion. She enjoyed small-town life and yet she could take advantage of the cultural opportunities Seattle provided.\u003c/p\u003e\n\u003cp\u003e“Dad has certainly fallen for Cedar Cove—and your mother,” David said.\u003c/p\u003e\n\u003cp\u003e“We love your father. He’s given my mother a new lease on life,” Olivia murmured.\u003c/p\u003e\n\u003cp\u003eDavid gestured toward her. “That brings up another matter,” he said, grinning. “My father married your mother, which makes the two of us stepbrother and sister, right?”\u003c/p\u003e\n\u003cp\u003e“I guess it does.” Olivia wished he’d get to the point. She’d worked with enough attorneys to recognize that this wasn’t a social visit. David Rhodes wanted something.\u003c/p\u003e\n\u003cp\u003e“I’ve never had a sister before,” he said, and there was a quality of wonderment in his voice that got on her nerves. This guy should be in community theater.\u003c/p\u003e\n\u003cp\u003e“You’ll meet Steve later on,” he told her.\u003c/p\u003e\n\u003cp\u003e“I’m sure I will.” She glanced at her watch again, hoping he’d take the hint.\u003c/p\u003e\n\u003cp\u003e“I was thinking we should all get together for Easter,” David suggested. “It’s too late to arrange a full family gathering this year,” he added quickly. “But maybe next year. We could invite both sides, get to know each other.”\u003c/p\u003e\n\u003cp\u003e“I’ll keep it in mind.” Olivia was fast losing her patience. “Is there something I can do for you?” she asked pointedly.\u003c/p\u003e\n\u003cp\u003eDavid took an audible breath. “As it happens, there is,” he said in a confidential tone. “I was in town a few weeks back and due to a misunderstanding—well, it’s not important to discuss the details.” He shook his head, implying that he found all of this distressing. “I ended up leaving in a rush, and I’m afraid I was driving above the speed limit.” He laughed, as though embarrassed to trouble her. “I was pulled over by a police officer. Unfortunately I must’ve given him the wrong impression.”\u003c/p\u003e\n\u003cp\u003eThat meant his problem was more than a speeding offense. “What happened?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“The officer—now, I’m sure he was only doing what he thought was his duty—”\u003c/p\u003e\n\u003cp\u003e“He gave you a ticket.” She’d leave him to fill in the blank. At least now she knew what this was about. David Rhodes wanted her to fix the mess he’d gotten himself into.\u003c/p\u003e\n\u003cp\u003e“Actually, this must’ve been one of your junior officers,” David said. “He was a little too eager to get his quota, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003e“We don’t have ticket quotas in Cedar Cove.” She didn’t work in traffic court, but she knew the system.\u003c/p\u003e\n\u003cp\u003e“The officer apparently took a dislike to me, I’m sorry to say. I didn’t help matters, I suppose,” David admitted with a look of chagrin. “I thought he had a bad attitude. Anyhow, one thing led to another—and now it’s a bit of a disaster.”\u003c/p\u003e\n\u003cp\u003e“What was the ticket for?” Olivia asked, tired of having to ferret out each kernel of information.\u003c/p\u003e\n\u003cp\u003e“Speeding—but I wasn’t speeding,” David insisted. “I have a signed statement here from a mechanic that states my speedometer was faulty.” He extracted a folded sheet of paper from inside his jacket and held it out.\u003c/p\u003e\n\u003cp\u003e“David,” she warned, “put that away. I don’t want to see it. Just tell me what else you were charged with.”\u003c/p\u003e\n\u003cp\u003eHe heaved a sigh. “Negligent driving,” he confessed. “It was a simple misunderstanding that got out of hand. I can’t even begin to tell you what this’ll do to my car insurance rates. Normally I’d just pay for the ticket and be done with it. But it’s going to be more difficult than that. My insurance company is threatening to cancel my policy and then I’ll have to find another one, and my rates will skyrocket.”\u003c/p\u003e\n\u003cp\u003e“You haven’t paid the ticket?”\u003c/p\u003e\n\u003cp\u003e“No. You see, I’m experiencing a bit of a cash flow problem at the moment. I figured it’d be fifty bucks or so and if it was, I’d pay it and write off the entire matter. Unfortunately, the fine is more than three hundred dollars—and then there’s this dilemma with my insurance company. I need this whole thing to go away. The best way to make that happen is to throw myself on the mercy of the court.” He laughed lightly. “Then I learned that my very own sister is an influential member of the Kitsap County Court.”\u003c/p\u003e\n\u003cp\u003e“I see.” Boy, did she.\u003c/p\u003e\n\u003cp\u003eDavid shook his head, as though embarrassed to trouble her with anything this trivial. “I was hoping you’d help me out. A brief conversation with the Traffic Court judges…”\u003c/p\u003e\n\u003cp\u003eOlivia relaxed in her chair and crossed her arms. “I’m afraid it doesn’t work like that.”\u003c/p\u003e\n\u003cp\u003e“You just said you were friendly with the other judges.”\u003c/p\u003e\n\u003cp\u003e“Yes—on a social basis. It doesn’t mean I can or will involve myself in any situation that would contravene the law. My relationship with my fellow judges can’t help you.”\u003c/p\u003e\n\u003cp\u003e“Of course it can,” he argued. “You talk to them, and my little issue with the Cedar Cove police will go away.” He leaned close and lowered his voice to a whisper. “All you have to do is snap your fingers.”\u003c/p\u003e\n\u003cp\u003e“No. I can’t do it.” She spoke slowly, deliberately. Olivia couldn’t make her position any plainer than that.\u003c/p\u003e\n\u003cp\u003eHis jaw tightened. “In other words, you won’t help me.”\u003c/p\u003e\n\u003cp\u003e“There’s no other words about it. I don’t know how the judicial system works wherever you live, but we don’t fix traffic tickets here in Cedar Cove. If you broke the law, I suggest you step forward and deal with the consequences of your actions.”\u003c/p\u003e\n\u003cp\u003eOlivia found her stepbrother to be a decidedly unpleasant man, despite his glib and rather overstated charm. Then it clicked. “Just a minute here,” she said, bolting to her feet. “You’re the one my daughter was telling me about.”\u003c/p\u003e\n\u003cp\u003e“Hey, hey,” he said, raising both hands. “I haven’t dated any women in this town—and definitely not your daughter. Who is she, anyway?”\u003c/p\u003e\n\u003cp\u003e“Justine Gunderson. You were at her restaurant.”\u003c/p\u003e\n\u003cp\u003eHis smile faded. “Your daughter owns The Lighthouse?”\u003c/p\u003e\n\u003cp\u003e“My daughter and son-in-law.”\u003c/p\u003e\n\u003cp\u003eDavid’s eyes went hard with a look that set Olivia’s heart pounding. “Your daughter took that check right out of my hand,” he said from between gritted teeth. “She interfered in something that was none of her damned business.”\u003c/p\u003e\n\u003cp\u003eShe suddenly remembered exactly what she’d heard about David Rhodes. She rose from her chair. “You were trying to cheat my mother out of five thousand dollars.”\u003c/p\u003e\n\u003cp\u003eDavid leapt to his feet. “It was a loan,” he insisted, his eyes on fire. “I fully intended to pay her back in two or three weeks. She’s a lovely woman, kindhearted and generous. Apparently none of those traits were handed down to anyone else in the family.”\u003c/p\u003e\n\u003cp\u003eOlivia wasn’t going to allow him to insult her in her own office. “I think it’s time you left, Mr. Rhodes.” She walked around her desk and opened the door. “Officer Lusk,” she called.\u003c/p\u003e\n\u003cp\u003eMike Lusk walked purposefully in her direction. “Would you kindly escort Mr. Rhodes out of this building?”\u003c/p\u003e\n\u003cp\u003eMike stepped forward and planted his hands on his wide belt. “This way, Mr. Rhodes.”\u003c/p\u003e\n\u003cp\u003e“Hell of a way to start off our relationship,” David snarled as he moved past her. \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-43.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
