{"id":67262,"no":47,"title":"Page 47","content":"\u003cp\u003eThe parking lot was dark, only fitfully illuminated by nearby streetlights. Approaching her car, keys in hand, Rachel stopped abruptly when a tall, lean man came out of the shadows. Terrified, she couldn’t move.\u003c/p\u003e\n\u003cp\u003eUntil the man spoke.\u003c/p\u003e\n\u003cp\u003e“Rachel, it’s Nate.”\u003c/p\u003e\n\u003cp\u003eShe felt instantly weak until the anger kicked in, rescuing her. “You scared me out of ten years of my life,” she snapped. “What do you think you’re doing, hiding in the shadows like that?”\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“You should be!”\u003c/p\u003e\n\u003cp\u003eHe held up both hands. “All I wanted to do was talk. I wasn’t interested in starting World War Three.”\u003c/p\u003e\n\u003cp\u003e“You should’ve thought of that before you came sneaking up on me.” Just then, Jane drove by and slowed down as if to check out the situation. As soon as she recognized Nate, a gigantic smile formed and with a wave, she drove off.\u003c/p\u003e\n\u003cp\u003eUndeterred, Rachel went on. “You’re lucky I didn’t gouge out your eyes with my car key.” The anger concealed her elation. Rachel didn’t want to be this happy, and that made her feel even angrier at herself for reacting to him. “Furthermore,” she added in a flustered voice, “why are you lurking in the shadows like…like some stalker?” She inserted her key in the lock and yanked open the door.\u003c/p\u003e\n\u003cp\u003e“Like I said, I came to talk to you.” He didn’t back down. They stood several feet apart—which was too close. Far too close.\u003c/p\u003e\n\u003cp\u003e“I love you, Rachel. I can’t help it. I was going to let you have your own way, but I couldn’t do it.”\u003c/p\u003e\n\u003cp\u003eShe wished he hadn’t said that. Every time he opened his mouth she weakened a little more. “This is not a good idea.”\u003c/p\u003e\n\u003cp\u003e“I happen to think it’s an excellent idea.” He advanced one small step toward her.\u003c/p\u003e\n\u003cp\u003eHeart pounding, Rachel held out her arm. “Stop right where you are.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I’ll call for a security guard.”\u003c/p\u003e\n\u003cp\u003eStill he came. “You do that.”\u003c/p\u003e\n\u003cp\u003e“Nate…no.” But he reached her and gently took her by the shoulders and brought her toward him. She couldn’t fight him. Instead, the minute he touched her, she swayed into his arms as if she belonged there. When he kissed her, she had to grab his shirt collar just to remain upright.\u003c/p\u003e\n\u003cp\u003e“Rachel, Rachel,” he murmured between kisses that left her clinging and breathless. “Why did you shut me out of your life?”\u003c/p\u003e\n\u003cp\u003eIf he hadn’t said anything, she might have forgotten, at least for the length of another kiss. But, no, he had to go and remind her why a relationship was impossible.\u003c/p\u003e\n\u003cp\u003eShe forced herself to pull away, then dragged in a deep breath and prayed she could get enough oxygen into her brain to think clearly.\u003c/p\u003e\n\u003cp\u003e“Oh, no, you don’t,” he protested. “I’m not letting you go that easily.”\u003c/p\u003e\n\u003cp\u003e“Nate—it won’t work.”\u003c/p\u003e\n\u003cp\u003e“Who says?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Then you’re wrong. I love you.”\u003c/p\u003e\n\u003cp\u003e“You don’t even know me.” He was making this more difficult than it had to be. “I’m just another way to thumb your nose at your family. I…refuse—don’t you dare kiss me again! Oh…Oh.” The fight went out of her as his mouth found hers. His kisses were hungry and demanding and each seemed more potent than the one before. Her knees wobbled and her heart fluttered and if she didn’t do something soon, they’d end up at her house, in her bed….\u003c/p\u003e\n\u003cp\u003e“Let’s get out of here,” Nate said, his breathing uneven.\u003c/p\u003e\n\u003cp\u003e“No.” Where she found the strength to deny him anything, she didn’t know. “I told you, this won’t work.”\u003c/p\u003e\n\u003cp\u003eHe gripped her shoulders and his eyes bore into hers. “I’m only going to say this once, so listen carefully.”\u003c/p\u003e\n\u003cp\u003eAt his touch she was dumbfounded.\u003c/p\u003e\n\u003cp\u003e“Do you understand me?”\u003c/p\u003e\n\u003cp\u003eSomehow, she managed to nod.\u003c/p\u003e\n\u003cp\u003e“Good. Rachel Pendergast, I love you. I am my own person. I always have been. I love my parents, but I won’t allow them to dictate my life. My father is a congressman. I’m a Warrant Officer in the United States Navy. It’s a job I enjoy and a rank I earned by my own merit. Understand?”\u003c/p\u003e\n\u003cp\u003eAgain she nodded.\u003c/p\u003e\n\u003cp\u003e“My father doesn’t tell me what to do—or who to love. I make my own decisions. Got it?”\u003c/p\u003e\n\u003cp\u003e“Yes, but—”\u003c/p\u003e\n\u003cp\u003e“No buts. I love you.”\u003c/p\u003e\n\u003cp\u003eRachel hung her head. “Don’t love me. Please, don’t love me.”\u003c/p\u003e\n\u003cp\u003eHe lifted her chin so she couldn’t avoid meeting his gaze. “Sorry, it’s too late.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“Are you going to argue with me?”\u003c/p\u003e\n\u003cp\u003e“I…oh, Nate.” She threw her arms around him. “I missed you, too—so much.”\u003c/p\u003e\n\u003cp\u003eHe sighed deeply, and slipped both arms about her waist, lifting her off the ground. “It took you long enough.”\u003c/p\u003e\n\u003cp\u003e“I’m frightened,” she whispered. And she was. If they permitted this relationship to continue, the time would come when she’d have to meet his family. It went without saying that they wouldn’t approve; there was absolutely nothing to endear her to his parents. No status, no wealth, no education to speak of. She’d been raised by an aunt who’d died when she was nineteen, and she’d been on her own from that point forward. Dogs at the pound had a better pedigree than she did.\u003c/p\u003e\n\u003cp\u003e“I don’t have any family,” she said, ashamed to admit this to a man who had such an important one.\u003c/p\u003e\n\u003cp\u003e“You’ve got me.”\u003c/p\u003e\n\u003cp\u003e“Do I?” She sighed. “Why do you make this so hard? Why won’t you just let me go?”\u003c/p\u003e\n\u003cp\u003e“Because you’re worth keeping. Now, no more arguing. We’re going to talk.”\u003c/p\u003e\n\u003cp\u003eReluctantly she agreed. He drove them to the Pancake Palace, where they sat in one of the old-fashioned booths. They couldn’t stop staring at each other. When the waitress came, they both ordered coffee and banana splits, but the ice cream melted and the coffee grew cold before they even noticed it.\u003c/p\u003e\n\u003cp\u003eFinally Rachel reached for her spoon, then put it down again. “All right. Seeing that you’re the one with the big ideas, where do we go from here?”\u003c/p\u003e\n\u003cp\u003e“Right where we left off when I shipped out.”\u003c/p\u003e\n\u003cp\u003e“And where was that?”\u003c/p\u003e\n\u003cp\u003e“We were dating. You were my girl, and I was your bachelor prize.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Nate, that sounds like something out of a 1950s movie. I should be wearing saddle shoes and a poodle skirt, and we should be listening to Bobby Darrin.”\u003c/p\u003e\n\u003cp\u003e“I’m sure they have some Bobby Darrin on the jukebox here,” he murmured.\u003c/p\u003e\n\u003cp\u003e“What about Bruce?” she asked.\u003c/p\u003e\n\u003cp\u003e“I think it might be a good idea if you told him you won’t be seeing him anymore.” Nate leaned all the way over and pressed his lips to hers. “You’ve already got one steady,” he said. “You don’t need two.”\u003c/p\u003e\n\u003cp\u003eSteady? Sandra Dee and Frankie Avalon were going to waltz in here any minute.\u003c/p\u003e\n\u003cp\u003eStill, she knew what Nate meant—and she knew he was right. Jolene would be unhappy, but Rachel’s confused relationship with Bruce simply couldn’t go on.\u003c/p\u003e\n\u003cp\u003eForty-Nine\u003c/p\u003e\n\u003cp\u003eAllison woke to the sound of a light tap on her bedroom window. Her heart flew to her throat and she gasped. It could only be Anson. She didn’t care what time of day or night it was, she had to talk to him. In her eagerness to get to the window, she nearly fell out of bed.\u003c/p\u003e\n\u003cp\u003eSure enough, Anson stood there in the yard, his shoulders hunched against the cold March wind. In the faint moonlight she could see that he wore his black coat and watch cap and was peering into the darkened room. When she approached the window, he stepped back. Without question Allison opened it for him.\u003c/p\u003e\n\u003cp\u003e“Anson,” she cried. “Where have you been? I’ve been worried sick about you.” It was two weeks since she’d seen him, that day in the mall. He hadn’t been to school. None of his friends seemed to know where he was. He’d vanished; no one had seen him anywhere. When she broke down and phoned his mother, Mrs. Butler didn’t show any interest or concern.\u003c/p\u003e\n\u003cp\u003eAnson didn’t answer nor did he climb inside her bedroom, as he had the last time he’d visited her in the middle of the night.\u003c/p\u003e\n\u003cp\u003e“Come in,” she urged. “It’s cold.” She moved aside, but he remained out in the wind and the cold. “Anson,” she said, “get in here! You must be half frozen.”\u003c/p\u003e\n\u003cp\u003e“No!” He shook his head wildly. “The only reason I’m here is to say goodbye.”\u003c/p\u003e\n\u003cp\u003e“Goodbye?” Her mind was spinning. “Why? Where are you going?”\u003c/p\u003e\n\u003cp\u003eHe shrugged as if that was of no significance. “I don’t know yet.”\u003c/p\u003e\n\u003cp\u003eAllison rubbed her hands up and down her arms, shivering with cold. “Come in. We need to talk.”\u003c/p\u003e\n\u003cp\u003eAgain Anson refused. If anything, he moved back another step.\u003c/p\u003e\n\u003cp\u003e“Please,” she added softly.\u003c/p\u003e\n\u003cp\u003eHe considered it for a moment. “I can’t,” he finally muttered. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eHe seemed to steel himself against her. “Like I said, the only reason I’m here is to tell you I won’t be seeing you anymore.”\u003c/p\u003e\n\u003cp\u003eThe shock of his words felt like a slap across her face. “You don’t mean that! You can’t mean that.” She swallowed down the hurt and disappointment. “I love you.”\u003c/p\u003e\n\u003cp\u003e“Well, don’t,” he said sharply, as if her confession had angered him. “In case you haven’t figured it out yet, I’m a loser. I’m not going anyplace but down.”\u003c/p\u003e\n\u003cp\u003e“That’s not true!” But Anson wasn’t listening.\u003c/p\u003e\n\u003cp\u003e“I don’t want to drag you down, too,” he said.\u003c/p\u003e\n\u003cp\u003e“Don’t say that,” she argued hotly, furious that he’d say it about himself. “You’re not a loser. You’re not.” She suspected he was just repeating what his mother had told him all his life.\u003c/p\u003e\n\u003cp\u003e“Your dad’s a good guy,” he said. “Thank him for me, all right?” He started to turn away.\u003c/p\u003e\n\u003cp\u003e“Don’t go.” She leaned out of the window and grabbed for him. She would’ve fallen onto the ground if Anson hadn’t caught her. Once she was in his embrace, practically dangling from the window, she wrapped her arms around his neck and kissed him. At first he resisted and attempted to shove her away. But soon he was returning her kisses. Then, apparently reaching some decision, he tore his mouth from hers and pulled back.\u003c/p\u003e\n\u003cp\u003e“Please,” she begged. “Come in so we can talk about this properly. Don’t walk away from me—not like this.”\u003c/p\u003e\n\u003cp\u003eReluctantly he nodded. While he climbed in through the bedroom window, Allison found her thick fleece housecoat and put it on. Shivering, still shaking with cold, she tied the sash around her waist.\u003c/p\u003e\n\u003cp\u003eAnson sat on the end of her bed, his head lowered. “Nothing you say is going to change my mind.”\u003c/p\u003e\n\u003cp\u003e“You love me,” she whispered, kneeling on the floor in front of him. “Don’t deny it, because I know it’s true.”\u003c/p\u003e\n\u003cp\u003eHe closed his eyes, a tortured expression on his face. “I shouldn’t have come,” he muttered. She suspected he said it more for his own benefit than hers. \u003c/p\u003e","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-47.html","bookId":1945,"creation":"Oct 5, 2019 10:04:30 AM","modification":"Oct 5, 2019 10:04:30 AM"}
