{"id":16545,"no":2,"title":"CHAPTER II THE HOME","content":"\u0026nbsp;While Lodrix summoned the people, the chief rushed out to pull back the drawbridge which connected their homes with the land. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lake people were very much frightened. They knew that the people on land were their enemies; so they were ready to obey every command of their chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n First he called for the messenger who had brought the news.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A youth with a deer hanging from his shoulder stepped forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Laying the deer at the chief’s feet, the boy said, “My chief! As I was hunting, I met the boy Tevico, whom you once saved from the wolves in the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He told me that his tribe was getting ready to make war upon us and to burn our dwellings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I hurried here to tell you, that we, too, might prepare for war.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Lodrix, running into the house, shouted, “O father! Come quickly!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Out rushed the chief, followed by his people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What they saw made them tremble with fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the shore of the lake stood hundreds of people waving their stone axes and shouting in great anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief had pulled up the drawbridge just in time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the Bear people found they could not reach the Lake-Dwellers, they went away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief of the Dormorants told his people that they must keep close watch, for their enemies would surely come back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After choosing men to guard the village, the people went back to their homes, while the chief and his son went into the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They sat down on the blocks of wood which were the only furniture of their home; then Lodrix watched his mother skin the deer with the sharp stone knife, and his father light the fire in the stone fireplace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief was so hungry that he ate the deer meat nearly raw.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lodrix did not care for the meat, but ate some cakes which had been made from powdered grain and cooked on the hot stones. He ate some sour cherries too, and plums which had been picked from the trees on the shore of the lake and dried.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2767/76333.html","bookId":1335,"creation":"Aug 2, 2019 7:50:45 AM","modification":"Aug 2, 2019 7:50:45 AM"}
