{"id":16547,"no":4,"title":"CHAPTER IV ON SHORE","content":"\u0026nbsp;So the little boy went into the house and was soon fast asleep. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The mother lay down on a bearskin and rested her head on a clay crescent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Lake-Dweller women needed these head-rests because they did not take down their hair when they slept, and the bronze and bone pins made their heads very heavy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And now while the men were on guard peace rested upon the village of the Dormorants.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day, the watchers slept while others took their places.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For three days, the Lake-Dwellers looked for signs of the enemy, but the Bear tribe seemed to have forgotten them and to have returned to their homes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If the Lake-Dweller chief had been on land, he might have seen some of the Bear tribe hiding behind the tall oak and cedar trees in the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were watching to see what the lake people would do, and to report what they saw to their chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the fourth day, when everything seemed quiet, the chief of the Dormorants ordered the drawbridge to be put in place, and stationed a man at the end to watch for the enemy. Then he sent a messenger to the chief of a Lake-Dweller village near by.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The messenger was to ask the chief to be ready at any time to help the Dormorants, if the Bear tribe should attack them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the chief ordered his men to be prepared for battle at any moment, because he was afraid that the enemy would soon try again to reach the village.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He ordered them to sharpen their swords, lances and axes, and get ready their bows and arrows.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lodrix was so excited that he could not keep still, and almost hoped that the enemy would come back, so that he might have a chance to fight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief’s son had never been in a battle, and he was anxious to take part in one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He begged his father to let him take the sword which hung in the bronze scabbard on the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his father gave him another sword, because the one in the scabbard was too large and heavy for a young boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lodrix was very proud of his sword, and ran about showing it to his friends.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon the men were ready to start. Some of them lowered their cedar dugouts, and climbed down the notched poles with their fishing spears in their hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They paddled to that part of the lake where they knew they could catch some fine fish.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Others crossed the bridge, with their bows and arrows hanging from their shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They wished to kill some deer in the forest and cut down some cedar trees for fire-wood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lodrix pleaded so hard to go hunting that his father said he might go, so he started off with the men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They stopped to look at the fruit trees growing along the shore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is the fruit?” asked Lodrix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Bear people have taken it!” answered one of the men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “See! They have taken our grain, too!” said another.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This made Lodrix wish more than ever that he might fight these people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew his father would be angry, too, when they told him what had been done.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They wondered where they would get food for the winter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They knew they must work very hard to get the soil ready for more grain, and that they must fish and hunt a great deal or they would have no dried meat to store away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These thoughts made them very sad, and they did not say much as they walked on through the forests.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2767/76335.html","bookId":1335,"creation":"Aug 2, 2019 7:50:51 AM","modification":"Aug 2, 2019 7:50:51 AM"}
