{"id":14282,"no":17,"title":"CHAPTER XVI. BEN MEETS AN OLD FRIEND.","content":"\u0026nbsp;Ben had about half an hour to wait for the arrival of the steamer. Among the passengers who crossed the plank from the steamer to the pier was a gentleman of middle age, and a boy about a year younger than Ben. The boy had a carpet-bag in his hand; the father, for such appeared to be the relationship, carried a heavy valise, besides a small bundle. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Want your baggage carried?\" asked Ben, varying his usual address.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The gentleman hesitated a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better let him take it, father,\" said the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, you may take this;\" and the valise was passed over to Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me the bag too,\" said Ben, addressing the boy.[Pg 181]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027ll take that. You\u0027ll have all you want to do, in carrying the valise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They crossed the street, and here the gentleman stood still, evidently undecided about something.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you thinking about, father?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was thinking,\" the gentleman said, after a slight pause, \"what I had better do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have two or three errands in the lower part of the city, which, as my time is limited, I should like to attend to at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better do it, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What I was thinking was, that it would not be worth while for you to go round with me, carrying the baggage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Couldn\u0027t I go right up to Cousin Mary\u0027s?\" asked his son.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid you might lose the way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This boy will go with me. I suppose he knows the way all about the city. Don\u0027t you?\" he asked, turning to Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you want to go?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To No.—Madison Avenue.\"[Pg 182]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I can show you the way there well enough, but it\u0027s a good way off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can both take the cars or stage when you get up to the Astor House.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How will that do?\" asked Charles, for this was his name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think that will be the best plan. This boy can go with you, and you can settle with him for his services. Have you got money enough?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, plenty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will leave you here, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Left to themselves, it was natural that the two boys should grow social. So far as clothing went, there was certainly a wide difference between them. Ben was attired as described in the first chapter. Charles, on the other hand, wore a short sack of dark cloth, a white vest, and gray pants. A gold chain, depending from his watch-pocket, showed that he was the possessor of a watch. His whole appearance was marked by neatness and good taste. But, leaving out this difference, a keen observer might detect a considerable resemblance in the features of the two boys. Both had dark hair, black eyes, and the con[Pg 183]tour of the face was the same. I regret to add, however, that Ben\u0027s face was not so clean as it ought to have been. Among the articles contributed by the boys who lived in the room under the wharf, a washstand had not been considered necessary, and it had been long since Ben had regarded washing the face and hands as the first preparation for the labors of the day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles Marston looked at his companion with some interest and curiosity. He had never lived in New York, and there was a freshness and novelty about life in the metropolis that was attractive to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this your business?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What,—smashin\u0027 baggage?\" inquired Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that what you call it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, is that what you do for a living?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Ben. \"It\u0027s my profession, when I aint attendin\u0027 to my duties as a member of the Common Council.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you\u0027re a member of the city government?\" asked Charles, amused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"[Pg 184]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you have much to do that way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m one of the Committee on Wharves,\" said Ben. \"It\u0027s my business to see that they\u0027re right side up with care; likewise that nobody runs away with them in the night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you get paid?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I earn my lodgin\u0027 that way just now,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you always been in this business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. Sometimes I\u0027ve sold papers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you like that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I like baggage-smashin\u0027 best, when I get enough to do. You don\u0027t live in the city, do you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I live just out of Boston,—a few miles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ever been in New York before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Once. That was four years ago. I passed through on the way from Pennsylvania, where I used to live.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pennsylvania,\" repeated Ben, beginning to be interested. \"Whereabouts did you live there,—in Philadelphy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, a little way from there, in a small town named Cedarville.\"[Pg 185]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben started, and he nearly let fall the valise from his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter?\" asked Charles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came near fallin\u0027,\" said Ben, a little confused. \"What\u0027s your name?\" he asked, rather abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Charles Marston.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben scanned intently the face of his companion. He had good reason to do so, for though Charles little suspected that there was any relationship between himself and the ragged and dirty boy who carried his valise, the two were own cousins. They had been school-mates in Cedarville, and passed many a merry hour together in boyish sport. In fact Charles had been Ben\u0027s favorite playmate, as well as cousin, and many a time, when he lay awake in such chance lodgings as the street provided, he had thought of his cousin, and wished that he might meet him again. Now they had met most strangely; no longer on terms of equality, but one with all the outward appearance of a young gentleman, the other, a ragged and ignorant street boy. Ben\u0027s heart throbbed painfully when he saw that his cousin regarded him as a stranger,[Pg 186] and for the first time in a long while he felt ashamed of his position. He would not for the world have revealed himself to Charles in his present situation; yet he felt a strong desire to learn whether he was still remembered. How to effect this without betraying his identity he hardly knew; at length he thought of a way that might lead to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name\u0027s shorter\u0027n yours,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\" asked Charles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That stands for Benjamin; so yours is the longest after all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so, I never thought of that. Everybody calls me Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s your other name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben hesitated. If he said \"Brandon\" he would be discovered, and his pride stood in the way of that. Finally he determined to give a false name; so he answered after a slight pause, which Charles did not notice, \"My other name is Hooper,—Ben Hooper. Didn\u0027t you ever know anybody of my name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What,—Ben Hooper?\"[Pg 187]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I had a cousin named Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he as old as you?\" asked Ben, striving to speak carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is older if he is living; but I don\u0027t think he is living.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, don\u0027t you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He ran away from home when he was ten years old, and we have never seen him since.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t he write where he had gone?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wrote one letter to his mother, but he didn\u0027t say where he was. That is the last any of us heard from him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What sort of a chap was he?\" inquired Ben. \"He was a bad un, wasn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Ben wasn\u0027t a bad boy. He had a quick temper though; but whenever he was angry he soon got over it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made him run away from home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His father punished him for something he didn\u0027t do. He found it out afterwards; but he is a stern man, and he never says anything about him. But I guess he feels bad sometimes. Father says[Pg 188] he has grown old very fast since my cousin ran away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is his mother living,—your aunt?\" Ben inquired, drawn on by an impulse he could not resist.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but she is always sad; she has never stopped mourning for Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you like your cousin?\" Ben asked, looking wistfully in the face of his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he was my favorite cousin. Poor Ben and I were always together. I wish I knew whether he were alive or not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you will see him again some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I used to think so; but I have about given up hopes of it. It is six years now since he ran away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe he\u0027s turned bad,\" said Ben. \"S\u0027posin\u0027 he was a ragged baggage-smasher like me, you wouldn\u0027t care about seein\u0027 him, would you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I would,\" said Charles, warmly. \"I\u0027d be glad to see Ben again, no matter how he looked, or how poor he might be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben looked at his cousin with a glance of wistful[Pg 189] affection. Street boy as he was, old memories had been awakened, and his heart had been touched by the sight of the cousin whom he had most loved when a young boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I might be like him,\" thought Ben, looking askance at the rags in which he was dressed, \"instead of a walkin\u0027 rag-bag. I wish I was;\" and he suppressed a sigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It has been said that street boys are not accessible to the softer emotions; but Ben did long to throw his arm round his cousin\u0027s neck in the old, affectionate way of six years since. It touched him to think that Charlie held him in affectionate remembrance. But his thoughts were diverted by noticing that they had reached the Astor House.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess we\u0027d better cross the street, and take the Fourth Avenue cars,\" he said. \"There\u0027s one over there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Charles. \"I suppose you know best.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a car just starting; they succeeded in getting aboard, and were speedily on their up town.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2953/81205.html","bookId":436,"creation":"Aug 2, 2019 6:04:30 AM","modification":"Aug 2, 2019 6:04:30 AM"}
