{"id":14287,"no":22,"title":"CHAPTER XXI. IN A NEW LINE.","content":"\u0026nbsp;\"Ten dollars!\" said Ben to himself, with exultation. \"That\u0027s pretty good pay for a few hours in the station-house. I\u0027d like to board there a week on the same terms.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben\u0027s capital now amounted to eleven dollars; but of this sum he decided to retain one dollar as a reserve to fall back upon in case of need. The ten dollars he determined to deposit at once in a savings-bank. He accordingly bent his steps towards one in the course of the forenoon. The business was quickly transacted, and Ben left the building with a bank-book containing an entry of his first deposit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a very good beginning, so Ben thought. Fifty dollars, as he had estimated, would enable him to carry out the plan which he proposed, and he had already one-fifth of the sum. But the accumulation of the other forty dollars would no doubt take him a[Pg 234] considerable time. The business of a \"baggage-smasher,\" as Ben knew from experience, is precarious, the amount of gains depending partly upon luck. He had sometimes haunted the steamboat landings for hours without obtaining a single job. Now that he was anxious to get on, he felt this to be an objection. He began to consider whether there was any way of adding to his income.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After considerable thought he decided to buy a supply of weekly papers, which he could sell while waiting for a job. One advantage in selecting weekly papers rather than daily was this, that the latter must be sold within a few hours, or they prove a dead loss. A daily paper of yesterday is as unsalable as a last year\u0027s almanac. As Ben was liable to be interrupted in his paper business at any time by a chance to carry luggage, it was an important consideration to have a stock which would remain fresh for a few days.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This idea impressed Ben so favorably that he determined to act upon it at once. In considering where he should go for his supply of papers, he thought of a Broadway news-stand, which he fre[Pg 235]quently had occasion to pass. On reaching it, he said to the proprietor, \"Where do you buy your papers?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want to know for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought maybe I\u0027d go into the business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t think of setting up a stand, do you?\" asked the man, with a significant glance at Ben\u0027s ragged attire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Ben. \"I haven\u0027t got capital enough for that, unless you\u0027ll sell out for fifty cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you want a few to carry round and sell?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you think of going with them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Down to the wharves. I\u0027m a baggage-smasher, and I thought I might make somethin\u0027 by sellin\u0027 papers, when I hadn\u0027t any baggage to carry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I get my papers from the \u0027American News Company\u0027 on Nassau Street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know the place well enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What papers do you think I could sell best?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The picture papers go off as fast as any,\" said[Pg 236] the street dealer. \"But I\u0027ll tell you what, my lad, maybe I can make an arrangement for you to sell papers for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think I\u0027d like to stand here all day,\" said Ben, supposing the other to mean to engage him to tend the stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t mean that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, said Ben, \"I\u0027m open to an offer, as the old maid of sixty told a feller that called to see her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you what I mean. I\u0027ll give you a bundle of papers every morning to take with you. You will sell what you can, and bring back the rest at night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I like that,\" said Ben, with satisfaction. \"But how much will I get?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will depend on the price of the papers. \u0027Harper\u0027s Weekly\u0027 and \u0027Frank Leslie\u0027 sell for ten cents. I will allow you two cents on each of these. On the \u0027Ledger\u0027 and \u0027Weekly,\u0027 and other papers of that price, I will allow one cent. You\u0027d make rather more if you bought them yourself; but you might have them left on your hands.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so,\" said Ben.[Pg 237]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you ever sell papers?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I used to sell the mornin\u0027 and evenin\u0027 papers before I went to baggage-smashin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you know something about the business. When do you want to begin?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Right off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; I will make you up a bundle of a dozen papers to begin on. I\u0027ll put in three each of the illustrated papers, and fill up with the story papers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, mister, you know better than I what people will buy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The dealer began to collect the papers, but paused in the middle of his task, and looked doubtfully at our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, what\u0027s up?\" asked Ben, observing his hesitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do I know but you\u0027ll sell the papers, and keep the money yourself?\" said the dealer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so,\" said Ben. \"I never thought of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That wouldn\u0027t be very profitable for me, you see.\"[Pg 238]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll bring back the money or the papers,\" said Ben. \"You needn\u0027t be afraid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very likely you would; but how am I to know that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you don\u0027t want to trust me,\" said Ben, rather disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got any money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, you can leave enough with me to secure me against loss, and I will give you the papers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much will that be?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a little thought, the dealer answered, \"Seventy-five cents.\" He had some doubt whether Ben had so much; but our hero quickly set his doubts at rest by drawing out his two half-dollars, and demanding a quarter in change.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sight of this money reassured the dealer. Ben\u0027s ragged clothes had led him to doubt his financial soundness; but the discovery that he was a capitalist to the extent of a dollar gave him considerable more respect for him. A dollar may not be a very large sum; I hope that to you, my young[Pg 239] reader, it is a very small one, and that you have never been embarrassed for the want of it; but it is enough to lift a ragged street boy from the position of a penniless vagabond to that of a thrifty capitalist. After seeing it, the dealer would almost have felt safe in trusting Ben with the papers without demanding a deposit of their value. Still it was better and safer to require a deposit, and he therefore took the dollar from Ben, returning twenty-five cents in change.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This preliminary matter settled, he made up the parcel of papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There they are,\" he said. \"If you\u0027re smart, you can sell \u0027em all before night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope so,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With the papers under his arm, Ben made his way westward to the Cortlandt Street ferry, which was a favorite place of resort with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not have long to wait for his first customer. As he was walking down Cortlandt Street, he met a gentleman, whose attention seemed attracted by the papers he carried.[Pg 240]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What papers have you got there, my lad?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Harper\u0027s Weekly,\u0027 \u0027Frank Leslie,\u0027 \u0027Ledger,\u0027 \u0027Weekly,\u0027\" repeated Ben, glibly, adding the names of the other papers in his parcel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me the two picture papers,\" said the gentleman. \"Twenty cents, I suppose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Ben, \"and as much more as you want to pay. I don\u0027t set no limit to the generosity of my customers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re sharp,\" said the gentleman, laughing. \"That\u0027s worth something. Here\u0027s twenty-five cents. You may keep the change.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do it cheerfully,\" said Ben. \"Thank you, sir. I hope you\u0027ll buy all your papers of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t promise always to pay you more than the regular price, but you may leave \u0027Harper\u0027s\u0027 and \u0027Leslie\u0027 at my office every week. Here is my card.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben took the card, and put it in his pocket. He found the office to be located in Trinity Building, Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll call every week reg\u0027lar,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s right, my lad. Good-morning.\"[Pg 241]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-mornin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben felt that he had started well. He had cleared nine cents by his sale, four representing his regular commission, while the other five cents might be regarded as a donation. Nine cents was something. But for his idea about the papers, he would have made nothing so far. It is a very good thing to have two strings to your bow, so Ben thought, though the thought did not take that precise form in his mind. He kept on his way till he reached the ferry. There was no train in on the other side, and would not be for some time, but passengers came over the ferry, and Ben placed himself where he could be seen. It was some time before he sold another paper however, although Ben, who improved some of his spare time by looking over the pictures, was prepared to recommend them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What papers have you got, boy? \" asked a tall, lank man, whose thin lips and pinched expression gave him an outward appearance of meanness, which, by the way, did not belie his real character.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben recited the list.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the price of \u0027Harper\u0027s Weekly\u0027?\"[Pg 242]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ten cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ten cents is too much to pay for any paper. I don\u0027t see how they have the face to ask it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I,\" said Ben; \"but they don\u0027t consult me,\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll give you eight cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No you won\u0027t, not if I know it. I\u0027d rather keep the paper for my private readin\u0027,\" answered Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are at liberty to do so,\" said the gentleman, snappishly. \"You\u0027d make profit enough, if you sold at eight cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All the profit I\u0027d make wouldn\u0027t pay for a fly\u0027s breakfast,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The gentleman deigned no response, but walked across the street in a dignified manner. Here he was accosted by a boot-black, who proposed to shine his boots.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027ll get \u0027em done at the wholesale price, see if he don\u0027t,\" thought Ben. He kept an eye on the boot-black and his patron until the job was finished. Then he witnessed what appeared to be an angry dispute between the two parties. It terminated by the gentleman lifting his cane in a menacing manner. Ben afterwards gained from the boy particulars of[Pg 243] the transaction, which may be given here in the third person.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shine yer boots?\" asked the boot-black, as the gentleman reached his side of the street, just after his unsuccessful negotiations with Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you charge?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ten cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s too much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the reg\u0027lar price.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can get my boots blacked for five cents anywhere. If you\u0027ll do it for that, you can go to work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy hesitated. It was half price, but he had not yet obtained a job, and he yielded. When the task was finished, his generous patron drew four cents from his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t got but four cents,\" he observed. \"I guess that\u0027ll do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy was indignant, as was natural. To work for half price, and then lose one-fifth of his reduced pay, was aggravating. What made it worse was, that his customer was carefully dressed, and bore every appearance of being a man of substance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want another cent,\" he demanded.[Pg 244]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re well enough paid,\" said the other, drawing on a kid glove. \"Four cents I consider very handsome pay for ten minutes\u0027 work. Many men do not make as much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This reasoning did not strike the little boot-black as sound. He was no logician; but he felt that he had been defrauded, and that in a very mean manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me my money,\" he screamed, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll hand you over to the authorities,\" said the gentleman,—though I hardly feel justified in calling him such,—lifting his cane menacingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What could the boy do? Might was evidently on the side of the man who had cheated him. But he was quick-witted, and a characteristic mode of revenge suggested itself. The street was muddy (New York streets are occasionally in that condition). The boot-black stooped down and clutched a handful of mire in his hand, fortunately having no kid gloves to soil, and, before his late customer fathomed his intention, plentifully besprinkled one of the boots which he had just carefully polished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s worth a cent,\" he remarked, with satisfaction, escaping from the wrath of the injured party.[Pg 245]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His victim, almost speechless with rage, seemed disposed to pursue him; but the boy, regardless of the mire, had run across the street, and to follow would only be to make matters worse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I ever catch you, I\u0027ll break every bone in your body, you little vagabond,\" he said, in a voice almost choked by passion, shaking his cane energetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben, who had witnessed the whole, burst into a hearty laugh, which drew upon his head a portion of wrath. After a pause, the victim of his own meanness turned up a side street. The reader will be glad to learn that he had to employ a second boot black; so that he was not so much better off for his economical management after all. It may be added that he was actuated in all his dealings by the same frugality, if we may dignify it by that name. He was a large dealer in ready-made under-clothing, for the making of which he paid starvation prices; but, unfortunately, the poor sewing-girls, whom he employed for a pittance, were not so well able to defend themselves against imposition as the smart little boot-black, who \"knew his rights, and knowing, dared maintain.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2953/81210.html","bookId":436,"creation":"Aug 2, 2019 6:04:46 AM","modification":"Aug 2, 2019 6:04:46 AM"}
