{"id":63400,"no":10,"title":"Page 10","content":"\u003cp\u003eEight starts towards the vendor, but I grab him by the arm and drag him back. He grins at me.\u003c/p\u003e\n\u003cp\u003e“Change your mind?”\u003c/p\u003e\n\u003cp\u003e“What do you mean, you never thanked me properly?” I ask. “Thanked me for what?”\u003c/p\u003e\n\u003cp\u003e“For saving my life in New Mexico. You broke the prophecy, Marina. Setrákus Ra put his sword right through me and you—you brought me back to life.”\u003c/p\u003e\n\u003cp\u003eI can’t help blushing and looking down at my feet. “It was nothing.”\u003c/p\u003e\n\u003cp\u003e“It was literally everything to me.”\u003c/p\u003e\n\u003cp\u003eI look up, putting on my best version of Eight’s teasing smile. “In that case, I think I deserve more than a gross hot dog.”\u003c/p\u003e\n\u003cp\u003eEight clasps his hands across his chest like I’ve wounded him. “You’re right! I’m a fool to think my life could be traded for a hot dog.” He grabs my hand and gets down on one knee, pressing his forehead to the back of my hand. “My savior, what can I ever do to repay you?”\u003c/p\u003e\n\u003cp\u003eI’m embarrassed, but can’t help laughing. I shoot apologetic looks to the people around us, most of them staring at Eight’s display with curious smiles. We must look like just two normal teenagers to them, goofing around and flirting.\u003c/p\u003e\n\u003cp\u003eI pull Eight back to his feet and, still holding his hand, continue on down the lakefront. The sun winks across the surface of the lake. It’s not quite the sea I was named for, but it’s beautiful all the same.\u003c/p\u003e\n\u003cp\u003e“You can promise me more days like these,” I tell Eight.\u003c/p\u003e\n\u003cp\u003eHe squeezes my hand tightly. “Consider it done.”\u003c/p\u003e\n\u003cp\u003eEight and I finally come back to the penthouse, our bellies full of greasy Chicago pizza. We’ve still got hours before Four and Six arrive in Arkansas, and Ella never sent up any telepathic alarm. Everything is just as we left it.\u003c/p\u003e\n\u003cp\u003eExcept Nine is awake and standing so close to the elevator door that we almost crash into him when we enter.\u003c/p\u003e\n\u003cp\u003eNine doesn’t move when we come in, he just stands there with his arms crossed over his chest and glares at us. “Where have you two been?”\u003c/p\u003e\n\u003cp\u003e“Geez,” says Eight, inching around Nine’s bulk. “How long have you been standing here waiting for us? Aren’t your feet tired?”\u003c/p\u003e\n\u003cp\u003e“We just went out for a bit,” I explain, feeling more than a little timid around Nine. It reminds me of getting caught sneaking back into the orphanage after curfew, and I briefly picture Nine trying to take a ruler to my knuckles. “Is everything all right?”\u003c/p\u003e\n\u003cp\u003e“Everything’s fine,” snaps Nine, focusing more on Eight than me. “You can’t just go gallivanting around the city without telling me.”\u003c/p\u003e\n\u003cp\u003e“Why not?” counters Eight.\u003c/p\u003e\n\u003cp\u003e“Because it’s bullshit,” growls Nine. I can see his mind working, like he’s trying to think of something else to say. “It’s irresponsible and careless. It’s stupid.”\u003c/p\u003e\n\u003cp\u003e“It was a couple hours,” complains Eight, rolling his eyes. “Spare me the Cêpan lecture.”\u003c/p\u003e\n\u003cp\u003eIt is kind of funny to see Nine so enraged about us acting out of line, especially considering the stories I’ve heard Four tell about their time together on the road. Strangely, it’s also endearing. He puts on this big show of being this tough-as-nails loose cannon, but when he woke up to find us gone, he was actually concerned about us.\u003c/p\u003e\n\u003cp\u003eI touch Nine on the arm, trying to defuse the situation. “I’m sorry we worried you.”\u003c/p\u003e\n\u003cp\u003e“Whatever, I wasn’t worried,” Nine snarls, jerking his arm away from me and rounding on Eight again. “You think that was a lecture? Maybe I should show you the kind of lectures I used to get, back when I was a cocky little dumbass.”\u003c/p\u003e\n\u003cp\u003eEight wiggles his fingers at Nine, just egging him on further. Most of the time his joking around is charming, but this is one of those times when I wish he’d just cut it out. Nine steps right up to Eight; they’d be nose to nose if Eight was a few inches taller. Eight doesn’t back down, still smiling, like it’s all just a goof.\u003c/p\u003e\n\u003cp\u003e“Come on,” says Nine, his voice low. “I’ve seen you in the Lecture Hall playing patty-cake with Six. You ain’t trained with me yet.”\u003c/p\u003e\n\u003cp\u003eEight glances down at an imaginary watch. “Sure, dude. I’ve got some time to kill.”\u003c/p\u003e\n\u003cp\u003eNine smiles. He looks over his shoulder at me. “You too, Nurse Marina. Your boyfriend’s gonna need you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER NINE\u003c/p\u003e\n\u003cp\u003e“I’M GOING TO WHIP YOU INTO SHAPE,” DECLARES Nine. “That way, the next time there’s a mission, we won’t be the ones left sitting on our asses.”\u003c/p\u003e\n\u003cp\u003eEight and I stand in the Lecture Hall side by side, watching as Nine circles around us, sizing us up like some kind of army drill instructor. I feel like rolling my eyes, and I can tell Eight is barely suppressing a fit of laughter. Still, I do feel sort of guilty about basically sneaking out with Eight, and I’m sure a little training couldn’t hurt. Plus, I think Nine is still bummed about being left out of Four’s rescue mission, and he seems really into this whole training thing. I decide to humor him.\u003c/p\u003e\n\u003cp\u003e“Unless you’d rather just be benchwarmers? You want to hang out and go eat pizza while the rest of us kill Setrákus Ra?” Nine snarls as he stops in front of us, staring us down.\u003c/p\u003e\n\u003cp\u003e“No, sir,” I say, trying to be serious. Eight immediately bursts out laughing.\u003c/p\u003e\n\u003cp\u003eNine ignores Eight for now, focusing instead on me. “Healing and night vision. That’s about it, huh?”\u003c/p\u003e\n\u003cp\u003e“I can breathe under water,” I add helpfully.\u003c/p\u003e\n\u003cp\u003e“All right,” says Nine, considering my Legacies, “maybe you’ll develop a good fighting Legacy one day. Maybe you won’t. We’d still all be dead if it wasn’t for you, I guess. I know Johnny’s supposed to have the healing thing now, too, but I think he only heals girls he’s dating, so the rest of us still need you. Anyway, we’ll need to practice your speed and agility, so that when one of us goes down, you’ll be able to get to us. And maybe your healing will, like, evolve into something else if we practice with it enough.”\u003c/p\u003e\n\u003cp\u003eTo my surprise, most of what Nine says actually makes sense. Except one thing nags at me. “How are we going to practice my healing?”\u003c/p\u003e\n\u003cp\u003eNine’s smile is sinister, something I’d be really afraid to see from across the battlefield. “Oh, you’ll see. As for you,” he continues, turning to Eight, “I thought you were pretty badass when we first met, and then you took a sword to the chest first chance you got. Nice job.”\u003c/p\u003e\n\u003cp\u003eEight’s expression darkens as he’s reminded of his run-in with Setrákus Ra. “He tricked me.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” says Nine. “Way I remember it, you were so focused with copping a feel—er, hugging—fake Six that you got stabbed. You give a lot of hugs in the middle of a battle, bro? Use your head.”\u003c/p\u003e\n\u003cp\u003e“It seems like you could use a hug right now,” says Eight, grinning mischievously.\u003c/p\u003e\n\u003cp\u003eBefore Nine knows what’s happening, Eight shape shifts into his four-armed Vishnu form, leaps forward, and wraps Nine up in a tight embrace. I can see the muscles in Nine’s neck and shoulders tense as Eight squeezes him.\u003c/p\u003e\n\u003cp\u003e“Let me go,” warns Nine through gritted teeth.\u003c/p\u003e\n\u003cp\u003e“You’re the boss.”\u003c/p\u003e\n\u003cp\u003eEight teleports, taking Nine with him. He reappears just inches away from the ceiling and releases Nine. Disoriented, Nine doesn’t have a chance to gather himself and crashes to the floor on his back. Before Nine even lands, Eight has teleported back to my side.\u003c/p\u003e\n\u003cp\u003e“Ta-da,” he says, reassuming his normal form.\u003c/p\u003e\n\u003cp\u003e“You’re just going to make him mad,” I whisper. Eight only shrugs.\u003c/p\u003e\n\u003cp\u003eNine hops back to his feet and rolls his head from side to side, cracking his neck. He nods, looking almost impressed.\u003c/p\u003e\n\u003cp\u003e“Pretty good move,” he says.\u003c/p\u003e\n\u003cp\u003e“Maybe I should be training you,” quips Eight.\u003c/p\u003e\n\u003cp\u003e“Try it again.”\u003c/p\u003e\n\u003cp\u003eShrugging, Eight shape shifts again. He wraps Nine in the same hug, this time approaching warily, as if he’s expecting Nine to launch a counterattack. I’m expecting the same thing, cringing as I wait for Nine to throw an elbow into Eight’s face. Surprisingly, Nine doesn’t fight back at all.\u003c/p\u003e\n\u003cp\u003eEight teleports them back to the ceiling again, but this time, when he’s released from Eight’s grasp, Nine quickly reaches his hand up to touch the ceiling. It makes me queasy just to watch; Nine’s gravity shifting so that instead of falling to the floor, he’s doing a handstand on the ceiling. It all takes no more than a second.\u003c/p\u003e\n\u003cp\u003eEight’s already teleported away, reappearing back at my side. Just like Nine was expecting. Nine launches himself from the ceiling and, as soon as Eight materializes, Nine is plummeting towards him. Eight only has a moment to notice that Nine isn’t lying on the floor where he expected him to be. The next thing he knows, Nine’s foot is connecting with his sternum, sending him flying to the ground.\u003c/p\u003e\n\u003cp\u003eEight picks himself up onto his elbows, wheezing, the wind knocked out of him. Nine stands over him, his hands on his hips.\u003c/p\u003e\n\u003cp\u003e“Predictable,” Nine says. “Why would you teleport back to the same place?”\u003c/p\u003e\n\u003cp\u003eIn answer, Eight coughs, rubbing his chest. Nine reaches down and helps him to his feet.\u003c/p\u003e\n\u003cp\u003e“It’s all about surprise with you, man,” Nine explains. “You gotta keep ’em guessing.”\u003c/p\u003e\n\u003cp\u003eEight lifts up his shirt. There’s a foot-shaped bruise already forming over his ribs. “Damn. That was like getting hit with a sledgehammer.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” says Nine, and looks at me. “Here’s some practice for you.”\u003c/p\u003e\n\u003cp\u003eI place my hands gently on Eight’s chest. The icy feeling of my Legacy tingles in my fingertips, passing through me and into Eight. It’s only a bruise so it’s easy; I don’t even have to concentrate. Which is good, because it’s not that easy for me to concentrate while touching Eight’s chest. If this is what training is going to be like, I could get used to it.\u003c/p\u003e\n\u003cp\u003e“Thanks,” says Eight, when I step back.\u003c/p\u003e\n\u003cp\u003eOn the other side of the room, Nine has grabbed one of the stuffed Mogadorian training dummies and dumped it on the ground. He stands over it, looking at us.\u003c/p\u003e\n\u003cp\u003e“Okay, here’s the game. We’re going to pretend this dummy is—I don’t know—Number Four. He gets hurt all the time, right? So, he’s wounded and, Marina, you need to get to him and work your magic. Eight, you’re going to help her.”\u003c/p\u003e\n\u003cp\u003e“And what are you going to be doing?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’m going to be the surprisingly good-looking Mogadorian that’s standing in your way.”\u003c/p\u003e\n\u003cp\u003eEight and I exchange a look. “Two on one?” he says. “Sounds easy.”\u003c/p\u003e\n\u003cp\u003e“Cool,” says Nine, extending his pipe staff and twirling it menacingly over his head. “Let’s see what you got.”\u003c/p\u003e\n\u003cp\u003eEight puts his arm around me, pulling me into a quick huddle. “He expects us to go right at him,” he whispers.\u003c/p\u003e\n\u003cp\u003eI nod, catching on to the plan quickly. “You should just teleport the body back to me.”\u003c/p\u003e\n\u003cp\u003eEight holds his hand up to me for a quick high five, then spins back to face Nine. “Ready?”\u003c/p\u003e\n\u003cp\u003e“Bring it on.”\u003c/p\u003e\n\u003cp\u003eEight starts forward and Nine stalks out to meet him in the center of the room. As soon as he’s drawn Nine a few yards away from the dummy, Eight disappears, reappearing over the dummy. It’s not that Nine doesn’t notice what Eight’s up to—he just doesn’t care. He bounds a few steps forward, coming straight for me. Caught off guard and more than a little nervous with Nine charging me, I backpedal. Nine is far too quick for me. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fall-of-five-lorien-legacies-4/page-10.html","bookId":1678,"creation":"Oct 5, 2019 9:50:59 AM","modification":"Oct 5, 2019 9:50:59 AM"}
