{"id":63399,"no":9,"title":"Page 9","content":"\u003cp\u003e“Wait. Dead weight?” I think back to my conversation with Sarah in the Lecture Hall. Those were the exact words she used. “Were you eavesdropping on us?”\u003c/p\u003e\n\u003cp\u003eSix looks a little guilty at being busted, but more than anything she looks increasingly angry with me, her eyes flashing. “So what? I thought you might finally grow a pair and tell her that we kissed.”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?” I snap, struggling to keep my voice low.\u003c/p\u003e\n\u003cp\u003e“Because the longer you put it off the more awkward it gets, and I’m getting sick of it? Because she deserves—”\u003c/p\u003e\n\u003cp\u003eBefore Six can finish, the Civic roars to life, Sarah revving the engine. Nine steps back from the driver-side window, looking pleased with the way Sarah’s gunning it. Sarah leans out the window, peering back at Six and me.\u003c/p\u003e\n\u003cp\u003e“You two coming or what?”\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eTHE PENTHOUSE FEELS EVEN LARGER AS SOON AS John, Six and Sarah are gone. I’m still not over the size of this place; it’s almost big enough to contain the entire monastery of Santa Teresa. I know it’s silly, but I find myself tiptoeing through it, feeling like I’m constantly disturbing these riches Nine and his Cêpan amassed.\u003c/p\u003e\n\u003cp\u003eThe tiles in Nine’s bathroom are heated—they actually warm and dry your feet when you get out of the shower. I think of all the times I sat on my mattress, picking splinters out of my feet after crossing the uneven wood floors of Santa Teresa. I wonder what Hectór would think of this place, and I smile. Then, I wonder what kind of person I would be if my Cêpan had been Sandor instead of Adelina; a showy but dedicated guardian, frivolous in his purchases but not one to abandon his duties. It’s pointless to think such thoughts, yet I can’t help it.\u003c/p\u003e\n\u003cp\u003eBut if I hadn’t been stuck so long in Santa Teresa, I never would have crossed paths with Ella. I never would have journeyed to the mountains with Six and met Eight.\u003c/p\u003e\n\u003cp\u003eAll the hardship, in the end, was worth it.\u003c/p\u003e\n\u003cp\u003eI stifle a yawn with the back of my hand. None of us got much sleep last night, not with the excitement of finding Number Five. It was supposed to be my night sleeping in Ella’s room, shaking her awake when the nightmares got too bad. Actually, I don’t think Ella slept a wink in between the meeting and tagging along with Nine during his shift watching Five’s beacon. Apparently, to her, spending time with Nine is better than getting some rest. I wish I knew how to help, but my healing Legacy doesn’t extend to the dream world.\u003c/p\u003e\n\u003cp\u003eI find Ella curled up in a chair in the penthouse living room. Nine is stretched out on the nearest couch, snoring loudly, his hands curled around the contracted metal tube that turns into the staff I’ve seen him use with such deadly efficiency. He must have gotten it from his Chest when he still thought there was a chance John would bring him along on the mission. Nine clutches the weapon like a teddy bear, probably dreaming of killing Mogadorians.\u003c/p\u003e\n\u003cp\u003e“You should get some sleep too,” I whisper.\u003c/p\u003e\n\u003cp\u003eElla looks from me to the sleeping Nine. “He said he was just going to rest his eyes and then he’d show me some ass-kicking techniques.”\u003c/p\u003e\n\u003cp\u003eI giggle. There’s something hilarious about Ella parroting Nine’s language.\u003c/p\u003e\n\u003cp\u003e“Come on, there will be time for training later.”\u003c/p\u003e\n\u003cp\u003eNine grumbles something in his sleep and rolls over, burying his face in the couch cushions. Ella stands up slowly and we tiptoe out of the room.\u003c/p\u003e\n\u003cp\u003e“I like Nine,” she announces as we walk down the hall. “He doesn’t care about stuff.”\u003c/p\u003e\n\u003cp\u003eMy brow furrows. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“He never asks me how I’m doing or, like, worries about me. He just makes gross jokes and lets me walk on his shoulders across the ceiling.”\u003c/p\u003e\n\u003cp\u003eI laugh, but I feel a bit wounded. All of us have been so worried about Ella, always trying to get her to open up about Crayton—I’m still supposed to do what John asked and get to the bottom of that letter—and along comes Nine, taking her mind off her troubles with bluster.\u003c/p\u003e\n\u003cp\u003e“We’re just worried about you,” I say.\u003c/p\u003e\n\u003cp\u003e“I know,” Ella replies. “It just feels better not to think about it sometimes.”\u003c/p\u003e\n\u003cp\u003eMaybe this is a good time to give Ella that gentle nudge John was talking about. “My Cêpan, Adelina, she spent a long time trying not to think about her destiny—about our destiny. But eventually she didn’t have a choice. She had to face it.”\u003c/p\u003e\n\u003cp\u003eElla doesn’t say anything, but I can tell by the way her face is scrunched up that she’s thinking about my words.\u003c/p\u003e\n\u003cp\u003eI find myself detouring away from the bedrooms and instead heading back into Sandor’s workshop. I stand over the plugged-in tablet, watching the dots that represent Four and Six crawl slowly towards Five’s stationary dot in Arkansas.\u003c/p\u003e\n\u003cp\u003e“Are you worried about them?” Ella asks.\u003c/p\u003e\n\u003cp\u003e“A little,” I reply, although I know the others will be fine. Even after meeting Nine, Six is still the toughest and bravest person I’ve ever met. And Four is everything Six said he would be—a good guy, the leader we need, even if sometimes I can tell he feels like he’s in over his head.\u003c/p\u003e\n\u003cp\u003e“I hope Five is a boy,” announces Ella. “There aren’t enough boys for all of us.”\u003c/p\u003e\n\u003cp\u003eMy mouth hangs open for a moment, and then I start to laugh. “Are you matching us up already, Ella?”\u003c/p\u003e\n\u003cp\u003eShe nods, looking at me mischievously. “There’s John and Sarah, of course. And you and Eight.”\u003c/p\u003e\n\u003cp\u003e“Wait a second,” I say. “Nothing’s happening with me and Eight.”\u003c/p\u003e\n\u003cp\u003e“Psshh,” interrupts Ella, continuing on, “and if I grow up to marry Nine, who does that leave for Six?”\u003c/p\u003e\n\u003cp\u003e“Who’s getting married now?”\u003c/p\u003e\n\u003cp\u003eEight’s standing in the doorway behind us, that charming smirk of his lighting up his face. How long has he been standing there? Ella and I exchange a surprised look and start laughing.\u003c/p\u003e\n\u003cp\u003e“Fine,” says Eight, sidling over to gaze at the tablet. “Don’t tell me.”\u003c/p\u003e\n\u003cp\u003eOur shoulders brush when he gets close and I don’t move away. I still think about that desperate kiss we shared in New Mexico. It was probably the boldest move of my entire life. Much as I’d like to, we haven’t kissed again since. We’ve talked a lot, sharing stories about our years on the run, comparing the fragments of our memories of Lorien. The time just hasn’t felt right for anything more.\u003c/p\u003e\n\u003cp\u003e“They’re really taking their time, huh?” Eight says, watching Four and Six move south.\u003c/p\u003e\n\u003cp\u003e“It’s a long drive,” I reply.\u003c/p\u003e\n\u003cp\u003e“Good,” he says, grinning. “That should give us some time.”\u003c/p\u003e\n\u003cp\u003eEight’s wearing a red and black T-shirt for something called the Chicago Bulls and a pair of blue jeans. He steps back and gestures at his wardrobe, like he’s asking Ella and me for our approval.\u003c/p\u003e\n\u003cp\u003e“Do I look American enough in this?”\u003c/p\u003e\n\u003cp\u003e“Are you sure we should be doing this?”\u003c/p\u003e\n\u003cp\u003eI’m feeling nervous as the elevator glides down from the penthouse to the lobby. Eight stands next to me, practically bouncing with excitement.\u003c/p\u003e\n\u003cp\u003e“We’ve been here for days and still haven’t actually seen the city,” he says. “I’d like to see more of America than military bases and apartments.”\u003c/p\u003e\n\u003cp\u003e“But what if something happens while we’re away?”\u003c/p\u003e\n\u003cp\u003e“We’ll be back before they even make it to Arkansas. Nothing’s going to happen on the drive down there. If it does, Ella can use her whole telepathy thing and call us back.”\u003c/p\u003e\n\u003cp\u003eI think about Nine, who was still sound asleep on the couch when Eight and I crept past him. Ella watched us go, smiling conspiratorially at me, while she curled back up in her chair next to Nine.\u003c/p\u003e\n\u003cp\u003e“Won’t Nine be mad if he wakes up and we’re not there?”\u003c/p\u003e\n\u003cp\u003e“What is he? Our babysitter?” Eight cracks merrily, reaching out to shake me gently by the shoulders. “Loosen up. Let’s be tourists for a couple hours.”\u003c/p\u003e\n\u003cp\u003eGazing down from the windows of Nine’s penthouse never gave me a real sense of how truly busy the streets of downtown Chicago are. We exit into the midday sun and are immediately hit with a wall of noise, people talking, car horns blaring. It reminds me of the marketplace back in Spain, except times a thousand. Eight and I both find ourselves craning our necks upwards, trying to take in the buildings that tower above us. We’re walking slow, people shooting us annoyed looks as they’re forced to cut around us.\u003c/p\u003e\n\u003cp\u003eIt’s a little intense for me out here. All these people, the noise, it’s way more than I’m used to. I find myself slipping my hand into the crook of Eight’s elbow, just to make sure we aren’t accidentally separated and lost in the crowd. He smiles at me.\u003c/p\u003e\n\u003cp\u003e“Where to?” he asks.\u003c/p\u003e\n\u003cp\u003e“That way,” I point, picking a direction at random.\u003c/p\u003e\n\u003cp\u003eWe end up on the waterfront. It’s much more peaceful here. The humans wandering around the shore of Lake Michigan are like us—not in a rush to get anywhere. Some of them sit down on benches, eating their lunches, while others jog and bike by us, exercising. I feel suddenly sad for these people. So much hangs in the balance and they have no idea.\u003c/p\u003e\n\u003cp\u003eEight touches my arm gently. “You’re frowning.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” I reply, forcing a smile. “Just thinking.”\u003c/p\u003e\n\u003cp\u003e“Less of that,” he says with mock sternness. “We’re just out for a walk. No big deal.”\u003c/p\u003e\n\u003cp\u003eI try to put the doom and gloom out of my mind and act the part of a tourist like Eight said. The lake is crystalline and beautiful, a few boats lazily cutting across its surface. We amble by sculptures and outdoor cafés, Eight taking an interest in everything, trying to consume as much of the local culture as possible, and cheerily trying to get me interested.\u003c/p\u003e\n\u003cp\u003eWe stand before a large silver sculpture that looks like a cross between a satellite dish and a half-peeled potato. “I believe this human work was secretly influenced by the great Loric artist Hugo Von Lore,” Eight says, stroking his chin thoughtfully.\u003c/p\u003e\n\u003cp\u003e“You’re making that up.”\u003c/p\u003e\n\u003cp\u003eEight shrugs. “I’m just trying to be a better tour guide.”\u003c/p\u003e\n\u003cp\u003eHis easygoing enthusiasm is infectious, and soon I’m wrapped up in this game of making up silly stories for the various landmarks we pass. When I finally realize that we’ve spent more than an hour on the waterfront, I feel guilty.\u003c/p\u003e\n\u003cp\u003e“Maybe we should get back,” I tell Eight, feeling like we’re shirking our responsibilities, even though I know there’s nothing for us to do but wait.\u003c/p\u003e\n\u003cp\u003e“Hold on,” he says, pointing. “Look at that.”\u003c/p\u003e\n\u003cp\u003eFrom the hushed way Eight speaks, I expect to see a Mogadorian scout on our trail. Instead, following his gaze, I see a chubby older man behind a food cart selling what’s advertised as a “Chicago-Style Hot Dog.” He hands one off to a customer; the hot dog is covered in pickle and tomato slices and chopped-up onions, barely contained in a bun.\u003c/p\u003e\n\u003cp\u003e“That’s the most monstrous thing I’ve ever seen,” Eight says.\u003c/p\u003e\n\u003cp\u003eI chuckle, and when my stomach suddenly growls, that chuckle turns into a full-on guffaw. “I think it looks sort of good,” I manage.\u003c/p\u003e\n\u003cp\u003e“Have I mentioned that I’m a vegetarian?” Eight asks, staring at me with mock revulsion. “But if it’s the frightening mess of a Chicago-style hot dog you desire, then so it shall be. I’ve never thanked you properly.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fall-of-five-lorien-legacies-4/page-9.html","bookId":1678,"creation":"Oct 5, 2019 9:50:59 AM","modification":"Oct 5, 2019 9:50:59 AM"}
