{"id":49698,"no":1,"title":"Book 1, Chapter 1 - The Land of the Dead","content":"\u003cp\u003e“Walk faster!”\u003c/p\u003e\n\u003cp\u003e“You’ve already died and become a ghost. Faster!”\u003c/p\u003e\n\u003cp\u003e“You are a prince? You ruled over tens of millions of citizens and thirty thousand armored horsemen? In the Netherworld Kingdom, you human princes are nothing!”\u003c/p\u003e\n\u003cp\u003eSmack!\u003c/p\u003e\n\u003cp\u003eSmack!\u003c/p\u003e\n\u003cp\u003eA tall, powerful-looking demonic soldier, his face mean and vicious, snarled angrily as he lashed out with his whip repeatedly. The whip flashed like lightning, striking on the bodies of the souls of the dead. He struck the ghost who had been arrogantly proclaiming that he was a prince several dozen times, only stopping when the ghost’s soul had almost dissipated.\u003c/p\u003e\n\u003cp\u003e“I should’ve died. So that means… this is the Netherworld Kingdom?” Ji Ning appeared out of nowhere. He couldn’t help but stare with curiosity at the unfamiliar surroundings. When he heard the arrogant boastings of the prince, Ji Ning couldn’t help but feel suspicious; “Ten million citizens? Thirty thousand armored horsemen? In the modern Earth, where would one find thirty thousand armored horsemen?”\u003c/p\u003e\n\u003cp\u003e“Faster!” The massive, glowing minotaur demon soldier stared at Ji Ning and brayed.\u003c/p\u003e\n\u003cp\u003eJi Ning followed the rest of the regiment.\u003c/p\u003e\n\u003cp\u003eCountless men in white clothes formed into a line, like a long, sinuous dragon, as they slowly moved forwards. At the end of each line, more people in white would suddenly appear. Some of these white-dressed people would shake their heads and sigh. Some would weep. Some would brag and curse. Some would stare in astonishment.\u003c/p\u003e\n\u003cp\u003e“My father is the Devil King of the Great Snowy Mountain. How dare you strike me! I’ll eat you! Grrr!”\u003c/p\u003e\n\u003cp\u003e“Stop hitting me!”\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eThe ghosts who had just reached the Netherworld Kingdom didn’t know they were dead. Many of them were roaring in anger as they were beaten, but quickly, they were beaten to the point of understanding… that they were dead. No matter how glorious they had been in the past, in death, they now had nothing.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003eTime passed quickly. Ji Ning walked for a very long time in that endless line of ghosts. He didn’t dare to say anything. If he spoke, he might be whipped by that minotaur. He had walked in a daze for a long time already. Fortunately, ghosts didn’t get hungry or thirsty.\u003c/p\u003e\n\u003cp\u003eOne day, after a long, long period of dazed walking.\u003c/p\u003e\n\u003cp\u003e“Ji Ning!” A thunderous sound seemed to echo in the world. The countless ghosts all raised their heads to stare at the sky. Ji Ning stared at the sky as well. From the horizon, an enormous black cloud began to roll over, and atop that cloud was an enormous minotaur god who was glowing with black light.\u003c/p\u003e\n\u003cp\u003eThis enormous minotaur god was over a hundred thousand meters tall. He was like a massive mountain. The black cloud he was on quickly flew over from the horizon.\u003c/p\u003e\n\u003cp\u003e“Ji Ning.” Atop the massive black cloud, the minotaur god stared downwards, his eyes shooting out twin lofty golden rays of light, covering the entire area below and illuminating the body of Ji Ning, who stood there like an idiot.\u003c/p\u003e\n\u003cp\u003eThe glowing light from the eyes of the minotaur god wrapped around Ji Ning’s body, and Ji Ning disappeared from within the ranks of the ghosts. Those ordinary minotaur soldiers were all silent, none daring to make a sound. All of the ghosts were in a state of shock. Only a long time later did they recover.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003eWithin the boundless black clouds, the titanic minotaur god stood.\u003c/p\u003e\n\u003cp\u003eHe stretched out his hand, and on top of his palm was a tiny little dot. Ji Ning.\u003c/p\u003e\n\u003cp\u003eJi Ning was totally shocked.\u003c/p\u003e\n\u003cp\u003eGod.\u003c/p\u003e\n\u003cp\u003eAn enormous minotaur god was standing in front of him, and he was standing on its palm?\u003c/p\u003e\n\u003cp\u003e“Ji Ning.” The minotaur god peered down at the tiny little speck in his hands.\u003c/p\u003e\n\u003cp\u003e“I have come at the orders of the Lord of Cui Palace to come receive you.” The minotaur god spoke to the tiny speck in his hands, and then with a wave of his hands, Ji Ning was placed into an empty void area. The minotaur god then rose his black cloud and quickly disappeared into the horizon.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003eIn the Fengdu City of the Ghost World.\u003c/p\u003e\n\u003cp\u003eWithin a quiet study, there was a bookshelf and a table next to it. A blue robed man in his middle years was flipping through a book.\u003c/p\u003e\n\u003cp\u003eJi Ning stood there in front of him.\u003c/p\u003e\n\u003cp\u003e“Why does the Lord of Cui Palace wish to see me?” Ji Ning was wondering. He had no idea who this \u0027Lord of Cui Palace\u0027 was and had never met him. He was just an ordinary person. How could he possibly know any Immortals? If he had a powerful background, then he wouldn’t have been tormented by his illness his entire life. So why had that Lord of Cui Palace sent the minotaur god to bring him here?\u003c/p\u003e\n\u003cp\u003e“He summoned me, but then he doesn’t speak to me.” Ji Ning sneaked a glance around the room.\u003c/p\u003e\n\u003cp\u003eThe study was very simple. The only decoration was a single painting.\u003c/p\u003e\n\u003cp\u003e“That’s…” Ji Ning looked at it carefully. This was the painting of a girl. Her feathered clothes were filled with natural grace, and the smile on her lips was even more enigmatic than those on the Buddhas in the temples on Earth. In the blink of an eye, Ji Ning became enamored with studying that painting. The woman in this painting, in terms of appearance or hair or clothing, was extremely alluring.\u003c/p\u003e\n\u003cp\u003e“Oh?” The blue robed man raised his head and glanced at him, glancing at the painting in surprise. “I didn’t expect that he would have such powers of perception.”\u003c/p\u003e\n\u003cp\u003e“Wake up!” The blue robed man shouted quietly.\u003c/p\u003e\n\u003cp\u003eThe world of vacant pondering which Ji Ning had been in just now was totally shattered, and he was totally woken up. Only now did he remember that he was in the Lord of Cui Palace’s place.\u003c/p\u003e\n\u003cp\u003eLord Cui had closed his book and was looking at him. Ji Ning’s expression instantly changed. This was because from his current position, he could see the words within the hands of Lord Cui: “Book of Life and Death.”\u003c/p\u003e\n\u003cp\u003eLord Cui was reading the Book of Life and Death?\u003c/p\u003e\n\u003cp\u003e“I’ve just been reading about your life.” Lord Cui smiled towards Ji Ning.\u003c/p\u003e\n\u003cp\u003eJi Ning was startled.\u003c/p\u003e\n\u003cp\u003eHis life?\u003c/p\u003e\n\u003cp\u003eHis previous life appeared in his mind like a dream. His father was a leading researcher in a bioscience program. His salary was extremely high. His mother was an ordinary teacher. His life should’ve been great since he had been born into such a family, but unfortunately, he suffered from constant diseases. The doctors all said that it would be a miracle if he would live to fifteen or sixteen.\u003c/p\u003e\n\u003cp\u003eTherefore, he couldn’t go to school, nor could he play around with his peers. Every day, just by walking for half an hour, he would feel exhausted. His weak body, constantly tormented by illness, caused his childhood to be very lonely. He had heard long ago in the hospital that others were discussing how he should die in his teens. This sort of terrifying feeling of knowing your death was coming soon had tormented his childhood, causing him to be even more of a loner.\u003c/p\u003e\n\u003cp\u003eFortunately!\u003c/p\u003e\n\u003cp\u003eFortunately, he had his books and the internet.\u003c/p\u003e\n\u003cp\u003eThe books and the internet gave him a ‘mental world’ which allowed him to avoid the fate of having a twisted personality. Through books and the internet, he ravenously acquired knowledge about the world, and his heart slowly grew calm, making him more rational in the way he viewed the world.\u003c/p\u003e\n\u003cp\u003eHe knew that in the world, there were children who were even worse off than him. After all, he still had his parents and he had enough to eat.\u003c/p\u003e\n\u003cp\u003eHe was searching for his value in life. He couldn’t just stay here and wait to die, right? While he was alive, he had to do something. And thus, he had asked for a hundred thousand Chinese dollars from his parents and began to do business online. He originally had wanted to make his life more interesting, but unexpectedly, he really had incredible achievements.\u003c/p\u003e\n\u003cp\u003eAfter many years, he had earned an enormous fortune.\u003c/p\u003e\n\u003cp\u003eBut despite that, his illness constantly reminded him that he wouldn’t be able to live for much longer. As his parents didn’t need him to support them, he felt that leaving the money there would be a waste. Thus, before dying, he handed out all of his money, giving it to the poor and sick children throughout the country.\u003c/p\u003e\n\u003cp\u003e“I can’t change my own destiny, but I can change the destiny of those countless poor, sick children!”\u003c/p\u003e\n\u003cp\u003eThis was the deepest desire in Ji Ning’s heart!\u003c/p\u003e\n\u003cp\u003eAfter handing out all of his money, he hadn’t expected that one day, while he was taking a walk in the streets outside the hospital with his parents, he had simply died.\u003c/p\u003e\n\u003cp\u003e“Your life was bitter since you were born,\" Lord Cui said softly. “But bitterness didn’t twist you. Instead, it spurred you on to astonishing accomplishments. You not only made a huge sum of money, but more importantly… you gave it all away!”\u003c/p\u003e\n\u003cp\u003e“Eighteen years of age. Dead.” Lord Cui sighed. “For one to be willing to sacrifice one’s self to rescue a stranger is quite rare.”\u003c/p\u003e\n\u003cp\u003eJi Ning said, “Palace Lord, you praise me too much. If I had lived a long life, I might not have been willing to do this. According to the doctors, at most I would’ve lived another three months. For me to trade those three months of life to allow a little girl to gain dozens of years in her life was worth it!”\u003c/p\u003e\n\u003cp\u003eLord Cui laughed, then casually flipped open the Book of Life and Death. His gentle voice carried an infinite majesty. “Ji Ning, in your life, you saved over ten thousand people. Your merits are great. For your reincarnation, you shall be reborn into… the Heaven Realm!”\u003c/p\u003e\n\u003cp\u003e“The Heaven Realm.” Ji Ning murmured quietly.\u003c/p\u003e\n\u003cp\u003eLord Cui sighed, “Only those who accumulate great karmic merit can enter the Heaven Realm. On Earth, it is very hard for one to reach this level. Knowingly or unknowingly, by giving up your vast fortune and helping all of those children, you accumulated enormous karmic merit. Otherwise, you probably wouldn’t be able to enter the Heaven Realm.”\u003c/p\u003e\n\u003cp\u003e“Palace Lord, what do you mean?” Ji Ning was confused.\u003c/p\u003e\n\u003cp\u003e“People are born pure and without malice,” the Lord of Cui Palace replied. “Children are totally pure, but later on, the vagaries of life cause them to change… if you were to have helped adults, you might’ve helped some kind people, but it is hard to say who is kind and who is evil. If you had helped evil people, it would’ve reduced your karmic merit.”\u003c/p\u003e\n\u003cp\u003eJi Ning now realized what he meant.\u003c/p\u003e\n\u003cp\u003e“The Book of Life and Death had preordained that you would only live to be sixteen. However, because of your accumulated merits, you were allowed to live until age eighteen.” Lord Cui sighed.\u003c/p\u003e\n\u003cp\u003e“What?” Ji Ning was shocked. “Are you saying that the fates contained within the Book of Life and Death can be changed?”\u003c/p\u003e\n\u003cp\u003e“Of course they can be changed. Why can’t they be changed?” Lord Cui laughed. “For me, adding a hundred years to a person’s life is nothing. Even if the Heavens wanted you dead, they\u0026nbsp;would still give you a chance to survive, much less the Book of Life and Death. A person’s destiny is preordained, true, but it can be changed later on.”\u003c/p\u003e\n\u003cp\u003eJi Ning now understood.\u003c/p\u003e\n\u003cp\u003eIt was true.\u003c/p\u003e\n\u003cp\u003eThe ancients said, “If Heaven commits a sinful act, one can go against it; but if you do a sinful act, then you will not be allowed to live.” If Heaven wanted you to die, it would still give you a chance at life. The Book of Life and Death was nothing more than preordained destiny, which one could try and change afterwards.\u003c/p\u003e\n\u003cp\u003e“I believe there are many people who accumulated great merit. Palace Lord, why did you summon me alone?” Ji Ning asked, puzzled.\u003c/p\u003e\n\u003cp\u003eLord Cui laughed. “Because… you and I are from the same hometown.”\u003c/p\u003e\n\u003cp\u003e“From the same hometown?” Ji Ning was stunned. “Are you also from…”\u003c/p\u003e\n\u003cp\u003e“Right. According to the words you ‘modern’ people use, I’m also from Earth!” Lord Cui laughed. “But that was back in the era of the Sui and Tang dynasties.”\u003c/p\u003e\n\u003cp\u003eThe Sui and Tang dynasties?\u003c/p\u003e\n\u003cp\u003eJi Ning was extremely excited. “I heard those ghosts say that they were ‘princes’ or ‘devil kings’. None of them are from Earth.”\u003c/p\u003e\n\u003cp\u003e“It is normal for them to not be from Earth. In the infinite universe of space-time, there are three realms; the Heaven, the Netherworld, and the Mortal Realms.” Lord Cui explained, “Heaven refers to the Heaven Realm! The Netherworld refers to the underworld, the Netherworld Kingdom! Mortal, refers to the Mortal Realm. In the Mortal Realm, there are over three thousand major worlds and trillions of minor worlds…the three thousand major worlds are all extremely vast, and have Immortals and Devils hidden within them. As for the trillions of minor worlds, all of them are much smaller and have much lower populations. Our hometown, the Earth, is one of those minor worlds. Up until now, there are still only a couple billion people.”\u003c/p\u003e\n\u003cp\u003e“Every moment, in those three thousand major worlds and trillions of minor worlds, there are countless deaths, and the spirits all come here to the Netherworld Kingdom! Tell me, how many ghosts does the Netherworld Kingdom have?” The Lord of Cui Palace looked at Ji Ning.\u003c/p\u003e\n\u003cp\u003eJi Ning was shocked.\u003c/p\u003e\n\u003cp\u003eMy God!\u003c/p\u003e\n\u003cp\u003eThree Realms?\u003c/p\u003e\n\u003cp\u003eThe Mortal Realm was enormous. The Earth was just one of a trillion minor worlds. As a human of Earth, in the past, he always thought the Earth was the center of the universe! But now, he realized… that the Earth was just one of a trillion minor worlds, and couldn’t even be considered one of the three thousand major worlds. In an instant, he had a sense of loss and disorientation.\u003c/p\u003e\n\u003cp\u003e“Three thousand major worlds, a trillion minor worlds. Of course there’s many people who have high merit. But it is rare that there is someone from my hometown who has accumulated such high merit, and what’s more, your preordained fate was a short life. For you to be able to reach such a level despite that is very rare! I just happened to have some free time, so I wanted to meet you, my fellow Earthling,” Lord Cui said. “You are going to reincarnate soon. Let me tell you about the Six States of Reincarnation.”\u003c/p\u003e\n\u003cp\u003e“The Six States of Reincarnation refers to Devas, Asuras, Humans, Animals, Preta Ghosts, and Hell Beings.\"\u003c/p\u003e\n\u003cp\u003eLord Cui explained, “Those who are born as Devas and Asuras are all considered to be in the ‘Heaven Realm’.”\u003c/p\u003e\n\u003cp\u003e“Humans and Animals are part of the Mortal Realm.”\u003c/p\u003e\n\u003cp\u003e“Preta Ghosts and Hell-beings are in the Netherworld Kingdom Realm.”\u003c/p\u003e\n\u003cp\u003e“The Heaven Realm is the place where you are about to be reborn in.” These words immediately caused Ji Ning to grow alert. The Lord of Cui Palace sighed, “This is the best place to be. When you are reborn into the Heaven Realm, nature itself will give birth to you as a Deva! Only someone who is born naturally by the heavens can be described as an ‘immaculate lifeform’.”\u003c/p\u003e\n\u003cp\u003e“Born by nature? Not by a mother?” Ji Ning was absolutely shocked.\u003c/p\u003e\n\u003cp\u003e“Of course.” Lord Cui laughed. “Otherwise, how could you be considered an ‘immaculate lifeform’? Strictly speaking, the heavens and the earth will be your parents!”\u003c/p\u003e\n\u003cp\u003e“After being born into the Heaven Realm, you will train at an astonishing pace. You will easily be able to enter the Celestial Court and become a soldier or a general of Heaven.” Lord Cui sighed emotionally.\u003c/p\u003e\n\u003cp\u003eJi Ning rubbed his eyes.\u003c/p\u003e\n\u003cp\u003eA soldier or general of Heaven?\u003c/p\u003e\n\u003cp\u003eHe was going to become a soldier or general of Heaven?\u003c/p\u003e\n\u003cp\u003e“Devas have another advantage; once you turn sixteen, you will regain all your memories of your previous lives.” Lord Cui sighed. “The only reason I met you this time was because you had high merit and are a fellow countryman. I didn’t expect that when you came here… you would’ve been spellbound by the painting of Nuwa, the creator of humans. Your insight and perception is indeed quite\u0026nbsp;high. For the sake of helping you to become a stand-out soldier of Heaven, I’ll give you some help.”\u003c/p\u003e\n\u003cp\u003eJi Ning was absolutely delighted. Help him? Help him out?\u003c/p\u003e\n\u003cp\u003e“Stare at the painting of Nuwa.” Lord Cui pointed at the painting on the wall.\u003c/p\u003e\n\u003cp\u003eJi Ning looked at it.\u003c/p\u003e\n\u003cp\u003eSo that woman in the painting was the goddess Nuwa?\u003c/p\u003e\n\u003cp\u003e“The person on this painting is the most holy and most compassionate primordial goddess, Miss Nuwa.” The face of Lord Cui turned solemn. “Ever since Pangu died after creating the universe, only she, Miss Nuwa, has reached Pangu’s level. Miss Nuwa is capable of destroying the universe, but also capable of healing it. She can even create new life. Of the countless races, the human race is the most spiritual one, and it was created by Miss Nuwa. She has understood 84,000 truths, and without question, she is the most invincible, powerful presence in the Three Realms.”\u003c/p\u003e\n\u003cp\u003e“The highest in the Three Realms?” Ji Ning was stunned.\u003c/p\u003e\n\u003cp\u003eNuwa created humans, and Nuwa repaired the world. He had long ago heard of these myths.\u003c/p\u003e\n\u003cp\u003e“This painting is used for the visualization technique, but there’s no way you can see the secrets hidden within it.” Lord Cui laughed. “Although you are about to become a Deva and a heavenly warrior and will also be trained in this, let me first teach you a bit of the visualization technique and fulfill the karmic bonds that brought us together.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Lord Cui.” Ji Ning bowed so low, he almost reached the ground.\u003c/p\u003e\n\u003cp\u003e“No need to thank me. It is nothing more than a visualization technique. It isn’t some sort of secret training method, or a magical technique of the Immortals or the Devils.” Lord Cui pointed a single finger at Ji Ning’s forehead.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eJi Ning felt his brain suddenly explode, and an enormous figure of Nuwa appeared in his mind.\u003c/p\u003e\n\u003cp\u003e“Wake up.” Lord Cui looked at Ji Ning. “Remember. Often visualizing her will definitely allow you to train your soul. But of course, you are about to be reborn and you’ll need to drink Grandma Meng’s Elixir. You will temporarily lose your memory. When you turn sixteen, you will remember this visualization technique. But that’s enough. It will definitely be enough to let you become an outstanding figure in the army of Heaven! With this visualization technique, you will have a chance to train to become an Immortal. If you wish to become a Celestial Immortal, you will suffer many trials…I hope that you will succeed, and in the future, we will meet again in the Celestial Court.”\u003c/p\u003e\n\u003cp\u003eJi Ning’s heart was filled with excitement.\u003c/p\u003e\n\u003cp\u003eThe army of Heaven?\u003c/p\u003e\n\u003cp\u003eBecoming an Immortal?\u003c/p\u003e\n\u003cp\u003eHe really looked forward to it all.\u003c/p\u003e\n\u003cp\u003e“Go.” The Lord of Cui Palace waved his hand.\u003c/p\u003e\n\u003cp\u003eHua.\u003c/p\u003e\n\u003cp\u003eJi Ning disappeared.\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-1-chapter-1","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
