{"id":50790,"no":1093,"title":"Book 32, Chapter 11 - The Focal Spot","content":"\u003cp\u003e“The second Voidsea Jadeseal is the only shot we have. We have to acquire it, no matter what the cost!” This was what the vast majority of the frantic Daolords within the ninth layer were thinking. Realmsoul Polo’s words had let them realize that the final three seals were out of their grasp, with only the most supreme of Daolords having a shot at them. This naturally meant that they were all the more frantic to acquire the second seal!\u003c/p\u003e\n\u003cp\u003eMoments later, Realmsoul Polo pointed towards a certain direction. “There’s where it is.”\u003c/p\u003e\n\u003cp\u003e“Let’s go, hurry!”\u003c/p\u003e\n\u003cp\u003e“We need to go there at maximum speed!”\u003c/p\u003e\n\u003cp\u003eAll of the Daolords within the ninth layer frantically charged towards that direction. As for the Daolords who were in the eighth layer, they all shared the same hope: “Perhaps the ones who acquire the Voidsea Jadeseal will flee in our general direction with it.”\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! One heartworld projection after another descended upon the location of the second Voidsea Jadeseal.\u003c/p\u003e\n\u003cp\u003eThe most supreme Daolords, including Sectlord Timedream and Daolord Tigrone, were just as anxious as the weaker Daolords. Daolord Tigrone’s displayed prowess in continuously holding the upper hand in his fight against King Gorsch had caused the Palace of Immortals to once more update its rankings. King Gorsch had completely vanished from the list, with Daolord Tigrone assuming his original position at number seven.\u003c/p\u003e\n\u003cp\u003e“Daolord Darknorth is the closest to that position.”\u003c/p\u003e\n\u003cp\u003e“Darknorth and Solesky of Vastheaven Palace are over there!”\u003c/p\u003e\n\u003cp\u003eThe Heartforce Cultivators all conversed with each other regarding this. Prior to this, Ning had been a member of this informal association as well, but with him being the closest to the second Voidsea Jadeseal he was obviously now the common enemy of all other Daolords.\u003c/p\u003e\n\u003cp\u003e“I’ll suppress them,” Sectlord Timedream immediately sent mentally.\u003c/p\u003e\n\u003cp\u003e“Delay them and trap them as quickly as possible,” Winesage sent mentally. Winesage was feeling quite frantic as well. Judging from how things were shaking out with the first and second seals, power mattered but luck mattered just as much! Although Winesage was without question the most powerful Daolord present, if he was too far away he would have no shot at acquiring one, no matter how much he wanted it.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eAlthough this took time to describe, in truth it happened almost instantly. Sectlord Timedream’s heartworld projection came crashing down, suppressing Ning, Ninedust, Solesky, and Badlands as they ran.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! The nine novessence arts and the Ripplewater art blasted out, fighting back against Sectlord Timedream’s heartworld projection. Ning’s own heartworld projection came crashing out as well, doing its best to disrupt Timedream’s.\u003c/p\u003e\n\u003cp\u003eNing’s own heartworld projection ended up crumbling repeatedly, but the nine novessence arts and the Ripplewater arts were able to hold on despite shuddering and shaking. Ning, Solesky, Ninedust, and Badlands weren’t impeded or slowed down in the slightest, and they charged straight towards that nearby river.\u003c/p\u003e\n\u003cp\u003e“Everyone, Daolord Darknorth and his squad are closest to this second seal. Their squad includes Daolord Solesky and Daolord Badlands.” Sectlord Timedream immediately sent this information to the squads of Daolords who were closest to that area. “They have incredibly powerful secret arts and a heartworld projection at all, allowing them to just barely negate the power of my heartworld projection. You have to be careful when fighting them, gentlemen.”\u003c/p\u003e\n\u003cp\u003e“Daolord Darknorth’s squad?”\u003c/p\u003e\n\u003cp\u003e“Vastheaven Palace truly is lucky.”\u003c/p\u003e\n\u003cp\u003e“We have to stop them.”\u003c/p\u003e\n\u003cp\u003eThe nearby squads of Daolords all frantically charged towards Ning’s position.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Damn!” Winesage had an ugly look on his face, his black robes fluttering in the wind. “The second one is almost as far from me as the previous one was.”\u003c/p\u003e\n\u003cp\u003eThe first Voidsea Jadeseal had been very far away from Winesage; Ning’s group had been much closer by comparison. The second Voidsea Jadeseal was a bit closer, but as everyone had chased after King Gorsch they had naturally began to draw closer and closer to each other. Compared to where the other Daolords were located, Winesage was still very far away from Ning’s squad!\u003c/p\u003e\n\u003cp\u003e“What the hell is going on? Am I experiencing bad luck to balance out my overwhelming advantage in power?” An anxious look was in Winesage’s eyes.\u003c/p\u003e\n\u003cp\u003eSwish! Although he was enraged and anxious, he still charged straight towards Ning’s direction. They were fairly far away, and there were a number of supreme Daolords much closer than him. Despite that, he still moved towards Ning’s direction. So long as he had a chance, he wouldn’t give it up.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! Boom!\u003c/p\u003e\n\u003cp\u003eThe four of them dove into the water, one after the other. Ninedust was the fastest, Ning was second, Solesky was third, and Badlands was last. However, since they were all so close to the river, there really wasn’t much of a difference between them as they dove in.\u003c/p\u003e\n\u003cp\u003e“Where is it?”\u003c/p\u003e\n\u003cp\u003e“Where is the Voidsea Jadeseal?”\u003c/p\u003e\n\u003cp\u003eNinedust was the first to dive into the water, and he stared downwards as he frantically sought the seal.\u003c/p\u003e\n\u003cp\u003e“It’s coming from over there!” This river was so incredibly wide and deep it had some underwater mountains and valleys at the bottom. The white pillar of light was coming from one of those underwater valleys.\u003c/p\u003e\n\u003cp\u003eSwoosh! Ninedust immediately charged towards that gorge.\u003c/p\u003e\n\u003cp\u003e“It’s over there!” Ning was just a heartbeat slower, and he immediately flew towards that gorge as well. Solesky and Badlands quickly followed right behind him.\u003c/p\u003e\n\u003cp\u003eThey were all very good friends, but this matter involved their chances at the Daomerge. None of them would give up this opportunity for mere friendship! They had agreed long ago that the seal would go to whoever managed to acquire it! Even when Solesky had first asked Badlands to help out, the latter had agreed to send his avatar partially out of a desire to acquire a different treasure known as the ‘Heartshift Pearl’. Heartshift Pearls were also useful in the Daomerge, but it was unfathomably inferior to the Voidsea Jadeseals, which allowed you to artificially induce a Daomerge.\u003c/p\u003e\n\u003cp\u003eIn truth, Badlands didn’t care all that much about the Heartshift Pearl, but he did desperately want a Voidsea Jadeseal.\u003c/p\u003e\n\u003cp\u003eSwoosh! Swoosh! Swoosh! Swoosh! The four charged deep into the underwater gorge.\u003c/p\u003e\n\u003cp\u003e“Where is it? Where is the seal?” After charging into the gorge, Ning’s first instinct was to use his heartworld projection to scan every inch of it. Alas, he wasn’t able to find any trace of it at all.\u003c/p\u003e\n\u003cp\u003e“Break!” The Ninedust Sectlord struck out with his longstaff, sending it outwards in an incredibly powerful smashing blow towards the surrounding area. But of course, he made sure to avoid hitting Ning, Solesky, or Badlands. They had long ago sworn a lifeblood oath not to harm each other.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! The entire underwater gorge began to crumble apart as the water and the stone were both vaporized by the strike.\u003c/p\u003e\n\u003cp\u003eSolesky and Badlands began to frantically assault the underwater gorge as well, as did Ning.\u003c/p\u003e\n\u003cp\u003e“Nothing. Nothing!” Ninedust was incredibly anxious.\u003c/p\u003e\n\u003cp\u003e“It has to be in this gorge. It has to be!” The four continued their furious assault against the gorge.\u003c/p\u003e\n\u003cp\u003eBOOM! Daolord Solesky delivered a vicious punch, causing the dense stone face of one particular mountain to break apart. Inside there was a stone pillar, and atop the stone pillar hovered a round piece of jade that emanated a milky-white aura of light. It was the Voidsea Jadeseal!\u003c/p\u003e\n\u003cp\u003eSwoosh! Swoosh! Swoosh! Ning, Ninedust, and Badlands all turned to look towards Solesky’s position.\u003c/p\u003e\n\u003cp\u003eDaolord Solesky stared blankly for a second, then immediately punched out again and smashed apart the protective formation around the stone pillar. He easily shattered the formation, then reached out to grab the Voidsea Jadeseal.\u003c/p\u003e\n\u003cp\u003e“But…” Ninedust was stunned.\u003c/p\u003e\n\u003cp\u003e“Big brother Solesky…” Ning had a mixed look on his face.\u003c/p\u003e\n\u003cp\u003e“I wasn’t unable to divine any of this through my Numerancy at all…” Badlands shook his head.\u003c/p\u003e\n\u003cp\u003eAlthough they were all lifelong friends, this was a supreme Daomerge treasure. None of them would give way.\u003c/p\u003e\n\u003cp\u003e“I’m the fastest and the strongest… and yet, in the end you were the one to win the treasure, Solesky. I really didn’t expect this.” Ninedust shook his head. “I have nothing to say.”\u003c/p\u003e\n\u003cp\u003eDaolord Solesky was overwhelmed with delight. The four of them had been working together to destroy the gorge and find the Voidsea Jadeseal, but he just so happened to be right next to it. A single lucky punch from him had shattered the stone pillar hiding the Voidsea Jadeseal! It naturally fell into his hands. Ninedust and Ning didn’t even have a chance to try and intercept him.\u003c/p\u003e\n\u003cp\u003e“Everyone, I won out of pure luck. However, what really matters right now is escaping with this thing. I’m confident that the nearby Daolords will soon arrive,” Daolord Solesky sent frantically towards Ning and the others.\u003c/p\u003e\n\u003cp\u003e“What are you thinking? Are you hoping for us to help you in your escape?” The Ninedust Sectlord frowned and said in an icy voice, “The escape will be incredibly dangerous. Even King Gorsch died when trying to flee with the seal! If we try to help you escape, we’ll probably die as well, and even if we survive we won’t be the ones to benefit from the Voidsea Jadeseal. Why the hell should we help you? That’s not even mentioning the fact that you are so weak, you wouldn’t even be able to help us out when fighting those enemies.”\u003c/p\u003e\n\u003cp\u003eAlthough they were on the same team and had sworn oaths not to harm each other, that didn’t mean they all had to risk their lives for each other!\u003c/p\u003e\n\u003cp\u003e“I… I realize I asked for too much.” Daolord Solesky’s face went blank for a moment, but he quickly recovered.\u003c/p\u003e\n\u003cp\u003e“Big brother Solesky, don’t fight back.” Ning waved his hand, causing Daolord Solesky to be drawn into his estate-world.\u003c/p\u003e\n\u003cp\u003e“Darknorth, what the hell?” The Ninedust Sectlord was stunned.\u003c/p\u003e\n\u003cp\u003e“Big brother Solesky once saved my live, and we are both brothers of Vastheaven Palace. How can I just wash my hands of him?” Ning shook his head. “Don’t worry about this, brother Ninedust. I’m not exactly helpless. I’ll flee for as long as I can. If I feel like I really don’t have a chance to escape, I’ll just hand the seal over.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-32-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-32-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-32-chapter-11","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
