{"id":50830,"no":1133,"title":"Book 33, Chapter 23 - Adventure’s End","content":"\u003cp\u003eThey would rather surround and attack Winesage than have to deal with Darknorth. Although Winesage was slightly stronger than Darknorth, he fought in a direct and aboveboard manner. The Daolords all knew where he was, at least! This made surrounding him and attacking him much easier. If Winesage wanted to attack one of them, the others would see it coming and be able to prepare for him accordingly. Daolord Darknorth, however, was another story.\u003c/p\u003e\n\u003cp\u003eHe had assassination arts that allowed him to vanish without a trace, keeping all of the Daolords on their toes. This sort of feeling was quite uncomfortable!\u003c/p\u003e\n\u003cp\u003eWhoosh. Ning appeared out of nowhere close to two of the Daolords.\u003c/p\u003e\n\u003cp\u003e“He’s over there!”\u003c/p\u003e\n\u003cp\u003e“Retreat, quick!”\u003c/p\u003e\n\u003cp\u003e“Don’t take him head-on!”\u003c/p\u003e\n\u003cp\u003eThe two Daolords were so terrified that they turned pale. By now, everyone knew that Winesage and Darknorth stood at the very apex of power amongst the supreme Daolords. Even the third-ranked Daolord Dreamlore had been blasted back by a single strike from Darknorth! The difference in power was quite apparent.\u003c/p\u003e\n\u003cp\u003eSwoosh. Ning charged straight forwards, easily deflecting the secret arts and treasures that were assaulting him.\u003c/p\u003e\n\u003cp\u003eSwish! Swish! Two streaks of mist-formed sword energy tore through the air. Although those two supreme Daolords strove to defend, they were still both knocked flying back from this single clash. One had been struck on the body while the other had been able to block with a shield-type treasure, but even then he was sent flying from the tremendous power of Ning’s sword.\u003c/p\u003e\n\u003cp\u003e“Everyone, let’s pause for a moment.” Ning’s voice rang out.\u003c/p\u003e\n\u003cp\u003eThe twenty-plus attacking Daolords all had ugly looks on their faces, but they did indeed pause as they all stared at Ning.\u003c/p\u003e\n\u003cp\u003eWhoosh. Only now did the vast waveformed Ninedust reach Ning’s side, where he quickly returned to his human shape once more.\u003c/p\u003e\n\u003cp\u003eWinesage, Ning, and Ninedust stood shoulder-to-shoulder.\u003c/p\u003e\n\u003cp\u003eNing smiled as he looked at the Daolords before him. “Daolords, you should know quite well that with Winesage, myself, and Ninedust working together, we would be able to defeat even ten supreme Daolords… and given my assassination arts, I imagine that it wouldn’t be too hard to actually kill a few of you.”\u003c/p\u003e\n\u003cp\u003e“Hmph.” These supreme Daolords were extremely unhappy to hear this, but they all knew that Ning was telling the truth. Just now, he had merely struck out with two swords against those two supreme Daolords. If he had focused all six swords on one of them, he probably would’ve been able to smash that supreme Daolord to death! By himself, he might not be that grave of a danger, but with Winesage and Ninedust assisting him, Ning would be an utter terror to deal with. This was only worsened by the fact that Dawnstar, Ninestone, and Cloudwalker couldn’t even attack Ning.\u003c/p\u003e\n\u003cp\u003e“Darknorth,” Palace Lord Dawnstar called out.\u003c/p\u003e\n\u003cp\u003e“Brother Dawnstar, treasures go to the strong and the deserving,” Ning said. “All of us have come here to compete over the treasures, and we do that based on how strong we are as well as how lucky we are. Winesage has promised me enough treasures to agree to help him out. If this battle continues… you won’t be able to harm us, but some of you will probably die.”\u003c/p\u003e\n\u003cp\u003e“Hmph.” Daolord Dreamlore and the others all had ugly looks on their faces.\u003c/p\u003e\n\u003cp\u003e“Darknorth ended up taking advantage of the situation.”\u003c/p\u003e\n\u003cp\u003e“Winesage won two of the Voidsea Jadeseals, while Darknorth acquired almost all of the command talismans. These two bastards.” The supreme Daolords felt rather resentful at this outcome.\u003c/p\u003e\n\u003cp\u003e“What, do you really want to keep fighting instead of bringing this to a close?” Ning said calmly, “I really don’t care one way or the other.”\u003c/p\u003e\n\u003cp\u003e“Gentlemen, shall we keep fighting?” Winesage said coldly\u003c/p\u003e\n\u003cp\u003eAll of the Daolords were prepared to act without remorse for the sake of these treasures… but alas, they had encountered the even more remorseless Ji Ning and Winesage.\u003c/p\u003e\n\u003cp\u003eThe supreme Daolords exchanged glances. Although they didn’t want to accept this, they could read the writing on the wall. Winesage himself was far stronger than all other Daolords. As for Darknorth, he had already been strong prior to entering Crimsonwave Temple, and he had now grown to become even more terrifying. Once these two terrifying Daolords joined together, they truly would be a deadly force to reckon with.\u003c/p\u003e\n\u003cp\u003e“You two really are nasty pieces of work.” Daolord Dreamlore turned and started to walk away. “Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Let’s leave.” One supreme Daolord after another began to step into the teleportation diagram.\u003c/p\u003e\n\u003cp\u003eNinestone looked at Ning. “Darknorth, I imagine you ended up making a killing off of Winesage. Impressive.”\u003c/p\u003e\n\u003cp\u003e“King Nine.” Ning nodded. “It was all luck.”\u003c/p\u003e\n\u003cp\u003e“I want to have your luck,” Palace Lord Dawnstar muttered.\u003c/p\u003e\n\u003cp\u003e“Let’s go. We have some fruit to harvest as well,” Palace Lord Cloudwalker said.\u003c/p\u003e\n\u003cp\u003eThere were a total of nine command talismans. Ning\u0027s group had eight of them, while Dawnstar’s group had acquired one as well… the eighth command talisman!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Daolords were all quite intelligent. They’d only fight if they felt that they had a chance at victory. If their chances were nil, who would be so foolish as to get into a fight and possibly die? Thus, once Ning and Ninedust showed themselves, Ning only had to display a bit of his power in order to let them know that it was time to leave.\u003c/p\u003e\n\u003cp\u003e“You utter savage.” Winesage turned to look at Ning, a mixed look on his face. “You didn’t have to do a damn thing, but now I have to give you all my treasures.”\u003c/p\u003e\n\u003cp\u003e“Cut the crap. Hurry up and hand’m over,” Ning said with a grin on his face.\u003c/p\u003e\n\u003cp\u003eThere was nothing Winesage could do. Still, although he looked quite helpless and unhappy, he was actually in an excellent mood. His lifespan was coming to its end, after all! If he failed his Daomerge, what would be the point of keeping all those treasures? If he succeeded, he would become a Hegemon, making the treasures of even less use to him! This was why the Voidsea Jadeseal and the Universe weapon truly were the only things that really mattered to him right now.\u003c/p\u003e\n\u003cp\u003e“Take it. I’ve killed quite a few supreme Daolords and collected all of their treasures. Now, all of it will belong to you.” Winesage handed over a round disc.\u003c/p\u003e\n\u003cp\u003eNing accepted the disc. Once he scanned it, he immediately revealed a look of delight. Due to the lifeblood oath binding them, Ning didn’t worry about Winesage holding anything back at all; if Winesage had, he would’ve already seen his truesoul shattered by the lifeblood oath.\u003c/p\u003e\n\u003cp\u003e“Come, come, come! Ninedust, this portion is yours.” Ning swept through the disc with his godsense, then quickly split the treasure up into two portions. One portion, Ning put into a storage gourd which he then handed to Ninedust.\u003c/p\u003e\n\u003cp\u003e“Fine.” Ninedust didn’t decline, electing to accept the gourd. Once he scanned it: “My goodness, that’s a lot of treasure! That’s far more than I had originally.” Ninedust was delighted.\u003c/p\u003e\n\u003cp\u003e“This is Winesage we’re talking about! How could you and I compare to him when it comes to wealth?” Ning smirked.\u003c/p\u003e\n\u003cp\u003eThe nearby Winesage couldn’t help but let out a cold snort when he heard this. Still, he chose to stay next to Ning and Ninedust. Only by travelling alongside them would his safety be guaranteed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing, Ninedust, and Winesage travelled together to each of the Grovekeepers, using up the various command talismans to acquire the fruit they needed. Crimsonwave Temple had a total of nine types of fruit, and Ning managed to acquire eight of them.\u003c/p\u003e\n\u003cp\u003eIn truth, this was primarily because he had chosen from the beginning to give up on the Voidsea Jadeseals and instead focus his time and attention on the third world. That was why he had acquired so many command talismans… especially seeing as how it was his decision to let Ninedust take a jade seal that resulted in Ninedust giving him all three command talismans! But of course, the other reason was that Ning was indeed strong enough. He and Winesage completely eclipsed all other Daolords in power.\u003c/p\u003e\n\u003cp\u003eWhoosh! Whoosh! Whoosh! Three streaks of light flew out of Crimsonwave Temple. They included a white-robed youth with a golden scabbard on his back, a black-robed man, and a silver-robed man bearing a staff.\u003c/p\u003e\n\u003cp\u003e“We finally made it out.” Winesage smiled.\u003c/p\u003e\n\u003cp\u003e“Let’s go. Let’s leave this place.” Ning stared forwards towards the giant spatial tunnel in front of them that traversed the skies. Clearly, the realmsoul had established this tunnel as a way out of the Waveshift Realm.\u003c/p\u003e\n\u003cp\u003e“Time to leave.” Ninedust revealed a delighted look as well.\u003c/p\u003e\n\u003cp\u003eAll three of them had won many things here.\u003c/p\u003e\n\u003cp\u003eWinesage had acquired two of the Voidsea Jadeseals.\u003c/p\u003e\n\u003cp\u003eNinedust had won a Voidsea Jadeseal and had also acquired many treasures.\u003c/p\u003e\n\u003cp\u003eJi Ning hadn’t acquired any of the seals, but he had harvested the priceless fruits of eight command talismans.\u003c/p\u003e\n\u003cp\u003e“Time to go.” The three transformed into streaks of light that soared into the skies, quickly departing from the Waveshift Realm.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA large host of figures were waiting outside the spatial tunnel that exited the Waveshift Realm. These were all ancient Eternal Emperors. They normally were secluded in different parts of the Endless Territories, but they had all gathered here today.\u003c/p\u003e\n\u003cp\u003eAt the very front of the vast host, there were six groups of tremendous power. These were the leaders of the Dao Alliance, the Brightshore Kingdom, the Aeonians, the Aberrant special lifeforms, and the Ancient cultivators. All of them stared towards the tunnel with anticipation.\u003c/p\u003e\n\u003cp\u003eWhoosh. Whoosh. Whoosh. One Daolord after another flew out.\u003c/p\u003e\n\u003cp\u003e“They’re coming out.”\u003c/p\u003e\n\u003cp\u003e“Here they come.” Quite a few of the ancient Emperors had been waiting anxiously.\u003c/p\u003e\n\u003cp\u003e“Owlblack,” a white-haired elder called out.\u003c/p\u003e\n\u003cp\u003e“Ah? Patriarch!” Daolord Owlblack immediately called out respectfully upon seeing this man.\u003c/p\u003e\n\u003cp\u003e“Do you know who ended up with the coldflame cauldron fruits?” the white-haired elder immediately asked.\u003c/p\u003e\n\u003cp\u003e“The coldflame cauldron fruits. Who took them?”\u003c/p\u003e\n\u003cp\u003e“Where are they?”\u003c/p\u003e\n\u003cp\u003e“Who acquired the coldflame cauldron fruits?”\u003c/p\u003e\n\u003cp\u003eQuite a few ancient Eternal Emperors echoed this question. However, the truly high-status figures like the Hegemons were quite calm, because they had received word long ago that Ning was the one to acquire the ninth command talisman.\u003c/p\u003e\n\u003cp\u003eWhoosh. Whoosh. Whoosh. More Daolords continued to arrive. Finally, three more streaks of light flew out. They were Winesage, Ninedust, and Ji Ning.\u003c/p\u003e\n\u003cp\u003eThis entire time, the three awesome Hegemons known as Netherlily, Windrain, and Brightshore had been quite calm and quiet, as had the leaders of the other three major powers. Upon seeing the white-robed youth who had a golden scabbard on his back appear, they immediately flew in unison towards him.\u003c/p\u003e\n\u003cp\u003e“Darknorth.”\u003c/p\u003e\n\u003cp\u003e“Daolord Darknorth.”\u003c/p\u003e\n\u003cp\u003e“Darknorth, my young friend.” One call after another rang out. The most supreme Emperors of the Endless Territories were all staring at Ning, smiles on their faces and looks of incomparable friendliness in their eyes. Even the leaders of the Dark Kingdom and the Aeonians were beaming towards him.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-33-chapter-22\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-34-chapter-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-33-chapter-23","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
