{"id":50841,"no":1144,"title":"Book 34, Chapter 11 - Tianello","content":"\u003cp\u003eJi Ning and Ninedust flew quickly towards the mist to the battlefield. Meanwhile, the battle between the World-level cultivators was reaching a fever pitch.\u003c/p\u003e\n\u003cp\u003eSlash! Saber-light chopped through a World God’s body, slicing him in half. A heartbeat later, his body was ground into dust. The white-robed machete-wielding man then charged towards another World-level cultivator, a hate-filled look on his face. He was clearly the most powerful person on the battlefield. He was extremely fast and his saber-arts were exceptionally brutal.\u003c/p\u003e\n\u003cp\u003e“Maji!” The other World-level cultivator was clearly in dire straits.\u003c/p\u003e\n\u003cp\u003e“Maji, stop this!”\u003c/p\u003e\n\u003cp\u003e“Maji, you despicable lowlife. How dare you assault us members of the Tianello clan!” the other World-level cultivators bellowed furiously.\u003c/p\u003e\n\u003cp\u003e“You refused to give my clan a way out, so I’m not giving you a way out either! Kill them, my clansmen! Wipe them all out! If a single one of them escapes, we’ll be in big trouble. If we can wipe them out, we can relocate our tribe and join one of the Tianello clan’s enemies!” Maji had a savage look on his face as he bellowed.\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003e“Kill these Tianello clansmen!”\u003c/p\u003e\n\u003cp\u003e“Wipe’m out!”\u003c/p\u003e\n\u003cp\u003eAlthough the total combat power of the Tianello clansmen was higher overall, the one named Maji was simply too powerful as an individual. Thus far, he had already killed a total of twelve World-level cultivators by himself in this clash! He had been able to force the warriors of the Tianello clan to the brink of withdrawal, with only their fear of the strict laws of the clan holding them back from a complete retreat.\u003c/p\u003e\n\u003cp\u003eThey had come on the orders of the Tianello clan to take away a treasure this minor clan had acquired, a certain bugbeast core component. They were so accustomed to behaving in a domineering fashion that they had been planning to massacre the minor clan and then offer the treasure to the high-level members of the clan. As for the other treasures the minor clan had owned? They were going to split them internally.\u003c/p\u003e\n\u003cp\u003eThey had first set up a formation, planning to trap and massacre everyone. They never would’ve imagined that this weak clan’s leader, Maji, was so incredibly powerful that he had been able to burst the formation apart, then lead his clan’s World-level cultivators to fight their way out.\u003c/p\u003e\n\u003cp\u003e“Damnit.”\u003c/p\u003e\n\u003cp\u003e“They actually dare to kill the members of the Tianello clan! Let’s leave and report this to the clan immediately! We’ll have the clan send out the entire army to wipe them out and leave none of them behind.” By now, the Tianello clansmen had been shaken by Maji’s assaults. In the end, they chose to retreat. Although they would be punished upon their return for failing in their mission, at least they wouldn’t lose their lives.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Flee.”\u003c/p\u003e\n\u003cp\u003eInstantly, the World-level cultivators all began to flee frantically. But just as they began to do so, a calm voice rang out. “Don’t be in such a rush to run.” The fleeing World-level cultivators all felt their bodies turn soft. Their movements began to dramatically slow down before coming to a complete halt… and then they began to slowly fly backwards.\u003c/p\u003e\n\u003cp\u003eRight at this moment, two figures descended from the skies. One was a silver-robed man, the other was a white-robed youth who bore a sword sheath on his back.\u003c/p\u003e\n\u003cp\u003e“Daolord!” The World-level cultivators led by Maji all turned pale. The difference in power between World-level cultivators and Daolords was insurmountable.\u003c/p\u003e\n\u003cp\u003e“The Tianello clan, eh? They seem to be pretty powerful.” Ning grinned.\u003c/p\u003e\n\u003cp\u003e“Then let’s start with them,” Ninedust offered.\u003c/p\u003e\n\u003cp\u003e“Agreed.” Ning’s heartforce had already completely pervaded the souls and truesouls of the Tianello clan’s World-level cultivators, allowing him to easily rifle through their souls. Ning’s heartforce was now so powerful that he was ranked number one amongst Daolords in the Endless Territories; manipulating World-level cultivators was simplicity itself for him. Soon, Ning had completely reviewed the memories of these cultivators.\u003c/p\u003e\n\u003cp\u003e“What did you find?” Ninedust asked.\u003c/p\u003e\n\u003cp\u003e“This planet is quite interesting.” Ning smirked. As he chatted with Ninedust he made sure to block out the sound of their voices, ensuring that no one aside from the two of them could hear anything.\u003c/p\u003e\n\u003cp\u003e“Interesting?” Ninedust was puzzled.\u003c/p\u003e\n\u003cp\u003eNing said, “This planet is quite extraordinary. It’s far more powerful than that other planet we visited, Skywind’s homeland! The cultivators here are all divided up into clans, with blood lineages determining their statuses.”\u003c/p\u003e\n\u003cp\u003e“These clans are divided into the great clans, standard clans, and lesser clans. Lesser clans are the weakest, with standard clans generally having a Daolord and several golems standing guard. As for the great clans, they each have at least one ‘royal golem’ protecting them.”\u003c/p\u003e\n\u003cp\u003e“Supposedly, this planet has nine great clans, twenty-one standard clans, and countless lesser clans,” Ning explained. This was what he had learned through rifling the memories of the World-level cultivators. “Different clans can vary immensely in power. A great clan can easily wipe out one of the standard clans with a fraction of their full power, while standard clans can do the same to lesser clans. The lesser clans are viewed as of a lower caste, almost subhuman.”\u003c/p\u003e\n\u003cp\u003eNinedust was startled. “So just how many Daolords live on this planet?”\u003c/p\u003e\n\u003cp\u003e“More than thirty at the very least,” Ning said. “Possibly sixty, possibly eighty… these World-level cultivators have no clue.”\u003c/p\u003e\n\u003cp\u003e“Wow.” Ninedust was surprised. A single planet was capable of giving birth to dozens of Daolords in each given generation? This was a frightening concept.\u003c/p\u003e\n\u003cp\u003e“The Tianello clan is a standard clan and it has a single Daolord protecting it,” Ning said. “So let us start from them.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Ninedust nodded.\u003c/p\u003e\n\u003cp\u003e“You can die now.” Ning swept his gaze towards the dull-eyed World-level cultivators. Instantly, their eyes turned completely lifeless as they fell to the ground. He left just a single World-level cultivator alive, allowing the man ‘Tonkee’ to regain his clarity of mind as well.\u003c/p\u003e\n\u003cp\u003e“What just happened? What’s going on?” Tonkee stared at the surrounding area in panic. How did all of the others all suddenly die?\u003c/p\u003e\n\u003cp\u003e“Go back and tell Tianello,” Ning barked, “That I, Darknorth, killed these World Gods! Now beat it!” When Ning had rifled through their memories, he had learned that they were all Tianello’s lackeys and were so evil as to wipe out lesser clans for greed alone. Tonkee was slightly better, morally speaking, than the rest. Still, the only reason why Ning spared him was because he needed someone to send a message for him; otherwise, he would’ve killed Tonkee as well.\u003c/p\u003e\n\u003cp\u003e“Y-you killed them?” Tonkee stared at Ning in terror.\u003c/p\u003e\n\u003cp\u003e“I said… beat it.” Ning released a hint of his killing intent.\u003c/p\u003e\n\u003cp\u003eSwoosh! The terrified Tonkee immediately fled far away.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eMaji and his clansmen stared in shock as they watched this happened, completely stunned by Ning and Ninedust’s power. What stunned them even more was what Ning had just said: “Go back and tell Tianello that I, Darknorth, killed these World Gods! Now beat it!” This clearly was a direct challenge to Tianello!\u003c/p\u003e\n\u003cp\u003eTianello was the name of the Tianello clan’s leader, and he was on extremely good terms with the nine great clans. He was one of the high-level members of this world. He wasn’t an easy person to deal with!\u003c/p\u003e\n\u003cp\u003e“Senior” Maji said, forcing down his fear and nervousness. Looks of panic were on the faces of all the World-level cultivators behind him.\u003c/p\u003e\n\u003cp\u003e“What, are you scared now?” A hint of a smile was on Ning’s face.\u003c/p\u003e\n\u003cp\u003eMaji hurriedly said, “For us to fight back against them when they tried to kill us was a minor matter; the exalted Tianello would never deign to act against minor figures like us, giving us a chance to survive if we joined an enemy of the Tianello clan. But by doing this, seniors… you’ve just completely insulted him! He’s not going to rest until he resolves this matter, and his rage will be directed towards us as well.”\u003c/p\u003e\n\u003cp\u003ePeople lived for their reputations. There were only a few dozen Daolords on this planet, making them exalted figures. How could Tianello possibly just accept Ning brazenly slapping him in the face like this?\u003c/p\u003e\n\u003cp\u003e“Are you trying to say that we caused trouble for you?” Ninedust glared at them.\u003c/p\u003e\n\u003cp\u003e“N-no…” Maji began to sweat heavily.\u003c/p\u003e\n\u003cp\u003e“Ahahaha!” Ning started to laugh. “Ninedust, stop scaring these kids.” Indeed, Maji and the other World-level cultivators all felt rather uneasy now. “Just keep watching,” Ning instructed. “I’ll guarantee your safety.”\u003c/p\u003e\n\u003cp\u003eMaji and the others felt resigned. “I guess that’s that.” If they followed these two powerful Daolords, they might stand a chance at staying alive… but once they were on their own, it would be far too easy for Tianello to eradicate them.\u003c/p\u003e\n\u003cp\u003eJust one hour later, a giant vessel appeared in the skies. A white-haired old man stood at the prow of the vessel, staring towards their direction. He had a group of subordinates behind him.\u003c/p\u003e\n\u003cp\u003e“Tianello has arrived.”\u003c/p\u003e\n\u003cp\u003e“It’s Tianello.” Maji and the others felt nervous and cold.\u003c/p\u003e\n\u003cp\u003eNing and Ninedust raised their heads to glance at the vessel. Ninedust grinned at Ning: “He’s a mere Daolord of the Third Step, but he seems pretty full of himself.”\u003c/p\u003e\n\u003cp\u003eThe grand vessel slowly flew through the skies towards them. The white-robed elder stood at the prow of the ship, staring down at them. When he saw that Ning and Ninedust merely had auras of Daolords of the Second Step, he relaxed slightly. He barked out coldly, “You dared to wipe out Tianello clansmen and then insulted me? It seems that it has been far too long since I, Tianello, have displayed my pow-.”\u003c/p\u003e\n\u003cp\u003e“So shut up and do it already,” Ninedust said from below.\u003c/p\u003e\n\u003cp\u003e“Eh?” Tianello was further incensed by this interruption, and cold light flickered in his eyes. “If that is what you wish… then I will send you off to die!”\u003c/p\u003e\n\u003cp\u003eWhoosh. A giant bird that was at least three thousand meters long suddenly appeared in front of Tianello. This bird was covered in azure feathers and had a fiery red tail, as well as an awe-inspiring aura. It was actually just as powerful as Tianello, and it immediately swooped downwards.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-34-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-34-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-34-chapter-11","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
