{"id":49815,"no":118,"title":"Book 6, Chapter 18 - Ji Ning Battles Jadechild (Part 2)","content":"\u003cp\u003eThe drizzling rain drifted down gently.\u003c/p\u003e\n\u003cp\u003eJadechild’s entire body was covered with a layer of golden light. He looked like a gold armored Fiend, and his eyes were filled with solidified golden light. His very breath caused the surrounding area to tremble.\u003c/p\u003e\n\u003cp\u003eCrackle! Crackle! Crackle!\u003c/p\u003e\n\u003cp\u003eThe formerly soft, gentle rain suddenly became as sharp as knives. The countless raindrops wildly chopped towards the giant Jadechild, but the hazy golden light covering the giant Jadechild’s body effortless deflected them. He swept his gaze towards the surrounding areas. Suddenly, a ripple caught Jadechild by surprise. Without hesitating at all, he sent a fist smashing over!\u003c/p\u003e\n\u003cp\u003eA wheel-sized golden fist smashed against one particular line of rain. This line of rain was the transformed sword flash of the [Lesser Thousand Swords Formation].\u003c/p\u003e\n\u003cp\u003eHis fist was covered with a black glove, but it was also covered by that hazy golden light right now. Only if one looked closely would one see that beneath the golden light, there was a glove.\u003c/p\u003e\n\u003cp\u003eHis most powerful magic treasure was that glove!\u003c/p\u003e\n\u003cp\u003e“BANG!” An explosive sound. The giant Jadechild couldn’t help but be knocked a step back by that attack, and his backwards step caused the ground to tremble violently and fracture repeatedly.\u003c/p\u003e\n\u003cp\u003e“What an impressive Ji Ning.” The giant Jadechild narrowed his eyes. That line of rain had actually contained such astonishing power. It was definitely at the Wanxiang Adept level. No wonder that earlier group of Zifu Disciples had all been killed.\u003c/p\u003e\n\u003cp\u003e“Formidable.”\u003c/p\u003e\n\u003cp\u003e“He was actually able to make senior apprentice-brother Jadechild take a step back.”\u003c/p\u003e\n\u003cp\u003eThe hearts of the other Zifu Disciples instantly grew taut. They understood that the difference between Ji Ning and their senior apprentice-brother Jadechild probably wasn’t that great.\u003c/p\u003e\n\u003cp\u003e“You are Jadechild?” A clear, cold voice rang out. From within the black fog, an enormous draconic tail began to move, and in the center of it was a fur clad youth. The fur clad youth was wielding a sword in each hand, and around him, a lotus flower was blooming and swiveling. Surrounded by the Waterflame Lotus, he walked over.\u003c/p\u003e\n\u003cp\u003e“Ji Ning!” The giant Jadechild stared at this youth. He could sense an incomparably deep, profound mystery from that blooming lotus flower. He vaguely understood that in terms of the ‘Dao’, the youth in front of him probably had an even deeper understanding than he did.\u003c/p\u003e\n\u003cp\u003eA monster!\u003c/p\u003e\n\u003cp\u003eHe was only sixteen years of age, but had actually reached such a deep level of understanding when it came to the Dao.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003eWielding the Darknorth swords in his hands, Ning strode forward. But upon seeing Jadechild, Ning was greatly shocked. A golden light covered that massive, cliff-like, two-story high body. That invisible, powerful Fiendgod aura made even Ning feel pressure. Ning was probably only as high as the enemy’s kneecaps.\u003c/p\u003e\n\u003cp\u003e“This is the Heavenly Transformation?” Ning mused to himself. He had heard of this divine ability long ago, as this was known to be the most famous of the divine abilities.\u003c/p\u003e\n\u003cp\u003eDivine abilities were very precious and very rare.\u003c/p\u003e\n\u003cp\u003eGenerally speaking, only supreme clans, sects, and cults had access to them. However, the majority of them used this ability, ‘Heavenly Transformation’! Even in the Raindragon Guards, this divine ability was extremely famous. As the most widespread divine ability, if one wanted to learn it, naturally, the difficulty level would be a bit lower.\u003c/p\u003e\n\u003cp\u003eBut this didn’t mean that the Heavenly Transformation divine ability was weak! The prerequisites for this divine ability was low, but when trained to a very high level, it was comparable to some truly formidable divine abilities! When the Fiendgods of the primordial eras battled, they loved to use the Heavenly Transformation ability. With a single movement, one could increase to three hundred meters, three thousand meters, or even thirty thousand meters in height.\u003c/p\u003e\n\u003cp\u003eThose towering, cliff-like Fiendgod bodies could even pick up a mountain range that was thousands of kilometers long as easily as picking up a strand of straw. For them, overturning a sea or flipping over a river was just like taking a bath!\u003c/p\u003e\n\u003cp\u003eFrom this, one could see how powerful this divine ability was…\u003c/p\u003e\n\u003cp\u003eBut of course, those were simply ancient myths, like the myth of Houyi shooting down the suns. It was far too distant from them!\u003c/p\u003e\n\u003cp\u003e“Ji Ning.” Suddenly, a gentle voice rang out.\u003c/p\u003e\n\u003cp\u003eNing, who was about to do battle with the giant Jadechild, was suddenly startled. Ning looked over to the origin of that voice. Within that tower of black light, there was an old man with simple clothes and unbound hair. That man was smiling as he looked at Ning. “Your talent and potential is truly astonishing. But what is even more precious is that you were able to reach this level despite being in an ordinary, regional clan. You are certainly a rarely seen piece of unpolished jade. Your value far outstrips the value of this elemental ore mine.\u003c/p\u003e\n\u003cp\u003eNing frowned.\u003c/p\u003e\n\u003cp\u003eThe giant Jadechild was startled, as were the other Zifu Disciples as well.\u003c/p\u003e\n\u003cp\u003e“If you are willing, then I am willing to swear an oath that I will guarantee your entrance into our Snowdragon Mountain sect.” Nong Zidao said with a smile. “Given your talent, you will definitely become one of the most important and most core disciples, the ‘heir-disciples’. Upon entering our school, your status will be no lower than that of a Wanxiang Adept. Our Snowdragon Mountain will definitely expend tremendous effort in training you, making you become a true, supreme expert. In the future, even becoming a Primal Daoist…is possible!”\u003c/p\u003e\n\u003cp\u003eJadechild was startled, but then he too said in a low voice. “Ji Ning, since junior apprentice-brother Zidao is willing to swear an oath, then you don’t need to worry about this. If you join our Snowdragon Mountain, we naturally won’t hold any grudges about what happened before this. But if you refuse…then don’t blame me for being ruthless!”\u003c/p\u003e\n\u003cp\u003eNing was surprised.\u003c/p\u003e\n\u003cp\u003eThey were trying to pull him into Snowdragon Mountain?\u003c/p\u003e\n\u003cp\u003e“I killed so many of your fellow apprentices, but you’ll let me enter your school?” Ning said coldly.\u003c/p\u003e\n\u003cp\u003e“If they died, they died.” Nong Zidao shook his head. “You are different from them. Our Snowdragon Mountain has plenty of those average, ordinary Zifu Disciples! But your talent and your current level of comprehension…I truly have never seen anyone like you in all my life. As long as I make the introductions, the Primal Daoists of our Snowdragon Mountain sect will definitely accept you as a disciple.”\u003c/p\u003e\n\u003cp\u003eNing, too, had heard his parents say that given his talents, it would be utter simplicity for him to take roof under any of the major powers. Even the spirit of the underwater estate had clearly shown a markedly better attitude towards him after he had comprehended his Rainwater Sword Domain.\u003c/p\u003e\n\u003cp\u003eTo gain insight into the Rainwater Sword Domain at age sixteen…\u003c/p\u003e\n\u003cp\u003eThis sort of talent was indeed monstrous.\u003c/p\u003e\n\u003cp\u003e“The results of this grudge between your Ji clan and my Snowdragon Mountain have been the deaths of Snowdragon Mountain disciples only. Within this formation, not a single member of your Ji clan has perished. I imagine that you have no reason to feel hatred towards my Snowdragon Mountain.” Nong Zidao then said, “Since we have no hatred for each other, while you yourself come from a regional clan and have a completely clean history, and are so monstrously talented, why wouldn’t the main sect use all of its efforts to cultivate you? In a few hundred years, it’s even possible that you will become the Sect Leader of our Snowdragon Mountain.”\u003c/p\u003e\n\u003cp\u003eThe giant Jadechild also spoke out. “If you join our Snowdragon Mountain, then what happened before will be of little consequence. But if you do not join Snowdragon Mountain…given how many of our fellow apprentices your Ji clan has killed, for the sake of our face, Snowdragon Mountain will definitely annihilate your Ji clan. Consider this carefully.”\u003c/p\u003e\n\u003cp\u003e“Consider this well.” Nong Zidao said as well.\u003c/p\u003e\n\u003cp\u003eTwo options.\u003c/p\u003e\n\u003cp\u003eOne to join them; that would make them all one family. As for the dead? That would have simply been a case where a heir-disciple of extremely exalted status killed a few outer disciples. A small matter.\u003c/p\u003e\n\u003cp\u003eThe other option was to refuse. To have killed so many disciples was an affront to Snowdragon Mountain.\u003c/p\u003e\n\u003cp\u003e“Hahaha…” Ning laughed. How could he join Snowdragon Mountain? Just now, Nong Zidao had said that there was no enmity between their sides, and that Ning’s history was clean, that he was monstrously talented, and that Snowdragon Mountain would focus on training him…\u003c/p\u003e\n\u003cp\u003eBut loyalty would be the number one thing a sect would consider in cultivating its disciples.\u003c/p\u003e\n\u003cp\u003eBefore accepting him as an heir-disciple, Snowdragon Mountain would definitely do a thorough, close investigation of his history. By then, the events which happened to Ji Yichuan and Yuchi Snow would probably be revealed! Snowdragon Mountain had caused the deaths of Ning’s mother and uncle…given what a huge enmity lay between them, Snowdragon Mountain would never dare to train Ning, no matter how talented he was. Instead, it would want to destroy him as soon as possible, to prevent him from becoming a problem in the future!\u003c/p\u003e\n\u003cp\u003e“Cut the crap.” Ning barked. “Don’t even think of trying to dissuade me.”\u003c/p\u003e\n\u003cp\u003e“Ji Ning, you…” Nong Zidao, within that black tower, shook his head. “One step wrong leads to countless steps wrong. If you join Snowdragon Mountain now…it isn’t too late yet.”\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eNing didn’t waste any more words.\u003c/p\u003e\n\u003cp\u003eJust on the basis of the ‘loyalty’ issue alone…Ning would be finished once they ran a background investigation on him. It was best to follow his previous plans; annihilate all of these fellows immediately, and delay until the Grand Xia Dynasty\u0027s Celestial Envoy arrived! Once the Celestial Envoy arrived, they would have the protection of the Grand Xia Dynasty…even if Snowdragon Mountain was a hundred times as bold, they would never dare to do anything. They would have to swallow it.\u003c/p\u003e\n\u003cp\u003eAs long as he had enough time…Snowdragon Mountain? He would eventually rip them apart!\u003c/p\u003e\n\u003cp\u003e“Then die!” The giant Jadechild smiled savagely as he stomped hard against the ground.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eThe earth trembled, and countless shattered rocks and sand flew about. Within the flying sand and rocks, there could faintly be seen countless granules of sand that flashed with golden light. These golden specks of sand wildly swirled about like a giant whirlpool which surrounded the giant Jadechild, with a portion of the golden sand wildly charging towards Ning.\u003c/p\u003e\n\u003cp\u003eThis was the magic treasure which the giant Jadechild often used…the ‘Stellar Sands’!\u003c/p\u003e\n\u003cp\u003e“Thud! Thud! Thud!” The giant Jadechild stomped on the ground, leaving behind a giant golden blur as he charged towards Ning with crushing force.\u003c/p\u003e\n\u003cp\u003e“Hmph.”\u003c/p\u003e\n\u003cp\u003eThe rainwater surrounding Ning formed itself into a resilient curtain of water. The translucent water curtain was constantly swirling…when the golden sand struck wildly against it, they were all forcibly stopped by the watery curtain.\u003c/p\u003e\n\u003cp\u003e“Die!” A wheel-sized golden fist smashed through the watery curtain. In the fact of that punch, even the blooming Waterflame Lotus seemed incomparably weak.\u003c/p\u003e\n\u003cp\u003e“What astonishing speed.” Ning’s face changed slightly as the black wings behind him suddenly trembled.\u003c/p\u003e\n\u003cp\u003eDivine ability – Windwing Evasion!\u003c/p\u003e\n\u003cp\u003eWhoosh!\u003c/p\u003e\n\u003cp\u003eThe golden fist smashed through the Waterflame Lotus and pierced past Ning’s frame, but there was no hint of delight on the giant Jadechild’s face. This was because it was just an ‘afterimage’ that his fist had punched through. Ning’s speed was simply too fast, and he was too agile; he had instantly dodged.\u003c/p\u003e\n\u003cp\u003e“There’s no use. You won’t be able to escape.” The giant Jadechild took a step forward, causing the earth to crack. He himself once more transformed into a golden light as he charged towards Ning, and his fist easily tore apart the watery curtain and the Waterflame Lotus.\u003c/p\u003e\n\u003cp\u003e“Too fast.” Ning was forced to dodge again.\u003c/p\u003e\n\u003cp\u003eWhoosh…\u003c/p\u003e\n\u003cp\u003eAfter having used the Windwing Evasion three times in a row, Ning finally managed to pull away from him. Ning discovered that…in terms of straight line movements, this giant Jadechild was actually even faster than he was! After having executed the Heavenly Transformation and increased in size, Jadechild’s speed and strength rose to an astonishing level. Ning didn’t dare face him head on.\u003c/p\u003e\n\u003cp\u003eThis was because, when he had used the [Lesser Thousand Swords Formation] earlier, the enemy had used his fist to block it, and had only been forced a single step back. From this, one could tell how powerful that fist was.\u003c/p\u003e\n\u003cp\u003eFortunately, Ning had the Windwing Evasion, and so had a bit of an advantage in terms of agility. He was also more nimble to begin with, given his smaller size, while the giant Jadechild was so large that his turning ability was naturally inferior.\u003c/p\u003e\n\u003cp\u003e“[Lesser Thousand Swords Formation].” Seven hundred flying swords suddenly appeared round Ji Ning, but amongst them, only six hundred or so glowed with white light. Ning had only activated the eighty level of the [Lesser Thousand Swords Formation].\u003c/p\u003e\n\u003cp\u003eA sword flash materialized in front of his chest.\u003c/p\u003e\n\u003cp\u003e“Go.”\u003c/p\u003e\n\u003cp\u003e“Go.”\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eWhile using the Windwing Evasion to dodge, Ning simultaneously released six rays of sword light. The six rays of sword light merged into rainwater, then disappeared, transforming into lines of rain…silently, soundless, the six went sweeping towards the direction of the giant Jadechild.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-6-chapter-17\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-6-chapter-19\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-6-chapter-18","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
