{"id":50899,"no":1202,"title":"Book 36, Chapter 17 - Omega Sword Dao","content":"\u003cp\u003eJi Ning swept his gaze across the eight supreme experts of the Flamedragon Realmverse, then smiled: “Since you are all curious, I’ll chat a bit about it. However, this involves some of my personal secrets. I hope that you will not casually spread it to others; the fewer who know about it, the better.”\u003c/p\u003e\n\u003cp\u003e“That goes without saying,” Emperor Goldface said hurriedly. Was the kid joking? The fewer who knew a secret, the more precious the secret would be. If everyone knew it, the eight of them wouldn’t have any advantage at all.\u003c/p\u003e\n\u003cp\u003eThe other major powers were all delighted as well. None of them had expected Ning to be this easy-going about it.\u003c/p\u003e\n\u003cp\u003e“The path of cultivation is a stratified one; there are greater Daos and there are lesser Daos,” Ning said. “World-level cultivators must develop their own Daos and use them to become Samsara Daolords. Some gain insight into ordinary Daos, some gain insights into formidable ones, and a few will gain insight into Supreme Daos. At the very apex are those who fuse multiple Supreme Daos together into a perfect whole.”\u003c/p\u003e\n\u003cp\u003eThe three Hegemons and the five Emperors of the Dao Alliance all nodded slightly. Ning continued, “So fusing multiple Supreme Daos is the apex, the highest level of power possible, right? This is what almost all cultivators believe… but I did not believe this.”\u003c/p\u003e\n\u003cp\u003e“Are you telling me this isn’t the case?” Hegemon Windrain rumbled.\u003c/p\u003e\n\u003cp\u003e“Fusing multiple Supreme Daos has to be the apex, right?” Daoist Bluestone said, puzzled. Normally, they would state with absolute certainty that it was the apex, but facing them was Ji Ning! All of them spoke rather hesitantly; clearly, they weren’t as confident as they had been in the past.\u003c/p\u003e\n\u003cp\u003eNing smiled. “It is not the apex!”\u003c/p\u003e\n\u003cp\u003e“What?!”\u003c/p\u003e\n\u003cp\u003e“There are even stronger Daos than that?”\u003c/p\u003e\n\u003cp\u003e“But…” The three Hegemons and the five Dao Alliance Emperors were all stunned when they heard the certainty in Ning’s response. The fact that fusing multiple Supreme Daos together was the apex of cultivation was considered common knowledge and believed unquestioningly by countless cultivators. This was the most difficult path possible… and once one succeeded in the Daomerge, one would become a Hegemon! However, Ji Ning was now telling them that there was something above that, an even more difficult and even more exalted path.\u003c/p\u003e\n\u003cp\u003e“Above fused Supreme Daos is an even superior Dao… and it is this type of Sword Dao that I used to become a Samsara Daolord,” Ning said.\u003c/p\u003e\n\u003cp\u003e“So that’s the reason.” Hegemon Netherlily nodded slowly. “As a Daolord, I did realize that my Dao was able to slowly grow and improve in strength as it drew upon the mysteries of the other Daos I trained in, allowing me to develop increasingly powerful ultimate attacks. Even back then, I was slightly puzzled by this… why was it that my fused Supreme Daos could benefit from other mysteries and continue to grow even more powerful? Was it possible that there was something above them? Now that I see Darknorth… I finally understand.”\u003c/p\u003e\n\u003cp\u003eNing smiled. Right. Daolords who walked other paths were able to use the mysteries of other Daos to perfect their own while training, allowing them to develop stronger techniques. For example, even someone who had fused three Supreme Daos of Water would not have a Dao that fully encompassed everything pertaining to the essence of water. Naturally, he would be able to drawn more from other Daos to slowly perfect his own understanding of water.\u003c/p\u003e\n\u003cp\u003eNing, however, was different. His path was that of the Omega Sword Dao; it represented the true apex! At each individual stage, there was literally nothing further he could learn regarding the sword. This was why, once he made a breakthrough, he gained immediate access to the most perfect versions of the five stances of his Omega Sword Dao and was unable to create better techniques. He was different from other Daolords.\u003c/p\u003e\n\u003cp\u003e“I have named my Dao the Omega Sword Dao,” Ning said, then laughed. “But of course, I’m just assuming that it is the true apex. Perhaps, after countless years pass, yet another dazzling genius will appear and will tell me that there’s something that’s even superior to to my Dao. Haha…”\u003c/p\u003e\n\u003cp\u003e“If your Omega Sword Dao surpasses even fused Supreme Daos… it really should be the apex.” Hegemon Brightshore nodded slowly.\u003c/p\u003e\n\u003cp\u003e“Yes, it’d be ridiculous if there was anything more powerful,” the others agreed.\u003c/p\u003e\n\u003cp\u003eNing smiled. When he had developed his Omega Sword Dao, a resonance had been generated with the prime essence of the Dao of the Sword. In that instant, Ning had immediately understood that he had developed the most perfect and complete Sword Dao possible. He was a true master of the Dao of the Sword.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAbove fused Supreme Daos was an even more profound type of Dao! Ning had long ago prepared to divulge this secret. If he said nothing at all, he would only attract even more suspicion from the various major powers. It was better to explain things clearly.\u003c/p\u003e\n\u003cp\u003eAnd… just telling them about it wouldn’t impact him personally. So what if they learned that a stronger Dao existed? It must be remembered that there were plenty of World-level geniuses who had fused multiple Supreme Daos together, and quite a few even had Hegemonic legacies. In each era, however, only a tiny number of them managed to become supreme Daolords.\u003c/p\u003e\n\u003cp\u003eEmperor Heartsword had made his [Heartsword] art available for public dissemination, and many had studied this set of sword-arts… but to this very day, the only person to truly master it remained Emperor Heartsword himself! None of those who had come later had been able to truly master it.\u003c/p\u003e\n\u003cp\u003eNing’s ‘Omega Sword Dao’ was even tougher to master than the [Heartsword] art! It was on a much higher level than fused Supreme Daos!\u003c/p\u003e\n\u003cp\u003eSuch a difficult Dao… even if Ning actually made it completely public as the [Omega Sword Dao] manual for others to study, who knew how long it would be before another peerless genius would be able to reach Ning’s level in it? And of course… Ning wasn’t planning to make it public!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“The Omega Sword Dao.” This name caused the major powers to all sigh in amazement. It was too late for them to learn of Omega Daos… they had all become Emperors thanks to fused Daos. Once a Dao had been chosen, there was no way to go back on it!\u003c/p\u003e\n\u003cp\u003e“Fellow Daoist Darknorth.” Emperor Goldface smiled. “Now that I’ve heard of these incredible Omega Daos, I truly feel admiration and awe. I wonder… would you be willing to let me inspect your [Omega Sword Dao] technique and broaden my horizons? Although there’s no way for me to start over on my path of cultivation, it would at least allow me to learn a few things.”\u003c/p\u003e\n\u003cp\u003eNing frowned. Let him take a look at it? Broaden his horizons? How could he casually allow others to inspect his Dao? Although there weren’t many who would be able to learn the [Omega Sword Dao], Ning didn’t want to just hand it out to people!\u003c/p\u003e\n\u003cp\u003e“My Omega Sword Dao shall be transmitted to my disciples in the future. I cannot casually show it to others,” Ning said.\u003c/p\u003e\n\u003cp\u003e“We can share our Daos and exchange our insights,” Emperor Goldface said. “I’d naturally be willing to share my Dao with you, as well as show you all of the other legacies I have accumulated in exchange, fellow Daoist Darknorth.”\u003c/p\u003e\n\u003cp\u003e“Goldface, you go too far. How can you compare your Daos with fellow Daoist Darknorth’s? His Dao is that of the Omega Sword Dao; it is completely unique and is superior to even fused Supreme Daos! Not even Hegemonic Daos are comparable to it.” Empress Jade Phoenix frowned and said coldly, “If you want to view his [Omega Sword Dao], you should at least show a bit of sincerity.”\u003c/p\u003e\n\u003cp\u003eEmpress Jade Phoenix then looked at Ning. “Fellow Daoist Darknorth, to tell you the truth, I’m stuck at a bottleneck myself. I wish to break through it and become a Hegemon! Alas, breaking through is far too difficult. That’s why I truly wish for a chance to see your [Omega Sword Dao]. Perhaps it would give me new insights that would allow me to break through. I wouldn’t presume to ask to view it for free; I can swear an oath to you that after viewing it, I won’t transmit it to any others… and will accede to any request you make!”\u003c/p\u003e\n\u003cp\u003e“As far as treasures go, I have plenty as well,” Emperor Goldface said.\u003c/p\u003e\n\u003cp\u003e“As far as treasures go… I probably have the most,” Daoist Bluestone suddenly said.\u003c/p\u003e\n\u003cp\u003eEveryone fell silent. Not even the three Hegemons could argue against this statement. They all knew that Daoist Bluestone had once discovered a complete, undamaged Sithe relic site, and had thus let his Primaltwin undergo the Ritual Sacrificium to become a Black Emperor. The other treasures within the relic site had all fallen into Daoist Bluestone’s hands as well. No one knew just how many treasures he had.\u003c/p\u003e\n\u003cp\u003e“Fellow Daoist Darknorth.” Daoist Bluestone looked at Ning. “I only wish to view your [Omega Sword Dao] once, and I’ll swear an oath to never show it off to any others! As for any requests you might have… just name them! I know that a grudge exists between you and Archon Silksnow. Just give me a nod, and I’ll throw the full force of my power against the Emperors of Silksnow Fiend Palace. I’ll wipe all of them out, including Silksnow and Bloodcloud, no matter what the cost is.”\u003c/p\u003e\n\u003cp\u003eIt would be very hard for Daoist Bluestone to kill Silksnow and Bloodcloud, but if he was truly willing to pay the price he still had a chance to accomplish it. Daoist Bluestone looked at Ning, his eyes blazing with eagerness.\u003c/p\u003e\n\u003cp\u003eHe was a man who cared about nothing save the Dao. For the sake of the Dao, he was willing to sacrifice a great deal.\u003c/p\u003e\n\u003cp\u003e“As for my treasures… aside from a few treasures that are extremely important to me, I’ll hand all of them over to you. In other words, over 99% of my treasures shall be yours,” Daoist Bluestone said. “I only ask that you let me view your [Omega Sword Dao].”\u003c/p\u003e\n\u003cp\u003eNing was startled. To tell the truth, his original plan had merely been to divulge the existence of Daos that were superior to fused Supreme Daos. He hadn’t been planning to say anything else. Ning was only planning to leave his [Omega Sword Dao] behind for the Three Realms to study, along with a few select disciples of his. He hadn’t planned to make it public. That way, if he encountered a serious problem in the future, he would perhaps be able to use the [Omega Sword Dao] as a bargaining chip to negotiate with Hegemons.\u003c/p\u003e\n\u003cp\u003eFor example, he could ask a Hegemon to swear an oath to forever help him protect the Three Realms, and so on and so forth. However… all of those things would only happen if he was unable to do something himself. It was a last-resort option! So long as Ning could handle things by himself, he wouldn’t be willing to transmit the [Omega Sword Dao] to others.\u003c/p\u003e\n\u003cp\u003eBut today, Ning began to waver when faced with Daoist Bluestone’s offer. The man truly was sincere! Emperor Goldface had engaged in beautiful sophistry about ‘sharing Daos’ and ‘exchanging insights’, but Ning couldn’t be bothered to negotiate with him. He had over three hundred Hegemonic legacies; why would he care about Emperor Goldface’s?\u003c/p\u003e\n\u003cp\u003eDaoist Bluestone, in contrast, had been extremely sincere. He was willing to hand out over 90% of his treasures, and he didn’t try to give Ning any pressure at all. In addition… in his heart, Ning deeply desired to find someone to reverse the flows of spacetime and revive his wife. Perhaps Daoist Bluestone’s treasures would be enough to invite an Autarch to intercede.\u003c/p\u003e\n\u003cp\u003eNing was going to choose a good number of disciples in the future and transmit the [Omega Sword Dao] to them. Letting Daoist Bluestone view it as well wasn’t out of the realm of possibility.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-36-chapter-16\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-36-chapter-18\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-36-chapter-17","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
