{"id":50915,"no":1218,"title":"Book 37, Chapter 3 - Ji Ning and Silksnow","content":"\u003cp\u003eThe winding, flaming corridors stretched off for countless kilometers. They had been nightmares for cultivators during the Dawn War, but now that they were damaged and were no longer actively controlled, the barriers within had been dramatically lessened in number.\u003c/p\u003e\n\u003cp\u003eThe flames beneath the feet of Ji Ning and Whitethaw suddenly transformed to form a giant flaming head that was three hundred meters long. The flaming head opened its great mouth, preparing to swallow Ning and Whitethaw whole.\u003c/p\u003e\n\u003cp\u003e“Break!” Whitethaw stomped down angrily towards the ground with his white, fur-covered feet.\u003c/p\u003e\n\u003cp\u003eBoom! The furry stomp delivered a strike of inconceivable power, instantly crushing the flames below and shattering the flaming head.\u003c/p\u003e\n\u003cp\u003eNing chuckled when he saw this: “We finally encountered a trap. This was the first one for us.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry, Master. Leave these mechanisms to me,” Whitethaw boomed sonorously.\u003c/p\u003e\n\u003cp\u003e“Haha, I’m not worried at all.” Ning laughed, but he couldn’t help but sigh secretly in amazement as well. No wonder the highest-ranking Sithe had all wanted Sithe Protectors like this. Whitethaw was definitely comparable to supreme Archons in power! Even when Ning fought against it with all his might, Ning was still unable to gain any advantage at all.\u003c/p\u003e\n\u003cp\u003eAnd this wasn’t the most impressive thing about it. What was really impressive was the fact that the golem was meant to protect and defend. In raw power alone, it was comparable to Hegemons in might! This was the reason why Ning wasn’t able to gain any advantage even when using his Heavenbreaker stance with all his power.\u003c/p\u003e\n\u003cp\u003eAside from possessing overwhelming power, it was also capable of soft and flexible attacks. It was capable of tying down any foe, even Hegemon-level ones. It could also stand in front of its master, helping its master face any dangers.\u003c/p\u003e\n\u003cp\u003eIt must be understood that not even an actual Hegemon would necessarily be as effective as a Sithe Protector when it came to actually guarding someone.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing and Whitethaw continued to follow the passageway. Whitethaw used his absolute, overwhelming power to block and crush any of the traps they activated. In truth, these mechanisms weren’t all that powerful; they weren’t even able to force Whitethaw to enter his ‘flexible’ mode.\u003c/p\u003e\n\u003cp\u003eWhoosh. Countless flames suddenly sprang up beneath Ning’s feet, surrounding him from every direction and from above him as well. Flames were spinning everywhere, almost as though they had just been trapped in a cage of flames. The spinning flames came together to form a strange script which was clearly accumulating a surge of terrifying power.\u003c/p\u003e\n\u003cp\u003eNing’s face tightened slightly. This was the first time since entering this place that he felt a bit of danger. Clang! Ning pulled a pair of Northbow swords from the sheath on his back, bringing them to the ready.\u003c/p\u003e\n\u003cp\u003e“Master, leave it to me!” Whitethaw let out a low roar, slamming his giant furry palms in every direction in a series of furious strikes.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! It was like a wave of palm-strikes striking out everywhere. Each palm was actually slightly stronger than even Ning’s full-force Heavenbreaker stance! More than ten palm-strikes were unleashed in the blink of an eye, causing the cage of flames to start to crack and crumble. Moments later, the cage exploded violently and then completely collapsed.\u003c/p\u003e\n\u003cp\u003eThe Protector lowered his hands, a stolid and straightforward look on his face as always.\u003c/p\u003e\n\u003cp\u003e“Pretty impressive.” Ning was beginning to like the golem more and more. When Daoist Bluestone had traded this golem to him as part of the deal for the Omega Sword Dao, Bluestone had said that these Sithe Protector golems were extremely rare and of slight interest to even Autarchs.\u003c/p\u003e\n\u003cp\u003e“I’ll probably have to rely on Whitethaw if I want to rescue Ninedust,” Ning mused to himself. “It is much better at facing danger than I am, after all.”\u003c/p\u003e\n\u003cp\u003eAs they continued to advance from one fiery passageway into another, Ning could sense that he was gradually growing closer to Archon Silksnow.\u003c/p\u003e\n\u003cp\u003eSix days passed in the blink of an eye.\u003c/p\u003e\n\u003cp\u003e“Almost there.” Ning turned solemn. Although he had the absolute advantage in power, Archon Silksnow had proven his determination when he had chosen to risk his life and enter the Jadefire Realm. Ning wouldn’t be the slightest bit over-confident against such a crazy foe.\u003c/p\u003e\n\u003cp\u003eNing watched carefully as he continued to walk forwards. “Over there!” Ning’s eyes narrowed as he saw the man. A few hundred million kilometers away, a skinny white-robed, white-browed man was seated in the lotus position in a tiny empty space that was surrounded by flames. His oily-green eyes were fixed upon Ning as well.\u003c/p\u003e\n\u003cp\u003eAlthough flames and other things were between them, to experts like them mere matter was unable to block their line of sight. Previously, they were unable to see each other because they were too far away and too many mechanisms were present. Now that they were less than a billion kilometers away from each other, they were able to see each other clearly.\u003c/p\u003e\n\u003cp\u003e“Silksnow,” Ning said as he walked forwards.\u003c/p\u003e\n\u003cp\u003e“I really do admire you.” A gravelly voice rang out in the area around Ning: “You threw yourself into the Terror Starsea and then into the Jadefire Realm, all for the sake of just a single friend! Daolord Darknorth, I already admired you for your strength. Now, I admire you for your courage as well.”\u003c/p\u003e\n\u003cp\u003e“I admire you greatly as well. You are an Eternal Emperor, but you were willing to risk it all in diving into this deathtrap. If I chose not to come, it is possible that the end result would be that you and Ninedust would both die in here,” Ning said. “For an Eternal Emperor to be willing to enter into a suicide pact with a Daolord… I’m truly awed by your madness.”\u003c/p\u003e\n\u003cp\u003eEntering the Jadefire Realm was easy. Leaving was difficult! In the past the Sithe had allowed countless cultivators to enter without impeding them, then killed them once they were inside! Thus, although Archon Silksnow had been able to survive his entrance, actually leaving alive would be a thousand times more difficult. It wouldn’t be possible to simply take the original route back, after all.\u003c/p\u003e\n\u003cp\u003e“Suicide pact? You underestimate me too much,” Archon Silksnow said with a cold smile. He had a realmship, meaning that he was much better at staying alive than other Archons.\u003c/p\u003e\n\u003cp\u003e“You drew me here for the sake of trapping me, yes?” Ning continued to walk forwards, a smile on his lips. “You aren’t strong enough to do it yourself. Your plan is probably to use some of the terrifying mechanisms within the Jadefire Realm to do it yourself. If my guess is correct, you should be surrounded by incredibly terrifying traps.”\u003c/p\u003e\n\u003cp\u003e“Indeed. I’m surrounded by terrifying traps. Tens of them. Hundreds of them!” Archon Silksnow laughed wildly, “And that’s why you should stay far, far away from me. The closer you get to me, the sooner your death will come.”\u003c/p\u003e\n\u003cp\u003eThe two continued to speak from a great distance, while Archon Silksnow concealed his true thoughts and his true plan against Ning. \u003cem\u003eCloser, closer… just a little bit closer…\u003c/em\u003e Archon Silksnow eagerly awaited Ning’s arrival. He knew that given how proud Daolord Darknorth was, there was no way he would flee without even seeing the traps.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eArchon Silksnow had his schemes, but Ning had plans of his own. If Whitethaw hadn’t told him some of the secrets of this place, Ning would be proceeding with much greater caution. Now, however, Ning knew that so long as he didn’t fly into the air he wouldn’t be attacked by any of the truly deadly mechanisms of this place.\u003c/p\u003e\n\u003cp\u003e“Silksnow, in the end your schemes will all amount to nothing,” Ning mused. However, he still instructed Whitethaw cautiously, “Whitethaw, stay ahead of me.”\u003c/p\u003e\n\u003cp\u003e“Acknowledged.” Whitethaw led the way, while Ning followed Whitethaw from behind. He was being cautious for the added security it would provide, but also for the sake of lulling Archon Silksnow into a sense of complacency.\u003c/p\u003e\n\u003cp\u003eThe distance between the two began to shrink. Eighty million kilometers. Sixty million kilometers. Fifty million kilometers. Thirty million kilometers…\u003c/p\u003e\n\u003cp\u003e“The closer, the better. That way, Daolord Darknorth will suffer even greater repercussions from the shockwave.” Archon Silksnow felt his formerly-calm heartrate begin to pick up, hammering against his chest like meteors. “Closer…”\u003c/p\u003e\n\u003cp\u003eTen million kilometers. Eight million kilometers. Five million kilometers…\u003c/p\u003e\n\u003cp\u003e“Eh? Why isn’t he attacking me yet? Hurry up and attack!” Archon Silksnow waited eagerly. “Once he attacks, he’ll definitely hit the barrier in front of me.” If Ning didn’t attack, he would have to come up with a way to trick him into touching the barrier.\u003c/p\u003e\n\u003cp\u003eThe distance between the two had shrunken down to merely a million kilometers.\u003c/p\u003e\n\u003cp\u003eWhoosh. Suddenly a wave of invisible heartforce swept out, instantly passing the distance between them and falling upon the white-browed Archon Silksnow. This was the [Unfettered Dreamlands], and a beautiful dream-world appeared before his eyes.\u003c/p\u003e\n\u003cp\u003e“I’m finally invincible! Hahaha… I’m the ruler of this realmverse! Hahahah!” Archon Silksnow was seated upon a throne. Below him were Hegemon Brightshore, Hegemon Windrain, Hegemon Netherlily, and the other major powers. They were all waiting on him subserviently, causing him to laugh with delight.\u003c/p\u003e\n\u003cp\u003eHowever, a moment later a look of terror appeared in his eyes. He realized that he had been trapped inside an illusion!\u003c/p\u003e\n\u003cp\u003e“Break! Break! Break!” He furiously struggled mentally, but he could sense the world around him clinging onto his mind like mud, making it hard for him to escape. He continued to struggle, and finally with a ‘pop’ he managed to break through.\u003c/p\u003e\n\u003cp\u003eHe had shaken free from the [Unfettered Dreamlands], regaining his mental clarity and control over his body.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-37-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-37-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-37-chapter-3","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
