{"id":50937,"no":1240,"title":"Book 37, Chapter 25 - Time Flows Like Water, the Three Realms Perish","content":"\u003cp\u003eTo cultivators, their weapons and their armor were their most valuable possessions. Generally speaking, when cultivators spoke of ‘trading treasures’ or ‘handing over treasures’, they were excluding the weapons and armor which they normally used! A Universe weapon which acknowledged you and was a good fit for you… such a treasure was incredibly hard to find. And how much blood and effort would have to be poured into a suit of Lifeblood armor, allowing it to grow over the aeons?\u003c/p\u003e\n\u003cp\u003eOther treasures might be valuable, but the loss of them would not have too much of an impact on Hegemon Winterflame’s actual level of power. It would’ve hurt, but he would’ve bit his tongue and accepted. His weapons and his armor? Once those were lost, his power would dramatically drop.\u003c/p\u003e\n\u003cp\u003e“Yes, I want both.” Ning looked at him. “I want all of your treasures! You must hand over every last drop of chaos nectar and every last chaos jewel, to say nothing of your Universe treasures.”\u003c/p\u003e\n\u003cp\u003e“Y-y-you…!” Hegemon Winterflame was absolutely livid.\u003c/p\u003e\n\u003cp\u003e“Are you handing them over or not?” Ning looked at him.\u003c/p\u003e\n\u003cp\u003e“Impossible! How could I give you my armaments?” Hegemon Winterflame glared furiously at Ning. “I’ve already lowered my head before you, but you push me too far. Hmph. Do you really think I’m afraid of you? I can simply sit in this tunnel without moving, and your control over the mechanisms will be of no use to you. There can’t be that many which are capable of actually trapping and/or killing Hegemons. I refuse to believe one of them is right next to me.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing you can do to me! If push comes to shove, I’ll just stay here for 108,000 chaos cycles. Let’s see if you’ll survive past that date!” Hegemon Winterflame glared at Ning.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. If I fail my Daomerge and perish, I’ll pass the control techniques over to others and require them to swear oaths to never release you,” Ning said with a laugh.\u003c/p\u003e\n\u003cp\u003e“Then let us wait and see!” Hegemon Winterflame’s face was ruddy with rage.\u003c/p\u003e\n\u003cp\u003e“Excellent. Honestly, I don’t even care about your piddling treasures. Brother Azurefiend, let’s go.” Ning turned and immediately walked towards his realmship. Azurefiend smirked coldly as he glanced at Winterflame, then joined Whitethaw in walking towards the realmship.\u003c/p\u003e\n\u003cp\u003e“Azurefiend, you aren’t worthy of looking down upon me, you craven. No matter how ‘shameless’ I am, I, Winterflame, would never lower myself to becoming a retainer to a Daolord,” Winterflame said mockingly.\u003c/p\u003e\n\u003cp\u003e“Winterflame… by my decree, you shall be trapped here forever until the day you perish!” Ning came to a halt, turned and said these words, then entered the realmship.\u003c/p\u003e\n\u003cp\u003e“Let’s see if I die first or if you die first!” Hegemon Winterflame roared angrily, watching as the three disappeared into the realmship.\u003c/p\u003e\n\u003cp\u003e“Darknorth, Winterflame’s completely shameless. He’s capable of saying anything at all. Don’t waste your time with him.” Hegemon Azurefiend smiled coldly. “Just enjoy the sight of his perpetual imprisonment.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” Ning nodded.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe storm caused by the news that a Daolord had acquired a realmship gradually became to calm down. However, the news that a Hegemon had actually chosen to serve a Daolord as a retainer was slowly spread to ever more distant realmverses and otherverses.\u003c/p\u003e\n\u003cp\u003e“The core of this formation-diagram is ridiculously complicated.” Ning’s divine power clone was still above the altar, carefully analyzing it. Ning’s Primaltwin was still on the Autarch’s stone dais in the Azureflower Estate, meditating on the formation-diagram as well.\u003c/p\u003e\n\u003cp\u003eThe core of the formation-diagram… it required one to have reached incredible heights in the Dao of Fire and the Dao of Space, as well as extreme mastery of the Dao of Formations. Only then would you have a chance to solve it.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Flamedragon Realmverse returned to its usual calm, and time slowly began to flow on. One chaos cycle, two chaos cycles, three chaos cycles…\u003c/p\u003e\n\u003cp\u003eBack in Ning’s homeland of the Three Realms.\u003c/p\u003e\n\u003cp\u003eCRACK!\u003c/p\u003e\n\u003cp\u003eThe golden-robed Ning was by the side of his daughter Brightmoon. The two were aboard a rowboat floating atop Serpentwing Lake. The golden-robed Ning raised his head to stare at the heavens. He saw a bolt of lightning tear through the skies, spanning trillions of kilometers in size. This bolt of lightning didn’t just pierce through the Grand Xia, it also pierced through the majority of the three thousand major worlds.\u003c/p\u003e\n\u003cp\u003e“The Three Realms are finally about to face the apocalypse,” Ning murmured.\u003c/p\u003e\n\u003cp\u003e“What?” Brightmoon was stunned. She stared at her father, shock apparent in her bright eyes. “Father, did you just say that the Three Realms are about to be destroyed?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded. “Normal chaosworlds will only last for a single chaos cycle. After being destroyed, they will coalesce into ‘Worldhearts’ that will then give birth to a new world and a new cycle of life. Long ago, Mother Nuwa led our Three Realms to defeat the Seamless Chaosworld. A total of nine chaos cycles have gone by since then. Nine! This represents an absolute limit. It is indeed time for the Three Realms to be destroyed.”\u003c/p\u003e\n\u003cp\u003e“Then what should we do? Should we move to stop it?” Brightmoon asked.\u003c/p\u003e\n\u003cp\u003e“Why should we? Destruction and rebirth are all part of a cycle, the natural functioning of the Chaosverse.” Ning smiled. “And the major powers of the Three Realms have long ago established their own chaosworlds. We’ll simply relocate Swallow Mountain to one of them.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Brightmoon nodded. These days, experts were as common as clouds in the Three Realms. It had a decent number of even Samsara Daolords. Ever since Ning had brought back the three hundred-plus Hegemonic legacies to the Three Realms, it had undergone yet another golden age. Its cultivators had exploded with power, and the rate at which the Three Realms gave birth to experts was even more ridiculously high than for the planet within the Stone Hellephant Wall.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn the primordial chaos outside the Three Realms. There was a region here that was tens of thousands of times vaster than the Three Realms themselves, and chaosworlds were scattered throughout this region in accordance with an incredibly complicated formation.\u003c/p\u003e\n\u003cp\u003eThere were a total of 3900 chaosworlds here, and they were linked together in a massive formation which Ning had developed based on his insights into the Dao of Formations. The Sithe discs had been emplaced within the formation, becoming part of it! Ever since Ning began to truly analyze the Sithe formations, he finally began to be able to make perfect use of the Sithe discs.\u003c/p\u003e\n\u003cp\u003eThe power of the formations and the Sithe discs was such that it would be extremely hard for even Hegemons to breach the local defenses.\u003c/p\u003e\n\u003cp\u003eOver the course of countless years, the three thousand-plus chaosworlds had given birth to countless living beings. As a result, the denizens of the Three Realms had truly thrived.\u003c/p\u003e\n\u003cp\u003e“And there it goes.” Many figures stood there within the void, staring towards the distant Three Realms. The golden-robed Ning, Subhuti, and Windfiend stood at the front of this group. Ning was the number one expert of the Three Realms; that went without saying. Subhuti and Windfiend were incredibly talented as well; after having analyzed over three hundred Hegemonic legacies, they had merged multiple Supreme Daos together and become Samsara Daolords. By now, both Subhuti and Windfiend were both Daolords of the Third Step.\u003c/p\u003e\n\u003cp\u003eMaitreya, Crazy Ji, Sun Wukong, Jade Cauldron, Kuafu… a total of nineteen had become Samsara Daolords. However, none of them had been able to fuse multiple Supreme Daos together. Maitreya was one of the more impressive ones, having at least mastered a single Supreme Dao.\u003c/p\u003e\n\u003cp\u003eAs for World-level cultivators? They were ridiculously abundant. There were over ten thousand of them by now! Even Brightmoon had been able to train to the World level under her own power. Alas, Ning’s father and mother were much weaker when it came to cultivation. Even though Ning personally guided them, they still weren’t able to reach the World level. In the end, Ning had to rely on using medicines to forcibly uplift both his father and his mother to the World level.\u003c/p\u003e\n\u003cp\u003e“The Three Realms is in a golden age. We have over ten thousand World-level cultivators, which is just slightly less than the Badlands Territory itself. However, we have far more Samsara Daolords than the Badlands Territory.” Subhuti sighed emotionally. “The more I wander the outside world, the more I feel that the Three Realms are truly incredible.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded. “However, the Chaosverse is a vast place. There are more than a few other locations which have given place to a high density of experts.”\u003c/p\u003e\n\u003cp\u003e“The techniques which Darknorth brought back were of great help as well. On average, the cultivators of the Three Realms have all risen by a complete level,” Windfiend said. “Otherwise… there’s no way we would have this many Samsara Daolords, while Subhuti and I probably wouldn’t have fused Supreme Daos together.”\u003c/p\u003e\n\u003cp\u003eNing agreed with this assessment. A good reservoir of techniques was extremely important, which was why the Aeonians viewed those three hundred-plus Hegemonic legacies as priceless treasures. Alas, Ning was now so powerful that the Aeonians didn’t even dare to voice a word in protest. All they could do was pretend that none of it had ever happened.\u003c/p\u003e\n\u003cp\u003eWhoosh. Whoosh. Whoosh.\u003c/p\u003e\n\u003cp\u003eThe distant Three Realms was slowly collapsing. One world after another began to crumble as the rivers and the mountains began to break apart.\u003c/p\u003e\n\u003cp\u003eNing and the major powers who had been born from the Three Realms all watched from afar, their hearts filled with emotions. However, all of them were at peace, because they had already relocated everyone and everything they cared about away from the Three Realms.\u003c/p\u003e\n\u003cp\u003e“Quick, look over there! The new Worldheart is beginning to take form.”\u003c/p\u003e\n\u003cp\u003e“The Worldheart of the Three Realms.” The various Daolords and World-level cultivators were all chatting amongst themselves. Ning watched intently as well.\u003c/p\u003e\n\u003cp\u003eThe vast Three Realms continued to collapse until its very core became an invisible black hole that devoured everything in its path. All of the shattered bits of world-rubble were all drawn into that invisible hole, causing it to slowly stabilize and become solid. An invisible surge of power began to spread out from it, causing even Ning to feel a vague sense of awe.\u003c/p\u003e\n\u003cp\u003eThis was the power of the very essence of the Chaosverse itself.\u003c/p\u003e\n\u003cp\u003e“It has finally taken form. Is that over there the new Worldheart of the Three Realms?” Ning stared from afar. The Three Realms had already completely vanished, leaving behind a pair of glittering gemstones that were embedded into each other. Normally, Worldhearts were supposed to consist of a single, perfect gem. However, the Worldheart of the Three Realms was very unique, as it was formed from the collision of those two chaosworlds. Both gems had been damaged and lost certain parts, but each just so happened to compensate for the losses of the other, allowing the two to form a perfect whole.\u003c/p\u003e\n\u003cp\u003eThe embedded double-Worldheart was dazzlingly beautiful and absolutely marvelous. Ning had never seen a Worldheart like this before. “How beautiful.” Ning couldn’t help but sigh in praise.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-37-chapter-24\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-37-chapter-26\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-37-chapter-25","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
