{"id":51016,"no":1319,"title":"Book 40, Chapter 7 - Acting On Orders","content":"\u003cp\u003eThere was a round disk located at the ‘neck’ of the castle, which was divided into a black side and a white side. Flickers of terrifying lightning could be seen gathering around that location. According to the castle’s original configuration and power, it was capable of shooting out two bolts of thunder simultaneously, each one carrying a tremendous amount of power. In order to simplify the controls, Ji Ning had made it so that just a single bolt of thunder could be unleashed. However, this had the beneficial side effect of reducing energy costs by 50%. Attacks of such power consumed enormous amounts of energy, after all.\u003c/p\u003e\n\u003cp\u003e“That looks absolutely terrifying. I can sense that the power of that thunder is more than enough to wipe me out,” Azurefiend said with a sense of lingering fear.\u003c/p\u003e\n\u003cp\u003e“You? Even I would find it hard to survive.” Patriarch Treewind felt fear as well, as did Imperator Jade Rainbow and the others.\u003c/p\u003e\n\u003cp\u003eThese types of Sithe war machines were absolutely terrifying. During the Dawn War, they were used to stabilize entire regions; so long as an Autarch didn’t intervene, these things spelled certain doom for any cultivators who faced them! However, they had to build up power before launching each shot, and so during the Dawn War the cultivators who were faced with these terrifying war machines used their own lives to ‘block’ their attacks and buy time for their peers.\u003c/p\u003e\n\u003cp\u003eBOOM! A streak of lightning suddenly shot out, causing both space and time to congeal into a liquefied state.\u003c/p\u003e\n\u003cp\u003eA distant, fiery-red boulder which was levitating in the distance suddenly disappeared, silently and soundlessly. The bolt of lightning briefly showed itself as the boulder was destroyed, followed by it immediately continuing its forwards surge. The power of this attack was so great that everyone save for Ning and the Flamewing God felt utterly stunned. This attack was more than enough to wipe them all out.\u003c/p\u003e\n\u003cp\u003e“That attack was too fast. Space wasn’t just twisted, it was liquefied! Anyone within a range of ten billion kilometers would find it almost impossible to dodge,” Patriarch Treewind said with a frown.\u003c/p\u003e\n\u003cp\u003e“The only option would be to stay out of its range. In the future, I’ll have to remember to stay at least fifty billion kilometers away from that thing,” Imperator Jade Rainbow said with a laugh. “If I’m too close, I won’t even be able to dodge. Treewind, your disciple is now even more powerful than you are.”\u003c/p\u003e\n\u003cp\u003e“Nuwa has always been far more talented than me. Even without Daolord Darknorth’s help, she would eventually grow to eclipse me in might,” Patriarch Treewind chortled. Daolord Darknorth was whole-heartedly helping out Nuwa, and Nuwa was his disciple. As a result, Treewind himself would benefit from the process. The more powerful this female disciple of his became, the more influential he himself would become.\u003c/p\u003e\n\u003cp\u003eWhoosh. The silver-robed Nuwa flew out from the castle. She waved her hand, causing the castle to quickly shrink to become palm-sized and fall within her palm. Clearly, she had already fully mastered the control technique Ning had given her and was in full control of this castle.\u003c/p\u003e\n\u003cp\u003e“It really is powerful. With this castle under my control, our homeland shall be impregnable,” Nuwa said, her face covered with joy. “Given how mighty its attacks are, its defensive prowess should be even better. Even the likes of the Blazesun Ruler would find it difficult to break through.”\u003c/p\u003e\n\u003cp\u003eNing felt delighted as well. After fleeing from the Earthfire Continent, he had actually warped to this place and discovered a treasure that he was in desperate need of! He had actually been planning to spend some time finding a treasure which would be suitable for the Three Realm’s defense; now, one had just appeared before him.\u003c/p\u003e\n\u003cp\u003e“Darknorth, this castle is still riddled with damage. What should we do?” Nuwa looked at Ning.\u003c/p\u003e\n\u003cp\u003e“There’s nothing that can be done. I’m certainly not able to repair Sithe artifacts,” Ning said with a laugh. “Thankfully, at least its interior is in perfect shape. The damage on the outside makes it look a bit ugly, but all we need to do is add another protective layer on top and it’ll look as good as new.”\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning suddenly frowned and turned to stare off into the distant. Boom! A faint dimensional ripple appeared, followed by a strange creature with a sharp head and furry tail appear. It stared curiously in their direction.\u003c/p\u003e\n\u003cp\u003e“These creatures again?” Nuwa said.\u003c/p\u003e\n\u003cp\u003e“That thunderbolt you launched was probably so powerful it attracted their attention. We’ve been discovered,” Patriarch Treewind said. “These creatures seem quite weak; the strongest of them are perhaps just barely comparable to ordinary Hegemons.” Patriarch Treewind and the others naturally wouldn’t care too much about a squad of such weak creatures.\u003c/p\u003e\n\u003cp\u003e“Daolord, these creatures are often under the Blazesun Ruler’s command,” Imperator Jade Rainbow said hurriedly. “Now that they’ve seen you, they’ll probably send word to the Blazesun Ruler and he’s probably going to rush over here again.”\u003c/p\u003e\n\u003cp\u003e“The Blazesun Ruler…” Ning felt resigned. There was nothing he could do against the eight Domain Rulers. “Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Daolord Darknorth!” A voice suddenly rang out, followed by the most powerful of the tailed beasts flying towards Ning at high speed.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning glanced at the strange creature, puzzled.\u003c/p\u003e\n\u003cp\u003e“My name is Stoneblade.” The strange creature bowed respectfully, then said, “My humblest greetings to the mighty Daolord Darknorth.”\u003c/p\u003e\n\u003cp\u003e“Oh, so you actually recognize me?” Ning smiled.\u003c/p\u003e\n\u003cp\u003e“The Blazesun Ruler long ago spread word that he is searching for you and provided a great deal of information about you. When I also saw Nuwa and Patriarch Treewind by your side, I naturally was sure that it was you,” the creature said respectfully.\u003c/p\u003e\n\u003cp\u003e“The Blazesun Ruler certainly is persistent. It seems everyone has been notified about me, including you and your peers. Speak. What do you need from me?” Ning asked.\u003c/p\u003e\n\u003cp\u003eThe strange creature said respectfully, “The Blazesun Ruler sent word long ago that if we encountered Daolord Darknorth, we were to immediately inform you that they bear you no ill-will at all, nor do they intend to fight you. Instead, there is something important they must inform you.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Ning was puzzled. “Something important? What is it?”\u003c/p\u003e\n\u003cp\u003e“That I do not know. After discovering you, I immediately sent word back. I imagine the Domain Ruler will soon be notified, and they’ll probably hasten here at full speed. Once you see him you’ll know the answer, Daolord,” the creature said.\u003c/p\u003e\n\u003cp\u003e“Understood.” Ning nodded.\u003c/p\u003e\n\u003cp\u003eThe strange creature then bowed respectfully a second time before retreating.\u003c/p\u003e\n\u003cp\u003e“Darknorth, the Blazesun Ruler and the other Domain Rulers have important business with you?” Nuwa was puzzled. “What important business could it possibly be?”\u003c/p\u003e\n\u003cp\u003e“Could it be a scheme of some sort?” Flamewing immediately asked.\u003c/p\u003e\n\u003cp\u003eNing laughed. “Flamewing, when did you learn about ‘schemes’? Haha! However, I don’t think it is a trick or a trap… because I’m powerful enough that if I wish to leave, the eight of them are completely unable to stop me. There’s no need to lie to me either! And, when I saw all eight of them last time, I felt quite puzzled. For all eight Domain Rulers to join forces against me is quite odd. Now, it seems, they have other business with me.”\u003c/p\u003e\n\u003cp\u003e“We shall wait here for a time. Let’s wait for the eight Domain Rulers to come and see what they want,” Ning said.\u003c/p\u003e\n\u003cp\u003e“Very well.”\u003c/p\u003e\n\u003cp\u003e“We fled so quickly last time, I didn’t even have a chance to see what the other seven looked like.”\u003c/p\u003e\n\u003cp\u003e“Me neither.”\u003c/p\u003e\n\u003cp\u003e“I saw two of them. This time, I’m going to see what all eight of them look like.” Hegemon Goodsong, Treewind, Jade Rainbow, Azurefiend, and the others all felt quite relaxed. With Ning present, they had nothing to fear at all. In any other situation, they would’ve been utterly terrified by the prospect of facing the eight Domain Rulers.\u003c/p\u003e\n\u003cp\u003eRoughly an hour later.\u003c/p\u003e\n\u003cp\u003eWhoosh! A bolt of thunder appeared, splitting through the void and creating a temporary but stable spacetime tunnel. Eight figures appeared within the tunnel. It was the Blazesun Ruler and the rest of the eight. When they saw the distant Ning, they revealed looks of delight and hurriedly flew towards him.\u003c/p\u003e\n\u003cp\u003e“It really doesn’t seem as though they come with bad intentions,” Nuwa sent mentally.\u003c/p\u003e\n\u003cp\u003e“Let’s see just what they want, exactly. They have infinite lifespans and should be living without any worries or concerns whatsoever. There shouldn’t be anything they need me to do for them,” Ning said. And of course, if they came for his ‘Eternal Omega Sword Dao’, there was no way he would transmit it to them.\u003c/p\u003e\n\u003cp\u003eSoon, the eight Domain Rulers arrived. They all shrank down to human size as they met with Ning and his team.\u003c/p\u003e\n\u003cp\u003e“Respectful greetings, Daolord Darknorth.” All of them spoke quite courteously.\u003c/p\u003e\n\u003cp\u003e“Respectful greetings, Domain Rulers.” Ning smiled. “Last time I saw you, Blazesun Ruler, you were thirsting for battle and completely mad with bloodlust. This time, all eight of you have appeared but are so courteous… and I hear there is something important you wish to tell me? Might I ask what that is?”\u003c/p\u003e\n\u003cp\u003eThe eight Domain Rulers traded a glance. The Blazesun Ruler voluntarily stepped forward and said, rather embarrassed, “Daolord Darknorth, I was rash in my actions. As soon as we fought, I immediately knew that I was no match for you. A while ago, when we came to speak to you at the Earthfire Continent, it wasn’t for the sake of continuing the fight. Rather, we came on orders.”\u003c/p\u003e\n\u003cp\u003e“On orders?” Ning was startled.\u003c/p\u003e\n\u003cp\u003e“Yes.” A Sourcewalker dressed in deep blue armor respectfully replied, “After you appeared in the Blazesun Domain, word of your presence quickly made its way to the Autarch. The Autarch is within the Quintessence of the Chaosverse and is too busy to come out, and so she instructed the eight of us to find you and bring you to meet with her.”\u003c/p\u003e\n\u003cp\u003e“We’ve been searching for you this entire time. Last time, we found you, but you left so quickly that we weren’t able to catch up,” a Sourcewalker dressed in fiery armor said.\u003c/p\u003e\n\u003cp\u003eNing was enlightened. “The Autarch is located amongst the prime essences and wishes to meet with me? Might I ask, which Autarch is it?”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-40-chapter-7","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
