{"id":51017,"no":1320,"title":"Book 40, Chapter 8 - Entering the Quintessence","content":"\u003cp\u003eThe Blazesun Ruler said hurriedly, “It is Autarch Skyfeeder. Ever since the war against the Sithe concluded, the Autarch has spent almost all of her time within the Quintessence of the Chaosverse. We were lucky enough to have received some guidance from her.”\u003c/p\u003e\n\u003cp\u003e“Skyfeeder?” Ji Ning nodded slightly. The only Autarchs he knew of were Autarch Bolin, Autarch Awakener, and Autarch Titanos. He didn’t really know much about the others.\u003c/p\u003e\n\u003cp\u003e“Go ahead and lead the way,” Ning said.\u003c/p\u003e\n\u003cp\u003e“Daolord…” The Sourcewalker dressed in deep blue armor glanced rather hesitantly at the many cultivators behind Ning. “The Autarch is within the prime essences, a place filled with tremendous power. There is no way ordinary cultivators can enter there! You need to have either reached the incredible level of the Autarchs, which you Daolord have, or be like us and the Chaos Primordials. We’re able to endure the power of that place with our powerful bodies. Weaker cultivators are completely incapable of moving about within the prime essences. I’m afraid that we would at most be able to bring you and your Chaos Primordial.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about us at all.”\u003c/p\u003e\n\u003cp\u003e“The Autarch wishes to see YOU, Daolord. We wouldn’t dare go,” Patriarch Treewind, Azurefiend, and the others said hurriedly. They had all but stopped breathing when they heard that an Autarch had summoned Ning. How could they possibly dare to get involved in a meeting between Daolord Darknorth and such a supremely august presence?\u003c/p\u003e\n\u003cp\u003e“Darknorth, go ahead and go. Don’t worry about us,” Nuwa concurred.\u003c/p\u003e\n\u003cp\u003e“Very well.” Ning nodded. Even if he did bring them, there was no way for them to move about inside the prime essences. “Stay here within the Blazesun Domain. Once I return, I’ll reunite with you.”\u003c/p\u003e\n\u003cp\u003e“Very well.”\u003c/p\u003e\n\u003cp\u003e“Understood.” Su Youji and the others hurriedly assented.\u003c/p\u003e\n\u003cp\u003e“Darknorth, you must be careful,” Nuwa instructed.\u003c/p\u003e\n\u003cp\u003e“Don’t worry.” Ning smiled. The eight Domain Rulers wouldn’t dare to cause trouble, which meant that Nuwa’s team of cultivators had nothing to fear.\u003c/p\u003e\n\u003cp\u003e“Take me with you, Master! Take me with you!” Flamewing said eagerly. “It’s been forever since I was back inside the prime essences!”\u003c/p\u003e\n\u003cp\u003eNing laughed and nodded. “Very well. Follow me.”\u003c/p\u003e\n\u003cp\u003e“This way please, Daolord Darknorth.” The Blazesun Ruler took out his warship and invited Ning and Flamewing inside. Moments later, the warship tore through spacetime and disappeared without a trace.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe eight Domain Rulers used all the considerable tools at their disposal. Just three days later, they exited the Blazesun Domain and entered a silent, empty region of space. There was a total of ten people in this group, and they all stood there within the empty region.\u003c/p\u003e\n\u003cp\u003e“This Sithe warship is useless once we go inside the prime essences. Once we go inside, we’ll have to slowly fly on our own,” the Blazesun Ruler explained.\u003c/p\u003e\n\u003cp\u003e“Open up!” One of the Domain Rulers stepped forward and made a slashing motion with his hand. Swoosh! A gateway was torn within spacetime, and at the opposite end of the gateway was a region filled with an incredible, awesome amount of power and energy.\u003c/p\u003e\n\u003cp\u003e“After you, Daolord,” the eight Domain Rules said very respectfully.\u003c/p\u003e\n\u003cp\u003e“Let’s go.” Ning was the first to step into the spacetime door, with Flamewing and the eight Domain Rulers following from behind. After they entered, the spacetime door vanished without a trace, leaving behind a very ordinary-seeming region. Ordinary cultivators who came here, including Otherverse Lords, were completely incapable of finding the prime essences.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe region they entered was filled with overwhelming power. Imagine a mortal falling into an ocean; the entire area around him would be surrounded by endless waves of suffocating might. The pressure from these waves could easily cause even Hegemons to perish, while Otherverse Lords would find it too difficult to take as much as a single step here.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eThe eight Domain Rulers and the Flamewing God were all under tremendous pressure as well. They had powerful bodies and thus were able to endure it, especially Flamewing whose body was virtually indestructible and who could thus completely ignore the pressure. However, they still had to use all the power they could muster in order to advance through this region. Thankfully, Flamewing had such an endless source of power that this wasn’t of concern.\u003c/p\u003e\n\u003cp\u003e“Which way shall we go?” Ning was the most relaxed of the ten. The Sword Dao domain emanating from him was enough to cause the surrounding pressure to instantly vanish without a trace.\u003c/p\u003e\n\u003cp\u003eThis was because the Dao of his Sword Dao domain was the same as the prime essence of the Dao of the Sword. The prime essence of the Dao of the Sword was naturally part of the collection of prime essences, and so Ning was able to move through this region as easily as a fish moving through water. He didn’t suffer any pressure or sense of rejection at all.\u003c/p\u003e\n\u003cp\u003eUnfortunately, Ning wasn’t able to protect anyone else. The power of the prime essences was omnipresent, while the prime essence of the Dao of the Sword was merely one part of them. If Ning pulled Flamewing and the others into his estate-world, they would be protected. Otherwise, they would simply have to endure it on their own.\u003c/p\u003e\n\u003cp\u003e“Just follow us, Daolord,” the Blazesun Ruler said respectfully.\u003c/p\u003e\n\u003cp\u003e“If you feel tired, you can rest inside my estate-world for a time,” Ning said with a chuckle.\u003c/p\u003e\n\u003cp\u003e“No need.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about us, Daolord. We’re used to this place.”\u003c/p\u003e\n\u003cp\u003e“Haha, this bit of pressure is nothing at all, Master!” The eight Domain Rulers and Flamewing continued to advance rapidly, but they were all using their full power to do so. As for Ning, he was able to effortlessly follow from behind.\u003c/p\u003e\n\u003cp\u003eNing scanned at his surroundings. The Quintessence itself was like a place that was divided into many different ‘lakes’, with each lake representing a prime essence. He saw the prime essence of thunder, the prime essence of water, the prime essence of ice, the prime essence of the Dao of the Sword… every single prime essence was here and overflowing with might. Through them, Ning was able to more clearly scry some of the secrets of the various Daos.\u003c/p\u003e\n\u003cp\u003eThe prime essence of the Dao of the Sword was nothing more than one of many prime essences.\u003c/p\u003e\n\u003cp\u003e“This is the true foundation of our entire Chaosverse,” Ning murmured softly. “Even I am only able to control a tiny part of it.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAll of them flew very fast, but even so it took them a full five days before they flew past the many different prime essences. Finally, they arrived at an ordinary-looking wooden cottage that was floating in midair. There was a small courtyard surrounding this wooden cottage which looked rather like a small crop field.\u003c/p\u003e\n\u003cp\u003e“Here we are.” Looks of delight appeared on the faces of all eight Domain Rulers. Swoosh! Swoosh! Swoosh! They hurriedly flew closer, stepping into the courtyard around the wooden cottage. Ning and Flamewing followed them from behind.\u003c/p\u003e\n\u003cp\u003eInvisible barriers had been placed here which kept out the natural pressure of the Quintessence. Only now did everyone finally relax.\u003c/p\u003e\n\u003cp\u003e“What a marvelous formation.” Ning scanned the formation, then let out a sigh of approval. A formation capable of completely blocking out the pressures of the Quintessence is impressive indeed. Ning then glanced at the surrounding area. He could sense that no one was here aside from them. He immediately turned to the Blazesun Ruler and asked, “Where is the Autarch?”\u003c/p\u003e\n\u003cp\u003e“This is a place where the Autarch often rests,” the blue-armored Sourcewalker said. “She’s cultivating nearby. As soon as we entered her residence, she would be immediately notified. She’ll be coming soon.”\u003c/p\u003e\n\u003cp\u003e“Cultivating nearby?” Ning glanced at the area around them. “Eh?” Soon, Ning was able to detect a strange ripple of power emanating from a place off in the distance. This was a temporal ripple, and it contained utterly savage levels of power. It was almost like a terrifying apocalyptic demon that sought to devour all before it. Ning couldn’t help but turn slightly pale; how was it possible that ‘time’ itself could become so terrifying?\u003c/p\u003e\n\u003cp\u003eHowever, the ripples quickly calmed down. A short while later, an ephemeral figure began to drift towards them, quickly leaving the prime essences and arriving in front of the wooden cottage.\u003c/p\u003e\n\u003cp\u003eThis was a willowy woman whose features Ning wouldn’t describe as exceptionally beautiful. In the Three Realms, her features would be considered quite common and ordinary. Her face was slightly plump, her gaze was gentle, and her aura was both awesome and mysterious, tinged with the ripples of time. Time itself was like an obedient child which swirled around her. She was the only female Autarch in all the Chaosverse… Autarch Skyfeeder.\u003c/p\u003e\n\u003cp\u003e“Darknorth greets you, Autarch,” Ning said immediately.\u003c/p\u003e\n\u003cp\u003eAutarch Skyfeeder walked barefoot into her courtyard, then smiled merrily at Ning and said, “Skyfeeder greets you, Daolord Darknorth.”\u003c/p\u003e\n\u003cp\u003eBoth spoke quite courteously. As soon as they glimpsed each other, they were able to sense the level of insight the other had reached.\u003c/p\u003e\n\u003cp\u003eNing could sense how tremendously powerful this Autarch’s ‘Temporal Daobirth Essence’ was, while the Autarch was able to sense how incredible Ning’s ‘Eternal Omega Sword Dao’ was. They had embarked upon different paths, but they had now reached the same heights of power.\u003c/p\u003e\n\u003cp\u003eAutarch Skyfeeder and the other Autarchs had all first become Hegemons after fusing multiple Supreme Daos together, then broke through to become Autarchs!\u003c/p\u003e\n\u003cp\u003eNing had embarked upon the path of the Omega Dao, and he had eventually come to master the Eternal Omega Sword Dao. Although strictly speaking he was still just an ‘Eternal Emperor’, he truly had reached the same heights of insight as the Autarchs possessed; his only weakness was that the breadth of his understanding wasn’t quite as wide. In actual combat, however, their blows would be incredibly close to each other in might… but of course, as someone who failed the Daomerge, Ning wasn’t able to fight for too long.\u003c/p\u003e\n\u003cp\u003e“Darknorth, let’s chat inside,” Autarch Skyfeeder said. She pushed the door to the wooden cottage open. The cottage was quite plain, with a few seams appearing between the wooden logs that allowed one to clearly see what was inside.\u003c/p\u003e\n\u003cp\u003eAutarch Skyfeeder sat down on the ground in front of a table. Ning did the same in front of another table. Each table had a flagon of wine, and the fragrant aroma of the wine instantly caused Ning’s eyes to light up. This was, without a doubt, the finest wine he had ever seen.\u003c/p\u003e\n\u003cp\u003eAlthough the two of them were merely separated from the eight Domain Rulers and Flamewing by a thin wooden door, the nine were completely unable to hear a word of the conversation within.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-7\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-9\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-40-chapter-8","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
