{"id":51020,"no":1323,"title":"Book 40, Chapter 11 - The Source Of Everything","content":"\u003cp\u003eJi Ning had just heard Autarch Titanos say that Autarch Bolin was studying the secrets of life and death, which was why his aura had changed so dramatically. Based on this, Ning surmised that the Aeonians probably represented certain accomplishments Autarch Bolin had reached in understanding the mysteries of life. What, then, were his accomplishments in the mysteries of death? And… why was an Autarch even researching the principles of life and death?\u003c/p\u003e\n\u003cp\u003e“And this gentleman is Stonerule.” Autarch Bolin pointed at the perfectly beautiful man next to him and chuckled, “Stonerule become an Autarch via the Dao of Illusions. His divine body is filled with boundless magnetism and charm. Those of us who have perfect Dao-hearts aren’t affected too much, but Hegemons and Otherverse Lords who run into him would be instantly charmed and would willingly do whatever he commanded.”\u003c/p\u003e\n\u003cp\u003e“Illusions?” Ning was shocked. So Autarch Stonerule’s path was that of the Illusion Daobirth Essence? How impressive!\u003c/p\u003e\n\u003cp\u003e“Respectful greetings, Daolord Darknorth.” Autarch Stonerule smiled. “My little parlor tricks are nothing to you, Daolord. We have been waiting a long, long time for someone to finally master an Eternal Omega Dao, but we never knew when it would finally occur! Very few can even become Daolords of the Fourth Step through an Omega Dao, while the Daomerge for one would be even more incomparably difficult!”\u003c/p\u003e\n\u003cp\u003e“It truly was hard.” Ning nodded.\u003c/p\u003e\n\u003cp\u003e“Although you failed, Daolord, you still managed to master an Eternal Omega Dao. This truly is a blessing for our civilization,” Autarch Stonerule said.\u003c/p\u003e\n\u003cp\u003e“All of you, sit down. Look at how antsy you all are,” Autarch Skyfeeder said.\u003c/p\u003e\n\u003cp\u003eAutarch Bolin and Autarch Stonerule immediately sat down. Now, all five Autarchs and Ning were all seated. Ning felt a sense of anticipation. He knew that it was finally time to discuss business.\u003c/p\u003e\n\u003cp\u003e“Shall I go first?” Autarch Titanos swept the others with a glance.\u003c/p\u003e\n\u003cp\u003e“Go ahead, old man,” Autarch Ekong said. The other Autarchs all nodded.\u003c/p\u003e\n\u003cp\u003eAutarch Titanos looked straight at Ning. “Darknorth, by now you should be aware that the Sithe have not been truly exterminated, right?”\u003c/p\u003e\n\u003cp\u003e“They haven’t been truly exterminated?” Ning was astonished.\u003c/p\u003e\n\u003cp\u003e“You didn’t know?” Autarch Titanos was rather surprised. “Haven’t you visited the legendary Sithelands?”\u003c/p\u003e\n\u003cp\u003e“I’ve heard of the Sithelands but haven’t visited them yet,” Ning said. The Sithelands were indeed quite famous. Ning had heard Emperor Waveshift speak of them and had discussed them with several major powers. The Sithe had arisen from that place, and to this very day it held more Sithe treasures than any other place. Major powers often went there to go adventuring.\u003c/p\u003e\n\u003cp\u003e“Weren’t the Sithe exterminated after losing the war?” Ning asked.\u003c/p\u003e\n\u003cp\u003eAutarch Titanos chuckled. “I would’ve assumed that after you failed the Daomerge, you would’ve gone to visit as many of the famous places in the Chaosverse as you could prior to dying. I thought you visited the Sithelands already. If you had… given your current level of insight, you probably would’ve seen the truth. You would’ve understood that the Sithe are not truly extinct. Rather, we’ve completely sealed them away, making it impossible for them to return once more.”\u003c/p\u003e\n\u003cp\u003eNing continued to listen attentively.\u003c/p\u003e\n\u003cp\u003e“Long ago,” Autarch Titanos said, “The vast Chaosverse arose, giving birth to countless living beings. Slowly, some embarked upon the path of cultivation. Entropos was the first Autarch, and he was followed by Awakener, then by myself. Next came Autarch Skyfeeder, Autarch Bolin, Autarch Stonerule, and Autarch Mogg.”\u003c/p\u003e\n\u003cp\u003e“Back them, we lived without any worries or concerns. Entropos died trying to take the final step, but that didn’t matter; everyone was seeking their own paths, after all. But then… all of a sudden, and without any warning, the Sithe emerged.\u003c/p\u003e\n\u003cp\u003e“The Sithe were both mysterious and powerful. The prime essences of the Chaosverse sent us a warning, ensuring that we could subconsciously sense that the Sithe posed an enormous threat to us,” Autarch Titanos said. “Have you seen any Sithe Exalts yet?”\u003c/p\u003e\n\u003cp\u003e“I have.” Ning’s eyes lit up and he immediately said, “I saw the Sithe Exalt imprisoned in the Earthfire Continent. If I’m not mistaken… that Sithe Exalt had the insights of an Autarch. Logically speaking, he should’ve been an Autarch… but his actual power level was far lower. He was probably just on par with the Domain Rulers outside this cottage.”\u003c/p\u003e\n\u003cp\u003eAutarch Titanos nodded. “Yes. They are Autarchs.”\u003c/p\u003e\n\u003cp\u003eNing was stunned. “They really are Autarchs? B-but their power…”\u003c/p\u003e\n\u003cp\u003e“They aren’t Autarchs from this place,” Autarch Titanos said. “Although our Chaosverse is almost infinitely vast… outside the Chaosverse there is a truly infinite and endless region which has other living creatures within it. The Sithe race stems from another Chaosverse located within the Infinite Void!”\u003c/p\u003e\n\u003cp\u003e“A different Chaosverse?!” Ning had yet to even leave this Chaosverse.\u003c/p\u003e\n\u003cp\u003e“Once we became Autarchs, we were able to glean some secrets from the prime essences of the Chaosverse,” Autarch Titanos said. “The vast and endless void is filled with a number of enormous celestial bodies, with the largest being the Chaosverses! But even in the Infinite Void, Chaosverses are incredibly rare and few in number. The most powerful and most invincible of all beings in the Infinite Void are the Lords of Chaos, the controllers of the Chaosverses!”\u003c/p\u003e\n\u003cp\u003e“If you wish to become a Lord of Chaos and master a Chaosverse, you must first become an Autarch! Then, you must master and bind the entire Quintessence of that Chaosverse, which would give you full control over all the power that Chaosverse has.” Autarch Titanos looked at Ning. “You should understand by now how much strength would be needed to take full control over the power of the Chaosverse.”\u003c/p\u003e\n\u003cp\u003eNing was stunned. Of course he knew! The power hidden within the vast Wellspring Seas of the Eight Domains was already vastly beyond the power which Autarchs could command. The power of the entire Chaosverse? That would be insanely, indescribably vast. Taking control over all of it was completely inconceivable.\u003c/p\u003e\n\u003cp\u003e“The Sithe come from a different Chaosverse which already has a supremely exalted Lord of Chaos controlling it! This was why their civilization has reached such incredible heights, and why they have so many marvelous techniques at their disposal,” Autarch Titanos said. “But because their Chaosverse already has a person in control of it, there’s no way for a second Chaoslord to arise… and so they have invaded our Chaosverse and seek to dominate it instead!”\u003c/p\u003e\n\u003cp\u003e“But they are foreign invaders, while this is our home. Here, they will suffer invisible pressure which ensures that they aren’t able to gain any additional power from the Dao here. Even their Autarchs are weakened by this invisible pressure. Without the power of the Dao supporting them, they are naturally much weaker than they should be,” Autarch Titanos said.\u003c/p\u003e\n\u003cp\u003e“They are completely different races from us, because they were born in a completely different Chaosverse… but once they are able to take control over our Chaosverse, they can transform it and make it suitable for them. As for those of us who were born here? All of us will perish! From that day forth, all creatures born from our Chaosverse shall be like them – Sithe.” Autarch Titanos looked at Ning. “This is literally a war of survival. We cannot shirk our duty.”\u003c/p\u003e\n\u003cp\u003eNing asked, “So the enemy Lord of Chaos is afraid to come here?”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t dare.” Autarch Titanos explained, “The wellspring of his power is his Chaosverse! He’s able to make use of that power anywhere in the Infinite Void, which is why he is invincible. But… if he was to enter our Chaosverse, he would lose access to that power and would be suppressed, just like everyone else. That’s why he wouldn’t dare to enter himself.”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003e“And besides… why would he? He already stands at the very peak of power in all the Infinite Void, capable of accomplishing anything he desires.” Autarch Titanos sighed. “Alas, the other creatures within his Chaosverse wish to become Lords of Chaos as well. Their only choice is to leave their Chaosverse and invade other ones… and so, we ended up becoming a target for them.”\u003c/p\u003e\n\u003cp\u003e“We’ve already killed sixteen Sithe Exalts and trapped six of them. There are probably other Exalts sealed away within the Sithelands as well. In other words… tens of ‘Autarchs’ from their Chaosverse have invaded ours. From this, you should be able to tell the difference in power between them and us.”\u003c/p\u003e\n\u003cp\u003eNing nodded. The difference was clear, obvious, and enormous.\u003c/p\u003e\n\u003cp\u003e“They surpass us in many ways, such as in fashioning treasures and techniques,” Autarch Titanos said. “We were able to suppress them during the war thanks to our geographical advantage and managed to lock them away into their ‘homelands’, making it impossible for them to invade us again… but in the end, they will always pose a threat. Even worse, if enough time passes we might be invaded by other civilizations as well!”\u003c/p\u003e\n\u003cp\u003e“Thus… the only way to forever get rid of all these problems is to produce a Lord of Chaos ourselves!” Autarch Titanos said. “If we can take control over our own Chaosverse, then we’ll be able to make full use of its power. When that happens we would have the power to invade others, but no one would dare to invade us.”\u003c/p\u003e\n\u003cp\u003eNing agreed with this assessment. Their Chaosverse was without a ruler, but they had still managed to fight back for so long. Once they did gain a Chaoslord, then they would become truly invincible.\u003c/p\u003e\n\u003cp\u003e“Alas, taking control over the Chaosverse is simply too hard.” Autarch Titanos shook his head. “Entropos gave it a try, but he died. Awakener also tried, but he also died.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-40-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-40-chapter-11","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
