{"id":51032,"no":1335,"title":"Book 41, Chapter 3 - Entry","content":"\u003cp\u003eAfter spending over 12 million years travelling a great distance via realmship, Ji Ning and Azurefiend’s avatar finally reached the outer perimeters of the Sithelands.\u003c/p\u003e\n\u003cp\u003e“So this is the Sithelands?” Ning stared at the titanic glowing sphere that lay amidst the endless darkness.\u003c/p\u003e\n\u003cp\u003eThey were still quite far away from this sphere, and it was roughly comparable to twenty or so realmverses in size! This was the enormous base which the Sithe had secretly constructed after infiltrating the local Chaosverse. The process had been very fast, too fast to stop, because the Sithe had constructed the main parts outside of the Chaosverse, then brought them inside and assembled them together.\u003c/p\u003e\n\u003cp\u003eIt was like a nail which the Sithe had driven into the body of the Chaosverse, a nail which the cultivators were completely helpless against.\u003c/p\u003e\n\u003cp\u003eWhoosh. The realmship quickly flew closer and closer towards the Sithelands. Finally, they entered the sphere. Light flashed past their eyes, resolving into a strange, delightfully bizarre world.\u003c/p\u003e\n\u003cp\u003eThe Sithelands was like a self-contained ecosystem, with the world within it being completely different from the rest of the Chaosverse! It even contained a few stars in the sky, although the stars had all been battered and broken to the point where the Sithe machinery underneath could be seen. Mysterious runes continued to flow over the surface of those skeletal stars, and they continued to hum with power. Clearly, they must have been incredibly powerful in the past! There was no way for cultivators to take them away and move them elsewhere; they were simply too large in size. Autarchs might be able to do so, but they wouldn’t deign to collect ‘garbage’ like this.\u003c/p\u003e\n\u003cp\u003e“When we broke through their outer defenses, the cultivators who were present already took away all the Sithe weapons they could move,” Ning mused. “The only places in the outer perimeter that are still filled with many Sithe weapons are those forbidden regions which were sealed away.”\u003c/p\u003e\n\u003cp\u003e“Master, we are probably heading into one of those sealed regions, right?” Hegemon Azurefiend felt a mixture of nervousness, excitement, and anticipation.\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eDuring the Dawn War itself, time was of the essence. Thus, the Autarchs simply did whatever was the most expedient. They sealed away the toughest and most dangerous regions in the outer perimeter, trapping their foes inside. The trapped foes would no longer pose any further threat, after all! They had sealed away many regions during the final invasion. In the end, the heartland regions of the Sithelands had proved to be so deadly that the Autarchs had sealed it away as well, after killing any and all Sithe who dared to come out and fight back!\u003c/p\u003e\n\u003cp\u003eThere had to be many powerful experts who were still alive within the heart of the Sithelands, including a number of Sithe Exalts, but they were no longer able to leave it.\u003c/p\u003e\n\u003cp\u003eThey might be able to win a battle on their own terms and on their own turf, but the Autarchs wouldn’t go inside to fight them. Thus, their only choice would be to fight outside… but without the geographical advantage, the end result would be defeat followed by imprisonment, just like the others.\u003c/p\u003e\n\u003cp\u003e“There are many barriers in the outer perimeters. Over the aeons since the Dawn War, many have been slowly unlocked,” Ning said. “The Autarchs are not opposed to watching Hegemons unlock the barriers and test themselves inside.” Even if the Hegemons perished, their truesoul fragments and energies would return to the Quintessence. This wouldn’t have much of an impact on the Chaosverse as a whole.\u003c/p\u003e\n\u003cp\u003eBut of course, if for example 70% to 80% of all the Hegemons in the Chaosverse were to perish? This sort of large-scale death would certainly have an impact, in that the Chaosverse would be poorly equipped for dealing with any foreign invaders. It simply wouldn’t have enough defenders! Yes, the Autarchs had played a major role in defending it against the Sithe, but the many Hegemons who had bravely stood up had also played an important role.\u003c/p\u003e\n\u003cp\u003eIn the end, there simply weren’t enough Autarchs to go around.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAnother month went past. By now, Ning had finally reached the region where the Paragon of Pills had been trapped.\u003c/p\u003e\n\u003cp\u003eNing stood there in the air, staring at a planet that was surrounded by a billowing black fog. As for Azurefiend’s avatar, it stood behind Ning to one side.\u003c/p\u003e\n\u003cp\u003e“This is one of the sealed regions. The Autarchs didn’t attack it, and so it is in perfect shape,” Ning mused softly. “Even from here, I can dimly sense the threat it poses. I imagine the Autarchs were able to sense the same, which was why they sealed it off instead of attacking it. Oh, Mistress… how could you be so impetuous as to challenge a place like this?”\u003c/p\u003e\n\u003cp\u003e“Powerful Sithe weapons can only be found in undamaged places that were completely sealed off,” Hegemon Azurefiend said. “If you are careful enough, you might be able to avoid some of the dangers.”\u003c/p\u003e\n\u003cp\u003e“Everyone’s putting all their faith on luck.” Ning shook his head. Some cultivators would succeed, true, but many would end up dying.\u003c/p\u003e\n\u003cp\u003e“Let’s go inside.” Whoosh. Ning led Azurefiend in flying towards the planet of billowing black fog at high speeds. Hiss… the black mist was so highly corrosive that weaker Eternal Emperors would quickly be rotted away into a pile of noxious water. However, Ning’s Sword Dao Domain was able to easily hold the mist at bay.\u003c/p\u003e\n\u003cp\u003eThe two continued to fly together through the sea of black mist. They flew for over ten billion kilometers before finally passing through to the surface of the planet below. This was a desolate planet whose surface was filled with countless streams of freezing energy. As Ning and Azurefiend landed on the ground, they turned to stare at the world around them.\u003c/p\u003e\n\u003cp\u003e“Master, where should we go?” Azurefiend asked. “I can feel a powerful sense of danger coming from this place, as though moving in any direction will result in annihilation.”\u003c/p\u003e\n\u003cp\u003e“The Autarchs sealed away this place because they weren’t willing to spend their energies here, and also because this place can kill Hegemons with ease.” Ning shook his head. As he spoke, he continued to carefully scrutinize the world with his karmic senses.\u003c/p\u003e\n\u003cp\u003eAs soon as he descended upon this world, he was able to use his karma lines to sense and locate both Lord Annihilation and the Paragon of Pills. The karmic connection between Ning and the Paragon of Pills went without saying, while Lord Annihilation’s decision to beg Ning to rescue him had also established karmic ties between them.\u003c/p\u003e\n\u003cp\u003e“They are both in that direction.” After carefully tracing his karmic ties, Ning was able to fix on their location and he turned to stare towards his left. “Both of them are over there.” This freezing wind howled through the entire area with such intensity that not even he was able to see to a great distance here.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Ning said. He immediately headed off, with Azurefiend hurriedly following from behind.\u003c/p\u003e\n\u003cp\u003eWhooooosh! Far away from them, a ghostly humanoid figure suddenly manifested out of thin air within a crevice in the ground. It stared towards Ning’s direction, followed by its body emanating excited ripples.\u003c/p\u003e\n\u003cp\u003e“Outsiders! More outsiders! Sisters, more outsiders have arrived!” It didn’t speak at all, it simply used those strange ripples to communicate with its underground comrades.\u003c/p\u003e\n\u003cp\u003eSoon, even more streams of energy began to surge from underground, each of them manifesting into ghostly humanoid figures within the crevice.\u003c/p\u003e\n\u003cp\u003e“Two outsiders have come, sisters!”\u003c/p\u003e\n\u003cp\u003e“Let’s eat them!”\u003c/p\u003e\n\u003cp\u003e“Quick, let’s eat them all!” Dozens of the humanoid creatures had appeared. They all transformed into streams of energy once more, merging into a single awesome stream of energy that flew like the wind in Ning’s direction. The surface of this world was covered with so many gusts of cold wind that they weren’t particularly noticeable at all.\u003c/p\u003e\n\u003cp\u003eNing and Hegemon Azurefiend continued to advance via walking on the surface of this planet. Ning was extremely careful with each move he took. He too felt a sense of grave danger as soon as he stepped foot onto this planet, and he knew that rescuing the Paragon of Pills would be no easy task. He had to be very careful with this.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning suddenly turned to glance towards the right, his gaze following upon a distant stream of energy. This stream of energy seemed to be identical with the other howling streams of wind energy that filled this place, but Ning was vaguely able to sense that it was filled with malevolence, greed, and murder.\u003c/p\u003e\n\u003cp\u003e“What’s wrong, Master?” Hegemon Azurefiend didn’t feel anything yet.\u003c/p\u003e\n\u003cp\u003e“Freeze!” Ning barked. His Sword Dao Domain suddenly expanded dramatically, instantly stretching out to encompass the area where the deadly stream of energy was.\u003c/p\u003e\n\u003cp\u003eThe power of his Sword Dao Domain was capable of unleashing a suppressive effect. The stream of energy instantly trembled, then transformed into a series of humanoid figures. These creatures weren’t even able to maintain their ghostly image and thus were forced to reveal their true appearances. These were fairly short creatures with grayish-black skin, and their features were fairly handsome… but the nails growing out of their fingers and toes were as sharp as knives.\u003c/p\u003e\n\u003cp\u003eTrapped by the Sword Dao Domain, the grayish-black creatures all let out agonized shrieks. They struggled fiercely to break free, their claws dancing in the air as they tried to tear the power surrounding them apart.\u003c/p\u003e\n\u003cp\u003e“So these are the legendary ‘vilefiends’, the most commonly seen creatures within the Sithelands?” Azurefiend was rather excited.\u003c/p\u003e\n\u003cp\u003e“Yes. They aren’t all that powerful and are the easiest creatures to deal with here, but for this many to attack at once would still be rather problematic to deal with.” Ning glanced at the dozens of contorting vilefiends, then unleashed the power of his Sword Dao Domain with but a thought. The vilefiends let out ear-piercing screams before their bodies shattered apart and disappeared.\u003c/p\u003e\n\u003cp\u003eVilefiends were quite unique. They were only able to survive within the Sithelands; even if you managed to capture one, they would instantly dissipate once you took them outside of this area!\u003c/p\u003e\n\u003cp\u003eCultivators had noticed something special about these creatures. Generally speaking, the more of them there were in a place, the more dangerous that place was. Ning had immediately encountered dozens of them as soon as he had descended upon this sealed planet; this meant there was an abnormally high concentration of them here.\u003c/p\u003e\n\u003cp\u003e“I hope the situation isn’t as bad as it looks.” Ning felt even more nervous. The five Autarchs had given Ning extremely detailed maps and notes pertaining to the Sithelands, and Ning couldn’t help but feel increasingly worried for the Paragon of Pills.\u003c/p\u003e\n\u003cp\u003e“Let’s move fast.” Ning led Azurefiend in advancing towards the other end of his karma lines at high speeds.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-41-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-41-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-41-chapter-3","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
