{"id":51071,"no":1374,"title":"Book 42, Chapter 16 - Charging Into the Elder Hall","content":"\u003cp\u003eIn the end, Ji Ning elected to begin silently training in the Spacetime Sword Dao atop that mountain peak within the Sacred Mountains.\u003c/p\u003e\n\u003cp\u003e“He’s training AGAIN?”\u003c/p\u003e\n\u003cp\u003e“This Daolord Darknorth is…!”\u003c/p\u003e\n\u003cp\u003eBowenya and the others were so angry, their teeth hurt.\u0026nbsp;Unfortunately, they wouldn’t dare to actually charge out and attack.\u003c/p\u003e\n\u003cp\u003eNing had long ago mastered his Space Sword Dao and had reached Hegemony in both the Dao of Space and the Dao of Time.\u003c/p\u003e\n\u003cp\u003e“The Spacetime Sword Dao…”\u0026nbsp;Ning silently visualized how it could be manifested.\u0026nbsp;Twenty-six chaos cycles went past without him even realizing it.\u003c/p\u003e\n\u003cp\u003eFinally, Ning opened his eyes and shook his head slightly.\u0026nbsp;He had made significant improvements at first, but now he had reached a major bottleneck and was stuck.\u0026nbsp;He was far from being able to succeed in this Dao, which would most likely take tens of thousands of chaos cycles.\u0026nbsp;He couldn’t waste all of his time here.\u0026nbsp;The ‘Truesoul Everlasting’ technique was even more important.\u003c/p\u003e\n\u003cp\u003e“My true body only has six hundred chaos cycles of life left.\u0026nbsp;I have no chance of mastering the Spacetime Sword Dao.”\u0026nbsp;Ning rose to his feet, his eyes flashing sharply.\u0026nbsp;“Then I suppose I’ll just have to take the risk and try to find a chance for myself.”\u003c/p\u003e\n\u003cp\u003eNing turned to stare at the distant, towering Elder Hall.\u0026nbsp;“Twenty-six chaos cycles have gone past, but Exalt Bowenya refuses to come out.\u0026nbsp;He’s quite steadfast.”\u0026nbsp;If the Exalt came out, he would almost certainly be defeated.\u0026nbsp;Bowenya cared immensely about his own life; why would he come out?\u003c/p\u003e\n\u003cp\u003e“He’s coming!\u0026nbsp;He’s coming!”\u003c/p\u003e\n\u003cp\u003e“He’s headed our way.”\u0026nbsp;Bowenya and the others had been forced to watch as Ning had trained for multiple chaos cycles.\u0026nbsp;Now, Ning was coming for them once more, but this time they didn’t feel too worried.\u003c/p\u003e\n\u003cp\u003e“Let’s see what this Daolord is planning to do,” Bowenya said calmly.\u003c/p\u003e\n\u003cp\u003eSwoosh.\u0026nbsp;Ning reached the Elder Hall, then rested his hand against its outer surface.\u0026nbsp;Moments later, he silently blinked past its outer shell and entered it.\u003c/p\u003e\n\u003cp\u003e“He came inside!!!”\u0026nbsp;Exalt Bowenya’s eyes bulged out in shock.\u0026nbsp;Moments later, they became filled with wild joy as he ordered, “All Hegemons and Emperors, prepare to follow my previous instructions!\u0026nbsp;Stand guard over your stations and attack Daolord Darknorth.\u0026nbsp;Worsen his injuries and make sure he dies within my Daoguard Tower!”\u003c/p\u003e\n\u003cp\u003e“Yes, Exalt!”\u0026nbsp;The response came from throughout the Daoguard Tower.\u003c/p\u003e\n\u003cp\u003e“Ahahaha… Daolord Darknorth, you actually dared to come inside, eh?\u0026nbsp;Even your Autarchs would probably be trapped for an extremely long period of time if they dared to enter my Daoguard Tower.\u0026nbsp;You?\u0026nbsp;A Daolord who failed the Daomerge?\u0026nbsp;Haha… you’ll definitely die!”\u0026nbsp;Bowenya was filled with confidence.\u0026nbsp;He immediately turned and strode into the air, then vanished without a trace.\u003c/p\u003e\n\u003cp\u003eWithin the very center of the Daoguard Tower was a dark and secluded region.\u0026nbsp;This region was filled with an enormous millstone-like formation-base which was slowly swiveling at all times.\u0026nbsp;It emanated ripples of spacetime, and Bowenya was standing atop it.\u0026nbsp;This was the center of the Daoguard Tower, and the main control mechanism for this entire hidden dimension.\u003c/p\u003e\n\u003cp\u003e“This time… I, Bowenya, shall have accomplished something incredible for the Sithe!\u0026nbsp;I’ll be able to truly transcend my service and gain freedom.\u0026nbsp;Daolord Darknorth, you are going to die!”\u0026nbsp;Bowenya stared towards countless globe-shaped illusions that were in front of him.\u0026nbsp;One of the many globes was displaying a white-robed youth who bore a black sheath on his back – Ji Ning.\u003c/p\u003e\n\u003cp\u003eThe many globe-shaped illusions represented the true shape of this Daoguard Tower.\u0026nbsp;It was a spacetime maze!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter blinking into the Daoguard Tower, Ning saw a brand new world appear before him.\u0026nbsp;He was within a dark-red cave that was merely a million kilometers in size.\u0026nbsp;This region was covered with countless flowing runes that brimmed with fiery energy.\u0026nbsp;There was nothing within this region save for Ning himself.\u003c/p\u003e\n\u003cp\u003e“Up, down, left, right, forwards, backwards…”\u0026nbsp;Ning stood there in midair, scanning his surroundings.\u0026nbsp;He could vaguely sense that this region was connected to six other spacetime continuums.\u003c/p\u003e\n\u003cp\u003e“It doesn’t seem to matter which direction I choose.”\u0026nbsp;At Ning’s level, his premonitions were extremely accurate.\u0026nbsp;In truth, these ‘senses’ were a reflection of the whispers of the Chaosverse itself.\u0026nbsp;Ning truly was blessed and doted upon by the prime essences of the Chaosverse, and so his senses were extremely keen.\u0026nbsp;Even here in a spacetime maze, his senses would help tell him which was the best path to take.\u003c/p\u003e\n\u003cp\u003eRumble… suddenly, all of the mystic runes within this region of one million kilometers began to flare up, producing dark-red flames that swarmed the region as they flew towards Ning. Ning was surrounded by his Sword Dao Domain, but the flames were omnipresent.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“What powerful flames.” Ning drew a Northbow sword. Sword-light spun out as he poured his divine power into his sword, using the Earth Sword Dao. It formed a triple layer of rippling yellow energy which surrounded him and protected him. The flames blazed away against him, but the earthen yellow energy simply rippled slightly while managing to endure.\u003c/p\u003e\n\u003cp\u003eOf Ning’s many Daos, the Earth Sword Dao was the best suited for dealing with these corrosive dark-red flames.\u0026nbsp;However, its power would quickly be used up at an alarming rate.\u0026nbsp;Most likely, it would be consumed within ten seconds.\u003c/p\u003e\n\u003cp\u003e“These flames are incredibly powerful.\u0026nbsp;I imagine even the Blazesun Ruler would be roasted to death by them.”\u0026nbsp;Ning quickly began to inspect this spacetime continuum in detail.\u0026nbsp;However, it took him three strikes with his sword to defend against the flames before he was able to locate the critical points to this spacetime continuum.\u003c/p\u003e\n\u003cp\u003eBoom!\u0026nbsp;Boom!\u0026nbsp;Ning began to furiously attack using his Space Sword Dao.\u0026nbsp;His first sword scissored through space like paper, doing the groundwork necessary to allow his second sword to tear through this spacetime continuum.\u003c/p\u003e\n\u003cp\u003eWhoosh!\u0026nbsp;A giant gaping hole in spacetime appeared.\u0026nbsp;Ning immediately darted into it, then stared at the void before him.\u003c/p\u003e\n\u003cp\u003eNing raised his head to glance at the ‘skies’.\u0026nbsp;These spacetime continuums all seemed to be globe-shaped, and the spacetime globes were all linked together.\u0026nbsp;There were dimensional seams between them as well, and Ning was within one of those seams.\u0026nbsp;As he flew through the seams, he carefully inspected the area around him, but in the end was only able to discover a total of four spacetime continuums.\u0026nbsp;Everything else was completely blocked off by these four.\u003c/p\u003e\n\u003cp\u003e“So if I wish to advance, I have to enter one of these four?”\u0026nbsp;Ning hesitated.\u0026nbsp;Suddenly… crack!\u0026nbsp;A bolt of lightning shot out from one of the nearby spacetime continuums, striking towards Ning and forcing him to use his Lightning Sword Dao to defend.\u003c/p\u003e\n\u003cp\u003e“Daolord Darknorth, even if you don’t enter my maze you’ll still die,” a cold voice rang out.\u003c/p\u003e\n\u003cp\u003eNing quickly understood that Hegemons were using treasures within the Daoguard Tower to assault him!\u0026nbsp;If he entered one of the continuums, he would have to face the dangers inherent to each continuum.\u0026nbsp;If he remained outside, he would be ambushed and assaulted by the Hegemons and Emperors.\u003c/p\u003e\n\u003cp\u003eNing glanced at the spacetime around him.\u0026nbsp;“What a formidable formation.”\u0026nbsp;Swoosh!\u0026nbsp;Ning drilled into one of the spacetime continuums, flying inside.\u0026nbsp;The spacetime membrane didn’t block his path, allowing him to enter with ease.\u003c/p\u003e\n\u003cp\u003eThis particular continuum was one filled with a boundless howling wind which felt as sharp as daggers.\u0026nbsp;The wind cut everything within the continuum to ribbons, and Ning was forced to use his Water Sword Dao to defend.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eDanger was everywhere.\u0026nbsp;Death was omnipresent.\u0026nbsp;Ning’s only choice was to defend while searching for ways to defeat the mechanisms inherent to each continuum!\u0026nbsp;It must be remembered that within this spacetime maze, every single spacetime continuum contained a powerful offensive formation.\u0026nbsp;As a result, they weren’t exceptionally stable.\u0026nbsp;These Daoguard Towers weren’t built to trap foes; if trapping the foe was the goal, the Sacred Realm and Purgatory was more than enough.\u0026nbsp;They existed to actively kill enemies!\u003c/p\u003e\n\u003cp\u003eAlas, they were invaders into this Chaosverse.\u0026nbsp;As a result, Sithe Daoguard Towers were only able to draw upon the energy provided by the local generator they had set up.\u0026nbsp;There was a limit to how much power they could draw.\u0026nbsp;Back in their own homeland, they could draw upon the power of the entire Chaosverse.\u0026nbsp;Only then would they be at peak power!\u0026nbsp;Every single spacetime continuum would become dramatically more powerful.\u0026nbsp;Even Autarchs would be attritioned to death.\u003c/p\u003e\n\u003cp\u003eAs for now?\u0026nbsp;It would be hard for this Daoguard Tower to slay an Autarch, but it could certainly trap one for an extended period of time.\u0026nbsp;As for killing a Daolord whose lifespan was limited… Bowenya felt certain that it would be quite easy.\u003c/p\u003e\n\u003cp\u003e“This one here.”\u0026nbsp;Ning broke out of another spacetime continuum, following his premonitions and advancing without hesitation towards a brand-new continuum.\u003c/p\u003e\n\u003cp\u003eHis senses wouldn’t deceive him.\u0026nbsp;This was definitely the path which led him closest to where he needed to go.\u0026nbsp;If he followed this path, he would definitely be able to reach the core of this Daoguard Tower!\u003c/p\u003e\n\u003cp\u003e“Hahaha!\u0026nbsp;Daolord Darknorth, if my count is correct, you’ve already attacked more than fifty times.”\u0026nbsp;Exalt Bowenya’s voice echoed within this mist-filled continuum.\u0026nbsp;“As expected of the first master of an Eternal Omega Dao in this Chaosverse.\u0026nbsp;You truly are impressive, and your senses truly are sharp!\u0026nbsp;Even in a spacetime maze, you are able to find the best path available.”\u003c/p\u003e\n\u003cp\u003eNing completely ignored him, choosing to instead focus on analyzing the new region he was in.\u0026nbsp;He wanted to find the center of this tower, then assault it with all his power.\u0026nbsp;His strikes against it would be far more effective than his strikes anywhere else; two or three strikes would be enough to grant him escape.\u003c/p\u003e\n\u003cp\u003e“But even if you can find the best path, it’ll be of no use. You’ll die of exhaustion before you ever reach it.” Exalt Bowenya roared with laughter. “Let me tell you a little secret. You are still at the outer edges of the spacetime maze. You aren’t even close to me yet!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-42-chapter-15\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-42-chapter-17\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-42-chapter-16","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
