{"id":51129,"no":1432,"title":"Book 44, Chapter 28 - Formation Incarnation","content":"\u003cp\u003eThe Grassland World was Iyerre’s most important trump card, the one he intended to rely on to utterly defeat the cultivators and conquer this Chaosverse. It was the main reason why he was so confident in his ultimate victory. If the Grassland World was destroyed, his chances of victory would become virtually nil. He’d all but simply have to wait for defeat.\u003c/p\u003e\n\u003cp\u003eThus, as soon as Iyerre heard this bad news his mind became filled with many thoughts. For example, how did the cultivators manage to prepare a trap in advance? How was it that the protections of the Grassland World had been breached so easily?\u003c/p\u003e\n\u003cp\u003eThe latter, he had an answer for; he suspected that the silver-robed woman and the other two weren’t ready to defend it with all their strength. But the former? For now, he truly couldn’t understand how the cultivators had managed to set up a trap in advance.\u003c/p\u003e\n\u003cp\u003eHe didn’t have any time to waste asking these extraneous questions. He immediately ordered: “Protect the Grassland World at all costs! Ignite its quintessence core right away!”\u003c/p\u003e\n\u003cp\u003e“Ignite the quintessence core?” The silver-robed woman blinked.\u003c/p\u003e\n\u003cp\u003e“Right. I’m on the way and will be there within a day. You have to hold!” Iyerre’s face was as cold and hard as ice. “I have to win this war. I have to take control over this Chaosverse! If you can’t hold on until I get there, don’t blame me for what I’ll do to you.”\u003c/p\u003e\n\u003cp\u003eThe three couldn’t help but shudder. They knew that if Iyerre became truly infuriated with them… just thinking it chilled their hearts. If Iyerre’s countless aeons of planning ended up being ruined by their cowardice, he might actually kill them!\u003c/p\u003e\n\u003cp\u003e“Understood.”\u003c/p\u003e\n\u003cp\u003e“We’re igniting the quintessence core right now. We’ll definitely hold on!” the three hurriedly promised.\u003c/p\u003e\n\u003cp\u003e“Fine.” Iyerre’s eyes flashed coldly. “Things might seem dangerous, but we still have a chance! If the cultivators have been able to beat you so easily, that means that most likely all of them are there. If possible, trap them all inside the Grassland World! Do your best to tie them down for as long as you can. Once I arrive, we’ll kill them all! We stand the best chance if we can make the battlefield be inside the Grassland World.”\u003c/p\u003e\n\u003cp\u003e“Understood,” the silver-robed woman and the other two said hurriedly. The two sides then broke the connection, followed by Iyerre’s figure vanishing from the pillar of light.\u003c/p\u003e\n\u003cp\u003eThe three finally let out sighs of relief. They felt a great deal of trepidation towards Iyerre. He was normally an affable person who always had a sympathetic smile on his face, but in their homeland he was second only to the Lord of Chaos. If they truly did cause his countless aeons of hard work to go up in smoke, no one could predict how berserk he would become.\u003c/p\u003e\n\u003cp\u003e“Ignite the quintessence.” The three traded a glance, then immediately activated the quintessence core.\u003c/p\u003e\n\u003cp\u003eThe quintessence core was an indigo sphere that was located at the deepest depths of the Grassland World. It was filled with an utterly inconceivable amount of power. This tiny sphere had significantly more energy inside it than the entire Blazesun Domain! It had once been an incredibly vast energy source which had spun through the Infinite Void, but the Sithe Lord of Chaos had ended up harvesting it.\u003c/p\u003e\n\u003cp\u003eNot just any quintessence could be ‘harvested’ like this. The ones which could be harvested while remaining intact and independent were vanishingly rare.\u003c/p\u003e\n\u003cp\u003eBoom! Right as they began to ignite the quintessence, a thunderous boom rang out from the outside world, followed by a loud laugh.\u003c/p\u003e\n\u003cp\u003e“Haha, we broke one!”\u003c/p\u003e\n\u003cp\u003eNing’s voice rang out excitedly: “Come, let’s break the next one!”\u003c/p\u003e\n\u003cp\u003e“Yes, let’s go!” Autarch Titanos was delighted as well.\u003c/p\u003e\n\u003cp\u003eAfter thoroughly destroying the runes and glyphs, they wrecked the entire formation. It was now incapable of transmitting any more energy to the ninth layer of clouds, causing its ‘healing’ speed to lessen. However, destroying just a single nexus wouldn’t be enough to cause the ninth layer to actually collapse. There were nine formations providing energy, after all.\u003c/p\u003e\n\u003cp\u003e“One of them has been destroyed already!” The faces of the silver-robed woman and the other two turned pale.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBoom! The quintessence core ignited, causing the entire world to flare with ten thousand times more power than before! The Grassland World became filled with power, with a blurry blue light appearing everywhere within it. As for the eight remaining conduit formations, they began to pump energy out at their absolute maximum capacities! A vast torrent of energy pumped out, causing all of the formations throughout the Grassland World to skyrocket to maximum power.\u003c/p\u003e\n\u003cp\u003eStill, there was a limit to how much the conduits could pass through. The remaining amount was simply wasted. One of the nine formations generating the nine cloud layers had been destroyed, after all. Despite that, the power of the formations still rose by over 60%! If all of the formations had remained intact, the power would have instantly doubled.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eRiiiip! Autarch Titanos was right in the middle of using his giant black five-headed serpent to keep a rift in the clouds open while Ning used the giant divine sword to attack yet another conduit formation.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, all of the clouds began to glow with blurry white light. The white light was very comfortable and carried the blessings of radiance, but it also caused the restrictive pressure generated by the clouds to skyrocket in power by 60%!\u003c/p\u003e\n\u003cp\u003eIt must be understood that once one reached an extremely high level of power, improving by merely 10% to 20% was already extremely difficult. A sudden increase of 60% made it impossible for the black serpent to keep the rift open any longer.\u003c/p\u003e\n\u003cp\u003e“I can’t break through it any longer.” The divine sword had to fight back against the combined assault of the nine violet-gold chains while also enduring the restrictive pressure of eight different cloud layers. There was no way for it to keep attacking the formation, especially now that the power of the violet-gold chains had increased multifold and the clouds had grown more powerful as well.\u003c/p\u003e\n\u003cp\u003e“I can’t keep holding any longer either.” Autarch Titanos was similarly anxious. His black serpent was fighting back against the ninth and strongest cloud layer.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eDeep within a giant palace inside the Grassland World. The red-robed man and the other two were seated here, head raised and staring past the dimensional barriers to see what was happening in the world outside.\u003c/p\u003e\n\u003cp\u003eBelow them were a host of other figures, including the three Autarch-class void dwellers and a number of Sithe Exalts. Iyerre had a number of ‘spare’ Exalts who hadn’t been needed to control the various temples, and they had been assigned to the Grassland World. ‘Bowenya’ was here as well.\u003c/p\u003e\n\u003cp\u003e“Should we attack?” the black-robed man said in his cold voice.\u003c/p\u003e\n\u003cp\u003e“Not just yet.” The red-robed man frowned. “We still haven’t managed to locate the true bodies of the Autarchs yet. That sword is merely composed of energy and magic treasures! Now that we’ve ignited the quintessence core, they won’t be able to cause any further damage to our formations. Let’s wait for their true bodies to descend, then trap them inside. When they are inside, we’ll be ready to wrap this battle up.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” The silver-robed woman nodded.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing and the others were indeed in a tough situation. The power of the nine cloud layers in the Grassland World had increased dramatically, while the violet-gold chains had become several times more powerful as well. They were finding it difficult to fight back.\u003c/p\u003e\n\u003cp\u003e“Withdraw.” The divine sword, previously capable of piercing through eight cloud layers, quickly retracted to the ninth cloud layer and then flew over to help the black serpent push at the rift. Once the rift was closed, all connection to the outside world be lost. They would no longer be able to control those treasures using mana or godsense, resulting in the collapse of the sword.\u003c/p\u003e\n\u003cp\u003eRiiiiiip. The divine sword was still mighty enough to tear the ninth layer of gray clouds open, but it was only able to tear a thousand-kilometer hole now.\u003c/p\u003e\n\u003cp\u003e“Iyerre has yet to make his move. That means he probably hasn’t arrived yet. This is a perfect opportunity which won’t come again. We need to seize this moment to destroy this weapon!” Autarch Stonerule sent mentally.\u003c/p\u003e\n\u003cp\u003e“I feel like we should have us attack in person now,” Autarch Ekong said.\u003c/p\u003e\n\u003cp\u003e“Agreed. However, we need to remain cautious. Our true bodies should just remain in the outermost layer of clouds and keep it open,” Autarch Titanos said. “We can’t go any deeper inside! Once we do, the Sithe will probably use certain tricks to keep us trapped in there. We’d be shut off from the outside world and unable to maintain our connection to the formation, at which point we would probably all be wiped out!”\u003c/p\u003e\n\u003cp\u003eNing and the others were all wary of this possibility as well. They couldn’t afford to take a risk like that.\u003c/p\u003e\n\u003cp\u003e“Alright. Let’s make our moves.”\u003c/p\u003e\n\u003cp\u003eJust a short while later, a towering figure suddenly appeared within the void and strode towards the gray clouds. This vast figure was barefoot and almost completely naked, wearing just a fur loincloth. It had seven faces and fourteen arms! The face in front resembled that of Ning’s, while the three faces to the left side and the three faces to the right side resembled those of Autarch Titanos and the rest of the six. The towering figure’s body was covered with a blurry layer of sword-light, and the very act of walking caused it to emanate an aura of terrifying destructive force.\u003c/p\u003e\n\u003cp\u003eNing and the others had such powerful bodies that they were strongest in close combat. This formation-incarnation was formed by the seven of them using the power of the outside formations, but led by Ning using his Omega Sword Dao. All seven of their true bodies were located inside this formation-incarnation. As soon as it had been created, it had emanated a natural aura of infinite sword-light. Every single movement it made was filled with ineffable might.\u003c/p\u003e\n\u003cp\u003e“Being responsible for this incarnation is incredibly taxing.” Ning could feel his entire body aching, as could Autarch Titanos and the others. Not only did they have to keep the giant formation in the outside world active while controlling the divine sword, they also had to physically join together in this vast formation-incarnation.\u003c/p\u003e\n\u003cp\u003eSplitting their energies three different ways like this was no easy task!\u003c/p\u003e\n\u003cp\u003e“While we keep the sword active, we’ll only be able to use 70% of this formation-incarnation’s power,” Ning mused to himself. From a tactical standpoint, they would become deadlier if they completely abandoned the sword and instead focused on pouring all of the formation’s energies into this incarnation, using 100% of its power! Still, it wasn’t yet necessary for them to take such a drastic step.\u003c/p\u003e\n\u003cp\u003eRiiiiip. The formation-incarnation strode forwards towards the grayish clouds, its fourteen arms reaching out simultaneously in ripping motions. The clouds around them quickly began to roil about as a vast area of ten thousand kilometers was torn open by it.\u003c/p\u003e\n\u003cp\u003eIt was quite easy for the formation-incarnation to keep this rift open, freeing up the giant black serpent and the divine sword to continue stabbing downwards.\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-44-chapter-27\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-44-chapter-29\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-44-chapter-28","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
