{"id":51137,"no":1440,"title":"Book 45, Chapter 7 - Doll","content":"\u003cp\u003eThe two sides stared at each other from far. They seemed relaxed, but the atmosphere was already beginning to tense up.\u003c/p\u003e\n\u003cp\u003e“Hmph. Talking won’t solve anything. Come and stop my Grassland World, if you dare,” Iyerre said, then sank into the gray clouds and vanished. At the same time, the ovaloid object transformed into a streak of light and shot towards the vast behemoth hive.\u003c/p\u003e\n\u003cp\u003eJi Ning and the others traded glances.\u003c/p\u003e\n\u003cp\u003e“Iyerre vastly surpasses us in terms of insight. Now that he’s personally in control of the Grassland World, no formation we can use would be able to slow it down.” Autarch Titanos smiled. “The Grassland World can enter the Annihilation Hive with ease, protecting it and allowing it to continue devouring our Chaosverse’s energies. The only way to stop it is to go inside of it!”\u003c/p\u003e\n\u003cp\u003e“Charge into the Grassland World and break it apart.” Autarch Bolin nodded slightly.\u003c/p\u003e\n\u003cp\u003e“That’s the only option. Gentlemen, let’s do this.” Ning laughed.\u003c/p\u003e\n\u003cp\u003e“We’ll have to trouble you to lead us in this fight, Darknorth. We’ll need your guidance for the Sword Titan and the Avatar Titan,” Autarch Stonerule said.\u003c/p\u003e\n\u003cp\u003e“I can serve as the leader, but I’ll need all of your support.”\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Let’s do this.” Ning and the others shared a few quick words, then began to make their moves.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! The seven Autarchs and their seven avatars began to simultaneously call upon the power of the Chaosverse, gathering it around them to form vortexes of energy that quickly transformed into a pair of towering titans! Both titans were nearly nude and clad only in fur loin-cloths, but one had a slightly more powerful aura than the other.\u003c/p\u003e\n\u003cp\u003eThe Sword Titan and the Avatar Titan advanced side-by-side towards the ovaloid object.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIyerre appeared out of nowhere within the palace hidden deep within the Grassland World. Flanking him was the silver-robed woman and the two men, while below him stood the Sithe Exalts and the three Autarch-class void dwellers.\u003c/p\u003e\n\u003cp\u003e“Vilesky, you three come over here to the center,” Iyerre instructed.\u003c/p\u003e\n\u003cp\u003eThe three Autarch-class void dwellers exchanged puzzled glances, then nervously advanced to the center of the palace. The cyclopean bear, the red-eyed white-furred humanoid, and the tentacled stormcloud harbored distrust towards the Sithe, but unfortunately they were much weaker than Iyerre. There was nothing they could do! In the Infinite Void they were weaker than Iyerre, and even here in the Grassland World they were still weaker than Iyerre.\u003c/p\u003e\n\u003cp\u003e“Those native cultivators are about to attack. This shall be the final battle.” Iyerre glanced down at the three void dwellers, then smiled: “I’ll need you three to be prepared to make sacrifices for our victory.”\u003c/p\u003e\n\u003cp\u003e“Just tell us what you need us to do. We’ll do everything in our power,” the three responded respectfully.\u003c/p\u003e\n\u003cp\u003e“Excellent.” Iyerre nodded. “What I need is for the three of you to offer me your lives.”\u003c/p\u003e\n\u003cp\u003eSurprise appeared in the eyes of the cyclopean bear and the other two, only to be quickly replaced by utter terror. Suddenly, nine violet-gold chains appeared in the area around them. Each chain moved in an abstruse and profound manner, and they howled through the air as they lashed out at the three Autarch-class void dwellers.\u003c/p\u003e\n\u003cp\u003e“Iyerre, what the hell are you doing?!”\u003c/p\u003e\n\u003cp\u003e“Didn’t you promise to give us our freedom if we helped you?”\u003c/p\u003e\n\u003cp\u003e“Why are you attacking us?!”\u003c/p\u003e\n\u003cp\u003eThe three void dwellers tried to fight back, but now that Iyerre was personally controlling the violet-gold chains, the void dwellers were vastly outclassed in both power and technique. The violet-gold chains immediately began to land brutal blows on them, causing their bodies to explode. The chains then quickly wrapped around their life-cores.\u003c/p\u003e\n\u003cp\u003eThe nearby Sithe Exalts all watched in shocked silence. None of them dared to say a word. They knew how ruthless Iyerre was. To him, anyone and everyone was but a pawn to further his goals. The ‘promises’ those three Autarch-class void dwellers had believed in were nothing more than jokes!\u003c/p\u003e\n\u003cp\u003e“Give you your freedom?” Iyerre stared down at them, his eyes flickering coldly. “Did you three idiots really think you were qualified to negotiate terms with me? If it wasn’t for the fact that I had a use for you, I never would’ve let you remain alive for this long.” Iyerre then reached out with his right hand, producing three adorably-shaped black dolls. The three black dolls flew out to hover directly above the center of the palace.\u003c/p\u003e\n\u003cp\u003eHiss. Hiss. Hiss. The shattered remnants of the void dwellers’ bodies began to fly towards the black dolls. Even their life-cores, still entangled by those chains, began to fly towards them.\u003c/p\u003e\n\u003cp\u003e“No…!”\u003c/p\u003e\n\u003cp\u003e“No… but… no!”\u003c/p\u003e\n\u003cp\u003eThe three Autarch-class void dwellers suddenly felt a sensation of infinite terror. Those ordinary looking dolls were exerting lethal amounts of gravitational attraction, causing their life-cores to uncontrollably fly towards them. Their splattered bits of blood and flesh were also flying towards the black dolls, and as soon as they touched the dolls they were swallowed up with a hiss.\u003c/p\u003e\n\u003cp\u003e“Iyerre, you’ll definitely fail. You’ll fail!!!” a life-core with the illusion of a cyclopean bear inside screamed frantically.\u003c/p\u003e\n\u003cp\u003e“You’ll die! The cultivators will kill you all!” The life-core which was filled with an illusion of a tentacled stormcloud was struggling and braying as well.\u003c/p\u003e\n\u003cp\u003e“Damn you, Iyerre! You are shameless!” the phantom of the red-eyed, white-furred beast bellowed.\u003c/p\u003e\n\u003cp\u003eThe three life-cores flew towards the three black dolls, which effortlessly devoured them as well as the flesh and blood from their corpses.\u003c/p\u003e\n\u003cp\u003eIyerre couldn’t help but secretly feel amazed by this. “Master’s skills in artifice are simply incredible. Those Autarch-class void dwellers might be foolish, but their bodies are incredibly sturdy. It is their bodies which gave them Autarch levels of power, but the dolls were able to devour them with ease. I may also be an Omega Autarch, but I’m far from being Master’s equal when it comes to artifice.”\u003c/p\u003e\n\u003cp\u003eHis master was a Lord of Chaos. Although they were both Omega Autarchs, Iyerre felt that his master remained superior to him in many different areas!\u003c/p\u003e\n\u003cp\u003eIt was much like how Bolin, Titanos, Mogg, and the others were all Autarchs but shared different insights and were at different levels of power. There was indeed a great difference in power between Iyerre and his Master. The creation of the Annihilation Hive and the Grassland World had only been possible because his master had provided him guidance from behind the scenes. As for the black dolls, his master had personally created these things.\u003c/p\u003e\n\u003cp\u003eWhoosh! The three black dolls floating in midair suddenly began to dramatically expand in size, transforming into a trio of towering black scaled beasts which now lay on the ground. They pulsed with auras of power but didn’t move in the slightest.\u003c/p\u003e\n\u003cp\u003e“Separate into three squads as I previously instructed.” Iyerre glanced at his other subordinates. The silver-robed woman, the black-robed man, and the red-robed man immediately acknowledged the order while the many Sithe Exalts quickly took up positions behind them.\u003c/p\u003e\n\u003cp\u003e“From now on, each squad will be in charge of controlling one of these machine warbeasts,” Iyerre said. “Although each has devoured the full power of an Autarch-class void dweller, it will only be able to fight at peak power for roughly one hour. Thus, we must achieve victory as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Understood,” the silver-robed woman and the other two said. They had known all along that this was going to happen. Indeed, the reason why Iyerre had invited them to take part in this invasion was for them to operate the machine warbeasts. Ordinary Exalts were a bit too weak to truly unleash the potential of these things in battle. Each of the three would control one, with the other Exalts providing assistance.\u003c/p\u003e\n\u003cp\u003e“Now go,” Iyerre commanded.\u003c/p\u003e\n\u003cp\u003eSwoosh! Swoosh! Swoosh!!! The silver-robed woman and the others quickly flew inside the enormous machine warbeasts and took control of them. This was a major trump card which their Lord of Chaos had bestowed upon Iyerre.\u003c/p\u003e\n\u003cp\u003e“GWAAAAAR!” The three black warbeasts raised their heads and howled. Their auras were actually stronger than those of the Autarch-class void dwellers, because the machine warbeasts were burning up all of their power at a rapid pace while holding nothing back. They could also attack with marvelous techniques; they weren’t nearly as clumsy as those void dwellers were!\u003c/p\u003e\n\u003cp\u003e“They are coming.” Iyerre raised his head to stare towards the skies. He could see two towering giants wielding divine swords chop through the grayish clouds as though the clouds were nothing more than rotted wood. The two titans charged downwards, easily piercing through the layers of clouds.\u003c/p\u003e\n\u003cp\u003e“Follow my orders.” A savage look appeared on Iyerre’s face. “Each of you can only fight for an hour, so we need to do everything we can to annihilate them during that period of time! This is the Grassland World, a battlefield of our choosing. We’re definitely going to win. Now go! Kill these cultivators!”\u003c/p\u003e\n\u003cp\u003e“Kill!” Whoosh. Whoosh. Whoosh. The three black warbeasts quickly warped through space and disappeared from the temple.\u003c/p\u003e\n\u003cp\u003eAs for Iyerre, his eyes were blazing as he barked, “Quintessence, ignite!” Instantly, the quintessence core located deep within the Grassland World once more began to erupt with power, filling every inch of the entire world with tremendous might. The battle had just begun, but everyone was already preparing to fight like a madman!\u003c/p\u003e\n\u003cp\u003eIyerre disappeared from the palace, going forth to face his foes.\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-45-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-45-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-45-chapter-7","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
