{"id":51148,"no":1451,"title":"Desolate Era - Afterword","content":"\u003cp\u003e\u003cstrong\u003eAuthor’s Afterword:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhew. It’s over. Nearly two and a half years have passed, starting from Dec 16, 2012 until today, April 10, 2015. Our journey through the [Desolate Era] is finally over. The enormous [Desolate Era] started with our Ji Ning stumbling through the Netherworld Kingdom into his next reincarnated life, and now we can finally put a final period on this story.\u003c/p\u003e\n\u003cp\u003eThis is the seventh novel which Tomatoes has written. [Legend of the Astral Peaks], [Inch of Radiance], [Stellar Transformations], [Coiling Dragon], [The Nine Cauldrons], [Swallowed Star] came before it. This has been the seventh.\u003c/p\u003e\n\u003cp\u003e[Desolate Era] has had games and anime made based off of it, with the first episode of the anime already released. It was a bit slow at first due to a lack of familiarity, but starting from the third episode it should speed up quickly. It should stabilize at roughly an episode a week and will continue to be broadcast. A TV series is about to start shooting as well, and it’ll go on satellite television. We’re also preparing for a movie, but [Desolate Era] will require a large amount of investment and so it will be a while in the coming.\u003c/p\u003e\n\u003cp\u003eWhew. Two and a half years. Haha, two and a half years is a very long period of time! My son was born, and now he can actually recite poetry. I’m speechless.\u003c/p\u003e\n\u003cp\u003eAs for this novel I spent two and a half years writing? At first, everything was so smooth and easy. I was fired up and filled with energy, and the letters just kept flowing. However, towards the middle/late parts of the novel, I was just too tired, especially after I went past 2 million characters. I felt as though I was a marathon runner who had reached his limit and at the verge of collapse. I worked until very late at night, every night, burning the midnight oil and tearing my hair out to think about what to write. Sometimes I couldn’t even be bothered to shower. I was a man possessed.\u003c/p\u003e\n\u003cp\u003eI was most tired during the latter half of last year. The pressure was tremendous, and the need to write two chapters a day resulted in the plot being imperfect. I tried to force myself to think and to post new chapters, and I nearly went mad from it all. There were several times, late at night last year, where I felt my heartrate speeding up so rapidly that I thought that I might die at any moment. I managed to force myself to last until January, at which point I gritted my teeth and said ‘Screw it’, slowing down to one chapter a day.\u003c/p\u003e\n\u003cp\u003eThis made things much easier for me. My mental energies quickly began to recover, and I feel as though my physical conditioning has improved by 50%, haha.\u003c/p\u003e\n\u003cp\u003eI poured my blood, sweat, and tears into [Desolate Era]. It feels like part of my life itself. Now that I’m done writing it, I feel relaxed. Finally, I can take a long break… but at the same time, I feel a bit reluctant to part with it. My emotions are quite complicated.\u003c/p\u003e\n\u003cp\u003eNo matter what, [Desolate Era] is over! This book is done, and I had a smile on my face as I wrote the grand finale.\u003c/p\u003e\n\u003cp\u003eMm. As for what’s next? A new book, of course!\u003c/p\u003e\n\u003cp\u003eThe new book will be set in a strange and mysterious continent. It’ll be a completely different type of book, one which I’ve never written before. In fact, the cultivation system within it will be unlike any other I’ve worked on! Haha. I’ve been a novel writer for nearly ten years, after all. I need to find my breakthrough! All I want to say is that I’ll use all of my emotions to write this new novel, pouring all of my ardor into it.\u003c/p\u003e\n\u003cp\u003eBut of course… now that I’ve finished [Desolate Era], I’m going to completely relax and empty my mind for a time, then prepare for a new book. I’ll give myself two months of rest, then officially start the next book on June 15\u003csup\u003eth\u003c/sup\u003e!\u003c/p\u003e\n\u003cp\u003eFor news on my next book as well for some super secret updates, you can all pay attention to my public ‘WeChat’ account. I’ll keep it updated with news. All you need to do is search for ‘我吃西红柿’ or ‘fanqie34’ and you’ll be able to add me.\u003c/p\u003e\n\u003cp\u003eAlrighty then. Everything’s ok now. The world of [Desolate Era] has come to an end. The next time we meet, it’ll be in the world of my new book. See you all on June 15\u003csup\u003eth\u003c/sup\u003e!\u003c/p\u003e\n\u003cp\u003eTomatoes,\u003c/p\u003e\n\u003cp\u003eThe evening of June 10\u003csup\u003eth\u003c/sup\u003e, Yangzhou City.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan class\u003d\"fr-video fr-fvc fr-dvb fr-draggable\" contenteditable\u003d\"false\" draggable\u003d\"true\"\u003e\u003ciframe width\u003d\"640\" height\u003d\"360\" src\u003d\"https://www.youtube.com/embed/9HgGKX6NYe4?wmode\u003dopaque\" frameborder\u003d\"0\" allowfullscreen class\u003d\"fr-draggable\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cstrong\u003eRWX\u0027s Afterword:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhew. \u0026nbsp;Wow. \u0026nbsp;Yikes. \u0026nbsp;Wooooow!\u003c/p\u003e\n\u003cp\u003eThis is the third IET novel that I have worked on (with Coiling Dragon and Desolate Era being solely translated by myself). \u0026nbsp;I agree with author IET that \u00272.5 years is a very long period of time\u0027; I spent just as much time translating DE as he did writing it, and in fact I\u0027ve been translating his novels from 2014 to 2018! \u0026nbsp;That\u0027s an even longer period of time.\u003c/p\u003e\n\u003cp\u003eI want to thank each and every reader, commenter, donor, sponsor, and \u003cstrong\u003efriend\u003c/strong\u003e who has supported this translation. \u0026nbsp;Like IET, it\u0027s been a very long and exhausting process and I\u0027m both filled with joy that its over but also nostalgia and a bit of reluctance to part with it. \u0026nbsp;However, \u0027there is no party that goes on forever\u0027; 天下没有不散的筵席. \u0026nbsp;I\u0027ve translated in sickness and in health (I was actually in the hospital just earlier today due to a severe fever), through breakups and through makeups, and all the other things that can happen over the course of such a long period of time. \u0026nbsp;Now, Ji Ning\u0027s story has finally come to an end. \u0026nbsp;As IET notes in his April 2015 afterword, there is also a live-action adapation of DE coming shortly (theoretically in the next month or so) and we\u0027ll be sure to announce it as well! \u0026nbsp;We were originally going to have a short video by IET as well, but he couldn\u0027t quite fit it in his schedule. \u0026nbsp;We\u0027ll post it as a separate announcement later.\u003c/p\u003e\n\u003cp\u003eThere have been so many memories that have built up over the years, and I\u0027ve talked and interacted with so many of you that I genuinely view you as friends and family. \u0026nbsp;My keenest memory is of a \u0027Daolord\u0027 on Patreon who deleted his pledge... or rather, his brother did. \u0026nbsp;When his brother deleted the pledge, he added a note: \u0027\u003cem\u003eThanks for translating, but my big bro just passed away and I\u0027m cutting his pledges :( Thanks for understanding, he failed his Daomerge\u003c/em\u003e\u0027 \u0026nbsp;I damn near broke down on the spot. \u0026nbsp;I hope that all of you and your loved ones are as hale and hearty as you were when you first started Desolate Era, and that you will continue to be so many, many years in the future!\u003c/p\u003e\n\u003cp\u003eSo what will I be doing next? \u0026nbsp;Well, five years translating one specific author is more than enough, even one that I cherish as much as IET; for newcomers, it was my translation of Coiling Dragon which inaugurated the launch of Wuxiaworld! \u0026nbsp;In addition to maintaining the site and handling company matters like licenses, copyright, etc., I\u0027ll be doing two things in specific - I\u0027ll be announcing tomorrow the relaunch of \u003ca href\u003d\"https://www.wuxiaworld.com/novel/the-godsfall-chronicles\"\u003eGodsfall Chronicles\u003c/a\u003e working with Xiao Lai (we have ten chapters ready!), and when I have a sufficient stockpile I\u0027ll launch \u003ca href\u003d\"http://www.wuxiaworld.com/novel/dragon-talisman\"\u003eDragon Talisman\u003c/a\u003e on Wuxiaworld! \u0026nbsp;I said before that I viewed Godsfall Chronicles as one of the most novel-quality webnovels out there, and I stand by that belief. \u0026nbsp;As for Dragon Talisman, it has a very refreshingly kind-hearted main character and a world which is steeped deep in Chinese lore and history, which I will endeavor to make as accessible as possible. \u0026nbsp;These are two spectacular novels, and I hope to gain the same support and love as I\u0027ve had from you in the past :D.\u003c/p\u003e\n\u003cp\u003e1:08 AM, April 21st of 2018, Chengdu City.\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-45-chapter-17\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-afterword","bookId":1501,"creation":"Sep 10, 2019 4:16:14 AM","modification":"Sep 10, 2019 4:16:14 AM"}
