{"id":49713,"no":16,"title":"Book 1, Chapter 16 - Causing Devastation","content":"\u003cp\u003eAfter having received two consummate sword techniques, Ning had been training hard, of course. He was now capable of utilizing the techniques of the [Raindrop Sutra] and the [Thunderflame Sword], and his power had increased. However, he had only learned a tiny bit, and he wasn’t even at the level of expertise, much less mastery. After all, even his father, Yichuan, was still pondering on the secrets of the [Raindrop Sutra].\u003c/p\u003e\n\u003cp\u003eThunderflash Flint was one of the three killer moves of the [Thunderflame Sword]. It relied on a single word; fast!\u003c/p\u003e\n\u003cp\u003eAs fast as lightning! As swift as flame!\u003c/p\u003e\n\u003cp\u003e“Ning’s swordplay and his footwork are both exquisite,” Snow said in praise from the viewing platform. “Although the Howling Moonwolf is as fast as a shadow, even faster than Ning, Ning has relied on the [Shadewind Steps] to constantly change directions. He’s in complete control of this battle. His swordplay has reached the ‘advanced’ level, and he can quickly make multiple changes in his movements. In dealing with that monstrous wolf… it can be said that his defense is airtight.”\u003c/p\u003e\n\u003cp\u003eYichuan nodded. “With the Fiendgod Body Refining, Ning’s great strength is his forte, while his speed is a bit weaker… but this is a Godbeast, after all. It has an extremely strong life force. A wound like this is just a skin wound to it. When it starts fighting all out, and with Ning never having experienced such a vicious life and death battle before, the results will be hard to predict.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBelow, Ning had the feeling that everything was under control, and he continued to wield the sword in his hand as he drew near the Moonwolf.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eAwoooooo\u003c/em\u003e!”\u003c/p\u003e\n\u003cp\u003eSensing the threat of death from this human youth, the Moonwolf gave a savage howl. All the fur on its body stood up straight as needles, and its eyes turned hard, its pupils flashing. Those who were familiar with Moonwolves could tell… that this one had already entered a wild, bestial state.\u003c/p\u003e\n\u003cp\u003eA terrifying aura spread forth from it, causing Ning to pause.\u003c/p\u003e\n\u003cp\u003eA killing aura?\u003c/p\u003e\n\u003cp\u003e“Growl!” The Howling Moonwolf charged towards him, the earth shaking beneath it.\u003c/p\u003e\n\u003cp\u003eNing dodged as agilely as the wind, changing directions with a simple step. At the same time, his sword flashed. Chi! Fresh blood sprayed out once more, and yet another enormous wound appeared on the Moonwolf’s chest, but this time, the Moonwolf didn’t care at all as it sent its two pairs of ferocious paws towards Ning, its knife-like claws slashing through the air.\u003c/p\u003e\n\u003cp\u003eNing calmly retreated while at the same time, using his sword to block.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eKa!”\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Moonwolf’s left paw slammed against the sharp sword, its paw seeming to have transformed into a hook which suddenly latched onto the sword. But how could Ning’s sword, infused with his Fiendgod Body Refining power, be so easily caught? If the two clashed and then immediately flew apart, it wouldn’t have been so bad, but the Moonwolf wanted to fight that power head on with his claws, and so it smashed it hard against the sword.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eKa!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Moonwolf’s left paw clearly turned red with blood, and the faint sound of bones breaking could be heard.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHua!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe other paw came at Ning’s chest. The distance was simply too close, and there was no chance to block. Ning’s only option was to take a deep breath, and his chest suddenly retracted in by three centimeters. Chi! Chi! Chi! The tough animal fur over Ning’s chest was ripped to tatters. Blood spouted everywhere, and Ning was knocked flying as well, striking against the ground and making the earth itself crack from the impact.\u003c/p\u003e\n\u003cp\u003eSwoosh! Ning hurriedly pulled away.\u003c/p\u003e\n\u003cp\u003e“Injured.” Ning looked at the Moonwolf, his eyes narrowing.\u003c/p\u003e\n\u003cp\u003eJust then, the Moonwolf had actually chosen to use its paw to take his sword head on. The Howling Moonwolf didn’t care about what injuries upon itself were being inflected, as it was going all out. Its left paw was now half useless, and its speed had dropped dramatically as well. But the paw blow it had landed on Ning had torn through Ning’s beast skin clothes. The beast skin clothes were part of the fur from a Xiantian lifeform. Without any monstrous power infused into it, the defense would be a bit weaker, but generally speaking the fur from a Xiantian lifeform would be able to block the attacks of a Houtian monster.\u003c/p\u003e\n\u003cp\u003eHowever, the Howling Moonwolf was a Godbeast. Its full strength attack was able to rip the fur apart.\u003c/p\u003e\n\u003cp\u003eIn order to further train himself… although Ning had the protection of the Goldstar Shirt and could use it to guard his entire body, Ning had shrank its defensive radius to only protect his most vulnerable areas.\u003c/p\u003e\n\u003cp\u003e“A life-and-death battle is different from a spar. I can’t just use the experience I gained while sparring.” Ning quickly changed his calculations. “When sparring, nobody will engage in self-destructive behavior, but in a life-and-death battle… the goal is to kill the opponent. For the sake of this goal, any price is worth paying.”\u003c/p\u003e\n\u003cp\u003e“I need to be more careful and more cautious.”\u003c/p\u003e\n\u003cp\u003eNing was like a sponge, quickly absorbing the learned experience. The fierce scar over his chest was visibly shrinking. The blood from it began to stop, and soon, it totally closed over, leaving behind a red line which then turned into white, clear skin. No lasting damage at all!\u003c/p\u003e\n\u003cp\u003eThis was the powerful regenerative power provided by Fiendgod Body Refining.\u003c/p\u003e\n\u003cp\u003eOrdinary Fiendgod Body Refining techniques only required a person to reach the Xiantian level before being able to regrow severed limbs. But Ning trained in the number one Fiendgod Body Refining, and his healing abilities were nearly on par with that sort of regeneration already.\u003c/p\u003e\n\u003cp\u003e“Excellent!” Ning cracked his lips into a smile. “It actually took my sword away.”\u003c/p\u003e\n\u003cp\u003e“Roaaaar.” The sword was stuck right beneath the Howling Moonwolf’s paw. It stared at Ning, its eyes filled with boundless bloodlust. The terrifying recuperative abilities of the human youth in front of it… it understood that this was a Fiendgod in human skin, with even greater healing abilities than Godbeasts.\u003c/p\u003e\n\u003cp\u003eNing waved his right hand, and yet another sharp sword appeared within it.\u003c/p\u003e\n\u003cp\u003e“Come again.”\u003c/p\u003e\n\u003cp\u003eNing transformed into a shadow as he pounced towards the Moonwolf.\u003c/p\u003e\n\u003cp\u003e“Roaaar!” The Howling Moonwolf charged forward as well.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe two engaged each other time and time again, each time exchanging blows that nearly took the other’s life. Ning possessed powerful healing abilities and terrifying power, and a fierce sword attack style! But the Howling Moonwolf had its fangs, sharp claws, and tail, all of which it could use as weapons. In addition, its massive body was so large that most weapon wounds were of minimal threat to it.\u003c/p\u003e\n\u003cp\u003e“So he’s only using the Goldstar Shirt to protect his vital points.” A rare smile appeared on Yichuan’s face.\u003c/p\u003e\n\u003cp\u003e“Ning really is trying very hard.” Snow was growing nervous as she watched.\u003c/p\u003e\n\u003cp\u003eHer son’s body was covered in bloodstains. As his mother, how could she not worry?\u003c/p\u003e\n\u003cp\u003e“Don’t worry. Ning has still covered his body’s vital points with the Goldstar Shirt. Even if he is wounded, it won’t be life-threatening,” Yichuan said. “At most, he might lose an arm or a leg… but given his regenerative abilities, with a little bit of time, he’ll grow another one.”\u003c/p\u003e\n\u003cp\u003e“Lose an arm or a leg?” Snow couldn’t help but grow frantic, but she knew how difficult the road to becoming an expert had to be.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eHu!” “Hu!” “Hu!”\u003c/em\u003e Although Ning had the body of a Fiendgod, right now, he couldn’t help but pant for breath. The fur clothes on his body were already ripped apart in many areas, and the wound on his body was rapidly closing.\u003c/p\u003e\n\u003cp\u003e“Roaaaar.”\u003c/p\u003e\n\u003cp\u003eThe Moonwolf let out a despairing growl. It was forcing itself to stand erect, but its two paws were both quivering, as though it could collapse at any time. Its body was covered with dozens of giant wounds, and a particularly vicious pierce-wound was in its head.\u003c/p\u003e\n\u003cp\u003eBoth of its legs had been shattered. It was already quite an impressive feat for it to be able to remain standing.\u003c/p\u003e\n\u003cp\u003e“You lose.” Ning wiped the blood from the corner of his eyes, then said in a quiet voice, “My power is actually greater than yours, but my victory was quite a difficult one… the reason is because when faced with your bloodlust and your wildness, I was unable to be calm and bring out my full power. You are the first monster that I have ever killed, and thus, I will let you die under my greatest attack!”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHua!\u003c/em\u003e A second sword appeared out of nowhere in Ning’s left hand. Holding the twin swords, he stared at the Moonwolf.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSwoosh!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eNing suddenly transformed into a blur as he threw himself at the Moonwolf. The Howling Moonwolf let out a final howl as it threw itself at Ning as well.\u003c/p\u003e\n\u003cp\u003eTwo massive flashes of light suddenly appeared, destroying one of the Moonwolf’s remaining good legs, and then, with another flash, a massive criss-cross wound appeared on the Howling Moonwolf’s head, sending blood and brain matter flying everywhere.\u003c/p\u003e\n\u003cp\u003eNing landed on the ground.\u003c/p\u003e\n\u003cp\u003eThe Howling Moonwolf collapsed on the ground, brain matter tumbling out of the massive wound on its head. Its fur was stained with the color of the earth, and its formerly beautiful silver fur had became a stained combination of mud and blood, unsightly to the extreme. A descendant of the Fiendgods of the wolf lineage had died!\u003c/p\u003e\n\u003cp\u003e“How do you feel?” Yichuan looked down at his son.\u003c/p\u003e\n\u003cp\u003e“I feel great.” Ning looked up at his father, his eyes filled with ardor. “Let’s do this once a day.”\u003c/p\u003e\n\u003cp\u003eYichuan’s eyelids twitched. He muttered, “Do you think capturing a peak Houtian level Godbeast is easy? Once every three days. And, most will be ordinary monstrous beasts. If you want to fight a Godbeast, it’ll be a matter of luck. I’ll arrange for the most powerful monstrous beasts here in Dragon Castle to be reserved for your training.”\u003c/p\u003e\n\u003cp\u003eNing nodded. “If I meet some weaker monstrous beasts, I’ll just rely on my internal force only.”\u003c/p\u003e\n\u003cp\u003eGiven the power of a Fiendgod’s body, ordinary peak Houtian monstrous beasts would be brutalized by brute force alone. This was why only Godbeasts with Fiendgod heritage in their blood could fight against Ning.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eTime passed by.\u003c/p\u003e\n\u003cp\u003eNing fought with one monstrous beast after another, and his sword technique and footwork grew more exquisite. At the same time, he learned how to better maintain his calm in life-and-death battles. If his heart was not calm… then his power wouldn’t be able to be displayed to perfection.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAutumn had come. Swallow Mountain had become incomparably cold, and some weak tribes had their lives become even more difficult. Especially when they were met with the savage attacks of some monsters from deep in the mountains… some smaller tribes might be exterminated!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHonghonghong\u003c/em\u003e…\u003c/p\u003e\n\u003cp\u003eThe earth was shaking.\u003c/p\u003e\n\u003cp\u003eAtop this barren, desolate wasteland, a large group of black armored riders were riding their long-furred beasts. They seemed like a black flood which was charging across these plains.\u003c/p\u003e\n\u003cp\u003e“Halt.” A cold command. Three hundred powerful black armored riders instantly came to a halt.\u003c/p\u003e\n\u003cp\u003e“Commander, this place is the location where that serpent monster appeared last. This is the territory of the Sharphorn Tribe. Three days ago, the monster suddenly charged at the Sharphorn Tribe and devoured eighteen people, then killed over a hundred. The Sharphorn Tribe was totally destroyed,” a black armored rider said respectfully. “This creature has been an impending disaster for months. It has killed over a thousand people and devastated over ten tribes. However, all of those tribes were small ones. Logically speaking, it should be a peak-stage Houtian level monster with the lineage of the Fiendgods, or perhaps a Diremonster who has recently reached the Xiantian level.”\u003c/p\u003e\n\u003cp\u003e“Hrm.”\u003c/p\u003e\n\u003cp\u003eThe bearded man who was riding a white tiger and wore red, fiery scale mail armor nodded. “This serpent monster has been causing wanton devastation within the area controlled by our Ji clan of the Western Prefecture. It deserves death. It has only appeared in this area… all of you, divide into thirty small units and begin searching. Once you find it, immediately fire the signal arrow.”\u003c/p\u003e\n\u003cp\u003e“Yes.” The three hundred black armored riders acknowledged in unison.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHua…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eSoon, the three hundred mighty black armored riders divided into thirty small units which went searching in various directions.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-15\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-17\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-1-chapter-16","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
