{"id":49715,"no":18,"title":"Book 1, Chapter 18 - Wings","content":"\u003cp\u003e“Mm.” With a flip of his hand, a piece of blue-tinged gold appeared in Ning’s palm. He tossed it directly towards the man with the black serpent. “Take it.”\u003c/p\u003e\n\u003cp\u003e“Just this little tiny piece of gold?” The man with the black serpent and the two behind him were frantic. They stared at that tiny bit of blue-tinged gold, just the size of a finger. “And it isn’t even pure?”\u003c/p\u003e\n\u003cp\u003e“Young master.”\u003c/p\u003e\n\u003cp\u003e“Respected young master.”\u003c/p\u003e\n\u003cp\u003eThe three men began to call out and beg. How could they possibly return to the tribes with this? The other tribal warriors were outside the city waiting. None of them were willing to enter the city… because the cost of entering the city was a lambskin or some other equivalent value item.\u003c/p\u003e\n\u003cp\u003e“You pack of idiots. That is thundergold!”\u003c/p\u003e\n\u003cp\u003e“I’m willing to pay a hundred beastheads of gold for that piece of thundergold.”\u003c/p\u003e\n\u003cp\u003e“Just a hundred beastheads? A piece of thundergold of that size, I’d pay 160 beastheads! I can send someone to bring the beastheads of gold right now!” Instantly, the nearby people began to make offers. All of them were people of some status in the West Prefecture City, or came from the clans with Xiantian lifeforms in them, or perhaps belonged to the powerful tribes that were located close to the West Prefecture. How excellent their judgement must therefore be!\u003c/p\u003e\n\u003cp\u003eThe man with the black snake hurriedly clutched the piece of thundergold. He clearly felt that the weight of this item was far beyond that of normal yellow gold. He exchanged glances with his two friends, both shocked and overjoyed.\u003c/p\u003e\n\u003cp\u003e“Thank you, young master.”\u003c/p\u003e\n\u003cp\u003e“Thank you, mighty young master.”\u003c/p\u003e\n\u003cp\u003eThe three men instantly thanked him, filled with gratitude.\u003c/p\u003e\n\u003cp\u003e“Now you thank him? The Raindrop Sword is a major figure whose fame is known everywhere. Think about what sort of status his son has. How could he possibly take your weapon by force? Just the tiniest portion of his fortune that he could casually toss out would astonish you,” a fat, fur-clad old man next to them said in a loud voice. Clearly, these words were intentionally said for the not too distant Ning to hear.\u003c/p\u003e\n\u003cp\u003eNing chuckled, and then casually made the sheath with the three swords disappear into his kalestone. Because the space inside the kalestone was limited, thus Ning only carried a few beastheads of gold with him. Everything else he had was all precious treasures.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWithin the hall.\u003c/p\u003e\n\u003cp\u003eJi Yichuan was seated at the master’s seat, while Yuchi Snow sat on his left. The two were slowly eating the food on the table in front of them.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSwoosh\u003c/em\u003e!\u003c/p\u003e\n\u003cp\u003eA human figure rushed in. It was Ning, who had finished his stroll.\u003c/p\u003e\n\u003cp\u003e“Father, mother,” Ning said hurriedly.\u003c/p\u003e\n\u003cp\u003eYichuan frowned. “Why didn’t you pay attention to the time when you were taking a stroll outside?”\u003c/p\u003e\n\u003cp\u003eNing obediently didn’t dare to make a sound, hurriedly running to his usual spot, sitting on his knees and beginning to eat. Their lunch was rather sumptuous, with all sorts of meats, bread, and wine on the table. Ning’s current appetite was simply voracious, and virtually all of the food and beverages on the table were devoured by Ning in a short period of time.\u003c/p\u003e\n\u003cp\u003eSnow laughed as she watched her son tear through the food like a tornado.\u003c/p\u003e\n\u003cp\u003e“Father, mother.” Ning suddenly thought of the sheath and three swords he had purchased today. He hurriedly said, “Today, while taking the walk, I ran into three tribal warriors. They should have come from a distant, impoverished place of the Western Prefecture City. They came for the purpose of selling a precious weapon. And I… decided to buy it.”\u003c/p\u003e\n\u003cp\u003e“Precious weapon?” The seated Yichuan frowned. “In the treasure warehouse of our Ji clan here in the West Prefecture, we have plenty of precious weapons. In the past, didn’t you already select two precious weapons? How can those lowly peddlers in the city possibly have anything good.”\u003c/p\u003e\n\u003cp\u003eBecause Ning had yet to reach the Xiantian level in Ki Refining, he naturally couldn’t control any magic treasures yet, which is why he went to the treasure warehouse to pick out two precious swords. But of course, when training in the cage, he only used ordinary weapons.\u003c/p\u003e\n\u003cp\u003e“Father, the two precious weapons I selected in the warehouse are far inferior to this one I just bought,” Ning said seriously.\u003c/p\u003e\n\u003cp\u003e“Oh?” Yichuan looked at his son.\u003c/p\u003e\n\u003cp\u003e“Actually, the precious weapon I bought is a damaged sword-type magic treasure,” Ning explained. “There are occult runes carved onto it, but they are totally damaged. Therefore, it can only be used as a fairly sharp precious weapon. However, it really is sharp, far more so than the previous precious weapons in my residence. If I use some force, I can pierce through the Goldstar Shirt.”\u003c/p\u003e\n\u003cp\u003e“Pierce through the Goldstar Shirt?” Yichuan revealed a hint of surprise. “Let me take a look.”\u003c/p\u003e\n\u003cp\u003eNing stretched his hand out, and that simple, unadorned sheath and three swords appeared within it. Standing up, he walked it over to his father.\u003c/p\u003e\n\u003cp\u003eYichuan accepted it and took a close look at the sheath, then pulled out the three swords. “The magic runes on the swords are totally destroyed, but it feels as though… this is indeed a flying sword magic treasure! Unfortunately, it’s a damaged magic treasure. Most damaged magic treasures aren’t worth much. At most, they might be sold to be broken down into some other materials.”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eHe had read many books, and knew that damaged magic treasures were not worth much, because the material components of magic treasures had already undergone various fusing techniques, making it so that even if one broke down the magic treasure, one wouldn’t be able to get many of the original components back.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eChi\u003c/em\u003e!” Yichuan stroked the tip of the sword with his finger, and a hint of blood appeared on his fingertip. A look of shock appeared on his face. “What a sharp sword. Without any energy infused into it, the sword is still so incredibly sharp. I’ve never seen such a thing. Snow, come take a look. Can you tell where it comes from?”\u003c/p\u003e\n\u003cp\u003eYuchi Snow accepted it and carefully looked it over, then slowly shook her head after a long time. “I can’t tell.”\u003c/p\u003e\n\u003cp\u003e“Mother, if this magic flying sword treasure wasn’t damaged, would it be a ‘ranked’ treasure?” Ning hurriedly asked.\u003c/p\u003e\n\u003cp\u003e“Of course it would be a ‘ranked’ treasure.” Snow nodded. “Even though it is damaged, the sharpness of this sword is still on par with some ‘unranked’ magic treasures. When it was undamaged… of course it was a ‘ranked’ treasure. Only, exactly what rank it was at, I can’t tell at all. Perhaps no one in the entire area around Swallow Mountain can tell.”\u003c/p\u003e\n\u003cp\u003eNing nodded. He understood this.\u003c/p\u003e\n\u003cp\u003eGenerally speaking, the magic treasures owned by a Xiantian level Ki Refiner was ‘unranked’. Only Zifu Disciples and above would have ‘ranked’ magic treasures. Forging magic treasures… that was even harder. There was nobody in the entire Swallow Mountain area who was known to be able to forge magic treasures. Perhaps only in those distant, incomparably powerful tribes would there be an expert capable of forging magic treasures.\u003c/p\u003e\n\u003cp\u003e“The Grand Xia Dynasty has persisted from the Fiendgod Era until now.” Yichuan returned the sheath and the three swords to his son. “It rules over countless territories, with a history of trillions of years. Who knows how many tribes have risen, fallen, or been exterminated, and how many treasures they have left behind. It isn’t rare to see some magic treasures left over from wars, and our Ji clan has hundreds of damaged magic treasures as well, most of which are of unknown origin. But for this damaged magic treasure to still be so incredibly sharp is quite rare. It is very suited for your use.”\u003c/p\u003e\n\u003cp\u003eSnow then added, “Ning, in the future, when you reach the Xiantian level as a Ki Refiner and infuse your life energy into an ‘unranked’ magic treasure… its power still might be inferior to these swords!”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eMagic treasures could be unfathomably profound.\u003c/p\u003e\n\u003cp\u003eGenerally speaking, when Ki Refiners used magic treasures, they were capable of thousands of bizarre powers. But for Fiendgod Body Refiners… they still specialized in close combat. They had a virtually indestructible body, great strength, speed, and regenerative abilities, which is why even when using magic treasures, Fiendgod Body Refiners would generally use weapons such as swords, daggers, spears, and whatnot.\u003c/p\u003e\n\u003cp\u003e“This sheath and its three swords will still be useful to me, even after I become a Xiantian lifeform.” Ning felt delighted. He pondered, “Since it will most likely be with me for a long time, I need to give it a name… Hrm. I’ll call it the ‘Darknorth sword!’”\u003c/p\u003e\n\u003cp\u003eThere was a reason why Ning had suddenly thought of ‘Darknorth’.\u003c/p\u003e\n\u003cp\u003eIn the past, when his father, Ji Yichuan, had left Swallow Mountain and roamed in the boundless wide world, he had even gone to the north, to the unending ocean. That massive sea was named as the ‘Dark North Sea’. Within the Dark North Sea, there were many islands. Ji Yichuan had floated from one island to another, and that’s where he had met Yuchi Snow.\u003c/p\u003e\n\u003cp\u003eThey became travel companions, and then after experiencing life and death battles, fell in love with each other, then Snow became pregnant.\u003c/p\u003e\n\u003cp\u003eBecause of the pregnancy… they finally left the dangerous Dark North Sea and returned to Swallow Mountain. Mid-journey, however, they had run into a dangerous situation and Yuchi Snow had suffered a serious wound. This is why they had said that ‘Ning suffered an injury in the womb’. At that critical time, the Godbeast, ‘Whitewater Hound’, had carried Snow on his back and fled.\u003c/p\u003e\n\u003cp\u003eThis was why Yichuan often said that Uncle White had once saved Ning.\u003c/p\u003e\n\u003cp\u003eHis parents had met, fell in love, then conceived him in the Dark North Sea.\u003c/p\u003e\n\u003cp\u003eThe phrase, ‘Darknorth’, thus had a special meaning to Ning.\u003c/p\u003e\n\u003cp\u003e“Father. Mother,” Ning said seriously, “I have given a name to this sheath and its three swords. Its name will be the Darknorth swords!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAt the same time Ning acquired the Darknorth swords. In an area within Swallow Mountain known as Serpentwing Lake…\u003c/p\u003e\n\u003cp\u003eSerpentwing Lake was a massive lake, nearly a hundred kilometers long, so large that one wouldn’t be able to see the end of it.\u003c/p\u003e\n\u003cp\u003eAs the saying goes, deep mountains and massive lakes always have monsters within.\u003c/p\u003e\n\u003cp\u003eThese words were not false! This massive, mysterious lake, without question, has Diremonsters within it, and countless numbers of lesser monsters. The name of the Diremonster within this lake was Serpentwing. It was an ancient monster, over a thousand years old, and possessed outlandishly strong power. It was born capable of flight, and it could control both water and poison. It was a very ferocious, awe-inspiring Diremonster.\u003c/p\u003e\n\u003cp\u003eDeep in the center of the lake, there was a small island. This was the lair of Serpentwing.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eBoom\u003c/em\u003e…” A giant black coiled serpent, hundreds of meters long. Its two massive scaled wings were spread so wide, it seemed to encompass the skies. Its scarlet eyes were focused on a group of quivering monstrous beasts. A cold aura surrounded the place, and a layer of frost was on the ground.\u003c/p\u003e\n\u003cp\u003eThe densely clustered lesser monsters were all on their knees or on their faces, all of them quivering.\u003c/p\u003e\n\u003cp\u003eOver a hundred monstrous beasts lay fallen on the ground, their bodies covered with frost. They had been frozen solid.\u003c/p\u003e\n\u003cp\u003e“Boom…” The furious Serpentwing let out an enraged roar.\u003c/p\u003e\n\u003cp\u003eThose lesser monsters consisted of all sorts of serpent, crab, and fish-type monsters. They all growled softly in reply. Clearly, they were all incomparably terrified.\u003c/p\u003e\n\u003cp\u003e“ROAR!” Serpentwing snarled coldly.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHuahuahua\u003c/em\u003e…\u003c/p\u003e\n\u003cp\u003eAll the monsters retreated at high speed, as though relieved of a heavy burden. Many of the monsters left the island and entered the depths of the lake, while a portion of them took up defensive positions in various places around the island.\u003c/p\u003e\n\u003cp\u003e“Shua.” The giant black snake suddenly transformed into mist, and then it reformed into a black-clothed man.\u003c/p\u003e\n\u003cp\u003e“I, Serpentwing, had ninety two sons!” The black-clothed man ground his teeth. “While they grew up, the majority died, and only sixteen survived! And only one of them has the lineage of the Fiendgods… my most beloved son, Redtip!”\u003c/p\u003e\n\u003cp\u003eSnakes were lascivious by nature.\u003c/p\u003e\n\u003cp\u003eAlthough he himself did not have the lineage of the Fiendgods, he had copulated with many Houtian monsters, some of whom included Houtian stage Godbeasts. To an ancient monster who had trained for over a thousand years… it was fairly easy for him to meet and engage with some Houtian level Godbeasts. But Godbeasts rarely got pregnant, and thus only a single one of his children had the lineage of the Fiendgods. That one was Redtip.\u003c/p\u003e\n\u003cp\u003eHis most beloved child. He was certain that so long as Redtip could become a Xiantian lifeform, he would definitely possess enormous power and limitless prospects.\u003c/p\u003e\n\u003cp\u003e“Redtip, I told you long ago not to go out before reaching the Xiantian level. Although humans are delicious, if you eat too many of them, the Ji clan would come and deal with you.” The black-robed man growled, filled with misery.\u003c/p\u003e\n\u003cp\u003eHis pride and his joy, his son Redtip, had snuck out and discovered that the taste of human flesh was far better than that of other monstrous beasts. Human flesh truly was delicious.\u003c/p\u003e\n\u003cp\u003eAnd thus, Redtip had gone behind his father’s back and snuck out time and time again to engage in slaughter.\u003c/p\u003e\n\u003cp\u003e“My child. I have to bring you back.” The black-clothed man instantly transformed back into the enormous winged serpent form. His massive body floated into the air, and then he transformed into a black shadow, streaking across the sky and disappearing into the clouds.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-17\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-1-chapter-18","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
