{"id":49899,"no":202,"title":"Book 8, Chapter 23 - Monsters Executed By The Sword","content":"\u003cp\u003eThe azure-robed maiden stared, astonished, towards the nearby Ji Ning. This Ji Ning actually dared say something like this? These words were too…too dominating!\u003c/p\u003e\n\u003cp\u003eThe distant Wanxiang monsters were startled as well. Instantly, a Wanxiang monster howled in rage, “Human punk, kill us all? Just you?”\u003c/p\u003e\n\u003cp\u003e“You are looking to die!”\u003c/p\u003e\n\u003cp\u003e“A little human punk like you dares to be so arrogant?”\u003c/p\u003e\n\u003cp\u003e“Kill him!”\u003c/p\u003e\n\u003cp\u003eThe Wanxiang monsters were all enraged, but they didn’t dare to act rashly. The nearby Dragonwhale stretched his hand out, and instantly, the other monsters all fell silent.\u003c/p\u003e\n\u003cp\u003eThe Dragonwhale looked weighingly at this human youth. Ning’s calm appearance caused him to be puzzled…what abilities did this human youth have, for him to dare to act so confidently? But just now, the Wanxiang Manifestation had indicated clearly…that this youth was indeed merely a Wanxiang Adept.\u003c/p\u003e\n\u003cp\u003eMany thoughts flashed through the Dragonwhale monster’s mind. In the end, he said in a growling voice, “I’ll give you a final chance to live. Leave, immediately!” Given his fame and prestige, how could he possibly be scared off by a few words from Ning?\u003c/p\u003e\n\u003cp\u003e“Haha…” Ning began to laugh. He looked at the nearby Mu Northson. “Junior apprentice-brother, tell me, are they or aren’t they seeking a path to death for themselves?”\u003c/p\u003e\n\u003cp\u003e“They are, indeed, seeking a path to death for themselves.” Northson laughed as well. He knew exactly what this senior apprentice-brother of his was capable of. His [Soulshaker Art] was comparable to a Primal Daoist\u0027s, and even the majority of those six elite Wanxiang Adepts in Northriver Zhou’s group had died due to it, despite having protective treasures which their seniors had bestowed upon them. If it hadn’t been for those treasures, most likely all of them would have died.\u003c/p\u003e\n\u003cp\u003eThese Wanxiang monsters? At most, Ning would spend a little extra time on them.\u003c/p\u003e\n\u003cp\u003e“Hurry up and depart. Don’t charge straight into the path of death.” Ning’s 729 flying swords hovered about him, forming that jade-white sword of light in front of him. Ning stretched out a finger, gently tapping the jade-white sword. It actually emitted a clear, ringing sound; this jade-white sword of light had actually condensed so much that it was like a real flying sword.\u003c/p\u003e\n\u003cp\u003e“If you don’t leave, I’m going to start a massacre,” Ning said calmly.\u003c/p\u003e\n\u003cp\u003eThe pupils of the distant Dragonwhale monster shrank, but the light from his abyssal, green eyes brightened significantly. His savage aura began to fill the heavens, and he roared out an order: “Use all methods available to you at full strength and kill these two humans.”\u003c/p\u003e\n\u003cp\u003e“We were waiting for these words.”\u003c/p\u003e\n\u003cp\u003e“Big Brother, leave it to us.”\u003c/p\u003e\n\u003cp\u003e“Let’s go!”\u003c/p\u003e\n\u003cp\u003e“Slaughter him.”\u003c/p\u003e\n\u003cp\u003eOne Wanxiang monster after another immediately transformed into their true forms. They were avians, they were hooved beasts, they were aquatic beasts…they had jade eyes, they had three eyes…in short, they were all sorts of strange creatures. After transforming into their true forms, all of them emanated a heaven-filling monstrous aura. And then, with savage howls, they charged towards Ning and Northson.\u003c/p\u003e\n\u003cp\u003eThis sight caused tremendous shock to the azure-robed maiden by Ning’s side. She looked towards the nearby Ning, then sent hurriedly, “Are you just bluffing them, or are you really that capable? Nine years ago, you weren’t even at the Xiantian level. It’s only been nine years…these are all Wanxiang monsters. If you aren’t able to beat them, hurry up and run.”\u003c/p\u003e\n\u003cp\u003e“Little snakey-snake…” Ning pursed his lips into a grin. “You just watch and see.”\u003c/p\u003e\n\u003cp\u003eNing gently flicked at the jade-white sword in front of him. Hearing the clear ringing sound, he beamed. “They are nothing more than birds made of mud and toy mutts made from bricks. Junior apprentice-brother, let’s do it!”\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eThe jade-white sword in front of him immediately transformed into a gleaming Waterflame Millstone. Moving as fast as the wind, it howled forth.\u003c/p\u003e\n\u003cp\u003e“Excellent.” Northson’s hands swept out with two rays of black light which transformed into two giant black snakes in the air, which flew over with a howl as well.\u003c/p\u003e\n\u003cp\u003eA fierce look flashed through Ning’s eyes. The Soulshaker Seal in front of his divine soul, seated within his sea of consciousness, suddenly brightened dramatically. A large amount of divine will surged forth from the Soulshaker Seal. Under Ning’s control, it crushed outwards towards every direction. Savage, turbid waves of divine will roared forth, and everything within its path was struck by the waves of divine will.\u003c/p\u003e\n\u003cp\u003eThe divine will moved at an incredible speed, faster than even the flying swords and constructs. Even before the sword-light had arrived, Ning’s waves of divine will had collided with the souls of those fifteen Wanxiang monsters.\u003c/p\u003e\n\u003cp\u003eBANG!!! The fifteen Wanxiang monsters were all filled with boundless self-confidence and killing intent, but suddenly, the invisible, formless wave of divine will struck them, causing them to feel as though their souls had been viciously smashed down upon by an iron warhammer.\u003c/p\u003e\n\u003cp\u003e“How can this…”\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eEven as terror appeared in their minds, they all became dazed.\u003c/p\u003e\n\u003cp\u003eThe sword-light of the ninth level of the [Lesser Thousand Swords Formation] was incomparably soft and slick. It howled drearily like the wind as it moved forward, first chopping directly through the body of the golden-furred ape. The golden-furred ape didn’t try to resist in the slightest, allowing the sword-light to easily chop through it from head to tail, slicing it in half. And then, still howling forward, it chopped towards the white-furred fox, which was similarly split in half in an instant…\u003c/p\u003e\n\u003cp\u003e“Kill.” On the other side, the two black water-snakes under Northson’s control also savagely attacked their targets. The tail of one serpent viciously lashed out, instantly disintegrating the body of one Wanxiang monster. The tail of the other serpent tightened around the bodies of another monster, crushing it to smithereens.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003eFast!\u003c/p\u003e\n\u003cp\u003eIt was too fast!\u003c/p\u003e\n\u003cp\u003eHow fast was the sword-light? How fast was the flight of the constructs? The Dragonwhale monster in the distance had been watching calmly as Ning and Northson had unleashed their sword-light and constructs, and he had paid them no heed. He believed that the fifteen Wanxiang monsters under his command would definitely be able to resist, and should even have the advantage. “I imagine, these two humans will be killed without needing me to intervene.”\u003c/p\u003e\n\u003cp\u003eJust as this thought flashed past his mind, he saw, to his astonishment, that in the face of Ning’s sword-light and Northson’s constructs, his fifteen Wanxiang monsters didn’t fight back at all, allowing the attacks to strike them.\u003c/p\u003e\n\u003cp\u003eYes, these were monsters. However, it must be understood that if they weren’t using any defenses at all, even Primal Daoists wouldn’t dare to use their bodies to block the sword-light of a Sword Immortal, even if the Sword Immortal was only at the Wanxiang Adept stage.\u003c/p\u003e\n\u003cp\u003e“Swish!” The sword-light danced, and the constructs danced as well. In but the blink of an eye, the sword-light had consecutively executed nine monsters. The other monsters were all finished with a single chop; only the giant, black-shelled turtle had required two chops. The first chop hadn’t been able to crack its shell; the second time, Ning’s sword-light had shot forward like ‘Chef Ding carving the ox’ [1. This is a Chinese idiom about a chef named Ding who was able to carve up an ox effortlessly.]; he carved in through the seams and the slits, thus executing the black-shelled turtle.\u003c/p\u003e\n\u003cp\u003eAs for the other six monsters, they were crushed into mincemeat by Northson’s constructs. In but the blink of an eye, the fifteen monsters had all been killed!\u003c/p\u003e\n\u003cp\u003e“No!” The white-furred fox, after being chopped into two pieces, actually reformed, then frantically retreated in terror.\u003c/p\u003e\n\u003cp\u003e“A Fiendgod Body Refiner?” Ning laughed softly. “You won’t be able to escape.” The rolling waves of divine will once more struck the white-furred fox, and the fleeing fox was once more stunned. The sword-light once more flashed towards it through the air in an incomparably graceful manner, easily chopping her apart. At the same time, a beautiful Waterflame Lotus bloomed next to her, completely surrounding her within. Soon, it ground the flesh and blood of the white-furred fox into dust. Soon, the divine power within the flesh and the blood was used up, and the fox became deader-than-dead.\u003c/p\u003e\n\u003cp\u003eThe fifteen Wanxiang monsters were now all dead!\u003c/p\u003e\n\u003cp\u003e“Killing Wanxiang monsters really is much easier than killing Wanxiang Adepts,” Ning murmured to himself. “Not a single one of them had any protective treasures bestowed by seniors.”\u003c/p\u003e\n\u003cp\u003eComplete silence!\u003c/p\u003e\n\u003cp\u003eThe entire wilderness had fallen silent. Ning and Northson smiled in a relaxed fashion, but the nearby azure-robed maiden was completely stupefied. “Fifteen Wanxiang monsters, all of them extremely powerful and at the middle, late, or even peak Wanxiang level. Why is it that when faced with this kid of the Ji clan, none of them resisted at all, resulting in them instantly being killed?”\u003c/p\u003e\n\u003cp\u003eBecause Ning’s divine will had bypassed her, she didn’t realize that Ning had used it to attack at all.\u003c/p\u003e\n\u003cp\u003e“It’s only been nine years.” The azure-robed maiden looked towards Ning, somewhat dazed. “I’m an Azure Skysnake. I’ve gone to many places and have encountered repeated strokes of good fortune, and have even apprentice myself to a monster Immortal. Only thus did I reach the Wanxiang level. How is it that this kid of the Ji clan…was able to kill Wanxiang monsters as easily as killing a chicken? How could he have become even more powerful than me?”\u003c/p\u003e\n\u003cp\u003eWhen the two had battled at Eastmount Marsh countless times, their power had always been roughly equal. The Azure Skysnake had felt quite confident that her power had risen very quickly, but now, it seemed….\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe distant Dragonwhale monster was both stunned and incomparably enraged. Immediately afterward, however, he calmed down. He stared at the distant Ning and Northson, then said in a low voice, “No wonder you are so confident. You actually have a divine will technique. And you have such a powerful divine soul; when using the divine will technique, you were actually able to affect fifteen Wanxiang monsters with it.”\u003c/p\u003e\n\u003cp\u003eNing laughed. Even before joining the Black-White College, his soul had already reached the ‘divine sense’ level. Now that more than three years had passed, he had increased his comprehension of the Dao, his sword-heart had been honed, and he had spent every day of the past three years visualizing the [Nuwa Painting], and enjoying the soul-improving benefits it brought…by now, Ning’s soul would be considered powerful even amongst Primal Daoists. Affecting fifteen Wanxiang monsters at the same time was nothing.\u003c/p\u003e\n\u003cp\u003eThe pressure these fifteen Wanxiang monsters had given him was even less than the pressure those six Wanxiang Adepts of Northriver Zhou’s group had brought! However, this Dragonwhale monster…\u003c/p\u003e\n\u003cp\u003eNing felt confident in his ability to handle it, and also completely confident in his ability to flee. However, Ning didn’t feel completely confident in being able to actually defeat or kill it. After all, the opponent was extraordinarily talented, and a Fiendgod Body Refiner with a divine ability. To kill it would definitely be incomparably difficult.\u003c/p\u003e\n\u003cp\u003e“Hurry up and depart. I’ll spare your life.” Ning stared towards the Dragonwhale monster and spoke in a cold voice.\u003c/p\u003e\n\u003cp\u003eA cold light flashed through the eyes of the Dragonwhale. After having consecutively killed fifteen monsters in such an awe-inspiring manner, Ning’s words did indeed have a rather frightening effect.\u003c/p\u003e\n\u003cp\u003e“Do you think you can scare me off by killing those monsters?” The Dragonwhale said hoarsely, “I was born in the Darknorth Sea and have wandered many places. I then entered this region, then arrived in the wild marshes of the Gaol Mountains…I’ve already dominated this region for ten thousand years, and I’ve even battled Primal Daoists on several occasions. You, a puny Wanxiang Adept, want to scare me away? You are dreaming!”\u003c/p\u003e\n\u003cp\u003eNing stared into the distance. “Then let’s stop wasting words. Accept your death.”\u003c/p\u003e\n\u003cp\u003e“Accept death?” The Dragonwhale monster began to roar with wild laughter. His laughter was like the thunder, echoing out to a distance of a hundred kilometers.\u003c/p\u003e\n\u003cp\u003eBOOM! Suddenly, he disappeared, his body dissolving into mist, then reforming in midair to become an incomparably massive, bizarre beast. This bizarre beast had the head of a dragon, but the body of a whale. The dragon’s whiskers were more than three hundred meters long, and the length of the body of the entire Dragonwhale was more than three thousand meters. And then, the green light emanating from its body suddenly increased dramatically in brightness, and its body actually began to slowly increase to a size of ten thousand meters.\u003c/p\u003e\n\u003cp\u003eThis massive, ten thousand meter long Dragonwhale hovered there in the air, completely covering the skies and casting the land below it into darkness. The vast, endless savage aura from it filled every part of the area, causing one’s heart to shudder.\u003c/p\u003e\n\u003cp\u003eNing, Northson, and the azure-robed woman all raised their heads, staring towards it.\u003c/p\u003e\n\u003cp\u003e“Wow, that’s big.” Northson stared.\u003c/p\u003e\n\u003cp\u003e“Kid of the Ji clan, are you really…able to handle it?” The azure-robed woman’s face turned even whiter than before.\u003c/p\u003e\n\u003cp\u003eNing stared into the distance. “Little snakey-snake…”\u003c/p\u003e\n\u003cp\u003e“You just watch and see!”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-8-chapter-22\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-8-chapter-24\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-8-chapter-23","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
