{"id":49718,"no":21,"title":"Book 2, Chapter 3 - Life and Death","content":"\u003cp\u003eWithin his courtyard, Yichuan was currently wielding a blue longsword, chopping and piercing against a tree trunk. Chop, pierce, scrape, slice…he only used these most basic of movements and didn’t even use much force, and so the tree trunk only had some scratches appear on its surface.\u003c/p\u003e\n\u003cp\u003eHis wife, Snow, held a bottle of water nearby, watching her man train with a smile on her face, occasionally sprinkling some water on the nearby flowers and grass.\u003c/p\u003e\n\u003cp\u003e“Hrm?” Yichuan and Snow simultaneously turned to look in the same direction. Both of them sensed a vibration of energy.\u003c/p\u003e\n\u003cp\u003e“Dragon Castle.”\u003c/p\u003e\n\u003cp\u003eYichuan and Snow simultaneously leaped onto the rooftop of the building, staring at the distant Dragon Castle.\u003c/p\u003e\n\u003cp\u003eDragon Castle was built in a fairly out-of-the-way location in the inner city, at least two kilometers or so away from where Yichuan and his wife lived.\u003c/p\u003e\n\u003cp\u003eThey saw…\u003c/p\u003e\n\u003cp\u003eIn the air above Dragon Castle was the enormous Serpentwing. Serpentwing’s scaled wings were currently covering the entirety of Dragon Castle, and a bloodstained youth with only one arm was scurrying out of Dragon Castle at high speed, while an enormous draconic tail flashed towards him like lightning.\u003c/p\u003e\n\u003cp\u003eSnow’s eyes instantly turned red. She let out an agonized howl. “Ning!”\u003c/p\u003e\n\u003cp\u003eBut the distance was too far.\u003c/p\u003e\n\u003cp\u003eThere was no time at all!\u003c/p\u003e\n\u003cp\u003e“Vermin!” Yichuan exploded with anger, letting out a sudden, ferocious chop with the blue sword in his hands. Hua! A brilliant wave of blue light flew out from his sword. The three hundred meter long wave of blue light was even slightly larger than Serpentwing itself! It slashed through the air, chopping directly towards Serpentwing.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePengpengpeng\u003c/em\u003e!\u003c/p\u003e\n\u003cp\u003eThe distant tail of Serpentwing, in the blink of an eye, was struck dozens of times. The entire Dragon Castle exploded and collapsed, sending large amounts of rocks flying everywhere. Many of the servants, guards, and members of the Ji clan who lived around Dragon Castle were injured or wounded, and their blood splashed everywhere. Even some of the monstrous beasts inside the beast tunnels were killed by the impact.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003eJust as Ning scurried out of the cage, he was attacked by the massive tail of the serpent.\u003c/p\u003e\n\u003cp\u003eNing knew that in front of this Winged Snake monstrosity, the Goldstar Shirt of his might as well have been paper. All he had was a peak Houtian level Fiendgod body….he probably would be smashed into a pile of pulverized flesh in an instant.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eNing simply couldn’t accept this. In this life, he had such a healthy, strong body, had a pair of doting parents, and had the chance to train to become an Immortal, to control his own destiny. He had trained for so long…and everything was just starting. He truly couldn’t accept this!\u003c/p\u003e\n\u003cp\u003e“Dodge!” Ning used the [Shadewind Steps] with all his might.\u003c/p\u003e\n\u003cp\u003eQuick, quicker, quicker!\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eHu\u003c/em\u003e!”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e“Hu!”\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe wind was howling!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHu\u003c/em\u003e! Ning’s body was howling as well!\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eBang\u003c/em\u003e!” The serpent’s tail came smashing down. It scraped past Ning, then smashed against the thick marble rocks of Dragon Castle. Instantly, the entire Dragon Castle had shuddered and large amounts of marble rock had shattered and been sent flying everywhere.\u003c/p\u003e\n\u003cp\u003e“You managed to dodge?” The red-eyed Serpentwing howled, “You were lucky enough to dodge once, but do you think you’ll dodge twice?”\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe serpent tail swung down at him again!\u003c/p\u003e\n\u003cp\u003eBut Ning was like a piece of paper, fluttering about in the breeze, as agile as the wind, as unpredictable as a shadow. The serpent tail once again missed Ning, smashing against Dragon Castle once more.\u003c/p\u003e\n\u003cp\u003e“Impossible!” Serpentwing was now truly enraged.\u003c/p\u003e\n\u003cp\u003eIt was a Diremonster who had trained for thousands of years and had reached the late-stage Xiantian level. It was many times more powerful than those ordinary early-stage Xiantian Diremonsters. For someone of its power, killing a youth should be simplicity itself, much like how it has easily slaughtered those thousands of tribesmen in the Goldblade Tribe.\u003c/p\u003e\n\u003cp\u003ePengpengpeng! Serpentwing wildly struck everywhere with its tail, and its wings struck out as well. The entire Dragon Castle was shuddering and on the verge of collapse, and large amounts of stones were flying everywhere. Many servants and black armored riders lost their lives…\u003c/p\u003e\n\u003cp\u003e“Diediedie!” Serpentwing was frantic.\u003c/p\u003e\n\u003cp\u003eA wild cold aura emanated from him, and the temperature dropped, causing some servants to immediately freeze to death.\u003c/p\u003e\n\u003cp\u003eThe black poisonous mist came out, and the surrounding Houtian level lifeforms all were poisoned to death.\u003c/p\u003e\n\u003cp\u003eBut Ning continued to dodge time and time again in that massive cloud of dust.\u003c/p\u003e\n\u003cp\u003eThe cold aura could freeze to death those peak Houtian Ki Refining warriors, but Ning, who trained in the Fiendgod Body Refining technique, his body was more than a hundred times stronger than those Houtian Ki Refiners. These large-scale cold air and poison gas attacks couldn’t harm him at all.\u003c/p\u003e\n\u003cp\u003e“Like the wind. Like the shadows.”\u003c/p\u003e\n\u003cp\u003e“Shadewind Steps.”\u003c/p\u003e\n\u003cp\u003e“This is the Shadewind Steps. The true Shadewind Steps.” Ning totally immersed himself in it, allowing those strikes from the enormous Serpentwing to come as they will, allowing the scaled wings to slash at him as they pleased. He simply followed the natural force of the wind and borrowed it, and also the force of the wind created by his opponent, Serpentwing, to dodge agilely time and time again.\u003c/p\u003e\n\u003cp\u003eHe moved like a shadow. Serpentwing couldn’t hit him, no matter how he tried.\u003c/p\u003e\n\u003cp\u003eHe moved like the wind. Ning’s body flickered everywhere with such gentle ease, as though he were a leaf that was being blown by the gentle wind.\u003c/p\u003e\n\u003cp\u003e“One with the world!”\u003c/p\u003e\n\u003cp\u003e“This youngster has actually reached the level of ‘one with the world’? His footwork is at the ‘one with the world’ level?” The vicious, otherworldly ancient monster, Serpentwing, was finally certain that this human youth who had killed his son had actually reached the level of ‘one with the world’. This was a level which this old monster hadn’t reached yet, despite having trained for thousands of years.”\u003c/p\u003e\n\u003cp\u003eOne with the world!\u003c/p\u003e\n\u003cp\u003eGenerally speaking, only Zifu Disciples were at the ‘one with the world’ level, while some powerful Xiantian lifeforms would also reach the ‘one with the world’ level.\u003c/p\u003e\n\u003cp\u003eHumans naturally had a greater potential for insight than monsters!\u003c/p\u003e\n\u003cp\u003eOnly the likes of Godbeasts were on par with humans in terms of understanding.\u003c/p\u003e\n\u003cp\u003e“Damnable.” The ancient monster, Serpentwing, knew that in a short period of time, he wouldn’t be able to kill this human youth.\u003c/p\u003e\n\u003cp\u003e“Vermin!”\u003c/p\u003e\n\u003cp\u003eAn enormous blue sword light attacked.\u003c/p\u003e\n\u003cp\u003eThe ancient monster, Serpentwing, swung his tail towards that blue sword light, not caring about it at all. “Yichuan, do you think that your sword light can harm me from a distance of two kilometers?”\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eDark green blood splattered everywhere, and wherever the blood splattered, the ground hissed and bubbled. The marble and the blackwater iron all quickly dissolved. That enormous, thick tail had been cut so deeply, it was nearly severed in half.\u003c/p\u003e\n\u003cp\u003e“How could it be this powerful?” Serpentwing was truly frightened.\u003c/p\u003e\n\u003cp\u003eThe number one expert of the Ji clan’s West Prefecture truly was too terrifying.\u003c/p\u003e\n\u003cp\u003e“Hu!”\u003c/p\u003e\n\u003cp\u003e“I’ll let you live for now!” Serpentwing tossed Ning a furious glare, and then with a beat of its two wings, flew into the sky at high speed.\u003c/p\u003e\n\u003cp\u003e“Vermin!”\u003c/p\u003e\n\u003cp\u003e“Serpentwing, you dare to barge into the Ji clan’s West Prefecture, and you think you can flee?”\u003c/p\u003e\n\u003cp\u003e“Die!”\u003c/p\u003e\n\u003cp\u003eFrom multiple areas in the inner city, there erupted furious roars, including those of Ji Lee and Ji Young, as well as dozens of Xiantian lifeforms, all of whom shouted at him.\u003c/p\u003e\n\u003cp\u003e“Loan me your Azure Firebird.” Yichuan transformed into a ray of light, flying onto a giant blue bird that was in mid-flight, which had a blue fire blazing on its tail. On the back of this blue bird, there was a woman dressed in black.\u003c/p\u003e\n\u003cp\u003e“Yichuan, I’ll come with you.” The black-clothed woman said in her hoarse voice.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eYichuan swept the area below with his gaze. Seeing his son standing within the rubble of Dragon Castle, he couldn’t help but let out a sigh of relief…but seeing the bloodstained severed arm of his son, he felt his fury blaze up once more.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eHu\u003c/em\u003e!”\u003c/p\u003e\n\u003cp\u003eYichuan and the black-clothed woman, riding the Azure Firebird, tore through the air, pursuing in the direction of the fleeing Serpentwing. As for the other Xiantian level people in the West Prefecture, all of them were roaring with fury. A Diremonster had dared to barge into the inner city of the Ji clan’s West Prefecture City? This was totally against all reason!\u003c/p\u003e\n\u003cp\u003eBut humans at the Xiantian level were not capable of flight yet, and so they could only watch as Yichuan and his companion flew on the back of the Azure Firebird in pursuit of Serpentwing.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003eNing remained within that state of being ‘one with the world’. He could sense the strength of the wind, and he could borrow that strength to become as carefree as the wind itself. He could even borrow the attacking strength of the enemy to dodge the enemy’s attacks, as though he were the enemy’s shadow.\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eA feeble moan caused Ning to look around him. The entire Dragon Castle had been reduced to rubble. A large number of servants and black armored riders had died gruesome deaths, either smashed, frozen, or poisoned to death. The sight was unbearable to see.\u003c/p\u003e\n\u003cp\u003eThe joy he felt at having the ‘one with the world’ level of the [Shadewind Steps] faded away.\u003c/p\u003e\n\u003cp\u003eNing ground his teeth. With a leap, he entered the field of rubble. He began kicking aside pieces of rock, and quickly found his severed left arm, then re-absorbed the Darknorth sword his left arm was clutching back into his kalestone. And then, Ning grabbed his severed left arm with his right arm, pressing it against the stump. By now, the severed stump was no longer bleeding any more.\u003c/p\u003e\n\u003cp\u003e“Connect.” Ning connected the severed arm to the stump, and then extended the Goldstar Shirt to quickly encapsulate his left arm as well, putting it back into position.\u003c/p\u003e\n\u003cp\u003eEven in his previous life, a severed hand or arm that had only been severed recently could be reattached.\u003c/p\u003e\n\u003cp\u003eNing currently had the body of a Fiendgod. A severed arm only needed a few hours to be regrown, much less a severed arm that was being reattached…Ning could clearly sense his muscles and flesh rapidly grow back, and his bones were quickly reaching out and connecting as well. His arm had already been reattached, but he would still need a little bit longer before reaching his perfect state.\u003c/p\u003e\n\u003cp\u003e“Ning!” A somewhat frantic sound rang out.\u003c/p\u003e\n\u003cp\u003eNing raised his head up. He saw an old man who wore a dark red beast fur pelt standing in the rubble looking down at him. This man was the Prefecture Lord, Ji Young. Prefecture Lord Young saw that Ning was unharmed, and only then let out a sigh of relief. “As long as you aren’t hurt. As long as you aren’t hurt.”\u003c/p\u003e\n\u003cp\u003e“Ning.” An agonized shout.\u003c/p\u003e\n\u003cp\u003eNing didn’t have the chance to speak with the Prefecture Lord. He hurriedly made his way out from the debris field, and saw from far away his mother running towards him, her face covered with bitter tears.\u003c/p\u003e\n\u003cp\u003e“Mother.” Ning called out repeatedly.\u003c/p\u003e\n\u003cp\u003eSeeing her son standing there, Snow instantly began to shed tears of joy. Ning quickly ran towards his mother at high speed, then hugged her. Snow hugged her son back. “Wonderful, wonderful. I was so frightened just now. If anything had happened to you, I really don’t know what I would’ve done.”\u003c/p\u003e\n\u003cp\u003e“Mother, I’m fine.” Ning said repeatedly.\u003c/p\u003e\n\u003cp\u003e“Your arm?” Snow looked carefully at her son’s left arm.\u003c/p\u003e\n\u003cp\u003e“It’s fine. Look.” Ning waved his left arm around. The bones and flesh of his left arm had been totally connected by now, and even the cells had been 80% regenerated. Most likely, in just a little bit longer, he would be in perfect condition.\u003c/p\u003e\n\u003cp\u003eOnly now did Snow completely relax. She knew how powerful her son’s recuperative ability was, as a Fiendgod Body Refiner.\u003c/p\u003e\n\u003cp\u003e“What happened? How could this Diremonster, Serpentwing, dare to have the temerity to attack our Ji clan’s Western Manor?” A heroic voice rang out, and the red-haired viper elder, Ji Lee, came running over, his face filled with fury. “This vermin is asking to be killed. Also, we need to immediately investigate why it charged and attacked our Ji clan’s Western Prefecture City.”\u003c/p\u003e\n\u003cp\u003e“It is indeed strange. Doesn’t Serpentwing know that by acting in such a way, it has fully infuriated the Ji clan of the Western Prefecture?” A skinny old man with a scar over his forehead said coldly.\u003c/p\u003e\n\u003cp\u003eOne Xiantian individual after another walked over.\u003c/p\u003e\n\u003cp\u003eSeeing the destroyed Dragon Castle and the large number of corpses and bloodstains, the dozens of Xiantian individuals had very ugly looks on their faces. As the administrators of this large expanse of land, it had been a long time since a Diremonster had dared to attack the West Prefecture. Every single expert of the Ji clan of the Western Prefecture felt both fury and shame.\u003c/p\u003e\n\u003cp\u003e“It must die!”\u003c/p\u003e\n\u003cp\u003e“We absolutely must kill that Diremonster, Serpentwing.”\u003c/p\u003e\n\u003cp\u003e“Kill it!”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-2-chapter-3","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
