{"id":49720,"no":23,"title":"Book 2, Chapter 5 - The Father of Spring Grass","content":"\u003cp\u003eThe time passed, day after day.\u003c/p\u003e\n\u003cp\u003eThe days slowly grew colder, but his father still had not returned. The Ji clan of West Prefecture had long since sent a squad of black armored riders to surround Serpentwing Lake.\u003c/p\u003e\n\u003cp\u003eWithin the training yard.\u003c/p\u003e\n\u003cp\u003eOne sword attack after another howled and flashed through the air. Ning stood there by himself, training in the [Raindrop Sutra]. At this point, neither black armored riders nor powerful monstrous beasts…were of any use to Ning in terms of improving his swordplay. But his father, Yichuan, had yet to return. Thus, Ning could only train by himself.\u003c/p\u003e\n\u003cp\u003e“Young master.” Autumn Leaf called out softly.\u003c/p\u003e\n\u003cp\u003e“Hrm?” Ning looked at Autumn Leaf, who had a nervous, uncertain look on her face.\u003c/p\u003e\n\u003cp\u003eFrowning, Ning sheathed his Darknorth swords. “Autumn Leaf, what is it?”\u003c/p\u003e\n\u003cp\u003e“Young master…” Autumn Leaf said in a low voice. “Spring Grass’s father requests to see you, young master.”\u003c/p\u003e\n\u003cp\u003e“Who?” Ning was stunned.\u003c/p\u003e\n\u003cp\u003e“Spring Grass’s father.” Autumn Leaf’s voice grew slightly louder. “Her biological father!”\u003c/p\u003e\n\u003cp\u003eNing was shocked. “Spring Grass has a father?”\u003c/p\u003e\n\u003cp\u003eHis two personal maids had been slaves their entire lives. When they were very young, they were sold to the Ji clan’s West Prefecture.\u003c/p\u003e\n\u003cp\u003e“Where is Spring Grass?” Ning asked.\u003c/p\u003e\n\u003cp\u003e“Spring Grass didn’t dare to come see you, young master.” Autumn Leaf said in a low voice. “I could tell that actually, Spring Grass would rather like to see her father, but her status…makes her afraid to say it.”\u003c/p\u003e\n\u003cp\u003eNing suddenly remembered something.\u003c/p\u003e\n\u003cp\u003eRight. Strictly speaking, Spring Grass and Autumn Leaf were his maidservants, and their lives were under his control. From the day they were sold as slaves, they no longer had any contact with their parents. However, people were not like trees or grass; they had feelings.\u003c/p\u003e\n\u003cp\u003e“Go and bring Spring Grass’ father here.” Ning chuckled. “Since he wants to meet me, then let him meet me.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Autumn Leaf’s face was covered with joy and she immediately ran out.\u003c/p\u003e\n\u003cp\u003eNing called towards the outside of the yard, “Spring Grass, come in.” Outside the courtyard, a fur-clad female servant was standing there uncertainly. Hearing the young master’s shout, she had to walk inside. But her face was filled with nervousness and uncertainty…right now, Spring Grass felt many complicated emotions. She was excited, happy, nervous, embarrassed, guilty, and restless.\u003c/p\u003e\n\u003cp\u003e“Young master.” Spring Grass looked at Ning.\u003c/p\u003e\n\u003cp\u003e“Your father is here. If you want to meet him, you can.” Ning laughed.\u003c/p\u003e\n\u003cp\u003e“But…but I was bought by the Ji clan.” Spring Grass bit her lips.\u003c/p\u003e\n\u003cp\u003e“Hrm?” Ning frowned slightly. “Do my words no longer carry weight around here?”\u003c/p\u003e\n\u003cp\u003e“Understood, young master.” Spring Grass glanced at Ning, her heart filled with gratitude. Actually, she had long ago sensed that this most brilliant talent of the Ji clan of the West Prefecture, the youngster who would one day become Prefecture Lord, didn’t treat her and Autumn Leaf like most masters treated their servants.\u003c/p\u003e\n\u003cp\u003e“He’s here.” Ning looked outside, and immediately saw two figures walking into the courtyard. The one in front was Autumn Leaf, while the one behind was a tall, middle-aged man wearing black beast fur. This middle-aged man had some scars on his face, and his head was lowered, seeming rather nervous.\u003c/p\u003e\n\u003cp\u003e“Young master, he’s here.” Autumn Leaf said respectfully.\u003c/p\u003e\n\u003cp\u003eThe scarred man hurriedly knelt down, pressing his head against the ground and also his two hands down on the ground in prostration. Extremely respectful, he said, “Blacktooth pays his respects to the mighty young master.”\u003c/p\u003e\n\u003cp\u003eSeeing this, Spring Grass’ eyes couldn’t help but turn red.\u003c/p\u003e\n\u003cp\u003eNing glanced at Spring Grass, then said, “Please rise.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Only now did the scarred man rise, and as he did, he saw Spring Grass standing by Ning’s side. Father and daughter’s gazes met, and instantly, tears began to flow down both their faces.\u003c/p\u003e\n\u003cp\u003eThe scarred man quickly recovered, hurriedly wiping his tears away.\u003c/p\u003e\n\u003cp\u003e“Why have you come here to my place?” Ning asked.\u003c/p\u003e\n\u003cp\u003eThe scarred man took a deep breath. “Blacktooth has come to your place, young master, because I wish to request that young master redeem my child, ‘Miwa’, back to me.”\u003c/p\u003e\n\u003cp\u003e“Redeem?” Ning was surprised.\u003c/p\u003e\n\u003cp\u003eRedeem?\u003c/p\u003e\n\u003cp\u003eIn the years since he had arrived in this world, he didn’t have many people whom he had close relationships with, but Spring Grass and Autumn Leaf, in Ning’s heart, were like big sisters to him.\u003c/p\u003e\n\u003cp\u003e“Father.” Spring Grass couldn’t help but shout out. It was generally possible to redeem an ordinary slave by paying a certain price, but what sort of status did young master Ji have? How could her father possibly redeem her? If the young master was angered, her father might immediately lose his life.\u003c/p\u003e\n\u003cp\u003eAt the same time, she fell to her knees with a thudding sound. “Young master, my father doesn’t understand anything. I beg you, young master, to pardon my father for his disrespect.”\u003c/p\u003e\n\u003cp\u003e“Let him speak.” Ning looked at the scarred man. “If you have anything to say, say it. If you can convince me, I’ll agree. If you can’t…hmph.”\u003c/p\u003e\n\u003cp\u003eThe scarred man’s heart shook.\u003c/p\u003e\n\u003cp\u003eHe understood exactly how much power and authority this young man in front of him had. If this young man wanted his life, it would be simplicity itself to take it. But since he had chosen to come…he had made mental preparations!\u003c/p\u003e\n\u003cp\u003e“Mighty young master.” The scarred man said respectfully, “Blacktooth will tell you everything in my heart.”\u003c/p\u003e\n\u003cp\u003eNing only looked at him.\u003c/p\u003e\n\u003cp\u003e“I, Blacktooth, was once the son of a tribal chief.” The scarred man said slowly. “Within a mountain forest, the Blacktooth Tribe lived a peaceful life. We raised animals inside, and I led the mighty warriors of the tribe to pursue and kill monstrous beasts across the nearby land…and one day, we discovered in a secluded valley a large amount of naturally grown millet rice.”\u003c/p\u003e\n\u003cp\u003e“The entire tribe was extremely excited and overjoyed with this discovery. With this supply of millet, the lives of our tribe would be much improved, and we would be able to have more tribesmen. However, this news was quickly discovered by another powerful tribe, the Blood Mosquito Tribe. One morning at dawn, when the sky was just beginning to brighten and many tribesmen were still asleep…” The scarred man’s eyes revealed a hint of bitterness and pain. “They ambushed our clan, slaughtering many of my tribesmen. Our power was far inferior to the Blood Mosquito Tribe to begin with, and we were ambushed. The few of us who were lucky enough to survive had to flee.”\u003c/p\u003e\n\u003cp\u003e“I fled with Miwa, encountering countless perils and dangers on the way before finally fleeing to the West Prefecture City.” The scarred man’s body was trembling slightly. “But my dearly beloved daughter and my tribal brothers had all died. I had to seek revenge, even if I died doing so. But Miwa was innocent and blameless. I hoped she would continue to live…so I sold her to the Ji clan. In the Ji clan, she would at least have a stable life.”\u003c/p\u003e\n\u003cp\u003eSpring Grass was shaking as well, her tears pouring down. “Father, Father…”\u003c/p\u003e\n\u003cp\u003eShe could never forget…\u003c/p\u003e\n\u003cp\u003eForget those days of flight. Although she was still young, she would never forget the sight of her loved ones all dying, one after the other, and all her friends of the same age dying as well. Never forget her father desperately fighting to survive one terrible danger after another as they battled their way to the West Prefecture City. At that time, her father had only told her, “Miwa, Father needs to go do what must be done. Miwa, you need to continue to live a good life.”\u003c/p\u003e\n\u003cp\u003e“Father, don’t leave Miwa, Father, Father!” The young Spring Grass had cried bitterly.\u003c/p\u003e\n\u003cp\u003eThe still-young Blacktooth had ground his teeth and then left.\u003c/p\u003e\n\u003cp\u003eHe had embarked on the road to revenge!\u003c/p\u003e\n\u003cp\u003e“I hated…” The scarred man’s body was shaking. “I wanted to get revenge. Although I was a Ninefang Warrior, to the Blood Mosquito Tribe, I was nothing at all. After I killed four of my enemies, a red-furred Diremonster suddenly ambushed the Blood Mosquito Tribe. That bastard who had led the squad to destroy my homeland was devoured by that Diremonster in one gulp, and the Blood Mosquito Tribe was destroyed. The few lucky survivors of the Blood Mosquito Tribe all joined other tribes.”\u003c/p\u003e\n\u003cp\u003e“I had no enemies left.”\u003c/p\u003e\n\u003cp\u003e“I, who had nothing at all, did not have any way to redeem Miwa, so I became a travelling merchant.” The scarred man said. “After one life-and-death experience after another, I managed to find some of the scattered survivors of my tribe, and my merchant caravan became more and more powerful. I gained wealth, and thus alongside the scattered survivors, I founded a tribe…my own Blacktooth Tribe! And I, I became the new ‘Blacktooth’.”\u003c/p\u003e\n\u003cp\u003e“While becoming a travelling merchant,” the scarred man looked at Ning, “I had the chance to chat with a servant of the Ji clan, and learned that Miwa had become the maidservant of you, young master Ji.”\u003c/p\u003e\n\u003cp\u003e“After re-establishing the Blacktooth Tribe, I had done all that I had to do. I had done right by my father, and by the past generations of Blacktooths.” The scarred man looked at Ning. “Therefore, I have come. I have come to see my child, Miwa, whom I have seen in my dreams for these ten years. Even if I had to die, I would see Miwa.”\u003c/p\u003e\n\u003cp\u003e“My Miwa, my child…I want to be with her. She is the last kin who Blacktooth has.” The scarred man’s face was covered in tears.\u003c/p\u003e\n\u003cp\u003eSpring Grass’s face had been covered in tears long ago, and she was bawling loudly.\u003c/p\u003e\n\u003cp\u003e“Father.” Spring Grass ran over, embracing her agonized father.\u003c/p\u003e\n\u003cp\u003e“Miwa.” The scarred man held his daughter as well. He had been waiting for this day for so long.\u003c/p\u003e\n\u003cp\u003eAutumn Leaf, standing to one side, couldn’t help but cry as well.\u003c/p\u003e\n\u003cp\u003eAs for Ning, he sighed as he listened.\u003c/p\u003e\n\u003cp\u003eThe tribesmen had to fight against the heavens, the earth, and the monsters. Spring Grass’ father, ‘Blacktooth’, was the epitome of this.\u003c/p\u003e\n\u003cp\u003e“Spring Grass.” Ning spoke out. “Do you wish to be together with your father?”\u003c/p\u003e\n\u003cp\u003eSpring Grass bit her lips, unable to control the tears in her eyes. She fell to her knees. “Young master, please forgive Spring Grass! I truly do wish to be with my father, I truly do!”\u003c/p\u003e\n\u003cp\u003e“Mighty young master.” The scarred man immediately fell to his knees as well.\u003c/p\u003e\n\u003cp\u003eNing looked at the two of them, father and daughter. The long time they had spent together had resulted in him loving Spring Grass and Autumn Leaf like a younger brother loving a pair of older sisters. He didn’t want Spring Grass to leave him, but he wanted Spring Grass to be mentally anguished even less. “Spring Grass, from today onwards, your liberty is restored to you. You can go with your father.”\u003c/p\u003e\n\u003cp\u003e“Ah!” Spring Grass and Blacktooth were both stunned.\u003c/p\u003e\n\u003cp\u003eJust like that, he had agreed?\u003c/p\u003e\n\u003cp\u003eThe two of them, father and daughter, could be together again?\u003c/p\u003e\n\u003cp\u003e“Thank you, mighty young master. Blacktooth will forever remember your great benevolence, young master.” Blacktooth, on his knees, thanked him again and again.\u003c/p\u003e\n\u003cp\u003e….\u003c/p\u003e\n\u003cp\u003eUnder Ning’s instructions, Spring Grass had her liberty restored to her. As she left alongside her father, Spring Grass had called out to him, “Young master, Spring Grass will forever remember your kindness. Spring Grass will constantly pray for you to be blessed, young master, within the Blacktooth tribe. If in the future, young master, you ever pass by the Blacktooth Tribe, I hope you will be able to come pay a visit to Spring Grass.”\u003c/p\u003e\n\u003cp\u003e“Definitely.” Ning agreed.\u003c/p\u003e\n\u003cp\u003e“We definitely will go.” Autumn Leaf was crying as well. She and Spring Grass truly were like sisters.\u003c/p\u003e\n\u003cp\u003e-------------\u003c/p\u003e\n\u003cp\u003eThe days continued to grow colder.\u003c/p\u003e\n\u003cp\u003eNing’s mentality was changing as well.\u003c/p\u003e\n\u003cp\u003eSpring Grass’ departure, her father’s experiences, Serpentwing’s attack, his father’s departure to kill the Diremonster, his inability to find an opponent to train his swordplay with within the Ji clan…all of these events caused Ning’s mentality to change.\u003c/p\u003e\n\u003cp\u003eHe had the feeling that perhaps the West Prefecture City was too small of a place.\u003c/p\u003e\n\u003cp\u003eHe wanted to go outside, wanted to see the wider world! He wanted to see how the tribes like the Blacktooth Tribe lived, and what their lives were like! He wanted to be like his father and go fight one Diremonster after another…he wanted to go adventure in this area of the world…\u003c/p\u003e\n\u003cp\u003e“Ning, your father is back.” On this snowy day, Snow called out to her son.\u003c/p\u003e\n\u003cp\u003eOnly now did Ning see that in the skies above, his father was returning, half-kneeling on the back of that Azure Firebird.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-2-chapter-5","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
