{"id":49969,"no":272,"title":"Book 10, Chapter 20 - The Final Palace","content":"\u003cp\u003eYoungflame Nong gave the group of Wanxiang Adepts a look. He mused to himself, “Perhaps they aren’t in the Dao Repository Palace… or perhaps one of them has them. Still, Immortal Witchriver was merely a Diremonster Immortal; his roots weren’t that deep. Even if he had some divine abilities or techniques, the Youngflame clan probably has them as well. And they are still very useful to me…”\u003c/p\u003e\n\u003cp\u003e“Everyone, since we have finished our investigations, then let us head to the final palace,” Youngflame Nong said.\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eNing and the others immediately began to grow nervous.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” Youngflame Nong took out yet another magic treasure, a flying weaver’s shuttle. The flying shuttle expanded to thirty meters long and ten meters wide. Ning and the others entered it, which was quite roomy.\u003c/p\u003e\n\u003cp\u003eSwish! The flying shuttle immediately exited the Dao Repository Palace. As they emerged, the Fiendgod Xiangliu Fang was already waiting for them.\u003c/p\u003e\n\u003cp\u003e“Young master.” Xiangliu Fang transformed into a streak of light, flying towards the shuttle\u003c/p\u003e\n\u003cp\u003eYoungflame Nong smiled and nodded towards Xiangliu Fang, seeming somewhat relaxed. But then, he turned his head to stare at the final golden Skypillar of light, and the many monstrous Dao-soldiers guarding it. He snorted coldly, “These monstrous Dao-soldiers have blocked me repeatedly. After I bind this Immortal estate, I am definitely going to repay them for their actions!”\u003c/p\u003e\n\u003cp\u003e“How could the monsters of a puny little Immortal estate possibly withstand the Youngflame clan?” Xiangliu Fang laughed as well, and Youngflame Nong nodded.\u003c/p\u003e\n\u003cp\u003eNing and the others were secretly surprised… why was it that Youngflame Nong didn’t seem to be the slightest bit worried?\u003c/p\u003e\n\u003cp\u003e“So many monstrous Dao-soldiers…” Ning mused to himself, “The Seawave Dao-soldiers and the Yaksha Dao-soldiers are all far more powerful than ordinary Loose Immortals; even Xiangliu Fang was dominated. What sort of treasure does this Youngflame Nong have?”\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-brother, he seems quite confident,” Northson said with a smirk.\u003c/p\u003e\n\u003cp\u003e“Let’s watch and see,” Ning sent back.\u003c/p\u003e\n\u003cp\u003eAs the flying shuttle continued to fly forward, constantly advancing towards that distant golden Skypillar of light and the Seawave Dao-soldiers and the Yaksha Dao-soldier formations surrounding it. They were now quite close.\u003c/p\u003e\n\u003cp\u003e“Humans!” A deep voice shook the heavens.\u003c/p\u003e\n\u003cp\u003eYoungflame Nong just laughed icily, while next to him, Xiangliu Fang spoke out on his behalf. “What is it?”\u003c/p\u003e\n\u003cp\u003e“Actually, there is no need for you to fight with us, the monstrous races of the Immortal estate world. So long as you are willing to open up a corridor out with your key and let us leave to the world of the Grand Xia Empire, then we are willing to permit you to enter this final palace,” the deep voice said. Immortal Duohe and Immortal Witchsui both felt that, given these humans still dared to advance in the face of so many monstrous Dao-soldiers, that they probably felt confident in passing through them. Thus, Immortal Duohe and Imimortal Witchsui quickly came to the decision of negotiating with these humans.\u003c/p\u003e\n\u003cp\u003e“Let you leave? That’s not impossible.” Youngflame Nong revealed a smile. “But I have a requirement.”\u003c/p\u003e\n\u003cp\u003e“Oh? Speak. What requirement.” The deep voice echoed forth once more.\u003c/p\u003e\n\u003cp\u003e“Simple. Hand over all of your Dao-armors, and I’ll let you leave.” Youngflame Nong’s voice also echoed out in the skies.\u003c/p\u003e\n\u003cp\u003e“All of our Dao-armors?”\u003c/p\u003e\n\u003cp\u003e“Impossible.”\u003c/p\u003e\n\u003cp\u003e“Kill this human.”\u003c/p\u003e\n\u003cp\u003e“In his dreams!”\u003c/p\u003e\n\u003cp\u003eAll sorts of ferocious howls rang out.\u003c/p\u003e\n\u003cp\u003eThese Dao-armors had been left behind by Immortal Witchriver, and were the reason why these monsters were so powerful.\u003c/p\u003e\n\u003cp\u003e“Without the Dao-armors, we would be like a pile of loose sand; we wouldn’t even be able to defeat that Fiendgod by your side. In fact, we’d probably be beaten by him instead,” the deep voice thundered angrily.\u003c/p\u003e\n\u003cp\u003e“I can swear an oath to the Dao of the Heavens that if you are willing to hand over all of your Dao-armors, that I will let you leave and will not pursue or kill you,” Youngflame Nong said.\u003c/p\u003e\n\u003cp\u003eThe Dao-armors interested Youngflame Nong the most; if he could obtain them easily, then he wouldn’t mind letting the wielders of them leave.\u003c/p\u003e\n\u003cp\u003e“Impossible!” The deep voice bellowed angrily.\u003c/p\u003e\n\u003cp\u003e“Then don’t blame me for this,” Youngflame Nong shook his head.\u003c/p\u003e\n\u003cp\u003e“You are forcing us!” The deep voice snarled.\u003c/p\u003e\n\u003cp\u003e“Right. So what if I am?” Youngflame Nong snickered.\u003c/p\u003e\n\u003cp\u003eThese powerful monsters were bloodthirsty to begin with. Given how excessive Youngflame Nong had behaved, they were now truly angered.\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003eAn enormous, sky-filling wave arose, blotting out the heavens and smashing down towards the flying shuttle which Ning and Youngflame Nong were riding. The flying shuttle, however, went directly towards the giant wave with incredible agility.\u003c/p\u003e\n\u003cp\u003e“This is the moment.” A long time ago, Youngflame Nong had produced a queer-looking disc in his hand, which was a mixture of black and white in color.\u003c/p\u003e\n\u003cp\u003e“POLARIS STARSHIFTER!”\u003c/p\u003e\n\u003cp\u003eYoungflame Nong let out an angry roar.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eThis black and white bi-colored disc floated into the air. A ray of black light enveloped the entire flying shuttle, while a ray of white light shot directly towards part of the distant Yaksha Dao-soldiers.\u003c/p\u003e\n\u003cp\u003eWhoosh!\u003c/p\u003e\n\u003cp\u003eSpace instantly distorted.\u003c/p\u003e\n\u003cp\u003eThat portion of the distant Yaksha Dao-soldiers instantly disappeared, then appeared in the location where the shuttle had been. As for the flying shuttle, it appeared in the location where those Yaksha Dao-soldiers had been.\u003c/p\u003e\n\u003cp\u003e“Open.” As soon as the shuttle appeared, a corridor into the palace appeared. Swoosh! The long shuttle flew directly into the tunnel, and then the gate shut behind it.\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eImmortal Duohe and Immortal Witchsui were completely stunned. All of the Dao-soldiers were stunned. Then stared stupidly at the bi-colored black and white disc. As the energies of the disc were used up, it silently, soundlessly shattered.\u003c/p\u003e\n\u003cp\u003e“They entered?”\u003c/p\u003e\n\u003cp\u003e“They entered, just like that?” Immortal Duohe and Immortal Witchsui, as well as all the other monsters, had looks of disbelief, anger, and despair in their eyes.\u003c/p\u003e\n\u003cp\u003e“It shouldn’t have been like this. It shouldn’t have…” Immortal Duohe’s eyes were filled with boundless rage. Raising his head, he let out an earth-rending, pained, agonized roar.\u003c/p\u003e\n\u003cp\u003eThey had lost. Utterly lost.\u003c/p\u003e\n\u003cp\u003eIf this had been an actual battle, teleporting away a small part of their Dao-soldiers would have only been a minor matter. But this wasn’t an actual battle; the enemy, upon teleporting those soldiers away, had immediately been able to enter the final palace.\u003c/p\u003e\n\u003cp\u003e“After this, the Immortal estate will be bound. After this, all of us will be under his control.” Immortal Witchsui was mumbling to himself.\u003c/p\u003e\n\u003cp\u003eIn this moment, the countless monstrous Dao-soldiers were all howling in anger, grief, and despair…\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSwoosh.\u003c/p\u003e\n\u003cp\u003eA long shuttle appeared within the hall, with Youngflame Nong, Xiangliu Fang, Ji Ning, and the others within it. They all emerged from within.\u003c/p\u003e\n\u003cp\u003e“Hahaha.” Youngflame Nong, upon entering, began to laugh joyfully. “We’ve finally arrived at the final palace. Mmm, and it is quite beautiful as well, far more so than those other four palaces.”\u003c/p\u003e\n\u003cp\u003eNing and the others were still feeling shocked by what had happened with that bi-colored disc. It had actually caused them to completely swap positions with the distant enemy Dao-soldiers. What treasure was that? Ning, at least, had never even heard of such a treasure.\u003c/p\u003e\n\u003cp\u003e“It really is much more beautiful. Every single pillar is exquisitely, intricately carved,” Xue Hongyi said quickly.\u003c/p\u003e\n\u003cp\u003e“The final palace. After binding it, the entire Immortal estate will be under my control, and the trial the clan gave me will have been concluded. I’ll have earned an Immortal estate as well.” Youngflame Nong was quite delighted, but then he let out a sigh. “What a pity, though… after entering this Immortal estate, I lost two of my three most powerful treasures.”\u003c/p\u003e\n\u003cp\u003e“Treasures are meant to be used. After you master the Immortal estate, you’ll acquire even better treasures, young master,” Xiangliu Fang said.\u003c/p\u003e\n\u003cp\u003e“I hope so.” Youngflame Nong still felt a bit of pain in his heart. The ‘Lock’ scroll and the Polaris Starshifter disc were two of the most powerful magic treasures he had on him. These were treasures which even many Loose Immortals didn’t have access to; even if one had large amounts of liquefied elemental essence, it would be difficult to purchase them. After all, they were simply too rare. Youngflame Nong had only managed to acquire them after many years of collecting resources. Still, for the sake of solidifying his status as the next Godplume Duke, he had no other choices.\u003c/p\u003e\n\u003cp\u003e“Acquiring the Immortal estate will mean that I’ll have recouped my costs, and earned a little on top of it. Those monsters… hmph. They should make their preparations for all of their descendants to forever be slaves.” A cold light flashed through Youngflame Nong’s eyes. “And that Xue Hongyi… I need to acquire his Immortal-ranked magic treasure as well.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-10-chapter-19\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-10-chapter-21\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-10-chapter-20","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
