{"id":49983,"no":286,"title":"Book 11, Chapter 5 - Immortal Diancai and Ji Ning","content":"\u003cp\u003e“Let’s go. We return to the imperial capital!” Patriarch Arcanum gave the order. Immediately, those nine Flood Dragons pulled the Immortal carriage away, disappearing into the skies.\u003c/p\u003e\n\u003cp\u003ePatriarch Arcanum was a decisive individual. He knew that given that he hadn’t discovered Ji Ning right away, if he wanted to capture Ning… he would have to spend quite a bit of time. Although he was a Celestial Immortal, he wasn’t omniscient; he still had to resort to using the power of the tribe and the Heavenly Treasures Mountain to find Ning.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWithin the City of Ten Thousand Swords.\u003c/p\u003e\n\u003cp\u003eImmortal Diancai lifted his head, watching as Patriarch Arcanum departed. By his side were Ji Truekeep, Ji Ninfire, and the other members of the Ji clan, along with the two monstrous Loose Immortals.\u003c/p\u003e\n\u003cp\u003e“Clan leader Ji,” Immortal Diancai said, “Patriarch Arcanum has already departed. He wasn’t able to find my apprentice, but he won’t stay here indefinitely; he’s a Celestial Immortal, after all, with an exalted status! However, I imagine he will arrange for some people to stay on watch, here at Swallow Mountain. This is my apprentice’s homeland, after all; they will definitely keep an eye on it. Now that your Ji clan has so many monstrous Dao-soldiers present… there’s no reason for me to stay here. I won’t tarry any longer, then.”\u003c/p\u003e\n\u003cp\u003e“Thank you, senior Immortal,” Truekeep and the others said hurriedly.\u003c/p\u003e\n\u003cp\u003eThey felt tremendous gratitude for this Immortal of the Black-White College, who had hurried here at such a critical time. Although he was Ning’s master, when trouble came, some masters would flee even faster than their disciples would.\u003c/p\u003e\n\u003cp\u003eImmortal Diancai didn’t say anything else. He soared straight into the skies. The City of Ten Thousand Swords had already set down a grand spacelock formation, preventing teleportation.\u003c/p\u003e\n\u003cp\u003eWhoosh. After flying high into the sky, Immortal Diancai immediately disappeared.\u003c/p\u003e\n\u003cp\u003e“This Immortal Diancai truly is a loyal man,” the monstrous Immortal Duohe said with a sigh.\u003c/p\u003e\n\u003cp\u003e“Admirable, admirable,” Immortal Witchsui said as well.\u003c/p\u003e\n\u003cp\u003e“It’s true. For Ning to have such a master is his good fortune,” Ninefire sighed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eStillwater City. The Black-White College.\u003c/p\u003e\n\u003cp\u003eThe black-robed, black-haired Immortal Diancai was seated face to face with a short old man. Before the two of them, there was only a flagon of Immortal wine.\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-brother Fivecraze,” Immortal Diancai said softly, “The arrival of Patriarch Arcanum caused me to feel powerless. Ning is my apprentice, my one and only disciple… but I’m not able to do anything in the face of the Youngflame clan’s attempt to kill him! I’m completely unable to save him!” As he spoke, Diancai’s body was visibly trembling.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother Diancai,” the short elder said hurriedly, “Don’t be so stubborn. He’s a Celestial Immortal, after all.”\u003c/p\u003e\n\u003cp\u003e“So what if he is? In the past, wasn’t senior Northwalker, a Loose Immortal, comparable to a Celestial Immortal in might?” Immortal Diancai growled, “I’ve made up my mind. Today, I am going to leave. Leave this major world of ours, and temper myself through adventuring. Although I reached the peak of the Void stage long ago and although I can attempt my tribulation, I’ve been suppressing myself, precisely because I don’t feel confident in succeeding. My talent is a bit weaker than this disciple of mine’s. If I don’t frantically temper myself, most likely, in the end, I won’t be able to avoid being overcome by the Celestial Tribulation and becoming a Loose Immortal. After becoming a Loose Immortal… even if I stay alive countless eons and reach senior Northwalker’s level of power, what’s the point? In the end, I still won’t be able to overcome the Three Calamities and Nine Tribulations, resulting in death.”\u003c/p\u003e\n\u003cp\u003eThe short elder was silent for a moment, then said slowly, “It seems your apprentice’s matter has affected you tremendously.”\u003c/p\u003e\n\u003cp\u003e“I, his master, have failed him. I am of no use!” Immortal Diancai rose to his feet. “I’ll leave now, senior apprentice-brother.”\u003c/p\u003e\n\u003cp\u003e“Be careful!” the short elder said solemnly.\u003c/p\u003e\n\u003cp\u003eTo temper one’s self naturally required one to experience deadly situations, to walk on the border between life and death, which would allow one’s insights and comprehension to rapidly increase. However, this sort of tempering was extremely dangerous. When walking on a line between life and death, one might truly fall into death.\u003c/p\u003e\n\u003cp\u003eImmortal Diancai laughed, then charged into the skies, quickly disappearing.\u003c/p\u003e\n\u003cp\u003eSwish. Swish. Swish. Swish. Swish.\u003c/p\u003e\n\u003cp\u003eFive figures appeared in succession by the short elder’s side. These were the other Immortals of the Black-White College.\u003c/p\u003e\n\u003cp\u003e“He truly is decisive,” a youthful-looking ‘child’ sighed.\u003c/p\u003e\n\u003cp\u003e“Compared to him…” The tall, muscular, chain-shrouded man said in a low voice, “Although I am a reincarnated Immortal, my Dao-heart isn’t as firm as his. It seems the common saying is true; if you fail in one life to become a Celestial Immortal, even if you reincarnated ten times or a hundred times, you still won’t be able to become a Celestial Immortal.”\u003c/p\u003e\n\u003cp\u003e“There are still some reincarnated Immortals who do become Celestial Immortals,” the short elder said.\u003c/p\u003e\n\u003cp\u003e“But how few and rare are they?” The youthful-looking child sighed. “With the great determination that junior apprentice-brother Diancai has… as I see it, he might have just increased his chances of becoming a Celestial Immortal by a bit. He may very well truly have a shot at becoming only the second Celestial Immortal the Black-White College has seen in our ancient history.”\u003c/p\u003e\n\u003cp\u003e“He does indeed have a shot,” the tall, blood-robed, skinny youth said with a nod. “However… the Celestial Tribulation is difficult to overcome!”\u003c/p\u003e\n\u003cp\u003eAll of them fell silent. The Celestial Tribulation? This was a nightmare for all Earth Immortals and Loose Immortals. The worst part of it was, every single Celestial Tribulation was different in power; just because one was strong, didn’t mean they would necessarily succeed in overcoming it!\u003c/p\u003e\n\u003cp\u003e“First, junior apprentice-brother Diancai needs to return safely. Otherwise, there’s no point in discussing the Celestial Tribulation.” The short elder’s eyes were filled with anticipation. “I wonder if I, a crazy old madman, will be able to see him again before I die.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWithin another world. The underwater estate.\u003c/p\u003e\n\u003cp\u003eNing had no idea as to what had happened in the outside world. His attention was completely focused on the Primaltwin secret art; this was a soul-splitting technique, and he had to be incredibly cautious in using it.\u003c/p\u003e\n\u003cp\u003eNing was seated in the lotus position on a prayer mat. Not too far away, the giant yellow bear and the old black bull were staring at him.\u003c/p\u003e\n\u003cp\u003e“He won’t fail, will he?” the old black bull said worriedly, They had already set up a barrier around them, preventing their voices from reaching out and disturbing Ning.\u003c/p\u003e\n\u003cp\u003e“Ji Ning’s visualization technique is an extremely impressive one. Even if he fails, he would at most lose control over half of his soul; he wouldn’t die,” the giant yellow bear said.\u003c/p\u003e\n\u003cp\u003e“Lose control over half his soul…” the old black bull murmured to himself. That was still quite severe.\u003c/p\u003e\n\u003cp\u003eIf the Primaltwin art was a success, the soul would be split in two, but both parts would still remain in existence. Although Ning would temporarily be weakened, that would be a minor matter, and he would soon recover. If, however, one of the two parts of his soul was to be completely extinguished, Ning’s personality might change drastically. He might even develop mental issues such as depression or madness.\u003c/p\u003e\n\u003cp\u003eTo lose control over half of one’s soul… this could indeed cause a drastic personality change.\u003c/p\u003e\n\u003cp\u003eHuff. Puff. Ning took several long breaths, completely calm. He had already memorized and mentally repeated the Primaltwin art several times now.\u003c/p\u003e\n\u003cp\u003e“Let’s begin.”\u003c/p\u003e\n\u003cp\u003eNing shut his eyes.\u003c/p\u003e\n\u003cp\u003eWithin his sea of consciousness. The spirit-Ning stood there, entire body emanating with sword-ki. This was an evolved sword-soul! Sword-souls were almost utterly indestructible, making a split even more difficult.\u003c/p\u003e\n\u003cp\u003eWhooooooosh. The forehead of the spirit-Ning began to glow with light, a vertical-shaped light. Ning used all of his energy in executing the secret art, causing his own divine will to form into a knife that began to cut both upwards and downwards from his forehead.\u003c/p\u003e\n\u003cp\u003eThat vertical light slowly began to elongate.\u003c/p\u003e\n\u003cp\u003e“Arggggggh!” Agony. The soul-ripping agony caused even Ning, despite his incredible endurance and Dao-heart, to tremble. However, generally speaking, those who dared to execute the Primaltwin technique were all extraordinary figures who would be able to endure this level of pain.\u003c/p\u003e\n\u003cp\u003eThe vertical light continued to elongate. It reached his neck… his chest… his abdomen…\u003c/p\u003e\n\u003cp\u003eThe vertical light splitting the ‘body’ of the spirit-Ning had completely cut him in half. It was as though a ray of light had just cleanly bisected him. However, this wasn’t the dangerous part; what was going to happen next was the dangerous part.\u003c/p\u003e\n\u003cp\u003e“SPLIT!”\u003c/p\u003e\n\u003cp\u003eNing’s soul began to split apart. That vertical light splitting his spirit in half separated, causing his spirit to split into two\u0026nbsp;parts. One half, moving as fast as lightning, flew back into Ning’s physical body. In the instant his soul split apart, Ning felt a wave of dizziness overcome him, and while flying over his soul trembled as well. Ning’s Dao-heart, however, was resilient, and so although the dizziness caused him to feel incredibly tired, he was still able to withstand it.\u003c/p\u003e\n\u003cp\u003eThis was a step that had to be fast and had to be endured. Otherwise, if the other half of the soul wasn’t able to enter the Sole-Ki Pearl of Primalwater, it would die on the way. After splitting the soul, there was no way to merge it again.\u003c/p\u003e\n\u003cp\u003e“Enter.”\u003c/p\u003e\n\u003cp\u003eThe other half of the soul flew out like a streak of light, entering the Sole-Ki Pearl.\u003c/p\u003e\n\u003cp\u003eIn the instant it did, the soul felt as though it was a son entering the embrace of the other, a wandering, adrift boat that had finally returned to harbor. There was a feeling of peace, of warmth, of calm which completely filled the soul. The soul had its vessel… naturally, it felt nice.\u003c/p\u003e\n\u003cp\u003e“Whew.” Ning let out a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Visualization technique!”\u003c/p\u003e\n\u003cp\u003eFor the moment, Ning had no time to waste on training his Primaltwin. His very first response was to immediately have both of his souls immediately execute the visualization technique.\u003c/p\u003e\n\u003cp\u003eWithin his sea of consciousness.\u003c/p\u003e\n\u003cp\u003eThe now-shrunken spirit-Ning sat down in the lotus position. Ahead of him, within the vast void of his sea of consciousness, appeared an enormous image of Mother Nuwa. The image of Mother Nuwa, in the void, seemed to press down upon both the past and the future. It was eternal and unchanging, and it caused Ning’s soul to become incomparably stable as well. The aura of divine light emanating from her, filled with boundless warmth, illuminated Ning’s soul, causing the badly damaged soul to begin to heal.\u003c/p\u003e\n\u003cp\u003eWithin the Sole-Ki Pearl of Primalwater, there was the second, also-shrunken spirit-Ning, who was also visualizing an image of Mother Nuwa. When her image appeared, her light seemed to stretch off into infinity.\u003c/p\u003e\n\u003cp\u003eBoth souls were in a wounded state right now, but they rapidly began to heal. This healing process took nearly three full days, during the course of which both souls grew considerably stronger.\u003c/p\u003e\n\u003cp\u003e“Whew.” Ning opened his eyes. The Sole-Ki Pearl of Primalwater in front of him flew up as well, landing within his hand.\u003c/p\u003e\n\u003cp\u003e“How did it go?” The giant yellow bear asked hurriedly, “How is your soul?”\u003c/p\u003e\n\u003cp\u003e“I’ve healed to roughly seventy percent of normal,” Ning said.\u003c/p\u003e\n\u003cp\u003e“Seventy percent?!” The giant yellow bear was stunned. “It seems you truly do have a formidable visualization technique.”\u003c/p\u003e\n\u003cp\u003eWhen the soul split into two, both souls would have roughly half of the strength of the former soul. For an ordinary visualization technique, the user would be lucky to see each half-soul stabilize at fifty percent power. You could forget about having the soul quickly grow back! But Ning had not only stabilized his souls, he had already reached seventy percent power.\u003c/p\u003e\n\u003cp\u003e“However, this is a one-time thing. After all, the damage caused by the soul-splitting was fresh, which was why I was able to heal so much of it at one go. In the future, it will be slower. To return to a divine sense of a thousand kilometers… I’m afraid it will take a long time,” Ning sighed.\u003c/p\u003e\n\u003cp\u003e“Don’t be too greedy. You’ve already produced a Primaltwin, after all; this represents a second life for you,” the giant yellow bear sighed. “Your Primaltwin can also become an Earth Immortal or Celestial Immortal; in fact, if your true body dies, your Primaltwin will still survive.”\u003c/p\u003e\n\u003cp\u003eLaughing, Ning nodded.\u003c/p\u003e\n\u003cp\u003eThe true body and the Primaltwin had linked memories; in all other ways, however, they were completely independent. Indeed, a Primaltwin could be described as a second life.\u003c/p\u003e\n\u003cp\u003e“Hurry up and begin your training. Completely refine all of the essence within the Sole-Ki Pearl of Primalwater,” the giant yellow bear laughed.\u003c/p\u003e\n\u003cp\u003e“Right.” Ning nodded, then had his Primaltwin within the Sole-Ki Pearl begin to train.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-11-chapter-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-11-chapter-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-11-chapter-5","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
