{"id":49726,"no":29,"title":"Book 2, Chapter 11 - Entering the Marsh","content":"\u003cp\u003eNing’s squad, mounted on the three black ferobeasts, charged through the borders of the mountain forest.\u003c/p\u003e\n\u003cp\u003e“Look.” Uncle Dala pointed in front. “Eastmount Marsh is up ahead.”\u003c/p\u003e\n\u003cp\u003e“Eastmount Marsh.”\u003c/p\u003e\n\u003cp\u003eNing stared off into the distance.\u003c/p\u003e\n\u003cp\u003eAn enormous, endless lake stretched far into the distance, flashing with the beautiful light of the spring sun. At one glance, one could see flying beasts diving down and snatching up fish, or some tails of enormous aquatic creatures wriggling amongst the reeds. Occasionally, a massive head would be seen. This was the world of monsters!\u003c/p\u003e\n\u003cp\u003e“Eastmount Marsh.” Ning murmured. “We’re finally here.”\u003c/p\u003e\n\u003cp\u003eEastmount Marsh was located between the territory of the Ji clan and the Ironwood clan. The Ironwood clan was a hegemonic power on par with the Ji clan, but it was the Ji clan’s enemy!\u003c/p\u003e\n\u003cp\u003eEastmount Marsh was over a thousand kilometers wide, and was on par in size with a ‘province’ in his previous life. Such an enormous lake…naturally had countless monstrous beasts here. The monstrous beasts which the Ji clan knew about numbered up to twelve!\u003c/p\u003e\n\u003cp\u003eEver since leaving the Ji clan of the West Prefecture and adventuring ,Ning had wanted to go fight with a few Xiantian level Diremonsters, but Diremonsters were all hidden within the deep lakes and tall mountains. How could they be so easily found? In the past, he had spent nearly an entire month searching an area without any success. Furious, Ning immediately changed their path and headed straight to Eastmount Marsh!\u003c/p\u003e\n\u003cp\u003e“There are many monsters in Eastmount Marsh, and many of them are early Xiantian level. I refuse to believe I won’t encounter a single one.” Ning was like a newborn calf who didn’t know the meaning of fear. However, he didn’t dare to be too incautious either, because many clansmen of the Ji clan had died here in Eastmount Marsh, such as his grandfather, who had died here at Eastmount Marsh!\u003c/p\u003e\n\u003cp\u003e-------------------------\u003c/p\u003e\n\u003cp\u003e“Mowu. Autumn Leaf.” Ning leapt off the back of his black ferobeast and instructed, “Eastmount Marsh is too risky a place, and there is danger everywhere. In addition, the black ferobeasts are of no use in the water. The two of you, take these three black ferobeasts and head to the Metalstone Tribe. Wait for me at the Metalstone Tribe!”\u003c/p\u003e\n\u003cp\u003eMowu and Autumn Leaf glanced at each other. They could only reply respectfully, “Yes, young master.”\u003c/p\u003e\n\u003cp\u003e“Dala.” Ning looked at the swarthy, big man. “You and I will make a trip to this lake. Help me get used to the general areas around here, and then you can go back and rest at the Metalstone Tribe as well.”\u003c/p\u003e\n\u003cp\u003e“Yes, young master.” Uncle Dala said respectfully.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eNing immediately headed forward, and Uncle Dala, hefting his greataxe, followed behind. Autumn Leaf and Mowu watched as their young master entered the distant Eastmount Marsh. Although they were nervous, there was nothing they could do. One of them was a maidservant, while the other was nothing more than a person assigned to teach the young master his abundant mountaineering experience. Their power was far inferior to Ning’s.\u003c/p\u003e\n\u003cp\u003eThe vast lake was filled with myriad beautiful scenes.\u003c/p\u003e\n\u003cp\u003e“Within this great lake, there are places with islands of firmer terrain and grasses as well.” Uncle Dala laughed. “In fact, there are even some small villages. But of course, most of the muddy areas, if you step into them, you’ll sink into the marsh…and in addition, there is of course the immeasurably deep lake itself. Within the marsh, it is difficult to move about, and if you aren’t careful, you’ll sink into it.”\u003c/p\u003e\n\u003cp\u003eNing was right next to him.\u003c/p\u003e\n\u003cp\u003e“Our Metalstone Tribe has lived in a village near the marsh for centuries now, and often come here to fish. We know exactly where which roads are passable and which aren’t.” Uncle Dala was very confident.\u003c/p\u003e\n\u003cp\u003ePa! Pa!\u003c/p\u003e\n\u003cp\u003eStriding through the mud, Ning followed this tribal warrior through Eastmount Marsh.\u003c/p\u003e\n\u003cp\u003e“Look.” A beastskin parchment appeared out of nowhere in Ning’s hands. “This is the map of Eastmount Lake. Lead me to these circled areas.”\u003c/p\u003e\n\u003cp\u003e“Ah!” Uncle Dala was terrified. “These…these are all places where Diremonsters are hiding. These are the most dangerous places. We don’t dare go near them.”\u003c/p\u003e\n\u003cp\u003e“You don’t need to go near them.” Ning shook his head. “Just lead me there, and tell me from afar how to go.”\u003c/p\u003e\n\u003cp\u003eUncle Dala’s forehead was covered in sweat. He nodded. “Alright. I’ll lead you, young master.”\u003c/p\u003e\n\u003cp\u003e----------------------\u003c/p\u003e\n\u003cp\u003eEastmount Marsh was simply too vast. It was indeed quite slow for them to move through it relying on their legs alone. In addition, this was Ning’s first time coming here, and the various meandering pathways stretched for thousands of kilometers. Fortunately, the experienced Uncle Dala guided him to one hidden pathway after another, allowing them to easily navigate this marsh.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye, over a month passed.\u003c/p\u003e\n\u003cp\u003eNing had carried food and beverages within his kalestone, and in addition, they could roast the meat of some monstrous beasts. Whenever they went to sleep, they would just find a random patch of dry land or grass. Ning wasn’t in a hurry to go challenge those hidden Diremonsters. First, he wanted to locate them. Afterwards, he would travel by himself and relying on his ‘one with the world’ level of footwork to easily walk atop the surface of the lake water. He would be able to traverse a thousand kilometers in but a single day.\u003c/p\u003e\n\u003cp\u003e“This is the last place.” Uncle Dala pointed from afar at a distant place, where the luxurious growth of aquatic plants, at least three meters high, waved in the wind. “Right there, where the aquatic plants are growing, is the lair of a Greater Beast. Supposedly, this is an extremely, extremely large rhinoceros, an aquatic rhinoceros the size of a small mountain.”\u003c/p\u003e\n\u003cp\u003e“Alright. Let’s go back. After returning to the Metalstone Tribe, I will definitely reward you heavily.” Ning said.\u003c/p\u003e\n\u003cp\u003e“Young master, you’ve given me enough.” Uncle Dala said hastily.\u003c/p\u003e\n\u003cp\u003eThis seemingly delicate youngster was actually terrifyingly powerful. During their month in Eastmount Marsh, they had been attacked by quite a few monstrous beasts, but all of them died to but a single blow of the youngster’s sword! Ning didn’t care about the corpses of the monstrous beasts either, but Uncle Dala’s heart ached every time. This was monstrous beast flesh. If they sold it, the tribe would be in a much better situation, but he couldn’t carry it all back, so all he could do was to carve out a few choice parts and take them with him.\u003c/p\u003e\n\u003cp\u003e“Hrm?” Ning and Uncle Dala both suddenly stared into the distance.\u003c/p\u003e\n\u003cp\u003eFrom afar, there was a squad of troops, with quite a few figures within.\u003c/p\u003e\n\u003cp\u003eDeep in the marsh, there were solid areas, muddy areas, and even hilly areas, along with a large mountain. That mountain was known as the East Mountain, which was why this marsh was known as Eastmount Marsh.\u003c/p\u003e\n\u003cp\u003eOff in the distance, a squad of apparently several hundred soldiers could be seen clustered in on a hill. Suddenly, ten figures ran over at rapid speed towards Ning and Uncle Dala.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Ning frowned.\u003c/p\u003e\n\u003cp\u003e“Quick, let’s leave.” Uncle Dala was so frightened that he immediately turned tail and ran.\u003c/p\u003e\n\u003cp\u003eShua!\u003c/p\u003e\n\u003cp\u003eOne of those ten men was wearing blue metal armor, and with a howl, he leapt forward at an astonishing speed, blocking off Uncle Dala’s escape path.\u003c/p\u003e\n\u003cp\u003e“The two of you.” The blue armored man stared at them coldly, pausing only briefly to glance at the exquisite beast fur clothes on Ning’s body, before continuing disdainfully, “Come with us!”\u003c/p\u003e\n\u003cp\u003e“What do you want with us?” Uncle Dala, seeing the man’s armor, immediately bowed and said respectfully.\u003c/p\u003e\n\u003cp\u003eThe other nine walked over as well, all of them dressed in armor.\u003c/p\u003e\n\u003cp\u003e“Hurry up. If we tell you to follow us, then follow us. Otherwise, you die here!” These armor-clad guards all stared coldly while hefting their weapons, clearly very skilled.\u003c/p\u003e\n\u003cp\u003eUncle Dala looked at Ning.\u003c/p\u003e\n\u003cp\u003e“Let’s take a look for now.” Ning was actually quite calm. These armored guards were clearly no ordinary people, but to him, they were like nothing more than wild chickens facing a ravenous dog. But why did the armored guards want them to follow? If it wasn’t necessary, Ning didn’t want to so casually slaughter others.\u003c/p\u003e\n\u003cp\u003e“Move.”\u003c/p\u003e\n\u003cp\u003e“Hurry.”\u003c/p\u003e\n\u003cp\u003eUnder the watchful gazes of the ten armored guards, Ning and Uncle Dala headed towards the hill.\u003c/p\u003e\n\u003cp\u003eThere was some grass on the hill, and there were currently hundreds of people there. Most of them were lying there with their hands and feet bound, while roughly a hundred armored guards were in a perimeter around them, while there was a stone seat in the center. On the stone seat, there was a bulky, muscled man, at least six and a half feet tall, wearing thick armor and with a dominating gaze.\u003c/p\u003e\n\u003cp\u003eNing stared in surprise at the tall armored man who sat in the middle. The ‘demonstone’ in Ning’s pocket was currently radiating heat. Clearly, it had sensed the presence of a nearby monster. At the same time, Ning could vaguely feel that the massive armored man escorted by the many guards had an extraordinary aura.\u003c/p\u003e\n\u003cp\u003e“There’s a Diremonster.” Ning hurriedly inspecting everyone carefully.\u003c/p\u003e\n\u003cp\u003eOnly humans were nearby. A monster which could take human form was, without question, a Diremonster!\u003c/p\u003e\n\u003cp\u003eNing had brought many objects with him on this journey, and a demonstone was one of them. Demonstones…were a type of special natural rock. Once they sensed the aura of a monster, they would emanate light and heat. Some cities that were even larger than West Prefecture City would have ‘Monster Revealing Mirrors’ installed on the city gates, which were formed from multiple demonstones. So long as a monster drew near, the Monster Revealing Mirror would immediately radiate light.\u003c/p\u003e\n\u003cp\u003eHumans had a human aura, while monsters naturally had their own monstrous auras. This was a type of life aura.\u003c/p\u003e\n\u003cp\u003e“Dala!”\u003c/p\u003e\n\u003cp\u003e“Uncle Dala!”\u003c/p\u003e\n\u003cp\u003eSuddenly, several voices rang out.\u003c/p\u003e\n\u003cp\u003eNing and Uncle Dala both turned their heads and saw that amongst the bound people, there were ten of them calling towards the two of them. This caused Uncle Dala to immediately have a distressed look on his face. “Black Tiger, why have you been bound here?” Those ten or so people belonged to his tribe.\u003c/p\u003e\n\u003cp\u003e“Dala, why are you here? That giant person is a Diremonster. He’s going to eat us all.” One of the bound tribesmen called out frantically.\u003c/p\u003e\n\u003cp\u003e“Diremonster?” Uncle Dala was shocked.\u003c/p\u003e\n\u003cp\u003eNing stared back at that massive man in heavy armor, seated in the center of that ring of armored guards. Taking a careful glance, he saw that the giant man had a hint of blood at the corner of his lips, and he was currently smacking them in a satisfied manner. This caused Ning’s heart to immediately become filled with an urge to kill. “So the Diremonster which my demonstone sensed is him! Eastmount Marsh has a total of twelve Diremonsters. I wonder which one he is.”\u003c/p\u003e\n\u003cp\u003e“Shut your mouth.” An armored guard walked over and kicked that bound man, kicking him wildly and repeatedly. “All of you, shut your mouths.”\u003c/p\u003e\n\u003cp\u003e“You are harming your fellow humans for the sake of a Diremonster, and you want us to shut our mouths?”\u003c/p\u003e\n\u003cp\u003e“And you are the venerable Blue Guards of the Ironwood clan. You really are a disgrace to the Ironwood clan!”\u003c/p\u003e\n\u003cp\u003e“Kick away, kick as much as you like, kick us all to death.”\u003c/p\u003e\n\u003cp\u003eThe people being kicked shouted wildly.\u003c/p\u003e\n\u003cp\u003e“Stop it!” The massive, heavily armored man seated on the stone bench rumbled. His voice was very deep, as though coming from a bullhorn. “If you kick them to death, then I’ll eat you.”\u003c/p\u003e\n\u003cp\u003eThe armored guard glanced at the heavily armored giant, and then unhappily stepped back.\u003c/p\u003e\n\u003cp\u003e“Aquatic Rhino King!” A bald armored guard growled, “We have already helped you capture over five hundred people. Our comrades have spread out everywhere to capture people, and have already done our part. Give our young master back to us, and our Ironwood clan will act as though this never happened. Otherwise, if the situation escalates, Aquatic Rhino King…you should know that you are unable to bear the fury of our Ironwood clan.”\u003c/p\u003e\n\u003cp\u003eWatching from a distance under escort from two armored guards, Ning’s eyes lit up.\u003c/p\u003e\n\u003cp\u003eAquatic Rhino King?\u003c/p\u003e\n\u003cp\u003eThere was only a single Aquatic Rhinoceros amongst the twelve Diremonsters of Eastmount Marsh. It was an early Xiantian level Diremonster!\u003c/p\u003e\n\u003cp\u003e“Early Xiantian level?” Ning’s eyes were filled with a killing intent. “I’ve searched a long, long time for a Diremonster of this level of power. This really is a case of ‘searching far and wide to no avail, but then discovering it all of a sudden’.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-2-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-2-chapter-11","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
