{"id":50024,"no":327,"title":"Book 12, Chapter 10 - The Most Powerful Two-Man Squad","content":"\u003cp\u003eYu Wei rested her hands on her chin, just looking at Ji Ning. In fact, an unconscious smile even crept onto her face.\u003c/p\u003e\n\u003cp\u003eIt was very quiet.\u003c/p\u003e\n\u003cp\u003eThey were underneath the light of the moon. The only people present were herself and her junior apprentice-brother. She just gazed at her junior apprentice-brother… and everything seemed so perfect.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe plaza of the imperial citadel.\u003c/p\u003e\n\u003cp\u003e“Whaaaaaat?” Mu Northson stared at the image of Ji Ning and Yu Wei within the Diagram in the skies. Yu Wei sat there, resting her hands on her chin and staring intently at Ning. “Can it be that senior apprentice-sister Yu Wei has fallen for senior apprentice-brother Ji Ning? Good heavens!”\u003c/p\u003e\n\u003cp\u003eLittle Qing, wrapped around Northson’s arm, was staring intently as well.\u003c/p\u003e\n\u003cp\u003eJust from the look on Yu Wei’s face, anyone with the slightest bit of intelligence would be able to guess that Yu Wei harbored feelings for Ji Ning.\u003c/p\u003e\n\u003cp\u003e“That little girl Yu Wei and Ji Ning…?” Immortal Fivecraze revealed a grin. As he saw it, since both Yu Wei and Ji Ning were peerless geniuses of the Black-White College, they were quite a match for each other.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Look look, look look look, that expression on that little girl’s face! I told you, I told you all! I told you that this little girl must be in love with that Ji Ning fellow.” Lu Dongbin urgently pointed at a corner of the massive Diagram while saying to the nearby Xia Emperor, Sovereign Hao, and others, “I wanted to bet with you earlier, but none of you were willing.”\u003c/p\u003e\n\u003cp\u003e“You are the Sage of Love, a legendary matchmaker, the Moon Elder… who would dare bet against you in such a matter?” A Pure Yang True Immortal dressed in black Daoist robes that had a blood-colored Taiji diagram embroidered onto them laughed. [1. In Chinese Daoist religions, a minor divinity known as the ‘Moon Elder’ is responsible for marriages and matchmaking, much like Cupid is in Western mythologies.]\u003c/p\u003e\n\u003cp\u003e“Truelord, I’m no sage of love; I don’t even have a Dao-companion. I’m definitely not the Moon Elder either; the Celestial Court already has a designated Moon Elder,” Lu Dongbin said hurriedly.\u003c/p\u003e\n\u003cp\u003eBuffoonery and jests; shamelessness and thick-skinnedness; a master of pretense.\u003c/p\u003e\n\u003cp\u003eIn short, any place with Lu Dongbin in it would be a place of laughter. This was why Lu Dongbin had so many friends in the Three Realms. He was an incredibly good-natured fellow, had powerful backers supporting him, and was very strong in his own right. How could he not have countless friends?\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNinelotus, seated behind the Dongyan Forefather, tightly grasped at her robes as she stared at the massive Diagram. She chewed on her lips, a complicated look in her eyes. “Senior apprentice-sister Yu Wei… towards Ji Ning, you…”\u003c/p\u003e\n\u003cp\u003eIn the past, she had only been a bit worried. Although over the past few months, Ji Ning and Yu Wei had grown fairly close as they had adventured together, Ninelotus had chalked that up to being because they were fellow disciples of the same school. But upon seeing that look… she had no more doubts at all!\u003c/p\u003e\n\u003cp\u003e“I’ve made my choice.”\u003c/p\u003e\n\u003cp\u003e“No regrets.”\u003c/p\u003e\n\u003cp\u003eNinelotus bit her lips, lecturing herself mentally.\u003c/p\u003e\n\u003cp\u003eYu Wei just gazed at Ning, completely absorbed in her own little world. She completely forgot that there even was an outside world.\u003c/p\u003e\n\u003cp\u003eAfter an indeterminable period of time, tendrils of flame began to emerge around Ning, which grew and expanded into a lotus flower that began to continuously expand, from a fist-sized lotus flower to an enormous flaming lotus that was many tens of meters long. Ning sat there in the very center of the lotus amidst the pistils as the ripples of the Dao descended.\u003c/p\u003e\n\u003cp\u003e“Eh?” Yu Wei suddenly came to her senses.\u003c/p\u003e\n\u003cp\u003e“Not good!” She suddenly felt shocked. “Those in the outside world can see everything that’s going on within this Brightmoon Diagram of the Mountains and Rivers! Someone might’ve noticed me!”\u003c/p\u003e\n\u003cp\u003eShe had only revealed her emotions and ceased disguising them when she had seen that Ning had been completely absorbed in meditating on the Dao. She had forgotten that others outside could see her! This caused Yu Wei to feel incredibly awkward and embarrassed.\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-sister.” Ning opened his eyes, then said with a laugh, “I’ve broken through the bottleneck. I’ve finally mastered the Dao of the Inferno.”\u003c/p\u003e\n\u003cp\u003eYu Wei hurriedly came back to her senses, then said happily, “That’s wonderful. Junior apprentice-brother, you’ve already mastered the Dao of Rainwater. Now that you’ve mastered the Dao of the Inferno as well… with fire and water joining together and then infusing your Dao of the Sword, your power must have grown significantly.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded, filled with anticipation as well.\u003c/p\u003e\n\u003cp\u003eTwo complete Dao-Paths. He had also reached the Grand Dao Domain in the Dao of the Sword. He now felt even more confident in his chances. Although some of the most supreme geniuses amongst these hundred thousand-plus competitors in the Conclave might have already started training in their own Grand Daos, some had just a basic grasp while others had just gotten to understand their own hearts. Only a very few would have reached the Grand Dao Domain like Ning.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother, you need to seize the chance to train in your [Crimsonbright Diagram of the Nine Heavens],” Yu Wei immediately said. “You are only at the eleventh stage. There are many practitioners of the [Crimsonbright Diagram of the Nine Heavens] in this Conclave, and most of them have reached the twelfth stage.”\u003c/p\u003e\n\u003cp\u003e“Understood.” Ning nodded. This was his weakness. In Swallow Mountain, countless years would pass before there would be a genius capable of training in the [Crimsonbright Diagram of the Nine Heavens], but in Stillwater Commandery, the Black-White College alone had quite a few. As for the participants in this Conclave, many of them trained in the [Crimsonbright Diagram of the Nine Heavens]. To be at the eleventh stage of it was indeed a bit weak.\u003c/p\u003e\n\u003cp\u003eHowever, he had a powerful soul and was a Sword Immortal, and also had the [Starseizing Hand]. He didn’t fear fighting against any of them.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eJust half a month after Ning had mastered the Dao of the Inferno.\u003c/p\u003e\n\u003cp\u003eA massively built violet-robed youth and a barbarian youth were walking shoulder-to-shoulder amidst the mountain forests, sweeping out with their divine sense to a distance of ten kilometers.\u003c/p\u003e\n\u003cp\u003e“Cangwu Jiu, how many talismans do you have?” Xiamang Zishan asked.\u003c/p\u003e\n\u003cp\u003e“Just barely over a thousand. You?” Cangwu Jiu asked.\u003c/p\u003e\n\u003cp\u003e“You have more than a thousand already? I’ve killed even more people than you, but I only have 989!” Xiaman Zishan stared at him.\u003c/p\u003e\n\u003cp\u003e“That’s because you are stupid. Will you necessarily acquire a lot of talismans just by killing a lot of people? Some people had many on them; some had less. It comes down to being a matter of judgement… and clearly, your judgement is vastly inferior to mine,” Cangwu Jiu said disdainfully.\u003c/p\u003e\n\u003cp\u003eXiamang Zishan shook his head. “You don’t have THAT many more than me. Look at how smug you are acting! We’ve spent more than six months in the Diagram; more than half a year has passed. We need to speed it up and acquire at least 1300 each.”\u003c/p\u003e\n\u003cp\u003eThe Brightmoon Diagram of the Mountains and Rivers had a total of 109,362 competitors within it.\u003c/p\u003e\n\u003cp\u003eAfter a year, the eighty contestants with the most talismans would have passed the trials. Thus, so long as they acquired at least 1370 talismans, it was guaranteed that you would have passed. And given that some would have more and others less, while some of the losers would also have talismans… 1300 was probably going to be enough.\u003c/p\u003e\n\u003cp\u003e“We have to aim for 1400! Only then can I be at ease,” Cangwu Jiu said.\u003c/p\u003e\n\u003cp\u003eWhile chatting, the two continued to sweep their divine sense forward. Whoosh! They continued to advance rapidly forward.\u003c/p\u003e\n\u003cp\u003e“Eh?” Cangwu Jiu and Xiamang Zishan’s eyes suddenly flickered. Swoosh! Swoosh! The two transformed into streaks of light, instantly charging forward by many kilometers. Many kilometers away, halfway up a tall mountain peak, there stood a black-robed man and a woman. It was Ning and Yu Wei.\u003c/p\u003e\n\u003cp\u003eNing and Yu Wei both had powerful souls as well; when the enemy swept them with their divine sense, they both immediately noticed it. A moment later, two figures appeared in the distance.\u003c/p\u003e\n\u003cp\u003e“Them?” Ning and Yu Wei were both shocked. They immediately recognized the two, because these two were simply far too famous. And, more importantly, the two hadn’t changed their clothes at all.\u003c/p\u003e\n\u003cp\u003e“Xiamang Zishan? Cangwu Jiu?” Ning’s heart clenched. According to the reports from the Heavenly Treasures Mountain regarding the peerless geniuses participating in this Conclave, the number one ranked figure was Xiamang Zishan, while the number two was Cangwu Jiu!\u003c/p\u003e\n\u003cp\u003eXiamang Zishan trained in the [Crimsonbright Diagram of the Nine Heavens], and also trained in many divine abilities that were used only by the imperial Xiamang clan and were not taught to outsiders! His talent was absolutely top-notch as well, and the Grand Xia Emperor was quite pleased with him. Supposedly, he had long ago been guided by the Grand Xia Emperor into the tutelage of one of the experts of the Three Realms, and his power was immeasurable.\u003c/p\u003e\n\u003cp\u003eCangwu Jiu was one of the rare, peerless geniuses of the Cangwu clan. His age was comparable to Xiamang Zishan’s, and ever since they had been young, they had been famous geniuses of the imperial capital. They had grown up together.\u003c/p\u003e\n\u003cp\u003eBecause Xiamang Zishan was of the imperial clan, he was ranked as number one while Cangwu Jiu was forced to be ranked as number two. But no matter what… without question, these two were the two most famous participants in this Conclave!\u003c/p\u003e\n\u003cp\u003e“Given how famous they are, they assuredly have the power to back it up. Why have the two most famous figures joined forces?” Ning felt nervousness in his heart. If he encountered one of them, he would dare to fight… but he had Yu Wei with him as well, and she was a Ki Refiner. Although she had mastered two complete Daos, her power was still quite a bit lower than figures like Xiamang Zishan and Cangwu Jiu.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Lu Dongbin, weren’t you paying a great deal of attention to that little girl? This time, that little girl and Ji Ning have really run into trouble,” the Immortal Elder of the Northlands called out with a chortle.\u003c/p\u003e\n\u003cp\u003eLu Dongbin was watching. He said vexedly, “This really does seem to be trouble. Those two are named Xiamang Zishan and Cangwu Jiu, right? Their power can be considered to be in the absolute top tier of these hundred thousand-plus competitors. Even compared to the Sloppy Daoist, they would still probably be on par. You can’t say for certain who is stronger until they actually fight, but… Ji Ning and the little girl are a bit too weak.”\u003c/p\u003e\n\u003cp\u003e“Zishan is the most outstanding member in the junior generation of my Xiamang clan, and has a chance to rank in the top three this time.” The Xia Emperor laughed as he spoke. It was rare for him to care about someone from the younger generation, but Xiamang Zishan was the one he liked the most.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother Ji Ning.” Ninelotus watched nervously. She knew how frightening Xiamang Zishan and Cangwu Jiu were. Earlier, when she had watched as Xiamang Zishan and Cangwu Jiu had been headed in the direction of Ning and Yu Wei, she had begun to feel nervous. And in the end… they really did encounter each other.\u003c/p\u003e\n\u003cp\u003e“I hope nothing bad happens.” Ninelotus was extremely nervous.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWithin the world of the Diagram.\u003c/p\u003e\n\u003cp\u003eThe friends and family outside were worried, but there was nothing they could do. Ning and Yu Wei were now both very cautious as well.\u003c/p\u003e\n\u003cp\u003e“You are… Ji Ning?” Cangwu Jiu’s hawk-like eyes stared at Ning, immediately recognizing him.\u003c/p\u003e\n\u003cp\u003e“He’s Ji Ning? Doesn’t Ji Ning dress in furs?” the nearby Xiamang Zishan said.\u003c/p\u003e\n\u003cp\u003e“I told you that you are an idiot, but you wouldn’t listen. Can’t you just change your damn robes?” Cangwu Jiu shook his head. “I acquired quite a few paintings of Ji Ning. I collected many paintings of all the geniuses. Just by looking at a single one, it can be hard to recognize the real person, which is why I had to view many of them.”\u003c/p\u003e\n\u003cp\u003e“I have more than a hundred paintings of Ji Ning, so I recognized him at one glance,” Cangwu Jiu said confidently.\u003c/p\u003e\n\u003cp\u003eNing and Yu Wei exchanged a glance.\u003c/p\u003e\n\u003cp\u003eFrom the way the two were chatting to each other and from how calm they were, it was clear that they were very confident.\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-sister, don’t fight them head on. Use your phoenixes to attack them, while I’ll tie them up for a while. You flee first, then I’ll come afterwards,” Ning sent. Yu Wei nodded as well. She knew that if it weren’t for her, it would be much easier for Ning to flee, but with her here… although their attack power was greater, fleeing became trickier.\u003c/p\u003e\n\u003cp\u003eAs Ning and Yu Wei were chatting mentally…\u003c/p\u003e\n\u003cp\u003e“Hand over your talismans, and I’ll spare your lives!” Cangwu Jiu’s voice suddenly turned sharp, and his mental message echoed in Ning and Yu Wei’s minds. Cangwu Jiu charged forward, and suddenly in midair a massive black vulture that was three hundred meters long suddenly appeared. The plumes of the black vulture glowed with an oily light, and its eyes seemed almost alive as it dove forward with a screech.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-12-chapter-9\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-12-chapter-11\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-12-chapter-10","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
