{"id":50038,"no":341,"title":"Book 12, Chapter 24 - The Sloppy Daoist Against Adept Ninedeaths","content":"\u003cp\u003eWhile Ji Ning and the rest of the twelve were in secluded meditation and training within the world of the Brightmoon Diagram of the Mountains and Rivers. The imperial citadel’s plaza.\u003c/p\u003e\n\u003cp\u003eTwelve names repeatedly came up in conversations: Xiamang Zishan, Cangwu Jiu, Ji Ning, Sloppy Daoist, Youngflame Zhan, Adept Woodpass, Adept Blackstone, Adept Ninedeaths, Adept Whitedragon, Adept Unicosmo, Adept Primalback, Adept Goldcrow.\u003c/p\u003e\n\u003cp\u003e“The top twelve have been determined.”\u003c/p\u003e\n\u003cp\u003e“Our South Seas have Adept Woodpass.”\u003c/p\u003e\n\u003cp\u003e“Our North Seas have Adept Goldcrow!”\u003c/p\u003e\n\u003cp\u003e“Our Quchang Commandery has Adept Whitedragon.”\u003c/p\u003e\n\u003cp\u003e“You guys are nothing. Our Stillwater Commandery has two people; Ji Ning and the Sloppy Daoist!”\u003c/p\u003e\n\u003cp\u003eOnly twelve finalists had emerged from the 3600 commanderies. Two of them belonged to Stillwater Commandery, and both were from the Black-White College!\u003c/p\u003e\n\u003cp\u003eImmortal Fivecraze was grinning so broadly his jaw was almost crooked. Clutching a calabash of wine, he gulped it down happily, occasionally chatting through divine sense.\u003c/p\u003e\n\u003cp\u003e“Oh, you are the leader of the Myriad Beasts School? Haha, yup, I’m Fivecraze. Yup, Ji Ning and little Sloppy both belong to our Black-White College. To be honest, Yu Wei of our Black-White College was poisoned; otherwise, she would’ve made it into the top ninety six as well. She might have even entered the top twelve! What? You would like to get to know the disciples of our Black-White College? You want to go spend some time viewing the Black-White Diagram within the Black-White College? Sure, no problem! How about letting the disciples of our Black-White College also go take a look at the ten thousand beasts of your school?”\u003c/p\u003e\n\u003cp\u003e“Xiangtian clan? Your Xiangtian clan wishes to send its disciples to the Black-White College? But, but…the Black-White College is in Stillwater Commandery, after all. We have very little room, and it’s not convenient for us to have too many disciples! That’s why we are extremely strict whenever we take on new students. What’s that? Your Xiangtian clan wishes to send an envoy delegation to the Black-White College? No problem. Our Black-White College will definitely take good care of them.”\u003c/p\u003e\n\u003cp\u003eMany people had come to seek out Immortal Fivecraze.\u003c/p\u003e\n\u003cp\u003eIt must be understood that the Xiangtian clan and the Myriad Beasts School were some of the most supremely powerful schools in the entire Grand Xia Dynasty. They had all learned from their Celestial Immortal Patriarchs that the Sloppy Daoist was the disciple of Grand Emperor Xuanwu. Given how outstanding Ji Ning was as well…all of the major powers were puzzled.\u003c/p\u003e\n\u003cp\u003e“For a small school to suddenly produce one outstanding genius is one thing; that can just be attributed to luck. But they actually produced two! The entire Grand Xia Dynasty has only twelve on their level…and one of them is the disciple of Grand Emperor Xuanwu. I imagine that this Black-White College must be one of the places within our Grand Xia Dynasty where luck is gathering and flourishing.”\u003c/p\u003e\n\u003cp\u003e“It must be a place of tremendously positive karmic luck.”\u003c/p\u003e\n\u003cp\u003eMany major powers came to this conclusion.\u003c/p\u003e\n\u003cp\u003eLuck; it couldn’t be seen, nor could it be touched. But some places were just naturally lucky! When the imperial capital of the Grand Xia had been built, the Grand Xia Emperor had invited a major power to personally choose a site with great karmic luck to build on, then set up a grand formation that guarded the entire world from the site.\u003c/p\u003e\n\u003cp\u003e“We have to send our disciples over there. When they train in a place of such karmic luck, they too will be blessed by luck.”\u003c/p\u003e\n\u003cp\u003e“Right. We also need to go spend some time observing the Black-White Diagram of this Black-White College.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe main hall of the Skylight Palace. An hour had passed.\u003c/p\u003e\n\u003cp\u003eThe Grand Xia Emperor sat above all others atop his throne. With a wave of his arm, a furled scroll appeared in his palm. It was the Pure Yang treasure, the Brightmoon Diagram of the Mountains and Rivers. The scroll opened, and twelve streaks of light flew out and landed on the ground. It was Ji Ning, the Sloppy Daoist, and the rest of the twelve.\u003c/p\u003e\n\u003cp\u003e“We prostrate ourselves before you, your Imperial Majesty,” Ning and the others said as they all fell to their knees.\u003c/p\u003e\n\u003cp\u003e“Mm.”\u003c/p\u003e\n\u003cp\u003eThe Grand Xia Emperor glanced at them, then nodded in satisfaction. He could vaguely sense that after three days of quiet training, all twelve of these had made some improvements. Some of them had improved considerably.\u003c/p\u003e\n\u003cp\u003e“This is now the most important part of this Conclave. Three of you shall emerge from the twelve…and one of the three shall definitely be chosen by my master as a disciple,” the Xia Emperor said. “There is no time to waste. Let the first battle in the fourth round of duels begin. Let us have the Sloppy Daoist of the Black-White College fight against the unaffiliated Adept Ninedeaths. The others can all rest, watch, and prepare for their own duels.”\u003c/p\u003e\n\u003cp\u003eNing, Xiamang Zishan, and the others were all surprised.\u003c/p\u003e\n\u003cp\u003eThe Sloppy Daoist against Adept Ninedeaths?\u003c/p\u003e\n\u003cp\u003eAdept Ninedeaths was extremely strong, and she had yet to unleash all of her full power. As for the Sloppy Daoist, the Celestial Immortals had all gushed over him endlessly. Xiamang Zishan and the others had all heard their respective Celestial Immortal Patriarchs praise the Sloppy Daoist and warn them to be wary of him. It was as though the Sloppy Daoist was the strongest amongst them.\u003c/p\u003e\n\u003cp\u003eDue to the warnings of their Celestial Immortal Patriarchs, all of them were paying very close attention to the Sloppy Daoist.\u003c/p\u003e\n\u003cp\u003eSloppy against Ninedeaths? So soon?\u003c/p\u003e\n\u003cp\u003eAs for the Sloppy Daoist and Adept Ninedeaths, they each gave the other a glance, then walked out from the main hall and towards the grand sealing formation.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe nine Pure Yang True Immortals seated at the front of the main hall of the Skylight Palace began to argue amongst each other.\u003c/p\u003e\n\u003cp\u003e“Xiamang, is something wrong with your head?” Truelord Chiji said with a frown, “This is just the fourth round, meant to determine the top six; why are you pitting the Sloppy Daoist against Adept Ninedeaths? Adept Ninedeaths has mastered five complete Dao-Paths long ago, and her divine abilities and training techniques are all incredibly powerful. Her might is significant! She should rank amongst the very top, and definitely has a chance to become number one. The Sloppy Daoist is the disciple of Grand Emperor Xuanwu; he should rank at the top as well, and also has a chance to become number one. For you to have them fight now…that means one of them will have to be discarded prematurely.”\u003c/p\u003e\n\u003cp\u003e“It is indeed too early. It isn’t appropriate to have the two of them compete so soon.” Bodhisattva Mahasthamaprapta slowly spoke out as well.\u003c/p\u003e\n\u003cp\u003e“Do all of you think that I can’t tell that Adept Ninedeaths is powerful?” The Xia Emperor shook his head.\u003c/p\u003e\n\u003cp\u003e“Xiamang has his own difficulties.” Lu Dongbin shook his head. “Actually, by now, I have a favorable impression of eight…but six must be eliminated! Thus, no matter how you match them up, at least two of the eight I like will be eliminated.”\u003c/p\u003e\n\u003cp\u003eThe Xia Emperor nodded. “Right. By now, of these twelve, I have a particularly favorable impression of Xiamang Zishan of my own clan, Ji Ning, Adept Goldcrow, Adept Woodpass, Adept Blackstone, the Sloppy Daoist, and Adept Ninedeaths! No matter how I match them up, two of these seven will have to end up fighting each other. I pondered for a long time about what to do. The Sloppy Daoist is already the disciple of Grand Emperor Xuanwu; Master definitely won’t try to steal someone else’s disciple. As for Adept Ninedeaths, she’s the only female amongst the seven. They stood out. So, I ended up deciding to stop worrying about it and just have the Sloppy Daoist and Adept Ninedeaths fight. Whoever wins will stay behind.”\u003c/p\u003e\n\u003cp\u003e“That’s quite decisive of you.”\u003c/p\u003e\n\u003cp\u003e“The reason you are having Adept Ninedeaths fight the Sloppy Daoist is actually because she’s female?” The other Pure Yang True Immortals couldn’t help but laugh.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing, Yu Wei, and Yuchi Xiyue were all behind King Yan. They were staring at the distant grand sealing formation outside the hall. Within the formation, there were two individuals; a sloppy, chubby youth and a similarly dirty maiden.\u003c/p\u003e\n\u003cp\u003e“Both of them are incomparably slovenly. They are a good match,” Yuchi Xiyue whispered.\u003c/p\u003e\n\u003cp\u003e“But both are very powerful,” Yu Wei praised.\u003c/p\u003e\n\u003cp\u003e“They are indeed. When Adept Ninedeaths puts on those silver gloves, even I can’t tell how great her power is. Although I fought against her previously, she hadn’t used that magic treasure at all.” Ning watched carefully. “Eldest apprentice-brother’s power is unfathomable as well. It’s hard to say who will win.”\u003c/p\u003e\n\u003cp\u003eThey were all staring at this battle. The Pure Yang True Immortals were paying absolute attention as well.\u003c/p\u003e\n\u003cp\u003eThe Sloppy Daoist? A disciple of Grand Emperor Xuanwu.\u003c/p\u003e\n\u003cp\u003eAdept Ninedeaths? Everyone had noticed long ago that she was one of the two masters of five Dao-Paths, and she had a body like a magic treasure.\u003c/p\u003e\n\u003cp\u003e“They are starting.” Yuchi Xiyue stared intently.\u003c/p\u003e\n\u003cp\u003eNing’s eyes instantly narrowed. “They are finally showing their powers. Adept Ninedeaths…she truly is frightening.” Till now, Adept Ninedeaths had never before revealed her full power. When she had fought Ning, she had mainly focused on tying him down. But this time, in her duel against the Sloppy Daoist, she actively launched a sudden, violent attack.\u003c/p\u003e\n\u003cp\u003eGloves on hands, Adept Ninedeaths six arms had become six incomparably fierce weapons!\u003c/p\u003e\n\u003cp\u003eAttack!\u003c/p\u003e\n\u003cp\u003eSometimes, her hands hacked down like blades with invincible sharpness.\u003c/p\u003e\n\u003cp\u003eAt other times, they glided like water, swirling about in a soft, circular manner.\u003c/p\u003e\n\u003cp\u003eAdept Ninedeaths circled around the Sloppy Daoist, attacking wildly. The two of them both used their divine abilities, both having transformed into three-headed, six-armed giants.\u003c/p\u003e\n\u003cp\u003e“Which Grand Dao is this?” Ning frowned. The attacks of Adept Ninedeaths were extremely strange. They created an extremely uncomfortable stifling feeling, while her own attacks were constantly fluctuating in style in an unfathomable manner. “It shouldn’t be an especially well-known one. I, at least, have never seen this Grand Dao.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“The Grand Dao of Mortality [1. Literally, life/death]! This little girl truly is quite ambitious. The Grand Dao of Mortality…it is one of the most supreme of the many Grand Daos. It is extremely hard to train in. She actually dares to trod on this Grand Dao?” Lu Dongbin shook his head with a sigh. “But if she reaches a certain level in this Grand Dao, then overcoming the Celestial Tribulation will become significantly easier by comparison.”\u003c/p\u003e\n\u003cp\u003eThe Grand Daos of Taiji, the Sword, and the Saber were all technique-focused Daos!\u003c/p\u003e\n\u003cp\u003eBy contrast, the Grand Dao of Mortality contained the infinite mysteries of life and death within it, as well as the technical principles regarding how life and death interchanged.\u003c/p\u003e\n\u003cp\u003eIt was a Grand Dao that not only contained many profound mysteries, but also ways to apply techniques! It was extremely difficult to train in, even more so than the Daos of the Sword or the Saber.\u003c/p\u003e\n\u003cp\u003e“Interesting.”\u003c/p\u003e\n\u003cp\u003e“This little lass truly is formidable.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAdept Ninedeaths attacked wildly, occasionally becoming as savage and vicious as a God of Death, while at other times seeming to be as gentle and soft as the caress of a mother. The interchange and the linkages between life and death…they caused even the Sloppy Daoist to be suppressed for a period of time.\u003c/p\u003e\n\u003cp\u003eHowever…\u003c/p\u003e\n\u003cp\u003eThe Sloppy Daoist was truly too stable and unshakeable. When executing the Grand Black Tortoise divine ability, he also executed his Grand Dao of Taiji.\u003c/p\u003e\n\u003cp\u003eThe Sloppy Daoist seemed to have transformed into a whirling and spinning turtle-shell. His defense was absolutely impregnable. The Grand Black Tortoise divine ability was exceptionally suited for defense, and the Grand Dao of Taiji was also extremely suited for defense.\u003c/p\u003e\n\u003cp\u003e“Damn.” Adept Ninedeaths let out a furious growl as she grew even more berserk.\u003c/p\u003e\n\u003cp\u003eBy contrast, the Sloppy Daoist was incomparably relaxed and leisurely. His six arms seemed to have transformed into the spokes of an enormous windmill, blocking one attack after another.\u003c/p\u003e\n\u003cp\u003eHISS!\u003c/p\u003e\n\u003cp\u003eA sound like the hissing of a serpent.\u003c/p\u003e\n\u003cp\u003eThe Sloppy Daoist had been defending this entire time, his guard as tight as a turtle shell, allowing the opponent no flaws to slip attacks through. All of a sudden, his arm came slamming out! His hand struck out in a serpentine stance, viciously stabbing forth! As it did, it just so happened to strike at a flaw in the stances of the frantically attacking Adept Ninedeaths, tearing her arm apart at the shoulder and sending it flying off.\u003c/p\u003e\n\u003cp\u003eSlash…\u003c/p\u003e\n\u003cp\u003eAfter his first attack, the Sloppy Daoist suddenly exploded with power. He charged forth with the power of a formerly dormant volcano that was suddenly exploding, and his six arms had all transformed into vipers that moved with strange savagery.\u003c/p\u003e\n\u003cp\u003eHis defense had been completely impregnable. His attacks…they were as terrifying as the strikes of a viper.\u003c/p\u003e\n\u003cp\u003e“Perfect. I was afraid you’d keep hiding!” Adept Ninedeaths wasn’t startled; in fact, she was delighted. If her opponent had continued to defend, he might have been able to exhaust her divine power. That would be an unfair way to lose! Adept Ninedeaths immediately moved forward to exchange blows, and her severed arm was quickly regrowing.\u003c/p\u003e\n\u003cp\u003eBoth of them truly did have the power to contend for the number one position!\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-12-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-12-chapter-25\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-12-chapter-24","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
