{"id":50060,"no":363,"title":"Book 13, Chapter 6 - Puny","content":"\u003cp\u003eOutside the Divinities Palace.\u003c/p\u003e\n\u003cp\u003e“All of you, step back,” Silvermoon instructed. All of the disciples of Mount Innerheart present all hurriedly departed from the empty region.\u003c/p\u003e\n\u003cp\u003eSilvermoon waved his arm, and a golem that was more than three meters tall appeared out of nowhere. The golem’s body seemed completely metallic, and its arm had six hoops around it.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother, this is the sixth golem,” Silvermoon said.\u003c/p\u003e\n\u003cp\u003e“Thank you, senior apprentice-brother.” Ning was filled with anticipation.\u003c/p\u003e\n\u003cp\u003eSilvermoon, the Whitewater Hound, and Little Qing immediately left the dueling grounds. As for the other Mount Innerheart disciples, they all revealed looks of amazement and curiosity.\u003c/p\u003e\n\u003cp\u003e“Uncle-master is going to duel a golem.”\u003c/p\u003e\n\u003cp\u003e“The Patriarch is about to show his power!”\u003c/p\u003e\n\u003cp\u003e“The Little Patriarch is immediately challenging the sixth golem upon arriving at the power. I imagine that he’s pretty confident in being able to defeat it. He’s only a Wanxiang Adept, but he actually dares to fight the sixth golem. What level of insight into the Dao must the Little Patriarch have reached?! No wonder Patriarch Subhuti took him as a disciple. He truly is a peerless monster.”\u003c/p\u003e\n\u003cp\u003e“I’ve been on the mountain for thousands of years, but I’m still unable to defeat the sixth golem. I had to serve as a novitiate in order to acquire an eighth level Divinities Palace technique,” an old Void-level Diremonster growled.\u003c/p\u003e\n\u003cp\u003e“Challenging the sixth golem as soon as he comes up the mountain? Formidable, formidable indeed. Even in the major world from whence I come, it is rare for such a peerless genius to come in countless lifetimes.”\u003c/p\u003e\n\u003cp\u003eThese humans, monsters, and Fiendgods all spoke out in praise. As they saw it, since Ning had been chosen by Patriarch Subhuti as his disciple, he was assuredly extraordinary. In addition, that old demon Silvermoon, the manager of this Divinities Palace, was also a personal disciple of Patriarch Subhuti. Since he chose the sixth golem for Ning, he probably felt confident that Ning could beat it.\u003c/p\u003e\n\u003cp\u003e“Formidable.”\u003c/p\u003e\n\u003cp\u003e“A peerless genius.”\u003c/p\u003e\n\u003cp\u003e“Incredible.”\u003c/p\u003e\n\u003cp\u003eThe disciples of Mount Innerheart were all filled with eagerness as they waited to watch.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe trial grounds. Ning was exchanging stares with the distant sixth golem. From far away, Little Qing was cheering, “Master, master, beat the snot out of that golem!”\u003c/p\u003e\n\u003cp\u003e“Little Wanxiang kid, if you want to beat me, bring out your power.” The three meter tall golem growled, then waved his hand as a longsword suddenly appeared within it.\u003c/p\u003e\n\u003cp\u003e“Good.” A Darknorth sword appeared in each of Ning’s hands as well.\u003c/p\u003e\n\u003cp\u003e“Kill!” Ning instantly charged forward.\u003c/p\u003e\n\u003cp\u003eAll of the disciples of Mount Innerheart present, as well as the old demon Silvermoon, were watching this battle carefully.\u003c/p\u003e\n\u003cp\u003eAfter having mastered the Dao-Path of the Gale, Ning’s speed had become incredibly fast; he blew forward like a gust of wind and arrived before the sixth golem, and his Darknorth swords instantly struck out like two streaks of dazzling sword-light.\u003c/p\u003e\n\u003cp\u003eAfter experiencing the [Thousand Year Dream], Ning’s sword-arts had clearly become firmer and more stable, and his movements were more pure and exquisite as well.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe golem struck out with its longsword, and the earth itself seemed to tremble. The longsword actually came smashing down with the weight of a mountain, and Ning could even see with his naked eyes the vague illusion of massive mountains appearing around it. The might and aura of this sword stance caused Ning to feel completely awestruck.\u003c/p\u003e\n\u003cp\u003e“Not good. The difference in power is too great!” Ning, upon seeing the illusion of massive mountains which had manifested around the golem’s sword-chop, instantly felt completely unable to resist. The profoundness of the attack’s formless Dao…\u003c/p\u003e\n\u003cp\u003eHis own two chopping streaks of sword-light became as thin as silken, becoming incomparably soft.\u003c/p\u003e\n\u003cp\u003eBOOM!!!\u003c/p\u003e\n\u003cp\u003eThe golem’s longsword smashed down upon Ning’s twin Darknorth swords. A surge of invincible power crushed downwards, and Ning was sent flying through the air like a meteor. He only stopped when he arrived at the edge of the trial grounds, where a nearly invisible barrier hovered in the air. The barrier blocked Ning’s fall, but his two Darknorth swords were also sent flying into the air, and they then smashed against the restrictive barrier and fell to the ground.\u003c/p\u003e\n\u003cp\u003e“I admit defeat,” Ning hurriedly called out. The flesh on his two hands had been completely split open, and blood was leaking everywhere.\u003c/p\u003e\n\u003cp\u003eJust a single exchange of blows…but his sword had actually been knocked flying. This difference in power was simply too enormous.\u003c/p\u003e\n\u003cp\u003e“Uh…”\u003c/p\u003e\n\u003cp\u003e“Um…”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003eThe many disciples of Mount Innerheart who were watching outside the trial grounds, be they human, monster, or Fiendgod, all were completely flabbergasted at what they had just seen. They blinked.\u003c/p\u003e\n\u003cp\u003eAs they saw it, Ning was the chosen of Patriarch Subhuti, and so he surely must be extraordinary! Even when these other disciples had first arrived on the mountain, they were generally able to defeat the second or third golem. Some of the more powerful ones were able to defeat the fourth or even the fifth golem. None of the ones present had been able to defeat the sixth golem right away, but over the course of Mount Innerheart’s many years of history there had been some who had defeated the sixth golem upon arriving.\u003c/p\u003e\n\u003cp\u003eThe statuses of these disciples were far lower than Ning’s. Ning was the Patriarch’s disciple! All of the other disciples believed that Ning was going to make a miracle happen.\u003c/p\u003e\n\u003cp\u003eBut unfortunately…this ‘exceptionally extraordinary’ Ji Ning was actually defeated in one blow. He wasn’t even able to fight back!\u003c/p\u003e\n\u003cp\u003e“Master!” Little Qing looked towards Ning, tight feelings appearing in her chest. Her master was the number one figure in his Conclave, and she had thought for certain that her master was going to dazzle everyone with his power upon arriving at Mount Innerheart. But he had actually been defeated so miserably. “Master must be feeling horrible right now! And there were so many Mount Innerheart disciples watching! That despicable old bastard, Silvermoon…he’s the one who told Master to fight against the sixth golem!”\u003c/p\u003e\n\u003cp\u003e“Ning, child…” The Whitewater Hound had not expected this either.\u003c/p\u003e\n\u003cp\u003e“Uh.” The fan-wielding Silvermoon hastily waved his arm, collecting up the sixth golem. He hurriedly ran over. “Junior apprentice-brother, this, uh, I didn’t, I…I didn’t know exactly how strong you were, but since Master took you on as a new disciple, I…”\u003c/p\u003e\n\u003cp\u003eSilvermoon hadn’t done this on purpose. He knew exactly how stringent and exacting Patriarch Subhuti’s requirements for accepting new disciples were. Those who were accepted as disciples before becoming Celestial Immortals or Empyrean Gods were all incredible talented, so monstrously skilled as to cause utter terror! Thus, he had guessed that this new junior apprentice-brother of his, Ji Ning, should be able to give the sixth golem a good fight. Even if he were to be defeated, he should have been able to fight for quite a long time before losing. He hadn’t expected at all that Ning would be defeated with a single blow and that he wouldn’t be able to fight back at all.\u003c/p\u003e\n\u003cp\u003e“It isn’t your fault, senior apprentice-brother.” Ning shook his head. He could tell that the spectating humans, monsters, and Fiendgods all had a look of surprise, puzzlement, and even hidden disdain in their eyes. Clearly, these Immortal cultivators cared about strength the most; even though his status was high, if he wasn’t strong enough, others would still look down on him in their hearts.\u003c/p\u003e\n\u003cp\u003e“It was simply that I was not strong enough,” Ning said. “The sixth golem truly does vastly surpass my current limits.”\u003c/p\u003e\n\u003cp\u003e“It was my fault,” Silvermoon said hurriedly. This junior apprentice-brother had suffered such a huge defeat in his first trial upon coming up the mountain…and he had been the one who had chosen the opponent. He naturally felt extremely ashamed. He hurriedly said, “Given the sword techniques you displayed, you definitely would have no problems defeating the third golem, and as for the fourth golem…you have a chance as well. Which one would you like to choose?”\u003c/p\u003e\n\u003cp\u003e“The fourth golem,” Ning said.\u003c/p\u003e\n\u003cp\u003e“How about you take a break, then fight?” Silvermoon asked.\u003c/p\u003e\n\u003cp\u003eNing shook his head and chuckled. “I was instantly defeated in that earlier battle. I used up almost no divine power at all, as a result. There’s no need to rest.”\u003c/p\u003e\n\u003cp\u003eSilvermoon, seeing the smile on Ning’s face, couldn’t help but nod mentally to himself. This junior apprentice-brother had an impressive mentality; he had been defeated in front of so many watchers during his very first trial, but he remained quite calm.\u003c/p\u003e\n\u003cp\u003e“Alright.” Silvermoon nodded, then waved his arm. Yet another golem, a fiery red golem, appeared within the battlefield. This golem had four circlets around its arm.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“This uncle-master, Ji Ning, seems to be ordinary in power. He was actually completely unable to fight back against the sixth golem.”\u003c/p\u003e\n\u003cp\u003e“Right. He’s quite puny.”\u003c/p\u003e\n\u003cp\u003e“Puny my ass. When you came up the mountain, you probably would’ve been defeated by the sixth golem in one blow as well.”\u003c/p\u003e\n\u003cp\u003e“I’m just my Master’s spirit-beast, while Ji Ning is the Old Patriarch’s disciple. I even have to address him as Patriarch! How can you compare the two of us? When I first arrived, I was also able to defeat the fourth golem.”\u003c/p\u003e\n\u003cp\u003e“Look, it is starting.”\u003c/p\u003e\n\u003cp\u003e“The Patriarch is starting to fight against the fourth golem.”\u003c/p\u003e\n\u003cp\u003eThe disciples of Mount Innerheart had all originally been filled with admiration towards Ning, but now they found out…that this Ji Ning was rather so-so! In fact, compared to the rest of them when they had first arrived in the mountain, Ning’s performance was average at best. He was completely unremarkable!\u003c/p\u003e\n\u003cp\u003eActually…many of these other disciples were the personal disciples that had been accepted by True Immortals or Empyrean Gods! They, too, were truly first-rate geniuses which the True Immortals and Empyrean Gods had chosen from throughout the Three Realms. Not even the likes of Adept Blackstone or Adept Ninedeaths would necessarily be chosen by True Immortals or Empyrean Gods; from this, one could imagine how much talent and comprehension ability these disciples possessed.\u003c/p\u003e\n\u003cp\u003eSome disciples were disciples of Celestial Immortals!\u003c/p\u003e\n\u003cp\u003eSome were spirit-beasts!\u003c/p\u003e\n\u003cp\u003eOthers were Fiendgod servants!\u003c/p\u003e\n\u003cp\u003eSome of them had merely been at the Wanxiang level when arriving at the mountain. Some had already reached the Primal level. Some had even reached the Void level!\u003c/p\u003e\n\u003cp\u003eSome Void-level Fiendgods had lived for an incredibly long time, and were born with a very high level of insight into the Dao. It was normal for them to be able to defeat the fifth golem or sixth golem. As for the disciples of Celestial Immortals, they were also quite extraordinarily talented, and could absolutely compare to the likes of Cangwu Jiu or Adept Blackstone.\u003c/p\u003e\n\u003cp\u003eThus…the vast majority of these disciples who had to refer to Ning as ‘uncle-master’ or ‘Patriarch’ were, in reality, the peerless geniuses of the major worlds they came from! Some were even more monstrously formidable than that!\u003c/p\u003e\n\u003cp\u003e“But this Patriarch’s sword-arts aren’t bad. It seems he should be able to defeat the fourth golem.”\u003c/p\u003e\n\u003cp\u003e“Right. He should be able to beat the fourth golem…but just barely.”\u003c/p\u003e\n\u003cp\u003e“Right. Just barely.”\u003c/p\u003e\n\u003cp\u003eThe disciples of Mount Innerheart all gave their evaluation. Towards this Ji Ning, the disciple of the Old Patriarch who had an incredibly high status…they no longer felt too much reverence for him.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSlash!\u003c/p\u003e\n\u003cp\u003eA streak of sword-light plunged into the golem’s chest. It didn’t even sink in a single inch before it became unable to go in any deeper.\u003c/p\u003e\n\u003cp\u003eThe golem came to a complete halt. It stared at Ning unmovingly, then said in a low voice, “You won.”\u003c/p\u003e\n\u003cp\u003eThese golems were non-living creatures; even Void-level Fiendgods that fought against them would be unable to destroy them. Thus…being able to break through their outer layer of protection was enough to symbolize victory.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother, you can now go to the fourth floor of the Divinities Palace and choose a technique at will,” the fan-holding Silvermoon said with a smile as he walked over. With a wave of his hand, he collected the golem again.\u003c/p\u003e\n\u003cp\u003eNing smiled. Fortunately, he had experienced the [Thousand Year Dream] earlier; his sword-arts had indeed stabilized and become more firm, and his execution of them had become more profound and unpredictable as well. That was the only reason why he was able to defeat the fourth golem. Otherwise…he would have probably only been able to beat the third golem.\u003c/p\u003e\n\u003cp\u003eThis was as he had expected. After all, he had been forbidden from using any divine abilities, resulting in his greatest source of power, the [Starseizing Hand], being unusable. His power would naturally be much lower as a result!\u003c/p\u003e\n\u003cp\u003eAlthough he had become the champion of his Conclave of Immortal Destiny, he was actually a bit weaker than Cangwu Jiu, Xiamang Zishan, and the others when it came to his comprehension of the Dao. He had only become champion thanks to the [Starseizing Hand].\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-brother, when ordinary disciples of Mount Innerheart first arrive at the mountain, which golem are they generally able to beat?” Ning asked.\u003c/p\u003e\n\u003cp\u003e“The newcomers are sometimes a bit weaker while sometimes a bit stronger. On the whole, they are on par with you, I suppose. However, they have generally trained for centuries before arriving, while some have trained for thousands or tens of thousands of years,” Silvermoon said. As they chatted, the sound around them was blocked from transmitting to others.\u003c/p\u003e\n\u003cp\u003eNing laughed. “Given how many years the ordinary disciples have been in the mountain, they are definitely more powerful than they were in the past. It seems I am the weakest person here at Mount Innerheart.”\u003c/p\u003e\n\u003cp\u003eStill…Ning continued to feel complete confidence in himself. He had only trained for thirty years, and had just arrived at the mountain. After a hundred years, he would definitely be able to surpass them all! And he also had the [Starseizing Hand] in reserve! In these trials against golems, since his divine abilities were unusable, his greatest advantage had been neutralized.\u003c/p\u003e\n\u003cp\u003eStill…no matter what, compared to the ordinary disciples of Mount Innerheart, he was at the bottom of the barrel.\u003c/p\u003e\n\u003cp\u003eA thirty thousand meter tower starts from the ground. He still had to work hard!\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-13-chapter-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-13-chapter-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-13-chapter-6","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
