{"id":50128,"no":431,"title":"Book 15, Chapter 8 - A Sense of Danger","content":"\u003cp\u003eThe alluring woman nodded. “Understood. I always thought that the world of the Grand Xia wasn’t that powerful. The world of Mount Stele, for example, has three True Immortals or Empyrean Gods.”\u003c/p\u003e\n\u003cp\u003e“The world of the Grand Xia is blessed by tremendous luck; in all of the Three Realms, it ranks at the very top. Given that such a major world has been completely unified…how could it be weaker than the likes of the Mount Stele world?” The Cavemaster shook his head. “You have to understand that in order to unify a major world, the unifier has to have either tremendous personal power or an extremely significant background.”\u003c/p\u003e\n\u003cp\u003e“Oh. Then, Master…that Ji Ning…what should we do to him?” The alluring woman asked.\u003c/p\u003e\n\u003cp\u003e“He trained in the [Eight-Nine Arcane Art], which means that his master is one of the most supreme of Daofathers.” The Cavemaster laughed. “However…it doesn’t matter who his master is, because he definitely isn’t on our side. If Ji Ning is allowed to develop within the world of the Grand Xia, he’ll just end up being a source of serious trouble to us. Ideally, we should kill him right away! Even the Daofather behind him would probably have to seriously consider whether or not it is worth it for him to get involved for the sake of a single disciple.”\u003c/p\u003e\n\u003cp\u003e“How should we kill him?” The alluring woman asked.\u003c/p\u003e\n\u003cp\u003e“Our Myriad Demons Cave is responsible for manufacturing golems. Fighting and killing isn’t our field of responsibility. Killing enemies will be rewarded, if we don’t fight, that’s fine as well.” The Cavemaster laughed, “Since even Buchasi was unable to do anything to Ji Ning, he’s definitely going to be a tough nut to crack. Leave it to the Seamless Gate. Disciple, make a trip on my behalf to speak with the Gatemaster of the Seamless Gate. Have them kill Ji Ning, this unexpected variable, as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Yes.” The alluring woman respectfully assented to the order…and then she left the palace.\u003c/p\u003e\n\u003cp\u003eThis commandery city was enormous, and it was divided into many regions. The insides of the city were tightly guarded. This alluring woman was a beloved disciple of the Cavemaster of the Myriad Demons Cave, and her status was comparable to an ordinary Celestial Immortal’s. Thus, she was able to quickly arrive at the closest local headquarters of the Seamless Gate.\u003c/p\u003e\n\u003cp\u003eThe Grand Xia Dynasty had been searching for the headquarters of the Seamless Gate this entire time to no avail.\u003c/p\u003e\n\u003cp\u003eThis was because…the Seamless Gate’s headquarters was located within this world, the Fifth World. This Fifth World was so powerful that even Celestial Immortals who dared to barge in would be instantly slain. If a True Immortal or Empyrean God entered, then immediately moved to flee, they might be able to escape…but if they tried to fight head-on, they would probably perish as well.\u003c/p\u003e\n\u003cp\u003eFigures could often be seen flying about in the air above the commandery city. Anyone who dared fly within a commandery city of the Fifth World had to be at least at the Celestial Immortal level. There were so many Celestial Immortals here that one could usually see at least ten thousand figures flying about in the skies. The total number of Celestial Immortals present was truly astonishing.\u003c/p\u003e\n\u003cp\u003eIn truth, the Cavemaster of the Myriad Demons Cave and the Gatemaster of the Seamless Gate were all just a very small part of the full power of the Fifth World.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Silkworm greets you, Gatemaster,” the alluring woman said respectfully.\u003c/p\u003e\n\u003cp\u003e“What is it?” An azure-robed woman with long, unbound hair was seated in the lotus position, her eyes shut. She was the Gatemaster of the Seamless Gate. By her side were two standing maidservants.\u003c/p\u003e\n\u003cp\u003eThe alluring woman said respectfully, “This matter involves someone named Ji Ning…”\u003c/p\u003e\n\u003cp\u003eShe told the entire tale from start to finish with great detail.\u003c/p\u003e\n\u003cp\u003e“Your master’s assignment is the same as mine; we have been assigned the worlds of the Grand Xia, Mount Stele, and Dreamsong.” The azure-robed woman opened her eyes, then said calmly, “The toughest world to invade is the world of the Grand Xia…but your Myriad Demons Cave has actually made committed an error like this, making this assignment even harder to complete. And now, you want my Seamless Gate to wipe your ass for you and clean this up? Still…since your master has made the request, I’ll accept. Go back and say this…say…‘Old crow, if you can’t even accomplish a task like forging golems, I think you should let someone else take over your job.’”\u003c/p\u003e\n\u003cp\u003eThe alluring woman’s face changed, but she didn’t dare argue back. She said respectfully, “Yes.”\u003c/p\u003e\n\u003cp\u003e“Go,” the azure-robed woman said calmly.\u003c/p\u003e\n\u003cp\u003eThe alluring woman immediately departed.\u003c/p\u003e\n\u003cp\u003eThe azure-robed woman called out, “Violetgrass.”\u003c/p\u003e\n\u003cp\u003e“Gatemaster.” One of the two nearby maidens, the one whose face was covered with a violet flowery tattoo, hurriedly called out with respect.\u003c/p\u003e\n\u003cp\u003e“You heard it all. I’m leaving this matter regarding Ji Ning for you to handle. How to deal with him, what arrangements to make; it is all completely up to you. You’ve followed me for many years, and you are quite familiar with our affairs in the Grand Xia. Although this is a somewhat troublesome assignment, I trust that you will be able to complete it well.” The azure-robed woman’s voice and tone was much kinder than before; clearly, she doted on this servant of hers very much.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, Master. I know Ji Ning quite well; I have plenty of ways to deal with him,” Violetgrass said respectfully.\u003c/p\u003e\n\u003cp\u003e“Good. Go make your preparations, then head to the major world of the Grand Xia,” the violet-robed woman instructed.\u003c/p\u003e\n\u003cp\u003eThat very day. The maiden, dressed in a golden robe that was embroidered with images of violet grass and flowers, led nine Celestial Immortals to quietly depart from the Fifth World and go to the world of the Grand Xia.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eStillwater Commandery. A desolate area that was hundreds of thousands of kilometers away from Stillwater City. There was a beautiful lake here, with a wooden house next to it.\u003c/p\u003e\n\u003cp\u003eIt was already dusk.\u003c/p\u003e\n\u003cp\u003eTwo figures appeared in the air here, then landed on the ground.\u003c/p\u003e\n\u003cp\u003e“Little Xia…we’re back.” Mu Northson cupped that soultamer jade globe in his hands as he spoke out softly.\u003c/p\u003e\n\u003cp\u003e“The grass here had been completely destroyed, but it’s all grown back now.” A woman’s voice came out from the jade globe; she was very happy right now. “Fortunately, that battle didn’t end up damaging our house.”\u003c/p\u003e\n\u003cp\u003eNorthson looked towards the wooden house as well.\u003c/p\u003e\n\u003cp\u003eHe had personally chopped the wood and built that house, using some of his skill in the Dao of Constructs as he did so. Thus, despite the passage of twenty years, the wooden house remained in perfect condition. In fact, weaker individuals wouldn’t even be able to go inside it.\u003c/p\u003e\n\u003cp\u003e“It wasn’t damaged, but that was because we were too weak back them. Thus, we were captured effortlessly by those black-robed figures,” Northson laughed.\u003c/p\u003e\n\u003cp\u003e“We’re finally free. We’ve finally escaped. Northson, we won’t have to be so unhappy in the future,” the woman in the jade globe said, her voice filled with joy.\u003c/p\u003e\n\u003cp\u003eNing just watched quietly from the side. In his heart, he sighed to himself.\u003c/p\u003e\n\u003cp\u003eHis original plan was to allow the soul of Yu Xia to go and be reborn into his Ji clan. He would help Northson take care of the reincarnated Yu Xia and come up with a way for her to recover her memories! This was something which he was capable of doing; after all, after the Six Paths of Reincarnation were destroyed, all the major powers had begun to set up new paths of reincarnation for their territories.\u003c/p\u003e\n\u003cp\u003eEvery single one of them was like a miniature cycle of reincarnation. The Crescent world, for example, had a miniature cycle of reincarnation within it as well.\u003c/p\u003e\n\u003cp\u003e“Alas…” Ning mused to himself, “There’s no way to change things now. She’ll forever be trapped within that soultamer jade sphere. Most likely, the only thing sustaining her right now is the love between her and Northson, as well as some things that she still cares for in the mortal world.”\u003c/p\u003e\n\u003cp\u003e“Senior apprentice-brother.” Northson came walking over.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother.” Ning looked at Northson. He could sense that although his junior apprentice-brother felt some regret and pain in his heart, he was clearly once more filled with vigor and energy. He didn’t look as tired and dispirited as he had in the past.\u003c/p\u003e\n\u003cp\u003e“If it wasn’t for you, I probably would’ve died in that place,” Northson said. “Senior apprentice-brother, no need to worry about me; you can go back now. In the future, if there’s anything you need, you can find me here.”\u003c/p\u003e\n\u003cp\u003e“The current world of the Grand Xia is filled with dangerous undercurrents, while you are a grandmaster of the Dao of Constructs. How am I suppose to rest my mind, knowing you are here?” Ning said hurriedly.\u003c/p\u003e\n\u003cp\u003e“There really is no need for you to stay. I’m a Void-level Earth Immortal now, after all; if I’m careful, I’ll be fine,” Northson said.\u003c/p\u003e\n\u003cp\u003eNing frowned. Then, with a wave of his hand, he produced a storage magic treasure. One enormous construct after another instantly appeared next to them, such as a Turtle-Snake, a winged bird-man, or an eight-clawed serpent. In total, there were six golems.\u003c/p\u003e\n\u003cp\u003e“These are the golems I acquired after I killed the bronze-armored Fiendguard called Qu Huan. They feel fairly powerful to me,” Ning said. “Find one that is suited to you and which will allow you to increase your power the most.”\u003c/p\u003e\n\u003cp\u003eNorthson glanced at them, his gaze settling down upon that of the winged golem. He called out in surprise, “A Winged Immortal golem? How can you have one of them? Generally speaking, bronze-armored Fiendguards aren’t qualified to possess golems of the Winged Immortal class.”\u003c/p\u003e\n\u003cp\u003e“Winged Immortal class?” Ning was curious as well.\u003c/p\u003e\n\u003cp\u003e“This is the second-ranked golem within the forbidden region,” Northson said. “Look at its wings; its wings can unleash the ‘Seven Ruinous Thunderwinds’, and its speed is extremely fast as well! Even a mere Loose Immortal or Earth Immortal who is in control of a Winged Immortal golem will instantly have the combat power of a Celestial Immortal. However, its main purpose is to unleash the ‘Seven Ruinous Thunderwinds’, then immediately flee. In battle, it should be extremely, extremely valuable.\u003c/p\u003e\n\u003cp\u003eNorthson knew how to make these things, but he didn’t know exactly how much they were worth.\u003c/p\u003e\n\u003cp\u003eNing, however, did. Upon hearing his junior apprentice-brother say these things, he could guess that this golem was probably comparable in value to a middle-grade Pure Yang treasure.\u003c/p\u003e\n\u003cp\u003e“The others are a bit weaker; perhaps all five them added together would be comparable to a single Winged Immortal class,” Northson said.\u003c/p\u003e\n\u003cp\u003eNing thus immediately came to the conclusion that the other four were probably comparable to a low-grade Pure Yang treasure.”\u003c/p\u003e\n\u003cp\u003e“They really do spare no expense, thanks to their wealth. Every single bronze-armored Fiendguard had at least one such golem…this is probably the same amount of wealth as most Celestial Immortals possess,” Ning mused to himself.\u003c/p\u003e\n\u003cp\u003eBut here, Ning was wrong. He valued them as a low-grade Pure Yang treasure, but that was the ‘list price’ here in the Three Realms for someone seeking to purchase them; in truth, to the mysterious power, these items were nothing more than a collection of precious ingredients, and the value of those ingredients was perhaps a tenth of the value of the complete item. For a truly supreme golem…the formation-diagram within it was actually of the greatest value. Without a detailed formation-diagram, no matter how good your ingredients were, you wouldn’t be able to complete the forging.\u003c/p\u003e\n\u003cp\u003e“Junior apprentice-brother, take this Winged Immortal class,” Ning said.\u003c/p\u003e\n\u003cp\u003eNorthson was greatly shocked. He hurriedly said, ,”Senior apprentice-brother, this Winged Immortal class will be of great use to you. Ji Ning, you saved my life; I, Mu Northson, already feel tremendous gratitude to you fort his. How can I accept this?”\u003c/p\u003e\n\u003cp\u003e“Haha, junior apprentice-brother, I was able to enter and leave that forbidden region as I pleased; not even that ‘general’ was able to do anything to me. This Winged Immortal golem might be important to others, but it really isn’t that useful for me. All I would do would be to sell it off.” Ning shook his head and laughed; this was nothing more than the truth, after all. The [Eight-Nine Arcane Art] was much better at protecting him than the golem would be.\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“If you don’t accept it, how could I rest my mind? Enough, stop wasting words; I’m going to leave now.” Ning waved his arm and collected the other golems, then disappeared without another world.\u003c/p\u003e\n\u003cp\u003eNorthson held the soultamer jade in his arms. He murmured softly, “Senior apprentice-brother…”\u003c/p\u003e\n\u003cp\u003e“Northson, your senior apprentice-brother has helped us so much. Never forget it,” the woman within the jade globe said.\u003c/p\u003e\n\u003cp\u003e“Right.” Northson nodded.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing secretly watched as Northson bound the Winged Immortal golem, then took the jade globe to go and sit down at the entrance to the wooden house, where he simply stared at the lake. Every so often, he would say a few things to the jade globe. This sight caused Ning to feel quite heartsick. After watching a time, he finally, truly left.\u003c/p\u003e\n\u003cp\u003e“It is time to go to the imperial capital of the Grand Xia.”\u003c/p\u003e\n\u003cp\u003e“This time, I rescued my junior apprentice-brother, but I offended that mysterious power. I need to acquire Five Elements essence as soon as possible to train my [Starseizing Hand] to the Fourth Cycle.” Ning had a premonition of incoming danger. This sense of danger was compelling him to increase his own power as soon as he could!\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-15-chapter-7\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-15-chapter-9\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-15-chapter-8","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
