{"id":50149,"no":452,"title":"Book 15, Chapter 29 - The Tenth Stance of the [Three-Foot Sword]","content":"\u003cp\u003e“My name is Ji Ning. Pulling out the copper pillar was nothing more than a minor thing,” Ji Ning said.\u003c/p\u003e\n\u003cp\u003eNing knew very well that this was no longer the Fiendgod Era; this was the era of the Grand Xia Dynasty, which had unified the world! Struggles between human clans were minor affairs, but any Fiendgod that refused to submit to humans would be pursued and assaulted by all parties! The free Fiendgods would have no choice but to flee in pitiful fashion to the ends of the earth. This was what had happened to that ancient Fiendgod who had been in the wild marshes of the Gaol Mountains; he was clearly more powerful than Loose Immortals, and would be able to effortless crush them with his hands…but he didn’t dare to fight back at all. He had always been fleeing in a pathetic fashion.\u003c/p\u003e\n\u003cp\u003eAs for submitting?\u003c/p\u003e\n\u003cp\u003eThese nine hundred-plus Fiendgods had been captured and tormented for countless years without being willing to submit to the Youngflame clan; it would most likely be very hard for them to be made to submit to any other human clans.\u003c/p\u003e\n\u003cp\u003e“We Fiendgods repay benevolence with benevolence, and repay malice with malice,” the nine-headed Fiendgod sent mentally, then turned his head to look at the nine Celestial Immortals of the Youngflame clan. He let out a heaven-shaking roar and said, “Youngflame clan, you’ve imprisoned and tormented us for countless years. Today, the day of vengeance is at hand! Let us wipe all of them out before the Godslayer Guards of the Xia Emperor arrive!”\u003c/p\u003e\n\u003cp\u003e“KILL!”\u003c/p\u003e\n\u003cp\u003e“KILL THEM ALL!”\u003c/p\u003e\n\u003cp\u003eMurderous roars filled the skies, the roars themselves filled with boundless hatred.\u003c/p\u003e\n\u003cp\u003eThe nine hundred-plus Fiendgods actually formed into a war-formation. Their divine power flowed through them, merging to become a single whole as the blurry illusion of an ancient Fiendgod suddenly appeared in the skies, its entire body wreathed in flames. Its aura was so powerful that even Ning was rather stunned. “So this is a Fiendgod war-formation?” He had only heard of Fiendgod war-formations; this was the first time he had seen one.\u003c/p\u003e\n\u003cp\u003eFiendgods were born to be powerful fighters and combatants. They truly did war against the heavens and the earth, preferring to die than to submit.\u003c/p\u003e\n\u003cp\u003eDaoist Threelives was a classic example; after an enemy ripped out off one of his arms, he actually decided to forever have just a single arm! As many humans saw it, this was utter idiocy…but this was exactly what Daoist Threelives did. This was due to his own pride!\u003c/p\u003e\n\u003cp\u003eWhen the ancient tribulation had come, he could’ve hidden away and retreated; given his level of power, he would’ve been able to keep himself alive. But…he didn’t do this. He knew that things would be extremely dangerous, but he still went forward to welcome the danger. Even in death, he had felt no regrets!\u003c/p\u003e\n\u003cp\u003eNing raised his head to look at the awe-inspiring horde of Fiendgods in the skies. They all held weapons at the ready as they charged towards the nine Celestial Immortals.\u003c/p\u003e\n\u003cp\u003eOn one side, a Fiendgod war-formation; on the otherside, the Eight Immortals Sea-Subduing Formation of Immortal cultivators!\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eA powerful collision could be heard, as though the heavens had broken apart and the earth had collapsed.\u003c/p\u003e\n\u003cp\u003eA series of massive waves swept past the region surrounding the eight Celestial Immortals, causing the power of the enemy collision to be completely negated. This Eight Immortals Sea-Subduing Formation was one of the most supreme defensive formations of the Three Realms; it focused completely on being flawlessly protective! They knew very well how difficult it would be to kill these Fiendgods.\u003c/p\u003e\n\u003cp\u003e“Hahaha, is that all you have?” The Ancestor of the Youngflame clan laughed coldly, “I urge you to hurry up and leave; I’ve already notified the Xia Emperor, and I trust that he will soon dispatch the Godslayer Guards to come. If you don’t leave now…none of you will be leaving at all!”\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003e“KILL!”\u003c/p\u003e\n\u003cp\u003eThe Fiendgods didn’t care at all; they continued to charge forward and attack.\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eThe massive, fiery illusion of a Fiendgod that had been formed by their war-formation once more slammed against the Eight Immortals Sea-Subduing Formation. The faces of the Celestial Immortals sustaining the formation all turned ashen.\u003c/p\u003e\n\u003cp\u003e“Ancestor, what should we do? What are our options?” Celestial Immortal Arcanum sent frantically, “We won’t be able to hold for too long; their Fiendgod war-formation is too powerful.”\u003c/p\u003e\n\u003cp\u003e“What can we do?” The horned, golden-robed man gave Celestial Immortal Arcanum a cold look. “There are more than nine hundred Fiendgods here, and more than six hundred of them are Void-level Fiendgods. When they work together, they are capable of shaking the world itself; you won’t even be able to use a Greater Teleportation Dao-seal to escape. As for hiding into a mobile Immortal estate, then using the Greater Teleportation Dao-seal? The combined strike from so many Fiendgods will reduce any estate to dust in an instant. You want to run? There’s no way to run! There is only one option; buy time! Buy a little bit of time…because once the Godslayer Guards of the Xia Emperor arrive, we’ll be rescued!”\u003c/p\u003e\n\u003cp\u003eUsing a Greater Teleportation Dao-seal required time…and one couldn’t be disrupted in the process!\u003c/p\u003e\n\u003cp\u003e“Will the Godslayer Guards of the Xia Emperor make it in time?” Celestial Immortal Goldclock asked.\u003c/p\u003e\n\u003cp\u003e“I’ve already notified the Xia Emperor,” the horned, golden-robed man said.\u003c/p\u003e\n\u003cp\u003e“What if the Godslayer Guard intentionally delays? What then?” Celestial Immortal Arcanum asked worriedly.\u003c/p\u003e\n\u003cp\u003eThe pupils of the horned, golden-robed man shrank, but he said in a low voice, “That won’t happen. The Xia Emperor, that old bastard, knows very well that I have a treasure that can protect you and take you all away with me. However, that treasure will shatter after a single use. Unless things become critical, I absolutely won’t use it.”\u003c/p\u003e\n\u003cp\u003eA treasure capable of blocking the combined strikes of over nine hundred Fiendgods was equivalent to a second life for a Celestial Immortal; the Youngflame clan’s Ancestor wasn’t willing to use it if he didn’t have to!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“You Fiendgods, you are wasting time. The more time you waste, the more of you shall die later.” The horned, golden-robed man sent a mental message through his elemental ki, and his voice echoed throughout the nearby area. “Once the Godslayer Guards arrive…you know exactly how powerful they are. You will be dead!”\u003c/p\u003e\n\u003cp\u003e“Even if we die, we’ll annihilate your Youngflame clan as well!” A Fiendgod covered with scales roared this back at him.\u003c/p\u003e\n\u003cp\u003e“What’s to fear about death? Youngflame clan, all of your Celestial Immortals shall die!”\u003c/p\u003e\n\u003cp\u003e“Youngflame Freak, I know that you yourself have countless clones, but those eight Celestial Immortals under your command shall all die today!”\u003c/p\u003e\n\u003cp\u003eThe Fiendgods were all roaring as they once more joined their power to charge against the Eight Immortals Sea-Subduing Formation.\u003c/p\u003e\n\u003cp\u003e“You really are quite bold and daring; you don’t even want to live any longer! But such a pity; you’ve managed to endure for so many years, managed to endure all sorts of torments, refusing to bow your heads for the sake of one day gaining your freedom…but now that you are free, for the sake of taking your so-called ‘revenge’, you are all going to be caught and slaughtered by the Godslayer Guards. What a true pity! If I were you, I would’ve fled to the ends of the world by now…in fact, I would’ve fled from the entire world of the Grand Xia!” The horned, golden-robed man roared with laughter.\u003c/p\u003e\n\u003cp\u003eIndeed, a portion of the nine hundred-plus Fiendgods hesitated.\u003c/p\u003e\n\u003cp\u003eIt was true.\u003c/p\u003e\n\u003cp\u003eFreedom!\u003c/p\u003e\n\u003cp\u003eTo no longer be imprisoned; to no longer be tortured! It was hard to understand how precious freedom was to them. They had waited for this day for far too long. Were they going to give it all up for the sake of vengeance?\u003c/p\u003e\n\u003cp\u003e“If we don’t kill the Youngflame clan, even if we live, we’ll live with regret. Today, we shall kill the Celestial Immortals of the Youngflame clan. After we slaughter them all, we’ll joyfully flee!” The nine-headed Fiendgod roared angrily.\u003c/p\u003e\n\u003cp\u003e“That’s what we want! To live joyfully!”\u003c/p\u003e\n\u003cp\u003e“Hahaha, Ninehead, I feel as though I’ve returned back to the old days when we warred against the humans. Right! What we want is to live joyfully! What’s so scary about death?”\u003c/p\u003e\n\u003cp\u003e“Wonderful, wonderful!”\u003c/p\u003e\n\u003cp\u003eAll of them let out heroic roars.\u003c/p\u003e\n\u003cp\u003eThe more powerful a Fiendgod was, the more fearless they would become; the desire to do battle that they were born with caused them to become extraordinarly berserk.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eJi Ning, watching from below, was stunned.\u003c/p\u003e\n\u003cp\u003e“Fiendgods…?” Ning murmured to himself.\u003c/p\u003e\n\u003cp\u003eAlthough he, too, trained as a Fiendgod Body Refiner, he didn’t have the heart of a true Fiendgod. He was a human, after all.\u003c/p\u003e\n\u003cp\u003eIf he had been imprisoned and tortured for countless eons…upon escaping and seeing a tremendous threat approaching, he probably would’ve chosen to flee. Only later would he prepare for revenge! But Fiendgods were different; they weren’t willing to wait at all. In their rage, they would take vengeance right away, with no fear of death at all. This sort of desire to do battle stemmed from their very bones; they were born for war. It all completely stunned Ning.\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003e“Kill.”\u003c/p\u003e\n\u003cp\u003eBOOM! Explosions rang out unabated within the skies. The eight Celestial Immortals would occasionally eat a spirit-pill to replenish their elemental ki, striving to defend for as long as they could. The power of the collisions caused even the golden pellet Jindan in their bodies to be damaged. They were only just barely able to hold on, while the Fiendgods were growing increasingly berserk.\u003c/p\u003e\n\u003cp\u003eTime continued to pass, one second after the other.\u003c/p\u003e\n\u003cp\u003eNone of the Fiendgods, however, departed; they all continued to attack in a berserk manner.\u003c/p\u003e\n\u003cp\u003e“To be joyful and act as one pleases.”\u003c/p\u003e\n\u003cp\u003e“For a desire for battle to be so powerful as to fill the skies.”\u003c/p\u003e\n\u003cp\u003e“To wipe out all foes.”\u003c/p\u003e\n\u003cp\u003eNing was mumbling to himself. Suddenly, streaks of sword-ki began to appear around him. Covered by countless streaks of sword-ki, Ning looked like a spirit composed of swords.\u003c/p\u003e\n\u003cp\u003eNing closed his eyes.\u003c/p\u003e\n\u003cp\u003eThreads of enlightenment continuously flowed towards him…\u003c/p\u003e\n\u003cp\u003eEver since Ning had truly decided to start his war against the Youngflame clan, his heart had started to become even more clear, and his desire to do battle had grown.\u003c/p\u003e\n\u003cp\u003eHowever, upon seeing the Fiendgods who had been imprisoned and tormented for countless years choose to ignore their freedom in favor of a joyful battle against those they hated, the desire to do battle in Ning’s heart began to grow even stronger.\u003c/p\u003e\n\u003cp\u003eStronger and stronger, it grew…and his heart became clearer and clearer.\u003c/p\u003e\n\u003cp\u003eAll the insights he had gained in the past began to gather in his mind.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn the skies above, those nine hundred-plus Fiendgods continued to frantically assault the nine Celestial Immortals. The nine Celestial Immortals were only trying to buy time. As for the Ancestor, he was gnashing his teeth. He truly didn’t wish to use his supreme protective treasure; in his heart, it was far more important than the lives of one or two of his Celestial Immortals. But if eight Celestial Immortals under his command died…then he truly would become the lone survivor of the clan. He didn’t wish for this to happen.\u003c/p\u003e\n\u003cp\u003e“Wait a little longer. A little longer.” The Youngflame clan’s Ancestor was frantically encouraging them.\u003c/p\u003e\n\u003cp\u003eThe other eight Celestial Immortals were doing their best to hold on as well. They couldn’t break; they had to stay strong.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eSuddenly, a ripple of power appeared.\u003c/p\u003e\n\u003cp\u003eIt was the ripple of a Greater Teleportation.\u003c/p\u003e\n\u003cp\u003e“Mm?” The nine Celestial Immortals of the Youngflame clan simultaneously raised their heads.\u003c/p\u003e\n\u003cp\u003eThe nine hundred-plus Fiendgods raised their heads as well.\u003c/p\u003e\n\u003cp\u003eHigh in the sky, an ancient-looking warship that appeared to be formed from waves of blood. This bloodwave warship was manned by warriors who were dressed in blood-red armor, each of whom had utterly astonishing auras of power.\u003c/p\u003e\n\u003cp\u003e“THE GODSLAYER GUARDS!” The nine Celestial Immortals of the Youngflame clan were overjoyed.\u003c/p\u003e\n\u003cp\u003e“Let’s leave now!”\u003c/p\u003e\n\u003cp\u003e“Flee.”\u003c/p\u003e\n\u003cp\u003e“Scatter!”\u003c/p\u003e\n\u003cp\u003eThe nine hundred Fiendgods could no longer afford to wait around. With a series of booms, they tore through space, using spatial teleports to rapidly flee in every direction.\u003c/p\u003e\n\u003cp\u003e“Chase after them!” A tall, muscular general who stood upon the deck of the bloodwave warship gave the nine Celestial Immortals of the Youngflame clan a cold look, then immediately gave the order.\u003c/p\u003e\n\u003cp\u003eInstantly, with many bloody flashes of light, the Godslayer Guards tore holes through space as well as they engaged in pursuit.\u003c/p\u003e\n\u003cp\u003eThe world became peaceful once more.\u003c/p\u003e\n\u003cp\u003eThe Fiendgods had disappeared.\u003c/p\u003e\n\u003cp\u003eThe Godslayer Guards had disappeared as well.\u003c/p\u003e\n\u003cp\u003e“Whew.” The nine mighty Celestial Immortals all let out sighs of relief.\u003c/p\u003e\n\u003cp\u003e“Thank goodness. Thank goodness!” The horned, golden-robed man nodded to himself. “Thank goodness I wasn’t in a rush to use my treasure. Otherwise, it would’ve been wasted.”\u003c/p\u003e\n\u003cp\u003e“…that Ji Ning actually hasn’t fled!” Celestial Immortal Arcanum pointed downwards, laughing coldly, “Although we are heavily injured, with the three insect aberrations present…we are completely capable of suppressing him.”\u003c/p\u003e\n\u003cp\u003eAll the other Celestial Immortals looked downwards as well, the Ancestor included.\u003c/p\u003e\n\u003cp\u003eNing was standing in the midst of some rubble. His eyes were closed, and he even had a hint of a smile on his face. This was the feeling of joy he had when he was gaining insights into the Dao.\u003c/p\u003e\n\u003cp\u003e“Where the Dao is…” Ning opened his eyes, then said softly, “Though ten million soldiers bar my path, I shall relentlessly advance!”\u003c/p\u003e\n\u003cp\u003eBOOM!!!\u003c/p\u003e\n\u003cp\u003eThe rubble around Ning, including the countless pieces of shattered rocks, broken bits of grass, and even drops of water all began to levitate into the air…and as they did, sword-light began to gather around them. It was as though all things had become a sword! Even the many Immortal swords and Darknorth swords that floated in the empty space within Ning’s Zifu region began to emit sword-hums.\u003c/p\u003e\n\u003cp\u003e“Although I am very talented, and although my insights into the Dao have long ago surpassed that of senior Northwalker…in terms of my sword-heart, perhaps only today have I just barely reached his level.”\u003c/p\u003e\n\u003cp\u003eNing could feel a surge of sword-intent that wished to burst forth from within his heart. This sword-intent was so powerful, so resonant.\u003c/p\u003e\n\u003cp\u003e“Where the Dao is…”\u003c/p\u003e\n\u003cp\u003e“Where the Dao is…”\u003c/p\u003e\n\u003cp\u003eNing murmured softly to himself, “This new sword-art that I just developed…let it be named the ‘Relentless Advance’, then.”\u003c/p\u003e\n\u003cp\u003eThe tenth stance of the [Three-Foot Sword] – Relentless Advance!\u003c/p\u003e\n\u003cp\u003eNing raised his head to look towards the sky. The sky was now devoid of Fiendgods...only the nine Celestial Immortals and the three aberrations were still present.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-15-chapter-28\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-15-chapter-30\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-15-chapter-29","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
