{"id":50248,"no":551,"title":"Book 18, Chapter 44 - The Moment Finally Arrives","content":"\u003cp\u003e“Human Sovereign Shennong?”\u003c/p\u003e\n\u003cp\u003eThe Immortals and Fiendgods nearby, Ji Ning included, were shocked. Nuwa was the creator of mankind, and mankind had quickly multiplied. During the Primordial Era, however, mankind was still a very weak race amongst a myriad of races. However, the puny race had given birth to three dazzling, brilliant figures. They were Suiren, Fuxi, and Shennong.\u003c/p\u003e\n\u003cp\u003eUnder their command, mankind rapidly and steadily began to grow more powerful, rising to prominence amongst the races. Mother Nuwa herself cared deeply about the three of them, and their accomplishments caused the entire Three Realms to feel stunned.\u003c/p\u003e\n\u003cp\u003eThe most powerful figures of the Nuwa Alliance were, without a doubt, the leader of the Buddhist Sangha and the leader of the Daoist Path.\u003c/p\u003e\n\u003cp\u003eThe three Human Sovereigns, however, were comparable to these two mighty leaders!\u003c/p\u003e\n\u003cp\u003eThe likes of Old Man Yuan and Patriarch Subhuti were ranked below them. But of course, that didn’t mean that Old Man Yuan and Patriarch Subhuti were necessarily weaker than them. After all, after countless ages of training, they might’ve made breakthroughs that allowed them to reach brand new levels of power. Without actually engaging in battle, it’d be hard to say…\u003c/p\u003e\n\u003cp\u003eBut from the power that the three Human Sovereigns had already displayed, there was no question about their might at all.\u003c/p\u003e\n\u003cp\u003eIt was precisely because the three of them existed that mankind became the masters of the Three Realms!\u003c/p\u003e\n\u003cp\u003eAlthough the Primordial Imperial Clan had successive generations of emperors, only the three of them were truly acknowledged as sovereigns by the entire Three Realms. Even major powers had to bow their heads in their presence. There was nothing for it; the Three Sovereigns were simply too strong.\u003c/p\u003e\n\u003cp\u003e“Shennong, one of the Three Sovereigns…he’s actually made his move. He is someone who is a true ruler of the Three Realms.” Ning secretly sighed in amazement. “I wonder…now that one of the Three Sovereigns has made a move, what sort of a move will it be?”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eUpon hearing the youth before him say that he came on the orders of Human Sovereign Shennong, Daofather Crimsonbright was delighted. He deeply trusted and tremendously respected Shennong…but he couldn’t help but ask in puzzlement, “Does the Human Sovereign know what dire straits my Crimsonbright Realm is in? Daofather Ink Bamboo’s army now includes a Daofather golem within it.”\u003c/p\u003e\n\u003cp\u003e“The Human Sovereign already knows,” the youth said.\u003c/p\u003e\n\u003cp\u003e“Can we win?” Daofather Crimsonbright grew excited.\u003c/p\u003e\n\u003cp\u003eBoth sides had truly fought viciously in this war. Daofather Crimsonbright truly wished to win as well.\u003c/p\u003e\n\u003cp\u003e“I’m confident we can.” The youth nodded. “However, we still need to plan things out carefully, and I need to speak to you in private, Daofather. I have to keep this private and away from the other Immortals and Fiendgods for now.”\u003c/p\u003e\n\u003cp\u003eDaofather Crimsonbright nodded. Sweeping his soldiers with his gaze, he laughed. “You can leave for now.”\u003c/p\u003e\n\u003cp\u003e“Yes, Daofather.”\u003c/p\u003e\n\u003cp\u003eJi Ning and the others all assented respectfully, then departed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eOutside the main palace. The Immortals and Fiendgods were all chatting animatedly.\u003c/p\u003e\n\u003cp\u003e“Shennong has actually intervened. He’s one of the Three Sovereigns of Mankind!”\u003c/p\u003e\n\u003cp\u003e“We’re definitely going to win.”\u003c/p\u003e\n\u003cp\u003e“I wonder what sort of method Shennong is going to employ against that Daofather golem.” Everyone was discussing this matter, and everyone was eager to know the answer.\u003c/p\u003e\n\u003cp\u003eNing was walking by the side with Redsnow and the rest of the seven.\u003c/p\u003e\n\u003cp\u003e“Senior Redsnow, do you think we can win?” Ning asked.\u003c/p\u003e\n\u003cp\u003e“We should…but nothing is guaranteed,” Redsnow said in a low voice. “Shennong is one of the Three Sovereigns of Mankind. He’s unfathomably more powerful than even Master had been. For him to send people…he must have some degree of confidence. However, our foe is the Seamless Alliance, after all. They have terrifying major powers amongst their ranks as well. You can view it as them competing on a strategic level. It’s hard to say who will win and who will lose.”\u003c/p\u003e\n\u003cp\u003eEmpyrean God Redsnow knew very well how powerful both sides were, because during that war that ended the Primordial Era…\u003c/p\u003e\n\u003cp\u003eIt was so, so close.\u003c/p\u003e\n\u003cp\u003eMother Nuwa had been finished. Their side had suffered countless casualties, and even the likes of Daoist Threelives fell during that final battle. Fortunately, Mother Nuwa made a sudden breakthrough and reached Pangu’s level, which was why they had suddenly stormed to victory. Despite that, the ‘king’ of the Seamless Gate had managed to merge himself into the Dao of the Heavens to preserve his life. As for the Lord of All Fiends, he had managed to escape, preventing Mother Nuwa from being able to kill him.\u003c/p\u003e\n\u003cp\u003e“For now, let’s just watch as the two sides compete strategically with each other,” Redsnow said. “For this battle to have reached a state like this…this is crazier than I expected.”\u003c/p\u003e\n\u003cp\u003eNing nodded slowly.\u003c/p\u003e\n\u003cp\u003eIt was indeed quite crazy. There had already been several Realmwars, but they had all occurred within fairly weak Realms. In truth, the Crimsonbright Realm could also be considered a fairly weak world; after all, Daofather Crimsonbright himself wasn’t one of the most powerful figures of the Three Realms. None of the previous Realmwars, hwoever, had reached such a crazy level as the Crimsonbright Realm’s Realmwar had.\u003c/p\u003e\n\u003cp\u003e“All we have to do is wait for our orders. In the midst of this great storm…that’s all we can do.” Ning thought of his newborn daughter, his incomparably adorable and naughty daughter. A powerful desire to grow strong filled Ning’s heart. “I have to become even more powerful. In the midst of this tribulation, only growing in power will allow me to have a chance to protect Brightmoon and senior apprentice-sister…”\u003c/p\u003e\n\u003cp\u003eWhat Ning didn’t realize…\u003c/p\u003e\n\u003cp\u003eA major reason why this Realmwar had escalated to this degree was because of him, Ji Ning. First, Old Man Yuan had transmitted to Ning the [Heart Sutra], resulting in his Heaven Punisher gaining such extraordinary strength that even the Godking viewed him as a threat that had to be eliminated as early as possible. And secondly…Celestial Immortal Blackheaven wished to gain revenge for Violetgrass. Ning asking the Seven Planets God to help out was yet another new variable that changed this Realmwar yet again.\u003c/p\u003e\n\u003cp\u003eBut of course, if the Seven Planets God hadn’t appeared, the Crimsonbright Realm would’ve lost long ago.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe vast world of darkness.\u003c/p\u003e\n\u003cp\u003eThe towering throne levitated in the air at the very center of this world. The Godking sat on his throne, his right hand resting on the throne’s armrest and gently tapping on it.\u003c/p\u003e\n\u003cp\u003eTap. Tap. Tap.\u003c/p\u003e\n\u003cp\u003eThe sound echoed throughout the entire world.\u003c/p\u003e\n\u003cp\u003e“Shennong is intervening as well.” Lightning flashed through the black eyes of the Godking. “It seems our Seamless Gate has pushed too hard, incurring the wrath of the Three Sovereigns. They want to use this Realmwar as an opportunity to frighten and shake the Seamless Gate.”\u003c/p\u003e\n\u003cp\u003e“What should I do?”\u003c/p\u003e\n\u003cp\u003e“What exactly should I do?”\u003c/p\u003e\n\u003cp\u003eThe Godking began to worry.\u003c/p\u003e\n\u003cp\u003e“True Immortal Cloudust and Daofather Crimsonbright…what exactly are they planning? What is their scheme? Also, Shennong has sent over just one Pure Yang True Immortal…what does he have up his sleeves?” The Godking was extremely worried; these were things which he hadn’t been able to find out yet.\u003c/p\u003e\n\u003cp\u003e“Master.”\u003c/p\u003e\n\u003cp\u003eThe Godking raised his head to stare at the dark sky. His voice was very low. “What exactly is Shennong doing? What is the Crimsonbright Realm planning? Please help me…”\u003c/p\u003e\n\u003cp\u003eThe Dao of the Heavens was omnipresent in all places…and nothing within the purview of the Dao of the Heavens could be hidden from the ‘king’.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eA powerful yet incredibly arcane thought-ripple was sent directly to the Godking.\u003c/p\u003e\n\u003cp\u003eThe Godking was momentarily startled. He instantly revealed a look of delight, then said respectfully, “Thank you, Master.”\u003c/p\u003e\n\u003cp\u003eDuring the war that destroyed the Primordial Era, their king had suffered extremely serious injuries. Nuwa had been unwilling to let up on her pursuit of him, resulting in him being forced to merge himself into the Dao of the Heavens. Even now, the largest part of the king’s consciousness remained asleep. But perhaps because he was part of the Dao of the Heavens, that tiny sliver of consciousness was enough to engage in some degree of communications with the Seamless Gate.\u003c/p\u003e\n\u003cp\u003e“It seems that if we are to win…our opportunity lies with ‘Yu Wei’.” The Godking nodded slightly.\u003c/p\u003e\n\u003cp\u003eHe immediately began to summon Yu Wei.\u003c/p\u003e\n\u003cp\u003eA short while later.\u003c/p\u003e\n\u003cp\u003eA white-robed woman appeared on the ground within the vast world of darkness. It was indeed Yu Wei. Her aura had changed slightly; she was quite similar to Yuchi Snow, filled with a warm, motherly aura. After arriving, Yu Wei immediately knelt down. “Respectful greetings to you, Godking.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-18-chapter-43\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-18-chapter-45\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-18-chapter-44","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
