{"id":50271,"no":574,"title":"Book 19, Chapter 11 - The Number One Sword Immortal of the Three Realms","content":"\u003cp\u003e“The Grand Xia?”\u003c/p\u003e\n\u003cp\u003eJi Ning and the seven Empyrean Gods appeared in midair. They immediately saw the imperial capital of the Grand Xia located directly beneath them.\u003c/p\u003e\n\u003cp\u003e“Master actually sent me to the imperial capital of the Grand Xia? Eh, might as well go pay a visit to my master, Diancai.” Ning turned and looked towards the seven nearby Empyrean Gods, then said, “I’m going to roam the Three Realms and temper myself in the red dust of the mortal world. Unless something comes up, there’s no need for you seven to always be following me. As I see it, you can go back to the Starseizer world for now. If there’s anything important, I’ll send a mental message to you.”\u003c/p\u003e\n\u003cp\u003e“That’s not acceptable”\u003c/p\u003e\n\u003cp\u003e“How can you have no subordinates by your side, Manorlord?”\u003c/p\u003e\n\u003cp\u003eInstantly, everyone began to argue against him.\u003c/p\u003e\n\u003cp\u003e“You are the new Manorlord of the Starseizing Manor. You aren’t a rogue cultivator!” Redsnow immediately argued, “If you don’t want all of us to follow you…then how about this? Let’s just have Ninefangs follow you and serve you.”\u003c/p\u003e\n\u003cp\u003eNing was startled. He glanced towards Ninefangs.\u003c/p\u003e\n\u003cp\u003eNinefangs was the last of the seven to break through to the Empyrean God level; when Daoist Threelives had been alive, he had merely been a Void-level Fiendgod. However, he physically looked the oldest. Upon hearing Redsnow’s words, Ninefangs hurriedly said, “Manorlord, when roaming the Three Realms, there will always be some minor, trifling matters to handle. We can’t let you be forced to personally deal with everything, can we?”\u003c/p\u003e\n\u003cp\u003eHaving just acquired the Grand Bloodshadow Formation of the Heavens, Ninefangs was quite eager to show his gratitude.\u003c/p\u003e\n\u003cp\u003e“Fine, fine.” Ning nodded.\u003c/p\u003e\n\u003cp\u003e“Then the rest of us will return to the Starseizer world.” Redsnow and the rest of the six immediately departed, returning to the Starseizer world.\u003c/p\u003e\n\u003cp\u003eAs for Ning, he first paid a visit to the imperial capital of the Grand Xia to visit Immortal Diancai, the Xia Emperor, and his cousin Yuchi Xiyue. Ning had originally planned on having his master Immortal Diancai accompany him, but Immortal Diancai declined. But of course, he didn’t decline the Pure Yang treasures which Ning gifted to him. He chatted with Ning for a long while, giving him some advice.\u003c/p\u003e\n\u003cp\u003e“Time to go.” Early next morning, the white-robed Ning walked out of his room, followed by the bald elder, Empyrean God Ninefangs. The two of them teleported straight out of the Grand Xia, heading towards a minor world.\u003c/p\u003e\n\u003cp\u003eThe Three Realms had a trillion minor worlds. There were simply too many of them, and every so often old minor worlds would be destroyed and new minor worlds would be born. Thus, only a tiny number of these minor worlds were actually named!\u003c/p\u003e\n\u003cp\u003eThe minor world which Ning and Ninefangs had headed towards, however, did have a name. It’s name was ‘East Phoenix’.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“East Phoenix world.” Ning stood at the peak of a mountain, the bald elder Ninefangs by his side.\u003c/p\u003e\n\u003cp\u003e“This is one of the Twenty-Seven Worlds of Fuju.” Ning swept it with his gaze, able to see to the very end of the East Phoenix world. “It lives up to its reputation as one of the places where Daofather Fuju once lived. East Phoenix world has countless different landscapes and far more cultivators than ordinary minor worlds. It even has a Celestial Immortal standing guard over it! It seems as though the three disciples of Daofather Fuju are quite cautious.”\u003c/p\u003e\n\u003cp\u003e“The exalted number one Sword Immortal of the Three Realms…he actually perished, his soul lost forever.” Ninefangs shook his head and sighed.\u003c/p\u003e\n\u003cp\u003eNing nodded slowly, sighing as well.\u003c/p\u003e\n\u003cp\u003eOne of the reasons why Ning was voyaging across the Three Realms was in order to search for a way to allow his heartforce to break through once more. A second reason was to meditate on his sword-arts! If he couldn’t find the first, he would spend his time cultivating the second.\u003c/p\u003e\n\u003cp\u003eNaturally, Ning would pay a visit to the ‘Twenty-Seven Worlds of Daofather Fuju’!\u003c/p\u003e\n\u003cp\u003eDaofather Fuju…\u003c/p\u003e\n\u003cp\u003eHe was born a human and trained as a Ki Refiner. He had become a Daofather of the Great Firmament during the Primordial Era, and became famous due to his sword. He had managed to train his swordforce all the way to the fifth level!\u003c/p\u003e\n\u003cp\u003eSwordforce was just like heartforce; it could also be divided into five levels.\u003c/p\u003e\n\u003cp\u003eIf one reached the fifth stage of swordforce, one would be considered supreme even amongst True Gods and Daofathers. This Daofather Fuju became publicly acknowledged as the number one Sword Immortal of the Three Realms because, back when the Primordial Era had ended and the Three Realms Era began, he had created a supreme sword-art which had stunned the Three Realms…the [Five Treasures] sword-art. By relying on this sword-art, Daofather Fuju had become the indisputed number one Sword Immortal of the Three Realms.\u003c/p\u003e\n\u003cp\u003e“According to the legends, Daofather Fuju’s sword was indescribably fast,” Ning sighed. “So fast that it surpassed the limits of speed established by the Dao of the Heavens. When ordinary True Gods or Daofathers fought against him, they wouldn’t even be able to block his sword. In power, he was very close to the leaders of the Daoist Path and the Buddhist Sangha. I imagine that he is on par with my master himself. But alas, such a peerless figure ended up dying within the primordial chaos.”\u003c/p\u003e\n\u003cp\u003e“We don’t even know how he died.” Ninefangs shook his head as well. There were records of the many events which had occurred after the Primordial Era ended. Primelight, Ninefangs, Snow Scorpion, and the others had been in seclusion for far too long; it was only after they emerged and began to read these records that they began to learn of these things.\u003c/p\u003e\n\u003cp\u003eDuring the Primordial Era, many major powers perished, including even Elder Gods.\u003c/p\u003e\n\u003cp\u003eDuring the Three Realms Era, there were naturally major powers who had perished as well!\u003c/p\u003e\n\u003cp\u003eOne of the affairs that had particularly shocked the Three Realms was the death of Daofather Fuju. The only information that was known was that he had died in the primordial chaos. As for how he died or who killed him? Nothing was known. Someone who was publicly acknowledged as the number one Sword Immortal of the Three Realms, a figure who was comparable to Patriarch Subhuti and Old Man Yuan, and was extremely close to the Three Sovereigns of Mankind, Daoist Three Purities, and Lord Buddha in power…had died, just like that. Many were thoroughly stunned by this news. Subhuti and the others had searched for the reasons behind his death, but they hadn’t found anything.\u003c/p\u003e\n\u003cp\u003eAfter Fuju died…\u003c/p\u003e\n\u003cp\u003eThe Twenty-Seven Worlds of Fuju became incredibly popular!\u003c/p\u003e\n\u003cp\u003eThis was because when Daofather Fuju had trained in the sword, he would sometimes leave behind some of his sword-arts on the mountains or in underground caves when the mood struck him. These remnants of his sword-arts contained unfathomable power which not even Empyrean Gods or True Immortals would dare touch. When Daofather Fuju had been alive, his disciples would often go to these twenty-seven worlds to analyze the sword-arts he had left behind.\u003c/p\u003e\n\u003cp\u003eAs for the other Empyrean Gods and True Immortals of the Three Realms? They generally wouldn’t have a chance to do so. But then, Daofather Fuju died. His disciples were merely Empyrean Gods and True Immortals; they naturally wouldn’t dare to keep these twenty-seven worlds for themselves.\u003c/p\u003e\n\u003cp\u003eThus…they opened the worlds up to the public!\u003c/p\u003e\n\u003cp\u003eAll Immortals or Fiendgods of the Three Realms could come here to meditate on the remnant sword-arts left behind. The only restriction was that no one was permitted to cause any damage; if anyone did, that person would become the common enemy of countless Immortals and Fiendgods! And in truth, given that the remnants contained the might of the number one Sword Immortal of the Three Realms…how many would be so suicidal as to attempt to destroy them?\u003c/p\u003e\n\u003cp\u003eEach of the twenty-seven worlds had remnants of his sword-arts left behind on them. Some had more, some had less.\u003c/p\u003e\n\u003cp\u003eThe most exalted world was Sword Immortal world, because it contained the complete set of the [Five Treasures] sword-art within it.\u003c/p\u003e\n\u003cp\u003eAs for the other twenty-six worlds, they just contained some scattered, incomplete remnants.\u003c/p\u003e\n\u003cp\u003eThus, after travelling through all of the worlds, the various Empyrean Gods and True Immortals would generally choose to gather upon Sword Immortal world. Very few of them would remain on the other twenty-six worlds. During normal, peaceful times, there would perhaps be more than a thousand of them on Sword Immortal world. Sometimes they would spend a million years or a hundred million years cultivating on that world! However, since the Three Realms was gripped by a great storm, most of the Empyrean Gods and True Immortals had joined the armies of their respective realms.\u003c/p\u003e\n\u003cp\u003eThere were now very few of them left on Sword Immortal world, to say nothing of the other twenty-six.\u003c/p\u003e\n\u003cp\u003e“Daofather Fuju was acknowledged by all as the number one Sword Immortal of the Three Realms. I naturally have to go and analyze his sword-arts,” Ning said. “Ninefangs, let us first wander East Phoenix world and the rest of the twenty-six. We’ll save Sword Immortal world for last.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Ninefangs said respectfully.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Ning said.\u003c/p\u003e\n\u003cp\u003eWhoosh! Whoosh!\u003c/p\u003e\n\u003cp\u003eNing and Ninefangs flew through the air, moving towards a giant, towering mountain. Because East Phoenix world was merely a minor world, it had a circumference of just a hundred thousand kilometers; it was actually smaller than Swallow Mountain! It took them only a very short amount of time to fly to their destination.\u003c/p\u003e\n\u003cp\u003e“Quite a few people here.” Ning glanced downwards. There were mountain peaks below them, and at the base of the mountain peaks sat many Immortal cultivators and Diremonsters. They were in the lotus position, quietly meditating and training.\u003c/p\u003e\n\u003cp\u003e“However, even the most powerful are merely at the Loose Immortal or Earth Immortal level,” Ninefangs said.\u003c/p\u003e\n\u003cp\u003e“Normally, Sword Immortal world would have plenty of Empyrean Gods and True Immortals. East Phoenix world would have a good number of Celestial Immortals…but given the current status of the Three Realms, the Celestial Immortals have all been ordered to join their respective armies. Naturally, the strongest remaining figures are at the Loose Immortal level.” Ning swept the mountains below with his gaze. There really were many cultivators seated there.\u003c/p\u003e\n\u003cp\u003eThe vast majority were actually Zifu Disciples and Wanxiang Adepts. They were all seated on prayer mats which had been left behind by the Empyrean God and True Immortal disciples of Daofather Fuju. This was to provide them with organized seating for their meditations. Otherwise, if all of them just haphazardly squeezed together, how could anyone calm down and concentrate?\u003c/p\u003e\n\u003cp\u003e“Manorlord, I’ll move them away,” Ninefangs said.\u003c/p\u003e\n\u003cp\u003e“No need. Look; that little Diremonster is planning to give us a seat.” Ning chuckled as he pointed towards a skinny, horned Diremonster who sat in the very first row of seats. The Diremonster stared unblinkingly at the mountain cliffs, but his eyes were bloodshot. Blood was beginning to leak from his mouth; clearly, he was beginning to succumb and go insane.\u003c/p\u003e\n\u003cp\u003eThe sword-arts left here were simply unfathomably profound. They had been left by a Daofather! If you gave up when you couldn’t understand, you would be fine, but if you tried to force your way through…you’d easily go insane.\u003c/p\u003e\n\u003cp\u003e“Go.” Ning willed it, and whoosh! The Diremonster instantly disappeared into thin air, with Ning then appearing onto that prayer mat. The Immortal cultivators around him were all focused on their meditations. Although two or three of them noticed Ning appear, they didn’t pay too much attention to him. Ning and Ninefangs were both keeping their auras reserved as they wandered the Three Realms. Otherwise, if they were to release their Empyrean God auras, they would’ve terrified all of the Immortals and Fiendgods present to the point of quivering.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-19-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-19-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-19-chapter-11","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
