{"id":50281,"no":584,"title":"Book 19, Chapter 21 - All For Nothing","content":"\u003cp\u003eThis was a world filled with fire, a vast, endless world. In fact, it was a bit vaster than even the Celestial Realm or the Netherworld Kingdom! This world was comparable to a hundred Grand Xia’s in size.\u003c/p\u003e\n\u003cp\u003eThis place was a holy land for the human race!\u003c/p\u003e\n\u003cp\u003eThis was a world created by the most powerful and oldest human alive…Suiren.\u003c/p\u003e\n\u003cp\u003eWhen Mother Nuwa had created the human race, it had started off very weak. Suiren was alive during those earliest of days. Despite his weakness, he not only learned how to control fire and taugh it to his fellows, he also unified the weak human race under his rule and led the humans to a path that permitted their survival during the ancient era where Fiendgods ruled. Suiren was tremendously talented and tremendously steadfast, and he managed to create an inconceivable path for himself and his race.\u003c/p\u003e\n\u003cp\u003eHe was the most exalted, most revered, most supreme emperor of the entire human race…the leader of the Three Emperors!\u003c/p\u003e\n\u003cp\u003eSuiren was low-key and a down-to-earth person. He often roamed in the primordial chaos, and even cut a canal through it, creating a vast major world in the canal. This world was the Kindlefire major world, and it became a truly sacred land for the human race. One could use the size of a created world to judge the power of its creator, and Suiren’s Kindlefire world was second only to Nuwa’s world in size.\u003c/p\u003e\n\u003cp\u003eIn terms of power…\u003c/p\u003e\n\u003cp\u003eSuiren’s power was unfathomable. During the Primordial Era, even the Elder God of Fire, Zhurong, a god who lived for battle, admitted that he was not a match for Suiren after sparring against him. Fuxi and Shennong often appeared in the Three Realms, but Suiren always kept to himself in seclusion. His very existence, however, was a mighty sword hanging over the necks of any who dared to cause the human race harm. He was the oldest and most powerful member of the human race. Even if he didn’t actually emerge from seclusion, no one in the Three Realms would dare to forget about him.\u003c/p\u003e\n\u003cp\u003eEven the Seamless Gate felt great dread towards this almighty human expert. Some powerful Outsiders had run into Suiren in the primordial chaos, and Suiren had slaughtered them all! That scene had stunned the entire Three Realms, and had made the Seamless Gate even more nervous regarding his power.\u003c/p\u003e\n\u003cp\u003eIt was his power that ensured that the human race remained the unquestioned leader of the myriad races. Not even the True Gods of Primordial Chaos would argue against him.\u003c/p\u003e\n\u003cp\u003eAt the very top of a towering, divine mountain of fire, a man was seated in the lotus position, nearly naked and clad only in a fur loincloth. His black hair was spread casually over his shoulders, with every single strand of hair having an aura of inconceivable might, as though they were the horns of a dragon. His face was covered with a thick beard, and his eyes seemed capable of seeing into the future. Although he simply sat there atop the mountain…in truth, his gaze was spread throughout the Three Realms.\u003c/p\u003e\n\u003cp\u003eHe was a transcendental figure that cared about little…but now that the storm had arrived, he was watching over everything.\u003c/p\u003e\n\u003cp\u003e“Guo Zi.” Suiren’s voice was vigorous and powerful. It was transmitted more than three hundred thousand kilometers away, straight into the ears of a woman who was amongst a crowd of thousands who were quietly training in front of a massive image of a god.\u003c/p\u003e\n\u003cp\u003e“Father.” The human woman, face covered with divine tattoos, rose to her feet. The tattoos on her face was a relic from back when humans tried out many different types of cultivation methods. Guo Zi was one of the humans who had been willing to try anything, no matter the risk, and Suiren had eventually accepted her as his foster daughter.\u003c/p\u003e\n\u003cp\u003e“Lead your brigade to go rescue Ji Ning,” Suiren order.\u003c/p\u003e\n\u003cp\u003e“Yes,” Guo Zi said respectfully.\u003c/p\u003e\n\u003cp\u003eSuiren, as the oldest Human Emperor, had many, many experts following him. In the Kindlefire world alone, he had more than ten Daofather subordinates and more than ten thousand Empyrean God and True Immortal subordinates! The number of Celestial Immortals under his command was even more astonishing. This place, a holy land for the human race, could be described as the most powerful of the major worlds. The Seamless Gate didn’t even dare to attempt to infiltrate it.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Voidboat was hurtling forward through the infinite Void. Every so often, it would tear through the Void to travel to another world, then once more begin to fly at high speed.\u003c/p\u003e\n\u003cp\u003eAboard the Voidboat.\u003c/p\u003e\n\u003cp\u003eNing and the Seven Planets God didn’t dare to be the slightest bit overconfident.\u003c/p\u003e\n\u003cp\u003e“The Seamless Gate’s army is very powerful. If we end up trapped, we’ll definitely die,” the Seven Planets God sent mentally. But suddenly…\u003c/p\u003e\n\u003cp\u003e“Ji Ning, hold on for just a while longer. Human Emperor Suiren has already sent Empyrean Goddess Guo Zi in command of 365 Empyrean Gods and True Immortals to reinforce you.” Subhuti’s voice rang out within Ning’s mind.\u003c/p\u003e\n\u003cp\u003e“Good.” Ning let out a sigh of relief, then turned to glance backwards. The long black shuttle behind him was still chasing at high speed.\u003c/p\u003e\n\u003cp\u003e“Damn. We were just a fraction too slow.” There were nearly three hundred Empyrean Gods and True Immortals gathered aboard the black shuttle. The leader was a tall, skeletal-looking Fiendgod whose flaming eyes stared intently towards the distant Voidboat. “If Ji Ning was just slightly slower just now…our Seamless Infinity Formation would’ve been able to lock the surrounding space and prevent him from fleeing. It was so close! But now, we can’t catch up to him no matter how we try. Damn. Damn!”\u003c/p\u003e\n\u003cp\u003e“The major powers of the Nuwa Alliance truly are formidable as well. We were quite fast; we tore straight through the Void and into the Three Realms, but they were still able to discover us and notify Ji Ning. Ji Ning ran quite quickly as well.” A man holding a scimitar in his arms gave his solemn opinion.\u003c/p\u003e\n\u003cp\u003e“Yes. What a pity.”\u003c/p\u003e\n\u003cp\u003e“Just one step behind.”\u003c/p\u003e\n\u003cp\u003eThe other Empyrean Gods and True Immortals felt resentful as well.\u003c/p\u003e\n\u003cp\u003eFortunately for Ning, Subhuti had warned him, and so he had chosen to enter the Voidboat and flee without hesitating at all! He had been just half a step ahead of them. If it wasn’t for that half-step, his foes would’ve been able to activate their Seamless Infinity Formation and completely lock down the surrounding area for ten thousand kilometers. The power of that formation was enough to ensure that even the Voidboat would find it difficult to tear a path to the Void.\u003c/p\u003e\n\u003cp\u003eAlas…Ning had been able to escape before their all-encompassing net had been set up.\u003c/p\u003e\n\u003cp\u003e“Keep chasing.”\u003c/p\u003e\n\u003cp\u003e“Chase him down, no matter what. If Ji Ning makes even the slightest mistake, we’ll be able to catch and trap him,” the skeletal Fiendgod growled. If Ning made some mistakes due to being panicked by this life-threatening situation, he would be caught.\u003c/p\u003e\n\u003cp\u003eOne continued to flee, the other continued to chase.\u003c/p\u003e\n\u003cp\u003eThrough the infinite Void, through the major worlds, through the minor worlds…the pursuit continued. Ning was riding aboard the Voidboat, while his foes were also riding a supreme Protocosmic spirit-treasure, the ‘Heavenwitch shuttle’. Both were extremely well-suited for high-speed maneuvers through the Void, and for a time the two were equally matched.\u003c/p\u003e\n\u003cp\u003e“Not good.” The face of the skeletal Fiendgod aboard the Heavenwitch shuttle changed, along with the faces of his fellows.\u003c/p\u003e\n\u003cp\u003eA blazing mountain had appeared, hanging in the skies above the vast, sea-like heavens. The blazing mountain had multiple figures standing on it, each possessing an aura of ancientness. These were all experts who had been alive since the Primordial Era, and the leader was Empyrean Goddess Guo Zi, whose murderous aura filled the heavens. A total of 365 Empyrean gods and True Immortals were by her side.\u003c/p\u003e\n\u003cp\u003eAs for the Voidboat, it flew straight next to the blazing mountain, and as it did two towering Fiendgods came walking out from it.\u003c/p\u003e\n\u003cp\u003eThe two armies stared at each other from afar.\u003c/p\u003e\n\u003cp\u003eBoth consisted of the elites of their respective camps. One side was skilled in the the ‘Seamless Infinity Formation’ which the Seamless Gate’s king had created, while the Nuwa Alliance had its own incredibly powerful ‘Sidereal Star Formation’. During the Primordial Era, the Empyrean Gods and True Immortals who used this grand formation were similarly able to fight against True Gods and Daofathers.\u003c/p\u003e\n\u003cp\u003e“Do you wish to battle?” Empyrean Goddess Guo Zi stared at them coldly. Her voice was like ice, but it shook Heaven and Earth.\u003c/p\u003e\n\u003cp\u003e“Darknorth.” The skeletal Fiendgod pointed towards Ning, then said coldly, “Consider yourself lucky this time. You managed to escape by a hair. But your actions…well, you are looking to die.”\u003c/p\u003e\n\u003cp\u003e“Looking to die? Then come here and kill me.”\u003c/p\u003e\n\u003cp\u003eNing looked back at him, his voice similarly icy. “If you have the ability to kill me, come and do so. I’m right here. What’s the point of just making empty threats?”\u003c/p\u003e\n\u003cp\u003eThe skeletal Fiendgod ground his teeth.\u003c/p\u003e\n\u003cp\u003eTwo flames blazed within his eyes as he swept his gaze over the powerful Empyrean Gods and True Immortals standing atop the fiery mountain. All he could do, however, was swallow his resentment. Although Ji Ning was rather reckless in what he did…by holding on for a period of time, he had been able to receive reinforcements from the Nuwa Alliance. The Seamless Gate had not decided to launch the Endwar yet. For now, they were helpless when faced with such a powerful enemy army.\u003c/p\u003e\n\u003cp\u003e“Withdraw.” The Godking’s voice rang out within the mind of the skeletal Fiendgod.\u003c/p\u003e\n\u003cp\u003e“Let’s go.” The skeletal Fiendgod had no choice but to give this resentful order.\u003c/p\u003e\n\u003cp\u003eBoom! The Heavenwitch shuttle tore a hole into the Void, departing from this world.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Third World. Both the Godking and Daofather Helljade were standing in midair, watching as this unfolded.\u003c/p\u003e\n\u003cp\u003e“Damn.” The Godking’s eyes flashed with cold light.\u003c/p\u003e\n\u003cp\u003e“What a pity. We were just one step behind.” Daofather Helljade said in a cold voice, “But that one step meant that we were unable to catch him. This Ji Ning fellow actually has a supreme Protocosmic spirit-treasure, the Voidboat. This Voidboat is a treasure that existed long ago, even before our Seamless Chaosworld had engaged in the first war against the Pangu Chaosworld. It originally belonged to Daoist Threelives. Threelives…he truly was a valiant, courageous warrior. He was extraordinarily brave, and quite willing to be vicious to himself when needed.\u003c/p\u003e\n\u003cp\u003e“Agreed.” The Godking nodded as well. He, too, remembered the valiant, powerful Daoist Threelives. Although Threelives had never mastered a Heavenly Dao, he was able to rely on his powerful True God body and his utterly terrifying divine ability, the [Starseizing Hand], to slay multiple True Fiends and Daofathers of the Seamless Gate. The power of his [Starseizing Hand] was simply too great.\u003c/p\u003e\n\u003cp\u003e“Ji Ning has the Voidboat. The only way to kill him is to first seal off spacetime in the area around him or set up a trap for him. The second way is to use an even better flying treasure, but the only ones better than the Voidboat are all Chaos treasures.” The Godking frowned. “Our side only has a single Chaos treasure meant for high-speed flying, but it’s with Daomother Devilhand! Daomother Devilhand is a very solitary figure. She wouldn’t necessarily be willing to hand such an incomparably important Chaos treasure over to a few Empyrean Gods and True Immortals.”\u003c/p\u003e\n\u003cp\u003e“Yes. Given Devilhand’s temperament, it’ll be hard to make her agree.” Daofather Helljade nodded.\u003c/p\u003e\n\u003cp\u003eDaomother Devilhand…\u003c/p\u003e\n\u003cp\u003eShe was a truly terrifying fiend who had once unleashed a storm of blood and murder across the Seamless Chaosworld. The countless experts of the Seamless Chaosworld had all been terrified whenever they had heard her name. Her power also came from her hands, but she was different from Daoist Threelives. The reason why Daomother Devilhand’s hands were so powerful was because she had acquired a set of glove-type Chaos treasures in the primordial chaos. She had created a divine ability to go with the gloves, a supreme technique known as the ‘Extinction Devilhands’. Perhaps in terms of fleeing abilities, she was inferior to the Lord of All Fiends, but she wasn’t the slightest bit weaker than him in terms of actual combat power. It had been the Lord of the Demonheart, and him alone, who had been able to subdue this demon amongst demons.\u003c/p\u003e\n\u003cp\u003e“Ji Ning really is courting death.” The more the Godking thought about what had just happened, the angrier he became. Ji Ning’s slaying of those fifteen Empyrean Gods and True Immortals didn’t have much of an impact on his total combat force, but it had grave implications for his disposition of forces across the entire Three Realms.\u003c/p\u003e\n\u003cp\u003eIf he continued to lay down forces in a spread-out manner as he currently did, Ji Ning would once more succeed in his ambushes. But if he was to change his force layout, then he would have to do so throughout the entire Three Realms. The price of such a change would be enormous!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eJi Ning was currently expressing his thanks to Empyrean Goddess Guo Zi.\u003c/p\u003e\n\u003cp\u003e“Thankfully, you and your friends came in the nick of time, fellow Daoist Guo Zi. Otherwise, I would’ve been in grave danger.” Ning had already dispersed the Heaven Punisher and allowed his million-plus Immortals to teleport back into the Starseizer world. By his side stood only Redsnow and the rest of the seven.\u003c/p\u003e\n\u003cp\u003e“I came to rescue you on orders of Human Emperor Suiren. If you want to thank someone, thank the Human Emperor.” Empyrean Goddess Guo Zi smiled and nodded towards Ning, and the ancient Empyrean Gods and True Immortals behind her nodded towards him as well. They all treated Ning in quite a friendly manner, because Ning himself was of the human race. These Empyrean Gods and True Immortals had been born in an era when the human race was still young and weak, and so they placed even more importance on solidarity with their fellow humans.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-19-chapter-20\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-19-chapter-22\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-19-chapter-21","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
