{"id":49704,"no":7,"title":"Book 1, Chapter 7 - Crimsonbright Diagram of the Nine Heavens","content":"\u003cp\u003eOne thin abridged book after another was placed on the table, and Ning instantly began to scan the names of each of these books.\u003c/p\u003e\n\u003cp\u003e[Calamity Fiend] [Indestructible Blood Fiend] [Song of the Inferno] [Vajra Buddhist Sutras] [Freeform Soul] [Crimsonbright Diagram of the Nine Heavens] [Eternal Mysteries of the Yellow Earth] [Spirit Fox Sutra] [Sutra of the Future Buddha] …\u003c/p\u003e\n\u003cp\u003eEvery single book was covered with ancient, strange-looking characters. Fortunately, Ning had learned these words after Ning had been born into this world.\u003c/p\u003e\n\u003cp\u003eNing took a deep breath. This was a critical choice! One which would determine his destiny!\u003c/p\u003e\n\u003cp\u003eHe picked up a book and began to read.\u003c/p\u003e\n\u003cp\u003e[Calamity Fiend]. To train it, one needed to cover one’s body with magic tattoos and use hellfire to temper one’s body. It was extremely painful. After covering the body with nine different types of magic tattoos and after having been tempered by hellfire 81 times, the body would totally transform and become that of a Xiantian lifeform, instantly acquiring boundless strength, the ability to belch hellfire, and immediately regrow a severed arm. This was an extremely hard yet extremely fast way of training. Theoretically, one only needed 81 days in order to reach the Xiantian level.\u003c/p\u003e\n\u003cp\u003e[Indestructible Blood Fiend]. The pain this caused was even greater than that of the [Calamity Fiend] training method. It required three years of magic tattoos, three years of a hellish, tormented existence.\u003c/p\u003e\n\u003cp\u003e[Song of the Inferno]. This required one to train next to a blazing inferno, then to be engulfed by a blazing inferno, and then finally to enter the lava of a volcano without being harmed at all. It required a person to become one with fire. Once a person could control the limitless power of fire, then one would be considered to have reached the Xiantian level…\u003c/p\u003e\n\u003cp\u003eReading these three, Ning began to frown.\u003c/p\u003e\n\u003cp\u003eWhy was it that these Fiendgod training methods were all so painful? It was worse than torture!\u003c/p\u003e\n\u003cp\u003e“You foolish child.” Snow couldn’t help but speak out. “Only a few Fiendgod Body Refining methods are truly painful. Only five of these nineteen books are excruciating painful. The others aren’t nearly as bad. I didn’t expect that the first three you picked up…”\u003c/p\u003e\n\u003cp\u003e“Oh!” Ning let out a sigh of relief.\u003c/p\u003e\n\u003cp\u003eYichuan, seated nearby, said coldly, “Fiendgod Body Refining is far more difficult than Ki Refining. For a mortal to become a Xiantian lifeform is against the natural law of the world. To reach that level through the most difficult method, the Fiendgod Body Refining method… of course it is hard! In addition, these methods which require miserable agony and difficulties, although they are quick, can be considered heterodox methods which cannot be considered to have a good foundation.”\u003c/p\u003e\n\u003cp\u003eNing nodded as he continued to read.\u003c/p\u003e\n\u003cp\u003e[Vajra Buddhist Sutras]. This was a type of Buddhist Vajra training method.\u003c/p\u003e\n\u003cp\u003e[Freeform Soul]. It required an extremely long period of time to train, but after reaching the Xiantian level, it allowed one to freely transform one’s body and filled one with life. Even if one was chopped into many tiny pieces, one would quickly reform. This was one of the topmost life-preserving types of Fiendgod Body Training.\u003c/p\u003e\n\u003cp\u003e[Crimsonbright Diagram of the Nine Heavens]. Without question, the number one type of Fiendgod Body Training method!\u003c/p\u003e\n\u003cp\u003e“What?!”\u003c/p\u003e\n\u003cp\u003eNing’s eyes turned hungry, and he immediately stared at the [Crimsonbright Diagram of the Nine Heavens] and began to read carefully.\u003c/p\u003e\n\u003cp\u003eThe [Crimsonbright Diagram of the Nine Heavens] had nine parts.\u003c/p\u003e\n\u003cp\u003eThe first three levels were for the Houtian stage.\u003c/p\u003e\n\u003cp\u003eThe middle three levels were for Xiantian lifeforms.\u003c/p\u003e\n\u003cp\u003eThe later three levels were for the Zifu stage.\u003c/p\u003e\n\u003cp\u003e“It really is different. Those other training methods, at their peak, only allowed the trainees to become peak Xiantian lifeforms. But this [Crimsonbright Diagram of the Nine Heavens] allows a person to reach the peak Zifu level.” Ning continued to read carefully despite his excitement.\u003c/p\u003e\n\u003cp\u003eUpon reaching the Xiantian level, one would be able to control water and fire, and also possess astonishing physical strength. One’s body would be light and agile, and all six of the senses would be sharpened. Severed limbs would regrow.\u003c/p\u003e\n\u003cp\u003eUpon reaching the Zifu level, one would be able to regenerate from a single drop of blood. Upon reaching the Wanxiang stage, one would have amazing powers, such as growing three heads and six arms, the Kuafu Sunchaser ability, or Shining Dragon Eyes ability. But of course, the prerequisite was that one would need to be trained in these magical powers.\u003c/p\u003e\n\u003cp\u003eFiendgod Body Refining adepts were able to easily suppress Ki Refining adepts of the same level.\u003c/p\u003e\n\u003cp\u003eBut the [Crimsonbright Diagram of the Nine Heavens] was able to suppress all other types of Fiendgod Body Refining techniques!\u003c/p\u003e\n\u003cp\u003eThis was publicly knowledged!\u003c/p\u003e\n\u003cp\u003eThere was no dispute!\u003c/p\u003e\n\u003cp\u003eBut training in it was extremely hard, the hardest of all. This, too, was undisputed!\u003c/p\u003e\n\u003cp\u003e“That will be my choice!” After flipping through the remaining Fiendgod Body Refining books, without hesitating at all, Ning made his choice. “[Crimsonbright Diagram of the Nine Heavens]!”\u003c/p\u003e\n\u003cp\u003e“You’ve chosen?” Yichuan looked at his son.\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded.\u003c/p\u003e\n\u003cp\u003eYichuan said slowly, “Crimsonbright Diagram of the Nine Heavens’. This is publicly acknowledged by everyone in the world as the most powerful Fiendgod Body Refining method. It is far more profound than the likes of the ‘Song of the Inferno’, the ‘Vajra Buddhist Sutra’, or the ‘Calamity Fiend’ techniques. And that’s just at the Zifu level. The later stages of it are even more profound. If you are able to become a Zifu Disciple, it would be very easy for you to advance to higher levels as well.”\u003c/p\u003e\n\u003cp\u003e“This is the most widely spread and most easily obtainable type of Fiendgod Body Refining technique.” Yichuan looked at his son. “But it is also the hardest!”\u003c/p\u003e\n\u003cp\u003eNing laughed.\u003c/p\u003e\n\u003cp\u003eHe had spent two years here in this world reading many books. He knew that refining techniques were extremely important! The more profound the training technique, the harder it was to train in. For the higher level books regarding the [Crimsonbright Diagram of the Nine Heavens] to be easily obtainable meant that it was all the more important for him to choose this one.\u003c/p\u003e\n\u003cp\u003e“It has the greatest power! The undisputed best!”\u003c/p\u003e\n\u003cp\u003e“It is the most widespread one!”\u003c/p\u003e\n\u003cp\u003e“It is the most easily obtainable method!”\u003c/p\u003e\n\u003cp\u003eYichuan looked at his son. “It has countless merits, and just one flaw; it is extremely difficult! There hasn’t been a single member of the Ji clan of any of our five Prefectures who managed to reach the fourth part and become a Xiantian lifeform.”\u003c/p\u003e\n\u003cp\u003e“What? Not a single member of the Ji clan in all five Prefectures has been able to use it to become a Xiantian lifeform?” Ning was shocked.\u003c/p\u003e\n\u003cp\u003eIt was fine if they didn’t reach the Zifu stage.\u003c/p\u003e\n\u003cp\u003eBut not even one had reached the Xiantian lifeform stage?\u003c/p\u003e\n\u003cp\u003e“Right.” Yichuan said. “Not a single one. Because it is simply too hard, far harder than you can imagine. But I must admit that it is the most mysterious and most powerful Fiendgod Body Refining method. Even in the legends of the Fiendgods, this technique is the most powerful one!”\u003c/p\u003e\n\u003cp\u003e“Then this will be my choice!” Ning didn’t hesitate at all.\u003c/p\u003e\n\u003cp\u003eHe was born into the world with the likes of the [Nuwa Painting], one of the highest class visualization techniques which would allow him to stand out even amongst the armies of Heaven. With such a firm foundation, how could he not at least give it a shot? Even if he failed, that wouldn’t be a big deal. He could then choose to train in another technique.\u003c/p\u003e\n\u003cp\u003e“Fine!” Yichuan revealed a rare smile on his face. He was very happy with his son’s resoluteness. “Then I will go get the [Crimsonbright Diagram of the Nine Heavens] for you.”\u003c/p\u003e\n\u003cp\u003e“Thank you, father.” Ning was filled with anticipation.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003eDark night.\u003c/p\u003e\n\u003cp\u003eThe door to the room was closed, and inside the room, the arm-thick candles were flickering. There were only three people in the room. Yichuan, Snow, and their son, Ning.\u003c/p\u003e\n\u003cp\u003eNing was holding an extremely thick book with scarlet red letters and reading through it. This was the legendary, most powerful of techniques: [Crimsonbright Diagram of the Nine Heavens].\u003c/p\u003e\n\u003cp\u003e“It really is hard.” Ning was frowning as he read it.\u003c/p\u003e\n\u003cp\u003eThe [Crimsonbright Diagram of the Nine Heavens] had several major obstacles.\u003c/p\u003e\n\u003cp\u003eThe first was the introduction. In order to begin training in it, one had to be able to sense the ‘Great Yang’ (the Sun) and the ‘Great Yin’ (the Moon) in the skies. Many other Fiendgod training methods required the absorption of elemental energy, such as fire, water, or electricity in order to build up power. But the [Crimsonbright Diagram of the Nine Heavens] required its practitioners to immediately begin sensing those two greatest of celestial bodies, and to absorb the energy of the Sun and the Moon.\u003c/p\u003e\n\u003cp\u003eMany trainees simply couldn’t sense the Sun and the Moon at all. And this was just the first step!\u003c/p\u003e\n\u003cp\u003eAfterwards, by absorbing the energy of the Sun and the Moon, one’s entire body would become covered with divine tattoos. This was the second part! After the Divine Sun Tattoo and the Divine Moon Tattoo were completely formed, one could be considered as having completed the first level of the [Crimsonbright Diagram of the Nine Heavens]! Actually, from this very first level, one could tell how unimaginably profound this technique was, because many of the other techniques, such as the [Calamity Fiend] technique, all relied on physically carving the magic tattoos onto one’s body.\u003c/p\u003e\n\u003cp\u003eBut for the [Crimsonbright Diagram of the Nine Heavens], those tattoos would be formed naturally, and the divine tattoos were of the Moon and the Sun!\u003c/p\u003e\n\u003cp\u003eOnce the first level was mastered, one was usually able to easily reach the third level without any problems.\u003c/p\u003e\n\u003cp\u003eBut breaking through to the fourth level and becoming a Xiantian lifeform was even more difficult.\u003c/p\u003e\n\u003cp\u003eIt required ‘Yin and Yang to Fuse, Water and Fire Become One’. Only then could one break past and become a Xiantian lifeform.\u003c/p\u003e\n\u003cp\u003eThe later obstacles… those were too far off. There was no need to worry about them.\u003c/p\u003e\n\u003cp\u003e“Whew.” Finishing reading, Ning let out a long breath.\u003c/p\u003e\n\u003cp\u003eYichuan and Snow looked at their son.\u003c/p\u003e\n\u003cp\u003e“Father, please instruct me with regards to the mysteries hidden within the first level of the [Crimsonbright Diagram of the Nine Heavens].” Ning looked at his father.\u003c/p\u003e\n\u003cp\u003e“Understanding the [Crimsonbright Diagram of the Nine Heavens] is very easy,” Yichuan said. “All you need to do is follow the instructions on the pictures. There are nine pictures to the first level. It is very simple.”\u003c/p\u003e\n\u003cp\u003eNing nodded. He had read many books in this world, and when he flipped through it, he had quickly learned what the training method was. But he was worried that he might have missed some sort of profound meaning. After all, training was something he couldn’t be too rash about. Since his father had said that the instructions in this book were very clear, then it was time to start.\u003c/p\u003e\n\u003cp\u003eNing closed his eyes and raised his fists, then bowed down… this was the first diagram: Bowing to the Sun and the Moon!\u003c/p\u003e\n\u003cp\u003eHe carried out all of the movements in accordance with the pictures, seeming almost to move in accordance with a strange ritual dance, and his body carried within it a strange, ancient aura.\u003c/p\u003e\n\u003cp\u003e“Hrm?” Yichuan was surprised.\u003c/p\u003e\n\u003cp\u003e“His very first attempts at the movement are so accurate and so precise.” Snow was surprised as well. Although most people wanted to make the movements properly, they wouldn’t actually be able to do so as precisely as they wished. However, Ning had been training in accordance to the [Nuwa Painting] since his birth. His soul was very powerful, and he had extremely strong control over his body as a result. Given that he had also constantly been cleansed by the energy of nature and his soul was as pure as an infants, it was quite natural that he could easily make accurate movements.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHua!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eNing’s final movement was to sit down in a kneeling position, his two arms hanging down in front of him, as though one was resting on the sun while the other was resting on the moon.\u003c/p\u003e\n\u003cp\u003eUtter silence.\u003c/p\u003e\n\u003cp\u003eYichuan and Snow were holding their breaths as well. They knew that it was the critical movement. The earlier dancing movements were only for the purpose of allowing one to sense the ‘Great Yang’ (the Sun) and the ‘Great Yin’ (the Moon). Whether or not Ning would be able to sense those two most exalted of stellar bodies…\u003c/p\u003e\n\u003cp\u003eDespite this just being the introductory part to the [Crimsonbright Diagram of the Nine Heavens], it had prevented countless people from training in it.\u003c/p\u003e\n\u003cp\u003eThe two of them knew that the [Crimsonbright Diagram of the Nine Heavens] was the hardest Fiendgod Body Refining method to train, and they knew that the chance of their four year old son being able to master the introductory part was very low. However, parents always hoped that their children would succeed. They waited, hoping for a joyous surprise to happen…\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-1-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-1-chapter-7","bookId":1501,"creation":"Sep 10, 2019 4:16:11 AM","modification":"Sep 10, 2019 4:16:11 AM"}
