{"id":50412,"no":715,"title":"Book 22, Chapter 23 - Fire","content":"\u003cp\u003e“Human Sovereign,” Ji Ning sent mentally, “I know where these three alien Outsiders come from.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Fuxi looked towards Ning.\u003c/p\u003e\n\u003cp\u003e“Aren’t you skilled in using fire, Human Sovereign?” Ning sent mentally, “So long as you use your Eternal Kindlefire against them, they will immediately retreat.”\u003c/p\u003e\n\u003cp\u003eNing’s words were correct. The Waterians were creatures formed from water. They had incredibly durable bodies; even if you cut them apart, they would just reform like water without using up my divine power. This was why they were described as having ‘indestructible bodies’. However, this sort of innate ability came with its own drawbacks as well. There were three ways by which one could deal with Waterians.\u003c/p\u003e\n\u003cp\u003eThe first was to use overwhelming power. A World God could easily blast them apart and grind them into dust, leaving nothing behind at all! However, Ji Ning and the others clearly couldn’t use this method right now.\u003c/p\u003e\n\u003cp\u003eThe second method was to repeatedly attack and injure them. If you injured them heavily enough and often enough, they would still eventually use up all of their energy. At some point, the three Waterians would no longer be able to hold on. However, this method required a very long period of time, and time was exactly what Ning and the others did not have. Lord Tathagata the Buddha wouldn’t be able to hold out for much longer.\u003c/p\u003e\n\u003cp\u003eThus…the only method remaining was the third method.\u003c/p\u003e\n\u003cp\u003eWaterians were completely water-aligned lifeforms. One could use fire to counter them! They were terrified of fire. However, the more powerful a Waterian, the more resistant the Waterian would be to fire. True God Waterians were generally immune to ordinary skyfire or truefire; one would have to use something on the level of Golden Solarfire. Suiren’s ‘Eternal Kindlefire’ was another type of fire that would work.\u003c/p\u003e\n\u003cp\u003e“Eternal Kindlefire is useful against them?” Fuxi wasn’t that skilled in using this type of fire. His ‘Waterflame Apocalypse Formation’ used ‘Eternal Kindlefire’ alongside ‘Arcane Moonwater’. Suiren provided the Eternal Kindlefire while Fuxi was able to harvest Arcane Moonwater himself. Thanks to his mastery over the Heavenly Daos of Yin and Yang, he was able to control both the Kindlefire and the Moonwater, but this formation was mainly used for extremely wide-area attacks; it wasn’t that useful against individual opponents, which was why he hadn’t used it yet.\u003c/p\u003e\n\u003cp\u003eAlthough puzzled, Fuxi trusted Ning.\u003c/p\u003e\n\u003cp\u003e“Come out.”\u003c/p\u003e\n\u003cp\u003eFuxi and his Daofathers actually held the upper hand in this fight; the issue was just that they couldn’t force the three golden-armored Outsiders into submission. Fuxi suddenly let out a low growl, and as he did a massive formation suddenly appeared that was hundreds of kilometers across. The Arcane Moonwater was placed off one side and the Eternal Kindlefire was placed directly before their foes. The flames looked warm and inviting, almost like ordinary flames; they didn’t look as dominating or savage as Golden Solarfire. They were flames that brought warmth to one’s heart.\u003c/p\u003e\n\u003cp\u003eAs soon as the flames appeared, the faces of the three alien Outsiders instantly changed. When the flames touched one of them, he let out a shocked cry. “Elderfire! Quick, flee.”\u003c/p\u003e\n\u003cp\u003e“Flee.”\u003c/p\u003e\n\u003cp\u003eThe three golden-armored Outsiders no longer dared to tarry. Whoosh! Whoosh! Whoosh! They immediately transformed into three streaks of watery light that disappeared into the distance. Fuxi and the others wished to stop them, but the watery streams were formless, shapeless, and moved at incredible speed. They instantly scurried back into large formation off in the distance.\u003c/p\u003e\n\u003cp\u003e“If I knew how afraid of fire they were, I would’ve used Eternal Kindlefire long ago.” Fuxi willed the Waterflame Apocalypse Formation to disperse. This was a formation which he had prepared for the war; he would use it to attack large groups of opponents. When activated, it would blanket an entire major world with enough power to cause even elite Daofathers to feel grave danger. But of course, against overlord Daofathers it would just prove to be a bit troublesome.\u003c/p\u003e\n\u003cp\u003e“They aren’t afraid of ordinary flames,” Ning said.\u003c/p\u003e\n\u003cp\u003eIn the primordial chaos, flames were divided into three levels of power: Skyfire, truefire, and elderfire.\u003c/p\u003e\n\u003cp\u003eElderfire consisted of some of the most ancient types of fire! Golden Solarfire and Eternal Kindlefire were both on this level. The term ‘elderfire’ didn’t really exist in the Three Realms as practitioners in the Three Realms only knew of three types of fire on that level; Eternal Kindlefire, Golden Solarfire, and Zhurong Godfire.\u003c/p\u003e\n\u003cp\u003eIn truth, since there were many ways to cultivate and understand the Dao, there were many different ways to produce elderfire. If every person gave their own elderfire a special name, there would be an endless number of them. In the Three Realms, these three types of elderfire all had unique names, but in the endless primordial chaos they were all simply referred to as ‘elderfire’!\u003c/p\u003e\n\u003cp\u003eAdvancing beyond elderfire meant making a truly fundamental change. The flames would return to their original, purest form: chaosfire. Generally speaking, only World Gods and Chaos Immortals were capable of controlling chaosfire. A few incredibly talented Elder Gods or Ancestral Immortals would be capable of controlling it, but by far the vast majority were not. To find such a monstrous genius would be a thousand times more difficult than finding Vastheaven Palace.\u003c/p\u003e\n\u003cp\u003e“You…” Fuxi suddenly stared.\u003c/p\u003e\n\u003cp\u003eNing looked back at him.\u003c/p\u003e\n\u003cp\u003e“You’ve reached the overlord level of power?” Fuxi stared at Ning in shock and delight.\u003c/p\u003e\n\u003cp\u003e…….\u003c/p\u003e\n\u003cp\u003eThe Allclans Palace of the Three Realms.\u003c/p\u003e\n\u003cp\u003eThe Nuwa Alliance had become a hubbub of commotion.\u003c/p\u003e\n\u003cp\u003e“Graceful Peacock, don’t make jokes like that!” The seated Patriarch Subhuti was badly shocked.\u003c/p\u003e\n\u003cp\u003e“Right, Graceful Peacock. That’s not something you can just randomly claim. To be ‘close to the overlord level’ and to be ‘at the overlord level’ are two completely different concepts. Ji Ning is extraordinarily powerful, but don’t mistake that for him actually being an overlord-level figure.” Exalted Celestial Carefree no longer looked as laidback and carefree as usual. Instead, he looked excited as he nagged at Graceful Peacock.\u003c/p\u003e\n\u003cp\u003eAll of the major powers in the Allclans Palace were staring at Graceful Peacock.\u003c/p\u003e\n\u003cp\u003e“Graceful Peacock’s words are correct.” Close to her was Daofather Chijingzi. “I, Jade Cauldron, and the rest of our group all saw it for ourselves. Ji Ning is definitely much more powerful than all seven of us combined. Two Thearchs and six True Gods joined together into a formation, and the seven of us were unable to break the formation apart. Darknorth, however, was able to pierce it with his bare hands and kill all eight of them.”\u003c/p\u003e\n\u003cp\u003e“He killed eight True Gods?” All the major powers were stunned.\u003c/p\u003e\n\u003cp\u003e“Not just that. When the other eight True Gods who were attacking us saw what had happened, they immediately tried to flee…but Darknorth still killed them all.” Chijingzi shook his head. “Sixteen True Gods, with the Four Thearchs amongst their ranks. In a brief period of time, Darknorth slaughtered them all with ease. From this day forth…the Four Thearchs of the Primordial Ruinworld will be nothing more than an old legend. Oh, wait; I heard that Thearch Vileye has a second body.”\u003c/p\u003e\n\u003cp\u003eThe entire palace was silent for a moment as the major powers all exchanged glances. Then, yet another storm of noise erupted as quite a few major powers spoke out to ask more questions.\u003c/p\u003e\n\u003cp\u003e“Enough.” A voice rang out, and all the major powers turned to look. It was Lord Tathagata the Buddha, who sat at the very highest position.\u003c/p\u003e\n\u003cp\u003e“Ji Ning is indeed at the overlord level of power.” Lord Buddha nodded. “I can still hear that alien Outsider leader screaming and raving about it!”\u003c/p\u003e\n\u003cp\u003e“Congratulations.” Lord Buddha looked towards Subhuti. “You’ve gained yet another overlord-class figure under your tutelage.”\u003c/p\u003e\n\u003cp\u003e“Hahaha…”\u003c/p\u003e\n\u003cp\u003eSubhuti laughed delightedly.\u003c/p\u003e\n\u003cp\u003eHouyi had already been extremely powerful when he had joined Subhuti. Although they framed it as him taking on Subhuti as his master, in truth he was just hiding himself within Mount Innerheart.\u003c/p\u003e\n\u003cp\u003eIt was Ji Ning who had been truly trained by Subhuti. Subhuti had always held Ji Ning’s talent for the sword in high regard. Although Ji Ning had advanced considerably in heartforce, Subhuti had always felt that Ji Ning was still more talented in the sword. And indeed…Ji Ning had reached the fifth stage of swordforce, then became an overlord-level figure.\u003c/p\u003e\n\u003cp\u003e“If he was able to tear apart that formation with his bare hands, he’s probably become a True God.” Daoist Three Purities laughed.\u003c/p\u003e\n\u003cp\u003e“Right. If he’s become a Daofather, there would’ve been a resonance with the Heavenly Daos. He must have become a True God.” Subhuti laughed as well.\u003c/p\u003e\n\u003cp\u003e“He trained less than a thousand years, advancing from being an ordinary mortal to become an overlord. Incredible, simply incredible.” Shennong sighed in amazement as well.\u003c/p\u003e\n\u003cp\u003eAll the major powers seated below them revealed looks of amazement and joy. Their side had just gained yet another overlord; how could they not be delighted?\u003c/p\u003e\n\u003cp\u003eBut they were stunned as well.\u003c/p\u003e\n\u003cp\u003eOnly a few figures had ever stood at the very peak of power in the Three Realms. In the Nuwa Alliance, the only figures had been the two leaders of Daoism and Buddhism, the Three Sovereigns of Mankind, and great divinity Houyi. But now, yet another person had arisen to stand by their side…a Sword Immortal!\u003c/p\u003e\n\u003cp\u003eEver since Pangu had established Heaven and Earth, there had never been a Sword Immortal who could reach such heights.\u003c/p\u003e\n\u003cp\u003eDaofather Fuju was very famous and was once acknowledged as the number one Sword Immortal of the Three Realms, but he only held the same level of status as Subhuti. World God Northrest had been focused on keeping himself alive, after all, and he truly was quite weak compared to his true level of power; he wouldn’t even dare to fight against Mother Nuwa.\u003c/p\u003e\n\u003cp\u003eSwordfather Darklight, Daofather Holyflame, and the other Sword Immortals were even weaker than Daofather Fuju!\u003c/p\u003e\n\u003cp\u003eThe Pangu Chaosworld, the Seamless Chaosworld, the Three Realms…none of them had ever produced a Sword Immortal which stood at the very apex of power!\u003c/p\u003e\n\u003cp\u003eBut now!\u003c/p\u003e\n\u003cp\u003eA Sword Immortal had risen up to stand at the very peak of the Three Realms!\u003c/p\u003e\n\u003cp\u003eSword Immortal Darknorth! Ji Ning!\u003c/p\u003e\n\u003cp\u003e“Sword Immortal Darknorth.”\u003c/p\u003e\n\u003cp\u003e“Sword Immortal Darknorth.” Many of the major powers in the palace were all murmuring softly to themselves. A sense of dread and respect arose in their hearts, a natural dread that one would feel towards those that were more powerful than one’s self!\u003c/p\u003e\n\u003cp\u003eMany of the major powers would casually refer to Ning as ‘Ji Ning’. Now, however, they no longer dared to do so. They would now respectfully refer to him by his Daoist title of ‘Darknorth’. Only those who were very close to Ning, such as Subhuti, or those who were extremely powerful, such as Daoist Three Purities and Tathagata, would continue to address Ning by his given name.\u003c/p\u003e\n\u003cp\u003eFrom this day forth!\u003c/p\u003e\n\u003cp\u003eJi Ning stood at the same lofty heights as Three Purities, Suiren, Tathagata, and the other overlords!\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-22-chapter-22\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-22-chapter-24\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-22-chapter-23","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
