{"id":50415,"no":718,"title":"Book 22, Chapter 26 - Battling Godfiend Witherspike","content":"\u003cp\u003e“Can this all be due to Nuwa? Are these techniques that she left behind?” Godfiend Witherspike muttered to himself, “This all came out of nowhere. Now that another troublesome individual like Darknorth has appeared…it seems that taking over the Three Realms and taking away its Worldheart will be even harder than I thought.”\u003c/p\u003e\n\u003cp\u003eThe thing which Godfiend Witherspike desired the most was the Worldheart.\u003c/p\u003e\n\u003cp\u003eIn fact, the Three Realms was formed from the collision of the Pangu Chaosworld and the Seamless Chaosworld. That meant that its Worldheart was most likely the combined Worldhearts of those two chaosworlds. If so, would be even more valuable!\u003c/p\u003e\n\u003cp\u003e“Those who bar my path shall die.” A savage light flickered in Godfiend Witherspike’s eyes as he suppressed all extraneous thoughts.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Keep holding on for just a little while longer,” Fuxi sent hurriedly. “I’m about to break the formation apart!”\u003c/p\u003e\n\u003cp\u003e“Alright.” The towering Ji Ning continued to tear at the formation with four arms while defending against Saber with his other two.\u003c/p\u003e\n\u003cp\u003e“Hmph.” Saber frowned. Seeing that he couldn’t stop Ning, Saber suddenly turned and walked away, disappearing from Ning’s field of vision.\u003c/p\u003e\n\u003cp\u003e“He actually retreated?” Ning couldn’t be bothered to over-analyze the matter. He immediately used all six of his hands to tear at the great formation.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eJi Ning suddenly sensed the strength of the formation begin to dramatically weaken, then vanish entirely. He had been pulling at the rip with all his power; now, all of a sudden, he ripped it completely apart by accident. BOOM! The surrounding area completely exploded, causing many spatial cracks and tears that quickly healed.\u003c/p\u003e\n\u003cp\u003e“The formation has been breached!” Fuxi said hurriedly.\u003c/p\u003e\n\u003cp\u003e“Quick, go save Lord Buddha,” Ning barked back. As the formation broke apart, the surrounding area returned to its normal appearance. Ning could now actually see the golden figure of Lord Buddha seated in the lotus position off in the distance. A Fiendgod with a long tail, loose hair, and an aura of incomparable savagery was furiously assaulting the seated figure, with many of the alien Outsiders of the Primordial Chaosworld helping him out.\u003c/p\u003e\n\u003cp\u003e“Hurry.” Instantly, Fuxi, Kuafu, Daoist Jade Cauldron, and the others all transformed into streaks of light and flew forward.\u003c/p\u003e\n\u003cp\u003e“So that’s the other Outsider overlord?” Ning immediately noticed the jade-tailed alien Outsider. The man was completely bald and looked rather handsome. He had completely suppressed Lord Buddha in power. In the face of his assaults, Lord Buddha was only able to completely focus on defense.\u003c/p\u003e\n\u003cp\u003e“Outsiders!” Upon seeing his old friend in such dire straits, Fuxi immediately let out an angry roar. “Die!”\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eInstantly, the Waterflame Apocalypse Formation descended. The surrounding area for a million kilometers became filled with Arcane Moonwater and Eternal Kindlefire.\u003c/p\u003e\n\u003cp\u003eThere were dozens of major powers from the Primordial Ruinworld. For a situation like this, a large formation that could launch area attacks was the ideal tool.\u003c/p\u003e\n\u003cp\u003e“Careful.” None of the alien True Gods or Daofathers dared to continue with their attacks against Tathagata. Instead, they focused completely on protecting themselves.\u003c/p\u003e\n\u003cp\u003e“This elderfire…” The three Waterians frowned as well as they hid themselves within the formation.\u003c/p\u003e\n\u003cp\u003eOnce this formation appeared, the power of the Primordial Ruinworld arrayed against Lord Buddha instantly lessened.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eA black lightning serpent flashed through the skies, launching an initial strike against the alien Outsiders.\u003c/p\u003e\n\u003cp\u003eNing gripped a sword in each of his six arms. Five were Darknorth swords while the sixth was Violetjewel. Things were quite critical and Ning could tell that Lord Buddha wouldn’t be able to hold on for much longer; he could very well perish any moment now. At a time like this, he had to fight with full power.\u003c/p\u003e\n\u003cp\u003e“Master, I’ll stop him.” The red-bearded elder let out a low growl, his red beard instantly expanding dramatically in size as it struck out towards Ning.\u003c/p\u003e\n\u003cp\u003eOf the six retainers who followed Godfiend Witherspike, Saber was the most powerful. Next in power was the red-bearded elder! As for the three Waterians, they could just barely reach the Elder God level of power after joining together in a formation, but they were only really skilled in defense.\u003c/p\u003e\n\u003cp\u003e“Hmph.” Ning struck out with his six swords.\u003c/p\u003e\n\u003cp\u003eWhoosh! Whoosh! Whoosh! Whoosh! Whoosh! Whoosh!\u003c/p\u003e\n\u003cp\u003eSix dazzling streaks of sword-light instantly sliced across the skies. The skies had been completely covered by the endless strands of red beard, but all the strands were instantly shattered apart. The red-bearded elder’s face turned paled with shock, and he hurriedly retereated to hide behind the formation that had been set up by those dozens of alien True Gods. He sent mentally in panic, “Master, Sword Immortal Darknorth is shockingly strong. I’m unable to stop him.”\u003c/p\u003e\n\u003cp\u003eAfter shattering the old man’s red beard, Ning charged straight towards Lord Tathagata in an attempt to rescue him.\u003c/p\u003e\n\u003cp\u003e“Saber, you go deal with Fuxi. Leave Ji Ning to me.” Godfiend Witherspike knew that, given how Saber and Ji Ning specialized in attacks and how tough Ji Ning’s body was, it was unlikely that Saber would be able to succeed in doing anything to Ji Ning. Fuxi wasn’t that offensively powerful; it would actually be a bit tougher for him to face Saber.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Saber nodded.\u003c/p\u003e\n\u003cp\u003eSwoosh! Godfiend Witherspike flew towards Ji Ning.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eA streak of light suddenly curved towards Ning without any warning at all. Ning was badly startled, but fortunately he had been using his heartforce to constantly scan the area.\u003c/p\u003e\n\u003cp\u003e“Fast! So this Outsider overlord’s tail has actually surpassed the limits of the Heavenly Daos!” Ning was truly surprised.\u003c/p\u003e\n\u003cp\u003eGodfiend Witherspike was able to attack with his tail at incredible speed. Ning immediately chopped out with his sword.\u003c/p\u003e\n\u003cp\u003eClang! Sparks appeared as the sword clashed with the tail. Godfiend Witherspike’s body was tremendously durable as well.\u003c/p\u003e\n\u003cp\u003e“He actually managed to block with ease?” Godfiend Witherspike frowned as he manifested a total of six arms, continuing his attacks against Ning.\u003c/p\u003e\n\u003cp\u003eThe two instantly began to battle against each other in midair, six arms against six arms.\u003c/p\u003e\n\u003cp\u003eAs the battle began, Ning realized that although Godfiend Witherspike was very strong, only his tail had surpassed the limits of the Heavenly Daos; his arms had not!\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eSuddenly, Ning unleashed Violetjewel. Prior to this, he had been hiding Violetjewel’s full power, keeping it weak and in line with the other five Darknorth swords. Now, however, Ning suddenly slammed Violetjewel down as he used the ‘Heavenbreaker stance’ of th [Brightmoon] sword-art.\u003c/p\u003e\n\u003cp\u003eBOOOM!\u003c/p\u003e\n\u003cp\u003eVioletjewel crashed down like the thunder, slamming down against Godfiend Witherspike’s pale white arm. Godfiend Witherspike’s face instantly changed dramatically as he was knocked backwards.\u003c/p\u003e\n\u003cp\u003e“What?!” All the major powers of the Primordial Ruinworld were shocked. It had seemed as though the Godfiend had held the upper hand in his fight against Sword Immortal Darknorth. How was it that he was suddenly sent flying backwards?\u003c/p\u003e\n\u003cp\u003e“You were actually hiding your true power?” Godfiend Witherspike let out a bellow, then charged forward once more.\u003c/p\u003e\n\u003cp\u003e“Even when I use Violetjewel, I don’t have much of an advantage over him.” Ning also frowned as he charged forward as well.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom!\u003c/p\u003e\n\u003cp\u003eThe two exchanged lightning-fast attacks as they battled furiously.\u003c/p\u003e\n\u003cp\u003eNing had the advantage of Violetjewel.\u003c/p\u003e\n\u003cp\u003eWitherspike had the advantage of being a true Elder God.\u003c/p\u003e\n\u003cp\u003eThe two actually battled to a complete standstill! This sight caused both the powers of the Nuwa Alliance and the powers of the Primordial Ruinworld to feel shocked.\u003c/p\u003e\n\u003cp\u003e“The alien Outsider is actually this powerful?”\u003c/p\u003e\n\u003cp\u003e“Sword Immortal Darknorth is actually this powerful?”\u003c/p\u003e\n\u003cp\u003eBoth sides were stunned.\u003c/p\u003e\n\u003cp\u003eThe Nuwa Alliance was stunned at Witherspike’s power. The Primordial Ruinworld was stunned at Ji Ning’s power! Even though Ji Ning was an overlord-class figure, they had thought that since Ji Ning had trained for less than a thousand years, he was still inexperienced. Moments ago, Ji Ning had revealed a truly shockingly powerful protective divine ability…and now, he had revealed that his attacks were every bit as powerful as those of this Outsider overlord!\u003c/p\u003e\n\u003cp\u003eMore than half a chaos cycle had gone past since the war that ended the Primordial Era. There were some major powers who were hiding their improvements; it was entirely possible, for example, that Daoist Three Purities’ ‘Immortal Slaying Formation’ was even more powerful than Ji Ning’s attacks.\u003c/p\u003e\n\u003cp\u003eBut…\u003c/p\u003e\n\u003cp\u003eIn terms of speed, Ji Ning had the [Ninehorn Lightning Serpent] technique.\u003c/p\u003e\n\u003cp\u003eIn terms of defense, he had the [Golden Statue] technique.\u003c/p\u003e\n\u003cp\u003eIn terms of attack, he stood at the very peak of the Three Realms.\u003c/p\u003e\n\u003cp\u003eJi Ning had no apparent weaknesses at all. This made him even more dangerous, as he could deal with all types of situations. Any major power, Godfiend Witherspike included, would feel a headache coming when they had to fight against Ji Ning.\u003c/p\u003e\n\u003cp\u003e“Inexperienced? Inexperience my ass! Those Seamless Gate idiots! They kept on toying and toying and toying with him…and now, those imbeciles have ended up creating a freak of an enemy.” Godfiend Witherspike ground his teeth. “There’s no point to fighting against him like this. He’s too powerful; there’s no way I can kill him. I should focus on killing Tathagata instead.”\u003c/p\u003e\n\u003cp\u003e“Hmph. Sword Immortal Darknorth…I paid quite the price to acquire this formation. I wouldn’t be willing to use it against just anybody,” Godfiend Witherspike mused to himself.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eIn the same instant that the two exchanged blows yet again, Godfiend Witherspike suddenly waved his hand.\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang! Bang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eSix utterly enormous stone pillars suddenly appeared out of nowhere, descending from the heavens to cover an area of tens of thousands of kilometers. The stone pillars instantly began to radiate with blurry light, completely sealing off the outside world and causing space itself to turn blurry.\u003c/p\u003e\n\u003cp\u003e“Darknorth!” Fuxi and the others were shocked as they saw this enormous blurry formation descend and trap Darknorth within it.\u003c/p\u003e\n\u003cp\u003e“Fuxi, correct?” Godfiend Witherspike turned his head to smile coldly at Fuxi. “I heard that your skill in formations is the best amongst the locals. Go ahead and try to break this one if you can, ahaha…”\u003c/p\u003e\n\u003cp\u003eFuxi’s heart had turned cold as he soon as he saw those six stone pillars. The stone pillars were covered with extremely arcane runes. These runes contained incredibly profound mysteries of space within them, and Fuxi’s head turned dizzy as soon as he looked at them. He instantly understood that this was definitely a formation that vastly, vastly outstripped any formation he had ever made. There was no way he would ever be able to possibly break it.\u003c/p\u003e\n\u003cp\u003eHis guess was correct. This was a formation that had been created by a Chaos Immortal who was skilled in the art of formations. It was one of the trump cards which Godfiend Witherspike used when he adventured in the primordial chaos to trap tough foes.\u003c/p\u003e\n\u003cp\u003eIf you wanted to survive adventuring through the primordial chaos, you needed to have some trump cards up your sleeve.\u003c/p\u003e\n\u003cp\u003eThe Waterians under his command were another set of trump cards; when he encountered great danger, he would force those three servants of his to go block for him. However, they were only one of his ‘ordinary’ trump cards. This formation was one of his most important ones. Once unleashed, any foe trapped within would need to spend a long period of time before being able to overcome it. By then, he would’ve fled long ago.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eI might not be able to kill you, but I can trap you!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eGodfiend Witherspike had paid quite a heavy price to acquire this item. If it wasn’t for the fact that Ji Ning was incredibly powerful, he wouldn’t have been willing to use this treasure at all. If a foe spent enough time figuring out how the formation worked, he would be able to break through it and render it completely useless in the future. This sort of formation was generally a single-use item; Witherspike certainly didn’t have the ability to remake it or repair it!\u003c/p\u003e\n\u003cp\u003e“First, I’ll kill Tathagata. Then, if I have enough time, I’ll kill Fuxi as well,” Godfiend Witherspike mused to himself.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing had started to battle against Godfiend Witherspike again. Just as he had been knocked backwards a few steps, he saw six stone pillars descend out of nowhere. Immediately afterwards, the area around him turned blurry.\u003c/p\u003e\n\u003cp\u003eNeither heartforce nor coresense could see past the haze, and he was only able to physically see to a distance of three hundred meters.\u003c/p\u003e\n\u003cp\u003e“A formation?” Ning stared at the blurry area around him. “I’ve been trapped in a formation?”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-22-chapter-25\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-22-chapter-27\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-22-chapter-26","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
