{"id":50422,"no":725,"title":"Book 23, Chapter 4 - A Meeting","content":"\u003cp\u003e“The Badlands Everworld?” Ji Ning was secretly surprised.\u003c/p\u003e\n\u003cp\u003eOthers in the Three Realms might not know what the phrase ‘everworld’ truly represented, but Ning did. World God Northrest’s own ‘Vastheaven Palace’ resided in an everworld. Every single everworld was a place which the cultivators of the primordial chaos would be willing to fight for in an utterly berserk manner.\u003c/p\u003e\n\u003cp\u003e“Ji Ning.” Lord Cui waved his hand again, causing yet another jade slip to fly out from the wooden room. He handed it straight to Ning. “This holds everything we know about the outside world.”\u003c/p\u003e\n\u003cp\u003eNing quickly accepted it, sweeping it with his coresense.\u003c/p\u003e\n\u003cp\u003e“My oh my.” Ning took a deep breath.\u003c/p\u003e\n\u003cp\u003eThings were pretty much as he had guessed.\u003c/p\u003e\n\u003cp\u003eVastheaven Palace was in control of the Vastheaven Everworld, while the Badlands Court was in control of the Badlands Everworld.\u003c/p\u003e\n\u003cp\u003eBased on the detailed information in the jade slip, Ning was able to estimate roughly how powerful this force in control of the Badlands Everworld was.\u003c/p\u003e\n\u003cp\u003e“I didn’t expect for it to be a force comparable to Vastheaven Palace,” Ning mused to himself. “In this vast region, at least, the Badlands Everworld is the center of the universe. Right…in the future, I’ll definitely have to pay a visit to the Badlands Everworld. I trust that the powerful experts of the Badlands Everworld, such as its World Gods or Chaos Immortals, must have journeyed to distant lands. They might know where Vastheaven Palace is.”\u003c/p\u003e\n\u003cp\u003eThe only Outsiders the Nuwa Alliance had ever slain were at most at the Elder God or Ancestral Immortal level of power.\u003c/p\u003e\n\u003cp\u003eThe more powerful one was, the more one would know!\u003c/p\u003e\n\u003cp\u003ePerhaps there were some within the Badlands Everworld who knew of Vastheaven Palace.\u003c/p\u003e\n\u003cp\u003e“Finished reading?” Lord Cui let out a sigh. “According to the information in that slip, it is very likely that this region contains many World Gods and Chaos Immortals. Compared to them…those of us in the Three Realms truly are puny, backwards figures.”\u003c/p\u003e\n\u003cp\u003eNing nodded slowly.\u003c/p\u003e\n\u003cp\u003eGenerally speaking, every ten chaosworlds would give birth to just one World God! This was fairly normal. From the vast size of this territory, one could imagine how many Chaos Immortals and World Gods it held. Still, precisely because of how vast this territory was, there was no way to fly or teleport across it. One had to use spacetime transfer arrays in order to reach certain places.\u003c/p\u003e\n\u003cp\u003eBecause of how vast the territory was and how many dangerous areas it contained, the various World Gods and Chaos Immortals were all scattered into many different regions, causing the territory as a whole to become quite chaotic.\u003c/p\u003e\n\u003cp\u003eIn comparison, the Three Realms could be considered something of a paradise.\u003c/p\u003e\n\u003cp\u003eTo Godfiend Witherspike and the Lord of All Fiends, the Three Realms was merely a chaosworld that was not part of the territory of any World God or Chaos Immortal. To them, it was like manna from the heavens; of course they had to do their best to try and take it over! The price of a Worldheart was far greater than the price of their very lives!\u003c/p\u003e\n\u003cp\u003e“The primordial chaos truly is endlessly vast.”\u003c/p\u003e\n\u003cp\u003e“Vastheaven Palace is in a different, distant corner of it, but the Badlands Court reigns supreme here. I wonder how long it will be before I can reach Vastheaven Palace?” Ning mused silently to himself. “Forget it. No point worrying about it now. Let’s see if we can even win the Endwar and if I can even survive it.”\u003c/p\u003e\n\u003cp\u003eThey all boarded the wooden ship and departed from the Nuwa Immortal Realm. As they did, Ning continued to ponder to himself.\u003c/p\u003e\n\u003cp\u003eUpon learning that their side had two Elder Gods, Suiren and Gonggong, Ning had originally grown excited. Now, however, he began to worry a bit. The Nuwa Alliance was so powerful...how powerful, then, was the Seamless Gate? It was the Seamless Gate who had instigated the war, after all! They had launched an attack on the Six Paths of Reincarnation, causing the Three Realms to be thrown into a state of chaos.\u003c/p\u003e\n\u003cp\u003eFor them to dare do such a thing…could it be that they didn’t have their own reasons for feeling confident?\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter. If soldiers attack, let the generals deal with them; if a flood comes, build earthen ramparts to stop it!” A hint of fierceness flashed through Ning’s eyes. “We can’t afford to lose this war! If we lose…even if my daughter and my loved ones survive, they’ll be chased and attacked and forced into the primordial chaos.”\u003c/p\u003e\n\u003cp\u003eIf they lost the war, Subhuti would lead the survivors in fleeing! However, Ning knew exactly how dangerous the primordial chaos was. Even Elder Gods and Ancestral Immortals could easily lose their lives wandering through it. His daughter, Brightmoon, was still too weak. There was no way he could protect her at all.\u003c/p\u003e\n\u003cp\u003e“We can’t lose.”\u003c/p\u003e\n\u003cp\u003eThis was a war between two great alliances. A war for survival itself.\u003c/p\u003e\n\u003cp\u003e“Before the Endwar begins, I have to master the Heavenly Dao of Water,” Ning mused to himself.\u003c/p\u003e\n\u003cp\u003e“Ji Ning, where shall you go to next?” Subhuti looked towards Ning. “Back to the Crescent world, or…?”\u003c/p\u003e\n\u003cp\u003e“For now, I won’t return to the Crescent world.” Ning shook his head. “I wish to wander through the Three Realms a bit. I want to see more of the world, more of Heaven and Earth. I hope to be able to master a Heavenly Dao before the Endwar begins.”\u003c/p\u003e\n\u003cp\u003e“Right.” Subhuti smiled and nodded. “Your talent in swordforce is impressive, but if you wish to become an Elder God or a Daofather you have to first master a Heavenly Dao.”\u003c/p\u003e\n\u003cp\u003eNing nodded, then parted from Fuxi and Subhuti for now.\u003c/p\u003e\n\u003cp\u003eNing’s true body began to journey through the Three Realms.\u003c/p\u003e\n\u003cp\u003eSometimes, he would sit on a boat and just watch the waters of the river flow past him.\u003c/p\u003e\n\u003cp\u003eSometimes, he would stand on the peak of a mountain, head raised as he stared at the dark stormclouds in the skies, presaging the arrival of a rainstorm.\u003c/p\u003e\n\u003cp\u003eSometimes, he would rest within an ancient monastery, watching as storms of rain descended upon the world outside.\u003c/p\u003e\n\u003cp\u003eSometimes, he would soar atop the clouds, watching the waves roll and spin about through the ocean.\u003c/p\u003e\n\u003cp\u003eWater…it could sometimes be gentle, like a mother’s caress.\u003c/p\u003e\n\u003cp\u003eWater…it could be as cold as ice, capable of chilling you to the bone.\u003c/p\u003e\n\u003cp\u003eWater…it could be utterly devastating, capable of shattering Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eWater…it could be joyful, dancing and drifting about the skies.\u003c/p\u003e\n\u003cp\u003eThe Primaltwin remained within the Heavengazer Tower, constantly focusing on the Dao. The true body continued to voyage through the Three Realms, seeing water in all of its many forms.\u003c/p\u003e\n\u003cp\u003eMist, waves, glaciers…all of them were water.\u003c/p\u003e\n\u003cp\u003e“Eh?”\u003c/p\u003e\n\u003cp\u003eA white-robed youth was relaxing by the side of a river, holding a fishing rod in his hands. He suddenly revealed a hint of a smile as he tugged at the fishing rod. Plop! A large fish flew up from the surface of the water, landing next to him by the side of the river. The white-robed youth immediately grabbed the fish, then tossed it into the fish bucket next to him. The bucket already contained six fish inside of it.\u003c/p\u003e\n\u003cp\u003e“Some fish stew would be nice.” The white-robed youth rebaited his hook, then flung it back into the waters of the river.\u003c/p\u003e\n\u003cp\u003eWhile acting like an ordinary mortal, fishing and swimming and boating, Ning was able to discover a different side to water. For ordinary mortals, water was necessary to life. However, it was also filled with great danger. Living the life of an ordinary mortal and experiencing water as they experienced it had caused Ning to gain many more insights….and so Ning had chosen to live life as an ordinary mortal for a time.\u003c/p\u003e\n\u003cp\u003eSplash, splash. A distant ferry was slowly crossing from the other side of the river. This river was very wide, so wide that there were large waves even when there was no wind. There was a small wind today, and it caused the waves of the river to grow greater and greater, resulting in the raft beginning to rock violently.\u003c/p\u003e\n\u003cp\u003e“Ahhh!”\u003c/p\u003e\n\u003cp\u003e“Help!”\u003c/p\u003e\n\u003cp\u003eA series of cries could be heard. The captain of the ferry did his best to keep the boat on an even keel, but as it continued to rock a young child who was seated on the ferry fell into the water. Instantly, a nearby middle-aged man cried out in shock and dove into the water.\u003c/p\u003e\n\u003cp\u003eNing was seated at the banks of the river. Upon hearing the distant cries, he raised his head to take a look. Upon seeing the situation, he let out a soft sigh and waved his hand.\u003c/p\u003e\n\u003cp\u003eWhooooosh.\u003c/p\u003e\n\u003cp\u003eIt was like a giant, invisible hand had suddenly lifted the ferry up. Even the middle-aged man and the child, both of whom were in the water, were lifted up into the air. The ferry, the child, and the middle-aged man all flew through the air. They couldn’t help but stare at each other, then stare at their surroundings in shock and terror.\u003c/p\u003e\n\u003cp\u003eThe ferry, the child, and the middle-aged man all landed on the other side of the distant riverbanks.\u003c/p\u003e\n\u003cp\u003e“Thank you, Dragon King!”\u003c/p\u003e\n\u003cp\u003e“Thank you for your great mercy, Dragon King!”\u003c/p\u003e\n\u003cp\u003eThe ordinary mortals hurriedly kowtowed towards the water, believing that some great sea deity had just saved them.\u003c/p\u003e\n\u003cp\u003eFar off in the distance, Ning continued to sit there and fish. Suddenly, he couldn’t help but sigh a little. Life was so fragile and weak. If he hadn’t just happened to be here, it was likely that many of the passengers on that ferry would have died.\u003c/p\u003e\n\u003cp\u003eSuddenly, the waters of the river surged and parted, creating a corridor. A distant wooden boat sailed through the watery corridor, a red-nosed elder rowing the boat forward. In a very relaxed fashion, he rowed the boat all the way over to Ning.\u003c/p\u003e\n\u003cp\u003e“Ji Ning, long time no see.” The red-nosed elder chortled as he spoke.\u003c/p\u003e\n\u003cp\u003eJi Ning revealed a hint of delight as well as he hurriedly rose to his feet. “I had the feeling all day long that my luck was pretty good. I managed to catch six big fish! That’s a lot more than I usually catch. I was wondering if something was going to happen today, given my luck…but I didn’t expect to run into you, Old Man Yuan.”\u003c/p\u003e\n\u003cp\u003eOld Man Yuan had graced him with kindness in the past. Not only had he saved Ning, he had also bequeathed unto Ning the [Heart Sutra].\u003c/p\u003e\n\u003cp\u003eStill…the war between the two alliances had begun, and Old Man Yuan still had yet to choose a side. Ning couldn’t help but feel a sliver of unhappiness when seeing the man.\u003c/p\u003e\n\u003cp\u003e“Would you be willing to board this old man’s boat and chat a bit?” Old Man Yuan asked with a smile.\u003c/p\u003e\n\u003cp\u003e“Can I bring my fish?” Ning laughed.\u003c/p\u003e\n\u003cp\u003e“Of course.” Old Man Yuan nodded.\u003c/p\u003e\n\u003cp\u003eJi Ning hoisted up his fish bucket and his fishing rod, then stepped onto Old Man Yuan’s boat. Old Man Yuan looked at Ji Ning. Ji Ning moved as though he was an ordinary mortal, but with every movement he radiated a hidden, reserved power. Old Man Yuan couldn’t help but sigh. “He truly is extraordinary.”\u003c/p\u003e\n\u003cp\u003eThunk. Ning set the fish bucket down at the prow of the boat, then sat down in the lotus position facing Old Man Yuan. In front of them was a wooden table, and on the wooden table was a flask of wine and two winecups.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-23-chapter-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-23-chapter-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-23-chapter-4","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
