{"id":50446,"no":749,"title":"Book 23, Chapter 28 - I Have a Solution","content":"\u003cp\u003eAlthough the dark-golden castle had fled far away, Godfiend Witherspike had left an incarnation behind.\u003c/p\u003e\n\u003cp\u003e“He’s actually one of the Nine Divine Generals of God Emperor Blacklotus…” Godfiend Witherspike watched from afar. “Hmph. I need to keep my true body far away from this man, but this battle is still worth watching. I might still have a chance.” Godfiend Witherspike was far less nervous now that his true body wasn’t at any risk. There was no longer any danger here.\u003c/p\u003e\n\u003cp\u003e“The Nine Divine Generals are all famous figures, with the Mindlord being a particularly formidable Heartforce Cultivator.” Godfiend Witherspike’s eyes suddenly lit up. “They’ve started to fight.”\u003c/p\u003e\n\u003cp\u003eIn the Void.\u003c/p\u003e\n\u003cp\u003e“It seems that the formations which Nuwa left behind are just so-so after all.” Old Man Yuan said calmly, “Assemble my formation.”\u003c/p\u003e\n\u003cp\u003eElder God Gonggong, Daofather Ink Bamboo, Fuxi, and the other major powers all quickly assembled into formations. They drew upon the power of chaos, centering it around Old Man Yuan and forming an enormous formation around him. A giant black lotus flower began to bloom around him, a lotus flower with a total of three lotus petals.\u003c/p\u003e\n\u003cp\u003eOld Man Yuan stood atop the center of the black lotus, flywhisk in hand. Next to him stood Chang’e, the mistress of the Lunar Palace which was also known as the Frozen Palace. Elder God Gonggong, Daofather Ink Bamboo, and Fuxi each commanded a squad of major powers, with the three squads standing on those three black lotus petals.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eChaos energy began to surge violently.\u003c/p\u003e\n\u003cp\u003eOld Man Yuan and his subordinates had joined their powers together perfectly, and their combined aura was far more powerful than that of Lord Demonheart’s.\u003c/p\u003e\n\u003cp\u003e“Kill.” Old Man Yuan’s eyes were filled with lofty disdain, as though he was staring down at a pile of ants. This was his true face, the face of the Mindlord.\u003c/p\u003e\n\u003cp\u003eThe Seamless Gate and the Nuwa Alliance had both become enraged long ago. The sudden betrayal had caused devastating losses to both their sides, and their hearts were filled with endless hatred. The only reason why they had not attacked was because they wanted to get a better understanding of Old Man Yuan first. Now, they understood that Old Man Yuan was actually a terrifyingly powerful alien Outsider, one who had lain in wait for a long period of time and who had silently taken control over quite a few major powers. He was an even more terrifying figure than the long-deceased Lord of All Things had been.\u003c/p\u003e\n\u003cp\u003eSwish.\u003c/p\u003e\n\u003cp\u003eSwish.\u003c/p\u003e\n\u003cp\u003eSwish.\u003c/p\u003e\n\u003cp\u003eThree dazzling streaks of light shot through the air towards Old Man Yuan.\u003c/p\u003e\n\u003cp\u003eThese streaks of light were Ji Ning’s Triult Swords, Daoist Three Purities’ Immortal Slaying Swords, and the Lord of All Fiend’s shuttle. These were the three fastest attackers. Because Old Man Yuan was somewhat closer to the Seamless Gate, the Lord of All Fiend’s attack was actually the first to arrive.\u003c/p\u003e\n\u003cp\u003e“You backwater locals.” Old Man Yuan calmly willed the lotus petals to swivel slightly.\u003c/p\u003e\n\u003cp\u003eBoom! The sharp shuttle stabbed directly against the slowly swiveling black lotus petals but was completely blocked.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! The attacks from the Triult Swords and the Immortal Slaying Swords arrived as well. The black lotus simply slowly swiveled to block the two attacks. Although it trembled, it was still able to endure the strikes.\u003c/p\u003e\n\u003cp\u003eOne of the enormous lotus petals gently brushed against the body of the Lord of All Fiends, who had moved into close combat range. He was knocked flying backwards and he vomited up a mouthful of blood.\u003c/p\u003e\n\u003cp\u003e“You can’t take those attacks head-on. Those lotus petals are as powerful as Demonheart was.” The Lord of All Fiends sent a hurried mental message to the others. He was more than fast enough to have dodged the attack, but he wanted to test those black lotus petals and see how powerful they were.\u003c/p\u003e\n\u003cp\u003eThis caused the major powers in both alliances to feel their hearts grow cold.\u003c/p\u003e\n\u003cp\u003eJi Ning, Three Purities, the Lord of All Fiends…the three of them striking out essentially represented the three most powerful attackers in both alliances striking out. Although they had caused the black lotus petals to tremble, it was still clearly quite stable and far from the point of breaking down.\u003c/p\u003e\n\u003cp\u003eAnd a single, simple strike from a petal was comparable to a blow from Lord Demonheart?\u003c/p\u003e\n\u003cp\u003eT-this…\u003c/p\u003e\n\u003cp\u003eBoom! The enormous black lotus came smashing straight towards the Seamless Gate.\u003c/p\u003e\n\u003cp\u003e“What should we do?”\u003c/p\u003e\n\u003cp\u003e“How should we stop him?”\u003c/p\u003e\n\u003cp\u003eThe major powers of the Seamless Gate and the Nuwa Alliance were both panicking. After suffering such heavy losses a few moments ago, both sides were now much weaker than before. Even the attacks of Ji Ning, Three Purities, and the Lord of All Fiends had been useless against the black lotus. Most likely, even if everyone in both alliances attacked together they still wouldn’t be able to breach its defenses.\u003c/p\u003e\n\u003cp\u003e“I have a solution. It might be able to kill Old Man Yuan.” A voice suddenly rang out in the minds of the overlords of both the Nuwa Alliance and the Seamless Gate.\u003c/p\u003e\n\u003cp\u003e“Subhuti.” Three Purities, Tathagata, and the others were intrigued.\u003c/p\u003e\n\u003cp\u003e“Master?” Ji Ning was stunned.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Crescent world.\u003c/p\u003e\n\u003cp\u003eSubhuti was standing atop the clouds, staring at past the skies towards the war in the Three Realms. He was able to see everything very clearly.\u003c/p\u003e\n\u003cp\u003e“Shennong…given what has come to pass, it is time to use that flower.” A hint of grief could be seen in Subhuti’s eyes as a fiery red flower appeared in his hands. “A pity that you won’t be able to see it.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSix years ago.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe two of them were standing together at a farm deep within the primordial chaos. There was a thatched cottage by the side of the farm, and Shennong, dressed as an old farmer, was smiling as he pointed towards a certain plot. “See that, Subhuti?”\u003c/p\u003e\n\u003cp\u003eThe restrictive formations covering the field had already been withdrawn, revealing its true appearances. There were small creeks and many different plots, with a fiery red flower having appeared in the very center of the field.\u003c/p\u003e\n\u003cp\u003e“What’s that?” Subhuti paused for a moment, then his face changed slightly. “I-I…why do I sense your aura in it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eShennong said softly, “That’s because I used my own blood and soul to nourish it. Finally, just before the Endwar, it has come to maturity. This is the most terrifying plant that I have ever created in all my life. Normally, I delight in creating medicinal plants that can save lives. But this time…I have a bad feeling about this Endwar. I feel as though there has to be someone causing it, someone scheming behind our backs.”\u003c/p\u003e\n\u003cp\u003e“Yes. Who is causing this great calamity?” Subhuti frowned as well. “The Seamless Gate has coexisted peacefully with us for countless ages now. Why, then, am I now subconsciously sensing that destiny is telling us that either we survive or they survive? What is happening?”\u003c/p\u003e\n\u003cp\u003e“I’ve poured my heart and soul into the art of plants and flowers.” Shennong smiled. “I’m afraid that I won’t be of that much use when the war begins. I suppose this flower is the only real contribution I can make.”\u003c/p\u003e\n\u003cp\u003e“This flower is for you to use.” Shennong looked at Subhuti.\u003c/p\u003e\n\u003cp\u003e“Me?” Subhuti was stunned.\u003c/p\u003e\n\u003cp\u003e“Nuwa trusted you. I trust you as well.” Shennong nodded. “This flower has a very simple name. It is the ‘Lifeseizer Flower’. When the flower blooms, it shall seize away life! Right now, it has yet to bloom. Once you fill it with your divine power, you’ll be able to make it bloom…and once it does, everything within thirty meters shall be attacked by it. Even Elder Gods will see their souls shattered and even their truesouls annihilated.”\u003c/p\u003e\n\u003cp\u003eSubhuti was shocked by what he heard.\u003c/p\u003e\n\u003cp\u003e“However, you need to get within thirty meters of your target,” Subhuti said. “My concern is that the instigator of the Endwar will appear and be too powerful for me to handle. If I’m too weak, I won’t even be able to draw near him. But you, Subhuti, have incredible mastery over the Dao of Spacetime. You can silently draw near our opponent…although you’ll probably have to sacrifice a bit of divine power once you lose that clone.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Subhuti nodded. This definitely was a killer weapon for them to keep hidden.\u003c/p\u003e\n\u003cp\u003e“Subhuti…remember, you can’t use this weapon casually. It can only be used once, after all,” Shennong said.\u003c/p\u003e\n\u003cp\u003e“I understand.” Subhuti nodded.\u003c/p\u003e\n\u003cp\u003eShennong nodded slowly as well. “I hope to one day see the beauty of the flower blooming…and yet, I also hope that day will never come.”\u003c/p\u003e\n\u003cp\u003eFor the flower to bloom meant that they were in truly desperate straits.\u003c/p\u003e\n\u003cp\u003e“You might be worrying just a bit too much.” Subhuti smiled. “You know how powerful our side is, and we also have the three guardian formations. On the whole, we should be overwhelmingly more powerful than the Seamless Gate.”\u003c/p\u003e\n\u003cp\u003e“No one can predict the future. It is best to be cautious.” Shennong turned to stare at the creeks flowing through his fields and the tiny little eddies within them. “You and I are different. Suiren and I both watched as our fragile little human race slowly rose to prominence. Many of our comrades died during that process. That’s why I know that life and death are both unpredictable things. There will always be unexpected events in every war.”\u003c/p\u003e\n\u003cp\u003e“Look at those little eddies in the creeks. They can represent all the deceased heroes of the human race. Their risked their lives for the sake of giving their descendants a brighter, safer future. This tribulation is a great tribulation for all the Three Realms. I hope that the Three Realms will be able to safely endure it and once more return to peace.”\u003c/p\u003e\n\u003cp\u003e“Right.” Subhuti sighed as well. He, too, was concerned.\u003c/p\u003e\n\u003cp\u003eThe war of the Primordial Era had resulted in both chaosworlds being shattered.\u003c/p\u003e\n\u003cp\u003eWhat would happen this time?\u003c/p\u003e\n\u003cp\u003e“Let us fight. If someone wishes to take over our home or destroy it, we shall fight them to the bitter end.” Shennong waved his hand, causing the flower to fly over and land within it. He lowered his head to look at it, then handed it to Subhuti. “I entrust it to you.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Subhuti nodded.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe present day.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“I have a solution that might allow us to kill Old Man Yuan.” Subhuti’s voice rang out within the minds of Ji Ning, Jueming, Three Purities, Houyi, Everwood, and Allfiend.\u003c/p\u003e\n\u003cp\u003e“So long as I can get within thirty meters of him, I’ll have a very good chance of killing him! Even if he doesn’t die, he will still be heavily wounded,” Subhuti said. “However, the issue is that this black lotus formation has completely locked down spacetime around him. There’s no way for me to draw near him. I need all of you to help me breach that black lotus formation. Without it locking down spacetime, I’ll be able to instantly appear next to him and launch my attack.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-23-chapter-27\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-23-chapter-29\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-23-chapter-28","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
