{"id":50458,"no":761,"title":"Book 24, Chapter 5 - Military Headquarters","content":"\u003cp\u003eThe gray-robed elder stared blankly at Ji Ning, as though he was staring at some bizarre monstrosity. He then murmured in a low voice, “Brother Darknorth, it’s not that I look down upon you, but I would still recommend that you go fight the third golem. That’ll be enough! If you are truly powerful, you’ll have chances to prove it once you enter the army. But if you insist on asking a World-level expert to verify it…you should know how high the standards of World-level experts are. If you are over-confident in your powers, you can easily cause the World-level expert to feel dissatisfied with you.”\u003c/p\u003e\n\u003cp\u003e“I understand.” Ning nodded.\u003c/p\u003e\n\u003cp\u003eThis was no joke. Ning knew exactly how powerful he was. Even an ordinary Elder God who used the ‘Heartsword stance’ would instantly become comparable to a supreme Elder God! Ning, however, was a half-step World God. When he used the ‘Heartsword stance’, he could dominate supreme Elder Gods.\u003c/p\u003e\n\u003cp\u003eIf he also used Violetjewel…he would be at the World God threshold of power.\u003c/p\u003e\n\u003cp\u003eOr, as Godfiend Witherspike had put it…Ning ranked amongst the top three Elder Gods and Ancestral Immortals he had ever seen! Not one Elder God in ten thousand would be a match for Ning. The Fogstone Army only had a few thousand Elder Gods and Chaos Immortals. Although they were a fairly elite force, Ning felt confident that he could probably dominate all of them even without using Violetjewel.\u003c/p\u003e\n\u003cp\u003e“I’ll ask you one more time. Are you sure you wish to ask a World-level expert to come and attest to your strength?” The gray-robed elder said solemnly.\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded.\u003c/p\u003e\n\u003cp\u003e“Alright.” The gray-robed elder nodded as well. “Since you’ve made the request, I’ll report it to my superiors! Still…as you can probably guess, most World-level experts spend the majority of their time in seclusion, while others will often go out adventuring. If a World-level expert is available, he or she will come and test you out. I can’t say exactly who it will be or when this will happen. It’ll all be up to the World-level experts.”\u003c/p\u003e\n\u003cp\u003eNing laughed. “Of course. Should I just wait here on the mustering grounds island?”\u003c/p\u003e\n\u003cp\u003e“No need for that.” The gray-robed elder shook his head. “The mustering ground is really for True Gods and True Immortals. How about this? I’ll give you a set of silverscale armor on loan. That’ll allow you to enter the city alongside me. When the World-level expert comes and tests you out, we’ll make a decision on what your actual military rank will be.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Ning nodded.\u003c/p\u003e\n\u003cp\u003eA short while later.\u003c/p\u003e\n\u003cp\u003eNing was now dressed in a set of silverscale armor, and he was flying through the air alongside the gray-robed elder.\u003c/p\u003e\n\u003cp\u003e“The core of the army generally consists of Elder Gods and first-tier Ancestral Immortals,” the gray-robed elder said with a laugh. “There are essentially three ranks; silverscale warriors, goldscale warriors, and generals.”\u003c/p\u003e\n\u003cp\u003e“Ordinary Elder Gods and elite Elder Gods are generally silverscale warriors.”\u003c/p\u003e\n\u003cp\u003e“Supreme Elder Gods are generally goldscale warriors.”\u003c/p\u003e\n\u003cp\u003e“As for generals, all of them have transcended supreme Elder Gods in power.” The gray-robed elder continued, “Our Fogstone Army has a total of five generals, and they are able to style and color their armors as they see fit. Other soldiers have to wear the assigned armors.”\u003c/p\u003e\n\u003cp\u003eNing nodded while feeling surprised.\u003c/p\u003e\n\u003cp\u003eThis silverscale armor was a top-grade Protocosmic armor that had protective properties! This was a treasure that was comparable in value to a Chaos treasure because protective armors were extremely rare.\u003c/p\u003e\n\u003cp\u003e“This armor of yours is merely a suit of top-grade Protocosmic armor. The goldscale armors are all Chaos armors.” The gray-robed elder chuckled. “Goldscale armors will generally be able to block against most ordinary attacks. In all the Badlands Territory, there are just a few organizations that are willing to give their soldiers such valuable suits of armor.”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eIf someone with a weak divine body who wore a suit of Chaos armor was struck, the shockwave from a sufficiently powerful blow could still cause some damage. By comparison, being capable of reinforcing the body to make it as tough as a treasure was far more useful! Still, these powerful suits of armor were at least able to help ablate 99% of the incoming damage.\u003c/p\u003e\n\u003cp\u003e“Brother Fushe,” Ning said, “You just told me that the Fogstone Army has five generals. Might I ask how strong they are compared to the Nine Divine Generals of God Emperor Blacklotus?”\u003c/p\u003e\n\u003cp\u003e“Hmph.” The gray-robed elder smirked. “Those nine aren’t even qualified to be mentioned in the same breath as our generals! They actually came up with their ‘Nine Divine Generals’ because they envied us for having our five. All they did was promote certain supreme Elder Gods with special skills into the ranks of their nine. All nine of them combined are actually a bit weaker than our five.”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eIndeed. Judging from his fight against Old Man Yuan, Old Man Yuan was probably just an ‘ordinary’ supreme Elder God; his main advantage lay in the fact that he was incredibly skilled in heartforce.\u003c/p\u003e\n\u003cp\u003eThe two continued to fly forward together, chatting the entire time. They quickly arrived at a major continent, and Ning stared at a towering citadel that had appeared in front of him.\u003c/p\u003e\n\u003cp\u003e“What a large city,” Ning marveled.\u003c/p\u003e\n\u003cp\u003eThe city emanated ripples of absolutely incredible power. Chaos energy swirled around it, so dense as to seem almost solid. The city was furiously devouring the chaos energy, using it to maintain the enormous formation that protected the entire planet of Fogstone.\u003c/p\u003e\n\u003cp\u003e“This is Fogstone City.” The gray-robed elder pointed towards the citadel. “The military camps are located inside, as are various entertainment venues. True Gods and True Immortals generally required to reside within the city, while Elder Gods and Ancestral Immortals are given more freedom to wander around. They are permitted to choose a residence of their choice on Fogstone and just occasionally go to the army camps to meet with the others.”\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eThe two slowly began their descent as they flew through the enormous citadel gates of Fogstone City. Ripples of power swept past them but no one came out to bar their path.\u003c/p\u003e\n\u003cp\u003e“The army camp is over there. The army camp is divided into two major regions. The nicer-looking region is where the Elder Gods and Ancestral Immortals usually gather together, while the other one is meant for True Gods and True Immortals. Go in and take a look for yourself. I need to make a report on your behalf. I trust that a World-level expert will soon come over to test your strength out,” the gray-robed elder said.\u003c/p\u003e\n\u003cp\u003e“Go ahead.” Ning smiled at the gray-robed elder, who quickly flew away.\u003c/p\u003e\n\u003cp\u003eAs for Ning, he transformed into a streak of light as he flew towards the entrance of the army camp. There were two black-armored soldiers standing guard at the entrance, but upon seeing the silver-armored youth move towards them they both simply bowed slightly.\u003c/p\u003e\n\u003cp\u003eNing entered the army camp.\u003c/p\u003e\n\u003cp\u003eAfter doing so, he saw two main paths. These two paths led to two separate drill areas. One area had quite a few soldiers within it, almost all of whom were True Gods or True Immortals. The other drill area had far fewer people, just a few dozen or so Elder Gods and Ancestral Immortals. The vast majority of them were dressed in silverscale armor, with just one dressed in goldscale armor.\u003c/p\u003e\n\u003cp\u003e“Eh? Who is this?”\u003c/p\u003e\n\u003cp\u003e“Anyone know him?”\u003c/p\u003e\n\u003cp\u003e“Don’t know’m, never seen’m.”\u003c/p\u003e\n\u003cp\u003e“He should be new.” The Elder Gods and Ancestral Immortals all watched as Ning moved towards them.\u003c/p\u003e\n\u003cp\u003eThe one dressed in goldscale armor rose to his feet. He was rather skinny, and he had some jade-green tattoos around the corners of his eyes. He smiled in quite a radiant manner. “Are you new, my friend?”\u003c/p\u003e\n\u003cp\u003e“I just joined.” Ning nodded.\u003c/p\u003e\n\u003cp\u003e“My name is Skyleave.” The goldscale soldier smiled.\u003c/p\u003e\n\u003cp\u003e“Darknorth,” Ning replied.\u003c/p\u003e\n\u003cp\u003e“Brother Darknorth, which squad do you belong to?” The goldscale soldier asked curiously.\u003c/p\u003e\n\u003cp\u003e“I don’t know yet. I just joined. I haven’t really been assigned to anyone,” Ning said. This was true. The island master had to first report Ning’s request to the World God, at which point he would be assigned a rank and a position.\u003c/p\u003e\n\u003cp\u003e“Haha, I’m the captain of the tenth squad,” Skyleave said. “You might end up assigned to me. All of you, come over here. This new friend of ours is Darknorth, a new member of our Fogstone Army.”\u003c/p\u003e\n\u003cp\u003e“A new brother? Captain, we have to hold a feast to welcome him.” A rather chubby, smooth-faced soldier dressed in silverscale armor immediately called out.\u003c/p\u003e\n\u003cp\u003e“Right, Captain!”\u003c/p\u003e\n\u003cp\u003e“We need to have a feast.”\u003c/p\u003e\n\u003cp\u003eThe others all called out excitedly as well.\u003c/p\u003e\n\u003cp\u003e“You guys…ugh. Blackpeak is about to attack us, but all you care about is eating and drinking. Fine, fine. We’ll feast, we’ll feast,” Skyleave said with a laugh.\u003c/p\u003e\n\u003cp\u003e“Ahaha, brother Darknorth, my name is Baiwu.” The chubby silverscale soldier slapped his arm around Ning’s shoulders, then said with a laugh, “Our captain is rarely this generous. He almost never treats us to meals. This is your first time here; you need to taste some of the delicacies of Fogstone as well. Ah, man…I’ve lived for ages but I still as much of a glutton as ever. But the thing is, the better something tastes the more expensive it is. Ugh…”\u003c/p\u003e\n\u003cp\u003eNing laughed.\u003c/p\u003e\n\u003cp\u003eWhen Elder Gods and Ancestral Immortals had access to good techniques and tutelage, they would usually either break through to become a World God within a single chaos cycle or never be able to become a World God at all. Most of these soldiers had been alive for quite some time, and none of them had much hope of breaking through. Thus, all of them liked to enjoy life instead. Some liked food while others had other hobbies.\u003c/p\u003e\n\u003cp\u003eThe Elder Gods and Ancestral Immortals were all immediately led towards a lavish, semi-translucent building located nearby.\u003c/p\u003e\n\u003cp\u003e“Three basins of dragon meat first!” Once the soldiers sat down, the chubby Baiwu was the first to call out and make an order.\u003c/p\u003e\n\u003cp\u003e“You bastards.” The goldscale soldier, Skyleave, just shook his head helplessly.\u003c/p\u003e\n\u003cp\u003eSoon, all sorts of strange delicacies and dishes began to make their way to the seated soldiers. The most impressive were those three giant basins of dragon meat that were each thirty meters long. The dragon meat was tinged with a dark-red color and emanated an aura of absolute fragrance. Even Ning couldn’t help but drool once he caught a whiff of it. The soldiers all stretched out their hands to grab at the pieces of dragon meat, pulling them out from the basins and chewing on them.\u003c/p\u003e\n\u003cp\u003eChomp, chomp, chomp. The Elder Gods chomped through meat and bone alike, enjoying the food and the wine.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-24-chapter-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-24-chapter-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-24-chapter-5","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
