{"id":50477,"no":780,"title":"Book 24, Chapter 24 - The Battle in the Abyss","content":"\u003cp\u003eThe crystalline mane of the bluish-white beast trembled as it glared at Ji Ning, its dark yellow eyes filled with hatred and murder.\u003c/p\u003e\n\u003cp\u003eJi Ning clung onto the walls of the pit with one hand, as he turned to stare at the bluish-white scaled monster.\u003c/p\u003e\n\u003cp\u003eTheir gazes met.\u003c/p\u003e\n\u003cp\u003e“I don’t want to be enemies with you,” Ning said.\u003c/p\u003e\n\u003cp\u003e“Die!!!” The bluish-white monster suddenly let out a furious roar as it struck out with its tail, striking so fast that Ning blanched.\u003c/p\u003e\n\u003cp\u003eNing hurriedly use his five free arms to strike out with his sword-arts. It was as though five black holes had suddenly appeared in the air and moved to deflect the oncoming attack.\u003c/p\u003e\n\u003cp\u003eBOOM!!!\u003c/p\u003e\n\u003cp\u003eThe incredible power of the collision caused even Ning’s body to tremble, smashing him against the stone walls behind him. A large crack had appeared on the walls, but thankfully Ning had a tough divine body and a top-grade suit of Chaos armor, as well as the support of that azureflower mist energy. All these things ensured that he was able to withstand the blow…but from this very first clash, Ning instantly understood that his foe was even more stronger than he was!\u003c/p\u003e\n\u003cp\u003eEver since Ning had mastered the Nine Chaos Seals and acquired the azureflower energy, Ning had felt confident that he was very close to the World God level of power and perhaps had even reached it.\u003c/p\u003e\n\u003cp\u003eBut this monstrosity before him…a simple strike from its tail had complete overpowered Ning!\u003c/p\u003e\n\u003cp\u003e“Die!” Die!” Die!” The bluish-white monster charged forward furiously, raking out with its claws.\u003c/p\u003e\n\u003cp\u003e“I gotta get out of here.” Ning quickly clambered up the walls like a spider, sometimes using his left hand to climb, sometimes using his right. He’d occasionally block an attack while occasionally borrow from the force of the collisions to propel himself further upwards.\u003c/p\u003e\n\u003cp\u003eRiiiiip! The sharp claws tore a gash through the stone walls.\u003c/p\u003e\n\u003cp\u003eWhap! The powerful tail-strikes caused the stone to shudder.\u003c/p\u003e\n\u003cp\u003eNing was at a complete disadvantage.\u003c/p\u003e\n\u003cp\u003e“Eh?”\u003c/p\u003e\n\u003cp\u003e“This beastie…doesn’t seem to be that tough.” After exchanging a few dozen blows with the creature, Ning was slowly beginning to come to this conclusion. “It is strong and fast, and its claws are quite sharp, but…it doesn’t seem to have many insights into the Dao at all. It has an incredibly powerful body, but in battle it is clumsy beyond belief.”\u003c/p\u003e\n\u003cp\u003eThe azureflower mist energy had strengthened Ning’s body, making it so that the difference in power between him and the beast wasn’t that great. If Ning hadn’t mastered the Nine Chaos Seals and was only as strong as he was when he had first been drawn into the pit, he would’ve been flattened by that first swipe of the tail. It wouldn’t have mattered how profound his insights into the Dao were!\u003c/p\u003e\n\u003cp\u003e“I can’t keep wasting time with it. If too much time passes, my azureflower mist energy will be used up and I’ll be finished.” After battling for just a short period of time, one of the drops of liquid azureflower energy had already been used up. This shocked Ning and brought him back to his senses.\u003c/p\u003e\n\u003cp\u003e“You can’t kill me!” Ning barked.\u003c/p\u003e\n\u003cp\u003e“You. Die!” The bluish-white scaled creature continued to fight in a berserk manner.\u003c/p\u003e\n\u003cp\u003eNing took out the warblade. This was the Dao weapon which he had picked up a short while ago, and Ning had already bound it to himself quite some time ago. In terms of raw power, it was even stronger than the still-damaged Violetjewel!\u003c/p\u003e\n\u003cp\u003e“F*ck off!” Ning exploded with power.\u003c/p\u003e\n\u003cp\u003eSwords are double-edged weapons. Sabers have just a single blade. However, the tip of this warblade was incredibly sharp, and thus it could also be used to stab, split, and scrape, just as a sword would. Still, it was still better suited for more explosive and forceful attacks.\u003c/p\u003e\n\u003cp\u003e“Heavenbreaker stance!”\u003c/p\u003e\n\u003cp\u003eNing held the warblade in a two-handed grip. He allowed his divine power and the azureflower mist energy to both blast forth at full power as he raised the warblade up high, then furiously chopped down towards the bluish-white scaled monster before him.\u003c/p\u003e\n\u003cp\u003eThe ‘Heavenbreaker stance’ was Ning’s most forceful attack. Of Ning’s many sword-arts, it was the sword-art which was best suited for use with a weapon such as this warblade. In fact, after getting some insights into the second stance of the [Nameless] sword-art, Ning’s ‘Heavenbreaker stance’ now contained even more of a killing intent than it did before. When Ning unleashed this attack he was striking downwards, resulting in the attack being sped up by the howling wind. His saber-light flashed out far faster than the speed of light, giving the bluish-white scaled monster no time to dodge at all.\u003c/p\u003e\n\u003cp\u003e“GWRAAAR!” The monster confidently blocked with its claws.\u003c/p\u003e\n\u003cp\u003eThe enormous crescent saber-light actually blasted the sharp claws aside, landing against the creature’s scaly body.\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eThe bluish-white scaled creature was actually knocked backwards, scales shattering at the point of impact and flying out of its body. It slammed into the stone walls of the pit with a bang, causing the stone to tremble and multiple cracks to appear.\u003c/p\u003e\n\u003cp\u003eIn raw power alone…with the aid of the warblade, Ning was actually able to overpower even the bluish-white beast. It was the beast’s own fault for being too stupid; it had a mighty body that was stronger than even the body of a World God, but the way in which it was able to use that power was quite crude. It simply had far too low a level of insight into the Dao.\u003c/p\u003e\n\u003cp\u003eOr perhaps it might have no insights at all. Perhaps all it knew was just the most basic of attacks.\u003c/p\u003e\n\u003cp\u003e“AWOOOO!” After smashing into the stone walls, the bluish-white creature suddenly raised its head and let out a furious howl.\u003c/p\u003e\n\u003cp\u003eIts howling voice contained a strange, rippling wind to it.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eThe sound of its voice was carried away by the Windsource and instantly transmitted to a different region.\u003c/p\u003e\n\u003cp\u003eDeep within a distant pit, a windbeast that had been slumbering suddenly raised its head. It murmured softly to himself, “An invader?”\u003c/p\u003e\n\u003cp\u003e“There’s an invader?”\u003c/p\u003e\n\u003cp\u003e“That kid Fuu hasn’t been alive long enough. He’s too weak, which is why we had him stand watch over one of the least dangerous regions. And yet he’s asking for reinforcements?”\u003c/p\u003e\n\u003cp\u003eThe windbeasts all heard this sound.\u003c/p\u003e\n\u003cp\u003eSome of them had powerful auras, some of them had weak auras. Some of them actually shook their heads and sighed.\u003c/p\u003e\n\u003cp\u003eWhoooooooosh.\u003c/p\u003e\n\u003cp\u003eNine of the closest windbeasts transformed into streaks of light, flying through the wind like fish swimming through water. When Ning had seen the bluish-white creature fly at high speed against the wind, he had been so terrified that he immediately fled. Only after actually fighting it did he realize that he was actually able to beat it. These windbeasts were born in the Windsource, after all; this was why they were able to fly within the wind with such ease.\u003c/p\u003e\n\u003cp\u003e“His body is too tough. Even my warblade is only able to chip off a few of its scales.” Upon seeing this, Ning instantly lost all desire to fight against the creature any longer. In a place as dangerous as this, he couldn’t just waste his azureflower energy willy-nilly; if he ran out, he’d die!\u003c/p\u003e\n\u003cp\u003e“Time to leave.”\u003c/p\u003e\n\u003cp\u003eNing quickly clambered upwards, moving more than a thousand kilometers.\u003c/p\u003e\n\u003cp\u003e“Running?” The bluish-white scaled monster continued its pursuit.\u003c/p\u003e\n\u003cp\u003e“What was that?!” As Ning climbed upwards while blocking the attacks from the first monster, Ning suddenly saw a second streak of light fly towards him from down below.\u003c/p\u003e\n\u003cp\u003e“Another one?!” Ning was horrified. “Move! Move! Move!” Ning was truly panicking now. He used four of his arms to furiously climb upwards while his other two arms used the warblade to furiously strike down upon the chasing windbeast. Each blow consumed quite a bit of his azureflower energy, but each time the windbeast suffered just slight injuries. It refused to give up the chase.\u003c/p\u003e\n\u003cp\u003eWhoooosh!\u003c/p\u003e\n\u003cp\u003eNing continued to climb upwards at high speed. “I should be just a few thousand kilometers away from the exit. Once I escape the pit, the gray wind won’t be able to cause me any trouble. I’ll easily be able to fly faster than the limits of the Heavenly Daos and it’ll be much easier for me to deal with that monster.”\u003c/p\u003e\n\u003cp\u003e“You can’t even deal with a single invader?” The second streak of light had arrived as well.\u003c/p\u003e\n\u003cp\u003e“Help me kill him,” the first windbeast growled.\u003c/p\u003e\n\u003cp\u003e“Shit.” Ning gritted his teeth as he saw yet another streak of light appear in the depths of the pit.\u003c/p\u003e\n\u003cp\u003e“How many of the damned things are there?” As Ning continued to climb upwards, he defended himself with two hands. He now wielded the warblade with one hand, using it to launch incredibly powerful attacks. With the other hand, he activated the slab that he had picked up, causing a flexible sword to immediately fly out from within it. This was the second Dao weapon which Ning had acquired.\u003c/p\u003e\n\u003cp\u003eThe warblade was used to launch ferocious, savage attacks. The flexible sword was used to execute the ‘Shadowless stance’ and other unpredictable sword stances.\u003c/p\u003e\n\u003cp\u003eAs for Ning’s other four hands, he continued to use them to frantically climb upwards.\u003c/p\u003e\n\u003cp\u003eBoom! Boom!\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eTwo of the windbeasts furiously assaulted Ning, and he defended against them while continuing to climb upwards. Right at this moment…the third windbeast arrived as well.\u003c/p\u003e\n\u003cp\u003e“B-b-but…” Not only was Ning facing the attacks of three windbeasts, he could see two more streaks of light soaring upwards from the dark depths of the pit. One of those streaks of light moved with incredible speed; clearly, it was the fastest of the five.\u003c/p\u003e\n\u003cp\u003e“If I let them surround me, I’m dead.”\u003c/p\u003e\n\u003cp\u003eNing furiously defended against their attacks, using his Dao weapons to block. He also redirected some of their attacks, making it so that the three windbeasts interfered with each other’s attacks.\u003c/p\u003e\n\u003cp\u003e“There it is!” Ning could see the bright opening above him.\u003c/p\u003e\n\u003cp\u003e“Gotta charge out!” Ning could already see the fourth windbeast, the incredibly quick one, drawing very close to him.\u003c/p\u003e\n\u003cp\u003eBOOM! Ning intentionally let himself be hit by a claw strike.\u003c/p\u003e\n\u003cp\u003eSwoosh! He borrowed the power of the blow, letting it sweep him upwards and shoot him outside of the pit entrance.\u003c/p\u003e\n\u003cp\u003e“GRWAAAAR!”\u003c/p\u003e\n\u003cp\u003e“Fuu, not only were you unable to kill him, you actually hindered me.”\u003c/p\u003e\n\u003cp\u003e“You idiot! He was barely able to handle me. You were useless!”\u003c/p\u003e\n\u003cp\u003e“Both of you, shut up.”\u003c/p\u003e\n\u003cp\u003e“All three of you idiots, shut up!” The fourth windbeast let out a roar, causing the other three to fall silent.\u003c/p\u003e\n\u003cp\u003eThe four windbeasts all looked upwards, a look of rage and dread in their dark yellow eyes. They didn’t dare fly out of their pit, as the Ruins were far too incredibly dangerous. Even they were only able to live peacefully in their local part of the Hundred Streams. There were many places which were death traps even for them.\u003c/p\u003e\n\u003cp\u003e“Eh?” After flying out of the pit and away from the gray wind, Ning landed on the ground. He glanced towards the deep, enormous pit in surprise. “They didn’t come out?”\u003c/p\u003e\n\u003cp\u003e“Whew. I finally escaped!”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-24-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-24-chapter-25\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-24-chapter-24","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
