{"id":49779,"no":82,"title":"Book 5, Chapter 8 - Learning Acceptance","content":"\u003cp\u003eAdept Mu Xiao left that very day for Stillwater City. Before leaving, he pulled Ji Ning aside to give him advice in private. “Ji Ning, your talent is extremely high. It is guaranteed that you will walk far on the path of Immortals! Immortal practitioners have very long lifespans. Unless his friends and family are also Immortal practitioners, you will have to watch as all of them die of old age. Actually, this is a form of self-improvement with regards to your mind towards the Dao. Since you have become an Immortal practitioner…you need to be prepared. No matter how much pain you suffer, you must escape from the midst of your grief. Otherwise, it will be very hard for you to overcome the Three Calamities and Nine Tribulations.”\u003c/p\u003e\n\u003cp\u003e…………….\u003c/p\u003e\n\u003cp\u003eAfter Adept Mu left, Ji Ninefire also immediatedly headed towards the mountain where Bei Zishan had hidden himself. That place, after all, had Flood Dragon Dao Battle-Armor.\u003c/p\u003e\n\u003cp\u003eNing travelled by himself to Serpentwing Lake.\u003c/p\u003e\n\u003cp\u003e“There’s still hope. My mother still has hope for surviving.” Ning ran through the mountainous, forested wilderness, occasionally using his Windwing Evasion to advance. His running speed was far faster than the travelling speed of those black beasts, and after expending a large majority of his divine power, he managed to arrive at Serpentwing Lake in just two hours.\u003c/p\u003e\n\u003cp\u003e“That ancient Aquatic Manor has had multiple masters. Immortal Juhua was the third master. Ignoring the other masters, Immortal Juhua himself had lived for millions of years as a Loose Immortal. He definitely had quite a few medicines, and perhaps some of them are able to allow mortals to have extended lifespans.” Ning ran across the surface of the water to the island.\u003c/p\u003e\n\u003cp\u003e“Young master.”\u003c/p\u003e\n\u003cp\u003e“Greetings, young master.”\u003c/p\u003e\n\u003cp\u003eThere were quite a few people on the island, who had arrived long ago to build a residence there. Autumn Leaf and that young child, Bluestone, were there as well. Seeing Ning run in their direction across the surface of the water, they immediately went to welcome him.\u003c/p\u003e\n\u003cp\u003e“I have something to do. You can retire for now.” Ning instructed, then immediately transformed into a blur, disappearing from their field of vision. This caused Autumn Leaf and the other servants to feel rather puzzled.\u003c/p\u003e\n\u003cp\u003eNing soon arrived at the entrance to the cave. He continuously went deeper in, and after a few moments, he arrived at the place where he had been teleported away from last time.\u003c/p\u003e\n\u003cp\u003e“Senior.”\u003c/p\u003e\n\u003cp\u003eNing called out frantically. “Quick, let me enter the estate. I have something important to do.”\u003c/p\u003e\n\u003cp\u003eThe dark tunnel caverns were completely silent. There was no response at all. This caused Ning to be all the more frantic. The old black bull had originally said…that Ning should only return after he had bound the control talisman. But currently, he was just an early Xiantian lifeform. How long would it be before he would become a Zifu Disciple? His mother only had three months left. He had no other options, besides coming here and begging!\u003c/p\u003e\n\u003cp\u003e“Senior, I truly have an urgent matter involving life-and-death. I sincerely implore you, Senior, to let me in.” Ning begged frantically.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eSuddenly, the surrounding space twisted, and in the cavernous area in front of him, an enormous bear’s head once more appeared. The bear’s head opened its giant mouth, swallowing Ning within it, and Ning disappeared from within the estate.\u003c/p\u003e\n\u003cp\u003e………………\u003c/p\u003e\n\u003cp\u003eSpacetime twisted…and then all was calm.\u003c/p\u003e\n\u003cp\u003eNing stared in front of him. In front of him was that majestic, ancient palace hall, in the center of which were those incomparably enormous prayer mats. An old black bull ambled over and let out a sigh. “Ji Ning, didn’t I tell you to wait until you bound the control talisman, at which point you would be able to naturally sense the Aquatic Manor and come as you pleased? You are just a Xiantian lifeform. Why have you entered again?”\u003c/p\u003e\n\u003cp\u003e“Senior.” Ning said hurriedly. “My mother is gravely ill. I truly have no other methods, so I came here to beg.”\u003c/p\u003e\n\u003cp\u003e“Your mother is gravely ill?” The old black bull shook his head. “Since you have chosen the path of Immortals, you need to be prepared for these things.”\u003c/p\u003e\n\u003cp\u003eNing hurriedly shook his head. “Senior, my mother is still young. She shouldn’t die so soon! Previously, I asked a Wanxiang Adept to help take a look at my mother…and that Wanxiang Adept said that my mother, in the past, had used a secret technique to expend her own lifeforce to rescue me. By now, her lifeforce is almost completely used up, and she only has three months of life left. To save my mother, a medicinal pill that can allow mortals to extend their lifespans is necessary. However, that Wanxiang Adept himself had only heard of such pills, and said that most likely only Immortals were in possession of them. I have no other choices, and so I came to the Aquatic Manor.”\u003c/p\u003e\n\u003cp\u003e“A medicinal pill that can allow mortals to extend their lifespans?” The old black bull sighed. “That is something that can described as an Immortal pill. Generally speaking, only Loose Immortals or Earthly Immortals can produce such a thing.”\u003c/p\u003e\n\u003cp\u003e“Immortal Juhua was no ordinary Loose Imortal. He definitely has this sort of medicinal pill, right?” Ning asked frantically.\u003c/p\u003e\n\u003cp\u003eThe old black bull looked at Ning, then shook its head. “Immortal Juhua had been alive for millions of years. His family and friends had died long ago. He had no need of such pills, and so he didn’t have any of them.”\u003c/p\u003e\n\u003cp\u003eNing’s heart trembled.\u003c/p\u003e\n\u003cp\u003e“Then…” Ning said hurriedly. “I imagine Immortal Juhua must have left behind quite a few magic treasures. Give me a magic treasure which has a valuable comparable to that of an Immortal pill, and I’ll take it and trade…”\u003c/p\u003e\n\u003cp\u003eAs soon as he said the words, Ning knew that he was making a mistake.\u003c/p\u003e\n\u003cp\u003eHe cared too much about his mother’s life, and so he had lost his bearings and equanimity. Even his words lacked proprietry.\u003c/p\u003e\n\u003cp\u003e“Foolishness!” The old black bull shouted. “You yourself said just now that even a Wanxiang Adept has only heard of this sort of Immortal pill. You want to trade for it? With who? You, a Xiantian lifeform, hold a magic treasure on that level? If you show it off, most likely those powerful Immortal practitioners will just kill you for it. Trade for it? If you don’t have enough power, how will you trade?”\u003c/p\u003e\n\u003cp\u003e“In addition! You haven’t even bound the control talisman, and the only place in the Aquatic Manor you can enter is just the main palace. You aren’t even able to enter the other places. On what basis am I supposed to hand over one of the magic treasures Immortal Juhua left behind?” The old black bull shook his head. “And what’s more, this isn’t even my decision to make.”\u003c/p\u003e\n\u003cp\u003e“Not your decision to make?” Ning was stunned. “Then…”\u003c/p\u003e\n\u003cp\u003eThe old black bull sighed. “I’m just the spirit of a magic treasure Immortal Juhua always kept on him! The true controller of this Aquatic Manor is the Spirit of the Aquatic Manor!”\u003c/p\u003e\n\u003cp\u003e“Spirit of the Aquatic Manor?” Ning was puzzled.\u003c/p\u003e\n\u003cp\u003eThe old black bull explained, “The entire Aquatic Manor was forged by the first master, who was incredibly mysterious. Even Immortal Juhua himself felt that this Aquatic Manor has secrets which even he had been unable to discover. The Spirit of the Aquatic Manor…has been carrying out the laws and rules set forth by the first master. It won’t violate the rules in the slightest.”\u003c/p\u003e\n\u003cp\u003e“Teleport someone outside into this place? The Spirit of the Aquatic Manor can do that. But allow you to go to other places within the manor? Without binding the Aquatic Manor, that definitely will not be permitted.” The old black bull said. “It also cannot possibly give you one of Immortal Juhua’s magic treasures. After all, it is the Spirit of the Aquatic Manor. It will definitely obey the orders of the first master of the manor.”\u003c/p\u003e\n\u003cp\u003eNing was stunned.\u003c/p\u003e\n\u003cp\u003e“When, for example, the fourth master died in the outside world, the Spirit of the Aquatic Manor would at most act to find the next master.” The old black bull shook his head. “We spirits of magic treasures are different from you humans. You can change. But we will definitely respect the will of our master.”\u003c/p\u003e\n\u003cp\u003eNing understood. Magic treasures were covered with all sorts of runes and bindings. For example, some golems which were forged…even long after the death of their master, the golems would still obey their original orders. The same was true for dwelling-type magic treasures. After the owner of a dwelling died, the rules the owner had set down would still be obeyed by the spirit of the dwelling.\u003c/p\u003e\n\u003cp\u003eWhen he understood this, Ning felt despair, deep within his heart.\u003c/p\u003e\n\u003cp\u003eThe old black bull looked towards Ning. “On the path of Immortals, you will see your family and friends die of age, one after the other. You will also see some friends die in battle…you will have to learn how to accept these things! Go, now!”\u003c/p\u003e\n\u003cp\u003eWhoosh!\u003c/p\u003e\n\u003cp\u003eAn enormous illusory bear’s head appeared, engulfing Ning within its mouth.\u003c/p\u003e\n\u003cp\u003e……………\u003c/p\u003e\n\u003cp\u003eNing returned to West Prefecture city. Returned to the side of his mother. By now, it was already late at night.\u003c/p\u003e\n\u003cp\u003e“Ning.” Yuchi Snow, lying on the bed, saw her son. Her eyes immediately lit up. “Where did you go? I couldn’t find you.”\u003c/p\u003e\n\u003cp\u003e“Mother.” Ning hurriedly walked forward, half-kneeling by her side. He held his mother’s hand. “I went out for a trip. However, I won’t make any more trips. I’ll accompany you and stay by your side.”\u003c/p\u003e\n\u003cp\u003eSnow gently stroked her son’s hair. She laughed, “It’s fine. If you are busy, do what you need to do. Just remember to come visit your mother.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Ning nodded gently, and as he did, he couldn’t help but shed tears.\u003c/p\u003e\n\u003cp\u003eThe only thing he could do now was accompany her mother for the final three months. This was the only filial act he could now do.\u003c/p\u003e\n\u003cp\u003e……………..\u003c/p\u003e\n\u003cp\u003eNight.\u003c/p\u003e\n\u003cp\u003eHis mother had already fallen asleep. Ji Yichuan and Ji Ning, father and son, were within a hall.\u003c/p\u003e\n\u003cp\u003e“Father.” Ning looked towards his father. “It is time to tell me, I think, what exactly happened in the past.”\u003c/p\u003e\n\u003cp\u003eYichuan looked at his son, and as he did, he thought of what Blindfish and the others had said regarding what Ning had done in the mountain. He understood that his son had grown up. Sighing, he said, That year, your mother was pregnant. Your mother and I thus decided to return to the Ji clan. At that time, your maternal uncle was worried, so he escorted and protected us on the way back.”\u003c/p\u003e\n\u003cp\u003e“Maternal uncle?” Ning had never before heard that he had an uncle.\u003c/p\u003e\n\u003cp\u003e“Your uncle’s name was Yuchi Mount.” Yichuan’s eyes had a hint of memory within them. “Your uncle was exceedingly intelligent, and he also knew how to treat others. He had many friends. He had also become a Zifu Disciple early on. If it weren’t because he wanted to escort myself and your mother back, your uncle probably would’ve had a chance at restoring and reestablishing the Yuchi clan. Unfortunately, your uncle died. He died for the sake of protecting the three of us. All three of our lives, we have because your uncle gave up his own! This great debt…is hard to repay!”\u003c/p\u003e\n\u003cp\u003eNing, hearing this, felt a heavy feeling.\u003c/p\u003e\n\u003cp\u003eAn uncle! Yuchi Mount!\u003c/p\u003e\n\u003cp\u003eHe had never heard of this name. This moment was deeply engraved into Ning’s heart.\u003c/p\u003e\n\u003cp\u003e“I’ve only heard that your uncle had a daughter, your maternal cousin. Unfortunately, I have no idea where your cousin is.” Yichuan shook his head and sighed. “I’m unable to repay him. Unable to repay him…”\u003c/p\u003e\n\u003cp\u003e“What exactly happened? Who harmed and killed my uncle, and also caused the roots of her illness?” Ning immediately asked. “Who was it?”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-5-chapter-7\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-5-chapter-9\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-5-chapter-8","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
