{"id":50540,"no":843,"title":"Book 25, Chapter 38 - A Trap","content":"\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eThe three black golems and the stone titan worked together flawless, the three black golems circling around Rocky as the four slowly advanced through the golden warriors towards Ji Ning and Darkfall.\u003c/p\u003e\n\u003cp\u003e“I have to kill this monster of an Elder God before those four golems arrive.” World God Darkfall could sense that this was an incredibly dangerous situation. His eyes flashed red and his attack patterns suddenly changed. Previously, he was trying to use his speed, agility, and unpredictable saber stances to find a flaw in Ning’s attacks. Now, he entered a berserk state and began to unleash saber-arts that focused on overwhelming, dominating power!\u003c/p\u003e\n\u003cp\u003eEach of the six dazzling sabers carried enough power to hack apart a chaosworld. Limitless amounts of power permeated every single saber as they burst forth with explosive might.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! One explosion after another rang out. Ning used the Eternal weapon in his hand to block each time, but he clearly seemed to be somewhat struggling.\u003c/p\u003e\n\u003cp\u003e“Right! What a fool I am! This monster of an Elder God has only been using a single sword this entire time. Clearly, his other weapons are significantly weaker. This sword is most likely an Eternal weapon.” When World God Darkfall saw Ning begin to stagger, he couldn’t help but feel overjoyed. “I have six blades but he only has one sword. He was able to easily defend against me when I focused on trying to find flaws in his swordplay, but when I go all-out and attack him with full force he won’t be able to withstand my blows.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter how tight your defensive swordplay is. As long as I keep I hacking down upon you with my sabers, a flaw will be revealed.”\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe two mighty Fiendgod Refiners exchanged hundreds of blows in an instant. World God Darkfall could sense the specter of death looming over him and so began to furiously attack with all his might, making it very difficult for Ning to defend against him.\u003c/p\u003e\n\u003cp\u003e“An opening!” World God Darkfall’s eyes lit up. He finally saw a flaw in Ning’s defenses.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eWorld God Darkfall didn’t hesitate at all. As soon as he saw the opening, he delivered a strike with an icy-cold streak of saber-light. This streak of saber-light went straight through Ning’s defensive perimeter! As the saying goes, ‘when he is ill, go for the kill’! A single critical strike could completely change the entire nature of a duel, and so Darkfall quickly struck out with all five of his other swords at the same time.\u003c/p\u003e\n\u003cp\u003e“No…!” Ning blanched as he hurriedly tried to deflect, but alas, this single mistake resulted in a cascade of mistakes.\u003c/p\u003e\n\u003cp\u003eBoom! Boom!\u003c/p\u003e\n\u003cp\u003eTwo streaks of saber-light slammed down upon Ning at virtually the same moment.\u003c/p\u003e\n\u003cp\u003e“Haha…” A look of delight flashed through Darkfall’s eyes… but it was then quickly replaced by a look of shock and rage.\u003c/p\u003e\n\u003cp\u003eWhen his sabers had landed against Ning and struck his arm, it was as though some sort of spring mechanism had been activated. When the armor absorbed the force of his blows, it seemed to briefly store it, then sent it right back at Darkfall at the exact same level of power.\u003c/p\u003e\n\u003cp\u003eIt must be understood that World God Darkfall had poured every last scrap of his power into those two saber-blows, making them incredibly strong!\u003c/p\u003e\n\u003cp\u003eAnd yet, he was now caught completely off-guard by this damage reflection. Two surges of utterly terrifying power had just been sent towards him from his two sabers!\u003c/p\u003e\n\u003cp\u003eBOOM!!!! The twin surges of obliterating power instantly blasted World God Darkfall backwards.\u003c/p\u003e\n\u003cp\u003eBeing prepared for an attack and being unprepared for an attack… the results would be completely different!\u003c/p\u003e\n\u003cp\u003eThis was true even for mortals. If he saw that someone was about to push him and prepared himself, he would at most stumble a few steps backwards. But if he was caught completely offguard and was ‘ambushed’ by the push, he might be instantly pushed down onto the ground! Even powerful experts could be slain by weaker opponents who managed to catch them offguard through a sneak attack!\u003c/p\u003e\n\u003cp\u003eThis was the difference between being prepared and being unprepared.\u003c/p\u003e\n\u003cp\u003e“Die!”\u003c/p\u003e\n\u003cp\u003eNing had clearly been struck twice, but he was only knocked a few steps backwards. Every step he took caused the entire Samsara Grinders to shudder, and as he did so he suddenly struck out with his Eternal weapon. Violetjewel instantly increased to become three hundred meters long, and as soon as World God Darkfall was knocked flying backwards Ning chopped at him with Violetjewel!\u003c/p\u003e\n\u003cp\u003eWorld God Darkfall had no choice but to frantically position his warblades in front of him to block.\u003c/p\u003e\n\u003cp\u003eBOOM!!!\u003c/p\u003e\n\u003cp\u003eHe had already been knocked into the air; now, he was sent smashing into the ground by the force of Ning’s sword-blow.\u003c/p\u003e\n\u003cp\u003eThis strike of Ning’s had made his situation go from bad to worse!\u003c/p\u003e\n\u003cp\u003e“It was a trap.” Darkfall instantly realized this.\u003c/p\u003e\n\u003cp\u003eWhoosh! Whoosh! Whoosh! This entire time, the golden warriors had been assaulting both sides with no luck. However, almost all of them began throwing out ropes towards World God Darkfall. In the moment that Darkfall had been sent tumbling to the ground, two ropes had already tightened around his legs. He roared as he furiously struggled to break free, trying to use his warblades to hack the ropes apart and regain his freedom.\u003c/p\u003e\n\u003cp\u003eHe knew very well that if he couldn’t break free, he would die.\u003c/p\u003e\n\u003cp\u003e“Useless.” Ning watched from afar, occasionally flicking out Violetjewel to attack the nearby golden warriors.\u003c/p\u003e\n\u003cp\u003e“He lost?” The blood-robed Arroyo could hardly believe this was happening. Alas, when he saw Darkfall be smashed to the ground and a rope snake around his legs, Arroyo knew that his retainer had lost.\u003c/p\u003e\n\u003cp\u003eThe golden warriors were an extremely dangerous part of the Samsara Grinders matches.\u003c/p\u003e\n\u003cp\u003eMaster-class World Gods could withstand them, but once any additional variables were introduced (such as being knocked to the ground) even they would be thrown into grave peril. In a situation like this, their chances of surviving would rapidly slip away and death would be nigh! The countless golden warriors, all of whom had reached the World threshold of power, wouldn’t give you any chance to recover at all.\u003c/p\u003e\n\u003cp\u003e“He was actually defeated by an Elder God.” The golden-robed Fukai also stared at Ji Ning, located atop that distant Samsara Grinders. Although he was very proud, he sensed that Ji Ning could potentially pose a huge threat to him in the future. He knew that if this Elder God continued to grow, he would definitely surpass both Arroyo and Fukai himself.\u003c/p\u003e\n\u003cp\u003e“Screw off! Break!”\u003c/p\u003e\n\u003cp\u003eWorld God Darkfall fought hard to break free, but it was useless. When a second rope coiled around his body, it became even harder for him to try and fight back. More and more ropes coiled around him, causing a look of despair to appear in his eyes. He turned his gaze towards the distant Elder God Ji Ning, then let out a low growl. “A trap. It was a trap. Just one mistake…”\u003c/p\u003e\n\u003cp\u003eNing stood there, the four golems circling around him and protecting him, stopping the golden warriors from getting close to him.\u003c/p\u003e\n\u003cp\u003eIt had indeed been a trap. Strictly speaking, it wasn’t even that clever of a trap. Then again, when experts fought in a duel to the death there was no time to set up particularly intricate schemes. They would at most be able to set up a few small tricks to entrap their foes.\u003c/p\u003e\n\u003cp\u003eAs soon as Ning had started to fight against World God Darkfall, he had immediately realized that actually killing his foe would be quite difficult. Both of them were roughly on par with each other in power. Even if the four golems came to assist, given how fast and agile Darkfall was he would’ve been able to easily bypass the golden warriors and flee from them.\u003c/p\u003e\n\u003cp\u003eThus, Ning had deliberately said aloud, “Hurry over here! Assist me in surrounding and killing this World God Darkfall.”\u003c/p\u003e\n\u003cp\u003eThis order was meant to be heard by Darkfall. Darkfall had naturally started to panic upon hearing it. He could flee, but what good would that do? He had to win this match and so he had naturally launched increasingly furious attacks to try and speed this up.\u003c/p\u003e\n\u003cp\u003eAt that moment, Ning had deliberately revealed a tiny opening. Darkfall hadn’t suspected a thing.\u003c/p\u003e\n\u003cp\u003eHe had fallen hook, line, and sinker!\u003c/p\u003e\n\u003cp\u003eNing had spent 690 cubes of chaos nectar to purchase this Primalwater Armor during the treasure auction. When its damage reflection property was activated it had sent two incredibly powerful surges of power back towards World God Darkfall, catching him completely off his guard. He had suffered greatly from this attack! In truth, Primalwater Armor normally wasn’t as effective as this, and people who were prepared for it wouldn’t suffer quite this match. Ning, for example, had known exactly what was going to happen!\u003c/p\u003e\n\u003cp\u003eAlthough he had been struck twice, he had merely stumbled back by two steps. Knowing this was going to happen, he immediately struck out with a critical strike from his sword, slamming it against the already airborne World God Darkfall and sending him crashing to the ground.\u003c/p\u003e\n\u003cp\u003eHis final strike was the straw that broke the camel’s back!\u003c/p\u003e\n\u003cp\u003eWhen Darkfall was knocked down to the ground and the countless golden warriors began to swarm him, his fate was virtually sealed. Only a stroke of absolutely incredible luck would’ve allowed him to escape this dire predicament. Alas, his luck wasn’t good enough.\u003c/p\u003e\n\u003cp\u003eWhoosh. A golden warrior who held a gourd in his hands sucked Darkfall inside the gourd, then ground him to dust.\u003c/p\u003e\n\u003cp\u003eEven as Darkfall was being drawn into the gourd, he continued to stare unblinkingly at Ji Ning.\u003c/p\u003e\n\u003cp\u003eJi Ning just calmly looked back at him.\u003c/p\u003e\n\u003cp\u003eIn the end, one of them had to die. There were no other options.\u003c/p\u003e\n\u003cp\u003e“The third match has concluded.” The bald three-eyed man’s voice rang out, causing all of the golden warriors to halt and then disappear.\u003c/p\u003e\n\u003cp\u003eNing waved his hand as well, putting away the three golems. Su Youji appeared in her true form as well.\u003c/p\u003e\n\u003cp\u003e“Let’s go.” Ning and Su Youji transformed into streaks of light, flying off of the Samsara Grinders.\u003c/p\u003e\n\u003cp\u003eAll of the cultivators atop the great plaza had fallen silent. Even Arroyo and Fukai, two incredibly experienced figures who had previously held Ning in no regard, were silent. They stared at Ji Ning and Su Youji as the two flew off of the Samsara Grinders… or to be precise, they stared at Ji Ning.\u003c/p\u003e\n\u003cp\u003e“I am Arroyo!” The blood-robed youth, Arroyo, stared at Ning as he spoke. “Tell me your name.”\u003c/p\u003e\n\u003cp\u003eNing smiled. “Arroyo, you should spend your time worrying about your next match on the Samsara Grinders. You will probably be next.”\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-25-chapter-37\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-25-chapter-39\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-25-chapter-38","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
