{"id":50566,"no":869,"title":"Book 26, Chapter 24 - Taken By Force","content":"\u003cp\u003eA territory located unfathomably far away from the Sea of Darkness.\u003c/p\u003e\n\u003cp\u003eAn enormous rhombus-shaped gemstone was located atop a chaos star, emanating ripples of power.\u003c/p\u003e\n\u003cp\u003e“I need to get closer to it. I can still move a bit closer.”\u003c/p\u003e\n\u003cp\u003eMore than a hundred World-level cultivators had been gathered here atop this chaos star. Their gazes blazed as they stared at the enormous rhombus jewel that had been firmly planted into the ground off in the distance. The ripples emanating from the jewel were being transmitted straight into their minds.\u003c/p\u003e\n\u003cp\u003e“A karmic fortune has been placed before me. I have to grasp it.”\u003c/p\u003e\n\u003cp\u003e“I can keep moving closer.”\u003c/p\u003e\n\u003cp\u003eThe World-level cultivators were like children who had just started to learn how to walk. Every single step they took was incredibly difficult, and the closer they moved to it, the more invisible pressure was applied to their very truesouls. Despite this, they continued to strive to move closer to the rhombus so that they might more clearly hear the voice that was hidden within those ripples of power.\u003c/p\u003e\n\u003cp\u003eThe voice was like the voice of the Dao itself.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eAn enormous, pitch-black hole that was over a million kilometers in size suddenly and silently opened above that chaos star. A titanic head slowly emerged from within the hole, and it stared with its two blazing sun-like eyes towards the cultivators below it.\u003c/p\u003e\n\u003cp\u003e“What the…”\u003c/p\u003e\n\u003cp\u003eThe hundred-plus World-level cultivators were disturbed from their reverie. They had been consumed by delight upon encountering this tremendous karmic fortune, but they now all stared upwards in shock at the terrifying head that had just appeared. Their truesouls were all shaking in terror!\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eThe enormous head opened its lips and inhaled, an enormous pitch-black spatial corridor appearing within its mouth. The hundred-plus World-level cultivators atop the chaos star were all drawn towards it, unable to resist its power in the slightest. They were all sucked into the spatial corridor, and even the rhombus jewel that had been planted onto the star was drawn in as well.\u003c/p\u003e\n\u003cp\u003eGulp. The enormous head shut its mouth, then retreated back into the pitch-black hole which closed behind it.\u003c/p\u003e\n\u003cp\u003eUtter stillness was left behind in its wake.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe Gelian Territory. This was one of the territories located beyond the control of the Dao Alliance. The Aeonians were in control of this territory.\u003c/p\u003e\n\u003cp\u003eTwo beautifully dressed major powers were striding through the chaos of space.\u003c/p\u003e\n\u003cp\u003eSpacetime twisted and distorted around them. They seemed to be moving slowly, but each step they took allowed them to travel a far greater distance than World-level cultivators travelled through teleportation.\u003c/p\u003e\n\u003cp\u003e“Gorsch, you were actually willing to let little Gorho become apprenticed to me? That means if he becomes Awakened in the future, he’ll be considered at least partially my subordinate.” A dazzling beautiful woman dressed in long green robes chuckled merrily as she spoke.\u003c/p\u003e\n\u003cp\u003e“In all my years, I’ve never seen any descendants of mine who have more potential than Little Gorho. Although he is currently just a World-level cultivator, I’ve raised him and taught him so that he is capable of battling against Daolords of the First Step. And that’s not even his limit! His greatest skill lies in the Dao of Spacetime… and you are one of the top two masters of spacetime in our entire Aeonian race. Only by apprenticing himself to you can he truly reach the greatest heights possible in the Dao of Spacetime.” The silver-haired, middle-aged man had a look of desire in his eyes.\u003c/p\u003e\n\u003cp\u003eThe silver-haired man continued, “The stronger one is prior to being Awakened, the more they will benefit after their Awakening, and the more potential they will have! I’ve watched as little Gorho grew up and taught him step-by-step. It is true that as your disciple, he’ll be considered as half your subordinate… but for the sake of his future growth, I decided to let you take advantage of me.”\u003c/p\u003e\n\u003cp\u003e“You are making it sound as though I’m taking huge advantage of you.” The green-robed woman laughed. “I’ll have to spend a lot of effort in teaching him, you know?”\u003c/p\u003e\n\u003cp\u003e“There aren’t many of us Aeonians, and there are even fewer descendants with as much potential as this child. Little Gorho can Awaken himself whenever he wishes, but been intentionally suppressing himself. Don’t pretend you haven’t won the lottery by gaining a disciple of such potential,” the silver-haired man said.\u003c/p\u003e\n\u003cp\u003e“Let’s make things clear from the get-go. Since he is going to be my disciple, I’m going to keep him by my side for a full chaos cycle,” the green-robed woman said. “You are not permitted to interfere.”\u003c/p\u003e\n\u003cp\u003e“Fine.” The silver-haired man assented.\u003c/p\u003e\n\u003cp\u003eThe two chatted and laughed as they strolled through the void of space, quickly reaching a different chaosworld.\u003c/p\u003e\n\u003cp\u003e“Eh!?” The green-haired woman’s face tightened. A speck of golden light appeared in each of her eyes that shone down upon the surrounding region of spacetime. A solemn look on her face, she immediately said, “The spacetime in the surrounding area has been forcibly distorted.”\u003c/p\u003e\n\u003cp\u003e“Forcibly distorted?” The silver-haired man’s face tightened as well. He immediately sent out his senses to scan the entire chaosworld.\u003c/p\u003e\n\u003cp\u003e“Where’s little Gorho?”\u003c/p\u003e\n\u003cp\u003e“Why is he missing?”\u003c/p\u003e\n\u003cp\u003eThe silver-haired man was stunned. “Why are even his servants… wait, even the protectors of this chaosworld are missing?” According to the rules he had set down, the protectors were absolutely forbidden from leaving without his permission as this was an incredibly important part of the territory of King Gorsch.\u003c/p\u003e\n\u003cp\u003eBut now, all of the World-level cultivators had gone missing from this chaosworld, including his most cherished descendant Gorho.\u003c/p\u003e\n\u003cp\u003e“My subordinates would never leave without my permission. Someone must’ve slaughtered them or captured them.” Flames began to flicker around the silver-haired man’s body, and his eyes became filled with a murderous look. “If spacetime has been distorted here, we should be able to trace the ripples of spacetime to locate the person who did this. I’m going to kill him. I’m going to KILL HIM.”\u003c/p\u003e\n\u003cp\u003e“You can’t kill him…” The green-haired woman had an ugly look on her face.\u003c/p\u003e\n\u003cp\u003e“Eh?” The silver-haired man turned to look at her.\u003c/p\u003e\n\u003cp\u003e“I can’t find any traces at all. The person who twisted spacetime here is even stronger than me in the Dao of Spacetime,” the green-haired woman explained. “There’s no way at all for you to stop him if he chooses not to fight you.”\u003c/p\u003e\n\u003cp\u003e“Even stronger than you in the Dao of Spacetime?” The silver-haired man could hardly believe it.\u003c/p\u003e\n\u003cp\u003e“Who on earth did this?” The green-robed woman frowned. “Could it be the Dao Alliance? There’s only a few members of the Dao Alliance capable of doing such a thing, but would they really lower themselves to act against little Gorho? They wouldn’t, right…?”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA blazingly hot chaos star. An enormous pitch-black hole suddenly appeared above it, followed by that gigantic head slowly emerging from within it. It opened its mouth and began to suck in the entire chaos star. The chaos star transformed into a blazing beast of fire with an aura of incredible power. Struggling to break free, it let out a furious roar: “Who are you?!”\u003c/p\u003e\n\u003cp\u003e“Time to come home, child.” The gigantic beast-head gave a simple reply, then sucked the blazing creature towards the pitch-black spatial corridor that had appeared in its mouth.\u003c/p\u003e\n\u003cp\u003eWhoosh. The blazing creature wasn’t able to fight back at all. It flew closer and closer towards the spatial corridor, shrinking in size as it did before finally being completely sucked in.\u003c/p\u003e\n\u003cp\u003eThe gigantic head retreated from the black hole, which quickly closed behind it.\u003c/p\u003e\n\u003cp\u003e…...\u003c/p\u003e\n\u003cp\u003e“How diverting.” A human-shaped figure that was completely formed out of water was seated in the emptiness of space, staring curiously at the world around it.\u003c/p\u003e\n\u003cp\u003eWhoosh. A pitch-black hole appeared next to it, followed by the emergence of that titanic head.\u003c/p\u003e\n\u003cp\u003e“Little newborn child…”\u003c/p\u003e\n\u003cp\u003eThe titanic head opened up its mouth and began to draw in the watery figure.\u003c/p\u003e\n\u003cp\u003e“Uh? Eh?” The watery humanoid figure found itself irresistibly pulled towards that spatial corridor. It watched with curiosity, not trying to fight back at all. This was because it didn’t sense even the slightest bit of enmity or hostility from the seemingly terrifying creature before it.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eDuring this period of time, many powerful creatures mysteriously vanished from throughout the Endless Territories.\u003c/p\u003e\n\u003cp\u003eWhen Ji Ning and the other cultivators aboard the flying vessel were drawn into the spacetime corridor, they could sense space and time twisting around them. It was quite similar to the feeling of being transported through a spacetime transfer array.\u003c/p\u003e\n\u003cp\u003e“This is a spacetime transfer. Where are we being transferred to?” Ning and the other cultivators were all filled with unease. The behemoth which had sucked them in was simply too powerful.\u003c/p\u003e\n\u003cp\u003eWhoosh. Spacetime suddenly stabilized once more.\u003c/p\u003e\n\u003cp\u003e“Where are we?” Ning could now see that there were at the peak of a towering mountain. They had been teleported to this incredibly large mountain, and there were many other living beings here already. More than half were cultivators, and there had to be over a thousand cultivators gathered here.\u003c/p\u003e\n\u003cp\u003eNing and the other ninety-seven cultivators first put away the flying vessel, then looked around cautiously.\u003c/p\u003e\n\u003cp\u003e“What is this place?”\u003c/p\u003e\n\u003cp\u003e“Fellow Daoists, where are we? How do we leave this place?” World God Xiang Lu immediately queried the cultivators who had arrived here before them.\u003c/p\u003e\n\u003cp\u003eA black-robed cultivator glanced at World God Xiang Lu, then slowly shook his head. “There’s no way to leave. This mountain peak is surrounded by restrictive spells. You won’t be able to take so much as a single step off of the mountain. As for the mountain itself, we aren’t able to damage it in the slightest. To tell you the truth, we just got here a few hours before you did.”\u003c/p\u003e\n\u003cp\u003eWhen Ning and the others heard this, their faces tightened slightly as pensive looks appeared in their eyes.\u003c/p\u003e\n\u003cp\u003eRight at this moment, yet another hundred-plus cultivators suddenly appeared out of nowhere. All of the cultivators looked quite lost and uneasy.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-26-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-26-chapter-25\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-26-chapter-24","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
