{"id":50591,"no":894,"title":"Book 26, Chapter 49 - The Twenty-Seven Waterfiend Lords","content":"\u003cp\u003eThe twenty-seven streaks of light came to a halt after surrounding Ji Ning.\u003c/p\u003e\n\u003cp\u003eNing glanced at them. The twenty-seven figures before him were all quite bizarre-looking. These were all creatures that were born as members of aquatic races. Although as World-level cultivators, they could now survive equally well on dry land or in the void of space, they still had an innate fondness for water. Ning similarly could live equally well in water or on land, but he still preferred to dwell on land.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning’s gaze fell upon the azure-scaled creature’s form. He could sense that the painting was being carried by that creature.\u003c/p\u003e\n\u003cp\u003e“Three paintings!” The azure-scaled creature felt a surge of excitement in his heart.\u003c/p\u003e\n\u003cp\u003e“Everyone…” Ning spoke out.\u003c/p\u003e\n\u003cp\u003e“Haha, are you afraid now? Too late!”\u003c/p\u003e\n\u003cp\u003e“Kill him.”\u003c/p\u003e\n\u003cp\u003eThe twenty-seven Waterfiend Lords couldn’t be bothered to chat with Ning. They had dominated this region for quite some time and were figures of renown. They showed no mercy at all when attacking. They truly weren’t worried about this World-level cultivator at all; they had never encountered someone on their level who could withstand the twenty-seven of them.\u003c/p\u003e\n\u003cp\u003eThe weakest of the twenty-seven was a master-class World God, while the strongest was a transcendent World God!\u003c/p\u003e\n\u003cp\u003eBoom! A black streak of lightning thundered down towards Ning.\u003c/p\u003e\n\u003cp\u003eWhoosh! A current of freezing energy surged out to try and freeze Ning.\u003c/p\u003e\n\u003cp\u003eSwish! An enormous web-shaped treasure swept out to capture Ning.\u003c/p\u003e\n\u003cp\u003eHiss! A serpentine rope-like treasure twirled out to bind Ning.\u003c/p\u003e\n\u003cp\u003eThe twenty-seven cultivators instantly launched simultaneously attacks in a very practiced manner. Generally speaking, most World-level cultivators were only able to control two powerful treasures at the same time. A situation like this was a testament to the old saying, strength in numbers. A dazzling array of spells and treasures instantly swept out towards Ning in a wave, seeking to drown him. As for the World Gods amongst the twenty-seven, they charged straight towards Ning.\u003c/p\u003e\n\u003cp\u003eWhoooosh.\u003c/p\u003e\n\u003cp\u003eRings of sword-light began to spread outwards.\u003c/p\u003e\n\u003cp\u003eNing just stood there, surrounded by rings of sword-light. Although the freezing current of energy was able to freeze the waters of the lake as it reached out towards Ning, it instantly shattered whenever it touched the sword-light. As for the web treasures and the other treasures? They were completely stopped by Ning’s sword-light.\u003c/p\u003e\n\u003cp\u003e“How average.” Ning couldn’t help but sigh to himself. When he had used his Unicorn’s Domain had been able to withstand Bertulu, he had been under tremendous pressure. But now that he was fighting these twenty-seven Waterfiend Lords… he felt things were far too easy. He didn’t even have to really focus on this fight; he instead simply activated his domain, allowing his sword-intent to automatically defend against the attacks.\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eNineteen of the twenty-seven were World Gods. This was quite a powerful force, after all. World God Azurekai had been able to leave the Astral Islands without anyone helping him, and he had the power of a transcendent World God, but he was merely the second most powerful figure in their group. Only sufficiently powerful individuals would be admitted into their ranks, and these nineteen World Gods were filled with tremendous power, especially after being reinforced by their formation.\u003c/p\u003e\n\u003cp\u003e“Die.” A streak of silver light shot out at tremendous speed towards Ning.\u003c/p\u003e\n\u003cp\u003e“Hm?” Ning held a single sword in his hands. He glanced sideways at the attack, then executed a simple sword-stance.\u003c/p\u003e\n\u003cp\u003eClang! Crack!\u003c/p\u003e\n\u003cp\u003eNing’s sword was even faster and his attack was even more profound!\u003c/p\u003e\n\u003cp\u003eIt must be understood that the Unicorn’s Domain was based off the perfect fusion of the ‘Astral’ stance and the sixth stance of the [Nameless] sword-art, the Unicorn’s Heart. The [Nameless] sword-art was a sword-art that had been left behind by an Eternal Emperor, while the Astral stance had been developed based on Violetjewel’s quintessence. Both were incredibly high-level sword-arts.\u003c/p\u003e\n\u003cp\u003e“What?!” The silver-streak of light was shocked after this clash. Ning’s sword-light had actually brushed him across the chest!\u003c/p\u003e\n\u003cp\u003eBOOM!\u003c/p\u003e\n\u003cp\u003eThe silver streak of light retreated at tremendous speeds. The power of Ning’s strike was simply too enormous, and he was simply too strong. With a boom, the streak of light slammed into the distant walls of the Royal Dragon Palace, causing the entire palace to tremble. The other twenty-six Waterfiend Lords were all horrified, to say nothing of the palace attendants and maids.\u003c/p\u003e\n\u003cp\u003eThe person Ning had just sent flying was the leader of the group… World God Dragonking.\u003c/p\u003e\n\u003cp\u003eWorld God Dragonking was a transcendent World God who was supported by a formation with multiple other World Gods! How could he have been beaten in just a single clash!\u003c/p\u003e\n\u003cp\u003e“Not good.”\u003c/p\u003e\n\u003cp\u003e“We are in trouble.”\u003c/p\u003e\n\u003cp\u003e“This opponent is too powerful.”\u003c/p\u003e\n\u003cp\u003eThe other Waterfiend Lords all felt their hearts clench.\u003c/p\u003e\n\u003cp\u003e“Don’t fight him solo. Let’s all fight together.” Although World God Azurekai was rather shocked at how terrifyingly strong this opponent was, the allure of those three paintings was simply too great. He immediately roared mentally, “Big brother Dragonking, let’s join forces!”\u003c/p\u003e\n\u003cp\u003e“Alright!” World God Dragonking had a decent protective divine ability. Although he had been knocked flying, he hadn’t suffered any significant injuries. “His sword-arts are quite profound. None of us are a match for him in solo combat. All of us need to fight together. There’s no way he can take us all on at once. Find a chance to tie him up and bind him!”\u003c/p\u003e\n\u003cp\u003e“Right. Let’s all join together.”\u003c/p\u003e\n\u003cp\u003eWorld God Dragonking quickly flew back to rejoin them. They were all much more somber now. They either attacked with magic treasures from afar or cautiously advanced en masse towards Ning. By now, even the most arrogant member of their group, World God Dragonking, no longer dared to act brashly.\u003c/p\u003e\n\u003cp\u003e“The Brightshore Kingdom’s territory really is rather lawless. Is this what the almighty Hegemon desires?” Ning shook his head. He had been waylaid and accosted multiple times on his trip to this place from the Astral Islands. This time, these twenty-seven had attacked him without even bothering to talk to him. From this, one could see how unruly this kingdom was.\u003c/p\u003e\n\u003cp\u003eBy comparison… although there was also danger and combat within the territory of the Dao Alliance, it was a far more peaceful place! The Dao Alliance followed the principles of governance through inaction, but there was a reason for it. Ninety-nine percent of the territory of the Endless Territories was under the control of the Dao Alliance, and virtually all cultivators were a member of the alliance. There were simply too many cultivators! Even though they governed through inaction, they were still able to produce a few Daolords within each territory. How vast and powerful was the entire Dao Alliance?\u003c/p\u003e\n\u003cp\u003eThe main weakness of the Dao Alliance was that its cultivators were too scattered out.\u003c/p\u003e\n\u003cp\u003eThe Brightshore Kingdom’s power was much more concentrated, even though it held much less territory. The almighty Hegemon was a Brightshore Imperial, which meant he really didn’t feel much pity or sympathy for ‘alien’ forms of life. He would use whatever means were effective in rearing a crop of powerful experts! The fatality rate in the Astral Islands was a testament to how cold and ruthless the almighty Hegemon could be.\u003c/p\u003e\n\u003cp\u003eAccording to the Twelve Palaces, the reason they existed and the reason the Hegemon had created the Brightshore Kingdom was so that Imperials would be protected. Because the Twelve Palaces had become extremely powerful, the almighty Hegemon respected them and placed them on an equal level.\u003c/p\u003e\n\u003cp\u003eSwish! Crack! Whoosh!\u003c/p\u003e\n\u003cp\u003eMany weapons and spells flew towards Ning in a steady stream.\u003c/p\u003e\n\u003cp\u003eMoments ago, Ning had been able to rely on his supreme sword-arts to easily defeat his opponent. However, simply relying on sword-arts was no longer enough. He would now have to actually fight.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe nineteen World Gods were all sent flying backwards.\u003c/p\u003e\n\u003cp\u003e“What?!”\u003c/p\u003e\n\u003cp\u003e“He’s too strong.”\u003c/p\u003e\n\u003cp\u003e“Quick, flee!”\u003c/p\u003e\n\u003cp\u003eSlash! Sword-light flashed as the tip of Ning’s sword pierced into the body of World God Dragonking, the fastest of the twenty-seven. This time, Ning infused his strike with the power of his azureflower mist energy. Although the strike had to first pass through a layer of armor, and although World God Dragonking’s body was comparable to a Chaos treasure… his body began to tremble, then crack apart as blood began to flow from every single part of his body.\u003c/p\u003e\n\u003cp\u003e“Die.” Ning showed no mercy at all as he delivered three consecutive furious strikes upon the body of World God Dragonking.\u003c/p\u003e\n\u003cp\u003e“No!” World God Dragonking was utterly horrified. “How can he be this strong? He’s clearly just at the World level. How can he be this much stronger than me?!” The three consecutive blows smashed World God Dragonking’s body into dust, causing even his truesoul to dissipate.\u003c/p\u003e\n\u003cp\u003e“How can a World-level cultivator be this strong?”\u003c/p\u003e\n\u003cp\u003e“He’s too strong!”\u003c/p\u003e\n\u003cp\u003eThe Waterfiend Lords began to flee in utter terror. Even when they joined forces, they were still defeated in the very first clash? But of course, if they knew that Kilostar’s thousand clones weren’t able to do anything against Ji Ning, they would no longer be surprised by their defeat.\u003c/p\u003e\n\u003cp\u003e“He’s a freak! He’s one of those horrifyingly, freakishly talented geniuses that were in the higher strata of the Astral Islands. He must’ve been admitted into the Twelve Palaces already!” The fleeing World God Azurekai was more frightened than anyone else. “And he must’ve been one of the top freaks!”\u003c/p\u003e\n\u003cp\u003eSome of those ‘freaks’ were strong because of special treasures or secret arts, while others held enormous advantages in terms of speed and strength. Those freakishly strong cultivators who were as strong and fast as Daolords of the First Step were the most terrifying ones of all. Kilostar and Ning both belonged to this category. Even when Ning’s sword-arts had been weak, his powerful divine body had allowed him to stably reside within the fifth stratum. Once his sword-arts improved, he became strong enough that even Bertulu would have to reveal his true form in order to be certain of victory over Ning.\u003c/p\u003e\n\u003cp\u003e“Fleeing?” After slaying World God Dragonking, Ning’s body flickered as he began to chase after World God Azurekai.\u003c/p\u003e\n\u003cp\u003eWorld God Azurekai and World God Dragonking were both transcendent World Gods and the strongest members of the twenty-seven. As for the others? Ning really didn’t care about them.\u003c/p\u003e\n\u003cp\u003eBoom! Sword-light descended.\u003c/p\u003e\n\u003cp\u003e“No!” World God Azurekai struggled to defend, utterly terrified. But after a few strokes of sword-light, he was finished.\u003c/p\u003e\n\u003cp\u003eWorld God Northrest had acquired something like the [Golden Idol] out of pure luck. In contrast, World God Azurekai had only been able to train his body to make it comparable to a top-grade Protocosmic spirit-treasure. He hadn’t even reached the Chaos treasure level. Protective divine abilities were very rare, after all, and they were extremely hard to train in. Elite protective divine abilities were even more rare!\u003c/p\u003e\n\u003cp\u003eSoon, World God Azurekai disappeared into a cloud of dust.\u003c/p\u003e\n\u003cp\u003eNing glanced at the treasures he had left behind, then waved his hand and collected it all.\u003c/p\u003e\n\u003cp\u003eAs for the other Waterfiend Lords, they had all fled long ago. They didn’t even want their palace any longer. As for the attendants and maids inside the palace, they had hidden themselves in terror.\u003c/p\u003e\n\u003cp\u003e“Time to go.” Ning soared into the skies, shooting out of the lake and into his flying vessel as he departed. Once he entered his vessel, Ning began to bind the treasures which World God Azurekai had left behind. Soon, he located the Mirrorsnow Painting he was looking for.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-26-chapter-48\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-26-chapter-50\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-26-chapter-49","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
