{"id":50632,"no":935,"title":"Book 28, Chapter 3 - Transfer Array","content":"\u003cp\u003eUpon seeing the five, Old Demon Qixiu could sense that his very soul was beginning to shudder. He swallowed, hard, then bowed and said respectfully, “Greetings, five seniors.”\u003c/p\u003e\n\u003cp\u003eGood heavens! He stood at the very peak of power in this world. By all rights, he should’ve been invincible, and yet… why was it that these five were unfathomably more powerful than him?\u003c/p\u003e\n\u003cp\u003e“I have a few questions for you,” Heartlord Solewind said with a smile.\u003c/p\u003e\n\u003cp\u003e“Please ask, senior.” The Old Demon was quite cautious, but even he himself didn’t realize that deep within his heart, a seed of trust was beginning to blossom towards this bald, red-robed youth.\u003c/p\u003e\n\u003cp\u003e“What is the name of this continent?” Solewind asked.\u003c/p\u003e\n\u003cp\u003e“This continent is quite vast, stretching hundreds of billions of kilometers,” the Old Demon said. “Because there are so many mortals living here, we refer to this continent as the Mortal Realm.”\u003c/p\u003e\n\u003cp\u003eSolewind nodded slowly. “Has anyone ever left this ‘Mortal Realm’ and ventured off into other continents?”\u003c/p\u003e\n\u003cp\u003e“There’s only one way to do that. You’d have to activate the ancient transfer array and head to the the Sacred Immortal Realm,” the Old Demon said.\u003c/p\u003e\n\u003cp\u003e“Sacred Immortal Realm?” Solewind asked. Upon hearing this, Ji Ning, Greatjoy, Firesurge, and Skyfire all revealed smiles. They were going to be able to leave this place.\u003c/p\u003e\n\u003cp\u003eThis entire continent was surrounded by spatial tempests, making it impossible for them to leave. Only by using a spatial transfer array to go to another continent would they be able to escape.\u003c/p\u003e\n\u003cp\u003e“This entire continent holds just a single transfer array within it,” the Old Demon said. “Supposedly, an incredibly long period of time ago there was a major power from the Sacred Immortal Realm who descended upon this continent who personally set up the array. There’s no way for the cultivators of our Mortal Realm to come up with such a complicated array.”\u003c/p\u003e\n\u003cp\u003eNing and the others all laughed. Most likely, this spacetime transfer array leading to the Sacred Immortal Realm was something which had been personally established by an extremely powerful Daolord.\u003c/p\u003e\n\u003cp\u003e“Here in our Mortal Realm, the elemental energy of Heaven and Earth is very sparse. It is incredible if you can even reach the Nascent Soul stage. To reach the Apotheosis stage is even more difficult.” The Old Demon continued, “Thus, countless Nascent Soul cultivators and Apotheosis cultivators shall gather from throughout the continent and travel through the array towards the Sacred Immortal Realm. According to the Apotheosis cultivators who came back from that place, the elemental energy there is far denser than it is here in our Mortal Realm, making it easier to cultivate and easier to overcome the tribulation.”\u003c/p\u003e\n\u003cp\u003e‘Nascent Soul’, ‘Apotheosis’… these were different terms for Ki Refiners. In the Three Realms, the mortal ranks were Zifu Disciple, Wanxiang Adept, Primal Daoists, and Void-level cultivator. This represented what the most perfect Ki Refining systems in the Three Realms could accomplish.\u003c/p\u003e\n\u003cp\u003eHowever, in the Endless Territories and in this alternate universe there were many different mortal races that used different Ki Refining techniques which had different terms and titles.\u003c/p\u003e\n\u003cp\u003e“Where is the transfer array?” Solewind asked.\u003c/p\u003e\n\u003cp\u003e“Here is a map.” The Old Demon immediately took out his treasured map.\u003c/p\u003e\n\u003cp\u003eSolewind glanced at it while simultaneously flipping through the Old Demon’s memories, wiping away all traces of this encounter.\u003c/p\u003e\n\u003cp\u003e“Time to leave,” Solewind said. The five immediately vanished.\u003c/p\u003e\n\u003cp\u003e“What just happened?” Old Demon Qi Xiu stared at his surroundings. “Why do I have the feeling that something is off…” The Old Demon frowned but wasn’t able to comprehend what had just happened.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfterwards, Ning’s group chatted with two other Apotheosis cultivators who were considered extremely powerful in this continent. Everything they said was roughly the same as what the Old Demon had said.\u003c/p\u003e\n\u003cp\u003eThe five of them road atop a cloud, staring down at the lands below.\u003c/p\u003e\n\u003cp\u003e“It is true that the elemental energy in this continent is quite sparse.” Ning nodded. “It is true that mortal cultivators would find it very hard to train here.”\u003c/p\u003e\n\u003cp\u003eIf there was no elemental energy at all, there would be no way to cultivate whatsoever. The elemental energy in this continent was only enough for someone to just barely reach the Primal Daoist stage. If you wished to reach the Void level and become an Earth Immortal, it would be extremely difficult. The ‘Old Demon’ which Ning’s group had questioned would’ve been considered a Void-level Earth Immortal in the Three Realms.\u003c/p\u003e\n\u003cp\u003e“It is because of the formation which covers this entire place,” Solewind said. “This formation covers everything, drawing power from the entire continent. That’s why the elemental energy in this continent is so sparse! Still, the reason this continent is protected from the spatial tempests is because of this formation.”\u003c/p\u003e\n\u003cp\u003e“The Sacred Immortal Realm should be a continent where the density of elemental energy is normal,” Firesurge said. “However… as a result, the living creatures here refer to it as the ‘Sacred Immortal Realm’.”\u003c/p\u003e\n\u003cp\u003e“When there’s a difference in density of elemental energy, it’s only normal that there one realm is viewed as higher and one realm is viewed as lower.”\u003c/p\u003e\n\u003cp\u003eNing and the others chatted as they advanced through the clouds and moved towards the ancient transfer array. They stared at it from afar.\u003c/p\u003e\n\u003cp\u003eThe ancient transfer array took up an extremely wide amount of space. The entire formation itself covered hundreds of millions of kilometers, and its core components were extremely complicated and exquisite.\u003c/p\u003e\n\u003cp\u003e“It really is a spacetime transfer array.” Ning and the others were able to recognize it at one glance.\u003c/p\u003e\n\u003cp\u003e“Ahah. Quite lively here.” Prince Greatjoy glanced downwards, then let out a surprised sigh.\u003c/p\u003e\n\u003cp\u003e“These so-called ‘Nascent Soul’ cultivators and Apotheosis cultivators really are frighteningly numerous.” Solewind let out a laugh. This was the only spacetime transfer array within the entire continent. As a result, this place naturally attracted countless Nascent Soul cultivators and Apotheosis cultivators from throughout the continent, making it very bustling. In fact, an enormous city had been erected here.\u003c/p\u003e\n\u003cp\u003eThis city was filled to the brim with Nascent Soul cultivators and Apotheosis cultivators. There had to be hundreds of millions of them.\u003c/p\u003e\n\u003cp\u003eNing couldn’t help feel secretly amazed. This continent was hundreds of billions of kilometers in size, making it much vaster than the entirety of the Three Realms. Although in quality of elemental energy it was inferior to the Three Realms, its vastness resulted in the existence of hundreds of millions of Nascent Soul cultivators and Apotheosis cultivators. Any one of them would be considered a local hegemon when scattered in any of the other places in this continent.\u003c/p\u003e\n\u003cp\u003e“Let’s enter the city.”\u003c/p\u003e\n\u003cp\u003e“Let’s go take a look.”\u003c/p\u003e\n\u003cp\u003eNing and the others walked through the city, moving directly towards the transfer array.\u003c/p\u003e\n\u003cp\u003e“I’ve been trapped at the Nascent Soul level for far too long. The density of elemental energy in Heaven and Earth is simply too low. I failed both of my attempts at reaching Apotheosis. Once I enter the Sacred Immortal Realm, I’ll be able to reach Apotheosis. I might even have a chance at overcoming my tribulation and reaching ascension!” The various cultivators in the city were chatting amongst themselves.\u003c/p\u003e\n\u003cp\u003e“I’ve become an early-stage Apotheosis cultivator, but I’m not able to improve any further. There just isn’t enough elemental energy here. Perhaps I’ll be able to become a Celestial Immortal once I go to the Sacred Immortal Realm.”\u003c/p\u003e\n\u003cp\u003e“This array only activates once every hundred years. I have to wait sixty-one more years. This really does make me impatient.”\u003c/p\u003e\n\u003cp\u003e“We’ve waited thousands of years, my brother. What’s another few decades?”\u003c/p\u003e\n\u003cp\u003eThe eyes of the countless cultivators in the city were filled with eagerness. They had already reached the end of the path they could traverse here within the ‘Mortal Realm’. Only in the Sacred Immortal Realm would they have a chance to continue their path.\u003c/p\u003e\n\u003cp\u003eBut none of them realized that those five seemingly-ordinary men who just walked past them were major powers who were truly capable of virtually anything! Even those ‘Celestial Immortals’ they dreamed of becoming would be wiped out in the billions by these five cultivators.\u003c/p\u003e\n\u003cp\u003e“Once every century?” Skyfire Brightshore frowned. “This spacetime transfer array only activates once every century?”\u003c/p\u003e\n\u003cp\u003e“Each activation uses up some energy. When this spacetime transfer array was created by that ancient power, only a few chaos jewels were left behind to guide it in gathering the surrounding natural energy into itself. It takes a century for it to accumulate enough energy to be activated,” Heartlord Solewind said. “My guess is that the Sacred Immortal Realm is located extremely close to this continent, which is why the activation can be as frequent as once every century. If it was farther away, it would probably be once every thousand years.”\u003c/p\u003e\n\u003cp\u003eNing and the others nodded. This was different from the spacetime transfer arrays of the Endless Territories; if you were willing to pay enough chaos nectar, it could be activated for you whenever you wished! This array here in the alternate universe had been created by a major power, apparently out of an act of selflessness. Of course, it was also possible that this was done by the Church of Annihilation.\u003c/p\u003e\n\u003cp\u003e“Let’s go. We’ll first find a place to wait it out. Sixty-one years from now, we’ll come back,” Solewind said.\u003c/p\u003e\n\u003cp\u003e“We have no other choices.” Skyfire felt quite resigned.\u003c/p\u003e\n\u003cp\u003eIt was possible for them to pour energy into the formation and activate it by force, but… once they did so and the transfer array became active, any reclusive Daolord in either this continent or the Sacred Immortal Realm would immediately realize that something was wrong! For the array to suddenly fire off before the hundred year mark had to mean that something had happened. Thus, they had no choice but to wait patiently.\u003c/p\u003e\n\u003cp\u003eIn this continent, there was a place known as ‘Wintermount’.\u003c/p\u003e\n\u003cp\u003eNing’s group of five secluded themselves here within the mountains forests, occasionally sipping wine, fishing, and sparring. Life was quite relaxing as they waited for the spacetime transfer array to activate.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eA fishing pole flicked upwards, followed by a fat fish being yanked out of the surface of the water. It fell down onto the bank, still flopping furiously.\u003c/p\u003e\n\u003cp\u003e“Haha, we’ll have fish soup tonight.” Ning put the fishing pole on his back as he walked through the forests. For the past thirty-plus years, he had lived the life of an ordinary mortal.\u003c/p\u003e\n\u003cp\u003eRumble. Rumble. Rumble. A series of sounds rang out from afar. Curious, Ning walked in that direction.\u003c/p\u003e\n\u003cp\u003eA young man dressed in simple clothes whose temples were graying was seated there, using a wooden drill to drill into a piece of wood. As the wooden drill ground away, those grinding, rumbling sounds could be heard.\u003c/p\u003e\n\u003cp\u003e“I’ve never met you before.” Ning laughed. “You new?”\u003c/p\u003e\n\u003cp\u003e“I just moved here.” The gray-templed youth raised his head to smile towards Ning.\u003c/p\u003e\n\u003cp\u003e“At such a young age, you’ve chosen to live by yourself in a desolate mountain wilderness, rather than in a city or a mountain village. How odd.” Ning hefted his fishing pole.\u003c/p\u003e\n\u003cp\u003e“Sometimes, being by yourself is better,” the young man said.\u003c/p\u003e\n\u003cp\u003eNing couldn’t help but laugh. How intriguing.\u003c/p\u003e\n\u003cp\u003eHe could tell that this youth was less than thirty years of age, but his eyes were as calm and as deep as the sea. He clearly had an extraordinary heart that was far more formidable than that of many Nascent Soul cultivators or even Apotheosis cultivators. This gave Ning a completely different way of viewing him.\u003c/p\u003e\n\u003cp\u003e“My name is Darknorth. I live just a few kilometers away from here. What’s your name?” Ning smiled.\u003c/p\u003e\n\u003cp\u003e“My name is Green Bamboo,” the youth said, continuing to use his wooden drill.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-3","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
