{"id":50644,"no":947,"title":"Book 28, Chapter 15 - The Secret of the Sacred Immortal Realm","content":"\u003cp\u003eHeartlord Solewind stared at the black-robed Daolord’s corpse, then said, “This Daolord was quite extraordinary. He was most likely the second and final Daolord here in the Sacred Immortal Realm. Now that he’s dead, we’ll probably be able to leave this place soon! It is possible that his master, Emperor Trisilk, might have some unique methods which would alert him of his disiciple’s death. He might be heading towards this place right now. Once he arrives, we’ll truly be doomed. We need to get out of here as soon as possible.”\u003c/p\u003e\n\u003cp\u003eNing and the others all nodded.\u003c/p\u003e\n\u003cp\u003eThe Palace of the Heart might’ve given Solewind a powerful protective Dao-seal, but it wouldn’t be enough to kill an Eternal Emperor; at most, it would just tie him down for a period of time. Even if the Palace Lord was personally present, it would be quite difficult for him to actually slay an Eternal Emperor.\u003c/p\u003e\n\u003cp\u003e“I’ll collect the corpse for now. After we escape from the Sacred Immortal Realm, we can bind his storage treasures and split those things up,” Solewind said.\u003c/p\u003e\n\u003cp\u003e“No!” Prince Greatjoy immediately argued, “Solewind, you used a life-saving Dao-seal to kill him. All the treasures will naturally belong to you. You used up a Dao-seal that represented 30% of a maximum-power strike from the Palace Lord of the Heartforce Palace! I imagine we could sell off all of this Daolord’s items, and it still wouldn’t be worth as much as that Dao-seal was. Even if you took everything, you are still coming out behind.”\u003c/p\u003e\n\u003cp\u003eSolewind was speechless.\u003c/p\u003e\n\u003cp\u003e“Right, Solewind.” Skyfire Brightshore said the same thing. “We’re certainly not going to take advantage of you like this. We can split up the treasures we earned from killing that weak Daolord of the First Step, but that golem and this black-robed Daolord’s treasures shall belong to Darknorth and yourself, respectively. You used up an extremely powerful Dao-seal, while brother Darknorth had to use up that favor from his helper.”\u003c/p\u003e\n\u003cp\u003e“These two affairs aren’t comparable. Brother Darknorth captured that golem, but there’s no way we could possibly split it up. The Daolord’s treasures, however, are useful for everyone,” Solewind argued.\u003c/p\u003e\n\u003cp\u003e“Unnecessary.”\u003c/p\u003e\n\u003cp\u003e“Stop quibbling.”\u003c/p\u003e\n\u003cp\u003e“We’re not taking it, and there’s nothing you can do to convince us otherwise.”\u003c/p\u003e\n\u003cp\u003eNing and the others all laughed as they rejected Solewind’s suggestions. They had known each other for thousands of years by now, and all of them were quite friendly with each other. Of the find, Solewind was the most logical and the most trustworthy.\u003c/p\u003e\n\u003cp\u003eSolewind shook his head, then said with resignation, “Fine, then. I’ll be shameless and accept it all. Oh, right. This Prismatic Kiloleaf Flower is pretty much at full maturity as well. Let’s harvest it. I’ll take all of the black-robed Daolord’s treasures, but we can split up the value of the flower later.”\u003c/p\u003e\n\u003cp\u003e“Agreed.”\u003c/p\u003e\n\u003cp\u003e“Harvest it first.”\u003c/p\u003e\n\u003cp\u003eWaterlord Firesurge waved his hand. Instantly, a stream of water surged out and formed a giant hand that gently cupped the distant, beautiful flower, then plucked it all at once.\u003c/p\u003e\n\u003cp\u003e“Come, let us keep on exploring,” Prince Greatjoy said. “We still have yet to find the core of this formation.”\u003c/p\u003e\n\u003cp\u003e“We have to breach the formation. Only then will we be able to leave this Sacred Immortal Realm.”\u003c/p\u003e\n\u003cp\u003eNing and the other five quickly began to advance once more. There would be plenty of time for them to split up the treasures later. Right now, every extra second they spent in this Sacred Immortal Realm was another second of danger for them! Who knew when Emperor Trisilk would come back? Although logically speaking the Sacred Immortal Realm had that enormous formation which completely separated it from the outside world, which meant Emperor Trisilk shouldn’t be aware of the black-robed Daolord’s death, in the end it was the Eternal Emperor himself who had set up this formation. He might’ve put in certain mechanisms that would let him know about what was happening in the Sacred Immortal Realm.\u003c/p\u003e\n\u003cp\u003eHe was an Eternal Emperor. Even if he was very far away, it probably wouldn’t take him that long to hasten to the Sacred Immortal Realm. If the five of them were caught here, they really would be finished.\u003c/p\u003e\n\u003cp\u003e“Hurry up.”\u003c/p\u003e\n\u003cp\u003e“Let’s move.”\u003c/p\u003e\n\u003cp\u003eThere were no further barriers in front of them. The planting grounds for the flower had essentially been the most important place in the entire estate, after all. They pushed open the enormous stone door in front of them, only to see a circular hallway behind it. The hallway was filled with complicated formations made from divine runes, and Immortal energy flowed through the runes with incredible power. More than ten thousand strange types of stones were present as well.\u003c/p\u003e\n\u003cp\u003eSome of the stones were jewel-like, some were white and slick, some were dark and gloomy, while some emanated auras of incredible cold. All sorts of different, strange stones were scattered throughout this place.\u003c/p\u003e\n\u003cp\u003e“We’re rich!” Prince Greatjoy’s eyes bulged out.\u003c/p\u003e\n\u003cp\u003e“So many treasures?!” Solewind swept the room with his gaze.\u003c/p\u003e\n\u003cp\u003e“All combined, these stones have to be worth at least ten million cubes!” Ning was shocked by the implications of this.\u003c/p\u003e\n\u003cp\u003eGood heavens. Ten million cubes? This was an absolutely enormous sum of money, even for a Verge-level Daolord… but these stones were merely being used to power this formation.\u003c/p\u003e\n\u003cp\u003e“We’ll split up these treasures into five portions. Each of us will get a portion,” Solewind said.\u003c/p\u003e\n\u003cp\u003e“Ahaha, alright! We’ll be shameless enough to accept that suggestion.”\u003c/p\u003e\n\u003cp\u003e“Right, right.”\u003c/p\u003e\n\u003cp\u003eGreatjoy and Ji Ning didn’t decline either.\u003c/p\u003e\n\u003cp\u003eIn truth, all of them felt rather puzzled and suspicious. From what the black-robed Daolord had said, this formation was personally set up by that Eternal Emperor, who had ordered the black-robed Daolord to protect this place! What secrets did this place hold, for the Eternal Emperor to order such a powerful Daolord to stay here permanently? Why did he pay such an enormous price and personally set up such a complicated formation here?\u003c/p\u003e\n\u003cp\u003e“No one is in command of the formation, and the formation’s core is the weakest part of any formation. It’ll be easy to break it apart. Don’t move, everyone. Let me deal with it,” Solewind said.\u003c/p\u003e\n\u003cp\u003eAlthough no one was in command of the formation, it still took someone at the Daolord level of power to break it.\u003c/p\u003e\n\u003cp\u003eSolewind carefully picked up one precious stone after another. After carefully picking up a total of twelve stones, the power of the formation began to fade. Solewind grinned. “Next… you can do whatever you like. This formation is no longer able to fight back against us.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Let’s do this.”\u003c/p\u003e\n\u003cp\u003eNing and the others all worked in concert, each of them collecting roughly a fifth of the total number of treasures present. With the treasures all collected, the formation naturally broke apart.\u003c/p\u003e\n\u003cp\u003e“The formation is done for. We can leave now.” Prince Greatjoy revealed a look of delight. “However… we still haven’t discovered what secrets this place is holding, for an Eternal Emperor to set both formations and guards over this place.”\u003c/p\u003e\n\u003cp\u003e“There are no other passageways from this estate,” Solewind said. “The mysteries don’t matter. Let’s leave first.”\u003c/p\u003e\n\u003cp\u003e“Agreed.”\u003c/p\u003e\n\u003cp\u003eThere really were no other passageways for them to take. They had gone as deep as they could into the estate, and they had already discovered the core of formation at the bottommost layer of the estate.\u003c/p\u003e\n\u003cp\u003eSwoosh! Swoosh! Swoosh! Swoosh! Swoosh!\u003c/p\u003e\n\u003cp\u003eNing and the others moved incredibly fast. In just a single breath’s worth of time, they flew out of the estate. There were no longer any barriers here to slow them down.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning and the others raised their heads to stare at the skies. Their faces all turned pale. “Not good.” All of them felt shocked.\u003c/p\u003e\n\u003cp\u003eThe formation-barrier covering the entire Sacred Immortal Realm had already broken down, revealing the world beyond. Outside the Sacred Immortal Realm was an endless sea of blazing, roiling energy. There were also enormous blazing stones that was flying through the skies. In short, it was an absolutely apocalyptic hell of fire.\u003c/p\u003e\n\u003cp\u003eThe barrier had completely blocked off the outside world, but it had also protected the Sacred Immortal Realm. Now that the formation had been cancelled out, the borders of the Sacred Immortal Realm actually began to collapse as the blazing flames of the inferno surrounding it descended.\u003c/p\u003e\n\u003cp\u003e“The Sacred Immortal Realm is about to break apart.”\u003c/p\u003e\n\u003cp\u003e“Let us give those mortals a hand.”\u003c/p\u003e\n\u003cp\u003eNing and the others could immediately tell that there was no way they could save the Sacred Immortal Realm. They immediately began to teleport to the places where the cultivators were gathered.\u003c/p\u003e\n\u003cp\u003eJust a short while ago, the cultivators had been released from their nightmare and regained their freedom. They were planning out how to establish a home for themselves when all of a sudden, something terrifying had appeared in the skies. Endless, flowing streams of blazing energy began to sweep downwards towards them. All of them knew that they were going to die.\u003c/p\u003e\n\u003cp\u003eThey could only watch as the fires of hell began to descend towards them. There was no way they could fight back at all.\u003c/p\u003e\n\u003cp\u003e“Get in here.” Ning appeared out of nowhere, then waved his hand and caused more than ten million cultivators to be drawn into his estate-treasure.\u003c/p\u003e\n\u003cp\u003e“Come here.” Heartlord Solewind appeared in another part of the world, rescuing the utterly terrified and despairing cultivators.\u003c/p\u003e\n\u003cp\u003eIn just two breath’s worth of time, all of the cultivators in the entire continent had been rescued by Ning’s group of five.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eThe blazing streams of fire and the flaming boulders came crashing downwards. Each time they struck against the Sacred Immortal Realm, the entire continent would tremble and shake. The entire continent began to break and crumble apart into multiple pieces. It was completely disintegrating.\u003c/p\u003e\n\u003cp\u003eNing and the others were all extraordinarily powerful. The power of the apocalyptic flames was enough to ruin this realm, but it wasn’t enough to harm them.\u003c/p\u003e\n\u003cp\u003eThey just stood there in the air, surrounded by the Yin-Yang Sword Domain which stretched off ten thousand kilometers. The blazing streams of energy and the flaming bouldesr were immediately destroyed once they moved close to the group.\u003c/p\u003e\n\u003cp\u003e“The continent is finished.” After rescuing the mortal cultivators, Ning and the others just watched and sighed.\u003c/p\u003e\n\u003cp\u003e“Quick, over there!” Prince Greatjoy’s face changed as he pointed towards part of the Daolord’s estate. Now that the entire continent had broken apart, they were able to see something which had been hidden at the very bottom of the continent. There, they could see an enormous levitating mountain that was formed out of fiery rocks. The peak of the mountain was roughly a million kilometers in size, and there were strange spatial ripples covering it.\u003c/p\u003e\n\u003cp\u003e“An entire mountain of darkspace flamestone?” Ning and the others were completely stunned.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-14\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-16\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-15","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
