{"id":50647,"no":950,"title":"Book 28, Chapter 18 - The Genesis Lands","content":"\u003cp\u003eMoksha acted very obediently, actively assisting Ji Ning in binding him. Ning couldn’t help but secretly sigh to himself. \u003cem\u003eHe certainly changed his attitude quite quickly.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWhen he had been first captured, he had been boastful and held Ning in no regard at all, feeling certain that Ning’s group was going to die soon. Now that he realized that his former master had died, he had immediately knelt down and begged, ‘Please do not kill me.’\u003c/p\u003e\n\u003cp\u003e“Master.” After being bound, Moksha immediately smiled ingratiatingly at Ning. “There is something I must tell you.”\u003c/p\u003e\n\u003cp\u003e“Speak,” Ning said.\u003c/p\u003e\n\u003cp\u003e“I was instructed by Emperor Trisilk to assist my master in mining ore,” Moksha said smugly. “Darkspace flamestone is extremely difficult to mine, but I am extremely strong. Over the course of thirty chaos cycles, I managed to mine quite a bit of ore. For convenience’s sake, I stored it all within an estate-treasure which I carried with me as I mined.”\u003c/p\u003e\n\u003cp\u003eNing’s eyes lit up. “Do you still have the darkspace flamestone?” He had been mining for thirty chaos cycles. How much had he mined?!\u003c/p\u003e\n\u003cp\u003e“I do.” Moksha nodded. “However, a good deal of it was taken away by my previous master. I only have on me the ore which I mined in the last nine chaos cycles. Take a look, Master.” As Moksha spoke, he waved his hand and caused fist-sized chunks of fiery-red rocks to appear on the ground. Strange spatial ripples began to fill the surrounding area as well.\u003c/p\u003e\n\u003cp\u003eHe waved his hand three times in total, causing the fiery-red rocks to pile up into a small mountain that was three thousand meters tall. By this point in time, space had begun to completely twist and distort, causing shimmering ‘curtains’ of folded space to appear in the surrounding area. Because the chunks of stone were all fist-sized, it wasn’t too hard to store them away in that estate-treasure. If this had been a single massive slab of darkspace flamestone, most likely only an Eternal Emperor would’ve been able to store it away.\u003c/p\u003e\n\u003cp\u003e“You mined that much?” Ning’s eyes nearly popped out.\u003c/p\u003e\n\u003cp\u003eAlthough golems that were as strong as Daolords of the Third Step were valuable, the amount of ore this particular golem was carrying was even more valuable.\u003c/p\u003e\n\u003cp\u003e“So much darkspace flamestone…” Ning swept it with his godsense, carefully calculating how much was present. “This has to be worth nearly ten million cubes of chaos nectar!”\u003c/p\u003e\n\u003cp\u003e“My former master had roughly twice as much as this,” Moksha said. “Early on, I wasn’t that skilled in using axes and so was rather slow in my mining. It took about twenty chaos cycles before I got better, and all of the ore I mined during that period of time I gave to my previous master. This pile here consists of the ore I mined during the past nine chaos cycles.”\u003c/p\u003e\n\u003cp\u003e“I’m more than satisfied with this.” Ning grinned.\u003c/p\u003e\n\u003cp\u003eThis ore had to be worth nearly ten million cubes of chaos nectar. As for the twenty million cubes which the black-robed Daolord had, that all belonged to Solewind. In order to save them, Solewind had used up a powerful Dao-seal that was so valuable, it would be almost impossible to find on the open market. Ning naturally didn’t feel any jealousy or envy whatsoever. For him to suddenly earn so much darkspace flamestone was already a stroke of tremendous fortune.\u003c/p\u003e\n\u003cp\u003e“What do you know about Emperor Trisilk?” Ning asked. The five of them still felt worried about this matter.\u003c/p\u003e\n\u003cp\u003e“Emperor Trisilk has an odd temper and is incredibly savage,” Moksha said. “You must be careful, Master. Based on what I know of the Emperor, he’s the type to avenge every single slight, no matter how petty. Once he locates the five of you… I guarantee he won’t let you off easily.”\u003c/p\u003e\n\u003cp\u003e“Oh?” A solemn look appeared on Ning’s face as he nodded.\u003c/p\u003e\n\u003cp\u003eBut of course, the two of them had no idea that Emperor Trisilk was currently in a far more miserable situation than they were.\u003c/p\u003e\n\u003cp\u003e“What about the Genesis Lands? What do you know about that place?” Ning asked.\u003c/p\u003e\n\u003cp\u003e“The Genesis Lands is where this entire universe sprang from. All combat is forbidden there,” Moksha said. “When I served the Emperor, I once spent a very long period of time in the Genesis Lands.”\u003c/p\u003e\n\u003cp\u003eNing asked, “Who issued the order forbidding all combat in that location?”\u003c/p\u003e\n\u003cp\u003e“The order came from the Church of Annihilation,” Moksha said. “Daolords generally do not dare to violate the commands of the Church. But of course, if someone really does go crazy, they can still choose to break this law. I once saw it happen with my own eyes. A Daolord, for the sake of evading an enemy, chose to hide within the Genesis Lands. However, his enemy was so enraged that he ignored the rules and chased the Daolord into the Genesis Lands, then killed him there! But of course… later on, the killer was wiped out by the Church of Annihilation!”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003e“Still… the Paladins of the Church of Annihilation aren’t afraid to violate this law. They are members of the Church itself, after all. Even when they break this law, they will at most suffer some non-lethal punishments,” Moksha said. “I once heard Master say that if the sixteen Starkings were to violate this law, no punishment would be given. Not even the ruler of the Church of Annihilation would choose to offend and act against his Starkings without a very good reason.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Ning chuckled. This golem knew quite a bit!\u003c/p\u003e\n\u003cp\u003eActually, the almighty Hegemon had given them some information regarding this alternate universe before sending them into it, but the amount of information was pitifully small. All Ning knew was that the Archaeus region was filled with danger, but once they reached the Genesis Lands in the center they would be fairly safe. Although the Genesis Lands held its own dangers, all violence was supposedly prohibited there. Supposedly, there was no need to worry about any World-level cultivators or Daolords you encountered within the Genesis Lands.\u003c/p\u003e\n\u003cp\u003eUpon hearing the golem speak at length, Ning couldn’t help but sigh.\u003c/p\u003e\n\u003cp\u003eA ‘prohibition’ against violence?\u003c/p\u003e\n\u003cp\u003eIn the end, there was a limit to how far that prohibition would stretch. Suicidally fearless cultivators would violate that prohibition, as would the Paladins and Starkings of the Church of Annihilation, thanks to the extremely high positions they held within the Church.\u003c/p\u003e\n\u003cp\u003e“Still… Paladins will be punished if they violate this prohibition. They won’t attack us without a good reason.” Ning nodded slowly. “As for Starkings… I imagine we aren’t even qualified to attract the attention of a Starking, much less offend one.”\u003c/p\u003e\n\u003cp\u003e“Our entire universe only holds sixteen Starkings, and almost none of them are in the Archaeus region,” Moksha said. “I heard Emperor Trisilk once say that even he himself has only met three Starkings in his lifetime.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eMoksha had been Emperor Trisilk’s golem for quite some time, and thus knew many of the Emperor’s secrets. He had even been in the Genesis Lands, and thus he was able to give Ning a good deal of information regarding that place.\u003c/p\u003e\n\u003cp\u003eTime slowly flowed on, and Ning’s group of eight continued their careful advance. The rest of their journey was fairly uneventful, and they did not encounter any more Daolords! In truth, the odds of encountering a Daolord in the Archaeus region were incredibly low to begin with.\u003c/p\u003e\n\u003cp\u003eBy now, they had spent over 8922 years in the Archaeus region, and they had encountered many dangerous situations and locales. Still, in the end they were able to safely reach the Genesis Lands. All eight of them survived this journey.\u003c/p\u003e\n\u003cp\u003e“The Genesis Lands.”\u003c/p\u003e\n\u003cp\u003eA flying vessel was soaring through the emptiness of space.\u003c/p\u003e\n\u003cp\u003eNing and the rest of the eight were aboard the vessel, and their heads were raised as they stared at an utterly enormous floating world which was in front of them. This was the Genesis Lands! This was the wellspring of this entire alternate universe, from which all things originally arose.\u003c/p\u003e\n\u003cp\u003e“That aura of power…” Ning and the others were all quite shaken.\u003c/p\u003e\n\u003cp\u003eAn invisible field of power covered the entire Archaeus region. Without an Archaeus medallion, even the likes of Eternal Emperors would be instantly crushed to death! The Archaeus region was almost as large as their homeland, the ‘Endless Territories’. It was incredibly vast, and that field of power stretched out to cover every inch of the region.\u003c/p\u003e\n\u003cp\u003eAnd yet… the incredibly vast world in front of them was the source of that field of power. One could imagine how much might it contained! Not even someone as powerful as the almighty Hegemon could compare to the might of the Genesis Lands of the Archaeus region.\u003c/p\u003e\n\u003cp\u003e“Come. Let us enter the Genesis Lands,” Ning said.\u003c/p\u003e\n\u003cp\u003e“Brother Darknorth, you told us earlier that the elementary trial we need to pass in order to enter the Genesis Lands is a trial of resolve, correct?” Greatjoy asked.\u003c/p\u003e\n\u003cp\u003e“That is what my golem told me. I think he was telling the truth,” Ning said.\u003c/p\u003e\n\u003cp\u003eNot just anyone was permitted to enter the Genesis Lands.\u003c/p\u003e\n\u003cp\u003eFor weaker cultivators, entering the Genesis Lands was an almost impossible task. Any creature which sought to enter the Genesis Lands would first have to pass a trial of resolve. If they were able to endure it, they would be able to freely enter and wander the Genesis Lands. If they failed, they would be knocked unconscious and be teleported away. They would not be qualified to enter this sacred place.\u003c/p\u003e\n\u003cp\u003e“The trial isn’t that tough. Daolords and major schools often send their elite disciples to this place. Almost all of the more talented ones are able to gain entry.” Ning could tell that Su Youji, Chaos Immortal Swallowback, and World Goddess Skywolf all looked rather nervous. The three of them were just retainers, after all. Compared to the original five, they were still quite a bit weaker. As a result, they possessed less confidence in their own abilities as well.\u003c/p\u003e\n\u003cp\u003e“Alright.” The Flamefairy nodded.\u003c/p\u003e\n\u003cp\u003eWhoosh.\u003c/p\u003e\n\u003cp\u003eThe flying vessel advanced at high speeds, flying towards that utterly massive levitating world. Finally, it began to slow down as it drew closer.\u003c/p\u003e\n\u003cp\u003eA web of venerable, almost sacred power descended from on high, covering Ning and the other eight within its grasp. This web of power was grim and unfeeling, and it possessed no intelligence whatsoever. It was a type of power which the Genesis Lands itself naturally possessed. This place was the Genesis Lands. It was not a place for weak creatures to live in.\u003c/p\u003e\n\u003cp\u003eRumble…\u003c/p\u003e\n\u003cp\u003eNing could feel something furiously hammer at his soul. However, Ning’s soul had been nurtured and strengthened by his azureflower mist energy, making it comparable to the soul of a Daolord of the First Step. He was able to resist the pressure with ease.\u003c/p\u003e\n\u003cp\u003eNing turned to glance at the others.\u003c/p\u003e\n\u003cp\u003ePrince Greatjoy, Solewind, and Firesurge all seemed to be handling the trial with ease, and they all glanced back at him as well, smiles on their faces.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning and the others all noticed at the same time that Skyfire Brightshore had an ugly look on his face, and his body was trembling slightly. Although he was blessed with incredible natural gifts and had an extraordinary bloodline, he had experienced very few dangerous encounters in his early life. As a result, his soul and his willpower were all somewhat lacking when compared to that of Ning and the others.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-17\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-19\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-18","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
