{"id":50662,"no":965,"title":"Book 28, Chapter 33 - The Five Sword-Intents of [Brightmoon]","content":"\u003cp\u003e“Kill!” The other two volcano titans howled as they charged forwards, each seeming just as valiant and mighty as the first. Their thunderous steps were as heavy as the mountains, but they moved faster than the limits of the Heavenly Daos. Although each of their punches and strikes seemed rather ungainly to Ji Ning, they carried enough power to truly overmatch him.\u003c/p\u003e\n\u003cp\u003e“I refuse to believe I can’t even take care of the three ‘children’.” Ning’s body constantly blurred, disappearing and reappearing thanks to the Shadowless stance, and every so often he would rely on his superior agility to throw out rope treasures and other treasures to slow down his foes.\u003c/p\u003e\n\u003cp\u003eUsing your strengths to attack your opponent’s weaknesses. This was the way of combat!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe muscular, greatsword-wielding man continued to stand there in front of the distant shrine, a cold look in his eyes as he watched all this happen. Right at this moment, two new figures suddenly descended; the white-robed man and the azure-armored man.\u003c/p\u003e\n\u003cp\u003e“Big brother.” The white-robed man and the azure-armored man both spoke out.\u003c/p\u003e\n\u003cp\u003e“Mm.” The muscular man acknowledged them calmly.\u003c/p\u003e\n\u003cp\u003e“The kid’s able to hold his own against the combined attacks of three volcano titans. He really isn’t bad.” The azure-armored figure glanced at the distant Ning, then smiled. “Big brother, would you agree that this kid is worth us spending some effort teaching?”\u003c/p\u003e\n\u003cp\u003eThe muscular man said coldly, “Far from it. He’s merely relying on a few defensive tricks to stay alive. Once my children unleash their ultimate attacks, he’ll definitely die.”\u003c/p\u003e\n\u003cp\u003e“Are you just going to watch him die?” The white-robed man asked hurriedly.\u003c/p\u003e\n\u003cp\u003e“He might’ve developed two offensive Supreme Daos and two defensive Supreme Daos, but so what?” The muscular man said coldly, “He hasn’t been able to truly join them together… he’s not even worth me giving advice to.”\u003c/p\u003e\n\u003cp\u003eThe azure-armored man and the white-robed man exchanged a glance, then shook their heads helplessly.\u003c/p\u003e\n\u003cp\u003e“Big brother, you really have set your expectations too high. Remember that guy, all those years ago, who had perfectly fused his offensive Dao and his defensive Dao? You ended up personally kill him!” The azure-armored man muttered.\u003c/p\u003e\n\u003cp\u003e“Hmph. That’s because he was too stupid. I personally gave him pointers on what to do, but he still wasn’t able to improve at all. He deserved to die.” The muscular man continued, “And even if he did have a so-called flawless union of an offensive Supreme Dao and defensive Supreme Dao, what of it? It must be understood that advancing forwards on such a path is incredibly difficult. Each step will be taxing, and the final step of completing the Daomerge and gaining eternity will be unspeakably arduous.”\u003c/p\u003e\n\u003cp\u003e“Over the course of countless years I’ve seen many dazzlingly talented figures who, as Daolords of the Fourth Step, were capable of killing weaker Eternal Emperors. Almost none of them, however, are capable of succeeding in their Daomerge and gaining the power of a Hegemon.” The muscular man shook his head. “Master is already dead. He can only accept a single personal disciple and two honorary disciples. There’s only three slots total. I have to be incredibly cautious when doling them out. Even an honorary disciple has to be both a perfect candidate as well as have a Dao which is very similar to my master’s Dao. As for becoming a personal disciple? Only someone who can receive the acknowledgment of my master’s Eternal weapon and make it voluntarily wish to serve him is qualified be given that position!”\u003c/p\u003e\n\u003cp\u003e“You really do have high expectations.”\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eExcessively\u003c/em\u003e high expectations.”\u003c/p\u003e\n\u003cp\u003eThe white-robed man and the azure armored man both shook their heads. After their masters had perished, they had only met a single genius who had been able to truly and perfectly merge an offensive Supreme Dao and a defensive Supreme Dao… and in the end, the muscular man had personally killed him! He hadn’t even been willing to hand over a position of honorary disciple.\u003c/p\u003e\n\u003cp\u003e“Master decided to only accept two honorary disciples. I’m willing to bet that the personal disciples of the leader of the Church of Annihilation are given less than my master has prepared for his two honorary disciples,” the muscular man said coldly.\u003c/p\u003e\n\u003cp\u003eIn the end, the term ‘disciple’ was just a titular one. What really mattered was what the teacher and master had prepared! There was only so much a living Hegemon would give; there was no way he would bestow his most important treasures to someone else. Only a dead Hegemon would be so truly selfless as to hand over all of his treasures!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe three volcano titans stood in three different directions as they surrounded and attacked Ning. Ning no longer dared to face them head-on, as the volcano titans possessed overwhelming levels of brute strength. Worse, he was completely incapable of damaging their volcanic bodies. Not even his Blood Drop stance could punch through them! For now, he could only rely on his Soleheart sword-intent to buy himself some time. Ning also used his rope-type magic treasures to try and tie down one of the volcano titans. Ning believed this to be his only method for capturing and subduing them.\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eThey used the most elementary, simple of attacks. Sometimes, they would swing their giant rocky hands. Other times, they would raise their fists high in the air, then smash downwards towards the ground. Every so often, they would bring both arms to their chests, then make a sudden pushing motion towards Ning. The attacks were simple but filled with speed and savagery, causing Ning to be at a complete disadvantage in this fight.\u003c/p\u003e\n\u003cp\u003e“Mm. Although they use similar techniques, it seems as though there are some differences.” Ning realized that there was something off with these three volcano titans. One of them was faster and more explosive while the second always attacked with both hands. As for the third, he was the slowest of the three; he would spend quite a bit of time building up power before each attack, but the attacks he unleashed were incomparably devastating.\u003c/p\u003e\n\u003cp\u003e“Although their attacks aren’t exactly the same, they seem to share certain similarities.” Ning was slowly mesmerized by the possibilities. From their attacks, he was able to see some of the things he himself had been searching for but unable to truly master.\u003c/p\u003e\n\u003cp\u003eSlowly, as the battle continued Ning began to gain a few insights into the various battle stances that the three volcano titans used. But of course, he was only able to gain a few. The three volcano titans were very crude in using these techniques, after all.\u003c/p\u003e\n\u003cp\u003e“The Heavenbreaker stance…”\u003c/p\u003e\n\u003cp\u003eRight now, the only stance remaining was the Heavenbreaker stance!\u003c/p\u003e\n\u003cp\u003eThe five stances of [Brightmoon]. He had already developed Supreme Daos based on the other four stances. Only the Heavenbreaker stance was left.\u003c/p\u003e\n\u003cp\u003eThe Heavenbreaker stance was the most ferocious of stances, containing truly wild and berserk levels of power. It used overwhelming power to crush all foes and was Ning’s most physically powerful attack. It was the perfect solution for dealing with foes whose defenses simply couldn’t be pierced through or penetrated.\u003c/p\u003e\n\u003cp\u003eThe Shadowless stance focused on being fluctuating and unpredictable; this naturally caused the power of the actual attacks to be somewhat weaker.\u003c/p\u003e\n\u003cp\u003eThe Blood Drop stance destroyed everything in its path, letting it pierce through all which would oppose it.\u003c/p\u003e\n\u003cp\u003eThese two stances had both reached the apex in their respective fields… but both had made sacrifices in terms of total, raw power! Only by focusing in one area could one reach the apex in that area, after all.\u003c/p\u003e\n\u003cp\u003eThe Heavenbreaker stance didn’t have a terrifying penetrative ability, nor was it unpredictable in the slightest. It was simply an awesome, direct attack that contained the strongest levels of power possible.\u003c/p\u003e\n\u003cp\u003e“Mm… ah! Is that how it is?” Ning’s battle against the three volcano titans grew increasingly frenzied, and he continued to secretly learn from their striking techniques.\u003c/p\u003e\n\u003cp\u003eThis furious battle persisted for roughly the amount of time needed to boil a kettle of tea.\u003c/p\u003e\n\u003cp\u003e“Time for the final attack.” The distant azure-armored figure and white-robed figure both let out soft sighs. They had grown accustomed to seeing this long ago. The strongest attack which these three volcano titans had was actually a single attack that was combined from three different attacks. Once they joined together to form the final attack, they would be able to unleash the most powerful killing strike they were capable of.\u003c/p\u003e\n\u003cp\u003eThe power of that attack was terrifyingly great! If you did not have a truly perfect Dao, it was all but guaranteed that you would perish from it. And even if you did have a perfect Dao… it was likely that their ‘big brother’ would personally attack and kill you!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter battling furiously for the time needed to boil a kettle of tea, the movements of the three volcano titans suddenly changed.\u003c/p\u003e\n\u003cp\u003e“Eh?” Ning’s face tightened slightly.\u003c/p\u003e\n\u003cp\u003eWhoosh! One of the volcano titans suddenly lifted up his enormous stone hands, preparing to slam downwards towards Ning. The second volcano titan slowly advanced, both hands in front of his chest as he prepared to make a shoving motion. The final volcano titan began to prepare to swing his arms towards Ning…\u003c/p\u003e\n\u003cp\u003eThe rhythm of the battle had changed. The attacks of the three volcano titans had joined together to form a whole, and the power of their attacks actually began to rise.\u003c/p\u003e\n\u003cp\u003eNing instantly understood what he was seeing. This was much like how he perfectly merged his six Eternal swords together when using the Soleheart sword-intent. In this moment, the three volcano titans had truly merged together, and the power of this attack would definitely be ten times greater than their previous ones. Ning had already been at a complete disadvantage. For their attack power to increase tenfold… he was going to get crushed!\u003c/p\u003e\n\u003cp\u003e“AH!” Ning’s eyes suddenly lit up. “T-this… this is how the Heavenbreaker stance should be!” A look of wild joy suddenly appeared within his eyes as he stared at the three volcano titans.\u003c/p\u003e\n\u003cp\u003eIn truth, the three volcano titans were using one of the techniques which the Hegemon had developed. This technique was 70%-80% similar to Ning’s Heavenbreaker stance.\u003c/p\u003e\n\u003cp\u003eWhen Ning had watched and sparred with the volcano titans, he had gained a number of new insights. Given that his Heavenbreaker stance had already reached a bottleneck and only needed one final push to break through to a new level… once the three volcano titans joined forces, Ning suddenly understood it all.\u003c/p\u003e\n\u003cp\u003eA warhorse needed enough space to gallop before it could reach its maximum velocity.\u003c/p\u003e\n\u003cp\u003eA bow needed to be drawn to a full arc before it would reach maximum power.\u003c/p\u003e\n\u003cp\u003eHints of the truth to this Dao could be seen throughout the mortal world.\u003c/p\u003e\n\u003cp\u003eThe Heavenbreaker stance… if you wanted to release the full, terrifying level of power it contained, you would need to first build up power! For example, in archery you would build up power by drawing your bow… and then let it explode forth with its full might, like a volcano erupting! Only by building up enough might would you be able to unleash the full power of your attack! But just as importantly, the moment you unleashed your power had to be fast, fierce, and compressed into a short instant.\u003c/p\u003e\n\u003cp\u003eThis… this was what a Heavenbreaker stance should look like.\u003c/p\u003e\n\u003cp\u003e“Heavenbreaker.” Ning made his move. He raised all six of his arms high into the air, filling his Violetjewels with his divine power and causing them to instantly skyrocket in weight.\u003c/p\u003e\n\u003cp\u003eTen times. Ten thousand times. A trillion times…\u003c/p\u003e\n\u003cp\u003eThe six Violetjewels each became as heavy as a chaos star! This was approaching the maximum level of weight which Ning was currently able to control. The Heavenbreaker stance was ideally executed with extremely heavy weapons, such as the deep blue greatsword of the deceased Hegemon. That was actually an incredibly dense and unique weapon which was perfect for using the Heavenbreaker stance.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-32\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-34\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-33","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
