{"id":50676,"no":979,"title":"Book 28, Chapter 47 - Kindness and Gratitude","content":"\u003cp\u003e“I’m still missing something.” Ji Ning frowned as he sat there atop the wave, the sword silhouette in the air continuing to execute sword-arts.\u003c/p\u003e\n\u003cp\u003e“It doesn’t make sense. I’ve clearly mastered all five Supreme Daos and joined them together perfectly.” Ning tested his sword-arts out repeatedly. “So why is it that I feel like I’m lacking something?”\u003c/p\u003e\n\u003cp\u003e“What exactly am I missing?”\u003c/p\u003e\n\u003cp\u003eAgain and again and again, Ning used his sword to execute his various sword-arts.\u003c/p\u003e\n\u003cp\u003e“BAH!” He spent five nights and five days testing things out, only to make no improvements at all. Ning couldn’t help but let out a rather frustrated howl, his voice reverberating within the skies of this estate-world. The wavy waters of the entire sea suddenly fell flat and turned completely still, almost as if it had been frozen in place. Not a single wave could be seen.\u003c/p\u003e\n\u003cp\u003e“Whew.” Ning drew a long breath, allowing the frozen seas to return to normal and the waves to arise once more.\u003c/p\u003e\n\u003cp\u003e“Perhaps I’m being a bit too impatient,” Ning murmured softly.\u003c/p\u003e\n\u003cp\u003eIn truth, Ning was not to be blamed. He had felt certain that he had already found his strongest Supreme Daos, but now he suddenly had the feeling that his Sword Dao was still lacking in something. This meant his Supreme Dao wasn’t actually ‘supreme’. Of course he was irritated by this!\u003c/p\u003e\n\u003cp\u003e“To be able to notice flaws in my Sword Dao is a good thing. It’s certainly better than not even realizing my own imperfection.” Ning regained his normal calm. “I should focus on calmly meditating on my sword-arts again. Perhaps when enough time, I’ll be able to naturally break through to the next level.”\u003c/p\u003e\n\u003cp\u003e“My five Supreme Daos are already joined together perfectly. If I can make another breakthrough…” Ning was puzzled. “I’ve never even heard of something like this.”\u003c/p\u003e\n\u003cp\u003eBertulu, Eastcult, and the other monstrously talented geniuses all generally mastered multiple Supreme Daos, then fitted them together perfectly. This represented the utmost apex of power. This was what many major powers all believed to be true! Previously, Ning had believed it to be true as well… but now, he suddenly discovered that it wasn’t necessarily the apex.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNing spent even more of the coming years on his sword-arts, but of course he spent some time on the pill-making techniques of the [Seven Leafpill Chapters] as well.\u003c/p\u003e\n\u003cp\u003eSoon, more than fifty thousand years had gone past since his initial entry into the Trileaf Realm.\u003c/p\u003e\n\u003cp\u003e“I’ve finally mastered it. How truly inconceivable! At the World level, I’ve actually managed to master the quadressence thunder.”\u003c/p\u003e\n\u003cp\u003eNing stood there at the peak of a mountain, his eyes flashing. Instantly, a streak of golden lightning shot out of him.\u003c/p\u003e\n\u003cp\u003eThis bolt of golden lightning was filled with an aura of sharpness. This was Ning’s newly created quadressence thunder! When Ning had first started to train in alchemy, he had been able to immediately master the tri-essence thunder and the quadressence water. Now that he had spent five million years of accelerated time training in alchemy, he had made tremendous strides in this field. In pill-making, Ning was superior to even Pillsaint. Pillsaint was still working on the third chapter, after all. Ning was working on the seventh chapter!\u003c/p\u003e\n\u003cp\u003e“Daolord Allgod once said that a Daolord of the First Step would have a chance at mastering the tri-essence thunder.” Ning laughed. “I’m at the World level, but I’ve actually mastered the quadressence thunder. Haha…”\u003c/p\u003e\n\u003cp\u003eHis azureflower mist energy was comparable to a Daolord’s energy, and his pill-making arts were absolutely unearthly as well. This was why he was able to produce such miraculous results.\u003c/p\u003e\n\u003cp\u003e“Now, I have quadressence thunder and quadressence water.” Ning willed them all to come out.\u003c/p\u003e\n\u003cp\u003eBoom! Boom! Boom! Boom!\u003c/p\u003e\n\u003cp\u003eA dazzling bolt of golden lightning and a crystalline stream of jade green water instantly filled the skies, transforming into an incomparably terrifying domain of sword-intent! The Yin-Yang Sword Domain was now definitely Ning’s most powerful killer attack. The quadressence thunder and the quadressence water could unleash ruinously powerful attacks that would heavily injure even Daolords of the Second Step. When they were used in this domain of sword-intent… they could actually wipe those second step Daolords out!\u003c/p\u003e\n\u003cp\u003eFor now, Ning truly had reached his limit in terms of controlling lightning and water. He had no chance at all of completing pentessence water; most likely, he would have to first become a Daolord.\u003c/p\u003e\n\u003cp\u003eRoughly a thousand years passed after Ning had mastered his quadressence thunder.\u003c/p\u003e\n\u003cp\u003e“Master! Master! I’ve succeeded. I’ve succeeded!” World God Pillsaint came flying in search of Ning.\u003c/p\u003e\n\u003cp\u003e“Follow me.” After ascertaining that Pillsaint had indeed completely mastered the third chapter, Ning immediately led Pillsaint out of his estate-world, taking him to pay a visit to the Paragon of Pills.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Come in.”\u003c/p\u003e\n\u003cp\u003eNing couldn’t help but shiver when he saw that dark, icy-cold estate. He couldn’t help but sigh as well. Why did the Paragon have to live by herself in a place like this? Why?\u003c/p\u003e\n\u003cp\u003eAs Ning lamented silently, he led Pillsaint into the estate.\u003c/p\u003e\n\u003cp\u003eThe Paragon of Pills was seated in the lotus position before the enormous pill cauldron, her black gauzy robes spread across her and over the ground.\u003c/p\u003e\n\u003cp\u003e“Darknorth.” The Paragon glanced at Ning, her gaze turning much gentler than before.\u003c/p\u003e\n\u003cp\u003e“Greetings, Paragon,” Ning said respectfully. As for Pillsaint, he obediently fell to his knees and kowtowed.\u003c/p\u003e\n\u003cp\u003e“Sit,” the Paragon instructed.\u003c/p\u003e\n\u003cp\u003eAlthough she told them to sit, in reality they merely sat on the ground in the lotus position as well. Pillsaint snuck a glance at the Paragon, but didn’t dare to stare directly at her. He simply felt rather puzzled… he could clearly see her, but why was it that he kept on feeling as though he couldn’t make out her features?\u003c/p\u003e\n\u003cp\u003e“Paragon,” Ning said.\u003c/p\u003e\n\u003cp\u003e“If you don’t mind, you can simply address me as ‘Mistress’,” the Paragon of Pills said.\u003c/p\u003e\n\u003cp\u003e“Mistress,” Ning called out obediently. He already had a vague understanding of what the relationship between the Paragon and the deceased Hegemon had been like, and also understood how the Paragon felt about him as a result.\u003c/p\u003e\n\u003cp\u003eThe Paragon of Pills nodded. “Have you brought this young fellow to me because of the [Seven Leafpill Chapters]?”\u003c/p\u003e\n\u003cp\u003eNing nodded. “He is my retainer, World God Pillsaint. I have already transmitted the first three chapters to him, and he has mastered them all. That is why I have brought him here.”\u003c/p\u003e\n\u003cp\u003e“Then refine a cauldron of Thousand Songs pills.” The Paragon glanced at Pillsaint, her eyes quite calm. She didn’t really care that much about so-called ‘alchemy geniuses’; Hegemons rarely were very eager to take on new disciples. They themselves could live for countless years; why would they have to find people to teach their skills to?\u003c/p\u003e\n\u003cp\u003eOnly truly exceptional geniuses that they also took a personal liking to would be accepted as disciples. She treated Ning in a very special manner, and as a result she held a certain fondness for those connected to him. This was why she was willing to give Pillsaint a chance.\u003c/p\u003e\n\u003cp\u003e“Yes.” Pillsaint understood that this moment was a moment which could change his destiny. In truth, as soon as he saw that enormous lake of chaos nectar he had been rather stunned. He immediately began to work on refining pills.\u003c/p\u003e\n\u003cp\u003ePillsaint was extremely careful, and his cauldron of pills was quite good.\u003c/p\u003e\n\u003cp\u003e“Not bad. Darknorth, how long did your retainer need in order to master the three chapters?” Pillsaint asked.\u003c/p\u003e\n\u003cp\u003e“He’s been in my estate-world this entire time, where time moves a hundred times faster than normal. Thus… he should’ve spent more than five million ‘accelerated’ years,” Ning answered honestly. Lying in front of a major power like her would be utterly stupid.\u003c/p\u003e\n\u003cp\u003eThe Paragon of Pills frowned slightly. More than five million years to just learn three chapters? Given her standards, this was fairly slow! She generally only accepted the most elite of disciples, people like Bertulu or Ji Ning. Although Pillsaint was extremely talented in alchemy, he still wasn’t quite at her mark.\u003c/p\u003e\n\u003cp\u003e“You can become one of my honorary disciples, I suppose.” The Paragon said calmly, “I shall transmit the first six chapters of the [Seven Leafpill Chapters] to you. Swear an oath to never disseminate it to others.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Pillsaint was actually overjoyed. Being able to learn the first six chapters was already quite incredible.\u003c/p\u003e\n\u003cp\u003eThe Paragon bestowed a golden medallion upon him, and it immediately merged into his body once he touched it, filling his mind with certain memories as well as forcing him to involuntarily swear a lifeblood oath. Clearly, the Paragon wasn’t being nearly as gentle with him as she had been with Ning.\u003c/p\u003e\n\u003cp\u003e“Thank you, Master.” After fully memorizing the technique, Pillsaint was absolutely delighted. He immediately kowtowed respectfully to express his gratitude.\u003c/p\u003e\n\u003cp\u003eThe first six chapters alone would still allow Pillsaint to vastly outstrip Daolord Allgod in alchemy. Many of the pill formulas included within the first six chapters were actually pills which only Eternal Emperors could create.\u003c/p\u003e\n\u003cp\u003eAs for the seventh chapter, it contained the Paragon’s most elite techniques. She wouldn’t casually teach it to outsiders.\u003c/p\u003e\n\u003cp\u003e“You are Darknorth’s retainer, yes? Make sure you serve him loyally. If you betray him, do not blame me for showing you no mercy,” the Paragon said.\u003c/p\u003e\n\u003cp\u003e“Your disciple understands,” Pillsaint said respectfully. In truth, he could tell that this opportunity was most likely all thanks to the Paragon’s relationship with Ji Ning.\u003c/p\u003e\n\u003cp\u003e“Thank you, Mistress.” Ning felt gratitude as well. The Paragon of Pills truly did treat him well.\u003c/p\u003e\n\u003cp\u003e“Gonflame should be able to complete your lifeblood weapons within another ten thousand years.” The Paragon looked at Ning. “My divinations are whispering to me that you probably leave upon acquiring those weapons.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Ning nodded respectfully.\u003c/p\u003e\n\u003cp\u003e“My divinations indicate that once you leave, it will be a long, long time before the two of us ever meet again!” The Paragon said. “Thus… you must be very careful on your path of cultivation. If you encounter any serious issues, you can use my name to warn those who would harm you. It might be of some use. Also… true major powers have all types of abilities. Don’t rely too much on any single type of life-saving measure.”\u003c/p\u003e\n\u003cp\u003e“For example… my calculations indicate that you have a Primaltwin. However, certain major powers who wish to kill you can use certain karma techniques to completely annihilate your truesoul, be it that of your true body or your Primaltwin,” the Paragon said. “Karma techniques are extremely formidable, and have effects similar to that of lifeblood oaths. They can follow those secret, hidden connections and wipe out the truesouls of all of your clones and bodies.”\u003c/p\u003e\n\u003cp\u003eNing couldn’t help but feel speechless and amazed upon hearing this. Once a lifeblood oath was violated, all bodies would be annihilated, true… but there were actually attack techniques that could achieve the same results? This was utterly terrifying.\u003c/p\u003e\n\u003cp\u003e“In the future, you shall understand how powerful the ‘major powers’ truly are,” the Paragon said. “Thus, you absolutely must be careful in your path of cultivation. That way, the two of us might have a chance to meet again in the future. You may go now. It won’t be necessary for you to come and say farewell to me when you leave.”\u003c/p\u003e\n\u003cp\u003e“Yes, Mistress.” Ning respectfully fell to his knees, expressing his gratitude.\u003c/p\u003e\n\u003cp\u003eAlthough they had only met each other a few times, Ning could sense that the Paragon of Pills truly held nothing back from him and did not plot against him at all. She truly was doing what she thought was best for him.\u003c/p\u003e\n\u003cp\u003eIn his mind, Ning viewed her as he would a close friend or a beloved senior. He silently memorized the kindnesses she had shown him. For now, though, he was still very weak. Repay her kindness? That was something for the distant future.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-46\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-28-chapter-48\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-47","bookId":1501,"creation":"Sep 10, 2019 4:16:13 AM","modification":"Sep 10, 2019 4:16:13 AM"}
