{"id":49795,"no":98,"title":"Book 5, Chapter 24 - The Stone Room Within the Mine","content":"\u003cp\u003eMisty fog coiling about, Ji Ning just stood there, looking at his five elders. The Patriarch, his father, and the others were all very calm. Clearly, they had already made their decision.\u003c/p\u003e\n\u003cp\u003e“I am the Patriarch.” Ji NInefire said very calmly. “For the sake of the Ji clansmen. For the sake of the Ji clan’s reputation! I will stand out and welcome this battle with Snowdragon Mountain!”\u003c/p\u003e\n\u003cp\u003eGranny Shadow said in her hoarse voice, “I’ve lived nearly four hundred years. Can it be that I, Ji Shadow, am going to hide so as to live for a few more years while watching my clansmen fall into danger? In addition, I feel very happy that I’ll be able to face death with my elder brother.”\u003c/p\u003e\n\u003cp\u003e“Wherever my mistress is, I shall be there.” The old servant, Ah Xing, actually spoke out, a rare event indeed.\u003c/p\u003e\n\u003cp\u003e“It’s enough for we three old fellows to be there.” Ninefire smiled.\u003c/p\u003e\n\u003cp\u003e“Patriarch!” Truekeep spoke out. “I know the limits of my own talent. Even amongst the Zifu Disciples of the Ji clan, I am only average. It’s virtually impossible for me to become a Wanxiang Adept! This battle…is the most critical battle which will determine the fate of my Ji clan. I cannot hide from it.”\u003c/p\u003e\n\u003cp\u003eYichuan smiled as well. “Patriarch, you know my situation as well. My Immortal path is shattered. I don’t want to die a silent, meaningless death. I must participate in this battle.”\u003c/p\u003e\n\u003cp\u003e“The two of you…” Ninefire shook his head.\u003c/p\u003e\n\u003cp\u003eNing, hearing this, was stunned.\u003c/p\u003e\n\u003cp\u003eHis Immortal path was shattered?\u003c/p\u003e\n\u003cp\u003eDidn’t his father always say that his heart was focused on following the Immortal path? Why did that change?\u003c/p\u003e\n\u003cp\u003e“Father, you said your Immortal path is shattered?” Ning stared at his father in disbelief.\u003c/p\u003e\n\u003cp\u003eYichuan looked at his son, a rather complicated look on his face. “Actually, while adventuring in the Darknorth Sea, I had already broken through to the Zifu Disciple level. Afterwards, when your mother became pregnant with you, I had already reached to the middle Zifu level. I led your mother, wanting to return to Swallow Mountain, but your maternal uncle was worried, so he escorted us back.”\u003c/p\u003e\n\u003cp\u003eNing listened intently.\u003c/p\u003e\n\u003cp\u003eHe knew that a calamity had occurred on the way back.\u003c/p\u003e\n\u003cp\u003e“Afterwards, we met with a disaster.” Yichuan said. “Your mother was badly injured, but your Uncle White led you back. Your uncle and I both executed forbidden arts, using all our might to delay the enemy! During that battle, your uncle died while I was badly injured. Because I used a forbidden art for too long a period of time, the damage done to my Zifu Violet Palace was too great, and my Violet Palace became warped and atrophied, unable to expand again in the future. In other words, it is impossible for me to increase my power. I will forever remain a mid-level Zifu Disciple.”\u003c/p\u003e\n\u003cp\u003e“Because of the atrophication of my Zifu, I’m only able to draw out a hint of the ki energy within my Zifu.” Yichuan shook his head. “There’s no way I can ride on a magic treasure with just that tiny strand of Ki! Thus, I focus on my swordplay, with that strand of ki being the foundation of it. I draw forth the power of the world with every single blow of sword light.”\u003c/p\u003e\n\u003cp\u003e“But of course.” Yichuan said somberly. “I can still use a forbidden art one more time, forcibly drawing out a large amount of ki energy from within my Zifu. But given how my Zifu is already warped…there’s no need to repeat what I said earlier. Once I use a forbidden art, most likely within one hour, my Zifu will completely shatter, and I will be transformed into a cripple. In other words…I, your father, can only be a Zifu Disciple for one more time. After one last bout of glory, I will become a cripple.”\u003c/p\u003e\n\u003cp\u003eNing was stunned.\u003c/p\u003e\n\u003cp\u003eNo wonder his father’s swordplay was so powerful! No wonder his father never rode on a ranked magic treasure!\u003c/p\u003e\n\u003cp\u003e“My Immortal path is shattered. I only have one opportunity to use this forbidden art again.” Yichuan looked at his son. “Previously, I was keeping this opportunity in abeyance for you. I wanted to protect you. I wanted you to hold on to my jade sword, and upon encountering any danger, you would shatter that jade sword, and I would immediately hurry over to you. Even if you encountered a Zifu Disciple, I would have the power to rescue you. For the sake of my son, it would have been worth it.”\u003c/p\u003e\n\u003cp\u003eNing’s heart was trembling.\u003c/p\u003e\n\u003cp\u003eSo the truth was…\u003c/p\u003e\n\u003cp\u003eSo the truth was, his father had been planning on this.\u003c/p\u003e\n\u003cp\u003e“But you no longer need my protection.” Yichuan smiled. “Your mother is dead as well. My Immortal path is shattered. And you are an adult, now. I have nothing holding me back. I will not retreat, this time. This will be the last battle I shall ever fight, and it will also be the most glorious battle of my life. If I die, I would rather die in this battle, die for the sake of the Ji clan!”\u003c/p\u003e\n\u003cp\u003eNing stared at his father, at his father’s smile. His father rarely smiled, but the smile on his father’s face was a very relaxed one. Although Ning felt bitter pain in his heart, he didn’t try to dissuade his father.\u003c/p\u003e\n\u003cp\u003e…….\u003c/p\u003e\n\u003cp\u003eOf the six, five of the elders were preparing to do battle.\u003c/p\u003e\n\u003cp\u003e“I…” Just as Ning spoke out.\u003c/p\u003e\n\u003cp\u003eNinefire barked, “It’s one thing for us to go risk our lives, but you, Ji Ning! You are the hope of our Ji clan! Your talent is something which our clan has never given birth to before! You must continue to live!”\u003c/p\u003e\n\u003cp\u003e“Patriarch, I know what you mean.” Ning shook his head. “But I am not willing to hide and just watch as you risk your lives. I am not willing!”\u003c/p\u003e\n\u003cp\u003e“You…” Ninefire said, enraged.\u003c/p\u003e\n\u003cp\u003e“But Patriarch, don’t worry. I’m not a brash and mindless brute. If I see that the situation is unsalvageable, I will immediately leave and save my own life.” Ning looked at the Patriarch. “I have a Traceless Talisman. I imagine, Patriarch, you know how powerful the Traceless Talisman is. Once I activate it, I will instantly be able to travel to a distance of up to ten thousand kilometers.” Ever since his mother had died, his father had given the Traceless Talisman to Ning.\u003c/p\u003e\n\u003cp\u003eNinefire was stunned.\u003c/p\u003e\n\u003cp\u003eThe Traceless Talisman? Of course he knew that the Ji clan of the West Prefecture had this treasure. He had once desired it, but the Ji clan had its rules which no one could violate.\u003c/p\u003e\n\u003cp\u003e“Since that’s the case.” Ninefire nodded. “Fine. You can come along with us. But if the situation grows unsalvageable, you must immediately leave.”\u003c/p\u003e\n\u003cp\u003eAnd thus, right here, within the desolate mountain forest filled with the fog of the bewildering formation, the six members of the Ji clan made their decision. Together, they would battle against Snowdragon Mountain.\u003c/p\u003e\n\u003cp\u003e“There are only six of us.” Ninefire was actually filled with a boundless martial spirit. “As for Snowdragon Mountain, after their Swallow Mountain branch suffered such a loss, they will definitely invite some of their fellow disciples from the surrounding branches to come. By then, an entire group of Zifu Disciples will attack us en masse, and perhaps even a Wanxiang Adept might come as well! Fighting them head on is idiocy. What we need to do is to delay. Thus, we must set up multiple layers of formations.”\u003c/p\u003e\n\u003cp\u003e“Right. Formations. Patriarch, you are the most skilled amongst us in formations.” Truekeep was filled with anticipation as well.”\u003c/p\u003e\n\u003cp\u003e“I will set up multiple layers of large formations.” Ninefire looked towards the other five. “Leave the formation setting to me. What the rest of you need to do is come up with ideas to improve your own fighting abilities, such as perhaps using some of the supreme guardian treasures of your respective prefectures…”\u003c/p\u003e\n\u003cp\u003eEveryone nodded.\u003c/p\u003e\n\u003cp\u003e“Also!”\u003c/p\u003e\n\u003cp\u003eNinefire lowered his head, looking into the ground. “Beneath this desolate wilderness, in an area with a circumference of thousands of kilometers, there lies hidden an enormous elemental ore mine! But the strange thing is, prior to this, nobody had ever discovered it. The vein is very close to the surface, yet nobody discovered it. In addition, previously, there had been such a powerful, forceful elemental energy wave.”\u003c/p\u003e\n\u003cp\u003e“Right.” Ning nodded as well.\u003c/p\u003e\n\u003cp\u003eIndeed. It had been the elemental energy ripple that had attracted their attention to this place. It was very bizarre.\u003c/p\u003e\n\u003cp\u003e“Perhaps a strange, incredible treasure has just entered the world.” Ninefire said. “The elemental energy ripple that came prior to this could have been created by the emergence of this unique treasure, which might have caused the surrounding area to transform into an elemental ore mine.”\u003c/p\u003e\n\u003cp\u003e“Or perhaps an Immortal was training here. When Immortals train, the amount of elemental energy they consume is as vast as an ocean.” Ninefire sighed. “If they train for a long period of time, an elemental ore mine will naturally form.”\u003c/p\u003e\n\u003cp\u003eGranny Shadow frowned. “Elder Brother, are you saying…?”\u003c/p\u003e\n\u003cp\u003eNing and the others all looked at Ninefire.\u003c/p\u003e\n\u003cp\u003e“I am guessing.” Ninefire’s eyes held a hint of desire. “That this elemental ore mine must have a secret behind its origins. Perhaps it has some treasures within, or some precious items left behind by an Immortal! Even items casually discarded by an Immortal…are enough to allow our Ji clan’s power to increase greatly.”\u003c/p\u003e\n\u003cp\u003e“Patriarch, are you suggesting…?” Truekeep grew excited as well.\u003c/p\u003e\n\u003cp\u003e“Treasures?” Yichuan and the others all stared towards the ground.\u003c/p\u003e\n\u003cp\u003eNinefire nodded. “Let’s dig into the ground and do an investigation. Perhaps we might find something.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eEach of them felt that the words of the Patriarch were reasonable. That elemental energy ripple from earlier had indeed been bizarre, and it was also strange that this elemental ore mine had never been discovered. Perhaps some treasure was hidden within.\u003c/p\u003e\n\u003cp\u003e“Ji Ning.” Ninefire looked at Ning. “That protective lotus technique of yours seems to dig very quickly. It’ll be up to you. We’ll follow from behind you.”\u003c/p\u003e\n\u003cp\u003eNing nodded. “Fine. I’ll begin, then.”\u003c/p\u003e\n\u003cp\u003e……..\u003c/p\u003e\n\u003cp\u003eRumblerumblerumble…\u003c/p\u003e\n\u003cp\u003eNing controlled his Waterflame Lotus, making it swivel through the ground, constantly digging deeper into it. Those elemental stones were easily broken through, carving out a tunnel. Ning moved quickly and constantly, digging deeper and deeper, while Ninefire and the rest of the five were behind him.\u003c/p\u003e\n\u003cp\u003e“His speed is so fast.” Truekeep sighed in amazement, following from behind.\u003c/p\u003e\n\u003cp\u003e“When we started digging, we were fast as well, but after exhausting a large amount of our Ki, we had to begin to slow down. But Ji Ning is completely relying on borrowing the power of nature.” Ninefire had already been able to see through Ning’s Waterflame Lotus, and that it was formed from natural power.\u003c/p\u003e\n\u003cp\u003eThey continued to go deeper.\u003c/p\u003e\n\u003cp\u003e“Ji Ning, wherever the quality of the elemental ore is the finest, that is where you should dig.” Ninefire said. “If there are any treasures present, they should be located at wherever the elemental energy is the strongest.”\u003c/p\u003e\n\u003cp\u003eNing nodded.\u003c/p\u003e\n\u003cp\u003eHe had noticed as well…that different areas had different quality elemental stones. Some places only had low-grade elemental stones, while other places had quite a bit of high-grade elemental stones.\u003c/p\u003e\n\u003cp\u003e“Rumblerumblerumble…” The Waterflame Lotus drilled down, like a giant dragon swimming through the underground ore deposit, constantly boring in the direction of high-grade stones.\u003c/p\u003e\n\u003cp\u003eAfter an hour…\u003c/p\u003e\n\u003cp\u003e“The majority of stones here are high-grade stones. You can pick them out with ease.”\u003c/p\u003e\n\u003cp\u003e“This is a precious location.”\u003c/p\u003e\n\u003cp\u003e“So many high-grade elemental stones.”\u003c/p\u003e\n\u003cp\u003eAlthough they knew all along that this was a rich vein, they hadn’t imagined that this elemental ore mine would actually have a location within it with such an abundance of high-grade elemental stones.\u003c/p\u003e\n\u003cp\u003e“Bang!” Suddenly, an explosive sound.\u003c/p\u003e\n\u003cp\u003eNing came to a sudden halt, causing Ninefire and the other four behind Ning to come to a startled halt as well.\u003c/p\u003e\n\u003cp\u003e“What is it?” Ninefire asked hurriedly.\u003c/p\u003e\n\u003cp\u003e“In front of me, there is a very tough, unyielding stone. My Waterflame Lotus is actually unable to drill through.” Ning said, puzzled. The power of his Waterflame Lotus was now tremendous, and generally speaking, even forged weapons would be shattered by it, to say nothing of rocks. “It really is strange.”\u003c/p\u003e\n\u003cp\u003eRumblerumblerumble…\u003c/p\u003e\n\u003cp\u003eThe Waterflame Lotus quickly swept away the nearby stones, allowing Ning to get a good luck at what was in front of him; a very flat, rocky surface.\u003c/p\u003e\n\u003cp\u003e“This is…?” Ning was puzzled. Ninefire, Yichuan, and the others were puzzled as well.\u003c/p\u003e\n\u003cp\u003eNing continued to control his Waterflame Lotus to scatter aside the surrounding elemental stones…and soon, what appeared before their eyes was part of an enormous stone room, with a door in front of it.\u003c/p\u003e\n\u003cp\u003e“This…this…”\u003c/p\u003e\n\u003cp\u003e“This is a stone room! Manmade! Even Ji Ning’s Waterflame Lotus is unable to break through it. This is no ordinary stone room; it must have been left behind by an Immortal.”\u003c/p\u003e\n\u003cp\u003eThe members of the Ji clan all revealed looks of wild joy on their faces.\u003c/p\u003e\n\u003cp\u003eDeep within the ground, more than a hundred kilometers down, in the heart of this elemental ore mine, they had discovered a stone room. Who amongst them would believe that it was a common room?\u003c/p\u003e\n\u003cp\u003e“Ji Ning, don’t go too close. Beware of restrictive spells.” Ninefire said. “Keep away from it, and control your magic treasures to open the stone door at a distance.”\u003c/p\u003e\n\u003cp\u003e“Right.” Ning nodded.\u003c/p\u003e\n\u003cp\u003eAll of them hurriedly retreated, while Ning directly controlled a sword-type magic treasure, sending it flying outwards and pushing at the stone door. Rumble…the stone door slowly turned, revealing an entrance. Instantly, an incomparably thick surge of elemental essence spurted out from within that stone room, causing Ning and the rest of them to feel incredibly comfortable.\u003c/p\u003e\n\u003cp\u003e“There must be Immortal treasures within.” Ninefire called out frantically.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-5-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/desolate-era/de-book-5-chapter-25\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-5-chapter-24","bookId":1501,"creation":"Sep 10, 2019 4:16:12 AM","modification":"Sep 10, 2019 4:16:12 AM"}
