{"id":111355,"no":15,"title":"Page 15","content":"\u003cp\u003eThe next morning, I woke as someone shook my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Go away,\" I murmured. But the shaking was insistent.\u003c/p\u003e\n\u003cp\u003eMy eyes snapped open, and I realized I was lying curled up next to one of the tents at Gallaghers freak show.\u003c/p\u003e\n\u003cp\u003e\"Did you sleep here?\" Callie asked, crossing her arms over her chest. I sat up, rubbing the sleep from my eyes, thinking about the previous evening. Id returned to the circus grounds, unsure of where else to go and had fallen asleep there.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Miss Callie,\" I said, ignoring her question. I stood up and brushed dirt off the back of my pants. \"How can I help you?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. She was clad in a pink cotton dress that showed her tiny waist and freckled arms. The color stood in contrast to her flowing red hair, and she reminded me of a wild rose. \"Were going to take a few days off from the show. Father made so much money, he wants the next event to be even bigger.\" Callie smiled. \"The first rule of show business: Keep em wanting more.\"\u003c/p\u003e\n\u003cp\u003e\"Hows Da--the vampire?\" I asked, shielding my eyes from the sun. While my ring protected me from the agony of the rays, the sun made me feel exposed and clumsy. The dark cloaked more than my fangs, and in the light of day, I constantly had to check to make sure I wasnt moving at lightning speed, responding to questions I shouldnt be able to hear, or following my urge to feed.\u003c/p\u003e\n\u003cp\u003eCallie tucked a loose strand of rust-colored hair behind her ear. \"The vampire is okay, I suppose. Father has its handlers tending to it around the clock. They dont want it to die. Not yet, anyway.\" Not yetwas a small comfort, but it was something. It meant I still had time.\u003c/p\u003e\n\u003cp\u003eShe frowned slightly. \"Of course, I hardly think they should let it die at all. What were doing to it, and to the animals it fights, is totally barbaric,\" she said softly, almost speaking to herself.\u003c/p\u003e\n\u003cp\u003eI looked up swiftly at the words. Was she more sympathetic to Damons plight than Id imagined? \"Can I see him?\" I asked, surprised at my boldness.\u003c/p\u003e\n\u003cp\u003eCallie swatted my arm. \"No! Not unless you pay up, like everyone else. Besides, hes not here.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said, mocking me. Then her eyes softened. \"I still cant believe you slept here. Dont you have a home?\"\u003c/p\u003e\n\u003cp\u003eI met her gaze straight on. \"I had a disagreement with my family.\" It wasnt exactly a lie.\u003c/p\u003e\n\u003cp\u003eThe freak show was starting to wake up. The strong man walked, bleary-eyed, out of a tent. Abruptly, he dropped down to the ground and began doing push-ups. The fortune-teller headed to the secluded part of the lake, towel in hand, no doubt for a bath. And two of the ever-present burly security men were watching Callie and me curiously.\u003c/p\u003e\n\u003cp\u003eCallie clearly noticed as well. \"Would you like to go for a walk?\" she asked, leading the way down a dirt-packed road to the edge of the lake, out of sight of the show. She picked up a stone and threw it into the water, where it landed with a thunk.\u003c/p\u003e\n\u003cp\u003e\"I never could skip stones,\" she said, in such a sad voice that I couldnt help but burst out laughing.\u003c/p\u003e\n\u003cp\u003e\"Whats so funny?\" she asked, hitting my arm again. The swat was playful, but the bracelets she wore were twisted through with vervain, and the contact sent a wave of pain up my arm. She put her hand on my shoulder, concern creasing her forehead. \"Are you okay?\"\u003c/p\u003e\n\u003cp\u003eI winced. \"Yes,\" I lied.\u003c/p\u003e\n\u003cp\u003e\"Okay . . .\" she said, throwing me a skeptical look. She leaned down to pick up another stone and raised her light brown eyebrow at me before she threw it in the water. It fell with a harmless plop.\u003c/p\u003e\n\u003cp\u003e\"Tragic!\" I picked up my own stone and aimed it across the water. It skipped five times before falling below the surface.\u003c/p\u003e\n\u003cp\u003eCallie laughed and clapped her hands. \"You must teach me!\"\u003c/p\u003e\n\u003cp\u003e\"You have to flick your wrist. And pick a flat stone.\" I spotted a smooth brown rock with a white band ringing the top. \"Here.\" I put the rock in her hands. \"Now, flick,\" I said, gingerly touching her skin, making sure my fingers didnt brush against the vervain.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and tossed the stone, which skipped once, before falling into the water. She threw her arms up in delight. \"Thank you, Stefan,\" she said, her eyes twinkling.\u003c/p\u003e\n\u003cp\u003e\"No more ,,stranger?\" I teased.\u003c/p\u003e\n\u003cp\u003e\"Youve taught me something. That means were friends.\"\u003c/p\u003e\n\u003cp\u003e\"Does it, now?\" I said, taking another stone and tossing it in the water. Damon and I had skipped stones in the pond near our home in Mystic Falls. Wed make wishes and pretend that they would come true if we could guess the number of skips a stone would make.\u003c/p\u003e\n\u003cp\u003eI closed my eyes briefly.If it skips five times, I\u0027ll have a chance to free Damon, I thought. But this stone was heavier and sank after two skips. I shook my head, annoyed at myself for indulging in such a childish game. \"So was that your biggest concern in the world? That you couldnt skip stones?\" I teased, trying to reclaim the light tone of our outing.\u003c/p\u003e\n\u003cp\u003eShe smiled, but her eyes looked sad. \"No. But dont you think pretend problems are much more manageable than real ones?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I do,\" I said quietly.\u003c/p\u003e\n\u003cp\u003eThe sun was steadily rising, lending the lake an orange glow. Several small skiffs were already on the water, casting their nets, and the wind whipped around our ears, a reminder that even though the sun felt warm, winter was well on its way.\u003c/p\u003e\n\u003cp\u003e\"Ive never talked to anyone about this. Thats rule number two of the Gallagher family business--dont trust anyone,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Your father seems tough,\" I ventured, sensing her frustration. \"Perhaps too tough?\"\u003c/p\u003e\n\u003cp\u003e\"My father is fine,\" Callie snapped. She scowled at me, hands on her hips.\u003c/p\u003e\n\u003cp\u003e\"Im sorry,\" I said, raising my hands in surrender. I realized Id pushed too far too quickly. \"That was out of line.\"\u003c/p\u003e\n\u003cp\u003eCallie let her hands fall to her sides. \"No, Im sorry. Im just protective of him. Hes all I have.\"\u003c/p\u003e\n\u003cp\u003e\"Where is your mother?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Died when I was six,\" Callie said simply.\u003c/p\u003e\n\u003cp\u003e\"I understand,\" I said, thinking of my own mother. \"Its hard, isnt it?\"\u003c/p\u003e\n\u003cp\u003eCallie plucked a blade of grass from the ground and shredded it between her fingernails. \"I try to be strong. But after Mother died, Father threw himself into work.\"\u003c/p\u003e\n\u003cp\u003e\"It seems that you do that as well.\"\u003c/p\u003e\n\u003cp\u003e\"Now that Fathers got the vampire act worked out, I feel like things will change for the better. He has a short fuse that gets shorter the less money he has.\"\u003c/p\u003e\n\u003cp\u003eAt the mention of the vampire act, I kicked the stones around the edge of the shore. A flurry of pebbles flew through the air and landed several meters into the lake with a violent splashing sound.\u003c/p\u003e\n\u003cp\u003e\"What was that?\" Callie asked, alarm in her voice.\u003c/p\u003e\n\u003cp\u003eI forced myself to smile, to look calm--human. In my anger, Id forgotten to hide my Power. \"Advanced stone skipping.\"\u003c/p\u003e\n\u003cp\u003eCallie raised an eyebrow, as if she wanted to challenge me. But all she said was: \"We should get back. Dad wants us to clean up the grounds.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Good idea.\" Alone here with Callie, Id come so close to losing control.\u003c/p\u003e\n\u003cp\u003e\"Stefan,\" Callie said. \"I was thinking since we dont have the shows for a few nights, do you think you could show me the city?\"\u003c/p\u003e\n\u003cp\u003e\"But I dont know the city,\" I pointed out. \"Youve been here longer than I have.\"\u003c/p\u003e\n\u003cp\u003eCallies cheeks flushed poppy red. \"Father doesnt let me leave the house, unless its for work. But there are so many shows and adventures in New Orleans.\" She looked up at me from beneath her long lashes. \"Please? Ill feel safe if Im with you.\"\u003c/p\u003e\n\u003cp\u003eI nearly laughed at the irony of that statement, but the chuckle caught in my throat. Callie had it wrong: She wouldnt necessarily be safe with me, but I could use her to guarantee the safety of my brother. After all, she knew everything about Gallaghers Circus--including where her father was holding Damon.\u003c/p\u003e\n\u003cp\u003e\"Okay, lets do it,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Oh, well have such fun!\" Callie clasped my hands and whirled me around. \"Meet me at the park at the end of my street at nine oclock.\" She rose onto her tiptoes and kissed my cheek. She was so close, I could practically feel her heart beating against my chest. I pulled away abruptly, my head pounding and my jaw aching. I turned my back to her as my canines extended with a click. I had to take five deep breaths before they retracted again.\u003c/p\u003e\n\u003cp\u003e\"Are you okay?\" she asked, placing her hand on my shoulder.\u003c/p\u003e\n\u003cp\u003eI plastered a smile on my face and turned back to her. \"Just excited for tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" Callie said, humming to herself as we walked back to the circus grounds.\u003c/p\u003e\n\u003cp\u003eI ran my tongue over my teeth. It was true: I was excited for tonight. But excitement was akin to desire, and as Id been learning ever since I met Katherine, nothing good ever came from desire. \u003c/p\u003e","sourceLink":"https://allnovel.net/stefan-s-diaries-bloodlust-the-vampire-diaries-2/page-15.html","bookId":2069,"creation":"Oct 6, 2019 12:22:20 AM","modification":"Oct 6, 2019 12:22:20 AM"}
