{"id":14883,"no":4,"title":"RUPERT BROOKE","content":"\u0026nbsp;Rupert Brooke had the oldest pith of England in his fibre. He was born of East Anglia, the original vein of English blood. Ruddy skin, golden-brown hair, blue eyes, are the stamp of the Angles. Walsingham, in Norfolk, was the home of the family. His father was a master at Rugby; his grandfather a canon in the church. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In 1913 Heffer, the well-known bookseller and publisher of Cambridge, England, issued a little anthology called Cambridge Poems 1900-1913. This volume was my first introduction to Brooke. As an undergraduate at Oxford during the years 1910-13 I had heard of his work from time to time; but I think we youngsters at Oxford were too absorbed in our own small versemakings to watch very carefully what the \"Tabs\" were doing. His poem The Old Vicarage, Grantchester, reprinted in Heffer\u0027s Cambridge Poems, first fell under my eye during the winter of 1913-14.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Grantchester is a tiny hamlet just outside Cambridge; set in the meadows along the Cam or Granta (the earlier name), and next door to the Trumpington of Chaucer\u0027s \"The Reeve\u0027s Tale.\" All that Cambridge country is flat and comparatively uninteresting; patchworked with chalky fields bright with poppies; slow, shallow streams drifting between pollard willows; it is the beginning of the fen district, and from the brow of the Royston downs (thirteen miles away) it lies as level as a table-top with the great chapel of King\u0027s clear against the sky. It is the favourite lament of Cambridge men that their \"Umgebung\" is so dull and monotonous compared with the rolling witchery of Oxfordshire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to the young Cantab sitting over his beer at the Café des Westens in Berlin, the Cambridge villages seemed precious and fair indeed. Balancing between genuine homesickness for the green pools of the Cam, and a humorous whim in his rhymed comment on the outlying villages, Brooke wrote the Grantchester poem; and probably when the fleeting pang of nostalgia was over enjoyed the evening in Berlin hugely. But the verses are more than of merely passing interest. To one who knows that neighbourhood the picture is cannily vivid. To me it brings back with painful intensity the white winding road from Cambridge to Royston which I have bicycled hundreds of tunes. One sees the little inns along the way—the Waggon and Horses, the Plough, the King\u0027s Arms—and the recurring blue signboard Fine Royston Ales (the Royston brewery being famous in those parts). Behind the fun there shines Brooke\u0027s passionate devotion to the soil and soul of England which was to reach its final expression so tragically soon. And even behind this the immortal questions of youth which have no country and no clime—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Say, is there Beauty yet to find?\n\u003c/div\u003e \n\u003cdiv\u003e\n And Certainty? and Quiet kind?\n\u003c/div\u003e \n\u003cdiv\u003e\n No lover of England, certainly no lover of Cambridge, is likely to forget the Grantchester poem. But knowing Brooke only by that, one may perhaps be excused for having merely ticketed him as one of the score of young varsity poets whom Oxford and Cambridge had graduated in the past decade and who are all doing fine and promising work. Even though he tarried here in the United States (\"El Cuspidorado,\" as he wittily observed) and many hold precious the memory of his vivid mind and flashing face, to most of us he was totally unknown. Then came the War; he took part in the unsuccessful Antwerp Expedition; and while in training for the ?gean campaign he wrote the five sonnets entitled \"1914\". I do not know exactly when they were written or where first published. Their great popularity began when the Dean of St. Paul\u0027s quoted from them in a sermon on Easter Day, 1915, alluding to them as the finest expression of the English spirit that the War had called forth. They came to New York in the shape of clippings from the London Times. No one could read the matchless sonnet:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I should die, think only this of me:\n\u003c/div\u003e \n\u003cdiv\u003e\n That there\u0027s some corner of a foreign field\n\u003c/div\u003e \n\u003cdiv\u003e\n That is for ever England.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n and not be thrilled to the quick. A country doctor in Ohio to whom I sent a copy of the sonnet wrote \"I cannot read it without tears.\" This was poetry indeed; like the Scotchman and his house, we kent it by the biggin o\u0027t. I suppose many another stranger must have done as I did: wrote to Brooke to express gratitude for the perfect words. But he had sailed for the Mediterranean long before. Presently came a letter from London saying that he had died on the very day of my letter—April 23, 1915. He died on board the French hospital ship Duguay-Trouin, on Shakespeare\u0027s birthday, in his 28th year. One gathers from the log of the hospital-ship that the cause of his death was a malignant ulcer, due to the sting of some venomous fly. He had been weakened by a previous touch of sunstroke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A description of the burial is given in \"Memorials of Old Rugbeians Who Fell in the Great War.\" It vividly recalls Stevenson\u0027s last journey to the Samoan mountain top which Brooke himself had so recently visited. The account was written by one of Brooke\u0027s comrades, who has since been killed in action:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We found a most lovely place for his grave, about a mile up the valley from the sea, an olive grove above a watercourse, dry now, but torrential in winter. Two mountains flank it on either side, and Mount Khokilas is at its head. We chose a place in the most lovely grove I have ever seen, or imagined, a little glade of about a dozen trees, carpeted with mauve-flowering sage. Over its head droops an olive tree, and round it is a little space clear of all undergrowth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About a quarter past nine the funeral party arrived and made their way up the steep, narrow, and rocky path that leads to the grave. The way was so rough and uncertain that we had to have men with lamps every twenty yards to guide the bearers. He was borne by petty officers of his own company, and so slowly did they go that it was not till nearly eleven that they reached the grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We buried him by cloudy moonlight. He wore his uniform, and on the coffin were his helmet, belt, and pistol (he had no sword). We lined the grave with flowers and olive, and Colonel Quilter laid an olive wreath on the coffin. The chaplain who saw him in the afternoon read the service very simply. The firing party fired three volleys and the bugles sounded the \"Last Post.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so we laid him to rest in that lovely valley, his head towards those mountains that he would have loved to know, and his feet towards the sea. He once said in chance talk that he would like to be buried in a Greek island. He could have no lovelier one than Skyros, and no quieter resting place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On his grave we heaped great blocks of white marble; the men of his company made a great wooden cross for his head, with his name upon it, and his platoon put a smaller one at his feet. On the back of the large cross our interpreter wrote in Greek.... \"Here lies the servant of God, sub-lieutenant in the English navy, who died for the deliverance of Constantinople from the Turks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning we sailed, and had no chance of revisiting his grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is no mere flippancy to say that the War did much for Rupert Brooke. The boy who had written many hot, morbid, immature verses and a handful of perfect poetry, stands now by one swift translation in the golden cloudland of English letters. There will never, can never, be any laggard note in the praise of his work. And of a young poet dead one may say things that would be too fulsome for life. Professor Gilbert Murray is quoted:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Among all who have been poets and died young, it is hard to think of one who, both in life and death, has so typified the ideal radiance of youth and poetry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the grave among the olive trees on the island of Skyros, Brooke found at least one Certainty—that of being \"among the English poets.\" He would probably be the last to ask a more high-sounding epitaph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His \"Collected Poems\" as published consist of eighty-two pieces, fifty of which were published in his first book, issued (in England only) in 1911. That is to say fifty of the poems were written before the age of 24, and seventeen of the fifty before 21. These last are thoroughly youthful in formula. We all go through the old familiar cycle, and Brooke did not take his youth at second hand. Socialism, vegetarianism, bathing by moonlight in the Cam, sleeping out of doors, walking barefoot on the crisp English turf, channel crossings and what not—it is all a part of the grand game. We can only ask that the man really see what he says he sees, and report it with what grace he can muster.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so of the seventeen earliest poems there need not be fulsome praise. Few of us are immortal poets by twenty-one. But even Brooke\u0027s undergraduate verses refused to fall entirely into the usual grooves of sophomore song. So unerring a critic as Professor Woodberry (his introduction to the \"Collected Poems\" is so good that lesser hands may well pause) finds in them \"more of the intoxication of the god\" than in the later rounder work. They include the dreaming tenderness of Day That I Have Loved; they include such neat little pictures of the gross and sordid as the two poems Wagner and Dawn, written on a trip in Germany. (It is curious that the only note of exasperation in Brooke\u0027s poems occurs when he writes from Germany. One finds it again, wittily put, in Grantchester.)\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This vein of brutality and resolute ugliness that one finds here and there in Brooke\u0027s work is not wholly amiss nor unintelligible. Like all young men of quick blood he seized gaily upon the earthy basis of our humanity and found in it food for purging laughter. There was never a young poet worth bread and salt who did not scrawl ribald verses in his day; we may surmise that Brooke\u0027s peers at King\u0027s would recall many vigorous stanzas that are not included in the volume at hand. The few touches that we have in this vein show a masculine fear on Brooke\u0027s part of being merely pretty in his verse. In his young thirst for reality he did not boggle at coarse figures or loathsome metaphors. Just as his poems of 1905-08 are of the cliché period where all lips are \"scarlet,\" and lamps are \"relumed,\" so the section dated 1908-11 shows Brooke in the Shropshire Lad stage, at the mercy of extravagant sex images, and yet developing into the dramatic felicity of his sonnet The Hill:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Breathless, we flung us on the windy hill,\n\u003c/div\u003e \n\u003cdiv\u003e\n Laughed in the sun, and kissed the lovely grass,\n\u003c/div\u003e \n\u003cdiv\u003e\n You said, \"Through glory and ecstasy we pass;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wind, sun, and earth remain, the birds sing still,\n\u003c/div\u003e \n\u003cdiv\u003e\n When we are old, are old....\" \"And when we die\n\u003c/div\u003e \n\u003cdiv\u003e\n All\u0027s over that is ours; and life burns on\n\u003c/div\u003e \n\u003cdiv\u003e\n Through other lovers, other lips,\" said I,\n\u003c/div\u003e \n\u003cdiv\u003e\n —\"Heart of my heart, our heaven is now, is won!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are Earth\u0027s best, that learnt her lesson here.\n\u003c/div\u003e \n\u003cdiv\u003e\n Life is our cry. We have kept the faith!\" we said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We shall go down with unreluctant tread\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose-crowned into the darkness!\" ... Proud we were\n\u003c/div\u003e \n\u003cdiv\u003e\n And laughed, that had such brave true things to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n —And then you suddenly cried, and turned away.\n\u003c/div\u003e \n\u003cdiv\u003e\n The true lover of poetry, it seems to me, cannot but wish that the \"1914\" sonnets and the most perfect of the later poems had been separately issued. The best of Brooke forms a thin sheaf of consummate beauty, and I imagine that the little edition of \"1914 and Other Poems,\" containing the thirty-two later poems, which was published in England and issued in Garden City by Doubleday, Page \u0026amp; Company in July, 1915, to save the American copy right, will always be more precious than the complete edition. As there were only twenty-five copies of this first American edition, it is extremely rare and will undoubtedly be sought after by collectors. But for one who is interested to trace the growth of Brooke\u0027s power, the steadying of his poetic orbit and the mounting flame of his joy in life, the poems of 1908-11 are an instructive study. From the perfected brutality of Jealousy or Menelaus and Helen or A Channel Passage (these bite like Meredith) we see him passing to sonnets that taste of Shakespeare and foretell his utter mastery of the form. What could better the wit and beauty of this song:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! Love,\" they said, \"is King of Kings,\n\u003c/div\u003e \n\u003cdiv\u003e\n And Triumph is his crown.\n\u003c/div\u003e \n\u003cdiv\u003e\n Earth fades in flame before his wings,\n\u003c/div\u003e \n\u003cdiv\u003e\n And Sun and Moon bow down.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But that, I knew, would never do;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Heaven is all too high.\n\u003c/div\u003e \n\u003cdiv\u003e\n So whenever I meet a Queen, I said,\n\u003c/div\u003e \n\u003cdiv\u003e\n I will not catch her eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! Love,\" they said, and \"Love,\" they said,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Gift of Love is this;\n\u003c/div\u003e \n\u003cdiv\u003e\n A crown of thorns about thy head,\n\u003c/div\u003e \n\u003cdiv\u003e\n And vinegar to thy kiss!\"—\n\u003c/div\u003e \n\u003cdiv\u003e\n But Tragedy is not for me;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I\u0027m content to be gay.\n\u003c/div\u003e \n\u003cdiv\u003e\n So whenever I spied a Tragic Lady,\n\u003c/div\u003e \n\u003cdiv\u003e\n I went another way.\n\u003c/div\u003e \n\u003cdiv\u003e\n And so I never feared to see\n\u003c/div\u003e \n\u003cdiv\u003e\n You wander down the street,\n\u003c/div\u003e \n\u003cdiv\u003e\n Or come across the fields to me\n\u003c/div\u003e \n\u003cdiv\u003e\n On ordinary feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n For what they\u0027d never told me of,\n\u003c/div\u003e \n\u003cdiv\u003e\n And what I never knew;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was that all the time, my love,\n\u003c/div\u003e \n\u003cdiv\u003e\n Love would be merely you.\n\u003c/div\u003e \n\u003cdiv\u003e\n We come then to the five sonnets inspired by the War. Let us be sparing of clumsy comment. They are the living heart of young England; the throbbing soul of all that gracious manhood torn from its happy quest of Beauty and Certainty, flung unheated into the absurdities of War, and yet finding in this supreme sacrifice an answer to all its pangs of doubt. All the hot yearnings of \"1905-08\" and \"1908-11\" are gone; here is no Shropshire Lad enlisting for spite, but a joyous surrender to England of all that she had given. See his favourite metaphor (that of the swimmer) recur—what pictures it brings of \"Parson\u0027s Pleasure\" on the Cher and the willowy bathing pool on the Cam. How one recalls those white Greek bodies against the green!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, God be thanked who has matched us with His hour,\n\u003c/div\u003e \n\u003cdiv\u003e\n And caught our youth, and wakened us from sleeping,\n\u003c/div\u003e \n\u003cdiv\u003e\n With hand made sure, clear eye, and sharpened power,\n\u003c/div\u003e \n\u003cdiv\u003e\n To turn, as swimmers into cleanness leaping.\n\u003c/div\u003e \n\u003cdiv\u003e\n To those who tell us England is grown old and fat and soft, there is the answer. It is no hymn of hate that England\u0027s youth has sung, but the farewell of those who, loving life with infinite zest, have yet found in surrendering it to her the Beauty, the Certainty, yes and the Quiet, which they had sought. On those five pages are packed in simple words all the love of life, the love of woman, the love of England that make Brooke\u0027s memory sweet. Never did the sonnet speak to finer purpose. \"In his hands the thing became a trumpet\"—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n THE DEAD\n\u003c/div\u003e \n\u003cdiv\u003e\n Blow out, you bugles, over the rich Dead!\n\u003c/div\u003e \n\u003cdiv\u003e\n There\u0027s none of these so lonely and poor of old,\n\u003c/div\u003e \n\u003cdiv\u003e\n But, dying, has made us rarer gifts than gold.\n\u003c/div\u003e \n\u003cdiv\u003e\n These laid the world away; poured out the red\n\u003c/div\u003e \n\u003cdiv\u003e\n Sweet wine of youth; gave up the years to be\n\u003c/div\u003e \n\u003cdiv\u003e\n Of work and joy, and that unhoped serene,\n\u003c/div\u003e \n\u003cdiv\u003e\n That men call age; and those who would have been,\n\u003c/div\u003e \n\u003cdiv\u003e\n Their sons, they gave, their immortality.\n\u003c/div\u003e \n\u003cdiv\u003e\n Blow, bugles, blow! They brought us, for our dearth\n\u003c/div\u003e \n\u003cdiv\u003e\n Holiness, lacked so long, and Love, and Pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Honour has come back, as a King, to earth,\n\u003c/div\u003e \n\u003cdiv\u003e\n And paid his subjects with a royal wage;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Nobleness walks in our ways again;\n\u003c/div\u003e \n\u003cdiv\u003e\n And we have come into our heritage.\n\u003c/div\u003e \n\u003cdiv\u003e\n It would be misleading, perhaps, to leave Brooke\u0027s poetry with the echo of this solemn note. No understanding of the man would be complete without mentioning the vehement gladness and merriment he found in all the commonplaces of life. Poignant to all cherishers of the precious details of existence must be his poem The Great Lover where he catalogues a sort of trade order list of his stock in life. The lines speak with the very accent of Keats. These are some of the things he holds dear—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n White plates and cups, clean-gleaming,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ringed with blue lines; and feathery, faery dust;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wet roofs, beneath the lamp-light; the strong crust\n\u003c/div\u003e \n\u003cdiv\u003e\n Of friendly bread; and many tasting food;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rainbows; and the blue bitter smoke of wood;\n\u003c/div\u003e \n\u003cdiv\u003e\n And radiant raindrops couching in cool flowers;\n\u003c/div\u003e \n\u003cdiv\u003e\n And flowers themselves, that sway through sunny hours,\n\u003c/div\u003e \n\u003cdiv\u003e\n Dreaming of moths that drink them under the moon;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, the cool kindliness of sheets, that soon\n\u003c/div\u003e \n\u003cdiv\u003e\n Smoothe away trouble; and the rough male kiss\n\u003c/div\u003e \n\u003cdiv\u003e\n Of blankets; grainy wood; live hair that is\n\u003c/div\u003e \n\u003cdiv\u003e\n Shining and free; blue-massing clouds; the keen\n\u003c/div\u003e \n\u003cdiv\u003e\n Unpassioned beauty of a great machine;\n\u003c/div\u003e \n\u003cdiv\u003e\n The benison of hot water; furs to touch;\n\u003c/div\u003e \n\u003cdiv\u003e\n The good smell of old clothes; and other such—\n\u003c/div\u003e \n\u003cdiv\u003e\n ...All these have been my loves.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of his humour only those who knew him personally have a right to speak; but where does one find a more perfect bit of gentle satire than Heaven where he gives us a Tennysonian fish pondering the problem of a future life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This life cannot be All, they swear,\n\u003c/div\u003e \n\u003cdiv\u003e\n For how unpleasant, if it were!\n\u003c/div\u003e \n\u003cdiv\u003e\n One may not doubt that, somehow, Good\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall come of Water and of Mud;\n\u003c/div\u003e \n\u003cdiv\u003e\n And, sure, the reverent eye must see\n\u003c/div\u003e \n\u003cdiv\u003e\n A Purpose in Liquidity.\n\u003c/div\u003e \n\u003cdiv\u003e\n We darkly know, by Faith we cry\n\u003c/div\u003e \n\u003cdiv\u003e\n The future is not Wholly Dry....\n\u003c/div\u003e \n\u003cdiv\u003e\n But somewhere, beyond Space and Time,\n\u003c/div\u003e \n\u003cdiv\u003e\n Is wetter water, slimier slime!\n\u003c/div\u003e \n\u003cdiv\u003e\n No future anthology of English wit can be complete without that exquisite bit of fooling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of such a sort, to use Mr. Mosher\u0027s phrase, was Rupert Chawner Brooke, \"the latest and greatest of young Englishmen.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3203/87503.html","bookId":760,"creation":"Aug 2, 2019 6:33:30 AM","modification":"Aug 2, 2019 6:33:30 AM"}
