{"id":68263,"no":11,"title":"Page 11","content":"\u003cp\u003e“My girls should be here around six.”\u003c/p\u003e\n\u003cp\u003e“You’re going straight to church after dinner?”\u003c/p\u003e\n\u003cp\u003e“That’s the plan,” Grace told her. “I was going to invite Mary Jo to join us.”\u003c/p\u003e\n\u003cp\u003e“For dinner or Christmas Eve service?”\u003c/p\u003e\n\u003cp\u003e“Both, actually, but I’m having second thoughts.” Grace hesitated.\u003c/p\u003e\n\u003cp\u003e“Why? And about what?”\u003c/p\u003e\n\u003cp\u003e“Oh, about inviting Mary Jo to dinner. I’m afraid it might be too much for her. We’ll have five grandkids running around. You know how much racket children can make, and double that for Christmas Eve.”\u003c/p\u003e\n\u003cp\u003e“Is there anything I can do for her?” Olivia asked.\u003c/p\u003e\n\u003cp\u003e“Should I ask her to have dinner here?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. I’ll talk to her when she wakes up and then I’ll phone you.”\u003c/p\u003e\n\u003cp\u003e“Thanks. And tell her not to worry about her brothers.”\u003c/p\u003e\n\u003cp\u003e“I’ll do that.”\u003c/p\u003e\n\u003cp\u003e“See you tonight.”\u003c/p\u003e\n\u003cp\u003e“Tonight,” Olivia echoed.\u003c/p\u003e\n\u003cp\u003eAfter setting down the phone, Olivia poured the tea and placed both mugs on the table, followed by the plate of cookies, and called Jack into the kitchen again.\u003c/p\u003e\n\u003cp\u003eHis eyes widened in overstated surprise. “Cookies? For me? You shouldn’t have.”\u003c/p\u003e\n\u003cp\u003e“I can still put them back.”\u003c/p\u003e\n\u003cp\u003e“Oh, no, you don’t.” He grabbed the star-shaped cookie and bit off one point. “What’s this in honor of?”\u003c/p\u003e\n\u003cp\u003e“I had pie with lunch. So I’m trying to be fair.”\u003c/p\u003e\n\u003cp\u003eKnowing her disciplined eating habits, Jack did a double-take. “You ate pie? At lunch?”\u003c/p\u003e\n\u003cp\u003e“Goldie made me do it.”\u003c/p\u003e\n\u003cp\u003e“Goldie,” he repeated. “You mean Will took you to the Pancake Palace?”\u003c/p\u003e\n\u003cp\u003e“It’s where I wanted to go.”\u003c/p\u003e\n\u003cp\u003eJack sat down, grabbed the tree cookie and bit into that, too. “You’re a cheap date.”\u003c/p\u003e\n\u003cp\u003e“Not necessarily.”\u003c/p\u003e\n\u003cp\u003eHe ignored that remark. “Did you enjoy lunch with Will?” he asked, then sipped his tea. Jack was familiar with their sometimes tumultuous relationship.\u003c/p\u003e\n\u003cp\u003e“I did, although I’m a little worried.” Olivia crossed her legs and held the mug in the palm of her hand. “He’s interested in Shirley Bliss, a local artist.”\u003c/p\u003e\n\u003cp\u003e“She’s not married, is she?”\u003c/p\u003e\n\u003cp\u003eOlivia shook her head. “A widow.”\u003c/p\u003e\n\u003cp\u003eJack shrugged. “Then it’s okay if he wants to see her.”\u003c/p\u003e\n\u003cp\u003e“I agree. It’s just that I don’t know if I can trust my brother. It pains me to admit that, but still…” She left the rest unsaid. Jack knew her brother and his flaws as well as she did. “I want him to be successful here,” she said earnestly. “He’s starting over, and at this stage of his life that can’t be easy.”\u003c/p\u003e\n\u003cp\u003e“I don’t imagine it will be,” Jack agreed. “By the way, who was that on the phone?”\u003c/p\u003e\n\u003cp\u003e“Grace. She called to update me on Mary Jo.”\u003c/p\u003e\n\u003cp\u003e“Problems?”\u003c/p\u003e\n\u003cp\u003e“Not really, but she said we need to keep an eye out for three irate brothers who might show up looking for her.”\u003c/p\u003e\n\u003cp\u003e“A vigilante posse?”\u003c/p\u003e\n\u003cp\u003e“Not exactly.” But now that Olivia thought about it, it might not be so bad if Mary Jo’s brothers stumbled onto David Rhodes instead. “If her brothers find anyone, it should be David.”\u003c/p\u003e\n\u003cp\u003e“There’d certainly be justice in that, but David’s not going to let himself be found. And I think we should be focusing on the young woman, don’t you?”\u003c/p\u003e\n\u003cp\u003eHis tone was gentle, but Olivia felt chastened. “Yes—and her baby.”\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eMary Jo woke feeling confused. She sat up in bed and gazed around at the sparsely decorated room before she remembered where she was. Grace Harding had brought her home and was letting her spend the night in this apartment above the barn. It was such a kind thing to do. She was a stranger, after all, a stranger with problems who’d appeared out of nowhere on Christmas Eve.\u003c/p\u003e\n\u003cp\u003eStretching her arms high above her head, Mary Jo yawned loudly. She was still tired, despite her nap. Her watch told her she’d been asleep for the better part of two hours. Two hours!\u003c/p\u003e\n\u003cp\u003eOther than in her first trimester, she hadn’t required a lot of extra rest during her pregnancy, but that had changed in the past few weeks. Of course some of it could be attributed to David and his lies. Wondering what she should believe and whether he’d meant any of what he’d said had kept her awake many a night. Consequently she was tired during the day; while she was still working she’d nap during her lunch break.\u003c/p\u003e\n\u003cp\u003eForcing her eyes shut, Mary Jo made an effort to cast David from her mind. She quickly gave up. Tossing aside the covers, Mary Jo climbed out of bed, put on her shoes and left the apartment. The stairway led to the interior of the barn.\u003c/p\u003e\n\u003cp\u003eAs soon as she stepped into the barn, several animals stuck their heads out of the stalls to study her curiously. The first she saw was a lovely horse. Grace had introduced her as Funny Face.\u003c/p\u003e\n\u003cp\u003e“Hello there, girl.” Mary Jo walked slowly toward the stall door. “Remember me?” The mare nodded in what seemed to be an encouraging manner, and Mary Jo ran her hand down the horse’s unusually marked face. The mare had a white ring around one eye and it was easy to see why the Hardings had named her Funny Face. Her dark, intelligent eyes made Mary Jo think of an old story she recalled from childhood—that animals can talk for a few hours after midnight on Christmas Eve—and she wondered what Funny Face would say. Probably something very wise.\u003c/p\u003e\n\u003cp\u003eThe camel seemed curious, too, and thrust her long curved neck out of the stall, peering at Mary Jo through wide eyes, fringed with lush, curling lashes. Mary Jo had been warned to keep her distance. “Oh, no, you don’t,” she muttered, waving her index finger. “You’re not going to lure me over there with those big brown eyes. Don’t give me that innocent look, either. I’ve heard all about you.”\u003c/p\u003e\n\u003cp\u003eAfter visiting a few placid sheep, another couple of horses and a donkey with a sweet disposition, Mary Jo walked out of the barn. She hurried toward the house through a light snowfall, wishing she’d remembered her coat. Even before she arrived, the front door opened and an attractive older gentleman held open the screen.\u003c/p\u003e\n\u003cp\u003e“You must be Mary Jo,” he said and thrust out his hand in greeting. “Cliff Harding.”\u003c/p\u003e\n\u003cp\u003e“Hello, Mr. Harding,” she said with a smile. She was about to thank him for his hospitality when he interrupted.\u003c/p\u003e\n\u003cp\u003e“Call me Cliff, okay? And come in, come in.”\u003c/p\u003e\n\u003cp\u003e“All right, Cliff.”\u003c/p\u003e\n\u003cp\u003eMary Jo entered the house and was greeted by the smell of roasting turkey and sage and apple pie.\u003c/p\u003e\n\u003cp\u003e“You’re awake!” Grace declared as she stepped out of the kitchen. She wore an apron and had smudges of flour on her cheeks.\u003c/p\u003e\n\u003cp\u003e“I’m shocked I slept for so long.”\u003c/p\u003e\n\u003cp\u003e“You obviously needed the rest,” Grace commented, leading her into the kitchen. “I see you’ve met my husband.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Mary Jo smiled again. Rubbing her palms nervously together, she looked from one to the other. “I really can’t thank you enough for everything you’ve done for me.”\u003c/p\u003e\n\u003cp\u003e“Oh, nonsense. It’s the least we could do.”\u003c/p\u003e\n\u003cp\u003e“I’m a stranger and you took me in without question and, well…I didn’t think that kind of thing happened in this day and age.”\u003c/p\u003e\n\u003cp\u003eThat observation made Grace frown. “Really? It does here in Cedar Cove. I guess it’s just how people act in small towns. We tend to be more trusting.”\u003c/p\u003e\n\u003cp\u003e“I had a similar experience when I first moved here,” Cliff said. “I wasn’t accustomed to people going out of their way for someone they didn’t know. Charlotte Jefferson—now Charlotte Rhodes—quickly disabused me of that notion.”\u003c/p\u003e\n\u003cp\u003eDespite everything, Mary Jo looked forward to meeting David’s stepmother. The conversation would be difficult, but knowing that Charlotte was as kind as everyone else she’d met so far made all the difference.\u003c/p\u003e\n\u003cp\u003e“Really, Mary Jo,” Grace continued. “All you needed was a friend and a helping hand. Anyone here would’ve done the same. Olivia wanted you to stay with her, too.”\u003c/p\u003e\n\u003cp\u003e“Everyone’s been so wonderful.” Thinking about the willingness of this family to take her in brought a lump to her throat. She bent, with some effort, to stroke the smooth head of a golden retriever who lay on a rug near the stove.\u003c/p\u003e\n\u003cp\u003e“That’s Buttercup,” Grace said fondly as the dog thumped her tail but didn’t get up. “She’s getting old, like the rest of us.”\u003c/p\u003e\n\u003cp\u003e“Coffee?” Cliff walked over to the coffeemaker. “It’s decaf. Are you interested?” he asked, motioning in Mary Jo’s direction with the pot. “Or would you prefer tea? Maybe some chamomile or peppermint tea.”\u003c/p\u003e\n\u003cp\u003e“Tea, please. If it isn’t any trouble.”\u003c/p\u003e\n\u003cp\u003e“None whatsoever. I’m having a cup myself.” Grace began the preparations, then suddenly asked, “You didn’t eat any lunch, did you?”\u003c/p\u003e\n\u003cp\u003e“No, but I’m not hungry.”\u003c/p\u003e\n\u003cp\u003e“You might not be, but that baby of yours is,” Grace announced as if she had a direct line of communication to the unborn child. Without asking further, she walked to the refrigerator and stuck her head inside. Adjusting various containers and bottles and packages, she took out a plastic-covered bowl.\u003c/p\u003e\n\u003cp\u003e“I don’t want to cause you any extra work,” Mary Jo protested.\u003c/p\u003e\n\u003cp\u003e“The work’s already done. Cliff made the most delicious clam chowder,” Grace said. “I’ll heat you up some.”\u003c/p\u003e\n\u003cp\u003eNow that Grace mentioned it, Mary Jo realized she really could use something to eat; she was getting light-headed again. “Cliff cooks?” Her brothers were practically helpless around the kitchen and it always surprised her to find a man who enjoyed cooking.\u003c/p\u003e\n\u003cp\u003e“I am a man of many talents,” Grace’s husband was quick to answer. “I was a bachelor for years before I met Grace.”\u003c/p\u003e\n\u003cp\u003e“If I didn’t prepare meals, my brothers would survive on fast food and frozen entrées,” she said, grinning. Thankfully her mother had taught her quite a bit before her death. The brothers had relied on Mary Jo for meals ever since.\u003c/p\u003e\n\u003cp\u003eThe thought of Linc, Mel and Ned made her anxious. She’d meant to call, but then she’d fallen asleep and now…they could be anywhere. They’d be furious and frightened. She felt a blast of guilt; her brothers might be misguided but they loved her.\u003c/p\u003e\n\u003cp\u003e“If you’ll excuse me a moment,” she said urgently. “I need to make a phone call.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Grace told her. “Would you like to use the house phone?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, I have my cell up in the apartment. It’ll only take a few minutes.”\u003c/p\u003e\n\u003cp\u003e“You might have a problem with coverage. Try it and see. By the time you return, the tea and soup will be ready.”\u003c/p\u003e\n\u003cp\u003eMary Jo went back to the barn and up the stairs to the small apartment. She was breathless when she reached the top and paused to gulp in some air. Her pulse was racing. This had never happened before. Trying to stay calm, she walked into the bedroom where she’d left her purse. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-cedar-cove-christmas-cedar-cove-0/page-11.html","bookId":1950,"creation":"Oct 5, 2019 10:08:30 AM","modification":"Oct 5, 2019 10:08:30 AM"}
