{"id":16832,"no":15,"title":"CHAPTER XV. MR. SYLVESTER\u0027S BIRTHDAY.","content":"\u0026nbsp;The next day Rupert received a letter at the Somerset Hotel. It was signed by Frank Sylvester, and ran thus: \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dear Rupert: To-morrow is my birthday. Come and spend the evening with me. I will wait dinner till you come.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your Friend,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank Sylvester.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert decided at once to accept the invitation. He had learned to like Sylvester, as indeed he had reason to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was in doubt as to whether there would be much company, but he was not provided with a nice suit, so that he need not be ashamed of his appearance. Arrived at his friend\u0027s residence, he found to his surprise that there was but one other guest besides himself, a Mr. Maxwell, a stout, pleasant-looking man of forty-five.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 145]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rupert,\" said Sylvester, \"this is my cousin, John Maxwell. He is not an idler like myself, but is a partner in a large dry-goods house down on Grand Street. John, this is a special friend of mine. When we first met he was able to do me a service which I shall long remember. I am rather young to adopt him, having only reached the age of twenty-five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quarter of a century,\" laughed Maxwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That sounds older, to be sure. At any rate I look upon him as a younger brother, and so have invited him here to my birthday dinner, as a relative.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t seem to have many relatives, Mr. Sylvester,\" said Rupert. \"I thought there might be quite a party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Most of my relatives live in the West. However, I am satisfied to have you here and my Cousin John.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you are Frank\u0027s brother, I suppose I am your cousin also, Rupert,\" said Mr. Maxwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall feel proud to have you regard me so, Mr. Maxwell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 146]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask if you are in the same business as Frank?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Doing nothing at all,\" laughed Sylvester.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a bell-boy at the Somerset Hotel,\" answered Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He watched Maxwell to see if the revelation of his position would affect that gentleman\u0027s opinion of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you are well paid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I receive five dollars a week and my board.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is better than you would do with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Maxwell,\" said Rupert, with a sudden thought, \"I wish I knew you better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because then I might ask you a favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To enter our employment? I will take you if you wish, but I advise you to stay where you are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not for myself that I ask, but for an experienced salesman who is in very hard luck. He is working for Stephen Lorimer, of Third Avenue, at five dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five dollars!\" exclaimed Maxwell, in[Pg 147] surprise. \"And you say he is an experienced salesman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why should he work for such low wages then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Lorimer knew that he was poor, had a family, and was therefore in his power. He told him to choose between five dollars a week and dismissal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is like Lorimer. He has the reputation of being the meanest man in the business. How did you become acquainted with the man you recommend?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert told the story, and both Sylvester and Maxwell were interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you don\u0027t know Mr. Lorimer?\" said Maxwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know him only too well,\" answered Rupert. \"He was my father\u0027s partner in Buffalo, and was the cause of his ruin and death.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was the firm name \u0027Rollins \u0026amp; Lorimer?\u0027\" asked Maxwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I have met your father. I was for[Pg 148] several years a traveling salesman, and sold goods to the firm in Buffalo. I always preferred dealing with your father. I didn\u0027t like Lorimer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am very glad to meet any one who knew my father,\" said Rupert, brightening up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can hardly refuse your request now, Rupert. Tell your friend—what\u0027s his name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Henry Benton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell Mr. Benton to call at our store early next Monday morning and inquire for me. Give him a letter, so that I may know he is the right party. We are not taking on any salesmen, but one in the dress department is about to leave us and enter the employment of a firm in Chicago. I will put your friend in his place at a salary of twelve dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell you how much I thank you,\" said Rupert, gratefully. \"You will bring happiness to a deserving family, and I don\u0027t think you will have occasion to regret it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The dinner was an excellent one, and was[Pg 149] enjoyed by the small company who partook of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must tell you, Rupert,\" said Sylvester, \"that I have peculiar reasons for enjoying my twenty-fifth birthday, even if I have, as Cousin John expresses it, lived a quarter of a century. An old uncle left me fifty thousand dollars some years ago, directing that it should pass into my possession at the age of twenty-five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I congratulate you, Mr. Sylvester. I am sure you will make good use of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so sure of that, but I hope so. I have begun to make use of it already. You shake your head, Cousin John, but I don\u0027t think you will disapprove my expenditure. I have invested seventy-five dollars in a gold watch for Rupert, and thirty-five more in a gold chain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew from his pocket a watch and chain which he handed to the astonished bell-boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what to say, Mr. Sylvester,\" said Rupert, gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your face speaks for you. I want no other thanks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 150]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what they will say at the hotel. They will think I am putting on style for a bell-boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want some one to share my good fortune. I believe it is the best way to show my gratitude to Providence. As Cousin John has done something for your new friend, Mr. Benton, I will follow his example. Here are twenty-five dollars, which you may give him with my best wishes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This gives me even more pleasure than the watch,\" said Rupert, with radiant face. \"I wish you could see how much happiness your gift will carry to a worthy family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will call with you and make their acquaintance some day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The evening passed pleasantly, and it was with a happy heart that Rupert returned to his humble home. That is, it seemed humble compared with the fine house in which he had spent the evening.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not until the next night that he was able to call on his friends in Bleecker Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He toiled up to the fifth floor, and knocked at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 151]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a low \"Come in,\" and he lifted the latch and entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was startled to see that Mrs. Benton had been shedding tears, and her husband was leaning back in his chair, with a look of sadness and despondency.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the matter?\" he asked quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought we could not be any worse off,\" said Mrs. Benton, tearfully, \"but I was mistaken. To-day Mr. Lorimer discharged my husband.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! in the middle of the week?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he is to leave on Saturday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why is this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will tell you,\" said Mr. Benton. \"Do you know Mr. Benton\u0027s son, Julian?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he is a very disagreeable boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I got into trouble with him to-day. He interfered with me in my work, and I reproved him. The consequence is that he spoke to his father against me, and got me discharged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can imagine what this means to us,\" said Mrs. Benton. \"It was hard enough to live on five dollars a week, even with the[Pg 152] help of the few pennies that Harry brings in, but now we must live on nothing. I don\u0027t know what will become of us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But Mr. Benton may secure another position.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is very little chance of it. No one is taking on new salesmen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nevertheless Mr. Benton can go to work next Monday in a store on Grand Street at a salary more than double what he is now getting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surely you are not in earnest?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite so. I will give him a letter to Gilbert \u0026amp; Maxwell, and he will be set to work at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But this seems incredible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will explain it to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are our good angel,\" said Mrs. Benton, when Rupert had concluded his account. \"You come to us in our sorrow with the best news we have had for many a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Mr. Benton, I have a proposal to make. I want you to hire a nice flat in a better neighborhood and take me as a lodger. I am willing to pay you eight dollars a month.[Pg 153] For twenty I think you can hire a desirable tenement, which will only leave you twelve dollars to pay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We shall be very much pleased to do so. If only we had a little ready money——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came near forgetting something important. I am the bearer of a gift to you from a good friend of mine, Mr. Sylvester, of Harlem. Yesterday was his birthday. He has given me a gold watch and chain, and to you he sends twenty-five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Benton\u0027s joy can be imagined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have indeed proved a friend,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a satisfaction to me to feel that the malice of Julian Lorimer will be disappointed. If I see him to-morrow I shall not hesitate to give him a piece of my mind.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3001/82802.html","bookId":300,"creation":"Aug 2, 2019 8:04:28 AM","modification":"Aug 2, 2019 8:04:28 AM"}
