{"id":16838,"no":21,"title":"CHAPTER XXI. RUPERT BECOMES A CONFIDANT.","content":"\u0026nbsp;Some three months later Rupert\u0027s attention was called to a boy of seventeen or thereabouts, with long black hair and a high forehead, who registered as a guest, and took one of the cheapest rooms in the hotel. The boy seemed to have no companion, and to know very little about the city. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you direct me to Palmer\u0027s Theatre?\" he asked, rather diffidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is on Broadway, corner of Thirtieth Street,\" answered Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And Daly\u0027s?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is nearly opposite, on the other side of Broadway.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy took out a memorandum-book and noted down these addresses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What can he want at those theatres?\" thought Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 199]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course he might want to buy a reserved seat in advance, but Rupert did not think it likely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After getting his information the boy went out (it was about ten o\u0027clock), and did not reappear till four o\u0027clock in the afternoon. Rupert noticed him as he entered the hotel, and observed that he looked anxious and despondent. He did not go upstairs at once, but sank into a chair near Rupert, and apparently gave way to sorrowful reflections.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has some secret trouble,\" thought the bell-boy. \"If he would speak to me I might be able to comfort him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the impulse of the moment he went up to the young guest, and asked, in a low tone of sympathy,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you in any trouble?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy started, flushed, and looked at Rupert half suspiciously. But there was something so friendly and sympathetic in Rupert\u0027s face that he was assured of his being a safe confidant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" he said, \"I am in trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you will tell me, perhaps I can help you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 200]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy looked about him hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shouldn\u0027t like to tell you here,\" he answered. \"There are too many people round.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be at leisure after six o\u0027clock. Will that do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Could you come up to my room?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will come with pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want a confidant. I want advice. You are younger than I am—at least you look so—but you have lived in the city while I am from the country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At any rate I will give you the best advice I can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. I feel better for having found a friend. I will go and take a walk, and you will find me here at six o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rupert got through work he found the boy waiting for him in the same place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can go upstairs with you now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said the young guest, rising from his seat quickly. \"We will take the elevator, for my room is on the top floor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In business hours,\" said Rupert, \"I am not allowed to use the elevator. Now I am no longer a bell-boy, but your visitor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 201]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The room was a small hall bedroom. It was one that was let for seventy-five cents a day, while the better and larger rooms ranged upwards to a dollar and a half. The room contained one chair only.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please take a seat,\" said the young host.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But where will you sit?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will sit on the bed. I don\u0027t know but you will laugh at me,\" he went on, \"when I tell you what brought me to New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no. I shall not laugh at you. But first, as we are to be friends, let me tell you my name and ask yours. I am Rupert Rollins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a nice name. It sounds like a story name. Mine is Leslie Waters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you live?\"\u0027\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was born and brought up in Rahway. That is in New Jersey, about twenty miles from New York. My father lives about a mile from the village. He has a small farm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you were brought up to work on the farm?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it isn\u0027t exactly a farm, but we raise vegetables and fruits for the New York [Pg 202]market. I went to school till a year ago. Then I graduated, and since then I have worked for my father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you like it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t like working on land. I feel,\" continued Leslie, flushing, \"that I was born for something better and nobler. Besides, I don\u0027t want to live in the country. I prefer the city. There\u0027s something going on here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that is true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I wanted to be in the excitement. I\u0027d rather live half as long in the city. You can live more here in a year than in the country in two years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was there any particular thing that you wished to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I am coming to that. When I attended school there was one exercise that many of the boys did not like, but I did. I liked to declaim. I began with such pieces as \u0027Casabianca\u0027—you know that, don\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes,\" said Rupert, smiling. \"I have spoken it more than once myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But of course I got beyond that after a[Pg 203] while. I used to speak pieces from Shakespeare and other dramatic authors. There was one I liked to speak in particular. It begins:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The warrior bowed his crested head and tamed his heart of fire,\n\u003c/div\u003e \n\u003cdiv\u003e\n And sued the haughty king to free his long-imprisoned sire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know the poem.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I got a prize for speaking it at one of our closing examinations,\" said Leslie, proudly. \"Would you like to have me speak it for you now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I afraid it would attract attention in some of the neighboring rooms, as it is a spirited piece.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leslie looked disappointed but continued. \"Then I have spoken \u0027Young Lochinvar\u0027 also—I liked that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you never speak any prose pieces?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I didn\u0027t care for prose. I like poetry best. I wish we were alone, so I could speak something for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will go on an excursion some Sunday—say to Weehawken—and then I shall have a chance to hear you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 204]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid I shall not be able to stay in the city,\" said Leslie, gloomily. \"I have met nothing but disappointment since I came here.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3001/82808.html","bookId":300,"creation":"Aug 2, 2019 8:04:45 AM","modification":"Aug 2, 2019 8:04:45 AM"}
