{"id":16848,"no":31,"title":"CHAPTER XXXI. BEN BOONE.","content":"\u0026nbsp;Ben Boone was a tall, loose-jointed man with a shambling gait, who looked as if he wished to get through life as easily as possible. It would be hard to find a man less ambitious. His movements were slow, and he seemed the incarnation of laziness. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was as slow in speech as in action. Yet he was a successful hunter and had tramped about Colorado so much that no better guide could be found.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I heard you wanted to see me, Mr. Packard,\" he said, when he made his appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I may have something for you to do. How are you getting on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at all, squire. I\u0027m a dreadfully unlucky man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So should I have been if I had been as lazy as you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 281]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the use of workin\u0027? Things allus goes ag\u0027inst me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t believe you would succeed under any circumstances. Do you know what makes the difference between you and me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon you was born to be rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was not rich till I came to Colorado, but when I came here I went to work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve worked, too,\" he said, \"but what\u0027s the good of it all?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not much good in your case, I admit. However, I don\u0027t suppose you can be made over again, and if you could I don\u0027t think I would undertake it. There\u0027s one thing you do understand, and that\u0027s hunting. You\u0027ve been pretty much all over Colorado.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, squire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a young friend here who would like to spend a week among the hills. He may not do much in the way of hunting, but he will carry a gun with him. He would like to explore the country a little under your guidance. I believe that is the only kind of work you are willing to undertake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 282]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Ben, in a tone of satisfaction. \"I don\u0027t mind that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll tell you what I will do. You will take my young friend with you—his name is Rupert Rollins—and see that he has a good time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do that, squire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will furnish you with provisions sufficient to last you both a week, and will give you three dollars a day for your trouble. If there are any other expenses, Rupert will have money and will pay them. You won\u0027t need to spend anything, so there is no reason why you shouldn\u0027t save all your wages. How is your wife?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, she\u0027s allus complainin\u0027. She\u0027s had the fever\u0027n ager last week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is fortunate you have no children, for you don\u0027t seem to provide for even your wife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s because I ain\u0027t lucky.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Luck doesn\u0027t often come in the way of a shiftless man like yourself. Well, do you accept my offer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, squire. I\u0027ll be glad to do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 283]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Send your wife here to-morrow morning. I will give her a part of your wages, so that she will have enough to carry her through while you are away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give it to me, squire. I\u0027ll give it to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Giles Packard regarded him keenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t trust you,\" he said. \"If I give her the money I shall be sure she gets it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much are you goin\u0027 to give her?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two days\u0027 pay—six dollars. When you return, if you are away seven days there will be fifteen dollars for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben Boone grumbled some. He thought three dollars would be enough for his wife, but Mr. Packard was obstinate. He understood Ben thoroughly and had very little confidence in him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may be surprised, Rupert, that I should send you with such a man, but, shiftless and lazy as he is, he understands his business. He will prove a good guide, and will make you acquainted with some of the wonders of Colorado.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am quite satisfied, Mr. Packard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 284]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle John, if you wish to join the party I am entirely willing, and will pay your expenses also.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Giles, I am getting too old for adventure. I have got to an age when a man prefers the chimney corner to camping out. It will do very well for Rupert, but I am about fifty years older than he is, and fifty years make a great difference. He can tell me till about his trip when he comes back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I will, Mr. Plympton,\" said Rupert, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert looked forward to the journey with eager interest. He had always been fond of out-of-door sports, and the hunting expedition seemed to promise an experience entirely new to him. He little imagined what shape a portion of this experience would take.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3001/82818.html","bookId":300,"creation":"Aug 2, 2019 8:05:12 AM","modification":"Aug 2, 2019 8:05:12 AM"}
