{"id":16824,"no":7,"title":"CHAPTER VII. A LUCKY MEETING.","content":"\u0026nbsp;It saddened Rupert to think his mother\u0027s wedding ring must be sacrificed, but when they were actually in need of food sentiment must not be considered. After that, when they had no longer anything to pawn except articles of clothing, Rupert shuddered to think what might lay before them. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered Simpson\u0027s with a slow step. A woman was ahead of him and he waited for his turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said an attendant, courteously, \"what can I do for you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What will you give me on this ring?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want on it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two dollars,\" answered Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt it is worth that, but we have so many rings in stock that we are not anxious to receive more. We will give you a dollar and a quarter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 63]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert hesitated, when to his surprise some one tapped him on the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What brings you here, Rupert?\" were the words that reached his ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned round in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Sylvester!\" he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you have not forgotten me. What brings you here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sad necessity, Mr. Sylvester. But—I didn\u0027t expect to find you here. Surely you——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I have not come here to pawn anything,\" said the young man, smiling. \"On the contrary, I want to redeem a watch for an old schoolmate who was obliged to pawn it. He has a wife and child and was thrown out of employment four weeks since. Fortunately I ran across him, and have got him a place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will wait till you have attended to your business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon a gold watch was placed in Mr. Sylvester\u0027s hands, and he paid the pawnbroker twenty dollars and sixty cents. It had been pledged not quite a month for twenty dollars.[Pg 64] The sixty cents represented the three per cent. a month interest allowed by the laws regulating pawn shops.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, young man,\" said the attendant, \"do you want the dollar and a quarter I offered you on your ring?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" interposed Frank Sylvester, quietly. \"What ring is this, Rupert?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My mother\u0027s wedding ring.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you are actually reduced to pawning it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Mr. Sylvester, I can\u0027t get anything to do, and we are out of money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have a mother and sister, I think you told me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we can do better than pawn the ring. Where do you live?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In Elizabeth Street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does your mother prefer the city to the country?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; but she has no choice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose I obtain for her a position as housekeeper in the family of an elderly [Pg 65]gentleman in Rutherford, about ten miles out on the Erie Railroad, would she accept?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She would be glad to do so but for Grace. She could not be separated from her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There would be no occasion. My uncle lives alone in a large house, and a child would make the house pleasanter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Some gentlemen don\u0027t like children.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is not the case with Uncle Ben. But let us go out. You have no further business here. We will go into the Astor House reading room and have a chat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert followed his friend to the Astor House and they ascended to the reading room on the second floor. Taking adjoining armchairs, Mr. Sylvester drew from his pocket the following letter which he showed to Rupert. It ran thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My housekeeper is about to leave me, to join her married daughter in Wisconsin. I must supply her place, but I know of no one in Rutherford who would suit me. Can\u0027t you find me some one—a pleasant, ladylike person, who would make my house homelike and attractive? I think you know my tastes. Please give this matter your early attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Strathmore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 66]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" continued Mr. Sylvester, \"I was quite at a loss whom to recommend, but I think your mother would suit Uncle Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose you call and make her acquaintance, Mr. Sylvester. Then you can tell better. That is, if you don\u0027t object to visiting our poor home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear Rupert, I shall be delighted to meet your mother. One thing I am sure of in advance, she is a lady.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She is, Mr. Sylvester,\" said Rupert, warmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Rollins was a good deal surprised when Rupert entered the room, followed by a handsomely-dressed young man, and she rose from her seat in some trepidation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" said Rupert, \"this is Mr. Sylvester, who was kind enough to give us the money and provisions I brought home the other day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to meet so kind a friend,\" said the widow, with simple dignity. \"Ask him to take a seat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came to make you a business proposal,\" began Mr. Sylvester, who was already [Pg 67]favorably impressed with Rupert\u0027s mother. \"Your son thinks you might be willing to accept the position of housekeeper in my uncle\u0027s family, in Rutherford.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Rollins instinctively looked towards Grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see what you are thinking of,\" interposed her caller. \"There will be no difficulty about taking your daughter with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I shall be glad to accept. And Rupert——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rupert, I am sure, will prefer to remain in the city. I will find him a place. Till then he can stay with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert brightened up at this suggestion. He had no desire to go to the country, but would like nothing more than a place in some city establishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How soon could you arrange to go, Mrs. Rollins?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Next Monday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will answer. I will apprise my uncle. Now as to the compensation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I have Grace with me I shall hardly feel justified in asking compensation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 68]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My uncle would not think of making any account of the little girl\u0027s board. I think he paid your predecessor twenty-five dollars a month. Will that be satisfactory?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is very liberal, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will allow me to offer you a month\u0027s salary in advance. I can settle it with Uncle Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This relieved Mrs. Rollins from a great embarrassment, as she needed to replenish her wardrobe to some extent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go out with you on Monday, and take Rupert with me, as he will wish to see how his mother and sister are situated.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How kind you are, Mr. Sylvester!\" said Rupert, gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t give me too much credit, Rupert. You have helped me out of an embarrassment. I expected to have a long hunt for a housekeeper. Thanks to your mother I have escaped all that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t know how much it means to us, Mr. Sylvester.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, perhaps, I have some idea. It seems a good arrangement for all of us. Well, good[Pg 69] morning. Oh, by the way, you meet me at the Astor House to-morrow morning at eleven o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, with pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Marlow was a very observing woman. She always kept her door ajar, and saw every one who went upstairs. Her curiosity was considerably excited when she saw Rupert\u0027s companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My stars!\" she said to herself. \"What a fine-looking young man! He looks like a real gentleman—I wonder does he know them Rollinses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Marlow would liked to have listened at the door and heard the conversation between her neighbors and the distinguished-looking visitor. But this was not practicable. However, as Mr. Sylvester came down stairs she ventured out and intercepted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure, you\u0027ve been callin\u0027 on my friend, Mrs. Rollins,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is she a friend of yours?\" asked Sylvester, looking at her curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed she is, and she\u0027s a fine lady. But she\u0027s been very unfortunate. I would like[Pg 70] to have helped her, but I am poor myself, and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you accept this?\" said Sylvester, offering her a dollar as the easiest way of getting rid of her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said Mrs. Marlow, with a profound courtesy. \"It\u0027s easy to see you\u0027re a kindhearted man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a curious woman! I should hardly think Mrs. Rollins would have made choice of her as a friend!\" soliloquized the young man as he pushed on to the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder what his name is and where he lives,\" speculated Mrs. Marlow. \"He must be the young man that gave the Rollinses the purse and the basket of provisions. If I knew where he lived I\u0027d go and see him often.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There is very little doubt that Mrs. Marlow would have kept her word, but unfortunately she had no clew to the residence of her new acquaintance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rupert came downstairs, she put herself in his way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had a call from a nice gentleman this morning,\" she said, insinuatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 71]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert felt too happy to slight even Mrs. Marlow, and he answered, courteously,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he brought a present for your mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Mrs. Marlow, but he brought something better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what can that be?\" asked the widow, with intense curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He engaged mother to take a place as housekeeper for a gentleman in the country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say! And what\u0027ll be done with your sister? I\u0027ll board her cheap, and be like a mother to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert could not help smiling at the idea of leaving his sister in such hands. He explained that Grace would go with her mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure your mother\u0027s a lucky woman! I\u0027d like to be a housekeeper myself. Wouldn\u0027t you speak to the gentleman for me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll mention it if you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert could promise this safely, for he would take care that Mr. Sylvester understood the character of their unscrupulous neighbor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you\u0027ll do it, Rupert, dear, I\u0027ll pay you[Pg 72] back the dollar I borrowed the other day, when I get my first week\u0027s wages.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Some folks is lucky!\" soliloquized Mrs. Marlow. \"The young man ought to have taken me. I\u0027m much stronger than Mrs. Rollins, and I would have made a better housekeeper, but maybe my turn will come next.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3001/82794.html","bookId":300,"creation":"Aug 2, 2019 8:04:13 AM","modification":"Aug 2, 2019 8:04:13 AM"}
