{"id":16826,"no":9,"title":"CHAPTER IX. RUPERT BECOMES A BELL-BOY.","content":"\u0026nbsp;Rupert found a pleasant home at the house of Mr. Sylvester, but he was anxious as soon as possible to secure employment. His friend was active in his behalf, but the general depression in business was such that there seemed to be no opening anywhere. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One evening at supper Mr. Sylvester said: \"I have been hoping to find you a place in a wholesale establishment in Pearl Street. I learned that one of the younger clerks was about to leave, but he has decided to stay six months longer, and, of course, we can\u0027t wait as long as that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Mr. Sylvester, it would seem like six years to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Even if your wants were all provided for in that time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel that I ought to be at work, and not[Pg 84] depending on your generosity. I would rather work for two dollars a week than remain idle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is the right spirit, Rupert. You will be glad, then, to hear that I have at last found employment for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I thought you just said——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That I could not get you a place in Pearl Street. True, but this is a different position—very different. It is that of bell-boy in a hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are the duties, Mr. Sylvester?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will be at the command of the clerk, and will have to run up and downstairs, answering calls from the guests, or carrying messages from the office. In fact, you will be a general utility clerk, and I have no doubt will get terribly tired the first few days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind. I can stand that. If I make enough to pay my way I shall be satisfied.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will be better paid than if you were in a mercantile house. You will receive five dollars a week and get your meals at the hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert\u0027s face brightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 85]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, that is excellent,\" he said. \"When I was at Tenney \u0026amp; Rhodes\u0027 I only received five dollars weekly and had to furnish my own meals.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True, but you were then in the line of promotion. Here you cannot expect to rise any higher unless you qualify yourself to be a hotel man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At any rate I am willing to try it. Where is the hotel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the Somerset House, on lower Broadway. It is not a fashionable hotel, but comfortable and of good reputation. I am somewhat acquainted with the office clerk, who was an old schoolmate of mine, and at my request he has given you this position.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I shall give satisfaction. I shall be a green hand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The duties are easily understood and learned. If you show that you are desirous of succeeding you will make a good impression, and you will get on well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When am I to commence work?\" asked Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will take you down town with me [Pg 86]to-morrow morning, and introduce you to Mr. Malcolm, the clerk. I suppose you will be expected to go to work directly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should prefer that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One thing I must tell you. You will have to secure a room outside, as the employees are not expected to sleep in the hotel. All the rooms are reserved for guests.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What will my hours be?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From seven in the morning till seven in the evening. By this arrangement you will have your evenings to yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert went to bed in good spirits. He was of an active temperament, and enjoyed occupation. It would be pleasant to him also to feel that he was earning his own living.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the morning Mr. Sylvester went down town with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Somerset House was a hotel of moderate size, only five stories in height, which is low for a city hotel. I may as well say here that I have not given the correct name of the hotel for obvious reasons. So far as our story is concerned, the name I have chosen will do as well as any other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 87]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Those who frequent this hotel are not of the fashionable class,\" explained Mr. Sylvester, \"but it is largely patronized by traveling salesmen and people from the country. The rates are moderate, and those come here who would not feel able to afford the Fifth Avenue or hotels of that grade.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The entrance was neat, and Rupert was well pleased with the aspect of his new place of employment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At some distance from the doorway was the office, and behind the reading room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Malcolm,\" said Sylvester to a pleasant-looking man of thirty-five, who stood behind a counter, \"this is the young man I mentioned to you. He will be glad to fill the position of bell-boy, and from my acquaintance with him I feel quite sure he will suit you. His name is Rupert Rollins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk smiled pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We shall soon know each other better,\" he said. \"I hope you are strong, for you will have a good deal of exercise here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I can stand it,\" said Rupert. \"I shall soon get used to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 88]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a plan of the rooms here,\" went on the clerk. \"Take it and go upstairs and look about you on the different floors. It will be necessary that you should learn the location of the rooms.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will leave you now, Rupert,\" said Mr. Sylvester. \"You can come back to my house to-night, and to-morrow you can look up a room near the hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the first few days Rupert got very tired. He would have to go upstairs perhaps thirty or forty times during the day, sometimes to the fifth floor. There was an elevator in the Somerset Hotel, but the bell-boys were not allowed to use it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When a guest registered and was assigned to a room on one of the upper floors he was conducted to the elevator, but the bell-boy, carrying his valise, was obliged to walk upstairs, and meet him at the landing-place. Often Rupert felt that there was an injustice in this, and that no harm would be done if he were also allowed to use the elevator. However, he was not foolish enough make any complaint, but by his pleasant manners and[Pg 89] cheerful alacrity won the good opinion of Mr. Malcolm, the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Somerset Hotel was on the European and American systems combined. If a guest preferred simply to lodge at the hotel he could do so, and take his meals either at the hotel restaurant or in any other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One day a guest registered who was assigned to No. 143, on the fifth floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To Rupert was assigned the duty of carrying up the valise. He found it unusually heavy, and more than once as he climbed the stairs he felt that he would be glad to reach his destination. At the elevator landing he met the owner of the valise, a middle-aged man with a brown, sunburned face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You found it rather a heavy tug, didn\u0027t you?\" he asked, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your clothes seem to be heavy,\" returned Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t clothes merely,\" said the stranger. \"I come from Colorado, and I have some specimens of quartz inside. Here, give me the valise, and lead the way to my room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert did so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 90]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they reached No. 143 the stranger drew a fifty cent piece from his pocket and handed it to Rupert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take it,\" he said. \"You deserve something for carrying such a load.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said Rupert. \"I don\u0027t find many guests so liberal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I tell you why I am so liberal? It is because when I was a boy, rather older than you, I was for four months a bell-boy in a Chicago hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Were you, indeed, sir?\" said Rupert, with interest. \"Did you retire on a fortune?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; fees were few and far between. However, I saved a little and borrowed a little more, and made my way first to Nevada, and afterwards to Colorado. I have been pretty well prospered, and now I come home to see my old father and mother in Maine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you will find them well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, my boy, I heartily hope so. It is seventeen years since I have seen their dear old faces, and it will be a good day for me when we meet again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 91]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are your father and mother both living?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Both at last accounts.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are luckier than I am. My father is dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is unfortunate. You are young to have lost a parent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can I do anything for you, sir? Have you all that you need?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered the guest, with a look at the washstand. \"What I want first is water and towels, for I have just got in from a long railroad journey. Those seem to be provided. If I want anything else I will ring.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifty cents!\" repeated Rupert. \"I wish I could be as well paid every time I carry a valise up stairs. Then I should get rich fast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n During the second week a tall, thin man with long hair flowing down over his coat collar registered at the Somerset.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. 119,\" said the clerk. \"Front!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert answered the summons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take this gentleman\u0027s valise to No. 119.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert thought the stranger a very singular-looking man. His long, unkempt locks were of yellowish hue, and his eyes were[Pg 92] shifty and evasive. But of course in a hotel frequented by all sorts of people, no special attention was paid to any particular guest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert met him upstairs and conducted him to his room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take the valise inside,\" said the guest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rupert did so, when he was startled by the guest locking the door, making him a prisoner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, boy,\" he said, his eyes lighted with an insane gleam, \"you must prepare to die!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What?\" exclaimed Rupert, startled. \"What do you mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am commanded by God to offer you up as a sacrifice, even as Abraham offered up his son Isaac.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he drew a knife from his breast and advanced toward the hapless bell-boy.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3001/82796.html","bookId":300,"creation":"Aug 2, 2019 8:04:17 AM","modification":"Aug 2, 2019 8:04:17 AM"}
