{"id":78551,"no":20,"title":"Page 20","content":"\u003cp\u003e\"Ship,\" he roared. \"It\u0027s a ship, not a boat.\"\u003c/p\u003e\n\u003cp\u003eShe decided to try to placate him. \"I meant to say ship.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have any more of these things?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re called parasols,\" she replied. \"And yes, I do have three more.\"\u003c/p\u003e\n\u003cp\u003e\"Give them to me. Now.\"\u003c/p\u003e\n\u003cp\u003e\"What are you going to do with them?\"\u003c/p\u003e\n\u003cp\u003eShe rushed over to her trunk when he took a threatening step toward her. \"I can\u0027t imagine why you would need my parasols,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m throwing them in the ocean. With any luck they\u0027ll cripple a couple of sharks.\"\u003c/p\u003e\n\u003cp\u003e\"You cannot throw my parasols in the ocean. They match my gowns, Nathan. They were made just for… it would be a sin to waste… you can\u0027t.\" She ended her tirade in a near wail.\u003c/p\u003e\n\u003cp\u003e\"The hell I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t shouting at her any longer. She should have been happy over that minor blessing, but she wasn\u0027t. He was still being too mean-hearted to suit her. \"Explain why you want to destroy my parasols,\" she demanded. \"Then I might give them to you.\"\u003c/p\u003e\n\u003cp\u003eShe located the third parasol in the bottom of the trunk, but when she straightened and turned to confront him again she clutched all three against her bosom.\u003c/p\u003e\n\u003cp\u003e\"The parasols are a menace, that\u0027s why.\"\u003c/p\u003e\n\u003cp\u003eShe looked incredulous. \"How could they be a menace?\"\u003c/p\u003e\n\u003cp\u003eShe was looking at him as though she thought he\u0027d lost his mind. He shook his head. \"The first parasol crippled my men, Sara,\" he began.\u003c/p\u003e\n\u003cp\u003e\"It only crippled Ivan,\" she corrected.\u003c/p\u003e\n\u003cp\u003e\"Which is why you made the damn soup that crippled the rest of my crew,\" he countered.\u003c/p\u003e\n\u003cp\u003eHe had a valid point there, she had to admit, but she thought it was terribly unkind of him to bring up the topic of her soup again.\u003c/p\u003e\n\u003cp\u003e\"The second parasol crippled my ship,\" he continued. \"Haven\u0027t you noticed we aren\u0027t gliding across the waters now? We had to drop anchor in order to see to the repairs. We\u0027re easy prey for anyone sailing past. That\u0027s why your other damned parasols are all going into the ocean.\"\u003c/p\u003e\n\u003cp\u003e\"Nathan, I didn\u0027t mean to cause these mishaps. You\u0027re acting as though I did everything on purpose.\"\u003c/p\u003e\n\u003cp\u003e\"Did you?\"\u003c/p\u003e\n\u003cp\u003eShe reacted as though he\u0027d just slapped her backside. \"No,\" she cried out. \"God, you\u0027re insulting.\"\u003c/p\u003e\n\u003cp\u003eHe wanted to shake some sense into her. She started crying.\u003c/p\u003e\n\u003cp\u003e\"Quit that weeping,\" he demanded.\u003c/p\u003e\n\u003cp\u003eNot only did she continue to cry, but she threw herself into his arms. Hell, he\u0027d been the one to make her weep in the first place, he thought, and she certainly should have been upset with him just a little, shouldn\u0027t she?\u003c/p\u003e\n\u003cp\u003eNathan didn\u0027t know what to make of her. Her parasols littered the floor around his feet, and she was clinging to him as she sobbed wet tears all over his shirt. He put his arms around her and held her close even as he tried to understand why in God\u0027s name he wanted to comfort her.\u003c/p\u003e\n\u003cp\u003eThe woman had damn near destroyed his ship.\u003c/p\u003e\n\u003cp\u003eHe kissed her.\u003c/p\u003e\n\u003cp\u003eShe tucked her face in the side of his neck and quit crying. \"Do the men know I broke the ship?\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t break it,\" he muttered. God, she sounded pitiful.\u003c/p\u003e\n\u003cp\u003e\"But do the men think I—\"\u003c/p\u003e\n\u003cp\u003e\"Sara, we can fix the damage in a couple of days,\" he said. It was a lie, for it would take them close to a week to see to the repairs, but he\u0027d softened the truth just a little to ease her worry.\u003c/p\u003e\n\u003cp\u003eHe decided then that he had lost his mind. His wife had caused nothing but chaos since the moment she\u0027d boarded his ship. He kissed the top of her head and began to rub her backside.\u003c/p\u003e\n\u003cp\u003eShe leaned against him. \"Nathan?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Does my staff know I caused this mishap?\"\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes heavenward. Her staff, indeed. \"Yes, they know.\"\u003c/p\u003e\n\u003cp\u003e\"Did you tell them?\"\u003c/p\u003e\n\u003cp\u003eHe closed his eyes. There had been such censure in her voice. She thought he was being disloyal to her, he surmised. \"No, I didn\u0027t tell them. They saw the parasol, Sara.\"\u003c/p\u003e\n\u003cp\u003e\"I wanted them to respect me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, they respect you all right,\" he announced. His voice had lost its angry bite.\u003c/p\u003e\n\u003cp\u003eShe heard the smile in his voice and felt a quick rush of hope until he added, \"They\u0027re waiting for you to bring on the plague next.\"\u003c/p\u003e\n\u003cp\u003eShe thought he was teasing her. \"They don\u0027t believe that nonsense,\" she replied.\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, they do,\" he told her. \"They\u0027re making wagers, Sara. Some think it will be boils first, then the plague. Others believe—\"\u003c/p\u003e\n\u003cp\u003eShe pushed away from him. \"You\u0027re serious, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"They think you\u0027re cursed, wife.\"\u003c/p\u003e\n\u003cp\u003e\"How can you smile at me when you say such sinful things?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"The men are superstitious, Sara.\"\u003c/p\u003e\n\u003cp\u003e\"Is it because I\u0027m a woman?\" she asked. \"I\u0027ve heard that seamen think it\u0027s bad luck to have a woman on board, but I didn\u0027t credit such foolishness.\"\u003c/p\u003e\n\u003cp\u003e\"No, it isn\u0027t because you\u0027re a woman,\" he answered. \"They\u0027re used to having a woman on board. My sister Jade used to be mistress of this ship.\"\u003c/p\u003e\n\u003cp\u003e\"Then why—\"\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t like Jade,\" he told her. \"They were quick to notice.\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t get him to elaborate. A sudden thought changed her direction. \"Nathan, I\u0027ll help with the repairs,\" she said. \"Yes, that\u0027s it. The men will realize I didn\u0027t deliberately—\"\u003c/p\u003e\n\u003cp\u003e\"God save us all,\" he interrupted.\u003c/p\u003e\n\u003cp\u003e\"Then how am I going to win their confidence again?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand this obsession with winning the men over,\" he returned. \"It makes absolutely no sense.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m their mistress. I must have their respect if I\u0027m going to direct them.\"\u003c/p\u003e\n\u003cp\u003eHe let out a loud sigh, then shook his head. \"Direct yourself to bed, wife, and stay there until I come back.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t question me. Just stay inside this cabin.\"\u003c/p\u003e\n\u003cp\u003eShe nodded agreement. \"I won\u0027t leave this cabin save for going to visit with Nora, all right?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say—\"\u003c/p\u003e\n\u003cp\u003e\"Please? It\u0027s going to be a long afternoon, Nathan. You might be too busy to come home for hours yet. You didn\u0027t come to bed at all last night. I tried to wait up for you, but I was very weary.\"\u003c/p\u003e\n\u003cp\u003eHe smiled because she\u0027d called their cabin home. Then he nodded. \"You\u0027ll wait up for me tonight,\" he ordered. \"No matter what the time.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to want to shout at me again?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"All right, then,\" she promised. \"I\u0027ll wait up for you.\"\u003c/p\u003e\n\u003cp\u003e\"Damn it, Sara,\" he countered. \"I wasn\u0027t asking. I was telling.\"\u003c/p\u003e\n\u003cp\u003eHe grabbed her and squeezed her shoulders. It was actually more of a caress. She pushed his hands away and wrapped her arms around his waist again.\u003c/p\u003e\n\u003cp\u003e\"Nathan?\" she whispered.\u003c/p\u003e\n\u003cp\u003eHer voice sounded shaky to him. His hands dropped to his sides. He thought she might be afraid he\u0027d hurt her. He was about to explain that no matter how much she provoked him he would never, ever raise a hand against her. But Sara suddenly leaned up on tiptoes and kissed him. He was so surprised by the show of affection he didn\u0027t know how to respond.\u003c/p\u003e\n\u003cp\u003e\"I was very upset with you when you left the cabin so quickly after we had… been so intimate.\"\u003c/p\u003e\n\u003cp\u003e\"Do you mean after we made love?\" he asked, smiling over the shyness in her voice.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she replied. \"I was very upset.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because a wife likes to hear that she…\"\u003c/p\u003e\n\u003cp\u003e\"Satisfied her husband?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she returned. \"Don\u0027t mock me, Nathan. Don\u0027t make what happened between us so cold and calculated either. It was too beautiful.\"\u003c/p\u003e\n\u003cp\u003eHe was shaken by her fervent speech, knew she believed what she\u0027d said with all her heart. He found himself inordinately pleased with her. \"Yes, it was beautiful,\" he said. \"I wasn\u0027t mocking you,\" he added in a rougher tone. \"I was just trying to understand what it is you want from me.\"\u003c/p\u003e\n\u003cp\u003e\"I want to hear that you…\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t go on.\u003c/p\u003e\n\u003cp\u003e\"That you\u0027re a fine woman?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I\u0027m at fault, too,\" she admitted. \"I should have given you a few words of praise, too.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eHe really looked bewildered to her. That did irritate her. \"Because a husband needs to hear such words, too.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you do.\"\u003c/p\u003e\n\u003cp\u003eHe decided he\u0027d wasted enough conversation on his confusing wife and bent on one knee to collect the parasols.\u003c/p\u003e\n\u003cp\u003e\"May I please have those back?\" she asked. \"I\u0027ll destroy them myself right away. I don\u0027t want my staff to see you throw them overboard. It would be most humiliating.\"\u003c/p\u003e\n\u003cp\u003eHe reluctantly agreed, though only because he was certain she couldn\u0027t do any real damage with the useless things as long as they stayed inside the cabin. Still, just to be on the safe side, he made her give him her promise.\u003c/p\u003e\n\u003cp\u003e\"The parasols won\u0027t leave this chamber?\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You will destroy them?\"\u003c/p\u003e\n\u003cp\u003e\"I will.\"\u003c/p\u003e\n\u003cp\u003eHe was finally satisfied. He actually began to feel a little more peaceful. By the time he left the cabin he was convinced his wife couldn\u0027t possibly wreck anything else.\u003c/p\u003e\n\u003cp\u003eBesides, he reasoned, what more could she do?\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eShe set his ship on fire.\u003c/p\u003e\n\u003cp\u003eShe\u0027d lulled them into a state of feeling safe again. A full eight days and nights passed without a single mishap taking place. The men were still wary of Sara, but they weren\u0027t scowling nearly as often. Some were even whistling every now and again as they saw to their daily tasks. Chester, the doubting Thomas of the crew, was the only one who continued to make the sign of the cross whenever Sara strolled past.\u003c/p\u003e\n\u003cp\u003eLady Sara pretended she didn\u0027t notice.\u003c/p\u003e\n\u003cp\u003eOnce the sails had been repaired they made good catch-up time. They were just a week or so away from Nora\u0027s island home. The weather had been accommodating, though the heat was nearly unbearable in the early afternoons. The nights continued to be just as chilly, however, and thick quilts were still needed to take the shivers away.\u003c/p\u003e\n\u003cp\u003eAll and all, things were looking calm.\u003c/p\u003e\n\u003cp\u003eNathan should have realized it wouldn\u0027t last. It was late Friday night when he finished giving directions for the watch. He interrupted Jimbo\u0027s conversation with Matthew to give them fresh orders for the drill and the firing of the cannons they would practice tomorrow.\u003c/p\u003e\n\u003cp\u003eThe three of them were standing directly in front of the trapdoor that led down to Nathan\u0027s cabin. For that reason Jimbo kept his voice low when he said, \"The men are beginning to forget this talk about your wife being cursed, boy.\" He paused to glance behind him, as if that action would assure him that Sara couldn\u0027t overhear, then added, \"Chester is still telling everyone mischief trails in three. We\u0027d best continue to keep a close watch on Sara until—\"\u003c/p\u003e\n\u003cp\u003e\"Jimbo, no one would dare touch the captain\u0027s wife,\" Matthew muttered.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t suggesting anyone would,\" Jimbo countered. \"I\u0027m just saying that they could still hurt her feelings. She\u0027s a bit tenderhearted.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know she considers us all part of her staff?\" Matthew remarked. He grinned, then stopped himself. \"Lady Sara obviously has you in the palm of her hand, if you\u0027re so concerned about her feelings.\" He started to continue on that same topic when the scent of smoke caught his attention. \"Am I smelling smoke?\" he asked.\u003c/p\u003e\n\u003cp\u003eNathan saw the stream of gray smoke seeping up around the edges of the trapdoor before the other two men did. He should have shouted fire to alert the others of the danger. He didn\u0027t. He bellowed Sara\u0027s name instead. The anguish in his voice was gut-wrenching.\u003c/p\u003e\n\u003cp\u003eHe threw open the hatch. A thick black sheet of smoke billowed up through the opening, blinding the three men. Nathan shouted Sara\u0027s name again.\u003c/p\u003e\n\u003cp\u003eMatthew shouted, \"Fire!\"\u003c/p\u003e\n\u003cp\u003eJimbo went running for the buckets, yelling his own order for seawater on the double, while Matthew tried to keep Nathan from going below by way of the trap.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know how bad it is,\" he shouted. \"Use the steps, boy, use the—\"\u003c/p\u003e\n\u003cp\u003eMatthew quit his demand when Nathan slipped down through the opening, then turned to run down the steps.\u003c/p\u003e\n\u003cp\u003eNathan could barely see inside the cabin, tor the smoke was so thick it blackened his vision. He groped his way over to the bed to find Sara.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t there. By the time he\u0027d searched the cabin his lungs were burning. He staggered back to the trap again and used the buckets of seawater Jimbo handed down to him to flood the flames out.\u003c/p\u003e\n\u003cp\u003eThe threat was over. The near miss they\u0027d all had made the men shake. Nathan couldn\u0027t seem to control his heartbeat. His fear for his wife\u0027s safety had all but overwhelmed him. Yet she wasn\u0027t even inside the cabin. She hadn\u0027t been overcome by smoke. She wasn\u0027t dead.\u003c/p\u003e\n\u003cp\u003eYet.\u003c/p\u003e\n\u003cp\u003eMatthew and Jimbo flanked Nathan. All three men stared at the corner of the room to gauge the damage done.\u003c/p\u003e\n\u003cp\u003eSeveral of the planks under the potbellied stove had fallen through the floor to the next level. There was now a gaping, glowing hole in the floorboards. Two of the four walls had been licked black all the way to the ceiling by the scorch of the fire.\u003c/p\u003e\n\u003cp\u003eThe damage to the cabin wasn\u0027t what held Nathan mesmerized, though. No, his full attention was riveted on the remains of Sara\u0027s parasols. The spokes still glowed inside the two remaining metal fittings of the stove.\u003c/p\u003e\n\u003cp\u003e\"Did she think this was a hearth?\" Matthew whispered to Jimbo. He rubbed his jaw while he considered that possibility.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thinking she did,\" Jimbo answered.\u003c/p\u003e\n\u003cp\u003e\"If she\u0027d been asleep, the smoke would have killed her,\" Nathan said, his voice raw.\u003c/p\u003e\n\u003cp\u003e\"Now, boy,\" Jimbo began, certain that the boy was getting himself all worked up, \"Sara\u0027s all right, and that\u0027s what counts. You\u0027re sounding as black as the soot on these walls. You\u0027ve only yourself to blame,\" he added with a crisp nod.\u003c/p\u003e\n\u003cp\u003eNathan gave him a murderous stare. Jimbo wasn\u0027t the least intimidated. \"I heard Sara call the trap a chimney. Had myself a good laugh over that comment, too. I thought you set her straight.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t suppose he did,\" Matthew interjected. Nathan wasn\u0027t at all calmed by Jimbo\u0027s argument. He sounded as if he was close to weeping when he bellowed, \"She set my ship on fire.\"\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t do it on purpose,\" Matthew defended. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gift-crown-s-spies-3/page-20.html","bookId":1790,"creation":"Oct 5, 2019 4:09:53 PM","modification":"Oct 5, 2019 4:09:53 PM"}
