{"id":78534,"no":3,"title":"Page 3","content":"\u003cp\u003eIn truth, Colin\u0027s grin was as much a mask as Nathan\u0027s scowl. Past betrayals had trained the two men well. Neither man believed in the fairy tale of love or the nonsense of living happily ever after. Only fops and fools believed in such fantasies.\u003c/p\u003e\n\u003cp\u003eNathan\u0027s scowl was in full evidence when he walked into the office. He found Colin lounging in a wingback chair with his feet propped up on the window seat.\u003c/p\u003e\n\u003cp\u003e\"Jimbo has two mounts ready, Colin,\" Nathan said, referring to their shipmate. \"You two have an errand to do?\"\u003c/p\u003e\n\u003cp\u003e\"You know what the mounts are for, Nathan. You and I are going to ride over to the gardens and have a look at Lady Sara. There\u0027s going to be quite a crush of people in attendance this afternoon. No one will see us if we keep to the trees.\"\u003c/p\u003e\n\u003cp\u003eNathan turned to look out the window before answering. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Jimbo will watch the office while we\u0027re away.\"\u003c/p\u003e\n\u003cp\u003e\"Colin, I don\u0027t need to see her before tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Damn it all, you need to get a good look at her first.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Nathan asked. He sounded genuinely perplexed.\u003c/p\u003e\n\u003cp\u003eColin shook his head. \"To prepare yourself.\"\u003c/p\u003e\n\u003cp\u003eNathan turned around. \"I don\u0027t need to prepare myself,\" he said. \"Everything\u0027s ready. I already know which window belongs to her bedchamber. The tree outside will hold my weight; I tested it to be sure. There isn\u0027t a lock on her window to worry about, and the ship is ready to sail.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ve thought of everything, have you?\"\u003c/p\u003e\n\u003cp\u003eNathan nodded. \"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Colin paused to smile. \"And what if she won\u0027t fit through the window? Have you considered that possibility?\"\u003c/p\u003e\n\u003cp\u003eThat question got just the reaction Colin wanted. Nathan looked startled, then shook his head. \"It\u0027s a large window, Colin.\"\u003c/p\u003e\n\u003cp\u003e\"She might be larger.\"\u003c/p\u003e\n\u003cp\u003eIf Nathan was chilled by that possibility, he didn\u0027t let it show. \"Then I\u0027ll roll her down the stairs,\" he drawled.\u003c/p\u003e\n\u003cp\u003eColin laughed over that picture. \"Aren\u0027t you at all curious to see how she turned out?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I am,\" Colin finally admitted. \"Since I won\u0027t be going along with you two on your honeymoon, it\u0027s only decent to satisfy my curiosity before you leave.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a journey, not a honeymoon,\" Nathan countered. \"Quit trying to bait me, Colin. She\u0027s a Winchester, for God\u0027s sake, and the only reason we\u0027re sailing is to get her away from her relatives.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how you\u0027re going to stomach it,\" Colin said. His grin was gone, his concern obvious in his expression. \"God, Nathan, you\u0027re going to have to bed her in order to produce an heir if you want the land, too.\"\u003c/p\u003e\n\u003cp\u003eBefore Nathan could comment on that reminder Colin continued. \"You don\u0027t have to go through with this. The company will make it with or without the funds from the contract. Besides, now that King George has officially stepped down the prince regent will surely rule to overturn the contract. The Winchesters have been waging an intense campaign to sway his mind. You could turn your back on this.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" His tone was emphatic. \"My signature\u0027s on that contract. A St. James doesn\u0027t break his word.\"\u003c/p\u003e\n\u003cp\u003eColin snorted. \"You can\u0027t be serious,\" he replied. \"The St. James men are known to break just about anything when the mood strikes them.\"\u003c/p\u003e\n\u003cp\u003eNathan had to agree with that observation. \"Yes,\" he said. \"Regardless, Colin, I won\u0027t turn my back on this matter any more than you would take the money your brother offered. It\u0027s a point of honor. Hell, we\u0027ve been over this before. My mind\u0027s made up.\"\u003c/p\u003e\n\u003cp\u003eHe leaned against the window frame and let out a long, weary sigh. \"You aren\u0027t going to let up unless I agree to go, are you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Colin answered. \"Besides, you\u0027ll want to count the number of Winchester uncles there so you\u0027ll know how many you have to contend with this evening.\"\u003c/p\u003e\n\u003cp\u003eIt was a paltry argument, and they both knew it. \"No one\u0027s going to get in my way, Colin.\"\u003c/p\u003e\n\u003cp\u003eThat statement was made in a soft, chilling tone of voice.\u003c/p\u003e\n\u003cp\u003eColin grinned in reaction. \"I\u0027m well aware of your special talents, friend. I just hope to God there isn\u0027t a bloodbath tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d hate to miss all the fun.\"\u003c/p\u003e\n\u003cp\u003e\"Then come along.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" Colin answered. \"One favor deserves another, remember? I had to promise the duchess I\u0027d attend her daughter\u0027s recital, heaven save me, if she could find a way to get Lady Sara to attend her party this afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t be there,\" Nathan predicted. \"Her bastard father doesn\u0027t let her attend any functions.\"\u003c/p\u003e\n\u003cp\u003e\"Sara will be there,\" Colin predicted. \"The earl of Winchester wouldn\u0027t dare offend the duchess. She specifically requested that Lady Sara be allowed to join in the festivities.\"\u003c/p\u003e\n\u003cp\u003e\"What reason did she give?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t the faintest idea,\" Colin answered. \"Time\u0027s wasting, Nathan.\"\u003c/p\u003e\n\u003cp\u003e\"Damn.\" After muttering that expletive Nathan pulled away from the frame. \"Let\u0027s get it done, then.\"\u003c/p\u003e\n\u003cp\u003eColin was quick to take advantage of his victory. He strode out the door before his friend could change his mind.\u003c/p\u003e\n\u003cp\u003eOn their way across the congested city he turned to ask Nathan, \"Aren\u0027t you wondering how we\u0027ll know which one is Sara?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you have it all figured out,\" he remarked dryly.\u003c/p\u003e\n\u003cp\u003e\"That I do,\" Colin returned in a gratingly cheerful voice. \"My sister Rebecca has promised she\u0027ll stay close to Lady Sara all afternoon. I\u0027ve hedged my bets, too.\"\u003c/p\u003e\n\u003cp\u003eHe waited a long minute for Nathan to inquire as to how he\u0027d done that, then continued. \"If Rebecca is waylaid from her duty, I\u0027ve lined up my other three sisters to take turns stepping in. You know, old boy, you really could show a little more enthusiasm.\"\u003c/p\u003e\n\u003cp\u003e\"This outing is a complete waste of my time.\"\u003c/p\u003e\n\u003cp\u003eColin didn\u0027t agree, but he kept that opinion to himself.\u003c/p\u003e\n\u003cp\u003eNeither man spoke again until they\u0027d reached the rise above the gardens and reined in their mounts. The cover of the trees shielded them well, yet they had a clear view of the guests strolling about the gardens of the duchess\u0027s estate below.\u003c/p\u003e\n\u003cp\u003e\"Hell, Colin, I feel like a schoolboy.\"\u003c/p\u003e\n\u003cp\u003eHis friend laughed. \"Leave it to the duchess to go overboard,\" he remarked when he noticed the crowd of musicians filing toward the lower terrace. \"She hired an entire orchestra.\"\u003c/p\u003e\n\u003cp\u003e\"Ten minutes, Colin, and then I\u0027m leaving.\"\u003c/p\u003e\n\u003cp\u003e\"Agreed,\" Colin placated. He turned to look at his friend. Nathan was scowling. \"You know, she might have been willing to leave with you, Nathan, if you\u0027d—\"\u003c/p\u003e\n\u003cp\u003e\"Are you suggesting I send another letter?\" Nathan asked. He raised an eyebrow over the absurdity of that possibility. \"You do recall what happened the last time I followed your advice, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I remember,\" Colin answered. \"But things might have changed. There could have been a misunderstanding. Her father could have—\"\u003c/p\u003e\n\u003cp\u003e\"A misunderstanding?\" Nathan sounded incredulous. \"I sent the note on a Thursday, and I was damn specific, Colin.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Colin said. \"You told them you were going to collect your bride the following Monday.\"\u003c/p\u003e\n\u003cp\u003e\"You thought I should have given her more time to pack her belongings.\"\u003c/p\u003e\n\u003cp\u003eColin grinned. \"I did, didn\u0027t I? In defense of my gentlemanly behavior, I must say I never imagined she\u0027d run away. She was quick, too, wasn\u0027t she?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she was,\" Nathan replied, a hint of a smile in his voice.\u003c/p\u003e\n\u003cp\u003e\"You could have gone after her.\"\u003c/p\u003e\n\u003cp\u003e\"Why? My men followed her. I knew where she was. I just decided to leave her alone a little longer.\"\u003c/p\u003e\n\u003cp\u003e\"A stay of execution, perchance?\"\u003c/p\u003e\n\u003cp\u003eNathan did laugh then. \"She\u0027s only a woman, Colin, but yes, I do suppose it was a reprieve of sorts.\"\u003c/p\u003e\n\u003cp\u003e\"There was more to it than that, though, wasn\u0027t there? You knew she would be in danger as soon as you claimed her. You won\u0027t admit it, Nathan, but in your own way you\u0027ve been protecting Sara by leaving her alone. I\u0027m right, aren\u0027t I?\"\u003c/p\u003e\n\u003cp\u003e\"You just said I wouldn\u0027t admit it,\" he countered. \"Why bother to ask?\"\u003c/p\u003e\n\u003cp\u003e\"God help the two of you. The next year is going to be hell. You\u0027ll both have the world trying to do you in.\"\u003c/p\u003e\n\u003cp\u003eNathan shrugged. \"I\u0027ll protect her.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t doubt that.\"\u003c/p\u003e\n\u003cp\u003eNathan shook his head. \"The daft woman actually booked passage on one of our own ships to run away from me. That still chafes. A bit of an irony, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003e\"Not really,\" Colin answered. \"She couldn\u0027t have known you owned the ship. You did insist upon remaining a silent partner in the company, remember?\"\u003c/p\u003e\n\u003cp\u003e\"We wouldn\u0027t have any clients otherwise. You know damn well the St. James men aren\u0027t liked by the members of the ton. They\u0027re still a little rough around the cuffs.\" His grin told his friend he found that trait appealing.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s still odd to me,\" Colin announced, switching the topic. \"You had your men follow Lady Sara—watch out for her, too—yet you never bothered to ask any of them to tell you what she looked like.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t ask any of them either,\" Nathan countered.\u003c/p\u003e\n\u003cp\u003eColin shrugged. He returned his attention to the crowd below. \"I suppose I thought you\u0027d decide the contract wasn\u0027t worth the sacrifice. After all, she…\" He completely lost his train of thought when he spotted his sister strolling toward them. Another woman walked by her side. \"There\u0027s Becca,\" he said. \"If the silly chit would just move a little to the left…\" That remark went unfinished. Colin\u0027s indrawn breath filled the air. \"Sweet Jesus… could that be Lady Sara?\"\u003c/p\u003e\n\u003cp\u003eNathan didn\u0027t answer him. In truth, he doubted he was capable of speech right then. His mind was fully consumed taking in the vision before him.\u003c/p\u003e\n\u003cp\u003eShe was enchanting. Nathan had to shake his head. No, he told himself, she couldn\u0027t possibly be his bride. The gentle lady smiling so shyly at Rebecca was simply too beautiful, too feminine, and too damn thin to belong to the Winchester clan.\u003c/p\u003e\n\u003cp\u003eAnd yet there was a hint of a resemblance, a nagging reminder of the impossible four-year-old he\u0027d held in his arms, something indefinable that told him she really was his Lady Sara.\u003c/p\u003e\n\u003cp\u003eGone was the wild mop of honey-colored curls. Her hair was shoulder-length, still given to curl, but as dark as chestnuts. Her complexion looked pure to him from the distance separating them, and he wondered if she still had the sprinkle of freckles across the bridge of her nose.\u003c/p\u003e\n\u003cp\u003eShe\u0027d grown to only average height, judging by the fact that she was eye level with Colin\u0027s younger sister. There certainly wasn\u0027t anything average about her figure, however. She was rounded in all the right places.\u003c/p\u003e\n\u003cp\u003e\"Look at all the young bucks moving in,\" Colin announced. \"They\u0027re like sharks circling their prey. Your wife seems to be their target, Nathan,\" he added. \"Hell, you\u0027d think they would have the decency to leave a married woman alone. Still, I suppose I can\u0027t really fault them. My God, Nathan, she\u0027s magnificent.\"\u003c/p\u003e\n\u003cp\u003eNathan was fully occupied watching the eager men chase after his bride. He had an almost overwhelming urge to beat the foppish grins off their faces. How dare they try to touch what belonged to him?\u003c/p\u003e\n\u003cp\u003eHe shook his head over his illogical reaction to his bride.\u003c/p\u003e\n\u003cp\u003e\"Here comes your charming father-in-law,\" Colin said. \"God, I didn\u0027t realize how bowlegged he is. Look how he shadows her,\" he continued. \"He isn\u0027t about to let his prize out of his sight.\"\u003c/p\u003e\n\u003cp\u003eNathan took a deep breath. \"Let\u0027s ride, Colin. I\u0027ve seen enough.\"\u003c/p\u003e\n\u003cp\u003eNot a hint of emotion was in his voice. Colin turned to look at him. \"Well?\"\u003c/p\u003e\n\u003cp\u003e\"Well, what?\"\u003c/p\u003e\n\u003cp\u003e\"Damn it, Nathan, tell me what you think.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\"\u003c/p\u003e\n\u003cp\u003e\"Lady Sara,\" Colin persisted. \"What do you think of her?\"\u003c/p\u003e\n\u003cp\u003e\"The truth, Colin?\"\u003c/p\u003e\n\u003cp\u003eHis friend gave a quick nod.\u003c/p\u003e\n\u003cp\u003eNathan\u0027s smile was slow, easy. \"She\u0027ll fit through the window.\"\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eTime was running out.\u003c/p\u003e\n\u003cp\u003eSara was going to have to leave England. Everyone would probably think she\u0027d run away again. They\u0027d begin to call her coward, she supposed, and although that slander would sting, she was still determined to go through with her plans. Sara simply didn\u0027t have any other choice. She\u0027d already sent two letters to the marquess of St. James requesting his assistance, but the man to whom she was legally wed hadn\u0027t bothered to respond. She didn\u0027t dare try to contact him again. There simply wasn\u0027t enough time left. Aunt Nora\u0027s future was at stake, and Sara was the only one who could—or, more specifically, who would—save her.\u003c/p\u003e\n\u003cp\u003eIf the members of the ton believed she was running away from the marriage contract, so be it.\u003c/p\u003e\n\u003cp\u003eNothing ever turned out the way Sara imagined it would. When her mother had asked her to go to Nora\u0027s island the previous spring to make certain she was all right Sara had immediately agreed. Her mother hadn\u0027t received a letter from her sister in over four months, and fear about her health was beginning to make Sara\u0027s mother ill. In truth,\u003c/p\u003e\n\u003cp\u003eSara was just as concerned about her mother\u0027s health as she was about her aunt\u0027s. Something had to be amiss. It simply wasn\u0027t like her aunt to forget to write. No, the monthly packet of letters had always been as dependable as the inevitable rain on the annual Winchester picnics.\u003c/p\u003e\n\u003cp\u003eSara and her mother agreed that neither one of them would confide the real reason behind her sudden departure. They settled on the lie that Sara was simply going to visit her older sister Lillian, who lived in the colonies of America with her husband and infant son.\u003c/p\u003e\n\u003cp\u003eSara had considered telling her father the truth, then discarded the notion. Even though he was certainly the most reasonable of the brothers, he was still a Winchester through and through. He didn\u0027t like Nora any better than his brothers did, though for his wife\u0027s sake he wasn\u0027t as vocal in his opinions.\u003c/p\u003e\n\u003cp\u003eThe Winchester men had turned their backs on Nora when she disgraced them by marrying beneath her station. The marriage to her groom had taken place fourteen years earlier, but the Winchesters weren\u0027t a forgiving lot. They put great store in the expression \"an eye for an eye.\" Revenge was as sacred to them as the commandments were to most of the bishops, even when the infraction was as slight as a brief month of public embarrassment. Not only would they never forget their humiliation, they would also never, ever forgive. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gift-crown-s-spies-3/page-3.html","bookId":1790,"creation":"Oct 5, 2019 4:09:53 PM","modification":"Oct 5, 2019 4:09:53 PM"}
