{"id":73129,"no":29,"title":"Page 29","content":"\u003cp\u003e“But your mom’s way too hot to cheat on, Char.”\u003c/p\u003e\n\u003cp\u003eMadeline sounded torn. “I’m not guessing on this one.”\u003c/p\u003e\n\u003cp\u003eEmma kept her mouth shut, a thought suddenly\u003c/p\u003e\n\u003cp\u003eswimming into her mind. While waiting for Sutton at Sabino Canyon, she’d seen a man she recognized from Sutton’s Facebook page as Charlotte’s father. He’d seemed flustered, and later, Emma found out Charlotte thought he was away on business.\u003c/p\u003e\n\u003cp\u003eBut she didn’t dare say it, instead maneuvering quietly around two rocks.\u003c/p\u003e\n\u003cp\u003e“Freddy’s the lie!” Gabby whooped final y.\u003c/p\u003e\n\u003cp\u003e“Drink up, Gabby!” Charlotte crowed. “I was in the haunted house and felt these hands behind me. Someone spun me around and planted one right on my lips. It was total y Freddy—I saw his freaky nails. He wasn’t a bad kisser, Mads.”\u003c/p\u003e\n\u003cp\u003eMadeline snorted. “You can have him!”\u003c/p\u003e\n\u003cp\u003eNo one asked Charlotte which one the lie was. After Gabby drank her penalty shot, Madeline said, “Your turn, Sutton.”\u003c/p\u003e\n\u003cp\u003eEmma took a deep breath and racked her brain for what she could say about Sutton. But then she had another idea.\u003c/p\u003e\n\u003cp\u003e“Okay. One: I worked at a rol er coaster in Las Vegas one summer,” she started.\u003c/p\u003e\n\u003cp\u003e“Lie,” Charlotte said automatical y, cutting her off. “You’ve never worked in Vegas.”\u003c/p\u003e\n\u003cp\u003e“You’re just trying to get drunk, aren’t you, Sutton?”\u003c/p\u003e\n\u003cp\u003eMadeline passed her the bottle. Emma smiled to herself, but didn’t bother correcting them.\u003c/p\u003e\n\u003cp\u003eThey walked on. A lone coyote howled in the distance. A cactus needle scraped Emma’s shin. Then Gabby turned around and looked at them from the front of the line. “Am I next? One: My sister and I cheated to get on the Hal oween dance court. Two: Kevin and I made out in the haunted house right by the jar ful of fake eyebal s. And three . . .”\u003c/p\u003e\n\u003cp\u003eShe paused for effect. Crickets chirped. “I once touched a dead body.”\u003c/p\u003e\n\u003cp\u003eThe wind shrieked in Emma’s ears, and her heart leapt to her throat.\u003c/p\u003e\n\u003cp\u003eI shivered. Was it my body? More than ever before, I needed Emma—I needed her to nail Gabby and Lili and expose my murder. I needed them to go down for what they’d done.\u003c/p\u003e\n\u003cp\u003eLaurel sniffed. “A dead body? Yeah, right.”\u003c/p\u003e\n\u003cp\u003eBlood pulsed in Emma’s ears. It took everything she had to keep her feet moving forward, because if she tried to turn back, she might get lost . . . or worse.\u003c/p\u003e\n\u003cp\u003e“But if that’s the lie, that means you cheated to get on the court,” Madeline murmured. “You couldn’t do that, could you?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, could I?” Gabby taunted. She twisted around and stared straight at Emma. Emma couldn’t see her features, but she could tel Gabby was smirking. “What do you think I’m capable of, Sutton?”\u003c/p\u003e\n\u003cp\u003eSuddenly, the trail hit an abrupt dead end, and the girls stopped short. Instead of a hot spring burbling before them, they stood at the edge of a cliff. Pebbles cascaded over the side. The faded light showed silhouettes of criss-crossing branches below. It was too dark to tel how far of a drop it was.\u003c/p\u003e\n\u003cp\u003eA gust of wind howled along the trail, rustling dead leaves at Emma’s feet, and she realized with a jolt how wrong she’d been to think she could handle Gabby. They were in the desert with no flashlights and no cel phone service. One wrong step, one stumble, and Emma would become the headline Gabby and Lili wanted: Teen Dies in Tragic Desert Accident. It was the perfect scenario, real y. Because if Emma died out here, everyone would think Sutton Mercer met her end during an il -fated drinking game. There would no longer be a murder to cover up, no reason for anyone to take Sutton’s place. It would al just be over.\u003c/p\u003e\n\u003cp\u003e“Uh, Gabby?” Madeline shuffled her feet. “Did we take a wrong turn?”\u003c/p\u003e\n\u003cp\u003e“Nope.” Gabby smacked the flashlight she was holding and tried the switch again, but it stil didn’t work. “The path continues on the other side of this cliff. It’s a real y easy jump, I swear.”\u003c/p\u003e\n\u003cp\u003eGabby pointed a few feet in the distance. A ravine separated one side of the trail from the other.\u003c/p\u003e\n\u003cp\u003e“I’m not jumping,” Emma said in a shaking voice.\u003c/p\u003e\n\u003cp\u003e“Yes, you are.” Gabby sounded amused. “It’s the only way to get to the springs.”\u003c/p\u003e\n\u003cp\u003eA pair of eyes glowed from a tree branch above Emma’s head. She made out the shape of a great horned owl. Madeline pushed around them. “Let’s just get there already, okay? I’m sick of hiking.” She held on to her backpack straps and did a graceful, bal et-dancer leap over the chasm, clearing it easily. “Piece of cake!” she yel ed from the other side.\u003c/p\u003e\n\u003cp\u003eGabby let Charlotte go next, then Laurel. But when Emma tried to edge past her, Gabby stuck out her arm to stop her.\u003c/p\u003e\n\u003cp\u003e“Not so fast,” she said in a low voice.\u003c/p\u003e\n\u003cp\u003eEmma’s stomach dropped to her feet. This was it.\u003c/p\u003e\n\u003cp\u003e“Run, Emma!” I screamed at my sister. “Get out of there!”\u003c/p\u003e\n\u003cp\u003eAcross the ravine, the other girls shifted, waiting. “C’mon, guys,” Madeline cal ed out. “What’s the holdup?”\u003c/p\u003e\n\u003cp\u003eSlowly, Gabby reached out and grabbed Emma’s wrist. Emma flinched. What was going to happen next crystal ized before her: Gabby was going to throw her over the side of the cliff. She was going to kil her swiftly and neatly in a matter of seconds, and then tel everyone that Sutton had tripped or stumbled. A new headline formed in Emma’s head: Girl Gets Away With Murder—Twice.\u003c/p\u003e\n\u003cp\u003eAl at once, something broke loose inside Emma’s body. She wasn’t going to die—not tonight. “Get away from me!”\u003c/p\u003e\n\u003cp\u003eshe cried, shoving Gabby backward.\u003c/p\u003e\n\u003cp\u003eRocks cascaded beneath Gabby’s feet. Gabby’s mouth made a smal O. There was a scrambling sound, and her arms wheeled in the air for balance. Time seemed to slow down. Gabby’s sneakers slipped beneath her as though she were skating on ice. She grappled for something to steady herself, but the only things around her were thin tree branches and razor-sharp cacti. A startled screech rang out in the darkness. There was a deafening swoosh of rocks, another shril wail, and then Gabby was fal ing.\u003c/p\u003e\n\u003cp\u003e“Gabby!” Madeline cried, rushing to the edge of the cliff.\u003c/p\u003e\n\u003cp\u003e“Oh my God!” Charlotte screamed.\u003c/p\u003e\n\u003cp\u003eA single wail punctuated the air. A series of crashes sounded, a body smacking against tree branches, jutting rocks, sharp cacti. And then, agonizing moments later, there was a crash, a clear but distinct sound of a heavy fal ing object final y hitting bottom.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eWalled In\u003c/p\u003e\n\u003cp\u003eEmma’s stomach lurched like she was about to throw up.\u003c/p\u003e\n\u003cp\u003e“Oh my God.” She stared at her hands as though she didn’t recognize them. She hadn’t just pushed Gabby. It couldn’t have been her. She was a nice girl, Emma Paxton, not capable of violence, even if the person she’d hurt was about to hurt her.\u003c/p\u003e\n\u003cp\u003e“Jesus, Sutton!” Charlotte pressed her hands to her head. “What did you do?”\u003c/p\u003e\n\u003cp\u003e“Gabby?” Laurel’s voice echoed in the rocky ravine.\u003c/p\u003e\n\u003cp\u003e“Gabby?”\u003c/p\u003e\n\u003cp\u003e“She isn’t dead.” Madeline’s voice shook. “She can’t be. She’s okay down there.”\u003c/p\u003e\n\u003cp\u003eEmma peered over the ravine. She couldn’t see the bottom. She looked at her hands again, and they began to tremble. Al at once she felt horribly disgusted with herself. Who had she become? “I didn’t mean . . .” she sputtered. “I didn’t think . . .” Tears began to rol down her cheeks.\u003c/p\u003e\n\u003cp\u003e“What the hel happened?” Charlotte demanded. “Did you push her?”\u003c/p\u003e\n\u003cp\u003e“No! She grabbed me, and I . . .” Emma cried, the words coming out in a combination of a moan and a sob. “I didn’t think she’d . . .” But she couldn’t say anything more. Had it been an accident, or had her fears and anger gotten the best of her? Had she pushed harder than she thought? Guilt sloshed through her veins. This had to be a mistake. A dream. A nightmare. But then she remembered grabbing Gabby’s taut shoulders and pushing her away. Fresh, terrified tears swarmed her eyes.\u003c/p\u003e\n\u003cp\u003e“Haven’t you put Gabby through enough, Sutton?”\u003c/p\u003e\n\u003cp\u003eCharlotte screamed. “What if she’s hurt?”\u003c/p\u003e\n\u003cp\u003e“I told you, I didn’t mean to do it!” Emma shouted, her head spinning. She squinted through the darkness to the bottom of the ravine. Gabby had to be there, alive, fine. This wasn’t how things were supposed to go. She wasn’t supposed to be the vil ain—Gabby and Lili were, for kil ing Sutton! She was just defending herself! But Sutton’s friends wouldn’t buy that. Neither would the cops—not without proof of what the twins did.\u003c/p\u003e\n\u003cp\u003e“Someone cal nine-one-one,” Laurel yel ed.\u003c/p\u003e\n\u003cp\u003eEmma looked helplessly down at Sutton’s phone.\u003c/p\u003e\n\u003cp\u003e“There’s no service out here!”\u003c/p\u003e\n\u003cp\u003e“What are we going to do?” Madeline shrieked. Laurel pointed to a dark, narrow path that led down the mountain, practical y overgrown with cacti, brambles, and shrubs. “We have to get to her. We have to see if she’s okay.”\u003c/p\u003e\n\u003cp\u003eLaurel bushwhacked through the brush and started down the slope, using her cel phone as a dim flashlight. Emma leapt over the ravine and fol owed them. Cactus spines poked her arms, insinuating their way under her skin, but she felt impervious to the pain. It was an accident, Emma repeated over and over to herself, but a tiny voice inside her kept crying, Was it?\u003c/p\u003e\n\u003cp\u003e“Gabby?” Laurel cal ed out.\u003c/p\u003e\n\u003cp\u003e“Gabs!” Madeline screamed.\u003c/p\u003e\n\u003cp\u003eNo answer. A chil y wind gusted, piercing through Emma’s thin sweater.\u003c/p\u003e\n\u003cp\u003e“What if she’s unconscious when we get to her?” Laurel sobbed. “Does anyone know CPR?”\u003c/p\u003e\n\u003cp\u003eCharlotte clutched a tree branch that looked moments away from snapping with the weight of her grasp. “How wil we be able to cal an ambulance? What if she’s having a seizure?”\u003c/p\u003e\n\u003cp\u003e“The doctor said her medicine would prevent that, right?”\u003c/p\u003e\n\u003cp\u003eLaurel said, sounding completely unconvinced.\u003c/p\u003e\n\u003cp\u003e“What if she forgot to take it today?” Madeline asked, her voice shaking.\u003c/p\u003e\n\u003cp\u003eCharlotte crept careful y down the path, avoiding a spearshaped rock that jutted from a patch of dirt. Again Emma tried an outgoing cal on her cel phone. The other girls did, too, but no one could get a signal. Crack. Emma stopped short and looked around. “Gabby?”\u003c/p\u003e\n\u003cp\u003eshe cal ed hopeful y. No answer.\u003c/p\u003e\n\u003cp\u003eThe girls kept going. After another ten minutes of stumble-walking down the steep slope, they final y arrived at the bottom of the ravine. It looked like a dried-out riverbed, the sides wal ed in by craggy black rock, the bottom smooth and sandy. The air was so calm that it felt like they were beneath a dome. Stars twinkled dimly in the sky. Muddy moonlight leached through gray clouds. They were absolutely hidden here. They could die and never be found.\u003c/p\u003e\n\u003cp\u003eJust like I had. In fact, this seemed like a perfect place to hide my body. I waited to feel a tingle of recognition, a cosmic message that it was here. . . .\u003c/p\u003e\n\u003cp\u003e“Gabs?” Madeline screamed. “Where are you?”\u003c/p\u003e\n\u003cp\u003e“She’s not here, guys.” Charlotte slumped to a rock on the other side of the riverbed. “We must be in the wrong spot.”\u003c/p\u003e\n\u003cp\u003eEmma blinked into the bluish darkness. As far as she could tel , there was nothing on the ground. Certainly not a body. A cold, clammy feeling overcame her, and she sank to her knees. Al at once, she couldn’t breathe. Madeline stood over her. “Are you okay?” \u003c/p\u003e","sourceLink":"https://allnovel.net/never-have-i-ever-the-lying-game-2/page-29.html","bookId":2394,"creation":"Oct 5, 2019 10:27:01 AM","modification":"Oct 5, 2019 10:27:01 AM"}
