{"id":73132,"no":32,"title":"Page 32","content":"\u003cp\u003e“Maybe even two exceptions,” Charlotte added. Laurel nodded.\u003c/p\u003e\n\u003cp\u003eThe Twitter Twins clasped hands and jumped up and down as if they’d just won American Idol. “We knew it! We knew you’d let us in!”\u003c/p\u003e\n\u003cp\u003e“I suppose we have an induction ceremony to perform,”\u003c/p\u003e\n\u003cp\u003eCharlotte announced. “Your official entrée into the Lying Game.”\u003c/p\u003e\n\u003cp\u003e“You’l get to pick executive titles,” Madeline said. “I’m Empress of Style. Sutton’s Executive President and Diva.”\u003c/p\u003e\n\u003cp\u003e“I want to be Mistress of Awesomeness,” Gabby piped up immediately, as if she’d been thinking about this for a while.\u003c/p\u003e\n\u003cp\u003e“I’l be High Princess,” Lili chimed in.\u003c/p\u003e\n\u003cp\u003e“There are a bunch of rules, too,” Charlotte said. “Which includes no lying during games like Never Have I Ever and Two Truths and a Lie.” She fake-coughed out the name Gabby into her palm.\u003c/p\u003e\n\u003cp\u003e“I didn’t lie!” Gabby protested. “I told two truths! The false one was the dead body. I would never touch something dead.” She shuddered.\u003c/p\u003e\n\u003cp\u003eMadeline shifted onto one hip. “So you cheated to get on the Homecoming Court?”\u003c/p\u003e\n\u003cp\u003eLili made a smal , embarrassed eep, but Gabby shrugged. “Guilty as charged. We hacked into the site and voted for ourselves hundreds of times. Told you guys we’re smarter than you think.”\u003c/p\u003e\n\u003cp\u003e“I guess you are.” Emma hiked her backpack higher on her shoulder. “I don’t know about you, but I’ve had enough camping for one night. I think the hot springs can wait for another day.”\u003c/p\u003e\n\u003cp\u003e“Let’s get the hel off this freaky mountain.” Madeline grabbed Gabby’s flashlight and shone it on the trail. “You know the way back, right?”\u003c/p\u003e\n\u003cp\u003e“But of course!” Gabby tril ed.\u003c/p\u003e\n\u003cp\u003eAs they started up the ridge, another thought popped into Emma’s mind. She pul ed Gabby aside. “It was an awesome prank. But, um, next time? Maybe don’t cut a light fixture quite so close to my head.”\u003c/p\u003e\n\u003cp\u003eGabby stopped. Even in the blue-black darkness, Emma could see consternation wash over her face. “You mean that light in the auditorium? We didn’t do that! God, Sutton!\u003c/p\u003e\n\u003cp\u003eWe’re not insane!”\u003c/p\u003e\n\u003cp\u003eThen she moved ahead of Emma, her long ponytail swishing. Emma stood stil a moment, a cold realization vibrating al the way down to her fingertips. Of course Lili and Gabby hadn’t cut that light to fal on her. Someone else had.\u003c/p\u003e\n\u003cp\u003eMy kil er.\u003c/p\u003e\n\u003cp\u003eChapter 32\u003c/p\u003e\n\u003cp\u003eThe Moment We’ve Been\u003c/p\u003e\n\u003cp\u003eWaiting For\u003c/p\u003e\n\u003cp\u003eBzzz. Bzzz.\u003c/p\u003e\n\u003cp\u003eEmma opened her eyes and looked around. She was lying on a sleeping bag on the floor of the Mercers’ family den. The blue light of the muted TV flickered across the room, bags and containers of Thai takeout lay abandoned on the coffee table, and several dog-eared copies of Us Weekly and Life \u0026amp; Style were facedown on the carpet. The time on the cable box said 2:46 A.M. Charlotte, Madeline, and Laurel slept beside her, and Gabby and Lili were curled up near the fireplace, their brand-new Lying Game membership cards stil clutched in their hands. Bzzz.\u003c/p\u003e\n\u003cp\u003eSutton’s phone glowed next to Emma’s pil ow. The screen said ETHAN LANDRY. Emma was immediately alert. Emma slid out of the sleeping bag and padded into the hal . The house was eerily stil and dark, the only sound the rhythmic ticking of the grandfather clock in the foyer.\u003c/p\u003e\n\u003cp\u003e“Hel o?” she whispered into the phone.\u003c/p\u003e\n\u003cp\u003e“There you are!” Ethan cried on the other end. “I’ve been cal ing al night!”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Didn’t you get my messages?” Ethan sounded out of breath, as if he’d been running. “I need to talk to you!”\u003c/p\u003e\n\u003cp\u003eOh, now you want to talk to me, Emma thought, glancing out the window. A familiar red car sat at the curb. She dropped the curtain and pul ed her T-shirt down so that it covered her stomach. “A-are you outside Sutton’s house?”\u003c/p\u003e\n\u003cp\u003eThere was a pause. Ethan sighed. “Yeah. I was driving around, and I saw Madeline’s car in your driveway. Can you come out?”\u003c/p\u003e\n\u003cp\u003eEmma wasn’t sure how to feel about Ethan sitting outside the Mercers’ house in the middle of the night. If it had been anyone else, she would’ve thought it was slightly stalkerish. At least he’d used the phone this time, instead of pebbles. “It’s three A.M.,” she said frostily.\u003c/p\u003e\n\u003cp\u003e“Please?”\u003c/p\u003e\n\u003cp\u003eEmma ran her finger around the lip of a bowl on the hal table. “I don’t know. . . .”\u003c/p\u003e\n\u003cp\u003e“Please, Emma?”\u003c/p\u003e\n\u003cp\u003eThe area around Emma’s temples began to ache. Her muscles were stiff from squeezing into the cave. She had no energy to play hard to get right now. “Fine.”\u003c/p\u003e\n\u003cp\u003eThe lights on Ethan’s car died as Emma padded across the yard. “Why didn’t you answer my cal s?” he asked when she stepped off the curb.\u003c/p\u003e\n\u003cp\u003eEmma peered at Sutton’s iPhone. Sure enough, there were six messages and missed cal s from Ethan. She hadn’t noticed them before—she’d been having too much fun with Sutton’s friends, giving Gabby and Lili makeovers, drinking Kahlua shots, playing Dance Dance Revolution, and, of course, inducting Gabby and Lili into the Lying Game.\u003c/p\u003e\n\u003cp\u003e“I was busy,” she answered, a hard edge to her voice. “I figured you were busy, too.”\u003c/p\u003e\n\u003cp\u003eEthan squared his shoulders and opened his mouth, but Emma held up her hand to stop him. “Before you say anything, it’s not Gabby or Lili. They aren’t who I thought they were.” She was careful to use I instead of we, like it was her investigation only, not both of theirs. Ethan frowned. “What happened?”\u003c/p\u003e\n\u003cp\u003eEmma took a breath and told him about the night. “It was just a prank,” she concluded. “I mean, Gabby and Lili were definitely mad about the seizure thing, but they aren’t Sutton’s kil ers. Al they wanted was to be part of the Lying Game.”\u003c/p\u003e\n\u003cp\u003eEthan leaned against the door of the car. A few houses down, a dog let out a lonely howl.\u003c/p\u003e\n\u003cp\u003e“They didn’t drop that light on my head either,” Emma went on, a shiver trailing along her spine. “I think Sutton’s real kil er did.”\u003c/p\u003e\n\u003cp\u003e“But Gabby and Lili made so much sense. You said yourself Lili went back upstairs to retrieve her phone just before the light fel .”\u003c/p\u003e\n\u003cp\u003eEmma shrugged. “Maybe the kil er noticed that, too, hoping I’d suspect Gabby and Lili because of what Sutton did to them.” She winced, thinking how she’d taken the bait. Even if Gabby had only fake-fal en, even if it was al a ruse, Emma had stil lashed out in anger. What if things had gone wrong and the force of Emma’s push had real y kil ed her?\u003c/p\u003e\n\u003cp\u003eShe’d never felt so out of control.\u003c/p\u003e\n\u003cp\u003eEthan shifted his weight and coughed into his fist. “The reason I’ve been trying to get ahold of you is that Sam told me something real y . . . strange. At the end of the night, she got kind of fed up and asked what I was doing hanging out with someone like Sutton. She was like, ‘I heard Sutton Mercer hit someone with her car and almost kil ed them.’”\u003c/p\u003e\n\u003cp\u003e“What?” Emma shot up. “Who?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. She wouldn’t say. Or maybe she didn’t know.”\u003c/p\u003e\n\u003cp\u003eEmma squinted. “Had you heard anything like this before?”\u003c/p\u003e\n\u003cp\u003eEthan shrugged. “Maybe it’s not true.”\u003c/p\u003e\n\u003cp\u003eEmma’s heart pounded. Who could Sutton have almost kil ed with her car—and when? How could she not have known something so huge? “Maybe it is true,” she said hesitantly. “I went to the impound to pick up Sutton’s car earlier this week . . . but it wasn’t there. Sutton signed it out . . . on the thirty-first.”\u003c/p\u003e\n\u003cp\u003e“The night she died?” Ethan’s Adam’s apple bobbed nervously.\u003c/p\u003e\n\u003cp\u003e“Yes. Not a single one of Sutton’s friends knew she’d picked up the car.” Emma tied her hair in a tight knot. “What if she had a reason not to tel anyone she picked it up?\u003c/p\u003e\n\u003cp\u003eMaybe this rumor about her almost kil ing someone with her car is true. Maybe she tried to run someone down on the thirty-first.”\u003c/p\u003e\n\u003cp\u003e“Whoa, whoa, whoa.” Ethan waved his hands across each other. “You’re jumping to conclusions. Sutton wasn’t always nice, but she wasn’t a kil er.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I wanted to add. Now Emma thought I was a hitand-run kind of girl?\u003c/p\u003e\n\u003cp\u003eEmma took a deep breath. Maybe she was letting her imagination run away with her. “Stil ,” she said. “We need to find Sutton’s car. We need to figure this out.”\u003c/p\u003e\n\u003cp\u003e“So it’s we again, is it?” Ethan asked, smiling. “I’m al owed to be part of the investigation after al ?”\u003c/p\u003e\n\u003cp\u003eEmma stared into the distance over his shoulder. “I guess.” But embarrassment and rejection stil pulsed inside her. This was what scared her about getting too close to someone: al the mixed signals, al the misinterpreted gestures, al the emotions that became overamplified because something big was on the line. It was so much easier to steer clear of al that. It prevented so much potential pain.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about Sam,” Ethan said, reading her thoughts.\u003c/p\u003e\n\u003cp\u003e“But she real y is just a friend.”\u003c/p\u003e\n\u003cp\u003e“I don’t care,” Emma said quickly, trying to look like she meant it.\u003c/p\u003e\n\u003cp\u003e“Wel , I want you to care.” Ethan’s voice cracked. “I mean, I want you to care that we’re not together.”\u003c/p\u003e\n\u003cp\u003e“You can go out with her if you want. It’s obvious she likes you.”\u003c/p\u003e\n\u003cp\u003eAn amused laugh escaped from Ethan. “I highly doubt she likes me after tonight. I spent the whole time asking questions about you, avoiding you, coming to talk to you in the parking lot, or obsessing over whether or not you were okay.”\u003c/p\u003e\n\u003cp\u003eEmma winced at the memory. “Yeah, but then when she came looking for you, you jumped up in a heartbeat. You ditched me.”\u003c/p\u003e\n\u003cp\u003e“She was my date!” Ethan raised his palms to the air. “I had to be polite! And even after I went back to her, I just asked more questions. At the end of the dance, she was like, ‘I’m not the girl you want.’ And it’s true.”\u003c/p\u003e\n\u003cp\u003eEmma snuck a peek at him. A sincere, earnest look flooded Ethan’s face. “I know you have your doubts,” he continued softly. “But I can’t let you go. I can’t stand by and just be friends.”\u003c/p\u003e\n\u003cp\u003eHe reached over and took Emma’s hands. A tingly sensation snapped through Emma’s insides. As she stared into Ethan’s bright, loyal eyes, the tightly closed fist inside of her slowly began to open. Screw al her baggage. Screw worrying about getting hurt or emotions clogging up the investigation. Ethan was the most amazing guy Emma had ever met. What was the point of living if she didn’t take some risks every once in a while? And maybe, just maybe, this was something Sutton would have wanted for her, too, if she were stil alive: to go after Ethan, even if the prospects were scary, even if she was putting herself out on a limb. Sutton would encourage her to go after what she wanted anyway.\u003c/p\u003e\n\u003cp\u003eOf course I would. Of course I was.\u003c/p\u003e\n\u003cp\u003eLeaning forward, Emma brushed her lips softly against Ethan’s. Ethan slid his hands up to her shoulders and kissed her more deeply. Emma’s whole body sparked and came alive. Their mouths fit perfectly together. Her head started to spin. For the first time in her entire life, Emma just let go. \u003c/p\u003e","sourceLink":"https://allnovel.net/never-have-i-ever-the-lying-game-2/page-32.html","bookId":2394,"creation":"Oct 5, 2019 10:27:01 AM","modification":"Oct 5, 2019 10:27:01 AM"}
