{"id":72935,"no":44,"title":"Page 44","content":"\u003cp\u003e“Between us. Promise me we . . .” Spencer trailed off to choose her next words carefully. “We don’t fight anymore. We help each other. I really miss you.”\u003c/p\u003e\n\u003cp\u003eSuddenly, the doorbell chimed. Spencer felt a thrill of anticipation. Could it be . . . ?\u003c/p\u003e\n\u003cp\u003eShe jumped up, licking her lips and smoothing her hair as she raced to the door. “Play it cool,” Melissa reminded her.\u003c/p\u003e\n\u003cp\u003eShe flung open the door and broke into a smile. It was Colin, his chiseled jawline and straight, strong nose casting shadows under his neck from the porch light.\u003c/p\u003e\n\u003cp\u003e“Hey.” His mouth opened up into a slow, smooth smile. Dazzled, Spencer ushered him inside. “Ramona and I are over.”\u003c/p\u003e\n\u003cp\u003eThose words should have made Spencer swoon with joy. Only Colin had breezed right past Spencer and was now standing close to Melissa, a look of rapture on his face.\u003c/p\u003e\n\u003cp\u003eSpencer stood frozen in place. Why was he telling Melissa all this? She didn’t care. Spencer cared.\u003c/p\u003e\n\u003cp\u003e“Really?” Melissa whispered.\u003c/p\u003e\n\u003cp\u003e“I couldn’t stop thinking about you,” Colin said in a husky voice, taking Melissa’s hand.\u003c/p\u003e\n\u003cp\u003eSpencer reeled back like she’d been punched. The antique clock on the mantel in the living room chimed twice. What was going on? Was this a joke?\u003c/p\u003e\n\u003cp\u003e“Can we take a walk? It’s a beautiful night,” Colin suggested.\u003c/p\u003e\n\u003cp\u003e“Let me get my purse. Wait here,” Melissa breathed. She turned and darted up the stairs. Spencer glanced at Colin, who was staring dreamily after her. She let out a tiny squeak and then took off after her sister, two steps at a time, grateful for all the laps her coaches had made her run.\u003c/p\u003e\n\u003cp\u003eShe burst into Melissa’s bedroom, where she was coolly applying some lip gloss, her purse flung over her shoulder.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Spencer cried. She didn’t even bother keeping her voice down.\u003c/p\u003e\n\u003cp\u003eSpencer watched a nasty smile spread across Melissa’s face in the mirror. “What does it look like, Spence?”\u003c/p\u003e\n\u003cp\u003e“But . . .” Spencer tried to speak, but no sounds came out. “But you gave me all that advice on how to get him.”\u003c/p\u003e\n\u003cp\u003eMelissa shrugged. “Everyone knows that if you really want a guy to notice you, just pretend he doesn’t exist.”\u003c/p\u003e\n\u003cp\u003eSpencer’s gut churned so violently, she was afraid she might puke up the Hawaiian feast.\u003c/p\u003e\n\u003cp\u003e“But I thought you and I were friends!” Spencer whimpered, tears rushing to her eyes.\u003c/p\u003e\n\u003cp\u003e“We were never friends,” Melissa snapped, dropping her gloss onto her dresser, where it rolled around and then off onto the lush carpet. She glared at Spencer. “I never forgave you for anything you’ve done to me. And I never will.”\u003c/p\u003e\n\u003cp\u003eShe shot Spencer a cruel smile, then stalked out of the bedroom, down the stairs, and out into the night with Colin, leaving Spencer far behind.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eNew Year, New Girl\u003c/p\u003e\n\u003cp\u003eThe next morning, Spencer opened her eyes to lovely golden sunshine streaming through the window. Birds chirped in the trees. A bicycle bell jingled on the street. The surf pounded loudly, and there was a soothing smell of freshly brewed coffee and French toast in the air. It was another glorious morning in Longboat Key.\u003c/p\u003e\n\u003cp\u003eAnd then she remembered. Melissa.\u003c/p\u003e\n\u003cp\u003eShe shot up in bed, the details of the night rushing back to her like black sludge spewing out of a spigot. How Colin had arrived, dashing and gorgeous, to profess his love for Melissa. The twist of her sister’s lips as she told Spencer she’d never forgiven her. Spencer had heard them talking on the back patio long into the night, finally turning her sound machine up to level ten to drown out their laughter.\u003c/p\u003e\n\u003cp\u003eIt felt like a punch to the chest. Melissa had never wanted to be friends. She hated Spencer, just like always. The worst thing about all of it was that Spencer had begun to hope that things really could change between them—no, that they had changed.\u003c/p\u003e\n\u003cp\u003eShe pushed her feet into her slippers and padded down the stairs, praying that Melissa wasn’t in the kitchen. Thankfully, only her mother was sitting at the table, thumbing through the newspaper.\u003c/p\u003e\n\u003cp\u003e“Morning, sweetie.” Spencer’s mother broke the silence. “Did you have fun last night?”\u003c/p\u003e\n\u003cp\u003eSpencer glanced at her. She was still wearing her robe and pajamas. There was something so vulnerable about seeing her without makeup on. She felt her chin wobble. “Not really,” she blurted out before she could stop herself.\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eSpencer tried to keep her lips closed, but the need to purge was too great. She spilled the whole story about Colin, explaining that she’d met an amazing boy on vacation, and it looked like he really liked her, but then someone had stolen him away at the last minute. The only detail she left out was that someone was Melissa.\u003c/p\u003e\n\u003cp\u003eWhen she got to the end of the story, recounting how she’d seen Colin go off with the other girl, her mother folded her hands on top of the table. “So what are you going to do about it?”\u003c/p\u003e\n\u003cp\u003eSpencer blinked. “What can I do about it?” The decision had been made: Melissa won, yet again. “I lost,” she went on. “I should just lick my wounds and move on.”\u003c/p\u003e\n\u003cp\u003eHer mother’s brows knitted together. “Since when do you look at the world that way? Where’s the girl who does anything and everything to win?”\u003c/p\u003e\n\u003cp\u003eSpencer shrugged. “That hasn’t gotten me far in the past.”\u003c/p\u003e\n\u003cp\u003eHer mother clucked her tongue. “If you think this boy is right for you, you have to fight for him.”\u003c/p\u003e\n\u003cp\u003eThere was a defiant, stern look on her mother’s face, and her left hand was curled into a tight fist like she was getting ready to punch someone. “You think so?” Spencer asked. Her voice cracked.\u003c/p\u003e\n\u003cp\u003e“Absolutely.” Her mother’s chin-length blond hair bobbed as she nodded. “You need to do everything in your power to throw that other girl out of the picture. You have to fight for what you want.”\u003c/p\u003e\n\u003cp\u003eSomething about her tone made Spencer wonder if she was talking from experience. “Does this have anything to do with you and Dad?” she asked in a tiny voice.\u003c/p\u003e\n\u003cp\u003eSpencer’s mother turned away, becoming transfixed with the bird feeder on the patio. After a moment she breathed in, looking like she was going to say something, but then seemed to change her mind and shut her mouth.\u003c/p\u003e\n\u003cp\u003e“Are you guys having . . . problems?” Spencer tried again.\u003c/p\u003e\n\u003cp\u003e“It’s nothing to worry about, honey.” Her mother stood and gave Spencer a tight smile. “Now, do you want a croissant? Maybe I can make you some French toast? Dad picked up that delicious challah bread from Tommy’s . . .”\u003c/p\u003e\n\u003cp\u003eSpencer murmured that she wasn’t hungry, then watched as her mother drifted distractedly out of the room. It was hard to know whether her parents were really on the rocks or if this was just backlash from everything that had happened this fall.\u003c/p\u003e\n\u003cp\u003eShe stared at her mother’s cup of coffee, which she’d left on the table, and then at a cardigan sweater draped over the back of one of the chairs. It was Melissa’s; she’d worn it to Culpeper’s steak house the other night. She balled it in her hands, the soft cashmere bending to her will.\u003c/p\u003e\n\u003cp\u003eHer mother’s words swirled through her mind. You have to fight for what you want. Maybe there was some truth to that. Before Melissa had come onto the scene, Colin had been into Spencer—she was sure of it.\u003c/p\u003e\n\u003cp\u003eShe stood up, feeling the effects of her mom’s pep talk zooming through her veins. Forget Melissa’s stupid advice—Spencer was going to get Colin back her way. Dirty. Ruthlessly. By whatever means necessary.\u003c/p\u003e\n\u003cp\u003eShe sauntered out of the kitchen and up the stairs to her room, suddenly rejuvenated. Little did Melissa know it, but the new year was going to bring forth a new Spencer. And she was playing to win.\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003eBattle on the Beach\u003c/p\u003e\n\u003cp\u003eBy the time Spencer stepped onto the beach later that morning, the temperature had climbed to almost ninety degrees. Though Nana’s house was right on the ocean, it wasn’t in the best spot for sunbathing or swimming—that was what the public beach about a quarter mile up the shore was for. If Colin and Melissa were at the beach today, they would be there. When Spencer walked down the wooden steps and scanned the sand, she spied the two of them just to the left of the lifeguard mound, snuggling together on a shared striped blanket. Bingo.\u003c/p\u003e\n\u003cp\u003eShe ducked behind the lifeguard post so they wouldn’t see her. Melissa was wearing a polka-dotted bikini and was rubbing sunscreen on Colin’s back. She said something in his ear, and the two of them tittered. Spencer wondered if they were talking about her. Maybe Melissa was telling him how she’d fed Spencer all those stupid Cosmo rules to win Colin over. Or maybe Melissa was laughing about how she’d stolen Wren back from Spencer, or about how her little sister was too stupid to write her own AP Econ essays.\u003c/p\u003e\n\u003cp\u003eWell, two could play at that game.\u003c/p\u003e\n\u003cp\u003eShe smoothed out her towel on the hot sand. The beach was crowded, with a ton of people in the water, flying kites, and playing beach volleyball around a net set up near the dunes. A big wave crashed, and suddenly Spencer heard a lilting giggle behind her. She glanced over her shoulder, feeling a dart of worry. That laugh sounded so familiar, like a haunting dream. But it couldn’t be A.\u003c/p\u003e\n\u003cp\u003eSpencer plucked her cell phone from her bag. She knew just the person to remind her that all was fair in love and war. She shot a quick text to Hanna, asking for inspiration. But even after a few minutes, Hanna didn’t write back.\u003c/p\u003e\n\u003cp\u003eSpencer was going to have to do this on her own. Like everything, she thought bitterly.\u003c/p\u003e\n\u003cp\u003eShe stood and walked over to Melissa’s towel. She cast a long shadow over her sister, but Melissa wouldn’t look up from her issue of Vanity Fair, not even when Spencer cleared her throat. Finally, Colin shaded his forehead and noticed her.\u003c/p\u003e\n\u003cp\u003e“Oh. Hey, Spencer.” He awkwardly rubbed the top of his head, a sheepish look on his face.\u003c/p\u003e\n\u003cp\u003e“Hey,” Spencer said tersely. She thrust the phone at Melissa. “There’s another article about Ian. Your boyfriend.”\u003c/p\u003e\n\u003cp\u003eMelissa flipped a page and pushed her sunglasses up her nose, not even flinching.\u003c/p\u003e\n\u003cp\u003e“The felon who’s in jail,” Spencer added, dangling the phone under Melissa’s nose. She’d pulled up a piece about him from the Philadelphia Inquirer. “His lawyers just made a statement to the press.”\u003c/p\u003e\n\u003cp\u003eColin squinted at the phone, then glanced at Melissa in question. Melissa coolly rolled onto her side and took a sip from a can of Diet Coke. After a moment, Colin shrugged and lay down next to her, ignoring Spencer, too.\u003c/p\u003e\n\u003cp\u003eSpencer lingered over them for another few seconds, phone outstretched, but then started to feel awkward. Melissa had probably briefed Colin that Spencer would be jealous and looking for revenge. Don’t believe a word she says, she’d probably told him.\u003c/p\u003e\n\u003cp\u003eSpencer dropped her phone back into her bag, ditched her sunglasses, and marched down to the ocean to cool off. After weaving around a bunch of little kids playing in the surf and a group of guys throwing a waterlogged Nerf ball, she dove headfirst into a wave. The water was cool, refreshing, and salty, and she surfaced and looked back at the shore. Melissa and Colin were now standing in the shallow water, wetting their feet. Melissa stared out at Spencer in the big waves, but when she noticed Spencer looking, she quickly turned her head away.\u003c/p\u003e\n\u003cp\u003e“Hi.” A pudgy boy who looked to be about thirteen years old and who was wearing a soggy T-shirt and a large snorkeling mask stared at Spencer from a few feet away. “You’re pretty.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-little-secrets-pretty-little-liars-4-5/page-44.html","bookId":2392,"creation":"Oct 5, 2019 10:26:02 AM","modification":"Oct 5, 2019 10:26:02 AM"}
