{"id":5450,"no":18,"title":"Chapter 18","content":"18:1\u0026nbsp;[hgb] \u0026nbsp;唉 ， 古 实 河 外 翅 膀 刷 刷 响 声 之 地 ，\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Woe to the land shadowing with wings, which is beyond the rivers of Ethiopia:\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Ho! land of the sounding of wings, on the other side of the rivers of Ethiopia:\n\u003cbr\u003e18:2\u0026nbsp;[hgb] \u0026nbsp;差 遣 使 者 在 水 面 上 ， 坐 蒲 草 船 过 海 。 先 知 说 ， 你 们 快 行 的 使 者 ， 要 到 高 大 光 滑 的 民 那 里 去 。 自 从 开 国 以 来 那 民 极 其 可 畏 ， 是 分 地 界 践 踏 人 的 ， 他 们 的 地 有 江 河 分 开 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;That sendeth ambassadors by the sea, even in vessels of bulrushes upon the waters, saying, Go, ye swift messengers, to a nation scattered and peeled, to a people terrible from their beginning hitherto; a nation meted out and trodden down, whose land the rivers have spoiled!\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Which sends its representatives by the sea, even in ships of papyrus on the waters. Go back quickly, O representatives, to a nation tall and smooth, to a people causing fear through all their history; a strong nation, crushing down its haters, whose land is cut through by rivers.\n\u003cbr\u003e18:3\u0026nbsp;[hgb] \u0026nbsp;世 上 一 切 的 居 民 ， 和 地 上 所 住 的 人 哪 ， 山 上 竖 立 大 旗 的 时 候 ， 你 们 要 看 。 吹 角 的 时 候 ， 你 们 要 听 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;All ye inhabitants of the world, and dwellers on the earth, see ye, when he lifteth up an ensign on the mountains; and when he bloweth a trumpet, hear ye.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;All you peoples of the world, and you who are living on the earth, when a flag is lifted up on the mountains, give attention; and when the horn is sounded, give ear.\n\u003cbr\u003e18:4\u0026nbsp;[hgb] \u0026nbsp;耶 和 华 对 我 这 样 说 ， 我 要 安 静 ， 在 我 的 居 所 观 看 ， 如 同 日 光 中 的 清 热 ， 又 如 露 水 的 云 雾 在 收 割 的 热 天 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;For so the LORD said unto me, I will take my rest, and I will consider in my dwelling place like a clear heat upon herbs, and like a cloud of dew in the heat of harvest.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;For this is what the Lord has said to me: I will be quiet, watching from my place; like the clear heat when the sun is shining, like a mist of dew in the heat of summer.\n\u003cbr\u003e18:5\u0026nbsp;[hgb] \u0026nbsp;收 割 之 先 ， 花 开 已 谢 ， 花 也 成 了 将 熟 的 葡 萄 ， 他 必 用 镰 刀 削 去 嫩 枝 ， 又 砍 掉 蔓 延 的 枝 条 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;For afore the harvest, when the bud is perfect, and the sour grape is ripening in the flower, he shall both cut off the sprigs with pruning hooks, and take away and cut down the branches.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;For before the time of getting in the grapes, after the opening of the bud, when the flower has become a grape ready for crushing, he will take away the small branches with knives, cutting down and taking away the wide-stretching branches.\n\u003cbr\u003e18:6\u0026nbsp;[hgb] \u0026nbsp;都 要 撇 给 山 间 的 鸷 鸟 ， 和 地 上 的 野 兽 。 夏 天 鸷 鸟 要 宿 在 其 上 ， 冬 天 野 兽 都 卧 在 其 中 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;They shall be left together unto the fowls of the mountains, and to the beasts of the earth: and the fowls shall summer upon them, and all the beasts of the earth shall winter upon them.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;They will be for the birds of the mountains, and for the beasts of the earth: the birds will come down on them in the summer, and the beasts of the earth in the winter.\n\u003cbr\u003e18:7\u0026nbsp;[hgb] \u0026nbsp;到 那 时 这 高 大 光 滑 的 民 ， 就 是 从 开 国 以 来 极 其 可 畏 ， 分 地 界 践 踏 人 的 ， 他 们 的 地 有 江 河 分 开 ， 他 们 必 将 礼 物 奉 给 万 军 之 耶 和 华 ， 就 是 奉 到 锡 安 山 ， 耶 和 华 安 置 他 名 的 地 方 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;In that time shall the present be brought unto the LORD of hosts of a people scattered and peeled, and from a people terrible from their beginning hitherto; a nation meted out and trodden under foot, whose land the rivers have spoiled, to the place of the name of the LORD of hosts, the mount Zion.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;In that time an offering will be made to the Lord of armies from a people tall and smooth, causing fear through all their history; a strong nation, crushing down its haters, whose land is cut through by rivers, an offering taken to the place of the name of the Lord of armies, even Mount Zion. \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/127/1863.html","bookId":178,"creation":"Aug 1, 2019 6:09:13 AM","modification":"Aug 1, 2019 6:09:13 AM"}
