{"id":39387,"no":11,"title":"CHAPTER XI. TRAPPED.","content":"\u0026nbsp;\"Mrs. Craven, I have pleasure in introducing to you one of my oldest friends, Colonel Sharpley.\" \n\u003cdiv\u003e\n As this was the first friend of her husband who had come in her way, his wife regarded the stranger with some curiosity, which, however, was veiled by her quiet manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to meet a friend of yours, Mr. Craven,\" she said, offering her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have invited the colonel to supper, and pass the night with us, Mary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad you did so. I will see that a chamber is got ready.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n After she had left the room, Sharpley looked about him approvingly. \"On my life, Craven, you are well provided for. This house is decidedly comfortable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [97]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the best in the village,\" said Craven, complacently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Evidently, your predecessor had taste as well as money. It is a pity that there is a little legal impediment in the way of your permanent enjoyment of all this luxury.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hush, hush, Sharpley!\" said Mr. Craven, nervously. \"You might be heard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I might, and as that would interfere with my plans as well as yours, I will be careful. By the way, that\u0027s a good idea making me a colonel. It sounds well—Colonel Sharpley, eh? Let me see. I\u0027ll call myself an officer in the English service—served for a while in the East Indies, and for a short period in Canada.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whatever you like. But here\u0027s my step-son coming in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The young man I\u0027m to take charge of. I must ingratiate myself with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Here Frank entered the room. He paused when he saw the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank,\" said Mr. Craven, \"this is my friend, Colonel Sharpley. I believe you have already made his acquaintance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [98]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, I saw him this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t suspect when I first spoke to you that you were related to my old friend, Craven,\" said Sharpley, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharpley was a man not overburdened—in fact, not burdened at all—with principle, but he could make himself personally more agreeable than Mr. Craven, nor did Frank feel for him the instinctive aversion which he entertained for his step-father. The stranger had drifted about the world, and, being naturally intelligent and observing, he had accumulated a fund of information which enabled him to make himself agreeable to those who were unacquainted with his real character. He laid himself out now to entertain Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, my young friend,\" he said, \"how I envy you your youth and hope. I am an old, battered man of the world, who has been everywhere, seen a great deal, and yet, in all the wide world, I am without a home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you traveled much, sir,\" asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been in Europe, Asia, Africa, America and Australia,\" answered Sharpley.\n\u003c/div\u003e \n\u003cdiv\u003e\n [99]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Botany Bay,\" thought Craven, but it was not his cue to insinuate suspicions of his friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much you must have seen!\" said Frank, interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re right; I\u0027ve seen a great deal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you ever been in Switzerland?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I\u0027ve clambered about among the Alps. I tried to ascend Mont Blanc, but had not endurance enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank was interested. He had read books of travels, and he had dreamed of visiting foreign lands. He had thought more than once how much he should enjoy roaming about in countries beyond the sea, but he had never, in his quiet country home, even met one who had made this journey, and he eagerly listened to what Colonel Sharpley had to tell him about these distant lands.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here supper was announced, and the four sat down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you take your tea strong, Colonel Sharpley?\" asked Mrs. Craven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As strong as you can make it. Tea is a favorite drink of mine. I have [100] drunk it in its native land—in fact, everywhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you been in China, Colonel Sharpley?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, madam. I spent three months there—learned to talk broken China a little,\" he added, with a laugh. \"Yes, Mrs. Craven, I have been a rover.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has been telling me about Switzerland, mother,\" said Frank, eagerly. \"How splendid it must be to travel there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going back to Europe in three or four weeks,\" said Sharpley, ready now to spring his trap. \"Were you ever there, Mrs. Craven?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; I am timid about traveling.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was going to ask why you and my friend Craven didn\u0027t pull up stakes and go abroad for a time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid I am getting too old to travel, Colonel Sharpley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Old! my dear madam? Why you\u0027re in the prime of life. If you are getting old, what shall I say about myself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose I am not quite venerable,\" said Mrs. Craven, smiling, \"but [101] I should shrink from the voyage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may persuade her to go some time,\" said Mr. Craven, with a glance at his wife, \"Just now it would be a little inconvenient for me to leave my business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I fancy this young man would like to go,\" said Sharpley, turning to Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed I should,\" said Frank, eagerly. \"There is nothing in the world I should like better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, I have an idea to propose,\" said Sharpley, as if it had struck him; \"if you\u0027ll let him go with me, I will look after him, and at the end of three months, or any other period you may name, I will put him on board a steamer bound for New York. It will do him an immense deal of good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Craven was startled by the suddenness of the proposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How could he come home alone?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He couldn\u0027t leave the steamer till it reached New York, and I am sure he could find his way home from there, or you could meet him at the steamer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [102]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, mother, let me go!\" said Frank, all on fire with the idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would seem lonely without you, Frank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would write twice—three times a week, and I should have ever so much to tell you after I got home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think, Mr. Craven?\" asked his wife, hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it a very good plan, Mary, but, as you know, I don\u0027t wish to interfere with your management of Frank. If you say yes, I have no sort of objection.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Just at that moment Frank felt more kindly toward Mr. Craven than he had ever done before. He could not, of course, penetrate the treachery which he meditated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hardly know what to say. Do you think there would be any danger?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have great confidence in my friend, Colonel Sharpley. He is an experienced traveler—has been everywhere, as he has told you. I really wish I could go myself in the party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This Frank did not wish, though he would prefer to go with Mr. Craven rather than stay at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n [103]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would it not interrupt his studies?\" asked his mother, as a final objection.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Summer is near at hand, and he would have a vacation at any rate. He will probably study all the better after he returns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That I will,\" said Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, if you really think it best, I will consent,\" said Mrs. Craven.\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank was so overjoyed that he jumped from his chair and threw his arms around his mother\u0027s neck. A flush of pleasure came to her cheek, and she felt repaid for the sacrifice she must make of Frank\u0027s society. She knew beforehand that her husband\u0027s company would not go far toward compensating that.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I congratulate you, my young friend,\" said Colonel Sharpley (for we may as well address him by his stolen title), \"upon the pleasure before you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am very much obliged to you, sir, for being willing to take so much trouble on my account.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No need of thanks on that score. The fact is, I shall enjoy the trip all the more in watching your enjoyment. I am rather blase myself, [104] but it will be a treat to me to see what impressions foreign scenes make on you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How soon do you go, sir?\" asked Frank, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me see; this is the fifth. I will engage passage for the nineteenth—that is, if you can get ready at such short notice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No fear of that,\" said Frank, confidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027ll be on hand promptly, you may be sure,\" said Mr. Craven, smiling. \"Really, Frank, we shall miss you very much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said Frank, feeling almost cordial to his step-father; \"but it won\u0027t be long, and I shall write home regularly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n During the evening Frank kept Sharpley busy telling him about foreign parts. Mr. Craven listened, with a crafty smile, watching him as a spider does an entangled fly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s trapped!\" he said to himself\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Frank! How little could he read of the future!\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2968/81713.html","bookId":376,"creation":"Aug 5, 2019 11:21:01 AM","modification":"Aug 5, 2019 11:21:01 AM"}
