{"id":39391,"no":15,"title":"CHAPTER XV. MR. TARBOX IS OBSTINATE.","content":"\u0026nbsp;Early on Wednesday morning, eleven days from the date of sailing, the good steamer which bore our hero as passenger, steamed into the harbor of Liverpool. As may readily be supposed, Frank was on deck, gazing with eager expectation at the great city before him, with its solid docks, and the indications of its wide-spreading commerce. \n\u003cdiv\u003e\n \"Well, Frank, we are almost there,\" said Colonel Sharpley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. Isn\u0027t it glorious!\" exclaimed our hero, with enthusiasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see anything glorious,\" said a voice at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n The speaker was Mr. Tarbox, of Squashboro\u0027, State o\u0027 Maine.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you like it, Mr. Tarbox?\" asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n [134]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Liverpool ain\u0027t a circumstance to New York,\" said the Yankee, with patriotic pride. \"New York\u0027s bigger and finer than this town ever will see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care whether it\u0027s bigger or not,\" said Frank. \"It\u0027s jolly being here. What a splendid time I mean to have.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Enjoy yourself while you may,\" said Sharpley to himself. \"Your time is short.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What tavern are you goin\u0027 to put up at?\" asked Mr. Tarbox.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" said Frank. \"Perhaps Colonel Sharpley can tell you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sharpley turned around, and looked at the Yankee superciliously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I really have not decided,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I\u0027d like to put up at the same,\" said Mr. Tarbox, \"seein\u0027 as I know you. May be we might ride in the same carriage to the tavern.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I prefer not to add to my party, sir,\" said Colonel Sharpley, frigidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you needn\u0027t flare up,\" said Jonathan Tarbox, coolly. \"I\u0027m willin\u0027 to pay my share of the bill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [135]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must decline making any arrangement with you, sir,\" said Sharpley as he moved away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Kinder offish, ain\u0027t he?\" said Mr. Tarbox, addressing Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seems a little so,\" said Frank; \"but I hope, Mr. Tarbox, you won\u0027t think I am unwilling to be in your company.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t,\" said the Yankee, cordially. \"You ain\u0027t a bit stuck up. I\u0027d like to let that chap know that I\u0027m as good as he is, if he does call himself colonel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And if I can only make my plow go, I\u0027ll be rich some day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you will, Mr. Tarbox.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So do I. Do you know what I\u0027ll do then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see, there\u0027s a gal in our town; her name is Sally Sprague, and she\u0027s about the nicest gal I ever sot eyes on. Ef things goes well with me, that gal will have a chance to be Mrs. Tarbox,\" said Jonathan, energetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope she will,\" said Frank, in amused sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n [136]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I like you—I do!\" said Mr. Tarbox. \"Ef ever I git a chance to do you a good turn, I\u0027ll do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Mr. Tarbox. I am sorry Colonel Sharpley was rude to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can stand it,\" said Jonathan; \"and I mean to go to the same tavern, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The custom-house officials came on board and examined the luggage. This over, the passengers were permitted to land. On shore they encountered a crowd of hackmen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the St. George Hotel,\" said Colonel Sharpley, selecting one of the number. \"Here, Frank, get in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Just behind was Mr. Tarbox, standing guard over a dilapidated trunk and a green chest, the latter of which contained his precious plow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have a cab, sir?\" asked a short, stout hackman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you goin\u0027 to charge?\" asked Jonathan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you want me to drive, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"St. George Tavern. Oh, stop a minute. Do they pile up the prices steep there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [137]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s reasonable, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s all I want. I ain\u0027t goin\u0027 to pay no fancy prices. How much are you goin\u0027 to charge for carryin\u0027 me there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Half a crown, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What in thunder\u0027s half a crown?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ain\u0027t he precious green?\" thought cabby. But he answered, respectfully:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s two-and-six, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two dollars and six cents?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; two shillin\u0027s and sixpence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s too much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Reg\u0027lar price.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t believe it. Here, you other chap,\" beckoning to another cabman, \"what\u0027ll you charge to take me to the St. George Tavern?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This brought the first cabby to terms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jump in, sir. I\u0027ll take you round for two shillin\u0027s,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" said Jonathan. \"I\u0027ll help you with that chist. Now put her over the road. I\u0027m hungry, and want some vittles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes after Frank arrived at the St. George with his guardian, Mr. Tarbox drove up, bag and baggage.\n\u003c/div\u003e \n\u003cdiv\u003e\n [138]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see I\u0027m here most as soon as you,\" said Tarbox, nodding. \"We ain\u0027t separated yet. It\u0027s a pooty nice tavern, Mr. Sharpley,\" accosting Frank\u0027s guardian with easy forgetfulness of the latter\u0027s repellant manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your object in following us, sir?\" asked Sharpley, frigidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t engaged this tavern all to yourself, have you?\" demanded Jonathan. \"Ain\u0027t it free to other travelers?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sharpley saw the other had him at advantage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you come here because we were here?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May be I did, and then again may be I didn\u0027t,\" the other replied. \"There ain\u0027t any law ag\u0027in it, is there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should hardly suppose you would wish to thrust yourself into the society of those who don\u0027t want you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t run up no bills on your account,\" said Mr. Tarbox; \"but I\u0027m goin\u0027 just where I please, even if you are there already. Frank here ain\u0027t no way troubled about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank, as you call him, is under my guardianship,\" said Mr. Sharpley, [139] with a sneer. \"I don\u0027t wish him to associate with improper persons.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you call me an improper person?\" demanded Mr. Tarbox, offended.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can draw your own inferences, Mr.—I really don\u0027t know who.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tarbox, of Squashboro\u0027, State o\u0027 Maine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, Mr. Tarbox, of Squashboro\u0027, State o\u0027 Maine, I have already wasted as much time as I choose to do on you, and must close the conversation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir. You\u0027d better shut up Frank in a glass case, if you don\u0027t want him to associate with any improper persons.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But Colonel Sharpley had turned on his heel and moved away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t have that fellow following us everywhere,\" he said to himself. \"The task I have before me is one which demands secrecy, in order to avert all suspicion in case anything happens. This inquisitive, prying Yankee may spoil all. He won\u0027t take a hint, and I suspect it would be dangerous to try a kick. The trouble with these Yankees is that they [140] are afraid of nothing, and are bent on carrying out their own purposes, however disagreeable to others. I must ask Frank about this fellow and his plans.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank,\" he commenced, when they were alone, \"I must congratulate you on this Yankee friend of yours. He has fastened on us like a leech.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a good-natured fellow,\" said Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is an impudent scoundrel!\" said Sharpley, impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not so bad as that. He is not used to the ways of the world, and he seems to have taken a fancy to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He ought to see that his company\u0027s not wanted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is not disagreeable to me. I am rather amused by his odd ways and talk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not. He is confoundedly disagreeable to me. We must shake him off. We can\u0027t have him following us all over Europe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t do that. He is going to the Paris Exposition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [141]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s he going to do there—exhibit himself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not exactly,\" said Frank, good humoredly. \"He\u0027s invented a plow that will take the shine off all others, so he says. So he will be detained there for some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to hear that; but I mean to get rid of him beforehand. When we leave here we mustn\u0027t tell where we are going.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t,\" answered Frank; \"for I don\u0027t know, unless it is to London.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I won\u0027t tell you, or you might let it out accidentally.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Jonathan, who had ordered a couple of chops, was sitting in the coffee-room, making a vigorous onslaught upon them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder what makes that Sharpley so skittish about me and Frank bein\u0027 together?\" he thought. \"He needn\u0027t think I want to stick near him. I wouldn\u0027t give half a cent for his company. But that boy\u0027s a good sort of a chap and a gentleman. I\u0027ll keep him in sight if I can.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2968/81717.html","bookId":376,"creation":"Aug 5, 2019 11:21:01 AM","modification":"Aug 5, 2019 11:21:01 AM"}
