{"id":39378,"no":2,"title":"CHAPTER II. MR. CRAVEN\u0027S COURTSHIP.","content":"\u0026nbsp;When Katy left the room, Mr. Craven still kept his place at the side of the widow. \n\u003cdiv\u003e\n \"I hope,\" he said softly, \"you were not very much annoyed at Katy\u0027s sudden entrance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was awkward,\" said Mrs. Hunter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True, but, after all, is there anything to be ashamed of in our love?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid, Mr. Craven, I do not love you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not yet, but you will. I am sure you will when you see how completely I am devoted to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems so sudden,\" faltered Mrs. Hunter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, setting aside my affection, think how much it will relieve you of care. Dear Mrs. Hunter, the care of your property and the [16] responsibility of educating and training your son is too much for a woman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank never gives me any trouble,\" said Mrs. Hunter. \"He is a good boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a disagreeable young scamp, in my opinion,\" thought Mr. Craven, but he said, unwittingly speaking the truth:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is indeed a noble boy, with excellent qualities, but you will soon be called upon to form plans for his future, and here you will need the assistance of a man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know but what you are right, Mr. Craven. I should have consulted you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only one who fills a father\u0027s place, dear Mrs. Hunter, can do him justice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid Frank won\u0027t like the idea of my marrying again,\" said Mrs. Hunter, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He may not like it at first, but he will be amenable to reason. Tell him that it is for your happiness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I don\u0027t know. I can\u0027t feel sure that it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am having more trouble than I expected,\" thought Mr. Craven. \"I [17] must hurry up the marriage or I may lose her, and, what is of more importance, the money she represents. By the way, I had better speak on that subject.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are some who will tell you that I have only sought you because you are rich in this world\u0027s goods—that I am a base and mercenary man, who desires to improve his circumstances by marriage, but you, I hope, dear Mrs. Hunter—may I say, dear Mary—will never do me that injustice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not suspect you of it,\" said Mrs. Hunter, who was never ready to suspect the motives of others, though in this case Mr. Craven had truly represented his object in seeking her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew you would not, but others may try to misrepresent me, and therefore I feel it necessary to explain to you that my wealth, though not equal to your own, is still considerable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have never thought whether you were rich or poor,\" said Mrs. Hunter. \"It would not influence my decision.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [18]\n\u003c/div\u003e \n\u003cdiv\u003e\n While she spoke, however, it did excite in her a momentary surprise to learn that since Mr. Craven was rich, he should settle down in so small and unimportant a place as Shelby, where he could expect little business of a professional nature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know your generous, disinterested character,\" he said; \"but still I wish to explain to you frankly my position, to prove to you that I am no fortune-hunter. I have twenty thousand dollars invested in Lake Superior mining stocks, and I own a small house in New York City, worth about fifteen thousand dollars. It is not much,\" he added, modestly, \"but is enough to support me comfortably, and will make it clear that I need not marry from mercenary motives. I shall ask the privilege of assisting to carry out your plans for Frank, in whom I feel a warm interest.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very generous and kind, Mr. Craven,\" said Mrs. Hunter, \"but his father amply provided for him. Two-thirds of his property was left to Frank, and will go to him on his twenty-first birth-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [19]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Drat the boy,\" thought Mr. Craven, \"he stands between me and a fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But this thought was not suffered to appear in his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am almost sorry,\" he said, with consummate hypocrisy, \"that he is so well provided for, since now he does not stand in need of my help, that is, in a pecuniary way. But my experience of the world can at least be of service to him, and I will do my best to make up to him for the loss of his dear father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n These last words were feelingly spoken. She realized how much she was wanting in the ability to guide and direct a boy of Frank\u0027s age. Mr. Craven was a lawyer, and a man of the world. He would be able, as he said, to relieve her from all care about his future, and it was for Frank that she now lived. Her feelings were not enlisted in this marriage with Mr. Craven. Indeed, on some accounts it would be a sacrifice.\n\u003c/div\u003e \n\u003cdiv\u003e\n The result was, that twenty minutes later, when he started homeward, Mrs. Hunter had ratified her promise, and consented to an early [20] marriage. Mr. Craven felt that he had, indeed, achieved a victory, and left the house with a heart exulting in his coming prosperity.\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank Hunter and Ben Cameron were on the lawn, conversing, when the lawyer passed them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon, Frank,\" he said with suavity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon, sir,\" answered Frank, gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The old fellow is very familiar,\" said Ben, when Mr. Craven had passed out of the gate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is more familiar than I like,\" answered Frank. \"I don\u0027t know why it is, Ben, but I can\u0027t help disliking him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He had reason to dislike Mr. Craven, and he was destined to have still further cause, though he did not know it at the time.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2968/81704.html","bookId":376,"creation":"Aug 5, 2019 11:21:01 AM","modification":"Aug 5, 2019 11:21:01 AM"}
