{"id":39406,"no":30,"title":"CHAPTER XXX. NEW FRIENDS.","content":"\u0026nbsp;When Frank arrived at the hotel with his young charge he found the Grosvenor family in great dismay. The servant had returned, evidently under the influence of liquor, quite unable to give any account of the little boy. A party, headed by Mr. Grosvenor, was about starting out in search of him, when he made his appearance, clinging trustfully to the hand of our hero. \n\u003cdiv\u003e\n \"Oh, you naughty runaway!\" said his sister Beatrice, a lovely girl of twelve, folding Herbert in a sisterly embrace. \"How you have frightened us!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t help it, sister,\" said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made you run away from Thomas, my boy?\" asked his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was afraid of him,\" said Herbert. \"He was so strange.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The cause of the strange conduct was evident enough to any one [253] who saw the servant\u0027s present condition, for he was too stupefied even to defend himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little runaway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a shame, father,\" said Beatrice. \"Only think, our darling little Herbie might have been lost. I hope you will never trust him again with Thomas.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall not,\" said the father, decidedly. \"Thomas has forfeited my confidence, and he must leave my service. I shall pay his passage back to London, and there he must shift for himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have not thanked the young gentleman who brought him back, father,\" said Beatrice, in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Grosvenor turned to Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Accept my warmest thanks, young gentleman,\" he said, \"for your kindness to my little son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was only a trifle, sir,\" said our hero, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was no trifle to us. How did you happen to meet him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was resting by the road-side, when he came along, crying. I asked him what was the matter, and he told me. Then I offered to guide him [254] to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And thereby relieved our deep anxiety. We were very much frightened when Thomas returned without him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t wonder, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are English, I infer,\" said Mr. Grosvenor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; I am an American.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are not traveling alone—at your age?\" said the merchant, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was not—that is, I came from America with another person, but I parted from him in Switzerland.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank refrained from explaining under what circumstances he parted from Sharpley, partly from a natural reluctance to revive so unpleasant a subject, partly because he did not like to trouble the Grosvenors with his affairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be lonely traveling without friends,\" said Mr. Grosvenor. \"My daughter and I would feel glad to have you join our party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, papa!\" said Beatrice.\n\u003c/div\u003e \n\u003cdiv\u003e\n [255]\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank turned towards the beautiful girl who spoke so impulsively, and he could not help feeling that it would indeed be a pleasure to travel in her society. I don\u0027t mean to represent him as in love, for at his age that would be foolish; but he had never had a sister, and it seemed to him that he would have been glad to have such a sister as Beatrice. But how could he, with less than forty sous to defray his traveling expenses, join the party of a wealthy London merchant? Had he the money that rightfully belonged to him, now in Sharpley\u0027s hands, there would have been no difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You hesitate,\" said Mr. Grosvenor. \"Perhaps it would interfere with your plans to go with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; it is not that,\" and Frank hesitated again.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was an embarrassing moment, but he decided quickly to make the merchant acquainted with his circumstances.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you will favor me with five minutes\u0027 private conversation,\" he said, \"I will tell you why I hesitate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [256]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly,\" said Mr. Grosvenor, politely, and led the way into the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n The nature of Frank\u0027s explanation is, of course, anticipated by the reader. He related, as briefly as possible, the particulars of Sharpley\u0027s plot. The merchant listened with surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is certainly a singular story,\" he said, \"and you have been treated with the blackest treachery. Do you know, or do you guess, what has become of this man?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I think he has started to return to America, or will do so soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what are your plans?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean to go to Paris. There I have a friend who I think will help me—an American with whom I became acquainted on the voyage over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you are poorly provided with money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have less than two francs left,\" Frank acknowledged.\n\u003c/div\u003e \n\u003cdiv\u003e\n The merchant looked amazed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were actually reduced to that?\" he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n [257]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you expect to get to Paris?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what puzzled me,\" he owned. \"I was sitting by the road-side thinking how I should accomplish it when your little boy came along.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Now it was Mr. Grosvenor\u0027s turn to smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He solved it,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who, sir?\" asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My little boy,\" said Mr. Grosvenor, still smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand,\" said our hero, puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean that Herbert shall act as your banker. That is, on account of your kindness to him, I propose to add you to my party, and advance you such sums as you may require.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind, sir,\" said Frank, relieved and grateful. \"I really don\u0027t know what I should have done without some such assistance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it is arranged, and you will join us at dinner, which is already ordered. I will order a room to be made ready for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [258]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope, sir, you will excuse my dress,\" said Frank, who, it must be confessed, might have looked neater. He had walked for several days, and was in consequence very dusty. Then again, his shirt and collar had been worn ever since his accident, and were decidedly dirty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am ashamed of my appearance, sir,\" continued our hero; \"but Colonel Sharpley\u0027s treachery compelled me to travel without my trunk, and I have not even a change of linen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Grosvenor could not forbear smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are certainly in an awkward condition,\" he said. \"I will apologize for you to Beatrice, the only lady of our party, and we will see after dinner if we cannot repair your loss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank used a brush diligently, and succeeded in making his outer clothes presentable; but, alas! no brush could restore the original whiteness of his dingy linen; and he flushed crimson as he entered the dining-room, and by direction of Mr. Grosvenor took a seat next to Beatrice, who looked so fresh and rosy and clean as to make the [259] contrast even more glaring. But her cordial greeting soon put him at ease.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Papa has been telling me of that horrid man who tried to kill you,\" she commenced. \"What a wretch he must be!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think he is one,\" said Frank; \"but until the accident happened—that is, till he pushed me over the cliff—I had no idea of his design.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he left you without any money, didn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With very little—just what I happened to have about me. I paid most of that to the peasant who found me and took care of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you almost starve?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; but my meals were very plain. I didn\u0027t dare to eat as much as I would have liked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I suppose that horrid man has gone off with your money?\" said Beatrice, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, miss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Her name isn\u0027t miss,\" said little Herbert. \"It\u0027s Beatrice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [260]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Herbert is right,\" said Beatrice, smiling. \"I am not a young lady yet—I am only twelve.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then,\" said our hero, who was fast getting to feel at home in his new surroundings, \"as I am not a young gentleman yet, I suppose you will call me Frank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will call you Frank,\" said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I suppose I must do so to be in fashion,\" said Beatrice, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly don\u0027t look like a young gentleman in these dirty clothes,\" said our hero. \"Perhaps Herbert will lend me a suit?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think,\" said Mr. Grosvenor, \"we shall be able to refit you without drawing from Herbert\u0027s wardrobe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n So the conversation went on, and our hero, before the dinner closed, found himself entirely at his ease in spite of his soiled clothes.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2968/81732.html","bookId":376,"creation":"Aug 5, 2019 11:21:01 AM","modification":"Aug 5, 2019 11:21:01 AM"}
