{"id":39407,"no":31,"title":"CHAPTER XXXI. HOW THE NEWS WENT HOME.","content":"\u0026nbsp;Frank had one source of anxiety and embarrassment connected with his recent adventure which had occupied a considerable space of his thoughts. \n\u003cdiv\u003e\n It was this. How could he let his mother know that he was still alive without its coming to the knowledge of Mr. Craven? Convinced, as he was, that his step-father was at the bottom of the treacherous plot to which he had nearly fallen a victim, he wished him to suppose that it had succeeded in order to see what course he would pursue in consequence. His subsequent course would confirm his share in the plot or relieve him from any complicity, and Frank wanted to know, once for all, whether he was to regard his step-father as a disguised and dangerous foe or not. But he was not willing that his mother should [262] rest long under the impression that he had perished among the Alps. In her delicate state of health he feared that it would prove too much for her, and that it might bring on a fit of sickness. He wished, therefore, in some way, to communicate to her secretly the knowledge that he had escaped. But if he wrote Mr. Craven would see the letter or know that one had been received. Evidently, therefore, he could not write directly to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n After some perplexity, he saw a way out of the difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had recently received a letter from his old friend and school companion, Ben Cameron, stating that the latter had gone to Wakefield, ten miles distant, to spend two months with an uncle, and asking Frank to direct his next letter there. It flashed upon our hero that he could write to Ben, giving him an account of what had happened, and asking him to acquaint his mother secretly, saying nothing of this letter in case he should hear that he, Frank, was dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n The day after he joined the Grosvenor party he carried out this plan, [263] writing a long letter to Ben, which terminated as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel sure that Mr. Craven is at the bottom of this attempt upon my life, and I think that his plan is to get possession of my money. He knows that mother\u0027s health would be very much affected by the news of any fatal accident to me, and that she would easily be induced to put all business into his hands. He would find it very easy to cheat a woman. You may ask why Colonel Sharpley should be induced to join in such a plot. That I can\u0027t tell, but I think he is not very rich, and that Mr. Craven has offered to divide with him in case they succeed. Otherwise, I can think of no motive he could have for attempting to kill me. We have always been on good terms so far as I know.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may be wrong in all this, but I don\u0027t think I am. I suppose Colonel Sharpley has written home that I am dead, and I think that he will soon go to America to receive his pay for the deed. Now, Ben, as you are my friend, I want you to manage to see my mother privately, and tell her that I am well—perfectly well—that I have escaped almost by a miracle, and that though without money, I have found friends who will supply all my needs and give me money to return to America. She is not to let anybody know that she has heard from me, but to wait [264] till I come home, as I shall soon. Especially if Mr. Craven tries to get hold of my property, tell mother to resist and refuse utterly to allow it. I advise her also to take care how she trusts Mr. Craven with her own money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall not write you again, Ben, for fear my letters might be seen. But some day I shall come home unexpectedly. Let mother see this letter and then destroy it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your affectionate friend,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank Hunter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was fortunate that Frank wrote this letter; but we must precede it, and, after a long interval, look in upon the home he had left.\n\u003c/div\u003e \n\u003cdiv\u003e\n One day Mr. Craven took from the village post-office a letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened it eagerly, and, as he read it, his face showed the gratification which he felt. But lest this should be noticed, he immediately smoothed his face and assumed a look of grave and hypocritical sadness.\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the letter:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dear Mr Craven:—It is with great sorrow that I sit down to write you this letter. I would, if I could, commit to another hand the task of communicating the terrible news which I have to impart. Not to keep you longer [265] in suspense, your step-son, Frank Hunter, met with a fatal accident yesterday, while ascending the Alps with me. He approached too near the edge of a precipice, though I warned him of his danger, and insisted on looking over. Whether he became dizzy or slipped I cannot explain, but, to my horror, a moment later I saw the unfortunate boy slip over the edge and fall into the terrible abyss. I sprang forward, hoping to catch him, but was too late. I nearly fell over myself in the vain attempt to save him. I almost wish I had done so; for, though the act was the result of his own imprudence, I cannot help feeling responsible. I ought to have exercised my authority and forcibly restrained him from drawing near the fatal brink. Yet I did not like to be too strict with a boy of his age; I feared he would dislike me. But I wish I had run that risk. Anything would have been better than to feel that I might have saved him and neglected to do it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I sympathize deeply with you and his mother in your sorrow at this bereavement. I shall sail for America in two or three weeks, in order to give Mrs. Craven and yourself a detailed account of this calamity. I will bring home what things I have of Frank\u0027s, thinking that it may be a sad satisfaction to his mother to have them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot write further. I have a terrible head-ache, and am completely used up by the sad scene through which I have passed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yours truly,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sharpley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [266]\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Craven took out this letter and read it a second time on his way home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a good letter,\" he said to himself, sardonically, \"so full of sympathy, regret, and that sort of thing. I couldn\u0027t have done it better myself, and I have rather a talent for such things. Egad! Sharpley has surpassed himself. I didn\u0027t give the fellow credit for so much hypocrisy. So he\u0027s coming to America to give us a detailed account of this calamity, is he? I know why he\u0027s coming. It\u0027s to get pay for his share of the plot. Well, if all goes well, I can afford to pay him well, though I really think his price was too high. Now that the young one is out of the way, I must manage his mother, so as to get his property into my hands. Forty thousand dollars! It will relieve me from all money cares for the rest of my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n As Mr. Craven approached the house, his face assumed a grave and sorrowful expression. He was preparing to inflict a crushing blow upon the devoted mother, who was even then counting the days to the probable return of her beloved boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n [267]\n\u003c/div\u003e \n\u003cdiv\u003e\n Entering the house, he met Katy in the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is your mistress in?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; she\u0027s up stairs. Have you heard from Frank, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Katy,\" he answered in a significantly doleful tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is anything the matter of him, sir?\" asked Katy, taking the hint.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Katy, I\u0027ve heard bad news,\" said Mr. Craven, pulling out his white handkerchief, and elaborately wiping his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bad news! What is it, sir?\" demanded Katy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell it,\" wailed Mr. Craven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Spit it out like a man!\" exclaimed Katy, impatiently. \"Is the dear boy sick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Worse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He ain\u0027t dead!\" ejaculated Katy, horror-struck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he is; he fell over a precipice in the Alps, and was instantly killed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s a precipice, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was on a steep hill and he slipped over the edge.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [268]\n\u003c/div\u003e \n\u003cdiv\u003e\n Katy uttered a loud shriek, and sank on the lower stair, and throwing her apron over her face, began to utter what can only be designated as howls of grief.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Craven from above was drawn to the head of the landing by what she heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter?\" she asked, in affright.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! it\u0027s Master Frank, mum. He\u0027s kilt dead, he is!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this true?\" ejaculated Mrs. Craven, looking toward her husband with pale face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, my dear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a low shriek, and the poor mother sank to the floor in a dead faint.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2968/81733.html","bookId":376,"creation":"Aug 5, 2019 11:21:01 AM","modification":"Aug 5, 2019 11:21:01 AM"}
