{"id":65281,"no":1,"title":"Page 1","content":"\u003cp\u003eChapter 1\u003c/p\u003e\n\u003cp\u003eOur flight left Kennedy at 8:25 on an unusually unpleasant Tuesday night in a generally horrible August. For the past two weeks the people who are supposed to know about such things had been forecasting rain to be followed by a break in the heat. The rain had held off and the heat had prevailed until the weather people appeared to be participants in some sort of meteorological martingale system, resolutely doubling their bets on the Rain and Cooler line while Hot and Clear turned up day after dismal day. If they didn’t hit soon, they would run out of chips. Meanwhile, we were running out of New York.\u003c/p\u003e\n\u003cp\u003eNot literally running, of course. Flying. Although, after we boarded the big 727 and fastened our seat belts and listened to the little illustrated sermon about proper use of oxygen masks, it appeared as though we were neither running nor flying from New York to Montreal. Instead, it looked as if we were going to drive there.\u003c/p\u003e\n\u003cp\u003eThe plane taxied to and fro, to and fro. The pilot put many miles on the aircraft without yet leaving the ground. Minna squeezed my hand. I looked down at her and she pouted up at me.\u003c/p\u003e\n\u003cp\u003e“You promised we would fly,” she said.\u003c/p\u003e\n\u003cp\u003e“We will. Be patient.”\u003c/p\u003e\n\u003cp\u003e“Is this really an airplane?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“It does not behave like one.”\u003c/p\u003e\n\u003cp\u003eMinna had flown once before, on a Russian experimental jet fighter-bomber that we had hijacked from a missile base in Estonia. That time we had taken off vertically, and I could understand how our little promenade on the runway might be a letdown for her. I assured her that the 727 was really a plane and that it would soon behave in a planelike manner. I don’t think she believed me.\u003c/p\u003e\n\u003cp\u003eAfter another fifteen minutes of driving, the pilot introduced himself apologetically over the intercom. I thought he was going to tell us that there was a bomb on the plane or that Montreal had been closed for the season. He explained, anticlimactically, I thought, that there were still six planes ahead of us, that we would get assigned to a runway sooner or later, and that he thanked us for our patience.\u003c/p\u003e\n\u003cp\u003eMinna said something unforgivable in Lithuanian.\u003c/p\u003e\n\u003cp\u003e“Watch it,” I said.\u003c/p\u003e\n\u003cp\u003e“But no one can understand me, Evan.”\u003c/p\u003e\n\u003cp\u003e“That’s the point.” I patted her little hand. “Don’t speak anything but English until we get into Canada. Remember, you’re an American citizen, you were born in New York, your name is Minna Tanner, and you speak only English.”\u003c/p\u003e\n\u003cp\u003e“All right. The pilot is a-”\u003c/p\u003e\n\u003cp\u003e“Proper English.”\u003c/p\u003e\n\u003cp\u003e“-nice man.”\u003c/p\u003e\n\u003cp\u003eShe is not an American citizen, she was not born in New York, her name is not Minna Tanner, and I’m not entirely certain how many languages she speaks. She is fluent in Lithuanian, Lettish, English, and Puerto Rican Spanish, and has accumulated bits and pieces of many other languages from the books and records and occasional guests in my apartment, where I live and she reigns. She is the sole surviving descendant of Mind-augas, who in his turn was the sole king of independent Lithuania some seven centuries ago.\u003c/p\u003e\n\u003cp\u003eWhen I first met her, she was living in a cheerless basement room in the Lithuanian Soviet Socialist Republic, tended by a pair of addled old maids who awaited the day when she could be installed as Lithuania ’s queen. I took her away from all that, and now she plays queen in my somewhat less cheerless apartment on West 107th Street. From time to time I threaten to send her to school or to have her adopted by some happy little couple with a happy little house out in a happy little suburb. She and I both know that this will never happen – she’s too much fun to have around. Ever since Kitty Bazerian’s grandmother taught her how to make Armenian coffee, she has become utterly indispensable.\u003c/p\u003e\n\u003cp\u003e“How long will we be on this plane, Evan?”\u003c/p\u003e\n\u003cp\u003e“The flight takes an hour. If we ever get off the ground.”\u003c/p\u003e\n\u003cp\u003e“And then we will be in Montreal?”\u003c/p\u003e\n\u003cp\u003e“Yes. And our luggage will be in Buenos Aires.”\u003c/p\u003e\n\u003cp\u003e“ Buenos Aires?”\u003c/p\u003e\n\u003cp\u003e“I never trust airlines. I’m joking. We’ll be in Montreal when the plane lands, yes.”\u003c/p\u003e\n\u003cp\u003e“Can we go to Expo tonight?”\u003c/p\u003e\n\u003cp\u003e“It’ll be too late.”\u003c/p\u003e\n\u003cp\u003e“I’m not tired, Evan.”\u003c/p\u003e\n\u003cp\u003e“You’ll be tired by the time we get to the hotel.”\u003c/p\u003e\n\u003cp\u003e“I won’t. I’m hardly ever tired, Evan. Like you, I need very little sleep. Hardly any sleep at all.”\u003c/p\u003e\n\u003cp\u003eI looked at her. Minna averages ten hours of sleep in twenty-four, which is a fairly healthy average. I sleep not at all, having lost the habit forever when a shard of North Korean shrapnel performed random brain surgery and knocked out something called the sleep center. I have been awake ever since. My disability pay is $112 per month, and I don’t have to spend a cent of it on pajamas.\u003c/p\u003e\n\u003cp\u003e“If we went to Expo tonight,” Minna said carefully, “I could sleep late tomorrow. I wouldn’t want you to have to postpone your visit to Expo just because of me. I would be willing to stay up late tonight and sleep tomorrow.”\u003c/p\u003e\n\u003cp\u003e“That’s very thoughtful of you.”\u003c/p\u003e\n\u003cp\u003e“It’s nothing.”\u003c/p\u003e\n\u003cp\u003e“Last Saturday you were equally selfless. You volunteered to accompany Sonya to the children’s zoo.”\u003c/p\u003e\n\u003cp\u003e“She wanted to see it, Evan. And adults are not permitted unless they are accompanied by children. I thought to do her a favor.”\u003c/p\u003e\n\u003cp\u003eShe has worked the children’s zoo con on every woman I’ve ever brought to the apartment. “If you want,” I said, “we’ll go to Expo tonight.”\u003c/p\u003e\n\u003cp\u003e“I only wish to be fair with you. Oh, I think it is an airplane after all!”\u003c/p\u003e\n\u003cp\u003eAnd so it was. We had clearance at last, and the big jet roared down the runway and took off. I sat back in my seat while Minna pressed her face to the window, watching the ground fall away from us.\u003c/p\u003e\n\u003cp\u003eOnce it was off the ground, the plane behaved superbly. I had a drink and Minna had a glass of milk, and by the time we were finished the pilot was once again on the intercom, mumbling something about fastening our seat belts for the descent to Duval Airport. Since we hadn’t unfastened them, this was no problem. The landing was smooth. The plane taxied to a stop and we left it.\u003c/p\u003e\n\u003cp\u003eWe followed the crowd into the airport and queued up for the luggage. The bags came spilling down a ramp onto a circular baggage rack that rotated. I missed our suitcase the first time around and waited until it made its way to us a second time. We got into another line that led past a desk where an attendant with a French accent sent Canadians to the left and Americans to the right. We went to the right. There were three lines, and we picked the shortest one.\u003c/p\u003e\n\u003cp\u003eI had our passports in my jacket pocket. You do not need a passport to get into Canada or back into the States, but the airlines clerk had recommended carrying proof of citizenship, and anyway I like to have my passport with me when I travel.\u003c/p\u003e\n\u003cp\u003eMy passport was a forgery, but it had passed muster so many times I was no longer nervous about it. A gentle old Armenian man had made it for me some time ago in Athens, after the Czech Government had confiscated my real passport. The forgery had all the proper information on it, including the original passport number, so I wasn’t worried about it. Minna’s passport, on the other hand, was genuine government issue. All we had needed to obtain it was a New York City birth certificate, and a Croat Nationalist on Norfolk Street had made that up for me in fifteen minutes, no charge. I had done him a favor once.\u003c/p\u003e\n\u003cp\u003e“Your name is Minna Tanner, you were born in New York City,” I said.\u003c/p\u003e\n\u003cp\u003e“I know, I know.”\u003c/p\u003e\n\u003cp\u003e“I’m your father.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eThe line moved onward and we came to the front of it. The customs attendant had wavy black hair and a thin nose. He smiled and asked us our names.\u003c/p\u003e\n\u003cp\u003e“Evan Michael Tanner,” I said.\u003c/p\u003e\n\u003cp\u003e“Minna Tanner,” Minna said.\u003c/p\u003e\n\u003cp\u003e“You are United States citizens?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You were born?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Minna.\u003c/p\u003e\n\u003cp\u003eI winced. He smiled. “Where were you born?” he asked gently.\u003c/p\u003e\n\u003cp\u003e“ New York City.”\u003c/p\u003e\n\u003cp\u003e“ New York City.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said. “And why have you come to Montreal, Mr…”\u003c/p\u003e\n\u003cp\u003e“Tanner. To see the fair.”\u003c/p\u003e\n\u003cp\u003e“To see the fair. You will stay how long?”\u003c/p\u003e\n\u003cp\u003e“About a week.”\u003c/p\u003e\n\u003cp\u003e“About a week. Yes.” He started to say something, and then he stopped and frowned for a moment, and then he looked at me as if seeing me for the first time. “Evan Tanner, Evan Tanner,” he said. “I am sorry, Mr. Tanner, but you have perhaps some identification?”\u003c/p\u003e\n\u003cp\u003eHis French accent was thicker now. I handed him our passports. He examined them, studied my photo and Minna’s, studied my face and Minna’s, went over the passports again, whistled soundlessly, and got to his feet. “You will excuse me for one moment, please,” he said, and went away.\u003c/p\u003e\n\u003cp\u003eMinna looked at me. “Something is wrong?”\u003c/p\u003e\n\u003cp\u003e“Evidently.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Something is wrong with the passports?”\u003c/p\u003e\n\u003cp\u003e“I can’t imagine what.”\u003c/p\u003e\n\u003cp\u003e“You said that it was very simple to go into Canada. That it was hardly like going from one country to another.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“I do not understand.”\u003c/p\u003e\n\u003cp\u003e“Neither do I.”\u003c/p\u003e\n\u003cp\u003e“Where did the man go?”\u003c/p\u003e\n\u003cp\u003eI shrugged. Perhaps, I thought, they had received a circular on some criminal with a similar name. Perhaps some clown named Ivan Manners had embezzled a few hundred thousand dollars from the Keokuk National Bank. I couldn’t imagine what else would stop him cold like that.\u003c/p\u003e\n\u003cp\u003eHe came back, finally, following an older man with gray hair and a small mustache. The older man said “Come with me, please” just as the younger one was saying “You will please go with him.” We did. The gray-haired man led us down a corridor to a small room with an armed guard in front of it. Minna held my hand and did not utter a sound.\u003c/p\u003e\n\u003cp\u003eThere was only one chair, a rather severe wooden affair behind the desk. The gray-haired man sat in it and we stood in front of the desk and looked over it at him. He had our passports in front of him, along with a batch of papers that he shuffled through.\u003c/p\u003e\n\u003cp\u003e“I don’t understand this,” I said. “What’s the problem?”\u003c/p\u003e\n\u003cp\u003e“Evan Tanner,” he said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Evan Michael Tanner of New York City.”\u003c/p\u003e\n\u003cp\u003e“Yes. I don’t-”\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes at me. “Perhaps you might tell me, Mr. Tanner, just why you are so intent upon separating the Province of Quebec from the Dominion of Canada?”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Indeed.” He played again with the pile of papers. “You are not Canadian,” he said. “Nor are you French. You have never lived in Quebec. You have no family here. Yet you are a member, as I understand it, of the most radical of the separatist organizations, Le Mouvement National de Québec. Why?”\u003c/p\u003e\n\u003cp\u003e“Because differences in language and culture constitute differences in nationality,” I heard myself say. “Because Quebec has always been French and will always be French, Wolfe’s victory over Montcalm notwithstanding. Because two centuries of British colonialism cannot change the basic fact that French Canada and British Canada have nothing in common. Because a house divided against itself cannot stand. Because-” \u003c/p\u003e","sourceLink":"https://allnovel.net/tanner-s-tiger-evan-tanner-5/page-1.html","bookId":2337,"creation":"Oct 5, 2019 9:57:14 AM","modification":"Oct 5, 2019 9:57:14 AM"}
