{"id":94439,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Come on!” he shouted, but Nix was already running past him. Her sword swished down and cracked and another zombie spun away, its jaw crushed.\u003c/p\u003e\n\u003cp\u003eThey ran and struck and ran. The blood on Nix’s face scared Benny so much his heart felt like ice.\u003c/p\u003e\n\u003cp\u003eHad she been bitten?\u003c/p\u003e\n\u003cp\u003eHis toe hurt terribly.\u003c/p\u003e\n\u003cp\u003eAre we bitten?\u003c/p\u003e\n\u003cp\u003eAre we dead? “Benny!” Nix screamed. “Fight!”\u003c/p\u003e\n\u003cp\u003eHe bit down on his fear and swung the sword. It cracked against a reaching hand and shattered the wrist. He swung again and a zom who looked like he might have been a soldier flopped over on his back, his neck knocked askew. Benny swung and hit; Nix swung and hit; and all the time they screamed and moved and fought.\u003c/p\u003e\n\u003cp\u003e“That way!” cried Nix, shoving him with her shoulder. Benny pivoted to see a narrow gap in the sea of crawling monsters. He pushed her in front of him.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eShe went, running and jumping, her sword flashing in a brown blur, the crack! against old bone sounding like gunshots.\u003c/p\u003e\n\u003cp\u003eA pair of zoms—a grocery store clerk and a man in the tattered remains of a business suit—grabbed at him at the same time, each one clamping on to one of his ankles.\u003c/p\u003e\n\u003cp\u003eBenny staggered and fell. But as he landed he twisted as Tom had shown him, rotating his shins so that the angles of his bones exerted leverage on the thumbs of the grabbing hands. The businessman lost his grip, and Benny pivoted hard to shake loose the clerk, emphasizing his need with a crushing downward blow with the flat end of the sword handle. The zom’s skull shattered, and his hand opened with a dying twitch.\u003c/p\u003e\n\u003cp\u003eBenny scrambled to his feet and ran. Nix was fifty yards ahead of him, but he ran so fast that he’d nearly caught up by the time she reached the narrow gap.\u003c/p\u003e\n\u003cp\u003e“Go! Go!” he yelled, and together they crashed through the circle of broken zombies and into the trampled area where Chong had run. It felt like escaping from the arms of Death itself.\u003c/p\u003e\n\u003cp\u003eBut the problem was far from over.\u003c/p\u003e\n\u003cp\u003eThere was still the rhinoceros.\u003c/p\u003e\n\u003cp\u003eChong was there, dodging in and around a stand of oaks as the rhino lunged between the trunks, trying to gore him with its horns. Only the lucky chance of the trees having grown so close together was keeping Chong alive.\u003c/p\u003e\n\u003cp\u003eThen they saw Tom standing with his pistol in a two-handed shooter’s grip.\u003c/p\u003e\n\u003cp\u003e“Shoot it in the eye!” Benny yelled as they closed in on where he stood.\u003c/p\u003e\n\u003cp\u003eTom ignored him and called out to Chong, “I’m going to fire twice, and then I want you to run behind the trees. Head to your left and go as deep into the forest as you can.”\u003c/p\u003e\n\u003cp\u003e“No!” cried Nix.\u003c/p\u003e\n\u003cp\u003eTom cut her a sharp look. “Why not?”\u003c/p\u003e\n\u003cp\u003e“We just came from there,” she panted. “Zoms!”\u003c/p\u003e\n\u003cp\u003e“Damn.”\u003c/p\u003e\n\u003cp\u003e“Tom! I need to get out of here!” begged Chong as he twisted away from the horn. This time it missed him by inches.\u003c/p\u003e\n\u003cp\u003e“Benny, Nix … head back to the road. Cross it and go into the other side. Find a tree you can climb and wait for me.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do?”\u003c/p\u003e\n\u003cp\u003e“Just do it!”\u003c/p\u003e\n\u003cp\u003eBenny and Nix obeyed, but they ran only a dozen yards and then slowed to watch as Tom took a few steps toward the enraged rhino and aimed his gun.\u003c/p\u003e\n\u003cp\u003e“Sorry about this, old girl,” Tom said aloud.\u003c/p\u003e\n\u003cp\u003eThe sound of the shot was strangely hollow. A pok! Benny expected it to be louder. The bullet hit the rhino in the shoulder. The creature howled, more in anger than in pain, but a second later it lunged at Chong.\u003c/p\u003e\n\u003cp\u003eTom fired again, aiming at the creature’s muscular haunch. The rhino shrieked, and this time there was pain in its cry.\u003c/p\u003e\n\u003cp\u003eIt turned with mad fury in its eyes … and charged Tom.\u003c/p\u003e\n\u003cp\u003e“Why doesn’t he shoot it in the eye?” demanded Nix, but Benny shook his head.\u003c/p\u003e\n\u003cp\u003eAs the rhino rumbled past where they stood, Benny and Nix waved with silent urgency at Chong. He saw them, hesitated, looked at the retreating back of the rhino, and did nothing.\u003c/p\u003e\n\u003cp\u003e“Crap!” growled Benny. “He’s too scared to move.”\u003c/p\u003e\n\u003cp\u003eThen something pale rose up out of the weeds behind Chong.\u003c/p\u003e\n\u003cp\u003e“Lilah!” gasped Nix.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you idiots climb a tree?” she demanded. “What was all that running around?”\u003c/p\u003e\n\u003cp\u003eShe didn’t wait for an answer, and instead grabbed Chong’s shoulder and fairly dragged him along behind her. The four of them ran through the grass and shrubs toward the trees and then out onto the road.\u003c/p\u003e\n\u003cp\u003e“In here,” Lilah commanded, pointing, and the four of them plunged into the woods on the far side of the road. They ran through sticker bushes and hanging vines and leaped a gully and then broke into another clearing. At the far side was a squat and solid tree with a stout limb that dipped low. “Go!”\u003c/p\u003e\n\u003cp\u003eThey raced to it and one by one jumped for the limb. Lilah shoved their butts upward, and when it was her turn she crouched and sprang, caught the limb as nimbly as a monkey, and climbed to safety.\u003c/p\u003e\n\u003cp\u003eFar away they heard two more hollow gunshots.\u003c/p\u003e\n\u003cp\u003eAnd then nothing except the triumphant roar of the rhinoceros.\u003c/p\u003e\n\u003cp\u003eFROM NIX’S JOURNAL\u003c/p\u003e\n\u003cp\u003eTools of the Zombie Hunter Trade, Part Three\u003c/p\u003e\n\u003cp\u003eTom Imura’s sword is a katana. That kind of sword was developed in ancient Japan by the samurai—the elite warrior class. The katana originated in Japan’s Muromachi period (1392–1573). Samurai sometimes wore a second, shorter sword called a wakizashi with it, but that one was used for committing suicide if the samurai felt his honor had been lost.\u003c/p\u003e\n\u003cp\u003e(When I asked Tom why he doesn’t carry the short sword, he said, “I believe in survival, not suicide. Besides, aren’t there already enough dead people in the world?”)\u003c/p\u003e\n\u003cp\u003eThe katana is known to be the sharpest sword in the world.\u003c/p\u003e\n\u003cp\u003eHis sword is called a kami katana. He says it means “spirit sword” or “demon sword.” Kind of cool, but a little freaky, too.\u003c/p\u003e\n\u003cp\u003eHis kami katana has a twenty-nine-inch blade and a ten-and-three-quarters-inch handle. The handle was originally wrapped in black silk, but when that wore down, my mom covered it in silk and leather with some Celtic knots worked into the design.\u003c/p\u003e\n\u003cp\u003e(Mom really loved Tom.) I miss her. So does Tom.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eTHEY CROUCHED LIKE FRIGHTENED BIRDS IN THE TREE, WATCHING THE forest and seeing only trees. There was no sign of Tom or the rhinoceros. Benny peered at Nix. Her red hair was pasted to the right side of her face by a film of drying blood. Her cheek was bruised, and she didn’t meet Benny’s eyes. When he reached out to push her hair from her face, she batted his hand away. “Don’t.”\u003c/p\u003e\n\u003cp\u003e“I want to see how bad it is.”\u003c/p\u003e\n\u003cp\u003e“It’s not bad. Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003eThe others went instantly silent. Nix looked at them and then glared at Benny.\u003c/p\u003e\n\u003cp\u003e“It’s not a bite,” she said. “I hit my head on something when I fell.”\u003c/p\u003e\n\u003cp\u003e“Show us,” demanded Lilah, and when Nix hesitated, she snapped, “Now.”\u003c/p\u003e\n\u003cp\u003eWith a trembling hand, Nix touched her forehead, and then slowly pushed the hair back. It wasn’t nothing, and it was still bleeding … but it wasn’t a bite, and Benny breathed a vast sigh of relief. Then his face clouded with concern. There was a jagged cut that ran from Nix’s hairline down her cheek almost to her jaw. It wasn’t bone deep, but like most head wounds it had bled furiously.\u003c/p\u003e\n\u003cp\u003e“Oh, man.” Benny hastily dug some clean cotton squares from his first aid kit. He tried to apply them, but Nix snatched them from him and pressed them in place.\u003c/p\u003e\n\u003cp\u003e“I know,” she snarled. “It’s ugly.”\u003c/p\u003e\n\u003cp\u003eBenny smiled at her. “No,” he said, “it’s not that. I’m just sorry you got hurt.”\u003c/p\u003e\n\u003cp\u003eHer eyes were hard to read in the shadows under the leaves. She turned away without saying anything.\u003c/p\u003e\n\u003cp\u003e“We have to go find Tom,” whispered Benny.\u003c/p\u003e\n\u003cp\u003eNix touched her face. “When he sees this, he’s going to make us go back home.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t matter, Nix. Right now we have to find him and—”\u003c/p\u003e\n\u003cp\u003e“He said to stay here,” she insisted. “If he’s looking for us and we’re looking for him, we might never find each other.”\u003c/p\u003e\n\u003cp\u003e“Yes,” agreed Chong hastily. He was green with sick fear and sweating badly. He clutched the trunk of the tree as if it was trying to pull away from him. “Staying here is good.”\u003c/p\u003e\n\u003cp\u003eLilah nodded. “Tom is a good hunter. He’ll find us.”\u003c/p\u003e\n\u003cp\u003e“But what if he doesn’t?” demanded Benny.\u003c/p\u003e\n\u003cp\u003e“He will.”\u003c/p\u003e\n\u003cp\u003e“What if he can’t?”\u003c/p\u003e\n\u003cp\u003e“He will.”\u003c/p\u003e\n\u003cp\u003eA voice said, “He has.”\u003c/p\u003e\n\u003cp\u003eBenny whipped his head around so fast that he nearly fell out of the tree. “Tom!”\u003c/p\u003e\n\u003cp\u003eTom Imura stood in the waist-high grass at the base of the tree. He was covered with mud and streaked with grass stains. His black hair hung in sweaty rattails, but he didn’t even look out of breath, and he held Lilah’s spear in his hands.\u003c/p\u003e\n\u003cp\u003e“Come on down,” he suggested with a grin.\u003c/p\u003e\n\u003cp\u003eOne by one they crawled down to the lowest limb and then dropped. Chong was last, and his legs were visibly trembling.\u003c/p\u003e\n\u003cp\u003eBenny ran over to Tom. “Don’t take this the wrong way,” he said, and then gave his brother a quick, fierce hug. He abruptly let Tom go and pushed him back like he was radioactive. “Okay, we’re done.”\u003c/p\u003e\n\u003cp\u003eNix came in for a hug too.\u003c/p\u003e\n\u003cp\u003e“Heck of a start,” Tom said. It was meant as a joke, but Nix’s eyes flashed with concern.\u003c/p\u003e\n\u003cp\u003e“Tom … I don’t want to go back!”\u003c/p\u003e\n\u003cp\u003e“I do,” said Chong.\u003c/p\u003e\n\u003cp\u003eShe wheeled around, and Benny saw that she was about to fry the flesh from Chong’s bones with an acid comment, but then she saw the look of complete despair on his face. Her own expression softened and she left her comment unspoken. Instead she turned back to Tom and reinforced her earlier comment. “I do not want to go back.”\u003c/p\u003e\n\u003cp\u003e“We’ll talk about that in a minute,” Tom said gently. “Let’s catch our breath first.”\u003c/p\u003e\n\u003cp\u003e“The animal?” asked Lilah, accepting her spear back from Tom. There was no blood on it. “Didn’t even pierce the skin.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, for what it’s worth, my bullets didn’t seem to do her much harm either.”\u003c/p\u003e\n\u003cp\u003e“You could have shot it in the eye,” said Benny.\u003c/p\u003e\n\u003cp\u003e“I would have if I couldn’t get Chong and the rest of you out of there. Otherwise it would have been wrong to kill her.”\u003c/p\u003e\n\u003cp\u003eLilah grunted and then nodded. Nix was less certain. “Will it come after us?”\u003c/p\u003e\n\u003cp\u003e“It won’t. This is her territory. She has a calf hidden back beyond the clearing.”\u003c/p\u003e\n\u003cp\u003e“A calf?” Benny asked. “That thing’s a mother rhino?”\u003c/p\u003e\n\u003cp\u003e“So she was just protecting her baby?” asked Nix.\u003c/p\u003e\n\u003cp\u003e“Seems so.”\u003c/p\u003e\n\u003cp\u003e“And you never saw it before? I thought you were up in these mountains all the time.”\u003c/p\u003e\n\u003cp\u003e“I haven’t been in this particular pass for a while. That calf can’t be more than three or four months old. I don’t know much about rhinos, but my guess is that Big Mama came looking for a quiet place to have her baby and settled here. Nobody else lives on this side of the mountain.”\u003c/p\u003e\n\u003cp\u003e“Where’d she come from?” asked Benny.\u003c/p\u003e\n\u003cp\u003e“A zoo, I guess, or a circus. People used to have private collections, too. And animals were used in the film industry. Must be a lot of wild animals out in the Ruin. My friend Solomon Jones saw a dead bear over in Yosemite that looked like it had been mauled by something that had big teeth and claws. And there’s that guy lives out at Wawona—Preacher Jack—who swears he’s seen tigers. If the zoo animals got out, it could have been anything. Lion or tiger …”\u003c/p\u003e\n\u003cp\u003e“Maybe they’ll be cowardly lions,” said Lilah under her breath.\u003c/p\u003e\n\u003cp\u003eBenny laughed. It was the first time he’d ever heard her make any kind of joke.\u003c/p\u003e\n\u003cp\u003eTom nodded back the way he’d come. “Before First Night, there were more tigers in America—in zoos, circuses, and private collections—than in all of Asia. As for Big Mama, she was simply doing what any mother does. Protecting her young.”\u003c/p\u003e\n\u003cp\u003e“Not just from us,” said Nix.\u003c/p\u003e\n\u003cp\u003eTom nodded. “I know. I saw all the zoms. Bottom line … don’t mess with Big Mama.”\u003c/p\u003e\n\u003cp\u003eBenny nodded and told the others about it. “It was really weird,” he concluded. “All those crawling zoms. Scarier than the walking ones.”\u003c/p\u003e\n\u003cp\u003e“No,” said Lilah, “it’s not. You haven’t faced enough of the walkers.”\u003c/p\u003e\n\u003cp\u003eBenny thought back to Zak and Big Zak, and to the zoms he’d faced last year while looking for Nix. “I’ve had my moments.”\u003c/p\u003e\n\u003cp\u003eChong cleared his throat. “Zoms couldn’t hurt that rhino, could they?”\u003c/p\u003e\n\u003cp\u003e“Not a chance.” Tom laughed. “Maybe the baby, though. I didn’t get a good look at it, but if it is still vulnerable, it won’t be for long. Those things are like tanks.”\u003c/p\u003e\n\u003cp\u003eHe saw the blood on Nix’s face and brushed her hair back to examine her. She nodded and pulled her face away from his touch.\u003c/p\u003e\n\u003cp\u003e“That looks nasty. It needs to be cleaned off.”\u003c/p\u003e\n\u003cp\u003e“It’s not that bad.”\u003c/p\u003e\n\u003cp\u003e“That isn’t a request, Nix. Out here we don’t have Doc Gurijala and we don’t have antibiotics. Infection is as much our enemy as the zoms. So, you’ll clean that off now, and then I’ll take a closer look at it. You might even need stitches. If so, either I’ll do it or we’ll go back to town. Either way, all wounds will be tended to with the utmost care. End of discussion.”\u003c/p\u003e\n\u003cp\u003eNix heaved a great sigh, made a big show of pulling out her first aid kit and canteen, and trudged away to sit on a fallen tree and do as she was told. \u003c/p\u003e","sourceLink":"https://allnovel.net/dust-and-decay-benny-imura-2/page-12.html","bookId":2582,"creation":"Oct 5, 2019 6:08:44 PM","modification":"Oct 5, 2019 6:08:44 PM"}
