{"id":65906,"no":10,"title":"Page 10","content":"\u003cp\u003eHE SLEPT BADLY and woke himself up before six in the morning and rolled toward the nightstand. Flicked on the bedside light and checked the exact time on his watch. He was cold. He had been cold all night. The sheets were starched, and the shiny surfaces pulled heat away from his skin.\u003c/p\u003e\n\u003cp\u003eHe reached for the phone and dialed Jodie\u0027s apartment. He got the machine. No answer in her office. Her mobile was switched off. He held the phone to his ear for a long time, listening to her cellular company telling him so, over and over again. Then he hung up and rolled out of bed.\u003c/p\u003e\n\u003cp\u003eHe walked to the window and pulled the drapes open. The view faced west and it was still dark night outside. Maybe there was a sunrise behind him on the other side of the building. Maybe it hadn\u0027t happened yet. He could hear the distant sound of hard rain on dying leaves. He turned his back on it and walked to the bathroom.\u003c/p\u003e\n\u003cp\u003eHe used the toilet and shaved slowly. Spent fifteen minutes in the shower with the water as hot as he could stand it, getting warm. Then he washed his hair with the FBI\u0027s shampoo and toweled it dry. Carried his clothes out of the steam and dressed standing by the bed. Buttoned his shirt and hung his ID around his neck. He figured room service was unlikely, so he just sat down to wait.\u003c/p\u003e\n\u003cp\u003eHe waited forty-five minutes. There was a polite knock at the door, followed by the sound of a key going into the lock. Then the door opened and Lisa Harper was standing there, backlit by the brightness of the corridor. She was smiling, mischievously. He had no idea why.\u003c/p\u003e\n\u003cp\u003e\"Good morning,\" she said.\u003c/p\u003e\n\u003cp\u003eHe raised his hand in reply. Said nothing. She was in a different suit. This one was charcoal gray, with a white shirt and a dark red tie. An exact parody of the unofficial Bureau uniform, but a whole lot of cloth had been cut out of it to make it fit. Her hair was loose. There was a wave in it, and it hung front and back of her shoulders, very long. It looked golden in the light from the corridor.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to go,\" she said. \"Breakfast meeting.\"\u003c/p\u003e\n\u003cp\u003eHe took his coat from the closet as he passed. They rode down to the lobby together and paused at the doors. It was raining hard outside. He pulled his collar up and followed her out. The light had changed from black to gray. The rain was cold. She sprinted down the walkway, and he followed a pace behind, watching her run. She looked pretty good doing it.\u003c/p\u003e\n\u003cp\u003eLamarr and Blake and Poulton were waiting for them in the cafeteria. They were in three of five chairs crowded around a four-place table by the window. They were watching him carefully as he approached. There was a white coffee jug in the center of the table, surrounded by upside-down mugs. A basket of sugar packets and little pots of cream. A pile of spoons. Napkins. A basket of doughnuts. A pile of morning newspapers. Harper took a chair and he squeezed in next to her. Lamarr was watching him, something in her eyes. Poulton looked away. Blake looked amused, in a sardonic kind of a way.\u003c/p\u003e\n\u003cp\u003e\"Ready to go to work?\" he asked.\u003c/p\u003e\n\u003cp\u003eReacher nodded. \"Sure, after I\u0027ve had some coffee.\"\u003c/p\u003e\n\u003cp\u003ePoulton turned the mugs over and Harper poured.\u003c/p\u003e\n\u003cp\u003e\"We called Fort Dix last night,\" Blake said. \"Spoke with Colonel Trent. He said he\u0027ll give you all day today. \"\u003c/p\u003e\n\u003cp\u003e\"That should do it.\"\u003c/p\u003e\n\u003cp\u003e\"He seems to like you.\"\u003c/p\u003e\n\u003cp\u003e\"No, he owes me, which is different.\"\u003c/p\u003e\n\u003cp\u003eLamarr nodded. \"Good. You need to exploit that. You know what you\u0027re looking for, right? Concentrate on the dates. Find somebody whose stand-down weeks match. My guess is he\u0027s doing it late in the week. Maybe not exactly the last day, because he\u0027s got to get back to base and calm down afterward.\"\u003c/p\u003e\n\u003cp\u003eReacher smiled. \"Great deduction, Lamarr. You get paid for this?\"\u003c/p\u003e\n\u003cp\u003eShe just looked at him and smiled back, like she knew something he didn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"What?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Just keep a civil tongue in your head,\" Blake said. \"You got a problem with what she\u0027s suggesting?\"\u003c/p\u003e\n\u003cp\u003eReacher shrugged. \"We do it by dates alone, we\u0027re going to come up with maybe a thousand names.\"\u003c/p\u003e\n\u003cp\u003e\"So narrow it down some. Get Trent to cross-reference against the women. Find somebody who served with one of them.\"\u003c/p\u003e\n\u003cp\u003e\"Or served with one of the men who got canned,\" Poulton said.\u003c/p\u003e\n\u003cp\u003eReacher smiled again. \"Awesome brainpower around this table. It could make a guy feel real intimidated.\"\u003c/p\u003e\n\u003cp\u003e\"You got better ideas, smart guy?\" Blake asked.\u003c/p\u003e\n\u003cp\u003e\"I know what I\u0027m going to do.\"\u003c/p\u003e\n\u003cp\u003e\"Well, just remember what\u0027s riding on it, OK? Lots of women in danger, one of them yours.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003e\"So get going.\"\u003c/p\u003e\n\u003cp\u003eHarper took the cue and stood up. Reacher eased out of his seat and followed her. The three at the table watched him go, something in their eyes. Harper was waiting for him at the cafeteria door, looking back at him, watching him approach, smiling at him. He stopped next to her.\u003c/p\u003e\n\u003cp\u003e\"Why\u0027s everybody looking at me?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"We checked the tape,\" she said. \"You know, the surveillance camera.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003eShe wouldn\u0027t answer. He reviewed his time in the room. He\u0027d showered twice, walked around some, pulled the drapes, slept, opened the drapes, walked around some more. That was all.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t do anything,\" he said.\u003c/p\u003e\n\u003cp\u003eShe smiled again, wider. \"No, you didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s the big deal?\"\u003c/p\u003e\n\u003cp\u003e\"Well, you know, you don\u0027t seem to have brought any pajamas.\"\u003c/p\u003e\n\u003cp\u003eA MOTOR POOL guy brought a car to the doors and left it there with the motor running. Harper watched Reacher get in and then slid into the driver\u0027s seat. They drove out through the rain, past the checkpoint, through the Marine perimeter, out to I-95. She blasted north through the spray and a fast forty minutes later turned east across the southern edge of D.C. Cruised hard for ten more minutes and made an abrupt right into the north gate of Andrews Air Force Base.\u003c/p\u003e\n\u003cp\u003e\"They assigned us the company plane,\" she said.\u003c/p\u003e\n\u003cp\u003eTwo security checks later they were at the foot of an unmarked Learjet\u0027s cabin steps. They left the car on the tarmac and climbed inside. It was taxiing before they had their seat belts fastened.\u003c/p\u003e\n\u003cp\u003e\"Should be a half hour to Dix,\" Harper said.\u003c/p\u003e\n\u003cp\u003e\"McGuire,\" Reacher corrected. \"Dix is a Marine Corps base. We\u0027ll land at McGuire Air Force Base.\"\u003c/p\u003e\n\u003cp\u003eHarper looked worried. \"They told me we\u0027re going straight there.\"\u003c/p\u003e\n\u003cp\u003e\"We are. It\u0027s the same place. Different names, is all.\"\u003c/p\u003e\n\u003cp\u003eShe made a face. \"Weird. I guess I don\u0027t understand the military.\"\u003c/p\u003e\n\u003cp\u003e\"Well, don\u0027t feel bad about it. We don\u0027t understand you either.\"\u003c/p\u003e\n\u003cp\u003eThey were on approach thirty minutes later with the sharp, abrupt motions a small jet makes in rough air. There was cloud almost all the way down, then the ground was suddenly in sight. It was raining in Jersey. Dim, and miserable. An Air Force base is a gray place to start with, and the weather wasn\u0027t helping any. McGuire\u0027s runway was wide enough and long enough to let giant transports struggle into the air, and the Lear touched down and stopped in less than a quarter of its length, like a hummingbird coming to rest on an interstate. It turned and taxied and stopped again on a distant corner of tarmac. A flat-green Chevy was racing through the rain to meet it. By the time the cabin steps were down, the driver was waiting at the bottom. He was a Marine lieutenant, maybe twenty-five, and he was getting wet.\u003c/p\u003e\n\u003cp\u003e\"Major Reacher?\" he asked.\u003c/p\u003e\n\u003cp\u003eReacher nodded. \"And this is Agent Harper, from the FBI.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant ignored her completely, like Reacher knew he would.\u003c/p\u003e\n\u003cp\u003e\"The colonel is waiting, sir,\" he said.\u003c/p\u003e\n\u003cp\u003e\"So let\u0027s go. Can\u0027t keep the colonel waiting, right?\"\u003c/p\u003e\n\u003cp\u003eReacher sat in the front of the Chevy with the lieutenant and Harper took the back. They drove out of McGuire into Dix, following narrow roadways with whitewashed curbstones through blocks of warehouses and barracks. They stopped at a huddle of brick offices a mile from McGuire\u0027s runway.\u003c/p\u003e\n\u003cp\u003e\"Door on the left, sir,\" the lieutenant said.\u003c/p\u003e\n\u003cp\u003eThe guy waited in the car, like Reacher knew he would. Reacher got out and Harper followed him, staying close to his shoulder, huddling against the weather. The wind was blowing the rain horizontal. The office building had a group of three unmarked personnel doors in the center of a blank brick wall. Reacher took the left-hand door and led Harper into a spacious anteroom full of metal desks and file cabinets. It was antiseptically clean and obsessively tidy. Brightly lit against the gloom of the morning. Three sergeants worked at separate desks. One of them glanced up and hit a button on his telephone.\u003c/p\u003e\n\u003cp\u003e\"Major Reacher is here, sir,\" he said into it.\u003c/p\u003e\n\u003cp\u003eThere was a moment\u0027s pause and then the inner office door opened and a man stepped out. He was tall, built like a greyhound, short black hair silvering at the temples. He had a lean hand extended, ready to shake.\u003c/p\u003e\n\u003cp\u003e\"Hello, Reacher,\" John Trent said.\u003c/p\u003e\n\u003cp\u003eReacher nodded. Trent owed the second half of his career to a paragraph Reacher had omitted from an official report ten years before. Trent had assumed the paragraph was written and ready to go. He had come to see Reacher, not to plead for its deletion, not to bargain, not to bribe, but just to explain, officer to officer, how he\u0027d made the mistake. Simply because he had needed Reacher to understand it was a mistake, not malice or dishonesty. He had left without asking for a thing, and then sat still and waited for the ax. It never came. The report was published and the paragraph wasn\u0027t in it. What Trent didn\u0027t know was that Reacher had never even written it. Then ten years had passed and the two men hadn\u0027t really spoken since. Not until the previous morning, when Reacher had made the first of his urgent calls from Jodie\u0027s apartment.\u003c/p\u003e\n\u003cp\u003e\"Hello, Colonel,\" Reacher said. \"This is Agent Harper, from the FBI.\"\u003c/p\u003e\n\u003cp\u003eTrent was politer than his lieutenant. His rank meant he had to be. Or maybe he was just more impressed by tall damp blondes dressed like men. Either way, he shook hands. And maybe held on to the shake longer than was necessary. And maybe smiled, just a fraction.\u003c/p\u003e\n\u003cp\u003e\"Pleased to meet you, Colonel,\" Harper said. \"And thanks in advance.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t done anything yet,\" Trent said.\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027re always grateful for cooperation anyplace we can get it, sir.\"\u003c/p\u003e\n\u003cp\u003eTrent released her hand. \"Which is a strictly limited number of places, I expect.\"\u003c/p\u003e\n\u003cp\u003e\"Fewer than we\u0027d like,\" she said. \"Considering we\u0027re all on the same side.\"\u003c/p\u003e\n\u003cp\u003eTrent smiled again.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s an interesting concept,\" he said. \"I\u0027ll do what I can, but the cooperation will be limited. As I\u0027m sure you anticipated. We\u0027re going to be examining personnel records and deployment listings that I\u0027m just not prepared to share with you. Reacher and I will do it on our own. There are issues of national and military security at stake. You\u0027re going to have to wait out here.\"\u003c/p\u003e\n\u003cp\u003e\"All day?\" she said.\u003c/p\u003e\n\u003cp\u003eTrent nodded again. \"As long as it takes. You comfortable with that?\"\u003c/p\u003e\n\u003cp\u003eIt was clear she wasn\u0027t. She looked at the floor and said nothing.\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t let me see confidential FBI stuff,\" Trent said. \"I mean, you don\u0027t really like us any more than we like you, right?\"\u003c/p\u003e\n\u003cp\u003eHarper glanced around the room. \"I\u0027m supposed to watch over him.\"\u003c/p\u003e\n\u003cp\u003e\"I understand that. Your Mr. Blake explained your role to me. But you\u0027ll be right here, outside my office. There\u0027s only one door. The sergeant will give you a desk.\"\u003c/p\u003e\n\u003cp\u003eA sergeant stood up unbidden and showed her to an empty desk with a clear view of the inner office door. She sat down slowly, unsure.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be OK there,\" Trent said. \"This could take us some time. It\u0027s a complicated business. I\u0027m sure you know how paperwork can be.\"\u003c/p\u003e\n\u003cp\u003eThen he led Reacher into the inner office and closed the door. It was a large room, windows on two walls, bookcases, cabinets, a big wooden desk, comfortable leather chairs. Reacher sat down in front of the desk and leaned back.\u003c/p\u003e\n\u003cp\u003e\"Give it two minutes, OK?\" he said.\u003c/p\u003e\n\u003cp\u003eTrent nodded. \"Read this. Look busy.\"\u003c/p\u003e\n\u003cp\u003eHe handed over a thick file in a faded green folder from a tall stack. Reacher opened it up and bent to examine it. There was a complicated chart inside, detailing projected aviation-fuel requirements for the coming six-month period. Trent walked back to the door. Opened it wide.\u003c/p\u003e\n\u003cp\u003e\"Ms. Harper?\" he called. \"Can I get you a cup of coffee?\"\u003c/p\u003e\n\u003cp\u003eReacher glanced over his shoulder and saw her staring in at him, taking in the chairs, the desk, the stack of files.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m all set, right now,\" she called back.\u003c/p\u003e\n\u003cp\u003e\"OK,\" Trent said. \"You want anything, just tell the sergeant.\"\u003c/p\u003e\n\u003cp\u003eHe closed the door again. Walked to the window. Reacher took off his ID tag and laid it on the desk. Stood up. Trent unlatched the window and opened it as wide as it would go.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t give us much time,\" he whispered. \"But I think we\u0027re in business.\"\u003c/p\u003e\n\u003cp\u003e\"They fell for it right away,\" Reacher whispered back. \"A lot sooner than I thought they would.\"\u003c/p\u003e\n\u003cp\u003e\"But how did you know you\u0027d have the escort?\"\u003c/p\u003e\n\u003cp\u003e\"Hope for the best, plan for the worst. You know how it is.\"\u003c/p\u003e\n\u003cp\u003eTrent nodded. Stuck his head out of the window and checked both directions.\u003c/p\u003e\n\u003cp\u003e\"OK, go for it,\" he said. \"And good luck, my friend.\"\u003c/p\u003e\n\u003cp\u003e\"I need a gun,\" Reacher whispered.\u003c/p\u003e\n\u003cp\u003eTrent stared at him and shook his head again, firmly.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"That, I can\u0027t do.\"\u003c/p\u003e\n\u003cp\u003e\"You have to. I need one.\"\u003c/p\u003e\n\u003cp\u003eTrent paused. He was agitated. Getting nervous.\u003c/p\u003e\n\u003cp\u003e\"Christ, OK, a gun,\" he said. \"But no ammunition. My ass is already way out on a limb on this thing.\"\u003c/p\u003e\n\u003cp\u003eHe opened a drawer and took out a Beretta M9. Same weapon as Petrosian\u0027s boys had carried, except Reacher could see this one still had its serial number intact. Trent took the clip out and thumbed the bullets back into the drawer, one by one.\u003c/p\u003e\n\u003cp\u003e\"Quiet,\" Reacher whispered urgently.\u003c/p\u003e\n\u003cp\u003eTrent nodded and clicked the empty clip back into the grip. Handed the gun to Reacher, butt-first. Reacher took it and put it in his coat pocket. Sat on the window ledge. Turned and swiveled his legs outside.\u003c/p\u003e\n\u003cp\u003e\"Have a nice day,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"You too. Take care,\" Trent whispered back.\u003c/p\u003e\n\u003cp\u003eReacher braced himself with his hands and dropped to the ground. He was in a narrow alley. It was still raining. The lieutenant was waiting in the Chevy, ten yards away, motor running. Reacher sprinted for the car and it was rolling before his door was closed. The mile back to McGuire took little over a minute. The car raced out onto the tarmac and headed straight for a Marine Corps helicopter. Its belly door was standing open and the rotor blade was turning fast. The rain in the air was whipping up into spiral patterns.\u003c/p\u003e\n\u003cp\u003e\"Thanks, kid,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eHe stepped out of the car and across to the chopper\u0027s ramp and ran up into the dark. The door whirred shut behind him and the engine noise built to a roar. He felt the machine come off the ground and two pairs of hands grabbed him and pushed him into his seat. He buckled his harness and a headset was thrust at him. He put it on and the intercom crackle started at the same time as the interior lights came on. He saw he was sitting in a canvas chair between two Marine load-masters.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to the Coast Guard heliport in Brooklyn, \" the pilot called through. \"Close as we can get without filing a flight plan, and filing a flight plan ain\u0027t exactly on the agenda today, OK?\"\u003c/p\u003e\n\u003cp\u003eReacher thumbed his mike. \"Suits me, guys. And thanks.\"\u003c/p\u003e\n\u003cp\u003e\"Colonel must owe you big,\" the pilot said.\u003c/p\u003e\n\u003cp\u003e\"No, he just likes me,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eThe guy laughed and the helicopter swung in the air and settled to a bellowing cruise. \u003c/p\u003e","sourceLink":"https://allnovel.net/running-blind-jack-reacher-4/page-10.html","bookId":2342,"creation":"Oct 5, 2019 9:59:26 AM","modification":"Oct 5, 2019 9:59:26 AM"}
