{"id":65917,"no":21,"title":"Page 21","content":"\u003cp\u003eTHE MEETING BROKE up in a sudden burst of energy. Blake took the elevator one floor down, back to his office to place the call to James Cozo in New York. Poulton had calls of his own to make to the Bureau office in Spokane, where the local guys were checking with parcel carriers and car rental operations. Harper went up to the travel desk to organize airline tickets. Reacher was left alone in the seminar room, sitting at the big table, ignoring the television, staring at a fake window like he was looking out at a view.\u003c/p\u003e\n\u003cp\u003eHe sat like that for nearly twenty minutes, just waiting. Then Harper came back in. She was carrying a thick sheaf of new paperwork.\u003c/p\u003e\n\u003cp\u003e\"More bureaucracy,\" she said. \"If we pay you, we\u0027ve got to insure you. Travel desk regulations.\"\u003c/p\u003e\n\u003cp\u003eShe sat down opposite him and took a pen from her inside pocket.\u003c/p\u003e\n\u003cp\u003e\"Ready for this?\" she said.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e\"Full name?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Jack Reacher,\" he said.\u003c/p\u003e\n\u003cp\u003e\"That the whole thing?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"Not a very long name, is it?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. Said nothing. She wrote it down. Two words, eleven letters, in a space which ran the whole width of the form.\u003c/p\u003e\n\u003cp\u003e\"Date of birth?\"\u003c/p\u003e\n\u003cp\u003eHe told her. Saw her calculating his age. Saw surprise in her face.\u003c/p\u003e\n\u003cp\u003e\"Older or younger?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Than what?\"\u003c/p\u003e\n\u003cp\u003e\"Than you thought.\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Oh, older. You don\u0027t look it.\"\u003c/p\u003e\n\u003cp\u003e\"Bullshit,\" he said. \"I look about a hundred. Certainly I feel about a hundred.\"\u003c/p\u003e\n\u003cp\u003eShe smiled again. \"You probably clean up pretty good. Social Security number?\"\u003c/p\u003e\n\u003cp\u003eHis generation of servicemen, it was the same as his military ID. He rattled through it in the military manner, random monotone sounds representing whole numbers between zero and nine.\u003c/p\u003e\n\u003cp\u003e\"Full address?\"\u003c/p\u003e\n\u003cp\u003e\"No fixed abode,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You sure?\"\u003c/p\u003e\n\u003cp\u003e\"Why wouldn\u0027t I be?\"\u003c/p\u003e\n\u003cp\u003e\"What about Garrison?\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\"\u003c/p\u003e\n\u003cp\u003e\"Your house,\" she said. \"That would be your address, right?\"\u003c/p\u003e\n\u003cp\u003eHe stared at her. \"I guess so. Sort of. I never really thought about it.\"\u003c/p\u003e\n\u003cp\u003eShe stared back. \"You own a house, you\u0027ve got an address, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003e\"OK, put Garrison.\"\u003c/p\u003e\n\u003cp\u003e\"Street name and number?\"\u003c/p\u003e\n\u003cp\u003eHe dredged it up from his memory and told her.\u003c/p\u003e\n\u003cp\u003e\"Zip?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know your own zip code?\"\u003c/p\u003e\n\u003cp\u003eHe was quiet for a second. She looked at him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got it real bad, haven\u0027t you?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Got what?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever. Call it denial, I guess.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, slowly. \"Yes, I guess I\u0027ve got it real bad.\"\u003c/p\u003e\n\u003cp\u003e\"So what are you going to do about it?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Maybe I\u0027ll get used to it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"What would you do?\"\u003c/p\u003e\n\u003cp\u003e\"People should do what they really want,\" she said. \"I think that\u0027s important.\"\u003c/p\u003e\n\u003cp\u003e\"Is that what you do?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"My folks wanted me to stay in Aspen. They wanted me to be a teacher or something. I wanted to be in law enforcement. It was a big battle.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not my parents doing this to me. They\u0027re dead.\"\u003c/p\u003e\n\u003cp\u003e\"I know. It\u0027s Jodie.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"No, it\u0027s not Jodie. It\u0027s me. I\u0027m doing this to myself.\"\u003c/p\u003e\n\u003cp\u003eShe nodded again. \"OK.\"\u003c/p\u003e\n\u003cp\u003eThe room went quiet.\u003c/p\u003e\n\u003cp\u003e\"So what should I do?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged, warily. \"I\u0027m not the person to ask.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"I might not give the answer you want.\"\u003c/p\u003e\n\u003cp\u003e\"Which is?\"\u003c/p\u003e\n\u003cp\u003e\"You want me to say you should stay with Jodie. Settle down and be happy.\"\u003c/p\u003e\n\u003cp\u003e\"I do?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"But you can\u0027t say that?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"No, I can\u0027t,\" she said. \"I had a boyfriend. It was pretty serious. He was a cop in Aspen. There\u0027s always tension, you know, between cops and the Bureau. Rivalry. Silly, really, no reason for it, but it\u0027s there. It spread into personal things. He wanted me to quit. Begged me. I was torn, but I said no.\"\u003c/p\u003e\n\u003cp\u003e\"Was that the right choice?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"For me, yes, it was. You have to do what you really want.\"\u003c/p\u003e\n\u003cp\u003e\"Would it be the right choice for me?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"I can\u0027t say. But probably.\"\u003c/p\u003e\n\u003cp\u003e\"First I need to figure out what I really want.\"\u003c/p\u003e\n\u003cp\u003e\"You know what you really want,\" she said. \"Everybody always does, instinctively. Any doubt you\u0027re feeling is just noise, trying to bury the truth, because you don\u0027t want to face it.\"\u003c/p\u003e\n\u003cp\u003eHe looked away, back to the fake window.\u003c/p\u003e\n\u003cp\u003e\"Occupation?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Silly question,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll put consultant.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"That dignifies it, somewhat.\"\u003c/p\u003e\n\u003cp\u003eThen there were footsteps in the corridor and the door opened again and Blake and Poulton hurried inside. More paper in their hands, and the glow of progress in their faces.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re maybe halfway to starting to get somewhere, \" Blake said. \"News in from Spokane.\"\u003c/p\u003e\n\u003cp\u003e\"The local UPS driver quit three weeks ago,\" Poulton said. \"Moved to Missoula, Montana, works in a warehouse. But they spoke to him by phone and he thinks maybe he remembers the delivery.\"\u003c/p\u003e\n\u003cp\u003e\"So doesn\u0027t the UPS office have paperwork?\" Harper asked.\u003c/p\u003e\n\u003cp\u003eBlake shook his head. \"They archive it after eleven days. And we\u0027re looking at two months ago. If the driver can pinpoint the day, we might get it.\"\u003c/p\u003e\n\u003cp\u003e\"Anybody know anything about baseball?\" Poulton asked.\u003c/p\u003e\n\u003cp\u003eReacher shrugged. \"Couple of guys worked out an overall all-time top ten and only two players had the letter u in their names.\"\u003c/p\u003e\n\u003cp\u003e\"Why baseball?\" Harper asked.\u003c/p\u003e\n\u003cp\u003e\"Day in question, some Seattle guy hit a grand slam,\" Blake said. \"The driver heard it on his radio, remembers it.\"\u003c/p\u003e\n\u003cp\u003e\" Seattle, he would remember it,\" Reacher said. \"Rare occurrence.\"\u003c/p\u003e\n\u003cp\u003e\"Babe Ruth,\" Poulton said. \"Who\u0027s the other one?\"\u003c/p\u003e\n\u003cp\u003e\"Honus Wagner,\" Reacher said.\u003c/p\u003e\n\u003cp\u003ePoulton looked blank. \"Never heard of him.\"\u003c/p\u003e\n\u003cp\u003e\"And Hertz came through,\" Blake said. \"They think they remember a real short rental, Spokane airport, the exact day Alison died, in and out inside about two hours.\"\u003c/p\u003e\n\u003cp\u003e\"They got a name?\" Harper asked.\u003c/p\u003e\n\u003cp\u003eBlake shook his head. \"Their computer\u0027s down. They\u0027re working on it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t the desk people remember?\"\u003c/p\u003e\n\u003cp\u003e\"Are you kidding? Lucky if those people remember their own names.\"\u003c/p\u003e\n\u003cp\u003e\"So when will we get it?\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow, I guess. Morning, with a bit of luck. Otherwise the afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"Three-hour time difference. It\u0027ll be the afternoon for us.\"\u003c/p\u003e\n\u003cp\u003e\"Probably.\"\u003c/p\u003e\n\u003cp\u003e\"So does Reacher still go?\"\u003c/p\u003e\n\u003cp\u003eBlake paused and Reacher nodded.\u003c/p\u003e\n\u003cp\u003e\"I still go,\" he said \"The name will be phony, for sure. And the UPS thing will lead nowhere. This guy\u0027s way too smart for basic paper-trail errors.\"\u003c/p\u003e\n\u003cp\u003eEverybody waited. Then Blake nodded.\u003c/p\u003e\n\u003cp\u003e\"I guess I agree,\" he said. \"So Reacher still goes.\"\u003c/p\u003e\n\u003cp\u003eTHEY GOT A ride in a plain Bureau Chevrolet and were at the airport in D.C. before dark. They lined up for the United shuttle with the lawyers and the lobbyists. Reacher was the only person on the line not wearing a business suit, male or female. The cabin crew seemed to know most of the passengers and greeted them at the airplane door like regulars. Harper walked all the way down the aisle and chose seats right at the back.\u003c/p\u003e\n\u003cp\u003e\"No rush to get off,\" she said. \"You\u0027re not seeing Cozo until tomorrow.\"\u003c/p\u003e\n\u003cp\u003eReacher said nothing.\u003c/p\u003e\n\u003cp\u003e\"And Jodie won\u0027t be home yet,\" she said. \"Lawyers work hard, right? Especially the ones fixing to be partner. \"\u003c/p\u003e\n\u003cp\u003eHe nodded. He\u0027d just gotten around to figuring the same thing.\u003c/p\u003e\n\u003cp\u003e\"So we\u0027ll sit here,\" she said. \"It\u0027s quieter.\"\u003c/p\u003e\n\u003cp\u003e\"The engines are right back here,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But the guys in the suits aren\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe smiled and took the window seat and buckled up.\u003c/p\u003e\n\u003cp\u003e\"And we can talk back here,\" she said. \"I don\u0027t like people listening.\"\u003c/p\u003e\n\u003cp\u003e\"We should sleep,\" he said. \"We\u0027re going to be busy.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but talk first. Five minutes, OK?\"\u003c/p\u003e\n\u003cp\u003e\"Talk about what?\"\u003c/p\u003e\n\u003cp\u003e\"The scratches on her face,\" she said. \"I need to understand what that\u0027s about.\"\u003c/p\u003e\n\u003cp\u003eHe glanced across at her. \"Why? You figuring to crack this all on your own?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I wouldn\u0027t turn down the opportunity to make the arrest.\"\u003c/p\u003e\n\u003cp\u003e\"Ambitious?\"\u003c/p\u003e\n\u003cp\u003eShe made a face. \"Competitive, I guess.\"\u003c/p\u003e\n\u003cp\u003eHe smiled again. \"Lisa Harper against the pointy-heads. \"\u003c/p\u003e\n\u003cp\u003e\"Damn right,\" she said. \"Plain-vanilla agents, they treat us like shit.\"\u003c/p\u003e\n\u003cp\u003eThe engines wound up to a scream and the plane rolled backward from the gate. Swung its nose around and lumbered toward the runway.\u003c/p\u003e\n\u003cp\u003e\"So what about the marks on her face?\" Harper asked.\u003c/p\u003e\n\u003cp\u003e\"I think it proves my point,\" Reacher said. \"I think it\u0027s the single most valuable piece of evidence we\u0027ve gotten so far.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"It was so halfhearted, wasn\u0027t it? So tentative? I think it proves the guy is hiding behind appearances. It proves he\u0027s pretending. Like there\u0027s me, looking at the cases, and I\u0027m thinking where\u0027s the violence? Where\u0027s the anger? And simultaneously somewhere the guy is reviewing his progress, and he\u0027s thinking oh my God, I\u0027m not showing any anger, and so on the next one he tries to show some, but he\u0027s not really feeling any, so it comes across as really nothing much at all.\"\u003c/p\u003e\n\u003cp\u003eHarper nodded. \"Not even enough to make her flinch, according to Stavely.\"\u003c/p\u003e\n\u003cp\u003e\"Bloodless,\" Reacher said. \"Almost literally. Like a technical exercise, which it was, because this whole thing is a technical exercise, some cast-iron down-to-earth motive hiding behind a psycho masquerade.\"\u003c/p\u003e\n\u003cp\u003e\"He made her do it to herself.\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"But why would he?\"\u003c/p\u003e\n\u003cp\u003e\"Worried about fingerprints? About revealing if he\u0027s left-handed or right-handed? Demonstrating his control? \"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a lot of control, don\u0027t you think? But it explains why it was so halfhearted. She wouldn\u0027t really hurt herself.\"\u003c/p\u003e\n\u003cp\u003e\"I guess not,\" he said, sleepily.\u003c/p\u003e\n\u003cp\u003e\"Why Alison, though? Why did he wait until number four?\"\u003c/p\u003e\n\u003cp\u003e\"Ceaseless quest for perfection, I suppose. A guy like this, he\u0027s thinking and refining all the time.\"\u003c/p\u003e\n\u003cp\u003e\"Does it make her special in some way? Significant? \"\u003c/p\u003e\n\u003cp\u003eReacher shrugged. \"That\u0027s pointy-head stuff. If they thought so, I\u0027m sure they\u0027d have said.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he knew her better than the others. Worked with her more closely.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. But don\u0027t stray into their territory. Keep your feet on the ground. You\u0027re plain-vanilla, remember? \"\u003c/p\u003e\n\u003cp\u003eHarper nodded. \"And the plain-vanilla motive is money.\"\u003c/p\u003e\n\u003cp\u003e\"Has to be,\" Reacher said. \"Always love or money. And it can\u0027t be love, because love makes you crazy, and this guy isn\u0027t crazy.\"\u003c/p\u003e\n\u003cp\u003eThe plane turned and stopped hard against its brakes at the head of the runway. Paused for a second and jumped forward and accelerated. Unstuck itself and lifted heavily into the air. The lights of D.C. spun past the window.\u003c/p\u003e\n\u003cp\u003e\"Why did he change the interval?\" Harper asked over the noise of the climb.\u003c/p\u003e\n\u003cp\u003eReacher shrugged. \"Maybe he just wanted to.\"\u003c/p\u003e\n\u003cp\u003e\"Wanted to?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he just did it for fun. Nothing more disruptive for you guys than a pattern that changes.\"\u003c/p\u003e\n\u003cp\u003e\"Will it change again?\"\u003c/p\u003e\n\u003cp\u003eThe plane rocked and tilted and leveled, and the engine noise fell away to a cruise.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s over,\" Reacher said. \"The women are guarded, and you\u0027ll be making the arrest pretty soon.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re that confident?\"\u003c/p\u003e\n\u003cp\u003eReacher shrugged again. \"No point going in expecting to lose.\"\u003c/p\u003e\n\u003cp\u003eHe yawned and jammed his head between the seatback and the plastic bulkhead. Closed his eyes.\u003c/p\u003e\n\u003cp\u003e\"Wake me when we get there,\" he said.\u003c/p\u003e\n\u003cp\u003eBUT THE THUMP and whine of the wheels coming down woke him, three thousand feet above and three miles east of La Guardia in New York. He looked at his watch and saw he\u0027d slept fifty minutes. His mouth tasted tired.\u003c/p\u003e\n\u003cp\u003e\"You want to get some dinner?\" Harper asked him.\u003c/p\u003e\n\u003cp\u003eHe blinked and checked his watch again. He had at least an hour to kill before Jodie\u0027s earliest possible ETA. Probably two hours. Maybe three.\u003c/p\u003e\n\u003cp\u003e\"You got somewhere in mind?\" he asked back.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know New York too well,\" she said. \"I\u0027m an Aspen girl.\"\u003c/p\u003e\n\u003cp\u003e\"I know a good Italian,\" he said.\u003c/p\u003e\n\u003cp\u003e\"They put me in a hotel on Park and Thirty-sixth,\" she said. \"I assume you\u0027re staying at Jodie\u0027s.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I assume I am, too.\"\u003c/p\u003e\n\u003cp\u003e\"So is the restaurant near Park and Thirty-sixth?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Cab ride. This is a big town.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head in turn. \"No cabs. They\u0027ll send a car. Ours for the duration.\"\u003c/p\u003e\n\u003cp\u003eThe driver was waiting at the gate. Same guy who had driven them before. His car was parked in the tow lane outside Arrivals, with a large card with the Bureau shield printed on it propped behind the windshield. Congestion was bad, all the way into Manhattan. It was the second half of rush hour. But the guy drove like he had nothing to fear from the traffic cops and they were outside Mostro\u0027s within forty minutes of the plane touching down.\u003c/p\u003e\n\u003cp\u003eThe street was dark, and the restaurant glowed like a promise. Four tables were occupied and Puccini was playing. The owner saw Reacher on the sidewalk and hurried to the door, beaming. Showed them to a table and brought the menus himself.\u003c/p\u003e\n\u003cp\u003e\"This is the place Petrosian was leaning on?\" Harper asked.\u003c/p\u003e\n\u003cp\u003eReacher nodded toward the owner. \"Look at the little guy. Did he deserve that?\"\u003c/p\u003e\n\u003cp\u003e\"You should have left it to the cops.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Jodie said.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s clearly a smart woman.\"\u003c/p\u003e\n\u003cp\u003eIt was warm inside the huge room, and Harper slipped her jacket off and twisted to hang it over the back of her chair. Her shirt twisted with her, tightening and loosening. First time since he\u0027d met her, she was wearing a bra. She followed his gaze and blushed.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t sure who we\u0027d be meeting,\" she said.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be meeting somebody,\" he said. \"That\u0027s for damn sure. Sooner or later.\"\u003c/p\u003e\n\u003cp\u003eThe way he said it made her glance up at him.\u003c/p\u003e\n\u003cp\u003e\"Now you really want this guy, right?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Yes, now I do.\"\u003c/p\u003e\n\u003cp\u003e\"For Amy Callan? You liked her, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"She was OK. I liked Alison Lamarr better, what I saw of her. But I want this guy for Rita Scimeca.\"\u003c/p\u003e\n\u003cp\u003e\"She likes you too,\" she said. \"I could tell.\"\u003c/p\u003e\n\u003cp\u003eHe nodded again.\u003c/p\u003e\n\u003cp\u003e\"Did you have a relationship with her?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"That\u0027s a very vague word.\"\u003c/p\u003e\n\u003cp\u003e\"An affair?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I only met her after she was raped. Because she was raped. She wasn\u0027t in any kind of a state to be having affairs. Still isn\u0027t, by the look of it. I was a little older than she was, maybe five or six years. We got very friendly, but it was like a paternalistic thing, you know, which I guess she needed, but she hated it at the same time. I had to work hard to make it feel at least brotherly, as I recall. We went out a few times, but like big brother and little sister, always completely platonic. She was like a wounded soldier, recuperating.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how she saw it?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly like that,\" he said. \"Like a guy who has his leg shot off. It can\u0027t be denied, but it can be dealt with. And she was dealing with it.\"\u003c/p\u003e\n\u003cp\u003e\"And now this guy is setting her back.\"\u003c/p\u003e\n\u003cp\u003eReacher nodded. \"That\u0027s the problem. Hiding behind this harassment thing, he\u0027s pounding on an open wound. If he was up-front about it, it would be OK. Rita could accept that as a separate problem, I think. Like a one-legged guy could deal with getting the flu. But it\u0027s coming across like a taunt, about her past.\"\u003c/p\u003e\n\u003cp\u003e\"And that makes you mad.\"\u003c/p\u003e\n\u003cp\u003e\"I feel responsible for Rita, he\u0027s messing with her, so he\u0027s messing with me.\"\u003c/p\u003e\n\u003cp\u003e\"And people shouldn\u0027t mess with you.\"\u003c/p\u003e\n\u003cp\u003e\"No, they shouldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Or?\"\u003c/p\u003e\n\u003cp\u003e\"Or they\u0027re deep in the shit.\"\u003c/p\u003e\n\u003cp\u003eShe nodded, slowly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve convinced me,\" she said.\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"You convinced Petrosian too, I guess,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I never went near Petrosian,\" he said. \"Never laid eyes on him.\"\u003c/p\u003e\n\u003cp\u003e\"But you are kind of arrogant, you know?\" she said. \"Prosecutor, judge, jury, executioner, all in one? What about the rules?\"\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003e\"Those are the rules,\" he said. \"People mess with me, they find that out pretty damn quick.\"\u003c/p\u003e\n\u003cp\u003eHarper shook her head. \"We arrest this guy, remember? We find him and we arrest him. We\u0027re going to do this properly. According to my rules, OK?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I already agreed to that.\"\u003c/p\u003e\n\u003cp\u003eThen the waiter came over and stood near, pen poised. They ordered two courses each and sat in silence until the food came. Then they ate in silence. There wasn\u0027t much of it. But it was as good as always. Maybe even better. And it was on the house.\u003c/p\u003e\n\u003cp\u003eAFTER COFFEE THE FBI driver took Harper to her hotel uptown and Reacher walked down to Jodie\u0027s place, alone and enjoying it. He let himself into her lobby and rode up in the elevator. Let himself into her apartment. The air was still and silent. The rooms were dark. Nobody home. He switched on lamps and closed blinds. Sat down on the living room sofa to wait. \u003c/p\u003e","sourceLink":"https://allnovel.net/running-blind-jack-reacher-4/page-21.html","bookId":2342,"creation":"Oct 5, 2019 9:59:26 AM","modification":"Oct 5, 2019 9:59:26 AM"}
