{"id":100342,"no":17,"title":"Page 17","content":"\u003cp\u003eGina looked away. Charles’s face was grim.\u003c/p\u003e\n\u003cp\u003e“You stay till Paul gets in this morning,” Meaty said. “He’s the social worker. He can give you some contacts—”\u003c/p\u003e\n\u003cp\u003eThe rest of my brief life flashed before my eyes. “Am I running away?”\u003c/p\u003e\n\u003cp\u003eMeaty snorted. “Running from a Hound? No. You’re going to court.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY\u003c/p\u003e\n\u003cp\u003eI tried to be helpful for the rest of the night. I really did. But the vampire parade had robbed me of some of my enthusiasm. It was hard not to be worried about the future when it seemed I had so little of it left.\u003c/p\u003e\n\u003cp\u003eI stayed strong until shift change. I couldn’t leave the floor just yet—I needed to wait for the social worker, who didn’t get in till eight. Plus the locker room would be full of incoming day shifters. I’d be safest if I just hid in an empty room until seven-thirty. I ducked into room five.\u003c/p\u003e\n\u003cp\u003eThe blinds were drawn, and the room was black, except for the dim light of a monitor in standby mode. I walked across the room, reaching for the shelf I knew would be there, and managed to brace myself against it before I sobbed. I inhaled and exhaled deeply, breathing in the pungent mix of floor wax and something else, trying to keep from completely breaking down.\u003c/p\u003e\n\u003cp\u003e“I think I hear a ghost.”\u003c/p\u003e\n\u003cp\u003eI whirled around. There was a patient in the bed. I could only see his outline now that my eyes had adjusted. “I’m sorry, I—I thought this room was empty.”\u003c/p\u003e\n\u003cp\u003e“Only in a manner of speaking. I take it you’re not my nurse today?”\u003c/p\u003e\n\u003cp\u003eI shook my head, wondering if he could see me. “No. I’m not—I should be going—”\u003c/p\u003e\n\u003cp\u003e“You can stay if you’d like.”\u003c/p\u003e\n\u003cp\u003eIf he was a daytimer, he’d have had an isolation cart outside. I wasn’t in any immediate danger. “Thanks.” I ran the back of my hand over my face, mopping up my tears.\u003c/p\u003e\n\u003cp\u003e“The hospital’s a stressful place,” he continued.\u003c/p\u003e\n\u003cp\u003e“No kidding,” I muttered. But—foisting my problems on a patient wasn’t appropriate. It wasn’t good for them, and it definitely wasn’t good for me. I took a deep breath to compose myself. “Sorry to wake you up,” I said, and I made for the door.\u003c/p\u003e\n\u003cp\u003e“It’s quite all right,” he said, as the door closed behind me.\u003c/p\u003e\n\u003cp\u003eI changed back into my civilian clothes, brewing with anger and fear. There was a series of small rooms at the end of our floor: our break room, a broom closet, our manager’s office, and the social worker’s office. I paced outside his door.\u003c/p\u003e\n\u003cp\u003ePaul was my height, and cute despite nerd-thick glasses. They managed to give him a hopeful look, a useful trait in a social worker. Today he was overburdened with charts and flustered-looking. He had winter gloves on—he’d always had gloves on, all the times I’d ever seen him before. “Hello,” he said, looking at me at my station in front of his door.\u003c/p\u003e\n\u003cp\u003e“Do you have a minute?”\u003c/p\u003e\n\u003cp\u003e“Only one. It’s a rounds day—” He set his bags down to find the key to his door.\u003c/p\u003e\n\u003cp\u003e“I was summoned,” I explained.\u003c/p\u003e\n\u003cp\u003e“Jury duty?”\u003c/p\u003e\n\u003cp\u003e“By the vampires. For a tribunal. On the darkest night.”\u003c/p\u003e\n\u003cp\u003eOne of his eyebrows peeked up above his glasses frame. “Oh, no.” He unlocked his door, and opened it for me. “Please, come in.”\u003c/p\u003e\n\u003cp\u003eI sat down in the only extra chair in the narrow room. Colored papers were stacked on every surface, making it look like a third-grade classroom, until you started reading what was printed on them—petitions for nonemergency care, DNRs, lists of were-safe house addresses. Maybe anything I ever wanted to know about Y4 was in here, if I could find it. It was a short office but at the back it took a right-hand turn and I couldn’t see what lay beyond.\u003c/p\u003e\n\u003cp\u003eHe sat behind his desk and hit a few desktop keys. As his computer came to life, he took his winter gloves off and replaced them with latex hospital gloves from a box beside his keyboard. He noticed me watching him. “Germs,” he explained. Indeed. I nodded. “So how can I help you?” he went on.\u003c/p\u003e\n\u003cp\u003e“I was hoping you’d know. I guess I’m looking for representation.” I crossed my hands in my lap and tried to look innocent and worth helping, instead of angry and exhausted. “They want to see me for a tribunal on the darkest night. I don’t even know when that is.”\u003c/p\u003e\n\u003cp\u003eHe pointed to a calendar on the wall behind his computer. In addition to the dates, it had all the phases of the moon. “It’s the first night with no moon in the sky. Vampire powers wax and wane against the cycle of the moon, the exact opposite of weres, so it’s when vampires are at their strongest. Conversely, weres are fully mortal then, and easily injured, so that night they tend to hide.”\u003c/p\u003e\n\u003cp\u003eThat sounded familiar from the training class. At the time, everything had seemed so unreal—the flyers on being safe around vampires that I’d gotten to read, take a test on, and then hand in with the test—in retrospect it’d been a lot like going to the DMV, and not much like nursing on Y4 at all. Who could believe any of it until you’d seen it for real, anyhow?\u003c/p\u003e\n\u003cp\u003ePaul pointed at the calendar. “Technically, it’s seven nights from now.” He leaned forward, and touched my knee. I started at the contact. “Edie, right?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“How in trouble are you?” He didn’t take his hand away. I was tempted to reach out and squeeze it even if he was a germaphobe.\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003e“Mind if I ask what you did to annoy them?”\u003c/p\u003e\n\u003cp\u003e“Mind if I ask if you’re off the record?” I asked, because I thought I had to.\u003c/p\u003e\n\u003cp\u003ePaul took his hand back and I found that I missed the simple human contact. He crossed his arms and nodded. “Tell me things hypothetically.”\u003c/p\u003e\n\u003cp\u003e“I might have killed a vampire to save a little girl. Technically there’s a chance I might have been under a compulsion at the time … but I don’t think they care about that so much.” I didn’t either. What was it I’d told Meaty? That I’d have done it again? Knowing this, would I have? Now?\u003c/p\u003e\n\u003cp\u003e“Well, that’s clear-cut—you’re allowed to kill vampires in self-defense. He shouldn’t have been fighting you, you’re a clear noncombatant.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t exactly self-defense. I sort of—hypothetically—went to his home—lair? Lair.” I reached and thumbed through a pile of pamphlets that turned out to be “Surviving Congestive Heart Failure” in three languages, one of which I’d never seen before. “She was there. I killed him,” I said, without looking in his eyes.\u003c/p\u003e\n\u003cp\u003e“Hypothetically,” he corrected.\u003c/p\u003e\n\u003cp\u003e“Hypothetically,” I agreed.\u003c/p\u003e\n\u003cp\u003e“She was in danger, yes?”\u003c/p\u003e\n\u003cp\u003e“Being held against her will, and worse.”\u003c/p\u003e\n\u003cp\u003ePaul shook his head. “You’re still safe, then. The safety of the human outweighs the concerns of the vampires, according to the terms of the Consortium policy, at least inside County lines. You were still inside the County, weren’t you?”\u003c/p\u003e\n\u003cp\u003eIt beat the hell out of me. “Maybe. But she, uh … wasn’t human.”\u003c/p\u003e\n\u003cp\u003ePaul exhaled through pursed lips. “I see. Do you know where she is? Can she testify for you?”\u003c/p\u003e\n\u003cp\u003e“I have no idea. She ran off. She was in danger, I’m sure of it.” I could go back to Mr. November’s house as soon as I finished here. But I was sure if I knew where he lived, so did they—I couldn’t expect to find any evidence supporting my side of things, and so what if I did? Dren said himself that I’d probably killed her—it was awfully hard to prove that I hadn’t, without her in the flesh, undead as it may be.\u003c/p\u003e\n\u003cp\u003e“It could have been entrapment. Someone else wanted him dead, compelled you, and then things went from there,” Paul suggested.\u003c/p\u003e\n\u003cp\u003e“I don’t think so.” I sank my head into my hands. “I think I just made another big mistake. It’s got that feeling about it, you know?” Bitterness surged across my tongue and my heart was crawling up my throat. I knew what it felt like to make mistakes. I’d made tons of them before.\u003c/p\u003e\n\u003cp\u003e“Well, you still need representation, whatever the actual events.”\u003c/p\u003e\n\u003cp\u003e“Can you do it?”\u003c/p\u003e\n\u003cp\u003ePaul snorted and shook his head. “I’m not qualified. But here—” He stood and walked to the back of his office and took the turn. I heard rummaging and the hum of a Xerox before he returned to me and handed me a slip of warm paper. “Call these names. Explain the situation but be circumspect till one of them swears to take the case. Make them swear explicitly—vampires love a loophole.”\u003c/p\u003e\n\u003cp\u003eThe paper had three names and phone numbers. All the vampire lawyers lived in better area codes than I did.\u003c/p\u003e\n\u003cp\u003e“And if none of them swear to?” I asked, folding the paper in half and putting it carefully into my pocket.\u003c/p\u003e\n\u003cp\u003ePaul smiled and shook his head again. “I’ve learned in my line of work that it’s best to cross bridges once you come to them.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-ONE\u003c/p\u003e\n\u003cp\u003eI drove home as fast as I could. I got in the door, and forced myself to clean the cat box, change my clothes, and wash my face, before sitting down with my phone.\u003c/p\u003e\n\u003cp\u003eThe first number was a wrong one—the people on the other end of the line didn’t seem to understand what I was asking, and when I tried to “hypothetically” explain they threatened to actually call the police.\u003c/p\u003e\n\u003cp\u003eThe second had a pleasant-sounding secretary answer. “I’m sorry, Mr. Henrich’s docket is full,” she said, before hanging up.\u003c/p\u003e\n\u003cp\u003eI looked at the last one. “Please work.” Minnie came up and rammed her head against my thigh. I dialed the last number and prayed.\u003c/p\u003e\n\u003cp\u003eIt rang and rang. My stomach sank.\u003c/p\u003e\n\u003cp\u003eAnd then someone answered. The line went live, but with no sounds.\u003c/p\u003e\n\u003cp\u003e“Hello?” I asked.\u003c/p\u003e\n\u003cp\u003e“Do you know what time it is?” came the response.\u003c/p\u003e\n\u003cp\u003eI knew that voice. I was that voice. I was an idiot. Of course vampires slept during the day. “I’m sorry. I’ll call back—”\u003c/p\u003e\n\u003cp\u003e“I’m already up. What do you want?” the voice said, in an unhappy tone. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightshifted-edie-spence-1/page-17.html","bookId":2618,"creation":"Oct 5, 2019 6:52:34 PM","modification":"Oct 5, 2019 6:52:34 PM"}
