{"id":100358,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI wondered if they wanted differently for him, like Anna’s parents had wanted differently for her, but it wasn’t exactly a subject I could broach. Telling them to give the kid more fiber to eat was one thing—asking them if they wanted out of the system would be another. I stayed there staring for a moment too long, wondering if there was some sort of vampire and vampire-related-humans underground railroad that could help either them or me. When the mother glanced over, I pretended to be watching the same juicing infomercial they were before making my escape.\u003c/p\u003e\n\u003cp\u003eThe second patient had recently been ICU level, but was now on the mend. Three stab wounds to the chest and a shattered kneecap that probably didn’t get busted on its own. But his daytimer body was taking care of business, with the help of a few small vamp blood transfusions, just a cc or two at a time. He wouldn’t get off the phone, too busy making deals with his bookie, so I took his temperature in his armpit instead of his mouth. Maybe that’s what’d gotten him into this mess. I wasn’t in the mood to fight him on it, regardless.\u003c/p\u003e\n\u003cp\u003eI was finishing up all my charting, taking enough time to keep my handwriting legible, when I heard “Edie—come into the break room now!” in Meaty’s nursing voice.\u003c/p\u003e\n\u003cp\u003eI jumped up and looked around. Everyone else on the floor was gone. Oh, shit.\u003c/p\u003e\n\u003cp\u003eI ran into the break room and saw Gina, Charles, and Meaty standing there, around … a commemorative cake. It was shaped like a coffin, frosted by hand, and my name was scrawled across the top in blue icing.\u003c/p\u003e\n\u003cp\u003ePerhaps in any other setting it would have been morbid or tacky—no, it was still morbid and tacky—but I could tell from the expectant looks on their faces that it was morbid and tacky with love. Tears welled up. I looked from one to the other of them. “Thanks, guys. Really. You’re too sweet.”\u003c/p\u003e\n\u003cp\u003e“Well, you know—” Meaty said, and shrugged.\u003c/p\u003e\n\u003cp\u003e“Gina did all the hard work. I just tasted this part back here, for quality control,” Charles said, pointing to a discreet finger swipe in the icing on the cake’s far side.\u003c/p\u003e\n\u003cp\u003eGina stuck her tongue out at Charles. “Hey—have I told you you owe me twenty bucks?”\u003c/p\u003e\n\u003cp\u003e“What flavor is it?” I asked quickly, hoping to deflect attention.\u003c/p\u003e\n\u003cp\u003e“Twenty bucks, eh?” Charles asked, looking askance at me. I started blushing furiously.\u003c/p\u003e\n\u003cp\u003e“How did you spend twenty bucks on cake mix?” Meaty wondered aloud. “You’ll have to spot me. I’ve only got a five.”\u003c/p\u003e\n\u003cp\u003eCharles and Gina went back to the floor soon after, and Meaty followed them, leaving me to eat alone. The cake was a delicious chocolate with blackberry filling, and I realized it was the second time I’d had cake that night. Usually I’d feel guilty, but hey, if this particular cake was accurate, I might as well eat up. My patients were fine, anyhow. I wondered who Ti was out there scaring by being a frighteningly scarred-up and pissed-off zombie, and if Sike and Mr. Weatherton, Esquire, were doing anything at all yet on my behalf.\u003c/p\u003e\n\u003cp\u003eLeaving half of my piece of cake behind, I trotted back to where my phone was in the locker room and made a phone call. This time Sike recognized my number.\u003c/p\u003e\n\u003cp\u003e“Nothing yet,” she said, and hung up.\u003c/p\u003e\n\u003cp\u003e“But—” I stared at the “call ended” symbol on my phone. No way. I was beginning to wonder if Mr. Weatherton’s services weren’t some sort of time-wasting ruse. I redialed Sike to tell her so.\u003c/p\u003e\n\u003cp\u003e“I told you—”\u003c/p\u003e\n\u003cp\u003e“Look, I just want to know—”\u003c/p\u003e\n\u003cp\u003e“We’re working on it,” she interrupted me. We were both silent on the line, and then she took a deep inhale. “If you hadn’t killed Yuri, you wouldn’t be in this mess.”\u003c/p\u003e\n\u003cp\u003eI couldn’t refute that. She hung up on me again, more slowly this time, and I didn’t wonder until afterwards how she’d known Mr. November’s real name.\u003c/p\u003e\n\u003cp\u003eI went back to my half-eaten piece of cake, and shoved most of it around my plate. If the day had come that Edie Spence was too depressed to eat an entire piece of chocolate cake with chocolate frosting— Meaty opened the break-room door, interrupting my personal pity party.\u003c/p\u003e\n\u003cp\u003e“I have something for you,” Meaty said, distracting me from my thoughts. Meaty produced a small glass vial from a breast pocket and I took it. The fluid inside was clear, and the sterile cap was gone, but the rubber stopper was still in place. There wasn’t a label, but I could feel the ridge of tackiness that indicated where there had once been one. It was about the same size as the bottles for intravenous Protonix.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003eMeaty looked directly at me while answering. “It’s pope water. Don’t ask where I got it.”\u003c/p\u003e\n\u003cp\u003eI’d inhaled to ask exactly that, but stopped.\u003c/p\u003e\n\u003cp\u003e“What’s it do?”\u003c/p\u003e\n\u003cp\u003e“It’s a hundred times more potent than normal holy water. You apply it topically. On them, not you.”\u003c/p\u003e\n\u003cp\u003eI held up the little vial and looked at Meaty through it. Even distorted by the fluid, Meaty’s pale face was serious. “Save it for a rainy day, okay? Go put it in your locker.”\u003c/p\u003e\n\u003cp\u003eI nodded and turned to do as I was told. But I refused to believe that we had a pope in a decantable jar somewhere downstairs. “Meaty—” Telling a nurse not to ask something should be considered an act of cruelty and be covered by a convention of war.\u003c/p\u003e\n\u003cp\u003e“Don’t ask,” Meaty repeated.\u003c/p\u003e\n\u003cp\u003e“All right, all right.” I put the med in my locker, then returned to finish my cake.\u003c/p\u003e\n\u003cp\u003eWhen I got back to the ward, someone was shouting. Their voice was muffled through the doorway, but I could see Gina watching her monitors closely.\u003c/p\u003e\n\u003cp\u003eI walked over and followed her gaze.\u003c/p\u003e\n\u003cp\u003e“I’ve got it under control, Edie,” Gina said, glancing at me. “This one doesn’t breathe flame.”\u003c/p\u003e\n\u003cp\u003eI peered up at the monitor with her. The cameras inside the room were focused on the patient. He was androgynous from where I sat, with close-cropped hair that wasn’t parted. The dressing to his eyes covered up most of his face. He wore the County-issued blue-scramble puke-stain-minimizing gown that everyone had. He continued to yell—now that I was close enough, I could hear what he was saying.\u003c/p\u003e\n\u003cp\u003e“Who am I? Tell me who I am!”\u003c/p\u003e\n\u003cp\u003eHis yells were plaintive and frightening at the same time, like they’d taken a page from the Shadows. “What kind of meds can you give?” I asked.\u003c/p\u003e\n\u003cp\u003eShe gestured to her chart. “Haldol. In intramuscular injections, mostly. Hard to keep an IV line in an unwilling shapeshifter.”\u003c/p\u003e\n\u003cp\u003eThe shapeshifter was writhing in his restraints, his body changing shapes. The monitors and cameras weren’t HD, and so I watched his fingers appear to pixilate and then resolve again, as he tried on all sorts of different forms. They went black-skinned for a moment, and I gasped in surprise.\u003c/p\u003e\n\u003cp\u003e“Pretty cool, eh? Like a human kaleidoscope.”\u003c/p\u003e\n\u003cp\u003eI nodded and kept watching as Gina went to the medication machine and then came back with a small bottle and a big syringe. “It’s time for another shot of Vitamin H,” she said, holding up the bottle. “And I don’t mean biotin.”\u003c/p\u003e\n\u003cp\u003e“How can I help?”\u003c/p\u003e\n\u003cp\u003e“You can cover me.” She opened up the drawer of the isolation cart that had the tranquilizer gun in it. “After the Haldol kicks in, we’ll do the dressing change.”\u003c/p\u003e\n\u003cp\u003e“We?” I asked. “I meant for all my helping business to be out here. In the vicinity of your chart.”\u003c/p\u003e\n\u003cp\u003eShe snorted and handed me the gun.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-SEVEN\u003c/p\u003e\n\u003cp\u003eThe shapeshifter quieted his existential howling as soon as Gina opened the door.\u003c/p\u003e\n\u003cp\u003e“Hey there, Mr. Huang. It’s me, your nurse for the night, Gina.” Gina had briefly explained the importance of not touching he/she/it, nor letting them touch you before going in. “I’m just coming in with a shot for your pain.”\u003c/p\u003e\n\u003cp\u003e“Don’t touch me!” the patient said. “Don’t touch me anymore!”\u003c/p\u003e\n\u003cp\u003e“You’re in a hospital now. I’m gonna give you something for your pain,” Gina continued, while walking toward him, syringe out. I couldn’t imagine being her, but if she’d snuck up on weres before, in their angry animal forms, she’d had practice. “It should help you calm down. We have a psychiatrist who’ll be seeing you tomorrow. I’ve got gloves on. I won’t touch you, I promise.”\u003c/p\u003e\n\u003cp\u003e“Get away from me!” the shapeshifter howled, but he stilled and became a she, then went quiet. Gina looked to me and nodded. I put the trank gun’s butt against my shoulder.\u003c/p\u003e\n\u003cp\u003e“I’ll be injecting you on your shoulder, sir,” Gina said. She flipped up the gown sleeve and swiped only once with an alcohol swab before pushing the needle in.\u003c/p\u003e\n\u003cp\u003e“Stop!” he howled, skin tone going from Asian to Anglo as Gina pushed the syringe’s plunger down. “No!”\u003c/p\u003e\n\u003cp\u003eThe hands that strained beneath the buckled leather restraints had fingers that metamorphosed between a man’s with calluses, to a woman’s dainty ones complete with perfect long nails, to an elderly person’s skeletal fingers, denuded of subcutaneous fat. The characteristics and coloration of the hands and face I could see around the dressings no longer matched. The shapeshifter appeared to be going calico.\u003c/p\u003e\n\u003cp\u003e“Gina—” I warned.\u003c/p\u003e\n\u003cp\u003e“You’ll be fine soon, sir,” Gina said, disposing of the syringe in the sharps container, without turning her back on him. The patient sighed aloud, relaxing into his mattress, and his face and hands, which had been the most energetic parts of him, went anonymous, slack and pink.\u003c/p\u003e\n\u003cp\u003e“Don’t point that thing at me, okay?” Gina said.\u003c/p\u003e\n\u003cp\u003e“I’m not.” I held my aim at her patient’s torso.\u003c/p\u003e\n\u003cp\u003e“Like I was saying before,” she continued, as she moved around to the head of the bed, “if they touch too many other people, they end up acquiring too much … I don’t want to say DNA, though it could be DNA. Data, maybe?”\u003c/p\u003e\n\u003cp\u003e“What’s that they say about the nature versus nurture argument, then?” I asked from the doorway. Gina was unwinding the Kerlix roll from around the patient’s head, so she could get at the dressings that stuffed his eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightshifted-edie-spence-1/page-33.html","bookId":2618,"creation":"Oct 5, 2019 6:52:34 PM","modification":"Oct 5, 2019 6:52:34 PM"}
