{"id":100361,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt was the name of a large homeless shelter downtown, where you could catch a warm bed and a hot meal, if you stood in line long enough and kept your head down. It was where Mr. Galeman’d been staying, before he’d met Anna. Jake continued, “They’ve had a change of ownership, or guardianship, or whoever the hell runs the place. It used to be casual, now it’s almost militarized.”\u003c/p\u003e\n\u003cp\u003eI knew the recent economic downturn in the county’s affairs had had an effect on the number of homeless people in the city; I’d heard Emergency Department nurses complain. “How would they do that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. The food there? Maybe. And they’ve got a needle exchange program—they could fill them up with some sort of Narcan ahead of time—”\u003c/p\u003e\n\u003cp\u003e“Jake, don’t be an idiot.” I set my fork down with a clatter on my plate. “For God’s sake, if you need clean needles, I’ll fucking get them for you,” I heard myself say. Jake looked as surprised as I felt by my vehemence. But even as I offered now—what would happen in just two short days? I reached over, grabbed his mug, and took a gulp of his coffee. It burned the top of my mouth and scalded all the way down.\u003c/p\u003e\n\u003cp\u003e“Sissy—”\u003c/p\u003e\n\u003cp\u003eIn that moment I wanted to tell him everything. Everything from the beginning. From our parents’ divorce to the first time my mom kicked him out. I could forgive him the pot, the acid, and the E—teenagers did those all the time and were fine. But from the very moment, the very first moment, when I’d seen a track mark on his arm, I’d been trapped, trying to save him from himself. Now was just one more fucking time.\u003c/p\u003e\n\u003cp\u003eI stood up, eyes hot. “I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eI almost ran into the bathroom. I made fists for strength. I should tell him everything. All of it.\u003c/p\u003e\n\u003cp\u003eBut then what? Things don’t work out, I die in two days, and then he’s left knowing that? Forever?\u003c/p\u003e\n\u003cp\u003eI’d done it to myself. It wasn’t my fault entirely, for damn sure, but I’d done it to myself. I could have ignored him. I could have gone in for tough love. I washed my face before looking at myself in the mirror.\u003c/p\u003e\n\u003cp\u003e“You did this to yourself, Edie,” I told my reflection. “You cannot lay that on him.”\u003c/p\u003e\n\u003cp\u003eHe did deserve to know that his enforced sobriety might come to a screeching halt in two days. But that was it. Not how or why. But when? Yes.\u003c/p\u003e\n\u003cp\u003eI stalked back out to my half-eaten breakfast to find the table empty.\u003c/p\u003e\n\u003cp\u003e“I’ll get it next time,” Jake had written in his neat handwriting on the bill, right under the waitress’s “Thanks!” with a smiley face. My car keys were left in a tangle on top of my purse.\u003c/p\u003e\n\u003cp\u003e“Dammit, Jake,” I muttered under my breath and looked around. Our waitress appeared anxious, like she’d feared a dine and dash, and flashed a nervous smile at me for noticing. I pulled out cash from my wallet and left her a hefty tip.\u003c/p\u003e\n\u003cp\u003eCouldn’t take it with me, anyway.\u003c/p\u003e\n\u003cp\u003eCHAPTER FORTY\u003c/p\u003e\n\u003cp\u003eI drove my car home and parked in my spot. I sat there for a second, wondering if I could leave an official letter for Jake and avoid a confrontation entirely. “Edie Spence’s last will and testament—to her brother, she leaves her couch and her small collection of CDs.” I rolled my eyes at myself, found my house key on my chain, and walked to my door.\u003c/p\u003e\n\u003cp\u003eAs soon as I entered, the CD player started chattering at me in German. It was as bad as Minnie.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. He’s my brother,” I tried to explain. “I know, he pisses me off too.” Its light went from red to green, and then it clicked off, in angry silence or exhaustion.\u003c/p\u003e\n\u003cp\u003eI had barely kicked off my shoes and hung up my coat when I heard a knock at the door. “Jake! I’m still mad at you!” I announced, walking down my short hall. I peeked out the peephole and saw Ti there, his scars magnified a hundredfold, like the ripples in an unmade bed.\u003c/p\u003e\n\u003cp\u003e“One second,” I called and undid all the latches. “Hey. Come in.” I pressed myself to the side of the wall so that he could pass. He did so, managing to avoid touching me completely, which was pretty amazing, given his shoulder width.\u003c/p\u003e\n\u003cp\u003e“What happened to your face?” He turned toward me in the small hallway.\u003c/p\u003e\n\u003cp\u003eI waved my hand dismissively in the air. “A patient last night. I don’t want to talk about it.”\u003c/p\u003e\n\u003cp\u003eHe shrugged, and I followed him out to my couch—the only furniture left in my living room—and he waited till I sat down, and then sat down an inordinately long distance away from me. I looked at him, then at the vast expanse of couch between us. “What’d I do wrong now?”\u003c/p\u003e\n\u003cp\u003eHe blinked. “You’re direct.”\u003c/p\u003e\n\u003cp\u003e“I’ve got two days to live.”\u003c/p\u003e\n\u003cp\u003eTi looked down at his knees for a moment. “I went down to Seventeenth—” he began, and I had visions of sultry hookers dancing in my head. “And when I came back here, I saw a man entering your place.” He looked up at me, and there was definitely hurt in his golden eyes.\u003c/p\u003e\n\u003cp\u003e“Really?” I crossed my arms. “I’m not sure which you should be more embarrassed about—being slightly stalkery or assuming that I’m dating my brother.”\u003c/p\u003e\n\u003cp\u003e“Ohhhh—” His shoulders untensed, and he shook his head at himself.\u003c/p\u003e\n\u003cp\u003e“Seriously, just ask me things.” I scooted over on the couch. “Even if I weren’t running out of time, I don’t play games. Never have, never will.” Unless you were my junkie brother, I mentally amended. “How long were you out there?”\u003c/p\u003e\n\u003cp\u003eHe exhaled. “Since four A.M.”\u003c/p\u003e\n\u003cp\u003e“Silly zombie.” I lightly slapped him on his forearm.\u003c/p\u003e\n\u003cp\u003e“I do feel foolish,” he began.\u003c/p\u003e\n\u003cp\u003e“Good.” It was sort of more cute than stalkery, for now. He did appear embarrassed. “Just don’t make a habit of it, okay?”\u003c/p\u003e\n\u003cp\u003e“Fine.” His face softened into a grin, and so did mine.\u003c/p\u003e\n\u003cp\u003e“So—about the girls?”\u003c/p\u003e\n\u003cp\u003e“I didn’t get to actually talk to any of them.”\u003c/p\u003e\n\u003cp\u003eAnd perhaps it was my turn to be relieved, just a little. “Oh? Why not?”\u003c/p\u003e\n\u003cp\u003e“They weren’t around.”\u003c/p\u003e\n\u003cp\u003e“You … didn’t get there in time?” I imagined him trying to talk to one of them, a normal girl except for her occupation, and her running away from him in fear, like he was Frankenstein’s monster and she was short a mob.\u003c/p\u003e\n\u003cp\u003e“In a manner of speaking,” Ti said, and his voice was grave.\u003c/p\u003e\n\u003cp\u003eSuddenly I realized what he meant. “Oh, no. What happened?”\u003c/p\u003e\n\u003cp\u003e“They’re all gone. Dead, I assume.” He looked down at his clasped hands.\u003c/p\u003e\n\u003cp\u003e“How do you know they’re dead?”\u003c/p\u003e\n\u003cp\u003e“Hookers aren’t known for their financial solvency—they usually can’t get away from their pimps or their dealers long enough. So unless there’s a Greyhound full of them all on the way to Florida, I feel safe assuming the worst,” he said.\u003c/p\u003e\n\u003cp\u003e“But—won’t the police find out?”\u003c/p\u003e\n\u003cp\u003e“Find what? And when?” Ti held his empty hands out. “The city’s big. It could take a while. And if they only find one at a time, they could be declared NHIs.”\u003c/p\u003e\n\u003cp\u003e“What’s that?” I asked.\u003c/p\u003e\n\u003cp\u003eTi’s hands curled into fists against his denim. “It means No Humans Involved. It’s a way to dump cases that no one wants to look into or solve. When the cops think someone’s done them a favor, by taking out the trash.”\u003c/p\u003e\n\u003cp\u003e“No humans involved,” I muttered. “Well, they got that right.” I imagined those girls looking at the expensive suits that all the vampires seemed to wear, ignoring their foul breath, their odd mannerisms, the way their eyes kept looking through them—maybe, sadly, they were used to that—and hoping that for one night they’d be warm and well paid.\u003c/p\u003e\n\u003cp\u003eTi’s head was bowed in frustration. I reached out and put my hand on his. “So what now?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. When the bodies turn up, we can look for ideas. And I spread enough money around last night—if anything comes up, people will call. I left an impression.” His strong hands flexed again.\u003c/p\u003e\n\u003cp\u003eA wave of exhaustion hit me. I’d been going almost full throttle for days now—a week, really. If there was nothing we could do, I knew what I wanted to do at least. Sleep.\u003c/p\u003e\n\u003cp\u003eBut I didn’t want to be alone. I looked over to him, and out around at my living room. This couch was a life raft, holding us up against the ocean of drab carpeting and the rough world outside, one person probably dying, one already dead.\u003c/p\u003e\n\u003cp\u003eAnd as tempting as it sounded, sleep would be giving in. It would be admitting the beginning of the end, the wind down into the final, darkest night. Gina was right—you had to keep moving, or you’d start crying. I leaned forward and did the only thing I could think of to do to stop myself from sinking. I kissed him. Even though with my busted lip it hurt.\u003c/p\u003e\n\u003cp\u003eHe braced himself, first surprised, then leaned into me, reaching his arms up to hold my head and tilt it slightly so I fit him better. He was slow kissing me back, tentative, as if his spirit for these things was as fragile as the skin that held him.\u003c/p\u003e\n\u003cp\u003eI didn’t care. I pressed harder for a moment, ignoring my bottom lip’s sharp pain, and then swung around so that I was straddling his lap, bending over to kiss his face, all of his face, as my hair hung down and shielded us from anything outside. I took his hands and put them at my waist, urging him to go further. And then I thought about what the hell I was doing.\u003c/p\u003e\n\u003cp\u003eI pulled my head back and sat up, and squirmed backward on his lap. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“For what?” he asked, letting me go.\u003c/p\u003e\n\u003cp\u003eI wanted to explain, but I wasn’t sure I could explain. Him, here, now, this? But I did owe him an explanation. I didn’t want to seem like some emotionally damaged freak. I had to try.\u003c/p\u003e\n\u003cp\u003e“I actually like you,” I said, and then started backpedaling. “I mean, I could actually like you, if we got to know each other better and all.”\u003c/p\u003e\n\u003cp\u003eHe tilted his head forward. “You say that like it’s a bad thing.”\u003c/p\u003e\n\u003cp\u003e“Do you know how long it’s been since I’ve been with someone I actually liked?” I looked wildly around the room, as if ghosts of conquests past would arise and vouch for me. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightshifted-edie-spence-1/page-36.html","bookId":2618,"creation":"Oct 5, 2019 6:52:34 PM","modification":"Oct 5, 2019 6:52:34 PM"}
