{"id":99157,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRhudda drew his bowstring with a trembling hand. He let the arrow fly. I trained the spyglass on the target to see where it would strike.\u003c/p\u003e\n\u003cp\u003eRed. Rhudda’s arrow had also hit the red, below and to the right of the bull’s-eye.\u003c/p\u003e\n\u003cp\u003e“Eight!” shouted the scorekeeper. The crowd burst into tumultuous applause. My shot had been better, but then I didn’t own the castle where they had to live. And all that mattered was the score. Right now, that score was tied.\u003c/p\u003e\n\u003cp\u003eRhudda bowed, but I could hear him muttering curses as he did. He shot me an evil glance that, if it had been an arrow, would have pierced my heart and poisoned me besides. But a look isn’t an arrow, and this contest wasn’t over yet.\u003c/p\u003e\n\u003cp\u003eI took my stance and nocked my second arrow. The first had hit above the bull’s-eye, so I adjusted my point of aim to compensate. I held my breath as I drew and released.\u003c/p\u003e\n\u003cp\u003e“Nine!” The score rang across the field before I could focus the spyglass. There. The arrow stood in the outer gold, close to the bull’s-eye, but not close enough for ten full points.\u003c/p\u003e\n\u003cp\u003eThis time, the applause lasted a few seconds longer. The contest was getting interesting.\u003c/p\u003e\n\u003cp\u003eRhudda bent over his quiver. He touched the arrow with red fletching, then picked one of the black-feathered arrows. He stood. Peibiaw wiped a handkerchief across the giant’s sweaty forehead; Rhudda shoved him away so hard the servant landed on his ass, handkerchief waving like a white flag.\u003c/p\u003e\n\u003cp\u003eRhudda positioned his arrow, aimed, and shot. Thwack!\u003c/p\u003e\n\u003cp\u003eThe silence was so absolute, I thought I could hear the arrow vibrating in the target. I pointed the spyglass. Rhudda had hit the border between red and blue.\u003c/p\u003e\n\u003cp\u003eThe scorekeeper’s head blocked my view as he bent over the target. I lowered the spyglass and waited for the score.\u003c/p\u003e\n\u003cp\u003e“Seven.” The word was hushed. The resonance had drained from the scorekeeper’s voice, replaced by dread. I didn’t envy the guy if his master lost.\u003c/p\u003e\n\u003cp\u003eAnd Rhudda might lose. The score was seventeen to fifteen; I was up by two points.\u003c/p\u003e\n\u003cp\u003eNo applause. The audience didn’t know what to do. A murmur buzzed around the stands. Then a voice shouted, “Hail, Rhudda Gawr!” and others took up the cheer.\u003c/p\u003e\n\u003cp\u003eRhudda didn’t react. He watched me like he was figuring out how to throw off my aim with his stare.\u003c/p\u003e\n\u003cp\u003eIf only I could get that magic arrow. I’d score a ten, making my final score twenty-seven and putting victory out of the giant’s reach. But I was in full view of everyone in the amphitheater, not to mention the guards with crossbows. I couldn’t exactly walk over, pluck the red-feathered arrow from Rhudda’s quiver, and fit it into my own bow.\u003c/p\u003e\n\u003cp\u003eStill, if I could score a ten—or even another nine—I could win this.\u003c/p\u003e\n\u003cp\u003eI prepared my final shot. In my peripheral vision, I saw Rhudda take several steps toward me. He turned his back to me and waved to the crowd.\u003c/p\u003e\n\u003cp\u003eIgnore him. I focused on my point of aim and drew.\u003c/p\u003e\n\u003cp\u003eThe moment I released the arrow, Rhudda spread his cape. In unison, its dozens of mouths blew out. It created enough of a breeze to nudge my arrow off its trajectory. The arrow landed in the blue.\u003c/p\u003e\n\u003cp\u003e“Six!” shouted the overjoyed scorekeeper. A few halfhearted claps sounded from the stands.\u003c/p\u003e\n\u003cp\u003eMy final score was a mere twenty-three. Rhudda now needed only nine points to win.\u003c/p\u003e\n\u003cp\u003e“Unfair!” shouted a man’s voice from a top-level seat.\u003c/p\u003e\n\u003cp\u003eRhudda pointed a meaty finger in the direction of the voice. An archer fired, and a man in a brown tunic fell back. He slumped against the stone wall, a crossbow bolt sticking out of his chest. A woman’s scream rose, then cut itself off. Rhudda stepped forward and raised his arms. Silence. He lowered his arms and clapped his hands together. Slowly, deliberately: One, two, three. He pointed in a wide circle to indicate the audience had better start clapping too, and right this minute. They did, but tepidly. He gestured angrily, and the applause increased. But it didn’t crescendo to its previous level.\u003c/p\u003e\n\u003cp\u003eRhudda stalked to his equipment. He grabbed his bow and, smirking at me, yanked the red-feathered arrow from his quiver. He nocked the arrow and aimed. He shook his head and blinked. He lowered the bow and wiped a hand across his eyes. Then, in one single fluid motion, he raised his bow and took his shot.\u003c/p\u003e\n\u003cp\u003eThe arrow sped toward the target. Then it turned and—that couldn’t be right. I raised the spyglass.\u003c/p\u003e\n\u003cp\u003eRhudda’s magic arrow had hit the target dead center. A bull’s-eye. But not on his target. He’d hit mine.\u003c/p\u003e\n\u003cp\u003eThe scorekeeper fainted.\u003c/p\u003e\n\u003cp\u003eThe crowd went nuts.\u003c/p\u003e\n\u003cp\u003e“Treachery!” roared Rhudda. He plucked the last remaining arrow from his quiver and aimed his bow at me.\u003c/p\u003e\n\u003cp\u003ePain tore through my belly. I thought I’d been hit, but when I looked there was no wound. Rhudda roared again. He was dancing like his feet were on fire, swatting the air around his head. The arrow had fallen from his bow; he stepped on it and broke it in two with a snap.\u003c/p\u003e\n\u003cp\u003eI ran over and tackled the giant, coming in low and hitting his knees. He fell like a redwood and landed facedown. I scrambled to my feet. “To your right!” a voice shouted from the stands.\u003c/p\u003e\n\u003cp\u003eA sword lay on the ground where someone has tossed it onto the field. I snatched it up. Rhudda had rolled over onto his back. Both hands beat the air around his head.\u003c/p\u003e\n\u003cp\u003e“Stop!” I commanded. I put one foot on his chest and pressed the sword point against his throat. He quit batting the air and lay motionless.\u003c/p\u003e\n\u003cp\u003eAn insect alighted on his nose, wings twitching. It was a black butterfly. One with sharp, oversized teeth.\u003c/p\u003e\n\u003cp\u003e“Nice work, Butterfly,” I said.\u003c/p\u003e\n\u003cp\u003e“Huh,” the demon answered. “Somebody had to get your sorry ass out of this mess. And if anyone deserves to feel the bite of guilt, it’s this clown.” He unhinged his jaw and chomped Rhudda’s nose. The giant yelped but didn’t move. Then Butterfly took to the air, landed on my tunic, and disappeared.\u003c/p\u003e\n\u003cp\u003eWhat a screw-up—you nearly got yourself killed. The thought blasted through my brain of its own accord, and I knew Butterfly had settled back in.\u003c/p\u003e\n\u003cp\u003eI shoved all self-critical thoughts aside and turned my attention to the groaning giant pinned by my sword. Something was different. Rhudda glared at me with undisguised hatred—nothing new there. Then I realized what had changed. Silence. His cloak had stopped whispering. Each and every bearded mouth was still.\u003c/p\u003e\n\u003cp\u003e“Attention, please!” Someone—I think it was Nyniaw—had revived the scorekeeper. He stood, leaning on the servant, and called out something unintelligible in a weak voice. He coughed into his hand and tried again.\u003c/p\u003e\n\u003cp\u003e“The final score,” he said, his voice building in strength with each word, “is twenty-three points to Lady Victory, and”—he stopped and cleared his throat—“um, fifteen to Rhudda Gawr. The day goes to Lady Victory!” Applause, whistles, and shouts came from the stands. When they faded, the scorekeeper continued: “According to the agreed-upon terms of the challenge, Rhudda guarantees Lady Victory and Sir Evan safe conduct through his realm.” Someone let my father out of the cage. He jumped down from the wagon and ran across the field. I wanted to hug him, but I had both hands on the sword. He put an arm around my shoulders and squeezed.\u003c/p\u003e\n\u003cp\u003e“Nice shooting, Vic. I knew you could do it.”\u003c/p\u003e\n\u003cp\u003e“In addition, Rhudda grants the winner one item of her choice from his armory.”\u003c/p\u003e\n\u003cp\u003eI needed Rhudda’s magic arrow to give to the Night Hag. But was the red-fletched arrow the right one? It couldn’t be. The magic arrow never missed. This one had gone out of its way to hit the wrong target.\u003c/p\u003e\n\u003cp\u003e“I know which arrow you want,” said Dad, as though reading my mind. “I’ll get it for you.” He trotted down the length of the field, pulled the red-fletched arrow from the target, and held it aloft. The audience cheered as he carried it back to me. He waved it over Rhudda’s face.\u003c/p\u003e\n\u003cp\u003e“It’s ours now, Rhudda,” he said.\u003c/p\u003e\n\u003cp\u003e“No! You cheated! I know you did!”\u003c/p\u003e\n\u003cp\u003e“Why, because you tried to cheat, yourself? You lost, Rhudda. Admit it.”\u003c/p\u003e\n\u003cp\u003e“I will never admit it!”\u003c/p\u003e\n\u003cp\u003eThe scorekeeper raised a hand, and everyone stilled. “Lady Victory has won and claimed her prize. I now declare this challenge complete.”\u003c/p\u003e\n\u003cp\u003eRhudda closed his eyes and groaned.\u003c/p\u003e\n\u003cp\u003e“You can let him up now,” the scorekeeper said, coming over. “His own archers are now sworn to protect you for as long as you’re in his realm. If he tries to hurt you, they’ll kill him.”\u003c/p\u003e\n\u003cp\u003e“Is that true?”\u003c/p\u003e\n\u003cp\u003eI lifted the sword from Rhudda’s throat, holding the blade ready as I stepped back. But the giant made no move to get up. He rolled over onto his side and covered his head, moaning. “Be quiet!” he sobbed. “Please, please stop.”\u003c/p\u003e\n\u003cp\u003eWe stared at the prone giant. There was a change in the air, like a breeze had started up. The beards were whispering. But the sound wasn’t the confused mixture of dozens of stories I’d heard when I first encountered Rhudda. All the mouths whispered in unison. Once there was a cruel and foolish giant named Rhudda Gawr. Rhudda was arrogant, filled with hubris. One day he challenged Lady Victory to an archery contest…\u003c/p\u003e\n\u003cp\u003eRhudda groaned again and covered his ears. His cloak of beards had changed its story. Now, every single mouth whispered the tale of his defeat.\u003c/p\u003e\n\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003e“I STILL THINK YOU SHOULD HAVE TAKEN HIS BEARD, VIC. After all, you earned it.” Dad stroked his own beard fondly as we walked. Once again, we were on the main road to Tywyll. Four of Rhudda’s archers had accompanied us to the edge of the giant’s land. I half-expected them to nail us with crossbow bolts as soon as we crossed the border, but they’d saluted us and then melted back into the forest.\u003c/p\u003e\n\u003cp\u003e“Eww, Dad. What would I do with a mangy red beard? Make a purse out of it?” I shuddered at the thought of sticking my hand into Rhudda’s mouth every time I needed a quarter. Yuck. “Besides, that’s one story I don’t need to hear again.” I’d been scared. It was a feeling I didn’t like, and I saw no need to be reminded of it.\u003c/p\u003e\n\u003cp\u003e“It wouldn’t tell the right story, anyway. Rhudda has no clue what happened.”\u003c/p\u003e\n\u003cp\u003e“Neither do I. Care to enlighten me?” \u003c/p\u003e","sourceLink":"https://allnovel.net/darklands-deadtown-4/page-46.html","bookId":2612,"creation":"Oct 5, 2019 6:40:16 PM","modification":"Oct 5, 2019 6:40:16 PM"}
