{"id":99177,"no":66,"title":"Page 66","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSo that was Dad’s theory. It was why he’d insisted on coming with me. He was grasping at a straw that might return him to the Ordinary.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?”\u003c/p\u003e\n\u003cp\u003eRainbow-colored eyes regarded me, then blinked. “I wasn’t sure it would work. And I didn’t want you to worry.”\u003c/p\u003e\n\u003cp\u003e“Not worry? You left the spring, Dad! I thought you’d died.” Again.\u003c/p\u003e\n\u003cp\u003eThe falcon ducked his head. “Sorry about that. I knew that sooner or later you’d be headed to Hellsmoor, and I had to get there first.”\u003c/p\u003e\n\u003cp\u003eA realization hit me. “You killed the falcon.”\u003c/p\u003e\n\u003cp\u003e“Only temporarily. Oh, and I borrowed one of your horses to get back to Tywyll.”\u003c/p\u003e\n\u003cp\u003eThings were beginning to fall into place. “Arawn told me you made your return. But he said you went into the cauldron of rebirth.”\u003c/p\u003e\n\u003cp\u003e“That’s where my bridge led to, it’s true. But it’s like I told you, Vic, I had no intention of being reborn. When I went to Resurrection Square, I had the falcon—this body—under my cloak. There was such chaos there, no one noticed. I’d been chosen for rebirth, but the falcon hadn’t. So even though the cauldron pulled me strongly, at the same time it repulsed the bird. The conflict was enough to keep me from sliding into the rebirth cauldron.”\u003c/p\u003e\n\u003cp\u003e“So your bridge went there, but you didn’t.”\u003c/p\u003e\n\u003cp\u003e“Exactly. When I reached the end of the bridge, I waited until the Keeper looked the other way. Then I hopped down onto the platform—the one they’d erected for the ceremony—and jumped into the cauldron of transformation. I don’t know exactly how it happened—it was kind of hazy in there—but my spirit was bound to this bird’s body. The falcon flew out of the cauldron, but its spirit was mine.” We drove in silence for a minute as I processed what he’d said. “After that,” he continued, “you know the rest. I followed you to your meeting with Mallt-y-Nos and handed myself over. And you and I both got out of the Darklands.”\u003c/p\u003e\n\u003cp\u003eThe falcon that was my father preened his feathers.\u003c/p\u003e\n\u003cp\u003e“Mallt-y-Nos is looking for you,” I said.\u003c/p\u003e\n\u003cp\u003e“Let her look. I’m faster than she is.”\u003c/p\u003e\n\u003cp\u003e“She’s not going to give up, Dad. She’s a hunter.”\u003c/p\u003e\n\u003cp\u003e“So am I, now. This body has amazing instincts. And don’t forget—the white falcon of Hellsmoor can go where others can’t. It’s a useful skill, although I’m still figuring out how it works. The hag won’t get me.”\u003c/p\u003e\n\u003cp\u003eWe’d gone around the block several times by now. I pulled over. “Will I see you again?”\u003c/p\u003e\n\u003cp\u003e“You bet, Vic. Remember what I said? You can’t get rid of your old man that easily.”\u003c/p\u003e\n\u003cp\u003eMy old man who happened to be a bird.\u003c/p\u003e\n\u003cp\u003eI got out of the car and opened the passenger door. The falcon flew out, flapping his wings as he climbed. Then he soared like a white shadow across the night sky.\u003c/p\u003e\n\u003cp\u003eI watched until I couldn’t see him anymore. I was glad for his freedom. Yet the words of the Night Hag were lodged like a knife in my gut: Bring me the falcon, and I will release the werewolf from his servitude.\u003c/p\u003e\n\u003cp\u003eMy father, or the man I loved.\u003c/p\u003e\n\u003cp\u003eHow could I possibly choose? \u003c/p\u003e","sourceLink":"https://allnovel.net/darklands-deadtown-4/page-66.html","bookId":2612,"creation":"Oct 5, 2019 6:40:16 PM","modification":"Oct 5, 2019 6:40:16 PM"}
