{"id":99120,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMaria clutched the phone to her chest, nodding. “You promise I won’t change into a mouse or something at school?”\u003c/p\u003e\n\u003cp\u003e“Nothing like that will happen today, or any time soon. It could be a year or more before you start shapeshifting. And before you reach that point, we’ll make sure you’re ready. I promise.” I held out my hand, the little finger straight up. “Want me to pinky swear?”\u003c/p\u003e\n\u003cp\u003eMaria rolled her eyes. “Please, Aunt Vicky. That’s for little kids. I’ll…” She searched for a suitably grown-up phrase. “I’ll take your word for it.”\u003c/p\u003e\n\u003cp\u003eDOWNSTAIRS, GWEN HAD FREED JUSTIN FROM THE HIGH chair. He ran over to me and raised his hands. I picked him up and got a banana-smeared kiss.\u003c/p\u003e\n\u003cp\u003e“Justin, come here, honey,” Gwen said, lifting him out of my arms. “Let Mommy wash your face.” Balancing Justin on her hip, she tore off a paper towel, wet it under the faucet, and handed it to me so I could wipe banana off my face. She wet another and passed it over his face, then his hands. Newly clean, Justin squirmed to get down. He toddled over to a basket in the corner, pulled out a plastic firetruck, and began pushing it across the floor.\u003c/p\u003e\n\u003cp\u003eGwen watched him, silent.\u003c/p\u003e\n\u003cp\u003e“Maria’s taking a shower,” I said. “I think she’ll be okay to catch the rest of the school day.” Gwen nodded once but didn’t look at me. “It was just a false face episode. She looked in the mirror and saw a cat-human mix. I did the camera trick, and that calmed her down.” I leaned against the counter. “Thank goodness for digital cameras. Remember the first time it happened to me? I hid under the covers, thinking I’d suddenly grown a dog’s head, while you ran to the one-hour photo center at the corner drug store with a roll of film.”\u003c/p\u003e\n\u003cp\u003eI smiled at the memory, but my sister remained stone-faced, her eyes averted.\u003c/p\u003e\n\u003cp\u003e“What is it, Gwen?”\u003c/p\u003e\n\u003cp\u003eShe looked at me then, her face taut with emotion. “I could have done the camera trick. But Maria wouldn’t talk to me, wouldn’t open the door. It had to be Aunt Vicky.”\u003c/p\u003e\n\u003cp\u003e“She said she didn’t want you to call me.”\u003c/p\u003e\n\u003cp\u003e“Of course she didn’t, because I suggested it and whatever Mom says must be wrong. But she knew I’d call you. What other option did I have?”\u003c/p\u003e\n\u003cp\u003eJustin’s head snapped up at her tone. He picked up his firetruck and held it out to Gwen like an offering. “Play?” he asked.\u003c/p\u003e\n\u003cp\u003eThe anger melted from Gwen’s face. “Thank you,” she said, taking the truck. She sank into a chair. Justin patted her leg, then went back to his basket of toys.\u003c/p\u003e\n\u003cp\u003eGwen set the truck on the table. “I’m sorry, Vicky. I ask you to help with Maria, and you do a great job, and then I act like a resentful bit—” She glanced at Justin. “A resentful witch. I don’t mean to. Things are hard right now.”\u003c/p\u003e\n\u003cp\u003eI sat down across from her. “Puberty is a rough time, even when there’s no shapeshifting involved.”\u003c/p\u003e\n\u003cp\u003e“I suppose that’s true. Lucky me—I get twice the fun.” She rolled Justin’s truck back and forth. “I suppose it’s my own fault. I was so worried that Maria would develop shapeshifting abilities, I know my anxiety has rubbed off on her. I just want my baby to have a normal life.”\u003c/p\u003e\n\u003cp\u003eI wanted to ask Gwen what she thought “normal” meant. For a Cerddorion girl, Maria was doing fine. In fact, she was way above average. If only Gwen could accept her own heritage, she’d be bursting with pride.\u003c/p\u003e\n\u003cp\u003eBut I didn’t have to ask Gwen that question, because Maria appeared in the doorway and asked it for both of us. “‘Normal’? What’s ‘normal,’ Mom? Because if you want me to be like Kelsey or Megan, it’s already too late for that.” Kelsey and Megan were Maria’s best friends—and one hundred percent human.\u003c/p\u003e\n\u003cp\u003e“Maria—”\u003c/p\u003e\n\u003cp\u003eMy niece held up a hand to show she didn’t want to hear whatever her mother had to say. Gwen bristled, then sagged.\u003c/p\u003e\n\u003cp\u003e“Aunt Vicky,” Maria said, “can you give me a ride to school?”\u003c/p\u003e\n\u003cp\u003e“Um, sure. If it’s all right with your mom.”\u003c/p\u003e\n\u003cp\u003eMaria didn’t wait for Gwen’s answer. She swept past her and through the door to the garage. Gwen jumped at the slam.\u003c/p\u003e\n\u003cp\u003e“Go ahead, take her to school. Wait, though.” She opened a drawer under the tabletop, took out a pad of paper, and scribbled something on it. “She’ll need to give this note to the office. And here’s some lunch money.” She almost knocked over her chair as she got up and went to the counter. She reached into a canister and then handed me some crumpled dollar bills. “If you hurry, she’ll be in time for third period.”\u003c/p\u003e\n\u003cp\u003eI took the note and the money, not knowing what to say. Gwen was a great mom. She and Maria would work things out. But it wouldn’t help for me to say so right now. I gave my sister a hug and headed for the door.\u003c/p\u003e\n\u003cp\u003e“Vicky?” I stopped with my hand on the knob. Gwen’s voice sounded thick. When I looked back, her eyes were shiny with held-back tears. “Can you come over some day next week? School’s out for April vacation, and I think it would help if you and Maria spent some time together.”\u003c/p\u003e\n\u003cp\u003e“Of course. I’ll give you a call tomorrow to work out a time.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I’ll talk to you then.” She turned away, loading breakfast dishes into the dishwasher.\u003c/p\u003e\n\u003cp\u003e5\u003c/p\u003e\n\u003cp\u003eYOU KNOW HOW AFTER A NICE, LONG, RESTFUL SLEEP, YOU wake up to find that things don’t seem so bad after all?\u003c/p\u003e\n\u003cp\u003eMe neither.\u003c/p\u003e\n\u003cp\u003eWhile I slept, I’d tried to contact Mab using the dream phone, a special Cerddorion method of communication that operates through the psychic passageways that open in sleep. Mab doesn’t own a real phone, the kind that goes ring ring and you pick it up and say “hello.” At three hundred years old, she’s not impressed by modern technology, even something as basic as a telephone. And she’s skilled enough to answer a dream-phone call at any time of day. But today she hadn’t answered.\u003c/p\u003e\n\u003cp\u003eThere could be a million reasons why Mab didn’t answer. It was afternoon in Wales when I’d tried to call. My aunt has a life; she doesn’t sit around waiting to hear from me. And the call wasn’t really urgent; I’d survived the Harpy attack, and the book hadn’t told me anything new. Still, her silence concerned me. Mab had been badly weakened in our battle with Myrddin, and although she’d recovered, I worried about her sometimes. So I’d gotten up, gone into the kitchen, and called the pub in the village near Mab’s home. Mr. Cadogan, the publican, told me Mab was fine as far as he knew; he’d spoken with her at the post office that morning. He took my message that I was trying to get in touch with her and promised he’d send someone out to deliver it right away. When I crawled back into bed, I fell into a deep, exhausted sleep.\u003c/p\u003e\n\u003cp\u003eAll too soon I opened my eyes, and the problems of the past days elbowed their way back into my consciousness. My business was still crumbling. Maria and Gwen were still fighting. Simone Landry was still after Kane. And Pryce was still out there somewhere, probably getting ready to attack me again.\u003c/p\u003e\n\u003cp\u003eWelcome to another day in the life.\u003c/p\u003e\n\u003cp\u003eI checked my bedside clock and found it was only four thirty in the afternoon. I turned over, thinking I could catch another hour’s worth of z’s. But it was no good. All the things that were on my mind might as well be lined up by my bed, poking me with sticks. Sleep wasn’t an option. I threw back the sheets and got up. I started some coffee, and took a shower while it brewed.\u003c/p\u003e\n\u003cp\u003eAs I toweled off, I inspected my wounds from last night’s Harpy attack. Everything was healing nicely. The edges of the wound where the Harpy had gouged my leg had knit together and scabbed over. There’d be a scar, but I couldn’t do anything about that.\u003c/p\u003e\n\u003cp\u003eDressed in jeans and a blue cotton sweater, I sipped a mug of strong black coffee. I turned on the phone’s ringer and checked for messages. Just one—the exact number of clients I had left. I crossed my fingers. Please don’t let it be a job cancellation.\u003c/p\u003e\n\u003cp\u003eIt wasn’t. The number was Kane’s. “Hi, it’s me,” he said. His warm, deep voice sent tingles shivering through me. “I’ve been thinking all day how great it would’ve been to have breakfast in bed with you. Couldn’t get the idea out of my mind.” He chuckled, and the tingles reached my toes. “Especially because I have to work tonight. Simone is giving a talk at a meeting of the Human-Paranormal Women’s Business Association, with some potentially big donors in attendance, and I need to be there.” Oh. Funny how fast tingles can evaporate. “It wasn’t on my calendar—I guess her assistant forgot to notify my assistant or something. Simone told me about it this morning, right after you left.”\u003c/p\u003e\n\u003cp\u003eI’d bet she did. She was probably batting her eyelashes and telling him how much she needed him there before the door had closed behind me.\u003c/p\u003e\n\u003cp\u003e“I know you’re working tonight, too,” Kane went on, “so maybe I’ll see you tomorrow? Oh, not for breakfast, though. I’ve got another meeting with Simone in the morning. Always the way, isn’t it? And this month’s retreat is almost here. I hope we can get together before then. If not, I guess it’ll have to be some time next week. Call me when you can.”\u003c/p\u003e\n\u003cp\u003eAlways the way—well, yes and no. In some ways, it was a typical message from Kane. Our work schedules didn’t have a lot of overlap, and one or the other of us was always canceling plans. But what wasn’t typical was hearing another woman’s name woven through his message. Simone, Simone, Simone. I knew what she was trying to do—push herself between us until the werewolf retreat, when she’d have him all to herself.\u003c/p\u003e\n\u003cp\u003eWhy was he managing her campaign, anyway? Kane had never been interested in Deadtown politics before. He was all about getting the norms to recognize paranormal rights, preferably in Washington. How had she talked him into this?\u003c/p\u003e\n\u003cp\u003eThose triumphant green eyes. That smug assurance that she’d win.\u003c/p\u003e\n\u003cp\u003eI needed to talk to Kane. And not on the phone. It wasn’t yet five in the evening, and he never left the office until six. If I went there now, maybe—just maybe—he could pencil me in for an appointment between Simone and Simone and goddamn Simone. \u003c/p\u003e","sourceLink":"https://allnovel.net/darklands-deadtown-4/page-9.html","bookId":2612,"creation":"Oct 5, 2019 6:40:16 PM","modification":"Oct 5, 2019 6:40:16 PM"}
