{"id":21008,"no":34,"title":"Chapter 34","content":"\u003cp\u003e\"This wasn\u0027t done with a sword,\" Hiro says. He is beyond astonishment as he stands and stares at Lagos\u0027s corpse. All the emotions will probably come piling in on him later, when he goes home and tries to sleep. For now, the thinking part of his brain seems cut loose from his body, as if he has just ingested a great deal of drugs, and he\u0027s just as cool as Squeaky.\u003c/p\u003e \n\u003cp\u003e\"Oh, yeah? How can you tell?\" Squeaky says.\u003c/p\u003e \n\u003cp\u003e\"Swords make quick cuts, all the way through. Like, you cut off a head or an arm. A person who\u0027s been killed with a sword doesn\u0027t look like this.\"\u003c/p\u003e \n\u003cp\u003e\"Really? Have you killed a lot of people with swords, Mr.Protagonist?\"\u003c/p\u003e \n\u003cp\u003e\"Yes. In the Metaverse.\"\u003c/p\u003e \n\u003cp\u003eThey stand for a while longer, looking at it.\u003c/p\u003e \n\u003cp\u003e\"This doesn\u0027t look like a speed move. This looks like a strength move,\" Squeaky says.\u003c/p\u003e \n\u003cp\u003e\"Raven looks strong enough.\"\u003c/p\u003e \n\u003cp\u003e\"That he does.\"\u003c/p\u003e \n\u003cp\u003e\"But I don\u0027t think he was carrying a weapon. The Crips frisked him earlier, and he was clean.\"\u003c/p\u003e \n\u003cp\u003e\"Well, then he must have borrowed one,\" Squeaky says. \"This bug was all over the place, you know. We were keeping an eye on him, because we were afraid he was going to piss Raven off. He kept going around looking for a vantage point.\"\u003c/p\u003e \n\u003cp\u003e\"He\u0027s loaded with surveillance gear,\" Hiro says. \"The higher he gets, the better it works.\"\u003c/p\u003e \n\u003cp\u003e\"So he ended up here on this embankment And apparently the perpetrator knew where he was.\"\u003c/p\u003e \n\u003cp\u003e\"The dust,\" Hiro says. \"Watch the lasers.\"\u003c/p\u003e \n\u003cp\u003eDown below, Sushi K pirouettes spastically as a beer bottle caroms off his forehead. A bundle of lasers sweeps across the embankment, clearly visible in the fine dust being drawn out of it by the wind.\u003c/p\u003e \n\u003cp\u003e\"This guy -- this bug -- was using lasers. As soon as he came up here -- \"\u003c/p\u003e \n\u003cp\u003e\"They betrayed his position,\" Squeaky says.\u003c/p\u003e \n\u003cp\u003e\"And then Raven came after him.\"\u003c/p\u003e \n\u003cp\u003e\"Well, we\u0027re not saying it\u0027s him,\" Squeaky says. \"But! need to know if this character\" -- he nods at the corpse -- \"might have done anything that would have made Raven feel threatened.\"\u003c/p\u003e \n\u003cp\u003e\"What is this, group therapy? Who cares if Raven felt threatened?\"\u003c/p\u003e \n\u003cp\u003e\"I do,\" Squeaky says with great finality.\u003c/p\u003e \n\u003cp\u003e\"Lagos was just a gargoyle. A big hoover for intel. I don\u0027t think he did wet operations -- and if he did, he wouldn\u0027t do it in that get-up.\"\u003c/p\u003e \n\u003cp\u003e\"So why do you think Raven was feeling so jumpy?\"\u003c/p\u003e \n\u003cp\u003e\"I guess he doesn\u0027t like being under surveillance,\" Hiro says.\u003c/p\u003e \n\u003cp\u003e\"Yeah.\" Squeaky says. \"You should remember that.\"\u003c/p\u003e \n\u003cp\u003eThen Squeaky puts one hand over his ear, the better to hear voices on his headset radio.\u003c/p\u003e \n\u003cp\u003e\"Did Y.T. see this happen?\" Hiro says.\u003c/p\u003e \n\u003cp\u003e\"No,\" Squeaky mumbles, a few seconds later. \"But she saw him leaving the scene. She\u0027s following him.\"\u003c/p\u003e \n\u003cp\u003e\"Why would she want to do that!?\"\u003c/p\u003e \n\u003cp\u003e\"I guess you told her to, or something.\"\u003c/p\u003e \n\u003cp\u003e\"I didn\u0027t think she\u0027d take off after him.\"\u003c/p\u003e \n\u003cp\u003e\"Well, she doesn\u0027t know that he killed the guy,\" Squeaky says. \"She just phoned in a sighting -- he\u0027s riding his Harley into Chinatown.\" And he begins running up the embankment. A couple of Enforcers\u0027 cars are parked on the shoulder of the highway up there, waiting.\u003c/p\u003e \n\u003cp\u003eHiro tags along. His legs are in incredible shape from sword fighting, and he manages to catch up to Squeaky by the time he reaches his car. When the driver undoes the electric door locks, Hiro scoots into the back seat as Squeaky is going into the front Squeaky turns around and gives him a tired look.\u003c/p\u003e \n\u003cp\u003e\"I\u0027ll behave,\" Hiro says.\u003c/p\u003e \n\u003cp\u003e\"Just one thing -- \"\u003c/p\u003e \n\u003cp\u003e\"I know. Don\u0027t fuck around with Raven.\"\u003c/p\u003e \n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e \n\u003cp\u003eSqueaky holds his glare for another second and then turns around, motions the driver to drive. He impatiently rips ten feet of hard copy out of the dashboard printer and begins sifting through it.\u003c/p\u003e \n\u003cp\u003eOn this long strip of paper, Hiro glimpses multiple renditions of the important Crip, the guy with the goatee whom Raven was dealing with earlier. On the printout, he is labeled as \"T-Bone Murphy.\"\u003c/p\u003e \n\u003cp\u003eThere\u0027s also a picture of Raven. It\u0027s an action shot, not a mug shot, It is terrible output. It has been caught through some kind of light-amplifying optics that wash out the color and make everything incredibly grainy and low contrast. It looks like some image processing has been done to make it sharper; this also makes it grainier. The license plate is just an oblate blur, overwhelmed by the glow of the taillight. It is heeled over sharply, the sidecar wheel several inches off the ground. But the rider doesn\u0027t have any visible neck; his head, or rather the dark splotch that is there, just keeps getting wider until it merges into his shoulders. Definitely Raven.\u003c/p\u003e \n\u003cp\u003e\"How come you have pictures of T-Bone Murphy in there?\" Hiro says.\u003c/p\u003e \n\u003cp\u003e\"He\u0027s chasing him,\" Squeaky says.\u003c/p\u003e \n\u003cp\u003e\"Who\u0027s chasing whom?\"\u003c/p\u003e \n\u003cp\u003e\"Well, your friend Y.T. ain\u0027t no Edward R. Murrow. But as far as we can tell from her reports, they\u0027ve been sighted in the same area, trying to kill each other,\" Squeaky says. He\u0027s speaking with the slow, distant tones of someone who is getting live updates over his headphones.\u003c/p\u003e \n\u003cp\u003e\"They were doing some kind of a deal earlier,\" Hiro says.\u003c/p\u003e \n\u003cp\u003e\"Then I ain\u0027t hardly surprised they\u0027re trying to kill each other now.\"\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/341/699.html","bookId":314,"creation":"Aug 2, 2019 12:12:43 PM","modification":"Aug 2, 2019 12:12:43 PM"}
