{"id":106531,"no":26,"title":"Page 26","content":"\u003cp\u003eText of a letter from Eustasios Krisanthemenis in Constantinople to his uncle, Porphyry Cantheos, in Sinope, carried by merchant ship and delivered two months after it was dispatched.\u003c/p\u003e\n\u003cp\u003eThe greetings of Eustasios Krisanthemenis to his well-regarded uncle, Porphyry Cantheos, in the handsome port of Sinope on this the 537th anniversary of the beginning of the season of the Birth of Christ, which blessed day will come at the end of this dark, miserable month: may Heaven bless you and send you many good things in the year to come, commensurate with your worth and in forms that need no explication to understand. This letter will not be long, for I want to confine it to both sides of a single page; the Captain of the Diadem will charge me by the sheet of parchment, and so I apologize for the necessarily brusque tone of my communication.\u003c/p\u003e\n\u003cp\u003eI am writing to you to ask a favor of you, dear uncle, one that may be something of an imposition upon you, and for which I am more than willing to compensate you. I have recently received yet another missive from my sister, dictated to and written by the Patriarch of her local church. She, you will recall, is a window and presently living in Sarai, on the Caspian Sea, where her late husband had his business. She sent a letter to inform me that her house has been damaged in a storm, and since she has no male relations beyond her young son in that town who can order the repairs required and command the monies to pay for them, she has been forced to seek out her neighbor to provide housing and food for her and her family until his forthcoming departure. She cannot not sell her children, for as their mother she has not the authority to do so, and so they are in a most precarious position, and she has said that she must have the promise of some protection soon, or risk everything. She has told me she would like to return to Constantinople, but just at present that is neither possible nor desirable, for the city is much affected with hunger and illness, which makes it an unhealthy place for anyone.\u003c/p\u003e\n\u003cp\u003eIn two previous letters my remonstrations have made no impact upon her, for she is persisting in soliciting my help. It would be a significant task to attempt to bring her and her family safely to Constantinople at this time, but it would be possible to send her and her three children to you, at least until things are less unstable here. This is the proposition I lay before you, and I hope you will consider this request in the sprit in which it is made-as a plea for our family. I am prepared to send you money twice a year to contribute to the maintenance of my sister and her children. We may decide on a reasonable sum if you are willing to take on this responsibility of housing and feeding my sister and her children. I would propose the amount of ten gold Apostles for the year for my sister and six Apostles each for her children. It is not an extravagant, amount, I agree, but in these days, it is the most generous sum I can offer. My circumstances, have never been affluent, and with the privations of the last two years, I have had to reduce my household and keep my business in much more frugal fashion than I have in the past, which has displeased my wife and children, but has been necessary. I have sold three of the household slaves, keeping only eight to tend to my wife and children as well as my stable and racing teams, which have been idle for almost a year and a halt due to this blight God has visited upon us.\u003c/p\u003e\n\u003cp\u003eI look to hear from you in the spring, and I pray that you will show your family loyalty as well as true Christian charity and say you are willing to bring Thetis and her son and daughters into your house. I also pray that you and your family enjoy good health and as much good fortune as there is to be had in these hard days. May God reward you on earth as well as in Paradise for the kindness you extend to my sister now.\u003c/p\u003e\n\u003cp\u003eEustasios Krisanthemenis\u003c/p\u003e\n\u003cp\u003eHorse-breeder and merchant of Constantinople. \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-of-the-sun-saint-germain-17/page-26.html","bookId":2501,"creation":"Oct 5, 2019 11:00:26 PM","modification":"Oct 5, 2019 11:00:26 PM"}
