{"id":16781,"no":3,"title":"CHAPTER III. AN UNEXPECTED CALL.","content":"\u0026nbsp;\"In what room does your mother live?\" asked Solon Talbot. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is our home,\" said Mark, proceeding to open the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Edgar Talbot sniffed contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see how you can live in such a mean place,\" he remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not a matter of choice,\" returned Mark gravely. \"We have to live in a cheap tenement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time the door was opened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" said Mark, preceding the two visitors, \"here are Uncle Solon and Edgar come to call on you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Mason\u0027s pale cheek flushed, partly with mortification at her humble surroundings, for when she first knew Solon Talbot he was only a clerk, as she had said, and she was a society belle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another feeling also. She had a strong suspicion that her brother-in-law had defrauded her of her share in her father\u0027s estate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see you, Mr. Talbot,\" she said, extending her hand. \"And this is Edgar! How you have grown, Edgar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, ma\u0027am,\" responded Edgar stiffly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Both Mrs. Mason and Mark noticed that he did not call her \"aunt.\" Her nephew\u0027s coldness chilled her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry to see you in such a poor place,\" she said, smiling faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose rents are high in New York,\" said Solon Talbot awkwardly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and our means are small. How is my sister Mary?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite well, thank you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did she send me any message?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She did not know I was going to call.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long it seems since I saw her!\" sighed Mrs. Mason.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you heard that I was in town.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; Mark told me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was not sure whether I could call, as I am here on a hurried business errand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad you have called. I wished to ask you about father\u0027s estate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so! It is very surprising—I assure you that it amazed me very much—to find that he left so little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t understand it at all, Solon. Only a year before he died he told me that he considered himself worth fifteen thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"People are often deluded as to the amount of their possessions. I have known many such cases.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I have only received seventy-five dollars, and there were two heirs—Mary and myself. According to that father must have left only one hundred and fifty dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course he left more, but there were debts—and funeral expenses and doctor\u0027s bills.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand that, but it seems so little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was very little, and I felt sorry, not only on your account, but on Mary\u0027s. Of course, as my wife, she will be provided for, but it would have been comfortable for her to inherit a fair sum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can imagine what it is to me who am not amply provided for. I thought there might be five thousand dollars coming to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Solon Talbot shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That anticipation was very extravagant!\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was founded on what father told me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True; but I think your father\u0027s mind was weakened towards the end of his life. He was not really responsible for what he said.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I disagree with you there, Solon. Father seemed to me in full possession of his faculties to the last.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You viewed him through the eyes of filial affection, but I was less likely to be influenced in my judgments.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five thousand dollars would have made me so happy. We are miserably poor, and Mark has to work so hard to support us in this poor way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought telegraph boys earned quite a snug income,\" said Solon Talbot, who looked uncomfortable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was dreading every moment that his sister-in-law would ask him for pecuniary assistance. He did not understand her independent nature. Her brother-in-law was about the last man to whom she would have stooped to beg a favor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mark sometimes makes as high as five dollars a week,\" said Mrs. Mason in a tone of mild sarcasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sure that is very good pay for a boy of his age.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a small sum for a family of three persons to live upon, Solon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Um, ah! I thought perhaps you might earn something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sometimes I earn as high as a dollar and a half a week making shirts.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Talbot thought it best to drop the subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am deeply sorry for you,\" he said. \"It is a pity your husband didn\u0027t insure his life. He might have left you in comfort.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He did make application for insurance, but his lungs were already diseased, and the application was refused.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may be able to help you—in a small way, of course,\" proceeded Solon Talbot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark looked up in surprise. Was it possible that his close-fisted uncle was offering to assist them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Mason did not answer, but waited for developments.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have already paid you seventy-five dollars from your father\u0027s estate,\" resumed Mr. Talbot. \"Strictly speaking, it is all you are entitled to. But I feel for your position, and—and your natural disappointment, and I feel prompted to make it a hundred dollars by paying you twenty-five dollars more. I have drafted a simple receipt here, which I will get you to sign, and then I will hand you the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew from his wallet a narrow slip of paper, on which was written this form:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Received from Solon Talbot the sum of One Hundred Dollars, being the full amount due me from the estate of my late father, Elisha Doane, of which he is the administrator.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Talbot placed the paper on the table, and pointing to a black line below the writing, said, \"Sign here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me see the paper, mother,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He read it carefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I advise you not to sign it,\" he added, looking up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\" exclaimed Solon Talbot angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean,\" returned Mark firmly, \"that mother has no means of knowing that a hundred dollars is all that she is entitled to from grandfather\u0027s estate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t I tell you it was?\" demanded Talbot frowning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Solon,\" said Mark calmly, \"I am only a boy, but I know that one can\u0027t be too careful in business matters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you dare to doubt my father\u0027s word?\" blustered Edgar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Our business is with your father, not with you,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it you want?\" asked Solon Talbot irritably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want, or rather mother does, to see a detailed statement of grandfather\u0027s property, and the items of his debts and expenses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Solon Talbot was quite taken aback by Mark\u0027s demand. He had supposed the boy knew nothing of business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really,\" he said, \"this impertinence from my own nephew is something I was by no means prepared for. It is a poor return for my liberal offer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your liberal offer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, the twenty-five dollars I offered your mother is out of my own pocket—offered solely out of consideration for her poverty. Do I understand,\" he asked, addressing his sister-in-law, \"that you decline my offer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Mason looked doubtfully at Mark. Twenty-five dollars in their present circumstances would be a boon, and, in addition to Mark\u0027s earnings, would tide them over at least three months. Was it right, or wise, to decline it?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark\u0027s face showed no signs of wavering. He was calm and resolute.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think, Mark?\" asked his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You know what I think, mother. We have no knowledge that the estate has been fairly administered, and you would be bartering away our rights.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I won\u0027t sign the receipt, Solon,\" said Mrs. Mason.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Solon Talbot looked very angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then,\" he replied, \"I cannot give you the twenty-five dollars. Edgar, we will go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give my love to Mary,\" faltered Mrs. Mason.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Solon Talbot deigned no answer, but strode from the room with an angry look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother, I am convinced that Uncle Solon was trying to swindle us,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope we have done right, Mark,\" rejoined his mother doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is this, mother?\" asked Mark, as he picked up from the floor a letter partially torn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must have been dropped by Solon Talbot.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2989/82421.html","bookId":323,"creation":"Aug 2, 2019 8:02:01 AM","modification":"Aug 2, 2019 8:02:01 AM"}
