{"id":16811,"no":33,"title":"CHAPTER XXXIII. A CHANGE FOR PHILIP.","content":"\u0026nbsp;Mr. Sprague and Oscar looked at each other in complete stupefaction. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does it mean? Where can the boy have gone?\" ejaculated Nahum.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll be blest if I know,\" returned Oscar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The door was locked. He must have gone through the window. There wasn\u0027t any rope in the room, was there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And if he jumped out he would certainly have broken his neck, or his limbs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wouldn\u0027t have dared to jump. He\u0027s no braver than a mouse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the most mysterious thing I ever heard of,\" said Mr. Sprague, wrinkling his brows.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you going to do about it, dad?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I\u0027m flabbergasted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you what to do when you get him back,\" suggested Oscar. \"Give him a sound thrashing. It will do him good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can depend upon that. I think it may be well after breakfast for you to go round and inquire if he has been seen in the village.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall I say about his running away?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say he\u0027s a little touched in the upper story.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess he\u0027d better be touched somewhere else,\" said Oscar with a loud laugh at his own wit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Considerably to his disgust Oscar was set to work doing some of Philip\u0027s chores directly after breakfast, and it was nine o\u0027clock before he got ready to start in quest of Philip. Even then he did not start, for an open buggy stopped at the gate, driven by a man from the village, and containing as passenger, a boy of sixteen. This boy was Mark Mason, as the reader will easily conjecture.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s that, Oscar! Is it one of your friends?\" asked Nahum Sprague.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; never saw him before in my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark advanced directly to Mr. Sprague.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this Mr. Nahum Sprague?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; that\u0027s my name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does a boy named Philip Lillis live with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what if there does?\" inquired Mr. Sprague cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sent from New York to take charge of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You! A boy like you?\" exclaimed Nahum in surprise. \"Why, you ain\u0027t over sixteen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve guessed my age exactly,\" said Mark with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who sends you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. David Gilbert.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he—rich?\" asked Nahum curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he\u0027s pretty well off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he is willing to take care of the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Can I see Philip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" answered Nahum Sprague in an embarrassed tone, \"you can pretty soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And why not now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fact is, rather a cur\u0027us thing happened last night. The boy disappeared.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that true?\" asked Mark with some suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Fact is, the boy ain\u0027t quite right in his head.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry for that,\" said Mark gravely. \"How long has he been affected that way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only lately, I don\u0027t think it will last.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please tell me the circumstances.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, we locked him in the attic for fear he might get out and come to some harm when he was light-headed, and this morning we couldn\u0027t find him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please show me the room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though a boy, Mark spoke with unconscious authority, and Mr. Sprague immediately complied with his request.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way up into the attic, and Mark looked into the room. He was struck at once with its bare, unfurnished aspect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did the boy spend the night here?\" he asked abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did he sleep?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sprague saw his mistake too late.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why—the fact is,\" he said hesitating, \"the boy acted badly, and I confined him here as a punishment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Expecting him to sleep on the floor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, yes—as a punishment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How old is the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ten years old.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then all I can say is, that you treated him very cruelly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That ain\u0027t the way to talk to me,\" blustered Sprague. \"I guess I know the way to treat boys. You\u0027re only a boy yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true, but what has that got to do with it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You should be more respectful to your elders.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose we get back to business, Mr. Sprague. Has Philip ever run away before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, and it\u0027s very ungrateful for him to do it now. Why, I have supported him ever since his father\u0027s death, and I paid the expenses of his father\u0027s funeral.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall probably repay you for that—when you find, and deliver to me the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was welcome intelligence to Mr. Sprague, who straightway became very polite to Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, my dear young friend. I wouldn\u0027t accept it if I was not a poor man. I am very much attached to the boy, and I wouldn\u0027t let him go if I could afford to keep him. Oscar, go to the village at once and see if you can see anything of Philip.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go with him, Mr. Sprague.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; but be sure to come back before you take him away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly shall. It would not be fair to you to do otherwise. You may get ready the items of expense while I am gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, I will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How provoking that Philip should go away just at this time!\" thought Nahum. \"It seems so mysterious, too. I do hope nothing has happened to the boy, or this fellow, who seems very sharp, may not be willing to pay me my bill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Oscar and Mark went to the village.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you live in New York?\" asked Oscar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you Mr. Gilbert\u0027s son?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I am only his messenger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you actually came all the way from New York alone?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he give you plenty of money for traveling?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, a pretty good sum,\" answered Mark, smiling. \"What do you think has become of Philip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Blest if I know. I don\u0027t see how he could get out of the window.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he hasn\u0027t come to any harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I guess not,\" said Oscar indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like the boy?\" asked Mark keenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I don\u0027t care much about kids,\" answered Oscar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you any idea where Philip would be likely to go? Has he ever left home before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; and he wouldn\u0027t now if he wasn\u0027t crazy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment they met Albert Frost.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know that boy?\" asked Mark. \"Perhaps he has seen Philip.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say, Albert,\" said Oscar, \"have you seen anything of Philip Lillis?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why do you ask? Don\u0027t he live at your house?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but he\u0027s taken French leave.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Something in Albert\u0027s face led Mark to suspect that he knew more of Philip than he cared to tell, also that he was a friend of the young boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have come from New York to take Philip with me,\" he said significantly. \"A friend of his father is going to adopt him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this sure?\" asked Albert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I am very anxious to find the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come here,\" said Albert. \"Perhaps I can put you on his track. No, not you!\" This last was addressed to Oscar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" went on Albert, \"can I depend on your being a friend of Philip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, you can. The boy will be in good hands when he reaches New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He isn\u0027t now,\" said Albert. \"I helped him escape from old Sprague\u0027s last night. I can get him for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do so then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are sure Sprague won\u0027t beat him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I am to pay him some money, and I won\u0027t do it if any harm comes to the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go back with Oscar,\" said Albert aloud, \"and I will have Philip at the house inside of half an hour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is he?\" asked Oscar curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know—exactly, but I can find him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he at your house?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. Go back and you will soon see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nahum Sprague was much pleased when the two boys brought home this intelligence. He had prepared a bill for expenses amounting to a hundred dollars, on which his profit would be considerable. Money with him was all powerful, and though he would have been glad to give Philip a good thrashing, he cared still more for money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Philip made his appearance, accompanied by Albert and Arthur Burks, Mr. Sprague greeted him with a genial smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am almost tempted to call you a bad boy,\" he said. \"You have made me feel quite anxious. This young gentleman has come here to take you to New York. We shall miss you sadly, Mrs. Sprague and I, but if it is for your good we won\u0027t complain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you willing to go with me, Philip?\" asked Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip looked up in Mark\u0027s face, and did not hesitate a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" he said, placing his hand in Mark\u0027s; \"I am ready to go now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know whether your clothes are ready,\" said Mr. Sprague. \"They may need washing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Philip\u0027s appearance was such that Mark felt that he would at once have to buy him a new outfit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind about the clothes, Mr. Sprague,\" he said. \"I shall buy Philip some new ones.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they were preparing to start Mr. Sprague ostentatiously wiped his eyes on a large bandana handkerchief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pardon my emotion, Mr. Mason,\" he said, addressing Mark, \"but Philip is very near and dear to me, and so was his father. I cannot part from him without a pang. Yet if he is to be better off I will not murmur. Philip, my dear child, don\u0027t forget your uncle Nahum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall remember you, Mr. Sprague,\" said Philip. This at least he could say with truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, thank you! I thought you would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say, kid,\" put in Oscar, \"my birthday comes the 17th of October. If you\u0027re rich and prosperous, you might send me a birthday gift.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip smiled. All this unwonted attention amused him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t forget you, Oscar,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The buggy drove up, and Mark helped Philip inside.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you want to cry, don\u0027t mind me,\" he said to Philip with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I cry, it will be for joy,\" said Philip. \"I never want to see Mr. Sprague or any of his family again.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2989/82451.html","bookId":323,"creation":"Aug 2, 2019 8:03:35 AM","modification":"Aug 2, 2019 8:03:35 AM"}
