{"id":93638,"no":45,"title":"Page 45","content":"\u003cp\u003eShe was almost asleep when she realized she was no longer in bed alone. She would have run screaming out of the room if a strong arm hadn\u0027t circled her waist.\u003c/p\u003e\n\u003cp\u003e\"Shh, my sweet one, it is only me.\"\u003c/p\u003e\n\u003cp\u003e\"Antonio.\"\u003c/p\u003e\n\u003cp\u003e\"Go to sleep, beloved. There is nothing for you to fear.\"\u003c/p\u003e\n\u003cp\u003eShe snuggled against him, all her anxiety forgotten now that he was there, holding her in his arms.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" she murmured, and slid over the abyss into sleep.\u003c/p\u003e\n\u003cp\u003eThere were no bad dreams that night.\u003c/p\u003e\n\u003cp\u003eVicki woke with a smile on her face. Eyes still closed, she reached for Antonio, frowned when she realized she was alone in bed. Coming fully awake, she realized it was morning and he was gone.\u003c/p\u003e\n\u003cp\u003eWould he ever tell her where he rested during the day? After all they had been through together, did he honestly think she would betray his hiding place? Or was it that he didn\u0027t want her to see him when he was… what? Whatever it was, she preferred to think of it as sleeping.\u003c/p\u003e\n\u003cp\u003eSitting up, she saw a note propped on the table beside the bed. She smiled when she recognized Antonio\u0027s handwriting.\u003c/p\u003e\n\u003cp\u003eVictoria — Duncan has gone back to Pear Blossom Creek. He said he would see you at the wedding. Gather your things and I will take you home tonight. Love, A.\u003c/p\u003e\n\u003cp\u003eHer smile faded as she reread his note. For all his talk about loving her, now that the danger was over, it seemed he couldn\u0027t wait to get rid of her.\u003c/p\u003e\n\u003cp\u003eFighting tears, she made the bed, then packed her clothes. If he wanted her gone, then she would go.\u003c/p\u003e\n\u003cp\u003eGoing downstairs, she went into the kitchen and fixed a cup of tea. She had no appetite for breakfast.\u003c/p\u003e\n\u003cp\u003eLady Kathryn joined her at the breakfast table a few minutes later. \"I do so miss a good cup of tea,\" she said wistfully, then frowned. \"Are you crying?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Vicki said, sniffling, \"of course not.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong, dear?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going home tonight.\"\u003c/p\u003e\n\u003cp\u003eLady Kathryn smiled. \"Ah, yes, I heard that that monstrous beast, Falco, had been destroyed. It was very brave, what you did.\"\u003c/p\u003e\n\u003cp\u003e\"It didn\u0027t feel brave.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it was. I must say, I\u0027m sorry to see you go. Perhaps you\u0027ll come back and visit again soon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to, but I\u0027m afraid that won\u0027t be possible.\"\u003c/p\u003e\n\u003cp\u003e\"What has that man done now?\" Lady Kathryn asked indignantly.\u003c/p\u003e\n\u003cp\u003e\"Nothing. He… He just doesn\u0027t want me.\"\u003c/p\u003e\n\u003cp\u003e\"Why, of course he does! Any fool can see that. He\u0027s just afraid, don\u0027t you know, afraid of loving you, afraid of losing you.\"\u003c/p\u003e\n\u003cp\u003e\"Losing me? Why should he lose me? I love him, too.\"\u003c/p\u003e\n\u003cp\u003e\"Time has no meaning to a vampire,\" the ghost said. \"But for a mortal… Well, think how hard it would be for him to watch you grow old while he stayed the same. And eventually… Well, he\u0027d be alone again. Sometimes it\u0027s easier to do without something you love than to have it for a short time and then lose it, don\u0027t you see?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I guess so.\" Like must marry like, Vicki thought, remembering what the ghost had told her before. It might be true, but it didn\u0027t make the hurt go away.\u003c/p\u003e\n\u003cp\u003eAntonio appeared at sundown. He looked incredibly sexy in a pair of tight black jeans and a black sweatshirt. Just looking at him make her heart race and her insides tingle.\u003c/p\u003e\n\u003cp\u003eShe wanted nothing more than to spend the rest of her life making him happy.\u003c/p\u003e\n\u003cp\u003e\"Are you ready?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, too close to tears to speak.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes when he put his arm around her. Once again, she experienced that sense of flying swiftly through the air, a sudden queasiness, like being seasick, followed by a familiar feeling of weightlessness, as if her soul had left her body behind.\u003c/p\u003e\n\u003cp\u003eThe next thing she knew, she was standing in the middle of her living room. \"I guess you\u0027ll be going now,\" she said, blinking rapidly to keep from crying.\u003c/p\u003e\n\u003cp\u003e\"The danger is past.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want you to go.\"\u003c/p\u003e\n\u003cp\u003e\" Victoria … \"\u003c/p\u003e\n\u003cp\u003e\"I want you to stay.\" The word forever hovered unspoken in the air between them. \"Will you stay, at least for a little while?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. Dragging it out would not make it easier for either of them, but he couldn\u0027t bear the sadness in her eyes. Another week, perhaps two. What harm could it do? She was young. Perhaps she would come to realize that what she felt for him was no more than infatuation for a creature unlike anything she had ever known. Perhaps when she realized how little she had in common with a vampire, it would make leaving her easier.\u003c/p\u003e\n\u003cp\u003eIf he was lucky, maybe she would ask him to leave.\u003c/p\u003e\n\u003cp\u003eShe smiled when he agreed to stay. It warmed the cold places in his heart. He would do anything she wished just to see that smile.\u003c/p\u003e\n\u003cp\u003eVicki glanced around her house. Except for a fine layer of dust on everything, the house looked the same as always. Odd, that it no longer felt like home.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" she exclaimed. \"My fish!\" How could she have forgotten about them?\u003c/p\u003e\n\u003cp\u003eThey were dead, of course. Looking at them, she burst into tears.\u003c/p\u003e\n\u003cp\u003e\" Victoria.\" Antonio had followed her into the den. Drawing her into his arms, he held her close. He knew she wasn\u0027t crying for the fish, at least not entirely. It was a natural reaction to everything she had been through in the past few weeks, a release of tension and fear and the horror of Falco\u0027s death.\u003c/p\u003e\n\u003cp\u003eHe stroked her back, his whole body attuned to her every breath, her every heartbeat.\u003c/p\u003e\n\u003cp\u003eThe fragrance of her hair and skin teased his nostrils, the scent of her blood spoke to his hunger.\u003c/p\u003e\n\u003cp\u003eGradually, her tears subsided and she stood, unmoving, in his arms, her cheek pillowed on his chest. Awareness sparked between them.\u003c/p\u003e\n\u003cp\u003eAntonio rested his chin on the top of her head. How long could he refuse to take what he so desperately wanted? How could he take her innocence knowing he was going to leave her?\u003c/p\u003e\n\u003cp\u003eHe groaned low in his throat as his body warred with his conscience.\u003c/p\u003e\n\u003cp\u003eShe leaned into him, her arms sliding up around his neck. \"You want me,\" she said, \"I know you do.\" Drawing his head down, she pressed her lips to his.\u003c/p\u003e\n\u003cp\u003eHe crushed her body to his, his mouth devouring hers as if he could never get enough, as if he would never let her go. She was every dream he had refused to acknowledge, every hope for a future he could never have.\u003c/p\u003e\n\u003cp\u003eHis hands caressed her, memorizing every soft, sweet curve, the silky-smooth texture of her hair, the line of her back, the way her body so perfectly molded itself to his.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes, imprinting the way her hands felt on his body as she began a slow exploration of her own, the way her breath caught in her throat when she felt his arousal, the way her tongue dueled with his.\u003c/p\u003e\n\u003cp\u003e\"Antonio, please… \"\u003c/p\u003e\n\u003cp\u003eHe looked into her eyes, eyes filled with love and trust and yearning, and knew he would never be able to forgive himself if he took what she was offering. Making love to her, stealing her virginity, would prove he was as much a monster as Dimitri Falco, but instead of taking Victoria \u0027s life, he would be taking her innocence, something he had no right to take and nothing to give in return.\u003c/p\u003e\n\u003cp\u003e\" Victoria, listen to me— \"\u003c/p\u003e\n\u003cp\u003e\"No! I don\u0027t want to hear it. Not now. Not ever.\"\u003c/p\u003e\n\u003cp\u003e\"There can be no future for us, sweeting. You must know that.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe that!\" But there it was again, Lady Kathryn\u0027s voice telling her that like must marry like.\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to argue, but found herself unable to speak when his gaze caught and held hers.\u003c/p\u003e\n\u003cp\u003e\"You will hear me,\" he said. \"I cannot be what you want or what you need. I cannot be a husband or a father. I cannot share your life, and you cannot share mine. In time you would come to hate me for the sacrifices you would have to make to stay with me. I told you before, a vampire\u0027s existence is a life against nature. I could not bear your hatred. I could not bear to watch you grow old, knowing I had cheated you of the chance to live a normal life, to have a family. I love you. You must never doubt that. I love you as I have never loved anyone else. I know I told you I would stay for a while, but I think it is best for both of us if I go now. Prolonging our good-bye will not make it easier for either of us.\"\u003c/p\u003e\n\u003cp\u003eHe kissed her then, pouring all his love and his longing into that one soul-deep kiss.\u003c/p\u003e\n\u003cp\u003e\"I love you, Victoria Cavendish,\" he said fervently. \"Please forgive me.\"\u003c/p\u003e\n\u003cp\u003eUnable to speak or to move, she could only stand there while tears dripped down her cheeks.\u003c/p\u003e\n\u003cp\u003e\"Buono notte, my sweet one,\" he whispered, and disappeared in a swirling gray mist.\u003c/p\u003e\n\u003cp\u003eReleased from his spell, she sank down on the floor. Wrapping her arms around her waist, she rocked back and forth while silent tears rained down her cheeks.\u003c/p\u003e\n\u003cp\u003eHe was gone, and she would never fall in love again.\u003c/p\u003e\n\u003cp\u003eShe grieved for a week and then she pulled herself together and went back to work.\u003c/p\u003e\n\u003cp\u003eGus welcomed her with a bear hug and a smile, and after the first hour or so, it was as if she had never been away.\u003c/p\u003e\n\u003cp\u003eWhen people asked where she had been for so long, she shrugged and said she had been on a much-needed vacation.\u003c/p\u003e\n\u003cp\u003eBobbie Sue was glowing with happiness, eager to show Vicki her engagement ring, properly outraged at the way Antonio had behaved.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe he would just leave you like that!\" Bobbie Sue said during one of their breaks. \"I mean, really, after all you did for him! Why, you saved his life, the ungrateful… man!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Bobbie Sue,\" Vicki had said, fighting tears. \"If he\u0027d been a man, he\u0027d still be here.\"\u003c/p\u003e\n\u003cp\u003eIt stormed on Thanksgiving, reminding Vicki of the night she had first seen Antonio. But then, it seemed that everything reminded her of Antonio.\u003c/p\u003e\n\u003cp\u003eBobbie Sue had invited Vicki to have dinner at her house, but it was too painful to be around Bobbie Sue and Tom, to see how happy they were together.\u003c/p\u003e\n\u003cp\u003eInstead, Vicki spent the holiday with Mrs. Heath. The older woman listened intently as Vicki told her everything that had happened since she left Pear Blossom Creek.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s dead,\" Mrs. Heath exclaimed softly. \"I can scarcely believe it. Do you know what this means? It means I don\u0027t have to be afraid anymore. I can sit outside at night and watch the fireflies. Bless you, child!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/desire-after-dark-vampire-trilogy-3/page-45.html","bookId":2298,"creation":"Oct 5, 2019 6:03:24 PM","modification":"Oct 5, 2019 6:03:24 PM"}
