{"id":111871,"no":11,"title":"Page 11","content":"\u003cp\u003eGia zeroed in on the gauze as soon as Jack pulled off his T-shirt.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this?\"\u003c/p\u003e\n\u003cp\u003eHe pulled off the dressing and saw it had further healed to the point where it had stopped oozing. He\u0027d forgotten about it because the pain was gone. This was scary.\u003c/p\u003e\n\u003cp\u003e\"Just a scratch.\" At least it was now.\u003c/p\u003e\n\u003cp\u003eSlim, with short blond hair and sky-blue eyes, Gia sat next to him on her bed. Vicky was asleep and they were enjoying a little private time.\u003c/p\u003e\n\u003cp\u003e\"When? I don\u0027t remember this yesterday.\"\u003c/p\u003e\n\u003cp\u003eShe removed her top and unfastened her bra as he gave her a quick rundown of the incident in Central Park. Her pink-tipped breasts weren\u0027t large and weren\u0027t small. A handful each ... just right.\u003c/p\u003e\n\u003cp\u003eHer blue eyes were wide. \"That shoot-out in the park? That was you?\"\u003c/p\u003e\n\u003cp\u003e\"I was just walking by - \"\u003c/p\u003e\n\u003cp\u003e\"How do you manage to get involved in these things?\"\u003c/p\u003e\n\u003cp\u003e\"I was minding my own business.\"\u003c/p\u003e\n\u003cp\u003eHe was reaching for one of her breasts but she pushed his hand away and leaned close, studying the wound.\u003c/p\u003e\n\u003cp\u003e\"The news said a man was killed. That could have been you.\" She frowned. \"This looks almost healed.\"\u003c/p\u003e\n\u003cp\u003e\"Told you it was just a scratch. Doc Hargus said it hardly needed the butterflies.\" To prove his point, Jack pulled them off. \"There.\"\u003c/p\u003e\n\u003cp\u003eHe stared at the wound. No way the healing should be this far gone.\u003c/p\u003e\n\u003cp\u003e\"You do heal fast.\"\u003c/p\u003e\n\u003cp\u003eJack opened his mouth to tell her, but closed it again. Why try to explain what he didn\u0027t know for sure, what he only suspected? He\u0027d talk to Glaeken first and see what he thought.\u003c/p\u003e\n\u003cp\u003eShe ran a finger lightly along the line of the wound. \"That other bullet scar is round.\"\u003c/p\u003e\n\u003cp\u003e\"That was a direct hit. This was a graze.\"\u003c/p\u003e\n\u003cp\u003e\"Looks like something a knife might make.\" He\u0027d expected her to be repulsed, and maybe if the wound looked fresher, she would be. But she seemed fascinated. \"Or a sword.\"\u003c/p\u003e\n\u003cp\u003e\"Sword?\" He laughed. \"Where\u0027d that come from?\"\u003c/p\u003e\n\u003cp\u003e\"I guess I have swords on my mind,\" she said as she slipped out of her jeans. \"I mean, since Vicky asked if I thought you\u0027d mind if she brought your katana into school for show and tell.\"\u003c/p\u003e\n\u003cp\u003e\"The Gaijin Masamune?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever.\"\u003c/p\u003e\n\u003cp\u003e\"How does she know about that?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s visible on the top shelf of your front closet. Every time we hang up our coats - \"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay. But how does she even know what a katana is?\"\u003c/p\u003e\n\u003cp\u003e\"A combination of things. They\u0027re studying Japan in school, and today she happened to catch some of The Seven Samurai on TV.\"\u003c/p\u003e\n\u003cp\u003e\"But she hates black-and-white films.\"\u003c/p\u003e\n\u003cp\u003eHe remembered how he\u0027d had to bribe her to watch the original King Kong.\u003c/p\u003e\n\u003cp\u003e\"Well, she didn\u0027t watch for long, and I\u0027m pretty sure she would have flipped right past if they hadn\u0027t been studying Japan. But she lasted long enough to recognize the swords in the samurais\u0027 belts as just like the one in your closet.\"\u003c/p\u003e\n\u003cp\u003e\"And she wants to bring it to class?\"\u003c/p\u003e\n\u003cp\u003eShe slipped out of her panties.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. I\u0027ve already told her it\u0027s not going to happen. Not with the schools\u0027 zero-tolerance policy.\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t take his eyes off her.\u003c/p\u003e\n\u003cp\u003e\"Right. They get freaked about toy light sabers. Imagine something that can really lop off limbs and heads. Besides, it\u0027s pretty messed up.\"\u003c/p\u003e\n\u003cp\u003eGia kissed his wound. \"Not like your other sword.\"\u003c/p\u003e\n\u003cp\u003e\"What other sword?\"\u003c/p\u003e\n\u003cp\u003eShe kissed his chest. \"The pretty one. The one that only I see.\"\u003c/p\u003e\n\u003cp\u003e\"Oh ... that one.\" His skin tingled at her touch.\u003c/p\u003e\n\u003cp\u003e\"Yes, that one. How\u0027s it doing?\"\u003c/p\u003e\n\u003cp\u003e\"Ready for battle.\"\u003c/p\u003e\n\u003cp\u003eShe pushed him back and trailed her lips down along his abdomen.\u003c/p\u003e\n\u003cp\u003e\"I sure hope so...\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-11.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
