{"id":111877,"no":17,"title":"Page 17","content":"\u003cp\u003e\"Are you really going to eat that?\" Weezy said, eyeing Eddie\u0027s thick pastrami on rye. \"All of it?\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"Every freakin\u0027 bite.\"\u003c/p\u003e\n\u003cp\u003eWeezy shook her head. If the meat wasn\u0027t stacked a full two inches, it was close. She looked around at the Lower East Side kosher deli Eddie had chosen - Moishe\u0027s on Second Avenue.\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you find this place?\" she said as he took a great-white bite. He had a sublet in the West Village, on the opposite side of the island.\u003c/p\u003e\n\u003cp\u003eHe chewed, swallowed, and sipped his Pepsi One.\u003c/p\u003e\n\u003cp\u003e\"I wander the city most of the day. I mean, nothing else to do. I wandered in here for breakfast once and liked it.\"\u003c/p\u003e\n\u003cp\u003e\"Youse folks okay here?\" said a high-pitched, cigarette-scorched voice with an aggressive Brooklyn accent.\u003c/p\u003e\n\u003cp\u003eWeezy studied their waitress. She looked seventy and was built like Olive Oyl, but with a widow\u0027s hump and hair the color of a caution light. She seemed to have a pot of coffee grafted to her hand. Her name tag read Sally and her eye makeup was a wonder - a rainbow of blue hues applied like spackle.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re doing great,\" Weezy told her.\u003c/p\u003e\n\u003cp\u003e\"You ain\u0027t touched your lox. Eat up. You never know when you\u0027re gonna get to eat again.\"\u003c/p\u003e\n\u003cp\u003eAs Sally wandered away in search of needy coffee cups, Weezy forked a piece of the salmon into her mouth. She wasn\u0027t particularly hungry. Not after seeing the Lady pierce herself with that sword.\u003c/p\u003e\n\u003cp\u003eShe nodded at Eddie who\u0027d just taken another huge bite. \"I don\u0027t think you\u0027ll have to eat again for a week.\"\u003c/p\u003e\n\u003cp\u003eShe noticed he\u0027d gained some weight since she\u0027d last seen him, though nothing like the Pugsley pudginess of his teen years. He was either letting his sandy hair grow longer or hadn\u0027t bothered to get it cut.\u003c/p\u003e\n\u003cp\u003e\"Still working out?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"What\u0027s the point?\"\u003c/p\u003e\n\u003cp\u003e\"Same point as before, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\" he said with some heat. \"I played by all the rules, Weez. I slimmed down, I got in shape, I worked hard, gave good value to my clients. And where did it get me? I had to abandon my business, I\u0027m afraid to go back to my house, I\u0027m subletting a roach-infested apartment. What went wrong?\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d never been the type to feel sorry for himself. Maybe he was simply bored and frustrated. Either way, she would let him answer his own question.\u003c/p\u003e\n\u003cp\u003e\"I think you know what went wrong.\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Yeah. I joined the Order.\"\u003c/p\u003e\n\u003cp\u003eBull\u0027s-eye.\u003c/p\u003e\n\u003cp\u003eThey\u0027d discussed this before but she\u0027d never gotten a satisfactory answer.\u003c/p\u003e\n\u003cp\u003e\"Why, Eddie?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"At the time it was, \u0027Why not?\u0027\" He raised a hand as she opened her mouth to reply. \"I know, I know. You always categorized it as one of the sinister forces in the world, one of the powers guiding the Secret History. But do you know how that sounds to the average person?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Crazy. Plus I did have my emotional problems, and I was diagnosed as manic-depressive, so I don\u0027t blame you one bit for dismissing what I said.\"\u003c/p\u003e\n\u003cp\u003e\"It went beyond dismissing, you know. I got to the point where if you said something was black, I\u0027d assume it was white.\"\u003c/p\u003e\n\u003cp\u003eShe felt her throat tighten and her eyes fill. She blinked back tears.\u003c/p\u003e\n\u003cp\u003eEddie reached across and covered her hand. \"I\u0027m sorry, Weez. I didn\u0027t mean - \"\u003c/p\u003e\n\u003cp\u003e\"No-no. It\u0027s okay. It wasn\u0027t just you. Mom and Dad were the same, and the kids in school. Every time I opened my mouth, eyes would roll. Finally I simply shut up. And now...\"\u003c/p\u003e\n\u003cp\u003e\"Now you know you were right all along.\"\u003c/p\u003e\n\u003cp\u003e\"And wish I weren\u0027t. I wish this were all the product of a mind careening out of control due to a screwed-up soup of neurotransmitters.\" She squeezed his hand. \"But Eddie, it\u0027s worse and more fantastic than I ever suspected.\"\u003c/p\u003e\n\u003cp\u003eHe frowned. \"More fantastic? How - ?\"\u003c/p\u003e\n\u003cp\u003e\"Trust me?\" She squeezed his hand harder. \"I\u0027m saying it\u0027s black.\"\u003c/p\u003e\n\u003cp\u003eHe hesitated a heartbeat, then nodded. \"Then black it is. How black?\"\u003c/p\u003e\n\u003cp\u003eWeezy closed her eyes and swallowed a sob of joy. Breakthrough. Her brother believed her ... finally believed her.\u003c/p\u003e\n\u003cp\u003e\"Black-hole black.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"That book of yours - \"\u003c/p\u003e\n\u003cp\u003e\"The Compendium of Srem.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that. There\u0027s nothing else in the world like it. That was a clue. And then the Order turning against me.\"\u003c/p\u003e\n\u003cp\u003e\"They were never for you.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty obvious now, but they come on so benign, with such a seductive line. All the movers and shakers belong, and you can belong too - if you qualify.\"\u003c/p\u003e\n\u003cp\u003eWeezy nodded. \"That\u0027s the grabber.\"\u003c/p\u003e\n\u003cp\u003e\"Damn right it is. Appeals to the elitism in all of us. And it\u0027s not a marketing tool. You really do have to qualify. They put you through a rigorous vetting that lots of people don\u0027t pass.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Many are called but few are chosen.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re quoting Jesus now?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"Whatever fits.\"\u003c/p\u003e\n\u003cp\u003e\"Well, whatever their criteria, I was chosen. I look back and can\u0027t believe I let them brand me. That\u0027s how seductive it is. I spent six years in blissful ignorance until...\"\u003c/p\u003e\n\u003cp\u003e\"Until I upset the apple cart.\"\u003c/p\u003e\n\u003cp\u003e\"Turned on the light is more like it.\" He shook his head again. \"The Order was going to kill me.\"\u003c/p\u003e\n\u003cp\u003eRight ... bad enough Eddie had learned something he wasn\u0027t supposed to know, he\u0027d mentioned it to the wrong person.\u003c/p\u003e\n\u003cp\u003eHe added, \"They would have if Jack hadn\u0027t interfered.\"\u003c/p\u003e\n\u003cp\u003eWeezy had to smile. \"He\u0027s very good at interfering.\"\u003c/p\u003e\n\u003cp\u003eHad it been only two weeks?\u003c/p\u003e\n\u003cp\u003e\"You should have seen him, Weez. He beat the crap out of some guy named Szeto, then killed the guy who was driving me on my one-way trip. I mean, killed him like you or I would swat a fly.\"\u003c/p\u003e\n\u003cp\u003e\"Well, the driver was trying to shoot you.\"\u003c/p\u003e\n\u003cp\u003e\"I know that.\" He barked a brittle laugh. \"Don\u0027t get me wrong. I\u0027m not being the least bit critical. You\u0027d told me he\u0027d killed to protect you, but the image wouldn\u0027t stick. Then I saw him in action and he was ... the best way I can put it is coldly efficient. It was like someone else had taken over.\"\u003c/p\u003e\n\u003cp\u003eWeezy nodded. \"He\u0027s able to do that. It\u0027s like he has a switch that can turn off every emotion and allow him to do what has to be done without hesitation.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t have that, but I do want to get involved.\"\u003c/p\u003e\n\u003cp\u003e\"In what?\"\u003c/p\u003e\n\u003cp\u003e\"In getting in the Order\u0027s way. They\u0027ve made a mess of my life, so I\u0027d like to return the favor.\"\u003c/p\u003e\n\u003cp\u003eA part of Weezy immediately disliked this. The last time he\u0027d been proactive hadn\u0027t turned out so well.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Eddie...\"\u003c/p\u003e\n\u003cp\u003eHe leaned forward. \"Why not? You don\u0027t think I can be useful?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re maybe a little too emotionally involved.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m an actuary, Weez.\" He tapped a temple. \"A numbers guy. I can be dispassionate, especially about probabilities.\"\u003c/p\u003e\n\u003cp\u003e\"But you have no idea of the scope of what we\u0027re up against. The Order is just the tip of the tip of an unimaginable iceberg. Meanwhile, humanity, existence as we know it, is sunning itself on the decks of the Titanic.\"\u003c/p\u003e\n\u003cp\u003eHe frowned. \"\u0027Humanity\u0027 ... \u0027existence as we know it\u0027?\"\u003c/p\u003e\n\u003cp\u003eShe sensed a reflexive doubt.\u003c/p\u003e\n\u003cp\u003e\"Listen to me, Eddie: It\u0027s black.\"\u003c/p\u003e\n\u003cp\u003eHe hesitated, then nodded. \"Okay. Black. I accept that it\u0027s black because I trust you. But you never take things simply on faith, so don\u0027t expect me to. You need to educate me.\"\u003c/p\u003e\n\u003cp\u003eShe wished he could have been at the Lady\u0027s just a little while ago. Seeing that flap of skin melt into her back ... that would have been a combination education and big-time doubt eraser.\u003c/p\u003e\n\u003cp\u003eShe tapped her backpack. \"I\u0027ve got the Compendium. I\u0027m going to give you a crash course in the Conflict.\"\u003c/p\u003e\n\u003cp\u003e\"The Conflict?\"\u003c/p\u003e\n\u003cp\u003e\"With an uppercase C.\" She looked around. \"But not here. Eat up and we\u0027ll go to your apartment. We\u0027ll start with the First Age.\"\u003c/p\u003e\n\u003cp\u003eHe frowned. \"That little black pyramid you found as a kid ... you said it was from some First Age.\"\u003c/p\u003e\n\u003cp\u003e\"It was, Eddie. It\u0027s all connected. Everything is connected.\"\u003c/p\u003e\n\u003cp\u003eWait till she told him about the Otherness and the Ally and the Lady - he\u0027d grown up knowing her as Mrs. Clevenger - and all the rest. The big question: Would he be able to handle the fact that he and the rest of humanity were property? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-17.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
