{"id":111885,"no":25,"title":"Page 25","content":"\u003cp\u003eKristof stared at the man blinking up at him from the chair. He was securely taped into it. His Glock and backup pistol had been removed.\u003c/p\u003e\n\u003cp\u003eHe turned to Thompson. \"You are absolutely sure this is man who rob you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure as shit.\" He flung the man\u0027s wallet across the room. \"All his ID backs that up. John Fucking Tyleski.\" He leaned closer to the man, almost nose to nose. \"Ain\u0027t that right?\"\u003c/p\u003e\n\u003cp\u003eTyleski looked up at him. Kristof was quite sure that was not his real name, but it would do for now. They would know his real name before this night was over. He had seemed confused before but his eyes had cleared and he appeared more alert now.\u003c/p\u003e\n\u003cp\u003eHe blinked at Thompson. \"Who are you?\"\u003c/p\u003e\n\u003cp\u003e\"You know goddamn well who I am.\"\u003c/p\u003e\n\u003cp\u003e\"Never saw you before in my life.\"\u003c/p\u003e\n\u003cp\u003eThompson bared his teeth as he cocked his right fist. Kristof grabbed his arm before he could strike.\u003c/p\u003e\n\u003cp\u003e\"I do not want him knocked out again.\"\u003c/p\u003e\n\u003cp\u003e\"I owe this guy, Szeto. So do you.\"\u003c/p\u003e\n\u003cp\u003e\"I want him to talk. He cannot talk if he is unconscious.\"\u003c/p\u003e\n\u003cp\u003e\"Talk, huh? You want talk? I saw a hardware store down the block. How about I pick us up a few tools to loosen him up?\"\u003c/p\u003e\n\u003cp\u003eKristof nodded. The Order had owned this top-floor loft and the one below it since the days before the meatpacking district became trendy. Thompson had kept his distance while Dieter and Erich were dragging Tyleski up the stairs from the street. But he\u0027d gained swagger and confidence once the man was secured to the chair.\u003c/p\u003e\n\u003cp\u003eJust then Dieter and Erich returned from hiding the van.\u003c/p\u003e\n\u003cp\u003eDieter stared at Tyleski. His English carried a thick German accent. \"Kristof! I thought he looked familiar before, but now in the light, I am sure: This is the man from the park yesterday, the one who killed Claudiu and wounded Filip.\"\u003c/p\u003e\n\u003cp\u003e\"Is he now?\" Erich said with an equally heavy accent as he pulled out his pistol.\u003c/p\u003e\n\u003cp\u003eThe revelation triggered an explosion of rage within Kristof but he managed to contain it. He raised a hand and stopped Erich.\u003c/p\u003e\n\u003cp\u003e\"No. We have time for that later.\"\u003c/p\u003e\n\u003cp\u003eHe pulled his own pistol from its holster and a three-inch suppressor from a side pocket. He made a show of screwing it onto the threaded end of the barrel.\u003c/p\u003e\n\u003cp\u003e\"How much later?\" Dieter asked, looking equally itchy to inflict damage on this man.\u003c/p\u003e\n\u003cp\u003e\"After I have learned what I want to know, we shall play Last Shot Loser, the three of us - and Mister Thompson too, if he wishes.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Thompson said.\u003c/p\u003e\n\u003cp\u003e\"We take turns shooting Mister Tyleski with one bullet each.\"\u003c/p\u003e\n\u003cp\u003eThompson smiled. \"Count me in. How do I win?\"\u003c/p\u003e\n\u003cp\u003e\"By not losing. You lose by killing him. The one who fires the kill shot must pay each of the other players one thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eThompson\u0027s grin broadened. \"Oh, I\u0027m definitely in. The way I see it, even if I lose, I win.\"\u003c/p\u003e\n\u003cp\u003e\"But first, your suggestion about hardware store is excellent. Get whatever tools appeal to you, but for me ... you are familiar with something called X-Acto knife?\"\u003c/p\u003e\n\u003cp\u003e\"Course I am.\"\u003c/p\u003e\n\u003cp\u003e\"Get me one, or something quite like it.\"\u003c/p\u003e\n\u003cp\u003e\"Planning a little cosmetic surgery?\"\u003c/p\u003e\n\u003cp\u003e\"In a way. First thing I do is cut off eyelids so he must watch whatever we do to him.\"\u003c/p\u003e\n\u003cp\u003eDieter and Erich slapped palms as Thompson turned to Tyleski. \"You are soooo fucked!\"\u003c/p\u003e\n\u003cp\u003eTyleski didn\u0027t react. Szeto hadn\u0027t expected much from him. A man like this would know better than to show fear, even if he were quaking inside. And the prospect of losing his eyelids should cause deep quaking. Kristof had seen men broken by that alone. Not so much because of the pain, but because of the finality of the mutilation, the realization that even if he survived, his life was changed, horribly and forever.\u003c/p\u003e\n\u003cp\u003eThompson turned at the door. \"Hey, we forgot about Drexler. Think he might be in on - oh, shit. You think he might have hit Drexler?\"\u003c/p\u003e\n\u003cp\u003eThat had occurred to Kristof, but he hadn\u0027t had time to check on it. Not that it would be such a terrible loss. Ernst Drexler had been bypassed by the One. That meant that the High Council might decide to elevate someone else to Actuator status. And since the One was dealing directly with Kristof Szeto, who better to choose?\u003c/p\u003e\n\u003cp\u003eBut until that happened, Kristof would have to play the game.\u003c/p\u003e\n\u003cp\u003eHe pulled out his phone. \"You go,\" he told Thompson. He pointed to Dieter and Erich. \"You two wait outside.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t want them overhearing his conversation with Drexler. And he wanted a little time alone with the prisoner.\u003c/p\u003e\n\u003cp\u003eWhen the door closed behind them, he speed-dialed Drexler\u0027s number. Kristof couldn\u0027t help a stab of disappointment when he picked up on the third ring.\u003c/p\u003e\n\u003cp\u003e\"Yes, Szeto?\"\u003c/p\u003e\n\u003cp\u003e\"You are aware that man we have been looking for was seen leaving your apartment building?\"\u003c/p\u003e\n\u003cp\u003eA long pause, during which Kristof was certain that Drexler was wondering if he was being watched and whether to ask about it.\u003c/p\u003e\n\u003cp\u003eInstead he said, \"Jack from Johnson, New Jersey. Yes.\"\u003c/p\u003e\n\u003cp\u003e\"He visits you often?\"\u003c/p\u003e\n\u003cp\u003e\"Never before. He was looking for the One.\"\u003c/p\u003e\n\u003cp\u003eThat took Kristof by surprise. He glanced at the man before him. Looking for the One? Was he mad?\u003c/p\u003e\n\u003cp\u003e\"Why would he - ?\"\u003c/p\u003e\n\u003cp\u003e\"Never mind that. Did you follow him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course. He is now guest at meatpacking place. He will soon be telling us many things we wish to know.\"\u003c/p\u003e\n\u003cp\u003eAnother long pause, then, \"Don\u0027t do anything until I get there. I have a score to settle with that man.\"\u003c/p\u003e\n\u003cp\u003e\"Many have scores.\"\u003c/p\u003e\n\u003cp\u003eHe ended the call and turned to the man.\u003c/p\u003e\n\u003cp\u003e\"So ... you are called John Tyleski. Another name for John is \u0027Jack,\u0027 yes? Are you called Jack?\"\u003c/p\u003e\n\u003cp\u003eThe man said nothing, merely stared at Kristof.\u003c/p\u003e\n\u003cp\u003eKristof said, \"I am making conversation. I know answers. I know you are Jack from Johnson, New Jersey. I have come to know your hometown very well lately. I know you grew up with Louise and Edward Connell. I know you have killed many of my men.\" He lifted the man\u0027s Glock from the floor. \"Probably with this very gun.\"\u003c/p\u003e\n\u003cp\u003eHe wanted to smash the barrel across his face but held back. Men who had just recovered consciousness were too easily knocked out again. He needed him awake. Instead he leaned closer and pointed to the healing scars on his own face.\u003c/p\u003e\n\u003cp\u003e\"And even though I did not see you, Jack, I know you were one who did this to me.\"\u003c/p\u003e\n\u003cp\u003eStill no response.\u003c/p\u003e\n\u003cp\u003e\"You are looking for the One, yes? It is sure now that you will never find him, so you can tell me: Why do you look for him?\"\u003c/p\u003e\n\u003cp\u003eInstead of continuing his impassive stare, Jack seemed to consider this. Finally he shrugged.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to kill him.\"\u003c/p\u003e\n\u003cp\u003eKristof couldn\u0027t help but laugh. \"You are quite mad, you know.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t think so when he\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you want him dead?\"\u003c/p\u003e\n\u003cp\u003e\"I think you know.\"\u003c/p\u003e\n\u003cp\u003eKristof realized he had finally met someone directly related to the Enemy. Almost everything he had done for the Order was intended to weaken the Enemy, but the men and women he had run up against along the way had not been directly connected to the Enemy, merely impeding the One\u0027s ascent. Here, at last, was someone with a direct connection.\u003c/p\u003e\n\u003cp\u003e\"It is too bad you work for Enemy. You would have been strong fighter for Order.\"\u003c/p\u003e\n\u003cp\u003e\"Not much of a joiner, Mister Szeto.\"\u003c/p\u003e\n\u003cp\u003eHe knows my name, Kristof thought. How - ?\u003c/p\u003e\n\u003cp\u003eWell, of course he would.\u003c/p\u003e\n\u003cp\u003eJack said, \"My turn for a question: Why work for a guy who\u0027s going to wreck the world if he wins?\"\u003c/p\u003e\n\u003cp\u003eKristof laughed again. \"This is Enemy propaganda. \u0027The end of world as we know it.\u0027 Is like Church telling children they go to hell if they do not follow rules. When the One wins, we make rules.\"\u003c/p\u003e\n\u003cp\u003eJack shook his head. \"You\u0027re dealing with a guy who has one agenda - himself. You, Drexler, Thompson, the high-ups in your Order, you\u0027re all going to be left out in the cold with the rest of us when he changes the world to his own brand of hell.\"\u003c/p\u003e\n\u003cp\u003eKristof kept his expression impassive, not wanting this man to know that he\u0027d struck his most secret fear. Not that the world would be changed into a place of pain and terror - those were the laughable fantasies sold by the Enemy - but that he would not be elevated to a position of power. That fear had receded since the One had turned directly to him for assistance, but it had not vanished.\u003c/p\u003e\n\u003cp\u003e\"I would love to prove you wrong, but unfortunately, you will not be around to see it.\"\u003c/p\u003e\n\u003cp\u003e\"When does your master arrive?\"\u003c/p\u003e\n\u003cp\u003e\"Master?\"\u003c/p\u003e\n\u003cp\u003eKristof bristled at the comment but feigned confusion. He would so much enjoy making this man scream.\u003c/p\u003e\n\u003cp\u003e\"The man in the wonderful ice cream suit.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you must mean Drexler. No, I answer only to the One. In fact, soon I may be Drexler\u0027s master. The One comes to me now. In fact, he has engaged me for special project in your hometown. Isn\u0027t that interesting?\"\u003c/p\u003e\n\u003cp\u003eFinally a reaction from the man - surprise ... concern. \"What project?\"\u003c/p\u003e\n\u003cp\u003eJust then Kristof heard the door open. He turned and saw Drexler, wearing a long, dark herringbone overcoat over his white suit. He stepped in and closed the door behind him.\u003c/p\u003e\n\u003cp\u003e\"Well, well,\" Drexler said, smiling at Jack. \"We meet again. But this time I have the advantage.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-25.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
