{"id":111886,"no":26,"title":"Page 26","content":"\u003cp\u003eThis Washington Street hardware store was tiny but it had everything. He found an X-Acto number two knife with a long slim aluminum handle and a sharp-pointed number eleven blade.\u003c/p\u003e\n\u003cp\u003ePerfect for cutting off eyelids.\u003c/p\u003e\n\u003cp\u003eAt least Hank thought it would be perfect. He shuddered at the thought of it happening to him. Something like that would never even have occurred to him. But Szeto seemed pretty comfortable with it. Like maybe this wouldn\u0027t be his first eyelidectomy.\u003c/p\u003e\n\u003cp\u003eBe the first for Hank. He was kind of looking forward to it. He\u0027d never tortured anyone. Before becoming King of the Kickers, he\u0027d earned his daily bread alternating between a knocker and a sticker in a slaughterhouse. The former involved shooting a steel bolt into cows\u0027 heads to knock them out; the latter meant slitting the cow\u0027s throat as it hung by a back leg from an overhead rail. So blood and guts were no problem.\u003c/p\u003e\n\u003cp\u003eEspecially this guy\u0027s blood and guts. The son of a bitch had stolen his Compendium of Srem. But worse than that, he\u0027d made a fool of Hank while doing it, right out in public on the streets of New York. Nothing too bad could happen to this guy.\u003c/p\u003e\n\u003cp\u003eBut the thing was, Hank didn\u0027t want the guy to die before he told him where he\u0027d stashed the Compendium. Or if he\u0027d sold it, who to.\u003c/p\u003e\n\u003cp\u003eHe found a pair of needle-nose pliers. Might be good for yanking off fingernails. He added that to his shopping basket and moved on till he came across some Drano Kitchen Crystals. Sprinkle some of that onto lidless eyes ... oh, yeah.\u003c/p\u003e\n\u003cp\u003eHe kept shopping ... \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-26.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
