{"id":111889,"no":30,"title":"Page 30","content":"\u003cp\u003eA sharp intake of breath hissed between Gia\u0027s teeth as she parted the hair on the right side of Jack\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"Oh, Jack, your scalp\u0027s all bruised.\"\u003c/p\u003e\n\u003cp\u003eHe knew. He\u0027d felt the squishy blood under the skin there earlier. Not the first time he\u0027d been knocked cold, but the first time in years. Doc Hargus had called it a hematoma back then - not subdural, subcutaneous.\u003c/p\u003e\n\u003cp\u003eHe pressed his fingers against the area now. Odd ... no squish. The last one had lasted a week.\u003c/p\u003e\n\u003cp\u003eAnd his headache. Last time he\u0027d been knocked out his head had pounded for days.\u003c/p\u003e\n\u003cp\u003eMore proof that he was being changed in preparation for Glaeken\u0027s impending demise.\u003c/p\u003e\n\u003cp\u003eShe dabbed at the area with a cold, wet washcloth.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a little dried blood here from these little tiny scratches.\"\u003c/p\u003e\n\u003cp\u003eWhich were probably bigger an hour ago.\u003c/p\u003e\n\u003cp\u003e\"Oh, and look. Here\u0027s a teeny piece of glass.\"\u003c/p\u003e\n\u003cp\u003e\"I can shower all that away.\"\u003c/p\u003e\n\u003cp\u003e\"No, let me help.\"\u003c/p\u003e\n\u003cp\u003eNormally this kind of attention would make him claustrophobic. If she were a nurse in an ER, he\u0027d be pushing her away. But injuries, even minor ones, brought out Gia\u0027s nurturing side. With every passing year Vicky needed less and less nurturing, so she had a lot stored up.\u003c/p\u003e\n\u003cp\u003eGia never made him claustrophobic. The closer the better.\u003c/p\u003e\n\u003cp\u003e\"Two injuries in two days,\" she said as she picked at the glass. \"I hope you\u0027re not going to be making a habit of this.\"\u003c/p\u003e\n\u003cp\u003eHe smiled at her. \"If tonight ends like last night...\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t count on that. You\u0027ve got me worried now. I mean, you seem to be getting hurt lately. First your arm and now this. You never used to get hurt. Are they connected?\"\u003c/p\u003e\n\u003cp\u003e\"In a way.\"\u003c/p\u003e\n\u003cp\u003e\"What way?\"\u003c/p\u003e\n\u003cp\u003e\"Long story. All part of a bigger problem. But this particular part of the problem has been solved.\"\u003c/p\u003e\n\u003cp\u003eShe stopped dabbing at his scalp. \"Solved ... do I want to know the details?\"\u003c/p\u003e\n\u003cp\u003e\"Probably not.\"\u003c/p\u003e\n\u003cp\u003eShe sighed. \"Okay. No details. But just tell me: Is the person responsible for these injuries in a position to cause more injuries?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Good. That\u0027s enough.\" She slipped her arms around his shoulders and hugged. \"I worry about you, you know.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eHer attitude had switched a hundred and eighty degrees from last night. The arm wound had seemed old then, well on its way to healing. But this one was fresh. And he could feel her trembling inside.\u003c/p\u003e\n\u003cp\u003eStill holding him, she said, \"Don\u0027t you feel it\u0027s all unraveling?\"\u003c/p\u003e\n\u003cp\u003e\"\u0027All\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"The world.\"\u003c/p\u003e\n\u003cp\u003e\"What makes you think it was ever truly raveled?\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, unfortunately I do.\"\u003c/p\u003e\n\u003cp\u003eWas she sensing Rasalom\u0027s ascent? Ever since her coma she seemed sensitized to the Conflict. She\u0027d seen what she interpreted as a landscape of the future while she was out, and it had ended in impenetrable darkness this coming spring.\u003c/p\u003e\n\u003cp\u003eAnd spring was only weeks away.\u003c/p\u003e\n\u003cp\u003eHer hug tightened. \"I\u0027m worried.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"Not for myself, so much. I\u0027m worried for you. But most of all I\u0027m worried for Vicky. There\u0027s so much I want for her. I want her to fall in love, I want her to have a chance at motherhood, I want her to...\"\u003c/p\u003e\n\u003cp\u003e\"Live long and prosper?\"\u003c/p\u003e\n\u003cp\u003eShe laughed softly. \"Exactly, Mister Spock. Actually, that\u0027s the least of what I want for her. I want everything for her, or at least a chance at it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do my damnedest to see that she gets that chance.\"\u003c/p\u003e\n\u003cp\u003eNo more needed to be said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-30.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
