{"id":111890,"no":32,"title":"Page 32","content":"\u003cp\u003e\"Hey, I\u0027ve got an idea,\" Jack said with all the gosharooty enthusiasm he could muster as he, Weezy, and the Lady cruised south on Route 206. \"Let\u0027s sing \u0027Ninety-nine Bottles of Beer\u0027!\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d awakened early feeling pretty decent, considering what he\u0027d gone through the night before. Maybe too decent. His bruises were already fading.\u003c/p\u003e\n\u003cp\u003eHe\u0027d tried to fall back to sleep but began imagining what he would have gone through if Drexler hadn\u0027t gotten cold feet about the Change. The possibilities had made sleep impossible.\u003c/p\u003e\n\u003cp\u003eLater he\u0027d rented a Jeep Cherokee for the Jersey trip and now had the wheel. Not the cushiest ride, but this one had a high suspension that would come in handy once they hit the Pine Barrens.\u003c/p\u003e\n\u003cp\u003eHe thought about their destination, the pyramid. He still couldn\u0027t imagine how that fifteen-foot construct of standing triangles with open spaces between them - he remembered Eddie describing it as half a dozen Godzilla pizza slices standing on end - could hide anyone from anything. But real life had been leaving his imagination in the dust lately, so why not?\u003c/p\u003e\n\u003cp\u003e\"\u0027Ninety-nine Bottles of Beer\u0027!\" Weezy said with equal faux glee from the passenger seat. \"My favorite! You take the first ten verses by yourself, and then the Lady and I will sing harmony on the rest.\"\u003c/p\u003e\n\u003cp\u003e\"I do not sing,\" the Lady said from behind him.\u003c/p\u003e\n\u003cp\u003eJack wasn\u0027t sure why, but he was glad for that.\u003c/p\u003e\n\u003cp\u003e\"Neither does Weezy,\" he said.\u003c/p\u003e\n\u003cp\u003eWeezy looked offended. \"You don\u0027t know that.\"\u003c/p\u003e\n\u003cp\u003e\"You used to howl in the shower when you were staying with me.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t howl.\"\u003c/p\u003e\n\u003cp\u003e\"Caterwaul, then. Whatever it was, you can\u0027t call it singing. And \u0027Hungry Like the Wolf,\u0027 of all things. What happened to Bauhaus?\"\u003c/p\u003e\n\u003cp\u003eShe reddened. \"I had a closet crush on Simon le Bon.\"\u003c/p\u003e\n\u003cp\u003eJack checked his phone. No missed calls.\u003c/p\u003e\n\u003cp\u003e\"You keep doing that,\" Weezy said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m waiting to hear back from a couple, three charter boats I contacted.\"\u003c/p\u003e\n\u003cp\u003eEarlier he\u0027d made a few calls to fishing boats in the Coney Island area. No one had answered, so he\u0027d left messages about chartering the boat for a day trip.\u003c/p\u003e\n\u003cp\u003eWeezy nodded. \"Oh, right. Disposing of the katana. No responses?\"\u003c/p\u003e\n\u003cp\u003e\"March isn\u0027t exactly charter fishing season. Gotta be colder than hell out there.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously you left your number. We\u0027ll be back by early afternoon.\"\u003c/p\u003e\n\u003cp\u003eBack from Johnson ... he hadn\u0027t been back to Johnson since his father\u0027s funeral, and that had been - what? - a year and a half or so ago. Dad and Mom were buried side by side.\u003c/p\u003e\n\u003cp\u003eWeezy turned in her seat. \"I\u0027ve got something serious to discuss.\"\u003c/p\u003e\n\u003cp\u003eJack said, \"Uh-oh.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s about Eddie. He wants to join the fight.\"\u003c/p\u003e\n\u003cp\u003e\"Against what?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"The Order, the Otherness, whatever we\u0027re fighting.\"\u003c/p\u003e\n\u003cp\u003e\"Since when does he know about any of that?\"\u003c/p\u003e\n\u003cp\u003e\"Since yesterday when I spent half the day educating him.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s convinced?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Pretty much. It\u0027s a lot to swallow, but the Compendium is an excellent persuader.\"\u003c/p\u003e\n\u003cp\u003eJack hesitated. He didn\u0027t want to offend her. \"Don\u0027t take this wrong, but ... what\u0027s he bringing to the table?\"\u003c/p\u003e\n\u003cp\u003e\"A new way of looking at things, maybe?\"\u003c/p\u003e\n\u003cp\u003e\"Good enough.\" He couldn\u0027t see a downside. He turned to the Lady. \"Any objection?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Not at all.\"\u003c/p\u003e\n\u003cp\u003eJack had to smile. \"To tell the truth, I can\u0027t wait to see his face when we seat him at a table with Mrs. Clevenger.\"\u003c/p\u003e\n\u003cp\u003eWeezy laughed. \"That makes two of us.\"\u003c/p\u003e\n\u003cp\u003eThey passed through Tabernacle and now farms lined the highway.\u003c/p\u003e\n\u003cp\u003e\"Nothing changes much around here,\" Weezy said. \"I haven\u0027t been back in forever and it\u0027s like I never left.\"\u003c/p\u003e\n\u003cp\u003e\"Big change up ahead,\" Jack said.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"You remember the blinker at 206 and Quakerton Road?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Johnson didn\u0027t rate a full stoplight.\"\u003c/p\u003e\n\u003cp\u003e\"It does now.\"\u003c/p\u003e\n\u003cp\u003eAnd it was red when they reached it. As they waited to hang a left, Weezy pointed out the window.\u003c/p\u003e\n\u003cp\u003e\"Look. The Krauszer\u0027s is still here, and Burdett\u0027s is now an Exxon.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it is the twenty-first century.\"\u003c/p\u003e\n\u003cp\u003eJoe Burdett had kept up his Esso sign for decades after the company changed its name. What had once been Sumter\u0027s used-car lot was now a discount furniture store.\u003c/p\u003e\n\u003cp\u003eQuakerton Road split the north and south halves of Johnson and sported a couple of new stores. USED, where Jack had worked as a kid, was a mom-and-pop drugstore now. Mr. Rosen, his old boss, had died back in the 1990s. The bridge over Quaker Lake was wider but otherwise Old Town looked pretty much the same as it had when they were kids. The two-story stucco box of the Lodge remained unchanged.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s your old place,\" he said, swinging by the rickety Victorian house where the Lady had lived as Mrs. Clevenger during their childhoods.\u003c/p\u003e\n\u003cp\u003e\"It needs painting,\" she said.\u003c/p\u003e\n\u003cp\u003eWeezy stared at it as they passed. \"We all thought you were a witch.\"\u003c/p\u003e\n\u003cp\u003e\"By most standards, I was.\"\u003c/p\u003e\n\u003cp\u003e\"Wonder who lives there now.\"\u003c/p\u003e\n\u003cp\u003e\"The Meads,\" the Lady said. \"Tom and Alice, and their daughters Selena and Emily.\"\u003c/p\u003e\n\u003cp\u003e\"Can you tell where anybody is at any given time?\" Jack said. \"I mean, do you keep track of all of us?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"The noosphere is a unified consciousness. No identities there. However, when I am near enough to individuals here, I know identities. After all, they help keep me here.\"\u003c/p\u003e\n\u003cp\u003eJack noticed with a start that the lightning tree was still standing - how had it lasted so long? - and then they entered the Pine Barrens, the million-plus acres of mostly uninhabited woodland sitting in the belly of New Jersey. Jack steered onto one of the firebreak trails that crisscrossed the area. He experienced the same creepy sensation he\u0027d get when riding his bike into the trees as a kid. The forty-foot scrub pines got thicker and thicker, their crooked, scraggly branches leaning over the path as they crowded its edges. He remembered imagining them shuffling off the path ahead of him and then moving back in to close it off behind.\u003c/p\u003e\n\u003cp\u003eDumb question, but he asked Weezy anyway: \"You remember the route?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t expected that. \"Think so?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Just kidding. I remember it exactly.\" She tapped her forehead. \"The map\u0027s right here.\"\u003c/p\u003e\n\u003cp\u003eHe followed her directions on which way to turn as the firebreak trails forked left and right. The NO FISHING / NO HUNTING / NO TRAPPING / NO TRESPASSING signs posted along the way confirmed that they were on land owned by \"Old Man Foster,\" known to them now as Glaeken. But that was about all he knew for sure. He was thoroughly lost by the time she told him to stop.\u003c/p\u003e\n\u003cp\u003eHe scanned the surrounding trees, which looked pretty much like all the myriad others they\u0027d passed.\u003c/p\u003e\n\u003cp\u003e\"You sure this is the place?\"\u003c/p\u003e\n\u003cp\u003e\"You remember it as burned out. That was decades ago.\"\u003c/p\u003e\n\u003cp\u003eThe Lady had already stepped out of the car and was starting into the trees. Jack and Weezy hurried after her.\u003c/p\u003e\n\u003cp\u003e\"You know where you\u0027re going?\" Weezy said.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eYeah, well, of course.\u003c/p\u003e\n\u003cp\u003eSomewhere in all the revived undergrowth - winter bare now - lay the remnants of a burial mound he and Weezy had explored as kids. What they\u0027d found had set a whole deadly chain of events in motion. Sometimes secrets were better left secret.\u003c/p\u003e\n\u003cp\u003eThe Lady, wearing only a housedress, forged ahead, moving easily through the brush, with nothing snagging her clothing that wasn\u0027t clothing. Clouds had moved in and the temperature had dropped, but as usual she didn\u0027t appear to notice.\u003c/p\u003e\n\u003cp\u003eThen they broke into the pyramid\u0027s clearing and Jack had to stop and take it in, just as he had the first time he\u0027d seen it at age fourteen.\u003c/p\u003e\n\u003cp\u003eSix huge, elongated triangular megaliths stood in a circle, their bases buried in the sandy soil with their pointed ends jutting skyward and leaning toward each other.\u003c/p\u003e\n\u003cp\u003eGodzilla pizza slices ...\u003c/p\u003e\n\u003cp\u003eOne had broken off halfway up, but the points of the other five met at the pyramid\u0027s apex, fifteen feet above the ground.\u003c/p\u003e\n\u003cp\u003eThe Lady\u0027s new home. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-32.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
