{"id":111896,"no":39,"title":"Page 39","content":"\u003cp\u003e\"I\u0027m glad you called,\" Ernst said when he recognized Jack\u0027s voice. He meant it. \"I have uncovered some information and didn\u0027t know how to contact you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m all ears.\"\u003c/p\u003e\n\u003cp\u003e\"I proceeded in a circumspect manner, pretending to look for one thing while really looking for another.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003eImpatience was already creeping into Jack\u0027s tone. Well, too bad. Ernst\u0027s information could not be fully appreciated without the details of the quest.\u003c/p\u003e\n\u003cp\u003eHe glanced around his apartment. Hard to believe that only twenty-four hours ago Jack had invaded his home and threatened him. In the ensuing hours Ernst had become responsible for the deaths of three of his brothers in the Order and had joined forces with Jack against the One. An almost unthinkable turnaround in any length of time, but a day?\u003c/p\u003e\n\u003cp\u003eAll the One\u0027s doing, of course. He had deserted Ernst, not the other way around.\u003c/p\u003e\n\u003cp\u003e\"Do you know the name of the One\u0027s housekeeper?\"\u003c/p\u003e\n\u003cp\u003e\"Gilda.\"\u003c/p\u003e\n\u003cp\u003eErnst felt his eyebrows lift. Odd that Jack would know. Only the very upper echelons of the Order were aware of that. Well, here was something he would not know ...\u003c/p\u003e\n\u003cp\u003e\"Are you aware of her last name?\"\u003c/p\u003e\n\u003cp\u003e\"Not a clue.\"\u003c/p\u003e\n\u003cp\u003eThat was a relief, in a way.\u003c/p\u003e\n\u003cp\u003e\"The Order has supplied logistical support and personnel to the One for millennia. His current driver/assistant - \"\u003c/p\u003e\n\u003cp\u003e\"Georges.\"\u003c/p\u003e\n\u003cp\u003e\"Yes ... correct.\"\u003c/p\u003e\n\u003cp\u003eDid Jack have a source high up in the Order? His friend Edward Connell would be privy to none of this. Who then?\u003c/p\u003e\n\u003cp\u003e\"Georges is a member of the Order. When the One needed a female to deal with a certain matter - \"\u003c/p\u003e\n\u003cp\u003e\"That matter being Dawn Pickering, right? Does this train have a caboose?\"\u003c/p\u003e\n\u003cp\u003eOf course - the pregnant Pickering girl had lived in the One\u0027s house and was no doubt in touch with Jack now. She was the source.\u003c/p\u003e\n\u003cp\u003eHe felt better.\u003c/p\u003e\n\u003cp\u003e\"Since the Order does not admit female members, a relative of one of the brothers was recruited for the housekeeper position. Gilda\u0027s son\u0027s name was Kristof ... Kristof Szeto.\"\u003c/p\u003e\n\u003cp\u003e\"Ah. Like mother, like son, I gather. But so what?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I could not very well draw attention to myself by going to the High Council and inquiring directly as to the One\u0027s whereabouts. Instead I asked about Kristof Szeto\u0027s mother so that I might offer my condolences, seeing as how her son and I had such a close working relationship.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty close dying relationship too.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, well, be that as it may, I learned her location but I was instructed not to approach her. She\u0027s still being used by the One and has not been informed of her son\u0027s demise because it might distract her from her duties.\"\u003c/p\u003e\n\u003cp\u003eA short, bitter laugh. \"You guys are all heart.\"\u003c/p\u003e\n\u003cp\u003e\"Never mind that. She will be told at a later date. The important thing is that locating her is the same as locating the One.\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily. I\u0027ve been to the Nuckateague place - she\u0027s there, but he\u0027s not.\"\u003c/p\u003e\n\u003cp\u003eThe words shocked Ernst.\u003c/p\u003e\n\u003cp\u003e\"You know about Nuckateague? How can you possibly - ?\"\u003c/p\u003e\n\u003cp\u003e\"Vee haff vays.\"\u003c/p\u003e\n\u003cp\u003eIf that was supposed to be a German accent, it was terrible.\u003c/p\u003e\n\u003cp\u003eErnst felt unaccountably crushed. He thought he\u0027d been quite clever in ferreting out the location without allowing the slightest hint of what he was really looking for. And here Jack had found it without him.\u003c/p\u003e\n\u003cp\u003e\"So if he\u0027s not at the house,\" Jack said, \"where is he?\"\u003c/p\u003e\n\u003cp\u003eErnst wanted to say, You mean there is something you do not already know?\u003c/p\u003e\n\u003cp\u003e\"I do not know.\"\u003c/p\u003e\n\u003cp\u003e\"Then what good - ?\"\u003c/p\u003e\n\u003cp\u003e\"But I know where he will be.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"JFK Airport at six P.M. tomorrow evening. Georges is scheduled to pick him up then and drive him to the Nuckateague house.\"\u003c/p\u003e\n\u003cp\u003eDuring the ensuing silence Ernst thought of how fortuitous it was that the High Council required Georges and Gilda to log in regarding their duties. Gilda was apparently taking care of the Pickering baby now, while Georges had what could only be described as a cushy assignment - few duties in luxurious surroundings. With the One away - no one knew where - he quite literally had nothing to do.\u003c/p\u003e\n\u003cp\u003e\"Six o\u0027clock tomorrow night,\" Jack said. \"You\u0027re sure?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure that is what Georges told the Council. Whether or not it will change, I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Thanks.\"\u003c/p\u003e\n\u003cp\u003eAnd then he was gone. Ernst laid his phone on the table.\u003c/p\u003e\n\u003cp\u003eThanks ...\u003c/p\u003e\n\u003cp\u003eNo ... thank you ... if you succeed.\u003c/p\u003e\n\u003cp\u003eWould Jack make his move tomorrow? He seemed impatient to have this done with, but he also seemed very cautious ... a careful planner.\u003c/p\u003e\n\u003cp\u003eBut even the most carefully laid plan could go awry, usually because of the simplest little thing. Some unpredictable mishap, some unforeseeable variable completely outside the plan could change everything.\u003c/p\u003e\n\u003cp\u003eIf Jack succeeded, excellent. If he failed, Ernst would stand ready to assist the One in any way humanly possible.\u003c/p\u003e\n\u003cp\u003eYes, though he foresaw little chance of success, from the depths of his heart Ernst wished Jack luck. The best of luck. Eliminating the One would save the entire world from a terrible fate.\u003c/p\u003e\n\u003cp\u003eBut most important, it would save Ernst Drexler. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-39.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
