{"id":111904,"no":47,"title":"Page 47","content":"\u003cp\u003e\"What the hell?\"\u003c/p\u003e\n\u003cp\u003eAnxiety nibbled at Jack as he jabbed the END button and tossed the phone onto the passenger seat.\u003c/p\u003e\n\u003cp\u003eWhere was everybody? No answer from either Weezy or Dawn. Not good. Not good at all. All they had to do was sit tight in that house and watch from the window. What was so hard about that? Had the goddamn O\u0027Donnells come back from Florida and found their home invaded? What? What?\u003c/p\u003e\n\u003cp\u003eHis phone rang. He grabbed it. The display showed a number he didn\u0027t recognize. He thumbed SEND. He\u0027d take a call from anyone right now.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Jack, it\u0027s me.\" Weezy\u0027s voice. \"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"Just about to the Nuckateague turnoff. Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"In a garage in Amagansett.\"\u003c/p\u003e\n\u003cp\u003e\"What? How the hell - ?\"\u003c/p\u003e\n\u003cp\u003e\"Long story. The Jeep got towed. I can\u0027t get it back because it\u0027s rented under your name. A complete mess.\"\u003c/p\u003e\n\u003cp\u003eWell, rented under his Tyleski name. He\u0027d been ready to deep-six that identity anyway. No arguing about the mess, though. He looked ahead for a place to make a U-turn.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come get you and - \"\u003c/p\u003e\n\u003cp\u003e\"No. Check the house first. I can\u0027t get hold of Dawn.\"\u003c/p\u003e\n\u003cp\u003e\"Neither can I.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m worried.\"\u003c/p\u003e\n\u003cp\u003e\"Makes two of us. I hope she didn\u0027t do anything stupid. You were supposed to keep an eye on her.\"\u003c/p\u003e\n\u003cp\u003e\"I know, I know. But I saw the lights of the tow truck. I figured I\u0027d be right back - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m turning into Nuckateague. Stay by that phone.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll keep trying Dawn.\"\u003c/p\u003e\n\u003cp\u003eHe hit the END button and made the turn.\u003c/p\u003e\n\u003cp\u003eOkay, how to play this? His initial plan had been to find another empty garage farther down the street to hide the Crown Vic and its armamentarium. To reach that house, whichever one it was, required him to drive by the O\u0027Donnell place.\u003c/p\u003e\n\u003cp\u003eSo that was what he\u0027d do ... and hope everything was as he\u0027d left it. He shook his head as foreboding thickened around him like a fog.\u003c/p\u003e\n\u003cp\u003eFat chance.\u003c/p\u003e\n\u003cp\u003eThis was why he worked alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-47.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
