{"id":111907,"no":50,"title":"Page 50","content":"\u003cp\u003eThey had a litany going ...\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t just leave her there,\" Weezy said for what seemed like the thousandth time.\u003c/p\u003e\n\u003cp\u003eAnd each time Jack gave the same reply: \"We don\u0027t have a choice.\"\u003c/p\u003e\n\u003cp\u003eThey stood inside the door to the O\u0027Donnell house, looking out on Dawn\u0027s Volvo, collecting snow as it sat in the yard.\u003c/p\u003e\n\u003cp\u003eAfter Weezy\u0027s call from the garage, Jack had moved Dawn and Georges into the O\u0027Donnell garage, where they joined Gilda on the floor. He\u0027d arranged them along its west wall, Dawn supine, covered by a sheet from the house, the other two facedown. Then he\u0027d eased the Crown Vic in beside them - a tight fit even if the garage had been empty - and closed the damaged doors. Their hinges had been loosened and twisted a bit, and the latch was broken, but he\u0027d managed to jury-rig them so they stayed closed.\u003c/p\u003e\n\u003cp\u003eThen he\u0027d taken the Volvo and its little passenger into Amagansett to pick up Weezy. Snow had begun to accumulate on the asphalt, but the Volvo handled nicely.\u003c/p\u003e\n\u003cp\u003eHe\u0027d tensed himself during the ride, waiting for one of those screeches, but it never came. A glance in the rearview mirror showed the kid asleep. Good thing, too. He\u0027d pitched a fit when Jack had taken his mother away, screeching like the proverbial banshee. Jack hadn\u0027t known whether it was maternal attachment or removal of his snack. He\u0027d been chowing down on Dawn\u0027s blood with lip-smacking gusto. Jack had wiped the blood off the dashboard before heading for Weezy, and now realized he should have cleaned up the baby\u0027s face as well. But he\u0027d had more important things on his mind.\u003c/p\u003e\n\u003cp\u003eLike how to salvage this clusterfuck.\u003c/p\u003e\n\u003cp\u003eHe\u0027d found a snow-dappled Weezy rubbing her hands and stamping her feet in front of the empty produce stand.\u003c/p\u003e\n\u003cp\u003e\"Sorry to take so long,\" he said, turning up the heat as she got in. \"Cleanup took longer than I expected.\"\u003c/p\u003e\n\u003cp\u003eShivering, she slid into the passenger seat and held her hands over the dashboard vents.\u003c/p\u003e\n\u003cp\u003e\"\u0027S-s-s\u0027all right.\"\u003c/p\u003e\n\u003cp\u003eShe glanced at the baby in the backseat and grimaced.\u003c/p\u003e\n\u003cp\u003e\"Was I right?\" he said.\u003c/p\u003e\n\u003cp\u003e\"Not so bad.\"\u003c/p\u003e\n\u003cp\u003eShe had to be kidding. Then again, this baby belonged to Dawn, her surrogate daughter, and so maybe Weezy was seeing the child with different eyes.\u003c/p\u003e\n\u003cp\u003eShe looked at him again. \"Does he really have...?\"\u003c/p\u003e\n\u003cp\u003e\"Tentacles? I didn\u0027t check.\"\u003c/p\u003e\n\u003cp\u003eTime had been tight and he was in no great hurry to find out. Plenty of time for an anatomy check later.\u003c/p\u003e\n\u003cp\u003eShe gave him a quick rundown of seeing the tow truck flashers and running out to stop it.\u003c/p\u003e\n\u003cp\u003e\"How did anyone find it?\"\u003c/p\u003e\n\u003cp\u003e\"The guy at the garage told me it was reported to the police and the police called them to pick up an abandoned vehicle. That\u0027s all he knows.\"\u003c/p\u003e\n\u003cp\u003eJack shook his head. \"Murphy\u0027s law rules the goddamn universe.\"\u003c/p\u003e\n\u003cp\u003e\"The multiverse,\" Weezy said.\u003c/p\u003e\n\u003cp\u003eUnasked questions about Dawn layered the air within the car. Finally Weezy took a deep breath and looked at Jack.\u003c/p\u003e\n\u003cp\u003e\"Dawn ... she\u0027s really...?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eHer features twisted as tears began to roll down her cheeks. \"How?\"\u003c/p\u003e\n\u003cp\u003eJack described the scene as he\u0027d found it, then, \"The best I can come up with is somehow she got hold of the baby, Gilda came after her with a knife, wounded her, but Dawn fought back and killed Gilda. Then Georges killed Dawn.\"\u003c/p\u003e\n\u003cp\u003eWeezy buried her face in her hands. \"Oh, God. It\u0027s all my fault!\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Somehow I knew you\u0027d say that.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it is. I never should have left her.\"\u003c/p\u003e\n\u003cp\u003e\"You saw the flashers. I\u0027d have hauled ass down there too.\"\u003c/p\u003e\n\u003cp\u003e\"But if I\u0027d stayed - \"\u003c/p\u003e\n\u003cp\u003e\"This never would have happened? Okay, probably not. But just because you could have stopped her if you were there doesn\u0027t make you responsible for her bad decisions. And she made a whole series of them, one right after another: leaving the house, going to the mansion, entering the mansion, taking the baby. At any point along the way she could have made the opposite choice, but she didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe raised her head and looked at him. \"That\u0027s awfully cold.\"\u003c/p\u003e\n\u003cp\u003eYeah, it was, wasn\u0027t it. But anger was leaving him feeling pretty damn cold at the moment.\u003c/p\u003e\n\u003cp\u003e\"Sorry, but that\u0027s the way I see it.\"\u003c/p\u003e\n\u003cp\u003e\"She was a young mother, her baby had been taken from her, she wasn\u0027t thinking.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. This wasn\u0027t all about her. There\u0027s a bigger picture. We explained that. But in the end none of that mattered to her. Dawn-Dawn-Dawn - that was it.\"\u003c/p\u003e\n\u003cp\u003eWeezy was staring at him with a worried expression. \"What\u0027s happening to you?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening to me? How about what\u0027s happening to us - as in the whole world? How about she\u0027s blown this primo chance - a near-perfect setup - to stop this guy.\"\u003c/p\u003e\n\u003cp\u003e\"How can you say it\u0027s blown?\"\u003c/p\u003e\n\u003cp\u003e\"Well, Georges isn\u0027t going to be waiting at JFK to pick him up tonight. And neither Georges nor Gilda will be answering the phone - death tends to create something of an impediment to that. He\u0027s no idiot. When Georges doesn\u0027t show and he can\u0027t contact either of them, don\u0027t you think he\u0027ll suspect that maybe, just maybe something\u0027s amiss? And when he does, he\u0027ll head elsewhere. Maybe turn around and catch the next flight to Timbuktu or anywhere far from here. We\u0027re losing our last chance to stop the Change. And when the Change happens, how many deaths will be laid on Dawn\u0027s doorstep?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027ll be other chances.\"\u003c/p\u003e\n\u003cp\u003e\"Not like this one.\"\u003c/p\u003e\n\u003cp\u003eShe gestured toward the backseat. \"We have him.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, there\u0027s that - assuming the kid is crucial to his plans. If not ... then, as Abe would say, we\u0027ve got bupkes.\"\u003c/p\u003e\n\u003cp\u003eShe reached out and patted his arm. \"You can salvage this.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, really?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, really. I have faith in you.\"\u003c/p\u003e\n\u003cp\u003e\"Swell.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t tell her that he hadn\u0027t a clue as to how to accomplish that.\u003c/p\u003e\n\u003cp\u003eHe\u0027d turned into Nuckateague and sensed Weezy pulling into herself as they neared the house. Dune Drive was quiet as, well, a tomb - and would be sort of functioning as one for a while. As he approached the mansion and the O\u0027Donnell house he couldn\u0027t find a clue that all hell had broken loose here less than an hour ago.\u003c/p\u003e\n\u003cp\u003eShe\u0027d insisted on seeing Dawn\u0027s body. He\u0027d warned her it was bloody and she\u0027d suffered an ugly death, but she\u0027d insisted. And when he\u0027d pulled the sheet down, she lost it.\u003c/p\u003e\n\u003cp\u003eShe\u0027d recovered somewhat now, but was keeping up the how-can-we-leave-her-there-like-that? litany. The most rational woman he\u0027d ever known had surrendered all her critical faculties.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not thinking, Weez. Where can you take her?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but we can\u0027t just - \"\u003c/p\u003e\n\u003cp\u003eHe raised his hands. \"Please. Stop. You\u0027re talking about driving around with a dead body in your car. Not just dead - murdered. So you can\u0027t take her to a funeral home or even an ER without winding up being asked a lot of questions you do not want to answer.\"\u003c/p\u003e\n\u003cp\u003e\"But - \"\u003c/p\u003e\n\u003cp\u003e\"Think of it as cold storage.\"\u003c/p\u003e\n\u003cp\u003e\"But rats ... mice...\"\u003c/p\u003e\n\u003cp\u003eHe realized he had to give her something.\u003c/p\u003e\n\u003cp\u003e\"Okay, here\u0027s what I can do: Before I clear out, I\u0027m going to wipe this place down - everything we might have touched. After I\u0027m gone I\u0027ll call the East Hampton police and report bodies in the O\u0027Donnell garage on Dune Drive. I\u0027ll even give them Dawn\u0027s name so she can be buried with her mother.\"\u003c/p\u003e\n\u003cp\u003eWeezy thought about this for a moment, then nodded. \"Okay. I guess that\u0027s the best we can do. It means she won\u0027t be out there for long. I\u0027ll help you wipe down and - \"\u003c/p\u003e\n\u003cp\u003e\"No. You take the baby and head for the city.\"\u003c/p\u003e\n\u003cp\u003e\"The baby?\"\u003c/p\u003e\n\u003cp\u003e\"Well, yeah. You\u0027ve just become his unofficial guardian.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t know the first thing about babies.\" Her hand shot up as Jack opened his mouth. \"And please, no Butterfly McQueen references.\"\u003c/p\u003e\n\u003cp\u003eHow had she guessed? Was he that predictable?\u003c/p\u003e\n\u003cp\u003e\"You mean there\u0027s something you don\u0027t know?\"\u003c/p\u003e\n\u003cp\u003e\"I never found babies very interesting.\"\u003c/p\u003e\n\u003cp\u003e\"Better start reading up on them because you just became Aunt Weezy.\"\u003c/p\u003e\n\u003cp\u003eHer expression reflected mild panic. \"This is serious, Jack. I\u0027ve never had contact with children, especially babies, and this is no ordinary baby.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s for sure.\"\u003c/p\u003e\n\u003cp\u003e\"I mean, what does he eat? Formula? Cereal? Were they feeding him Jell-O or jelly or something?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s got red smears on his face.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, um...\" He decided not to burden her with that detail. \"I have no idea what Gilda was feeding him.\"\u003c/p\u003e\n\u003cp\u003e\"Jack, what\u0027ll I do?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the smartest person I know. You\u0027ll figure it out.\"\u003c/p\u003e\n\u003cp\u003eWeezy looked ready to cry again. Jack couldn\u0027t help it. To do what he needed to do, he needed her and the baby gone.\u003c/p\u003e\n\u003cp\u003eThey packed up Dawn\u0027s things and Weezy\u0027s things, and within half an hour she and the baby were on their way, leaving Jack at the door staring across the empty yard at the equally empty mansion on the far side of the street.\u003c/p\u003e\n\u003cp\u003eDawn had deep-sixed his original plan. Had to be another way to salvage this opportunity. He\u0027d have to improvise.\u003c/p\u003e\n\u003cp\u003eJack hated to improvise. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-50.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
