{"id":111910,"no":53,"title":"Page 53","content":"\u003cp\u003eDark had fallen extra early due to the storm. Jack debated turning on the mansion\u0027s lights. Would Rasalom be more comfortable entering a lighted house? Most definitely. Jack had done his best to leave everything looking as close as possible to the way he had found it - exactly was not an option. Would the lights increase the chances of Rasalom picking up telltale signs of his handiwork? Certainly, but only incrementally.\u003c/p\u003e\n\u003cp\u003eHe decided in favor of lights, but only a few, judiciously chosen.\u003c/p\u003e\n\u003cp\u003eHe made his final walk-through. Everything looked good. Had this been the original plan, and had he had time, he would have photographed every area before starting work, to make sure he\u0027d returned it to its original condition. This was why he hated to improvise.\u003c/p\u003e\n\u003cp\u003eHis phone rang. He checked the display: Weezy.\u003c/p\u003e\n\u003cp\u003e\"Everything okay?\"\u003c/p\u003e\n\u003cp\u003e\"Well, no. The roads are bad and getting worse, but I made it.\"\u003c/p\u003e\n\u003cp\u003e\"Then what - ?\"\u003c/p\u003e\n\u003cp\u003e\"This baby. I don\u0027t know what to do with him. How much - ?\" A screech in the background. \"Oh, God. He\u0027s awake. I gotta go.\"\u003c/p\u003e\n\u003cp\u003eThe call ended. He closed his phone and checked the display: 6:35. He pulled out Georges\u0027s and Gilda\u0027s phones. He\u0027d turned both off after sending the text messages. Now he turned on Gilda\u0027s for a quick look at the call history. Two missed calls in the past half hour, both from \"Master.\" He powered hers down again and turned on Georges\u0027s. Four calls from \"One.\" He resisted the impulse to listen to Rasalom\u0027s voice mails, which he assumed would ascend in irritation and anger as they progressed. Didn\u0027t want to risk Rasalom getting through. So he turned off that phone as well.\u003c/p\u003e\n\u003cp\u003eYes, sir ... ol\u0027 Rasalom oughta be royally pissed by now. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-53.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
