{"id":111913,"no":56,"title":"Page 56","content":"\u003cp\u003eJack blinked and rubbed his eyes.\u003c/p\u003e\n\u003cp\u003eSleepy.\u003c/p\u003e\n\u003cp\u003eConcerns, contingencies, and uncertainties about today had made for fitful slumber last night. The confinement of sitting at the watch window and waiting for the Otherness\u0027s Godot were dulling his consciousness. He couldn\u0027t afford that.\u003c/p\u003e\n\u003cp\u003eHe stood and began walking around in as wide a circle as the tiny room would allow.\u003c/p\u003e\n\u003cp\u003eConsidering what lay immediately ahead, how could his brain and body even consider sleep? He\u0027d run a dozen or more mental checks on all his setups in the mansion. He\u0027d studied the Stinger manual and had the pair set up and ready to rock. He wished he could have test fired one, but no way ... no way.\u003c/p\u003e\n\u003cp\u003eNothing left to do but wait ... and watch the snow pile up ... and know that each inch of accumulation further increased the odds of a no-show by Rasalom.\u003c/p\u003e\n\u003cp\u003eHe might have decided to stay in town and wait out the storm. Or he might have become spooked and lit out for parts unknown.\u003c/p\u003e\n\u003cp\u003eAnd then what? Jack had three bodies in the garage and his car could be snowed in by the time it became certain Rasalom wasn\u0027t coming tonight. How long did he wait before aborting? A day? Two?\u003c/p\u003e\n\u003cp\u003eDamn. He felt like kicking a hole or two in these walls. Maybe three or four. But it wasn\u0027t the O\u0027Donnells\u0027 fault. He -\u003c/p\u003e\n\u003cp\u003eA glow outside.\u003c/p\u003e\n\u003cp\u003eHe leaped to the window and saw headlights working their way down Dune Drive. He watched as they passed the spot where he\u0027d planned to set up the shaped charges. A click of his remote and kaboom! - game over for the R-man.\u003c/p\u003e\n\u003cp\u003eSame for the hapless bastard driving him.\u003c/p\u003e\n\u003cp\u003eJack suddenly wished he\u0027d set the charges as planned - and let the chips fall where they may. That was Rasalom out there. Nothing was more important than stopping him, and as for anyone who happened to wander into the line of fire ... sorry, Charlie. A little collateral damage was a small price to pay for -\u003c/p\u003e\n\u003cp\u003eWhoa! Where\u0027d all this come from?\u003c/p\u003e\n\u003cp\u003eHe pushed back against the alien homicidal regrets and concentrated on the here and now.\u003c/p\u003e\n\u003cp\u003eHe found the field glasses and focused them on the car as it pulled into the mansion\u0027s front yard. Looked like a late model Lincoln Town Car. Typical rental limo. The driver got out and opened the rear door, then hurried to the trunk where he removed a suitcase. As he lugged it through the snow to the front door, another man slid from the rear of the car. Jack trained the glasses on the second\u0027s head as he passed in front of the headlights on his way to the house.\u003c/p\u003e\n\u003cp\u003eHe felt his lips pull back from his teeth when he recognized the face.\u003c/p\u003e\n\u003cp\u003eRasalom.\u003c/p\u003e\n\u003cp\u003eThe One.\u003c/p\u003e\n\u003cp\u003eGodot.\u003c/p\u003e\n\u003cp\u003eHe hurried downstairs to where a number of remotes sat on the coffee table next to the M-79 thumper. He picked out the one labeled FRONT DOOR and held it ready.\u003c/p\u003e\n\u003cp\u003eHe\u0027d rigged the front door with a tripwire. He\u0027d wanted to position one of the shaped charges six feet inside the door, set to go off when the door was opened. The blast would pretty much vaporize whoever had his hand on the knob. Trouble was, Jack didn\u0027t know who would step through, so he\u0027d scrapped that plan.\u003c/p\u003e\n\u003cp\u003eGood thing too as he watched the driver push open the door and set the bag inside. He waved to his passenger and scooted back to the warmth of his car. No money exchanged hands. Probably a prepaid fare.\u003c/p\u003e\n\u003cp\u003eAs Rasalom entered and closed the door behind him, Jack pressed the remote. The door\u0027s tripwire was now armed for a different kind of surprise. Same with the back door.\u003c/p\u003e\n\u003cp\u003eA welcome-home gift for the One.\u003c/p\u003e\n\u003cp\u003eSoon to be the None. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-56.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
