{"id":111924,"no":68,"title":"Page 68","content":"\u003cp\u003eWith the cow\u0027s help, Rasalom had struggled his way to the couch. She\u0027d draped it with a sheet - the first step toward making him a bed, she promised - and he now sat upon it, wrapped in a blanket.\u003c/p\u003e\n\u003cp\u003eThe effort had exhausted him. He hadn\u0027t felt this weak since Glaeken had trapped him in that wretched little castle in Romania. His lids felt heavy, and kept drifting closed, but he forced them open to concentrate on the television on the far side of the small room.\u003c/p\u003e\n\u003cp\u003eThe woman had a satellite feed; she\u0027d turned it on first thing this morning and left it running. He had a feeling she kept it on all day. Her only company besides her dog. Rasalom would have ignored it except the channel was updating what it called \"the nightmare in Nuckateague.\" The mention of a triple murder associated with the \"blitzkrieg assault\" on the mansion had galvanized his attention.\u003c/p\u003e\n\u003cp\u003eTriple murder?\u003c/p\u003e\n\u003cp\u003eHe assumed two of the dead to be Georges and Gilda, but who was the third? And then it struck him - the baby.\u003c/p\u003e\n\u003cp\u003eOh, no ... not the baby.\u003c/p\u003e\n\u003cp\u003eDespairing, he listened carefully, but the identities of the dead were being withheld pending notification of their families.\u003c/p\u003e\n\u003cp\u003eHe had to get off this island ...\u003c/p\u003e\n\u003cp\u003eThen again, what was the hurry? With the baby gone, he\u0027d have to come up with a new plan.\u003c/p\u003e\n\u003cp\u003eAnother concern arose: Did Glaeken know he had survived? The Glaeken of old could sense his presence in the world, just as Rasalom could always sense his. Had he lost that ability along with his immortality? If not, he knew that his scheme had failed. He might try another strike to finish the job. Rasalom\u0027s weakness and injuries left him painfully vulnerable out here.\u003c/p\u003e\n\u003cp\u003eHe lifted the blanket and examined his naked body. The burns were still oozing, and that concerned him. Certainly his skin was further along in the healing process than an everyday human\u0027s, but he felt he should be doing better. The injuries had seriously weakened him.\u003c/p\u003e\n\u003cp\u003eHe raised his left arm and stared at the stump of his wrist. More than weakened: maimed and mutilated. He could recover from the weakness, he could heal his wounds, but his left hand was gone forever.\u003c/p\u003e\n\u003cp\u003eWho did this to him?\u003c/p\u003e\n\u003cp\u003eGlaeken? Not personally, that was certain. Too old and feeble. How he had reveled in seeing him like that. He had not expected so bold a move - had not expected any move.\u003c/p\u003e\n\u003cp\u003eKilling Georges and Gilda and the baby ... that was not like the old Glaeken. Rasalom had used his concern for \"innocent\" lives against him countless times. Perhaps the mortal Glaeken, with his clock winding down, had realized, like Rasalom, that no one was innocent.\u003c/p\u003e\n\u003cp\u003eAnd no one was supposed to know about the Nuckateague house. How had Glaeken found out? Did he have a source in the Order? That was the only answer. But who?\u003c/p\u003e\n\u003cp\u003eHis Heir must have led the attack. An impressive assault, Rasalom had to admit. Only by the sheerest good fortune had he survived. If not for the presence of this island, if not for the wind and current that carried him here, he would have drowned. And even then, had it not been inhabited, he would have frozen solid on the beach out there.\u003c/p\u003e\n\u003cp\u003eThe island\u0027s sole inhabitant, the cow, Sadie, bustled in carrying a plate and a glass of milk.\u003c/p\u003e\n\u003cp\u003e\"Brunch! More like a real breakfast - bacon and fried eggs - but since it\u0027s after twelve we\u0027re going to call it brunch.\"\u003c/p\u003e\n\u003cp\u003eThe communal \"we\" again.\u003c/p\u003e\n\u003cp\u003e\"And since you\u0027ve only got one hand, I put it between bread. So you\u0027ve got a breakfast sandwich and some milk. Now, you may be saying to yourself, I want coffee, and maybe we\u0027ll get you some later, but right now you need nourishment to get your strength back and milk\u0027s got a lot more nourishment than coffee.\"\u003c/p\u003e\n\u003cp\u003eThe chatter, the incessant chatter. Did she never tire of prattle?\u003c/p\u003e\n\u003cp\u003eShe placed the plate and the glass on the table next to the couch and moved on to the window.\u003c/p\u003e\n\u003cp\u003e\"Looks like the storm\u0027s finally giving up the ghost. About time, I say. About time.\" She turned and looked at him. \"The phone should be working now. Time to get you some medical help.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" he said. His voice was stronger now, but still raspy.\u003c/p\u003e\n\u003cp\u003e\"You keep saying that, but you\u0027re not thinking straight. Those burns are going to get infected for sure and then you\u0027re going to be one sick puppy.\"\u003c/p\u003e\n\u003cp\u003eInfection was the least of his worries - his immune system would not allow it. But discovery ... how was he going to stop her?\u003c/p\u003e\n\u003cp\u003ePerhaps the truth ...\u003c/p\u003e\n\u003cp\u003e\"You have been watching the television?\"\u003c/p\u003e\n\u003cp\u003e\"On and off. You\u0027ve occupied a lot of my attention.\"\u003c/p\u003e\n\u003cp\u003e\"You saw the fire in Nuckateague?\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened. \"I surely did! Did you see what someone did to that house? I declare I\u0027ve never seen anything like that in all my born...\" Her voice trailed off as she stared at him. \"You\u0027re not going to tell me...?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eHer hand flew to her mouth. \"Oh, dear God!\"\u003c/p\u003e\n\u003cp\u003eHe faked a sob. \"They killed my family and were going to kill me but I managed to escape - though, as you can see ... just barely.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you poor man! Who were they?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" He had to improvise now ... something lurid yet plausible. \"Home invaders. I am a wealthy man. They thought I had a house full of valuables. They cut off my hand trying to get me to tell them where I had hidden all these supposed valuables. They did not want to hear the truth - that it was all in the city in a bank vault. When they finally were convinced, they became enraged and went on a murder rampage - my brother, my wife, and my baby boy.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, dear God!\"\u003c/p\u003e\n\u003cp\u003eThat would cover him should they identify the bodies.\u003c/p\u003e\n\u003cp\u003e\"Then they left me for dead and blew up the house to destroy all evidence.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you poor man!\"\u003c/p\u003e\n\u003cp\u003e\"That is why you cannot call for medical help. They believe I am dead and must go on believing that. I\u0027ll reward you well - \"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need money. Got plenty of that. But it sounds like I should be calling the police instead of emergency services.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t want to endanger you. If they learn I\u0027m alive they might try to finish what they began. They will kill you too. They are merciless. You must keep my presence secret until I\u0027m well enough to go to the police and ask for protective custody. Do you understand?\"\u003c/p\u003e\n\u003cp\u003eShe was nodding vigorously. \"Yes. Yes, of course. When you\u0027re well enough, we\u0027ll put you aboard the boat and - \"\u003c/p\u003e\n\u003cp\u003e\"Boat?\"\u003c/p\u003e\n\u003cp\u003e\"The weekly boat out of Sag Harbor. How do you suppose I get mail and food and such? The boat stops every Tuesday. I\u0027ll just tell them you\u0027re a relative who\u0027s been staying here, recovering from some terrible accident. You can ride back to Sag Harbor and get in touch with the police there.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. You are very kind.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the least I can do after the terrible ordeal you\u0027ve been through. I\u0027ll help you any way I can to get through this.\"\u003c/p\u003e\n\u003cp\u003eHow easily gulled were these cattle. Especially the cows. Ruled by their emotions. Tell them a sad story and they were at your service.\u003c/p\u003e\n\u003cp\u003e\"Now eat up.\" She took the sandwich plate and placed it in his lap. \"Whether you\u0027re hungry or not, you need your strength.\"\u003c/p\u003e\n\u003cp\u003eYes, that was true. But he was in no hurry to leave. Glaeken might or might not be aware of his survival. Even if so, he would not be able to pinpoint his location. Better to stay here until he was stronger - strong enough to transport himself from this lump of rock.\u003c/p\u003e\n\u003cp\u003eThat would certainly not be by Tuesday. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-68.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
