{"id":111931,"no":76,"title":"Page 76","content":"\u003cp\u003e\"How much farther, do you think?\" Eddie said, panting.\u003c/p\u003e\n\u003cp\u003eJack and Eddie were both in the hole, digging their way east along the dirt-filled subterranean corridor. They\u0027d fill buckets with the excavated dirt, which Weezy would pull up on ropes and dump into the basement.\u003c/p\u003e\n\u003cp\u003eJack had driven down to Spurlin\u0027s Hardware and bought shovels, an aluminum ladder, lanterns, and the rest of the equipment. Then he\u0027d picked up sandwiches and drinks at the Krauszer\u0027s down on 206.\u003c/p\u003e\n\u003cp\u003e\"We should be getting close,\" Jack said. He looked back and up toward the hole in their ceiling and basement\u0027s floor. \"What do you think, Weez?\"\u003c/p\u003e\n\u003cp\u003eHer face appeared in the opening. \"If memory serves - \"\u003c/p\u003e\n\u003cp\u003e\"And it usually does,\" Jack said.\u003c/p\u003e\n\u003cp\u003e\" - you should have just a few more feet to go. If...\" She hesitated.\u003c/p\u003e\n\u003cp\u003e\"If what?\"\u003c/p\u003e\n\u003cp\u003e\"If the flood didn\u0027t wash it deeper into the passage.\"\u003c/p\u003e\n\u003cp\u003eJack remembered the force of the water as it had surged against him back when they were teens. Quaker Lake lay to the west, just beyond the other end of the passage. That September, swollen by record September rains, it had broken into the passage, flooding it and nearly drowning Jack.\u003c/p\u003e\n\u003cp\u003e\"If it moved even ten feet, we\u0027re sunk. We\u0027re going to have to find Tommy and company and pay them ourselves. No way the three of us can dig that far.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have the authority to do that,\" Eddie said. \"This Szeto guy must have cleared it with the Council first. No way they\u0027re going to clear it for us.\"\u003c/p\u003e\n\u003cp\u003e\"Who says they have to know? We can - \"\u003c/p\u003e\n\u003cp\u003e\"Hey, guys!\" Weezy said in a hushed voice. \"Quiet for just a minute.\"\u003c/p\u003e\n\u003cp\u003eJack glanced at Eddie and they shut up. Finally Jack said, \"What\u0027s up, Weez?\"\u003c/p\u003e\n\u003cp\u003eHer voice filtered from above. \"I swear I heard someone upstairs.\"\u003c/p\u003e\n\u003cp\u003eJack didn\u0027t like that. He climbed the ladder and retrieved his Glock from his jacket pocket.\u003c/p\u003e\n\u003cp\u003e\"Maybe Tommy came back,\" he said as he led the way upstairs.\u003c/p\u003e\n\u003cp\u003eBoth the front and rear doors were locked, which meant nothing if someone had a key. But it had begun to rain about an hour ago and the floors inside the doors showed no trace of moisture.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure?\" Jack said.\u003c/p\u003e\n\u003cp\u003eWeezy shrugged. \"I\u0027m not saying I heard someone, but I know I heard something. Maybe just the building settling.\"\u003c/p\u003e\n\u003cp\u003e\"I think it would have pretty much settled by now,\" Eddie said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s got part of a buried town beneath it, so who says it will ever be fully settled?\"\u003c/p\u003e\n\u003cp\u003eEddie nodded. \"Point to you.\"\u003c/p\u003e\n\u003cp\u003e\"Just to be sure, I\u0027m going to take a room-to-room look-see. Anyone want to come along?\" Jack said.\u003c/p\u003e\n\u003cp\u003eThey both volunteered.\u003c/p\u003e\n\u003cp\u003eThe first floor was easy - only the kitchen, the conference room, the front room, and a few closets. All empty.\u003c/p\u003e\n\u003cp\u003eA different story upstairs: lots of small rooms - almost like a dorm - and crammed with the furniture that had once filled the basement. Took longer, but same result: empty.\u003c/p\u003e\n\u003cp\u003e\"All clear,\" Jack said. \"Back to digging?\"\u003c/p\u003e\n\u003cp\u003eEddie shook his head. \"I\u0027ve got to tell you, I thought I was in shape, but I\u0027m bushed.\"\u003c/p\u003e\n\u003cp\u003eWeezy laughed. \"I know I\u0027m not in shape, so imagine how I feel.\"\u003c/p\u003e\n\u003cp\u003eWell, the hour was late, and Jack had to admit he was feeling a little sore himself. Working out wasn\u0027t the same as working.\u003c/p\u003e\n\u003cp\u003e\"Okay, let\u0027s knock off and see if we can find a motel and crash for the night.\"\u003c/p\u003e\n\u003cp\u003e\"And risk not being able to get back in?\" Weezy said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll get back in.\"\u003c/p\u003e\n\u003cp\u003eShe gestured around them. \"Why don\u0027t we stay here? Heat, electricity, running water, lots of rooms, no linens, but we\u0027ve got mattresses.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Eddie said.\u003c/p\u003e\n\u003cp\u003e\"Come on. It\u0027ll be fun. Where else can we stay? The Lonely Pine Motel? These mattresses here are ancient but I bet they\u0027re better than the ones at the Lonely Pine.\"\u003c/p\u003e\n\u003cp\u003eJack said, \"I can\u0027t do anything in the morning without coffee.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll run down to Krauszer\u0027s for you. Come on. I\u0027ve got an alarm on my phone. I\u0027ll set it for an early start in the morning.\"\u003c/p\u003e\n\u003cp\u003eWell, why not? They were already trespassers. Might as well become squatters too.\u003c/p\u003e\n\u003cp\u003e\"As long as I get my coffee.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-76.html","bookId":2554,"creation":"Oct 6, 2019 12:43:53 AM","modification":"Oct 6, 2019 12:43:53 AM"}
