{"id":82590,"no":117,"title":"Page 117","content":"\u003cp\u003eWhitney drew a tortured breath, knowing that if he saw her fear now he would use it against her. \"The purpose of my visit?\" she said in a small, distracted voice, her mind frantically counting off the passing seconds. \"I-! would have thought by now it was obvious.\"\u003c/p\u003e\n\u003cp\u003e\"It is not obvious!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve come to-to explain why I said what I did to you at the banquet. You see,\" she said, stammering in her haste to finish in the minutes he\u0027d allotted her, \"earlier at the church, I thought we-you and I-still had an agreement, and-\"\u003c/p\u003e\n\u003cp\u003eClayton\u0027s eyes raked contemptuously over her. \"We have no agreement,\" he said scathingly. \"It\u0027s over. Done with. It should never have begun! The betrothal was an insane idea, and I curse the day I thought of it.\"\u003c/p\u003e\n\u003cp\u003eSick with failure and defeat, Whitney dug her nails into the flesh of her palms and shook her head in denial. \"It never had a chance to begin because I wouldn\u0027t let it.\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"Your two minutes are almost up.\"\u003c/p\u003e\n\u003cp\u003e\"Clayton, please listen to me!\" she cried desperately \"You-you told me a long time ago that you wanted me to come to you willingly, that you didn\u0027t want a cold, unwilling wife.\"\u003c/p\u003e\n\u003cp\u003e\"And?\" he demanded furiously.\u003c/p\u003e\n\u003cp\u003eWhitney\u0027s voice shook. \"And, I am here. Willingly.\"\u003c/p\u003e\n\u003cp\u003eClayton stiffened, his whole body tensing into a rigid line as her meaning pierced the armor of his wrath. He stared at her for a moment, his jaw tight and hard, then he leaned back against the mantel and closed his eyes.\u003c/p\u003e\n\u003cp\u003eHe was fighting her, Whitney knew. Trying to shut her out. In a paralysis of fear, she waited, watching him. It seemed an eternity before he reluctantly straightened. His eyes nicked open, meeting hers, and Whitney\u0027s heart gave a wild leap. She had won! She could see it in the slight softening of his rugged features. Oh God, she had won!\u003c/p\u003e\n\u003cp\u003eHe looked first at the long stretch of carpet separating them, and then at her. When he spoke, the harsh edge of his voice was tempered, but his words were low and meaningful. \"I\u0027ll not make this any easier for you,\" he told her evenly.\u003c/p\u003e\n\u003cp\u003eThe distance between them stretched like a mile, and Whitney knew that he meant she would have to make the trip across the room to him if she wanted him, that he would not so much as meet her halfway . . . because, even now, he didn\u0027t entirely trust her.\u003c/p\u003e\n\u003cp\u003eHis eyes never left hers as Whitney started walking toward him on legs that felt like water. A mere step away from him, she had to pause to still the slamming of her heart and quaking of her knees. She took the final step on legs that feit as if they were about to buckle beneath her, and stopped so close to him that her breasts were only inches from his gray jacket.\u003c/p\u003e\n\u003cp\u003eWith her head bowed, she waited, but the seconds ticked by, and Clayton made no move to touch her. Finally she lifted her head and raised green eyes shining with surrender to his.\u003c/p\u003e\n\u003cp\u003e\"Would you please,\" she whispered achingly, \"hold me now?\"\u003c/p\u003e\n\u003cp\u003eClayton started to reach for her and stopped . . . and then he caught her arms and jerked her to Mm, crushing her against his chest as his mouth came down hungrily on hers. With a smothered moan of joy, Whitney returned his kiss, glorying in the feel of his lips locked fiercely to hers.\u003c/p\u003e\n\u003cp\u003eTwining her arms around his neck, she pressed against him, fitting her melting body to the hardening contours of his. A shudder shook him as she leaned into him, and his hands tightened possessively on her back and hips, molding her closer to him, sliding up her spine, then lower, gathering her willing body into his. \"God, how I\u0027ve missed you!\" he whispered hoarsely against her lips, and he deepened the kiss. At the first tentative touch of his tongue, Whitney\u0027s lips parted without further urging, and Clayton groaned, clasping her tighter as his tongue plunged into her sweet softness, searching with an almost desperate urgency, taking what she was offering.\u003c/p\u003e\n\u003cp\u003eThe exquisite feeling of her in his arms, the taste of her lips dinging to his, the fullness of her breasts against his palms, was unbearable joy to Clayton. He couldn\u0027t go on, and he was afraid to stop . . . afraid that if he broke the contact, she would vanish, and the aching desire racking him would become an aching emptiness instead.\u003c/p\u003e\n\u003cp\u003eWhen he finally tore his mouth from hers, he kept his arms around her, resting his chin atop her shining head, waiting for his breathing to even out. And Whitney stayed there-as if being in his arms were the only place in the world she wished to be.\u003c/p\u003e\n\u003cp\u003eDrawing back slightly, Clayton looked down into the limpid pools of her eyes and quietly asked, \"Are you willing to marry me?\"\u003c/p\u003e\n\u003cp\u003eWhitney nodded. She nodded, because she could not speak.\u003c/p\u003e\n\u003cp\u003e\"Why?\" he persisted evenly. \"Why do you want to marry me?\" From the moment he had made her cross the room to him, rather than meeting her halfway, Whitney had known Clay-ton was going to require an unconditional surrender from her; she knew what he was demanding of her now. Through joy and tears and relief constricting her breath, she found her voice and softly said, \"Because I love you.\"\u003c/p\u003e\n\u003cp\u003eHis arms closed around her with stunning force. \"God help you if you don\u0027t mean it!\" he warned fiercely, \"because I\u0027ll never let you go again.\"\u003c/p\u003e\n\u003cp\u003eShamelessly yearning to be kissed, Whitney whispered, \"I shall be very happy to prove I do mean it.\" She saw his eyes darken with passion as he bent his head to her, and she leaned up on her toes to prove it. She kissed him with all the aching longing that being this close to him evoked; she kissed him in all the ways he had ever kissed her, feeling faint with joy when he began to kiss her back, his mouth moving with fierce tenderness, then opening with fiery demand over hers, until their breaths were mingled gasps, and they were straining to one another.\u003c/p\u003e\n\u003cp\u003eIt was Clayton who broke the kiss and forced his hands to stop their exploration, the pleasure-torture of caressing the cherished curves and hollows of the slender, voluptuous body that had haunted his dreams. But he kept her in his arms, tangling his hand in her heavy hair, loving the familiar texture. of it. \"Why did you make me wait so long?\" he breathed.\u003c/p\u003e\n\u003cp\u003eLeaning back, Whitney tipped her head in the direction of the dining room where Vanessa was. \"Why couldn\u0027t you have waited a little longer?\"\u003c/p\u003e\n\u003cp\u003e\"Little one,\" he chuckled tenderly, \"you are the only female alive who would bring up Vanessa at a time like this.\"\u003c/p\u003e\n\u003cp\u003eWhitney\u0027s expression suddenly turned solemn, and Clayton didn\u0027t see the smile that glowed in her eyes as she said, \"I have a confession-and it may make a difference in which of us you decide upon.\"\u003c/p\u003e\n\u003cp\u003eClayton stiffened. \"And that is?\"\u003c/p\u003e\n\u003cp\u003e\"I told your mother the truth about my talent at the pianoforte.\"\u003c/p\u003e\n\u003cp\u003eWith a laughing sigh of relief, Clayton drew her close. \"Can you sing any better?\" he teased. \u003c/p\u003e","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-117.html","bookId":1804,"creation":"Oct 5, 2019 4:45:29 PM","modification":"Oct 5, 2019 4:45:29 PM"}
