{"id":82599,"no":126,"title":"Page 126","content":"\u003cp\u003e\"What is it that you wanted to ask of me?\" Clayton said, but he already knew-God help him, he already knew.\u003c/p\u003e\n\u003cp\u003e\"I was wondering if you might agree to wait,\" she explained miserably. \"I mean, agree not to do that to me on our wedding night.\" Unable to meet his steady gaze any longer, Whitney looked away in sheer embarrassment. Uninformed she might be about some things, but she knew full well that wives made no such bargains with husbands, and that marriages were consummated on the wedding night. Why, in days gone by, a marriage was consummated with observers in the room, in the old-and thank heavens, antiquated-custom of \"bedding\" the newly wedded couple. A wife\u0027s duty, her vows, required that she submit to her husband in all things, and that included satisfying his passion.\u003c/p\u003e\n\u003cp\u003e\"Are you absolutely certain this is the way you want it?\" Clayton asked after a long silence.\u003c/p\u003e\n\u003cp\u003e\"Positive,\" Whitney whispered, her eyes downcast.\u003c/p\u003e\n\u003cp\u003e\"What if I refuse to agree?\"\u003c/p\u003e\n\u003cp\u003eStaring at her hands, Whitney swallowed. \"Then I\u0027ll submit to you.\"\u003c/p\u003e\n\u003cp\u003e\"Submit to me?\" Clayton repeated, stunned and a little irritated by her choice of words. He could hardly believe that after eight weeks, Whitney still thought of the final culmination of their desires as some form of punishment to which she must \"submit.\" She always came eagerly into his arms, returning his kisses with a fervor and hunger that almost matched his. And whenever he held her, she instinctively fitted her voluptuous body to the contours of his. What in the living hell did she imagine he was going to do on their wedding night-turn into a crazed animal and tear her clothes off again? \"Is it me you\u0027re afraid of, little one?\" he asked quietly.\u003c/p\u003e\n\u003cp\u003eHer gaze flew to his and her response was emphatic. \"No! I couldn\u0027t bear it if you thought that. I know you aren\u0027t going to-to treat me the way you did before. It\u0027s just that I feel embarrassed, because I know exactly what you are going to do to me. And there\u0027s something else too-something terrible that I should have told you weeks ago. Clayton, I think I am malformed in some way. You see, it-what you did to me that night-hurt dreadfully. And I don\u0027t think other females feel such pain or . . .\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" Clayton interrupted harshly, unable to bear hearing how badly he had hurt her. With an inward sigh, he accepted this as the penalty he was going to have to pay for his callous cruelty that night. And in view of what he had actually done to her, it seemed a small price, at that. \"I will give you my word to wait, on two conditions,\" he told her quietly. \"The first is that, after our wedding night, the option of choosing the time is mine.\"\u003c/p\u003e\n\u003cp\u003eShe nodded so eagerly and looked so relieved that Clayton almost smiled.\u003c/p\u003e\n\u003cp\u003e\"The second condition is that you promise that during the next few days you will seriously consider what I am about to say.\"\u003c/p\u003e\n\u003cp\u003eAgain she nodded.\u003c/p\u003e\n\u003cp\u003e\"Whitney, what occurred between us before was nothing more than an act of outrage on my part; it was not \u0027making love,\u0027 it was an act of selfish revenge.\"\u003c/p\u003e\n\u003cp\u003eShe was listening, and Clayton realized she was trying to understand, but to her at this point, an act was an act, and if it was painful and humiliating before, it would be again. \"Come here,\" he said gently. \"I can explain better with a small demonstration.\"\u003c/p\u003e\n\u003cp\u003eApprehension flitted across her face, but she obediently crossed to sit beside him. Clayton tipped her chin up and kissed her deeply and tenderly. Her response was longer than usual in coming, but when it did, it was exquisitely warm and filled with love. \"Do you remember the first time I ever kissed you, on the balcony at Lady Eubank\u0027s house?\" he asked, drawing back and searching her eyes. \"I was punishing you for trying to use me to make Sevarin jealous-remember?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I slapped you,\" she recalled with a smile\u003c/p\u003e\n\u003cp\u003e\"Do you feel like slapping me now? Do you feel in any way the same about this kiss as you did that first one?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then believe me when I tell you that what will happen between us the next time I take you to my bed will be as different from before, as this kiss is from that first one.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she said with a beaming smile of relief.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t believe him for a minute, Clayton knew. But she was overjoyed with her \"wedding night reprieve.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirty-three\u003c/p\u003e\n\u003cp\u003eAT THE FIRST LIGHT OF DAWN, WHITNEY CLIMBED FROM BENEATH the cool sheets, groped for her dressing robe in the dark, then settled into a chair at the windows to watch the sun rise over London on her wedding day. She bent her head and tried to pray. But all her prayers began with \"Thank you\" instead of \"Please.\"\u003c/p\u003e\n\u003cp\u003eShe heard the house slowly stirring to life, the sound of servants moving about the halls, of footsteps passing her door. The wedding was not to begin until three o\u0027clock, and that seemed tike an eternity from now.\u003c/p\u003e\n\u003cp\u003eFor hours, time scarcely seemed to move, and then, just after noon, time leapt forward, picking up extraordinary speed. People scurried in and out of her bedroom, while Aunt Anne sat perched upon the bed, watching Clarissa brush Whitney\u0027s thick mahogany tresses until they shone. Emily came into the room wearing a dressing robe, ready to slip into her gown, and Elizabeth was right on her heels. \"Hello,\" Whitney said in a quiet, joyous voice.\u003c/p\u003e\n\u003cp\u003e\"Nervous or just not talkative?\" Emily teased gaily.\u003c/p\u003e\n\u003cp\u003e\"Neither. Just happy.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you the tiniest bit nervous?\" Elizabeth persevered hopefully, darting a conspiratorial wink at Emily and Whitney\u0027s aunt. \"I hope his grace hasn\u0027t changed his mind.\"\u003c/p\u003e\n\u003cp\u003e\"He hasn\u0027t.\" Whitney assured her with perfect serenity.\u003c/p\u003e\n\u003cp\u003e\"Well!\" Clayton\u0027s mother laughed, coming into the room, \"I can see things are not much different here than they are in Upper Brook Street this afternoon. Stephen is driving Clay-ton to the brink of madness.\"\u003c/p\u003e\n\u003cp\u003e\"Is Clayton nervous?\" Whitney asked incredulously.\u003c/p\u003e\n\u003cp\u003e\"Beyond belief!\" her grace said, smiling and sitting down beside Anne Gilbert on the bed.\u003c/p\u003e\n\u003cp\u003e\"Why?\" Whitney asked in alarm.\u003c/p\u003e\n\u003cp\u003e\"Why? There are at least a dozen reasons why, and all of them are either directly or indirectly related to Stephen. At ten o\u0027clock this morning, Stephen arrived at the house and told Clayton that as he passed here, two travelling chaises were being loaded and that he was quite, quite certain he saw you getting into one of them. Clayton was already bounding down the stairs to come after you before Stephen shouted that he was joking.\"\u003c/p\u003e\n\u003cp\u003eWhitney smothered a laugh and the duchess said, \"You may find that amusing, my dear, but Clayton did not. After that, Stephen convincingly reported that he had discovered a nonexistent plot among the groomsmen to kidnap Clayton and delay his arrival at the wedding. Which is why all twelve of the groomsmen are now cooling their heels under Clay-ton\u0027s watchful eye at his house. And that is only the beginning.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-126.html","bookId":1804,"creation":"Oct 5, 2019 4:45:29 PM","modification":"Oct 5, 2019 4:45:29 PM"}
