{"id":97864,"no":13,"title":"Page 13","content":"\u003cp\u003e“Vicky!” I screech, eyes wide.\u003c/p\u003e\n\u003cp\u003eI can’t believe she just said that.\u003c/p\u003e\n\u003cp\u003e“What?” she says innocently. “I’m merely pointing out the conclusive facts.”\u003c/p\u003e\n\u003cp\u003e“Which conclusive facts?”\u003c/p\u003e\n\u003cp\u003e“That Jake wants to have sex with you.”\u003c/p\u003e\n\u003cp\u003e“Will you stop saying that!” My face is flushing bright red. “And Jake could have sex with anyone he wants and trust me he wouldn’t want to have it with me.”\u003c/p\u003e\n\u003cp\u003eI think of the little brush off at my door last night. I don’t tell her of course.\u003c/p\u003e\n\u003cp\u003eShe frowns at me and shakes her head. “Sometimes I don’t think you realise how gorgeous you are, Tru.”\u003c/p\u003e\n\u003cp\u003eI pull a face at her skewered compliment.\u003c/p\u003e\n\u003cp\u003e“And yes, you are right. Jake could bed any women he wants to … but currently I think he wants to bed you.”\u003c/p\u003e\n\u003cp\u003eI frown at her. “It’d be an awful lot of trouble for him to go through just to get laid, when he can have it so easily accessible elsewhere.”\u003c/p\u003e\n\u003cp\u003e“Easily accessible can get boring, my darling. And you are right, it certainly would be a lot of trouble to go to.” She raises her eyebrow. “So I guess that shows the worth of the person as to the level of trouble he’s willing to go to.”\u003c/p\u003e\n\u003cp\u003e“Or just the new challenge.”\u003c/p\u003e\n\u003cp\u003e“That too.” She leans back in her chair. “Just be careful, my darling, when mixing business and pleasure. Things can get awful messy sometimes.”\u003c/p\u003e\n\u003cp\u003e“I don’t intend on mixing anything. I’m with Will, remember.”\u003c/p\u003e\n\u003cp\u003e“You are.”\u003c/p\u003e\n\u003cp\u003e“And I don’t think Jake is like that, contrary to popular belief, I think he’s professional in business, I don’t think he screws the staff – just everyone else.”\u003c/p\u003e\n\u003cp\u003e“Of course. I can imagine Jake Wethers to be the upmost professional.”\u003c/p\u003e\n\u003cp\u003eShe’s being snarky.\u003c/p\u003e\n\u003cp\u003e“He was actually a real gent at dinner last night.”\u003c/p\u003e\n\u003cp\u003e“He was?” She smiles, a real genuine smile. “Good. I’m glad.”\u003c/p\u003e\n\u003cp\u003eI ignore the little nag of disappointment, tugging away inside of me, that Jake Wethers, who is well known for screwing anything that moves, had no interest in me whatsoever last night.\u003c/p\u003e\n\u003cp\u003eOf course it stings. I would never have slept with him, of course, because of Will. But I would have kissed him for sure.\u003c/p\u003e\n\u003cp\u003eBut then kissing is cheating too.\u003c/p\u003e\n\u003cp\u003eUgh, my head is all gooey right now. I need a coffee.\u003c/p\u003e\n\u003cp\u003eI’m being irrational and silly that my pride is hurt, I know, but I’m a girl and it’s my prerogative to be just so.\u003c/p\u003e\n\u003cp\u003e“You want a coffee?” I ask Vicky, as I’m leaving her office. “I’m making.”\u003c/p\u003e\n\u003cp\u003e“I’m fine, my darling, thank you.”\u003c/p\u003e\n\u003cp\u003eI’m just heading past my desk, on my way to the kitchen to fire the kettle up when my mobile starts to ring.\u003c/p\u003e\n\u003cp\u003eI lean over my desk and grab my phone. It’s Jake. I get little butterflies setting flight in my tummy.\u003c/p\u003e\n\u003cp\u003eI’m going to have to knock this off if I’m going to be working with him…\u003c/p\u003e\n\u003cp\u003ePeople don’t work with me, Tru. They work for me.\u003c/p\u003e\n\u003cp\u003eOkay, so working for him – whatever. I hope he’s not as bad a person to work for as it’s claimed he can be.\u003c/p\u003e\n\u003cp\u003e“You had that coffee yet?” he says before I get a chance to speak.\u003c/p\u003e\n\u003cp\u003e“No, debido a las interrupciones constantes.”\u003c/p\u003e\n\u003cp\u003e“Tru, I haven’t got a fuckin’ clue what you just said, but I’ll take the ‘no’ I caught out of that, as you haven’t.”\u003c/p\u003e\n\u003cp\u003e“No, I haven’t,” I laugh.\u003c/p\u003e\n\u003cp\u003e“Okay, well I’m not calling back again, so listen up. I’m picking you up for lunch because I want to go over with you what will happen on the tour.”\u003c/p\u003e\n\u003cp\u003eDo I get a choice?\u003c/p\u003e\n\u003cp\u003e“Shouldn’t that be your assistant’s job to talk to me about that stuff?” I question.\u003c/p\u003e\n\u003cp\u003e“Well if I wanted my assistant to have lunch with you then yeah it would be, but I don’t, so you’re getting me – okay?”\u003c/p\u003e\n\u003cp\u003e“What if I already have plans?”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e“With?”\u003c/p\u003e\n\u003cp\u003eDo I detect a hint of jealously there, Jake?\u003c/p\u003e\n\u003cp\u003e“Starbucks. I meet him every day at one for a coffee and blueberry muffin.”\u003c/p\u003e\n\u003cp\u003eI hear him exhale down the line.\u003c/p\u003e\n\u003cp\u003e“Would you consider ditching him for me?” His voice has gone all seductive and flirty again.\u003c/p\u003e\n\u003cp\u003e“I don’t know … it’s a pretty serious thing me and Starbucks have going on.”\u003c/p\u003e\n\u003cp\u003e“I’ll make it worth your while.”\u003c/p\u003e\n\u003cp\u003e“Go on?”\u003c/p\u003e\n\u003cp\u003e“I’m talking cake, Tru, lots and lots of cake…”\u003c/p\u003e\n\u003cp\u003e“Starbucks who?” I giggle\u003c/p\u003e\n\u003cp\u003e“Cool, be outside your building at one.”\u003c/p\u003e\n\u003cp\u003e“Sí, señor.”\u003c/p\u003e\n\u003cp\u003eI hear him laugh before I hang up.\u003c/p\u003e\n\u003cp\u003eI feel absolutely full of glee. Jake is being lovely, and flirty, and I’m seeing him again in just a few hours.\u003c/p\u003e\n\u003cp\u003eBut no, I need to calm myself down. I’m going to be working for Jake, so I need to keep myself professional.\u003c/p\u003e\n\u003cp\u003eHe might be an old friend, an incredibly flirty old friend. But that’s Jake. That’s his MO.\u003c/p\u003e\n\u003cp\u003eAnd I need to remember that, and not confuse this into something it’s not.\u003c/p\u003e\n\u003cp\u003eThe black Land Rover that Dave was following us around in last night is already parked outside my building when I go down at one.\u003c/p\u003e\n\u003cp\u003eDave gets out of the car and walks around, opening the back passenger door for me.\u003c/p\u003e\n\u003cp\u003e“Hello again,” he says.\u003c/p\u003e\n\u003cp\u003e“Hi,” I whisper shyly.\u003c/p\u003e\n\u003cp\u003eI climb in the back and Jake is there waiting for me. Looking his gorgeous rock star self in light blue ripped jeans, a faded black Stone Roses ‘I Wanna Be Adored’ T-shirt, and the same Converses he wore last night.\u003c/p\u003e\n\u003cp\u003e“Hey,” he says, his voice all rough, and smooth like honey, as Dave closes the door behind me.\u003c/p\u003e\n\u003cp\u003e“Hey yourself,” I smile.\u003c/p\u003e\n\u003cp\u003eI can smell Jake’s scent across the car. Cigarettes and aftershave. It makes my tummy flutter.\u003c/p\u003e\n\u003cp\u003eDave climbs back in the drivers’ seat and pulls us away into the heavy lunchtime traffic.\u003c/p\u003e\n\u003cp\u003e“So how’s your morning been?” Jake asks me.\u003c/p\u003e\n\u003cp\u003e“Oh, you know, long.”\u003c/p\u003e\n\u003cp\u003e“Much happen?”\u003c/p\u003e\n\u003cp\u003eI slide a look at him. “Apart from a famous rock star who also used to be my next door neighbour growing up calling me and offering me a job to write his bio on his upcoming tour? No, not much at all.” I shake my head, grinning.\u003c/p\u003e\n\u003cp\u003e“Is that all I was – your next-door neighbour? I thought I earned the title best friend back then.”\u003c/p\u003e\n\u003cp\u003eHis words make my tummy feel funny. Suddenly empty.\u003c/p\u003e\n\u003cp\u003e“You did … and we were best friends.”\u003c/p\u003e\n\u003cp\u003e“Were?”\u003c/p\u003e\n\u003cp\u003e“Well it’s been a while, Jake. You don’t just get that status back after one dinner.” I smile again, trying to alleviate whatever this is.\u003c/p\u003e\n\u003cp\u003e“I guess I’m going to have to work a little harder then to claim my title back,” his voice is low with meaning. He smiles at me, and my heart lurches out of my chest and whams straight into him once again.\u003c/p\u003e\n\u003cp\u003e“So am I allowed to know where we’re going for lunch today, or is that a surprise too?” I give him a light-hearted look, trying to straighten out my erratic heart and shaky emotions.\u003c/p\u003e\n\u003cp\u003e“Just back to the hotel. I hope that’s okay?”\u003c/p\u003e\n\u003cp\u003e“Sure it is.”\u003c/p\u003e\n\u003cp\u003eI’d eat fish and chips in the backseat of a car if it meant being with you.\u003c/p\u003e\n\u003cp\u003e“It’s just less hassle, means we won’t get bothered,” he adds, as though he has to explain why he’s taking me back to his suite.\u003c/p\u003e\n\u003cp\u003e“Jake, it’s okay, I understand.” I touch his arm.\u003c/p\u003e\n\u003cp\u003eHe looks down at my hand on his tattooed arm, then up at my face.\u003c/p\u003e\n\u003cp\u003eSomething passes in the air between us.\u003c/p\u003e\n\u003cp\u003eI withdraw my hand, swallowing down, and shift in my seat.\u003c/p\u003e\n\u003cp\u003e“You should have told me we were just staying at the hotel. I would’ve come over. It’s not too far of a walk.”\u003c/p\u003e\n\u003cp\u003eHe gives me a stupid, but firm look. “I was picking you up, Tru.”\u003c/p\u003e\n\u003cp\u003e“Okay Mr Bossy … I hope you’re not gonna be like this for the tour.”\u003c/p\u003e\n\u003cp\u003e“What – bossy?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Well when I know what I want I say it ... or take it.” He tilts his head to the side, staring at me for a long moment.\u003c/p\u003e\n\u003cp\u003eMy legs start to tremble.\u003c/p\u003e\n\u003cp\u003eI press my knees together.\u003c/p\u003e\n\u003cp\u003eI flicker a nervous glance at Dave, but his eyes are focussed ahead on the road.\u003c/p\u003e\n\u003cp\u003eI keep mine ahead too.\u003c/p\u003e\n\u003cp\u003eAnd we ride in silence for the rest of the short ride to the hotel. I’m at a complete loss for words after that little exchange.\u003c/p\u003e\n\u003cp\u003eDave pulls the car into the hotel’s parking lot and then I follow him and Jake through the lot into the hotel and to the lifts.\u003c/p\u003e\n\u003cp\u003eI ride up with them both in silence, and leaving Dave out in the hall, I follow Jake into his suite.\u003c/p\u003e\n\u003cp\u003eI can’t believe it was only yesterday that I was here to interview him and now I’m going to be working for him. It’s crazy.\u003c/p\u003e\n\u003cp\u003eAs I follow him I see Stuart at the far side of the living room, sitting on the sofa reading a magazine. He closes the magazine, dropping it onto the coffee table and stands at our arrival.\u003c/p\u003e\n\u003cp\u003e“Hi,” I say, feeling a little shy.\u003c/p\u003e\n\u003cp\u003eI wonder if he knows I’m going to be working for Jake. I’m sure he will, he’s Jake PA. He’ll know everything about him.\u003c/p\u003e\n\u003cp\u003eProbably some things I don’t want to know.\u003c/p\u003e\n\u003cp\u003e“Hello again,” he smiles at me.\u003c/p\u003e\n\u003cp\u003e“Is everything ready?” Jake asks him.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” he says to Stuart.\u003c/p\u003e\n\u003cp\u003eStuart gives him a brief nod, and then heads out of the room leaving us alone\u003c/p\u003e\n\u003cp\u003e“Come on,” Jake says to me, taking hold of my hand, giving me a fire in my belly again, he leads me across the living room and out onto the terraced balcony.\u003c/p\u003e\n\u003cp\u003eThe air is refreshing on my skin, not chilly at all, and as I step through the door and out from behind Jake, I see there’s a table set up, with two chairs, and it is filled with tiers of little mini cakes. So many different varieties, cupcakes, cream buns, éclairs, cheesecakes, and, oh my god, cream filled muffins, and some I can’t even identify.\u003c/p\u003e\n\u003cp\u003eI know he said there’d be cake, but I never expected anything like this. And there is also fresh coffee waiting.\u003c/p\u003e\n\u003cp\u003eIn this moment I just love him. Not love him, love him – but love him, oh you know what I mean.\u003c/p\u003e\n\u003cp\u003eJake turns seeing my open mouthed expression, and says, “Well you gave up a date with Starbucks for me, it was the least I could do.”\u003c/p\u003e\n\u003cp\u003e“This is a little better than Starbucks though,” I say, my voice a little hoarse. “Is this birthday present number two?”\u003c/p\u003e\n\u003cp\u003eHe squeezes my hand ever so slightly, and smiles, a mysterious smile and leads me over to the table to sit down.\u003c/p\u003e\n\u003cp\u003eIn the last two days, Jake has done more thoughtful things for me than anyone has ever done in my whole entire life.\u003c/p\u003e\n\u003cp\u003eHe pulls my chair out for me.\u003c/p\u003e\n\u003cp\u003e“Why thank you kind sir,” I giggle.\u003c/p\u003e\n\u003cp\u003eHe sits down across from me.\u003c/p\u003e\n\u003cp\u003eI feel all fuzzy and up in the clouds here on this penthouse balcony.\u003c/p\u003e\n\u003cp\u003eAnd I also feel like I’m on a date. Which of course I’m not, this is a business lunch, just with lots and lots of yummy scrummy cakes. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-13.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
