{"id":97887,"no":36,"title":"Page 36","content":"\u003cp\u003eConcern I really do not deserve.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m fine. I just felt a little hot, a little queasy, but I’m fine now.”\u003c/p\u003e\n\u003cp\u003eI’m not fine, I’m miserable, disgusted with myself, and so very screwed up.\u003c/p\u003e\n\u003cp\u003eHere I was promising myself I’d be better for Will, and then I go and have sex with Jake in a bathroom. And now I’m an even bigger mess than I was before.\u003c/p\u003e\n\u003cp\u003eI pick my margarita up.\u003c/p\u003e\n\u003cp\u003e“Is it a good idea to drink that if you feel sick, darling? I can go to the bar and get you some water if you want?”\u003c/p\u003e\n\u003cp\u003e“No, I’m fine – honestly,” I add at Will’s worried expression.\u003c/p\u003e\n\u003cp\u003eWhat I need right now is alcohol and lots of it. I take a deep gulp of my margarita.\u003c/p\u003e\n\u003cp\u003eStuart catches my eye and gives me a knowing look, lifting his eyebrow.\u003c/p\u003e\n\u003cp\u003eHe knows I’m sleeping with Jake.\u003c/p\u003e\n\u003cp\u003eOf course he does. Dave knows so it makes sense he does.\u003c/p\u003e\n\u003cp\u003eI’ve spent the last five days holed up with Jake. And Stuart is his PA. He knows Jake’s itinerary, his every movement. It’s his job to.\u003c/p\u003e\n\u003cp\u003eI bet he thinks I’m a complete slut.\u003c/p\u003e\n\u003cp\u003eMy cheeks burn with shame.\u003c/p\u003e\n\u003cp\u003eI glance across the room, past Stuart, and see Jake is with Zzhuilette again.\u003c/p\u003e\n\u003cp\u003eI get a twisted feeling in my stomach.\u003c/p\u003e\n\u003cp\u003eShe’s sitting in his lap and they’re sharing a cigarette. She puts it in his mouth, holding it to his lips while he takes a drag. Touching his lips with her fingers.\u003c/p\u003e\n\u003cp\u003eLips that were on mine minutes before. Kissing me, everywhere.\u003c/p\u003e\n\u003cp\u003eShe transfers the cigarette to her own lips and takes a long, sultry drag. Leaning close, she blows the smoke into Jake’s mouth.\u003c/p\u003e\n\u003cp\u003eI feel a flash of white hot jealously streak through me, as I see that his hand is on her thigh, his other stroking her arm, intimately.\u003c/p\u003e\n\u003cp\u003eI have a flash of memory, his hands on me, touching me.\u003c/p\u003e\n\u003cp\u003eThen I watch as Jake releases the used smoke from his mouth, and leans in and whispers something in her ear. She throws her head back and laughs.\u003c/p\u003e\n\u003cp\u003eHow can he do this when he was just in there with me? How can he move on so quickly?\u003c/p\u003e\n\u003cp\u003eHe’s sitting there with her in his lap, and my torn panties in his pocket.\u003c/p\u003e\n\u003cp\u003eI feel sick.\u003c/p\u003e\n\u003cp\u003eHe catches my eye.\u003c/p\u003e\n\u003cp\u003eDon’t kiss her. Please don’t kiss her.\u003c/p\u003e\n\u003cp\u003eThen with clear defiance on his face, he grabs hold of the back of her head, and plants his mouth on hers.\u003c/p\u003e\n\u003cp\u003eI almost vomit into my drink.\u003c/p\u003e\n\u003cp\u003eHow could he do this? He was having sex with me less than ten minutes ago and now he’s out here kissing another woman.\u003c/p\u003e\n\u003cp\u003eI know I’m no angel in this, but I would never have come back out here, after been with him in there, and stuck my tongue down Will’s throat.\u003c/p\u003e\n\u003cp\u003eHot tears burn the backs of my eyes. I have the urge to run.\u003c/p\u003e\n\u003cp\u003eBut where to? And it’s not like I can just run off anyway. Will would wonder what the hell was wrong with me.\u003c/p\u003e\n\u003cp\u003eI’m trapped here, doomed to watch, while Jake kisses another woman, minutes after having sex with me.\u003c/p\u003e\n\u003cp\u003eDeep breaths, Tru. It’s okay. It’s all going to be okay.\u003c/p\u003e\n\u003cp\u003eClosing my eyes, shutting them out, I pick my margarita up and drain the glass.\u003c/p\u003e\n\u003cp\u003eBut I have to look again. It’s torture, but I can’t help myself.\u003c/p\u003e\n\u003cp\u003eI open my eyes to see Jake’s no longer kissing her; he’s talking to Tom, who also has a groupie hanging off him. But Zzhuilette is still in Jake’s lap. Her hands are on him.\u003c/p\u003e\n\u003cp\u003eI hate her, and I hate him.\u003c/p\u003e\n\u003cp\u003eNo I don’t, I love him. But I want to hate him. In this moment it’s all I want. It would make all of this so much easier if I did.\u003c/p\u003e\n\u003cp\u003eBecause this is Jake. This is what he does. It’s what he’s famous for.\u003c/p\u003e\n\u003cp\u003eHe never gave a shit about being with me. I’m just a challenge to him. Something to conquer. He would have got bored with me the instant he took me off Will, and would have tossed me aside like all the rest of them.\u003c/p\u003e\n\u003cp\u003eJake can have his pick of women. There’s not one single reason why he would have wanted me as his forever.\u003c/p\u003e\n\u003cp\u003eAnd I’m seeing the evidence clear, now, before me.\u003c/p\u003e\n\u003cp\u003e“Another drink, darling?” Will’s already on his feet, gesturing to my empty glass.\u003c/p\u003e\n\u003cp\u003eHe’s so attentive. I don’t deserve him.\u003c/p\u003e\n\u003cp\u003eI do love him.\u003c/p\u003e\n\u003cp\u003eBut I love Jake. More. I think. I don’t know.\u003c/p\u003e\n\u003cp\u003eCrap.\u003c/p\u003e\n\u003cp\u003e“Shots!” I blurt out.\u003c/p\u003e\n\u003cp\u003eWill gives me a puzzled look.\u003c/p\u003e\n\u003cp\u003e“Ooh, I’m down for shots,” Stuart chips in, grinning, tapping his fingers on the table.\u003c/p\u003e\n\u003cp\u003eI think I’ve just found my drinking soul mate for the evening, seeing as though Simone has abandoned me for the gorgeous, sweet Denny.\u003c/p\u003e\n\u003cp\u003eWhy can’t Jake be more like Denny?\u003c/p\u003e\n\u003cp\u003e“A round of tequila shots please, baby … oh, and a beer chaser and another margarita – Stuart?” I look at him with a question.\u003c/p\u003e\n\u003cp\u003eHe looks back at me impressed.\u003c/p\u003e\n\u003cp\u003eWell if I have to spend the night watching Jake maul a leggy redhead not long after having sex with me, then I’m going to do it drunk.\u003c/p\u003e\n\u003cp\u003eStuart looks up at Will, and says, “I’ll have what the lovely Tru is having, oh and make sure to put it on Jake’s tab.”\u003c/p\u003e\n\u003cp\u003eHe winks at me.\u003c/p\u003e\n\u003cp\u003e“Okay. Good. I’ll be back in a minute,” Will mutters still looking slightly perplexed.\u003c/p\u003e\n\u003cp\u003eI know he thinks I’ve lost it. He probably thinks I’m spending too much time around musicians. He’s right I am. But not in the way he thinks. My problem is I’ve been spending way too much time with one musician in particular – in the very blackest sense of the word.\u003c/p\u003e\n\u003cp\u003eBut right now, I don’t care. It’s either get drunk, or go ass-over-backwards crazy.\u003c/p\u003e\n\u003cp\u003eI opt for drunk.\u003c/p\u003e\n\u003cp\u003eAnd I’m kind of loving Stuart right now for supporting me in my alcohol binge, and for spending Jake’s money in the process of helping me do it.\u003c/p\u003e\n\u003cp\u003eI watch Will go over to the bar. Anything to keep my wandering eyes off Jake and Zzhuilette.\u003c/p\u003e\n\u003cp\u003eI see Simone is still perched at the bar, her and Denny deep in conversation, totally engrossed with each other.\u003c/p\u003e\n\u003cp\u003eI’m glad for her. Denny is a cool guy.\u003c/p\u003e\n\u003cp\u003e“You hanging in there, gorgeous?” Stuart asks me, bringing my attention around to him. “Or do you want me to go kick his ass.”\u003c/p\u003e\n\u003cp\u003e“Who?” I’m confused.\u003c/p\u003e\n\u003cp\u003e“Jake.” He raises his eyebrows at me.\u003c/p\u003e\n\u003cp\u003e“Oh.” I lean my head into my hand, and glance over at him. “Am I that transparent?”\u003c/p\u003e\n\u003cp\u003e“No. But he is.” He tilts his head back in Jake’s direction.\u003c/p\u003e\n\u003cp\u003e“Please don’t say anything to anyone … Will.”\u003c/p\u003e\n\u003cp\u003eHe gives me an, ‘as if I would’ look.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I utter quietly.\u003c/p\u003e\n\u003cp\u003e“Tru, I don’t like to stick my nose in other people’s business … but look, gorgeous, Jake’s not only my boss, he’s my friend, and I’ve known him a long time – I live with the guy. And basically, the idiot is crazy about you. I have never seen him, with anyone, the way he is with you.”\u003c/p\u003e\n\u003cp\u003eI look at him surprised by his words.\u003c/p\u003e\n\u003cp\u003e“Except for when he’s sticking his tongue down the throat of a leggy redhead,” I add, trying to muster up a smile.\u003c/p\u003e\n\u003cp\u003eIt doesn’t work.\u003c/p\u003e\n\u003cp\u003e“Don’t let that bother you, honey. That’s just Jake trying to prove a point to you and himself. Trying to prove you don’t matter to him as much as he knows you do. It’s not going so well, as you can see. He doesn’t do hurt well, so he’s trying to hurt you to make himself feel better. He’s all about the pain that one.”\u003c/p\u003e\n\u003cp\u003eHe leans closer to me.\u003c/p\u003e\n\u003cp\u003e“He’s not used to this, gorgeous. Women don’t play with Jake. He plays with them. He uses them as he sees fit and then tosses them aside when’s he’s had enough. It’s what he’s done since I’ve been with him, and long before that I imagine. It’s all he knows how to do. I can’t even begin to tell you how many women I’ve drove home, consoled, fielded calls from, had to arrange restraining orders against … anyway, I digress,” he says at my pained expression. “Basically, since you arrived back in his life he’s changed.”\u003c/p\u003e\n\u003cp\u003e“He hasn’t.” I shake my head.\u003c/p\u003e\n\u003cp\u003eHe touches my arm, briefly. “He has, chica. He was living in his own world, floating along in his overly large, Jake bubble, screwing anything with a pulse, and then you came back into his life and I saw the instant change in him. From that day in the hotel, when he saw you, he’s been different. No screwing around. He’s like a freakin’ Catholic priest – minus the boys,” he chuckles.\u003c/p\u003e\n\u003cp\u003e“He can’t screw around, because he finds himself not wanting to, because he can’t get you out of his head. It’s an alien concept for him, sweetheart. He’s ten-shades of crazy about you, which I’m pretty sure he’s already realised – add in to that you have a boyfriend you won’t give up for him … and this is the result.” He waves his hand over his shoulder in Jake’s general direction, leaning back in his chair. “He’s met his equal in you that’s for sure.”\u003c/p\u003e\n\u003cp\u003e“I don’t know about that, and it’s not that I won’t give Will up,” I whisper. “There’s just–”\u003c/p\u003e\n\u003cp\u003e“Never a right time, honey, I know. There never is when it comes to breaking someone’s heart. But you will have to break one of those boys’ hearts, and I’d say sooner rather than later. But I figure you already know that. And Jake, well he’ll regret whatever continuing performance he puts on tonight – tomorrow. Remember honey, he’s a man, and with men you just you have to treat them like the children they are.”\u003c/p\u003e\n\u003cp\u003eI raise my brow at him. “You’re a man…”\u003c/p\u003e\n\u003cp\u003e“Yes, but I’m the best kind of man, my gorgeous-one, I’m Venus and Mars.” He winks at me.\u003c/p\u003e\n\u003cp\u003eI can’t help but laugh, even though inside I’m in complete and utter agony.\u003c/p\u003e\n\u003cp\u003eThen one of my favourite dance songs comes on.\u003c/p\u003e\n\u003cp\u003e“You wanna dance?” I ask to Stuart, getting to my feet, holding my hand out to him.\u003c/p\u003e\n\u003cp\u003eI refuse to sit here wallowing for a moment longer. I want to forget, and dancing will make me forget.\u003c/p\u003e\n\u003cp\u003e“You’re asking a gay guy if he wants to dance? Is the Pope celibate – actually no don’t answer that.” He gets to his feet and takes hold of my hand. “It will be my absolute pleasure to grind on that dance floor with the hottest chica here tonight.”\u003c/p\u003e\n\u003cp\u003e“Ah, now you’re definitely just being Mars.”\u003c/p\u003e\n\u003cp\u003e“Damn,” he grins.\u003c/p\u003e\n\u003cp\u003eI catch Will’s eye at the bar and indicate to him that Stuart and I are hitting the dance floor. He gives me a brief nod.\u003c/p\u003e\n\u003cp\u003eStuart leads me onto the dance floor by the hand. I instantly start to relax.\u003c/p\u003e\n\u003cp\u003eI leave behind thoughts of Jake and Will, and complicated relationships at the edge of this dance floor, and lose myself in my one true love. Music.\u003c/p\u003e\n\u003cp\u003eAnd hell, I thought Jake could move – Stuart would knock him on his ass in a dance-off, and Jake being knocked on his ass is something I would take great pleasure in watching right now.\u003c/p\u003e\n\u003cp\u003eStuart is moving around the floor like a pro and I actually look like I know what I’m doing thanks to his awesomeness. Not that I’m a bad dancer, but Stuart is dynamite.\u003c/p\u003e\n\u003cp\u003eI wonder if he ever used to dance professionally?\u003c/p\u003e\n\u003cp\u003eWe are starting to attract quite a few stares. And I can see Jake watching us from his table. Zzhuilette is off his lap for the time being, thank god. She’s probably plumping up her cleavage in the toilet. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-36.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
