{"id":97892,"no":41,"title":"Page 41","content":"\u003cp\u003eHe wants me to be his first.\u003c/p\u003e\n\u003cp\u003e“So it’s kind of like I’m taking your virginity,” I grin.\u003c/p\u003e\n\u003cp\u003e“I guess it kind of is,” he chuckles lightly, then his eyes turn serious. “I’ve never made love with anyone but you, because there is only you who I’ve ever loved.”\u003c/p\u003e\n\u003cp\u003eI lift my hips up, pushing against him, my feelings for him driving through me. “I want to feel you, Jake. I want you to make love to me.”\u003c/p\u003e\n\u003cp\u003eHis eyes turn lustful, laced thick with desire. And without taking his from mine, he very slowly eases himself inside me.\u003c/p\u003e\n\u003cp\u003e“Fuuucckk,” he groans, slowly.\u003c/p\u003e\n\u003cp\u003eI watch him with contentment and love, and my own desire fuelling through me. I reach my hand up to his face.\u003c/p\u003e\n\u003cp\u003e“You felt amazing before, Tru, but, Jesus Christ. You feel fuckin’ insane.”\u003c/p\u003e\n\u003cp\u003eHe leans down, putting his mouth on mine, slowly pulling out of me, he eases himself back in, groaning once again into my mouth.\u003c/p\u003e\n\u003cp\u003e“I love you,” I whisper.\u003c/p\u003e\n\u003cp\u003eI wrap my legs around him, holding him deep inside me, not letting him go.\u003c/p\u003e\n\u003cp\u003eHe traps my face between both his hands. “I love you, and I always will.” He kisses me deeply, passionately as he starts to pick up pace, losing himself to the moment, to me, the sensation, as he moves me all over the bed, making desperate love to me.\u003c/p\u003e\n\u003cp\u003eAnd in this moment I have never felt happier, or more loved, than I do now here with Jake.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003eJake and I spent the rest of yesterday in his suite. We got room service and watched a movie, and did other things of course.\u003c/p\u003e\n\u003cp\u003eI called Vicky at home and explained everything that had been happening with Jake and Will. I thought it was going to be a really awkward conversation, but Vicky’s not stupid, she knew.\u003c/p\u003e\n\u003cp\u003eShe told me to take as long as I need off work, the bio’s the focus anyway and as I’m now getting up close and personal with our intended she didn’t mind.\u003c/p\u003e\n\u003cp\u003eBut I do, I don’t want to take liberties.\u003c/p\u003e\n\u003cp\u003eAfter I came off the phone with Vicky, I did start thinking about the bio, and how is it kind of weird that Jake and I are couple, and I’m still going to be writing it.\u003c/p\u003e\n\u003cp\u003eI started to think maybe I shouldn’t be.\u003c/p\u003e\n\u003cp\u003eWhen I tried to broach the subject with Jake he just brushed me off. He said it doesn’t matter as most of the European tour was noted before we started anything together, so it’s not a big deal.\u003c/p\u003e\n\u003cp\u003eBut I don’t know, a part of me feels like it’s a conflict of interest, then on the flip side I don’t want to lose this great opportunity for my career, so I’m trying not to over think it at the moment.\u003c/p\u003e\n\u003cp\u003eI called my dad too. He wasn’t surprised about Jake and I either. He must have sensed it when they visited.\u003c/p\u003e\n\u003cp\u003eAnd whereas my dad was absolutely delighted about Jake and I, my mum was, as I expected, a little more reserved about it.\u003c/p\u003e\n\u003cp\u003eShe knows what it’s like to live with a musician, and with one as famous as Jake and his past tendencies, she said to me, as she had before, that she’s worried for my heart.\u003c/p\u003e\n\u003cp\u003eI love her so much for her concern, but I know Jake will never break my heart. I\u0027m not just any other girl to him. We’ve known each other a lifetime.\u003c/p\u003e\n\u003cp\u003eYes, I know life with Jake will be bumpy, crazy and a little difficult at times, but I don’t think he would ever truly hurt me.\u003c/p\u003e\n\u003cp\u003eI know because I can see it in his eyes every time he looks at me – his love for me, and I wonder how I never saw it there before.\u003c/p\u003e\n\u003cp\u003eMaybe I couldn’t see it because he was afraid to truly show it to me. But now all those doors are open and I couldn’t be happier.\u003c/p\u003e\n\u003cp\u003e“Baby, can you pass me the jam?”\u003c/p\u003e\n\u003cp\u003eJake and I are eating breakfast out on the balcony of his suite, with Paris as our backdrop.\u003c/p\u003e\n\u003cp\u003eStuart is inside working in the living room rearranging Jake’s cancelled appearances back in the US. The ones he’s cancelled to stay here with me.\u003c/p\u003e\n\u003cp\u003eStuart could work out of his own suite I suppose, but he does need to ask Jake things from time to time, and I think he gets a little lonely in his suite. I know I would. And I think he’s just used to being around Jake. I love the friendship they have, and I like having Stuart around, he’s fun and cool.\u003c/p\u003e\n\u003cp\u003eJake passes over the jam and as I’m taking hold of it, he catches hold of my wrist and pulls me forward across the table. Meeting me halfway, he plants a long delicious kiss on my lips.\u003c/p\u003e\n\u003cp\u003e“You taste yummy,” I murmur. He’s been eating pain au chocolat.\u003c/p\u003e\n\u003cp\u003e“So did you,” he winks, and my face instantly flushes.\u003c/p\u003e\n\u003cp\u003eHe’s referring to what he was doing to me in bed first thing this morning.\u003c/p\u003e\n\u003cp\u003eShivers run from my head to my toes at the memory, a heat rising fast in me.\u003c/p\u003e\n\u003cp\u003eI sit back in my seat, picking up a knife, I spread jam on my croissant.\u003c/p\u003e\n\u003cp\u003e“So what do you want to do today?” Jake asks. “We could go sightseeing, do the whole touristy thing, Eiffel tower and that, and go out to lunch – we could go to the delicatessen that make the mini-cakes you love … or I can take you shopping and buy you lots of pretty things. I’m sure Denny would be up for it if you wanted Simone along for the shopping?”\u003c/p\u003e\n\u003cp\u003eSimone decided to stay on as well. She took a few days off work to spend with Denny as they are getting on really well. I’m so happy for her.\u003c/p\u003e\n\u003cp\u003eTom and Smith took the jet back to LA. So there’s just the four of us, and Stuart, and of course Dave and Ben are still here in Paris also.\u003c/p\u003e\n\u003cp\u003eAnd Paris is beautiful. I’ve barely seen any of it while I’ve been here and I really want to go out with Jake today, but I don’t think I should.\u003c/p\u003e\n\u003cp\u003eI scrunch my face up in anticipation of what I’m going to say.\u003c/p\u003e\n\u003cp\u003e“What?” he sighs, running his fingers through his hair. “Is this the – me spending money on you thing, again? Because seriously, Tru, we’re together now and I have a lot of money and I want to spoil you rotten.”\u003c/p\u003e\n\u003cp\u003e“No, it’s not that. I mean I don’t want you spending ridiculous amounts of money on me, but I get that you’re rich and things are different when you’re rich so I’ll have to get used to that … it’s just.”\u003c/p\u003e\n\u003cp\u003e“What?” His brow furrows.\u003c/p\u003e\n\u003cp\u003e“I just thought maybe we could stay in.”\u003c/p\u003e\n\u003cp\u003e“We stayed in all day yesterday.”\u003c/p\u003e\n\u003cp\u003e“I know, and it was so awesome that I want to do it all over again.”\u003c/p\u003e\n\u003cp\u003eHis frown deepens causing a line to form between his brows, so I know he’s not buying it.\u003c/p\u003e\n\u003cp\u003e“Yesterday was awesome, no doubting that, and last night and this morning too, but that’s not it, Tru, there’s something you’re not telling me. Why don’t you want to go out with me?”\u003c/p\u003e\n\u003cp\u003e“I do … it’s just…”\u003c/p\u003e\n\u003cp\u003e“It’s just what?” His tone is so forceful, that I give him a sharp look.\u003c/p\u003e\n\u003cp\u003e“Well, it’s just, I um…” I drag my fingers nervously through my hair. “I just know that if we go out together, it’s highly likely that we’ll be photographed together, because you’re well – you. And because you’re you, and you’re out with a woman … those photos will undoubtedly end up in the tabloids at some point.”\u003c/p\u003e\n\u003cp\u003e“You don’t want people to know we’re together?” He’s still frowning at me. “Are you ashamed of me or something?”\u003c/p\u003e\n\u003cp\u003eAshamed of him? Where did that come from?\u003c/p\u003e\n\u003cp\u003e“No! How could you think that?”\u003c/p\u003e\n\u003cp\u003e“Um.” He rubs his forehead with his fingers, giving me a hard stare. “Because you don’t want to be seen in public with me.”\u003c/p\u003e\n\u003cp\u003e“It’s not that. I do want to be seen in public with you, I’m so happy to be with you. I love you. It’s just…” How do I say this without causing a row? “Will and I only broke up yesterday.”\u003c/p\u003e\n\u003cp\u003eHis face darkens at the mention of Will, just like I knew it would.\u003c/p\u003e\n\u003cp\u003e“And I just think it would be really insensitive of me to go out in public with you and for those pictures to end up in the press for him to see. It’d be like rubbing salt in his already raw wound, and I don’t want to hurt him anymore that I already have done.”\u003c/p\u003e\n\u003cp\u003e“So this is about Will. What a fuckin’ surprise!” He throws his hands up in the air. “All you seem to care about is his feelings. What about my feelings, Tru? Or are they still irrelevant to you?”\u003c/p\u003e\n\u003cp\u003eI look at him shocked. “Your feelings were never irrelevant to me. I care about you, Jake – so much. I couldn’t bear the thought of you hurting. I love you – I’m in love with you.”\u003c/p\u003e\n\u003cp\u003e“Well you’ve got a funny way of showing it.” He folds his arms over his chest.\u003c/p\u003e\n\u003cp\u003e“You’re being irrational.”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Yes – you!” I’m starting to get really annoyed now. “We had an affair behind Will’s back! I broke his heart only yesterday morning! I’m trying to spare causing him anymore pain than I’ve already done!”\u003c/p\u003e\n\u003cp\u003e“And you don’t think I wasn’t in pain? All the time you were still with him, stuck between me and him, and then having to see you with him at my show and then the after party. I sat here that night driving myself fuckin’ crazy thinking about you in that room with him! Sleeping in that bed with him! Jesus Christ!” He picks his cigarettes up off the table and angrily gets one out.\u003c/p\u003e\n\u003cp\u003e“I didn’t sleep with Will, I told you, and I haven’t since we started sleeping together.”\u003c/p\u003e\n\u003cp\u003e“You think I’m talking about sex here, Tru?” He slams the cigarette packet back on the table. “I’m talking about the fact that you were lying in bed, next to him, all night, when it should have been me. I should have been the one waking up beside you.”\u003c/p\u003e\n\u003cp\u003e“You have me now!” I yell frustrated. “And every single day from now! Why are we even talking about this?!”\u003c/p\u003e\n\u003cp\u003e“Because you don’t want to be seen in public with me!”\u003c/p\u003e\n\u003cp\u003e“I do!” I take a calming breath in through my nose. “I just want to wait a little while,” I say in a calmer voice. “Let things settle down.”\u003c/p\u003e\n\u003cp\u003e“So you’re telling me you won’t go out with me?” His gaze is fixed and determined\u003c/p\u003e\n\u003cp\u003eI shake my head, no.\u003c/p\u003e\n\u003cp\u003e“Fine.” He pushes his chair out, the metal legs scraping loudly against the stony floor and gets to his feet. “I’ll see if Denny and Simone want to do something with me – maybe I should take Stuart as my date.” He tosses his unlit cigarette onto the table.\u003c/p\u003e\n\u003cp\u003e“Jake, please let’s not do this.” I stand up, reaching for him. “I don’t want to fight.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well I do.”\u003c/p\u003e\n\u003cp\u003eHe storms off into living room.\u003c/p\u003e\n\u003cp\u003eI get out of my chair, and follow him in.\u003c/p\u003e\n\u003cp\u003e“You’re being unfair,” I say, from behind him.\u003c/p\u003e\n\u003cp\u003eStuart looks up from the laptop.\u003c/p\u003e\n\u003cp\u003e“I’m being unfair?!” Jake rounds on me.\u003c/p\u003e\n\u003cp\u003e“Yes. You’re acting like a spoilt child who can’t get his own way.”\u003c/p\u003e\n\u003cp\u003eStuart gets out of his seat and quietly slips across the room, and out the main door. I don’t blame him. I wish I could leave too.\u003c/p\u003e\n\u003cp\u003e“Yeah, and you’re acting like someone who still has feelings for her ex! Are we really back there again Tru? You stuck between me and Will again? Do you want to go back to him?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-41.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
