{"id":97894,"no":43,"title":"Page 43","content":"\u003cp\u003eDave drives the car down Avenue du Général Lemonnier and enters the underground parking garage of the Louvre. A space nearest the lifts has been reserved for us, and there is an attendant already waiting to meet us.\u003c/p\u003e\n\u003cp\u003eOkay, so let this begin.\u003c/p\u003e\n\u003cp\u003eDave parks up and he and Ben get out of the car.\u003c/p\u003e\n\u003cp\u003eBen opens Jake’s door.\u003c/p\u003e\n\u003cp\u003e“You ready?” Jake asks me.\u003c/p\u003e\n\u003cp\u003eI can’t seem to answer. I’m frozen to my seat. In truth I’m scared and even more so now we’re here.\u003c/p\u003e\n\u003cp\u003eI’ve been living in a bubble with Jake. Our relationship this last week has been just him and I cocooned, despite all the Will stuff. Now we’re about to go out in public together and everyone will know I’m Jake Wethers’ girlfriend, and then it won’t just be him and me anymore. His world will become a part of us.\u003c/p\u003e\n\u003cp\u003eAnd I’m worried that it might take over.\u003c/p\u003e\n\u003cp\u003e“Give us a minute,” Jake says to Ben, grabbing the door, he closes it.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” he asks, turning to me, his gaze worried.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I shrug, finding my voice. “I guess it’s all just got a little real now, and I don’t mean us,” I add at his worsening expression. “I just mean you, who you are, the world you live in. The one I’m about to become a part of.”\u003c/p\u003e\n\u003cp\u003eHe looks at me puzzled. “Tru, you’ve known all along how my life is.”\u003c/p\u003e\n\u003cp\u003eI take a deep breath. “I know, I guess … it’s just this – us going on our first date, and we have to bring Dave and Ben along with us, and Stuart has to call ahead to prepare them for your arrival – at the Louvre for god’s sake! That’s how famous you are, and it just feels … a lot crazy. And a little un-date like,” I add quietly, wringing my hands together in my lap.\u003c/p\u003e\n\u003cp\u003e“It is crazy, baby.” He takes hold of my hands, trying to soothe my tension. “And it’s a part of my life, granted – but not all of it. I know this part isn’t great and I’m sorry if this doesn’t feel like a date.” His lips turn down at the corners. “But I’ve never been on one before, so I’m kind of new to all this. You’re gonna have to help me out with this stuff, okay?”\u003c/p\u003e\n\u003cp\u003e“Of course I’ll help … I’m just – I guess I’m just a little scared.”\u003c/p\u003e\n\u003cp\u003e“What of?” He looks concerned again.\u003c/p\u003e\n\u003cp\u003e“The fact that my life is going to change, majorly, by being with you, and because of that, I might not be able to do things I used to.”\u003c/p\u003e\n\u003cp\u003e“Don’t be scared.” He tucks my hair behind my ear. “Nothing will change for you – I promise. I’ll make sure your life stays exactly the same, just with the added bonus of me in it.” He grins. “And this here today is a small thing. The people who come to the Louvre won’t have a care or a clue about who I am.”\u003c/p\u003e\n\u003cp\u003e“Yeah ‘cause art fans never listen to music, Jake.” I raise my eyebrow at him. “Everyone knows who you are.”\u003c/p\u003e\n\u003cp\u003e“Not everyone. I bet there are millions of people who don’t know me. And I bet every single one of them is in the Louvre today.”\u003c/p\u003e\n\u003cp\u003e“You’re an idiot,” I say, laughing.\u003c/p\u003e\n\u003cp\u003e“Takes one to know one.”\u003c/p\u003e\n\u003cp\u003e“It does.” I put my hand against his warm cheek. “I love you.”\u003c/p\u003e\n\u003cp\u003e“I love you too, and everyone else will love you when they get to know you.”\u003c/p\u003e\n\u003cp\u003e“Except for your legions of female fans.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, maybe not them,” he grins.\u003c/p\u003e\n\u003cp\u003eI roll my eyes at him.\u003c/p\u003e\n\u003cp\u003e“But they will love you when they see how happy you make me … and you do, Tru – make me happy – you always did. I don’t know how I coped all those years without you.”\u003c/p\u003e\n\u003cp\u003e“Jonny,” I say gently.\u003c/p\u003e\n\u003cp\u003eHe looks down.\u003c/p\u003e\n\u003cp\u003e“Hey, I didn’t mean to upset you.” I put my fingers under his chin, touching his scar, as I lift his head.\u003c/p\u003e\n\u003cp\u003e“You didn’t.” He meets my eyes. “It just makes me sad that Jonny’s never going to get the chance to feel about a girl, like I do you.”\u003c/p\u003e\n\u003cp\u003e“Then we’re just gonna have to live it twice as large for him.” I lean in and kiss his lips gently. “Come on, superstar. Let’s get this show on the road.”\u003c/p\u003e\n\u003cp\u003eJake holds my hand tightly, as we walk toward the lift, us being led by the attendant and Dave, with Ben walking behind us.\u003c/p\u003e\n\u003cp\u003eI feel like I’m under armed guard because I’m carrying a precious cargo into the Louvre.\u003c/p\u003e\n\u003cp\u003eIt’s so surreal.\u003c/p\u003e\n\u003cp\u003eWe all ride up in the lift in silence. It’s making me a little fidgety.\u003c/p\u003e\n\u003cp\u003eWe get out on the first floor, and standing outside the lift is a smartly dressed man, tall, dark wavy hair, and obviously waiting for us.\u003c/p\u003e\n\u003cp\u003e“Mr. Wethers,” he says, stepping forward as we exit the lift. “I’m Alexander Baudin. It is very good to meet you. We are absolutely delighted to have you visit us here at the Louvre today.”\u003c/p\u003e\n\u003cp\u003eHis English is excellent, although heavily accented and very sexy sounding.\u003c/p\u003e\n\u003cp\u003eJake shakes his outstretched hand. “Call me Jake, please, and this is my girlfriend, Trudy Bennett.”\u003c/p\u003e\n\u003cp\u003e“Lovely to meet you, Ms. Bennett,” Alexander Baudin says, taking hold of my hand to shake.\u003c/p\u003e\n\u003cp\u003e“So what were you looking to see today?” Alexander Baudin asks, walking forward. We follow.\u003c/p\u003e\n\u003cp\u003e“This wing of the Louvre we are currently in is where some of our many prints, drawings and paintings are home too. The likes of The Young Beggar, and of course our resident lady, the Mona Lisa.” He turns, smiling at us. “I am happy to accompany you today, give you a guided tour.”\u003c/p\u003e\n\u003cp\u003e“Thank you for the offer, but we’ll be fine,” Jake says, coming to a stop. “I’m sure you’re a busy man and I don’t want to interrupt your day.”\u003c/p\u003e\n\u003cp\u003e“It is no problem,” Alexander Baudin smiles.\u003c/p\u003e\n\u003cp\u003e“I appreciate the offer,” Jake says kindly, leaning closer to him. “But I’m here on a date with my girl, and we have enough company as it is.” Jake tilts his head in Dave and Ben’s direction, who are loitering nearby.\u003c/p\u003e\n\u003cp\u003e“Ah, I understand,” Alexander Baudin says in a lowered voice, nodding. “Here is a guide of the Louvre.” He pulls a leaflet from the inside of his jacket pocket and hands it to Jake.\u003c/p\u003e\n\u003cp\u003e“I hope the both of you enjoy your day here, and if you need anything at all, please let me know.”\u003c/p\u003e\n\u003cp\u003e“We will, thanks,” Jake says.\u003c/p\u003e\n\u003cp\u003eAlexander Baudin smiles at us both once more, and departs.\u003c/p\u003e\n\u003cp\u003e“Okay, baby, so where to first?” Jake says, opening out the guide for the Louvre.\u003c/p\u003e\n\u003cp\u003eWe’ve been in the Louvre for just over an hour looking at paintings. We haven’t got very far because there are so many, and I keep getting stuck, because some of them are truly amazing, so very beautiful, and I’ve been feeling quite emotional just looking at them.\u003c/p\u003e\n\u003cp\u003eIt makes me wish I could create something so wonderful.\u003c/p\u003e\n\u003cp\u003eI don’t think Jake’s as taken with them as I am though. If the wall was covered with guitars he’d probably be more interested, but I love that he’s showing a keen interest for me.\u003c/p\u003e\n\u003cp\u003eAnd he’s being so lovely, so attentive, constantly touching me, holding my hand, and I’m having the best time with him.\u003c/p\u003e\n\u003cp\u003eI’m just ignoring the fact that Dave and Ben are following us, and that we are getting stares from people who either recognise Jake immediately, or recognise him but are not sure where from.\u003c/p\u003e\n\u003cp\u003eIt’s not too horrendous; weird, but bearable.\u003c/p\u003e\n\u003cp\u003eI hear a phone ringing, and turning, I see Dave pulling his phone from his pocket.\u003c/p\u003e\n\u003cp\u003eHe turns away from us to take the call.\u003c/p\u003e\n\u003cp\u003eI focus back on the painting in front of me, ‘Woman With A Mirror’.\u003c/p\u003e\n\u003cp\u003e“This painting is so beautiful,” I say to Jake. “I think it’s my favourite so far.”\u003c/p\u003e\n\u003cp\u003e“It’s not as beautiful as you,” he whispers in my ear from behind, sliding his arms around my waist.\u003c/p\u003e\n\u003cp\u003e“You’re such a charmer,” I laugh, resting my head back against his chest.\u003c/p\u003e\n\u003cp\u003e“Jake,” Dave comes over. “That was Stuart on the phone. There’s some pictures of you and Tru, here in the Louvre which have just hit the networking sites, and they\u0027re doing the rounds, making it to the paps sites. I just wanted to let you know things could get a little busy when we’re leaving.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Jake says, sighing.\u003c/p\u003e\n\u003cp\u003e“What does he mean – busy?” I turn to face Jake.\u003c/p\u003e\n\u003cp\u003e“It means there’s a high probability there will be paparazzi waiting for us outside when we leave.”\u003c/p\u003e\n\u003cp\u003eMy stomach knots.\u003c/p\u003e\n\u003cp\u003e“How did they get pictures of us?”\u003c/p\u003e\n\u003cp\u003e“Camera phones, baby.”\u003c/p\u003e\n\u003cp\u003e“Gotta love technology.” There goes our lovely date.\u003c/p\u003e\n\u003cp\u003eI start to chew on my lip.\u003c/p\u003e\n\u003cp\u003e“Should we leave now?” I ask.\u003c/p\u003e\n\u003cp\u003e“No.” Jake shakes his head. “Just forget about it, I want to keep enjoying my day with you.”\u003c/p\u003e\n\u003cp\u003e“But what if we get mobbed?” My voice has gone a little shrill. In all honesty, I’m starting to freak out.\u003c/p\u003e\n\u003cp\u003e“We won’t get mobbed,” he chuckles, tucking my hair behind my ear. “And if we did, that’s what Dave and Ben are here for. They’re very good at their job, Tru. The best in the business, and that’s why I have them working for me. You’re completely safe, don’t worry.”\u003c/p\u003e\n\u003cp\u003eI don’t feel safe. I suddenly feel exposed and vulnerable.\u003c/p\u003e\n\u003cp\u003eIs this how it’s always going to feel? The thought haunts me a little.\u003c/p\u003e\n\u003cp\u003e“Come on,” Jake says, taking me by the hand. “We’ve got a lot more of this place to see.”\u003c/p\u003e\n\u003cp\u003eI let him lead me along, but I’m not interested in the paintings anymore. I just feel tense and have visions of getting mobbed by hoards of screaming girls and the paparazzi, and I can’t let go of the feeling.\u003c/p\u003e\n\u003cp\u003eAfter another fifteen minutes and a little further into the Louvre, I’m starting to notice the volume of people near us increasing.\u003c/p\u003e\n\u003cp\u003eDave and Ben obviously notice too, as they have moved in closer to us.\u003c/p\u003e\n\u003cp\u003eWhere we had space before, now we have very little.\u003c/p\u003e\n\u003cp\u003eI can feel Jake getting tense.\u003c/p\u003e\n\u003cp\u003eI don’t think it’s because the attention gathering is bothering him, I think he’s frustrated because he knows it’s bothering me, and he just wanted us to have today together.\u003c/p\u003e\n\u003cp\u003eOur first date together, we are now sharing with not only Dave and Ben, but about fifty other people.\u003c/p\u003e\n\u003cp\u003eA member of the security staff from the Louvre comes over and speaks quietly to Dave.\u003c/p\u003e\n\u003cp\u003eThe security guy stands back, staying with us, and that only causes to make me feel even more edgy than I already do.\u003c/p\u003e\n\u003cp\u003eDave makes a quick call, then comes over and speaks into Jake’s ear.\u003c/p\u003e\n\u003cp\u003eJake moves back away from me to listen to what Dave has to say.\u003c/p\u003e\n\u003cp\u003eI’m trying to focus on the painting before me, but I can’t. I don’t even know what this one is called. I’ve barely taken it in.\u003c/p\u003e\n\u003cp\u003eI’m trying to ignore the eyes around me, but my whole body feels like it’s on fire, burning under their scrutiny.\u003c/p\u003e\n\u003cp\u003eI don’t think I’m cut out for this.\u003c/p\u003e\n\u003cp\u003eI hear Jake sigh loudly, then see him nod his head to Dave.\u003c/p\u003e\n\u003cp\u003eHe comes over to me, standing in front of me, he takes my hands and says in a quiet voice, “Baby, the paps are here, outside … they’ve somehow found out which car is ours in the parking garage, and … there’s a load of them waiting out there for us.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-43.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
