{"id":97899,"no":48,"title":"Page 48","content":"\u003cp\u003eSimone tells me all about Denny and what’s been happening with them since she got back home form Paris.\u003c/p\u003e\n\u003cp\u003eBy the sounds of things, absence is definitely making the heart grow fonder in their case.\u003c/p\u003e\n\u003cp\u003eShe is totally smitten. And I’m so happy for her.\u003c/p\u003e\n\u003cp\u003eBut it’s making me miss Jake even more, hearing her talk about missing Denny.\u003c/p\u003e\n\u003cp\u003eI’ve been away from Jake for just over half a day and it’s already hurting like a bitch. So lasting a week just doesn’t feel like a physical possibility at the moment. I feel like I’m missing one of my limbs.\u003c/p\u003e\n\u003cp\u003eBut I’m going to do my very best to hold out for as long as I can, because it’s healthy for us to have time apart.\u003c/p\u003e\n\u003cp\u003e“So how was it leaving, Jake?” Simone asks, picking her wine up and taking a sip.\u003c/p\u003e\n\u003cp\u003e“Horrible. Hard. Teary.”\u003c/p\u003e\n\u003cp\u003e“You’re seeing him in a week though?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I nod. I take a sip of my own wine, then put my glass down and take a deep breath. “Jake has asked me to move in with him.”\u003c/p\u003e\n\u003cp\u003eShe splutters on her wine. “Seriously?”\u003c/p\u003e\n\u003cp\u003e“Seriously. He’s asked me to move to LA to live with him.”\u003c/p\u003e\n\u003cp\u003e“Wow,” she says. “So are you going to?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I shrug. “It’s a lot to think about. I love living here with you. I love working at the magazine. I love Vicky. My folks are here in the UK. I just don’t know.”\u003c/p\u003e\n\u003cp\u003e“You love him?”\u003c/p\u003e\n\u003cp\u003eI meet her eyes. “Like no one before. I always have.”\u003c/p\u003e\n\u003cp\u003e“Then you have your answer,” she says softly.\u003c/p\u003e\n\u003cp\u003eI drag my hands through my hair, trying to compile a coherent sentence, but nothing’s coming, except for that she’s right.\u003c/p\u003e\n\u003cp\u003eAdele starts singing on the coffee table. One quick glance at my phone tells me it’s Jake.\u003c/p\u003e\n\u003cp\u003eI haven’t heard from him all day as he’s been on his flight back to LA. He must have just landed.\u003c/p\u003e\n\u003cp\u003e“I was gonna go call Denny anyway,” Simone smiles, getting to her feet. “Say hi to Jake for me.”\u003c/p\u003e\n\u003cp\u003e“Hey, baby,” I murmur, answering.\u003c/p\u003e\n\u003cp\u003e“Come to LA. Now. Please. I’ll send the jet for you.”\u003c/p\u003e\n\u003cp\u003e“A simple, ‘I miss you, Tru’, would have done.” I start to chew on my thumbnail.\u003c/p\u003e\n\u003cp\u003e“I miss you, Tru. Too much. Now will you please come to LA? I’m going nuts here without you.”\u003c/p\u003e\n\u003cp\u003e“It’s only been what – thirteen hours.”\u003c/p\u003e\n\u003cp\u003eI’m not going to admit to him I’m going nuts without him too.\u003c/p\u003e\n\u003cp\u003e“Twelve, and you’re not missing me?” His voice is laced with hurt.\u003c/p\u003e\n\u003cp\u003e“I am. Like you’ll never know. Worse than I did when we were kids.”\u003c/p\u003e\n\u003cp\u003e“So why are we even doing this?”\u003c/p\u003e\n\u003cp\u003e“Because it’s healthy to spend time apart.”\u003c/p\u003e\n\u003cp\u003e“That’s just Cosmo bullshit. Tru … baby, please, I miss you so much, I can’t even begin to explain. I hate that I’m not with you right now,” he sighs. “Okay, that’s it.” He sounds suddenly alert. “I’m cancelling the PR stuff for the tour. If you won’t come to me then I’m coming to you.”\u003c/p\u003e\n\u003cp\u003e“You can’t do that!” I exclaim. But I love that he wants to.\u003c/p\u003e\n\u003cp\u003e“I’m the boss. I can do whatever I want.”\u003c/p\u003e\n\u003cp\u003e“Jake, the tour, it’s important to you and the guys.”\u003c/p\u003e\n\u003cp\u003e“Tom and Denny can do the PR rounds, which means I can be with my girl until the tour starts back up.”\u003c/p\u003e\n\u003cp\u003e“You’re talking crazy,” I giggle.\u003c/p\u003e\n\u003cp\u003e“The only crazy thing I’ve done was let you go earlier, at the airport. I spent twelve years away from you, Tru. No more. You won’t come to LA then I’m coming to you.”\u003c/p\u003e\n\u003cp\u003eI trace my fingertip over a groove in the coffee table. “I never said I wouldn’t come to LA.”\u003c/p\u003e\n\u003cp\u003eThere’s silence down the line. I can hear his shallow breathing. “You’ll move in with me?” His voice is soft, tentative.\u003c/p\u003e\n\u003cp\u003eI take a deep breath. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Baby, you have no idea how happy you’ve just made me, or how happy I’m going to make you.” I can practically feel his smile down the line.\u003c/p\u003e\n\u003cp\u003e“Jake, you already make me happy. All I need is you. I have you, I’m the happiest girl in the world.”\u003c/p\u003e\n\u003cp\u003e“When will you come?”\u003c/p\u003e\n\u003cp\u003e“Give me this week to sort things out here, and then I’m all yours for good. I just need to figure work stuff out with Vicky. Figure the flat stuff out with Simone, and tell my folks of course.”\u003c/p\u003e\n\u003cp\u003e“Your dad is going to kick my ass for taking you away from him isn’t he?”\u003c/p\u003e\n\u003cp\u003e“I’d say it’s quite likely,” I laugh.\u003c/p\u003e\n\u003cp\u003e“I’ll take his ass-kicking if it means I get you here with me … so I just have to spend this week away from you, then your mine, for good?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Okay. I can live with that … just,” he adds.\u003c/p\u003e\n\u003cp\u003eWe spend the next few hours on the phone making plans, talking nonsense like Jake and I do, and I love it.\u003c/p\u003e\n\u003cp\u003eEventually I hang up the phone with him, with much reluctance, but I need to sleep as the jetlag finally catches up with me.\u003c/p\u003e\n\u003cp\u003eI go to bed, thinking about how I’m going to be quitting my job and moving to LA, and also that I’m going to have to find a job once I’m out there. I’m not sponging off Jake. I’ve got some savings so they should tide me over until I can get sorted with a job. I wonder if Vicky has any magazine contacts out there? Jake will have, but I’m not having his influence getting me a job. I want to do this on my own.\u003c/p\u003e\n\u003cp\u003eAnd I fall asleep thinking of Jake, and all the amazing things we have to look forward to together.\u003c/p\u003e\n\u003cp\u003eLife doesn’t get any better than this, as it is right now.\u003c/p\u003e\n\u003cp\u003eI wake to the sound of Adele singing. It takes me a minute to grasp my bearings.\u003c/p\u003e\n\u003cp\u003eI’m in my flat. In my own bed.\u003c/p\u003e\n\u003cp\u003eI squint at the clock – 4am.\u003c/p\u003e\n\u003cp\u003eGrabbing my phone off my nightstand, I see it’s Jake.\u003c/p\u003e\n\u003cp\u003e“Baby, I miss you too, but it’s 4 am.”\u003c/p\u003e\n\u003cp\u003e“Tru.”\u003c/p\u003e\n\u003cp\u003eI instantly know something is wrong by the broken sound in his voice.\u003c/p\u003e\n\u003cp\u003e“Jake, what’s wrong?” I sit up in bed, concerned, my stomach tying into a thousand knots.\u003c/p\u003e\n\u003cp\u003e“Tru, it’s–it’s my dad … he’s dead.”\u003c/p\u003e\n\u003cp\u003eMy heart stops in my chest.\u003c/p\u003e\n\u003cp\u003e“Paul?” I ask, clarifying he doesn’t mean his step-dad Dale.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eJake hasn’t seen his dad since he was nine that I know of. And their history … well it’s complicated, difficult, and right now I’m unsure which way he’s going to go with this.\u003c/p\u003e\n\u003cp\u003eSadness or relief?\u003c/p\u003e\n\u003cp\u003e“Baby, I’m so sorry,” I say tentatively.\u003c/p\u003e\n\u003cp\u003e“It’s fine. I mean, he’s dead, and I hadn’t seen him since … so, you know…”\u003c/p\u003e\n\u003cp\u003e“I know,” I breathe. “I’ll come to you now. I’m getting the next flight to LA.” I start to climb up out of bed.\u003c/p\u003e\n\u003cp\u003e“No. It’s fine. I’m fine. I have to come to the UK, for his funeral.”\u003c/p\u003e\n\u003cp\u003e“You’re going?”\u003c/p\u003e\n\u003cp\u003e“He was my dad, Tru.” His tone is sharp.\u003c/p\u003e\n\u003cp\u003e“I know. I’m sorry. I didn’t mean–”\u003c/p\u003e\n\u003cp\u003e“No, I’m sorry,” he backtracks. “My head’s just a little fucked up right now.” He sighs. “I just need you, Tru.”\u003c/p\u003e\n\u003cp\u003e“I wish I was with you. I’m so sorry I’m not.” I chastise myself for this whole time apart thing.\u003c/p\u003e\n\u003cp\u003e“When are you coming to the UK?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’ve chartered the jet for a midnight flight. I’ll be there early evening your time.”\u003c/p\u003e\n\u003cp\u003e“Where is the funeral being held?”\u003c/p\u003e\n\u003cp\u003eI have no clue where Jake’s dad has been for the last seventeen years.\u003c/p\u003e\n\u003cp\u003e“Manchester. In two days. I’m arranging it. There’s no one else to do it.”\u003c/p\u003e\n\u003cp\u003e“Leave it to me. You don’t want to be doing it, baby.”\u003c/p\u003e\n\u003cp\u003e“It’s okay, I mean Stuart’s helping–“\u003c/p\u003e\n\u003cp\u003e“I want to help.”\u003c/p\u003e\n\u003cp\u003e“Okay … um … speak to Stuart see what he needs.”\u003c/p\u003e\n\u003cp\u003e“I will … so should I meet you in Manchester?”\u003c/p\u003e\n\u003cp\u003e“No, I’m coming to London first. I need to see you … and the funeral\u0027s not ‘til Friday … is it okay if I stay with you at your place? I just–”\u003c/p\u003e\n\u003cp\u003e“Jake, you don’t even have to ask, I want you here. And the funeral, do you want me to come with you?”\u003c/p\u003e\n\u003cp\u003eI don’t want to presume he’ll want me there. I don’t want to presume anything at the moment.\u003c/p\u003e\n\u003cp\u003e“I can’t do it without you.”\u003c/p\u003e\n\u003cp\u003e“Then I’m there. It’s you and me now, Jake. And what about your mum? Is she coming to the funeral?”\u003c/p\u003e\n\u003cp\u003e“No.” His tone is curt.\u003c/p\u003e\n\u003cp\u003eIt’s understandable why Susie wouldn’t want to go, but I thought she would to support Jake.\u003c/p\u003e\n\u003cp\u003e“Okay,” I say, unsure what to say right now.\u003c/p\u003e\n\u003cp\u003eThere’s a pause between us before Jake speaks again.\u003c/p\u003e\n\u003cp\u003e“I need you, Tru.” I can hear his ragged breathing down the line.\u003c/p\u003e\n\u003cp\u003e“I’m here. I’m always here for you.”\u003c/p\u003e\n\u003cp\u003e“I know it’s late there, but will you stay on the phone with me?”\u003c/p\u003e\n\u003cp\u003e“Of course I will. So what do you want to talk about?”\u003c/p\u003e\n\u003cp\u003e“You and me. Our future. What we’re going to do together.”\u003c/p\u003e\n\u003cp\u003e“You mean you want me to talk about that house we’re going to build on an island in the Maldives that belongs just to us, and we’re going to live off the land like a pair of castaways.”\u003c/p\u003e\n\u003cp\u003e“I love you, Trudy Bennett.”\u003c/p\u003e\n\u003cp\u003e“And I love you, Jake Wethers.”\u003c/p\u003e\n\u003cp\u003e“So tell me more about this island?”\u003c/p\u003e\n\u003cp\u003eAnd I do. I stay on the phone with Jake until the sun rises, and it’s time for him to catch his flight to London.\u003c/p\u003e\n\u003cp\u003eI shower, dress, force a little bit of breakfast down, and then head into work taking the Tube.\u003c/p\u003e\n\u003cp\u003eI’m tired. I’ve had little sleep, but I couldn’t sleep at the moment if I tried, I’m too worried about Jake.\u003c/p\u003e\n\u003cp\u003eVicky beams brightly at me when I knock on her open door, then I watch as her face drops when she sees mine.\u003c/p\u003e\n\u003cp\u003e“What’s the matter, my darling?” she asks worried, getting out of her chair, coming over to me.\u003c/p\u003e\n\u003cp\u003e“Jake’s dad died.” My voice wobbles and I know I’m set to cry any minute now.\u003c/p\u003e\n\u003cp\u003eI’m not upset about Paul dying – not at all. I’m upset because Jake is.\u003c/p\u003e\n\u003cp\u003eI can feel his pain like it’s my own even though there’s an ocean between us.\u003c/p\u003e\n\u003cp\u003eHe hurts. I hurt.\u003c/p\u003e\n\u003cp\u003e“Oh, sweetness.” She puts her hands on my arms, looking searching into my face. “How is Jake doing?”\u003c/p\u003e\n\u003cp\u003eI shrug. “He hadn’t seen his dad in a long time. They had a ... difficult relationship … but honestly, I think it’s hit him pretty hard.”\u003c/p\u003e\n\u003cp\u003e“Come, let’s sit.” She guides me over to the little sofa in her office.\u003c/p\u003e\n\u003cp\u003e“I’m really sorry to do this to you again, Vicky … but I need to take some time off to be with Jake. He’s flying in today, and the funeral is in Manchester on Friday. Of course I’ll work from home, and I’ll catch up on whatever I miss before I go to the US for the rest of the tour.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-48.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
