{"id":97911,"no":60,"title":"Page 60","content":"\u003cp\u003eNo, don’t weaken. It’s just all part of his plan to trick his way back into my life.\u003c/p\u003e\n\u003cp\u003eHe had sex with another woman.\u003c/p\u003e\n\u003cp\u003eI think.\u003c/p\u003e\n\u003cp\u003eI don’t know.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I mumble.\u003c/p\u003e\n\u003cp\u003eWe stare at one another for a long moment. Adele stops singing in my hand, breaking it.\u003c/p\u003e\n\u003cp\u003e“Did you want something or…?” I pull nervously on the hem of my T-shirt, looking down away from his heavy stare.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, I uh … I brought your things.” He pulls a suitcase out just from behind the wall.\u003c/p\u003e\n\u003cp\u003eMy suitcase. The one I left in Boston. He’s kept it with him this whole time.\u003c/p\u003e\n\u003cp\u003eTo be honest I hadn’t really thought about what he’d done with it.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I say taking it from him. My fingers graze his in the exchange.\u003c/p\u003e\n\u003cp\u003eHeat sears painfully up my arm, coursing through my body, careening straight for my heart.\u003c/p\u003e\n\u003cp\u003eI wheel the case in, parking it up by the side of the door, desperately trying to control my feelings.\u003c/p\u003e\n\u003cp\u003e“So…um.” He brushes his hand through his hair again. “Do you need anything or…?”\u003c/p\u003e\n\u003cp\u003e“No, I’m fine. Thank you.”\u003c/p\u003e\n\u003cp\u003eThis is so hard. There’s no witty Jake banter. The ease that has always been between us is gone. It’s almost like we’re strangers. He’s not my Jake anymore, and it hurts beyond words.\u003c/p\u003e\n\u003cp\u003e“Okay.” He steps back. “So…I guess I’ll see you – tomorrow.”\u003c/p\u003e\n\u003cp\u003eHe’s leaving. A sinking feeling encompasses me. I don’t want him to go.\u003c/p\u003e\n\u003cp\u003eYes, I do.\u003c/p\u003e\n\u003cp\u003eComposing myself, I say, “Goodnight, Jake.”\u003c/p\u003e\n\u003cp\u003e“Goodnight, Trudy Bennett.” He smiles at me ruefully.\u003c/p\u003e\n\u003cp\u003eAs I start to close the door, he speaks again. “Tru?”\u003c/p\u003e\n\u003cp\u003eI open the door back up.\u003c/p\u003e\n\u003cp\u003e“It’s really good to see you again. You look…well.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” I force a painful smile. “You too.”\u003c/p\u003e\n\u003cp\u003eI close the door, shutting him out.\u003c/p\u003e\n\u003cp\u003eLeaning up against it, catching the breath I didn’t know I was holding, I slide down, sinking to the floor, under the weight of the grief which is crushing me.\u003c/p\u003e\n\u003cp\u003eThis is so much harder than I could have ever thought.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath I attempt to steady my emotions.\u003c/p\u003e\n\u003cp\u003eIt’s just one day Tru, that’s all. Get through tomorrow and the show, then your flight is booked for straight afterwards, and you’re home free.\u003c/p\u003e\n\u003cp\u003eOr am I? Will I ever truly be free of Jake when he’s already worked so deeply into my heart.\u003c/p\u003e\n\u003cp\u003eAdele starts to sing in my hand. Lifting it up, I see I have a text.\u003c/p\u003e\n\u003cp\u003eJake:\u003c/p\u003e\n\u003cp\u003eWhen I said you looked well, what I really should have said was that you look beautiful. x\u003c/p\u003e\n\u003cp\u003eAnd there’s my Jake.\u003c/p\u003e\n\u003cp\u003eUnstoppable tears trickle from my eyes, as I start to drown in memories of him. The feel of his skin against mine, his kiss, the way he made love to me.\u003c/p\u003e\n\u003cp\u003eI don’t think I can do this. It’s too hard being around him.\u003c/p\u003e\n\u003cp\u003eNo, I can, it’s just twenty-four hours. Twenty-four tiny hours to get through.\u003c/p\u003e\n\u003cp\u003eBut even as I think it, fighting my internal battle, I don’t feel so sure anymore. And then my tears turn into full on sobs, and I keep crying until all I’m left with is dry heaves racking my body senseless.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eAfter Jake left last night, and I’d cried myself into a dried out puffy eyed state, I immersed myself in the humongous bath tub, staying in until the water went cold, thinking about Jake and what I was going to do.\u003c/p\u003e\n\u003cp\u003eAfter coming to no conclusion, leaving me exactly where I was before, I raided the minibar. I had a couple of glasses of wine in the hope they would help me sleep, and I climbed into the ginormous bed.\u003c/p\u003e\n\u003cp\u003eThe wine didn’t help me sleep as I had hoped, because sleeping in a bed like this without Jake, just felt wrong. Empty and so very lonely.\u003c/p\u003e\n\u003cp\u003eIt just made me miss him even more than I already do.\u003c/p\u003e\n\u003cp\u003eAll I could think was that he was here in the hotel somewhere. Somewhere close. And knowing I could pick my phone up and call him, and I would be laid in his arms within minutes made it all the more harder.\u003c/p\u003e\n\u003cp\u003eThe anger I’d been so desperately clinging to skipped out on me, leaving me with raw emotion.\u003c/p\u003e\n\u003cp\u003eI knew seeing Jake again would be hard, but I underestimated just how hard.\u003c/p\u003e\n\u003cp\u003eSeeing him stood there exposed me to my feelings in a blast, the ones I’ve been so desperately trying to hide from this last week. I was forced to feel the complete and utter intensity of them, and it’s been bleeding the hell out of me ever since.\u003c/p\u003e\n\u003cp\u003eSo after spending the night listening to Cyndi Lauper’s, ‘Time After Time’ on loop on my new iPhone, crying along with the lyrics, I finally cried myself to sleep for a few hours. And now I find myself at 6am sitting at a table in the hotel restaurant, drinking coffee just for the want of something to do.\u003c/p\u003e\n\u003cp\u003eI look a puffy eyed, tired mess, but I don’t care.\u003c/p\u003e\n\u003cp\u003eAs it’s so early breakfast has only just started to be served, so I’m alone in here with only the waiting staff for company. Exactly as I want it.\u003c/p\u003e\n\u003cp\u003eI nabbed a newspaper on the way in to read to keep my mind occupied. It’s the New York Times, and I’m reading the business pages avoiding anything remotely entertainment wise in case there is something about Jake in here.\u003c/p\u003e\n\u003cp\u003eScanning my eyes over the text about the ever rising price of gasoline, I feel a presence beside me. Looking up I expect to see the waiter, but it’s Jake.\u003c/p\u003e\n\u003cp\u003eMy heart jumps up in my chest, straight out of my mouth and makes a bolt for the door.\u003c/p\u003e\n\u003cp\u003e“Hi,” he says. His voice sounds rough and smooth like only his can. “You mind if I join you?”\u003c/p\u003e\n\u003cp\u003eHe smells strongly of cigarettes. He must have literally just had a smoke.\u003c/p\u003e\n\u003cp\u003eSwallowing my heart back down, I utter, “Um, no, of course not.”\u003c/p\u003e\n\u003cp\u003eJake takes the seat opposite me at the table, and I’m struggling to keep my eyes off him.\u003c/p\u003e\n\u003cp\u003eHe looks like he hasn’t had much sleep. His normally light eyes look dark, and his hair has that ruffled up look it gets when he’s worried about something and has been driving his fingers repeatedly through it.\u003c/p\u003e\n\u003cp\u003eIt makes me want to reach my hand out and smooth it down, and soothe him.\u003c/p\u003e\n\u003cp\u003eI press my palms flat to the table.\u003c/p\u003e\n\u003cp\u003e“Have you already ordered?” he indicates to my half-drunk coffee.\u003c/p\u003e\n\u003cp\u003e“Only the coffee.”\u003c/p\u003e\n\u003cp\u003e“Are you eating?”\u003c/p\u003e\n\u003cp\u003eI shake my head, no, in response, resting my eyes back on the newspaper.\u003c/p\u003e\n\u003cp\u003e“You look like you’ve lost weight.”\u003c/p\u003e\n\u003cp\u003eMy eyes snap up to his. “Are you saying I was fat before?”\u003c/p\u003e\n\u003cp\u003eHere she is, Tru who wants to pick a fight with Jake. I was wondering when she’d show up. Apparently, at 6am in a hotel restaurant.\u003c/p\u003e\n\u003cp\u003e“No, of course not.” He shakes his head, looking helpless. “I was just … trying to make conversation, I guess…” he trails off.\u003c/p\u003e\n\u003cp\u003e“Well don’t.”\u003c/p\u003e\n\u003cp\u003e“You don’t want to talk?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eMy eyes go back to the paper, desperately trying to focus on the text, but now all I can feel is my anger and rage heating in my blood, bubbling up, and I just want to yell at him.\u003c/p\u003e\n\u003cp\u003e“Do you want me to leave?” he asks in a soft voice, tracing his fingertip over the table cloth.\u003c/p\u003e\n\u003cp\u003eAnd that’s all he has to say and I’m over the edge.\u003c/p\u003e\n\u003cp\u003e“Does it matter what I want?!” I hurl at him.\u003c/p\u003e\n\u003cp\u003eHis brow furrows. “Of course is does.”\u003c/p\u003e\n\u003cp\u003e“No it doesn’t! If it did then I wouldn’t be here right now having this conversation with you. I’d be home, getting on with my life.”\u003c/p\u003e\n\u003cp\u003e“Tru…” He reaches his hand across the table, trying to take mine, but I snatch it away before he gets chance.\u003c/p\u003e\n\u003cp\u003e“Why are you here?” I give him the coldest look I can muster up. “Did you just come down here to torture me some more – more than you already have?”\u003c/p\u003e\n\u003cp\u003e“Torture you?” He looks seriously pissed off at that statement.\u003c/p\u003e\n\u003cp\u003e“Yes!” I bang my hands on the table. “Torturing me, forcing me to be around you after what you did!”\u003c/p\u003e\n\u003cp\u003e“I didn’t–”\u003c/p\u003e\n\u003cp\u003e“I don’t want to hear it!” I cry, getting to my feet.\u003c/p\u003e\n\u003cp\u003eMy heart is pumping so fast, so hard, and blood is roaring in my ears. I start to walk away from the table, and him.\u003c/p\u003e\n\u003cp\u003e“WILL YOU JUST STOP AND FUCKIN’ LISTEN TO ME!” he roars, standing so abruptly that his chair falls out behind him, banging to the floor.\u003c/p\u003e\n\u003cp\u003eI blanch.\u003c/p\u003e\n\u003cp\u003eHis voice is so all-consuming that everything in the room stops moving.\u003c/p\u003e\n\u003cp\u003eMe. Time. Air. Everything.\u003c/p\u003e\n\u003cp\u003eJake’s chest is pumping up and down angrily, his T-shirt rising and falling with each breath.\u003c/p\u003e\n\u003cp\u003eI don’t think I’ve ever seen him so angry.\u003c/p\u003e\n\u003cp\u003eMomentarily stunned, I falter, but then I very quickly come back to life.\u003c/p\u003e\n\u003cp\u003eTurning on the spot, I state, “No, I won’t bloody stop and listen to you because I’m not interested in a damn thing you have to say!” I curse the betrayal my voice does when it quivers slightly.\u003c/p\u003e\n\u003cp\u003e“Jesus fuckin’ Christ woman!” he growls. “You’re so stubborn! And you will listen to me if I have to tie you to that fuckin’ chair, to do so!” He jabs a finger in the direction of the seat my ass just graced moments ago. “And I will keep on saying this until you hear me – I did not have sex with that girl, and I most certainly did not have an affair with her! I fuckin’ love you, Tru! More than life itself! I would never do that to you! Now are you hearing any of this yet?!” He lifts his hands to his head in frustration. “Is any of this getting through to your stubborn ass brain?!”\u003c/p\u003e\n\u003cp\u003eHe looks so angry and frustrated, and lost.\u003c/p\u003e\n\u003cp\u003eBut then so am I.\u003c/p\u003e\n\u003cp\u003eI fold my arms across my chest. “Words, Jake. That’s all they are. I believe in facts, statistics and logic.” I’m throwing words at him, trying to confuse him, or maybe me, I’m not sure, all I do know is right now I sound like Vicky.\u003c/p\u003e\n\u003cp\u003e“What?!” he seethes, jaw clenched, brow furrowed.\u003c/p\u003e\n\u003cp\u003e“I believe what I saw!”\u003c/p\u003e\n\u003cp\u003e“No, you believe what you think you saw!”\u003c/p\u003e\n\u003cp\u003e“Are you telling me I didn’t walk in on you in bed with her?”\u003c/p\u003e\n\u003cp\u003e“No, I just–”\u003c/p\u003e\n\u003cp\u003e“So then I saw right.”\u003c/p\u003e\n\u003cp\u003e“NO!”\u003c/p\u003e\n\u003cp\u003e“YES!” I wrap my hand around my ponytail, tugging on it hard, like the ache of that will take all of my anger and frustrations away.\u003c/p\u003e\n\u003cp\u003e“Nothing you can say or do will change my mind on this,” I continue in a low, firm tone. “I believe what I saw – now if you’re quite done I’m going back to my room.”\u003c/p\u003e\n\u003cp\u003eI step back, but he stops me with his words.\u003c/p\u003e\n\u003cp\u003e“I’m not done.” He sounds so authoritative, so angry, that I pale and I literally can’t move.\u003c/p\u003e\n\u003cp\u003eHe stalks around the table, coming close to me. His anger is radiating and it makes me want to step back, but I fight the urge.\u003c/p\u003e\n\u003cp\u003e“I won’t give up until you believe me, Tru,” he says low, leaning into my face. “I won’t stop fighting for you – for us. I want you back and I will keep on trying, with whatever methods I can, until you believe that I’m telling you the truth – that you forgive me for letting you down with the drugs, and that I have you back in my life again.”\u003c/p\u003e\n\u003cp\u003eGiving me one last determined stare, he turns abruptly and stalks out of the restaurant, leaving me trembling to the core, and alone with the stares of the waiting staff who were just witness to our fight. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-60.html","bookId":1998,"creation":"Oct 5, 2019 6:30:44 PM","modification":"Oct 5, 2019 6:30:44 PM"}
