{"id":42280,"no":12,"title":"Chapter 12","content":"\u0026nbsp;The copter rose serenely towards the heavenly vault. Ron\u0027s small body was feeling the effects of the day\u0027s strain. It collapsed against the leathery cushions, the short arms and legs limp and dangling. \n\u003cdiv\u003e\n The doctor patted his knee. \"Another few moments,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where are we going?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the spaceport in Winnipeg. I have a friend there. He has two children of his own, both born in the Mars Colony. He\u0027ll be returning there within the week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you want me to go with him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Ron. I want you to grow up all over again, and then return to Earth. It won\u0027t be easy for you, but there will be advantages. Your life span has been lengthened. And right now, you know, you\u0027re something of a prodigy yourself.\" He chuckled dryly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what happens here?\" Ron said bitterly. \"What kind of Earth will I find on my return?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An older Earth. Perhaps a wiser Earth....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, doctor.\" Ron forced himself to a sitting position. \"Not with the Scholar alive and thriving, growing stronger and more intelligent with every passing year. It\u0027ll be his Earth when I return....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor stared at the night sky before answering.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Ron. He\u0027ll never live to see it. I knew that when I selected your body to house his mind....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I chose you for a reason, Ron. A vital reason. When you came to my office on your return from Andromeda, I discovered something about you which made up my mind. An ailment without a name or a symptom, found only rarely in the bodies of a few space travelers. You had it, Ron, and in a year or two, it would have struck you down with the savagery and surprise of lightning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was then that I agreed to the Scholar\u0027s plan to exchange bodies. Agreed to it on my own terms, with the body of Ron Carver....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll die!\" Ron said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Ron. You will live. It\u0027s the Scholar who has made the bad bargain....\"\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3272/89526.html","bookId":513,"creation":"Aug 11, 2019 5:53:08 AM","modification":"Aug 11, 2019 5:53:08 AM"}
