{"id":42274,"no":6,"title":"Chapter 6","content":"\u0026nbsp;Ron Carver watched the back of the young boy\u0027s neck for twenty minutes, while he steered the ancient copter expertly across the skies. He figured that the boy might have been fourteen or fifteen, but there was a competence in the way his hands moved over the controls, and a steeliness in the way his head sat on his thin neck. \n\u003cdiv\u003e\n They didn\u0027t make much conversation, but Ron gathered that the boy was a member of something called the Red Rockets, an organization with some inexplicable purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was only after the copter had landed on the roof of a half-decayed slum in the worst part of town, that Ron realized who the Red Rockets were. They were kids, all of them, banded together for mutual defense and in common antagonism toward the world. When he clambered out of the copter, his rescuer grinned and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is it, pal. This is where the gang meets.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Red Rockets?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yeah. This is Shock\u0027s house. He\u0027s the leader.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They had to descend by stairs; there was no building elevator. When they reached the second floor, the boy put a finger to his lips, and rapped one-two, two-two on the apartment door.\n\u003c/div\u003e \n\u003cdiv\u003e\n A boy no older than Ron\u0027s new body opened it. His dark pinched face grew smaller and darker when he saw the stranger. He looked back into the room before letting them in.\n\u003c/div\u003e \n\u003cdiv\u003e\n The room was a study in decay. Someone had once wallpapered it in an optimistic pink pattern that was now sardonic in the surroundings. The furniture was rudimentary, and there were no working light fixtures. A battery lamp was sitting in the middle of a wooden table, and three youngsters were playing with a ragged deck of cards.\n\u003c/div\u003e \n\u003cdiv\u003e\n The tallest of them arose when the newcomers entered. He was the only one wearing a jacket; the others were in shirtsleeves. His hair was black, and unruly to the point of being ludicrous. His wide mouth twisted when he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s this?\" he said. \"What\u0027s the idea?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s okay,\" Ron\u0027s protector said. \"He\u0027s an okay kid. I spotted him on a rooftop down on Park. A million cops after him. I dropped down in the copter and picked him up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The tall boy studied Ron\u0027s face. \"What\u0027s your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ron.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What were the cops chasin\u0027 you for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron hesitated. \"Any of your business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The tall boy smiled. \"Maybe not.\" He looked towards the others, and winked as if pleased. \"Guess he\u0027s okay.\" He held his right hand out to Ron, while his left ducked into his jacket pocket. \"My name\u0027s Shock, pal. And I\u0027m the leader here. And just so\u0027s you don\u0027t forget it—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Pain lanced through Ron\u0027s arm and struck the base of his skull. He tried to free himself from the tall boy\u0027s grip, but his fingers wouldn\u0027t part from the other\u0027s flesh. He dropped to his knees in agony, until the grip was broken.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked up, his face damp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s your \u0027nitiation,\" the tall boy grinned. \"Now you know what\u0027s what, Ronnie boy. So if you want to join the Rockets, you\u0027ll know where your orders come from.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Shock helped him to his feet. \"Right, Ronnie boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron shook his head, still bewildered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good deal,\" Shock said. \"Now let\u0027s finish that game. You play, kid?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" Ron said. He staggered towards a wooden chair on the side of the room and dropped on it heavily. \"No,\" he repeated, still trying to regain his breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n Play the game....\n\u003c/div\u003e \n\u003cdiv\u003e\n His rescuer sat beside him. \"Don\u0027t mind that guy,\" he whispered. \"He does that to everybody. He got some kind of a power in his hands. But he\u0027s not a bad guy. Honest.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure,\" Ron said weakly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We get a lot of kicks,\" the boy said eagerly. \"You\u0027ll see. We have dogfights with the other gangs. With copters. We only got one, that ain\u0027t so much. But we\u0027re figurin\u0027 on gettin\u0027 some PF\u0027s next year, if we can collect enough dough in the treasury....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027ll be great,\" Ron said. Then he dropped his hand on the other\u0027s arm. \"Listen—is there any chance of takin\u0027 a trip? In the copter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yeah, sure,\" the boy said warily. \"Only you gotta ask for it in advance. I mean, it\u0027s Rocket property, and you gotta sign for it. And even then, if Shock wants to use it—well....\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\" Ron said. \"Why\u0027s that? Because he\u0027s the leader?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure,\" the boy said simply. \"That\u0027s the reason.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron looked across the room at the card players.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you get to be the leader?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I dunno. Shock\u0027s the leader \u0027cause he can lick anybody in the Rockets. That makes sense, don\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I suppose so.\" He chewed his lip. \"Listen. Let\u0027s say I was leader. Could I use the copter then? Any time I wanted?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure. I mean, if you\u0027re the leader, who\u0027s gonna stop you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" Ron said. He stood up and walked to the table, watching the cards as they were slapped on the wood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hey, Shock,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n The tall boy didn\u0027t look up. \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You cheat.\" A thrill ran through Ron\u0027s new body as he said it, and he muttered a small prayer that his guess about Shock\u0027s power was correct.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been watching you play, and you cheat. You don\u0027t even cheat good. You cheat sloppy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The tall boy stood up slowly, and the other chairs were scraped back in anticipation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now that\u0027s something,\" he said. \"That\u0027s really something! The kid\u0027s here ten minutes, and right away he wants to be buried.\" His face became grim. \"Boy, we\u0027ve had \u0027em wise before, pal. But never like this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron planted himself in front of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Shock\u0027s face clouded. \"Say, are you kidding? You really like trouble that bad?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n His right hand lashed out, while the left headed for his jacket pocket. But it wasn\u0027t the right that Ron avoided. Both of his short arms shot out towards the tall boy\u0027s left, and stopped the descent of the arm. Shock\u0027s right hand thudded against Ron\u0027s shoulder, the blow only stinging him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hey!\" Shock cried. \"Hey, you—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a triumph for Ron. He had been right about the electrical circuit woven through Shock\u0027s clothing, the circuit he couldn\u0027t complete without his left hand tripping the mechanism in his pocket. With the power off, Shock\u0027s weapon was useless. He was caught by surprise, and Ron\u0027s quick-moving hands tumbled him to the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before he had a chance to do anything else, Ron was upon him with an upraised chair. He closed his eyes before he swung. The sound of the crash might have sickened him in other circumstances; now it sounded good and satisfying.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron looked around the room, panting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m the leader now,\" he said. \"Understand? I\u0027m the leader!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The looked at each other uncertainly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m taking the copter for a while,\" Ron said, backing towards the door. \"Any arguments?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Nobody answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Swell. So long, pals.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Outside the door, he ran all the way back to the roof and was off before the gang could follow.\n\u003c/div\u003e \n\u003cdiv\u003e\n The trip took almost two hours. Even Ron\u0027s experienced guidance of the controls couldn\u0027t push the old copter past its limits, and he was keeping a worried eye on the fuel gauge. It was with a sigh of relief that he dropped the vehicle atop a public parking station in the downtown district, within walking distance of the Government Medical Center.\n\u003c/div\u003e \n\u003cdiv\u003e\n The sun was dropping fast, and the Washington streets were still filled with Sunday sightseers who found nothing odd in the sight of a solitary twelve-year-old. When he entered the enormous U-shaped edifice that housed a hundred and one government medical projects, he was thinking fast about a plausible story for the receptionist. The best he could do was:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m looking for Dr. Wilfred Minton. He—he\u0027s my uncle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dr. Minton?\" She was young, and the efficient type. \"I\u0027m sorry, but Dr. Minton\u0027s been on special assignment for some time. It\u0027s not easy to locate him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I know about that,\" Ron said airily. \"But I was supposed to see him today. You see, my mom—his sister that is—she was in a very bad accident....\" He swallowed hard, wondering if he was being believed.\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman frowned. \"Well, if it\u0027s an emergency, I suppose I could check with central control. If it\u0027s really important.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s important, all right!\" He said this with great conviction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, then.\" She picked up her telephone, and there was much transferring from party to party. Finally, she lowered the receiver, saying: \"He\u0027s in the east wing. It\u0027s Security territory, so I\u0027ll have to see about a pass.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It took another ten minutes for her to locate the authority she was seeking. A young man with crinkly hair and a grim expression came briskly to the desk, asked him a few questions, and then signed his name on a document. Ron put the paper into the pocket of his coveralls, and followed the man to a bank of private elevators.\n\u003c/div\u003e \n\u003cdiv\u003e\n The man waved him inside one, and he couldn\u0027t resist a wide-eyed question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gosh, mister. Are you from the FBI?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The man couldn\u0027t conceal a small pleased grin. \"That\u0027s right, son. Only you keep it a secret.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure,\" Ron said. When the door closed and the elevator ascended, he grinned too. Being twelve had its advantages sometimes.\n\u003c/div\u003e \n\u003cdiv\u003e\n He got off the elevator, and a uniformed guard checked his paper and led him into an anteroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wait here, son,\" he said, and left.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ron waited five minutes. When nothing happened, he tried an adjoining door. It was open. He stepped inside the next room, and saw that it was a bare room with nothing but a row of filing cabinets and an abandoned swivel chair with a definite list to port.\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to the files and peered at the designation cards.\n\u003c/div\u003e \n\u003cdiv\u003e\n They read:\n\u003c/div\u003e \n\u003cdiv\u003e\n PROJECT SCHOLAR.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shrugged, and tried to open the top file. It was locked. He tried the others, with no better luck.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he heard the voices in the anteroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n For some reason, he sensed danger. He knew he shouldn\u0027t be in the file room, that if he were found his visit to Dr. Minton might come to a sudden end. He couldn\u0027t take the chance. He tiptoed to the front door of the file room and turned the knob. He slipped out, and ran on his toes down the empty corridor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Quickly, without thought of the consequence, Ron opened still another door and closed it behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked at the shining brass fixtures and ultra modern appliances, and wondered what a kitchen was doing in a government medical building. Then, when he heard a sound in the adjoining room, he reasoned that he had stumbled into someone\u0027s living quarters.\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to a brown mahogany door and pushed against it gently, until he widened the crack sufficiently to make out the figure walking up and down in the other room.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the man crossed his line of vision, Ron\u0027s breath tumbled out in a gasp.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was his own body. His thirty-year-old body, with its six-foot-two frame of big bones and long muscles, its sandy, close-cropped hair, its brooding eyes and full mouth. It was Ron Carver. It was himself as he had been before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here\u0027s the little rascal,\" a voice said behind him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3272/89520.html","bookId":513,"creation":"Aug 11, 2019 5:53:08 AM","modification":"Aug 11, 2019 5:53:08 AM"}
