{"id":97109,"no":11,"title":"Page 11","content":"\u003cp\u003e\"That one. Tap it three times.\"\u003c/p\u003e\n\u003cp\u003eFaint lights traced the surface as the Chief touched it; they flared red and orange and finally cooled to brilliant blue.\u003c/p\u003e\n\u003cp\u003e\"It worked,\" Cortana said. \"NAV controls coming online. I can finally move this crate. Hang on.\"\u003c/p\u003e\n\u003cp\u003eThe ship spun to port. On the displays that still functioned, four more Covenant cruisers tracked them—and fired.\u003c/p\u003e\n\u003cp\u003eThe flagship accelerated, but the plasma torpedoes arced and followed them. \"No good,\" Cortana said. \"I can\u0027t overcome our inertia in this tub. They\u0027re going to hit us . . . unless I can get us into Slipspace.\"\u003c/p\u003e\n\u003cp\u003eA rhythmic warble pulsed from one of the displays. It flashed red.\u003c/p\u003e\n\u003cp\u003e\"Oh no,\" Cortana said.\u003c/p\u003e\n\u003cp\u003eThe leading plasma torpedo impacted. Dull red fire smeared across the viewscreens.\u003c/p\u003e\n\u003cp\u003e\"Oh no, what?\" Haverson demanded.\u003c/p\u003e\n\u003cp\u003e\"This ship\u0027s Slipspace generator is inert,\" Cortana replied.\u003c/p\u003e\n\u003cp\u003e\"The disabled NAV controls were a trick. It must have been the Covenant AI; it lured me here while the drive was physically de- coupled from the reactor. I can maneuver all I want, give orders to the Slipspace generator—but without the system powered up were not going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a Covenant AI?\" Haverson muttered, and raised an eyebrow.\u003c/p\u003e\n\u003cp\u003e\"Upload the coordinates to power coupling,\" the Master Chief said. \"I\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003eTwo more plasma torpedoes impacted and splashed across the shield. \"Energy shields collapsing,\" Cortana said. \"Brace!\"\u003c/p\u003e\n\u003cp\u003eThe last shot collided with the flagship. The hull heated, and plasma boiled layers of armor plating away. The ship rolled as plumes of superheated metal vapor outgassed.\u003c/p\u003e\n\u003cp\u003e\"Another hit like that will breach the hull,\" Cortana said.\u003c/p\u003e\n\u003cp\u003e\"Moving this tub at flank speed.\"\u003c/p\u003e\n\u003cp\u003e\"The power coupling coordinates, Cortana,\" the Master Chief insisted.\u003c/p\u003e\n\u003cp\u003eA route appeared on his heads-up display. The engineering rooms were twenty decks below the bridge.\u003c/p\u003e\n\u003cp\u003e\"Those won\u0027t do you any good,\" Cortana told him. \"There are bound to be Elite hunt-and-kill teams waiting for you. And even if you managed to remove them, there is no way to repair the power coupling in time. We don\u0027t have the tools or the expertise.\"\u003c/p\u003e\n\u003cp\u003eThe Master Chief looked around the bridge. There had to be a way. There was always a way— He leaned over the edge of the central platform and grabbed one of the Covenant Engineers that cowered below. He dragged it up by its float-sack. The creature squirmed and squealed.\u003c/p\u003e\n\u003cp\u003e\"Maybe we don\u0027t have the expertise,\" he said and shook the Engineer. \"But this thing does. Can you communicate with it?\u003c/p\u003e\n\u003cp\u003eTell it what we need?\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Then Cortana replied, \"There is an exten- sive communications suite in the Covenant lexic—\"\u003c/p\u003e\n\u003cp\u003e\"Just tell it I\u0027m taking it to fix something.\"\u003c/p\u003e\n\u003cp\u003e\"All right, Chief,\" Cortana said.\u003c/p\u003e\n\u003cp\u003eA stream of high-pitched chirps emanated from the bridge speakers, and the Engineer\u0027s six eyes dilated. It stopped squirm- ing and grabbed hold of the Master Chief with its tentacles.\u003c/p\u003e\n\u003cp\u003e\"It says \u0027good\u0027 and \u0027hurry,\u0027 \" Cortana told him.\u003c/p\u003e\n\u003cp\u003e\"Everyone else stay here,\" the Chief said.\u003c/p\u003e\n\u003cp\u003e\"If you insist,\" Haverson muttered, his face pale. Blood trickled from the wound in his chest.\u003c/p\u003e\n\u003cp\u003eThe Master Chief looked at Johnson and Locklear. \"Don\u0027t let the Covenant retake the bridge.\"\u003c/p\u003e\n\u003cp\u003e\"Not a problem, Chief,\" Sergeant Johnson said. He stopped to kick the dead Elite once in the teeth, then slapped a fresh clip into his MA5B. He yanked the weapon\u0027s charge handle, fed a round into the chamber, and stood at arms. \"Those Covenant sissies are going to have to tango with me before they set one foot in this room.\"\u003c/p\u003e\n\u003cp\u003eOn the display two of the Covenant cruisers fired again.\u003c/p\u003e\n\u003cp\u003eThe Chief watched as the plasma raced toward them, fire that spread across the black of space. \"Cortana, buy me some time,\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do what I can, Chief,\" Cortana told him. \"But you\u0027d better move fast. I\u0027m running out of options.\"\u003c/p\u003e\n\u003cp\u003eCortana was annoyed. She had let the Covenant AI—for that\u0027s what this other presence in the system undoubtedly had to be— trick her. She had gone straight for the simple lockdown of the NAV systems. She never performed a thorough systems check of the ship, assuming that there had only been one point of sabo- tage. It was a mistake she would never have made if she\u0027d been operating at full capacity.\u003c/p\u003e\n\u003cp\u003eShe checked every system of the flagship. She then locked them out with her own security measures.\u003c/p\u003e\n\u003cp\u003eCortana turned off her feelings of anger and guilt and concen- trated on keeping the ship in one piece, and the Master Chief alive. No. . . she reconsidered and kept her emotions active. The \"intuition\" provided by this aspect of her intelligence template was too valuable to deactivate in a battle.\u003c/p\u003e\n\u003cp\u003eShe maneuvered the flagship toward the gas giant, Threshold.\u003c/p\u003e\n\u003cp\u003eThe incoming plasma might be disrupted by the planet\u0027s mag- netic field—if she dared get close enough.\u003c/p\u003e\n\u003cp\u003eCortana diverted power from the foreshield to the aft por- tions, distorting the protective bubble around the flagship. She turned all seven plasma turrets aft and fired a pair of plasma tor- pedoes at the incoming salvo.\u003c/p\u003e\n\u003cp\u003eThe plasma turrets warmed and belched superheated flame— but it dispersed into a dull red cloud only a few meters from the point of fire, thinned, and then dissolved.\u003c/p\u003e\n\u003cp\u003eShe saw a subsystem linked to the weapons control: an ac- companying magnetic field multiplier. That was how the Covenant shaped and guided their charges of plasma. It acted as a sophisticated focusing lens. Something wasn\u0027t right, however— something had already been in this directory and had erased the software.\u003c/p\u003e\n\u003cp\u003eCortana swore that when she caught this guerrilla Covenant AI, she\u0027d erase it line by line.\u003c/p\u003e\n\u003cp\u003eWithout understanding how the guiding magnetic fields worked, the plasma turrets were no more useful than a fireworks display.\u003c/p\u003e\n\u003cp\u003eThe enemy Covenant plasma charges, however, were tight and burned like miniature suns; they overtook the flagship and splashed over its reinforced aft shields. They boiled against the silver energy until the shields dulled and winked out.\u003c/p\u003e\n\u003cp\u003eThe plasma etched a portion of the aft hull away like hot water dissolving salt. Cortana sensed the dull thumps of atmospheric decompressions.\u003c/p\u003e\n\u003cp\u003eShe checked on the Chief. His signal was still on board, and his biomonitor indicated that he was still alive.\u003c/p\u003e\n\u003cp\u003e\"Chief, are you there yet? I\u0027m down to one last option.\"\u003c/p\u003e\n\u003cp\u003eThere was a static-filled pause over the COM, and then the Master Chief whispered, \"Almost.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful. Your armor is breached. You can no longer func- tion in a compromised atmosphere.\"\u003c/p\u003e\n\u003cp\u003eHis acknowledgment light winked on.\u003c/p\u003e\n\u003cp\u003eCortana pushed the Covenant reactors to overload and plotted a course around Threshold. She had to slip into the outer reaches of its atmosphere. The heat, ionization, and planet\u0027s magnetic field might protect them from the plasma.\u003c/p\u003e\n\u003cp\u003eThe flagship rolled and dived into the thin tendrils of clouds.\u003c/p\u003e\n\u003cp\u003eBands of white ammonia and amber ammonium hydrosulfide clouds snaked in sinuous ribbons. A red-purple spot of phospho- rus compounds cycloned and lightning arced, illuminating an in- tervening layer of pale blue ice crystals.\u003c/p\u003e\n\u003cp\u003eBut their ship no longer had shields. The friction heated the hull to three hundred degrees Celsius as she brushed against the upper reaches of Threshold.\u003c/p\u003e\n\u003cp\u003eOn her aft cameras Cortana saw the trailing Covenant ships open fire. Their shots followed her like a pack of predator birds.\u003c/p\u003e\n\u003cp\u003e\"Come and get me,\" she muttered.\u003c/p\u003e\n\u003cp\u003eShe adjusted the attack angle of the flagship so it nosed up, which produced a slight amount of lift. She concentrated the building heat toward the ship\u0027s tail. A turbulent wake of super- heated air corkscrewed behind them.\u003c/p\u003e\n\u003cp\u003e\"Cortana?\" Polaski said. \"We\u0027re approaching the viable edge of an exit orbit. You\u0027re getting too close to the planet.\"\u003c/p\u003e\n\u003cp\u003e\"I am aware of our trajectory, Warrant Officer,\" she said and snapped off the COM. The last thing she needed was a flying lesson.\u003c/p\u003e\n\u003cp\u003eThe leading edge of the plasma overtook them. It roiled in their wake, churned explosively with the atmosphere. The flag- ship pitched and dropped in the unstable air, but the plasma dif- fused and caused them no further damage. Behind the flagship was an unfurling trail hundreds of kilometers long, a wide flam- ing gash upon Threshold.\u003c/p\u003e\n\u003cp\u003eCortana experienced a moment of triumph—then squelched it.\u003c/p\u003e\n\u003cp\u003eThere was a new problem: The concussion from that blast had altered their flight path. The heat and overpressure wave had thinned the atmosphere ... just enough to cause the flagship to drop seven hundred meters. Wisps of ice crystals washed over the prow.\u003c/p\u003e\n\u003cp\u003eThey were too deep now. They didn\u0027t have enough power to break orbit. They would spiral into the atmosphere, and would ultimately be crushed by the titanic gravitational forces of Threshold.\u003c/p\u003e\n\u003cp\u003eThe Chief spun in midair and planted his feet on the \"ground.\"\u003c/p\u003e\n\u003cp\u003eThe gravity had been disabled in this elevator shaft. That had made traversing the many intervening decks easy . . . as long as he\u0027d been willing to jump and trust that the power in this part of the ship wouldn\u0027t be restored.\u003c/p\u003e\n\u003cp\u003eThe Engineer clutching his shoulder tapped the tiny control panel on the wall. The doors at the bottom of the shaft sighed and slowly slid apart.\u003c/p\u003e\n\u003cp\u003eFunny how the creature didn\u0027t care what or who John was.\u003c/p\u003e\n\u003cp\u003eDidn\u0027t it know their races were enemies? It was clearly intelli- gent and could communicate. Maybe it didn\u0027t care about ene- mies or allies. Maybe all it wanted to do was its job.\u003c/p\u003e\n\u003cp\u003eThere was a corridor ahead, five meters wide, with a vaulted ceiling. Past a final arch, the passage opened up into the cav- ernous reactor room. The ambient lights in the hallway and room were off. Along the far wall of the room, however, the ten-meter-high reactor coils pulsed with blue-white lightning and threw hard shadows onto the walls.\u003c/p\u003e\n\u003cp\u003eThe Master Chief adjusted his low-light filters to screen out the glow from the reactor. He made out the silhouettes of crates and other machinery. He also saw one of those shadows on the wall move ... with the distinct slouching waddle of a Covenant Grunt. Then the motion was gone.\u003c/p\u003e\n\u003cp\u003eAn ambush. Of course.\u003c/p\u003e\n\u003cp\u003eHe paused, listened, and heard the panting of at least half a dozen Grunts, and then the high-pitched uneasy squeaks the creatures emitted when they were excited.\u003c/p\u003e\n\u003cp\u003eThis came as a relief to the Master Chief. If there was an Elite here, it would have maintained better discipline and silenced the Grunts.\u003c/p\u003e\n\u003cp\u003eStill, the Master Chief hesitated. His shields were gone, his armor breached. He had been fighting almost nonstop for what felt like years. He was forced to admit that he was at the limits of his endurance.\u003c/p\u003e\n\u003cp\u003eA good soldier always assessed the tactical situation—and right now, his situation was serious. A single lucky plasma shot could inflict third-degree burns along his arm and shoulder and incapacitate him, which would give the Grunts an opportunity to finish him off.\u003c/p\u003e\n\u003cp\u003eThe Chief flexed his wounded shoulder, and pain lanced across his chest. He banished his discomfort and concentrated on how to win this fight.\u003c/p\u003e\n\u003cp\u003eIt was ironic that after facing the best warriors in the Cove- nant, and after defeating the Flood, he could be killed by a handful of Grunts.\u003c/p\u003e\n\u003cp\u003e\"Chief,\" Cortana said over the COM. \"Are you there yet? I\u0027m down to one last option.\"\u003c/p\u003e\n\u003cp\u003eThe Master Chief replied in a whisper, \"Almost.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful. Your armor is breached. You can no longer func- tion in a compromised atmosphere.\"\u003c/p\u003e\n\u003cp\u003eHe flashed an acknowledgment to Cortana and concentrated on the problem at hand. Using grenades was not an option; a plasma grenade or a frag near those reactor coils could breach the containment vessel.\u003c/p\u003e\n\u003cp\u003eThat left stealth—and outwitting the Grunts.\u003c/p\u003e\n\u003cp\u003eMaybe he\u0027d use his grenades after all. The Master Chief set a plasma grenade in the center of the elevator shaft. He took his re- maining two frag grenades and set them aside as well. He felt along the elevator shaft walls and found what he needed—a length of hair-fine optical cord. He pulled out a three-meter length.\u003c/p\u003e\n\u003cp\u003eThe Engineer gave a huff of irritation at this destruction.\u003c/p\u003e\n\u003cp\u003eThe Master Chief threaded the line though the rings of his frag grenades and tied each end at anchor points ten centime- ters off the floor. He wedged the grenades into the slot of the open door.\u003c/p\u003e\n\u003cp\u003eThe trap was set; all he needed now was bait.\u003c/p\u003e\n\u003cp\u003eHe set a plasma grenade on the far wall of the shaft and trig- gered it.\u003c/p\u003e\n\u003cp\u003eHe pushed into the corridor, fast. Four seconds to go. The gravity, still active in this portion of the ship, pulled him to the deck. He melted into the shadows and sprinted along the wall two meters farther in, and halted along the inside of the first sup- port brace. Three seconds.\u003c/p\u003e\n\u003cp\u003eOne Grunt emitted a startled cry and a plasma shot sizzled down the center of the hallway.\u003c/p\u003e\n\u003cp\u003eTwo seconds.\u003c/p\u003e\n\u003cp\u003eThe Master Chief pried the Engineer off his shoulder and pressed the creature firmly into the join where the brace meet the wall.\u003c/p\u003e\n\u003cp\u003eOne second.\u003c/p\u003e\n\u003cp\u003eThe Engineer squirmed for a moment, then stilled, perhaps sensing what was about to happen.\u003c/p\u003e\n\u003cp\u003eThe plasma grenade detonated. A flash of intense light flooded the hallway and the room beyond.\u003c/p\u003e\n\u003cp\u003eThe rest of the Grunts cried out; plasma bolts and a hail of crystalline needles filled the passage, impacting inside the ele- vator shaft.\u003c/p\u003e\n\u003cp\u003eThe Grunts ceased fire. A lone Grunt cautiously stepped out from behind a crate and crept forward. It gave a barking, nervous laugh and then, encountering no resistance, waddled down the passage toward the elevator.\u003c/p\u003e\n\u003cp\u003eFour more Grunts followed, and they passed the Master Chief, oblivious that he hid behind the wall brace less than a half-meter from them.\u003c/p\u003e\n\u003cp\u003eThey approached the elevator, sniffed, and entered.\u003c/p\u003e\n\u003cp\u003eThere was the gentle ping as the frag grenade rings pulled free of the trip wire.\u003c/p\u003e\n\u003cp\u003eThe Master Chief covered the Engineer.\u003c/p\u003e\n\u003cp\u003eOne of the Grunts squealed, high and panicky. They all turned and ran.\u003c/p\u003e\n\u003cp\u003eTwin blasts of thunder enveloped the elevator shaft. Bits of meat and metal spattered along the corridor.\u003c/p\u003e\n\u003cp\u003eA needier skidded to a halt a meter away. It was cracked, its energy coil dim. The Master Chief grabbed it—ducked as an- other plasma bolt singed over his head. He withdrew to the cover of the bracing support. He tried to activate the weapon. No luck. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-first-strike-halo-3/page-11.html","bookId":1635,"creation":"Oct 5, 2019 6:25:01 PM","modification":"Oct 5, 2019 6:25:01 PM"}
