{"id":97112,"no":14,"title":"Page 14","content":"\u003cp\u003eCortana was silent.\u003c/p\u003e\n\u003cp\u003e\"Corporal Locklear was right,\" Haverson muttered. \"I really hate this shit, too.\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" Cortana finally replied, but her voice was so cold it could have frozen helium.\u003c/p\u003e\n\u003cp\u003eHaverson sighed and looked at his hands. The Engineer\u0027s blood tattooed his skin with tiny pinpoints of blue-black. \"Do you think that the Master Chief will find what he\u0027s really looking for on Reach?\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean \u0027really looking for\u0027?\" Cortana said. Her voice was still frosty, but curiosity thawed her tone.\u003c/p\u003e\n\u003cp\u003e\"I mean the other Spartans.\" Haverson gave a short laugh.\u003c/p\u003e\n\u003cp\u003e\"True, his argument to go to Reach was valid—we wouldn\u0027t be going otherwise. But that\u0027s not what he\u0027s after. He sent his team down to the surface of Reach... sent them to their deaths. What commander wouldn\u0027t go back? And what commander wouldn\u0027t hope that they were alive? No matter what the odds?\"\u003c/p\u003e\n\u003cp\u003eCHAPTER ELEVEN\u003c/p\u003e\n\u003cp\u003e0930 hours, September 4,2552 (Military Calendar) \\ UNSC High Command (HighCom) Facility Bravo-6, Sydney, Australia, Earth. Two and a half weeks ago.\u003c/p\u003e\n\u003cp\u003eLieutenant Wagner walked through metal- and explosive-detector gates and into the atrium entrance of the large, vaguely conical structure. Officially designated UNSC HighCom Facility B-6, the sprawling edifice had been nicknamed \"the Hive.\"\u003c/p\u003e\n\u003cp\u003eIt was overcast in Sydney. Gray light filtered in through the crystal dome overhead.\u003c/p\u003e\n\u003cp\u003eHe marched past officers and NCOs moving with purpose to whatever destinations occupied their time. He ignored the dis- plays of acacia trees and exotic ferns meant for the press and civilian tours. Today there was no time for pleasantries.\u003c/p\u003e\n\u003cp\u003eIn another hour the apparent calm and efficiency of HighCom would be shattered into a billion pieces. Only a few of the brass knew that the UNSC\u0027s mightiest outpost, Reach, was now noth- ing more than a cinder.\u003c/p\u003e\n\u003cp\u003eWagner approached the receptionist\u0027s station under the watchful eyes of a trio of armored Marine MPs.\u003c/p\u003e\n\u003cp\u003eKeeping Reach\u0027s fate quiet was not the UNSC\u0027s biggest se- cret, not by a country mile. Virtually no one in the civilian popu- lation of the Inner Colonies knew how perilously close they were to losing this war. ONI Section Two had done a brilliant job of preserving the fiction that Earth forces held their own against the Covenant.\u003c/p\u003e\n\u003cp\u003eAnd what did the citizens of the Outer Colonies think? Those who hadn\u0027t fled to remote outposts and hidden privateer bases weren\u0027t in any position to make trouble. The Covenant didn\u0027t take prisoners.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re expected today, Lieutenant,\" the receptionist said.\u003c/p\u003e\n\u003cp\u003eShe was a young Chief Petty Officer and looked like she didn\u0027t have a care, or a clue. But her eyes gave her away. She knew something. Maybe not what, but she had undoubtedly picked up on the increased security protocols . . . or the haunted looks in the eyes of her commanding officers.\u003c/p\u003e\n\u003cp\u003e\"Please proceed to elevator eight,\" she told him and returned her attention to the screen in front of her.\u003c/p\u003e\n\u003cp\u003eHe made a mental note to find out who this perceptive person was and see if she could be recruited into Section Three. ONI had lost a lot of good people in the last few weeks.\u003c/p\u003e\n\u003cp\u003eWagner moved to the solid steel wall, and a pair of doors parted for him. He entered the small room; the doors closed and locked with a whisper-quiet snik.\u003c/p\u003e\n\u003cp\u003eA fingerprint pad and retinal scanner extended from the wall.\u003c/p\u003e\n\u003cp\u003eWagner pressed his hand onto the scanner, and a needle stabbed his index finger. They\u0027d check his DNA against the sample on file. He blinked once and then rested his chin on the retinal scanner.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Lieutenant,\" a sweet female voice whispered in his ear.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Lysithea. How are you today?\"\u003c/p\u003e\n\u003cp\u003e\"Very well, now that I see that you have returned safely from your mission. I assume everything went as expected.\"\u003c/p\u003e\n\u003cp\u003e\"You know that\u0027s classified,\" he told the AI.\u003c/p\u003e\n\u003cp\u003e\"Certainly,\" she replied, her tone playful. \"But I\u0027ll find out anyway, you know. Why not save me the time and just tell me?\"\u003c/p\u003e\n\u003cp\u003eAlthough he generally enjoyed this tete-a-tete with Lysithea, he knew it was part of the biometric scan, too. She scanned his brainwaves and voice patterns in response to her queries and matched them to older responses in her memory. She probably tested his loyalty in security measures as well—he didn\u0027t put any- thing past Section Three; they grew more paranoid every day.\u003c/p\u003e\n\u003cp\u003e\"Of\"course you\u0027ll find out,\" Wagner replied. \"But I still can\u0027t tell you. That would be a breach of security, punishable under Article 428-A. In fact,\" he said in a more serious tone, \"I\u0027ll have to report this violation to my controller.\"\u003c/p\u003e\n\u003cp\u003eShe laughed, and it sounded like fine bone china clinking to- gether. \"You may proceed, Lieutenant,\" she told him.\u003c/p\u003e\n\u003cp\u003eThe doors parted and revealed a corridor lined with walnut panels and paintings of Washington Crossing the Delaware, Ad- miral Cole\u0027s Last Stand, various alien landscapes, and space battles.\u003c/p\u003e\n\u003cp\u003eAlthough he had barely felt the descent, Wagner knew he had dropped three kilometers into the planet, through solid layers of granite, reinforced concrete, plates of Titanium-A, and EMP-hardened metal. None of this made him feel any safer, though; ONI\u0027s research facility on Reach had the same setup, and it hadn\u0027t done those poor bastards any good.\u003c/p\u003e\n\u003cp\u003eHe stepped off the elevator. Lysithea whispered at his back: \"Watch out in there. They\u0027re looking to put someone\u0027s head on a pike.\"\u003c/p\u003e\n\u003cp\u003eWagner swallowed and straightened the microscopic wrinkles in his uniform. He searched for a reason to delay—anything that would keep him out of the room at the end of this corridor. He sighed and overcame his inertia. No one kept the Security Com- mittee for the UNSC waiting.\u003c/p\u003e\n\u003cp\u003eA pair of MPs snapped to as he approached the set of double doors. They didn\u0027t salute, and their hands rested on their hol-stered sidearms. They stared straight ahead, but Wagner knew that if he twitched the wrong way he\u0027d be shot first and questioned later.\u003c/p\u003e\n\u003cp\u003eThe doors silently swung inward.\u003c/p\u003e\n\u003cp\u003eHe entered, and the doors closed behind him and locked.\u003c/p\u003e\n\u003cp\u003eWagner recognized most of the brass seated at the crescent-shaped table: Major General Nicolas Strauss, Fleet Admiral Sir Terrence Hood, and Colonel James Ackerson. Vice Admiral Whit-comb\u0027s chair was empty.\u003c/p\u003e\n\u003cp\u003eAnother half-dozen officers were also present, and all were of command rank, which made Wagner nervous. Each had display tablets set before them, and even upside down, Wagner recog- nized his preliminary report and video records.\u003c/p\u003e\n\u003cp\u003eWagner saluted.\u003c/p\u003e\n\u003cp\u003eGeneral Strauss leaned forward and snapped off his display.\u003c/p\u003e\n\u003cp\u003e\"Christ! Did we know they had so many damn ships?\" He banged a fist onto the table. \"Why the hell didn\u0027t we know about this? Who in ONI let this one slip by?\"\u003c/p\u003e\n\u003cp\u003eAckerson leaned back. \"No one is to blame, General—except the Covenant, obviously. I\u0027m more concerned with our response to this incursion. Our fleet was decimated.\"\u003c/p\u003e\n\u003cp\u003eAckerson\u0027s reputation preceded him. Wagner had heard about the lengths to which he\u0027d gone in the past to make sure his own operations got priority over Section Three\u0027s. His rivalry with the SPARTAN-II program leader, Dr. Catherine Halsey, was the stuff of legend. Wagner thought Ackerson had been reassigned to a front-line post. Apparently he\u0027d squirmed out of it. That was trouble.\u003c/p\u003e\n\u003cp\u003eAdmiral Hood straightened and pushed his display away and finally acknowledged Wagner. He returned the salute. The Ad- miral was impeccably groomed, not a silver hair out of place on his head, and yet there were dark circles under his eyes. \"At ease, Lieutenant.\"\u003c/p\u003e\n\u003cp\u003eWagner tucked his hands behind the small of his back and moved his feet slightly apart, but otherwise didn\u0027t relax a mil- limeter. One was never at ease when in the presence of lions, sharks, and scorpions.\u003c/p\u003e\n\u003cp\u003eHood turned to Ackerson. \"Decimate is the wrong word, Colonel. We would have been decimated if we lost one ship out of every ten.\" He voice rose slightly. \"Instead, we lost ten of our ships for every one that managed to limp away. It was a total disaster!\"\u003c/p\u003e\n\u003cp\u003e\"Of course, Admiral.\" Ackerson nodded, pretending to listen, and his eyes flickered over the report again. His eyebrows raised as he noticed the time and date stamp. \"There\u0027s one thing, how- ever, I\u0027d like answered first.\" His glassy glare locked onto Wagner. \"The time difference between the events in this report and now...\" He trailed off, lost in thought. \"Congratulations, Lieutenant. This is a new speed record from Reach to Earth. Espe- cially when I know you took the time to perform the legally required random jumps before returning to Earth.\"\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Wagner replied. \"I followed the Cole Protocol to the letter.\"\u003c/p\u003e\n\u003cp\u003eThat was a lie and everyone in this room knew it. ONI was al- ways bending the Cole Protocol. In this case, it was probably justified because of the value of the intel. Still, if they wanted to crucify him, all they had to do was check the time logged on his Prowler\u0027s engines and do the math.\u003c/p\u003e\n\u003cp\u003eHood waved his hand. \"That\u0027s hardly the issue.\"\u003c/p\u003e\n\u003cp\u003e\"I think it is,\" Ackerson snapped. \"Reach is gone. There\u0027s nothing between Earth and the Covenant now except a lot of vacuum—that and whatever secrecy we can preserve.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll review Section Three\u0027s practices later, Colonel.\" Admiral Hood turned to Wagner. \"I\u0027ve read your report, Lieu- tenant. It is extremely detailed, but I want to hear it from you.\u003c/p\u003e\n\u003cp\u003eWhat did you see? Are there any details you thought too sensi- tive to include in your report? Tell me everything.\"\u003c/p\u003e\n\u003cp\u003eWagner took in a deep breath. He had prepared for this and he related, as best he could, how the Covenant ships appeared in the system, the valiant efforts of the UNSC fleet defending Reach, how they failed and were systematically destroyed.\u003c/p\u003e\n\u003cp\u003e\"When the Covenant slipped onto the surface of Reach with their tactical forces and took out the orbital-gun generators— that was the end. Well, I saw only the start of the end. They glassed the planet, starting with the poles.\"\u003c/p\u003e\n\u003cp\u003eWagner, who\u0027d two years ago had a third of his body burned by Covenant plasma and not once screamed or shed a tear, paused and blinked away the moisture blurring his vision. \"I trained at the Naval Academy on Reach, sir. It was the closest thing I had to a home in the Outer Colonies.\"\u003c/p\u003e\n\u003cp\u003eHood nodded sympathetically.\u003c/p\u003e\n\u003cp\u003eAckerson snorted. He pushed away from the table, got up, and moved to Wagner\u0027s side. \"Save the sentimentality, Lieutenant.\u003c/p\u003e\n\u003cp\u003eYou say they glassed Reach. Everything?\"\u003c/p\u003e\n\u003cp\u003eWagner detected anticipation in the Colonel\u0027s tone—as if he wanted the Covenant to have destroyed Reach.\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Wagner replied. \"Before I jumped to Slipspace, I wit-nessed the poles destroyed, and approximately two thirds of the planet\u0027s surface was on fire.\"\u003c/p\u003e\n\u003cp\u003eAckerson nodded, seemingly satisfied with this answer. \"So everyone on Reach is gone, then. Vice Admiral Whitcomb. Doc- tor Halsey, too.\" He nodded and added, \"Such a tremendous waste.\" There was no sympathy in his voice.\u003c/p\u003e\n\u003cp\u003e\"I could only speculate, sir.\"\u003c/p\u003e\n\u003cp\u003e\"No need,\" Ackerson muttered. He returned to his seat.\u003c/p\u003e\n\u003cp\u003eStrauss sighed. \"At least we have your special weapons pro- grams, Ackerson. Halsey\u0027s SPARTAN-IIs were such a great sue—\"\u003c/p\u003e\n\u003cp\u003eAckerson shot the General a look that could have blasted through battle plate.\u003c/p\u003e\n\u003cp\u003eThe General halted midsentence and snapped his mouth closed.\u003c/p\u003e\n\u003cp\u003eWagner stood absolutely still and stared straight ahead, pre- tending he hadn\u0027t seen such a gross breach of military protocol. A General knuckling under to a junior officer? Something ex- traordinary had just been revealed—there was some kind of backup plan on a par with the SPARTAN program, and Acker- son was behind it. The Colonel suddenly had a lot of juice.\u003c/p\u003e\n\u003cp\u003eWagner continued to feign ignorance—and no matter what, he didn\u0027t meet Colonel Ackerson\u0027s gaze. If Ackerson suspected that he\u0027d caught on, the bastard would have him erased to pre- vent his secret from getting back to Section Three.\u003c/p\u003e\n\u003cp\u003eAfter what seemed a century of uncomfortable silence, Admi- ral Hood cleared his throat. \"The Pillar of Autumn, Lieutenant Wagner. Was that ship destroyed? Or did she jump? There is no mention in your report.\"\u003c/p\u003e\n\u003cp\u003e\"She jumped, sir. Telemetry indicates the Autumn was pursued by several enemy ships, however, so her fate can only be speculated upon. I did not mention the Pillar of Autumn in my report, as that ship is on Section Three\u0027s Secure List.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" Hood closed his eyes. \"Then there is, at least, some hope.\"\u003c/p\u003e\n\u003cp\u003eAckerson shook his head. \"With all due respect to my prede- cessor, Doctor Halsey, the special weapons package on the Pil- lar hasn\u0027t got a chance in hell of accomplishing its mission. You might as well have shot every one of them in the head and gotten it over with.\"\u003c/p\u003e\n\u003cp\u003e\"That will be enough, Ackerson,\" Hood said and glowered at him. \"Quite enough.\"\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Wagner ventured. \"The Colonel may be correct. . . at least in his mission assessment. Our agent on the Pillar of Autumn signaled us before the end. He regrettably reported that a significant number of Spartans went groundside to defend Reach\u0027s orbital guns.\"\u003c/p\u003e\n\u003cp\u003e\"Then they\u0027re dead,\" Ackerson said. \"Halsey\u0027s freaks have finally lost their luster of invincibility.\"\u003c/p\u003e\n\u003cp\u003eAdmiral Hood set his jaw. \"Doctor Halsey,\" he said slowly and with deliberate control, \"and her Spartans deserve the ut-most respect, Colonel.\" He turned to face him, but Hood stared through Ackerson. \"And if you wish to keep your newly ac-quired position on the Security Council, you will show them that respect, or I will personally kick you from here to Melbourne.\"\u003c/p\u003e\n\u003cp\u003e\"I merely—\" Ackerson said.\u003c/p\u003e\n\u003cp\u003e\"Those \u0027freaks,\u0027 \" Hood said over his protest, \"have more confirmed kills than any three divisions of ODSTs and have gar-nered every major citation the UNSC awards. Those \u0027freaks\u0027 have personally saved my life twice, as well as the lives of most of the senior staff here at HighCom. Keep your bigotry in check, Colonel. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"My apologies,\" Ackerson muttered.\u003c/p\u003e\n\u003cp\u003e\"I asked you a direct question,\" Admiral Hood barked.\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Ackerson said. \"I understand completely, Admiral. It will not happen again.\" His face burned bright red.\u003c/p\u003e\n\u003cp\u003eWagner, however, didn\u0027t think this was the color of shame. It was anger. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-first-strike-halo-3/page-14.html","bookId":1635,"creation":"Oct 5, 2019 6:25:01 PM","modification":"Oct 5, 2019 6:25:01 PM"}
