{"id":107549,"no":50,"title":"Page 50","content":"\u003cp\u003eXII\u003c/p\u003e\n\u003cp\u003eHalfway down his packet of Rolos, Robbie became extremely thirsty. Krystal had not bought him a drink. He climbed off the bench and crouched down in the warm grass, where he could still see her outline in the bushes with the stranger. After a while, he scrambled down the bank towards them.\u003c/p\u003e\n\u003cp\u003e\u0027\u0027M thirsty,\u0027 he whined.\u003c/p\u003e\n\u003cp\u003e\u0027Robbie, get out of it!\u0027 screamed Krystal. \u0027Go an\u0027 sit on the bench!\u0027\u003c/p\u003e\n\u003cp\u003e\u0027Wanna drink!\u0027\u003c/p\u003e\n\u003cp\u003e\u0027Fuckin\u0027 - go an\u0027 wai\u0027 by the bench, an\u0027 I\u0027ll gerra drink in a minute! Go \u0027way, Robbie!\u0027\u003c/p\u003e\n\u003cp\u003eCrying, he climbed back up the slippery bank to the bench. He was accustomed to not being given what he wanted, and disobedient by habit, because grown-ups were arbitrary in their wrath and their rules, so he had learned to seize his tiny pleasures wherever and whenever he could.\u003c/p\u003e\n\u003cp\u003eAngry at Krystal, he wandered a little way from the bench along the road. A man in sunglasses was walking along the pavement towards him.\u003c/p\u003e\n\u003cp\u003e(Gavin had forgotten where he had parked the car. He had marched out of Mary\u0027s and walked straight down Church Row, only realizing that he was heading in the wrong direction when he drew level with Miles and Samantha\u0027s house. Not wanting to pass the Fairbrothers\u0027 again, he had taken a circuitous route back to the bridge.\u003c/p\u003e\n\u003cp\u003eHe saw the boy, chocolate-stained, ill-kempt and unappealing, and walked past, with his happiness in tatters, half wishing that he could have gone to Kay\u0027s house and been silently cradled ... she had always been nicest to him when he was miserable, it was what had attracted him to her in the first place.)\u003c/p\u003e\n\u003cp\u003eThe rushing of the river increased Robbie\u0027s thirst. He cried a bit more as he changed direction and headed away from the bridge, back past the place where Krystal was hidden. The bushes had started shaking. He walked on, wanting a drink, then noticed a hole in a long hedge on the left of the road. When he drew level, he spotted a playing field beyond.\u003c/p\u003e\n\u003cp\u003eRobbie wriggled through the hole and contemplated the wide green space with its spreading chestnut tree and goal posts. Robbie knew what they were, because his cousin Dane had showed him how to kick a football at the play park. He had never seen so much greenness.\u003c/p\u003e\n\u003cp\u003eA woman came striding across the field, with her arms folded and her head bowed.\u003c/p\u003e\n\u003cp\u003e(Samantha had been walking at random, walking and walking, anywhere as long as it was nowhere near Church Row. She had been asking herself many questions and coming up with few answers; and one of the questions she asked herself was whether she might not have gone too far in telling Miles about that stupid, drunken letter, which she had sent out of spite, and which seemed much less clever now ...\u003c/p\u003e\n\u003cp\u003eShe glanced up and her eyes met Robbie\u0027s. Children often wriggled through the hole in the hedge to play in the field at weekends. Her own girls had done it when they were younger.\u003c/p\u003e\n\u003cp\u003eShe climbed over the gate and turned away from the river towards the Square. Self-disgust clung to her, no matter how hard she tried to outrun it.)\u003c/p\u003e\n\u003cp\u003eRobbie went back through the hole in the hedge and walked a little way along the road after the striding lady, but she was soon out of sight. The half-packet of remaining Rolos were melting in his hand, and he did not want to put them down, but he was so thirsty. Maybe Krystal had finished. He wandered back in the opposite direction.\u003c/p\u003e\n\u003cp\u003eWhen he reached the first patch of bushes on the bank, he saw that they were not moving, so he thought it was all right to approach.\u003c/p\u003e\n\u003cp\u003e\u0027Krystal,\u0027 he said.\u003c/p\u003e\n\u003cp\u003eBut the bushes were empty. Krystal was gone.\u003c/p\u003e\n\u003cp\u003eRobbie started to wail and shout for Krystal. He clambered back up the bank and looked wildly up and down the road, but there was no sign of her.\u003c/p\u003e\n\u003cp\u003e\u0027Krystal!\u0027 he yelled.\u003c/p\u003e\n\u003cp\u003eA woman with short silver hair glanced at him, frowning, as she trotted briskly along the opposite pavement.\u003c/p\u003e\n\u003cp\u003eShirley had left Lexie at the Copper Kettle, where she seemed happy, but a short way across the Square she had caught a glimpse of Samantha, who was the very last person she wanted to meet, so she had taken off in the opposite direction.\u003c/p\u003e\n\u003cp\u003eThe boy\u0027s wails and squawks echoed behind her as she hurried along. Shirley\u0027s fist was clutched tightly around the EpiPen in her pocket. She would not be a dirty joke. She wanted to be pure and pitied, like Mary Fairbrother. Her rage was so enormous, so dangerous, that she could not think coherently: she wanted to act, to punish, to finish.\u003c/p\u003e\n\u003cp\u003eJust before the old stone bridge, a patch of bushes shivered to Shirley\u0027s left. She glanced down and caught a disgusting glimpse of something sordid and vile, and it drove her on. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-casual-vacancy/page-50.html","bookId":2230,"creation":"Oct 5, 2019 11:10:31 PM","modification":"Oct 5, 2019 11:10:31 PM"}
