{"id":107551,"no":52,"title":"Page 52","content":"\u003cp\u003eXIV\u003c/p\u003e\n\u003cp\u003eWhen Shirley opened the bedroom door, she saw nothing but two empty beds. Justice required a sleeping Howard; she would have to advise him to return to bed.\u003c/p\u003e\n\u003cp\u003eBut there was no sound from either the kitchen or the bathroom. Shirley was worried that, by taking the river road home, she had missed him. He must have got dressed and set off for work; he might already be with Maureen in the back room, discussing Shirley; planning, perhaps, to divorce her and marry Maureen instead, now that the game was up, and pretence was ended.\u003c/p\u003e\n\u003cp\u003eShe half ran into the sitting room, intending to telephone the Copper Kettle. Howard was lying on the carpet in his pyjamas.\u003c/p\u003e\n\u003cp\u003eHis face was purple and his eyes were popping. A faint wheezing noise came from his lips. One hand was clutching feebly at his chest. His pyjama top had ridden up. Shirley could see the very patch of scabbed raw skin where she had planned to plunge the needle.\u003c/p\u003e\n\u003cp\u003eHoward\u0027s eyes met hers in mute appeal.\u003c/p\u003e\n\u003cp\u003eShirley stared at him, terrified, then darted out of the room. At first she hid the EpiPen in the biscuit barrel; then she retrieved it and shoved it down the back of the cookery books.\u003c/p\u003e\n\u003cp\u003eShe ran back into the sitting room, seized the telephone receiver and dialled 999.\u003c/p\u003e\n\u003cp\u003e\u0027Pagford? This is for Orrbank Cottage, is it? There\u0027s one on the way.\u0027\u003c/p\u003e\n\u003cp\u003e\u0027Oh, thank you, thank God,\u0027 said Shirley, and she had almost hung up when she realized what she had said and screamed, \u0027no, no, not Orrbank Cottage ...\u0027\u003c/p\u003e\n\u003cp\u003eBut the operator had gone and she had to dial again. She was panicking so much that she dropped the receiver. On the carpet beside her, Howard\u0027s wheezing was becoming fainter and fainter.\u003c/p\u003e\n\u003cp\u003e\u0027Not Orrbank Cottage,\u0027 she shouted. \u0027Thirty-six Evertree Crescent, Pagford - my husband\u0027s having a heart attack ...\u0027 \u003c/p\u003e","sourceLink":"https://allnovel.net/the-casual-vacancy/page-52.html","bookId":2230,"creation":"Oct 5, 2019 11:10:31 PM","modification":"Oct 5, 2019 11:10:31 PM"}
