{"id":109540,"no":14,"title":"Page 14","content":"\u003cp\u003e\"OH, LORD,\" I SAID.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" asked Brayden. \"Is everything okay?\"\u003c/p\u003e\n\u003cp\u003e\"Hard to say.\" I put the phone back in my purse. \"I hate to do this, but I have to go take care of something outside. I\u0027ll be back as quickly as I can.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want me to go with you?\"\u003c/p\u003e\n\u003cp\u003eI hesitated. \"No, it\u0027s okay.\" I had no idea what to expect out there. It was best if Brayden wasn\u0027t subjected to it. \"I\u0027ll hurry.\"\u003c/p\u003e\n\u003cp\u003e\"Sydney, wait.\" Brayden caught hold of my arm. \"This... this is the song you requested, isn\u0027t it?\" The one we\u0027d been dancing to had just ended, and a new one was on - or, well, an old one. It was about thirty years old.\u003c/p\u003e\n\u003cp\u003eI sighed. \"Yes. It is. I\u0027ll be fast, I promise.\"\u003c/p\u003e\n\u003cp\u003eThe temperature outside was pleasant, warm but not oppressively so. We were allegedly due for a rare bit of rain. As I walked toward the parking lot, some of Wolfe\u0027s lessons came back to me. Check your surroundings. Watch for people lurking near cars. Stay in the light.\u003c/p\u003e\n\u003cp\u003eMake sure to -\u003c/p\u003e\n\u003cp\u003e\"Adrian!\"\u003c/p\u003e\n\u003cp\u003eAll reasonable thoughts vanished from my head. Adrian was lying on my car.\u003c/p\u003e\n\u003cp\u003eI ran over to Latte as fast as the dress would allow me. \"What are you doing?\" I demanded.\u003c/p\u003e\n\u003cp\u003e\"Get off of there!\" I automatically checked for dents and scratches.\u003c/p\u003e\n\u003cp\u003eAdding insult to injury, Adrian was actually smoking as he lay on the hood and stared up at the sky. Clouds were moving in, but a half-moon could occasionally be seen. \"Relax, Sage.\u003c/p\u003e\n\u003cp\u003eI won\u0027t leave a scratch. Really, this is surprisingly comfortable for a family car. I would\u0027ve expected - \" He turned his head toward me and froze. I had never seen him so still - or so quiet. His shock was so thorough and intense that he actually dropped his cigarette.\u003c/p\u003e\n\u003cp\u003e\"Ahh,\" I cried, springing forward, lest the burning cigarette damage the car. It landed harmlessly on the asphalt, and I quickly stamped it out. \"For the last time, will you get off of there?\" Adrian slowly sat up, eyes wide. He slid off the hood and didn\u0027t seem to leave any marks.\u003c/p\u003e\n\u003cp\u003eObviously, I\u0027d have to check it later. \"Sage,\" he said. \"What are you wearing?\" I sighed and stared down at the dress. \"I know. It\u0027s red. Don\u0027t start. I\u0027m tired of hearing about it.\"\u003c/p\u003e\n\u003cp\u003e\"Funny,\" he said. \"I don\u0027t think I could ever get tired of looking at it.\" Those words drew me up short, and a rush of heat went through me. What did he mean?\u003c/p\u003e\n\u003cp\u003eWas I so outlandish-looking that he couldn\u0027t stop staring at the crazy spectacle? Surely...\u003c/p\u003e\n\u003cp\u003esurely he wasn\u0027t implying that I was pretty...\u003c/p\u003e\n\u003cp\u003eI promptly got back on track, reminding myself that I needed to think about the guy inside, not out here. \"Adrian, I\u0027m on a date. Why are you here? On my car?\"\u003c/p\u003e\n\u003cp\u003e\"Sorry to interrupt, Sage. I wouldn\u0027t have been on your car if they\u0027d let me into the dance,\" he said. A little of his earlier awe had faded, and he relaxed into a more typical Adrian pose, leaning back against Latte. At least he was standing and less likely to do damage.\u003c/p\u003e\n\u003cp\u003e\"Yeah. They generally frown on letting twenty-something guys into high school events.\u003c/p\u003e\n\u003cp\u003eWhat did you want?\"\u003c/p\u003e\n\u003cp\u003e\"To talk to you.\"\u003c/p\u003e\n\u003cp\u003eI waited for him to elaborate, but the only response I received was a brief flash of lightning above. It was Saturday, and I\u0027d been around campus all day, during which he could\u0027ve easily called. He\u0027d known the dance was tonight. Then, inhaling the smell of alcohol that hung in the air around him, I knew nothing he did should really surprise me tonight.\u003c/p\u003e\n\u003cp\u003e\"Why couldn\u0027t it have been tomorrow?\" I asked. \"Did you really have to come here tonight and - \" I frowned and looked around. \"How did you even get here?\"\u003c/p\u003e\n\u003cp\u003e\"I took the bus,\" he said, almost proudly. \"A lot easier getting here than to Carlton.\" Carlton College was where he took art classes, and without his own transportation, he\u0027d come to rely heavily on mass transit - something he\u0027d never done before in his life.\u003c/p\u003e\n\u003cp\u003eI\u0027d been hoping Sonya or Dimitri had dropped him off - meaning they\u0027d pick him up again.\u003c/p\u003e\n\u003cp\u003eBut of course that wouldn\u0027t happen. Neither one of them would have brought a drunken Adrian here. \"So I guess I have to take you home then,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Hey, I got myself here. I\u0027ll get myself home.\" He started to take out a cigarette, and I gave him a stern headshake.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t,\" I said sharply. With a shrug, he put the pack away. \"And I have to take you home.\u003c/p\u003e\n\u003cp\u003eIt\u0027s going to storm soon. I\u0027m not going to make you walk in the rain.\" Another flash of lightning emphasized my words, and a faint breeze stirred the fabric of my dress.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said, \"I don\u0027t want to be an incon - \"\u003c/p\u003e\n\u003cp\u003e\"Sydney?\" Brayden came striding across the parking lot. \"Everything okay?\" No, not really. \"I\u0027m going to have to leave for a little bit,\" I said. \"I have to give my brother a ride home. Will you be okay waiting? It shouldn\u0027t be that long.\" I felt bad even suggesting it.\u003c/p\u003e\n\u003cp\u003eBrayden didn\u0027t really know anyone at my school. \"Maybe you could find Trey?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" said Brayden uncertainly. \"Or I can come with you.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said quickly, not wanting him and drunken Adrian in the car. \"Just go back and have fun.\"\u003c/p\u003e\n\u003cp\u003e\"Nice toga,\" Adrian told Brayden.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a chiton,\" said Brayden. \"It\u0027s Greek.\"\u003c/p\u003e\n\u003cp\u003e\"Right. I forgot that was tonight\u0027s theme.\" Adrian gave Brayden an appraising look, glanced over at me, and then turned back to Brayden. \"So. What do you think of our girl\u0027s ensemble tonight? Pretty amazing, huh? Like Cinderella. Or maybe a Greek Cinderella.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s really not much about it that\u0027s truly Greek,\" said Brayden. I winced. I knew he didn\u0027t mean to be insensitive, but his words stung a little. \"The dress is historically inaccurate.\u003c/p\u003e\n\u003cp\u003eI mean it\u0027s a very nice dress, but the jewelry\u0027s anachronistic, and the fabric\u0027s nothing that ancient Greek women would have had. Certainly not that color either.\"\u003c/p\u003e\n\u003cp\u003e\"What about those other Greek women?\" asked Adrian. \"The flashy smart ones.\" His forehead wrinkled, as though it were taking every ounce of his brain to come up with the word he wanted. And, to my astonishment, he did. \"The hetaerae.\" I honestly hadn\u0027t believed he\u0027d retained anything from our conversation in San Diego. I tried not to smile.\u003c/p\u003e\n\u003cp\u003e\"The hetaerae?\" Brayden was even more astonished than I was. He gave me a scrutinizing look. \"Yes... yes. I suppose - if such materials were hypothetically possible in that era - that this is something you\u0027d expect to see find on a hetaera instead of the average Greek matron.\"\u003c/p\u003e\n\u003cp\u003e\"And they were prostitutes, right?\" asked Adrian. \"These hetaerae?\"\u003c/p\u003e\n\u003cp\u003e\"Some were,\" agreed Brayden. \"Not all. I think the usual term is courtesan.\" Adrian was completely deadpan. \"So. You\u0027re saying my sister\u0027s dressed like a prostitute.\" Brayden eyed my dress. \"Well, yes, if we\u0027re still speaking in hypothetical - \"\u003c/p\u003e\n\u003cp\u003e\"You know what?\" I interrupted. \"We need to go. It\u0027s going to rain any minute now. I\u0027ll take Adrian home and meet you back here, okay?\" I refused to let Adrian continue to play whatever game he had going to torment Brayden - and, by extension, me. \"I\u0027ll text you when I\u0027m on my way back.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" said Brayden, not looking very sure at all.\u003c/p\u003e\n\u003cp\u003eHe left, and I started to get into the car until I noticed Adrian trying - and failing - to open the passenger side door. With a sigh, I walked over and opened it for him. \"You\u0027re drunker than I thought,\" I said. \"And I thought you were pretty drunk.\" He managed to get his body into the seat, and I returned to my own side just as raindrops splashed on my windshield. \"Too drunk for Jailbait to feel,\" he said. \"The bond\u0027s numb. She can have an Adrian-free night.\"\u003c/p\u003e\n\u003cp\u003e\"That was very thoughtful of you,\" I said. \"Though I\u0027m guessing that\u0027s not the real reason you were hitting the bottle. Or why you came here. As far as I can tell, all you\u0027ve accomplished is to mess with Brayden.\"\u003c/p\u003e\n\u003cp\u003e\"He called you a prostitute.\"\u003c/p\u003e\n\u003cp\u003e\"He did not! You baited him into that.\"\u003c/p\u003e\n\u003cp\u003eAdrian ran a hand through his hair and leaned against the window, watching the rapidly unfolding storm outside. \"Doesn\u0027t matter. I\u0027ve decided I don\u0027t like him.\"\u003c/p\u003e\n\u003cp\u003e\"Because he\u0027s too smart?\" I said. I remembered Jill and Eddie\u0027s earlier comments. \"And unmemorable?\"\u003c/p\u003e\n\u003cp\u003e\"Nah. I just think you can do better.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003eAdrian had no answer, and I had to ignore him for a bit as my attention shifted to the road.\u003c/p\u003e\n\u003cp\u003eStorms, while infrequent, could come up fast and furious in Palm Springs. Flash floods weren\u0027t uncommon, and the rain was now pouring down in sheets, making visibility difficult. Fortunately, Adrian didn\u0027t live that far away. That was a double blessing because, when we were a couple blocks from his apartment, he said: \"I don\u0027t feel so well.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I moaned. \"Please, please do not get sick in my car. We\u0027re almost there.\" A minute or so later, I pulled up at the curb outside his building. \"Out. Now.\" He obeyed, and I followed with an umbrella for myself. Glancing over at me as we walked to the building, he asked, \"We live in a desert, and you keep an umbrella in your car?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I do. Why wouldn\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eHe dropped his keys, and I picked them up, figuring I\u0027d have an easier time unlocking the door. I flipped on the nearest light switch - and nothing happened. We stood there for a moment, together in the darkness, neither of us moving.\u003c/p\u003e\n\u003cp\u003e\"I have candles in the kitchen,\" said Adrian, finally taking a few staggering steps in that direction.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll light some.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I ordered, having visions of the entire building going down in flames. \"Lie on the couch. Or throw up in the bathroom. I\u0027ll take care of the candles.\" He opted for the couch, apparently not as sick as he\u0027d feared. Meanwhile, I found the candles - atrocious air freshening ones that smelled like fake pine. Still, they cast light, and I brought a lit one over to him, along with a glass of water.\u003c/p\u003e\n\u003cp\u003e\"Here. Drink this.\"\u003c/p\u003e\n\u003cp\u003eHe took the glass and managed to sit up long enough to get a few sips. Then, he handed the glass back and collapsed against the couch, draping one arm over his eyes. I pulled up a nearby chair and sat down. The pine candles cast fragile, flickering light between us. \"Thanks, Sage.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to be okay if I leave?\" I asked. \"I\u0027m sure the power will be on by morning.\" He didn\u0027t answer my question. Instead, he said, \"You know, I don\u0027t just drink to get drunk. I mean, that\u0027s part of it, yeah. A big part of it. But sometimes, alcohol\u0027s all that keeps me clearheaded.\"\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t make sense. Here,\" I prompted, handing the water back to him. As I did, I cast a quick look at my cell phone\u0027s clock, anxious about Brayden. \"Drink some more.\" Adrian complied and then continued speaking, arm back over his eyes. \"Do you know what it\u0027s like to feel like something\u0027s eating away at your mind?\" I\u0027d been about to tell him I needed to leave, but his words left me cold. I remembered Jill saying something similar when she was telling me about him and spirit. \"No,\" I said honestly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what it\u0027s like... but to me, well, it\u0027s pretty much one of the most terrifying things I can imagine. My mind, it... it\u0027s who I am. I think I\u0027d rather suffer any other injury in the world than have my mind tampered with.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t leave Adrian right now. I just couldn\u0027t. I texted to Brayden: Going to be a little longer than I thought.\u003c/p\u003e\n\u003cp\u003e\"It is terrifying,\" said Adrian. \"And weird, for lack of a better word. And part of you knows...\u003c/p\u003e\n\u003cp\u003ewell, part of you knows something\u0027s not right. That your thinking\u0027s not right. But what do you about that? All we can go on is what we think, how we see the world. If you can\u0027t trust your own mind, what can you trust? What other people tell you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" I said, for lack of a better answer. His words struck me as I thought how much of my life had been guided by the edicts of others.\u003c/p\u003e\n\u003cp\u003e\"Rose once told me about this poem she\u0027d read. There was this line, \u0027If your eyes weren\u0027t open, you wouldn\u0027t know the difference between dreaming and waking.\u0027 You know what I\u0027m afraid of? That someday, even with my eyes open, I still won\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Adrian, no.\" I felt my heart breaking and sat down on the floor near the couch. \"That won\u0027t happen.\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"At least with the alcohol... it quiets the spirit and then I know if things seem weird, it\u0027s probably because I\u0027m drunk. It\u0027s not a great reason, but it\u0027s a reason, you know? At least you actually have a reason instead of not trusting yourself.\" Brayden texted back: How much longer? Irritated, I answered back: Fifteen minutes.\u003c/p\u003e\n\u003cp\u003eI looked back up at Adrian. His face was still covered, though the candlelight did a fair job of illuminating the clean lines of his profile. \"Is that... is that why you drank tonight? Is spirit bothering you? I mean... you seemed to be doing so well the other day...\" He exhaled deeply. \"No. Spirit\u0027s okay... in as much as it ever is. I actually got drunk tonight because... well, it was the only way I could bring myself to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"We talk all the time.\"\u003c/p\u003e\n\u003cp\u003e\"I need to know something, Sage.\" He uncovered his face to look at me, and I suddenly realized how close I was sitting. For a moment, I almost didn\u0027t pay attention to his words. The flickering dance of shadow and light gave his already good looks a haunting beauty. \"Did you get Lissa to talk to my dad?\"\u003c/p\u003e\n\u003cp\u003e\"What? Oh. That. Hang on one second.\" Picking up my cell phone, I texted Brayden again: Better make that thirty minutes.\u003c/p\u003e\n\u003cp\u003e\"I know someone got her to do it,\" Adrian continued. \"I mean, Lissa likes me, but she\u0027s got a lot going on. She wouldn\u0027t have just thought one day, \u0027Oh, hey. I should call Nathan Ivashkov and tell him how awesome his son is.\u0027 You got her to do it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve actually never talked to her,\" I said. I didn\u0027t regret my actions at all but felt weird at being called out on them. \"But I, uh, may have asked Sonya and Dimitri to talk to her on your behalf.\"\u003c/p\u003e\n\u003cp\u003e\"And then she talked to my old man.\"\u003c/p\u003e\n\u003cp\u003e\"Something like that.\"\u003c/p\u003e\n\u003cp\u003e\"I knew it,\" he said. I couldn\u0027t gauge his tone, if it was upset or relieved. \"I knew someone had to have prompted her, and somehow I knew it was you. No one else would have done it for me. Not sure what Lissa told him, but man, she must have really won him over. He was crazy impressed. He\u0027s sending me money for a car. And upping my allowance back to reasonable levels.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a good thing,\" I said. \"Isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eMy phone flashed with another text from Brayden. The dance will nearly be over by then.\u003c/p\u003e\n\u003cp\u003e\"But why?\" Adrian asked. He sat down on the floor beside me. There was an almost distraught look to him. He leaned closer to me and then seemed shocked as he realized what he was doing. He leaned back a little - but only a little. \"Why would you do that? Why would you do that for me?\"\u003c/p\u003e\n\u003cp\u003eBefore I could answer, another text came in. Will you even be back in time? I couldn\u0027t help be annoyed that he wasn\u0027t more understanding. Without thinking, I typed back: Maybe you should just leave now. I\u0027ll call you tomorrow. Sorry. I flipped the phone over so I wouldn\u0027t see any other messages. I looked back at Adrian, who was watching me intently.\u003c/p\u003e\n\u003cp\u003e\"I did it because he wasn\u0027t fair to you. Because you deserve credit for what you\u0027ve done.\u003c/p\u003e\n\u003cp\u003eBecause he needs to realize you aren\u0027t the person he\u0027s always thought you were. He needs to see you for who you really are, not for all the ideas and preconceptions he\u0027s built up around you.\" The power in Adrian\u0027s gaze was so strong that I kept talking. I was nervous about meeting that stare in silence. Also, part of me was afraid that if I pondered my own words too hard, I\u0027d discover they were just as much about my own father and me as Adrian and his. \"It should have been enough for you to tell him who you are - to show him who you are - but he wouldn\u0027t listen. I don\u0027t like the idea of using others to do things we can do ourselves, but this seemed like the only option.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Adrian said at last. \"I guess it worked. Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Did he tell you how to get in touch with your mother?\"\u003c/p\u003e\n\u003cp\u003e\"No. His pride in me apparently didn\u0027t go that far.\"\u003c/p\u003e\n\u003cp\u003e\"I can probably find out where she is,\" I said. \"Or... or Dimitri could, I\u0027m sure. Like you said before, they must let letters in.\"\u003c/p\u003e\n\u003cp\u003eHe almost smiled. \"There you go again. Why? Why do you keep helping me?\" There were a million answers on my lips, everything from It\u0027s the right thing to do to I don\u0027t know. Instead, I said, \"Because I want to.\"\u003c/p\u003e\n\u003cp\u003eThis time, I got a true smile from him, but there was something dark and introspective about it. He shifted closer to me again. \"Because you feel bad for this crazy guy?\"\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t going to go crazy,\" I said firmly. \"You\u0027re stronger than you think. The next time you feel that way, find something to focus on, to remind you of who you are.\"\u003c/p\u003e\n\u003cp\u003e\"Like what? Got some magic object in mind?\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t have to be magic,\" I said. I racked my brain. \"Here.\" I unfastened the golden cross necklace. \"This has always been good for me. Maybe it\u0027ll help you.\" I set it in his hand, but he caught hold of mine before I could pull back.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" he asked. He looked more closely. \"Wait... I\u0027ve seen this. You wear this all the time.\"\u003c/p\u003e\n\u003cp\u003e\"I bought it a long time ago, in Germany.\"\u003c/p\u003e\n\u003cp\u003eHe was still holding my hand as he studied the cross. \"No frills. No flourishes. No secret etched symbols.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why I like it,\" I told him. \"It doesn\u0027t need embellishment. A lot of the old Alchemist beliefs focused on purity and simplicity. That\u0027s what this is. Maybe it\u0027ll help you have clarity of mind.\"\u003c/p\u003e\n\u003cp\u003eHe had been staring at the cross, but now he lifted his gaze to meet mine.\u003c/p\u003e\n\u003cp\u003eSome emotion I couldn\u0027t quite read played over his features. It was almost like he\u0027d just discovered something, something troubling to him. He took a deep breath and, his hand still holding mine, pulled me toward him. His green eyes were dark in the candlelight but somehow just as enthralling. His fingers tightened on mine, and I felt warmth spread throughout me.\u003c/p\u003e\n\u003cp\u003e\"Sage - \"\u003c/p\u003e\n\u003cp\u003eThe power suddenly came back on, flooding the room with light. Apparently, with no concern for electrical bills, he\u0027d left all the lights on when he went out earlier. The spell was broken, and both of us winced at the sudden brightness. Adrian sprang back from me, leaving the cross in my hand.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you have a dance or a curfew or something?\" he asked abruptly, not looking at me.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to keep you. Hell, I shouldn\u0027t have bothered you at all. Sorry. I assume that was Aiden texting you?\"\u003c/p\u003e\n\u003cp\u003e\"Brayden,\" I said, standing up. \"And it\u0027s okay. He left, and I\u0027m just going to go back to Amberwood now.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" he repeated, moving toward the door with me. \"Sorry I ruined your night.\"\u003c/p\u003e\n\u003cp\u003e\"This?\" I nearly laughed, thinking of all the crazy things I contended with in my life. \"No.\u003c/p\u003e\n\u003cp\u003eIt\u0027d take a lot more to ruin my night than this.\" I started to take a few steps and then paused.\u003c/p\u003e\n\u003cp\u003e\"Adrian?\"\u003c/p\u003e\n\u003cp\u003eHe finally looked directly at me, once again nearly knocking me over with his gaze.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Next time... next time you want to talk to me about something - anything - you don\u0027t have to drink to work up the courage. Just tell me.\"\u003c/p\u003e\n\u003cp\u003e\"Easier said than done.\"\u003c/p\u003e\n\u003cp\u003e\"Not really.\" I tried for the door again, and this time, he stopped me, resting a hand on my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Sage?\"\u003c/p\u003e\n\u003cp\u003eI turned. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Do you know why I don\u0027t like him? Brayden?\" I was so astonished he\u0027d gotten the name right that I couldn\u0027t voice any answers, though several came to mind. \"Because of what he said.\"\u003c/p\u003e\n\u003cp\u003e\"What part?\" Seeing as Brayden had said many things, in great detail, it wasn\u0027t entirely clear which Adrian was referring to.\u003c/p\u003e\n\u003cp\u003e\"\u0027Historically inaccurate.\"\u0027 Adrian gestured at me with his other hand, the one not on my shoulder. \"Who the hell looks at you and says \u0027historically inaccurate\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" I said. \"Technically it is.\"\u003c/p\u003e\n\u003cp\u003e\"He shouldn\u0027t have said that.\"\u003c/p\u003e\n\u003cp\u003eI shifted, knowing I should move away... but I didn\u0027t. \"Look, it\u0027s just his way.\"\u003c/p\u003e\n\u003cp\u003e\"He shouldn\u0027t have said that,\" repeated Adrian, eerily serious. He leaned his face toward mine. \"I don\u0027t care if he\u0027s not the emotional type or the complimentary type or what. No one can look at you in this dress, in all that fire and gold, and start talking about anachronisms. If I were him, I would have said, \u0027You are the most beautiful creature I have ever seen walking this earth.\u0027\"\u003c/p\u003e\n\u003cp\u003eMy breath caught, both at the words and the way he said them. I felt strange inside. I didn\u0027t know what to think, except that I needed to get out of there, away from Adrian, away from what I didn\u0027t understand. I broke from him and was surprised to find myself shaking.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re still drunk,\" I said, putting my hand on the door knob.\u003c/p\u003e\n\u003cp\u003eHe tilted his head to the side, still watching me in that same, disconcerting way. \"Some things are true, drunk or sober. You should know that. You deal in facts all the time.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but this isn\u0027t - \" I couldn\u0027t argue with him looking at me like that. \"I have to go.\u003c/p\u003e\n\u003cp\u003eWait... you didn\u0027t take the cross.\" I held it out to him.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Keep it. I think I\u0027ve got something else to help center my life.\" The Golden Lily: A Bloodlines Novel\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/the-golden-lily-bloodlines-2/page-14.html","bookId":2042,"creation":"Oct 5, 2019 11:39:15 PM","modification":"Oct 5, 2019 11:39:15 PM"}
