{"id":41974,"no":9,"title":"Chapter 9","content":"On the last day of all he plucked up courage. He could not go without saying good-bye, and he had always brought her the big things of his life—from his buying of a horse-rake to the news of the Tribunal’s decision—though each time he had wrapped his need in some penny purchase of tobacco or sweets.\n\u003cbr\u003e \n\u003cbr\u003e The little bell buzzed and ting’d. The shop was empty and rather dark, for a grey starless dusk was on the fields after a rainy day. The wind rattled the door he had shut behind him, and moaned round the little leaded window banked up with penny toys and tins of fruit. [46] It had a long sighing sweep over the fields from Bird-in-Eye,\n\u003cbr\u003e and just across the road was a willow pond, from\n\u003cbr\u003e which it seemed to drink sadness. Over the banks of papered tins and paint-slopped toys he could see the grey bending backs of the willows, and the steely ruffle of the pond under the wind. His throat grew tight with a word that was stuck in it—“Good-bye.”\n\u003cbr\u003e \n\u003cbr\u003e The door of the back room opened, and there was a leap of firelight and the song of a kettle before it shut.\n\u003cbr\u003e \n\u003cbr\u003e “Evenun, Mus’ Tom,” said Mrs. Honey.\n\u003cbr\u003e \n\u003cbr\u003e “Evenun,” said Tom. “A packet of Player’s, please.”\n\u003cbr\u003e \n\u003cbr\u003e Thyrza put it on the counter. “Any sweeties?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. I’ll taake a quarter of bull’s-eyes and four-penn’orth of telephones. I woan’t leave them behind me this time”—and Tom grinned sheepishly.\n\u003cbr\u003e \n\u003cbr\u003e “Your brothers and sisters ull miss you,” said Thyrza, poking with a knife at the sticky wedge of the bull’s-eyes.\n\u003cbr\u003e \n\u003cbr\u003e “Not more’n I’ll miss them and the whole plaace.”\n\u003cbr\u003e \n\u003cbr\u003e “I reckon it’s sad to say good-bye.”\n\u003cbr\u003e \n\u003cbr\u003e “Unaccountable sad.”\n\u003cbr\u003e \n\u003cbr\u003e Her eyes were fixed on him very tenderly. She was sorry for Tom Beatup—had always been a little sorry for him—she could not quite tell why.\n\u003cbr\u003e \n\u003cbr\u003e “It’ll be a long time before I see you again, Thyrza.”\n\u003cbr\u003e \n\u003cbr\u003e “Maybe not—you may git leave and come to see us.”\n\u003cbr\u003e \n\u003cbr\u003e He shook his head——“Not yet awhile.”\n\u003cbr\u003e \n\u003cbr\u003e His parcels lay before him, but she did not expect him to go. He was leaning across the counter, staring at her with big, solemn eyes, and she knew that she liked his face, broad and ruddy as a September moon, that she liked the whole sturdy set of him.\n\u003cbr\u003e \n\u003cbr\u003e “Stay and have a bit of supper wud me, Tom.” It was quite unconsciously that they had become Tom and Thyrza to each other.\n\u003cbr\u003e \n\u003cbr\u003e The colour burned into his cheeks, but he shook his head.\n\u003cbr\u003e \n\u003cbr\u003e [47]\n\u003cbr\u003e \n\u003cbr\u003e “No, thank you kindly. I’ve got to git back hoame. I’ve a dunnamany things to do this last evenun.”\n\u003cbr\u003e \n\u003cbr\u003e “Then come on your fust leave.”\n\u003cbr\u003e \n\u003cbr\u003e “Reckon I will——Oh, Thryza!”\n\u003cbr\u003e \n\u003cbr\u003e His hunger had outrun his shyness. He was trembling. She had lifted her hand to smooth back the soft fuzz of her hair, which in the dusk had become the colour of hay in starlight, and as she dropped her hand, he caught it, and held it, then kissed it. It was warm and wide and soft and rather sticky.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Tommy——”\n\u003cbr\u003e \n\u003cbr\u003e “D’you mind, Thyrza?”\n\u003cbr\u003e \n\u003cbr\u003e “I?—Lord, no, dear.”\n\u003cbr\u003e \n\u003cbr\u003e He was still holding her hand across the counter, and now he slowly pulled her towards him. Her darling face was coming closer to him out of the shadows; he could smell her hair....\n\u003cbr\u003e \n\u003cbr\u003e Buzz—Ting.\n\u003cbr\u003e \n\u003cbr\u003e Their hands dropped and they started upright, both looking utterly foolish. The Reverend Henry Poullett-Smith sniffed an air of constraint as he entered.\n\u003cbr\u003e \n\u003cbr\u003e “Good evening, Mrs. Honey. I came to leave this—er—notice about the Empire Day performance at the schools. Perhaps you’ll be so kind as to show it in the window, and—er—come yourself.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you, sir. I’ll put it here by the tinned salmon. That’s what gets looked at most.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you, Mrs. Honey. Hullo, Beatup—I didn’t see you in this dim light.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll be gitting the lamp,” said Thyrza.\n\u003cbr\u003e \n\u003cbr\u003e Tom swept his parcels off the counter into his pockets, and muttered something about “hoame.”\n\u003cbr\u003e \n\u003cbr\u003e “This is your last day, isn’t it?” asked the curate.\n\u003cbr\u003e \n\u003cbr\u003e [48]\n\u003cbr\u003e \n\u003cbr\u003e “Yessir. Off to-morrow.”\n\u003cbr\u003e \n\u003cbr\u003e “Sorry?”\n\u003cbr\u003e \n\u003cbr\u003e “Middling sorry, for some reasons.”\n\u003cbr\u003e \n\u003cbr\u003e “But it will be a big experience for you.”\n\u003cbr\u003e \n\u003cbr\u003e The curate was young, and sometimes vaguely hankered after that adventure in which no priests but those of godless France might share. It was hard to see it being wasted on a pudding-headed chap like Beatup.\n\u003cbr\u003e \n\u003cbr\u003e Tom only grunted his reply to this challenge. He was angry with the parson for having come into the shop, discreet as had been his entry. He did not think of waiting till he had gone, for somehow no one, especially a man, ever left Thyrza’s shop in a hurry, as if the tranquil dawdle of the shopkeeper communicated itself to her customers, making them lounge and linger long after their purchases were made.\n\u003cbr\u003e \n\u003cbr\u003e “Good-bye, Mrs. Honey.”\n\u003cbr\u003e \n\u003cbr\u003e “Good-bye, Tom.”\n\u003cbr\u003e \n\u003cbr\u003e “Good-bye, and good luck,” said the curate, shaking hands.\n\u003cbr\u003e \n\u003cbr\u003e The bell buzzed again, and Tom was out in the throb and shudder of the wind, while Thyrza lit the lamp in the house behind him.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1952/55897.html","bookId":752,"creation":"Aug 11, 2019 5:43:07 AM","modification":"Aug 11, 2019 5:43:07 AM"}
