{"id":29617,"no":2,"title":"CHAPTER II. A STRANGER VISITOR.","content":"\u0026nbsp;Curtis Waring followed the retreating form of his cousin with a sardonic smile. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She is in the toils! She cannot escape me!” he muttered. “But”—and here his brow darkened—“it vexes me to see how she repels my advances, as if I were some loathsome thing! If only she would return my love—for I do love her, cold as she is—I should be happy. Can there be a rival? But no! we live so quietly that she has met no one who could win her affection. Why can she not turn to me? Surely, I am not so ill-favored, and though twice her age, I am still a young man. Nay, it is only a young girl’s caprice. She shall yet come to my arms, a willing captive.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His thoughts took a turn, as he arose from his seat, and walked over to the secretary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it is here that the two wills are deposited!” he said to himself; “one making me a rich man, the other a beggar! While the last is in existence I am not safe. The boy may be alive, and liable to turn up at any moment. If only he were dead—or the will destroyed——” \u0026nbsp;Here he made a suggestive pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a bunch of keys from his pocket, and tried one after another, but without success. He was so absorbed in his work that he did not notice the entrance of a dark-browed, broad-shouldered man, dressed in a shabby corduroy suit, till the intruder indulged in a short cough, intended to draw attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Starting with guilty consciousness, Curtis turned sharply around, and his glance fell on the intruder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” he demanded, angrily. “And how dare you enter a gentleman’s house unbidden?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you the gentleman?” asked the intruder, with intentional insolence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You own this house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at present. It is my uncle’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And that secretary—pardon my curiosity—is his?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; but what business is it of yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much. Only it makes me laugh to see a gentleman picking a lock. You should leave such business to men like me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are an insolent fellow!” said Curtis, more embarrassed than he liked to confess, for this rough-looking man had become possessed of a dangerous secret. “I am my uncle’s confidential agent, and it was on business of his that I wished to open the desk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not go to him for the key?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he is sick. But, pshaw! why should I apologize or give any explanation to you? What can you know of him or me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “More, perhaps, than you suspect,” said the intruder, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, you know, perhaps, that I am my uncle’s heir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t be too sure of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, fellow,” said Curtis, thoroughly provoked, “I don’t know who you are nor what you mean, but let me inform you that your presence here is an intrusion, and the sooner you leave the house the better!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will leave it when I get ready.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Curtis started to his feet, and advanced to his visitor with an air of menace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go at once,” he exclaimed, angrily, “or I will kick you out of the door!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter with the window?” returned the stranger, with an insolent leer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s as you prefer, but if you don’t leave at once I will eject you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By way of reply, the rough visitor coolly seated himself in a luxurious easy-chair, and, looking up into the angry face of Waring, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no, you won’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And why not, may I ask?” said Curtis, with a feeling of uneasiness for which he could not account.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not? Because, in that case, I should seek an interview with your uncle, and tell him——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That his son still lives; and that I can restore him to his——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The face of Curtis Waring blanched; he staggered as if he had been struck; and he cried out, hoarsely:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a lie!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the truth, begging your pardon. Do you mind my smoking?” and he coolly produced a common clay pipe, filled and lighted it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” asked Curtis, scanning the man’s features with painful anxiety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you forgotten Tim Bolton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you Tim Bolton?” faltered Curtis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; but you don’t seem glad to see me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you were——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In Australia. So I was three years since. Then I got homesick, and came back to New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have been here three years?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” chuckled Bolton. “You didn’t suspect it, did you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?” asked Curtis, in a hollow voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I keep a saloon on the Bowery. There’s my card. Call around when convenient.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Curtis was about to throw the card into the grate, but on second thought dropped it into his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the boy?” he asked, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is alive and well. He hasn’t been starved. Though I dare say you wouldn’t have grieved if he had.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he is actually in this city?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he know anything of—you know what I mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He doesn’t know that he is the son of a rich man, and heir to the property which you look upon as yours. That’s what you mean, isn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. What is he doing? Is he at work?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He helps me some in the saloon, sells papers in the evenings, and makes himself generally useful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he any education?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I haven’t sent him to boarding school or college,” answered Tim. “He don’t know no Greek, or Latin, or mathematics—phew, that’s a hard word. You didn’t tell me you wanted him made a scholar of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t. I wanted never to see or hear from him again. What made you bring him back to New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Couldn’t keep away, governor. I got homesick, I did. There ain’t but one Bowery in the world, and I hankered after that——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t I pay you money to keep away, Tim Bolton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t deny it; but what’s three thousand dollars? Why, the kid’s cost me more than that. I’ve had the care of him for fourteen years, and it’s only about two hundred a year.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have broken your promise to me!” said Curtis, sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s worse things than breaking your promise,” retorted Bolton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Scarcely had he spoken than a change came over his face, and he stared open-mouthed behind him and beyond Curtis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Startled himself, Curtis turned, and saw, with a feeling akin to dismay, the tall figure of his uncle standing on the threshold of the left portal, clad in a morning gown, with his eyes fixed inquiringly upon Bolton and himself.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2948/81016.html","bookId":464,"creation":"Aug 5, 2019 1:43:41 AM","modification":"Aug 5, 2019 1:43:41 AM"}
