{"id":29637,"no":22,"title":"CHAPTER XXII. THE OTHER PASSENGER.","content":"\u0026nbsp;Dodger sought the steward, and asked for his valise. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t it in your stateroom?” asked that functionary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t seen it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I remember now. It was put with the luggage of the other passenger. I will show it to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took Dodger to a part of the ship where freight was stored, and pointed to a sizable valise with a card attached to it on which was inscribed the name: “Arthur Grant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This must be yours,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I suppose so,” answered Dodger, glad to have found out the new name which had been given him, otherwise he would have supposed the valise belonged to some other person.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the valise to his stateroom, and, finding a key tied to the handles, he opened it at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It proved to contain a very fair supply of underclothing, socks, handkerchiefs, etc., with a tooth brush, a hair brush and comb, and a sponge. Never in his life had Dodger been so well supplied with clothing before. There were four white shirts, two tennis shirts, half a dozen handkerchiefs and the same number of socks, with three changes of underclothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I begin to feel like a gentleman,” said Dodger to himself, complacently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That was not all. At the bottom of the valise was an envelope, sealed, on which was inscribed the name: “Dodger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is for me, at any rate,” thought our hero. “I suppose it is from Curtis Waring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the envelope, and found inclosed twenty-five dollars in bills, with a few lines written on a half-sheet of paper. These Dodger read, with interest and curiosity. They were as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dodger:—The money inclosed is for you. When you reach California you will find it of use. I have sent you out there because you will find in a new country a better chance to rise than in the city of New York. I advise you to stay there and grow up with the country. In New York you were under the influence of a bad man, from whom it is best that you should be permanently separated. I know something of the early history of Tim Bolton. He was detected in a crime, and fled to escape the consequences. You are not his son, but his nephew. Your mother was his sister, but quite superior to himself. Your right name is Arthur Grant, and it will be well for you to assume it hereafter. I have entered you in the list of passengers under that name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you had taken the will from my uncle’s desk, but I am inclined to think you had nothing to do with it. If you know where it is, or whether Bolton has it, I expect you to notify me in return for the money I have expended in your behalf. In that case you can write to me, No. — Madison Avenue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Curtis Waring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dodger read the letter over twice, and it puzzled him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He seems from the letter to take an interest in me,” he soliloquized. “At any rate, he has given me money and clothes, and paid my passage to California. What for, I wonder? I don’t believe it is to get me away from the bad influence of Tim. There must be some other reason.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another part of the letter with which Dodger did not agree.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Curtis asserted positively that he was the nephew of Tim Bolton, while he was positive that there was no relationship between them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In that case Curtis must have been an early acquaintance of Tim’s. At any rate, he seemed to know about his past life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dodger now comprehended his present situation fully. He was a passenger on the ship Columbia, and there was no chance of leaving it. He had ascertainel on inquiry that the vessel would not put in anywhere, but would make the long voyage direct. It would be over four months, at any rate, before he could communicate with Florence, and in the meantime, she and Mrs. O’Keefe, whom he recognized as a good friend, would conclude that he was dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was very provoking to think that he could not even telegraph, as that would relieve all anxiety, and he felt sure that Florence was enough his friend to feel anxious about him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had just closed up his valise, when a young man of dark complexion and of an attractive, intellectual expression, entered the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He nodded pleasantly to Dodger, and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose this is Arthur Grant?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Dodger, for he had decided to adopt the name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We ought to become close friends, for we are, I believe, the only passengers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you are a passenger, too?” said Dodger, deciding, after a brief scrutiny, that he should like his new acquaintance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. My name is Randolph Leslie. I have been, for the last five years, a reporter on leading New York daily papers, and worked so closely that my health has become somewhat affected. My doctor recommended a sea voyage, and I have arranged for a pretty long one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What papers have you worked for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, all the leading ones—Tribune, World, Herald, and Sun—sometimes one, and sometimes another. Your reason for taking this trip can hardly be the same as mine. You don’t look as if your health required you to travel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Dodger, smiling; “but I understand that the gentleman who engaged my passage said I was going to sea for my health.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I were as robust as you, I shouldn’t give much thought to my health. Do you intend to remain in California?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know what I do intend,” replied Dodger. “I didn’t know I was going to California at all until I woke up in my stateroom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t you know the destination of the vessel when you came on board?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was brought aboard in my sleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is curious. It looks to me as if you had a story to tell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course, I don’t want to be curious, but if there is anyway in which I can help you, by advice, or in any other way, I am quite ready to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dodger paused, but only briefly. This young man looked friendly, and might help him to penetrate the mystery which at present baffled him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At any rate, his experience qualified him to give friendly advice, and of this Dodger felt that he stood in need.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ought to tell you, to begin with,” he said, “that I am a poor boy, and made my living as best I could, by carrying baggage, selling papers, etc.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think any the worse of you for that. Did you live at the lodging houses?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; until lately I lived with a man who keeps a saloon on the Bowery, and tended bar for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was his name? As a reporter I know the Bowery pretty well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tim Bolton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tim Bolton? I know his place well. I think I must have seen you there. Your face looked familiar to me as soon as I set eyes on you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely. A good many people came into Tim’s. I couldn’t pretend to remember them all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was Tim a relative of yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe he was. I always thought that he got hold of me when I was a kid. I don’t remember the time when I wasn’t with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have always lived in New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I lived for several years in Australia. Tim was in the same business there. I came on with him a year or more since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think you ever lived in New York before?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; Tim has told me that I was born in New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I understand that you have left Tim now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, may I ask?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I didn’t like the business he was in. But I liked it better than the one he wanted me to go into.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Burglary.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young reporter started in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” he said, “this is a new tack for Tim. However, I never looked upon him as a man who would shrink from any violation of the laws, except murder. I don’t think he would do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; Tim isn’t quite so bad. He isn’t the worst man alive, though he is a rather hard customer. It was his wanting me to enter a house on Madison Avenue and open a desk that led to me going on this trip.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me about it, if you don’t mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus invited, Dodger told his story to Randolph Leslie, keeping nothing back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He finished by showing him the letter he had found in the valise.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2948/81036.html","bookId":464,"creation":"Aug 5, 2019 1:43:41 AM","modification":"Aug 5, 2019 1:43:41 AM"}
