{"id":29639,"no":24,"title":"CHAPTER XXIV. FLORENCE IN SUSPENSE.","content":"\u0026nbsp;We must now return to New York to Dodger’s old home. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he did not return at the usual hour, neither Florence nor Mrs. O’Keefe was particularly disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was thought that he had gone on some errand of unusual length, and would return an hour or two late.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Eight o’clock came, the hour at which the boy was accustomed to repair to Florence’s room to study, and still he didn’t make his appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dodger’s late this evening, Mrs. O’Keefe,” said Florence, going up to the room of her landlady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure he is. It’s likely he’s gone to Brooklyn or up to Harlem, wid a bundle. He’ll be comin’ in soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope he will be well paid for the errand, since it keeps him so long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope so, too, Florence, for he’s a good boy, is Dodger. Did I tell you how he served the rapscallion that tried to stale my apples the other day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I would like to hear it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A big, black-bearded man came along, and asked me for an apple.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘You can have one for two pennies,’ says I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘But I haven’t got them,’ says he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Then you must go widout it,’ says I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘We’ll see about that,’ says he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what do you think?—the fellow picked out one of my biggest apples, and was walkin’ away! That made me mad.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Come back, you thafe of the worruld!’ says I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Silence, you old hag!’ says he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Actilly he called me an old hag! I wanted to go after him, but there was two hoodlums hangin’ round, and I knew they’d carry off some of my apples, when, just as I was at my wits’ end, Dodger came round the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Dodger,’ I screamed, ‘go after that man! He’s taken one of my apples, widout lave or license!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Upon that, Dodger, brave as a lion, walked up to the man, and, says he:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Give back that apple, or pay for it!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘What’s that to you, you impudent young rascal?’ says the man, raisin’ the apple to his mouth. But he didn’t get a chance to bite it, for Dodger, with a flip of his hand, knocked it on the sidewalk, and picked it up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wasn’t the man mad just?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘I’ll smash you, boy,’ he growled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘I’m a baggage-smasher myself,’ says Dodger, ‘and I can smash as well as you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wid that the man up with his fist and struck at Dodger, but he dodged the blow, and gave him one for himself wid his right. Just then up came a cop.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘What’s all this?’ says he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘That man tried to run off wid one of my apples,’ says I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘Come along,’ says the cop. ‘You’re wanted at the station-house.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘It’s a lie,’ says the man. ‘I paid the woman for the apple, and that young rascal knocked it out of my hand.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “ ‘I know the boy,’ says the cop, ‘and he ain’t one of that kind. I’ll let you go if you buy five apples from the lady, and pay for ’em.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man made up an ugly face, but he didn’t want to be locked up, and so he paid me a dime for five apples.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dodger is very brave,” said Florence. “Sometimes I think he is too daring. He is liable to get into trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he does he’ll get himself out of it, never you fear. Dodger can take care of himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nine o’clock came, and Florence became alarmed. She had not been aware how much she had depended upon the company of her faithful friend, humble as his station was.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again she went into Mrs. O’Keefe’s room. The apple-woman had been out to buy some groceries and had just returned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am getting anxious about Dodger,” said Florence. “It is nine o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what’s nine o’clock for a boy like him? Shure he’s used to bein’ out at all hours of the night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall feel relieved when he comes home. What should I do without him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure I’d miss him myself; but it isn’t the first time he has been out late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps that terrible Tim Bolton has got hold of him,” suggested Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tim isn’t so bad, Florence. He isn’t fit company for the likes of you, but there’s worse men nor Tim.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t he send out Dodger to commit a burglary?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And if he hadn’t you’d never made Dodger’s acquaintance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true; but it doesn’t make burglary any more excusable. Don’t you really think Tim Bolton has got hold of him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he has, he won’t keep him long, I’ll make oath of that. He might keep him over night, but Dodger would come back in the morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence was somewhat cheered by Mrs. O’Keefe’s refusal to believe that Dodger was in any serious trouble, but she could not wholly free herself from uneasiness. When eleven o’clock came she went to bed very unwillingly, and got very little rest during the night. Morning came, and still Dodger did not show up. As we know, he was fairly started on his long voyage, though he had not yet recovered consciousness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence took a very light breakfast, and at the usual time went to Mrs. Leighton’s to meet her pupil. When the study hour was over, she did not remain to lunch, but hurried back, stopping at Mrs. O’Keefe’s apple-stand just as that lady was preparing to go home to prepare dinner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you seen anything of Dodger, Mrs. O’Keefe?” asked Florence, breathlessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I haven’t, Florence. I’ve had my eye out watchin’ for him, and he hasn’t showed up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there anything we can do?” asked Florence, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, we might go around and see Tim—and find out whether he’s got hold of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us go at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure I didn’t know you cared so much for the boy,” said Mrs. O’Keefe, with a shrewd look at Florence’s anxious face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I care for him? He is my only friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he now? And what’s the matter wid Bridget O’Keefe?” asked the apple-woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, Mrs. O’Keefe. I know very well you are my friend, and a kind friend, too. I should not have forgotten you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s all right, Florence. You’re flustrated like, and that’s why you forget me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have so few friends that I can’t spare one,” continued Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s so. Come along wid me, and we’ll see what Tim has to tell us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A short walk brought the two strangely assorted companions to the entrance of Tim Bolton’s saloon. “I’m afraid to go in, Mrs. O’Keefe,” said Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come along wid me, my dear, I won’t let anything harm you. You ain’t used to such a place, but I’ve been here more than once to fill the growler. Be careful as you go down the steps, Florence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tim Bolton was standing behind the bar, and as he heard steps he looked carelessly toward the entrance, but when he saw Florence, his indifference vanished. He came from behind the bar, and advanced to meet her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miss Linden,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence shrank back and clung to her companion’s arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there anything I can do for you? I am a rough man, but I’m not so bad as you may think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what I told her, Tim,” said Mrs. O’Keefe. “I told Florence there was worse men than you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mrs. O’Keefe. Can I offer you a glass of whiskey?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The apple-woman was about to accept, but she felt an alarmed tug at her arm, and saw that Florence would be placed in an embarrassing position if she accepted. So, by an exercise of self-denial—for Mrs. O’Keefe was by no means insensible to the attractions of whiskey, though she never drank to excess—she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you kindly, Mr. Bolton. I won’t take any just now; but I’ll remind you of your offer another day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have it your own way, Mrs. O’Keefe. And now, what can I do for you and Miss Linden?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Mr. Bolton,” broke in Florence, unable to bear the suspense longer, “where is Dodger?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2948/81038.html","bookId":464,"creation":"Aug 5, 2019 1:43:41 AM","modification":"Aug 5, 2019 1:43:41 AM"}
