{"id":29619,"no":4,"title":"CHAPTER IV. FLORENCE.","content":"\u0026nbsp;Florence Linden sat in the library the following evening in an attitude of depression. Her eyelids were swollen, and it was evident she had been weeping. During the day she had had an interview with her uncle, in which he harshly insisted upon her yielding to his wishes, and marrying her cousin, Curtis. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, uncle,” she objected, “I do not love him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Marry him, and love will come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never!” she said, vehemently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You speak confidently, miss,” said Mr. Linden, with irritation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen, Uncle John. It is not alone that I do not love him. I dislike him—I loathe—him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nonsense! that is a young girl’s extravagant nonsense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, uncle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There can be no reason for such a foolish dislike. What can you have against him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is impressed upon me, uncle, that Curtis is a bad man. There is something false—treacherous—about him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pooh! child! you are more foolish than I thought. I don’t say Curtis is an angel. No man is; at least, I never met any such. But he is no worse than the generality of men. In marrying him you will carry out my cherished wish. Florence, I have not long to live. I shall be glad to see you well established in life before I leave you. As the wife of Curtis you will have a recognized position. You will go on living in this house, and the old home will be maintained.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why is it necessary for me to marry at all, Uncle John?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will be sure to marry some one. Should I divide my fortune between you and Curtis, you would become the prey of some unscrupulous fortune hunter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better that than become the wife of Curtis Waring——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see, you are incorrigible,” said her uncle, angrily. “Do you refuse obedience to my wishes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Command me in anything else, Uncle John, and I will obey,” pleaded Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed! You only thwart me in my cherished wish, but are willing to obey me in unimportant matters. You forget the debt you owe me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I forget nothing, dear uncle. I do not forget that, when I was a poor little child, helpless and destitute, you took me in your arms, gave me a home, and have cared for me from that time to this as only a parent could.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You remember that, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, uncle. I hope you will not consider me wholly ungrateful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It only makes matters worse. You own your obligations, yet refuse to make the only return I desire. You refuse to comfort me in the closing days of my life by marrying your cousin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because that so nearly concerns my happiness that no one has a right to ask me to sacrifice all I hold dear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see you are incorrigible,” said John Linden, stormily. “Do you know what will be the consequences?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am prepared for all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then listen! If you persist in balking me, I shall leave the entire estate to Curtis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do with your money as you will, uncle. I have no claim to more than I have received.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right there; but that is not all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence fixed upon him a mute look of inquiry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will give you twenty-four hours more to come to your senses. Then, if you persist in your ingratitude and disobedience, you must find another home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, uncle, you do not mean that?” exclaimed Florence, deeply moved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do mean it, and I shall not allow your tears to move me. Not another word, for I will not hear it. Take twenty-four hours to think over what I have said.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence bowed her head on her hands, and gave herself up to sorrowful thoughts. But she was interrupted by the entrance of the servant, who announced:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Percy de Brabazon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An effeminate-looking young man, foppishly dressed, followed the servant into the room, and made it impossible for Florence to deny herself, as she wished to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope I see you well, Miss Florence,” he simpered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mr. de Brabazon,” said Florence, coldly. “I have a slight headache.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am awfully sorry, I am, upon my word, Miss Florence. My doctor tells me it is only those whose bwains are vewy active that are troubled with headaches.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, I presume, Mr. de Brabazon,” said Florence, with intentional sarcasm, “that you never have a headache.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Weally, Miss Florence, that is vewy clevah. You will have your joke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was no joke, I assure you, Mr. de Brabazon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I thought it might be. Didn’t I see you at the opewa last evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Possibly. I was there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I often go to the opewa. It’s so—so fashionable, don’t you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you don’t go to hear the music?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, of course, but one can’t always be listening to the music, don’t you know. I had a fwiend with me last evening—an Englishman—a charming fellow, I assure you. He’s the second cousin of a lord, and yet—you’ll hardly credit it—we’re weally vewy intimate. He tells me, Miss Florence, that I’m the perfect image of his cousin, Lord Fitz Noodle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not at all surprised.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Weally, you are vewy kind, Miss Florence. I thought it a great compliment. I don’t know how it is, but evewybody takes me for an Englishman. Strange, isn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very glad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I ask why, Miss Florence?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because—— Well, perhaps I had better not explain. It seems to give you pleasure. You would, probably, prefer to be an Englishman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I admit that I have a great admiration for the English character. It’s a gweat pity we have no lords in America. Now, if you would only allow me to bring my English fwiend here——\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care to make any new acquaintances. Even if I did, I prefer my own countrymen. Don’t you like America, Mr. de Brabazon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, of courth, if we only had some lords here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We have plenty of flunkeys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s awfully clevah, ’pon my word.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it? I am afraid you are too complimentary. You are very good-natured.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I always feel good-natured in your company, Miss Florence. I—wish I could always be with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really! Wouldn’t that be a trifle monotonous?” asked Florence, sarcastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if we were married,” said Percy, boldly breaking the ice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, Mr. de Brabazon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you will excuse me, Miss Florence—Miss Linden, I mean; but I’m awfully in love with you, and have been ever so long—but I never dared to tell you so. I felt so nervous, don’t you know? Will you marry me? I’ll be awfully obliged if you will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. de Brabazon rather awkwardly slipped from his chair, and sank on one knee before Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please arise, Mr. de Brabazon,” said Florence, hurriedly. “It is quite out of the question—what you ask—I assure you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah! I see how it is,” said Percy, clasping his hands sadly. “You love another.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I am aware of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I may still hope?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot encourage you, Mr. de Brabazon. My heart is free, but it can never be yours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said Percy, gloomily, “there is only one thing for me to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall go to the Bwooklyn Bwidge, climb to the parapet, jump into the water, and end my misewable life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better think twice before adopting such a desperate resolution, Mr. de Brabazon. You will meet others who will be kinder to you than I have been——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can never love another. My heart is broken. Farewell, cruel girl. When you read the papers tomorrow morning, think of the unhappy Percy de Brabazon!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. de Brabazon folded his arms gloomily, and stalked out of the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If my position were not so sad, I should be tempted to smile,” said Florence. “Mr. de Brabazon will not do this thing. His emotions are as strong as those of a butterfly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a brief pause Florence seated herself at the table, and drew toward her writing materials.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is I whose heart should be broken!” she murmured; “I who am driven from the only home I have ever known. What can have turned against me my uncle, usually so kind and considerate? It must be that Curtis has exerted a baneful influence upon him. I cannot leave him without one word of farewell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She took up a sheet of paper, and wrote, rapidly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dear Uncle: You have told me to leave your house, and I obey. I cannot tell you how sad I feel, when I reflect that I have lost your love, and must go forth among strangers—I know not where. I was but a little girl when you gave me a home. I have grown up in an atmosphere of love, and I have felt very grateful to you for all you have done for me. I have tried to conform to your wishes, and I would obey you in all else—but I cannot marry Curtis; I think I would rather die. Let me still live with you as I have done. I do not care for any part of your money—leave it all to him, if you think best—but give me back my place in your heart. You are angry now, but you will some time pity and forgive your poor Florence, who will never cease to bless and pray for you. Good-bye!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Florence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was about to sign herself Florence Linden, but reflected that she was no longer entitled to use a name which would seem to carry with it a claim upon her uncle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The tears fell upon the paper as she was writing, but she heeded them not. It was the saddest hour of her life. Hitherto she had been shielded from all sorrow, and secure in the affection of her uncle, had never dreamed that there would come a time when she would feel obliged to leave all behind her, and go out into the world, friendless and penniless, but poorest of all in the loss of that love which she had hitherto enjoyed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After completing the note, Florence let her head fall upon the table, and sobbed herself to sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour and a half passed, the servant looked in, but noticing that her mistress was sleeping, contented herself with lowering the gas, but refrained from waking her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so she slept on till the French clock upon the mantle struck eleven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later and the door of the room slowly opened, and a boy entered on tiptoe. He was roughly dressed. His figure was manly and vigorous, and despite his stealthy step and suspicious movements his face was prepossessing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He started when he saw Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What, a sleeping gal!” he said to himself. “Tim told me I’d find the coast clear, but I guess she’s sound asleep, and won’t hear nothing. I don’t half like this job, but I’ve got to do as Tim told me. He says he’s my father, so I s’pose it’s all right. All the same, I shall be nabbed some day, and then the family’ll be disgraced. It’s a queer life I’ve led ever since I can remember. Sometimes I feel like leaving Tim, and settin’ up for myself. I wonder how ’twould seem to be respectable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy approached the secretary, and with some tools he had brought essayed to open it. After a brief delay he succeeded, and lifted the cover. He was about to explore it, according to Tim’s directions, when he heard a cry of fear, and turning swiftly saw Florence, her eyes dilated with terror, gazing at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” she asked in alarm, “and what are you doing there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2948/81018.html","bookId":464,"creation":"Aug 5, 2019 1:43:41 AM","modification":"Aug 5, 2019 1:43:41 AM"}
