{"id":96421,"no":23,"title":"Page 23","content":"\u003cp\u003e“Oh, Roy,” Myrt said, and swatted him with her napkin. “Am I gonna have to keep you on a leash?”\u003c/p\u003e\n\u003cp\u003e“Arf arf,” Roy said.\u003c/p\u003e\n\u003cp\u003e“I swear, men are terrible creatures. Still, I have to say this is more interesting than our last cruise.”\u003c/p\u003e\n\u003cp\u003e“You had a good time.”\u003c/p\u003e\n\u003cp\u003e“Well, I did, but the conversation! Perforations, inverted underprints—”\u003c/p\u003e\n\u003cp\u003e“Overprints,” Roy said.\u003c/p\u003e\n\u003cp\u003e“Like it matters? Roy,” she announced, “took me on a cruise for stamp collectors. Can you imagine? Every time we landed and the wives went shopping, all of the men rushed to the nearest post office.”\u003c/p\u003e\n\u003cp\u003eRoy said it wasn’t quite like that, and Myrt said it was close enough, and Roy said only thirty-some passengers were stamp collectors, it was just a small portion of the whole, and Myrt said yes, but those were the people they had to sit with every night at dinner, and finally Keller was able to get a word in edgewise.\u003c/p\u003e\n\u003cp\u003e“You’re a collector,” he said.\u003c/p\u003e\n\u003cp\u003e“Guilty as charged, but I never would have brought it up, because there’s nothing less interesting than someone else’s hobby.”\u003c/p\u003e\n\u003cp\u003eWas that true? Keller didn’t think so, and had found most people to be at their best when talking about their hobby or pastime. But what he said was, “Well, I wouldn’t be bored. I’m a philatelist myself.”\u003c/p\u003e\n\u003cp\u003e“I guess you just might be, if you can pronounce it correctly. Myrt still has trouble after all these years. What do you collect, Nick?”\u003c/p\u003e\n\u003cp\u003eKeller told him, and Roy nodded respectfully. “Classic general worldwide,” he said. “Got to admire that. Myself, well, nothing quite that ambitious, but I’ve got a batch of collections going. My main interest is stamps of Turkey, and don’t ask me why. No Turkish ancestors, no connection of any sort, and I’ve never been to the country and don’t expect I’ll ever get there. I just like the stamps, for some reason.”\u003c/p\u003e\n\u003cp\u003eIt made perfect sense to Keller.\u003c/p\u003e\n\u003cp\u003e“And of course along with Turkey I collect a batch of dead countries connected to Turkey, like Hatay and Latakia.”\u003c/p\u003e\n\u003cp\u003e“And Eastern Rumelia,” Keller offered.\u003c/p\u003e\n\u003cp\u003e“You bet. And, let’s see, besides Turkey I have one topical collection. I collect fish.”\u003c/p\u003e\n\u003cp\u003e“That’s fish on stamps,” Myrt said, as if otherwise Julia might think Roy had a collection of actual fishes.\u003c/p\u003e\n\u003cp\u003e“Now, I like fish,” Roy said, “though I wouldn’t want it served to me every night. And when I was a kid I had an aquarium and I used to like watching the fish, until they all died and I emptied the fish tank and gave it to my mother to grow ferns in. And I’ve been fishing, but only a couple of times in my life, and I don’t care if I never waste time again in that particular fashion. But I do like stamps with fish on them. I just like the way they look, all the different species.”\u003c/p\u003e\n\u003cp\u003eThat made sense to Keller, too.\u003c/p\u003e\n\u003cp\u003eKeller, stretched out on his bunk, turned at the sound of Julia’s key card in the lock. She entered, holding the plastic rectangle aloft like a Plains Indian brandishing a scalp.\u003c/p\u003e\n\u003cp\u003e“That’s the key to 501?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “It’s a spare key to our cabin. I just let myself in with it.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Silly me, locking myself out. In a minute I’ll take the key back.” She tapped it with her thumbnail. “There’s no way she’ll give me a key to Carmody’s cabin. You need to show ID and sign for it. But I saw where she keeps the keys, and how they’re sorted. Now if somebody could get her to come away from the desk for a minute or two, someone else could slip away with the key to 501.”\u003c/p\u003e\n\u003cp\u003e“Last time I passed the desk,” Keller said, “there were two girls behind it. They looked enough alike to be Xerox copies, but there were two of them.”\u003c/p\u003e\n\u003cp\u003e“Two to a shift,” Julia agreed. “Two on duty from eight in the morning till four in the afternoon, and two others from four to midnight.”\u003c/p\u003e\n\u003cp\u003e“And only one after midnight?”\u003c/p\u003e\n\u003cp\u003e“Pilar is so glad she does not have the graveyard shift this week. She had it last week, and you get so lonely.”\u003c/p\u003e\n\u003cp\u003e“You got friendly with her.”\u003c/p\u003e\n\u003cp\u003e“It never hurts to be friendly,” she said. “She’s from the Philippines.”\u003c/p\u003e\n\u003cp\u003e“I think they all are.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. All the dining room and housekeeping staff, and the ones on the desk. The cruise director and his staff are American, except for the ones who aren’t. And the crew’s a mini United Nations, with a lot of Eastern Europeans. The chef is Swiss. Pilar doesn’t like the Ukrainians.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“She says they’re not nice. I was thinking if we waited until one o’clock, and then you found a way to lure the attendant out from behind the desk, all I’d need is a couple of minutes to get the key to their cabin.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should do the luring.”\u003c/p\u003e\n\u003cp\u003e“No,” she said, “because I saw where the keys are. You can play helpless confused man in need of help. Besides, if anybody happens to see me behind the desk, it’ll be less unsettling than if they were to see you.”\u003c/p\u003e\n\u003cp\u003e“Because you look more like a Filipina?”\u003c/p\u003e\n\u003cp\u003e“Because I’m a girl, silly. Women are less threatening. How could you not know that?”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything, and she asked him if something was bothering him.\u003c/p\u003e\n\u003cp\u003e“I’m just wondering,” he said, “if this is really something you want to do.”\u003c/p\u003e\n\u003cp\u003e“The key will help, won’t it?”\u003c/p\u003e\n\u003cp\u003e“It might. It certainly wouldn’t hurt.”\u003c/p\u003e\n\u003cp\u003e“Well,” she said, “I want to help.”\u003c/p\u003e\n\u003cp\u003eHe made one change to Julia’s plan, delaying the starting time an hour to give the girl on the desk a little more time to appreciate the loneliness of her situation. At a couple of minutes past two, Keller approached the desk, where the attendant met him with a big smile.\u003c/p\u003e\n\u003cp\u003e“I was wondering if you could help me,” he said. “The only thing is, I don’t know if it’s okay for you to leave the desk.”\u003c/p\u003e\n\u003cp\u003e“It’s not rush hour here,” she said. “How can I help?”\u003c/p\u003e\n\u003cp\u003eThere was a notice on the board he couldn’t understand, he said, and he led her down a corridor to where notices were posted, and pointed to one he’d scouted out earlier. Its message, some drivel about evacuation in the event of fire or shipwreck, was pretty clear, but she was evidently willing to believe he was somewhere in the early stages of cognitive decline, and worried about drowning, and so she explained it all very clearly and carefully.\u003c/p\u003e\n\u003cp\u003eKeller asked if there were many shipboard fires, and after she’d reassured him on that score he raised the subject of piracy. That was pretty much limited to the Indian Ocean, she said, and the only real pirates in the Caribbean these days were running gift shops. He laughed at that, and found a joke to tell her in return, and she was polite enough to pretend it was funny.\u003c/p\u003e\n\u003cp\u003eShe went back to her post and Keller returned to his cabin, where Julia showed him a key card. “What did I tell you?” she said. “Nothing to it.”\u003c/p\u003e\n\u003cp\u003eIn the morning they left the ship with Roy and Myrt, whose last names turned out to be Huysendahl. The wives had shopping to do, and Roy suggested a visit to the post office. “You won’t find anything,” Roy said. “Not if your collection’s got a 1940 cutoff date. And I probably won’t find anything, either.”\u003c/p\u003e\n\u003cp\u003e“Not much from Turkey,” Keller said.\u003c/p\u003e\n\u003cp\u003e“Doesn’t seem likely, does it? But they might have some fish stamps. It’s a popular topic, and easier to justify for a Caribbean island than some landlocked African dictatorship that gets three drops of rain every two years.”\u003c/p\u003e\n\u003cp\u003eThe post office had a special philatelic window, and a display showing just what stamps were still available for purchase. There was a very attractive set of stamps showing brilliantly colored reef fish, along with a six-stamp souvenir sheet; they’d just come out, and Roy picked up four sets, sheets included. “One for me and the others for some guys I know’ll want them. Cheaper at the post office than from a new-issues dealer.”\u003c/p\u003e\n\u003cp\u003eBack on the ship, Julia showed off a blouse she’d bought. “I don’t know that I’ll ever wear it,” she said, “but it was cheap, and Myrt bought one, so I picked it up in the interest of female bonding. Did you find any stamps to buy?”\u003c/p\u003e\n\u003cp\u003eHe showed her the two souvenir sheets he’d bought, one with fish, another showing the various islands that comprised the British Virgins. “They’re souvenir sheets,” he said, “so I bought them for a souvenir.”\u003c/p\u003e\n\u003cp\u003e“And in the interest of male bonding?”\u003c/p\u003e\n\u003cp\u003e“I suppose. He’s a nice fellow.”\u003c/p\u003e\n\u003cp\u003e“Myrt thinks the four of us should make dîner à quatre a regular thing. Could you stand sharing a table with them every night? Just the four of us?”\u003c/p\u003e\n\u003cp\u003e“Saves trying to find things to say to new people.”\u003c/p\u003e\n\u003cp\u003e“That was my thought. The British Virgins. You know what a British virgin is? A ten-year-old girl who can run faster than her brothers. Actually, that’s an old joke about Cajuns. But I’m not sure it really works to adapt it. The British don’t have that reputation.”\u003c/p\u003e\n\u003cp\u003e“Quite the reverse,” he said. “‘Dead? Sacre bleu, Monsieur, I thought she was English!’”\u003c/p\u003e\n\u003cp\u003e“Oh, I heard that joke years and years ago,” she said. “And it’s still awful.”\u003c/p\u003e\n\u003cp\u003eTwenty-Eight\u003c/p\u003e\n\u003cp\u003eAt dinner that night, Keller waited until he’d finished his main course, a nice piece of fish that had been swimming not too many hours ago. If it had been on a stamp, he thought, Roy would have snatched it away from him.\u003c/p\u003e\n\u003cp\u003eHe put his fork down, patted his pockets, said, “Hell,” and got to his feet. “Something I forgot,” he said. “I’m not interested in dessert, so please go ahead without me. I’ll join y’all for coffee if I get done in time.”\u003c/p\u003e\n\u003cp\u003eThe elevator might have been faster, but he didn’t even think of it until he’d already climbed the first flight and started on the second. He was breathing hard when he reached the Sun Deck, but caught his breath by the time he was slipping the key card into the door of the Carmody stateroom. The lock turned and he was inside.\u003c/p\u003e\n\u003cp\u003eThe maids serviced everybody’s cabin during dinner, turning down beds, turning on lights, drawing curtains, and leaving a square of foil-wrapped chocolate on the pillow. The Sun Deck staterooms were essentially two-room suites, and Keller moved around the place looking at things and wondering what he was doing here. It put him in position for an ambush, but that would only work if Carmody turned up alone. And he might: he had a lot of years on his bladder and prostate, and could well feel the need for a quick pee before catching up with the lovely Carina in the lounge, where tonight’s scheduled entertainment included a comedian and a torch singer.\u003c/p\u003e\n\u003cp\u003eBut there was at least as good a chance that they’d return together, and then what did Keller do? He’d have the advantage of surprise, and he was a skilled professional up against two amateurs, one an out-of-shape older man and the other a woman. He was confident in his ability to take out both of them, and could probably do so before either one made enough noise to attract attention. And if they did get out a cry, so what? She’d sound as though she was feigning passion, while he’d come off as a self-styled Tarzan, pounding his chest and yowling in triumph. \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-me-keller-5/page-23.html","bookId":2316,"creation":"Oct 5, 2019 6:21:23 PM","modification":"Oct 5, 2019 6:21:23 PM"}
