{"id":86177,"no":10,"title":"Page 10","content":"\u003cp\u003e“What’s ‘lockdown’?”\u003c/p\u003e\n\u003cp\u003e“If it’s some psycho with a gun, I’m jumping out the window,” another student named John says. “You guys with me?”\u003c/p\u003e\n\u003cp\u003eRam rolls his eyes. “It’s not someone with a gun, dude. That would be three long beeps instead of five short ones. This is a drug lockdown. It must not be routine, ’cause I haven’t heard anything about it.”\u003c/p\u003e\n\u003cp\u003eJohn seems amused. “Call your mom, Ram. Ask if she knows what’s up.”\u003c/p\u003e\n\u003cp\u003eDrug lockdown? I sure hope Nick Glass doesn’t bring his pu-pu platter of drugs to school with him. I look over at Madison, who came late to class. She pulls her phone from her purse and starts texting someone underneath the lab table.\u003c/p\u003e\n\u003cp\u003e“Everyone calm down,” Shevelenko says. “Most of you have been through this before. In case you haven’t guessed it, we’re in lockdown. No student can leave the building.”\u003c/p\u003e\n\u003cp\u003eMadison raises her hand. “Can I go to the bathroom?”\u003c/p\u003e\n\u003cp\u003e“Sorry, Madison.”\u003c/p\u003e\n\u003cp\u003e“But I really have to go! I promise I’ll be quick.”\u003c/p\u003e\n\u003cp\u003e“Lockdown rules state no wandering in the halls.” Shevelenko glances at her computer. “Take this time to study for the test next wednesday.”\u003c/p\u003e\n\u003cp\u003eFifteen minutes later a cop knocks on Shevelenko’s door.\u003c/p\u003e\n\u003cp\u003e“Who do you think got busted?” a guy named Frank whispers as our teacher meets the officer outside the room.\u003c/p\u003e\n\u003cp\u003eRam holds his hands up. “Don’t look at me, man. I’m not risking getting kicked off the soccer team. Besides, my mom would have me arrested herself if she found out I was doing illegal shit.”\u003c/p\u003e\n\u003cp\u003eShevelenko walks back in the room. “Carlos Fuentes,” she says loud and clear.\u003c/p\u003e\n\u003cp\u003e¡Carajo! She called my name. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“Come here.”\u003c/p\u003e\n\u003cp\u003e“Dude, you are so busted,” Frank says.\u003c/p\u003e\n\u003cp\u003eI walk up to Shevelenko, and all I can focus on is her mustache hairs moving up and down as she says, “There are some people who want to talk to you. Follow me.”\u003c/p\u003e\n\u003cp\u003eI know everyone in my bio class knows why I’ve been called out. Thing is, I don’t have any drugs in my pockets or in my locker. Maybe they found out I came from Mexico and want to deport me, although I was born in Illinois and am an American citizen.\u003c/p\u003e\n\u003cp\u003eIn the hallway two cops step toward me. “Are you Carlos Fuentes?” one of them asks.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Can you show us where your locker is?”\u003c/p\u003e\n\u003cp\u003eMy locker? I shrug. “Sure.”\u003c/p\u003e\n\u003cp\u003eI walk to my locker, the policía following so close I can feel their breath on the back of my neck. I turn the corner down J Hall and see a K9 police dog barking at my locker. What the hell?\u003c/p\u003e\n\u003cp\u003eThe dog is ordered to sit by its handler.\u003c/p\u003e\n\u003cp\u003eMr. House is standing next to my locker.\u003c/p\u003e\n\u003cp\u003e“Carlos, is this your assigned locker?” he asks me.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eHe makes a dramatic pause before saying, “I’ll only ask this once. Do you have drugs in your locker?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then you wouldn’t mind opening it, would you?”\u003c/p\u003e\n\u003cp\u003e“Nope.” I enter the combination and open the door.\u003c/p\u003e\n\u003cp\u003e“What are those things?” one of the cops asks as he points to Kiara’s cookie magnets. He steps forward to take a closer look and the K9 dog goes nuts. He pokes one. “They’re cookies,” he says dumbly.\u003c/p\u003e\n\u003cp\u003e“I think your dog is hungry,” I tell him.\u003c/p\u003e\n\u003cp\u003eThe second cop gives me a level stare. “You, be quiet. They’re probably laced with drugs and you’re selling them.”\u003c/p\u003e\n\u003cp\u003eLaced cookies? Is he kiddin’ me? They’re fucking stale cookie magnets. I start to laugh.\u003c/p\u003e\n\u003cp\u003e“You think this is funny, punk?”\u003c/p\u003e\n\u003cp\u003eI clear my throat and try to keep a straight face. “No, sir.”\u003c/p\u003e\n\u003cp\u003e“Did you make those cookies?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” I lie, because it’s none of their business who made them. “But you should probably not pull ’em off.”\u003c/p\u003e\n\u003cp\u003e“Why not? Scared we’ll find out what’s in them?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. Trust me, they’re not laced.”\u003c/p\u003e\n\u003cp\u003e“Nice try,” the cop says.\u003c/p\u003e\n\u003cp\u003eIgnoring me, the principal tries to pick off one of the cookie magnets. The cookie breaks in his hand. I cough again, trying to cover up another laugh, as he holds the crumbled brown pieces in his hand and sniffs them. I wonder what Kiara would think if she knew her cookies were under investigation.\u003c/p\u003e\n\u003cp\u003eOne of the cops crumbles another cookie off and takes a small bite to see if he can taste traces of illegal substances. He shrugs. “I don’t taste anything.” He holds the rest of the cookie under the K9’s nose. The dog goes still. “The cookies are clean,” he says. “But there’s something else in the locker. Take everything out,” he orders, then crosses his arms on his chest.\u003c/p\u003e\n\u003cp\u003eFrom the top shelf, I take out a couple of books and place them on the floor. I take more books out from the bottom. When I pull down my backpack, the dog starts freakin’ out again.\u003c/p\u003e\n\u003cp\u003eThat dog is certifiably nuts. If we watch it long enough, I’m sure its head will turn around and its eyes will roll to the back of its head.\u003c/p\u003e\n\u003cp\u003e“Take everything out of your backpack and place the items on the floor in front of you,” House says.\u003c/p\u003e\n\u003cp\u003e“Look,” I tell House. “I have no clue why that dog is about to attack my backpack. I don’t have drugs in there. Maybe the dog’s got a disorder.”\u003c/p\u003e\n\u003cp\u003e“The dog isn’t the problem, son,” the K9 officer barks out.\u003c/p\u003e\n\u003cp\u003eMy pulse races when the guy calls me “son.” I want to lash out at him, but he’s got a psycho dog he can sic on me. While I think I’m a hard-ass, I definitely know a trained psycho K9 can kick my ass.\u003c/p\u003e\n\u003cp\u003eOne by one I pull out each thing from my backpack. I lay them out in a straight line.\u003c/p\u003e\n\u003cp\u003eOne pencil.\u003c/p\u003e\n\u003cp\u003eTwo pens.\u003c/p\u003e\n\u003cp\u003eOne notebook.\u003c/p\u003e\n\u003cp\u003eOne Spanish book.\u003c/p\u003e\n\u003cp\u003eOne can of Coke.\u003c/p\u003e\n\u003cp\u003eThe dog starts barking again. Wait, I didn’t put a can of Coke in there. The principal picks up the can, starts unscrewing the top and . . . oh, shit. It’s not a can of Coke. It’s a fake one with . . .\u003c/p\u003e\n\u003cp\u003eOne bag of weed. A big bag. And . . .\u003c/p\u003e\n\u003cp\u003eOne bag with a bunch of white and blue pills inside.\u003c/p\u003e\n\u003cp\u003e“That’s not mine,” I tell them.\u003c/p\u003e\n\u003cp\u003e“Whose is it, then?” the principal asks. “Give us names.”\u003c/p\u003e\n\u003cp\u003eI’m pretty sure it’s Nick’s, but I’m not about to rat on him. If there’s one thing I’ve learned in Mexico, it’s that you don’t open your mouth. Ever. Even if I don’t give a shit about Nick, I’m about to take the fall whether I like it or not. “I don’t have any names. I’ve only lived here a week, give me a break.”\u003c/p\u003e\n\u003cp\u003e“We don’t give breaks. Not on school property, which makes this a felony,” one of the officers says, eyeing my tattoos. He takes the bags from the principal, then opens the one with the pills. “This is Oxy-Contin. And this,” he says, opening the bag with the weed, “is enough marijuana for us to know you’re not just smoking it, you’re selling it.”\u003c/p\u003e\n\u003cp\u003e“Do you understand what this means, Carlos?” the principal asks.\u003c/p\u003e\n\u003cp\u003eYeah, I know what it means. It means Alex is gonna kill me.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eKiara\u003c/p\u003e\n\u003cp\u003eWhen I found out Carlos got arrested, I immediately had the instinct to call my dad. He said he’d call Alex and find out what was happening and where Carlos was taken.\u003c/p\u003e\n\u003cp\u003eAt home, my mom greets me at the door. “Your father said he’ll be home soon with some news about Carlos.”\u003c/p\u003e\n\u003cp\u003e“So you know what happened?”\u003c/p\u003e\n\u003cp\u003eShe nods. “Alex told your dad that Carlos keeps insisting the drugs aren’t his.”\u003c/p\u003e\n\u003cp\u003e“Does Alex believe him?”\u003c/p\u003e\n\u003cp\u003eMy mom sighs, and I know she wants to give me better news. “He’s skeptical.”\u003c/p\u003e\n\u003cp\u003eMy dad comes home with hair that looks like he ran his hand through it too many times today. “Family-meeting time,” he says.\u003c/p\u003e\n\u003cp\u003eWhen the entire family is in the living room, my dad clears his throat. “How would you all feel about having Carlos stay here for the rest of the school year?”\u003c/p\u003e\n\u003cp\u003e“Who’s Carlos?” Brandon asks, clueless.\u003c/p\u003e\n\u003cp\u003e“The brother of one of my former students. And one of Kiara’s friends.” My dad looks from me to my mom. “Turns out the place where he’s living is subsidized student apartments. Since Carlos isn’t a student at the university, the judge said it’s against policy for him to stay there.”\u003c/p\u003e\n\u003cp\u003e“I get a brother? Cool!” Brandon yells. “Can he sleep in my room? You can buy us bunk beds and everything.”\u003c/p\u003e\n\u003cp\u003e“Don’t get too excited, Bran. He’ll stay in the yellow room,” my dad tells my brother.\u003c/p\u003e\n\u003cp\u003e“How’s Carlos holding up?” my mom asks.\u003c/p\u003e\n\u003cp\u003e“I don’t know. I think underneath it all he’s a good kid who’ll thrive in a positive and stable drug-free home environment. I’d like to help out if we’re all in agreement. It’s either our house, or he goes back to Mexico. Alex said he’d do just about anything to keep him here.”\u003c/p\u003e\n\u003cp\u003e“I’m okay with him staying here,” I say, realizing after I say it that I actually mean it. Everyone deserves a second chance.\u003c/p\u003e\n\u003cp\u003eMy dad looks at my mom, who reaches out and brings his head closer to hers. “My husband is going to save the world one kid at a time, huh?”\u003c/p\u003e\n\u003cp\u003eHe smiles at her. “If that’s what it takes.”\u003c/p\u003e\n\u003cp\u003eShe kisses him. “I’ll make sure there are clean sheets on the bed in the guest room.”\u003c/p\u003e\n\u003cp\u003e“I married the best woman,” he tells her. “I’ll call Alex and tell him it’s a go,” he adds excitedly. “Monday we’ll meet with the judge again. We’re going to lobby to get him into the REACH program at Flatiron instead of being expelled.”\u003c/p\u003e\n\u003cp\u003eI watch as my dad leaves the living room and heads for his office.\u003c/p\u003e\n\u003cp\u003e“He’s on a mission,” my mom says. “He’s has that spark in his eye when he’s got a challenge in front of him.”\u003c/p\u003e\n\u003cp\u003eI just hope he keeps that spark alive, because I have a feeling my dad’s patience— which is probably at the sainthood level—is about to be tested big-time.\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eCarlos\u003c/p\u003e\n\u003cp\u003e“Just send me back to Chicago and be done with me already,” I tell Alex on Sunday morning after I hang up with mi\u0027amá. Alex forced me to tell her what’s going on.\u003c/p\u003e\n\u003cp\u003eWhen the police escorted me out in handcuffs, I was fine with it. Seeing my brother come to the station with frustration and disappointment etched on his face didn’t faze me. But talking to my mom just now and hearing her cry and ask me what happened to her niñito was my undoing.\u003c/p\u003e\n\u003cp\u003eShe also told me I shouldn’t come back to Mexico. “It’s not safe here for you,” she told me. “Auséntese, Carlos, stay away.” I wasn’t surprised. My entire life has been full of people leavin’ me or tellin’ me to stay away from them—mi papá, Alex, Destiny, and now mi\u0027amá.”\u003c/p\u003e\n\u003cp\u003eAlex is lying in his bed, his forearm covering his eyes. “You’re not goin’ back to Chicago, either. Professor Westford and his wife are lettin’ you live at their house. It’s a done deal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-10.html","bookId":2768,"creation":"Oct 5, 2019 5:12:24 PM","modification":"Oct 5, 2019 5:12:24 PM"}
