{"id":86185,"no":18,"title":"Page 18","content":"\u003cp\u003eI beep.\u003c/p\u003e\n\u003cp\u003e“I’m not movin’,” he says.\u003c/p\u003e\n\u003cp\u003eMy response is another beep. It’s not an intimidating, deep beep like most cars, but it’s the best my car can give.\u003c/p\u003e\n\u003cp\u003eHe places both hands on the hood.\u003c/p\u003e\n\u003cp\u003e“Move,” I say.\u003c/p\u003e\n\u003cp\u003eHe moves all right. With pantherlike quickness, Carlos jumps through the open passenger window, feet first. “You should get the door fixed,” he says.\u003c/p\u003e\n\u003cp\u003eGuess he’s coming along for the ride. I pull out of the driveway and head into Boulder Canyon. The wind is blowing through the open windows, the fresh air hitting me in the face and whipping my ponytail against the back of my neck.\u003c/p\u003e\n\u003cp\u003e“I could fix the door,” Carlos tells me. He puts his hand out the window, letting the wind rush through his fingers.\u003c/p\u003e\n\u003cp\u003eI drive up Boulder Canyon Road in silence, taking in the scenery. You’d think I’d be immune to the beauty of it after living here so long, but I’m not. I’ve always felt a strange fascination and peace with the mountains.\u003c/p\u003e\n\u003cp\u003eI park by The Dome; I occasionally mountain climb with Tuck here. I reach in the backseat to get my backpack and step out of the car.\u003c/p\u003e\n\u003cp\u003eCarlos sticks his head out the window. “I’m assumin’ this isn’t your destination.”\u003c/p\u003e\n\u003cp\u003eI admit I get a little satisfaction when I say, “Guess again.” Slinging on my backpack, I start walking toward the bridge suspended over Boulder Creek.\u003c/p\u003e\n\u003cp\u003e“Yo, chica,” he calls after me.\u003c/p\u003e\n\u003cp\u003eI keep walking, heading for my sanctuary in the mountains.\u003c/p\u003e\n\u003cp\u003e“¡Carajo!” I don’t turn around, but by the sounds he’s making and the Spanish swear words flying out of his mouth I can tell he’s trying to open the passenger door to get out. He’s hopelessly unsuccessful. When he climbs out the window and falls on the makeshift gravel parking lot, I hear him curse again.\u003c/p\u003e\n\u003cp\u003e“Kiara, dammit, wait up!”\u003c/p\u003e\n\u003cp\u003eI’m at the base of the mountain now, at the beginning of my usual route.\u003c/p\u003e\n\u003cp\u003e“Where the hell are we?” he asks.\u003c/p\u003e\n\u003cp\u003eI point to the sign, then start toward the big boulders.\u003c/p\u003e\n\u003cp\u003eI can hear him slipping on pebbles as he tries to keep up. We’re on the trail now, but soon I’m going to veer off and follow my private path. He’s definitely not wearing appropriate hiking shoes. “You’ve got some serious problems, chica,” he growls.\u003c/p\u003e\n\u003cp\u003eI keep walking. When I’m halfway to my destination, I stop and pull out a water bottle from my backpack. It’s not too hot, and I’m used to the altitude, but I’ve seen people get dehydrated here and it’s not pretty.\u003c/p\u003e\n\u003cp\u003e“Here,” I say, holding the bottle out to him.\u003c/p\u003e\n\u003cp\u003e“Are you kiddin’ me? You probably poisoned it.”\u003c/p\u003e\n\u003cp\u003eI take a long gulp, then offer it to him again. He makes a big deal of wiping the mouth of the bottle with the bottom of his T-shirt, as if I have cooties; then he takes a long drink.\u003c/p\u003e\n\u003cp\u003eWhen he hands it back, I make a bigger deal of wiping off his germs with the bottom of my own T-shirt. I think I hear him chuckle. Either that or he’s covering up his heavy breathing from the climb.\u003c/p\u003e\n\u003cp\u003eWhen I start walking again, Carlos is huffing and puffing. “Is this fun for you? ’Cause this is definitely not my idea of a good time.”\u003c/p\u003e\n\u003cp\u003eI keep up my pace. Every time Carlos slips, he curses. You’d think he’d concentrate hard on hiking and not slipping on the rocks, but he keeps jabbering on.\u003c/p\u003e\n\u003cp\u003e“Did I tell you it’s annoyin’ that you hardly say anythin’ to me anymore? You’re like a mute who doesn’t use any hand gestures. I mean, seriously, it’s irritatin’ the hell outta me. Don’t you think I have enough to deal with, bein’ framed, arrested, and havin’ to go to that stupid REACH program?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I come to the place where I have to go over a small ledge and grab on to overhanging rocks for support. I’m fully supported and even if I fall it’s only a few feet down to a flat area.\u003c/p\u003e\n\u003cp\u003e“Is this a joke?” he asks, following my lead just because at this point he probably doesn’t think he has a choice. “Are we goin’ somewhere, or are you just wanderin’ around aimlessly until I slip and plunge to my death?”\u003c/p\u003e\n\u003cp\u003eClimbing over the big rock that shields my spot from hikers, I stop when I reach the open area with a big, lone tree. I stumbled upon this place years ago, when I needed a place to just come and . . . think. Now I come a lot. I do homework here, I draw, I listen to the birds, and I take in the smell of fresh mountain air.\u003c/p\u003e\n\u003cp\u003eI sit on a flat rock, open my backpack, and place the water bottle next to me. I open my calculus book and start doing my homework.\u003c/p\u003e\n\u003cp\u003e“Are you actually studyin’?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“And what am I supposed to do?”\u003c/p\u003e\n\u003cp\u003eI shrug. “Look around.”\u003c/p\u003e\n\u003cp\u003eHe quickly looks left and right. “I don’t see nothin’ but rocks and trees.”\u003c/p\u003e\n\u003cp\u003e“That figures.”\u003c/p\u003e\n\u003cp\u003e“Give me your keys,” he demands. “Now.”\u003c/p\u003e\n\u003cp\u003eI ignore him.\u003c/p\u003e\n\u003cp\u003eI hear him huff and puff. He could easily overpower me, grab my backpack, and fish the keys out himself. But he doesn’t.\u003c/p\u003e\n\u003cp\u003eI keep my head in my book, going through equations and writing notes on scratch paper.\u003c/p\u003e\n\u003cp\u003eCarlos takes a deep breath. “Okay, I’m sorry. Perdón. Madison and I are history, and I’d much rather model with you than hang out with her. Wow, being in nature has restored my faith in humanity and made me a better person. Now are you happy?”\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eCarlos\u003c/p\u003e\n\u003cp\u003eI watch as Kiara closes her book, looks up at me, then reaches in her backpack. She tosses me the keys to her car. I catch them with one hand.\u003c/p\u003e\n\u003cp\u003e“You just gonna stay here?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” she answers.\u003c/p\u003e\n\u003cp\u003e“I’m leavin’,” I warn her.\u003c/p\u003e\n\u003cp\u003e“So go,” she says, waving.\u003c/p\u003e\n\u003cp\u003eI will. I sure as hell am not waitin’ for her to finish studying. I’m hot, sweaty, and totally pissed off. And I’m thinking of ways to get revenge, the first of which is taking her car and makin’ sure it comes back without a lick of gas.\u003c/p\u003e\n\u003cp\u003eShoving the keys into my back pocket, I start to climb down. I slide a few times and fall on my ass. I’m gonna have more than one bruise in the morning, thanks to Kiara.\u003c/p\u003e\n\u003cp\u003eI briefly feel sorry for that dude Tuck for having to deal with her, but then I figure they deserve each other. My thoughts turn to Destiny. If she was up on this mountain all alone, I wouldn’t let her out of my sight. I’d play her knight in shining armor. Hell, I’d even carry her up the mountain on my back if that’s what she wanted.\u003c/p\u003e\n\u003cp\u003eAnd while Kiara isn’t my girlfriend and never will be, I can’t just leave her. I know there are bears here. What if she gets attacked by one? Did she seriously expect me to leave, or is this a test to see what a good guy I am?\u003c/p\u003e\n\u003cp\u003eShe’s outta luck ’cause I’m not a good guy.\u003c/p\u003e\n\u003cp\u003eI keep slippin’ down the mountain. Just when I think I’ve found a path, I get to a dead end or a fucking cliff.\u003c/p\u003e\n\u003cp\u003eI grab a rock and chuck it. Then another one. And another. Hearing the echo of them bouncing off the rocks below eases my frustration just a fraction.\u003c/p\u003e\n\u003cp\u003eI take off my shirt, wipe my forehead, and tuck the shirt into the back of my jeans.\u003c/p\u003e\n\u003cp\u003eI’m not in Mexico anymore, that’s for sure. Nobody I know would wander in the fucking mountains just to study. Now, if the aim was to do drugs or get drunk, I could understand it.\u003c/p\u003e\n\u003cp\u003eI storm back up the rocks, cursing the lack of traction in my shoes, and cursing Alex, mi\u0027amá, and Kiara, and just about everyone else I’ve ever met.\u003c/p\u003e\n\u003cp\u003e“You’re loco, chica,” I yell when I climb back over the rock that shields her private spot. “I mean, seriously, did you expect me to follow you up here just so you could toss me the keys to your car and leave?”\u003c/p\u003e\n\u003cp\u003e“I didn’t ask you to follow me,” she says.\u003c/p\u003e\n\u003cp\u003e“Like I had a choice?”\u003c/p\u003e\n\u003cp\u003e“We both have f-f-free will.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, my free will got taken away the minute I got on that plane to Colorado.”\u003c/p\u003e\n\u003cp\u003eI sit on the ground, facing her. Kiara continues taking notes. We came up here together, and we’re gonna leave here together. I’m not gonna like it, but at this point I don’t see any other option. Every once in a while she looks up and catches me staring at her. Yeah, I’m doing it to make her uncomfortable. Maybe if I annoy her enough she’ll want to pack up and leave.\u003c/p\u003e\n\u003cp\u003eBut after five minutes I can tell my strategy isn’t workin’.\u003c/p\u003e\n\u003cp\u003eTime to change tactics. “Want to make out?”\u003c/p\u003e\n\u003cp\u003e“With who?” she asks, not bothering to look up.\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003eShe lifts her head from her book just long enough to give me a once-over. “No, thanks,” she says, then goes back to her homework.\u003c/p\u003e\n\u003cp\u003eShe’s fuckin’ with me.\u003c/p\u003e\n\u003cp\u003eShe’s got to be fuckin’ with me, right? “Because of that pendejo Tuck?”\u003c/p\u003e\n\u003cp\u003e“No. Because I don’t want Madison’s leftovers.”\u003c/p\u003e\n\u003cp\u003eWait. Un. Momento. I’ve been called a lot of things before, but . . . “You callin’ me leftovers?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Besides, Tuck is a great kisser. I wouldn’t want you to feel bad when there’s no way you can compete.”\u003c/p\u003e\n\u003cp\u003eThat guy hardly owns a pair of lips. “Wanna bet?”\u003c/p\u003e\n\u003cp\u003eI’m anything but leftovers. After we moved to Mexico and Destiny broke up with me, all I did was date one girl after another. Hell, I could write a book on kissing chicas if I wanted to.\u003c/p\u003e\n\u003cp\u003eI lean toward Kiara and get a small dose of satisfaction when I hear her breath hitch and notice her pencil stop moving. She doesn’t move an inch as my lips get close to that place right below her right earlobe. I reach up with my left hand and touch the sensitive spot below her left ear with my thumb while my lips hover over her neck. She can definitely feel my hot breath on her bare skin.\u003c/p\u003e\n\u003cp\u003eShe tilts her head the slightest bit, giving me more access. I’m not even sure she realized she’s doing it. I stay where I am. She moans almost silently, but I don’t give in. She’s definitely being turned on. She likes this. And she wants more. But I’m holding back . . . leftovers, my ass.\u003c/p\u003e\n\u003cp\u003eThe problem is, I’m not prepared for what Kiara smells like. Usually girls smell too much like flowers or vanilla, but Kiara has a distinctly sweet raspberry scent that’s totally turning me on. And while my mind is telling me I’m flirting with her just to prove a point, my body wants to play “you show me your perky privates and I’ll show you mine.”\u003c/p\u003e\n\u003cp\u003e“D-d-do you m-m-mind?” she says. She might be trying to mask her reaction to me being so close, but her words betray her. “I’m trying to work and you’re blocking my sun,” she whispers. I’m guessin’ she doesn’t stutter when she whispers.\u003c/p\u003e\n\u003cp\u003e“We’re in the shade, under a tree,” I say, but pull away anyway because I need to cool down and stay in control.\u003c/p\u003e\n\u003cp\u003eI lean back against a rock, the rough edges rubbing into my bare back. I bend one knee and get in a relaxed position even though I’m anything but relaxed. While I’m trying to get comfortable, Kiara is still sitting under that damn tree doin’ her homework. She’s not sweating at all, and she appears totally relaxed. I don’t know if I’m hot because of what just happened, or didn’t happen, between us. Or if it’s because of the weather. You’d think I’d be used to the hot weather from Mexico, but I was born in Chicago and spent most of my life there. The summers in Chi-Town are humid and hot, but it only lasts a few months. \u003c/p\u003e","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-18.html","bookId":2768,"creation":"Oct 5, 2019 5:12:24 PM","modification":"Oct 5, 2019 5:12:24 PM"}
