{"id":86175,"no":8,"title":"Page 8","content":"\u003cp\u003eHe shoos me away. “Ach, you girls today want it all . . . and then some.”\u003c/p\u003e\n\u003cp\u003e“Don’t listen to him, Kiara,” Sylvia says, waving me over. “What you want is a nice boy . . . a real gentleman.”\u003c/p\u003e\n\u003cp\u003e“There are no such things,” Mildred says next to her.\u003c/p\u003e\n\u003cp\u003eA nice boy. I thought Michael was nice, and he couldn’t even dump me like a gentleman. “Maybe I’ll just stay single for the rest of my life.”\u003c/p\u003e\n\u003cp\u003eBoth Mildred and Sylvia shake their heads vigorously, their wispy white hair flying from side to side. “No!” they both say.\u003c/p\u003e\n\u003cp\u003e“You don’t want that,” Sylvia says.\u003c/p\u003e\n\u003cp\u003e“I don’t?”\u003c/p\u003e\n\u003cp\u003e“Nope.” She looks over at Mr. Whittaker. “Because we need them . . . even if they are the devil incarnate.” She motions me closer. “I wouldn’t mind if he patted my butt.”\u003c/p\u003e\n\u003cp\u003e“Amen to that, sister,” Mildred says as she swipes her brush on the canvas. She’s painting a silhouette that looks suspiciously like a nude man. “Why don’t you ask that nice boy Tuck to come and pose for us? You said we can do live subjects.”\u003c/p\u003e\n\u003cp\u003e“I was thinking of a dog,” I tell her.\u003c/p\u003e\n\u003cp\u003e“No. Get us a male model.”\u003c/p\u003e\n\u003cp\u003e“I’m not drawing some guy,” Mr. Whittaker yells from across the room. “Kiara will have to model, too.”\u003c/p\u003e\n\u003cp\u003e“I’m not promising anything,” I tell the class. Wait until I call Tuck today and ask him to be a male model for my class. I think he might just go along with it.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eCarlos\u003c/p\u003e\n\u003cp\u003e“Heeeey,” Madison sings. “I’m back.”\u003c/p\u003e\n\u003cp\u003eAnd she’s brought about ten other people with her. They all gather by the bong and pass it around, each takin’ hits. I wonder what Kiara and her friends are doin’ tonight. I bet she’s studying for her SATs or something like that, so she can get into a good college, while I’m at a bong-and-little-blue-pill party.\u003c/p\u003e\n\u003cp\u003eNick lines up the pills on a tray. It reminds me of what Alex called a pu-pu platter.\u003c/p\u003e\n\u003cp\u003eWhen Madison passes the bong to me with a big smile, I want to forget about Kiara and SATs and college and bein’ good. I’m a thug, so I better start actin’ like one.\u003c/p\u003e\n\u003cp\u003eI take a hit, inhaling the sweet smoke into my lungs. The stuff is definitely potent, because I feel the effects before I even hand the bong to the person next to me. When it comes back around, this time I take a long, slow hit. By the fourth time, I’m stoned enough not to care about Kiara and her cookies or Alex gettin’ on my case all the time, or the fact that I lied to Brittany when I promised I wouldn’t drink or do drugs tonight.\u003c/p\u003e\n\u003cp\u003eRight now I only want to think about life’s burning questions, like . . . “Why doesn’t Heavy Shevy shave her mustache?”\u003c/p\u003e\n\u003cp\u003e“Maybe she’s a man in disguise,” Nick says.\u003c/p\u003e\n\u003cp\u003e“But why would he choose an ugly woman as a disguise?” I ask. Seriously.\u003c/p\u003e\n\u003cp\u003e“Maybe he’s an ugly man and has no other choice.”\u003c/p\u003e\n\u003cp\u003e“Makes sense.” I watch Madison take another hit. She sees me watching her, then smiles at me as she wiggles her way onto my lap and licks her lips. By the length and pointy tip of her tongue I think she might have iguana genes in her family tree. She leans forward, her chichis inches from my face.\u003c/p\u003e\n\u003cp\u003e“Nick has the best shit,” she coos, leanin’ back and stretching on me like a cat on a rug. Needless to say, I’m the rug. She twists herself around, straddles me, and wraps both arms around my neck. Her eyes are at half-mast. “You’re sexy.”\u003c/p\u003e\n\u003cp\u003e“So are you.”\u003c/p\u003e\n\u003cp\u003e“We’re a perfect match.” She traces my chin with her finger and leans forward. That iguana tongue of hers sneaks out and her body starts writhing against mine. She licks my chin, which I have to admit no girl has ever done to me before. I’m not too keen on having this girl do it a second time, either.\u003c/p\u003e\n\u003cp\u003eWe start makin’ out in front of everyone. I think Madison likes the spotlight, ’cause when one of the girls makes a comment to one of the guys to stop watching, Madison leans back and starts pullin’ up her shirt like she’s a stripper at a club givin’ me a lap dance. It’s obvious Madison wants to be watched and admired by all the guys, and envied by all the girls.\u003c/p\u003e\n\u003cp\u003eThis girl is definitely an exhibitionist, but when I look to my left and find Nick making out with a shirtless Lacey I start to wonder if everyone is expected to show off their sexual talents in public here.\u003c/p\u003e\n\u003cp\u003eThat’s not me. “Let’s go somewhere private,” I tell Madison as she reaches down to feel me over my jeans.\u003c/p\u003e\n\u003cp\u003eShe pouts for a minute, then wiggles her way off my lap and holds out her hand. “Come on.”\u003c/p\u003e\n\u003cp\u003eThe night is moving way too fast. I’d rather chill, and in the back of my mind I remember Ram warned me about Madison, but she grabs my hand and pulls me up.\u003c/p\u003e\n\u003cp\u003e“Have fun, you two,” Nick calls out.\u003c/p\u003e\n\u003cp\u003eTwo minutes later we enter a huge room with a king-size bed against the wall.\u003c/p\u003e\n\u003cp\u003e“Your room?” I ask.\u003c/p\u003e\n\u003cp\u003eMadison shakes her head. “It’s my parents’, but they’re hardly home. Right now they’re in Phoenix.” I sense traces of bitterness in her voice, and I’m sure foolin’ around on their bed is her revenge.\u003c/p\u003e\n\u003cp\u003eShould I tell her I’d rather do this on the floor instead of her parents’ bed?\u003c/p\u003e\n\u003cp\u003e“Let’s go to your room,” I say.\u003c/p\u003e\n\u003cp\u003eShe shakes her head, then pulls me closer to the bed.\u003c/p\u003e\n\u003cp\u003e“What did Ram say about me?” she asks.\u003c/p\u003e\n\u003cp\u003e“It’s kind of hard to think about that right now,” I tell her. “I’m as baked as you are.”\u003c/p\u003e\n\u003cp\u003e“Just try and remember. Did he mention why we broke up? Because if he did, it wasn’t all my fault. I mean, it’s not like I knew what he knew and that I didn’t know what I was doing. And if I did know, it wasn’t because I knew that he knew. It’s not like his mother would have found out and have us all arrested.”\u003c/p\u003e\n\u003cp\u003eMy head aches from listenin’ to her. “Okay,” I say. I have no clue what she just said, but I figure a response of “okay” might cover the bases. One can only hope.\u003c/p\u003e\n\u003cp\u003e“Really?” she says, smiling.\u003c/p\u003e\n\u003cp\u003eHuh? I have no fuckin’ clue what I’m talkin’ about. Or what she’s talkin’ about.\u003c/p\u003e\n\u003cp\u003eShe hugs me tight, her chichis pressed hard against my chest. I hope they don’t burst from the pressure of being squished against me.\u003c/p\u003e\n\u003cp\u003eThoughts of bursting chichis are creepin’ me out. And my mind wanders to thoughts of Kiara and what she looks like under those huge shirts. For a second I think the unknown of Kiara’s body is sexier than what Madison flaunts every day.\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut. What am I thinkin’? Kiara isn’t sexy. She’s frustrating and challenges me more than my own family.\u003c/p\u003e\n\u003cp\u003e“Did I tell you what Kiara did to my locker?” I ask.\u003c/p\u003e\n\u003cp\u003eShe urges me onto the bed. “I don’t really care about Kiara. Stop talking about another girl when you’re here with me.” She’s right. I need to stop talking about Kiara. I like things that come easily to me, and Kiara isn’t one of them. Madison is.\u003c/p\u003e\n\u003cp\u003eBefore I know it, we’re gettin’ hot and heavy on her parents’ bed. She’s sitting on me, her hair in my face. I think some of her hair is in our mouths as we’re kissing, but she doesn’t seem to notice. I do.\u003c/p\u003e\n\u003cp\u003eShe leans back. “Wanna do it?” she slurs.\u003c/p\u003e\n\u003cp\u003eSure I want to do it. But when I look to the side and see a picture of her parents smiling at us from one of the nightstands, it hits me. She doesn’t want me because I’m me—she wants me because I’m a drugged-out thug, the exact opposite of who her parents want her to be with.\u003c/p\u003e\n\u003cp\u003eBut tellin’ myself I’m a thug is one thing. Actin’ like one is another. “I gotta go,” I tell her.\u003c/p\u003e\n\u003cp\u003e“Wait. Oh, no. I’m not feeling well. I think I’m gonna be sick.”\u003c/p\u003e\n\u003cp\u003eShe pushes herself up and runs to the bathroom, locking herself in. The sounds of gagging and puking echo through the room a second later.\u003c/p\u003e\n\u003cp\u003eI knock on the door. “Need help?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Open the door, Madison.”\u003c/p\u003e\n\u003cp\u003e“No. Get Lacey.”\u003c/p\u003e\n\u003cp\u003eWhen I do, Lacey and a bunch of other girls rush in the room to help. I’m standing in the doorway, watching them treat Madison like she’s really sick instead of puking from getting drunk and stoned.\u003c/p\u003e\n\u003cp\u003eAfter twenty minutes of standing around being ignored, and confident that Madison is having her every need taken care of, I figure I’ve had enough of this party.\u003c/p\u003e\n\u003cp\u003eOutside, I pull out Brittany’s pink heart keychain. I rev the engine and put the car in drive, but when I look up and the lines on the road are blurry I know I can’t do it. I’m too stoned, too drunk, or a mixture of both.\u003c/p\u003e\n\u003cp\u003eShit. I have two options. Go back in Madison’s house and find a place to crash, or sleep in the car.\u003c/p\u003e\n\u003cp\u003eIt’s not even a contest.\u003c/p\u003e\n\u003cp\u003eI push the button to recline the seat and close my eyes, hopin’ tomorrow I can figure out what actually happened tonight.\u003c/p\u003e\n\u003cp\u003eBright. It’s too bright. I open my eyes to the morning sun hittin’ me right in the face. I’m still in Brittany’s car. With the top down. When I get back to Alex’s place, I find him sitting at the table with a mug of coffee in his hands.\u003c/p\u003e\n\u003cp\u003eHe stands when I toss Brittany’s keys on the table.\u003c/p\u003e\n\u003cp\u003e“You told me you’d be home in a couple of hours. Are you aware it’s nine? De la mañana.”\u003c/p\u003e\n\u003cp\u003eI rub my palms over my eyes. “Please, Alex,” I moan. “Can you wait until at least noon to yell at me?”\u003c/p\u003e\n\u003cp\u003e“I’m not gonna yell at you. I’m just not gonna let you drive Brittany’s car again.”\u003c/p\u003e\n\u003cp\u003e“Fine.” I notice the air mattress is still set up. I fall onto it and close my eyes.\u003c/p\u003e\n\u003cp\u003eAlex pulls the pillow out from under my head. “Are you high?”\u003c/p\u003e\n\u003cp\u003e“Not anymore, unfortunately.” I grab the pillow back.\u003c/p\u003e\n\u003cp\u003eI hear my brother sit on his bed and let out a heavy sigh. Poor guy probably needs to smoke some weed to relax. I swear I can feel his eyes boring into my skull like two little lasers.\u003c/p\u003e\n\u003cp\u003e“What do you want?” I mumble into my pillow.\u003c/p\u003e\n\u003cp\u003e“Do you not fuckin’ care about anyone but yourself?”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003e“Didn’t you realize I would worry about you?”\u003c/p\u003e\n\u003cp\u003e“Nope. That thought didn’t cross my mind even once.”\u003c/p\u003e\n\u003cp\u003eSomeone knocking on the door thankfully stops him from askin’ me more questions.\u003c/p\u003e\n\u003cp\u003eI hear my brother say, “Hey, chica.”\u003c/p\u003e\n\u003cp\u003eLet me guess— it’s Brittany.\u003c/p\u003e\n\u003cp\u003e“Carlos forgot to put my top up,” she tells Alex. “And it’s starting to rain. He left your phone in the passenger seat. I hope it still works.”\u003c/p\u003e\n\u003cp\u003eIf they ever get married, I feel sorry for their kids. I hope those niños never fuck up . . . because Brittany and Alex are both lookin’ at me as if they want to ground me for life.\u003c/p\u003e\n\u003cp\u003eToo bad for them, they’re not my parents.\u003c/p\u003e\n\u003cp\u003e10\u003c/p\u003e\n\u003cp\u003eKiara\u003c/p\u003e\n\u003cp\u003eOn Monday, rumors are flying about Madison Stone’s party. Most of them revolve around Madison and Carlos getting it on in her parents’ bed.\u003c/p\u003e\n\u003cp\u003eOn Tuesday and Wednesday, I notice Madison sitting with Carlos at his lunch table. \u003c/p\u003e","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-8.html","bookId":2768,"creation":"Oct 5, 2019 5:12:24 PM","modification":"Oct 5, 2019 5:12:24 PM"}
