{"id":37040,"no":22,"title":"CHAPTER XXI. ROBERT AND THE OLD LUMBERMAN.","content":"It must be confessed that Robert was in no humor to hunt up Herman Wenrich.\n\u003cbr\u003e \n\u003cbr\u003e \"Even if I find him, what good will it do, if I can\u0027t offer him the money for the map?\" was his mental comment.\n\u003cbr\u003e \n\u003cbr\u003e Nevertheless, there seemed to be nothing else to do, and so, after a lunch, he started again for No. 238 Grandon Street.\n\u003cbr\u003e \n\u003cbr\u003e He was careful where he went this time, and found the thoroughfare without further difficulty. It was fully eight blocks from the tenement where he had been robbed.\n\u003cbr\u003e \n\u003cbr\u003e The number he was searching for was a block away, and as he walked toward it two men passed him whom he instantly recognized. The men were Jean Le Fevre and Oscar Hammerditch.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I declare!\" muttered the boy. \"Can it be possible that they have been calling upon Herman Wenrich?\"\n\u003cbr\u003e \n\u003cbr\u003e It certainly would seem so, yet Robert had no[Pg 179] way of proving it. Both the Canadian and the Englishman were walking rapidly, and soon they passed out of sight around the corner.\n\u003cbr\u003e \n\u003cbr\u003e Robert found No. 238 Grandon Street a modest dwelling set in the rear of a tiny garden of flowers. As he entered the garden a girl came out on the front porch and gazed up and down the street anxiously. She was probably fifteen years of age, and was pale and thin, as if just getting over a long sickness, which was the case.\n\u003cbr\u003e \n\u003cbr\u003e \"Does Mr. Herman Wenrich live here?\" asked Robert politely, as he tipped his hat.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir,\" answered the girl.\n\u003cbr\u003e \n\u003cbr\u003e \"Is he in?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is, but he is not very well.\"\n\u003cbr\u003e \n\u003cbr\u003e As she spoke the girl eyed Robert sharply, wondering what he wanted.\n\u003cbr\u003e \n\u003cbr\u003e \"He doesn\u0027t look like one of these traveling agents,\" she thought. She had been bothered with agents a great deal lately.\n\u003cbr\u003e \n\u003cbr\u003e \"I am sorry to hear Mr. Wenrich is not well,\" said Robert. \"I wished to see him on a little business.\"\n\u003cbr\u003e \n\u003cbr\u003e \"May I ask your name?\"\n\u003cbr\u003e \n\u003cbr\u003e \"My name is Robert Frost. But he doesn\u0027t know me. You might tell him that I came here at[Pg 180] the request of Richard Marden, who is a nephew of Felix Amberton, of Timberville, Michigan. I wish to see him about a lumber tract up there.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why, that is what those two men came about!\" cried the girl.\n\u003cbr\u003e \n\u003cbr\u003e \"You mean the two men I just met on the street?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I presume they are the same. The men left but a minute before you came.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Can you tell me if they came for a map?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why, yes, they——\" The girl stopped short. \"I do not know as I have any right to talk of these things, Mr. Frost. My father might not like it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So Mr. Wenrich is your father.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes. My name is Nettie Wenrich.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert bowed. \"I certainly would not wish to make any trouble for you,\" he said, with a smile. \"But I would like to see your father.\"\n\u003cbr\u003e \n\u003cbr\u003e Nettie Wenrich hesitated for a moment. \"He looks like a nice boy,\" she thought. \"I like him better than I did those men.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Come into the parlor and I will tell father you are here,\" said she.\n\u003cbr\u003e \n\u003cbr\u003e Robert found the parlor small but cozy. There were several covered chairs, some pictures and books, and in one corner stood a small organ. The youth sat down near a window and waited.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 181]\n\u003cbr\u003e \n\u003cbr\u003e The girl was gone fully five minutes. When she returned her face bore a puzzled look.\n\u003cbr\u003e \n\u003cbr\u003e \"Father does not know what to make of this,\" she said. \"You say you came because Mr. Amberton sent you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Marden sent me. He is Mr. Amberton\u0027s nephew and has taken full charge, now that Mr. Amberton is sick.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Father says Mr. Hammerditch, one of the men who just called, said Mr. Amberton sent him for the map.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What!\" cried Robert, leaping to his feet. \"That cannot be possible.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because those men are enemies of Mr. Amberton. They wish to get some of his lumber lands away from him.\"\n\u003cbr\u003e \n\u003cbr\u003e The girl studied Robert\u0027s honest face for a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"I believe you. But it is a queer mix-up,\" was her comment.\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps I can explain some things, Miss Wenrich. But I would like to talk with your father first.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well. But my father is quite sick, and I would not like to have you excite him.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 182]\n\u003cbr\u003e \n\u003cbr\u003e \"I will be careful. But I hope he didn\u0027t let them have the map.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, he is holding that. They made a proposition to him and he said he would think it over.\"\n\u003cbr\u003e \n\u003cbr\u003e Nettie Wenrich led the way to the second story of the cottage, and to the front bedchamber. Here, on a snowy couch lay Herman Wenrich, feeble with age and a malady that had attacked his digestive organs.\n\u003cbr\u003e \n\u003cbr\u003e \"I do not wish to disturb you, Mr. Wenrich,\" said Robert, after introducing himself and shaking hands. \"But I think it very strange that I should come here right after those two men I met outside.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is strange, lad,\" responded Herman Wenrich feebly. \"I cannot understand it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think I can safely say that Mr. Amberton never sent them and that he knows nothing of their coming,\" continued our hero.\n\u003cbr\u003e \n\u003cbr\u003e \"That makes the whole thing even more strange.\"\n\u003cbr\u003e \n\u003cbr\u003e \"They wish to get a certain map from you—a map of some lumber lands in upper Michigan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes, there is but one map,\" cried Herman Wenrich. \"I have kept it safely for years.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Papa, please do not excite yourself,\" pleaded Nettie Wenrich, coming to the bedside.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 183]\n\u003cbr\u003e \n\u003cbr\u003e \"I am not excited, my child.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I do not know a great deal about the matter,\" continued Robert. \"But I do know that those two men, Le Fevre and Hammerditch, are Mr. Amberton\u0027s enemies and not his friends.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Can you prove that?\"\n\u003cbr\u003e \n\u003cbr\u003e For the instant the youth was nonplussed. Then he thought of Dick Marden\u0027s letter.\n\u003cbr\u003e \n\u003cbr\u003e \"Here is a letter I got from Timberville,\" he said. \"You can read that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"My eyesight is poor. Nettie, read the letter.\"\n\u003cbr\u003e \n\u003cbr\u003e At once the daughter complied. Herman Wenrich listened attentively.\n\u003cbr\u003e \n\u003cbr\u003e \"Ah, yes, I remember this Marden now,\" he said slowly. \"He was the son of Amberton\u0027s youngest sister. Where does he come from?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He belongs in California and is a rich miner. But he was brought up down east—in Vermont, if I remember rightly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Exactly—he is Grace Amberton\u0027s boy. A good fellow, too—if he takes after his mother. So Amberton is sick and has put Dick Marden in charge. Then what those two men told me is a—a string of falsehoods.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can see what I am authorized to offer you for the map,\" said Robert. \"I started for here with the money in my pocket——\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 184]\n\u003cbr\u003e \n\u003cbr\u003e \"Stop, Mr. Frost. You do not understand old Herman Wenrich. I am not thinking to sell the map.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you are willing to see justice done to Mr. Amberton, are you not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes—full justice—for he deserves it. He could have had the map before, but it affected some land of mine—which I have since sold.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you will let him have the map!\" exclaimed Robert, much delighted. \"I will pay——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not a cent, my lad, not a cent. He can have it and welcome. But—but——\"\n\u003cbr\u003e \n\u003cbr\u003e \"But what, sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I must be dead sure, as they say, of what I am doing. You look honest enough, but so did those men.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Those men didn\u0027t look very honest to me,\" came from Nettie Wenrich, who had taken a strong liking to Robert, and it must be admitted that the feeling was reciprocated. \"I could not bear that Englishman.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I cannot blame you for being suspicious,\" said Robert gravely. \"I wish I had been so this morning. I might have saved my watch and some of my money.\" He did not feel called upon to state that he had lost the amount which was[Pg 185] to be paid over to Herman Wenrich for the map.\n\u003cbr\u003e \n\u003cbr\u003e Of course he had to tell his story—or, at least, a part of it. Nettie Wenrich was quite affected.\n\u003cbr\u003e \n\u003cbr\u003e \"It was too bad!\" she cried. \"I hope you get your watch and money back and succeed in sending those bad men to prison.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will tell you what I will do,\" said Herman Wenrich, after several minutes of silent thinking. \"Let Felix Amberton send me a written order to deliver the map to you and I will do so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is fair,\" said Robert. \"No honest person could ask more at your hands. But what of those two men? They are to call again, I believe.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will put them off, for, say three days. You ought to be able to get your order by that time.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps I can get it sooner, but I wish you would make it four days. There may be some delay, especially if Mr. Amberton is very ill.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well, we will make it four days then,\" said Herman Wenrich, and thanking him for his kindness Robert withdrew and followed Nettie Wenrich downstairs.\n\u003cbr\u003e \n\u003cbr\u003e \"Do your father and you live here alone?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 186]\n\u003cbr\u003e \n\u003cbr\u003e \"I hope he gets well soon,\" said the youth gravely, and his voice was full of a sympathy which went straight to the girl\u0027s heart.\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid he will never get well,\" answered Nettie, and the tears sprang into her eyes.\n\u003cbr\u003e \n\u003cbr\u003e He took her hand and shook it warmly. \"You must hope for the best,\" he said. And then, as she looked straight into his clear, honest eyes, he added, \"If I can ever be of service to you don\u0027t hesitate to call upon me.\"\n\u003cbr\u003e \n\u003cbr\u003e And a minute later he was gone.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1801/52306.html","bookId":1053,"creation":"Aug 5, 2019 7:38:29 AM","modification":"Aug 5, 2019 7:38:29 AM"}
