{"id":37041,"no":23,"title":"CHAPTER XXII. A CLEVER CAPTURE.","content":"As Robert was approaching his boarding house he ran into Livingston Palmer, valise in hand, bound for the theater.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m off,\" said Palmer. \"Our company leaves town to-day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I wish you every success.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you struck anything yet?\" asked Palmer curiously.\n\u003cbr\u003e \n\u003cbr\u003e \"I have and I haven\u0027t. I\u0027ve got a letter from Mr. Marden requesting me to come to Timberville in Michigan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It wouldn\u0027t suit me to bury myself in such a hole.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know that I will stay there any great length of time. I am to go up on a little private business.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I see. Well, I must hurry. What time have you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No time at all. My watch is gone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hullo! Do you mean to say you\u0027ve had to[Pg 188] pawn it already. I thought you were one of the saving kind, to look out for a rainy day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The watch was stolen from me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Indeed!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, and some of my money went with it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s too bad, Robert,\" and Palmer\u0027s face was full of real sympathy.\n\u003cbr\u003e \n\u003cbr\u003e \"It is bad.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would loan you some money if I had it. But the truth is, I\u0027m broke excepting for a couple of dollars that Jack Dixon advanced me on my salary.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Livingston, but I am not quite broke, even if I have been robbed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m glad to hear it. Now I am off, or I will be left behind.\"\n\u003cbr\u003e \n\u003cbr\u003e And with a hearty grasp of Robert\u0027s hand the would-be actor hurried down the street. Robert gazed after him meditatingly.\n\u003cbr\u003e \n\u003cbr\u003e \"I hope his engagement proves all he wishes,\" he thought. \"But I am afraid he is running up against a tremendous disappointment.\"\n\u003cbr\u003e \n\u003cbr\u003e Retiring to his room, Robert wrote a long letter to Dick Marden, telling of the receipt of the money orders and of his interview with Herman Wenrich. He also mentioned Le Fevre and Hammerditch and asked for the order from Felix[Pg 189] Amberton for the map. At first he thought to put in about the stolen money and the watch, but then reconsidered the matter.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll wait, since the map is not to be paid for,\" he said to himself. \"Perhaps the police will catch the sharpers. If the worst comes to the worst I guess I can scrape up enough money to take me to Timberville without applying to Mr. Marden for more.\"\n\u003cbr\u003e \n\u003cbr\u003e The letter finished, Robert went down to the post-office to post it. There now seemed nothing to do but to wait, and he returned to his boarding house worn out with the exertions of the day.\n\u003cbr\u003e \n\u003cbr\u003e A good sleep made the youth feel much better, and while he was eating his breakfast he began to deliberate upon what to do during the time in which he would have to wait for an answer from his miner friend.\n\u003cbr\u003e \n\u003cbr\u003e The front door bell rang, and presently he heard somebody ask to see the landlady of the house.\n\u003cbr\u003e \n\u003cbr\u003e \"Please, mum, a gentleman to see you,\" said Mary, coming into the dining room.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Gibbs, the landlady, went into the parlor at once, thinking the newcomer might be somebody for board.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 190]\n\u003cbr\u003e \n\u003cbr\u003e \"This is the landlady?\" asked the man, bowing.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I am Mrs. Gibbs.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am looking for a nice, quiet boarding place,\" went on the newcomer. \"Have you any vacant rooms?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have one room vacant, but it is on the third floor.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is it a nice, quiet room?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is in the rear and looks out on a small private garden. I think you will find it quiet enough.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I cannot stand a noise. I used to board on the other side of the city, but there was a factory in the neighborhood and the rumble set me wild.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We have no noises of that kind here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And what do you ask for board and room?\"\n\u003cbr\u003e \n\u003cbr\u003e \"With one person in the room my charges are ten dollars per week. If two gentlemen take the room together the rate is eight dollars each.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I prefer to be alone, madam.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will show you the room,\" said Mrs. Gibbs, moving toward the door. \"I am sure you will find it as nice as any for the price.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think so myself—for the house shows it,\" replied the man, with a glance around at the well-kept parlor.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 191]\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Gibbs led the way into the hall. As she did so Robert came out of the dining room.\n\u003cbr\u003e \n\u003cbr\u003e The man glanced carelessly at our hero and then fell back as if he had received a shock.\n\u003cbr\u003e \n\u003cbr\u003e Then Robert uttered a cry of amazement.\n\u003cbr\u003e \n\u003cbr\u003e \"You!\" he gasped, and rushing forward caught the man by the arm.\n\u003cbr\u003e \n\u003cbr\u003e \"Let go of me, young man!\" cried the man savagely.\n\u003cbr\u003e \n\u003cbr\u003e \"I will not,\" answered Robert firmly. \"I know you, and I am going to hand you over to the police.\"\n\u003cbr\u003e \n\u003cbr\u003e At these words Mrs. Gibbs uttered a little shriek.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Mr. Frost, what can this mean?\" she demanded.\n\u003cbr\u003e \n\u003cbr\u003e \"It means that this man is a thief,\" declared Robert. \"I met him in the post-office yesterday, where he saw me cash several money orders. After that he and a confederate robbed me of both money and my watch.\"\n\u003cbr\u003e \n\u003cbr\u003e At these words the face of Andy Cross—for it was really he—became a study.\n\u003cbr\u003e \n\u003cbr\u003e The sharper had not dared to go back to his former boarding house. He had calculated to find some new victim and to keep \"shady\" by pretending to be too ill to leave his room for sev[Pg 192]eral days. Now his little game was knocked completely in the head.\n\u003cbr\u003e \n\u003cbr\u003e \"He is a thief?\" ejaculated the landlady. \"Oh, my! and to think I was going to take him in to board!\"\n\u003cbr\u003e \n\u003cbr\u003e And the good old lady appeared ready to faint.\n\u003cbr\u003e \n\u003cbr\u003e \"There is some strange mistake here,\" said Andy Cross. \"Young man, how dare you call me a thief!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I dare to because it is the truth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know who I am?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are what I just called you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have a strong inclination to knock you down, but I will try to curb my temper, as all Christian people should. I am Ralph Goodwill, the son of the Reverend Amos Goodwill, of Denver. I have come to Chicago to complete my studies for the ministry.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll have to turn over a new leaf before you become a minister,\" answered Robert.\n\u003cbr\u003e \n\u003cbr\u003e \"Evidently you do not believe me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why should I? You are a thief, and you cannot humbug me into believing otherwise.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Frost, there may be some mistake,\" put in the landlady timidly.\n\u003cbr\u003e \n\u003cbr\u003e \"There is no mistake, Mrs. Gibbs. Did you[Pg 193] ever see a seminary student sporting such a suit of clothing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well—er—I don\u0027t know as to that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The suit is one I picked up in the slums,\" said Andy Cross glibly. \"I have been doing some work there, assisted by some Salvation Army people. You can work better among the poor, lost ones if you are dressed like them,\" he added softly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes, I presume that is so,\" said Mrs. Gibbs, who was somewhat interested in slum work herself.\n\u003cbr\u003e \n\u003cbr\u003e \"He is an out and out fraud,\" said Robert, as firmly as ever. \"Mrs. Gibbs, will you send Mary to call a policeman? I will be responsible for the arrest.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But if there is a mistake——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Haven\u0027t I said that I will be responsible? I am not going to let him escape if I can help it.\"\n\u003cbr\u003e \n\u003cbr\u003e At that moment the front door opened, to admit one of the lady boarders. Robert stepped back to let her pass, and as he did so Andy Cross wrenched himself free and leaped for the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Stop!\" cried Robert. \"Stop!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go to blazes!\" snarled the sharper, and pulling the door back, he leaped out on the piazza.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 194]\n\u003cbr\u003e \n\u003cbr\u003e Our hero\u0027s blood was up and he was determined that Cross should not escape him again.\n\u003cbr\u003e \n\u003cbr\u003e He, too, leaped for the doorway, and as the sharper gained the piazza Robert put out his foot to trip him up.\n\u003cbr\u003e \n\u003cbr\u003e The movement was far more successful than anticipated.\n\u003cbr\u003e \n\u003cbr\u003e Down went Andy Cross on his knees, and before he could recover he went down the steps, bump! bump! bump! to the sidewalk.\n\u003cbr\u003e \n\u003cbr\u003e The wind was knocked completely out of him, and he was sadly bruised about the head, while the blood spurted from his nose in a stream.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh! oh! I\u0027m killed!\" he moaned, as he sat up.\n\u003cbr\u003e \n\u003cbr\u003e \"If you were, you wouldn\u0027t be able to groan over it,\" answered Robert. \"Stay where you are, if you know when you are well off.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t have me arrested,\" pleaded the sharper. The unexpected fall had taken all his self-possession from him.\n\u003cbr\u003e \n\u003cbr\u003e At that moment a policeman showed himself at the corner, and Robert called to him to come up.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the trouble?\" demanded the officer of the law.\n\u003cbr\u003e \n\u003cbr\u003e Seeing to it that Andy Cross did not get away, Robert told his story.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 195]\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I have the report of the robbery,\" said the policeman. \"You were lucky to fall in with him.\"\n\u003cbr\u003e \n\u003cbr\u003e In vain the sharper protested that he was innocent. The policeman marched him off to the nearest station house.\n\u003cbr\u003e \n\u003cbr\u003e Here he was examined and searched, and fifty dollars of Robert\u0027s money was found in the envelope which our hero had obtained at the post-office.\n\u003cbr\u003e \n\u003cbr\u003e \"What of the rest of the money and the watch?\" asked Robert.\n\u003cbr\u003e \n\u003cbr\u003e Seeing there was no help for it, Andy Cross made a confession. He stated that Jim Huskin had kept both the timepiece and the rest of the money, and left Chicago the night before.\n\u003cbr\u003e \n\u003cbr\u003e \"And where did he go?\" asked Robert.\n\u003cbr\u003e \n\u003cbr\u003e \"He took a steamer for Muskegon, Michigan,\" answered Andy Cross.\n\u003cbr\u003e \n\u003cbr\u003e \"Muskegon!\" cried our hero. And then he said no more. But he was filled with interest, for he had thought to journey to Timberville by way of a steamer to the town named and then by railroad for the balance of the journey.\n\u003cbr\u003e \n\u003cbr\u003e \"We will look this matter up and telegraph to the authorities at Muskegon,\" said the officer who[Pg 196] was examining Cross. \"If we learn anything we will let you know.\"\n\u003cbr\u003e \n\u003cbr\u003e This ended the matter for the time being, and Andy Cross was locked up. Robert returned to his boarding house, feeling lighter in both heart and mind than he had a couple of hours before.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1801/52307.html","bookId":1053,"creation":"Aug 5, 2019 7:38:29 AM","modification":"Aug 5, 2019 7:38:29 AM"}
