{"id":37045,"no":27,"title":"CHAPTER XXVI. ROBERT SPEAKS HIS MIND.","content":"Robert waited for two days for a letter from Dick Marden. In the meantime he went down to the police station twice to learn if anything had been found out about Jim Huskin.\n\u003cbr\u003e \n\u003cbr\u003e \"We telegraphed to Muskegon and several other points,\" said the officer in charge. \"But so far no one has seen the rascal.\"\n\u003cbr\u003e \n\u003cbr\u003e In the evening mail of the second day came two letters for the boy, both of which he perused with great interest.\n\u003cbr\u003e \n\u003cbr\u003e The first was from his mother, telling of the meeting with Livingston Palmer, and of what the would-be actor had told her.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I am glad to hear that you have not suffered so far, Robert,\" she wrote. \"But I am afraid that the fire may prove an unexpected set-back for you, and so I enclose twenty dollars, which may come in useful. So far I have received no letter[Pg 223] from you, although Mr. Palmer says you have written. When you write again send it in care of the postmaster, and mark it for personal delivery only. Then I am sure Mr. Blarcomb will give it to me and to nobody else.\"\n\u003cbr\u003e \n\u003cbr\u003e It may be imagined that Robert was indignant.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll wager old Talbot stole that letter,\" he told himself. \"And I guess mother thinks as much. Oh, what a mistake she made in marrying that man! I\u0027ll write her another letter this very night.\" And he did so, and posted it before retiring. In the communication he told her to beware of his step-father and not trust him in money matters, as she might be very sorry for it.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s best to open her eyes,\" he reasoned, \"even if it does cause her pain.\"\n\u003cbr\u003e \n\u003cbr\u003e The second letter was from Dick Marden, enclosing the order from Felix Amberton for the map. In this the old miner urged Robert to obtain the document at the earliest possible moment.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Our enemies are hedging us in and intend to proceed against us in the county court in a day or two,\" he added. \"As soon as we get the map we will know just where we stand, and our lawyer will know exactly what claims he can make.[Pg 224] My uncle is of the opinion that the other side is making a big bluff in the hope that we will offer to compromise.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll go and get the document the first thing in the morning,\" Robert told himself. \"And if all goes well I\u0027ll be on my way to Timberville by noon.\"\n\u003cbr\u003e \n\u003cbr\u003e With the money recovered from Andy Cross, and with what his mother had sent to him, he now had ample funds for the trip. After writing the letter to his parent, he packed his valise, that nothing might delay his start.\n\u003cbr\u003e \n\u003cbr\u003e A surprise awaited him the next morning just after he had left the dining room, and while he was telling Mrs. Gibbs that he intended to go away, to be gone an indefinite time.\n\u003cbr\u003e \n\u003cbr\u003e \"A gentleman to see Mr. Frost,\" announced the girl, and entering the parlor Robert found himself confronted by his step-father.\n\u003cbr\u003e \n\u003cbr\u003e \"Good-morning, Robert,\" said James Talbot, smiling affably and extending his hand.\n\u003cbr\u003e \n\u003cbr\u003e \"Good-morning, Mr. Talbot,\" replied our hero coldly. He pretended not to see the outstretched hand.\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose you are surprised to see me here,\" began Mr. Talbot awkwardly.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 225]\n\u003cbr\u003e \n\u003cbr\u003e \"I am surprised. How did you learn my address?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Never mind that now, Robert. I came to see how you are getting along.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You ought to know. You got my letter, even if my mother didn\u0027t,\" answered Robert bitterly.\n\u003cbr\u003e \n\u003cbr\u003e \"I got no letter, my lad, upon my honor I did not. I came out of pure friendliness to you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then let me tell you that I am doing very well.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I heard something about your being out of work on account of a fire.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did Mr. Gray tell you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Never mind who told me.\" James Talbot cleared his throat. \"As you are out of work I thought perhaps that you would like to come to work for me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Work for you!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Exactly. I don\u0027t mean for you to go back to Granville. I am going to open a real-estate office in Chicago, and I shall want a clerk. I understand that you take to that sort of thing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t believe I\u0027ll take to clerking for you,\" returned Robert bluntly.\n\u003cbr\u003e \n\u003cbr\u003e \"Ahem! That is rather harsh of you, Robert. I mean to do well by you. Why not take a fresh[Pg 226] start? I am sure we shall get along very well together.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going to give up the office you opened in Granville?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not just yet. But I may in the future—after the office here is in full blast. I expect to make a big thing of the business here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A big business here means the investment of a lot of money,\" said the boy shrewdly. \"Where is that to come from?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Never mind about the money. It will be forthcoming as it is needed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is my mother going to let you have some of her money?\"\n\u003cbr\u003e \n\u003cbr\u003e \"If she did, it would be no more than right that she should depend upon her husband in her investments.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I wouldn\u0027t advise her to depend upon you. With your own money you can do as you please, but I don\u0027t think you ought to touch any of her funds.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are decidedly plain-spoken, boy!\" cried James Talbot, frowning.\n\u003cbr\u003e \n\u003cbr\u003e \"Because one must speak plainly to such a man as you, Mr. Talbot. I don\u0027t know why my mother married you, but I think I know why you married my mother.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 227]\n\u003cbr\u003e \n\u003cbr\u003e \"And why?\"\n\u003cbr\u003e \n\u003cbr\u003e \"To get hold of her money.\"\n\u003cbr\u003e \n\u003cbr\u003e James Talbot leaped from the chair upon which he had been sitting. He was enraged, but quickly calmed himself.\n\u003cbr\u003e \n\u003cbr\u003e \"You are entirely mistaken, boy, entirely mistaken. Why, I have all the money I want.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I saw you borrow fifty dollars from my mother once.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Merely a bit of accommodation because I didn\u0027t have the cash handy. Why I can draw my check for twenty or thirty thousand dollars if I wish to.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert did not believe the statement. Yet as he had no way to disprove it, he remained silent on the point.\n\u003cbr\u003e \n\u003cbr\u003e \"Then you are going to use your own money entirely in this real estate venture in Chicago?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well—er—most likely. Of course I may become pushed for ready cash at times and will then look to your mother to help me out a little. Every man, no matter how well off, gets pushed at times, when he cannot turn his securities into ready cash, you know.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall advise my mother to keep her fortune in her own hands.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You will!\" James Talbot became more en[Pg 228]raged than ever. \"Don\u0027t you dare to interfere between my wife and myself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will do all I can to keep her money out of your reach.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps you want it yourself?\" sneered Talbot.\n\u003cbr\u003e \n\u003cbr\u003e \"No, I want her to keep it and enjoy it as long as she lives. I don\u0027t believe you are any kind of a business manager, and if she put the money in your care she might be a beggar in a year or two.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Boy, boy, this to me! me, your father!\" cried Talbot.\n\u003cbr\u003e \n\u003cbr\u003e \"You are not my father, Mr. Talbot, and you need not call yourself such. My father was a far better man than you are, I can tell you that. He made his own way in the world, just as I am trying to do, and ask no favors from anybody.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are impertinent—a thorough good-for-nothing!\" howled James Talbot, hardly knowing what to say. \"I want to do you a kindness, and this is the way you receive me. I will not speak to you longer. But don\u0027t you dare to set my wife against me, or there will be trouble, mind that—there will be trouble!\"\n\u003cbr\u003e \n\u003cbr\u003e And thus talking he left the parlor, clapped his silk hat on his head, and dashed from the boarding house.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1801/52311.html","bookId":1053,"creation":"Aug 5, 2019 7:38:29 AM","modification":"Aug 5, 2019 7:38:29 AM"}
