{"id":37048,"no":30,"title":"CHAPTER XXIX. A LUCKY CHANGE OF STATEROOMS.","content":"Robert found that the afternoon boat for Muskegon left at half past three, so there was still time left in which to get back to Mrs. Gibbs\u0027 house for a late dinner.\n\u003cbr\u003e \n\u003cbr\u003e At the boarding house he found a short note from Livingston Palmer.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Mr. Gray is going to go into business again,\" it read; \"with one office here and another in New York. He is going to take me back and he says you can return too, if you desire.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s nice,\" thought Robert. \"But I\u0027ll have to see Dick Marden before I decide upon what\u0027s best to do next.\"\n\u003cbr\u003e \n\u003cbr\u003e While waiting for dinner he penned a hasty reply to the note, and also a letter to his mother. In the latter he mentioned that he had seen Palmer, and that his step-father had called upon him,[Pg 246] and urged her to keep her financial affairs entirely under her own control. He was careful to send the letter in care of Mr. Blarcomb, for personal delivery only.\n\u003cbr\u003e \n\u003cbr\u003e \"She\u0027ll get that, I know,\" he said to himself. \"And I hope it does some good.\"\n\u003cbr\u003e \n\u003cbr\u003e At the proper time our hero went down to the dock and boarded the Arrow, as the steamer was named. He found about two hundred passengers besides himself bound for Muskegon and other points along the Michigan shore. Besides passengers the Arrow carried a large quantity of baggage and freight.\n\u003cbr\u003e \n\u003cbr\u003e The distance from Chicago to Muskegon is about one hundred and twenty-five miles. The Arrow was rather a slow boat and did not reach the latter point until some time in the early morning, so that Robert must spend a night on board. This being so, he lost no time in obtaining a berth.\n\u003cbr\u003e \n\u003cbr\u003e He had just turned away from the clerk\u0027s office when he saw two men approaching. They were Hammerditch and Le Fevre.\n\u003cbr\u003e \n\u003cbr\u003e \"Hullo, they are going too,\" he thought, and was about to step out of sight, when the Englishman espied him.\n\u003cbr\u003e \n\u003cbr\u003e \"Humph! so you are going with us,\" said the man, with a scowl.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 247]\n\u003cbr\u003e \n\u003cbr\u003e \"Not with you,\" answered Robert quietly. \"I believe this is a public boat.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have been following us again.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Excuse me, Mr. Hammerditch, but I never followed you in my life.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then why are you on this boat?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because I am going to take a trip in her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To Muskegon?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is my affair.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose if we get off at Muskegon you will get off too.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps I shall.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you know that you may get into a good deal of trouble through following us, young man?\"\n\u003cbr\u003e \n\u003cbr\u003e \"As I said before, I am not following you. I have my own business to attend to and I am attending to it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bah, do you think we will believe zat,\" burst in Jean Le Fevre. \"You are von spy. Perhaps you are von—vot you call heem?—von detective.\"\n\u003cbr\u003e \n\u003cbr\u003e At this Robert laughed. \"No, I am no detective. Only a young fellow out for business.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Zen you are on ze way to Timberville, hey?\"\n\u003cbr\u003e \n\u003cbr\u003e \"If I am that is my business.\"\n\u003cbr\u003e \n\u003cbr\u003e At this the French Canadian began to dance around and shook his fist in Robert\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 248]\n\u003cbr\u003e \n\u003cbr\u003e \"I know you!\" he shouted. \"But ve vill see who comes out best! Ha! ve vill see zat!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hush!\" interrupted Hammerditch. \"Don\u0027t raise a disturbance on the boat,\" and he led his companion away to the upper deck.\n\u003cbr\u003e \n\u003cbr\u003e \"I shall have to keep my eye on them,\" thought Robert. \"That Frenchmen wouldn\u0027t like anything better than to get into a fight. I might fight one of them, but I don\u0027t think I could get the best of both.\"\n\u003cbr\u003e \n\u003cbr\u003e Once on the upper deck and away from observation, Hammerditch began to talk earnestly to his companion.\n\u003cbr\u003e \n\u003cbr\u003e \"We made a mistake by quarreling with him,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I cannot see eet,\" muttered Le Fevre.\n\u003cbr\u003e \n\u003cbr\u003e \"If we had made friends with him he might have shown us the map.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! zat is so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would give a good lot to get hold of the map,\" continued the Englishman. \"Our false map may help us some, but that real map ought to be out of the way.\"\n\u003cbr\u003e \n\u003cbr\u003e At this Le Fevre clutched his companion by the arm.\n\u003cbr\u003e \n\u003cbr\u003e \"I haf an idee,\" he whispered. \"Let us see if ze boy has got a stateroom.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 249]\n\u003cbr\u003e \n\u003cbr\u003e \"We can find that out at the office.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And if he is to sleep alone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"All right.\"\n\u003cbr\u003e \n\u003cbr\u003e A little later they went to the office and looked over the register.\n\u003cbr\u003e \n\u003cbr\u003e \"Here he is—Robert Frost, room 45,\" said Hammerditch.\n\u003cbr\u003e \n\u003cbr\u003e \"Anybody else in zat room?\"\n\u003cbr\u003e \n\u003cbr\u003e They looked over the register, but could find nobody else.\n\u003cbr\u003e \n\u003cbr\u003e \"He will haf ze room all to himself,\" chuckled Jean Le Fevre. \"Now if I can find a way to open ze door——\"\n\u003cbr\u003e \n\u003cbr\u003e \"You mean to search his valise for the map?\"\n\u003cbr\u003e \n\u003cbr\u003e \"To be sure.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A good idea. We must work the plan, by all means,\" replied Hammerditch.\n\u003cbr\u003e \n\u003cbr\u003e In the meantime Robert had gone to the bow of the boat and was enjoying the sea breeze.\n\u003cbr\u003e \n\u003cbr\u003e Presently the clerk of the boat came up, followed by two burly Germans.\n\u003cbr\u003e \n\u003cbr\u003e \"I believe this is Mr. Robert Frost,\" said the clerk.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s my name,\" answered Robert, wondering what was wanted.\n\u003cbr\u003e \n\u003cbr\u003e \"These gentlemen are brothers and desire a stateroom together,\" explained the clerk. \"If[Pg 250] you do not mind I would like to put you in stateroom No. 50, along with a very nice gentleman named Porter, and give these gentlemen No. 45. Otherwise I will have to put one of them with you and one with Mr. Porter. They prefer to be together.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It vill pe a great favor,\" said one of the Germans politely.\n\u003cbr\u003e \n\u003cbr\u003e \"All right, I would just as lief go in with the gentleman you mentioned,\" answered Robert.\n\u003cbr\u003e \n\u003cbr\u003e \"Dank you very mooch,\" said the German.\n\u003cbr\u003e \n\u003cbr\u003e \"You vos very kind,\" added his brother.\n\u003cbr\u003e \n\u003cbr\u003e \"All right then, that\u0027s settled,\" said the clerk. \"Mr. Frost, I will have your baggage transferred, if you will give me your key.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will transfer the baggage myself and take a look at the other stateroom,\" rejoined Robert.\n\u003cbr\u003e \n\u003cbr\u003e Our hero and the clerk went below, and Robert took his bag to stateroom No. 50, which was better than the other. Mr. Porter sat outside of the door reading a newspaper, and the clerk introduced the pair. The stranger proved to be a Chicago hardware merchant on his way into Michigan on a business trip.\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad to know you,\" he said, smiling pleasantly. \"I hate to travel alone when there is the chance of an agreeable companion.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 251]\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you! I think I can say the same,\" replied Robert, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e The boy retired at ten o\u0027clock, and Mr. Porter with him. Soon Robert was sound asleep.\n\u003cbr\u003e \n\u003cbr\u003e The Germans had gone to bed early, and both were in the land of dreams and snoring lustily when Jean Le Fevre and Hammerditch stole up to the door of stateroom 45.\n\u003cbr\u003e \n\u003cbr\u003e \"This is the one,\" whispered the French Canadian. \"I was lucky to get the pincers, hey?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hush, make no noise, the boy may be awake,\" said the Englishman, warningly.\n\u003cbr\u003e \n\u003cbr\u003e While Hammerditch stood on guard Le Fevre inserted a small pincers in the key-hole of the door and managed to turn the key, which was stuck in from the other side.\n\u003cbr\u003e \n\u003cbr\u003e Then the Frenchman opened the door several inches.\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! he is snoring loudly—he is fast asleep,\" he thought, not noticing that two persons were in the stateroom instead of one, for the German in the upper berth happened just then to be silent.\n\u003cbr\u003e \n\u003cbr\u003e In the dim light the French Canadian made out a valise standing on the floor and grabbed it hastily. Then he came away, shutting the door behind him.\n\u003cbr\u003e \n\u003cbr\u003e \"I haf eet!\" he whispered. \"Come!\" And he[Pg 252] almost ran for the stateroom assigned to him and Hammerditch. Once inside, the pair secured the door and then turned up the light.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s a mighty rusty-looking bag,\" was the Englishman\u0027s comment. \"Have you got the key?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It ees in ze lock,\" answered La Fevre.\n\u003cbr\u003e \n\u003cbr\u003e Soon the valise was opened, and out tumbled a few articles of dirty underwear and a pair of embroidered slippers.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t see any map!\" exclaimed Hammerditch, in disgust.\n\u003cbr\u003e \n\u003cbr\u003e \"\u0027Tis ze wrong bag!\" groaned the French Canadian. \"See, ze clothing is too big for a boy, and so are ze slippers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ve made a mess of it,\" answered his companion. \"Better take that bag back or there\u0027ll be a jolly row all for nothing.\"\n\u003cbr\u003e \n\u003cbr\u003e Much crestfallen, Le Fevre took the bag back. On his second visit he saw both Germans, and he retreated even more speedily than he had on his first trip to the stateroom.\n\u003cbr\u003e \n\u003cbr\u003e \"The cake is dough,\" announced Hammerditch. \"But though we are foiled this time, we must get that map away from the boy, no matter at what cost.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1801/52314.html","bookId":1053,"creation":"Aug 5, 2019 7:38:29 AM","modification":"Aug 5, 2019 7:38:29 AM"}
