{"id":37022,"no":4,"title":"CHAPTER III. THE LITTLE PLOT AGAINST ROBERT.","content":"Robert resumed his place in the home circle. Between him and his step-father there was no cordiality, but formal politeness, though at times Mrs. Talbot tried to cultivate more friendly relations. He was somewhat ashamed of the cowardice he displayed during their walk through the village. It was partly because Robert had been a witness of his humiliation that he grew to dislike him the more and determined, when occasion offered, to get even with the boy. He was somewhat afraid of the spirited boy, but gradually plucked up courage for an encounter.\n\u003cbr\u003e \n\u003cbr\u003e When Robert came home from school three days later, he found his step-father in the hall, standing on a chair, engaged in taking down the portrait of Mr. Frost.\n\u003cbr\u003e \n\u003cbr\u003e \"What are you doing, Mr. Talbot,\" he demanded indignantly.\n\u003cbr\u003e \n\u003cbr\u003e Talbot turned his head, and answered curtly, \"I apprehend that is my business.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 25]\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going to take down my father\u0027s portrait?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s exactly what I am going to do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why?\" asked Robert sternly.\n\u003cbr\u003e \n\u003cbr\u003e \"It is not fitting, now that your mother is my wife, that the picture of her first husband should hang here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going to put yours in its place?\"\n\u003cbr\u003e \n\u003cbr\u003e \"As soon as I have one painted.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert paused for a moment. After all, why should he interfere? His mother had transferred her love and allegiance to another husband, and his father\u0027s face would be a silent reproach to her.\n\u003cbr\u003e \n\u003cbr\u003e \"Did my mother authorize this removal?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then I have only one request to make, that the portrait be hung up in my chamber. I still revere the memory of my father.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have no objections. You can take it up to your room when you please.\"\n\u003cbr\u003e \n\u003cbr\u003e The portrait was taken down, and Robert received it. He at once carried it upstairs. His heart swelled within him, and a look of bitterness came over his young face.\n\u003cbr\u003e \n\u003cbr\u003e \"I can\u0027t stand it long,\" he said to himself.[Pg 26] \"The sight of that man fills me with indignation and disgust. I would as soon see a serpent.\"\n\u003cbr\u003e \n\u003cbr\u003e As yet, however, there had been no open outbreak, but it was to come very soon.\n\u003cbr\u003e \n\u003cbr\u003e \"May I ask a favor of you, James?\" said his wife at the breakfast table.\n\u003cbr\u003e \n\u003cbr\u003e \"What is it, my dear?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I find that our woodpile needs replenishing. Will you stop at Mr. Webber\u0027s on your way to the post-office and ask him to call? I want to speak to him about sawing and splitting a new supply.\"\n\u003cbr\u003e \n\u003cbr\u003e \"My dear,\" said her husband, \"let me make a suggestion. Why employ Mr. Webber when you have a strong, able-bodied boy in the house?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you mean Robert?\"\n\u003cbr\u003e \n\u003cbr\u003e \"There is no other boy in the house, I take it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But,\" expostulated Mrs. Talbot, \"there is no occasion to put Robert at such work. I am quite able to employ and pay Mr. Webber.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And bring up the boy in idleness. That\u0027s a very bad plan. He will be getting lazy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He has his studies to attend to.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He needs physical exercise.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He plays ball and foot-ball.\"\n\u003cbr\u003e \n\u003cbr\u003e \"His time is thrown away. He could get quite as healthful exercise in sawing and splitting wood, and it would save money.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 27]\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Talbot was of a gentle, yielding temper, but she was not disposed to adopt her husband\u0027s views. She still ventured to expostulate.\n\u003cbr\u003e \n\u003cbr\u003e \"Robert is not lazy, James,\" she said. \"If I were poor and there were any need of it, he would willingly saw and split the wood.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps he would and perhaps he wouldn\u0027t. From what I have seen of him, I am decidedly of the opinion that he has been pampered and spoiled. He has a very bad temper——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, James!\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is true, but it is partly because of his bringing-up. He needs to have his will broken. He has always had his own way, and it is quite time that he learned who is master here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are very hard and cruel, James,\" said his wife, the tears filling her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"You think so, but I am only seeking the boy\u0027s good. I am quite decided on this point. We will drop the discussion.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, what will happen?\" thought the poor mother. \"Robert will never submit, and there will be serious trouble.\"\n\u003cbr\u003e \n\u003cbr\u003e The next morning was Saturday, and Robert had a holiday from school. He was out in the yard, after breakfast, and was about to leave the[Pg 28] premises, when his step-father appeared in the doorway.\n\u003cbr\u003e \n\u003cbr\u003e \"Stop a minute,\" he called out in a tone of command.\n\u003cbr\u003e \n\u003cbr\u003e Robert looked back in surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"What is wanted?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Where are you going?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Out fishing with Harry Baker.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think you had better postpone it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why?\" demanded Robert in surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"Come out in the back-yard and I will tell you.\"\n\u003cbr\u003e \n\u003cbr\u003e Very much surprised, Robert followed his step-father out into the back-yard.\n\u003cbr\u003e \n\u003cbr\u003e \"What does all this mean?\" he thought.\n\u003cbr\u003e \n\u003cbr\u003e \"I want you to spend the forenoon in sawing and splitting wood. Your mother tells me there is need of a fresh supply.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t understand you, sir,\" said Robert coldly. \"Mr. Webber always saws and splits wood for us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He always has hitherto, but this arrangement is to be changed.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert\u0027s eyes flashed. He was beginning to understand now.\n\u003cbr\u003e \n\u003cbr\u003e \"Why? Is my mother unable to pay him?\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 29]\n\u003cbr\u003e \n\u003cbr\u003e \"That is not the point. You are strong and well able to do the work. There is no need of going to unnecessary expense.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert\u0027s lip curled.\n\u003cbr\u003e \n\u003cbr\u003e \"You really expect me to work at the woodpile?\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I do. What is more, I command you to go to work at once.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert looked his step-father firmly in the face.\n\u003cbr\u003e \n\u003cbr\u003e \"You command me to go to work?\" he repeated slowly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I do,\" blustered Mr. Talbot, thinking by his loud voice to intimidate the boy.\n\u003cbr\u003e \n\u003cbr\u003e But he didn\u0027t understand the boy with whom he had to deal. Robert eyed his step-father contemptuously. James Talbot, though perhaps an inch taller, was less heavily built, and looked thin and puny beside the sturdy boy whom he was trying to coerce. He felt the contempt which Robert\u0027s face so plainly expressed, and it enraged him, for he was a man of violent temper.\n\u003cbr\u003e \n\u003cbr\u003e \"I think, Mr. Talbot,\" said Robert, after a pause, \"that you will have hard work in getting your orders obeyed.\"\n\u003cbr\u003e \n\u003cbr\u003e If James Talbot had not been beside himself with rage, he would not have dared to act as he[Pg 30] did. He seized a stout stick lying on the ground and sprang towards his disobedient step-son.\n\u003cbr\u003e \n\u003cbr\u003e Robert instantly seized the ax, which was conveniently near, and brandished it in a threatening manner.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you dare to touch me!\" he exclaimed in excitement.\n\u003cbr\u003e \n\u003cbr\u003e James Talbot turned pale.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you insane?\" he demanded, drawing back in affright.\n\u003cbr\u003e \n\u003cbr\u003e \"No, but I don\u0027t propose to be bulldozed. Just lay down that stick, if you please.\"\n\u003cbr\u003e \n\u003cbr\u003e Mechanically Talbot dropped it.\n\u003cbr\u003e \n\u003cbr\u003e \"You have a terrible temper!\" he exclaimed.\n\u003cbr\u003e \n\u003cbr\u003e \"I hope not, but I am quite prepared to defend myself, Mr. Talbot.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How old are you, sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sixteen.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you are under authority. You are bound to obey me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Am I? I don\u0027t recognize you as having any authority over me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Evidently you have a good deal to learn. Once more, will you obey me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Once more, I won\u0027t,\" returned Robert firmly.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 31]\n\u003cbr\u003e \n\u003cbr\u003e \"You will be sorry for your disobedience. You haven\u0027t seen the end of this.\"\n\u003cbr\u003e \n\u003cbr\u003e He turned and walked back to the house, feeling with mortification that he had been worsted in this first encounter with his step-son.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027d like to flog that boy within an inch of his life,\" he muttered spitefully. \"I—I wish I dared to grapple with him.\"\n\u003cbr\u003e \n\u003cbr\u003e Robert and his step-father didn\u0027t meet at dinner or supper, as the latter had to go away on business.\n\u003cbr\u003e \n\u003cbr\u003e \"Mother,\" said Robert, \"do you wish me to take Mr. Webber\u0027s place at the woodpile?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, Robert. It was Mr. Talbot\u0027s idea. He thought it would be healthful exercise for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why not for him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will try to get him off the idea.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It makes no difference. He can\u0027t make me do it, though he threatened me with a stick this morning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Surely he did not strike you?\" said his mother nervously.\n\u003cbr\u003e \n\u003cbr\u003e \"No, I guess not. He did not dare to.\"\n\u003cbr\u003e \n\u003cbr\u003e It so happened that James Talbot did not reach home till a late hour in the evening, when Robert was already in bed. He went upstairs softly, as[Pg 32]certained from Robert\u0027s regular breathing that he was sound asleep, then taking the key from the lock inside, locked the door from the outside, and went downstairs with a smile.\n\u003cbr\u003e \n\u003cbr\u003e \"When the boy wakes up, he will find himself a prisoner,\" he said. \"I shall get even with him, after all.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1801/52288.html","bookId":1053,"creation":"Aug 5, 2019 7:38:29 AM","modification":"Aug 5, 2019 7:38:29 AM"}
