{"id":66119,"no":31,"title":"Page 31","content":"\u003cp\u003e“We’ll get to that. Then you’ll understand.”\u003c/p\u003e\n\u003cp\u003eShe went on with the telling. It would take a long time. She felt that in order to understand, he must know every detail.\u003c/p\u003e\n\u003cp\u003eThe day cleared and a pale sun dried the moisture. By late afternoon, the shadows had lengthened and they were sitting in deep shade. The air had turned cool. Jonas had placed his jacket across Claire’s shoulders. She was very tired by now, but felt oddly invigorated by relating the story to someone at last. It had been her secret, her private burden, for years. She told it slowly, and he didn’t hurry her. Now and then she had paused to rest. He had brought her water, and a biscuit. The entire day had belonged to them and to her story.\u003c/p\u003e\n\u003cp\u003eShe described the torturous climb up the cliff at length, feeling the need to relive it inch by inch as Einar had told her he had, remembering each handhold, each precipice and narrow ledge. Talking slowly, she felt the muscles in her arms and legs respond to the memory. Jonas noticed it, how she shifted her body as in her mind she made the climb again. He winced when she told of the attack by the bird. She showed him the scar on her neck.\u003c/p\u003e\n\u003cp\u003eFinally, as exhausted almost by the telling as she had been when she reached the top of the cliff that long-ago dawn, she described the terrible trade she had made.\u003c/p\u003e\n\u003cp\u003eJonas leaned forward, his elbows on his knees, and put his face into his hands. “Trademaster,” he said. “I thought he was gone. We banished him from the village a long time ago. I was Leader then.”\u003c/p\u003e\n\u003cp\u003e“Who is he?” Claire asked.\u003c/p\u003e\n\u003cp\u003eHe didn’t respond. He stayed silent, looking now into a distant place, a place that Claire couldn’t see.\u003c/p\u003e\n\u003cp\u003e“I should have known,” he said, after a moment. “I felt something out there, something related to Gabe, but I didn’t realize what it was. I think I was feeling your presence,” he mused, “and that was puzzling, but benign. But there is something else. Something malignant. It must be him.”\u003c/p\u003e\n\u003cp\u003e“Who is he?” Claire asked again.\u003c/p\u003e\n\u003cp\u003e“He is Evil. I don’t know how else to describe it. He is Evil, and like all evil, he has enormous power. He tempts. He taunts. And he takes.\u003c/p\u003e\n\u003cp\u003e“Gabe has your same eyes,” Claire said suddenly. “You and Gabe have the same pale eyes.”\u003c/p\u003e\n\u003cp\u003e“My eyes?” he said, answering her. “They see beyond the places most people can see. I’m told it’s my gift, that there are others with different gifts. And yes, Gabe has the same eyes. Sometimes I wonder—”\u003c/p\u003e\n\u003cp\u003eFrom the top of a pine tree near the river, a large bird suddenly lifted itself and swooped past them in the late golden light.\u003c/p\u003e\n\u003cp\u003e“Were you scared of birds at first?” Claire asked him suddenly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“When you ran away from the community. When you first saw birds. Were you scared?”\u003c/p\u003e\n\u003cp\u003eJonas nodded. “Just at first. And other things too. I remember the first time I saw a fox. Gabe was so little; he wasn’t afraid of anything. It was all new and exciting to him.”\u003c/p\u003e\n\u003cp\u003eClaire realized suddenly that he was talking to her in a different way. He had known her since she had arrived in the community and he had always spoken to her in a kindly fashion. He had been helpful and patient: a young man to an old woman. But they had never been more than acquaintances. Now they were reminiscing together as old friends who had just reunited.\u003c/p\u003e\n\u003cp\u003e“I thought of taking him,” she confessed. “But I didn’t know how to hide him, or where I could go. And then your father showed me that he wore a special bracelet on his ankle, so I realized that I’d be caught if I tried to take him.”\u003c/p\u003e\n\u003cp\u003e“Yes. An electronic bracelet.”\u003c/p\u003e\n\u003cp\u003eClaire frowned. “I don’t remember what that means. What it was.”\u003c/p\u003e\n\u003cp\u003e“There was so much in the community that isn’t part of our lives anymore. But that’s what our memories consist of: small things,” Jonas said.\u003c/p\u003e\n\u003cp\u003e“My bicycle. I haven’t seen a bicycle since then. Except the one in the museum. That was—”\u003c/p\u003e\n\u003cp\u003e“My father’s bike. I stole it. It had a seat for Gabe.”\u003c/p\u003e\n\u003cp\u003eClaire nodded. “Yes. In my memory I can see him riding in it. He held a toy.”\u003c/p\u003e\n\u003cp\u003eJonas laughed. “His hippo.”\u003c/p\u003e\n\u003cp\u003e“He called it Po, didn’t he? It’s coming back now.”\u003c/p\u003e\n\u003cp\u003e“Yes. Po.”\u003c/p\u003e\n\u003cp\u003eNow she could almost hear and see it: the dimpled hands clutching the stuffed toy; the high, happy voice. “Did you take the hippo with you when you escaped?”\u003c/p\u003e\n\u003cp\u003eJonas shook his head. “I couldn’t. It all happened so fast. I discovered they were going to release . . . No. Not release. They were going to kill Gabe. I took him and fled. And I had to take food. There was no room for anything else.”\u003c/p\u003e\n\u003cp\u003e“I would have gone with you, if I’d known. Things would be different now if I had.” She shifted on the bench and rubbed her sore hip. “I wish—” But then she fell silent.\u003c/p\u003e\n\u003cp\u003eJonas was quiet. He didn’t reply.\u003c/p\u003e\n\u003cp\u003e“I was so frightened of birds,” she said suddenly. “Of their feathers and beaks. Then Einar brought me one, in a cage, as a pet. I named it Yellow-wing.”\u003c/p\u003e\n\u003cp\u003e“Einar? He was the one who—”\u003c/p\u003e\n\u003cp\u003e“Yes, the one who prepared me for the climb out.” Her eyes went to her feet, thick and bunioned in primitive sandals. She pulled them back beneath the bench to hide them. He knew she was remembering how limber she had been then, how balanced and sure.\u003c/p\u003e\n\u003cp\u003e“I loved Einar,” she told him.\u003c/p\u003e\n\u003cp\u003e“Do you wish you had stayed?” Jonas asked her after a moment.\u003c/p\u003e\n\u003cp\u003e“No,” she said firmly. “But I wish it had not been Evil that brought me here.”\u003c/p\u003e\n\u003cp\u003eJonas helped her up from the bench, his hand under her arm. They had been sitting together for a long time, and Claire was stiff. She stretched slowly and took a deep breath.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” he asked, looking at her with concern.\u003c/p\u003e\n\u003cp\u003eShe nodded. “I’ll be all right in a minute. My heart’s fluttery sometimes. And I’m just a little slow to get moving.”\u003c/p\u003e\n\u003cp\u003eJonas continued looking at her. “I remember you,” he said, after a moment.\u003c/p\u003e\n\u003cp\u003e“We never spoke to each other,” Claire pointed out.\u003c/p\u003e\n\u003cp\u003eThey began to walk slowly. He was seeing her home.\u003c/p\u003e\n\u003cp\u003e“No. But I saw you. My father mentioned you—the girl who came now and then to the nurturing center, and played with Gabe. He pointed you out to me one time. I think you rode past on your bike, and he said, ‘That’s the one.’”\u003c/p\u003e\n\u003cp\u003e“It seems so strange, to realize who you are. He pointed you out to me: ‘That’s my son,’ he said. He told me your name. It brings it all back, those days in the community.”\u003c/p\u003e\n\u003cp\u003e“I don’t think about it anymore. I’ve made a life here, where it’s so different.”\u003c/p\u003e\n\u003cp\u003e“So has Gabe.”\u003c/p\u003e\n\u003cp\u003eJonas nodded. “He doesn’t remember the community.”\u003c/p\u003e\n\u003cp\u003e“It’s just as well.”\u003c/p\u003e\n\u003cp\u003e“I’m not certain. It frustrates him, not having a past, or a family.”\u003c/p\u003e\n\u003cp\u003e“So he’s wondered?”\u003c/p\u003e\n\u003cp\u003e“More than wondered,” Jonas told her. “He has a passionate need to figure out his past. I try to tell him what he wants to know, but it’s never been enough. That’s why he’s building the boat. I told him we had lived by a river, perhaps this same river. He’s determined to find his way back.”\u003c/p\u003e\n\u003cp\u003eThey both fell silent.\u003c/p\u003e\n\u003cp\u003e“Then we must—”\u003c/p\u003e\n\u003cp\u003e“Maybe together we—”\u003c/p\u003e\n\u003cp\u003eThey had both spoken at the same time, and they were both saying the same thing: We must try to tell all of this to Gabe. Together we can help him understand. But there was not time to discuss it. They were interrupted by the shouts of boys, excited, perhaps alarmed. The noise was coming from the riverside, the place where Gabe had been working for weeks on the little boat.\u003c/p\u003e\n\u003cp\u003eSeven\u003c/p\u003e\n\u003cp\u003eGabe hadn’t wanted an audience for the launch. He wasn’t certain the boat was completely ready, and he didn’t want to be humiliated if anything went wrong. His plan was to sneak away alone. Yesterday he had moved the boat closer to the water, shoving it across some underbrush. Now it was lying on a low, muddy section of the bank. The paddle was resting diagonally inside.\u003c/p\u003e\n\u003cp\u003eThe picture in his book, the book he had borrowed from Jonas, showed the lone man in the ocean, lying doomed in his small boat. His arms were taut and muscled, but useless; it was clear that the huge waves were going to be the ruin of him. He had no paddle, Gabe had thought, looking intently at the painting. Maybe he lost it. Or maybe he forgot to bring one? There was no way the man could save himself in that overwhelming sea. He needed a paddle.\u003c/p\u003e\n\u003cp\u003eFor a foolish moment Gabe focused intensely and tried to veer into the picture of the painted man, to know how it felt to be afloat, to be about to die in the sea—and to know it while safe himself, able to end the veer when he chose. Just to feel the fear briefly, and the movement of the churning waves.\u003c/p\u003e\n\u003cp\u003eBut it didn’t work. The man was not real. He was the painter’s idea of a man, simply daubs of paint, nothing more. A painted man who needed a paddle.\u003c/p\u003e\n\u003cp\u003eGabe was proud of the paddle he had made. He was proud of the entire boat, but he realized it was a rough, primitive construction. The paddle was different. He had felt very fortunate to have found a slender young cedar that broadened at its base: just the right potential for his plan. Carefully he had cut the tree down and then shaped the paddle from its trunk. It seemed to take forever. But he carried it back and forth to Boys’ Lodge and was able to work on it there in the evenings: carving carefully, smoothing, shaping. His friends, even those who ridiculed his boat, were impressed with the paddle, with its sweet, cedary smell, its graceful curved edges, and the sheen of its wood now that he had rubbed it with oil.\u003c/p\u003e\n\u003cp\u003e“Can I carve my name on it? Just small, but so you can remember me?” Nathaniel had asked. Gabe had agreed, and watched while his friend carved his name meticulously.\u003c/p\u003e\n\u003cp\u003eThen Simon asked, and Tarik, and others. Even those boys who had made fun of his project now took pains to add their signature.\u003c/p\u003e\n\u003cp\u003eWatching them, Gabe found that he could make tiny veers into each of the boys as they bent over the paddle, carving carefully. He could feel their feelings.\u003c/p\u003e\n\u003cp\u003eI don’t think he’ll make it, he felt Nathaniel worrying. He might die in the river.\u003c/p\u003e\n\u003cp\u003eI hope he finds his mother, he felt from Tarik. He wants it so badly.\u003c/p\u003e\n\u003cp\u003eHe’s something of a fool. But he’s courageous, I’ll say that for him. I wish I had his courage. Gabe was surprised to feel that from Simon, who had been scornful of the whole project.\u003c/p\u003e\n\u003cp\u003eAt the last, he had shyly asked Jonas to carve his name as well. He felt Jonas’s fear for him, but Jonas gave no sign. His face was calm, and he smiled when he handed the paddle back with his name inscribed.\u003c/p\u003e\n\u003cp\u003eHe had left a rounded knob at one end for a handhold. The other end fanned out into a broad triangle. He had stood on the bank by the water and dipped it in, pulling it through to feel the river’s resistance. It required strength. But Gabe was strong. In recent months he had begun to fill out; his muscles were firm and his energy boundless.\u003c/p\u003e\n\u003cp\u003eHe had been delayed after lunch by some chores he had left undone. Grumpily he folded his laundry, put it away, and straightened his room. Now, heading back to the river, he assessed the weather. The misty morning had cleared and through the clouds a bit of sun made a narrow glint of light. The river would be smooth, Gabe thought. Sometimes after a storm it became turbulent and dangerous. He wasn’t worried. His boat could manage, he was certain. But for this first test, he was glad of the calm weather; he would take it slow. He needed to learn how exactly to wield the paddle, how to steer. He flexed one arm, admired his own bicep, and wondered if Deirdre would ever notice. Then he blushed, embarrassed that he had even thought such a foolish thing. \u003c/p\u003e","sourceLink":"https://allnovel.net/son-the-giver-quartet-4/page-31.html","bookId":1704,"creation":"Oct 5, 2019 10:00:04 AM","modification":"Oct 5, 2019 10:00:04 AM"}
