{"id":66122,"no":34,"title":"Page 34","content":"\u003cp\u003eGabe nodded. He looked around the room. “I’m all right. I had strange dreams. I’m sorry I slept so late. You should have woken me. Is Jonas here?”\u003c/p\u003e\n\u003cp\u003e“No. He had to leave.”\u003c/p\u003e\n\u003cp\u003e“But he promised to explain—”\u003c/p\u003e\n\u003cp\u003e“I know. And he will. But he got an urgent message early this morning. Someone in the village is quite sick.”\u003c/p\u003e\n\u003cp\u003e“Why did they call for him? He’s not a healer. They usually call Herbalist.”\u003c/p\u003e\n\u003cp\u003eKira shrugged. “I’m not sure. Apparently she asked for him. Are you hungry? The children just had some bread and jam. Would you like some?”\u003c/p\u003e\n\u003cp\u003eGabe went to the table. She poured milk into a thick cup for him. He drank some and spread raspberry jam on the crusty, freshly baked bread. He watched when she turned her attention again to the toddlers.\u003c/p\u003e\n\u003cp\u003e“Do you think they’ll remember this moment when they’re older?” he asked suddenly.\u003c/p\u003e\n\u003cp\u003e“Fighting over a toy? Eating bread and jam? Probably not. They’re too little for specific memories like that. But I think they’ll remember the general feeling of being taken care of, of being scolded now and then, maybe of being held and hugged.” She poured more milk into his empty cup. “Why?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I just wondered.”\u003c/p\u003e\n\u003cp\u003e“I think I remember being very small and sleeping beside my mother. When I think of it, I feel her warmth. And I think maybe she sang to me. I suppose I was just about the age of Annabelle.” Kira smiled. “I didn’t walk when I was her age. It took me a long time to walk because of my leg.”\u003c/p\u003e\n\u003cp\u003eOne of her legs was twisted. It was why she leaned on a stick when she walked. He glanced at her, at the stick, when she spoke of it. But his mind was not on that.\u003c/p\u003e\n\u003cp\u003e“I don’t have a single memory like that.”\u003c/p\u003e\n\u003cp\u003e“What do you remember, Gabe?” Kira asked him.\u003c/p\u003e\n\u003cp\u003e“I rode in a seat on the back of a bike. You know that bicycle in the museum?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“I remember that, a little. But it was Jonas who brought me here on that bike. He wasn’t my parent. I don’t remember a mother, the way you do, the way Annabelle and Matthew will. Except . . .”\u003c/p\u003e\n\u003cp\u003eHe paused.\u003c/p\u003e\n\u003cp\u003e“Except what?”\u003c/p\u003e\n\u003cp\u003eGabe squirmed on his chair. “There was a woman. I know there was. And she loved me.”\u003c/p\u003e\n\u003cp\u003eKira smiled. “Of course she did.”\u003c/p\u003e\n\u003cp\u003e“Kira, I mean I really know. Last night, when you and Jonas were talking about your gifts . . .”\u003c/p\u003e\n\u003cp\u003eShe looked at him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“I didn’t want to tell you. I don’t know why. Maybe I just needed to test it one more time.”\u003c/p\u003e\n\u003cp\u003e“Test what?” Kira glanced toward the children, who were now playing quietly. She came to the table and sat down in the chair next to Gabe.\u003c/p\u003e\n\u003cp\u003e“My gift. I do have one. I call it veering.”\u003c/p\u003e\n\u003cp\u003e“Go on.”\u003c/p\u003e\n\u003cp\u003e“At first it just happened. It always surprised me. But then I found I could choose the time. I could direct it. I could cause it to happen. Was it that way for you?”\u003c/p\u003e\n\u003cp\u003eKira nodded. “Yes. It was.”\u003c/p\u003e\n\u003cp\u003e“And this morning, just a few minutes ago, you were over there, with the children—” Gabe nodded toward the corner of the room where the two little ones were industriously piling blocks into towers. “I was lying on the couch, half awake, watching, and I decided to veer into Matthew.”\u003c/p\u003e\n\u003cp\u003e“Into Matthew?” Kira looked puzzled.\u003c/p\u003e\n\u003cp\u003e“Yes, because he’s the boy. I suppose it’s not that different with a girl, but I needed to know how it felt to be a small boy looking at his mother.”\u003c/p\u003e\n\u003cp\u003eThey both glanced over at Matthew. His tongue was wedged between his lips and he was frowning with concentration as he balanced a blue wooden triangle on top of a pile of square red blocks.\u003c/p\u003e\n\u003cp\u003e“So I concentrated really hard. The first thing that happens is a silence. You were talking to the children, showing them how the blocks fit together, and just as you said, ‘See the shapes?’ You were holding up a yellow one, and—”\u003c/p\u003e\n\u003cp\u003e“Yes. Annabelle took it from me,” Kira said.\u003c/p\u003e\n\u003cp\u003e“Maybe. I don’t remember that, because the silence happened. I never notice what’s happening when the silence comes. But then I, ah, well, I veered into Matthew. I entered Matthew.”\u003c/p\u003e\n\u003cp\u003e“You never moved from the couch.”\u003c/p\u003e\n\u003cp\u003e“No, my body doesn’t move. But my awareness shifts.”\u003c/p\u003e\n\u003cp\u003eKira nodded.\u003c/p\u003e\n\u003cp\u003e“And then,” Gabe went on, “I became part of Matthew’s feelings at that moment. I felt them. I understood them.”\u003c/p\u003e\n\u003cp\u003e“So your gift is understanding how someone feels?”\u003c/p\u003e\n\u003cp\u003e“More than understanding it. Feeling it. And this morning, when I did that, I felt my own little self, my baby self, experiencing what Matthew was experiencing at that moment. He was receiving so much love from his mother.”\u003c/p\u003e\n\u003cp\u003eKira, beginning to understand, nodded. “For Matthew, that was coming from me. But for you, Gabe, you were remembering . . .”\u003c/p\u003e\n\u003cp\u003e“Yes. I don’t know her name or where she is now. But I know for certain who she was.”\u003c/p\u003e\n\u003cp\u003eThe two of them sat silently, watching the children play.\u003c/p\u003e\n\u003cp\u003eLater, after he had helped her clean up the lunch dishes, Kira said, “I’m going to take the children for a walk. Want to come?” She lifted two small jackets from a hook on the wall.\u003c/p\u003e\n\u003cp\u003e“When’s Jonas coming back?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’m surprised that he’s been gone so long.”\u003c/p\u003e\n\u003cp\u003e“Is it all right if I wait here for him?”\u003c/p\u003e\n\u003cp\u003e“Of course. You and he have a lot to talk about.”\u003c/p\u003e\n\u003cp\u003eGabe looked through the window, down at the winding paths that crisscrossed the village. People hurried along, busy with midday tasks. Beyond the orchard, he could see the library; it appeared closed. Nearby, in the playing field, children were running around with a ball that they passed back and forth; he could hear their shouts. It was an ordinary day in the quiet, well-ordered place. Yet someplace in the village, someone was very ill, and Jonas was there.\u003c/p\u003e\n\u003cp\u003e“I think I’ll go look for him,” Gabe said suddenly. “Do you know where he went? Who is it who is so sick?”\u003c/p\u003e\n\u003cp\u003eKira reached into a small sleeve and guided Annabelle’s chubby arm through. “Other side now,” she said to the little girl, and held open the other sleeve. “Can you do yours by yourself?” she asked Matthew, whose jacket was on the floor in front of him. He grinned and shook his head no.\u003c/p\u003e\n\u003cp\u003e“A woman named Claire,” she said to Gabe, in answer to his question. “I’m sure you’ve seen her in the village. She’s very, very old.”\u003c/p\u003e\n\u003cp\u003e“Oh, her! Yes, I’ve seen her often.”\u003c/p\u003e\n\u003cp\u003e“Well, I fear you won’t be seeing her much longer. It sounds as if her time is running out.” With both children now buttoned into their jackets, Kira headed to the door with Annabelle in her arms and Matthew by one hand. “Can you open the door for me?”\u003c/p\u003e\n\u003cp\u003e“Is it all right if I leave my paddle here?” He looked toward the corner where it was propped against the wall. The sunlight made it gleam golden.\u003c/p\u003e\n\u003cp\u003e“Of course. I won’t let the children play with it.”\u003c/p\u003e\n\u003cp\u003eGabe helped her through the door and down the front steps. “Do you know where she lives? Or is she in the infirmary?”\u003c/p\u003e\n\u003cp\u003e“Jonas went to her house. It’s over there someplace.” Kira indicated, nodding her head, a place beyond the library, beyond the schoolhouse. He could see the small cottages, deep in shade, that dotted the wooded area.\u003c/p\u003e\n\u003cp\u003eGabe thanked her quickly for the place to eat and sleep after such a bad day. Then, as Kira headed with the children to the play area nearby, he began to jog toward the place where Claire lived and where Jonas was with her now. He wanted to talk more about what Jonas had proposed last night. It had been on his mind since he had awakened. He was to kill someone named Trademaster? It made no sense. Jonas was a peaceful, compassionate man. All right, maybe this Trademaster guy was bad. Maybe even pure evil! But he wasn’t bothering anyone they knew. They would watch out for him, would fend him off if he showed signs of trying to return to the village and do harm.\u003c/p\u003e\n\u003cp\u003eHah, Gabe thought with a wry smile. Maybe they should just put him into my stupid boat and give it a firm shove into the river.\u003c/p\u003e\n\u003cp\u003eThe little cottage was deep in a thicket of trees, but he had no trouble finding the place where Claire lived. Several aged women stood somberly outside, murmuring to one another.\u003c/p\u003e\n\u003cp\u003e“So sudden,” he overheard one woman say to another. “Came upon her just like that. She was fine last night.”\u003c/p\u003e\n\u003cp\u003e“Happens that way,” a tall white-haired woman said knowingly, and several others nodded.\u003c/p\u003e\n\u003cp\u003eGabe excused himself politely as he passed them. “Is Jonas inside?” he asked. A woman nodded.\u003c/p\u003e\n\u003cp\u003e“She asked for him, first thing. Strange,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Is it all right if I go in?” Gabe asked.\u003c/p\u003e\n\u003cp\u003eNo one seemed to be in charge. They all looked at him blankly, and he took it as permission. The door stood partially open, and he entered after a quiet knock on the wood, which drew no reply. The interior was very dim. It was bright outside on this clear day after the night’s rain, but the windows of the cottage were small, and woven curtains were drawn across. He smelled stale food, old age, dried herbs, and dust.\u003c/p\u003e\n\u003cp\u003eHerbalist, who ordinarily tended the sick, sat quietly in a rocking chair.\u003c/p\u003e\n\u003cp\u003eGabe looked around. “Jonas?”\u003c/p\u003e\n\u003cp\u003e“Over here.” He followed the voice and found Jonas sitting in the shadows beside the bed. Again he wondered: Why? Why had the old woman asked for Jonas?\u003c/p\u003e\n\u003cp\u003eAnd how soon could Jonas excuse himself and come away? Gabe needed to talk to him. Their conversation last night had seemed urgent. More than urgent; it had been alarming. Jonas, the most peaceful of souls, seemed to be commanding Gabe to commit a murder. He had not explained, not really. He had said they would discuss it more fully in the morning.\u003c/p\u003e\n\u003cp\u003eNow morning had passed, and Gabe wanted to know more. The old woman was dying, as old people always do. It was the natural way of things. Her friends were nearby, and Herbalist was sitting in the corner. She didn’t need Jonas. Not as much as Gabe did.\u003c/p\u003e\n\u003cp\u003e“Can’t you leave?” Gabe whispered, moving closer. “We need to talk. You promised to explain—”\u003c/p\u003e\n\u003cp\u003e“Shhh.” Jonas held up a hand.\u003c/p\u003e\n\u003cp\u003eNow, through the dim light, he could see Jonas more clearly, and the woman in the bed as well. Her eyes were open, and it was clear that she had seen Gabe approaching. Her thin fingers moved, plucking at the blanket. Jonas was watching her very closely; now he leaned forward, as if to listen. Her thin, dry lips were moving. Gabe could not hear, at first, what she said. But Jonas did. Jonas was nodding.\u003c/p\u003e\n\u003cp\u003eGabe stood there uncertainly. The woman’s mouth began to move again, and he found himself leaning forward to listen. This time, nearer, he could hear her words.\u003c/p\u003e\n\u003cp\u003e“Tell him,” she was saying to Jonas.\u003c/p\u003e\n\u003cp\u003eTen\u003c/p\u003e\n\u003cp\u003eI’m sorry. I just don’t believe you.”\u003c/p\u003e\n\u003cp\u003eGabe’s voice was both skeptical and firm.\u003c/p\u003e\n\u003cp\u003eJonas leaned forward, his elbows on his knees. He cupped his own face with his hands. They were sitting together on the bench behind the library, the same bench where he had so recently sat with Claire.\u003c/p\u003e\n\u003cp\u003eHe looked up and sighed. “I felt the same way yesterday when she told it to me. I sat here thinking: This woman is crazy. Is that what you’re thinking now of me, Gabe?” \u003c/p\u003e","sourceLink":"https://allnovel.net/son-the-giver-quartet-4/page-34.html","bookId":1704,"creation":"Oct 5, 2019 10:00:04 AM","modification":"Oct 5, 2019 10:00:04 AM"}
