{"id":21917,"no":19,"title":"Chapter 10","content":"\u0026nbsp;So there it was, all finished, all done, and for the last time Lovat looked at it, saw the green mountains, the tumbling river, the white span of the bridge. But the bridge and he were finished now. His work was done. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little Latin-American official touched his elbow deferentially.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excellency, the train!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, the train,\" Lovat repeated mechanically. His companion looked at him with grave sympathy. Only three months ago Lovat was a young and happy bridegroom. To-day the builder was a grave gray-haired man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yes, the bridge was done, Lovat knew. A little while ago it was just the product of his hand and genius and will, a thing of himself. But now it was a fulfilled entity, with its own duties, its own uses, its own destiny. Over it went trains joining country to country and sea to sea. Over it went the loping Latin people. Over it went the little patient burros, pannier-laden. In confidence all went over it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will stand.\" Lovat knew. \"It will always stand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was no high note of proud achievement in his thought. It would not stand because of skill in building or strength in masonry. But because there guarded it one whose pleading sacrificial fingers would unclench the angry hand of God. Flood and thunder and immense winds would spare it because of that guardian like a white flame, to whose unselfishness selfish nature must do reverence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The official ventured to recall him:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excellency!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just one more moment!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had a vision of her for the moment, and his throat quivered and his eyes were uncertain. He saw her in her white, billowing gown, with her dark head and face like a flower. Two brown shy little children were standing fearful of the bridge, and she knelt to them. \"Come, darlings,\" he could hear the deep remembered voice. She led them confidently across his bridge, and as she led them she smiled to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Well, he must go. There was other work to be done, other bridges to build, until the time the Master of the Masons told him to rest. He must be about his work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All our life is work,\" he said to himself as he boarded the train. \"All our love is comradeship.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Well, there was work to be done, and there was comradeship. She would always be with him now, being dead....\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3292/90013.html","bookId":459,"creation":"Aug 2, 2019 2:28:37 PM","modification":"Aug 2, 2019 2:28:37 PM"}
