{"id":21906,"no":8,"title":"Chapter 4","content":"\u0026nbsp;He came into the kitchen, two evenings later, from the parlor. His father sat by the table, reading his paper. His mother pottered about the turf fire, teasing it into flame. In a corner Joe sat, polishing the barrel of a breech-loading fowling-piece with an old rag. His father caught the glimpse of paper in his hand. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Were you writing, Willie John?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay,\" Grant answered; \"I was writing a letter to America.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He moved toward the fireplace and turned slowly about again to his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were saying,\" he asked, \"that that place of McKenna\u0027s was for sale. I wonder how much he \u0027d want for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He \u0027d take four thousand pounds,\" his father answered. \"Maybe less.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I \u0027m afraid I have n\u0027t got that much.\" Grant shook his head. \"I \u0027ve only two thousand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We can lend you the difference, Willie John,\" Joe broke in. He squinted down the barrel of the rifle. \"Can\u0027t we, Dad?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ay sure!\" his father answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I \u0027m much obliged to both of you,\" Grant said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He reached for his hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going out, Willie John?\" his mother asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I \u0027d go up and call on Eunice Doran,\" Grant answered her. \"I might as well be neighborly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went out, and there was silence in the kitchen for a few minutes. Joe clicked the lock of the gun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mind that wild gander I put a ring on three years ago?\" he asked his father. \"It\u0027s back again. I saw it over the marshes to-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It \u0027ll take a mate and settle down in the marsh now.\" His father nodded. \"It took it three years to find out that home is a good place. It\u0027s a queer, silly bird—the barnacle goose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A little ripple of laughter came from the mother\u0027s lips as she stood over and poked the turf. The elder Grant looked up, astonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you laughing at, Sarah Ann?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was thinking,\" she answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What was it you were thinking about?\" he pursued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh nothing!\" she parried. \"I was just thinking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she went on teasing the fire, while a subtle, affectionate smile played about the corners of her eyes.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3292/90002.html","bookId":459,"creation":"Aug 2, 2019 2:28:37 PM","modification":"Aug 2, 2019 2:28:37 PM"}
