{"id":97486,"no":4,"title":"Page 4","content":"\u003cp\u003eSIX\u003c/p\u003e\n\u003cp\u003eDr. Evergreen\u0027s party was almost no fun at all after the discovery of the headless corpse.\u003c/p\u003e\n\u003cp\u003eThe police showed up. Guests were questioned and questioned again. Efficient men in white coats zipped the body into a black bag and wheeled it away in an ambulance. A few special people like Allen were asked to come down to the station for further questioning. Allen dutifully went along and answered what he guessed were routine questions.\u003c/p\u003e\n\u003cp\u003eAs if there\u0027s ever anything routine about a decapitation.\u003c/p\u003e\n\u003cp\u003eAllen sat in the bland interrogation room sipping tepid coffee under fluorescent lights. His stomach was upset. He was tired. He vaguely felt like the cops suspected him of something even though he\u0027d been assured numerous times they only wanted to be as complete as possible and if Allen could just be patient, they\u0027d wrap all this up as soon as possible.\u003c/p\u003e\n\u003cp\u003eThe police evidently had a very different definition of \"as soon as possible.\"\u003c/p\u003e\n\u003cp\u003eAnother cop asked him the same list of questions for the third time. There were forms to sign. They confirmed Allen\u0027s contact information. Just as it looked like they were about to let Allen go, a particularly dour-looking cop had one more question for him.\u003c/p\u003e\n\u003cp\u003e\"You have any knowledge of what this might be about?\" The cop held up a tiny glass vial, sealed at the top. It was three-quarters full of thick, red liquid. Crescent-shaped particles floated in the liquid, in addition to strands of what appeared to be thread.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen that,\" Allen said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s blood and fingernail clippings and hair,\" the cop said. \"It was found in the victim\u0027s jacket pocket.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, gross,\" Allen said. \"Hey, I have nothing to do with that, okay? All I did was find the body.\"\u003c/p\u003e\n\u003cp\u003e\"You ran into the woods after you heard the scream. That\u0027s right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I told you that.\" He\u0027d said nothing about Penny. They hadn\u0027t asked.\u003c/p\u003e\n\u003cp\u003e\"And there was a wolf at the scene, which ran away when the other party guests approached the scene?\"\u003c/p\u003e\n\u003cp\u003e\"It was dark. Like I said before, it was probably just a big dog.\" Allen was eager not to seem crazy-cuckoo.\u003c/p\u003e\n\u003cp\u003e\"We appreciate your time, Mr. Cabbot. We\u0027ll call you if we think of anything else to ask.\"\u003c/p\u003e\n\u003cp\u003eAllen left the police station. Fast. All he wanted to do was get back to his dorm and sleep. It was after midnight by the time he got there. He slouched up the stairs, unlocked his door, and went into the dorm room, already unbuttoning his shirt, anticipating nothing but deep, dark sleep.\u003c/p\u003e\n\u003cp\u003e\"Allen!\"\u003c/p\u003e\n\u003cp\u003e\"Jesus!\" Allen clutched his chest. \"You scared the hell out of me.\"\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" Penny curled on Allen\u0027s bed in sweatpants and a T-shirt. \"I\u0027ve been waiting for hours and worried about you.\"\u003c/p\u003e\n\u003cp\u003e\"Where have I been? Where\u0027d you go at the party? Jesus, I heard this scream and thought you were being murdered or something. Did you hear about Kurt Ramis?\"\u003c/p\u003e\n\u003cp\u003e\"Of course! It\u0027s been all over the news. I went to my car to get something, and when I came back I couldn\u0027t get near Dr. Evergreen\u0027s house. The street was choked with police cars.\"\u003c/p\u003e\n\u003cp\u003e\"It was horrible. Penny, something ripped Kurt\u0027s head right off his body. I\u0027ve never seen anything like it, and I never want to again. The police kept me for hours.\"\u003c/p\u003e\n\u003cp\u003ePenny sucked in breath, slid to the edge of the bed. \"Holy shit, Allen, they don\u0027t think you did it?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. But I found the body. They had a lot of questions. Something else.\" Allen hesitated. \"Penny, I swear I saw a huge wolf near the murder scene. I thought it was going to eat me, swear to God.\"\u003c/p\u003e\n\u003cp\u003ePenny stood slowly. \"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"I mean, this fucking thing was snarling and going crazy. I really thought it was about to pounce.\"\u003c/p\u003e\n\u003cp\u003e\"Wolves are not indigenous to this area,\" Penny said flatly.\u003c/p\u003e\n\u003cp\u003e\"Well, I know what I saw, and it was-hey, are you mad at me or something?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just that with everything going on, I don\u0027t think you need to exaggerate, telling people your wolf story.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a story.\"\u003c/p\u003e\n\u003cp\u003e\"It was probably just a big dog.\"\u003c/p\u003e\n\u003cp\u003eAllen blew out a sigh, flopped onto his bed. \"Fine. A big dog.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, Allen.\" Penny eased down onto the bed next to him. \"If you don\u0027t want to be alone... I mean, if you want to talk or have some company, I know what you saw was probably upsetting and everything.\"\u003c/p\u003e\n\u003cp\u003e\"No, thanks. I\u0027m exhausted. All I want to do is go to sleep.\"\u003c/p\u003e\n\u003cp\u003ePenny stood again quickly. \"Of course, I mean... sure. I know you\u0027re probably exhausted. Right. I\u0027ll just go.\"\u003c/p\u003e\n\u003cp\u003e\"I talked to your friend Father Paul at the party.\"\u003c/p\u003e\n\u003cp\u003ePenny brightened slightly. \"Isn\u0027t he nice? I don\u0027t get to mass as often as I should, but I go when he\u0027s on duty.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. The whole conversation seemed a bit odd.\" Allen pulled the crucifix from the pocket of his sweatpants. \"He insisted I take this.\"\u003c/p\u003e\n\u003cp\u003e\"Good. You should wear it.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Look.\" She dipped two fingers under the collar of her T-shirt and came out with a silver crucifix. It was smaller but otherwise identical. \"You wear yours, and I\u0027ll wear mine. We can be Savior buddies.\"\u003c/p\u003e\n\u003cp\u003eAllen laughed. \"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re friends, aren\u0027t we?\"\u003c/p\u003e\n\u003cp\u003e\"Mmmmmm. What have you done for me lately?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious,\" Penny said.\u003c/p\u003e\n\u003cp\u003e\"You know we are.\"\u003c/p\u003e\n\u003cp\u003e\"Then do this for me,\" she said. \"Simply because I\u0027m asking you to.\"\u003c/p\u003e\n\u003cp\u003e\"But why?\"\u003c/p\u003e\n\u003cp\u003e\"Do it for me, and I\u0027ll tell you later.\"\u003c/p\u003e\n\u003cp\u003eAllen looked at her, then at the crucifix, and back to her. He hadn\u0027t figured her for the religious type.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t I get you through Professor Mayflower\u0027s Restoration lit class?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Then humor me.\"\u003c/p\u003e\n\u003cp\u003eHe smiled and shrugged, slipped the thin chain over his head. The crucifix hung heavy to the middle of his chest. \"There. Happy? You saved my soul.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003ePenny left him to sleep and to dream.\u003c/p\u003e\n\u003cp\u003eYou\u0027ve probably heard all the Freud stuff about dreams, the subconscious stretching and giving itself a workout, all those dreams that originate from within. Going to class in your underwear. The dream where you\u0027re falling and falling and falling.\u003c/p\u003e\n\u003cp\u003eBut there\u0027s another sort of dream too. The kind that comes from elsewhere, that wriggles into your mind. An invasion. Allen dreamed of eyes. Cool, calm eyes of the night, eyes he felt had been watching him for centuries. Eyes that ate the light and lived in darkness. And he was cold; he shivered.\u003c/p\u003e\n\u003cp\u003eAllen awoke at dawn, covered in sweat and burdened with some nameless dread that he couldn\u0027t explain.\u003c/p\u003e\n\u003cp\u003ePRAGUE\u003c/p\u003e\n\u003cp\u003eThe rest of the semester passed uneasily. The headless murder lingered in the newspapers and on the TV news, the story catching fire again whenever the police insisted they had a lead or were questioning a new suspect. Every trail, however, led to a dead end. The mystery eventually passed into local legend, the tale becoming strange and exaggerated. For Halloween, the bloody, headless corpse wearing a bomber jacket became a favorite costume of Gothic State students.\u003c/p\u003e\n\u003cp\u003eIn the meantime, Allen passed his exams (with Penny as a dutiful study partner) and readied himself for his journey overseas. The week before their flight, Evergreen peppered him with emails, reminding him of books and materials to pack. Allen was being asked to go ahead of Dr. Evergreen to supervise the arrival of some equipment about which Evergreen was very vague. He grew exceedingly cranky if pressed for an explanation. Allen did not relish the idea of being in a foreign city alone.\u003c/p\u003e\n\u003cp\u003eHere he comes now. You can see his American Airlines flight descending toward Prague airport after a three-hour layover at Heathrow. Allen is coming to me, to my hometown. I wasn\u0027t born here, no, but after so many centuries one can\u0027t help but think of it as home.\u003c/p\u003e\n\u003cp\u003eThere he is coming through customs. He looks terrible, hasn\u0027t slept a wink. Poor bastard. I\u0027d show him around town if I could, but life\u0027s a bitch when you\u0027re not corporeal.\u003c/p\u003e\n\u003cp\u003eSEVEN\u003c/p\u003e\n\u003cp\u003eThe surly Czech cab driver dropped him in front of the apartment building in the little neighborhood across from Letna Park. Rain flayed the world, and Allen, struggling with his two enormous suitcases, was soaked in just the quick dash across the sidewalk and into the building. He hauled his luggage up two flights of stairs, then collapsed in front of number three, the apartment Dr. Evergreen had arranged for himself for the summer.\u003c/p\u003e\n\u003cp\u003eAllen unzipped the front pouch of the first suitcase, fished out the key he\u0027d been given, and entered the apartment. It was spacious, with two bedrooms, a sitting area that bled into the kitchen, and a balcony that overlooked the street in front. From this vantage point he saw warm light in the windows of a neighborhood pub not even half a block away. He had a sudden, overwhelming urge to sample the Czech beer he\u0027d heard so much about, but if he missed the delivery, there would be hell to pay with Dr. Evergreen.\u003c/p\u003e\n\u003cp\u003eAnd anyway, he was getting wet again standing on the balcony.\u003c/p\u003e\n\u003cp\u003eBack inside, he changed into dry clothes. He turned on the TV, found he had three channels. One showed something incomprehensible in Czech, and another showed something incomprehensible in German. The third showed soccer.\u003c/p\u003e\n\u003cp\u003eAllen switched off the television and turned his attention to the present Penny had given him when she\u0027d dropped him off at the airport.\u003c/p\u003e\n\u003cp\u003eThe Rogue\u0027s Guide to Prague was intended to be an irreverent travel guide to the city, pointing out all the usual tourist attractions, offering helpful hints for travelers, but also providing tongue-in-cheek commentary about various parts of the city and its environs. He read the entry for the Letna neighborhood:\u003c/p\u003e\n\u003cp\u003eMore difficult, but not impossible, to locate a hooker in one of the local taverns of this quiet neighborhood. Better chances at the nearby Hole\u0026amp;#353;ovice train station. The area is bordered by Letna Park on the south and Wenceslas Park to the north, known for its extensive rose gardens. There are numerous quiet grottos and shrubby enclaves where prostitutes can pleasure you if you\u0027re too cheap to spring for a room.\u003c/p\u003e\n\u003cp\u003eAllen glanced through some of the area\u0027s highlights.\u003c/p\u003e\n\u003cp\u003e\u0026amp;#8226; The Charles Bookstore and Caf¨¦: Unlike the more touristy places in the city center, you can still get breakfast or lunch here for a song. The strong coffee will crush your balls. Cold beer. Local prices. The girls with tattoos and nose rings who work at the place know enough English to refuse your advances.\u003c/p\u003e\n\u003cp\u003e\u0026amp;#8226; Metronome Sculpture in Letna Park: This useless piece of crap gives the graffiti artists something new to deface instead of the old giant statue of Stalin. But the view here is magnificent. You can look down into the heart of Prague where things are actually happening. The constant racket of skateboarders will make you long for the old days of the iron-fisted Communists who would have sent these punks to the gulag without blinking.\u003c/p\u003e\n\u003cp\u003e\u0026amp;#8226; Kjyeilkle\u0027s Pub: No English. Very few hookers.\u003c/p\u003e\n\u003cp\u003eAllen closed the book, wondered if Penny had meant it as a gag or if she\u0027d really thought Allen would be able to get useful information out of it. He waited another hour, dozed off to the sound of the rain against the windows and balcony. A harsh knock on the door woke him with a start. He rubbed his eyes, stumbled to answer it.\u003c/p\u003e\n\u003cp\u003eHe opened the door to four grumpy, rain-soaked men, who babbled at him in Czech until he got the message they wanted him to move the hell out of the way. He stepped aside, and the men grunted and heaved a long wooden crate into the middle of the apartment. They shoved a clipboard into Allen\u0027s hands and mimed for him to sign it, which he did right before they left, muttering and frowning.\u003c/p\u003e\n\u003cp\u003eThe wooden crate was nearly seven feet long and came almost up to his belt. He\u0027d been told to wait for some things Dr. Evergreen was having shipped, but Allen had figured it was just miscellaneous luggage and books. An overwhelming curiosity seized him, a strong desire to crowbar the thing open and take a look.\u003c/p\u003e\n\u003cp\u003eHe ran his hands across the rough wood, knocked. Thick planks, something heavy inside. He tried to push the crate off to the side but couldn\u0027t budge it alone. He sat on the crate, let his legs dangle. The rain continued its hypnotic splat against the windows. After signing for Evergreen\u0027s package, Allen was supposed to see to his own accommodations, but he was loath to trek through the downpour.\u003c/p\u003e\n\u003cp\u003eA whiff of something wet and pungent caught his attention. Allen leaned over, put his nose close to the surface of the crate, and sniffed an earthy smell, like freshly tilled soil, moist and rich.\u003c/p\u003e\n\u003cp\u003eAllen stretched out on top of the crate, yawned. He was jet-lagged. His eyelids grew heavy, and in seconds he was drawn into deep, dark slumber.\u003c/p\u003e\n\u003cp\u003eNight had fallen. Allen rose from the crate, the full moon casting a pale blue light through the open balcony door. He shivered, a cold wind flowing around him. He saw his own breath fogging between his lips.\u003c/p\u003e\n\u003cp\u003eIt\u0027s summer. I didn\u0027t pack anything warm. He hugged himself.\u003c/p\u003e\n\u003cp\u003eA creak of floorboards. Allen jerked his head around, looked at the front door, saw nothing. The room seemed to groan under its own weight, and Allen suddenly felt the immensity of the apartment building, an eerie self-awareness of himself as an insignificant part of a greater whole, sleeping minds in other apartments, people eating, screwing, watching television.\u003c/p\u003e\n\u003cp\u003eA gust of cold wind on his neck and he turned back to the balcony. Allen gasped at the figure standing there.\u003c/p\u003e\n\u003cp\u003eHer skin glowed white, the frigid wind lifting the midnight hair off her shoulders, her eyes blazing with cold fire. Cassandra. It was Evergreen\u0027s wife, wearing some shimmering, silky gown, her figure clear beneath the sheer material, soft white breasts threatening to overflow the gown\u0027s plunging V-neck. She stretched her hands out to him, the red of her glossy fingernails like radioactive raspberry fire. The color matched her lips, the contrast of the bright red against her white skin doing strange, animal things to him.\u003c/p\u003e\n\u003cp\u003eAllen. Her lips didn\u0027t move; the voice echoed in his head.\u003c/p\u003e\n\u003cp\u003eShe drifted closer to him, her feet seeming not to touch the ground, the gown billowing around her. The wind howled now, washing the apartment intensely cold. The drapes flapping violently, bits of paper and debris flying around the room.\u003c/p\u003e\n\u003cp\u003eAllen was unable to move his body or rip his eyes away from Cassandra\u0027s gaze.\u003c/p\u003e\n\u003cp\u003eShe moved close to him, rested her hands on his thighs. An electric shock went to his groin, his sudden anticipation growing. He trembled as her face inched toward his, felt her breath on his mouth. She sank into him, breasts pushing against his chest.\u003c/p\u003e\n\u003cp\u003eAllen trembled, his erection straining painfully against his jeans. Her lips pressed frozen against him, a violent mix of cold fire, pain, and ecstasy. He tried to push away, but Cassandra\u0027s tongue pushed its way into his mouth, invading him.\u003c/p\u003e\n\u003cp\u003eHe wrenched himself away and scooted back on the crate. He opened his mouth to scream but couldn\u0027t draw breath. He worked his mouth, tried to get air. Allen. Her voice filled his mind.\u003c/p\u003e\n\u003cp\u003eAllen\u0027s eyes popped open. He sucked breath and screamed, rolled off the crate, and landed with a thud on the hard wooden floor.\u003c/p\u003e\n\u003cp\u003eHe raised his head slowly, looked around. It was still day. The rain had eased but still fell in a drizzle. He was alone. His fingers went briefly to his lips, the dream images lingering and disturbing. Arousal and dread hung on him in equal portions.\u003c/p\u003e\n\u003cp\u003eHe backed away from the crate, gathering his luggage as he went. He left the apartment, flew down the stairs two at a time, and sprinted from the building, out into the drizzle.\u003c/p\u003e\n\u003cp\u003ePrague lay before him like a mysterious stranger in an old hat.\u003c/p\u003e\n\u003cp\u003eAn exotic woman waiting for him in poor light.\u003c/p\u003e\n\u003cp\u003eLike an inviting gypsy with a brand-new iPod.\u003c/p\u003e\n\u003cp\u003eAnyway, it was Prague.\u003c/p\u003e\n\u003cp\u003eEIGHT\u003c/p\u003e\n\u003cp\u003eAllen overpaid a cab driver to take him to Charles University.\u003c/p\u003e\n\u003cp\u003eThe housing administrator spoke good English and sent Allen to a crusty brick building, down a narrow dim hall, to a ten-by-ten-foot room with a barren desk and a set of cold war bunk beds. It resembled a prison cell more than a dorm room, the walls an industrial sort of faded green, the tile floor gray and cold. The view from the window was the brick wall of another building five feet away.\u003c/p\u003e\n\u003cp\u003eThe university had been founded in the 1300s. The dorms didn\u0027t seem much more modern. Naked pipes ran up the walls and across the ceiling. They clanked periodically.\u003c/p\u003e\n\u003cp\u003eAllen unpacked a length of thin line and stretched it across the room, draped his wet clothes over it. He changed again, this time into khaki shorts, white ankle socks and Sketchers, and a dark green Gothic State T-shirt. He\u0027d been told there were laundry machines in the basement of the dorm. If he kept getting soaked, he would probably have to visit it sooner than planned. He put the rest of his things into the tiny closet.\u003c/p\u003e\n\u003cp\u003eJet lag pulled at him, but the haunting nightmare of Evergreen\u0027s wife still fogged his brain. He would not be able to sleep. Not yet. Maybe a jolt of caffeine would help. Allen consulted The Rogue\u0027s Guide for a nearby coffee shop.\u003c/p\u003e\n\u003cp\u003e\u0026amp;#8226; The Globe Caf¨¦ \u0026amp; Bookstore: Convenient to the National Theater and a number of tram and metro stops, the Globe is a favorite of expatriates tired of struggling with their Czech language books. Patrons enjoy a cold pilsner or a strong cup of coffee all while luxuriating in the English language. Tired of chicks rebuffing you in some foreign tongue? Come get shot down in English. It\u0027s all so comfortably familiar. Hey, you might even get lucky with some coed from Long Island, away on her first trip, putting the whole thing on Daddy\u0027s American Express card, and man, there you are buying her all the absinthe she can handle until BAM she wakes up in Wenceslas Park without her panties. What\u0027s really cool is that most of the American chicks won\u0027t know where you\u0027re from, so quick thinking and a passable fake British accent will smooth the way. I mean, what\u0027s with these chicks and British accents? Maybe they like to pretend you\u0027re James Bond. Who knows? What happens in Prague stays in Prague. A selection of English language books and email terminals available.\u003c/p\u003e\n\u003cp\u003eA chalkboard sign outside the Globe advertised a poetry reading that night, reminding Allen that soon the summer-program fiction and poetry students would descend upon the city. Penny would arrive in a few days, and Allen brightened at the thought. It would be nice to have somebody with whom he could pal around the city. He absentmindedly touched the crucifix under his T-shirt. Somewhere back in America, Penny wore hers. He\u0027d kept his promise; he put the thing on every day when getting dressed. He was even starting to like it.\u003c/p\u003e\n\u003cp\u003eInside, Allen purchased a strong cup of black coffee and rented one of the computers for twenty minutes to check email. The first message from Dr. Evergreen reminded Allen (for the fiftieth time) how important it was for him to make sure his crate was delivered safely. Allen replied, assuring the professor all was well.\u003c/p\u003e\n\u003cp\u003eThe next message, from Penny, asked if he\u0027d arrived safely. He wrote back that he had but was exhausted. He sipped the coffee, which burned down his throat like acid. It would either wake him up or kill him.\u003c/p\u003e\n\u003cp\u003eAnother email from Evergreen-a perplexing list of research tasks that seemed to have nothing whatsoever to do with Kafka. Allen put them off for later.\u003c/p\u003e\n\u003cp\u003eHe deleted a dozen spam emails before arriving at the final message:\u003c/p\u003e\n\u003cp\u003eYou don\u0027t know what you\u0027re getting into. Be alert. Be cautious. We shall be in contact soon. Trust no one!\u003c/p\u003e\n\u003cp\u003eThe Three\u003c/p\u003e\n\u003cp\u003eThe email address was\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* \u003c![CDATA[ */(function(){try{var s,a,i,j,r,c,l,b\u003ddocument.getElementsByTagName(\"script\");l\u003db[b.length-1].previousSibling;a\u003dl.getAttribute(\u0027data-cfemail\u0027);if(a){s\u003d\u0027\u0027;r\u003dparseInt(a.substr(0,2),16);for(j\u003d2;a.length-j;j+\u003d2){c\u003dparseInt(a.substr(j,2),16)^r;s+\u003dString.fromCharCode(c);}s\u003ddocument.createTextNode(s);l.parentNode.replaceChild(s,l);}}catch(e){}})();/* ]]\u003e */\u003c/p\u003e\n\u003cp\u003eAllen raised an eyebrow, hesitated, then replied,\u003c/p\u003e\n\u003cp\u003eWho are you and what the hell are you talking about?\u003c/p\u003e\n\u003cp\u003eAllen glanced over his shoulder. Nobody was taking any particular notice of him. Indeed, the idea that there was anyone within a thousand miles who even knew his name was utterly ridiculous.\u003c/p\u003e\n\u003cp\u003eAllen finished his coffee, walked out the front door, and ran smack into a priest.\u003c/p\u003e\n\u003cp\u003e\"Allen!\" Father Paul greeted him enthusiastically. \"Imagine running into you here.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-a-go-go/page-4.html","bookId":2600,"creation":"Oct 5, 2019 6:28:05 PM","modification":"Oct 5, 2019 6:28:05 PM"}
