{"id":99874,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How long do you think we will stay in Bistriţa?” Her hands were gentle as she drew the bands of paper from my hair and arranged the curls.\u003c/p\u003e\n\u003cp\u003e“However long it takes for the hunters to leave Buda I suppose.” I opened up my powder box and peered at its dwindling contents. I had brought it with me from England, but rarely used it until I was a vampire. It tended to understate my ethereal appearance when I dabbed it on my face. “I do wish to return as soon as possible and rebuild the estate. I miss having a proper home.”\u003c/p\u003e\n\u003cp\u003e“It’s not suitable for you to be living in a hotel for an extended period of time,” Magda agreed. “I worry that you are vulnerable here. Not only to the hunters, but...” Her voice trailed off as she set down my comb. Her fingers lingered over the ivory teeth as she hesitated in speaking. At last she asked very quietly, “Why is he not here?”\u003c/p\u003e\n\u003cp\u003eShe had not dared asked the question before. I had seen it lingering in her eyes since she had arrived, but had kept quiet. I cast down my gaze as I clasped my hands in my lap. Fear filled me and I could not find the words to speak. I trusted her, yet I was afraid. I knew she was hoping I would answer, yet was resigned to the possibility I would not. Her long fingers plucked an ornate comb with tiny emeralds from the table and began to arrange it in my tresses.\u003c/p\u003e\n\u003cp\u003eReaching up, I took hold of her wrist and raised my attention to her very dark, very beautiful eyes.\u003c/p\u003e\n\u003cp\u003e“I have done something so terrible, I dare not speak of it,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Is he dead?” she gasped, hope struggling with despair in her expression.\u003c/p\u003e\n\u003cp\u003eI shook my head, releasing her. My ring flashed on my finger as I reached out to open my jewelry box. I drew out a hatpin and picked up one of the long strips of paper she had used to curl my hair. I thrust the hatpin through the paper and into the wood of the dressing table. Peering up at her, I pointed to the paper.\u003c/p\u003e\n\u003cp\u003e“Imagine that is him...”\u003c/p\u003e\n\u003cp\u003e“Oh, dear!” She gasped, her hands covering her mouth in horror. Falling to her knees, she grabbed my hands. “And he is not dead?”\u003c/p\u003e\n\u003cp\u003eI adamantly shook my head. “He is banished to his coffin, unable to move or feed. He is in limbo, not alive, not yet dead.”\u003c/p\u003e\n\u003cp\u003e“That’s good,” she said in a voice harsh with emotion. “That’s very good. Then he cannot hurt you.” Despite her relief, her eyes were brimming with tears. “You are not a cruel person. I must ask, what drove you to do such a terrible deed?”\u003c/p\u003e\n\u003cp\u003e“Cneajna tried to murder me. He would have killed her and the other two Brides had I not impaled him.” Tears fell down my cheeks as I clutched her hand to my bosom. “I could not bear to see him murder my vampire family as he had my mortal family. Even if the sisters loathe me and wish me dead, I could not endure their deaths.”\u003c/p\u003e\n\u003cp\u003eMagda pressed kisses to my fingers before resting her forehead against them. Her fear and despair were tangible. “I am grieved because it is he who has given me a long life with his blood. But I am gratified at the thought of you being free of him. He is vile. He is evil!”\u003c/p\u003e\n\u003cp\u003eMy blood tinged tears fell upon my white flesh as I leaned over her. My voice low, I spoke, “I could not bear it. I could not. Though his blood is my blood, his legacy my legacy, I could not allow him to destroy those I loved. When I struck him down, it grieved me, yet I was right to do so. For all he is to me is pain.”\u003c/p\u003e\n\u003cp\u003eFlinging her arms around my neck, Magda crushed me close. In that moment, we were sisters of Vlad’s house for though she was not a vampire, she was imbued by his blood and bound to him. Though she feared and hated him, she was also loyal to him. She trembled as her emotions churned within her.\u003c/p\u003e\n\u003cp\u003e“You must let me drink of your blood,” she whispered fervently. “If you do not, his blood will call to me to rescue him now that I know his fate. Even now I feel the terrible pull of my bond summoning me to rise up and free him.”\u003c/p\u003e\n\u003cp\u003eWrought with emotion, yet understanding her dilemma, I acquiesced. She continued to kneel at my side as I dried my tears with a handkerchief.\u003c/p\u003e\n\u003cp\u003e“I will protect you from him,” I promised as I picked up my letter opener.\u003c/p\u003e\n\u003cp\u003eTears glittered on her dark lashes as she bit her bottom lip. “I wish to serve you even if he should slay me upon rising.”\u003c/p\u003e\n\u003cp\u003eI drew the blade hard against my wrist, pain slicing through me as it cut into my flesh, and I held out my hand to her. Blood flowed from the wound to pool in my palm. Bending down, she drank, her fingers lightly touching my wrist. I closed my eyes as I felt my blood claim her. As Vlad had infused her with strength, health, and a long life, I now did the same. I felt the coil of my power flowing into her, entwining us. The dying embers of Vlad’s hold over her were quashed completely as my dark flame roared to life within her.\u003c/p\u003e\n\u003cp\u003eFalling back, she lay on the floor at my feet, breathing heavily as her body trembled with the power of the blood filling her. Licking the blood from my wrist, I felt the wound began to heal. I knelt down beside her to rest my hand against her quivering shoulder.\u003c/p\u003e\n\u003cp\u003e“I serve you,” she whispered.\u003c/p\u003e\n\u003cp\u003e“We shall endure this together,” I swore. “We will return to Buda, far from him, and we shall be free.”\u003c/p\u003e\n\u003cp\u003eLetter from Adem to Astir\u003c/p\u003e\n\u003cp\u003eJune 4, 1820\u003c/p\u003e\n\u003cp\u003eDear Lord Astir,\u003c/p\u003e\n\u003cp\u003eI have much to divulge. Forgive me for writing this in haste, but the Countess is expecting me when she rises and I have just arrived back at the hotel from the castle. I have at last discovered what has happened to Count Dracula and can now impart that information to you.\u003c/p\u003e\n\u003cp\u003eAs you know, before I could not venture into the castle for an unseen power warded it against trespassing. At first I thought this to be Dracula’s own doing, but slowly realized it was that of the Countess. I still do not believe she understands that by will alone she has kept the castle hidden by her power. I have tried on numerous occasions to subtly compel her to visit the castle, but she has always resisted.\u003c/p\u003e\n\u003cp\u003eWith the arrival of Magda, I have at last found a way to influence the Countess to dispatch me to the castle, therefore allowing me free passage through her power into the home of Count Vlad Dracula...\u003c/p\u003e\n\u003cp\u003eThe Journal of Countess Dracula\u003c/p\u003e\n\u003cp\u003eJune 3, 1820\u003c/p\u003e\n\u003cp\u003eThe Golden Krone Hotel, Bistriţa\u003c/p\u003e\n\u003cp\u003eI fear I have done something foolish, but I cannot help myself. My emotions have overwhelmed me and have compelled me to action. It all began simply enough. Magda asked if she should secure coffins for my family to be shipped to Buda for proper burial...\u003c/p\u003e\n\u003cp\u003eI turned sharply, my shawl sliding down from my shoulders. I had been sitting near the window enjoying the light falling from the waning moon while reading a novel as Magda worked on her mending.\u003c/p\u003e\n\u003cp\u003e“Why do you ask?” I was startled by her suggestion.\u003c/p\u003e\n\u003cp\u003eMagda’s gaze darted toward me. Her expression was one of confusion and surprise when she realized she had upset me. “Forgiveness, Countess. I saw a funeral procession earlier today as I went about my errands. I thought of your family when I saw them pass.”\u003c/p\u003e\n\u003cp\u003eLaying my book upon my knees, I stared at the dark ruby glittering on my finger. Desperate for companionship and understanding, I had brought her into my confidence once she was bound to me by blood. I had shared the events that had occurred since I had arrived at Vlad Dracula’s castle with my family. She was now aware that my family resided in a chest in the cellar of the hotel. Though I had spoken to her in passing of having my family moved to Buda to be entombed once a new estate was secured, I had not truly considered all that would entail bringing my family to their final rest.\u003c/p\u003e\n\u003cp\u003e“I only thought that if they each had their own coffin that it would be more dignified. Also, there would be less of a risk of the chest being lost or stolen in transit. I do not think a desperate thief would take a coffin,” she continued.\u003c/p\u003e\n\u003cp\u003eIn my selfishness, I wanted them near me. Therefore, the chest had been convenient. I had consoled myself with the thought of them being together as they rested in the darkness of the hotel cellar awaiting a proper burial.\u003c/p\u003e\n\u003cp\u003e“I suppose it would not be ill advised for transport back to Buda.” I was chastened by her words. I felt embarrassed at my shortsightedness in the proper care of my dead family. I know that I am sometimes a selfish creature and can be led astray by that sin. That I should not see what so clearly was the right and proper course of action made me fear that I am more of a monster than I deemed. Fresh tears threatening to spill, I said, “Please see to the procurement of the caskets. Hopefully, we shall be returning to Buda soon.”\u003c/p\u003e\n\u003cp\u003e“I can arrange for them to be laid out properly. I can buy new clothing and arrange to have their rosaries and personal items in their caskets.” Magda set down her sewing and regarded me earnestly. “I would be honored to perform this task for you.”\u003c/p\u003e\n\u003cp\u003eI flinched at the memory of my mother’s rosary repelling me when I was ravenous with the hunger and trapped with her in the darkness of the dungeon prison. “My mother’s rosary is still at the castle,” I confessed. “Vlad sent my father’s pocket watch to my brother to prove he was dead. May’s rosary disappeared. I suspect one of Vlad’s servants may have taken it.”\u003c/p\u003e\n\u003cp\u003e“I see,” Magda said softly. “And you dare not return because of the sisters.”\u003c/p\u003e\n\u003cp\u003e“I would be forced to kill them, I fear,” I admitted. “They hate me because he loved me most.” It pained me to think of my mother’s rosary. I had watched her bury it so as to hide its light to allow me to draw near and take her life. The thought of the tiny precious rosary buried in the dungeon of the monstrous castle made my heart ache. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vengeance-of-the-vampire-bride-vampire-bride-2/page-10.html","bookId":2615,"creation":"Oct 5, 2019 6:48:37 PM","modification":"Oct 5, 2019 6:48:37 PM"}
