{"id":94207,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eA coarse ripping of cloth filled the room like static. The sheets?\u003c/p\u003e\n\u003cp\u003eHands clawed at her feet. She kicked, struck what she thought was a chin, then there was only air as the ground whooshed away from her. She jerked her body, trying to free herself from the men who held her, ignoring the now constant agony shrieking through her body.\u003c/p\u003e\n\u003cp\u003eHer writhing couldn\u0027t stop a strip of linen from being wadded into her mouth, wrapped around her face, cutting into her skin, and silencing her more effectively than any hand could.\u003c/p\u003e\n\u003cp\u003eIt was easy work then, for the two men, to whisk her down the stairs and out the door. She watched Scrymgeour\u0027s castle recede in the shadows, the image wavering through the flood of her tears.\u003c/p\u003e\n\u003cp\u003eStop. She needed to calm down, or suffocate on those tears.\u003c/p\u003e\n\u003cp\u003eShe needed to focus. To fight. Think.\u003c/p\u003e\n\u003cp\u003eThis couldn\u0027t be random violence. Seventeenth-century Scotland was rife with feuding and retributions.\u003c/p\u003e\n\u003cp\u003eWho? Yet even as the question popped into her head, she knew.\u003c/p\u003e\n\u003cp\u003eCampbell.\u003c/p\u003e\n\u003cp\u003eMen invading Scrymgeours lands in the night. Revenge aimed at a MacDonald ally, or at MacColla himself. It could only be one man.\u003c/p\u003e\n\u003cp\u003eHe\u0027d kidnapped Jean once. And now it was her being taken in the night.\u003c/p\u003e\n\u003cp\u003eThey reached a copse of trees and the men dropped her feet hard to the ground. The impact jarred her, bringing with it a fresh wave of nausea. She doubled over, gulping convulsively, choking her own bile back down her throat. She tamped down the pain and tried to moderate her breathing, thinking she really would choke if she sicked up now.\u003c/p\u003e\n\u003cp\u003eThe cloth in her mouth was slick, drenched with her own spit. Haley bit at it. Wrenching her chin down, her tongue pushed at the gag, trying to force it from her mouth, but it wouldn\u0027t budge.\u003c/p\u003e\n\u003cp\u003eAs she caught her breath, she became aware of a stilted silence around them. The air tense with waiting.\u003c/p\u003e\n\u003cp\u003eHaley looked up and saw him. A man stood there, his eyes glued to her, fascinated.\u003c/p\u003e\n\u003cp\u003eA chill crept along her flesh. Campbell.\u003c/p\u003e\n\u003cp\u003eFor a split second, she hoped that perhaps he\u0027d been given short shrift by the history books. Perhaps Campbell had been a kind man. Maybe it was merely history\u0027s desire for a narrative, for good guys and bad guys, that had named him the villain.\u003c/p\u003e\n\u003cp\u003eClouds drifted thick overhead, glowing gray in the night sky. But in that moment they parted, and a bright moonbeam cut through the trees, illuminating them in an eerie wash of light.\u003c/p\u003e\n\u003cp\u003eAnd she saw him clearly then, recognized Campbell from all those portraits. The jowly features paler in the moonlight than any drawing had ever portrayed.\u003c/p\u003e\n\u003cp\u003eCruelty animated those features now. It was written at the corners of his eyes. Bracketed his thin, drawn lips.\u003c/p\u003e\n\u003cp\u003eShe saw him and she knew.\u003c/p\u003e\n\u003cp\u003eHe was every bit as evil as they\u0027d said.\u003c/p\u003e\n\u003cp\u003eJean shook her hand out, then banged on the door once again. It was a solid thing and even knocking as hard as she could didn\u0027 t make much of a sound. She considered kicking at it - she imagined that Haley lass would kick at it - but decided just to open it instead.\u003c/p\u003e\n\u003cp\u003eAs the door swung open, she suppressed a bout of nerves. The strange woman had pinned Jean with more than one wilting glare, and despite the peace they\u0027d seemed to reach, she wouldn\u0027t put it past Haley to come at her, claws beared and angling for a fight.\u003c/p\u003e\n\u003cp\u003eBut the room was quiet. Her trepidation turned to annoyance. Was the woman still abed? She\u0027d drank like a man, then spent the entirety of the next day in her room. Was she planning on lazing away yet another one? The attitude spoke to a certain entitlement that was new to her. Death and death alone would keep Jean in her bed for the day.\u003c/p\u003e\n\u003cp\u003eShaking her head, she strode in, wondering what the woman\u0027s background was, that she considered the daily running of her own life - not to mention such a simple consideration as appearing for a meal - as something beneath her.\u003c/p\u003e\n\u003cp\u003eBut the bed was empty.\u003c/p\u003e\n\u003cp\u003eShe was gone. It was hard to imagine that she\u0027d risen earlier than Jean that day. And even if she had, surely someone would have noted her appearance.\u003c/p\u003e\n\u003cp\u003eConfused, she wandered back into the hallway.\u003c/p\u003e\n\u003cp\u003e“What has your lovely features in such a muddle, and on such a fine morning?”\u003c/p\u003e\n\u003cp\u003eShe turned to see Scrymgeour walking toward her. The man had such a pleasant countenance, always with a gentle smile and an easy manner. Even his large size felt welcoming. Rather than implying sloth, the fullness at his waist spoke to a jovial nature and a love of life that was reassuring to Jean. The sight of him brought an instant swell of relief.\u003c/p\u003e\n\u003cp\u003e“I… yes. Lord Scrymgeour, perhaps you can be of assistance.”\u003c/p\u003e\n\u003cp\u003e“Och, please Jean.” Taking her elbow, he patted her arm. “I\u0027ve told you time and again. You must please call me John.”\u003c/p\u003e\n\u003cp\u003eShe felt her cheeks redden, and cursed her pale skin.\u003c/p\u003e\n\u003cp\u003eCasting her eyes down, she replied, “Yes, of course, John.”\u003c/p\u003e\n\u003cp\u003e“Now you must tell me, how may I be of service?”\u003c/p\u003e\n\u003cp\u003e“She… Haley, she\u0027s gone.” She nodded to the open doorway. “I came to fetch her for the morning meal, and she\u0027s not here.”\u003c/p\u003e\n\u003cp\u003e“Well, surely you just missed each other?”\u003c/p\u003e\n\u003cp\u003e“No, I\u0027d have seen her. She doesn\u0027t seem the sort to rise with the dawn.” Jean hadn\u0027t intended her comment to have such sass, and Scrymgeour\u0027s answering grin embarrassed her.\u003c/p\u003e\n\u003cp\u003e“Well, then.” He steered them down the hall, and the steady feel of his arm in hers warmed her. She tried not to wonder at the strangely calming effect he seemed to have on her. “Surely your brother will have some notion.”\u003c/p\u003e\n\u003cp\u003eThey reached MacColla\u0027s door too quickly. Scrymgeour lifted his hand to knock, and her arm felt cool where his hand had been.\u003c/p\u003e\n\u003cp\u003e“Come,” MacColla called brusquely.\u003c/p\u003e\n\u003cp\u003eScrymgeour opened the door, and Jean instinctively froze. The sight of her older brother never ceased to startle her . He\u0027d yet to don his tartan, and he stood at his washbasin in just his linen shirt. Though it reached almost to his knees, it revealed the thick muscle of his legs and chest in a way that his plaid, wrapped about his waist and tossed over his shoulder, did not.\u003c/p\u003e\n\u003cp\u003eJean braced. Though she had never once suffered his temper, she\u0027d watched warily through their childhood as others had. Alasdair\u0027s great good humor blackened into fury, as sudden and mercurial as a Highland storm.\u003c/p\u003e\n\u003cp\u003e“You\u0027ve not come to choke me again, is it?” He dashed the water from his face and gave a low laugh. The smile in his eyes was directed at his sister. “You forget, it\u0027s our brother Gillespie who likes your vile potions, not me.”\u003c/p\u003e\n\u003cp\u003eShe briefly returned her brother\u0027s smile. Like a great bear he was, and God help those who\u0027d tempt his wrath.\u003c/p\u003e\n\u003cp\u003e“Your sister bears news of our… guest,” Scrymgeour told MacColla.\u003c/p\u003e\n\u003cp\u003eJean looked up at Scrymgeour, gathering strength. Though he\u0027d let go her elbow, he still stood close by her side. She missed being in the care of a man. It felt good to remember how it was to have one speak for her at the most trying of times.\u003c/p\u003e\n\u003cp\u003eShe looked back at MacColla. A strange look pinched his eyes, and Jean wondered if she wasn\u0027t seeing something protective flicker in her brother\u0027s gaze.\u003c/p\u003e\n\u003cp\u003e“Aye.” she said. “Her bed is cold. I\u0027d swear she\u0027s been gone since before dawn.”\u003c/p\u003e\n\u003cp\u003e“What?” MacColla\u0027s face grew dark.\u003c/p\u003e\n\u003cp\u003eShe felt Scrymgeour put his hand at the small of her back. Jean appreciated the gallant gesture, but she knew Alasdair would rather injure his own self than bring harm to his sister.\u003c/p\u003e\n\u003cp\u003e“Och,” he growled, stalking to his bedside to retrieve his plaid. He remembered their time together in the kitchen. Haley\u0027s peculiar warnings of Ireland had unsettled him. “I knew something was amiss. Did she run away?”\u003c/p\u003e\n\u003cp\u003eJean only shrugged mutely.\u003c/p\u003e\n\u003cp\u003eHe shook his head impatiently. His sister would have no idea what had become of the woman. “Aye, of course you\u0027d not know.” He hastily wound his tartan about his waist. “What game does she play at?” he wondered aloud.\u003c/p\u003e\n\u003cp\u003eMacColla looked up at Scrymgeour. “Come, let\u0027s see her room then.”\u003c/p\u003e\n\u003cp\u003e“Aye, perhaps there\u0027s some clue.”\u003c/p\u003e\n\u003cp\u003eHe stormed into the hallway, Scrymgeour\u0027s words at his back.\u003c/p\u003e\n\u003cp\u003eIt was dim. There was light enough that the torches weren\u0027t lit, yet the sun had not yet reached high enough in the sky to burn off the night\u0027s cold shadows. The gray stone was cool under MacColla\u0027s bare feet. Scowling, he noted the stairway at the end of the corridor. Her room was just far enough away, just close enough to the stairs, that she could\u0027ve escaped silently.\u003c/p\u003e\n\u003cp\u003eWho is she? MacColla tried to tamp down the anger he felt surging through his veins. Where could she have gone?\u003c/p\u003e\n\u003cp\u003eHe\u0027d been taken in by those pretty gray eyes. Had he missed some ulterior motive? She\u0027d asked so many questions about James, had such unnerving insights about the king, about Ireland. What could her purpose be? Why trick him so, only to skulk away in the night?\u003c/p\u003e\n\u003cp\u003eHe strode into her room and paced a quick circle around it.\u003c/p\u003e\n\u003cp\u003e“Is anything missing, then?”\u003c/p\u003e\n\u003cp\u003e“I… ” Jean hesitated.\u003c/p\u003e\n\u003cp\u003e“Not that I can see,” Scrymgeour interjected. “There\u0027s naught much for the taking.”\u003c/p\u003e\n\u003cp\u003eMacColla walked to the bedside and tore back the sheets as if he might reveal her hiding there. He tossed aside one pillow and another, and then grew utterly still. A chill ran up his back, dread filling his gut like ice.\u003c/p\u003e\n\u003cp\u003eHe leaned down slowly and placed his hand on her pillow. Right beside a bloody handprint. A man-sized bloody handprint.\u003c/p\u003e\n\u003cp\u003e“God help her,” he whispered.\u003c/p\u003e\n\u003cp\u003e“What?” Jean found her voice. “Alasdair, what is it?”\u003c/p\u003e\n\u003cp\u003e“The lass didn\u0027t run.” He looked up at his sister, then to Scrymgeour. “She was taken.”\u003c/p\u003e\n\u003cp\u003eJean\u0027s mouth opened and shut wordlessly. She knew better than any of them what that meant.\u003c/p\u003e\n\u003cp\u003e“Campbell?” Scrymgeour asked.\u003c/p\u003e\n\u003cp\u003e“Who but?” MacColla\u0027s hand we nt to the back of his neck.\u003c/p\u003e\n\u003cp\u003eAn automatic gesture, reaching for the claymore that was usually strapped between his shoulders. His hand met only air, and he was instantly on his guard.\u003c/p\u003e\n\u003cp\u003eHe\u0027d not let Haley be taken by Campbell\u0027s dogs. The urge to find, to kill, to destroy the Campbell erupted anew, enraging him. Invigorating him. \u003c/p\u003e","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-22.html","bookId":1617,"creation":"Oct 5, 2019 6:07:03 PM","modification":"Oct 5, 2019 6:07:03 PM"}
