{"id":94210,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIf she was really going to fight him, she had to act now. Get close enough to render his blade useless.\u003c/p\u003e\n\u003cp\u003eShe charged the man, and felt a distant shot of pleasure at seeing shock on his face for a second time.\u003c/p\u003e\n\u003cp\u003eJust a few strides and she\u0027d reach him. His hand seemed to reach in slow motion to his sword hilt.\u003c/p\u003e\n\u003cp\u003eShe needed to give it her all, or give it up.\u003c/p\u003e\n\u003cp\u003eBracing for the agony she knew was coming, Haley leapt. She slammed into him, and the blow to her ribs was like knives slicing through her torso, dizzying her. Wrapping arms and legs about him, she clung like a monkey to the front of him.\u003c/p\u003e\n\u003cp\u003eHaley clawed tight to his injured shoulder and he grunted his own pain in her ear, his breath coming short and hot against her neck. It was an obscenely intimate pose, but she had to hug herself close enough to render his sword useless.\u003c/p\u003e\n\u003cp\u003eHis right arm wriggled from under her knee and he struck at her, trying to pull her from him.\u003c/p\u003e\n\u003cp\u003eClinging even tighter with her legs, Haley let go her right hand and pummeled a flurry of short punches directly on his wound.\u003c/p\u003e\n\u003cp\u003eShe was too close, though, and couldn\u0027t get enough power behind her fist. Hooking her feet behind his back, she let go her other hand and went for his eyes.\u003c/p\u003e\n\u003cp\u003eCupping his face in her hands as if ready to plant a kiss, she hooked her thumbs at the corners of his eyes and pushed back. It was a trick her dad had taught her. Snag the fingertips in, crane your opponent\u0027s neck back, and just as her father had promised, even the largest of men would fall at once, backward to the ground.\u003c/p\u003e\n\u003cp\u003eHe slammed against the hillside, the impact sending rocks clattering down. She immediately scooted up his torso, bearing her full weight down to jab her elbow in his bullet wound.\u003c/p\u003e\n\u003cp\u003eHer hands clasped together under her chin, fingers interwoven for maximum force. Battering him had left traces of his blood etched in the wrinkles of her hands. It was tacky between her palms, the smell gamy and metallic in her nose and mouth.\u003c/p\u003e\n\u003cp\u003eHis initial shout of pain was only a momentary triumph. She sensed him struggling beneath her, but was focused only on putting her all into grinding down on his injury, hoping he\u0027d pass out from the pain.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t sense his fist coming, slamming into the side of her face. White sparks exploded in her vision as she reeled to the side.\u003c/p\u003e\n\u003cp\u003eHe kicked out from under her, scrambling to his feet, and hopping backward a step, plowed his foot into her chin.\u003c/p\u003e\n\u003cp\u003eDarkness swallowed her for a moment, and she came to sliding slowly down the hill. Sharp rocks and gravel cut into her shoulder, and she whimpered, forcing air into her lungs.\u003c/p\u003e\n\u003cp\u003eHaley dug her heels into the slope, stopping her descent. Swiveling her head back up the mountain, she placed his location. He hobbled toward her, right hand on his bloodied shoulder, murder in his eyes.\u003c/p\u003e\n\u003cp\u003eShe got to her knees. Instinctively, she ran her tongue over her teeth. The taste of blood in her mouth sickened her, and she spat onto the rocks, wiping pink and red spittle from her chin.\u003c/p\u003e\n\u003cp\u003eHe let go of his shoulder and pulled his sword from its scabbard. The motion was slow to match the smile that spread over his face.\u003c/p\u003e\n\u003cp\u003e“No,” she said simply. It couldn\u0027t end like this. A sword on a hillside in seventeenth-century Scotland. More than her terror, it was the sense of unreality that froze her in place.\u003c/p\u003e\n\u003cp\u003eShe heard a dull thunk. Metal crunching into stone. The man in front of her hadn\u0027t moved, and it took her a moment to realize where the sound had come from.\u003c/p\u003e\n\u003cp\u003eShe looked down. A dagger hilt quivered, stuck blade -first into the hillside, not one foot from her.\u003c/p\u003e\n\u003cp\u003eAnd then she saw him. MacColla, on a rise above, his claymore in his hands. He\u0027d tossed her a weapon.\u003c/p\u003e\n\u003cp\u003eShe saw him and she knew why he was known as Fear Thollaidh nan Tighean, why men feared him and called him Destroyer of Houses. He was a wild thing, in a tartan of dreary colors, his dark brow furrowed into a hard line of rage and revenge.\u003c/p\u003e\n\u003cp\u003eHis sword was pointed at the Campbell clansman, but his eyes were riveted on her. Worry hardened his features and, wanting to reassure him, she pulled the dagger from the ground and gave him a small nod.\u003c/p\u003e\n\u003cp\u003eHe\u0027d heard the shot and flown up the hillside, dashing and scrambling up rocks until he saw them. He approached quietly, swiftly from the side, getting closer.\u003c/p\u003e\n\u003cp\u003eHaley was covered in blood. Alarm jolted him, pumping his heart and galvanizing his every muscle. He scanned her, looking for signs of injury, and when he found none, a knot deep in his core unraveled. Relief swelled through him, elated him.\u003c/p\u003e\n\u003cp\u003eHis eyes returned to the Campbell clansman. He was bloodied, his trews were splattered with it, his face smeared. MacColla held his breath, scanning the man for some wound, the n released it in a long sigh upon seeing the blackened hole at his shoulder.\u003c/p\u003e\n\u003cp\u003eHis blood. Not hers.\u003c/p\u003e\n\u003cp\u003eHe realized the man was wavering in his boots.\u003c/p\u003e\n\u003cp\u003eHaley. She\u0027d done it. It had been she who\u0027d fired the weapon.\u003c/p\u003e\n\u003cp\u003eSo strong, so brave as she knelt there, her black hair lifting in the breeze. So beautiful. She\u0027d stand and fight more: he was sure of it.\u003c/p\u003e\n\u003cp\u003eHe smiled. She\u0027d not have to.\u003c/p\u003e\n\u003cp\u003eHe jogged straight for the Campbell, and the hollow clacking of stone on stone under his step had the man turning. But too late.\u003c/p\u003e\n\u003cp\u003eWith a single, powerful swing, MacColla relieved him of his head.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eTossing his sword down, MacColla fell to his knees by\u003c/p\u003e\n\u003cp\u003eHaley\u0027s side, and joy shuddered through her.\u003c/p\u003e\n\u003cp\u003eShe had been poised to fight - and braced for defeat. But then he\u0027d appeared from nowhere. She\u0027d fought, and would have fought til the end, but a hero of old had shown up and taken care of everything, and she\u0027d been more than happy to let him.\u003c/p\u003e\n\u003cp\u003eHer modern sensibilities didn\u0027t want to think about what the implications of that were.\u003c/p\u003e\n\u003cp\u003eLooking at him now - black hair loose to his shoulders, the intensity of his rich brown eyes, the sweep of muted green, blue, and black plaid over his shoulder - the sight of him was so profoundly reassuring, so comforting, she had to hold herself up from collapsing to the ground in relief.\u003c/p\u003e\n\u003cp\u003eRoving his eyes over her, he rubbed his hands along her arms, her shoulders, patting her gently, searching for some injury.\u003c/p\u003e\n\u003cp\u003e“I… I\u0027m fine,” she said, and he stilled. MacColla took a deep breath, and though his body seemed to unclench, his gaze still wouldn\u0027t meet hers.\u003c/p\u003e\n\u003cp\u003eHe slowly drew his hands to her waist, held them there for a moment, then stroked up her torso, grazing his thumbs along the sides of her breasts.\u003c/p\u003e\n\u003cp\u003eHis eyes lingered on her every curve.\u003c/p\u003e\n\u003cp\u003eAnd instead of flaring with pain, her ribs suffused with warmth at his touch, as if the muscles could at last release, and she could be at ease.\u003c/p\u003e\n\u003cp\u003eFinally he looked up, his eyes locking with hers. And then lines etched deep at his forehead, instantly anxious to se e the blood on her face where she\u0027d been kicked. He was silent as he took the edge of his plaid, blotted her chin.\u003c/p\u003e\n\u003cp\u003eHe moved his focus to her mouth.\u003c/p\u003e\n\u003cp\u003eThe tartan slipped from his fingers, and MacColla stroked his thumb gently along her lower lip. He murmure d tenderly, his Gaelic words too low to understand.\u003c/p\u003e\n\u003cp\u003eHis face was close now and Haley drank him in. The beautiful face that was too fierce to be conventionally handsome. The strong, roman nose, with a high bridge that seemed to emerge directly from between his brows. Sharp cheekbones. A dusting of black stubble at his jaw.\u003c/p\u003e\n\u003cp\u003eShe drank MacColla in and felt such a rush of wanting him, it was like a burst of light from within, scorching her, blinding her to all but the man before her. It raged beyond her control, this need, and she thought that it would consume her, that if it burned on untended, she might cease to exist.\u003c/p\u003e\n\u003cp\u003e“How is it I love you already, gradh geal mo chrìdhe?” His voice was barely a whisper.\u003c/p\u003e\n\u003cp\u003eHe cupped her face and slowly leaned in to her. His hands encompassed her so broad and sure on her skin. She felt his breath on her mouth. Felt the brush of his lips. Then the slow give of flesh on flesh, as he gently kissed her.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eFor three heartbeats, Haley was suspended. Everything stilled around her, captured frozen, a vignette in time. And she knew. This is what she came back in time for. For him.\u003c/p\u003e\n\u003cp\u003eThree heartbeats, and the embers he\u0027d lit within her burst into wildfire.\u003c/p\u003e\n\u003cp\u003eShe grabbed him then, clutched at his arms, opened her mouth to him, wrapped her hands around those thick muscles, and clung tight.\u003c/p\u003e\n\u003cp\u003ePressing close along his chest, she tasted his growl of desire in her throat, and she thought she\u0027d come apart. Haley clung tighter, her nails scoring into the linen -clothed skin. Wanting him, needing him, closer.\u003c/p\u003e\n\u003cp\u003eHis hands were at her back, on her waist, at her breast. She sensed the bust of her gown loosening. Felt the glide of fingers along the front of her corset, loose where her busk had been. The laces tickled her, and it was agony on her sensitive skin, now attuned to the slightest shifts of flesh and fabric, aching for his hands, his mouth. He alone could soothe her.\u003c/p\u003e\n\u003cp\u003eMacColla had never imagined something like this. Never imagined someone like her. So sweet in his mouth.\u003c/p\u003e\n\u003cp\u003eShe was so hard facing the world, yet so soft in his arms.\u003c/p\u003e\n\u003cp\u003eSo open to him.\u003c/p\u003e\n\u003cp\u003eHe wanted her. More than wanted her, he would have her.\u003c/p\u003e\n\u003cp\u003eConsume her. Make Haley his.\u003c/p\u003e\n\u003cp\u003eNot here. Not like this.\u003c/p\u003e\n\u003cp\u003eHe slowly pulled his mouth from hers, his heart hammering in his chest. MacColla licked his lips, wet from their kiss.\u003c/p\u003e\n\u003cp\u003eThey were too close to Campbell lands. He\u0027d have her, but he\u0027d have her away from this place.\u003c/p\u003e\n\u003cp\u003eHe tore his gaze from her, swept his eyes over the barren and rocky hillside. Over the Campbell corpse that lay not twenty paces away.\u003c/p\u003e\n\u003cp\u003eCampbell was out there somewhere.\u003c/p\u003e\n\u003cp\u003eHe\u0027d have her, but it would be unsullied by Campbell filth. He didn\u0027t have his true family lands, but he did have a hearth and safe haven on Kintyre.\u003c/p\u003e\n\u003cp\u003e“Not like this, a chiall mo chrìdhe?”\u003c/p\u003e\n\u003cp\u003eHis voice was husky, words of love new and ragged in his throat. Darling of my heart.\u003c/p\u003e\n\u003cp\u003eLove. He\u0027d told Haley he loved her.\u003c/p\u003e\n\u003cp\u003eMacColla pulled back. Put his hands gently on her shoulders. Looked at her. Her black hair flying every which way. Her full nose and lean strength and strange ly outspoken ways. And her eyes, ever those eyes, gray and black and beckoning him in to drown.\u003c/p\u003e\n\u003cp\u003e“Aye,” he whispered, affirming to himself what he suspected to be true. Love her. Such an outlandish thought.\u003c/p\u003e\n\u003cp\u003eHe\u0027d a war to wage. No home to speak of. Knew nothing of this lass. \u003c/p\u003e","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-25.html","bookId":1617,"creation":"Oct 5, 2019 6:07:03 PM","modification":"Oct 5, 2019 6:07:03 PM"}
