{"id":94219,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How would I know that?” Jean asked, her voice wavering.\u003c/p\u003e\n\u003cp\u003e“Oh, I don\u0027t know.” She shrugged. “You two seem to spend a lot of time together.”\u003c/p\u003e\n\u003cp\u003e“No more than is seemly.” Her cheeks flushed red.\u003c/p\u003e\n\u003cp\u003e“Oh no,” Haley said quickly, adopting her most cavalier manner. “Not too much at all. And besides, he\u0027s quite cute. Have you noticed his hands? They\u0027re very nice.”\u003c/p\u003e\n\u003cp\u003eShe watched as Jean\u0027s cheeks turned from red to deep crimson, then added. “He\u0027ll make some woman a wonderful husband. What do you think? Do you think he\u0027d be a good… provider? You two seem close.”\u003c/p\u003e\n\u003cp\u003e“Close, is it?” Jean\u0027s chin trembled with some hidden emotion. Just when Haley thought she\u0027d gone too far, Jean turned and pinned her with a pointed look. Wiping her hands on her apron, she announced. “All right then, we can talk of close. But keep that spoon in hand. You\u0027ll be needing to learn a good fish soup, if you\u0027re to feed my brother.”\u003c/p\u003e\n\u003cp\u003eThis time it was Haley who was taken off guard. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“What do I mean?” Smiling now, Jean put her hands on her hips.\u003c/p\u003e\n\u003cp\u003e“I know you\u0027ve been sneaking about. And there\u0027s no need to. Slink about like a fox in the henhouse, I mean.”\u003c/p\u003e\n\u003cp\u003e“Though” - she tapped her finger on her chin thoughtfully “I suppose it\u0027d be Alasdair the fox and you the hen, aye?”\u003c/p\u003e\n\u003cp\u003eHaley thought that she had indeed underestimated the girl.\u003c/p\u003e\n\u003cp\u003eVastly underestimated.\u003c/p\u003e\n\u003cp\u003e“God bless you… ” Jean laughed, a musical tinklin g that dissolved the defensive scowl from Haley\u0027s face. “But you\u0027ll find yourself knee -deep in kettles of fish soup, if I know my Alasdair.”\u003c/p\u003e\n\u003cp\u003eHaley began to laugh too, but her smile froze on her face. The thought of a lifetime of sharing fish soup with MacColla didn\u0027t terrify her as much as she\u0027d have expected. It sounded actually quite… nice.\u003c/p\u003e\n\u003cp\u003e“No need to gape at me like a boilt haddie.” Jean nodded to the pot of boiling haddock. “A blind man could see my brother has it for you, lass.”\u003c/p\u003e\n\u003cp\u003eA sharp wail cut through the room, shattering their cautious rapport. Jean didn\u0027t even spare a look for Haley before she dashed out of the room.\u003c/p\u003e\n\u003cp\u003eHaley lost a moment staring dumbly at the pot. She put her spoon down, wondering what to do. What her place was.\u003c/p\u003e\n\u003cp\u003eThe sound came again. A thin, keening note echoing through the chimney stones.\u003c/p\u003e\n\u003cp\u003eA single thought startled her back into the moment.\u003c/p\u003e\n\u003cp\u003eMacColla.\u003c/p\u003e\n\u003cp\u003eShe put her hand to her heart. It pounded hard through the layers of corset and dress.\u003c/p\u003e\n\u003cp\u003eHaley raced out the door and down the hall, barreling into the common room.\u003c/p\u003e\n\u003cp\u003eHer eyes skittered over the scene until she found MacColla. It was irrational-they were all together and seemed safe on Kintyre - but still, she felt a quick wash of relief to see him.\u003c/p\u003e\n\u003cp\u003eHis grave nod spoke both his grief and his need to have her near.\u003c/p\u003e\n\u003cp\u003eIt struck her that the room was full of people. Suddenly self-conscious, she stopped short, backed up a step into the doorjamb. Reaching her hands behind her, she clung tothe wood at her back, chagrined that she might have stumbled unwelcome into something that didn\u0027t concern her.\u003c/p\u003e\n\u003cp\u003eThere was Jean, Scrymgeour. Colkitto. MacColla. And all eyes were on his mother. She sat on a stool by the fire. Colkitto standing at her side. Mary slumped against the belly of her husband, her hands tangled white-knuckled in the folds of his plaid.\u003c/p\u003e\n\u003cp\u003eHers was the keening voice, repeating over and over the same word. It took Haley\u0027s ears a moment to make sense without any context. And then she realized. Mary MacDonald chanted, “Gillespie.”\u003c/p\u003e\n\u003cp\u003eHaley saw the woman\u0027s face and knew at once. Only the most dreadful and unthinkable of tragedies would crack a facade like hers.\u003c/p\u003e\n\u003cp\u003eSomebody died.\u003c/p\u003e\n\u003cp\u003e“Gillespie,” MacColla mouthed to her. “Mo brathair”\u003c/p\u003e\n\u003cp\u003eMy brother.\u003c/p\u003e\n\u003cp\u003eGillespie. This woman\u0027s son.\u003c/p\u003e\n\u003cp\u003eHow would her own mother react to losing a son? Or Haley, to losing a brother?\u003c/p\u003e\n\u003cp\u003eGood God. It was all tragedy. Seventeenth-century Scotland, all unthinkable, brutal tragedy that cared not for mother, or lover. So devastating. And so commonplace.\u003c/p\u003e\n\u003cp\u003eOh God, MacColla. Dread bloomed in her gut like a cancer, thinking of the day that could come. The day she might get news that would shatter her forever.\u003c/p\u003e\n\u003cp\u003e“Gillespie.” It was Colkitto giving voice to the words nobody wanted to speak. His fury was calm, as barren, as complete as the fine sparkling of rime on pine needles. “The Campbell has killed Gillespie. And now he comes for us. For MacColla. For you, lass.” he nodded to Haley.\u003c/p\u003e\n\u003cp\u003eA chill shivered through her. “How does he know about me?”\u003c/p\u003e\n\u003cp\u003e“He calls you the bride of MacColla.” A voice came from the far corner, crisp and deep.\u003c/p\u003e\n\u003cp\u003eHaley\u0027s eyes adjusted to the shadows that clung to the edges of the room. A man stood there, neat and tall, with shining dark brown hair, and sharp cheekbones and jaw to match the razor edge of his gaze. “Campbell warns he will destroy MacColla\u0027s family. Will ruin MacColla, and you, most of all.”\u003c/p\u003e\n\u003cp\u003eHaley decided if a knife edge had a human voice, it would sound like this man.\u003c/p\u003e\n\u003cp\u003e“I… ” She stumbled for words, uncertain of what to make of such a threat from a stranger.\u003c/p\u003e\n\u003cp\u003e“Leannan.” MacColla\u0027s voice was quiet, but steady, and her eyes found his. The grief she saw there broke her heart.\u003c/p\u003e\n\u003cp\u003eThe mysterious man stepped from the shadows, and Haley realized he held a cane. Lifting one leg after the other, he moved with slow deliberation.\u003c/p\u003e\n\u003cp\u003e“This is Will Rollo.” MacColla\u0027s face softened for an instant as he told her, “He is a friend to James Graham.”\u003c/p\u003e\n\u003cp\u003eIs. Not was. She knew it. James Graham was alive.\u003c/p\u003e\n\u003cp\u003eIt was a thrill to know she\u0027d been right. Graham hadn\u0027t died. But it was a hollow victory.\u003c/p\u003e\n\u003cp\u003eShe found all she cared for at that moment was MacColla.\u003c/p\u003e\n\u003cp\u003eAt the mention of James, Rollo swung his head sharply to MacColla, his eyes narrowed. But MacColla simply ignored him, Haley his single focus.\u003c/p\u003e\n\u003cp\u003e“Rollo.” She murmured the strange name, trying to place it, trying to remember who he might have been.\u003c/p\u003e\n\u003cp\u003e“Aye, he bears news of my brother. Gillespie was killed in a siege of Skipness Castle. To the north. He\u0027s in Kintyre, lass. Campbell is in Kintyre. He slaughters his way right to us, an army at his back.”\u003c/p\u003e\n\u003cp\u003e“We must fight,” Colkitto growled.\u003c/p\u003e\n\u003cp\u003e“We must go.” MacColla\u0027s mother finally spoke, her voice cracking as she visibly gathered her anguish, reeling it back once more, to bury it deep inside. “We have Jean to think of. We\u0027re… ”\u003c/p\u003e\n\u003cp\u003eShe hesitated, and MacColla continued for her, “We\u0027re trapped at the edge of Kintyre with naught but the sea at our backs. The Earl of Antrim has men by the thousands, waiting for us in Ireland. It\u0027s to Ireland we must go now.”\u003c/p\u003e\n\u003cp\u003eThere was a sharp cry. When all eyes turned to her, Haley realized the sound had torn from her own throat.\u003c/p\u003e\n\u003cp\u003eMacColla shook his head a fraction. “Would that there were a choice, leannan. But there\u0027s no other course. I need more men. And there are Irish confederates by the score who wait for us, eager for a taste of Campbell blood.”\u003c/p\u003e\n\u003cp\u003e“Och.” Colkitto pulled his wife tighter to him. “Your mother and I stay here. On Scottish soil. I\u0027ll not turn tail to Ireland. I\u0027ve been driven out of my country for the last time.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s not-” MacColla began in a snarl.\u003c/p\u003e\n\u003cp\u003e“Och, son, I ken well. An army waits for you there. But heed me, boy. I\u0027m an old man and if I\u0027m to die, it\u0027s Scottish soil will drink my blood.”\u003c/p\u003e\n\u003cp\u003e“You cannot stay here.” Rollo\u0027s voice cut through the room like a shard of glass, clear and deathly sharp. “You must leave Kintyre.”\u003c/p\u003e\n\u003cp\u003e“To Islay, then,” MacColla said to his father. “We rally a dozen men and you\u0027ll set sail for Islay.”\u003c/p\u003e\n\u003cp\u003e“Ranald,” his mother gasped.\u003c/p\u003e\n\u003cp\u003e“Aye, my brother is there,” MacColla said. “There\u0027s a rebel stronghold at Dunyveg. Father, I need you to help hold the castle there. I\u0027ll return, with thousands at my back.”\u003c/p\u003e\n\u003cp\u003eMary delicately blotted her eyes with her fingertips. “Can I”\u003c/p\u003e\n\u003cp\u003e“No, mother. \u0027Tis not safe for you there.”\u003c/p\u003e\n\u003cp\u003eEven as Colkitto flexed to pull his wife closer, Haley saw her sit just a little straighter. And it was a revelation. Mary would be accustomed to such a parting. What life is, for these women… she thought with a chill. Always saying good bye to their men and their boys, often for the last time.\u003c/p\u003e\n\u003cp\u003eScrymgeour spoke then, his voice warm and sure. “Mary will come with me. You both will,” he said, addressing Jean. “Campbell will have left Fincharn; his attentions long directed elsewhere. He\u0027d not suspect we\u0027d return. We head for Loch Awe at once. Back to my home.” He turned to MacColla and promised somberly, “The women will be safe there.”\u003c/p\u003e\n\u003cp\u003eScrymgeour looked to Haley, adding, “You shall come too, of course. We will all ”-\u003c/p\u003e\n\u003cp\u003e“She\u0027ll do no such thing.” MacColla\u0027s words resonated low and fierce, pebbling her arms into goose bumps. “Haley stays with me.” His glare silenced any who would contradict him.\u003c/p\u003e\n\u003cp\u003eHe intended to protect her. But Haley knew.\u003c/p\u003e\n\u003cp\u003eShe looked around the room, taking in this portrait of profound grief.\u003c/p\u003e\n\u003cp\u003eThe MacDonald men have begun to die.\u003c/p\u003e\n\u003cp\u003eShe looked around, and she knew. It was MacColla who needed the protection now.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Five\u003c/p\u003e\n\u003cp\u003eHaley sat on the sand, not far from where she and MacColla had been together. And rather than feeling warmed by the memory, it came to her on a knife\u0027s edge. Sharp and with a pang she felt as surely as steel on skin.\u003c/p\u003e\n\u003cp\u003eShe had been excited, imagining what it\u0027d be like to be intimate with him. But the reality had been so much bigger, so much more than any fantasy.\u003c/p\u003e\n\u003cp\u003eIt had been both tenderness and ravaging lust. Losing herself in him was all the reassurance of coming home, with the exhilaration of setting on some new, uncharted course.\u003c/p\u003e\n\u003cp\u003eBut how many more nights would they get?\u003c/p\u003e\n\u003cp\u003eShe tried to savor those memories, but her eyes were continually drawn to Ireland, a long, thin band of shadow looming on the horizon like the black cloud of a coming storm. \u003c/p\u003e","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-34.html","bookId":1617,"creation":"Oct 5, 2019 6:07:03 PM","modification":"Oct 5, 2019 6:07:03 PM"}
