{"id":94224,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Och,” he growled, and his tender touch grew rougher. Fingers that had been light on her throat tangled now in her hair, sweeping it up, revealing her neck for his mouth and tongue.\u003c/p\u003e\n\u003cp\u003eHaley felt him grow rock hard at her back. Felt his hunger in the way he pulled her tight to him, squeezing and rubbing.\u003c/p\u003e\n\u003cp\u003eHer nipples pulled tight. The corset chafed just over them, and she moaned, desperate to be free of it. “Take it… take it off.”\u003c/p\u003e\n\u003cp\u003eHe spun her then, turning her in his arms to face him. To claim her mouth with his in a savage kiss. He filled her senses. He tasted of ale, smelled of sweat and wool. His breath filled her lungs, and she breathed him in, desperate to have him near. To make him a part of her, keeping him by her forever.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know how their clothes came off, only that they did in a frantic untangling of laces and belts, fabric and leather.\u003c/p\u003e\n\u003cp\u003eHe was on top of her in an instant, on her bed, laying hungry kisses over her breasts and belly and face. He kissed her mouth once more, so deeply. She was so wet and so ready, aching with need for him. He shifted, entered her, and the world fell away.\u003c/p\u003e\n\u003cp\u003eEverything she had clung to him. Haley beckoned his tongue full into her mouth, fingers and nails clawing him even closer. Her legs wrapped tight around his back, the muscles in her core spasming tight around him, pulling him deep, and deeper still. Desperate to be his final shelter.\u003c/p\u003e\n\u003cp\u003eThey came hard, amid cries and thrusts and sweat, and a great sob finally broke from Haley.\u003c/p\u003e\n\u003cp\u003eShe knew what time would bring. MacColla would pull his body from hers. And the hour would come when he\u0027d rise from her bed. And then the day when he\u0027d step onto his last battlefield.\u003c/p\u003e\n\u003cp\u003eMacColla had spent a night in heaven. Then they woke the next morning into a nightmare.\u003c/p\u003e\n\u003cp\u003eHaley had been given her own room at Assolas House, and even though he knew he needed rest, he lay tangled with her in her sheets, drifting in and out of sleep, waking to check that she was still there. To see her face once more.\u003c/p\u003e\n\u003cp\u003eShe was desperate to leave Ireland. And though he must believe he\u0027d be triumphant, her words gave him pause. What would the coming days bring?\u003c/p\u003e\n\u003cp\u003eIt would be so easy, so glorious, to forsake all of it to be with her. To live only for Haley. Finding a home and hearth on some tiny western isle, where they could spend the rest of their days devoted only to each other.\u003c/p\u003e\n\u003cp\u003eHe craned his head down to study her, sprawled asleep over him. Memorizing the long black lashes on her creamy skin, and the roses on those cheeks, so flushed and bonny.\u003c/p\u003e\n\u003cp\u003eHer hair, wavy and black, falling every which way over his chest. The lean, strong arms that, even in sleep, clung so tight to him.\u003c/p\u003e\n\u003cp\u003eAnd then the shouts came. From far away at first.\u003c/p\u003e\n\u003cp\u003ePounding on doors. Shuffling feet.\u003c/p\u003e\n\u003cp\u003eHe felt her stir.\u003c/p\u003e\n\u003cp\u003eThe time was coming, and a sorrow as deep as mourning speared him, unexpectedly.\u003c/p\u003e\n\u003cp\u003eThe noises grew closer, louder. She awoke. Their eyes locked.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t go,” she whispered. Her ringers curled into him. He felt a single tear spill hot on his chest. “Don\u0027t go. You don\u0027t have to go.”\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t bear her protests, and so he kissed them from her mouth. She was so soft, tasting of sleep and sex. To stay would be so easy. But in this he had no choice.\u003c/p\u003e\n\u003cp\u003e“I love you, leannan. With my heart and soul, I love you. But you know I must do this.”\u003c/p\u003e\n\u003cp\u003eTheir door was next. The pounding fists. “Aye,” MacColla shouted. Not taking his eyes from her, he said merely, “I come.”\u003c/p\u003e\n\u003cp\u003eThey sat at the dining table hearing news that was far worse than they\u0027d anticipated.\u003c/p\u003e\n\u003cp\u003eMacColla listened, and Haley watched as the passion bled from his face. A living man turned to granite.\u003c/p\u003e\n\u003cp\u003e“Dunyveg,” Rollo said. “Campbell\u0027s men captured the castle at Dunyveg.”\u003c/p\u003e\n\u003cp\u003e“My brother?”\u003c/p\u003e\n\u003cp\u003e“Ranald was executed the moment they took the castle.” Rollo shifted slightly in his seat, the only sound in the utter silence of the cavernous room. “I\u0027m sorry, MacColla.” His words fell hollow on the stones.\u003c/p\u003e\n\u003cp\u003eHaley watched MacColla, saw clearly how he feared asking the question on everyone\u0027s minds. And so she asked it for him. “What of Colkitto?”\u003c/p\u003e\n\u003cp\u003eMacColla gave her a grateful look, and held her eyes as he weathered the news.\u003c/p\u003e\n\u003cp\u003e“Aye.” Rollo rasped. “Colkitto too.”\u003c/p\u003e\n\u003cp\u003e“How?” he asked, turning to his friend.\u003c/p\u003e\n\u003cp\u003e“He left the castle without asking for a promise of his safety.”\u003c/p\u003e\n\u003cp\u003e“To negotiate surrender?” MacColla asked, bewildered.\u003c/p\u003e\n\u003cp\u003e“No.” Rollo gave a mirthless laugh. “He exited castle walls asking for more whisky.”\u003c/p\u003e\n\u003cp\u003e“Truly?”\u003c/p\u003e\n\u003cp\u003e“Aye.” Rollo replied. “He must have thought himself protected. Coll was an old man, MacColla. The unspoken rules of Highland warfare don\u0027t stand with the Covenanters. These men fight without a code, without a thought to the old ways.”\u003c/p\u003e\n\u003cp\u003e“It is hard to believe the great Coll Ciotach is dead.” Taaffe finally said. “Such a capture was not done without tarnish to Covenanter honor.”\u003c/p\u003e\n\u003cp\u003eAnd though MacColla\u0027s gaze was hard on him, Haley thought she heard true sadness in the man\u0027s voice, imagining that an old-fashioned sort like Lord Taaffe would be particularly distressed by such a flouting of principles.\u003c/p\u003e\n\u003cp\u003e“Whisky.” MacColla muttered, shaking his head. “The old fool thirsted for more whisky.”\u003c/p\u003e\n\u003cp\u003eHis father was dead. Two of his brothers. And still Campbell eluded him. Still the Covenanters marched through MacDonald lands in Scotland. Parliament sympathizers razed through Ireland. M arched for them even now.\u003c/p\u003e\n\u003cp\u003eTaaffe cleared his throat. “There is more news. If you gentlemen would hear it.” The man looked at Haley, as if expecting her to leave the room.\u003c/p\u003e\n\u003cp\u003eIf this lord thought MacColla\u0027s woman quailed at talk of battle, the man didn\u0027t know his Haley. MacColla reached over, put his hand over hers on the table. “Speak,” he said.\u003c/p\u003e\n\u003cp\u003eAnd even before Taaffe got out the words. MacColla knew what he would say. He knew the Parliamentary army drew close. He knew it was time.\u003c/p\u003e\n\u003cp\u003eMacColla felt the coming of battle in the air, like lightning, on his skin, in his gut. And he welcomed it.\u003c/p\u003e\n\u003cp\u003eHe\u0027d charge into it headlong. Haley\u0027s concerns were but a distant hum in the back of his brain. He\u0027d no thought for history books now.\u003c/p\u003e\n\u003cp\u003eHe knew Taaffe would be eager to di sprove the rumors that abounded. Rumors that Taaffe was inexperienced. That he\u0027d parleyed with the enemy. That the old lord would not be able, or willing, to fight.\u003c/p\u003e\n\u003cp\u003eMacColla knew these things, and he didn\u0027t care. Every man went alone into battle. Every man driven by his own demons.\u003c/p\u003e\n\u003cp\u003eMacColla had left his father and brother waiting at\u003c/p\u003e\n\u003cp\u003eDunyveg Castle. Waiting for soldiers who never arrived.\u003c/p\u003e\n\u003cp\u003eHe\u0027d redeem himself. Prove his worth. Win this war.\u003c/p\u003e\n\u003cp\u003eMacColla would avenge his family.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Eight\u003c/p\u003e\n\u003cp\u003e“I\u0027d ask if you\u0027re able to use this, but I imagine you ken better than most of my men.” MacColla handed Haley a beaten-up old musket. She didn\u0027t need to look at the mechanism to know it was one of the old matchlocks. She could tell from the sheer size of the thi ng that it was a relic.\u003c/p\u003e\n\u003cp\u003eShe\u0027d put it at five feet long and a good fifteen pounds, likely dating from the late 1500s. Resting it butt-first on the floor. Haley squatted to take a better look. “What am I supposed to do with this?”\u003c/p\u003e\n\u003cp\u003e“Och, you\u0027ll not need it. But I\u0027ll feel better knowing you have it.” He was quiet for a moment, then asked, “Truly, leannan, do you know how to fire it?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” She palmed a small leather pouch filled with shot. It was a reassuring heft in her hand, clicking like a bag of heavy marbles.\u003c/p\u003e\n\u003cp\u003eThe match, though, scared her. It was a thin piece of rope that she was to keep constantly lit, sliding it into the jaw of the matchlock when the time came to shoot.\u003c/p\u003e\n\u003cp\u003ePull the trigger and it would snap down, the match igniting the powder and firing the bullet.\u003c/p\u003e\n\u003cp\u003eAnd she needed to do all of that without catching herself or the powder on fire. “I can manage it,” she said grudgingly.\u003c/p\u003e\n\u003cp\u003eMacColla sighed heavily. “I would that I could give you a gun suitable for a lady, with an ivory handle and in a bonny little case. But munitions are scarce. It\u0027s only because the men refuse to carry a matchlock that I can give this to you.”\u003c/p\u003e\n\u003cp\u003eHe picked it up, and the gun barrel slid through her hands. Tilting the musket, he sighted down the length of it. “They worry about catching themselves on fire.”\u003c/p\u003e\n\u003cp\u003e“Oh great,” she muttered.\u003c/p\u003e\n\u003cp\u003eHe gave a humorless laugh. “When I return, I\u0027ll buy you the prettiest wee pistol in all Ireland.”\u003c/p\u003e\n\u003cp\u003e“When you return, I\u0027m going to clout you on the head and take you back to Scotland.”\u003c/p\u003e\n\u003cp\u003e“Och, leannan.” Exhaling, MacColla set the musket down. He reached to give her a hand up. “You know I must do this.”\u003c/p\u003e\n\u003cp\u003e“Let me come with you.”\u003c/p\u003e\n\u003cp\u003eHis eyes were flat when he responded, “I\u0027ve told you. No, and no again. You\u0027ll stay here. Where it\u0027s safe.”\u003c/p\u003e\n\u003cp\u003e“But… this doesn\u0027t feel right. Battle elsewhere. If you insist on staying in Ireland, at least take the battle from Knocknanuss Hill.” She couldn\u0027t recall exactly what had happened there, but every mention of the place gave her the chills.\u003c/p\u003e\n\u003cp\u003e“Nay,” he whispered, tilting he r face up to him. “Our enemy is on the move. Inchiquin\u0027s men march for us. Whatever I feel about this Lord Taaffe, he\u0027s chosen a decent spot from which to attack.”\u003c/p\u003e\n\u003cp\u003eHe cupped her chin in his hands. “This is farewell, leannan. Do you not have a kiss for me?”\u003c/p\u003e\n\u003cp\u003eNo. It was too soon. She couldn\u0027t say good-bye. To kiss him was to part from him. Would one kiss mean good-bye forever?\u003c/p\u003e\n\u003cp\u003eThough he leaned close, the gentle touch of his hands on her face was their only contact. As if their parting had already begun.\u003c/p\u003e\n\u003cp\u003eHe brought his mouth to hers and Haley felt tears spill down her cheeks. MacColla kissed her slowly. Deeply and carefully.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t clutch her body to him, and even though she wanted to cling to MacColla and grab him close, Haley was grateful for the space between them. To close that gap now would snap the last fragile thread that held her together. \u003c/p\u003e","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-39.html","bookId":1617,"creation":"Oct 5, 2019 6:07:03 PM","modification":"Oct 5, 2019 6:07:03 PM"}
