{"id":48283,"no":1,"title":"Volume 1: Chapter 1 The First Chapter","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eVolume 1: Chapter 1 – The First Chapter\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEarly morning. It’s so bright that I had to open my lazy eyelids. Why does my house have to face the sun. Waking up everyday to the sun’s glare makes me want to cry.\u003c/p\u003e\n\u003cp\u003e“You lazy bum! Are you up yet?”\u003c/p\u003e\n\u003cp\u003eHearing this pleasant voice, I immediately jumped down from bed.\u003c/p\u003e\n\u003cp\u003e“I’m up, I’m up.”\u003c/p\u003e\n\u003cp\u003e“Hurry up and come eat breakfast! You’re going to be late for school.”\u003c/p\u003e\n\u003cp\u003e“Okay, okay. I’m coming.”\u003c/p\u003e\n\u003cp\u003eFortunately I reacted quickly, otherwise mother’s pleasant voice would have started casting the elementary water magic, water bullet, to wake me up. But mother is an intermediate water mage, so if I got hit I would truly be miserable. (However this is not the primary reason, because if mother shoots the water bullet at me, the blanket will get wet. When I go outside to dry my blankets, all of my friends ridicule me as “Bedwetting” Wu.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRight, I forgot to explain my background. Of course, I’m the hero of this story. My name is Zhang Gong. The continent I live in is called Tianwu and in the West is the continent of Libo. In the whole world there are only these two continents and of course, the rest of the world is the covered by the ocean. In Tianwu there are three countries: the kingdom of plentiful resources, the Dalu kingdom, the kingdom of knights, the Xiuda Kingdom and the kingdom where I reside, the magic kingdom of Aixia.\u003c/p\u003e\n\u003cp\u003eThe kingdom of Dalu has the largest territory, with it spanning three-sevenths of continent of Tianwu’s land. Furthermore it is a rich in resources, wealthy and is overall a powerful kingdom. The main army is composed of warriors, while mages supplement the main army thanks to the funding the army receives. With an army such as this, the kingdom of Dalu has the largest army of the three kingdoms.\u003c/p\u003e\n\u003cp\u003eThe kingdom of Xiuda is a country which upholds the honor of knights therefore the country does not have many mages residing in it. Their army is composed entirely of warriors, with their cavalry being the most powerful in the whole Tianwu continent. Furthermore, they possess three regiments of the unique Earth Dragoons which is composed entirely of knights at the intermediate rank\u0026nbsp;or higher. On the plains it is impossible for any opposing army to withstand the assault of Xiuda’s cavalry without a barrier.\u003c/p\u003e\n\u003cp\u003eSpeaking of my homeland, the kingdom of Aixia is in fact an authentic magic kingdom. Every single citizen, no matter how poor they are will receive an elementary education in magic. The kingdom possesses dozens of major magic schools as every citizen has the right to learn magic. (Of course, the prerequisite is that you have the money to pay the tuition.) \u0026nbsp;Even if the citizen doesn’t have money there is still the town’s Elder who will teach some basic knowledge of magic.\u003c/p\u003e\n\u003cp\u003eIn this country, magic education is divided into three stages:\u003c/p\u003e\n\u003cp\u003eThe first stage: Elementary magic academy. Generally students enroll between the ages of 5 to 10 years old and will continue studying there for 5 years. Upon graduation the students will take an exam to become a magic disciple or receive the title of an elementary rank mage.\u003c/p\u003e\n\u003cp\u003eThe second stage: Intermediate magic academy. Admission is based on what the students scored on the elementary magic academy graduation exam and naturally students with better results will be able to enter better magic academies. Intermediate magic academy doesn’t have a set number school years, instead it works on the basis of credits. Only 60 credits are required before students can graduate and obtain the title of an intermediate rank\u0026nbsp;mage. In the duchy, the fastest record for graduating intermediate magic academy was still three years while it generally takes 5 to 10 years to graduate for the average student. Most of the kingdoms wealthy citizens stop learning magic sometime during intermediate magic academy. The number of intermediate rank\u0026nbsp;mages in the kingdom is somewhere from 300,000 to 450,000.\u003c/p\u003e\n\u003cp\u003eThe third stage: Advanced magic academy. In order to be admitted into an advanced magic academy, not only is an intermediate rank mage certificate required, but it is also required to pass the examination of the Mage’s Union. After passing the exam, students once again be admitted to the academy corresponding to their exam results. According the Aixia’s regulations, all students who attend an advanced magic academy will not have to pay any tuition fees. The reason that all costs will be covered by the kingdom is for the kingdom’s magic talent to flourish. The most prestigious magic academy is the Royal Magic Academy where only those with great magical talent are admitted. Furthermore, they have extremely rigorous examinations even for a prince. Princesses also must pass examinations before they will be admitted. After graduating from an advanced magic academy, the results of the graduation exam with determine which certificate the student receives.\u003c/p\u003e\n\u003cp\u003eTianwu continent’s three human kingdoms are extremely united because they have a common enemy, the Western continent’s demon race and beast clans.\u003c/p\u003e\n\u003cp\u003eIn the Western continent, there are two kingdoms. The Holy Light Empire is ruled by the demon race while the beast clans rule the Valiant Mist Empire. The demon race looks very similar to humans with the only difference being that their eyes are purple. Those of the demon race are naturally ambitious and aggressive while they inherently possess darkness magic. On the other hand, the beast clans are unable to use magic but their powerful bodies are their best weapon in addition to their high magic defense. The beast clan’s ace corps in comparison to their main army is even more frightening.\u003c/p\u003e\n\u003cp\u003eThe Eastern and Western continents are separated by the Tianduo mountains. Humanity sacrificed millions of warriors in order to build the most powerful mountain fortress, Telun fortress. Since the magic fortress have been built the two beast clans could not climb past the pond called Lei, enabling the continent to enjoy peace for the last 200 years.\u003c/p\u003e\n\u003cp\u003eIn this world, there are six elements\u0026nbsp;of magic: light, darkness, water, fire, earth and wind. Besides these six elements\u0026nbsp;of magic, there are also special\u0026nbsp;elements of magic such as summoning magic, spatial magic and so on.\u003c/p\u003e\n\u003cp\u003eMages ranks are divided into: novice mage (apprentice mage), elementary rank mage, intermediate mage, advanced mage, great mage, magic scholar, magister and the legendary Grand Magister.\u003c/p\u003e\n\u003cp\u003eMagic spells are divided 9 ranks: ranks 1 to 3 are of the elementary class, ranks 4 and 5 are of the intermediate class, ranks 6 to 8 are of the advanced class and rank 9 spells are of the forbidden class. Forbidden class spells require six or more magisters working together in order to cast. A mage who is able to cast a forbidden class spell singlehandedly would be considered a Grand Magister and only one has ever appeared in the legends.\u003c/p\u003e\n\u003cp\u003eWarrior ranks are divided into: elementary warrior, intermediate warrior, advanced warrior, knights, earth knight, heaven knight, holy knight, sword saint and the legendary War God.\u003c/p\u003e\n\u003cp\u003eBattle spirit classes are divided into: battle spirit, earth battle spirit, heaven battle spirit, god battle spirit and holy battle spirit which enables whoever possesses it to be unscratched by all spells below the forbidden class.\u003c/p\u003e\n\u003cp\u003eSummoned beasts have two types:the power growth type, which grow more powerful as they mature, and the body rank type where they will remain as powerful as they were when summoned. The higher the rank their body is, the more powerful the beast is. From ranks 1 to 9, power growth type are very rare. Furthermore, if the power growth type summoned beast encounters a body rank type summoned beast, they attempt to kill each other in order to prevent their opponent from growing any stronger.\u003c/p\u003e\n\u003cp\u003eMoney is divided into: 1 diamond coin \u003d 100 gold coins \u003d 10 000 silver coins \u003d\u0026nbsp;1 000 000 copper coins\u003c/p\u003e\n\u003cp\u003eMagic crystals from highest value to lowest is:purple, jade, red, blue, white, black, green.\u003c/p\u003e\n\u003cp\u003eThe background information is here, following this will be the main story.\u003c/p\u003e\n\u003cp\u003eA new chapter is about to begin. The wheel of history is moving toward his destiny.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-1-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-1-chapter-1","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
