{"id":48384,"no":102,"title":"Volume 4: Chapter 11 A Proper Challenge","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 4: Chapter 11 – A Proper Challenge\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIf Mu Zi hadn’t been so powerful, the students probably would have teased her.\u003c/p\u003e\n\u003cp\u003eI ran downstairs as quickly as I could to retrieve the second love letter. Before I sat back in my seat, I glared furiously at Mu Zi. After that, I stashed the second love letter, just as I had with the first one.\u003c/p\u003e\n\u003cp\u003eI seethingly ignored her.\u003ci\u003e ‘She really didn’t know how to cherish my hard work. Did she know that I was just playing with her? It couldn’t be. I’ll continue to think about that the next day. Today, I really wanted to play with one of the top rankers. I wondered who I should pick?’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e‘\u003ci\u003eIf my first challenge was with the top ranking earth magician, it would seem like I am a show-off; that would be a terrible decision. The second ranker is big brother Hai Ri, but I don’t feel like fighting him. The third ranker is Mu Zi. If I challenge her, would there still be any chance of chasing her after? No. For my grand plan, I can’t challenge her. The fourth ranker is the Ri family’s scion. That’s right! It shall be him. I can also help Ma Ke have his revenge. Haha, if Hai Yue sees me defeating her boyfriend, I wonder what would happen. I might even create a chance for Ma Ke. Great! That will be my choice!’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThinking about that, I couldn’t stop myself from giggling. Mu Zi looked at me from the side and thought aloud, “What is he plotting now…”\u003c/p\u003e\n\u003cp\u003eMy hearing was very sensitive. I looked at her and whispered, “You will find that out after school.”\u003c/p\u003e\n\u003cp\u003eA day of lessons quickly ended. Once the school bell rang to signal the end of school, I dashed out of the classroom and immediately ran to the main school building. I took a deep breath and shouted, “Feng Liang Ri! I am Zhang Gong Wei. I am here to challenge you to a duel. If you hear this, please come to the school’s field. I will be waiting for you there!”\u003c/p\u003e\n\u003cp\u003eA clear and bright voice sounded from the building. “Alright! I accept!”\u003c/p\u003e\n\u003cp\u003eSuccess! Ha ha, I quickly ran to the field and waited at the center of the field for my opponent to come.\u003c/p\u003e\n\u003cp\u003eI checked my body’s status.\u003ci\u003e ‘My magic power and mental energy were in top conditions. I was extremely confident as I definitely didn’t believe that Feng Liang Ri could stand against my Magister level power.’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e‘It looked like my previous shouting had had an effect; in a short period of time, I was surrounded by students.’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e“Who is that? I’ve never seen him before and he actually dares to challenge Feng Liang!”\u003c/p\u003e\n\u003cp\u003e“It’s been a long time since someone last challenged the top ten rankers. This match will be exciting to watch.”\u003c/p\u003e\n\u003cp\u003e“Will he even be able to win? He looks quite handsome, but I’m not sure about his magic power.”\u003c/p\u003e\n\u003cp\u003eThe surrounding students discussed amongst themselves.\u003c/p\u003e\n\u003cp\u003eMa Ke pushed his way through the crowd and ran to my side. He whispered. “Boss, why are you challenging Feng Liang RI?”\u003c/p\u003e\n\u003cp\u003eI was stunned and said, “Why can’t I challenge him? I am challenging him for you. I want to help you get your revenge. Is that bad?”\u003c/p\u003e\n\u003cp\u003eMa Ke hurriedly circled around me. “Boss, you’ve caused me severe trouble this time. Hai Yue will definitely think that I asked you to challenge Feng Liang. She’ll hate me even more now!”\u003c/p\u003e\n\u003cp\u003eI laughed while bending my body forward. “What do you think I should do now? Do you really think I’ll withdraw from the match now? You also see the crowd that’s formed. If I withdraw from the challenge, I won’t be able to continue attending this academy. It’s already happened. You have to look at the situation calmly. Hai Yue doesn’t like you. If she hates you more, it’ll be better, because it can help deepen her impression of you.”\u003c/p\u003e\n\u003cp\u003e“Boss, what are you talking about…?”\u003c/p\u003e\n\u003cp\u003eAt that moment, Feng Liang Ri arrived. His girlfriend, Hai Yue, was by his side.\u003c/p\u003e\n\u003cp\u003eHai Yue ran over in anger and shouted at me, “Are you insane? Why are you challenging Feng Liang? He has never offended you. If you really have the ability, why don’t you just challenge the top ranker Si Wa Ming!”\u003c/p\u003e\n\u003cp\u003eI gave her a helpless expression and smiled. “Why? Are you afraid that your lover will lose to me? You don’t trust him?”\u003c/p\u003e\n\u003cp\u003eJust when Hai Yue was about to retort, Ma Ke quickly explained. “Hai Yue, Zhang Gong doesn’t have any bad intentions. He just wants to get a rank.”\u003c/p\u003e\n\u003cp\u003eHai Yue was still furious so she turned to face Ma Ke. “It’s you! You must’ve been the one who encouraged him! You are so despicable. Just give up! I, Hai Yue, will definitely not fall for a despicable person like you! \u003ci\u003eHmph\u003c/i\u003e!”\u003c/p\u003e\n\u003cp\u003eMa Ke’s face immediately paled. I patted his shoulder. “Stop causing more trouble and go stand at the side.” Hai Yue’s disrespectful attitude towards Ma Ke was making me furious.\u003c/p\u003e\n\u003cp\u003eHai Shui also ran over and pulled Hai Yue away. “Sister, we should just let them battle. It’s impossible to stop the match from happening.” After saying that, she stared at me for a while.\u003c/p\u003e\n\u003cp\u003eFeng Liang’s clear and bright voice voiced out, “I’ve heard from Hai Yue that your magic spells are very strong. Do enlighten me! Everyone, please back up! Hai Yue, it’s alright. Please step out of the ring.”\u003c/p\u003e\n\u003cp\u003eFeng Liang Ri and I finally stood face to face at the center of the field. I shouted, “All students, please back up and allow us to have a 500m circumference of space to prevent any accidental injuries that may happen during the duel.” A colourful rainbow-coloured magic spell suddenly covered 500m of the field with Feng Liang and I at its center.\u003c/p\u003e\n\u003cp\u003eI would definitely show my prowess to Feng Liang so he would know that we brothers were not that easy to bully.\u003c/p\u003e\n\u003cp\u003eI made a hand signal as a sign for him to have the first move. “Let’s begin and let me experience your Ri family’s exceptional magic spells!”\u003c/p\u003e\n\u003cp\u003eFeng Liang smiled. “I won’t be modest and will begin the battle. \u003ci\u003eFree wind, listen to my command, form a violent Wind Tornado!\u003c/i\u003e” A small Wind Tornado gathered in front of him. ‘\u003ci\u003eWhat was he up to? Why was he not directly attacking me? I didn’t need to chant my spells anyway so I wasn’t impatient. I decided to continue to see what would happen.’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e“\u003ci\u003eFree wind, listen to my command, form a violent Wind Tornado!”\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e“\u003ci\u003eFree wind, listen to my command, form a violent Wind Tornado!”\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e‘So that’s what he was doing! In a short period of time, Feng Liang had actually cast nine small Wind Tornados.’\u003c/i\u003e I told him, “The Wind Tornado will always be powerless against me; no matter how many times you cast it. Please stop wasting your magic power!”\u003c/p\u003e\n\u003cp\u003eFeng Liang grinned at me. “Really?\u003ci\u003e Violent Wind Tornado! Release your power to destroy and tear apart everything in front of you!\u003c/i\u003e”\u003c/p\u003e\n\u003cp\u003eFollowing his chant, the intermediate class Wind Tornados actually moved and collided with each other. They swirled up sand and stones. Finally, all nine Wind Tornados fused into one Wind Tornado. The surrounding air seemed to become a vacuum. When the Wind Tornado reached a critical point, it exploded!\u003c/p\u003e\n\u003cp\u003e‘\u003ci\u003eThis is bad! It was a wind fusion magic spell. It was very powerful and it could unexpectedly reach the level of an advanced level spell. It looked like Feng Liang wasn’t that simple after all!’\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eI hurriedly cast three light shields to gain some time.\u003c/p\u003e\n\u003cp\u003e“\u003ci\u003eGreat Light elements! Please lend me your great powers! Let the unlimited light shine on the whole land. Illuminate – Brilliant Empire!\u003c/i\u003e” I chose to fight back relentlessly.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-4-chapter-11","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
