{"id":48405,"no":123,"title":"Volume 4: Chapter 32 - Battle Cry of the Dragon and Phoenix","content":"\u003cp\u003e\u003cstrong\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003eVolume 4: Chapter 32 - Battle Cry of the Dragon and Phoenix\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Fire Phoenix \u0026nbsp;charged in front of Xiao Jin, but Xiao Jin didn’t fight back and just dodged its attacks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was also in a tough battle as Si Feng Ri had covered the entire area with multiple fire spells. I was pitifully holding on. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though Xiao Jin’s body was enormous, he was really agile. His agility was greater than the much larger Fire Phoenix, so he would only counter multi-directional flame attacks. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI got anxious. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhy isn’t Xiao Jin fighting back?’\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e With great difficulty I mentally asked Xiao Jin, who was in the air. He replied that he was unable to attack the Fire Phoenix \u0026nbsp;as he felt that he was related to the Fire Phoenix. Damn! I used all my might to cast Bright Star’s Shine consecutively to stop Si Feng Ri from advancing. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Feng Ri was also in a bad condition as summoning the phoenix had overexerted his magic powers. When he saw that the Fire Phoenix \u0026nbsp;was unable to defeat Xiao Jin after such a long time had passed and I was still tenaciously fighting back, he stopped his attacks. He heavily inhaled to recover his breath.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI also used that opportunity to gather my magic power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Jin’s condition was worsening as the Fire Phoenix was too strong. A few of his golden scales were broken and a green smoke leaked out of his burns.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Feng Ri sinisterly smiled. “Good boy, you can withstand for so long! \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHeng\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e! \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eOh Great Master, please give me your impeccable power to your servant!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he chanted, I realised with astonishment that the originally bright red rays from Si Feng Ri’s body had turned grey. His yellow hair also turned a weird grey colour.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe High Priest stood up and shouted, “Such a sinister power! Si Feng Ri is already controlled by evil forces!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Feng Ri smiled viciously. “Those who try to stop me shall be killed!” A grey vortex surged from his body and charged at me. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen I saw it coming towards me, I began chanting, “\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eOh, great light elements! Please change your endless heavenly power to form a divine halo to block the evil powers before me, Divine Halo!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA gold light tightly enwrapped me and blocked the grey light ray. I could hear cold screams as though numerous vengeful ghosts were coming after my life. The Divine Halo was slowly being suppressed by the evil power, and soon, it wouldn’t be able to block the attack. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Feng Ri coldly said, “It’s useless! There’s no defensive spells that can stop this advance. Brat! You’re gonna die!” What he said was true as it would mean the end of my life once the Divine Halo spell was broken. As I stood at the border of life and death, I thought about Teacher Di, Mu Zi, and my loving parents, . When facing death, I understood that I had really fallen in love with Mu Zi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Halo left only an inch around my body. Teacher Di, Teacher Zhen and Teacher Long anxiously looked at me. They wanted to charge forward to help me and end the competition, but the opposing Magisters held them back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Xiao Jin felt that I was in mortal danger, he raged. He no longer cared about the familial feelings with the Fire Phoenix \u0026nbsp;and wildly attacked it. Seeing that the Phoenix was going to be defeated, I was suddenly enlightened and thought about its struggles and that binding black energy. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Is it being sealed against its will?’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI bit my tongue and spat out a mouthful of blood at the Divine Halo to widen it and hoarsely shouted, “Xiao Jin! Break the magic seal!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Jin unhesitantly shot a golden light at the Fire Phoenix. The Fire Phoenix’s fire magic couldn’t do anything to that light ray which landed directly on the Fire Phoenix’s \u0026nbsp;head. The Fire Phoenix screeched in pain in mid air. Its entire body then shook and doubled in size while it screeched out happily. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy Divine Halo also broke at that moment, but I strangely didn’t feel as if I was dying. I opened my previously closed eyes and looked at Si Feng Ri.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis expression was terribly ghastly and blood flowed from all of his seven apertures. He hoarsely said, “Good! Good! Good! You actually managed to break the Fire Phoenix’s \u0026nbsp;seal. I won’t forgive you!” It seemed when the seal on the Fire Phoenix broke, it rebounded onto Si Feng Ri, who was controlling the seal. It ended his chance of killing me and seriously injured him. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Feng Ri glanced at everyone before he coldly laughed. “When my master regains his power, it will be the end of you stupid fools!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone was stunned for a moment. Duke Te Yi had already stopped holding back my team’s forces. A black six edged star magic spell suddenly formed beneath Si Feng Ri’s feet. “Just you wait! I’ll be back!......”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen shouted, “Stop him! He’s getting away!” It was too late as Si Feng Ri and that black magic array vanished from the arena.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePrince Ke Zha shouted at Duke Te Yi. “Te Yi! What on earth happened? Why did the Ri family’s leader become like this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDuke Te Yi’s previously arrogant attitude had disappeared. He muttered, “How did this happen? Why is this happening?” Dun Yu Xi supported him. “Your Highness, we also don’t know why this would happen. For this match, we concede defeat.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom what he said, we should have been cheering for the victory, but now, no one could bring themselves to be in a cheerful mood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Fire Phoenix benevolently rang out, “Human race! Do you know that the leader of the evil forces are planning to invade the whole world? You must stay united and team up to fight against him!” Xiao Jin seemed to cry out in agreement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Fire Phoenix \u0026nbsp;actually spoke. Teacher Di walked into the arena and used light recovery magic to treat me as I was completely drained of energy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe High Priest asked, “Great magical beast, what are you implying?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Fire Phoenix that was in mid air shrank back to its previous size and said, “I was sealed by an ancient evil power. I couldn’t do anything other than listen to their commands. I was lucky to have the seal broken by the Dragon King and win back my freedom. I hope that you will help free the previously defeated servant of evil too. Please also remember that the dark forces will arise in the West. Finally, thank you, Dragon King. I’ll definitely return this favour to you someday!” After saying that, the Fire Phoenix vanished and the air cooled down drastically.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-31\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-33\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-4-chapter-32","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
