{"id":48416,"no":134,"title":"Volume 4: Chapter 43 - A Brutal Plan","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 4: Chapter 43 - A Brutal Plan\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI scratched my head and awkwardly said, “I’m sorry, Teacher Zhen. I’ll pay more attention in class next time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen replied, “Pay more attention next time? How am I going to solve it this time, then? I can’t tell the teacher to let it go. Won\u0027t that be too obvious that I’m covering for you?\u0027\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI awkwardly said, “What should we do? It’s all my fault for bringing you so much trouble. I’ll study properly in class in the future, so as to not give you any more troubles, so can we smoothen this issue this time?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen frowned and said, “Let me think about this. How about I place you in confinement for a while. They won’t be able to say anything after that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was stunned for a moment and said, “Place me in confinement?” If I was placed in confinement, wouldn\u0027t it mean that I would be unable to stay with Mu Zi. I became anxious and said, “Teacher Zhen, you have to help me! I don’t want to be placed in confinement!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA cunning light flashed in Teacher Zhen’s eyes. “It will be difficult for you this way, but it’s hard to appease the teachers if I don’t do anything to you. In that case, how about you represent the school to participate in the Triennial National Advanced Magic Academies’ competition. I will just announce that you are in confinement. This plan should be acceptable?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAh! Participate in a competition? I started to have the suspicion of being set up by Teacher Zhen.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen continued to say, “Every academy will be sending five members to participate in the competition. You will be the leader of the team, and I’ll let Mu Zi participate as well. You should be satisfied with this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBeing able to be together with Mu Zi, this was acceptable. . “What is the purpose of the competition?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen said. “This competition should actually be a breeze as all of you are so strong. Who will be your match? You can just treat it as a holiday.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWould it be that easy? Forget it! Who asked me to offend Teacher Zhen. Even after knowing that Teacher Zhen had set me up, I couldn’t reject his arrangement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, “Alright! I’ll participate in this competition. Can I pick the members?” If I could choose who to pick, it would be good. Otherwise, with Hai Shui’s abilities, she would definitely be chosen. If I’m caught in the middle, it would be a question of whether I could come back alive!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen thought for a while before replying, “I could let you do that, but you must promise me that your team will definitely bring the championship back. We’re the famous Royal Advanced Magic Academy. If we were to lose to others, my face would be completely lost.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen had forced me into the trap, step by step. I said, “Alright! I’ll definitely bring the championship back to you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen laughed heartily, causing goosebumps to rise above my skin. Teacher Zhen replied, “Who are you going to choose to participate in the competition? Let me hear it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI thought for a while before replying, “It will be Ma Ke, Mu Zi, Hai Yue and I. You can decide the last member of the team.” ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eI will forget about choosing Hai Ri. With his temper, nobody will dare to pick him.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen was visibly satisfied with my decision. “Why didn’t you choose Hai Shui? She should be stronger than Hai Yue.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI chuckled and said, “You don’t know this, but Ma Ke has been chasing after Hai Yue all these years. Let’s create this chance for him. I have already promised that I will definitely be able to bring back the championship anyway. Hai Yue’s capability isn’t bad either.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen replied, “Alright! Let’s add Si Wa Ming to the team. Hai Yue will be the only one from the Xin family who will participate in the competition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI curiously asked, “Si Wa Ming? Isn’t that the expert in earth magic, the fifth year student who is the top ranker of the academy?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen nodded. “That is correct. It’s him. His magic talent doesn’t lose out to you, but his luck is slightly worse from you. He is the the second person other than you in the new generation with the potential to become a Magister. Let me tell you a secret. He’s actually Dun Yu Xi’s successor. I wanted him to join the team so as to develop a good relationship with you and ease the conflict between Duke Te Yi and our side.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSo it was like that. I also really want to get to know this person. Teacher Zhen is so full of praise for him, so the real thing shouldn’t be that far off.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen said, “Then it’s decided. There’ll be a total of eight academies participating in the competition. It’ll take place in the Sen Long’s magic academy in the Martial Return City. You should depart tomorrow. It will be a ten day journey. The competition will be held twenty days from now. You have to get there earlier to familiarize yourself with the place and situation. Even though the other academies’ powers are weaker than ours, there will still be some techniques worth learning.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wanted to scream that I had been scammed by Teacher Zhen. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSo Teacher Zhen has already planned out everything! I swear that I will study properly in the future and not get into conflict with the other teachers. I will never give Teacher Zhen another chance to exploit me\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI lowered my head as I followed Teacher Zhen back to class. Teacher Zhen looked really serious as he stood on the lecturer’s platform. “What happened today is a very serious offence. As a student, not only did Zhang Gong not study properly, he even rebuked his teacher. Furthermore, within this short period of time, he was frequently late for class. I announce that I will place Zhang Gong in confinement for two months in accordance with all of his mistakes. He is to sincerely reflect on his behaviour. Mu Zi will also be placed in confinement for a month. Other students should take this as a warning. If there’s such thing that happens again, it won’t be settled so easily. Alright! Carry on listening to your lessons. Mu Zi and Zhang Gong, follow me.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe class teacher looked at me smugly. “Principal, can Mu Zi be exempt from her punishment? She had always been attentive in class.” Hearing him plead for my beloved, I had a slightly better impression of him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Zhen’s expression was unphased. “I won’t allow that to happen. To do such a thing in the academy, they must be severely punished! Mu Zi and Zhang Gong, pack up your belongings and meet me in the Principal’s office.” With that, he turned and walked away. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I was packing up my belongings, I whispered to Mu Zi, “It’s alright. Don’t worry.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe glanced at me before whispering back. “It’s all your fault that my reputation has been completely ruined!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter we packed our stuff, just before walking out of class, I looked at the class teacher with some regrets. It seemed that he wasn’t a bad teacher.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI told him, “Teacher, I was wrong today. I hope that you can forgive me. “ My words were completely sincere.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was stunned for a moment before saying, “Forget it, just tell me why the Principal gave you such a harsh punishment.” Being confined for two months was a really serious punishment. The students that attended the Royal Advanced Magic Academy were the talents of the Kingdom, so the management of the students had always been very slack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-42\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-4-chapter-43","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
