{"id":48419,"no":137,"title":"Volume 5: Chapter 3 - Preparing for the Journey","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 5: Chapter 3 - Preparing for the Journey\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di said, “You… Who can you blame for this? Who told you to not listen properly in class? Even though this competition is definitely shrouded in danger, I have complete faith in you. The other seven advanced academy definitely won’t have any Magisters. You just have to keep the others safe. Do you understand?” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded. “The reason why Teacher Zhen wanted me to go at all cost was probably for safety.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di nodded. “It is fine as long as you understand. I don’t know why, but I keep getting bad feelings from Mu Zi. I just want to remind you again to pay attention to her.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy mood dampened. Teacher Di seemed to dislike Mu Zi. “Mu Zi is a very kind hearted girl. I have never gotten bad feelings from her.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di smiled. “Everyone is blind when they’re in a relationship. Let’s hope that what you’ve said is true. It’s really late so you should head back now, and besides, you are going on a long journey tomorrow. Have you got enough money? Do you need teacher to give you some more?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI’ve always known that Teacher Di treats me best. I shook my head. “Teacher Zhen has given us all 1000 diamond coins so I have enough to spend. I may need to go away for a few months this time. Please take care of your health.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di said with a gentle expression, “I know that you’re a good child. When you’re outside, please pay attention to your surroundings. You mustn’t be careless and remain modest and keep cool at all times.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI respectfully agreed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di walked me to the entrance of the Intermediate Magic Academy. He gave me a few more warnings and sent me out of the Intermediate Magic Academy. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter leaving the Intermediate Magic Academy, I went to buy some daily commodities and some food that was a little less perishable from the main street and placed them in my spatial space. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eMu Zi is a little piglet. How can she go without food? I also can’t bear to see Mu Zi starve. After interacting with her all this time, I feel that what she is most interested in is food.’ \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003eAfter settling this, I headed back to the academy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe night at the academy was really quiet, as all you could hear was some nocturnal birds calling out occasionally. I quietly walked back to my dormitory. Just as I was about to open the dormitory door, I heard a familiar voice call me from behind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhang Gong, you’re back!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI became alert and shuddered; causing my goosebumps to rise up. I turned around and gave a sigh of relief. It was Hai Shui. I patted my chest. “\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWah\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e! It’s you, Hai Shui. You must know that a person can be scared to death!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui lowered her head and said, “Sorry!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked her, “Have you been waiting for me all this time?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui nodded. “That’s right! Why are you back so late?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui clearly had lost a lot of weight. I sighed in my heart. “I went to Teacher Di for a while so I came back late.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui dully said, “You went to Teacher Di? Is it to bid him farewell?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was startled. “How did you know?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui replied, “Sister told me that she was arranged by the Principal to participate in the eight Advanced Academy’s competition. Why didn’t you let me participate? Do you find me annoying?” Her eyes became watery as she asked that. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI hastily explained, “Why would I feel that way? How could I avoid you. You should know that this competition isn’t that simple. Moreover, I can’t make the decision to decide who participate in the competition as it is Teacher Zhen’s arrangement. I really didn’t have a choice.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui muttered, “How about you help me beg the Principal to let me go with you guys.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said with difficulty, “I’m afraid that it is impossible as this matter has already been finalized and can’t be changed. Hai Shui, just be my sister, alright?” I looked at her to express my deepest feelings. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui looked at me while tears were rolling down her delicate face. “It can’t be that we really aren’t fated to be together, right? Why? Why does is it have to be this way?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI didn’t dare to help wipe her tears away, and instead consoled her saying, “Hai Shui, don’t be like this. There are still a lot of good guys available for you to choose from.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui constantly shook her head and said, choked with sobs, “I...I won’t see you off to..tomorrow. I hope that you..you will stay safe during this trip.” After she said that, she turned and ran away without looking back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I looked upon Hai Shui’s back fading in the distance, I sighed heavily.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDawn of the next day. I packed up and stopped by the girl’s dormitory to get Mu Zi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi said, “I have my own amethyst card so I will give yours back.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI took the amethyst card back from her. “When did Teacher Zhen give it to you? Why did I not know about that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi smiled, “Before you come this morning, he had told a teacher to pass it to me and tell me that the card already has 1000 diamond coins.” Teacher Zhen’s efficiency wasn’t too bad.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe had already unknowingly arrived at the entrance of the academy. Ma Ke was already there and was chatting to a student that had a robust body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI walked over and said, “Ma Ke, you’re quite early.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke smiled and replied, “I had to come early. Boss, what do you think about my clothes?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI then noticed that there was something different in his clothing. He wore a bright red magic robe and there was gold embroidered on the robe. It seemed that he had cleaned up a lot, which suited his originally valiant and formidable-looking appearance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI smiled, “Not bad! You’ve really put in some efforts. This is?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke saw me looking at the student beside him and hastily introduced him to me, “This is Si Wa Ming, the academy’s top expert.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAh! It’s him! I looked at him carefully. He seemed to be 170cm tall and looked very sturdy. It was as though he was a warrior.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe extended his hand to me and said, “ How can I be the academy’s top expert in front of Zhang Gong? Hehe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSo he was that easy going. I shook his hand and said, “Brother Si Wa, you’re too courteous. Reputation comes naturally from real distinction so your position as the academy’s top expert should still be yours.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi said from beside me, “That’s enough! You don’t need to be so formal with each other. Why hasn’t Hai Yue come yet?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke replied, “That’s right! Why isn’t she here yet? It is nearly time to depart. It can’t be that she is not coming right?” \u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shook my head, “She has to come, since this is a decision that the academy made. Surely, she will come.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust as I said that, Hai Yue’s familiar figure appeared in our sight. She was similar to Hai Shui as she had also lost a lot of weight. She looked really pitiful.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke showed a little heartbroken expression and went up to her. “Hai Yue, you’ve finally come.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Yue coldly glared at him and wasn’t at all interested in his new attire. She didn’t bother replying to him and walked past him after glaring viciously at me. “Everyone has gathered already. Let’s go!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi walked up and said. “Hai Yue, it seems that you have lost a lot of weight.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Yue looked at her and said, “Really?” And simply turned and walked out of the academy without waiting for anyone else. I patted Mu Zi’s shoulder to gesture her to follow her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSi Wa Ming obviously didn’t understand our interpersonal relations so he \u0026nbsp;just felt that something was up with Hai Yue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOur group of five step foot on the road towards Martial Return City.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-5-chapter-3","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
