{"id":48422,"no":140,"title":"Volume 5: Chapter 6 - Enlightening Ma Ke","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 5: Chapter 6 - Enlightening Ma Ke\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI can finally make up for last night’s lack of sleep tonight.. After eating some food with the rest, \u0026nbsp;I asked Mu Zi to guide Hai Yue more before I pulled Ma Ke into the room.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke still looked wooden. After we entered the room, I first gave him a violent punch. He was struck dumb by the sudden strike. I said angrily, “For a girl, is it worth it? Don’t let me see you like this again! A man must have an indomitable spirit. Why should a manly man be afraid that he won’t have a wife?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke bitterly smiled. “What if this was the case with Mu Zi and you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI instantly deflated like a popped balloon and sat on the bed. “You really know how to compare, I am the one that is trying to guide you here.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke sighed heavily. “Boss, I know you meant well. I will recover. Thank you for trying.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI patted his shoulder. “Why are you thanking me? If I didn’t make Hai Yue come with us, you wouldn’t have taken such a heavy blow. Loosen up a little! Since you have already decided to give Hai Yue up, what else is there that you can’t let go?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke shook his head, saying. “If I could truly completely let her go, it would be a relief. The heart I had for her is already dead, but if you tell me not to care or think about her, I still can’t do that.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI stared at him. “Let me ask you a question. What is the purpose of this journey?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke was stunned. “Isn’t it to go and compete?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI continued to ask, “Compete in what?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke replied, “The Eight Advanced Academies’ Tournament.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded. “It looks like you have not forgotten about that. You should know how cruel and dangerous this competition is. If everyone was in the same state as Hai Yue and you, there won’t be a single one of us that will return in the same condition as we had started out with. Do you understand? Since you love Hai Yue so deeply, you should not want her to get into any harm. Since it is like that, you must pull yourself together. If only Hai Yue is down, we can still rely on the four of us to fill her spot. However, if both of you are down, then what do you want us to do? Do you think we can guarantee that you two won’t be harmed? Do you understand?” After saying that, my expression was very severe. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke’s eyes looked a little livelier. “Boss, I understand. Don’t worry! I will pull myself together for everyone and for Hai Yue.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy serious expression softened and I smiled, “That’s great! All of us must work together to cross this hurdle smoothly. I will give you a sentence from the book that Uncle Ke Zha gave to me: In life, you will gain and lose things but you also can’t force things to happen. You have to think about it. Everything will be the best if you follow your fate.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke muttered silently, “In life, you will gain and lose things but also can’t force things to happen. That’s right! Maybe Hai Yue and I just aren’t fated to be together.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI patted his shoulder. “Brother, do you see clearly now? Liking a person doesn’t mean that you definitely need to get her. Her happiness should be the goal that you should striving for instead.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke sat on his bed and said, “Let me think. Let me think.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘I hope that after my guidance, he will be able to pull himself together. This word ‘relationship’, it can really deeply hurt people. I hope that my relationship with Mu Zi will be smooth, as I really don’t want to experience the bitter taste of love.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI no longer pestered Ma Ke as letting him think it through himself should be the best solution.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though so much had happened, my tiredness still overpowered my constantly pondering mind. Very quickly, I dozed off.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWho would have thought that once I slept, it would be until the next morning.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e**Ah! After waking up, I felt that the fatigue that I had accumulated during the first two days had already been washed away. My magic power was abundant to the extent of surging as it circulated in my body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter leaving the room, I asked one of the attendants, “Where are my friends?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe attendant replied respectfully, “Your friends are having their meals at the first floor’s diner.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuch injustice! They didn’t even wait for me. Hearing that they were all eating, my stomach growled. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI more or less cleaned myself up and dashed down the stairs. I hoped that they’d left some breakfast for me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter entering the diner, I went to the corner table where they were having their meal. It looked like I wasn’t too late. I shouted, “You’re too much! It’s breakfast time and you didn’t even wake me up!” I dashed over, took a steamed bun, and bit into it savagely. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi smiled. “Look at yourself! You look just like a reincarnated hungry ghost. Eat slowly, don’t choke on it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke replied, “It’s Mu Zi who didn’t let me wake you. She said that these two days you’ve been tired and so to let you sleep some more.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI swallowed the food in my mouth and laughed, “So that was the case. I have wrongly accused you. I’m sorry for that. Ma Ke, your complexion looks much better.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke glanced at Hai Yue, who had her head lowered as she ate. “I have let go of everything already. There is no use to thinking any further, so what is the point of thinking about it? Boss, what you said is right. In life, you will gain and lose things but also can’t force things to happen.” After hearing what Ma Ke had said, I clearly felt that Hai Yue had shuddered a little.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi asked in astonishment, “Zhang Gong, when did you become so knowledgeable? That sentence have such deep meanings.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said complacently, “But of course. Without any learning, how could I pursue you?” I definitely wouldn’t tell her that it was from a book.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Yue stood and said, “You guys continue with your meal. I will head back to pack up first. Mu Zi, when it is time to leave, please come and get me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi nodded. “Alright! You go and have a rest. I will call for you when we are prepared to leave.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke stared as Hai Yue faded from his sight and told Mu Zi, “It seems that her mood today is better already.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi nodded. “That’s right! Yesterday, I advised her for a long time. She seems to have thought it through, but she is also currently in a lot of pain. You shouldn’t disturb her and let her heal.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMa Ke nodded and didn’t say anything else.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter eating, everyone packed up and continued to on the path towards Martial Return City.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the way, Ma Ke gradually recovered his initial easy-going mood. He didn’t disturb Hai Yue at all. Not a single word was exchanged between them. Hai Yue was still very uncooperative, but she was not as cold as when we first headed off from the academy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs we were reaching the border, we slowed down our pace. Hai Yue suddenly walked to my side and said, “Zhang Gong, I want to discuss something privately with you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-5-chapter-6","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
