{"id":48440,"no":158,"title":"Volume 6: Chapter 1 - A Love Faithful to the End","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 6: Chapter 1 - A Love Faithful\u0026nbsp;to the End\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe time had passed by as quick as the twinkling of an eye, two months had passed, and the two gold dans in my body had improved significantly. Even though they weren’t yet completely transparent, they were not far from succeeding, as I had clearly felt that my magic power had made a breakthrough. The current semester was also quickly coming to a close. Ma Ke and Hai Yue have practically been glued together; Each accompanied the other daily. Mu Zi and I were in drastic disparity as compared to them. Although I could distinctly feel her feelings towards me, she still felt close yet far to me. There seemed to be an indestructible wall between us. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI should be giving her the hundredth letter today. What should I write? Should I write about the summary of my feelings for her up to now or about our future plans? No, neither would be good. After wracking my brain, I suddenly recalled a story from a village I had previously visited. Yes, I shall use this story as a basis for the hundredth letter that I would be giving to Mu Zi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe next class began. I gazed upon Mu Zi’s average face, yet I was still bewitched by her lovable appearance. As my heart surged with strong feelings for her, I took some sheets of paper out, and started to write that hundredth letter. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi, this is the hundredth letter. I won’t continue to sweet talk you. Instead, I would like to tell you a story in this letter. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe story is about a boy from a distant past that would see a girl that he admired every day without fail. Finally one day, that boy plucked his courage up and wrote the girl his very first love letter to her, inviting her to the seaside with him. The boy was extremely shy, and would turn and run away from the girl immediately after giving her the love letter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the appointed day arrived, the boy waited anxiously for the girl at the appointed place.The girl showed up, and they played heartily for an entire day.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen night time arrived, as the boy was escorting the girl home, he asked if she was willing to make their relationship official. The girl gave him a letter before turning and running off, saying, “If we are fated….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe boy opened the letter only to find a blank sheet of paper. He was stunned and thought about her words, but did not have a single clue about what she meant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a few days, the boy asked the girl out again using the same method. When the appointed time arrived, the girl showed up and spent the day happily with him just like before. When they separated again, the girl said the same words, “If we are fated….” After she said that, the boy received the same second blank letter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust like that, the boy had used his love letter to make an appointment with the girl.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a few years, the boy and girl had gone on 99 dates and he had given the girl 99 love letters. However, after every single outing, the girl still gave the same reply, “If we are fated…” and gave him a blank letter in reply. Eventually, the boy slowly got annoyed and so he stopped reading the replies she gave him. He felt that he was unable to win her heart over. After he receiving the girl’s 99th letter, he decided to marry another girl who had pursued him for a period of time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn his wedding night, in order to express his sincerity to his wife, he took out all of the letters he had previously written for the girl and told his wife about his story. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis wife took the letters from the girl and went through them one by one; they were indeed all blank, just like the boy had said. When she got to the last couple of dozens of letters, she realised they were still unopened and asked the boy why that were the case. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe boy replied that since the letters would still be blank, what would be the point in opening them?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis wife pleaded for the boy’s consent, and upon getting it, opened the last few dozen letters that the girl had written for the boy. When she opened the 99th letter, she discovered a single line of words on it, and taciturnly gave that letter to the boy. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the boy took the letter, he was astonished to find that the 99th letter had a sentence, “I have already prepared the wedding dress. After you give me the 100th letter, I will be your wife.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe boy was stunned, dazed and stupefied as he looked at the letter. He simply could not belief that fact. He took the 99th letter and walked outside before letting the bone-piercing cold wind carry the letter away, and with it, his heart. They both flew off to a far away place.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis is where the story ends. Even though the method utilized by the girl in the story was a little extreme, it proved that the boy’s feelings for her were not loyal to the end.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi, I don’t know how many letters I will have to give you before you will be able to truly open up your heart and soul, and give yourself to me. Ma Ke has already successfully pursued Hai Yue. When will I be able to succeed in winning your heart over? If I have the chance to use my life in order to obtain your feelings just like Ma Ke did with Hai Yue, I would not even hesitate. No matter what, my love for you will always be resolute, and will not crumble. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eInscribed with my everlasting love, Zhang Gong.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter finishing the letter that brimmed with my feelings, I gave it to Mu Zi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi customarily took the letter and read through its entire contents in a short amount of time. She raised her head and looked deeply at me. Her eyes didn’t reveal her being moved by my words like I expected, but instead were filled with \u0026nbsp;a profoundly complicated expression. She sighed lightly before putting the letter away, then turned her head and stared fixedly at the whiteboard in front of the classroom instead, and did not look at me again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI felt as though I had suffered a blow and my heart was filled with bitter feelings. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Mu Zi, why can’t you open up to me? Am I really that unworthy for your love?’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shook my head, and laughed mockingly at myself. I flopped onto my table and desolately counted the leaves on the tree outside the window as I tried my best to stop those downtrodden thoughts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe class finally ended. I didn’t leave with Mu Zi as per usual and just solitarily walked out and headed to a corner of the academy forlornly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI gently leaned against a large tree whose trunk needed two persons to join arms in order to completely encircle its width. My eyes stared out lacklusterly as I stared forward and my mind was completely blanked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhang Gong?” Someone patted my shoulder. I was startled and quickly turned my head only to see Hai Shui who I had not seen for quite sometime. I had constantly avoided her ever since returning from the competition. Seeing her today was the first time since then.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui smiled at me and said, “It has been some time since we’ve met. Zhang Gong, why are you spacing out alone here? You didn’t even respond to me calling out to you after more than a few times.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui had lost a lot of weight from before. Her initially rosy face was a little pale as well. I smiled at her awkwardly and replied, “That’s right. We haven’t seen each other for a while. How have you been recently?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui seemed to laugh self-mockingly as she said, “Don’t be like this. I heard elder sister say that you guys suffered a lot due to the competition.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “Yes. Who would have thought that the competition would be that abnormal? However, at least we still gained something, as we finally succeeded in bringing your sister and Ma Ke together.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui nodded and replied, “I really do envy them. That’s right, how are you and big sister Mu Zi doing?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-5-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-6-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-6-chapter-1","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
