{"id":48446,"no":164,"title":"Volume 6: Chapter 7 - Regret","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 6: Chapter 7 -\u0026nbsp;Regret\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI chuckled, “You call this a fireball? From how I see it, it looks just big enough for me to cook rice. You can have it back.” The fireball returned with twice its original speed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing the whizzing fireball, the youth’s face turned green. Attacking with the magic previously had cost him a lot of his power. The power of this fireball, he was naturally aware and he wanted to dodge it, but the fireball’s trajectory kept changing so he didn’t know how. He clenched his teeth to cast a wind blade and attempted to cut the fireball open.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI inwardly nodded my head as his usage of the wind blade was not bad. His positioning was very good, but his magic power was a little lacking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePu!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e” The fireball and wind blade simultaneously disappeared. The petite youth’s face turned pale white. It was obvious that he had used up a lot of his magic power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI smiled faintly and said, “Do you still want to compete?” Since impersonating Ma Ke was not a major offence, there wasn’t a need to hurt him. It was enough to make him admit defeat and step down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe petite youth was stunned and replied, “Are you really a student from the Royal Magic Academy?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded. “Of course, even the real Ma Ke wouldn’t be my match if he was here, let alone you. I don’t want to put you on the spot, but can you tell me why you are impersonating Ma Ke?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe petite youth dejectedly replied, “Since it is impossible to defeat you, I concede. Let’s head down and discuss this further.” He turned his head to the judge and said, “I accept my defeat.” After saying that, he took the lead to jump off the stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust as I wanted to go down the stage as well, a tender gentle voice voiced out, “Young hero, why aren’t you continuing to compete after defeating your opponent?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was startled and looked to where the voice was coming from. It was from the maiden in the distinguished guest area. “Previously before I came on the stage, I had clearly said that I am not here to marry so there is no need to continue competing.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe maiden’s voice sounded furious, “Do you think we are playing a game here? When you want to come, you come. When you want to go, you go. Let me have a look at your ability!” After she said that, she cast a wind blade towards me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could she be so unreasonable? I knew that I shouldn’t have meddled in this. I should quickly get out from here. After dissipating the wind blade, I purposely said coldly, “If the young lady continues to be impudent, don’t blame me for being impolite.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe maiden didn’t respond. She cast so many elementary and intermediate wind and fire spells that they hid the sky and covered the earth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt looked like it was impossible not to show some of my strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI snorted coldly and chanted my spell. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e“Great light elements, I plead to you to give me endless God power and form into a huge sword to eliminate everything that lies before you, Light Sword!” \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003eThe people in the audience instantly saw a peculiar sight. I slowly floated up from the ground. My body lit up with glamorous golden light rays. Golden lights could clearly be seen gathering around me. All the maiden’s magic spells vanished five metres away from me. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI raised both of my hands above my head and placed my palms together. All the light rays gathered in my hands.“I will let you have a look at real magic.” After saying that, an enormous light sword stuck downwards from my clasped hands. This magic was my most recent self created magic spell. It used Light Severing Sword as its foundation and was combined with Teacher Di’s theory to strike out a sword from gathered magic powers. I haven’t tried it out yet so it was a good chance to take it out to scare people.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe maiden’s face in front of me became void of colour. The veil that was covering her face had also fallen off. She had long red hair accompanied by her fair skin;with her large eyes and slender body figure, her looks could be comparable to Hai Shui’s. The people from the distinguished guest area shouted out simultaneously, “Please be merciful!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, it was too late as the Light Sword had already struck. What it struck wasn’t at the maiden, but the center of the arena.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the Light Sword disappeared from the center of the arena, there wasn’t any changes to the ground. The maiden snapped out from her fright and said mockingly, “So it is just a deceptive trick.\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e Hmph!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e I knew you aren’t capable.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI laughed and replied, “I suggest that you move backwards. If not, don’t blame me for the outcome.” After I said that, the entire ground shook. The old judge quickly held on to the maiden’s hand and took her away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI used a Radiant Binding Array around the arena before using a short teleportation to be beside that petite youth and shouted, “Everyone, please move back as a precaution to avoid unintentional injuries.” After shouting, I released battle spirit from beneath my feet and quickly left the area.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA tremendous noise sounded behind me. If I were to see what happened, I would be in shock. The circular five hundred square meters arena had been completely segregated. From the light binding array, it was filled with dust. I was lucky that the arena was large enough. If not, the light binding array wouldn’t be able to withstand the power of the explosion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI didn’t care about the after effects and quickly brought the petite youth to the inn.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI let him have a seat before pouring some water for myself. After drinking a mouthful of water, I said, “Tell me what is going on?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe petite youth gave me a distressed look.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could I not know what he was thinking? I said smilingly, “If you speak truthfully, I won’t put you on the spot.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe skinny youth laughed awkwardly, “It’s like this, my family is the local peddler. My father, in order to give me a good future, had me learn magic. Last year, when the Royal Advanced Magic Academy was recruiting students, I participated, but of course I failed. At that time, just when I wanted to leave, a fire magician was just giving a lecture on magic and even demonstrated several high-level spells. I felt so envious. I asked the people around me and discovered his name is Ma Ke, one of the top ten students in the school. The past few days, I saw there was a magician marriage competition here, and so had the idea of using Ma Ke’s identity to rush through the doorway. That’s how the scene you saw today came about.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI curiously asked, “Aren’t you afraid that someone would see through your act?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe petite youth bitterly smiled and replied, “How can I be not afraid? However, that young lady is just too pretty. Moreover, those people who come from the Royal Magic Academy have a supreme reputation in this area so I decided to take a risk and give it a try. Who would have thought that I would bump into you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing his story, I laughed heartily. So, it was because this brat had a fondness for beauties. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter laughing, I seriously told him, “I will let you go this time. However, don’t impersonate others anymore. If you meet with someone unreasonable who decides to grab your weak point and blackmail you, I’m afraid that you will suffer at his hands.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-6-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-6-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-6-chapter-7","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
