{"id":48462,"no":180,"title":"Volume 7: Chapter 3 - The Heart Bleeds","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 7: Chapter 3 - The Heart Bleeds\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI awkwardly smiled. “It is just a small trick. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHehe! Aiya!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e You see, they have already been burnt into ashes. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHmm!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Why are those two people not burned to death?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two that didn’t undergo combustion were the two that were protected by the black rod’s power. Even though they didn’t combust, they collapsed onto the ground without any strength to fight back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDun Yu Xi shouted, “Arrest them!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were four people that came running out of the Royal Mage Union to arrest the two demon race members. The demon race member that used the black rod to protect himself had a malicious look. He shouted without any intentions of surrendering, “Wait for my race’s main army to invade! It will also be the time for your deaths!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe other demon race member’s eyes held a hidden bitterness. He just fixedly looked at me. I was stunned as those eyes looked very familiar.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDun Yu Xi ordered, “Take down their masks!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe demon race member with the malicious eyes had his mask removed first. It was an old man with a face full of wrinkles. He coldly snorted and raised his head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the other demon race member’s mask was removed, everyone from the academy was startled. When I looked at him, I felt as though all of the blood in my body had rushed towards my brain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shouted, “Mu Zi, why is it you? Why are you here? Could it be they caught you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi looked fixedly at me with her eyes filled with dismay. She replied. “Zhang Gong, I have let you down. I am from the demon race. This is the worry that I have never been able to tell you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of the cells in my body went stiff. Every thought kept surging up. I had finally understood why Mu Zi initially didn’t want to accept me, and also why she didn’t want me to heal her with light magic; why she wanted to be a matchmaker for Hai Shui and I and why she had always wanted me to forget about her. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy eyes filled with despair. A mouthful of blood deep from my heart, violently sprayed out. I shouted, “No!!!!” In my eyes, the world had completely changed into a bloody haze. Mu Zi’s figure gradually became fuzzy. Once my head slanted forward, I fainted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy heart was in extreme pain. In the darkness, I could imagine as though Mu Zi was waving mournfully at me before she gradually fell into a dark whirlpool that was so deep that the bottom couldn’t be seen. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wanted to catch her but I just was not able to. I could only see her slowly become engulfed by the whirlpool. I shouted, “No! Mu Zi, don’t!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI screamed out for her and suddenly sat up. My entire body was drenched in cold sweat. Teacher Di walked over and said, “Zhang Gong, you have awoken. How are you feeling? Is there any discomfort?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shook my head and looked fixedly at Teacher Di. My tears came out, dropping onto the blanket. Teacher Di gave out a long sigh before sitting by my side, embracing me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI immediately wailed loudly and cried out, “Why? Why are the heavens treating me like this? Why is this happening? Teacher Di, please tell me that this isn’t real and is only a dream, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di rubbed my back and benevolently said, “Child, you must accept this fact. It is real. This can’t be changed by human strength. I only just found out that you are really that deeply in love with her.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi’s attractive reflection appeared unceasingly in my mind. My heart was ice cold. Mu Zi unexpectedly was a spy from the demon race and also participated in attempting to assassinate Emperor Ke Zha. With such heavy crimes against her, it was impossible for her to remain alive for long.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a long time, I slowly controlled my sorrow. I sat properly and asked, “Teacher Di, how is she now?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di shook his head slightly. “Child, don’t put any hope on that thought.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI exclaimed, “It can’t be that she is already dead, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di replied, “Listen carefully, she currently isn’t dead but her magic is sealed. She has been locked up in the Sky Prison with the other remaining demon race member. That’s right! I heard that you used a forbidden spell that also killed a majority of the demon race members that invaded. Is that true?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi’s time being locked in the Sky Jail wouldn’t last for many days. I dejectedly said, “That’s right. I had used the Eternal Recovery light spell. It is also the only forbidden spell that you had taught me.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di curiously said, “It is a recovery spell and not an offensive spell. Why is there such a strong killing force?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “It is due to the demon race having dark attributes so no matter if it is an offensive or a defensive light magic, it’ll have a strong killing force.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di nodded. “So it is like that. Child, you are not allowed to go anywhere and just stay at teacher’s place. Your injuries aren’t bad, just that you have overused your magic power.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI begged, “Teacher Di, can you please let me see Uncle Ke Zha?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di’s expression instantly became strict. “You can’t! Even if you go, there won’t be any outcome! Do you understand that the demon race and beast clans have joined their armies and are now moving restlessly at our border? Furthermore, the demon race has come to assassinate Emperor Ke Zha and almost succeeded. Mu Zi’s position in the demon race isn’t low. How can he let her go because of you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI rolled onto the ground from the bed, kneeled down and begged as I cried out saying, “Teacher Di, I beg you, to at least let me give it a try.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di helped to lift me up and sighed saying, “Child, what do you want me to say to you? You should know that the human race’s hatred towards the demon race and beast clans has already been deep rooted. Since you are unwilling to give up, you can give it a try. But you can’t do any foolish acts! Do you understand?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI elatedly nodded my head and stood up. “Thank you! Thank you so much! I will head there now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTeacher Di helplessly said, “Child, are you that anxious? If you want to go, you have to recover first. After your magic power has recovered, you can go after that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter standing up, my head felt very giddy. I knew that Teacher Do had said the truth. I immediately sat on the bed and did my best to gather my magic power. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Mu Zi, I will do my best to help you resolve this matter. No matter what, I will save your life. Even if I have to exchange my life for yours, I am also willing.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter resting for a day, the two gold dans had rapidly recovered my magic power. Even though I wasn’t at my peak state, eighty percent of my magic power had been recovered. Actually, when I had made thirty percent recovery, I could already enter the palace. However, in my heart, there was a shadow. If Emperor Ke Zha didn’t want to let Mu Zi go, what should I do then?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wore an ordinary white magic robe and with the staff in my hands, I headed towards the palace. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Mu Zi, nothing must happen to you. I am coming. Even though you are from the Demon race, my love for you hasn’t decreased at all. You must wait for me.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-7-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-7-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-7-chapter-3","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
