{"id":48463,"no":181,"title":"Volume 7: Chapter 4 - My Decision","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 7: Chapter 4 - My Decision\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I neared the entrance of the palace, the guards on duty stopped me. My expression dampened. “Please help me to report that the Royal Advanced Magic Academy\u0027s Zhang Gong wishes to meet with His Majesty.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing my name, all of the guards displayed respectful expressions. The guard immediately respectfully replied, “Please wait for a moment. I will immediately go and report.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe guard quickly walked back out from the palace. “Magister Zhang Gong, His Majesty has requested the pleasure of seeing you.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded and followed him into the palace, which was different from before. Even though there were some burned parts that was still not repaired, the guards in the palace and mages were placed every three steps and a sentry every five steps. The security of the palace was exceptionally tight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter walking to the entrance of the inner palace, the guard shouted, “Magister Zhang Gong request for an audience.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEmperor Ke Zha had personally came forth. When he saw me, he elatedly said, “Zhang Gong, you’re here! Let’s chat inside.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter entering the inner palace, I immediately kneeled and said, “This commoner hadn’t properly protected Your Majesty and risked His Majesty getting injured. My crime is severe enough for me to be punished to death ten thousand times.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha’s expression changed and said angrily, “Zhang Gong, what are you saying? If you are counted to have protected me unsatisfactorily, then the others are rice buckets! I am lucky to have you this time. I am preparing for you to become the Kingdom’s protector. All of you withdraw. I have some matters to discuss with Magister Zhang Gong.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha had ordered the guards to withdraw before pulling me up. He said in appreciation. “Zhang Gong, you’re really the Kingdom’s pillar. If you didn’t use the forbidden spell, the outcome would be unconceivable.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI hastily bowed and replied, “Your Majesty, it was something I ought to do. Moreover, the forbidden spell was successful under the power of Teacher Zhen and mine with some luck.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha replied, “There is no outsider here. You don’t have to call me a Majesty. You just call me Uncle Ke Zha. I am more familiar with you calling me that. No matter what, you’re a great contributor to the Kingdom. You don’t have to continue studying at the Advanced Magic Academy, come to the palace. I will appoint you to be the Vice head of the Royal Mage Union and be the protector of the Kingdom.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing that his mood was good, I felt that I should say my purpose in coming here. I kneeled again and replied, “Uncle Ke Zha, I don’t need any rewards. I just beg for a favour.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha waved his hand and replied, “How can you be unrewarded. You don’t have to plead to me about that matter. I know what you want to say. I can grant you anything but that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI anxiously replied, “Uncle Ke Zha, I……”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha sighed and replied, “Zhang Gong, you must know that she is from the demon race. This is no longer just my problem. I need to account for all of the officials and also the commoners. Do you understand? I haven’t done any punishments on Mu Zi for your sake. I can only promise you that before execution, she will be slightly more comfortable.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen I heard about the execution, my mood abruptly dampened. I knew that in usual cases, Mu Zi and her accomplice wouldn’t be exempted from their punishment. I was afraid that other than the stubborn old man, nobody would be my opponent. There wouldn’t be any of her race that would come to rescue her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI sighed and replied, “Since that is the case, Your Majesty, I will withdraw first. As for the position for the Vice head of the Royal Mage Union and to be the protector mage of the Kingdom, please forgive me that I can’t accept those roles as I am used to the academy’s lifestyle.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter leaving the palace, I definitely wouldn’t let Mu Zi die. I squinted my eyes. I wanted to save her and must immediately do so. If not, once Teacher Di and the others were to interfere, it wouldn’t be good. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter making a firm resolution, I went to a place not far from the palace to formulate a plan. The demon race members were imprisoned at the back of the Sky Prison. They surely would be heavily guarded. It would definitely be difficult to enter it. What should I do? \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter thinking for a long time, I still couldn’t find a good plan. There wasn’t much time already. I just had to try to breakthrough it once and must move at a speed like a thunderbolt that couldn’t be heard to save Mu Zi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI first looked at the surrounding of the Sky Prison. There should approximately be 1000 guards. One tenth of them were mages. With this strength, it would be difficult for me to break in and might have the chance of being unable to leave it unless I massacre them. No matter what, the situation had not wavered my determination to save Mu Zi. I bought some things from the city first before returning near to the Sky Prison.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI suddenly thought about the escape scroll that Teacher Di had given me. If I used my magic power to envelop all of us, we should be able to send them out from there. With it, my chances of success had increased by far. What I had to do now was to break into the Sky Prison.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI sat cross legged on the floor to gather my magic power one last time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter two hours, I appeared at the entrance of the Sky prison. Just as I neared the entrance, I was blocked by the guards. The guard asked, “Who are you? Don’t you know that this is the Sky Prison?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI coughed and raised the Sukrad\u0027s staff in my hands. “It is me, the Royal Mage Union’s Vice head and the protector mage of the Kingdom, Zhang Gong Wei.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing who I was, the guard immediately bowed and replied, “I don’t know what is the purpose of the protector of the Kingdom coming to this place.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said displeased, “I come here from the order of His Majesty to check on the two demon race prisoners.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe guard said in difficulty, “I don’t know if you have the written order from His Majesty. We don’t dare to let you in with just your words.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI yelled, “Outrageous! It can’t be that you don’t know who I am, right? You dare to obstruct my matters. Do you still want your heads to be on your neck?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the guard wanted to explain. There was a mage that walked out from the Sky Prison. From the symbol on his body, it seemed that he had a Great Mage ability. He asked, “What is going on? Why is it so noisy?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen he walked over and saw it was me, he immediately smiled obsequiously, “So it is Lord Zhang Gong, is there something wrong?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI coldly snorted and replied, “I want to take a look at the two criminals from the demon race, but they denied me entry.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe mage said to the guards, “You’re all have such nerves to do that. Don’t you know the two demon race prisoners were apprehended by Lord Zhang Gong? Without Lord Zhang Gong’s help in annihilating the assassins, we would have already been killed under the hands of the demon race. I can’t vouch for others but there definitely is no problem for Lord Zhang Gong. Quickly let him in!” The mage thought , ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSince this child had just saved the lives of the kingdom, he definitely is an important person in the Kingdom and is also the Vice Head of the Royal Mage Union, managing them. I have to take this chance to curry favor with him. There is a possibility that there will be a meteoric rise in my position in the future.\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe guards momentarily kept quiet out of fear and let me in. It seemed that the mage was currently trying to curry favors from me as he said, “My Lord, the spell that you used at that time was too remarkable. This junior has never seen such a powerful spell. I am afraid that even Principal Zhen isn’t your match.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-7-chapter-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-7-chapter-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-7-chapter-4","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
