{"id":48473,"no":191,"title":"Volume 8: Chapter 1 - The Village in the Mountains","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cstrong\u003eVolume 8: Chapter 1 - The Village in the Mountains\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Qi Meng Satan\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Emperor\u0026nbsp;of the Demon race, top expert of the Demon race and Mu Zi’s father. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Dark Demon Dragon\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor’s mount and a loyal protector.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Su He\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon\u0026nbsp;Emperor’s second son, his status?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Fifth Elder\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ancestor of the Holy Sword that accepted the task from the God to set up the God Village. He is the current God Village’s top expert.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Jian Shan\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRadiant knight of the God Village’s young generation, he’s a well-known figure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eName: Wallace\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSex: Male\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe leader of the beast clans that had a outspoken and straightforward personality, holds the ‘Earth Bear’ title and is good in Earth elemental magic. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a golden light flashed, a slender body appeared on a hill. It was surrounded by a verdant and lush forest that had frequent calls from birds and insects.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA body figure that was about 1.9 meters tall slowly appeared. He was doing a handstand on the hill with his eyes staring at the horizon with his eyebrows expressing sorrow. That man was me. The widely known light magician in the Kingdom of Aixia, Zhang Gong Wei, who is also the main character of this book.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI had finally succeeded in escaping. After thinking back to the deep feelings Hai Shui had for me, my heart involuntarily throbs. Furthermore, I still also have Mu Zi that should already be deep inside the demon race territory, who is the woman I love the most. I would really never have thought that she would unexpectedly be the princess of the \u0026nbsp;Demon race. Even if that was the case, I had saved her when she was captured by Aixia’s Royal Magic corps, which had also ruined my future in Aixia.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘I must go to the \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e\u0026nbsp;Demon\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e race to find Mu Zi because I love her. It’s impossible for me to forget her.’ \u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wondered how Big brother Zhan Hu and the rest were. If I could get their assistance, the journey to the \u0026nbsp;Demon race territory would be much smoother so I had decided to head to the Kingdom of Xiuda to find them. After that, I would head for the Demon race. I was not worried about going to the Demon magic races lands as I had complete confidence in my powers. What I was most afraid was that Mu Zi would abandon me or wasn’t willing to come back with me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter determining the destination to head towards, my heart felt much better. I raised my head and gave out a long roar. I kicked off from the ground and circulated my battle spirit as I flew down the hill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI currently had already lost my sense of position as when I escaped, the magic array was designated to head towards the west. This was to say that this place should be 500 kilometers west from Aixia.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eI shall forget about it and just head in this direction. I should be able to reach a city. When I find one, I’ll just determine the correct direction I should move in\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI hadn’t thought such an error in my decision making had forced me to spend three days in the forest. If I knew Advanced wind magic, I perhaps wouldn’t need to spend so much time in here. However, my major was light magic and minor was spatial magic, that weren’t capable in allowing me to fly. Even though I could fly with my battle spirit, my current body condition wasn’t good. My body strength was half of the power from my strength at peak condition. It shouldn’t be able to fly for long but I could use short teleportation. This was bad after rapidly teleporting for a day. I discovered that I was completely lost. Damn it! I didn’t dare to continue using the short teleportation anymore so I could only conscientiously depend on my both legs to proceed. After I finally walked out of the forest, I already looked like a beggar. My clothing had already be shredded by the shrubbery.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the torture from the stone prison that made me exhausted and that I didn’t rest up properly after Hai Shui had rescued me, with the fact that I currently was out of food, the condition of my magic power and battle spirit were all not good, especially my battle spirit. The reason for that was I had previously used it to support my body so the consumption of it was large.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy pitiful Sukrad’s staff was currently being used as my walking stick. I previously had always had a smooth sailing life and never suffered this much. I sighed as I couldn’t help but to think back to my past.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI hobbled as I moved forward. There was suddenly a spiral of smoke in front of me. I instantly felt a little energetic as if there was smoke, it was a sign of presence of humans there. This was too awesome! I used my entire body’s power to charge forward. When I stepped on a small hill, \u0026nbsp;I finally saw a large village.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen a light shone through my hopelessness, I was exceptionally excited. My body seemed to have lightened a lot. I cheered before heading to the village.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I neared it, I heard the sounds of water. There was a river flowing at the side of the village. There was a 30 to 40 meter high waterfall upstream. It looked like this water supplies this village. The scale of the area was counted to be big as it catered about six to seven hundred houses. The houses were all built with wood and bamboo. The place was surrounded by mountains, making it seemed extremely tranquil. I had unexpectedly found such a large village in such a remote area.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the moment that I could see the village entrance, under the irradiation of the intense sunlight, I couldn’t refrain myself from getting light headed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA clear voice voiced out, “Who are you? Why have you come to our village?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI stared at the direction of the voice. He seemed to be a 18 to 19 years old young fellow. He looked tall and stalwart with his entire body reeking with explosive power. There was an unknown beast in his hand. From the looks of it, he should be a hunter. However, from the bearing of his body and explosive power, he seemed to an expert in martial skills. There was unexpectedly someone that practiced martial skills in Aixia. This was really strange.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied politely, “Brother, I’m just a passerby that is overly exhausted. I’m thinking of purchasing some food and water from the village to rest up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe young man frowned as he sized me up. “Alright, follow me.” After he said that, he lead in front of me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sorry for the trouble.” I used the Sukrad’s staff to support my body as I forcefully followed him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter entering the village, there was a couple of young men, whose ages were still very young.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Big Brother Jian Shan, you’re back.\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e Wah! \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003eYou caught another Purple Fox! You’re really great!” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That is our Big brother Jian Shan, the number one expert among the younger generation.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe young man who brought me in smiled and said, “That’s enough! You all stop flattering me. If the elders heard that, they will remark that you all are not being discreet again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe few youngsters stuck their tongue out at him but didn’t dare to say anything. One of them that had a good eye and asked, “Big brother Jian Shan, who is he? Where did you get this beggar from?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan rebuked, “Shan Dou, stop talking nonsense. He should just be lost. You go and report to the Great Elder to let him decide whether to keep this outsider or not.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe person that was known as Shan Dou gave out a peculiar sound before turning and running away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian San told me, “ Big brother, come with me.” After he said that, he brought me to a bamboo house at the western side of the village. I replied pantingly, “Thank you, brother.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan poured a cup of water and passed it to me. “You can try our spring water. It’s not bad.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI drank all of the clear spring water. A chilly feeling passed through my body. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eAh! \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003eI replied in appreciation, “This spring water is really nice to to drink, is this water from the flowing spring at the side of the village?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan nodded before pouring me another cup of spring water. “The spring water is our village’s lifeline. Without it constantly flowing all around the year, our village wouldn’t be able to survive.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I drank, I said, “That’s right! Water is the origin of life.” As I said that, I couldn’t help but to think about Hai Shui who was so far from here.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Brother Jian Shan, the elder wants you to bring that stranger to meet him.” Shan Dou’s voice sounded out from outside of the room.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-7-chapter-13\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-8-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-8-chapter-1","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
