{"id":48284,"no":2,"title":"Volume 1: Chapter 2 Choosing the Light Element","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eVolume 1: Chapter 2 – Choosing the Light\u0026nbsp;Element\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCong cong\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eI quickly ate two mouthfuls of breakfast then\u0026nbsp;left the house for school in a hurry.\u003c/p\u003e\n\u003cp\u003e“Walk faster, you don’t want to be late otherwise the teacher will have a bad impression of you. Properly learn magic! Pay attention to the road and come home quickly after school!\u003c/p\u003e\n\u003cp\u003eMother sure is amazing, saying these words every day, it’s impossible for me to not know them by heart by now. However, her concern for me makes my heart warm.\u003c/p\u003e\n\u003cp\u003eMy name is Zhang Gong, 7 years old this year and living near the landlocked kingdom of Aixia’s second largest city, in a small village beside Senke city. As my family is relatively wealthy, my mother and father were very hopeful and brought me to the city’s Sunke Elementary Magic Academy in order to learn magic. I’m now in the third grade. Since a young age I have shown interest in magic but\u0026nbsp;I’m a lazy person by nature. In more than two years I have only learned some elementary class\u0026nbsp;magic and some basic magic theory.\u003c/p\u003e\n\u003cp\u003eToday is the day I have to tell the teacher what element\u0026nbsp;of magic I chose. This will determine what class I’m in. (Each mage has major and minor magic elements. They will only have one major\u0026nbsp;element\u0026nbsp;which they concentrate on while they can have up to three minor\u0026nbsp;magic elements\u0026nbsp;to supplement their major\u0026nbsp;element.) What should I choose…? I like fire magic, but it feels a bit too dangerous. Since my motto is ‘safety first’, it really conflicts. So what should I choose…? Which magic is the safest?\u003c/p\u003e\n\u003cp\u003eThinking about it….\u003c/p\u003e\n\u003cp\u003eAh, yes, light magic seems the safest. In the past, teacher said that there are basically no attack spells of the light element before advanced class. It’s basically purely defensive or curative and I won’t have to spar with others. Yea, I’m choosing this. (Due to the kingdom of Aixia constantly promoting magic, students in magic academies often have to tests to increase their practical experience and confirm their magic level. However, because of our low magic levels, no one has come to test the lower grade’s magic levels yet. Generally they will test it in grade 5 or in the intermediate magic academy.\u003c/p\u003e\n\u003cp\u003eI’m truly am smart! What minor magic to choose? I’ll choose wind magic and learn some air blasting techniques (Major wind magic) or something. This way I can quickly escape in case of danger. Wait, no, no, wind magic is fast but it isn’t capable of instant movement. Mother told me there was a spatial magic scholar who could teleport about 10km. (And he is still only a magic scholar!) Spatial magic is pretty good, so I’ll choose it instead then!\u003c/p\u003e\n\u003cp\u003eAfter such deep thought, I couldn’t help but take a deep breath.\u003c/p\u003e\n\u003cp\u003eLater generations would praise a light system Grand Magister, Zhang Gong Wei, the Child of Light.\u0026nbsp; Zhang Gong Wei will later become a powerful figure with a widespread name, unable escape the clutches of the hand of fate. Chosen, his light magic had been destined to be spread throughout the continent. (Not to mention his spatial system magic which he often uses to escape.)\u003c/p\u003e\n\u003cp\u003eI happily walked to town and turned my thoughts to this beautiful life. I couldn’t restrain myself from laughing due to my happiness.\u003c/p\u003e\n\u003cp\u003e“Zhang Gong”\u003c/p\u003e\n\u003cp\u003e“You’re so annoying Ao De. You scared me!”\u003c/p\u003e\n\u003cp\u003eHe is both my best friend and my classmate.\u003c/p\u003e\n\u003cp\u003e“What elements\u0026nbsp;of magic did you pick?”\u003c/p\u003e\n\u003cp\u003e“I’ve chosen the light element\u0026nbsp;for the major\u0026nbsp;and the spatial element\u0026nbsp;as the minor.”\u003c/p\u003e\n\u003cp\u003e“That’s just like you! Ha ha.”\u003c/p\u003e\n\u003cp\u003e“What do you know! Why don’t you tell me why I picked these two then.”\u003c/p\u003e\n\u003cp\u003eI’m a surprised by Ao De.\u003c/p\u003e\n\u003cp\u003e“Of course, since your motto is “safety first’.”\u003c/p\u003e\n\u003cp\u003e“So annoying! You’re correct. What did you choose then?”\u003c/p\u003e\n\u003cp\u003e“I chose water\u0026nbsp;element as my major\u0026nbsp;and spatial element\u0026nbsp;as my minor!” said Ao De with his chest out and a proud look on his face.\u003c/p\u003e\n\u003cp\u003e“I understand why you picked the spatial element\u0026nbsp;(of course he would pick the same as me), but why did you pick the water element?”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t understand”, Ao De said while looking like a little adult.\u003c/p\u003e\n\u003cp\u003e“Hurry up and say why.”\u003c/p\u003e\n\u003cp\u003e“There are a lot of girls who pick the water\u0026nbsp;element! There are basically no boys. I can bully them and take their snacks! Haha.”\u003c/p\u003e\n\u003cp\u003e“This young yet you’re so spoiled. I’m going to tell your father.”\u003c/p\u003e\n\u003cp\u003eI raised my head high. But then I thought, though the water element\u0026nbsp;has more girls, after entering an intermediate magic academy if he continued bullying the girls, there would be a tragic consequences. The older brothers of this village were beaten horribly when they bullied the academy’s beauties. Ao De will truly be miserable after he grows up from a brat, thinking this I cannot help but look at Ao De with doubt.\u003c/p\u003e\n\u003cp\u003e“Come learn magic of the water element\u0026nbsp;with me!”\u003c/p\u003e\n\u003cp\u003eBecause he doesn’t want me to expose him, he’s even trying to draw me in!\u003c/p\u003e\n\u003cp\u003e“No need. Just get me some good treats in the future and I won’t tell you father. Okay?”\u003c/p\u003e\n\u003cp\u003e“Okay. No problem.”\u003c/p\u003e\n\u003cp\u003e“We’re at the school. Hurry up, we’re going to be late soon.”\u003c/p\u003e\n\u003cp\u003eSunke City’s Elementary Magic Academy is the city’s biggest magic academy. It occupies over 20 000m² and there are a lot of practice fields and faculty buildings. Ao De and I are in class 3-4.\u003c/p\u003e\n\u003cp\u003e“Good thing we’re not late, otherwise the old witch will punish us again.” Ao De muttered to me.\u003c/p\u003e\n\u003cp\u003e“Be quiet. The old witch is coming. (Of course, the old witch is our class’s teacher. The 50 year old fire element\u0026nbsp;advanced mage, teacher Lin. She very strict and she matured into an unattractive woman. So me and my classmates gave her the nickname of ‘Old Witch’).”\u003c/p\u003e\n\u003cp\u003e“Good morning students.”\u003c/p\u003e\n\u003cp\u003e“Good morning teacher.”\u003c/p\u003e\n\u003cp\u003eAs soon as the old witch came in the class fell silent, because no one wanted this old volcano to erupt.\u003c/p\u003e\n\u003cp\u003e“Have all of students thought properly about what magic element\u0026nbsp;to choose?”\u003c/p\u003e\n\u003cp\u003e“Yes we have.”\u003c/p\u003e\n\u003cp\u003e“Good. Come line up in the front to register then.”\u003c/p\u003e\n\u003cp\u003eWhen I registered, the old witch looked at me and said “You’re choosing the light element\u0026nbsp;as your major?”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s right teacher.”\u003c/p\u003e\n\u003cp\u003e“Did you know that in the whole kingdom those who choose the light\u0026nbsp;element as their major\u0026nbsp;besides the professionals are only monks who use it for treatment?”\u003c/p\u003e\n\u003cp\u003e“What? Why is that? I didn’t know!”\u003c/p\u003e\n\u003cp\u003eIt turns out that 200 years ago when the two continents first collided, there were a lot of humans learning the light magic because light magic is the weakness the demon race. In the war, intermediate light element mage had two main functions, as intermediate light spells are capable of basic treatment of the injured and damaging the demon race. Light and darkness spells also had two other functions. But today, 200 years later, due to the peaceful 200 years without war, people are able to live peacefully. Thus light spells have slowly become entirely useless. In comparison to the practical water, fire, earth and wind spells, the light element\u0026nbsp;is fairly basic. Furthermore, in intermediate class light spells are almost entirely defensive or for healing purposes. So most people choose who favor being aggressive choose the water, fire, earth or wind\u0026nbsp;element as their major\u0026nbsp;and although slightly inferior to light spells, water spells are also able to heal. However, due to water spells having offensive spells and defensive spells in a more even ratio, even the girls who want to learn how healing spells give up the light element in favor of the water element. Leaving only the peace-loving monks to choose the light element\u0026nbsp;as their major.\u003c/p\u003e\n\u003cp\u003eFor the seven year old me, of course I wouldn’t know about this. After the teachers explanation, I told her about my motto of ‘safety first’ and that I was set on choosing the light magic.\u003c/p\u003e\n\u003cp\u003e“Well then, all of the students who have selected their magic element, it’s an early dismissal today. Tomorrow, you will all be divided into classes according to the magic element\u0026nbsp;you have chosen.\u003c/p\u003e\n\u003cp\u003eYea! Class is over!\u003c/p\u003e\n\u003cp\u003eAnd so the Child of Light’s light\u0026nbsp;element education begins. How it will\u0026nbsp;turn out tomorrow, we will soon find out.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-1-chapter-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-1-chapter-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-1-chapter-2","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
