{"id":48493,"no":211,"title":"Volume 9: Chapter 4 - First Encounter with Beast Men","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter 4 - First Encounter with Beast Men\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, “What do you mean good looking? Is he even more handsome than I am?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied with a \u0026nbsp;smile, “He’s incomparable to you. You’re so handsome and outstandingly elegant, with the manners of a jade tree and a powerful yet exceptionally witty……….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI interrupted him and said, “Stop flattering me. That’s right! What is this Holy Light’s Protector that Ke Lun Duo is?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He was caught in a snag and awkwardly smiled. “The Radiant Light’s Protector is the strongest of the demon race’s army forces and is in charge of protecting my Royal father. It is similar to your humans’ royal Protectors.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI took out the Radiant Light Empire’s map and had a look. “We should pass through your Stranded Beast County, Night Blue County, and the Martial Virtue County before we reach the Capital City, right?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied, “That’s right. Those three counties are also enormous. With our current speed, we’ll need approximately 20 days to reach our destination.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e20 days really was too long to me but it was impossible for us to fly to the demon race’s main base.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri said, “Give us an introduction of your demon race’s local conditions and customs.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He’s vigour increased at the thought . “You’ve found the right person. The beauty of the demon race is really famous. The demon race’s body figure alone, just thinking about that…..” Drool flowed out from his mouth. It wasn’t strange that this brat was so disappointing. He had always been loitering about. How could he be any good?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri angrily said, “You’re shameless. Who’s asking you about that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He laughed embarrassedly, “I couldn’t control my feelings. Sorry about that.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRegarding our demon race, you should know about our hierarchy. Our Radiant Light Empire has two main species. One of them is the demon beast, which is of the lowest standard and are usually controlled by the demon race. The other species is the demon race like me, and are technically the same as you humans. The demon race has two subtypes. One of them has purple-brown eyes and is of a slightly lower rank, while those that have your kind of eyes are the highest ranked demon race. Only those that have bright purple eyes can become court officials.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was so much background information. I asked, “How are the demon beasts ranked?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied, “The demon beasts are divided into five ranks. They are S, A, B, C and D ranks. The D ranked demon beast is the weakest among the demon beasts and the C ranked demon beast is the second weakest, so on. Most of the demon beasts are C and D rank. They make up at least ninety percent of the Demon beast army forces. The B ranked demon beasts are much fewer, while less than 300 A ranked demon beasts that are the trump card within the Demon beast army force. They’re generally gigantic in \u0026nbsp;and are definitely no weaker than the beasts in the Beamon Army corps. There are only 100 of them that normally participate in battle. The rest of them are used as mounts for various generals and nobles that have made great contributions in the wars. Overall, those of the demon beast race are actually just slaves for us of the higher class demon race.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI coldly snorted. “You just know how to enslave others. All living beings in the world are equals.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Su He heard what I said, his eyes filled with vigour, but it only lasted an instant before he calmed down. He sighed and said, “What you said is logical but if we didn’t control the demon beasts, I’m afraid that before we could even invade the human race, we would be annihilated by the demon beasts. They do not have a conscience and live purely by instinct. What are their instincts? They are, ‘the weak are prey for the strong’. Moreover, the demon beast’s offensive attacks are extremely powerful. Even if it’s a D ranked demon beast, it isn’t something an ordinary member of the demon race can handle. Now tell us, if we don’t enslave them, what are we supposed to do? Isn\u0027t your human race also similar to us as you kill chickens, butcher geese, ride on horses, and rear sheep?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter he said that, Su He grew a little excited. His righteous look stunned me. It seemed that this fellow wasn’t completely useless. I thought about it and realized that what he said made sense. I couldn’t help but develop good feelings for him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, Su He already knew that he had said the wrong words. He immediately said with a smile, “It wasn’t my intention. I was just rambling. Please don’t be offended.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI smiled in response, “What you just said was right. From your previous attitude, you don’t seem to be that useless.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said consecutively, “It’s just a bunch of nonsense! A bunch of nonsense.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shouted, “Everyone, let’s increase our advancing speed!” As I said that, I inserted some of my battle spirit into Su He and the horse’s bum. The team\u0027s speed increased with Su He crying out in fright.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter two days, we arrived at the first town we encountered in the demon race. According to Su He, this was the borderline of the Stranded Beast County. The Stranded Beast County had received its name for successfully obstructing the beast race.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter entering the town, I realized that the place wasn’t that different from the human race’s towns. It was just that the construction of the houses were of a slightly lower standard. I asked in astonishment, “Why is this place so similar to a human’s town?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He bitterly smiled, “To be honest, the human kingdom’s evolution has always been quicker than ours. We’ve already been copying your lifestyle for a few thousand years. The effect of this was good as we developed at a much faster rate.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “why don’t I see any demon beasts? Isn’t the number of demon beasts more than the demon race?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied, “The majority of the strong demon beasts that have battling powers have already gone to the front lines while the other ordinary demon beasts have been domesticated. Without their owner’s permission, they can’t simply come out.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri said, “Who says there aren’t any demon beasts. Take a look. Isn’t that one?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone’s gazes moved towards where Dong Ri was looking at. It was a werebear creature at least three meters tall, heading in our direction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said in surprise, “That’s not a demon beast, but a beast of the beast race. Why would there be a beast here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked, “Aren’t the demon race and beast race allied, so why is it strange for a beast to be here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied, “You don’t know this but since we fought had constantly warred against the Valiant Mist Empire, the hatred between us is beyond the hatred for the human race. So in the demon race’s territory, there should rarely be any sightings of beasts. Moreover, that beast seems to be of a higher standard and should be quite intelligent.” While he explained about the beast, Su He’s eyes were filled with hatred.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe didn’t know if that werebear knew we were talking about him or if he suddenly became interested in us as he turned to look viciously in our directions with his enormous pair of fierce eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He whispered, “This isn’t good. This werebear must be trying to find trouble with \u0026nbsp;us.” Just as he said that, the werebear walked towards us in large strides. When he neared us, he roared, “Why are you few sons of a bitches of the demon race’s staring at me?!” His words had attracted the angry gazes from the demon race in our surroundings.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-4","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
