{"id":48495,"no":213,"title":"Volume 9: Chapter 6 - Earth Bear","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter 6 - Earth Bear\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said sheepishly, “It seems that I can’t keep any secrets from you. There’s only one S ranked demon beast that is tamed. It is the Dark Demon Dragon that serves as the mount of the Demon Emperor.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dark Demon Dragon?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied seriously, “Yes, my Royal Father’s Dark Demon Dragon is almost impeccable in the demon race. It is also one of the main reasons why the Mo Clan can secure its position as Emperor.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri asked curiously, “Is the Dark Demon Dragon that powerful?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He respectfully nodded his head. “The Dark Demon Dragon is the highest Ranked Demon beast. It’s about hundred metres long, and definitely possesses the power to destroy the heaven and Earth. It is also absolutely loyal to my Royal Father, and has a special ability to sense danger. If anyone wants to threaten the Demon Emperor, they must pass through him. The beastmen had tried to assassinate my Royal Father a hundred times in the last 20 years, but no one has been able to successfully pass by it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked, “If the Dark Demon Dragon is compared with other real dragons, will its power be slightly stronger?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He scratched his head and replied, “I’m unsure about that as I haven’t seen a dragon before. However, I estimate that even if a real dragon wants to deal with it, it’s quite impossible. I have seen it use his powers once. The entire Capital City was enclosed in total darkness that time; the scene was really terrifying.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked in astonishment, “Ke Lun Duo was able to receive 100 moves from the Demon Emperor?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said, “What you\u0027re thinking is incorrect. When I said 100 moves, it was under the condition that the Demon Dragon didn’t participate, even His Majesty, the Demon Emperor, shouldn’t be able to personally win against his mount.” Since I was too engrossed in this description of the demon dragon, I didn’t notice that he just said Demon Emperor, rather than Royal Father.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ground suddenly gave out \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Long\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e! \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eLong\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e!’ sounded at that moment. Dong Ri said, “Quickly, look back!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI focused, and looked behind me. The dust on the pathway we just passed, had all the dust surging from it. Even though the speed wasn’t fast, its power was really shocking. As it continued to near, it unexpectedly revealed a large group of heavy armoured werebears. One of the bears raised the heavy spears in his hand and the rest immediately formed into two groups, rapidly enclosing us from both sides. It was already too late for us to try and escape.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It looks like this group of black bears are here to seek revenge.” Zhan Hu said in fumes as he tried to charge over.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI held him back and said, “Big Brother, don’t be in such a rush. Let’s wait and see what enfolds, so we’d know what they plan on doing.” Even though these werebears had strong offensive and defensive powers, with our strength, it wouldn’t be difficult to break through the enclosement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He whispered to me, “Those are the Earth Bear Wallace’s 500 personal guards. You must protect me.” After that, he scurried off and hid at the back of the team.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e Earth Bear Wallace was about four metres tall. His body was robust and was solitarily walking over. He asked, “Who was the hero that had just wounded my subordinate?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu moved in a flash in front of him and said, “It’s me so what? Are you here for revenge? Come at me then!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace replied, “I’m not here for revenge. It’s just that I had heard about the fight from my subordinate brothers. It made me really impressed, so I want to have a spar with you.” Zhan Hu was stunned and thought, ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhy is this black bear so polite\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e?’ It was actually his power that had won the opponent’s respect.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied icily, “Aren’t we still going to fight? You think that if you bring such a large troop, we’ll be scared of you? Come on, let me be enlightened about the power of you Earth bears.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace replied in shock, “So you have heard of my name. I brought my brothers so that after we spar, we can directly head back to the Mist Martial empire. There’s no other motives. The purpose of coming to the Radiant Light was to be an envoy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI walked over and said, “It was your subordinate that first provoked us. General, please don’t bother us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace replied, “It can’t be said that I’m bothering you. I just want to have a spar with that brother. We’re all martial people so it’s too hard to find an opponent.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri said smilingly, “How’s there no opponent. You can find your Beamon King for a spar.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace’s expression changed and he replied embarrassedly, “That fellow is too frightening and I still want to live for a few more years. He is currently itching for me to ask for a spar with him.” His frank attitude had resulted in us gaining good impressions towards him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied, “Since that’s the case, let’s do it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI transmitted to Zhan Hu, “Big Brother, that fellow specializes in Earth magic. Be careful of the ground.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu slightly nodded and unsheathed the long sword on his back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe surrounding subordinates of Wallace raised their spears and roared thrice. I didn’t know what they meant. Wallace said, “The spear weighs 99 kilograms and is called Cold Grace.” I didn’t expect him to actually name his heavy spear. Wallace swung the spear in his hand, and a powerful aura spread throughout his surroundings. Zhan Hu’s expression became serious as he obviously met his match today. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace roared loudly and brandished his heavy spear. He kicked off on both legs and rapidly moved in a flash to appear at the right side of Zhan Hu before he shouted, “Watch the spear!” His astonishing speed shocked all of us. Zhan Hu panickedly dodged that spear and leaped into the air, producing sword images that filled the entire sky. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Si! Si!’ \u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003eHis battle spirit burst forth like thousands of gold lines striking towards Wallace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace swiped his heavy spear onto the ground and exclaimed, “Good move! Earth Shield!” An earth wall was erected from the ground, following his heavy spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Pu\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e!\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePu\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e!’ sounds continuously echoed. When Wallace’s wall shattered, Big Brother Zhan Hu’s attack also ended. I felt that it was really strange as to why Zhan Hu didn’t use his speciality, to move behind his opponent to deal with him. After that, Zhan Hu explained that if he wanted his opponent to concede, the best way was to defeat his opponent’s strong points.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace said. “Good skills, I almost couldn’t withstand that move.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu shouted, “ Stop bullshiting and receive my attack. Amber Crystal Slash!” Zhan Hu’s blade pointed downwards and he slowly lifted his sword up. The surrounding airflow continuously gathered around him and caused his sword to turn sparkling and translucent. The sword blade increasingly became larger with the unceasing insertion of battle spirit within it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace’s gaze turned abnormally serious and chanted, “\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eGreat Earth God, please lend your powers to your loyal believer to use the mightiest power to eliminate the enemy before me---Tyrant Bear Realm\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e!” I knew that this wasn’t magic but something that combined magic with martial techniques. He raised the heavy spear and the fur of his body was raised. A Earthy yellow light ray shone at the tip of the spear, gradually forming a large ball of light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy the time Zhan Hu raised the sword above his head, Wallace had finished gathering his fusion of magic and battle spirit attack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-6","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
