{"id":48496,"no":214,"title":"Volume 9: Chapter 7 - The Demon Race\u0027s \"Gourmet Food\"","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter 7 - The Demon Race\u0027s \"Gourmet Food\"\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two of them glared at each other as they cast out the power gathered. A yellow light, and an enormous transparent light blade with a dazzling golden light radiance collided in mid air. All of the powers seemed to have converged at one point, making it seem as though time had stopped for a split second.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe immense power exploded with that point as its center. Zhan Hu and Wallace were blown away from the impact of the incomparably formidable power. I yelled, “Be careful!”, as I cast a \u0026nbsp;defensive light barrier in front of everyone to protect them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a moment of intense shaking, the ground calmed down. The explosion of the immense powers caused an enormous crater to form. Zhan Hu and Wallace were individually crouching at the edges of the crater, panting heavily. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe werebear soldiers in the surrounding area were rocking unsteadily from side to side, with the collision causing dirt to cover them due to the strong destructive power..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was a fanatical look in Su He’s eyes who was standing behind us. He was obviously deeply captivated by this competition of strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace broke out in laughter before he said, “That was really delightful. I have never been this satisfied before.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied smilingly, “Are we still continuing the fight?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace shook his head. “I’ve had enough. I never expected that your demon race really had experts reaching through the clouds. It can’t be that I wouldn’t figure out you were holding back your strength right? If there’s a chance in the future, you should have a spar with my Beamon Boss. He will definitely be extremely excited.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace’s sanguine response had made Zhan Hu’s good feelings towards him increase. He forthrightly replied, “Alright! If I’ve the chance, I’ll definitely want to be enlightened by the power of the Beamon King.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWallace cupped one fist in the palm of his other hand and said, “Brother, I\u0027m sure we\u0027ll meet again some day. My comrades, let’s go.” After saying that, he turned around and walked away with large strides, quick like a shooting star.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI walked over to Zhan Hu and said, “He’s quite an interesting fellow.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied in smiles, “That’s right. His straightforwardness is really adorable. With him as my opponent, it makes me feel a lot less lonesome.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri, Jian Shan, and the other villages that came from the God’s village expressed respectful looks. Zhan Hu replied, “Stop looking at me like that. You’re giving me goosebumps. There aren’t any of you weaker than that bear.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said, “Wah! Boss, I really worship you. My reverence to you is like an unending torrential river.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu scolded mockingly, “If you could add your flattering skills into your cultivation, you would have been an expert by now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied, “I….I..I.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, “Stop saying I,and prepare to continue moving on.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He was startled, and asked, “Doesn’t Big Brother Zhan Hu need to take a break? Why are we moving out so quickly?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied smilingly, “You belittle Big brother Zhan Hu too much. He should at most have warmed up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu smiled, and said, “Zhang Gong can always understand me. Brothers, let\u0027s go! It’s time to embark on our journey again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter two days, we tasted the demon race’s delicacies for the very first time, and understood why Mu Zi, and currently Su He loved to eat the human race’s food so much. The food of the demon race is generally just meat. The restaurant we were eating at was the local’s highest grade restaurant. The food they made had a fishy urine smell and when we ate it, it was so dry and bony, making everyone spit it out. Finally, we resorted to the food we brought to fill our stomachs.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said mockingly, “Brother, now you should know the pain of our demon race.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI didn’t have to time to care about his sarcasm; I was calculating how long the food I brought would last. “Could it be that the demon race has no vegetables or fruits?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He’s expression dampened. “Most of the demon race’s lands are extremely infertile. We could only grow some pastures so usually we just rear demon beasts for food. As for these vegetables and fruits you mentioned, I’ve never heard of it. The Demon Emperor’s place may have it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe looked at each other after we heard what he said, the demon race’s life was so tough. I sighed, “So your life here is so harsh. If the entire world could remain in harmony, we could use your demon beast to exchange for food.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He’s eyes lit up and said, “Do you mean what you said? If that was the case, it would be great.” After he said that, he shook his head and sighed before saying, “I know that won’t be possible. Firstly, you can’t make the decision for the human race, and I can’t make the decision for the demon race. There is also a thousand years of hatred between the demon and human race. It won’t be that easy to mend their relationship.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI looked fixedly and said, “I don’t think you’re a useless prince, but rather a person that can govern with deep plans and distant thoughts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He seemed to realize that he said the wrong things and hastily corrected himself, “It was just a moment of being rueful. You should think about it. Who doesn’t wish to have a peaceful, and stable scenario? It’s for the best that the world is in harmony, especially for people like me. We can play with the human race, and have good food, right? Hehe!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had exposed his true colours. The good impression of him I previously had for him \u0026nbsp;immediately dissipated. I grabbed onto Sukrad’s staff and snappily said, “Forget it. I’ll just be wasting my spittle to talk to such a person as yourself. Let’s go! It’s time to make our move.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He chuckled, but \u0026nbsp;he just wordlessly stood up and left the restaurant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs I walked, I told everyone, “From now on, we’ve to cut down on our food. If not, we’ll have to eat that demon race’s food.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu chuckled and replied, “No need for that. The food they made was awful only, because their cooking techniques are too terrible.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied in amazement, “Big Brother, it can’t be that you know how to cook, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu puffed out his chest, and said, “What? You don’t believe me? Have you forgotten what I used to do? As bandits, which one of us lack survival skills? You just have to wait and see what I can do for the next meal. However, the task to capture the demon beast…..”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan shouted, without waiting for me to reply, “I..I..I! If you really know how to cook, I’ll definitely catch it for you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI turned my head to Su He and asked, “Are there any wild demon beasts?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He nodded. “There are definitely some in the large mountain forests, but they are rather fierce. Naturally, they’re nothing when compared to you guys though.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI looked at the map, and replied, “We’ll set this mountain forest area as our destination. This is to secure our food source. Big brother, I’ll have to rely on you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied, “Stop worrying! Brother, you should be careful not to bite your tongue at that time instead.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-7","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
