{"id":48499,"no":217,"title":"Volume 9: Chapter 10 - Delicious Barbecue","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter\u0026nbsp;10 - Delicious Barbecue\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, “Big brother, stop boasting and start cooking, let everyone have a taste of your cooking skills.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu lifted the demon wolf and walked to the riverside. He withdrew his long sword from his back before he rid the Demon wolf of its fur and internal organs in a few smooth moves. He said to Dong Ri, “We’ll need a fire, so go and collect some twigs for kindling.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI walked over and asked, “\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWah!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Big brother, you can’t be planning to directly roast it right? It won’t be any different from the way the demon race cooks it then.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu just chuckled mysteriously before he replied, “You just have to wait for the food to be ready for consumption.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter we lit up a bonfire, Zhan Hu used a thick tree branch to pierce through the Demon wolf’s meat before taking out a bottle and pouring its contents onto it. He was being extremely cautious; it was as though he was afraid of wasting it. I caught a faint alcoholic smell from the bottle. After finishing his job, he took out several other bottles and jars from his bag. He specifically used some of the powder from four or five of the bottles. After he poured some viscous watery substance from one of the larger containers, he used his hands to mix it up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked, “What are these?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied, “You only know how to eat. These are seasonings. During this long distance journey, I had purposely prepared all these before we headed out. You’re all in for a treat as these seasonings were made with my secret recipe; so it’s impossible to buy it from anywhere.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile he was saying that, he used a small brush to coat the Demon wolf’s meat with seasonings. Afterwards, he placed the meat on top of the bonfire to roast it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a short period of time, strong fragrance assailed our noses, arousing everyone’s appetite. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He couldn’t hold back from asking, “How did you remove the fishy scent from this meat? The fishy scent of a demon wolf’s meat is usually very pungent.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu complacently laughed and replied, “It’s my secret recipe, how can I tell you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He interest dampened before he resentfully sat beside him, trying to figure out how Zhan Hu had done it. I had some ideas as to why there wasn’t any fishy smell. I figured that it must have had something to do with that wine; it must not have been an ordinary wine, as the alcoholic scent wasn’t very strong.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a short while, the Demon wolf’s meat had completely turned golden yellow. The Demon Fox in my embrace called out. I mockingly scolded her, “Why are you so anxious? How can we not give you a portion as well?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu brandished his long sword to cut a piece of the meat. After looking at it, he said, “Alright! Everyone, it’s time to eat it now. Serve yourselves.” With regards to the speed of snatching food, who could be faster than me? A light shone from my hand, making a large piece of meat fly over. I had picked the thigh of the demon wolf. The demon fox excited called out. I tore a portion of the meat and placed it into her mouth. “You can eat it wherever you want.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe demon fox ran to the side. I couldn’t wait any longer to have a taste of the meat. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWah\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e! I ate it with relish. The outer layer of the meat was charred and filled with grease. When I bit into it, the meat was charred on the outside, but was very tender on the inside. It was extremely delicious. It was definitely comparable to the food at Ascending Tide restaurant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe entire demon had disappeared into the mouths of a pack of wolves.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He walked over to me with grief and indignation across his face as he said pitifully, “Lord Zhang Gong, they all bullied me. I was only able to get a small piece of meat which was of the rear end of the Demon wolf.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI broke into laughter after hearing what he said before I replied, “Why were you so slow? Serves you right.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He replied pouting, “You’re all experts that only know how to bully the weak.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu walked over and said, “You’re the second prince of the Demon race. How are you weak?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He said angrily, “\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHmph\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e! If you don’t let me have my fill, even if it means my death, I will not continue to lead the way.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI stared at him in amazement. I never imagined that for food, he would toss his principles aside. I threw him some rations from the spatial pocket and turned to face Zhan Hu before saying, “Big brother, your skill in roasting meat is just too superior. If you don’t become a chef, it’ll be a pity.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, the demon fox had finished her portion. It was obvious that she hadn’t had enough as she ran to Zhan Hu’s side and rubbed up against him. Zhan Hu mockingly berated her, “You stupid fox, what are you up to? You still want to eat? You just have to get something larger next time.” The demon fox adorable eyes lit up; she apparently thought that it was a good idea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI looked up to see the time of day before saying, “Let’s go. We’ll continue to move forward before resting.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the sky gradually darkened, I looked at the map and thought, ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWe still have a rather long way to go to get to Capital City. If we continue at this pace, it’ll be too slow.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI told Zhan Hu, “Big brother, I think we should increase our speed, bringing that brat along has really slowed us down.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied smilingly, “What should we do? Kill him?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI whispered, “Stop fooling around. In any case, he’s still my wife’s brother, so we have to keep him alive. Moreover, killing him will increase the grudges the demon race have toward us to the point that our relationship won’t be possible to mend. How about this? We’ll rest up well today. Starting from tomorrow, we’ll start to fly at unmanned places. Someone will carry him for a while. What do you think?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu nodded. “We can only do it that way then since it’ll be quicker.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He walked over to me and said, “Zhang Gong, can you give me something to eat? I’m hungry again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI chuckled and replied, “Except for eating, what else can you do?” He pouted at the demon fox on my shoulder. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSwish!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ The demon fox moved and leapt out. Su He shouted, “My small treasure, please find something larger this time.” He was afraid that he wouldn’t have a portion again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe demon fox sniffed in the forest in front of us before looking back at us. A sign of craftyness flashed in her eyes before a fishy urine smell gradually permeated out from her body again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn a short moment, when we were about to hunt our food, we suddenly felt an immense pressure coming from the depth of the forest. I looked at Zhan Hu in astonishment. What was this demon beast that could emit a pressure that could affect us?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu He yelled, “Not good, this is definitely a demon beast that is at least A ranked. We really met a big boss this time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe demon fox rapidly ran back before she leapt on me, with her little body still shaking. I asked her, “What did you lure over?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe demon fox chirped out twice at me. When I wanted to ask her to transform, \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Ka! Ka!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ sounds of trees being crushed sounded out from the forest. As I shouted, “Everyone, get ready!”, I took out the Sukrad’s staff.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe forest in front of us was suddenly blown apart. A cyclops\u0026nbsp;appeared with an enormous tree trunk in his hand. He was about 15 meters tall. He looked left and right, as though he was looking for something. When his gaze landed on the Demon Fox on my shoulder, he roared before dashing towards me. The sound of his footsteps on the ground had given off loud ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHong! Hong\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e!’ sounds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-9\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-11\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-10","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
