{"id":48503,"no":221,"title":"Volume 9: Chapter 14 - Xiao Jin Returns","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter\u0026nbsp;14 - Xiao Jin\u0026nbsp;Returns\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI dejectedly looked at the demon fox on my shoulder. “It seems that I won’t be able to bring you along in the future. If I’d paid more attention, perhaps everything that happened \u0026nbsp;wouldn’t have happened.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Lun Duo said, “Zhang Gong, you all should \u0026nbsp;just surrender. I’ll plead mercy for you in front of His Majesty.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI clenched my teeth and said, “Ke Lun Duo, stop being a hypocrite! Currently, I just want to eat your meat, and peel your skin off.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Lun Duo helplessly smiled, and pointed at Zhan Hu, and Dong Ri, who had both fainted. “It can’t be that you don’t care about their life, right? I captured them so as to avoid unnecessary injuries.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI took in a deep breath and viciously glared at him. With my heart overflowing with hatred, I shouted, “Big brother Zhan Hu, Dong Ri, and the God’s village brother, I hate to cause trouble for you. Demon Emperor, I want to challenge you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon King said astonished, “You want to challenge me in this situation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI coldly said, “That’s right! Do you dare \u0026nbsp;accept my challenge? If you win, everyone of us will surrender unconditionally. If you lose, you’re to let us go.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor chuckled. “Human, you really are outstanding. I don’t know how long it has \u0026nbsp;been since someone has challenged me. Alright! I’ll accept.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Lun Duo anxiously said, “Your Majesty, I think it’s better that I do it. You’re too invaluable to do this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shouted, “You don’t have the qualification.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor replied, “Brat, I really want to see the capabilities that enable you to be this savage. Ke Lun Duo, you’re to command your subordinates to move back. I want to be enlightened on this human’s skills.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, “Alright! You’re worthy to be the demon race’s King. I, Zhang Gong Wei, will be enlightened by the skills that the demon race’s top expert possesses.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor asked in astonishment, “Zhang Gong Wei, you’re the human’s Magister, Zhang Gong Wei that \u0026nbsp;killed a few hundred of the demon race’s experts in Aixia?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI stopped caring already and arrogantly nodded saying, “That’s right! It was me. You want to seek vengeance for your subordinate? Come at me then.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the aura that the Demon King emitted, I knew I was not his match. If Big brother Zhan Hu, and Dong Ri were here, with the power of three of us, we should be able to fight against him; that was still under the condition that the Dark Demon Dragon didn’t participate. No matter what, I’ve got to give it my all. At the very least, if I lose, everyone should just be detained, and wouldn’t be in any mortal danger temporarily.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon King’s surrounding aura started to become violent. A black halo was emitted from his body. With a sneer on his face, he stepped forward and heavily punched out. The circular dark energy spiraled as it headed towards me. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI calmed down, and circulated the three gold dans in my body. I hollered as I struck out a light blade filled with power. When the light blade and the dark energy collided, I was rebounded by it, and pushed 10 steps back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor’s eyes showed surprise as he said, “Good, kid since you’re able to receive my punch, you’re qualified to be my opponent.” Just as he wanted to continue to attack, \u0026nbsp;a loud dragon roar sounded in the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wiped the blood traces from the corner of my mouth. That sound was really familiar. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eAh!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e It was Xiao Jin. Xiao Jin had come over at the most critical point.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shouted, filled with feelings, “Xiao Jin!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was suddenly an enormous gold light ray that appeared in the sky; it was as bright as the sun as it charged towards us. The Demon Emperor was so shocked that he forgot to attack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon in the sky let out a low roar, emitting black fog throughout its body before it suddenly charged towards the gold light ray.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the gold and dark light ray collided. There was the sound of tearing in the sky. The gold light had been forced back by the black light; it was obvious that it was at a large disadvantage. The violent energy from the collision had caused the troops to lean unsteadily from side to side. The Demon Emperor shouted, “Ke Lun Duo, quickly command the entire Radiant protectors to retreat 5 Km from here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the gold light dimmed, it revealed Xiao Jin’s familiar appearance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was finally able to see some hope in this impasse. I was elated as Xiao Jin was much bigger than before. His body was more than 99 metres and the scales on his body were much larger; his entire body emitted the aura of a king.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon suddenly spoke in human language, “Five Clawed dragon?D Could it be that you’re this generation’s Dragon King? That old fellow died already?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Jin also spoke in a youthful voice, “You’re the one that’s dead. My father is still living perfectly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon sighed, “Child, do you know that I’m your uncle……”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the two dragons were conversing in the sky, the Demon Emperor and I didn’t dally. The Demon Emperor said, “You also have a dragon? Not bad, it seems that we can really have a fun match. Since we both have dragons, let’s mount them and fight.” His words suited my desires. I nodded before I forced my powers to surge outwards and instantly leapt up. The Demon Emperor followed behind as he also left the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe individually landed on Xiao Jin and the Dark Demon Dragon’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Xiao Jin and the Dark Demon Dragon conversed, \u0026nbsp;he saw me heading towards him, he conveyed a warm state of mind towards me. As I stood on his large head and held on one of his horns, I asked, “Xiao Jin, how are you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Jin replied, “Master, I’m doing well. I had already recovered the true dragon’s power.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon replied, “A five clawed dragon can also have a master?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Jin replied in anger, “Why can’t I? Didn’t you also betray our dragon clan to be a mount for the Demon Emperor?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon unexpectedly wasn’t enraged. He heavily sighed, “Child, do you think that I’ve betrayed the dragon clan? It was those fellows that forced me to. Initially………”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor seemed to really respect the Dark Demon Dragon and didn’t stop him from talking but rather just quietly listened.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI, wouldn’t interrupt them either as I wanted to quickly recover the injuries I got from that last exchange.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Initially, your father and I were born at the same time. The entire clan was extremely elated, as we were the first twin dragons with five claws in the history of the dragon clan. When we were born, we looked identical.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen I paid attention and looked, the Dark Demon Dragon also had five claws and looked very similar to Xiao Jin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Demon Dragon continued to say, “However, 20 years after, our looks gradually became different. The main changes were the dragon scales on our body; your father’s scales become increasingly golden while mine gradually turned black. Initially, the clan didn’t have any response. When we grew out of infancy, I came to have my current looks, but was much smaller. The clan’s men started to reject me as they all said that black dragons were bad omens that would bring misfortune to the dragon clan. They unanimously pleaded to the Dragon King at that time, who was your grandfather and my father, to kill me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-13\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-15\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-14","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
