{"id":48524,"no":242,"title":"Volume 9: Chapter 35 - Returning to the Firewood House","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter 35 - Returning to the Firewood House\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu frowned as he checked his body’s condition. After a while, his expression grew relaxed before excitedly saying, “My power’s back, even though it’s only at 30%. After training for a while I’ll definitely be able to make a full recovery.” The others examining their own conditions felt the same way .\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI suddenly became happy. “That’s great.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan said, “Big Brother Zhang Gong, what’s happened to you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy mood instantly dampened as I started to tell them the events that befell me. When everyone heard I was disfigured due to the affliction of the dark elements, they all had the same reaction. They were all simultaneously enraged without knowing the details beforehand, and expressed concern towards me. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu grabbed on my shoulder and said bitterly, “Zhang Gong, it must have been hard for you. You still saved us under such conditions. Your big brother’s life is truly yours from now on.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied with emotion, “Big brother, don’t you ever say such words, as I was the one who almost led you to your death. Saving all of you is something that I had to do.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood voice rang out out from behind me. “Zhang Gong, we should head back . Even though there’s enough firewood, if we were to go missing for too long, it’ll definitely arouse their suspicion.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI hastily made introductions, “This is Uncle Firewood, he helped me rescue everyone here.” When I introduced Uncle Firewood, I didn’t reveal his identity and just said that he was an eccentric person who was hiding in the Demon race. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu and the rest immediately bowed, thanking him for saving their lives.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood looked at them and smiled. “You really are young heroes. I didn’t have your level of power when I was the same age as you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “If there’s a chance in the future, we may need your tutelage.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood replied, “There’s not enough time. Let’s leave your friends here to recuperate and head back. When there’s a chance, we’ll get your divine weapons back.” The divine instruments were extremely important to us all, especially Sukrad’s staff.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded and said to Zhan Hu, “Big brother, you and the others can stay here to recuperate. There’s a hole there. If there’s any danger, you can hide in there and cover the hole with the enormous rock. I’ll meet you here in 10 days time, with or without the the divine weapons.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu nodded, “Relax, once we recover our strength, there won’t be anything to be afraid of. You have to be careful in whatever you do. If you find that it’s impossible to carry on with recovering our divine instruments, quickly come back here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter bidding everyone farewell, my heart felt lighter. With the exception of myself, there wouldn’t be anyone that would be harmed in this trip.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood asked, “Will that escape scroll work?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “It can work, but we must be 5 km from the designated location. Once we’re 5 km away from the kitchen, we can teleport there.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s great, we can use it once we enter the city. I hope they won’t suspect us because of our absence for the entire day,”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It shouldn’t, as when we left we placed the wood required today in front of the door. Moreover, after so many things happened, who will be in the mood to eat?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe security of the city’s entrance was extremely tight. There were patrolling soldiers even outside the city. I drew a simple teleportation spell on the ground, successfully sending Uncle Firewood and I into the city. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnce we entered the city, I immediately used the escape scroll, returning us to the toilet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe pinched our noses and walked into the kitchen. A Head Chef walked over and asked Uncle Firewood, “Old Firewood, where have you been all day?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood responded with deception, “I’m extremely unwell today, so I’ve been resting in the room.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Head Chef was rather unobservant, as he didn’t even notice that we were covered in dust. He replied excitedly, “Did you know something major happened today? The criminals that attempted to assasinate His Majesty have escaped.”　　\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood feigned shock, “What? There’s someone in the world who can rescue those criminals. Who could’ve done that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Head Chef replied, “I heard that it was done by two people. I also don’t know what the Royal Protectors are doing. They weren’t even able to catch a glimpse of the criminals. I heard that the two people used forbidden spells, and also had the help of a dragon. It couldn\u0027t be you two, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood and I were greatly alarmed. I immediately gathered fusion powers into my hand, surveying the surroundings intently in preparation for an ambush.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile we were bewildered, the Head Chef suddenly burst into a laughter. “Don’t be frightened. With you two, one old and the other crippled, what could you do? I was kidding.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe then heaved a sigh of relief, and secretly cursed him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood replied, “Head Chef, you can’t say such things so casually. If the royal guards were to capture us, who’ll split logs for you then.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Head Chef laughed, “The two of you go and split the logs. I’ll return to my cooking.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLittle did he know that it was really us, an old man and a cripple, that had turned the world upside down in the Demon’s city. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen I saw him walk away, I wiped the perspiration from my forehead. After seeing that no one was close, I whispered to Uncle Firewood, “It seems we\u0027ve crossed the final hurdle.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood and I had already recovered to our peak state in a day’s time. After finishing a hard day’s work, the horizon brightened with pale sunset hues of red and orange playing across the clouds. The sight was mesmerising.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood came to my side and sighed. “Wouldn’t an endless sunset be wonderful. However, a part of the beauty in the sunset is that \u0026nbsp;it only appears in the evening.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI smiled and replied, “How can you be old? The Demon race still need you as its towering pillar.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood shook his head gently. “No matter what form of life, there’ll always be an end. I have thought it through already. Even if I were to die at such an age, it can’t be counted as dying prematurely, but I must die at my appointed place.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile listening to him, I suddenly felt an uneasy premonition come over me. Uncle Firewood was an elder who was worthy of my admiration and respect. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood replied, “Let’s stop talking about this. My powers have already made a full recovery. Let’s make our preparations to retrieve the divine instruments.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eActually, retrieving the divine instruments was just an excuse. The real motive was a hope to see Mu Zi a few more times. Even though I said that I wanted to part with her, I had left my heart at her side. When my memory touched on Mu Zi’s lovely appearance, I couldn’t help but be hurt and feeling a heart-rending pain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Uncle Firewood saw that my face had suddenly paled, he asked, “What’s wrong? It can’t be your old wounds are acting up, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI just looked at him hopelessly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-34\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-36\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-35","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
