{"id":48526,"no":244,"title":"Volume 9: Chapter 37 - The Demon Emperor\u0027s Bitterness","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 9: Chapter 37 - The Demon Emperor\u0027s Bitterness\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor went deep into thought.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a long time, he replied, “Can it be that it’s real?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied, “Of course, it’s real. It’s undeniable as I’ve personally fought against the Monster race once.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Do you have any evidence?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Even though I currently don’t have any, there definitely will be. If Your Majesty doesn’t prepare for the changes now, once the Monster King resurrects, the very first race that he’ll invade will be your Demon race. It can’t be that you don’t care for your citizens?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood knew that the Demon Emperor wasn’t listening. “Qi Meng, if you still don’t believe me, I don’t have any other means of persuasion but I do hope that you’ll let Zhang Gong and his friends go. You can deal with uncle anyway you like.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA cold gaze fell upon me as the Demon Emperor looked at me. He then said icily, “Zhang Gong, even if uncle hadn\u0027t interceded on your behalf, I’d still have let you go. Do you know why?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked, cluelessly, “Why?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s for my most beloved daughter. I didn’t expect that you’d have such a tenacious life and unexpectedly survive, but had resulted in your disfiguring. I admit that it was due to my carelessness at that time when I allowed the dark powers to invade your body. I was almost killed by my daughter in her fury.” After a short pause, his gaze became benevolent as he continued, “If I were to kill you again, I’m afraid that I’ll lose her.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy feelings got the better of me and I blurted out, “Mu Zi?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor nodded. “I’ll believe you for now, but it isn’t due to what you have said. It’s due to my trust in uncle and faith in Mu Zi’s sight. You can go now, but you must find the evidence of an invasion by the Monster race.” Such an unexpected opportunity had presented itself that made me momentarily stupefied with happiness. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood said with tears, “Your Majesty, thank you.” Upon saying that, he began to get on his knees facing the Demon Emperor. 　　\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor quickly went to pull Uncle Firewood up. “Uncle, don’t you ever do that towards me. In front of you, I’ll always be the rash Qi Meng. Zhang Gong, I can let you go, but I’ve a condition.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI calmed myself and said, “Please state it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor said in smiles, “I want to dispatch two people to follow you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI frowned. “Is it to monitor my actions?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor replied loftily, “Of course, do you think I’ll let you go freely?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who are you going to dispatch?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor replied, “Ke Lun Duo and Mu Zi.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy heart lept to my throat as I cried out involuntarily, “Why?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor replied, “My purpose in doing this is to make Mu Zi clearly see your unsightly appearance and feel the disparity between you and Ke Lun Duo, making her to completely give up on you. Moreover, with Mu Zi around you won’t have any opportunity to plot or scheme.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI immediately said, “I swear that I definitely don’t have any sinister plots and you can just dispatch Ke Lun Duo to follow me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI wouldn’t know what to do if I were to face Mu Zi on a daily basis. But deep within my heart, I felt a small surge of joy. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor snorted coldly, “Is that something that you can decide? Moreover, it’s Mu Zi’s wish. You aren’t willing to see her again?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was willing, ten thousand times willing, but I had finally made my decision with great difficulty. With this move, all I had done would be wasted. If Mu Zi were to leave me due to my unsightly appearance, I didn’t know if I would be able to handle it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor said, “That’s decided then. Wait a moment.” After saying that, he went into the armory in a flash.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor took out a stack of weapons quickly. My Sukrad’s staff was surprisingly within that pile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor tossed the weapons towards me. I hastily opened my space pocket to keep them, excluding Sukrad’s staff.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor coldly said, “If you were to expose this matter, \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ehmph!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e You should know what will happen.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI contained my excited heart and said, “Your Majesty, I can accept your condition, but I’ve also another condition that I hope that you will accept. It will be beneficial to both sides.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor frowned. “You dare set a condition? Don’t forget that you little life is in my hands.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied with a smile, “I have already said that this condition will be beneficial to the both of us. I believe that you will definitely accept it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor’s eyes gave off an frosty gaze. Even though I looked calm, I was actually scared. If I were to enrage him, I wouldn’t have any chance at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Speak.” When I heard that word, I heaved a sigh of relief.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI tried my best to maintain a calm appearance. Suddenly, I felt the gentle caress of a cool breeze, helping me clear my mind. I stated my condition, “I hope that His Majesty will temporarily stop plans to attack the human race while I find evidence of the Monster race’s invasion.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor wasn’t angered as I thought he would. He just calmly said, “Why?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI replied evenly, “It’s for the benefit of both sides. Think about it, if the Demon and Beast races were to have a great war against the human race, it’ll definitely lead to the increase in hatred between races. Even if I were to find evidence of the Monster race’s invasion, do you think that your race can still be able to ally with the Human race to fight against Monster race? Moreover, if war were to break out, there’ll definitely be casualties and the depletion of resources. The fewer the resources you possess, the greater the disadvantage you will have against the Monster King. Currently, the most important matter is for us to be able to live in this world.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor looked at me silently. I knew that he was thinking it through.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUncle Firewood said, “Your Majesty, what Zhang Gong said is correct. There is no need for unnecessary sacrifices.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor replied, “Zhang Gong Wei, do you know how many rations are consumed daily at the camp for my Demon race’s great army at the frontline and how many resources are used?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was startled as I didn’t know that he would say such words, but was happy as I knew that there was a chance of this matter could be resolved. I thought for a moment and said, “I’m not sure about that, but the consumption for a million soldiers will definitely be enormous.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Demon Emperor suddenly sighed and looked up at the moon. His current appearance was like a benevolent senior, rather than the imposing ruler of the western continent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The land of my Demon race is barren so it can only produce some Demon beasts and ore. I can only rear Demon beasts as a means for survival. The Beast race’s ground is slightly better, but they can only plant the meanest of grains. Our races have already prepared for a hundred years to fight against the Human race and gather enough resources to support the army. Every day you ask me to wait, the great army at the frontlines will have consumed a month’s worth of resources from the Empire. Waiting for a month, would be equivalent to two years of resources to the Empire. Do you think that my Demon race naturally loves to invade? It’s because we don’t have any alternative for our survival. Even though your conditions are tempting and are morally right, I can’t accept it. I’ll commence a full scale war against the human race with the combined forces of the Beast race from the Valiant Mist Empire soon. I must start the war so as to have ample resources to sustain it.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-36\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-9-chapter-38\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-9-chapter-37","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
