{"id":48549,"no":267,"title":"Volume 10: Chapter 13 - The Prince Returns Home","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 10: Chapter\u0026nbsp;13 - The Prince Returns Home\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe four warriors surrounded me before simultaneously bowing. The leader of the warriors said, “Thank you for saving our Miss. Please accept this bow from us brothers.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI gently waved Sukrad’s staff, that was covered with some cloth, as I replied smiling, “Friends, no need to be so courteous.” A faint light was emitted from the cloth that forcefully lifted them from their bowed position. The leader asked in awe, “May I ask which division in the Kingdom of Aixia you’re in? With your magic, you should be a Magister.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithout waiting for a reply, the girl said, “I’m \u003c/span\u003e\u003cspan style\u003d\"\"\u003eLing Ling Xin. Who are you and can you let me see your face?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shook my head. “That won’t be necessary. We met by accident so why should we know each other’s identity? Let us meet again in the future.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLing Ling Xin suddenly appeared before me, extending her hand to remove my conical hat. The few warriors shouted in unison, “Don’t do that Miss!” But how could the willful Miss listen? She stubbornly charged towards me. It seemed that she didn’t learn from her mistake and didn’t know the immensity of heaven and earth. An invisible, transparent boundary appeared in front of me. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ \u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"\"\u003eLing Ling Xin collided with the boundary and fell to the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI laughed and said, “Is that any way to treat your benefactor? I’ll show you my appearance since you want to see it.” As I said, I expanded the boundary, leaving out the four warriors, who thought I was going to hurt their miss.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLing Ling Xin’s previous fall wasn’t light, it took her a lot of effort to sit up and rub her the injured areas.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI moved in front of her and asked, “Didn’t you want to see my appearance? Look carefully then.” Upon saying that, I lifted one side of the muslin in her direction. A mournful screech sounded from her mouth that coupled with my laughter, gave the situation a sinister atmosphere.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Everyone, your Miss has just experienced a slight shock so take care of her. I’ll be leaving.” How could I not punish this crafty and unruly girl a little?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a flash of light, I disappeared from everyone’s sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLing Xin Xin said to herself, “He...He was really ugly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe leader of the warriors sighed. “The person that saved you is an extremely powerful mage. We aren’t his match even if we were to team up against him. Miss, let’s head back quickly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Xin Xin nodded, with unfocused eyes, before following the warriors.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy heart felt a little uneasy as I hid in a corner. Had I overdone it in scaring the girl into such a state?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI no longer felt like strolling after this matter, so I turned around and headed back to the manor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhang Gong, where did you go? I was looking for you.” Once I stepped inside the Prince’s manor, Big Brother Shan Yun came to see me.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You were looking for me? What for?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“For business of course. Father has already declared that my eldest brother and I will be in charge of the Allied Cavalry. He has already returned to His Majesty to discuss what we talked about that day.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI took down the conical hat and replied smiling, “Uncle really is a impetuous person. I feel real bad in making that old man work.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun sighed. “Actually, even though my father didn’t mention it, I know that that old man wants to reconcile. The real warmongers are few in number. Who doesn’t want to live in peace? I’ve heard that your wounds aren’t fully recovered. I’ll help you find some doctors to see if they can cure your wounds.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Thank you Big Brother Shan Yun. However, it’s unnecessary as Big Brother Xiu Si’s Sky God’s horn couldn’t cure my wound. I doubt any average doctor would be able to cure it. I appreciate your good intentions, but I really don’t want to experience any more major disappointments after becoming hopeful again.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun replied, “Alright then. The rest have gone to rest up. You couldn’t have eaten breakfast yet and I also haven\u0027t, so how about us brothers find a place to eat?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI asked, puzzled, “Don’t you need to work today? How do you have time to accompany me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun said, smiling, “It’s unknown why the allied Demon and Beast race retreated 15 Km. Currently, there’s eldest brother to keep watch at the frontlines so naturally, I can relax.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Shan Yun and I enjoyed our meal, I asked, “Big Brother Shan Yun, if your Kingdom of Xiuda agrees to participate in the negotiation, what do you think our next step should be?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun glanced at me from the side before replying with a smile, “Brother, are you testing me? Seeing your behaviour, it seems that you should have a card up your sleeve.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEmbarrassed, I scratched my head. “Even though I’ve got some thoughts on this, I want to hear your opinion first.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun replied, “If His Majesty really agrees to negotiate, the next step we should take is to convince the other two kingdoms. It’ll be extremely easy to convince the Kingdom of Dalu. You should also know that there’s another official name for Dalu.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded and my eyes lit up as Shan Yun and I said simultaneously, “The Peace Kingdom.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun replied, “Since they are a peaceful country, they shouldn’t like fighting. They’ll definitely stand on our side as long as we mediate. In that case, it’ll be easier to convince Aixia, but there’s something that you must settle as soon as possible.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI queried, “What’s the matter?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun’s expression changed as he said, “That is to immediately confirm the attitude of the allied Demon and Beast race forces. As the proverb says, there are times where orders, excluding their ruler’s, won’t be accepted. If the allied army of the Demon and Beast race don’t listen to the Princess and insist on attacking the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress, what will you do then? Won’t everything be in ruin? Thus, before my father returns with the news, you must let Mu Zi to stabilize them. It’s best if we’re able to confirm their views s before the peace talks.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI had really neglected this matter and what Shan Yun said was logical. If the allied army of the Demon and Beast races didn’t listen to their orders to move, what would I do then?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Big Brother Shan Yun, what you’ve said is right. We’ll head there tomorrow since it’s better to settle this matter as soon as possible.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun nodded. “After dinner, I’ll bring you to the Eastern entrance, at that time I could make an excuse to do a patrol to bring you out. You must head back as quickly as you can, as I don’t want what repeat of what previously happened with you killing your way back in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter quickly finishing our meal, I dashed to Ke Lun Duo’s room. That fellow was in a deep slumber as he didn’t notice me, even after walking to his side. How was he an expert?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI gathered a water bullet and instantly shot his face. This was the most efficient way to wake someone up, as I had learned from experiences with my mother.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Lun Duo became alert and jumped down from his bed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s raining! It can’t be! How could there be rain in the room?\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e Ah!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Zhang Gong, why are you here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI suppressed my laughter and replied, “It’s to wake you up, lazy bum, to discuss some business.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-12\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-14\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-10-chapter-13","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
