{"id":48558,"no":276,"title":"Volume 10: Chapter 22 - The Return to the Stronghold","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline\"\u003e\u003cb\u003eVolume 10: Chapter\u0026nbsp;22 - The Return to the Stronghold\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing my resolution, Demon King Xiu Yu had a satisfied expression. Mu Zi also smiled sweetly at me. I already knew that my “Insulation wall” (The invisible wall that insulates the flames of my heart) was already getting increasingly weaker again. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI sighed inwardly before continuing to say, “Your Highness, I’ll have to trouble you to send some people to report this incident to the Demon Emperor. I’ve previously agreed with the Demon Emperor in finding evidences on the Monster race’s existence. The previous battle that you witnessed should be enough to prove that the Monster Race exists, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Yu nodded. “It’s more than sufficient. It’s a pity about Satan. I’ll report honestly about this to His Majesty.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter discussing some of the details with Xiu Yu, we bid our farewells with Xiu Yu and headed back towards \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress, in order to prevent Big Brother Shan Yun from getting too anxious as he waits for us.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese matters took up quite a lot of time as it was already daybreak. Rays from the sun started to gradually appear. Even though we were able to get the Beast and Demon alliance’s cooperation, I was still unable to find myself in a good mood. We had dealt with Jia Si Ke Li Duo, whose cultivation wasn’t at his full peak, with great difficulty. If the Monster King were to come personally, we would have been wiped out. In our current situation, it was a must for me to take the risk of accepting the Radiant God’s inheritance, in order to have sufficient strength to fight against the Monster race. Thinking about that, my mood was extremely sullen.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi flew to my side. “Are you worrying about the Monster race?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi said, “According to what the God King had said, we should still have about 2 more years. During that period, everyone’s power will increase. You also don’t need to be too worried. Don’t we still have quite a lot of assistance? It’s a pity today that we weren’t able to eliminate the Monster that had infiltrated Uncle Satan’s body. Otherwise, we will be able to eliminate one of the right-hand men of the Monster King. Please don’t blame Uncle Xiu Yu for that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I won’t blame him as it’s a natural decision. If I was him, I would have made the same choice. What assistance were you referring to?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi replied, “If everything goes well, it’ll be my royal father, the dragon race, the three human kingdoms, and the allied forces from the Demon and Beast’s Kingdoms. We should be able to fight against the Monster King then. What do you think?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI sighed again. “The God King wasn’t able to do anything about the Monster King. Even though we are only dealing with his clone, the real experts that we can utilise is really insufficient. You should also know that my light magic and divine power is the most effective killing force against the Monster race. I have calculated that there’s only about 20 people that can fight against Jia Si Ke Li Duo. Do you think I still shouldn’t be worried?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi sighed. “Your worries are right so we must hastily settle with the negotiation before we find a place to settle into. We should undergo closed door training for at least a year to improve all of our powers. It’s a shame that I can’t learn light magic. Otherwise, I’ll definitely be able to help you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing her caring so much about me, I couldn’t bear, but say, “I don’t need your help. You just have to protect yourself.” After saying that, I had instantly regretted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs expected, after Mu Zi heard me say that, she moved close to me after a light flashed in her eyes before saying gently, “I will. Didn’t you give me a mage’s robe? I still couldn’t bear to wear it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe words that came out like water that had spilled and couldn’t be taken back. I could only silently accept Mu Zi’s feelings.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFinally, we rushed towards the place that we had previously appointed with Shan Yun before dawn fully arrived. The Earth Dragon Squad was already no longer in view. There was only Big Brother Shan Yun and his aide-de-camp.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Shan Yun saw us, he asked anxiously, “Why did you take so long? I was worried. Is everything alright?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu said, “Second brother, sorry for making you anxious. It can be counted as it being alright. Take a look, aren’t we all back safely? \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eCough! Cough!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Third brother, what’s wrong with you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s nothing. I just suffered slight injuries. Xiu Si had already treated me so it isn’t serious.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun asked curiously, “The fireworks at the Demon’s main camp wasn’t from you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing his query, Zhan Hu chuckled bitterly. “What fireworks? We were in a life and death battle. I was nearly unable to come back to meet up with you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What on earth happened? I thought those were fireworks from the Demons to welcome the princess.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI looked at the sky before saying, “Big Brother Shan Yun, it’s almost dawn. Let’s chat while we head back.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun responded. “Ah! That’s right. Let’s head back. When the patrol was over, I had already made my subordinates to head back first. You must also be tired. Let’s head back before continuing our discussion.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So many things had transpired. It’s no longer a wonder on why you’re came back late.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWe were finally back at the prince’s interim manor. I was extremely tired after a night of stress and tension. I leaned back on the chair as I listened to Zhan Hu relishly narrate what had happened to Shan Yun and the rest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi looked concerned for me before saying, “Everyone must be tired. Let’s rest up first.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Si smiled mysteriously. “That’s right. Let’s hastily have some food before sleeping. I’m dead tired. I’ve used up a lot of energy giving you guys’ treatments.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan said, “You can rest at ease. We’re here for you. I’ll inform you if something happens.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI suddenly thought about something and asked Xiu Si, “Big Brother Xiu Si, you previously mentioned that you brought 500 brothers with you. Where are they now?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Si smiled mysteriously again and whispered into my ear, “They are already camouflaged as peddlers to infiltrate into the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress already. You can be reassured. I’ve a planned signal with them. If anything happens, we’ll be able to swiftly gather them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI said, in smiles, and said yawning “How can I be worried from the way you do things? I’m heading to bed. I’m so tired.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShan Yun said, “You should have some food first.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sun’s rays were so bright that I turned my body and used a blanket to cover my head to carry on dreaming. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly, the door was knocked. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWho is that being so noisy?\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ I said snappily, “The door isn’t locked. Who is it? Just come in.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe door opened. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘It should be Xiu Si and the rest. Forget it, sleep comes first.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSomeone sat directly at the side of my bed. “Zhang Gong, how are you? You’ve slept for an entire day. Why aren’t you up? Do you have any discomforts?” The voice was gentle and familiar. My mind suddenly became lucid. It was Mu Zi’s. As she asked, her small and delicate hand caressed my face, making me feel so comfortable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI immediately got up from my groggy state and hastily sat up. I grabbed onto her hand. “Why are you here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi complained, displeased, “Why can’t I be here? You’ve slept for an entire day. I was worried about you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-21\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-23\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-10-chapter-22","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
