{"id":48568,"no":286,"title":"Volume 10: Chapter 32 - Signing the Pact","content":"\u003cp\u003e\u003cb\u003e\u003cu\u003eVolume 10: Chapter\u0026nbsp;32 - Signing the Pact\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDong Ri smiled. “We’ll only need to delay them for a while. The remaining task will be to see how useful the magic spell that the God King has given us will be.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Si laughed brightly. “Alright, it’s decided then. I’ll now be a foot soldier for our first God’s envoy to arrange for our manpower. The rest should start doing their tasks as well. We must complete our preparations in the shortest time possible. I really hope that our worries are for naught. After succeeding in the negotiation, everyone should head back home to our base. Zhang Gong, I’ll give you a surprise when you return to the base.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI was stunned. “Surprise? What surprise?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Si smiled. “It’s a secret now. You’ll find that out once you head back.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy mood was increasingly getting heavier as I heard the continuous flow of intel from Jian Shan. From the news that he conveyed, ever since Ke Zha came to the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress, the three Kingdom’s army troop has subdivided again. The other two kingdom’s troops, excluding the soldiers from Xiuda, had been carrying out covert operations every night. They had used patrolling as an excuse majority of the time, but each night the number of people that returned decreased significantly. It seemed that our guess was right. Ke Zha was plotting a conspiracy. If we aren’t able to deter the Ke Zha’s forces with our trump card, then the negotiation this time would be a disaster. We couldn’t count on the troops from Xiuda as it was already gracious enough for the prince to decide that his subordinates would be on the neutral side. Currently, we could only depend on ourselves. Ke Zha, I definitely won’t let you succeed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThree days passed in a jiffy. The time for the reconciliation was nearing. Everyone that was gathered in my room had grave expressions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiu Si said, “Our people have already reached their appointed locations and are ready to move at any time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu said, “Our preparations are already done. When will we set out?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI told Jian Shan, “If there’s any problems that occur later, we’ll use a major magic spell. After the spell starts, you’re to immediately retreat with Mu Zi to the Demon race’s side. The few of us will be extremely weak after the spell ends. We’ll depend on you at that time. The twelve of you to us is conveniently 2:1 so two of you will take care of one of us after the spell ends by inserting battle spirits into our body. Your task will be the crucial point as to if the negotiation this time succeeds or not.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJian Shan nodded. “Rest assured, Zhang Gong. We’ll definitely support you with everyone’s power to succeed in the task.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI turned to Mu Zi. “Once Ke Zha goes back on his words, Jian Shan and the others will protect you. Go to the allied armies, you must control the situation at that side well and prevent the allied armies from attacking. Otherwise, what we have done till now will be ruined.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi seriously nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We must succeed.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone shouted in harmony, “Success!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Set out.” The 19 of us moved to the location for the negotiation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe atmosphere today was a little heavy. There were thick and heavy clouds in the sky, making everyone feel exceptionally hot and stuffy. The various Kingdom’s army troops’ flags were fluttering at the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress. Ke Zha had brought only 20 guards with him. Ma Ke didn’t seem to be in the camp as we went forth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress was a boundless flat plain. We were able to see the large portion of army troops stationed at the far west of the fort. In the center, between the Ström Fortress and the Demon-Beast alliance, was a large open plain and it seemed that the location of the negotiation is at the very center. The Beamon King was already waiting for us there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha, who was riding with me on the way, said, “Zhang Gong, it seems that there will be a heavy storm today.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI touched my conical hat and replied calmly, “What will rain be to us? Let the tempest come freely.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha’s expression changed slightly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA gale blew past, swirling the sand from the ground, obstructing our sight in a short moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the sandstorm passed, Ke Zha whispered to me, “Zhang Gong, if you’re willing to swear your loyalty to me, your future path will be smooth. I’ll support you unconditionally with all of my capabilities.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eYou want me to work for you? He must have thought about the power of our base possesses. Hmph! Don’t even think about it.\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ “Can we discuss about this after the negotiation concludes, Your Majesty?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha sighed heavily and with a kick from both of his legs on the horse’s abdomen, he went to the front. I knew that the last opportunity to reconcile with Ke Zha was gone. We would just have to depend on our capabilities in a while.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe setup for the negotiation venue was extremely simple. It was just a large stage manufactured by wood that had a large table and ten chairs on it. The Beamon King brought ten Beamon giant beast’s soldiers with him. When I saw his enormous build pacing back and forth on the stage, I was really worried that if he wasn’t careful, the newly built stage would break down. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Beamon King’s expression was unflustered. When he looked at Ke Zha and the rest of us, he calmly said, “You’ve arrived. Welcome here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi represented the Demon race. She and the Beamon King sat on the left side of the table, while Ke Zha, Marshall Feng Hao and the prince sat on the left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe rest of us just sat at the side, watching on how they would sign the treaty.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Zha smiled. “I’m the Emperor Ke Zha Ao Er from the Kingdom of Aixia. I will be representing the human race. We should commence the negotiation now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI stood up and walked to the other side of the table. The two sides of the table showed the both sides that were going to negotiate. I said clearly, “The Human race, Demon and Beast races has been fighting continuously since the olden times. It has led to great loss to everyone. That phenomenon seems to have stopped after nearly 200 years of time. The three races will have different rates of development with peaceful means. This will let us know that we can only flourish when we are in peace and harmony. Thus, for the negotiation to succeed, I hope that the negotiator of both sides will strictly follow to the content of the treaty. We’ll use all of our strength to fight together against our common enemy, the Monster race during the effective period of the treaty. I’ll now read the contents of the treaty.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFirst, the reconciliation will be under the basis that it’s fair and well spread. The both parties will have the right to express their opinions and suggestions before signing the treaty. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSecondly, once the treaty has been signed, the both parties have to simultaneously withdraw their armies and are forbidden to carry out any offensive attack towards the other party. However, the remaining army forces can be used to supervise.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFinally, both parties can’t assault the other party within the three years after the treaty has been signed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOne side of the treaty includes the Demon and Beast races. The other is made up of the three human kingdoms; Dalu, Aixia, and Xiuda.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe notary of this treaty will be God’s Envoy, Zhang Gong Wei.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis will be the conclusion of the pact. I don’t know if both sides have any conditions to add on.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-31\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-10-chapter-33\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-10-chapter-32","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
