{"id":48580,"no":298,"title":"Volume 11: Chapter 5 - Hai Shui Arrives","content":"\u003cp\u003e\u003cb\u003e\u003cu\u003eVolume 11: Chapter 5 - Hai Shui Arrives\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mu Zi, when you see this letter, I will already be far from the base. You should understand why I’m heading out. I must go to protect the world’s peace and harmony. I’m sorry for leaving without telling you. I know that you will be hurt after learning of my departure. However, I want to tell you that no matter where I am, you’ll be following me in my heart. I love you, Mu Zi. I really do. Please take care of yourself. I must obtain the Radiant God’s inheritance for everyone, you, and the world. I want you to help everyone resist the Monster race when they appear. We should be able to hold for a while with the strength of our God’s Protector Squad. Please help me tell Big Brother Xiu Si that he will be in charge of everything at the base. I also didn’t take Xiao Jin along with me to receive the inheritance as it will be better for him to stay here to increase our strength. Mu Zi, I’ve already started to miss you, even when I haven’t left yet. Please take care, my love. Inscribed by, Zhang Gong Wei.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi’s tears fell, dampening the letter. She said, dazed, “Zhang Gong, you’re so silly! Why didn’t you tell me that you had to go?” She just sat there in a daze feeling the loss from Zhang Gong’s departure. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hey, Mu Zi, where’s Zhang Gong?” A familiar voice came over.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi momentarily got out from her shock and turned to see that it was Zhan Hu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Zhan Hu saw Mu Zi’s tear stained face, he frowned and asked, “What happened? Mu Zi, did Zhang Gong bully you? Tell me if he did. I’ll help you in punishing him.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi shook her head with all her might and her tears involuntarily flowed again. “Big Brother Zhan Hu, Zhang Gong…he left.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu was so startled that he cried out, “What? He left? Where did he go?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi suppressed her emotions and replied, “He has gone to accept the Radiant God’s inheritance. Have a look at this.” Upon saying that, she passed the letter in her hand to Zhan Hu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Zhan Hu read through the letter in detail, he fumed. “That brat, how can he just leave without a word. I won’t forgive him when he gets back.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi said, “Big Brother Zhan Hu, please don’t blame him. I understand his intentions . He did it as he feared everyone would be extremely worried about him when he left. Moreover, he is already gone so it’s too late to say anything now.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu scratched his head. “We also don’t know when he will return. Sigh…he really is….. Forget it, let’s not talk about this. I’ve come to find him as a pretty girl is outside and looking for him. We’ve caught her, she’s a mage. Her power isn’t bad, her name is something like Hai…Hai….” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi exclaimed, “Hai Shui?!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu replied, “Yes! Yes! She’s called Hai Shui. Do you know her?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi nodded. “Big Brother Zhan Hu, I’ll go with you to see her.” Mu Zi and Zhan Hu dashed out from Zhang Gong’s room after she said that. They crossed the hillside of the God’s Protector Domain to the watch post manned by a few soldiers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi had recognised Hai Shui’s blue mage robes from afar. Even though Hai Shui was still beautiful, there were still a lot of changes. Her small face was completely white devoid of \u0026nbsp;blood. The robe on her body was tattered. Her face was a picture of exhaustion as she anxiously waited. She seemed to have suffered greatly on her journey!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi floated over. “Hai Shui!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui’s eyes lit up and quickly jumped towards Mu Zi after recognising her. “Sister Mu Zi, I’ve finally found you guys. The search was so tough!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi embraced Hai Shui’s body and caressed her hair. She consoled her, “Don’t cry, Hai Shui. Why have you come?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui used her sleeves to wipe away her tears . “Ma Ke had told me about Zhang Gong’s news when he returned to the city. I was almost angered to death by Zhang Gong when I read his letter. What did Big Brother Zhang Gong think I am? Could it be that my heart will change once his appearance changed? I already swore long ago that he will be the perfect Big Brother Zhang Gong in my heart, no matter what changes have occurred. I immediately heard from Ma Ke that Big Brother Zhang Gong will be in this mountain range so I hurried over after reading the letter.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi’s body shuddered as she could understand the deep longing that filled Hai Shui’s eyes very well. A girl had suddenly left her homeland to run to such a remote location for Zhang Gong. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Zhang Gong! Zhang Gong! It really looks like Hai Shui’s feelings aren’t inferior to mine.’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sister Hai Shui, did you inform your family when you left?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui’s lovely face reddened before she whispered, “I...I snuck out. Your place is really hard to find. It took me two days to enter this mountain range. I finally found this place after much difficulty, but they hindered me.” Upon saying that, Hai Shui glared fiercely at the guards at the watch post.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi smiled. “Don’t blame them as they are just doing their job. Sister, you’ve really suffered. Let’s head back to my room to rest for a while.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui hesitated for a while before looking at Mu Zi’s back. She stuttered, “Big Sister Mu Zi, where’s Big Brother Zhang Gong? Why didn’t he come to receive me? Could it be...Could it be that he doesn’t want to meet me?” Upon saying that, Hai Shui’s eye rims reddened again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi smiled wryly. “How can that be? If he knew you’d came, he would definitely be the first one to greet you. However, he just left. Take a look at this.” Mu Zi passed over the letter in her hand. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHai Shui was stunned after reading the letter’s contents and said in a daze, “I never expected that I would have just missed him after travelling so far.” Hai Shui’s body slumped and fell towards the ground. Mu Zi hastily supported her body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhan Hu jumped in shock. “What’s happened to her? What’s going on?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi checked on Hai Shui’s condition in detail. She finally let out a breath after a long while. “Sister Hai Shui has always loved Zhang Gong. You should ask your good brother about the details in the future. There’s nothing wrong with Sister Hai Shui. She has just collapsed from the accumulated exhaustion, the cold and being overcome with grief. Big Brother Zhan Hu, let’s head back to the base. She’ll get better after resting for a while.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Zi sighed inwardly as she carried Hai Shui. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Zhang Gong! Zhang Gong! You really picked a good time to leave!’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-11-chapter-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-11-chapter-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-11-chapter-5","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
