{"id":48598,"no":316,"title":"Volume 11: Chapter 23 - Embarrassed","content":"\u003cp\u003e\u003cb\u003e\u003cu\u003eVolume 11: Chapter 23 -\u0026nbsp;Embarrassed\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKe Er Lan Di politely replied, \"Your Majesty, aside from the silver mask, the rest of the mage’s appearance matched up with God\u0027s Envoy Zhang Gong when we met. Moreover, when we had split up, he said that his destination was the \u003c/span\u003e\u003cspan style\u003d\"\"\u003eStröm Fortress\u003c/span\u003e\u003cspan style\u003d\"\"\u003e and that he had something important to settle. I didn\u0027t tell him that Your Majesty was here. We then sped up to reach here faster. I wanted to introduce him to you before he settled his matters. Zhang Gong definitely isn’t simple, his magic level has reached the pinnacle of perfection. He alone was able to solitarily cast a forbidden spell! If her Royal Highness is really with him, there shouldn\u0027t be any danger as Zhang Gong is a very righteous person.\" He raised his head to look at Tian Feng Lou Chen, who seemed to be deep in thought. \"I\u0027m afraid that it’s Zhang Gong that will be in trouble.\" Thinking about the obstinate ill-behaved Princess Fei Yu, Ke Er Lan Di started to have a headache.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTian Feng Luo Chen asked the soldier, “Are you certain that mage said that he was Fei Yu’s teacher?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat soldier said with fear and trepidation, “Yes, Your Majesty. I am certain.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTian Feng Luo Chen turned towards Ke Er Lan Di. “Since that’s the case, you bring along the Eight Magical Swords to find them. If that person really is God’s Envoy, Zhang Gong, you are not allowed to get into conflict with him. If Fei Yu really doesn’t want to return, you can just let her be.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What?!” Ke Er Lan Di cried out. Emperor Tian Feng actually allowed his daughter to follow an unfamiliar man.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA glimmer flashed in Tian Feng Luo Chen’s eyes. “Just do as I’ve said! You can take your leave now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, Your Majesty.” Ke Er Lan Di turned around to leave the Commander’s Division. \u0026nbsp;Eight shadows leapt out from a corner and followed him out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e　　…………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI brought Fei Yu along as I flew towards the south. We had already reached the plateau of the Demon race after flying for a while. We should now just search towards the south, according to the directions of that robust man at the fort, to be able to find the God Rended Canyon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen I landed, I circulated the Holy Sword’s power to investigate my surroundings to check if there was any presence of abnormality. Fei Yu gushed, “Teacher, the feeling of flying is so great! When will you be teaching me how to fly?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI smiled wryly. “Do you think it’s that easy to fly? Without a solid magic foundation, it’s impossible to fly. According to your current level, you’ll need to bitterly train for 10 years before you can fly. Under no special conditions, you’re most likely unable to fly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu replied, displeased, “Don’t care! I want to be able to fly now. You must make me to be able to fly, alright?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI shook my head. “There’ three situations to help you to fly. The first is that your battle spirit reaches a certain level that enables you to explode out with battle spirit that will allow you to escape the pull of gravity, but that way of flight takes up a lot of energy. The second is to increase your magic level to be able to control the wind elements thus enabling you to fly. The third is…….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu asked anxiously, “What’s the third way?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI couldn’t help but to think of Xiao Jin that was guarding the far away God Protector’s Domain. I sighed and replied, “The third way is to have a flying type Magical Beast to allow you to fly under its assistance.” Xiao Jin was the King of Magical Beasts. It had been a long time since I had seen a Magical Beast after these years with my brothers that specialized in battle spirit. Initially, if it wasn’t for Big Brother Hai Ri’s red tiger that almost killed Xiao Jin, we wouldn’t have reached such an intimate relationship. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e‘Xiao Jin! Are you missing me right now?’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu chuckled. “Magical Beast? I have one! Take a look at this. Soaring Feather! I choose you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo my astonishment, Fei Yu formed a hand seal towards the sky. A white light shone from her hand and a hexagonal boundary appeared in the sky. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eAh! This was the way of summoning life-sealed beast!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ With a flash of light, the magic elements in the surrounding suddenly became chaotic. A snow white little bird appeared from the hexagonal boundary with a clear chirp, landing on Fei Yu’s shoulder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe white bird was about 3.3 meters long and was covered with snow-white feathers. Two of its red eyes looked at me with curiosity. There was also a small golden horn on its head, its body giving off weak power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMy heart was moved as I cried out, “A Growth Type Magical Beast!” Fei Yu was really worthy of being the princess from the Kingdom of Dalu to actually possess a Growth Type Magical Beast. I could clearly feel the aura from its body, even if I didn’t know what type of white bird it was. Even though its power wasn’t at its full potential, it definitely would be a low grade Growth Type Magical Beast. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu said, slightly complacent, “How is it? This is my Magical Beast. It’s called Little Feather. Teacher, you said it can help to let me fly?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI gradually recovered from my shocked state. “Your Magical Beast is at the low grade level. Since it’s a Growth Type Magical Beast, its power will slowly improve according to your cultivation so if you want it to allow you to fly, you must train your powers. It currently \u0026nbsp;can’t fully display its power.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu pouted as she gently caressed Little Feather’s snow-white wings. “How long will that take? Teacher, since your magic is so powerful, don’t you have a way to allow me to increase in my magic level in a short amount of time?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eI became serious. “Don’t you even think about that. Do you think training in magic is as easy as playing? Without bitter training, there won’t be any results. Fei Yu, I really got something important at hand so I can’t continue to take care of you. How about this then? I’ll use a slightly bigger teleportation array to teleport you into the city. You won’t be afraid of being caught by your pursuers from the Kingdom of Dalu that way.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFei Yu expression grew distressed as she said, choked with emotions, “Teacher….Teacher, you don’t want me anymore? I’m so pitiful! I’m only a girl so what should I do when I meet with bad people? Teacher, please take me along with you. I’ll obediently listen to you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHearing her pleas, I got a headache. ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhy did I meddle with such a troublesome girl?! How can I bring her along with me to accept the Radiant God’s inheritance?’\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-11-chapter-22\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-11-chapter-24\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-11-chapter-23","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
