{"id":48346,"no":64,"title":"Volume 3: Chapter 20 A Battle of Honor","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eVolume 3: Chapter 20 – A Battle of Honor\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI immediately went over and asked, “What is going on? Could it be that His Majesty had sided with the Duke?” With an anxious gaze, Dong Ri looked at Teacher Wen.\u003c/p\u003e\n\u003cp\u003eTeacher Wen sighed and said, “It will not be like that. His Majesty is a very wise monarch and very shrewd as well. If he were to hit fifty slabs, not one strike would be different.*\u003c/p\u003e\n\u003cp\u003e“Then why do I see you having such an unhappy appearance?” I inquired.\u003c/p\u003e\n\u003cp\u003eTeacher Wen replied, “Although His Majesty did not discriminate against any party, he has given me a difficult task. He will have me send a troop of students from the academy branch in order to compete in Xiuda’s five year national martial competition. Bi Qi will also have to send a single rank of troops. In addition, this affair will be resolved by seeing which dispatched troop receives the higher ranking. \u0026nbsp;The winning party will have the losing party apologize in public.”\u003c/p\u003e\n\u003cp\u003e“Ah? So it’s decided like that.” That’s a bit unreasonable. We truly were the just party.\u003c/p\u003e\n\u003cp\u003e“Zhang Gong, you wouldn’t know. Bi Qi has an exceptional amount of influence in Xiuda. His Majesty had no choice but to yield to him to some degree. Furthermore, because of Xiuda’s prevalent martial traditions, many affairs are decided based on the result of a martial competition.” \u0026nbsp;Teacher Wen said with significance.\u003c/p\u003e\n\u003cp\u003eDong Ri interrupted, saying, “Then we won’t have to worry. Our academy has many powerful students. How could we possibly be afraid of Bi Qi?” Indeed, because of our strength, we could even rival the nobles.\u003c/p\u003e\n\u003cp\u003eTeacher Wen wrinkled his brow and said, “That is exactly what I am worried about. Bi Qi was adamant on the two of you participating. He will also send his eldest son to participate in this tournament. Each team in the competition must have five members. Although the academy students’ strength isn’t weak, their age is comparatively young. It is impossible for them to have deeply cultivated their strength, but Bi Qi does not have that problem. It is said that his eldest son is awfully hard to deal with.”\u003c/p\u003e\n\u003cp\u003eI curled my lips, “What good could that fat hog possibly produce? Take his young, idiotic son for example.”\u003c/p\u003e\n\u003cp\u003eTeacher Wen gravely rebuked me, “Zhang Gong, you cannot look down on your opponents. You should know about Xiuda’s most ferocious Earth Dragon Corps. His son is the second corps chief of the three Earth Dragon Corps. This isn’t a position that can be obtained through bribes and influence. His eldest son this year is thirty eight years old and is already Xiuda’s genius knight. \u0026nbsp;At the age of thirty he was already a heaven knight. Second only to the previous Earth Dragon’s third corps commander the Imperial Prince Qi Lu Xiuda, known as the Zhan Hu (War Tiger), Son of Jing Yun Xiuda.”\u003c/p\u003e\n\u003cp\u003eAh? Isn’t that Big Brother? That being said, the duke’s eldest son isn’t any weaker than Big Brother.\u003c/p\u003e\n\u003cp\u003eTeacher Wen continued, “These past eight years, only the heavens know whether or not he was able to become a radiant knight. Although Zhang Gong has a magister’s strength, in the end his cultivated experience is comparatively short. In addition, we don’t know what other experts Bi Qi will dispatch. Therefore, I am truly worried about this competition.”\u003c/p\u003e\n\u003cp\u003eIn my mind, I felt nervous. Although becoming a radiant knight isn’t an easy matter, nothing is absolute. But if the five people on the opposing team possesses Big Brother’s strength, then we are determined to lose.\u003c/p\u003e\n\u003cp\u003eWhile I was waging war in my mind, Dong Ri started talking. He said passionately, “Teacher, be at ease. No matter the cost, we will surely obtain the final victory. We are the righteous party. It is unconditional; we cannot let them have their way.”\u003c/p\u003e\n\u003cp\u003eDong Ri’s words influenced me, “Right, we will definitely win.”\u003c/p\u003e\n\u003cp\u003eTeacher Wen smiled and said to Dong Ri, “Foolish child, what would you know of righteousness. Only the strong are just. To defeat the nobles is to defeat evil. Besides, from a fundamental point, Bi Qi isn’t such a villain. It is only that he has many faults, nothing more.”\u003c/p\u003e\n\u003cp\u003eDong Ri and I looked at each other in dismay, I said, “He isn’t regarded as a villain even with that behavior?”\u003c/p\u003e\n\u003cp\u003eTeacher Wen chuckled and said, “You two are still young and far too naive. In this world there are no absolute villains. Neither are there any absolutely good people. There are only those with different ideas. That is why regardless of how small a good is, don’t forsake it and no matter how small\u0026nbsp;an evil is, don’t commit it. With regards to Bi Qi, it is only that he is somewhat obstinate. He has a strong notion of his clan and is somewhat protective. \u0026nbsp;But when facing issues of right or wrong, he can still choose the correct choice. Can you still call him bad?”\u003c/p\u003e\n\u003cp\u003eTeacher Wen’s words deeply moved me, establishing the future philosophy that would undertake.\u003c/p\u003e\n\u003cp\u003e“Those were words spoken before. If you are satisfied then participate in the competition. Even if you were to train it would be too late. I can select the three strongest students at this academy to participate with you. In these coming days I will have you five people get used to each other. I demand that you ensure yourselves to be in your peak condition. Fight to obtain a high rank. In fact even if you lose it wouldn’t matter. At worst I would have to have to thicken my face skin and find Bi Qi and acknowledge I was wrong. He shouldn’t bother me about it too much.”\u003c/p\u003e\n\u003cp\u003eAfter finishing, Teacher Wen laughed at himself. When I heard a hint of bitterness inside his words. He clearly isn’t very optimistic toward us. Dong Ri and I secretly resolved that we must beat Bi Qi’s troop. Teacher Wen was at such an old age, and additionally he exceptionally valued face like most of Xiuda’s people. We absolutely cannot allow this old man to suffer humiliation.\u003c/p\u003e\n\u003cp\u003e“It is done. Today was very tiring. Rest a bit earlier. Tomorrow morning, I will find teammates for you, and have you train and get familiar with each other. \u0026nbsp;Dong Ri, who I am most worried about is you. Your strength is still comparatively weak to the opposition. Train with great effort.” \u0026nbsp;Saying this, Teacher Wen went back to his own room.\u003c/p\u003e\n\u003cp\u003eFinished eating dinner, Dong Ri and I practiced in the courtyard. I muttered to him, “Dong Ri, this competition will definitely be arduous. I believe you should fully display your advantage.”\u003c/p\u003e\n\u003cp\u003eDong Ri curiously asked, “I have an advantage?”\u003c/p\u003e\n\u003cp\u003eI smiled and said, “Of course you do. Your advantage is indeed ferocious. It is is your bow and arrow.”\u003c/p\u003e\n\u003cp\u003eHearing my words, he despaired, saying, “Bow and arrow? I am only accurate, my strength is not at all strong. It is of no use against an expert.”\u003c/p\u003e\n\u003cp\u003eI said profoundly, “How could it possibly be useless? What I want is exactly your accuracy. We can use magic arrows.” Saying this, I quietly whispered [sweet nothings] my plan into his ear. His wrinkled brows gradually unfolded.\u003c/p\u003e\n\u003cp\u003eDong Ri smiled and hit me with a first, “Luckily you thought of that. \u0026nbsp;Now we can handle them. In these two days we must diligently practice our coordination.”\u003c/p\u003e\n\u003cp\u003eI nervously said, “Lower your voice. This is our secret weapon.”\u003c/p\u003e\n\u003cp\u003eDong Ri covered his mouth with his hand. His comical action made me hold my sides as I laughed. Only then did he know I was playing with him. He came over and noisily laughed with me.\u003c/p\u003e\n\u003cp\u003eTeacher Wen silently looked at us from the front window and couldn’t help but faintly shake his head and said to himself, “Youngsters truly don’t know the feeling of worry. I don’t even know if they have any secret abilities.”\u003c/p\u003e\n\u003cp\u003eAfter all, what kind of secret ability was it? Let us find out in the competition.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-19\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-21\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-3-chapter-20","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
