{"id":48350,"no":68,"title":"Volume 3: Chapter 24 A Display of Strength","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eVolume 3: Chapter 24 – A Display of Strength\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur first match for the semifinals was held today. We didn’t know how powerful our opponents were, but we knew they wouldn’t be able to stop us from advancing. After we arrived at Xiuda Plaza, we saw that the spectator stands were already completely filled.\u003c/p\u003e\n\u003cp\u003eAfter everyone got on to the stage, the judge introduced both sides. “Advancing from stage 384 from the 512 of the original 1024 groups, is the Royal Knight Academy’s Radiant Battle Squad and the squad composed of people of various nationalities, the Devil Battle Squad.” After their introduction, the audience began booing them. It was only later that I found out that in all of their preliminary matches they had seriously injured all of their opponents. They had even beaten some to their last breaths.\u003c/p\u003e\n\u003cp\u003eThe Devil Squad consisted of three warriors and two mages. I felt a refined strength from our opponents. I said to Xiu Si, “It seems that today we must all appear on stage.”\u003c/p\u003e\n\u003cp\u003eOur opponents were evidently experts in team combat. After stepping onto the stage, both teams assumed a fighting stance, waiting for the judge to signal the start of the battle.\u003c/p\u003e\n\u003cp\u003eThe Devil Squad’s three warriors hadn’t attacked impatiently, but rather had their mages cast defensive enchantments on them. This greatly surprised me, as the two opposing mages had the strength of a grand mage. Although their powers were far inferior to me, the defensive enchantments they used were exceptionally brilliant.\u003c/p\u003e\n\u003cp\u003eI stopped Xing Ao and Cao De, who were both eager to attack, “Let me. Since our opponents have mages, let them experience what true magic is.” Up until now in the competition, I still hadn’t participated and had been itching to act. Seeing that opponents have mages made me eager to display my skill.\u003c/p\u003e\n\u003cp\u003eXiu Si indifferently said, “Don’t give our opponents an opportunity. Finish them in one move.”\u003c/p\u003e\n\u003cp\u003eXing Ao clearly knew that he could not handle the opponents well. He whispered to me, “If you finish them by yourself, I’ll admire you.”\u003c/p\u003e\n\u003cp\u003eI threw a glance at him and replied, “Ah, so it turns out you still weren’t convinced of me. Fine, today I will let you see my attack magic. You should all go down.” I directed the last sentence to my squad.\u003c/p\u003e\n\u003cp\u003eXing Ao and Gao De still appeared a bit uneased. Xiu Si said, “Go. There is a fundamental gap between them and Zhang Gong.” Everyone walked off the stage. When the opponents had nearly finished casting, they discovered I was the only warrior there. They were stunned. A mage asked, “Are you going to fight alone? Can it be that you are representing your entire squad?”\u003c/p\u003e\n\u003cp\u003eI said with a smile, “Of course I will represent my team. As long as you can beat me, I’ll consider it your victory.”\u003c/p\u003e\n\u003cp\u003eA man wearing red armor from the Devil Squad bellowed in rage, “You’re looking down on us too much! Even a Radiant Knight might not necessarily be able to defeat us when we combine our forces. Brothers, let’s charge him and let him pay the price for his arrogance.”\u003c/p\u003e\n\u003cp\u003eThe three warriors charged at me together. The two mages had also started to chant their incantations. “Great Fire Elements, gather at my side, condense into a dragon of fire and annihilate the enemy before your eyes!” A fire dragon. It seems this person is a fire mage. “Great Water Elements, gather at my side, condense into a dragon of water and annihilate the enemy before your eyes!” This is a water dragon. So he’s a water mage.\u003c/p\u003e\n\u003cp\u003eA pair of rank six spells, the water and fire dragons, approached me. The three warriors, each possessing the strength of an earth knight, attacked once more in concert. They were truly strong and clearly enraged with me, charging towards me with all their strength.\u003c/p\u003e\n\u003cp\u003eIf it was three or four years ago I definitely would have been greatly injured by this combination of martial skill and magic, but as of now that would be out of the question.\u003c/p\u003e\n\u003cp\u003eAs their spell took form, I teleported to the corner of the arena to buy myself some time. I began chanting, “Oh great light elements, I request to borrow your formidable strength, let the infinite light permeate the earth and shine!” My body suddenly emitted a dazzling light and in a flash it overcame the twin water and fire dragons. As for the Devil Squad, they had all been knocked off the stage by my Brilliant Empire.\u003c/p\u003e\n\u003cp\u003eWhen they touched the spell, I reduced a portion of its magic power. It had only knocked them out the stage without injury. The pair of water and fire magic dragons were not weak. Even when compared with the absolute power of Brilliant Empire, they could not be considered inferior. However, their magic power was far inferior to my own. In addition, my psychological tactics had succeeded. Had they not recklessly charged at me in anger and rather defended against me together, it wouldn’t have been easy for me to defeat them. With such advantageous conditions, it was only natural for me to easily win.\u003c/p\u003e\n\u003cp\u003eThe audience gave me a round of enthusiastic applause. \u0026nbsp;Contrary to the atmosphere, I hadn’t felt the need to whistle towards the sky and many had asked from above who was the imposing hero that stood where I was.\u003c/p\u003e\n\u003cp\u003eWhen I walked down the stage, Dong Ri quickly came and excitedly said, “Zhang Gong, you truly are so powerful! It turns out magic is actually so useful!”\u003c/p\u003e\n\u003cp\u003eI said smugly, “Learn it properly then. Learn all you can from big brother and shake the world when you go out! Haha!” After revealing my strength in this battle, Gao De and Xing Ao were finally convinced that I hadn’t beaten them that time with a cheap trick. They were completely obedient to me now.\u003c/p\u003e\n\u003cp\u003eThe following battles were very easy for us as we didn’t meet any teams stronger than this one. We played our triumphant hymn the whole time and in one breath, we had reached the top 32.\u003c/p\u003e\n\u003cp\u003eFrom the observations made by Xiu Si and I, all of the Wind Dragon Battle Squad had made their appearances. All of them were warriors, just as we predicted. Aside from the Earth Knight that appeared first, the rest of them all had the strength of a sky knight. However, it was unknown whether or not if they had concealed any of their real strengths. The one that posed the biggest threat to us was Bi Qi’s eldest son. In all of their previous battles, not once had he truly used his strength. He only acted once or twice, when the other members of his team were in a pinch, thus allowing them to smoothly win afterwards. As the commander of the Second Earth Dragon Corps, he had innately possessed the air of a commander. Regardless of the battle’s circumstances, he would definitely be able to lead them. Even if Mt. Tai (if there was a Mt. Tai) collapsed in front of him, he had the mettle to remain calm and continue leading. He was about 190 centimeters in height with a lean build. Explosive power could be felt whenever he issued an order. I couldn’t help but be anxious. He absolutely must not break through the bottleneck to become a Radiant Knight, otherwise we will be humiliated.\u003c/p\u003e\n\u003cp\u003eOur next opponent was here to protect the Royal Prince Qi Lu Xiuda’s Prince Battle Squad. It is said that they were highly expected to win. They were the most powerful opponents we had faced yet. All five of them were sky knights. Furthermore, they were well coordinated during the battle. Evidently, this was the fruit of their many years of training together. The Prince’s Battle Squad was the greatest obstacle if we wanted to surpass the Wind Dragon Battle Squad that Bi Qi sent.\u003c/p\u003e\n\u003cp\u003eI didn’t know whether or not I would be able to meet Zhan Hu’s father, Prince Qi Lu, and accomplish the only mission big brother had given me.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-23\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-25\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-3-chapter-24","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
