{"id":48361,"no":79,"title":"Volume 3: Chapter 35 Elven Dispute","content":"\u003cp\u003e\u003cb\u003e\u003cu\u003e\u003cspan\u003eVolume 3: Chapter 35 – Elven Dispute\u003c/span\u003e\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWith this said, the elderly elf displayed a human side of him. It appears that he is not incapable of accepting humans. He continued saying, “If it is possible, let us talk as we walk.” Saying this, he lightly flapped his elf wings forward, leading the way.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI curiously asked, “How are you certain that we aren’t villains? Is it not possible that instead we would help the Dark Elves get rid of you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf laughed and said, “You are truly a child. Do you know how old I am this year? This year I am 1,446 years old. Those of the elven race are all long lived. I’ve seen a great deal. If I’m not mistaken, what you just used a moment ago should be light magic. In addition, you should at the very least be at the level of a magister. Those that can use light magic are all of pure and virtuous character. That is the reason why I let you help us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDong Ri suddenly interrupted, saying, “Do you know which type of elf I am?” It seemed he wanted to ask about his own life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf smiled and said, “Of course I know. If we’re talking about in general, elves can be divided into two main types. One type is us, nature elves. You are of this type. The other is our enemy, the dark elves. \u0026nbsp;With regards to the number of dark elves on the entire continent, we are the unconditional majority. However with regards to strength, we can only compare the quantity of pure blooded elves. This is because only pure blood elves have the ability to bring out their true fighting strength. For example, you are incapable of using the power of nature.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDong Ri somewhat disappointed, said, “Then you don’t know where I specifically came from?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf helplessly said, “There are too many nature elves in this world. If you were a pure elf, I would be able to check. But presently, I’m afraid…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSeeing Dong Ri’s disappointed appearance, I immediately broke off from this topic and asked, “How many pure blooded elves does each of the two races have? What about fighting strength? “\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Right now the population of pure blooded elves has been greatly thinned out due to many years of campaigning. Each side has about a thousand pure bloods. The Dark Elves already attacked our village this morning. The forest this village is located in is actually the most suitable place on this whole continent for elves to reside in. It’s because of this that the Dark Elves are trying to destroy us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWith a nod, I said, “Why can’t everybody just live together in harmony? With such a large forest, what’s there to be afraid of 2,000 people? It’s only if you are willing that the rivers of blood will flow.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf sighed and said, “If everyone thought like you did, the world would have no conflict. I find myself liking you more and more, boy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“In that case, I don’t dislike you either, old man, haha.” We laughed heartily together.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXiu Si said, “Senior, how much further until we reach the village? Let’s hurry a bit and avoid needless injuries.” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf said, “Alright. Follow me closely.” He turned into a faint shadow and flew onward.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBig Brother Zhan Hu followed him up, carrying Xing Ao on his left hand and Dong Ri on his right. Xiu Si followed closely, carrying Ao De. I ended up leisurely using short distance teleportation to follow them, neither slowly not closely. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNot knowing how far we traveled, the elderly elf stopped and waited for us to come before him. He gave everyone a favorable smile and slowly walked onward. \u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“In front of us is the village’s rear. Let’s go in and see how it is.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTurning at a small hill, an elf village reflected into our eyes. What a large village. It’s even larger than Zhan Hu’s bandit village. Busy admiring the scenery, we followed the elderly elf into the village. Everyone seemed to be very busy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf stopped an adult elf and asked, “Shan Nian, what’s the situation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe fully grown elf named Shan Nian replied, “Third Elder, you’ve returned. Please go over at once. The Dark Elves’ King is currently engaging with ours. It is practically a melee.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf called out to us to advance towards another side of the village. I noticed that all of the elves here have two wings. Their capabilities are much greater than that of outside elves. The majority of the elves had swords as their weapon of choice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter arriving in front of two battle formations, the battlefield was truly bleak with a dark sky and a black earth. I noticed that there wasn’t much of a difference between the Dark Elves and the Nature Elves. Nature Elves had green hair, blue eyes, and green wings, while Dark Elves had black hair, violet eyes, and black wings. This was the only difference, everything was basically the same between them. They both had similar appearances.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI looked towards the field and saw two adult elves engaged in fierce combat. From their fluctuations of energy, I could tell that they were the kings of each side. On the Nature Elves’ side, there were three elves about the same age as the elderly elf who were anxiously watching this battle.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe elderly elf walked to their side and asked, “What’s the situation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA different elderly elf replied, “Third Elder, you’ve returned. We don’t have any reinforcements left and we’ve already battled 10 times. Unexpectedly, it has been one-sided the entire time. If our king loses again, I fear they will rush forward and beat us all.” (For the sake of convenient address, the following will be called the Great Elder, Second Elder, Third Elder and the Fourth Elder. The one who brought us over was the Third Elder.)\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSighing, the Third Elder said, “How did it become like this? Is the difference really that great? Don’t tell me…. is this the day our kind is destroyed?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI went up to him and comfortingly said, “Don’t worry! We’ll definitely help you.” The Third Elder appreciatively nodded at me and introduced me to the other three elders.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAt this moment of intense battle, the Nature Elf King grasped his sword in both hands and shouted, “Venerated nature spirits, heed my call, become a destroying power and annihilate the evil before you —— Nature’s Punishment!” Following this, he slashed with his sword and a wave of green energy that hid the sky and covered the earth flew towards the Dark Elf King.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn a single breath, the Dark Elf King disdainfully said, “It’s been so many years yet we’re still going through this routine. You won’t do anything else so I’ll let you see my ultimate technique. Endless evil, endless resentment, become the endless darkness and devour everything —— Endless Devourer.” An ash black smog started pouring out of the Dark Elf King’s body, covering a large area and charged towards the Nature Elf King with a mournful cry. The two energies opposed each other in the sky. The energy emitted by the Nature Elf King was compressed little by little and forced back. It was clearly falling back and it would soon be unable to hold on any longer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-34\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-36\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-3-chapter-35","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
