{"id":48369,"no":87,"title":"Volume 3: Chapter 43 The Secret Cave Adventure","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eVolume 3: Chapter 43 – The Secret Cave Adventure\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNo one disturbed me, while I had been exceptionally focused on my studies. Aside from eating and sleeping, I spent nearly ten hours every day studying.\u003c/p\u003e\n\u003cp\u003eAt last, after three days of arduous struggling, I had a basic understanding of the contents of the book. In other words, I had grasped the basics of magic arrays.\u003c/p\u003e\n\u003cp\u003eI comfortably stretched my body and said, “I’m finally finished. I’m so tired.” I stood up and began moving my body, after all, it had been three days since I had last exercised my body.\u003c/p\u003e\n\u003cp\u003eEveryone came over and crowded around. Zhan Hu asked, “How about it? Have you found a way through?”\u003c/p\u003e\n\u003cp\u003e“The book didn’t have any information about this specific magic array.” I said, embarrassed.\u003c/p\u003e\n\u003cp\u003eEveryone looked at each other in dismay. Xing Ao said, “Impossible. Then we really have stop here.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry everyone. Although I can’t tell you the specifics of this magic array, I reckon the use of this magic array should be similar enough. Let’s test it out.”\u003c/p\u003e\n\u003cp\u003eI made everyone disperse first before walking into the center of the magic array’s hexagram. After reading the book, I knew that a magic array requires a large amount of magic power from a magic source to activate. The most crucial point is that the mage must have enough mana to completely satisfy the needs of the magic array, otherwise the magic array won’t activate and would even bring harm to the mage. Fortunately, my magic as a magister should be sufficient.\u003c/p\u003e\n\u003cp\u003e“This magic array has long existed since ancient times. By using my magic as a medium, I’ll be able to open it.” The book had said that a magic array’s core was at its center. I collected light elements into my right hand and, with an incantation, poured them into the core of the array. The array’s core was like a bottomless pit, quickly swallowing my magic power. Dim golden rays of light rose from the huge magic array. I did my utmost to hasten the condensation of the surrounding light elements into my golden sphere, and unceasingly inserted it into the core. However, my magic power continued to weaken with the intensity of the insertion. The magic array’s golden shape grew increasingly brilliant.\u003c/p\u003e\n\u003cp\u003eRight as the oil, which was fueling my lamp, was about to dry up, the magic array ceased absorbing my magic power. The moment I released a giant sigh of relief, an unprecedentedly dazzling radiance burst forth from the array. Seeing this, I knew that the magic array was about to activate so I shouted to the others, “Quickly! Everyone quickly enter the hexagram! The array is about to activate.” I immediately began running towards one of the corners of the hexagram because I knew that only the six corners of the hexagram provided the greatest amount of protection against the magical array.\u003c/p\u003e\n\u003cp\u003eThe group’s shadows parted, flashing to the other five corners of the hexagram. Just as we stepped on, we felt the sky spin. The magic array’s golden rays of light faded away with us into the air.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhoosh. \u003c/em\u003e\u0026nbsp;We all fell onto the floor at the same time. Thanks to the gold light we could see a bit of our surroundings in the pitch black darkness.\u003cem\u003e ‘We should be in the belly of the mountain.’\u003c/em\u003e The gold light in the center began to grow dimmer and dimmer before we were suddenly enveloped within complete darkness.\u003c/p\u003e\n\u003cp\u003e“Everyone don’t move yet. Stay on guard while I recover my magic power for a bit. Then we’ll continue forward.”\u003c/p\u003e\n\u003cp\u003e“Light elements, my friends, I beseech of you to illuminate the earth.” This was the first spell I had ever learned, illumination.\u003c/p\u003e\n\u003cp\u003eA light sparked from my hand and the environment shone as if it were day. I first saw everyone sitting in a single circle around me. Nobody had completely adapted to the dazzling light yet. The cave was as tall as two people and about five meters wide. The area ahead was so dark, we could not tell how deep it reached. The entire cave’s walls and floors were abnormally smooth. It was obviously polished.\u003c/p\u003e\n\u003cp\u003eEveryone began cautiously surveying the surroundings. Xiu Si said, “It seems that we’re in the belly of the mountain. The Holy Sword should be in here.”\u003c/p\u003e\n\u003cp\u003eBig Brother Zhan Hu said, “Everyone be cautious. Xiu Si and I will lead the way. Zhang Gong will be at the center. Gao De, Xing Ao and Dong Ri will be in the back. Let’s go.”\u003c/p\u003e\n\u003cp\u003eWe kept formation as we walked onward. The illumination was only able to light up 10 meters ahead, so we treaded carefully forward. However, there seemed to be no end. We had already walked for an unknown amount of time and the circumstances had not changed one bit.\u003c/p\u003e\n\u003cp\u003e“Wait a moment everyone.” I felt that there was something wrong with the situation so I had everyone halt. I took my magic staff out of my dimensional bag and continued, “I don’t know if my feeling is right, but I think we’re going in circles. I’ll leave behind this seal and we’ll see if we come across it again later.”\u003c/p\u003e\n\u003cp\u003eXiu Si said, “I feel the same. \u0026nbsp;Let’s hasten our pace.”\u003c/p\u003e\n\u003cp\u003eWe sped forward. Sure enough, in approximately half the time, we returned to where I had placed my magic staff. I picked up my staff from the ground and scowled.”\u003c/p\u003e\n\u003cp\u003eDong Ri said, “What are we going to do? Could it be that this is a labyrinth?\u003c/p\u003e\n\u003cp\u003eI said, “No, this shouldn’t be a labyrinth. It seems we still haven’t found the crucial location. There should be some kind of mechanism.” With this said, I sat cross legged on the ground and released my spiritual energy to look for a way out. I felt my surroundings were made up of entirely impermeable mountain rock. Only the ground seemed to be hollow.\u003c/p\u003e\n\u003cp\u003eI stood up and had everyone stand apart. I pointed to the ground and said, “The ground is contrastingly empty. Let’s try and see if we can break a hole through.”\u003c/p\u003e\n\u003cp\u003eBig Brother Zhan Hu said, “I will.” \u0026nbsp;He waved his knights sword and slashed with white battle spirit toward the ground. \u003cem\u003eBang\u003c/em\u003e. Dust filled the air.\u003c/p\u003e\n\u003cp\u003eBefore the dust had even settled, the entire cave began shaking. I shouted, “This isn’t good! Everyone gather here quickly and concentrate your powers.” After everyone gathered around me, I cast a protective cover on all of us. In return, they all used their battle spirits to form a formidable energy cover. Right as they finished forming their energy covers, the floor beneath our feet crumbled away. We all fell into the bottomless abyss together.\u003c/p\u003e\n\u003cp\u003eNot knowing how far we dropped, the energy cover eventually hit the ground. \u003cem\u003eHong\u003c/em\u003e. The energy cover holding the six of us shattered and everyone scattered. The formidable impact made us all receive varying concussions, knocking us all out\u003c/p\u003e\n\u003cp\u003eI felt myself completely sink into a dark vortex. My surroundings had many vague things revolving around me. The feeling of dizziness circled around me.\u003c/p\u003e\n\u003cp\u003eSuddenly a warm voice called out to me, “Child. Come back. \u0026nbsp;Don’t give up. Come back!”\u003c/p\u003e\n\u003cp\u003eA warm power surrounded me and the spinning surroundings gradually slowed down. Soon after, everything faded away and once again, I sunk into the darkness. Yet, my mind was gradually recovering.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-42\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-44\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-3-chapter-43","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
