{"id":48374,"no":92,"title":"Volume 4: Chapter 1 Returning Home","content":"\u003cp\u003e\u003cb\u003e\u003cu\u003e\u003cspan\u003eVolume 4: Chapter 1 – Returning Home\u003c/span\u003e\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter we bid farewell to the friendly Nature Elves, we started to head home. We had finally reached the Xiuda border. Apart from me, everyone had feelings of intimacy as they returned to their homeland.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter three days, at a forked road, we stopped as one of the roads led to Xiuda and the other led to the Aixia kingdom. It was finally time to split. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBig Brother Zhan Hu said, “Zhang Gong, you have to take care of yourself, I will go with the rest to Xiuda to visit my father and family and then head back to my bandit’s nest to practice.” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI replied, “Big Brother, you also have to take care of yourself. Once I return to Aixia, I will also practice hard. In about three years, when I feel that I can seek the Holy God’s inheritance, I will come and find you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXiu Si said, “Everyone must be diligent. Zhang Gong, after three years, we will meet up at Xiuda.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI nodded my head. The rims of my eyes started to get moist. “Yes! When you head back, please give my regards to Teacher Wen. Dong Ri, you should stop feeling inferior. Except for us, how many people in the world had obtained the God’s inheritance? We are all great, and Hong Xue is a good girl. You have to cherish her.” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDong Ri embraced my wide shoulders and cried, saying, “Zhang Gong, thank you. I will miss you. Please take care of yourself on your way home.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWe had a group hug. I deeply breathed in a mouthful of fresh air and wiped my tears off my face, saying, “Everyone take care, our Radiant Battle Squad is the best. I shall head off.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter I said that, I spun around and stepped onto the road home. The tears I had suppressed flowed once more.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThere were three months left till the end of the two-year appointment I made with Teacher Di. The first thing on my mind was to head home to see my parents. It had been more a year since I last saw them. I missed them greatly. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSince I was alone, I moved as quickly as possible to an isolated place to use teleportation. I would just need about ten days to reach the city of Sen Ke. I can see them soon. First, I decided to buy them presents. When I reached Sen Ke, I bought mother’s favorite cake and father’s favorite fruits. I started to carry all of them home. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMy familiar village, I have returned. Many of the village children looked at me curiously. It was obvious that I had become an outsider.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWho is that in front of me? A familiar figure appeared in the area about fifty metres in front of me. He had a tall, strong and sturdy body. There was a girl beside him who was dainty and petite. The two appeared white intimate.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI hurriedly walked forward and patted the sturdy guy’s shoulder. He turned around. Pleasantly surprised, I said, “Ao De! It really is you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHe looked at me suspiciously, but his expression turned from a bewildered look to a surprised one. “Zhang Gong, is it you? It really is you.” We excitedly hugged each other. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAo De said, “You have finally returned. Your mother missed you deeply. You are taller and more robust than before. I am so envious that you can go to the city to learn magic.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe girl beside Ao De pulled him to her and asked, “Ao De, who is he?” At that moment, I started to size her up. She was a pretty girl. She had a pair of large eyes that showed wittiness. A water green colored skirt showed her dainty and delicate body. She also had thick and long braided hair. \u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAo De awkwardly smiled at me and said, “Come, let me introduce you. This is my girlfriend, Luo Yu Hong, and this is Zhang Gong Wei. He is my childhood best friend. He is also an extremely powerful magician.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI smiled at Ao De and extended my hand. “Hi, you can call me Zhang Gong. It is a pleasure to meet you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLou Yu naturally gripped my hand and said, “Hi! I am glad to meet you too.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI softly punched at Ao De and said, “You rascal, you are capable of finding such a pretty girlfriend. I am so jealous!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHe laughed and said, “That’s correct, Luo Yu is our school’s flower. Only after I persistently wooed her did I finally get her. Your conditions are better than mine. There will definitely be lots of girls that will love you.” After hearing what Ao De had said, Luo Yu, who was beside him, started to pinch him till he screamed out in pain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI scratched my head and said, “I have never thought about that problem before. Next time, after I get into the advanced magic academy, I shall find one. Ha ha.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAo De said, “I heard from your mother that your teacher had sent you out to gain experience. How was it? This experience will not delay your studies, will it?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“That does not matter, going out was very beneficial to my training. Alright, I see that you are busy and I’m also in a rush to head home. Come over for dinner tonight.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Alright, I’ll go and find you tonight. We brothers should go and have a good drink tonight.” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLuo Yu, who was beside Ao De, pulled his ears and unhappily said, “You are not allowed to drink! You are quickly becoming a drunkard!” At that sight, I started to laugh. “Have fun arguing! I shall head off first.” After saying that, I ran off.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAt the entrance of the house, I shouted, “Mother, Father, I’m back, I’m back!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe door creaked open, then mother came walking out from inside. It had been nearly two years since the two had met. She looked like she had aged a little. “Zhang Gong, my child, you have finally returned home. I missed you to death.” Mother opened the door fully and started to hug me. I hugged her back. “Mother, I also missed you so much.” Tears uncontrollably started to flow.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAt the same time, father walked out from the house and smiled, saying, “Zhang Gong, you are finally back. Ever since you left, I did not know how many times your mother had cried. She thought about you every day.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Father!” After I let Mother go, I moved to father and gave him a passionate hug. Father said, “Ok, it’s good that you are home. Come, let’s go inside! By coincidence, we were resting today. Otherwise, you would not have been able to find us. Today, let’s allow your mother to cook a few dishes. We, father and son, should really have a good drink.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Great! I love to eat mother’s cooking. Eating outside is never comparable to eating at home!” The feeling of being home is great!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter entering the house, father asked me, “How was trip? What did you experience?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI answered, “It was alright. I did not encounter any major setbacks. It can be considered a success.” Continuing, I told them that years’ experience. Of course, I did not mention any dangerous moments as I didn’t want them to worry.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAfter listening to me, mother said, “It is enough to just return safely!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI said, “Father, mother, why don’t you come with me? Currently, I am sure that I will be capable of taking care of you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eFather looked at mother once, before saying, “No! You just need to train properly. Your mother and I got used to the life here many years ago. Here, the people are simple and honest. The environment is also good and suitable for our retirement.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eI tried to convince them to come with me again, but mother said, “You just need to visit us frequently, but we won’t be able to join you either.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Alright, I will prepare to head there when the time comes. After training at the advanced magic academy for two to three years, I will have to head out again to gain more experience.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-3-chapter-47\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/child-of-light/col-volume-4-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-4-chapter-1","bookId":1498,"creation":"Sep 10, 2019 3:31:03 AM","modification":"Sep 10, 2019 3:31:03 AM"}
