{"id":27581,"no":118,"title":"CHAPTER XII. — Landing To Visit Hivohitee The Pontiff","content":"\u0026nbsp;Landing To Visit Hivohitee The Pontiff, They Encounter An \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Extraordinary Old Hermit; With Whom Yoomy Has A Confidential Interview, But Learns Little\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Gliding on, suddenly we spied a solitary Islander putting out in his canoe from a neighboring cove.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Drawing near, the stranger informed us, that he was just from the face of the great Pontiff, Hivohitee, who, having dismissed his celestial guests, had retired to his private sanctuary. Upon this, Media resolved to land forthwith, and under the guidance of Mohi, proceed inland, and pay a visit to his Holiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Quitting the beach, our path penetrated into the solitudes of the groves. Skirting the way were tall Casaurinas, a species of cypress, standing motionless in the shadows, as files of mutes at a funeral. But here and there, they were overrun with the adventurous vines of the Convolvulus, the Morning-glory of the Tropics, whose tendrils, bruised by the twigs, dropped milk upon the dragon-like scales of the trees.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This vine is of many varieties. Lying perdu, and shunning the garish sun through the day, one species rises at night with the stars; bursting forth in dazzling constellations of blossoms, which close at dawn. Others, slumbering through the darkness, are up and abroad with their petals, by peep of morn; and after inhaling its breath, again drop their lids in repose. While a third species, more capricious, refuse to expand at all, unless in the most brilliant sunshine, and upon the very tops of the loftiest trees. Ambitious flowers! that will not blow, unless in high places, with the bright day looking on and admiring.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here and there, we passed open glades in the woods, delicious with the incense of violets. Balsamic ferns, stirred by the breeze, fanned all the air with aromas. These glades were delightful.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Journeying on, we at length came to a dark glen so deftly hidden by the surrounding copses, that were it not for the miasma thence wafted, an ignorant wayfarer might pass and repass it, time and again, never dreaming of its vicinity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Down into the gloom of this glen we descended. Its sides were mantled with noxious shrubs, whose exhalations, half way down, unpleasantly blended with the piny breeze from the uplands. Through its bed ran a brook, whose incrusted margin had a strange metallic luster, from the polluted waters here flowing; their source a sulphur spring, of vile flavor and odor, where many invalid pilgrims resorted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The woods all round were haunted by the dismal cawings of crows; tap, tap, the black hawk whetted his bill on the boughs; each trunk stalked a ghost; and from those trunks, Hevaneva procured the wood for his idols.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rapidly crossing this place, Yoomy\u0027s hands to his ears, old Mohi\u0027s to his nostrils, and Babbalanja vainly trying to walk with closed eyes, we toiled among steep, flinty rocks, along a wild, zigzag pathway; like a mule-track in the Andes, not so much onward as upward; Yoomy above Babbalanja, my lord Media above him, and Braid-Beard, our guide, in the air, above all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Strown over with cinders, the vitreous marl seemed tumbled together, as if belched from a volcano\u0027s throat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, we came to a tall, slender structure, hidden among the scenic projections of the cliffs, like a monument in the dark, vaulted ways of an abbey. Surrounding it, were five extinct craters. The air was sultry and still, as if full of spent thunderbolts.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Like a Hindoo pagoda, this bamboo edifice rose story above story; its many angles and points decorated with pearl-shells suspended by cords. But the uppermost story, some ten toises in the air, was closely thatched from apex to floor; which summit was gained by a series of ascents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What eremite dwelleth here, like St. Stylites at the top of his column?—a question which Mohi seemed all eagerness to have answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dropping upon his knees, he gave a peculiar low call: no response. Another: all was silent. Marching up to the pagoda, and again dropping upon his knees, he shook the bamboos till the edifice rocked, and its pearl-shells jingled, as if a troop of Andalusian mules, with bells round their necks, were galloping along the defile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length the thatch aloft was thrown open, and a head was thrust forth. It was that of an old, old man; with steel-gray eyes, hair and beard, and a horrible necklace of jaw-bones.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, issuing from the pagoda, Mohi turned about to gain a view of the ghost he had raised; and no sooner did he behold it, than with King Media and the rest, he made a marked salutation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, the eremite pointed to where Yoomy was standing; and waved his hand upward; when Mohi informed the minstrel, that it was St. Stylites\u0027 pleasure, that he should pay him a visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wondering what was to come, Yoomy proceeded to mount; and at last arriving toward the top of the pagoda, was met by an opening, from which an encouraging arm assisted him to gain the ultimate landing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here, all was murky enough; for the aperture from which the head of the apparition had been thrust, was now closed; and what little twilight there was, came up through the opening in the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In this dismal seclusion, silently the hermit confronted the minstrel; his gray hair, eyes, and beard all gleaming, as if streaked with phosphorus; while his ghastly gorget grinned hideously, with all its jaws.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mutely Yoomy waited to be addressed; but hearing no sound, and becoming alive to the strangeness of his situation, he meditated whether it would not be well to subside out of sight, even as he had come—through the floor. An intention which the eremite must have anticipated; for of a sudden, something was slid over the opening; and the apparition seating itself thereupon, the twain were in darkness complete.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Shut up thus, with an inscrutable stranger posted at the only aperture of escape, poor Yoomy fell into something like a panic; hardly knowing what step to take next. As for endeavoring to force his way out, it was alarming to think of; for aught he knew, the eremite, availing himself of the gloom, might be bristling all over with javelin points.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last, the silence was broken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What see you, mortal?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Chiefly darkness,\" said Yoomy, wondering at the audacity of the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I dwell in it. But what else see you, mortal?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The dim gleaming of thy gorget.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But that is not me. What else dost thou see?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then thou hast found me out, and seen all! Descend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And with that, the passage-way opened, and groping through the twilight, Yoomy obeyed the mandate, and retreated; full of vexation at his enigmatical reception.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On his alighting, Mohi inquired whether the hermit was not a wonderful personage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But thinking some sage waggery lurked in the question; and at present too indignant to enter into details, the minstrel made some impatient reply; and winding through a defile, the party resumed its journey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Straggling behind, to survey the strange plants and flowers in his path, Yoomy became so absorbed, as almost to forget the scene in the pagoda; yet every moment expected to be nearing the stately abode of the Pontiff.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But suddenly, the scene around grew familiar; the path seemed that which had been followed just after leaving the canoes; and at length, the place of debarkation was in sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Surprised that the object of our visit should have been thus abandoned, the minstrel ran forward, and sought an explanation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereupon, Mohi lifted his hands in amazement; exclaiming at the blindness of the eyes, which had beheld the supreme Pontiff of Maramma, without knowing it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old hermit was no other than the dread Hivohitee; the pagoda, the inmost oracle of the isle.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2768/76458.html","bookId":1334,"creation":"Aug 4, 2019 2:14:02 AM","modification":"Aug 4, 2019 2:14:02 AM"}
