{"id":27636,"no":173,"title":"CHAPTER LXVI. — A Flight Of Nightingales From Yoomy\u0027s Mouth","content":"\u0026nbsp;By noon, down came a calm. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh Neeva! good Neeva! kind Neeva! thy sweet breath, dear Neeva!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So from his shark\u0027s-mouth prayed little Vee-Vee to the god of Fair Breezes. And along they swept; till the three prows neighed to the blast; and pranced on their path, like steeds of Crusaders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, that this fine wind had sprung up; the sun riding joyously in the heavens; and the Lagoon all tossed with white, flying manes; Media called upon Yoomy to ransack his whole assortment of songs:—warlike, amorous, and sentimental,—and regale us with something inspiring for too long the company had been gloomy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thy best,\", he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then will I e\u0027en sing you a song, my lord, which is a song-full of songs. I composed it long, long since, when Yillah yet bowered in Odo. Ere now, some fragments have been heard. Ah, Taji! in this my lay, live over again your happy hours. Some joys have thousand lives; can never die; for when they droop, sweet memories bind them up.—My lord, I deem these verses good; they came bubbling out of me, like live waters from a spring in a silver mine. And by your good leave, my lord, I have much faith in inspiration. Whoso sings is a seer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tingling is the test,\" said Babbalanja, \"Yoomy, did you tingle, when that song was composing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All over, Babbalanja.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From sole to crown?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From finger to finger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My life for it! true poetry, then, my lord! For this self-same tingling, I say, is the test.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And infused into a song,\" cried Yoomy, \"it evermore causes it so to sparkle, vivify, and irradiate, that no son of man can repeat it without tingling himself. This very song of mine may prove what I. — say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Modest youth!\" sighed Media.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not more so, than sincere,\" said Babbalanja. \"He who is frank, will often appear vain, my lord. Having no guile, he speaks as freely of himself, as of another; and is just as ready to honor his own merits, even if imaginary, as to lament over undeniable deficiencies. Besides, such men are prone to moods, which to shallow-minded, unsympathizing mortals, make their occasional distrust of themselves, appear but as a phase of self-conceit. Whereas, the man who, in the presence of his very friends, parades a barred and bolted front,—that man so highly prizes his sweet self, that he cares not to profane the shrine he worships, by throwing open its portals. He is locked up; and Ego is the key. Reserve alone is vanity. But all mankind are egotists. The world revolves upon an I; and we upon ourselves; for we are our own worlds:—all other men as strangers, from outlandish, distant climes, going clad in furs. Then, whate\u0027er they be, let us show our worlds; and not seek to hide from men, what Oro knows.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Truth, my lord,\" said Yoomy, \"but all this applies to men in mass; not specially, to my poor craft. Of all mortals, we poets are most subject to contrary moods. Now, heaven over heaven in the skies; now layer under layer in the dust. This, the penalty we pay for being what we are. But Mardi only sees, or thinks it sees, the tokens of our self-complacency: whereas, all our agonies operate unseen. Poets are only seen when they soar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The song! the song!\" cried Media. \"Never mind the metaphysics of genius.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Yoomy, thus clamorously invoked, hemmed thrice, tuning his voice for the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But here, be it said, that the minstrel was miraculously gifted with three voices; and, upon occasions, like a mocking-bird, was a concert of sweet sounds in himself. Had kind friends died, and bequeathed him their voices? But hark! in a low, mild tenor, he begins:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Half-railed above the hills, yet rosy bright,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Stands fresh, and fair, the meek and blushing morn!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; So Yillah looks! her pensive eyes the stars,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; That mildly beam from out her cheek\u0027s young dawn!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; But the still meek Dawn,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Is not aye the form\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Of Yillah nor Morn!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Soon rises the sun,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Day\u0027s race to run:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; His rays abroad,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Flash each a sword,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; And merrily forth they flare!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Sun-music in the air!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; So Yillah now rises and flashes!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Rays shooting from ont her long lashes,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Sun-music in the air!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Her laugh! How it bounds!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Bright cascade of sounds!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Peal after peal, and ringing afar,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Ringing of waters, that silvery jar,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; From basin to basin fast falling!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Fast falling, and shining, and streaming:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Yillah\u0027s bosom, the soft, heaving lake,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Where her laughs at last dimple, and flake!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Oh beautiful Yillah! Thy step so free!—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Fast fly the sea-ripples,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Revealing their dimples,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; When forth, thou hi\u0027st to the frolicsome sea!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;All the stars laugh,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;When upward she looks:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the trees chat\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp;In their woody nooks:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the brooks sing;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the caves ring;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the buds blossom;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the boughs bound;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; All the birds carol;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; And leaves turn round,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Where Yillah looks!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Light wells from her soul\u0027s deep sun\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Causing many toward her to run!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Vines to climb, and flowers to spring;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; And youths their love by hundreds bring!\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Proceed, gentle Yoomy,\" said Babbalanja.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The meaning,\" said Mohi.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The sequel,\" said Media.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My lord, I have ceased in the middle; the end is not yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mysticism!\" cried Babbalanja. \"What, minstrel; must nothing ultimate come of all that melody? no final and inexhaustible meaning? nothing that strikes down into the soul\u0027s depths; till, intent upon itself, it pierces in upon its own essence, and is resolved into its pervading original; becoming a thing constituent of the all embracing deific; whereby we mortals become part and parcel of the gods; our souls to them as thoughts; and we privy to all things occult, ineffable, and sublime? Then, Yoomy, is thy song nothing worth. Alla Mollolla saith, \u0027That is no true, vital breath, which leaves no moisture behind.\u0027 I. — mistrust thee, minstrel! that thou hast not yet been impregnated by the arcane mysteries; that thou dost not sufficiently ponder on the Adyta, the Monads, and the Hyparxes; the Dianoias, the Unical Hypostases, the Gnostic powers of the Psychical Essence, and the Supermundane and Pleromatic Triads; to say nothing of the Abstract Noumenons.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oro forbid!\" cried Yoomy; \"the very sound of thy words affrights me.\" Then, whispering to Mohi—\"Is he daft again?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My brain is battered,\" said Media. \"Azzageddi! you must diet, and be bled.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" sighed Babbalanja, turning; \"how little they ween of the Rudimental Quincunxes, and the Hecatic Spherula!\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2768/76513.html","bookId":1334,"creation":"Aug 4, 2019 2:14:02 AM","modification":"Aug 4, 2019 2:14:02 AM"}
