{"id":27520,"no":57,"title":"CHAPTER LV — Tiffin In A Temple","content":"\u0026nbsp;Upon at last drawing nigh to Odo, its appearance somewhat disappointed me. A small island, of moderate elevation. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But plumb not the height of the house that feasts you. The beach was lined with expectant natives, who, lifting the Chamois, carried us up the beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alighting, as they were bearing us along, King Media, designating a canoe-house hard by, ordered our craft to be deposited therein. This being done, we stepped upon the soil. It was the first we had pressed in very many days. It sent a sympathetic thrill through our frames.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning his steps inland, Media signed us to follow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon we came to a rude sort of inclosure, fenced in by an imposing wall. Here a halt was sounded, and in great haste the natives proceeded to throw down a portion of the stones. This accomplished, we were signed to enter the fortress thus carried by storm. Upon an artificial mound, opposite the breach, stood a small structure of bamboo, open in front. Within, was a long pedestal, like a settee, supporting three images, also of wood, and about the size of men; bearing, likewise, a remote resemblance to that species of animated nature. Before these idols was an altar, and at its base many fine mats.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Entering the temple, as if he felt very much at home, Media disposed these mats so as to form a very pleasant lounge; where he deferentially entreated Yillah to recline. Then deliberately removing the first idol, he motioned me to seat myself in its place. Setting aside the middle one, he quietly established himself in its stead. The displaced ciphers, meanwhile, standing upright before us, and their blank faces looking upon this occasion unusually expressive. As yet, not a syllable as to the meaning of this cavalier treatment of their wooden godships.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We now tranquilly awaited what next might happen, and I earnestly prayed, that if sacrilege was being committed, the vengeance of the gods might be averted from an ignoramus like me; notwithstanding the petitioner himself hailed from the other world. Perfect silence was preserved: Jarl and Samoa standing a little without the temple; the first looking quite composed, but his comrade casting wondering glances at my sociable apotheosis with Media.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now happening to glance upon the image last removed, I was not long in detecting a certain resemblance between it and our host. Both were decorated in the same manner; the carving on the idol exactly corresponding with the tattooing of the king.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, the silence was relieved by a commotion without: and a butler approached, staggering under an immense wooden trencher; which, with profound genuflexions, he deposited upon the altar before us. The tray was loaded like any harvest wain; heaped up with good things sundry and divers: Bread-fruit, and cocoanuts, and plantains, and guavas; all pleasant to the eye, and furnishing good earnest of something equally pleasant to the palate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Transported at the sight of these viands, after so long an estrangement from full indulgence in things green, I was forthwith proceeding to help Yillah and myself, when, like lightning, a most unwelcome query obtruded. Did deities dine? Then also recurred what Media had declared about my shrine in Odo. Was this it? Self- sacrilegious demigod that I was, was I going to gluttonize on the very offerings, laid before me in my own sacred fane? Give heed to thy ways, oh Taji, lest thou stumble and be lost.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But hereupon, what saw we, but his cool majesty of Odo tranquilly proceeding to lunch in the temple?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How now? Was Media too a god? Egad, it must be so. Else, why his image here in the fane, and the original so entirely at his ease, with legs full cosily tucked away under the very altar itself. This put to flight all appalling apprehensions of the necessity of starving to keep up the assumption of my divinity. So without more ado I helped myself right and left; taking the best care of Yillah; who over fed her flushed beauty with juicy fruits, thereby transferring to her cheek the sweet glow of the guava.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hunger appeased, and Media in token thereof celestially laying his hand upon the appropriate region, we proceeded to quit the inclosure. But coming to the wall where the breach had been made, lo, and behold, no breach was to be seen. But down it came tumbling again, and forth we issued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This overthrowing of walls, be it known, is an incidental compliment paid distinguished personages in this part of Mardi. It would seem to signify, that such gentry can go nowhere without creating an impression; even upon the most obdurate substances.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to return to our ambrosial lunch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sublimate, as you will, the idea of our ethereality as intellectual beings; no sensible man can harbor a doubt, but that there is a vast deal of satisfaction in dining. More: there is a savor of life and immortality in substantial fare. Like balloons, we are nothing till filled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And well knowing this, nature has provided this jolly round board, our globe, which in an endless sequence of courses and crops, spreads a perpetual feast. Though, as with most public banquets, there is no small crowding, and many go away famished from plenty.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2768/76397.html","bookId":1334,"creation":"Aug 4, 2019 2:14:01 AM","modification":"Aug 4, 2019 2:14:01 AM"}
