{"id":37869,"no":16,"title":"Two in a Sack","content":"What a life that poor man led with his wife, to be sure! Not a day passed without her scolding him and calling him names, and indeed sometimes she would take the broom from behind the stove and beat him with it. He had no peace or comfort at all, and really hardly knew how to bear it.\n\u003cbr\u003e \n\u003cbr\u003e One day, when his wife had been particularly unkind and had beaten him black and blue, he strolled slowly into the fields, and as he could not endure to be idle he spread out his nets.\n\u003cbr\u003e \n\u003cbr\u003e What kind of bird do you think he caught in his net? He caught a crane, and the crane said, ‘Let me go free, and I’ll show myself grateful.’\n\u003cbr\u003e \n\u003cbr\u003e The man answered, ‘No, my dear fellow. I shall take you home, and then perhaps my wife won’t scold me so much.’\n\u003cbr\u003e \n\u003cbr\u003e Said the crane: ‘You had better come with me to my house,’ and so they went to the crane’s house.\n\u003cbr\u003e \n\u003cbr\u003e When they got there, what do you think the crane took from the wall? He took down a sack, and he said:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of a sack!’\n\u003cbr\u003e \n\u003cbr\u003e Instantly two pretty lads sprang out of the sack. They brought in oak tables, which they spread with silken covers, and placed all sorts of delicious dishes and refreshing drinks on them. The man had never seen anything so beautiful in his life, and he was delighted.\n\u003cbr\u003e \n\u003cbr\u003e Then the crane said to him, ‘Now take this sack to your wife.’\n\u003cbr\u003e \n\u003cbr\u003e The man thanked him warmly, took the sack, and set out.\n\u003cbr\u003e \n\u003cbr\u003e His home was a good long way off, and as it was growing dark, and he was feeling tired, he stopped to rest at his cousin’s house by the way.\n\u003cbr\u003e \n\u003cbr\u003e The cousin had three daughters, who laid out a tempting supper, but the man would eat nothing, and said to his cousin, ‘Your supper is bad.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Oh, make the best of it,’ said she, but the man only said: ‘Clear away!’ and taking out his sack he cried, as the crane had taught him:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack!’\n\u003cbr\u003e \n\u003cbr\u003e And out came the two pretty boys, who quickly brought in the oak tables, spread the silken covers, and laid out all sorts of delicious dishes and refreshing drinks.\n\u003cbr\u003e \n\u003cbr\u003e Never in their lives had the cousin and her daughters seen such a supper, and they were delighted and astonished at it. But the cousin quietly made up her mind to steal the sack, so she called to her daughters: ‘Go quickly and heat the bathroom: I am sure our dear guest would like to have a bath before he goes to bed.’\n\u003cbr\u003e \n\u003cbr\u003e When the man was safe in the bathroom she told her daughters to make a sack exactly like his, as quickly as possible. Then she changed the two sacks, and hid the man’s sack away.\n\u003cbr\u003e \n\u003cbr\u003e The man enjoyed his bath, slept soundly, and set off early next morning, taking what he believed to be the sack the crane had given him.\n\u003cbr\u003e \n\u003cbr\u003e All the way home he felt in such good spirits that he sang and whistled as he walked through the wood, and never noticed how the birds were twittering and laughing at him.\n\u003cbr\u003e \n\u003cbr\u003e As soon as he saw his house he began to shout from a distance, ‘Hallo! old woman! Come out and meet me!’\n\u003cbr\u003e \n\u003cbr\u003e His wife screamed back: ‘You come here, and I’ll give you a good thrashing with the poker!’\n\u003cbr\u003e \n\u003cbr\u003e The man walked into the house, hung his sack on a nail, and said, as the crane had taught him:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack!’\n\u003cbr\u003e \n\u003cbr\u003e But not a soul came out of the sack.\n\u003cbr\u003e \n\u003cbr\u003e Then he said again, exactly as the crane had taught him:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack!’\n\u003cbr\u003e \n\u003cbr\u003e His wife, hearing him chattering goodness knows what, took up her wet broom and swept the ground all about him.\n\u003cbr\u003e \n\u003cbr\u003e The man took flight and rushed oft into the field, and there he found the crane marching proudly about, and to him he told his tale.\n\u003cbr\u003e \n\u003cbr\u003e ‘Come back to my house,’ said the crane, and so they went to the crane’s house, and as soon as they got there, what did the crane take down from the wall? Why, he took down a sack, and he said:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack!’\n\u003cbr\u003e \n\u003cbr\u003e And instantly two pretty lads sprang out of the sack, brought in oak tables, on which they laid silken covers, and spread all sorts of delicious dishes and refreshing drinks on them.\n\u003cbr\u003e \n\u003cbr\u003e ‘Take this sack,’ said the crane.\n\u003cbr\u003e \n\u003cbr\u003e The man thanked him heartily, took the sack, and went. He had a long way to walk, and as he presently got hungry, he said to the sack, as the crane had taught him:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack!’\n\u003cbr\u003e \n\u003cbr\u003e And instantly two rough men with thick sticks crept out of the bag and began to beat him well, crying as they did so:\n\u003cbr\u003e \n\u003cbr\u003e ‘Don’t boast to your cousins of what you have got,\n\u003cbr\u003e One — two —\n\u003cbr\u003e Or you’ll find you will catch it uncommonly hot,\n\u003cbr\u003e One — two —’\n\u003cbr\u003e \n\u003cbr\u003e And they beat on till the man panted out:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two into the sack.’\n\u003cbr\u003e \n\u003cbr\u003e The words were hardly out of his mouth, when the two crept back into the sack.\n\u003cbr\u003e \n\u003cbr\u003e Then the man shouldered the sack, and went off straight to his cousin’s house. He hung the sack up on a nail, and said: ‘Please have the bathroom heated, cousin.’\n\u003cbr\u003e \n\u003cbr\u003e The cousin heated the bathroom, and the man went into it, but he neither washed nor rubbed himself, he just sat there and waited.\n\u003cbr\u003e \n\u003cbr\u003e Meantime his cousin felt hungry, so she called her daughters, and all four sat down to table. Then the mother said:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack.’\n\u003cbr\u003e \n\u003cbr\u003e Instantly two rough men crept out of the sack, and began to beat the cousin as they cried:\n\u003cbr\u003e \n\u003cbr\u003e ‘Greedy pack! Thievish pack!\n\u003cbr\u003e \n\u003cbr\u003e One — two —\n\u003cbr\u003e Give the peasant back his sack!\n\u003cbr\u003e \n\u003cbr\u003e One — two —’\n\u003cbr\u003e \n\u003cbr\u003e And they went on beating till the woman called to her eldest daughter: ‘Go and fetch your cousin from the bathroom. Tell him these two ruffians are beating me black and blue.’\n\u003cbr\u003e \n\u003cbr\u003e ‘I’ve not finished rubbing myself yet,’ said the peasant.\n\u003cbr\u003e \n\u003cbr\u003e And the two ruffians kept on beating as they sang:\n\u003cbr\u003e \n\u003cbr\u003e ‘Greedy pack! Thievish pack!\n\u003cbr\u003e One — two —\n\u003cbr\u003e Give the peasant back his sack!\n\u003cbr\u003e \n\u003cbr\u003e One — two —’\n\u003cbr\u003e \n\u003cbr\u003e Then the woman sent her second daughter and said: ‘Quick, quick, get him to come to me.’\n\u003cbr\u003e \n\u003cbr\u003e ‘I’m just washing my head,’ said the man.\n\u003cbr\u003e \n\u003cbr\u003e Then she sent the youngest girl, and he said: ‘I’ve not done drying myself.’\n\u003cbr\u003e \n\u003cbr\u003e At last the woman could hold out no longer, and sent him the sack she had stolen.\n\u003cbr\u003e \n\u003cbr\u003e NOW he had quite finished his bath, and as he left the bathroom he cried:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two into the sack.’\n\u003cbr\u003e \n\u003cbr\u003e And the two crept back at once into the sack.\n\u003cbr\u003e \n\u003cbr\u003e Then the man took both sacks, the good and the bad one, and went away home.\n\u003cbr\u003e \n\u003cbr\u003e When he was near the house he shouted: ‘Hallo, old woman, come and meet me!’\n\u003cbr\u003e \n\u003cbr\u003e His wife only screamed out:\n\u003cbr\u003e \n\u003cbr\u003e ‘You broomstick, come here! Your back shall pay for this.’\n\u003cbr\u003e \n\u003cbr\u003e The man went into the cottage, hung his sack on a nail, and said, as the crane had taught him:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack.’\n\u003cbr\u003e \n\u003cbr\u003e Instantly two pretty lads sprang out of the sack, brought in oak tables, laid silken covers on them, and spread them with all sorts of delicious dishes and refreshing drinks.\n\u003cbr\u003e \n\u003cbr\u003e The woman ate and drank, and praised her husband.\n\u003cbr\u003e \n\u003cbr\u003e ‘Well, now, old man, I won’t beat you any more,’ said she.\n\u003cbr\u003e \n\u003cbr\u003e When they had done eating, the man carried off the good sack, and put it away in his store-room, but hung the bad sack up on the nail. Then he lounged up and down in the yard.\n\u003cbr\u003e \n\u003cbr\u003e Meantime his wife became thirsty. She looked with longing eyes at the sack, and at last she said, as her husband had done:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two out of the sack.’\n\u003cbr\u003e \n\u003cbr\u003e And at once the two rogues with their big sticks crept out of the sack, and began to belabour her as they sang:\n\u003cbr\u003e \n\u003cbr\u003e ‘Would you beat your husband true?\n\u003cbr\u003e \n\u003cbr\u003e Don’t cry so!\n\u003cbr\u003e Now we’ll beat you black and blue!\n\u003cbr\u003e Oh! Oh!’\n\u003cbr\u003e \n\u003cbr\u003e The woman screamed out: ‘Old man, old man! Come here, quick! Here are two ruffians pommelling me fit to break my bones.’\n\u003cbr\u003e \n\u003cbr\u003e Her husband only strolled up and down and laughed, as he said: ‘Yes, they’ll beat you well, old lady.’\n\u003cbr\u003e \n\u003cbr\u003e And the two thumped away and sang again:\n\u003cbr\u003e \n\u003cbr\u003e ‘Blows will hurt, remember, crone,\n\u003cbr\u003e We mean you well, we mean you well;\n\u003cbr\u003e In future leave the stick alone,\n\u003cbr\u003e \n\u003cbr\u003e For how it hurts, you now can tell,\n\u003cbr\u003e One — two —’\n\u003cbr\u003e \n\u003cbr\u003e At last her husband took pity on her, and cried:\n\u003cbr\u003e \n\u003cbr\u003e ‘Two into the sack.’\n\u003cbr\u003e \n\u003cbr\u003e He had hardly said the words before they were back in the sack again.\n\u003cbr\u003e \n\u003cbr\u003e From this time the man and his wife lived so happily together that it was a pleasure to see them, and so the story has an end.\n\u003cbr\u003e \n\u003cbr\u003e [From Russiche Marchen.]\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1402/41992.html","bookId":1408,"creation":"Aug 5, 2019 8:18:00 AM","modification":"Aug 5, 2019 8:18:00 AM"}
