{"id":76219,"no":11,"title":"Page 11","content":"\u003cp\u003eEyes still on me, Jean asked Alex a calm, threeword question in German. Blanceagle responded in the same language—a negative answer.\u003c/p\u003e\n\u003cp\u003eJean held out his hand.\u003c/p\u003e\n\u003cp\u003eAlex struggled to his feet. He limped over to us, trying to keep the weight off his recently kicked shin. He started fumbling with his pockets, pulling out the recording cartridges one by one, and handing them to Jean.\u003c/p\u003e\n\u003cp\u003eTwo of the discs clattered to the floor. When Alex bent over to get them, Jean kicked him in the ribs just hard enough to send Blanceagle sprawling. Jean did it without anger or change of expression, the way a kid might push over a rolypoly bug.\u003c/p\u003e\n\u003cp\u003eAlex stayed on the carpet, blinking, reorienting himself, then began the process of getting his limbs to work.\u003c/p\u003e\n\u003cp\u003eJean\u0027s next question, still in German, was aimed at me.\u003c/p\u003e\n\u003cp\u003eI shrugged helplessly. Jean looked at Alex, who was now up on one elbow and seemed quite content to stay that way.\u003c/p\u003e\n\u003cp\u003eBlanceagle squinted up at me for a long time. He said, slowly and deliberately, \"He\u0027s a steel player, for God\u0027s sake. I forgot to reschedule the fucking base track session tonight, is all.\"\u003c/p\u003e\n\u003cp\u003eJean scrutinized me one more time, trying to burn a hole in my face with those little crab eyes. I tried to look like an ignorant steel guitar player. I managed the ignorant part pretty well.\u003c/p\u003e\n\u003cp\u003eFinally Jean nodded at the door. \"Get out, then.\"\u003c/p\u003e\n\u003cp\u003eHis English was perfect, the accent British. A German speaker with a French name and a British accent. It made about as much sense as anything else I\u0027d come across so far. I looked down at Alex Blanceagle.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about those base tracks,\" Alex told me. \"I\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003eThere was absolutely no confidence in his voice.\u003c/p\u003e\n\u003cp\u003eAs I left, Jean and Alex were having a very quiet, very reasonable conversation in German. Jean did most of the talking, slapping the gray and black Beretta against his thigh with a casual carelessness that reminded me very much of his boss, Tilden Sheckly.\u003c/p\u003e\n\u003cp\u003eWhen I got back to the main room I could\u0027ve stuck around longer. Tammy Vaughn was just starting her first number, \"Daddy Taught Me Dancin\u0027.\" I wasn\u0027t a country fan but I had heard it once or twice on the radio and Tammy sounded fine. The two hundred or so folks on the dance floor looked like a paltry crowd in the vastness of the hall, but they were hooting and hollering their best. Tilden Sheckly was standing by the sound board, still having a lively argument with the woman in the skyblue jumpsuit. I could\u0027ve asked a lot of questions, done some twostepping with bighaired women, maybe met a few more nice men with guns.\u003c/p\u003e\n\u003cp\u003eInstead I said goodbye to Leena the bartender. She was busy now, a bottle of tequila in either hand, but she told me to stick around for a while longer. Her break was coming up soon.\u003c/p\u003e\n\u003cp\u003eI told her thanks anyway. I\u0027d had enough of the Indian Paintbrush for one night.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eWhen I woke up Tuesday I stared at the ceiling for a long time. I felt queasy, disoriented, like I\u0027d been looking through someone else\u0027s prescription lenses too long.\u003c/p\u003e\n\u003cp\u003eI groped along the windowsill until I found the business card from Julie Kearnes\u0027 wallet.\u003c/p\u003e\n\u003cp\u003eThe words on it hadn\u0027t changed.\u003c/p\u003e\n\u003cp\u003eLES SAINTPIERRE TALENT MILO CHAVEZ, ASSOCIATE\u003c/p\u003e\n\u003cp\u003eMilo\u0027s wad of fifties was still there, too, not much lighter for my night on the town.\u003c/p\u003e\n\u003cp\u003eFinally I got up, did the Chen long form in the backyard, then showered and made migas for myself and Robert Johnson.\u003c/p\u003e\n\u003cp\u003eI checked the latest Austin Chronicle. Miranda Daniels was scheduled to start at the Cactus Cafe at eight P.M. After doing the dishes, I called my brother Garrett and left a message telling him surprise, we had plans tonight. I love my brother. I love having a free place to sleep in Austin even more.\u003c/p\u003e\n\u003cp\u003eI tried Detective Schaeffer at SAPD homicide. Schaeffer wasn\u0027t in. Milo Chavez wasn\u0027t in either.\u003c/p\u003e\n\u003cp\u003eI peeled off a stack of Milo\u0027s fifties, enough for my October rent, and left it in an envelope on the counter. Gary Hales would find it. Maybe, if things went well between now and next Friday, I would be able to spring for November too. But not yet.\u003c/p\u003e\n\u003cp\u003eI left extra water and Friskies on the kitchen counter and a piece of newspaper where Robert Johnson would, inevitably, throw up when he realized I was gone overnight.\u003c/p\u003e\n\u003cp\u003eThen I headed out for the VW.\u003c/p\u003e\n\u003cp\u003eI hit Austin just after noon and spent a few more fruitless hours visiting Les SaintPierre\u0027s hangouts, talking to people who hadn\u0027t seen him recently. This time I claimed to be a songwriter trying to get my tape to Les. I told everybody I had a great new surefire hit called \"Lovers from Lubbock.\" I found it difficult to generate much excitement.\u003c/p\u003e\n\u003cp\u003eAfter a late lunch I swung by Waterloo Records on North Lamar and found a Julie Kearnes cassette from 1979 in the bargain bin. I bought it. There were no recordings by Miranda Daniels yet. There were quite a few CDs in the Texas Artist section on Sheckly\u0027s Split Rail label—such household names as Clay Bamburg and the Sagebrush Boys, Jeff Whitney, the Perdenales Polka Men. I didn\u0027t buy them.\u003c/p\u003e\n\u003cp\u003eI drove north on Lamar, right on Thirtyeighth, into Hyde Park, following the route I\u0027d taken last week on surveillance. I turned left on Speedway and parked across the street from Julie Kearnes\u0027 house.\u003c/p\u003e\n\u003cp\u003eThe Hyde Park neighbourhood is not quite as snooty as the name implies. It\u0027s equal parts college kid, aging hippie, and aging yuppie. It\u0027s got its share of bad elements—sleazy Laundromats, dilapidated student housing, Baptist churches. The streets are quiet, shaded by live oaks, and lined with quaintly rundown 1940s starter homes.\u003c/p\u003e\n\u003cp\u003eJulie Kearnes\u0027 place was just rundown, not quaint. Back in the sixties it had probably been what my brother Garrett called a \"hobbit house.\" Above the door a round stainedglass peace sign window was now grimy and broken, and the comets and suns that had once been painted along the trim of the roof and windows had been thinly whitewashed over. The yellow front lawn was shaded by a pecan tree so infested with web worms it looked like a cotton candy stick. About the only thing that looked well tended was Julie\u0027s planter box underneath the livingroom window, full of purple and yellow pansies. Even those were starting to wilt.\u003c/p\u003e\n\u003cp\u003eAfternoon traffic on Speedway was heavy. An orange UT shuttle went by. Ford trucks with lawn mowers and rakes and whole Latino families in the back cruised for unkempt front yards. A good number of seventies Hondas and VW bugs puttered down the street with peeling bumper stickers like UNREAGANABLE and HONOR THE GODDESS.\u003c/p\u003e\n\u003cp\u003eAustin, the only city in Texas where my car is inconspicuous.\u003c/p\u003e\n\u003cp\u003eNobody paid me any attention. Nobody stopped at the Kearnes residence. If the police had been here they hadn\u0027t left any obvious sign.\u003c/p\u003e\n\u003cp\u003eI was about to cross the street and let myself in when a guy stuck his head in my passenger\u0027s side window and said, \"I thought that was you.\"\u003c/p\u003e\n\u003cp\u003eJulie\u0027s acrossthestreet neighbour had horse like features. He smiled and you expected him to bray or nuzzle you for a sugar cube. His saltandpepper hair was clipped close around the ears, gelled, spiky on top. He wore a blue buttondown shirt tucked into khaki walking shorts, tied with a multicoloured Guatemalan belt, and when he leaned into the car I didn\u0027t so much smell him as experience one of those surrealistic fifteen second designer cologne ads.\u003c/p\u003e\n\u003cp\u003eHe grinned. \"I knew you\u0027d be back. I was sitting on my love seat having an espresso and I thought: I bet that police detective will be back today. Then I looked out the window and here you are.\"\u003c/p\u003e\n\u003cp\u003e\"Here I am,\" I agreed. \"Listen—was it Jose—?\"\u003c/p\u003e\n\u003cp\u003e\"Jarras. Jose Jarras.\" He started to spell it.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great, Mr. Jarras, but—\"\u003c/p\u003e\n\u003cp\u003eJose held up one finger like he\u0027d just remembered something vitally important and leaned farther into my car.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t I tell you?\" he said, lowering his voice. \"I told you something funny was going on.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I admitted. \"You called it.\"\u003c/p\u003e\n\u003cp\u003eI wondered what the hell he was talking about. Maybe Julie\u0027s murder had made the Austin AmericanStatesman. Or maybe Jose was just percolating some of the great theories he\u0027d offered me Saturday morning—how Miss Kearnes needed his help because the Mafia was after her, or the Feds, or the Daughters of the Republic of Texas.\u003c/p\u003e\n\u003cp\u003eJose narrowed his eyes conspiratorially. \"I started thinking about it after I talked to you.\u003c/p\u003e\n\u003cp\u003eI said to myself, why would the police be so interested in her? Why are they staking out her house? She\u0027s got one of those drug dealer boyfriends, doesn\u0027t she? She\u0027ll have to go into the witness protection program.\"\u003c/p\u003e\n\u003cp\u003eI told Jose he had a hell of a deductive mind.\u003c/p\u003e\n\u003cp\u003e\"Poor dear\u0027s been super agitated,\" he confided. \"She\u0027s stopped making those sugar cookies for me. Stopped saying hello. She\u0027s been looking like—well.\"\u003c/p\u003e\n\u003cp\u003eHe waved his hand like I could easily imagine the crimes against fashion the poor dear had been perpetrating. I nodded sympathetically.\u003c/p\u003e\n\u003cp\u003e\"She had that visitor Saturday night...\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I assured him. \"We were watching the house.\"\u003c/p\u003e\n\u003cp\u003eThe visitor had been one of Julie\u0027s girlfriends, an amateur aroma therapist named Vina whose innocuous life story I\u0027d already delved into. Vina had come over to Julie\u0027s with her essential oil kit around eight and left around nine. I didn\u0027t want to tell Jose that the chances of Vina being a mafia hit man were pretty slim.\u003c/p\u003e\n\u003cp\u003eJose leaned farther into my car. Another inch and he\u0027d be in my lap.\u003c/p\u003e\n\u003cp\u003e\"Are you going to break in?\" he asked. \"Check for traps?\"\u003c/p\u003e\n\u003cp\u003eI assured him that it was standard procedure. Nothing to get alarmed about.\u003c/p\u003e\n\u003cp\u003e\"Oh—\" He nodded vigorously. \"I\u0027ll let you get to work. Aren\u0027t you supposed to give me your card, in case I remember something later?\"\u003c/p\u003e\n\u003cp\u003e\"Give me your hand,\" I told him.\u003c/p\u003e\n\u003cp\u003eHe looked uncertain, then thrust it at me. I took my permanent black marker off the dashboard and inscribed Jose\u0027s palm with Erainya\u0027s alternate voicemail number, the one that says: \"You have reached the Criminal Investigations Division.\"\u003c/p\u003e\n\u003cp\u003eHe frowned at it for a minute.\u003c/p\u003e\n\u003cp\u003e\"Budget cutbacks,\" I explained.\u003c/p\u003e\n\u003cp\u003eWhen I got to Julie\u0027s front door it took me about two minutes to find the right dupe for the dead bolt. I leaned leisurely against the door frame, trying different keys and whistling while I worked. I smiled at an elderly couple walking by. Nobody yelled at me.\u003c/p\u003e\n\u003cp\u003eNobody set off any alarms.\u003c/p\u003e\n\u003cp\u003eA licensed P.I. will tell you that committing crimes in the line of work is a myth. P.I.s gather evidence that might be used in court, and any evidence gathered illegally automatically ruins the case. So P.I.s are good boys and girls. They do surveillance from public property. They keep their noses clean.\u003c/p\u003e\n\u003cp\u003eIt\u0027s ninety percent true. The other ten percent of the time you need to find out something or retrieve something that\u0027s never going to see its way into court, and the client—usually a lawyer—doesn\u0027t care how illegally you do it as long as you don\u0027t get caught and traced back to them. They\u0027d just assume use somebody unprincipled and unlicensed who can play a discreet game of hardball. That\u0027s how I\u0027d worked for five years in San Francisco— unprincipled and unlicensed. Then I\u0027d moved back to Texas, where my dad\u0027s old friends on the force had put increasing pressure on me to get licensed and work right.\u003c/p\u003e\n\u003cp\u003eNone of them wanted the embarrassment of busting Jack Navarre\u0027s kid.\u003c/p\u003e\n\u003cp\u003eI jimmied the side bolt. Then I took the two days\u0027 worth of mail from Julie\u0027s box and went inside.\u003c/p\u003e\n\u003cp\u003eThe kitchen smelled like lemon and ammonia. The hardwood floors had been swept.\u003c/p\u003e\n\u003cp\u003eCopies of Fiddle Player and Nashville Today were neatly stacked on the glass topped fruit crate that served as a coffee table. There were fresh cut flowers on the dining table. She\u0027d left an orderly home for someone who was never coming back to it. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-11.html","bookId":2417,"creation":"Oct 5, 2019 10:37:56 AM","modification":"Oct 5, 2019 10:37:56 AM"}
