{"id":76229,"no":21,"title":"Page 21","content":"\u003cp\u003e\"Equipment in a horse trailer,\" I said. \"Inventive.\"\u003c/p\u003e\n\u003cp\u003eBrent nodded. \"Cheaper than a van. Willis got a good deal on it.\"\u003c/p\u003e\n\u003cp\u003eWe stood there. I wasn\u0027t quite sure why Brent was staying to talk. Then I realized that for some reason he wanted me to leave first.\u003c/p\u003e\n\u003cp\u003eWhen you\u0027ve got an advantage, I say press it.\u003c/p\u003e\n\u003cp\u003e\"I was talking to Miranda about your music this morning. She said you wrote most of the songs. Said you were real supportive about her recording them.\"\u003c/p\u003e\n\u003cp\u003eBrent hooked his fingers on the door handle of the Ford and hung them there. His expression was hard to read, mostly gruff apathy with maybe a little dry amusement around the edges. With the facial stubble a day thicker I could see that some of the whiskers were coming up white, like his dad\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Supportive,\" he repeated. \"That a fact?\"\u003c/p\u003e\n\u003cp\u003e\"She seems to think so. You ever try to record on your own? Make it in Nashville?\u003c/p\u003e\n\u003cp\u003eYou\u0027ve got some nice songs.\"\u003c/p\u003e\n\u003cp\u003eThat brought the amusement a little closer to the surface. A tic started going in Brent\u0027s left eye, like he was trying to smile but was having a shortcircuit problem.\u003c/p\u003e\n\u003cp\u003e\"Ask Les about that,\" he said. \"I\u0027m fortytwo, didn\u0027t even start writing—\" He caught himself, decided to change tack. \"I didn\u0027t start writing until about two years ago. Most artists making it—fifteen to eighteen, some even younger. Miranda\u0027s barely okay at twentyfive. Les says you\u0027re over thirty as an artist, you\u0027re pretty much dogmeat.\"\u003c/p\u003e\n\u003cp\u003e\"Les said that, huh? What is Les—fortyfive?\"\u003c/p\u003e\n\u003cp\u003eBrent ticked his eye a little more. \"Guess the rule don\u0027t apply to agents.\"\u003c/p\u003e\n\u003cp\u003eWe both looked out at the highway as another semi roared by at planeengine volume.\u003c/p\u003e\n\u003cp\u003eSome raindrops were splattering the asphalt noncommittally, once every few seconds.\u003c/p\u003e\n\u003cp\u003eThe wind was slow, heavy, and hot, and the clouds couldn\u0027t seem to decide what to do—break up or move in. They made the low hills an even darker green, almost purple.\u003c/p\u003e\n\u003cp\u003e\"How about the rest of the band?\" I asked. \"Mr. Sheckly seems to think you folks\u0027ll be left out in the cold if Miranda\u0027s record deal goes through. Anybody besides Cam upset about that?\"\u003c/p\u003e\n\u003cp\u003eBrent lost whatever smile he might\u0027ve been starting to accumulate. He scuffed his boot on the curb, a small sign of impatience. \"Suppose you\u0027d have to ask them, wouldn\u0027t you? Julie\u0027s dead. Cam\u0027s fired. Pretty much leaves Ben French and the family, don\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eBehind us a trucker was flirting with one of the Baptist women, calling her Sweet Thing.\u003c/p\u003e\n\u003cp\u003eShe was trying to keep her polyethylene smile in place, talking about how Jesus wanted the trucker to have some coffee and stay awake out there on the road. Her tone wasn\u0027t very convincing.\u003c/p\u003e\n\u003cp\u003e\"You got a day job?\" I asked Brent.\u003c/p\u003e\n\u003cp\u003e\"Nope. How about you?\"\u003c/p\u003e\n\u003cp\u003eAh. A hint.\u003c/p\u003e\n\u003cp\u003eBrent kept his fingers hooked on the door, making no move to open it. I looked at the silvered window of the cab and saw nothing but me, bubbly and smeared in the glass.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know better,\" I told Brent, \"I\u0027d think you didn\u0027t want to open that door.\"\u003c/p\u003e\n\u003cp\u003eBrent looked at his boot, then sideways at the Latino mutt dog, which was now doing tight orbits around the metal poles of the breezeway.\u003c/p\u003e\n\u003cp\u003eBrent smiled at the little dog.\u003c/p\u003e\n\u003cp\u003e\"You working for Milo?\" Brent asked me.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eBrent nodded. \"You best get at it, then.\"\u003c/p\u003e\n\u003cp\u003eHe opened the door of the cab and got in, trying not to be too quick about it. I tried not to be too obvious about looking, but there wasn\u0027t much to see—just a woman\u0027s tan feet crossed at the ankles, propped up on the window in the miniature backseat like she was sleeping back there. She had painted toenails and a little gold ankle chain.\u003c/p\u003e\n\u003cp\u003eBrent closed the door and was lost behind the window tinting.\u003c/p\u003e\n\u003cp\u003eThe truck pulled out and a big plop of warm rain landed squarely on my nose.\u003c/p\u003e\n\u003cp\u003eThe Baptist lady breathed a sigh of relief because the flirtatious trucker had just left.\u003c/p\u003e\n\u003cp\u003eShe called over to me and offered me a donut. I told her thanks but Jesus would have to find somebody else. All she had left were the jellyfilled variety.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003e\"It\u0027s registered,\" Ralph Arguello told me. He slid into the backseat of his maroon Lincoln with me, then returned the Montgomery Ward .22. Chico pulled the car out of the pawnshop parking lot and headed south on Bandera.\u003c/p\u003e\n\u003cp\u003e\"You were in there all of five minutes,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yeah. Sorry so long. My friend at the data entry office, she does all the firearm slips for the pawnshop detail. Sometimes I don\u0027t want to wait, she\u0027ll do a pre screening for me, you know? Today she was a little busy.\" .\u003c/p\u003e\n\u003cp\u003e\"You get the owner\u0027s name and address?\"\u003c/p\u003e\n\u003cp\u003e\"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I think you probably got his grandmother\u0027s maiden name and his favourite flavour ice cream.\"\u003c/p\u003e\n\u003cp\u003eRalph grinned. \"Que padre, vato.\"\u003c/p\u003e\n\u003cp\u003eWhen Ralph grins he gives the Cheshire cat a bad name. He makes psychopaths nervous. Maybe it\u0027s because you can\u0027t really see his eyes, the way they float behind the inchthick round lenses. Or maybe it\u0027s the red colour his face turns, same as one of those chubby diablo masks they sell in Piedras Negras. When Ralph grins it could mean he\u0027s made an easy thousand dollars or he\u0027s had a good meal or he\u0027s just shot somebody who was annoying him. It\u0027s hard to tell.\u003c/p\u003e\n\u003cp\u003eHe handed me a piece of paper from the front pocket of his white linen guayabera. In Ralph\u0027s meticulous, tiny block print it said: C. COMPTON 1260 PERRINBEITEL SA TX\u003c/p\u003e\n\u003cp\u003e78217.\u003c/p\u003e\n\u003cp\u003e\"I got a story about this guy,\" Ralph offered.\u003c/p\u003e\n\u003cp\u003eThat was no surprise. It was a rare and boring San Antonian Ralph Arguello didn\u0027t have a story about.\u003c/p\u003e\n\u003cp\u003eI read the name C. Compton again.\u003c/p\u003e\n\u003cp\u003e\"Tell me your story.\"\u003c/p\u003e\n\u003cp\u003eRalph produced a joint and started carefully pinching the ends. \"Your man Compton works for that kicker palace, the Indian Paintbrush. You know the place?\"\u003c/p\u003e\n\u003cp\u003e\"I know it.\"\u003c/p\u003e\n\u003cp\u003e\"You remember Robbie Guerra—halfback from Heights?\"\u003c/p\u003e\n\u003cp\u003eI had no idea, as usual, where Ralph was going, or where his information had come from, but I nodded. \"How is Robbie?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s dead, man, but that\u0027s another story. Six months ago we had this nice deal going with a restaurant supply company and some of the places they delivered to. The Indian Paintbrush was one. Every tenth crate set aside, Robbie and me\u0027d pick it up, everybody involved gets a little cut. Compton was some musician or something, but he worked day shifts with the business manager, too, some guy—\"\u003c/p\u003e\n\u003cp\u003e\"Alex Blanceagle. Freckles. Big ears.\"\u003c/p\u003e\n\u003cp\u003e\"—that\u0027s right. Anyway, Compton and Blanceagle knew about our deal with the crates, they got their share, everything was suave. Then one night Robbie and me accidentally skimmed from the wrong shipment, okay? It happens sometimes. We came by on the guard\u0027s Coke break, like normal, everything looked cool, we started taking these big brown cardboard cylinders off the loading dock. We thought maybe they were full of copper piping or something because they were heavier than shit but we figured hell, goods are goods. Five seconds later we had all these gabachos with guns in our faces—Blanceagle and Compton and two German guys screaming in Kraut. Robbie and me got a talkingto, half of it in Kraut, with guns at our heads the whole time. Blanceagle was all yelling like he never saw us before and telling us we were lucky to walk away alive. So we said chupa me. That was the end of one restaurant supply deal.\"\u003c/p\u003e\n\u003cp\u003eRalph lit the mota and took a long drag. He might\u0027ve just been telling me about his last birthday party for all the agitation he showed.\u003c/p\u003e\n\u003cp\u003e\"Describe these Germans.\"\u003c/p\u003e\n\u003cp\u003eRalph gave a pretty accurate description of Jean, the man with the Beretta from Sheckly\u0027s studio. He described another guy who didn\u0027t sound familiar.\u003c/p\u003e\n\u003cp\u003e\"What was in the cylinders?\"\u003c/p\u003e\n\u003cp\u003eRalph blew smoke. \"No se, vato. All those rednecks and Nazis pointing guns at my ass I wasn\u0027t going to ask for no peeks. Probably KKK training kits, right?\"\u003c/p\u003e\n\u003cp\u003eWe drove in silence down Bandera for a few miles, under the Loop, into a residential area where the houses looked like army bunkers, flat and sunken behind old brick privacy walls and overgrown pampas bushes. There was some fresh gang graffiti on the walls. A phone booth on the corner of Callahan had been pried out of the ground and laid flat across a bus bench. On top of it was a line of empty MD 20/20 bottles that a little shirtless boy was hitting with a stick.\u003c/p\u003e\n\u003cp\u003eThe sky wasn\u0027t helping the general impression that this whole neighbourhood had recently been stepped on. A layer of gray clouds was pressing down low, like insu\u003c/p\u003e\n\u003cp\u003elation material. The air had heated up again, and now it was just hanging there, stagnant and heavy.\u003c/p\u003e\n\u003cp\u003eAfter a few blocks Chico leaned his head back and asked Ralph in Spanish if he wanted to stop by Number Fourteen, since we were passing by. Ralph checked his gold Rolex and said sure. Then he got Mr. Subtle out from under the driver\u0027s seat and loaded it. Mr. Subtle is his .357 Magnum.\u003c/p\u003e\n\u003cp\u003e\"The homeboys been making noise,\" he said. \"Pinche kids.\"\u003c/p\u003e\n\u003cp\u003e\"Number Fourteen,\" I said. \"Catchy name.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, man, you get over twenty pawnshops, you try naming them all.\"\u003c/p\u003e\n\u003cp\u003eHe stuck Mr. Subtle in his jeans, underneath the guayabera. Most people couldn\u0027t wear a Magnum like that and look inconspicuous. Most people don\u0027t have Ralph\u0027s girth and his XXL linen shirts.\u003c/p\u003e\n\u003cp\u003eChico found a Def Lepard song on the radio and turned it up. Probably still on the Top Ten in San Antonio.\u003c/p\u003e\n\u003cp\u003e\"So,\" Ralph said, \"you see my niece when you were up in Austin?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s doing fine. Good worker, just like you said.\"\u003c/p\u003e\n\u003cp\u003eRalph ticked. \"She\u0027s going through this con crema phase, man. I don\u0027t get her sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"Con crema?\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean. She won\u0027t speak Spanish. Only dates white guys.\"\u003c/p\u003e\n\u003cp\u003e\"No kidding.\"\u003c/p\u003e\n\u003cp\u003eRalph nodded, shifting a little in his seat. I shifted in my seat. We stared out the windows. He decided to change the subject.\u003c/p\u003e\n\u003cp\u003e\"Speaking of con crema, man, you hanging out again with that cabron, Chavez?\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t told Ralph anything about the case. Not that that mattered. Ralph had probably found out about my meeting with Chavez the day it happened. Anything that went on within the city limits, Ralph usually knew about it in time to start placing bets.\u003c/p\u003e\n\u003cp\u003e\"Milo\u0027s tangled into something, Ralphas. I told him I\u0027d try to help out.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Ralph grinned. \"Pinche bastard ever figure out what he wants to be when he grows up?\"\u003c/p\u003e\n\u003cp\u003eI had never been quite sure when or how Milo and Ralph had met. They\u0027d simply always known and disliked each other. All three of us had gone to Alamo Heights, of course, but as far as I knew the two men had never exchanged a word, never acknowledged each other. I\u0027d never been in a room with both of them at the same time. Aside from being North Side Latinos, the two could not have been further apart.\u003c/p\u003e\n\u003cp\u003eRalph had come from poverty, from a factory shantytown where his father had died of cement dust in his lungs and secondgeneration natives still kept fake green cards because it was easier than making La Migra believe their nationality. Ralph had made it through high school on the strength of his football playing and cunning and a straightedged razor and the certain unwavering knowledge that someday he would be worth a million dollars. Milo had come from a placid, welloff family. He was one of the few Latinos who had been accepted in the white circles, been invited to Cotillion dances, even had a white girlfriend. The news that he\u0027d toyed with music after high school, then business, then finally persevered through a law degree caused no surprise among his old friends, no excitement. No feeling that he\u0027d tackled insurmountable odds. The fact that he\u0027d changed jobs again, gone into the country music industry, would generate, at best, a few amused smiles. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-21.html","bookId":2417,"creation":"Oct 5, 2019 10:37:56 AM","modification":"Oct 5, 2019 10:37:56 AM"}
