{"id":76241,"no":33,"title":"Page 33","content":"\u003cp\u003eMaia Lee probably would\u0027ve laughed at that. \"Took me in\" was a nice euphemism for teaching somebody to break a window the right way, disarm a security system, do a skip trace, blackmail somebody with photos to keep a civil case from going to trial.\u003c/p\u003e\n\u003cp\u003eMaia\u0027s associates at Terrence \u0026amp;C Goldman had frowned on her methods until Maia made junior partner.\u003c/p\u003e\n\u003cp\u003eMitchell was looking at me, still smiling but with a little more wistfulness in his expression.\u003c/p\u003e\n\u003cp\u003e\"And the fact your father was a lawman,\" he suggested. \"I suspect your mother is right—that had a lot to do with your career getting sidetracked.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer. Sidetracked?\u003c/p\u003e\n\u003cp\u003e\"So why would you go back to Academia now?\" he asked.\u003c/p\u003e\n\u003cp\u003eI think I told him something about wanting an intellectual challenge and applying real world experience to the classroom, blah, blah, blah. My mind was pretty well disconnected with my spiel by the time someone knocked on the door.\u003c/p\u003e\n\u003cp\u003eMitchell excused himself. He went into the hall and mumbled briefly with one of the other members of the hiring committee.\u003c/p\u003e\n\u003cp\u003eHe came back in and sat down. He kept his face impassive.\u003c/p\u003e\n\u003cp\u003e\"That didn\u0027t take long,\" he said.\u003c/p\u003e\n\u003cp\u003eI got ready to leave, to tell him thanks anyway.\u003c/p\u003e\n\u003cp\u003eMitchell broke into a grin. \"They\u0027d like to see a demo next week. Dr. Gutierrez said you\u0027re the most refreshing candidate he\u0027s interviewed in a long time.\"\u003c/p\u003e\n\u003cp\u003eWhen I left Mitchell\u0027s office I had a little slip of paper confirming my demo lesson to the medieval undergrad seminar on Monday. I also had a dazed, sticky feeling, like somebody had already started wallpapering me with Peanuts cartoons and Scotch tape.\u003c/p\u003e\n\u003cp\u003e36\u003c/p\u003e\n\u003cp\u003eA red Mazda Miata was parked in front of 90 Queen Anne Street with its right tires over the curb. When I walked around to my side of the house Allison SaintPierre came out my front door and said, \"Hi.\"\u003c/p\u003e\n\u003cp\u003eShe was wearing white Reeboks, a pleated white skirt, and a white tank top that wasn\u0027t lining up with her bra straps very well. A terrycloth sweatband pushed her hair into bangs. Her smile was alcoholfortified. Tennis lesson day at the country club.\u003c/p\u003e\n\u003cp\u003eShe was holding two Shiner Bocks. One bottle was almost empty. The other she gave to me.\u003c/p\u003e\n\u003cp\u003e\"Damnedest thing,\" she said.\u003c/p\u003e\n\u003cp\u003eShe leaned sideways in the doorway so I could pass if I wanted to do the mambo with her.\u003c/p\u003e\n\u003cp\u003eI stayed on the porch.\u003c/p\u003e\n\u003cp\u003e\"Let me guess. My landlord let you in.\"\u003c/p\u003e\n\u003cp\u003eShe smiled wider. \"Sweet old fart. He picked up that envelope on the counter and asked me if I knew anything about this month\u0027s rent.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Gary has a thing for blondes. Rent money and blondes. Maybe if I brought over more blondes he\u0027d ask less often about the rent.\"\u003c/p\u003e\n\u003cp\u003eAllison raised her eyebrows. \"Worth a try.\"\u003c/p\u003e\n\u003cp\u003eThen she turned inside like her back was hinged to the doorjamb. I almost thought she was going to fall into the living room, but at the last minute she put her foot out and walked in. She said, \"Wooo.\"\u003c/p\u003e\n\u003cp\u003eI drank some of my Shiner Bock before following her inside.\u003c/p\u003e\n\u003cp\u003eAllison had taken Julie Kearnes out of the cassette deck and put in my Johnny Johnson. She\u0027d pulled an old Texas Monthly off the windowsill and left it open on the coffee table. The ironing board was down and the phone had been pulled out from behind it.\u003c/p\u003e\n\u003cp\u003eAllison sat on the kitchen counter stool and spread her arms along the Formica.\u003c/p\u003e\n\u003cp\u003e\"Somebody named Carol called. I told her you weren\u0027t here.\"\u003c/p\u003e\n\u003cp\u003e\"Carolaine,\" I corrected. \"That\u0027s just great. Thanks.\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. Happy to help.\u003c/p\u003e\n\u003cp\u003eI looked for Robert Johnson but he\u0027d buried himself deep. Maybe under the laundry.\u003c/p\u003e\n\u003cp\u003eMaybe in the pantry. Unlike my landlord, Robert Johnson didn\u0027t go much for blondes.\u003c/p\u003e\n\u003cp\u003e\"You send Sheckly a getwell card yet?\" I asked.\u003c/p\u003e\n\u003cp\u003eAllison had a happy drunk going that was about as thick as battleship skin. My question pinged against her, a small annoyance but not nearly enough to make her change course.\u003c/p\u003e\n\u003cp\u003e\"One of his lawyers left me a message this morning— something about the medical bills.\" She was turning the tip of her right sneaker in time to the music. Back, forth, back, forth.\u003c/p\u003e\n\u003cp\u003eI waited.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in my apartment for a good reason, I\u0027m sure. Mind telling what it is?\"\u003c/p\u003e\n\u003cp\u003eAllison appraised me while she bobbed her head, starting at my feet and working her way up. When she got to my eyes she locked on and smiled, approvingly.\u003c/p\u003e\n\u003cp\u003e\"You look good. You should dress like that more often.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. \"This outfit reminds me of too many funerals.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s where you were this morning?\"\u003c/p\u003e\n\u003cp\u003e\"Close enough. Why are you here?\"\u003c/p\u003e\n\u003cp\u003eAllison lifted her fingers off the counter. \"You were listed in the book. I felt bad about you getting hit last night.\"\u003c/p\u003e\n\u003cp\u003e\"You felt bad.\"\u003c/p\u003e\n\u003cp\u003eShe grinned. \" I\u0027m not that terrible, sweetie. You don\u0027t know me well enough.\"\u003c/p\u003e\n\u003cp\u003e\"The guys who know you well enough seem to get flesh wounds.\"\u003c/p\u003e\n\u003cp\u003e\"Like I said, Tres, I grew up with four brothers.\"\u003c/p\u003e\n\u003cp\u003e\"How many of them made it to adulthood?\"\u003c/p\u003e\n\u003cp\u003eHer eyes sparkled. No making her mad today. \"Maybe I was just curious. Miranda\u0027s dad called me this morning. He wanted to know if Miranda was with me last night.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003eShe gave me a smirk. \"Yeah. Seems she disappeared last night after the party. So did you, for that matter.\"\u003c/p\u003e\n\u003cp\u003eShe waited for information.\u003c/p\u003e\n\u003cp\u003eFortunately for me the phone rang. Allison offered to get it. I told her thanks anyway. I moved the phone to the bathroom doorway, which was as far as it would stretch, then picked up the receiver.\u003c/p\u003e\n\u003cp\u003eErainya Manos said, \"RIAA.\"\u003c/p\u003e\n\u003cp\u003e\"Is that Greek?\"\u003c/p\u003e\n\u003cp\u003eThe next thing she said was Greek, and unflattering. \"No, honey, I\u0027m telling you something you never got from me. Recording Industry Association of America. When it comes to enforcing copyright laws in the music industry, they\u0027re it. They\u0027ve got a branch office in Houston. For all of South Texas, they contract through Samuel Barrera.\"\u003c/p\u003e\n\u003cp\u003eI looked across the room at Allison. She smiled at me pleasantly, still moving her feet to the Johnny Johnson.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great,\" I told Erainya. \"I\u0027m glad it was nothing serious.\"\u003c/p\u003e\n\u003cp\u003eErainya hesitated. \"You got visitors?\"\u003c/p\u003e\n\u003cp\u003e\"Uhhuh.\"\u003c/p\u003e\n\u003cp\u003e\"Just listen, then. Sheckly\u0027s been in court half a dozen times the last few years, sued by bigname artists who\u0027ve appeared at his place. They all claim he\u0027s taped their shows for syndication and given them no rights to anything, no percentage.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve heard about that.\"\u003c/p\u003e\n\u003cp\u003e\"They also claim bootleg CDs of their shows have been turning up all over Europe.\u003c/p\u003e\n\u003cp\u003eExcellent quality recordings, made at firstrate facilities. My friends tell me it\u0027s pretty common knowledge Sheckly is the one making the tapes, getting a little extra money out of them. He speaks German, goes over to Germany frequently, probably uses the trips to strike some deals, distribute his masters, but nobody can prove it. Since the shows are taped for syndication they could\u0027ve been copied and distributed at any radio station in the country, by anybody with the right equipment.\"\u003c/p\u003e\n\u003cp\u003eI smiled at Allison. I mouthed the words sick friend. \"Doesn\u0027t sound like anything that would kill you. Just a minor annoyance.\"\u003c/p\u003e\n\u003cp\u003eErainya was silent. \"It doesn\u0027t sound like anything to get killed over, honey. You\u0027re right. Then again, how much money are we talking about? What kind of guy is Mr.\u003c/p\u003e\n\u003cp\u003eSheckly? You got a sense for that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I might. Why haven\u0027t they caught this before?\"\u003c/p\u003e\n\u003cp\u003e\"I hear Sheckly keeps things pretty modest. Doesn\u0027t import the music back into the U.S., which would make it more profitable but ten times easier to bust. He sticks to the European market, only live tapes. Makes him a lowpriority target.\"\u003c/p\u003e\n\u003cp\u003e\"Got it.\"\u003c/p\u003e\n\u003cp\u003e\"And, honey, you heard nothing from me.\"\u003c/p\u003e\n\u003cp\u003e\"Room twelve. All right.\"\u003c/p\u003e\n\u003cp\u003e\"If you can use this to squeeze Barrerra\u0027s balls a little bit—\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do that. Same to you.\"\u003c/p\u003e\n\u003cp\u003eI hung up. Allison looked at me and said, \"Good prognosis?\"\u003c/p\u003e\n\u003cp\u003e\"You mind if I change clothes?\"\u003c/p\u003e\n\u003cp\u003eShe pursed her lips and nodded. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003eI pulled a Tshirt and jeans out of the closet and went into the bathroom. Robert Johnson peeped out the side of the shower curtain.\u003c/p\u003e\n\u003cp\u003e\"Not yet,\" I told him.\u003c/p\u003e\n\u003cp\u003eHis head disappeared back into the bathtub.\u003c/p\u003e\n\u003cp\u003eI\u0027d just taken off the dress shirt and was pulling the sleeves rightside out when Allison came in and poked her finger in my back, touching the scar above my kidney.\u003c/p\u003e\n\u003cp\u003eIt took great effort to control my backward elbow strike reflex.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"You mind not doing that?\"\u003c/p\u003e\n\u003cp\u003eShe acted like she hadn\u0027t heard. She poked the scar again, like the puffiness of the skin fascinated her. Her breath dragged across my shoulder like the edge of a washcloth.\u003c/p\u003e\n\u003cp\u003e\"Bullet hole?\"\u003c/p\u003e\n\u003cp\u003eI turned to face her, but there wasn\u0027t much place to back up unless I sat in the sink.\u003c/p\u003e\n\u003cp\u003e\"Sword tip. My sifu got a little excited one time.\"\u003c/p\u003e\n\u003cp\u003e\"Sifu?\"\u003c/p\u003e\n\u003cp\u003e\"Teacher. The guy who trained me in tai chi.\"\u003c/p\u003e\n\u003cp\u003eShe laughed. \"Your own teacher stabbed you? He must not be very good.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s very good. The problem was he thought I was good too.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got another scar. That one\u0027s longer.\"\u003c/p\u003e\n\u003cp\u003eShe was looking at my chest now, where a hash dealer had stabbed me with a Balinese knife in San Francisco\u0027s Tenderloin District. I put on my Tshirt.\u003c/p\u003e\n\u003cp\u003eAllison pouted. \"Show\u0027s over?\"\u003c/p\u003e\n\u003cp\u003eI waved her out and closed the bathroom door in her face. She was still smiling when I did it.\u003c/p\u003e\n\u003cp\u003eRobert Johnson stared at me as I put on the jeans. He looked about as amused as I was.\u003c/p\u003e\n\u003cp\u003e\"Maybe if we rush her,\" I suggested. \"A twoflank approach.\"\u003c/p\u003e\n\u003cp\u003eHis head disappeared again. So much for backup.\u003c/p\u003e\n\u003cp\u003eWhen I came into the living room Allison had opened another beer and relocated to the futon.\u003c/p\u003e\n\u003cp\u003e\"This reminds me of my old place in Nashville,\" she said, studying the waterstained plaster on the ceiling. \"God, that was bad.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eShe looked at me, puzzled. \"I just meant it\u0027s small. I was living on nothing for a while.\u003c/p\u003e\n\u003cp\u003eKind of makes me nostalgic, you know?\"\u003c/p\u003e\n\u003cp\u003e\"The good old days,\" I said. \"Before you married money.\"\u003c/p\u003e\n\u003cp\u003eShe drank some beer. \"Don\u0027t knock it, Tres. You know what the joke was in Falfurrias?\"\u003c/p\u003e\n\u003cp\u003e\"Falfurrias. That\u0027s where you\u0027re from?\"\u003c/p\u003e\n\u003cp\u003eShe nodded sourly. \"We joked that you only go to college for an MRS.\" She tapped her wedding ring with her thumb. \"I bypassed the degree plan.\"\u003c/p\u003e\n\u003cp\u003eShe closed all ten fingers around the beer bottle and kicked her feet up on the futon. I stared at the beer, wondering how many it would take for me to catch up with her.\u003c/p\u003e\n\u003cp\u003e\"When I was eighteen I was working during the summer as a secretary at A1 Garland\u0027s auto dealership.\" She looked at me meaningfully, like I should know A1 Garland, obviously a bigwig in Falfurrias. I shook my head. She looked disappointed.\u003c/p\u003e\n\u003cp\u003e\"I was trying to sing at a few clubs in Corpus Christi on the weekends. Next thing I know A1 was telling me he was going to leave his wife for me, telling me he would finance my music career. We started taking weekend trips to Nashville so he could show me how rich and important he was. He must\u0027ve sunk ten thousand into the wallet doctors.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-33.html","bookId":2417,"creation":"Oct 5, 2019 10:37:56 AM","modification":"Oct 5, 2019 10:37:56 AM"}
