{"id":76247,"no":39,"title":"Page 39","content":"\u003cp\u003eNo one answered the front door so I walked around by the horseshoe pit.\u003c/p\u003e\n\u003cp\u003eThe back field looked like a playground for the Army Corps of Engineers—pyramids of PVC and copper pipes, crisscrossed trenches, mounds of caliche soil. The other night it had been too dark to see the extent of the work.\u003c/p\u003e\n\u003cp\u003eLeaning against a utility shed out beyond the chicken coop were three metal canisters a little smaller than cars—septic tanks. Two were dull silver and pitted with rust holes.\u003c/p\u003e\n\u003cp\u003eThe third was new and white but caked here and there with clods of dirt, as if it had been improperly installed and then dug up again.\u003c/p\u003e\n\u003cp\u003eThe riderless backhoe squatted at the end of a trench, its shovel nuzzling the caliche.\u003c/p\u003e\n\u003cp\u003eThe backhoe was speckled with dirt and machine oil but looked fairly new, painted the green and yellow of a rental company.\u003c/p\u003e\n\u003cp\u003eI heard a tape playing out beyond the tractor shed. It was spare acoustic guitar and male vocal—like early Willie Nelson.\u003c/p\u003e\n\u003cp\u003eI walked that direction. The horse in the neighbouring field watched me with her neck leaning into the top of the barbed wire while she chewed on an apple half.\u003c/p\u003e\n\u003cp\u003eWhen I got closer I realized the tape I was hearing was one of the songs Miranda performed, only changed for a male singer. When I got around the other side of the shed I realized I wasn\u0027t hearing a tape at all. It was Brent Daniels singing.\u003c/p\u003e\n\u003cp\u003eHe was sitting in one of two lawn chairs against the far wall of his tractorshed apartment, next to the chicken coop. He was facing the hills and strumming his Martin for the hens.\u003c/p\u003e\n\u003cp\u003eHis hair was tousled into a thin wet black mess, like he\u0027d just showered. He wore a Tshirt and denim shorts.\u003c/p\u003e\n\u003cp\u003eThere was a stack of Dixie cups and a bottle of Ryman whiskey on the tree stump next to him. He\u0027d made a bold start on the bottle. He was singing his heart out and for the first time I realized just how good he really was.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t hear me coming up, or he didn\u0027t care. I stayed about twenty yards away and listened to him finish the song. He gave the impression that he was singing to somebody on the hilltop over on the horizon.\u003c/p\u003e\n\u003cp\u003eWhen Brent finished he let the guitar slide off his lap, then he picked up the whiskey bottle and poured himself a cupful. He slugged it down and glanced at me.\u003c/p\u003e\n\u003cp\u003e\"Navarre.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you were a recording.\"\u003c/p\u003e\n\u003cp\u003eDaniels frowned. \" You want Miranda, she\u0027s in Austin, mixing the demo. Willis is out getting more finger pipes.\"\u003c/p\u003e\n\u003cp\u003e\"In that case, mind if I join you?\"\u003c/p\u003e\n\u003cp\u003eHe deliberated, like he wanted to say no but was so out of practice turning down social requests that he didn\u0027t remember how. He held the stack of Dixie cups toward me. I took one off the top, then sat in the other lawn chair.\u003c/p\u003e\n\u003cp\u003eYou could see a long way off. The hills in the distance were green. The sky was blue the way amusement park water is blue—an unnatural, dyedforthetourists kind of look, with foamy little scraps of cloud. A couple of turkey buzzards circled about half a mile to the north, over a clump of trees. Dead cow or deer, probably. To the east there was a brown zigzag of haze from someone\u0027s brushfire.\u003c/p\u003e\n\u003cp\u003eThe Ryman whiskey burned its way down my throat.\u003c/p\u003e\n\u003cp\u003e\"Les\u0027 brand, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eBrent shrugged. \"He gives it out. Door prizes.\"\u003c/p\u003e\n\u003cp\u003eI wanted to ask some questions but the country air, the country mood, had started working on me. I realized how tired I was, how tired I\u0027d been for the past few weeks.\u003c/p\u003e\n\u003cp\u003eThe midday sun was warm but not unpleasant, just enough to burn the last of the dew off the chicken wire and get some warmth into my bones. The hills invited quiet spectating. The reasons I had come out to the ranch house started unknitting in my head.\u003c/p\u003e\n\u003cp\u003e\"You play out here often?\"\u003c/p\u003e\n\u003cp\u003eSome shadows deepened around Brent\u0027s eyes. \"I suppose.\"\u003c/p\u003e\n\u003cp\u003e\"Y\u0027all got another gig tonight?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Just Miranda. She\u0027s got a show up scheduled with Robert Earle Keen at Floore\u0027s Country Store. I suppose Milo\u0027s going to bring her back down for that.\"\u003c/p\u003e\n\u003cp\u003eI dabbed the flakes of Dixie cup wax off the surface of the liquor. \"Miranda doesn\u0027t drive at all, does she?\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t even considered that fact until I said it. I hadn\u0027t questioned it Friday night, when I\u0027d given her a lift into town, or the other times when she\u0027d gotten rides with Milo or her father. The fact that I had just naturally accepted it, not even thought about it as odd, disturbed me for some reason I couldn\u0027t quite put into words.\u003c/p\u003e\n\u003cp\u003e\"Not that she can\u0027t,\" Brent said. \"She doesn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eBrent glanced at me briefly, declined comment.\u003c/p\u003e\n\u003cp\u003eHe picked up his guitar again and picked the strings so lightly I almost couldn\u0027t hear the notes. His hand changed chords fast, contorting into various claw shapes on the fret board.\u003c/p\u003e\n\u003cp\u003e\"You ever get frustrated with her playing your songs?\" I asked. \"Getting all the attention for your music?\"\u003c/p\u003e\n\u003cp\u003eBrent kept playing quietly, looking at the hills as he worked his fret board, occasionally twitching his eye as he reached for a harder note. His face and his hands reminded me of a deepsea fisherman\u0027s as he worked his rod and reel.\u003c/p\u003e\n\u003cp\u003e\"She was grateful at first,\" he said. \"Told me she couldn\u0027t have done it without me—that she owed me everything. She gives you those bright eyes—\" He smiled, a kind of sad amusement. Suddenly he looked like his father, a leaner version, less gray, weathered a little sooner and a little more harshly, but still Willis\u0027 son. \"Guess you\u0027re the cavalry now, ain\u0027t you, Navarre?\"\u003c/p\u003e\n\u003cp\u003e\"You never thought much of Milo hiring a private eye.\"\u003c/p\u003e\n\u003cp\u003e\"Nothin\u0027 personal,\" he said. \"Seems to me Les has ditched us, Milo\u0027s trying to prove he\u0027s got things under control. It\u0027s not—I appreciate—\" He stopped himself, not sure how to proceed. \"Miranda was talking about you yesterday. She seemed to feel a lot easier about things—said you were a good man. I do appreciate that.\"\u003c/p\u003e\n\u003cp\u003eHe meant it, but there was an uneasiness in his tone I couldn\u0027t quite nail down.\u003c/p\u003e\n\u003cp\u003e\"Something about her Century Records deal is bothering you.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head uncertainly.\u003c/p\u003e\n\u003cp\u003e\"Has Les tried to call you?\"\u003c/p\u003e\n\u003cp\u003eBrent frowned. \"Why would he?\"\u003c/p\u003e\n\u003cp\u003e\"Just a thought. You don\u0027t figure he would\u0027ve contacted Miranda?\"\u003c/p\u003e\n\u003cp\u003e\"Les is gone for good. That\u0027s pretty obvious, ain\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Is that what Allison\u0027s hoping?\"\u003c/p\u003e\n\u003cp\u003eBrent played a few more chords. His focus moved farther away by a few hundred miles. \"It never should have happened between me and her.\"\u003c/p\u003e\n\u003cp\u003e\"None of my business.\"\u003c/p\u003e\n\u003cp\u003eBrent shook his head sadly.\u003c/p\u003e\n\u003cp\u003eFor no reason I could see he decided to start singing again. It was a pretty tune—one of his slow ones, \"The Widower\u0027s TwoStep.\"\u003c/p\u003e\n\u003cp\u003eComing straight from Brent the song was a hundred times sadder. I could almost feel the weight of the tractor shed apartment on his back, imagine a young woman in there, pregnant, dying from some condition I couldn\u0027t even remember the name of.\u003c/p\u003e\n\u003cp\u003eI got myself another Dixie cup full of whiskey. The liquor made a warm heavy coating around my lungs.\u003c/p\u003e\n\u003cp\u003eWhen Brent finished the last verse we were quiet for a long time. The sun was nice.\u003c/p\u003e\n\u003cp\u003eThe circling buzzards and the horse pawing up the field and even the frantic, coked up movements of the chickens were all getting more and more fascinating the more I drank. I could\u0027ve settled into that lawn chair for the rest of my life, I figured.\u003c/p\u003e\n\u003cp\u003e\"You get any money from the songs?\" I asked. \"Allison was saying something—\"\u003c/p\u003e\n\u003cp\u003eBrent nodded. \"Quarter royalties.\"\u003c/p\u003e\n\u003cp\u003e\"A quarter?\"\u003c/p\u003e\n\u003cp\u003e\"Half to the publisher.\"\u003c/p\u003e\n\u003cp\u003e\"And the other quarter?\"\u003c/p\u003e\n\u003cp\u003e\"Goes to Miranda as cowriter.\"\u003c/p\u003e\n\u003cp\u003e\"She cowrote the songs?\"\u003c/p\u003e\n\u003cp\u003e\"No. But it\u0027s standard,\" Brent said. \"The artist who records the song gets half credit for writing it even if they didn\u0027t. Looks better on the album that way. It\u0027s a tradeoff for them choosing your material.\"\u003c/p\u003e\n\u003cp\u003e\"Even if she\u0027s your sister?\"\u003c/p\u003e\n\u003cp\u003e\"Les said it\u0027s standard.\"\u003c/p\u003e\n\u003cp\u003eI watched the turkey buzzards. \"Seems like Miranda could\u0027ve made it unstandard.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. I couldn\u0027t tell whether he cared or not. I wondered what conversations Allison had had with him about that.\u003c/p\u003e\n\u003cp\u003e\"Les ever stay at the ranch house?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe nodded reluctantly. \"Once. I was following him back from a gig one night, he run himself off the road from all the drink and pills. Had to convince him to come back here and sleep it off. He wasn\u0027t a happy fella. He talked a lot about selfdestructing that night.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you handle it?\"\u003c/p\u003e\n\u003cp\u003eBrent played a chord. \"Told him I\u0027d been there.\"\u003c/p\u003e\n\u003cp\u003eHe sang another song. I drank more. My feet were pleasantly numb and I was enjoying the sound of Brent Daniels\u0027 voice. I felt easy and comfortable for the first time in days.\u003c/p\u003e\n\u003cp\u003eNot thinking about whether I wanted to become a licensed P.I. or a college teacher or a neon blue bearded lady for Cirque du Soleil.\u003c/p\u003e\n\u003cp\u003eBrent and I talked some more in between songs. It was like having a bilingual conversation—shifting in and out of singing and talking until there stopped being a difference. After a while Brent started doing other people\u0027s music—\"Silver Wings\" and\u003c/p\u003e\n\u003cp\u003e\"Faded Love\" and \"Angel Flying Too Close to the Ground.\" Stuff that reminded me of my dad\u0027s record collection. God forbid maybe I even mumbled along with Brent as he sang.\u003c/p\u003e\n\u003cp\u003eThings got blurry after that, but I remember during one of the silent places saying, \"Les hasn\u0027t played straight with anybody this whole time. He wouldn\u0027t be worth protecting.\"\u003c/p\u003e\n\u003cp\u003eI wanted to look at him, see his reaction, but my eyes were closed and I was enjoying them that way.\u003c/p\u003e\n\u003cp\u003e\"I gave up on protection a long time ago,\" Brent said.\u003c/p\u003e\n\u003cp\u003eHis voice was a sad sound, the chords bright and airy behind it.\u003c/p\u003e\n\u003cp\u003eThe last thing I remember, he was singing something about a train.\u003c/p\u003e\n\u003cp\u003eI woke up with the feeling that somebody had hooked me to a reverse IV. All the fluid had ^r drained out of my mouth and my eyes and my brain. When I moved my head everything turned white. I realized, belatedly, that I was feeling pain.\u003c/p\u003e\n\u003cp\u003eI sat up on the metal cot and rubbed my face where it had pressed itself into the texture of the rayon. One of the yellow curtains was open and light was pouring directly onto my chest.\u003c/p\u003e\n\u003cp\u003eOther things came into focus—a folding card table with a bucket of silverware on it. A wooden bunk bed, the bottom bunk stripped to the springs. A Playboy wall calendar that was still stuck on Miss August. The walls were the same inside the little tractorshed apartment as they were outside—rough wood, painted red. What few pictures there were hung from bare nails. Brent\u0027s carving knife was stuck directly into the wall above the tiny sink. There was no oven—no kitchen to speak of. Just a hot pad and a coffeemaker and a minirefrigerator.\u003c/p\u003e\n\u003cp\u003eIt was possible that a woman might\u0027ve lived here once, but you couldn\u0027t\u0027ve proved it.\u003c/p\u003e\n\u003cp\u003eI tried to get up.\u003c/p\u003e\n\u003cp\u003eI tried again.\u003c/p\u003e\n\u003cp\u003eWhen I finally succeeded I realized where all the fluid in my body had drained to. I looked around for the rest room.\u003c/p\u003e\n\u003cp\u003eIt was a tiny closet behind a shower curtain. Everything was close together. The sink overlapped the toilet tank and the shower drained directly into the tile floor so you could, conceivably, use the toilet and take a shower and brush your teeth all at the same time.\u003c/p\u003e\n\u003cp\u003eI only tried option number one.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t until I rummaged in the medicine cabinet, hoping for aspirin, that I found some reminder of the woman who had once lived here—orange prescription bottles, at least ten of them, all typed faintly with the name Maria Daniels. Insulin A. Prenatal vitamin supplements. Glucophage. Several other names I hadn\u0027t ever heard of. Some were open, as if she\u0027d just taken her prescription this morning. As if nothing had been touched in the cabinet in two years. In the corner, behind the container of white Glucophage tablets, was a baby teether still in its plastic wrapper. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-39.html","bookId":2417,"creation":"Oct 5, 2019 10:37:56 AM","modification":"Oct 5, 2019 10:37:56 AM"}
