{"id":63310,"no":1,"title":"Page 1","content":"\u003cp\u003eFor Helen and Mackenzie,\u003c/p\u003e\n\u003cp\u003etwo of the sweetest Southern ladies I know.\u003c/p\u003e\n\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eClaymorgan, England\u003c/p\u003e\n\u003cp\u003eSpring 1199\u003c/p\u003e\n\u003cp\u003eHer passage through the woods set the leaves atremble. Her childish laughter rang through the trees and the wind blew her hair out behind her in a golden stream. The sun covered her with kisses and the rain-damp earth squelched up between her toes, embracing her with each step.\u003c/p\u003e\n\u003cp\u003eWilla loved to run barefoot after a rain. However, if Eada or Papa found out about this, she knew there would be trouble. It was worth the risk.\u003c/p\u003e\n\u003cp\u003eShe broke into a clearing and abruptly paused. Her laughter faded at once, the happiness slipping from her face. Something was wrong. It was so silent. Too silent. The birds had stopped singing and were motionless in the trees. Even the bugs had stopped buzzing. And she couldn\u0027t hear Luvena running in front of her anymore.\u003c/p\u003e\n\u003cp\u003eHer brow creased with worry as she peered slowly around the clearing.\u003c/p\u003e\n\u003cp\u003e\"Luv?\" she whispered, taking a tentative step forward. \"Luv?\"\u003c/p\u003e\n\u003cp\u003eA quiet rustle drew her head around. Something dropped from the small cliff near where she had entered the clearing. Cloth - golden as the sunlight - fluttered through the air like a chick tumbling from its nest. The bundle landed with an ominous thud.\u003c/p\u003e\n\u003cp\u003eWilla swallowed nervously. Her gaze slid slowly over the bright pile of gilded material on the ground. It was the gown Lord Sedgewick had brought back from London for her. The one Luvena had been so eager to wear.\u003c/p\u003e\n\u003cp\u003eThen she spied the small, motionless legs, in their fine new hose, peeking out from beneath the skirts. One of the soft slippers was missing. A hand lay half-curled in supplication amidst the material of the gown. Shiny red-gold tresses lay limp in the grass. Luvena\u0027s pale face was turned away, her head at an odd angle.\u003c/p\u003e\n\u003cp\u003eThese images assaulted Willa one after the other like the threads of a tapestry that had yet to be created. By the time her brain had woven them together and understood their meaning, she had been screaming for several moments. \u003c/p\u003e","sourceLink":"https://allnovel.net/what-she-wants/page-1.html","bookId":2652,"creation":"Oct 5, 2019 9:50:37 AM","modification":"Oct 5, 2019 9:50:37 AM"}
