{"id":72116,"no":27,"title":"Page 27","content":"\u003cp\u003eHe leans toward me, keeping his voice low and his arms crossed over his chest. “It’s the Mark of Immortality.”\u003c/p\u003e\n\u003cp\u003eI’m shocked, but I know I have to remain centered. I’m supposed to be in control, strong, and dominant. I straighten my posture and cross my arms, like I’m the toughest girl… Angel in the world.\u003c/p\u003e\n\u003cp\u003eLaylen greets the man by nodding once. “Doug. How’s it going, man?”\u003c/p\u003e\n\u003cp\u003eDoug mutters an unfriendly, “It’s goin’ good. Haven’t seen you in a while.” He takes the three of us in with a skeptical look. “Who are they?”\u003c/p\u003e\n\u003cp\u003eLaylen plays it cool with his gaze steadfast on Doug. “They’re with me.”\u003c/p\u003e\n\u003cp\u003eDoug raises an accusing eyebrow. “They got the mark.”\u003c/p\u003e\n\u003cp\u003eLaylen braces his arm against the wall. “Look, I know you let people in here without the mark. In fact, there’s a feeding ground upstairs.”\u003c/p\u003e\n\u003cp\u003eFeeding ground. I’m definitely in over my head. Alex must have sense my apprehension, too, because he laces his fingers with mine.\u003c/p\u003e\n\u003cp\u003e“I don’t know what you’re talking about.” Doug steps back inside and starts to shut the door.\u003c/p\u003e\n\u003cp\u003eLaylen sticks his hand out and slams his palm against the door, holding it open. “You can’t have double standards Doug. I know you let mortals in.”\u003c/p\u003e\n\u003cp\u003eDoug narrows his eyes. “Let go of the fucking door, before I break your arm off.”\u003c/p\u003e\n\u003cp\u003eI start to laugh because the idea of a tiny man like Doug breaking Laylen’s arm off seems ludicrous, but I stop when Laylen lowers his arm swiftly and darts back. Doug begins to shut the door again when Aislin marches forward.\u003c/p\u003e\n\u003cp\u003e“Somno iam!” she exclaims as her arm snaps out in front of her.\u003c/p\u003e\n\u003cp\u003eDoug groans as he clutches at his heart and then his eyes roll back into his head. “You…” His body goes rigid, his shoulders jerk upward and his knees lock. His body aligns in a perfectly straight line before he falls backward and hits the floor.\u003c/p\u003e\n\u003cp\u003eAislin lowers her hand back to the side and a huge grin expands across her face. “See, we’re going to be okay.”\u003c/p\u003e\n\u003cp\u003eLaylen nods his head and his eyes widen. “Well, alright, I guess that works.”\u003c/p\u003e\n\u003cp\u003eAislin hops over the unconscious Doug and Laylen follows after her. When he is inside, he bends down and hooks his arms underneath Doug’s. Then, with a grunt, he drags him inside and Alex and I walk freely through the doorway. Once we are all in, Laylen slams the door and fastens the locks.\u003c/p\u003e\n\u003cp\u003e“Okay,” Laylen says and heads toward a brick archway on the other side of the room. “Let’s make this quick before someone either finds him or he wakes up.”\u003c/p\u003e\n\u003cp\u003eWe walk down a slender hallway extending from the archway, Laylen and Aislin in front, Alex and I in the back. I notice the metal lanterns that hang on the stone walls have the Immortality mark on them. I’m catching on that this is an all-exclusive Immortal club with a feeding ground upstairs, but, even with that concept, nothing could ever prepare me for what I walk into.\u003c/p\u003e\n\u003cp\u003eAt the end of the hall, the area opens up into a large, but crowded room. Lanterns dangle from the ceiling, fueled by fire, not electricity. The red ceiling lights sparkle across the marble floor and there’s a balcony above with a spiral staircase twisting up to it and connecting the two floors. That’s the easy part to take in. It’s the lower half that is intense.\u003c/p\u003e\n\u003cp\u003eThere’s a dance floor in the middle of the room and it’s crammed with people, swaying hypnotically to the low beat of Deftones “Change.” They’re tall, short, fat, and thin; some have pale skin and other’s scaly skin. There are fangs coming out of people’s mouth and fur growing on their bodies. They are touching each other, drinking; some are half naked, shirts off, wearing clothes that barely cover any skin.\u003c/p\u003e\n\u003cp\u003eIn each of the four corners of the room, there are life-size, iron-rod birdcages. Trapped inside the cages are the most beautiful women I’ve ever seen. Their legs are extensive, their skin smooth and their lips a pale blue. Black-feathered wings sprout from their shoulder blades and a whip curls up their arms. Each has a black leather dress on that resembles mine and their hair is as black as ash. They are twirling around a pole in the center of the cage and with each movement, I feel a pull towards them; they are hypnotic. Several people around the room seem mesmerized by them, like they feel the pull too.\u003c/p\u003e\n\u003cp\u003e“They’re Black Angels,” I say over the music as I turn to Alex. I’m surprised to find that he’s watching me intently. “Aren’t they?”\u003c/p\u003e\n\u003cp\u003eHe nods once. “They are.”\u003c/p\u003e\n\u003cp\u003eI peer over my shoulder. “I don’t know why you guys think I look like them. They have wings and they move so confidently, like they own everyone. They’re so… beautiful.”\u003c/p\u003e\n\u003cp\u003e“The one’s that walk outside their cages don’t have wings.” He sketches a line between my shoulder blades and my body counters with a shudder. “And the last part you’ll be fine with. It’s the middle I’m worried about.” He waits to see if I catch on to his hidden meaning.\u003c/p\u003e\n\u003cp\u003eI do, but remain composed because that’s what I’m supposed to be doing.\u003c/p\u003e\n\u003cp\u003e“We should get this over with,” Laylen says, removing his cell phone from his pocket. “If anything at all happens, we’ll text each other.”\u003c/p\u003e\n\u003cp\u003eAlex nods and then Aislin and Laylen start to head across the dance floor, but Alex catches Aislin by the arm. “Wait, how are you guys going to get it out without being noticed?”\u003c/p\u003e\n\u003cp\u003eAislin’s eyes twinkle and she snaps her fingers. “It’s called magic.”\u003c/p\u003e\n\u003cp\u003eHe lets her go and she follows Laylen as he shoves his way through the crowd and onto the dance floor. Seconds later, the crowd swallows them.\u003c/p\u003e\n\u003cp\u003eAlex immediately snatches ahold of my hand and steers me toward the bar that’s next to the dance floor and off center with the stairway. We can’t see the bottom because of all the people, but I can see the rest of it. I keep my eyes glued to it, even when people run into me; trusting Alex to lead the way. When I see Laylen and Aislin emerge onto the midsection of the stairway, I relax and allow myself a quick glance around the room.\u003c/p\u003e\n\u003cp\u003eThere are people and creatures in booths eating dinner, at the bar ordering shots. A lot of attention is magnetized toward me; quick glances from some of them, but others rudely stare. I adjust my shoulders higher and move to Alex’s side because it seems like a domineering move. We walk up to the bar together and Alex pulls out a barstool for me.\u003c/p\u003e\n\u003cp\u003eI sit down, swing my legs to the front and rest my arms on the transparent countertop that shows the alcohol bottles lined up underneath it, along with a vat of red, thick liquid. I pretend I’m okay. Completely in control. Until the bartender strolls up and I’m reminded just how naïve I am.\u003c/p\u003e\n\u003cp\u003e“What can I getcha?” He’s tall with wide-ranging shoulders and there is a tiny mole just above his lip that I can’t take my eyes off of.\u003c/p\u003e\n\u003cp\u003eAll my innocence shines through. “Umm… What are the choices?”\u003c/p\u003e\n\u003cp\u003e“Two shots of vodka.” Alex pats his hand on the counter.\u003c/p\u003e\n\u003cp\u003eThe bartender nods and swings a rag over his shoulder as he backs away. He doesn’t take his eyes off me until he’s at the back counter and has to turn around to collect the glasses.\u003c/p\u003e\n\u003cp\u003eAlex leans over in the stool. “Just knock it back quickly and try not to choke.”\u003c/p\u003e\n\u003cp\u003eI bend my body to the side until our heads are touching. “Can’t I just not drink?”\u003c/p\u003e\n\u003cp\u003eAlex shakes his head and gives a quick glance at the stairway. “Act tough, remember?”\u003c/p\u003e\n\u003cp\u003eDrinking is tough? Or maybe he wants me to do it for another reason? Sighing, I turn toward the counter and then jump when I come face to face with the creepy bartender. It takes a lot to shove down the scream in my throat.\u003c/p\u003e\n\u003cp\u003eHis face is only inches away from mine. “You one of them, ain’t ya?”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t you like to know?” My voice comes out steady and I do an internal happy dance.\u003c/p\u003e\n\u003cp\u003e“I very much would like to know.” He relocates back just a little and sets two tall shot glasses down on the counter. They’re filled with a clear liquid that smells like gasoline. “In fact, I’d put money on it.” When I say nothing, he backs away with a sly grin on his face.\u003c/p\u003e\n\u003cp\u003eI swivel in the barstool, freeing a loud breath. The music is loud enough that it goes unnoticed, though. “What a weirdo.”\u003c/p\u003e\n\u003cp\u003eAlex picks up a shot glass. “Take a look around Gemma. This place is full of nothing but weirdoes.” He raises the glass to his lips and angles his neck back, sucking out the drink in one long gulp. His neck muscles move as he swallows it, then he lowers the glass and sets it back on the counter.\u003c/p\u003e\n\u003cp\u003eAs weird as it is, I’ve never drank before. I put the glass to my lips, hold my breath and tip my chin up, letting the drink spill into my mouth and flood my throat. It feels like acid ripping away at my esophagus and stomach muscles. I seal my lips shut, forcing myself to choke it down as I drop the glass down on the counter. I can’t breathe. Can’t think. My blood and my heart flare with potent heat. “Why the fuck did you have me drink that?” I mutter through a soft gag.\u003c/p\u003e\n\u003cp\u003e“Breathe,” he whispers, glancing around the room with his arms crossed. “Or you’re going to black out.”\u003c/p\u003e\n\u003cp\u003eI inhale through my nose and it makes my lips stutter. The choke and burn propel up my throat and I start to lean forward to hack. Alex meets me in the middle, rendering me motionless with a touch of his hand on my arm. He pushes me upright, makes me sit up straight, then he bends forward and suddenly his lips are on mine. At first, I think he’s trying to hurt me because his mouth is pressed against mine so hard it feels like the skin is going to bruise. He’s strong. And fierce. His hands come down on my hips and he jerks me forward as his tongue slips into my mouth. The taste of him inside my mouth smothers the alcohol and I still can’t breathe, but for a whole different reason.\u003c/p\u003e\n\u003cp\u003eHe continues kissing me, grabbing at strands of my hair so he can tip my head back and devour my mouth, but as quickly as it starts, it strikes a dead end as his lips leave mine without forewarning.\u003c/p\u003e\n\u003cp\u003e“Let’s dance,” he breathes demandingly and I’m confused because I thought that I’m the one who’s supposed to be domineering.\u003c/p\u003e\n\u003cp\u003eI don’t protest, though, as he guides me to my feet and directs me toward the dance floor. I try to stay next to him, but the tightness of the dress limits my legs’ mobility. I also feel dizzy and my limbs are kind of heavy. Walking suddenly seems to be the most complex thing in the world and, after a lot of staggering, he finally wraps his arm around my back to support me.\u003c/p\u003e\n\u003cp\u003eAs we reach the crowd, I tuck in my elbows, but then put them back out, not wanting to seem intimidated. He shoves through the people that smell like sweat, as well as rust, and when we finally arrive in the middle, he stops. There’s a blond girl to my right with fangs poking out of her mouth and she’s dancing with a guy that has pointy ears. To my left, is a woman with purple hair made of thick strands that have heads with eyes at the end.\u003c/p\u003e\n\u003cp\u003e“I did see someone with snakes for hair.” I utter to Alex. “That night at the cabin.”\u003c/p\u003e\n\u003cp\u003eHe stands in front of me with his eyes fastened on the stairway just over my shoulder. “Yeah, you shouldn’t have been able to see that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shattered-promises-shattered-promises-1/page-27.html","bookId":1976,"creation":"Oct 5, 2019 10:23:09 AM","modification":"Oct 5, 2019 10:23:09 AM"}
