{"id":72133,"no":44,"title":"Page 44","content":"\u003cp\u003eSummoning inner strength, I stagger to my feet and shuffle to him while gripping my wrist in my hand. “Alex, don’t let him do this to me. Please. This is so much worse than detaching my soul.”\u003c/p\u003e\n\u003cp\u003eHis eyes hold as much agony as I carry inside me. “I’m sorry, Gemma. About everything. I should have never taken it that far.”\u003c/p\u003e\n\u003cp\u003eWhen the angry heat sweeps through my body, I let it out the only way I can think off. By kicking him in the shin and slapping his face, arms, and chest repeatedly, but he just stands there and takes it.\u003c/p\u003e\n\u003cp\u003eBut Stephan rushes forward, seizes my arm and throws me down on the ground and I land in a pile of wood that used to be the coffee table. The prickle spears at the back of my neck, liberating a feeling of irreversible hate. I never loved Alex—I understand that now—but I cared for him deeply. I trusted him against my innermost warnings; let him do things to me that no one ever had. It’s my own fault for trusting him, though, and I make a vow right there that if I make it out of this, I’ll never trust him again. I’ll never trust anyone again.\u003c/p\u003e\n\u003cp\u003eI pull my knees to my chest and shut my eyes as the Death Walkers close in on me and build a wall of ice around us, trapping us in brick of ice. Stephan squats down in front of me, he eyes me over and then darkness possesses his pupils as he holds the rock up above his head.\u003c/p\u003e\n\u003cp\u003e“Alex, I’m going to let you do the honors,” he says with a grin.\u003c/p\u003e\n\u003cp\u003eAlex’s jaw twitches as he refuses to look at me. “I’d rather not.”\u003c/p\u003e\n\u003cp\u003e“I don’t give a shit what you’d rather do,” he snaps. “I’m telling you, you’ll do it or go with her.”\u003c/p\u003e\n\u003cp\u003eAlex’s fist shakes as he unhurriedly makes his way over to his father and snatches the rock from his fingers. Stephan stands up while Alex lowers himself in front of me. He struggles to look at me and I make it harder on him, not blinking or moving as I stare into his eyes, forcing him to see me the entire time.\u003c/p\u003e\n\u003cp\u003e“Please.” I try one last time.\u003c/p\u003e\n\u003cp\u003eHe doesn’t answer and his hand wobbles as he places the rock in front of my face, right between my eyes. Up close, there are swirls of black that entwine at the roundest side. Those lines begin to pirouette, spin and cycle like writing a song of death and soon I can hear the lyrics.\u003c/p\u003e\n\u003cp\u003eThis is it. This is the end of my short-lived life. It seems like I’ve done everything, yet, I’ve done nothing. Every moment, every emotion has been acted out on a stage made of imaginary wood that only I could see. It has never existed, not really, and now it’s gone.\u003c/p\u003e\n\u003cp\u003eMy head fills with static. I see my life. I see my death. I finally see my future.\u003c/p\u003e\n\u003cp\u003eLaughing. The sun shining as we run through the field, chasing each other.\u003c/p\u003e\n\u003cp\u003eHappy. He smiles. I smile and everything makes sense.\u003c/p\u003e\n\u003cp\u003eSmiling. We stand up in front of a thousand people, but the only one that matters is him. His green eyes are on me as he whispers that he loves me and I reply that I love him.\u003c/p\u003e\n\u003cp\u003eLove. I wish it were real.\u003c/p\u003e\n\u003cp\u003eThe cabin begins to diminish into contorted objects as my skin glows beneath the locket. The electricity drifts from my body and one word comes to mind as I fall toward the floor.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eThe last thing I see is Alex’s green eyes, then my legs and arms go inert and my heart dies with them. I gasp my last breath of air as my life leaves my body, leaving behind nothing more than a spirit. I see my mom’s bright blue irises, her warm smile; I see the life I’ll never have. The humming in my head grows louder until I can’t think anymore; can’t feel. My eyelids fall shut and only one feeling remains.\u003c/p\u003e\n\u003cp\u003eHollow.\u003c/p\u003e\n\u003cp\u003eThe black water crashes against the sandy shore and ash rains down from the clouds and floats across the land. Alex pulls me against him, so tightly we are almost one soul. I breathe in his scent of cologne, wanting to stay in his arms forever.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, Gemma,” he whispers against my cheek. “I’ll always save you. No matter what, I’ll always save you.”\u003c/p\u003e\n\u003cp\u003eI nod. “I know.”\u003c/p\u003e\n\u003cp\u003eHe moves back and flattens our palms together forming a temple. “Ego promitto ad protegendum tibi in perpetuum.”\u003c/p\u003e\n\u003cp\u003eI don’t understand the language, but I know that he means what he says from the bottom of his heart and I hold onto that.\u003c/p\u003e\n\u003cp\u003e“Now close your eyes and trust me,” he says softly but with strength.\u003c/p\u003e\n\u003cp\u003eAs I submit and close my eyes, a bright orange flame erupts across the land and burns down on the trees. Then silence sets in with the smoke circling around us and suffocating us into the darkness. I want to run, but I cling onto him for dear life, knowing he’ll save me somehow.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eMy head is buzzing, like a Goddamn bug trapped in a light, over and over again. It just about drives me crazy. My skin is warm, my body relaxed and the air smells like lilacs and rain. The ground below my body is soft. I feel content.\u003c/p\u003e\n\u003cp\u003eFeel? But I’m supposed to be dead, or at least locked in a coffin in my own head.\u003c/p\u003e\n\u003cp\u003eI shoot upright, but as the blood rushes from my head, I fall back onto the mattress. I can’t believe what I’m seeing. I’m lying in a bed in a room with pale purple walls and a small window that lets in the sunlight. The view outside is filled with colorful lights and flamboyant buildings that reach toward the skyline.\u003c/p\u003e\n\u003cp\u003e“I know this place…” I mutter. “Vegas.”\u003c/p\u003e\n\u003cp\u003e“It was the safest place I could think of.” His voice not only sends a chill down my spine, but it also makes my body tingle with heat and my heart wake up from its very deep sleep.\u003c/p\u003e\n\u003cp\u003eAlex walks through the doorway, taking tentative steps as he inches himself toward the bed—toward me—and every image of the last time we were in bed together flashes through my head. The way I felt, the way he made me finally breathe and then minutes later, he stole it all away from me by betraying me, ripping out my heart and shredding it to pieces; he probably still has my blood on his hands.\u003c/p\u003e\n\u003cp\u003eHe’s wearing a black t-shirt and a pair of jeans and his hair is damp and sticking up all over. He looks like a normal guy, completely harmless, but it’s just an illusion.\u003c/p\u003e\n\u003cp\u003eI throw the blanket off me and swing my legs over the side of the bed, noting I’m no longer wearing my clothes, but a pair of boxer shorts and a t-shirt that doesn’t belong to me. “Stay away from me.”\u003c/p\u003e\n\u003cp\u003e“Gemma, I’m not going to hurt you.” His voice is soft as he continues to step toward me; his bright green eyes are fixed on mine. “I promise I won’t hurt you.”\u003c/p\u003e\n\u003cp\u003eI laugh sharply as I put weight on my weak knees. “That’s the biggest lie I’ve ever heard come out of your mouth.”\u003c/p\u003e\n\u003cp\u003eAlex stops dead in his tracks, his expression filling with infuriation. “What the hell is that supposed to mean?”\u003c/p\u003e\n\u003cp\u003eMy knees shake as I stand up and find my stability. “It means your promises are worthless. At least, the ones you make to me.”\u003c/p\u003e\n\u003cp\u003eHe raises his eyebrows. “My promises got you to Adessa’s, safe and sound.”\u003c/p\u003e\n\u003cp\u003e“Safe and sound doesn’t exist.”\u003c/p\u003e\n\u003cp\u003e“It does for the moment, Gemma, and you’ll understand why, if you just let me explain.”\u003c/p\u003e\n\u003cp\u003eI shake my head and take a step forward, wanting to get out of the room and away from him. “I’m leaving. I don’t know why I’m walking around alive and normal, but I’m not going to waste my time listening to your bullshit.”\u003c/p\u003e\n\u003cp\u003e“You’re walking around normal because of me—because of how I feel about you.” He moves to the side, obstructing my path. “Just let me explain.”\u003c/p\u003e\n\u003cp\u003eI shake my head and dodge to the right, but I’m like a newborn deer and my knees give out on me. His arms encircle my waist and he catches me before I crash against the hardwood floor. He picks me up, carries me over to the bed, and sets me back down. I start to get back up, but he puts his hands down on the bed, one on each side of me, and lowers his face toward mine.\u003c/p\u003e\n\u003cp\u003e“I just need five minutes to explain,” he almost begs. “Five minutes for me to tell you what happened and then, if you don’t like it, I’ll leave.”\u003c/p\u003e\n\u003cp\u003eI search his eyes for the person that lay with me in the bed. “Five minutes,” I say. “But that’s all you have and if one single thing sounds like bullshit, then you leave, not just the house, but my life.”\u003c/p\u003e\n\u003cp\u003eHe nods without hesitation. As his lips part, I’m not sure if he will help me understand, or crash my world again. \u003c/p\u003e","sourceLink":"https://allnovel.net/shattered-promises-shattered-promises-1/page-44.html","bookId":1976,"creation":"Oct 5, 2019 10:23:09 AM","modification":"Oct 5, 2019 10:23:09 AM"}
