{"id":94770,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe dropped the knife and Tom gathered him up and they sank down to their knees together on the kitchen floor, crying so loud that the sound threatened to break the world.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eThe way Riot wept now was her passport to that country. Nix had been there too. And Lilah. Each of them had wandered alone through that land, refugees among the war-torn devastation of their innocence.\u003c/p\u003e\n\u003cp\u003eBenny did not tell Riot that it was okay, because it wasn’t.\u003c/p\u003e\n\u003cp\u003eHe didn’t tell her that this would pass. The moment would, but the scars would always be there. It was the thing that would always identify them as travelers through the storm lands of the soul.\u003c/p\u003e\n\u003cp\u003e35\u003c/p\u003e\n\u003cp\u003eONE WEEK AGO . . .\u003c/p\u003e\n\u003cp\u003eOn a hot afternoon Sister Sun staggered out into the sunlight. Saint John and the army had been gone now for weeks, marching to California to find nine towns filled with heretics. By the time Sister Sun had returned from the remote lab two hundred miles away, the saint had already left. She felt empty without him; he was a great source of strength for her.\u003c/p\u003e\n\u003cp\u003eHer Red Brotherhood guardsmen snapped to attention. The nearest of them saw how unsteady she was on her feet and rushed to catch her as Sister Sun’s knees buckled.\u003c/p\u003e\n\u003cp\u003e“Sister—” he began, but she cut him off.\u003c/p\u003e\n\u003cp\u003e“No, I’m fine . . . I just need to sit down. Send a runner to find Brother Peter. At once. Good. And some water. Thanks. . . .”\u003c/p\u003e\n\u003cp\u003eShe sat in the shade under a Joshua tree and sipped water from an aluminum canteen. Her hands shook so badly that the water sloshed against her lips and splashed onto the front of her shirt, darkening the black cloth and soaking the angel wings.\u003c/p\u003e\n\u003cp\u003e“Brother Peter is coming up the hill,” said the reaper who’d helped her sit.\u003c/p\u003e\n\u003cp\u003eSister Sun looked up to see the unsmiling young man walking toward her at a brisk pace, his own guards fanned out behind him.\u003c/p\u003e\n\u003cp\u003e“Are you unwell, my sister?” he called as he jogged the last few yards. Sister Sun grabbed his wrist and pulled him close.\u003c/p\u003e\n\u003cp\u003e“Send them away,” she whispered.\u003c/p\u003e\n\u003cp\u003ePeter snapped his fingers and the Red Brothers immediately retreated out of earshot but within visual range.\u003c/p\u003e\n\u003cp\u003e“What is it, sister?” asked Peter, his tone gentle and filled with concern. “Is it the cancer . . . ?”\u003c/p\u003e\n\u003cp\u003e“No,” she said, a smile forming on her lips, “it’s not me. It’s nothing wrong.”\u003c/p\u003e\n\u003cp\u003e“Then—?”\u003c/p\u003e\n\u003cp\u003eShe clutched two handfuls of his shirt with desperate excitement. “I figured it out, Peter,” she cried.\u003c/p\u003e\n\u003cp\u003e“You . . .”\u003c/p\u003e\n\u003cp\u003e“I know how to kill them.”\u003c/p\u003e\n\u003cp\u003e“Kill who?”\u003c/p\u003e\n\u003cp\u003eSister Sun could feel the glorious madness blossom in her eyes. And from Peter’s reaction, she knew he could see it too.\u003c/p\u003e\n\u003cp\u003e“Everyone,” she said. “I figured out how to kill . . . everyone.”\u003c/p\u003e\n\u003cp\u003eFROM NIX’S JOURNAL\u003c/p\u003e\n\u003cp\u003eThe day we found Sanctuary we also saw the jet. It landed on the airfield, but by the time we reached the base, the plane had been shut down, the lights and engine turned off. We never saw the pilot or crew.\u003c/p\u003e\n\u003cp\u003eEvery time they bring me over to the blockhouse for an interview, I ask where the jet’s crew is, and they never tell me. All they’ll say is that they’re being debriefed—whatever that means.\u003c/p\u003e\n\u003cp\u003eJoe won’t tell us either.\u003c/p\u003e\n\u003cp\u003eWhat are they hiding?\u003c/p\u003e\n\u003cp\u003e36\u003c/p\u003e\n\u003cp\u003e“HOW DO YOU FEEL TODAY?” asked the voice.\u003c/p\u003e\n\u003cp\u003e“I’ve developed an irresistible hunger for human flesh,” said Benny.\u003c/p\u003e\n\u003cp\u003eThere was a long, long silence. The interview cubicle was so dark that Benny could barely see the wall-mounted speaker. He bent close to listen. He could hear the interviewer breathing.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003eThe voice said, “When you say that you’ve developed a—”\u003c/p\u003e\n\u003cp\u003e“Oh, for God’s sake, it was a joke.”\u003c/p\u003e\n\u003cp\u003eAfter a moment the voice said, “A ‘joke’?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m sure even you lug nuts have heard that word before.”\u003c/p\u003e\n\u003cp\u003e“Mr. Imura . . . why would you make a joke about something like that?”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eThere was no answer.\u003c/p\u003e\n\u003cp\u003eBenny knocked on the speaker. “Hey—you still there?”\u003c/p\u003e\n\u003cp\u003e“How do you feel today?” asked the voice, as if the conversation was just starting.\u003c/p\u003e\n\u003cp\u003eBenny sighed. “With my hands.”\u003c/p\u003e\n\u003cp\u003e“Mr. Imura . . .”\u003c/p\u003e\n\u003cp\u003e“Why don’t you tell me what you’re doing to help my friend Chong.”\u003c/p\u003e\n\u003cp\u003e“We’re doing everything we can.”\u003c/p\u003e\n\u003cp\u003e“Is he getting better?”\u003c/p\u003e\n\u003cp\u003e“He’s stabilized.”\u003c/p\u003e\n\u003cp\u003e“Is he getting better?” Benny asked again, more slowly, over-enunciating each word.\u003c/p\u003e\n\u003cp\u003e“We . . . are not sure we can expect an improvement at this time.”\u003c/p\u003e\n\u003cp\u003e“Then let me out of here.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Let me out. We’re done.”\u003c/p\u003e\n\u003cp\u003e“Mr. Imura,” said the voice, “you are being immature about this.”\u003c/p\u003e\n\u003cp\u003e“Immature?” Benny laughed. “I went out to that plane yesterday to look for those stupid research notes. I didn’t see you out there.”\u003c/p\u003e\n\u003cp\u003e“We have to stay inside the quarantine of the lab.”\u003c/p\u003e\n\u003cp\u003e“I didn’t see your soldiers out there either. In fact, you know who I did see out there? A freaking reaper. And you know what I did? I freaking killed him. That’s what I did. You want to hide behind your stupid wall inside this freaking bunker and call me immature?” Benny kicked the speaker as hard as he could. The little grille buckled. “You’re not doing anything for me or Chong or anyone else, so tell me why I should help you? Tell me what we’re accomplishing with these little chats of ours. All you’re doing is wasting my time and pissing me off.”\u003c/p\u003e\n\u003cp\u003eHe gave the speaker another kick.\u003c/p\u003e\n\u003cp\u003eAlmost three full minutes passed before the door opened. In that time the voice did not return, did not ask another question.\u003c/p\u003e\n\u003cp\u003eBenny got up and stepped out into the hot sunlight. A monk was there to guide him across the bridge.\u003c/p\u003e\n\u003cp\u003eNo way I’m going back in there, he told himself. I’d rather be stuck in a zombie pit at Gameland with my hands tied behind my back.\u003c/p\u003e\n\u003cp\u003eSuddenly that fragment of broken memory from yesterday skittered across his mind again.\u003c/p\u003e\n\u003cp\u003eHe froze.\u003c/p\u003e\n\u003cp\u003e“Brother—?” inquired the monk, but Benny held up his hand.\u003c/p\u003e\n\u003cp\u003e“Gimme a sec . . .”\u003c/p\u003e\n\u003cp\u003eHe closed his eyes and repeated what he’d just thought. There was something there.\u003c/p\u003e\n\u003cp\u003eZombie pit.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eSergeant Ortega. A big soldier.\u003c/p\u003e\n\u003cp\u003eIn a zombie pit?\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eNo. Not exactly. Not a zombie pit.\u003c/p\u003e\n\u003cp\u003eNot at Gameland. Benny was sure of that much. Sergeant Ortega.\u003c/p\u003e\n\u003cp\u003eHe could see the face.\u003c/p\u003e\n\u003cp\u003eNot a living face. Dead.\u003c/p\u003e\n\u003cp\u003eDefinitely zommed out.\u003c/p\u003e\n\u003cp\u003eBut also definitely Sergeant Ortega. No doubt about it.\u003c/p\u003e\n\u003cp\u003eIn a pit.\u003c/p\u003e\n\u003cp\u003eZombie.\u003c/p\u003e\n\u003cp\u003ePit.\u003c/p\u003e\n\u003cp\u003eWhat other pits were there with zombies in them?\u003c/p\u003e\n\u003cp\u003eAnd suddenly he had it.\u003c/p\u003e\n\u003cp\u003eHis eyes snapped open.\u003c/p\u003e\n\u003cp\u003eHe remembered exactly where he had seen Sergeant Luis Ortega. And if he was right, then the man—the zom that had been that man—would still be there.\u003c/p\u003e\n\u003cp\u003eBenny bolted from beside the monk and ran as fast as he could across the bridge.\u003c/p\u003e\n\u003cp\u003e37\u003c/p\u003e\n\u003cp\u003eBENNY FOUND NIX IN THE mess hall. She was sitting with Riot, their heads bent together as they spoke.\u003c/p\u003e\n\u003cp\u003e“Nix!” he called from halfway across the room.\u003c/p\u003e\n\u003cp\u003eHer head jerked up and she looked around. Then she immediately got up and started to turn away, to leave. Benny ran to her and caught her wrist.\u003c/p\u003e\n\u003cp\u003e“Nix—I heard about yesterday. Are you all right?”\u003c/p\u003e\n\u003cp\u003e“Yes. We’re both okay.”\u003c/p\u003e\n\u003cp\u003e“Thank God!” he said breathlessly. “Listen, I need to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Benny—no, I can’t . . . I . . .”\u003c/p\u003e\n\u003cp\u003eHe gently pulled her around to face him. Her eyes were red, as if she’d been crying a long time, and her whole face was pink and puffy. Her scar and her freckles always grew darker when she was upset, and now they were very dark.\u003c/p\u003e\n\u003cp\u003e“Listen, Nix—”\u003c/p\u003e\n\u003cp\u003eShe looked up at him with such pain in her green eyes that it stalled him. “I saw him.”\u003c/p\u003e\n\u003cp\u003e“You saw . . . Chong?”\u003c/p\u003e\n\u003cp\u003e“Riot and I went over yesterday. They let us see him.”\u003c/p\u003e\n\u003cp\u003eBenny half turned to see the look on Riot’s face. She hadn’t told him that last night. There were other storms raging through her life, and Benny held no grudge.\u003c/p\u003e\n\u003cp\u003eBefore he could say anything, Nix flung herself into his arms and clung to him with all her strength.\u003c/p\u003e\n\u003cp\u003e“Oh, Benny . . . he looked so bad,” she wailed. “He looked so sick. So lost.”\u003c/p\u003e\n\u003cp\u003eHer words disintegrated into sobs that were so deep, so shattered, that it silenced the entire mess hall. Those sobs were every bit as terrible as Riot’s had been.\u003c/p\u003e\n\u003cp\u003eBenny enfolded her in his arms and held her close. Her body was furnace hot against his; her tears burned like acid. She trembled with the kind of deep grief and pain that went all the way down to the core. Benny understood that kind of anguish. He held her and kissed her hair.\u003c/p\u003e\n\u003cp\u003eThe monks at the tables turned away. A few of them gave him small smiles and encouraging nods, but they said nothing and did not interfere.\u003c/p\u003e\n\u003cp\u003eBenny led Nix back to her table and they sat down together, awkwardly, still clinging to each other. Riot got up and came around behind them, wrapped her arms around them both, and laid her cheek down on the tops of their heads.\u003c/p\u003e\n\u003cp\u003eEventually the storm passed, as all storms pass.\u003c/p\u003e\n\u003cp\u003eNix gradually straightened and pulled away. Riot sat down on her side of the table. Everyone used the napkins to wipe their streaming noses and eyes.\u003c/p\u003e\n\u003cp\u003e“Nix, I—,” Benny began, but she touched her fingers to his chest.\u003c/p\u003e\n\u003cp\u003e“Please, Benny, let me say something first.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eShe dabbed at her eyes. “What I said yesterday about Chong . . .”\u003c/p\u003e\n\u003cp\u003eBenny nodded but said nothing.\u003c/p\u003e\n\u003cp\u003e“Please, don’t ever think—”\u003c/p\u003e\n\u003cp\u003e“No,” he cut her off. “Listen to me, Nix, you don’t need to say this, and I don’t need to hear it. We . . . kind of just said it all anyway.”\u003c/p\u003e\n\u003cp\u003eRiot said, “See, I was right about you, Benny. You are smarter than you look.”\u003c/p\u003e\n\u003cp\u003eIt was a lame joke, but it broke the bubble of tension that had been expanding to crowd the moment.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Nix said. “I needed to say that much. I really am.”\u003c/p\u003e\n\u003cp\u003eBenny kissed her.\u003c/p\u003e\n\u003cp\u003eNix kissed him back.\u003c/p\u003e\n\u003cp\u003eRiot made gagging sounds. “Y’all better get a room or name the baby after me.”\u003c/p\u003e\n\u003cp\u003eBenny made a covert and very rude gesture.\u003c/p\u003e\n\u003cp\u003eThen he leaned back to catch his breath. “Listen,” he said, “I need to tell you a bunch of things, but first I want to hear everything about yesterday. All I really heard, Nix, was that you and Lilah got jumped by some zoms. . . .”\u003c/p\u003e\n\u003cp\u003eNix told him the full story. Benny’s heart sank.\u003c/p\u003e\n\u003cp\u003e“Fast zoms? Four of them?”\u003c/p\u003e\n\u003cp\u003e“Three fast ones and one that might not have been,” corrected Nix.\u003c/p\u003e\n\u003cp\u003e“Even so,” said Riot, “that’s crooked math. Y’all were lucky to walk out of there with skin still on your bones.”\u003c/p\u003e\n\u003cp\u003e“Tell me about it,” Nix said, rolling her eyes.\u003c/p\u003e\n\u003cp\u003e“What was that bit with the red powder?” asked Benny.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Nix admitted. “I showed Joe and he kind of freaked. I haven’t seen him since.”\u003c/p\u003e\n\u003cp\u003e“Wonder what it is,” said Riot.\u003c/p\u003e\n\u003cp\u003e“Listen,” Benny said, changing the subject. “I had a crazy day too. I need to tell you guys, and then I need your help with something. I’d ask Joe, but nobody knows where he is and we’re running out of time. So . . . I need both of you to help me do something incredibly dangerous and incredibly stupid.”\u003c/p\u003e\n\u003cp\u003e“Dangerous and stupid?” asked Nix, and her pretty face wore its first smile in over a day. “Sounds like one of your plans.”\u003c/p\u003e\n\u003cp\u003e“I’m on the hook already,” said Riot. “I haven’t done anything dangerous or stupid in weeks. I’m about due.”\u003c/p\u003e\n\u003cp\u003eHe explained everything that had happened yesterday. The story of the fight with the reaper wiped the smiles away. The account of the Teambook raised their eyebrows. The tally of the reaper forces stole the color from their faces. But the thing that filled their eyes with fear was when Benny explained where he had seen Sergeant Ortega.\u003c/p\u003e\n\u003cp\u003e“You want us to go where?” demanded Riot. “You’re touched in the head, boy.”\u003c/p\u003e\n\u003cp\u003e“You’re absolutely out of your mind,” said Nix. “I mean seriously, Benny, you’re deranged.”\u003c/p\u003e\n\u003cp\u003e“I know, I know,” he said. “But are you in?”\u003c/p\u003e\n\u003cp\u003eNix and Riot stared at him and then at each other, and then at him again.\u003c/p\u003e\n\u003cp\u003e“We’re in,” said Nix.\u003c/p\u003e\n\u003cp\u003e38\u003c/p\u003e\n\u003cp\u003eMILES AND MILES AWAY . . .\u003c/p\u003e\n\u003cp\u003eCaptain Strunk sat on an overturned bucket, resting heavily with his forearms on his knees. The trade wagon stood ten feet away. On the ground, covered with pieces of canvas, lay four bodies. Fifty feet away, just inside the fence line, lay three more. All of them had been quieted.\u003c/p\u003e\n\u003cp\u003eTwo figures stood in front of him. A short man and a tall boy.\u003c/p\u003e\n\u003cp\u003eThe man was Deputy Gorman, Strunk’s second in command.\u003c/p\u003e\n\u003cp\u003eThe boy was Morgie Mitchell.\u003c/p\u003e\n\u003cp\u003eOn the ground between Morgie and Captain Strunk was a length of wood. A bokken. Smeared with blood, broken in two.\u003c/p\u003e\n\u003cp\u003e“I checked him, Cap,” said Gorman. “No bites, no scratches.”\u003c/p\u003e\n\u003cp\u003eStrunk nodded.\u003c/p\u003e\n\u003cp\u003e“I told you that I wasn’t hurt,” said Morgie. “You could have taken my word for it.”\u003c/p\u003e\n\u003cp\u003e“You fought four zoms with a stick, kid,” said Strunk. “I wouldn’t take anyone’s word that they did that without a scratch.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-15.html","bookId":2584,"creation":"Oct 5, 2019 6:10:53 PM","modification":"Oct 5, 2019 6:10:53 PM"}
