{"id":94776,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBrother Peter did not answer. Not in words.\u003c/p\u003e\n\u003cp\u003eHe stood a yard away from Nix, apparently ignoring the gun pointed at his head. And then he moved. So hideously fast that there was no time to react or cry out. Brother Peter snatched the pistol from Nix’s hand, spun her, and wrapped an arm around her throat. He let the pistol fall and suddenly there was a knife in his hand, the edge of the blade pressed against the soft flesh beneath Nix’s jaw.\u003c/p\u003e\n\u003cp\u003eBenny’s sword flashed from its scabbard, but Brother Peter froze him in place with seven horrible words.\u003c/p\u003e\n\u003cp\u003e“I will paint you with her blood.”\u003c/p\u003e\n\u003cp\u003eThe pistol lay on the ground by Brother Peter’s foot. He kicked it into the ravine.\u003c/p\u003e\n\u003cp\u003e“And now,” he said calmly, “tell me again that you refuse to get what belongs to me. Tell me, boy, and watch this girl’s life flow out of her.”\u003c/p\u003e\n\u003cp\u003e“No!” cried Benny.\u003c/p\u003e\n\u003cp\u003eNix stared at Benny with wide eyes filled with total terror.\u003c/p\u003e\n\u003cp\u003eThe reapers began climbing off their quads, grins forming on their tattooed faces.\u003c/p\u003e\n\u003cp\u003eRiot pivoted and aimed her slingshot at the nearest one, but Benny knew that it was no good. She could bring the man down, Benny could take the next few with his sword, but that knife was already at Nix’s throat.\u003c/p\u003e\n\u003cp\u003eThen suddenly there was a sharp metallic sound behind the reapers. A sound so specific that everyone knew what it was before they turned and looked.\u003c/p\u003e\n\u003cp\u003eA slide being racked on an automatic pistol.\u003c/p\u003e\n\u003cp\u003eThe Lost Girl rose up out of the tall grass behind the half circle of reapers, her big automatic pistol held in a two-handed grip.\u003c/p\u003e\n\u003cp\u003e“Let Nix go,” she said in her graveyard whisper of a voice, “or I’ll blow your head off.”\u003c/p\u003e\n\u003cp\u003eThe reapers froze in place, some with weapons half-drawn. Brother Peter turned to face Lilah.\u003c/p\u003e\n\u003cp\u003e“Kill me and she dies too.”\u003c/p\u003e\n\u003cp\u003e“You’re threatening to kill her anyway. Might as well kill you first.”\u003c/p\u003e\n\u003cp\u003e“My reapers of the Red Brotherhood will slaughter you.”\u003c/p\u003e\n\u003cp\u003eLilah said, “Look into my eyes. Tell me if you think I care.”\u003c/p\u003e\n\u003cp\u003eBrother Peter did look into her eyes, and Benny thought he could see something shift in the man’s expression. It was not fear—Benny didn’t think this man was capable of that emotion—but perhaps it was a kind of understanding, of acceptance.\u003c/p\u003e\n\u003cp\u003eHe lowered his knife and gave Nix a small push. She staggered forward, and Benny caught her with one arm. Nix immediately wheeled and tried to kick Brother Peter in the groin. He parried the kick as effortlessly as if he was swatting a fly.\u003c/p\u003e\n\u003cp\u003e“Nix,” cautioned Benny as he pulled her away from the reaper. She jerked free of his grip and drew her sword. Dojigiri glittered in the bright sunlight, but for all its deadly promise, Brother Peter seemed not to care in the slightest.\u003c/p\u003e\n\u003cp\u003eLilah’s pistol was rock-steady in her grip. “Get out of here.”\u003c/p\u003e\n\u003cp\u003eWithout an iota of haste, Brother Peter slid his knife back into its sheath. “Listen to me,” he said softly. “We all walk away from this moment. But understand me—I want what you gave to Captain Ledger. You will bring it to me.”\u003c/p\u003e\n\u003cp\u003e“Why do you think we’d even consider it?” snapped Nix.\u003c/p\u003e\n\u003cp\u003eBrother Peter held out his arm, pointing across the miles toward Sanctuary. “Because I think you care about those people at Sanctuary. The sick, the helpless.” He paused. “The children.”\u003c/p\u003e\n\u003cp\u003eBenny heard Riot’s sharp intake of breath.\u003c/p\u003e\n\u003cp\u003e“You think that Sanctuary is a fortress,” said the reaper, “that you’re safe there.”\u003c/p\u003e\n\u003cp\u003e“We are,” said Nix firmly.\u003c/p\u003e\n\u003cp\u003eBrother Peter picked up the satchel and stowed it in the rear compartment of his quad. “Fail to bring me what you stole and you’ll learn exactly how safe Sanctuary is.”\u003c/p\u003e\n\u003cp\u003e“She’s right,” said Benny. “Try anything and the army will stop you.”\u003c/p\u003e\n\u003cp\u003eBrother Peter snorted. The reapers laughed. Harsh, brutal laughs that seemed to be fueled by some certain knowledge of what Brother Peter was suggesting. They winked at one another and traded high fives.\u003c/p\u003e\n\u003cp\u003e“You’re a strange boy,” said Brother Peter. “Do you really think the ‘army’ will rise to your defense?”\u003c/p\u003e\n\u003cp\u003e“Me personally? Probably not,” admitted Benny. “I’m no one. But if you try to take it from Captain Ledger, then, sure, they’ll have his back. But it’s stupid. You have knives, they’ve got guns.”\u003c/p\u003e\n\u003cp\u003eBrother Peter shook his head. “There aren’t enough bullets in the world to stop the will of Thanatos—all praise to his darkness.”\u003c/p\u003e\n\u003cp\u003eThe reapers echoed his words.\u003c/p\u003e\n\u003cp\u003e“I’ll give you until sunset tomorrow,” said Brother Peter as he climbed onto his quad. “That should be more than enough time to find a way to trick Joe Ledger into returning what you stole. Bring it here and leave it on the edge of the ravine weighted down with a rock. We won’t interfere with you delivering it.”\u003c/p\u003e\n\u003cp\u003e“Hey, man, I gave you the satchel,” said Benny. “Like I said, I get to keep whatever I found yesterday. Call it a draw.”\u003c/p\u003e\n\u003cp\u003e“No,” said Brother Peter, “let’s not.”\u003c/p\u003e\n\u003cp\u003eLilah edged around to stand with Benny and the others. “Get out of here,” she said.\u003c/p\u003e\n\u003cp\u003eBrother Peter’s eyes were filled with dark mystery. “There is a storm coming,” he said. “It is the breath of my god, and it will be more powerful than any hurricane you’ve ever seen. The clouds will open and a rain of blood will pour down upon you. The coming storm will blow down the structures of your old world; it will seek out the blasphemers no matter where they hide. It will cleanse the earth, and when it has passed there will be no proof that you—that any of you—ever even lived.”\u003c/p\u003e\n\u003cp\u003eBenny wanted to hit him with a snappy comeback, but there was something in Brother Peter’s voice, some look in his eye that made the words die on his tongue.\u003c/p\u003e\n\u003cp\u003e“You have until tomorrow evening,” said Brother Peter. He signaled the reapers to start their engines. They turned and drove away, crossed the clearing, and passed single file into the forest.\u003c/p\u003e\n\u003cp\u003e47\u003c/p\u003e\n\u003cp\u003eTHE LOST GIRL LOWERED HER gun and picked up her spear.\u003c/p\u003e\n\u003cp\u003eNix let out a long, ragged breath, sheathed her sword, turned, and punched Benny in the chest as hard as she could.\u003c/p\u003e\n\u003cp\u003e“Wait—OWW! What was that for?” he bellowed.\u003c/p\u003e\n\u003cp\u003e“You just gave him the satchel?” seethed Nix. “You just up and handed over the only clues we have to where Dr. McReady might be?”\u003c/p\u003e\n\u003cp\u003e“No, I—”\u003c/p\u003e\n\u003cp\u003e“What in tarnation is going on in your head, boy?” asked Riot. “Or is there anything at all happening in there?”\u003c/p\u003e\n\u003cp\u003e“No,” said Lilah, “he’s not very bright.”\u003c/p\u003e\n\u003cp\u003e“Look, I—”\u003c/p\u003e\n\u003cp\u003eNix shook her head in complete disgust. “And are you planning on asking Joe for that stuff?”\u003c/p\u003e\n\u003cp\u003e“Good luck with that,” said Riot, and added under her breath, “moron.”\u003c/p\u003e\n\u003cp\u003e“Hey, wait, I—”\u003c/p\u003e\n\u003cp\u003e“What were you thinking, Benny?” asked Nix.\u003c/p\u003e\n\u003cp\u003e“You guys are great,” he said sarcastically. “Thanks for the vote of confidence . . . but I’m not actually stupid.”\u003c/p\u003e\n\u003cp\u003eHe reached into his vest pocket for something and held it out an inch from Nix’s face. The girls studied the papers. Nix took one; Riot took the other. Lilah came and peered over their shoulders.\u003c/p\u003e\n\u003cp\u003eNix’s read: URGENT: REPT OF R3 ACTIVITY VCNTY OF DVNP—REL. WIT. *** FTF?\u003c/p\u003e\n\u003cp\u003eRiot’s read: +36° 30\u0027 19.64\", -117° 4\u0027 45.81\"\u003c/p\u003e\n\u003cp\u003eLilah said, “Wait . . . what?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what Brother Peter was looking for,” said Benny, “but I’m guessing this is it.”\u003c/p\u003e\n\u003cp\u003eA slow smile formed on Nix’s face and even her freckles seemed to glow.\u003c/p\u003e\n\u003cp\u003e“I shoved those in my pocket when I saw the quads. Nothing else in the satchel looked to be important.”\u003c/p\u003e\n\u003cp\u003eRiot grinned and shook her head. “By golly, boy, you are as slick as a greased weasel.”\u003c/p\u003e\n\u003cp\u003e“Thanks, I think.”\u003c/p\u003e\n\u003cp\u003eLilah gave him an appraising stare as if surprised that he wasn’t mentally deficient after all.\u003c/p\u003e\n\u003cp\u003eNix’s smile faltered. “What happens when Brother Peter realizes he doesn’t have these?”\u003c/p\u003e\n\u003cp\u003e“How do we even know that he knows what he’s looking for?” asked Benny. “They must have been watching us and saw us take the satchel. Then they saw us put stuff back into the satchel, and now they have it. What we need is to get our butts back to Sanctuary.” He paused. “Yesterday Joe told me that when they couldn’t find the D-series records, we lost our last chance to beat this thing. I don’t think that’s true.”\u003c/p\u003e\n\u003cp\u003eNix said, “What do you think Brother Peter meant about a storm coming?”\u003c/p\u003e\n\u003cp\u003e“He was bluffing,” said Benny. “Lilah had a gun on him and he was talking trash.”\u003c/p\u003e\n\u003cp\u003eLilah gave a slow shake of her head. “No, he wasn’t.”\u003c/p\u003e\n\u003cp\u003e“You don’t think so?” asked Benny.\u003c/p\u003e\n\u003cp\u003e“Snow White’s right,” said Riot. “Brother Peter wasn’t bluffing at all, no sir. You could tell it from his voice. He thinks he’s going to win.”\u003c/p\u003e\n\u003cp\u003e“Against Sanctuary?” Nix laughed. “Against Captain Ledger and the soldiers? How?”\u003c/p\u003e\n\u003cp\u003eNo one had an answer to that.\u003c/p\u003e\n\u003cp\u003e“Then it’s some kind of weapon,” said Lilah. “Something we haven’t seen yet.”\u003c/p\u003e\n\u003cp\u003e“Reapers only use knives,” said Nix.\u003c/p\u003e\n\u003cp\u003eRiot shrugged. “Before I left them, they would never have used a quad. It was old-world science, totally taboo. Now look. So who knows what else they might try?” Riot shook her head. “No . . . we have to be ready for them to do anything at all to win.”\u003c/p\u003e\n\u003cp\u003eWithout another word they got their quads and raced back to Sanctuary.\u003c/p\u003e\n\u003cp\u003e48\u003c/p\u003e\n\u003cp\u003eBROTHER PETER PULLED HIS QUAD into the cleft of a tumble of huge rocks and killed the engine. Sister Sun sat on a stool under the shade of an awning erected for her by her reaper bodyguards. She sipped water from a plastic cup. She looked older than her years and as frail as an icicle on a warm morning.\u003c/p\u003e\n\u003cp\u003e“How did it go?” she asked as Brother Peter came over and sat down across from her.\u003c/p\u003e\n\u003cp\u003eHe poured himself some water, sipped it, and set his cup aside.\u003c/p\u003e\n\u003cp\u003e“It went exactly as planned,” he said.\u003c/p\u003e\n\u003cp\u003eShe reached out and patted his hand.\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eFROM NIX’S JOURNAL\u003c/p\u003e\n\u003cp\u003eBenny isn’t the same boy I grew up with.\u003c/p\u003e\n\u003cp\u003eIt’s been less than nine months since all our troubles started. Nine months ago Benny was really young. Cute and smart, but immature for his age. Everyone thought so, but nobody was mean enough to say it to his face.\u003c/p\u003e\n\u003cp\u003eAfter the first time Tom took him to the Ruin, Benny started to change. He smiles a lot less, and sometimes he still says dumb things and acts immature. But . . . sometimes I wonder if the way he acts during those times is a defense mechanism. I wonder if he’s still trying to be a kid when everything else in the world is trying to make him old.\u003c/p\u003e\n\u003cp\u003eIs he aware of it?\u003c/p\u003e\n\u003cp\u003eSince we came to Sanctuary, he’s changed even more. I’m not sure how to describe it. It’s like he’s leveled out. He’s even. Does that make sense?\u003c/p\u003e\n\u003cp\u003eThis new Benny is a lot more like Tom. Independent and strong, but also not like Tom. Maybe Benny’s becoming someone else.\u003c/p\u003e\n\u003cp\u003eI hope Benny likes the person he’s becoming.\u003c/p\u003e\n\u003cp\u003eI do. Maybe more than I ever have.\u003c/p\u003e\n\u003cp\u003e49\u003c/p\u003e\n\u003cp\u003eMILES AND MILES AWAY . . .\u003c/p\u003e\n\u003cp\u003eThe sign read SLAUGHTERHOUSE ROAD.\u003c/p\u003e\n\u003cp\u003eIt made Saint John smile, as much for the visceral imagery that it conjured in his mind as for the poetry that he always found written into the mundane events of each day.\u003c/p\u003e\n\u003cp\u003eHe stood in the shade of a billboard on which a smugly smiling figure once promised that everyone could, without question, hear him now. Saint John had never owned a cell phone. Even before the Fall he had believed that they whispered suggestions of temptation in the ear and sucked away both common sense and faith the way a tick sucks blood. Besides, before the dead rose, whenever Saint John felt the need to say something of importance to someone, he took them to some remote place and shared his secrets in the pauses between screams.\u003c/p\u003e\n\u003cp\u003eThe weeds and grasses grew tall all around the billboard, and a haphazard forest of young trees had grown up along the road. The road surface was cracked by roots and weather, but it was relatively clear of vegetation. When Saint John’s scouts saw this, they alerted him, and a platoon of the Red Brotherhood had come this way, following what was clearly a well-traveled route. Dried mud from recent rains showed the marks of horses’ hooves, wagon wheels, and booted footprints. A trade route or something else had been the guess, and now here was the proof.\u003c/p\u003e\n\u003cp\u003eFour trade wagons made their slow way along the road. All of them had been converted from farm carts. The frames were a mix of truck chassis and wooden cart wheels, with big boxes bolted to the frame. Each box was covered in sheet metal, and the teams of horses were protected by carpet coats covered in nets made of steel washers connected by heavy-gauge wire. The horses of the men riding alongside the carts were similarly armored, and all the men and women in the party wore ankle-length carpet coats, thick leather gloves, and helmets of all kinds, including fencing masks, football helmets, old Norman steel caps looted from museums, and even a plastic fishbowl with holes cut for ventilation. There were four mounted riders and ten guards on foot. Everyone was armed, and apart from knives and swords, many of them had guns.\u003c/p\u003e\n\u003cp\u003eIt was a considerable defensive force, and old bleached bones lying along the road spoke to the effectiveness of their many preparations.\u003c/p\u003e\n\u003cp\u003eSaint John approved of the weapons, the clever design of the carpet coats and metal armor. All of it was more than sufficient to stop an attack by the living dead. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-21.html","bookId":2584,"creation":"Oct 5, 2019 6:10:53 PM","modification":"Oct 5, 2019 6:10:53 PM"}
