{"id":94781,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I did,” admitted Ledger. “And I gave them back to Benny. After all, he found them.”\u003c/p\u003e\n\u003cp\u003e“That’s treason. I could have you shot for this.”\u003c/p\u003e\n\u003cp\u003eJoe smiled. “You could try, Jane. But I don’t think that would work out for you as well as you’d like.” He shook his head. “Besides, those papers belong to Benny.”\u003c/p\u003e\n\u003cp\u003e“They are the property of the American Nation.”\u003c/p\u003e\n\u003cp\u003e“Excuse me,” cut in Nix, “but exactly where are the borders of the American Nation?”\u003c/p\u003e\n\u003cp\u003e“Is that a joke?” demanded Reid.\u003c/p\u003e\n\u003cp\u003e“No, it’s a straight question. We found those papers out here in the Ruin. Benny took some off a reaper and the coordinates from a walker. Are you saying that that happened inside your legal boundaries?”\u003c/p\u003e\n\u003cp\u003e“The whole continent is the American Nation.”\u003c/p\u003e\n\u003cp\u003e“From the Atlantic to the Pacific?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“So—central California is part of that, right?”\u003c/p\u003e\n\u003cp\u003eReid snapped her mouth shut, but it was too late. Her foot was in Nix’s bear trap.\u003c/p\u003e\n\u003cp\u003e“You’re saying that our town, Mountainside, and all the other towns in the Sierra Nevadas are part of the American Nation?”\u003c/p\u003e\n\u003cp\u003eReid kept her mouth clamped shut, but her face darkened by at least two shades. Benny wanted to laugh, but he kept his own mouth shut.\u003c/p\u003e\n\u003cp\u003e“You admit that our towns are part of your new nation, and yet never once did you send anyone to us. What were we? Inconvenient? Too much trouble? Did you just write us off?”\u003c/p\u003e\n\u003cp\u003eWhen Reid didn’t answer, Lilah gave a derisive snort. So far it was her only contribution to the conversation, but it was eloquent.\u003c/p\u003e\n\u003cp\u003eFinally Reid couldn’t hold it back anymore. “You arrogant little snots. Who the hell do you think you’re talking to? I’ve dedicated my entire life to protecting this country.”\u003c/p\u003e\n\u003cp\u003e“Really?” asked Benny. “How much of that time was spent protecting the people?”\u003c/p\u003e\n\u003cp\u003eReid shook her head. “You’re not capable of understanding what it takes to protect a nation.”\u003c/p\u003e\n\u003cp\u003e“I am,” said Joe quietly. “And the kid asks a good question. My rangers put together maps of all the populated settlements. I was in Asheville three times over the last two years to request permission to establish connections and resources to provide technology recovery services, medicines, and communication equipment. People like you argued against it every time. It wasn’t the best use of resources. The distances were too great. The indigenous populations of those settlements did not include a high enough percentage of scientists and researchers. Lots of excuses, none of them worth a drop of moose spit.”\u003c/p\u003e\n\u003cp\u003e“It’s not in your pay grade to question policy, Captain.”\u003c/p\u003e\n\u003cp\u003e“It’s not in anyone’s pay grade to devalue tens of thousands of human lives because protecting them is inconvenient. I can’t begin to tell you how deeply ashamed I am for not taking matters into my own hands. I should have told this boy’s brother about the American Nation. I should have told everyone. I should never have followed orders about leaving it to my superiors. Never. They deserve to know.”\u003c/p\u003e\n\u003cp\u003e“They would have been contacted at the appropriate time. There’s a timetable for this.”\u003c/p\u003e\n\u003cp\u003e“Contacted when?” asked Nix. “After we were all dead? After the reapers or the zoms slaughtered us? When exactly would the ‘appropriate’ time be?”\u003c/p\u003e\n\u003cp\u003e“This conversation is ridiculous,” Reid said with a dismissive shake of her head. “You’ll hand over those coordinates so I can assign a team to—”\u003c/p\u003e\n\u003cp\u003e“No,” said Benny.\u003c/p\u003e\n\u003cp\u003e“Don’t test me, boy.”\u003c/p\u003e\n\u003cp\u003e“The answer’s no. You don’t get them.”\u003c/p\u003e\n\u003cp\u003eReid laid her hand on the pistol holstered at her hip. “You want to play games, boy? Do you want me to take them from you?”\u003c/p\u003e\n\u003cp\u003eNix and Lilah drew their pistols as fast as lightning. Riot, however, very casually took her slingshot from her belt and socketed a ball bearing into the pouch. Joe Ledger folded his arms and leaned a hip against the table.\u003c/p\u003e\n\u003cp\u003eBenny did nothing except give Reid a small, cold smile. “Like Captain Ledger said—you can try.”\u003c/p\u003e\n\u003cp\u003eBut Reid was not easily flustered. “Captain Ledger, I order you to—”\u003c/p\u003e\n\u003cp\u003e“Colonel Reid, I hereby resign my commission in the army of the American Nation, yielding all rank, pay, benefits, and privileges effective as of right now.”\u003c/p\u003e\n\u003cp\u003e“You can’t do that.”\u003c/p\u003e\n\u003cp\u003e“Just did. In fact, a long time ago Tom Imura offered to let me sleep on his couch and help set me up as a bounty hunter in Mountainside. So I’m retroactively taking his offer, which means that I am declaring myself a citizen of Mountainside, one of the Nine Towns of the Sierra Nevadas. You can’t tell by hearing it, but I’m capitalizing Nine Towns. If no one else has declared them a sovereign nation, then I am.”\u003c/p\u003e\n\u003cp\u003e“You—”\u003c/p\u003e\n\u003cp\u003e“Unless,” Joe said, “you would like to formally accept those towns into the American Nation, extending to the citizens the full support and resources of the American Nation.”\u003c/p\u003e\n\u003cp\u003eBefore Reid could answer, Joe stepped forward. His smile was strange, Benny thought. Feral, like a wolf’s. It was almost as if a different person—more savage and more intense—glowered out through his blue eyes.\u003c/p\u003e\n\u003cp\u003e“Listen to me, Jane, and you’ll do yourself a lot of good by keeping your ears open and your mouth shut,” he said, his voice as soft as a whisper. “I’ve fought for my country and I’ve fought for my world. You sat behind a desk. You haven’t logged an hour of field time in thirty years. You don’t understand what it was that built this country in the first place. You take a lot of pride in being an officer in the ‘American’ Nation. So do I, but that rank and uniform comes with a price—no, an obligation—to protect the people as well as the real estate. Some of our colleagues didn’t always grasp that before the Fall. Some did, a lot didn’t. Those were the boneheads who thought it was a smart idea to nuke the cities rather than try to protect the survivors and retake the land. Those were the ones who used ‘assets’ and ‘collateral damage’ to describe people and loss of life. Well, guess what . . . that ends right here and right now. America was born in the fires of a revolution, with people who wanted to push back against oppression. It was made tougher in the furnace of a civil war to make everyone free. In every single decade there were people who stood up and spoke out, people who made a stand. I look at you and what you represent, and I look at these four kids here and all their integrity and potential, and sister, you don’t measure up too well.”\u003c/p\u003e\n\u003cp\u003e“You’re a hypocrite,” said Reid.\u003c/p\u003e\n\u003cp\u003e“I know it. But that was five minutes ago. Miracle of miracles, I have officially come to my senses. Now how about that? And from now on I’ll do whatever I can, whatever I need to do, to atone for being a pigheaded jackass and a company man for way too long.” He took a small step closer. “Oh yeah, and theft. I’m going to steal one of those helicopters so I can try and find Dr. McReady.”\u003c/p\u003e\n\u003cp\u003eBenny nodded to Nix and the others, and they lowered their weapons.\u003c/p\u003e\n\u003cp\u003e“You don’t want to do this, Captain,” said Reid.\u003c/p\u003e\n\u003cp\u003eHe stepped back and shrugged. “I’m not a captain anymore.”\u003c/p\u003e\n\u003cp\u003eJoe walked over to the helicopter, entered it, and did something that caused the big motor to whine to life. Then he climbed out, crossed to the wall near the door they’d entered, and pressed a big red button. Immediately the massive hangar doors began rolling sideways, letting the hot afternoon air spill in, bringing with it the stink of zombie flesh.\u003c/p\u003e\n\u003cp\u003eWhile Joe did all this, Colonel Reid stood exactly where she was. She said nothing and did nothing.\u003c/p\u003e\n\u003cp\u003eThe ranger came back to the table. “Once we’re airborne,” he said, “we’ll radio you with the coordinates. Just in case. Maybe once you see where we’re going, you’ll understand.”\u003c/p\u003e\n\u003cp\u003eReid’s face was wooden.\u003c/p\u003e\n\u003cp\u003eJoe paused. “I know what you’re dealing with, Jane. And you know that I’m doing the right thing.”\u003c/p\u003e\n\u003cp\u003eHer lips curled slowly back to reveal small, hard teeth. “I hope you die out there,” she snarled.\u003c/p\u003e\n\u003cp\u003eJoe sighed and walked away. Benny felt sad. That was exactly what Morgie Mitchell had said to him before they’d left him behind in Mountainside. Even now Benny didn’t think the colonel meant those words, any more than Morgie had. Sometimes you can be so hurt, so sad, and so confused that the only words you can force out are hateful ones.\u003c/p\u003e\n\u003cp\u003eBenny started to turn, but paused as Lilah pointed a finger at Reid. “Take care of Chong.”\u003c/p\u003e\n\u003cp\u003e“Louis Chong is a patient in this facility,” said Reid. “Don’t insult me.”\u003c/p\u003e\n\u003cp\u003eLilah shook her head. “It’s not an insult. It’s a threat. I thought that was clear.”\u003c/p\u003e\n\u003cp\u003eShe turned and walked toward the helicopter.\u003c/p\u003e\n\u003cp\u003eIt occurred to Benny that this had all been going on a long time without any of Reid’s soldiers interfering. That didn’t seem right.\u003c/p\u003e\n\u003cp\u003e“Colonel?” he asked, keeping his voice neutral. “Where are the soldiers? Where’s everyone else?”\u003c/p\u003e\n\u003cp\u003eHe expected a sharp answer or at least some sarcastic remark. Instead he saw sadness flood into her eyes. Her shoulders sagged for a moment, as if some tremendous weight pressed down on them.\u003c/p\u003e\n\u003cp\u003eBut she did not answer Benny’s question.\u003c/p\u003e\n\u003cp\u003e60\u003c/p\u003e\n\u003cp\u003eTHEY CLIMBED INTO THE HELICOPTER, and Joe buckled everyone into a seat. Grimm threw himself onto the deck with a loud clank of armor. Only Riot remained standing.\u003c/p\u003e\n\u003cp\u003e“You need to buckle up, girl,” said Joe.\u003c/p\u003e\n\u003cp\u003eBut she shook her head. “I ain’t going. I don’t like to leave Eve here alone. Little bird’s been hurting something bad, and I want to keep an eye on her.”\u003c/p\u003e\n\u003cp\u003eNo one could argue with that. Lilah did something that surprised Benny. The stern, detached Lost Girl reached over and took Riot’s hand, giving it a reassuring squeeze. For a fierce moment Riot clutched that hand like it was a lifeline. Lilah bent and kissed Riot’s hand. There was no romance in it, just a connection on a wordless, human level. A conversation through action rather than words.\u003c/p\u003e\n\u003cp\u003eIt stirred Benny’s heart. Since Chong got sick, Lilah had become almost a nonperson. Cold, incredibly remote, and harsh. Could she be thawing? Or was Eve too powerful a reminder of Annie?\u003c/p\u003e\n\u003cp\u003eBenny said, “Give Evie a kiss from me.”\u003c/p\u003e\n\u003cp\u003eRiot gave him a sad little smile. “She liked those balloons.”\u003c/p\u003e\n\u003cp\u003e“It was nice to see her smile.”\u003c/p\u003e\n\u003cp\u003eThat changed Riot’s expression, but she turned away to hide whatever was in her eyes. At the door she paused.\u003c/p\u003e\n\u003cp\u003e“Y’all come back safe and sound, hear?”\u003c/p\u003e\n\u003cp\u003eThen she stepped outside, and they could hear her crunching steps as she ran back to the bridge.\u003c/p\u003e\n\u003cp\u003e“Balloons?” asked Joe.\u003c/p\u003e\n\u003cp\u003eBenny explained about the pack of brightly colored balloons he’d found in the reaper’s quad. “Can’t figure why he’d have them, though.”\u003c/p\u003e\n\u003cp\u003e“Everyone’s a scavenger these days,” observed Joe. “Maybe he knew some kids and thought they might like them.”\u003c/p\u003e\n\u003cp\u003eThat thought didn’t make Benny feel any better. Kids waiting for the reaper to return with a present for them.\u003c/p\u003e\n\u003cp\u003eHe sighed and busied himself with trying to adjust the straps. Seats requiring buckles were as far outside Benny’s experience as helicopters were. However, he couldn’t tell if the hammering of his heart was because of the thought of actually flying—particularly in a machine that was as extinct to his experience as the dinosaurs—or because of the confrontation he’d just had with Colonel Reid. He suspected that it was both in roughly equal measures.\u003c/p\u003e\n\u003cp\u003eNix sat next to him, her small hand in his, fingers entwined, skin icy cold. Lilah sat across from him, and her thoughts were clearly directed inward. Shutters had dropped behind her eyes.\u003c/p\u003e\n\u003cp\u003eJoe slid the door shut, squatted down, and shouted over the whine of the engine. “We used to have an expression: ‘This just got real.’ Well, that’s where we are. We’re stealing government equipment, and we have no friends here at Sanctuary except a bunch of monks.”\u003c/p\u003e\n\u003cp\u003e“Is that meant as a pep talk?” asked Benny.\u003c/p\u003e\n\u003cp\u003e“Just stating the facts.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” said Nix, “but I’m pretty sure we’re already scared enough as it is.”\u003c/p\u003e\n\u003cp\u003eJoe grinned.\u003c/p\u003e\n\u003cp\u003e“Do we even know where we’re going?”\u003c/p\u003e\n\u003cp\u003e“We do.” Joe removed a big map from his pocket and spread it out on the floor and tapped a spot with a forefinger. “Right here.”\u003c/p\u003e\n\u003cp\u003eNix leaned in and read the words printed on the map. “Death Valley National Park. Oh, isn’t that wonderful.”\u003c/p\u003e\n\u003cp\u003e“ ‘Death’ Valley?” asked Benny. “Seriously? Death Valley?”\u003c/p\u003e\n\u003cp\u003e“That’s the DVNP on the note we found,” observed Nix. “It fits.”\u003c/p\u003e\n\u003cp\u003e“I get that, but really . . . Death Valley?”\u003c/p\u003e\n\u003cp\u003e“I think we all appreciate the irony,” said Nix.\u003c/p\u003e\n\u003cp\u003e“Not sure you do,” said Benny. He reached out with the toe of his shoe and tapped another spot. “Does that actually say the ‘Funeral Mountains’?”\u003c/p\u003e\n\u003cp\u003e“Don’t let it spook you, kid,” said Joe. “Those names were given long before the dead rose.”\u003c/p\u003e\n\u003cp\u003e“That’s actually not a comfort,” said Benny, and Nix nodded agreement.\u003c/p\u003e\n\u003cp\u003e“We’re heading to a spot called Zabriskie Point on the eastern side of Death Valley, south of Furnace Creek. It’s in the badlands. . . .”\u003c/p\u003e\n\u003cp\u003e“Oh, ‘badlands.’ Also very comforting.”\u003c/p\u003e\n\u003cp\u003eJoe said, “Look, if we pool all of what we know, we come up with a picture that’s a little grim and a little hopeful. I think we can safely deduce that Dr. McReady was not on the C-130 when it crashed. It seems clear that the plane stopped at the Umatilla Chemical Depot in Oregon, where I believe Doc McReady and Field Team Five deplaned and took alternate transport to Death Valley.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-26.html","bookId":2584,"creation":"Oct 5, 2019 6:10:53 PM","modification":"Oct 5, 2019 6:10:53 PM"}
