{"id":94793,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBenny had to reach deep into the shadows that clung to his memories. He had only a vague idea where he was—the infirmary at Sanctuary—and an even vaguer idea of how he got there. The most recent memories that were sharp and clear involved the hidden bioweapons lab built into the baked rocks of Zabriskie Point. He remembered Dr. McReady, the mutagen . . . and Archangel.\u003c/p\u003e\n\u003cp\u003e“The . . . pills?” he asked tentatively.\u003c/p\u003e\n\u003cp\u003e“The pills,” Chong said, nodding. “Nix and Lilah told me how you found Dr. McReady and brought her back here.”\u003c/p\u003e\n\u003cp\u003eBenny lay on his side, and his body did not seem to want to move. He raised his head and looked around. Most of the staff were sleeping in their beds, but a few ragged-looking nurses were working to clean them up. One was helping a newly recovered soldier to his feet. No one screamed or thrashed.\u003c/p\u003e\n\u003cp\u003e“Archangel really works,” said Benny. “God . . .”\u003c/p\u003e\n\u003cp\u003e“It was weird,” said Chong slowly. “I could feel the stuff in the pills working right away, but it was like someone was throwing buckets of water on a brush fire in my head. Every second was another bucket. How long before I stopped wanting to do crazy things to people—like fricking eat them? Hours, man. And even longer before I could actually say that to Lilah so she’d untie me. But that was all last night.”\u003c/p\u003e\n\u003cp\u003e“Last night? What time is it—?”\u003c/p\u003e\n\u003cp\u003e“Past six in the morning now. Best I can tell, you’ve been out of it since around ten last night. So about eight hours.” He sighed. “Been a long night, man.”\u003c/p\u003e\n\u003cp\u003e“Do you . . . do you remember what happened after Riot brought you here?” Benny paused. “Do you remember being . . . um . . . sick?”\u003c/p\u003e\n\u003cp\u003eA shadow passed across Chong’s face. “I remember all of it. Every last minute. Getting shot with an arrow . . . the ride here on Riot’s quad. The changes. God . . . the hunger. I even remember you coming to visit me in my cell.” He touched his temple. “It’s all up here for me any time I want to look at it.”\u003c/p\u003e\n\u003cp\u003eHe spoke in the ironic, amused tone he always used, but it was clear that demons had taken up residence in the house of his memories, and Benny wondered if they could ever be exorcised.\u003c/p\u003e\n\u003cp\u003e“Hey, man,” he said, “we found the cure, right? Let’s focus on that. . . . ” His voice trailed off as pain flickered behind Chong’s eyes. “What is it?”\u003c/p\u003e\n\u003cp\u003e“Benny . . . about that. Those pills . . . they’re not really a cure. They’re a treatment. I’m still sick. If I take the pills I’ll still be me, more or less. But if I stop, I go back to being that thing you saw in the cage. That’s how it’s going to be. Unless they come up with a real cure, something that gets this out of my system forever, I’ll always have to take medicine. And . . . I’ll always have to be really careful. This is contagious, y’know?”\u003c/p\u003e\n\u003cp\u003eBenny swallowed a lump the size of a fist. “And . . . Lilah?”\u003c/p\u003e\n\u003cp\u003e“She knows. We have to be really, really careful. We can touch and all, and we can kiss. But for anything else . . . Jeez, Benny, this is crazy. I love her, man,” said Chong, wiping at his eyes. “I love her more than anything, but I don’t want to make her sick.”\u003c/p\u003e\n\u003cp\u003e“I know . . .”\u003c/p\u003e\n\u003cp\u003e“No,” said Chong, “you don’t. I told her that she should stay away from me. She shouldn’t ever touch me; she shouldn’t ever get close to me. Dr. McReady told her the same thing. . . .”\u003c/p\u003e\n\u003cp\u003e“What did Lilah say?”\u003c/p\u003e\n\u003cp\u003eChong gave a short, rueful laugh. “She threatened to punch Dr. McReady’s teeth down her throat and told me to stop being a stupid town boy. She said that if I ever tried to go away from her again, she’d break my legs. She’s very romantic, that girl. Sweet as a kitten . . . if a kitten was a Siberian tiger with mood issues.”\u003c/p\u003e\n\u003cp\u003eBenny grinned. “Yeah, but for some inexplicable reason she loves you.”\u003c/p\u003e\n\u003cp\u003e“That only proves how crazy she is.”\u003c/p\u003e\n\u003cp\u003eBenny looked around. “Hey—where’s Nix?”\u003c/p\u003e\n\u003cp\u003e“Nix was here until like a minute before you woke up. I think she went to the bathroom. They have actual bathrooms here. No squatting behind bushes and wiping your butt with poison ivy.”\u003c/p\u003e\n\u003cp\u003e“That’s not exactly what we did.”\u003c/p\u003e\n\u003cp\u003e“Felt like it.”\u003c/p\u003e\n\u003cp\u003e“And where’s Lilah?”\u003c/p\u003e\n\u003cp\u003e“Ah,” he said, his smile fading. “The doctors wanted to give her something called an MRI. No idea what that is, but they said that she might have a skull fracture.” He shook his head. “I can’t have anything happen to her, Benny. Nothing.”\u003c/p\u003e\n\u003cp\u003eBenny reached out to try and give him a reassuring pat on the arm, but then winced as pain shot through his back.\u003c/p\u003e\n\u003cp\u003e“Owwww! What the hell?”\u003c/p\u003e\n\u003cp\u003eChong nodded. “Yeah, they said the painkillers would be wearing off pretty soon.”\u003c/p\u003e\n\u003cp\u003e“Painkillers . . . ? For what?”\u003c/p\u003e\n\u003cp\u003e“Aww, it’s so cute that you thought of me first before remembering that you had a big ol’ sword fight with a psycho killer. That little twinge you’re feeling is a knife wound, genius. They said that the anesthetic might make you a little slow. Not that this is a new mental state for you.”\u003c/p\u003e\n\u003cp\u003e“Bite me,” said Benny through gritted teeth.\u003c/p\u003e\n\u003cp\u003e“No thanks,” said Chong. “From now on I’m going to explore that whole vegan thing.”\u003c/p\u003e\n\u003cp\u003e“This . . . hurts. How bad is it? What happened?”\u003c/p\u003e\n\u003cp\u003e“Basically you got stabbed in the wrong place,” Chong said, and he told Benny enough so that the door of memories opened up. The fight with Brother Peter replayed in Benny’s mind with painful clarity.\u003c/p\u003e\n\u003cp\u003e“How am I not dead?”\u003c/p\u003e\n\u003cp\u003e“Because fortune favors the stupid,” said Chong. “The knife hit your ribs at the wrong angle. Didn’t puncture anything important enough to kill you. More like a scratch.”\u003c/p\u003e\n\u003cp\u003e“Could have freaking fooled me. If I’m only scratched, why did I pass out?”\u003c/p\u003e\n\u003cp\u003e“Because you’re a girlie-man?”\u003c/p\u003e\n\u003cp\u003e“Really, seriously, bite me.”\u003c/p\u003e\n\u003cp\u003e“They said it was blood loss, shock, and something about nerve compression. They put in a crapload of stitches. They said that you’ll be able to get out of bed today, though only for a couple of minutes at a time. The armor you were wearing kept the knife from going in too deep. And they examined Brother Peter’s knife. There was no infectious matter on it. Not like on the arrow I got shot with.”\u003c/p\u003e\n\u003cp\u003e“That’s something.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you agreed to a duel with a guy who makes Charlie Pink-eye look like a punk.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t a duel. I had a plan.”\u003c/p\u003e\n\u003cp\u003e“A plan to get stabbed?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Benny said, and he explained what he’d done. “It was like sacrificing a queen to get a checkmate.”\u003c/p\u003e\n\u003cp\u003eChong stared at him. “That hovers somewhere between the bravest thing I ever heard of and the stupidest. It’s probably both.”\u003c/p\u003e\n\u003cp\u003e“Probably,” agreed Benny.\u003c/p\u003e\n\u003cp\u003eChong shook his head. “As for the rest, I got bits and pieces of everything else. That guy Joe is here somewhere too. Is he the same Joe Ledger from the Zombie Cards?”\u003c/p\u003e\n\u003cp\u003e“Yes. Is he all right?”\u003c/p\u003e\n\u003cp\u003e“He caught a break too. They operated on him and were able to save his life. Lots of damage, though. Dr. McReady said it’ll be months before he can fight again.”\u003c/p\u003e\n\u003cp\u003e“Oh, man . . .”\u003c/p\u003e\n\u003cp\u003e“Point is, Benny, we’re both alive, and so are Nix and Lilah.” Chong paused. “After what happened, after things started to go bad in the forest out there . . . I thought this was it, you know? I thought we were all dead. It seemed like the logical end to all of this. I mean, who were we? Four kids who had no business leaving home. Okay, so maybe Lilah’s different, but after Tom died, we should have gone back to Mountainside.”\u003c/p\u003e\n\u003cp\u003eAnd that fast the cobwebs in Benny’s head blew away.\u003c/p\u003e\n\u003cp\u003e“Mountainside!” he cried. “Oh my God!”\u003c/p\u003e\n\u003cp\u003e87\u003c/p\u003e\n\u003cp\u003eTHEY FORMED A CIRCLE AROUND Joe Ledger’s bed. Benny in a wheel-chair, Chong and Lilah holding hands, Nix standing next to Benny. Dr. McReady and Colonel Reid were there too.\u003c/p\u003e\n\u003cp\u003eThe ranger was awake and in great pain. His color was bad, and sweat beaded his forehead. Dr. McReady was angry with him because he refused to take any pain meds.\u003c/p\u003e\n\u003cp\u003e“I need to think,” he growled, “and I can’t do that pumped full of morphine.”\u003c/p\u003e\n\u003cp\u003e“Pain increases stress and—”\u003c/p\u003e\n\u003cp\u003e“Oh, stick a sock in it, Monica,” he fired back. “I’ve had a lot worse than—”\u003c/p\u003e\n\u003cp\u003e“I know, I know, Joe, I’ve heard all the stories. You’ve been shot, stabbed, run over, and mauled by wild animals. I’m very impressed with your level of testosterone, but the simple fact remains that those injuries happened to a much younger man and—”\u003c/p\u003e\n\u003cp\u003e“Like I said, stick a sock in it.”\u003c/p\u003e\n\u003cp\u003eGrimm—no longer wearing his armor—lay beside the bed and gave a hearty whuff.\u003c/p\u003e\n\u003cp\u003eJoe turned his red-rimmed, bleary eyes to Benny. “Go on, kid . . . what did you want to tell us?”\u003c/p\u003e\n\u003cp\u003eBenny repeated what Brother Peter had said with his dying breath.\u003c/p\u003e\n\u003cp\u003eMountainside will burn.\u003c/p\u003e\n\u003cp\u003e“We have to get home,” finished Benny.\u003c/p\u003e\n\u003cp\u003e“We can’t,” said Colonel Reid. “We’ve secured this facility, but topside it’s still a war zone. All my soldiers are either dead or in the infirmary, and there are half a million infected out there. More, now that they’ve probably killed all the people in the hangars. God knows how many reapers.”\u003c/p\u003e\n\u003cp\u003e“And all the monks,” said Nix. She wore a fresh bandage over the cut from Brother Peter.\u003c/p\u003e\n\u003cp\u003eChong said, “What about Riot and that little girl, Eve?”\u003c/p\u003e\n\u003cp\u003eNo one wanted to meet his eyes.\u003c/p\u003e\n\u003cp\u003e“They were up there,” said Benny. “We . . . didn’t see them when we landed.”\u003c/p\u003e\n\u003cp\u003eThe implications of that hung in the air.\u003c/p\u003e\n\u003cp\u003e“You’re saying they’re dead?” asked Chong.\u003c/p\u003e\n\u003cp\u003e“There are places to hide,” said Joe weakly. “And Riot knows every one of them.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” said Reid, “but that doesn’t change anything. We don’t have the manpower to take the compound back from the dead, and we can’t call for help. The reapers trashed the communications center. And we’re running on the backup generator because they destroyed the main power plant.”\u003c/p\u003e\n\u003cp\u003e“We can’t be stuck down here,” said Benny, banging his fist on the metal tubing of Joe’s bed. “Our town—”\u003c/p\u003e\n\u003cp\u003e“Your town might as well be on the far side of the moon,” said Colonel Reid. “Those balloons were filled with the mutagen. It’s a red powder, sticks to everything. Until the mutagen weakens the infected through decomposition, we’re trapped. I just hope the generator lasts long enough for that to happen.”\u003c/p\u003e\n\u003cp\u003e“We have to get out of here,” said Nix sternly. “We have to try and find Riot and Eve, and then we have to get back to our town.”\u003c/p\u003e\n\u003cp\u003e“To do what? Four kids can’t save a town,” said Reid. “And from what Joe told me about Mountainside, it’s indefensible. A flat field and a chain-link fence is no defense at all.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” said Nix bitterly, “I guess you found that out here. The minefield beyond the fence didn’t stop the balloons, and sensors inside the fence couldn’t alert anyone because everyone was sick. The reapers just waltzed in here.”\u003c/p\u003e\n\u003cp\u003eReid’s face darkened.\u003c/p\u003e\n\u003cp\u003eNix dug her journal out of her pack. “See this? I’ve been collecting everything there is to know about zoms, and about the way people fight zoms. I’ve also asked Joe about a million questions about tactics and strategies. If I can get home to Mountainside, I can help them get ready. Earthworks, deadfalls, spiked walls, fire pits . . . I understand this stuff. It’s all I’ve been thinking about.”\u003c/p\u003e\n\u003cp\u003e“She’s not joking,” said Chong. “If we can get out of here, we might actually be able to do something to help our town. We need to find a way out of this compound.”\u003c/p\u003e\n\u003cp\u003eReid started to shake her head, but Chong cut her off.\u003c/p\u003e\n\u003cp\u003e“My family is in Mountainside,” he said, and his voice held an edge Benny had never before heard there. “I’ve been through too much hell over the last month to want to debate this.”\u003c/p\u003e\n\u003cp\u003e“He’s right,” said Benny. “Look, Colonel, your soldiers are either dead or recovering from the plague, so right now I think there are more of us than there are of you. We’re going to get out of here. The question is whether you help us, in which case you get to lock the door behind us, or you don’t help us, and you take your chances with whoever or whatever walks through that door.”\u003c/p\u003e\n\u003cp\u003eThe moment stretched as Reid looked from Benny to Chong to Lilah to Nix.\u003c/p\u003e\n\u003cp\u003eIn the silence, Joe Ledger spoke. Benny knew that he had to be in terrible pain, and yet the ranger imposed a degree of control over his voice that spoke to an incredible strength of will. Like Tom’s. Unique in its own way, but also like Tom’s. Brothers of a kind.\u003c/p\u003e\n\u003cp\u003e“Jane,” he said evenly, “I know what you’re thinking. These are four teenagers. Kids. Benny’s stitched up and looks like he was thrown down an elevator shaft. Chong—hell, a few hours ago Chong was willing to eat people. Lilah’s been punched twice in the face by a powerful adult male. And little Phoenix—she’s not even five feet tall and looks like she’s ninety pounds of red hair and freckles. Kids, sure. And who are kids compared to what’s out there? Kids aren’t able to do this kind of thing.”\u003c/p\u003e\n\u003cp\u003e“That’s just it . . . they don’t stand a chance out there.”\u003c/p\u003e\n\u003cp\u003e“If I thought that, I’d crawl out of this bed and tackle them myself. Or I’d sic Grimm on them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-38.html","bookId":2584,"creation":"Oct 5, 2019 6:10:53 PM","modification":"Oct 5, 2019 6:10:53 PM"}
