{"id":94798,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No,” wheezed Benny, backing off and staggering. “I kind of have a knife wound thing going on, and I think I popped my stitches.”\u003c/p\u003e\n\u003cp\u003e“Knife wound?” echoed Morgie.\u003c/p\u003e\n\u003cp\u003eBenny’s knees buckled, and the other man darted forward and caught him.\u003c/p\u003e\n\u003cp\u003e“I never thought I’d see you again, Benjamin Imura,” said Solomon Jones. “I never thought we’d see any of you again.”\u003c/p\u003e\n\u003cp\u003eHe helped Benny over to a fallen log and steadied him as he sat. The others clustered around. Benny could feel wet heat under his clothes.\u003c/p\u003e\n\u003cp\u003e“How are you here?” asked Morgie, his face almost slack with confusion. “And how do you have cars?”\u003c/p\u003e\n\u003cp\u003e“Not cars, Morg,” said Chong, clapping him on the back. “Quads.”\u003c/p\u003e\n\u003cp\u003eMorgie looked past him to the girl with the leather vest and scalp tattoos.\u003c/p\u003e\n\u003cp\u003e“Whoa,” he said. “Hello. Where’d you come from?”\u003c/p\u003e\n\u003cp\u003e“It’s a long story,” said Nix.\u003c/p\u003e\n\u003cp\u003e“Plenty of daylight for a good yarn,” said Solomon. “We have lots of time.”\u003c/p\u003e\n\u003cp\u003eBenny shook his head. “No,” he said. “We don’t.”\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eA terse hour later the story was told. The jet and the wrecked airplane. The mutagen and Archangel. Sanctuary and the American Nation. Joe Ledger. Slow zoms and fast. The Night Church and Saint John. Brother Peter. Benny, Nix, and Chong took turns telling different parts of it. Benny tried to read Solomon’s face, but the man was too practiced at keeping his emotions and reactions in check. Morgie was a different story—Benny could read everything on his face. Shock, doubt, horror, pity, and fear.\u003c/p\u003e\n\u003cp\u003eWhen they got to the part about Haven, Morgie looked like he’d taken a physical blow.\u003c/p\u003e\n\u003cp\u003e“My cousins are there,” he said. “They work in the feed and grain store.”\u003c/p\u003e\n\u003cp\u003eNo one felt the need to correct the tense of that word to “worked.” It was an unnecessary cruelty.\u003c/p\u003e\n\u003cp\u003eSolomon straightened and walked a few paces away, his fists on his hips. “Three days, you say?”\u003c/p\u003e\n\u003cp\u003e“Maybe four,” said Chong. “It depends on how long they stay at Haven.”\u003c/p\u003e\n\u003cp\u003e“Forty thousand of them,” murmured Solomon. “Holy mother of God.”\u003c/p\u003e\n\u003cp\u003e“And all those zoms,” said Morgie. “The fence will never hold.”\u003c/p\u003e\n\u003cp\u003e“No,” agreed Nix. “But it might not matter.”\u003c/p\u003e\n\u003cp\u003eSolomon turned sharply. “What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003eNix touched Benny’s arm. “Tell him what you have in mind.”\u003c/p\u003e\n\u003cp\u003eBenny outlined his plan.\u003c/p\u003e\n\u003cp\u003e“No way, man,” said Morgie. “That’s crazy.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“It’s impossible. No one would agree to that.”\u003c/p\u003e\n\u003cp\u003e“They could just do nothing and let the reapers kill them,” said Benny coldly.\u003c/p\u003e\n\u003cp\u003eSolomon sat down next to him on the log. He sighed.\u003c/p\u003e\n\u003cp\u003e“This is your plan?” he asked.\u003c/p\u003e\n\u003cp\u003e“Nix put a lot of twists in it.”\u003c/p\u003e\n\u003cp\u003e“It’s his plan,” said Nix, and Chong nodded. Even Lilah agreed.\u003c/p\u003e\n\u003cp\u003e“You’re just a kid, Benny,” said Solomon, but even he didn’t sound convinced. “How did you get from Mountainside to here?” It was a question about distance traveled that had nothing to do with geography or the length of time they’d been on the road. Everyone knew that. “Tom would never have thought of something like this.”\u003c/p\u003e\n\u003cp\u003e“I’m not Tom,” said Benny, and those were very hard words to say. Nix took his hand and squeezed his fingers.\u003c/p\u003e\n\u003cp\u003e“No,” said Solomon, “you’re not. And frankly, I don’t know who you are. You’re certainly not the kid who left Gameland a couple of months ago.”\u003c/p\u003e\n\u003cp\u003e“No,” said Benny. “He died somewhere out in the desert.”\u003c/p\u003e\n\u003cp\u003eHis comment wasn’t meant as a joke, and no one took it that way.\u003c/p\u003e\n\u003cp\u003eSolomon ran a hand over his shaved head. “You really want to sell this plan to the people in town?”\u003c/p\u003e\n\u003cp\u003e“If they can think of another way to stop forty thousand reapers,” said Benny, “I’m all ears.”\u003c/p\u003e\n\u003cp\u003e“Even so . . .”\u003c/p\u003e\n\u003cp\u003e“You think I’m crazy?”\u003c/p\u003e\n\u003cp\u003e“I think this plan is crazy,” said Solomon. “But . . . I also think it’s brilliant. Brilliant in a way that hurts my heart, Ben. I can’t even guess what it’s doing to you.”\u003c/p\u003e\n\u003cp\u003eThere was nothing to say to that.\u003c/p\u003e\n\u003cp\u003eInto the awkward silence, Chong nodded to the red sashes and asked, “What are those?”\u003c/p\u003e\n\u003cp\u003eMorgie brightened. “It’s for the Freedom Riders. We all wear them.”\u003c/p\u003e\n\u003cp\u003e“The what?”\u003c/p\u003e\n\u003cp\u003eSolomon answered that. “After Tom died, all of us who were out at Gameland—Sally Two-Knives, J-Dog and Dr. Skillz, Fluffy McTeague, the whole bunch of us—rode to Mountainside. We told everyone what happened. We found enough stuff in the rubble to prove that Gameland existed and that people from the towns were routinely going there to get in on the fights in the zombie pits. Easy to prove anyway, since a lot of town folks died out there and there was no other explanation for their absence from town. Mayor Kirsch called a meeting of the councils of all Nine Towns. I told the story again, and I brought a copy of the proposal that Tom had prepared.”\u003c/p\u003e\n\u003cp\u003e“What proposal?” asked Chong.\u003c/p\u003e\n\u003cp\u003eBenny said, “Tom kept submitting ideas for how to improve the town’s defenses and for creating a militia to patrol the Ruin. Like the town watch, but for outside the fence.”\u003c/p\u003e\n\u003cp\u003eMorgie tapped his sash. “This time they listened.”\u003c/p\u003e\n\u003cp\u003e“A militia?”\u003c/p\u003e\n\u003cp\u003e“We don’t like to use that word,” said Solomon. “It sends the wrong message. The Freedom Riders are officially a peacekeeping force. Two hundred strong, and almost as many in training, like young Mr. Mitchell here.”\u003c/p\u003e\n\u003cp\u003e“I’m a cadet,” said Morgie, and he actually blushed.\u003c/p\u003e\n\u003cp\u003e“Two hundred,” said Benny.\u003c/p\u003e\n\u003cp\u003eChong said, “Saint John has forty thousand.”\u003c/p\u003e\n\u003cp\u003eSolomon pursed his lips. “Benny . . . this plan of yours . . . you know it’s crazy, right? I mean, you have enough perspective left to grasp that, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Benny.\u003c/p\u003e\n\u003cp\u003e“Then I think you kids better wait here. You roll into town on those bikes, telling stories like this, and all you’re going to do is create a fuss or a panic.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Let me talk to Mayor Kirsch. Ever since Tom died, he’s had a big change of heart. Him and Captain Strunk. I think I can get them to understand what you want to do and why.”\u003c/p\u003e\n\u003cp\u003e“They won’t like it worth a wet fart,” observed Morgie.\u003c/p\u003e\n\u003cp\u003e“Well put,” said Chong, clapping his friend on the shoulder.\u003c/p\u003e\n\u003cp\u003eSolomon smiled, showing a lot of very white teeth. “I guess I’ll have to be persuasive.”\u003c/p\u003e\n\u003cp\u003eHe swung into the saddle. “You kids take the next turn and go that way two miles. There’s a way station there with food and supplies. Wait for me there. But listen up . . . there have been reports of some wandering zoms in the area. Stay alert.”\u003c/p\u003e\n\u003cp\u003e“Fast or slow?” asked Nix.\u003c/p\u003e\n\u003cp\u003e“We only get one kind around here,” said Solomon. “At least so far. Zoms are zoms, though.”\u003c/p\u003e\n\u003cp\u003eBenny shook his head. “Not anymore.”\u003c/p\u003e\n\u003cp\u003eSolomon met his gaze and nodded. Then he wheeled his horse around and spurred it into a fast gallop.\u003c/p\u003e\n\u003cp\u003eWhen he was gone, Morgie asked, “What, you’re not afraid of zoms anymore?”\u003c/p\u003e\n\u003cp\u003e“Slow, dumb ones?” mused Chong. “No much. Fast, smart ones? Yup. But you haven’t met the reapers yet, Morg. There are scarier things out there, believe me.”\u003c/p\u003e\n\u003cp\u003eNix helped Benny onto his quad.\u003c/p\u003e\n\u003cp\u003e“Benny,” she asked softly, “maybe I missed it . . . but when did we stop being kids?”\u003c/p\u003e\n\u003cp\u003eHe turned away. He had no answer that felt sane to say out loud.\u003c/p\u003e\n\u003cp\u003ePART FIVE\u003c/p\u003e\n\u003cp\u003eINFERNO\u003c/p\u003e\n\u003cp\u003eOnly the dead have seen the end of war.\u003c/p\u003e\n\u003cp\u003e—PLATO\u003c/p\u003e\n\u003cp\u003e97\u003c/p\u003e\n\u003cp\u003eIN THREE DAYS AND THREE hours Saint John brought the army of the Night Church to the gates of Mountainside.\u003c/p\u003e\n\u003cp\u003eAfter the battle of Haven, his army counted out to thirty-eight thousand reapers on foot, two hundred and ten on quads, and one hundred and forty-two members of his elite Red Brotherhood. The forests behind and around them teemed with flocks of the gray people. The handlers worked in teams, using supersonic calls from dog whistles to keep them from scattering. Many of them were well fed now, and their ranks had swelled from the thousands who had gone into the darkness at Haven.\u003c/p\u003e\n\u003cp\u003eHe stood in the shade of the tall trees and looked across a broad field to the town that cowered behind a chain-link fence. There were guard towers, and Saint John could see people in them. There were other people behind the fence. Many of them. Some wore red sashes. Saint John knew that most or all of them would have guns.\u003c/p\u003e\n\u003cp\u003eThat was fine.\u003c/p\u003e\n\u003cp\u003eEverything was fine.\u003c/p\u003e\n\u003cp\u003eAs he stepped out into the field, the forest erupted with bodies who followed. The reapers of the Night Church, all of them armed with blades—knives, axes, swords, and spears. They moved into the sunlight in their thousands, standing in lines that stretched half a mile on either side of him like impossibly huge wings.\u003c/p\u003e\n\u003cp\u003eSix of Saint John’s chief aides walked with him, three on either side. They all had dabs of jelly smeared on their upper lips. As did Saint John. Pots of the mint gel were being passed among the ranks of reapers.\u003c/p\u003e\n\u003cp\u003eSaint John stopped thirty yards onto the field.\u003c/p\u003e\n\u003cp\u003eThe place stank.\u003c/p\u003e\n\u003cp\u003eIt was an appalling olio of smells too. Some of it was rotting flesh—but that was everywhere. There was also the stink of ashes from a massive fire pit north of the town where trash and the dead were burned. But the strongest smell was that of bleach. The field had been soaked in it.\u003c/p\u003e\n\u003cp\u003e“Why did they do that?” asked one of his aides.\u003c/p\u003e\n\u003cp\u003e“An attempt at chemical warfare, I suppose,” said Saint John. “It’s caustic. If they can hold us on this side of the fence for any length of time, then the vapors will make us sick.”\u003c/p\u003e\n\u003cp\u003eBut he laughed at the worried expressions on the faces of his aides.\u003c/p\u003e\n\u003cp\u003e“That’s a chain-link fence,” he said. “Not a castle wall. And see? Their earthworks are not even finished.”\u003c/p\u003e\n\u003cp\u003eThere were haphazard mounds of dirt all along the fence line, but they hadn’t been molded into barriers. It was a last-minute attempt that they’d been unable to finish. Perhaps they’d abandoned the effort in favor of soaking the ground with bleach instead.\u003c/p\u003e\n\u003cp\u003e“At least they tried,” he mused. “For their own pride, they have to go down trying. We’ve seen it in one way or another in every single town.”\u003c/p\u003e\n\u003cp\u003eAnd they had. One town had tried to stall them with a stampede of beef cattle. Another had used oxen to drag in enough wrecked cars to build a metal wall. And there had been a town that was built high among the trees. There had been moats, and earthworks, and even deadfalls filled with sharpened bamboo spikes. So many kinds of defense, so much effort.\u003c/p\u003e\n\u003cp\u003eEvery one of those towns had burned.\u003c/p\u003e\n\u003cp\u003eThe knives of the reapers had drunk deep on every street and in every house.\u003c/p\u003e\n\u003cp\u003eSaint John called for a quartermaster and gave instructions that every man and woman tie rags around their noses and mouths. With the mint gel killing the stink of the bleach and the rags protecting the lungs, everything would be addressed except the eyes. And what would happen there? The reapers’ eyes would tear. They would weep for the sinners in whose flesh they opened the red mouths.\u003c/p\u003e\n\u003cp\u003eHow poetic that was.\u003c/p\u003e\n\u003cp\u003eHow appropriate. The army of god wept in pity and in joy as they released the sinners from a world of iniquity into the purity of the eternal darkness.\u003c/p\u003e\n\u003cp\u003eIt would create a wonderful legend, and legends are always useful.\u003c/p\u003e\n\u003cp\u003eHe tied a cloth around his own mouth and nose and walked slowly forward. His aides walked a half step behind him. The sunlight made the red-hand tattoos on their faces glow like freshly spilled blood.\u003c/p\u003e\n\u003cp\u003eThe field was a mess, the grass withered and dead from the bleach, the soil muddy and cut with a thousand crisscrossing wheel ruts. Saint John recognized those signs too. In several towns—if there was enough advance warning—wagons filled with children, the elderly, and the infirm were sent away. To other towns or to some secure building. Sometimes wagons of treasure were carted off as well by people who did not understand the nature of the glory that awaited them. But once the town fell, there would be plenty of time to follow each set of wheel tracks to whatever “safe” place they led to. Knives would be drawn there as well, and the red mouths would cry out in joy at the release offered by the reapers of god.\u003c/p\u003e\n\u003cp\u003eIt was always the same. Even the iterations and variations were becoming commonplace.\u003c/p\u003e\n\u003cp\u003eSaint John was content in that. With each mystery that became a known quantity, a known tactic, his army became more confident, and the end result of god’s total dominion over a silent earth became that much more assured.\u003c/p\u003e\n\u003cp\u003eWith his Red Brothers in tow, Saint John walked half the distance between the trees and the fence line.\u003c/p\u003e\n\u003cp\u003eAnd there he stopped. His eyes did not burn as much as he’d expected, and that was good.\u003c/p\u003e\n\u003cp\u003eHe waited for almost five full minutes. He was a patient man, and this was part of the drama. Part of the legend.\u003c/p\u003e\n\u003cp\u003eHe also knew that the longer this part took—the longer the heretics in the town made him wait out here like a tradesman at a side door—the angrier his reapers became. Once, when he was made to wait for two hours, the killing in the town was particularly brutal. Perhaps it would be here as well. His men had marched long and hard through desert and drought-stricken lands to reach these towns. Every moment of privation, every aching muscle, every skipped meal stoked the fires in the hearts of the thousands of reapers who waited in the woods. The people in this town already had a terrible day ahead of them. But if they made him wait too long, they would learn that even a terrible day could get very much worse. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-43.html","bookId":2584,"creation":"Oct 5, 2019 6:10:53 PM","modification":"Oct 5, 2019 6:10:53 PM"}
