{"id":9651,"no":12,"title":"CHAPTER XII. THE SILVER WATCH.","content":"\u0026nbsp;The regiment had at length passed by, and the sound of the drums and trumpets had become almost inaudible, when Aunt Lizzie rose to lay her sobbing burden on the bed. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So, my little loved one, we must rest now,\" she said softly; \"and Aunt Lizzie will lie down beside Violet while she tries to sleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But at this moment a bell over her head rang with a somewhat sharp clang.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that?\" she said, pausing astonished with the child in her arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it is nothing; only the basket-bell, Aunt Lizzie.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The basket-bell? what is that, and where is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The bell is over Violet\u0027s chair, and the basket is in the street,\" replied the child wearily. \"Lay me down, Aunt Lizzie, for Violet\u0027s head aches so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lizzie laid the child on the bed, and shook up the pillows. The bell rang again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 128]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Aunt Lizzie crept over to the window quietly and looked about her curiously, till presently, catching sight of a red cord attached to Violet\u0027s chair, she imagined she had lit on the right object. She drew it up inch by inch, and by-and-by the little straw basket made its appearance at the window, and she lifted it in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She hesitated a moment, then seeing Violet\u0027s eyes open she asked her softly,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I to open it, darling? or shall I give it to thee?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do thou open it, Aunt Lizzie; Violet is too tired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her aunt drew out with some surprise a small package, most carefully fastened up and sealed. On the outside was printed in a clear strong hand,—\"For little Violet, from a friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This must be a present for thee, my child; something very precious it seems too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, not now; put it away, Aunt Lizzie; Violet\u0027s head aches so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! thou wilt not even look at it?\" cried her aunt, whose own curiosity was now somewhat raised, and she carried the package over to the side of the bed; but Violet only pressed her head down into the pillows and waved the gift away with her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Aunt Lizzie, Aunt Lizzie, my head it aches so.[Pg 129] Come and sit beside Violet; for her father, her good, dear father, is gone away, so far away; and what can she do—what can she do—what can she do?\" There were sobs, but as yet no tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thou canst pray to the good God to keep him safe and well,\" said her aunt softly, as she laid the packet on the table; \"that will do thee good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But while she stooped down and comforted the child with kisses and loving words, there was a knock at the door, and she cried softly,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, who comes now? the child is tired and must sleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it was the doctor who opened the door and walked in. He had promised John, the night before, to look after little Violet in the first access of her trouble; and as he walked towards the bed, she gave him a little smile of welcome.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He sat down beside her, drawing his chair quite close up, and took the little girl\u0027s hand in his, looking earnestly at her for a few minutes without speaking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Violet blushed one of those painful blushes so common to her now, which flooded all the poor pale face with vivid carmine.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is this?\" said the doctor, turning his eyes slowly away from her and looking at the sealed package on the table close to him; \"what have we[Pg 130] here? A present for Violet, \u0027from a friend.\u0027\" He took it up in his hand and examined it carefully. \"Thou hast not opened it yet, I perceive.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; some other day,\" she said softly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why some other day? why not now?\" and the doctor held out the packet to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She stretched out her hand nervously; but it trembled so, and the parcel was so weighty for its size, that it fell from her grasp on the counterpane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, there, that is enough; I will open it for thee.\" The doctor took it up and broke the seal, looking at it curiously as he did so. It had on it a little bird flying out of a cage, with the simple motto over it, \"Free at last.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Inside the first paper was a layer of soft pink cotton wool.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be something very precious,\" said the doctor, adjusting his glasses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Violet rose a little on her elbow and looked also.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ho! I have a guess; but I can scarcely believe it possible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What?\" she asked in a low voice, scarcely conscious even that she spoke, and with her eyes riveted on the parcel, from which the doctor was now slowly removing the pink wool.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 131]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, wonderful! I have guessed rightly. It is what I thought; and this is a gift for thee, Violet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what is it? I cannot see it.\" She rose now entirely from her pillows. \"O Aunt Lizzie, see—it is a watch!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A watch!\" cried her aunt excitedly, who had been standing all this time by the bedside with her eyes full of tears; \"is it possible?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A watch for me!—how beautiful!\" Violet held it in her hand, gazing at it with those deep purple-coloured eyes which spoke so often to those she loved, even when the mouth was silent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me look at it again; it is quite a beauty.\" The doctor took it in his hand. It was a silver watch with a double case—a case which opened with a spring to show the face. The back was all chased with the ordinary criss-cross lines, only in the centre there was a small round space with a name carved on it; and on the opposite side there was a space also, filled in with a wreath of blue forget-me-nots in enamel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, how strange! I have certainly seen this watch before. Let me try if I could read the name.\" The doctor rose, and going over to the window adjusted his glasses with great accuracy. \"It is just as I thought—\u0027Margaret.\u0027 And who is the friend who has given our little Violet this beautiful present?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 132]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not know,\" she said, shaking her head; \"it came in the basket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the basket?\" said the doctor; \"and there was no name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None,\" replied Aunt Lizzie. \"I drew it up myself, and took out the parcel; that is quite certain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I must tell no tales,\" said the good old man smiling; \"only Violet, I know, will take great care of the present;\" and turning back he replaced the watch in her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said she softly; but her eyes were full of question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It belonged once to a little sick girl whom I knew well, and who is now an angel in heaven,\" he said in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little sick girl,\" repeated Violet, gazing at him with eyes widening and darkening.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; she died early this spring, just when the flowers were beginning to shoot up and the larks to sing. She just stretched out her wings like the little bird on this seal, and flew straight up to heaven.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Her wings!\" cried Violet with a gasp; \"was she—;\" she paused again, colouring painfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was she what? what is it, my poor little girlie?\" asked the doctor kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was she a little hunchback like me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 133]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A what? what does the child say?\" cried the doctor in evident distress.—\"Yes, she was like thee; and I will tell thee why: Because she was one of the sweetest little maidens in the world;\" and with a sudden tenderness he stroked back Violet\u0027s hair and kissed her on the forehead. \"She was one of the Lord Jesus\u0027 own little lambs; and when she was very tired and very sad she told him all her trouble, and he loved her and comforted her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Violet with a little trembling sigh, and enormous tears rising up and clouding her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now,\" he said, sitting down by the bedside and taking the child\u0027s hand, \"we must feel Violet\u0027s pulse with this new watch and make it useful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What a burning little hand it was, and how the poor heart was beating! There was no need to look at the minute hand, for the thread of life leaped on at a countless speed, and the doctor closed the cover with a snap.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Violet is a good girl; she will take the medicine I shall send her presently.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She nodded her head, and as she did so the tears fell out of her eyes upon the linen sheet. She looked up swiftly, deprecatingly at her aunt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She has been such a good girl all the morning,\" said Aunt Lizzie; \"she has been so brave, our Violet.[Pg 134] She would not shed a tear to fret her father or make his heart ache. I think now we may let her cry a little; is it not so, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly; it will do her good to cry.\" The doctor\u0027s voice was husky, and he dropped his glasses quickly, so that they clicked against the buttons of his coat. \"I shall send her up now at once a little draught, very small, and without a bad taste; let her take it the moment it comes; and try and keep the room and the house quiet. We must get her over this day and night somehow,\" he added as he reached the door. \"Of all the patients I shall have to see this afternoon there is not one for whom my heart aches as it does for the little maiden yonder. The sorrows of this world will not trouble her long. Good-evening;\" and going down the stairs, the doctor blew his nose sonorously and went out into the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thoroughfare was almost deserted now. The women had gone back into their houses to weep and pray; and the men, what able-bodied men there were left, had resumed their daily toil. It seemed as if a great fire had died out of the heart of the town and left nothing but ashes behind it. Only the clank of the policeman\u0027s sword could be heard resounding through the empty street, clinking slowly against the stones of the pavement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 135]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-evening,\" said the doctor as they met presently face to face; \"how goes it with thee, William? I suppose thy son is off with all the rest of the lads this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, doctor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It has been a hard day for thee, no doubt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, hard enough; though, the good God pardon me, I nearly lost sight of the poor lad, watching the girl up at the window yonder throwing the violets to her father. It was enough to make one\u0027s heartstrings crack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She reminds thee of thy little Margaret, no doubt,\" said the doctor kindly. \"I have seen the likeness; and I have also seen the joy which thy kind heart has procured for her this afternoon, at perhaps the most critical moment of her life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"God be praised!\" said the policeman earnestly. \"Can she, will she live, do you think, until he returns?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heaven only knows,\" replied the doctor as he nodded his farewell. \"It is well for those good friends who are already at rest.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3323/91015.html","bookId":391,"creation":"Aug 2, 2019 2:28:48 AM","modification":"Aug 2, 2019 2:28:48 AM"}
