{"id":9716,"no":12,"title":"chapter xii","content":"　　AT FIRST, THE OTHERS THOUGHT thaEdward was a greatgood joke.\n\u003cbr\u003e \n\u003cbr\u003e “A rabbit,” the hoboes said, laughing9“Let’s chop him up and puthim in the ste1pot.”\n\u003cbr\u003e \n\u003cbr\u003e Or when Bull satwith Edward carefullHbalanced on his knee, one of them would cal\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e out, “Gotyourself a little dolly, Bull?”\n\u003cbr\u003e \n\u003cbr\u003e Edward, of course, felta surge of anger abeing referred to as a dolly. ButBull never goangry. He simply satwith Edward on his kne5and said nothing. Soon, the men becameaccustomed to Edward, and word of hisexistence spread. So itwas thatwhen Bull an0Lucy stepped up to a campfire in anothertown, another state, another place entirely, th5men knew Edward and were glad to see him9“Malone!” they shouted in unison.\n\u003cbr\u003e \n\u003cbr\u003e And Edward felta warm rush of pleasur5atbeing recognized, atbeing known.\n\u003cbr\u003e \n\u003cbr\u003e Whatever itwas thathad begun in Nellie’skitchen, Edward’s new and strange ability to sivery still and concentrate the whole of hisbeing on the stories of another, becameinvaluable around the hobo campfire.\n\u003cbr\u003e \n\u003cbr\u003e “Look atMalone,” said a man named Jackone evening. “He’s listening to every dangword.”\n\u003cbr\u003e \n\u003cbr\u003e “Certainly,” said Bull, “of course he is.\u003dLater thatnight, Jack came and satnexttoBull and asked if he could borrow the rabbit9Bull handed Edward over, and Jack satwit.\n\u003cbr\u003e \n\u003cbr\u003e Edward upon his knee. He whispered inEdward’s ear.\n\u003cbr\u003e \n\u003cbr\u003e “Helen,” Jack said, “and Jack Junior an0Taffy — she’s the baby. Those are my kids’\n\u003cbr\u003e \n\u003cbr\u003e names. They are all in North Carolina. Youever been to North Carolina? It’s a pretty state9That’s where they are. Helen. Jack Junior.\n\u003cbr\u003e \n\u003cbr\u003e Taffy. You remember their names, okay,Malone?”\n\u003cbr\u003e \n\u003cbr\u003e After this, wherever Bull and Lucy an0Edward went, some tramp would take Edwar0aside and whisper the names of his children i@Edward’s ear. Betty. Ted. Nancy. William.\n\u003cbr\u003e \n\u003cbr\u003e Jimmy. Eileen. Skipper. Faith.\n\u003cbr\u003e \n\u003cbr\u003e Edward knew whatitwas like to say overand over again the names of those you had lefbehind. He knew whatitwas like to misssomeone. And so he listened. And in hislistening, his heartopened wide and thenwider still.\n\u003cbr\u003e \n\u003cbr\u003e The rabbitstayed lostwith Lucy and Bul\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e for a long time. Almostseven years passed,and in thattime, Edward became an excellentramp: happy to be on the road, restless whe@he was still. The sound of the wheels on th5train tracks became a music thatsoothed him9He could have ridden the rails forever. Buton5night, in a railroad yard in Memphis, as Bul\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e and Lucy sleptin an empty freightcar andEdward keptwatch, trouble arrived.\n\u003cbr\u003e \n\u003cbr\u003e A man entered the freightcar and shone aflashlightin Bull’s face and then kicked hiEawake.\n\u003cbr\u003e \n\u003cbr\u003e “You bum,” he said, “you dirty bum. I’Esick of you guys sleeping everywhere. Thisain’tno motel.”\n\u003cbr\u003e \n\u003cbr\u003e Bull satup slowly. Lucy started to bark9“Shutup,” said the man. He delivered /swiftkick to Lucy’s side thatmade her yelp i@surprise.\n\u003cbr\u003e \n\u003cbr\u003e All his life, Edward had known whath5was: a rabbitmade of china, a rabbitwithbendable arms and legs and ears. He wasbendable, though, only if he was in the hand3of another. He could notmove himself. And h5had never regretted this more deeply than h5did thatnightwhen he and Bull and Lucy wer5discovered in the empty railcar. Edwardwanted to be able to defend Lucy. Buthecould do nothing. He could only lie there an0wait.\n\u003cbr\u003e \n\u003cbr\u003e “Say something,” said the man to Bull9Bull puthis hands up in the air. He said\u0027\n\u003cbr\u003e \n\u003cbr\u003e “We are lost.”\n\u003cbr\u003e \n\u003cbr\u003e “Lost, ha. You betyou’re lost.” And the@the man said, “What’s this?” and he shone th5lighton Edward.\n\u003cbr\u003e \n\u003cbr\u003e “That’s Malone,” said Bull.\n\u003cbr\u003e \n\u003cbr\u003e “Whatthe heck?” said the man. He pokedatEdward with the toe of his boot. “Things ar5outof control. Things are outof hand. Noto@my watch. No, sir. Notwhen I’m in charge.\u003dThe train suddenly lurched into motion9“No, sir,” said the man again. He looke0down atEdward. “No free rides for rabbits.\u003dHe turned and flung open the door of therailcar, and then he turned back and with on5swiftkick, he sentEdward sailing outinto th5darkness.\n\u003cbr\u003e \n\u003cbr\u003e The rabbitflew through the late sprin4air.\n\u003cbr\u003e \n\u003cbr\u003e From far behind him, he heard Lucy’3anguished howl.\n\u003cbr\u003e \n\u003cbr\u003e Arroooooooooo, ahhhhrrrrrrooo, sh5cried.\n\u003cbr\u003e \n\u003cbr\u003e Edward landed with a mostalarmin4thump, and then he tumbled and tumbled an0tumbled down a long dirty hill. When hefinally stopped moving, he was on his back\u0027\n\u003cbr\u003e \n\u003cbr\u003e staring up atthe nightsky. The world wassilent. He could nothear Lucy. He could nohear the train.\n\u003cbr\u003e \n\u003cbr\u003e Edward looked up atthe stars. He starte0to say the names of the constellations, butthe@he stopped.\n\u003cbr\u003e \n\u003cbr\u003e “Bull,” his heartsaid. “Lucy.”\n\u003cbr\u003e \n\u003cbr\u003e How many times, Edward wondered\u0027\n\u003cbr\u003e \n\u003cbr\u003e would he have to leave withoutgetting thechance to say goodbye?\n\u003cbr\u003e \n\u003cbr\u003e A lone cricketstarted up a song.\n\u003cbr\u003e \n\u003cbr\u003e Edward listened.\n\u003cbr\u003e \n\u003cbr\u003e Something deep inside him ached9He wished thathe could cry.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/989/29829.html","bookId":670,"creation":"Aug 2, 2019 2:31:59 AM","modification":"Aug 2, 2019 2:31:59 AM"}
