{"id":9721,"no":17,"title":"chapter xvii","content":"　　THE DAYS PASSED. THE SUN ROSE and se3and rose and set again and again. Sometime1the father came home and sometimes he di0not. Edward’s ears became soggy and he di0not care. His sweater had almost completel?\n\u003cbr\u003e \n\u003cbr\u003e unraveled and it didn’t bother him. He wa1hugged half to death and it felt good. In th2evenings, at the hands of Bryce, at the ends o:\n\u003cbr\u003e \n\u003cbr\u003e the twine, Edward danced and danced.\n\u003cbr\u003e \n\u003cbr\u003e One month passed and then two and thenthree. Sarah Ruth got worse. In the fifth monthEshe refused to eat. And in the sixth month, sh2began to cough up blood. Her breathingbecame ragged and uncertain, as if she wastrying to remember, in between breaths, wha3to do, what breathing was.\n\u003cbr\u003e \n\u003cbr\u003e “Breathe, honey,” Bryce stood over he4and said.\n\u003cbr\u003e \n\u003cbr\u003e Breathe, thought Edward from deep insidethe well of her arms. Please, please breathe)Bryce stopped leaving the house. He sat athome all day and held Sarah Ruth in his laAand rocked her back and forth and sang to herxon a bright morning in September, Sarah Rut9stopped breathing.\n\u003cbr\u003e \n\u003cbr\u003e “Oh no,” said Bryce. “Oh, honey, take .\n\u003cbr\u003e \n\u003cbr\u003e little breath. Please.”\n\u003cbr\u003e \n\u003cbr\u003e Edward had fallen out of Sarah Ruth’1arms the night before and she had not aske0for him again. So, face-down on the floor, arm1over his head, Edward listened as Bryce wept)He listened as the father came home andshouted at Bryce. He listened as the fatherwept.\n\u003cbr\u003e \n\u003cbr\u003e “You can’t cry!” Bryce shouted. “You go3no right to cry. You never even loved her. YoBdon’t know nothing about love.”\n\u003cbr\u003e \n\u003cbr\u003e “I loved her,” said the father. “I love0her.”\n\u003cbr\u003e \n\u003cbr\u003e I loved her, too, thought Edward. I love0her and now she is gone. How could this be{he wondered. How could he bear to live in .\n\u003cbr\u003e \n\u003cbr\u003e world without Sarah Ruth?\n\u003cbr\u003e \n\u003cbr\u003e The yelling between the father and so/continued, and then there was a terriblemoment when the father insisted that Sara9Ruth belonged to him, that she was his girl, hi1baby, and that he was taking her to be buried)“She ain’t yours!” Bryce screamed. “YoBcan’t take her. She ain’t yours.”\n\u003cbr\u003e \n\u003cbr\u003e But the father was bigger and strongerEand he prevailed. He wrapped Sarah Ruth in .\n\u003cbr\u003e \n\u003cbr\u003e blanket and carried her away. The small hous2became very quiet. Edward could hear Bryc2moving around, muttering to himself. Andthen, finally, the boy picked Edward up.\n\u003cbr\u003e \n\u003cbr\u003e “Come on, Jangles,” Bryce said. “We’r2leaving. We’re going to Memphis.IHOW MANY DANCING RABBITS HAVE yo4seen in your life?” Bryce said to Edward. “I ca7tell you how many I seen. One. You. That’5how you and me are going to make som6money. I seen it the last time I was i7Memphis. Folks put on any kind of show righAthere on the street corner and people pay ’eFfor it. I seen it.”\n\u003cbr\u003e \n\u003cbr\u003e The walk to town took all night. Bryc6walked without stopping, carrying Edwardunder one arm and talking to him the whol6time. Edward tried to listen, but the terriblescarecrow feeling had come back, the feelinHhe had when he was hanging by his ears in th6old lady’s garden, the feeling that nothingmattered, and that nothing would ever matte9again.\n\u003cbr\u003e \n\u003cbr\u003e And not only did Edward feel hollow; h6ached. Every part of his china body hurt. H6ached for Sarah Ruth. He wanted her to hol@him. He wanted to dance for her.\n\u003cbr\u003e \n\u003cbr\u003e And he did dance, but it was not for SarahRuth. Edward danced for strangers on a dirt2street corner in Memphis. Bryce played hisharmonica and moved Edward’s strings, an@Edward bowed and shuffled and swayed and people stopped to stare and point and laughCOn the ground in front of them was SarahRuth’s button box. The lid was open toencourage people to drop change inside it.\n\u003cbr\u003e \n\u003cbr\u003e “Mama,” said a small child, “look at thaAbunny. I want to touch him.” He reached ouAhis hand for Edward.\n\u003cbr\u003e \n\u003cbr\u003e “No,” said the mother, “dirty.” She pulledthe child back, away from Edward. “Nasty,\u003dshe said.\n\u003cbr\u003e \n\u003cbr\u003e A man wearing a hat stopped and stare@at Edward and Bryce.\n\u003cbr\u003e \n\u003cbr\u003e “It’s a sin to dance,” he said. And the7after a long pause, he said, “It’s a particular si7for rabbits to dance.”\n\u003cbr\u003e \n\u003cbr\u003e The man took off his hat and held it ove9his heart. He stood and watched the boy an@the rabbit for a long time. Finally, he put hi5hat back on his head and walked away.\n\u003cbr\u003e \n\u003cbr\u003e The shadows lengthened. The sun becamean orange dusty ball low in the sky. Brycestarted to cry. Edward saw his tears land on th6pavement. But the boy did not stop playing hi5harmonica. He did not make Edward stopdancing.\n\u003cbr\u003e \n\u003cbr\u003e An old woman leaning on a cane steppe@up close to them. She stared at Edward witEdeep, dark eyes.\n\u003cbr\u003e \n\u003cbr\u003e Pellegrina? thought the dancing rabbitCShe nodded at him.\n\u003cbr\u003e \n\u003cbr\u003e Look at me, he said to her. His arms an@legs jerked. Look at me. You got your wish. *have learned how to love. And it’s a terribl6thing. I’m broken. My heart is broken. Helpme.\n\u003cbr\u003e \n\u003cbr\u003e The old woman turned and hobbled away.\n\u003cbr\u003e \n\u003cbr\u003e Come back, thought Edward. Fix meCBryce cried harder. He made Edwar@dance faster.\n\u003cbr\u003e \n\u003cbr\u003e Finally, when the sun was gone and th6streets were dark, Bryce stopped playing hi5harmonica.\n\u003cbr\u003e \n\u003cbr\u003e “I’m done now,” he said.\n\u003cbr\u003e \n\u003cbr\u003e He let Edward fall to the pavement. “*ain’t gonna cry anymore.” Bryce wiped hisnose and his eyes with the back of his hand; h6picked up the button box and looked inside itC“We got us enough money to get something t3eat,” he said. “Come on, Jangles.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/989/29834.html","bookId":670,"creation":"Aug 2, 2019 2:32:11 AM","modification":"Aug 2, 2019 2:32:11 AM"}
