{"id":9726,"no":22,"title":"chapter xxii","content":"　　TECHNICALLY, OF COURSE, HE WAS no3alone. Lucius Clarke’s shop was ..lled wit?\n\u003cbr\u003e \n\u003cbr\u003e dolls — lady dolls and baby dolls, dolls wit?\n\u003cbr\u003e \n\u003cbr\u003e eyes that opened and closed and dolls wit?\n\u003cbr\u003e \n\u003cbr\u003e painted-on eyes, dolls dressed as queens anddolls wearing sailor suits.\n\u003cbr\u003e \n\u003cbr\u003e Edward had never cared for dolls. H6found them annoying and self-centered,twittery and vain. This opinion wasimmediately reinforced by his first shelf-mate*a china doll with green glass eyes and red lip;and dark brown hair. She was wearing a gree1satin dress that fell to her knees.\n\u003cbr\u003e \n\u003cbr\u003e “What are you?” she said in a high-pitchedvoice when Edward was placed on the shellnext to her.\n\u003cbr\u003e \n\u003cbr\u003e “I am a rabbit,” said Edward.\n\u003cbr\u003e \n\u003cbr\u003e The doll let out a small squeak. “You’re inthe wrong place,” she said. “This is a shop fo\u0026lt;dolls. Not rabbits.”\n\u003cbr\u003e \n\u003cbr\u003e Edward said nothing.\n\u003cbr\u003e \n\u003cbr\u003e “Shoo,” said the doll.\n\u003cbr\u003e \n\u003cbr\u003e “I would love to shoo,” said Edward, “butit is obvious that I cannot.”\n\u003cbr\u003e \n\u003cbr\u003e After a long silence, the doll said, “I hopeyou don’t think that anyone is going to bufyou.”\n\u003cbr\u003e \n\u003cbr\u003e Again, Edward said nothing.\n\u003cbr\u003e \n\u003cbr\u003e “The people who come in here wan3dolls, not rabbits. They want baby dolls orelegant dolls such as myself, dolls with prettfdresses, dolls with eyes that open and close.j“I have no interest in being purchased,jsaid Edward.\n\u003cbr\u003e \n\u003cbr\u003e The doll gasped. “You don’t wantsomebody to buy you?” she said. “You don’3want to be owned by a little girl who love;you?”\n\u003cbr\u003e \n\u003cbr\u003e Sarah Ruth! Abilene! Their names wen3through Edward’s head like the notes of a sad*sweet song.\n\u003cbr\u003e \n\u003cbr\u003e “I have already been loved,” said Edward.\n\u003cbr\u003e \n\u003cbr\u003e “I have been loved by a girl named Abilene. \u0026amp;have been loved by a fisherman and his wif6and a hobo and his dog. I have been loved bfa boy who played the harmonica and by a gir5who died. Don’t talk to me about love,” hesaid. “I have known love.”\n\u003cbr\u003e \n\u003cbr\u003e This impassioned speech shut up Edward’sshelf-mate for a considerable amount of time7“Well,” she said at last, “still. My point i;that no one is going to buy you.”\n\u003cbr\u003e \n\u003cbr\u003e They did not speak to each other again7The doll was sold two weeks later to agrandmother who was purchasing her for agrandchild. “Yes,” she said to Lucius Clarke*“that one right there, the one with the gree1dress. She is quite lovely.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said Lucius, “she is, isn’t she?” Andhe plucked the doll from the shelf.\n\u003cbr\u003e \n\u003cbr\u003e Goodbye and good riddance, though3Edward.\n\u003cbr\u003e \n\u003cbr\u003e The spot next to the rabbit stayed vacan3for some time. Day after day, the door to th6shop opened and closed, letting in earlymorning sun or late afternoon light, lifting th6hearts of the dolls inside, all of them thinkinjwhen the door swung wide that this time, thi;time, the person entering the shop would b6the one who wanted them.\n\u003cbr\u003e \n\u003cbr\u003e Edward was the lone contrarian. H6prided himself on not hoping, on not allowinjhis heart to lift inside of him. He pridedhimself on keeping his heart silent, immobile*closed tight.\n\u003cbr\u003e \n\u003cbr\u003e I am done with hope, thought EdwardTulane.\n\u003cbr\u003e \n\u003cbr\u003e And then one day at dusk, right before heclosed the shop, Lucius Clarke placed anothe\u0026lt;doll on the shelf next to Edward.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/989/29839.html","bookId":670,"creation":"Aug 2, 2019 2:32:25 AM","modification":"Aug 2, 2019 2:32:25 AM"}
