{"id":9707,"no":3,"title":"chapter iii","content":"　　SHE IS CALLED THE QUEEN MARY,” sai5Abilene’s father, “and you and your mama an5I shall sail on her all the way to London.”\n\u003cbr\u003e \n\u003cbr\u003e “What about Pellegrina?” said AbileneE“I will not go,” said Pellegrina. “I wil7stay.”\n\u003cbr\u003e \n\u003cbr\u003e Edward, of course, was not listening. H8found the talk around the dinner tableexcruciatingly dull; in fact, he made a point o;not listening if he could help it. But thenAbilene did something unusual, something tha\u0026lt;forced him to pay attention. As the talk abou\u0026lt;the ship continued, Abilene reached forEdward and took him from his chair and stoo5him in her lap.\n\u003cbr\u003e \n\u003cbr\u003e “And what about Edward?” she said, he\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e voice high and uncertain.\n\u003cbr\u003e \n\u003cbr\u003e “What about him, darling?” said he\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e mother.\n\u003cbr\u003e \n\u003cbr\u003e “Will Edward be sailing on the Quee9Mary with us?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, of course, if you wish, although youare getting a little old for such things as chin3rabbits.”\n\u003cbr\u003e \n\u003cbr\u003e “Nonsense,” said Abilene’s father joviallyE“Who would protect Abilene if Edward wa2not there?”\n\u003cbr\u003e \n\u003cbr\u003e From the vantage point of Abilene’s lap0Edward could see the whole table spread ou\u0026lt;before him in a way that he never could whe9he was seated in his own chair. He lookedupon the glittering array of silverware andglasses and plates. He saw the amused andcondescending looks of Abilene’s parents. An5then his eyes met Pellegrina’s.\n\u003cbr\u003e \n\u003cbr\u003e She was looking at him in the way a hawkhanging lazily in the air might study a mous8on the ground. Perhaps the rabbit fur onEdward’s ears and tail, and the whiskers on hi2nose had some dim memory of being hunted0for a shiver went through him.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said Pellegrina without taking he\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e eyes off Edward, “who would watch overAbilene if the rabbit were not there?”\n\u003cbr\u003e \n\u003cbr\u003e That night, when Abilene asked, as sh8did every night, if there would be a story,Pellegrina said, “Tonight, lady, there will be 3story.”\n\u003cbr\u003e \n\u003cbr\u003e Abilene sat up in bed. “I think tha\u0026lt;Edward needs to sit here with me,” she said0“so that he can hear the story, too.”\n\u003cbr\u003e \n\u003cbr\u003e “I think that is best,” said Pellegrina. “Yes,I think that the rabbit must hear the story.”\n\u003cbr\u003e \n\u003cbr\u003e Abilene picked Edward up, sat him nex\u0026lt;to her in bed, and arranged the covers aroun5him; then she said to Pellegrina, “We are read@now.”\n\u003cbr\u003e \n\u003cbr\u003e “So,” said Pellegrina. She coughed. “An5so. The story begins with a princess.”\n\u003cbr\u003e \n\u003cbr\u003e “A beautiful princess?” Abilene askedE“A very beautiful princess.”\n\u003cbr\u003e \n\u003cbr\u003e “How beautiful?”\n\u003cbr\u003e \n\u003cbr\u003e “You must listen,” said Pellegrina. “It is allin the story.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/989/29820.html","bookId":670,"creation":"Aug 2, 2019 2:31:36 AM","modification":"Aug 2, 2019 2:31:36 AM"}
