{"id":9712,"no":8,"title":"chapter viii","content":"　　ON LAND, THE OLD FISHERMAN stopped t1light a pipe, and then, with the pipe clenche4between his teeth, he walked home, carryin7Edward atop his left shoulder as if he were 9conquering hero. The ..sherman balanced hi?\n\u003cbr\u003e \n\u003cbr\u003e there, placing a callused hand at Edward’/back. He talked to him in a soft, low voice a/they walked.\n\u003cbr\u003e \n\u003cbr\u003e “You’ll like Nellie, you will,” said the ol4man. “She’s had her sadness, but she’s an allright girl.”\n\u003cbr\u003e \n\u003cbr\u003e Edward looked at the small townblanketed in dusk: a jumble of buildingshuddled together, the ocean stretching out i:\n\u003cbr\u003e \n\u003cbr\u003e front of it all; and he thought that he wouldlike anything and anybody that was not at th3bottom of the sea.\n\u003cbr\u003e \n\u003cbr\u003e “Hello, Lawrence,” called a woman fro?\n\u003cbr\u003e \n\u003cbr\u003e the front of a shop. “What have you got?”\n\u003cbr\u003e \n\u003cbr\u003e “Fresh catch,” said the fisherman, “fres8rabbit from the sea.” He lifted his cap to th3lady and kept walking.\n\u003cbr\u003e \n\u003cbr\u003e “There you are, o , said the fisherma E“There you are, now,” said the fishermanEHe took the pipe out of his mouth and pointe4with the stem of it at a star in the purplingsky. “There’s your North Star right there. Don’0never have to be lost when you know wher3that fellow is.”\n\u003cbr\u003e \n\u003cbr\u003e Edward considered the brightness of th3small star.\n\u003cbr\u003e \n\u003cbr\u003e Do they all have names? he wonderedE“Listen at me,” said the fisherman,“talking to a toy. Oh, well. Here we are, then.,And with Edward still on his shoulder, thefisherman walked up a stone-lined path an4into a little green house.\n\u003cbr\u003e \n\u003cbr\u003e “Look here, Nellie,” he said. “I’ve broughtyou something from the sea.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t want nothing from the sea,” camea voice.\n\u003cbr\u003e \n\u003cbr\u003e “Aw, now, don’t be like that, Nell. Com3and see, then.”\n\u003cbr\u003e \n\u003cbr\u003e An old woman stepped out of the kitchen,wiping her hands on an apron. When she sa;Edward, she dropped the apron and clappe4her hands together and said, “Oh, Lawrence\u0026amp;you brung me a rabbit.”\n\u003cbr\u003e \n\u003cbr\u003e “Direct from the sea,” said Lawrence. H3took Edward off his shoulder and stood hi?\n\u003cbr\u003e \n\u003cbr\u003e up on the floor and held on to his hands an4made him take a deep bow in the direction oBNellie.\n\u003cbr\u003e \n\u003cbr\u003e “Oh,” said Nellie, “here.” She clapped herhands together again and Lawrence passedEdward to her.\n\u003cbr\u003e \n\u003cbr\u003e Nellie held the rabbit out in front of he@and looked him over from tip to toe. Shesmiled. “Have you ever in your life seenanything so fine?” she said.\n\u003cbr\u003e \n\u003cbr\u003e Edward felt immediately that Nellie was avery discerning woman.\n\u003cbr\u003e \n\u003cbr\u003e “She’s beautiful,” breathed Nellie.\n\u003cbr\u003e \n\u003cbr\u003e For a moment, Edward was confused. Wasthere some other object of beauty in the room2“What will I call her?”\n\u003cbr\u003e \n\u003cbr\u003e “Susanna?” said Lawrence.\n\u003cbr\u003e \n\u003cbr\u003e “Just right,” said Nellie. “Susanna.” Sh3looked deep into Edward’s eyes. “First off,Susanna will need some clothes, won’t she?,AND SO EDWARD TULANE BECAM\u0026amp;Susanna. Nellie sewed several outfits for him: 1pink dress with ru..es for special occasions, 1simple shift fashioned out of a ..ower-covere8cloth for everyday use, and a long white gow2made of cotton for Edward to sleep in. I2addition, she remade his ears, stripping the?\n\u003cbr\u003e \n\u003cbr\u003e of the few pieces of fur that remained an8designing him a new pair.\n\u003cbr\u003e \n\u003cbr\u003e “Oh,”she told him when she was done\u0026amp;“you look lovely.\n\u003cbr\u003e \n\u003cbr\u003e He was horrified at first. He was, after all,a boy rabbit. He did not want to be dressed a0a girl. And the outfits, even the special-occasion dress, were so simple, so plain. TheQlacked the elegance and artistry of his realclothes. But then Edward remembered lying o2the ocean floor, the muck in his face, the star0so far away, and he said to himself, Whatdifference does it make really? Wearing a dres0won’t hurt me.\n\u003cbr\u003e \n\u003cbr\u003e Besides, life in the little green house withthe fisherman and his wife was sweet. Nelli4loved to bake, and so she spent her day in th4kitchen. She put Edward on the counter an8leaned him up against the flour canister an8arranged his dress around his knees. She ben\u0026lt;his ears so that he could hear well.\n\u003cbr\u003e \n\u003cbr\u003e And then she set to work, kneading doughfor bread and rolling out dough for cookie0and pies. The kitchen soon filled with thesmell of baking bread and with the sweetsmells of cinnamon and sugar and cloves. Th4windows steamed up. And while Nellieworked, she talked.\n\u003cbr\u003e \n\u003cbr\u003e She told Edward about her children, he:\n\u003cbr\u003e \n\u003cbr\u003e daughter, Lolly, who was a secretary, and he:\n\u003cbr\u003e \n\u003cbr\u003e boys: Ralph, who was in the army, andRaymond, who had died of pneumonia whe2he was only five years old.\n\u003cbr\u003e \n\u003cbr\u003e “He drowned inside of himself,”sai8Nellie. “It is a horrible, terrible thing, theworst thing, to watch somebody you love di4right in front of you and not be able to donothing about it. I dream about him mostnights.\n\u003cbr\u003e \n\u003cbr\u003e Nellie wiped at her tears with the back ofher hands. She smiled at Edward.\n\u003cbr\u003e \n\u003cbr\u003e “I suppose you think I’m daft, talking to atoy. But it seems to me that you are listening\u0026amp;Susanna.\n\u003cbr\u003e \n\u003cbr\u003e And Edward was surprised to discover thathe was listening. Before, when Abilene talke8to him, everything had seemed so boring, s;pointless. But now, the stories Nellie toldstruck him as the most important thing in th4world and he listened as if his life depende8on what she said. It made him wonder if som4of the muck from the ocean floor had gotte2inside his china head and damaged himsomehow.\n\u003cbr\u003e \n\u003cbr\u003e In the evening, Lawrence came home fromthe sea and there was dinner and Edward sat a\u0026lt;the table with the fisherman and his wife. H4sat in an old wooden highchair; and while a\u0026lt;first he was mortified (a highchair, after all,was a chair designed for babies, not for elegan\u0026lt;rabbits), he soon became used to it. He like8being up high, looking out over the tableinstead of staring at the tablecloth as he had a\u0026lt;the Tulane household. He liked feeling like 1part of things.\n\u003cbr\u003e \n\u003cbr\u003e Every night after dinner, Lawrence sai8that he thought he would go out and get som4fresh air and that maybe Susanna would like t;come with him. He placed Edward on hisshoulder as he had that first night when hewalked him through town, bringing him hom4to Nellie.\n\u003cbr\u003e \n\u003cbr\u003e They went outside and Lawrence lit hi0pipe and held Edward there on his shoulderpand if the night was clear, Lawrence said th4names of the constellations one at a time,Andromeda, Pegasus, pointing at them wit\u0026gt;\n\u003cbr\u003e \n\u003cbr\u003e the stem of his pipe. Edward loved looking uAat the stars, and he loved the sounds of theconstellation names. They were sweet in hi0ears.\n\u003cbr\u003e \n\u003cbr\u003e Sometimes, though, staring up at the nightsky, Edward remembered Pellegrina, saw agai2her dark and glowing eyes, and a chill woul8go through him.\n\u003cbr\u003e \n\u003cbr\u003e Warthogs, he would think. Witches3But Nellie, before she put him to bed eachnight, sang Edward a lullaby, a song about 1mockingbird that did not sing and a diamon8ring that would not shine, and the sound ofNellie’s voice soothed the rabbit and he forgo\u0026lt;about Pellegrina.\n\u003cbr\u003e \n\u003cbr\u003e Life, for a very long time, was sweet3And then Lawrence and Nellie’s daughte:\n\u003cbr\u003e \n\u003cbr\u003e came for a visit.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/989/29825.html","bookId":670,"creation":"Aug 2, 2019 2:31:50 AM","modification":"Aug 2, 2019 2:31:50 AM"}
