{"id":108234,"no":8,"title":"Page 8","content":"\u003cp\u003eI did not see much of Jasper\u0027s guests for the two sunny days that they were in Forks. I only went home at all so that Esme wouldn\u0027t worry. Otherwise, my existence seemed more like that of a specter than a vampire. I hovered, invisible in the shadows, where I could follow the object of my love and obsession - where I could see her and hear her in the minds of the lucky humans who could walk through the sunlight beside her, sometimes accidentally brushing the back of her hand with their own. She never reacted to such contact; their hands were just as warm as hers.\u003c/p\u003e\n\u003cp\u003eThe enforced absence from school had never been a trial like this before. But the sun seemed to make her happy, so I could not resent it too much. Anything that pleased her was in my good graces.\u003c/p\u003e\n\u003cp\u003eMonday morning, I eavesdropped on a conversation that had the potential to destroy my confidence and make the time spent away from her a torture. As it ended up, though, it rather made my day.\u003c/p\u003e\n\u003cp\u003eI had to feel some little respect for Mike Newton; he had not simply given up and slunk away to nurse his wounds. He had more bravery than I\u0027d given him credit for. He was going to try again.\u003c/p\u003e\n\u003cp\u003eBella got to school quite early and, seeming intent on enjoying the sun while it lasted, sat at one of the seldom used picnic benches while she waited for the first bell to ring. Her hair caught the sun in unexpected ways, giving off a reddish shine that I had not anticipated.\u003c/p\u003e\n\u003cp\u003eMike found her there, doodling again, and was thrilled at his good luck.\u003c/p\u003e\n\u003cp\u003eIt was agonizing to only be able to watch, powerless, bound to the forest\u0027s shadows by the bright sunlight.\u003c/p\u003e\n\u003cp\u003eShe greeted him with enough enthusiasm to make him ecstatic, and me the opposite.\u003c/p\u003e\n\u003cp\u003eSee, she likes me. She wouldn\u0027t smile like that if she didn\u0027t. I bet she wanted to go to the dance with me. Wonder what\u0027s so important in Seattle...\u003c/p\u003e\n\u003cp\u003eHe perceived the change in her hair. \"I never noticed before - your hair has red in it.\"\u003c/p\u003e\n\u003cp\u003eI accidentally uprooted the young spruce tree my hand was resting on when he pinched a strand of her hair between his fingers.\u003c/p\u003e\n\u003cp\u003e\"Only in the sun,\" she said. To my deep satisfaction, she cringed away from him slightly when he tucked the strand behind her ear.\u003c/p\u003e\n\u003cp\u003eIt took Mike a minute to build up his courage, wasting some time on small talk.\u003c/p\u003e\n\u003cp\u003eShe reminded him of the essay we all had due on Wednesday. From the faintly smug expression on her face, hers was already done. He\u0027d forgotten altogether, and that severely diminished his free time.\u003c/p\u003e\n\u003cp\u003eDang - stupid essay.\u003c/p\u003e\n\u003cp\u003eFinally he got to the point - my teeth were clenched so hard they could have pulverized granite - and even then, he couldn\u0027t make himself ask the question outright. \"I was going to ask if you wanted to go out.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said.\u003c/p\u003e\n\u003cp\u003eThere was a brief silence.\u003c/p\u003e\n\u003cp\u003eOh? What does that mean? Is she going to yes? Wait - I guess I didn\u0027t really ask.\u003c/p\u003e\n\u003cp\u003eHe swallowed hard.\u003c/p\u003e\n\u003cp\u003e\"Well, we could go to dinner or something...and I could work on it later.\" Stupid - that wasn\u0027t a question either.\u003c/p\u003e\n\u003cp\u003e\"Mike...\"\u003c/p\u003e\n\u003cp\u003eThe agony and fury of my jealousy was every whit as powerful as it had been last week. I broke another tree trying to hold myself here. I wanted so badly to race across the campus, too fast for human eyes, and snatch her up - to steal her away from the boy that I hated so much in this moment I could have kill him and enjoyed it.\u003c/p\u003e\n\u003cp\u003eWould she say yes to him?\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think that would be the best idea.\"\u003c/p\u003e\n\u003cp\u003eI breathed again. My rigid body relaxed.\u003c/p\u003e\n\u003cp\u003eSeattle was just an excuse, after all. Shouldn\u0027t have asked. What was I thinking? Bet it\u0027s that freak, Cullen...\u003c/p\u003e\n\u003cp\u003e\"Why?\" he asked sullenly.\u003c/p\u003e\n\u003cp\u003e\"I think...\" she hesitated. \"And if you ever repeat what I\u0027m saying right now I will cheerfully beat you to death - \"\u003c/p\u003e\n\u003cp\u003eI laughed out loud at the sound of a death threat coming through her lips. A jay shrieked, startled, and launched itself away from me.\u003c/p\u003e\n\u003cp\u003e\"But I think that would hurt Jessica\u0027s feelings.\"\u003c/p\u003e\n\u003cp\u003e\"Jessica?\" What? But... Oh. Okay. I guess... So... Huh.\u003c/p\u003e\n\u003cp\u003eHis thoughts were no longer coherent.\u003c/p\u003e\n\u003cp\u003e\"Really, Mike, are you blind?\"\u003c/p\u003e\n\u003cp\u003eI echoed her sentiment. She shouldn\u0027t expect everyone to be as perceptive as she was, but really this instance was beyond obvious. With as much trouble as Mike had had working himself up to ask Bella out, did he imagine it wasn\u0027t just as difficult for Jessica? It must be selfishness that made him blind to others. And Bella was so unselfish, she saw everything.\u003c/p\u003e\n\u003cp\u003eJessica. Huh. Wow. Huh. \"Oh,\" he managed to say.\u003c/p\u003e\n\u003cp\u003eBella used his confusion to make her exit.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time for class, and I can\u0027t be late again.\"\u003c/p\u003e\n\u003cp\u003eMike became an unreliable viewpoint from then on. He found, as he turned the idea of Jessica around and around in his head, that he rather liked the thought of her finding him attractive. It was second place, not as good as if Bella had felt that way. She\u0027s cute, though, I guess. Decent body. A bird in the hand...\u003c/p\u003e\n\u003cp\u003eHe was off then, on to new fantasies that were just as vulgar as the ones about Bella, but now they only irritated rather than infuriated. How little he deserved either girl; they were almost interchangeable to him. I stayed clear of his head after that. When she was out of sight, I curled up against the cool trunk of an enormous madrone tree and I danced from mind to mind, keeping her in sight, always glad when Angela Weber was available to look through. I wished there was someway to thank the Weber girl for simply being a nice person. It made me feel better to think that Bella had one friend worth having.\u003c/p\u003e\n\u003cp\u003eI watched Bella\u0027s face from whichever angle I was given, and I could see that she was sad again. This surprised me - I thought the sun would be enough to keep her smiling. At lunch, I saw her glance time and time again toward the empty Cullen table, and that thrilled me. It gave me hope. Perhaps she missed me, too.\u003c/p\u003e\n\u003cp\u003eShe had plans to go out with the other girls - I automatically planned my own surveillance - but these plans were postponed when Mike invited Jessica out on the date he\u0027d planned for Bella.\u003c/p\u003e\n\u003cp\u003eSo I went straight to her home instead, doing a quick sweep of the woods to make sure no one dangerous had wandered too close. I knew Jasper had warned his one-time brother to avoid the town - citing my insanity as both explanation and warning - but I wasn\u0027t taking any chances. Peter and Charlotte had no intention of causing animosity with my family, but intentions were changeable things...\u003c/p\u003e\n\u003cp\u003eAll right, I was overdoing it. I knew that.\u003c/p\u003e\n\u003cp\u003eAs if she knew I was watching, as if she took pity on the agony I felt when I couldn\u0027t see her, Bella came out to the backyard after a long hour indoors. She had a book in her hand and a blanket under her arm.\u003c/p\u003e\n\u003cp\u003eSilently, I climbed into the higher branches of the closest tree overlooking the yard.\u003c/p\u003e\n\u003cp\u003eShe spread the blanket on the damp grass and then lay on her stomach and started flipping through the worn book, as if trying to find her place. I read over her shoulder. Ah - more classics. She was an Austen fan.\u003c/p\u003e\n\u003cp\u003eShe read quickly, crossing and recrossing her ankles in the air. I was watching the sunlight and wind play in her hair when her body suddenly stiffened, and her hand froze on the page. All I saw was that she\u0027d reached chapter three when she roughly grabbed a thick section of pages and shoved them over.\u003c/p\u003e\n\u003cp\u003eI caught a glance of a title page, Mansfield Park. She was starting a new story - the book was a compilation of novels. I wondered why she\u0027d switched stories so abruptly.\u003c/p\u003e\n\u003cp\u003eJust a few moments later, she slammed the book angrily shut. With a fierce scowl on her face, she pushed the book aside and flipped over onto her back. She took a deep breath, as if to calm herself, pushed her sleeves up and closed her eyes. I remembered the novel, but I couldn\u0027t think of anything offensive in it to upset her. Another mystery. I sighed.\u003c/p\u003e\n\u003cp\u003eShe lay very still, moving just once to yank her hair away from her face. It fanned out over her head, a river of chestnut. And then she was motionless again. Her breathing slowed. After several long minutes her lips began to tremble.\u003c/p\u003e\n\u003cp\u003eMumbling in her sleep.\u003c/p\u003e\n\u003cp\u003eImpossible to resist. I listened as far out as I could, catching voices in the houses nearby.\u003c/p\u003e\n\u003cp\u003eTwo tablespoons of flour...one cup of milk...\u003c/p\u003e\n\u003cp\u003eC\u0027mon! Get it through the hoop! Aw, c\u0027mon!\u003c/p\u003e\n\u003cp\u003eRed, or blue...or maybe I should wear something more casual...\u003c/p\u003e\n\u003cp\u003eThere was no one close by. I jumped to the ground, landing silently on my toes.\u003c/p\u003e\n\u003cp\u003eThis was very wrong, very risky. How condescendingly I\u0027d once judged Emmett for his thoughtless ways and Jasper for his lack of discipline - and now I was consciously flouting all the rules with a wild abandon that made their lapses look like nothing at all. I used to be the responsible one.\u003c/p\u003e\n\u003cp\u003eI sighed, but crept out into the sunshine, regardless.\u003c/p\u003e\n\u003cp\u003eI avoided looking at myself in the sun\u0027s glare. It was bad enough that my skin was stone and inhuman in shadow; I didn\u0027t want to look at Bella and myself side by side in the sunlight. The difference between us was already insurmountable, painful enough without this image also in my head.\u003c/p\u003e\n\u003cp\u003eBut I couldn\u0027t ignore the rainbow sparkles that reflected onto her skin when I got closer. My jaw locked at the sight. Could I be any more of a freak? I imagined her terror if she opened her eyes now...\u003c/p\u003e\n\u003cp\u003eI started to retreat, but she mumbled again, holding me there.\u003c/p\u003e\n\u003cp\u003e\"Mmm... Mmm.\" Nothing intelligible. Well, I would wait for a bit.\u003c/p\u003e\n\u003cp\u003eI carefully stole her book, stretching my arm out and holding my breath while I was close, just in case. I started breathing again when I was a few yards away, tasting the way the sunshine and open air affected her scent. The heat seemed to sweeten the smell. My throat flamed with desire, the fire fresh and fierce again because I had been away from her for too long.\u003c/p\u003e\n\u003cp\u003eI spent a moment controlling that, and then - forcing myself to breathe through my nose - I let her book fall open in my hands. She\u0027d started with the first book... I flipped through the pages quickly to the third chapter of Sense and Sensibility, searching for something potentially offensive in Austen\u0027s overly polite prose.\u003c/p\u003e\n\u003cp\u003eWhen my eyes stopped automatically at my name - the character Edward Ferrars being introduced for the first time - Bella spoke again.\u003c/p\u003e\n\u003cp\u003e\"Mmm. Edward.\" She sighed.\u003c/p\u003e\n\u003cp\u003eThis time I did not fear that she had awoken. Her voice was just a low, wistful murmur. Not the scream of fear it would have been if she\u0027d seen me now.\u003c/p\u003e\n\u003cp\u003eJoy warred with self-loathing. She was still dreaming of me, at least.\u003c/p\u003e\n\u003cp\u003e\"Edmund. Ahh. Too....close...\"\u003c/p\u003e\n\u003cp\u003eEdmund?\u003c/p\u003e\n\u003cp\u003eHa! She wasn\u0027t dreaming of me at all, I realized blackly. The self-loathing returned in force. She was dreaming of fictional characters. So much for my conceit. I replaced her book, and stole back into the cover of the shadows - where I belonged.\u003c/p\u003e\n\u003cp\u003eThe afternoon passed and I watched, feeling helpless again, as the sun slowly sank in the sky and the shadows crawled across the lawn toward her. I wanted to push them back, but the darkness was inevitable; the shadows took her. When the light was gone, her skin looked too pale - ghostly. Her hair was dark again, almost black against her face.\u003c/p\u003e\n\u003cp\u003eIt was a frightening thing to watch - like witnessing Alice\u0027s visions come to fruition. Bella\u0027s steady, strong heartbeat was the only reassurance, the sound that kept this moment from feeling like a nightmare.\u003c/p\u003e\n\u003cp\u003eI was relieved when her father arrived home.\u003c/p\u003e\n\u003cp\u003eI could hear little from him as he drove down the street toward the house. Some vague annoyance...in the past, something from his day at work. Expectation mixed with hunger - I guessed that he was looking forward to dinner. But his thoughts were so quiet and contained that I could not be sure I was right; I only got the gist of them.\u003c/p\u003e\n\u003cp\u003eI wondered what her mother sounded like - what the genetic combination had been that had formed her so uniquely.\u003c/p\u003e\n\u003cp\u003eBella started awake, jerking up to a sitting position when the tires of her father\u0027s car hit the brick driveway. She stared around herself, seeming confused by the unexpected darkness. For one brief moment, her eyes touched the shadows where I hid, but they flickered quickly away.\u003c/p\u003e\n\u003cp\u003e\"Charlie?\" she asked in a low voice, still peering into the trees surrounding the small yard.\u003c/p\u003e\n\u003cp\u003eThe door of his car slammed shut, and she looked to the sound. She got to her feet quickly and gathered her things, casting one more look back toward the woods. I moved into a tree closer to the back window near the small kitchen, and listened to their evening. It was interesting to compare Charlie\u0027s words to his muffled thoughts. His love and concern for his only daughter were nearly overwhelming, and yet his words were always terse and casual. Most of the time, they sat in companionable silence.\u003c/p\u003e\n\u003cp\u003eI heard her discuss her plans for the following evening in Port Angeles, and I refined my own plans as I listened. Jasper had not warned Peter and Charlotte to stay clear of Port Angeles. Though I knew that they had fed recently and had no intention of hunting any where in the vicinity of our home, I would watch her, just in case. After all, there were always others of my kind out there. And then, all those human dangers that I had never much considered before now.\u003c/p\u003e\n\u003cp\u003eI heard her worry aloud about leaving her father to prepare dinner alone, and smiled at this proof to my theory - yes, she was a care-taker.\u003c/p\u003e\n\u003cp\u003eAnd then I left, knowing I would return when she was asleep.\u003c/p\u003e\n\u003cp\u003eI would not trespass on her privacy the way the peeping tom would have. I was here for her protection, not to leer at her in the way Mike Newton no doubt would, were he agile enough to move through the treetops the way I could. I would not treat her so crassly.\u003c/p\u003e\n\u003cp\u003eMy house was empty when I returned, which was fine by me. I didn\u0027t miss the confused or disparaging thoughts, questioning my sanity. Emmett had left a note stuck to the newel post.\u003c/p\u003e\n\u003cp\u003eFootball at the Rainier field - c\u0027mon! Please?\u003c/p\u003e\n\u003cp\u003eI found a pen and scrawled the word sorry beneath his plea. The teams were even without me, in any case.\u003c/p\u003e\n\u003cp\u003eI went for the shortest of hunting trips, contenting myself with the smaller, gentler creatures that did not taste as good as the hunters, and then changed into fresh clothes before I ran back to Forks.\u003c/p\u003e\n\u003cp\u003eBella did not sleep as well tonight. She thrashed in her blankets, her face sometimes worried, sometimes sad. I wondered what nightmare haunted her...and then realized that perhaps I really didn\u0027t want to know.\u003c/p\u003e\n\u003cp\u003eWhen she spoke, she mostly muttered derogatory things about Forks in a glum voice. Only once, when she sighed out the words \"Come back\" and her hand twitched open - a wordless plea - did I have a chance to hope she might be dreaming of me. The next day of school, the last day the sun would hold me prisoner, was much the same as the day before. Bella seemed even gloomier than yesterday, and I wondered if she would bow out of her plans - she didn\u0027t seem in the mood.\u003c/p\u003e\n\u003cp\u003eBut, being Bella, she would probably put her friends\u0027 enjoyment above that of her own.\u003c/p\u003e\n\u003cp\u003eShe wore a deep blue blouse today, and the color set her skin off perfectly, making it look like fresh cream.\u003c/p\u003e\n\u003cp\u003eSchool ended, and Jessica agreed to pick the other girls up - Angela was going, too, for which I was grateful.\u003c/p\u003e\n\u003cp\u003eI went home to get my car. When I found that Peter and Charlotte were there, I decided could afford to give the girls an hour or so for a head start. I would never be able to bear following behind them, driving at the speed limit - hideous thought.\u003c/p\u003e\n\u003cp\u003eI came in through the kitchen, nodding vaguely at Emmett\u0027s and Esme\u0027s greetings as I passed by everyone in the front room and went straight to the piano. Ugh, he\u0027s back. Rosalie, of course.\u003c/p\u003e\n\u003cp\u003eAh, Edward. I hate to see him suffering so. Esme\u0027s joy was becoming marred by concern. She should be concerned. This love story she envisioned for me was careening toward a tragedy more perceptibly every moment.\u003c/p\u003e\n\u003cp\u003eHave fun in Port Angeles tonight, Alice thought cheerfully. Let me know when I\u0027m allowed to talk to Bella.\u003c/p\u003e\n\u003cp\u003eYou\u0027re pathetic. I can\u0027t believe you missed the game last night just to watch somebody sleep, Emmett grumbled.\u003c/p\u003e\n\u003cp\u003eJasper paid me no mind, even when the song I played came out a little more stormily than I\u0027d intended. It was an old song, with a familiar theme: impatience. Jasper was saying goodbye to his friends, who eyed me curiously.\u003c/p\u003e\n\u003cp\u003eWhat a strange creature, the Alice-sized, white-blond Charlotte was thinking.\u003c/p\u003e\n\u003cp\u003eAnd he was so normal and pleasant the last time we met.\u003c/p\u003e\n\u003cp\u003ePeter\u0027s thoughts were in sync with hers, as was usually the case.\u003c/p\u003e\n\u003cp\u003eIt must be the animals. The lack of human blood drives them mad eventually, he was concluding. His hair was just as fair as hers, and almost as long. They were very similar - except for size, as he was almost as tall as Jasper - in both look and thought. A well matched pair, I\u0027d always thought.\u003c/p\u003e\n\u003cp\u003eEveryone but Esme stopped thinking about me after a moment, and I played in more subdued tones so that I would not attract notice.\u003c/p\u003e\n\u003cp\u003eI did not pay attention to them for a long while, just letting the music distract me from my unease. It was hard to have the girl out of sight and mind. I only returned my attention to their conversation when the goodbyes grew more final.\u003c/p\u003e\n\u003cp\u003e\"If you see Maria again,\" Jasper was saying, a little warily, \"tell her I wish her well.\"\u003c/p\u003e\n\u003cp\u003eMaria was the vampire who had created both Jasper and Peter - Jasper in the latter half of the nineteenth century, Peter more recently, in the nineteen forties. She\u0027d looked Jasper up once when we were in Calgary. It had been an eventful visit - we\u0027d had to move immediately. Jasper had politely asked her to keep her distance in the future.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t imagine that will happen soon,\" Peter said with a laugh - Maria was undeniable dangerous and there was not much love lost between her and Peter. Peter had, after all, been instrumental in Jasper\u0027s defection. Jasper had always been Maria\u0027s favorite; she considered it a minor detail that she had once planned to kill him. \"But, should it happen, I certainly will.\"\u003c/p\u003e\n\u003cp\u003eThey were shaking hands then, preparing to depart. I let the song I was playing trail off to an unsatisfying end, and got hastily to my feet.\u003c/p\u003e\n\u003cp\u003e\"Charlotte, Peter,\" I said, nodding.\u003c/p\u003e\n\u003cp\u003e\"It was nice to see you again, Edward,\" Charlotte said doubtfully. Peter just nodded in return.\u003c/p\u003e\n\u003cp\u003eMadman, Emmett threw after me.\u003c/p\u003e\n\u003cp\u003eIdiot, Rosalie thought at the same time.\u003c/p\u003e\n\u003cp\u003ePoor boy. Esme.\u003c/p\u003e\n\u003cp\u003eAnd Alice, in a chiding tone. They\u0027re going straight east, to Seattle. No where near Port Angeles. She showed me the proof in her visions.\u003c/p\u003e\n\u003cp\u003eI pretended I hadn\u0027t heard that. My excuses were already flimsy enough.\u003c/p\u003e\n\u003cp\u003eOnce in my car, I felt more relaxed; the robust purr of the engine Rosalie had boosted for me - last year, when she was in a better mood - was soothing. It was a relief to be in motion, to know that I was getting closer to Bella with every mile that flew away under my tires. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-twilight-saga-5-midnight-sun-twilight-2/page-8.html","bookId":2027,"creation":"Oct 5, 2019 11:18:00 PM","modification":"Oct 5, 2019 11:18:00 PM"}
