{"id":87562,"no":15,"title":"Page 15","content":"\u003cp\u003eI rest my head against the wall behind me and stare at him just like he’s staring at me. “You want to hear a naked truth?”\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003e“I’ve wanted to go back to your roof on more than one occasion since that night. But I was too scared you’d be there. You make me kind of nervous.”\u003c/p\u003e\n\u003cp\u003eHis fingers pause their strokes against my foot. “My turn?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003eHis eyes narrow as his hand moves to the underneath of my foot. He slowly traces his fingers from the tops of my toes, down to my heel. “I still very much want to fuck you.”\u003c/p\u003e\n\u003cp\u003eSomeone gasps, and it isn’t me.\u003c/p\u003e\n\u003cp\u003eRyle and I both look at the doorway and Allysa is standing there, wide-eyed. Her mouth is open as she points down at Ryle. “Did you just . . .” She looks at me and says, “I am so sorry about him, Lily.” And then she looks back at Ryle with venom in her eyes. “Did you just tell my boss you want to fuck her?”\u003c/p\u003e\n\u003cp\u003eOh, dear.\u003c/p\u003e\n\u003cp\u003eRyle pulls his bottom lip in and chews on it for a second. Marshall walks in behind Allysa and says, “What’s going on?”\u003c/p\u003e\n\u003cp\u003eAllysa looks at Marshall and points at Ryle again. “He just told Lily he wants to fuck her!”\u003c/p\u003e\n\u003cp\u003eMarshall looks from Ryle to me. I don’t know whether to laugh or crawl under the table and hide. “You did?” he says, looking back at Ryle.\u003c/p\u003e\n\u003cp\u003eRyle shrugs. “It appears that way,” he says.\u003c/p\u003e\n\u003cp\u003eAllysa puts her head in her hands, “Jesus Christ,” she says, looking at me. “He’s drunk. They’re both drunk. Please don’t judge me because my brother is an asshole.”\u003c/p\u003e\n\u003cp\u003eI smile at her and wave it off. “It’s fine, Allysa. Lots of people want to fuck me.” I glance back at Ryle and he’s still casually stroking my foot. “At least your brother speaks his mind. Not a lot of people have the courage to say what they’re actually thinking.”\u003c/p\u003e\n\u003cp\u003eRyle winks at me and then carefully moves my ankle off his lap. “Let’s see if you can put any weight on it,” he says.\u003c/p\u003e\n\u003cp\u003eHe and Marshall help me to my feet. Ryle points to a table a few feet away that’s pushed up against a wall. “Let’s try to make it to the table so I can wrap it.”\u003c/p\u003e\n\u003cp\u003eHis arm is secured around my waist, and he’s gripping my arm tightly to make sure I don’t fall. Marshall is more or less just standing next to me for support. I put a little weight on my ankle and it hurts, but it’s not excruciating. I’m able to hop all the way to the table with a lot of assistance from Ryle. He helps me pull myself up until I’m seated on top of it, leaning against the wall with my leg stretched out in front of me.\u003c/p\u003e\n\u003cp\u003e“Well, the good news is that it isn’t broken.”\u003c/p\u003e\n\u003cp\u003e“What’s the bad news?” I ask him.\u003c/p\u003e\n\u003cp\u003eHe opens the first aid kit and says, “You’ll need to stay off of it for a few days. Maybe even a week or more, depending on how it heals.”\u003c/p\u003e\n\u003cp\u003eI close my eyes and lean my head against the wall behind me. “But I have so much to do,” I whine.\u003c/p\u003e\n\u003cp\u003eHe carefully begins to wrap my ankle. Allysa is standing behind him, watching him wrap it.\u003c/p\u003e\n\u003cp\u003e“I’m thirsty,” Marshall says. “Anybody want something to drink? There’s a CVS across the street.”\u003c/p\u003e\n\u003cp\u003e“I’m good,” Ryle says.\u003c/p\u003e\n\u003cp\u003e“I’ll take a water,” I say.\u003c/p\u003e\n\u003cp\u003e“Sprite,” Allysa says.\u003c/p\u003e\n\u003cp\u003eMarshall grabs her hand. “You’re coming with.”\u003c/p\u003e\n\u003cp\u003eAllysa pulls her hand from his and crosses her arms over her chest. “I’m not going anywhere,” she says. “My brother can’t be trusted.”\u003c/p\u003e\n\u003cp\u003e“Allysa, it’s fine,” I tell her. “He was making a joke.”\u003c/p\u003e\n\u003cp\u003eShe stares at me silently for a moment, and then says, “Okay. But you can’t fire me if he pulls more stupid shit.”\u003c/p\u003e\n\u003cp\u003e“I promise I won’t fire you.”\u003c/p\u003e\n\u003cp\u003eWith that, she grabs Marshall’s hand again and leaves the room. Ryle is still wrapping my foot when he says, “My sister works for you?”\u003c/p\u003e\n\u003cp\u003e“Yep. Hired her a couple of hours ago.”\u003c/p\u003e\n\u003cp\u003eHe reaches into the first aid kit and pulls out tape. “You do realize she’s never had a job in her entire life?”\u003c/p\u003e\n\u003cp\u003e“She already warned me,” I say. His jaw is tight and he doesn’t look as relaxed as he did earlier. Then it hits me that he might think I hired her as a way to get closer to him. “I had no idea she was your sister until you walked in. I swear.”\u003c/p\u003e\n\u003cp\u003eHe glances at me, and then back down at my foot. “I wasn’t suggesting you knew.” He begins to tape over the ACE bandage.\u003c/p\u003e\n\u003cp\u003e“I know you weren’t. I just didn’t want you to think I was trying to trap you somehow. We want two different things from life, remember?”\u003c/p\u003e\n\u003cp\u003eHe nods, and carefully sets my foot back on the table. “That is correct,” he says. “I specialize in one-night stands and you’re on the quest for your Holy Grail.”\u003c/p\u003e\n\u003cp\u003eI laugh. “You have a good memory.”\u003c/p\u003e\n\u003cp\u003e“I do,” he says. A languid smile stretches across his mouth. “But you’re also hard to forget.”\u003c/p\u003e\n\u003cp\u003eJesus. He has to stop saying things like that. I press my palms into the table and pull my leg down. “Naked truth coming.”\u003c/p\u003e\n\u003cp\u003eHe leans against the table next to me and says, “All ears.”\u003c/p\u003e\n\u003cp\u003eI hold nothing back. “I’m very attracted to you,” I say. “There’s not much about you I don’t like. And being as though you and I both want different things, if we’re ever around each other again, I’d appreciate it if you could stop saying things that make me dizzy. It’s not really fair to me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-15.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
