{"id":87564,"no":17,"title":"Page 17","content":"\u003cp\u003eIt can’t be good, still holding on to so much bitterness toward my father. But dammit, he was awful. To my mother, to me, to Atlas.\u003c/p\u003e\n\u003cp\u003eAtlas.\u003c/p\u003e\n\u003cp\u003eI’ve been so busy with my mother’s move and secretly searching for a new building between work hours, I haven’t had time to finish reading the journals I started reading all those months ago.\u003c/p\u003e\n\u003cp\u003eI hop pathetically to my closet, only tripping once. Luckily, I catch myself on my dresser. Once I have the journal in hand, I hop back to the bed and get comfortable.\u003c/p\u003e\n\u003cp\u003eI have nothing better to do for the next week now that I can’t work. I might as well commiserate over my past while I’m forced to commiserate in the present.\u003c/p\u003e\n\u003cp\u003eDear Ellen,\u003c/p\u003e\n\u003cp\u003eYou hosting the Oscars was the greatest thing to happen to TV last year. I don’t think I ever told you that. The vacuuming skit made me piss my pants.\u003c/p\u003e\n\u003cp\u003eOh, and I recruited a new Ellen follower today in Atlas. Before you start judging me for allowing him inside my house again, let me explain how that came about.\u003c/p\u003e\n\u003cp\u003eAfter I let him take a shower here yesterday, I didn’t see him again last night. But this morning, he sat by me on the bus again. He seemed a little happier than the day before, because he slid into the seat and actually smiled at me.\u003c/p\u003e\n\u003cp\u003eI’m not gonna lie, it was a little weird seeing him in my dad’s clothes. But the pants fit him a lot better than I thought they were going to.\u003c/p\u003e\n\u003cp\u003e“Guess what?” he said. He leaned forward and unzipped his backpack.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe pulled out a bag and handed it to me. “I found these in the garage. I tried to clean them up for you because they were covered in old dirt, but I can’t do much without water.”\u003c/p\u003e\n\u003cp\u003eI held the bag and stared at him suspiciously. It’s the most I’d ever heard him say at once. I finally looked down at the bag and opened it. It looked like a bunch of old gardening tools.\u003c/p\u003e\n\u003cp\u003e“I saw you digging with that shovel the other day. I wasn’t sure if you had any actual gardening tools, and no one was using these, so . . .”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I said. I was kind of in shock. I used to have a trowel, but the plastic broke off the handle and it started giving me blisters. I asked my mother for gardening tools for my birthday last year and when she bought me a full-sized shovel and a hoe, I didn’t have the heart to tell her it’s not what I needed.\u003c/p\u003e\n\u003cp\u003eAtlas cleared his throat and then, in a much quieter voice, he said, “I know it’s not like a real gift. I didn’t buy it or anything. But . . . I wanted to give you something. You know . . . for . . .”\u003c/p\u003e\n\u003cp\u003eHe didn’t finish his sentence, so I nodded and tied the bag back up. “Do you think you can hold them for me until after school? I don’t have any room in my backpack.”\u003c/p\u003e\n\u003cp\u003eHe grabbed the bag from me and then brought his backpack up to his lap and put the bag inside of it. He wrapped his arms around his backpack. “How old are you?” he asked.\u003c/p\u003e\n\u003cp\u003e“Fifteen.”\u003c/p\u003e\n\u003cp\u003eThe look in his eyes made him seem a little bit sad about my age, but I don’t know why.\u003c/p\u003e\n\u003cp\u003e“You’re in tenth grade?”\u003c/p\u003e\n\u003cp\u003eI nodded, but honestly couldn’t think of anything to say to him. I haven’t really had much interaction with a lot of guys. Especially seniors. When I’m nervous, I kind of just clam up.\u003c/p\u003e\n\u003cp\u003e“I don’t know how long I’ll be staying at that place,” he said, bringing his voice down again. “But if you ever need help with gardening or anything after school, it’s not like I have much going on there. Being as though I have no electricity.”\u003c/p\u003e\n\u003cp\u003eI laughed, and then wondered if I should have laughed at his self-deprecating comment.\u003c/p\u003e\n\u003cp\u003eWe spent the rest of the bus ride talking about you, Ellen. When he made that comment about being bored, I asked him if he ever watched your show. He said he’d like to because he thinks you’re funny, but a TV would require electricity. Another comment I wasn’t sure if I should have laughed at.\u003c/p\u003e\n\u003cp\u003eI told him he could watch your show with me after school. I always record it on the DVR and watch it while I do my chores. I figured I could just keep the front door dead bolted, and if my parents got home early, I’d just have Atlas run out the back door.\u003c/p\u003e\n\u003cp\u003eI didn’t see him again until the ride home today. He didn’t sit by me this time because Katie got on the bus before him and sat next to me. I wanted to ask her to move, but then she’d think I had a crush on Atlas. Katie would have a field day with that one, so I just let her stay in my seat.\u003c/p\u003e\n\u003cp\u003eAtlas was at the front of the bus, so he got off before I did. He just kind of awkwardly stood there at the bus stop and waited for me to get off. When I did, he opened his backpack and handed me the bag of tools. He didn’t say anything about my invitation to watch TV from earlier this morning, so I just acted like it was a given.\u003c/p\u003e\n\u003cp\u003e“Come on,” I told him. He followed me inside and I locked the dead bolt. “If my parents come home early, run out the back door and don’t let them see you.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Don’t worry. I will,” he said, with kind of a laugh.\u003c/p\u003e\n\u003cp\u003eI asked him if he wanted anything to drink and he said sure. I made us a snack and brought our drinks to the living room. I sat down on the couch and he sat down in my dad’s chair. I turned on your show and that’s about all that happened. We didn’t talk much, because I fast-forwarded through all the commercials. But I did notice he laughed at all the right times. I think good comedic timing is one of the most important things about a person’s personality. Every time he laughed at your jokes, it made me feel better about sneaking him into my house. I don’t know why. Maybe because if he’s actually someone I could be friends with, it’d make me feel less guilty. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-17.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
