{"id":87550,"no":3,"title":"Page 3","content":"\u003cp\u003eHe squints as he looks in the direction I’m pointing. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“I live in the building next to it. It’s too short to see from here. It’s only three stories tall.”\u003c/p\u003e\n\u003cp\u003eHe’s facing me again, resting his elbow on the ledge. “If you live over there, why are you here? Your boyfriend live here or something?”\u003c/p\u003e\n\u003cp\u003eHis comment somehow makes me feel cheap. It was too easy—an amateurish pickup line. From the looks of this guy, I know he has better skills than that. It makes me think he saves the more difficult pickup lines for the women he deems worthy.\u003c/p\u003e\n\u003cp\u003e“You have a nice roof,” I tell him.\u003c/p\u003e\n\u003cp\u003eHe lifts an eyebrow, waiting for more of an explanation.\u003c/p\u003e\n\u003cp\u003e“I wanted fresh air. Somewhere to think. I pulled up Google Earth and found the closest apartment complex with a decent rooftop patio.”\u003c/p\u003e\n\u003cp\u003eHe regards me with a smile. “At least you’re economical,” he says. “That’s a good quality to have.”\u003c/p\u003e\n\u003cp\u003eAt least?\u003c/p\u003e\n\u003cp\u003eI nod, because I am economical. And it is a good quality to have.\u003c/p\u003e\n\u003cp\u003e“Why did you need fresh air?” he asks.\u003c/p\u003e\n\u003cp\u003eBecause I buried my father today and gave an epically disastrous eulogy and now I feel like I can’t breathe.\u003c/p\u003e\n\u003cp\u003eI face forward again and slowly exhale. “Can we just not talk for a little while?”\u003c/p\u003e\n\u003cp\u003eHe seems a bit relieved that I asked for silence. He leans over the ledge and lets an arm dangle as he stares down at the street. He stays like this for a while, and I stare at him the entire time. He probably knows I’m staring, but he doesn’t seem to care.\u003c/p\u003e\n\u003cp\u003e“A guy fell off this roof last month,” he says.\u003c/p\u003e\n\u003cp\u003eI would be annoyed at his lack of respect for my request for silence, but I’m kind of intrigued.\u003c/p\u003e\n\u003cp\u003e“Was it an accident?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “No one knows. It happened late in the evening. His wife said she was cooking dinner and he told her he was coming up here to take some pictures of the sunset. He was a photographer. They think he was leaning over the ledge to get a shot of the skyline, and he slipped.”\u003c/p\u003e\n\u003cp\u003eI look over the ledge, wondering how someone could possibly put themselves in a situation where they could fall by accident. But then I remember I was just straddling the ledge on the other side of the roof a few minutes ago.\u003c/p\u003e\n\u003cp\u003e“When my sister told me what happened, the only thing I could think about was whether or not he got the shot. I was hoping his camera didn’t fall with him, because that would have been a real waste, you know? To die because of your love of photography, but you didn’t even get the final shot that cost you your life?”\u003c/p\u003e\n\u003cp\u003eHis thought makes me laugh. Although I’m not sure I should have laughed at that. “Do you always say exactly what’s on your mind?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “Not to most people.”\u003c/p\u003e\n\u003cp\u003eThis makes me smile. I like that he doesn’t even know me, but for whatever reason, I’m not considered most people to him.\u003c/p\u003e\n\u003cp\u003eHe rests his back against the ledge and folds his arms over his chest. “Were you born here?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. Moved here from Maine after I graduated college.”\u003c/p\u003e\n\u003cp\u003eHe scrunches up his nose, and it’s kind of hot. Watching this guy—dressed in his Burberry shirt with his two-hundred-dollar haircut—making silly faces.\u003c/p\u003e\n\u003cp\u003e“So you’re in Boston purgatory, huh? That’s gotta suck.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” I ask him.\u003c/p\u003e\n\u003cp\u003eThe corner of his mouth curls up. “The tourists treat you like a local; the locals treat you like a tourist.”\u003c/p\u003e\n\u003cp\u003eI laugh. “Wow. That’s a very accurate description.”\u003c/p\u003e\n\u003cp\u003e“I’ve been here two months. I’m not even in purgatory yet, so you’re doing better than I am.”\u003c/p\u003e\n\u003cp\u003e“What brought you to Boston?”\u003c/p\u003e\n\u003cp\u003e“My residency. And my sister lives here.” He taps his foot and says, “Right beneath us, actually. Married a tech-savvy Bostonian and they bought the entire top floor.”\u003c/p\u003e\n\u003cp\u003eI look down. “The entire top floor?”\u003c/p\u003e\n\u003cp\u003eHe nods. “Lucky bastard works from home. Doesn’t even have to change out of his pajamas and makes seven figures a year.”\u003c/p\u003e\n\u003cp\u003eLucky bastard, indeed.\u003c/p\u003e\n\u003cp\u003e“What kind of residency? Are you a doctor?”\u003c/p\u003e\n\u003cp\u003eHe nods. “Neurosurgeon. Less than a year left of my residency and then it’s official.”\u003c/p\u003e\n\u003cp\u003eStylish, well spoken, and smart. And smokes pot. If this were an SAT question, I would ask which one didn’t belong. “Should doctors be smoking weed?”\u003c/p\u003e\n\u003cp\u003eHe smirks. “Probably not. But if we didn’t indulge on occasion, there would be a lot more of us taking the leap over these ledges, I can promise you that.” He’s facing forward again with his chin resting on his arms. His eyes are closed now, like he’s enjoying the wind against his face. He doesn’t look as intimidating like this.\u003c/p\u003e\n\u003cp\u003e“You want to know something that only the locals know?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he says, bringing his attention back to me.\u003c/p\u003e\n\u003cp\u003eI point to the east. “See that building? The one with the green roof?”\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003e“There’s a building behind it on Melcher. There’s a house on top of the building. Like a legit house, built right on the rooftop. You can’t see it from the street, and the building is so tall that not many people even know about it.”\u003c/p\u003e\n\u003cp\u003eHe looks impressed. “Really?”\u003c/p\u003e\n\u003cp\u003eI nod. “I saw it when I was searching Google Earth, so I looked it up. Apparently a permit was granted for the construction in 1982. How cool would that be? To live in a house on top of a building?” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-3.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
