{"id":87577,"no":31,"title":"Page 31","content":"\u003cp\u003eMy mom gave me a rag and told me to hold it to my head because it was bleeding and then she helped me to her car and drove me to the hospital. On the way there she only said one thing to me.\u003c/p\u003e\n\u003cp\u003e“When they ask you what happened, tell them you slipped on the ice.”\u003c/p\u003e\n\u003cp\u003eWhen she said that, I just looked out my window and started crying. Because I thought for sure this was the final straw. That she would leave him now that he had hurt me. That was the moment I realized that she’d never leave him. I felt so defeated, but I was too scared to say anything to her about it.\u003c/p\u003e\n\u003cp\u003eI had to get nine stitches in my forehead. I’m still not sure what I hit my head on, but it doesn’t really matter. The fact is, my father was the reason I was hurt and he didn’t even stay and check on me. He just left us both there on the floor of the garage and left.\u003c/p\u003e\n\u003cp\u003eI got home really late last night and fell right to sleep because they had given me some kind of pain pill.\u003c/p\u003e\n\u003cp\u003eThis morning when I walked to the bus, I tried not to look directly at Atlas so he wouldn’t see my forehead. I had fixed my hair so that you couldn’t really see it and he didn’t notice right away. When we sat down next to each other on the bus, our hands touched when we were putting our stuff on the floor.\u003c/p\u003e\n\u003cp\u003eHis hands were like ice, Ellen. Ice.\u003c/p\u003e\n\u003cp\u003eThat’s when I realized that I forgot to give him the blankets I had pulled out for him yesterday because my mother got home sooner than I expected. The incident in the garage sort of took over all my thoughts and I completely forgot about him. It had snowed and iced all night and he had been over there at that house in the dark all by himself. And now he was so cold, I didn’t know how he was even functioning.\u003c/p\u003e\n\u003cp\u003eI grabbed both of his hands in mine and said, “Atlas. You’re freezing.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything. I just started rubbing his hands in mine to warm them up. I laid my head on his shoulder and then I did the most embarrassing thing. I just started to cry. I don’t cry very much, but I was still so upset by what happened yesterday and then I was feeling so guilty that I forgot to take him blankets and it all hit me right there on the ride to school. He didn’t say anything. He just pulled his hands from mine so I’d stop rubbing them and then he laid his hands on top of mine. We just sat there like that the whole ride to school with our heads leaned together and his hands on top of mine.\u003c/p\u003e\n\u003cp\u003eI might have thought it was sweet if it wasn’t so sad. On the ride home from school is when he finally noticed my head.\u003c/p\u003e\n\u003cp\u003eHonestly, I had forgotten about it. No one at school even asked me about it and when he sat down next to me on the bus, I wasn’t even trying to hide it with my hair. He looked right at me and said, “What happened to your head?”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say to him. I just touched it with my fingers and then looked out the window. I’ve been trying to get him to trust me more in hopes he would tell me why he doesn’t have a place to live, so I didn’t want to lie to him. I just didn’t want to tell him the truth, either.\u003c/p\u003e\n\u003cp\u003eWhen the bus started moving, he said, “Yesterday after I left your house, I heard something going on over there. I heard yelling. I heard you scream, and then I saw your father leave. I was going to come check on you to make sure everything was okay, but as I was walking over I saw you leaving in the car with your mother.”\u003c/p\u003e\n\u003cp\u003eHe must have heard the fight in the garage and saw her leaving to take me to get the stitches. I couldn’t believe he came over to our house. Do you know what my dad would do to him if he saw him wearing his clothes? I got so worried for him because I don’t think he knows what my father is capable of.\u003c/p\u003e\n\u003cp\u003eI looked at him and said, “Atlas, you can’t do that! You can’t come to my house when my parents are home!”\u003c/p\u003e\n\u003cp\u003eAtlas got real quiet and then said, “I heard you scream, Lily.” He said it like me being in danger trumped anything else.\u003c/p\u003e\n\u003cp\u003eI felt bad because I know he was just trying to help, but that would have made things so much worse.\u003c/p\u003e\n\u003cp\u003e“I fell,” I said to him. As soon as I said it, I felt bad for lying. And to be honest, he looked a little disappointed in me, because I think we both knew in that moment that it wasn’t as simple as a fall.\u003c/p\u003e\n\u003cp\u003eThen he pulled up the sleeve of his shirt and held out his arm.\u003c/p\u003e\n\u003cp\u003eEllen, my stomach dropped. It was so bad. All over his arm he had these small scars. Some of the scars looked just like someone had stuck a cigarette to his arm and held it there.\u003c/p\u003e\n\u003cp\u003eHe twisted his arm around so I could see that it was on the other side, too. “I used to fall a lot, too, Lily.” Then he pulled his shirtsleeve down and didn’t say anything else.\u003c/p\u003e\n\u003cp\u003eFor a second I wanted to tell him it wasn’t like that—that my dad never hurts me and that he was just trying to get me off of him. But then I realized I’d be using the same excuses my mom uses.\u003c/p\u003e\n\u003cp\u003eI felt a little embarrassed that he knows what goes on at my house. I spent the whole rest of the bus ride looking out the window because I didn’t know what to say to him.\u003c/p\u003e\n\u003cp\u003eWhen we got home, my mom’s car was there. In the driveway, of course. Not the garage.\u003c/p\u003e\n\u003cp\u003eThat meant Atlas couldn’t come over and watch your show with me. I was gonna tell him I would bring him blankets later, but when he got off the bus he didn’t even tell me bye. He just started walking down the street like he was mad.\u003c/p\u003e\n\u003cp\u003eIt’s dark now and I’m waiting on my parents to go to sleep. But in a little while I’m gonna take him some blankets.\u003c/p\u003e\n\u003cp\u003e—Lily\u003c/p\u003e\n\u003cp\u003eDear Ellen,\u003c/p\u003e\n\u003cp\u003eI’m in way over my head.\u003c/p\u003e\n\u003cp\u003eDo you ever do things you know are wrong, but are somehow also right? I don’t know how to put it in simpler terms than that. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-31.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
