{"id":87581,"no":35,"title":"Page 35","content":"\u003cp\u003eConfusion crosses her face and she says, “Yeah. Why?”\u003c/p\u003e\n\u003cp\u003eI shrug. “I was just curious. I wouldn’t judge you or anything. I’ve just been thinking lately about how I might like to start a charity.”\u003c/p\u003e\n\u003cp\u003e“What kind of charity?” she asks. “We donate to a few different ones now that we have money, but my favorite is this one we got involved with last year. They build schools in other countries. We’ve funded three new constructions in the past year alone.”\u003c/p\u003e\n\u003cp\u003eI knew I liked her for a reason.\u003c/p\u003e\n\u003cp\u003e“I don’t have that kind of money, obviously, but I’d like to do something. I just don’t know what yet.”\u003c/p\u003e\n\u003cp\u003e“Let’s get through this grand opening first and then you can start thinking about philanthropy. One dream at a time, Lily.” She walks around the counter and grabs the trash can. I watch as she pulls the full bag out of it and ties it in a knot. It makes me wonder why—if she has people for everything—she would even want a job where she had to take out the trash and get her hands dirty.\u003c/p\u003e\n\u003cp\u003e“Why do you work here?” I ask her.\u003c/p\u003e\n\u003cp\u003eShe glances up at me and smiles. “Because I like you,” she says. But then I notice the smile completely leave her eyes right before she turns and walks toward the back to throw out the trash. When she comes back, I’m still watching her curiously. I say it again.\u003c/p\u003e\n\u003cp\u003e“Allysa? Why do you work here?”\u003c/p\u003e\n\u003cp\u003eShe stops what she’s doing and takes in a slow breath like maybe she’s contemplating being honest with me. She walks back to the counter and leans against it, crossing her feet at her ankles.\u003c/p\u003e\n\u003cp\u003e“Because,” she says, looking down at her feet. “I can’t get pregnant. We’ve been trying for two years but nothing has worked. I was tired of sitting at home crying all the time, so I decided I should find something to keep my mind busy.” She stands up straight and wipes her hands across her jeans. “And you, Lily Bloom, are keeping me very busy.” She turns and starts messing with the same bouquet of flowers again. She’s been perfecting them for half an hour. She picks up a card and stuffs it in the flowers, and then turns around and hands me the vase. “These are for you, by the way.”\u003c/p\u003e\n\u003cp\u003eIt’s obvious Allysa wants to change the subject, so I take the flowers from her. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and waves me off to my office. “It’s on the card. Go read it.”\u003c/p\u003e\n\u003cp\u003eI can tell by her annoyed reaction that they’re from Ryle. I grin and run to my office. I take a seat at my desk and pull out the card.\u003c/p\u003e\n\u003cp\u003eLily,\u003c/p\u003e\n\u003cp\u003eI’m having serious withdrawals.\u003c/p\u003e\n\u003cp\u003e—Ryle\u003c/p\u003e\n\u003cp\u003eI smile and put the card back in the envelope. I grab my phone and snap a picture of me holding the flowers with my tongue sticking out. I text it to Ryle.\u003c/p\u003e\n\u003cp\u003eMe: I tried to warn you.\u003c/p\u003e\n\u003cp\u003eHe immediately starts texting me back. I watch anxiously as the dots on my phone move back and forth.\u003c/p\u003e\n\u003cp\u003eRyle: I need my next fix. I’ll be finished here in about thirty minutes. Can I take you to dinner?\u003c/p\u003e\n\u003cp\u003eMe: Can’t. Mom wants me to try a new restaurant with her tonight. She’s an obnoxious foodie. : (\u003c/p\u003e\n\u003cp\u003eRyle: I like food. I eat food. Where are you taking her?\u003c/p\u003e\n\u003cp\u003eMe: A place called Bib’s on Marketson.\u003c/p\u003e\n\u003cp\u003eRyle: Is there room for one more?\u003c/p\u003e\n\u003cp\u003eI stare at his text for a moment. He wants to meet my mother? We aren’t even officially dating. I mean . . . I don’t care if he meets my mother. She would love him. But he went from not wanting anything to do with relationships, to possibly agreeing to test-drive one, to meeting the parents, all within five days? Good God. I really am a drug.\u003c/p\u003e\n\u003cp\u003eMe: Sure. Meet us there in half an hour.\u003c/p\u003e\n\u003cp\u003eI walk out of my office and straight up to Allysa. I hold my phone in front of her face. “He wants to meet my mother.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Ryle.”\u003c/p\u003e\n\u003cp\u003e“My brother?” she says, looking as shocked as I feel. I nod. “Your brother. My mother.”\u003c/p\u003e\n\u003cp\u003eShe grabs my phone and looks at the texts. “Huh. That’s so weird.”\u003c/p\u003e\n\u003cp\u003eI take my phone from her hands. “Thanks for the vote of confidence.”\u003c/p\u003e\n\u003cp\u003eShe laughs and says, “You know what I mean. It’s Ryle we’re talking about here. He’s never, in the history of being Ryle Kincaid, met a girl’s parents.”\u003c/p\u003e\n\u003cp\u003eOf course hearing her say that makes me smile, but then I wonder if maybe he’s doing this just to please me. If maybe he’s doing things he doesn’t really want to do just because he knows I want a relationship.\u003c/p\u003e\n\u003cp\u003eAnd then I smile even bigger, because isn’t that what it’s all about? Sacrificing for the person you like so that you can see them happy?\u003c/p\u003e\n\u003cp\u003e“Your brother must really like me,” I say teasingly. I look back up at Allysa, expecting her to laugh, but there’s a solemn look on her face.\u003c/p\u003e\n\u003cp\u003eShe nods and says, “Yeah. I’m afraid he does.” She grabs her purse from beneath the counter and says, “I’m gonna head out now. Let me know how it goes, okay?” She moves past me and I watch her as she makes her way out the door, and then I just stare at the door for a long time.\u003c/p\u003e\n\u003cp\u003eIt bothers me that she doesn’t seem excited about the prospect of me dating Ryle. It makes me wonder if that has more to do with her feelings toward me or her feelings toward him.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eTwenty minutes later, I flip the sign to closed. Just a few more days. I lock the door and walk to my car, but stop short when I see someone leaning against it. It takes me a moment to recognize him. He’s facing the other direction, talking on his cell phone. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-35.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
