{"id":87583,"no":37,"title":"Page 37","content":"\u003cp\u003eI shake my head and begin to stutter. “I’ll . . . um . . .” “Three waters,” my mother says, interrupting my fumbled words. The waiter snaps out of his trance long enough to tap his pencil on his pad of paper.\u003c/p\u003e\n\u003cp\u003e“Three waters,” he says. “Got it.” He turns and walks away, but I watch as he glances back at me before pushing through the doors to the kitchen.\u003c/p\u003e\n\u003cp\u003eMy mother leans forward and says, “What in the world is wrong with you?”\u003c/p\u003e\n\u003cp\u003eI point over my shoulder. “The waiter,” I say, shaking my head. “He looked exactly like . . .”\u003c/p\u003e\n\u003cp\u003eI’m about to say, “Atlas Corrigan,” when Ryle walks up and slides back into the seat.\u003c/p\u003e\n\u003cp\u003eHe glances back and forth between us. “What’d I miss?”\u003c/p\u003e\n\u003cp\u003eI swallow hard, shaking my head. Surely that wasn’t really Atlas. But those eyes—his mouth. I know it’s been years since I saw him, but I’ll never forget what he looked like. It had to be him. I know it was and I know he recognized me, too, because the second our eyes met . . . it looked like he’d seen a ghost.\u003c/p\u003e\n\u003cp\u003e“Lily?” Ryle says, squeezing my hand. “You okay?”\u003c/p\u003e\n\u003cp\u003eI nod and force a smile, then clear my throat. “Yep. We were just talking about you,” I say, glancing back at my mother. “Ryle assisted in an eighteen-hour surgery this week.”\u003c/p\u003e\n\u003cp\u003eMy mother leans forward with interest. Ryle begins to tell her all about the surgery. Our water arrives, but it’s a different waiter this time. He asks if we’ve had a chance to go over the menu and then tells us the chef ’s specials. The three of us order our food and I’m doing everything I can to focus, but my attention is all over the restaurant looking for Atlas. I need to regroup. After a few minutes, I lean over to Ryle. “I need to run to the restroom.”\u003c/p\u003e\n\u003cp\u003eHe stands up to let me out and my eyes are scanning the face of every waiter as I make my way across the room. I push through the door to the hallway that leads to the restrooms. As soon as I’m alone, my back meets the wall of the hallway. I lean forward and release a huge breath. I decide to take a moment and regain my composure before heading back out there. I bring my hands up to my forehead and close my eyes.\u003c/p\u003e\n\u003cp\u003eFor nine years I’ve wondered what happened to him. Years.\u003c/p\u003e\n\u003cp\u003e“Lily?”\u003c/p\u003e\n\u003cp\u003eI glance up and suck in a breath. He’s standing at the end of the hallway like a ghost straight out of the past. My eyes travel to his feet to make sure he’s not suspended in the air.\u003c/p\u003e\n\u003cp\u003eHe isn’t. He’s real, and he’s standing right in front of me.\u003c/p\u003e\n\u003cp\u003eI stay pressed against the wall, not sure what to say to him. “Atlas?”\u003c/p\u003e\n\u003cp\u003eAs soon as I say his name, he blows out a quick breath of relief and then takes three huge steps forward. I catch myself doing the same. We meet in the middle and throw our arms around each other. “Holy shit,” he says, holding me in a tight embrace.\u003c/p\u003e\n\u003cp\u003eI nod. “Yeah. Holy shit.”\u003c/p\u003e\n\u003cp\u003eHe puts his hands on my shoulders and takes a step back to look at me. “You haven’t changed at all.”\u003c/p\u003e\n\u003cp\u003eI cover my mouth with my hand, still in shock, and give him the once-over. His face looks the same, but he’s no longer the scrawny teenager I remember. “I can’t say the same for you.”\u003c/p\u003e\n\u003cp\u003eHe looks down at himself and laughs. “Yeah,” he says. “Eight years in the military will do that to ya.”\u003c/p\u003e\n\u003cp\u003eWe’re both in shock, so nothing is said right after that. We just keep shaking our heads in disbelief. He laughs and then I laugh. Finally, he releases my shoulders and folds his arms over his chest. “What brings you to Boston?” he asks.\u003c/p\u003e\n\u003cp\u003eHe says it so casually, and I’m thankful for that. Maybe he doesn’t remember our conversation all those years ago about Boston, which would save me a lot of embarrassment.\u003c/p\u003e\n\u003cp\u003e“I live here,” I say, forcing my answer to sound as casual as his question. “I own a flower shop over on Park Plaza.”\u003c/p\u003e\n\u003cp\u003eHe smiles knowingly, like it doesn’t at all surprise him. I glance toward the door, knowing I should get back out there. He notices and then takes another step back. He holds my gaze for a moment and it gets really quiet. Way too quiet. There’s so much to say but neither of us even knows where to start. The smile leaves his eyes for a moment and then he motions toward the door. “You should probably get back to your company,” he says. “I’ll look you up sometime. You said Park Plaza, right?”\u003c/p\u003e\n\u003cp\u003eI nod. He nods.\u003c/p\u003e\n\u003cp\u003eThe door swings open and a woman walks in holding a toddler. She moves between us, which puts even more distance between us. I take a step toward the door, but he remains in the same spot. Before I walk out, I turn back to him and smile. “It was really good to see you, Atlas.”\u003c/p\u003e\n\u003cp\u003eHe smiles a little, but it doesn’t touch his eyes. “Yeah. You too, Lily.”\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eI’m mostly quiet for the rest of the meal. I’m not sure Ryle or my mother even notice, though, because she’s having no issue firing question after question at him. He takes it like a champ. He’s very charming with my mother in all the right ways.\u003c/p\u003e\n\u003cp\u003eUnexpectedly running into Atlas tonight put such a wrinkle in my emotions, but by the end of dinner, Ryle has smoothed them back out again.\u003c/p\u003e\n\u003cp\u003eMy mother takes her napkin and wipes her mouth, then points at me. “New favorite restaurant,” she says. “Incredible.”\u003c/p\u003e\n\u003cp\u003eRyle nods. “I agree. I need to bring Allysa here. She loves trying new restaurants.”\u003c/p\u003e\n\u003cp\u003eThe food really is good, but the last thing I need is for either of these two to want to come back here. “It was okay,” I say. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-37.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
