{"id":87588,"no":42,"title":"Page 42","content":"\u003cp\u003eHe was about to kiss me on the mouth when we heard a car pull into the driveway and the garage door start to open. I jumped off the island, looking around the kitchen frantically. His hands went up to my cheeks and he made me look at him.\u003c/p\u003e\n\u003cp\u003e“Keep an eye on the cookies. They’ll be finished in about twenty minutes.” He pressed his lips to mine and then released me, rushing to the living room to grab his backpack. He made it out the back door right when I heard the engine to my father’s car shut off.\u003c/p\u003e\n\u003cp\u003eI started gathering all the ingredients together when my father walked into the kitchen from the garage. He looked around and then saw the light on in the oven.\u003c/p\u003e\n\u003cp\u003e“Are you cooking?” he asked.\u003c/p\u003e\n\u003cp\u003eI nodded because my heart was beating so fast, I was scared he’d hear the trembling in my voice if I responded out loud. I scrubbed for a moment at a spot on the counter that was perfectly clean. I cleared my throat and said, “Cookies. I’m baking cookies.”\u003c/p\u003e\n\u003cp\u003eHe set his briefcase down on the kitchen table and then walked to the refrigerator and pulled out a beer.\u003c/p\u003e\n\u003cp\u003e“The electricity has been out,” I said. “I was bored so I decided to bake while I waited for it to come back on.”\u003c/p\u003e\n\u003cp\u003eMy father sat down at the table and spent the next ten minutes asking me questions about school and if I’d thought about going to college. Occasionally when it was just the two of us, I saw glimpses of a how a normal relationship with a father could be. Sitting at the kitchen table with him discussing colleges and career choices and high school. As much as I hated him most of the time, I still longed for more of these moments with him. If he could just always be the guy he was capable of being in these moments, things would be so much different. For all of us.\u003c/p\u003e\n\u003cp\u003eI rotated the cookies like Atlas had said to do and when they were finished, I pulled them out of the oven. I took one off the cookie sheet and handed it to my father. I hated that I was being nice to him. It almost felt like I was wasting one of Atlas’s cookies.\u003c/p\u003e\n\u003cp\u003e“Wow,” my father said. “These are great, Lily.”\u003c/p\u003e\n\u003cp\u003eI forced a thank-you, even though I didn’t make them. I couldn’t very well tell him that, though.\u003c/p\u003e\n\u003cp\u003e“They’re for school so you can only have one,” I lied. I waited until the rest of them cooled and then I put them in a Tupperware container and took them to my room. I didn’t even want to try one without Atlas, so I waited until later last night when he came over.\u003c/p\u003e\n\u003cp\u003e“You should have tried one when they were hot,” he said. “That’s when they’re the best.”\u003c/p\u003e\n\u003cp\u003e“I didn’t want to eat them without you,” I said. We sat on the bed with our backs against the wall and proceeded to eat half the bowl of cookies. I told him they were delicious, but failed to tell him they were by far the greatest cookies I’d ever eaten. I didn’t want to inflate his ego. I kind of liked how humble he was.\u003c/p\u003e\n\u003cp\u003eI tried to grab at another one, but he pulled the bowl away and put the lid back on it. “If you eat too many you’ll make yourself sick and you won’t like my cookies anymore.”\u003c/p\u003e\n\u003cp\u003eI laughed. “Impossible.”\u003c/p\u003e\n\u003cp\u003eHe took a drink of water and then stood up, facing the bed. “I made you something,” he said, reaching into his pocket.\u003c/p\u003e\n\u003cp\u003e“More cookies?” I asked.\u003c/p\u003e\n\u003cp\u003eHe smiled and shook his head, then held out a fist. I lifted my hand and he dropped something hard in the palm of my hand. It was a small, flat outline of a heart, about two inches long, carved out of wood.\u003c/p\u003e\n\u003cp\u003eI rubbed my thumb over it, trying not to smile too big. It wasn’t an anatomically correct heart, but it also didn’t look like the hand-drawn hearts. It was uneven and hollow in the middle.\u003c/p\u003e\n\u003cp\u003e“You made this?” I asked, looking up at him.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I carved it with an old whittling knife I found at the house.”\u003c/p\u003e\n\u003cp\u003eThe ends of the heart weren’t connected. They just curved in a little, leaving a little space at the top of the heart. I didn’t even know what to say. I felt him sit back down on the bed but I couldn’t stop looking at it long enough to even thank him.\u003c/p\u003e\n\u003cp\u003e“I carved it out of a branch,” he said, whispering. “From the oak tree in your backyard.”\u003c/p\u003e\n\u003cp\u003eI swear, Ellen. I never thought I could love something so much. Or maybe what I was feeling wasn’t for the gift, but for him. I closed my fist around the heart and then leaned over and kissed him so hard, he fell back onto the bed. I threw my leg over him and straddled him and he grabbed my waist and grinned against my mouth.\u003c/p\u003e\n\u003cp\u003e“I’m gonna carve you a damn house out of that oak tree if this is the reward I get,” he whispered.\u003c/p\u003e\n\u003cp\u003eI laughed. “You have to stop being so perfect,” I told him. “You’re already my favorite person but now you’re making it really unfair to all the other humans because no one will ever be able to catch up to you.”\u003c/p\u003e\n\u003cp\u003eHe brought his hand to the back of my head and rolled me until I was on my back and he was the one on top. “Then my plan is working,” he said, right before kissing me again.\u003c/p\u003e\n\u003cp\u003eI held on to the heart while we kissed, wanting to believe it was a gift for no reason at all. But part of me was scared it was a gift to remember him by when he leaves for Boston.\u003c/p\u003e\n\u003cp\u003eI didn’t want to remember him. If I had to remember him, it would mean he wasn’t a part of my life anymore.\u003c/p\u003e\n\u003cp\u003eI don’t want him to move to Boston, Ellen. I know that’s selfish of me because he can’t keep living in that house. I don’t know what I’m more afraid might happen. Watching him leave or selfishly begging him not to go. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-42.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
