{"id":87589,"no":43,"title":"Page 43","content":"\u003cp\u003eI know we need to talk about it. I’ll ask him about Boston tonight when he comes over. I just didn’t want to ask him last night because it was a really perfect day.\u003c/p\u003e\n\u003cp\u003e—Lily\u003c/p\u003e\n\u003cp\u003eDear Ellen,\u003c/p\u003e\n\u003cp\u003eJust keep swimming. Just keep swimming.\u003c/p\u003e\n\u003cp\u003eHe’s moving to Boston.\u003c/p\u003e\n\u003cp\u003eI don’t really feel like talking about it.\u003c/p\u003e\n\u003cp\u003e—Lily\u003c/p\u003e\n\u003cp\u003eDear Ellen,\u003c/p\u003e\n\u003cp\u003eThis is going to be a big one for my mother to hide.\u003c/p\u003e\n\u003cp\u003eMy father is usually pretty cognizant of hitting her where it won’t leave a visible bruise. The last thing he probably wants is for people in the town to know what he does to her. I’ve seen him kick her a few times, choke her, hit her on the back and the stomach, pull her hair. The few times he’s hit her on the face, it’s always just been a slap, so the marks wouldn’t stay for long.\u003c/p\u003e\n\u003cp\u003eBut never have I seen him do what he did last night.\u003c/p\u003e\n\u003cp\u003eIt was really late when they got home. It was a weekend, so he and my mom went to some community function. My father has a real estate company and he’s also the town mayor, so they have to do things in the public a lot like go to charity dinners. Which is ironic, since my father hates charities. But I guess he has to save face.\u003c/p\u003e\n\u003cp\u003eAtlas was already in my room when they got home. I could hear them fighting as soon as they walked through the front door. A lot of the conversation was muffled, but for the most part, it sounded like my father was accusing her of flirting with some man.\u003c/p\u003e\n\u003cp\u003eNow I know my mother, Ellen. She would never do something like that. If anything, a guy probably looked at her and it made my father jealous. My mother is really beautiful.\u003c/p\u003e\n\u003cp\u003eI heard him call her a whore and then I heard the first blow. I started to climb out of my bed but Atlas pulled me back and told me not to go in there, that I might get hurt. I told him it actually helps sometimes. That when I go in there, my father backs off.\u003c/p\u003e\n\u003cp\u003eAtlas tried to talk me out of it, but finally I got up and went out into the living room.\u003c/p\u003e\n\u003cp\u003eEllen.\u003c/p\u003e\n\u003cp\u003eI just . . .\u003c/p\u003e\n\u003cp\u003eHe was on top of her.\u003c/p\u003e\n\u003cp\u003eThey were on the couch and he had his hand around her throat, but his other hand was pulling up her dress. She was trying to fight him off and I just stood there, frozen. She kept begging him to get off her and then he hit her right across the face and told her to shut up. I’ll never forget his words when he said, “You want attention? I’ll give you some fucking attention.” And that’s when she got real still and stopped fighting him. I heard her crying, and then she said, “Please be quiet. Lily is here.”\u003c/p\u003e\n\u003cp\u003eShe said, “Please be quiet.”\u003c/p\u003e\n\u003cp\u003ePlease be quiet while you rape me, dear.\u003c/p\u003e\n\u003cp\u003eEllen, I didn’t know one human was capable of feeling so much hate inside one heart. And I’m not even talking about my father. I’m talking about me.\u003c/p\u003e\n\u003cp\u003eI walked straight to the kitchen and I opened a drawer. I grabbed the biggest knife I could find and . . . I don’t know how to explain it. It was like I wasn’t even in my own body. I could see myself walking across the kitchen with the knife in my hand, and I knew I wasn’t going to use it. I just wanted something bigger than myself that could scare him away from her. But right before I made it out of the kitchen, two arms went around my waist and picked me up from behind. I dropped the knife, and my father didn’t hear it but my mother did. We locked eyes as Atlas carried me back to my bedroom. When we were back inside my room, I just started hitting him in the chest, trying to get back out there to her. I was crying and doing everything I could to get him out of my way, but he wouldn’t move.\u003c/p\u003e\n\u003cp\u003eHe just wrapped his arms around me and said, “Lily, calm down.” He kept saying it over and over, and he held me there for a long time until I accepted that he wasn’t gonna let me go back out there. He wasn’t gonna let me have that knife.\u003c/p\u003e\n\u003cp\u003eHe walked over to the bed and grabbed his jacket and started putting on his shoes. “We’ll go next door,” he said. “We’ll call the police.”\u003c/p\u003e\n\u003cp\u003eThe police.\u003c/p\u003e\n\u003cp\u003eMy mother had warned me not to call the police in the past. She said it could jeopardize my father’s career. But in all honesty, I didn’t care at that point. I didn’t care that he was the mayor or that everyone who loved him didn’t know the awful side of him. The only thing I cared about was helping my mother, so I pulled on my jacket and went to the closet for a pair of shoes. When I stepped out of my closet, Atlas was staring at my bedroom door.\u003c/p\u003e\n\u003cp\u003eIt was opening.\u003c/p\u003e\n\u003cp\u003eMy mother stepped inside and quickly shut it, locking it behind her. I’ll never forget what she looked like. She had blood coming down from her lip. Her eye was already starting to swell, and she had a clump of hair just resting on her shoulder. She looked at Atlas and then me.\u003c/p\u003e\n\u003cp\u003eI didn’t even take a moment to feel scared that she caught me in my room with a boy. I didn’t care about that. I was just worried about her. I walked over to her and grabbed her hands and walked her to my bed. I brushed the hair off her shoulder and then from her forehead.\u003c/p\u003e\n\u003cp\u003e“He’s gonna go call the police, Mom. Okay?”\u003c/p\u003e\n\u003cp\u003eHer eyes grew real wide and she started shaking her head. “No,” she said. She looked over at Atlas and said, “You can’t. No.”\u003c/p\u003e\n\u003cp\u003eHe was already at the window about to leave, so he stopped and looked at me.\u003c/p\u003e\n\u003cp\u003e“He’s drunk, Lily,” she said. “He heard your door shut, so he went to our bedroom. He stopped. If you call the police, it’ll just make it worse, believe me. Just let him sleep it off, it’ll be better tomorrow.”\u003c/p\u003e\n\u003cp\u003eI shook my head and could feel the tears stinging my eyes. “Mom, he was trying to rape you!” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-43.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
