{"id":87593,"no":47,"title":"Page 47","content":"\u003cp\u003eRyle is shaking his head. “Betrayed by my best friend.”\u003c/p\u003e\n\u003cp\u003eMarshall pulls Allysa to him. “I like her, you stupid fuck-face.”\u003c/p\u003e\n\u003cp\u003eI laugh, but Ryle turns to me with a serious look on his face. “I didn’t speak to him for an entire month, I was so mad. I eventually got over it. We were eighteen, she was seventeen. Wasn’t much I could do in the way of keeping them apart.”\u003c/p\u003e\n\u003cp\u003e“Wow,” I say. “I sometimes forget how close in age you two are.”\u003c/p\u003e\n\u003cp\u003eAllysa smiles and says, “Three kids in three years. I feel so sorry for my parents.”\u003c/p\u003e\n\u003cp\u003eThe table grows quiet. I see an apologetic look pass from Allysa to Ryle.\u003c/p\u003e\n\u003cp\u003e“Three?” I ask. “You have another sibling?”\u003c/p\u003e\n\u003cp\u003eRyle straightens up and takes a sip of his beer. He sets it back down on the table and says, “We had an older brother. He passed away when we were kids.”\u003c/p\u003e\n\u003cp\u003eSuch a great night, ruined by a simple question. Luckily, Marshall redirects the conversation like a pro.\u003c/p\u003e\n\u003cp\u003eI spend the rest of the evening listening to stories about them growing up. I’m not sure I’ve ever laughed as hard as I have tonight.\u003c/p\u003e\n\u003cp\u003eWhen the game is over, we all walk back to the shop to retrieve our cars. Ryle said he caught an Uber over earlier, so he’ll just ride with me. Before Allysa and Marshall leave, I tell her to hold on. I run inside the store and grab the steampunk flowers and run them back to their car. Her face lights up when I hand them to her.\u003c/p\u003e\n\u003cp\u003e“I’m happy you’re pregnant but that’s not why I’m giving you these flowers. I just want you to have them. Because you’re my best friend.”\u003c/p\u003e\n\u003cp\u003eAllysa squeezes me and whispers in my ear. “I hope he marries you someday. We’ll be even better sisters.”\u003c/p\u003e\n\u003cp\u003eShe climbs inside the car and they leave, and I just stand there watching them because I don’t know that I’ve ever had a friend like her in my whole life. Maybe it’s the wine. I don’t know, but I love today. Everything about it. I especially love how Ryle looks, leaning against my car, watching me.\u003c/p\u003e\n\u003cp\u003e“You’re really beautiful when you’re happy.”\u003c/p\u003e\n\u003cp\u003eUgh! This day! Perfect!\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eWe’re making our way up the stairs to my apartment when Ryle grabs my waist and pushes me against the wall. He just starts kissing me, right there in the stairwell.\u003c/p\u003e\n\u003cp\u003e“Impatient,” I mutter.\u003c/p\u003e\n\u003cp\u003eHe laughs and cups my ass with both of his hands. “Nope. It’s this onesie. You really should consider making this your business attire.” He kisses me again and doesn’t stop kissing me until someone passes us, heading down the stairs.\u003c/p\u003e\n\u003cp\u003eThe guy mumbles, “Nice onesies,” as he squeezes past us. “Did the Bruins win?”\u003c/p\u003e\n\u003cp\u003eRyle nods. “Three to one,” he responds, without looking up at the guy.\u003c/p\u003e\n\u003cp\u003e“Nice,” the guy says.\u003c/p\u003e\n\u003cp\u003eOnce he’s gone, I step away from Ryle. “What is this onesie thing? Does every male in Boston know about this?”\u003c/p\u003e\n\u003cp\u003eHe laughs and says, “Free beer, Lily. It’s free beer.” He pulls me up the stairs, and when we walk in the door, Lucy is standing at the kitchen table taping up a box of her stuff. There’s another box she hasn’t taped up yet and I could swear I see a bowl that I bought at HomeGoods sticking out of the top. She said she’d have all her stuff out by next week, but I have a feeling she’ll conveniently have some of my stuff out, too.\u003c/p\u003e\n\u003cp\u003e“Who are you?” she asks, looking Ryle up and down.\u003c/p\u003e\n\u003cp\u003e“Ryle Kincaid. I’m Lily’s boyfriend.”\u003c/p\u003e\n\u003cp\u003eLily’s boyfriend.\u003c/p\u003e\n\u003cp\u003eDid you hear that?\u003c/p\u003e\n\u003cp\u003eBoyfriend.\u003c/p\u003e\n\u003cp\u003eIt’s the first time he’s confirmed it, and he said it so confidently. “My boyfriend, huh?” I walk into the kitchen and grab a bottle of wine and two wineglasses.\u003c/p\u003e\n\u003cp\u003eRyle comes up behind me as I’m pouring the wine and snakes his arms around my waist. “Yep. Your boyfriend.”\u003c/p\u003e\n\u003cp\u003eI hand him a glass of wine and say, “So I’m a girlfriend?”\u003c/p\u003e\n\u003cp\u003eHe holds up his glass and clinks it against mine. “To the end of trial runs and the beginning of sure things.”\u003c/p\u003e\n\u003cp\u003eWe’re both smiling as we take a drink of our wine.\u003c/p\u003e\n\u003cp\u003eLucy stacks the boxes together and walks toward the front door. “Looks like I got out right in time,” she says.\u003c/p\u003e\n\u003cp\u003eThe door closes behind her and Ryle raises an eyebrow. “I don’t think your roommate likes me very much.”\u003c/p\u003e\n\u003cp\u003e“You’d be surprised. I didn’t think she liked me, either, but yesterday she asked me to be a bridesmaid in her wedding. I think she’s just hoping for free flowers, though. She’s very opportunistic.”\u003c/p\u003e\n\u003cp\u003eRyle laughs and leans against the refrigerator. His eyes fall to a magnet that says “Boston” on it. He pulls it off the refrigerator and raises an eyebrow. “You’ll never get out of Boston purgatory if you keep souvenirs of Boston on your fridge like a tourist.”\u003c/p\u003e\n\u003cp\u003eI laugh and grab the magnet, slapping it back on the fridge. I like that he remembers so much about the first night we met. “It was a gift. It only counts as touristy if I bought it myself.”\u003c/p\u003e\n\u003cp\u003eHe steps over to me and takes my glass of wine from my hands. He sets both of our glasses on the countertop, and then leans in and gives me a deep, passionate, drunken kiss. I can taste the tart fruitiness of the wine on his tongue and I like it. His hands go to the zipper on my onesie. “Let’s get you out of these clothes.”\u003c/p\u003e\n\u003cp\u003eHe pulls me toward the bedroom, kissing me while we both struggle out of our clothes. By the time we make it to my bedroom, I’m down to my bra and panties. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-47.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
