{"id":87594,"no":48,"title":"Page 48","content":"\u003cp\u003eHe shoves me against the door, and I gasp at the unexpectedness of it.\u003c/p\u003e\n\u003cp\u003e“Don’t move,” he says. He presses his lips to my chest, then begins to kiss me slowly as he makes his way down my body.\u003c/p\u003e\n\u003cp\u003eOh, Lord. Can this day seriously get any better?\u003c/p\u003e\n\u003cp\u003eI run my hands through his hair, but he grabs my wrists and presses them against the door. He climbs back up my body, squeezing my wrists tightly. He raises an eyebrow in warning. “I said . . . don’t move.”\u003c/p\u003e\n\u003cp\u003eI try not to smile, but it’s hard to disguise. He drags his mouth back down my body. He slowly lowers my panties to my ankles, but he told me not to move, so I don’t kick them off.\u003c/p\u003e\n\u003cp\u003eHis mouth slides up my thigh until . . .\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003eBest.\u003c/p\u003e\n\u003cp\u003eDay.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eRyle: Are you at home or still at work?\u003c/p\u003e\n\u003cp\u003eMe: Work. Should be done in about an hour.\u003c/p\u003e\n\u003cp\u003eRyle: Can I come see you?\u003c/p\u003e\n\u003cp\u003eMe: You know how people say there is no such thing as a stupid question? They’re wrong. That was a stupid question.\u003c/p\u003e\n\u003cp\u003eRyle: :)\u003c/p\u003e\n\u003cp\u003eHalf an hour later, he’s knocking at the front door of the floral shop. I closed the shop almost three hours ago, but I’m still here, trying to get caught up on the chaos that was the first month. The store is still too new to get an accurate projection of how well or how bad it’s doing. Some days are great and some are so slow I send Allysa home. But overall, I’m happy with how it’s gone so far.\u003c/p\u003e\n\u003cp\u003eAnd happy with how things are going with Ryle.\u003c/p\u003e\n\u003cp\u003eI unlock the door to let him in. He’s in light blue scrubs again, and he still has a stethoscope around his neck. Fresh from work. Very nice touch. I swear, every time I see him straight off a shift, I have to hide the stupid grin on my face. I give him a quick kiss and then turn back toward my office. “I have a few things to finish up and then we can go back to my place.”\u003c/p\u003e\n\u003cp\u003eHe follows me into my office and closes the door. “You got a couch?” he asks, looking around my office.\u003c/p\u003e\n\u003cp\u003eI’ve spent some of this week putting the finishing touches on it. I bought a couple of lamps so I don’t have to turn on the overpowering fluorescent lights. The lamps give the room a soft glow. I also bought a few plants to keep here permanently. It’s no garden, but it’s as close as it gets. It’s come a long way since this room was being used as storage for vegetable crates.\u003c/p\u003e\n\u003cp\u003eRyle walks over to the couch and falls down onto it, face-first. “Take your time,” he mumbles into the pillow. “I’ll just nap until you’re finished.”\u003c/p\u003e\n\u003cp\u003eI sometimes worry about how hard he pushes himself with work, but I don’t say anything. I’ve been sitting in my office going on twelve hours now, so I don’t have much room to talk when it comes to being too ambitious.\u003c/p\u003e\n\u003cp\u003eI spend the next fifteen or so minutes finalizing orders. When I’m finished, I close my laptop and look over at Ryle.\u003c/p\u003e\n\u003cp\u003eI thought he’d be asleep, but instead he’s on his side with his head propped up on his hand. He’s been watching me this whole time, and seeing the smile on his face makes me blush. I push my chair back and stand up.\u003c/p\u003e\n\u003cp\u003e“Lily, I think I like you too much,” he says as I make my way over to him.\u003c/p\u003e\n\u003cp\u003eI scrunch up my nose as he sits up on the couch and pulls me onto his lap. “Too much? That doesn’t sound like a compliment.”\u003c/p\u003e\n\u003cp\u003e“That’s because I don’t know if it is,” he says. He adjusts my legs on either side of him and then wraps his arms around my waist. “This is my first real relationship. I don’t know if I’m supposed to like you this much yet. I don’t want to scare you away.”\u003c/p\u003e\n\u003cp\u003eI laugh. “Like that could ever happen. You work way too much to smother me.”\u003c/p\u003e\n\u003cp\u003eHe rubs his hands up my back. “Does it bother you that I work too much?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. I worry about you sometimes because I don’t want you to burn yourself out. But I don’t mind that I have to share you with your passion. I actually really like how ambitious you are. It’s kind of sexy. It might even be my favorite thing about you.”\u003c/p\u003e\n\u003cp\u003e“You know what I like the most about you?”\u003c/p\u003e\n\u003cp\u003e“I already know this answer,” I say, smiling. “My mouth.”\u003c/p\u003e\n\u003cp\u003eHe leans his head back against the couch. “Oh yeah. That does come first. But do you know what my second favorite thing about you is?”\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“You don’t put pressure on me to be something I’m incapable of being. You accept me exactly how I am.”\u003c/p\u003e\n\u003cp\u003eI smile. “Well, in all fairness, you’re a little different from when I first met you. You aren’t so anti-girlfriend anymore.”\u003c/p\u003e\n\u003cp\u003e“That’s because you make it easy,” he says, sliding a hand inside the back of my shirt. “It’s easy being with you. I can still have the career I’ve always wanted, but you make it ten times better with the way you support me. When I’m with you, I feel like I get to have my cake and eat it, too.”\u003c/p\u003e\n\u003cp\u003eNow both of his hands are beneath my shirt, pressed against my back. He pulls me toward him and kisses me. I grin against his mouth and whisper, “Is it the best cake you’ve ever tasted?”\u003c/p\u003e\n\u003cp\u003eOne of his hands moves to the back of my bra and he unfastens it with ease. “I’m pretty sure, but maybe I need another taste of it to be positive.” He pulls my shirt and bra over my head. I begin to push myself off of him so I can pull off my jeans, but he pulls me back onto his lap. He grabs his stethoscope and puts it in his ears, then presses the diaphragm against my chest, right over my heart. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-48.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
