{"id":87596,"no":50,"title":"Page 50","content":"\u003cp\u003eHe laughs. “My mother? Well . . . my mother is very overbearing. Very judgmental, especially of the people she loves the most. She’s never missed a single church service. And I have never heard her refer to my father as anything other than Dr. Kincaid.”\u003c/p\u003e\n\u003cp\u003eDespite the warnings, he smiles the whole time he talks about her.\u003c/p\u003e\n\u003cp\u003e“Your father is a doctor, too?”\u003c/p\u003e\n\u003cp\u003eHe nods. “Psychiatrist. He chose a field that also allowed him to have a normal life. Smart man.”\u003c/p\u003e\n\u003cp\u003e“Do they ever visit you in Boston?”\u003c/p\u003e\n\u003cp\u003e“Not really. My mother hates flying, so Allysa and I fly to England a couple of times a year. She does want to meet you, though, so you might be going with us on the next trip.”\u003c/p\u003e\n\u003cp\u003eI grin. “You’ve told your mother about me?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he says. “This is kind of a monumental thing, you know. Me having a girlfriend. She calls me every day to make sure I haven’t screwed it up somehow.”\u003c/p\u003e\n\u003cp\u003eI laugh, which makes him reach for his phone. “You think I’m kidding? I guarantee she somehow brought you up in the voice mail she just left.” He presses a few keys and then begins to play the voice mail.\u003c/p\u003e\n\u003cp\u003e“Hey, sweetheart! It’s your mom. Haven’t spoken to you since yesterday. Miss you. Give Lily a hug for me. You do still see her, right? Allysa says you can’t stop talking about her. She is still your girlfriend, right? Okay. Gretchen’s here, we’re having high tea. Love you. Kiss kiss.”\u003c/p\u003e\n\u003cp\u003eI press my face against his chest and laugh. “We’ve only been dating a few months. How much do you talk about me?”\u003c/p\u003e\n\u003cp\u003eHe pulls my hand up between us and kisses it. “Too much, Lily. Way too much.”\u003c/p\u003e\n\u003cp\u003eI smile. “I can’t wait to meet them. Not only did they raise an incredible daughter, but they made you. That’s pretty impressive.”\u003c/p\u003e\n\u003cp\u003eHis arms tighten around me and he kisses the top of my head.\u003c/p\u003e\n\u003cp\u003e“What was your brother’s name?” I ask him.\u003c/p\u003e\n\u003cp\u003eI can feel a slight stiffness in him after I ask that. I regret bringing it up, but it’s too late to take it back.\u003c/p\u003e\n\u003cp\u003e“Emerson.”\u003c/p\u003e\n\u003cp\u003eI can tell by his voice that it’s not something he wants to talk about right now. Instead of pressing it further, I lift my head and scoot forward, pressing my mouth to his.\u003c/p\u003e\n\u003cp\u003eI should know better. Kisses can’t seem to stop at just kisses when it comes to me and Ryle. In a matter of minutes, he’s inside of me again, but this time it’s everything the other time wasn’t.\u003c/p\u003e\n\u003cp\u003eThis time we make love.\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eMy phone rings. I pick it up to see who it is and I’m a little taken aback. It’s the first time Ryle has ever called me. We always just text. How odd to have a boyfriend for over three months that I’ve never once spoken to on the phone.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Hey, girlfriend,” he says.\u003c/p\u003e\n\u003cp\u003eI smile cheesily at the sound of his voice. “Hey, boyfriend.”\u003c/p\u003e\n\u003cp\u003e“Guess what?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’m taking the day off tomorrow. Your floral shop doesn’t open until one o’clock on Sundays. I’m on my way to your apartment with two bottles of wine. You want to have a sleepover with your boyfriend and have drunken sex all night and sleep until noon?”\u003c/p\u003e\n\u003cp\u003eIt’s really embarrassing what his words do to me. I smile and say, “Guess what?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’m cooking you dinner. And I’m wearing an apron.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” he says.\u003c/p\u003e\n\u003cp\u003e“Just an apron.” And then I hang up.\u003c/p\u003e\n\u003cp\u003eA few seconds later, I get a text message.\u003c/p\u003e\n\u003cp\u003eRyle: Pic, please.\u003c/p\u003e\n\u003cp\u003eMe: Get over here and you can take the picture yourself.\u003c/p\u003e\n\u003cp\u003eI’m almost finished preparing the casserole mixture when the door opens. I pour it into the glass pan and don’t turn around when I hear him walk into the kitchen. When I said I was just wearing an apron, I meant it. I’m not even wearing panties.\u003c/p\u003e\n\u003cp\u003eI can hear him suck in a rush of air when I reach over to the oven and stick the casserole inside. I might reach a little too far for show when I do it. When I close the oven, I don’t face him. I grab a rag and start wiping down the oven, making sure to sway my hips as much as possible. I squeal when I feel a piercing sting on my right butt cheek. I spin around and Ryle is grinning, holding two bottles of wine.\u003c/p\u003e\n\u003cp\u003e“Did you just bite me?”\u003c/p\u003e\n\u003cp\u003eHe gives me an innocent look. “Don’t tempt the scorpion if you don’t want to get stung.” He eyes me up and down while he opens one of the bottles. He holds it up before he pours us a glass and says, “It’s vintage.”\u003c/p\u003e\n\u003cp\u003e“Vintage,” I say with mock impression. “What’s the special occasion?”\u003c/p\u003e\n\u003cp\u003eHe hands me a glass and says, “I’m going to be an uncle. I have a smoking hot girlfriend. And I get to perform a very rare, possibly once-in-a-lifetime craniopagus separation on Monday.”\u003c/p\u003e\n\u003cp\u003e“A cranio-what?”\u003c/p\u003e\n\u003cp\u003eHe finishes off his glass of wine and pours himself another one. “Craniopagus separation. Conjoined twins,” he says. He points to a spot on the top of his head and taps it. “Attached right here. We’ve been studying them since they were born. It’s a very rare surgery. Very rare.”\u003c/p\u003e\n\u003cp\u003eFor the first time, I think I’m genuinely turned on by him as a doctor. I mean, I admire his drive. I admire his dedication. But seeing how excited he is about what he’s doing for a living is seriously sexy.\u003c/p\u003e\n\u003cp\u003e“How long do you think it’ll take?” I ask. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-50.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
