{"id":87597,"no":51,"title":"Page 51","content":"\u003cp\u003eHe shrugs. “Not sure. They’re young, so being under general anesthesia for too long is a concern.” He holds up his right hand and wiggles his fingers. “But this is a very special hand that has been through almost half a million dollars’ worth of specialty education. I have a lot of faith in this hand.”\u003c/p\u003e\n\u003cp\u003eI walk over to him and press my lips to his palm. “I’m a little fond of this hand, too.”\u003c/p\u003e\n\u003cp\u003eHe slides the hand down to my neck and then spins me so that I’m flush against the counter. I gasp, because I wasn’t expecting that.\u003c/p\u003e\n\u003cp\u003eHe pushes himself against me from behind and slowly slides his hand down the side of my body. I press my palms into the granite and close my eyes, already feeling the rush of the wine.\u003c/p\u003e\n\u003cp\u003e“This hand,” he whispers, “is the steadiest hand in all of Boston.”\u003c/p\u003e\n\u003cp\u003eHe pushes on the back of my neck, bending me further over the counter. His hand meets the inside of my knee and he glides it upward. Slowly. Jesus.\u003c/p\u003e\n\u003cp\u003eHe pushes my legs apart, and then his fingers are inside me. I moan and try to find something to hold on to. I grip the faucet, just as he begins to work magic.\u003c/p\u003e\n\u003cp\u003eAnd then, just like a magician, his hand disappears.\u003c/p\u003e\n\u003cp\u003eI hear him walking out of the kitchen. I watch as he passes the front of the counter. He winks at me, downs the rest of his glass of wine and says, “I’m gonna take a quick shower.”\u003c/p\u003e\n\u003cp\u003eWhat a tease.\u003c/p\u003e\n\u003cp\u003e“You asshole!” I yell after him.\u003c/p\u003e\n\u003cp\u003e“I’m not an asshole!” he yells from my bedroom. “I’m a highly trained neurosurgeon!”\u003c/p\u003e\n\u003cp\u003eI laugh and pour myself another glass of wine.\u003c/p\u003e\n\u003cp\u003eI’ll show him who the tease really is.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eI’m on my third glass of wine when he walks out of my bedroom.\u003c/p\u003e\n\u003cp\u003eI’m on the phone with my mother, so I watch him from the couch as he makes his way to the kitchen and pours himself another glass.\u003c/p\u003e\n\u003cp\u003eThat is some seriously good wine.\u003c/p\u003e\n\u003cp\u003e“What are you doing tonight?” my mother asks.\u003c/p\u003e\n\u003cp\u003eI have her on speakerphone. Ryle is leaning against a wall, watching me talk to her. “Not much. Helping Ryle study.”\u003c/p\u003e\n\u003cp\u003e“That sounds . . . not very interesting,” she says.\u003c/p\u003e\n\u003cp\u003eRyle winks at me.\u003c/p\u003e\n\u003cp\u003e“It’s actually very interesting,” I say to her. “I help him study a lot. Mostly reviewing fine-motor control of the hands. In fact, we’ll probably be up all night studying.”\u003c/p\u003e\n\u003cp\u003eThe three glasses of wine has made me frisky. I can’t believe I’m flirting with him while I’m on the phone with my mother. Gross.\u003c/p\u003e\n\u003cp\u003e“I gotta go,” I tell her. “We’re taking Allysa and Marshall out to dinner tomorrow night, so I’ll call you on Monday.”\u003c/p\u003e\n\u003cp\u003e“Oh, where are you taking them?”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. The woman can’t take a hint. “I don’t know. Ryle, where are we taking them?”\u003c/p\u003e\n\u003cp\u003e“That place we went to that one time with your mom,” he says. “Bib’s? I made reservations for six o’clock.”\u003c/p\u003e\n\u003cp\u003eMy heart feels like it slinks down my chest. My mother says, “Oh, good choice.”\u003c/p\u003e\n\u003cp\u003e“Yeah. If you like stale bread. Bye, Mom.” I hang up and look at Ryle. “I don’t want to go back there. I didn’t like it. Let’s try something new.”\u003c/p\u003e\n\u003cp\u003eI fail to tell him why I really don’t want to go back there. But how do you tell your brand-new boyfriend that you’re trying to avoid your first love?\u003c/p\u003e\n\u003cp\u003eRyle pushes off the wall. “You’ll be fine,” he says. “Allysa’s excited to eat there, I told her all about it.”\u003c/p\u003e\n\u003cp\u003eMaybe I’ll get lucky and Atlas won’t be working.\u003c/p\u003e\n\u003cp\u003e“Speaking of food,” Ryle says. “I’m starving.”\u003c/p\u003e\n\u003cp\u003eThe casserole!\u003c/p\u003e\n\u003cp\u003e“Oh shit!” I say, laughing.\u003c/p\u003e\n\u003cp\u003eRyle rushes to the kitchen and I stand up and follow him in there. I walk in just as he pulls the oven door open and waves away the smoke. Ruined.\u003c/p\u003e\n\u003cp\u003eI get dizzy all of a sudden from standing up too fast after having three glasses of wine. I grab the counter beside him to steady myself, just as he reaches in to pull the burnt casserole out.\u003c/p\u003e\n\u003cp\u003e“Ryle! You need a . . .”\u003c/p\u003e\n\u003cp\u003e“Shit!” he yells.\u003c/p\u003e\n\u003cp\u003e“Pot holder.”\u003c/p\u003e\n\u003cp\u003eThe casserole falls from his hand and lands on the floor, shattering everywhere. I lift up my feet to avoid broken glass and mushroom chicken splatter. I start laughing as soon as I realize he didn’t even think to use a pot holder.\u003c/p\u003e\n\u003cp\u003eMust be the wine. This is some seriously strong wine.\u003c/p\u003e\n\u003cp\u003eHe slams the oven shut and moves to the faucet, shoving his hand under the cold water, muttering curse words. I’m trying to suppress my laughter, but the wine and the ridiculousness of the last few seconds are making it hard. I look at the floor—at the mess we’re about to have to clean up—and the laughter bursts from me. I’m still laughing as I lean over to get a look at Ryle’s hand. I hope he didn’t hurt it too bad.\u003c/p\u003e\n\u003cp\u003eI’m instantly not laughing anymore. I’m on the floor, my hand pressed against the corner of my eye.\u003c/p\u003e\n\u003cp\u003eIn a matter of one second, Ryle’s arm came out of nowhere and slammed against me, knocking me backward. There was enough force behind it to knock me off balance. When I lost my footing, I hit my face on one of the cabinet door handles as I came down.\u003c/p\u003e\n\u003cp\u003ePain shoots through the corner of my eye, right near my temple.\u003c/p\u003e\n\u003cp\u003eAnd then I feel the weight.\u003c/p\u003e\n\u003cp\u003eHeaviness follows and it presses down on every part of me. So much gravity, pushing down on my emotions. Everything shatters. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-51.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
