{"id":87603,"no":57,"title":"Page 57","content":"\u003cp\u003eI fall back against my chair. “What do you want, Allysa?”\u003c/p\u003e\n\u003cp\u003eShe scrunches up her nose and says, “If it isn’t fair that we can’t go back there because of the owner, how is it fair that the owner gets to come here?”\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eI close my laptop and stand up. “Why would you say that? Is he here?”\u003c/p\u003e\n\u003cp\u003eShe nods and slips inside my office, closing the door behind her. “He is. He asked for you. And I know you’re with my brother and I’m with child, but can we please just take a moment to silently admire the perfection that is that man?”\u003c/p\u003e\n\u003cp\u003eShe smiles dreamily and I roll my eyes.\u003c/p\u003e\n\u003cp\u003e“Allysa.”\u003c/p\u003e\n\u003cp\u003e“Those eyes, though.” She opens the door and walks out. I follow behind her and catch sight of Atlas. “She’s right here,” Allysa says. “Would you like me to take your coat?”\u003c/p\u003e\n\u003cp\u003eWe don’t take coats.\u003c/p\u003e\n\u003cp\u003eAtlas glances up when I walk out of my office. His eyes cut to Allysa and he shakes his head. “No, thank you. I won’t be long.”\u003c/p\u003e\n\u003cp\u003eAllysa leans forward over the counter, dropping her chin on her hands. “Stay as long as you like. In fact, are you looking for an extra job? Lily needs to hire more people and we’re looking for someone who can lift really heavy things. Requires a lot of flexibility. Bending over.”\u003c/p\u003e\n\u003cp\u003eI narrow my eyes at Allysa and mouth, “Enough.”\u003c/p\u003e\n\u003cp\u003eShe shrugs innocently. I hold my door open for Atlas, but avoid looking directly at him as he passes me. I feel a world of guilt for what happened last night, but also a world of anger for what happened last night.\u003c/p\u003e\n\u003cp\u003eI walk around my desk and drop into my seat, prepared for an argument. But when I look up at him, I clamp my mouth shut.\u003c/p\u003e\n\u003cp\u003eHe’s smiling. He waves his hand around in a circle as he takes a seat across from me. “This is incredible, Lily.”\u003c/p\u003e\n\u003cp\u003eI pause. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe continues smiling at me, like he’s proud of me. Then he places a bag between us on the desk and pushes it toward me. “A gift,” he says. “You can open it later.”\u003c/p\u003e\n\u003cp\u003eWhy is he buying me gifts? He has a girlfriend. I have a boyfriend. Our past has already caused enough problems in my present. I certainly don’t need gifts to exacerbate that.\u003c/p\u003e\n\u003cp\u003e“Why are you buying me gifts, Atlas?”\u003c/p\u003e\n\u003cp\u003eHe leans back in his seat and crosses his arms over his chest. “I bought it three years ago. I’ve been holding on to it in case I ever ran into you.”\u003c/p\u003e\n\u003cp\u003eConsiderate Atlas. He hasn’t changed. Dammit.\u003c/p\u003e\n\u003cp\u003eI pick up the gift and set it on the floor behind my desk. I try to release some of the tension I’m feeling, but it’s really hard when everything about him makes me so tense.\u003c/p\u003e\n\u003cp\u003e“I came here to apologize to you,” he says.\u003c/p\u003e\n\u003cp\u003eI wave off his apology, letting him know it isn’t necessary. “It’s fine. It was a misunderstanding. Ryle is fine.”\u003c/p\u003e\n\u003cp\u003eHe laughs under his breath. “That’s not what I’m apologizing for,” he says. “I’d never apologize for defending you.”\u003c/p\u003e\n\u003cp\u003e“You weren’t defending me,” I say. “There was nothing to defend.”\u003c/p\u003e\n\u003cp\u003eHe tilts his head, giving me the same look that he gave me last night. The one that lets me know how disappointed in me he is. It stings deep in my gut.\u003c/p\u003e\n\u003cp\u003eI clear my throat. “Why are you apologizing, then?”\u003c/p\u003e\n\u003cp\u003eHe’s quiet for a moment. Contemplative. “I wanted to apologize for saying that you sounded like your mother. That was hurtful. And I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI don’t know why I always feel like crying when I’m around him. When I think about him. When I read about him. It’s like my emotions are still tethered to him somehow and I can’t figure out how to cut the strings.\u003c/p\u003e\n\u003cp\u003eHis eyes drop to my desk. He reaches forward and grabs three things. A pen. A sticky note. My phone.\u003c/p\u003e\n\u003cp\u003eHe writes something down on the sticky note and then proceeds to pull my phone apart. He slips the case off and puts the sticky note between the case and the phone, then slides the cover back over it. He pushes my phone back across the desk. I look down at it and then up at him. He stands up and tosses the pen on my desk.\u003c/p\u003e\n\u003cp\u003e“It’s my cell phone number. Keep it hidden there in case you ever need it.”\u003c/p\u003e\n\u003cp\u003eI wince at the gesture. The unnecessary gesture. “I won’t need it.”\u003c/p\u003e\n\u003cp\u003e“I hope not.” He walks to the door and reaches for the doorknob. And I know this is my only chance to get out what I have to say before he’s out of my life forever.\u003c/p\u003e\n\u003cp\u003e“Atlas, wait.”\u003c/p\u003e\n\u003cp\u003eI stand up so fast, my chair scoots across the room and bumps against the wall. He half turns and faces me.\u003c/p\u003e\n\u003cp\u003e“What Ryle said to you last night? I never . . .” I bring a nervous hand up to my neck. I can feel my heart beating in my throat. “I never said that to him. He was hurt and upset and he misconstrued my words from a long time ago.”\u003c/p\u003e\n\u003cp\u003eThe corner of Atlas’s mouth twitches, and I’m not sure if he’s trying not to smile or trying not to frown. He faces me straight on. “Believe me, Lily. I know that wasn’t a pity fuck. I was there.”\u003c/p\u003e\n\u003cp\u003eHe walks out the door, and his words knock me straight back into my seat.\u003c/p\u003e\n\u003cp\u003eOnly . . . my seat is no longer there. It’s still on the other side of my office and I’m now on the floor.\u003c/p\u003e\n\u003cp\u003eAllysa rushes in and I’m lying on my back behind my desk. “Lily?” She runs around the desk and stands over me. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI hold up a thumb. “Fine. Just missed my chair.”\u003c/p\u003e\n\u003cp\u003eShe reaches out her hand and helps me to my feet. “What was that all about?” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-57.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
