{"id":87609,"no":63,"title":"Page 63","content":"\u003cp\u003eThis is the life.\u003c/p\u003e\n\u003cp\u003eWe both work almost every day. He works twice as many hours as I do and he only gets home before I’m in bed two or three nights a week. But the nights we actually do get to spend together, I tend to want him to spend those nights buried deep inside me.\u003c/p\u003e\n\u003cp\u003eHe doesn’t complain.\u003c/p\u003e\n\u003cp\u003eHe finds a spot on my neck and he claims it, kissing it so hard it hurts. “Ouch.”\u003c/p\u003e\n\u003cp\u003eHe lowers himself on top of me and mutters into my neck. “I’m giving you a hickey. Don’t move.”\u003c/p\u003e\n\u003cp\u003eI laugh, but I let him. My hair is long enough that I can cover it, and I’ve never had a hickey before.\u003c/p\u003e\n\u003cp\u003eHis lips remain in the same spot, sucking and kissing until I can no longer feel the sting. He’s pressed against me, bulging against his scrubs. I move my hands and shove his scrubs down far enough so that he can slide inside of me. He continues kissing my neck as he takes me right there on the couch.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eHe took a shower first, and as soon as he got out, I jumped in. I told him we needed to wash the smell of sex off of us before we had dinner with Allysa and Marshall.\u003c/p\u003e\n\u003cp\u003eAllysa is due in a few weeks, so she’s forcing as much couple time on us as she can. She’s worried we’ll stop coming to visit after the baby is born, which I know is ridiculous. The visits will just grow more frequent. I already love my niece more than any of them, anyway.\u003c/p\u003e\n\u003cp\u003eOkay, maybe not. But it’s close.\u003c/p\u003e\n\u003cp\u003eI try to avoid getting my hair wet as I rinse off, because we’re already running late. I grab my razor and press it under my arm when I hear a crash. I pause.\u003c/p\u003e\n\u003cp\u003e“Ryle?”\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eI finish shaving and then wash the soap off. Another crash.\u003c/p\u003e\n\u003cp\u003eWhat in the world is he doing?\u003c/p\u003e\n\u003cp\u003eI turn off the water and grab a towel, running it over myself. “Ryle!”\u003c/p\u003e\n\u003cp\u003eHe still doesn’t respond. I pull my jeans on in a hurry and open the door as I’m pulling my shirt over my head. “Ryle?”\u003c/p\u003e\n\u003cp\u003eThe nightstand by our bed is tipped over. I move to the living room and see him sitting on the edge of the couch, his head in one of his hands. He’s looking down at something in his other hand.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003eHe looks up at me and I don’t recognize his expression. I’m confused by what’s happening. I don’t know if he just got bad news or . . . Oh, God. Allysa.\u003c/p\u003e\n\u003cp\u003e“Ryle, you’re scaring me. What’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe holds up my phone and just looks at me like I should know what’s happening. When I shake my head in confusion, he holds up a piece of paper. “Funny thing,” he says, setting my phone on the coffee table in front of him. “I dropped your phone by accident. Cover pops off. I find this number hidden in the back of it.”\u003c/p\u003e\n\u003cp\u003eOh, God.\u003c/p\u003e\n\u003cp\u003eNo, no, no.\u003c/p\u003e\n\u003cp\u003eHe crumbles the number in his fist. “I thought, ‘Huh. That’s weird. Lily doesn’t hide things from me.’ ” He stands up and picks up my phone. “So I called it.” He tightens his fist around the phone. “He’s lucky I got his fucking voice mail.” He chunks my phone clear across the room and it crashes against the wall, shattering to the floor.\u003c/p\u003e\n\u003cp\u003eThere’s a three-second pause where I think this could go one of two ways.\u003c/p\u003e\n\u003cp\u003eHe’s going to leave me.\u003c/p\u003e\n\u003cp\u003eOr he’s going to hurt me.\u003c/p\u003e\n\u003cp\u003eHe runs a hand through his hair and walks straight for the door.\u003c/p\u003e\n\u003cp\u003eHe leaves.\u003c/p\u003e\n\u003cp\u003e“Ryle!” I yell.\u003c/p\u003e\n\u003cp\u003eWhy did I never throw that number away?!\u003c/p\u003e\n\u003cp\u003eI open the door and run after him. He’s taking the stairs two at a time, and I finally reach him when he’s at the landing of the second floor. I shove myself in front of him and grab his shirt in my fists. “Ryle, please. Let me explain.”\u003c/p\u003e\n\u003cp\u003eHe grabs my wrists and pushes me away from him.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003e“Be still.”\u003c/p\u003e\n\u003cp\u003eI feel his hands on me. Gentle. Steady.\u003c/p\u003e\n\u003cp\u003eTears are flowing and for some reason, they sting.\u003c/p\u003e\n\u003cp\u003e“Lily, be still. Please.”\u003c/p\u003e\n\u003cp\u003eHis voice is soothing. My head hurts. “Ryle?” I try to open my eyes, but the light is too bright. I can feel a sting at the corner of my eye and I wince. I try to sit up, but I feel his hand press down on my shoulder.\u003c/p\u003e\n\u003cp\u003e“You have to be still until I’m finished, Lily.”\u003c/p\u003e\n\u003cp\u003eI open my eyes again and look up at the ceiling. It’s our bedroom ceiling. “Finished with what?” My mouth hurts when I speak, so I bring my hand up and cover it.\u003c/p\u003e\n\u003cp\u003e“You fell down the stairs,” he says. “You’re hurt.”\u003c/p\u003e\n\u003cp\u003eMy eyes meet his. There’s concern in them, but also hurt. Anger. He’s feeling everything right now, and the only thing I feel is confused.\u003c/p\u003e\n\u003cp\u003eI close my eyes again and try to remember why he’s angry. Why he’s hurt.\u003c/p\u003e\n\u003cp\u003eMy phone.\u003c/p\u003e\n\u003cp\u003eAtlas’s number.\u003c/p\u003e\n\u003cp\u003eThe stairwell.\u003c/p\u003e\n\u003cp\u003eI grabbed his shirt.\u003c/p\u003e\n\u003cp\u003eHe pushed me away.\u003c/p\u003e\n\u003cp\u003e“You fell down the stairs.”\u003c/p\u003e\n\u003cp\u003eBut I didn’t fall.\u003c/p\u003e\n\u003cp\u003eHe pushed me. Again.\u003c/p\u003e\n\u003cp\u003eThat’s twice.\u003c/p\u003e\n\u003cp\u003eYou pushed me, Ryle.\u003c/p\u003e\n\u003cp\u003eI can feel my whole body start to shake with the sobs. I have no idea how bad I’m hurt, but I don’t even care. No physical pain could even compare to what my heart is feeling in this moment. I start to slap at his hands, wanting him away from me. I feel him lift off the bed as I curl up into a ball.\u003c/p\u003e\n\u003cp\u003eI wait for him to try and soothe it out like he did the last time he hurt me, but it never comes. I hear him walking around our bedroom. I don’t know what he’s doing. I’m still crying when he kneels down in front of me. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-63.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
