{"id":87612,"no":66,"title":"Page 66","content":"\u003cp\u003eI start nodding. “The little boy,” I said. “That’s why you were mad, because a little boy died and it upset you.”\u003c/p\u003e\n\u003cp\u003eHe blows out a quick breath of relief. “Yes. That’s why I was mad.” He stands up again and it’s like I see his entire soul crumble. He presses his palms against his eyes and fights back tears. “When I told you about what happened to him, do you remember what you said to me?”\u003c/p\u003e\n\u003cp\u003eI feel like I’m about to cry and I don’t even know why yet. “Yes. I told you I couldn’t imagine what something like that will do to that little boy’s brother. The one who accidentally shot him.” My lips start to tremble. “And that’s when you said, ‘It’ll destroy him for life, that’s what it’ll do.’ ”\u003c/p\u003e\n\u003cp\u003eOh, God.\u003c/p\u003e\n\u003cp\u003eWhere is he going with this?\u003c/p\u003e\n\u003cp\u003eRyle walks over and drops down to his knees in front of me. “Lily,” he says. “I knew it would destroy him. I knew exactly what that little boy was feeling . . . because that’s what happened to me. To Allysa’s and my older brother . . .”\u003c/p\u003e\n\u003cp\u003eI can’t hold in the tears. I just start crying and he wraps his arms tightly around my waist and lays his head on my lap. “I shot him, Lily. My best friend. My big brother. I was only six years old. I didn’t even know I was holding a real gun.”\u003c/p\u003e\n\u003cp\u003eHis whole body begins to shake and he grips me even tighter. I press a kiss into his hair because it feels like he’s on the verge of a breakdown. Just like that night on the roof. And while I’m still so angry at him, I also still love him and it absolutely kills me to find this out about him. About Allysa. We sit quietly for a long time—his head on my lap, his arms around my waist, my lips in his hair.\u003c/p\u003e\n\u003cp\u003e“She was only five when it happened. Emerson was seven. We were in the garage, so no one heard our screams for a long time. And I just sat there, and . . .”\u003c/p\u003e\n\u003cp\u003eHe pulls away from my lap and stands up, facing the other direction. After a long stretch of silence he sits down on the couch and leans forward. “I was trying to . . .” Ryle’s face contorts in pain and he lowers his head, covering it with his hands, shaking it back and forth. “I was trying to put everything back inside his head. I thought I could fix him, Lily.”\u003c/p\u003e\n\u003cp\u003eMy hand flies up to my mouth. I gasp so loudly, there’s no way to hide it.\u003c/p\u003e\n\u003cp\u003eI have to stand up so I can catch a breath.\u003c/p\u003e\n\u003cp\u003eIt doesn’t help.\u003c/p\u003e\n\u003cp\u003eI still can’t breathe.\u003c/p\u003e\n\u003cp\u003eRyle walks over to me, taking my hands and pulling me to him. We hug each other for a solid minute when he says, “I would never tell you this because I want it to excuse my behavior.” He pulls back and looks me firmly in the eyes. “You have to believe that. Allysa wanted me to tell you all of this because since that happened, there are things I can’t control. I get angry. I black out. I’ve been in therapy since I was six years old. But it is not my excuse. It is my reality.”\u003c/p\u003e\n\u003cp\u003eHe wipes away my tears, cradling my head against his shoulder.\u003c/p\u003e\n\u003cp\u003e“When you ran after me last night, I swear I had no intention of hurting you. I was upset and angry. And sometimes when I feel that much emotion, something inside of me just snaps. I don’t remember the moment I pushed you. But I know I did. I did. All I was thinking when you were running after me was how I needed to get away from you. I wanted you out of my way. I didn’t process that there were stairs around us. I didn’t process my strength compared to yours. I fucked up, Lily. I fucked up.”\u003c/p\u003e\n\u003cp\u003eHe lowers his mouth to my ear. His voice cracks when he says, “You are my wife. I’m supposed to be the one who protects you from the monsters. I’m not supposed to be one.” He holds me with so much desperation, he begins to shake. I have never, in all my life, felt so much pain radiating from one human.\u003c/p\u003e\n\u003cp\u003eIt breaks me. It rips me apart from the inside out. All my heart wants to do is wrap tightly around his.\u003c/p\u003e\n\u003cp\u003eBut even with everything he just told me, I’m still fighting my own forgiveness. I swore I wouldn’t let it happen again. I swore to him and to myself that if he ever hurt me again, I would leave.\u003c/p\u003e\n\u003cp\u003eI pull away from him, unable to look him in the eye. I walk toward my bedroom to try and take a moment to just catch my breath. I close my bathroom door behind me and grip the sink, but I can’t even stand up. I end up sliding to the floor in a heap of tears.\u003c/p\u003e\n\u003cp\u003eThis isn’t how this was supposed to be. My whole life, I knew exactly what I’d do if a man ever treated me the way my father treated my mother. It was simple. I would leave and it would never happen again.\u003c/p\u003e\n\u003cp\u003eBut I didn’t leave. And now, here I am with bruises and cuts on my body at the hands of the man who is supposed to love me. At the hands of my own husband.\u003c/p\u003e\n\u003cp\u003eAnd still, I’m trying to justify what happened.\u003c/p\u003e\n\u003cp\u003eIt was an accident. He thought I was cheating on him. He was hurt and angry and I got in his way.\u003c/p\u003e\n\u003cp\u003eI bring my hands to my face and I sob, because I feel more pain for that man out there, knowing what he went through as a child, than I feel for myself. And that doesn’t make me feel selfless or strong. It makes me feel pathetic and weak. I’m supposed to hate him. I’m supposed to be the woman my mother was never strong enough to be.\u003c/p\u003e\n\u003cp\u003eBut if I’m emulating my mother’s behavior, then that would mean Ryle is emulating my father’s behavior. But he isn’t. I have to stop comparing us to them. We’re our own individuals in an entirely different situation. My father never had an excuse for his anger, nor was he immediately apologetic. The way he treated my mother was much worse than what’s happened between Ryle and me. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-66.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
