{"id":87614,"no":68,"title":"Page 68","content":"\u003cp\u003eThe fight continued to escalate and both of us were getting angrier by the second. At one point, he knocked a vase full of flowers off the table and onto the floor. We both just stared at them for a moment. I was scared, wondering if I had made the right decision to stay. To trust that we could work on his anger issues together. He took a deep breath and he said, “I’m going to leave for an hour or two. I think I need to walk away. When I get back, we’ll continue this discussion.”\u003c/p\u003e\n\u003cp\u003eHe walked out the door and, true to his word, he came back an hour later when he was much calmer. He dropped his keys on the table and then walked straight to where I was standing. He took my face in his hands and he said, “I told you I wanted to be the best in my field, Lily. I told you this the first night we ever met. It was one of my naked truths. But if I have to choose between working at the best hospital in the world and making my wife happy . . . I choose you. You are my success. As long as you’re happy, I don’t care where I work. We’ll stay in Boston.”\u003c/p\u003e\n\u003cp\u003eThat’s when I knew that I had made the right choice. Everyone deserves another chance. Especially the people who mean the most to you.\u003c/p\u003e\n\u003cp\u003eIt’s been a week since that fight and he hasn’t mentioned moving again. I feel bad, like I thwarted his plans in some way, but marriage is about compromise. It’s about doing what’s best for the couple as a whole, not individually. And staying in Boston is better for everyone in both of our families.\u003c/p\u003e\n\u003cp\u003eSpeaking of families, I look over at my phone right as a text from Allysa comes through.\u003c/p\u003e\n\u003cp\u003eAllysa: Are you finished up at work yet? I need your opinion on furniture.\u003c/p\u003e\n\u003cp\u003eMe: Be there in fifteen minutes.\u003c/p\u003e\n\u003cp\u003eI don’t know if it’s the impending delivery or the fact that she’s not currently working, but I’m pretty sure I’ve spent more time at her house this week than I have at my own. I close up the shop and head toward her apartment.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eWhen I step off the elevator, there’s a note taped to her apartment door. I see my name written across it, so I pull it off the door.\u003c/p\u003e\n\u003cp\u003eLily,\u003c/p\u003e\n\u003cp\u003eOn the seventh floor. Apartment 749.\u003c/p\u003e\n\u003cp\u003e—A\u003c/p\u003e\n\u003cp\u003eShe has an apartment here just for extra furniture? I know they’re rich, but even that seems a little excessive for them. I get on the elevator and press the button for the seventh floor. When the doors open, I head down the hall toward apartment 749. When I reach it, I have no idea if I should knock or just go inside. For all I know, someone could live here. Probably one of her people.\u003c/p\u003e\n\u003cp\u003eI knock on the door and hear footsteps from the other side.\u003c/p\u003e\n\u003cp\u003eI’m shocked when the door swings open and Ryle is standing in front of me.\u003c/p\u003e\n\u003cp\u003e“Hey,” I say, confused. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe grins and leans against the doorframe. “I live here. What are you doing here?”\u003c/p\u003e\n\u003cp\u003eI glance at the pewter number plate next to the door and then back at him. “What do you mean you live here? I thought you lived with me. You’ve had your own apartment this whole time?” I would think an entire apartment would be something a husband would bring up to his wife at some point. It’s a little unnerving.\u003c/p\u003e\n\u003cp\u003eActually, it’s ludicrous and deceptive. I think I might be really angry at him right now.\u003c/p\u003e\n\u003cp\u003eRyle laughs and pushes off the doorframe. Now he’s filling up the entire doorway as he lifts his hands to the frame over his head and grips it. “I haven’t really had a chance to tell you about this apartment, considering I just signed the paperwork on it this morning.”\u003c/p\u003e\n\u003cp\u003eI take a step back. “Wait. What?”\u003c/p\u003e\n\u003cp\u003eHe reaches for my hand and pulls me inside the apartment. “Welcome home, Lily.”\u003c/p\u003e\n\u003cp\u003eI pause in the foyer.\u003c/p\u003e\n\u003cp\u003eYes. I said foyer. There is a foyer.\u003c/p\u003e\n\u003cp\u003e“You bought an apartment?”\u003c/p\u003e\n\u003cp\u003eHe nods slowly, gauging my reaction.\u003c/p\u003e\n\u003cp\u003e“You bought an apartment,” I repeat.\u003c/p\u003e\n\u003cp\u003eHe’s still nodding. “I did. Is that okay? I figured since we live together now we could use the extra room.”\u003c/p\u003e\n\u003cp\u003eI spin in a slow circle. When my eyes land on the kitchen, I pause. It’s not as big as Allysa’s kitchen, but it’s just as white and almost as beautiful. There’s a wine cooler and a dishwasher, two things my own apartment doesn’t have. I walk into the kitchen and look around, scared to touch anything. Is this really my kitchen? This can’t be my kitchen.\u003c/p\u003e\n\u003cp\u003eI look in the living room at the cathedral ceilings and the huge windows overlooking Boston Harbor.\u003c/p\u003e\n\u003cp\u003e“Lily?” he says from behind me. “You aren’t mad, are you?”\u003c/p\u003e\n\u003cp\u003eI spin and face him, realizing that he’s been waiting on me to react for the past several minutes. But I’m completely speechless.\u003c/p\u003e\n\u003cp\u003eI shake my head and bring my hand up to cover my mouth. “I don’t think so,” I whisper.\u003c/p\u003e\n\u003cp\u003eHe walks up to me and takes my hands in his, pulling them up between us. “You don’t think so?” He looks worried and confused. “Please give me a naked truth, because I’m starting to think maybe I shouldn’t have done this as a surprise.”\u003c/p\u003e\n\u003cp\u003eI look down at the hardwood floor. It’s real hardwood. It’s not laminate. “Okay,” I say, looking back up at him. “I think it’s crazy that you just went and bought an apartment without me. I feel like that’s something we should have done together.”\u003c/p\u003e\n\u003cp\u003eHe’s nodding and it looks like he’s about to spit out an apology, but I’m not finished.\u003c/p\u003e\n\u003cp\u003e“But my naked truth is that . . . it’s perfect. I don’t even know what to say, Ryle. Everything is so clean. I’m scared to move. I might get something dirty.” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-68.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
