{"id":87622,"no":76,"title":"Page 76","content":"\u003cp\u003eI look down at my plate. Three crepes, drizzled in syrup and garnished with a dab of whipped cream. Orange and strawberry slices line the right side of the plate.\u003c/p\u003e\n\u003cp\u003eIt’s almost too pretty to eat, but I’m too hungry to care. I take a bite and close my eyes, trying not to make it obvious that it’s the best bite of breakfast I’ve ever had.\u003c/p\u003e\n\u003cp\u003eI finally allow myself to admit that his restaurant deserved that award. As much as I tried to talk Ryle and Allysa out of going back, it was the best restaurant I’d ever been to.\u003c/p\u003e\n\u003cp\u003e“Where did you learn to cook?” I ask him.\u003c/p\u003e\n\u003cp\u003eHe sips from a cup of coffee. “The Marines,” he says, placing the cup back down. “I trained for a while during my first stint and then when I reenlisted I came on as a chef.” He taps his fork against the side of his plate. “You like it?”\u003c/p\u003e\n\u003cp\u003eI nod. “It’s delicious. But you’re wrong. You knew how to cook before you enlisted.”\u003c/p\u003e\n\u003cp\u003eHe smiles. “You remember the cookies?”\u003c/p\u003e\n\u003cp\u003eI nod again. “Best cookies I’ve ever eaten.”\u003c/p\u003e\n\u003cp\u003eHe leans back in his chair. “I taught myself the basics. My mother worked second shift when I was growing up, so if I wanted dinner at night I had to make it. It was either that or starve, so I bought a cookbook at a yard sale and made every single recipe in it over the course of a year. And I was only thirteen.”\u003c/p\u003e\n\u003cp\u003eI smile, shocked that I’m even able to. “The next time someone asks you how you learned to cook, you should tell them that story. Not the other one.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “You’re the only person who knows anything about me before the age of nineteen. I’d like to keep it that way.”\u003c/p\u003e\n\u003cp\u003eHe begins telling me about working as a chef in the military. How he saved up as much money as he could so that when he got out, he could open his own restaurant. He started with a small café that did really well, then opened Bib’s a year and a half ago. “It does okay,” he says with modesty.\u003c/p\u003e\n\u003cp\u003eI glance around his kitchen and then look back at him. “Looks like it does more than just okay.”\u003c/p\u003e\n\u003cp\u003eHe shrugs and takes another bite of his food. I don’t talk after that as we finish eating, because my mind wanders to his restaurant. The name of it. What he said in the interview. Then, of course, those thoughts lead me back to thoughts of Ryle and the anger in his voice as he yelled the last line of the interview at me.\u003c/p\u003e\n\u003cp\u003eI think Atlas can see the change in my demeanor, but he says nothing as he clears the table.\u003c/p\u003e\n\u003cp\u003eWhen he takes another seat, he chooses the chair right next to me this time. He places a reassuring hand on top of mine. “I have to go in to work for a few hours,” he says. “I don’t want you to leave. Stay here as long as you need, Lily. Just . . . please don’t go back home today.”\u003c/p\u003e\n\u003cp\u003eI shake my head when I hear the concern in his words. “I won’t. I’ll stay here,” I tell him. “I promise.”\u003c/p\u003e\n\u003cp\u003e“Do you need anything before I go?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I’ll be fine.”\u003c/p\u003e\n\u003cp\u003eHe stands up and grabs his jacket. “I’ll make it as quick as I can. I’ll be back after lunch and I’ll bring you something to eat, okay?”\u003c/p\u003e\n\u003cp\u003eI force a smile. He opens a drawer and pulls out a pen and paper. He writes something on it before he leaves. When he’s gone, I stand up and walk to the counter to read what he wrote. He listed instructions for how to set the alarm. He wrote his cell phone number, even though I have it memorized. He also wrote down his work number, his home address, and his work address.\u003c/p\u003e\n\u003cp\u003eAt the bottom in small print, he wrote, “Just keep swimming, Lily.”\u003c/p\u003e\n\u003cp\u003eDear Ellen,\u003c/p\u003e\n\u003cp\u003eHi. It’s me. Lily Bloom. Well . . . technically it’s Lily Kincaid now.\u003c/p\u003e\n\u003cp\u003eI know it’s been a long time since I’ve written to you. A really long time. After everything that happened with Atlas, I just couldn’t bring myself to open up the journals again. I couldn’t even bring myself to watch your show after school, because it hurt to watch it alone. In fact, all thoughts of you kind of depressed me. When I thought of you, I thought of Atlas. And to be honest, I didn’t want to think of Atlas, so I had to cut you out of my life, too.\u003c/p\u003e\n\u003cp\u003eI’m sorry about that. I’m sure you didn’t miss me like I missed you, but sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain. You were an extension of my pain, so I guess that’s what I was doing. I was just trying to save myself a little bit of agony.\u003c/p\u003e\n\u003cp\u003eI’m sure your show is as great as ever, though. I hear you still dance at the beginning of some episodes, but I’ve grown to appreciate that. I think that’s one of the biggest signs a person has matured—knowing how to appreciate things that matter to others, even if they don’t matter very much to you.\u003c/p\u003e\n\u003cp\u003eI should probably catch you up on my life. My father died. I’m twenty-four now. I got a college degree, worked in marketing for a while, and now I own my own business. A floral shop. Life goals, FTW!\u003c/p\u003e\n\u003cp\u003eI also have a husband and he isn’t Atlas.\u003c/p\u003e\n\u003cp\u003eAnd . . . I live in Boston.\u003c/p\u003e\n\u003cp\u003eI know. Shocker.\u003c/p\u003e\n\u003cp\u003eThe last time I wrote to you, I was sixteen. I was in a really bad place and I was so worried about Atlas. I’m not worried about Atlas anymore, but I am in a really bad place right now. More so than the last time I wrote to you.\u003c/p\u003e\n\u003cp\u003eI’m sorry I don’t seem to need to write to you when I’m in a good place. You tend to only get the shit end of my life, but that’s what friends are for, right? \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-76.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
