{"id":87623,"no":77,"title":"Page 77","content":"\u003cp\u003eI don’t even know where to start. I know you don’t know anything about my current life or my husband, Ryle. But there’s this thing we do where one of us says “naked truth,” and then we’re forced to be brutally honest and say what we’re really thinking.\u003c/p\u003e\n\u003cp\u003eSo . . . naked truth.\u003c/p\u003e\n\u003cp\u003eBrace yourself.\u003c/p\u003e\n\u003cp\u003eI am in love with a man who physically hurts me. Of all people, I have no idea how I let myself get to this point.\u003c/p\u003e\n\u003cp\u003eThere were many times growing up I wondered what was going through my mother’s head in the days after my father had hurt her. How she could possibly love a man who had laid his hands on her. A man who repeatedly hit her. Repeatedly promised he would never do it again. Repeatedly hit her again.\u003c/p\u003e\n\u003cp\u003eI hate that I can empathize with her now.\u003c/p\u003e\n\u003cp\u003eI’ve been sitting on Atlas’s couch for over four hours, wrestling with my feelings. I can’t get a grip on them. I can’t understand them. I don’t know how to process them. And true to my past, I realized that maybe I need to just get them out on paper. My apologies to you, Ellen. But get ready for a whole lot of word vomit.\u003c/p\u003e\n\u003cp\u003eIf I had to compare this feeling to something, I would compare it to death. Not just the death of anyone. The death of the one. The person who is closer to you than anyone else in the whole world. The one who, when you simply imagine their death, it makes your eyes tear up.\u003c/p\u003e\n\u003cp\u003eThat’s what this feels like. It feels like Ryle has died.\u003c/p\u003e\n\u003cp\u003eIt’s an astronomical amount of grief. An enormous amount of pain. It’s a sense that I’ve lost my best friend, my lover, my husband, my lifeline. But the difference between this feeling and death is the presence of another emotion that doesn’t necessarily follow in the event of an actual death.\u003c/p\u003e\n\u003cp\u003eHatred.\u003c/p\u003e\n\u003cp\u003eI am so angry at him, Ellen. Words can’t express the amount of hatred I have for him. Yet somehow, in the midst of all my hatred, there are waves of reasoning that flow through me. I start to think things like “But I shouldn’t have had the magnet. I should have told him about the tattoo from the beginning. I shouldn’t have kept the journals.”\u003c/p\u003e\n\u003cp\u003eThe reasoning is the hardest part of this. It eats at me, little by little, wearing down the strength my hatred lends to me. The reasoning forces me to imagine our future together, and how there are things I could do to prevent that type of anger. I’ll never betray him again. I’ll never keep secrets from him again. I’ll never give him reason to react that way again. We’ll both just have to work harder from now on.\u003c/p\u003e\n\u003cp\u003eFor better, for worse, right?\u003c/p\u003e\n\u003cp\u003eI know these are the things that once went through my mother’s head. But the difference between the two of us is that she had more to worry about. She didn’t have the financial stability that I have. She didn’t have the resources to leave and give me what she thought was a decent shelter. She didn’t want to take me away from my father when I was used to living with both parents. I have a feeling reasoning really kicked her ass a time or two.\u003c/p\u003e\n\u003cp\u003eI can’t even begin to process the thought that I’m having a child with this man. There is a human being inside of me that we created together. And no matter which option I choose—whether I choose to stay or choose to leave—neither are choices I would wish upon my child. To grow up in a broken home or an abusive one? I’ve already failed this baby in life, and I’ve only known about his or her existence for a single day.\u003c/p\u003e\n\u003cp\u003eEllen, I wish you could write back to me. I wish that you could say something funny to me right now, because my heart needs it. I have never felt this alone. This broken. This angry. This hurt.\u003c/p\u003e\n\u003cp\u003ePeople on the outside of situations like these often wonder why the woman goes back to the abuser. I read somewhere once that 85 percent of women return to abusive situations. That was before I realized I was in one, and when I heard that statistic, I thought it was because the women were stupid. I thought it was because they were weak. I thought these things about my own mother more than once.\u003c/p\u003e\n\u003cp\u003eBut sometimes the reason women go back is simply because they’re in love. I love my husband, Ellen. I love so many things about him. I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.\u003c/p\u003e\n\u003cp\u003eI’m a statistic now. The things I’ve thought about women like me are now what others would think of me if they knew my current situation.\u003c/p\u003e\n\u003cp\u003e“How could she love him after what he did to her? How could she contemplate taking him back?”\u003c/p\u003e\n\u003cp\u003eIt’s sad that those are the first thoughts that run through our minds when someone is abused. Shouldn’t there be more distaste in our mouths for the abusers than for those who continue to love the abusers?\u003c/p\u003e\n\u003cp\u003eI think of all the people who have been in this situation before me. Everyone who will be in this situation after me. Do we all repeat the same words in our heads in the days after experiencing abuse at the hands of those who love us? “From this day forward, for better, for worse, for richer, for poorer, in sickness and health, until death do us part.”\u003c/p\u003e\n\u003cp\u003eMaybe those vows weren’t meant to be taken as literally as some spouses take them.\u003c/p\u003e\n\u003cp\u003eFor better, for worse?\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eThat.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003e—Lily\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Six\u003c/p\u003e\n\u003cp\u003eI’m lying on Atlas’s guest bed, staring up at the ceiling. It’s a normal bed. Really comfortable, actually. But it feels like I’m on a water bed. Or maybe a raft, adrift at sea. And I scale over these huge waves, each of them carrying something different. Some are waves of sadness. Some are waves of anger. Some are waves of tears. Some are waves of sleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-77.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
