{"id":87625,"no":79,"title":"Page 79","content":"\u003cp\u003eYep. I’m definitely confused. How am I possibly lending blame to Atlas for any of this?\u003c/p\u003e\n\u003cp\u003e“I think I need to call it a night,” I say quietly, pulling away from him. I stand up and Atlas stands up, too.\u003c/p\u003e\n\u003cp\u003e“I’ll be gone most of the day tomorrow,” he says. “Will you be here when I get home?”\u003c/p\u003e\n\u003cp\u003eI cringe at his question. Of course he wants me to get my shit together and find another place to stay. What am I even still doing here? “No. No, I can get a hotel, it’s fine.” I turn to walk toward the hallway, but he puts a hand on my shoulder.\u003c/p\u003e\n\u003cp\u003e“Lily,” he says, turning me around. “I wasn’t asking you to leave. I was just making sure you’d still be here. I want you to stay as long as you need to.”\u003c/p\u003e\n\u003cp\u003eHis eyes are sincere, and if I didn’t think it would be a little inappropriate, I would throw my arms around him and hug him. Because I’m not ready to leave yet. Just a couple more days before I’m forced to figure out what my next step is.\u003c/p\u003e\n\u003cp\u003eI nod. “I need to go in to work for a few hours tomorrow,” I tell him. “There are some things I need to take care of. But if you really don’t mind, I’d like to stay here for a few more days.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind, Lily. I’d prefer it.”\u003c/p\u003e\n\u003cp\u003eI force a smile and then head to the guest bedroom. At least he’s giving me a buffer before I’m forced to confront everything.\u003c/p\u003e\n\u003cp\u003eAs much as his presence in my life confuses me right now, I’ve never been more thankful for him.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Seven\u003c/p\u003e\n\u003cp\u003eMy hand is trembling when I reach for the doorknob. I’ve never once been scared to walk into my own business before, but I’ve also never been this on edge.\u003c/p\u003e\n\u003cp\u003eThe building is dark when I enter it, so I flip on the lights, holding my breath. I walk slowly to my office, pushing the door open with caution.\u003c/p\u003e\n\u003cp\u003eHe’s nowhere, yet he’s everywhere.\u003c/p\u003e\n\u003cp\u003eWhen I take a seat at my desk, I turn on my phone for the first time since I went to bed last night. I wanted a good night’s sleep without having to worry about whether or not Ryle was trying to contact me.\u003c/p\u003e\n\u003cp\u003eWhen it powers on, I have twenty-nine missed texts from Ryle. It just so happens to be the same number of doors Ryle knocked on to find my apartment last year.\u003c/p\u003e\n\u003cp\u003eI don’t know whether to laugh or cry at the irony.\u003c/p\u003e\n\u003cp\u003eI spend the rest of the day like this. Glancing over my shoulder, looking up at the door every time it opens. I wonder if he’s ruined me. If the fear of him will ever leave me.\u003c/p\u003e\n\u003cp\u003eHalf a day goes by without a single phone call from him while I catch up on paperwork. Allysa calls me after lunch and I can tell by her voice that she has no idea about the fight Ryle and I had. I let her talk about the baby for a while before I pretend I have a customer and hang up.\u003c/p\u003e\n\u003cp\u003eI plan on leaving when Lucy returns from her lunch break. She has half an hour left.\u003c/p\u003e\n\u003cp\u003eRyle walks through the front door three minutes later.\u003c/p\u003e\n\u003cp\u003eI’m the only one here.\u003c/p\u003e\n\u003cp\u003eAs soon as I see him, I turn stone cold. I’m standing behind the counter, my hand on the cash register because it’s close to the stapler. I’m sure a stapler couldn’t do much harm against the arms of a neurosurgeon, but I’ll use what I have.\u003c/p\u003e\n\u003cp\u003eHe slowly makes his way to the counter. It’s the first time I’ve seen him since he was on top of me on our bed the other night. My whole body is immediately taken back to that moment, and I’m engulfed in the same level of emotions as I was in that moment. Both fear and anger rush through me when he reaches the counter.\u003c/p\u003e\n\u003cp\u003eHe lifts his hand and places a set of keys on the counter in front of me. My eyes fall to the keys.\u003c/p\u003e\n\u003cp\u003e“I’m leaving for England tonight,” he says. “I’ll be gone for three months. I paid all the bills so you won’t have to worry about it while I’m gone.”\u003c/p\u003e\n\u003cp\u003eHis voice is composed but I can see the veins in his neck as they prove his composure is taking all the effort he has. “You need time.” He swallows hard. “And I want to give that to you.” He grimaces and pushes the keys to my apartment toward me. “Go back home, Lily. I won’t be there. I promise.”\u003c/p\u003e\n\u003cp\u003eHe turns and begins walking toward the door. It occurs to me that he didn’t even try to apologize. I’m not angry about it. I understand it. He knows that an apology will never take back what he did. He knows that the best thing for us right now is separation.\u003c/p\u003e\n\u003cp\u003eHe knows what a huge mistake he made . . . yet I still feel the need to dig that knife in a little deeper.\u003c/p\u003e\n\u003cp\u003e“Ryle.”\u003c/p\u003e\n\u003cp\u003eHe looks back at me and it’s as if he puts a shield up between us. He doesn’t turn all the way around and he’s stiff as he waits for whatever I’m about to say. He knows my words are going to hurt him.\u003c/p\u003e\n\u003cp\u003e“You know what the worst part about this whole thing is?” I ask.\u003c/p\u003e\n\u003cp\u003eHe doesn’t say anything. He just stares at me, waiting for my answer.\u003c/p\u003e\n\u003cp\u003e“All you had to do when you found my journal was ask me for a naked truth. I would have been honest with you. But you didn’t. You chose to not ask for my help and now we’ll both have to suffer the consequences of your actions for the rest of our lives.”\u003c/p\u003e\n\u003cp\u003eHe grimaces with every word. “Lily,” he says, turning toward me.\u003c/p\u003e\n\u003cp\u003eI hold up my hand to stop him from saying anything else. “Don’t. You can leave now. Have fun in England.”\u003c/p\u003e\n\u003cp\u003eI can see the war waging inside of him. He knows he can’t get anywhere with me in this moment, no matter how hard he wants to beg for my forgiveness. He knows the only choice he has is to turn and walk out that door, even though it’s the last thing he wants to do. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-79.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
