{"id":87629,"no":83,"title":"Page 83","content":"\u003cp\u003eWhy would he lie to me?\u003c/p\u003e\n\u003cp\u003eRyle and I weren’t even an official couple yet when I ran into Atlas at that restaurant the first time. Hell, if Atlas had given me any reason to believe there was a chance between us that night, I know without a doubt that I would have chosen him over Ryle. I barely even knew Ryle at that point.\u003c/p\u003e\n\u003cp\u003eBut Atlas didn’t say anything. He lied to me and told me he’d been in a relationship for an entire year. Why? Why would he do that unless he didn’t want me to think I had a chance with him?\u003c/p\u003e\n\u003cp\u003eMaybe I’ve been wrong all this time. Maybe he never even loved me to begin with and he knew that inventing this Cassie person would keep me away from him for good.\u003c/p\u003e\n\u003cp\u003eYet, here I am. Crashing at his house. Interacting with his friends. Eating his food. Using his shower.\u003c/p\u003e\n\u003cp\u003eI can feel the tears begin to sting my eyes and the last thing I want is to stand in front of him and cry right now. I walk around the table and rush past him. I don’t make it far when he grabs my hand. “Wait.”\u003c/p\u003e\n\u003cp\u003eI stop, still facing the other direction.\u003c/p\u003e\n\u003cp\u003e“Talk to me, Lily.”\u003c/p\u003e\n\u003cp\u003eHe’s right behind me now, his hand still wrapped around mine. I pull it away from him and walk to the other side of the living room.\u003c/p\u003e\n\u003cp\u003eI spin and face him just as the first tear rolls down my cheek. “Why did you never come back for me?”\u003c/p\u003e\n\u003cp\u003eHe looked prepared for anything to come out of my mouth other than the words I just spoke to him. He runs a hand through his hair and walks to the couch, taking a seat. After blowing out a calming breath, he carefully looks over at me.\u003c/p\u003e\n\u003cp\u003e“I did, Lily.”\u003c/p\u003e\n\u003cp\u003eI don’t allow air to move in or out of my lungs.\u003c/p\u003e\n\u003cp\u003eI stand completely still, processing his answer.\u003c/p\u003e\n\u003cp\u003eHe came back for me?\u003c/p\u003e\n\u003cp\u003eHe folds his hands together in front of him. “When I got out of the Marines the first time, I went back to Maine, hoping to find you. I asked around and found out which college you went to. I wasn’t sure what to expect when I showed up, because we were two different people by then. It had been four years since we saw each other. I knew a lot about both of us had probably changed in those four years.”\u003c/p\u003e\n\u003cp\u003eMy knees feel weak, so I walk to the chair next to him and lower myself. He came back for me?\u003c/p\u003e\n\u003cp\u003e“I walked around your campus the whole day looking for you. Finally, late that afternoon, I saw you. You were sitting in the courtyard with a group of your friends. I watched you for a long time, trying to work up the courage to walk over to you. You were laughing. You looked happy. You were vibrant like I’d never seen you before. I had never felt that kind of happiness for another person like I felt when I saw you that day. Just knowing you were okay . . .”\u003c/p\u003e\n\u003cp\u003eHe pauses for a moment. My hands are clenched around my stomach, because it hurts. It hurts knowing I was so close to him and I didn’t even know.\u003c/p\u003e\n\u003cp\u003e“I began walking toward you when someone came up behind you. A guy. He dropped to his knees next to you and when you saw him, you smiled and threw your arms around him. Then you kissed him.”\u003c/p\u003e\n\u003cp\u003eI close my eyes. He was just a boy I dated for six months. He never even made me feel a fraction of what I had felt for Atlas.\u003c/p\u003e\n\u003cp\u003eHe blows out a sharp breath. “I left after that. When I saw that you were happy, it was the worst and best feeling a person could ever have at once. But I believed at that point that my life was still not good enough for you. I had nothing to offer you but love, and to me, you deserved more than that. The next day I signed up for another tour in the Marines. And now . . .” He tosses his hand up lazily in the air, like nothing about his life is impressive.\u003c/p\u003e\n\u003cp\u003eI bury my head in my hands to take a moment. I quietly grieve what could have been. What is. What wasn’t. My fingers move to the tattoo on my shoulder. I begin to wonder if I’ll ever be able to fill in that hole now.\u003c/p\u003e\n\u003cp\u003eIt makes me wonder if Atlas ever feels like I felt when I got this tattoo. Like all the air is being let out of his heart.\u003c/p\u003e\n\u003cp\u003eI still don’t understand why he lied to me after running into me at his restaurant. If he really felt the things I felt for him, why would he make something like that up?\u003c/p\u003e\n\u003cp\u003e“Why did you lie about having a girlfriend?”\u003c/p\u003e\n\u003cp\u003eHe rubs a hand over his face and I can already see the regret before I even hear it in his voice. “I said that because . . . you looked happy that night. When I saw you telling him goodbye, it hurt like hell, but at the same time I was relieved that you seemed to be in a really good place. I didn’t want you to worry about me. And I don’t know . . .\u0026nbsp; maybe I was a little jealous. I don’t know, Lily. I regretted lying to you as soon as I did it.”\u003c/p\u003e\n\u003cp\u003eMy hand goes to my mouth. My mind starts to race just as fast as my heart is racing. I instantly start thinking about the what-ifs. What if he would have been honest with me? Told me how he’d felt? Where would we be now?\u003c/p\u003e\n\u003cp\u003eI want to ask him why he did it. Why he didn’t fight for me. But I don’t have to ask him, because I already know the answer. He thought he was giving me what I wanted, because all he’s ever wanted for me was happiness. And for some stupid reason, he’s never felt I could get that with him.\u003c/p\u003e\n\u003cp\u003eConsiderate Atlas.\u003c/p\u003e\n\u003cp\u003eThe more I think about it, the more difficult it becomes to breathe. I think about Atlas. Ryle. Tonight. Two nights ago. It’s too much.\u003c/p\u003e\n\u003cp\u003eI stand up and make my way back to the guest bedroom. I pick up my phone and grab my purse and go back to the living room. Atlas hasn’t moved.\u003c/p\u003e\n\u003cp\u003e“Ryle left for England today,” I say. “I think I should probably go home now. Can you drive me?”\u003c/p\u003e\n\u003cp\u003eA sadness enters his eyes and when it does, I know that leaving is the right thing to do. Neither of us has closure. I’m not sure we’ll ever get it. I’m beginning to think closure is a myth, and being here right now while I’m still processing everything that’s happening to my life is just going to make things worse for me. I have to eliminate as much confusion as possible, and right now, my feelings for Atlas top the list of most confusing. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-83.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
