{"id":87641,"no":95,"title":"Page 95","content":"\u003cp\u003eThat’s exactly what we’re doing. Learning how to navigate our situation before our child is brought into the fold.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Five\u003c/p\u003e\n\u003cp\u003eI smell toast.\u003c/p\u003e\n\u003cp\u003eI stretch out on my bed and smile, because Ryle knows toast is my favorite. I lie here for a while before I even attempt to get up. It feels like it takes the effort of three men to roll me out of bed. I eventually take a deep breath, and then throw my feet over the side, pushing myself up from the mattress.\u003c/p\u003e\n\u003cp\u003eThe first thing I do is pee. It’s really all I do now. I’m due in two days and my doctor says it could be another week. I started maternity leave last week, so this is my life right now. I pee and watch TV.\u003c/p\u003e\n\u003cp\u003eWhen I make it to the kitchen, Ryle is stirring a pan of scrambled eggs. He spins around when he hears me walk in. “Good morning,” he says. “No baby yet?”\u003c/p\u003e\n\u003cp\u003eI shake my head and put my hand on my stomach. “No, but I peed nine times last night.”\u003c/p\u003e\n\u003cp\u003eRyle laughs. “That’s a new record.” He spoons some eggs onto a plate and then tosses bacon and toast on it. He turns around and hands me the plate, pressing a quick kiss to the side of my head. “I gotta go. I’m already late. I’m leaving my phone on all day.”\u003c/p\u003e\n\u003cp\u003eI smile when I look down at my breakfast. Okay, so I eat, too. Pee, eat, and watch TV.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I say cheerfully. I take my plate to the couch and turn on the TV. Ryle rushes around the living room, gathering his stuff.\u003c/p\u003e\n\u003cp\u003e“I’ll come check on you at lunch. I might be working late tonight, but Allysa said she can bring you dinner.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “I’m fine, Ryle. The doctor said light bed rest, not complete debilitation.”\u003c/p\u003e\n\u003cp\u003eHe starts to open the door, but pauses like he forgets something. He runs back toward me and leans down, planting his lips on my stomach. “I’ll double your allowance if you decide to come out today,” he says to the baby.\u003c/p\u003e\n\u003cp\u003eHe talks to the baby a lot. I finally felt comfortable enough to let him feel the baby kick a couple of weeks ago and since then, he stops by sometimes just to talk to my belly and doesn’t even say much to me. I like it, though. I like how excited he is to be a father.\u003c/p\u003e\n\u003cp\u003eI grab the blanket Ryle slept on the couch with last night and wrap it over me. He’s been staying here for a week now, waiting for me to go into labor. I wasn’t sure about the arrangement at first, but it’s actually been really helpful. I still sleep in the guest bedroom. The third bedroom is now a nursery, which means the master bedroom is available for him to sleep in. But for whatever reason, he chooses to sleep on the couch. I think the memories in that bedroom plague him just as much as they plague me, so neither of us even bothers going in there.\u003c/p\u003e\n\u003cp\u003eThe last several weeks have been really good. Aside from the fact that there’s absolutely no physical relationship between us at this point, things feel like they’ve kind of gone back to how they used to be. He still works a lot, but on the evenings he’s off, I’ve started having dinner upstairs with all of them. We never eat alone as a couple, though. Anything that might feel like a date or a couples thing, I avoid. I’m still trying to focus on one monumental thing at a time, and until this baby is born and my hormones are back to normal, I refuse to make a decision about my marriage. I’m sure I’m just using the pregnancy as an excuse to stall the inevitable, but being pregnant allows a person to be a little selfish.\u003c/p\u003e\n\u003cp\u003eMy phone begins to ring, and I drop my head into the couch and groan. My phone is all the way in the kitchen. That’s like fifteen feet from here.\u003c/p\u003e\n\u003cp\u003eUgh.\u003c/p\u003e\n\u003cp\u003eI push myself off the couch, but nothing happens.\u003c/p\u003e\n\u003cp\u003eI try it again. Still sitting.\u003c/p\u003e\n\u003cp\u003eI grab hold of the arm of my chair and pull myself up. Third time’s the charm.\u003c/p\u003e\n\u003cp\u003eWhen I stand, my glass of water spills all over me. I groan . . . but then I gasp.\u003c/p\u003e\n\u003cp\u003eI wasn’t holding a glass of water.\u003c/p\u003e\n\u003cp\u003eHoly shit.\u003c/p\u003e\n\u003cp\u003eI look down and water is trickling down my leg. My phone is still ringing on the kitchen counter. I walk—or waddle—to the kitchen and answer it.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Hey, it’s Lucy! Quick question. Our order of red roses was damaged in shipment, but we’ve got the Levenberg funeral today and they specifically wanted red roses for the casket spray. Do we have a backup plan?”\u003c/p\u003e\n\u003cp\u003e“Yeah, call the florist on Broadway. They owe me a favor.”\u003c/p\u003e\n\u003cp\u003e“Okay, thanks!”\u003c/p\u003e\n\u003cp\u003eI start to hang up so I can call Ryle and tell him my water broke, but I hear Lucy say, “Wait!”\u003c/p\u003e\n\u003cp\u003eI pull the phone back to my ear.\u003c/p\u003e\n\u003cp\u003e“About these invoices. Did you want me to pay them today or wait . . .”\u003c/p\u003e\n\u003cp\u003e“You can wait, it’s fine.”\u003c/p\u003e\n\u003cp\u003eAgain, I start to hang up but she yells my name and starts firing off another question.\u003c/p\u003e\n\u003cp\u003e“Lucy,” I say calmly, interrupting her. “I’ll have to call you about all this tomorrow. I think my water just broke.”\u003c/p\u003e\n\u003cp\u003eThere’s a pause. “Oh. OH! GO!”\u003c/p\u003e\n\u003cp\u003eI hang up right when the first sign of pain shoots through my stomach. I wince and start dialing Ryle’s number. He picks up on the first ring.\u003c/p\u003e\n\u003cp\u003e“Do I need to turn around?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Oh, God. Really? It’s happening?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Lily!” he says, excited. And then the phone goes dead.\u003c/p\u003e\n\u003cp\u003eI spend the next few minutes gathering everything I’ll need. I already have a hospital bag, but I feel kind of gross, so I jump in the shower to rinse off. The second burst of pain comes about ten minutes after the first. I bend forward and clench my stomach, letting the water beat down on my back. Right when I near the end of the contraction, I hear the bathroom door swing open. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-95.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
