{"id":87644,"no":98,"title":"Page 98","content":"\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eI push through the crowds of Boylston Street until I get to the cross street. I pull the stroller to a crawl and then stop at the edge of the curb. I pull the top of it back and look down at Emmy. She’s kicking her feet and smiling like usual. She’s a very happy baby. She has a calm energy about her and it’s addictive.\u003c/p\u003e\n\u003cp\u003e“How old is she?” a woman asks. She’s standing at the crosswalk with us, staring down at Emerson appreciatively.\u003c/p\u003e\n\u003cp\u003e“Eleven months.”\u003c/p\u003e\n\u003cp\u003e“She’s gorgeous,” she says. “Looks just like you. Identical mouths.”\u003c/p\u003e\n\u003cp\u003eI smile. “Thank you. But you should see her father. She definitely has his eyes.”\u003c/p\u003e\n\u003cp\u003eThe sign flashes to walk, and I try to beat the crowd as we rush across the street. I’m already half an hour late and Ryle has texted me twice. He hasn’t experienced the joy of carrots yet, though. He’ll find out today just how messy they are, because I packed plenty in her bag.\u003c/p\u003e\n\u003cp\u003eI moved out of the apartment Ryle bought when Emerson was three months old. I got my own place closer to my work so I’m within walking distance, which is great. Ryle moved back into the apartment he bought, but between visiting Allysa’s place and Ryle’s days with Emerson, I feel like I’m still at their apartment building almost as much as I’m at mine.\u003c/p\u003e\n\u003cp\u003e“Almost there, Emmy.” We make a right around the corner and I’m in such a rush, a man has to step out of our way and into the wall just to avoid being plowed over. “Sorry,” I mutter, ducking my head and making my way around him.\u003c/p\u003e\n\u003cp\u003e“Lily?”\u003c/p\u003e\n\u003cp\u003eI stop.\u003c/p\u003e\n\u003cp\u003eI turn slowly, because I felt that voice all the way to my toes. There are only two voices that have ever done that to me, and Ryle’s doesn’t reach that far anymore.\u003c/p\u003e\n\u003cp\u003eWhen I look back at him, his blue eyes are squinting against the sun. He lifts a hand to shield it and he grins. “Hey.”\u003c/p\u003e\n\u003cp\u003e“Hi,” I say, my frenzied brain trying to slow down and allow me to play catch-up.\u003c/p\u003e\n\u003cp\u003eHe glances at the stroller and points at it. “Is that . . . is this your baby?”\u003c/p\u003e\n\u003cp\u003eI nod and he walks around to the front of the stroller. He kneels down and smiles widely at her. “Wow. She’s gorgeous, Lily,” he says. “What’s her name?”\u003c/p\u003e\n\u003cp\u003e“Emerson. We call her Emmy sometimes.”\u003c/p\u003e\n\u003cp\u003eHe puts his finger in her hand and she starts kicking, shaking his finger back and forth. He stares at her appreciatively for a moment and then stands back up again.\u003c/p\u003e\n\u003cp\u003e“You look great,” he says.\u003c/p\u003e\n\u003cp\u003eI try not to give him an obvious once-over, but it’s hard. He looks as good as ever, but this is the first time seeing him that I’m not trying to deny how gorgeous he turned out to be. A far cry from that homeless boy in my bedroom. Yet . . . somehow still exactly the same.\u003c/p\u003e\n\u003cp\u003eI can feel the buzz of my text message going off in my pocket again. Ryle.\u003c/p\u003e\n\u003cp\u003eI point down the street. “We’re really late,” I say. “Ryle has been waiting for half an hour.”\u003c/p\u003e\n\u003cp\u003eWhen I say Ryle’s name, there’s a sadness that reaches Atlas’s eyes, but he tries to disguise it. He nods and slowly steps aside for us to pass.\u003c/p\u003e\n\u003cp\u003e“It’s his day to have her,” I clarify, saying more in those six words than I could in most full conversations.\u003c/p\u003e\n\u003cp\u003eI see the relief flash in his eyes. He nods and points behind him. “Yeah, I’m running late, too. Opened a new restaurant on Boylston last month.”\u003c/p\u003e\n\u003cp\u003e“Wow. Congratulations. I’ll have to take Mom there to check it out soon.”\u003c/p\u003e\n\u003cp\u003eHe smiles. “You should. Let me know and I’ll make sure and cook for you myself.”\u003c/p\u003e\n\u003cp\u003eThere’s an awkward pause, and then I point down the street. “We have to . . .”\u003c/p\u003e\n\u003cp\u003e“Go,” he says with a smile.\u003c/p\u003e\n\u003cp\u003eI nod again and then duck my head and continue walking. I have no idea why I’m reacting this way. Like I don’t know how to hold a normal conversation. When I’m several yards away, I glance back over my shoulder. He hasn’t moved. He’s still watching me as I walk away.\u003c/p\u003e\n\u003cp\u003eWe round the corner and I see Ryle waiting beside his car outside the floral shop. His face lights up when he sees us approaching. “Did you get my email?” He kneels down and begins to unstrap Emerson.\u003c/p\u003e\n\u003cp\u003e“Yeah, about the playpen recall?”\u003c/p\u003e\n\u003cp\u003eHe nods as he pulls her out of the stroller. “Didn’t we buy one of those for her?”\u003c/p\u003e\n\u003cp\u003eI press the buttons to fold the stroller and then walk it to the back of his car. “Yeah, but it broke like a month ago. I threw it in the Dumpster.”\u003c/p\u003e\n\u003cp\u003eHe pops the trunk, and then touches Emerson’s chin with his fingers. “Did you hear that, Emmy? Your mommy saved your life.” She smiles up at him and slaps playfully at his hand. He kisses her on the forehead and then picks up her stroller and tosses it in the trunk. I slam the trunk shut and lean over to give her a quick kiss.\u003c/p\u003e\n\u003cp\u003e“Love you, Emmy. See you tonight.”\u003c/p\u003e\n\u003cp\u003eRyle opens the back door to put her in the car seat. I tell him goodbye and then I start to head back down the street in a rush.\u003c/p\u003e\n\u003cp\u003e“Lily!” he yells. “Where are you going?”\u003c/p\u003e\n\u003cp\u003eI’m sure he expected me to walk to the front door of my store, since I’m already late opening it. I probably should, but the nagging in my gut won’t go away. I need to do something about it. I spin around and walk backward. “There’s something I forgot to do! I’ll see you when I pick her up tonight!”\u003c/p\u003e\n\u003cp\u003eRyle lifts Emerson’s hand and they wave goodbye to me. As soon as I round the corner, I break out into a sprint. I dodge people, bump into a few and cause one lady to curse at me, but it’s all worth it the moment I see the back of his head. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-98.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
