{"id":87645,"no":99,"title":"Page 99","content":"\u003cp\u003e“Atlas!” I yell. He’s heading in the other direction, so I keep pushing through the crowd. “Atlas!”\u003c/p\u003e\n\u003cp\u003eHe stops walking but he doesn’t turn around. He cocks his head like he doesn’t want to fully trust his ears.\u003c/p\u003e\n\u003cp\u003e“Atlas!” I yell again.\u003c/p\u003e\n\u003cp\u003eThis time when he turns, he turns with purpose. His eyes meet mine and there’s a three-second pause while we both stare at each other. But then we both start walking toward each other, determination in every step. Twenty steps separate us.\u003c/p\u003e\n\u003cp\u003eTen.\u003c/p\u003e\n\u003cp\u003eFive.\u003c/p\u003e\n\u003cp\u003eOne.\u003c/p\u003e\n\u003cp\u003eNeither of us takes that final step.\u003c/p\u003e\n\u003cp\u003eI’m out of breath, panting and nervous. “I forgot to tell you Emerson’s middle name.” I put my hands on my hips and exhale. “It’s Dory.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t immediately react, but then his eyes crinkle a little in the corners. His mouth twitches like he’s forcing back a smile. “What a perfect name for her.”\u003c/p\u003e\n\u003cp\u003eI nod, and smile, and then stop.\u003c/p\u003e\n\u003cp\u003eI’m not sure what to do now. I just needed him to know that, but now that I’ve told him, I didn’t really think of what I’d do or say next.\u003c/p\u003e\n\u003cp\u003eI nod again, and then glance around me, throwing a thumb over my shoulder. “Well . . . I guess I’ll . . .”\u003c/p\u003e\n\u003cp\u003eAtlas steps forward, grabs me, and pulls me hard against his chest. I immediately close my eyes when he wraps his arms around me. His hand goes up to the back of my head and he holds me still against him as we stand, surrounded by busy streets, blasts of horns, people brushing us as they pass in a hurry. He presses a gentle kiss into my hair, and all of that fades away.\u003c/p\u003e\n\u003cp\u003e“Lily,” he says quietly. “I feel like my life is good enough for you now. So whenever you’re ready . . .”\u003c/p\u003e\n\u003cp\u003eI clench his jacket in my hands and keep my face pressed tight against his chest. I suddenly feel like I’m fifteen again. My neck and cheeks flush from his words.\u003c/p\u003e\n\u003cp\u003eBut I’m not fifteen.\u003c/p\u003e\n\u003cp\u003eI’m an adult with responsibilities and a child. I can’t just allow my teenage feelings to take over. Not without a little reassurance, at least.\u003c/p\u003e\n\u003cp\u003eI pull back and look up at him. “Do you donate to charity?”\u003c/p\u003e\n\u003cp\u003eAtlas laughs with confusion. “Several. Why?”\u003c/p\u003e\n\u003cp\u003e“Do you want kids someday?”\u003c/p\u003e\n\u003cp\u003eHe nods. “Of course I do.”\u003c/p\u003e\n\u003cp\u003e“Do you think you’ll ever want to leave Boston?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “No. Never. Everything is better here, remember?”\u003c/p\u003e\n\u003cp\u003eHis answers give me the reassurance I need. I smile up at him. “Okay. I’m ready.”\u003c/p\u003e\n\u003cp\u003eHe pulls me tight against him and I laugh. With everything that has happened since the day he came into my life, I never expected this outcome. I’ve hoped for it a lot, but until now I wasn’t sure if it would ever happen.\u003c/p\u003e\n\u003cp\u003eI close my eyes when I feel his lips meet the spot on my collarbone. He presses a gentle kiss there and it feels just like the first time he kissed me there all those years ago. He brings his mouth to my ear, and in a whisper, he says, “You can stop swimming now, Lily. We finally reached the shore.” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-ends-with-us/page-99.html","bookId":1823,"creation":"Oct 5, 2019 5:23:27 PM","modification":"Oct 5, 2019 5:23:27 PM"}
