{"id":82177,"no":16,"title":"Page 16","content":"\u003cp\u003eKeeping the mystery alive, as Frank would say.\u003c/p\u003e\n\u003cp\u003eDori takes up the paint sprayer and quickly coats the first board with even strokes, leaving a smooth white surface. She hands me the sprayer. “Start towards the top and go slowly, side to side.” I aim it at the board and press the trigger just as she’s saying, “Back up first!” I basical y blast it with paint al in one spot, so it looks like shit—and bonus, since I’m holding it too near the flat surface—Dori and I end up with a rebound scatter of paint everywhere except where the goggles and particle masks cover our eyes and mouths. She blinks at me behind paint-misted goggles. There’s paint in her hair, on her shirt, and misted over every inch of visible skin.\u003c/p\u003e\n\u003cp\u003e“Oops.” My voice is muffled by the mask. I’m expecting anger or at least irritation, but she looks at my face and bursts out laughing and then so do I and soon we’ve caught the attention of everyone, including the photogs in the surrounding yards.\u003c/p\u003e\n\u003cp\u003eShaking her head, she pul s her particle mask down and it hangs around her neck. “You have to learn everything the hard way, don’t you?”\u003c/p\u003e\n\u003cp\u003eI shrug. “I prefer to cal it learning by experience.” She laughs again and rol s her eyes, “Ooooh, wel in that case, far be it from me to interrupt your learning processes.\u003c/p\u003e\n\u003cp\u003eNext time, please warn me to wear head-to-toe plastic sheeting while you’re learning.” She uses air quotes around learning.\u003c/p\u003e\n\u003cp\u003e“Yes, boss.” I take a giant step back and so does she as I raise the sprayer. And then she takes another, pul ing on her mask while I mumble, “Funny girl,” through mine.\u003c/p\u003e\n\u003cp\u003eWhen I’m done, we stand surveying the boards, sipping our coffee drinks, masks around our necks, goggles pushed to our foreheads. She looks at me and smirks at my hair, which is sticking straight up behind the goggles. I push them back so they sit more like sunglasses on top of my head and point at her shirt. “So what’s the story with this VBS gig? Roberta said you were in charge of some musical program, and that’s why you disappeared last week.”\u003c/p\u003e\n\u003cp\u003eShe watches me over the lid of her cup. “It’s just a few songs for the kindergarten class. For Parents’ Night.”\u003c/p\u003e\n\u003cp\u003e“You’re directing them?” At her nod, I say, “I know nothing about kids that age, except that I was one. Or so I hear.” She smiles, and I become aware of the freckles that were protected from paint mist by her mask and goggles.\u003c/p\u003e\n\u003cp\u003eScattered across the bridge of her nose, they’re actual y kind of cute. “You go to this church regularly? I’ve never real y been; my parents aren’t big on religion.” Her smile weakens and her gaze skitters away and back. “Yeah, I do.” She swal ows another sip. “My dad’s the pastor.”\u003c/p\u003e\n\u003cp\u003eWhoa. I didn’t expect that. “Ah. So how much of that VBS job is you volunteering and how much is you being volunteered?”\u003c/p\u003e\n\u003cp\u003eShe doesn’t hesitate. “Oh, I love teaching the kids to sing. It’s the most rewarding thing I do.” Her eyes slide away again.\u003c/p\u003e\n\u003cp\u003e“I thought attempting to rehabilitate me was your favorite thing.” I hadn’t expected to make her blush, but her ears color under the paint.\u003c/p\u003e\n\u003cp\u003eDori\u003c/p\u003e\n\u003cp\u003eI can’t respond to that comment, of course—a comment made more awkward by our previous argument about whether or not he needed or wanted rehabilitating, and whether or not I’d consider him worthy of the task. He’s either forgiven me for those heated words, or he’s forgotten them.\u003c/p\u003e\n\u003cp\u003eI think he seldom forgets anything.\u003c/p\u003e\n\u003cp\u003eWe finish painting the first coat on the boards, and at lunch Reid’s frat boy groupies join us. There are four of them clustered around him today. I consider sitting with Roberta, Darlene and Frank, but they’re huddled together discussing grandchildren and real estate taxes and for discussing grandchildren and real estate taxes and for some reason, I just want to feel eighteen today.\u003c/p\u003e\n\u003cp\u003e“So what’s it like, being you at some party? I bet you score al the chicks,” a guy named Javier is asking Reid, who makes room for me on the edge of the patio.\u003c/p\u003e\n\u003cp\u003e“I can’t complain,” he answers, his eyes hitting mine for a split second.\u003c/p\u003e\n\u003cp\u003eJavier leans closer. “Do any of them ever put up any fight? Turn you down?”\u003c/p\u003e\n\u003cp\u003eReid laughs. “Yeah, sure.”\u003c/p\u003e\n\u003cp\u003e“But not like, often,” another guy, Kyle, says.\u003c/p\u003e\n\u003cp\u003eReid shrugs. “I guess not.”\u003c/p\u003e\n\u003cp\u003eI’m rethinking my desire to be an eighteen-year-old girl and my decision to sit with this particular group of boys when the one on my opposite side offers his hand, “Hi, I’m Trevor.”\u003c/p\u003e\n\u003cp\u003eI shake his hand. “Dori.”\u003c/p\u003e\n\u003cp\u003eHe leans forward, speaking in a low voice. “Ignore them\u003c/p\u003e\n\u003cp\u003e—they’re a bunch of morons with no manners.” I take a bite of my sandwich rather than reply, curious about whatever inappropriate thing Kyle is asking Reid. (I swear I just heard the word boobs.) Trevor clears his throat, blocking out whatever Kyle is saying. “So are you a celebrity, too?”\u003c/p\u003e\n\u003cp\u003e“Uh, no.”\u003c/p\u003e\n\u003cp\u003e“Oh, okay. I just noticed you seem… acquainted…” he inclines his head towards Reid.\u003c/p\u003e\n\u003cp\u003e“Oh. No.” I wave a dismissive hand. “We’ve just been working together since he’s been here. So, what are you studying? UCLA, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Applied mathematics.” He removes his glasses and rubs a smear from a lens with his shirttail. “What about you?”\u003c/p\u003e\n\u003cp\u003e“I’l be starting at Berkeley in the fal . Social work.” His eyebrows rise. “Berkeley? Cool.” He chuckles a little. “Social work, eh?” I bristle, having endured appal ed reactions about my chosen major from everyone from my maternal grandparents to classmates. He puts the glasses on and says, “I didn’t mean that how it sounded. I was just thinking how everyone is always horrified at my major, like it’s so difficult and al , but I hear ‘social work’ and think that sounds hard.”\u003c/p\u003e\n\u003cp\u003eI nod. “My sister just finished her medical degree, so pretty much everything pales in comparison to that.” He puffs his cheeks and blows air out. “Oh, man, yeah.\u003c/p\u003e\n\u003cp\u003eMy roommate’s pre-dental, and he studies nonstop—some nights I go to bed and he’s studying and I get up and he’s studying. So does your sister practice nearby?”\u003c/p\u003e\n\u003cp\u003e“She just started her residency. In Indiana.”\u003c/p\u003e\n\u003cp\u003e“Cool.”\u003c/p\u003e\n\u003cp\u003eJavier and another groupie high-five each other, and Javier says, “Dude, yes,” to Reid. “I want to be you so bad.” I glance at Reid, who’s smiling and shaking his head.\u003c/p\u003e\n\u003cp\u003eWhatever he’s just admitted to, I’m sure I don’t want to know.\u003c/p\u003e\n\u003cp\u003e“So why social work?” Trevor gestures to the house. “I take it you’re one of the regulars here, so you must know what a chal enging field you’re going into.” I nod. “I’m not starry-eyed about it. My dad’s a pastor and my mom is an obstetrical nurse working with mostly low-income women, so I guess I have some built-in feelings of obligation to do what I can for my community. Lots of people who plan to go into social work talk about al the people they’re going to help… but more often you save one person while losing nine. It could be a real y discouraging field if you’re not realistic about the odds.” He nods. “Sounds like you’ve considered every angle. I think the world needs more people like you.” I turn to grab my drink and hide my self-conscious smile.\u003c/p\u003e\n\u003cp\u003e“Thanks. So, why applied mathematics?”\u003c/p\u003e\n\u003cp\u003eHe smiles, a smal dimple appearing on the right side.\u003c/p\u003e\n\u003cp\u003e“Wel , I’m really good at math.”\u003c/p\u003e\n\u003cp\u003eThe remainder of lunch ticks away while we discuss col ege courses, dorm life and going Greek, which I’m certain is not for me, though he insists I’d be perfect for a sorority leadership spot. “Scholarly types are needed, too.\u003c/p\u003e\n\u003cp\u003eTrust me—I am one of those.”\u003c/p\u003e\n\u003cp\u003eAs we get up to throw our trash away and get back to work, he says, “It was nice to meet you, Dori. Good luck at Berkeley, and, you know, saving ten percent of the world.” He winks at me before signaling to his frat brothers to fol ow him inside.\u003c/p\u003e\n\u003cp\u003eI’m seldom so blatantly flirted with. Except for Reid, when he’s entertaining himself by torturing me. Which doesn’t count.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eI learned more about Dori in fifteen minutes of eavesdropping on her conversation with the math geek than I’ve found out about her the whole time we’ve been working together. Not only is her father is a pastor, but her sister is a doctor, her mother is a nurse working with low-income pregnant women, and Dori intends to become a social worker. She must have been bred to this service-to-society mentality from birth. She’s like the reverse of me.\u003c/p\u003e\n\u003cp\u003eFor about two seconds I want to go home and hug my parents.\u003c/p\u003e\n\u003cp\u003eThen Dori’s ears did their pink transformation. Up to that point, I’d just been observing that Trevor guy flirting with her.\u003c/p\u003e\n\u003cp\u003eIt was humorous until her ears started glowing. Shit. Now I’m territorial over making her ears change color? What the hel .\u003c/p\u003e\n\u003cp\u003eAfter tossing my trash, I scan the yard for Dori and spot her walking in a tight circle, talking on her cel . I grab a couple of water bottles and head over to the shelving boards, which need a second coat of paint.\u003c/p\u003e\n\u003cp\u003e“No, I mean, of course I stil want to see you.” Her voice carries the few feet between us. “Can we not do this now?” She stops her circular pacing. “No, there’s nothing you’re doing wrong.”\u003c/p\u003e\n\u003cp\u003eShe’s silent for another couple of minutes, restarting her pacing after glancing at me. I busy myself setting up the paint sprayer, pretending I can’t hear her.\u003c/p\u003e\n\u003cp\u003e“Nick, I don’t know if I’m even capable…” Eyes tightly closed, she makes a fist and bumps herself in the forehead three times. “I don’t know why. There’s obviously something wrong with me. Something missing.” Opening her eyes, she swipes the back of her hand across her cheek. She’s breaking up with the guy? It’s like a gruesome col ision. I can’t look away.\u003c/p\u003e\n\u003cp\u003e“We’re going to different col eges, and you’l find someone who’l be everything you want and deserve. I’m just… not that girl. I never have been.” She searches her empty pockets, looking for a tissue, I think. She turns to go into the house, and I can’t fol ow without being really damned obvious.\u003c/p\u003e\n\u003cp\u003eWhen she comes back out, I’m painting the boards. Her eyes are red, but not repulsively so. “Oh,” she says, smiling, though barely. “You got started already. Thanks.” I shrug one shoulder. “No problem.” I turn the motor off on the sprayer and examine her for a couple of seconds.\u003c/p\u003e\n\u003cp\u003e“Wanna talk about it?” I ask. She shakes her head, and I nod, hand her the water bottle. “What’s next, boss?” She swal ows half the bottle of water, and then says,\u003c/p\u003e\n\u003cp\u003e“Did you know that ‘boss’ is what guys in jail cal the guards and deputies?”\u003c/p\u003e\n\u003cp\u003eAs a matter of fact I do know that, but I raise my eyebrows in mock surprise. “You don’t say.” She rol s her eyes, sighing, her smile growing wider.\u003c/p\u003e\n\u003cp\u003e“Why don’t you finish painting, you reprobate, and I’l go inside and start getting the closets ready to be shelved.” I turn the sprayer back on. “I’ve been cal ed worse, you know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/good-for-you-between-the-lines-3/page-16.html","bookId":2741,"creation":"Oct 5, 2019 4:42:08 PM","modification":"Oct 5, 2019 4:42:08 PM"}
