{"id":82180,"no":19,"title":"Page 19","content":"\u003cp\u003eHe squatted down next to my chair, which he’d never done. “I have something to ask you.” Viewing him from this new perspective, I stared at his long, dark eyelashes and his ful lips. He drew the rose down the side of my face, the petals soft against my cheek, and I felt a stirring to my core.\u003c/p\u003e\n\u003cp\u003e“Do you have a date for homecoming?”\u003c/p\u003e\n\u003cp\u003eI shook my head slowly, disbelieving. It made no sense for someone as popular as Colin to notice me, let alone ask me out.\u003c/p\u003e\n\u003cp\u003e“Would you like to go with me?” His gaze locked on mine as he slowly dragged the rose across my lips, the fragrance of it sweet and overpowering. I nodded, and he smiled. He pul ed his phone from his pocket, pushed a few buttons, handed it to me. “Put your number in. I’l cal you tonight and we’l talk logistics.” As I tapped my number, he glanced towards the door and back to me. “Can I have a kiss, to seal the deal?”\u003c/p\u003e\n\u003cp\u003eI nodded again, and then his lips were on mine, briefly.\u003c/p\u003e\n\u003cp\u003eHe took his phone, laid the rose on my desk, and walked into the hal , whistling. I’d been asked to homecoming, had accepted the invitation, and his kiss, never speaking a word.\u003c/p\u003e\n\u003cp\u003eThat was my first kiss with Colin. My first kiss with anyone.\u003c/p\u003e\n\u003cp\u003eFour months later, it was Valentine’s Day. His parents had driven to San Francisco for an extended romantic weekend, and his little sister was staying overnight at a friend’s house. He took me to dinner, and then we rented a movie. We had the house to ourselves. As we made out on the sofa, he whispered that he loved me. When he took my hand and pul ed me to his room and into his bed, I fol owed.\u003c/p\u003e\n\u003cp\u003eWe snuck home to his empty house during lunch breaks and got a hotel room on my fifteenth birthday, where we made love in the shower, on the worn loveseat, and on the floor, laughing at the rug burns we sustained on our knees and backsides from the coarse carpet. I woke up in his arms, hoping Mom hadn’t cal ed the friend with whom I was supposedly spending the night, but certain I’d not trade that waking moment for anything, no matter the consequences.\u003c/p\u003e\n\u003cp\u003eWhen spring break came around and he took off for San Diego with friends, I didn’t protest; I wasn’t one of those clingy girlfriends. When he came back home Sunday night\u003c/p\u003e\n\u003cp\u003e—his eighteenth birthday—and didn’t cal or return my texts, I was concerned. When he didn’t show at lunch or stop by the office on Monday, I didn’t understand. Not until I saw him in the hal way just before last period, his arm slung around the waist of a senior girl. Not until his eyes passed over and then returned to me.\u003c/p\u003e\n\u003cp\u003e“Hey, fresh meat,” he said, and kept walking.\u003c/p\u003e\n\u003cp\u003eThat was when I knew it was over.\u003c/p\u003e\n\u003cp\u003eChapter 24\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eOn one hand, that could have gone better… and on the other, it couldn’t have. Once again, I gave in to the impulse to kiss her, though truth be told I’ve wanted to kiss her since the moment she fel into my arms and the sky rained fruit onto our heads.\u003c/p\u003e\n\u003cp\u003eShe didn’t shove me away this time. At least not until after I kissed her, and she kissed me back. God damn, did she kiss me back. And then the conversation about sex—\u003c/p\u003e\n\u003cp\u003esomething thing I never thought I’d be discussing with Dorcas Cantrel —and my foul language. I’m not a Neanderthal; I’m capable of curbing it when necessary. I just general y don’t see the point. It’s who I am. Deal. Dori makes it sound like saying the f-word is on par with burning flags or drowning bunnies.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes while I’m staring into the bubblegum closet, ignoring, for now, the part of the story where Dori ran away. Again. My driver is out front, and I forgot to get her signature before she took off. She said Roberta and Gene were stil here; hopeful y one of them wil sign.\u003c/p\u003e\n\u003cp\u003eSeven more working days of my sentence to go.\u003c/p\u003e\n\u003cp\u003e“Reid?” Roberta’s eyebrows fly up when I come around the corner and her eyes blink behind glasses that lend her face an owlish appearance. She glances at the watch on her wrist and then blinks at me again. “You’re stil here?” I pul the sheet out of my back pocket as I walk into her makeshift office—a rickety table, a folding chair and a laptop set up in the middle of the master bedroom. Baskets labeled in and out teeter on the edge of the table, stacked with assorted forms and files. “Dori needed some help fixing something that I, uh, screwed up. So I stayed a little late.”\u003c/p\u003e\n\u003cp\u003eShe takes the form, gives it a cursory glance and scrawls her signature at the bottom, smiling. “How lovely of you. I’m sure Dori appreciated that.”\u003c/p\u003e\n\u003cp\u003eRight. I’m sure appreciation was way up there on her list of feelings as she raced out of here. “When’s her last day, anyway?” I ask, as offhandedly as possible.\u003c/p\u003e\n\u003cp\u003e“Tuesday, I believe.”\u003c/p\u003e\n\u003cp\u003eBy the end of the day Tuesday, I’l only have three more days remaining of this sentence. I should be looking forward to this ending. Instead, I’m craving some way to slow down time so I can figure out what the hel I want, and get it. “How long is her trip?”\u003c/p\u003e\n\u003cp\u003eRoberta’s eyes narrow, suspicious of my sudden interest in Dori’s plans. “Three weeks, I think,” she answers.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eI shrug and turn to leave. “Just curious.” I have to be on location in Vancouver for my next film in less than a month. Little to no time in between her return and my departure. I don’t know what I want from this girl.\u003c/p\u003e\n\u003cp\u003eTadd labeled her a chal enge, and God yes, she’s that. But today. That kiss. And now I have a matter of days to figure out how far she’s wil ing to take this. Assuming she plays fair and shows up instead of skipping out like she did before.\u003c/p\u003e\n\u003cp\u003eIgnoring the paparazzi, bodyguards and fans, I leave the house and walk towards the driver, who stands stoical y next to the open back door of the car. A flash of insight nearly stops me in the middle of the newly paved sidewalk.\u003c/p\u003e\n\u003cp\u003eThe last time I tried to kiss her, she ducked away and then disappeared for several days. This time, she surrendered\u003c/p\u003e\n\u003cp\u003e—and the way she kissed me wasn’t the feel of a girl submitting to something unwanted. She wasn’t giving in to me, she was giving in to herself. She’d contemplated kissing me, at least subconsciously.\u003c/p\u003e\n\u003cp\u003eShe didn’t disappear last time and run away this time because I did something she didn’t want. She disappeared and ran away because she wanted me to kiss her.\u003c/p\u003e\n\u003cp\u003eThe chal enge is reading her. She doesn’t let her guard down often. To get her to let it slip, only two things have worked—getting her real y pissed off or real y turned on, neither of which is sustained for long. She protects herself, like a turtle yanking its head back into its shel .\u003c/p\u003e\n\u003cp\u003eWhy does the fact that plain-faced philanthropist and future social worker Dorcas Cantrel wants me make me feel high?\u003c/p\u003e\n\u003cp\u003eDori\u003c/p\u003e\n\u003cp\u003eI shoved Reid away and took a five-day breather when he tried to kiss me the first time, right after the Fruit Bowl Incident.\u003c/p\u003e\n\u003cp\u003eA normal boy would have dismissed me with a shrug of his shoulders and a rude nickname, at least in his own head. But Reid is no normal boy, and my attempts to hide my attraction to him are clearly a big fail. Then again, maybe he just thinks every girl on the planet wants him, so a refusal seems like my quirky way of asking him to try again.\u003c/p\u003e\n\u003cp\u003eAs infuriating as that thought is, that line of reasoning absolutely worked. Barnacles.\u003c/p\u003e\n\u003cp\u003e“Hel o?” Deb’s voice is groggy when she answers, and I’m immediately sorry for waking her, but it doesn’t stop me from needing her. “Dori? What’s up, baby?” I take a deep breath. “I kissed him.”\u003c/p\u003e\n\u003cp\u003eThe swoosh of sliding fabric in the background increases my guilt. She was probably power-napping before another overnight-through-afternoon shift, and here I am bothering her with this sil iness. “You kissed who?” She yawns lightly, affirming my concern.\u003c/p\u003e\n\u003cp\u003e“Reid.” There’s a moment of silence. “Deb?”\u003c/p\u003e\n\u003cp\u003e“You kissed Reid Alexander?” Her tone is incredulous, which is understandable, given the circumstances. “The superficial and—I believe this was stated emphatical y\u003c/p\u003e\n\u003cp\u003e— unprofound Reid Alexander?”\u003c/p\u003e\n\u003cp\u003eI’m staring at my closed bedroom door. Scarves, a couple of hats and an umbrel a hang from the over-the-door couple of hats and an umbrel a hang from the over-the-door hooks, neat and color-coordinated one side to the other.\u003c/p\u003e\n\u003cp\u003eOn my blue wal is a large magnetic white board with a list of everything I need to do before Quito on one side and everything for Berkeley on the other. Most of each list is checked off. My life is so utterly structured and planned out.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Oh, boy.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Um, may I ask how this took place?”\u003c/p\u003e\n\u003cp\u003eRecal ing the hungry look he wore as he leaned closer triggers unwelcome tremors of longing. “Wel , he was feeling real y proud of himself after fixing some shelves he’d messed up earlier in the day…” If that isn’t the strangest excuse ever given for kissing someone, I don’t know what is.\u003c/p\u003e\n\u003cp\u003e“Okay, wait. Has Habitat instituted some new sort of rewards program? Because kissing seems excessive, even for truly outstanding shelf construction.” My laugh dwindles and fades to a moan. “What should I do? I told Roberta I’d be there through Tuesday. That’s four more days of him, smug and arrogant every time he looks at me.”\u003c/p\u003e\n\u003cp\u003e“And this differs from his usual demeanor how, exactly?”\u003c/p\u003e\n\u003cp\u003e“Good point.” The chirp of an alarm sounds on her end.\u003c/p\u003e\n\u003cp\u003e“Oh, Deb—I’m sorry for waking you up.”\u003c/p\u003e\n\u003cp\u003e“Meh.” She yawns again. “It was almost time to get up anyway.”\u003c/p\u003e\n\u003cp\u003eI picture her cramped but comfortable efficiency apartment and its tiny, south-facing balcony, planters of al sorts and sizes lining the railing and hanging from the roofline. The eight by ten foot space is overrun with greenery and flowers, and from the parking lot her patio looks like a miniature rainforest on the top floor, contrasting with neighboring porches of bicycles, plastic furniture, and bored dogs. “When do you have to be at the hospital?”\u003c/p\u003e\n\u003cp\u003e“Wel , I’m already here, actual y. The hospital has a lovely, windowless room of foul-smel ing lockers and uncomfortable bunks for the doctors to crash, especial y the interns, since we basical y live here.” Great, now I feel even worse. “So,” she says in her ful y alert, logical, down-to-business voice. “Work separately if you can. If you have to work together, make sure the two of you are never alone.\u003c/p\u003e\n\u003cp\u003eAnd pretend that kiss never happened. Do that for four days, and that wil be the end of the unprofound Reid Alexander.”\u003c/p\u003e\n\u003cp\u003eI fight the urge to defend Reid’s unprofoundness in at least one realm: kissing. If anyone ever kisses me better than that, it could alter the time/space continuum. Yet here I am, getting advice on how to make sure it never happens again.\u003c/p\u003e\n\u003cp\u003e“Thanks, Deb.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome, baby girl. Any time.”\u003c/p\u003e\n\u003cp\u003eChapter 25\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eMom is passed out on my bed and drooling onto the silk duvet when I get home. She seldom comes into my side of the house anymore. I can’t even remember the last time I came home and found her in my room.\u003c/p\u003e\n\u003cp\u003eCourtesy of our live-in domestic help, there aren’t any remnants of today’s bender—no bottles or glasses to tel me what she ingested to find oblivion this time. Not that her poison of choice matters. The house stays clean thanks to our housekeeper, Maya. She and Immaculada have disappeared into staff quarters, but there are always meals in the fridge if I’m hungry. I imagine for a moment what it might be like to have an alcoholic mother at less than our level of opulence. I’d come home to a filthy house, bottles strewn end to end, nothing to eat. She’d be passed out on the sofa, on the floor, in the yard. \u003c/p\u003e","sourceLink":"https://allnovel.net/good-for-you-between-the-lines-3/page-19.html","bookId":2741,"creation":"Oct 5, 2019 4:42:08 PM","modification":"Oct 5, 2019 4:42:08 PM"}
