{"id":104693,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI was looking at the grille of a car, my car, the Hyundai “H” symbol a foot from my face.\u003c/p\u003e\n\u003cp\u003eThe car reversed itself and wrenched free of the wreckage that had been the kitchen’s west wall. There was now a rupture near the floor, frayed with tufts of pink insulation and shredded aluminum siding. I rolled myself out of the hole, fell hard onto the cool grass outside. I coughed, coughed.\u003c/p\u003e\n\u003cp\u003eCoughed.\u003c/p\u003e\n\u003cp\u003ePassed out.\u003c/p\u003e\n\u003cp\u003eI woke up what felt like hours later.\u003c/p\u003e\n\u003cp\u003eOr maybe seconds.\u003c/p\u003e\n\u003cp\u003eThe trailer was a fireball behind me. I was too wiped out to appreciate that I had avoided death twice within a few minutes, first by a fraction of an inch then by a few smoke-filled breaths.\u003c/p\u003e\n\u003cp\u003eI heard a bark.\u003c/p\u003e\n\u003cp\u003eDavid? You alive?\u003c/p\u003e\n\u003cp\u003eThat voice again, from nowhere. I struggled to my feet, saw my car sitting about twenty feet away.\u003c/p\u003e\n\u003cp\u003eMolly the dog was sitting behind the wheel. I stared at this for a good solid minute. She barked, and again I heard words in the sound.\u003c/p\u003e\n\u003cp\u003eJohn’s voice.\u003c/p\u003e\n\u003cp\u003eI didn’t think it could get any stupider than the bratwurst thing, but I suspected I was about to find out otherwise. I climbed into the car, pushing Molly over to the passenger’s seat.\u003c/p\u003e\n\u003cp\u003eMolly looked at me, with concern. No, not Molly.\u003c/p\u003e\n\u003cp\u003eJohn looked back at me, with Molly’s big brown eyes. Molly barked, but I heard:\u003c/p\u003e\n\u003cp\u003eWe’re in big fuckin’ trouble, Dave.\u003c/p\u003e\n\u003cp\u003e“No shit, fluffy. How did you work the pedals?”\u003c/p\u003e\n\u003cp\u003e“Woof!”\u003c/p\u003e\n\u003cp\u003eListen. There are three people still alive from last night other than me. Big Jim Sullivan, Jennifer Lopez and Fred Chu. I don’t know a whole lot else because my own body ain’t workin’ so well. I know we’re all together and we’re on the move and once we get where we’re goin’, something bad, bad, bad is gonna happen.\u003c/p\u003e\n\u003cp\u003e“Wait, wait, wait. Why are you a dog again, John?”\u003c/p\u003e\n\u003cp\u003e“Arrr-oof!”\u003c/p\u003e\n\u003cp\u003e(Sneeze)\u003c/p\u003e\n\u003cp\u003eJustin White, or the thing that used to be Justin, he’s got me. My body, I mean. He stole a vehicle. When I’m in my body I can’t see nothin’, but I can hear. It’s somethin’ big enough to hold all of us, some kind of truck. Dave, you gotta find it.\u003c/p\u003e\n\u003cp\u003e“Is it an ambulance? The cop told me he stole an ambulance from the hospital. So there are actually four still alive from last night, if you count Justin.”\u003c/p\u003e\n\u003cp\u003e“Woo—”\u003c/p\u003e\n\u003cp\u003eNo, no, no. I said there were three that were alive and I meant it. Justin White ain’t alive. He’s a walking . . . hive or whatever.\u003c/p\u003e\n\u003cp\u003e“Those things inside him, what are they?”\u003c/p\u003e\n\u003cp\u003e“Woof!”\u003c/p\u003e\n\u003cp\u003eBitch!\u003c/p\u003e\n\u003cp\u003eThis threw me, and I stared in dull confusion for a moment before I noticed the dog was looking past me. I turned and saw a little brown-and-white beagle tied up next to one of the trailers.\u003c/p\u003e\n\u003cp\u003e“John?”\u003c/p\u003e\n\u003cp\u003e“Woof!”\u003c/p\u003e\n\u003cp\u003eSorry, Dave. My grandpa used to tell me, toward the end when he was going crazy, that talking through a dog ain’t like talking through a sausage. Molly is in here with me and I gotta compete for the barker.\u003c/p\u003e\n\u003cp\u003e“Where is Justin, or this Justin Thing, taking everybody?”\u003c/p\u003e\n\u003cp\u003eI already knew the answer as soon as the question left my mouth. I said it along with the dog’s bark: “Las Vegas.”\u003c/p\u003e\n\u003cp\u003e“So what’s in Las Vegas?”\u003c/p\u003e\n\u003cp\u003e“Woof! Arrrrr-oof!! Grrrr . . .”\u003c/p\u003e\n\u003cp\u003eYou know that Bugs Bunny cartoon, where they spill the ink on the floor and then climb through it as if it was a hole? I think that’s what the soy sauce is like. It’s a hole, it opens you right up. Those worms, and the other shit in Robert’s basement, the sauce let that stuff come into our world, by turning people into holes. And I think if the sauce infects enough people, in one place, it can make one single big-ass hole.\u003c/p\u003e\n\u003cp\u003e“Shit. Is it worth asking what’s going to come through the hole?”\u003c/p\u003e\n\u003cp\u003e“Woof.”\u003c/p\u003e\n\u003cp\u003eI don’t know. But what comes through will have to feed.\u003c/p\u003e\n\u003cp\u003eI nodded. “Right. And Vegas has all those free buffets.”\u003c/p\u003e\n\u003cp\u003eMolly closed her eyes in frustration. I had never seen that expression on a dog before.\u003c/p\u003e\n\u003cp\u003eNo. Listen. There’s a guy named Albert Marconi. He does these conferences on the occult, he’s having one there at the Luxor, that’s the big casino shaped like a black pyramid. We’re going to go there.\u003c/p\u003e\n\u003cp\u003e“Wait. How do you know this?”\u003c/p\u003e\n\u003cp\u003eBecause it’s already happened.\u003c/p\u003e\n\u003cp\u003e“That doesn’t make any—”\u003c/p\u003e\n\u003cp\u003e“Woof!”\u003c/p\u003e\n\u003cp\u003eCAT! CAT! CAT! CAT!!!\u003c/p\u003e\n\u003cp\u003eMolly was up in the seat, jamming her head out the half-open passenger window.\u003c/p\u003e\n\u003cp\u003e“John . . .”\u003c/p\u003e\n\u003cp\u003e“WOOF! WOOF! WOOF! WOOF! WOOF! WOOFWOOFWOOFWOOF!!!”\u003c/p\u003e\n\u003cp\u003eCat!! Cat! Cat!!! Cat!!! CAT!! CAT!!!! CAAAATTT!!!\u003c/p\u003e\n\u003cp\u003eA filthy gray cat zipped across the trailer park, across the front of the car and off into the distance. Molly pulled her head inside and tromped over to the driver’s-side window, stomping on my crotch and shouting “CAT!!!” the whole way. It took ten minutes to get the dog calmed down, at which point she promptly curled up and went to sleep in the passenger seat.\u003c/p\u003e\n\u003cp\u003e“John?”\u003c/p\u003e\n\u003cp\u003eThe dog farted. I got nothing else out of her the rest of the night.\u003c/p\u003e\n\u003cp\u003eCHAPTER 5\u003c/p\u003e\n\u003cp\u003eRiding with Shitload\u003c/p\u003e\n\u003cp\u003eI DROVE TO a convenience store and bought a road atlas. Back in my car I unfolded it in my lap and drew out the path to Las Vegas with an ink pen. Was I actually doing this?\u003c/p\u003e\n\u003cp\u003eI knew I would need cash for gas and to replace the several vital parts of the Hyundai’s drivetrain that would likely shatter over the course of the long drive. I had nothing in the bank. This seemed to be a rather major problem, but within a few seconds of watching the sunset in the convenience store’s parking lot, a plan popped into my head, fully formed and alien. I had learned to accept such things in the last few hours.\u003c/p\u003e\n\u003cp\u003eThis wasn’t Dave thinking.\u003c/p\u003e\n\u003cp\u003eThis was soy sauce thinking.\u003c/p\u003e\n\u003cp\u003eI drove downtown, scanning the alleys until I saw a rail-thin Mexican kid standing by a Dumpster wearing a St. Louis Rams jacket. The kid was wearing the jacket, not the Dumpster. I calmly stepped out of my Hyundai, smiled broadly at him.\u003c/p\u003e\n\u003cp\u003eI had never met him before.\u003c/p\u003e\n\u003cp\u003eI had no idea what I was doing.\u003c/p\u003e\n\u003cp\u003eWithout hesitation, I heard myself say, “Yo. Mikey said you got a package for me.”\u003c/p\u003e\n\u003cp\u003eWhat the fuck.\u003c/p\u003e\n\u003cp\u003eThe kid squinted at me, didn’t move. “Who the fuck are you?”\u003c/p\u003e\n\u003cp\u003eThe kid moved slightly, the bottom of his Ram’s jacket sliding up his skeletal frame. The gun sticking out of the kid’s jeans was black and sleek, looking like something that could shoot lasers. The irony that he was able to afford a nicer gun than the Undisclosed Police Department gave Detective Freeman would have amused me if I wasn’t busy picturing the kid pumping six bullets into my forehead with it.\u003c/p\u003e\n\u003cp\u003eAgain, I heard myself speaking. A single word that to me, had no meaning.\u003c/p\u003e\n\u003cp\u003e“Creech.”\u003c/p\u003e\n\u003cp\u003eMy soy sauced brain had officially taken off without me. I was operating on autopilot, phrases and words scrolling up into my mind as if fed to me on a teleprompter.\u003c/p\u003e\n\u003cp\u003eThe kid said nothing.\u003c/p\u003e\n\u003cp\u003eHe reached into his jacket . . .\u003c/p\u003e\n\u003cp\u003eAnd pulled out an envelope.\u003c/p\u003e\n\u003cp\u003eHe stepped up and gave me a hug, slipping the envelope to me in one smooth, practiced motion.\u003c/p\u003e\n\u003cp\u003eAs the kid turned away, I slowly let out the breath I had been holding.\u003c/p\u003e\n\u003cp\u003eI would like to reiterate: what the fuck.\u003c/p\u003e\n\u003cp\u003eBack in the car, I pulled the envelope out, opened it, saw it was stuffed full of hundred-dollar bills. I had no idea what any of that was, only that speaking those words to that person would get me cash, like a complicated PIN at an ATM machine.\u003c/p\u003e\n\u003cp\u003eI counted six thousand dollars.\u003c/p\u003e\n\u003cp\u003eAlrighty.\u003c/p\u003e\n\u003cp\u003eWithout knowing my destination, I drove directly to the Merry Nation Bar and Grill, six blocks away. I went to the parking lot and glanced around, still without any real idea of what I was looking for.\u003c/p\u003e\n\u003cp\u003eI went right to a cobalt-blue Dodge pickup that I had never seen in my life. I found it unlocked, reached in, felt around under the seat.\u003c/p\u003e\n\u003cp\u003eI pulled out a satin-finish steel automatic handgun.\u003c/p\u003e\n\u003cp\u003eFully loaded.\u003c/p\u003e\n\u003cp\u003eGod bless America.\u003c/p\u003e\n\u003cp\u003eI stuck the gun in the back of my pants, felt strangely comforted by its gouge into the small of my back as I sat back down in the Hyundai. Evening had set in now, on one of the longest, most retarded days of my life.\u003c/p\u003e\n\u003cp\u003eI was about to point the car west, then realized I didn’t want to drive for over 1,500 miles—\u003c/p\u003e\n\u003cp\u003e1,669\u003c/p\u003e\n\u003cp\u003e—in these shit-stained pants and bloodstained shirt.\u003c/p\u003e\n\u003cp\u003eI drove home to change, proving that even on the soy sauce, part of me was still a dumbass.\u003c/p\u003e\n\u003cp\u003eI THREW THE clothes in the trash and showered, paranoid the whole time,\u003c/p\u003e\n\u003cp\u003ethinking I was hearing opening doors and floor creaks and murderous things bumping around outside the shower curtain. It had been that kind of a day.\u003c/p\u003e\n\u003cp\u003eI dressed and put on Band-Aids, collected my toothbrush and a comb and contact lens fluid and dumped it into my leather duffel bag.\u003c/p\u003e\n\u003cp\u003eI flung myself down the hall—\u003c/p\u003e\n\u003cp\u003eI stopped cold.\u003c/p\u003e\n\u003cp\u003eMy bag fell from my hand with a soft thud.\u003c/p\u003e\n\u003cp\u003eA teenager stood there. Right in the middle of my living room, a space that had been proudly teenager-free for years.\u003c/p\u003e\n\u003cp\u003eBraces.\u003c/p\u003e\n\u003cp\u003eBlack Limp Bizkit T-shirt.\u003c/p\u003e\n\u003cp\u003eI said, “Justin?”\u003c/p\u003e\n\u003cp\u003eStanding there with a shit-eating grin on its face, the thing that had been Justin opened its mouth and emitted a rumbling sound, like something boiling up from his lungs. After a moment he closed it again.\u003c/p\u003e\n\u003cp\u003eHe gathered himself and said brightly, “Why you frontin’ here? You know what time it is. Stop callin’ me Justin like nothin’s changed, yo.”\u003c/p\u003e\n\u003cp\u003eI pictured swarms of white worms twitching through his bloodstream and suddenly had to fight the impulse to run away screaming like a toddler.\u003c/p\u003e\n\u003cp\u003eI took a step back.\u003c/p\u003e\n\u003cp\u003eJustin took a step forward.\u003c/p\u003e\n\u003cp\u003eBuying time, I asked, “What should I call you?”\u003c/p\u003e\n\u003cp\u003eI shifted my feet, felt the nudge of the gun against my lower back. I had never fired a gun before, and certainly never fired one at a man. The thought brought cool sweat to my forehead and a hot, jittery anticipation. Not entirely unpleasant. I had felt it before. \u003c/p\u003e","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-21.html","bookId":2487,"creation":"Oct 5, 2019 10:38:24 PM","modification":"Oct 5, 2019 10:38:24 PM"}
