{"id":104696,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJohn nodded, as if he were committing this to memory. He lit his own firebombs, glanced up at me and asked, “You got any final requests, in case this don’t end well?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Avenge my death.”\u003c/p\u003e\n\u003cp\u003eWE WERE POSITIONED in a circle by the front of the door, each with a high-proof cocktail in each hand. I studied the small orange-and-blue flame dancing on the bundle of wet cloth crammed into the bottle. My heart hammered. Molly whimpered behind me.\u003c/p\u003e\n\u003cp\u003eThe moments oozed out like ketchup from a glass bottle. I could hear Jim breathing next to me, felt a trickle of sweat roll down my temple.\u003c/p\u003e\n\u003cp\u003eThe latch clicked and scraped. Every muscle in my body tensed. I looked down and squeezed the beer bottle in my hand.\u003c/p\u003e\n\u003cp\u003eJesus, we are going to die, we are actually going to die here.\u003c/p\u003e\n\u003cp\u003eThe door slowly ground up in its tracks. A band of pale moonlight appeared at the floor, a stiff wind whistling in as the door slid upward. There he was, revealed from the shins up. Jeans and shirt and—\u003c/p\u003e\n\u003cp\u003eOh, holy shit.\u003c/p\u003e\n\u003cp\u003eJustin looked mostly normal, skin pale under the moonlight, blond hair rustling in the stiff breeze, a pimple on his chin. Only now both of his eyes were protruding about six inches from his skull.\u003c/p\u003e\n\u003cp\u003eThe pupils at the end of their new white-and-pink stalks twisted horribly in our direction, staring at us for a very long and terrible moment. We were so caught off guard by this that it killed our momentum, all of us frozen and expecting the person next to them to make the first move.\u003c/p\u003e\n\u003cp\u003eTo Jennifer’s credit, she broke the paralysis by weakly tossing a flaming bottle at Justin. The Justin monster watched as it missed and bounced harmlessly to the ground, rolling to a stop. The wick flickered and went out. Shitload curled his twin optical skull-erections down and looked at the sad bottle draining its contents into the dirt. After a moment he turned back up to us and said, “Put that shit down and come with me, fools.”\u003c/p\u003e\n\u003cp\u003eHe backed away from us, seeming to realize his eyes were dangling from his skull and in a series of sickening, jerky neck movements sucked them back in.\u003c/p\u003e\n\u003cp\u003eWe stood there for a moment, looked at each other with a kind of deflated shame and defeat, then did what he said.\u003c/p\u003e\n\u003cp\u003eThey were waiting for me, I realized, too late. They were waiting for me to push the attack, to lead them.\u003c/p\u003e\n\u003cp\u003eWelcome aboard the David Wong Disappointment Train, fuckers.\u003c/p\u003e\n\u003cp\u003eWe weren’t in Vegas. A quick glance around showed we were squarely in the middle of rural nowhere. It was a windy night and in small-town Nevada that apparently means dust. Justin, the hybrid walking demon hive and Limp Bizkit fan, led us across a dusty yard onto a paint-peeled dusty porch where a pair of ancient and very dusty shoes sat mummifying in the dusty desert air.\u003c/p\u003e\n\u003cp\u003eThe door was ajar and had only a perfectly round hole where the knob should have been.\u003c/p\u003e\n\u003cp\u003ePropped next to the door was a dust-covered but new FedEx box, which almost certainly was a delivery mistake since this place looked to be in its tenth year of vacancy.\u003c/p\u003e\n\u003cp\u003eJustin pushed in through the door, indifferently kicking the box inside as he passed.\u003c/p\u003e\n\u003cp\u003eAs we moved inside I noticed for the first time that Justin had an old, mud-smeared glass jar in his hand and I vaguely remembered seeing it or one just like it in the Jamaican’s makeshift basement. He placed it on the floor and walked around to us one by one, arranging our bodies, seated, in a semicircle around it. I saw a speech coming and could only pray that I wouldn’t come out sounding like a white kid raised next to a cornfield trying to record interlude skits for a gang-sta rap album.\u003c/p\u003e\n\u003cp\u003eShitload said, “This world is shit, yo.”\u003c/p\u003e\n\u003cp\u003eOh, goddamnit.\u003c/p\u003e\n\u003cp\u003e“How do you people be gettin’ around in this, all in these bodies and shit? You act all scared that I’m gonna kill ya, when it’s the best thing I could do for you, yo. Deadworld, man, it’s alternate layers of rot and shit and rot and shit.”\u003c/p\u003e\n\u003cp\u003eI looked around the dim group, saw moonlight from the window cracks reflecting off of tears on Jennifer’s cheeks. Big Jim had his eyes closed, maybe in prayer. Fred Chu looked around as if uninterested, stroking his goatee with one hand and fidgeting with a strip of carpet foam with the other. John was staring vacantly at a spot on the other side of the room, already distracted into a dull stupor. Molly licked her crotch.\u003c/p\u003e\n\u003cp\u003eLadies and gentlemen: The Undisclosed Hell-Conqueror Strike Force!\u003c/p\u003e\n\u003cp\u003eTo at least feel like I was doing something, I said, “Deadworld? Is that where you’re from?”\u003c/p\u003e\n\u003cp\u003e“No, dude. That’s where you’re from. It’s where we are now. This place, it’s a horror show. If the guy next to you decides to knock you out of this world forever, he can do it with just a piece of metal or, hell, even his bare hand. You blobs, you sit there, chillin’ in this room and I can smell the rot of dead animals soaking in the acid of your guts. You suck the life from the innocent creatures of this world just so you can clock another day. You’re machines that run on the terror and pain and mutilation of other lives. You’ll scrape the world clean of every green and living thing until starvation goes one-eight-seven on every one of your sorry asses, your desperation to put off death leadin’ to the ultimate death of everybody and everything. Dude, I can’t believe you ain’t all paralyzed by the pure, naked horror of this place.”\u003c/p\u003e\n\u003cp\u003eAfter a long, long pause John said, “Uh, thank you.”\u003c/p\u003e\n\u003cp\u003eJohn’s eyes never moved as he spoke, and suddenly I saw a look there, a confidence. I followed his gaze, saw what he was seeing, and then quickly looked away again.\u003c/p\u003e\n\u003cp\u003eI glanced back at the Justin monster, wondering if he had caught on. But he was busy. He twisted the lid off the old pickle jar, and a small, shriveled thing, like a dried-up earthworm, dropped out and landed quietly on the floor.\u003c/p\u003e\n\u003cp\u003eShitload went to the kitchen and I heard him messing around with the sink in there. No water. He came back, studied our faces, and pointed to Fred.\u003c/p\u003e\n\u003cp\u003e“Piss on it,” he commanded.\u003c/p\u003e\n\u003cp\u003eI was so baffled by this that I wasn’t even sure I had heard him right. But Fred, having perfected going with the flow to a degree that philosophers could study for centuries, shrugged and said, “Okay.”\u003c/p\u003e\n\u003cp\u003eHe stood, unzipped, urinated on the floor, zipped up and sat back down. The little black dried-worm sliver sat in the middle of the bubbling puddle. Nothing for a long time, maybe a minute.\u003c/p\u003e\n\u003cp\u003eAnd then, the worm twitched.\u003c/p\u003e\n\u003cp\u003eJennifer screamed, everybody jumped.\u003c/p\u003e\n\u003cp\u003eThe shriveled nothing grew. And grew. And grew.\u003c/p\u003e\n\u003cp\u003eJust add water!\u003c/p\u003e\n\u003cp\u003eA hand formed. A human hand, pink and the size of a baby’s. Stretching out from behind it, instead of an arm, was something like an insect leg. It was a foot long, springing out to length before our eyes like a radio antenna. Something like a shell took shape. I saw an eye, red and clustered like a fly’s. Another eye, this one with a round pupil, like a mammal, grew in next to it. Then another eye, yellow with a black slit down the center. Reptilian.\u003c/p\u003e\n\u003cp\u003eThe thing grew and grew some more. It grew to the size of a rabbit, then a small dog, then stopped when it was about a foot-and-a-half high and maybe three feet wide, probably the same overall mass as Molly.\u003c/p\u003e\n\u003cp\u003eThe finished creature seemed to be assembled from spare parts. It had a tail like a scorpion curling up off its back. It walked on seven—yes, seven—legs, each ending in one of those small, pink infantile hands. It had a head that was sort of an inverted heart shape, a bank of mismatched eyes in an arc over a hooked, black beak, like a parrot’s. On its head, no kidding, it had a tuft of neatly groomed blond hair that I swear on my mother’s grave was a wig, held on with a rubber band chinstrap.\u003c/p\u003e\n\u003cp\u003eWhat was strange about it, or rather, what was stranger about it was that the two sections of its body—the hindquarters and the abdomen—were not connected. There was a good two inches of space between them and when it turned sideways you could see right through the thing. But it moved in unison, as if they were connected by invisible tissue.\u003c/p\u003e\n\u003cp\u003eThe little monster stood twitching there on the floor like a newborn calf, still dripping with urine.\u003c/p\u003e\n\u003cp\u003eJohn said, “Huh.”\u003c/p\u003e\n\u003cp\u003eFred said, “Guys, can you all see that fuckin’ thing, or is it just me?”\u003c/p\u003e\n\u003cp\u003eThe beast moved in circles, looking around the room. Justin said to us, “Don’t move. If I ask it to, it’ll kill you, yo. You don’t know what that thing’s capable of. Shit, lookin’ at the thing, I don’t even think it knows. But that ain’t my goal, I coulda capped you all back home if that was the plan. It ain’t.”\u003c/p\u003e\n\u003cp\u003eThe thing turned and turned, staring down each of us, its dozen eyes blinking at different intervals. It finally stopped, looking my direction. Molly stirred behind me, a low growl rising from her.\u003c/p\u003e\n\u003cp\u003e“All I need you to do is hold still, yo. In a minute ain’t none of you gonna remember why you got all worked up and shit.”\u003c/p\u003e\n\u003cp\u003eThe creature crouched, then vanished in a blur. I threw myself back, expected the monster to suddenly be on me, but it wasn’t. I heard a horrible, high-pitched yelp behind me and turned to find the monster on Molly’s back, its legs wrapped around her body, dug into her fur like steel cables.\u003c/p\u003e\n\u003cp\u003eJennifer screamed, everyone stirred. Justin shouted at us to stay down, stay down. I watched as the thing whipped back that scorpion tail (Did I say it was like a scorpion? The freaking tail had hair on it.) and with a flick, the end was buried in the dog’s hide. The length of the tail started pulsing and twitching. It was pumping something into her.\u003c/p\u003e\n\u003cp\u003eMolly whimpered.\u003c/p\u003e\n\u003cp\u003eAnd then it was over. The beast jumped off. Molly looked terrorized but kept her feet. I saw the tip of the monster’s scorpion tail and noticed a drip of thick, black fluid trickling out.\u003c/p\u003e\n\u003cp\u003eSoy sauce.\u003c/p\u003e\n\u003cp\u003eWait. What? That’s where it comes from?\u003c/p\u003e\n\u003cp\u003eA burst of movement, behind me. Shuffling feet and shouts.\u003c/p\u003e\n\u003cp\u003eJohn was making his move, diving in the direction we had been looking earlier. He skidded on the floor and seized the white FedEx box.\u003c/p\u003e\n\u003cp\u003eShitload was on him fast, Bruce Lee–fast. He delivered a kick to John’s gut that actually knocked him back a couple of feet. He then wrenched the box from John’s arms. Shitload looked baffled, moved to throw the box aside but stopped cold.\u003c/p\u003e\n\u003cp\u003eHe looked at the label, then at John, then at me, then at the label again. I stood and moved slowly toward them. \u003c/p\u003e","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-24.html","bookId":2487,"creation":"Oct 5, 2019 10:38:24 PM","modification":"Oct 5, 2019 10:38:24 PM"}
