{"id":104721,"no":49,"title":"Page 49","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCHAPTER 12\u003c/p\u003e\n\u003cp\u003eAmy\u003c/p\u003e\n\u003cp\u003eI FOLLOWED MY own tire tracks as I made my way back through town. I kept the dome light on and threw nervous glances behind me every four seconds or so. At Amy’s house I found John hunched under the hood of his Cadillac. I walked past him, the horrible news coiled inside me like one of those chest-bursters from Alien. I said, “Your battery dead?”\u003c/p\u003e\n\u003cp\u003e“I hope not.” I noticed a set of jumper cables coiled in the snow around his feet. Hooked around one elbow was a knotted string of what looked like Christmas tree lights. “Christmas is coming late for that motherfucker. As soon as I find it. You got my gloves?”\u003c/p\u003e\n\u003cp\u003e“Uh, no.”\u003c/p\u003e\n\u003cp\u003e“Okay . . . can I have a brownie?”\u003c/p\u003e\n\u003cp\u003eHe caught a glimpse of my face as I passed. He stood upright, alarmed. “Dave? What’s up? Did you change your shirt?”\u003c/p\u003e\n\u003cp\u003e“Put that stuff back. I, uh, think I got it figured out.”\u003c/p\u003e\n\u003cp\u003e“What? You do?”\u003c/p\u003e\n\u003cp\u003eI stepped into the warm house, thinking this was going to be another of life’s little awkward conversations. I absently rubbed the cold from my fingers. I heard John approach the door and suddenly ideas hit me, quick and desperate. Panicked wild fastballs of thought.\u003c/p\u003e\n\u003cp\u003eI could tell them it was an accident.\u003c/p\u003e\n\u003cp\u003eYeah. You can make it work. You can march people up to testify about the time you severed an artery in your arm trying to carve a pumpkin. You can pull the emergency room records from the time Jennifer had to rush you to get half a cup of candle wax scraped off of your scrotum. There was the hot glue-gun incident. People would believe it, would see that you’re not a murderer but are merely an incredible dumb-ass. You see, officer, I was driving past the house and I observed through the window what appeared to be some kind of shaved baboon, apparently escaped from a nearby circus. The animal was clearly thin and malnourished, which I believed made it an even greater threat to the inhabitants of the home. Naturally I produced a weapon and subdued the creature with a single gunshot. Now, interestingly, it was at this moment that my penis accidentally fell out and I found myself—\u003c/p\u003e\n\u003cp\u003eCRUNK. CREEE-UNK.\u003c/p\u003e\n\u003cp\u003eAbove me.\u003c/p\u003e\n\u003cp\u003eCreaking floorboards.\u003c/p\u003e\n\u003cp\u003eI stopped, held my breath, listened. The wind? Above me, a door clicked shut.\u003c/p\u003e\n\u003cp\u003eI stepped quickly and softly toward the stairs, eyes on the darkened doorway at the top. I glanced back at John, the startled look on his face told me he hadn’t invited any company over. I pulled the Smith from my coat and pointed it up the stairs.\u003c/p\u003e\n\u003cp\u003eCome on down, fuckers. Come on down. Come see David on the worst day of his life, destined for forever in jail or worse, still with fourteen bullets left to spend. Whatever you are, you picked the goddamned staircase on the wrong goddamned day.\u003c/p\u003e\n\u003cp\u003eCome on down.\u003c/p\u003e\n\u003cp\u003eI heard another door open, then close. Are the most dangerous creatures the ones that use doors or the ones that don’t?\u003c/p\u003e\n\u003cp\u003eI eased myself up the stairs one at a time, softly. My feet hit the creaky wood floor of the hallway. Every door in the hall was closed but one, the bedroom. The library seemed like the logical one to check first. I quietly cranked the brass knob until the door clicked free. Nothing but darkness. I tried the light and it came right on.\u003c/p\u003e\n\u003cp\u003eNo jellyfish.\u003c/p\u003e\n\u003cp\u003eI backed out, took a step and tried the door on my right. The bathroom. No need for the light. I could see right away that the room was empty and—look at that—the fat bag was gone.\u003c/p\u003e\n\u003cp\u003eToward the bedroom now, the gun in front of me in both hands, arms rigid, like the turret on a tank. The old sensations again, blood pumping past my ears, sparks flying in my brain, that cool sweat again. My clothes must have stank of it.\u003c/p\u003e\n\u003cp\u003eSomething moved in the shadows.\u003c/p\u003e\n\u003cp\u003eA thin figure, almost as tall as a man.\u003c/p\u003e\n\u003cp\u003eA gray torso, like a rhino.\u003c/p\u003e\n\u003cp\u003eIt saw me and froze.\u003c/p\u003e\n\u003cp\u003eA trickle of sweat crawled down my forehead, landing as a burning speck in my left eye.\u003c/p\u003e\n\u003cp\u003eHoly shit! It’s a shaved baboon!\u003c/p\u003e\n\u003cp\u003eThrough the sights of the pistol I saw a young, very thin and pale girl draped in a gray University of Notre Dame sweatshirt that she wore like a dress.\u003c/p\u003e\n\u003cp\u003eI said, “Oh! Amy! Hey!”\u003c/p\u003e\n\u003cp\u003eAn avalanche of relief buried every thought in my mind.\u003c/p\u003e\n\u003cp\u003eAmy took several steps backward. She was holding a toothbrush and was nervously rubbing the bristles with her thumb as she retreated toward her door. Her other arm ended in an empty sleeve.\u003c/p\u003e\n\u003cp\u003e“Hi,” she said, in a too-loud squeak. “Can I, uh, help you?”\u003c/p\u003e\n\u003cp\u003e“No, no. It’s fine. We were just worried about—”\u003c/p\u003e\n\u003cp\u003eI made a huge mistake. I reached out, casually, I thought (it’s hard to come off casual with a gun in your other hand, I guess) to take her arm. I had to see if it was her, if she was solid.\u003c/p\u003e\n\u003cp\u003eI wrapped my fingers around a very solid and very real forearm, but then she pulled away and when I went to catch the spot where her hand would be, I grabbed only air.\u003c/p\u003e\n\u003cp\u003eShe ducked back through her bedroom door and slammed it shut. I looked stupidly down at my empty fingers and realized two things:\u003c/p\u003e\n\u003cp\u003eAmy Sullivan was alive, and she no longer had a left hand.\u003c/p\u003e\n\u003cp\u003e“Wait! Hey!” I said, screaming and pounding on the door while wielding a handgun, in exactly the way an armed rapist would. “It’s me!”\u003c/p\u003e\n\u003cp\u003e“Okay!” She said as I heard something scoot across the floor and jolt the doorknob. She had braced the door with some piece of furniture, probably the chest of drawers.\u003c/p\u003e\n\u003cp\u003e“No! It’s fine! I’m not armed! I mean, I’m armed, but not in a bad way. We’ve been looking all over for you.”\u003c/p\u003e\n\u003cp\u003e“I’m here!” She said in the artificial-sweetener tones you’d use to soothe a rabid dog. “You can leave!”\u003c/p\u003e\n\u003cp\u003eI stuffed the gun in my jacket pocket and leaned toward the door. “Hey, where have you been?”\u003c/p\u003e\n\u003cp\u003eNothing from inside. I could hear her talking faintly in there, like she was mumbling to herself. Poor kid.\u003c/p\u003e\n\u003cp\u003eI wandered back to the stairs, one question answered with several dozen new ones replacing it. First off, who did I kill?\u003c/p\u003e\n\u003cp\u003eJohn came up the steps, saying, “Who was talking up here?”\u003c/p\u003e\n\u003cp\u003e“I found her. She was in her bedroom.”\u003c/p\u003e\n\u003cp\u003eHe glanced that way and said, “Damn. You’re good. So, she was here the whole time? Like, folded up in a desk drawer?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, John. And I don’t care. She wants us to leave.”\u003c/p\u003e\n\u003cp\u003e“You sure?”\u003c/p\u003e\n\u003cp\u003e“John, we have to talk.”\u003c/p\u003e\n\u003cp\u003eI turned him around and we stepped down into the living room, just in time to see red-and-blue lights pulsing across the bay window. We reached the front door just as Officer Drake pushed his way in.\u003c/p\u003e\n\u003cp\u003e“What’s the deal?” Drake said, brushing snow off his shoulders. “We got a nine-one-one call from Amy saying there was an armed man in the house.”\u003c/p\u003e\n\u003cp\u003eDRAKE WENT UPSTAIRS to calm Amy down while John and I waited down at the diner-style chrome-and-green table in her kitchen. John pulled out a small package of what looked like tobacco and asked, “You think she’d mind if I smoked in here?”\u003c/p\u003e\n\u003cp\u003e“John, I killed somebody.”\u003c/p\u003e\n\u003cp\u003eAs the words hung in the air I had a split second to wonder how many people had ever uttered them and still gone on to live happy lives.\u003c/p\u003e\n\u003cp\u003eI said, “There’s a body in my toolshed.”\u003c/p\u003e\n\u003cp\u003e“Is it Jeff Wolflake? Does that mean the manager job is open?”\u003c/p\u003e\n\u003cp\u003e“No. A guy showed up, a guy but maybe not a guy, on the way home. He put a thing on me like a slug or something and asked me a bunch of questions.”\u003c/p\u003e\n\u003cp\u003e“And you killed him.”\u003c/p\u003e\n\u003cp\u003e“No, no. He got away. I killed some other person, completely unrelated to that guy apparently. I was just putting that out there.”\u003c/p\u003e\n\u003cp\u003e“Okay, so who is it?”\u003c/p\u003e\n\u003cp\u003e“Dunno. I didn’t check. I remember doing it, though, sort of. I shot them with the Smith. There’s a bullet missing and everything. I remember doing it but I don’t remember wanting to do it.”\u003c/p\u003e\n\u003cp\u003eJohn eyed me carefully. He looked away and pulled his hair back, then tied it with a rubber band. He pulled out a small box and shook out a rolling paper, then opened the tobacco.\u003c/p\u003e\n\u003cp\u003eHe said, “You think it was like the thing with Danny Wexler? The demon thing we ran into at the mall?”\u003c/p\u003e\n\u003cp\u003eAt the mall, he says. Like we saw it folding pants at American Eagle.\u003c/p\u003e\n\u003cp\u003eI serve none but Korrok.\u003c/p\u003e\n\u003cp\u003e“You know,” he said, “the way they could take hold of people, move them around like puppets? Then you shot me?”\u003c/p\u003e\n\u003cp\u003e“You gonna bring that up again?”\u003c/p\u003e\n\u003cp\u003e“You think it was Jennifer you killed?”\u003c/p\u003e\n\u003cp\u003eI hadn’t thought of that.\u003c/p\u003e\n\u003cp\u003e“No, I . . . I mean that was amicable, right?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003eI pulled out my cell phone and pulled Jennifer Lopez’s number off my speed-dial menu. One ring. Then three. Then six. Eight. Finally . . .\u003c/p\u003e\n\u003cp\u003e“Mmmm . . . hello?”\u003c/p\u003e\n\u003cp\u003eI knew the voice. Sleepy and drunk, sure, but hers. I broke the connection.\u003c/p\u003e\n\u003cp\u003e“She’s there,” I said.\u003c/p\u003e\n\u003cp\u003e“Well, that’s everybody you know.”\u003c/p\u003e\n\u003cp\u003e“But if it was . . . that thing controlling me, it wouldn’t be somebody I wanted dead. It would be somebody it wanted dead.”\u003c/p\u003e\n\u003cp\u003eHoly shit, this is madness.\u003c/p\u003e\n\u003cp\u003eJohn said, “So it could happen again?”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to respond, then closed it. I actually hadn’t thought of that, either. John started laboriously sprinkling tobacco onto a cigarette paper.\u003c/p\u003e\n\u003cp\u003eI said, “She may not want you to smoke that in here, John.”\u003c/p\u003e\n\u003cp\u003e“Eh, I gotta make them ahead of time anyway. I get the urge to smoke, I don’t wanna sit and mess with it. You get the tobacco too clumped in the middle and it doesn’t stay lit. Rolling is a pain in the ass.”\u003c/p\u003e\n\u003cp\u003e“You know, I think you can buy them now where they’re already made.” He started rolling the thing, unrolled it, tried again.\u003c/p\u003e\n\u003cp\u003eI lowered my voice and leaned in. “Hey, John, when I saw Amy, I think her hand was missing.”\u003c/p\u003e\n\u003cp\u003e“Well, yeah. It’s been like that for a long time. She was in an accident.”\u003c/p\u003e\n\u003cp\u003e“Oh. And she lives here alone?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Why?”\u003c/p\u003e\n\u003cp\u003e“There’s nobody who, you know, comes by to take care of her?” \u003c/p\u003e","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-49.html","bookId":2487,"creation":"Oct 5, 2019 10:38:25 PM","modification":"Oct 5, 2019 10:38:25 PM"}
