{"id":104677,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI squinted. In half a second I counted 5,829 grains of rice on her plate. The rice was grown in Arkansas. The guy who ran the harvester was nicknamed “Cooter.”\u003c/p\u003e\n\u003cp\u003eI’m not a genius, as my dad and all my old teachers at Undisclosed Eastern High School will inform you with even the slightest provocation. I’m not psychic, either. Just side effects, that’s all.\u003c/p\u003e\n\u003cp\u003eThe shakes again. A quick, fluttery wave, like the adrenaline rush you get when you lean your chair too far past the tipping point. Might as well wait it out, I guess. I was still waiting on my “Flaming Shrimp Reunion,” a dish I ordered just to see what it looked like. I wasn’t hungry.\u003c/p\u003e\n\u003cp\u003eA flatware set was wrapped in a napkin on the table in front of me. A few inches away was my glass of iced tea; a few inches from that was another object, one I didn’t feel like thinking about right then. I unwrapped my utensils. I closed my eyes and touched the fork, immediately knew it was manufactured in Pennsylvania six years ago, on a Thursday, and that a guy had once used it to scrape a piece of dog shit from his shoe.\u003c/p\u003e\n\u003cp\u003eYou’ve just gotta make it through a couple of days of this, said my own voice again from inside my skull. You’ll open your eyes tomorrow or the next day and everything will be okay again. Well, mostly okay. You’ll still be ugly and kind of stupid and you’ll occasionally see things that make you—\u003c/p\u003e\n\u003cp\u003eI did open my eyes, and jerked in shock. A man was sitting across from me in the booth. I hadn’t heard or felt or smelled him when he slid into the seat. Was this the reporter I spoke to on the phone?\u003c/p\u003e\n\u003cp\u003eOr a ninja?\u003c/p\u003e\n\u003cp\u003e“Hey,” I mumbled. “Are you Arnie?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Did you doze off there?” He shook my hand.\u003c/p\u003e\n\u003cp\u003e“Uh, no. I was just tryin’ to rub somethin’ off the back of my eyelid. I’m David Wong. Good to meet ya.”\u003c/p\u003e\n\u003cp\u003e“Sorry I’m late.”\u003c/p\u003e\n\u003cp\u003eArnie Blondestone looked just like I imagined him. He was older, uneven haircut and a bad mustache, a wide face made for a cigar. He wore a gray suit that looked older than I was, a tie with a fat Windsor knot.\u003c/p\u003e\n\u003cp\u003eHe had told me he was a reporter for a national magazine and wanted to do a feature on me and my friend John. It wasn’t the first request like this, but it was the first one I had agreed to. I looked the guy up on the Web, found out he did quirky little human-interest bits, Charles Kuralt stuff. One article about a guy who obsessively collects old lightbulbs and paints landscapes on them, another about a lady with six hundred cats, that sort of thing. It’s what polite people have instead of freak shows I guess, stories we can laugh at around the coffee machines in the office break room.\u003c/p\u003e\n\u003cp\u003eArnie’s gaze stayed on my face a little too long, taking in my beads of cold sweat, my pale skin, the thatch of overgrown hair. Instead of pointing out any of that, Arnie said, “You don’t look Asian, Mr. Wong.”\u003c/p\u003e\n\u003cp\u003e“I’m not. I was born in [Undisclosed]. I had the name changed. Thought it would make me harder to find.”\u003c/p\u003e\n\u003cp\u003eArnie gave me the first of what I assumed would be many, many skeptical looks. “How so?”\u003c/p\u003e\n\u003cp\u003eI half closed my eyes, my mind flooding with images of the 103 billion humans who have been born since the species appeared. A sea of people living, dying and multiplying like cells in a single organism. I squeezed my eyes shut, trying to clear my mind by focusing on a mental image of the waitress’s boobs.\u003c/p\u003e\n\u003cp\u003eI said, “Wong is the most common surname in the world. You try to Google it, you’ve got a shitload of results to sift through before you get to me.”\u003c/p\u003e\n\u003cp\u003eHe said, “Okay. Your family live around here?”\u003c/p\u003e\n\u003cp\u003eGetting right to it, then.\u003c/p\u003e\n\u003cp\u003e“I was adopted. Never knew my real dad. You could be my dad, for all I know. Are you my dad?”\u003c/p\u003e\n\u003cp\u003e“Eh, I don’t think so.”\u003c/p\u003e\n\u003cp\u003eI tried to figure out if these were warm-up questions to prime the interview pump, or if he already knew. I suspected the latter.\u003c/p\u003e\n\u003cp\u003eMight as well go all-in. That’s why we’re here, right?\u003c/p\u003e\n\u003cp\u003e“My adopted family moved away, I won’t tell you where they are. But get out your pen because you’ll want to write this down. My biological mom? She was institutionalized.”\u003c/p\u003e\n\u003cp\u003e“That must have been hard. What was the—”\u003c/p\u003e\n\u003cp\u003e“She was a strung-out, crank-addicted cannibal, dabbled in vampirism and shamanism. My mom, she worshipped some major devil when I was a toddler. Blew her welfare check every month on black candles. Sure, Satan would do her favors now and then, but there’s always a catch with the Devil. Always a catch.”\u003c/p\u003e\n\u003cp\u003eA pause from Arnie, then, “Is that true?”\u003c/p\u003e\n\u003cp\u003e“No. This, this silliness, it’s what I do when I’m nervous. She was bipolar, that’s all. Couldn’t keep a house. Isn’t the other story better, though? You should use it.”\u003c/p\u003e\n\u003cp\u003eArnie gave me a practiced look of reporterly sincerity and said, “I thought you wanted to get the truth out, your side of it. If not, then why are we even here, Mr. Wong?”\u003c/p\u003e\n\u003cp\u003eBecause I let women talk me into things.\u003c/p\u003e\n\u003cp\u003e“You’re right. Sorry.”\u003c/p\u003e\n\u003cp\u003e“Now, since we broached the subject, you spent your senior year in high school in an alternative program . . .”\u003c/p\u003e\n\u003cp\u003e“Yeah, that was just a misunderstanding,” I lied. “They have this label, ‘Emotionally Disturbed’ that they put on you, but it was just a couple of fights. Kid stuff, no charges or anything. Craziness is not hereditary.”\u003c/p\u003e\n\u003cp\u003eArnie eyed me, both of us aware of the fact that juvenile records are sealed from public viewing and that he would have to take my word for it. I wondered how this would end up in his article, especially in light of the utter batshit insanity of the story I was about to share.\u003c/p\u003e\n\u003cp\u003eHe moved his gaze to the other object on the table, from his perspective, a small, innocent-looking container. It was about the size and shape of a spool of thread, made of flat, brushed metal. I rested my fingers on it. The surface was icy to the touch, like it had spent all night in the freezer. If you set the thing out in the hot sun from morning to night it would still feel that way. You could mistake it for a stylish pill bottle, I suppose.\u003c/p\u003e\n\u003cp\u003eI could blow your world away, Arnie. If I showed you what was in this container, you’d never sleep another full night, never really lose yourself in a movie again, never feel at one with the human race until the day you die. But we’re not ready for that, not yet. And you sure as hell won’t be ready for what’s in my truck. . . .\u003c/p\u003e\n\u003cp\u003e“Well,” Arnie began again, “either way, mental illness is nothing to be ashamed of. We just get sick from time to time, part of being human, you know? For instance, I was just talking to a guy up north, a high-priced lawyer-type who spent two weeks in the psych ward himself a little while ago. Name of Frank Campo. You know that name?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I knew him a little.”\u003c/p\u003e\n\u003cp\u003e“Frank wouldn’t talk to me, but his family said he was having hallucinations. Almost daily, right? Guy had this car wreck and from then on he just got worse and worse. He freaked out at Thanksgiving. Wife brought in the turkey, but to Frank, it wasn’t a turkey. Frank saw a human baby, curled up on the platter, cooked to a golden brown. Stuffing jammed in its mouth. He went nuts, wouldn’t eat for weeks after that. He got to where he was having incidents every few days. They figured it was brain damage, you know, from the accident. But the doctors couldn’t do squat. Right?”\u003c/p\u003e\n\u003cp\u003e“Yeah. That’s about it.”\u003c/p\u003e\n\u003cp\u003eYou skipped over the weirdest part, Arnie. What caused the accident in the first place. And what he saw in his car. . . .\u003c/p\u003e\n\u003cp\u003e“And now,” said Arnie, “he’s cured.”\u003c/p\u003e\n\u003cp\u003e“Is that what they say? Good for him, then. Good for Frank.”\u003c/p\u003e\n\u003cp\u003e“And they swear that it was you and your friend who cured him.”\u003c/p\u003e\n\u003cp\u003e“Me and John, yeah. We did what we could. But good for Frank. I’m glad to hear he’s okay.”\u003c/p\u003e\n\u003cp\u003eA little smile played at Arnie’s lips. Acidic. Look at the crazy man with his incompetent, crazy-man haircut and his crazy little pill bottle and his crazy fucking story.\u003c/p\u003e\n\u003cp\u003eHow many decades of cynicism did it take to forge that smirk, Arnie? It makes me tired just looking at it.\u003c/p\u003e\n\u003cp\u003e“Tell me about John.”\u003c/p\u003e\n\u003cp\u003e“Like what? In his midtwenties. We went to school together. John isn’t his real name, either.”\u003c/p\u003e\n\u003cp\u003e“Let me guess . . .”\u003c/p\u003e\n\u003cp\u003eThe images start to rush in again, the mass of humanity spreading across the globe over centuries like a time-lapse video of mold taking over an orange. Think of the boobs. Boobs. Boobs. Boobs.\u003c/p\u003e\n\u003cp\u003e“. . . John is the most common first name in the world.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” I said. “And yet there’s not a single person named John Wong. I looked it up.”\u003c/p\u003e\n\u003cp\u003e“You know, I work with a John Wong.”\u003c/p\u003e\n\u003cp\u003e“Oh, really?”\u003c/p\u003e\n\u003cp\u003e“Let’s move on,” Arnie said, probably making a mental note that this David Wong guy isn’t above just making shit up.\u003c/p\u003e\n\u003cp\u003eHoly crap, Arnie, just wait until you hear the rest of the story. If your bullshit meter is that finely tuned, in a few minutes it’s liable to explode and take half a city block with it.\u003c/p\u003e\n\u003cp\u003e“You guys already got a little bit of a following, don’t you?” he said, flipping back to a page in a little notebook already riddled with scribbles. “I found a couple of discussion boards on the Web devoted to you and your friend, your . . . hobby, I guess. So, you’re, what, sort of spiritualists? Exorcists? Something like that?”\u003c/p\u003e\n\u003cp\u003eOkay, enough farting around.\u003c/p\u003e\n\u003cp\u003e“You have eighty-three cents in your front pocket, Arnie,” I said quickly. “Three quarters, a nickel, three pennies. The three pennies are dated 1983, 1993 and 1999.”\u003c/p\u003e\n\u003cp\u003eArnie grinned the superior grin of the “I’m the smartest man in the room” skeptic, then scooped his coins out of his pocket. He examined the contents, confirmed I was right.\u003c/p\u003e\n\u003cp\u003eHe coughed out a laugh and brought his fist down on the table, my utensils clinking with the impact. “Well I’ll be damned! That’s a neat trick, Mr. Wong.”\u003c/p\u003e\n\u003cp\u003e“If you flip the nickel ten times,” I continued, “you’ll get heads, heads, tails, heads, tails, tails, tails, heads, tails, tails.” \u003c/p\u003e","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-5.html","bookId":2487,"creation":"Oct 5, 2019 10:38:24 PM","modification":"Oct 5, 2019 10:38:24 PM"}
