{"id":104729,"no":57,"title":"Page 57","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“David!”\u003c/p\u003e\n\u003cp\u003eI turned. Darkness was falling around us now, pooling, the clouds over us vanishing behind living shadow. Suddenly it was dark, cave dark, coffin dark. I opened my mouth to tell Amy to run, to run and leave me behind because it was me they wanted and not her, but nothing came out.\u003c/p\u003e\n\u003cp\u003eI twisted the key, the engine turned over, stalled. I tried again, it fired to life, I stomped the gas. I floored it and we went nowhere, nowhere, nowhere and then lurched forward, across an unseen street, smacking into the drift on the other side of the road. I threw it in reverse, floored it again, spinning out and then crawling forward—\u003c/p\u003e\n\u003cp\u003eWe were off. Out of the blackness and into the night, eating up the street, my hands strangling the wheel. The speedometer crept up, tires floating under us, like driving a hovercraft. I felt a hand on my arm again, Amy, breathing, whipping her head around, trying to see everything at once through the ridiculous cardboard glasses.\u003c/p\u003e\n\u003cp\u003eThe night outside got darker and darker, shapes swirling around, blackness closing in, swimming in it, like being downwind from a forest fire.\u003c/p\u003e\n\u003cp\u003eAnd suddenly, Amy was gone. An empty seat.\u003c/p\u003e\n\u003cp\u003eAnd then I felt stupid.\u003c/p\u003e\n\u003cp\u003eOf course the seat was empty—I came out here alone and we had never found Amy; the house had been empty and we all knew she was actually wrapped up in a tarp in my—\u003c/p\u003e\n\u003cp\u003eThe darkness swallowed me. The passing scenery outside was gone, no houses or grass or snowdrifts, like driving in deep space.\u003c/p\u003e\n\u003cp\u003eShadow poured into the Bronco like floodwater. A blade of ice pierced my chest, cold flowing in like poison. My heart stopped. It was like strong, cold fingers reaching behind my ribs and squeezing.\u003c/p\u003e\n\u003cp\u003eAnd then I was gone, out of the truck, out of anywhere. A storm of images exploded in my head, crazed mental snapshots like fever dreams:\u003c/p\u003e\n\u003cp\u003e—looking down, a black crayon in my hand, drawing pictures of three stick figures. One drawn with long hair, one shorter with a spray of red at the top—\u003c/p\u003e\n\u003cp\u003e—under my car, my old car, my Hyundai. On my back, another guy next to me, long blond hair. I’m holding up a muffler and he’s threading in bolts, and I tell Todd we’re missing a bolt, that it rolled away, and he’s saying that the jack is tilting and GET OUT GET OUT BECAUSE THE CAR IS FALLING—\u003c/p\u003e\n\u003cp\u003e—running, breathing hard, through a ballroom in a Las Vegas casino. Chaos, then seeing Jim and knowing what I had to do, raising and firing and watching him go down, clutching his neck—\u003c/p\u003e\n\u003cp\u003e—blue canvas, knees in the snow, rolling a body, rolling it up because somebody could show up any second and it’s sooooo hard to move the deadweight—\u003c/p\u003e\n\u003cp\u003eBack. In the truck again, fingers clamped on the wheel. Plowing through deep snow, a mailbox flying toward me.\u003c/p\u003e\n\u003cp\u003e“David!”\u003c/p\u003e\n\u003cp\u003eI was driving in somebody’s front yard. I cranked the wheel, ground through a drift and landed in the street again. I saw Amy was back, in the passenger seat, pale as china. I reached over and grabbed her by the arm, pulled her over, like I could somehow stop her from getting sucked out of reality again if I hung on really, really tight. She screamed, “The light! Go to the light!”\u003c/p\u003e\n\u003cp\u003eNo idea what she was going on about. Then I saw it, a pool of light in the pitch blackness just ahead. A flat of parking lot, a hint of an unlit red sign.\u003c/p\u003e\n\u003cp\u003eIt was getting darker, blackness eating up the landscape around me, a power outage during a lunar eclipse. I cranked toward the embankment and jumped the curb, climbed over a little hill then landed with a lurch. I slammed the brakes, spinning on a white plane as flat as a hockey rink.\u003c/p\u003e\n\u003cp\u003eTHUNK!\u003c/p\u003e\n\u003cp\u003eWe smacked a pole, light bathing the interior. I saw out of the rearview mirror the sign for a new doughnut shop, the place still under construction but the parking lot lights on. And then I saw nothing at all, because blackness settled over everything outside the little island of lit snow we had settled in. In a second we were cut off from the universe, nothing in any direction, like we had submerged in a lake of oil five hundred feet under the ocean floor. Just black and black and black.\u003c/p\u003e\n\u003cp\u003eSilence. The sound of two people breathing. I felt a wet nose at my ear, saw Molly poking her head up, wagging her tail, bouncing back and forth on her paws, growling low under her breath.\u003c/p\u003e\n\u003cp\u003eAmy said, “They can’t get us! They can’t get us in the light! I knew it!”\u003c/p\u003e\n\u003cp\u003e“How did you—”\u003c/p\u003e\n\u003cp\u003e“David,” she said, rolling her eyes, “they’re shadow people.”\u003c/p\u003e\n\u003cp\u003eShe rolled down her window, poked her head out into the night and screamed, “Screw you!”\u003c/p\u003e\n\u003cp\u003e“Amy, I’d prefer that you not do that.”\u003c/p\u003e\n\u003cp\u003eShe pulled back in and said, “My heart’s going a thousand miles an hour.”\u003c/p\u003e\n\u003cp\u003eI looked out into the nothing, found the gun in my lap and squeezed it. A good luck charm at this point, and barely that.\u003c/p\u003e\n\u003cp\u003eAmy said, “Ooh! Look at that. What is—”\u003c/p\u003e\n\u003cp\u003eLittle bits of light, moving around in the darkness in pairs. Twin embers, small as lit cigarettes, floating slowly around us. There were a few and then a few more, until dozens of the fiery eyes were peering in at us. And then, through the windshield, I saw color. A thin line of electric blue across the darkness, like a horizon. Then the blue line grew fat in the middle, expanding, widening like a slit cut in black cloth. It expanded until blue was all that was visible through the windshield.\u003c/p\u003e\n\u003cp\u003eIt was an eye. The eye. Vibrant blue with a dark, vertical reptilian slit of a pupil. The hand on my forearm again. I thought Amy was going to break the bone with her grip. The eye twitched, taking us in. Then it blinked, and was gone.\u003c/p\u003e\n\u003cp\u003eThe shroud of blackness was gone, too. Just the night now, shrouded stars and moonlit snow and a sad, dormant doughnut shop.\u003c/p\u003e\n\u003cp\u003eAmy said, “Are—are they gone?”\u003c/p\u003e\n\u003cp\u003e“They’re never gone.”\u003c/p\u003e\n\u003cp\u003e“What was that?”\u003c/p\u003e\n\u003cp\u003eWell you see, Amy, it’s like this. We are under the eye of Korrok. We are his food, and our screams are his Tabasco sauce.\u003c/p\u003e\n\u003cp\u003eInstead I said, “I’m not leaving the light.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eAmy craned her head around, looking in all directions again, then took off the cardboard glasses. I looked down at the Smith and realized something, probably several minutes too late. I grabbed the barrel and offered it to Amy, butt- first.\u003c/p\u003e\n\u003cp\u003eI whispered, “Take this.”\u003c/p\u003e\n\u003cp\u003e“What? No.”\u003c/p\u003e\n\u003cp\u003e“Amy, that thing, with the truck driver? You saw how they took him over, used his body? Well that same thing can happen to me.”\u003c/p\u003e\n\u003cp\u003eAnd don’t ask me how I know that, honey.\u003c/p\u003e\n\u003cp\u003e“No, David—”\u003c/p\u003e\n\u003cp\u003e“Amy, listen to me. If I start acting weird, if I make a move at you, you need to shoot me.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t even know how to—”\u003c/p\u003e\n\u003cp\u003e“It’s not complicated. The safety is off. Just squeeze. And don’t get cute and try to go for my arm or some shit like that. You’ll miss. Just aim for the middle of me, jam it into my ribs. Shoot and get out, run for it. Don’t, you know, keep shooting me. Please, take it.”\u003c/p\u003e\n\u003cp\u003eTo my surprise, she did. She turned the pistol over, the gun looking huge in her little hand. She said, “Well, what if it happens to me? What if they take me instead?”\u003c/p\u003e\n\u003cp\u003e“I can overpower you if I have to, get the gun away. But I don’t think it’ll happen. Not with you.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eI leaned back, suddenly feeling lighter without the gun. I swear the things generate their own gravity.\u003c/p\u003e\n\u003cp\u003e“It’s just a theory I have.”\u003c/p\u003e\n\u003cp\u003eAmy pulled her feet up on the seat and scrunched against me, shivering. The gun was in her right hand, laying across her hip and pointing vaguely at my crotch. There would be some real symbolism there, I thought, if this turned out to be a dream.\u003c/p\u003e\n\u003cp\u003eI said, “Besides, I don’t need the gun.” I held up my hands and said, “They passed a law that said I couldn’t put my hands in my pockets. Do you know why? Because they would become concealed weapons. I can kill a man with these hands. Or just one of my feet.”\u003c/p\u003e\n\u003cp\u003eShe snorted a dry, nervous laugh and said, “Yeah, okay. I’ll watch out for you then.”\u003c/p\u003e\n\u003cp\u003eI again gripped the steering wheel with both hands, tendons tensing across my forearms like cables. I sat like that, in silence, for an eternity of minutes. A whole bunch of words trapped behind clenched teeth.\u003c/p\u003e\n\u003cp\u003eFinally, I closed my eyes and said, “Okay. Look. You need to understand something. About this situation, who you’re trapped in here with.”\u003c/p\u003e\n\u003cp\u003e“Oookaaaay . . .”\u003c/p\u003e\n\u003cp\u003eShe twisted around to face me. Those eyes were so damned green. Like a cat. “Don’t, just—just listen. Do you know why I was in the special school, why I was in the BD class in Pine View?”\u003c/p\u003e\n\u003cp\u003eShe said, “Sort of. The thing with Billy, right? The fight you got into with him? And then later when he—”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s right. Listen. Men are animals. Get us together, take out the authority figures, and it’s Lord of the Flies. Billy and his gang, a couple of guys on the wrestling team, they used to make these videos. The kid, you know the Patterson kid, kind of fat? Anyway, they got him after school and tied him to a goalpost and shaved his head and all that, and it was hours before somebody found him, and by then, you know, the skin on his face was all blistered from the contact with the feces . . .”\u003c/p\u003e\n\u003cp\u003eMaybe you can cut back on the details a bit, hmmm?\u003c/p\u003e\n\u003cp\u003e“. . . and they have this party and they show the tape, show the tape of them torturing this fat kid and him just screaming. And they sat there with their beers and watched that tape over and over and over and that’s the way it is in high school. Shit that would get an adult put in a straightjacket is just brushed off. ‘Boys will be boys.’ ”\u003c/p\u003e\n\u003cp\u003eI hesitated, scanned the night for something, anything. I saw a lone bird on a power line, flapping its wings, but it didn’t seem to be going anywhere.\u003c/p\u003e\n\u003cp\u003e“Anyway, the Hitchcock guys, I had gym with them and they picked me outta the crowd. It became this daily thing. Little shit at first but they kept pushing it further and further and it took more and more to keep them entertained. And the coach there, he hated me, so he would make sure and not be there. I mean, I literally saw him turn his back and leave the room when they came after me one time, made sure I saw him do it. And one day they got on me and took me to this equipment room in back, this little storage area with shoulder pads and wrestling mats stacked all around and it’s hot as an oven and there’s this moldy smell of old sweat fermenting in foam padding. And things got crazy. Like, prison yard crazy. And eventually it ends and they leave me there and they’re walking out through the locker room and . . .” \u003c/p\u003e","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-57.html","bookId":2487,"creation":"Oct 5, 2019 10:38:25 PM","modification":"Oct 5, 2019 10:38:25 PM"}
