{"id":98530,"no":11,"title":"Page 11","content":"\u003cp\u003e“Hardy-har-har,” he replied, dipping down as he started opening cabinets. “How many weaker, less assured guys have you slayed with that tongue of yours?”\u003c/p\u003e\n\u003cp\u003e“Apparently not enough,” I muttered. I went to adjust my bracelet and realized I wasn’t wearing it. My heart dropped. “I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eHumming to himself, Cam nodded. I darted back to my bedroom and grabbed the bracelet off the nightstand and slipped it on. A shudder of relief went through me. Halfway out of the bedroom, I glanced down and cursed again.\u003c/p\u003e\n\u003cp\u003eNo bra.\u003c/p\u003e\n\u003cp\u003eThe thin material of my shirt stretch taut across my chest and my nipples were poking out, saying hello. “Oh, Jesus.”\u003c/p\u003e\n\u003cp\u003eTossing the shirt off, I grabbed a sports bra out of my dresser.\u003c/p\u003e\n\u003cp\u003e“Hey! Are you hiding back there?” yelled Cam. “Because I will come back there and drag you out.”\u003c/p\u003e\n\u003cp\u003eSports bra stuck around my head and breasts bouncing everywhere, I blanched. I yanked it down, smushing my right boob. Ow! “Don’t you dare come in here!”\u003c/p\u003e\n\u003cp\u003e“Then hurry up. My eggs wait for no one.”\u003c/p\u003e\n\u003cp\u003e“Oh my God,” I muttered, pulling my shirt back on. I made it to the hallway before I then realized I also hadn’t brushed my teeth. Cam and his eggs were going to have to wait.\u003c/p\u003e\n\u003cp\u003eWhen I returned to the kitchen, he had several eggs boiling in water, and a perfect sunny side up egg in the little frying pan he’d brought. He’d found the bag of shredded cheese in my fridge and was sprinkling it across the eggs.\u003c/p\u003e\n\u003cp\u003eSeeing him in my kitchen, at my stove unnerved me. Knots formed low in my belly as he easily found the plates and silverware. I crossed my arms, shuffling from side to side. “Cam, why are you over here?”\u003c/p\u003e\n\u003cp\u003e“I already told you.” He slid the eggs onto a plate and then walked them over to the bistro set butted up to the wall. “Do you want toast? Wait. Do you have bread? If not, I can—”\u003c/p\u003e\n\u003cp\u003e“No. I don’t need toast.” He’d taken complete control of my kitchen! “Don’t you have anyone else to bother?”\u003c/p\u003e\n\u003cp\u003e“There are a shit ton of people that I could reward with my presence, but I chose you.”\u003c/p\u003e\n\u003cp\u003eThis had to be the most bizarre morning ever. I watched him a moment longer. Giving up on getting him out of my apartment, I sat in the high-rise chair, tucking my legs against my chest. I picked up a fork. “Thanks.”\u003c/p\u003e\n\u003cp\u003e“I choose to believe that you mean that.”\u003c/p\u003e\n\u003cp\u003e“I do!”\u003c/p\u003e\n\u003cp\u003eHe flashed a quick grin. “I doubt that for some reason.”\u003c/p\u003e\n\u003cp\u003eNow I felt like a total bitch. “I do appreciate the eggs. I’m just surprised to see you here… at eight in the morning.”\u003c/p\u003e\n\u003cp\u003e“Well, to be honest, I was planning to woo you with my banana nut bread, but that shit ain’t happening now. So all I have left is my delicious eggs.”\u003c/p\u003e\n\u003cp\u003eI took a bite of the cheesy goodness. “It is really good, but you’re not wooing me.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’m wooing.” He opened up the fridge and grabbed a bottle of OJ. Pouring two glasses, he sat one in front of me. “It’s just all about the stealth. You don’t realize it yet.”\u003c/p\u003e\n\u003cp\u003eDropping that no win conversation, I moved on. “Aren’t you eating?”\u003c/p\u003e\n\u003cp\u003e“I am. I like boiled eggs.” Cam gestured to the stove as he sat in the chair opposite of mine. He popped his chin on his fist, and I focused on my plate. The bastard looked too adorable and cute. “So, Avery Morgansten, I’m all yours.”\u003c/p\u003e\n\u003cp\u003eI almost choked on the piece of egg. “I don’t want you.”\u003c/p\u003e\n\u003cp\u003e“Too bad,” he replied, grinning. “Tell me about yourself.”\u003c/p\u003e\n\u003cp\u003eOh hell to the no, the bonding shit wasn’t happening. “Do you do this often? Just walk into random girls’ apartments and make eggs?”\u003c/p\u003e\n\u003cp\u003e“Well, you’re not random, so technically no.” He got up and checked the eggs boiling. “And I might be known to surprise lucky ladies every now and then.”\u003c/p\u003e\n\u003cp\u003e“Seriously? I mean, you do this normally?”\u003c/p\u003e\n\u003cp\u003eCam glanced over his shoulder at me. “With friends, yes, and we’re friends, aren’t we, Avery?”\u003c/p\u003e\n\u003cp\u003eMy mouth opened. Were we friends? I guessed so, but still. Was this normal? Or was Cam just that confident? He did things like this, because he knew he could, that no one would really make him leave. Most people probably wouldn’t want him to leave. And I could’ve made him get the hell out if I’d really wanted to and that was the truth. Cam was the kind of guy who was probably used to getting what he wanted.\u003c/p\u003e\n\u003cp\u003eJust like Blaine.\u003c/p\u003e\n\u003cp\u003eThat thought turned the eggs in my stomach and I placed my fork down. “Yeah, we’re friends.”\u003c/p\u003e\n\u003cp\u003e“Finally!” he shouted, making me jump a little. “You’ve finally admitted that we’ve friends. It’s only taken a week.”\u003c/p\u003e\n\u003cp\u003e“We’ve only known each other for a week.”\u003c/p\u003e\n\u003cp\u003e“Still took a week,” he replied, poking at the eggs in the water.\u003c/p\u003e\n\u003cp\u003eI pushed the last remaining chunk of eggs around my plate. “What? Does it normally take you just an hour to have someone declaring best friends forever?”\u003c/p\u003e\n\u003cp\u003e“No.” He pulled out the eggs, dropping them in a bowl. Coming to the table, he sat again. His eyes met mine, and it was hard to maintain that stare. Those eyes really were a beautiful shade of azure, sharp and clear. The kind of eyes you could easily get lost staring into. “It usually takes me about five minutes before we’ve moved onto best friend status.”\u003c/p\u003e\n\u003cp\u003eA smile snuck out as I shook my head. “Then I guess I’m just the odd one.”\u003c/p\u003e\n\u003cp\u003e“Maybe.” His lashes lowered as he started peeling his boiled egg.\u003c/p\u003e\n\u003cp\u003eI took a drink. “I guess it’s different for you.”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“I bet you have girls hanging all over you. Dozens would probably kill to be in my spot and here I am, allergic to your bread.”\u003c/p\u003e\n\u003cp\u003eHe looked up. “Why? Because of my near godlike perfection?”\u003c/p\u003e\n\u003cp\u003eA laugh burst from me. “I wouldn’t go that far.”\u003c/p\u003e\n\u003cp\u003eCam chuckled and then shrugged. “I don’t know. Don’t really think about it.”\u003c/p\u003e\n\u003cp\u003e“You don’t think about it at all?”\u003c/p\u003e\n\u003cp\u003e“Nope.” He popped a whole, freaking egg into his mouth. Besides that, he had impeccable table manners. Chewing with his mouth closed, wiping his hands on the napkin he’d pulled from the holder, and not talking with his mouth full. “I only think about it when it matters.”\u003c/p\u003e\n\u003cp\u003eOur gazes collided, and my cheeks flushed. I ran my finger along the rim of my glass. “So you’re a reformed player?”\u003c/p\u003e\n\u003cp\u003eHe paused, egg halfway to his mouth. “What makes you think that?”\u003c/p\u003e\n\u003cp\u003e“I heard you were quite the player in high school.”\u003c/p\u003e\n\u003cp\u003e“Really? Who did you hear that from?”\u003c/p\u003e\n\u003cp\u003e“None of your business.”\u003c/p\u003e\n\u003cp\u003eA brow arched. “With that mouth of yours, you don’t have a lot of friends, do you?”\u003c/p\u003e\n\u003cp\u003eI flinched, because that was a spot-on observation. “No,” I heard myself saying. “I wasn’t really popular in high school.”\u003c/p\u003e\n\u003cp\u003eCam dropped his egg on the plate and sat back. “Shit. I’m sorry. That was an asshole thing for me to say.”\u003c/p\u003e\n\u003cp\u003eI waved it off, but it stung\u003c/p\u003e\n\u003cp\u003eHe watched me through thick lashes. “Hard to believe though that you weren’t. You can be funny and nice when you’re not insulting me and you’re a pretty girl. Actually, you’re really hot.”\u003c/p\u003e\n\u003cp\u003e“Ah… thanks.” I squirmed, holding my glass close.\u003c/p\u003e\n\u003cp\u003e“I’m serious. You said your parents were strict. They didn’t let you hang out in high school?” When I nodded, he finished off the egg he’d dropped. “I still can’t imagine you not being popular in high school. You rock the trifietca—smart, funny, and hot.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t. Okay?” I set my glass down and moved on to tugging at a loose string on the hem of my shorts. “I was like the very opposite of popular.”\u003c/p\u003e\n\u003cp\u003eCam started peeling another egg. Wondered how many he’d eat. “I am sorry, Avery. That… that sucks. High school is a big deal.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it is.” I wetted my lips nervously. “You had a lot of friends?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Still talk to them?”\u003c/p\u003e\n\u003cp\u003e“Some of them. Ollie and I went to high school together, but he spent his first two years at WVU and transferred down here and I see a few around campus and back home.”\u003c/p\u003e\n\u003cp\u003eWrapping my arms around my legs to keep from fidgeting, I rested my chin on my knees. “Have any brothers or sisters?”\u003c/p\u003e\n\u003cp\u003e“A sister,” he replied, picking up the last egg—the fourth one. A genuine smile appeared. “She’s younger than me. Just turned eighteen. She graduates this year.”\u003c/p\u003e\n\u003cp\u003e“You guys close?” I couldn’t imagine having a brother like Cam.\u003c/p\u003e\n\u003cp\u003e“Yeah, we’re close.” A dark look crossed his face and vanished quickly, but it left me wondering if they really were that close. “She means a lot to me. How about you? A big brother I have to worry about visiting and kicking my ass for being here?”\u003c/p\u003e\n\u003cp\u003e“No. I’m an only child. Have a cousin who’s older, but I doubt he’d do that.”\u003c/p\u003e\n\u003cp\u003e“Ah, good.” Devouring that egg, he sat back and patted his stomach. “Where you from?”\u003c/p\u003e\n\u003cp\u003eI pressed my lips together, trying to decide if I should lie or not.\u003c/p\u003e\n\u003cp\u003e“Okay.” He dropped his arm off the back of the metal chair. “You obviously know where I’m from if you’ve heard of my extracurricular actives in high school, but I’ll just confirm it. I’m from the Fort Hill area. Never heard of that? Well, most people haven’t. It’s near Morgantown. Why didn’t I go to WVU? Everyone wants to know that.” He shrugged. “Just wanted to get away, but be somewhat close to my family. And yes, I was… very busy in high school.”\u003c/p\u003e\n\u003cp\u003e“You’re not anymore?” I asked, not really expecting him to answer, because it wasn’t my business, but hey, if I could keep him talking, I didn’t have to say anything.\u003c/p\u003e\n\u003cp\u003eAnd I was… interested in learning more, because Cam, he was fascinating in a way. He was like every uber-popular, sexy guy in high school, but he wasn’t a dick. That alone made him worthy of a scientific study. Also, it was better than sitting around alone and thinking about harassing phone calls and emails.\u003c/p\u003e\n\u003cp\u003e“Depends on who you ask.” He laughed then. “Yeah, I don’t know. When I was a freshman—those first couple of months, being around all the older girls? I probably put more effort into them than I did my classes.”\u003c/p\u003e\n\u003cp\u003eI grinned, easily able to picture that. “But not now?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “So where you from?”\u003c/p\u003e\n\u003cp\u003eOkay. Obviously what changed his ex-player status was something he didn’t want to talk about. Visions of pregnancy scares danced in my head. “I’m from Texas.”\u003c/p\u003e\n\u003cp\u003e“Texas?” He leaned forward. “Really? You don’t have an accent.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t born in Texas. My family was originally from Ohio. We moved to Texas when I was eleven and I never picked up any accent.”\u003c/p\u003e\n\u003cp\u003e“Texas to West Virginia? That’s a hell of a difference.”\u003c/p\u003e\n\u003cp\u003eUnfolding my legs, I stood and picked up my plate and his bowl. “Well, I lived in the strip mall hell part of Texas, but besides that, it’s kind of the same here.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-11.html","bookId":2001,"creation":"Oct 5, 2019 6:35:23 PM","modification":"Oct 5, 2019 6:35:23 PM"}
