{"id":98532,"no":13,"title":"Page 13","content":"\u003cp\u003e“Are you gay?” Jacob demanded.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Look, I’m the last person to judge your sexual preference. I mean, come on.” He jerked his thumbs back at him. “So are you gay?”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “I’m not gay.”\u003c/p\u003e\n\u003cp\u003e“I’m not either, but I’d go gay for you.” Brit smiled.\u003c/p\u003e\n\u003cp\u003e“Thanks.” I giggled. “I’d go gay for you too.”\u003c/p\u003e\n\u003cp\u003e“How cute,” Jacob said. “Not the point. That fine, mother fucking specimen of a man is all up in you—oh my God, he’s ditched the ra-ra’s and is coming over.”\u003c/p\u003e\n\u003cp\u003eMy stomach knotted and I prayed to God, Shiva, and Zeus that Jacob didn’t say anything that would make me want to kill him later.\u003c/p\u003e\n\u003cp\u003e“Damn,” Jacob said, shaking his head. “He makes jeans look like they were molded to fit his—hey, Cameron! How’s it going?”\u003c/p\u003e\n\u003cp\u003eI closed my eyes.\u003c/p\u003e\n\u003cp\u003e“Hey, Jacob. Brittany.” Cam dropped into the seat beside me and nudged my arm. “Avery.”\u003c/p\u003e\n\u003cp\u003e“Hey,” I murmured, acutely aware of Jacob and Brittany staring at us. I closed my text and shoved it in my bag. “What are you up to?”\u003c/p\u003e\n\u003cp\u003e“Oh, you know, mischief and mayhem,” he replied.\u003c/p\u003e\n\u003cp\u003e“That so reminds me of Harry Potter,” Brit said, sighing. “I need a re-read.”\u003c/p\u003e\n\u003cp\u003eWe all turned to her.\u003c/p\u003e\n\u003cp\u003eTwo bright spots appeared in her cheeks as she tossed her blonde hair back. “What? I’m not ashamed to admit that random things remind me of Harry Potter.”\u003c/p\u003e\n\u003cp\u003e“That guy over there reminds me of Snape,” Cam said, jerking his chin to the table behind us. “So I understand.”\u003c/p\u003e\n\u003cp\u003eThe guy with the jet-black hair did kind of look like Snape.\u003c/p\u003e\n\u003cp\u003e“Anyway, what are you guys doing?” Cam shifted and his leg rested against mine. I swallowed. “Playing with M\u0026amp;Ms and Skittles?”\u003c/p\u003e\n\u003cp\u003e“Yes, that and we’re studying for our History mid-term next week. We have to map out Europe,” Jacob explained.\u003c/p\u003e\n\u003cp\u003e“Ouch.” Cam knocked me with his leg.\u003c/p\u003e\n\u003cp\u003eI knocked his leg back.\u003c/p\u003e\n\u003cp\u003e“But Avery, wonderful, Avery…” Jacob glanced at me, his grin spreading, and my eyes were narrowing. “She’s been helping us study.”\u003c/p\u003e\n\u003cp\u003e“That she has,” Brit said.\u003c/p\u003e\n\u003cp\u003eCam sent me a sidelong glance, and I scooted away from him.\u003c/p\u003e\n\u003cp\u003ePopping his chin on his hand, Jacob smiled at Cam. “Before we started studying, I was telling Avery that she should wear the color green more often. It makes her sexy with that hair of hers.”\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open. He had so not even said that about the stupid cardigan I was wearing.\u003c/p\u003e\n\u003cp\u003e“Do you like the color green on her, Cam?” Brit asked.\u003c/p\u003e\n\u003cp\u003eOh my God.\u003c/p\u003e\n\u003cp\u003eCam turned to me, his blue eyes as deep as the waters off the coast of Texas. “The color looks great on her, but she looks beautiful every day.”\u003c/p\u003e\n\u003cp\u003eHeat crept across my cheeks as I let out a low breath.\u003c/p\u003e\n\u003cp\u003e“Beautiful?” Brit repeated.\u003c/p\u003e\n\u003cp\u003e“Beautiful,” Cam repeated, reclaiming what little distance I’d managed to put between us. He nudged my knee again. “So did you guys learn anything from studying?”\u003c/p\u003e\n\u003cp\u003eI let out the breath. “I think we got it.”\u003c/p\u003e\n\u003cp\u003e“Because of you.” Jacob glanced at Brit, and my stomach dropped. “Avery came up with this song to help me remember where the countries were.”\u003c/p\u003e\n\u003cp\u003eOh no.\u003c/p\u003e\n\u003cp\u003e“Sing him your song.” Brit elbowed me so hard that I bounced off Cam and ricocheted back.\u003c/p\u003e\n\u003cp\u003eInterest sparked in Cam’s eyes. “What song?”\u003c/p\u003e\n\u003cp\u003e“I am not singing that song again.”\u003c/p\u003e\n\u003cp\u003eJacob beamed up at Cam. “It’s the Croatia song.”\u003c/p\u003e\n\u003cp\u003eI shot him a death glare.\u003c/p\u003e\n\u003cp\u003eCam laughed. “The Croatia song? What?”\u003c/p\u003e\n\u003cp\u003e“No,” I said again. “I am not singing again. That is so not my talent.”\u003c/p\u003e\n\u003cp\u003e“What kind of talents do you have?” Cam asked, and when I looked at him, I kind of got hung up on the cut line of his jaw, of the way his hair brushed his temples. What the hell? Cam was staring back at me, brows raised. “Avery?”\u003c/p\u003e\n\u003cp\u003e“Do tell,” Jacob coaxed.\u003c/p\u003e\n\u003cp\u003eBrit nodded. “Talents are fun.”\u003c/p\u003e\n\u003cp\u003e“They can be.” Cam’s gaze dropped, and I sucked in a soft breath. He leaned over and there wasn’t more than an inch or two separating our mouths. I heard Jacob’s audible gasp. “Tell me what your talents are, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“Sweetheart,” Jacob murmured with a soft sigh.\u003c/p\u003e\n\u003cp\u003e“Dancing,” I blurted out. “I danced. I used to dance.”\u003c/p\u003e\n\u003cp\u003eCuriosity filled Cam’s face. “What kind of dancing?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” I grabbed the bag of Skittles and dumped the rest of them into my palm. “Ballet, jazz, tap, contemporary—that kind of stuff.”\u003c/p\u003e\n\u003cp\u003e“No shit?” Jacob exclaimed. “I did tap when I was like six, for about a month, and then decided I wanted to be a fireman or something like that. That shit was hard.”\u003c/p\u003e\n\u003cp\u003eBrit smirked. “I tried dance and discovered I had no coordination or grace beyond shaking my ass. Were you any good at it?”\u003c/p\u003e\n\u003cp\u003eI shrugged, uncomfortable. “I took classes for about ten years, did some competitions and a lot of recitals.”\u003c/p\u003e\n\u003cp\u003e“Then you were good!” Brit said. “I bet you did all those crazy turns and tricks.”\u003c/p\u003e\n\u003cp\u003eI used to be able to do a ton of them and was at one point crazy flexible, but the thing I was really good at, had been the turns—the fouette tour—arguably the hardest series of spins in ballet.\u003c/p\u003e\n\u003cp\u003eCam had been quiet for a few moments, a very odd thing indeed. “My sister did dance since she was around five. Still does. I think she’d cut someone if they made her stop.”\u003c/p\u003e\n\u003cp\u003eShoving the rest of the Skittles in my mouth, I nodded. “Dancing can be addictive if you like it.”\u003c/p\u003e\n\u003cp\u003e“Or are good at it,” Brit interjected.\u003c/p\u003e\n\u003cp\u003eCam bumped me with his shoulder. “Why’d you stop?”\u003c/p\u003e\n\u003cp\u003eI’d loved to dance—loved every part of it. The training, the rehearsing, and especially the anticipation leading up to the moment you stepped out onto the stage. Nothing felt like that moment when you waited in the wings for your name to be called; the first breath you took as you stepped onto center stage and stood under the bright lights. The quiet moment when you closed your eyes while you waited for your music to begin, knowing that everyone was focused on you.\u003c/p\u003e\n\u003cp\u003eShrugging my shoulders, I reached for what was left of the M\u0026amp;Ms. “I guess I got tired of it,” I said finally. The lie was a big one. I didn’t grow tired of dancing. I missed it more than anything, but I couldn’t stand for people to stare. “Does your sister do competitions?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “She’s traveled all over and spent the summer at the Joffrey School of Ballet on a scholarship.”\u003c/p\u003e\n\u003cp\u003e“Holy shit,” I gasped, my eyes widening. “She must be damn good.”\u003c/p\u003e\n\u003cp\u003eCam smiled proudly. “She is.”\u003c/p\u003e\n\u003cp\u003eEnvy grew like a cancer, deep and invasive. That could’ve been me dancing at one of the most well-known training centers in the world. It should’ve been me, but it wasn’t and I needed to just deal with that.\u003c/p\u003e\n\u003cp\u003eConversation sort of just fell apart after that, at least for me. Cam chatted with Brit and Jacob while I was lost in my own thoughts until it was time to go to class. I made plans for another study session and then said my goodbyes.\u003c/p\u003e\n\u003cp\u003eCam followed me out in the bright sunlight and the steady, cool breeze that warned that colder weather was well on its way. He didn’t say anything as we walked over to Knutti Hall. Sometimes he did that, and I never knew or could begin to speculate on what he could be thinking during those quiet moments.\u003c/p\u003e\n\u003cp\u003eIt was in that moment, as we crossed the congested street and he waved at a group standing in front of the Byrd Center, that I realized how different he was than when I saw him with the two girls earlier. It bothered me and it didn’t know why I even cared.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asked when we stopped by the benches in front of Knutti Hall.\u003c/p\u003e\n\u003cp\u003eI squinted up at him. “Yeah, I’m fine. Are you?”\u003c/p\u003e\n\u003cp\u003eHe gave me a tight-lipped smile and nodded. “We still on for tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow night? Oh! The astronomy assignment.” As part of our mid-term grade, Drage was making us partner up to use the Observation Center. We’d have to turn in our images the following Wednesday. “Yeah, it works for me.”\u003c/p\u003e\n\u003cp\u003e“Good.” Cam backed away. “See you then.”\u003c/p\u003e\n\u003cp\u003eI started to turn, but stopped as something occurred to me. “Cam?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“What were you doing in the Den? Don’t you have normally have class, like right now?”\u003c/p\u003e\n\u003cp\u003eHis lips curved up at the corner and that damn dimple appeared. When he smiled liked that, it felt like a balloon had suddenly inflated in my chest. “Yeah, I normally have class right now,” he said, eyes a startling azure in the sun. “But I wanted to see you.”\u003c/p\u003e\n\u003cp\u003eWords left me as I watched him pivot around and hit the road, heading in the opposite direction of my building. I stood there for a moment and then turned. There was no stopping the smile that split my lips and it remained.\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003e“Are you sure you know how to use this thing?” I asked, staring at the telescope.\u003c/p\u003e\n\u003cp\u003eCam shot me a look over his shoulder. “What? You don’t?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Weren’t you paying attention in class when Drage went over this and the imaging cameras?”\u003c/p\u003e\n\u003cp\u003eI crossed my arms. “You were drawing the cast of Duck Dynasty when he was going over that.”\u003c/p\u003e\n\u003cp\u003eHe laughed as he turned back to the telescope and started adjusting the knobs and buttons and other things I couldn’t remember. “I was listening.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” I inched closer, using his body as a shield against the cool wind whipping across the roof of the Byrd Center. “You’re actually a pretty good artist.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, but he really was. The sketches were disturbingly life-like, right down to the beards.\u003c/p\u003e\n\u003cp\u003eHe bent over, moving a lever. “I’ve used a telescope a time or two in my life.”\u003c/p\u003e\n\u003cp\u003e“That’s random.”\u003c/p\u003e\n\u003cp\u003e“Okay. I used it when I had the class previously,” he corrected, sending me a quick grin as he straightened. Tipping his head back, he checked out the dark sky. “Man, I don’t know if we’re going to be able to get anything before those clouds roll in.”\u003c/p\u003e\n\u003cp\u003eFollowing his gaze, I winced. Intense, tumultuous clouds were obscuring most of the night sky. There was a wet feel to the air, a smell of rain. “Well, you better hurry then.”\u003c/p\u003e\n\u003cp\u003e“Bossy,” he murmured.\u003c/p\u003e\n\u003cp\u003eI grinned.\u003c/p\u003e\n\u003cp\u003e“Come over here and I’ll show you how to use this.” He stepped back, and with a sigh, I took his place. “Are you going to pay attention?”\u003c/p\u003e\n\u003cp\u003e“Not really,” I admitted.\u003c/p\u003e\n\u003cp\u003e“At least you’re honest.” Cam leaned around me, putting his fingers on the telescope. His arm brushed mine, and I didn’t mind. He was really blocking the wind now. “This is a Philips ToUcam Pro II.” He pointed at a silver thing that reminded me of a webcam. “It hooks to the telescope. At these settings, you should be able to get a clear image of Saturn. Press this and it will capture an image.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-13.html","bookId":2001,"creation":"Oct 5, 2019 6:35:23 PM","modification":"Oct 5, 2019 6:35:23 PM"}
