{"id":98544,"no":25,"title":"Page 25","content":"\u003cp\u003eBut when we got back to our apartment building and as we reached the fifth floor, I realized I didn’t want the night to be over yet. We stopped in front of my door, and I turned to face him, twisting my fingers along the strap of my purse.\u003c/p\u003e\n\u003cp\u003eHis lips quirked up on one side. “So…”\u003c/p\u003e\n\u003cp\u003e“Would you like to come in? For something to drink? I have coffee or hot chocolate.” Hot chocolate? Seriously? Was I twelve? Fuck me. “I don’t have any beer or anything more—”\u003c/p\u003e\n\u003cp\u003e“Hot chocolate would be good,” he cut in. “Only if you have the kind with those tiny marshmallows.”\u003c/p\u003e\n\u003cp\u003eMy lips spread into a smile and I didn’t care how big or goofy it looked. “I do.”\u003c/p\u003e\n\u003cp\u003e“Then lead the way, sweetheart.”\u003c/p\u003e\n\u003cp\u003eHeart pumping, I let us into my apartment and turned on the lamp beside the couch. Shedding my jacket, I headed into the kitchen. Cam sat on the couch while I whipped us up some hot chocolate. While the water heated up, I yanked off my shoes. I brought two steaming cups back.\u003c/p\u003e\n\u003cp\u003e“Thank you.” He took one. “Got a question for you.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I sat facing him, tucking my legs under me.\u003c/p\u003e\n\u003cp\u003eHe took a sip. “So based on your first date experience, would you go out on a second?”\u003c/p\u003e\n\u003cp\u003eA pleasant feeling hummed in my chest. “Like a second in general?”\u003c/p\u003e\n\u003cp\u003e“In general.”\u003c/p\u003e\n\u003cp\u003eI shrugged and then tried some of my hot chocolate. “Well, this was a very good first date. If second dates were like this, then I guess I would.”\u003c/p\u003e\n\u003cp\u003e“Hmm. With just anyone or…?”\u003c/p\u003e\n\u003cp\u003eMy lashes lowered. “Not with just anyone.”\u003c/p\u003e\n\u003cp\u003e“So it would have to be someone in particular?”\u003c/p\u003e\n\u003cp\u003eThe pleasant feeling spread into my limbs. “I think it would have to be.”\u003c/p\u003e\n\u003cp\u003e“Interesting,” he murmured, taking another drink. When he looked at me, his eyes positively twinkled. Christ. I was screwed. Eyes were twinkling at me. “Is this someone in particular going to have to wait another two months if they ask you out?”\u003c/p\u003e\n\u003cp\u003eI couldn’t fight the smile, so I took a drink. “Depends.”\u003c/p\u003e\n\u003cp\u003e“On?”\u003c/p\u003e\n\u003cp\u003e“My mood.”\u003c/p\u003e\n\u003cp\u003eCam chuckled. “Get ready.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I’m going to ask you out again—not dinner, because I like to change things up. It’s to the movies.”\u003c/p\u003e\n\u003cp\u003eI pretended to think about it, but I already knew I’d say yes. Might be a dumb move or pointless, but I wanted to go out on another date with him. “Movies?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “But it’s a drive-in movie, one of the last ones around.”\u003c/p\u003e\n\u003cp\u003e“Outside?”\u003c/p\u003e\n\u003cp\u003e“Yep.” His grin spread. “Don’t worry. I’d keep you warm.”\u003c/p\u003e\n\u003cp\u003eI didn’t know if I should giggle or tell him that last statement was kind of adorably corny. “Okay.”\u003c/p\u003e\n\u003cp\u003eHis brows rose. “Okay to the movies?”\u003c/p\u003e\n\u003cp\u003eBiting down on my lip, I nodded.\u003c/p\u003e\n\u003cp\u003e“Seriously it isn’t going to take me another two months?”\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003eCam looked away, laughing under his breath. “Okay. How about Wednesday?”\u003c/p\u003e\n\u003cp\u003e“Next Wednesday?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eI sat my hot chocolate down on the coffee table. “The following Wednesday?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eCounting the days down, I ended up frowning. “Wait. That’s the Wednesday before Thanksgiving.”\u003c/p\u003e\n\u003cp\u003e“It is.”\u003c/p\u003e\n\u003cp\u003eI stared at him. “Cam, aren’t you going home?”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“When? After the movies, in the middle of the night, or Thanksgiving morning?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “See, the drive-in movie theater is just outside of my hometown. About ten miles out.”\u003c/p\u003e\n\u003cp\u003eI leaned back against the couch, confused. “I don’t understand.”\u003c/p\u003e\n\u003cp\u003eCam finished off the hot chocolate and twisted toward me. He scooted over so only a handful of inches separated us. “If you go on this date with me, you’re going to have to go home with me.”\u003c/p\u003e\n\u003cp\u003e“What?’ I shrieked, sitting up straight. “Go home with you?”\u003c/p\u003e\n\u003cp\u003eHe pressed his lips together and nodded his head.\u003c/p\u003e\n\u003cp\u003e“Are you serious?”\u003c/p\u003e\n\u003cp\u003e“Serious as my pierced eardrum,” he said. “Come home with me. We’ll have fun.”\u003c/p\u003e\n\u003cp\u003e“Go home with you—to your parents’ house? Basically for Thanksgiving?” When he nodded again, I smacked him on the arm. “Don’t be stupid, Cam.”\u003c/p\u003e\n\u003cp\u003e“I’m not being stupid. I’m being serious. My parents won’t mind.” He paused, nose wrinkling. “Actually, they’d probably be happy to see someone other than me. And my mom likes to cook way too much food. The more mouths, the better.”\u003c/p\u003e\n\u003cp\u003eThere were no words.\u003c/p\u003e\n\u003cp\u003e“We can leave whenever you want, but obviously before Wednesday afternoon. You finishing the rest of your hot chocolate?” When I shook my head, he grabbed my cup. “And we can come back whenever.”\u003c/p\u003e\n\u003cp\u003eI watched him drink the rest of my hot chocolate. “I can’t go with you.”\u003c/p\u003e\n\u003cp\u003eHe raised his brows. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Because of a hundred obvious reasons, Cam. Your parents are going to think—”\u003c/p\u003e\n\u003cp\u003e“They’re not going to think anything.”\u003c/p\u003e\n\u003cp\u003eI shot him a look.\u003c/p\u003e\n\u003cp\u003eHe sighed. “Okay. Look at it this way. It’s better than you sitting home, by yourself, all week. What are you going to do? Sit around and read? And miss me, because you’re going to miss me. And then I’m going to have spend most of my time texting you and feeling bad that you’re sitting home, all alone, and can’t even eat McDonalds because they’re closed on Thanksgiving.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to feel sorry for me. It’s not a big deal. I have no problem staying here.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you sitting here alone and you’re making this into a big deal. I’m a friend asking a friend to come hang out with me over Thanksgiving break.”\u003c/p\u003e\n\u003cp\u003e“You’re a friend who just took a friend out on a date!”\u003c/p\u003e\n\u003cp\u003e“Ah,” he said, sitting my cup down. “That’s a good point.”\u003c/p\u003e\n\u003cp\u003eShaking my head, I picked up a pillow, holding it to my chest. “I can’t do that. Visiting family over the holidays? That’s way too—”\u003c/p\u003e\n\u003cp\u003e“Fast?” he supplied.\u003c/p\u003e\n\u003cp\u003e“Yes. Way too fast.”\u003c/p\u003e\n\u003cp\u003e“Well, then I guess it’s a good thing that we’re not seeing each other then, because yes, it would be too fast if that was the case.”\u003c/p\u003e\n\u003cp\u003e“What the, what?”\u003c/p\u003e\n\u003cp\u003eCam pulled the pillow away and tossed it behind him. “You and I are two friends who went out on one date. Maybe two if you come with me. We’re not dating each other. We’re just friends who had one date. So we will be going back to my house as friends.”\u003c/p\u003e\n\u003cp\u003eMy head was spinning. “You make no sense.”\u003c/p\u003e\n\u003cp\u003e“I make perfect sense. We haven’t even kissed, Avery. We’re just friends.”\u003c/p\u003e\n\u003cp\u003eI gaped at him.\u003c/p\u003e\n\u003cp\u003eHe shrugged one shoulder. “Come home with me, Avery. I promise you it won’t be uncomfortable. My parents would be happy to have you. You will have a good time and it will be better than what you’d end up doing here. And nothing, absolutely nothing is expected from you. Okay?”\u003c/p\u003e\n\u003cp\u003eThe word no formed on my tongue, but for some reason it didn’t come out of my mouth. My thoughts raced from vaguely entertaining the idea to flat out telling him he was insane. Go home with him? That was… way better than spending Thanksgiving here alone. It was bad enough when I did live at home and my parents skipped out of town without me, but at least the maid made me a turkey dinner. Mrs. Gibson. She’d baked me a turkey for the last three years. And was McDonalds really closed? Man, that sucked. But going home with Cam was insane. His reasoning made no sense whatsoever. It was like backwards reasoning or something. It was reckless and just so unlike anything I’d ever do.\u003c/p\u003e\n\u003cp\u003eUnlike anything I’d ever do.\u003c/p\u003e\n\u003cp\u003eI looked up, meeting his steady gaze. His eyes… were such an astonishing shade of blue. Was I really considering this? My heart started thumping in my chest. I swallowed. “Your parents really would be okay with this?”\u003c/p\u003e\n\u003cp\u003eSomething glinted in his eyes. “I’ve brought friends home before.”\u003c/p\u003e\n\u003cp\u003e“Girls?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eWell, that… that was interesting. “And your parents are really going to think we’re just friends?”\u003c/p\u003e\n\u003cp\u003e“Why would I have a reason to tell them we weren’t dating if we were? If I say we’re friends, that’s what they’ll think.”\u003c/p\u003e\n\u003cp\u003eEvery logical part of me was screaming no. “Okay. I’ll go home with you.” Once the words were out, I couldn’t take them back. “This is an insane idea.”\u003c/p\u003e\n\u003cp\u003e“It’s a perfect idea.” A slow smile spread across his lips. “Let’s hug on it.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Hug on it.” That glint in his eyes went up a notch. “Once you hug on it, you can’t go back on it.”\u003c/p\u003e\n\u003cp\u003e“Oh my God, are you serious?”\u003c/p\u003e\n\u003cp\u003e“Very serious.”\u003c/p\u003e\n\u003cp\u003eRolling my eyes, I grumbled as I rose onto my knees and stretched my arms out. “Alright, let’s hug to seal our deal before I change—” My words ended in a squeak as Cam’s arms went around my waist and he tugged me over to him. I ended up sitting right next to him, practically on him, with my left leg tangled between his knees.\u003c/p\u003e\n\u003cp\u003eCam hugged me. It wasn’t a tight one, not like it would’ve been if we were standing, but the fact we were so close this way had such a powerful effect on me. “Deal is sealed, sweetheart. Thanksgiving is at the Hamilton’s.”\u003c/p\u003e\n\u003cp\u003eI said something to the affirmative and as I pulled back a little, our faces were perfectly lined up. And I suddenly understood that glint in his eyes. “You…”\u003c/p\u003e\n\u003cp\u003eHe chuckled, and low in my stomach, muscles tightened. “Smooth move, huh? Got you all the way over here. I would’ve taken you on your word.”\u003c/p\u003e\n\u003cp\u003eI was fighting a grin. “You’re so wrong.”\u003c/p\u003e\n\u003cp\u003e“I’m wrong in all the right ways. I have to admit something.” He regained that tiny distance I’d put between us. His lips brushed my cheek, and I found it hard to concentrate. “I lied earlier.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003eHis hands slid to my lower back. “When I said you looked great? I wasn’t being completely honest.”\u003c/p\u003e\n\u003cp\u003eThat was not what I expected. I turned my head the slightest and then bit back a gasp. Our mouths were centimeters apart and I thought about Brit’s certainty that he would kiss me tonight. I forced my tongue to work. “You don’t think I look great?”\u003c/p\u003e\n\u003cp\u003e“No,” he said, his expression serious as one hand followed the line of my spine, resting below the edges of my hair. He lowered his head so that his temple pressed against mine. “You look beautiful tonight.”\u003c/p\u003e\n\u003cp\u003eMy breath caught. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything as he shifted his head. His lips brushed the curve of my cheek, and I stiffened in his arms. My heart was thundering out of excitement and a different kind of emotion. Fear? Was that what I tasted in the back of my throat? It had come out of nowhere, raw and powerful. The mixture of the two, the need to stay where I was and to pull away was consuming. \u003c/p\u003e","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-25.html","bookId":2001,"creation":"Oct 5, 2019 6:35:23 PM","modification":"Oct 5, 2019 6:35:23 PM"}
