{"id":98522,"no":3,"title":"Page 3","content":"\u003cp\u003eBefore I left campus, I headed down to the financial building to pick up an application for work-study. I didn’t need the money, but I needed the time suckage to keep my mind occupied. I had a full load—eighteen credit hours—but I would have a crap ton of free time. A job on campus seemed like the right thing to go for, but there were no spots open. My name went on an extended waiting list.\u003c/p\u003e\n\u003cp\u003eThe campus was really beautiful in a quaint, peaceful sort of way. It was nothing like the sprawling campuses of huge universities. Nestled between the Potomac River and the tiny, historical town of Shepherdstown, it was like something you’d see on a postcard. Large buildings with steeples mixed in among more modern structures. Trees everywhere. Fresh, clean air and everything you needed within walking distance. I could actually walk on nicer days or at least park on West Campus to avoid paying the meter.\u003c/p\u003e\n\u003cp\u003eAfter giving my information for the waiting list, I hoofed it back toward my car, enjoying the warm breeze. Unlike this morning when I’d been running late, I got a chance to check out the houses on the way to the train station. Three houses, side by side, had porches full of college-aged guys. Most likely this school’s version of fraternity row.\u003c/p\u003e\n\u003cp\u003eOne guy looked up, beer in hand. He smiled, but then turned as a football flew out from the open door, smacking him in the back. Curses exploded.\u003c/p\u003e\n\u003cp\u003eDefinitely fraternity row.\u003c/p\u003e\n\u003cp\u003eMy spine stiffened as I picked up my pace, hurrying past the houses. I hit an intersection, stepped out and nearly got slammed by a silver truck—one of those big ones, maybe a Tundra—as it sped onto the narrow road I needed to cross. My heart jumped as it slammed its brakes, blocking my path.\u003c/p\u003e\n\u003cp\u003eI took a step back onto the curb, confused. Was the driver going to yell at me?\u003c/p\u003e\n\u003cp\u003eThe tinted passenger window rolled down, and I about fell flat on my face.\u003c/p\u003e\n\u003cp\u003eCameron Hamilton grinned at me from behind the wheel, baseball cap on, turned backward. Wisps of dark hair curled up under the band. And he was shirtless—totally shirtless. And from what I could see of him, just his chest, it was a mighty fine chest. Pecs—the guy had pecs. And a tattoo. On his right chest, a sun burst, flames trailing back over his shoulders in vibrant hues of red and orange.\u003c/p\u003e\n\u003cp\u003e“Avery Morgansten, we meet again.”\u003c/p\u003e\n\u003cp\u003eHe was the last person I wanted to see. I had the shittiest luck known to man. “Cameron Hamilton… hi.”\u003c/p\u003e\n\u003cp\u003eHe leaned over, dropping an arm over the steering wheel. Correction. He also had some really nice biceps. “We have to stop meeting like this.”\u003c/p\u003e\n\u003cp\u003eAnd that was the truest thing ever spoken. I needed to stop staring at his bicep… and chest… and tattoo. Never thought the sun could be so… sexy. Wow. This was awkward.\u003c/p\u003e\n\u003cp\u003e“You running over me, me almost running over you?” Cam elaborated. “It’s like we’re a catastrophe waiting to happen.”\u003c/p\u003e\n\u003cp\u003eI had no idea what to say to that. My mouth was dry, thoughts scattered.\u003c/p\u003e\n\u003cp\u003e“Where you heading to?”\u003c/p\u003e\n\u003cp\u003e“My car,” I forced out. “I’m about to run out of time.” Not necessarily true, because I had been generous with the quarters so I wouldn’t end up with a parking ticket, but he didn’t need to know that. “So…”\u003c/p\u003e\n\u003cp\u003e“Well, hop in, sweetheart. I can give you a ride.”\u003c/p\u003e\n\u003cp\u003eBlood drained from my face and rushed to other parts of my body in a really odd and confusing way. “No. It’s okay. I’m right up the hill. No need at all.”\u003c/p\u003e\n\u003cp\u003eThe grin spread up on the side, revealing that one dimple. “It’s no problem. It’s the least I could do after almost running you over.”\u003c/p\u003e\n\u003cp\u003e“Thank you, but—”\u003c/p\u003e\n\u003cp\u003e“Yo! Cam!” Beer Guy jumped off the porch and jogged down the sidewalk, passing me a quick look. “What you up to, man?”\u003c/p\u003e\n\u003cp\u003eSaved by the frat boy.\u003c/p\u003e\n\u003cp\u003eCam’s gaze didn’t veer from me, but his grin started to slip. “Nothing, Kevin, just trying to have a conversation.”\u003c/p\u003e\n\u003cp\u003eGiving Cam a quick wave, I hurried around Kevin and the front of the trunk. I didn’t look back, but I could feel him watching. Over the years, knowing when someone was staring at you when you weren’t looking had become a talent of mine.\u003c/p\u003e\n\u003cp\u003eI forced myself not to run to the train station, because running away in front of the same guy twice in one day was beyond the acceptable level of weirdness. Even for me.\u003c/p\u003e\n\u003cp\u003eI didn’t realize I’d been holding my breath until I was behind the wheel of my car and the engine humming.\u003c/p\u003e\n\u003cp\u003eJesus.\u003c/p\u003e\n\u003cp\u003eI dropped my head against the steering wheel and groaned. A catastrophe waiting to happen? Yeah, sounded about right.\u003c/p\u003e\n\u003cp\u003eChapter 3\u003c/p\u003e\n\u003cp\u003eSitting through a three hour long sociology class Tuesday night hadn’t been as bad as I thought it would be, but by the time class let out, I was starving. Before I headed back to my apartment, I stopped by the Sheetz—a convenience store/gas station we didn’t have in Texas—and got a MTO. A Made To Order salad, heavy on the fried chicken strips and ranch dressing.\u003c/p\u003e\n\u003cp\u003eMmm. Healthy.\u003c/p\u003e\n\u003cp\u003eThe parking lot was packed with cars, some even in the nearby field that butted up to west campus. It hadn’t been like this when I’d left for my evening class and I wondered what was going on. I managed to find a parking spot all the way near the main road and as I turned the ignition, my cell rattled in the cup holder.\u003c/p\u003e\n\u003cp\u003eI grinned when I saw it was a text from Jacob. We’d exchanged numbers earlier in class since he lived in one of the dorms.\u003c/p\u003e\n\u003cp\u003eArt sucks was all his text said.\u003c/p\u003e\n\u003cp\u003eLaughing, I sent him a quick text back about our homework, which was to identify what painting belonged to what era. Thank God for Google, because that was how I was completing the assignment.\u003c/p\u003e\n\u003cp\u003eGathering up my bag and food, I climbed out of my car. The air was sticky and I lifted my hair off my neck, wishing I had pulled it up into a ponytail. The scent of autumn was in the air though and I was eager to see cooler weather. Maybe even snow in the winter. I headed across the brightly lit parking lot, toward the center cluster of apartments. I was on the top floor—the fifth—it seemed like a lot of students lived here and most hadn’t really started to arrive until today, but as soon as I stepped up on the sidewalk, I knew where all the cars were coming from.\u003c/p\u003e\n\u003cp\u003eMusic thumped from somewhere inside my apartment building. A lot of lights were on and I could pick up pieces of conversation as I headed up the stairs. On the fifth floor, I found the culprit. The apartment across the hall, two doors down, was throwing a party. The door was cracked open and light and music spilled into the open hallway.\u003c/p\u003e\n\u003cp\u003eA little bit of jealousy wiggled inside my chest as I unlocked my door. All the laughter, the noise, and the music sounded fun. It all seemed so normal, like something I should be doing, but parties….\u003c/p\u003e\n\u003cp\u003eParties didn’t end well for me.\u003c/p\u003e\n\u003cp\u003eClosing my door behind me, I kicked off my shoes and dropped my bag on the couch. Furnishing this apartment had put a dent in my account, but I’d be here for four years and I figured I could sell it when I left or bring it with me.\u003c/p\u003e\n\u003cp\u003eAnd it was all my stuff. That meant a lot to me.\u003c/p\u003e\n\u003cp\u003eThe party raged on across the hall, long after I finished my not-so healthy salad, changed into sleep shorts and a long sleeve shirt, and finished my art homework. It was just after midnight when I gave up on reading my English assignment and started back toward my bedroom.\u003c/p\u003e\n\u003cp\u003eBut I stopped in the hallway, my toes curling into the carpet.\u003c/p\u003e\n\u003cp\u003eA burst of muffled laughter rang out and I knew their door must’ve been open, because it sounded louder than before. I was frozen, worrying my lower lip. What if I opened the door and recognized someone from class? It was obviously a college kid throwing the party. Maybe I would know the person? So what if I did? Wasn’t like I was going to join in when I was braless, wearing my jammies, and rocking the messiest ponytail known to man.\u003c/p\u003e\n\u003cp\u003eI turned and flipped on the bathroom light, staring at my reflection. Scrubbed of all makeup, the freckles on the bridge of my nose stood way out and my face seemed more flushed than normal. I leaned against the sink my mom would’ve laughed at and pressed my face closer to the mirror.\u003c/p\u003e\n\u003cp\u003eWith the exception of my reddish-brown hair that was from my father, I was the spitting image of my mom. Straight nose, rounded chin, and high cheekbones, with all the cosmetic help she’d had over the years to stay looking fresh, we looked more like sisters instead of mother and daughter.\u003c/p\u003e\n\u003cp\u003eFootsteps echoed out in the hall. More laughter.\u003c/p\u003e\n\u003cp\u003eI made a face at my reflection and pushed away from the mirror. Back in the hall, I told myself to go to sleep, but I found myself walking toward my front door. I had no idea what I was doing or why I was being so nosy, but everything sounded… warm and fun out there and everything in here was cold and boring.\u003c/p\u003e\n\u003cp\u003eWarm and fun?\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. God, I sounded lame. It was cold in here because I had the central air cranked like a mother.\u003c/p\u003e\n\u003cp\u003eBut I was at the door and there was nothing stopping me. Yanking it open, I peered out into the stairwell, seeing two heads disappear down the steps. The door to the party was still open, and I stood there, torn. This wasn’t home. No one was going to send me a scathing look or yell obscenities at me. If anything, they’d probably think I was some kind of freak just standing there, half out my door, all bug-eyed, and letting all the cold air out.\u003c/p\u003e\n\u003cp\u003e“Bring Raphael back!” exclaimed a familiar voice and a deep laugh that had my stomach dropping in stunned disbelief. “You fucktard!”\u003c/p\u003e\n\u003cp\u003eI recognized that voice! Oh my God…\u003c/p\u003e\n\u003cp\u003eIt couldn’t be. I hadn’t seen the big ass silver truck outside, but then again, there were so many cars and it wasn’t like I was searching for his truck.\u003c/p\u003e\n\u003cp\u003eThe door swung all the way open, and I froze as a guy stumbled out, laughing as he set a tortoise—what the fuck?—on the floor. The thing stuck its head out, looked around, and then disappeared into its shell.\u003c/p\u003e\n\u003cp\u003eA second later, the guy who’d put the tortoise outside was pulled back into the apartment and Cam appeared in the doorway in all his shirtless glory. He reached down and scooped up the little green guy. “Sorry Raphael. My friends are complete, fucking….” He looked up.\u003c/p\u003e\n\u003cp\u003eI tried to jerk back inside, but it was too late.\u003c/p\u003e\n\u003cp\u003eCam saw me.\u003c/p\u003e\n\u003cp\u003e“Assholes…” He did a double take. “What the…?”\u003c/p\u003e\n\u003cp\u003eWould dive bombing into my apartment seem weird? Yes—yes it would. So I went with a very lame, “Hey…”\u003c/p\u003e\n\u003cp\u003eCam blinked several times, as if he sought to clear his vision. “Avery Morgansten? This is becoming a habit.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I forced myself to swallow. “It is.”\u003c/p\u003e\n\u003cp\u003e“Do you live here or are you visiting…?”\u003c/p\u003e\n\u003cp\u003eI cleared my throat as the tortoise’s legs started moving like it was trying to wiggle away. “I… I live here.”\u003c/p\u003e\n\u003cp\u003e“No shit?” Those baby blues widened and he swaggered around the railing. I couldn’t help but notice how his gym shorts hung way low on his narrow hips. Or his stomach. It was ripped, taking six pack into eight pack territory. “You really live here?”\u003c/p\u003e\n\u003cp\u003eI forced my gaze up and got stock on the sun tattoo. “Yes. I really live here.”\u003c/p\u003e\n\u003cp\u003e“This is… I don’t even know.” He laughed again, and I met his stare. “Really crazy.”\u003c/p\u003e\n\u003cp\u003e“Why?” Besides the fact he was standing in my apartment hallway, shirtless and barefoot, holding a tortoise named Raphael? \u003c/p\u003e","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-3.html","bookId":2001,"creation":"Oct 5, 2019 6:35:23 PM","modification":"Oct 5, 2019 6:35:23 PM"}
