{"id":98549,"no":30,"title":"Page 30","content":"\u003cp\u003eCam stopped without any warning, causing me to crash into his chest. His hands fell to my hips as he lowered his forehead to mine. “Forget the dishes. Come play with me, sweetheart.”\u003c/p\u003e\n\u003cp\u003eCrap. He had me a sweetheart.\u003c/p\u003e\n\u003cp\u003eI’d just changed into my pajamas and slid my legs under the covers when there was a soft knock on the bedroom door. I rose onto my elbows. My heart jumped as Cam opened the door halfway.\u003c/p\u003e\n\u003cp\u003e“Hey,” he said, a slight grin on his face.\u003c/p\u003e\n\u003cp\u003e“Hi.” The one word came out a half whisper, half croak.\u003c/p\u003e\n\u003cp\u003eThat lopsided grin spread an inch. “I wanted to say goodnight.”\u003c/p\u003e\n\u003cp\u003eA flutter took up residency deep inside my chest and my lower stomach. My hand clenched the edge of the down comforter. “You already told me goodnight.”\u003c/p\u003e\n\u003cp\u003e“I did.” He stepped into the room and my gaze slipped down the length of him. Cam made a gray shirt and flannel pajama bottoms look good. “But I didn’t. Not in the way I want to say goodnight.”\u003c/p\u003e\n\u003cp\u003eOh dear sweet mercy me…\u003c/p\u003e\n\u003cp\u003eCam quietly shut the door behind him. The click of the latch catching caused my heart to pound with him being in here, while I was in bed in nothing more than a thin, long sleeve shirt and cotton shorts. That was all.\u003c/p\u003e\n\u003cp\u003eI held my breath as I watched him make his way to the bed. He sat beside me, his hip resting against my leg. In the dim light of the room, his eyes shone like dark jewels as they moved over my face and down, to my chest. Under his intense gaze, my nipples immediately puckered against my shirt.\u003c/p\u003e\n\u003cp\u003eHis gaze flicked up to my face, and I sucked in a soft breath. The nest of butterflies were back in my stomach, trying to make their way out. “I’m glad you decided to come here,” he said, voice gruff.\u003c/p\u003e\n\u003cp\u003eI shivered. “I am, too.”\u003c/p\u003e\n\u003cp\u003e“Really?” Cam planted a hand on the other side of my hip. “Did you just admit that?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I sort of did.”\u003c/p\u003e\n\u003cp\u003eHe leaned in so that his upper body hovered over mine. “I wish I had my phone to record this moment.”\u003c/p\u003e\n\u003cp\u003eMy gaze dipped to his mouth. A witty retort slipped out of my grasp. I wetted my lower lip and his parted. My chest rose sharply as I forced my eyes up to meet his. “I’ve… had a wonderful time.”\u003c/p\u003e\n\u003cp\u003e“So have I.” The look in his eyes softened just a bit, but there was still a heated edge to his stare. “So what do you think you’re going to do for winter break?”\u003c/p\u003e\n\u003cp\u003eKnowing that he’d overheard the conversation I had with his mom, I didn’t lie. “I don’t know. I thought about taking off for D.C. one of the days. I want to see the Smithsonian and the National Mall. I’ve never been.”\u003c/p\u003e\n\u003cp\u003e“Hmm, that could be fun. I could be your tour guide.”\u003c/p\u003e\n\u003cp\u003eA small grin pulled at my lips. “That… that would be fun.”\u003c/p\u003e\n\u003cp\u003e“It would be,” he said, his voice warm on my cheek. “Pick a date.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“Now.”\u003c/p\u003e\n\u003cp\u003e“January the second,” I said immediately, and then flushed. “Will you be available then?”\u003c/p\u003e\n\u003cp\u003e“I’ll be available whenever you want me to be.”\u003c/p\u003e\n\u003cp\u003eThat delighted me to no end and my grin spread.\u003c/p\u003e\n\u003cp\u003e“Guess what, Avery?”\u003c/p\u003e\n\u003cp\u003e“What?” I wondered if he could see how fast my heart was beating beneath my shirt.\u003c/p\u003e\n\u003cp\u003e“Remember how you just said you were having a good time?” Cam lowered his head so that our mouths were scant inches apart. “It’s about to get better.”\u003c/p\u003e\n\u003cp\u003e“Is it?”\u003c/p\u003e\n\u003cp\u003eHe shifted his head and his nose grazed mine. “Oh, yeah.”\u003c/p\u003e\n\u003cp\u003e“Are you not going to kiss me again?”\u003c/p\u003e\n\u003cp\u003eHis lips tipped up. “That’s exactly what I’m going to do.”\u003c/p\u003e\n\u003cp\u003eWarmth slid through my veins as my body tensed in a welcomed, delicious way. My eyes fluttered shut as his lips brushed mine once and then twice, as if he was getting reacquainted with the feel of them. The slight, barely there touch was nerve racking.\u003c/p\u003e\n\u003cp\u003eCam shifted his weight onto his left arm and with his other hand, he spread his fingers along my cheek. He placed a kiss to the corner of my lips and the other side before sliding his hand back around the nape of my neck. His lips moved along my jaw, trailing a fiery path to my ear. A shiver danced along my skin, eliciting a deep, husky chuckle from him. His lips pressed against the sensitive spot under my ear, and a moan crawled up my throat.\u003c/p\u003e\n\u003cp\u003e“Goodnight, Avery.”\u003c/p\u003e\n\u003cp\u003eAnd then he kissed me—kissed me like he’d had right before he’d left the night of our date. Kissed me like he was a man starving for oxygen and I was the only air he needed to breathe. The hand around my neck held me there, raised up on my elbows as his mouth devoured mine. And that was the only word I could use to accurately explained how he kissed me.\u003c/p\u003e\n\u003cp\u003eCam devoured me.\u003c/p\u003e\n\u003cp\u003eMy lips opened, needing almost no coaxing, and his tongue slipped in, teasing mine as his hand tightened behind my neck. He tasted like toothpaste and it had my senses spinning. A sound rumbled from deep inside his chest as he pushed back, sliding his hand out from under me.\u003c/p\u003e\n\u003cp\u003eThe moment my head hit the pillow, a tiny burst of panic kicked the air out of my lungs. Where was this heading? I thought about his sister being down the hall and his parents sleeping on the floor above, but then he kissed me again, a sweet tender kiss as he cupped my cheek. The panic eased off, the thoughts slipped away.\u003c/p\u003e\n\u003cp\u003eCam hovered above me and I wanted to feel him on me, our bodies pressed together. Once that need took root, warring emotions rose inside me. Was this too much? Not enough? He caught my lower lip between his teeth, and a moan escaped me.\u003c/p\u003e\n\u003cp\u003eI was going to go with not enough.\u003c/p\u003e\n\u003cp\u003eIn an act of supreme bravery fueled by desire, I reached down and slid my hands under the hem of his shirt. Cam jerked as my fingers grazed his bare, taut skin. He stilled for a moment and then he pulled away. I almost demanded to know why, because I’d come this far to actually touch him and he was leaving me? What in the holy hell was up with that?\u003c/p\u003e\n\u003cp\u003eCam reached down and pulled his shirt off, over his head.\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eMy breath hitched as I soaked him in. Cam’s body was gorgeous. All smooth, tight skin stretched over rock hard muscle. I wanted to ask about the tattoo and if it symbolized something to him, but couldn’t force the words from my mouth.\u003c/p\u003e\n\u003cp\u003eHe yanked the comforter down, and my heart jumped. Immediately, I thought about what I had done in the bed. Our gazes locked and I couldn’t move or breathe. He climbed over me, his arms caging me in, surrounding me in a way that made me feel small… and safe. My hands went to his stomach, flattening against his skin. The muscles of his abs spasmed.\u003c/p\u003e\n\u003cp\u003eCam dropped his forehead to mine. “You have no idea what you do to me.”\u003c/p\u003e\n\u003cp\u003eI didn’t, but as he lowered himself onto me, I started to get a good idea. I could feel him against my stomach, through our clothes, hard and thick. I thought that would pull me out of the heady haze of desire, but it didn’t. Heat flared between my thighs, my pulse pounded throughout my body. I shifted under him, bringing him closer to where I ached for him.\u003c/p\u003e\n\u003cp\u003e“Fuck,” he growled, his large body shaking.\u003c/p\u003e\n\u003cp\u003eHe captured my lips in a searing kiss as he settled between my legs, muffling the pleasant groan that had worked its way up my throat. His hips rolled into mine, and my nerve endings were suddenly on fire. The thin material of my pajamas were nothing between the hard, hot skin of his chest and mine. His hips made another slow thrust that had my toes curling as I gripped his sides. His kiss turned deeper, more urgent as he slid his hand from my cheek, down my neck. His hand brushed the swell of my breast, so close to the sensitive bud before following the curve of my stomach to the flare of my hips. He curved his hand around my thigh, lifting my leg around his hip. He settled deeper, pressing against my sex in a way that thrilled me at the same time it stirred a conflicting emotion. When his hips rocked again, I whimpered against his lips.\u003c/p\u003e\n\u003cp\u003e“I like that sound,” he said, moving his hips. I made it again, flushing. “Correction. I love that fucking sound.”\u003c/p\u003e\n\u003cp\u003eSensations raced across my skin, building into an ache in my core. It was like the night in my bed but much stronger, more intense and so very real. His hand was on the move again, trailing up my side, jumping to my hand. His fingers tangled with mine for a second and then drifted up, under my sleeves as his tongue danced with mine.\u003c/p\u003e\n\u003cp\u003eSuddenly, he stilled above me and lifted his head. I forced my eyes open as I dragged in a deep breath. The look on his face; I didn’t understand it.\u003c/p\u003e\n\u003cp\u003e“Cam?”\u003c/p\u003e\n\u003cp\u003eWithout saying a word, he lifted my arm and turned it over. My heart dropped. No. No. It was like slow motion. His fingers moved, thumb sliding over the length of the deep scar that cut across my vein.\u003c/p\u003e\n\u003cp\u003eHe looked.\u003c/p\u003e\n\u003cp\u003eI followed his gaze.\u003c/p\u003e\n\u003cp\u003eDisbelief exploded, suffocating all the wonderful feelings that had been building in me. His thumb moved again, as if he was trying to wipe the scar away and then when it remained, he shifted his gaze to mine. There was no mistaking it. He knew—he knew what the scar was.\u003c/p\u003e\n\u003cp\u003e“Avery…?” he whispered, brows furrowed and face taut. “Oh, Avery, what is this?”\u003c/p\u003e\n\u003cp\u003eHorror swept the disbelief away, like a rolling tide. The pained expression etched into his striking face reached down into me, sinking deep with razor sharp claws and tore me apart. The look on his face, it… it destroyed me in a way nothing else could since that night on Halloween.\u003c/p\u003e\n\u003cp\u003eThe scar—I never wanted anyone to ever see it, to witness just how weak I’d been once upon a time. It went beyond humiliation.\u003c/p\u003e\n\u003cp\u003eTearing my arm free, I scrambled out from underneath him. My body flashed between hot and cold as I yanked the sleeve down over my bare wrist.\u003c/p\u003e\n\u003cp\u003e“Avery…” He reached for me.\u003c/p\u003e\n\u003cp\u003e“Please,” I said, pushing myself to the edge of the bed. “Please leave.”\u003c/p\u003e\n\u003cp\u003eCam pulled his hand back. “Avery, talk to me.”\u003c/p\u003e\n\u003cp\u003eI shook my head, lip trembling.\u003c/p\u003e\n\u003cp\u003eA muscle worked in his jaw. “Avery—”\u003c/p\u003e\n\u003cp\u003e“Leave!” I jumped from the bed, stumbling back a step. “Just leave.”\u003c/p\u003e\n\u003cp\u003eCam froze for a second, as if he was about to say something else, but then he pushed off the bed. He backed toward the door as a deep shudder started working its way through my body. With his hand on the door knob, he stopped.\u003c/p\u003e\n\u003cp\u003e“Avery, we can talk—”\u003c/p\u003e\n\u003cp\u003e“Leave.” My voice broke. “Please.”\u003c/p\u003e\n\u003cp\u003eHis shoulders stiffened and then he did as I asked. Cam left, closing the door quietly behind him.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eI didn’t go to astronomy class on Monday or Tuesday. I just couldn’t bring myself to face Cam. Not after I’d seen the look on his face when he realized what the scar on my wrist was from. Not after having to pretend like everything was okay in front of his mom and dad before we left. Even though I’d only known them for a short period, I thought they were wonderful and hated the fact that I was leaving knowing the likelihood of ever seeing them again was low. Not after the tense, never-ending ride home Friday morning or when Cam had followed me up to my apartment and tried to talk to me.\u003c/p\u003e\n\u003cp\u003eAnd definitely not after he tried to come over Sunday morning with eggs and I didn’t answer the door.\u003c/p\u003e\n\u003cp\u003eI spent most of the weekend in bed, my eyes aching so badly from the nonstop sob-fest that I didn’t think was truly over. I’d avoided my phone. Brit texted. Jacob texted. \u003c/p\u003e","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-30.html","bookId":2001,"creation":"Oct 5, 2019 6:35:23 PM","modification":"Oct 5, 2019 6:35:23 PM"}
