{"id":103328,"no":11,"title":"Page 11","content":"\u003cp\u003eWhat Jack saw took his breath away.\u003c/p\u003e\n\u003cp\u003e\"No one comes here but me,\" Grace said softly. \"I don\u0027t know why.\"\u003c/p\u003e\n\u003cp\u003eThe light, the ripple through the air as the sun slid through the uneven glass of the ancient windows...\u003c/p\u003e\n\u003cp\u003e\"In the winter especially,\" she continued, her voice just a little hesitant, \"it\u0027s magic. I can\u0027t explain it. I think the sun dips lower. And with the snow...\"\u003c/p\u003e\n\u003cp\u003eIt was the light. It had to be. It was the way the light trembled, and fell on her.\u003c/p\u003e\n\u003cp\u003eHis heart clenched. Like a fist it hit him - this need, this overwhelming urge...He could not speak. He could not even begin to articulate it, but -\u003c/p\u003e\n\u003cp\u003e\"Jack?\" she whispered, and it was just enough to break his trance.\u003c/p\u003e\n\u003cp\u003e\"Grace.\" It was just one word, but it was a benediction. This went beyond desire, it was need. It was an indefinable, inexplicable, living, pulsing thing within him that could only be tamed by her. If he didn\u0027t hold her, didn\u0027t touch her in that very moment, something within him would die.\u003c/p\u003e\n\u003cp\u003eTo a man who tried to treat life as an endless series of ironies and witticisms, nothing could have been more terrifying.\u003c/p\u003e\n\u003cp\u003eHe reached out and roughly pulled her to him. He was not delicate, nor was he gentle. He couldn\u0027t be. He couldn\u0027t manage it, not now, not when he needed her so desperately.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said again, because that\u0027s what she was to him. It was impossible that he\u0027d known her but a day. She was his grace, his Grace, and it was like she had always been there within him, waiting for him to finally open his eyes and find her.\u003c/p\u003e\n\u003cp\u003eHis hands cupped her face. She was a priceless treasure, and yet he could not force himself to touch her with the reverence she deserved. Instead, his fingers were clumsy, his body rough and pounding. Her eyes - so clear, so blue - he thought he might drown in them. He wanted to drown in them, to lose himself within her and never leave.\u003c/p\u003e\n\u003cp\u003eHis lips touched hers, and then - of this he was certain - he was lost. There was nothing more for him but this woman, in this moment, maybe even for all his moments thereafter.\u003c/p\u003e\n\u003cp\u003e\"Jack,\" she sighed. It was the first time all morning she\u0027d used his name, and it sent waves of desire pulsing through his already taut body.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said in return, because he was afraid to say anything else, afraid that for the first time in his life his glib tongue would fail him, and his words would come out wrong. He\u0027d say something and it would mean too little, or perhaps he\u0027d say something and it would mean too much. And then she would know, if by some miracle she did not already, that she had bewitched him.\u003c/p\u003e\n\u003cp\u003eHe kissed her hungrily, passionately, with all the fire within him. His hands slid down her back, memorizing the gentle slope of her spine, and when he reached the more lush curves of her bottom, he could not help it - he pressed her more firmly against him. He was aroused, and wound more tightly than he\u0027d ever imagined possible, and all he could think - if he was thinking at all - was that he needed her close, closer. Whatever he could get, whatever he could have - right now he would take it.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said again, one of his hands moving to the spot where her dress touched her skin, just at her collarbone.\u003c/p\u003e\n\u003cp\u003eShe flinched at his touch, and he stilled, barely able to imagine how he would tear himself away. But her hand covered his, and she whispered, \"I was surprised.\"\u003c/p\u003e\n\u003cp\u003eIt was only then that he once again breathed.\u003c/p\u003e\n\u003cp\u003eFingers shaking, he traced the delicately scalloped edge of her bodice. Her pulse seemed to leap beneath his touch, and never in his life had he been so aware of a single sound - the quiet rasp of air, brushing across her lips.\u003c/p\u003e\n\u003cp\u003e\"You are so beautiful,\" he whispered, and the amazing thing was that he was not even looking at her face. It was merely her skin, the pale, milky hue of it, the soft blush of pink that followed his fingers.\u003c/p\u003e\n\u003cp\u003eSoftly, gently, he bowed his head and brushed his lips along the hollow at the base of her throat. She gasped then, or maybe it was a moan, and her head slowly fell back in silent agreement. Her arms were around him and her hands in his hair, and then, without even considering what it meant, he swept her into his arms and carried her across the room, to the low, wide settee that sat near the window, bathed in the magical sunlight that had seduced them both.\u003c/p\u003e\n\u003cp\u003eFor a moment, kneeling at her side, he could do nothing but look at her, then one of his trembling hands reached forth to stroke her cheek. She was staring up at him, and in her eyes there was wonder, and anticipation, and yes, a little nervousness.\u003c/p\u003e\n\u003cp\u003eBut there was also trust. She wanted him. Him. No one else. She had never been kissed before, of that he was certain. She could have done. Of that he was even more certain. A woman of Grace\u0027s beauty did not reach her age without having refused (or rebuffed) multiple advances.\u003c/p\u003e\n\u003cp\u003eShe had waited. She had waited for him.\u003c/p\u003e\n\u003cp\u003eStill kneeling beside her, he bent to kiss her, his hand moving down the side of her face to her shoulder, then to her hip. His passion grew deeper, and hers, too; she was returning his kiss with an unschooled eagerness that left him breathless with desire.\u003c/p\u003e\n\u003cp\u003e\"Grace, Grace,\" he moaned, his voice lost in the warmth of her mouth. His hand found the hem of her dress and then slid under, grasping the slender circle of her ankle. And then up...up...to her knee. And higher. Until he could bear it no longer, and he moved to the settee himself, partially covering her with his own body.\u003c/p\u003e\n\u003cp\u003eHis lips had moved to her neck, and he felt her sharply indrawn breath on his cheek. But she did not say no. She did not cover his hand with hers and bring him to a stop. She did nothing but whisper his name and arch her hips beneath him.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t have known what the movement had meant, could never have known what it would do to him, but that ever-so-slight pressure beneath him, rising up against his own desire, brought him to the very peak of need.\u003c/p\u003e\n\u003cp\u003eHe kissed his way down her neck, to the gentle swell of her breast, his lips finding the very spot at the edge of her bodice that his fingers had so recently traveled. He lifted himself away from her, just a bit, just enough so he could slide his finger under the hem and slide it down, or maybe push her up - whichever was needed to free her to his devotion.\u003c/p\u003e\n\u003cp\u003eBut just when his hand had moved toward his destination, just when he\u0027d had one glorious second to cup the fullness of her, skin to skin, the stiff edge peaking in his palm, she cried out. Softly, with surprise.\u003c/p\u003e\n\u003cp\u003eAnd dismay.\u003c/p\u003e\n\u003cp\u003e\"No, I can\u0027t.\" With jerky movements she scrambled to her feet, righting her dress. Her hands were shaking. More than shaking. They seemed filled with a foreign, nervous energy, and when he looked in her eyes, it was as if a knife had pierced him.\u003c/p\u003e\n\u003cp\u003eIt was not revulsion, it was not fear. What he saw was anguish.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said, moving toward her. \"What is wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she said, stepping back. \"I - I shouldn\u0027t have. Not now. Not until - \" One of her hands flew up to cover her mouth.\u003c/p\u003e\n\u003cp\u003e\"Not until...? Grace? Not until what?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she said again, confirming his belief that those were the worst two words in the English language. She bobbed a quick, perfunctory curtsy. \"I must go.\"\u003c/p\u003e\n\u003cp\u003eAnd then she ran from the room, leaving him quite alone. He stared at the empty doorway for a full minute, trying to figure out just what had happened. And it was only when he finally stepped into the hall that he realized he hadn\u0027t a clue how to get back to his bedchamber.\u003c/p\u003e\n\u003cp\u003eGrace dashed through Belgrave, half walking, half skipping...running...whatever it was she needed to do to reach her room with the most equal balance of dignity and speed. If the servants saw her - and she couldn\u0027t imagine they didn\u0027t; they seemed positively everywhere this morning - they must have wondered at her distress.\u003c/p\u003e\n\u003cp\u003eThe dowager would not expect her. Surely she would think she was still showing Mr. Audley the house.\u003c/p\u003e\n\u003cp\u003eGrace had at least an hour before she might need to show her face.\u003c/p\u003e\n\u003cp\u003eDear God, what had she done? If she had not finally remembered herself, remembered who he was, and who he might be, she would have let him continue. She\u0027d wanted it. She\u0027d wanted it with a fervor that had shocked her. When he\u0027d taken her hand, when he\u0027d pulled her to him, he awakened something within her.\u003c/p\u003e\n\u003cp\u003eNo. It had been awakened two nights earlier. On that moonlit night, standing outside the carriage, something had been born within her. And now...\u003c/p\u003e\n\u003cp\u003eShe sat upon her bed, wanting to bury herself in the covers but instead just sitting there, staring at the wall. There was no going back. One couldn\u0027t ever not have been kissed once the deed was done.\u003c/p\u003e\n\u003cp\u003eWith a nervous breath, maybe even a frantic laugh, she covered her face with her hands. Could she possibly have chosen anyone less suitable with whom to fall in love? Not that this was the measure of her feelings, she hastened to reassure herself, but she was not so much of a fool that she could not recognize her leanings. If she let herself...If she let him...\u003c/p\u003e\n\u003cp\u003eShe would fall in love.\u003c/p\u003e\n\u003cp\u003eGood heavens.\u003c/p\u003e\n\u003cp\u003eEither he was a highwayman, and now she was destined to be the consort of an outlaw, or he was the true Duke of Wyndham, which meant -\u003c/p\u003e\n\u003cp\u003eShe laughed because really, this was funny. It had to be funny. If it wasn\u0027t funny, then it could only be tragic, and she didn\u0027t think she could manage that just now.\u003c/p\u003e\n\u003cp\u003eWonderful. Perhaps she was falling in love with the Duke of Wyndham. Now that was appropriate. Let\u0027s see, how many ways was this a disaster? He was her employer, for one, he owned the house in which she lived, and his rank was so far above hers as to be nearly immeasurable.\u003c/p\u003e\n\u003cp\u003eAnd then there was Amelia. She and Thomas certainly did not suit, but she had every right to expect that she would be the Duchess of Wyndham upon her marriage. Grace could not imagine how crass and overreaching she would appear to the Willoughbys - her good friends - if she were seen to be throwing herself at the new duke.\u003c/p\u003e\n\u003cp\u003eGrace closed her eyes and touched the tips of her fingers to her lips. If she breathed deeply enough she almost relaxed. And she could almost still feel his presence, his touch, the warmth of his skin.\u003c/p\u003e\n\u003cp\u003eIt was awful.\u003c/p\u003e\n\u003cp\u003eIt was wonderful.\u003c/p\u003e\n\u003cp\u003eShe was a fool.\u003c/p\u003e\n\u003cp\u003eShe lay down, let out a long, weary breath. Funny how she\u0027d hoped for change, for something to break the monotony of her days attending to the dowager. Life was a mocking sort of thing, wasn\u0027t it? And love...\u003c/p\u003e\n\u003cp\u003eLove was the cruelest joke of all.\u003c/p\u003e\n\u003cp\u003e\"Lady Amelia is here to see you, Miss Eversleigh.\"\u003c/p\u003e\n\u003cp\u003eGrace jolted upright, blinking furiously. She must have fallen asleep. She could not recall the last time she had done so at midday. \"Lady Amelia?\" she echoed, surprised. \"With Lady Elizabeth?\"\u003c/p\u003e\n\u003cp\u003e\"No, miss,\" the maid informed her. \"She is alone.\"\u003c/p\u003e\n\u003cp\u003e\"How curious.\" Grace sat up, flexing her feet and hands to awaken her body. \"Please tell her I shall be right there.\" She waited for the maid to depart, then went to her small mirror to straighten her hair. It was worse than she\u0027d feared, although she could not be certain whether it had been mussed in sleep or by Mr.\u003c/p\u003e\n\u003cp\u003eAudley.\u003c/p\u003e\n\u003cp\u003eShe felt her skin flush at the memory, and she groaned at that. Gathering her determination, she repinned her hair and left the room, walking as briskly as she could, as if speed and a set of squared shoulders could keep all of her worries at bay.\u003c/p\u003e\n\u003cp\u003eOr at the very least, make her look as if she did not care.\u003c/p\u003e\n\u003cp\u003eIt did seem odd that Amelia would come to Belgrave without Elizabeth. Grace did not know that she had ever done so before. Certainly not to see her. Grace wondered if her original intention had been to call upon Thomas, who was, as far as she knew, still out.\u003c/p\u003e\n\u003cp\u003eShe hurried down the stairs, then turned to make for the front drawing room. But she\u0027d not taken more than a dozen steps before someone grabbed her arm and yanked her into a side room.\u003c/p\u003e\n\u003cp\u003e\"Thomas!\" she exclaimed. It was indeed he, somewhat haggard and sporting a nasty bruise under his left eye. His appearance was a shock; she had never seen him looking so rumpled before. His shirt was wrinkled, his cravat missing, and his hair had most definitely not been styled a la Brutus.\u003c/p\u003e\n\u003cp\u003eOr even a la human.\u003c/p\u003e\n\u003cp\u003eAnd then there were his eyes, which were most uncharacteristically red-rimmed.\u003c/p\u003e\n\u003cp\u003e\"What happened to you?\"\u003c/p\u003e\n\u003cp\u003eHe put a finger to his lips and shut the door. \"Were you expecting someone else?\" he asked, and her cheeks grew warm. Indeed, when she\u0027d felt a strong male hand close around her arm and pull, she had assumed it was Mr. Audley, trying to steal a kiss.\u003c/p\u003e\n\u003cp\u003eHer flush grew deeper as she realized she had been disappointed to realize that it was not.\u003c/p\u003e\n\u003cp\u003e\"No, of course not,\" she said quickly, even though she suspected he knew she was lying. She quickly glanced around the room to see if they were alone. \"What is wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I needed to speak with you before you see Lady Amelia.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, then you know she is here?\"\u003c/p\u003e\n\u003cp\u003e\"I brought her,\" he confirmed.\u003c/p\u003e\n\u003cp\u003eHer eyes widened. That was news. He had been out all night and was considerably worse for the wear.\u003c/p\u003e\n\u003cp\u003eShe glanced at a nearby clock. It was not yet even noon. When could he have collected Amelia? And where?\u003c/p\u003e\n\u003cp\u003eAnd why?\u003c/p\u003e\n\u003cp\u003e\"It is a long story,\" he said, clearly to cut her off before she could ask any questions. \"But suffice it to say, she will inform you that you were in Stamford this morning, and you invited her back to Belgrave.\"\u003c/p\u003e\n\u003cp\u003eHer brows rose. If he was asking her to lie, it was very serious, indeed. \"Thomas, any number of people know quite well that I was not in Stamford this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but her mother is not among that number.\"\u003c/p\u003e\n\u003cp\u003eGrace wasn\u0027t sure if she should be shocked or delighted. Had he compromised Amelia? Why else would they need to lie to her mother? \"Er, Thomas...\" she began, unsure of how to proceed. \"I feel I must tell you, given the number of delays thus far, I would imagine that Lady Crowland would be delighted to know - \"\u003c/p\u003e\n\u003cp\u003e\"Oh for God\u0027s sake, it is nothing like that,\" he muttered. \"Amelia assisted me home when I was\" - he blushed then. Blushed! Thomas! - \"impaired.\"\u003c/p\u003e\n\u003cp\u003eGrace bit her lip to keep from smiling. It was quite remarkable what a pleasant image that was - Thomas allowing himself to be anything less than perfectly composed. \"That was most charitable of her,\" she said, perhaps a little too primly. But really, it couldn\u0027t be helped.\u003c/p\u003e\n\u003cp\u003eHe glared at her, which only made it more difficult to maintain an even face.\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. \"Have you, er, considered tidying up?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he snapped, \"I rather enjoy looking like a slovenly fool.\"\u003c/p\u003e\n\u003cp\u003eGrace winced at that.\u003c/p\u003e\n\u003cp\u003e\"Now listen,\" he continued, looking terribly determined. \"Amelia will repeat what I have told you, but it is imperative that you not tell her about Mr. Audley.\"\u003c/p\u003e\n\u003cp\u003e\"I would never do that,\" Grace said quickly. \"It is not my place.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\"\u003c/p\u003e\n\u003cp\u003e\"But she will want to know why you were, er...\" Oh, dear, how to put it politely?\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know why,\" he said firmly. \"Just tell her that. Why would she suspect that you would know more?\"\u003c/p\u003e\n\u003cp\u003e\"She knows that I consider you a friend,\" Grace said. \"And furthermore, I live here. Servants always know everything. She knows that.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a servant,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"I am and you know it,\" she replied, almost amused. \"The only difference is that I am allowed to wear finer clothing and occasionally converse with the guests. But I assure you, I am privy to all of the household gossip.\"\u003c/p\u003e\n\u003cp\u003eFor several seconds he did nothing but stare, as if waiting for her to laugh and say, Only joking! Finally he muttered something under his breath that she was quite certain she was not meant to understand (and indeed she did not; servants\u0027 gossip was occasionally risque, but it was never profane).\u003c/p\u003e\n\u003cp\u003e\"For me, Grace,\" he said, his eyes boring into hers, \"will you please just tell her you don\u0027t know?\"\u003c/p\u003e\n\u003cp\u003eIt was the closest she had ever heard him come to begging, and it left her disoriented and acutely uncomfortable. \"Of course,\" she said quickly. \"You have my word.\"\u003c/p\u003e\n\u003cp\u003eHe nodded briskly. \"Amelia will be expecting you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Yes, of course.\" Grace hurried to the door, but when her hand touched the knob, she found she was not quite ready to go. She turned around, taking one last look at his face.\u003c/p\u003e\n\u003cp\u003eHe was not himself. No one could blame him; it had been a most extraordinary two days. But still, it worried her.\u003c/p\u003e\n\u003cp\u003e\"Will you be all right?\" she asked.\u003c/p\u003e\n\u003cp\u003eAnd immediately regretted that she had done so. His face seemed to move, and twist, and she could not be sure if he was going to laugh or cry. But she did know that she did not want to be witness to either.\u003c/p\u003e\n\u003cp\u003e\"No, don\u0027t answer that,\" she mumbled, and she ran from the room. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-lost-duke-of-wyndham-two-dukes-of-wyndham-1/page-11.html","bookId":2642,"creation":"Oct 5, 2019 10:25:45 PM","modification":"Oct 5, 2019 10:25:45 PM"}
