{"id":103332,"no":15,"title":"Page 15","content":"\u003cp\u003eIn his wanderings at Belgrave, Jack had, during a rainstorm that had trapped him indoors, managed to locate a collection of books devoted to art. It had not been easy; the castle boasted two separate libraries, and each must have held five hundred volumes at least. But art books, he noticed, tended to be oversized, so he was able to make his task a bit easier by searching out the sections with the tallest spines. He pulled out these books, perused them and, after some trial and error, found what he was looking for.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t particularly wish to remain in the library, however; he\u0027d always found it oppressive to be surrounded by so many books. So he\u0027d gathered up those that looked the most interesting and took them to his new favorite room - the cream and gold drawing room at the back of the castle.\u003c/p\u003e\n\u003cp\u003eGrace\u0027s room. He would never be able to think of it as anything else.\u003c/p\u003e\n\u003cp\u003eIt was to this room that he retreated after his embarrassing encounter with Grace in the great hall. He did not like to lose his temper; to be more precise, he loathed it.\u003c/p\u003e\n\u003cp\u003eHe sat there for hours, tucked into place at a reading table, occasionally rising to stretch his legs. He was on his final volume - a study of the French rococo style - when a footman walked by the open doorway, stopped, then backed up.\u003c/p\u003e\n\u003cp\u003eJack looked back at him, arching a brow in question, but the young man said nothing, just scurried off in the direction from which he\u0027d come.\u003c/p\u003e\n\u003cp\u003eTwo minutes later Jack was rewarded for his patience by the sound of feminine footsteps in the hall.\u003c/p\u003e\n\u003cp\u003eGrace\u0027s footsteps.\u003c/p\u003e\n\u003cp\u003eHe pretended to be engrossed in his book.\u003c/p\u003e\n\u003cp\u003e\"Oh, you\u0027re reading,\" she said, sounding surprised.\u003c/p\u003e\n\u003cp\u003eHe carefully turned a page. \"I do so on occasion.\"\u003c/p\u003e\n\u003cp\u003eHe could practically hear her roll her eyes as she walked in. \"I\u0027ve been looking everywhere for you.\"\u003c/p\u003e\n\u003cp\u003eHe looked up and affixed a smile. \"And yet here I am.\"\u003c/p\u003e\n\u003cp\u003eShe stood hesitantly in the doorway, her hands clasped tightly before her. She was nervous, he realized.\u003c/p\u003e\n\u003cp\u003eHe hated himself for that.\u003c/p\u003e\n\u003cp\u003eHe tilted his head in invitation, motioning to the chair beside him.\u003c/p\u003e\n\u003cp\u003e\"What are you reading?\" she asked, coming into the room.\u003c/p\u003e\n\u003cp\u003eHe turned his book toward the empty seat at the table. \"Have a look.\"\u003c/p\u003e\n\u003cp\u003eShe did not sit immediately. Rather, she rested her hands at the edge of the table and leaned forward, peering down at the open pages. \"Art,\" she said.\u003c/p\u003e\n\u003cp\u003e\"My second favorite subject.\"\u003c/p\u003e\n\u003cp\u003eShe gave him a shrewd look. \"You wish for me to ask you what your favorite is.\"\u003c/p\u003e\n\u003cp\u003e\"Am I so obvious?\"\u003c/p\u003e\n\u003cp\u003e\"You are only obvious when you wish to be.\"\u003c/p\u003e\n\u003cp\u003eHe held up his hands in mock dismay. \"And alas, it still doesn\u0027t work. You have not asked me what my favorite subject is.\"\u003c/p\u003e\n\u003cp\u003e\"Because,\" she returned, sitting down, \"I am quite certain the answer will contain something highly inappropriate.\"\u003c/p\u003e\n\u003cp\u003eHe placed one hand on his chest, the dramatic gesture somehow restoring his equilibrium. It was easier to play the jester. No one expected as much from fools. \"I am wounded,\" he proclaimed. \"I promise you, I was not going to say that my favorite subject was seduction, or the art of a kiss, or the proper way to remove a lady\u0027s glove, or for that matter the proper way to remove - \"\u003c/p\u003e\n\u003cp\u003e\"Stop!\"\u003c/p\u003e\n\u003cp\u003e\"I was going to say,\" he said, trying to sound beleaguered and henpecked, \"that my favorite subject of late is you.\"\u003c/p\u003e\n\u003cp\u003eTheir eyes met, but only for a moment. Something unnerved her, and she quickly shifted her gaze to her lap. He watched her, mesmerized by the play of emotions on her face, by the way her hands, which were clasped together atop the table, tensed and moved.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this painting,\" she said quite suddenly.\u003c/p\u003e\n\u003cp\u003eHe had to look back at the book to see which image she referred to. It was a man and a woman out of doors, sitting on the grass. The woman\u0027s back was to the canvas, and she seemed to be pushing the man away. Jack was not familiar with it, but he thought he recognized the style. \"The Boucher?\"\u003c/p\u003e\n\u003cp\u003e\"Ye -\u0026nbsp; no,\" she said, blinking in confusion as she leaned forward. She looked down. \"Jean-Antoine Watteau,\" she read. \"The Faux Pas.\"\u003c/p\u003e\n\u003cp\u003eHe looked down more closely. \"Sorry,\" he said, his voice light. \"I\u0027d only just turned the page. I think it does look rather like a Boucher, though. Don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eShe gave a tiny shrug. \"I\u0027m not familiar enough with either artist to say. I did not study painting - or painters - very much as a child. My parents weren\u0027t overly interested in art.\"\u003c/p\u003e\n\u003cp\u003e\"How is that possible?\"\u003c/p\u003e\n\u003cp\u003eShe smiled at that, the sort of smile that was almost a laugh. \"It wasn\u0027t so much that they weren\u0027t interested, just that they were interested in other things more. I think that above all they would have loved to travel. Both of them adored maps and atlases of all sorts.\"\u003c/p\u003e\n\u003cp\u003eJack felt his eyes roll up at that. \"I hate maps.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" She sounded stunned, and maybe just a little bit delighted by his admission. \"Why?\"\u003c/p\u003e\n\u003cp\u003eHe told her the truth. \"I haven\u0027t the talent for reading them.\"\u003c/p\u003e\n\u003cp\u003e\"And you, a highwayman.\"\u003c/p\u003e\n\u003cp\u003e\"What has that to do with it?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you need to know where you\u0027re going?\"\u003c/p\u003e\n\u003cp\u003e\"Not nearly so much as I need to know where I\u0027ve been.\" She looked perplexed at that, so he added,\u003c/p\u003e\n\u003cp\u003e\"There are certain areas of the country - possibly all of Kent, to be honest - it is best that I avoid.\"\u003c/p\u003e\n\u003cp\u003e\"This is one of those moments,\" she said, blinking several times in rapid succession, \"when I am not quite certain if you are being serious.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, very much so,\" he told her, almost cheerfully. \"Except perhaps for the bit about Kent.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him in incomprehension.\u003c/p\u003e\n\u003cp\u003e\"I might have been understating.\"\u003c/p\u003e\n\u003cp\u003e\"Understating,\" she echoed.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a reason I avoid the South.\"\u003c/p\u003e\n\u003cp\u003e\"Good heavens.\"\u003c/p\u003e\n\u003cp\u003eIt was such a ladylike utterance. He almost laughed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I have ever known a man who would admit to being a poor reader of maps,\" she said once she regained her composure.\u003c/p\u003e\n\u003cp\u003eHe let his gaze grow warm, then hot. \"I told you I was special.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, stop.\" She wasn\u0027t looking at him, not directly, at least, and so she did not see his change of expression. Which probably explained why her tone remained so bright and brisk as she said, \"I must say, it does complicate matters. The dowager asked me to find you so that you could aid with our routing once we disembark in Dublin.\"\u003c/p\u003e\n\u003cp\u003eHe waved a hand. \"That I can do.\"\u003c/p\u003e\n\u003cp\u003e\"Without a map?\"\u003c/p\u003e\n\u003cp\u003e\"We went frequently during my school days.\"\u003c/p\u003e\n\u003cp\u003eShe looked up and smiled, almost nostalgically, as if she could see into his memories. \"I\u0027d wager you were not the head boy.\"\u003c/p\u003e\n\u003cp\u003eHe lifted a brow. \"Do you know, I think most people would consider that an insult.\"\u003c/p\u003e\n\u003cp\u003eHer lips curved and her eyes glowed with mischief. \"Oh, but not you.\"\u003c/p\u003e\n\u003cp\u003eShe was right, of course, not that he was going to let her know it. \"And why would you think that?\"\u003c/p\u003e\n\u003cp\u003e\"You would never want to be head boy.\"\u003c/p\u003e\n\u003cp\u003e\"Too much responsibility?\" he murmured, wondering if that was what she thought of him.\u003c/p\u003e\n\u003cp\u003eShe opened her mouth, and he realized that she\u0027d been about to say yes. Her cheeks turned a bit pink, and she looked away for a moment before answering. \"You are too much of a rebel,\" she answered. \"You would not wish to be aligned with the administration.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, the administration,\" he could not help but echo with amusement.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make fun of my choice of words.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" he declared, arching one brow. \"I do hope you realize you are saying this to a former officer in His Majesty\u0027s army.\"\u003c/p\u003e\n\u003cp\u003eThis she dismissed immediately. \"I should have said that you enjoy styling yourself as a rebel. I rather suspect that at heart you\u0027re just as conventional as the rest of us.\"\u003c/p\u003e\n\u003cp\u003eHe paused, and then: \"I hope you realize you are saying this to a former highwayman on His Majesty\u0027s roads.\"\u003c/p\u003e\n\u003cp\u003eHow he said this with a straight face, he\u0027d never know, and indeed it was a relief when Grace, after a moment of shock, burst out laughing. Because really, he didn\u0027t think he could have held that arch, offended expression for one moment longer.\u003c/p\u003e\n\u003cp\u003eHe rather felt like he was imitating Wyndham, sitting there like such a stick. It unsettled the stomach, really.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re dreadful,\" Grace said, wiping her eyes.\u003c/p\u003e\n\u003cp\u003e\"I try my best,\" he said modestly.\u003c/p\u003e\n\u003cp\u003e\"And this\" - she wagged a finger at him, grinning all the while - \"is why you will never be head boy.\"\u003c/p\u003e\n\u003cp\u003e\"Good God, I hope not,\" he returned. \"I\u0027d be a bit out of place at my age.\"\u003c/p\u003e\n\u003cp\u003eNot to mention how desperately wrong he was for school. He still had dreams about it. Certainly not nightmares - it could not be worth the energy. But every month or so he woke up from one of those annoying visions where he was back at school (rather absurdly at his current age of eight-and-twenty). It was always of a similar nature. He looked down at his schedule and suddenly realized he\u0027d forgotten to attend Latin class for an entire term. Or arrived for an exam without his trousers.\u003c/p\u003e\n\u003cp\u003eThe only school subjects he remembered with any fondness were sport and art. Sport had always been easy. He need only watch a game for a minute before his body knew instinctively how to move, and as for art - well, he\u0027d never excelled at any of the practical aspects, but had always loved the study of it. For all the reasons he\u0027d talked about with Grace his first night at Belgrave.\u003c/p\u003e\n\u003cp\u003eHis eyes fell on the book, still open on the table between them. \"Why do you dislike this?\" he asked, motioning to the painting. It was not his favorite, but he did not find anything to offend.\u003c/p\u003e\n\u003cp\u003e\"She does not like him,\" she said. She was looking down at the book, but he was looking at her, and he was surprised to see that her brow was wrinkled. Concern? Anger? He could not tell.\u003c/p\u003e\n\u003cp\u003e\"She does not want his attentions,\" Grace continued. \"And he will not stop. Look at his expression.\"\u003c/p\u003e\n\u003cp\u003eJack peered at the image a little more closely. He supposed he saw what she meant. The reproduction was not what he would consider superior, and it was difficult to know how true it was to the actual painting.\u003c/p\u003e\n\u003cp\u003eCertainly the color would be off, but the lines seemed clear. He supposed there was something insidious in the man\u0027s expression. Still...\u003c/p\u003e\n\u003cp\u003e\"But couldn\u0027t one say,\" he asked, \"that you are objecting to the content of the painting and not the painting itself?\"\u003c/p\u003e\n\u003cp\u003e\"What is the difference?\"\u003c/p\u003e\n\u003cp\u003eHe thought for a moment. It had been some time since anyone had engaged him in what might be termed intellectual discourse. \"Perhaps the artist wishes to invoke this response. Perhaps his intention is to portray this very scene. It does not mean that he endorses it.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose.\" Her lips pressed together, the corners tightening in a manner that he\u0027d not seen before. He did not like it. It aged her. But more than that, it seemed to call to the fore an unhappiness that was almost entrenched. When she moved her mouth like that - angry, upset, resigned - it looked like she would never be happy again.\u003c/p\u003e\n\u003cp\u003eWorse, it looked like she accepted it.\u003c/p\u003e\n\u003cp\u003e\"You do not have to like it,\" he said softly.\u003c/p\u003e\n\u003cp\u003eHer mouth softened but her eyes remained clouded. \"No,\" she said, \"I don\u0027t.\" She reached forward and flipped the page, her fingers changing the subject. \"I have heard of Monsieur Watteau, of course, and he may be a revered artist, but - Oh!\"\u003c/p\u003e\n\u003cp\u003eJack was already smiling. Grace had not been looking at the book as she\u0027d turned the page. But he had.\u003c/p\u003e\n\u003cp\u003e\"Oh my...\"\u003c/p\u003e\n\u003cp\u003e\"Now that\u0027s a Boucher,\" Jack said appreciatively.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not...I\u0027ve never...\" Her eyes were wide - two huge blue moons. Her lips were parted, and her cheeks...He only just managed to resist the urge to fan her.\u003c/p\u003e\n\u003cp\u003e\"Marie-Louise O\u0027Murphy,\" he told her.\u003c/p\u003e\n\u003cp\u003eShe looked up in horror. \"You know her?\"\u003c/p\u003e\n\u003cp\u003eHe shouldn\u0027t have laughed, but truly, he could not help it. \"Every schoolboy knows her. Of her,\" he corrected. \"I believe she passed on recently. In her dotage, have no fear. Tragically, she was old enough to be my grandmother.\"\u003c/p\u003e\n\u003cp\u003eHe gazed down fondly at the woman in the painting, lounging provocatively on a divan. She was naked - wonderfully, gloriously, completely so - and lying on her belly, her back slightly arched as she leaned on the arm of the sofa, peering over the edge. She was painted from the side, but even so, a portion of the cleft of her buttocks was scandalously visible, and her legs...\u003c/p\u003e\n\u003cp\u003eJack sighed happily at the memory. Her legs were spread wide, and he was quite certain he had not been the only schoolboy to have imagined settling himself between them.\u003c/p\u003e\n\u003cp\u003eMany a young lad had lost his virginity (in dreams, but still) to Marie-Louise O\u0027Murphy. He wondered if the lady had ever realized the service she had provided.\u003c/p\u003e\n\u003cp\u003eHe looked up at Grace. She was staring at the painting. He thought - he hoped - she might be growing aroused.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve never seen it before?\" he murmured.\u003c/p\u003e\n\u003cp\u003eShe shook her head. Barely. She was transfixed.\u003c/p\u003e\n\u003cp\u003e\"She was the mistress of the King of France,\" Jack told her. \"It was said that the king saw one of Boucher\u0027s portraits of her - not this one, I think, perhaps a miniature - and he decided he had to have her.\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s mouth opened, as if she wanted to comment, but nothing quite came out.\u003c/p\u003e\n\u003cp\u003e\"She came from the streets of Dublin,\" he said, \"or so I\u0027m told. It is difficult to imagine her obtaining the surname O\u0027Murphy anywhere else.\" He sighed in fond recollection. \"We were always so proud to claim her as one of our own.\"\u003c/p\u003e\n\u003cp\u003eHe moved so that he might stand behind her, leaning over her shoulder. When he spoke, he knew that his words would land on her skin like a kiss. \"It\u0027s quite provocative, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eStill, Grace seemed not to know what to say. Jack did not mind. He had discovered that watching Grace looking at the painting was far more erotic than the painting itself had ever been.\u003c/p\u003e\n\u003cp\u003e\"I always wanted to go see it in person,\" he commented. \"I believe it is in Germany now. Munich, perhaps. But alas, my travels never took me that way.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen anything like it,\" Grace whispered.\u003c/p\u003e\n\u003cp\u003e\"It does make one feel, does it not?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eAnd he wondered - if he had always dreamed of lying between Mademoiselle O\u0027Murphy\u0027s thighs, did Grace now wonder what it was like to be her? Did she imagine herself lying on the divan, exposed to a man\u0027s erotic gaze?\u003c/p\u003e\n\u003cp\u003eTo his gaze.\u003c/p\u003e\n\u003cp\u003eHe would never allow anyone else to see her thus.\u003c/p\u003e\n\u003cp\u003eAround them, the room was silent. He could hear his own breath, each one more shaky than the last.\u003c/p\u003e\n\u003cp\u003eAnd he could hear hers - soft, low, and coming faster with each inhalation.\u003c/p\u003e\n\u003cp\u003eHe wanted her. Desperately. He wanted Grace. He wanted her spread before him like the girl in the painting. He wanted her any way he could have her. He wanted to peel the clothes from her body, and he wanted to worship every inch of her skin.\u003c/p\u003e\n\u003cp\u003eHe could practically feel it, the soft weight of her thighs in his hands as he opened her to him, the musky heat as he moved closer for a kiss.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he whispered.\u003c/p\u003e\n\u003cp\u003eShe was not looking at him. Her eyes were still on the painting in the book. Her tongue darted out, moistening the very center of her lips.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t have known what that did to him.\u003c/p\u003e\n\u003cp\u003eHe reached around her, touching her fingers. She did not pull away.\u003c/p\u003e\n\u003cp\u003e\"Dance with me,\" he murmured, wrapping his hand around her wrist. He tugged at her gently, urging her to her feet.\u003c/p\u003e\n\u003cp\u003e\"There is no music,\" she whispered. But she stood. With no resistance, not even a hint of hesitation, she stood.\u003c/p\u003e\n\u003cp\u003eAnd so he said the one thing that was in his heart.\u003c/p\u003e\n\u003cp\u003e\"We will make it ourselves.\"\u003c/p\u003e\n\u003cp\u003eThere were so many moments when Grace could have said no. When his hand touched hers. When he pulled her to her feet.\u003c/p\u003e\n\u003cp\u003eWhen he\u0027d asked her to dance, despite the lack of music - that would have been a logical moment.\u003c/p\u003e\n\u003cp\u003eBut she didn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe should have. But she didn\u0027t want to.\u003c/p\u003e\n\u003cp\u003eAnd then somehow she was in his arms, and they were waltzing, in time with the soft hum of his voice. It was not an embrace that would ever be allowed in a proper ballroom; he was holding her far too close, and with each step he seemed to draw her closer, until finally the distance between them was measured not in inches but in heat.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said, her name a hoarse, needy moan. But she did not hear the last bit of it, that last consonant. He was kissing her by then, all sound lost in his onslaught.\u003c/p\u003e\n\u003cp\u003eAnd she was kissing him back. Good heavens, she did not think she had ever wanted anything so much as she did this man, in this moment. She wanted him to surround her, to engulf her. She wanted to lose herself in him, to lay her body down and offer herself up to him.\u003c/p\u003e\n\u003cp\u003eAnything, she wanted to whisper. Anything you want.\u003c/p\u003e\n\u003cp\u003eBecause surely he knew what she needed.\u003c/p\u003e\n\u003cp\u003eThe painting of that woman - the French king\u0027s mistress - it had done something to her. She\u0027d been bewitched. There could be no other explanation. She wanted to lie naked on a divan. She wanted to know the sensation of damask rubbing against her belly, while cool, fresh air whispered across her back.\u003c/p\u003e\n\u003cp\u003eShe wanted to know what it felt like to lie that way, with a man\u0027s eyes burning hotly over her form.\u003c/p\u003e\n\u003cp\u003eHis eyes. Only his.\u003c/p\u003e\n\u003cp\u003e\"Jack,\" she whispered, practically throwing herself against him. She needed to feel him, the pressure of him, the strength. She did not want his touch only on her lips; she wanted it everywhere, and everywhere at once.\u003c/p\u003e\n\u003cp\u003eFor a moment he faltered, as if surprised by her sudden enthusiasm, but he quickly recovered, and within seconds he had kicked the door shut and had her pinned up against the wall beside it, never once breaking their kiss.\u003c/p\u003e\n\u003cp\u003eShe was on her toes, pressed so tightly between Jack and the wall that her feet would have dangled in the air if she\u0027d been just an inch higher. His mouth was hungry, and she was breathless, and when he moved down to worship her cheek, and then her throat, it was all she could do to keep her head upright. As it was, her neck was stretching, and she could feel herself arching forward, her breasts aching for closer contact.\u003c/p\u003e\n\u003cp\u003eThis was not their first intimacy, but it was not the same. Before, she\u0027d wanted him to kiss her. She\u0027d wanted to be kissed.\u003c/p\u003e\n\u003cp\u003eBut now...It was as if every pent-up dream and desire had awoken within her, turning her into some strange fiery creature. She felt aggressive. Strong. And she was so damned tired of watching life happen around her.\u003c/p\u003e\n\u003cp\u003e\"Jack...Jack...\" She could not seem to say anything else, not when his teeth were tugging at the bodice of her frock. His fingers were aiding in the endeavor, nimbly unfastening the buttons at her back.\u003c/p\u003e\n\u003cp\u003eBut somehow that wasn\u0027t fair. She wanted to be a part of it, too. \"Me,\" she managed to get out, and she moved her hands, which had been reveling in the crisp silkiness of his hair, to his shirtfront. She slid down the wall, pulling him along with her, until they were both on the floor. Without missing a beat, she made frenetic work of his buttons, yanking his shirt aside once she was through.\u003c/p\u003e\n\u003cp\u003eFor a moment she could do nothing but gaze. Her breath was sucked inside of her, burning to get out, but she could not seem to exhale. She touched him, laying her palm against his chest, a whoosh of air finally escaping her lips when she felt his heart leaping beneath his skin. She stroked upward, and then down, marveling at the contact, until one of his hands roughly covered hers.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said. He swallowed, and she could feel that his fingers were trembling.\u003c/p\u003e\n\u003cp\u003eShe looked up, waiting for him to continue. He could seduce with nothing but a glance, she thought. A touch and she would melt. Did he have any idea the magic he held over her? The power?\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said again, his breath labored. \"I won\u0027t be able to stop soon.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care.\"\u003c/p\u003e\n\u003cp\u003e\"You do.\" His voice was ragged, and it made her want him even more.\u003c/p\u003e\n\u003cp\u003e\"I want you,\" she pleaded. \"I want this.\"\u003c/p\u003e\n\u003cp\u003eHe looked as if he were in pain. She knew she was.\u003c/p\u003e\n\u003cp\u003eHe squeezed her hand, and they both paused. Grace looked up, and their eyes met.\u003c/p\u003e\n\u003cp\u003eAnd held.\u003c/p\u003e\n\u003cp\u003eAnd in that moment, she loved him. She didn\u0027t know what it was he\u0027d done to her, but she was changed.\u003c/p\u003e\n\u003cp\u003eAnd she loved him for it.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t take this from you,\" he said in a rough whisper. \"Not like this.\"\u003c/p\u003e\n\u003cp\u003eThen how? she wanted to ask, but sense was trickling back into her body, and she knew he was right. She had precious little of value in this world - her mother\u0027s tiny pearl earrings, a family Bible, love letters between her parents. But she had her body, and she had her pride, and she could not allow herself to give them to a man who was not to be her husband.\u003c/p\u003e\n\u003cp\u003eAnd they both knew that if he turned out to be the Duke of Wyndham, then he could never be her husband. Grace did not know all of the circumstances of his upbringing, but she\u0027d heard enough to know that he was familiar with the ways of the aristocracy. He had to know what would be expected of him.\u003c/p\u003e\n\u003cp\u003eHe cupped her face in his hands and stared at her with a tenderness that took her breath away. \"As God is my witness,\" he whispered, turning her around so he could do up her buttons, \"this is the most difficult thing I have ever done in my life.\"\u003c/p\u003e\n\u003cp\u003eSomehow she found the strength to smile. Or at the very least, to not cry.\u003c/p\u003e\n\u003cp\u003eLater that night Grace was in the rose salon, hunting down writing paper for the dowager, who had decided - on the spur of the moment, apparently - that she must send a letter to her sister, the grand duchess of that small European country whose name Grace could never pronounce (or, indeed, remember).\u003c/p\u003e\n\u003cp\u003eThis was a lengthier process than it seemed, as the dowager liked to compose her correspondence aloud (with Grace as audience), debating - at painful length - each turn of phrase. Grace then had to concentrate on memorizing the dowager\u0027s words, as she would then be required (not by the dowager; rather, by a general duty to humanity) to recopy the dowager\u0027s missive, translating her unintelligible scrawl into something a bit more neat and tidy.\u003c/p\u003e\n\u003cp\u003eThe dowager did not acknowledge that she did this; in fact, the one time Grace offered, she flew into such a huff that Grace had never again whispered a word of it. But considering that her sister\u0027s next letter opened with gushes of praise on the dowager\u0027s new penmanship, Grace could not imagine that she was completely unaware.\u003c/p\u003e\n\u003cp\u003eAh, well. It was one of those things they did not discuss.\u003c/p\u003e\n\u003cp\u003eGrace did not mind the task this evening. Sometimes it gave her a headache; she did try to do her recopying when the sun was still high and she could enjoy the advantages of natural light. But it was an endeavor that required all of her concentration, and she rather thought that it was exactly what she needed right now. Something to take her mind off...well, everything.\u003c/p\u003e\n\u003cp\u003eMr. Audley.\u003c/p\u003e\n\u003cp\u003eThomas. And how awful she felt.\u003c/p\u003e\n\u003cp\u003eMr. Audley.\u003c/p\u003e\n\u003cp\u003eThat painting of that woman.\u003c/p\u003e\n\u003cp\u003eMr. Audley.\u003c/p\u003e\n\u003cp\u003eJack.\u003c/p\u003e\n\u003cp\u003eGrace let out a short, loud sigh. For heaven\u0027s sake, who was she trying to fool? She knew exactly what she was trying so hard not to think about.\u003c/p\u003e\n\u003cp\u003eHerself.\u003c/p\u003e\n\u003cp\u003eShe sighed. Maybe she ought to take herself off to the land of the unpronounceable name. She wondered if they spoke English there. She wondered if the Grand Duchess Margareta (nee Margaret, and called, she was pertly told by the dowager, Maggs) could possibly be as ill-tempered as her sister.\u003c/p\u003e\n\u003cp\u003eIt did seem unlikely.\u003c/p\u003e\n\u003cp\u003eAlthough as a member of the royal family, Maggs presumably had the authority to order someone\u0027s head lopped off. The dowager had said they were a bit feudal over there.\u003c/p\u003e\n\u003cp\u003eGrace touched her head, decided she liked it where it was, and with renewed determination pulled open the top drawer to the escritoire, using perhaps a bit more force than necessary. She winced at the screech of wood against wood, then frowned; this really wasn\u0027t such a well-made piece of furniture. Rather out of place at Belgrave, she had to say.\u003c/p\u003e\n\u003cp\u003eNothing in the top drawer. Just a quill that looked as if it hadn\u0027t seen use since the last King George ruled the land.\u003c/p\u003e\n\u003cp\u003eShe moved to the second, reaching to the back in case anything was hiding in the shadows, and then she heard something.\u003c/p\u003e\n\u003cp\u003eSomeone.\u003c/p\u003e\n\u003cp\u003eIt was Thomas. He was standing in the doorway, looking rather peaked, and even in the dim light she could see that his eyes were bloodshot.\u003c/p\u003e\n\u003cp\u003eShe gulped down a wave of guilt. He was a good man. She hated that she was falling in love with his rival. No, that was not it. She hated that Mr. Audley was his rival. No, not that. She hated the whole bloody situation. Every last speck of it.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" he said. Nothing else, just her name.\u003c/p\u003e\n\u003cp\u003eShe swallowed. It had been some time since they\u0027d conversed on friendly terms. Not that they had been un friendly, but truly, was there anything worse than oh-so-careful civility?\u003c/p\u003e\n\u003cp\u003e\"Thomas,\" she said, \"I did not realize you were still awake.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not so late,\" he said with a shrug.\u003c/p\u003e\n\u003cp\u003e\"No, I suppose not.\" She glanced up at the clock. \"The dowager is abed but not yet asleep.\"\u003c/p\u003e\n\u003cp\u003e\"Your work is never done, is it?\" he asked, entering the room.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said, wanting to sigh. Then, refusing to feel sorry for herself, she explained, \"I ran out of writing paper upstairs.\"\u003c/p\u003e\n\u003cp\u003e\"For correspondence?\"\u003c/p\u003e\n\u003cp\u003e\"Your grandmother\u0027s,\" she affirmed. \"I have no one with whom to correspond.\" Dear heavens, could that be true? It had never even occurred to her before. Had she written a single letter in the years she\u0027d been here? \"I suppose once Elizabeth Willoughby marries and moves away...\" She paused, thinking how sad that was, that she needed her friend to leave so she might be able to write a letter. \"...I shall miss her.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said, looking somewhat distracted, not that she could blame him, given the current state of his affairs. \"You are good friends, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, reaching into the recesses of the third drawer. Success! \"Ah, here we are.\" She pulled forth a small stack of paper, then realized that her triumph meant that she had to go tend to her duties. \"I must go write your grandmother\u0027s letters now.\"\u003c/p\u003e\n\u003cp\u003e\"She does not write them herself?\" he asked with surprise.\u003c/p\u003e\n\u003cp\u003eGrace almost chuckled at that. \"She thinks she does. But the truth is, her penmanship is dreadful. No one could possibly make out what she intends to say. Even I have difficulty with it. I end up improvising at least half in the copying.\"\u003c/p\u003e\n\u003cp\u003eShe looked down at the pages in her hands, shaking them down against the top of the desk first one way and then on the side, to make an even stack. When she looked back up, Thomas was standing a bit closer, looking rather serious.\u003c/p\u003e\n\u003cp\u003e\"I must apologize, Grace,\" he said, walking toward her.\u003c/p\u003e\n\u003cp\u003eOh, she didn\u0027t want this. She didn\u0027t want an apology, not when she herself held so much guilt in her heart. \"For this afternoon?\" she asked, her voice perhaps a little too light. \"No, please, don\u0027t be silly. It\u0027s a terrible situation, and no one could fault you for - \"\u003c/p\u003e\n\u003cp\u003e\"For many things,\" he cut in.\u003c/p\u003e\n\u003cp\u003eHe was looking at her very strangely, and Grace wondered if he\u0027d been drinking. He\u0027d been doing a lot of that lately. She had told herself that she mustn\u0027t scold him; truly, it was a wonder he was behaving as well as he was, under the circumstances.\u003c/p\u003e\n\u003cp\u003e\"Please,\" she said, hoping to put an end to the discussion. \"I cannot think of anything for which you need to make amends, but I assure you, if there were, I would accept your apology, with all graciousness.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" he said. And then, seemingly out of nowhere: \"We depart for Liverpool in two days.\"\u003c/p\u003e\n\u003cp\u003eGrace nodded. She knew this already. And surely he should have known that she was aware of the plans.\u003c/p\u003e\n\u003cp\u003e\"I imagine you have much to do before we leave,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Almost nothing,\" he said, but there was something awful in his voice, almost as if he were daring her to ask his meaning. And there had to be a meaning, because Thomas always had much to do, whether he had a planned departure or not.\u003c/p\u003e\n\u003cp\u003e\"Oh. That must be a pleasant change,\" she said, because she could not simply ignore his statement.\u003c/p\u003e\n\u003cp\u003eHe leaned forward slightly, and Grace smelled spirits on his breath. Oh, Thomas. She ached for him, for what he must be feeling. And she wanted to tell him: I don\u0027t want it, either. I want you to be the duke and Jack to be plain Mr. Audley, and I want all of this just to be over.\u003c/p\u003e\n\u003cp\u003eEven if the truth turned out to be not what she prayed for, she wanted to know.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t say this aloud. Not to Thomas. Already he was looking at her in that piercing way of his, as if he knew all her secrets - that she was falling in love with his rival, that she had already kissed him - several times - and she had wanted so much more.\u003c/p\u003e\n\u003cp\u003eShe would have done more, if Jack had not stopped her.\u003c/p\u003e\n\u003cp\u003e\"I am practicing, you see,\" Thomas said.\u003c/p\u003e\n\u003cp\u003e\"Practicing?\"\u003c/p\u003e\n\u003cp\u003e\"To be a gentleman of leisure. Perhaps I should emulate your Mr. Audley.\"\u003c/p\u003e\n\u003cp\u003e\"He is not my Mr. Audley,\" she immediately replied, even though she knew he had only said as much to provoke her.\u003c/p\u003e\n\u003cp\u003e\"He shall not worry,\" Thomas continued, as if she\u0027d not spoken. \"I have left all of the affairs in perfect order. Every contract has been reviewed and every last number in every last column has been tallied. If he runs the estate into the ground, it shall be on his own head.\"\u003c/p\u003e\n\u003cp\u003e\"Thomas, stop,\" she said, because she could not bear it. For either of them. \"Don\u0027t talk this way. We don\u0027t know that he is the duke.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t we?\" His lip curled as he looked down at her. \"Come now, Grace, we both know what we will find in Ireland.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t,\" she insisted, and her voice sounded hollow. She felt hollow, as if she had to hold herself perfectly still just to keep from cracking.\u003c/p\u003e\n\u003cp\u003eHe stared at her. For far longer than was comfortable. And then: \"Do you love him?\"\u003c/p\u003e\n\u003cp\u003eGrace felt the blood drain from her face.\u003c/p\u003e\n\u003cp\u003e\"Do you love him?\" he repeated, stridently this time. \"Audley.\"\u003c/p\u003e\n\u003cp\u003e\"I know who you\u0027re talking about,\" she said before she could think the better of it.\u003c/p\u003e\n\u003cp\u003e\"I imagine you do.\"\u003c/p\u003e\n\u003cp\u003eShe stood still, forcing herself to unclench her fists. She\u0027d probably ruined the writing paper; she\u0027d heard it crumple in her hand. He\u0027d gone from apologetic to hateful in the space of a second, and she knew he was hurting inside, but so was she, damn it.\u003c/p\u003e\n\u003cp\u003e\"How long have you been here?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe drew back, her head turning slightly to the side. He was looking at her so strangely. \"At Belgrave?\"\u003c/p\u003e\n\u003cp\u003eshe said hesitantly. \"Five years.\"\u003c/p\u003e\n\u003cp\u003e\"And in all that time I haven\u0027t...\" He shook his head. \"I wonder why.\"\u003c/p\u003e\n\u003cp\u003eWithout even thinking, she tried to step back, but the desk blocked her way. What was wrong with him?\u003c/p\u003e\n\u003cp\u003e\"Thomas,\" she said, wary now, \"what are you talking about?\"\u003c/p\u003e\n\u003cp\u003eHe seemed to find that funny. \"Damned if I know.\"\u003c/p\u003e\n\u003cp\u003eAnd then, while she was trying to think of a suitable reply, he let out a bitter laugh and said, \"What\u0027s to become of us, Grace? We\u0027re doomed, you know. Both of us.\"\u003c/p\u003e\n\u003cp\u003eShe knew it was true, but it was terrible to hear it confirmed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you\u0027re talking about,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Oh, come now, Grace, you\u0027re far too intelligent for that.\"\u003c/p\u003e\n\u003cp\u003e\"I should go.\"\u003c/p\u003e\n\u003cp\u003eBut he was blocking her way.\u003c/p\u003e\n\u003cp\u003e\"Thomas, I - \"\u003c/p\u003e\n\u003cp\u003eAnd then - dear heavens - he was kissing her. His mouth was on hers, and her stomach flipped in horror, not because his kiss was repulsive, because it wasn\u0027t. It was the shock of it. Five years she\u0027d been here, and he\u0027d never even hinted at -\u003c/p\u003e\n\u003cp\u003e\"Stop!\" She wrenched herself away. \"Why are you doing this?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" he said with a helpless shrug. \"I\u0027m here, you\u0027re here...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m leaving.\" But one of his hands was still on her arm. She needed him to release her. She could have pulled away; he was not holding her tightly. But she needed it to be his decision.\u003c/p\u003e\n\u003cp\u003eHe needed it to be his decision.\u003c/p\u003e\n\u003cp\u003e\"Ah, Grace,\" he said, looking almost defeated. \"I am not Wyndham any longer. We both know it.\" He paused, shrugged, held out his hand in surrender.\u003c/p\u003e\n\u003cp\u003e\"Thomas?\" she whispered.\u003c/p\u003e\n\u003cp\u003eAnd then he said, \"Why don\u0027t you marry me when this is all over?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Something akin to horror washed over her. \"Oh, Thomas, you\u0027re mad.\" But she knew what he really meant. A duke could not marry Grace Eversleigh. But if he wasn\u0027t...If he was just plain Mr.\u003c/p\u003e\n\u003cp\u003eCavendish...Why not?\u003c/p\u003e\n\u003cp\u003eAcid rose in her throat. He didn\u0027t mean to insult. She didn\u0027t even feel insulted. She knew the world she inhabited. She knew the rules, and she knew her place.\u003c/p\u003e\n\u003cp\u003eJack could never be hers. Not if he was the duke.\u003c/p\u003e\n\u003cp\u003e\"What do you say, Gracie?\" Thomas touched her chin, tipped her face up to look at him.\u003c/p\u003e\n\u003cp\u003eAnd she thought -\u0026nbsp; maybe.\u003c/p\u003e\n\u003cp\u003eWould it be so very bad? She could not stay at Belgrave, that was for certain. And maybe she would learn to love him. She already did, really, as a friend.\u003c/p\u003e\n\u003cp\u003eHe leaned down to kiss her again, and this time she let him, praying that her heart would pound and her pulse would race and that spot between her legs...Oh, please let it feel as it did when Jack touched her.\u003c/p\u003e\n\u003cp\u003eBut there was nothing. Just a rather warm sense of friendship. Which she supposed wasn\u0027t the worst thing in the world.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" she whispered, turning her face to the side. She wanted to cry.\u003c/p\u003e\n\u003cp\u003eAnd then she did cry, because Thomas rested his chin on her head, comforting her like a brother.\u003c/p\u003e\n\u003cp\u003eHer heart twisted, and she heard him whisper, \"I know.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-lost-duke-of-wyndham-two-dukes-of-wyndham-1/page-15.html","bookId":2642,"creation":"Oct 5, 2019 10:25:45 PM","modification":"Oct 5, 2019 10:25:45 PM"}
