{"id":103336,"no":19,"title":"Page 19","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe drive to Butlersbridge was everything Jack remembered. The trees, the birds, the precise shade of green as the wind ruffled the grass...These were the sights and sounds of his childhood. Nothing had changed. It ought to have been comforting.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eWhen he opened his eyes that morning, Grace had already slipped from the bed and made her way back to her own room. He was disappointed, of course; he\u0027d been awakened by his own love and desire for her, and wanted nothing more than to gather her back into his arms.\u003c/p\u003e\n\u003cp\u003eBut he had understood. Life was not as free for a woman as for a man, even a woman of independent means. Grace had her reputation to consider. Thomas and Amelia would never say a word against her, but Jack did not know Lord Crowland well enough to guess what he might do if Grace were caught in his bed. And as for the dowager...\u003c/p\u003e\n\u003cp\u003eWell, it went without saying that she\u0027d happily destroy Grace now, if given the chance.\u003c/p\u003e\n\u003cp\u003eThe traveling party - minus the dowager, to everyone\u0027s relief - met up in the inn\u0027s dining room for breakfast. Jack knew he\u0027d been unable to keep his heart from his eyes when he saw Grace enter the room.\u003c/p\u003e\n\u003cp\u003eWould it always be this way, he wondered. Would he see her and feel this indescribable, overwhelming rush of feeling?\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t even desire. It was far more than that.\u003c/p\u003e\n\u003cp\u003eIt was love.\u003c/p\u003e\n\u003cp\u003eLove. With a capital L and swirly script and hearts and flowers and whatever else the angels - and yes, all those annoying little cupids - wished to use for embellishment.\u003c/p\u003e\n\u003cp\u003eLove. It could be nothing else. He saw Grace and he felt joy. Not just his joy, but everyone\u0027s. The stranger seated behind him. The acquaintance across the room. He saw it all. He felt it all.\u003c/p\u003e\n\u003cp\u003eIt was amazing. Humbling. Grace looked at him, and he was a better man.\u003c/p\u003e\n\u003cp\u003eAnd she thought he would allow anyone to keep them apart.\u003c/p\u003e\n\u003cp\u003eIt would not happen. He would not let it happen.\u003c/p\u003e\n\u003cp\u003eThroughout breakfast she did not precisely avoid him - there were far too many shared glances and secret smiles for that. But she had been careful not to seek him out, and indeed, he\u0027d not had an opportunity to speak with her even once. He probably wouldn\u0027t have been able to do so even if Grace was not so inclined to be circumspect; Amelia slipped her hand in Grace\u0027s right after breakfast and did not let go.\u003c/p\u003e\n\u003cp\u003eSafety in numbers, Jack decided. The two ladies were stuck in the coach all day with the dowager. He would have been blindly reaching for a hand if forced to endure the same.\u003c/p\u003e\n\u003cp\u003eThe three gentlemen rode on horseback, taking advantage of the fine weather. Lord Crowland decided to take a seat in the carriage after their first stop to water the horses, but thirty minutes later he was staggering back out, declaring the ride far less exhausting than the dowager.\u003c/p\u003e\n\u003cp\u003e\"You would abandon your daughter to the dowager\u0027s venom?\" Jack asked mildly.\u003c/p\u003e\n\u003cp\u003eCrowland did not even try to make excuses. \"I did not say I was proud of myself.\"\u003c/p\u003e\n\u003cp\u003e\"The Outer Hebrides,\" Thomas said, trotting by. \"I\u0027m telling you, Audley, it\u0027s the key to your happiness.\u003c/p\u003e\n\u003cp\u003eThe Outer Hebrides.\"\u003c/p\u003e\n\u003cp\u003e\"The Outer Hebrides?\" Crowland echoed, looking from man to man for explanation.\u003c/p\u003e\n\u003cp\u003e\"Almost as far as the Orkneys,\" Thomas said cheerfully. \"And much more fun to say.\"\u003c/p\u003e\n\u003cp\u003e\"Have you holdings there?\" Crowland asked.\u003c/p\u003e\n\u003cp\u003e\"Not yet,\" Thomas replied. He looked over at Jack. \"Perhaps you can restore a nunnery. Something with insurmountable walls.\"\u003c/p\u003e\n\u003cp\u003eJack found himself enjoying the mental picture. \"How have you lived with her for so long?\" he asked.\u003c/p\u003e\n\u003cp\u003eThomas shook his head. \"I have no idea.\"\u003c/p\u003e\n\u003cp\u003eThey were talking as if it were already decided, Jack realized. They were talking as if he had already been named the duke. And Thomas did not seem to mind. If anything, he appeared to be looking forward to his imminent dispossession.\u003c/p\u003e\n\u003cp\u003eJack looked back at the carriage. Grace had insisted that she could not marry him if he was the duke. And yet, he could not imagine doing it without her. He was unprepared for the duties that came with the title.\u003c/p\u003e\n\u003cp\u003eAstoundingly so. But she knew what to do, didn\u0027t she? She\u0027d lived at Belgrave for five years. She had to know how the place was run. She knew the name of every last servant, and as far as he could tell, their birthdays, too.\u003c/p\u003e\n\u003cp\u003eShe was kind. She was gracious. She was innately fair, of impeccable judgment, and far more intelligent than he.\u003c/p\u003e\n\u003cp\u003eHe could not imagine a more perfect duchess.\u003c/p\u003e\n\u003cp\u003eBut he did not want to be the duke.\u003c/p\u003e\n\u003cp\u003eHe truly didn\u0027t.\u003c/p\u003e\n\u003cp\u003eHe\u0027d gone over it in his mind countless times, reminding himself of all of the reasons why he\u0027d make a very bad Duke of Wyndham, but had he ever actually come out and said it plainly?\u003c/p\u003e\n\u003cp\u003eHe did not want to be the duke.\u003c/p\u003e\n\u003cp\u003eHe looked over at Thomas, who was looking up at the sun, shading his eyes with his hand.\u003c/p\u003e\n\u003cp\u003e\"It must be past noon,\" Lord Crowland said. \"Shall we stop for lunch?\"\u003c/p\u003e\n\u003cp\u003eJack shrugged. It did not matter to him.\u003c/p\u003e\n\u003cp\u003e\"For the sake of the ladies,\" Crowland said.\u003c/p\u003e\n\u003cp\u003eAs one, they turned and looked over their shoulders toward the carriage.\u003c/p\u003e\n\u003cp\u003eJack thought he saw Crowland cringe. \"It\u0027s not pretty in there,\" he said in a low voice.\u003c/p\u003e\n\u003cp\u003eJack quirked a brow.\u003c/p\u003e\n\u003cp\u003e\"The dowager,\" Crowland said, shuddering. \"Amelia begged me to let her ride after we watered the horses.\"\u003c/p\u003e\n\u003cp\u003e\"That would be too cruel to Grace,\" Jack said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I told Amelia.\"\u003c/p\u003e\n\u003cp\u003e\"As you were fleeing the carriage,\" Thomas murmured, smiling just a little.\u003c/p\u003e\n\u003cp\u003eCrowland cocked his head. \"I would never claim otherwise.\"\u003c/p\u003e\n\u003cp\u003e\"And I would never chastise you for it.\"\u003c/p\u003e\n\u003cp\u003eJack listened to the exchange with little interest. By his estimation, they were about halfway to Butlersbridge, and it was growing increasingly difficult to find humor in the inane. \"There is a clearing a mile or so ahead,\" he said. \"I\u0027ve stopped there before. It\u0027s suitable for a picnic.\"\u003c/p\u003e\n\u003cp\u003eThe two other men nodded their agreement, and about five minutes later they\u0027d found the spot. Jack dismounted and went immediately to the carriage. A groom was helping the ladies down, but as Grace would be the last to alight, it was easy enough for him to position himself so he might take her hand when she emerged.\u003c/p\u003e\n\u003cp\u003e\"Mr. Audley,\" Grace said. She was nothing but polite, but her eyes shone with a secret warmth.\u003c/p\u003e\n\u003cp\u003e\"Miss Eversleigh.\" He looked down at her mouth. The corners were moving slightly...very slightly. She wanted to smile. He could see it.\u003c/p\u003e\n\u003cp\u003eHe could feel it.\u003c/p\u003e\n\u003cp\u003e\"I will eat in the carriage,\" the dowager announced sharply. \"Only heathens eat on the ground.\"\u003c/p\u003e\n\u003cp\u003eJack tapped his chest and grinned. \"Proud to be a heathen.\" He quirked his head toward Grace. \"And you?\"\u003c/p\u003e\n\u003cp\u003e\"Very proud.\"\u003c/p\u003e\n\u003cp\u003eThe dowager marched once around the perimeter of the field - to stretch her legs, she said - and then disappeared back inside the carriage.\u003c/p\u003e\n\u003cp\u003e\"That must have been very difficult for her,\" Jack commented, watching her go.\u003c/p\u003e\n\u003cp\u003eGrace had been examining the contents of a picnic basket, but at that she looked up. \"Difficult?\"\u003c/p\u003e\n\u003cp\u003e\"There is no one to harass in the carriage,\" he explained.\u003c/p\u003e\n\u003cp\u003e\"I think she feels that we have all ganged up upon her.\"\u003c/p\u003e\n\u003cp\u003e\"We have.\"\u003c/p\u003e\n\u003cp\u003eGrace looked conflicted. \"Yes, but - \"\u003c/p\u003e\n\u003cp\u003eOh... no. He was not going to listen to her make excuses for the dowager. \"Don\u0027t tell me that you harbor any sympathy toward her.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Grace shook her head. \"I wouldn\u0027t say that, but - \"\u003c/p\u003e\n\u003cp\u003e\"You are far too softhearted.\"\u003c/p\u003e\n\u003cp\u003eAt that she smiled. Sheepishly. \"Perhaps.\"\u003c/p\u003e\n\u003cp\u003eOnce the blankets were laid out, Jack maneuvered them so they were seated a bit apart from the others. It was not very difficult - or very obvious - to do so; Amelia had sat down next to her father, who appeared to be delivering some sort of lecture, and Thomas had wandered off, probably in search of a tree that needed watering.\u003c/p\u003e\n\u003cp\u003e\"Is this the road you traveled when you went to school in Dublin?\" Grace asked, reaching for a slice of bread and cheese.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d tried to keep the tightness out of his voice, but he must not have succeeded, because when he looked at her, she was regarding him in that unsettling way of hers. \"Why don\u0027t you want to go home?\"\u003c/p\u003e\n\u003cp\u003eshe asked.\u003c/p\u003e\n\u003cp\u003eIt was on the tip of his tongue to say that her imagination was too active, or, since he really ought to be reverting to form, something clever and grandiose, involving sunshine, twittering birds, and milk of human kindness.\u003c/p\u003e\n\u003cp\u003eStatements like that had got him out of far more delicate situations than this.\u003c/p\u003e\n\u003cp\u003eBut he hadn\u0027t the energy just now, nor the will.\u003c/p\u003e\n\u003cp\u003eAnd, anyway, Grace knew better. She knew him better. He could be his usual flip and funny self, and most of the time - he hoped - she would love him for it. But not when he was trying to hide the truth.\u003c/p\u003e\n\u003cp\u003eOr hide from the truth.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s complicated,\" he said, because at least that wasn\u0027t a lie.\u003c/p\u003e\n\u003cp\u003eShe nodded and turned to her lunch. He waited for another question, but none were forthcoming. So he picked up an apple.\u003c/p\u003e\n\u003cp\u003eHe looked over. She was cutting into a slice of roast chicken, her eyes on her utensils. He opened his mouth to speak, then decided not to, then brought the apple to his mouth.\u003c/p\u003e\n\u003cp\u003eThen didn\u0027t bite into it.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been over five years,\" he blurted out.\u003c/p\u003e\n\u003cp\u003eShe looked up. \"Since you\u0027ve been home?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a long time.\"\u003c/p\u003e\n\u003cp\u003e\"Very long.\"\u003c/p\u003e\n\u003cp\u003e\"Too long?\"\u003c/p\u003e\n\u003cp\u003eHis fingers tightened around the apple. \"No.\"\u003c/p\u003e\n\u003cp\u003eShe took a few bites of her meal, then looked up. \"Would you like me to slice that apple for you?\"\u003c/p\u003e\n\u003cp\u003eHe handed it over, mostly because he\u0027d forgotten he was holding it. \"I had a cousin, you know.\" Bloody hell, where had that come from? He hadn\u0027t meant to say anything about Arthur. He\u0027d spent the last five years trying not to think about him, trying to make sure that Arthur\u0027s was not the last face he saw before he fell asleep at night.\u003c/p\u003e\n\u003cp\u003e\"I thought you\u0027d said you had three cousins,\" Grace said. She wasn\u0027t looking at him; she gave every sign of giving her complete focus to the apple and knife in her hands.\u003c/p\u003e\n\u003cp\u003e\"Only two now.\"\u003c/p\u003e\n\u003cp\u003eShe looked up, her eyes large with sympathy. \"I am sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Arthur died in France.\" The words sounded rusty. He realized it had been a long time since he\u0027d said Arthur\u0027s name aloud. Five years, probably.\u003c/p\u003e\n\u003cp\u003e\"With you?\" Grace asked softly.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eShe looked down at the apple slices, now neatly arranged on a plate. She didn\u0027t seem to know what to do with them.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to say that it wasn\u0027t my fault?\" he said, and he hated the sound of his voice. It was hollow, and pained, and sarcastic, and desperate, and he couldn\u0027t believe what he\u0027d just said.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t there,\" she said.\u003c/p\u003e\n\u003cp\u003eHis eyes flew to her face.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine how it would have been your fault, but I wasn\u0027t there.\" She reached across the food and laid her hand briefly atop his. \"I\u0027m sorry. Were you close?\"\u003c/p\u003e\n\u003cp\u003eHe nodded, turning away and pretending to look at the trees. \"Not so much when we were young. But after we left for school...\" He pinched the bridge of his nose, wondering how to explain just what Arthur had done for him. \"...we found much more in common.\"\u003c/p\u003e\n\u003cp\u003eHer fingers tightened around his, and then she let go. \"It is difficult to lose someone you love.\"\u003c/p\u003e\n\u003cp\u003eHe looked back at her once he was satisfied that his eyes would remain dry. \"When you lost your parents...\"\u003c/p\u003e\n\u003cp\u003e\"It was horrible,\" she answered. Her lips moved at the corners, but not into a smile. It was one of those flashes of movement - a tiny, little rush of emotion, escaping almost without notice. \"I didn\u0027t think I should die,\" Grace said softly, \"but I did not know how I would live.\"\u003c/p\u003e\n\u003cp\u003e\"I wish...\" But he didn\u0027t know what he wished. That he could have been there for her? What good would he have been? Five years ago he\u0027d been broken, too.\u003c/p\u003e\n\u003cp\u003e\"The dowager saved me,\" she said. She smiled wryly. \"Isn\u0027t that funny?\"\u003c/p\u003e\n\u003cp\u003eHis brows rose. \"Oh, come now. The dowager does nothing out of the goodness of her heart.\"\u003c/p\u003e\n\u003cp\u003e\"I did not say why she did it, just that she did. I should have been forced to marry my cousin if she had not taken me in.\"\u003c/p\u003e\n\u003cp\u003eHe took her hand and brought it to his lips. \"I am glad you did not.\"\u003c/p\u003e\n\u003cp\u003e\"So am I,\" she said, without any trace of tenderness. \"He is awful.\"\u003c/p\u003e\n\u003cp\u003eJack chuckled. \"And here I\u0027d hoped you were relieved to have waited for me.\"\u003c/p\u003e\n\u003cp\u003eShe gave him an arch look and withdrew her hand. \"You have not met my cousin.\"\u003c/p\u003e\n\u003cp\u003eHe finally took one of the apple pieces and bit into it. \"We have an overabundance of odious relations, you and I.\"\u003c/p\u003e\n\u003cp\u003eHer lips twisted in thought, and then her body twisted so that she could look back toward the carriage. \"I should go to her,\" she said.\u003c/p\u003e\n\u003cp\u003e\"No, you shouldn\u0027t,\" Jack said firmly.\u003c/p\u003e\n\u003cp\u003eGrace sighed. She did not want to feel sorry for the dowager, not after what the dowager had said to her the night before. But her conversation with Jack had brought back memories...and reminded her just how very much she was indebted to her.\u003c/p\u003e\n\u003cp\u003eShe turned back to Jack. \"She is all alone.\"\u003c/p\u003e\n\u003cp\u003e\"She deserves to be alone.\" He said this with great conviction, and more than a touch of surprise, as if he could not believe the matter might be under discussion.\u003c/p\u003e\n\u003cp\u003e\"No one deserves to be alone.\"\u003c/p\u003e\n\u003cp\u003e\"Do you really believe that?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t, but...\"I want to believe it.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her dubiously.\u003c/p\u003e\n\u003cp\u003eGrace started to rise. She looked this way and that, making sure no one could hear, and said, \"You should not have been kissing my hand where people can see, anyway.\"\u003c/p\u003e\n\u003cp\u003eShe stood then, stepping quickly away, before he had a chance to make a reply.\u003c/p\u003e\n\u003cp\u003e\"Have you finished your lunch?\" Amelia called out as she passed.\u003c/p\u003e\n\u003cp\u003eGrace nodded. \"Yes. I am going to the carriage to see if the dowager needs anything.\"\u003c/p\u003e\n\u003cp\u003eAmelia looked at her as if she\u0027d gone mad.\u003c/p\u003e\n\u003cp\u003eGrace gave a little shrug. \"Everybody deserves a second chance.\" She thought about that, then added, mostly to herself, \"That, I really do believe.\" She marched over to the carriage. It was too high for her to climb up herself, and the grooms were nowhere in sight, so she called out, \"Your grace! Your grace!\"\u003c/p\u003e\n\u003cp\u003eThere was no reply, so she said, a little louder, \"Ma\u0027am!\"\u003c/p\u003e\n\u003cp\u003eThe dowager\u0027s irate visage appeared in the open doorway. \"What do you want?\"\u003c/p\u003e\n\u003cp\u003eGrace reminded herself that she had not spent a lifetime of Sunday mornings in church for nothing. \"I wished to inquire if you needed anything, your grace.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eGood heavens, she was suspicious. \"Because I am a nice person,\" Grace said, somewhat impatiently.\u003c/p\u003e\n\u003cp\u003eAnd then she crossed her arms, waiting to see what the dowager said to that.\u003c/p\u003e\n\u003cp\u003eThe dowager stared down at her for several moments, then said, \"It is my experience that nice people don\u0027t need to advertise themselves as such.\"\u003c/p\u003e\n\u003cp\u003eGrace wanted to inquire what sort of experience the dowager had with nice people, since it was her own experience that most nice people fled the dowager\u0027s presence.\u003c/p\u003e\n\u003cp\u003eBut that seemed catty.\u003c/p\u003e\n\u003cp\u003eShe took a breath. She did not have to do this. She did not have to help the dowager in any way. She was her own woman now, and she did not need to worry over her security.\u003c/p\u003e\n\u003cp\u003eBut she was, as she had noted, a nice person. And she was determined to remain a nice person, regardless of her improved circumstances. She had waited upon the dowager for the last five years because she\u0027d had to, not because she wanted to. And now...\u003c/p\u003e\n\u003cp\u003eWell, she still didn\u0027t want to. But she\u0027d do it. Whatever the dowager\u0027s motives five years ago, she had saved Grace from a lifetime of unhappiness. And for that, she could spend an hour attending to the dowager. But more than that, she could choose to spend an hour attending to her.\u003c/p\u003e\n\u003cp\u003eIt was amazing what a difference that made.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am?\" Grace said. That was all. Just ma\u0027am. She\u0027d said enough. It was up to the dowager now.\u003c/p\u003e\n\u003cp\u003e\"Oh, very well,\" she said irritably. \"If you feel you must.\"\u003c/p\u003e\n\u003cp\u003eGrace kept her face utterly serene as she allowed Lord Crowland (who had caught the latter half of the conversation and told Grace she was mad) to help her up. She took her prescribed seat - facing backward, as far from the dowager as possible - and folded her hands neatly in her lap. She did not know how long they would be sitting here; the others had not seemed quite ready to quit their lunch.\u003c/p\u003e\n\u003cp\u003eThe dowager was looking out the window; Grace kept her eyes on her hands. Every now and then she\u0027d steal a glance up, and every time, the dowager was still turned away, her posture hard and stiff, her lips pinched tight.\u003c/p\u003e\n\u003cp\u003eAnd then - perhaps the fifth time Grace looked up - the dowager was staring straight at her.\u003c/p\u003e\n\u003cp\u003e\"You disappoint me,\" she said, her voice low - not quite hiss, but something close to it.\u003c/p\u003e\n\u003cp\u003eGrace held her silence. She held everything, it seemed - her posture, her breath. She did not know what to say, except that she would not apologize. Not for having the audacity to reach out for happiness.\u003c/p\u003e\n\u003cp\u003e\"You were not supposed to leave.\"\u003c/p\u003e\n\u003cp\u003e\"I was but a servant, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"You were not supposed to leave,\" the dowager said again, but this time something within her seemed to shake. Not quite her body, and not quite her voice.\u003c/p\u003e\n\u003cp\u003eHer heart, Grace realized with a shock. Her heart was shaking.\u003c/p\u003e\n\u003cp\u003e\"He is not what I expected,\" the dowager said.\u003c/p\u003e\n\u003cp\u003eGrace blinked, trying to follow. \"Mr. Audley?\"\u003c/p\u003e\n\u003cp\u003e\"Cavendish,\" the dowager said sharply.\u003c/p\u003e\n\u003cp\u003e\"You did not know that he existed,\" Grace said, as gently as she was able. \"How could you have expected anything?\"\u003c/p\u003e\n\u003cp\u003eThe dowager did not answer. Not that question, anyway. \"Do you know why I took you into my home?\"\u003c/p\u003e\n\u003cp\u003eshe asked instead.\u003c/p\u003e\n\u003cp\u003e\"No,\" Grace said softly.\u003c/p\u003e\n\u003cp\u003eThe dowager\u0027s lips pressed together for a moment before she said, \"It was not right. A person should not be alone in this world.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Grace said again. And she believed it, with her whole heart.\u003c/p\u003e\n\u003cp\u003e\"It was for the both of us. I took a terrible thing and turned it into good. For both of us.\" Her eyes narrowed, boring into Grace\u0027s. \"You were not supposed to leave.\"\u003c/p\u003e\n\u003cp\u003eAnd then - good heavens, Grace could not believe she was saying it, but: \"I will come visit you, should you wish.\"\u003c/p\u003e\n\u003cp\u003eThe dowager swallowed, and she looked straight ahead when she said, \"That would be acceptable.\"\u003c/p\u003e\n\u003cp\u003eGrace was saved from further reply by the arrival of Amelia, who informed them that they would depart momentarily. And indeed, she\u0027d had barely enough time to settle into her seat when the carriage wheels creaked into motion, and they began to roll forward.\u003c/p\u003e\n\u003cp\u003eNo one spoke.\u003c/p\u003e\n\u003cp\u003eIt was better that way.\u003c/p\u003e\n\u003cp\u003eSeveral hours later, Grace opened her eyes.\u003c/p\u003e\n\u003cp\u003eAmelia was staring at her. \"You fell asleep,\" she said quietly, then put her finger to her lips as she motioned to the dowager, who had also dozed off.\u003c/p\u003e\n\u003cp\u003eGrace covered a yawn, then asked, \"How much longer do you think we have until we get there?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" Amelia gave a little shrug. \"Perhaps an hour? Two?\" She sighed then, and leaned back.\u003c/p\u003e\n\u003cp\u003eShe looked tired, Grace thought. They were all tired.\u003c/p\u003e\n\u003cp\u003eAnd scared.\u003c/p\u003e\n\u003cp\u003e\"What will you do?\" Grace asked, before she had the chance to think better of it.\u003c/p\u003e\n\u003cp\u003eAmelia did not open her eyes. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eIt was not much of an answer, but then again, it hadn\u0027t been a fair question.\u003c/p\u003e\n\u003cp\u003e\"Do you know what the funniest part of it is?\" Amelia asked quite suddenly.\u003c/p\u003e\n\u003cp\u003eGrace shook her head, then remembered that Amelia\u0027s eyes were still closed and said, \"No.\"\u003c/p\u003e\n\u003cp\u003e\"I keep thinking to myself, \u0027This isn\u0027t fair. I should have a choice. I should not have to be traded and bartered like some sort of commodity.\u0027 But then I think, \u0027How is this any different? I was given to Wyndham years ago. I never made a complaint.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"You were just a baby,\" Grace said.\u003c/p\u003e\n\u003cp\u003eStill, Amelia did not open her eyes, and when she spoke, her voice was quiet and full of recrimination. \"I have had many years to lodge a complaint.\"\u003c/p\u003e\n\u003cp\u003e\"Amelia - \"\u003c/p\u003e\n\u003cp\u003e\"I have no one to blame but myself.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not true.\"\u003c/p\u003e\n\u003cp\u003eAmelia finally opened her eyes. One of them, at least. \"You\u0027re just saying that.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not. I would,\" Grace admitted, because it was true. \"But as it happens, I am telling the truth. It isn\u0027t your fault. It\u0027s not anyone\u0027s fault, really.\" She took a breath. Let it out. \"I wish it were. It would be so much easier that way.\"\u003c/p\u003e\n\u003cp\u003e\"To have someone to blame?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eAnd then Amelia whispered, \"I don\u0027t want to marry him.\"\u003c/p\u003e\n\u003cp\u003e\"Thomas?\" Grace asked. Amelia had spent so long as his fiancee, and they did not seem to have any great affection for one another.\u003c/p\u003e\n\u003cp\u003eAmelia looked at her curiously. \"No. Mr. Audley.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"You sound so shocked.\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not,\" Grace said hurriedly. What was she to say to Amelia - that she was so desperately in love with him herself that she could not imagine anyone not wanting him? \"It\u0027s just that he\u0027s so handsome,\" she improvised.\u003c/p\u003e\n\u003cp\u003eAmelia gave a little shrug. \"I suppose.\"\u003c/p\u003e\n\u003cp\u003eShe supposed? Hadn\u0027t she ever seen him smile?\u003c/p\u003e\n\u003cp\u003eBut then Amelia said, \"Don\u0027t you find him a little too charming?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Grace immediately looked down at her hands, because her no had come out in not at all the tone of voice she\u0027d intended. And indeed, Amelia must have heard it, too, because her next words were -\u003c/p\u003e\n\u003cp\u003e\"Grace Eversleigh, do you fancy Mr. Audley?\"\u003c/p\u003e\n\u003cp\u003eGrace stammered and stumbled, and managed a rather croaky, \"I - \" before Amelia cut in with -\u003c/p\u003e\n\u003cp\u003e\"You do.\"\u003c/p\u003e\n\u003cp\u003e\"It does not signify,\" Grace said, because what was she supposed to say? To Amelia, who might or might not be engaged to marry him.\u003c/p\u003e\n\u003cp\u003e\"Of course it signifies. Does he fancy you?\"\u003c/p\u003e\n\u003cp\u003eGrace wanted to melt into the seat.\u003c/p\u003e\n\u003cp\u003e\"No,\" Amelia said, sounding highly amused. \"Don\u0027t answer. I can see from your face that he does. Well.\u003c/p\u003e\n\u003cp\u003eI certainly shall not marry him now.\"\u003c/p\u003e\n\u003cp\u003eGrace swallowed. Her throat tasted bitter. \"You should not refuse him on my account.\"\u003c/p\u003e\n\u003cp\u003e\"What did you just say?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t marry him if he\u0027s the duke.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eGrace tried to smile, because really, it was sweet of Amelia to ignore the difference in their positions. But she could not quite manage it. \"If he is the duke, he will need to marry someone suitable. Of your rank.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, don\u0027t be silly,\" Amelia scoffed. \"It\u0027s not as if you grew up in an orphanage.\"\u003c/p\u003e\n\u003cp\u003e\"There will be scandal enough. He must not add to it with a sensational marriage.\"\u003c/p\u003e\n\u003cp\u003e\"An actress would be sensational. You will merely be a week\u0027s worth of gossip.\"\u003c/p\u003e\n\u003cp\u003eIt would be more than that, but Grace saw no point in arguing further. But then Amelia said -\u003c/p\u003e\n\u003cp\u003e\"I do not know Mr. Audley\u0027s mind, or his intentions, but if he is prepared to dare everything for love, then you should be, too.\"\u003c/p\u003e\n\u003cp\u003eGrace looked at her. How was it that Amelia suddenly looked so very wise? When had that happened?\u003c/p\u003e\n\u003cp\u003eWhen had she stopped being Elizabeth\u0027s little sister and become...herself?\u003c/p\u003e\n\u003cp\u003eAmelia reached out and squeezed her hand. \"Be a woman of courage, Grace.\" She smiled then, murmuring something to herself as she turned and looked out the window.\u003c/p\u003e\n\u003cp\u003eGrace stared straight ahead, thinking...wondering...was Amelia right? Or was it just that she had never faced hardship? It was easy to talk about being courageous when one had never come face-to-face with desperation.\u003c/p\u003e\n\u003cp\u003eWhat would happen if a woman of her background married a duke? Thomas\u0027s mother had not been an aristocrat, but when she married his father, he was only third in line to inherit, and no one had expected her to become a duchess. By all accounts, she had been dreadfully unhappy. Miserable, even.\u003c/p\u003e\n\u003cp\u003eBut Thomas\u0027s parents had not loved each other. They had not even liked each other, from what Grace had heard.\u003c/p\u003e\n\u003cp\u003eBut she loved Jack.\u003c/p\u003e\n\u003cp\u003eAnd he loved her.\u003c/p\u003e\n\u003cp\u003eStill, it would all be so much simpler if he turned out not to be the legitimate son of John Cavendish.\u003c/p\u003e\n\u003cp\u003eAnd then, out of nowhere, Amelia whispered, \"We could blame the dowager.\" As Grace turned to her in confusion, Amelia clarified, \"For this. You said it would be easier if we had someone to blame.\"\u003c/p\u003e\n\u003cp\u003eGrace looked over at the dowager, who was seated across from Amelia. She was snoring softly, and her head was perched at what had to be an uncomfortable angle. It was remarkable, but even in repose her mouth was pinched and unpleasant.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s certainly more her fault than anyone else\u0027s,\" Amelia added, but Grace noted that she tossed a nervous glance at the dowager as she spoke.\u003c/p\u003e\n\u003cp\u003eGrace nodded, murmuring, \"I cannot disagree with that.\"\u003c/p\u003e\n\u003cp\u003eAmelia stared off into space for several seconds, and then, just when Grace was convinced that she did not plan to respond, she said, \"It didn\u0027t make me feel any better.\"\u003c/p\u003e\n\u003cp\u003e\"Blaming the dowager?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Amelia\u0027s shoulders slumped a bit. \"It\u0027s still horrible. The whole thing.\"\u003c/p\u003e\n\u003cp\u003e\"Dreadful,\" Grace agreed.\u003c/p\u003e\n\u003cp\u003eAmelia turned and looked at her directly. \"Sodding bad.\"\u003c/p\u003e\n\u003cp\u003eGrace gasped. \"Amelia!\"\u003c/p\u003e\n\u003cp\u003eAmelia\u0027s face wrinkled in thought. \"Did I use that correctly?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come now, don\u0027t tell me you haven\u0027t thought something just as unladylike.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t say it.\"\u003c/p\u003e\n\u003cp\u003eThe look Amelia gave her was as clear as a dare. \"But you thought it.\"\u003c/p\u003e\n\u003cp\u003eGrace felt her lips twitch. \"It\u0027s a damned shame.\"\u003c/p\u003e\n\u003cp\u003e\"A bloody inconvenience, if you ask me,\" Amelia responded, fast enough so Grace knew she\u0027d been saving that one.\u003c/p\u003e\n\u003cp\u003e\"I have an advantage, you know,\" Grace said archly.\u003c/p\u003e\n\u003cp\u003e\"Oh, really?\"\u003c/p\u003e\n\u003cp\u003e\"Indeed. I am privy to the servants\u0027 talk.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come now, you won\u0027t be convincing me that the housemaids at Belgrave talk like the fishmonger.\"\u003c/p\u003e\n\u003cp\u003e\"No, but sometimes the footmen do.\"\u003c/p\u003e\n\u003cp\u003e\"In front of you?\"\u003c/p\u003e\n\u003cp\u003e\"Not on purpose,\" Grace admitted, \"but it happens.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\" Amelia turned to her with quirked lips and humor in her eyes. \"Do your worst.\"\u003c/p\u003e\n\u003cp\u003eGrace thought for a moment and then, after darting a quick glance across the carriage to make sure that the dowager was still asleep, she leaned forward and whispered in Amelia\u0027s ear.\u003c/p\u003e\n\u003cp\u003eWhen she was through, Amelia drew back and stared at her, blinking three times before saying, \"I\u0027m not sure I know what that means.\"\u003c/p\u003e\n\u003cp\u003eGrace frowned. \"I don\u0027t think I do, either.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds bad, though.\"\u003c/p\u003e\n\u003cp\u003e\"Sodding bad,\" Grace said with a smile, and she patted Amelia\u0027s hand.\u003c/p\u003e\n\u003cp\u003eAmelia sighed. \"A damned shame.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re repeating ourselves,\" Grace pointed out.\u003c/p\u003e\n\u003cp\u003e\"I know,\" Amelia said, with a fair bit of feeling. \"But whose fault is it? Not ours. We\u0027ve been far too sheltered.\"\u003c/p\u003e\n\u003cp\u003e\"Now that,\" Grace announced with flair, \"really is a damned shame.\"\u003c/p\u003e\n\u003cp\u003e\"A bloody inconvenience, if you ask me.\"\u003c/p\u003e\n\u003cp\u003e\"What the devil are the two of you talking about?\"\u003c/p\u003e\n\u003cp\u003eGrace gulped, and she stole a glance at Amelia, who was staring at the now quite awake dowager with a similar look of horror.\u003c/p\u003e\n\u003cp\u003e\"Well?\" the dowager demanded.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" Grace chirped.\u003c/p\u003e\n\u003cp\u003eThe dowager regarded her with a most unpleasant expression, then turned her icy attentions to Amelia.\u003c/p\u003e\n\u003cp\u003e\"And you, Lady Amelia. Where is your breeding?\"\u003c/p\u003e\n\u003cp\u003eAnd then Amelia - oh, dear heavens - she shrugged her shoulders and said, \"Damned if I know.\"\u003c/p\u003e\n\u003cp\u003eGrace tried to hold still, but her shock positively burst out of her, and she rather feared she spat upon the dowager. Which did seem ironic, that the first time she did such a thing, it should be accidental.\u003c/p\u003e\n\u003cp\u003e\"You are disgusting,\" the dowager hissed. \"I cannot believe I considered forgiving you.\"\u003c/p\u003e\n\u003cp\u003e\"Stop picking on Grace,\" Amelia said. With surprising force.\u003c/p\u003e\n\u003cp\u003eGrace turned to Amelia in surprise.\u003c/p\u003e\n\u003cp\u003eThe dowager, however, was furious. \"I beg your pardon.\"\u003c/p\u003e\n\u003cp\u003e\"I said, stop picking on Grace.\"\u003c/p\u003e\n\u003cp\u003e\"And who do you think you are, to order me about?\"\u003c/p\u003e\n\u003cp\u003eAs Grace watched Amelia, she would have sworn she changed right before her very eyes. Gone was the unsure girl, in her place was: \"The future Duchess of Wyndham, or so I\u0027m told.\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s lips parted in shock. And admiration.\u003c/p\u003e\n\u003cp\u003e\"Because really,\" Amelia added disdainfully, \"if I\u0027m not, what the devil am I doing here, halfway across Ireland?\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s eyes darted from Amelia to the dowager and back. And then back again. And then -\u003c/p\u003e\n\u003cp\u003eWell, suffice it to say, it was a monstrously long moment of silence.\u003c/p\u003e\n\u003cp\u003e\"Do not speak again,\" the dowager finally said. \"I cannot tolerate the sound of your voices.\"\u003c/p\u003e\n\u003cp\u003eAnd indeed, they all remained silent for the rest of the journey. Even the dowager. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-lost-duke-of-wyndham-two-dukes-of-wyndham-1/page-19.html","bookId":2642,"creation":"Oct 5, 2019 10:25:45 PM","modification":"Oct 5, 2019 10:25:45 PM"}
