{"id":103321,"no":4,"title":"Page 4","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTen minutes later Grace was in the Wyndham carriage, alone with the dowager, trying to remember just why she\u0027d told Thomas he shouldn\u0027t commit his grandmother to an asylum. In the last five minutes the dowager had:\u003c/p\u003e\n\u003cp\u003eTurned the carriage around.\u003c/p\u003e\n\u003cp\u003eShoved Grace out and to the ground, where she\u0027d landed awkwardly on her right ankle.\u003c/p\u003e\n\u003cp\u003eSent the Willoughby sisters on their way without the slightest explanation.\u003c/p\u003e\n\u003cp\u003eHad the Wyndham carriage brought around.\u003c/p\u003e\n\u003cp\u003eOutfitted aforementioned carriage with six large footmen.\u003c/p\u003e\n\u003cp\u003eHad Grace tossed inside. (The footman doing the tossing had apologized as he\u0027d done so, but still.)\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am?\" Grace asked hesitantly. They were speeding along at a rate that could not be considered safe, but the dowager kept banging her walking stick against the wall, bellowing at the driver to move faster.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am? Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"You know very well.\"\u003c/p\u003e\n\u003cp\u003eGrace waited one careful moment, then said, \"I\u0027m sorry, ma\u0027am, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eThe dowager speared her with an angry stare.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t know where he is,\" Grace pointed out.\u003c/p\u003e\n\u003cp\u003e\"We will find him.\"\u003c/p\u003e\n\u003cp\u003e\"But, ma\u0027am - \"\u003c/p\u003e\n\u003cp\u003e\"Enough!\" the dowager ground out. Her voice was not loud, but it contained sufficient passion to silence Grace immediately. After a moment passed, she stole a glance at the older woman. She was sitting ramrod straight - too straight, really, for a ride in the carriage, and her right hand was bent and angled like a claw, pulling back the curtain so she might see outside.\u003c/p\u003e\n\u003cp\u003eTrees.\u003c/p\u003e\n\u003cp\u003eThat\u0027s all there was to see. Grace couldn\u0027t imagine why the dowager was staring out so intently.\u003c/p\u003e\n\u003cp\u003e\"If you saw him,\" the dowager said, her low voice cutting into Grace\u0027s thoughts, \"then he is still in the district.\"\u003c/p\u003e\n\u003cp\u003eGrace said nothing. The dowager wasn\u0027t looking at her, in any case.\u003c/p\u003e\n\u003cp\u003e\"Which means,\" the icy voice continued, \"that there are only a very few places he might be. Three posting inns in the vicinity. That is all.\"\u003c/p\u003e\n\u003cp\u003eGrace rested her forehead in her hand. It was a sign of weakness, something she usually tried not to display in front of the dowager, but there was no maintaining a stiff facade now. They were going to kidnap him. She, Grace Catriona Eversleigh, who had never so much as nicked a ha\u0027penny ribbon from a fair, was going to be party to what had to be a high crime. \"Dear Lord,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"Shut up,\" the dowager snapped, \"and make yourself useful.\"\u003c/p\u003e\n\u003cp\u003eGrace grit her teeth. How the devil did the dowager think she could be useful? Surely any manhandling that needed doing would be performed by the footmen, each of whom stood, as per Belgrave regulations, five feet eleven inches tall. And no, she did not mistake their purpose on the journey. When she had looked askance at the dowager, the reply had been a terse, \"My grandson might need convincing.\"\u003c/p\u003e\n\u003cp\u003eNow, the dowager growled, \"Look out the window,\" speaking to her as if she\u0027d turned idiot overnight.\u003c/p\u003e\n\u003cp\u003e\"You got the best look at him.\"\u003c/p\u003e\n\u003cp\u003eDear God, she would gratefully forfeit five years off her life just to be anywhere but inside this carriage.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am, I said - he was at the end of the drive. I didn\u0027t really see him.\"\u003c/p\u003e\n\u003cp\u003e\"You did last night.\"\u003c/p\u003e\n\u003cp\u003eGrace had been trying not to look at her, but at that, she could not help but stare.\u003c/p\u003e\n\u003cp\u003e\"I saw you kissing him,\" the dowager hissed. \"And I will warn you now. Don\u0027t try to rise above your station.\"\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am, he kissed me.\"\u003c/p\u003e\n\u003cp\u003e\"He is my grandson,\" the dowager spat, \"and he may very well be the true Duke of Wyndham, so do not be getting any ideas. You are valued as my companion, but that is all.\"\u003c/p\u003e\n\u003cp\u003eGrace could not find the outrage to react to the insult. Instead, she could only stare at the dowager in horror, unable to believe that she had actually spoken the words.\u003c/p\u003e\n\u003cp\u003eThe true Duke of Wyndham.\u003c/p\u003e\n\u003cp\u003eEven the very suggestion of it was scandalous. Would she throw over Thomas so easily, strip him of his birthright, of his very name? Wyndham was not just a title Thomas held, it was who he was.\u003c/p\u003e\n\u003cp\u003eBut if the dowager publicly championed the highwayman as the true heir...dear God, Grace could not even imagine the depth of the scandal it would create. The impostor would be proven illegitimate, of course - there could be no other outcome, surely - but the damage would be done. There would always be those who whispered that maybe Thomas wasn\u0027t really the duke, that maybe he ought not be so secure in his conceits, because he wasn\u0027t truly entitled to them, was he?\u003c/p\u003e\n\u003cp\u003eGrace could not imagine what this would do to him. To all of them.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am,\" she said, her voice quavering slightly. \"You cannot think that this man could be legitimate.\"\u003c/p\u003e\n\u003cp\u003e\"Of course I can,\" the dowager snapped. \"His manners were impeccable - \"\u003c/p\u003e\n\u003cp\u003e\"He was a highwayman!\"\u003c/p\u003e\n\u003cp\u003e\"One with a fine bearing and perfectly correct accent,\" the dowager retorted. \"Whatever his current station, he was brought up properly and given a gentleman\u0027s education.\"\u003c/p\u003e\n\u003cp\u003e\"But that does not mean - \"\u003c/p\u003e\n\u003cp\u003e\"My son died on a boat,\" the dowager interrupted, her voice hard, \"after he\u0027d spent eight months in Ireland. Eight bloody months that were supposed to be four weeks. He went to attend a wedding. A wedding.\" Her body seemed to harden as she paused, her teeth grinding together at the memory. \"And not even of anyone worth mentioning. Just some school friend whose parents bought themselves a title and bludgeoned their way into Eton, as if that could make them better than they were.\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s eyes widened. The dowager\u0027s voice had descended into a low, venomous hiss, and without even meaning to, Grace moved closer to the window. It felt toxic to be so close to her right now.\u003c/p\u003e\n\u003cp\u003e\"And then...\" the dowager continued. \"And then! All I received was a three-sentence note, written in someone else\u0027s hand, reporting that he was having such a fine time that he believed he was going to remain.\"\u003c/p\u003e\n\u003cp\u003eGrace blinked. \"He didn\u0027t write it himself?\" she asked, unsure why she found this detail so curious.\u003c/p\u003e\n\u003cp\u003e\"He signed it,\" the dowager said brusquely. \"And sealed it with his ring. He knew I couldn\u0027t decipher his scrawl.\" She sat back, her face contorting with decades old anger and resentment. \"Eight months,\" she muttered. \"Eight stupid, useless months. Who is to say he did not marry some harlot over there? He had ample time.\"\u003c/p\u003e\n\u003cp\u003eGrace watched her for several moments. Her nose was in the air, and she gave every indication of haughty anger, but something was not quite right. Her lips were pinching and twisting, and her eyes were suspiciously bright.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am - \" Grace said gently.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t,\" the dowager said, her voice sounding as if it might crack.\u003c/p\u003e\n\u003cp\u003eGrace considered the wisdom of speaking, then decided there was too much at stake to remain silent.\u003c/p\u003e\n\u003cp\u003e\"Your grace, it simply cannot be,\" she began, somehow maintaining her courage despite the withering expression on the dowager\u0027s face. \"This is not a humble country entail. This is not Sillsby,\" she added, swallowing the lump that formed in her throat at the mention of her childhood home. \"We are speaking of Belgrave. Of a dukedom. Heirs apparent do not simply vanish into the mist. If your son had had a son, we would have known.\"\u003c/p\u003e\n\u003cp\u003eThe dowager stared at her for an uncomfortably sharp moment, then said, \"We will try the Happy Hare first. It is the least uncouth of all the local posting inns.\" She settled back against the cushion, staring straight ahead as she said, \"If he is anything like his father, he will be too fond of his comforts for anything less.\"\u003c/p\u003e\n\u003cp\u003eJack was already feeling like an idiot when a sack was thrown over his head.\u003c/p\u003e\n\u003cp\u003eSo this was it, then. He knew he\u0027d stayed too long. The whole ride back he\u0027d berated himself for the fool he was. He should have left after breakfast. He should have left at dawn. But no, he had to get drunk the night before, and then he had to ride out to that bloody castle. And then he\u0027d seen her.\u003c/p\u003e\n\u003cp\u003eIf he hadn\u0027t seen her, he would never have remained at the end of the drive for so long. And then he wouldn\u0027t have ridden off with such speed. And had to rest and water his mount.\u003c/p\u003e\n\u003cp\u003eAnd he certainly wouldn\u0027t have been standing by the trough like a bloody bull\u0027s-eye when someone attacked him from behind.\u003c/p\u003e\n\u003cp\u003e\"Bind him,\" a gruff voice said.\u003c/p\u003e\n\u003cp\u003eIt was enough to set every pore in his body into fighting mode. A man did not spend his life so close to the noose without preparing for those two words.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter that he couldn\u0027t see. It didn\u0027t matter that he had no idea who they were or why they\u0027d come for him. He fought. And he knew how to fight, clean and dirty. But there were three of them at least, possibly more, and he managed only two good punches before he was facedown in the dirt, his hands yanked behind his back and bound with...\u003c/p\u003e\n\u003cp\u003eWell, it wasn\u0027t rope. Almost felt like silk, truth be told.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" one of his captors mumbled, which was odd. Men in the business of tying up other men rarely thought to offer apologies.\u003c/p\u003e\n\u003cp\u003e\"Think nothing of it,\" Jack returned, then cursed himself for his insolence. All his little quip earned him was a mouth full of burlap dust.\u003c/p\u003e\n\u003cp\u003e\"This way,\" someone said, helping him to his feet.\u003c/p\u003e\n\u003cp\u003eAnd Jack could do nothing but obey.\u003c/p\u003e\n\u003cp\u003e\"Er, if you please,\" the first voice said - the one who\u0027d ordered him bound.\u003c/p\u003e\n\u003cp\u003e\"Care to tell me where I\u0027m going?\" Jack inquired.\u003c/p\u003e\n\u003cp\u003eThere was quite a bit of hemming and hawing. Minions. These were minions. He sighed. Minions never knew the important things.\u003c/p\u003e\n\u003cp\u003e\"Er, can you step up?\"\u003c/p\u003e\n\u003cp\u003eAnd then, before Jack could oblige, or even say, \"Beg pardon,\" he was roughly hoisted into the air and tumbled into what had to be a carriage.\u003c/p\u003e\n\u003cp\u003e\"Put him on a seat,\" a voice barked. He knew that voice. It was the old lady. His grandmother.\u003c/p\u003e\n\u003cp\u003eWell, at least he wasn\u0027t off to be hanged.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t suppose someone will see to my horse,\" Jack said.\u003c/p\u003e\n\u003cp\u003e\"See to his horse,\" the old lady snapped.\u003c/p\u003e\n\u003cp\u003eJack allowed himself to be moved onto a seat, not a particularly easy maneuver, bound and blindfolded as he was.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t suppose you\u0027ll untie my hands,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not stupid,\" was the old lady\u0027s reply.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said with a false sigh. \"I didn\u0027t think you were. Beauty and stupidity never go as hand in hand as one might wish.\"\u003c/p\u003e\n\u003cp\u003e\"I am sorry I had to take you this way,\" the old lady said. \"But you left me no choice.\"\u003c/p\u003e\n\u003cp\u003e\"No choice,\" Jack mused. \"Yes, of course. Because I\u0027ve done so much to escape your clutches up to now.\"\u003c/p\u003e\n\u003cp\u003e\"If you had intended to call upon me,\" the old lady said sharply, \"you would not have ridden off earlier this afternoon.\"\u003c/p\u003e\n\u003cp\u003eJack felt himself smile mockingly. \"She told you, then,\" he said, wondering why he\u0027d thought she might not.\u003c/p\u003e\n\u003cp\u003e\"Miss Eversleigh?\"\u003c/p\u003e\n\u003cp\u003eSo that was her name.\u003c/p\u003e\n\u003cp\u003e\"She had no choice,\" the old lady said dismissively, as if the wishes of Miss Eversleigh were something she rarely considered.\u003c/p\u003e\n\u003cp\u003eAnd then Jack felt it. A slight brush of air beside him. A faint rustle of movement.\u003c/p\u003e\n\u003cp\u003eShe was there. The elusive Miss Eversleigh. The silent Miss Eversleigh.\u003c/p\u003e\n\u003cp\u003eThe delicious Miss Eversleigh.\u003c/p\u003e\n\u003cp\u003e\"Remove his hood,\" he heard his grandmother order. \"You\u0027re going to suffocate him.\"\u003c/p\u003e\n\u003cp\u003eJack waited patiently, affixing a lazy smile onto his face - it was not, after all, the expression they would expect, and thus the one he most wished to display. He heard her make a noise - Miss Eversleigh, that was. It wasn\u0027t a sigh exactly, and not a groan, either. It was something he couldn\u0027t quite place. Weary resignation, perhaps. Or maybe -\u003c/p\u003e\n\u003cp\u003eThe hood came off, and he took a moment to savor the cool air on his face.\u003c/p\u003e\n\u003cp\u003eThen he looked at her.\u003c/p\u003e\n\u003cp\u003eIt was mortification. That\u0027s what it had been. Poor Miss Eversleigh looked miserable. A more gracious gentleman would have turned away, but he wasn\u0027t feeling overly charitable at the moment, and so he treated himself to a lengthy perusal of her face. She was lovely, although not in any predictable manner.\u003c/p\u003e\n\u003cp\u003eNo English rose was she, not with that glorious dark hair and shining blue eyes that tilted up ever-so-slightly at the edges. Her lashes were dark and sooty, in stark contrast to the pale perfection of her skin.\u003c/p\u003e\n\u003cp\u003eOf course, that paleness might have been a result of her extreme discomfort. The poor girl looked as if she might cast up her accounts at any moment.\u003c/p\u003e\n\u003cp\u003e\"Was it that bad, kissing me?\" he murmured.\u003c/p\u003e\n\u003cp\u003eShe turned scarlet.\u003c/p\u003e\n\u003cp\u003e\"Apparently so.\" He turned to his grandmother and said in his most conversational tone, \"I hope you realize this is a hanging offense.\"\u003c/p\u003e\n\u003cp\u003e\"I am the Duchess of Wyndham,\" she replied with a haughty lift of her brow. \"Nothing is a hanging offense.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, the unfairness of life,\" he said with a sigh. \"Wouldn\u0027t you agree, Miss Eversleigh?\"\u003c/p\u003e\n\u003cp\u003eShe looked as if she wanted to speak. Indeed, the poor girl was most definitely biting her tongue.\u003c/p\u003e\n\u003cp\u003e\"Now if you were the perpetrator in this little crime,\" he continued, allowing his eyes to slide insolently from her face to her bosom and back, \"this would all be so very different.\"\u003c/p\u003e\n\u003cp\u003eHer jaw tightened.\u003c/p\u003e\n\u003cp\u003e\"It would be,\" he murmured, allowing his gaze to fall to her lips, \"rather lovely, I think. Just think - you, me, alone in this exceedingly luxurious carriage.\" He sighed contentedly and sat back. \"The imagination runs wild.\"\u003c/p\u003e\n\u003cp\u003eHe waited for the old lady to defend her. She did not.\u003c/p\u003e\n\u003cp\u003e\"Care to share your plans for me?\" he asked, propping one ankle over the opposite knee as he slouched in his seat. It wasn\u0027t an easy position to achieve, with his hands still stuck behind him, but he was damned if he\u0027d sit up straight and polite.\u003c/p\u003e\n\u003cp\u003eThe old lady turned to him, her lips pinched. \"Most men would not complain.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I am not most men.\" Then he offered a half smile and turned to Miss Eversleigh. \"A rather banal rejoinder on my part, wouldn\u0027t you say? So obvious. A novice could have come up with it.\" He shook his head as if disappointed. \"I do hope I\u0027m not losing my touch.\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened.\u003c/p\u003e\n\u003cp\u003eHe grinned. \"You think I\u0027m mad.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" she said, and he rather enjoyed her voice again, washing warmly over him.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s something to consider.\" He turned to the old lady. \"Does madness run in the family?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" she snapped.\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s a relief. Not,\" he added, \"that I am acknowledging a connection. I don\u0027t believe I wish to be associated with cutthroats such as yourself. Tsk tsk. Even I have never resorted to kidnapping.\" He leaned forward, as if imparting a very grave confidence to Miss Eversleigh. \"It\u0027s very bad form, you know.\"\u003c/p\u003e\n\u003cp\u003eAnd he thought - oh, how lovely - that he saw her lips twitch. Miss Eversleigh had a sense of humor. She was growing more delectable by the second.\u003c/p\u003e\n\u003cp\u003eHe smiled at her. He knew how to do it, too. He knew exactly how to smile at a woman to make her feel it deep inside.\u003c/p\u003e\n\u003cp\u003eHe smiled at her. And she blushed.\u003c/p\u003e\n\u003cp\u003eWhich made him smile even more.\u003c/p\u003e\n\u003cp\u003e\"Enough,\" the old lady snapped.\u003c/p\u003e\n\u003cp\u003eHe feigned innocence. \"Of what?\"\u003c/p\u003e\n\u003cp\u003eHe looked at her, at this woman who was most probably his grandmother. Her face was pinched and lined, the corners of her mouth pulled down by the weight of an eternal frown. She\u0027d look unhappy even if she smiled, he thought. Even if somehow she managed to get that mouth to form a crescent in the correct direction -\u003c/p\u003e\n\u003cp\u003eNo, he decided. It wouldn\u0027t work. She\u0027d never manage it. She\u0027d probably expire from the exertion.\u003c/p\u003e\n\u003cp\u003e\"Leave my companion alone,\" she said tersely.\u003c/p\u003e\n\u003cp\u003eHe leaned toward Miss Eversleigh, giving her a lopsided smile even though she was quite determinedly looking away. \"Was I bothering you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said quickly. \"Of course not.\"\u003c/p\u003e\n\u003cp\u003eWhich couldn\u0027t have been further from the truth, but who was he to quibble?\u003c/p\u003e\n\u003cp\u003eHe turned back to the old lady. \"You didn\u0027t answer my question.\"\u003c/p\u003e\n\u003cp\u003eShe lifted an imperious brow. Ah, he thought, completely without humor, that was where he got the expression.\u003c/p\u003e\n\u003cp\u003e\"What do you plan to do with me?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Do with you.\" She repeated the words curiously, as if she found them most strange.\u003c/p\u003e\n\u003cp\u003eHe lifted a brow right back at her, wondering if she\u0027d recognize the gesture. \"There are a great many options.\"\u003c/p\u003e\n\u003cp\u003e\"My dear boy,\" she began. Her tone was grand. Condescending. As if he\u0027d only needed this to realize that he ought to be licking her boots. \"I\u0027m going to give you the world.\"\u003c/p\u003e\n\u003cp\u003eGrace had just about managed to regain her equilibrium when the highwayman, after a lengthy and thoughtful frown, turned to the dowager and said, \"I don\u0027t believe I\u0027m interested in your world.\"\u003c/p\u003e\n\u003cp\u003eA bubble of horrified laughter burst forth from her throat. Oh dear heavens, the dowager looked ready to spit.\u003c/p\u003e\n\u003cp\u003eGrace clamped a hand over her mouth and turned away, trying not to notice that the highwayman was positively grinning at her.\u003c/p\u003e\n\u003cp\u003e\"Apologies,\" he said to the dowager, not sounding the least bit contrite. \"But can I have her world instead?\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s head snapped back around in time to see him nodding in her direction. He shrugged. \"I like you better.\"\u003c/p\u003e\n\u003cp\u003e\"Are you never serious?\" the dowager bit off.\u003c/p\u003e\n\u003cp\u003eAnd then he changed. His body did not move from its slouch, but Grace could feel the air around him coiling with tension. He was a dangerous man. He hid this well with his lazy charm and insolent smile.\u003c/p\u003e\n\u003cp\u003eBut he was not a man to be crossed. She was sure of it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m always serious,\" he said, his eyes never leaving those of the dowager. \"You\u0027d do well to take note of that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry,\" Grace whispered, the words slipping out before she had a chance to consider them. The gravity of the situation was bearing down on her with uncomfortable intensity. She had been so worried about Thomas and what this would all mean for him. But in that moment it was brought home to her that there were two men caught in this web.\u003c/p\u003e\n\u003cp\u003eAnd whatever this man was, whoever he was, he did not deserve this. Perhaps he would want life as a Cavendish, with its riches and prestige. Most men would. But he deserved the choice. Everyone deserved a choice.\u003c/p\u003e\n\u003cp\u003eShe looked over at him then, forcing herself to bring her eyes to his face. She had been avoiding his gaze as much as she could, but her cowardice suddenly felt distasteful.\u003c/p\u003e\n\u003cp\u003eHe must have felt her watching him, because he turned. His dark hair fell forward over his brow, and his eyes - a spectacular shade of mossy green - grew warm. \"I do like you better,\" he murmured, and she thought - hoped? - that she saw a flicker of respect in his gaze.\u003c/p\u003e\n\u003cp\u003eAnd then, quick as a blink, the moment was gone. His mouth slid into that cocky half smile and he let out a pent-up breath before saying, \"It\u0027s a compliment.\"\u003c/p\u003e\n\u003cp\u003eIt was on the tip of her tongue to say, Thank you, as ridiculous as that seemed, but then he shrugged - one shoulder only, as if that was all he could be bothered with - and added, \"Of course, I would imagine that the only person I would like less than our esteemed countess - \"\u003c/p\u003e\n\u003cp\u003e\"Duchess,\" the dowager snapped.\u003c/p\u003e\n\u003cp\u003eHe paused, gave her a blandly haughty stare, then turned back to Grace. \"As I was saying, the only person I would like less than her\" - he jerked his head toward the dowager, not even honoring her with a direct glance - \"would be the French menace himself, so I suppose it\u0027s not that much of a compliment, but I did want you to know that it was sincerely given.\"\u003c/p\u003e\n\u003cp\u003eGrace tried not to smile, but he always seemed to be looking at her as if they were sharing a joke, just the two of them, and she knew that it was making the dowager more furious by the second. A glance across the carriage confirmed this; the dowager looked even more starched and upset than usual.\u003c/p\u003e\n\u003cp\u003eGrace turned back to the highwayman, as much out of self-preservation as anything else. The dowager showed every sign of an imminent tirade, but after her performance the night before, Grace knew that she was far too besotted with the idea of her long-lost grandson to make him her target.\u003c/p\u003e\n\u003cp\u003e\"What is your name?\" Grace asked him, since it seemed the most obvious question.\u003c/p\u003e\n\u003cp\u003e\"My name?\"\u003c/p\u003e\n\u003cp\u003eGrace nodded.\u003c/p\u003e\n\u003cp\u003eHe turned to the dowager with an expression of great scolding. \"Funny that you haven\u0027t asked me yet.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Shameful manners. All the best kidnappers know their victims\u0027 names.\"\u003c/p\u003e\n\u003cp\u003e\"I am not kidnapping you!\" the dowager burst out.\u003c/p\u003e\n\u003cp\u003eThere was an uncomfortable moment of silence, and then his voice emerged like silk. \"I misunderstand the bindings, then.\"\u003c/p\u003e\n\u003cp\u003eGrace looked warily at the dowager. She\u0027d never appreciated sarcasm unless it emerged from her own lips, and she would never allow him the last word. And indeed, when she spoke, her words were clipped and stiff, and colored blue with the blood of one secure in her own superiority. \"I am restoring you to your proper place in this world.\"\u003c/p\u003e\n\u003cp\u003e\"I see,\" he said slowly.\u003c/p\u003e\n\u003cp\u003e\"Good,\" the dowager said briskly. \"We are in accord, then. All that remains is for us to - \"\u003c/p\u003e\n\u003cp\u003e\"My proper place,\" he said, cutting her off.\u003c/p\u003e\n\u003cp\u003e\"Indeed.\"\u003c/p\u003e\n\u003cp\u003e\"In the world.\"\u003c/p\u003e\n\u003cp\u003eGrace realized that she was holding her breath. She could not look away, could not take her eyes off his when he murmured, \"The conceit. It\u0027s remarkable.\"\u003c/p\u003e\n\u003cp\u003eHis voice was soft, almost thoughtful, and it cut to the bone. The dowager turned sharply toward the window, and Grace searched her face for something - anything - that might have shown her humanity, but she remained stiff and hard, and her voice betrayed no emotion when she said, \"We are almost home.\"\u003c/p\u003e\n\u003cp\u003eThey were turning down the drive, passing the very spot where Grace had seen him earlier that afternoon.\u003c/p\u003e\n\u003cp\u003e\"So you are,\" the highwayman said, glancing out the window.\u003c/p\u003e\n\u003cp\u003e\"You will come to regard it as home,\" the dowager stated, her voice imperious and exacting and, more than anything else, final.\u003c/p\u003e\n\u003cp\u003eHe did not respond. But he didn\u0027t need to. They all knew what he was thinking.\u003c/p\u003e\n\u003cp\u003eNever. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-lost-duke-of-wyndham-two-dukes-of-wyndham-1/page-4.html","bookId":2642,"creation":"Oct 5, 2019 10:25:45 PM","modification":"Oct 5, 2019 10:25:45 PM"}
