{"id":101932,"no":1,"title":"Page 1","content":"\u003cp\u003eChapter 1\u003c/p\u003e\n\u003cp\u003eIn the dim, almost but-not- quite seedy bar lights, I stared openmouthed at my best friend in what had to be the most unattractive manner. Mel was rocking the crazy pants tonight.\u003c/p\u003e\n\u003cp\u003eIt was the only reasonable explanation.\u003c/p\u003e\n\u003cp\u003eThat or Mel’s drink was a hell of a lot stronger than mine.\u003c/p\u003e\n\u003cp\u003eWe’d been peanut butter and jelly since I shared my chocolate cupcakes with her in the first grade. A rattlesnake and a bunny had more in common than we did. Mel was the crazy one, always into something, while I was mostly comfortable reading a book or watching a movie.\u003c/p\u003e\n\u003cp\u003eThroughout our lives, no one could figure out how we were so close, but when friendships begin with cupcakes—chocolate, at that—no truer bond develops.\u003c/p\u003e\n\u003cp\u003eI took a huge gulp of my rum and coke, wincing at the burn. “Mel, this sounds —”\u003c/p\u003e\n\u003cp\u003e“Insane? I know. I feel insane. I wouldn’t believe it if I hadn’t seen it with my own two eyes, and these blue peepers have twenty- twenty vision thanks to Lasik.” Mel jabbed at her eyes with two fingers. Both had chipped nail polish, which was so unlike her glamour-loving nature. “But I know what I saw, Serena, and I’m telling you Phillip isn’t human.”\u003c/p\u003e\n\u003cp\u003eThere. She said it again.\u003c/p\u003e\n\u003cp\u003eNot human. I peeked at Mel’s half-full glass. Had she been drinking before we met up? Or toking on the crack pipe? If the frantic voice mail I’d received from Mel while I’d been at the school and the subsequent conversation was any indication, maybe meth was involved. Mel liked to party, but she stayed away from the harder stuff. Hopefully. I was beginning to wonder.\u003c/p\u003e\n\u003cp\u003eI leaned forward, stretching the fit of my suit jacket as I folded my arms on the round table. Damn, I wished I’d had time to run home and change.\u003c/p\u003e\n\u003cp\u003eI needed more comfortable clothes for this stuff.\u003c/p\u003e\n\u003cp\u003eNothing made crazy easier to accept than lounge pants and flip-flops. “Mel, most guys aren’t human.”\u003c/p\u003e\n\u003cp\u003eMel’s eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“Yeah, well most guys don’t turn into a freaking light bulb! But Vanderson’s sons did. Both of them!”\u003c/p\u003e\n\u003cp\u003eA couple glanced over at us curiously. Wanting to crawl under the table, I grabbed Mel’s hand and squeezed gently. “A light bulb?” I kept my voice down even though it was pointless. Mel was always a loud talker. And it was election season, so Senator Vanderson’s name being dropped was bound to get attention.\u003c/p\u003e\n\u003cp\u003e“Yes. He lit up like a freaking glow stick or—or you remember those toys that you squeeze and they light up?”\u003c/p\u003e\n\u003cp\u003e“A Glo Worm?”\u003c/p\u003e\n\u003cp\u003e“That!” Mel pulled her hand free and thrust it through her chin-length, raven-colored hair.\u003c/p\u003e\n\u003cp\u003e“He was like a Glo Worm but only brighter.”\u003c/p\u003e\n\u003cp\u003eOh dear.\u003c/p\u003e\n\u003cp\u003eShe was definitely rocking the crazy pants. “Were you guys drinking or possibly smoking something—”\u003c/p\u003e\n\u003cp\u003eMel’s hand smacked the table, rattling our glasses.\u003c/p\u003e\n\u003cp\u003e“There is nothing in this world that I could drink or smoke that would make me see that.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I held up my hands in surrender. “I just don’t understand this, Mel.\u003c/p\u003e\n\u003cp\u003eDon’t bitch-slap the table.\u003c/p\u003e\n\u003cp\u003eIt’s not its fault.”\u003c/p\u003e\n\u003cp\u003eShe let out a long breath. “I’m just so—so freaked out. He saw me.\u003c/p\u003e\n\u003cp\u003eHis brother saw me. I know they know I saw them.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. I recognized how freaked out Mel truly was.\u003c/p\u003e\n\u003cp\u003eGranted, Mel got excited over things like grasshoppers in the house, branches that looked like snakes in the yard, and… butterflies flying around, but I’d never seen her like this. This was different.\u003c/p\u003e\n\u003cp\u003eSomething had really scared her.\u003c/p\u003e\n\u003cp\u003e“I knew Phillip was bad news,” I said, tucking a strand of wavy hair behind my ear.\u003c/p\u003e\n\u003cp\u003e“Being the senator’s son had to have messed with him. He’s probably—”\u003c/p\u003e\n\u003cp\u003e“He’s probably one of them, too—the senator!”\u003c/p\u003e\n\u003cp\u003eOh my God, if Mel kept yelling that, we were never going to be able to show our faces around here again. I wished they’d turn the music up louder and maybe turn the lights off, too. Fast Times bar wasn’t too packed on a Monday night, so conversation had a tendency to travel.\u003c/p\u003e\n\u003cp\u003eMel took a healthy swallow of her drink. “I was at his apartment, not back in Grandview, when it happened.”\u003c/p\u003e\n\u003cp\u003eGrandview was where the Richie Rich of Boulder lived, an exclusive, gated community at the foothills of the Flatirons that the senator and other important people kept residency in. The gate was like a ridiculous twenty feet high. Absurd. Did they think Russia was going to invade them?\u003c/p\u003e\n\u003cp\u003e“When he did the light- bulb thing?”\u003c/p\u003e\n\u003cp\u003eI asked, fiddling with my straw.\u003c/p\u003e\n\u003cp\u003eMel nodded. “We were hanging out in his living room, having drinks.\u003c/p\u003e\n\u003cp\u003eNothing serious. And then we went back to the bedroom, had sex—it was great, as usual. Phillip has stamina like no other guy in this world does.”\u003c/p\u003e\n\u003cp\u003eMy brows rose.\u003c/p\u003e\n\u003cp\u003e“Then his brother showed up—Elijah.”\u003c/p\u003e\n\u003cp\u003e“While you two were having sex?”\u003c/p\u003e\n\u003cp\u003e“As hot as that would be considering they’re twins, no, not while Phillip and I were having sex.” She plucked at the button on her blouse. “Anyway, they got into some kind of argument outside on the balcony. The two of them are always bickering and, you know me, I’m perpetually nosy, right?”\u003c/p\u003e\n\u003cp\u003eI smiled. “Yes.”\u003c/p\u003e\n\u003cp\u003e“So I went to the door and listened. They were talking about something called Project Eagle and Daedalus—”\u003c/p\u003e\n\u003cp\u003e“Daedalus?\u003c/p\u003e\n\u003cp\u003eIsn’t that some Greek thing?”\u003c/p\u003e\n\u003cp\u003e“That doesn’t matter, Serena. Listen to me. They were arguing about this.\u003c/p\u003e\n\u003cp\u003eElijah was pissed because their father was going to ruin things with the Daedalus and that this Eagle thing was a bad idea, but Phillip didn’t care or whatever. He told Elijah to mind his own business and to let it go. That it wasn’t their place.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I wondered how this turned into Phillip becoming a light bulb.\u003c/p\u003e\n\u003cp\u003e“But Elijah was really upset, saying it was all going to blow up in their faces and that this Eagle thing was wrong and dangerous.\u003c/p\u003e\n\u003cp\u003eHe said something about Pennsylvania and where the kids were kept and if the Daedalus ever discovered what they planned, it would all be over. And at this point, I’m like, wow, what’s going on?” Mel’s blue eyes were wide and dilated. “Elijah said something too low for me to hear and it must’ve really upset Phillip, because he pushed his brother and then his brother pushed him back.\u003c/p\u003e\n\u003cp\u003eTwo grown men fighting like that? I thought one of them was going to push the other over the railing.\u003c/p\u003e\n\u003cp\u003eBut then…then it happened.”\u003c/p\u003e\n\u003cp\u003e“The light-bulb thing?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She pressed her palm to her forehead, squeezing her eyes shut.\u003c/p\u003e\n\u003cp\u003eHer normally tanned skin was pale. “At first, it was like he faded out. His clothes, body, everything just faded out like he’d vanished. And then he was there, but he wasn’t human, Serena. He was ENCASED IN LIGHT . Head to toe, Serena.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said slowly.\u003c/p\u003e\n\u003cp\u003e“What did you do?”\u003c/p\u003e\n\u003cp\u003e“I flipped out like any normal person would do! I got the hell out there, but…”\u003c/p\u003e\n\u003cp\u003eShe cursed, lowering her hand to the table. “I dropped the damn bottle of beer. They heard me. I looked back and they were at the balcony door, both of them glowing…”\u003c/p\u003e\n\u003cp\u003eMel trailed off, lower lip trembling. “They know I saw them.\u003c/p\u003e\n\u003cp\u003eI mean, obviously, since I ran out of the building like it was on fire. I don’t know what to do. I haven’t even gone home. I’ve been driving around waiting for you to get off, which took forever, by the way. I wrote it all down while I was in my car just in case….”\u003c/p\u003e\n\u003cp\u003e“Just in case what?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I just felt like I needed to write it down before I forgot things, and I know I already have. Shit.” She groaned as she bounced on her seat. “I was trying to waste time and I ended up leaving it in my post office box when I checked my mail, because I was so out of it.”\u003c/p\u003e\n\u003cp\u003eI sat back on the bar stool, still having no idea what to say. Mel was obviously worked up, so something had to have happened. Probably not what she thought, but something, and I felt for her.\u003c/p\u003e\n\u003cp\u003e“I’m too afraid to go home. Phillip knows where I live.” Mel finished off her drink.\u003c/p\u003e\n\u003cp\u003e“When did this happen?\u003c/p\u003e\n\u003cp\u003eThis morning?” I asked, frowning.\u003c/p\u003e\n\u003cp\u003eMel nodded.\u003c/p\u003e\n\u003cp\u003eThen it hit me. “Have you gone to work?”\u003c/p\u003e\n\u003cp\u003e“What? No! How could I go to work after that?” Mel shuddered. “And besides, Phillip knows to find me there, too.”\u003c/p\u003e\n\u003cp\u003eMy chest tightened. Dear God, what if something was really wrong with Mel?\u003c/p\u003e\n\u003cp\u003eNot just an overactive imagination, but something more serious? My training kicked in, spewing out possible aliments like I was doing a mental grocery list: psychotic break with reality, schizophrenia, anxiety attack with hallucinations, or a brain tumor? The possibilities were endless. “Mel…”\u003c/p\u003e\n\u003cp\u003e“Don’t ‘Mel’ me.” Her voice wobbled. “I know I sound crazy, and if I were in your shoes, I’d be thinking the same thing, but I know what I saw.\u003c/p\u003e\n\u003cp\u003ePhillip isn’t human. Neither is his brother. I don’t know what he is—maybe a government experiment or, hell, an alien. I don’t know.”\u003c/p\u003e\n\u003cp\u003eAn alien. Okay. It was time to definitely get out of the bar. “How about you come home with me?”\u003c/p\u003e\n\u003cp\u003eHope sparked in her eyes. “Really? You’re cool with that? I know you probably think I’m bat-shit crazy and all.”\u003c/p\u003e\n\u003cp\u003eI waved her off. “Honey, what are best friends for?\u003c/p\u003e\n\u003cp\u003eThis is a crisis situation and I know how to help. I have ice cream and leftover lasagna. We can stuff our faces and try to figure this out.”\u003c/p\u003e\n\u003cp\u003e“I haven’t eaten all day.\u003c/p\u003e\n\u003cp\u003eI’ve been too nervous.”\u003c/p\u003e\n\u003cp\u003eMel smiled, but it was weak. “You’re the best, Serena. I really mean it.”\u003c/p\u003e\n\u003cp\u003e“I know.” I gave her a cheeky grin. “Stay here and I’ll take care of the tab.”\u003c/p\u003e\n\u003cp\u003eWhen Mel nodded and started digging around in her purse, I grabbed my own and hopped off the stool. Squeezing between the tables, I ignored the WTF looks I was getting from those around us.\u003c/p\u003e\n\u003cp\u003eI quickly took care of the balance—a thing I was accustomed to. Mel had expensive tastes and rarely stayed at one job long enough to make a decent salary. Made no sense to me, because Mel was smart and had the education, but she just didn’t apply herself. Mel was only twenty-three, the same age as me, so I figured there was more than enough time for Mel to settle down a little, stay away from crazy rich guys, and use the degree in education she’d worked so hard for.\u003c/p\u003e\n\u003cp\u003eI reclaimed Mel by threading my arm through hers. “You ready?”\u003c/p\u003e\n\u003cp\u003eMel nodded but didn’t say anything as we headed out into the dry evening air of early May. We passed a group of men coming in, their jackets off, ties loosened. One of them, a tall blond, whistled under his breath, doing a “Hey girl, hey” that fell on deaf ears. And if everything else wasn’t an indication of how wigged out Mel was, her ignoring a man looking in her direction sure was.\u003c/p\u003e\n\u003cp\u003eConcerned about her, I steered her toward the parking garage. If Mel didn’t change her tune by the time she was stuffed with lasagna and ice cream, I was going to have to convince her to talk to someone—anyone other than me. Our friendship wouldn’t allow for an unbiased diagnosis and I had never really diagnosed anyone before. Being the high school guidance counselor sort of limited the kinds of disorders I was exposed to on a daily basis. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-1.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
