{"id":101941,"no":10,"title":"Page 10","content":"\u003cp\u003e“Hmm…” He put the glasses back and picked up two wine flutes.\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. “You know how old I am.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Hunter swiped a wine bottle out of its rack.\u003c/p\u003e\n\u003cp\u003eStaring at the back of his broad shoulders, I pictured a spider monkey landing on him and biting his neck, total vampire style.\u003c/p\u003e\n\u003cp\u003eActually, maybe zombie style. That would do more damage. “So, you just said that because you think you’re funny?”\u003c/p\u003e\n\u003cp\u003e“I know I’m funny.”\u003c/p\u003e\n\u003cp\u003eHunter spun around and crossed the distance to the island. He placed a glass of dark wine in front of me.\u003c/p\u003e\n\u003cp\u003eMy skin felt tight. “I don’t know what to even say.”\u003c/p\u003e\n\u003cp\u003eLeaning his elbows on the table, he took a sip of his wine. “I’m sure you have a lot of questions.\u003c/p\u003e\n\u003cp\u003eWe might as well get this out of the way.”\u003c/p\u003e\n\u003cp\u003eGod, he didn’t have to sound so put out over everything, but I bristled silently. Getting into an argument with him wasn’t going to solve anything. It was the same as dealing with students. Sometimes you had to be the bigger person.\u003c/p\u003e\n\u003cp\u003eOr human.\u003c/p\u003e\n\u003cp\u003e“I do have a lot of questions,” I said.\u003c/p\u003e\n\u003cp\u003e“I bet you do,” he murmured, watching me over the rim of his glass.\u003c/p\u003e\n\u003cp\u003e“A lot of dumb ones, too.”\u003c/p\u003e\n\u003cp\u003eA sharp tingle was inching across the back of my skull, spreading like heatstroke.\u003c/p\u003e\n\u003cp\u003e“You’re an ass.” There went being the bigger person.\u003c/p\u003e\n\u003cp\u003e“And you have a potty mouth.” Hunter flashed a quick grin.\u003c/p\u003e\n\u003cp\u003eI took a deep, calming breath as he finished off his wine in one gulp. I hadn’t even touched mine.\u003c/p\u003e\n\u003cp\u003e“Are you going to answer my questions or just insult me?”\u003c/p\u003e\n\u003cp\u003eHunter chuckled.\u003c/p\u003e\n\u003cp\u003e“Possibly a little of both.”\u003c/p\u003e\n\u003cp\u003eMy hands curled into fists.\u003c/p\u003e\n\u003cp\u003eSmirking, he prowled around the island. His movements were graceful and fluid, but it was like he was forcing himself to slow down. My breath stalled out as he sat beside me, spreading his thighs wide so that one brushed my leg.\u003c/p\u003e\n\u003cp\u003eLike lightning, his hand was in my hair, gently wrapping the strands around his fingers. “Your hair is beautiful,”\u003c/p\u003e\n\u003cp\u003ehe murmured. “It’s the color of light.”\u003c/p\u003e\n\u003cp\u003eOkay.\u003c/p\u003e\n\u003cp\u003eNot weird or anything… Sort of fascinated, I watched him straighten my hair out before him. He inspected each strand, twisting it as it caught and reflected the light. An odd look, almost like awe, skittered across his striking features.\u003c/p\u003e\n\u003cp\u003eHis gaze flicked up, meeting mine. He dropped the strand.\u003c/p\u003e\n\u003cp\u003e“Ask a question.”\u003c/p\u003e\n\u003cp\u003eGripping the stool, I scooted away. The metal legs made this horrible scratching sound. “Where am I? And please a little more detail than just the state.”\u003c/p\u003e\n\u003cp\u003eHunter inched his stool toward mine, taking back the distance. Even sitting down, he was a good head or two taller. He leaned in, so that his face was inches from mine.\u003c/p\u003e\n\u003cp\u003eMy throat dried. “You’re in my personal space.”\u003c/p\u003e\n\u003cp\u003e“You’re in my home, therefore that cancels out your personal space.”\u003c/p\u003e\n\u003cp\u003e“Your logic is faulty.”\u003c/p\u003e\n\u003cp\u003eHe cocked his head to the side, lashes lowering.\u003c/p\u003e\n\u003cp\u003e“My logic is the only logic around here. You need to get used to that.”\u003c/p\u003e\n\u003cp\u003eAnd he needed to get used to blunt objects being thrown at his head, because it was about to happen again. “Are you going to answer my question?”\u003c/p\u003e\n\u003cp\u003e“You’re in a small town… outside of Elkins.” He reached over and inched the wineglass toward me with the tips of his fingers.\u003c/p\u003e\n\u003cp\u003e“Drink.”\u003c/p\u003e\n\u003cp\u003eI stared at the wineglass.\u003c/p\u003e\n\u003cp\u003e“Drink, Serena.”\u003c/p\u003e\n\u003cp\u003eMy gaze cut to him. The authority in his tone raised every hackle and it also… I so wasn’t finishing that thought. “Are you always so demanding?”\u003c/p\u003e\n\u003cp\u003e“Very,” he said, sitting back. “Drink.”\u003c/p\u003e\n\u003cp\u003eMuttering just about every foul word I could, I picked up the wine and took a sip—a very small sip. “Happy?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003eI fought the urge to roll my eyes.\u003c/p\u003e\n\u003cp\u003eSeveral moments passed in silence, so I took another drink…and then another.\u003c/p\u003e\n\u003cp\u003eStill no word from Hunter.\u003c/p\u003e\n\u003cp\u003eHe was just sitting there… watching me with heavy hooded eyes. His eyes… they were too pale. Like all the color had been leached from the blue.\u003c/p\u003e\n\u003cp\u003eMy hand shook a little as I put the glass down. “Why am I in West Virginia?”\u003c/p\u003e\n\u003cp\u003e“It’s the last place they will look for you.”\u003c/p\u003e\n\u003cp\u003e“Who? The other…alien you were fighting?” The wine created a nice little pool of warmth in my belly.\u003c/p\u003e\n\u003cp\u003eAt least, that’s what I was hoping was doing it. “The ones who killed Mel?”\u003c/p\u003e\n\u003cp\u003e“And tried to kill you?\u003c/p\u003e\n\u003cp\u003eYes. They won’t look for you here.”\u003c/p\u003e\n\u003cp\u003eMy hands were still shaking.\u003c/p\u003e\n\u003cp\u003e“Why wouldn’t they?”\u003c/p\u003e\n\u003cp\u003eLeaning back, he grabbed a sucker from yet another bowl and unwrapped it. “If you go outside and look to the east, you’ll see a huge mountain. The mountain is stock full of beta quartz.\u003c/p\u003e\n\u003cp\u003eThat’s important.”\u003c/p\u003e\n\u003cp\u003e“It is?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’ll start at the beginning. Do you know anything about the Abell? It’s a galaxy about thirteen billion light-years from here. Where I’m from is even farther from that.\u003c/p\u003e\n\u003cp\u003eSo are the other aliens— the Luxen. If you haven’t realized it, their true form is what you would see as light. Beta quartz has a wonderful ability to block their wavelengths.\u003c/p\u003e\n\u003cp\u003eThe Flatirons are the same way. There will always be communities of Luxen near any large amount of beta quartz, because Arum— that’s what I am—can see wavelengths around any living creature, especially the Luxen. Follow me?”\u003c/p\u003e\n\u003cp\u003eI needed more wine for this shit. “Kind of.”\u003c/p\u003e\n\u003cp\u003e“The Luxen want you dead because you witnessed one of them being very bad. When you told the police and anyone who would listen that this guy lit up like a Christmas tree, the Department of Defense got involved. And yes, the government is well aware of aliens and they have implants everywhere.” He paused.\u003c/p\u003e\n\u003cp\u003e“They took the senator’s son Phillip into custody.\u003c/p\u003e\n\u003cp\u003eThat is never a good thing.\u003c/p\u003e\n\u003cp\u003eThe senator believes that if you’re taken out of the equation, then the exposure threat is removed and his son will be returned to him. There’s also the issue of what your friend overheard, what she could’ve told you.”\u003c/p\u003e\n\u003cp\u003e“She really didn’t tell me anything,”\u003c/p\u003e\n\u003cp\u003eI murmured.\u003c/p\u003e\n\u003cp\u003eGood God, there was an alien senator. “So, he wants to kill me to keep me quiet?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eStealing a peek at him, I saw that he was still staring at me, the sucker in his mouth. I looked away quickly. “And you really work for the Department of Defense? Like an alien liaison?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eI almost laughed, but I didn’t because I was sure I’d never stop. It would be the insanity kind of laughter.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?”\u003c/p\u003e\n\u003cp\u003ehe asked suddenly.\u003c/p\u003e\n\u003cp\u003eI turned to him, frowning.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“How are you feeling?”\u003c/p\u003e\n\u003cp\u003ehe repeated, but he also reached over and placed a single finger on my jaw. He barely touched me, but it was like an electric shock rippled through me. For a brief second, I was reminded of how he felt when he’d pinned me to the bed.\u003c/p\u003e\n\u003cp\u003eHunter’s smirk turned knowing. “Serena?”\u003c/p\u003e\n\u003cp\u003e“I…I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“You have a bruise here and you took a couple of nasty spills.”\u003c/p\u003e\n\u003cp\u003eI hadn’t even noticed the bruise or paid much attention to the aches.\u003c/p\u003e\n\u003cp\u003e“And you basically ate my energy or something?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “That, too.”\u003c/p\u003e\n\u003cp\u003eWell, he definitely had no shame. “It’s—I’m fine.”\u003c/p\u003e\n\u003cp\u003eThere was a pause. “You could’ve died.”\u003c/p\u003e\n\u003cp\u003e“It’s really not important right now.”\u003c/p\u003e\n\u003cp\u003eA second later, I felt his warm breath along my cheek as he spoke. “I know you have more questions.”\u003c/p\u003e\n\u003cp\u003eI turned my cheek away from him, unnerved by how close he was and how he moved without making any noise. Heat crept over my cheeks when two cool fingertips pressed under my chin, and with surprising gentleness, Hunter guided my eyes to his. Our gazes locked.\u003c/p\u003e\n\u003cp\u003eThere was something in those unsettling eyes of his, a gleam of compassion that lurked under the coldness of the unnatural color.\u003c/p\u003e\n\u003cp\u003e“Ask,”\u003c/p\u003e\n\u003cp\u003ehe said, not looking away.\u003c/p\u003e\n\u003cp\u003e“So…you guys put me within spitting distance of a group of aliens that may want to kill me if they find out I’m here?”\u003c/p\u003e\n\u003cp\u003e“They won’t find out.”\u003c/p\u003e\n\u003cp\u003eI started to pull back, but his hand left my chin, curving around the nape of my neck. The grip wasn’t tight, but it was commanding. There was no moving away, no escaping what he wanted.\u003c/p\u003e\n\u003cp\u003eHis skin was cool and the pads of his fingers were rough, as if he used his hands a lot.\u003c/p\u003e\n\u003cp\u003eHunter leaned in again, bringing our mouths within kissing distance.\u003c/p\u003e\n\u003cp\u003eRestlessness unfurled, spreading through my veins, spiking my pulse. I froze.\u003c/p\u003e\n\u003cp\u003e“The senator obviously has a lot of contacts.\u003c/p\u003e\n\u003cp\u003eSomeone in the police department most likely sold you out, but you’re safe from them here.”\u003c/p\u003e\n\u003cp\u003eThose rough fingers slipped back around, trailing down the side of my throat. They stopped over my wildly beating pulse. I sucked in a breath.\u003c/p\u003e\n\u003cp\u003eHunter smiled, but there was no real warmth behind it. Heat, maybe, but it was lacking any sort of emotion.\u003c/p\u003e\n\u003cp\u003eI didn’t know what it was that made every cell in my body stand up and take notice—him touching me, or maybe I just wanted him to remove his hand.\u003c/p\u003e\n\u003cp\u003eHis gaze dropped to my lips and his powerful body coiled tight. The milky blue hue of his eyes churned sudden flecks of dark azure. Tension seeped into the air, heavy like a well- worn blanket. The room cooled as if the air conditioner had kicked on and was cracked high. The room darkened, but over Hunter’s shoulder and beyond the floor-to-ceiling windows, bright light basked the outdoors.\u003c/p\u003e\n\u003cp\u003eTiny goose bumps shot across my skin.\u003c/p\u003e\n\u003cp\u003eEvery instinct kicked into gear and was screaming at me to run—run as fast as I could. This inherent, very human warning system was blaring against the unnaturalness settling over the room.\u003c/p\u003e\n\u003cp\u003eBut I couldn’t look away from his eyes.\u003c/p\u003e\n\u003cp\u003eThere wasn’t warmth in them, but there was a primal heat, and my body responded even as it tried to shy away.\u003c/p\u003e\n\u003cp\u003eThen Hunter removed his hand and sat back, popping the sucker back into his mouth and he waited. The spell was broken. Sucking in several deep gulps of air, I realized I’d held my breath.\u003c/p\u003e\n\u003cp\u003eMy hand fluttered to my throat as I swallowed a few times.\u003c/p\u003e\n\u003cp\u003eThroat dry, I reached for the glass and finished off the rest of the wine. The liquid burned on the way down.\u003c/p\u003e\n\u003cp\u003e“Am I safe from you?” I asked.\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003eI looked at him.\u003c/p\u003e\n\u003cp\u003e“Hunter?”\u003c/p\u003e\n\u003cp\u003e“I’m not going to lie and say I’m not dangerous. I am. In a way, I’ll be more dangerous to you than any Luxen will be,” he said, looking me dead-on. “I’m not the good guy here. I’m not the hero. My job is to keep you alive and I’ll do my best, but I can’t and I won’t make any promises.”\u003c/p\u003e\n\u003cp\u003eWasn’t the most reassuring thing I was looking for, and frankly it made me want to run screaming from the room, but I nodded. He still had that damn sucker in his mouth, twirling it with his fingers. My body reacted in a surprised, fiery rush that I desperately ignored. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-10.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
