{"id":101949,"no":18,"title":"Page 18","content":"\u003cp\u003e“We’re not hatched from an egg, Serena.\u003c/p\u003e\n\u003cp\u003eOur reproduction is much like a human’s. As is the Luxen .\u003c/p\u003e\n\u003cp\u003eBut I didn’t know my parents.”\u003c/p\u003e\n\u003cp\u003eHer brows knitted as she picked up a piece of chicken. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eI pulled her hand away from the skillet. “You’ll burn yourself.”\u003c/p\u003e\n\u003cp\u003eI took the chicken from her and placed it into the skillet.\u003c/p\u003e\n\u003cp\u003eGrease snapped and popped.\u003c/p\u003e\n\u003cp\u003e“I guess you don’t burn?”\u003c/p\u003e\n\u003cp\u003e“Not like you will.” I took another slice from the plate she held.\u003c/p\u003e\n\u003cp\u003e“My parents died when I was young.”\u003c/p\u003e\n\u003cp\u003eHer soft inhale filled the silence and then, “I’m—”\u003c/p\u003e\n\u003cp\u003e“Don’t say you’re sorry, Serena. You didn’t kill my parents. You have nothing to apologize for.”\u003c/p\u003e\n\u003cp\u003eI removed the last slice, plopped it into the oil, and then took the plate from her. “My parents were killed by the Luxen, like many of our kind were.\u003c/p\u003e\n\u003cp\u003eAnd don’t say you’re sorry again.”\u003c/p\u003e\n\u003cp\u003eShe snapped her mouth shut. “What is it with you and apologies?”\u003c/p\u003e\n\u003cp\u003e“I don’t like when people apologize for something they had nothing to do with.”\u003c/p\u003e\n\u003cp\u003e“I get that, but when people say they’re sorry— like for the loss of a loved one—they are saying that they’re sorry for you having to go through that pain.”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I said, and Serena rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“Wash your hands. You’ll get salmonella or something.”\u003c/p\u003e\n\u003cp\u003e“Yes, Dad.” Serena spun toward the sink.\u003c/p\u003e\n\u003cp\u003eMy gaze dropped to her plump ass and I fought the urge to come up behind her, grab her hips, and… Where my thoughts were going meant I’d get nothing accomplished. Maybe I just needed to fuck her out of my system.\u003c/p\u003e\n\u003cp\u003eThat sounded like the best plan ever.\u003c/p\u003e\n\u003cp\u003eSerena looked over her shoulder. “Why did the Luxen kill your parents?”\u003c/p\u003e\n\u003cp\u003eAnd that killed my hard-on. “Like I’ve said before, the Luxen are power-hungry assholes.”\u003c/p\u003e\n\u003cp\u003eShe turned around slowly, gripping the rim of the counter behind her.\u003c/p\u003e\n\u003cp\u003e“That really tells me nothing.”\u003c/p\u003e\n\u003cp\u003eI took a step forward, and her lips parted. I liked that. “You really want a history lesson?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eBut I really wanted to touch her. I took another step, and my gaze traveled over the front of her shirt.\u003c/p\u003e\n\u003cp\u003eThe thin cotton and bra did nothing to hide the hardened tips of her breasts.\u003c/p\u003e\n\u003cp\u003eAw, fuck.\u003c/p\u003e\n\u003cp\u003eChicken needed flipping.\u003c/p\u003e\n\u003cp\u003eSpinning around, I grabbed the tongs and flipped the chicken, ignoring every instinct that demanded I claim her. The true part of me, the darkness that I was, couldn’t understand why I was fighting this. It didn’t care about repercussions or if Serena ended up in a vegetative state.\u003c/p\u003e\n\u003cp\u003eIt just wanted, always wanted.\u003c/p\u003e\n\u003cp\u003eI cleared my throat.\u003c/p\u003e\n\u003cp\u003e“Here’s the quick and dirty version. The Luxen have been around for thousands of years and are obviously far more advanced than the human race. They liked to travel. They also liked to subjugate any other race they came into contact with that was viewed as a threat. They ruled the universe—many galaxies you’ve never heard of.\u003c/p\u003e\n\u003cp\u003eThey became power hungry and destructive.\u003c/p\u003e\n\u003cp\u003eYou know what they say about absolute power.”\u003c/p\u003e\n\u003cp\u003e“It corrupts absolutely.”\u003c/p\u003e\n\u003cp\u003e“Exactly. And for a long time, there was nothing that could defeat them.\u003c/p\u003e\n\u003cp\u003eNothing could stand against them, until my kind came along.”\u003c/p\u003e\n\u003cp\u003e“And how did that happen?” She folded her arms.\u003c/p\u003e\n\u003cp\u003eI flipped another piece of chicken. “Evolution’s way of keeping balance. That’s one thing that is universal.\u003c/p\u003e\n\u003cp\u003eThe Arum were bred to be the only predator of the Luxen. That doesn’t mean we’re always more powerful than them, but we’re the only creatures that can go toe to toe with them. We absorb energy and they are bursting with it.”\u003c/p\u003e\n\u003cp\u003e“So you guys just went after them?”\u003c/p\u003e\n\u003cp\u003eI turned to her, brows raised. “Not at first. For many generations, our kind policed the Luxen, held them back from swallowing up entire planets and destroying every living creature there.”\u003c/p\u003e\n\u003cp\u003e“Kind of like NATO?”\u003c/p\u003e\n\u003cp\u003eI chuckled at that. “I guess it was like that, but it was before my time. But they invaded our planet, enslaved our kind, and killed without discretion.\u003c/p\u003e\n\u003cp\u003eThe attack blindsided us. It was genocide. Who knows what made them do it, but the war started long before I was even a thought, and it’s never ended.”\u003c/p\u003e\n\u003cp\u003eShe tucked her hair back. “What happened to your…to your planets?”\u003c/p\u003e\n\u003cp\u003eI met her stare. “We destroyed our planets.\u003c/p\u003e\n\u003cp\u003eLiterally. So both of our kinds needed a new home.\u003c/p\u003e\n\u003cp\u003eEarth looked mighty welcoming. We don’t need spaceships.”\u003c/p\u003e\n\u003cp\u003eI laughed.\u003c/p\u003e\n\u003cp\u003e“That shit’s bunk. Luxen travel at the speed of light —faster than that. So can we, if we’re…fed.”\u003c/p\u003e\n\u003cp\u003eHer skin paled. “Like when you do the arm thing?”\u003c/p\u003e\n\u003cp\u003e“And that’s what makes us so useful to the DOD.\u003c/p\u003e\n\u003cp\u003eWe kill the Luxen who get out of hand. When one or more of them do something the DOD doesn’t like, we go in and take care of the situation.\u003c/p\u003e\n\u003cp\u003eMost of the Arum find that it’s a great job. After all, there’s real bad blood between us. Others don’t think it’s enough. They continue to hunt the Luxen without DOD permission.”\u003c/p\u003e\n\u003cp\u003e“Wow.” She shook her head. “So you’re basically an assassin?”\u003c/p\u003e\n\u003cp\u003eThere wasn’t any judgment in Serena’s tone.\u003c/p\u003e\n\u003cp\u003e“You could call me that.”\u003c/p\u003e\n\u003cp\u003eShe was quiet for a moment. “What are the different things that you all can do? And the Luxen?”\u003c/p\u003e\n\u003cp\u003e“We can bend space and time, which allows us to travel faster than the speed of light. The Luxen are like us in that aspect.\u003c/p\u003e\n\u003cp\u003eWhat you said you saw the night your friend was killed? Luxen can control energy, manipulate it to move and stop objects.\u003c/p\u003e\n\u003cp\u003eThey can freeze things, people included. They can also use that energy in its purest form as a weapon.”\u003c/p\u003e\n\u003cp\u003e“Holy…”\u003c/p\u003e\n\u003cp\u003e“Yep. We absorb their abilities to manipulate light and energy. They call it the Source. We have to feed a lot to travel, especially as far as it was to Earth.”\u003c/p\u003e\n\u003cp\u003e“How did you end up here?”\u003c/p\u003e\n\u003cp\u003e“Some of us scattered to other parts of the universe, some came here, because both the Luxen and my kind have been to Earth before.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Thousands of times since the dawn of man, I am sure.”\u003c/p\u003e\n\u003cp\u003eHer nose wrinkled. “Then why didn’t they try to enslave us?”\u003c/p\u003e\n\u003cp\u003e“They never viewed humans as a threat, not until now.”\u003c/p\u003e\n\u003cp\u003eHer features pinched. “I don’t know if I should be offended by that or worried.”\u003c/p\u003e\n\u003cp\u003e“Probably a little of both.”\u003c/p\u003e\n\u003cp\u003eFlipping the last chicken breast over, I placed the tongs aside and turned.\u003c/p\u003e\n\u003cp\u003e“The Luxen came here first and were discovered by the government, and then we came. For the longest time, the government couldn’t tell us apart, which worked in our benefit.\u003c/p\u003e\n\u003cp\u003eWhile they were rounding up Luxen, studying them, and then releasing them into controlled communities to assimilate, we pretty much had free rein. But soon they realized we were different species. That in a way we were more dangerous.”\u003c/p\u003e\n\u003cp\u003e“More dangerous?”\u003c/p\u003e\n\u003cp\u003eWhen I didn’t answer, she took a deep breath. “I want to know, no matter how bad it might be.”\u003c/p\u003e\n\u003cp\u003e“There are things that we can do—things that the DOD have a use for. When they discovered we were different from the Luxen, they started searching for us. And when they find us, they give us a choice: work for them or die.”\u003c/p\u003e\n\u003cp\u003e“Geez,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Like the Mafia?”\u003c/p\u003e\n\u003cp\u003e“Something like that.\u003c/p\u003e\n\u003cp\u003eYour government was smart. They have some of the more powerful Arum on their side. How? Who knows. I’m sure they are well provided for. And if we don’t feed, we are weak.\u003c/p\u003e\n\u003cp\u003eMany of us were pulled into the DOD that way.\u003c/p\u003e\n\u003cp\u003eUsed our need against us, to control us. Not to mention they know our weakness.”\u003c/p\u003e\n\u003cp\u003eI paused, watching interest flicker over her face. No way in hell I was going to tell her that the quickest way to take out an Arum was by simply picking up a piece of obsidian and cutting us with it. Bad enough you could find it anywhere and the DOD had already adapted their weapons, encasing bullets in obsidian. Killing an Arum, like a Luxen, wasn’t as hard as one thought if you knew how to take us out.\u003c/p\u003e\n\u003cp\u003e“Not all of the Luxen came to Earth when our planets were destroyed. Tens of thousands are here, but there are hundreds of thousands out there. They will come eventually.”\u003c/p\u003e\n\u003cp\u003e“And?” she asked, her arms loosening and falling to her sides.\u003c/p\u003e\n\u003cp\u003e“And humans will be glad that there are Arum on this planet when that day comes.”\u003c/p\u003e\n\u003cp\u003eHer fingers tapped on her thighs in a nervous gesture. “Holy shit…”\u003c/p\u003e\n\u003cp\u003e“Exactly,” I replied. An odd emotion wiggled inside me. I felt a heaviness in my chest, like a lead ball. I felt…bad for her. This was some heavy shit. “Back to my cooking lesson?”\u003c/p\u003e\n\u003cp\u003eSeveral moments passed, and then Serena appeared at my side. She was still several shades paler than normal. “So what are we doing now?\u003c/p\u003e\n\u003cp\u003eThe chicken looks almost done.”\u003c/p\u003e\n\u003cp\u003e“It is.” I grabbed a pot.\u003c/p\u003e\n\u003cp\u003e“Can you boil water?”\u003c/p\u003e\n\u003cp\u003e“Ha ha.”\u003c/p\u003e\n\u003cp\u003eSerena snatched the pot and padded back to the sink in her bare feet. She was like that a lot, I realized, barefoot.\u003c/p\u003e\n\u003cp\u003eTogether we broke apart the noodles and then made a salad. By the time dinner was ready, the sun was setting, casting the sky in a wash of orange and red.\u003c/p\u003e\n\u003cp\u003eSerena glanced at the table.\u003c/p\u003e\n\u003cp\u003e“Can we eat outside? I mean, it’s nice and—”\u003c/p\u003e\n\u003cp\u003e“We can.” Grabbing a wine bottle and two glasses, I motioned at her.\u003c/p\u003e\n\u003cp\u003e“Lead the way.”\u003c/p\u003e\n\u003cp\u003eSmiling, she picked up our plates and went out on the deck through the sunroom.\u003c/p\u003e\n\u003cp\u003eThe earlier humidity was gone from the slight breeze. “I hate eating at tables,” she said, watching me put the glasses down.\u003c/p\u003e\n\u003cp\u003eI stared at her a moment. “Me, too. Too formal—”\u003c/p\u003e\n\u003cp\u003e“And stiff,” she added, handing my plate over.\u003c/p\u003e\n\u003cp\u003eWe dug into the chicken and pasta in companionable silence.\u003c/p\u003e\n\u003cp\u003eThen slowly Serena wiggled one answer out of me after another. It was a rather remarkable talent, I thought, bemused by it.\u003c/p\u003e\n\u003cp\u003e“What happened when you got here?” she asked, twirling the pasta around her fork.\u003c/p\u003e\n\u003cp\u003e“I hid out with others of my kind.\u003c/p\u003e\n\u003cp\u003eFought and fucked with the Luxen whenever I could. Killed them.”\u003c/p\u003e\n\u003cp\u003eHer fork stilled.\u003c/p\u003e\n\u003cp\u003e“It’s what I am, Serena.\u003c/p\u003e\n\u003cp\u003eIt’s all I’ve ever known.” I shrugged. “We thought we were out of the government’s scope. We knew the Luxen weren’t. I was eventually rounded up in a raid.”\u003c/p\u003e\n\u003cp\u003eShe picked up her wine.\u003c/p\u003e\n\u003cp\u003e“So you worked with them to police the Luxen here?”\u003c/p\u003e\n\u003cp\u003eI laughed. “Fuck no. I escaped.”\u003c/p\u003e\n\u003cp\u003e“I don’t get it. You’re here…”\u003c/p\u003e\n\u003cp\u003eLooking away, my gaze settled on the trees.\u003c/p\u003e\n\u003cp\u003e“That’s not the reason why I’m here.”\u003c/p\u003e\n\u003cp\u003eSerena was quiet for so long that I knew she was thinking of a way to ask why. I glanced over at her and she held my gaze for a moment before returning to her plate. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-18.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
