{"id":101933,"no":2,"title":"Page 2","content":"\u003cp\u003eIt was cooler and darker in the parking garage.\u003c/p\u003e\n\u003cp\u003eMost of the entire back row, where I had to park, was completely in the shadows. Luckily Mel was parked in the first row, near the exit.\u003c/p\u003e\n\u003cp\u003eWe stopped by Mel’s red Audi. As she dug out her car keys, she turned to me. “You think I’m crazy, don’t you?”\u003c/p\u003e\n\u003cp\u003e“No! Of course not,” I answered immediately.\u003c/p\u003e\n\u003cp\u003eDoubt crossed Mel’s face. “Really, because you have that look—like you’re compiling a list of mental disorders I’m suffering from.”\u003c/p\u003e\n\u003cp\u003e“I am so not doing that.”\u003c/p\u003e\n\u003cp\u003eI flashed a quick grin. “I did that earlier.”\u003c/p\u003e\n\u003cp\u003eMel laughed and then quickly hugged me. “Thank you. I mean it. I really don’t want to be alone right now.”\u003c/p\u003e\n\u003cp\u003eI squeezed her back.\u003c/p\u003e\n\u003cp\u003e“It’s all right. Like I’ve said, we’ll figure this out together.”\u003c/p\u003e\n\u003cp\u003eLetting go, Mel opened her car door. “I’ll wait for you.”\u003c/p\u003e\n\u003cp\u003eSending her a reassuring smile, I hurried through the maze of cars as fast as my noisy heels allowed me, anxious to be out of there.\u003c/p\u003e\n\u003cp\u003eI always hated parking garages.\u003c/p\u003e\n\u003cp\u003eThere was nothing creepier.\u003c/p\u003e\n\u003cp\u003eWell, talk of glowing senator’s sons was pretty creepy, too.\u003c/p\u003e\n\u003cp\u003eMy chest tightened. Mel had never looked more… vulnerable than she did this evening. I didn’t know how I could truly help, but no matter what was going on in Mel’s head, I was going to be there for her.\u003c/p\u003e\n\u003cp\u003eJust like Mel had been there for me when my mom had been killed in a botched robbery attempt my freshman year of college. Without Mel, I would’ve had no one, having never been close to my absentee father. We’d supported each other countless times over, from the small stuff to the major crises.\u003c/p\u003e\n\u003cp\u003eThis time would be no different.\u003c/p\u003e\n\u003cp\u003eStopping at the front of my gently used Honda, I fished out my keys. The strap of my purse slipped, jerking my arm, and the keys hit the dirty pavement.\u003c/p\u003e\n\u003cp\u003e“Great,”\u003c/p\u003e\n\u003cp\u003eI muttered, dipping down as far as my pencil skirt would allow.\u003c/p\u003e\n\u003cp\u003eSnatching my keys off the ground, I stood. Movement out of the corner of my eyes drew my attention.\u003c/p\u003e\n\u003cp\u003eMy head swiveled toward it. The parking garage wasn’t huge, so I could make out the form of Mel’s head through the back window of her car.\u003c/p\u003e\n\u003cp\u003eThinking that’s what had caught my attention, I started to turn back, but then a tall male walked out from behind one of the beams near the wide doors lining the opening of the garage.\u003c/p\u003e\n\u003cp\u003eHis purposeful strides carried him into a beam of light.\u003c/p\u003e\n\u003cp\u003eHoly hot guy… I was struck by how good-looking the man was: tall and with sandy-blond hair, he looked like he stepped off the pages of a fashion magazine.\u003c/p\u003e\n\u003cp\u003eThe jeans appeared tailored, cut to fit his long legs.\u003c/p\u003e\n\u003cp\u003eWhere I stood in shadows, I wasn’t worried about being caught checking out the fine specimen of a man. There was no way he could see me, so I looked…and I may’ve drooled a little.\u003c/p\u003e\n\u003cp\u003eOr a lot.\u003c/p\u003e\n\u003cp\u003eI was admiring how the jeans framed his perfect ass when he passed the overhead light and—what in the hell?—vanished. He just vanished! Like he just blinked out of the space or was sucked up into a black hole. He was there one second and gone the next.\u003c/p\u003e\n\u003cp\u003eAlarmed, I took a step forward. A chill snaked down my spine. Was this a dream? Or was Mel’s hallucination contagious, because this was really like what she had said in the bar, but— But then I saw him behind Mel’s car, off to the right. There was absolutely no way he could’ve gotten there without me seeing him. Impossible, but there he was, head cocked to the side.\u003c/p\u003e\n\u003cp\u003eA certain, bone-deep dread settled like stones in my stomach, weighting me to the cement beneath my feet. The keys dangled useless in my hands.\u003c/p\u003e\n\u003cp\u003eSuddenly, I was back in the bar and Mel’s words were replaying over and over in my head.\u003c/p\u003e\n\u003cp\u003eHE’S NOT HUMAN. HE’S not human.\u003c/p\u003e\n\u003cp\u003eShocked and absolutely stupefied, I watched the man raise his arm. At the same time, the driver’s door opened and Mel’s head popped out, as if the man had called out to her, but I hadn’t heard him over the pounding of my heart. I opened my mouth to yell out to Mel, but the air filled with electricity, raising the tiny hairs all over my body.\u003c/p\u003e\n\u003cp\u003eOverhead lights flickered and then in a rapid succession, they blew one after another, showering sparks like raindrops. Each mini explosion was like a gunshot, silencing my shriek as I jumped back, knocking into the hood of my car.\u003c/p\u003e\n\u003cp\u003eDarkness descended, but it only lasted a second.\u003c/p\u003e\n\u003cp\u003eAn unnatural, intense whitish-blue light lit up the front part of the parking garage and— OH GOD —it was coming from the man.\u003c/p\u003e\n\u003cp\u003eLike lightning, it came from within him, radiating from his shoulder and spreading down his arm, twisting and crackling until it reached his palm.\u003c/p\u003e\n\u003cp\u003eMel screamed in the same instant I yelled for her.\u003c/p\u003e\n\u003cp\u003eThe pulse of light shot from his hand, arcing like lightning. It struck the back of her car. My heart stopped. The keys fell from my hands.\u003c/p\u003e\n\u003cp\u003eWhitish-blue light swallowed Mel’s car. For a second, the air stilled and everything went silent.\u003c/p\u003e\n\u003cp\u003eHeat rolled back in violent waves and the light flared, blinding for a second before the explosion rocked through the parking garage.\u003c/p\u003e\n\u003cp\u003eChapter 2\u003c/p\u003e\n\u003cp\u003eThe call came in seconds before I was to board the private jet bound for the backwoods of West Virginia. I almost ignored it, because when the goddamn cell rang, it was always a load of shit I didn’t want to deal with.\u003c/p\u003e\n\u003cp\u003eBut “didn’t want” and “had to” were never in agreement.\u003c/p\u003e\n\u003cp\u003eYanking the damn thing out of the duffel bag, I didn’t look at the caller ID before I answered. Not like it could be a lot of people.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eThere was a pause on the other end, and I could picture the stick-up-his-ass officer displaying his pissy face.\u003c/p\u003e\n\u003cp\u003e“That’s a very impolite way to answer the phone,” Officer Zombro said.\u003c/p\u003e\n\u003cp\u003e“And here’s another impolite thing for you.” I leaned against the wall, eyeing the plane on the tarmac. “I don’t give a fuck.”\u003c/p\u003e\n\u003cp\u003eOfficer Zombro bit out the next words. “I don’t know who you think you’re talking to, but let—”\u003c/p\u003e\n\u003cp\u003e“I know exactly who and what I’m talking to. Get to the point. I have a plane to catch.”\u003c/p\u003e\n\u003cp\u003e“You can say good-bye to your travel plans, because we have a job for you.”\u003c/p\u003e\n\u003cp\u003eMy hand tightened around the cell phone and I heard the fragile plastic groan. Son of a bitch. With great effort, I forced my grip to loosen. I’d lost many of my cells in the past this way.\u003c/p\u003e\n\u003cp\u003eZombro took my silence as submission. “One of the satellites picked up a high- frequency blast of energy over Boulder.”\u003c/p\u003e\n\u003cp\u003eTipping my head back, I closed my eyes. “What does that have to do with me?”\u003c/p\u003e\n\u003cp\u003e“Early evidence is indicating that this was an unsanctioned display of the Source. Since there is a community of Luxen in that area, we will be in need of your assistance.”\u003c/p\u003e\n\u003cp\u003eI opened my eyes slowly.\u003c/p\u003e\n\u003cp\u003eOff in the horizon, the last of the sun dipped over the mountain, casting an orangey glow over the flat, sandstone rocks. Tiny bits of the rock gleamed in the fading light. Fucking beta quartz.\u003c/p\u003e\n\u003cp\u003e“Hunter? Did you hear me?”\u003c/p\u003e\n\u003cp\u003eZombro’s voice grated on my self-control, something I never had a really good handle on in the first place. I kicked off the wall. “Yeah, I hear you.”\u003c/p\u003e\n\u003cp\u003e“You’re the closest one to Boulder. The pilot has been given instructions.\u003c/p\u003e\n\u003cp\u003eGet there and await further contact.”\u003c/p\u003e\n\u003cp\u003eBefore I could say “Fuck off,” Zombro disconnected the call. The little rat bastard liked doing that.\u003c/p\u003e\n\u003cp\u003eBeing the one to end the call gave the fucking twerp some kind of sense of power. Annoying, yes, but seriously laughable.\u003c/p\u003e\n\u003cp\u003eIn Zombro’s wildest dreams, he could never be as ruthlessly strong or deadly as me, and the officer knew it.\u003c/p\u003e\n\u003cp\u003eI shook out my shoulders, but the tension lingered deep in my muscles. Casting a glance back at the hangar, my eyes narrowed in a clear, potent warning.\u003c/p\u003e\n\u003cp\u003eAnother of my kind drifted further into the shadows, backing off so quickly I had to think he was clever and valued his life. Making sure the other wasn’t going to try anything, I didn’t turn my back until I was confident the other remained where it hid.\u003c/p\u003e\n\u003cp\u003eMy hands curled into fists as I itched to shed this skin. I was partial to this human form, but this was one of those moments where I just wanted to be in my true form, free of assholes calling me in because the government had to keep up appearances. As if they really were able to maintain control over the Luxen population. If that were the case, there’d be no need for me.\u003c/p\u003e\n\u003cp\u003eI’d most likely be dead or locked up in a lab somewhere, getting probed—and not in the fun way.\u003c/p\u003e\n\u003cp\u003eInstead, I was this— whatever this was.\u003c/p\u003e\n\u003cp\u003eThis whole new lease- on-life bullshit was getting old quick. Sitting around, behaving, and being the Department of Defense’s bitch was not in my nature.\u003c/p\u003e\n\u003cp\u003eSomehow it was in Lore’s, but my brother had always been a bit…different or touched, depending on how I looked at it.\u003c/p\u003e\n\u003cp\u003eAnd that was how I ended up here, ready to do this job, because Lore had asked me to step away, to get out of the war, and Lore had begged. Our kind never begged. But that plea had come as we stood over the body of our sister.\u003c/p\u003e\n\u003cp\u003eAnd so here I was.\u003c/p\u003e\n\u003cp\u003eThe pilot stuck his head out the loading door, visibly swallowing. Humans were always uncomfortable around our kind. A sixth sense warned them that they were coming as close to death as possible just by being in our presence.\u003c/p\u003e\n\u003cp\u003eCould be worse, I thought, as I grabbed my duffel bag. If I wasn’t going home, at least I was getting to kill a Luxen.\u003c/p\u003e\n\u003cp\u003e… “I’ve told you everything I know—and it sounds crazy, I get that, but it’s not going to change no matter how many times I repeat it.”\u003c/p\u003e\n\u003cp\u003eDetective Jones sat back, readjusting the tie around his thick neck. The man’s jowls had gone from pink to code red since he walked into the room.\u003c/p\u003e\n\u003cp\u003e“Miss Cross, I know you’ve had a traumatic experience —”\u003c/p\u003e\n\u003cp\u003e“I saw my friend get blown up in her car!” My voice caught. I cleared my throat, but my eyes still burned. “So, yes, that was pretty damn traumatic, but it doesn’t change what I saw tonight.”\u003c/p\u003e\n\u003cp\u003e“And this man—what did he look like again?”\u003c/p\u003e\n\u003cp\u003eExhausted, I placed my hands on the deep brown table. “I’ve told you and the officers before you. He was tall—”\u003c/p\u003e\n\u003cp\u003e“How tall, Miss Cross?”\u003c/p\u003e\n\u003cp\u003eDetective Jones leaned forward, his stomach sucking in his belt in the process.\u003c/p\u003e\n\u003cp\u003e“You’re pretty short, so a lot of people may seem tall to you.”\u003c/p\u003e\n\u003cp\u003eWhat the hell? I shook my head, too frustrated to be offended. I gave him a description once more and he scribbled in his little notebook. I was sure he was just doodling. I had been at the police department for over five hours, recounting everything I had seen and heard tonight. Part of me was numb, couldn’t process what had really happened, because Mel… Mel couldn’t be dead. The other part was hyperaware of every creak of the chair when the detective shifted his weight, of the flickering fluorescent lights that reminded me of those horrifying moments in the parking garage, and of every sore muscle and bruised skin that had taken the brunt of my fall.\u003c/p\u003e\n\u003cp\u003eI couldn’t believe I was alive.\u003c/p\u003e\n\u003cp\u003eThe explosion had knocked me flat on my ass and any extra cushioning I had down there hadn’t softened the blow. My ears had rung for a straight two hours and I could still smell the burned scent of twisted metal…and skin. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-2.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
