{"id":101962,"no":33,"title":"Page 33","content":"\u003cp\u003eThen his mouth was on me, suckling deep as one long finger dipped into my body. The combination of being restrained, of being so worked up, was too much.\u003c/p\u003e\n\u003cp\u003eI came right then, breaking apart into a billion pieces as my body spasmed against his mouth. He worked me until I whimpered, coming close to release again. Then he rose, his strange eyes piercing me.\u003c/p\u003e\n\u003cp\u003eWith one hand, he tugged his pants down and kicked them off. Sweet, mindless aftershocks rocked me as he moved up me once more, pinning my arms above my head. I felt his hard, long length against my core.\u003c/p\u003e\n\u003cp\u003eMy hands itched to touch him, but he wasn’t having it. Flicking his tongue over my tightened nipple, he settled between my thighs.\u003c/p\u003e\n\u003cp\u003e“Wait,”\u003c/p\u003e\n\u003cp\u003eI said breathlessly. Hunter lifted his head and his look said seriously?\u003c/p\u003e\n\u003cp\u003eI almost laughed.\u003c/p\u003e\n\u003cp\u003e“What about protection?”\u003c/p\u003e\n\u003cp\u003eA smile quirked his lips.\u003c/p\u003e\n\u003cp\u003e“I can’t get you pregnant and we don’t get diseases.\u003c/p\u003e\n\u003cp\u003eDoesn’t work that way.”\u003c/p\u003e\n\u003cp\u003e“Human. Alien,” I said, letting out a nervous laugh.\u003c/p\u003e\n\u003cp\u003e“I should’ve thought of that.”\u003c/p\u003e\n\u003cp\u003e“I doubt it’s something normally considered.” With his free hand, he traced the line of my jaw and then slid it down between my breasts to the flare of my hip, eliciting a shiver from me.\u003c/p\u003e\n\u003cp\u003e“You’re beautiful.\u003c/p\u003e\n\u003cp\u003eEvery part of you.”\u003c/p\u003e\n\u003cp\u003eI felt that way when he touched me like this. “I want to touch you.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eBut he didn’t let go of my wrists. He held them above my head as my breath froze, then redoubled as I felt him against me, pushing in inch by delicious inch. The initial stretch held a delicious bite.\u003c/p\u003e\n\u003cp\u003eHunter lowered his head, nuzzling my throat.\u003c/p\u003e\n\u003cp\u003e“Goddamn, you feel so good. You kill me, you know? Fucking kill me.”\u003c/p\u003e\n\u003cp\u003eI was sure he was the one doing the killing.\u003c/p\u003e\n\u003cp\u003eTipping my hips up, I took him in fully. My gasp of pleasure was lost in his groan as my back arched clear.\u003c/p\u003e\n\u003cp\u003eHe was a tremendous presence in my body, stretching me until the feeling of sublime fullness curled my toes against the sheets.\u003c/p\u003e\n\u003cp\u003e“Oh God, Hunter…”\u003c/p\u003e\n\u003cp\u003eI yearned to wrap my arms around him, but he held me still. A fine tremor worked its way through him and his grip tightened on my wrists until the bite became almost painful.\u003c/p\u003e\n\u003cp\u003eOpening my eyes, I sucked in air.\u003c/p\u003e\n\u003cp\u003eHis features were sharper, taut, and his eyes were churning brighter flecks of blue. The temp of his skin seemed to drop.\u003c/p\u003e\n\u003cp\u003e“Hunter?”\u003c/p\u003e\n\u003cp\u003eHe stretched his head to the side, and the thick cords of muscle stood out.\u003c/p\u003e\n\u003cp\u003eHis eyes closed, and I could tell he was fighting it; the darker need in him to feed. An eternity passed before his lashes lifted. His eyes were brighter than normal, but his face had lost the sharpness. He began to move, pulling back until just the tip of him pressed in, and then thrusting forward until there wasn’t an inch between us. The friction of each withdrawal and subsequent return built a crazy storm of emotion that quickly turned into a swirling knot of deep tension.\u003c/p\u003e\n\u003cp\u003eHunter maintained that slow, torturous tempo until a fine sheen of sweat broke out over his forehead and bare, hairless chest. I was close, my fingers twisting around empty air as the rhythm increased.\u003c/p\u003e\n\u003cp\u003e“You feel so perfect,” he said, kissing me again as one hand settled on my hip, and I knew at that moment he’d wrangled in the beast.\u003c/p\u003e\n\u003cp\u003eIn response, I wrapped my legs around his waist, seeming to seat him even deeper. Hunter growled low in his throat as I hooked my ankles.\u003c/p\u003e\n\u003cp\u003eHe caught the edge of my lips in a little nip and then growled, “I’m going to fuck you. Hard.”\u003c/p\u003e\n\u003cp\u003eBefore I could point out that he were doing just that, Hunter drove into me over and over again, stopping in between thrusts to grind against me. Each time he did so, the friction licked through me like sweet flames.\u003c/p\u003e\n\u003cp\u003eThen his head dipped, his teeth catching a rosy bud as he drove into me again.\u003c/p\u003e\n\u003cp\u003eThe release shattered through me as I called out his name in a hoarse shout, and I felt him shudder around me, in me, and then he joined me, toppling over the edge in a powerful rush. And I knew that neither of us would be the same again.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eMy heart was still racing minutes later, even when he pulled out of me, causing tiny sparks of ecstasy to ricochet through my body. He let go of my wrists, but I didn’t move my arms. I was nothing more than jelly at that point.\u003c/p\u003e\n\u003cp\u003eClasping the sides of my face gently, he tipped my chin up and kissed me again, a long and deep kiss that was more like staking a claim than anything else. When he rolled off me, I expected him to put space between us, but he brought me along with him, tucking my body against his side.\u003c/p\u003e\n\u003cp\u003eI placed my hand on his cool chest, surprised to feel a heart thudding under it. One of these days I was really going to need to figure out the whole alien/human body thing and how it worked, but right now wasn’t the time for a physiology lesson.\u003c/p\u003e\n\u003cp\u003e“That…that was amazing,” I said, closing my eyes.\u003c/p\u003e\n\u003cp\u003e“I know.” He traced an idle circle over my hip. “It was even better than what I imagined, and I have a pretty ferocious imagination.”\u003c/p\u003e\n\u003cp\u003eI smiled at that. In the back of my head, I had so many questions. What did this mean for us? Did having sex change anything? I still needed to reclaim my life with or without Hunter, but did he want to be a part of that life? Could he? And was the warmth blossoming deep in my chest a signal of something more than post-orgasmic bliss?\u003c/p\u003e\n\u003cp\u003eBut I wasn’t ready to give voice to those questions.\u003c/p\u003e\n\u003cp\u003eI snuggled closer, sliding my leg along his. “There’s something I can’t figure out.”\u003c/p\u003e\n\u003cp\u003e“Just one thing?” The amusement in his tone increased the smile on my face.\u003c/p\u003e\n\u003cp\u003e“Why would the government allow an alien to achieve such power by becoming a senator?” I asked. “Seems like they’re just asking for trouble.”\u003c/p\u003e\n\u003cp\u003eHunter rolled onto his side, facing me. “I think the government believes that they can always control them, that by allowing them to obtain power by human standards, the Luxen will be satisfied.”\u003c/p\u003e\n\u003cp\u003eThe whole Luxen/human/Arum politics fascinated me.\u003c/p\u003e\n\u003cp\u003e“And they’re not?\u003c/p\u003e\n\u003cp\u003eBeing a senator is a pretty powerful gig.”\u003c/p\u003e\n\u003cp\u003e“Being a senator is nothing to a race of aliens that ruled their galaxy for thousands of years.” He reached out, spreading his large hand along my shoulder. “But humans— no offense—still think they’re top of the food chain. Just like the Luxen did when we first came along. It’s their ignorance that has blinded them to what the Luxen are truly capable of.”\u003c/p\u003e\n\u003cp\u003eI shivered, partly due to what he said and partly due to the skimming of his hand down my arm. The back of his knuckles brushed my breasts and I wiggled closer. His sex was hard again or maybe it had never softened. A thick and demanding proud length that jutted between us.\u003c/p\u003e\n\u003cp\u003eOh wow.\u003c/p\u003e\n\u003cp\u003eRefocusing on his face, I flushed when I saw his knowing smirk. “What are the Luxen truly capable of?”\u003c/p\u003e\n\u003cp\u003e“Anything.\u003c/p\u003e\n\u003cp\u003eEverything.”\u003c/p\u003e\n\u003cp\u003eHis hand drifted over my thigh. “If they wanted to take over Earth, they could.”\u003c/p\u003e\n\u003cp\u003e“Would they?” When he tugged me against him, I let out a little gasp. “Would they do that?”\u003c/p\u003e\n\u003cp\u003eHunter gave a lopsided shrug. “I don’t know, but one day the Luxen population will grow. They could outnumber the humans.”\u003c/p\u003e\n\u003cp\u003eHis hand had slid around the curve of my rear, his finger slipping dangerously close. “What about the Arum?”\u003c/p\u003e\n\u003cp\u003e“Do we want to rule Earth?” His other arm, the one I’d been lying on, tightened around me.\u003c/p\u003e\n\u003cp\u003e“Arum care very little to rule an entire species.\u003c/p\u003e\n\u003cp\u003eWe’re much more concerned about things that pleasure us.”\u003c/p\u003e\n\u003cp\u003eMy brows rose at that.\u003c/p\u003e\n\u003cp\u003e“We need to get on the road soon,”\u003c/p\u003e\n\u003cp\u003e“There’s a place I need to go.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“But we have a couple more minutes.”\u003c/p\u003e\n\u003cp\u003eHeat flowed through my body. “For…?”\u003c/p\u003e\n\u003cp\u003eAnother smile tipped his lips, and then he rolled me on top of him in one fluid motion, seating himself in one hard thrust. “This.”\u003c/p\u003e\n\u003cp\u003eArching my back, I placed my hands on his shoulders to steady myself as he grasped my hips.\u003c/p\u003e\n\u003cp\u003eThrough half open eyes, I saw him watch where we were joined as he lifted me up and slid me back down.\u003c/p\u003e\n\u003cp\u003eThen his eyes flicked up, meeting mine. In that moment, the world seemed to stop, as cheesy as that sounded— it was just us. There was nothing else, and I was lost in him.\u003c/p\u003e\n\u003cp\u003e… Sex had never felt like this before. Instead of being all about satisfying an urge and getting off, it became about completion of a different sort. Even in those moments while I held her after the first time, I knew how unalike this was from my previous exploits. And after the second time, I wanted her close…and I wanted her again.\u003c/p\u003e\n\u003cp\u003eHell, I wanted her about a hundred times more.\u003c/p\u003e\n\u003cp\u003eAs I watched her change into a pair of jeans and a plain shirt, I wanted to take her again. From behind.\u003c/p\u003e\n\u003cp\u003eAgainst the wall. On the floor. Wherever.\u003c/p\u003e\n\u003cp\u003eIf I kept thinking like this, we’d never get on the road and I needed to badly. I’d come close to feeding off her earlier. How I didn’t was beyond me, but I wasn’t pushing my luck.\u003c/p\u003e\n\u003cp\u003e“You ready?” I asked, voice coming off a little gruff.\u003c/p\u003e\n\u003cp\u003eShe glanced at me and nodded. “Ready when you are.”\u003c/p\u003e\n\u003cp\u003eIt was late afternoon, but the heat was picking up, promising there’d be a long and hot summer ahead.\u003c/p\u003e\n\u003cp\u003eShe was buckling herself in when I climbed into the Porsche.\u003c/p\u003e\n\u003cp\u003eSitting back, she turned to me. “Where are we going?”\u003c/p\u003e\n\u003cp\u003e“To a place outside of Martinsburg,” I answered, scanning the front of the motel before pulling out.\u003c/p\u003e\n\u003cp\u003e“We’re a couple hours out from there.”\u003c/p\u003e\n\u003cp\u003e“Martinsburg?”\u003c/p\u003e\n\u003cp\u003eShe frowned. “What’s there?”\u003c/p\u003e\n\u003cp\u003e“Someone who can give me what I need.”\u003c/p\u003e\n\u003cp\u003e“Really?” She folded her arms, and a cute expression pinched her face. “Do tell.”\u003c/p\u003e\n\u003cp\u003eI chuckled. “Opal.”\u003c/p\u003e\n\u003cp\u003eConfusion swept across her face. “Opal? Like in the gemstone opal or some old lady named Opal?”\u003c/p\u003e\n\u003cp\u003e“Gemstones have a weird effect on us and the Luxen. Sometimes good.\u003c/p\u003e\n\u003cp\u003eSometimes bad. It has to do with the refracting and absorption of light.”\u003c/p\u003e\n\u003cp\u003eSerena stared at me like I had started speaking in a different language.\u003c/p\u003e\n\u003cp\u003eA smile pulled at my lips.\u003c/p\u003e\n\u003cp\u003e“Obsidian is deadly to the Arum. I carry one, but I have to be careful with it.\u003c/p\u003e\n\u003cp\u003eThe gemstone fractures lights and shadows and it cuts through us like nothing else. One good swipe and that’s all you need.”\u003c/p\u003e\n\u003cp\u003e“And you carry one?”\u003c/p\u003e\n\u003cp\u003eShe looked at me like I was insane. “Does it affect the Luxen the same?”\u003c/p\u003e\n\u003cp\u003e“Nope, but onyx— another type of gemstone —really messes them up.\u003c/p\u003e\n\u003cp\u003eIn large quantities it could probably put them down or make them wish they were dead, but opal is different.”\u003c/p\u003e\n\u003cp\u003eI had to admit; it felt strange talking about these things with a human. “Opal is a whole different story.”\u003c/p\u003e\n\u003cp\u003e“How?” she asked.\u003c/p\u003e\n\u003cp\u003eTaking the exit to the main highway heading east, the tires of the Porsche smoothly ate away the miles as I explained exactly what a piece, even the tiniest, could do.\u003c/p\u003e\n\u003cp\u003e“Opal has the ability to refract and reflect specific wavelengths of light, changing the speed and direction. For the Luxen, it’s like a power booster. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-33.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
