{"id":101974,"no":45,"title":"Page 45","content":"\u003cp\u003e“You assumed right.”\u003c/p\u003e\n\u003cp\u003eHunter sat beside me and leaned forward, dropping his elbows on his knees.\u003c/p\u003e\n\u003cp\u003eLore arched a brow, a mannerism so like Hunter that it made me do a double take. “Did you part on happy terms?”\u003c/p\u003e\n\u003cp\u003e“If leaving two dead officers behind is considered ‘happy’, then yes.”\u003c/p\u003e\n\u003cp\u003eI shot Hunter a look.\u003c/p\u003e\n\u003cp\u003eHe grinned.\u003c/p\u003e\n\u003cp\u003e“Well then…”\u003c/p\u003e\n\u003cp\u003eLore sighed. “What’s going on?”\u003c/p\u003e\n\u003cp\u003eAs Hunter told Lore everything, I settled back against the couch and listened. Even though I lived through all of this, it sounded crazy insane to me, like something from a bad science-fiction movie.\u003c/p\u003e\n\u003cp\u003eWhen he finished, Lore looked floored.\u003c/p\u003e\n\u003cp\u003e“Do you think the Luxen are going to try to carry Project Eagle out?” he asked as he paced. “On a full scale?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” I spoke up. “The senator never mentioned how many were behind it and the DOD… well, they didn’t think Meloverheard anything important. They’ve totally disregarded it.”\u003c/p\u003e\n\u003cp\u003e“Of course,” he said. “No offense, but I’ve found that when it comes to humans and Luxen, the humans tend to foolishly believe that they have the upper hand.”\u003c/p\u003e\n\u003cp\u003e“No offense taken,” I replied, because really, he was right.\u003c/p\u003e\n\u003cp\u003eThe DOD thought they had the Luxen community under their control and could appease them. They were wrong. “There has to be something we can do.”\u003c/p\u003e\n\u003cp\u003e“What?” Hunter asked, turning to me, his eyes narrowed. “There is no one within the DOD that I’d trust enough to relay the information to. Any contact could put you in jeopardy. I refuse to do that.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“He has a point, which is rare.”\u003c/p\u003e\n\u003cp\u003eHunter shot his brother a look. “And besides, there is no proof. The only thing we had was the letter and that was destroyed.\u003c/p\u003e\n\u003cp\u003eIt’s doubtful that the DOD would believe it anyway.”\u003c/p\u003e\n\u003cp\u003e“So we do nothing?\u003c/p\u003e\n\u003cp\u003eThere has to be something! I know humans don’t mean much to you—”\u003c/p\u003e\n\u003cp\u003e“You mean a lot to me.”\u003c/p\u003e\n\u003cp\u003eHunter tilted his head to the side. “So fuck the rest of them.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed on him. “Well, if I mean a lot to you, then you’d understand there are billions of humans on Earth and you wouldn’t say fuck it. If they are serious about Project Eagle, then we need to do something.”\u003c/p\u003e\n\u003cp\u003eHunter was unfazed. “I’m not doing anything that will put you in danger.”\u003c/p\u003e\n\u003cp\u003eFrustrated, I took a deep breath. “I get that you’re trying to protect me.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you do.”\u003c/p\u003e\n\u003cp\u003e“And I appreciate it, really I do.” I held up a hand when Hunter’s mouth opened again. “But we have to do something, even if it’s a risk or even if Project Eagle flies straight into a mountainside and nothing comes from it. We can’t pretend like we don’t know about this.”\u003c/p\u003e\n\u003cp\u003e“Serena—”\u003c/p\u003e\n\u003cp\u003e“Hunter,” I snapped.\u003c/p\u003e\n\u003cp\u003e“All right, lovebirds, as entertaining as it is to watch you two argue, there just might be something that I can do.”\u003c/p\u003e\n\u003cp\u003eBoth of us turned to Lore.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHunter demanded.\u003c/p\u003e\n\u003cp\u003e“I know someone in the DOD that I trust—and don’t look at me like that, Hunter. How do you think I stay off their radar?”\u003c/p\u003e\n\u003cp\u003eHunter leaned back. “Luc owed you and he took care of it.”\u003c/p\u003e\n\u003cp\u003eI frowned. “Why does everything in the world come back to Luc? A fifteen-year-old boy?”\u003c/p\u003e\n\u003cp\u003eLore snickered. “Luc… well, he’s Luc.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m getting that.” I pushed that aside. “What can you do?”\u003c/p\u003e\n\u003cp\u003e“I can let my friend know,” he said. “Can’t promise it will cause the DOD to go on red alert, but it’s something.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t much, but it was a start, and it gave us time to come up with something more substantial.\u003c/p\u003e\n\u003cp\u003eIf Project Eagle happened, all of mankind was at risk.\u003c/p\u003e\n\u003cp\u003e“The only other option is contacting Dex to see if he can dig up anything or get the word out, but that is too risky right now.”\u003c/p\u003e\n\u003cp\u003e“It is. I don’t even know how I’m going to get his car back to him,” Hunter said.\u003c/p\u003e\n\u003cp\u003eLore glanced out the window.\u003c/p\u003e\n\u003cp\u003e“Is that his Porsche?”\u003c/p\u003e\n\u003cp\u003eHunter nodded.\u003c/p\u003e\n\u003cp\u003e“And you drove that baby from West Virginia to Denver and then back here?” He cracked a grin.\u003c/p\u003e\n\u003cp\u003e“He’s going to be so pissed.”\u003c/p\u003e\n\u003cp\u003e“Hey, there isn’t even a scratch on the thing.”\u003c/p\u003e\n\u003cp\u003eHunter paused, and a mischievous spark lit his pale eyes. “Just a couple of thousand extra miles.”\u003c/p\u003e\n\u003cp\u003eLore laughed. “Well, now that’s settled. You two are more than welcome to stay here as long you need to.\u003c/p\u003e\n\u003cp\u003eIt’s safe and more than big enough.”\u003c/p\u003e\n\u003cp\u003e“I was hoping you’d say that.” Hunter flashed one of those rare, beautiful smiles. “It will give us time to figure out where to go from here.”\u003c/p\u003e\n\u003cp\u003eUs. Such a small and simple word, but it was probably the most powerful thing right now. “Us” meant we were in this together, whatever the future may hold.\u003c/p\u003e\n\u003cp\u003eLore gave Hunter and me a tour of the house, basically giving us free rein of the second floor.\u003c/p\u003e\n\u003cp\u003eAfterward, Hunter followed Lore downstairs to scrounge up something for dinner. At the top of the stairs I heard Lore ask, “Have you heard from Sin?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” came Hunter’s reply. “He’s up to the same old let’s-make-war bullshit…”\u003c/p\u003e\n\u003cp\u003eTheir conversation faded as they reached the bottom floor. Turning from the staircase, I quenched the wiggle of unease building in my stomach. I’d worry about their less than friendly, mostly psychotic brother tomorrow.\u003c/p\u003e\n\u003cp\u003eRight now all I cared about was that shower that adjoined our newly acquired bedroom. That baby had multiple showerheads.\u003c/p\u003e\n\u003cp\u003eI headed into the bathroom, a little amazed at the size of the room and the shower stall. What the hell did Lore do to pay for all of this?\u003c/p\u003e\n\u003cp\u003eHell. Did I even want to know?\u003c/p\u003e\n\u003cp\u003eIt took an embarrassing amount of time to figure out how to get all the showerheads working. I stepped back and started to pull my shirt off when I stopped. I turned, finding Hunter leaning against the doorway.\u003c/p\u003e\n\u003cp\u003e“Don’t stop on my account.”\u003c/p\u003e\n\u003cp\u003eI smiled. “I need to put a bell on you.”\u003c/p\u003e\n\u003cp\u003e“That would ruin all the fun.” He swaggered up to me. “But you seemed to know I was here.”\u003c/p\u003e\n\u003cp\u003e“I did. Not sure how, but I did.”\u003c/p\u003e\n\u003cp\u003e“Hmm…” He bent down, capturing my lips in a quick kiss that sent my pulse pounding. “Interesting.”\u003c/p\u003e\n\u003cp\u003eMy eyes drifted shut as his fingertips skated over my cheek, tucking my hair back behind my ear.\u003c/p\u003e\n\u003cp\u003e“We’re really in Georgia, aren’t we?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eI pressed my cheek against his palm. “And your brother is really letting us stay here?”\u003c/p\u003e\n\u003cp\u003e“He is.” Hunter paused.\u003c/p\u003e\n\u003cp\u003e“We’ll find our own place soon. And I know none of this is perfect.\u003c/p\u003e\n\u003cp\u003eYou deserve more than this—a life, a real home, a future.\u003c/p\u003e\n\u003cp\u003eNormal, human shit, and I promise that you will have all of that. I swear to you.”\u003c/p\u003e\n\u003cp\u003eI opened my eyes and blinked back tears that came out of nowhere. In Hunter’s own way, he was a making a promise I knew he would die before he broke. There was so much I wanted to say, but all I could get out was, “I love you.”\u003c/p\u003e\n\u003cp\u003eHunter went incredibly still, and then he was clasping my cheeks. His mouth was on mine again, the kiss deeper and longer.\u003c/p\u003e\n\u003cp\u003eI swayed into him, clutching the front of his shirt as his tongue swept over mine, staking claim on what was already his, only his. He helped me out of my shirt; so gentle that those damn tears became ever harder to hold back.\u003c/p\u003e\n\u003cp\u003e“Again,”\u003c/p\u003e\n\u003cp\u003ehe said, dropping onto his knees in front of me. He unbuttoned my jeans and tugged them down.\u003c/p\u003e\n\u003cp\u003e“I find myself wishing for something I never thought I would.”\u003c/p\u003e\n\u003cp\u003e“What?” I stepped out of my jeans and then watched him rise.\u003c/p\u003e\n\u003cp\u003eHe reached around, unclasping my bra. “I wish I were a Luxen.” Sliding the straps down my arms, he let the material fall to the floor. Then he bent and kissed a sore spot on my shoulder. “I wish I could heal you with my touch.”\u003c/p\u003e\n\u003cp\u003eMoved by the admittance, I placed my hand on his cheek. He kissed my palm and then hooked his fingers under my panties. A second later, they joined the rest of my clothes. I helped him out of his, nowhere near as graceful as him, because every time my fingers brushed his bare skin, I lost a little bit of myself.\u003c/p\u003e\n\u003cp\u003eWe stepped into the steamy stall, under the steady pour of water. I ran my fingers along his smooth jawline. Our eyes met, and my throat tightened with emotion.\u003c/p\u003e\n\u003cp\u003eHe dipped his head as his hand slipped down my throat, between my breasts and further down, over my stomach, stopping just above my core. “I would do anything for you, Serena. You know that , right?”\u003c/p\u003e\n\u003cp\u003eI lifted my head, brushing my lips against his. “I know.”\u003c/p\u003e\n\u003cp\u003eHis hand moved another inch south, and hot, sweet darts of fire sped through my blood as his hand slipped between my thighs.\u003c/p\u003e\n\u003cp\u003eHe kissed me and then pulled back. His tongue slid over my lips, then inside, matching the slow, languid thrust with his fingers.\u003c/p\u003e\n\u003cp\u003eTremors started in my stomach.\u003c/p\u003e\n\u003cp\u003eMuscles quivered. He tormented me until I moved my hips against his hand. A small, keening whimper escaped me as my release came out of nowhere.\u003c/p\u003e\n\u003cp\u003eHunter pulled me to his chest as my body shuddered. Water slicked his skin, muscles taut and rigid from holding back.\u003c/p\u003e\n\u003cp\u003eAnd then he turned me around, placing my palms on the tile wall. He circled an arm around my waist as he used his thigh to separate mine.\u003c/p\u003e\n\u003cp\u003e“I thought I lost you when they showed up at the post office.” His cool breath danced over my cheek.\u003c/p\u003e\n\u003cp\u003eI closed my eyes. “You didn’t. I’m here.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t change the taste of fear.” He cupped my breast with his free hand, running his thumb over my hard nipple. “I’m never going to let you out of my sight now.”\u003c/p\u003e\n\u003cp\u003eMy breath was coming in quick, short bursts. “That’s kind of hard.”\u003c/p\u003e\n\u003cp\u003e“Not impossible, though.”\u003c/p\u003e\n\u003cp\u003eHunter slowly slid into me, inch by inch. Moving so deep that I felt like I’d come apart in a shower of sparks. The steady friction sent my body blazing. Slow and steady strokes soon became not enough. I moved back against him, and his low growl had my blood pressure skyrocketing.\u003c/p\u003e\n\u003cp\u003e“Harder,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eHunter thrust into me, each stroke harder and faster than the one before.\u003c/p\u003e\n\u003cp\u003eEvery rocking movement mounted my pleasure and deepened my cries.\u003c/p\u003e\n\u003cp\u003ePowerless to do more than wiggle against him, I tossed my head back against his shoulder and let him take me. The arm circling my waist was like a band of steel, holding me where he wanted, keeping me in place to receive the long, delicious strokes.\u003c/p\u003e\n\u003cp\u003eAnd when my body started to spasm around him, he caught my chin and forced my head back, claiming my mouth with his as he spent himself.\u003c/p\u003e\n\u003cp\u003eI don’t remember much of the shower after that. I was lost in the heady buzz of pleasure that only sparked alive again when he took his time drying me off afterward. Somehow, we ended in the bed, his large body poised over mine. I was ready for him again, hot and achy. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-45.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
