{"id":101939,"no":8,"title":"Page 8","content":"\u003cp\u003eWhen I’d fed, the Luxen had thought about a TV show he’d watched the night prior, which meant the Lite-Brite was probably a fucking gold mine of information. Too late for that. But with Serena there was silence. Nothing was coming off her except warmth and softness and sunlight. Yeah, that’s it.\u003c/p\u003e\n\u003cp\u003eShe tasted like sunlight.\u003c/p\u003e\n\u003cp\u003eI wrapped an arm around her waist, holding her close as I continued to feed. She had been stiff in my arms, like she had locked up every muscle, but hadn’t tried to fight me off. Not that she could if she tried, and if I hadn’t showed up when I had, the Luxen would’ve easily killed her.\u003c/p\u003e\n\u003cp\u003eHumans were so fragile.\u003c/p\u003e\n\u003cp\u003eSerena let out a breathless sigh against my mouth and then deflated like a paper bag in my arms.\u003c/p\u003e\n\u003cp\u003eThick lashes fanned her pale cheeks. A faint blue shadow had appeared under her eyes, and I knew that if I continued, that hue would spread through her. No doubt it already shaded her lips.\u003c/p\u003e\n\u003cp\u003eIf I continued, I would kill her.\u003c/p\u003e\n\u003cp\u003eStopping would be going against my nature. Arum were killers. And I didn’t hide from what I truly was, even if I was the DOD’s bitch boy. No matter how many leashes they put on me, or any Arum, I would always be what I was— part of a race that had been bred to kill.\u003c/p\u003e\n\u003cp\u003eBut last time I checked, I wasn’t supposed to kill her.\u003c/p\u003e\n\u003cp\u003eWith supreme effort, I lifted my mouth and broke the connection. Her head flopped back so quickly I caught her by the back of the skull before she cracked her neck.\u003c/p\u003e\n\u003cp\u003e“Shit,” I said, staring down at her. She was going to be out for a very, very long time.\u003c/p\u003e\n\u003cp\u003e… Waking up was like climbing through quicksand. Every time I clambered to the top, coming close to opening my eyes, I was dragged back down.\u003c/p\u003e\n\u003cp\u003eMy body refused to get up and move around, and I slipped back into the kind of deep sleep that dreams couldn’t penetrate, until oblivion finally loosened its grip on me.\u003c/p\u003e\n\u003cp\u003eMy eyes felt like they’d been sewed shut and when they finally fluttered open, I immediately winced against the harsh brightness.\u003c/p\u003e\n\u003cp\u003eTurning my head, I swallowed, surprised by how dry my throat was. As my vision adjusted, my heart kicked into overdrive.\u003c/p\u003e\n\u003cp\u003eWhere in the hell was I?\u003c/p\u003e\n\u003cp\u003eI was definitely not in my apartment. Everything in the room was far too nice and pricey. The bureau in the corner, which matched a standing mirror, looked like a priceless heirloom. A chaise lounge against the off-white walls was covered with fluffy pillows.\u003c/p\u003e\n\u003cp\u003eI turned my head, frowning.\u003c/p\u003e\n\u003cp\u003eDelicate white curtains billowed gently in the warm, rolling breeze from an open sliding glass door.\u003c/p\u003e\n\u003cp\u003eI could see potted flowers in an array of colors beyond the door. More evidence I wasn’t where I should be, because I had a thumb of death when it came to plants. It was some kind of raised deck, because it was at level with thick, leafy tree branches.\u003c/p\u003e\n\u003cp\u003eThe chirps of birds were a soft chorus. No sounds of cars. No people yelling or laughing.\u003c/p\u003e\n\u003cp\u003ePushing up, I fought back a wave of dizziness and tugged the covers off —where were the rest of my clothes? I stared down at my bare legs, dumbfounded. My jeans were gone. It was just the old tee shirt and my polka-dotted panties.\u003c/p\u003e\n\u003cp\u003e“What the hell?”\u003c/p\u003e\n\u003cp\u003eI whispered in a hoarse voice.\u003c/p\u003e\n\u003cp\u003eThrowing my legs off the bed, I stood on wobbly knees. NOT GOING TO PANIC.\u003c/p\u003e\n\u003cp\u003eNOT GOING TO PANIC. The last thing I remembered was standing and talking to Hunter after he killed the… alien.\u003c/p\u003e\n\u003cp\u003eHunter was also an alien.\u003c/p\u003e\n\u003cp\u003eAliens were real.\u003c/p\u003e\n\u003cp\u003e“Oh my God.” I pushed the tangled mess of hair out of my face.\u003c/p\u003e\n\u003cp\u003eMy gaze darted around the opulent bedroom. First, I needed to find my pants and then a weapon— possibly a nuclear level weapon.\u003c/p\u003e\n\u003cp\u003eHad Hunter kissed me?\u003c/p\u003e\n\u003cp\u003eNo? Yes. Kind of? My brain needed to shut up, because it wasn’t spewing out anything helpful.\u003c/p\u003e\n\u003cp\u003eSpying two sets of doors, one across from the bed and the other by the chaise lounge, I tried the one across from the bed first.\u003c/p\u003e\n\u003cp\u003eLocked.\u003c/p\u003e\n\u003cp\u003eJesus. A bedroom door that locked from the outside. Nice. I hurried to the other door and discovered a bathroom… that was bigger than my bedroom back in the apartment. Enough room for me to lie down and make bathroom angels in without touching a single thing. It was ridiculous— garden tub and a separate, standing shower with expensive-looking tile.\u003c/p\u003e\n\u003cp\u003eHeart pounding and feeling sick, I quickly shut the bathroom door and backed up, sitting on the edge of the tub. Okay. It was obvious that I’d been taken somewhere, most likely by Hunter. Whatever he had done to me had knocked me out and for God knows how long. Add that to the fact that he was an alien, and I really couldn’t consider myself safe.\u003c/p\u003e\n\u003cp\u003eBut he had saved my life.\u003c/p\u003e\n\u003cp\u003eOr had he?\u003c/p\u003e\n\u003cp\u003eI didn’t understand the why of any of this. Hell, I didn’t even know where I was. Pressing my palms to my forehead, I squeezed my eyes shut. My head pounded along with my pulse. I felt like I’d just come out of a dangerous fever.\u003c/p\u003e\n\u003cp\u003eEverything was surreal, too bright and vastly confusing—but this was real.\u003c/p\u003e\n\u003cp\u003eI had to come up with a plan. I needed to find out where I was, find a phone, find a weapon— FIND MY DAMN JEANS . Lowering my hands, I glanced around the bathroom. There was nothing in here I could fashion into a weapon unless I was James Bond.\u003c/p\u003e\n\u003cp\u003eBut there was a bowl of sour grape Blow Pops on the sink counter. Odd.\u003c/p\u003e\n\u003cp\u003eI stood, dragging in a deep breath. Spotting a linen closet of sorts, I found a wide array of products: soaps, shampoos, lotions, and enough girlie-girl products to survive an apocalypse with.\u003c/p\u003e\n\u003cp\u003e“Okay,”\u003c/p\u003e\n\u003cp\u003eI murmured, rooting through the various bottles.\u003c/p\u003e\n\u003cp\u003eObviously a woman had stayed here before or currently did, one with really good taste, but unless I planned on throwing bath salt in someone’s face, there was nothing of use for me in here.\u003c/p\u003e\n\u003cp\u003eGoing to the sink, I turned on the faucet and splashed water over my face. It cleared some of the fuzziness. Then I opened the bathroom door, stepping back into the bedroom cautiously.\u003c/p\u003e\n\u003cp\u003eI came to a complete standstill as air punched from my lungs.\u003c/p\u003e\n\u003cp\u003eThere was a shadow in front of the deck doors. It wasn’t a normal shadow, either. It sucked the light out of everything around it.\u003c/p\u003e\n\u003cp\u003eMy heart pounded painfully. Instinct took over and a fear so cold, so powerful took root.\u003c/p\u003e\n\u003cp\u003eReaching blindly for a weapon, my fingers wrapped around a small figurine—which turned out to be a cast-iron pioneer— and I threw it hard.\u003c/p\u003e\n\u003cp\u003eThe shadow took form as it darted to the side, but there was a fleshy thud as the statue hit what was now a denim-clad thigh… that belonged to Hunter, a currently shirtless Hunter.\u003c/p\u003e\n\u003cp\u003e“What the fuck?” Hunter exploded.\u003c/p\u003e\n\u003cp\u003eI didn’t wait to offer up an explanation.\u003c/p\u003e\n\u003cp\u003eDarting back toward the bathroom, I opened my mouth to scream. Out of nowhere, a hand smacked down on my mouth and an arm snaked around on my waist. I should’ve known he’d move that fast, should’ve realized that escape wasn’t possible.\u003c/p\u003e\n\u003cp\u003eThe guy was a damn shadow.\u003c/p\u003e\n\u003cp\u003ePanic clawed its way up my throat. Kicking and thrashing, I tried to wiggle free from the powerful hold, but only managed to knock my leg into the dresser.\u003c/p\u003e\n\u003cp\u003e“Oh, for the love of God,”\u003c/p\u003e\n\u003cp\u003eHunter grunted.\u003c/p\u003e\n\u003cp\u003e“Knock it off.”\u003c/p\u003e\n\u003cp\u003eI shoved my elbow back, satisfied when it connected with hard skin.\u003c/p\u003e\n\u003cp\u003eHunter swore again, and the next thing I knew my feet were off the ground.\u003c/p\u003e\n\u003cp\u003eOne moment I was hovering in air, my back pinned to his cool chest, and the next second I was flying.\u003c/p\u003e\n\u003cp\u003eHitting the middle of the bed, I let out a sharp squeak as I bounced. A second later, the weight of a building crashed into me.\u003c/p\u003e\n\u003cp\u003eMy back hit the mattress, knocking the air out once more. The worst sort of terror spread, and I turned more into caged animal than human. I swung wildly with both hands, but he caught my wrists with astonishing and frightening ease, securing them to the bed on either side of my head. Arching my back, I tried to knee him where it counts, but he pressed down, covering my legs with his.\u003c/p\u003e\n\u003cp\u003eI couldn’t move—couldn’t breathe. Hunter weighed a ton, and every part of him that touched me was hard and cool. Heart racing into cardiac territory, I went completely still.\u003c/p\u003e\n\u003cp\u003e“Are you insane?” he growled. “Look at me!”\u003c/p\u003e\n\u003cp\u003eShaking my head frantically, I kept my eyes squeezed shut. “Please don’t—”\u003c/p\u003e\n\u003cp\u003e“Please don’t what?\u003c/p\u003e\n\u003cp\u003eStrangle the ever-loving common sense into you? I might do that.” There was a pause and his chest rose against mine. “Jesus H.\u003c/p\u003e\n\u003cp\u003eChrist, woman, I didn’t sign up for this. I think you gave me a flesh wound.”\u003c/p\u003e\n\u003cp\u003eI pried open one eye, and then both. Those startling pale eyes, full of anger, fixed on mine.\u003c/p\u003e\n\u003cp\u003e“Are you done acting like a psychotic, cracked-out Muppet baby?” he asked, and I could tell by the way his fingers spasmed around my wrists, he really wanted to shake me. “Or do you need a couple more moments to return to sanity? I have all day. And you actually feel kind of good under me, so take your time.”\u003c/p\u003e\n\u003cp\u003eMy eyes popped wide. I was under him, like really under him. Our bodies were touching in all the right areas one wanted them to touch when they were in bed. I shifted just a fraction of an inch, and his eyes narrowed. Something long and thick and hard pressed against my belly.\u003c/p\u003e\n\u003cp\u003eA flush stole across my cheeks and swept down my neck. Alien or not, he was endowed like the small percentage of men who actually had something to brag about.\u003c/p\u003e\n\u003cp\u003eHe smirked and then pulled back a little. The rest of his face came into view, and somehow I had forgotten how good-looking Hunter was in this form. It wasn’t a pretty kind of beauty, like Phillip or the man who attacked me in my apartment. His was a harsher beauty, wild and untamed, a kind of beauty that would be hard to replicate.\u003c/p\u003e\n\u003cp\u003eAnd why was I thinking about how good-looking he was?\u003c/p\u003e\n\u003cp\u003eSeriously not important, but at some point, I realized he wasn’t trying to kill me…and that my heavy breathing had nothing to do with fear at the moment.\u003c/p\u003e\n\u003cp\u003e“Calm now?” he asked.\u003c/p\u003e\n\u003cp\u003e“You’re a—”\u003c/p\u003e\n\u003cp\u003e“If you say alien again, I’m probably going to strangle you a little.\u003c/p\u003e\n\u003cp\u003eOkay?” By the edge in his voice I wasn’t sure if he was joking or not. “We’ve already established what I am. You don’t see me walking around blabbering about you being a human.”\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open.\u003c/p\u003e\n\u003cp\u003e“But that’s different!”\u003c/p\u003e\n\u003cp\u003e“How so?” he proposed.\u003c/p\u003e\n\u003cp\u003e“You’re on Earth!”\u003c/p\u003e\n\u003cp\u003eHe smirked. “Okay. I’ll give you that.”\u003c/p\u003e\n\u003cp\u003eThat infuriated me.\u003c/p\u003e\n\u003cp\u003e“What did you do to me?”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003eMy fingers curled helplessly around air.\u003c/p\u003e\n\u003cp\u003e“When you, like, kissed me?”\u003c/p\u003e\n\u003cp\u003e“I didn’t kiss you,” he scoffed.\u003c/p\u003e\n\u003cp\u003eFor some reason, I thought I should be insulted by the way he said that. “All right, when you put your mouth on mine?\u003c/p\u003e\n\u003cp\u003eIs that clear enough for you?”\u003c/p\u003e\n\u003cp\u003eHunter’s grin tipped higher. “You have a feisty little attitude, don’t you?”\u003c/p\u003e\n\u003cp\u003e“You’re about to get a feisty little foot up your ass,” I spat back.\u003c/p\u003e\n\u003cp\u003eTipping his head back, Hunter did the most mysterious thing.\u003c/p\u003e\n\u003cp\u003eHe laughed. At me. A deep, body-shaking laugh that shook me and made me shiver for what was probably all the wrong reasons.\u003c/p\u003e\n\u003cp\u003eQuieting down, he lowered his chin. “I fed off you.”\u003c/p\u003e\n\u003cp\u003e“You fed off me?”\u003c/p\u003e\n\u003cp\u003e“Yes. I took some of your energy from you— sort of like tapping into your life force,” he said, giving me a cheeky grin that said he didn’t feel bad about it. \u003c/p\u003e","sourceLink":"https://allnovel.net/obsession/page-8.html","bookId":1666,"creation":"Oct 5, 2019 10:10:57 PM","modification":"Oct 5, 2019 10:10:57 PM"}
