{"id":92378,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe was goofing around, but still, it made me think. What fragility did vampires have that they needed girls who could do things like jump-start cars and do pull-ups and swim?\u003c/p\u003e\n\u003cp\u003eThose last two hit me like a bucket of cold pool water on my head, and were reminders I didn’t need at the moment. Thoughtful, I drifted to the outer edge of the walkway, balancing on the rocks that lined it.\u003c/p\u003e\n\u003cp\u003e“Don’t forget . . . do not stray from the path,” Yasuo said, his voice reverberating theatrically. He gave me a teasing nudge.\u003c/p\u003e\n\u003cp\u003eI caught myself before I stumbled onto the grass. I shot him a look, suddenly not in the mood. “Don’t joke around. A girl died today. In the pool.”\u003c/p\u003e\n\u003cp\u003e“Harsh. She dive headfirst into the shallow end?”\u003c/p\u003e\n\u003cp\u003eIt was a bad joke, and apparently Josh agreed. He had a serious look in his eye, his usual ease replaced by some darker concern. “Unacceptable, mate.”\u003c/p\u003e\n\u003cp\u003eHis reaction made me think he might be a little less knuckleheaded than I’d originally assumed.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said, reluctantly agreeing. “This is serious, Yas.”\u003c/p\u003e\n\u003cp\u003e“I get it, Drew. Serious as a heart attack. But if you can’t have a sense of humor about it, well, you might as well give up right now.”\u003c/p\u003e\n\u003cp\u003eI went on, ignoring Yasuo’s trite wisdom. “A girl fell from ropes last week, too. Broke her neck, and I know she didn’t survive that.” I pinned Josh with a look. “Isn’t that right, Mr. Harvard Premed? And then she was taken away, but to where?”\u003c/p\u003e\n\u003cp\u003eI caught Yasuo and Josh exchanging a quick look that I knew I wasn’t meant to see. Did they know something I didn’t? Were they holding something back?\u003c/p\u003e\n\u003cp\u003eI took a calming breath. “Girls have been dying. Not a lot, not yet, but a few have, and yet nobody talks about it. I haven’t even seen any coffins.”\u003c/p\u003e\n\u003cp\u003e“I don’t imagine you would,” Yas said carefully.\u003c/p\u003e\n\u003cp\u003eI leapt on that. “Because the bodies are used for something else?”\u003c/p\u003e\n\u003cp\u003eJosh put his arm around me and leaned down to my level. “Don’t ask questions we can’t answer.” His tone was light, but I sensed something steely underneath.\u003c/p\u003e\n\u003cp\u003eA shiver crawled up my spine. We’d reached my dorm, and not a moment too soon. I spun to leave them. “Fine,” I said coolly. “No more questions. Bye for now.”\u003c/p\u003e\n\u003cp\u003eYas called to me, “Aww, D, don’t do us like that.” He began to improvise words to the tune of “Don’t Do Me Like That.”\u003c/p\u003e\n\u003cp\u003eI stopped and turned around. The two of them seemed so bereft, for a moment looking simply like two bumbling, teenage boys, and I smiled despite myself. “Seriously, it’s okay. I just got upset. But I really do need to go.”\u003c/p\u003e\n\u003cp\u003e“I’d walk you in if I could,” Yasuo said in playful earnest.\u003c/p\u003e\n\u003cp\u003e“Wouldn’t we both?” Josh broke into a grin. “The mysteries of the girls’ dorm. Do you all walk around in little towels, doing each other’s makeup and things?”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Naturally. We sit around in silk nighties, having one big mani-pedi-gossip-makeover fest.”\u003c/p\u003e\n\u003cp\u003eJosh put his hands to heart. “Oh, mate, she made a joke for me.”\u003c/p\u003e\n\u003cp\u003eI didn’t have time to analyze that crack when the heart-faced girl walked by. Her auburn hair caught the sun, looking like molten copper. Yas stared, and the faraway longing in his eyes startled me.\u003c/p\u003e\n\u003cp\u003eJosh elbowed him. “Earth to Yasuo.”\u003c/p\u003e\n\u003cp\u003eYasuo shut his gaping mouth. “Did you find out yet who she is?” he asked me.\u003c/p\u003e\n\u003cp\u003e“Give it up.” I stared at the door where she’d just entered. “She’s the one person on this island who’s lamer than I am. I’m not quite convinced she’s capable of speech.”\u003c/p\u003e\n\u003cp\u003e“Cute, though.” Yasuo waggled his eyebrows. “Cute but mute? Sounds ideal.”\u003c/p\u003e\n\u003cp\u003eI gave him a shove. “Shut up.”\u003c/p\u003e\n\u003cp\u003eJosh ignored our banter, focusing on me. “You’re not lame.”\u003c/p\u003e\n\u003cp\u003eFor a moment, I believed him. But I snapped out of it quickly, wondering again what his ulterior motive might be.\u003c/p\u003e\n\u003cp\u003eI ran a hand through my hair, clearing my mind of the boys’ nonsense. “Okay, guys. Now I really do need to go.” With a quick wave over my shoulder, I walked away.\u003c/p\u003e\n\u003cp\u003eI didn’t want to have to think about free diving or gore or boys named Josh becoming vampires. I didn’t want to stand out or be noticed. I was on overload, and back in the room, all I wanted was to dig out the picture of my mom and stare at her until the world felt right again. Though I feared I’d have to stare a long time for that to ever happen.\u003c/p\u003e\n\u003cp\u003eI rarely risked looking at the photo now, and only when I really needed the strength. I’d just have to imagine my mom’s blond hair, that yellow Kill Bill pantsuit. How would my mother have fared in a place like this? I was still alive, and I had to have inherited my survival instinct from someone.\u003c/p\u003e\n\u003cp\u003eI curled onto my bed, thoughts of my father pushing their way into my head. His violent tendencies were in me, too. His rages and casual brutality were there somewhere, twined into my DNA. And I really hoped he wasn’t the person I had to thank for my success.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINETEEN\u003c/p\u003e\n\u003cp\u003eI stood against the gym wall, scowling for all I was worth. It was time. The next fitness assessment had arrived. I’d been here well over a month now, and this evaluation was shaping up to be as much of a disaster as the first one.\u003c/p\u003e\n\u003cp\u003eFifty-yard dash: laughable.\u003c/p\u003e\n\u003cp\u003eRope climbing: catastrophic.\u003c/p\u003e\n\u003cp\u003eSit-ups: comical.\u003c/p\u003e\n\u003cp\u003eAnd, really, who failed sit-ups? I mean, I’d thought I was doing fine. Until I saw the other girls, arms crossed over their chests, chuff-chuff-chuff ing rhythmic exhales like maniacal little steam engines.\u003c/p\u003e\n\u003cp\u003eI’d made minimal progress in the past weeks. Did girls get kicked out if they weren’t able to climb stuff?\u003c/p\u003e\n\u003cp\u003ePull-ups were next. The blood was making me stronger, but still, I’d yet to get my chin up over that stupid bar. There was a better chance I’d sprout wings and fly than do a pull-up.\u003c/p\u003e\n\u003cp\u003eI glared at Lilac, trotting through every challenge like a freaking show horse on parade. The sight of her made me livid.\u003c/p\u003e\n\u003cp\u003eI wanted to triumph. Needed to. But Lilac stood in my way. How would I advance to the next level with Lilac doing all she could to instigate my downfall?\u003c/p\u003e\n\u003cp\u003eIn my peripheral vision, I saw Ronan approach, though I didn’t need eyes to know he was there. I managed to feel him whenever he was close. Like he was a torch burning hot and bright, and I was a big hairy moth.\u003c/p\u003e\n\u003cp\u003eInhaling, I turned to face him. I was beyond surly, and eager to cut him off before he gave me the talking-to that I sensed was coming. “What, Ronan? I mean . . . Tracer Ronan.”\u003c/p\u003e\n\u003cp\u003e“You must focus, Annelise.” His tone took me by surprise. It wasn’t that of a scolding teacher, but rather the whispered advice of an ally.\u003c/p\u003e\n\u003cp\u003e“Focus? I’m sorry, but I’ve been sucking abysmally at every single one of your circuits, and it has me pretty damned focused, thank you very much.”\u003c/p\u003e\n\u003cp\u003e“Language,” he hissed.\u003c/p\u003e\n\u003cp\u003e“Yeah, okay, doggone focused. That better?” I scowled at him. “And as long as we’re talking etiquette, shouldn’t you be calling me Acari Drew, not Annelise?”\u003c/p\u003e\n\u003cp\u003e“Annelise is your name.”\u003c/p\u003e\n\u003cp\u003eSomething drove me to nitpick him on the point. “The Initiates and Guidons call me Acari Drew. Shouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“It doesn’t suit you as Annelise does,” he said, beginning to look a little flustered.\u003c/p\u003e\n\u003cp\u003eNow I was the flustered one. Why we were even having this conversation? “Whatever. It doesn’t matter. It’s obvious I’ll get kicked out of here soon, anyway.”\u003c/p\u003e\n\u003cp\u003e“Don’t say that.” His voice was gruff in a way that gave me a shiver. His words had come out snarly and decisive and, well, really manly.\u003c/p\u003e\n\u003cp\u003eI couldn’t help but turn back to him. “Why do you care if I fail out of here?”\u003c/p\u003e\n\u003cp\u003e“You won’t fail. Not if you try.” He stepped closer. He smelled like fresh air, like the sea. For some reason, it made me want to needle him even more. Either that or curl myself close so he could wrap me in those muscular arms that were hard to ignore beneath the thin fabric of his athletic shirt. “If you try it, you can do it.”\u003c/p\u003e\n\u003cp\u003eHis voice was stern. A teacher’s voice. Not the voice of anyone who planned on embracing me anytime soon.\u003c/p\u003e\n\u003cp\u003e“No try, only do . . . that right, Yoda?” The words had spilled out of me like acid. It seemed picking fights was all I was good for these days.\u003c/p\u003e\n\u003cp\u003eBut Ronan didn’t take the bait. Instead, his voice got warmer, kinder. “You can do it, Annelise. You can accomplish any challenge set before you. You’re here for a reason. You’re special. You were chosen. For a reason.”\u003c/p\u003e\n\u003cp\u003eHis words made my heart swell. I told myself it was just a pep talk, teacher to student.\u003c/p\u003e\n\u003cp\u003eFor one cynical moment, I wondered if he was using his special voice on me. But he’d told me he’d been unable to use persuasion on me without touching me. And when he had touched me, it’d felt warm and strange. No, I’d know if he was using his powers. He’d said something nice, and it’d reassured me. It was as simple as that.\u003c/p\u003e\n\u003cp\u003e“But you must take it seriously,” he continued. “You can do this. I don’t care why or how. Do it for yourself. Do it to spite your father. Do it for me. For Lilac. But this is serious, Annelise. You must be serious. Failure isn’t tolerated. Failure of any kind.”\u003c/p\u003e\n\u003cp\u003eI thought about the girls who’d died. They’d been doing simple things—in the pool, in the gym. Simple, deadly things.\u003c/p\u003e\n\u003cp\u003eRonan’s advice was grave, like this was life or death. And I believed it might be.\u003c/p\u003e\n\u003cp\u003e“Hey, Charity!”\u003c/p\u003e\n\u003cp\u003eThat piercing pep-squad voice brought me back to earth. A knot of girls was clustered around the bars. Many stood, hands on hips, shifting their weight from foot to foot. Waiting. For me.\u003c/p\u003e\n\u003cp\u003e“Your turn!”\u003c/p\u003e\n\u003cp\u003eRonan knelt to tie a shoe that didn’t need tying. “You can do it,” he whispered. “Not everyone is perfect at everything. Do whatever it takes. But you must succeed.”\u003c/p\u003e\n\u003cp\u003eI strode to the bar. I can do it.\u003c/p\u003e\n\u003cp\u003eI’d never managed a pull-up in my life. \u003c/p\u003e","sourceLink":"https://allnovel.net/isle-of-night-the-watchers-1/page-21.html","bookId":2291,"creation":"Oct 5, 2019 5:55:38 PM","modification":"Oct 5, 2019 5:55:38 PM"}
