{"id":92385,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Wow, cool. Thanks.” Chafing my arms, I went to stand near her. My gaze tracked hers, sweeping the cloudy night sky. I tried to approach the problem scientifically. “This place can’t be longer than four miles from end to end. I think there are some large rock formations in the center of the island, so we’ll need to hike around. Our biggest concern right now is the cold.”\u003c/p\u003e\n\u003cp\u003eEmma stared at me in that blank way of hers. At first I’d found a sort of appealing serenity in her stillness. But now it was just driving me batty.\u003c/p\u003e\n\u003cp\u003e“Jeez, Emma. Aren’t you freaking out?” I began to jog in place. “Why are you shaking your head?”\u003c/p\u003e\n\u003cp\u003e“The biggest concern is fear. Not cold. Fear is what kills.” She began to walk away.\u003c/p\u003e\n\u003cp\u003e“Wait. Where are you going?” I jogged to catch up. It was pitch-black now, and I didn’t want to lose her. If fear was what would kill me, I had a decent head start.\u003c/p\u003e\n\u003cp\u003e“Dealing with first things first,” she replied.\u003c/p\u003e\n\u003cp\u003eEmma found the road we’d come in on, and we backtracked a few hundred yards. I had no idea what she was doing, but she seemed to have a plan, which was more than I could say for myself.\u003c/p\u003e\n\u003cp\u003eShe halted. A dead rabbit lay at our feet.\u003c/p\u003e\n\u003cp\u003eEmma squatted, studying it. The top of its body canted at an unnatural angle from the rest of it. Other than that, it was remarkably blood-free, looking ready to up and hippity-hop away, if not for the whole snapped-spine thing.\u003c/p\u003e\n\u003cp\u003e“That must be what we hit on our way out here,” I said. “Can’t be very auspicious to have—”\u003c/p\u003e\n\u003cp\u003eShe plucked the rabbit up by the ears.\u003c/p\u003e\n\u003cp\u003e“Gah!” I skittered back a few steps. “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“You’re hungry.”\u003c/p\u003e\n\u003cp\u003e“Not that hungry.” I gave her a wary look. “I’ve seen the survival shows. You’re not going to make me consume larvae or urine or anything like that, are you?”\u003c/p\u003e\n\u003cp\u003eShe didn’t laugh or even pretend to answer me. Instead, she said, “This’ll help the chill, too.”\u003c/p\u003e\n\u003cp\u003eI didn’t want to begin to think how Emma might use roadkill to keep me warm.\u003c/p\u003e\n\u003cp\u003eRather than going back to our original starting point, she headed toward a rock face, barely visible near the side of the road. Dropping the rabbit, she reached behind her and pulled a ginormous knife from her waistband.\u003c/p\u003e\n\u003cp\u003e“Jeez! Where’d you get that thing?” It looked like a hunting knife. One of those things with a wooden handle and garishly serrated edges, used by guys with names like Cletus or Bobby Ray.\u003c/p\u003e\n\u003cp\u003e“It was in my drawer.” She patted around the boulder, snapping off small branches from what little shrubbery grew at the base.\u003c/p\u003e\n\u003cp\u003e“So you just carry it with you?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Silly me,” I mumbled. “Every girl should run around with a huge buck knife in her pants.”\u003c/p\u003e\n\u003cp\u003eEmma took one of the branches and began to methodically strip it. “If they gave it, they thought I’d need it.”\u003c/p\u003e\n\u003cp\u003eNow, there was an insight. It was my turn to go silent. Why wasn’t I carrying around my throwing stars? Just because I hadn’t been taught to use them yet didn’t mean they might not come in handy. Maybe I could’ve speared Lilac in the back as she’d walked off.\u003c/p\u003e\n\u003cp\u003eEmma finished with that and took a larger branch. Kneeling in the dirt, she laid it on the ground and began to whittle it flat.\u003c/p\u003e\n\u003cp\u003eIf each Acari had her own talent, I was dying to know what Emma’s was. “Okay, Pocahontas. What’s your skill?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Common sense, I suppose.” Unimpressed by the concept, Emma simply finished her whittling, removed her gloves, and began to dig in the pockets of her parka. “Do you have any lint?”\u003c/p\u003e\n\u003cp\u003eI was beyond questioning anything this girl did. As far as I was concerned, my life was in her hands. I dug in my pockets, scraping my nails along the fleece seams. “Sure, probably.”\u003c/p\u003e\n\u003cp\u003eWhen we’d gathered a quarter-sized wad of the stuff, she unzipped her parka, slid her hand into her tunic pocket, and pulled out a little tube of Vaseline. I recognized it from the basic Dopp kit we’d been issued. She squirted out a gob of it, working it into the lint ball.\u003c/p\u003e\n\u003cp\u003e“Wow,” I said. “I have no idea what you’re doing right now.”\u003c/p\u003e\n\u003cp\u003e“Petroleum jelly.”\u003c/p\u003e\n\u003cp\u003eI saw it wasn’t going to be easy getting information out of her. “Yeah? Vaseline is a petroleum product, and so . . . ?”\u003c/p\u003e\n\u003cp\u003e“Flammable,” Emma said.\u003c/p\u003e\n\u003cp\u003e“Ohhh. Cool.” I knelt beside her. She was going to make a fire. A fire meant light, heat, hot food, dry hair. I rubbed my hands together in anticipation. Emma wasn’t exactly going to be leading any campfire songs, but I sure did like having her on my team.\u003c/p\u003e\n\u003cp\u003eI watched, mesmerized, as she created a small bow out of a stick, using a thin strip of fabric for the bowstring. She wound the bowstring around a thicker stick, stood that on the flat bit of branch she’d whittled, and, holding the bow, began a sawing motion with her hand. The stick twirled furiously, and Emma blew gentle puffs of air at the base of it, encouraging a spark to light the lint and the pile of shrubbery she’d nestled close for kindling. Next thing I knew, smoke tickled my nostrils, and a humble orange flame flickered to life.\u003c/p\u003e\n\u003cp\u003eShe set to work skinning the rabbit, deftly wielding her knife in a way that made me happy we weren’t enemies. As dinner roasted on a spit, she scraped the rabbit skin clean.\u003c/p\u003e\n\u003cp\u003eJust the thought of heat and dinner had calmed my nerves, and neither of us had spoken in a while. Finally, I broke the silence. “So, is this what the kids do for fun in North Dakota?”\u003c/p\u003e\n\u003cp\u003eShe gave me a blank look.\u003c/p\u003e\n\u003cp\u003e“Sorry. Lame attempt at conversation.” Note to self: Emma is long on wilderness, short on humor.\u003c/p\u003e\n\u003cp\u003e“I didn’t know many kids.” She was cleaning the rabbit pelt, and I had a feeling I was looking at what was to be my new hat. “It was just me and my grandfather on a homestead in Slope County.”\u003c/p\u003e\n\u003cp\u003eI thought of my father and instantly assumed Emma and I had had similar experiences. “Did he hurt you?”\u003c/p\u003e\n\u003cp\u003eShe looked baffled for a moment, then exclaimed, “My grandfather? Great Pete, no. Why would you think a thing like that?”\u003c/p\u003e\n\u003cp\u003eThe girl thought nothing of dressing and eating roadkill, and yet she said things like Great Pete. Crazy. “Sorry. I didn’t mean to offend you. I just assumed . . . My dad . . . Well . . . never mind.”\u003c/p\u003e\n\u003cp\u003eThat seemed to be enough of an answer for her.\u003c/p\u003e\n\u003cp\u003eAll the knife wielding aside, she actually struck me as oddly innocent. I wondered how on earth she’d found herself here. I decided there was only one way to find out. “Emma, can I ask—how did you end up here?”\u003c/p\u003e\n\u003cp\u003eThe boulder shielded us from the snow, which had been falling steadily since we’d arrived. Warm, amber firelight danced around us. But Emma just stood and walked away into the darkness.\u003c/p\u003e\n\u003cp\u003eFor a moment, I honestly believed she’d just left me there for good. But she came back, rubbing fistfuls of snow over her hands and forearms, cleaning off the blood.\u003c/p\u003e\n\u003cp\u003eWhen she finished, she drove some sticks into the dirt, making them into little triangles, and then draped the rabbit skin by the fire. She looked at me over the flames, her face an eerily blank slate. We stayed like that for a moment, just staring at each other, taking each other’s measure. Finally, she answered my question.\u003c/p\u003e\n\u003cp\u003e“My grandfather died. Round about Thanksgiving. I ran the homestead by myself for a while. Then some men came. They tried things.” She shrugged. “I protected myself. But the township saw it different. They locked me up; said I was only sixteen and needed to be put in a home. But then someone came for me. He told them he was a lawyer. But he wasn’t. He told me about this place. And I came.”\u003c/p\u003e\n\u003cp\u003eI stared, dumbfounded. In some ways, the girl before me was as new and pure as the snow falling around us, and yet she’d already lived a lifetime in just sixteen years.\u003c/p\u003e\n\u003cp\u003eEmma removed the spit from the fire. She’d impaled the creature with a stick, and it looked like a dark, glistening bunnysicle. “Rabbit’s done.”\u003c/p\u003e\n\u003cp\u003eI gave her a broad smile, reaching my hand out for a leg. I’d never tasted anything so good in my life.\u003c/p\u003e\n\u003cp\u003eWe were just finishing up when we heard the rustling. We froze, our eyes meeting over the fire. There was another sound—guttural and hissing, like a growl from the back of a human throat.\u003c/p\u003e\n\u003cp\u003eThen we saw the eyes. They glowed red and rabid, lacking the ancient stillness of Vampire. Instead, this thing emanated chaos, fury. Hunger.\u003c/p\u003e\n\u003cp\u003eAnd it was looking right at us.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eIt leapt at us from the darkness, its feral growl ripping through the snowfall’s heavy silence. A hideous thing in the shape of a person, though whatever humanity it once knew was long gone. It saw the fire and flinched back a step, standing and panting.\u003c/p\u003e\n\u003cp\u003eParalyzed by pure terror, I could only stare.\u003c/p\u003e\n\u003cp\u003eIts skin was crackled and black with decay, looking like thin parchment wrapped around a webbing of pure, lean muscle. Tufts of hair clung to its bald and peeling scalp. Red eyes stared at us, glowing from dark sockets.\u003c/p\u003e\n\u003cp\u003eThe thing pulled back its lips. It had only a few teeth, all rotted. Except for the fangs. Two shining, perfect fangs. They looked long. And sharp.\u003c/p\u003e\n\u003cp\u003eEmma and I rose slowly, edging close enough to stand shoulder to shoulder. It began to circle us, keeping a wary distance from the fire. Emma slid the knife from her waistband, her progress so careful and deliberate, I barely even realized she was moving.\u003c/p\u003e\n\u003cp\u003eGod, I loved that girl.\u003c/p\u003e\n\u003cp\u003eI’d mistakenly believed the creature was plodding. Or had seen the fire and was cautious. I should’ve known never to underestimate anything I encountered on this isle.\u003c/p\u003e\n\u003cp\u003eWith a tearing shriek, the thing flew at us. At me.\u003c/p\u003e\n\u003cp\u003eI didn’t have time to think. It grabbed my arms, and pain ripped through my body. Its nails sliced easily through my coat, piercing deep into my skin. They felt like talons that’d been sharpened to hard points.\u003c/p\u003e\n\u003cp\u003eI was screaming senseless things. Random words . . . no, what, off, go, no.\u003c/p\u003e\n\u003cp\u003eAdrenaline dumped into my veins. Its attack slowed, and I became aware of everything. The crackling sound of its skin as it opened its mouth, the rancid stench of its breath, the gleam of firelight on shining fangs. The warmth of my own blood seeping down my arms. \u003c/p\u003e","sourceLink":"https://allnovel.net/isle-of-night-the-watchers-1/page-28.html","bookId":2291,"creation":"Oct 5, 2019 5:55:38 PM","modification":"Oct 5, 2019 5:55:38 PM"}
