{"id":110108,"no":26,"title":"Page 26","content":"\u003cp\u003eTHE BAD THING ABOUT PORTALS IS THAT THERE\u0027S NO WAY TO PREPARE yourself for what\u0027s at the other end. In this sense a train is ideal. You go into your compartment, change your trousers for track-suit bottoms and your shoes for rubber sandals, take out your food and drink, and get to know your traveling companions¡ª if you happen to be traveling on your own, that is. The wheels drum on the rails, the platform slips away. And that\u0027s it, you\u0027re on your way. You\u0027re a different person. You share your most intimate experiences with strangers, you argue about politics, although you swore you never would again, you drink the dubious vodka bought at one of the stops. You\u0027re neither here nor there. You\u0027re on your way. You\u0027re on your own little quest, and there\u0027s a bit of Frodo Baggins in you, and a bit of Verne\u0027s Paganel, and just a tiny drop of Robinson Crusoe, and a smidgeon of Radishchev. Maybe your journey will only last a few hours, or maybe a few days. It\u0027s a big country slipping past the windows of your compartment. You\u0027re not there. You\u0027re not here. You\u0027re a traveler.\u003c/p\u003e\n\u003cp\u003eA plane is a bit different. But you still prepare yourself for the journey. You buy a ticket, you wake up at first light, get into a taxi and drive to the airport. The wheels measure out the miles, but you\u0027re already looking up at the sky; in your mind you\u0027re already there, in the plane. The nervous hassle of the airport lounge, instant coffee in the buffet, the baggage check, the security check and¡ªif you\u0027re leaving the country¡ª the customs and the duty-free shop, all the small joys of travel before the narrow seats in the plane, the roar of the turbines and the optimistic gabble of the air hostess: \"The emergency exits are located...\" And then the ground has already fallen away, the seatbelt signs have been switched off, the smokers have snuck off guiltily to the restrooms and the hostesses have considerately ignored them, the meal in the plastic tray is handed out¡ªfor some reason on planes everyone stuffs themselves. It\u0027s not exactly a journey. It\u0027s a relocation. But you still see the cities and rivers drifting past and leaf through a guidebook or check the bookings for your business trip, wondering about the best way to handle the business negotiations, or the best way to enjoy a ten-day tourist trip to hospitable Turkey-Spain-Croatia. And you\u0027re on your way.\u003c/p\u003e\n\u003cp\u003eBut a portal is a shock. A portal is a sudden change of scenery, a revolving stage in a theater. You\u0027re here, then you\u0027re there. No journey.\u003c/p\u003e\n\u003cp\u003eAnd no time to think about anything either.\u003c/p\u003e\n\u003cp\u003e... I tumbled out of the portal. One foot struck a tiled floor, the other went straight into a toilet bowl.\u003c/p\u003e\n\u003cp\u003eAt least it was a perfectly clean toilet bowl. Like in a respectable American film, where the characters waste each other in the John. But anyway, I pulled my foot back out, wincing in pain as I did so.\u003c/p\u003e\n\u003cp\u003eA tiny cubicle with a little lamp and a grille on the ceiling and a roll of toilet tissue on a holder. A fine portal this was! Somehow I\u0027d been expecting Kostya to run it straight to the launch pad, close to the foot of the rocket.\u003c/p\u003e\n\u003cp\u003eI opened the door, still wincing in pain, and peeped out cautiously through the crack. The restroom seemed to be empty. Not a sound, apart from a tap running in one of the washbasins...\u003c/p\u003e\n\u003cp\u003eJust then I was struck hard in the back and thrown out of the cubicle, pushing the door open with my head leading the way. I rolled over onto my back and flung my hand up, ready to strike.\u003c/p\u003e\n\u003cp\u003eLas was standing in the cubicle with his arms out to the sides, holding onto the walls, and gazing around with a crazy expression on his face.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" I growled. \"Why did you follow me?\"\u003c/p\u003e\n\u003cp\u003e\"You told me to follow you,\" said Las, offended. \"Big-shot magician!\"\u003c/p\u003e\n\u003cp\u003eI got up. It was stupid to argue.\u003c/p\u003e\n\u003cp\u003e\"I need to stop a crazed vampire,\" I said. \"The most powerful magician in the world at the present time. It\u0027s... it\u0027s going to get really hot around here pretty soon...\"\u003c/p\u003e\n\u003cp\u003e\"Are we at Baikonur then?\" Las asked, not frightened in the least. \"Now that\u0027s what I call magic¡ªthat\u0027s great! But did we really have to teleport through the drains?\"\u003c/p\u003e\n\u003cp\u003eI just waved one hand at him despairingly. Then I focused intently on what I could hear inside me. Yes, Gesar was somewhere close by, and Zabulon... and Svetlana... and hundreds, thousands of Others. They were waiting.\u003c/p\u003e\n\u003cp\u003eThey were counting on me.\u003c/p\u003e\n\u003cp\u003e\"How can I help?\" Las asked. \"Maybe I could look for some aspen stakes? By the way, they make matches out of genuine aspen, did you know that? I always wondered why it had to be aspen¡ª does it really burn better than anything else? But now I realize it\u0027s for fighting vampires. Sharpen a dozen matches...\"\u003c/p\u003e\n\u003cp\u003eI looked at Las.\u003c/p\u003e\n\u003cp\u003eHe spread his arms apologetically. \"All right, all right... I\u0027m only trying to be helpful.\"\u003c/p\u003e\n\u003cp\u003eI walked across to the door of the restroom and glanced out. A long corridor, daylight lamps, no windows. At the end of the corridor a man in uniform with a pistol on his belt. A guard? Yes, there had to be security guards here. Even these days.\u003c/p\u003e\n\u003cp\u003eOnly why was the guard frozen in such a stiff, awkward pose?\u003c/p\u003e\n\u003cp\u003eI went out into the corridor and moved toward the soldier. I called quietly: \"Excuse me, do you mind if I ask you something?\"\u003c/p\u003e\n\u003cp\u003eThe guard didn\u0027t mind. He was staring into space¡ªand smiling. A young man, not even thirty yet. Absolutely rigid. And very pale.\u003c/p\u003e\n\u003cp\u003eI pressed my fingers against his carotid artery¡ªI could just barely feel the pulse. The bite marks were almost invisible. There were just a few small drops of blood on the collar. Yes, Kostya must have been very tired after that exit he\u0027d made. He\u0027d been in need of refreshment, and there hadn\u0027t been any cats around...\u003c/p\u003e\n\u003cp\u003eBut if the soldier was still alive, there was a chance he would make it.\u003c/p\u003e\n\u003cp\u003eI took his pistol out of the holster¡ªit looked like he must have been reaching for it when the vampire\u0027s command made him freeze¡ªand carefully laid him out on the floor. Let him rest. Then I turned around.\u003c/p\u003e\n\u003cp\u003eOf course, Las had followed me. And now he was gazing at the motionless soldier.\u003c/p\u003e\n\u003cp\u003e\"Can you use a gun?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll give it a try.\"\u003c/p\u003e\n\u003cp\u003e\"If you have to, aim for the head and the heart. If you hit him, it might just slow him down.\"\u003c/p\u003e\n\u003cp\u003eNaturally, I was under no illusions. Even if Las emptied the entire clip into Kostya, which was already a dubious proposition, the bullets wouldn\u0027t stop a Higher Vampire. But at least it gave Las something to do.\u003c/p\u003e\n\u003cp\u003eI just hoped he wouldn\u0027t get the jitters and shoot me in the back.\u003c/p\u003e\n\u003cp\u003eFinding Kostya wasn\u0027t hard, even without using magic. We came across another three men¡ªa guard and two civilians¡ª who were in a trance and had been bitten. Kostya must have been moving in that vampire style when all movements become too fast for the eye to follow and the process of feeding takes no more than ten seconds.\u003c/p\u003e\n\u003cp\u003e\"Will they become vampires now?\" Las asked me.\u003c/p\u003e\n\u003cp\u003e\"Only if he wanted them to. And only if they agreed.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think there was any choice about that.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s always a choice,\" I said, opening yet another door.\u003c/p\u003e\n\u003cp\u003eAnd I realized we\u0027d arrived.\u003c/p\u003e\n\u003cp\u003eIt was a spacious, brightly lit hall, full of people. At least twenty men. The cosmonauts were here: our captain, the American, and the space tourist¡ªa German chocolate manufacturer.\u003c/p\u003e\n\u003cp\u003eNaturally, they were all in a state of blissful trance. Apart, that is, from two technicians in white coats, whose eyes were vacant, but whose hands were moving with their customary skill as they helped Kostya put on a spacesuit. It wasn\u0027t an easy job¡ª flight suits are made to fit the figure, and Kostya was a bit taller than the German.\u003c/p\u003e\n\u003cp\u003eThe unfortunate tourist, stripped naked¡ªKostya hadn\u0027t even shrunk from putting on his underwear¡ªwas sitting at one side, sucking on his index finger.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve only got two or three minutes,\" Kostya said cheerfully. \"So don\u0027t delay me, Anton. Try to get in my way and I\u0027ll kill you.\"\u003c/p\u003e\n\u003cp\u003eNaturally, my appearance was no surprise to him.\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t let the rocket take off,\" I said. \"What are you expecting? The Higher Ones know what you\u0027re planning.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll let it go, they have no choice,\" Kostya replied calmly. \"The air defense cover here is pretty good, you can take my word for it. And the cosmodrome\u0027s head of security has just given all the necessary instructions. Are you trying to tell me they\u0027ll launch a massive ballistic missile strike?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re bluffing,\" Kostya replied coolly. \"A strike by the Chinese or the Americans is out of the question. That would start a world war. Our rockets aren\u0027t targeted on Baikonur. They won\u0027t let planes with tactical warheads get close. You\u0027ve no way out. Lie back, relax, and enjoy.\"\u003c/p\u003e\n\u003cp\u003eMaybe he was right.\u003c/p\u003e\n\u003cp\u003eOr maybe the Great Ones did have a plan to incinerate Baikonur with a nuclear strike and not start a world war.\u003c/p\u003e\n\u003cp\u003eThat wasn\u0027t important.\u003c/p\u003e\n\u003cp\u003eThe important thing was that Kostya had made up his own mind that he wouldn\u0027t be stopped. That now they would take him out and put him in the rocket... and what then?\u003c/p\u003e\n\u003cp\u003eWhat would he be able to do, sitting in a metal barrel, when the portals of a dozen Higher Magicians opened on the launch pad? When they instantly purged the brains of the head of security and those who had to press the \"start\" button and they zapped him with a portable missile with a nuclear warhead or activated some secret satellite with an X-ray laser?\u003c/p\u003e\n\u003cp\u003eHe wouldn\u0027t be able to do a thing.\u003c/p\u003e\n\u003cp\u003eA space ship isn\u0027t an automobile¡ªyou can\u0027t just steal it and drive it away. A space launch is a coordinated effort by a thousand people, and at every stage all it needs is for one little button to be pressed to make sure that the ship never reaches orbit.\u003c/p\u003e\n\u003cp\u003eAnd even if Kostya were a stupid fool, he was still a Higher One now¡ªhe ought to read the reality lines and foresee what would happen and realize that he\u0027d be stopped.\u003c/p\u003e\n\u003cp\u003eThat meant...\u003c/p\u003e\n\u003cp\u003eThat meant all of it¡ªthe cosmodrome, the rocket, the people whose minds he\u0027d taken over or put to sleep¡ªall of it was a bluff. Saratov airport all over again.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t need any rocket. Just as he hadn\u0027t needed any plane.\u003c/p\u003e\n\u003cp\u003eHe was going to open a portal straight into space.\u003c/p\u003e\n\u003cp\u003eThen why had he come dashing to Baikonur? For the space-suit? Nonsense. Zvyozdny would have been much nearer, and somehow or other he could have found a functional spacesuit the right size there.\u003c/p\u003e\n\u003cp\u003eSo it wasn\u0027t just for the spacesuit...\u003c/p\u003e\n\u003cp\u003e\"I need to read the incantations,\" Kostya said. \"To smear the blood on the page. You can\u0027t do that in a vacuum.\"\u003c/p\u003e\n\u003cp\u003eHe got up and pushed the technicians aside. They obediently stood to attention.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to open a portal to the station. And for that I need to know its precise position. And even so, mistakes are possible... maybe even inevitable.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t sense him reading my thoughts, but he was.\u003c/p\u003e\n\u003cp\u003e\"You got everything right, Anton. I\u0027m ready to depart for the station any second. Before all of you can do anything about it. And even if Gesar and Zabulon turn themselves inside out, you won\u0027t have enough Power. I\u0027m as powerful as it\u0027s possible to be¡ªdo you understand? I have achieved absolute Power! There is nowhere higher to go! Gesar dreamed that your daughter would be the first enchantress to do that...\" Kostya laughed. \"But look¡ªI\u0027m the first!\"\u003c/p\u003e\n\u003cp\u003e\"Enchantress?\" I asked, allowing myself a smile.\u003c/p\u003e\n\u003cp\u003e\"Absolute magician,\" Kostya snapped. \"And that\u0027s why you can\u0027t beat me. You can\u0027t gather enough Power¡ªdo you understand? I am absolute!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re an absolute zero,\" I said. \"You\u0027re an absolute vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Vampire, magician... what\u0027s the difference? I\u0027m an absolute Other.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, there is no difference. We all live off human Power. And you\u0027re not the most Powerful of all¡ªyou\u0027re the weakest. You\u0027re an absolute vacuum, sucking in Power that isn\u0027t yours.\"\u003c/p\u003e\n\u003cp\u003e\"So be it.\" Kostya wasn\u0027t going to argue. \"That doesn\u0027t change a thing, Anton. You can\u0027t stop me, and I\u0027m going to carry my plan through.\"\u003c/p\u003e\n\u003cp\u003eHe paused for a second, then said, \"But you still won\u0027t join me... What\u0027s going on in your head?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer. I drew in Power.\u003c/p\u003e\n\u003cp\u003eFrom Gesar and Zabulon, from Dark Ones and Light Ones, from the good and the evil. Somewhere far away those I loved and those I hated were all giving me their Power. And right then it made no difference to me if that Power was Light or Dark. We were all in the same boat now¡ªin the same small boat out in space, adrift in the absolute void...\u003c/p\u003e\n\u003cp\u003e\"Go on, strike,\" Kostya said contemptuously. \"You won\u0027t take me by surprise again.\"\u003c/p\u003e\n\u003cp\u003e\"Strike,\" Gesar whispered. \"Strike with the White Mist.\"\u003c/p\u003e\n\u003cp\u003eThe knowledge of what the White Mist was came creeping into me together with the Light Power. The knowledge was terrible, frightening¡ªbecause even Gesar himself had only ever used that spell once, and afterward he\u0027d sworn never to use it again...\u003c/p\u003e\n\u003cp\u003e\"Strike,\" Zabulon advised me. \"Better use Shades of the Rulers.\"\u003c/p\u003e\n\u003cp\u003eThe knowledge of what Shade of the Rulers was slid into me together with the Dark Power. The knowledge was disgusting and horrifying, because not even Zabulon had ever dared raise those shades from the fifth level of the Twilight...\u003c/p\u003e\n\u003cp\u003e\"Strike,\" said Edgar. \"Use the Sarcophagus of the Ages. Only the Sarcophagus of the Ages!\"\u003c/p\u003e\n\u003cp\u003eThe knowledge of what the Sarcophagus of the Ages was flooded into me with the Power of the Inquisitors. The knowledge was spine-chilling¡ªbecause the one who used the spell remained in the sarcophagus with his victim forever, until the universe came to an end.\u003c/p\u003e\n\u003cp\u003e\"What if I put a hole in his spacesuit?\" asked Las, standing in the doorway with his pistol.\u003c/p\u003e\n\u003cp\u003eAn absolute Other.\u003c/p\u003e\n\u003cp\u003eAn absolute zero.\u003c/p\u003e\n\u003cp\u003eThe most powerful of all, the weakest of all...\u003c/p\u003e\n\u003cp\u003eI gathered together all the Power I had been given and put it into a seventh-level spell¡ªone of the very simplest, one every Other can manage.\u003c/p\u003e\n\u003cp\u003eThe Magician\u0027s Shield.\u003c/p\u003e\n\u003cp\u003eSo much Power had probably never been wasted so senselessly.\u003c/p\u003e\n\u003cp\u003eAnd now probably not a single magician in the world was so reliably protected.\u003c/p\u003e\n\u003cp\u003eAgainst everything.\u003c/p\u003e\n\u003cp\u003eA white reticulated cocoon appeared around me. The threads of the cocoon crackled with the energy streaming through them. It was rooted way down in the deepest depths of the universe,\u003c/p\u003e\n\u003cp\u003ebeyond the countless levels of the Twilight, where there is no matter, or space, or time¡ªnothing that a human being or Other can comprehend.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" Kostya asked, with an expression of childish resentment on his face. \"What are you doing, Anton?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer. Just stood there, looking at him. I didn\u0027t want even the shadow of a thought to show on my face. I wanted him to think whatever he wanted to think.\u003c/p\u003e\n\u003cp\u003eLet him.\u003c/p\u003e\n\u003cp\u003e\"Are you frightened?\" Kostya asked. \"You... why you... you\u0027re a coward, Anton!\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eAnd the Higher Ones were silent too. No, probably they weren\u0027t. They were shouting, swearing, cursing me¡ªbecause I\u0027d squandered all the Power they\u0027d collected on absolute protection for myself.\u003c/p\u003e\n\u003cp\u003eIf they hit Baikonur with a thermonuclear warhead now I\u0027d be left safe and unharmed. Floating in a cloud of plasma, encased in boiling stone¡ªbut absolutely safe.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t even know what to say...\" Kostya shrugged. \"And I wasn\u0027t going to kill you anyway. I haven\u0027t forgotten that you were my friend.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eForgive me, but I can\u0027t call you my friend any more. And that\u0027s why you must not realize what I have realized. You must not read my thoughts.\u003c/p\u003e\n\u003cp\u003e\"Goodbye Anton,\" Kostya said.\u003c/p\u003e\n\u003cp\u003eThe technicians came over to him and lowered the glass shield of his helmet. He cast a final glance at me through the glass¡ªa glance of incomprehension and resentment. And turned away.\u003c/p\u003e\n\u003cp\u003eI was expecting him to open the portal into space there and then. But Kostya had made his preparations for the leap thoroughly. What would I know¡ªI\u0027d never even heard of anyone attempting to transport themselves on board an airplane in flight, let alone a space station in orbit.\u003c/p\u003e\n\u003cp\u003eAbandoning the cosmonauts and the personnel in their state of trance, Kostya walked out of the hall. Las moved aside and squinted at me, holding up the pistol.\u003c/p\u003e\n\u003cp\u003eI shook my head, and he didn\u0027t shoot.\u003c/p\u003e\n\u003cp\u003eWe simply followed him.\u003c/p\u003e\n\u003cp\u003eInto the space flight control hall, where the technicians and programmers were all sitting at their computers like sleep walkers.\u003c/p\u003e\n\u003cp\u003eWhen had he found the time to subject them all to his will?\u003c/p\u003e\n\u003cp\u003eCould he really have done it all the moment he reached Baikonur?\u003c/p\u003e\n\u003cp\u003eAn ordinary vampire can easily keep one or two people under his control. A Higher Vampire can manage about twenty.\u003c/p\u003e\n\u003cp\u003eBut Kostya really had become an absolute Other¡ªhe had the entire fine-tuned mechanism of the huge cosmodrome dancing to his tune.\u003c/p\u003e\n\u003cp\u003eThey brought Kostya some kind of printouts. They pointed out something to him on the screens. He listened and nodded¡ª and never even looked in our direction once.\u003c/p\u003e\n\u003cp\u003eA clever boy. Well-educated. He studied in the physics faculty, then moved to biology, but it looked like he\u0027d maintained his enthusiasm for physics and math. Those diagrams and graphs wouldn\u0027t have meant a thing to me, but he was preparing to put up a magical portal directly into orbit. To go out into space using magical means¡ªone small step for an Other, one giant leap for all mankind...\u003c/p\u003e\n\u003cp\u003eJust don\u0027t let him drag it out too long.\u003c/p\u003e\n\u003cp\u003eJust don\u0027t let Gesar panic.\u003c/p\u003e\n\u003cp\u003eJust don\u0027t let them make that nuclear strike¡ªit won\u0027t do any good, and there\u0027s no need¡ªthere\u0027s no need!\u003c/p\u003e\n\u003cp\u003eKostya didn\u0027t look at me until after he\u0027d opened the prism of the portal. He stared at me with that contemptuous resentment in his eyes. The lips behind the glass moved and I realized what they\u0027d said: \"Goodbye.\"\u003c/p\u003e\n\u003cp\u003e\"Goodbye,\" I agreed.\u003c/p\u003e\n\u003cp\u003eWith his life-support pack in one hand and the briefcase containing the Fuaran in the other, Kostya stepped into the portal.\u003c/p\u003e\n\u003cp\u003eThen I allowed myself to remove the shield¡ªand all that Power that wasn\u0027t mine zoomed away from me, spreading out in all directions.\u003c/p\u003e\n\u003cp\u003e\"Just how do you propose to explain all that?\" Gesar asked.\u003c/p\u003e\n\u003cp\u003e\"What exactly?\" I sat down in the nearest chair. I was shaking. How long would the air supply last in a light spacesuit that was never intended for spacewalking? A couple of hours? It was unlikely to be more.\u003c/p\u003e\n\u003cp\u003eKostya Saushkin didn\u0027t have very long left to live.\u003c/p\u003e\n\u003cp\u003e\"What makes you so sure...\" Gesar began. Then he stopped. I even thought I heard him exchange a few remarks with Zabu-lon. Something about orders that had to be rescinded, about bombers that had to be returned to base. About the team of magicians that would start covering up the traces left by the outrageous events that had taken place at Baikonur. About the official cover story for the failed launch.\u003c/p\u003e\n\u003cp\u003e\"What happened?\" Las asked, sitting down beside me. The technician he had unceremoniously shoved off the chair gazed around, perplexed. People were gradually recovering their wits.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it,\" I said. \"It\u0027s all over. Or almost all over.\"\u003c/p\u003e\n\u003cp\u003eBut I knew it wasn\u0027t really over yet. Because somewhere high in the sky, up above the clouds, in the cold starlight, the absolute Other was tumbling over and over in his stolen space-suit. Kostya Saushkin. He was trying to open a portal¡ªbut he couldn\u0027t. He was trying to get to the space station drifting past him¡ªhe couldn\u0027t. He was trying to get back to Earth¡ªbut he couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eBecause he was an absolute zero.\u003c/p\u003e\n\u003cp\u003eBecause we were all vampires.\u003c/p\u003e\n\u003cp\u003eAnd up there, beyond the bounds of the warm, living Earth, far from the people and animals, the plants and microbes, far from everything that breathes and moves and hastens to live¡ª we all become absolute zeroes. Without the free supply of Power that allows us to fling a bright ball of lightning at each other so elegantly and heal sicknesses and cast hexes and turn a maple leaf into a banknote or sour milk into vintage whisky.\u003c/p\u003e\n\u003cp\u003eAll our Power was not ours.\u003c/p\u003e\n\u003cp\u003eAll our Power was weakness.\u003c/p\u003e\n\u003cp\u003eAnd that was what the fine young man Kostya Saushkin had failed to understand and refused to accept.\u003c/p\u003e\n\u003cp\u003eI heard Zabulon laugh¡ªfar, far away in the city of Saratov, standing under an awning in an open-air cafe with a glass of beer in his hand. Zabulon was gazing up at the darkening sky of evening¡ªsearching for a swift new star whose flight would be brilliant but brief.\u003c/p\u003e\n\u003cp\u003e\"You look like you\u0027re crying,\" said Las. \"Only there aren\u0027t any tears.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" I said. \"No tears, and no strength either. I won\u0027t be able to open a portal to get us back. We\u0027ll have to take a plane. Or wait for the clean-up team, maybe they\u0027ll help.\"\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" a technician asked. \"Eh? What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re inspectors from the Ministry of Health,\" said Las. \"So why don\u0027t you tell us what you thought you were doing, burning cut cannabis plants by the air intake of the ventilation system?\"\u003c/p\u003e\n\u003cp\u003e\"What cannabis?\" the technician asked, starting to stammer.\u003c/p\u003e\n\u003cp\u003e\"Arboraceous!\" I snapped. \"Come on, Las, I still have to give you the necessary explanations.\"\u003c/p\u003e\n\u003cp\u003eAs we walked out of the hall, several technical personnel and soldiers with automatic weapons came running toward us. The chaos was so total that no one took any notice of us¡ªor perhaps we were still protected by the remains of the magical shield. At the end of the corridor I caught a glimpse of the German tourist\u0027s rosy backside¡ªhe was hopping and skipping along, with his finger still stuck in his mouth. There were two men in white coats chasing after him.\u003c/p\u003e\n\u003cp\u003e\"Okay, listen to this,\" I told Las. \"Apart from the ordinary human world that is visible to the eye, there is also a Twilight world. The Twilight can only be entered by those...\"\u003c/p\u003e\n\u003cp\u003eI gulped and faltered¡ªI\u0027d had another vision of Kostya. Kostya as he had been ages ago, the boy-vampire who had no powers yet... \"Look, I\u0027m transforming! I\u0027m a terrible bat! I can fly! I can fly!\" Goodbye, Kostya. You made it.\u003c/p\u003e\n\u003cp\u003eYou\u0027re flying now.\u003c/p\u003e\n\u003cp\u003eI continued: \"The Twilight can only be entered by those who possess...\" \u003c/p\u003e","sourceLink":"https://allnovel.net/twilight-watch-watch-3/page-26.html","bookId":2537,"creation":"Oct 5, 2019 11:51:30 PM","modification":"Oct 5, 2019 11:51:30 PM"}
