{"id":110090,"no":6,"title":"Page 6","content":"\u003cp\u003eI SPENT HALF A DAY DOING THINGS THAT WERE STRICTLY OFF-LIMITS AND\u003c/p\u003e\n\u003cp\u003eno use to anyone. The vampire Kostya would probably have pulled a wry face and informed me what he thought of my naivete.\u003c/p\u003e\n\u003cp\u003eFirst I went back to the Assol complex to change into jeans and a simple shirt, and then I set off in the direction of the nearest normal courtyard¡ªtoward the dreary, nine-story prefabricated buildings. There, to my delight, I discovered a soccer field, with high-school-age loafers kicking a ball around on it. There were a few young men there as well, in fact. Even though the recently concluded world championship had been, to put it mildly, an inglorious one for our team, it still had a positive effect. In the few surviving courtyards, the competitive spirit that seemed to have been lost was reviving.\u003c/p\u003e\n\u003cp\u003eI was put on a team, the side that had only one adult¡ªwith an impressive paunch, but extremely agile and frisky. I\u0027m not a very good player, but these guys weren\u0027t world championship material either.\u003c/p\u003e\n\u003cp\u003eFor about an hour I ran around on the dusty, trampled earth, yelling and shooting at the goal made out of rotten wire mesh, even scoring a few times. Once a huge tenth-grade hulk deftly dumped me on the ground and gave me an amiable smile.\u003c/p\u003e\n\u003cp\u003eBut I didn\u0027t take offense or get upset.\u003c/p\u003e\n\u003cp\u003eWhen the game tailed off¡ªof its own accord, somehow¡ªI went into the nearest shop, bought some mineral water and beer and, for the very youngest soccer players, Baikal soda pop. Of course, they would have preferred Coca-Cola, but it\u0027s time we stopped drinking that foreign poison.\u003c/p\u003e\n\u003cp\u003eThe only thing bothering me was the realization that excessive generosity would arouse all kinds of suspicions, so I had to be moderate in my good deeds.\u003c/p\u003e\n\u003cp\u003eAfter saying goodbye to the players on \"my\" side and the other, I walked as far as the beach, and really enjoyed a swim in the water that was dirty, but cool. The pompous palace spires of the Assol complex towered up into the sky on one side.\u003c/p\u003e\n\u003cp\u003eWell let them... I didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eThe funniest thing of all, I realized, was that in my place any Dark Magician could have done exactly the same thing. Not one of the really young ones still into pleasures that had been out of reach before, like fresh oysters and expensive prostitutes. But a Dark One who had already lived a bit and come to understand that everything in the world was nothing but vanity, the vanity of vanities, in fact.\u003c/p\u003e\n\u003cp\u003eAnd he would have scampered around that little soccer field, yelling and kicking the ball, and hissing at the teenagers\u0027 clumsy attempts to swear: \"Hey, watch your lip, kid!\" Afterward he would have gone to the beach, and splashed about in the muddy water, and laid on the grass, looking up at the sky...\u003c/p\u003e\n\u003cp\u003eWhere was it, that dividing line? Okay, with the lower Dark Ones, everything was clear. They were non-life. They had to kill in order to survive. And there was nothing any verbal gymnastics could do about that. They were evil.\u003c/p\u003e\n\u003cp\u003eBut where was the real boundary?\u003c/p\u003e\n\u003cp\u003eAnd why was it sometimes ready to disappear? For instance, at a moment when the only problem was one single human being who wanted to become an Other? Just one, that was all! But just look at the resources that had been thrown into the search. Dark Ones, Light Ones, the Inquisition... And I wasn\u0027t the only one working on this business, I was just a pawn who had been advanced, carrying out local reconnaissance work. Gesar was wrinkling his forehead, Zabulon was knitting his brows, Witez-slav was scowling and baring those teeth. A human wanted to become an Other¡ªhunt him down, get him!\u003c/p\u003e\n\u003cp\u003eBut who wouldn\u0027t want it?\u003c/p\u003e\n\u003cp\u003eNot the eternal hunger of the vampires, not the insane fits of the werewolves, but the full, complete life of a magician. With everything that ordinary people had.\u003c/p\u003e\n\u003cp\u003eOnly better.\u003c/p\u003e\n\u003cp\u003eYou\u0027re not afraid anyone will steal the expensive music system out of your car when you leave it unwatched.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t get sick with flu, and if you come down with some vile incurable disease, the Dark Sorcerers or the Light Healers are at your service.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t wonder how you\u0027re going to survive until payday.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t feel afraid of dark streets at night or drunken bums.\u003c/p\u003e\n\u003cp\u003eYou\u0027re not even afraid of the militia.\u003c/p\u003e\n\u003cp\u003eYou\u0027re certain your child will get home safely from school and not run into some crazy maniac in the front hallway...\u003c/p\u003e\n\u003cp\u003eYes, of course, that was where the real problem lay. Your nearest and dearest were safe, they were even excluded from the vampire lottery. Only you couldn\u0027t save them from old age and death.\u003c/p\u003e\n\u003cp\u003eBut after all, that was still a long way off. Somewhere way off in the future, far ahead.\u003c/p\u003e\n\u003cp\u003eOn the whole it was far more pleasant to be an Other.\u003c/p\u003e\n\u003cp\u003eAnd then again, you wouldn\u0027t gain anything if you refused initiation, even your human relatives would be right to call you a fool. After all, if you became an Other, you\u0027d be able to help them out. Like that story of Semyon\u0027s... someone put a hex on a peasant\u0027s cows, and his Other son had an investigator sent in to help him. Blood was thicker than water, after all; your own flesh and blood was dearest. There was nothing to be done...\u003c/p\u003e\n\u003cp\u003eI jerked upright as if I\u0027d been electrified. I jumped to my feet and stared up at the Assol complex.\u003c/p\u003e\n\u003cp\u003eWhat reason could a Light Magician have for making a rash promise to do absolutely anything?\u003c/p\u003e\n\u003cp\u003eThere was only one reason!\u003c/p\u003e\n\u003cp\u003eThat was it, the lead!\u003c/p\u003e\n\u003cp\u003e\"Have you come up with something, Anton?\" a voice asked behind my back.\u003c/p\u003e\n\u003cp\u003eI turned around and looked into the black lenses of Kostya\u0027s glasses. He was wearing just bathing trunks, the appropriate attire for the beach, apart from the child\u0027s white panama hat perched on the back of his head like a skullcap (no doubt he\u0027d taken it away from some little toddler without any qualms of conscience) and the dark glasses.\u003c/p\u003e\n\u003cp\u003e\"Finding the sun hot?\" I asked spitefully.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s oppressive. Hanging up there in the sky like a flatiron... Why, aren\u0027t you feeling hot?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I admitted. \"But it\u0027s a different kind of heat.\"\u003c/p\u003e\n\u003cp\u003e\"Can we manage without the sarcasm?\" Kostya asked. He sat down on the sand and fastidiously tossed aside a cigarette butt from near his feet. \"I only go swimming at night now. But this time I came... to have a word with you.\"\u003c/p\u003e\n\u003cp\u003eI felt ashamed. The person sitting in front of me was a moody young man¡ªit made no difference that he was undead. And I still remembered the gloomy teenager hovering uncertainly at the door of my apartment. \"You shouldn\u0027t invite me in, I\u0027m a vampire, I could come in the night and bite you...\"\u003c/p\u003e\n\u003cp\u003eAnd that boy had held out for a pretty long time. He\u0027d drunk pig\u0027s blood and donor\u0027s blood. He\u0027d dreamed of becoming alive again. \"Like Pinocchio,\"¡ªhe must have read Collodi or seen the movie AI, but anyway he\u0027d found the right comparison.\u003c/p\u003e\n\u003cp\u003eIf only Gesar hadn\u0027t detailed me to hunt vampires...\u003c/p\u003e\n\u003cp\u003eNo, that was nonsense. Nature would have taken its course. And Kostya would have been given his license.\u003c/p\u003e\n\u003cp\u003eIn any case I had no right to scoff at him. I had one huge advantage¡ªI was alive.\u003c/p\u003e\n\u003cp\u003eI could approach old people without feeling ashamed. Yes, without any shame¡ªbecause Witezslav hadn\u0027t been honest with me. It wasn\u0027t fear or revulsion that had made him avoid the old woman.\u003c/p\u003e\n\u003cp\u003eIt was shame.\u003c/p\u003e\n\u003cp\u003e\"Sorry, Kostya,\" I said and lay down on the sand beside him. \"Let\u0027s talk.\"\u003c/p\u003e\n\u003cp\u003e\"It seems to me that the permanent residents at Assol have nothing to do with it,\" Kostya began gloomily. \"The client is one of those who are only there occasionally.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to check them all,\" I said with a phony sigh.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s only the start. We have to look for the traitor.\"\u003c/p\u003e\n\u003cp\u003e\"We are looking.\"\u003c/p\u003e\n\u003cp\u003e\"I can see the way you\u0027re looking... Realized that he\u0027s one of yours, have you?\"\u003c/p\u003e\n\u003cp\u003e\"How do you make that out?\" I protested indignantly. \"Some Dark One could quite easily have blundered...\"\u003c/p\u003e\n\u003cp\u003eWe discussed the situation for a while. We seemed to have reached the same conclusions simultaneously.\u003c/p\u003e\n\u003cp\u003eOnly now I was just half a step ahead. And I had no intention of helping Kostya out.\u003c/p\u003e\n\u003cp\u003e\"The letter was posted in the heap of letters that builder brought to the post office,\" said Kostya, not suspecting how cunning I was being. \"Nothing could be easier. All those Gas-tarbeiters live in an old school, they use it as a hostel. They put all their letters on the attendant\u0027s table on the first floor. In the morning someone goes to the post office and posts them. It would be no problem for an Other to get into the hostel and divert the attendant\u0027s attention... or simply wait for him to go to the john. Then drop the letter into the general pile. And there you go! No leads.\"\u003c/p\u003e\n\u003cp\u003e\"Simple and effective,\" I agreed.\u003c/p\u003e\n\u003cp\u003e\"In the Light Ones\u0027 style,\" Kostya said with a frown. \"Get someone else to do the dirty work for you.\"\u003c/p\u003e\n\u003cp\u003eFor some reason I didn\u0027t take offense. I just smiled mockingly and turned over on to my back, looking up at the sky and the lovely yellow sun.\u003c/p\u003e\n\u003cp\u003e\"Okay, we do the same...\" Kostya muttered.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"Come on, tell me, haven\u0027t you ever used people for your operations?\" Kostya protested indignantly.\u003c/p\u003e\n\u003cp\u003e\"Sometimes. Used, but never put them in danger.\"\u003c/p\u003e\n\u003cp\u003e\"And in this case the Other hasn\u0027t put anyone in danger, only used them,\" Kostya said off the point, completely forgetting his comment about the \"dirty work.\"\u003c/p\u003e\n\u003cp\u003e\"What I\u0027m wondering is... does it make any sense to follow this trail any further? So far the traitor has covered all his tracks very thoroughly. We\u0027ll end up chasing a phantom...\"\u003c/p\u003e\n\u003cp\u003e\"They say a couple of days ago two security guards at the Assol complex thought they saw something ghastly in the bushes,\" I said. \"They even opened fire.\"\u003c/p\u003e\n\u003cp\u003eKostya\u0027s eyes blazed. \"Have you already checked it out?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"I\u0027m shielded, undercover, there\u0027s no way I can.\"\u003c/p\u003e\n\u003cp\u003e\"Is it okay if I check it out?\" Kostya asked eagerly. \"Listen, I\u0027ll mention that it was you...\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead,\" I said magnanimously.\u003c/p\u003e\n\u003cp\u003e\"Thanks, Anton,\" said Kostya, breaking into a broad smile and giving me a hefty punch to the shoulder. \"You\u0027re a decent guy after all. Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"Do a good job,\" I couldn\u0027t resist saying, \"and maybe you\u0027ll get another license ahead of the line.\"\u003c/p\u003e\n\u003cp\u003eKostya fell silent and his face turned sour. He stared hard at the river.\u003c/p\u003e\n\u003cp\u003e\"How many people did you kill to become a Higher Vampire?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that to you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just... curious.\"\u003c/p\u003e\n\u003cp\u003e\"Check out your archives some time and take a look,\" Kostya said with a crooked smile. \"Is it really that hard?\"\u003c/p\u003e\n\u003cp\u003eOf course, it wasn\u0027t that hard. But I\u0027d never looked at Kostya\u0027s file. I didn\u0027t want to know that...\u003c/p\u003e\n\u003cp\u003e\"Uncle Kostya, give me my hat!\" a demanding voice squeaked nearby.\u003c/p\u003e\n\u003cp\u003eI glanced sideways at the little girl, about four years old, who had come running up to Kostya. So he really had been teasing a child, and he\u0027d stolen her hat...\u003c/p\u003e\n\u003cp\u003eKostya obediently removed the panama hat from his head and gave it to the little girl.\u003c/p\u003e\n\u003cp\u003e\"Will you come again tonight?\" the little girl asked, glancing at me and pouting. \"Will you tell me a story?\"\u003c/p\u003e\n\u003cp\u003e\"Uh huh,\" Kostya said with a nod.\u003c/p\u003e\n\u003cp\u003eThe little girl beamed and ran off to a young woman who was collecting her things together a little distance away. The sand spurted up from under her heels...\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve lost your mind!\" I roared, jumping up. \"I\u0027ll reduce you to dust right here!\"\u003c/p\u003e\n\u003cp\u003eMy expression must have been pretty terrifying. Kostya was quick to answer.\u003c/p\u003e\n\u003cp\u003e\"What is it? What\u0027s wrong with you, Anton? She\u0027s my great-niece! Her mother\u0027s my cousin! They live in Strogino, and I\u0027m staying with them for the time being, so I don\u0027t have to drag myself all the way across town.\"\u003c/p\u003e\n\u003cp\u003eThat brought me up short.\u003c/p\u003e\n\u003cp\u003e\"What, did you think I was sucking her blood?\" Kostya asked, still looking at me warily. \"Go and check! There aren\u0027t any bites. She\u0027s my niece, understand? For her sake I\u0027d take out anyone myself.\"\u003c/p\u003e\n\u003cp\u003e\"Pah!\" I said and spat. \"What else could I think? \u0027Will you come again tonight? Will you tell me a story?\u0027...\"\u003c/p\u003e\n\u003cp\u003e\"A typical Light One,\" Kostya said more calmly. \"Since I\u0027m a vampire I must be a bastard, right?\"\u003c/p\u003e\n\u003cp\u003eOur fragile truce wasn\u0027t exactly over, but it had reverted to the normal state of cold war. Kostya sat there fuming, and I sat there cursing myself for jumping to conclusions. They didn\u0027t issue licenses for children under the age of twelve, and Kostya wasn\u0027t such a fool as to hunt without a license.\u003c/p\u003e\n\u003cp\u003eBut it had just burst out...\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a little daughter,\" Kostya said, suddenly catching on. \"The same age, right?\"\u003c/p\u003e\n\u003cp\u003e\"Younger,\" I replied. \"And prettier.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously, your own\u0027s always prettier,\" Kostya laughed. \"All right, Gorodetsky. I understand. Let\u0027s forget it. And thanks for the lead.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay,\" I said. \"Maybe those security men didn\u0027t see anything after all. They\u0027d been drinking vodka or smoking dope...\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll check it out,\" Kostya said cheerfully. \"We\u0027ll check everything out.\"\u003c/p\u003e\n\u003cp\u003eHe rubbed the back of his head with his open hand and stood up.\u003c/p\u003e\n\u003cp\u003e\"Time to go?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s getting to me,\" Kostya answered, squinting upward. \"I\u0027m disappearing.\"\u003c/p\u003e\n\u003cp\u003eAnd he did just that, disappeared, after first averting the eyes of everyone there. There was just a dim shadow left hanging in the air for a second.\u003c/p\u003e\n\u003cp\u003e\"Show off,\" I said and turned over on to my stomach.\u003c/p\u003e\n\u003cp\u003eTo be quite honest, I was already feeling hot too. But I decided on principle not to leave with a Dark One.\u003c/p\u003e\n\u003cp\u003eI still had a few things to think through before I went to the Assol security office.\u003c/p\u003e\n\u003cp\u003eWitiezslav had done a really good job. When I turned up the head of security broke into a broad, friendly smile.\u003c/p\u003e\n\u003cp\u003e\"Oh, look who\u0027s come to see us!\" he declared, shoving some papers off to one side. \"Tea, coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Coffee,\" I decided.\u003c/p\u003e\n\u003cp\u003e\"Andrei, bring us some coffee,\" the boss commanded. \"And a lemon!\"\u003c/p\u003e\n\u003cp\u003eHe reached into the safe and produced a bottle of good Georgian cognac.\u003c/p\u003e\n\u003cp\u003eThe security man who had shown me into the boss\u0027s office was a little disconcerted, but he didn\u0027t argue.\u003c/p\u003e\n\u003cp\u003e\"Any questions?\" the boss asked as he deftly sliced the lemon. \"Will you have some cognac, Anton? A good cognac, I promise.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t even know what his name was... I liked the former boss of security better. The way he\u0027d treated me had been sincere.\u003c/p\u003e\n\u003cp\u003eBut the former security boss would never have given me the information I was counting on getting now.\u003c/p\u003e\n\u003cp\u003e\"I need to take a look at the personal files of all the residents,\" I said. And I added with a smile: \"In a building like this you must keep a check on everyone, right?\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" the boss agreed readily. \"Money\u0027s all very fine, but there are some serious people intending to live here, and we don\u0027t want any thugs or bandits... You want all the personal files?\"\u003c/p\u003e\n\u003cp\u003e\"The lot,\" I said. \"For everyone who\u0027s bought an apartment here, regardless of whether they\u0027ve moved in yet or not.\"\u003c/p\u003e\n\u003cp\u003e\"The files on the real owners or the people the apartments are registered to?\" the security boss asked politely.\u003c/p\u003e\n\u003cp\u003e\"The real owners.\"\u003c/p\u003e\n\u003cp\u003eThe boss nodded and reached into the safe again.\u003c/p\u003e\n\u003cp\u003eTen minutes later I was sitting at his desk and leafing through the files¡ªall very neat and not too thick. Out of natural curiosity I started with myself.\u003c/p\u003e\n\u003cp\u003e\"Do you need me here anymore?\" the security boss asked.\u003c/p\u003e\n\u003cp\u003e\"No, thanks.\" I eyed the number of files. \"I\u0027ll need one hour.\"\u003c/p\u003e\n\u003cp\u003eThe boss went out, closing the door quietly behind him.\u003c/p\u003e\n\u003cp\u003eAnd I got into my reading.\u003c/p\u003e\n\u003cp\u003eAnton Gorodetsky, it emerged, was married to Svetlana Gorodetskaya and had a two-year-old daughter, Nadezhda Gorodetskaya. Anton Gorodetsky had a little business¡ªa firm trading in milk products. Milk, kefir, pot cheese, and yogurts.. .\u003c/p\u003e\n\u003cp\u003eI knew the firm. A standard Night Watch subsidiary that earned money for us. There were about twenty of them around Moscow, and their employees were perfectly ordinary human beings who never suspected where the profits really went.\u003c/p\u003e\n\u003cp\u003eIt was all pretty modest and simple, cute. Like the old promo jingle for milk¡ªOn the meadow, on the meadow, who is grazing on the meadow? That\u0027s right, Others. Well, I couldn\u0027t really deal in vodka, could I?\u003c/p\u003e\n\u003cp\u003eI set my file aside and started on the other residents.\u003c/p\u003e\n\u003cp\u003eNaturally, not all the information about the people was there. It couldn\u0027t have been. After all, no private security service, even in the most luxurious residential complex, is any match for the KGB.\u003c/p\u003e\n\u003cp\u003eBut I didn\u0027t need too much. Basically information about their relatives. In the first instance, their parents.\u003c/p\u003e\n\u003cp\u003eFirst I set aside those whose parents were alive and well and put the files on people whose parents were dead in a different pile.\u003c/p\u003e\n\u003cp\u003eI was particularly interested in anyone who had been raised in a children\u0027s home¡ªthere were two of those¡ªand anyone with a stroke through the columns headed \"Father\" or \"Mother.\"\u003c/p\u003e\n\u003cp\u003eThere were eight of those.\u003c/p\u003e\n\u003cp\u003eI laid these files out in front of me and started studying them closely.\u003c/p\u003e\n\u003cp\u003eI immediately weeded out one ex-orphanage boy who, to judge from his file, had criminal connections. He had been out of the country for the last year and, despite appeals from the agencies of law enforcement, had no intention of coming back.\u003c/p\u003e\n\u003cp\u003eThen two from incomplete families were sifted out.\u003c/p\u003e\n\u003cp\u003eOne of them turned out to be a weak Dark Magician known to me from a trivial old case. The Dark Ones were bound to be giving him the tenth degree already. If they hadn\u0027t come up with anything, the guy was in the clear.\u003c/p\u003e\n\u003cp\u003eThe other was a rather well-known variety artist who, I happened to know¡ªagain quite by chance¡ªhad been touring abroad for the last three months: the USA, Germany, Israel. Probably earning money for the finishing work on his apartment.\u003c/p\u003e\n\u003cp\u003eThat left seven. A good number. For the time being I could focus on them.\u003c/p\u003e\n\u003cp\u003eI opened the files and began reading them closely. Two women, five men... Which of them might be worth considering?\u003c/p\u003e\n\u003cp\u003e\"Roman Lvovich Khlopov, 42, businessman...\" The face didn\u0027t arouse any associations. Maybe he was the one? Maybe...\u003c/p\u003e\n\u003cp\u003e\"Andrei Ivanovich Komarenko, 31, businessman...\" Oh, what a strong-willed expression! And still fairly young... Was it him? Possibly... No, impossible. I set the businessman Komarenko\u0027s file aside. A man in his early thirties who donated serious money like that to building churches and was distinguished by \"intense religious feeling\" wouldn\u0027t want to be transformed into an Other.\u003c/p\u003e\n\u003cp\u003e\"Timur Borisovich Ravenbakh, 61, businessman...\" Rather young-looking for his age. And if he met Timur Borisovich, the strong-willed youngster Andrei Ivanovich Komarenko would have lowered his eyes. Even the face was familiar, either from TV, or somewhere else...\u003c/p\u003e\n\u003cp\u003eI set the file aside. Then my hand started to sweat. A chilly tremor ran down my back.\u003c/p\u003e\n\u003cp\u003eNo, it wasn\u0027t from TV, or rather, not only from TV, that I remembered that face...\u003c/p\u003e\n\u003cp\u003eIt couldn\u0027t be.\u003c/p\u003e\n\u003cp\u003e\"It can\u0027t be!\" I said, repeating my thought out loud. I poured myself some cognac and tossed it down. I looked at Timur Borisovich\u0027s face¡ªa calm, intelligent, slightly Eastern face.\u003c/p\u003e\n\u003cp\u003eIt couldn\u0027t be.\u003c/p\u003e\n\u003cp\u003eI opened the file and started reading. Born in Tashkent. Father... unknown. Mother... died at the very end of the war, when little Timur was not even five. Raised in a children\u0027s home. Graduated from a junior technical college and then a construction institute. Made his career through Komsomol connections. Somehow managed to avoid joining the Party. Founded one of the first construction cooperatives in the USSR, which actually did far more business trading in imported paving stones and plumbing fixtures than constructing buildings. Moved to Moscow... founded a firm... engaged in politics... was never... never a member of... was never employed as... a wife, a divorce, a second wife...\u003c/p\u003e\n\u003cp\u003eI\u0027d found the human client.\u003c/p\u003e\n\u003cp\u003eAnd the most terrible thing about it was that I\u0027d found the renegade Other at the same time.\u003c/p\u003e\n\u003cp\u003eAnd that discovery was so unexpected, it felt as if the universe had collapsed around me.\u003c/p\u003e\n\u003cp\u003e\"How could you!\" I said reproachfully. \"How could you... boss...\"\u003c/p\u003e\n\u003cp\u003eBecause if you made Timur Borisovich ten or fifteen years younger, he would have been a dead ringer for Gesar, or Boris Ignatievich as he was known to the world, who sixty years ago had lived in that region... Tashkent, Samarkand, and other parts of Central Asia...\u003c/p\u003e\n\u003cp\u003eWhat astonished me most of all was not my boss\u0027s transgression. Gesar a criminal? The idea was so incredible, it didn\u0027t even provoke any response.\u003c/p\u003e\n\u003cp\u003eI was shaken by how easily the boss had been caught out.\u003c/p\u003e\n\u003cp\u003eSo sixty years earlier a child had been born to Gesar in distant Uzbekistan. Then Gesar had been offered a job in Moscow. But the child\u0027s mother, an ordinary human being, had died in the turmoil of war. And the little human being, whose father was a Great Magician, had ended up in a children\u0027s home...\u003c/p\u003e\n\u003cp\u003eAll sorts of things happen. Gesar might not even have known that Timur existed. Or he could have known, but for some reason or other not have played any part in his life. But then the old man had felt a tug at his heartstrings, and he\u0027d met with his son, who was already old, and he\u0027d made a rash promise...\u003c/p\u003e\n\u003cp\u003eAnd that was certainly amazing!\u003c/p\u003e\n\u003cp\u003eGesar had been scheming for hundreds, thousands of years. Every single word he spoke was carefully weighed. And then he pulled a stroke like this?\u003c/p\u003e\n\u003cp\u003eIncredible.\u003c/p\u003e\n\u003cp\u003eBut a fact.\u003c/p\u003e\n\u003cp\u003eYou didn\u0027t have to be an expert in physiognomy to recognize Timur Borisovich and Boris Ignatievich as close relatives. Even if I didn\u0027t say anything, the Dark Ones would make the same discovery. Or the Inquisition would. They\u0027d put the screws on the elderly businessman... but, no, why bother with the screws? We weren\u0027t vicious racketeers. We were Others. Witezslav would look into his eyes, or Zabulon would click his fingers, and Timur Borisovich would spill out the whole story as if he were at confession.\u003c/p\u003e\n\u003cp\u003eAnd what would happen to Gesar?\u003c/p\u003e\n\u003cp\u003eI thought about it. Well... if he admitted that he did send the letter... then there hadn\u0027t been any evil intent on his part.. . and in general he had the right to reveal himself to a human being.\u003c/p\u003e\n\u003cp\u003eI spent a little while running through the points of the Treaty in my mind, the amendments and refinements, the precedents and exceptions, the references and footnotes...\u003c/p\u003e\n\u003cp\u003eThe result was pretty amusing.\u003c/p\u003e\n\u003cp\u003eGesar would be punished, but not very severely. The maximum penalty would be an official rebuke from the European Office of the Night Watch. And something menacing, but almost meaningless, from the Inquisition. Gesar wouldn\u0027t even lose his job.\u003c/p\u003e\n\u003cp\u003eOnly...\u003c/p\u003e\n\u003cp\u003eI imagined what merriment there would be in the Day Watch. How Zabulon would grin. How sincerely Dark Ones would start to inquire after Gesar\u0027s family affairs and send greetings to his little human son.\u003c/p\u003e\n\u003cp\u003eOf course, after living the number of years that Gesar had, anyone would grow a thick skin and learn how to shrug off ridicule.\u003c/p\u003e\n\u003cp\u003eBut I wouldn\u0027t have liked to be in his place right then.\u003c/p\u003e\n\u003cp\u003eAnd then our guys wouldn\u0027t go easy on the irony either. No, no one would actually reproach Gesar with committing a blunder. Or badmouth him behind his back either.\u003c/p\u003e\n\u003cp\u003eBut there would be smirks. And bemused head-shaking. And whispers¡ª\"the Great One\u0027s getting old after all, getting old...\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have any puppyish adoration or admiration left for Gesar. Our views differed on so many things. And there were some things I still couldn\u0027t forgive him for...\u003c/p\u003e\n\u003cp\u003eBut to pull a dumb stunt like this.\u003c/p\u003e\n\u003cp\u003e\"What on earth were you thinking of, Great One?\" I said. I put all the files back in the open safe and poured myself another glass of cognac.\u003c/p\u003e\n\u003cp\u003eCould I help Gesar?\u003c/p\u003e\n\u003cp\u003eHow?\u003c/p\u003e\n\u003cp\u003eGet to Timur Borisovich first?\u003c/p\u003e\n\u003cp\u003eAnd then what? Cast a spell of silence on him? They\u0027d remove it; someone would be found who could.\u003c/p\u003e\n\u003cp\u003eWhat if I forced the businessman to leave Russia? To go on the run, as if all the city\u0027s criminal groups and agencies of law enforcement were after him?\u003c/p\u003e\n\u003cp\u003eIt would serve him right. Let him spend the rest of his life hunting seals or knocking coconuts off palm trees! So he wanted to be the Empress of the Sea...\u003c/p\u003e\n\u003cp\u003eI picked up the phone and entered the number of our office\u0027s exchange. Entered the additional digits, and was put straight through to the IT lab.\u003c/p\u003e\n\u003cp\u003e\"Yes?\" the phone asked in Tolik\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Tolik, run a check on someone for me. Quick.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me the name and I\u0027ll run it,\" Tolik answered, unsurprised at my request.\u003c/p\u003e\n\u003cp\u003eI listed everything I\u0027d found out about Timur Borisovich.\u003c/p\u003e\n\u003cp\u003e\"Ha! So what else do you need apart from that?\" Tolya asked in surprise. \"Which side he sleeps on, or the last time he visited the dentist?\"\u003c/p\u003e\n\u003cp\u003e\"Where he is right now,\" I said dourly.\u003c/p\u003e\n\u003cp\u003eTolik laughed, but I heard the brisk rattle of a keyboard at the other end of the line.\u003c/p\u003e\n\u003cp\u003e\"He has a cell phone,\" I said just in case.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t teach your grandmother... He even has two cells... And they\u0027re both... they\u0027re... Right, just a moment, I\u0027ll superimpose the map...\"\u003c/p\u003e\n\u003cp\u003eI waited.\u003c/p\u003e\n\u003cp\u003e\"At the Assol residential complex. And not even the CIA could tell you more precisely than that¡ªthe positioning isn\u0027t accurate enough.\"\u003c/p\u003e\n\u003cp\u003e\"I owe you a bottle,\" I said, and hung up. Jumped to my feet. But then... what was the rush? I was sitting in front of the observation services monitor, wasn\u0027t I?\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have to search for long.\u003c/p\u003e\n\u003cp\u003eTimur Borisovich was just getting into the elevator, followed by a couple of guys with stony faces. Two bodyguards. Or a bodyguard and a driver who doubled up as a second bodyguard.\u003c/p\u003e\n\u003cp\u003eI switched off the monitor and jumped to my feet, then dashed out into the corridor just in time to run into the head of security.\u003c/p\u003e\n\u003cp\u003e\"Got what you wanted?\" he asked, beaming.\u003c/p\u003e\n\u003cp\u003e\"Uh huh,\" I said, nodding on the run.\u003c/p\u003e\n\u003cp\u003e\"Need any help?\" the head of security shouted after me eagerly.\u003c/p\u003e\n\u003cp\u003eI just shook my head. \u003c/p\u003e","sourceLink":"https://allnovel.net/twilight-watch-watch-3/page-6.html","bookId":2537,"creation":"Oct 5, 2019 11:51:30 PM","modification":"Oct 5, 2019 11:51:30 PM"}
