{"id":68475,"no":1,"title":"Page 1","content":"\u003cp\u003eKowloon - May 1949\u003c/p\u003e\n\u003cp\u003e\"It must look like an accident. Can you arrange that?\"\u003c/p\u003e\n\u003cp\u003eIt was an insult. He could feel the anger rising in him. That was a question you asked some amateur you picked up from the streets. He was tempted to reply with sarcasm: Oh, yes, I think I can manage that. Would you prefer an accident indoors? I can arrange for her to break her neck falling down a flight of stairs. The dancer in Marseilles. Or she could get drunk and drown in her bath. The heiress in Gstaad. She could take an overdose of heroin. He had disposed of three that way. Or, she could fall asleep in bed with a lighted cigarette. The Swedish detective at L\u0027H\u0026amp;ocirc;tel on the Left Bank in Paris. Or perhaps you would prefer something outdoors? I can arrange a traffic accident, a plane crash, or a disappearance at sea.\u003c/p\u003e\n\u003cp\u003eBut he said none of those things, for in truth he was afraid of the man seated across from him. He had heard too many chilling stories about him, and he had reason to believe them.\u003c/p\u003e\n\u003cp\u003eSo all he said was, \"Yes, sir, I can arrange an accident. No one will ever know.\" Even as he said the words, the thought struck him: He knows that I\u0027ll know. He waited.\u003c/p\u003e\n\u003cp\u003eThey were on the second floor of a building in the walled city of Kowloon that had been built in 1840 by a group of Chinese to protect themselves from the British barbarians. The walls had been torn down in the Second World War, but there were other walls that kept outsiders away: Gangs of cutthroats and drug addicts and rapists roaming through the rabbit warren of crooked, narrow streets and dark stairways leading into gloom. Tourists were warned to stay away, and not even the police would venture inside past Tung Tau Tsuen Street, on the outskirts. He could hear the street noises outside the window, and the shrill and raucous polyglot of languages that belonged to the residents of the walled city.\u003c/p\u003e\n\u003cp\u003eThe man was studying him with cold, obsidian eyes. Finally, he spoke. \"Very well. I will leave the method to you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. Is the target here in Kowloon?\"\u003c/p\u003e\n\u003cp\u003e\"London. Her name is Catherine. Catherine Alexander.\"\u003c/p\u003e\n\u003cp\u003eA limousine, followed by a second car with two armed bodyguards, drove the man to the Blue House on Lascar Row, in the Tsim Sha Tsui area. The Blue House was open to special patrons only. Heads of state visited there, and movie stars, and presidents of corporations. The management prided itself on discretion. Half a dozen years earlier, one of the young girls who worked there had discussed her customers with a newspaperman, and she was found the next morning in Aberdeen Harbor with her tongue cut out. Everything was for sale in the Blue House: virgins, boys, lesbians who satisfied themselves without the \"jade stalks\" of men, and animals. It was the only place he knew of where the tenth-century art of Ishinpo was still practiced. The Blue House was a cornucopia of forbidden pleasures.\u003c/p\u003e\n\u003cp\u003eThe man had ordered the twins this time. They were an exquisitely matched pair with beautiful features, incredible bodies, and no inhibitions. He remembered the last time he had been there...the metal stool with no bottom and their soft caressing tongues and fingers, and the tub filled with fragrant warm water that overflowed onto the tiled floor and their hot mouths plundering his body. He felt the beginning of an erection.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re here, sir.\"\u003c/p\u003e\n\u003cp\u003eThree hours later, when he had finished with them, sated and content, the man ordered the limousine to head for Mody Road. He looked out the window of the limousine at the sparkling lights of the city that never slept. The Chinese had named it Gau-lung - nine dragons - and he imagined them lurking in the mountains above the city, ready to come down and destroy the weak and the unwary. He was neither.\u003c/p\u003e\n\u003cp\u003eThey reached Mody Road.\u003c/p\u003e\n\u003cp\u003eThe Taoist priest waiting for him looked like a figure from an ancient parchment, with a classic faded Oriental robe and a long, wispy white beard.\u003c/p\u003e\n\u003cp\u003e\"Jou sahn.\"\u003c/p\u003e\n\u003cp\u003e\"Jou sahn.\"\u003c/p\u003e\n\u003cp\u003e\"Gei do chin?\"\u003c/p\u003e\n\u003cp\u003e\"Yat-chihn.\"\u003c/p\u003e\n\u003cp\u003e\"Jou.\"\u003c/p\u003e\n\u003cp\u003eThe priest closed his eyes in a silent prayer and began to shake the chim, the wooden cup filled with numbered prayer sticks. A stick fell out and the shaking ceased. In the silence, the Taoist priest consulted his chart and turned to his visitor. He spoke in halting English. \"The gods say you will soon be rid of dangerous enemy.\"\u003c/p\u003e\n\u003cp\u003eThe man felt a pleasant jolt of surprise. He was too intelligent not to realize that the ancient art of chim was merely a superstition. And he was too intelligent to ignore it. Besides, there was another good-luck omen. Today was Agios Constantinous Day, his birthday.\u003c/p\u003e\n\u003cp\u003e\"The gods have blessed you with good fung shui.\"\u003c/p\u003e\n\u003cp\u003e\"Do jeh.\"\u003c/p\u003e\n\u003cp\u003e\"Hou wah.\"\u003c/p\u003e\n\u003cp\u003eFive minutes later, he was in the limousine, on his way to Kai Tak, the Hong Kong airport, where his private plane was waiting to take him back to Athens. \u003c/p\u003e","sourceLink":"https://allnovel.net/memories-of-midnight/page-1.html","bookId":2362,"creation":"Oct 5, 2019 10:09:29 AM","modification":"Oct 5, 2019 10:09:29 AM"}
