{"id":68487,"no":13,"title":"Page 13","content":"\u003cp\u003eThere were four men in the hotel room besides Tony Rizzoli and Victor Korontzis.\u003c/p\u003e\n\u003cp\u003e\"I want you to meet my friend Otto Dalton,\" Rizzoli said. \"Victor Korontzis.\"\u003c/p\u003e\n\u003cp\u003eThe two men shook hands.\u003c/p\u003e\n\u003cp\u003eRizzoli looked at the others quizically. \"I don\u0027t believe I\u0027ve met these other gentlemen.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton made the introductions.\u003c/p\u003e\n\u003cp\u003e\"Perry Breslauer from Detroit...Marvin Seymour from Houston...Sal Prizzi from New York.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis nodded to the men, not trusting his voice.\u003c/p\u003e\n\u003cp\u003eOtto Dalton was in his sixties, thin, gray-haired, affable. Perry Breslauer was younger, but his face was drawn and pinched. Marvin Seymour was a thin, mild-looking man. Sal Prizzi was a huge man, built like an oak tree, with powerful limbs for arms. He had small, mean eyes, and his face had been badly scarred with a knife.\u003c/p\u003e\n\u003cp\u003eRizzoli had briefed Korontzis before the game. These guys have a lot of money. They can afford to lose big. Seymour owns an insurance company, Breslauer has auto dealerships all over the United States, and Sal Prizzi is head of a big union in New York.\u003c/p\u003e\n\u003cp\u003eOtto Dalton was speaking. \"All right, gentlemen. Shall we get started? The white chips are five dollars, the blue are ten, the red are twenty-five, and the black ones are fifty. Let\u0027s see the color of your money.\"\u003c/p\u003e\n\u003cp\u003eKorontzis pulled out the five hundred dollars that Tony Rizzoli had loaned him. No, he thought, not loaned, given. He looked over at Rizzoli and smiled. What a wonderful friend Rizzoli is.\u003c/p\u003e\n\u003cp\u003eThe other men were taking out large bank rolls.\u003c/p\u003e\n\u003cp\u003eKorontzis felt a sudden sense of concern. What if something went wrong, and he lost the five hundred dollars? He shrugged it off. His friend Tony would take care of it. But if he won. Korontzis was filled with a sudden feeling of euphoria.\u003c/p\u003e\n\u003cp\u003eThe game began.\u003c/p\u003e\n\u003cp\u003eIt was dealer\u0027s choice. The stakes were small at first, and there were games of five-card stud, seven-card stud, draw poker, and high-low.\u003c/p\u003e\n\u003cp\u003eIn the beginning the wins and losses were spread evenly, but slowly the tide began to turn.\u003c/p\u003e\n\u003cp\u003eIt seemed that Victor Korontzis and Tony Rizzoli could do no wrong. If they had fair cards, the others had worse cards. If the others had good hands, Korontzis and Rizzoli had better hands.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis could not believe his luck. At the end of the evening he had won almost two thousand dollars. It was like a miracle.\u003c/p\u003e\n\u003cp\u003e\"You guys were sure lucky,\" Marvin Seymour grumbled.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll say,\" Breslauer agreed. \"How about giving us another chance tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll let you know,\" Rizzoli said.\u003c/p\u003e\n\u003cp\u003eWhen they had gone, Korontzis exclaimed, \"I can\u0027t believe it. Two thousand dollars!\"\u003c/p\u003e\n\u003cp\u003eRizzoli laughed. \"That\u0027s chicken feed. I told you. Otto is one of the slickest mechanics in the business. Those guys are dying to get another crack at us. Are you interested?\"\u003c/p\u003e\n\u003cp\u003e\"You bet.\" There was a broad grin on Korontzis\u0027s face. \"I think I just made a joke.\"\u003c/p\u003e\n\u003cp\u003eThe following night, Victor Korontzis won three thousand dollars.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fantastic!\" he told Rizzoli. \"Don\u0027t they suspect anything?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. I\u0027ll bet you they ask us to raise the stakes tomorrow. They think they\u0027re going to win their money back. Are you in?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, Tony. I\u0027m in.\"\u003c/p\u003e\n\u003cp\u003eAs they were sitting down to play, Sal Prizzi said, \"You know, we\u0027re the big losers so far. How about up-ping the stakes?\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli looked over at Korontzis and winked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right with me,\" Rizzoli said. \"How about you fellows?\"\u003c/p\u003e\n\u003cp\u003eThey all nodded agreement.\u003c/p\u003e\n\u003cp\u003eOtto Dalton set up piles of chips. \"The whites are fifty dollars, the blues are a hundred, reds five hundred, blacks a thousand.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis looked at Rizzoli uneasily. He had not planned on the stakes being so high.\u003c/p\u003e\n\u003cp\u003eRizzoli nodded reassuringly.\u003c/p\u003e\n\u003cp\u003eThe game began.\u003c/p\u003e\n\u003cp\u003eNothing changed. Victor Korontzis\u0027s hands were magic. Whatever cards he held beat the others. Tony Rizzoli was also winning, but not as much.\u003c/p\u003e\n\u003cp\u003e\"Fucking cards!\" Prizzi grumbled. \"Let\u0027s change decks.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton obligingly produced a fresh deck.\u003c/p\u003e\n\u003cp\u003eKorontzis looked over at Tony Rizzoli and smiled. He knew that nothing was going to change their luck.\u003c/p\u003e\n\u003cp\u003eAt midnight they had sandwiches sent up. The players took a fifteen-minute break.\u003c/p\u003e\n\u003cp\u003eTony Rizzoli took Korontzis aside. \"I told Otto to chum them a little,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"Let them win a few hands. If they keep losing all the time, they\u0027ll get discouraged and quit.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I see. That\u0027s very smart.\"\u003c/p\u003e\n\u003cp\u003e\"When they think they\u0027re hot, we\u0027ll raise the stakes again and really nail them big.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis was hesitant. \"I\u0027ve already won so much money, Tony. Don\u0027t you think maybe we should quit while we\u0027re...?\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli looked him in the eye and said, \"Victor, how would you like to leave here tonight with fifty thousand dollars in your pocket?\"\u003c/p\u003e\n\u003cp\u003eWhen the game resumed, Breslauer, Prizzi, and Seymour began to win. Korontzis\u0027s hands were still good, but the others were better.\u003c/p\u003e\n\u003cp\u003eOtto Dalton is a genius, Korontzis thought. He had been watching him deal, and had not been able to detect one false move.\u003c/p\u003e\n\u003cp\u003eAs the play went on, Victor Korontzis kept losing. He was not concerned. In a few minutes, when they had - what was the word? - chummed the others, he and Rizzoli and Dalton would move in for the kill.\u003c/p\u003e\n\u003cp\u003eSal Prizzi was gloating. \"Well,\" he said, \"it looks like you fellows have cooled off.\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli shook his head ruefully. \"Yes, it sure does, doesn\u0027t it?\" He gave Korontzis a knowing look.\u003c/p\u003e\n\u003cp\u003e\"Your luck couldn\u0027t go on forever,\" Marvin Seymour said.\u003c/p\u003e\n\u003cp\u003ePerry Breslauer spoke up. \"What do you say we increase the stakes again, and give us a real crack at you?\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli pretended to consider it. \"I don\u0027t know,\" he said thoughtfully. He turned to Victor Korontzis. \"What do you think, Victor?\"\u003c/p\u003e\n\u003cp\u003eHow would you like to leave here tonight with fifty thousand dollars in your pocket? I\u0027ll be able to buy a house, and a new car. I can take the family on vacations...Korontzis was almost trembling with excitement. He smiled. \"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"All right,\" Sal Prizzi said. \"We\u0027ll play table stakes. The sky\u0027s the limit.\"\u003c/p\u003e\n\u003cp\u003eThey were playing five-card draw. The cards were dealt.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my ante,\" Breslauer said. \"Let\u0027s open for five thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eEach player put in his ante.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis was dealt two queens. He drew three cards, and one of them was another queen.\u003c/p\u003e\n\u003cp\u003eRizzoli looked at his hand and said, \"Up a thousand.\"\u003c/p\u003e\n\u003cp\u003eMarvin Seymour studied his hand. \"I\u0027ll call, and raise you two thousand.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton threw in his cards. \"Too rich for my blood.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi said, \"I\u0027ll call.\"\u003c/p\u003e\n\u003cp\u003eThe pot went to Marvin Seymour\u0027s straight.\u003c/p\u003e\n\u003cp\u003eIn the next hand, Victor Korontzis was dealt an eight, nine, ten, and jack of hearts. One card away from a straight flush!\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call for a thousand dollars,\" Dalton said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call, and raise you a thousand.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi said, \"Let\u0027s bump it another thousand.\"\u003c/p\u003e\n\u003cp\u003eIt was Korontzis\u0027s turn. He was sure that a straight flush would beat whatever the others were holding. He was only one card away.\u003c/p\u003e\n\u003cp\u003e\"I call.\" He drew a card, and put it facedown, not daring to look at it.\u003c/p\u003e\n\u003cp\u003eBreslauer laid his hand down. \"A pair of fours and a pair of tens.\"\u003c/p\u003e\n\u003cp\u003ePrizzi put his hand down. \"Three sevens.\"\u003c/p\u003e\n\u003cp\u003eThey turned to look at Victor Korontzis. He took a deep breath, and picked up his hole card. It was black. \"Busted,\" he said. He threw his hand in.\u003c/p\u003e\n\u003cp\u003eThe pots kept growing larger.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis\u0027s pile of chips had shrunk to almost nothing. He looked over at Tony Rizzoli, concerned.\u003c/p\u003e\n\u003cp\u003eRizzoli smiled reassuringly, a smile that said, There\u0027s nothing to worry about.\u003c/p\u003e\n\u003cp\u003eRizzoli opened the next pot.\u003c/p\u003e\n\u003cp\u003eThe cards were dealt.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll ante a thousand dollars.\"\u003c/p\u003e\n\u003cp\u003ePerry Breslauer: \"I\u0027ll raise you a thousand.\"\u003c/p\u003e\n\u003cp\u003eMarvin Seymour: \"And I\u0027ll bump you two.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi: \"You know something? I think you fellows are bluffing. Let\u0027s raise it five more.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis had not looked at his hand yet. When is the damn chumming going to stop?\u003c/p\u003e\n\u003cp\u003e\"Victor?\"\u003c/p\u003e\n\u003cp\u003eKorontzis picked up his hand slowly and fanned out the cards one by one. An ace, another ace, and a third ace, plus a king and a ten. His blood began to race.\u003c/p\u003e\n\u003cp\u003e\"Are you in?\"\u003c/p\u003e\n\u003cp\u003eHe smiled to himself. The chumming had stopped. He knew that he was going to be dealt another king for a full house. He threw the ten away and tried to keep his voice casual. \"I\u0027ll call. One card, please.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton said, \"I\u0027ll take two.\" He looked at his cards. \"I raise a thousand.\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli shook his head. \"Too rich for me.\" He threw his hand in.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in,\" Prizzi said, \"and I\u0027ll raise five thousand.\"\u003c/p\u003e\n\u003cp\u003eMarvin Seymour threw in his hand. \"I\u0027m out.\"\u003c/p\u003e\n\u003cp\u003eIt was between Victor Korontzis and Sal Prizzi.\u003c/p\u003e\n\u003cp\u003e\"Are you calling?\" Prizzi asked. \"It\u0027ll cost you five thousand more.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis looked at his pile of chips. Five thousand was all he had left. But when I win this pot...he thought. He looked at his hand again. It was unbeatable. He put the pile of chips in the center of the table and drew a card. It was a five. But he still had three aces. He laid down his hand. \"Three aces.\"\u003c/p\u003e\n\u003cp\u003ePrizzi spread out his hand. \"Four deuces.\"\u003c/p\u003e\n\u003cp\u003eKorontzis sat there, stunned, watching Prizzi rake in the pot. Somehow he felt as though he had failed his friend Tony. If I could only have held out until we started to win.\u003c/p\u003e\n\u003cp\u003eIt was Prizzi\u0027s deal. \"Seven-card stud,\" he announced. \"Let\u0027s put a thousand dollars in the pot.\"\u003c/p\u003e\n\u003cp\u003eThe other players threw in their antes.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis looked over at Tony Rizzoli helplessly. \"I don\u0027t have...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" Rizzoli said. He turned to the others. \"Look, fellows, Victor didn\u0027t have a chance to pick up much cash to bring tonight, but I can assure you all that he\u0027s good for it. Let\u0027s give him credit, and we\u0027ll settle up at the end of the evening.\"\u003c/p\u003e\n\u003cp\u003ePrizzi said, \"Hold it. What is this - a fucking credit union? We don\u0027t know Victor Korontzis from Adam\u0027s ass. How do we know he\u0027ll pay up?\"\u003c/p\u003e\n\u003cp\u003e\"You have my word on it,\" Tony Rizzoli assured him. \"Otto here will vouch for me.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton spoke up. \"If Tony says Mr. Korontzis is all right, then he\u0027s all right.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi shrugged. \"Well, I guess it\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fine with me,\" Perry Breslauer said.\u003c/p\u003e\n\u003cp\u003eOtto Dalton turned to Victor Korontzis. \"How much would you like?\"\u003c/p\u003e\n\u003cp\u003e\"Give him ten thousand,\" Tony Rizzoli said.\u003c/p\u003e\n\u003cp\u003eKorontzis looked over at him in surprise. Ten thousand dollars was more money than he made in two years. But Rizzoli must have known what he was doing.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis swallowed. \"That...that will be fine.\"\u003c/p\u003e\n\u003cp\u003eA pile of chips was put in front of Korontzis.\u003c/p\u003e\n\u003cp\u003eThe cards that night were Victor Korontzis\u0027s enemy. As the stakes went up, his new pile of chips kept diminishing. Tony Rizzoli was losing also.\u003c/p\u003e\n\u003cp\u003eAt two A.M. they took a break. Korontzis got Tony Rizzoli in a corner.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening?\" Korontzis whispered in a panic. \"My God, do you know how much money I\u0027m behind?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, Victor. So am I. I\u0027ve given Otto the signal. When it\u0027s his turn to deal, the game will turn around. We\u0027re going to hit them big.\"\u003c/p\u003e\n\u003cp\u003eThey took their seats again.\u003c/p\u003e\n\u003cp\u003e\"Give my friend another twenty-five thousand dollars,\" Rizzoli said.\u003c/p\u003e\n\u003cp\u003eMarvin Seymour frowned. \"Are you sure he wants to keep playing?\"\u003c/p\u003e\n\u003cp\u003eRizzoli turned to Victor Korontzis. \"It\u0027s up to you.\"\u003c/p\u003e\n\u003cp\u003eKorontzis hesitated. I\u0027ve given Otto the signal. The game will turn around. \"I\u0027m in.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003eTwenty-five thousand dollars\u0027 worth of chips was placed in front of Korontzis. He looked at the chips and suddenly felt very lucky.\u003c/p\u003e\n\u003cp\u003eOtto Dalton was dealing. \"All right, gentlemen. The game is five-card stud. The initial bet is one thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eThe players put their chips in the center of the table.\u003c/p\u003e\n\u003cp\u003eDalton dealt out five cards to each player. Korontzis did not look at his hand. I\u0027ll wait, he thought. It will be good luck.\u003c/p\u003e\n\u003cp\u003e\"Place your bets.\"\u003c/p\u003e\n\u003cp\u003eMarvin Seymour, seated at Dalton\u0027s right, studied his hand for a moment. \"I\u0027ll fold.\" He threw his cards in.\u003c/p\u003e\n\u003cp\u003eSal Prizzi was next. \"I\u0027ll call, and raise a thousand.\" He put his chips in the center of the table.\u003c/p\u003e\n\u003cp\u003eTony Rizzoli looked at his hand and shrugged. \"I\u0027ll fold.\" He threw his cards down.\u003c/p\u003e\n\u003cp\u003ePerry Breslauer was looking at his hand and grinning. \"I\u0027ll see the raise, and I\u0027ll raise you five thousand more.\"\u003c/p\u003e\n\u003cp\u003eIt would cost Victor Korontzis six thousand dollars to stay in the game. Slowly, he picked up his hand and fanned out the cards. He could not believe what he saw. He was holding a pat straight flush - a five, six, seven, eight, and nine of hearts. A perfect hand! So Tony had been right. Thank God! Korontzis tried to hide his excitement. \"I\u0027ll see the raise, and I\u0027ll raise you five thousand.\" This was the hand that was going to make him rich.\u003c/p\u003e\n\u003cp\u003eDalton threw in his hand. \"Not for me. Pass.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s up to me,\" Sal Prizzi said. \"I think you\u0027re bluffing, pal. I\u0027ll call, and raise you another five.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis felt a little thrill of excitement go through him. He had been dealt the hand of a lifetime. This would be the biggest jackpot of the game.\u003c/p\u003e\n\u003cp\u003ePerry Breslauer was studying his hand. \"Well, I think I\u0027ll call, and raise another five, fellows.\"\u003c/p\u003e\n\u003cp\u003eIt was up to Victor Korontzis again. He took a deep breath. \"I\u0027ll see you, and raise another five.\" He was almost trembling with excitement. It was all he could do to keep from reaching out and raking in the pot.\u003c/p\u003e\n\u003cp\u003ePerry Breslauer spread out his hand, a look of triumph on his face. \"Three kings.\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve won! Victor Korontzis thought. \"Not good enough,\" he smiled. \"A straight flush.\" He put down his cards, and reached eagerly for the pot.\u003c/p\u003e\n\u003cp\u003e\"Hold it!\" Sal Prizzi slowly laid down his hand. \"I beat you with a royal flush. The ten to the ace of spades.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis turned pale. He felt suddenly faint, and his heart began to palpitate.\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" Tony Rizzoli said. \"Two goddamned straight flushes?\" He turned to Korontzis. \"I\u0027m sorry, Victor. I...I don\u0027t know what to say.\"\u003c/p\u003e\n\u003cp\u003eOtto Dalton said, \"I think that\u0027s it for tonight, gentlemen.\" He consulted a slip of paper and turned to Victor Korontzis. \"You owe sixty-five thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis looked over at Tony Rizzoli, stunned. Rizzoli shrugged helplessly. Korontzis pulled out a handkerchief and began to swab at his brow.\u003c/p\u003e\n\u003cp\u003e\"How do you want to pay that?\" Dalton asked. \"Cash or check?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t take checks,\" Prizzi said. He looked at Victor Korontzis. \"I\u0027ll take the cash.\"\u003c/p\u003e\n\u003cp\u003e\"I...I...\" The words would not come out. He found he was trembling. \"I...I don\u0027t have that...\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi\u0027s face darkened. \"You what?\" he barked.\u003c/p\u003e\n\u003cp\u003eTony Rizzoli said quickly, \"Wait a minute. Victor means he doesn\u0027t have it with him. I told you he was good for it.\"\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t put any bread on my table, Rizzoli. I want to see his money.\"\u003c/p\u003e\n\u003cp\u003e\"You will,\" Rizzoli said reassuringly. \"You\u0027ll have it in the next few days.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi jumped to his feet. \"Fuck that. I\u0027m not a charity. I want that money by tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. He\u0027ll deliver it.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis was caught in the middle of a nightmare and there was no way out. He sat there, unable to move, barely aware of the others leaving. Tony and Korontzis were alone.\u003c/p\u003e\n\u003cp\u003eKorontzis was in a daze. \"I...I can never raise that kind of money,\" he moaned. \"Never!\"\u003c/p\u003e\n\u003cp\u003eRizzoli put a hand on Korontzis\u0027s shoulder. \"I don\u0027t know what to tell you, Victor. I don\u0027t know what went wrong. I guess I lost almost as much money as you did tonight.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis wiped his eyes. \"But...but you can afford it, Tony. I...I can\u0027t. I\u0027m going to have to explain to them that I can\u0027t pay them.\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli said, \"I\u0027d think about that if I were you, Victor. Sal Prizzi is the head of the East Coast Seamen\u0027s Union. I hear those boys play pretty rough.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help it. If I haven\u0027t got the money, I haven\u0027t got the money. What can he do to me?\"\u003c/p\u003e\n\u003cp\u003e\"Let me explain what he can do to you,\" Rizzoli said earnestly. \"He can have his boys shoot off your kneecaps. You\u0027ll never walk again. He can have them throw acid in your eyes. You\u0027ll never see again. And then, when you\u0027ve had all the pain you can stand, he\u0027ll decide whether to let you live like that, or to kill you.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis was staring at him, his face ashen. \"You...you\u0027re joking.\"\u003c/p\u003e\n\u003cp\u003e\"I wish I was. It\u0027s my fault, Victor. I should never have let you get in a game with a man like Sal Prizzi. He\u0027s a killer.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, my God. What am I going to do?\"\u003c/p\u003e\n\u003cp\u003e\"Do you have any way of raising the money?\"\u003c/p\u003e\n\u003cp\u003eKorontzis began to laugh hysterically. \"Tony...I can barely support my family on what I make.\"\u003c/p\u003e\n\u003cp\u003e\"Well, then, the only thing I can suggest is that you leave town, Victor. Maybe get out of the country. Go somewhere where Prizzi can\u0027t find you.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do that,\" Victor Korontzis wailed. \"I have a wife and four children.\" He looked at Tony Rizzoli accusingly. \"You said it was going to be a setup, that we couldn\u0027t lose. You told me...\"\u003c/p\u003e\n\u003cp\u003e\"I know. And I\u0027m really sorry. It always worked before. The only thing I can think of is that Prizzi cheated.\"\u003c/p\u003e\n\u003cp\u003eKorontzis\u0027s face filled with hope. \"Well, then, if he cheated I don\u0027t have to pay him.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a problem with that, Victor,\" Rizzoli said patiently. \"If you accuse him of cheating he\u0027ll kill you, and if you don\u0027t pay him he\u0027ll kill you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, my God,\" Korontzis moaned. \"I\u0027m a dead man.\"\u003c/p\u003e\n\u003cp\u003e\"I really feel terrible about this. Are you sure there\u0027s no way you could raise...?\"\u003c/p\u003e\n\u003cp\u003e\"It would take me a hundred lifetimes. A thousand lifetimes. Everything I have is mortgaged. Where would I get...?\"\u003c/p\u003e\n\u003cp\u003eAnd at that moment, Tony Rizzoli had a sudden inspiration. \"Wait a minute, Victor! Didn\u0027t you say that those artifacts in the museum were worth a lot of money?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but what does that have to do with...?\"\u003c/p\u003e\n\u003cp\u003e\"Just let me finish. You said that the copies were as good as the originals.\"\u003c/p\u003e\n\u003cp\u003e\"Of course they\u0027re not. Any expert could tell...\"\u003c/p\u003e\n\u003cp\u003e\"Whoa. Hold it. What if one of those artifacts was missing and a copy was put in its place? I mean, when I was in the museum there were a lot of tourists going through. Could they tell the difference?\"\u003c/p\u003e\n\u003cp\u003e\"No, but...I...I see what you mean. No, I could never do that.\"\u003c/p\u003e\n\u003cp\u003eRizzoli said soothingly, \"I understand, Victor. I just thought maybe the museum could spare one little artifact. They\u0027ve got so many.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis shook his head. \"I\u0027ve been the curator at that museum for twenty years. I could never think of such a thing.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I shouldn\u0027t have even suggested it. The only reason I thought of it was because it could save your life.\" Rizzoli stood up and stretched. \"Well, it\u0027s getting late. I guess your wife will be wondering where you are.\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis was staring at him. \"It could save my life? How?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s simple. If you took one of those antiques...\"\u003c/p\u003e\n\u003cp\u003e\"Antiquities.\"\u003c/p\u003e\n\u003cp\u003e\"...antiquities...and gave it to me, I could get it out of the country and sell it for you, and give Prizzi the money you owe him. I think I could persuade him to hold off that long. And you\u0027d be off the hook. I don\u0027t have to tell you that I\u0027d be taking a big risk for you, because if I got caught I\u0027d be in a lot of trouble. But I\u0027m offering to do it because I feel I owe you one. It\u0027s my fault you got into this mess.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a good friend,\" Victor Korontzis said. \"But I can\u0027t blame you. I didn\u0027t have to get in that game. You were trying to do me a favor.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I just wish it had turned out differently. Well, let\u0027s get some sleep. I\u0027ll talk to you tomorrow. Good night, Victor.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Tony.\"\u003c/p\u003e\n\u003cp\u003eThe call came in to the museum early the following morning. \"Korontzis?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"This is Sal Prizzi.\"\u003c/p\u003e\n\u003cp\u003e\"Good morning, Mr. Prizzi.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m callin\u0027 about that little matter of sixty-five thousand dollars. What time can I pick it up?\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis began to perspire heavily. \"I...I don\u0027t have the money right now, Mr. Prizzi.\"\u003c/p\u003e\n\u003cp\u003eThere was an ominous silence at the other end of the phone. \"What the hell kind of game are you playing with me?\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, I\u0027m not playing any games. I...\"\u003c/p\u003e\n\u003cp\u003e\"Then I want my fucking money. Is that clear?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"What time does your museum close?\"\u003c/p\u003e\n\u003cp\u003e\"Six...six o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be there. Have the money for me, or I\u0027ll break your face in. And after that, I\u0027m really going to hurt you.\"\u003c/p\u003e\n\u003cp\u003eThe line went dead.\u003c/p\u003e\n\u003cp\u003eVictor Korontzis sat there in a panic. He wanted to hide. But where? He was engulfed by a feeling of total desperation, caught in a vortex of \"ifs\": If only I hadn\u0027t gone to the casino that night; if only I had never met Tony Rizzoli; if only I had kept my promise to my wife never to gamble again. He shook his head to clear it. I have to do something - now.\u003c/p\u003e\n\u003cp\u003eAnd at that moment, Tony Rizzoli walked into his office. \"Good morning, Victor.\"\u003c/p\u003e\n\u003cp\u003eIt was six-thirty. The staff had gone home, and the museum had been closed for half an hour. Victor Korontzis and Tony Rizzoli were watching the front door.\u003c/p\u003e\n\u003cp\u003eKorontzis was getting increasingly nervous. \"What if he says no? What if he wants his money tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll handle him,\" Tony Rizzoli said. \"Just let me do the talking.\"\u003c/p\u003e\n\u003cp\u003e\"What if he doesn\u0027t show up? What if he just...you know...sends someone to kill me? Do you think he would do that?\"\u003c/p\u003e\n\u003cp\u003e\"Not as long as he has a chance of getting his money,\" Rizzoli said confidently.\u003c/p\u003e\n\u003cp\u003eAt seven o\u0027clock, Sal Prizzi finally appeared.\u003c/p\u003e\n\u003cp\u003eKorontzis hurried over to the door and opened it. \"Good evening,\" he said.\u003c/p\u003e\n\u003cp\u003ePrizzi looked at Rizzoli. \"What the fuck are you doin\u0027 here?\" He turned back to Victor Korontzis. \"This is just between us.\"\u003c/p\u003e\n\u003cp\u003e\"Take it easy,\" Rizzoli said. \"I\u0027m here to help.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need your help.\" Prizzi turned to Korontzis. \"Where\u0027s my money?\"\u003c/p\u003e\n\u003cp\u003e\"I...I don\u0027t have it. But...\"\u003c/p\u003e\n\u003cp\u003ePrizzi grabbed him by the throat. \"Listen, you little prick. You\u0027ll give me that money tonight, or I\u0027m going to feed you to the fish. Do you understand?\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli said, \"Hey, cool down. You\u0027re going to get your money.\"\u003c/p\u003e\n\u003cp\u003ePrizzi turned on him. \"I told you to stay out of this. It\u0027s none of your business.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m making it my business. I\u0027m Victor\u0027s friend. Victor doesn\u0027t have the cash right now, but he has a way to get it for you.\"\u003c/p\u003e\n\u003cp\u003e\"Has he got the money, or hasn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"He has, and he hasn\u0027t,\" Rizzoli said.\u003c/p\u003e\n\u003cp\u003e\"What the hell kind of answer is that?\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli\u0027s arm swept around the room. \"The money\u0027s there.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi scanned the room. \"Where?\"\u003c/p\u003e\n\u003cp\u003e\"In those cases. They\u0027re full of antiques...\"\u003c/p\u003e\n\u003cp\u003e\"Antiquities,\" Korontzis said automatically.\u003c/p\u003e\n\u003cp\u003e\"...that are worth a fortune. I\u0027m talking about millions.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" Prizzi turned to look at the cases. \"What good are they going to do me if they\u0027re locked away in a museum? I want cash.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to get cash,\" Rizzoli said soothingly. \"Twice what our friend owes you. You just have to be a little patient, that\u0027s all. Victor\u0027s not a welsher. He just needs a little more time. I\u0027ll tell you his plan. Victor\u0027s going to take one of these antiques...antiquities...and arrange to sell it. As soon as he gets the money, he\u0027ll pay you.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi shook his head. \"I don\u0027t like it. I don\u0027t know nothing about this antique stuff.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to. Victor\u0027s one of the world\u0027s greatest experts.\" Tony Rizzoli walked over to one of the cases and pointed to a marble head. \"What would you say that\u0027s worth, Victor?\"\u003c/p\u003e\n\u003cp\u003eVictor Korontzis swallowed. \"That\u0027s the goddess Hygea, fourteenth century B.C. Any collector would gladly pay two or three million dollars for it.\"\u003c/p\u003e\n\u003cp\u003eRizzoli turned to Sal Prizzi. \"There you are. See what I mean?\"\u003c/p\u003e\n\u003cp\u003ePrizzi frowned. \"I don\u0027t know. How long would I have to wait?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have double your money inside a month.\"\u003c/p\u003e\n\u003cp\u003ePrizzi thought a moment, then nodded. \"Okay, but if I have to wait a month, I want more - say an extra couple of hundred grand.\"\u003c/p\u003e\n\u003cp\u003eTony Rizzoli looked over at Victor Korontzis.\u003c/p\u003e\n\u003cp\u003eKorontzis was nodding his head eagerly.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Rizzoli said. \"You have a deal.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi walked over to the little curator. \"I\u0027m giving you thirty days. If I don\u0027t have my money by then, you\u0027re dog meat. Do I make myself clear?\"\u003c/p\u003e\n\u003cp\u003eKorontzis swallowed. \"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Remember...thirty days.\"\u003c/p\u003e\n\u003cp\u003eHe gave Tony Rizzoli a long, hard look. \"I don\u0027t like you.\"\u003c/p\u003e\n\u003cp\u003eThey watched as Sal Prizzi turned and walked out the door.\u003c/p\u003e\n\u003cp\u003eKorontzis sank into a chair, wiping his brow.\u003c/p\u003e\n\u003cp\u003e\"Oh, my God,\" he said. \"I thought he was going to kill me. Do you think we can get him his money in thirty days?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Tony Rizzoli promised. \"All you have to do is take one of those things out of the case and put a copy in its place.\"\u003c/p\u003e\n\u003cp\u003e\"How will you get it out of the country? You\u0027ll go to prison if they catch you.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Tony Rizzoli said stoutly. \"But it\u0027s a chance I\u0027m going to have to take. I owe you that much, Victor.\"\u003c/p\u003e\n\u003cp\u003eOne hour later, Tony Rizzoli, Sal Prizzi, Otto Dalton, Perry Breslauer, and Marvin Seymour were having drinks in Dalton\u0027s hotel suite.\u003c/p\u003e\n\u003cp\u003e\"Smooth as silk,\" Rizzoli boasted. \"The bastard pissed his pants.\"\u003c/p\u003e\n\u003cp\u003eSal Prizzi grinned. \"I scared him, huh?\"\u003c/p\u003e\n\u003cp\u003e\"You scared me,\" Rizzoli said. \"You should be a fucking actor.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the deal now?\" Marvin Seymour asked.\u003c/p\u003e\n\u003cp\u003eRizzoli replied, \"The deal is, he gives me one of those antiques. I\u0027ll find a way to smuggle it out of the country and sell it. Then I\u0027ll give you each your cut.\"\u003c/p\u003e\n\u003cp\u003e\"Beautiful,\" Perry Breslauer said. \"I love it.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s like having a gold mine, Rizzoli thought. Once Korontzis goes along with this, he\u0027s hooked. There\u0027s no way he can ever back out. I\u0027m going to make him clean out the whole goddamned museum.\u003c/p\u003e\n\u003cp\u003eMarvin Seymour asked, \"How are you going to get the stuff out of the country?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll find a way,\" Tony Rizzoli said. \"I\u0027ll find a way.\"\u003c/p\u003e\n\u003cp\u003eHe had to. And fast. Alfredo Mancuso and Gino La-veri were waiting. \u003c/p\u003e","sourceLink":"https://allnovel.net/memories-of-midnight/page-13.html","bookId":2362,"creation":"Oct 5, 2019 10:09:29 AM","modification":"Oct 5, 2019 10:09:29 AM"}
