{"id":68498,"no":24,"title":"Page 24","content":"\u003cp\u003eConstantin Demiris\u0027s beach house was located three miles north of Piraeus on an acre of waterfront property. Demiris arrived at seven P.M. He pulled up in the driveway, opened the car door, and started toward the beach house.\u003c/p\u003e\n\u003cp\u003eAs he reached it, the door was opened by a man he did not recognize.\u003c/p\u003e\n\u003cp\u003e\"Good evening, Mr. Demiris.\"\u003c/p\u003e\n\u003cp\u003eInside, Demiris could see half a dozen police officers.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on here?\" Demiris demanded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Police Lieutenant Theophilos. I...\"\u003c/p\u003e\n\u003cp\u003eDemiris pushed him aside and walked into the living room. It was a shambles. A terrible struggle had obviously taken place. Chairs and tables were overturned. One of Melina\u0027s dresses was lying on the floor, torn. Demiris picked it up and stared at it.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s my wife? I was supposed to meet her here.\"\u003c/p\u003e\n\u003cp\u003eThe police lieutenant said, \"She\u0027s not here. We\u0027ve searched the house and we\u0027ve looked up and down the beach. It looks like the house has been burglarized.\"\u003c/p\u003e\n\u003cp\u003e\"Well, where\u0027s Melina? Did she call you? Was she here?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, we think she was here, sir.\" He held up a lady\u0027s wristwatch. The crystal had been smashed and the hands had stopped at three o\u0027clock. \"Is this your wife\u0027s watch?\"\u003c/p\u003e\n\u003cp\u003e\"It looks like it.\"\u003c/p\u003e\n\u003cp\u003e\"On the back is engraved \u0027To Melina with love, Costa.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Then it is. It was a birthday present.\"\u003c/p\u003e\n\u003cp\u003eDetective Theophilos pointed to some spots on the rug. \"Those are blood stains.\" He picked up a knife lying on the floor, careful not to touch the handle. The blade was covered with blood.\u003c/p\u003e\n\u003cp\u003e\"Have you ever seen this knife before, sir?\"\u003c/p\u003e\n\u003cp\u003eDemiris gave it a brief glance. \"No. Are you saying she\u0027s dead?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s certainly a possibility, sir. We found drops of blood on the sand leading down to the water.\"\u003c/p\u003e\n\u003cp\u003e\"My God,\" Demiris said.\u003c/p\u003e\n\u003cp\u003e\"Luckily for us, there are some clear fingerprints on the knife.\"\u003c/p\u003e\n\u003cp\u003eDemiris sat down heavily. \"Then you\u0027ll catch whoever did it.\"\u003c/p\u003e\n\u003cp\u003e\"We will if his fingerprints are on file. There are fingerprints all over the house. We have to sort them out. If you don\u0027t mind giving us your fingerprints, Mr. Demiris, we can eliminate those right away.\"\u003c/p\u003e\n\u003cp\u003eDemiris hesitated. \"Yes, of course.\"\u003c/p\u003e\n\u003cp\u003e\"The sergeant right over there can take care of it.\"\u003c/p\u003e\n\u003cp\u003eDemiris walked over to a uniformed policeman who had a fingerprint pad. \"If you\u0027ll just place your fingers right here, sir.\" A moment later, it was done. \"You understand it\u0027s just a formality.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003eLieutenant Theophilos handed Demiris a small business card. \"Would you know anything about this, Mr. Demiris?\"\u003c/p\u003e\n\u003cp\u003eDemiris looked at the card. It read, KATELANOS DETECTIVE AGENCY - PRIVATE INVESTIGATIONS. He handed the card back. \"No. Does it have any significance?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. We\u0027re checking into it.\"\u003c/p\u003e\n\u003cp\u003e\"Naturally, I want you to do everything you can to find out who\u0027s responsible. And let me know if you get word of my wife.\"\u003c/p\u003e\n\u003cp\u003eLieutenant Theophilos looked at him and nodded. \"Don\u0027t worry, sir. We will.\"\u003c/p\u003e\n\u003cp\u003eMelina. The golden girl, attractive and bright and amusing. It had been so wonderful in the beginning. And then she had murdered their son, and for that there could never be forgiveness...only her death.\u003c/p\u003e\n\u003cp\u003eThe call came in at noon the following day. Constantin Demiris was in the middle of a conference when his secretary buzzed him. \"Excuse me, Mr. Demiris...\"\u003c/p\u003e\n\u003cp\u003e\"I told you I didn\u0027t want to be disturbed.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir, but there\u0027s an Inspector Lavanos on the phone. He says it\u0027s urgent. Do you want me to tell him to...?\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027ll take it.\" Demiris turned to the men sitting around the conference table. \"Excuse me a moment, gentlemen.\" He picked up the receiver. \"Demiris.\"\u003c/p\u003e\n\u003cp\u003eA voice said, \"This is Chief Inspector Lavanos, Mr. Demiris, at Central Station. We have some information we think you might be interested in. I wondered whether it would be convenient for you to come down to police headquarters?\"\u003c/p\u003e\n\u003cp\u003e\"You have news of my wife?\"\u003c/p\u003e\n\u003cp\u003e\"I would prefer not to discuss it over the telephone, if you don\u0027t mind.\"\u003c/p\u003e\n\u003cp\u003eDemiris hesitated for only a moment. \"I\u0027ll be right down.\" He replaced the receiver and turned to the others. \"Something urgent has come up. Why don\u0027t you go on into the dining room and discuss my proposal and I\u0027ll be back in time to join you for lunch.\"\u003c/p\u003e\n\u003cp\u003eThere was a general murmur of agreement. Five minutes later, Demiris was on his way to police headquarters.\u003c/p\u003e\n\u003cp\u003eThere were half a dozen men waiting for him in the office of the police commissioner. Demiris recognized the policemen he had already seen at the beach house. \"...and this is Special Prosecutor Delma.\"\u003c/p\u003e\n\u003cp\u003eDelma was a short, stocky man, with heavy eyebrows, a round face, and cynical eyes.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened?\" Demiris demanded. \"Do you have some news of my wife?\"\u003c/p\u003e\n\u003cp\u003eThe chief inspector said, \"To be perfectly frank, Mr. Demiris, we have come across some things that puzzle us. We hoped you might be able to help us.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid there\u0027s very little I can do to help you. This whole thing is so shocking...\"\u003c/p\u003e\n\u003cp\u003e\"You had an appointment to meet your wife at the beach house around three o\u0027clock yesterday afternoon?\"\u003c/p\u003e\n\u003cp\u003e\"What? No. Mrs. Demiris telephoned and asked me to meet her there at seven o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eProsecutor Delma said smoothly, \"Now, that\u0027s one of the things that\u0027s puzzling us. A maid at your home told us that you telephoned your wife about two o\u0027clock and asked her to go to the beach house alone and wait for you.\"\u003c/p\u003e\n\u003cp\u003eDemiris frowned. \"She\u0027s confused. My wife telephoned me and asked me to meet her there at seven o\u0027clock last night.\"\u003c/p\u003e\n\u003cp\u003e\"I see. So the maid was mistaken.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what reason your wife might have had for asking you to go to the beach house?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose she wanted to try to talk me out of divorcing her.\"\u003c/p\u003e\n\u003cp\u003e\"You had told your wife you were going to divorce her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"The maid says she overheard a telephone conversation during which Mrs. Demiris told you she was going to divorce you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t give a damn what the maid said. You\u0027ll have to take my word for it.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Demiris, do you keep swimming trunks at the beach house?\" the chief inspector asked.\u003c/p\u003e\n\u003cp\u003e\"At the beach house? No. I gave up swimming in the sea years ago. I use the pool at the town house.\"\u003c/p\u003e\n\u003cp\u003eThe chief inspector opened a desk drawer and took out a pair of swim trunks in a plastic bag. He removed them and held them up for Demiris to see. \"Are these your trunks, Mr. Demiris?\"\u003c/p\u003e\n\u003cp\u003e\"They could be mine, I suppose.\"\u003c/p\u003e\n\u003cp\u003e\"They have your initials on them.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I think I recognize them. They are mine.\"\u003c/p\u003e\n\u003cp\u003e\"We found them at the bottom of a closet in the beach house.\"\u003c/p\u003e\n\u003cp\u003e\"So? They were probably left there a long time ago. Why...?\"\u003c/p\u003e\n\u003cp\u003e\"They were still wet from sea water. The analysis showed that it\u0027s the same water that\u0027s in front of your beach house. They are covered with blood.\"\u003c/p\u003e\n\u003cp\u003eIt was getting very hot in the room.\u003c/p\u003e\n\u003cp\u003e\"Then someone else must have put them on,\" Demiris said firmly.\u003c/p\u003e\n\u003cp\u003eThe special prosecutor said, \"Why would anyone do that? That\u0027s one of the things bothering us, Mr. Demiris.\"\u003c/p\u003e\n\u003cp\u003eThe chief inspector opened a small envelope on the desk and took out a gold button. \"One of my men found this under a rug at the beach house. Do you recognize it?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"It came from one of your jackets. We took the liberty of having a detective go to your home this morning to check out your wardrobe. A button was missing from one of your jackets. The threads match perfectly. And the jacket came back from the cleaners just a week ago.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t...\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Demiris, you said you told your wife you wanted a divorce and that she was trying to talk you out of it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s correct.\"\u003c/p\u003e\n\u003cp\u003eThe chief inspector held up the business card that Demiris had been shown at the beach house the day before. \"One of our men visited the Katelanos Detective Agency today.\"\u003c/p\u003e\n\u003cp\u003e\"I told you - I never heard of them.\"\u003c/p\u003e\n\u003cp\u003e\"Your wife hired them to protect her.\"\u003c/p\u003e\n\u003cp\u003eThe news came as a shock. \"Melina? Protect her from what?\"\u003c/p\u003e\n\u003cp\u003e\"From you. According to the owner of the agency, your wife was threatening to divorce you, and you told her that if she went through with it you would kill her. He asked her why she didn\u0027t go to the police for protection, and she said she wanted to keep the matter private. She didn\u0027t want the publicity.\"\u003c/p\u003e\n\u003cp\u003eDemiris rose to his feet. \"I\u0027m not going to stay here and listen to these lies. There\u0027s no...\"\u003c/p\u003e\n\u003cp\u003eThe chief inspector reached into a drawer and took out the blood-stained knife that had been found at the beach house.\u003c/p\u003e\n\u003cp\u003e\"You told the officer at the beach house that you had never seen this before?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Your fingerprints are on this knife.\"\u003c/p\u003e\n\u003cp\u003eDemiris was staring at the knife. \"My - my fingerprints? There\u0027s some mistake. That\u0027s impossible!\"\u003c/p\u003e\n\u003cp\u003eHis mind was racing. He swiftly ran through the evidence that was piling up against him: the maid saying that he had called his wife at two o\u0027clock and told her to come to the beach house alone...a pair of his swimming trunks with blood on them...a button torn from his jacket...a knife with his fingerprints...\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you see, you idiots? It\u0027s a frame-up,\" he shouted. \"Someone carried those trunks to the beach house, spilled a little blood on them and on the knife, ripped a button off my jacket, and...\"\u003c/p\u003e\n\u003cp\u003eThe special prosecutor interrupted. \"Mr. Demiris, can you explain how your fingerprints got on that knife?\"\u003c/p\u003e\n\u003cp\u003e\"I - I don\u0027t know...Wait. Yes. I remember now. Melina asked me to cut open a package for her. That must be the knife she handed me. That\u0027s why my fingerprints are on it.\"\u003c/p\u003e\n\u003cp\u003e\"I see. What was in the package?\"\u003c/p\u003e\n\u003cp\u003e\"I...I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know what was in the package?\"\u003c/p\u003e\n\u003cp\u003e\"No. I just cut the rope around it. She never opened it.\"\u003c/p\u003e\n\u003cp\u003e\"Can you explain the blood stains on the carpet, or in the sand leading down to the water, or...?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s obvious.\" Demiris shot back. \"All Melina had to do was cut herself a little and then walk out toward the water so you would think I murdered her. She\u0027s trying to get even with me because I told her I was going to divorce her. Right now, she\u0027s hiding somewhere, laughing because she thinks you\u0027re going to arrest me. Melina\u0027s as alive as I am.\"\u003c/p\u003e\n\u003cp\u003eThe special prosecutor said gravely, \"I wish that were true, sir. We pulled her body out of the sea this morning. She had been stabbed and drowned. I\u0027m placing you under arrest, Mr. Demiris, for the murder of your wife.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/memories-of-midnight/page-24.html","bookId":2362,"creation":"Oct 5, 2019 10:09:29 AM","modification":"Oct 5, 2019 10:09:29 AM"}
