{"id":421,"no":129,"title":"Chapter 64","content":"\u003cbr\u003e Casilia Tisalver opened her eyes wide. \"A heatsinker? Not in my apartment.\"\n\u003cbr\u003e \"Why not? Besides, hell be coming to my room,\" said Seldon. \"At fourteen hundred.\"\n\u003cbr\u003e \"I wont have it,\" said Mistress Tisalver. \"This is what comes of going down to the heatsinks. Jirad was a fool.\"\n\u003cbr\u003e \"Not at all, Mistress Tisalver. We went at my request and I was fascinated. I must see this young man, since that is necessary to my scholarly work.\"\n\u003cbr\u003e \"Im sorry if it is, but I wont have it.\"\n\u003cbr\u003e Dors Venabili raised her hand. \"Hari, let me take care of this. Mistress Tisalver, if Dr. Seldon must see someone in his room this afternoon, the additional person naturally means additional rent. We understand that. For today, then, the rent on Dr. Seldons room will be doubled.\"\n\u003cbr\u003e Mistress Tisalver thought about it. \"Well, thats decent of you, but its not only the credits. Theres the neighbors to think of. A sweaty, smelly heatsinker--\"\n\u003cbr\u003e \"I doubt that hell be sweaty and smelly at fourteen hundred, Mistress Tisalver, but let me go on. Since Dr. Seldon must see him, then if he cant see him here, hell have to see him elsewhere, but we cant run here and there. That would be too inconvenient. Therefore, what we will have to do is to get a room elsewhere. It wont be easy and we dont want to do it, but we will have to. So we will pay the rent through today and leave and of course we will have to explain to Master Hummin why we have had to change the arrangements that he so kindly made for us.\"\n\u003cbr\u003e \"Wait.\" Mistress Tisalvers face became a study of calculation. \"We wouldnt like to disoblige Master Hummin ... or you two. How long would this creature have to stay?\"\n\u003cbr\u003e \"Hes coming at fourteen hundred. He must be at work at sixteen hundred. He will be here for less than two hours, perhaps considerably less. We will meet him outside, the two of us, and bring him to Dr. Seldons room. Any neighbors who see us will think he is an Outworlder friend of ours.\"\n\u003cbr\u003e Mistress Tisalver nodded her head. \"Then let it be as you say. Double rent for Master Seldons room for today and the heatsinker will visit just this one time.\"\n\u003cbr\u003e \"Just this one time,\" said Dors.\n\u003cbr\u003e But later, when Seldon and Dors were sitting in her room, Dors said, \"Why do you have to see him, Hari? Is interviewing a heatsinker important to psychohistory too?\"\n\u003cbr\u003e Seldon thought he detected a small edge of sarcasm in her voice and he said tartly, \"I dont have to base everything on this huge project of mine, in which I have very little faith anyway. I am also a human being with human curiosities. We were down in the heatsinks for hours and you saw what the working people there were like. They were obviously uneducated. They were low-level individuals--no play on words intended--and yet here was one who recognized me. He must have seen me on holovision on the occasion of the Decennial Convention and he remembered the word psychohistory. He strikes me as unusual--as out of place somehow--and I would like to talk to him.\"\n\u003cbr\u003e \"Because it pleases your vanity to have become known even to heatsinkers in Dahl?\"\n\u003cbr\u003e \"Well ... perhaps. But it also piques my curiosity.\"\n\u003cbr\u003e \"And how do you know he hasnt been briefed and intends to lead you into trouble as has happened before.\"\n\u003cbr\u003e Seldon winced. \"I wont let him run his fingers through my hair. In any case, were more nearly prepared now, arent we? And Im sure youll be with me. I mean, you let me go Upperside alone, you let me go with Raindrop Forty-Three to the microfarms alone, and youre not going to do that again, are you?\"\n\u003cbr\u003e \"You can be absolutely sure I wont,\" said Dors.\n\u003cbr\u003e \"Well then, Ill talk to the young man and you can watch out for traps. I have every faith in you.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46440.html","bookId":12,"creation":"Aug 1, 2019 2:18:49 AM","modification":"Aug 1, 2019 2:18:49 AM"}
