{"id":433,"no":141,"title":"Chapter 70","content":"\u003cbr\u003e Mother Rittah was well into her seventies, perhaps, but had the kind of face that, at first sight, seemed to belie that. Plump cheeks, a little mouth, a small round chin slightly doubled. She was very short--not quite 1.5 meters tall--and had a thick body.\n\u003cbr\u003e But there were fine wrinkles about her eyes and when she smiled, as she smiled at the sight of them, others broke out over her face. And she moved with difficulty.\n\u003cbr\u003e \"Come in, come in,\" she said in a soft high-pitchedivoice and peered at them as though her eyesight was beginning to fail. \"Outsiders ... Outworlders even. Am I right? You dont seem to have the Trantor smell about you.\"\n\u003cbr\u003e Seldon wished she hadnt mentioned smell. The apartment, overcrowded and littered with small possessions that seemed dim and dusty, reeked with food odors that were on the edge of rancidity. The air was so thick and clinging that he was sure his clothes would smell strongly of it when they left.\n\u003cbr\u003e He said, \"You are right, Mother Rittah. I am Hari Seldon of Helicon. My friend is Dors Venabili of Cinna.\"\n\u003cbr\u003e \"So,\" she said, looking about for an unoccupied spot on the floor where she could invite them to sit, but finding none suitable.\n\u003cbr\u003e Dors said, \"We are willing to stand, Mother.\"\n\u003cbr\u003e \"What?\" she looked up at Dors. \"You must speak briskly, my child. My hearing is not what it was when I was your age.\"\n\u003cbr\u003e \"Why dont you get a hearing device?\" said Seldon, raising his voice.\n\u003cbr\u003e \"It wouldnt help, Master Seldon. Something seems to be wrong with the nerve and I have no money for nerve rebuilding.--You have come to learn the future from old Mother Rittah?\"\n\u003cbr\u003e \"Not quite,\" said Seldon. \"I have come to learn the past.\"\n\u003cbr\u003e \"Excellent. It is such a strain to decide what people want to hear.\"\n\u003cbr\u003e \"It must be quite an art,\" said Dors, smiling.\n\u003cbr\u003e \"It seems easy, but one has to he properly convincing. I earn my fees.\"\n\u003cbr\u003e \"If you have a credit outlet,\" said Seldon. \"We will pay any reasonable fees if you tell us about Earth--without cleverly designing what you tell us to suit what we want to hear. We wish to hear the truth.\"\n\u003cbr\u003e The old woman, who had been shuffling about the room, making adjustments here and there, as though to make it all prettier and more suitable for important visitors, stopped short. \"What do you want to know about Earth?\"\n\u003cbr\u003e \"What is it, to begin with?\"\n\u003cbr\u003e The old woman turned and seemed to gaze off into space. When she spoke, her voice was low and steady.\n\u003cbr\u003e \"It is a world, a very old planet. It is forgotten and lost.\"\n\u003cbr\u003e Dors said, \"It is not part of history. We know that much.\"\n\u003cbr\u003e \"It comes before history, child,\" said Mother Rittah solemnly. \"It existed in the dawn of the Galaxy and before the dawn. It was the only world with humanity.\" She nodded firmly.\n\u003cbr\u003e Seldon said, \"Was another name for Earth ... Aurora?\"\n\u003cbr\u003e And now Mother Rittahs face misted into a frown. \"Where did you hear that?\"\n\u003cbr\u003e \"In my wanderings. I have heard of an old forgotten world named Aurora on which humanity lived in primordial peace.\"\n\u003cbr\u003e \"Its a lie.\" She wiped her mouth as though to get the taste of what she had just heard out of it. \"That name you mention must never be mentioned except as the place of Evil. It was the beginning of Evil. Earth was alone till Evil came, along with its sister worlds. Evil nearly destroyed Earth, but Earth rallied and destroyed Evil--with the help of heroes.\"\n\u003cbr\u003e \"Earth was before this Evil. Are you sure of that?\"\n\u003cbr\u003e \"Long before. Earth was alone in the Galaxy for thousands of years--millions of years.\"\n\u003cbr\u003e \"Millions of years? Humanity existed on it for millions of years with no other people on any other world?\"\n\u003cbr\u003e \"Thats true. Thats true. Thats true.\"\n\u003cbr\u003e \"But how do you know all this? Is it all in a computer program? Or a printout? Do you have anything I can read?\"\n\u003cbr\u003e Mother Rittah shook her head. \"I heard the old stories from my mother, who heard it from hers, and so on far back. I have no children, so I tell the stories to others, but it may come to an end. This is a time of disbelief.\"\n\u003cbr\u003e Dors said, \"Not really, Mother. There are people who speculate about prehistoric times and who study some of the tales of lost worlds.\"\n\u003cbr\u003e Mother Rittah made a motion of her arm as though to wipe it away. \"They look at it with cold eyes. Scholarly. They try to fit it in with their notions. I could tell you stories for a year of the great hero Ba-Lee, but you would have no time to listen and I have lost the strength to tell.\"\n\u003cbr\u003e Seldon said, \"Have you ever heard of robots?\"\n\u003cbr\u003e The old woman shuddered and her voice was almost a scream. \"Why do you ask such things? Those were artificial human beings, evil in themselves and the work of the Evil worlds. They were destroyed and should never be mentioned.\"\n\u003cbr\u003e \"There was one special robot, wasnt there, that the Evil worlds hated?\"\n\u003cbr\u003e Mother Rittah tottered toward Seldon and peered into his eyes. He could feel her hot breath on his face. \"Have you come to mock me? You know of these things and yet you ask? Why do you ask?\"\n\u003cbr\u003e \"Because I wish to know.\"\n\u003cbr\u003e \"There was an artificial human being who helped Earth. He was Da-Nee, friend of Ba-Lee. He never died and lives somewhere, waiting for his time to return. None knows when that time will be, but someday he will come and restore the great old days and remove all cruelty, injustice, and misery. That is the promise.\"\n\u003cbr\u003e At this, she closed her eyes and smiled, as if remembering ...\n\u003cbr\u003e Seldon waited a while in silence, then sighed and said, \"Thank you, Mother Rittah. You have been very helpful. What is your fee?\"\n\u003cbr\u003e \"So pleasant to meet Outworlders,\" the old woman replied. \"Ten credits. May I offer you some refreshment?\"\n\u003cbr\u003e \"No, thank you,\" said Seldon earnestly. \"Please take twenty. You need only tell us how to get back to the Expressway from here.--And, Mother Rittah, if you can arrange to have some of your tales of Earth put into a computer disc, I will pay you well.\"\n\u003cbr\u003e \"I would need so much strength. How well?\"\n\u003cbr\u003e \"It would depend on how long the story is and how well it is told. I might pay a thousand credits.\"\n\u003cbr\u003e Mother Rittah licked her lips. \"A thousand credits? But how will I find you when the story is told?\"\n\u003cbr\u003e \"I will give you the computer code number at which I can be reached.\"\n\u003cbr\u003e After Seldon gave Mother Rittah the code number, he and Dors left, thankful for the comparatively clean odor of the alley outside. They walked briskly in the direction indicated by the old woman.\n\u003cbr\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46452.html","bookId":12,"creation":"Aug 1, 2019 2:19:20 AM","modification":"Aug 1, 2019 2:19:20 AM"}
