{"id":439,"no":147,"title":"Chapter 73","content":"\u003cbr\u003e Raych entered, looking about, clearly intimidated. The forefinger of his right hand reached for his upper lip as though wondering when he would begin to feel the first downy hairs there.\n\u003cbr\u003e He turned to the clearly outraged Mistress Tisalver and bowed clumsily. \"Thank ya, Missus. Ya got a lovely place.\"\n\u003cbr\u003e Then, as the door slammed behind him, he turned to Seldon and Dors with an air of easy connoisseurship. \"Nice place, guys.\"\n\u003cbr\u003e \"Im glad you like it,\" said Seldon solemnly. \"How did you know we were here?\"\n\u003cbr\u003e \"Followed ya. Howd ya think? Hey, lady\"--he turned to Dors--\"you dont fight like no dame.\"\n\u003cbr\u003e \"Have you watched many dames fight?\" asked Dors, amused.\n\u003cbr\u003e Raych rubbed his nose, \"No, never seen none whatever. They dont carry knives, except little ones to scare kids with. Never scared me.\"\n\u003cbr\u003e \"Im sure they didnt. What do you do to make dames draw their knives?\"\n\u003cbr\u003e \"Nothin. You just kid around a little. You holler, Hey, lady, lemme-- \" He thought about it for a moment and said, \"Nothin.\"\n\u003cbr\u003e Dors said, \"Well, dont try that on me.\"\n\u003cbr\u003e \"Ya kiddin? After what ya did to Marron? Hey, lady, whered you learn to fight that way?\"\n\u003cbr\u003e \"On my own world.\"\n\u003cbr\u003e \"Could ya teach me?\"\n\u003cbr\u003e \"Is that what you came here to see me about?\"\n\u003cbr\u003e \"Akchaly, no. I came to bring ya a kind of message.\"\n\u003cbr\u003e \"From someone who wants to fight me?\"\n\u003cbr\u003e \"No one wants to fight ya, lady. Listen, lady, ya got a reputation now. Everybody knows ya. You just walk down anywhere in old Billibotton and all the guys will step aside and let ya pass and grin and make sure they dont look cross-eyed at ya. Oh, lady, ya got it made. Thats why he wants to see ya.\"\n\u003cbr\u003e Seldon said, \"Raych, just exactly who wants to see us?\"\n\u003cbr\u003e \"Guy called Davan.\"\n\u003cbr\u003e \"And who is he?\"\n\u003cbr\u003e \"Just a guy. He lives in Billibotton and dont carry no knife.\"\n\u003cbr\u003e \"And he stays alive, Raych?\"\n\u003cbr\u003e \"He reads a lot and he helps the guys there when they get in trouble with the govment. They kinda leave him alone. He dont need no knife.\"\n\u003cbr\u003e \"Why didnt he come himself, then?\" said Dors. \"Why did he send you?\"\n\u003cbr\u003e \"He dont like this place. He says it makes him sick. He says all the people here, they lick the govments--\" He paused, looked dubiously at the two Outworlders, and said, \"Anyway, he wont come here. He said theyd let me in cause I was only a kid.\" He grinned. \"They almost didnt, did they? I mean that lady there who looked like she was smellin somethin?\" He stopped suddenly, abashed, and looked down at himself. \"Ya dont get much chance to wash where I come from.\"\n\u003cbr\u003e \"Its all right,\" said Dors, smiling. \"Where are we supposed to meet, then, if he wont come here? After all--if you dont mind--we dont feel like going to Billibotton.\"\n\u003cbr\u003e \"I told ya,\" said Raych indignantly. \"Ya get free run of Billibotton, I swear. Besides, where he lives no one will bother ya.\"\n\u003cbr\u003e \"Where is it?\" asked Seldon.\n\u003cbr\u003e \"I can take ya there. It aint far.\"\n\u003cbr\u003e \"And why does he want to see us?\" asked Dors.\n\u003cbr\u003e \"Dunno. But he says like this--\" Raych half-closed his eyes in an effort to remember. \" Tell them I wanna see the man who talked to a Dahlite heatsinker like he was a human being and the woman who beat Marron with knives and didnt kill him when she mighta done so. I think I got it right.\"\n\u003cbr\u003e Seldon smiled. \"I think you did. Is he ready for us now?\"\n\u003cbr\u003e \"Hes waiting.\"\n\u003cbr\u003e \"Then well come with you.\" He looked at Dors with a trace of doubt in his eyes.\n\u003cbr\u003e She said, \"All right. Im willing. Perhaps it wont be a trap of some sort. Hope springs eternal--\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46458.html","bookId":12,"creation":"Aug 1, 2019 2:19:40 AM","modification":"Aug 1, 2019 2:19:40 AM"}
