{"id":441,"no":149,"title":"Chapter 74","content":"\u003cbr\u003e There was a pleasant glow to the evening light when they emerged, a faint violet touch and a pinkish edge to the simulated sunset clouds that were scudding along. Dahl might have complaints of their treatment by the Imperial rulers of Trantor, but surely there was nothing wrong with the weather the computers spun out for them.\n\u003cbr\u003e Dors said in a low voice, \"We seem to be celebrities. No mistake about that.\"\n\u003cbr\u003e Seldon brought his eyes down from the supposed sky and was immediately aware of a fair-sized crowd around the apartment house in which the Tisalvers lived. Everyone in the crowd stared at them intently. When it was clear that the two Outworlders had become aware of the attention, a low murmur ran through the crowd, which seemed to be on the point of breaking out into applause.\n\u003cbr\u003e Dors said, \"Now I can see where Mistress Tisalver would find this annoying. I should have been a little more sympathetic.\"\n\u003cbr\u003e The crowd was, for the most part, poorly dressed and it was not hard to guess that many of the people were from Billibotton. On impulse, Seldon smiled and raised one hand in a mild greeting that was met with applause. One voice, lost in the safe anonymity of the crowd called out, \"Can the lady show us some knife tricks?\"\n\u003cbr\u003e When Dors called back, \"No, I only draw in anger,\" there was instant laughter. One man stepped forward. He was clearly not from Billibotton and bore no obvious mark of being a Dahlite. He had only a small mustache, for one thing, and it was brown, not black. He said, \"Marlo Tanto of the Trantorian HV News. Can we have you in focus for a bit for our nightly holocast?\"\n\u003cbr\u003e \"No,\" said Dors shortly. \"No interviews.\"\n\u003cbr\u003e The newsman did not budge. \"I understand you were in a fight with a great many men in Billibotton--and won.\" He smiled. \"Thats news, that is.\"\n\u003cbr\u003e \"No,\" said Dors. \"We met some men in Billibotton, talked to them, and then moved on. Thats all there is to it and thats all youre going to get.\"\n\u003cbr\u003e \"Whats your name? You dont sound like a Trantorian.\"\n\u003cbr\u003e \"I have no name.\"\n\u003cbr\u003e \"And your friends name?\"\n\u003cbr\u003e \"He has no name.\"\n\u003cbr\u003e The newsman looked annoyed, \"Look, lady. Youre news and Im just trying to do my job.\"\n\u003cbr\u003e Raych pulled at Dorss sleeve. She leaned down and listened to his earnest whisper.\n\u003cbr\u003e She nodded and straightened up again. \"I dont think youre a newsman, Mr. Tanto. What I think you are is an Imperial agent trying to make trouble for Dahl. There was no fight and youre trying to manufacture news concerning one as a way of justifying an Imperial expedition into Billibotton. I wouldnt stay here if I were you. I dont think youre very popular with these people.\"\n\u003cbr\u003e The crowd had begun to mutter at Dorss first words. They grew louder now and began to drift, slowly and in a menacing way, in the direction of Tanto. He looked nervously around and began to move away.\n\u003cbr\u003e Dors raised her voice. \"Let him go. Dont anyone touch him. Dont give him any excuse to report violence.\"\n\u003cbr\u003e And they parted before him.\n\u003cbr\u003e Raych said, \"Aw, lady, you shoulda let them rough him up.\"\n\u003cbr\u003e \"Bloodthirsty boy,\" said Dors, \"take us to this friend of yours.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46460.html","bookId":12,"creation":"Aug 1, 2019 2:19:45 AM","modification":"Aug 1, 2019 2:19:45 AM"}
