{"id":481,"no":189,"title":"Chapter 94","content":"\u003cbr\u003e Dors said, \"The palace is cleared. Rashelle will not be physically harmed. And youll return to the Imperial Sector, Hari.\"\n\u003cbr\u003e \"And you, Dors?\" said Seldon in a low tight voice.\n\u003cbr\u003e \"I presume I will go back to the University,\" she said. \"My work is being neglected, my classes abandoned.\"\"No, Dors, you have a greater task.\"\n\u003cbr\u003e \"What is that?\"\n\u003cbr\u003e \"Psychohistory. I cannot tackle the project without you.\"\n\u003cbr\u003e \"Of course you can. I am a total illiterate in mathematics.\"\n\u003cbr\u003e \"And I in history--and we need both.\"\n\u003cbr\u003e Dors laughed. \"I suspect that, as a mathematician, you are one of a kind. I, as a historian, am merely adequate, certainly not outstanding. You will find any number of historians who will suit the needs of psychohistory better than I do.\"\n\u003cbr\u003e \"In that case, Dors, let me explain that psychohistory needs more than a mathematician and a historian. It also needs the will to tackle what will probably be a lifetime problem. Without you, Dors, I will not have that will.\"\n\u003cbr\u003e \"Of course youll have it.\"\n\u003cbr\u003e \"Dors, if youre not with me, I dont intend to have it.\"\n\u003cbr\u003e Dors looked at Seldon thoughtfully. \"This is a fruitless discussion, Hari. Undoubtedly, Hummin will make the decision. If he sends me back to the University.\"\n\u003cbr\u003e \"He wont.\"\n\u003cbr\u003e \"How can you be sure?\"\n\u003cbr\u003e \"Because Ill put it to him plainly. If he sends you back to the University, Ill go back to Helicon and the Empire can go ahead and destroy itself.\"\n\u003cbr\u003e \"You cant mean it.\"\n\u003cbr\u003e \"But I certainly do.\"\n\u003cbr\u003e \"Dont you realize that Hummin can arrange to have your feelings change so that you will work on psychohistory--even without me?\"\n\u003cbr\u003e Seldon shook his head. \"Hummin will not make such an arbitrary decision. Ive spoken to him. He dares not do much to the human mind because he is bound by what he calls the Laws of Robotics. To change my mind to the point where I will not want you with me, Dors, would mean a change of the kind he can not risk. On the other hand, if he leaves me alone and if you join me in the project, he will have what he wants--a true chance at psychohistory. Why should he not settle for that?\"\n\u003cbr\u003e Dors shook her head. \"He may not agree for reasons of his own.\"\n\u003cbr\u003e \"Why should he disagree? You were asked to protect me, Dors. Has Hummin canceled that request?\"\n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \"Then he wants you to continue your protection. And I want your protection.\"\n\u003cbr\u003e \"Against what? You now have Hummins protection, both as Demerzel and as Daneel, and surely that is all you need.\"\n\u003cbr\u003e \"If I had the protection of every person and every force in the Galaxy, it would still be yours I would want.\"\n\u003cbr\u003e \"Then you dont want me for psychohistory. You want me for protection.\"\n\u003cbr\u003e Seldon scowled. \"No! Why are you twisting my words? Why are you forcing me to say what you must know? It is neither psychohistory nor protection I want you for. Those are excuses and Ill use any other I need. I want you--just you. And if you want the real reason, it is because you are you.\"\n\u003cbr\u003e \"You dont even know me.\"\n\u003cbr\u003e \"That doesnt matter. I dont care.--And yet I do know you in a way. Better than you think.\"\n\u003cbr\u003e \"Do you indeed?\"\n\u003cbr\u003e \"Of course. You follow orders and you risk your life without hesitation and with no apparent care for the consequences. You learned how to play tennis so quickly. You learned how to use knives even more quickly and you handled yourself perfectly in the fight with Marron. Inhumanly--if I may say so. Your muscles are amazingly strong and your reaction time is amazingly fast. You can somehow tell when a room is being eavesdropped and you can be in touch with Hummin in some way that does not involve instrumentation.\"\n\u003cbr\u003e Dors said, \"And what do you think of all that?\"\n\u003cbr\u003e \"It has occurred to me that Hummin, in his persona as R. Daneel Olivaw, has an impossible task. How can one robot try to guide the Empire? He must have helpers.\"\n\u003cbr\u003e \"That is obvious. Millions, I should imagine. I am a helper. You are a helper. Little Raych is a helper.\"\n\u003cbr\u003e \"You are a different kind of helper.\"\n\u003cbr\u003e \"In what way? Hari, say it. If you hear yourself say it, you will realize how crazy it is.\"\n\u003cbr\u003e Seldon looked long at her and then said in a low voice, \"I will not say it because ... I dont care.\"\n\u003cbr\u003e \"You really dont? You wish to take me as I am?\"\n\u003cbr\u003e \"I will take you as I must. You are Dors and, whatever else you are, in all the world I want nothing else.\"\n\u003cbr\u003e Dors said softly, \"Hari, I want what is good for you because of what I am, but I feel that if I wasnt what I am, I would still want what is good for you. And I dont think I am good for you.\"\n\u003cbr\u003e \"Good for me or bad, I dont care.\" Here Hari looked down as he paced a few steps, weighing what he would say next. \"Dors, have you ever been kissed?\"\n\u003cbr\u003e \"Of course, Hari. Its a social part of life and I live socially.\"\n\u003cbr\u003e \"No, no! I mean, have you ever really kissed a man? You know, passionately?\"\n\u003cbr\u003e \"Well yes, Hari, I have.\"\n\u003cbr\u003e \"Did you enjoy it?\"\n\u003cbr\u003e Dors hesitated. She said, \"When Ive kissed in that way, I enjoyed it more than I would have enjoyed disappointing a young man I liked, someone whose friendship meant something to me.\" At this point, Dors blushed and she turned her face away. \"Please, Hari, this is difficult for me to explain.\"\n\u003cbr\u003e But Hari, more determined now than ever, pressed further. \"So you kissed for the wrong reasons, then, to avoid hurt feelings.\"\n\u003cbr\u003e \"Perhaps everyone does, in a sense.\"\n\u003cbr\u003e Seldon mulled this over, then said suddenly, \"Did you ever ask to be kissed?\"\n\u003cbr\u003e Dors paused, as though looking back on her life. \"No.\"\n\u003cbr\u003e \"Or wish to be kissed again, once you had?\"\n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \"Have you ever slept with a man?\" he asked softly, desperately.\n\u003cbr\u003e \"Of course. I told you. These things are a part of life.\"\n\u003cbr\u003e Hari gripped her shoulders as if he was going to shake her. \"But have you ever felt the desire, a need for that kind of closeness with just one special person? Dors, have you ever felt love.\"\n\u003cbr\u003e Dors looked up slowly, almost sadly, and locked eyes with Seldon. \"Im sorry, Hari, but no.\"\n\u003cbr\u003e Seldon released her, letting his arms fall dejectedly to his sides. Then Dors placed her hand gently on his arm and said, \"So you see, Hari. Im not really what you want.\"\n\u003cbr\u003e Seldons head drooped and he stared at the floor. He weighed the matter and tried to think rationally. Then he gave up. He wanted what he wanted and he wanted it beyond thought and beyond rationality. He looked up.\n\u003cbr\u003e \"Dors, dear, even so, I dont care.\" Seldon put his arms around her and brought his head close to hers slowly, as though waiting for her to pull away, all the while drawing her nearer.\n\u003cbr\u003e Dors made no move and he kissed her--slowly, lingeringly, and then passionately--and her arms suddenly tightened around him. When he stopped at last, she looked at him with eyes that mirrored her smile and she said:\n\u003cbr\u003e \"Kiss me again, Hari. Please.\"\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eThe End\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46503.html","bookId":12,"creation":"Aug 1, 2019 2:21:28 AM","modification":"Aug 1, 2019 2:21:28 AM"}
