{"id":343,"no":51,"title":"Chapter 25","content":"\u003cbr\u003e It was not quite the end of daylight when Dors Venabili sought out Jenarr Leggen. He answered her rather anxious greeting with a grunt and a brief nod. \"Well,\" she said a trifle impatiently. \"How was he?\"\n\u003cbr\u003e Leggen, who was entering data into his computer, said, \"How was who?\"\n\u003cbr\u003e \"My library student Hari. Dr. Hari Seldon. He went up with you. Was he any help to you?\"\n\u003cbr\u003e Leggen removed his hands from the keys of his computer and swivelled about. \"That Heliconian fellow? He was of no use at all. Showed no interest whatever. He kept looking at the scenery when there was no scenery to look at. A real oddball. Why did you want to send him up?\"\n\u003cbr\u003e \"It wasnt my idea. He wanted to. I cant understand it. He was very interested. Where is he now?\"\n\u003cbr\u003e Leggen shrugged. \"How would I know? Somewhere around.\"\n\u003cbr\u003e \"Where did he go after he came down with you? Did he say?\"\n\u003cbr\u003e \"He didnt come down with us. I told you he wasnt interested.\"\n\u003cbr\u003e \"Then when did he come down?\"\n\u003cbr\u003e \"I dont know. I wasnt watching him. I had an enormous amount of work to do. There must have been a windstorm and some sort of downpour about two days ago and neither was expected. Nothing our instruments showed offered a good explanation for it or for the fact that some sunshine we were expecting today didnt appear. Now Im trying to make sense of it and youre bothering me.\"\n\u003cbr\u003e \"You mean you didnt see him go down?\"\n\u003cbr\u003e \"Look. He wasnt on my mind. The idiot wasnt correctly dressed and I could see that inside of half an hour he wasnt going to be able to take the cold. I gave him a sweater, but that wasnt going to help much for his legs and feet. So I left the elevator open for him and I told him how to use it and explained that it would take him down and then return automatically. It was all very simple and Im sure he did get cold and he did go down and the elevator did come back and then eventually we all went down.\"\n\u003cbr\u003e \"But you dont know exactly when he went down?\"\n\u003cbr\u003e \"No, I dont. I told you. I was busy. He certainly wasnt up there when we left, though, and by that time twilight was coming on and it looked as though it might sleet. So he had to have gone down.\"\n\u003cbr\u003e \"Did anyone else see him go down?\"\n\u003cbr\u003e \"I dont know. Clowzia may have. She was with him for a while. Why dont you ask her?\"\n\u003cbr\u003e Dors found Clowzia in her quarters, just emerging from a hot shower.\n\u003cbr\u003e \"It was cold up there,\" she said.\n\u003cbr\u003e Dors said, \"Were you with Hari Seldon Upperside?\"\n\u003cbr\u003e Clowzia said, eyebrows lifting, \"Yes, for a while. He wanted to wander about and ask questions about the vegetation up there. Hes a sharp fellow, Dors. Everything seemed to interest him, so I told him what I could till Leggen called me back. He was in one of his knock-your-head-off tempers. The weather wasnt working and he--\"\n\u003cbr\u003e Dors interrupted. \"Then you didnt see Hari go down in the elevator?\"\n\u003cbr\u003e \"I didnt see him at all after Leggen called me over.--But he has to be down here. He wasnt up there when we left.\"\n\u003cbr\u003e \"But I cant find him anywhere.\"\n\u003cbr\u003e Clowzia looked perturbed. \"Really?--But hes got to be somewhere down here.\"\n\u003cbr\u003e \"No, he doesnt have to be somewhere down here,\" said Dors, her anxiety growing.\n\u003cbr\u003e \"What if hes still up there?\"\n\u003cbr\u003e \"Thats impossible. He wasnt. Naturally, we looked about for him before we left. Leggen had shown him how to go down. He wasnt properly dressed and it was rotten weather. Leggen told him if he got cold not to wait for us. He was getting cold. I know! So what else could he do but go down?\"\n\u003cbr\u003e \"But no one saw him go down.--Did anything go wrong with him up there?\"\n\u003cbr\u003e \"Nothing. Not while I was with him. He was perfectly fine except that he had to be cold, of course.\"\n\u003cbr\u003e Dors, by now quite unsettled, said, \"Since no one saw him go down, he might still be up there. Shouldnt we go up and look?\"\n\u003cbr\u003e Clowzia said nervously, \"I told you we looked around before we went down. It was still quite light and he was nowhere in sight.\"\n\u003cbr\u003e \"Lets look anyway.\"\n\u003cbr\u003e \"But I cant take you up there. Im just an intern and I dont have the combination for the Upperside dome opening. Youll have to ask Dr. Leggen.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46280.html","bookId":12,"creation":"Aug 1, 2019 2:15:04 AM","modification":"Aug 1, 2019 2:15:04 AM"}
