{"id":347,"no":55,"title":"Chapter 27","content":"\u003cbr\u003e The three went up the elevator in an inimical silence. Leggen had eaten only part of his dinner and had left his wife at the dining area without adequate explanation. Benastra had eaten no dinner at all and had possibly disappointed some woman companion, also without adequate explanation. Dors Venabili had not eaten either and she seemed the most tense and unhappy of the three. She carried a thermal blanket and two photonic founts.\n\u003cbr\u003e When they reached the entrance to Upperside, Leggen, jaw muscles tightening, entered his identification number and the door opened. A cold wind rushed at them and Benastra grunted. None of the three was adequately dressed, but the two men had no intention of remaining up there long.\n\u003cbr\u003e Dors said tightly, \"Its snowing.\"\n\u003cbr\u003e Leggen said, \"Its wet snow. The temperatures just about at the freezing point. Its not a killing frost.\"\n\u003cbr\u003e \"It depends on how long one remains in it, doesnt it?\" said Dors. \"And being soaked in melting snow wont help.\"\n\u003cbr\u003e Leggen grunted. \"Well, where is he?\" He stared resentfully out into utter blackness, made even worse by the light from the entrance behind him. Dors said, \"Here, Dr. Benastra, hold this blanket for me. And you, Dr. Leggen, close the door behind you without locking it.\"\n\u003cbr\u003e \"Theres no automatic lock on it. Do you think were foolish?\"\n\u003cbr\u003e \"Perhaps not, but you can lock it from the inside and leave anyone outside unable to get into the dome.\"\n\u003cbr\u003e \"If someones outside, point him out. Show him to me,\" said Leggen.\n\u003cbr\u003e \"He could be anywhere.\" Dors lifted her arms with a photonic fount circling each wrist.\n\u003cbr\u003e \"We cant look everywhere,\" mumbled Benastra miserably. The founts blazed into light, spraying in every direction. The snowflakes glittered like a vast mob of fireflies, making it even more difficult to see.\n\u003cbr\u003e \"The footsteps were getting steadily louder,\" said Dors. \"He had to be approaching the transducer. Where would it be located?\"\n\u003cbr\u003e \"I havent any idea,\" snapped Leggen.--Thats outside my field and my responsibility.\"\n\u003cbr\u003e \"Dr. Benastra?\"\n\u003cbr\u003e Benastras reply was hesitant. \"I dont really know. To tell you the truth, Ive never been up here before. It was installed before my time. The computer knows, but we never thought to ask it that.--Im cold and I dont see what use I am up here.\"\n\u003cbr\u003e \"Youll have to stay up here for a while,\" said Dors firmly. \"Follow me. Im going to circle the entrance in an outward spiral.\"\n\u003cbr\u003e \"We cant see much through the snow,\" said Leggen.\n\u003cbr\u003e \"I know that. If it wasnt snowing, wed have seen him by now. Im sure of it. As it is, it may take a few minutes. We can stand that.\" She was by no means as confident as her words made it appear.\n\u003cbr\u003e She began to walk, swinging her arms, playing the light over as large a field as she could, straining her eyes for a dark blotch against the snow.\n\u003cbr\u003e And, as it happened, it was Benastra who first said, \"Whats that?\" and pointed.\n\u003cbr\u003e Dors overlapped the two founts, making a bright cone of light in the indicated direction. She ran toward it, as did the other two. They had found him, huddled and wet, about ten meters from the door, five from the nearest meteorological device. Dors felt for his heartbeat, but it was not necessary for, responding to her touch, Seldon stirred and whimpered.\n\u003cbr\u003e \"Give me the blanket, Dr. Benastra,\" said Dors in a voice that was faint with relief. She flapped it open and spread it out in the snow. \"Lift him onto it carefully and Ill wrap him. Then well carry him down.\"\n\u003cbr\u003e In the elevator, vapors were rising from the wrapped Seldon as the blanket warmed to blood temperature.\n\u003cbr\u003e Dors said, \"Once we have him in his room, Dr. Leggen, you get a doctor--a good one--and see that he comes at once. If Dr. Seldon gets through this without harm, I wont say anything, but only if he does. Remember--\"\n\u003cbr\u003e \"You neednt lecture me,\" said Leggen coldly. \"I regret this and I will do what I can, but my only fault was in allowing this man to come Upperside in the first place.\"\n\u003cbr\u003e The blanket stirred and a low, weak voice made itself heard. Benastra started, for Seldons head was cradled in the crook of his elbow. He said, \"Hes trying to say something.\"\n\u003cbr\u003e Dors said, \"I know. He said, Whats going on? \"\n\u003cbr\u003e She couldnt help but laugh just a little. It seemed such a normal thing to say.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46284.html","bookId":12,"creation":"Aug 1, 2019 2:15:16 AM","modification":"Aug 1, 2019 2:15:16 AM"}
