{"id":367,"no":75,"title":"Chapter 37","content":"\u003cbr\u003e \"Frankly,\" whispered Dors, \"I can scarcely believe Im on Trantor.\"\n\u003cbr\u003e \"I take it, then, youve never seen anything like this before?\" said Seldon.\n\u003cbr\u003e \"Ive only been on Trantor for two years and Ive spent much of my time at the University, so Im not exactly a world traveler. Still, Ive been here and there and Ive heard of this and that, but Ive never seen or heard of anything like this. The sameness.\"\n\u003cbr\u003e Sunmaster drove along methodically and without undue haste. There were other wagonlike vehicles in the roadway, all with hairless men at the controls, their bald pates gleaming in the light.\n\u003cbr\u003e On either side there were three-story structures, unornamented, all lines meeting at right angles, everything gray in color.\n\u003cbr\u003e \"Dreary,\" mouthed Dors. \"So dreary.\"\n\u003cbr\u003e \"Egalitarian,\" whispered Seldon. \"I suspect no Brother can lay claim to precedence of any obvious kind over any other.\"\n\u003cbr\u003e There were many pedestrians on the walkways as they passed. There were no signs of any moving corridors and no sound of any nearby Expressway.\n\u003cbr\u003e Dors said, \"Im guessing the grays are women.\"\n\u003cbr\u003e \"Its hard to tell,\" said Seldon. \"The gowns hide everything and one hairless head is like another.\"\n\u003cbr\u003e \"The grays are always in pairs or with a white. The whites [also] walk alone and Sunmaster is a white.\"\n\u003cbr\u003e \"You may be right.\" Seldon raised his voice. \"Sunmaster, I am curious.\"\n\u003cbr\u003e \"If you are, then ask what you wish, although I am by no means required to answer.\"\n\u003cbr\u003e \"We seem to be passing through a residential area. There are no signs of business establishments, industrial areas--\"\n\u003cbr\u003e \"We are a farming community entirely. Where are you from that you do not know this?\"\n\u003cbr\u003e \"You know I am an Outworlder,\" Seldon said stiffly. \"I have been on Trantor for only two months.\"\n\u003cbr\u003e \"Even so.\"\n\u003cbr\u003e \"But if you are a farming community, Sunmaster, how is it that we have passed no farms either?\"\n\u003cbr\u003e \"On lower levels,\" said Sunmaster briefly.\n\u003cbr\u003e \"Is Mycogen on this level entirely residential, then?\"\n\u003cbr\u003e \"And on a few others. We are what you see. Every Brother and his family lives in equivalent quarters; every cohort in its own equivalent community; all have the same ground-car and all Brothers drive their own. There are no servants and none are at ease through the labor of others. None may glory over another.\"\n\u003cbr\u003e Seldon lifted his shielded eyebrows at Dors and said, \"But some of the people wear white, while some wear gray.\"\n\u003cbr\u003e \"That is because some of the people are Brothers and some are Sisters.\"\n\u003cbr\u003e \"And we?\"\n\u003cbr\u003e \"You are a tribesman and a guest. You and your\"--he paused and then said--\"companion will not be bound by all aspects of Mycogenian life. Nevertheless, you will wear a white gown and your companion will wear a gray one and you will live in special guest quarters like our own.\"\n\u003cbr\u003e \"Equality for all seems a pleasant ideal, but what happens as your numbers increase? Is the pie, then, cut into smaller pieces?\"\n\u003cbr\u003e \"There is no increase in numbers. That would necessitate an increase in area, which the surrounding tribesmen would not allow, or a change for the worse in our way of life.\"\n\u003cbr\u003e \"But if--\" began Seldon.\n\u003cbr\u003e Sunmaster cut him off. \"It is enough, Tribesman Seldon. As I warned you, I am not compelled to answer. Our task, which we have promised our friend Tribesman Hummin, is to keep you secure as long as you do not violate our way of life. That we will do, but there it ends. Curiosity is permitted, but it wears out our patience quickly if persisted in.\"\n\u003cbr\u003e Something about his tone allowed no more to be said and Seldon chafed.\n\u003cbr\u003e Hummin, for all his help, had clearly mis-stressed the matter. It was not security that Seldon sought. At least, not security alone. He needed information too and without that he could not--and would not--stay here.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1560/46308.html","bookId":12,"creation":"Aug 1, 2019 2:16:21 AM","modification":"Aug 1, 2019 2:16:21 AM"}
