{"id":81894,"no":22,"title":"Page 22","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMicha\u003c/p\u003e\n\u003cp\u003eThe hospital lights are bright and the air is a little cold, but Ella\u0027s warm hand in mine is comforting. The doctor doped me up with a sedative to ease the pain and then I lay down on the bed, waiting for them to come clean the fragments of the branch out of my wound.\u003c/p\u003e\n\u003cp\u003eI was scared shitless when I crashed into that tree, worried I was going to die and leave Ella behind with no one. But now, I\u0027m feeling pretty good.\u003c/p\u003e\n\u003cp\u003eEthan peers over me and scrunches his nose at the wound. \"It\u0027s gnarly looking.\"\u003c/p\u003e\n\u003cp\u003eI shove him out of the way and pull Ella down beside me. \"Hey there, pretty girl, come sit with me.\"\u003c/p\u003e\n\u003cp\u003eShe giggles, then glances at someone and laughs harder. \"I think you might be better off trying to shut your eyes,\" she tells me.\u003c/p\u003e\n\u003cp\u003eI shake my head from side to side. \"No way, all I want to do is stare at you all day.\"\u003c/p\u003e\n\u003cp\u003eShe snorts a laugh and then smoothes my hair back from my head. \"Quit talking, before you say something embarrassing.\"\u003c/p\u003e\n\u003cp\u003eI search my brain, not finding anything embarrassing stashed away inside. \"I\u0027ll be fine.\" I reach over with my good hand and find her leg. Grabbing hold of it, I pull her over toward me so she falls onto the bed.\u003c/p\u003e\n\u003cp\u003e\"Micha,\" she says, her green eyes so wide I can see my reflection in them. \"There are people everywhere.\"\u003c/p\u003e\n\u003cp\u003eI glance from left to right, not seeing anything but blurry shapes. \"I think we\u0027re good.\" I move into kiss her and she gives me a quick peck on the lips, before leaning away.\u003c/p\u003e\n\u003cp\u003e\"How about you rest your head in my lap,\" she says. \"And I\u0027ll rub your back until you go to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"But what if I wake up and you\u0027re not here?\" I ask, sounding like a little baby, but not giving a shit.\u003c/p\u003e\n\u003cp\u003eShe presses her lips together and sighs. \"I\u0027m not going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"You promise?\"\u003c/p\u003e\n\u003cp\u003e\"I promise.\"\u003c/p\u003e\n\u003cp\u003eShe sits up and I rest my head on her lap. She rubs her fingers up my back and through my hair. I hold onto her as I drift into unconsciousness.\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003eMicha is lying on my bed without a shirt on, fiddling with the bandage covering the hole where the branch stabbed into him. The doctors couldn\u0027t stitch it up because it was too wide of an injury, so he has to keep it covered and is not allowed to take showers, something he had jokingly griped about at the hospital as he winked at me.\u003c/p\u003e\n\u003cp\u003eIt\u0027s been a few days since the accident and the Chevelle is parked out in his garage in ruins. When I saw it in the light, I practically passed out because it doesn\u0027t look like an accident anyone would walk away from; the driver\u0027s door is caved in and the front fender fell completely off.\u003c/p\u003e\n\u003cp\u003e\"This is going to leave an awesome battle scar.\" He pushes the bandages back down over the wound.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you think so.\" I read the email that showed up in my inbox the day after the accident. Turns out, I got the internship at the museum and now I have no idea what to do. I want to do it - it\u0027s a great opportunity, but I also don\u0027t want to leave him.\u003c/p\u003e\n\u003cp\u003e\"What are you reading?\" he asks, sliding his legs off the bed, starting to get to his feet.\u003c/p\u003e\n\u003cp\u003e\"Nothing. I was just looking through my emails.\" I shut the computer screen off, climb onto the bed with him, and lean back against the headboard, stretching my legs out.\u003c/p\u003e\n\u003cp\u003eHe points at the drawing of the broken mirror on my wall. \"I like that one. Especially the guitar part.\"\u003c/p\u003e\n\u003cp\u003eIt turned out to be my best piece, full of memories, and a future I wasn\u0027t able to see until I finally let go. A freedom given to me by Micha because he refused to let me go.\u003c/p\u003e\n\u003cp\u003e\"Me too,\" I agree. \"I think I\u0027ll probably turn it in as one of my art projects one day.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s got a lot of meaning in it,\" he comments.\u003c/p\u003e\n\u003cp\u003eI smile and slide down, putting my head next to his. \"I know.\"\u003c/p\u003e\n\u003cp\u003eHe rolls to his side carefully, so he doesn\u0027t hurt his shoulder and we\u0027re lying face to face. \"Where\u0027s your head, Ella May? Ever since the accident, you\u0027ve been really quiet.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m so close to him I can see the dark specks of blue in his aqua eyes. I\u0027ve been quiet because that night made me realize something important. For a split second, I thought I\u0027d lost him and it opened up my heart and freed what I\u0027d buried deep inside me that night on the bridge.\u003c/p\u003e\n\u003cp\u003eI look into his eyes, no longer afraid of what\u0027s in them, but afraid I\u0027ll lose what they carry. \"I just don\u0027t ever want to lose you.\"\u003c/p\u003e\n\u003cp\u003eHis eyebrows dip together as he props up onto his elbow. \"Is that what it\u0027s been about? The accident? Because I\u0027m fine.\" He points to the bandages. \"It\u0027s just a tiny scrape.\"\u003c/p\u003e\n\u003cp\u003e\"I know you\u0027re okay,\" I say, sounding choked. \"But for a second I didn\u0027t think you were.\"\u003c/p\u003e\n\u003cp\u003e\"Hey.\" He cups my cheek and kisses me tenderly. \"I\u0027m okay. You\u0027re okay. Everything\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eI take a deep breath and let it out before I can suck it back in. \"Micha, I love you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-of-ella-and-micha-the-secret-1/page-22.html","bookId":1861,"creation":"Oct 5, 2019 4:39:09 PM","modification":"Oct 5, 2019 4:39:09 PM"}
