{"id":86443,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I know that. Tonight I took you into the most frightening thing a blind and deaf person can face. An entirely unfamiliar environment, lots of noise and challenges. You let it break you once, but then you put it together again. You did. In fact, you got pretty disobedient, playing with another slave for your own pleasure, taunting your Master and his friends. Rubbing yourself against Ben’s monster dick.” He bent, nipped her throat, sharply enough she gasped, particularly when he slid his hand between her legs, reminding her of his right to touch her however, whenever he wished.\u003c/p\u003e\n\u003cp\u003ePropping himself on an elbow, he touched her nose with a broad finger.\u003c/p\u003e\n\u003cp\u003e“Growing up, I had an old hound dog that was blind, deaf, and couldn’t smell so well. He was fearless. Would run into things all the time, frustrating the hell out of him, but purely on an external level. He never let it get inside of him, make him stop being and doing what he wanted to be. He’d just get up and keep on going. You lost your confidence for a little bit, sweetheart, never your courage.”\u003c/p\u003e\n\u003cp\u003e“Are you calling me a bitch?” she demanded.\u003c/p\u003e\n\u003cp\u003eHe brought her fingers to his mouth, let her feel his smile. “If the collar fits.” After a long pause, she spoke, a near whisper. “It does.” Looking down into her face, Peter saw her staring inward, as if she’d gone deep into herself, only this time maybe she’d found something worth seeing in the place where she still had her sight. Being here with her in this bed, making love to her, sharing his feelings with her, feeling her respond to him . . . There was nothing better. He didn’t want her to be blind, but life could be everything they wanted it to be. This bond between them would make up for the lack of anything else. He was surer of it than ever before.\u003c/p\u003e\n\u003cp\u003eHe couldn’t wait for tomorrow, the next day. Hell, the next minute and hour, to watch their relationship grow, strengthen. Learn what irritated and pissed her off, get mad and make up, deal with the millions of big and little decisions that binding two lives together would bring. Hear her say “I love you” for the first time, without any worries. But for now, she gave him the next best thing.\u003c/p\u003e\n\u003cp\u003eShe touched his face again, coming back to him, her smile soft, nervous. “I think . . . I think I love you, Peter Winston.”\u003c/p\u003e\n\u003cp\u003eHis heart flat broke open. His throat thickened in a way he was glad the other guys weren’t around to see. Unable to speak, he found her other hand, guided it to her heart so she could feel what his fingers were doing beneath her own. He made that symbol, the one she’d pressed into his chest more than a year ago.\u003c/p\u003e\n\u003cp\u003eShe’d given her heart to him then, and she’d surrendered it to him now. He was a soldier.\u003c/p\u003e\n\u003cp\u003eHonor bound to take care of it, now and forever, he planned to do just that, with every beat of his own. \u003c/p\u003e","sourceLink":"https://allnovel.net/honor-bound-knights-of-the-board-room-3/page-30.html","bookId":1902,"creation":"Oct 5, 2019 5:14:19 PM","modification":"Oct 5, 2019 5:14:19 PM"}
