{"id":102943,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’re a real thinker, ain’t you?”\u003c/p\u003e\n\u003cp\u003e“Not usually. I’m just new here. Still learning the ropes.”\u003c/p\u003e\n\u003cp\u003e“You listen: If you ever think there’s a breach in the wall, you speak up, all right? We can’t have these things getting out. And it ain’t particularly good to have other things getting in.”\u003c/p\u003e\n\u003cp\u003e“Other things?” The shadow of a long-armed monster flicked through his memory, and he fought the urge to hug himself. “What other things?”\u003c/p\u003e\n\u003cp\u003e“Like I said. Birds. Rats. Dogs. Whatever. We don’t need ’em here. Don’t want ’em.”\u003c/p\u003e\n\u003cp\u003eRector knew a white lie when he heard one, and he almost asked about the “inexplicable.” But Swakhammer didn’t intend to share anything further, that much was clear.\u003c/p\u003e\n\u003cp\u003eBefore too long, they were in the tiny antechamber with the ladder that led up to the fort, and Swakhammer bid Rector good-bye, telling him to stay out of trouble. Rector wondered why everyone always told him that, since it never did a bit of good. Maybe they were all just optimists.\u003c/p\u003e\n\u003cp\u003eUp the ladder he went, and back into the smoky, swirling atmosphere.\u003c/p\u003e\n\u003cp\u003eOne of the airships from his previous visit was gone, but the one called Naamah Darling remained, though no one was anywhere around it that he could see. In fact, he appeared to be utterly alone inside the fort, which unnerved him. The place was beyond spooky with its uniform walls, all vertical, unforgiving lines from the ramrod tree trunks. It was a difficult place to see or to navigate—never mind that it was mostly empty space that went unoccupied by buildings or ships. Foggy air pooled in the corners and misted back and forth, hiding and showing things at its capricious whim. Rector’s breathing was loud inside his mask. It tickled his ears, and he scratched at them, remembering as he did so that he hadn’t found any gloves yet and immediately putting that back near the top of his to-do list.\u003c/p\u003e\n\u003cp\u003eHesitantly, he called out, “Hello?” The word came back to him, bouncing off the trunks and echoing around in the moist, dark corners. He tried it again, somewhat louder. “Hello? Anybody up here?”\u003c/p\u003e\n\u003cp\u003eNobody answered, not even the groan of a rotter or the chitter of rats. He thought he heard something overhead—the other dirigible?—no, it was the flutter of wings. So there were birds here after all, just like Swakhammer had said. He looked up and saw disturbances in the Blight, tiny eddies and whirlpools of air tangling with feathers. The birds themselves eluded him.\u003c/p\u003e\n\u003cp\u003eHe gave it another shot. “Hello? Hey, anybody?”\u003c/p\u003e\n\u003cp\u003eA harsh caw replied, startling him out of his skin. It was very close—practically right behind him.\u003c/p\u003e\n\u003cp\u003e“No,” he whispered to himself. “It’s just the walls. The sound moves funny, in here.”\u003c/p\u003e\n\u003cp\u003eAs he listened for the uncanny birdcall to ring again, he heard something else—something softer, and more reassuring. It was the sound of tools and then, in one quick bark, the sound of swearing. Rector didn’t catch it clearly enough to note the exact word used, but he knew that tone—even if he couldn’t tell the voice.\u003c/p\u003e\n\u003cp\u003eIt came from the Naamah Darling, docked against the wall’s edge, still clasping the soggy, wet mess of the rotting totem pole. The craft leaned slightly, or so Rector thought; then he noticed it had been drawn up by a cable so that its bottom and rear plates were angled toward the ground. One of those plates was off, and although no one stood beneath it, faint sounds of humanity came from within the ship.\u003c/p\u003e\n\u003cp\u003eRector loped toward it, moving swiftly but stopping short of an outright run. Running wouldn’t be dignified, and it would admit by deed that he was scared to be alone in this amazing, ridiculous, unknown place that held so many questions and horrors.\u003c/p\u003e\n\u003cp\u003eHe reached the Naamah Darling’s underside and poked around until he found the main hatch. He was about to yank it down, but then hesitated, and knocked on it like he’d knock on an ordinary door. Something about the captain’s size made Rector unwilling to barge in unannounced.\u003c/p\u003e\n\u003cp\u003e“Anybody in there?” he asked, directing his question at the smooth hull and feeling silly about it.\u003c/p\u003e\n\u003cp\u003eA few seconds later, the hatch seam released with the sound of a seal giving way, and Houjin’s mask-covered head appeared. “Rector!” he said. “You’re up again. You want to come inside?”\u003c/p\u003e\n\u003cp\u003e“Sure, I guess.”\u003c/p\u003e\n\u003cp\u003eHe stood aside as the hatch opened and a set of steps toppled out. He climbed them as invited, and Houjin pulled the stairs up in his wake, sealing the hatch with a yank of his arm and a shove against a lever.\u003c/p\u003e\n\u003cp\u003eThe craft’s interior was larger than Rector had expected. It had a wide open bridge and two secondary areas, plus a closed door with some kind of prohibitive warning on it. The bridge had several seats bolted into the floor, one of which was quite a bit larger than the others.\u003c/p\u003e\n\u003cp\u003eHe cocked a thumb at it. “Captain’s chair?”\u003c/p\u003e\n\u003cp\u003eHoujin said, “He had it made special, in San Francisco. A long time ago.”\u003c/p\u003e\n\u003cp\u003e“Where’s Zeke?”\u003c/p\u003e\n\u003cp\u003e“Miss Mercy sent him errand running, but he’ll be back any minute.”\u003c/p\u003e\n\u003cp\u003e“You by yourself in here?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “One of the thrusters has been sticky, and we’re having trouble with our sharp lefts. I thought I’d fiddle with it while Zeke was gone.”\u003c/p\u003e\n\u003cp\u003e“No luck, huh?”\u003c/p\u003e\n\u003cp\u003e“No. I think the steam injector’s gone bad. We’ll need a new one pretty soon. Don’t want to fly this thing for long if the steering isn’t great.” He stared off into space for a moment and said, “I bet we could order one in Tacoma.”\u003c/p\u003e\n\u003cp\u003eRector couldn’t have cared less about the ship’s steering, but he cared a lot about his itching hands, so he brought the subject around without any preamble. “Hey, is there any chance anybody on this ship has a pair of gloves I could borrow? My hands are all et up with this Blight stuff. They itch like hell.”\u003c/p\u003e\n\u003cp\u003eHoujin looked around him, saw nothing immediately promising, and then said, “Wait here—let me see if there’s anything left in the lockers.”\u003c/p\u003e\n\u003cp\u003eHe disappeared through the door that strictly prohibited entry and reappeared with a floppy set of thin leather gloves. “Will these work?”\u003c/p\u003e\n\u003cp\u003e“Beautifully,” Rector said before he even got them on. “Thanks. You’re all right.”\u003c/p\u003e\n\u003cp\u003e“They’re Fang’s extra set. You can put them back when we’re finished for the day, and then we’ll ask around in the Vaults.”\u003c/p\u003e\n\u003cp\u003e“That sounds good.” He worked them over his fingers and found that they were almost too snug, but far better than nothing. “So, let me ask: You’re not on any official business?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“You’re not under captain’s orders, or anything? There’s nothing keeping you here?” Rector prodded, looking around and making a show of being unimpressed, even though he’d never been inside an airship before and was pretty impressed.\u003c/p\u003e\n\u003cp\u003e“No, not really. What about you?”\u003c/p\u003e\n\u003cp\u003e“Me? I plan to get to work.”\u003c/p\u003e\n\u003cp\u003e“For Yaozu?”\u003c/p\u003e\n\u003cp\u003e“That’s right,” he confirmed. He stepped up into the bridge and strolled over to the large windscreen, leaning forward to see out into the dirty air that filled the foggy courtyard area within the fort. “He thinks there’s a breach in the wall someplace, and he wants me to find it.”\u003c/p\u003e\n\u003cp\u003eHoujin cocked his head to the side. “A breach? Is that where he thinks all the rotters are going?”\u003c/p\u003e\n\u003cp\u003e“Yeah, he said they’re getting outside. People are starting to talk.”\u003c/p\u003e\n\u003cp\u003e“They are?”\u003c/p\u003e\n\u003cp\u003e“I think so. I think that Swakhammer fellow knows, but he got all squirrelly on me when I asked him about it. Anyhow, Huey, you think there’s a chance the captain would give us a lift? It’d be faster hunting if we did it from the air.” He lifted his eyebrows optimistically as he looked back at Houjin, but with the mask on, Houjin didn’t see it.\u003c/p\u003e\n\u003cp\u003e“No way. Especially not with the steering gone iffy. And don’t even think about it.”\u003c/p\u003e\n\u003cp\u003eNow one eyebrow was held aloft with virtuousness. “Think about what?”\u003c/p\u003e\n\u003cp\u003e“We’re not going to take the ship without permission, even if we could. Captain Cly and Fang would kill us both. Kill us all, since you probably mean to get Zeke involved.”\u003c/p\u003e\n\u003cp\u003e“Oh ye of little faith,” he murmured, quoting Father Harris.\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“It means you don’t trust me, do you?”\u003c/p\u003e\n\u003cp\u003eHuey shook his head. “If I thought you knew anything about flying, I’d be worried. But you don’t. And I won’t help you do it.”\u003c/p\u003e\n\u003cp\u003e“You think you’re real smart, don’t you? All sorts of brains, you’ve got—you think you know damn well everything,” Rector said crossly.\u003c/p\u003e\n\u003cp\u003eHe might’ve added more, but the hatch hissed and popped—and this time, from inside the ship, Rector felt his ears pop with it. He abandoned his position beside the oversized captain’s chair.\u003c/p\u003e\n\u003cp\u003e“Hey, Zeke!”\u003c/p\u003e\n\u003cp\u003e“Rector, you’re back! I thought you were going to sleep for a week,” Zeke said, hopping up into the ship’s belly and waving at Houjin.\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t. I hear you were off chasing nurses.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t doing no such thing,” Zeke insisted. Because he was wearing a gas mask, Rector couldn’t tell if he was blushing, but it was an easy guess.\u003c/p\u003e\n\u003cp\u003e“It’s a shame you didn’t bring her with you. I wanted to ask her something.”\u003c/p\u003e\n\u003cp\u003e“Something ’bout what?” Zeke asked.\u003c/p\u003e\n\u003cp\u003e“Something her daddy said that made me wonder. He said she’d tell me all about people disappearing, and now I’m halfway worried about it.”\u003c/p\u003e\n\u003cp\u003eHoujin and Zeke looked quickly at each other, and Zeke cleared his throat. “Oh, that. Mr. Swakhammer didn’t mean that people were disappearing from around here. He’s talking about the train.”\u003c/p\u003e\n\u003cp\u003e“What train?”\u003c/p\u003e\n\u003cp\u003e“The Dreadnought, the train Miss Mercy rode out west. It was a big mess, and a bunch of people died. Miss Mercy was one of the survivors, but now she can’t find any of the other folks who got out alive. Ask her about it sometime … or maybe don’t. She gets this look on her face like she’s scareder than she’d tell you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-24.html","bookId":1670,"creation":"Oct 5, 2019 10:18:49 PM","modification":"Oct 5, 2019 10:18:49 PM"}
