{"id":102948,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAngeline brought them to an alley between two great houses that had once belonged to wealthy men. The houses reared up out of the fog like monsters, like things in Rector’s daymares. They were all peaks and gingerbread and rotting bits of unpleasant paint peeling in sheets as big as his hands. Once they might’ve been some bright color, but the gas and the years had bleached whatever hue they’d originally held, and now they were cumbersome corpses, decomposing where they stood.\u003c/p\u003e\n\u003cp\u003e“I’m giving you boys some credit, you understand,” the princess told them, her voice low and her eyes grave behind the shield of her visor. “What I mean to show you ain’t pretty. But it might be important.”\u003c/p\u003e\n\u003cp\u003eShe stepped aside and held out the lantern, which cast a wimpy bulge of brightened air down into the alley.\u003c/p\u003e\n\u003cp\u003e“Go on. Take a look.”\u003c/p\u003e\n\u003cp\u003e“At what?” Rector asked, peering as hard as he could into that impenetrable haze.\u003c/p\u003e\n\u003cp\u003eShe corrected him. “Not up there; not like that. Look down on the ground, boy. Tell me what you see.”\u003c/p\u003e\n\u003cp\u003eHe stepped forward in order to stand beside Houjin and Zeke and he followed Angeline’s pointing finger. Where the light pooled and puddled, he saw strange forms, or pieces of forms, scattered on the ground. He couldn’t imagine what these crooked shapes and splintered parts had once been part of, or where they’d once belonged.\u003c/p\u003e\n\u003cp\u003eRector crouched down and his knees popped. He winced, rubbed at his joints, and asked, “Could you bring the light down, Miss Angeline?”\u003c/p\u003e\n\u003cp\u003eShe obliged, and the unidentifiable lumps came into focus.\u003c/p\u003e\n\u003cp\u003eThere, at Rector’s feet, was a disembodied hand.\u003c/p\u003e\n\u003cp\u003eHe jumped and toppled backwards, but caught himself on one palm.\u003c/p\u003e\n\u003cp\u003e“I did warn you.”\u003c/p\u003e\n\u003cp\u003eHe leaned forward, and Huey and Zeke came closer, too.\u003c/p\u003e\n\u003cp\u003eHoujin used the edge of his iron rod to poke at the hand. It didn’t move. It didn’t respond in any fashion, except to shed one finger. The digit flaked away, and the small bones that once held it together drooped pitifully—kept in place by habit and a strand or two of old skin.\u003c/p\u003e\n\u003cp\u003eAngeline took her lantern, stepped deeper into the alley, and told them, “Lads, that’s just the start of it. Come have a look, won’t you?” And as she went between the houses, the light seemed brighter than before—bouncing off the walls, since it had nowhere to go except back into the fog.\u003c/p\u003e\n\u003cp\u003e“Miss Angeline,” Huey breathed. He was the only one who could speak.\u003c/p\u003e\n\u003cp\u003eZeke and Rector remained silent, transfixed and horrified.\u003c/p\u003e\n\u003cp\u003eAt Angeline’s feet, they saw legs, arms, and half a dozen heads lying motionless and scattered. And behind her, creeping into a gruesome drift as high as her waist, a pile of dismembered undead oozed, dripped, and settled into a heap of viscous mulch.\u003c/p\u003e\n\u003cp\u003eZeke gasped, creeping closer, though why he’d want a better look, Rector couldn’t fathom. Rector just wanted away from the damn things—away from the pile, away from the alley and everything in it.\u003c/p\u003e\n\u003cp\u003eHe swung his arm up over his nose, shielding his filters further with his sleeve. It didn’t make a difference. “That’s disgusting! Where’d they all come from?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t tell you,” the princess shook her head. “I counted about forty before I made myself sick, being so close. Red, don’t worry about covering your nose. I know you think you smell these things, but you don’t.”\u003c/p\u003e\n\u003cp\u003eBut it wasn’t the imagined smell that made him recoil. He withdrew from the details.\u003c/p\u003e\n\u003cp\u003eOne long arm lay mere inches from his toes, and he nudged it with his boot. The curled, dead fingers splayed and collapsed. All their nails were broken. They would’ve been bloody if there’d been blood left; but around the edges, even on the gray, dead skin, Rector could see the crusty tint of yellow. His own nails were starting to turn that color. He’d noticed it months ago.\u003c/p\u003e\n\u003cp\u003eAnd over there, the nearest skull with any skin left to remark … its eyes were sunken and a gritty gold crust spilled from its nostrils and ears. Big, gruesome sores ate the flesh around its mouth. Rector had once had a sore like that. He’d occasionally picked a similar grit out of his own ears, and he’d sneezed it out of his nose once or twice.\u003c/p\u003e\n\u003cp\u003eThe sap craving twitched between his ears and in his lungs, just like old times, but just for an instant before it was quashed by a wave of nausea. For that same instant, he thought of the Station, and about the men who considered him one of their own in some vague, proprietary way.\u003c/p\u003e\n\u003cp\u003eThen the nausea washed that away, too. Was this all they expected of him?\u003c/p\u003e\n\u003cp\u003eHoujin, always bravest—the simple result of having lived there the longest, or so Rector guessed—sidled forward and jabbed at the pile with his weapon. Just like the lone, stray hand, the corpse fragments settled and flattened, but did not squirm or show any hint of continued animation. “Look at the breaks,” he said, now using the rod to point. “They’re torn. All of them. Not cut, not hacked.”\u003c/p\u003e\n\u003cp\u003e“They were ripped apart,” Zeke said, with no small measure of awe.\u003c/p\u003e\n\u003cp\u003e“But what could do something like that?” Huey asked. “And some of these men … they weren’t gone yet when the thing took them. Look, that one still had a mask on. I think he’s one of Yaozu’s men. And there’s a hand over there that hardly looks rotty at all. Some of these fellows are fresh.”\u003c/p\u003e\n\u003cp\u003eRector gulped. “Four of the Station men got tore up. Maybe more. What could tear forty rotters and a bunch of men to bits?”\u003c/p\u003e\n\u003cp\u003eAngeline turned pointedly to Rector and said, “I can’t say for sure, but I have an idea.”\u003c/p\u003e\n\u003cp\u003e“Ma’am?” Rector asked, guiltily confident that he was being accused of something.\u003c/p\u003e\n\u003cp\u003e“What you saw, when you first came into the city—you said it was a monster?”\u003c/p\u003e\n\u003cp\u003e“It was a monster. It chased me. It stalked me,” he said, and it sounded like an echo. He remembered saying it once before, and he shivered, despite his best efforts.\u003c/p\u003e\n\u003cp\u003e“It was big, and it had long arms,” she reminded him.\u003c/p\u003e\n\u003cp\u003e“That’s right.” He nodded violently.\u003c/p\u003e\n\u003cp\u003eHoujin backed him up. “I saw it, too. Whatever was after him, he’s right. It was really big.”\u003c/p\u003e\n\u003cp\u003e“Let me ask you this,” Angeline proposed to the pair of them. “Do you think it might’ve been covered in hair?”\u003c/p\u003e\n\u003cp\u003e“Hair?” Rector frowned and cocked his head. “I don’t know … I guess it might’ve been?”\u003c/p\u003e\n\u003cp\u003e“Long hair. Brown hair, with a little bit of red in it—not half so red as yours, I don’t suppose. But like this…” She pulled a swatch of something stringy and russet colored out of her pocket and held it up to the lantern so the boys could get a gander at it. “I found this nearby. Lots of it, not just this little lock. It’s scattered around the scene. I don’t mind telling you, I took my time here. It’s nasty as can be, but it got me thinking.”\u003c/p\u003e\n\u003cp\u003eHoujin’s eyes narrowed. “You know what did this, don’t you, Miss Angeline? You don’t know the word inexplicable, but you know what did this.”\u003c/p\u003e\n\u003cp\u003e“I have an idea, and it’s a strange one—but it’s the only one I’ve got that makes any sense. Come along, boys. I think you’ve seen enough. Let’s go to the Sizemore House and down someplace safer, and then I’ll tell you about my thoughts.”\u003c/p\u003e\n\u003cp\u003eFifteen\u003c/p\u003e\n\u003cp\u003eThey skulked together, guided by their lone lantern. They needed it more and more, and Houjin would’ve struck up another if Angeline hadn’t insisted they shouldn’t. Instead, she recommended that the boys take hold of one another’s shirts, and told Houjin to grasp her hair.\u003c/p\u003e\n\u003cp\u003e“Don’t tug it—I’m trusting you, Huey. But we need to stay close,” she said in her commanding, quiet voice. “And we should use as little light as we can get away with. Night’s falling. We don’t want to fall with it.”\u003c/p\u003e\n\u003cp\u003eAll in a row, Rector feeling immensely undignified, they escaped the last few blocks of the rich men’s houses and ripped-apart rotters. Angeline knew precisely where she was going, and she brought them to the Sizemore House before the sun was altogether gone behind the wall. The house loomed big and dilapidated, empty and waiting. The front porch sagged, and the roof sagged, too. It looked like a balloon without enough air in it.\u003c/p\u003e\n\u003cp\u003e“Will it fall down on us?” he asked Zeke, because he was staring at the back of Zeke’s head.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Who was Sizemore?” he asked. He liked the sound of their voices; the darkness made him lonely.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Zeke told him. “And shush. We’ll be downstairs in a minute.”\u003c/p\u003e\n\u003cp\u003eBy downstairs, Zeke meant the root cellar. Around the back and through a pair of giant wood doors set into the ground, the quartet descended into a space even darker than the one they were leaving—but the tunnels weren’t choked with Blight, they were only tainted with it. The lantern did good work as soon as those doors were shut overhead. The nervous explorers sighed with relief, but they couldn’t take off the masks.\u003c/p\u003e\n\u003cp\u003e“It looks clear down here,” Rector protested. “I don’t see any gas.”\u003c/p\u003e\n\u003cp\u003eAngeline smacked him in the back of the head—harder than was strictly necessary to make her point, in Rector’s opinion. “You don’t have to see it to die from it, you silly boy. If I had any polarized glass, I could tell you true if it was safe to breathe. But I don’t.”\u003c/p\u003e\n\u003cp\u003e“We’ve got some back at the Vaults,” Zeke noted.\u003c/p\u003e\n\u003cp\u003e“Next time, bring some. I expect that’ll be the next step in the repair process, sending folks down through the tunnels with the lenses, seeing what’s still safe and what’s not safe anymore. After they fix up those cave-ins, I mean.”\u003c/p\u003e\n\u003cp\u003eRector almost said, Yaozu will probably add that to his to-do list, but remembered in time not to say the Chinaman’s name.\u003c/p\u003e\n\u003cp\u003eHe caught Zeke and Houjin looking at him, and he shrugged. If they were worried he’d blabber about his employer, they shouldn’t be. Despite the recent smack, he liked the princess in that idle way that required no actual investment on his part. And he also believed the one other thing Yaozu had told him about her: She was useful. Very useful. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-29.html","bookId":1670,"creation":"Oct 5, 2019 10:18:49 PM","modification":"Oct 5, 2019 10:18:49 PM"}
