{"id":102950,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHoujin remained dubious. “That’s a better idea than mounting an expedition to save the sasquatch.”\u003c/p\u003e\n\u003cp\u003e“If it works, there’s some chance the sasquatch could get better, too.” She put down her fork beside her mostly empty plate and put her elbows on the table. “I hate to think it can’t be saved.”\u003c/p\u003e\n\u003cp\u003e“Is it worth saving?” Rector asked, likewise putting down his fork.\u003c/p\u003e\n\u003cp\u003eShe nodded firmly. “It’s not bad. It’s just sick. Tomorrow, let’s go back out there, back where I caught up to you today. Let’s finish working around the wall—around that back part, anyhow—and see if we can find the hole.”\u003c/p\u003e\n\u003cp\u003e“How does that help us help the sasquatch?” Zeke asked.\u003c/p\u003e\n\u003cp\u003e“Maybe we can lure it out. It followed Red; maybe it’ll follow us if we look nice and harmless.”\u003c/p\u003e\n\u003cp\u003eZeke winced. “I don’t want to look nice and harmless, not with a sasquatch out there, sick and hunting people.”\u003c/p\u003e\n\u003cp\u003eAngeline laughed, fast and too loud. “I didn’t say we’d be nice and harmless. I just said we’d look it.”\u003c/p\u003e\n\u003cp\u003eSixteen\u003c/p\u003e\n\u003cp\u003eRector awakened to a firm shove to his shoulder. It startled him upright in a tangle of covers, fueled by the alarm of someone who hasn’t awakened in a bed enough times to remember where, precisely, he’s been sleeping.\u003c/p\u003e\n\u003cp\u003e“What? Who? What?”\u003c/p\u003e\n\u003cp\u003eBeside his bed stood a sturdy-looking woman with dark blond hair. “Three questions in a row, and you’re sitting up already. You’re easier to get moving than Zeke is.”\u003c/p\u003e\n\u003cp\u003eHer voice was odd to him—the vowels rolled strangely and he couldn’t place their origin—but he’d heard this voice before, in that half-dream state he’d occupied for his first few days in the underground.\u003c/p\u003e\n\u003cp\u003e“You … you…” His breath caught up to him at last, and his brain kicked reluctantly into gear. “You must be Miss Mercy.”\u003c/p\u003e\n\u003cp\u003e“Very good. You’re even alert at such an hour, which is one small thing to recommend you. I have to admit, I wasn’t entirely sure you were going to pull through and dry out, but here you are—and you’re looking well, I might add. Better than before by a long shot.” Her eyes moved over him in quick, efficient snaps.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he mumbled, scanning the dim room for his jacket and seeing it hanging on the bedpost. He reached for it, missed it once, and snagged it the second time.\u003c/p\u003e\n\u003cp\u003eShe left his bed and went to her shelves, where she drew down a large lantern and lit it. The whole room went white, and Rector shielded his eyes. “Damn, lady! Warn a guy, would you?”\u003c/p\u003e\n\u003cp\u003e“Sorry,” she said. She didn’t sound sorry. “Let me get a look at you.”\u003c/p\u003e\n\u003cp\u003e“Do I have any choice?”\u003c/p\u003e\n\u003cp\u003e“No. Sit there, hold still, and don’t bite me.”\u003c/p\u003e\n\u003cp\u003e“Why would I bite you?” he asked, rubbing his eyes and finally putting his hands down atop the blanket.\u003c/p\u003e\n\u003cp\u003eShe murmured, “I surely hope you have no reason to,” and brought the blinding white lantern (what powered that thing, anyway?) up close. She hung it on a hook Rector hadn’t noticed before, which held the light over his bed. He felt like he was on stage, standing in a curiously cold pool of light.\u003c/p\u003e\n\u003cp\u003e“I’m feeling a whole lot better,” he assured her, but when he tried to jam his arms into the jacket, she took it away from him and tossed it back onto the bedpost.\u003c/p\u003e\n\u003cp\u003e“Don’t go covering up just yet. Let me see you.”\u003c/p\u003e\n\u003cp\u003eShe took his face in her hands and tilted it up to face the brilliant light. He squinted against it, but held his eyes open when she told him to. He swallowed when she told him to do that, too, and opened his mouth and stuck out his tongue—and he felt silly about every single second of it.\u003c/p\u003e\n\u003cp\u003eSatisfied that her patient wouldn’t die right there on the spot, Mercy Lynch sat down on the edge of the bed and said, “You young fellows are made of rubber. You can bounce back from almost anything.”\u003c/p\u003e\n\u003cp\u003e“I’m … I’m eighteen,” he told her. “I mean, nineteen.”\u003c/p\u003e\n\u003cp\u003eShe smirked. “That old, eh?”\u003c/p\u003e\n\u003cp\u003e“At least. But between you and me, I’m not real sure.” Now that he appeared to be permitted to do so, he retrieved his jacket and slipped his arms inside it. He pulled it shut across his chest and noticed he’d lost a button.\u003c/p\u003e\n\u003cp\u003e“I heard you were brought up in an orphanage.”\u003c/p\u003e\n\u003cp\u003e“That’s right. I was sent there after the Blight. I was only a little thing, so I don’t know my right age. Don’t know my birthday. Don’t know much.”\u003c/p\u003e\n\u003cp\u003e“You know plenty about sap,” she said bluntly.\u003c/p\u003e\n\u003cp\u003eHe had the overwhelming feeling that he’d get roughly as far arguing with Mercy as he would with Zeke’s mother. Or with the princess, for that matter. He supposed it took a certain kind of woman to survive down here, underneath the walled city. That was all right with him, but he didn’t really want to talk about sap.\u003c/p\u003e\n\u003cp\u003eSo all he said was, “I know about it, yeah.”\u003c/p\u003e\n\u003cp\u003e“How long were you using it?”\u003c/p\u003e\n\u003cp\u003eHe avoided her eyes and pretended to fiddle with the empty buttonhole on his jacket. “Not sure.”\u003c/p\u003e\n\u003cp\u003e“A while, I’d say. You’ve got the first marks on you—the marks of somebody who’s bound to turn one of these days, if he ain’t careful.” She took his jaw in her hands again. She met his eyes by force, and he decided that she was really kind of pretty. Not too pretty, but nicer than plain. A smattering of light brown freckles dusted her nose and the tops of her cheeks. Her freckles were less obtrusive than his vivid orange ones. He liked hers better.\u003c/p\u003e\n\u003cp\u003e“I’m careful,” he told her in his oldest-sounding voice. “I was always careful.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and I’m your mother. Let me make some guesses, and you tell me how close I get.”\u003c/p\u003e\n\u003cp\u003eHe shrugged, trying to make it look easy, as though he didn’t care. He folded his hands behind his head and leaned back against the headboard. “Shoot.”\u003c/p\u003e\n\u003cp\u003e“You started a long time ago, probably four or five years. But back then you were just a boy, and you had a hard time getting your hands on it, so you didn’t do it much. Then you got bigger, and I’ll guess you took the most likely work you could find and started selling it. Once you were selling, you had it in your hands all the time—and then, maybe a year or two ago, you were doing it so regular you probably never went a day without it. How am I doing?”\u003c/p\u003e\n\u003cp\u003eOne nostril twitched involuntarily. “Not bad.”\u003c/p\u003e\n\u003cp\u003e“See, I can tell it from your skin, how it’s going that funny color around your eyes. Almost like you’re god-awful tired all the time and just don’t sleep enough. But those aren’t regular circles under your lids like we tired old people get; those are pockets of sap residue, collecting there and staining your skin from underneath.”\u003c/p\u003e\n\u003cp\u003eHis chilly attitude slipped. “It can do that?”\u003c/p\u003e\n\u003cp\u003e“It builds up in your body, and some of it stays,” she confirmed.\u003c/p\u003e\n\u003cp\u003e“How long?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Years? Forever, maybe. I haven’t had a chance to watch anybody use it that long. Heavy smokers don’t live to a ripe old age, in my experience. That’s why I’m watching every user I can, trying to learn more.”\u003c/p\u003e\n\u003cp\u003e“You … you want to watch people use sap?”\u003c/p\u003e\n\u003cp\u003e“Do I want to?” She stood up again, and smoothed her skirts with her hands. “No. I don’t want to watch anybody use it, least of all a young man like yourself. But it teaches me, when I can see what it does to people. Look, I don’t read or write real well, but I’m taking notes as best I can, for doctors here and back East. I’m trying to learn how this stuff works, and how long it takes to kill.”\u003c/p\u003e\n\u003cp\u003e“Were you taking notes on me?”\u003c/p\u003e\n\u003cp\u003e“I take notes on everybody who gets poisoned or bit. It doesn’t happen too often down here, ’cause most everybody knows the rules about surviving. But once in a while a gas mask slips, or somebody gets surprised and loses a finger, and then a hand. And then, yes, I watch ’em.”\u003c/p\u003e\n\u003cp\u003eShe took the lantern off its hook but left it bright, and set it down on a cabinet across the room. The swish of her dress was loud in his ears, and the sway of her apron clinked as the tools in her pockets chimed together.\u003c/p\u003e\n\u003cp\u003e“Did you think I was gonna die?”\u003c/p\u003e\n\u003cp\u003e“I thought you might,” she confessed. “Aside from you taking that tumble, you spent a few days waking up from the sap, and that’s no easy thing. Either one could’ve killed you, if you’d been weaker or smaller, or maybe less lucky.”\u003c/p\u003e\n\u003cp\u003e“I’ve always been lucky.”\u003c/p\u003e\n\u003cp\u003e“Same as you’ve always been careful, I’m sure. But I do want to be clear…” she told him as she began riffling through one of the drawers.\u003c/p\u003e\n\u003cp\u003e“About what?” he asked, no longer caring much. She’d already told him he’d live. From pure muscle memory, he reached his feet over the edge of the bed before remembering that his boots weren’t right there. He’d kicked them off before turning in the night before. One had slid underneath the mattress, and one was immediately to his right.\u003c/p\u003e\n\u003cp\u003e“You pick up the sap again, and it won’t be too much longer. There’s a point with every user, with every victim … and beyond that point, there’s no saving them. Nothing at all to be done except put a bullet in their head so they can’t hurt anyone else.”\u003c/p\u003e\n\u003cp\u003eShe said it so casually that it made him shiver, but he hid it. He pretended to adjust his jacket, and fished around with his feet to retrieve his shoes. “I don’t plan to use it anymore.”\u003c/p\u003e\n\u003cp\u003e“Oh?” She looked over her shoulder, and fixed him to the wall with one pointed eyebrow. “You don’t plan to? I’m sure you haven’t even been thinking about it, all this time, this whole week you’ve been here. I’m sure you haven’t been imagining how good it feels, and now nice it tastes—or how bad it tastes, I don’t know—and I’m sure there’s no reason at all you’d go looking for it the moment your friends turn their backs.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-32.html","bookId":1670,"creation":"Oct 5, 2019 10:18:49 PM","modification":"Oct 5, 2019 10:18:49 PM"}
