{"id":102960,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIf he were to try his luck at the Station, he might find the population less accommodating, or more competitive, which was his true worry. Bishop had suggested that the Station would be filled with men more like himself, inclined to crime, drug use, and cheating behavior, and that sounded tricky. It was easier, he suspected, to be the only person of his sort. Better a big fish in a small pond.\u003c/p\u003e\n\u003cp\u003eBut when he looked around the tiny, dingy, dark, and utilitarian room … it did not feel much different from the orphanage. It felt like a lateral move, and not a step up. Even if it was his, and his alone.\u003c/p\u003e\n\u003cp\u003eHe was mulling this over when he heard a violent clatter and a keening, simpering sound that made his ears want to close up. He hopped to his feet and poked his head out into the hall, and there he saw Angeline wrestling with something that was too large for her to easily carry.\u003c/p\u003e\n\u003cp\u003eWhen she saw him, she smiled and set her burden down with a grunt. “Red!” she exclaimed, panting roughly as she caught her breath. “Come give me a hand with this, would you?”\u003c/p\u003e\n\u003cp\u003e“What … what is it?” he asked, coming closer only because she was so unafraid—and it wouldn’t do for him to cringe away like a coward.\u003c/p\u003e\n\u003cp\u003e“Silly boy—it’s the cage we set out the other day. And inside it…” She drew aside a moth-eaten blanket that’d been covering the cage. “I’ve got Zeke’s fox.”\u003c/p\u003e\n\u003cp\u003eThe creature snapped and hissed, crawling in a circle as if trying to create a smaller and smaller ball of fox—something tiny enough to fit through the mesh and escape. Angeline dropped the blanket again, and the persistent fuss of the animal’s crying tapered off.\u003c/p\u003e\n\u003cp\u003e“Why is it Zeke’s fox?” Rector asked.\u003c/p\u003e\n\u003cp\u003e“Because he’s the one who wanted to save it. Him and me, I guess, but I don’t plan to look after it, and I expect he will. Help me carry this,” she directed.\u003c/p\u003e\n\u003cp\u003eRector did so, but he made sure to grab a good handful of blanket before putting his fingers anywhere within potential biting distance.\u003c/p\u003e\n\u003cp\u003eHe needn’t have worried. The fox cowered away from both of them.\u003c/p\u003e\n\u003cp\u003e“Where are we taking it?” he asked as he lumbered beside her, walking sideways to keep from dropping the cage and fox both.\u003c/p\u003e\n\u003cp\u003e“I thought one of these extra rooms down here might do the trick. Same as you, I expect,” she said. “You picked one out? Is that what you’re doing down here?” She sidled as they walked, the cage held between them.\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am,” he admitted. “Miss Mercy threw me out of the sickroom.”\u003c/p\u003e\n\u003cp\u003e“You ain’t sick no more.”\u003c/p\u003e\n\u003cp\u003e“Sure, but I didn’t have noplace else to go.”\u003c/p\u003e\n\u003cp\u003eShe stopped beside a half-open door. “Here—this room over here ought to be fine for the fox, for now. You didn’t see anybody else around? Not that I think anyone’d need the space, but you never know.”\u003c/p\u003e\n\u003cp\u003e“No, I think I’m the only one down here. But we can always shut the door and … um … and put a sign on it.”\u003c/p\u003e\n\u003cp\u003e“Not sure how much good that’d do.” She pushed the door open with her hip and backed into the room, drawing the cage and Rector along behind her. “Half the folks down here can’t read. But if the idea of a snarling fox who’s all sick with Blight doesn’t keep ’em out, they deserve to get bit. I’ll pass the word around upstairs.”\u003c/p\u003e\n\u003cp\u003eRector accompanied her to the far wall, where they deposited the fox.\u003c/p\u003e\n\u003cp\u003eAngeline drew the blanket back all the way, and the light from the corridor cast a wide shaft into the room. She scared up a lantern, lit it, and drew it close enough to the animal so she could get a better look.\u003c/p\u003e\n\u003cp\u003eRector said, “That’s about the most pitiful thing I ever saw.”\u003c/p\u003e\n\u003cp\u003e“I have to agree with you there,” she nodded.\u003c/p\u003e\n\u003cp\u003eThe fox’s ribs stuck out through its patchy fur, and its eyes were glassy and gold. They had an odd orange tinge to them—something unnatural and unhealthy, like the crows … except the fox did not appear otherwise well. Its tongue lolled, its eyes bugged, and its ears drooped sadly.\u003c/p\u003e\n\u003cp\u003eThe princess put her hands on her hips. “First things first, then. I’ll get it some water and some food, and we’ll see if it don’t improve.”\u003c/p\u003e\n\u003cp\u003eIn half an hour they’d managed all of these things, and even arranged the old blanket into something like a bed. It’d be more comfortable than the metal mesh, at any rate, and when the door was closed the room was dark and quiet. Once the fox was as comfortable as its human handlers could make it, Rector turned to Angeline and asked, “If it does get better, how long do you think that’ll take?”\u003c/p\u003e\n\u003cp\u003e“Don’t know. But Zeke’ll be pretty patient with it. That boy’s still finding his way. He’s trying to decide who to be, and how to become it, and that’s a difficult thing for anybody … but he’s got a kind heart in him, and that’s more than a lot of people start with.”\u003c/p\u003e\n\u003cp\u003eRector scratched at his wrists, which still smarted dully from the Blight burns. “Well, he got picked on a lot, on the outside. It might’ve made him a little soft.”\u003c/p\u003e\n\u003cp\u003e“That’s not always how it works, you know. Or maybe you and I have a different idea of what soft means. Soft don’t always mean weak; the trees that bend are the ones that weather the storm, after all. You’re a boy from the Sound. You ought to know that. Now come on—let’s leave this little fellow alone and hope for the best. Maybe he’ll take that food and water, and maybe the air down here will clear him out.”\u003c/p\u003e\n\u003cp\u003e“It don’t work on people.”\u003c/p\u003e\n\u003cp\u003e“That fox ain’t people.” She ushered Rector out of the room and shut the door behind them both. “Peace and quiet, that’s all we can do for it.”\u003c/p\u003e\n\u003cp\u003eAs if on cue, Houjin came bounding down the corridor, shouting. “Rector, are you down here? Rector?”\u003c/p\u003e\n\u003cp\u003e“Shh!” Angeline hissed.\u003c/p\u003e\n\u003cp\u003eHoujin drew up short and stopped himself with a skid. “Sorry, ma’am. I was looking for Rector.”\u003c/p\u003e\n\u003cp\u003e“So I gathered. What do you want with him?”\u003c/p\u003e\n\u003cp\u003e“It’s not me, ma’am … it’s Yaozu. He wants him for outside work. Since he knows some of the people out at the tower, and all. Besides, he says he’d rather give Rector a job than wonder what he’s up to.”\u003c/p\u003e\n\u003cp\u003eAngeline laughed, which surprised both boys. “I never said the man was a dummy, did I? You two run along and make yourselves useful.”\u003c/p\u003e\n\u003cp\u003eAs the two boys ran down the hall to the stairs, Houjin asked, “What was all that about? What were you doing down here?”\u003c/p\u003e\n\u003cp\u003e“Setting up a room for myself,” Rector said. “And while I was at it, I ran into Miss Angeline, carrying that cage we put out. She caught the fox. We gave it some food and water, and left it in that empty room with the door shut.”\u003c/p\u003e\n\u003cp\u003eHoujin shook his head and reached for the stair rail. Up he climbed, and he said, “Waste of time. But it’s nice of her to try—and Zeke’ll be glad she caught it. It can be his project, when he gets finished up at Decatur.”\u003c/p\u003e\n\u003cp\u003e“Why aren’t you up there? Why’d you leave with Yaozu? Is that air captain boss of yours scared of him, or what?”\u003c/p\u003e\n\u003cp\u003e“Cly’s not scared of him,” Houjin snapped. “The captain’s trying to do what’s best for the underground. Zeke can carry things and move things up at the fort as easy as I can; but he can’t make things like I can.”\u003c/p\u003e\n\u003cp\u003e“What are you making?” Rector asked, partly because he was curious, and partly because he didn’t feel like managing Houjin and his bad mood.\u003c/p\u003e\n\u003cp\u003eHis small question worked. A smile spread out over Huey’s face. “Yaozu had a great idea, but he didn’t know how to make it happen. So I figured it out—it was easy as pie.”\u003c/p\u003e\n\u003cp\u003e“Well, what is this great idea?” They reached the first floor, and Houjin was nearly at a run, so it must be something good.\u003c/p\u003e\n\u003cp\u003e“We’re going to take their dynamite, and use it against them.”\u003c/p\u003e\n\u003cp\u003eHoujin stopped and faced him, and held out his hands like he could make his point better if he could gesture. “How much do you know about dynamite?” he asked.\u003c/p\u003e\n\u003cp\u003e“It blows things up.”\u003c/p\u003e\n\u003cp\u003e“Right. It blows things up, but you don’t want it to blow things up while you’re standing there holding it. You want to be a long way away when it goes off,” he said patiently. He’d lapsed into teacher mode.\u003c/p\u003e\n\u003cp\u003eRector didn’t care for being talked down to by somebody younger than him, but he was the one who’d asked, and now he had to take the explanation however he could get it. With a minimum amount of disdain, he said, “Obviously.”\u003c/p\u003e\n\u003cp\u003e“Obviously, yes. You obviously knew that.”\u003c/p\u003e\n\u003cp\u003e“Just tell me, would you?”\u003c/p\u003e\n\u003cp\u003e“Fine. In order to control it, you have a couple of choices: You can either give it a very long fuse, and light it, or you can take a very long wire, and use that wire to send the dynamite an electric spark. It’s usually generated by one of those pump boxes: You shove the plunger down, it makes a spark, the spark goes down the line, and boom! But we don’t want to use wire, and we don’t want to use a fuse.”\u003c/p\u003e\n\u003cp\u003eRector tried to look like he was following, but he was lost. “Then what would you use?”\u003c/p\u003e\n\u003cp\u003eHoujin beamed, with a tiny, unnerving edge of mischief that was made sharper by Rector’s irritation. “Time!” He took off again, Rector trailing behind him.\u003c/p\u003e\n\u003cp\u003e“Time?”\u003c/p\u003e\n\u003cp\u003e“You heard me! Don’t ask me to explain yet, ’cause it’ll be easier to show you. But for now, you’re on dynamite duty with me—and you have to listen. I’ll show you how to take care of it without blasting yourself to pieces.”\u003c/p\u003e\n\u003cp\u003eSince this qualified as a noble goal so far as Rector was concerned, he listened hard and promised to do what he was told. Ordinarily he’d make no such vows, but the prospect of blowing himself to Kingdom Come made him infinitely more responsive to instruction.\u003c/p\u003e\n\u003cp\u003e“But why are we in such a rush?” he asked, and asked it quickly, when Houjin paused to take a breath.\u003c/p\u003e\n\u003cp\u003e“Because we’re going to the tower.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-43.html","bookId":1670,"creation":"Oct 5, 2019 10:18:49 PM","modification":"Oct 5, 2019 10:18:49 PM"}
