{"id":102969,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHoujin dutifully tipped the fish back and forth, even though his arms were shaking. “I’m glad he did. Saved the captain, I mean.”\u003c/p\u003e\n\u003cp\u003eThey reached the corner where the jailhouse stood, melting on its foundations.\u003c/p\u003e\n\u003cp\u003eAngeline said, “Zeke, I want you to do something for me, all right?”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003e“I want you to go open that front door. If it’s locked, the lock won’t hold. Move as gentle as you can. Don’t startle the fellow we brought along with us.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eHe swallowed hard and left the group.\u003c/p\u003e\n\u003cp\u003eMoving with exaggerated slowness, as if to show that he was utterly harmless—never mind the ax—and that his task was wholly uninteresting to any creatures that may lurk in the fog … he approached the jail’s door.\u003c/p\u003e\n\u003cp\u003eRector could see the doors from his vantage point pressed against Angeline’s back. Although someone had chained them years ago, the chain looked about as strong as wet twine. Eaten up with rust and moisture, it crumbled when Zeke gave it a tug and clattered to the ground, disintegrating into a puff of damp red dust and a pile of rubble.\u003c/p\u003e\n\u003cp\u003e“Sasquatch won’t follow us inside,” Houjin speculated.\u003c/p\u003e\n\u003cp\u003eAngeline told him, “You don’t know that.”\u003c/p\u003e\n\u003cp\u003eZeke disappeared over the lockup’s threshold. Angeline nudged Houjin and Rector to do likewise. Together they crept over the last of the rubble, Houjin holding forth the fish like a talisman, as if it could protect him—and Rector thought maybe it could. If Rector were a sasquatch, faced with the prospect of eating a boy or eating a fish, he believed he’d go for the fish first.\u003c/p\u003e\n\u003cp\u003eSo he did what Angeline told him and stumbled backwards, forward, spinning slowly as they calibrated themselves to move together. And one by one—Rector first, then Angeline, then Houjin, who stayed at the threshold with the fish a moment longer—they stepped inside.\u003c/p\u003e\n\u003cp\u003eDarkness washed over them all, blinding them until their eyes adjusted.\u003c/p\u003e\n\u003cp\u003e“Huey, get in here. Keep showing him the fish, that’s right. Keep coming. I’ve got your back. He won’t hurt you—just bring him along. I’ve got my net.”\u003c/p\u003e\n\u003cp\u003e“He isn’t coming.”\u003c/p\u003e\n\u003cp\u003e“He’ll come.”\u003c/p\u003e\n\u003cp\u003eBut he didn’t. Not at first.\u003c/p\u003e\n\u003cp\u003eHe camped outside the jailhouse and—as its occupants soon realized, with no small degree of nervousness—he peeked in the windows and ran away. Then again. And a third time. A fourth. He lingered, skulked, and mulled the whole thing over. The fish. The jail. The four small things inside.\u003c/p\u003e\n\u003cp\u003eZeke watched for a bit, but as the sasquatch contemplated his next move, the younger boy left the team and wandered back into the gloom. The bland, uniform, brown-black shadows were cut only by slats of weak sunlight, filtered too many times to be stronger than a candle in the overwhelming darkness. Zeke slowly chased them anyway, following the little rays as far as they’d take him.\u003c/p\u003e\n\u003cp\u003eWhile Angeline and Houjin watched the entrance and waited for company, Rector watched Zeke, then joined him.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” he asked, whispering without knowing why. The place felt like a graveyard, but that wasn’t right, was it? No one had died here. Even Maynard hadn’t died until he got back to town, or that’s how the story went.\u003c/p\u003e\n\u003cp\u003e“Just looking,” Zeke murmured. “Never been here before, but I heard so much about it.”\u003c/p\u003e\n\u003cp\u003eHis hands trailed along cabinets and cubbyholes for mail; they dragged furrows in the dust along a solid plank desk covered with brittle scraps of curling paper. A metal stamp was on the floor. Rector found it by accident, kicking it with the edge of his boot. He retrieved it and examined it.\u003c/p\u003e\n\u003cp\u003eZeke asked, “What’s that?”\u003c/p\u003e\n\u003cp\u003eAnd Rector said, “Looks like something for making dates, over and over again.” He placed it beside a long-dried-out ink pad. “The kind of thing you use on official papers. Like birth certificates. Or court papers,” he added, thinking that it was more likely the prison processed felons than babies.\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eBut Zeke’s attention was already elsewhere.\u003c/p\u003e\n\u003cp\u003eHe puttered over to a board on the wall, about the size of the blackboard back at the orphan’s home. It was covered in rows of hooks, and each hook held an iron ring set with a single key. A small plaque beneath each key indicated which cell door it fit. Each of the keys was too corroded for anything but looking at, so Zeke didn’t molest them.\u003c/p\u003e\n\u003cp\u003eAnd at the board’s far left, a single hook was empty.\u003c/p\u003e\n\u003cp\u003eBeneath it was a grimy plaque that read, “Master set.”\u003c/p\u003e\n\u003cp\u003eHe touched the empty hook with one gloved finger, then tugged it as if it would grant him a wish. “This is the one,” he said. “The master set. Maynard took the keys, and he went…” Zeke turned on his heel and disappeared down the corridor that ran between the two rows of cells. He continued. “Down here. He went down here. And one by one, he opened the cells.”\u003c/p\u003e\n\u003cp\u003eIt was true, the doors were open. Some of them hung sadly on their tracks, ready to fall over if anyone so much as breathed on them. But back in the past, they had indeed been unlocked—and thrown aside so the occupants could escape.\u003c/p\u003e\n\u003cp\u003eZeke left the only footprints.\u003c/p\u003e\n\u003cp\u003e“He let them go, so they’d have a chance. Not all of them lived,” he mused. “Some of them were already weak, or sick, or what have you. And nobody knows how much gas it takes to turn somebody, or how much it takes to kill. But my granddaddy’d already run a mile through the Blight, up the hill. He was already poisoned.”\u003c/p\u003e\n\u003cp\u003eUnbidden, a thought rose in Rector’s mind.\u003c/p\u003e\n\u003cp\u003eNobody knows how much sap it takes, either.\u003c/p\u003e\n\u003cp\u003eHe did not say this aloud. Instead, he asked, “Do you think he knew he was dying? Your granddaddy, I mean.”\u003c/p\u003e\n\u003cp\u003eZeke stood between the rows, facing Rector—and backlit by the small barred square of a window that barely let in enough light to notice. Still, it cast a funny striped halo around the kid’s head; it made him look like a ghost.\u003c/p\u003e\n\u003cp\u003e“Dagnabbit,” Angeline complained from the main room.\u003c/p\u003e\n\u003cp\u003eZeke sighed, and Rector shivered free from whatever spell he’d been under.\u003c/p\u003e\n\u003cp\u003eThe princess continued to blaspheme. “The damn thing is sticking to his guns.”\u003c/p\u003e\n\u003cp\u003eRector and Zeke both returned to the main room, kicking up dust and bumping into things in the dull ambient light. Rector asked, “Where is he?”\u003c/p\u003e\n\u003cp\u003eAngeline shrugged, and said, “He’s staying outside. Maybe we should go back out again.”\u003c/p\u003e\n\u003cp\u003eHoujin nearly agreed. He seemed fully prepared to agree, standing at the threshold same as before, holding the shimmering dead fish with a drooping arm. He began to say something to that effect—that he thought they should go back outside, and take another try—but he didn’t get the chance.\u003c/p\u003e\n\u003cp\u003eHe was beaten to the punch by a long, hairy arm.\u003c/p\u003e\n\u003cp\u003eIt whipped inside and seized him with a snatch so slick that, for a split second afterwards, nobody moved. No one was sure what had occurred, or what ought to happen next. One moment, Houjin was standing there with the fish and looking like he felt a little silly. The next, he was simply gone.\u003c/p\u003e\n\u003cp\u003eZeke snapped to attention first. He barreled past Rector, and though Angeline shouted his name, commanded him to wait, he dashed out into the Blight-thick air.\u003c/p\u003e\n\u003cp\u003e“Come back here, boy!” she shouted, but she followed him, her net poised and ready for throwing. And Rector went, too, right behind her, because he didn’t know what else to do.\u003c/p\u003e\n\u003cp\u003eOut into the Blight they burst. Somewhere in the fog, Houjin began to holler, then abruptly stopped.\u003c/p\u003e\n\u003cp\u003e“Huey!” Zeke shouted.\u003c/p\u003e\n\u003cp\u003e“Houjin, where are you?” Angeline called.\u003c/p\u003e\n\u003cp\u003eRector swung his head back and forth, trying to place the sound of Houjin’s breathing, or the rumbling shakes of the big thing moving—carrying the boy off, or doing worse to him. “Huey?” he called.\u003c/p\u003e\n\u003cp\u003eHe shut his mouth after that and listened. He brandished his miner’s pick in every direction, spinning around and hunting any noise that meant the monster was at hand. He halted, sharp as a compass needle, pointing toward a thick spot in the Blight.\u003c/p\u003e\n\u003cp\u003eZeke needed no further instructions, so he charged—but Angeline grabbed him by the shirt and yanked him back.\u003c/p\u003e\n\u003cp\u003e“Don’t you just go rushing in,” she ordered, and some faint memory at the back of Rector’s head added where angels fear to tread. “I’ll go—you’re too worked up. Houjin?” she cried again, and nobody heard anything except soft, wet munching sounds.\u003c/p\u003e\n\u003cp\u003eZeke tore himself out of Angeline’s grasp, twisting his body to unfasten her grip, and launched himself forward once again. This time he was too fast; she missed with her second swipe, and Rector took off after him like a sheepdog herding a wayward lamb.\u003c/p\u003e\n\u003cp\u003e“Boys!” she shrieked.\u003c/p\u003e\n\u003cp\u003eBut he didn’t quit running, chasing after Zeke’s disappearing back. Behind him, he could hear Angeline on his heels; he didn’t turn around to look, and she quit wasting her breath telling the lot of them to stop.\u003c/p\u003e\n\u003cp\u003eZeke zipped in and out of the gas, zigzagging around obstacles and pushing himself through the thick air; it moved like curtains, billowing in a storm. Zeke ran like a phantom, darting into the mist. It gave Rector flashbacks—nasty ones—but he shook them free. He shook Angeline free, too, without meaning to. Her footsteps disappeared behind him, and again, he didn’t look back. He wasn’t sure what he wanted to see, or why it would matter.\u003c/p\u003e\n\u003cp\u003eHe had no idea where he was, no idea what Zeke was chasing, and no idea what they’d do when they caught up to the sasquatch.\u003c/p\u003e\n\u003cp\u003eZeke wasn’t much farther ahead in the planning process, and when he drew up short, Rector collided with the back of his head, nearly knocking his chin straight up into his skull. Dazed, he stumbled backward as Zeke stumbled forward. He caught himself on a splintered crate, then bounced over to a wall and held a corner of it until the stars that speckled his vision could be persuaded to die down.\u003c/p\u003e\n\u003cp\u003eThe stars died down. The Blight gas thinned.\u003c/p\u003e\n\u003cp\u003eAnd Rector saw them.\u003c/p\u003e\n\u003cp\u003eThe sasquatch was facedown in the last of the salmon, ignoring the needle-thin bones and slurping the scales, blood, and juices as if he was half-starved—which he probably was. How long had he been inside? Weeks, at least. What was there to eat within the wall? Nothing, except for rotters. And how good could they taste? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-52.html","bookId":1670,"creation":"Oct 5, 2019 10:18:49 PM","modification":"Oct 5, 2019 10:18:49 PM"}
