{"id":66958,"no":26,"title":"Page 26","content":"\u003cp\u003e“Oh, Jack! Look how much they’ve grown.”\u003c/p\u003e\n\u003cp\u003e“Shelly wrote and said they’re both walking already.”\u003c/p\u003e\n\u003cp\u003e“At nine months?” Olivia could well imagine all the mischief those boys were getting into. She didn’t envy the young couple. Thankfully, Jordan and Justine hadn’t walked until they were a year old. A brief sorrow, a pang of regret, came and went. She didn’t think about Jordan as much anymore. Whole days would pass without her dwelling on the death of her thirteen-year-old son, Justine’s twin brother. For years she’d played a heart-wrenching game of wondering how her life would’ve been different if Jordan had chosen to ride his bike that fateful August afternoon instead of heading to the lake with his friends. It was a question with no answer. Jordan had gone to the lake.\u003c/p\u003e\n\u003cp\u003e“I have new pictures of Isabella,” she said, unwilling to be outdone in the grandchild department. She scooped up her purse and removed a small “brag” book Grace had given her for pictures. “Look at Leif, too. You won’t believe how much he’s changed.”\u003c/p\u003e\n\u003cp\u003eWhile she finished studying the snapshots of Tedd and Todd, Jack flipped through the photo book.\u003c/p\u003e\n\u003cp\u003e“Isabella and Leif are cute,” Jack agreed, “but Tedd and Todd are cuter.”\u003c/p\u003e\n\u003cp\u003eSlowly Olivia lowered the snapshots. “You don’t want to go there, Jack Griffin. My grandchildren are the most perfect, beautiful grandchildren in the entire universe. I’d hate to slap a fine on you for denying the truth.”\u003c/p\u003e\n\u003cp\u003eHe sat back and arched his eyebrows. “Really? I could always write another article about you in The Chronicle,” he returned.\u003c/p\u003e\n\u003cp\u003eOlivia laughed. “Truce, truce. Let’s agree we both have the brightest, most intelligent grandchildren ever to grace the earth. Deal?”\u003c/p\u003e\n\u003cp\u003eJack smiled and reached for his fork. Only this bite was for her.\u003c/p\u003e\n\u003cp\u003eShe declined with a shake of her head, but Jack was having none of it.\u003c/p\u003e\n\u003cp\u003e“I’ll have to work it off later and I hate the treadmill.”\u003c/p\u003e\n\u003cp\u003e“We could always go walking.”\u003c/p\u003e\n\u003cp\u003eHowever, by now it’d stopped snowing and a light drizzle had started. “In the rain?”\u003c/p\u003e\n\u003cp\u003eJack frowned. “How about if you take me Christmas shopping? I need to mail off gifts for Eric, Shelly and the boys, and I could use the help.”\u003c/p\u003e\n\u003cp\u003e“Deal,” she agreed, and leaned forward to accept the sliver of pie. It really did taste divine and she closed her eyes to savor this small bite.\u003c/p\u003e\n\u003cp\u003e“You ready?” he asked, sipping his coffee.\u003c/p\u003e\n\u003cp\u003e“Ready.” She stood, picking up her coat, which was draped on the chair behind her.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until they were on their way out the door that Olivia realized this was the first time in months that Stan’s silent presence hadn’t loomed over them.\u003c/p\u003e\n\u003cp\u003eThis was a good sign, a very good sign indeed.\u003c/p\u003e\n\u003cp\u003eZach studied the young woman in the chair opposite his desk. This was the part of the job he detested most. Hiring new employees. Cecilia Randall was the last applicant of the day. He’d interviewed four others and had found some reason or other not to hire any of them.\u003c/p\u003e\n\u003cp\u003eCecilia Randall was nervous, eager to make a good impression. She was young, but she’d come with glowing references, although none were from bookkeeping firms. Her work experience so far had been as a restaurant hostess.\u003c/p\u003e\n\u003cp\u003eA dozen questions filled his mind, but federal regulations being what they were, Zach couldn’t ask them. He’d learned his lesson on that issue with Janice Lamond.\u003c/p\u003e\n\u003cp\u003e“You like accounting work, Ms. Randall?” he asked, clearing his throat.\u003c/p\u003e\n\u003cp\u003eShe nodded vigorously. “Very much. I had top marks in my class.” She leaned forward and motioned to an entry at the bottom of her résumé. “I recently earned my accounting degree from Olympic Community College in Bremerton.”\u003c/p\u003e\n\u003cp\u003eZach had noticed that. “I see your husband’s in the navy?”\u003c/p\u003e\n\u003cp\u003e“That’s correct. He’s currently out at sea.” She clasped her hands in her lap and squeezed her fingers tightly together. “I miss him very much, but his tour of duty is almost over.” She had the wistful look of a woman in love. That was good.\u003c/p\u003e\n\u003cp\u003eZach glanced over her résumé one final time and mentioned his main objection. “I don’t see any previous employment in this field.”\u003c/p\u003e\n\u003cp\u003eCecilia moved to the edge of her seat. “Yes, I know. Until recently I worked at The Captain’s Galley as a hostess. That was before it was sold. It’s The Lighthouse now.”\u003c/p\u003e\n\u003cp\u003eZach nodded absently; he was certainly familiar with the restaurant, since he did their taxes.\u003c/p\u003e\n\u003cp\u003eCecilia leaned closer. “They offered me a job, but I turned it down. Ian and I felt it was more important for me to finish my degree and get a job in the field I’ve been training in for the last three years.”\u003c/p\u003e\n\u003cp\u003eHe gave her an A for effort, Zach decided. She’d stuck out three years of classes and here she was.\u003c/p\u003e\n\u003cp\u003e“I’m willing to start at the bottom,” she offered. “I’d be grateful for the experience and the chance to prove myself.”\u003c/p\u003e\n\u003cp\u003eZach liked this young navy wife. Another good thing—she was married and from every indication the marriage was healthy. Although he’d never admit it, he didn’t want to work in close proximity to a single woman again. He hadn’t seen Janice for what she was until the damage was done.\u003c/p\u003e\n\u003cp\u003e“Can you start Monday morning?” he asked, making his decision. He was tired of doing interviews, and no other applicant had shown as much desire for the job as Cecilia Randall.\u003c/p\u003e\n\u003cp\u003eHer eyes grew huge. “You mean I’ve got the job?”\u003c/p\u003e\n\u003cp\u003eZach smiled. “It’s all yours.” He told her the salary and her eyes grew even bigger. He was afraid it wasn’t enough when she blurted out, “How much?” Embarrassed, she laughed and covered her mouth. “This is just great! You won’t be sorry, Mr. Cox. I’ll work hard and do my very best.”\u003c/p\u003e\n\u003cp\u003e“I know you will, Ms. Randall.”\u003c/p\u003e\n\u003cp\u003eAfter he left the office that evening, Zach stopped at the local grocery and picked up a whole cooked chicken. It had never been one of his favorite dinners, but it was quick and easy and he didn’t feel like fussing with meal preparation.\u003c/p\u003e\n\u003cp\u003eEddie’s face fell when he saw it. “I wanted spaghetti,” he complained.\u003c/p\u003e\n\u003cp\u003e“Chicken again?” Allison said. “Mom brought home a chicken two nights ago. Doesn’t anyone in this family know how to cook?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Zach said, losing his patience. “You do.”\u003c/p\u003e\n\u003cp\u003e“Me?” Allison snarled back at him. “What makes you think I can cook?”\u003c/p\u003e\n\u003cp\u003e“Didn’t you take home economics this trimester?”\u003c/p\u003e\n\u003cp\u003e“Yes, but we’re not—”\u003c/p\u003e\n\u003cp\u003e“You get home first in the afternoon—you can put on dinner for Eddie and me.”\u003c/p\u003e\n\u003cp\u003e“You want me to cook just because I’m a girl, don’t you?” Her eyes filled with fiery indignation.\u003c/p\u003e\n\u003cp\u003eZach wasn’t about to get caught in the “My Dad is a Chauvinist” trap. “If Eddie was home from school before you, I’d put him in change of dinner, but as it happens, you’re the first one to walk in the door. Congratulations, you’re elected. Your brother and I will wash the dishes.”\u003c/p\u003e\n\u003cp\u003e“I’d rather cook,” Eddie piped up.\u003c/p\u003e\n\u003cp\u003e“I’m afraid you’re out of luck, sport. Allison’s going to come up with a dinner plan for us.”\u003c/p\u003e\n\u003cp\u003e“A dinner plan?” She looked aghast. “What’s that?”\u003c/p\u003e\n\u003cp\u003eHe wondered if she’d been sleeping through her classes. “Make a list of what we’re going to eat for the next seven days and then compile a grocery list from that.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“You can cook spaghetti every night if you want to, Allison,” Eddie said enthusiastically.\u003c/p\u003e\n\u003cp\u003e“Here, write.” Zach set a notebook on the table in front of her.\u003c/p\u003e\n\u003cp\u003e“Can we have tacos one night?” Eddie begged. “Please, please?”\u003c/p\u003e\n\u003cp\u003e“I guess.” Allison reluctantly wrote tacos at the top of her list.\u003c/p\u003e\n\u003cp\u003e“What do we need for tacos?” Zach asked.\u003c/p\u003e\n\u003cp\u003e“Meat, cheese, tomatoes, lettuce and taco shells,” she said.\u003c/p\u003e\n\u003cp\u003e“Great,” Zach said, pointing at her. “Write all that down on a separate shopping list.”\u003c/p\u003e\n\u003cp\u003e“We have cheese,” Eddie told him. “Mom bought it for macaroni and cheese on Monday night.”\u003c/p\u003e\n\u003cp\u003e“Fine, but we need taco shells, tomatoes and lettuce.”\u003c/p\u003e\n\u003cp\u003eAllison dutifully listed the ingredients. They continued, with Eddie making dinner suggestions and Allison creating the list. Actually it was fun, and by the time they’d finished, the table was set and they were ready for dinner.\u003c/p\u003e\n\u003cp\u003eEddie held a chicken leg with both hands. “Are you really going to cook for us, Allison?” he asked his sister.\u003c/p\u003e\n\u003cp\u003eAllison shrugged. “Only because Dad’s making me.”\u003c/p\u003e\n\u003cp\u003eIn an effort to bring family discussions back to the dinner table, Zach asked his two children about their days.\u003c/p\u003e\n\u003cp\u003eIn typical Allison fashion, she rolled her eyes. “All right, I guess.”\u003c/p\u003e\n\u003cp\u003e“I had a great day,” Eddie said, describing in detail every aspect of his fifth-grade life.\u003c/p\u003e\n\u003cp\u003e“What about you?” Allison asked when Eddie had finished.\u003c/p\u003e\n\u003cp\u003e“Me?” Zach replied, and then realized he didn’t have anything to hide. “I hired a new assistant this afternoon.”\u003c/p\u003e\n\u003cp\u003e“Is she pretty?” Eddie asked.\u003c/p\u003e\n\u003cp\u003eBefore he could answer, the phone rang, and like a comic strip hero in a mask and cape, Allison dove for the phone. Her enthusiasm died when she discovered it was her mother.\u003c/p\u003e\n\u003cp\u003eAlthough Zach could only hear one side of the conversation, it was obvious from Allison’s answer that Rosie had asked what they were doing.\u003c/p\u003e\n\u003cp\u003eHis daughter gave a long, beleaguered sigh. “We’re just sitting around the dinner table and Dad’s telling us about hiring a new assistant.”\u003c/p\u003e\n\u003cp\u003eZach wanted to groan aloud. He’d rather Rosie didn’t know that Janice had quit and left him high and dry. The fact that she’d handed in her notice was embarrassing enough. But to own up to the poor choice he’d made when he’d hired her—to Rosie of all people—would be mortifying. It’d been hard enough to admit it to himself.\u003c/p\u003e\n\u003cp\u003eHis appetite gone, Zach stood and carried his plate to the kitchen. He scraped it off and set it inside the dishwasher.\u003c/p\u003e\n\u003cp\u003eEddie talked to his mother, too, and after a few minutes, his son called him. “Mom wants to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Okay, sure.” He knew she wasn’t going to let the information slide, and he was right.\u003c/p\u003e\n\u003cp\u003eThe moment he was on the phone, Rosie asked the question he’d been expecting. “You’re hiring a new assistant?”\u003c/p\u003e\n\u003cp\u003e“Oh, I guess Allison told you,” he muttered. “I’m trying to get back to family discussions over the dinner table—all of us sharing part of our day.”\u003c/p\u003e\n\u003cp\u003e“What happened to Janice Lamond?”\u003c/p\u003e\n\u003cp\u003eShe was certainly persistent. “Nothing’s happened to her.”\u003c/p\u003e\n\u003cp\u003e“If that’s the case, then why are you hiring another assistant?”\u003c/p\u003e\n\u003cp\u003e“Why?” he repeated as if the answer should be obvious. “I need one.”\u003c/p\u003e\n\u003cp\u003e“Janice got a promotion, didn’t she?” \u003c/p\u003e","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-26.html","bookId":1943,"creation":"Oct 5, 2019 10:03:11 AM","modification":"Oct 5, 2019 10:03:11 AM"}
