{"id":66960,"no":28,"title":"Page 28","content":"\u003cp\u003e“You were the one who insisted you didn’t want Jon in your life.”\u003c/p\u003e\n\u003cp\u003e“I don’t,” she blurted out, and knew it was a lie. “I didn’t,” she amended, “but I’ve had a change of heart.”\u003c/p\u003e\n\u003cp\u003e“That could be the problem,” her mother said. She got up as the water started to boil.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Maryellen asked.\u003c/p\u003e\n\u003cp\u003e“Maybe Jon’s had a change of heart himself.”\u003c/p\u003e\n\u003cp\u003eSixteen\u003c/p\u003e\n\u003cp\u003eWith only a few days left before Christmas, Corrie McAfee was eager to finish the last of her shopping. She’d assumed that when Roy took early retirement from the Seattle police force they’d travel. Touring Europe was something they’d talked about for years.\u003c/p\u003e\n\u003cp\u003eRetirement had sounded so liberating. No alarm clocks; a come-and-go-as-you-please kind of lifestyle. It had been that way at first, but Roy had gone stir-crazy within eighteen months. Shortly after their arrival in Cedar Cove, he’d hung out his shingle as a private investigator.\u003c/p\u003e\n\u003cp\u003eLinnette, their twenty-four-year-old daughter, had predicted as much. The older of their two children, she was most like her father. She shared Roy’s insight into people; they both possessed an innate ability to read character and see through pretense. Linnette also had a genuine desire to help people, especially children. In fact, she was receiving her physician’s assistant degree in June. She’d be arriving for the holidays on Wednesday afternoon, and joining Corrie and Roy for the Christmas Eve worship service at church.\u003c/p\u003e\n\u003cp\u003eMack was coming to Cedar Cove, too, but their son wouldn’t get there until Christmas morning. Mack was a mailman in the Seattle area. He’d never enjoyed school or succeeded at it the way his sister had. Corrie believed that, in time, he’d decide to further his education, but if he didn’t, that was fine, too. He was generous, hard-working and honest. Roy, however, had bigger aspirations for his only son, and it had caused a rift between him and Mack. A small one they both chose to ignore, but they weren’t close, and that troubled Corrie.\u003c/p\u003e\n\u003cp\u003e“Are you going out?” Roy asked as he left his office and found her wearing her coat.\u003c/p\u003e\n\u003cp\u003e“Peggy and I are meeting for lunch,” she told him. “Then we’re off to the mall.”\u003c/p\u003e\n\u003cp\u003eHer husband leaned against her desk in a relaxed pose. “You like Peggy, don’t you?”\u003c/p\u003e\n\u003cp\u003eCorrie nodded. They’d lived in Cedar Cove nearly four years now and hadn’t established a lot of friendships. In the beginning, Corrie had been busy setting up their home. Later she was involved with helping Roy establish the agency. There’d been overtures of friendship from their neighbors, but Corrie and Roy tended to keep to themselves. That was how it had been in Seattle, and they’d maintained the same approach here. They waved to the neighbors, collected their mail while they were on vacation, but that was about the extent of it.\u003c/p\u003e\n\u003cp\u003ePeggy Beldon, however, was someone who genuinely interested Corrie, for a number of reasons. Corrie had a small garden space at the back of their property. Her yard in Seattle had been shaded and too small for anything other than a few flowers. After seeing Peggy’s herb garden, she wanted to plant her own. But Corrie liked Peggy for more than her gardening expertise.\u003c/p\u003e\n\u003cp\u003eThe day Bob came into the office and Corrie had chatted with Peggy, the other woman had graciously offered Corrie a few seedlings. That was the beginning of their friendship. Twice now, they’d met for lunch to chat, exchange recipes and get to know each other. Both times Corrie had come away with the feeling that she’d made a friend.\u003c/p\u003e\n\u003cp\u003e“You don’t mind if I take the time off, do you?” she asked. Her question was a polite formality, since Roy had encouraged the friendship.\u003c/p\u003e\n\u003cp\u003eHer husband shook his head. “By all means, tackle the mall. You’re braver than I am by a long shot.”\u003c/p\u003e\n\u003cp\u003e“You don’t have any appointments this afternoon?”\u003c/p\u003e\n\u003cp\u003eHe looked at her absently. Corrie knew him well enough to realize his mind had drifted in another direction altogether. “What are you thinking about?” she asked.\u003c/p\u003e\n\u003cp\u003eRoy continued to stare into space.\u003c/p\u003e\n\u003cp\u003e“Roy?”\u003c/p\u003e\n\u003cp\u003eHe frowned, and it was clear he hadn’t even heard her the first time. Roy was like this. His thoughts would venture off onto some case and it’d be practically impossible to get his attention.\u003c/p\u003e\n\u003cp\u003e“Is it the mystery man again?” she asked. She knew that some part of his brain refused to let this lie. He needed answers, resolution. It was one of the reasons he’d advanced quickly through the ranks of the Seattle Police Department to become a detective, a position he’d held for most of his career.\u003c/p\u003e\n\u003cp\u003e“You want my opinion?” she said.\u003c/p\u003e\n\u003cp\u003eRoy grinned. “I have a feeling you’re going to give it to me, anyway, so why not?”\u003c/p\u003e\n\u003cp\u003e“I suspect this John Doe was lost and looking for a place to stay. You and I both know there are only a couple of motels in town.”\u003c/p\u003e\n\u003cp\u003e“Both are off the Interstate,” Roy reminded her.\u003c/p\u003e\n\u003cp\u003e“So he took an early exit and got lost. That’s easy enough to do,” Corrie reasoned. “Remember the first time we drove to Cedar Cove?” If he didn’t remember, she certainly did. They’d driven across the Narrows Bridge on a sunny Sunday afternoon, searching out areas in Puget Sound where their retirement income would match the cost of living.\u003c/p\u003e\n\u003cp\u003eCorrie had been reading the map and become confused. Consequently, Roy had exited the freeway too soon and they’d found themselves in what was primarily a rural area. They’d driven past small farms and horse ranches and then along stretches of undeveloped waterfront. They’d both grown excited when they realized property values were fifty percent less than they were across the water.\u003c/p\u003e\n\u003cp\u003e“I remember,” Roy said. “But if that was the case, the mystery man would’ve had to travel a long way in the dark, on unfamiliar roads, and then he just stumbled onto the Beldons’ bed-and-breakfast.” He rubbed his jaw. “I suppose it’s possible. With the renaming of some streets, anyone, especially a visitor, could get confused.” Part of Lighthouse Road, on the other side of Harbor Street, was now called Cranberry Point.\u003c/p\u003e\n\u003cp\u003e“True.” Roy had a point. The Thyme and Tide wasn’t on the beaten path and was miles away from the exit she’d mentioned.\u003c/p\u003e\n\u003cp\u003e“So much of his visit to town doesn’t add up,” Roy muttered. “The fact that he had plastic surgery has bothered me from the beginning.”\u003c/p\u003e\n\u003cp\u003e“I thought the coroner said it looked like the guy had some kind of accident.”\u003c/p\u003e\n\u003cp\u003e“He did,” Roy said, “but Bob said there was something vaguely familiar about him. I keep thinking about that, too.”\u003c/p\u003e\n\u003cp\u003e“Let it go,” she urged. “It’s almost Christmas.” If Roy took a break from the case, he might free his mind to explore solutions. It often happened like that; a case would lie fallow for months and then overnight a small piece of evidence her husband had found months earlier—a bit of conversation, a previously unrelated detail—would suddenly click into place. Soon afterward, he’d have the answers he needed.\u003c/p\u003e\n\u003cp\u003e“I can’t do that just yet,” he mumbled. “I’ve got a few feelers out.”\u003c/p\u003e\n\u003cp\u003eCorrie nearly groaned. The problem was, once Roy asked for favors, he owed just as many in return. It all depended on whom he’d contacted and why. “What sort of feelers?”\u003c/p\u003e\n\u003cp\u003e“Not to worry, most of it can be done over the Internet.”\u003c/p\u003e\n\u003cp\u003e“It’s almost Christmas,” she reminded him again. For once, she wanted him to simply enjoy the holiday and stop thinking about work.\u003c/p\u003e\n\u003cp\u003e“Yes,” he agreed mildly.\u003c/p\u003e\n\u003cp\u003e“Our children will be home soon, and it’s important that we spend time as a family.”\u003c/p\u003e\n\u003cp\u003e“I agree,” he said, “but I want you to remember there’s another family somewhere who’s missing a father this Christmas.”\u003c/p\u003e\n\u003cp\u003eCorrie had remained emotionally detached from the man who’d turned up dead at the Beldons’ B and B. He was a stranger who’d chosen to carry false identification. Nothing was known about him or his reasons for being in town. Because of that, Corrie hadn’t thought of him as a real person with a home and a wife and perhaps children.\u003c/p\u003e\n\u003cp\u003e“You’re doing a missing person’s search, aren’t you?”\u003c/p\u003e\n\u003cp\u003eRoy shrugged, which in itself was an answer. “Go, and have a good time with Peggy,” he told her.\u003c/p\u003e\n\u003cp\u003e“Do you want me to bring you back anything for lunch?”\u003c/p\u003e\n\u003cp\u003eRoy shook his head. “I’ll get by with peanut butter and jelly.” His favorite midday meal.\u003c/p\u003e\n\u003cp\u003eCorrie left then, and spent a pleasant afternoon with her new friend. It felt good to get out, to be part of the annual Christmas-shopping experience. They ate at the mall’s food court, chatting over pizza slices and Coke as holiday tunes filled the air. Soon the two women were caught up in the crowd of shoppers.\u003c/p\u003e\n\u003cp\u003eCorrie bought Linnette new gloves and Mack a Cedar Cove sweatshirt, and Peggy chose a new golf club for Bob and a book of plays. Bob loved community theater. Roy and Corrie had recently seen him in the fall production of Arsenic and Old Lace. He was actually quite talented. For her husband, Corrie bought a beautiful volume of Sherlock Holmes stories.\u003c/p\u003e\n\u003cp\u003eFrom Peggy’s comments, Corrie sensed that Bob was putting the unfortunate circumstances regarding the John Doe behind him. She knew the police had questioned him, but whatever their concern, it had apparently been laid to rest.\u003c/p\u003e\n\u003cp\u003eThe two women left the mall at about three, saying goodbye in the parking lot. Vendors sold fresh-cut Christmas trees, and Corrie breathed deeply, inhaling the pungent scent of pine and fir. Nothing smelled more like Christmas.\u003c/p\u003e\n\u003cp\u003eWhen she returned to the office, she found Roy hunched over his computer, a plate and an empty milk glass sitting on his desk. He stared intently at the computer screen and hadn’t noticed her.\u003c/p\u003e\n\u003cp\u003e“Any phone calls?” she asked.\u003c/p\u003e\n\u003cp\u003eRoy raised his head. “Oh, hi. What? Phone calls?”\u003c/p\u003e\n\u003cp\u003e“Did the telephone go ring, ring, ring?” she teased.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“Do you want to hear about my lunch?” She waited, but when he didn’t respond, she continued. “In case you’re interested, Peggy and I had a great time. I was thinking maybe we could invite them over for New Year’s Eve.”\u003c/p\u003e\n\u003cp\u003eAgain nothing.\u003c/p\u003e\n\u003cp\u003eCorrie sighed. “Peggy’s such a good cook, I’ll bet no one ever thinks to invite her to dinner. You like Bob, don’t you?”\u003c/p\u003e\n\u003cp\u003eHer husband stared up at her blankly. Corrie was starting to feel irritated.\u003c/p\u003e\n\u003cp\u003e“I like the Beldons,” she said in a firm voice. “I think all four of us could become friends.”\u003c/p\u003e\n\u003cp\u003eRoy leaned back in his chair and fixed his gaze on her. “I don’t think that would be a good idea.”\u003c/p\u003e\n\u003cp\u003eCorrie’s cheerful mood evaporated. “Why not?” she asked.\u003c/p\u003e\n\u003cp\u003eRoy stood and walked slowly around his desk. His shoulders slouched, he ran his hand through his hair, disheveling it.\u003c/p\u003e\n\u003cp\u003eCorrie stiffened. Roy had found something in his Internet search, and whatever it was, he didn’t want to tell her.\u003c/p\u003e\n\u003cp\u003e“Do you think Bob is somehow linked to the John Doe?” she asked bluntly.\u003c/p\u003e\n\u003cp\u003eRoy’s eyes met hers and he nodded.\u003c/p\u003e\n\u003cp\u003eShe swallowed tightly. The one friend she’d found, and now this. \u003c/p\u003e","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-28.html","bookId":1943,"creation":"Oct 5, 2019 10:03:11 AM","modification":"Oct 5, 2019 10:03:11 AM"}
