{"id":66963,"no":31,"title":"Page 31","content":"\u003cp\u003eJon brought a bottle of white wine and a bouquet of yellow daisies.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said, ushering him in.\u003c/p\u003e\n\u003cp\u003e“Thanks for inviting me.” Jon stepped into the house and stood there for a moment, looking awkward and out of place. He seemed as nervous as Maryellen. Katie sat upright in her bassinet and obviously recognized her daddy’s voice. Almost immediately she started chattering and waving her arms.\u003c/p\u003e\n\u003cp\u003e“She’s really developing a personality, isn’t she?” Jon said. He walked over to the bassinet, lifting Katie into his arms with familiar ease. Maryellen recalled how uncomfortable he’d seemed in the beginning. That had definitely changed.\u003c/p\u003e\n\u003cp\u003e“I’ll get dinner on the table,” Maryellen told him. She’d forgotten to remove her apron, which she immediately stuffed into a kitchen drawer. Heaven forbid he should know how hard she’d worked on this meal.\u003c/p\u003e\n\u003cp\u003eJon followed her into the kitchen and grinned when he noticed the number of open cookbooks.\u003c/p\u003e\n\u003cp\u003eMaryellen’s gaze followed his. “Mom told me that the people with the most cookbooks are the ones who cook the least. That’s certainly true in my case.”\u003c/p\u003e\n\u003cp\u003e“I’m easy to please.”\u003c/p\u003e\n\u003cp\u003eMaryellen hoped that was true. “I’m not much good at this, so if dinner isn’t up to par, I hope you’ll take into account that I don’t do this often.” The serving dishes were already out, and she quickly transferred everything from the stove to the table.\u003c/p\u003e\n\u003cp\u003e“Katie’s already eaten,” she said, standing at the table with her hands on the back of her chair, fingers clenching it tightly.\u003c/p\u003e\n\u003cp\u003eJon put his daughter back in the bassinet and joined Maryellen. She’d placed the flowers in a crystal vase; they provided a cheery accent and perfectly complemented her pale yellow table linens. He opened the bottle and poured them each a glass as she jumped up to put on some music. When she finally sat down across from him, she offered him a shy smile. She was an emotional mess; if he said one derogatory thing about this dinner, she knew she’d burst into tears.\u003c/p\u003e\n\u003cp\u003eJon served her and then himself, although by this time she had no appetite.\u003c/p\u003e\n\u003cp\u003e“I was surprised you came,” she said, not meeting his eyes. When she’d issued the invitation for New Year’s, she wasn’t at all sure he’d accept. For some reason, it seemed important to start this year off right, and for Maryellen that included a good relationship with her baby’s father.\u003c/p\u003e\n\u003cp\u003e“I’m surprised I did, too,” Jon confessed.\u003c/p\u003e\n\u003cp\u003eThat stung. So much for flattering her ego or reassuring her. “Why did you?” she asked.\u003c/p\u003e\n\u003cp\u003eJon glanced up, grinning sheepishly. “You seemed so sincere. I guess I wanted to be with you more than I wanted to stay away.”\u003c/p\u003e\n\u003cp\u003eThat was as confusing as his original comment. She thought about pressing the issue, then decided against it. “Thank you for the photo album. I love it.”\u003c/p\u003e\n\u003cp\u003e“I liked your gift, too. No one’s ever knit me socks before.”\u003c/p\u003e\n\u003cp\u003e“Did they fit?”\u003c/p\u003e\n\u003cp\u003eHe nodded and pointed down at his feet with a smile. “Wearing them now.” She smiled back. As he reached into the middle of the table for a dinner roll, Maryellen automatically passed him the butter.\u003c/p\u003e\n\u003cp\u003e“I wish you could’ve been with us at Christmas, but you had other plans, and I understand that,” she said, watching him for any telltale sign that would indicate where he’d been and with whom.\u003c/p\u003e\n\u003cp\u003eTo her disappointment, Jon didn’t comment.\u003c/p\u003e\n\u003cp\u003eThey ate silently for a few moments and then Maryellen put down her fork. She couldn’t swallow another bite. “I wanted you to come tonight because…because I feel I owe you an apology—for the way I behaved when I learned I was pregnant.”\u003c/p\u003e\n\u003cp\u003eHis eyes, flashing with amusement, flew up to meet hers. “I like it when you apologize. Remember the last time?”\u003c/p\u003e\n\u003cp\u003eMaryellen had forgotten how they’d ended up kissing….\u003c/p\u003e\n\u003cp\u003e“Anyway, you don’t owe me an apology,” he assured her.\u003c/p\u003e\n\u003cp\u003eBut she did, and she had every intention of saying what needed to be said. “Then I owe you an explanation.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “It isn’t important.”\u003c/p\u003e\n\u003cp\u003e“It is to me.” Maryellen’s voice trembled slightly. She should probably wait until after dinner, but the need to explain felt like a rock on her chest. She wouldn’t be able to enjoy any part of their evening until she’d unburdened herself to Jon.\u003c/p\u003e\n\u003cp\u003e“I think you know that I was married while I was in college.” She set her napkin on the table and picked up the wineglass. Her hand tightened around the stem as she took a long sip of the spicy gewürztraminer—coincidentally one of her favorite wines. It had a calming effect on her. “Clint and I got married for all the wrong reasons.”\u003c/p\u003e\n\u003cp\u003e“Everyone has regrets,” Jon said gently.\u003c/p\u003e\n\u003cp\u003e“Some people have more than others,” she whispered, unable to look at him. “Clint and I were careful, but I was pregnant at the time.”\u003c/p\u003e\n\u003cp\u003e“So the pregnancy’s the reason you married him?”\u003c/p\u003e\n\u003cp\u003eShe was ashamed to admit the truth. “I married him because I’d convinced myself I loved him and that he loved me. He didn’t want the baby. He thought it best to terminate the pregnancy.”\u003c/p\u003e\n\u003cp\u003eJon was silent as he leaned back in his chair.\u003c/p\u003e\n\u003cp\u003eUnable to remain sitting, Maryellen stood and walked into the living room, stopping by Katie’s bassinet. She peered at her sleeping baby, tears trickling down her cheeks. Impatiently she dashed them away.\u003c/p\u003e\n\u003cp\u003eThere would be other pregnancies, other babies, Clint had told her, but the timing was critical. Maryellen had listened to him. She went against every dictate of her heart, and she’d regretted it from that moment on. For years she’d struggled with the guilt and the shame of what she’d done. What she’d never admitted to herself or to Clint, until it was too late, was how much she’d wanted her baby. She didn’t blame her ex-husband. She was the one who walked into the clinic. The one who’d signed the consent form. She accepted full responsibility.\u003c/p\u003e\n\u003cp\u003e“Maryellen,” Jon said, coming up behind her. He placed his hands on her shoulders. “It’s all right—there’s no need to say any more. I can figure out what happened.”\u003c/p\u003e\n\u003cp\u003e“Can you?”\u003c/p\u003e\n\u003cp\u003eJon turned her and brought her into his arms.\u003c/p\u003e\n\u003cp\u003e“I didn’t want you to know I was pregnant last year,” she said, her face buried in his shoulder. “I was afraid you’d react the way Clint did.”\u003c/p\u003e\n\u003cp\u003e“I’m not Clint.”\u003c/p\u003e\n\u003cp\u003e“I know. You’re nothing like him. I know that now.” What she didn’t know was anything about his past. Even now, more than a year later, she’d learned very little—just fragments of his history. Small bits of information he’d let drop now and then. Every time she pried into his life, he pulled away from her, both physically and emotionally. Maryellen had come to rely on him in so many ways, she couldn’t bear to risk that withdrawal, so she kept her questions to herself.\u003c/p\u003e\n\u003cp\u003eShe slowly raised her eyes to Jon’s, fearing what she’d see. Instead of condemnation and repulsion, she saw understanding and love. If he’d judged her harshly, she wasn’t sure what she would have done. When she saw his love, her reaction was instinctive.\u003c/p\u003e\n\u003cp\u003eShe kissed him.\u003c/p\u003e\n\u003cp\u003eIt’d been weeks since they’d last touched, since she’d been in his arms. Maryellen hadn’t truly understood how much she’d missed him—everything about him—and the moment their mouths met, she lost control.\u003c/p\u003e\n\u003cp\u003eJon’s reaction was immediate. He splayed his fingers in her hair and their kisses became passionate, full of desperation and need. When he broke it off, he had to catch his breath. Maryellen clung to him, her own breathing labored.\u003c/p\u003e\n\u003cp\u003e“I’m not sure this is such a good idea,” he said as he disengaged her arms from around his neck. Holding both her hands in his, he retreated a step.\u003c/p\u003e\n\u003cp\u003eThis was what Maryellen had dreaded. Her heart sank as she pulled her hands free. She’d waited too long to tell him, delayed explaining. “There’s someone else…isn’t there?”\u003c/p\u003e\n\u003cp\u003e“Someone else?” he repeated. “No way.” He reached for her and brought her back into his arms. Then he kissed her again, and again. Harder, deeper, longer.\u003c/p\u003e\n\u003cp\u003eHe was telling her the truth; she had her answer. Although she knew almost nothing about Jon, she trusted him. He couldn’t kiss her like this if he was involved with another woman. Soon, however, he eased away from her again, his reluctance obvious.\u003c/p\u003e\n\u003cp\u003eMaryellen didn’t want him to stop, and when she managed to shake off the warm haze that enveloped her, she opened her eyes and stared up at him.\u003c/p\u003e\n\u003cp\u003e“Jon?” That was when she realized he planned to end their lovemaking. “Don’t stop,” she pleaded, “please don’t stop.”\u003c/p\u003e\n\u003cp\u003e“You don’t know what you’re asking.”\u003c/p\u003e\n\u003cp\u003e“I do know. You don’t want me?” She hated the plea she heard in her own voice.\u003c/p\u003e\n\u003cp\u003eFor just a moment, a hint of a smile touched his mouth. “In case you haven’t noticed, I want you very much.”\u003c/p\u003e\n\u003cp\u003e“But I…I want you, too.” She blushed as she said it. Until Jon, there’d only been one man in her life, so she didn’t say those words lightly. If they were lovers again, he’d know she was sincere, he’d know she regretted the way she’d treated him earlier. He’d know how much she wanted him to be a permanent part of her life and Katie’s.\u003c/p\u003e\n\u003cp\u003eSlowly, Jon shook his head.\u003c/p\u003e\n\u003cp\u003eStunned and hurt, Maryellen retreated a step. She could only imagine what he must think of her, blatantly throwing herself at him like that. Perhaps this was his way of punishing her. She’d been brutal in her rejection of him and now it was her turn.\u003c/p\u003e\n\u003cp\u003eJon frowned, and his eyes narrowed. “I don’t know what you’re thinking, but whatever it is, you’re wrong.”\u003c/p\u003e\n\u003cp\u003eKatie began to wake—the perfect excuse for Maryellen to turn away and recover her pride and her composure. The moment she lifted Katie from the carrier, Maryellen could tell the baby needed changing.\u003c/p\u003e\n\u003cp\u003e“She needs a fresh diaper,” she said, welcoming the excuse to leave the room.\u003c/p\u003e\n\u003cp\u003eJon wouldn’t allow her to escape. He followed her into the nursery. “Are you on the pill?” he demanded.\u003c/p\u003e\n\u003cp\u003e“No…” There wasn’t any need for her to be.\u003c/p\u003e\n\u003cp\u003e“I don’t have anything to protect you.”\u003c/p\u003e\n\u003cp\u003eShe was an idiot. Of course he was worried about birth control. They were already batting a thousand, and there was no guarantee that she couldn’t, wouldn’t, get pregnant a second time.\u003c/p\u003e\n\u003cp\u003e“I’m still nursing, and there’s less likelihood I’d get caught.” But that sounded weak, even to her own ears. She’d been caught easily enough with Katie. “That isn’t why you refused me, though, is it?”\u003c/p\u003e\n\u003cp\u003e“No.” At least he was honest, even if the truth hurt. “No,” he repeated. “The fact is, Maryellen, I’m not interested in another one-night stand with you.”\u003c/p\u003e\n\u003cp\u003e“Do you seriously think that’s what I wanted?” She quickly disposed of the wet diaper and exchanged it for a fresh one. “I…I didn’t plan to invite you into my bed, if that’s what you’re thinking. Dinner wasn’t about that. It just sort of…went in that direction.” Although she’d hoped this meeting would be a new beginning for them—emotionally and, yes, physically. \u003c/p\u003e","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-31.html","bookId":1943,"creation":"Oct 5, 2019 10:03:11 AM","modification":"Oct 5, 2019 10:03:11 AM"}
