{"id":66976,"no":44,"title":"Page 44","content":"\u003cp\u003eHannah’s face was troubled. “He never forgave himself for that.”\u003c/p\u003e\n\u003cp\u003e“What caused the accident?”\u003c/p\u003e\n\u003cp\u003eHer eyes widened. “The investigation determined that my father was at fault.”\u003c/p\u003e\n\u003cp\u003e“I read the accident report,” Roy said slowly, “and your father claimed the steering failed.”\u003c/p\u003e\n\u003cp\u003e“He did say that,” Hannah agreed, “but the accident investigators couldn’t find anything wrong with the steering system. The only thing they could suggest is the tube leading to the automatic steering system had an air pocket in it. Apparently that sometimes happens, but it’s rare, and without any conclusive evidence, my father was found to be at fault.” She paused and looked at Sheriff Davis. “I think in some ways it might’ve been easier on my dad if he’d died that night.”\u003c/p\u003e\n\u003cp\u003e“The guilt?” Troy asked.\u003c/p\u003e\n\u003cp\u003e“That,” she said, “and month upon month of surgery and physical therapy.”\u003c/p\u003e\n\u003cp\u003e“What about your father’s friends?” Roy asked next.\u003c/p\u003e\n\u003cp\u003eHannah glanced down at her hands. “Dad was pretty much a loner. He didn’t have a lot of friends. Oh—there was one old army buddy who helped him get into the VA hospital where he was treated. But other than that…” She shook her head. “Mom told me he was a different man before the war. They were just dating back then, and she saved all his letters. Some days after they’d had an argument, she would sit on their bed and read them. She said they reminded her of what Dad was like before the war.\u003c/p\u003e\n\u003cp\u003e“Do you still have those letters?” Roy asked.\u003c/p\u003e\n\u003cp\u003e“I’d like to see them if you do,” Sheriff Davis said before Roy could ask.\u003c/p\u003e\n\u003cp\u003e“Yes, but I’d want them back.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Troy Davis assured her.\u003c/p\u003e\n\u003cp\u003e“I understand you knew my father.” Hannah’s question was directed at Bob.\u003c/p\u003e\n\u003cp\u003eHe nodded. “We spent a year together in Nam.”\u003c/p\u003e\n\u003cp\u003e“Can you tell me what he was like then?”\u003c/p\u003e\n\u003cp\u003eBob leaned back in his chair and took a moment to compose his thoughts. “What I remember most about Max is his guitar. At the end of the day, we’d sit around and he’d bring it out and strum a few songs. You can’t imagine how much music can do to take the edge off, especially in the situation your dad and I were in.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know my father played the guitar.”\u003c/p\u003e\n\u003cp\u003e“He didn’t after—” Bob stopped abruptly and faltered. “Something happened in the war that affected both your father and me. War is like that. It can destroy your soul.”\u003c/p\u003e\n\u003cp\u003e“He never spoke of the war,” she said softly.\u003c/p\u003e\n\u003cp\u003eBob didn’t, either. When he’d first returned from Nam, Peggy had thought it would help if her husband talked about his experiences. He’d refused. Had she known what demons hounded him, she would’ve suggested counseling, but he kept many of his experiences hidden from her. It wasn’t until he’d just about drowned in a bottle that she understood why, and by then it was almost too late.\u003c/p\u003e\n\u003cp\u003e“Is there anything else you’d like to ask us?” Peggy inquired.\u003c/p\u003e\n\u003cp\u003eHannah shook her head. “I appreciate that you let me come. I wondered, you know. Anyone would. He’s gone…both he and my mom. I just wondered….”\u003c/p\u003e\n\u003cp\u003eLike Hannah, Peggy wondered if she and Bob would ever find peace.\u003c/p\u003e\n\u003cp\u003eRosie tried not to dwell on Zach’s confession that he’d relied emotionally on his personal assistant. In essence, Zach had admitted to falling in love with the other woman. She’d known in her heart that he’d been unfaithful, and he’d proved her at least partially right. Rosie could only speculate about what had happened, but—as he’d admitted—eventually Zach would have become Janice’s lover.\u003c/p\u003e\n\u003cp\u003eTheir divorce had been final for months, and by now she should be ready to move on. Instead, she felt as if she was falling deeper and deeper into an abyss, a place of uncertainty and sadness.\u003c/p\u003e\n\u003cp\u003eSunday afternoon she waited until she was sure Zach would be out of the house before she arrived. Her entrance didn’t cause much of a stir. Eddie was reading one of the Harry Potter books and Allison was in her bedroom with the door closed.\u003c/p\u003e\n\u003cp\u003e“What’s for dinner?” Eddie asked, glancing up when she came in, carrying two plastic grocery bags.\u003c/p\u003e\n\u003cp\u003e“How about spaghetti?” she asked, knowing it was her son’s favorite.\u003c/p\u003e\n\u003cp\u003e“We had that last night, and I like Dad’s spaghetti sauce better than yours.”\u003c/p\u003e\n\u003cp\u003e“Thank you so much,” she muttered under her breath. Her son was nothing if not honest.\u003c/p\u003e\n\u003cp\u003eWhen Rosie walked into the kitchen, she set the groceries on the counter and stared around her in complete awe. The room was meticulously clean. The floor had been washed and waxed to such a bright sheen she could see her own reflection. Not only that, the countertops were cleared off and wiped down. The stove had a shine to it that had been sadly absent since the day they’d moved into the house. Rosie walked over to the wall-mounted oven and opened it. Sure enough, that, too, was spotless.\u003c/p\u003e\n\u003cp\u003e“Who cleaned the kitchen?” Rosie called out to her son.\u003c/p\u003e\n\u003cp\u003e“Dad.”\u003c/p\u003e\n\u003cp\u003eIt hurt like hell to admit that her ex-husband was a better housekeeper and cook than she’d ever been. Rosie tried not to feel sorry for herself. She should be counting her blessings instead of complaining. The kitchen was immaculate. She’d wanted to clean it for weeks, but even in her heyday as a wife and mother, she’d never have managed anything close to the perfection that lay before her now.\u003c/p\u003e\n\u003cp\u003e“Hi, Mom,” Allison said, wandering into the kitchen. She opened the refrigerator and took out a can of soda.\u003c/p\u003e\n\u003cp\u003eEven without looking, Rosie knew it had been cleaned, too.\u003c/p\u003e\n\u003cp\u003e“Sloppy joes okay with you for dinner?”\u003c/p\u003e\n\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003eSuch enthusiasm. “Do you think Dad’s a better cook than I am?” Rosie wasn’t sure why she bothered to ask. Her daughter was bound to heap salt onto her already bleeding wounds.\u003c/p\u003e\n\u003cp\u003e“Do you want me to be honest?” Allison said, pulling the tab on the soda can.\u003c/p\u003e\n\u003cp\u003eThat, on its own, was answer enough. Rosie crossed her arms and mentally prepared herself for the answer. “Go ahead.”\u003c/p\u003e\n\u003cp\u003eAllison took a deep swallow of her soda. “At first Dad cooked the same things you did, but then he really seemed to get into it. He doesn’t have a lot of time, you know, so he does fun things like chicken salad with grapes and pineapple and lettuce. I sometimes help him,” she added proudly. “We use bottled sauce—the gourmet stuff. It’s really yummy. I’ll give you the recipe if you want.”\u003c/p\u003e\n\u003cp\u003e“No, thanks.”\u003c/p\u003e\n\u003cp\u003e“His spaghetti’s really good, too. He adds sliced olives, and last night he threw in a can of jalapeños. It was great. Dad said that’s called fusion cooking.”\u003c/p\u003e\n\u003cp\u003e“It’s what?”\u003c/p\u003e\n\u003cp\u003e“Fusion. Come on, Mom, get with it.”\u003c/p\u003e\n\u003cp\u003eFor reasons she didn’t want to examine too closely, tears filled Rosie’s eyes and spilled down her cheeks. She tried to hide them from her daughter but should have known better.\u003c/p\u003e\n\u003cp\u003e“Mom, are you crying?”\u003c/p\u003e\n\u003cp\u003eRosie shrugged and turned her back to Allison.\u003c/p\u003e\n\u003cp\u003e“You’d better tell me what’s wrong,” Allison said.\u003c/p\u003e\n\u003cp\u003e“I don’t know—I’m just so glad to have you back.” She turned around and hugged her daughter. The girl was taller than Rosie—when had that happened?\u003c/p\u003e\n\u003cp\u003e“I didn’t go anywhere,” Allison protested.\u003c/p\u003e\n\u003cp\u003e“But you did,” Rosie said, and cupped her daughter’s beautiful face. “I thought I’d lost you. I’m so grateful you’re back.”\u003c/p\u003e\n\u003cp\u003eAllison rolled her eyes. “It’s nothing to cry about.”\u003c/p\u003e\n\u003cp\u003e“I know.” It didn’t escape Rosie’s notice that she wasn’t the one her daughter had reached out to. Instead, a woman who was virtually a stranger had stepped into the role of mentor. Rosie could now add another failing to her list: besides being a bad wife and an inadequate housekeeper, she was a terrible mother.\u003c/p\u003e\n\u003cp\u003eIt was suddenly too much for her, and pulling out a chair, Rosie buried her face in her hands.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” Allison asked.\u003c/p\u003e\n\u003cp\u003e“Fine…sorry, just give me a minute.”\u003c/p\u003e\n\u003cp\u003e“Tell me what’s wrong,” Allison insisted.\u003c/p\u003e\n\u003cp\u003eHow could she? Rosie kept her face covered and continued to cry into her hands. She could hear Allison and Eddie whispering in the background, but she was too upset to pay attention.\u003c/p\u003e\n\u003cp\u003eAfter about ten minutes, she stood, unloaded her grocery bags and set a pan on the stove top. She wasn’t hungry, but in all likelihood the children were. She was enough of a failure without adding that to her list of sins.\u003c/p\u003e\n\u003cp\u003eThe front door opened, and Rosie quickly wiped her cheeks and reached for a tissue to blow her nose. When she looked up, she discovered Zach standing in the kitchen doorway.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” he asked.\u003c/p\u003e\n\u003cp\u003eAllison and Eddie crowded around their father. “Don’t be mad, Mom. We called Dad.”\u003c/p\u003e\n\u003cp\u003e“Why would you do that?” she demanded, knowing she sounded defensive. At this point she didn’t care.\u003c/p\u003e\n\u003cp\u003eAllison took a step forward. “Because you wouldn’t stop crying.”\u003c/p\u003e\n\u003cp\u003e“Your father—”\u003c/p\u003e\n\u003cp\u003eZach’s jaw tightened. “I’m right here, Rosie. There’s no need to talk about me as if I wasn’t in the room.”\u003c/p\u003e\n\u003cp\u003eShe placed her hands on her hips and glared at him. “This is my time with the kids.”\u003c/p\u003e\n\u003cp\u003e“Fine, whatever. I’ll just turn around and leave.”\u003c/p\u003e\n\u003cp\u003e“No.” It was Eddie who spoke first.\u003c/p\u003e\n\u003cp\u003eAllison echoed him. “No. Dad, Mom needs you.”\u003c/p\u003e\n\u003cp\u003e“I don’t,” Rosie muttered.\u003c/p\u003e\n\u003cp\u003e“You do, Mom,” Allison said. “Now, talk, both of you, and Eddie and I’ll cook dinner.”\u003c/p\u003e\n\u003cp\u003eEddie seemed ready to protest, but at a glance from his sister, he closed his mouth.\u003c/p\u003e\n\u003cp\u003eRosie and Zach frowned at each other for a moment before Zach gestured toward the family room. “It looks like we have our orders.”\u003c/p\u003e\n\u003cp\u003eRosie grabbed a second tissue and reluctantly followed her ex-husband.\u003c/p\u003e\n\u003cp\u003eThey sat as far apart from each other as possible. Rosie took one end of the sofa and Zach sat on the edge of the recliner. Neither said anything for several tense minutes.\u003c/p\u003e\n\u003cp\u003e“I wanted to explain about my comment the other day,” Zach said.\u003c/p\u003e\n\u003cp\u003eRosie wasn’t up to hearing another confession. She raised her hand, stopping him. “Please don’t. Frankly, I don’t want to hear it.”\u003c/p\u003e\n\u003cp\u003eZach ignored her request. “I felt it was only fair to tell you—”\u003c/p\u003e\n\u003cp\u003e“Didn’t you hear me?” she said, losing patience.\u003c/p\u003e\n\u003cp\u003e“The least you can do is let me explain.”\u003c/p\u003e\n\u003cp\u003e“Why, so you can drag my self-esteem through the gutter again? Fine, you had an emotional affair. I heard you the first time. I got the message.”\u003c/p\u003e\n\u003cp\u003eZach hung his head. “But I was never physically involved with Janice.”\u003c/p\u003e\n\u003cp\u003e“That’s not the point. You were in love with her.”\u003c/p\u003e\n\u003cp\u003e“No,” he corrected quickly. “I had an emotional relationship with her, and there’s a difference.”\u003c/p\u003e\n\u003cp\u003eRosie wasn’t sure that was true. All she knew was that her husband, the man she loved, had wanted another woman. \u003c/p\u003e","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-44.html","bookId":1943,"creation":"Oct 5, 2019 10:03:11 AM","modification":"Oct 5, 2019 10:03:11 AM"}
