{"id":66941,"no":9,"title":"Page 9","content":"\u003cp\u003e“Oh, no.” Her eyes widened in horror. “It’s impossible! The bedroom door was locked from the inside.”\u003c/p\u003e\n\u003cp\u003eBut Jack knew they had a key, so that wasn’t a viable excuse.\u003c/p\u003e\n\u003cp\u003e“And there wasn’t a scratch on him.”\u003c/p\u003e\n\u003cp\u003eJack nodded. That was true.\u003c/p\u003e\n\u003cp\u003e“Besides, you know Bob. He can barely swat a fly. It just isn’t in him to purposely hurt anyone or anything.”\u003c/p\u003e\n\u003cp\u003ePeggy was right. “Then why do you want Bob to talk to a private investigator?”\u003c/p\u003e\n\u003cp\u003e“I just want Bob to talk, I guess. It doesn’t matter to whom. After I saw how upset he was over Dan’s death, coupled with the recurring nightmares—well, I just think it would do him good to get it off his chest. He’s always so afraid that he might start walking in his sleep again.”\u003c/p\u003e\n\u003cp\u003eJack could appreciate her concern. “Do you want me to say anything to him?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “It might do more harm than good. If he thinks I’ve been talking about him—even with you—he’d just get upset.”\u003c/p\u003e\n\u003cp\u003eJack noticed the way she clenched and unclenched her hands, and he realized that Peggy was afraid. Even though she’d denied it, she was afraid her husband might have had something to do with the stranger’s death.\u003c/p\u003e\n\u003cp\u003eWas that possible? Could Bob be involved?\u003c/p\u003e\n\u003cp\u003eFive\u003c/p\u003e\n\u003cp\u003eSunday afternoon, the day Katie turned one month old, Maryellen paced the living room floor, holding her daughter against her chest. The doorbell chimed and she froze. Jon had come for Katie, to take her home for the night. This was the first time since she’d been born that Maryellen had to surrender her to Jon. Until today, he’d visited almost daily, usually staying only an awkward few minutes. Now he’d be taking her on his rotation days off, returning the next afternoon. Already she knew that abiding by their agreement wasn’t going to be easy.\u003c/p\u003e\n\u003cp\u003eReluctantly, she set Katie back in her bassinet and opened the front door. Jon stood on the other side of the screen, dressed casually in jeans and a short-sleeved shirt. His long dark hair was pulled away from his face and tied in a ponytail.\u003c/p\u003e\n\u003cp\u003e“Hi,” he said. “You look great—both of you.”\u003c/p\u003e\n\u003cp\u003e“Jon.” Despite her resolve not to be emotional, her voice trembled.\u003c/p\u003e\n\u003cp\u003eIf he noticed her distress, he ignored it. “Is Katie ready?”\u003c/p\u003e\n\u003cp\u003eMaryellen swallowed the lump in her throat and nodded. She held the door open for him. “I’ve packed everything you’ll need.” She reached for the diaper bag and pulled out a container of breast milk she’d pumped and several empty bottles. “She only takes about three ounces, some-times four, at a time. You’ll probably have to get up twice during the night, and she isn’t all that accustomed to the bottle, so I don’t know how she’ll do.” She swallowed again, trying to hide her reservations. “You will hear her if she cries, won’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m a light sleeper.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t the way Maryellen remembered it. On their one night together she’d managed to gather her clothes and sneak halfway down the stairs before he noticed she was gone.\u003c/p\u003e\n\u003cp\u003e“I put three extra outfits in her diaper bag in case she needs a change—and extra diapers, too.”\u003c/p\u003e\n\u003cp\u003e“All right.” He walked over to the bassinet, which she’d brought into the living room this morning. “Hey, I didn’t know they still had these.”\u003c/p\u003e\n\u003cp\u003e“It was mine,” Maryellen told him. “Mom saved it and then gave it to Kelly when she had Tyler. Kelly passed it along to me for Katie.”\u003c/p\u003e\n\u003cp\u003eJon smiled down at his daughter; the infant seemed to smile back and started moving both arms. Jon placed his hand over her tiny stomach.\u003c/p\u003e\n\u003cp\u003e“She likes her yellow blanket best….” Maryellen said. “My mom knit it for her and I think she sleeps better with it.” She was rambling, but she couldn’t help herself.\u003c/p\u003e\n\u003cp\u003e“I’ll be sure the blanket is always with her.”\u003c/p\u003e\n\u003cp\u003e“You’ll need a car seat. State law demands that—”\u003c/p\u003e\n\u003cp\u003e“I already have one.”\u003c/p\u003e\n\u003cp\u003eNot once had his gaze wavered from their daughter, and Maryellen saw him make silly faces at her. The tenderness in his eyes made her want to weep.\u003c/p\u003e\n\u003cp\u003e“She tends to be fussy first thing in the morning,” she told him, and bit her lip to keep it from trembling.\u003c/p\u003e\n\u003cp\u003e“She must get that from you,” Jon said, briefly glancing toward her. “As I recall, you’re not much of a morning person, either.”\u003c/p\u003e\n\u003cp\u003eApparently he was reminding her of their night together. Maryellen immediately wanted to defend herself, but she was afraid that if she said one more word, she’d burst into tears. His having Katie had sounded like a reasonable solution a couple of months ago. Katie was Jon’s daughter, and it was his legal right to spend time with her. But Maryellen hadn’t realized when she’d agreed to this how bereft she’d feel. How lost and unsettled…\u003c/p\u003e\n\u003cp\u003eJon carefully bent down and scooped his daughter into his arms. It was all Maryellen could do not to rush forward at the clumsy way he handled their baby. Sheer determination kept her where she was. Jon wouldn’t appreciate her intervention.\u003c/p\u003e\n\u003cp\u003e“I’ll take her out and put her in the car seat,” he said.\u003c/p\u003e\n\u003cp\u003eRather than respond verbally, Maryellen nodded. She followed closely behind, carrying the diaper bag. While Jon fiddled with the car seat, she waited anxiously to be sure he had Katie properly secured.\u003c/p\u003e\n\u003cp\u003e“What time will you have her back?” she asked, although she already knew.\u003c/p\u003e\n\u003cp\u003e“Before five.”\u003c/p\u003e\n\u003cp\u003eTwenty-four hours.\u003c/p\u003e\n\u003cp\u003eJon closed the back door.\u003c/p\u003e\n\u003cp\u003e“You’ll phone if you need anything?”\u003c/p\u003e\n\u003cp\u003eHe walked around the vehicle, a brand-new sedan, and opened the driver’s side door. “Of course. I have your number next to the phone.”\u003c/p\u003e\n\u003cp\u003e“Okay…good.” Maryellen clung to the top of the door while he climbed inside and inserted the key in the ignition. The warning bell instantly started to chime. Reluctantly she stepped back and Jon pulled the door shut.\u003c/p\u003e\n\u003cp\u003e“Everything will be fine,” he assured her through the half-open window.\u003c/p\u003e\n\u003cp\u003e“I know…it’s just that we’ve never been apart before.”\u003c/p\u003e\n\u003cp\u003eJon’s eyes went blank as he looked past her. “You’re the one who wanted it like this. I’m only going along with your wishes.”\u003c/p\u003e\n\u003cp\u003eHer wishes, she longed to remind him, had been to keep him entirely in the dark about their daughter. She hadn’t originally planned to involve him because she’d believed Jon wouldn’t want anything to do with their child. But she’d been wrong.\u003c/p\u003e\n\u003cp\u003eTears blurred her vision. Normally Maryellen wasn’t a volatile or weepy person, but the pregnancy and birth had thrown her hormones off-kilter. At the slightest excuse—a television ad, watching her beautiful daughter sleep, even folding baby clothes—Maryellen would find herself on the verge of tears.\u003c/p\u003e\n\u003cp\u003eJon was about to drive away from the curb when he glanced at her and stopped. “Are you all right?”\u003c/p\u003e\n\u003cp\u003eShe nodded forcefully and hurriedly wiped a stray tear from her cheek. “I’ve been feeling emotional lately. That’s all.” Wrapping her arms protectively about her waist, she moved onto the sidewalk.\u003c/p\u003e\n\u003cp\u003e“New-mother blues,” he said knowledgeably. “I read about it in one of the books I checked out of the library. It’ll pass in a few weeks.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know,” she said. Maryellen could read, too, but pointing that out just now seemed childish and petty. She didn’t want to say anything to irritate him, especially when he had their baby in his vehicle.\u003c/p\u003e\n\u003cp\u003e“I’ll be back tomorrow afternoon,” he assured her.\u003c/p\u003e\n\u003cp\u003e“Okay,” she whispered. She could sleep in, Maryellen told herself. After a month of getting up at all hours of the night, sometimes two and three times, she should be grate-ful for a single night of uninterrupted rest. All this anxiety was a by-product of too many nights walking the floor and too little sleep. Not to mention those rampant hormones…\u003c/p\u003e\n\u003cp\u003eOnce inside the house, Maryellen straightened the living room. She picked up the rattle, which was a gift from Jon; it had arrived in a huge basket of flowers he’d had delivered to the hospital. The burp rag draped over the end of the couch got tossed in the washing machine.\u003c/p\u003e\n\u003cp\u003eTidying the bassinet, Maryellen sat up the large white teddy bear Jon had given Katie before she was born. The house was full of small gifts he’d brought either before or after the birth. Everywhere she looked there was evidence that he was determined to be part of Katie’s life. He was serious about it and she knew he wasn’t going to let his commitment slide, so she’d better get used to it now.\u003c/p\u003e\n\u003cp\u003eThat night Maryellen slept miserably. She tossed and turned, certain that Katie needed her, certain Jon wouldn’t hear when she stirred in the middle of the night. A hundred regrets besieged her. She’d handed her daughter over to him without once checking to be sure he was adequately prepared to deal with an infant. Maryellen envisioned Katie crying in a wet diaper with an empty stomach while Jon slept, blissfully unaware that she needed attention.\u003c/p\u003e\n\u003cp\u003eBy seven the next morning, Maryellen had worked herself into a near-frenzy. Three times she reached for the phone, but she was afraid she’d wake him, or worse, Katie. When she couldn’t stand it any longer, she dressed hastily and drove to her mother’s house.\u003c/p\u003e\n\u003cp\u003eFortunately Grace was up, having coffee at her kitchen table. She opened the back door for Maryellen, and Buttercup greeted her delightedly, tail wagging. Maryellen stepped into the kitchen, took one look at her mother and burst into tears.\u003c/p\u003e\n\u003cp\u003e“Maryellen! My goodness, what’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Nothing…Everything. Jon has Katie.”\u003c/p\u003e\n\u003cp\u003eHer mother poured her a cup of coffee. “Sit down and we’ll talk.”\u003c/p\u003e\n\u003cp\u003eMaryellen felt foolish and overemotional and everything she’d never wanted to be. This was so unlike her. “You have to get ready for work,” she said between sobs.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll get dressed, and while I do, you can talk to me.”\u003c/p\u003e\n\u003cp\u003eDabbing her eyes, Maryellen followed her mother into the bedroom. She paused when she entered. “You painted in here.”\u003c/p\u003e\n\u003cp\u003eGrace nodded. “Do you like it?”\u003c/p\u003e\n\u003cp\u003eMaryellen shrugged. “I guess…I didn’t think there was anything wrong with the old color.”\u003c/p\u003e\n\u003cp\u003e“There wasn’t, but I had some things I needed to work out in my mind and painting helped.”\u003c/p\u003e\n\u003cp\u003eCaught up in her own world, Maryellen feared she’d failed her mother, that she hadn’t paid enough attention to the difficulties Grace was confronting. This summer had been traumatic for them both. “Anything I can do to help?” she asked as she sat on the end of her parents’ bed. Her mother pulled a blouse and jumper from her closet.\u003c/p\u003e\n\u003cp\u003eGrace shook her head. “No, but thanks. Besides, you didn’t come here at this hour to ask about me. Now, tell me what’s got you so upset.”\u003c/p\u003e\n\u003cp\u003eMaryellen wasn’t upset as much as she was worried. “Jon’s never had Katie before…. I’m afraid she’ll miss me. It wasn’t supposed to be like this.”\u003c/p\u003e\n\u003cp\u003eHer mother pulled a full-length black slip over her head. “Wait until eight-thirty or so and then give him a call,” she advised. “My guess is that Jon will be more than happy to hear from you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-9.html","bookId":1943,"creation":"Oct 5, 2019 10:03:11 AM","modification":"Oct 5, 2019 10:03:11 AM"}
