{"id":94386,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I just can’t believe he’s gone,” she said, sniffling. “Have you ever lost anyone?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Have you ever loved anyone?”\u003c/p\u003e\n\u003cp\u003e“Just my family.”\u003c/p\u003e\n\u003cp\u003eSavanah reached for a tissue from the box on the end table. She wiped her eyes and blew her nose. “Haven’t you ever been in love?”\u003c/p\u003e\n\u003cp\u003e“You mean besides now?”\u003c/p\u003e\n\u003cp\u003eShe looked up at him, startled by his words. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean I’m in love with you.” It was wrong, and he knew it. He had no right to love her, or any woman. He had done despicable things, horrible things, for which he would find no forgiveness in this life or the next. But the fact remained that he had fallen in love with her. He shrugged. “I thought you should know.”\u003c/p\u003e\n\u003cp\u003e“Rane…”\u003c/p\u003e\n\u003cp\u003e“You must have known, or at least suspected.”\u003c/p\u003e\n\u003cp\u003e“I guess so, but…”\u003c/p\u003e\n\u003cp\u003e“The idea displeases you.”\u003c/p\u003e\n\u003cp\u003e“No, but…”\u003c/p\u003e\n\u003cp\u003e“But I’m a Vampire and you’re a hunter,” he finished for her. “And you’re thinking it’s going to make it difficult to take my head.”\u003c/p\u003e\n\u003cp\u003e“Rane, what a terrible thing to say!”\u003c/p\u003e\n\u003cp\u003e“Maybe, but it’s what you’re thinking, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“It crossed my mind,” she admitted.\u003c/p\u003e\n\u003cp\u003e“I give you leave to try.”\u003c/p\u003e\n\u003cp\u003eHe had told her that once before, she thought, and not so long ago.\u003c/p\u003e\n\u003cp\u003e“I need to find the Vampire who killed my father,” she said, determination replacing her tears. “She’s not going to get away with it.”\u003c/p\u003e\n\u003cp\u003e“How are you going to find her?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I don’t suppose you’d help me.”\u003c/p\u003e\n\u003cp\u003e“I might.”\u003c/p\u003e\n\u003cp\u003e“Would you? Really?” She looked at him, her eyes filled with hope. “I mean…really? You’d help me hunt one of your own?”\u003c/p\u003e\n\u003cp\u003eHe grunted softly. “She’s not ‘one of my own.’”\u003c/p\u003e\n\u003cp\u003e“But she’s a Vampire?”\u003c/p\u003e\n\u003cp\u003e“So it seems.”\u003c/p\u003e\n\u003cp\u003e“Where are my mother’s books?”\u003c/p\u003e\n\u003cp\u003e“In a safe place.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“It’s better if you don’t know.”\u003c/p\u003e\n\u003cp\u003eHer brows drew together in a frown. “They’re my books now,” she said, her words slow and deliberate. “I want them back.” She had very little that had belonged to her mother. The books weren’t the kind of thing a mother usually passed down to her daughter, but one of them had been written by her mom and that, more than any other reason, made it important to her.\u003c/p\u003e\n\u003cp\u003e“I’ll give them back to you when I’m convinced you’re out of danger.”\u003c/p\u003e\n\u003cp\u003e“You promise?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Say it.”\u003c/p\u003e\n\u003cp\u003e“I promise,” he said with a wry grin.\u003c/p\u003e\n\u003cp\u003eShe wasn’t sure she believed him, but what other choice did she have?\u003c/p\u003e\n\u003cp\u003e“It isn’t safe for you to stay here.” He ran his fingertips up and down her arm. “I want you to come with me.”\u003c/p\u003e\n\u003cp\u003e“I can’t just leave. I’ve got to settle my father’s affairs. I’ve got a job, and—”\u003c/p\u003e\n\u003cp\u003e“None of that matters now. You won’t be safe here as long as that Vampire knows where you live.”\u003c/p\u003e\n\u003cp\u003e“But she can’t come in unless I invite her.”\u003c/p\u003e\n\u003cp\u003e“She’s already had an invitation.”\u003c/p\u003e\n\u003cp\u003eSavanah frowned, and then murmured, “Oh,” with the realization that her father had unknowingly invited his murderer into the house. “Well, I’ll just rescind it.”\u003c/p\u003e\n\u003cp\u003eRane shook his head. “She’s not working alone.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“I picked up the scent of a Werewolf on your property. I don’t know if they were working together or not, but I’d rather be safe now than sorry later.”\u003c/p\u003e\n\u003cp\u003e“A Werewolf wouldn’t need an invitation, would he? Or she?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe thought it over for a moment, then asked, “Where do you want to go?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “It doesn’t matter. We can go anywhere you want, so long as you don’t tell anyone where you’ll be.”\u003c/p\u003e\n\u003cp\u003e“I can’t hide forever,” she said, and sighed. “I’ll call Mr. Van Black and ask him if I can have more time off. Tomorrow’s Thursday. We can leave Friday night, if you want. Or Saturday.” The more she thought about leaving town, the better it sounded. It might be good to get away for a while.\u003c/p\u003e\n\u003cp\u003e“Friday night,” Rane decided. “We’ll leave at sundown.”\u003c/p\u003e\n\u003cp\u003eSavanah nodded.\u003c/p\u003e\n\u003cp\u003e“All you have to do now is decide where you want to go.”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it.”\u003c/p\u003e\n\u003cp\u003e“In the meantime, I think you should get something to eat.”\u003c/p\u003e\n\u003cp\u003e“I’m not hungry.”\u003c/p\u003e\n\u003cp\u003e“You need to eat.”\u003c/p\u003e\n\u003cp\u003eShe didn’t feel like arguing and she didn’t feel like cooking. With a huff of annoyance, she went in search of her cell phone, thinking that pizza didn’t sound too bad.\u003c/p\u003e\n\u003cp\u003eLife was never what you expected, she thought as she waited for the pizza place to answer. Here she was, planning to go away with a man for the first time in her life, but not for any of the reasons she would have thought.\u003c/p\u003e\n\u003cp\u003eNo, she was going off with a man who wasn’t really a man at all, and not for some romantic rendezvous in an exotic locale. No, not Savanah Gentry. She was running away from a murderer, and not just any old murderer, but one that was a Vampire, or perhaps a Werewolf.\u003c/p\u003e\n\u003cp\u003eOh, yes, she thought again. Life was strange, indeed.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003e“Why isn’t she dead?”\u003c/p\u003e\n\u003cp\u003e“He’s always there with her.”\u003c/p\u003e\n\u003cp\u003eClive slammed his fist on the table, muttered an oath as the wood cracked beneath his hand. Damn the Cordova men. They protected their women like knights of old. An admirable quality, to be sure, but damned annoying at the moment.\u003c/p\u003e\n\u003cp\u003e“I don’t know, Clive,” Tasha said. “Maybe you’ll have to do this one yourself.”\u003c/p\u003e\n\u003cp\u003eHe grunted softly. “Perhaps.” But there was no hurry. He knew where the woman lived. It was doubtful she would be leaving home anytime soon. After all, she had just buried her father. Being mortal, she would need time to grieve, time to go through her father’s belongings and decide what to keep and what to part with.\u003c/p\u003e\n\u003cp\u003eOr perhaps he would wait and see if Cordova’s ardor for Savanah Gentry cooled.\u003c/p\u003e\n\u003cp\u003eIn the meantime, there were other hunters out there, hunters with years of experience to their credit, which made them far more dangerous than William Gentry’s un-learned daughter.\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eSavanah hadn’t planned to go to work the day after the funeral, intending to use the time to clean the house and pack for her trip with Rane, but when she got up that morning, the idea of spending the day at home alone held no appeal. Not only that, but going into the office would give her a chance to clear up a few matters still pending, matters that couldn’t be handled over the phone.\u003c/p\u003e\n\u003cp\u003eYesterday, at the graveside, Mr. Van Black had told her to take as much time off as she needed. She had thanked him and said a week would be fine. But that was before Rane had convinced her that her life was in danger. When she got to work, she would tell Mr. Van Black that she had decided to take an extended leave of absence.\u003c/p\u003e\n\u003cp\u003eIn the shower, she found herself wondering where Rane had gone. He had stayed the night with her last night. After she had eaten dinner, they had spent what was left of the evening watching a late movie, and then she had gone to bed. He had stretched out on the bed beside her, on top of the covers. The fact that they weren’t going to make love filled her with relief and regret. On one hand, it would have been nice to lose herself in his embrace, to forget, if only for a short time, the horrors of the last few days. On the other hand, she wasn’t quite ready to make love to Rane again now that she knew what he was. To be honest, she wasn’t sure if she would ever be ready.\u003c/p\u003e\n\u003cp\u003eSavanah dressed quickly, then went downstairs, her heart skipping a beat when she saw Rane sitting on the sofa watching an early-morning news program.\u003c/p\u003e\n\u003cp\u003eShe stared at him a moment, then glanced out the window. Yes, the sun was up. And so was he. How was that possible? Everything she had ever read about Vampires said they were compelled to seek their coffins at sunrise, and the sun had been up for hours.\u003c/p\u003e\n\u003cp\u003eMaybe he wasn’t really a Vampire. The thought made her hopeful heart skip a beat. “Rane…?”\u003c/p\u003e\n\u003cp\u003eHe glanced at her over his shoulder. “Good morning.”\u003c/p\u003e\n\u003cp\u003e“I thought…How can you be awake?” Hardly daring to breathe, she waited for his answer, hoping he would tell her he had been playing some horrible joke, that he wasn’t really a Vampire at all, just a shape-shifter, as he had said.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “The sun doesn’t affect me the way it does most Vampires. I don’t know why. Probably because my mother was mortal.”\u003c/p\u003e\n\u003cp\u003eShe frowned at him. “So, you can go out during the day?”\u003c/p\u003e\n\u003cp\u003e“No, but I don’t have to take my rest until I’m ready.”\u003c/p\u003e\n\u003cp\u003eShe pondered that a moment, and then frowned. “If you can’t leave the house, where are you going to…ah…you know?”\u003c/p\u003e\n\u003cp\u003eHe lifted one brow, amused by her rising concern for where he intended to succumb to the Dark Sleep. “Will it bother you if I rest here?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ve never had a Vampire for a house-guest.”\u003c/p\u003e\n\u003cp\u003e“I’m not particularly crazy about the idea of sleeping in a hunter’s house, either,” he remarked dryly.\u003c/p\u003e\n\u003cp\u003e“Talk about strange bedfellows,” Savanah muttered.\u003c/p\u003e\n\u003cp\u003e“I promise not to bite you if you promise not to take my head.”\u003c/p\u003e\n\u003cp\u003eSavanah grimaced at the grisly image. “It’s a deal.”\u003c/p\u003e\n\u003cp\u003eRane took notice of her attire for the first time and frowned. “Where do you think you’re going?”\u003c/p\u003e\n\u003cp\u003e“To work, of course.”\u003c/p\u003e\n\u003cp\u003e“Oh, no, I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“Why not?” \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-pleasure-children-of-the-night-4/page-23.html","bookId":2302,"creation":"Oct 5, 2019 6:08:13 PM","modification":"Oct 5, 2019 6:08:13 PM"}
