{"id":94372,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWith a shake of his head, Rane dropped into the chair across from hers. “Never saw her before.”\u003c/p\u003e\n\u003cp\u003e“Really? She certainly seemed to like what she saw.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Can I help it if women like me?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Can you?”\u003c/p\u003e\n\u003cp\u003eIn truth, he could, if he put his mind to it, but for the most part, he didn’t bother. All Vampires possessed an aura that was almost irresistible to mortals. He could subdue it if he chose to, but why bother when it made hunting so much easier?\u003c/p\u003e\n\u003cp\u003eSavanah was watching him, waiting for an answer.\u003c/p\u003e\n\u003cp\u003eRane shrugged again. “I like women. They like me.”\u003c/p\u003e\n\u003cp\u003e“Could you try liking them a little less when you’re with me?”\u003c/p\u003e\n\u003cp\u003eHe grinned, amused by the spark in her eye and the jealousy in her voice. “Yes, ma’am, I’ll do my best.” He jerked his head toward the dance floor. “Wanna give it a whirl?”\u003c/p\u003e\n\u003cp\u003eSavanah took a sip of her drink, wondering if being in the arms of a man she found so attractive was really a good idea, and then shrugged. What was there to worry about? They were in a public place, after all, and she very much wanted to be in his arms.\u003c/p\u003e\n\u003cp\u003eRising, she put her hand in his, felt a familiar tingle as his skin touched hers, and then he was leading her onto the dance floor.\u003c/p\u003e\n\u003cp\u003eHe drew her into his arms with the ease and assurance of a man who knew how to please a woman. The music was like the man—dark, sultry, and sensual. Her body reacted immediately, to both the music and the sheer masculinity of the hard male body pressed intimately against her own. He held her close, so close she knew which way he was going to move before it happened. Butterflies fluttered in her stomach; her heart pounded like thunder in her breast. When she risked a glance at his face, his heavy-lidded gaze captured hers, making her think of sweat-sheened limbs tangled in cool silk sheets.\u003c/p\u003e\n\u003cp\u003eTime seemed to slow as he guided her around the floor. Caught in the seductive web of his gaze, surrounded by the music, it seemed as if her feet never touched the floor. She wasn’t aware of anything else, anyone else, only Rane, his strong arms holding her close, his breath fanning her cheek, his voice whispering in her ear. As the music ended, she glanced up at him. What had he said to her? She recalled the husky timbre of his voice, the way it had made her insides melt like ice cream on a hot summer day, but for the life of her, she couldn’t remember a single word he had said other than her name.\u003c/p\u003e\n\u003cp\u003eHe held her chair for her when they returned to their table. Resuming his seat across from hers, he sipped his wine.\u003c/p\u003e\n\u003cp\u003eSavanah shook her head to clear it. Feeling as though she had just awakened from some kind of enchanted sleep, she picked up her own glass and took a long drink.\u003c/p\u003e\n\u003cp\u003e“So,” he remarked, setting his glass aside, “aren’t you getting tired of watching my act?”\u003c/p\u003e\n\u003cp\u003e“No, never.” Being a shape-shifter explained how he transformed so easily into a wolf, but it didn’t explain how he disappeared from sight, or levitated people and objects off the ground, or did a dozen other seemingly impossible things. “Besides, I’m still hoping to get that story.”\u003c/p\u003e\n\u003cp\u003e“There is no story. I’m just a magician who’s good at what he does.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s not quite all there is to it.”\u003c/p\u003e\n\u003cp\u003e“True, but you can’t print that part.”\u003c/p\u003e\n\u003cp\u003e“I know.” She couldn’t help thinking it was a shame, though. A story about a shape-shifting magician didn’t come along every day. In spite of his assurances to the contrary, her instincts told her he was hiding something else, though she had no idea what it might be.\u003c/p\u003e\n\u003cp\u003eLater, they danced again, but there was nothing out of the ordinary this time. She was thrilled to be in Rane’s arms, but she was aware of the other couples around them, of the waiters moving on the fringes of the dance floor, of the jealous gaze of the brunette at the bar.\u003c/p\u003e\n\u003cp\u003eReturning to their table Rane ordered another round of drinks. They danced a few more times, and then Rane drove her home.\u003c/p\u003e\n\u003cp\u003eHe walked her to her door, then drew her into his arms. “I had a good time tonight.”\u003c/p\u003e\n\u003cp\u003e“Me, too,” Savanah said with a smile. She was tempted to ask him if anything unusual had happened during their first dance, but she was too embarrassed to mention her temporary lapse, or the fact that she couldn’t remember a thing he had said to her.\u003c/p\u003e\n\u003cp\u003eHe caressed her cheek, his fingertips trailing fire as they slid over her skin, and down the curve of her throat. She shivered with pleasure when he bent down to kiss the sensitive place behind her ear, felt her eyes widen as an image of Rane bending over her neck, his lips pulled back to reveal his teeth, burst into her mind.\u003c/p\u003e\n\u003cp\u003eStartled, she drew back.\u003c/p\u003e\n\u003cp\u003e“Something wrong?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes…no…I mean…” She shook her head, confused.\u003c/p\u003e\n\u003cp\u003e“It bothers you, my being a shape-shifter?”\u003c/p\u003e\n\u003cp\u003e“Isn’t that just another word for Werewolf? I mean, you change into a wolf. Doesn’t that make you a Werewolf?”\u003c/p\u003e\n\u003cp\u003e“Would it bother you if I was?”\u003c/p\u003e\n\u003cp\u003e“Well, a little.” There had been a time when everyone believed that Vampires and Werewolves were just creatures of myth and legend, but then the Werewolves and the Vampires had gone to war, leaving no doubt of their existence, or their danger to the human race. For the most part, the shape-shifters had remained neutral.\u003c/p\u003e\n\u003cp\u003e“Does that mean I won’t be seeing you again?” he asked.\u003c/p\u003e\n\u003cp\u003e“I didn’t say that.”\u003c/p\u003e\n\u003cp\u003e“I’m not a Werewolf, Savanah. I swear it on the life of my mother. Does that make you feel better?”\u003c/p\u003e\n\u003cp\u003e“I guess so.” As far as she knew, the shape-shifters were peaceful creatures, preferring to live in small communities of their own kind.\u003c/p\u003e\n\u003cp\u003e“So, does that mean you’ll go out with me tomorrow night?” he asked. “We could take in a late movie after my last show.”\u003c/p\u003e\n\u003cp\u003eShe hesitated a moment, then said, “I’d like that.”\u003c/p\u003e\n\u003cp\u003eBut later, in bed, with the covers pulled up to her chin, the image of Rane bending over her crept into her mind again. She saw him clearly. His dark eyes. His sensuous mouth. His very sharp teeth. If he was the wolf, did that make her Little Red Riding Hood?\u003c/p\u003e\n\u003cp\u003eRane stood in the shadows outside Savanah’s house, his gaze fixed on a second-story window. He guessed it was her bedroom, since it was the only room showing a light.\u003c/p\u003e\n\u003cp\u003eStanding there, he closed his eyes, his mind expanding until he felt her thoughts brush his. She was troubled by what had happened on the dance floor, as well she should be. Unable to resist her, he had woven a preternatural spell around her, and then taken a small taste of her life’s blood. She was as sweet as he remembered. Her blood had intoxicated him, burning through him like gentle fire. Like an addict, he craved one more fix even though he knew one would never be enough. Even now, it was all he could think of.\u003c/p\u003e\n\u003cp\u003eHe licked his lips as he recalled the taste of her blood, warm and salty, on his tongue. Did he dare take more tonight? A single thought could carry him quickly to her side. He could take what he wanted, what he craved, and wipe the memory from her mind, as he had done earlier that night….\u003c/p\u003e\n\u003cp\u003eMuttering an oath, he drew in a deep breath. Patience, he chided. He must have patience. He would drink a little each night, nothing more. He would relish each taste, savor it like rare, vintage wine, until he took it all.\u003c/p\u003e\n\u003cp\u003eIn the clear light of morning, Savanah told herself she had imagined the whole incident. Nothing out of the ordinary had happened on the dance floor. She had been caught up in the thrill of being in Rane’s arms. After all, she had never been with a man who radiated such raw sensuality. All that potent masculinity was bound to have an intoxicating effect on a girl’s senses.\u003c/p\u003e\n\u003cp\u003eShe could hardly wait to see him again. Tonight, she would keep her wits about her. She would ask the questions she had intended to ask last night. And she would try again to get that interview. She grinned inwardly, remembering how Yoda had informed Luke that there was no try. Either she would get that interview or she wouldn’t. And she would.\u003c/p\u003e\n\u003cp\u003eAfter taking a quick shower, she dressed in a pair of tan slacks and a white sweater, brushed her hair, and then went downstairs to have breakfast with her father.\u003c/p\u003e\n\u003cp\u003eHe was waiting for her in the kitchen. She smiled as the smell of freshly brewed coffee tickled her nostrils. She had always loved sharing this part of the day with her dad.\u003c/p\u003e\n\u003cp\u003e“So,” he asked, looking up from the morning paper, “how was your date?”\u003c/p\u003e\n\u003cp\u003e“Wonderful!”\u003c/p\u003e\n\u003cp\u003eHer father lifted one brow.\u003c/p\u003e\n\u003cp\u003e“We went dancing.”\u003c/p\u003e\n\u003cp\u003e“He must be some dancer, to put that glow in your eyes,” her father remarked dryly.\u003c/p\u003e\n\u003cp\u003e“Oh, he is.” She smiled at the memory. “He is.”\u003c/p\u003e\n\u003cp\u003e“I don’t like it,” her father said. “If I thought it would do any good, I’d tell you not to see him again.”\u003c/p\u003e\n\u003cp\u003eSavanah frowned at her father. “Are you having one of your mysterious premonitions?”\u003c/p\u003e\n\u003cp\u003e“Not exactly. There’s just something about him…and I don’t just mean the obvious. I mean, why does he keep changing his name every few years?”\u003c/p\u003e\n\u003cp\u003e“I’d think that would be obvious, but I’ll ask him.” She patted his shoulder as she moved toward the fridge. “I can’t get a story if I don’t see him.”\u003c/p\u003e\n\u003cp\u003e“Your life is more important to me than any news story.”\u003c/p\u003e\n\u003cp\u003e“I know, Dad. I love you, too,” Savanah said, then paused. “Do you think I’m in danger?”\u003c/p\u003e\n\u003cp\u003e“No, not really. The shape-shifters have never been a threat to us. I was just being an old worrywart, I guess.”\u003c/p\u003e\n\u003cp\u003e“I’ll be fine.” Going to the fridge, she pulled out a carton of eggs for French toast, a package of bacon, and a bottle of orange juice, and proceeded to fix breakfast.\u003c/p\u003e\n\u003cp\u003eWhen it was done, she dished it up, got the butter and syrup, then sat at the table across from her father.\u003c/p\u003e\n\u003cp\u003e“So, what’s up for today?” he asked as he tucked into his breakfast.\u003c/p\u003e\n\u003cp\u003e“I’m going over to the high school and see what I can dig up on that car accident, and then I’m going to the morgue to see if they turned up anything new on that John Doe those kids found in the vacant lot last week. Nothing really exciting. How about you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-pleasure-children-of-the-night-4/page-9.html","bookId":2302,"creation":"Oct 5, 2019 6:08:13 PM","modification":"Oct 5, 2019 6:08:13 PM"}
