{"id":91785,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Actually, I would appreciate it,” Liam said.\u003c/p\u003e\n\u003cp\u003e“Sure. I’ll get back to you.” He cleared his throat. “And I’d appreciate it if you’d see to it that arrangements are made for Cutter’s body.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, thanks, Franklin. I’m sure you’ll hear about funeral arrangements for Cutter today. If you don’t hear, I will see to it.”\u003c/p\u003e\n\u003cp\u003e“Are you planning on seeing Miss Donovan soon?” Valaski asked him.\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll see her.”\u003c/p\u003e\n\u003cp\u003eValaski lifted a hand. “I need you to wait one minute. I’ll have you sign out his effects. You can take them to her.”\u003c/p\u003e\n\u003cp\u003eLiam waited while Valaski disappeared into another room, and then returned with a dull gray plastic bag. “I’ve kept his clothing for the mortuary. If Kelsey wants him buried in something else, she can let the mortuary know.”\u003c/p\u003e\n\u003cp\u003e“All right.”\u003c/p\u003e\n\u003cp\u003e“Open the bag, Liam, so you can sign for the contents.”\u003c/p\u003e\n\u003cp\u003eLiam did so. The bag contained Cutter’s old seafarer’s watch, his Masonic ring and the little casket he had held along with the book that had been in his lap, In Defense from Dark Magick.\u003c/p\u003e\n\u003cp\u003eLiam signed the log, stating that he had taken the items.\u003c/p\u003e\n\u003cp\u003e“What do you think the old coot was seeing in his mind’s eye?” Valaski asked, shaking his head.\u003c/p\u003e\n\u003cp\u003e“He never called the police. As far as I know, he wasn’t afraid of anyone,” Liam said.\u003c/p\u003e\n\u003cp\u003e“The book is titled In Defense from Dark Magick,” Valaski said. “I think he was having delusions, and believed that someone was out to hurt him, or take something from him. You wouldn’t call the police against magic, would you?”\u003c/p\u003e\n\u003cp\u003e“No. Thanks, Franklin. I’ll see you soon.”\u003c/p\u003e\n\u003cp\u003e“Socially, I hope,” Valaski said with a grimace.\u003c/p\u003e\n\u003cp\u003e“Yeah, socially.”\u003c/p\u003e\n\u003cp\u003eLiam left, wondering why he had come, and yet still disturbed. After all, Valaski was the one who had made him think that there had to have been something that had frightened both Cutter Merlin and his daughter, Chelsea. One had died from a fall, and one from old age.\u003c/p\u003e\n\u003cp\u003eBoth with eyes wide open in fear.\u003c/p\u003e\n\u003cp\u003eWhat possible connection could there be?\u003c/p\u003e\n\u003cp\u003eBoth had been on medications that might have caused hallucinations.\u003c/p\u003e\n\u003cp\u003eHe thought about the kids who had broken into the house, and the way he had found them, cowering in the kitchen.\u003c/p\u003e\n\u003cp\u003eThey hadn’t been on pain medication. And he was pretty damned sure they hadn’t been on any kind of drugs, at least not that night.\u003c/p\u003e\n\u003cp\u003eIt was a scary house—unless you were accustomed to such a collection of oddities.\u003c/p\u003e\n\u003cp\u003eWhen he stepped outside, he found Bartholomew waiting for him.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you come in?” Liam asked him.\u003c/p\u003e\n\u003cp\u003eBartholomew shuddered. “It’s a morgue, Liam. Why would I go in?”\u003c/p\u003e\n\u003cp\u003eLiam lowered his head, smiling. Not even ghosts liked morgues.\u003c/p\u003e\n\u003cp\u003e“You tell me—why were you here?” Bartholomew returned.\u003c/p\u003e\n\u003cp\u003e“I don’t know. Yes, I do. I don’t like the house. And Kelsey is staying in it.”\u003c/p\u003e\n\u003cp\u003eBartholomew was silent for a minute. “I don’t like the house, either.”\u003c/p\u003e\n\u003cp\u003e“But you can’t sense or feel anything that might be a clue as to why?” Liam asked him.\u003c/p\u003e\n\u003cp\u003eBartholomew shook his head. “No. There’s just…something. Maybe it’s the house itself. It’s creepy.”\u003c/p\u003e\n\u003cp\u003e“Some people might say that talking to a ghost is creepy,” Liam said. He tried to mentally shake off his feelings of impending doom as he walked to his car.\u003c/p\u003e\n\u003cp\u003eThere was other work that needed his attention. And all he had here was a feeling that something wasn’t right.\u003c/p\u003e\n\u003cp\u003eBut he had to ask himself—if Kelsey hadn’t come down to stay in the house, would any thought of a wrong-doing, unseen, even be in his mind?\u003c/p\u003e\n\u003cp\u003e“What’s in the bag?” Bartholomew asked.\u003c/p\u003e\n\u003cp\u003e“I picked up Cutter’s property to return to Kelsey. His ring, his watch—the little casket he had clutched in his hands and the book.”\u003c/p\u003e\n\u003cp\u003e“Let me see, please?” Bartholomew asked.\u003c/p\u003e\n\u003cp\u003e“Wait ’til we’re in the car, please?” Liam suggested.\u003c/p\u003e\n\u003cp\u003eBartholomew grinned. Once they were in the car, Liam opened the bag again. Bartholomew studied the casket with a frown.\u003c/p\u003e\n\u003cp\u003e“Do you know what it is? Anything about it?” Liam asked.\u003c/p\u003e\n\u003cp\u003e“No. Maybe Jaden and Ted can help.”\u003c/p\u003e\n\u003cp\u003e“Maybe. I’ll suggest Kelsey let them study it. What about the book?”\u003c/p\u003e\n\u003cp\u003eLiam opened the book to show to Bartholomew. Bartholomew could actually open a page, but it took a great deal of energy, effort and concentration.\u003c/p\u003e\n\u003cp\u003e“It’s a first edition,” Bartholomew noted. “Publication date 1838.”\u003c/p\u003e\n\u003cp\u003e“Cutter had a number of first-edition books,” Liam said.\u003c/p\u003e\n\u003cp\u003e“Perhaps I can find out more about the book,” Bartholomew said. “I’ll get on it, and I’ll do what I can,” he promised.\u003c/p\u003e\n\u003cp\u003e“You think a Key West ghost might know something about it?”\u003c/p\u003e\n\u003cp\u003eBartholomew tapped the book. “It was published in England, so I don’t know. And you know that I don’t necessarily know every ghost in Key West, any more than you know all of the living. But I can prowl around the library, and…”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003eBartholomew smiled. If it was possible for a ghost to blush, he blushed. “Lucinda might know something about it,” he said softly. Lucinda, the lady in white, the ghost who had finally talked to him recently and become the love of his life…or, rather, death.\u003c/p\u003e\n\u003cp\u003e“She was extremely well-educated,” Bartholomew said softly.\u003c/p\u003e\n\u003cp\u003eLiam nodded. He studied the little casket. He found himself wondering if there were any powers in it, and then felt foolish.\u003c/p\u003e\n\u003cp\u003eIt was just a box, with a gold ball. And he felt nothing, nothing at all, as he held it.\u003c/p\u003e\n\u003cp\u003eWhy had it been clutched so tightly in Cutter Merlin’s hand?\u003c/p\u003e\n\u003cp\u003eFor the first ten minutes Kelsey sat in Joe Richter’s office, all she heard were legal terms that might as well have been Greek. Or Latin—since she assumed that many of the terms in a will were Latin or derivatives thereof.\u003c/p\u003e\n\u003cp\u003e“Well, that’s it, then,” Joe Richter said at last, taking off his reading glasses and setting the folder he had been reading from back down on his desk. “Once you sign these papers for me, I can get everything into your name. It’s all yours, and the disposal of all Cutter’s ‘earthly goods’ is up to you. The second page dealt with the fact that he believed that you will ‘abide by all my wishes, as set down in my ledger.’ So, that was easy enough, right?”\u003c/p\u003e\n\u003cp\u003e“So far,” Kelsey said. She smiled. “Have you been in the house?”\u003c/p\u003e\n\u003cp\u003eJoe laughed. “Not for a bit. But I liked Cutter, and admired him, Kelsey. He was a good man. I think he might have been a great man if—”\u003c/p\u003e\n\u003cp\u003e“If my mother hadn’t died,” Kelsey finished when he broke off, his face reddening.\u003c/p\u003e\n\u003cp\u003e“He loved the world. He didn’t like the fact that artifacts were stolen from other countries, and he was instrumental in seeing that a great deal of material taken from Greece by the allied nations was returned in the decades following World War II. For his private collections, he never wanted anything that was pertinent to the history of another country.”\u003c/p\u003e\n\u003cp\u003e“He kept a mummy.”\u003c/p\u003e\n\u003cp\u003e“Ah, yes, but there are mummies all over. He didn’t keep the remains of a great pharaoh! He told me that when the English and northern Europeans first started their excavations in Egypt, mummies were so plentiful that people used them as tinder for their fireplaces.” Richter ran his fingers through his white hair and shrugged. “Countries would often exchange their treasures. Native American artifacts can be found in many museums on other continents. He didn’t believe in stealing what belonged in the country of origin when it was precious to that country. Otherwise, he was a great collector of objects that might have been thrown away when an attic was cleaned out. He was brilliant with his knowledge at auction houses, and when he went around the world and made discoveries himself, he only kept objects with the blessing of the country’s finest archaeologists and historians. But, yes, frankly—I imagine you will have your work cut out for you.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind. I did love him,” Kelsey said.\u003c/p\u003e\n\u003cp\u003eShe wondered if the expression he gave her then suggested that she might have returned long ago if she had really meant her words.\u003c/p\u003e\n\u003cp\u003eThen, again, there were those who understood that her father would not return to the place of his wife’s death, and that it might perhaps be painful for Kelsey to do so, as well.\u003c/p\u003e\n\u003cp\u003e“I’d like Cutter sent to the funeral home down the street from St. Paul’s,” she said. “I’d like to have a wake for him on Sunday evening, and have him interred in the Key West cemetery on Monday. He preferred St. Paul’s, so if one of the Episcopal priests from St. Paul’s will officiate, I’ll be grateful. I’m afraid I don’t know anyone, so—”\u003c/p\u003e\n\u003cp\u003e“I’ll see to the arrangements,” Richter assured her.\u003c/p\u003e\n\u003cp\u003eShe thanked him and rose.\u003c/p\u003e\n\u003cp\u003eThey shook hands, and he stood awkwardly as she exited.\u003c/p\u003e\n\u003cp\u003eHis secretary, Lilly, smiled as Kelsey came out of the inner office. “Is everything all set, then? Do you need another appointment?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” Kelsey told her. “If I have any problems, I’ll call in.”\u003c/p\u003e\n\u003cp\u003e“Are you planning on selling the property?” Lilly asked her. She was a sweet woman with bleached blond hair, slim features and, somehow, the look of an Afghan hound.\u003c/p\u003e\n\u003cp\u003e“I’m not sure yet.”\u003c/p\u003e\n\u003cp\u003e“Well, if so, you just let Mr. Richter know. He says that the property is worth a mint. A mint! The house is protected—it’s on the historic register—but the things that could be done around it are just amazing. You could honestly come out of this with quite a fortune,” Lilly told her. “Why, just a few weeks ago—before poor Mr. Merlin’s demise—Mr. Richter was saying that he’d studied the place, and he’d let Mr. Merlin know just what it was worth!” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-moon-bone-island-trilogy-3/page-14.html","bookId":2288,"creation":"Oct 5, 2019 5:53:58 PM","modification":"Oct 5, 2019 5:53:58 PM"}
