{"id":91774,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe new question took a moment to comprehend. She was surprised that he remembered how she had loved drawing.\u003c/p\u003e\n\u003cp\u003e“I’m a cartoonist. I have a column, and we do a little animated thing on the web,” she said. “I have an animator partner, and we’re doing fairly well. Thanks for asking.”\u003c/p\u003e\n\u003cp\u003e“That sounds great. Well…”\u003c/p\u003e\n\u003cp\u003eHis voice trailed off. He was a cop. He was busy.\u003c/p\u003e\n\u003cp\u003e“Thank you again, Liam. I’m glad the news came from you.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Kelsey. Though I guess it’s been a while since you’d seen Cutter.”\u003c/p\u003e\n\u003cp\u003e“We had talked,” she told him. Ah, yes, there were defensive tones to her words!\u003c/p\u003e\n\u003cp\u003e“Take care,” he told her.\u003c/p\u003e\n\u003cp\u003e“Of course, thank you—you, too.”\u003c/p\u003e\n\u003cp\u003eThe phone went dead in her hands. She still didn’t move for several minutes.\u003c/p\u003e\n\u003cp\u003eThe room darkened around her. Only the bright light above her drafting table gave illumination to her apartment.\u003c/p\u003e\n\u003cp\u003eShe liked where she lived. People often thought of the L.A. area as rather a hellhole of plastic people and traffic.\u003c/p\u003e\n\u003cp\u003eBut Hollywood had neighborhoods. She didn’t have to travel most of the time; she worked from home. She had great theater around her, and wonderful music venues. A decent, busy life in a place where there were actually local bars and coffee shops, where she knew the owners of the small restaurants near her and where, day by day, things were pleasant, good.\u003c/p\u003e\n\u003cp\u003eShe didn’t need to go back. She could call Joe Richter, and he could make any arrangements that might be necessary.\u003c/p\u003e\n\u003cp\u003eNo, she couldn’t. She owed Cutter the decency of arranging a funeral herself.\u003c/p\u003e\n\u003cp\u003eA beep notified her that Liam Beckett had sent her the text with Joe’s information.\u003c/p\u003e\n\u003cp\u003eShe would call him in the morning. She swiveled in her chair from the drafting board to her computer. And she keyed up the airlines, and made a reservation to reach Key West.\u003c/p\u003e\n\u003cp\u003eShe was going home.\u003c/p\u003e\n\u003cp\u003eOnce the reservation was made, she found herself thinking about her father. He’d been a good man. He’d loved her mother so much, and her, too. And he’d even loved Cutter Merlin, she thought. But when they had moved away, she had asked him why, and he had told her, “Because it isn’t safe, kitten. Because it just isn’t safe to be around Cutter, or that house, or…all that he has done. That man will never be safe, in life…or in death.”\u003c/p\u003e\n\u003cp\u003eThe call came when Liam was off duty, when he was down at O’Hara’s having dinner—the special for the night, fish and chips.\u003c/p\u003e\n\u003cp\u003eHis cousin David was frequently there, since David was about to marry Katie, Jamie O’Hara’s niece, and the karaoke hostess at her uncle’s bar. They’d all grown up together. Liam had stayed, while David had gone, until he’d returned recently. Sean, Katie’s brother, had also spent many of his adult years working around the world. Like David, he’d gone into photography and then film.\u003c/p\u003e\n\u003cp\u003eThere were others, friends of various ages, sexes, colors, shapes and sizes, who were local, and the locals came to O’Hara’s with a standard frequency, though the place also catered to tourists—in Key West, tourism was just about the only industry.\u003c/p\u003e\n\u003cp\u003eThe fish was fresh—caught that afternoon—and delicious, but he’d barely begun his meal, sympathizing with David about the problems inherent in planning a wedding when Jack Nissan called him from the station.\u003c/p\u003e\n\u003cp\u003e“I just got a call—something is going on over at the Merlin house. I know you cared about the old fellow and contacted his granddaughter. I thought that maybe you wanted to be the one to check it out,” Jack told him. “If not, I’m sorry to have called.”\u003c/p\u003e\n\u003cp\u003e“Who called, and what is the something going on?” Liam asked.\u003c/p\u003e\n\u003cp\u003e“Mrs. Shriver. She could see the place across the water from the wharf area. She said she saw lights, and knew that we’d found the old fellow dead. Should I just send someone on patrol to check it out?”\u003c/p\u003e\n\u003cp\u003e“No, Jack, thanks. I’ll go on over,” Liam told him.\u003c/p\u003e\n\u003cp\u003e“What is it?” David asked.\u003c/p\u003e\n\u003cp\u003e“A report of lights over at the Merlin house,” Liam said.\u003c/p\u003e\n\u003cp\u003e“Want me to come with you?” David asked.\u003c/p\u003e\n\u003cp\u003e“No, it’s all right. I’ll be back. I’ll see you later.”\u003c/p\u003e\n\u003cp\u003eWhen he headed out to his car, Liam knew that he was being followed. He paused, turning around.\u003c/p\u003e\n\u003cp\u003eBartholomew.\u003c/p\u003e\n\u003cp\u003eNot everyone saw Bartholomew, and frankly, he’d been among the last in their group to really see the pirate.\u003c/p\u003e\n\u003cp\u003eBartholomew had died in the eighteen hundreds. First, Bartholomew had attached himself to Katie O’Hara. Then, somehow, he had become Sean O’Hara’s ghost, and now, with the world quiet—and, Liam assumed, because the others were all living basically normal lives and were romantically involved—Bartholomew had decided to haunt him.\u003c/p\u003e\n\u003cp\u003eIt was quite sad, really. He’d listened to his cousin and the others talk about Bartholomew, but he might have actually believed that it was all part of a strange mass hallucination because of the danger they had been in.\u003c/p\u003e\n\u003cp\u003eBut then, Bartholomew had decided that he needed to attach himself to Liam. It had been after the affair out on Haunt Island, when, his cousin David had assured him, the ghost had been instrumental in saving a number of lives.\u003c/p\u003e\n\u003cp\u003eAt first, seeing a ghost was definitely disturbing. And as far as that went, he’d assumed you’d see some wisp of mist in the air—hear the rattle of chains—or the like. But seeing Bartholomew was like seeing any would-be contemporary costumed pirate in Key West.\u003c/p\u003e\n\u003cp\u003eThe pirate—or privateer—had been a good man. He could be a fine conversationalist, and had certainly helped them all in times of great distress.\u003c/p\u003e\n\u003cp\u003eIt was still unnerving to be followed about by a ghost few others could see, a man in an elegant brocade frock coat, ruffled shirt and waistcoat, and tricornered hat. Since it was Key West, with Fantasy Fest and Pirates in Paradise—not to mention Hemingway Days—it shouldn’t have felt that odd to be followed about by anyone in any attire—or lack thereof. Though it was illegal to travel the streets nude, there were those who did try it during Fantasy Fest, when body paint was the rage.\u003c/p\u003e\n\u003cp\u003eKatie O’Hara, was the one who had been born with the sixth sense, gift, curse or whatever one wanted to call it that allowed people to see what others did not. Liam didn’t think that the rest of them had anything that remotely resembled Katie’s gifts. But they had all survived events in which what wasn’t at all ordinary had played a major part.\u003c/p\u003e\n\u003cp\u003eAnd they all knew there were forces in the world that weren’t visible to the naked eye.\u003c/p\u003e\n\u003cp\u003eAnd he should have been accustomed to Bartholomew by now.\u003c/p\u003e\n\u003cp\u003eIn life, Bartholomew had surely been a dashing and charming individual. Even in death, he was quite a character: intelligent and with a keen sense of justice.\u003c/p\u003e\n\u003cp\u003e“What?” Liam said, spinning around.\u003c/p\u003e\n\u003cp\u003eBartholomew stopped short. “What do you mean, what? Cutter Merlin was found dead in a most unusual way, and, God knows, the place had its reputation. You just may need me.”\u003c/p\u003e\n\u003cp\u003e“It’s going to turn out to be kids, I’m willing to bet,” Liam said. “Teenagers who know the man died and want to break into a haunted house.”\u003c/p\u003e\n\u003cp\u003eBartholomew shrugged. “I’m just along for the ride,” he said. “I haven’t seen it yet. The place sounds extremely unusual, and I’m fascinated.”\u003c/p\u003e\n\u003cp\u003eLiam groaned. “All right, let’s go.”\u003c/p\u003e\n\u003cp\u003eLiam supposed it was natural that people—young and old—would find the Merlin house fascinating, and that it did make a great haunted house. Once, of course, it had been a beautiful grand dame, but time had done its work, and with Cutter Merlin being old and alone, it had taken on that aura of decay long before the gentleman had passed. Then, of course, there was the truth—he had been a collector of oddities, including human remains such as mummies and shrunken heads.\u003c/p\u003e\n\u003cp\u003eIt was a little more than a mile down Duval and around Front Street and then down around the little peninsula to reach the Merlin house. Liam parked in the overgrown yard. He exited the car and stared at the place, but not even the porch light he had left on after Merlin’s body had been removed was still shining. A burned-out bulb? Or was a prankster inside?\u003c/p\u003e\n\u003cp\u003e“That’s one eerie residence,” Bartholomew commented.\u003c/p\u003e\n\u003cp\u003eLiam shrugged and walked up the path to the porch. He tried the front door and found it unlocked. He knew that it had been locked and they had sealed up the entrance over the washer and dryer. Merlin’s attorney, Joe Richter, had the only other set of keys.\u003c/p\u003e\n\u003cp\u003eHe stepped in. Somehow, the house still seemed to have an aura of death about it.\u003c/p\u003e\n\u003cp\u003eHe tried the light switch by the front door, but nothing happened. He turned on his flashlight, and the parlor was illuminated.\u003c/p\u003e\n\u003cp\u003eAn odd whisper emanated through the house. In his mind’s eye, Liam thought about the layout of the house. The front door faced south and Old Town, Key West. Cutter’s library or office was to the left, and behind it was a workroom. The living room stretched the rest of the way in the front, with a doorway leading into the dining room. The kitchen stretched across the back of the house and could be entered through the dining room or the living room. In the center of the living room there was a grand stairway.\u003c/p\u003e\n\u003cp\u003eThe staircase where Kelsey’s mother had died.\u003c/p\u003e\n\u003cp\u003eHe hadn’t been there when it had happened; he had seen Kelsey after, at the funeral. Throughout the service, attended by most of the city, Kelsey had stood, pale and stoic, trying to be a rock for her father, and for Cutter.\u003c/p\u003e\n\u003cp\u003eLater, when the formal services had ended, they had come here.\u003c/p\u003e\n\u003cp\u003eFriends and neighbors had helped; food had been set on the buffets, and on the dining-room table, and people had talked. And one by one, their other friends had gone, and finally he had been alone with Kelsey, and they hadn’t said much; he had just held her while she sobbed, until she was so tired that she needed to be brought up to bed.\u003c/p\u003e\n\u003cp\u003eHe had carried her. With her father’s permission. Cutter had suggested that they just wake her; he had been loath to do so. “She’s not heavy, sir,” he had assured Cutter. But when he had brought her up the stairs and laid her down, she had clung to him, and he had stayed beside her in the darkness and the shadows until the exhaustion of her grief had brought sleep mercifully to her once again, and only then had he tiptoed away. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-moon-bone-island-trilogy-3/page-3.html","bookId":2288,"creation":"Oct 5, 2019 5:53:58 PM","modification":"Oct 5, 2019 5:53:58 PM"}
