{"id":91812,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe nodded. “Of course,” she whispered.\u003c/p\u003e\n\u003cp\u003eHe wanted so badly to take her into his arms. He wanted to punch the world, beat it to a pulp, do something that could make the nightmare end.\u003c/p\u003e\n\u003cp\u003eHe stood instead. “Kelsey, may I take the notes your grandfather left that you’ve already read?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eIn a businesslike manner, she quickly went through the book, extracting finely folded papers, opening them and checking them, and handing them to Liam.\u003c/p\u003e\n\u003cp\u003e“I’ll take good care of them, I promise.”\u003c/p\u003e\n\u003cp\u003e“I know you will.”\u003c/p\u003e\n\u003cp\u003eHe kissed her gently on the forehead and left her.\u003c/p\u003e\n\u003cp\u003eReading Cutter’s notes, Liam felt a sharp pain in his heart…or perhaps it was his conscience. All those years, Cutter Merlin had lived just waiting for the murderer to return.\u003c/p\u003e\n\u003cp\u003eHe hadn’t tried to get police help—it would have been in the records, or even in the memory of an older officer who would have talked about the “kook” out on the peninsula.\u003c/p\u003e\n\u003cp\u003e“Cutter, we owe you,” he told himself softly.\u003c/p\u003e\n\u003cp\u003eHe went back to another of the earlier notes.\u003c/p\u003e\n\u003cp\u003e“Lieutenant!” the copter pilot called to him. “Landing any minute.”\u003c/p\u003e\n\u003cp\u003e“Thanks!” he shouted in return.\u003c/p\u003e\n\u003cp\u003eBack at the airport, Liam glanced at his watch while he walked to his car. It was nearly 5:00 a.m. He was going to have to try to get a few hours of sleep.\u003c/p\u003e\n\u003cp\u003eHe started to head for his own home, and then changed his mind. He drove to the Merlin house.\u003c/p\u003e\n\u003cp\u003eHe came slowly onto the peninsula, searching the brush and bracken along the way through the glow of his headlights.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eAt the house, he entered with the key he’d kept when the place had been rekeyed. He stepped in quietly and waited, but he heard nothing. He sheepishly admitted to himself that he wished Bartholomew was with him, but Bartholomew had chosen to stay behind and watch over Kelsey.\u003c/p\u003e\n\u003cp\u003eBartholomew might sense if something was awry.\u003c/p\u003e\n\u003cp\u003eBut after a moment of standing there, he believed that he was alone in the house.\u003c/p\u003e\n\u003cp\u003eStill, with his police-issue revolver in his hand, he walked around. It seemed as if things were different. Just subtly different.\u003c/p\u003e\n\u003cp\u003eHe went from room to room, and checked every window. Nothing had been opened. It had to be his imagination. A statue of the Virgin Mary on the voodoo altar seemed just a bit out of whack. The suit of armor that had so terrified Ricky Long seemed to be a step forward. The mummy in his open sarcophagus seemed to have shifted.\u003c/p\u003e\n\u003cp\u003eBut there was no one in the house, and it was locked tight.\u003c/p\u003e\n\u003cp\u003eAs he walked, Liam decided that he’d have an alarm company out the next day. He didn’t know why the place hadn’t gotten an alarm system years ago. Maybe Cutter had wanted the perp who he believed had killed his daughter to come back. He had spent the remaining years of his life waiting.\u003c/p\u003e\n\u003cp\u003eAt last, he went upstairs. He opted for a hot shower.\u003c/p\u003e\n\u003cp\u003eHe missed Kelsey. He could smell the scents of her soap and shampoo. He’d taken what he had thought that she might want for an overnight stay in a chair at the hospital, but she was still there, everywhere, in his senses and in his mind.\u003c/p\u003e\n\u003cp\u003eWhen he came out, skin still hot and damp from the shower, he started to hit the bed.\u003c/p\u003e\n\u003cp\u003eBut Kelsey seemed to be with him. He grinned and locked the bedroom door.\u003c/p\u003e\n\u003cp\u003eHe went to bed, thinking he was so exhausted that he would sleep quickly. But he didn’t. Her sweet, clean, erotic scent was in the bed, and he stretched his arm out where she should have lain, and he missed her. It hurt. Deeply.\u003c/p\u003e\n\u003cp\u003eWhat the hell would he do with himself if she left him for another life?\u003c/p\u003e\n\u003cp\u003eHe couldn’t dwell on it; he needed sleep. He tried to will himself to rest.\u003c/p\u003e\n\u003cp\u003eHe finally drifted off.\u003c/p\u003e\n\u003cp\u003eHe woke, eyes flying open, and not knowing why.\u003c/p\u003e\n\u003cp\u003eHe had heard something downstairs.\u003c/p\u003e\n\u003cp\u003eHe got up quietly and slipped into his chinos and pulled a polo shirt over his head. He didn’t put shoes on, but quietly opened the door and started down the hall.\u003c/p\u003e\n\u003cp\u003eHe tiptoed down the stairs.\u003c/p\u003e\n\u003cp\u003eMorning’s light was pouring in; it was later than he thought. A glance at his watch told him that it was almost ten o’clock.\u003c/p\u003e\n\u003cp\u003eThere was nothing.\u003c/p\u003e\n\u003cp\u003eHe looked across the living room. He went from room to room, swearing when he stubbed his toe on the giant gargoyle.\u003c/p\u003e\n\u003cp\u003eHe went back upstairs, and through every room, and still there was nothing.\u003c/p\u003e\n\u003cp\u003eHe stood still, listening. There were just the usual sounds of a winter’s day in Key West. Birds. A distant sound of laughter and music. A ship’s horn.\u003c/p\u003e\n\u003cp\u003eShaking his head, he went back to Kelsey’s bedroom and finished dressing.\u003c/p\u003e\n\u003cp\u003eAs he did so, his cell phone rang.\u003c/p\u003e\n\u003cp\u003e“Boss?” It was Art Saunders.\u003c/p\u003e\n\u003cp\u003e“Yes, what is it?” he asked tensely. He groaned inwardly. “Another murder? What’s happened?”\u003c/p\u003e\n\u003cp\u003e“Well, it’s murder in a way.”\u003c/p\u003e\n\u003cp\u003e“Art, spit it out, what the hell has happened?”\u003c/p\u003e\n\u003cp\u003e“Um, it was the murder of a goat. The poor thing sure as hell didn’t die of natural causes. We have a dead goat on Smathers Beach. Looks like its throat was slit and its entrails were arranged across the sand. You’d better come quickly.”\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eThe little notes her grandfather left were on thin, delicate paper, folded discreetly in the pages. She couldn’t just shake the book to find them; she had to go page by page.\u003c/p\u003e\n\u003cp\u003eAs she did so, she read aloud when a particular passage seemed relevant.\u003c/p\u003e\n\u003cp\u003e“Here’s an interesting one, Avery,” Kelsey said. Avery hadn’t opened his eyes yet, but she was speaking to him, just as the doctor had said that she should. “It’s a prayer for a house! ‘Oh, Lord, let your presence protect this time and space, may you bless those who dwell within, and may you blacken and burn the hearts of those who do work against thee. Cast Satan and all his minions from here, and let all that is done here, and all that abide here, rest in your arms, the arms of Goodness, and Mercy, and Peace. Let us reflect your Divine Spirit, and no other.’”\u003c/p\u003e\n\u003cp\u003e“Very wordy,” Bartholomew said. He was leaning back in a chair at the far side of the room. He’d been there with her, and she was touched to realize that he had watched over her when she had drifted off through the night. Sleep hadn’t been easy. The chair extended, the hospital staff had given her a pillow and blankets, but she was cramped and tired.\u003c/p\u003e\n\u003cp\u003eWhen she had gone for coffee earlier, Bartholomew had been torn. He didn’t want her alone; he didn’t want Avery alone.\u003c/p\u003e\n\u003cp\u003eIn the end, he had decided that whoever was attempting murder at every turn was still in Key West—obsessed with the reliquary and the Merlin house. She had gone for coffee and an egg sandwich, and he had stayed and watched over Avery.\u003c/p\u003e\n\u003cp\u003e“Nice.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t Bartholomew who spoke; it was Avery.\u003c/p\u003e\n\u003cp\u003eKelsey gasped, nearly throwing the book from her hands. She looked at the bed. Avery was offering her a weak smile.\u003c/p\u003e\n\u003cp\u003eHis eyes were open.\u003c/p\u003e\n\u003cp\u003eBartholomew jumped to his feet, looked at Avery and sank back into his chair, arms crossing over his chest as he smiled at them both like the Cheshire cat.\u003c/p\u003e\n\u003cp\u003e“Oh, my God! Oh, thank God! Avery, you’re all right!” Kelsey said.\u003c/p\u003e\n\u003cp\u003eShe managed to set the book on the hospital bed before she bent over him, kissing his cheek, his forehead and his lips.\u003c/p\u003e\n\u003cp\u003e“Wait, wait!” he told her.\u003c/p\u003e\n\u003cp\u003eShe jumped back. “Did I hurt you? Oh, I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“No, no, I’m fine, you didn’t hurt me, only my head is spinning just a bit. Where am I? No, no, dumb question. We’re in a hospital.”\u003c/p\u003e\n\u003cp\u003eKelsey furrowed her brow, worried. “Avery, don’t you know what happened?”\u003c/p\u003e\n\u003cp\u003eHe was thoughtful for a second, touched his head and winced. “Yes, I do. I was talking to the dolphin.”\u003c/p\u003e\n\u003cp\u003e“Yes, you were out at the docks. You were fascinated by the dolphin. I went in, and you were going to talk to the dolphin awhile longer. When I came out, you were in the water.”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Avery, what happened?”\u003c/p\u003e\n\u003cp\u003eHe looked at her as if something was dawning in his mind. He smiled. “She saved me. He saved me. I’m certain. I felt myself falling, falling…and the creature lifted me up!”\u003c/p\u003e\n\u003cp\u003e“Avery, Jonas and I pulled you from the water. Liam administered CPR.”\u003c/p\u003e\n\u003cp\u003e“I don’t remember that, but thank you. No, bless you. I’m assuming you all saved my life. But, Kelsey, honestly, I do remember the creature, the dolphin, being there. I think I would have gone straight down if it hadn’t been for the dolphin.”\u003c/p\u003e\n\u003cp\u003eHe was obsessed with the dolphin. He was marveling about the animal, and, of course, she was amazed and gratified, as well. She’d heard such stories before, about dolphins rescuing swimmers, divers, surfers and shipwreck survivors. She didn’t think it at all impossible that a dolphin had kept him from drowning initially, and she was deeply grateful.\u003c/p\u003e\n\u003cp\u003eBut she needed information from him.\u003c/p\u003e\n\u003cp\u003eShe pulled out her cell phone and dialed Liam. He sounded a little tense when he answered, but she told him quickly, “Avery is awake.”\u003c/p\u003e\n\u003cp\u003e“Thank God,” he told her. “Does he know what happened? Can he talk to me on the phone?”\u003c/p\u003e\n\u003cp\u003e“He thinks that the dolphin saved him at first—the dolphin that hangs out by the docks next to the beach.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Liam said. “And before? Can he talk to me?”\u003c/p\u003e\n\u003cp\u003eShe held the phone up to Avery’s ear. She didn’t hear Liam’s question to him, but Avery’s response was clearly audible.\u003c/p\u003e\n\u003cp\u003e“Hell of a headache, and hell of a thing. I don’t know what happened. I was leaning over the dock. Then my head was killing me, the world was going black and I was in the water.”\u003c/p\u003e\n\u003cp\u003eKelsey was certain that Liam asked him to think, to try to remember every second leading up to what had happened.\u003c/p\u003e\n\u003cp\u003e“I was…was talking to the dolphin. Do you know they make noise? It was kind of making a little noise and moving back in the water…and…”\u003c/p\u003e\n\u003cp\u003eAvery stopped speaking. “I think I did hear something. Like a pounding. Yes! I felt a vibration on the wood, too. I thought that Kelsey had come back out. But before I could really register the sound or turn…I was in the water, my head killing me, the world going black and spinning.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-moon-bone-island-trilogy-3/page-41.html","bookId":2288,"creation":"Oct 5, 2019 5:53:58 PM","modification":"Oct 5, 2019 5:53:58 PM"}
