{"id":68803,"no":16,"title":"Page 16","content":"\u003cp\u003eThe following Monday Lara had a visitor.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a Mr. O\u0027Brian here to see you from the city planning commissioner\u0027s office, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"What about?\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t say.\"\u003c/p\u003e\n\u003cp\u003eLara buzzed Keller on the intercom. \"Will you come in here, Howard?\" She said to the secretary, \"Send Mr. O\u0027Brian in.\"\u003c/p\u003e\n\u003cp\u003eAndy O\u0027Brian was a burly red-faced Irishman with a slight brogue. \"Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003eLara remained seated behind her desk. \"Yes. What can I do for you, Mr. O\u0027Brian?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid you\u0027re in violation of the law, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"Really? What is this all about?\"\u003c/p\u003e\n\u003cp\u003e\"You own the Dorchester Apartments on East Fourteenth Street?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"We have a report that about a hundred homeless people have crowded into those apartments.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that.\" Lara smiled. \"Yes, I thought that since the city wasn\u0027t doing anything about the homeless, I would help out. I\u0027m giving them shelter.\"\u003c/p\u003e\n\u003cp\u003eHoward Keller walked into the room.\u003c/p\u003e\n\u003cp\u003e\"This is Mr. Keller. Mr. O\u0027Brian.\"\u003c/p\u003e\n\u003cp\u003eThe two men shook hands.\u003c/p\u003e\n\u003cp\u003eLara turned to Keller. \"I was just explaining how we\u0027re helping the city out by providing housing.\"\u003c/p\u003e\n\u003cp\u003e\"You invited them in, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a license from the city?\"\u003c/p\u003e\n\u003cp\u003e\"A license for what?\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re setting up a shelter, it has to be approved by the city. There are certain strict conditions that are enforced.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I wasn\u0027t aware of that. I\u0027ll arrange for the license immediately.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve had complaints from the tenants in the building. They say you\u0027re trying to force them out.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense.\"\u003c/p\u003e\n\u003cp\u003e\"Miss Cameron, the city is giving you forty-eight hours to move those homeless people out of there. And when they leave, we have an order for you to take down the boards that you put up to cover the windows.\"\u003c/p\u003e\n\u003cp\u003eLara was furious. \"Is that all?\"\u003c/p\u003e\n\u003cp\u003e\"No, ma\u0027am. The tenant who has the roof garden says you put up a sign blocking his view. You\u0027ll have to take that down, too.\"\u003c/p\u003e\n\u003cp\u003e\"What if I won\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"I think you will. All this comes under harassment. You\u0027ll save yourself a lot of trouble and unpleasant publicity by not forcing us to take you to court.\" He nodded and said, \"Have a nice day.\"\u003c/p\u003e\n\u003cp\u003eThey watched him walk out of the office.\u003c/p\u003e\n\u003cp\u003eKeller turned to Lara. \"We\u0027ll have to get all those people out of there.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She sat there, thinking.\u003c/p\u003e\n\u003cp\u003e\"What do you mean \u0027no\u0027? The man said...\"\u003c/p\u003e\n\u003cp\u003e\"I know what he said. I want you to bring in more homeless. I want that building packed with street people. We\u0027re going to stall. Call Terry Hill. Tell him the problem. Have him get a stay or something. We\u0027ve got to get those six tenants out by the end of the month or it\u0027s going to cost us three million dollars.\"\u003c/p\u003e\n\u003cp\u003eThe intercom buzzed. \"Dr. Peters is on the phone.\"\u003c/p\u003e\n\u003cp\u003eLara picked up the telephone. \"Hello, Alan.\"\u003c/p\u003e\n\u003cp\u003e\"I just wanted to tell you that we finished the operation. It looks like we got it all. Kathy\u0027s going to be fine.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s wonderful news. When can I visit her?\"\u003c/p\u003e\n\u003cp\u003e\"You can come by this afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do that. Thanks, Alan. See that I get all the bills, will you?\"\u003c/p\u003e\n\u003cp\u003e\"Will do.\"\u003c/p\u003e\n\u003cp\u003e\"And you can tell the hospital to expect a donation. Fifty thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eLara said to Tricia, \"Fill her room with flowers.\" She looked at her schedule. \"I\u0027ll go down to see her at four o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eTerry Hill arrived at the office. \"There\u0027s a warrant for your arrest coming in.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Weren\u0027t you warned to get those homeless people out of the building?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but...\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t get away with this, Lara. There\u0027s an old adage: \u0027Don\u0027t fight City Hall, you can\u0027t win.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Are they really going to arrest me?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re damn right they are. You were given notice by the city to get those people out of there.\"\u003c/p\u003e\n\u003cp\u003e\"All right,\" Lara said. \"Let\u0027s get them out.\" She turned to Keller. \"Remove them, but don\u0027t put them out on the street. That isn\u0027t right... We have those empty rooming houses that we\u0027re waiting to convert in the West Twenties. Let\u0027s put them there. Take all the help you need. I want them gone in an hour.\"\u003c/p\u003e\n\u003cp\u003eShe turned to Terry Hill. \"I\u0027ll be out of here, so they can\u0027t serve me. By the time they do, the problem will be solved.\"\u003c/p\u003e\n\u003cp\u003eThe intercom buzzed. \"There are two gentlemen here from the district attorney\u0027s office.\"\u003c/p\u003e\n\u003cp\u003eLara motioned to Howard Keller. He walked over to the intercom and said, \"Miss Cameron isn\u0027t here.\"\u003c/p\u003e\n\u003cp\u003eThere was a silence. \"When do you expect her?\"\u003c/p\u003e\n\u003cp\u003eKeller looked at Lara. Lara shook her head. Keller said into the intercom, \"We don\u0027t know.\" He flicked the key up.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go out the back way,\" Lara said.\u003c/p\u003e\n\u003cp\u003eLara hated hospitals. A hospital was her father lying in bed, pale and suddenly old. \"What the bluidy hell are you doin\u0027 here? You\u0027ve work to dae at the boardinghouse.\"\u003c/p\u003e\n\u003cp\u003eLara walked into Kathy\u0027s room. It was filled with flowers. Kathy was sitting up in bed.\u003c/p\u003e\n\u003cp\u003e\"How do you feel?\" Lara asked.\u003c/p\u003e\n\u003cp\u003eKathy smiled. \"The doctor said I\u0027m going to be fine.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better be. Your work is piling up. I need you.\"\u003c/p\u003e\n\u003cp\u003e\"I...I don\u0027t know how to thank you for all this.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eLara picked up the bedside phone and put a call through to her office. She spoke to Terry Hill.\u003c/p\u003e\n\u003cp\u003e\"Are they still there?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re still here. They intend to stay until you return.\"\u003c/p\u003e\n\u003cp\u003e\"Check with Howard. As soon as he clears the street people out of the building, I\u0027ll come back.\"\u003c/p\u003e\n\u003cp\u003eLara replaced the receiver.\u003c/p\u003e\n\u003cp\u003e\"If you need anything, let me know,\" Lara said. \"I\u0027ll be back to see you tomorrow.\"\u003c/p\u003e\n\u003cp\u003eLara\u0027s next stop was at the architectural offices of Higgins, Almont \u0026amp; Clark. She was ushered in to see Mr. Clark. He rose as she walked into his office.\u003c/p\u003e\n\u003cp\u003e\"What a nice surprise. What can I do for you, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003e\"Do you have the plans here for the project on Fourteenth Street?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, indeed.\"\u003c/p\u003e\n\u003cp\u003eHe went over to his drawing board. \"Here we are.\"\u003c/p\u003e\n\u003cp\u003eThere was a sketch of a beautiful high rise complex with apartment buildings and shops around it.\u003c/p\u003e\n\u003cp\u003e\"I want you to redraw it,\" Lara said.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eLara pointed to a space in the middle of the block. \"There\u0027s a building still standing in this area. I want you to draw the same concept, but construct it around that building.\"\u003c/p\u003e\n\u003cp\u003e\"You mean you want to put up the project with one of the old buildings still standing? It would never work. First of all, it would look terrible and...\"\u003c/p\u003e\n\u003cp\u003e\"Just do it, please. Send it over to my office this afternoon.\"\u003c/p\u003e\n\u003cp\u003eAnd Lara was gone.\u003c/p\u003e\n\u003cp\u003eFrom the car she telephoned Terry Hill. \"Have you heard from Howard yet?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. The squatters have all been cleared out.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Get the district attorney on the phone. Tell him that I had ordered those squatters out two days ago and that there was a lack of communication. The minute I heard about it, today, I had them moved out. I\u0027m on my way back to the office now. See if he still wants to arrest me.\"\u003c/p\u003e\n\u003cp\u003eShe said to the driver, \"Drive through the park. Take your time.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later, when Lara reached her office, the men with the warrant were gone.\u003c/p\u003e\n\u003cp\u003eLara was in a meeting with Howard Keller and Terry Hill.\u003c/p\u003e\n\u003cp\u003e\"The tenants still won\u0027t budge,\" Keller said. \"I even went back and offered them more money. They\u0027re not leaving. We\u0027ve only got five days left before we have to begin bulldozing.\"\u003c/p\u003e\n\u003cp\u003eLara said, \"I asked Mr. Clark to draw up a new blueprint for the project.\"\u003c/p\u003e\n\u003cp\u003e\"I saw it,\" Keller said. \"It doesn\u0027t make any sense. We can\u0027t leave that old building standing in the middle of a new giant construction. We\u0027re going to have to go to the bank and ask them if they\u0027ll move back the start date.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Lara said. \"I want to move it up.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Get hold of the contractor. Tell him we want to start bulldozing tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow? Lara...\"\u003c/p\u003e\n\u003cp\u003e\"First thing in the morning. And take that blueprint and give it to the foreman of the construction crew.\"\u003c/p\u003e\n\u003cp\u003e\"What good will that do?\" Keller asked.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eThe following morning the remaining tenants of the Dorchester Apartments were awakened by the roar of a bulldozer. They looked out of their windows. Halfway down the block, as they watched, a mechanical behemoth was moving toward them, leveling everything in its path. The tenants were stunned.\u003c/p\u003e\n\u003cp\u003eMr. Hershey, who lived on the top floor, rushed outside and hurried over to the foreman. \"What do you think you\u0027re doing?\" he screamed. \"You can\u0027t go ahead with this.\"\u003c/p\u003e\n\u003cp\u003e\"Who says so?\"\u003c/p\u003e\n\u003cp\u003e\"The city does.\" Hershey pointed to the building he lived in. \"You\u0027re not permitted to touch that building.\"\u003c/p\u003e\n\u003cp\u003eThe foreman looked at the blueprint in front of him. \"That\u0027s right,\" he said. \"We have orders to leave that building standing.\"\u003c/p\u003e\n\u003cp\u003eHershey frowned. \"What? Let me see that.\" He looked at the plan and gasped. \"They\u0027re going to put up the plaza and leave this building standing?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, mister.\"\u003c/p\u003e\n\u003cp\u003e\"But they can\u0027t do that! The noise and dirt!\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not my problem. Now, if you\u0027ll get out of my way, I\u0027d like to get back to work.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later Lara\u0027s secretary said, \"There\u0027s a Mr. Hershey on line two, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"Tell him I\u0027m not available.\"\u003c/p\u003e\n\u003cp\u003eWhen Hershey called for the third time that afternoon, Lara finally picked up the phone and spoke with him.\u003c/p\u003e\n\u003cp\u003e\"Yes, Mr. Hershey. What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to come in and see you, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I\u0027m rather busy. Whatever it is you have to say you can say on the phone.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you\u0027ll be glad to know that I\u0027ve talked to the other tenants in our building and we\u0027ve agreed that it might be best after all to take your offer and vacate our apartments.\"\u003c/p\u003e\n\u003cp\u003e\"That offer is no longer good, Mr. Hershey. You can all stay where you are.\"\u003c/p\u003e\n\u003cp\u003e\"If you build around us, we\u0027re never going to get any sleep!\"\u003c/p\u003e\n\u003cp\u003e\"Who told you we were going to build around you?\" Lara demanded. \"Where did you get that information?\"\u003c/p\u003e\n\u003cp\u003e\"The foreman on the job showed me a blueprint and...\"\u003c/p\u003e\n\u003cp\u003e\"Well, he\u0027s going to be fired.\" There was fury in Lara\u0027s voice. \"That was confidential information.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute. Let\u0027s talk like two reasonable people, okay? Your project would be better off if we got out of here, and I think we\u0027d be better off leaving. I don\u0027t want to live in the middle of a damned high rise.\"\u003c/p\u003e\n\u003cp\u003eLara said, \"It doesn\u0027t matter to me whether you go or stay, Mr. Hershey.\" Her voice softened. \"I\u0027ll tell you what I\u0027ll do. If that building is vacated by next month I\u0027m willing to go with our first offer.\"\u003c/p\u003e\n\u003cp\u003eShe could hear him thinking it over.\u003c/p\u003e\n\u003cp\u003eFinally he said reluctantly, \"Okay. I\u0027ll talk to the others, but I\u0027m sure it will be all right. I really appreciate this, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003eLara said, \"It\u0027s been my pleasure, Mr. Hershey.\"\u003c/p\u003e\n\u003cp\u003eThe following month, work on the new project began in earnest.\u003c/p\u003e\n\u003cp\u003eLara\u0027s reputation was growing. Cameron Enterprises was putting up a high rise in Brooklyn, a shopping center in Westchester, a mall in Washington, D.C. There was a lowcost housing project being constructed in Dallas and a block of condominiums in Los Angeles. Capital flowed in from banks, savings and loan companies, and eager private investors. Lara had become a Name.\u003c/p\u003e\n\u003cp\u003eKathy had returned to work.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m back.\"\u003c/p\u003e\n\u003cp\u003eLara studied her a moment. \"How do you feel?\"\u003c/p\u003e\n\u003cp\u003eKathy smiled. \"Great. Thanks to...\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a lot of energy?\"\u003c/p\u003e\n\u003cp\u003eShe was surprised at the question. \"Yes. I...\"\u003c/p\u003e\n\u003cp\u003e\"Good. You\u0027re going to need it. I\u0027m making you my executive assistant. There will be a nice raise for you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what to say. I...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve earned it.\"\u003c/p\u003e\n\u003cp\u003eLara saw the memo in Kathy\u0027s hand. \"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"Gourmet magazine would like to publish your favorite recipe. Are you interested?\"\u003c/p\u003e\n\u003cp\u003e\"No. Tell them I\u0027m too...wait a minute.\" She sat there a moment, lost in thought. Then she said softly, \"Yes. I\u0027ll give them a recipe.\"\u003c/p\u003e\n\u003cp\u003eThe recipe appeared in the magazine three months later.\u003c/p\u003e\n\u003cp\u003eIt began:\u003c/p\u003e\n\u003cp\u003eBlack Bun - A classic Scottish dish. A mixture encased in a short paste jacket made from half a pound of flour, a quarter pound of butter, a touch of cold water, and a half a teaspoon of baking power. Inside are two pounds of raisins, half a pound of chopped almonds, three-quarters of a pound of flour, half a pound of sugar, two teaspoons of allspice, a teaspoon of ground ginger, a teaspoon of cinnamon, a half teaspoon of baking powder, and a dash of brandy...\u003c/p\u003e\n\u003cp\u003eLara looked at the article for a long time, and it brought back the taste of it, the smell of the boardinghouse kitchen, the noise of the boarders at supper. Her father helpless in his bed. She put the magazine away.\u003c/p\u003e\n\u003cp\u003ePeople recognized Lara on the street, and when she walked into a restaurant, there were always excited whispers. She was escorted around town by half a dozen eligible suitors and had flattering proposals, but she was not interested. In a strange, almost eerie way, she was still looking for someone. Someone familiar. Someone she had never met.\u003c/p\u003e\n\u003cp\u003eLara would wake up at five o\u0027clock every morning and have her driver, Max, take her to one of the buildings under construction. She would stand there, staring at what she was creating, and she thought, You were wrong, Father. I can collect the rents.\u003c/p\u003e\n\u003cp\u003eFor Lara, the sounds of the day began with the rat-a-tat-tat of the jackhammers, the roar of the bulldozers, the clanging of heavy metal. She would ride the rickety construction elevator to the top and stand on the steel girders with the wind blowing in her face, and she thought, I won this city.\u003c/p\u003e\n\u003cp\u003ePaul Martin and Lara were in bed.\u003c/p\u003e\n\u003cp\u003e\"I hear you chewed out a couple of your construction workers pretty good today.\"\u003c/p\u003e\n\u003cp\u003e\"They deserved it,\" Lara said. \"They were doing sloppy work.\"\u003c/p\u003e\n\u003cp\u003ePaul grinned. \"At least you\u0027ve learned not to slap them.\"\u003c/p\u003e\n\u003cp\u003e\"Look what happened when I did slap one.\" She snuggled up to him. \"I met you.\"\u003c/p\u003e\n\u003cp\u003e\"I have to take a trip to L.A.,\" Paul said. \"I\u0027d like you to come with me. Can you get away for a few days?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to, Paul, but it\u0027s impossible. I schedule my days with a stopwatch.\"\u003c/p\u003e\n\u003cp\u003eHe sat up and looked down at her. \"Maybe you\u0027re doing too much, baby. Don\u0027t ever get too busy for me.\"\u003c/p\u003e\n\u003cp\u003eLara smiled and began to stroke him. \"Don\u0027t worry about that. It will never happen.\"\u003c/p\u003e\n\u003cp\u003eIt had been there in front of her all the time, and she had not seen it. It was a huge waterfront property in the Wall Street area, near the World Trade Center. And it was for sale. Lara had passed it a dozen times, but she looked at it now and saw what should have been there all along: In her mind, she could see the world\u0027s tallest building. She knew what Howard was going to say: \"You\u0027re getting in over your head, Lara. You can\u0027t get involved with this.\" But she knew that nothing was going to stop her.\u003c/p\u003e\n\u003cp\u003eWhen she got to the office, she called a meeting of her staff.\u003c/p\u003e\n\u003cp\u003e\"The Wall Street property on the waterfront,\" Lara said. \"We\u0027re going to buy it. We\u0027re going to put up the tallest skyscraper in the world.\"\u003c/p\u003e\n\u003cp\u003e\"Lara...\"\u003c/p\u003e\n\u003cp\u003e\"Before you say anything, Howard, let me point out a few things. The location is perfect. It\u0027s in the heart of the business district. Tenants will be fighting to get office space there. And remember, it\u0027s going to be the tallest skyscraper in the world. That\u0027s a big sizzle. It\u0027s going to be our flagship. We\u0027ll call it Cameron Towers.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the money coming from?\"\u003c/p\u003e\n\u003cp\u003eLara handed him a piece of paper.\u003c/p\u003e\n\u003cp\u003eKeller was examining the figures. \"You\u0027re being optimistic.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m being realistic. We\u0027re not talking about just any building. We\u0027re talking about a jewel, Howard.\"\u003c/p\u003e\n\u003cp\u003eHe was thinking hard. \"You\u0027ll be stretching yourself thin.\"\u003c/p\u003e\n\u003cp\u003eLara smiled. \"We\u0027ve done that before, haven\u0027t we?\"\u003c/p\u003e\n\u003cp\u003eKeller said, thoughtfully, \"The tallest skyscraper in the world...\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. And the banks call us every day, throwing money at us. They\u0027ll jump at this.\"\u003c/p\u003e\n\u003cp\u003e\"They probably will,\" Keller said. He looked at Lara. \"You really want this, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eKeller sighed. He looked around at the group. \"All right. The first step is to take an option on the property.\"\u003c/p\u003e\n\u003cp\u003eLara smiled. \"I\u0027ve already done that. And I have some other news for you. Steve Murchison was negotiating for that property.\"\u003c/p\u003e\n\u003cp\u003e\"I remember him. We took that hotel site away from him in Chicago.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to let it go this time, bitch, because I don\u0027t think you know what the hell you\u0027re doing. But in the future, stay out of my way - you could get hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" Murchison had become one of the most ruthless and successful real estate developers in New York. Keller said, \"Lara, he\u0027s bad news. He enjoys destroying people.\"\u003c/p\u003e\n\u003cp\u003e\"You worry too much.\"\u003c/p\u003e\n\u003cp\u003eThe financing for Cameron Towers went smoothly. Lara had been right. The bankers felt that there was a sizzle to the tallest skyscraper in the world. And the name of Cameron was an added cachet. They were eager to be associated with her.\u003c/p\u003e\n\u003cp\u003eLara was more than a glamorous figure. She was a symbol to the women of the world, an icon. If she can accomplish this, why not me? A perfume was named after her. She was invited to all the important social events, and hostesses were eager to have her at their dinner parties. Her name on a building seemed to ensure success.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to start our own construction company,\" Lara decided one day. \"We have the crews. We\u0027ll rent them out to other builders.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not a bad idea,\" Keller said.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go for it. How soon are we going to break ground for Cameron Towers?\"\u003c/p\u003e\n\u003cp\u003e\"The deal\u0027s in place. I would say three months from now.\"\u003c/p\u003e\n\u003cp\u003eLara sat back in her chair. \"Can you imagine it, Howard? The tallest skyscraper in the world.\"\u003c/p\u003e\n\u003cp\u003eHe wondered what Freud would have made of that.\u003c/p\u003e\n\u003cp\u003eThe ground-breaking ceremony for Cameron Towers had the atmosphere of a three-ring circus. America\u0027s Princess, Lara Cameron, was the main attraction. The event had been heavily publicized in the newspapers and on television, and a crowd of more than two hundred people had gathered, waiting for Lara to arrive. When her white limousine pulled up to the building site, there was a roar from the crowd.\u003c/p\u003e\n\u003cp\u003e\"There she is!\"\u003c/p\u003e\n\u003cp\u003eAs Lara stepped out of the car and moved toward the building site to greet the mayor, police and security guards held the crowd back. The people pushed forward, screaming and calling her name, and the photographers\u0027 flashbulbs began popping.\u003c/p\u003e\n\u003cp\u003eIn a special roped-off section were the bankers, heads of advertising agencies, company directors, contractors, project managers, community representatives, and architects. One hundred feet away, large bulldozers and backhoes were standing by, ready to go to work. Fifty trucks were lined up to cart the rubble away.\u003c/p\u003e\n\u003cp\u003eLara was standing next to the mayor and the Manhattan borough president. It had started to drizzle. Jerry Townsend, head of public relations for Cameron Enterprises, hurried toward Lara with an umbrella. She smiled and waved him away.\u003c/p\u003e\n\u003cp\u003eThe mayor spoke into the cameras. \"Today is a great day for Manhattan. This ground-breaking ceremony at Cameron Towers marks the beginning of one of the largest real estate projects in Manhattan\u0027s history. Six blocks of Manhattan real estate will be converted into a modern community that will include apartment buildings, two shopping centers, a convention center, and the tallest skyscraper in the world.\"\u003c/p\u003e\n\u003cp\u003eThere was applause from the crowd.\u003c/p\u003e\n\u003cp\u003e\"Wherever you look,\" the mayor continued, \"you can see Lara Cameron\u0027s contribution written in concrete.\" He pointed. \"Uptown is the Cameron Center. And near it, Cameron Plaza and half a dozen housing projects. And across the country is the great Cameron Hotel chain.\"\u003c/p\u003e\n\u003cp\u003eThe mayor turned to Lara and smiled. \"And she\u0027s not only brainy, she\u0027s beautiful.\"\u003c/p\u003e\n\u003cp\u003eThere was laughter and more applause.\u003c/p\u003e\n\u003cp\u003e\"Lara Cameron, ladies and gentlemen.\"\u003c/p\u003e\n\u003cp\u003eLara looked into the television cameras and smiled. \"Thank you, Mr. Mayor. I\u0027m very pleased to have made some small contribution to this fabulous city of ours. My father always told me that the reason we were put on this earth was...\" She hesitated. Out of the corner of her eye, she had seen a familiar figure in the crowd. Steve Murchison. She had seen his photograph in newspapers... What was he doing here? Lara went on... \"was to leave it a better place than when we came into it. Well, I hope that in my own small way, I\u0027ve been able to do that.\"\u003c/p\u003e\n\u003cp\u003eThere was more applause. Lara was handed a ceremonial hard hat and a chrome-plated shovel.\u003c/p\u003e\n\u003cp\u003e\"Time to go to work, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003eThe flashbulbs began to pop again.\u003c/p\u003e\n\u003cp\u003eLara pushed the shovel into the dirt and dug up the first bit of earth.\u003c/p\u003e\n\u003cp\u003eAt the conclusion of the ceremony, refreshments were served, while the television cameras kept recording the event. When Lara looked around again, Murchison was nowhere in sight.\u003c/p\u003e\n\u003cp\u003eThirty minutes later Lara Cameron was back in the limousine headed for the office. Jerry Townsend was seated next to her.\u003c/p\u003e\n\u003cp\u003e\"I thought it went great,\" he said. \"Just great.\"\u003c/p\u003e\n\u003cp\u003e\"Not bad,\" Lara grinned. \"Thanks, Jerry.\"\u003c/p\u003e\n\u003cp\u003eThe executive suites of Cameron Enterprises occupied the entire fiftieth floor of Cameron Center.\u003c/p\u003e\n\u003cp\u003eLara got off at the fiftieth floor, and by then the word had gotten around that she was arriving. The secretaries and staff were busily at work.\u003c/p\u003e\n\u003cp\u003eLara turned to Jerry Townsend. \"Come into my office.\"\u003c/p\u003e\n\u003cp\u003eThe office was an enormous corner suite overlooking the city.\u003c/p\u003e\n\u003cp\u003eLara glanced at some papers on her desk and looked up at Jerry.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s your father? Is he any better?\"\u003c/p\u003e\n\u003cp\u003eWhat did she know about his father?\u003c/p\u003e\n\u003cp\u003e\"He\u0027s...he\u0027s not well.\"\u003c/p\u003e\n\u003cp\u003e\"I know. He has Huntington\u0027s chorea, hasn\u0027t he, Jerry?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eIt was a terrible disease. It was progressive and degenerative, characterized by spasmodic involuntary movements of the face and extremities, accompanied by the loss of mental faculties.\u003c/p\u003e\n\u003cp\u003e\"How do you know about my father?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m on the board at the hospital where he\u0027s being treated. I heard some doctors discussing his case.\"\u003c/p\u003e\n\u003cp\u003eJerry said tightly, \"It\u0027s incurable.\"\u003c/p\u003e\n\u003cp\u003e\"Everything is incurable until they find the cure,\" Lara said. \"I did some checking. There\u0027s a doctor in Switzerland who\u0027s doing some advanced research on the disease. He\u0027s willing to take on your father\u0027s case. I\u0027ll handle the expenses.\"\u003c/p\u003e\n\u003cp\u003eJerry stood there, stunned.\u003c/p\u003e\n\u003cp\u003e\"Okay?\"\u003c/p\u003e\n\u003cp\u003eHe found it difficult to speak. \"Okay.\" I don\u0027t know her, Jerry Townsend thought. Nobody knows her.\u003c/p\u003e\n\u003cp\u003eHistory was being made, but Lara was too busy to notice. Ronald Reagan had been re-elected, and a man named Mikhail Gorbachev had succeeded Chernenko as leader of the USSR.\u003c/p\u003e\n\u003cp\u003eLara built a low-income housing development in Detroit.\u003c/p\u003e\n\u003cp\u003eIn 1986 Ivan Boesky had been fined a hundred million dollars in an insider trading scandal and sentenced to three years in prison.\u003c/p\u003e\n\u003cp\u003eLara started development on condominiums in Queens. Investors were eager to be a part of the magic of her name. A group of German investment bankers flew to New York to meet with Lara. She arranged for the meeting immediately after their plane landed. They had protested, but Lara said, \"I\u0027m so sorry, gentlemen. It\u0027s the only time I have. I\u0027m leaving for Hong Kong.\"\u003c/p\u003e\n\u003cp\u003eThe Germans were served coffee. Lara had tea. One of the Germans complained about the taste of the coffee. \"It\u0027s a special brand made for me,\" Lara explained. \"The flavor will grow on you. Have another cup.\"\u003c/p\u003e\n\u003cp\u003eBy the end of the negotiations Lara had won all her points.\u003c/p\u003e\n\u003cp\u003eLife was a series of serendipities, except for one disturbing incident. Lara had had several run-ins with Steve Murchison over various properties, and she had always managed to outwit him.\u003c/p\u003e\n\u003cp\u003e\"I think we should back off,\" Keller warned.\u003c/p\u003e\n\u003cp\u003e\"Let him back off.\"\u003c/p\u003e\n\u003cp\u003eAnd one morning a beautiful package wrapped in rose paper arrived from Bendel\u0027s. Kathy laid it on Lara\u0027s desk.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s awfully heavy,\" Kathy said. \"If it\u0027s a hat, you\u0027re in trouble.\"\u003c/p\u003e\n\u003cp\u003eCurious, Lara unwrapped it and opened the lid. The box was packed with dirt. A printed card inside read: \"The Frank E. Campbell Funeral Chapel.\"\u003c/p\u003e\n\u003cp\u003eThe building projects were all going well. When Lara read about a proposed inner-city playground that was stymied because of bureaucratic red tape, she stepped in, had her company build it, and donated it to the city. The publicity she received on it was enormous. One headline read: LARA CAMERON STANDS FOR \"CAN DO.\"\u003c/p\u003e\n\u003cp\u003eShe was seeing Paul once or twice a week, and she talked to him every day.\u003c/p\u003e\n\u003cp\u003eLara bought a house in Southampton and lived in a fantasy world of expensive jewels and furs and limousines. Her closets were filled with beautiful designer clothes. \"I need some clothes for school.\" \"Weel, I\u0027m nae made of money. Get yourself something frae the Salvation Army Citadel.\"\u003c/p\u003e\n\u003cp\u003eAnd Lara would order another outfit.\u003c/p\u003e\n\u003cp\u003eHer employees were her family. She worried about them and was generous with them. They were all she had. She remembered their birthdays and anniversaries. She helped get their children into good schools and set up scholarship funds for them. When they tried to thank her, Lara was embarrassed. It was difficult for her to express her emotions. Her father had ridiculed her when she had tried. Lara had built a protective wall around herself. No one is ever going to hurt me again, she vowed. No one. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stars-shine-down/page-16.html","bookId":2364,"creation":"Oct 5, 2019 10:10:56 AM","modification":"Oct 5, 2019 10:10:56 AM"}
