{"id":68804,"no":17,"title":"Page 17","content":"\u003cp\u003eBOOK THREE\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003e\"I\u0027m leaving for London in the morning, Howard.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s up?\" Keller asked.\u003c/p\u003e\n\u003cp\u003e\"Lord Macintosh has invited me to come over and take a look at a property he\u0027s interested in. He wants to go into partnership.\"\u003c/p\u003e\n\u003cp\u003eBrian Macintosh was one of the wealthiest real estate developers in England.\u003c/p\u003e\n\u003cp\u003e\"What time do we leave?\" Keller asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve decided to go alone.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to keep an eye on things here.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Right. I\u0027ll do that.\"\u003c/p\u003e\n\u003cp\u003e\"I know you will. I can always count on you.\"\u003c/p\u003e\n\u003cp\u003eThe trip to London was uneventful. The private 727 she had purchased took off in the morning and landed at the Magec Terminal at Luton Airport outside London. She had no idea her life was about to change.\u003c/p\u003e\n\u003cp\u003eWhen Lara arrived at the lobby of Claridges, Ronald Jones, the manager, was there to greet her. \"It\u0027s a pleasure to have you back, Miss Cameron. I\u0027ll show you to your suite. By the way, we have some messages for you.\" There were more than two dozen.\u003c/p\u003e\n\u003cp\u003eThe suite was lovely. There were flowers from Brian MacIntosh and from Paul Martin, and champagne and hors d\u0027oeuvres from the management. The phone began to ring the minute Lara walked in. The calls were from all over the United States.\u003c/p\u003e\n\u003cp\u003e\"The architect wants to make some changes in the plans. It will cost a fortune...\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a holdup on the cement delivery...\"\u003c/p\u003e\n\u003cp\u003e\"The First National Savings and Loan wants in on our next deal...\"\u003c/p\u003e\n\u003cp\u003e\"The mayor wants to know if you can be in L.A. for the opening. He\u0027d like to plan a big ceremony...\"\u003c/p\u003e\n\u003cp\u003e\"The toilets haven\u0027t arrived...\"\u003c/p\u003e\n\u003cp\u003e\"Bad weather is holding us up. We\u0027re falling behind schedule...\"\u003c/p\u003e\n\u003cp\u003eEach problem required a decision, and when Lara finally finished with her calls, she was exhausted. She had dinner in her room alone and sat looking out the window, at the Rolls-Royces and Bentleys pulling up to the Brook Street entrance, and a feeling of elation swept over her. The little girl from Glace Bay has come a long way, Daddy.\u003c/p\u003e\n\u003cp\u003eThe following morning Lara went with Brian Macintosh to look at the proposed site. It was enormous - two miles of riverside frontage filled with old run-down buildings and storage sheds.\u003c/p\u003e\n\u003cp\u003e\"The British government will give us a lot of tax relief on this,\" Brian Macintosh explained, \"because we\u0027re going to rehabilitate this whole section of the city.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to think about it,\" Lara said. She had already made up her mind.\u003c/p\u003e\n\u003cp\u003e\"By the way, I have tickets to a concert tonight,\" Brian Macintosh told her. \"My wife has a club meeting. Do you like classical music?\"\u003c/p\u003e\n\u003cp\u003eLara had no interest in classical music. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Philip Adler is playing Rachmaninoff.\" He looked at Lara as though expecting her to say something. She had never heard of Philip Adler.\u003c/p\u003e\n\u003cp\u003e\"It sounds wonderful,\" Lara said.\u003c/p\u003e\n\u003cp\u003e\"Good. We\u0027ll have supper afterward at Scotts. I\u0027ll pick you up at seven.\"\u003c/p\u003e\n\u003cp\u003eWhy did I say I liked classical music? Lara wondered. It was going to be a boring evening. She would have preferred to take a hot bath and go to sleep. Oh, well, one more evening won\u0027t hurt me. I\u0027ll fly back to New York in the morning.\u003c/p\u003e\n\u003cp\u003eThe Festival Hall was crowded with music aficionados. The men wore dinner jackets and the women were dressed in beautiful evening gowns. It was a gala evening, and there was a feeling of excited expectation in the large hall.\u003c/p\u003e\n\u003cp\u003eBrian Macintosh purchased two programs from the usher, and they were seated. He handed Lara a program. She barely glanced at it. The London Philharmonic Orchestra...Philip Adler playing Rachmaninoff\u0027s Piano Concerto No. 3 in D Minor, Opus 30.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got to call Howard and remind him about the revised estimates on the Fifth Avenue site.\u003c/p\u003e\n\u003cp\u003eThe conductor appeared onstage, and the audience applauded. Lara paid no attention. The contractor in Boston is moving too slowly. He needs a carrot. I\u0027ll tell Howard to offer him a bonus.\u003c/p\u003e\n\u003cp\u003eThere was another loud round of applause from the audience. A man was taking his place at the piano at center stage. The conductor gave a downbeat, and the music began.\u003c/p\u003e\n\u003cp\u003ePhilip Adler\u0027s fingers flashed across the keys.\u003c/p\u003e\n\u003cp\u003eA woman seated behind Lara said with a loud Texas accent, \"Isn\u0027t he fantastic? I told you, Agnes!\"\u003c/p\u003e\n\u003cp\u003eLara tried to concentrate again. The London deal is out. It\u0027s the wrong neighborhood, Lara thought. People aren\u0027t going to want to live there. Location. Location. Location. She thought about a project that had been brought to her, near Columbus Circle. Now that one could work.\u003c/p\u003e\n\u003cp\u003eThe woman behind Lara said, loudly, \"His expression...he\u0027s fabulous! He\u0027s one of the most...\"\u003c/p\u003e\n\u003cp\u003eLara tried to tune her out.\u003c/p\u003e\n\u003cp\u003eThe cost of an office building there would be approximately four hundred dollars per rentable square foot. If I can bring in the construction cost at one hundred fifty million, the land costs at one hundred twenty-five million, the soft costs...\u003c/p\u003e\n\u003cp\u003e\"My God!\" the woman behind Lara exclaimed.\u003c/p\u003e\n\u003cp\u003eLara was startled out of her reverie.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s so brilliant!\"\u003c/p\u003e\n\u003cp\u003eThere was a drumroll from the orchestra, and Philip Adler played four bars alone, and the orchestra began to play faster and faster. The drums began to beat...\u003c/p\u003e\n\u003cp\u003eThe woman could not contain herself. \"Listen to that! The music is going from piu vivo to piu mosso. Have you ever heard anything so exciting?\"\u003c/p\u003e\n\u003cp\u003eLara gritted her teeth.\u003c/p\u003e\n\u003cp\u003eThe minimum break-even should work out all right, she thought. The cost of the rentable square feet would be three hundred fifty million, the interest at ten percent would be thirty-five million, plus ten million in operating expenses...\u003c/p\u003e\n\u003cp\u003eThe tempo of the music was increasing, reverberating through the hall. The music came to a sudden climax and stopped, and the audience was on its feet, cheering. There were calls of \"bravo!\" The pianist had risen and was taking bows.\u003c/p\u003e\n\u003cp\u003eLara did not even bother to look up. Taxes would be about six, free rent concessions would come to two. We\u0027re talking about fifty-eight million.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s incredible, isn\u0027t he?\" Brian Macintosh said.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Lara was annoyed at having her thoughts interrupted again.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go backstage. Philip is a friend of mine.\"\u003c/p\u003e\n\u003cp\u003e\"I really don\u0027t...\"\u003c/p\u003e\n\u003cp\u003eHe took Lara\u0027s hand, and they were moving toward an exit.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad I\u0027ll have a chance to introduce you to him,\" Brian Macintosh said.\u003c/p\u003e\n\u003cp\u003eIt\u0027s six o\u0027clock in New York, Lara thought. I\u0027ll be able to call Howard and tell him to start negotiations.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a once-in-a-lifetime experience, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003eOnce is enough for me, Lara thought. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eThey had reached the outside artists\u0027 entrance. There was a large crowd waiting. Brian Macintosh knocked on the door. A doorman opened it.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir?\"\u003c/p\u003e\n\u003cp\u003e\"Lord Macintosh to see Mr. Adler.\"\u003c/p\u003e\n\u003cp\u003e\"Right, my lord. Come in, please.\" He opened the door wide enough to let Brian Macintosh and Lara enter, then closed it against the crowd.\u003c/p\u003e\n\u003cp\u003e\"What do all these people want?\" Lara asked.\u003c/p\u003e\n\u003cp\u003eHe looked at her in surprise. \"They\u0027re here to see Philip.\"\u003c/p\u003e\n\u003cp\u003eShe wondered why.\u003c/p\u003e\n\u003cp\u003eThe doorman said, \"Go right into the greenroom, my lord.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eFive minutes, Lara thought, and I\u0027ll say I have to leave.\u003c/p\u003e\n\u003cp\u003eThe greenroom was noisy and already full. People were crowded around a figure Lara could not see. The crowd shifted, and for an instant he was clearly visible. Lara froze, and for a moment she felt her heart stop. The vague, evanescent image that had been at the back of her mind all those years had suddenly materialized out of nowhere. Lochinvar, the vision in her fantasies, had come to life! The man at the center of the crowd was tall and blond, with delicate, sensitive features. He was wearing white tie and tails, and a feeling of deja vu swept over Lara: She was standing at the kitchen sink in the boardinghouse, and the handsome young man in white tie and tails came up behind her and whispered, \"Can I help you?\"\u003c/p\u003e\n\u003cp\u003eBrian Macintosh was watching Lara, concerned. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"I...I\u0027m fine.\" She was finding it difficult to breathe. Philip Adler was moving toward them, smiling, and it was the same warm smile Lara had imagined. He held out his hand. \"Brian, how good of you to come.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t have missed it,\" Macintosh said. \"You were simply marvelous.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Philip, I would like you to meet Lara Cameron.\"\u003c/p\u003e\n\u003cp\u003eLara was looking into his eyes, and the words came out unbidden. \"Do you dry?\"\u003c/p\u003e\n\u003cp\u003e\"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003eLara turned red. \"Nothing. I...\" She was suddenly tongue-tied.\u003c/p\u003e\n\u003cp\u003ePeople were crowding around Philip Adler, heaping praise on him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve never played better...\"\u003c/p\u003e\n\u003cp\u003e\"I think Rachmaninoff was with you tonight...\"\u003c/p\u003e\n\u003cp\u003eThe praise went on and on. The women in the room were crowding around him, touching and pulling at him. Lara stood there watching, mesmerized. Her childhood dream had come true. Her fantasy had become flesh and blood.\u003c/p\u003e\n\u003cp\u003e\"Are you ready to go?\" Brian Macintosh asked Lara.\u003c/p\u003e\n\u003cp\u003eNo. She wanted nothing more than to stay. She wanted to talk to the vision again, to touch him, to make sure he was real. \"I\u0027m ready,\" Lara said reluctantly.\u003c/p\u003e\n\u003cp\u003eThe following morning Lara was on her way back to New York. She wondered whether she would ever see Philip Adler again.\u003c/p\u003e\n\u003cp\u003eShe was unable to get him out of her mind. She tried to tell herself that it was ridiculous, that she was trying to relive a childhood dream, but it was no use. She kept seeing his face, hearing his voice. I must see him again, Lara thought.\u003c/p\u003e\n\u003cp\u003eEarly the next morning Paul Martin telephoned.\u003c/p\u003e\n\u003cp\u003e\"Hi, baby. I missed you. How was London?\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" Lara said carefully. \"Just fine.\"\u003c/p\u003e\n\u003cp\u003eWhen they had finished talking, Lara sat at her desk thinking about Philip Adler.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re waiting for you in the conference room, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming.\"\u003c/p\u003e\n\u003cp\u003e\"We lost the Queens deal,\" Keller said.\u003c/p\u003e\n\u003cp\u003e\"Why? I thought it was all set.\"\u003c/p\u003e\n\u003cp\u003e\"So did I, but the community board refuses to support the zoning change.\"\u003c/p\u003e\n\u003cp\u003eLara looked around at the Executive Committee assembled in the room. There were architects, lawyers, publicity men, and construction engineers.\u003c/p\u003e\n\u003cp\u003eLara said, \"I don\u0027t understand. Those tenants have an average income of nine thousand dollars a year, and they\u0027re paying less than two hundred dollars a month in rent. We\u0027re going to rehabilitate the apartments for them, at no increase in rent, and we\u0027re going to provide new apartments for some of the other residents in the neighborhood. We\u0027re giving them Christmas in July and they turned you down? What\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not the board so much. It\u0027s their chairman. A lady named Edith Benson.\"\u003c/p\u003e\n\u003cp\u003e\"Set up another meeting with her. I\u0027ll go there myself.\"\u003c/p\u003e\n\u003cp\u003eLara took her chief construction supervisor, Bill Whitman, to the meeting.\u003c/p\u003e\n\u003cp\u003eLara said, \"Frankly, I was stunned when I heard that your board turned us down. We\u0027re going to put up over a hundred million dollars to improve this neighborhood, and yet you refuse to...\"\u003c/p\u003e\n\u003cp\u003eEdith Benson cut her short. \"Let\u0027s be honest, Miss Cameron. You\u0027re not putting up the money to improve the neighborhood. You\u0027re putting up the money so Cameron Enterprises can make more money.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, we expect to make money,\" Lara said. \"But the only way we can do that is to help you people. We\u0027re going to make the living conditions in your area better, and...\"\u003c/p\u003e\n\u003cp\u003e\"Sorry. I don\u0027t agree. Right now, we\u0027re a quiet little neighborhood. If we let you in, we\u0027re going to become a higherdensity area - more traffic, more automobiles, more pollution. We don\u0027t want any of that.\"\u003c/p\u003e\n\u003cp\u003e\"Neither do I,\" Lara said. \"We don\u0027t intend to put up dingbats that...\"\u003c/p\u003e\n\u003cp\u003e\"Dingbats?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, those ugly, stripped-down, three-story stucco boxes. We\u0027re interested in designs that won\u0027t increase the noise level or reduce the light or change the feel of the neighborhood. We\u0027re not interested in hot dog, show-off architecture. I\u0027ve already hired Stanton Fielding, the top architect in the country, to design this project, and Andrew Burton from Washington to do the landscaping.\"\u003c/p\u003e\n\u003cp\u003eEdith Benson shrugged. \"I\u0027m sorry. It\u0027s no use. I don\u0027t think there\u0027s anything more to discuss.\" She started to rise.\u003c/p\u003e\n\u003cp\u003eI can\u0027t lose this, Lara thought desperately. Can\u0027t they see it\u0027s for the good of their neighborhood? I\u0027m trying to do something for them and they won\u0027t let me. And suddenly she had a wild idea.\u003c/p\u003e\n\u003cp\u003e\"Wait a minute,\" Lara said. \"I understand that the other members of the board are willing to make the deal but you are the one blocking it.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s correct.\"\u003c/p\u003e\n\u003cp\u003eLara took a deep breath. \"There is something to discuss.\" She hesitated. \"It\u0027s very personal.\" She was fidgeting now. \"You say I\u0027m not worried about pollution and what happens to the environment in this neighborhood if we move in? I\u0027m going to tell you something that I hope you will keep in confidence. I have a ten-year-old daughter that I\u0027m crazy about, and she\u0027s going to live in the new building with her father. He has custody of her.\"\u003c/p\u003e\n\u003cp\u003eEdith Benson was looking at her in surprise. \"I...I didn\u0027t know you had a daughter.\"\u003c/p\u003e\n\u003cp\u003e\"No one does,\" Lara said quietly. \"I\u0027ve never been married. That\u0027s why I\u0027m asking you to keep this confidential. If it gets out, it could be very damaging to me. I\u0027m sure you understand that.\"\u003c/p\u003e\n\u003cp\u003e\"I do understand.\"\u003c/p\u003e\n\u003cp\u003e\"I love my daughter very much, and I assure you that I would never do anything in the world that would hurt her. I intend to do everything I can to make this project wonderful for all the people who live here. And she\u0027ll be one of them.\"\u003c/p\u003e\n\u003cp\u003eThere was a sympathetic silence. \"I must say, this...this puts quite a different complexion on things, Miss Cameron. I\u0027d like to have some time to think about it.\" \"Thank you. I appreciate that.\" If I did have a daughter, Lara thought, it would be safe for her to live here.\u003c/p\u003e\n\u003cp\u003eThree weeks later Lara got the approval from the City Planning Commission to go ahead with the project.\u003c/p\u003e\n\u003cp\u003e\"Great,\" Lara said. \"Now we\u0027d better get hold of Stanton Fielding and Andrew Burton and see if they\u0027re interested in working on the project.\"\u003c/p\u003e\n\u003cp\u003eHoward Keller could not believe the news. \"I heard what happened,\" he said. \"You conned her! That\u0027s incredible. You don\u0027t have a daughter!\"\u003c/p\u003e\n\u003cp\u003e\"They need this project,\" Lara said. \"This was the only way I could think of to change their minds.\"\u003c/p\u003e\n\u003cp\u003eBill Whitman was listening. \"There\u0027ll be hell to pay if they ever find out.\"\u003c/p\u003e\n\u003cp\u003eIn January construction was completed on a new building on East Sixty-third Street. It was a forty-five-story apartment building, and Lara reserved the duplex penthouse for herself. The rooms were large, and the apartment had terraces that covered a full block. She brought in a top decorator to do the apartment. There was a housewarming for a hundred people.\u003c/p\u003e\n\u003cp\u003e\"All it lacks is a man,\" one of the lady guests said cattily.\u003c/p\u003e\n\u003cp\u003eAnd Lara thought of Philip Adler and wondered where he was and what he was doing.\u003c/p\u003e\n\u003cp\u003eLara and Howard Keller were in the middle of a discussion when Bill Whitman came into the office.\u003c/p\u003e\n\u003cp\u003e\"Hi, boss. Got a minute?\"\u003c/p\u003e\n\u003cp\u003eLara looked up from her desk. \"Just about, Bill. What\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003e\"My wife.\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re having marital difficulties...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that. She thinks we ought to go away for a while on vacation. Maybe go to Paris for a few weeks.\" Lara frowned. \"Paris? We\u0027re in the middle of half a dozen jobs.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but I\u0027ve been working long hours lately, and I don\u0027t get to see much of my wife. You know what she said to me this morning? She said, \u0027Bill, if you got a promotion and a nice raise, you wouldn\u0027t have to work so hard.\u0027\" He smiled.\u003c/p\u003e\n\u003cp\u003eLara sat back in her chair, studying him. \"You aren\u0027t due for a raise until next year.\"\u003c/p\u003e\n\u003cp\u003eWhitman shrugged. \"Who knows what can happen in a year? We might run into problems with that Queens deal, for instance. You know, old Edith Benson might hear something that would make her change her mind. Right?\"\u003c/p\u003e\n\u003cp\u003eLara sat very still. \"I see.\"\u003c/p\u003e\n\u003cp\u003eBill Whitman got to his feet. \"Think about it, and let me know.\"\u003c/p\u003e\n\u003cp\u003eLara forced a smile. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe watched him walk out of her office, her face grim.\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" Keller said. \"What was that all about?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s called blackmail.\"\u003c/p\u003e\n\u003cp\u003eThe following day Lara had lunch with Paul Martin.\u003c/p\u003e\n\u003cp\u003eLara said, \"Paul, I have a problem. I\u0027m not sure how to handle it.\" She told him about her conversation with Bill Whitman.\u003c/p\u003e\n\u003cp\u003e\"Do you think he\u0027ll really go back to the old lady?\" Paul Martin asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. But if he does, I could get in a lot of trouble with the Housing Commission.\"\u003c/p\u003e\n\u003cp\u003ePaul shrugged. \"I wouldn\u0027t worry about him. He\u0027s probably bluffing.\"\u003c/p\u003e\n\u003cp\u003eLara sighed. \"I hope so.\"\u003c/p\u003e\n\u003cp\u003e\"How would you like to go to Reno?\" Paul asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to, but I can\u0027t get away.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not asking you to get away. I\u0027m asking if you\u0027d like to buy a hotel and casino there.\"\u003c/p\u003e\n\u003cp\u003eLara studied him. \"Are you serious?\"\u003c/p\u003e\n\u003cp\u003e\"I got word that one of the hotels is going to lose its license. The place is a gold mine. When the news gets out, everyone is going to be after it. The hotel\u0027s going on auction, but I think I can fix it for you to get it.\"\u003c/p\u003e\n\u003cp\u003eLara hesitated. \"I don\u0027t know. I\u0027m pretty heavily committed. Howard Keller says the banks won\u0027t lend me any more until I can pay off some loans.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to go to a bank.\"\u003c/p\u003e\n\u003cp\u003e\"Then where...?\"\u003c/p\u003e\n\u003cp\u003e\"Junk bonds. A lot of Wall Street firms offer them. There are savings and loan companies. You put up five percent equity, and a savings and loan company will put up sixtyfive percent in high-yield notes. That leaves thirty percent uncovered. You can get that from a foreign bank that invests in casinos. You\u0027ve got choices - Switzerland, Germany, Japan. There are half a dozen banks that will put up the thirty percent in commercial notes.\"\u003c/p\u003e\n\u003cp\u003eLara was beginning to get excited. \"It sounds great. Do you really think you can get the hotel for me?\"\u003c/p\u003e\n\u003cp\u003ePaul grinned. \"It will be your Christmas present.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wonderful. Why are you so good to me?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t the vaguest idea,\" he teased. But he knew the answer. He was obsessed with her. Lara made him feel young again, and she made everything exciting for him. I never want to lose you, he thought.\u003c/p\u003e\n\u003cp\u003eKeller was waiting for Lara when she walked into the office.\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" he asked. \"There was a two o\u0027clock meeting that...\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about junk bonds, Howard. We\u0027ve never dealt with them. How are bonds rated?\"\u003c/p\u003e\n\u003cp\u003e\"Well, at the top you have Triple A. That would be a company like AT and T. Down the ladder you have Double A, Single A, BAA, and at the bottom of the ladder, Double B - those are the junk bonds. An investment bond will pay nine percent. A junk bond will pay fourteen percent. Why do you ask?\"\u003c/p\u003e\n\u003cp\u003eLara told him.\u003c/p\u003e\n\u003cp\u003e\"A casino, Lara? Jesus! Paul Martin is behind this, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"No, Howard. If I go ahead with this, I\u0027m behind it. Did we get an answer on our offer on the Battery Park property?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. She won\u0027t sell to us.\"\u003c/p\u003e\n\u003cp\u003e\"The property is up for sale, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"In a way.\"\u003c/p\u003e\n\u003cp\u003e\"Stop talking in circles.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s owned by a doctor\u0027s widow, Eleanor Royce. Every real estate developer in town has been bidding on that property.\"\u003c/p\u003e\n\u003cp\u003e\"Have we been outbid?\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t that. The old lady isn\u0027t interested in money. She\u0027s loaded.\"\u003c/p\u003e\n\u003cp\u003e\"What is she interested in?\"\u003c/p\u003e\n\u003cp\u003e\"She wants some kind of monument to her husband. Apparently she thinks she was married to Albert Schweitzer. She wants to keep his flame burning. She doesn\u0027t want her property turned into anything crass or commercial. I hear Steve Murchison has been trying to talk her into settling.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003eLara sat there quietly for a full minute. When she spoke, she said, \"Who\u0027s your doctor, Howard?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s your doctor?\"\u003c/p\u003e\n\u003cp\u003e\"Seymour Bennett. He\u0027s chief of staff at Midtown Hospital.\"\u003c/p\u003e\n\u003cp\u003eThe following morning Lara\u0027s attorney, Terry Hill, was sitting in the office of Dr. Seymour Bennett.\u003c/p\u003e\n\u003cp\u003e\"My secretary told me that you wanted to see me urgently and that it has nothing to do with a medical problem.\"\u003c/p\u003e\n\u003cp\u003e\"In a sense,\" Terry Hill said, \"it does concern a medical problem, Dr. Bennett. I represent an investment group that wants to put up a nonprofit clinic. We want to be able to take care of those unfortunate people who can\u0027t afford regular medical care.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a splendid idea,\" Dr. Bennett said. \"What can I do to help you?\"\u003c/p\u003e\n\u003cp\u003eTerry Hill told him.\u003c/p\u003e\n\u003cp\u003eThe following day Dr. Bennett was having tea in the home of Eleanor Royce.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve asked me to approach you on behalf of this group, Mrs. Royce. They want to build a beautiful clinic, and they want to name it after your late husband. They visualize it as sort of a shrine to him.\"\u003c/p\u003e\n\u003cp\u003eMrs. Royce\u0027s face lit up. \"They do?\"\u003c/p\u003e\n\u003cp\u003eThey discussed the group\u0027s plans for an hour, and the end of that time Mrs. Royce said, \"George would have loved this. You tell them that they have a deal.\"\u003c/p\u003e\n\u003cp\u003eConstruction began six months later. When it was completed, it was gigantic. The entire square block was filled with huge apartment buildings, an enormous shopping mall, and a theater complex. In a remote corner of the property was a small one-story brick building. A simple sign over the door read: GEORGE ROYCE MEDICAL CLINIC. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stars-shine-down/page-17.html","bookId":2364,"creation":"Oct 5, 2019 10:10:56 AM","modification":"Oct 5, 2019 10:10:56 AM"}
