{"id":68806,"no":19,"title":"Page 19","content":"\u003cp\u003eThe ballroom at the Waldorf-Astoria was crowded with patrons of Carnegie Hall. Lara moved through the crowd, looking for Philip. She recalled the telephone conversation they had had a few days earlier.\u003c/p\u003e\n\u003cp\u003e\"Miss Cameron, this is Philip Adler.\"\u003c/p\u003e\n\u003cp\u003eHer throat went suddenly dry.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I wasn\u0027t able to thank you earlier for the donation you made to the foundation. I\u0027ve just returned from Europe and learned about it.\"\u003c/p\u003e\n\u003cp\u003e\"It was my pleasure,\" Lara said. She had to keep him talking. \"As...as a matter of fact, I\u0027m interested in knowing more about the foundation. Perhaps we could get together and discuss it.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. \"There\u0027s going to be a charity dinner at the Waldorf Saturday evening. We could meet there. Are you free?\"\u003c/p\u003e\n\u003cp\u003eLara quickly glanced at her schedule. She had a dinner meeting that evening with a banker from Texas.\u003c/p\u003e\n\u003cp\u003eShe made a quick decision. \"Yes. I\u0027d be delighted to go.\"\u003c/p\u003e\n\u003cp\u003e\"Wonderful. There will be a ticket at the door for you.\"\u003c/p\u003e\n\u003cp\u003eWhen Lara replaced the receiver, she was beaming.\u003c/p\u003e\n\u003cp\u003ePhilip Adler was nowhere in sight. Lara moved through the huge ballroom, listening to the conversations around her.\u003c/p\u003e\n\u003cp\u003e\"...so the leading tenor said, \u0027Dr. Klemperer, I have only two high C\u0027s left. Do you want to hear them now or tonight at the performance?\u0027...\u0027\u003c/p\u003e\n\u003cp\u003e\"...oh, I admit that he has a good stick. His dynamics and tonal shadings are excellent...but the tempi! Tempi! Spare me!...\"\u003c/p\u003e\n\u003cp\u003e\"...you\u0027re insane! Stravinsky is too structured. His music could have been written by a robot. He holds back his feelings. Bartok, on the other hand, lets loose the floodgates, and we\u0027re bathed in emotions...\"\u003c/p\u003e\n\u003cp\u003e\"...I simply can\u0027t stand her playing. Her Chopin is an exercise in tortured rubato, butchered textures, and purple passion...\"\u003c/p\u003e\n\u003cp\u003eIt was an arcane language that was beyond Lara\u0027s comprehension. And then she saw Philip, surrounded by an admiring coterie. Lara pushed her way through the crowd. An attractive young woman was saying, \"When you played the B flat Minor Sonata, I felt that Rachmaninoff was smiling. Your tone and voicing, and the soft-grained readings...Wonderful!\"\u003c/p\u003e\n\u003cp\u003ePhilip smiled. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eA middle-aged dowager was gushing, \"I keep listening to your recording of the Hammerklavier over and over. My God! The vitality is irresistible! I think you must be the only pianist left in this world who really understands that Beethoven sonata...\"\u003c/p\u003e\n\u003cp\u003ePhilip saw Lara. \"Ah. Excuse me,\" he said.\u003c/p\u003e\n\u003cp\u003eHe made his way over to where she was standing and took her hand. His touch aroused her. \"Hello. I\u0027m glad you could come, Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" She looked around. \"This is quite a crowd.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Yes. I assume that you\u0027re a lover of classical music?\"\u003c/p\u003e\n\u003cp\u003eLara thought of the music she had grown up with: \"Annie Laurie,\" \"Comin\u0027 through the Rye,\" \"The Hills of Home\"...\"\u003c/p\u003e\n\u003cp\u003eOh, yes,\" Lara said. \"My father brought me up on classical music.\"\u003c/p\u003e\n\u003cp\u003e\"I want to thank you again for your contribution. That was really very generous.\"\u003c/p\u003e\n\u003cp\u003e\"Your foundation sounds so interesting. I would love to hear more about it. If...\"\u003c/p\u003e\n\u003cp\u003e\"Philip, darling! There are no words! Magnificent!\" He was surrounded again.\u003c/p\u003e\n\u003cp\u003eLara managed to make herself heard. \"If you\u0027re free one evening next week...\"\u003c/p\u003e\n\u003cp\u003ePhilip shook his head. \"I\u0027m sorry, I leave for Rome tomorrow.\"\u003c/p\u003e\n\u003cp\u003eLara felt a sudden sense of loss. \"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027ll be back in three weeks. Perhaps then we could...\"\u003c/p\u003e\n\u003cp\u003e\"Wonderful!\" Lara said.\u003c/p\u003e\n\u003cp\u003e\"...spend an evening discussing music.\"\u003c/p\u003e\n\u003cp\u003eLara smiled. \"Yes. I\u0027ll look forward to that.\"\u003c/p\u003e\n\u003cp\u003eAt that moment they were interrupted by two middle-aged men. One wore his hair in a ponytail; the other had on a single earring.\u003c/p\u003e\n\u003cp\u003e\"Philip! You must settle an argument for us. When you\u0027re playing Liszt, which do you think is more important - a piano with heavy action that gives you a colorful sound or light action where you can do a colorful manipulation?\"\u003c/p\u003e\n\u003cp\u003eLara had no idea what they were talking about. They went off into a discussion about neutral sonority and long sounds and transparency. Lara watched the animation in Philip\u0027s face as he talked, and she thought, This is his world. I\u0027ve got to find a way to get into it.\u003c/p\u003e\n\u003cp\u003eThe following morning Lara appeared at the Manhattan School of Music. She said to the woman at the reception desk, \"I\u0027d like to see one of the music professors, please.\"\u003c/p\u003e\n\u003cp\u003e\"Anyone in particular?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Just a moment, please.\" She disappeared into another room.\u003c/p\u003e\n\u003cp\u003eA few minutes later a small gray-haired man appeared at Lara\u0027s side.\u003c/p\u003e\n\u003cp\u003e\"Good morning. I\u0027m Leonard Meyers. How may I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m interested in classical music.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, you wish to enroll here. What instrument do you play?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t play any instrument. I just want to learn about classical music.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid you\u0027ve come to the wrong place. This school is not for beginners.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pay you five thousand dollars for two weeks of your time.\"\u003c/p\u003e\n\u003cp\u003eProfessor Meyers blinked. \"I\u0027m sorry, Miss...I didn\u0027t get your name.\"\u003c/p\u003e\n\u003cp\u003e\"Cameron. Lara Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"You wish to pay me five thousand dollars for a two-week discussion of classical music?\" He had trouble getting the words out.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. You can use the money for a scholarship fund if you wish.\"\u003c/p\u003e\n\u003cp\u003eProfessor Meyers lowered his voice. \"That will not be necessary. This can just be between you and me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s fine.\"\u003c/p\u003e\n\u003cp\u003e\"When...er...would you like to begin?\"\u003c/p\u003e\n\u003cp\u003e\"Now.\"\u003c/p\u003e\n\u003cp\u003e\"I have a class at the moment, but give me five minutes...\"\u003c/p\u003e\n\u003cp\u003eLara and Professor Meyers were seated in a classroom alone.\u003c/p\u003e\n\u003cp\u003e\"Let us start at the beginning. Do you know anything about classical music?\"\u003c/p\u003e\n\u003cp\u003e\"Very little.\"\u003c/p\u003e\n\u003cp\u003e\"I see. Well, there are two ways to understand music,\" the professor began. \"Intellectually and emotionally. Someone once said that music reveals to man his hidden soul. Every great composer was able to accomplish that.\"\u003c/p\u003e\n\u003cp\u003eLara was listening intently.\u003c/p\u003e\n\u003cp\u003e\"Are you familiar with any composers, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Not too many.\"\u003c/p\u003e\n\u003cp\u003eThe professor frowned. \"I don\u0027t really understand your interest in...\"\u003c/p\u003e\n\u003cp\u003e\"I want to get enough of a background so that I can talk intelligently to a professional musician about the classics. I\u0027m...particularly interested in piano music.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" Meyers thought for a moment. \"I\u0027ll tell you how we\u0027re going to begin. I\u0027m going to give you some CDs to play.\"\u003c/p\u003e\n\u003cp\u003eLara watched him walk over to a shelf and pull down some compact discs.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll start with these. I want you to listen carefully to the allegro in Mozart\u0027s Piano Concerto No. Twenty-one in C, Kochel 467, and the adagio in Brahms Piano Concerto No. One, and the moderato in Rachmaninoff\u0027s Piano Concerto No. Two in C Minor, Opus Eighteen, and finally, the romanze in Chopin\u0027s Piano Concerto No. One. They\u0027re all marked.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"If you would like to play these and come back in a few days...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back tomorrow.\"\u003c/p\u003e\n\u003cp\u003eThe following day, when Lara came in, she was carrying half a dozen CDs of Philip Adler\u0027s concerts and recitals.\u003c/p\u003e\n\u003cp\u003e\"Ah, splendid!\" Professor Meyers said. \"Maestro Adler is the best. You are particularly interested in his playing?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"The maestro has recorded many beautiful sonatas.\"\u003c/p\u003e\n\u003cp\u003e\"Sonatas?\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"You don\u0027t know what a sonata is?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"A sonata is a piece, usually in several movements, that has a certain basic musical form. And when that form is used in a piece for a solo instrument, like a piano or violin, the piece is called a sonata. A symphony is a sonata for orchestra.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\" That shouldn\u0027t be difficult to work into a conversation.\u003c/p\u003e\n\u003cp\u003e\"The piano was originally known as the pianoforte. That is Italian for \u0027soft-loud\u0027...\"\u003c/p\u003e\n\u003cp\u003eThey spent the next few days discussing tapes that Philip had recorded - Beethoven, Liszt, Bartok, Mozart, Chopin.\u003c/p\u003e\n\u003cp\u003eLara listened, and absorbed, and remembered.\u003c/p\u003e\n\u003cp\u003e\"He likes Liszt. Tell me about him.\"\u003c/p\u003e\n\u003cp\u003e\"Franz Liszt was a boy genius. Everyone admired him. He was brilliant. He was treated like a pet by the aristocracy, and he finally complained that he had become on par with a juggler or a performing dog....\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about Beethoven.\"\u003c/p\u003e\n\u003cp\u003e\"A difficult man. He was such an unhappy person that in the middle of his great success he decided he didn\u0027t like the work that he had done, and he changed to longer and more emotional compositions, like the Eroica and the Pastoral....\"\u003c/p\u003e\n\u003cp\u003e\"Chopin?\"\u003c/p\u003e\n\u003cp\u003e\"Chopin was criticized for writing music for the piano, so the critics of his day called him limited...\"\u003c/p\u003e\n\u003cp\u003eLater: \"Liszt could play Chopin better than Chopin could...\"\u003c/p\u003e\n\u003cp\u003eAnother day: \"There\u0027s a difference between French pianists and American pianists. The French like clarity and elegance. Traditionally, their technical schooling is grounded in jeu perle - perfectly pearly evenness of articulation with a steady wrist...\"\u003c/p\u003e\n\u003cp\u003eEach day they played one of Philip\u0027s recordings and discussed it. At the end of the two weeks Professor Meyers said, \"I must confess that I\u0027m impressed, Miss Cameron. You are a truly dedicated pupil. Perhaps you should take up an instrument.\"\u003c/p\u003e\n\u003cp\u003eLara laughed. \"Let\u0027s not get carried away.\" She handed him a check. \"Here you are.\"\u003c/p\u003e\n\u003cp\u003eShe could not wait for Philip to return to New York. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stars-shine-down/page-19.html","bookId":2364,"creation":"Oct 5, 2019 10:10:56 AM","modification":"Oct 5, 2019 10:10:56 AM"}
