{"id":68811,"no":24,"title":"Page 24","content":"\u003cp\u003eThe marriage of Lara Cameron to Philip Adler made headlines around the world. When Howard Keller heard the news, he went out and got drunk for the first time in his life. He had kept telling himself that Lara\u0027s infatuation with Philip Adler would pass. Lara and I are a team. We belong together. No one can come between us. He stayed drunk for two days, and when he sobered up, he telephoned Lara in Paris.\u003c/p\u003e\n\u003cp\u003e\"If it\u0027s true,\" he said, \"tell Philip I said he\u0027s the luckiest man who ever lived.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true,\" Lara assured him brightly.\u003c/p\u003e\n\u003cp\u003e\"You sound happy.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been happier in my life!\"\u003c/p\u003e\n\u003cp\u003e\"I...I\u0027m pleased for you, Lara. When are you coming home?\"\u003c/p\u003e\n\u003cp\u003e\"Philip is giving a concert in London tomorrow, and then we\u0027ll be back in New York.\"\u003c/p\u003e\n\u003cp\u003e\"Did you talk to Paul Martin before the wedding?\"\u003c/p\u003e\n\u003cp\u003eShe hesitated. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you think you should do it now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course.\" She had been more concerned about that than she wanted to admit to herself. She was not sure how he was going to take the news of her marriage. \"I\u0027ll talk to him when I get back.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll sure be glad to see you. I miss you.\"\u003c/p\u003e\n\u003cp\u003e\"I miss you, too, Howard.\" And it was true. He was very dear. He had always been a good and loyal friend. I don\u0027t know what I would have done without him, Lara thought.\u003c/p\u003e\n\u003cp\u003eWhen the 727 taxied up to the Butler Aviation Terminal at New York\u0027s La Guardia Airport, the press was there in full force. There were newspaper reporters and television cameras.\u003c/p\u003e\n\u003cp\u003eThe airport manager led Lara and Philip into the reception office. \"I can sneak you out of here,\" he said, \"or...\"\u003c/p\u003e\n\u003cp\u003eLara turned to Philip. \"Let\u0027s get this over with, darling. Otherwise, they\u0027ll never let us have any peace.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re probably right.\"\u003c/p\u003e\n\u003cp\u003eThe press conference lasted for two hours. \"Where did you two meet...?\"\u003c/p\u003e\n\u003cp\u003e\"Have you always been interested in classical music, Mrs. Adler...?\"\u003c/p\u003e\n\u003cp\u003e\"How long have you known each other...?\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to live in New York...?\"\u003c/p\u003e\n\u003cp\u003e\"Will you give up your touring, Mr. Adler...?\"\u003c/p\u003e\n\u003cp\u003eFinally, it was over.\u003c/p\u003e\n\u003cp\u003eThere were two limousines waiting for them. The second one was for luggage.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not used to traveling in this kind of style,\" Philip said.\u003c/p\u003e\n\u003cp\u003eLara laughed. \"You\u0027ll get used to it.\"\u003c/p\u003e\n\u003cp\u003eWhen they were in the limousine, Philip asked, \"Where are we going? I have an apartment on Fifty-seventh Street...\"\u003c/p\u003e\n\u003cp\u003e\"I think you might be more comfortable at my place, darling. Look it over, and if you like it, we\u0027ll have your things moved in.\"\u003c/p\u003e\n\u003cp\u003eThey arrived at the Cameron Plaza. Philip looked up at the huge building.\u003c/p\u003e\n\u003cp\u003e\"You own this?\"\u003c/p\u003e\n\u003cp\u003e\"A few banks and I.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m impressed.\"\u003c/p\u003e\n\u003cp\u003eLara squeezed his arm. \"Good. I want you to be.\"\u003c/p\u003e\n\u003cp\u003eThe lobby had been freshly decorated with flowers. A half dozen employees were waiting to greet them.\u003c/p\u003e\n\u003cp\u003e\"Welcome home, Mrs. Adler, Mr. Adler.\"\u003c/p\u003e\n\u003cp\u003ePhilip looked around and said, \"My God! All this is yours?\"\u003c/p\u003e\n\u003cp\u003e\"Ours, sweetheart.\"\u003c/p\u003e\n\u003cp\u003eThe elevator took them up to the penthouse. It covered the whole forty-fifth floor. The door was opened by the butler.\u003c/p\u003e\n\u003cp\u003e\"Welcome home, Mrs. Adler.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Simms.\"\u003c/p\u003e\n\u003cp\u003eLara introduced Philip to the rest of the staff and showed him through the duplex penthouse. There was a large white drawing room, filled with antiques, a large enclosed terrace, a dining room, four master bedrooms and three staff bedrooms, six bathrooms, a kitchen, a library, and an office.\u003c/p\u003e\n\u003cp\u003e\"Do you think you could be comfortable here, darling?\" Lara asked.\u003c/p\u003e\n\u003cp\u003ePhilip grinned. \"It\u0027s a little small - but I\u0027ll manage.\"\u003c/p\u003e\n\u003cp\u003eIn the middle of the drawing room was a beautiful new Bechstein piano. Philip walked over to it and ran his fingers over the keys.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s wonderful!\" he said.\u003c/p\u003e\n\u003cp\u003eLara moved to his side. \"It\u0027s your wedding present.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" He was touched. He sat down at the piano and began to play.\u003c/p\u003e\n\u003cp\u003e\"I just had it tuned for you.\" Lara listened as the cascade of notes filled the room. \"Do you like it?\"\u003c/p\u003e\n\u003cp\u003e\"I love it! Thank you, Lara.\"\u003c/p\u003e\n\u003cp\u003e\"You can play here to your heart\u0027s content.\"\u003c/p\u003e\n\u003cp\u003ePhilip rose from the piano bench. \"I\u0027d better give Ellerbee a call,\" Philip said. \"He\u0027s been trying to reach me.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a telephone in the library, darling.\"\u003c/p\u003e\n\u003cp\u003eLara went into her office and turned on the answering machine. There were half a dozen messages from Paul Martin. \"Lara, where are you? I miss you, darling\"...\"Lara, I assume you\u0027re out of the country, or I would have heard from you\"...\"I\u0027m worried about you, Lara. Call me...\" Then the tone changed. \"I just heard about your marriage. Is it true? Let\u0027s talk.\"\u003c/p\u003e\n\u003cp\u003ePhilip had walked into the room. \"Who\u0027s the mysterious caller?\" he asked.\u003c/p\u003e\n\u003cp\u003eLara turned. \"An...an old friend of mine.\"\u003c/p\u003e\n\u003cp\u003ePhilip walked up to her and put his arms around her.\u003c/p\u003e\n\u003cp\u003e\"Is he someone I should be jealous of?\"\u003c/p\u003e\n\u003cp\u003eLara said softly, \"You don\u0027t have to be jealous of anyone in the world. You\u0027re the only man I\u0027ve ever loved.\" And it\u0027s true.\u003c/p\u003e\n\u003cp\u003ePhilip held her closely. \"You\u0027re the only woman I\u0027ve ever loved.\"\u003c/p\u003e\n\u003cp\u003eLater that afternoon, while Philip sat at the piano, Lara went back into her office and returned Paul Martin\u0027s telephone calls.\u003c/p\u003e\n\u003cp\u003eHe came on the line almost immediately. \"You\u0027re back.\" His voice was tight.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She had been dreading this conversation.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind telling you that the news was quite a shock, Lara.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Paul...I...it happened rather suddenly.\"\u003c/p\u003e\n\u003cp\u003e\"It must have.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She tried to read his mood.\u003c/p\u003e\n\u003cp\u003e\"I thought we had something pretty good going for us. I thought it was something special.\"\u003c/p\u003e\n\u003cp\u003e\"It was, Paul, but...\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027d better talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I...\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s make it lunch tomorrow. Vitello\u0027s. One o\u0027clock.\" It was an order.\u003c/p\u003e\n\u003cp\u003eLara hesitated. It would be foolish to antagonize him any further. \"All right, Paul. I\u0027ll be there.\"\u003c/p\u003e\n\u003cp\u003eThe line went dead. Lara sat there worried. How angry was Paul, and was he going to do anything about it? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stars-shine-down/page-24.html","bookId":2364,"creation":"Oct 5, 2019 10:10:56 AM","modification":"Oct 5, 2019 10:10:56 AM"}
