{"id":68794,"no":7,"title":"Page 7","content":"\u003cp\u003eChicago was a revelation. Halifax had been the largest city Lara had ever seen, but it was like a hamlet compared to the giant of the Midwest. Chicago was a loud and noisy city, bustling and energetic, and everyone seemed to be hurrying to some important destination.\u003c/p\u003e\n\u003cp\u003eLara checked into the Stevens Hotel. She took one look at the smartly dressed women walking through the lobby and became self-conscious about the clothes she was wearing. Glace Bay, yes, Lara thought. Chicago, no. The following morning, Lara went into action. She visited Kane\u0027s and Ultimo for designer dresses, Joseph\u0027s for shoes, Saks Fifth Avenue and Marshall Field\u0027s for lingerie, Trabert and Hoeffer for jewelry, and Ware for a mink coat. And every time she bought something, she heard her father\u0027s voice saying, \"I\u0027m nae made of money. Get yourself something frae the Salvation Army Citadel.\" Before her shopping spree was over, the closets in her hotel suite were filled with beautiful clothes.\u003c/p\u003e\n\u003cp\u003eLara\u0027s next move was to look in the yellow pages of the telephone book under \"Real Estate Brokers.\" She selected the one that had the largest advertisement, Parker \u0026amp; Associates. Lara telephoned and asked to speak to Mr. Parker.\u003c/p\u003e\n\u003cp\u003e\"May I tell him who\u0027s calling?\"\u003c/p\u003e\n\u003cp\u003e\"Lara Cameron.\"\u003c/p\u003e\n\u003cp\u003eA moment later a voice said, \"Bruce Parker speaking. How can I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking for a location where I can put up a beautiful new hotel,\" Lara said.\u003c/p\u003e\n\u003cp\u003eThe voice at the other end of the phone grew warmer. \"Well, we\u0027re experts at that, Mrs. Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"Miss Cameron.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Did you have any particular area in mind?\"\u003c/p\u003e\n\u003cp\u003e\"No. To tell you the truth, I\u0027m not really familiar with Chicago.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s no problem. I\u0027m sure we can line up some very interesting properties for you. Just to give me an idea of what we\u0027re looking for, how much equity do you have?\"\u003c/p\u003e\n\u003cp\u003eLara said proudly, \"Three million dollars.\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence. \"Three million dollars?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And you want to build a beautiful new hotel?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eAnother silence.\u003c/p\u003e\n\u003cp\u003e\"Were you interested in building or acquiring something in the inner city area, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Lara said. \"What I have in mind is exactly the opposite. I want to build an exclusive boutique hotel in a nice area that...\"\u003c/p\u003e\n\u003cp\u003e\"With an equity of three million dollars?\" Parker chuckled. \"I\u0027 m afraid we\u0027re not going to be able to help you.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" Lara said. She replaced the receiver. She had obviously called the wrong broker.\u003c/p\u003e\n\u003cp\u003eShe went back to the yellow pages again and made half a dozen more calls. By the end of the afternoon Lara was forced to face reality. None of the brokers was interested in trying to find a prime location where she could build a hotel with a down payment of three million dollars. They had offered Lara a variety of suggestions, and they had all come down to the same thing: a cheap hotel in an inner city area.\u003c/p\u003e\n\u003cp\u003eNever, Lara thought. I\u0027ll go back to Glace Bay first.\u003c/p\u003e\n\u003cp\u003eShe had dreamed for months about the hotel she wanted to build, and in her mind it was already a reality - beautiful, vivid, three-dimensional. Her plan was to turn a hotel into a real home away from home. It would have mostly suites, and each suite would have a living room and a library with a fireplace in each room, and be furnished with comfortable couches, easy chairs, and a grand piano. There would be two large bedrooms and an outside terrace running the length of the apartment. There would be a Jacuzzi and a minibar. Lara knew exactly what she wanted. The question was how she was going to get it.\u003c/p\u003e\n\u003cp\u003eLara walked into a printshop on Lake Street. \"I would like to have a hundred business cards printed up, please.\"\u003c/p\u003e\n\u003cp\u003e\"Certainly. And how will the cards read?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Miss Lara Cameron,\u0027 and at the bottom, \u0027Real Estate Developer.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Yes, Miss Cameron. I can have them for you in two days.\"\u003c/p\u003e\n\u003cp\u003e\"No. I would like them this afternoon, please.\"\u003c/p\u003e\n\u003cp\u003eThe next step was to get acquainted with the city.\u003c/p\u003e\n\u003cp\u003eLara walked along Michigan Avenue and State Street and La Salle, strolled along Lake Shore Drive and wandered through Lincoln Park with its zoo and golf course and lagoon. She visited the Merchandise Mart and went to Kroch-Brentano\u0027s and bought books about Chicago. She read about the famous who had made Chicago their home: Carl Sandburg, Frank Lloyd Wright, Louis Sullivan, Saul Bellow. She read about the pioneer families of Chicago - the John Bairds and Gaylord Donnelleys, the Marshall Fields and Potter Palmers, and Walgreens - and she passed by their homes on Lake Shore Drive and their huge estates in suburban Lake Forest. Lara visited the South Side, and she felt at home there because of all the ethnic groups: Swedes, Poles, Irish, Lithuanians. It reminded her of Glace Bay.\u003c/p\u003e\n\u003cp\u003eShe took to the streets again, looking at buildings with For Sale signs, and she went to see the listed brokers. \"What\u0027s the price of that building?\"\u003c/p\u003e\n\u003cp\u003e\"Eighty million dollars...\"\u003c/p\u003e\n\u003cp\u003e\"Sixty million dollars...\"\u003c/p\u003e\n\u003cp\u003e\" A hundred million dollars...\"\u003c/p\u003e\n\u003cp\u003eHer three million dollars was becoming more and more insignificant. Lara sat in her hotel room considering her options. Either she could go to one of the slum sections of the city and put up a little hotel there, or she could return home. Neither choice appealed to her.\u003c/p\u003e\n\u003cp\u003eI\u0027ve too much at stake to give up now, Lara thought.\u003c/p\u003e\n\u003cp\u003eThe following morning Lara stopped in at a bank on La Salle Street. She walked up to a clerk behind the counter. \"I would like to speak to your vice-president, please.\"\u003c/p\u003e\n\u003cp\u003eShe handed the clerk her card.\u003c/p\u003e\n\u003cp\u003eFive minutes later she was in the office of Tom Peterson, a flaccid middle-aged man, with a nervous tic. He was studying her card.\u003c/p\u003e\n\u003cp\u003e\"What can I do for you, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m planning to put up a hotel in Chicago. I\u0027ll need to borrow some money.\"\u003c/p\u003e\n\u003cp\u003eHe gave her a genial smile. \"That\u0027s what we\u0027re here for. What kind of hotel were you planning to build?\"\u003c/p\u003e\n\u003cp\u003e\"A beautiful boutique hotel in a nice area.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds interesting.\"\u003c/p\u003e\n\u003cp\u003e\"I have to tell you,\" Lara said, \"that I only have three million dollars to put down, and...\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"No problem.\"\u003c/p\u003e\n\u003cp\u003eShe felt a thrill of excitement. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Three million can go a long way if you know what to do with it.\" He looked at his watch. \"I have another appointment now. I wonder if we could get together for dinner tonight and talk about this.\"\u003c/p\u003e\n\u003cp\u003e\"Certainly,\" Lara said. \"That would be fine.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you staying?\"\u003c/p\u003e\n\u003cp\u003e\"At the Palmer House.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t I pick you up at eight?\"\u003c/p\u003e\n\u003cp\u003eLara got to her feet. \"Thank you so much. I can\u0027t tell you how good you make me feel. Frankly, I was beginning to get discouraged.\"\u003c/p\u003e\n\u003cp\u003e\"No need,\" he said. \"I\u0027m going to take good care of you.\"\u003c/p\u003e\n\u003cp\u003eAt eight o\u0027clock Tom Peterson picked up Lara and took her to Henrici\u0027s for dinner. When they were seated, he said, \"You know, I\u0027m glad that you came to me. We can do a lot for each other.\"\u003c/p\u003e\n\u003cp\u003e\"We can?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. There\u0027s a lot of ass around this town, but none of it as beautiful as yours, honey. You can open a luxury whorehouse and cater to an exclusive...\"\u003c/p\u003e\n\u003cp\u003eLara froze. \"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003e\"If you can get half a dozen girls together, we...\"\u003c/p\u003e\n\u003cp\u003eLara was gone.\u003c/p\u003e\n\u003cp\u003eThe following day Lara visited three more banks. When she explained her plans to the manager of the first bank, he said, \"I\u0027m going to give you the best advice you\u0027ll ever get: Forget it. Real estate development is a man\u0027s game. There\u0027s no place for women in it.\"\u003c/p\u003e\n\u003cp\u003e\"And why is that?\" Lara asked tonelessly.\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027d be dealing with a bunch of macho roughnecks. They\u0027d eat you alive.\"\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t eat me alive in Glace Bay,\" Lara said.\u003c/p\u003e\n\u003cp\u003eHe leaned forward. \"I\u0027m going to let you in on a little secret. Chicago is not Glace Bay.\"\u003c/p\u003e\n\u003cp\u003eAt the next bank the manager said to her, \"We\u0027ll be glad to help you out, Miss Cameron. Of course, what you have in mind is out of the question. What I would suggest is to let us handle your money and invest it...\"\u003c/p\u003e\n\u003cp\u003eLara was out of his office before he finished his sentence.\u003c/p\u003e\n\u003cp\u003eAt the third bank Lara was ushered into the office of Bob Vance, a pleasant-looking gray-haired man who looked exactly as the president of a bank should look. In the office with him was a pale, thin, sandy-haired man in his early thirties, wearing a rumpled suit and looking completely out of place.\u003c/p\u003e\n\u003cp\u003e\"This is Howard Keller, Miss Cameron, one of our vice-presidents.\"\u003c/p\u003e\n\u003cp\u003e\"How do you do?\"\u003c/p\u003e\n\u003cp\u003e\"What can I do for you this morning?\" Bob Vance asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m interested in building a hotel in Chicago,\" Lara said, \"and I\u0027m looking for finance.\"\u003c/p\u003e\n\u003cp\u003eBob Vance smiled. \"You\u0027ve come to the right place. Do you have a location in mind?\"\u003c/p\u003e\n\u003cp\u003e\"I know the general area I want. Near the Loop, not too far from Michigan Avenue...\"\u003c/p\u003e\n\u003cp\u003e\"Excellent.\"\u003c/p\u003e\n\u003cp\u003eLara told him about her boutique hotel idea.\u003c/p\u003e\n\u003cp\u003e\"That sounds interesting,\" Vance said. \"And how much equity do you have?\"\u003c/p\u003e\n\u003cp\u003e\"Three million dollars. I want to borrow the rest.\"\u003c/p\u003e\n\u003cp\u003eThere was a thoughtful pause. \"I\u0027m afraid I can\u0027t help you. Your problem is that you have big ideas and a small purse. Now, if you would like us to invest your money for you...\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you,\" Lara said. \"Thanks for your time. Good afternoon, gentlemen.\" She turned and left the office, fuming. In Glace Bay three million dollars was a fortune. Here people seemed to think it was nothing.\u003c/p\u003e\n\u003cp\u003eAs Lara reached the street, a voice said, \"Miss Cameron!\"\u003c/p\u003e\n\u003cp\u003eLara turned. It was the man she had been introduced to - Howard Keller. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to talk to you,\" he said. \"Perhaps we could have a cup of coffee.\"\u003c/p\u003e\n\u003cp\u003eLara stiffened. Was everyone in Chicago a sex maniac?\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a good coffee shop just around the corner.\"\u003c/p\u003e\n\u003cp\u003eLara shrugged. \"All right.\"\u003c/p\u003e\n\u003cp\u003eWhen they had ordered, Howard Keller said, \"If you don\u0027t mind my butting in, I\u0027d like to give you some advice.\"\u003c/p\u003e\n\u003cp\u003eLara was watching him, wary. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003e\"In the first place, you\u0027re going about this all wrong.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think my idea will work?\" she asked stiffly.\u003c/p\u003e\n\u003cp\u003e\"On the contrary. I think a boutique hotel is a really great idea.\"\u003c/p\u003e\n\u003cp\u003eShe was surprised. \"Then why...?\"\u003c/p\u003e\n\u003cp\u003e\"Chicago could use a hotel like that, but I don\u0027t think you should build it.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"I would suggest that instead you find an old hotel in a good location and remodel it. There are a lot of rundown hotels that can be bought at a low figure. Your three million dollars would be enough equity for a down payment. Then you could borrow enough from a bank to refurbish it and turn it into your boutique hotel.\"\u003c/p\u003e\n\u003cp\u003eLara sat there thinking. He was right. It was a better approach.\u003c/p\u003e\n\u003cp\u003e\"Another thing, no bank is going to be interested in financing you unless you come in with a solid architect and builder. They\u0027ll want to see a complete package.\"\u003c/p\u003e\n\u003cp\u003eLara thought about Buzz Steele. \"I understand. Do you know a good architect and builder?\"\u003c/p\u003e\n\u003cp\u003eHoward Keller smiled. \"Quite a few.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks for your advice,\" Lara said. \"If I find the right site, could I come back and talk to you about it?\"\u003c/p\u003e\n\u003cp\u003e\"Any time. Good luck.\"\u003c/p\u003e\n\u003cp\u003eLara was waiting for him to say something like \"Why don\u0027t we talk it over at my apartment?\" Instead all Howard Keller said was: \"Would you care for more coffee, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003eLara roamed the downtown streets again, but this time she was looking for something different. A few blocks from Michigan Avenue, on Delaware, Lara passed a prewar rundown transient hotel. A sign outside said, CONG ESSI NAL HOTEL. Lara started to pass it, then suddenly stopped. She took a closer look. The brick facade was so dirty that it was difficult to tell what its original color had been. It was eight stories high. Lara turned and entered the hotel lobby. The interior was even worse than the exterior. A clerk dressed in jeans and a torn sweater was pushing a derelict out the door. The front desk looked more like a ticket window than a reception area. At one end of the lobby was a staircase leading to what once were meeting rooms, now turned into rented offices. On the mezzanine Lara could see a travel agency, a theater ticket service, and an employment agency.\u003c/p\u003e\n\u003cp\u003eThe clerk returned to the front desk. \"You wanna room?\"\u003c/p\u003e\n\u003cp\u003e\"No. I wanted to know...\" She was interrupted by a heavily made-up young woman in a tight-fitting skirt. \"Give me a key, Mike.\" There was an elderly man at her side.\u003c/p\u003e\n\u003cp\u003eThe clerk handed her a key.\u003c/p\u003e\n\u003cp\u003eLara watched the two of them head for the elevator.\u003c/p\u003e\n\u003cp\u003e\"What can I do for you?\" the clerk asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m interested in this hotel,\" Lara said. \"Is it for sale?\"\u003c/p\u003e\n\u003cp\u003e\"I guess everything\u0027s for sale. Is your father in the real estate business?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Lara said, \"I am.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her in surprise. \"Oh. Well, the one you want to talk to is one of the Diamond brothers. They own a chain of these dumps.\"\u003c/p\u003e\n\u003cp\u003e\"Where would I find them?\" Lara asked.\u003c/p\u003e\n\u003cp\u003eThe clerk gave her an address on State Street.\u003c/p\u003e\n\u003cp\u003e\"Would you mind if I looked around?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Help yourself.\" He grinned. \"Who knows, you might wind up being my boss.\"\u003c/p\u003e\n\u003cp\u003eNot if I can help it, Lara thought.\u003c/p\u003e\n\u003cp\u003eShe walked around the lobby, examining it closely. There were old marble columns lining the entrance. On a hunch, Lara pulled up an edge of the dirty, worn carpet. Underneath was a dull marble floor. She walked up to the mezzanine. The mustard-colored wallpaper was peeling. She pulled away an edge of it, and underneath was the same marble. Lara was becoming more and more excited. The handrail of the staircase was painted black. Lara turned to make sure that the room clerk was not watching and took out her key from the Stevens Hotel and scratched away some of the paint. She found what she was hoping for, a solid brass railing. She approached the elevators that were painted with the same black paint, scratched a bit away, and found more brass.\u003c/p\u003e\n\u003cp\u003eLara walked back to the clerk, trying to conceal her excitement. \"I wonder if I might look at one of the rooms.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"No skin off my nose.\" He handed her a key. \"Four-ten.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eLara got in the elevator. It was slow and antiquated. I\u0027ll have it redone, Lara thought. And I\u0027ll put a mural inside.\u003c/p\u003e\n\u003cp\u003eIn her mind she was already beginning to decorate the hotel.\u003c/p\u003e\n\u003cp\u003eRoom 410 looked like a disaster, but the possibilities were immediately evident. It was a surprisingly large room with antiquated facilities and tasteless furniture. Lara\u0027s heart began to beat faster. It\u0027s perfect, she thought.\u003c/p\u003e\n\u003cp\u003eShe walked downstairs. The stairway was old and had a musty smell. The carpets were worn, but underneath she found the same marble.\u003c/p\u003e\n\u003cp\u003eLara returned the key to the desk clerk.\u003c/p\u003e\n\u003cp\u003e\"Did you see what you wanted?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Lara said. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eHe grinned at her. \"You really going to buy this joint?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Lara said. \"I\u0027m really going to buy this joint.\"\u003c/p\u003e\n\u003cp\u003e\"Cool,\" he said.\u003c/p\u003e\n\u003cp\u003eThe elevator door opened, and the young hooker and her elderly john emerged. She handed the key and some money to the clerk. \"Thanks, Mike.\"\u003c/p\u003e\n\u003cp\u003e\"Have a nice day,\" Mike called. He turned to Lara. \"Are you coming back?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" Lara assured him, \"I\u0027m coming back.\"\u003c/p\u003e\n\u003cp\u003eLara\u0027s next stop was at the City Hall of Records. She asked to see the records on the property that she was interested in. For a fee of ten dollars, she was handed a file on the Congressional Hotel. It had been sold to the Diamond brothers five years earlier for six million dollars.\u003c/p\u003e\n\u003cp\u003eThe office of the Diamond brothers was in an old building on a corner of State Street. An Oriental receptionist in a tight red skirt greeted Lara as she walked in.\u003c/p\u003e\n\u003cp\u003e\"Can I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to see Mr. Diamond.\"\u003c/p\u003e\n\u003cp\u003e\"Which one?\"\u003c/p\u003e\n\u003cp\u003e\"Either of them.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll give you John.\"\u003c/p\u003e\n\u003cp\u003eShe picked up the phone and spoke into it. \"There\u0027s a lady here to see you, John.\" She listened a moment, then looked up at Lara. \"What\u0027s it about?\"\u003c/p\u003e\n\u003cp\u003e\"I want to buy one of his hotels.\"\u003c/p\u003e\n\u003cp\u003eShe spoke into the mouthpiece again. \"She says she wants to buy one of your hotels. Right.\" She replaced the receiver. \"Go right in.\"\u003c/p\u003e\n\u003cp\u003eJohn Diamond was a huge man, middle-aged and hairy, and he had the pushed-in face of a man who had once played a lot of football. He was wearing a short-sleeved shirt and smoking a large cigar. He looked up as Lara entered his office.\u003c/p\u003e\n\u003cp\u003e\"My secretary said you wanted to buy one of my buildings.\" He studied her a moment. \"You don\u0027t look old enough to vote.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m old enough to vote,\" Lara assured him. \"I\u0027m also old enough to buy one of your buildings.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Which one?\"\u003c/p\u003e\n\u003cp\u003e\"The Cong essi nal Hotel.\"\u003c/p\u003e\n\u003cp\u003e\"The what?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what the sign says. I assume it means \u0027Congressional.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Oh. Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Is it for sale?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Gee, I don\u0027t know. That\u0027s one of our big money-makers. I\u0027m not sure we could let it go.\"\u003c/p\u003e\n\u003cp\u003e\"You have let it go,\" Lara said.\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s in terrible shape. The place is falling apart.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Then what the hell do you want with it?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to buy it and fix it up a little. Of course, it would have to be delivered to me vacant.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s no problem. Our tenants are on a week-to-week basis.\"\u003c/p\u003e\n\u003cp\u003e\"How many rooms does the hotel have?\"\u003c/p\u003e\n\u003cp\u003e\"A hundred and twenty-five. The gross building area is a hundred thousand square feet.\"\u003c/p\u003e\n\u003cp\u003eToo many rooms. Lara thought. But if I combine them to create suites, I would end up with sixty to seventy-five keys. It could work.\u003c/p\u003e\n\u003cp\u003eIt was time to discuss price.\u003c/p\u003e\n\u003cp\u003e\"If I decided to buy the building, how much would you want for it?\"\u003c/p\u003e\n\u003cp\u003eDiamond said, \"If I decided to sell the building, I\u0027d want ten million dollars, a six-million cash down payment...\"\u003c/p\u003e\n\u003cp\u003eLara shook her head, \"I\u0027ll offer...\"\u003c/p\u003e\n\u003cp\u003e\"...period. No negotiating.\"\u003c/p\u003e\n\u003cp\u003eLara sat there, mentally figuring the cost of renovation. It would be approximately eighty dollars per square foot, or eight million dollars, plus furniture, fixtures, and equipment.\u003c/p\u003e\n\u003cp\u003eLara\u0027s mind was furiously calculating. She was sure she could get a bank to finance the loan. The problem was that she needed six million dollars in equity, and she only had three million. Diamond was asking too much for the hotel, but she wanted it. She wanted it more than anything she had ever wanted in her life.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make you a deal,\" Lara said.\u003c/p\u003e\n\u003cp\u003eHe was listening. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll give you your asking price...\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"So far so good.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ll give you a down payment of three million in cash.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Can\u0027t do it. I\u0027ve got to have six million in cash up front.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have it.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Where\u0027s the other three coming from?\"\u003c/p\u003e\n\u003cp\u003e\"From you.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to give me a second mortgage for three million.\"\u003c/p\u003e\n\u003cp\u003e\"You want to borrow money from me to buy my building?\"\u003c/p\u003e\n\u003cp\u003eIt was the same thing Sean MacAllister had asked her in Glace Bay.\u003c/p\u003e\n\u003cp\u003e\"Look at it this way,\" Lara said. \"You\u0027re really borrowing the money from yourself. You\u0027ll own the building until I pay it off. There\u0027s no way you can lose.\"\u003c/p\u003e\n\u003cp\u003eHe thought about it and grinned. \"Lady, you just bought yourself a hotel.\"\u003c/p\u003e\n\u003cp\u003eHoward Keller\u0027s office in the bank was a cubicle with his name on the door. When Lara walked in, he looked more rumpled than ever.\u003c/p\u003e\n\u003cp\u003e\"Back so soon?\"\u003c/p\u003e\n\u003cp\u003e\"You told me to come and see you when I found a hotel. I found one.\"\u003c/p\u003e\n\u003cp\u003eKeller leaned back in his chair. \"Tell me about it.\"\u003c/p\u003e\n\u003cp\u003e\"I found an old hotel called the Congressional. It\u0027s on Delaware. It\u0027s a few blocks from Michigan Avenue. It\u0027s rundown and seedy, and I want to buy it and turn it into the best hotel in Chicago.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me the deal.\"\u003c/p\u003e\n\u003cp\u003eLara told him.\u003c/p\u003e\n\u003cp\u003eKeller sat there, thinking. \"Let\u0027s run it past Bob Vance.\"\u003c/p\u003e\n\u003cp\u003eBob Vance listened and made some notes. \"It might be possible,\" he said, \"but...\" He looked at Lara. \"Have you ever run a hotel before, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003eLara thought about all the years of running the boarding-house in Glace Bay, making the beds, scrubbing the floors and doing the laundry and the dishes, trying to please the different personalities and keep peace.\u003c/p\u003e\n\u003cp\u003e\"I ran a boardinghouse full of miners and lumbermen. A hotel will be a cinch.\"\u003c/p\u003e\n\u003cp\u003eHoward Keller said, \"I\u0027d like to take a look at the property, Bob.\"\u003c/p\u003e\n\u003cp\u003eLara\u0027s enthusiasm was irresistible. Howard Keller watched Lara\u0027s face as they walked through the seedy hotel rooms, and he saw them through her eyes.\u003c/p\u003e\n\u003cp\u003e\"This will be a beautiful suite with a sauna,\" Lara said excitedly. \"The fireplace will be here, and the grand piano in that corner.\" She began to pace back and forth. \"When affluent travelers come to Chicago, they stay at the best hotels, but they\u0027re all the same - cold rooms without any character. If we can offer them something like this, even though it may cost a little more, there\u0027s no doubt about which they\u0027ll choose. This will really be a home away from home.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m impressed,\" Howard Keller said.\u003c/p\u003e\n\u003cp\u003eLara turned to him eagerly. \"Do you think the bank will loan me the money?\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s find out.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later Howard Keller was in a conference with Vance.\u003c/p\u003e\n\u003cp\u003e\"What do you think about it?\" Vance asked.\u003c/p\u003e\n\u003cp\u003e\"I think the lady\u0027s on to something. I like her idea about a boutique hotel.\"\u003c/p\u003e\n\u003cp\u003e\"So do I. The only problem is that she\u0027s so young and inexperienced. It\u0027s a gamble.\" They spent the next half hour discussing costs and projected earnings.\u003c/p\u003e\n\u003cp\u003e\"I think we should go ahead with it,\" Keller finally said. \"We can\u0027t lose.\" He grinned. \"If worse comes to worst, you and I can move into the hotel.\"\u003c/p\u003e\n\u003cp\u003eHoward Keller telephoned Lara at the Stevens Hotel. \"The bank has just approved your loan.\"\u003c/p\u003e\n\u003cp\u003eLara let out a shriek. \"Do you mean it? That\u0027s wonderful! Oh, thank you, thank you!\"\u003c/p\u003e\n\u003cp\u003e\"We have a few things to talk about,\" Howard Keller said. \"Are you free for dinner this evening?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. I\u0027ll pick you up at seven-thirty.\"\u003c/p\u003e\n\u003cp\u003eThey had dinner at the Imperial House. Lara was so excited that she barely touched her food.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you how thrilled I am,\" she said. \"It\u0027s going to be the most beautiful hotel in Chicago.\"\u003c/p\u003e\n\u003cp\u003e\"Easy,\" Keller warned, \"there\u0027s a long way to go.\" He hesitated. \"May I be frank with you, Miss Cameron?\"\u003c/p\u003e\n\u003cp\u003e\"Lara.\"\u003c/p\u003e\n\u003cp\u003e\"Lara. You\u0027re a dark horse. You have no track record.\"\u003c/p\u003e\n\u003cp\u003e\"In Glace Bay...\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t Glace Bay. To mix metaphors, it\u0027s a different ball park.\"\u003c/p\u003e\n\u003cp\u003e\"Then why is the bank doing this?\" Lara asked.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get me wrong. We\u0027re not a charitable organization. The worst thing that can happen is that the bank will break even. But I have a feeling about you. I believe you\u0027re going to make it. I think there could be a big upside. You don\u0027t intend to stop with this one hotel, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Lara said.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think so. What I want to say is that when we make a loan, we don\u0027t usually get personally involved in the project. But in this case I\u0027d like to give you whatever help you might need.\"\u003c/p\u003e\n\u003cp\u003eAnd Howard Keller intended to get personally involved with her. He had been attracted to Lara from the moment he had seen her. He was captivated by her enthusiasm and determination. She was a beautiful woman-child. He wanted desperately to impress her. Maybe, Keller thought, one day I\u0027ll tell her how close I came to being famous... \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stars-shine-down/page-7.html","bookId":2364,"creation":"Oct 5, 2019 10:10:56 AM","modification":"Oct 5, 2019 10:10:56 AM"}
