{"id":111727,"no":27,"title":"Page 27","content":"\u003cp\u003e\"What are you doing here?\" I demanded.\u003c/p\u003e\n\u003cp\u003eLexi raised a brow at me. \"Same thing you are. Looking forward to a long, painful eternity together.\"\u003c/p\u003e\n\u003cp\u003e\"No, I mean why didn\u0027t you run?\" I asked, resisting the urge to take her by the shoulders and shake her.\u003c/p\u003e\n\u003cp\u003e\"Of course I ran, you idiot!\" she snapped. \"But I guess he expected I would.... I never even saw him come after me.\" I could feel her shiver in the dark. \"He appeared out of nowhere.\" Her voice grew grim. \"I wonder if that\u0027s how humans feel when they meet us. If we ever get out of this, I swear I am going to be nicer to them in the future. Humans, I mean. That vampire - now him I want to kill.\"\u003c/p\u003e\n\u003cp\u003eI put my hand on her forearm, softening. \"I just pray we get that chance.\"\u003c/p\u003e\n\u003cp\u003e\"Come, let\u0027s get out of here.\" She turned and swung her leg, putting the heel of her boot smack into the middle of the doors.\u003c/p\u003e\n\u003cp\u003eThere was a resounding thud, but nothing budged.\u003c/p\u003e\n\u003cp\u003eShe delivered another roundhouse kick to the doors. And another. And another.\u003c/p\u003e\n\u003cp\u003eAgain, nothing happened.\u003c/p\u003e\n\u003cp\u003e\"Together!\" she insisted. On the count of three we both kicked.\u003c/p\u003e\n\u003cp\u003e\"Maybe there\u0027s vervain in the stone... ?\" I suggested.\u003c/p\u003e\n\u003cp\u003eLexi looked grim. \"Vervain doesn\u0027t make things indestructible. But there are other things that can be done to lock something up. Permanently. What about the walls?\"\u003c/p\u003e\n\u003cp\u003eFor the next hour we ran our fingers over the white walls, ceilings, and floors, our highly sensitive skin picking out even the most minute gaps. We ripped open sarcophagi, ransacked the corpses for tools.\u003c/p\u003e\n\u003cp\u003e\"No knives, no diamond crosses, no silver-plate Bibles, no pennies for Charon, no lucky stone, no nothing,\" I growled, throwing my hands up in frustration.\u003c/p\u003e\n\u003cp\u003e\"This doesn\u0027t look good,\" was all Lexi said.\u003c/p\u003e\n\u003cp\u003eTwenty-four hours later there was a service in the chapel. We could hear it with our Powers. It was a memorial to the Sutherlands, to the two brides who were killed, to the proud parents... along with a biting invective against the young men who did it, running off with the dowry money. Murderers, thugs, con men, robbers...\u003c/p\u003e\n\u003cp\u003eThe only accusation that didn\u0027t make the list was \"demon.\"\u003c/p\u003e\n\u003cp\u003eBut none of the insults stopped us from screaming.\u003c/p\u003e\n\u003cp\u003e\"Help!\" I yelled. \"In here! We\u0027re in here!\"\u003c/p\u003e\n\u003cp\u003eLexi added her voice to mine, screeching in different high-pitched tones that nearly blew out my eardrums. At one point I could hear a hollow-voiced Hilda whisper, \"Do you hear something?\" And our hopes were raised.\u003c/p\u003e\n\u003cp\u003eAnd then nothing. The service ended, people filed out, and once again we were completely, utterly alone.\u003c/p\u003e\n\u003cp\u003eWith sigh, Lexi gave me my ring back.\u003c/p\u003e\n\u003cp\u003e\"Many thanks for its loan,\" she said quietly, slipping it on my finger. \"But I don\u0027t think it will do me - or you - much good now.\"\u003c/p\u003e\n\u003cp\u003eI hugged her tight. \"Don\u0027t give up yet,\" I whispered in her ear.\u003c/p\u003e\n\u003cp\u003eBut the words echoed hollowly within the crypt, having nowhere else to go. \u003c/p\u003e","sourceLink":"https://allnovel.net/stefan-s-diaries-the-craving-the-vampire-diaries-3/page-27.html","bookId":2075,"creation":"Oct 6, 2019 12:33:20 AM","modification":"Oct 6, 2019 12:33:20 AM"}
