{"id":106592,"no":16,"title":"Page 16","content":"\u003cp\u003e“Oh, thanks.”\u003c/p\u003e\n\u003cp\u003e“Plus, you have money. But what makes you a catch is what you don’t have. You don’t have an ex-wife. You don’t have kids. You don’t have debts. You don’t have a chemical problem. You don’t have a criminal record. You’re not a jerk. Mac, you don’t have baggage. Intelligent, accomplished, independent career women like Kirsten, geez, Mac, they fall all over guys like you. I only wish I was in your place. You are so lucky.”\u003c/p\u003e\n\u003cp\u003eI thought that was pretty funny. Bobby asked me why I was laughing. I flashed on Shelby and his two daughters.\u003c/p\u003e\n\u003cp\u003e“Because I was going to tell you the same thing.”\u003c/p\u003e\n\u003cp\u003eMerci Cole’s last known address was a dilapidated apartment building that looked abandoned except for the silver Lincoln parked in front. Several screens had been punched or kicked out, a few windows were broken, and the sidewalk was littered with broken glass. CRIPS, the name of an L.A. street gang transplanted to the Twin Cities, was written across the sidewalk with red spray paint. A black man dressed in a white silk suit, white silk shirt, and white silk tie moved along the sidewalk, boogeying to some private riff, not a worry in the world, oblivious to everything around him. You’d think a man in his line of work would be more careful.\u003c/p\u003e\n\u003cp\u003eI once asked Colin Gernes why most pimps are black.\u003c/p\u003e\n\u003cp\u003e“For the same reason most basketball players are black,” he replied, scarcely believing how dumb I was, wondering where the department found so many dumb rookies. “It’s an inner city game and there are more blacks in the inner city.”\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eI saw no one as I locked my Jeep Cherokee and crossed the street to the apartment building, yet I could feel eyes from at least a dozen windows and I could hear them: Who is this white man with his expensive sport utility vehicle and what is he doing in our neighborhood? Good question.\u003c/p\u003e\n\u003cp\u003eI opened the door to the building and hesitated. There were mailboxes just inside the hallway, all of them jimmied open. The overhead light had been broken recently and shattered slivers of bulb were scattered across the floor. There was enough light from the street to prove that the hallway was empty so I went inside. Most people will do anything to avoid a fight and the fear it produces. I’m one of them. On the other hand, you have to accept a certain amount of risk in everything you do. I started climbing the stairs, touching my hip where my gun would have been if I had thought to bring it.\u003c/p\u003e\n\u003cp\u003eAlong with the camaraderie, you know what else I miss about being a police officer? The backup.\u003c/p\u003e\n\u003cp\u003eAccording to Bobby’s file, Merci Cole’s apartment was on the fourth floor. I never reached it. When I was midway between the third and fourth floors, a well-muscled black man wearing only blue jeans burst from his apartment, an aluminum Lady Thumper softball bat in his hands. He swung at my head and I jumped backward down the stairs, the barrel of the bat missing my chin by inches and smashing a hole into the thin plaster wall. I grabbed for the railing as he swung again. I lost my grip and fell, tumbling down to the third floor landing as his bat bounced off the wall where my head would have been if I had kept my balance.\u003c/p\u003e\n\u003cp\u003eHe followed close behind. I hit the landing with my shoulder, rolled, jumped to my feet. He pulled the bat back. I did a little hop and stomped his knee with the flat of my shoe. He cried out, an animal in pain, and dropped the bat. It rolled down the stairs, going thump, thump, thump as it fell to the next landing. He grabbed his knee. I hit him in the face. He threw a long, complicated, and entirely filthy curse at me. I hit him again. As I hit him I thought, This is what Kirsten must have meant by associating with “wrong people.”\u003c/p\u003e\n\u003cp\u003e“No more, no more,” he moaned, doing a fair impersonation of Roberto Duran. Apparently, he didn’t like pain any more than I did.\u003c/p\u003e\n\u003cp\u003e“Why did you come after me?” I was snorting, my breath coming hard and fast.\u003c/p\u003e\n\u003cp\u003e“Are you a cop? You look like cop. You a cop you gotta tell me, that’s the rules.”\u003c/p\u003e\n\u003cp\u003e“You swung on me because you thought I was a cop? What are you, a moron? The police would’ve blown your brains out you swing on them like that.”\u003c/p\u003e\n\u003cp\u003e“No, no, man. They got new rules. They can’t just shoot people, no more. They gotta bring in counselors and shit. I read ’bout it.”\u003c/p\u003e\n\u003cp\u003e“Hey, pal. Don’t believe everything you read. It’s healthier that way.”\u003c/p\u003e\n\u003cp\u003e“You’re not a cop? You look like a cop.”\u003c/p\u003e\n\u003cp\u003e“Have it your own way. Where’s Merci Cole?”\u003c/p\u003e\n\u003cp\u003e“Hey man, you not a cop? Fuck you, then.”\u003c/p\u003e\n\u003cp\u003e“Wrong answer.” I raised my fist menacingly, giving him a good look at it. Normally, I abhor violence, except I had a hard time getting past the fact the sonuvabitch tried to bludgeon me with a woman’s softball bat.\u003c/p\u003e\n\u003cp\u003eHe brought his shoulder up to protect his face.\u003c/p\u003e\n\u003cp\u003e“She’s gone, man.”\u003c/p\u003e\n\u003cp\u003e“Gone where?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What do you know?”\u003c/p\u003e\n\u003cp\u003e“She got outta Shakopee a month ago, longer.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-16.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
