{"id":106594,"no":18,"title":"Page 18","content":"\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“The girls will be sorry they missed you. You’ve become their all-time favorite person.”\u003c/p\u003e\n\u003cp\u003e“Seriously?”\u003c/p\u003e\n\u003cp\u003e“Ever since you announced that they were the heirs to your fortune.”\u003c/p\u003e\n\u003cp\u003e“Someone has to be. Besides, I’m not above buying affection from women.”\u003c/p\u003e\n\u003cp\u003eShelby held up the snow globe. “I noticed.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you later.” I kissed her cheek and made my way to the front door. She followed me. When I reached the door and opened it she was standing there, cupping the snow globe in her hands.\u003c/p\u003e\n\u003cp\u003e“Don’t be a stranger,” she said.\u003c/p\u003e\n\u003cp\u003e“Tell me something, Shel.” The words spilled out; I’m still not sure where they came from. “Just out of curiosity, if I had been the one who spilled the drink on your dress back when we were in school instead of Bobby, do you think you and I would have been the ones to get involved?”\u003c/p\u003e\n\u003cp\u003e“We are involved, Rushmore. Don’t you know that?”\u003c/p\u003e\n\u003cp\u003eA moment later I was in the Cherokee. She was still standing in the doorway. I waved to her. She waved back. I slipped the Jeep in gear and drove off even as I screamed at myself. What’s wrong with you, asking a question like that? What were you thinking? She’s the wife of your best friend. What a jerk!\u003c/p\u003e\n\u003cp\u003eThe e-mail from the Department of Motor Vehicles told me the same thing that Bobby had. The only Carlson, Jamie Anne, with a driver’s license in the state of Minnesota was a sixteen-year-old brunette living in Minneapolis. I put my four dollars down and requested another search, this time for the owner of a vanity plate with the initials JB.\u003c/p\u003e\n\u003cp\u003eJust as I hit the “send” button, the telephone rang.\u003c/p\u003e\n\u003cp\u003e“It’s me,” Shelby said.\u003c/p\u003e\n\u003cp\u003e“Hi.”\u003c/p\u003e\n\u003cp\u003e“I want you to know that you are my good friend and I love you, but you shouldn’t be asking questions like you asked and you shouldn’t be giving me gifts, even goofy little things like the snow globe, except on my birthday and at Christmas.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“I’m married.”\u003c/p\u003e\n\u003cp\u003eShe’s married, she’s married, she’s married—to your best friend, you moron!\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Well, then, I’ll be seeing you soon.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eShe hung up and I told myself: Don’t ever do that again, you dumb schmuck.\u003c/p\u003e\n\u003cp\u003eIf you believe the crime statistics—and we all know how reliable they are—there are about 150 full-time prostitutes in St. Paul and three times that many in Minneapolis. The bars, saunas, hotels, convention centers, and private parties—where a working girl can get shelter from the rain—belong to women with valid twenty-one-year-old IDs. The streets belong to the children. The average age of a street hooker in the Twin Cities is sixteen. You see them waving at the cars that cruise Frog-town, a decidedly blue-collar community north of University Avenue and west of the State Capital, and in East St. Paul, especially in the Arcade-Payne Avenue neighborhood where Cheney’s is located.\u003c/p\u003e\n\u003cp\u003e“Are you looking to party?”\u003c/p\u003e\n\u003cp\u003eMaybe they’ll hop in the cars and find an alley somewhere, or take their customers to the hot-bed hotel up the street renting rooms at twenty bucks a half hour. Or maybe they’ll walk the john around back, kneeling on the asphalt, slipping the wallet out of the john’s sucker pocket while he’s slipping it in—what’s he going to do, call a cop? A few minutes later they’ll be back on the corner, looking for another willing customer with clean blood.\u003c/p\u003e\n\u003cp\u003eIt’s a tough way to make a living. Yet while I can sympathize with prostitutes, johns are a mystery to me. I have no idea what motivates them. Especially those who buy young girls off the street, paying forty bucks to abuse a child. I only know that when it comes to prostitution, we usually arrest the wrong people.\u003c/p\u003e\n\u003cp\u003eIt was still early evening when I arrived at the bar. Three hookers sat together at a square table in the back where they could see the comings and goings of all of Cheney’s patrons. When they saw me, one of the women said something to the other two and stood. Time to go to work.\u003c/p\u003e\n\u003cp\u003eThe woman, wearing a short, tight, purple skirt and purple blouse with a plunging neckline, intercepted me at the bar.\u003c/p\u003e\n\u003cp\u003e“You looking to party?” she asked, exuding all the charm of an X-rated movie.\u003c/p\u003e\n\u003cp\u003e“Damn right,” I said, slapping the bar top with my hand. “Innkeeper! I just hit the Pick Three. Gimme the most expensive beer in the house.”\u003c/p\u003e\n\u003cp\u003eThe bartender took a Heineken from the cooler and approached with a wary eye.\u003c/p\u003e\n\u003cp\u003e“Fine establishment you have here,” I told him nice and loud in case there was someone in the joint who hadn’t already noticed me.\u003c/p\u003e\n\u003cp\u003e“We like it,” he said, placing the bottle and an empty glass in front of me. I poured the beer myself.\u003c/p\u003e\n\u003cp\u003e“So, honey,” I said to the woman hugging my side. “What’s your name?”\u003c/p\u003e\n\u003cp\u003e“What name do you like?”\u003c/p\u003e\n\u003cp\u003e“Cloris,” I told her. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-18.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
