{"id":106599,"no":23,"title":"Page 23","content":"\u003cp\u003e“He owns a string of used car dealerships.”\u003c/p\u003e\n\u003cp\u003eThat was why his name had seemed so familiar. Good Deal Dave, Bruder Motors, four locations throughout the Twin Cities to serve you. Outdoor boards featuring Bruder’s sincere smile were everywhere and his TV spots cluttered prime time.\u003c/p\u003e\n\u003cp\u003e“How did you manage a new name, social security card, driver’s license …?”\u003c/p\u003e\n\u003cp\u003e“There are ways,” the young woman advised me.\u003c/p\u003e\n\u003cp\u003eThere certainly are. “Did Merci Cole help?”\u003c/p\u003e\n\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to be here when my husband and his associate arrive.”\u003c/p\u003e\n\u003cp\u003e“I understand.” I rose from the table. I gave her my business card after first writing my cell number on back.\u003c/p\u003e\n\u003cp\u003e“You will call me tomorrow?” I asked.\u003c/p\u003e\n\u003cp\u003eJamie set the card on the table.\u003c/p\u003e\n\u003cp\u003e“If I don’t you’ll only come back, won’t you?”\u003c/p\u003e\n\u003cp\u003eWas I that obvious?\u003c/p\u003e\n\u003cp\u003e“One more thing, Mrs. Bruder.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Why did you leave home?”\u003c/p\u003e\n\u003cp\u003e“I hate lies.”\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Must have been a whopper,” I told her.\u003c/p\u003e\n\u003cp\u003eI did some tossing and turning in bed. It wasn’t like me to fixate on a woman, especially one so young and inaccessible, yet images of Jamie Carlson Bruder kept floating in the darkness behind my closed eyes. I tried hard not to think about her. The harder I tried, the more impossible the task became. She was a beauty, all right, and I imagined her in ways that were not particularly healthy. Or maybe they were healthy. I don’t know. What would a therapist say? Perhaps he’d say that my subconscious was telling me to let go of Kirsten and move on. Perhaps he’d say I was a pervert and required about fifty years of therapy. I flipped over my pillow, nestled against the cool side, closed my eyes, and thought of Shelby. That probably wasn’t healthy, either. She’s your best friend’s wife! Get over it! Jamie crowded her out, anyway. It was when I started envisioning doing terrible things to her husband—a damned used car salesman, no less—that I gave it up and padded downstairs to my kitchen. I took milk from the refrigerator and drank from the carton before rooting through my cupboards for Oreos.\u003c/p\u003e\n\u003cp\u003eI ate a half dozen. While I ate, I rifled my CD collection, discarding the rockers in favor of Etta James, the last of the great jazz divas. I finished the milk and cookies and sprawled out on my sofa, listening to Etta’s honey-drenched voice in the dark. That’s where I fell asleep.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eThe pounding on my door was loud enough to wake the dead and at 5:10 a.m. by my watch it had to be. I rolled off my sofa and stubbed my toe against the coffee table. Hopping on one foot while trying to massage the other, I cursed my clumsiness. Yet the pain shocked me awake and my first conscious thought was of a common police practice—we often served warrants early in the morning when the miscreants were too groggy with sleep to put up a fuss. Only why would the cops want to arrest an upstanding citizen like me?\u003c/p\u003e\n\u003cp\u003eI hopped to the window in my living room. The sky was streaked with a hard gray—the sun hadn’t yet decided if it wanted to rise—but it was bright enough to reveal a decade-old Buick Regal at rest in front of my house.\u003c/p\u003e\n\u003cp\u003eHuh, I thought.\u003c/p\u003e\n\u003cp\u003eTurning my head I was able to see a tall, young black man standing on my porch. He was holding the barrel of a sawed-off shotgun flush against the front door just below the spy hole with one hand while lifting the heavy brass knocker with the other.\u003c/p\u003e\n\u003cp\u003eHuh, I thought again.\u003c/p\u003e\n\u003cp\u003eIn the time it took him to knock twice more, I bounded up my stairs, went to my room, slipped the 9 mm Heckler \u0026amp; Koch from the drawer of the table next to my bed, flew down the stairs again, and snuck out my back door. I circled the house, staying low beneath the lip of the porch, working toward the front steps.\u003c/p\u003e\n\u003cp\u003eHe was still pounding on the door and starting to get anxious about it, scanning the yards of my neighbors, watching for cars on the street. It shouldn’t be taking this long. The black man was about six feet, one-eighty-five, in good shape, wearing jeans and a tan jacket. He was still holding the muzzle of the sawed-off hard against the wood door, staring intently at the spy hole, waiting for the shadow of my eye to pass across it.\u003c/p\u003e\n\u003cp\u003eI made myself clear.\u003c/p\u003e\n\u003cp\u003e“DROP THE FUCKING GUN!”\u003c/p\u003e\n\u003cp\u003eHe stopped pounding, his head turned abruptly toward my voice. I was behind him about twenty yards and to his left, sighting on his upper torso even as I watched his hands—always watch the hands.\u003c/p\u003e\n\u003cp\u003e“YOU HAVEN’T GOT A CHANCE, BUT YOU GOT A CHOICE!” I warned him.\u003c/p\u003e\n\u003cp\u003eHe hesitated.\u003c/p\u003e\n\u003cp\u003e“DROP IT!” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-23.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
