{"id":106607,"no":31,"title":"Page 31","content":"\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“I never thanked you.”\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003e“For the ducks. For the pond. I had my misgivings when your father put it in, but now … It’s really quite lovely.”\u003c/p\u003e\n\u003cp\u003e“You spent a lot of time with my father when he was digging it. You brought him lemonade.”\u003c/p\u003e\n\u003cp\u003e“I only brought him lemonade once. After that it was Leinies.”\u003c/p\u003e\n\u003cp\u003e“Leinenkugel’s, brewed in Wisconsin. To my dad that’s an imported beer.”\u003c/p\u003e\n\u003cp\u003e“He liked them.”\u003c/p\u003e\n\u003cp\u003e“Yes, he did.”\u003c/p\u003e\n\u003cp\u003e“Did he ever tell you what we talked about when I brought him the beers?”\u003c/p\u003e\n\u003cp\u003e“Dad? No. When you told Dad something, that’s as far as it went. He was the keeper of everyone’s secrets.”\u003c/p\u003e\n\u003cp\u003e“He was very proud of you. He said so. Many times. He thought you were a good man, only he didn’t know how to tell you.”\u003c/p\u003e\n\u003cp\u003e“You told me. At the funeral. I’ve always been grateful to you for that little bit of kindness.”\u003c/p\u003e\n\u003cp\u003e“Your father was kind to me at a time when I needed kindness.”\u003c/p\u003e\n\u003cp\u003e“He was that way.”\u003c/p\u003e\n\u003cp\u003e“He never remarried after your mother died. He never even dated. Did he ever tell you why?”\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003e“He couldn’t. His love for your mother wouldn’t allow it. I wish I could find a man to love me that much. I’m three husbands down and I haven’t even come close.”\u003c/p\u003e\n\u003cp\u003e“They say the fourth time is the charm.”\u003c/p\u003e\n\u003cp\u003e“They say the third time is the charm, but never mind.”\u003c/p\u003e\n\u003cp\u003eShe stood and wrapped her arms around herself like she was suddenly cold.\u003c/p\u003e\n\u003cp\u003e“Why don’t you come up to the house with me? We’ll have coffee.”\u003c/p\u003e\n\u003cp\u003e“It’s tempting, but …”\u003c/p\u003e\n\u003cp\u003e“It’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid I wouldn’t be very good company, tonight. I have too much on my mind.”\u003c/p\u003e\n\u003cp\u003e“That’s why I’m offering.”\u003c/p\u003e\n\u003cp\u003e“A rain check?”\u003c/p\u003e\n\u003cp\u003e“Put it somewhere safe, where you won’t lose it.”\u003c/p\u003e\n\u003cp\u003eMargot turned then and drifted up her sloping lawn toward her house. I watched her until she disappeared into the darkness.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eI showered for the third time in twenty-four hours, dressed quickly, fed the ducks again, skipped my own breakfast, and hurried out of the house. I didn’t want to hang around. I wanted to be out and doing. Ten minutes later I was standing in the City of St. Anthony Village municipal building—don’t ask me why it’s called both a city and a village. I was trying to get through the secured door that led to the cop shop, only the receptionist wouldn’t push the button that unlocked it until she was given the high sign by Chief Casey.\u003c/p\u003e\n\u003cp\u003e“I called,” he told me.\u003c/p\u003e\n\u003cp\u003e“I didn’t get the message until late.”\u003c/p\u003e\n\u003cp\u003e“Yesterday you killed a man. Want to know why?”\u003c/p\u003e\n\u003cp\u003e“You’re volunteering?” This was a first for me—a cop besides Bobby Dunston who freely gave me information. What’s the catch? I wondered.\u003c/p\u003e\n\u003cp\u003eCasey led me to his small, cluttered office. I told him he could do better but he blew me off. “I have gold braid on my hat. I don’t need a corner office with a view.”\u003c/p\u003e\n\u003cp\u003eI liked him more and more.\u003c/p\u003e\n\u003cp\u003eThere was a file folder in the upper corner of his desk under a small trophy with the words TO THE WORLD’S GREATEST DAD etched into its base. Casey sat behind his desk, snagged the folder, and opened it. He began to read.\u003c/p\u003e\n\u003cp\u003e“Wait, wait,” I implored as I took my notebook and pen from my jacket pocket. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Bradley Young, AKA Emilio, AKA Billy the Kid …”\u003c/p\u003e\n\u003cp\u003e“Emilio? Billy?”\u003c/p\u003e\n\u003cp\u003e“Emilio Estevez starred as Billy the Kid in Young Guns. Apparently there was some resemblance.”\u003c/p\u003e\n\u003cp\u003eCasey slid a photograph of the dead man across the desk. I didn’t see any similarity between the white actor and black gangster, but I didn’t look very hard. I don’t like looking at photographs of the recently deceased, never have. I like to think there’s a dignity in human beings that transcends the life they live, that gives them value no matter how cheaply they died and you can see none of that in a photo taken at the scene.\u003c/p\u003e\n\u003cp\u003eThe chief kept paraphrasing. I set the photograph aside and wrote quickly, trying to keep up.\u003c/p\u003e\n\u003cp\u003e“Born and raised in Detroit, Michigan, the only child of father Robert, mother Jo Jo. Both parents killed when the propane tank exploded in their mobile home, cause unknown.”\u003c/p\u003e\n\u003cp\u003eThe chief tapped the file. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-31.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
