{"id":106621,"no":45,"title":"Page 45","content":"\u003cp\u003eCook was all smiles and positive energy—I could feel it even where I sat way in the back of the room. From his unrelenting upbeat delivery, you’d think he was selling a food processor or a set of Ginsu steak knives instead of alarm systems designed to keep you or your loved ones from being raped and murdered in bed. “It’s something I wish there was no market for,” he claimed. “But today we need the Bloomington Alarm’s comprehensive emergency-alert system more than ever.” Not once did he refer to Katherine Katzmark or Jamie Carlson Bruder by name, yet from the way his audience nodded its collective heads, I guessed the murders were foremost in their minds. Probably the reason for the “increased demand” from customers, I concluded.\u003c/p\u003e\n\u003cp\u003eNor did Cook linger over the cost of his toys, which started at $799—a small price to pay for peace of mind in a dangerous world, Cook insisted. Given the quality of his products, I figured his customers would be better off keeping geese, only no one asked for my expert opinion and I didn’t offer it.\u003c/p\u003e\n\u003cp\u003eAs advertised, the seminar was free. However, the audience was encouraged to sign up afterward with Cook’s “lovely assistant Meredith” for a fifty-dollar home security assessment and at least half of the people who crowded into the room queued up in front of her. While they waited in line Cook kept selling. He shook hands, listened patiently to tales of property theft and other outrages, and offered advice, which nearly always consisted of arranging an appointment with one of his highly qualified security agents.\u003c/p\u003e\n\u003cp\u003eI sat in the back and waited. Cook noticed me and several times glanced my way. When the last customer left he moved quickly to my side, extended his hand. “Napoleon Cook. Can I be of assistance?” He probably thought I was a big fish in a pond of guppies, the manager of a large apartment complex, perhaps.\u003c/p\u003e\n\u003cp\u003eI shook his hand and said, “McKenzie.”\u003c/p\u003e\n\u003cp\u003eCook’s body stiffened and the pupils of his eyes grew wide at the sound of my name. He knew who I was and the knowledge frightened him. Lovely assistant Meredith came up from behind. “Is there anything else, Napoleon?”\u003c/p\u003e\n\u003cp\u003eShe had to ask twice before Cook answered, “No, Meredith, thanks.”\u003c/p\u003e\n\u003cp\u003e“Okay, see ya Monday,” she replied in a pleasant sing-song voice.\u003c/p\u003e\n\u003cp\u003eI watched her go through the doors of the meeting room. “Pretty,” I said.\u003c/p\u003e\n\u003cp\u003e“Huh? Yeah. Sure, she is.” I had been holding Cook’s hand all that time and he pulled it away. “Very pretty.” And winked. “Very athletic, too, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003eHe smiled mightily, selling me like he did the rest of the crowd.\u003c/p\u003e\n\u003cp\u003e“Oh, does she play tennis?”\u003c/p\u003e\n\u003cp\u003e“Tennis?” Cook started to laugh. He patted my shoulder. “Tennis?” he said. “Yeah, you should see her serve.”\u003c/p\u003e\n\u003cp\u003eWe were pals now, talking dirty in the locker room.\u003c/p\u003e\n\u003cp\u003e“How can I help you?”\u003c/p\u003e\n\u003cp\u003e“I’m investigating the murder of Jamie Bruder,” I told him.\u003c/p\u003e\n\u003cp\u003e“Unbelievable, isn’t it? Such a lovely woman. Terribly tragic.”\u003c/p\u003e\n\u003cp\u003e“Good for business, though.”\u003c/p\u003e\n\u003cp\u003e“Sad, but true. I thought I would take some of my profits and start up a memorial in her name, something like that. Such a lovely woman.”\u003c/p\u003e\n\u003cp\u003e“You were there the evening she was killed.” I made it sound like an accusation.\u003c/p\u003e\n\u003cp\u003eThe smile froze on his face and he brushed a hand through his hair. It was hard hair, not a strand moved out of place. “No.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“I was invited for drinks, but I stayed for only a few minutes.”\u003c/p\u003e\n\u003cp\u003eI stared at him without blinking, waiting for him to blink, which he did several times before looking away altogether.\u003c/p\u003e\n\u003cp\u003e“You’re not with the police,” he reminded himself more than me.\u003c/p\u003e\n\u003cp\u003e“I’m doing a favor for the family.”\u003c/p\u003e\n\u003cp\u003e“Family?” The word seemed to frighten him more than my name did.\u003c/p\u003e\n\u003cp\u003e“Jamie’s family,” I clarified. “Were you thinking I meant the Family Boyz?”\u003c/p\u003e\n\u003cp\u003eCook lost his smile completely. He began flexing the fingers of his hands without purpose. “Family Boyz? What are you talking about?”\u003c/p\u003e\n\u003cp\u003eI was on to something and kept pressing. “I’m talking about conspiracy, murder, drugs, guns …” On the word “guns” Cook’s eyelids began to flicker.\u003c/p\u003e\n\u003cp\u003e“I have nothing to do with any of that,” he insisted.\u003c/p\u003e\n\u003cp\u003e“Aren’t you and Bruder and the Boyz all members of the Northern Lights Entrepreneur’s Club—same as Katherine Katzmark?”\u003c/p\u003e\n\u003cp\u003e“Katherine,” he whispered, like it was the first time he had heard the name. Cook moved quickly away from me. I thought he was going to make a break for it, but he stopped at the door and spun to face me.\u003c/p\u003e\n\u003cp\u003e“I’m very upset about Katherine and Jamie.” My take was that he was telling the truth. “But I can’t help you. I’ve already told the police everything I know.”\u003c/p\u003e\n\u003cp\u003e“Of course, you did. Thank you for your time, Mr. Cook.” I extended my empty hand. He shook it vigorously like he was relieved about something.\u003c/p\u003e\n\u003cp\u003eQuickly, I slapped my left hand over the back of his right, making sure my thumb was over his wrist and my fingers underneath. I stepped in with my left foot and brought his hand up in a counterclockwise motion over his head. I pivoted my body in a complete circle, locking his shoulder. I let go with my left hand, clutched his elbow at the point and pulled up hard, arching his back. And that, boys and girls, is how you execute a shoulder-lock come-along.\u003c/p\u003e\n\u003cp\u003e“Stop it, that hurts,” Cook bellowed.\u003c/p\u003e\n\u003cp\u003e“No doubt about it,” I said, giving the hold a little extra pressure. I walked him face first into the wall. I bounced him a few more times before releasing him and pushing him away. I pointed an accusing finger at him. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-45.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
