{"id":106623,"no":47,"title":"Page 47","content":"\u003cp\u003e“Hey,” I said as the bartender moved away.\u003c/p\u003e\n\u003cp\u003e“Something else?”\u003c/p\u003e\n\u003cp\u003e“How much did the woman give you?”\u003c/p\u003e\n\u003cp\u003e“A ten.”\u003c/p\u003e\n\u003cp\u003e“How much was the drink?”\u003c/p\u003e\n\u003cp\u003e“Four-fifty.”\u003c/p\u003e\n\u003cp\u003e“Nice.”\u003c/p\u003e\n\u003cp\u003eThe sandwich was served by a handsome woman with the most startling silver-blue eyes I had ever seen, made even more luminous by the short jet black hair that framed them. She reminded me of the actress Meg Foster. You know who I mean. She did The Scarlet Letter on PBS a while back as well as The Osterman Weekend and Leviathan, been on TV a hundred times.\u003c/p\u003e\n\u003cp\u003eJust in case Cook started to move, I told the server I wanted to pay my tab right away. She seemed to read my mind.\u003c/p\u003e\n\u003cp\u003e“Whatever you say, shamus.”\u003c/p\u003e\n\u003cp\u003e“Shamus?”\u003c/p\u003e\n\u003cp\u003e“Isn’t that what they call private eyes these days?”\u003c/p\u003e\n\u003cp\u003eI didn’t think they ever called detectives that except in the movies. “What makes you think I’m a detective?”\u003c/p\u003e\n\u003cp\u003e“I saw you come in, saw you follow a man upstairs, saw you watch him over the railing while trying not to be seen yourself, and now you’re sitting here, a little mouse in the corner, paying up front in case you need to make a quick getaway.”\u003c/p\u003e\n\u003cp\u003e“Amazing.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am,” she told me, her silver eyes twinkling mischievously.\u003c/p\u003e\n\u003cp\u003e“Why not a cop?”\u003c/p\u003e\n\u003cp\u003eShe pointed at the Grain Belt.\u003c/p\u003e\n\u003cp\u003e“Cops don’t drink on the job—well, most of them don’t.”\u003c/p\u003e\n\u003cp\u003e“Amazing,” I repeated.\u003c/p\u003e\n\u003cp\u003e“Besides, I figured someone like you would be along sooner or later.”\u003c/p\u003e\n\u003cp\u003e“Someone like me?”\u003c/p\u003e\n\u003cp\u003e“The woman that met the man you’re following? She’s married. Wears a ring the size of a grade AA jumbo egg. Yet she comes in once, twice, sometimes three times a week, sits alone in the same booth and waits for a man to meet her. Rarely the same man twice. None of them her husband.”\u003c/p\u003e\n\u003cp\u003eI didn’t ask her if she was sure. Why insult the woman? Instead, I asked, “What’s her name?”\u003c/p\u003e\n\u003cp\u003e“She doesn’t pay, the man always pays, so I’ve never seen her name on a check or credit card. But she reserves the table under the name Hester, just Hester, no last name. I figure it’s a private joke.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Hester Prynne.”\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003e“The adulteress in The Scarlet Letter.”\u003c/p\u003e\n\u003cp\u003e“Oh, okay, sure. Say, has anyone ever told you that you have eyes just like Meg Foster?”\u003c/p\u003e\n\u003cp\u003e“Who’s she?”\u003c/p\u003e\n\u003cp\u003e“A pretty good actress.”\u003c/p\u003e\n\u003cp\u003eThe woman shook her head.\u003c/p\u003e\n\u003cp\u003e“Never mind.”\u003c/p\u003e\n\u003cp\u003e“So, are you working for the woman’s husband or what?”\u003c/p\u003e\n\u003cp\u003e“I’m following the man. I don’t know anything about the woman.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why what?”\u003c/p\u003e\n\u003cp\u003e“Following the man.”\u003c/p\u003e\n\u003cp\u003e“It’s a complicated story.”\u003c/p\u003e\n\u003cp\u003eShe leaned an elbow on the bar. “That’s what bartenders are for, to listen to complicated stories.”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“I own the place.”\u003c/p\u003e\n\u003cp\u003e“You’re Rickie?”\u003c/p\u003e\n\u003cp\u003e“Nina. Nina Truhler.” She offered to shake hands, her grip was firm. “Rickie’s my daughter, also known as Erica.”\u003c/p\u003e\n\u003cp\u003e“McKenzie.” I didn’t tell her I wasn’t a private investigator. Why ruin the illusion?\u003c/p\u003e\n\u003cp\u003e“Pleasure.”\u003c/p\u003e\n\u003cp\u003e“Where’s the namesake?”\u003c/p\u003e\n\u003cp\u003eNina looked at her watch and said, “Erica should just be getting home from dance class now. She’ll read my note telling her to eat a decent meal, ignore it, grab some Lucky Charms and eat them dry from the box like peanuts while she decides if she’ll go cruising with her friends tonight or simply curl up with a good book. I’d say it was fifty-fifty.”\u003c/p\u003e\n\u003cp\u003e“No gentlemen callers?”\u003c/p\u003e\n\u003cp\u003e“She’s fourteen. Boys bore her.”\u003c/p\u003e\n\u003cp\u003e“Boys bored me when I was fourteen, too.”\u003c/p\u003e\n\u003cp\u003e“Are you gay?”\u003c/p\u003e\n\u003cp\u003e“No,” I said way too loud. “I was just making a joke.”\u003c/p\u003e\n\u003cp\u003e“Oh, funny.” She rolled her eyes and moved down the bar.\u003c/p\u003e\n\u003cp\u003eI liked her. I liked everything about her. I liked the way her movements were smooth and effortless when she served her other customers—a dancer who knows all the steps. I liked her clear, unaffected voice and the way she spoke as if she was in the habit of speaking up for herself. I liked it that her high cheekbones, narrow nose, and generous mouth required little makeup. I liked her outfit—a brandy colored turtleneck sweater under a matching long-sleeve cardigan, the sleeves pushed up, and a pleated, charcoal gray skirt. I even liked it that she was ten pounds over what the New York fashion designers decreed was her ideal weight—a woman who cared about her appearance but who wasn’t going to starve herself over it.\u003c/p\u003e\n\u003cp\u003e“Okay, good, not gay,” she said when she returned. “Are you married?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Divorced?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Children?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI was beginning to think Bobby was on to something. Maybe I was a catch.\u003c/p\u003e\n\u003cp\u003e“How about you?” I asked.\u003c/p\u003e\n\u003cp\u003e“Divorced.”\u003c/p\u003e\n\u003cp\u003e“Happily?”\u003c/p\u003e\n\u003cp\u003eNina chuckled. “Very.”\u003c/p\u003e\n\u003cp\u003e“Rickie your only offspring?”\u003c/p\u003e\n\u003cp\u003e“Yes, thankfully.”\u003c/p\u003e\n\u003cp\u003e“Thankfully?”\u003c/p\u003e\n\u003cp\u003e“Believe me, Erica is enough to keep both hands full.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-47.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
