{"id":106648,"no":72,"title":"Page 72","content":"\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“To prove a point about all those wonderful, true-blue, one-for-all, all-for-one lifetime friends of the Northern Lights Entrepreneur’s Club.”\u003c/p\u003e\n\u003cp\u003e“The point being?”\u003c/p\u003e\n\u003cp\u003e“They’re hypocrites and they can’t be trusted.”\u003c/p\u003e\n\u003cp\u003e“What about all the other men you’ve slept with?”\u003c/p\u003e\n\u003cp\u003e“Some people collect stamps.”\u003c/p\u003e\n\u003cp\u003e“You’re a wonderful human being, you know that?”\u003c/p\u003e\n\u003cp\u003e“Mr.—McKenzie, is it? I don’t think I care to answer any more of your questions.”\u003c/p\u003e\n\u003cp\u003e“Would it change your mind if I threatened to tell your husband about your activities with his friends?”\u003c/p\u003e\n\u003cp\u003e“He probably already knows. He’s not a fool.”\u003c/p\u003e\n\u003cp\u003e“What if I told him about you and Devanter?”\u003c/p\u003e\n\u003cp\u003e“I don’t think Devanter would like that. Would you, Devanter?”\u003c/p\u003e\n\u003cp\u003eI didn’t know he was behind me until he slammed his fist into my spine. He hit me harder than I had ever been hit before—the pain made me cry out. My entire body went numb and I folded like an accordion. Devanter lifted me by my shoulders and threw me in the general direction of Lake Minnetonka. I hit the ground with my face and upper chest. He picked me up and threw me again. This time I landed on my neck and shoulders. I tried to roll into some kind of fighting stance, but he caught me and tossed me around some more.\u003c/p\u003e\n\u003cp\u003eLila sat on the lounge chair and watched, scratching the shepherd’s ears, the shepherd licking his paw.\u003c/p\u003e\n\u003cp\u003eDevanter must have been getting tired because he grabbed my shoulders and held me. “I told you, didn’t I?” He butted my head. Blood spilled over my face. He butted me again. He smiled. I could see my blood on his teeth. Suddenly, there was a heavy weight in my hand. We both looked down. It was my Beretta. Don’t ask me how I managed to wrest it from the holster, I couldn’t even feel the grip. I thrust the barrel into Devanter’s groin. He wasn’t impressed. Instead, he grinned. And those eyes. He didn’t give a damn. Maybe Lila did.\u003c/p\u003e\n\u003cp\u003e“Call him off!” I yelled.\u003c/p\u003e\n\u003cp\u003e“Devanter,” she said softly.\u003c/p\u003e\n\u003cp\u003eDevanter let go of my shoulders and stepped back. I crumpled to my knees, reaching out my left hand to keep from tumbling over. I managed to keep the gun pointed at him.\u003c/p\u003e\n\u003cp\u003e“Devanter,” Lila said again, and he turned and walked toward the house. She rose from the recliner and patted his head as he went past. Just a playful puppy.\u003c/p\u003e\n\u003cp\u003eLila came to where I knelt on her lawn, standing before me, the sun directly behind her. Backlit like that she seemed beatified, a halo of light around her head like you see in Renaissance paintings of the Virgin Mary. The sight hurt my eyes. I lowered my chin against my chest. Lila gently stroked my hair.\u003c/p\u003e\n\u003cp\u003e“You must leave, now,” she said.\u003c/p\u003e\n\u003cp\u003eI nodded and tried to wipe the blood from my eyes.\u003c/p\u003e\n\u003cp\u003e“Men,” she muttered and stepped away. The front of her white suit was stained with my blood. She walked back to her house, the shepherd trailing behind. I kept the Beretta trained on her until she was inside.\u003c/p\u003e\n\u003cp\u003eWith strength I didn’t know I possessed, I pushed myself vertical and staggered to my vehicle. I set the Beretta on the passenger seat and slowly pulled the handkerchief from my hip pocket—everything I did was at quarter speed. I mopped the blood from my face and surveyed the damage in the mirror behind my sun visor. There was a four-inch slice along my hairline. I touched it. That was a mistake. The shooting pain made me both dizzy and nauseous.\u003c/p\u003e\n\u003cp\u003eI shouldn’t have tried to drive, but I had to get out of there. I turned the wrong way on the gravel and followed it to the black-and-white-striped traffic barrier. Dead end. I turned off the engine and fell out the door. I rolled a few yards, struggled to my feet and pushed myself over the barrier and through the trees to the lake shore. The shore was rocky—I tripped on it several times, tearing the knees out of my jeans. I pushed myself until I reached the water.\u003c/p\u003e\n\u003cp\u003eYou must leave now, I heard a voice say from far away, and I started to weep again.\u003c/p\u003e\n\u003cp\u003e“Concussion,” I told myself. “Stay awake.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-72.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
