{"id":106650,"no":74,"title":"Page 74","content":"\u003cp\u003eI hurried home and changed into my work clothes—Nikes, blue jeans, white shirt with button-down collar, sport coat, and Beretta. I popped a couple of aspirins and installed myself in the office. I spread my notes across my desk—the ones I had addressed to Bobby Dunston and the others in the event of my sudden departure from this earth—and studied them as I sipped my coffee. Who killed Jamie Carlson Bruder? And Katherine Katzmark? And Napoleon Cook? And David Bruder? Why were the Family Boyz trying to kill me? So many questions. So few answers.\u003c/p\u003e\n\u003cp\u003eI put some Rolling Stones on the CD player and decided they were too distracting, I couldn’t concentrate. I replaced them with Bill Evans, whose mellow piano more closely fit my mood. I fired up my PC and searched the file on my hard drive. Nothing. I studied my notes some more. I played with the facts I had gathered, rolled them into a ball, bounced them on the floor and off the walls before smoothing them out again. After a couple of hours I realized that I kept coming back to the same thing. My business card. The one I had given Jamie. The one the Minneapolis cops found on Cook. How did he get it? Did Jamie give it to him? Why would she do that? Maybe she didn’t. I had left the card on the patio table. Jamie said that her husband was bringing a business associate home for drinks—around the pool! Maybe Cook found it there. Maybe he palmed it. Palmed it because it proved that Jamie was talking to someone she shouldn’t be …\u003c/p\u003e\n\u003cp\u003eA knock at the door. I was careful when I answered it. A courier with a special delivery. The courier was legit. I hid the gun behind my back as I signed for the package, an outsize envelope. I opened the envelope and found a hand-addressed, gilt-edged invitation to the Northern Lights Entrepreneur’s Club Ball. The names of the eight founding members were listed on the inside in alphabetical order. And at last, I understood.\u003c/p\u003e\n\u003cp\u003e“McKenzie, a pleasure to hear from you,” Charlotte Belloti said when she answered the telephone.\u003c/p\u003e\n\u003cp\u003e“I hope I’m not disturbing you.”\u003c/p\u003e\n\u003cp\u003e“No, but that certainly can be arranged.” Her giggle had a sort of sad ring to it this time around, or maybe it was the way I heard it. I wondered for a moment if Charlotte knew that her husband was cheating on her.\u003c/p\u003e\n\u003cp\u003e“As it turns out, I’m going to the Entrepreneur’s Ball after all. I was wondering if I would see you there.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll be there,” she told me.\u003c/p\u003e\n\u003cp\u003e“How about your husband? Is he still in Russia?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, I just spoke to him not ten minutes ago. He’s in Montreal with these ex-commie Russian capitalists—at least that’s what he calls them. He said he won’t be home until late, late, late tonight, sometime after the ball, anyway. So, you lucky dog, I’ll be all yours.”\u003c/p\u003e\n\u003cp\u003e“There’s a thought,” I said, and Charlotte giggled some more.\u003c/p\u003e\n\u003cp\u003eThirty minutes later I found Merci Cole. She was dressed in the same white and black outfit, sitting on the same stool at the same bar and conversing with the same bartender as the evening I had first met her. Only the ice in her rum and Coke was different.\u003c/p\u003e\n\u003cp\u003eShe swore between clenched teeth as I approached.\u003c/p\u003e\n\u003cp\u003e“What do you want?”\u003c/p\u003e\n\u003cp\u003e“You.”\u003c/p\u003e\n\u003cp\u003e“David’s dead.” Her tone accused me.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“You bastard.”\u003c/p\u003e\n\u003cp\u003e“Cut it out.”\u003c/p\u003e\n\u003cp\u003e“He went to you for help.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“Just keep away from me.”\u003c/p\u003e\n\u003cp\u003e“Stop it.”\u003c/p\u003e\n\u003cp\u003e“I said get away from me.”\u003c/p\u003e\n\u003cp\u003e“You heard the lady,” the bartender said.\u003c/p\u003e\n\u003cp\u003e“This is a private conversation, okay, pal?”\u003c/p\u003e\n\u003cp\u003e“Beat it, chump.”\u003c/p\u003e\n\u003cp\u003e“Don’t mess with me today,” I told him. “I’m in a real bad mood.”\u003c/p\u003e\n\u003cp\u003e“I got this for your mood.” He reached under the bar and came up with a miniature baseball bat, the kind the vendors hawk at the Metrodome during Twins games. I didn’t wait to see whose autograph was on it. I yanked the Beretta from its holster—I’d be damned if I’d let someone hit me again—and slapped it down hard on the bartop. The noise startled him. The bartender dropped the bat and backed away, waving his hands in front of him like he was saying no to a second helping of pie.\u003c/p\u003e\n\u003cp\u003eMerci stared at me, trembling with anger.\u003c/p\u003e\n\u003cp\u003e“I think I know who killed Jamie and David and all the others and I think I know why,” I told her. “I need you to help me put them on the spot.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“I’ll explain that later. Right now—look, you’re a businesswoman. You work for money. I’ll pay you one hundred dollars an hour. What time is it?” I looked for a clock. “Three-thirty? Start now and go until—call it midnight. Nine hundred bucks. Make it an even thousand. Plus, I’ll pay all expenses.”\u003c/p\u003e\n\u003cp\u003e“What expenses?”\u003c/p\u003e\n\u003cp\u003e“Gown, shoes, getting your hair done—we’ll have to hurry. We’re going to a fancy dress ball.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because that’s where the bad guys are. Are you in?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Merci said. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-74.html","bookId":2225,"creation":"Oct 5, 2019 11:01:26 PM","modification":"Oct 5, 2019 11:01:26 PM"}
