{"id":99521,"no":4,"title":"Page 4","content":"\u003cp\u003eHe hesitated, less sure now. “It was the sound of the Ulle’s voice, the way the elders stood apart from him as they watched us come down the hill.”\u003c/p\u003e\n\u003cp\u003eShe rose and brushed the hair back from his face. “You read the flow of power the way others chart tides,” she marveled. “It will make you a great leader.” He rolled his eyes at that. “Anything else?” she asked.\u003c/p\u003e\n\u003cp\u003e“This hut smells terrible.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “It’s animal fat,” she said. “Probably reindeer. The northerners use it in their lamps. It could be worse. Remember the swamp near Koba?”\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure that was just one smelly Heartrender.”\u003c/p\u003e\n\u003cp\u003eShe gave an exaggerated shudder at the memory. “So do you think you can bear it?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said firmly. He could tolerate anything if only they could spend a whole season in one place.\u003c/p\u003e\n\u003cp\u003e“Good.” She adjusted her silver furs, then pulled a heavy garnet ring from her pack and placed it on her finger. “Wish me luck at the meeting. Will you go exploring?”\u003c/p\u003e\n\u003cp\u003eHe nodded. He didn’t like the surge of nervousness that rose up in him, but there it was.\u003c/p\u003e\n\u003cp\u003eShe gave his chin a quick pinch. “Be careful. Don’t let anyone—”\u003c/p\u003e\n\u003cp\u003e“I know.” The Cut wasn’t the only secret they kept.\u003c/p\u003e\n\u003cp\u003e“Just until you’re strong enough,” she cautioned. “Until you learn to defend yourself. And remember you’re—”\u003c/p\u003e\n\u003cp\u003e“Eryk,” he said. “I know. It’s my own name I’m afraid of forgetting.”\u003c/p\u003e\n\u003cp\u003e“Your true name is written here,” she said tapping his chest. “Tattooed on your heart. You don’t let just anyone read it.”\u003c/p\u003e\n\u003cp\u003eHe shifted uncomfortably. “I know.”\u003c/p\u003e\n\u003cp\u003e“I know, I know,” she mimicked. “You sound like a crow cawing.” She gave him a little shove. “Be back before dark.”\u003c/p\u003e\n\u003cp\u003eThe world outside seemed too bright after the dim clutch of the hut. Eryk squinted against the glare and watched his mother head toward the long hall, then made his way into the forest. These were the trees he liked best, the kind that never lost their green, that always smelled of sap. In woods like these, it felt like summer was still alive, as if a sun were buried in every rough trunk like a warm, dormant heart.\u003c/p\u003e\n\u003cp\u003eHe walked north of the camp, following the slope of the hill, but as the trees began to thin, he hesitated. He could hear laughter and see a clearing a little farther on. He made himself plunge ahead.\u003c/p\u003e\n\u003cp\u003eTwo girls were playing on the banks of a stream. They both had light hair and blue eyes, the Fjerdan coloring that was common close to the border.\u003c/p\u003e\n\u003cp\u003e“Careful, Sylvi!” shouted the older girl as the other hopped from rock to rock, giggling. They both fell silent when they noticed Eryk.\u003c/p\u003e\n\u003cp\u003e“Hello,” he offered, then tried, “Ajor” in Fjerdan.\u003c/p\u003e\n\u003cp\u003e“We speak Ravkan,” said the taller girl, though she had that Fjerdan lilt to her voice. She looked like she was Eryk’s age, maybe a little older. “Sylvi, stop that. Get back here.”\u003c/p\u003e\n\u003cp\u003e“No!” shrieked the younger girl happily, and launched herself into another hop over the rushing water. “Watch me, Annika!”\u003c/p\u003e\n\u003cp\u003eEryk walked a little way upstream to where he could study the water playing in the rapids and sat down on a rock. He picked up a stick and let the tip drift in the water, feeling the tug of the current, waiting. They would approach him. They always did. But he felt more anxious than usual. He’d stopped trying to make friends in the places he and his mother visited—there was no point when they moved on so quickly. Now he wasn’t quite sure how to go about it.\u003c/p\u003e\n\u003cp\u003eA few minutes later, out of the corner of his eye, he saw Sylvi hopping toward him.\u003c/p\u003e\n\u003cp\u003e“Are you Lena’s son?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“You can do that thing? The same thing she can?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Can I see?” Sylvi asked.\u003c/p\u003e\n\u003cp\u003eThey started curious, but they usually ended up afraid.\u003c/p\u003e\n\u003cp\u003e“Don’t be rude, Sylvi,” chastised Annika.\u003c/p\u003e\n\u003cp\u003eSylvi kicked a chunk of earth into the stream. “I want to see.”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” said Eryk. He might as well get it over with. He lifted his hand and drew a circle of darkness in the air. It twisted and curled, its tendrils tugging at the sunlight before they faded.\u003c/p\u003e\n\u003cp\u003e“Again,” said Sylvi.\u003c/p\u003e\n\u003cp\u003eHe smiled a little and repeated the gesture. He let the circle roll toward Sylvi. She poked her fingers through it and watched as her fingertips vanished. She shrieked and pulled her hand back.\u003c/p\u003e\n\u003cp\u003e“Annika, come try!”\u003c/p\u003e\n\u003cp\u003e“Leave him alone, Sylvi.”\u003c/p\u003e\n\u003cp\u003e“What’s your name?” Sylvi asked.\u003c/p\u003e\n\u003cp\u003e“Arkady,” he said. When she frowned, he amended, “Eryk.”\u003c/p\u003e\n\u003cp\u003e“I don’t like that name.”\u003c/p\u003e\n\u003cp\u003e“Me neither.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you change it?”\u003c/p\u003e\n\u003cp\u003e“Maybe I will.”\u003c/p\u003e\n\u003cp\u003e“Do the thing again.”\u003c/p\u003e\n\u003cp\u003e“Stop pestering him, Sylvi.”\u003c/p\u003e\n\u003cp\u003eHe created another circle but this time made it spiral larger. Annika left off any pretense of mucking around in the stream and stared. He fashioned the darkness into a disk that floated beside the rapids like a black door that might lead anywhere. Sylvi stepped toward it.\u003c/p\u003e\n\u003cp\u003e“Sylvi, don’t!” Annika shouted.\u003c/p\u003e\n\u003cp\u003eThe little girl vanished into the black. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-demon-in-the-wood-the-grisha-0-1/page-4.html","bookId":2010,"creation":"Oct 5, 2019 6:44:59 PM","modification":"Oct 5, 2019 6:44:59 PM"}
