{"id":99525,"no":8,"title":"Page 8","content":"\u003cp\u003e“What was your mother like?” he asked. The question felt strange on his lips, and he wasn’t sure it was the right one to ask.\u003c/p\u003e\n\u003cp\u003eShe stirred the surface of the water with her fingertips and said, “Gentle. She used to sing us to sleep. I told her I was too old for lullabies. I regret that every night now.”\u003c/p\u003e\n\u003cp\u003eEryk stayed quiet. This was the time to say something about his father, fallen in battle. But living or dead, he had no memories of the man to share.\u003c/p\u003e\n\u003cp\u003e“The witchhunters had these horses,” Annika said, her face tilted up to the night sky. “I know I was scared, but I swear they were big as houses.”\u003c/p\u003e\n\u003cp\u003e“They do have special breeds of horses for the drüskelle.”\u003c/p\u003e\n\u003cp\u003e“They do?”\u003c/p\u003e\n\u003cp\u003eHe had to be cautious about revealing where he’d been or what he’d learned, but this felt safe enough. “They’re bred for size and demeanor. They don’t spook at fire or storms. Perfect for battle against Grisha.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t a battle. It wasn’t even a fight. My father couldn’t protect us.”\u003c/p\u003e\n\u003cp\u003e“He got you and Sylvi away safely.”\u003c/p\u003e\n\u003cp\u003e“I guess.” She kicked off toward shore. “I’m going to dive!”\u003c/p\u003e\n\u003cp\u003e“Are you sure it’s deep enough?”\u003c/p\u003e\n\u003cp\u003e“I do it all the time.” She clambered out of the pond, wringing water from her shift, and scaled one of the boulders bordering the shore.\u003c/p\u003e\n\u003cp\u003e“Careful!” he called. He wasn’t sure why. Maybe his mother’s overprotectiveness was rubbing off on him.\u003c/p\u003e\n\u003cp\u003eShe raised her hands, preparing to launch herself into the water, then paused.\u003c/p\u003e\n\u003cp\u003eEryk shivered; maybe the water wasn’t as warm as he thought. “What are you waiting for?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” she said, hands still held out.\u003c/p\u003e\n\u003cp\u003eA chill passed through him. It was then that he realized he could barely move his arms. He tried to lift his hands, but it was too late. The water felt thick around him. It was hardening to ice.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” he asked, hoping this was some kind of game, a joke. Eryk started to tremble, his heart pounding a panicked beat as his body went cold. He could still move his legs, just barely scrape the muddy bottom of the pond with his frantically kicking toes, but his chest and his arms were held motionless, the ice pressing in around him. “Annika?”\u003c/p\u003e\n\u003cp\u003eShe had climbed down from the boulder and was picking her way carefully over the frozen pond. She was shaking, her feet still bare, her shift drenched and clinging to her skin. She had a rock in her hands.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she said. Her teeth were chattering, but her face was determined. “I need an amplifier.”\u003c/p\u003e\n\u003cp\u003e“Annika—”\u003c/p\u003e\n\u003cp\u003e“The elders would never let me hunt one. They’d give it to a powerful Grisha like Lev or his father.”\u003c/p\u003e\n\u003cp\u003e“Annika, listen to me—”\u003c/p\u003e\n\u003cp\u003e“My father can’t protect us.”\u003c/p\u003e\n\u003cp\u003e“I can protect you. We’re friends.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “We’re lucky they even let us stay here.”\u003c/p\u003e\n\u003cp\u003e“What are you doing, Annika?” he pleaded, though he knew well enough.\u003c/p\u003e\n\u003cp\u003e“Yes, what are you doing, Annika?”\u003c/p\u003e\n\u003cp\u003eHe turned his head as best he could. Lev was standing on the far shore.\u003c/p\u003e\n\u003cp\u003e“Go away!” she shouted.\u003c/p\u003e\n\u003cp\u003e“That little freak and I have unfinished business. So do you and I, for that matter.”\u003c/p\u003e\n\u003cp\u003e“Go back to camp, Lev.”\u003c/p\u003e\n\u003cp\u003e“Are you giving me orders?”\u003c/p\u003e\n\u003cp\u003eShe ignored him, moving across the ice. It creaked underneath her feet. Annika was right: she wasn’t strong. She’d been unable to freeze the ice through.\u003c/p\u003e\n\u003cp\u003e“Do it, Annika,” Eryk said, loudly. “If I’m going to die, I don’t want Lev using my power.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” said Lev, putting a tentative foot on the icy surface of the pond.\u003c/p\u003e\n\u003cp\u003e“Be quiet,” Annika whispered furiously.\u003c/p\u003e\n\u003cp\u003e“I’m an amplifier. And once Annika wears my bones, you won’t be able to push her or her sister around anymore.”\u003c/p\u003e\n\u003cp\u003e“Shut up,” she screamed.\u003c/p\u003e\n\u003cp\u003eEryk saw understanding dawn on Lev’s face, and in the next minute, he was sprinting across the ice. It cracked beneath Lev’s bulk. Closer, Eryk urged silently, but Annika was already upon him.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she moaned. “I’m so sorry.” She was crying as she brought the rock down on his head.\u003c/p\u003e\n\u003cp\u003ePain exploded over his right temple, and his vision blurred. Don’t faint. He gave his head a shake despite the tide of pain that came with it. He saw Annika lifting the rock again. It was wet with his blood.\u003c/p\u003e\n\u003cp\u003eA gust of air struck her, sending her sliding back over the ice.\u003c/p\u003e\n\u003cp\u003e“No!” she cried. “He’s mine!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-demon-in-the-wood-the-grisha-0-1/page-8.html","bookId":2010,"creation":"Oct 5, 2019 6:44:59 PM","modification":"Oct 5, 2019 6:44:59 PM"}
