{"id":76532,"no":10,"title":"Page 10","content":"\u003cp\u003eHe looked surprised by my proffered hand, reached for it, then almost immediately pulled back. \"Navarre?\"\u003c/p\u003e\n\u003cp\u003e\"As in Garrett Navarre of Techsan Software,\" Maia said. \"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eMaia had slipped into her professional tone, the one she used for reluctant witnesses—putting them at ease, reassuring them, letting them know she was a friend.\u003c/p\u003e\n\u003cp\u003eHer tone didn\u0027t seem to work too well on Dwight.\u003c/p\u003e\n\u003cp\u003e\"Not again,\" he moaned. \"You\u0027re here about—\"\u003c/p\u003e\n\u003cp\u003e\"About Jimmy Doebler\u0027s murder,\" Maia supplied. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Then Matthew did call you.\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m afraid Mr. Pena will need different representation this time. How\u0027s he been treating you, Dwight?\"\u003c/p\u003e\n\u003cp\u003eHayes looked miserable. He unzipped his wet suit to the waist, peeled his arms out of the sleeves. The warm neoprene let off its unmistakable smell.\u003c/p\u003e\n\u003cp\u003eIf car tires had armpits, they would smell like that.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t—\" He faltered. He made a claw over his nose and mouth, pantomiming an oxygen mask. \"I have no control down there. I panic. He asks me to clear my mask, twenty feet down, and the water rushes into my nose—I forget how to breathe.\"\u003c/p\u003e\n\u003cp\u003eI could tell Maia was fighting to keep the professional demeanour intact, trying not to betray her own phobia.\u003c/p\u003e\n\u003cp\u003e\"It takes a few tries,\" she sympathized.\u003c/p\u003e\n\u003cp\u003eHayes shook his head dejectedly. \"You don\u0027t get it. This is the third time. He makes me keep trying—embarrassing myself in front of clients. Matthew enjoys seeing me panic.\u003c/p\u003e\n\u003cp\u003eHe enjoys it.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like the conversations we had in San Francisco, Dwight. Do you remember?\"\u003c/p\u003e\n\u003cp\u003eHe blushed. \"Maia, I shouldn\u0027t even talk to you. I could get fired.\"\u003c/p\u003e\n\u003cp\u003e\"Then maybe we should talk to Pena directly,\" I suggested.\u003c/p\u003e\n\u003cp\u003eHayes gave me the apprehensive poodle eyes, then he pointed over the edge of the cliff, down toward the water. \"Blue flag.\"\u003c/p\u003e\n\u003cp\u003eThe lake was calm—no speedboats in the channel. A hundred feet out, buoys marked off the diving area. Bubbles of submerged divers made glassy scars on the water.\u003c/p\u003e\n\u003cp\u003eAbout twenty feet from the shore, three bubble marks were stationary, right next to a blue donutshaped marker.\u003c/p\u003e\n\u003cp\u003e\"How long have they been down there?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Not long,\" Hayes said. \"I panicked right away on this dive. They\u0027ll be down another forty minutes, at least.\"\u003c/p\u003e\n\u003cp\u003e\"Tres ...\" Maia started. Her fair warning tone.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re about the same size,\" I told Dwight. \"Mind if I borrow your gear?\"\u003c/p\u003e\n\u003cp\u003e\"No, Tres,\" Maia said. \"We can wait.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pay the rental for it. You\u0027ll recoup your losses. Think how glad Matthew will be to see me.\"\u003c/p\u003e\n\u003cp\u003eDwight looked stunned. Then he surprised me, maybe surprised himself, with a faint, queasy smile. His eyes glimmered with a kind of mischief he probably didn\u0027t get to practice much. \"I\u0027m going to regret this. Take the stuff.\"\u003c/p\u003e\n\u003cp\u003e\"You are not going into the water,\" Maia insisted.\u003c/p\u003e\n\u003cp\u003eI checked the pressure gauge on Dwight Hayes\u0027 tank, found that it was just below max at 3,000 psi. \"You want to come, Maia? By all means. We\u0027re a team, right?\"\u003c/p\u003e\n\u003cp\u003eHer face turned livid. \"You haven\u0027t become less of a bastard the last two years, Tres Navarre.\"\u003c/p\u003e\n\u003cp\u003eShe turned and stormed off, realized she was heading toward a deadend cliff, strode the other way, down the road.\u003c/p\u003e\n\u003cp\u003eIt isn\u0027t often I get to discombobulate her so thoroughly. I had to smile.\u003c/p\u003e\n\u003cp\u003e\"Oh, Christ,\" Dwight said. \"I shouldn\u0027t have—\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry,\" I told him. \"She just hates it when I get to have all the fun.\"\u003c/p\u003e\n\u003cp\u003eThen I stripped to my Texasflag jockey shorts right there in front of God and everybody.\u003c/p\u003e\n\u003cp\u003eFive minutes and thirty pounds later, I was suited up. Dwight\u0027s buoyancy compensator—the inflatable vest divers call the BC—was a little tight on me, but everything else fit tolerably well. The lead weights on the belt thudded against my hipbone on the way down the ladder.\u003c/p\u003e\n\u003cp\u003eIt was a relief to hit the water and go weightless, feel the coolness work its way under the wet suit. I floated away from the ladder, the BC inflated to keep me up, and struggled to get the fins on over the neoprene booties. The water smelled of soil and fish spawn and oily slicks of the baby shampoo divers use to defog their masks.\u003c/p\u003e\n\u003cp\u003eFrom the top of the cliff, Dwight Hayes watched me as I kicked toward the blue floating marker.\u003c/p\u003e\n\u003cp\u003eI put in the regulator mouthpiece, sucked in a first dry, cold breath, then raised the deflator hose of the BC and let out the air.\u003c/p\u003e\n\u003cp\u003eI had a moment of disorientation as the world flickered white, melted in a soup of green bubbles. Then I was underwater, sinking slowly.\u003c/p\u003e\n\u003cp\u003eSound became a physical force—an insect doing circles around my head, making kamikaze runs into my ears. Every exhale set off a minor earthquake of bubbles. I heard pings and clicks and whines and had no idea where any of them were coming from.\u003c/p\u003e\n\u003cp\u003eI pinched the nose pocket of my mask to equalize pressure. I remembered to breathe, to swallow the powdery coldness of the regulator air out of my throat. The skills came back to me—but Dwight\u003c/p\u003e\n\u003cp\u003eHayes was right. It was unsettling. My breakfast had been mercifully light, but even the yogurt and fruit was threatening to retreat up my throat.\u003c/p\u003e\n\u003cp\u003eI sank through green and yellow light, following the frayed nylon rope of the marker into the murk below. There was about five feet of visibility.\u003c/p\u003e\n\u003cp\u003eI saw bubble streams below me first, then the figures from which they came. Three streaks of oil resolved into human forms. A silver sheen became a floating underwater platform—a railed grid of metal maybe fifteen feet square. Two divers were on their knees on the platform, feeding hot dogs to a frenzy of Guadalupe river bass and catfish. The third diver was floating effortlessly above them, observing. The water around them was cloudy with fish poop, and pieces of hot dog that would soon be converted to fish poop.\u003c/p\u003e\n\u003cp\u003eI turned horizontal, aimed my fins, and kicked toward the floating guy. Anybody who could float must be the instructor.\u003c/p\u003e\n\u003cp\u003eHe was dressed in a Farmer John style wet suit—sleeveless, Uneck. The highlight stripes on the suit were blue, as was his mask frame and the middle of each fin. Even his tank was blue. His arms and neck were smoothly muscled, the rest of his body lean, athletic. His hair was a short black cloud that moved in the water the way smoke boils over a petroleum fire. His hands were clasped lightly over his weight belt and his legs pigeoned, scissoring gently whenever he needed to correct buoyancy.\u003c/p\u003e\n\u003cp\u003eWhen he noticed me he raised his hand—either as a greeting or a sign to stop, I couldn\u0027t tell which.\u003c/p\u003e\n\u003cp\u003eI looked at the blue man\u0027s two companions, gave them the okay sign. Each returned it.\u003c/p\u003e\n\u003cp\u003eI pointed at them, then at the platform, telling them to stay put.\u003c/p\u003e\n\u003cp\u003eI looked at the blue man.\u003c/p\u003e\n\u003cp\u003eBehind the mouthpiece of his regulator, I could see he had a moustache and goatee.\u003c/p\u003e\n\u003cp\u003eHis skin looked extraordinarily sallow, but that may have been a trick of the water. His eyes were preternaturally clear in the mask\u0027s pocket of air—milkwhite corneas, pupils the colour of burnt wood, calm to the point of being scary.\u003c/p\u003e\n\u003cp\u003eHe pointed at my chest, then pointed away.\u003c/p\u003e\n\u003cp\u003eI gestured for the message slate hanging on his belt.\u003c/p\u003e\n\u003cp\u003eAfter a moment\u0027s hesitation, he handed it over. I put the black grease pen to the white surface and wrote, Maia sez hello.\u003c/p\u003e\n\u003cp\u003eHe took the board, read it, then hesitated, the tip of the pen over it, as if he was considering his next move in tictactoe. He crossed out my sentence, wrote, handed it back.\u003c/p\u003e\n\u003cp\u003eCLASS —GO away!\u003c/p\u003e\n\u003cp\u003eMy knee bounced lightly against the platform. I tilted off balance like a Ferris wheel basket. I groped for the inflate button on the BC hose, sent a burst of air from the tank into the vest until I neutralized. Matthew Pena just floated there, analyzing me.\u003c/p\u003e\n\u003cp\u003eI regained enough control to use the message board, then wrote, 5 minutes—Jimmy D insists.\u003c/p\u003e\n\u003cp\u003eMatthew Pena read, wiped the board clean, clipped it back in his belt. He pointed at his two students, tapped his pressure gauge console. Both checked their own gauges.\u003c/p\u003e\n\u003cp\u003eEach made finger numbers to indicate they had about 2,000 psi left. Pena gestured, Okay. Wait here.\u003c/p\u003e\n\u003cp\u003eThen he pointed to me and pointed over his shoulder.\u003c/p\u003e\n\u003cp\u003eHe kicked off into the green murk.\u003c/p\u003e\n\u003cp\u003eI followed.\u003c/p\u003e\n\u003cp\u003eDistance was hard to measure, but we sank down to about thirty feet, headed what I judged to be north, along the shore. I had to equalize my ears again. A catfish the size of my forearm flicked by. Giant boulders made a wall to our right. The bottom was furry with tan sediment—nature\u0027s shag carpeting.\u003c/p\u003e\n\u003cp\u003eAfter about twelve kick cycles, a new shape resolved on the lake bottom—a welded metal sculpture of a diver, canted down at forty five degrees. His limbs and body were sixinch pipes, his mask and fins 2D sheets of steel. Apparently he was a major attraction at Windy Point. He\u0027d been decorated with three different sets of sexy lingerie. A lacy purple bra floated off one of his fins.\u003c/p\u003e\n\u003cp\u003eIt was as good a place as any for a conference with Matthew Pena. Then I looked over and realized I didn\u0027t know where Matthew Pena was. He\u0027d disappeared—a ridiculously easy task underwater, where peripheral vision is nil.\u003c/p\u003e\n\u003cp\u003eI turned my head the other way, then heard a squeaksqueak squeak that seemed to come from inside my skull. It wasn\u0027t until my next inhale proved hard to pull that I realized Matthew Pena had come up behind me and turned off my air.\u003c/p\u003e\n\u003cp\u003eI rotated faceup. Sure enough, Pena was floating above me. His burnt eyes weren\u0027t gloating, weren\u0027t smiling. They were just\u003c/p\u003e\n\u003cp\u003eobserving, the way a fish observes—impartially looking for something smaller to devour.\u003c/p\u003e\n\u003cp\u003eMy next inhale was a wall—nothing came into my lungs.\u003c/p\u003e\n\u003cp\u003eMatthew Pena tapped his fingers to his palm in a little byebye wave.\u003c/p\u003e\n\u003cp\u003eThe first rule of diving: Don\u0027t panic. I knew that. But rules take on a new dimension when you\u0027re thirty feet under with no air. A more experienced diver might\u0027ve gambled on getting to the valve of his tank without panicking, without getting tangled in his own equipment. I knew I needed a simpler alternative.\u003c/p\u003e\n\u003cp\u003eI kept exhaling—kept the little trail of bubbles coming out of my mouth, even though I knew there was nothing to replace them with.\u003c/p\u003e\n\u003cp\u003eThen I reached over, grabbed Matthew Pena\u0027s mask and ripped it off his face. The snorkel came with it.\u003c/p\u003e\n\u003cp\u003ePena protested with an explosion of white bubbles, grabbed after the mask.\u003c/p\u003e\n\u003cp\u003eI left him blinking in the green, his vision reduced to smudges. Then I kicked for the surface, holding the BC hose up and keeping my other hand on the weight belt, one finger still hooked on Pena\u0027s mask and snorkel.\u003c/p\u003e\n\u003cp\u003eI tried to avoid kicking up too fast, even though my lungs told me I was dying. The pain was unbearable when the water turned silver and the top shimmered like sun on aluminium foil, but I still wasn\u0027t to the surface. A thousand decades later, I broke through and gasped, then found my head underwater again. I used my exhale to manually inflate the BC, kicked to the surface again, got another gasp, went under, repeated the inflation process until I was buoyant.\u003c/p\u003e\n\u003cp\u003eI floated on the surface, breathing hard.\u003c/p\u003e\n\u003cp\u003eNo problem. Just a little thirtyfootunder chat with a suspect. A little neardeath experience.\u003c/p\u003e\n\u003cp\u003eGreat plan, Navarre.\u003c/p\u003e\n\u003cp\u003eI put my snorkel in, went down headfirst, and started fumbling around behind me for the Kvalve. I soon realized I\u0027d have to free up both hands to accomplish the task. I pitched Matthew Pena\u0027s mask and snorkel out toward the boating channel, then put my face back underwater, found the Kvalve, turned on the air. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-10.html","bookId":2419,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
