{"id":76544,"no":15,"title":"Page 15","content":"\u003cp\u003eFinally, Maia and Garrett appeared in the doorway of the club. Maia helped Garrett pop a wheelie, then bump his way down the front steps to the sidewalk.\u003c/p\u003e\n\u003cp\u003eI told them I was taking Dwight home.\u003c/p\u003e\n\u003cp\u003eMaia took the news about as well as I had expected. She looked like she wanted to kill me, then like she wanted to throw up, then she gave in.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to my hotel,\" said Maia. \"I\u0027m going to eat, take the longest bath in history, and then sleep. And Tres—just take Dwight home. All right? No weapons. No interrogations. No humorous excursions. Please?\"\u003c/p\u003e\n\u003cp\u003e\"Trust me,\" I said.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, muttered some bitter ancient curse, and then walked toward the taxi stand.\u003c/p\u003e\n\u003cp\u003eI looked at Garrett, who seemed in a somewhat better mood now, no doubt thanks to the drubbing recently inflicted on Matthew Pena, Inc. \"What\u0027s your plan?\"\u003c/p\u003e\n\u003cp\u003e\"My plan,\" he said, \"is tequila shots on Sixth Street. The Iron Cactus. Pick me up on your way back.\"\u003c/p\u003e\n\u003cp\u003e\"And then?\"\u003c/p\u003e\n\u003cp\u003e\"And then, just maybe, I\u0027ll be ready for Ruby.\"\u003c/p\u003e\n\u003cp\u003eApprovedBy:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ XMSMailPriority: Normal XMailer: Microsoft Outlook IMO, Build 9.0.2416 (9.0.2910.0) Date: Sun 11 Jun 2000 17:14:20 0012\u003c/p\u003e\n\u003cp\u003eReplyTo:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eSender: \"A free newsletter from info.com\"\u003c/p\u003e\n\u003cp\u003eFrom: \u0026lt;\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ \u0026gt;\u003c/p\u003e\n\u003cp\u003eSubject: whitetail season\u003c/p\u003e\n\u003cp\u003eTo: gn I @rni.com\u003c/p\u003e\n\u003cp\u003eI can only go by what she\u0027s told me, but she\u0027s told me so much— more than she realizes.\u003c/p\u003e\n\u003cp\u003eI imagine a girl of fourteen.\u003c/p\u003e\n\u003cp\u003eShe\u0027s too tall for the boys, developed, impossible to miss with her long hair, her brilliant eyes, her temper. She is so physical, so sexual, that she intimidates her peers, and yet she tries to imitate them as best she can. She studies fashion the way she studies calculus. She wears the right jeans, the right designer tops and shoes. This just sets her apart even more. She has never had a date, or a best friend. Since she turned twelve, she has learned to endure the looks grown men give her—comments from her father\u0027s workers at the dock, bits of Spanish they think she doesn\u0027t understand.\u003c/p\u003e\n\u003cp\u003eShe understands.\u003c/p\u003e\n\u003cp\u003eHer discomfort makes her more stubborn, more determined to look mature and feign confidence.\u003c/p\u003e\n\u003cp\u003eI imagine this girl on a November afternoon at the top of a hill, in the woods, the lake spread out below her, glittering in the long winter light. Today she is not fashionable.\u003c/p\u003e\n\u003cp\u003eShe is wearing a pair of boys\u0027 Wranglers, a longsleeve Tshirt, hiking boots, an orange down vest. She is not worried about how she looks now. She is with the one man she is not afraid of.\u003c/p\u003e\n\u003cp\u003eThe air is cold enough to let steam escape from the cavity of the whitetail deer she and her father are field dressing.\u003c/p\u003e\n\u003cp\u003eShe thinks of it as a joint effort. In fact, she does all the work, while her father stands nearby, drinking from a thermos, watching the lake.\u003c/p\u003e\n\u003cp\u003eHe has green eyes, like hers, but they are cloudy, troubled. His hair has thinned over the years to a weak shade of pumpkin. His features are angular, like the eroded ridges of a chewed cuttlebone. She thinks of him as tall and strong, but he has already started his decline. The smoking and drinking, the bouts of depression—all this has begun to take its toll.\u003c/p\u003e\n\u003cp\u003eShe cuts the connecting tissue from the liver of the deer, holds the organ in her gloved hands—a heavy thing, milky black like petroleum, quivering as if it still held life. She checks for disease spots. Finding none, she sets the liver on ice along with the heart.\u003c/p\u003e\n\u003cp\u003eHer father always insists on this—save the heart. Save the liver.\u003c/p\u003e\n\u003cp\u003eShe tells him that the liver is healthy, hoping this will please him, but he just stares at the lake. She wishes his thermos held coffee, but she knows it is whiskey with lemon and sugar.\u003c/p\u003e\n\u003cp\u003eHer job done—the entrails scooped out, the carcass cleaned with fresh water—she wedges a stick into the deer\u0027s empty chest to keep the rib cage apart.\u003c/p\u003e\n\u003cp\u003eHer gloves are sticky with blood, but she doesn\u0027t mind the work—the cutting, the cleaning. There is something satisfying about seeing the mess, the chaos of organs—and slowly cleaning it out, tying off the tubes, avoiding spills that could spoil the meat, sorting the innards, leaving a clean and empty shell, neatly framed by the symmetry of ribs.\u003c/p\u003e\n\u003cp\u003e\"Would you like me to clean your doe?\" she volunteers.\u003c/p\u003e\n\u003cp\u003eHer smile is sincere. She hopes for a smile in return. She has been so efficient—learned everything he taught her, done everything to make him proud.\u003c/p\u003e\n\u003cp\u003eShe recalls the time when she was about eight, going with her father to Crumley\u0027s Store. He had ruffled her hair, told his friends that he needed no son, that he had his best hunting buddy right here. She protects that memory—drinks from it when she\u0027s thirsty, keeps her hands cupped around it like an exposed pilot light.\u003c/p\u003e\n\u003cp\u003eNow, her father is not five feet away from her—wearing the hunting parka she bought him for his birthday, tattered jeans, the deer rifle he has had as long as she can remember, even before her mother died.\u003c/p\u003e\n\u003cp\u003eIt takes him several minutes just to remember she is there. He has been watching the waterline, as if suspecting that even now, so many years later, the lake is rising, eroding what is left of his inheritance. Only recently, a third business failed on his property— another lessee defaulting on their contract. What little money he has invested in stocks is doing poorly. He doesn\u0027t share the worst of this with his daughter—not yet—but she knows something is wrong. She knows the lake is sapping his life.\u003c/p\u003e\n\u003cp\u003eAt last he says, \"I\u0027m sorry, sweetheart.\"\u003c/p\u003e\n\u003cp\u003eAnd he looks as if he wishes to say something more, but his voice dissipates as quickly as the steam from his mouth.\u003c/p\u003e\n\u003cp\u003eShe remembers that brief moment of clarity in his eyes, twenty minutes before, when he aimed the gun, brought down the doe with a single wellplaced shot. She wishes there were another whitetail deer to kill.\u003c/p\u003e\n\u003cp\u003eHer buck is a much greater trophy, but she is willing to field dress his doe as well. She wants to be shoulder to shoulder with her father in the work, touch his hands, smell his breath, even if it reeks of whiskey.\u003c/p\u003e\n\u003cp\u003eInstead, he sets his gun against the tree. He kneels, grasps a handful of dry leaves and cedar nettles, lets them slip through his fingers. There, at the highest point of their property, at a place where the food can never touch, he seems to be praying, and she knows instinctively that whatever his prayer, it will not be answered. Fourteen years on the lake have taught her to expect that.\u003c/p\u003e\n\u003cp\u003eSo she cleans her knife blade—the sharp steel, four inches, well weighted. She goes to the doe and turns it belly up, feels along the white fur until she finds the point for incision below the sternum.\u003c/p\u003e\n\u003cp\u003eShe makes the cut as her father once showed her—inserting her fingers under the skin, making a V, cutting with the blade up, being careful not to puncture the intestines.\u003c/p\u003e\n\u003cp\u003eShe can tell the doe was nursing, and she knows she must remove the mammary organs right away. Milk goes bad quickly. Nothing will spoil the taste of the meat worse than that.\u003c/p\u003e\n\u003cp\u003eShe works with the knife, trying to be hopeful, trying to believe that she is drawing closer to her father, that he is not slipping away, becoming less and less present the more deer tissue she slices through.\u003c/p\u003e\n\u003cp\u003eShe ignores the smell and the blood. She cuts away the mess— lets the offal spill out, prepares her father\u0027s doe lovingly.\u003c/p\u003e\n\u003cp\u003eAnd the less he pays attention, the more meticulous she is, the more she needs the knife and the wellmade incision, the liver without spots, the heart cut away and drained of blood.\u003c/p\u003e\n\u003cp\u003eImagine her on that hill, and you will realize why she treats men as she does. Her affections were cut away long ago, examined for impurities and set on ice, claimed at the point of a hunting knife.\u003c/p\u003e\n\u003cp\u003eCHAPTER 13\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t talk to you,\" Dwight Hayes said.\u003c/p\u003e\n\u003cp\u003eHe\u0027d already helped himself to one lukewarm bottle of beer from the sixpack on the floor of my truck, and was starting on his second.\u003c/p\u003e\n\u003cp\u003e\"Of course you can\u0027t,\" I said. \"Which way on 135?\"\u003c/p\u003e\n\u003cp\u003e\"North.\"\u003c/p\u003e\n\u003cp\u003eWe did a U on San Gabriel, went under the highway, took the entrance ramp. I said,\u003c/p\u003e\n\u003cp\u003e\"What was your little disagreement with Pena?\"\u003c/p\u003e\n\u003cp\u003eOne street lamp went by. Two. We passed the UT campus on the left, the Longhorn stadium lit up for an event.\u003c/p\u003e\n\u003cp\u003e\"Bastard hit me,\" he said. \"He hit me.\"\u003c/p\u003e\n\u003cp\u003e\"Relax. You\u0027re in better company now.\"\u003c/p\u003e\n\u003cp\u003eDwight was silent for a few hundred street lamps. \"Is it true what Miss Lee said about—you and her?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. What did Miss Lee say?\"\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" he decided.\u003c/p\u003e\n\u003cp\u003eWe kept driving. Dwight directed me east on Highway 290.\u003c/p\u003e\n\u003cp\u003e\"How long have you worked for Pena?\" I asked.\u003c/p\u003e\n\u003cp\u003eHis eyes were heavylidded from all the beer, irritated, as if I\u0027d just woken him up.\u003c/p\u003e\n\u003cp\u003e\"Forever. I\u0027m his technical adviser.\"\u003c/p\u003e\n\u003cp\u003e\"I take it you\u0027re not talking about scuba gear.\"\u003c/p\u003e\n\u003cp\u003e\"I sniff out the most promising software startups. I look for market potential, point him in the right direction.\"\u003c/p\u003e\n\u003cp\u003e\"Like the startup in Menlo Park. Like Techsan.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me, miserable. If guilt had a smell, it was permeating the truck.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve seen what happens to the people Pena attacks,\" I guessed. \"The people you sicced him on. Over and over.\"\u003c/p\u003e\n\u003cp\u003e\"You want to kick me out?\" he asked. \"It\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eUnlit subdivisions went by, closedup malls, empty fields.\u003c/p\u003e\n\u003cp\u003e\"Maia Lee is right,\" I suggested. \"She\u0027s a good person. You should think about talking with her, Dwight.\"\u003c/p\u003e\n\u003cp\u003eIt was too dark to see his face.\u003c/p\u003e\n\u003cp\u003e\"I thought Techsan would be different,\" he said. \"There was no reason . . . Ruby and Matthew got along so well at first.\"\u003c/p\u003e\n\u003cp\u003e\"Got along how, exactly?\"\u003c/p\u003e\n\u003cp\u003e\"Ruby was the one Matthew approached, back in March. She took him diving out on the lake. They seemed to like each other, came to some kind of agreement in principle.\u003c/p\u003e\n\u003cp\u003eI thought—the program was solid. The algorithms were excellent. I thought Matthew would make them a fair offer, make an easy buy.\"\u003c/p\u003e\n\u003cp\u003e\"But your employer doesn\u0027t enjoy easy buys.\"\u003c/p\u003e\n\u003cp\u003eAnother mile of darkness. Dwight pointed ahead to a blinking yellow light, told me to take that exit.\u003c/p\u003e\n\u003cp\u003e\"You were with Pena the night Adrienne Selak drowned,\" I said. \"I suppose you can\u0027t talk about that either.\"\u003c/p\u003e\n\u003cp\u003e\"She was nice. She was good for Matthew. I don\u0027t think— He wouldn\u0027t have killed her.\u003c/p\u003e\n\u003cp\u003eNo way.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think. I thought you saw Adrienne Selak fall. You made a statement on Pena\u0027s behalf.\"\u003c/p\u003e\n\u003cp\u003e\"I meant— He never would have hurt her.\"\u003c/p\u003e\n\u003cp\u003e\"You sure that\u0027s what you meant?\"\u003c/p\u003e\n\u003cp\u003eDwight let my question die in the air.\u003c/p\u003e\n\u003cp\u003eWe ended up in an aging subdivision of northeast Austin, just south of 290. The houses were 1970s prefab, the lawns all gone to crabgrass. It was the kind of neighbourhood that looked best at night, which is exactly the time the local police would tell you not to go there.\u003c/p\u003e\n\u003cp\u003eDwight drank his lukewarm beer, told me where to turn.\u003c/p\u003e\n\u003cp\u003e\"The police talk to you about Jimmy Doebler?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"A detective came to Pena\u0027s suite at the Driskill. That Lopez guy. Matthew was working late the night of Jimmy\u0027s murder— video conference.\"\u003c/p\u003e\n\u003cp\u003e\"And you?\"\u003c/p\u003e\n\u003cp\u003e\"I was home. Too many goddamn witnesses.\"\u003c/p\u003e\n\u003cp\u003eBefore I could ask what he meant, he directed me into the driveway of a greentrimmed twostory. Television light glowed behind curtained windows. A strip of duct tape ran up one cracked pane like a lightning bolt. The yard was dirt with a few sad clumps of dandelions and one sickly pecan tree filled with webworms, a tippedover tricycle on the sidewalk. A bangedup gray Honda sat next to the curb. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-15.html","bookId":2419,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
