{"id":76724,"no":24,"title":"Page 24","content":"\u003cp\u003ePena studied him. \"I\u0027m sure you can understand our security concerns, Mr.\u003c/p\u003e\n\u003cp\u003eNavarre—not letting unauthorized visitors in. You remember the idea of security, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eGarrett yanked his knife out of the wall. The headline fell to the floor.\u003c/p\u003e\n\u003cp\u003eI put my hand on his forearm. \"Let\u0027s talk, Pena.\"\u003c/p\u003e\n\u003cp\u003e\"We have nothing to talk about.\"\u003c/p\u003e\n\u003cp\u003e\"Come on, Tres,\" Maia Lee said. \"We can catch up with the gentlemen from the SEC, have our conversation with them.\"\u003c/p\u003e\n\u003cp\u003ePena\u0027s eyes narrowed.\u003c/p\u003e\n\u003cp\u003eHe looked at the point of Garrett\u0027s knife, then back at Maia.\u003c/p\u003e\n\u003cp\u003e\"I can give you five minutes,\" he decided.\u003c/p\u003e\n\u003cp\u003ePena started walking toward the conference room.\u003c/p\u003e\n\u003cp\u003eI turned to Garrett. \"Keep it cool, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Garrett grumbled. \"One homicide at a time.\"\u003c/p\u003e\n\u003cp\u003eI left him holding the knife in one hand, the Chinese warrior in the other like a grenade, and I followed Maia through the frosted glass door.\u003c/p\u003e\n\u003cp\u003eCHAPTER 19\u003c/p\u003e\n\u003cp\u003ePena\u0027s newly acquired conference room had one wall that was all window, a rectangular table with six chairs, and a bare bookshelf. On the conference table was a box marked Trash. Inside was a Jimmy Doebler pot, a picture of Ruby and Jimmy\u0027s wedding, and a dried bouquet of pink roses.\u003c/p\u003e\n\u003cp\u003ePena was looking out the window—his back to us, his hands folded behind his waist.\u003c/p\u003e\n\u003cp\u003e\"Five minutes,\" he reminded us.\u003c/p\u003e\n\u003cp\u003eI sat down next to Maia, took advantage of Pena\u0027s dramatic pose to stick my bottlecapsize digital recorder to the underside of the table. Maia raised her eyebrows at me.\u003c/p\u003e\n\u003cp\u003ePena turned around.\u003c/p\u003e\n\u003cp\u003e\"Well?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" I said. \"I was savouring the moment.\"\u003c/p\u003e\n\u003cp\u003eHe checked his watch—a stainless steel Tag Heuer, a diver\u0027s model. Three thousand dollars\u0027 worth of ticktock. \"Perhaps you have time to waste, Mr. Navarre.\"\u003c/p\u003e\n\u003cp\u003e\"Speaking of wasting time,\" I said, \"thanks for the fish guts. Must\u0027ve eaten up a chunk of your morning—what with hostile takeovers, lives to ruin. I\u0027m flattered.\"\u003c/p\u003e\n\u003cp\u003eHis face told me nothing. One of Pena\u0027s computers couldn\u0027t have spit out data as non sequitur any more quickly than he did. \"You now have three minutes.\"\u003c/p\u003e\n\u003cp\u003eMaia Lee ran her finger along her lips like the barrel of a gun.\u003c/p\u003e\n\u003cp\u003e\"We need to have our discussion again, Matthew—the one where we review the rules of polite society.\"\u003c/p\u003e\n\u003cp\u003eHis eyes dimmed.\u003c/p\u003e\n\u003cp\u003eAt least he wasn\u0027t a total fool. He\u0027d learned to associate pain with Maia.\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t have come here,\" he warned her. \"Ron Terrence agrees with me—it isn\u0027t like you to be so unprofessional.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t seen unprofessional yet,\" she promised. \"But keep talking. Tell me how your little high school lackeys out there—the ones who can\u0027t seem to find their way into the program—are going to solve Techsan\u0027s software problems in a couple of days.\"\u003c/p\u003e\n\u003cp\u003eIt took Pena a good thirty seconds to remember to look condescending.\u003c/p\u003e\n\u003cp\u003e\"Dwight Hayes has been talking to you,\" he decided. \"No matter. Dwight\u0027s job was terminated last night, the moment he touched me. Whatever he says now can be dismissed as the rantings of a fired employee.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you two went way back,\" I said.\u003c/p\u003e\n\u003cp\u003ePena stared at me, as if he didn\u0027t see my point. \"Whatever Dwight told you, Mr.\u003c/p\u003e\n\u003cp\u003eNavarre, Techsan selfdestructed with no help from me. Like so many other startups, your brother and his friends didn\u0027t have the first clue how to bring their product to market. They should feel lucky I gave them as much as they got.\"\u003c/p\u003e\n\u003cp\u003e\"They should grovel,\" I agreed. \"And if they don\u0027t, they should be made to grovel.\"\u003c/p\u003e\n\u003cp\u003e\"Your brother has enough troubles, Mr. Navarre. Let him pack his boxes. Wheel him home, plan your legal strategies. At least now he can pay his lawyer\u0027s bills once he sells his stock.\"\u003c/p\u003e\n\u003cp\u003eMaia leaned forward, picked a dried rose out of the Trash box. It crumpled in her fingers. \"You\u0027ve overextended this time, Matthew. Anticipation of the big money has made you sloppy. What did you tell me once?\" she asked. \"You like to find the fault lines, keep hammering in spikes until the target cracks apart? Maybe I\u0027ll try it with you, Matthew.\"\u003c/p\u003e\n\u003cp\u003ePena\u0027s expression got close to real anger—almost as if he were human.\u003c/p\u003e\n\u003cp\u003e\"Be careful how you talk, love,\" he said. \"One phone call—your junior partnership at Terrence \u0026amp; Goldman goes into the shredder. Two phone calls, I can have you disbarred.\"\u003c/p\u003e\n\u003cp\u003e\"Hard to use the phone, love,\" I said, \"if the cord is wrapped around your neck.\"\u003c/p\u003e\n\u003cp\u003ePena came around the table, slowly, and sat on the edge, leaning over me so our faces weren\u0027t more than two feet apart. His breath smelled of cardamom. I happened to see the depth gauge on his Tag Heuer, still logged to his last dive. Eightysix feet.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make this about Maia,\" he said. \"She\u0027s good, Navarre, but she\u0027s not worth it.\"\u003c/p\u003e\n\u003cp\u003eI tried to concentrate on the fact that the recorder I\u0027d placed under the table was running. It calmed me down sufficiently to avoid escorting Matthew Pena out his fourthfloor window.\u003c/p\u003e\n\u003cp\u003ePena leaned back, satisfied. \"It\u0027s been nice talking with you. And, Maia— If you ever change your mind, ever feel that you don\u0027t want to go down with the ship ...\" He feigned an embarrassed smile. \"But that\u0027s a bad metaphor. Still terrified of diving, aren\u0027t you? A shame. I\u0027d love to get you under the water.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, Pena,\" I warned.\u003c/p\u003e\n\u003cp\u003eHe laughed. \"Oh, but this Maia Lee. Inscrutable Maia who was put on earth to protect people like me. She never shows her fault lines, much as I\u0027d like to see them. Where are they, Tres? I suspect you put a few in her yourself.\"\u003c/p\u003e\n\u003cp\u003eMaia Lee pushed her chair back, got up gracefully.\u003c/p\u003e\n\u003cp\u003eHer snap kick caught Matthew Pena in the mouth, sent him backward over the table.\u003c/p\u003e\n\u003cp\u003eBefore I could do anything—assuming I\u0027d wanted to—Maia had collected Pena from the carpet, put him in an armlock, and shoved him against the empty bookshelf.\u003c/p\u003e\n\u003cp\u003e\"First rule of polite society,\" she said. \"Never annoy Maia Lee.\"\u003c/p\u003e\n\u003cp\u003eShe spun him around, slammed him against the corner of the table—his groin at just the wrong level.\u003c/p\u003e\n\u003cp\u003e\"Second rule of polite society. Never. Annoy. Maia. Lee.\"\u003c/p\u003e\n\u003cp\u003eShe pulled him off the table—Pena doubled over in pain—and bowled him into the bookshelf, which being empty, peeled away from the wall and fell, the top whamming against the table so it made Matthew a tidy little office furniture tent.\u003c/p\u003e\n\u003cp\u003e\"Third rule,\" Maia said, catching her breath now. \"Figure it out.\"\u003c/p\u003e\n\u003cp\u003eShe collected her purse, tugged at my arm to bring me out of temporary paralysis, and we left Matthew Pena to his busy schedule.\u003c/p\u003e\n\u003cp\u003eIn the main work area, people were standing up at their cubicles, all looking in our direction—like a prairie dog town on high alert.\u003c/p\u003e\n\u003cp\u003e\"Thank you for your cooperation,\" I announced. \"This safety drill is now concluded.\"\u003c/p\u003e\n\u003cp\u003eGarrett was waiting for us by the water cooler. \"Did you kill him?\"\u003c/p\u003e\n\u003cp\u003e\"Maia calmed me down before I could,\" I assured him. \"This building have a security detail?\"\u003c/p\u003e\n\u003cp\u003eHe grinned. \"No. Ain\u0027t it great?\"\u003c/p\u003e\n\u003cp\u003e\"Nevertheless,\" Maia said, \"perhaps Garrett and I should go visit the police now, before they find a reason to visit me.\"\u003c/p\u003e\n\u003cp\u003eHer white scrunchie had slipped down on her ponytail, and the third button of her dress had come undone, but something told me this was not the time to point out these details.\u003c/p\u003e\n\u003cp\u003eMaia escorted Garrett through a cluster of the gaping screen heads, back toward Garrett\u0027s cubicle to collect his things.\u003c/p\u003e\n\u003cp\u003eI went out through the reception area.\u003c/p\u003e\n\u003cp\u003eKrystal Negley was reading her romance novel. She smiled in surprise. \"Hey. Didn\u0027t get that equipment?\"\u003c/p\u003e\n\u003cp\u003e\"Matthew Pena kicked me out. If he asks, you did not let me have the access code.\"\u003c/p\u003e\n\u003cp\u003eHer face paled. \"You some kind of spy?\"\u003c/p\u003e\n\u003cp\u003e\"A private eye,\" I said. \"Sorry I wasn\u0027t straight with you.\"\u003c/p\u003e\n\u003cp\u003e\"A private eye. No shit?\"\u003c/p\u003e\n\u003cp\u003e\"Sorry if I caused you trouble.\"\u003c/p\u003e\n\u003cp\u003eShe managed a laugh. \"With Mr. Pena for a boss? I\u0027m his fourth personal assistant since he got to Austin. I was ready to quit anyhow. But I figure you owe me a favour now, right?\"\u003c/p\u003e\n\u003cp\u003e\"I figure I do.\"\u003c/p\u003e\n\u003cp\u003eShe slid open her drawer, pulled out a small leather binder. \"Mr. Pena\u0027s appointment book for the year. My predecessors kept printing out hardcover backups from his computer. You figure you could find some annoying ways to use the information?\"\u003c/p\u003e\n\u003cp\u003eI smiled at her. \"I think I could, Krystal. And you\u0027re something else.\"\u003c/p\u003e\n\u003cp\u003e\"The wrong men keep telling me that,\" she sighed, and went back to reading her romance novel.\u003c/p\u003e\n\u003cp\u003eXMimeOLE: Produced By MimeOLE V5.00.2919.6700\u003c/p\u003e\n\u003cp\u003eDate: Mon 12 Jun 2000 14:36:400000\u003c/p\u003e\n\u003cp\u003eFrom: EL \u0026lt;\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ \u0026gt;\u003c/p\u003e\n\u003cp\u003eReplyTo:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eTo: \u0026lt;recipient list suppressed\u0026gt;\u003c/p\u003e\n\u003cp\u003eSubject: firearms\u003c/p\u003e\n\u003cp\u003eI found the house easily enough—a grimy little bungalow in the shadow of l35.The yard was dirt and crabgrass, the windows covered with silver insulation material. Just the sort of rat hole I\u0027d imagined he would live in.\u003c/p\u003e\n\u003cp\u003eHis back door latch was easy to jimmy.\u003c/p\u003e\n\u003cp\u003eInside, the kitchen smelled of raw chicken left out too long. Television light glowed in the next room. I could hear something insipid playing—something with lots of canned laughter.\u003c/p\u003e\n\u003cp\u003eI remember being thankful for the checkered grip on the gun, because my palms were sweating. This time would be so different. I hadn\u0027t planned anything closeup before, nor with a gun. This time would count.\u003c/p\u003e\n\u003cp\u003eI crept forward, stood in the doorway.\u003c/p\u003e\n\u003cp\u003eHe was slumped in a corduroy recliner, his eyes glued to the set. I was amazed at the way he had deteriorated, how little he looked like the photo in my pocket. His face was a war zone of melanomas and capillaries. His hair had thinned, grayed to the colour of pencil lead, but that stupid moustache was still as black and bushy as ever. His belly was a hard little thing, like he\u0027d swallowed grapeshot.\u003c/p\u003e\n\u003cp\u003eI watched him a long time, waiting to be noticed. Ten feet away, and he didn\u0027t even see me. I got so nervous I started to smile.\u003c/p\u003e\n\u003cp\u003eHe sensed something was wrong. He looked over, locked eyes with me, and it wasn\u0027t funny anymore.\u003c/p\u003e\n\u003cp\u003e\"What the hell... ?\" His voice dragged itself out of his throat. \"Pinche kids.\"\u003c/p\u003e\n\u003cp\u003eHe started to get up, his eyebrows furrowing.\u003c/p\u003e\n\u003cp\u003e\"Come into my house ... ?\" he grumbled.\u003c/p\u003e\n\u003cp\u003eI tried to say what I\u0027d intended, but things weren\u0027t going as planned.\u003c/p\u003e\n\u003cp\u003eHe was supposed to stay there, frozen by my gun, and give me time to talk. Instead, he was struggling to his feet, mumbling that he\u0027d give me a thrashing, that I\u0027d best run before he got his rifle.\u003c/p\u003e\n\u003cp\u003eHe took a step toward me.\u003c/p\u003e\n\u003cp\u003eSomeone had told me the pressure on the trigger would be the same as lifting a jug of milk with one finger. I\u0027m telling you, it was easier than that.\u003c/p\u003e\n\u003cp\u003eMy hand bucked from the recoil.\u003c/p\u003e\n\u003cp\u003eThe arm of his corduroy chair ripped open, spitting out cotton filling. The Old Man\u0027s expression just turned angrier. He put a hand out to grab me. My second shot bit off part of his palm, left a bloody groove where his heart line ended.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t supposed to happen this way.\u003c/p\u003e\n\u003cp\u003eHe started to scold me and the third shot caught him in the shoulder, tore it open like a paper package of meat. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-24.html","bookId":2419,"creation":"Oct 5, 2019 3:30:44 PM","modification":"Oct 5, 2019 3:30:44 PM"}
