{"id":76515,"no":3,"title":"Page 3","content":"\u003cp\u003eGarrett waved the comment aside. \"We convinced half a dozen companies to do a sixmonth betatest—meaning they\u0027d try our product for free, we\u0027d monitor how it went.\u003c/p\u003e\n\u003cp\u003eThings went well, we could market the program commercially. Man, we rented offices, hired staff, did installation.\"\u003c/p\u003e\n\u003cp\u003e\"You spent more money you didn\u0027t have,\" I translated.\u003c/p\u003e\n\u003cp\u003e\"Three months in, things were going so well we were turning down buyout offers, little bro. Turning them down.\"\u003c/p\u003e\n\u003cp\u003e\"And then?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"We were sabotaged.\"\u003c/p\u003e\n\u003cp\u003eJimmy shifted his back uneasily against the mesquite. \"We don\u0027t know that, Garrett.\"\u003c/p\u003e\n\u003cp\u003e\"The hell we don\u0027t. Fucking Matthew Pena.\"\u003c/p\u003e\n\u003cp\u003eI made the timeout sign. \"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Back in April,\" Garrett said, \"we got this buyout offer from an investment banker in Cupertino, guy named Pena. Reminded me of a fucking vampire. He got along great with Ruby, which figures, but me and Jimmy said no way. Right after we turned Pena down, things started to go wrong with our betatesting. The program is supposed to protect traffic on our clients\u0027 computers, okay? Email, Internet commerce, important shit.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one of those hightech terms, right? \u0027Important shit.\u0027 \"\u003c/p\u003e\n\u003cp\u003eGarrett ignored me. He\u0027d had a lot of practice at that over the years.\u003c/p\u003e\n\u003cp\u003e\"All of a sudden,\" he said, \"it was like our program sprung leaks. Our clients start reporting documents showing up in weird places—employees getting termination notices in their email before they were officially fired, salary schedules getting posted on the company Web site, business plans emailed to competitors. Worst scenarios you can imagine. We\u0027ve been busting our asses trying to figure it out, tell the clients the program can\u0027t be at fault. The leaks are too malicious, too . . . intelligent. It\u0027s got to be somebody—Pena for instance—bribing people to leak files directly from the test sites.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Jimmy mumbled. \"Couldn\u0027t be Garrett\u0027s perfect algorithms.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, fuck you, man. And what do the betatesters do? They blame us. We\u0027re supposed to protect them and we can\u0027t, so it\u0027s our fault. Three of the six companies have stopped testing and filed lawsuits, and we don\u0027t have the money to fight them. The other companies are threatening to do the same. If they do, we lose everything—two years of work, our IPO, any chance at investors. And now the bastard that sabotaged us—fucking Matthew Pena—comes back to us with a last ditch buyout offer, a fifth of what he offered us three months ago. And his goddamn wife—\" Shaking his finger at Jimmy. \"His goddamn ￡xwife is telling us we should feel grateful about it.\"\u003c/p\u003e\n\u003cp\u003eJimmy got to his feet. \"Maybe she\u0027s just smarter than you, Garrett. You ever think of that?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t like the looks Garrett and Jimmy were giving each other. I\u0027d been in enough bar fights to recognize the prelude music.\u003c/p\u003e\n\u003cp\u003e\"How much money?\" I broke in.\u003c/p\u003e\n\u003cp\u003e\"About four million total in the stock,\" Garrett growled. \"Peanuts. Enough to break even, get out of debt. Nothing more.\"\u003c/p\u003e\n\u003cp\u003eI tried to visualize an equals sign between the words four million and peanuts. I couldn\u0027t do it.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re hesitating?\" I asked. \"Sell.\"\u003c/p\u003e\n\u003cp\u003eGarrett pitched his margarita cup into the grass, pushed his wheelchair back from the fire. \"Two years of my life, little bro. You walk in here, not knowing shit, and you tell me,\u003c/p\u003e\n\u003cp\u003e\u0027Sell.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the same Ruby\u0027s telling us,\" Jimmy said. \"You\u0027re just too stubborn—\"\u003c/p\u003e\n\u003cp\u003eGarrett broke down in a miniature seizure—cursing and spitting and patting his arms around his chair looking for something else to throw. He grabbed his bag, and before I knew what was happening he had the gun in his hand.\u003c/p\u003e\n\u003cp\u003e\"Ruby!\" he yelled. \"All I hear about is damn Ruby. What the hell was your fucking divorce for? Here, Ruby. I got something for you.\"\u003c/p\u003e\n\u003cp\u003eThe round he fired at the kiln goddess blasted her left arm clean off, sending shards of brick and ceramics out into the night.\u003c/p\u003e\n\u003cp\u003eAfter that, things got very quiet.\u003c/p\u003e\n\u003cp\u003eWhen the ringing in my ears subsided, I said, \"Please put the gun away, Garrett.\u003c/p\u003e\n\u003cp\u003eOkay?\"\u003c/p\u003e\n\u003cp\u003eTo my relief, he shoved the Lorcin into his pot bag, then turned his chair toward the road. \"Jimmy Doebler wants to ride on my hard work, marry the girl, then bail out in the end, what the hell did I invite him along for?\"\u003c/p\u003e\n\u003cp\u003eI said, \"Garrett—\"\u003c/p\u003e\n\u003cp\u003e\"Forget it, little bro. You and he finally agree on something, you can both go to hell.\"\u003c/p\u003e\n\u003cp\u003eGarrett wheeled across the gravel—popping and tilting over the rocks, trying not to keel over.\u003c/p\u003e\n\u003cp\u003eWe watched him hoist himself into his safari van, fold and stash the chair, roll the side door shut with a SLAM. Brake lights came on. A mushroom of yellow dust blossomed under the back wheels as he peeled out.\u003c/p\u003e\n\u003cp\u003eJimmy drained his margarita, stared into the empty goblet.\u003c/p\u003e\n\u003cp\u003e\"Happy Divorce Day,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"Your brother\u0027s upset.\"\u003c/p\u003e\n\u003cp\u003eI kept my mouth shut. I looked down at my own mug— wondered how Jimmy had managed such an intricate fishscale pattern in the glaze, deep blues and greens, perfect symmetry. I wondered if he managed the complexities of programming the same way. I\u0027d always thought of Jimmy as, if not an idiot savant, at least an idiot honourable mention.\u003c/p\u003e\n\u003cp\u003e\"Garrett really didn\u0027t talk to you about the ranch?\" Jimmy asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"He kept telling me he would. I know that isn\u0027t right, Tres. Somebody tried to sell this place without telling me ...\"\u003c/p\u003e\n\u003cp\u003e\"Difference,\" I said. \"This place legally belongs to you.\"\u003c/p\u003e\n\u003cp\u003eJimmy\u0027s face squinched up, like I\u0027d hit him with an invisible pie. \"All right. But the last two years have been hell, Tres. You got to understand that. Garrett didn\u0027t want you to know how dicey things were.\"\u003c/p\u003e\n\u003cp\u003e\"I know you\u0027re drowning in debt, you have a bailout offer, and my brother doesn\u0027t want to take it.\"\u003c/p\u003e\n\u003cp\u003e\"Pride—\"\u003c/p\u003e\n\u003cp\u003e\"He can swallow it.\"\u003c/p\u003e\n\u003cp\u003eJimmy set his goblet on his knee. \"Just back off for a few days, okay? Let me work on Garrett.\"\u003c/p\u003e\n\u003cp\u003e\"Back off,\" I repeated. \"Like you used to tell me down in Rockport: \u0027Stay out of my way, kid.\u0027 \"\u003c/p\u003e\n\u003cp\u003eJimmy stared at me with that look of hazy consternation, as if he was still wandering among the sand dunes. But he got the message. And I felt petty.\u003c/p\u003e\n\u003cp\u003e\"If it makes you feel any better,\" he said, \"I spent years resenting you, too. At least you and Garrett have each other. Maybe not much of a family, but it\u0027s more than nothing.\"\u003c/p\u003e\n\u003cp\u003eMy third margarita had started seeping into my bloodstream. A flash lit the sky and a peal of thunder rolled one way across the lake, then the other. God testing the balance on his speakers.\u003c/p\u003e\n\u003cp\u003e\"This was your mom\u0027s place,\" I said.\u003c/p\u003e\n\u003cp\u003eJimmy nodded.\u003c/p\u003e\n\u003cp\u003e\"Is it ever hard, living here?\" I was thinking about the months after my father had died, when I\u0027d been living alone in his house.\u003c/p\u003e\n\u003cp\u003eJimmy cracked a twig, sent one half spinning into the dark. \"Getting divorced, watching my career fall apart. I start wondering— what have I got left, you know? In the end, there\u0027s just family and friends, and for me the family part has always been . . . difficult.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got a lot of time to make up for.\"\u003c/p\u003e\n\u003cp\u003eHe paused uncomfortably.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I was thinking. You could do a favour for me. You can do background checks, right?\"\u003c/p\u003e\n\u003cp\u003eMost of my nightmares start with those words.\u003c/p\u003e\n\u003cp\u003eI immediately thought: Divorce. Jimmy\u0027s family money, the settlement with Ruby final, but maybe not on terms Jimmy wanted. Knowing him, he\u0027d allowed himself to get bled dry. He\u0027d want detective work in order to appeal the court decision, maybe make his ex look bad.\u003c/p\u003e\n\u003cp\u003eI said, \"Jimmy . . .\"\u003c/p\u003e\n\u003cp\u003e\"Forget it.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just, it\u0027s not a good idea working for a friend.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me strangely, maybe because I\u0027d used the word friend.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" he said. \"Forget it.\"\u003c/p\u003e\n\u003cp\u003eI wanted to say something else, something that didn\u0027t sound like an excuse, but nothing came.\u003c/p\u003e\n\u003cp\u003eWe watched the storm roll above us, the air get heavier, and finally break with a sigh, the first few splatters of warm rain hissing at the edge of the fire.\u003c/p\u003e\n\u003cp\u003eJimmy stood. \"It\u0027s too late to drive back to S.A. Take a couch in the dome. I got plenty of spare clothes and whatever.\"\u003c/p\u003e\n\u003cp\u003eStaying overnight hadn\u0027t been part of my game plan, but when I tried to stand, I realized how the tequila had turned my legs and my anger into putty. I accepted Jimmy\u0027s offer.\u003c/p\u003e\n\u003cp\u003e\"Go on, then,\" he said. \"I\u0027ll take care of the fire and the dinner stuff.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind helping.\"\u003c/p\u003e\n\u003cp\u003e\"No. Go on.\" More of a command now. \"I want to stay down here a little longer.\"\u003c/p\u003e\n\u003cp\u003e\"Fix your kiln goddess?\"\u003c/p\u003e\n\u003cp\u003eHe gave me an empty smile, picked up his Tupperware fajita bowl. \"Thanks for your help today, Tres.\"\u003c/p\u003e\n\u003cp\u003eHe headed toward the lake to wash his bowl.\u003c/p\u003e\n\u003cp\u003eI drove up the gravel road in the rain, parked behind Garrett\u0027s van, then got fairly well soaked running from the truck to Jimmy\u0027s front door.\u003c/p\u003e\n\u003cp\u003eInside, the dome smelled like copal incense. One large room—a small kitchenette to the right, sleeping loft in the back, four high skylights like the slits of a sand dollar. The curve of the south wall was sheered perpendicular at the bottom to accommodate a fireplace and Jimmy\u0027s pottery display shelves.\u003c/p\u003e\n\u003cp\u003eDespite Jimmy\u0027s years as a programmer, there was no computer. No television. With Jimmy\u0027s jam box down at the lake, the most hightech appliance in the dome was probably his refrigerator.\u003c/p\u003e\n\u003cp\u003eGarrett\u0027s sleeping bag was spread out on one of the canvas sofas by the fireplace, but Garrett wasn\u0027t there. Probably in the outhouse.\u003c/p\u003e\n\u003cp\u003eI crashed on the opposite couch and listened to the thunder, watched the rain make milky starbursts on the windows above. Lightning flashed across Jimmy\u0027s pottery, turned the photos on his mantel into squares of gold. One of those photos showed Garrett\u003c/p\u003e\n\u003cp\u003ebefore the accident that had made him a bilateral amputee. He was standing next to Jimmy on the Corpus Christi seawall. Another photo showed Jimmy\u0027s mother, Clara, a sadeyed woman I remembered vaguely, dead now for something like five years. Next to her was a picture of Jimmy with a redheaded woman I assumed was Ruby, his newly exwife. And in the middle of the mantel, taking the place of honour, was a signed publicity shot of Jimmy Buffett and the Coral Reefers.\u003c/p\u003e\n\u003cp\u003eI don\u0027t remember falling asleep at all.\u003c/p\u003e\n\u003cp\u003eI dreamt about the ranch. I was lying out in the wheat fields, rain falling on my face.\u003c/p\u003e\n\u003cp\u003eStanding over me was Luis, a drug dealer who\u0027d once stabbed me in San Francisco.\u003c/p\u003e\n\u003cp\u003eWe were having a pleasant conversation about property values until Luis drew the Balinese knife on me again and plunged it into my kidney. I heard paramedics, heard my old mentor, Maia Lee, chastising me for my carelessness.\u003c/p\u003e\n\u003cp\u003eThen a single, sharp report snapped me awake.\u003c/p\u003e\n\u003cp\u003eMy eyes stared into darkness for several lifetimes before I realized I was out of the dream. My side still ached from the knife wound.\u003c/p\u003e\n\u003cp\u003eI sat up on the couch.\u003c/p\u003e\n\u003cp\u003eNo light came in the windows. The rain seemed to have stopped. The room was lit only by the glow of a stovetop fluorescent.\u003c/p\u003e\n\u003cp\u003eGarrett\u0027s sleeping bag was mussed up but unoccupied. Open face down on the pillow was his wellworn copy of Richard Farina— Been Down So Long It Looks Like Up to Me. His wheelchair was nowhere in sight.\u003c/p\u003e\n\u003cp\u003eI climbed the stairs to the sleeping loft. Jimmy\u0027s bed hadn\u0027t been slept in. The red digital numbers on his alarm clock glowed 2:56 A.M. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-3.html","bookId":2419,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
