{"id":76731,"no":32,"title":"Page 32","content":"\u003cp\u003eClyde shook his head. \"She wanted me to know, she\u0027d tell me.\"\u003c/p\u003e\n\u003cp\u003e\"So much for protection.\"\u003c/p\u003e\n\u003cp\u003eClyde was silent. In the sunset, his eyes were so blue they were translucent, like bottle glass. \"You shook her up yesterday. There was no talking to her. I tried ... I\u0027d do anything for her.\"\u003c/p\u003e\n\u003cp\u003e\"Same as you\u0027d do for my brother.\"\u003c/p\u003e\n\u003cp\u003eHe stared at the churning water in the hot tub, the dark little orbs of pecans bobbing in the foam. \"Garrett might kill a guy who took his woman. He wouldn\u0027t do that—\" He waved toward the open door of the kitchen.\u003c/p\u003e\n\u003cp\u003e\"I ain\u0027t going to let nobody mess with my friends anymore,\" Clyde decided. \"Not the cops, not Pena. I\u0027m going to call a few of my buddies, have them come around tonight, just in case.\"\u003c/p\u003e\n\u003cp\u003e\"In case what?\"\u003c/p\u003e\n\u003cp\u003eNo sound but the hum of the hot tub. The daylight was almost gone.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going to trust the police, man,\" Clyde said. \"That\u0027s all I\u0027m saying.\"\u003c/p\u003e\n\u003cp\u003e\"You going to form a human chain of bikers around Garrett?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a biker—not a onepercenter. You don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eI felt like I was talking to my brother, which suddenly made me realize why Garrett got along with bikers so well. For both, conversation is like spinning wheels in gravel. It doesn\u0027t matter if you get anywhere, as long as you make noise and shoot out a bunch of rocks.\u003c/p\u003e\n\u003cp\u003e\"Best of luck, Clyde,\" I said. \"Have a good evening.\"\u003c/p\u003e\n\u003cp\u003eI started to leave.\u003c/p\u003e\n\u003cp\u003eHe put a massive paw on my shoulder, pushed me back a step.\u003c/p\u003e\n\u003cp\u003e\"I know you don\u0027t like your brother much. But you should respect him. The man says he\u0027ll be there for you, he will. The guys in my club know that.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, Clyde. Garrett\u0027s a regular Eagle Scout.\"\u003c/p\u003e\n\u003cp\u003e\"He going to be out on bail for the Buffett concert tonight?\"\u003c/p\u003e\n\u003cp\u003e\"He got a quick hearing. The wheelchair helped, the fact he\u0027s got no priors. Maia Lee took care of things the best she could. He\u0027ll be out.\"\u003c/p\u003e\n\u003cp\u003eClyde looked somewhat mollified. \"Buffett music—Buffett knows what it\u0027s all about, man. Renegades got to stick together.\"\u003c/p\u003e\n\u003cp\u003eHe stepped out of my way. \"I expect you to be there for Garrett, Tres. You got some makeup work to do.\"\u003c/p\u003e\n\u003cp\u003ePart of me wanted to slug Clyde because he assumed he knew what I needed to do, as if he knew the history—who had abandoned whom over the years. Part of me wanted to slug him because I thought he was probably right.\u003c/p\u003e\n\u003cp\u003e\"Call me,\" I said. \"Let us know Ruby got back safe.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"End of the day, man, you better stand with your family. And guess what: the end of the day is here.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 28\u003c/p\u003e\n\u003cp\u003eSouthpark Meadows was throbbing with canned music by the time we pulled in.\u003c/p\u003e\n\u003cp\u003eThe parking lot smelled of hay and mown grass. Headlights cut across a haze of dust.\u003c/p\u003e\n\u003cp\u003eA few late tailgaters hung out drinking beer— women in cutoffs and bikini tops, men in Hawaiian shirts and khaki shorts, humanoids of indeterminate gender dressed as Caribbean life forms. Even the lobsters had drinks in their hands.\u003c/p\u003e\n\u003cp\u003eGarrett pushed his wheelchair along between Maia and me, occasionally getting his wheels snagged on a rock or a tire rut. Dickhead the Parrot sat on his shoulder, flapping his wings helpfully whenever the chair got stuck.\u003c/p\u003e\n\u003cp\u003eWhen we got to the rise, we could see the stage two hundred yards downfield—a wired black box of Mecca, the pilgrims swirling around it a sea of drunk pirates and Key West outcasts. A huge rainbow beach ball bounced over a forest of hands. Caribbean music played from buildingsized speakers. Stage lights pulsed. Around the perimeter, long lines snaked away from the beer booths.\u003c/p\u003e\n\u003cp\u003eWe passed a guy in a foam shark suit, a couple making out in matching crustacean hats, a woman dressed as a tequila bottle.\u003c/p\u003e\n\u003cp\u003e\"Like the BaytoBreakers race in San Francisco,\" I said to Maia.\u003c/p\u003e\n\u003cp\u003eShe gave me an icy look. I\u0027d been getting my share of those from her today.\u003c/p\u003e\n\u003cp\u003e\"A little,\" she agreed, \"except no one is naked.\"\u003c/p\u003e\n\u003cp\u003e\"Give it an hour,\" Garrett promised.\u003c/p\u003e\n\u003cp\u003eWe wove our way around the periphery of the crowd. The smell of ganja was everywhere, the field strewn with beach blankets and lawn chairs and coolers.\u003c/p\u003e\n\u003cp\u003eEvery few yards somebody would recognize Garrett and we\u0027d have to stop for introductions and compliments about the parrot and, invariably, a proffered swig from somebody\u0027s secret flask. If anybody knew about Garrett\u0027s newfound celebrity status as a murder suspect, no one mentioned it.\u003c/p\u003e\n\u003cp\u003eMaybe the murder charges didn\u0027t matter. At the rate we were going, I figured we\u0027d be dead from alcohol poisoning by the time we found a place to sit anyway.\u003c/p\u003e\n\u003cp\u003eWe finally settled on a knoll to one side of the stage, close enough so Garrett could park his chair and have a fair chance of seeing, far enough away so he wouldn\u0027t blast out the parrot\u0027s eardrums. Garrett settled back on his Persian cushion and proceeded to get out his jointrolling kit.\u003c/p\u003e\n\u003cp\u003eNeither Maia nor I had come so prepared—no blanket, no provisions, no funny costumes.\u003c/p\u003e\n\u003cp\u003eA warmup act came on stage and began an instrumental number to a spattering of applause.\u003c/p\u003e\n\u003cp\u003eMaia\u0027s eyes were fixed on the horizon, studying the stars above the oak trees.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve apologized,\" I told her. \"I don\u0027t know what else to say.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t blame you for bringing evidence to Lopez\u0027s attention. I blame you for not calling me. Not telling me. Not warning me.\"\u003c/p\u003e\n\u003cp\u003eGarrett glared up at us from his halfrolled joint. \"Could we not talk about this anymore? I\u0027m trying to get stoned. You want to plan my funeral, how about you two go up that way some?\"\u003c/p\u003e\n\u003cp\u003eThen Garrett was besieged by a group of tropicalshirted fans who wanted to admire his bird. Flasks of liquor came out.\u003c/p\u003e\n\u003cp\u003eMaia and I exchanged looks, then moved up the hill.\u003c/p\u003e\n\u003cp\u003eWe found an abandoned quilt kicked into a U—its owner either gone to get beer or gone toward the stage.\u003c/p\u003e\n\u003cp\u003eMetal drums trilled on stage. The lights surged.\u003c/p\u003e\n\u003cp\u003eWhat I\u0027d taken for a warmup band was actually Buffett\u0027s band.\u003c/p\u003e\n\u003cp\u003eMr. Margaritaville himself was now coming on stage. The mega screen TVs flashed online to either side of the stage, so that J.B. was either a small orange and red dot walking across the stage or a huge, grinning tan face with blond cropped hair.\u003c/p\u003e\n\u003cp\u003eThe cheering started.\u003c/p\u003e\n\u003cp\u003e\"At least Garrett\u0027s talking to you again,\" Maia said.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I agreed. \"What better punishment?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t try to make me feel better.\u003c/p\u003e\n\u003cp\u003eBuffett launched into something I didn\u0027t recognize, but the crowd did. A guy near us raised a beer can and did a pretty good approximation of a rebel yell.\u003c/p\u003e\n\u003cp\u003eMaia hugged her arms, as if the eightyfivedegree night warranted shivers. \"I want you to know, I tried to convince Garrett to get another lawyer. The DA didn\u0027t contest my right to represent, but ... I don\u0027t want a trial. That\u0027s not why I came to Texas. Garrett insisted. I guess he was too shaken to think about hiring someone he didn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eAt the moment, Garrett didn\u0027t appear shaken. He and his friends were nodding their heads to the music, drinking, passing around the joint.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have to suggest a plea bargain,\" I told Maia.\u003c/p\u003e\n\u003cp\u003e\"Unless something changes drastically. Manslaughter, maybe.\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t go for it.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" she said bitterly. \"Navarre stubbornness forebears.\"\u003c/p\u003e\n\u003cp\u003eA prickly silence formed between us.\u003c/p\u003e\n\u003cp\u003e\"Tell me I\u0027m not crazy,\" I said. \"Pena could be responsible for Jimmy\u0027s murder. Or Ruby. Or W.B.\"\u003c/p\u003e\n\u003cp\u003e\"Garrett\u0027s your brother. You don\u0027t need permission to take his side.\"\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t the kind of answer I\u0027d wanted, and I guess it showed.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been acting guilty for days,\" Maia said. \"It\u0027s not just finding that casing. What\u0027s bothering you?\"\u003c/p\u003e\n\u003cp\u003eBuffett was still playing that song I didn\u0027t know. Pot smoke was so thick that every few seconds another wisp of it would cross the moon like a cloud.\u003c/p\u003e\n\u003cp\u003e\"Listening to Ruby,\" I said, \"how she abandoned Garrett after his accident. I guess I hadn\u0027t thought about that night in a long time.\"\u003c/p\u003e\n\u003cp\u003eMaia studied my face.\u003c/p\u003e\n\u003cp\u003eIn all the years we\u0027d been together, I\u0027d never discussed my family with her much. She hadn\u0027t even known Garrett was disabled until she\u0027d met him.\u003c/p\u003e\n\u003cp\u003e\"We found him on the tracks,\" I told her. \"My father, my sister, and I. I knew where Garrett went to hop trains. I waited almost two hours before I said anything to my dad.\"\u003c/p\u003e\n\u003cp\u003e\"That was twenty years ago,\" she said. \"You were how old, twelve?\"\u003c/p\u003e\n\u003cp\u003eGarrett was up on the hill, having a great old time. A young blond girl, maybe twentythree, had settled into his lap. She coaxed Dickhead the Parrot onto her wrist, then lifted her arm up and down to the beat, forcing Dickhead to hold his wings open for balance like a hang glider.\u003c/p\u003e\n\u003cp\u003e\"Garrett\u0027s fine,\" Maia said gently. \"Look at him, for God\u0027s sake.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure I could explain to Maia that she was giving me too much credit. What bothered me wasn\u0027t the idea I might\u0027ve done more for Garrett, all those years ago.\u003c/p\u003e\n\u003cp\u003eWhat bothered me was that I finally understood how Ruby McBride felt. She\u0027d made me remember the revulsion, the horror of Garrett\u0027s condition, the desire to run away from him. She\u0027d reminded me of my darkest, most contemptible wish when I was twelve years old—that perhaps it would have been better if I\u0027d just gone to sleep that night, not said anything to my father.\u003c/p\u003e\n\u003cp\u003eMaia reached out, took my hand.\u003c/p\u003e\n\u003cp\u003eShe was about to say something when her face went blank.\u003c/p\u003e\n\u003cp\u003eMatthew Pena was walking toward us.\u003c/p\u003e\n\u003cp\u003eHe\u0027d changed out of business clothes, into a sleeveless Gold\u0027s Gym Tshirt and workout pants. Unfortunately, he did not appear to have sustained any permanent injuries from Maia Lee tossing him into his bookshelf yesterday. His hair gleamed with gel and his eyes were brighter than I\u0027d seen them before, almost animated. If dead things can be animated.\u003c/p\u003e\n\u003cp\u003e\"A picnic,\" Pena said. \"How cozy.\"\u003c/p\u003e\n\u003cp\u003e\"Matthew.\" Maia\u0027s tone was steady and cold. \"I didn\u0027t figure you for a Buffett fan.\"\u003c/p\u003e\n\u003cp\u003eHe held up the laminated card around his neck. \"Gift from a prospective client—backstage pass. How could I say no?\"\u003c/p\u003e\n\u003cp\u003eFor Pena, the event could\u0027ve been ballet or baseball or an art opening. It didn\u0027t matter.\u003c/p\u003e\n\u003cp\u003eThe important thing was that he could walk around with that backstage pass on, prove to the diehard fans that he could do better than they could without half trying.\u003c/p\u003e\n\u003cp\u003eI looked back at Garrett. He saw us, all right. He made a finger gun, fired it at us, then he returned his attention to the young blonde dancing in his lap.\u003c/p\u003e\n\u003cp\u003ePena crouched in front of me. \"Had a busy day, Navarre? I heard your brother is in a little trouble. If there\u0027s anything I can do—\"\u003c/p\u003e\n\u003cp\u003e\"Like confess?\" I asked.\u003c/p\u003e\n\u003cp\u003ePena smiled. \"By the way, I thought I\u0027d return this to you.\"\u003c/p\u003e\n\u003cp\u003eHe took the button recorder I\u0027d left stuck under his desk, tossed it in my lap.\u003c/p\u003e\n\u003cp\u003e\"Expensive piece of equipment,\" he said. \"Shouldn\u0027t leave it sitting around. I had my people erase it for you. All it failed to pick up, I\u0027m happy to tell you, is good news. We\u0027ve isolated the problem in Techsan\u0027s software. Stupid mistake on the part of the original programmers, I\u0027m afraid. Easily corrected.\"\u003c/p\u003e\n\u003cp\u003e\"Surprise, surprise.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, there\u0027s the matter of those confidential documents being posted. I can\u0027t promise there won\u0027t be a criminal investigation against your brother and Ruby, maybe some more lawsuits, but hey— at least the program will be on track. Your brother\u0027s AccuShield stock should go up. By the time he gets out of jail, he\u0027ll be able to pay his debts, retire to the lower middle class.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-32.html","bookId":2419,"creation":"Oct 5, 2019 3:30:44 PM","modification":"Oct 5, 2019 3:30:44 PM"}
