{"id":76744,"no":45,"title":"Page 45","content":"\u003cp\u003e\"If that\u0027s true,\" Garrett said, \"why am I still in here?\"\u003c/p\u003e\n\u003cp\u003e\"Because,\" said Maia, \"the DA can still make his strongest case, his only case, against you. You might be ruled out of Selak\u0027s murder, but the link between her and the other murders is the most speculative. To satisfy the public, give the press a good story, the DA\u0027s simply got to get you out of circulation—convict you on one murder, Jimmy Doebler\u0027s. The DA had a strong hand to begin with. When you ran, his hand got even stronger.\"\u003c/p\u003e\n\u003cp\u003eGarrett gripped the basketball tight enough to squeeze juice out of it. \"You come here to tell me I should pleabargain?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think that\u0027s possible anymore,\" she answered. \"But there might be something you can do, assuming you give us some straight answers. Have you been getting email from the killer?\"\u003c/p\u003e\n\u003cp\u003eHe hesitated. \"I\u0027ve been getting—emails.\"\u003c/p\u003e\n\u003cp\u003e\"From Pena,\" she said.\u003c/p\u003e\n\u003cp\u003e\"They come from different addresses, different Xmailers. They\u0027re embedded with some kind of textbased virus—damnedest thing I\u0027ve ever seen.\u003c/p\u003e\n\u003cp\u003eFreezes the computer if you try to print it, save it, screen capture it—anything.\"\u003c/p\u003e\n\u003cp\u003e\"What did they say?\"\u003c/p\u003e\n\u003cp\u003eGarrett shook his head at me. \"I\u0027d rather not— Look, it was just sick shit. Most of it was about me. Some about the company. The only one that really bothered me, the one I didn\u0027t understand—the bastard talked about some kid who almost got drowned in a tub.\"\u003c/p\u003e\n\u003cp\u003eLopez stared out the chain link fence. \"A kid?\"\u003c/p\u003e\n\u003cp\u003e\"Like I said. Sick shit.\"\u003c/p\u003e\n\u003cp\u003e\"Second confession,\" Maia said. \"You wrote the back door in Techsan\u0027s security program.\"\u003c/p\u003e\n\u003cp\u003eGarrett\u0027s eyes darkened. He looked past me, toward the prison doors.\u003c/p\u003e\n\u003cp\u003e\"Dwight Hayes found the glitch,\" I told him. \"It took him a while, but he\u0027s sure you wrote it.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have anything to say about that,\" Garrett told us. \"With or without my lawyer.\"\u003c/p\u003e\n\u003cp\u003e\"Look,\" Lopez said. \"This could be real bad news for you, Navarre. Or it could be a break. If you wrote this back door in the program, I want to call a friend in the High Tech Unit, get him \u0027over here to talk with you. You know the program better than any\u003c/p\u003e\n\u003cp\u003ebody. Maybe if you two get together, you can trace the leaks. If you can tie the sabotage to Matthew Pena—well, it may not pin him to a murder. But it might be enough to sweat him, maybe even get a search warrant issued for his computer. That would be a very good start.\"\u003c/p\u003e\n\u003cp\u003eGarrett kept digging his fingertips into the black lines of the basketball.\u003c/p\u003e\n\u003cp\u003eBehind him, on the court, the jail guard did air threepointers.\u003c/p\u003e\n\u003cp\u003e\"Get me out of here first,\" Garrett said.\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t do that,\" Lopez said. \"We got to clear you before you go anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll screw me around,\" Garrett said. \"You can\u0027t help it. You\u0027re a cop.\"\u003c/p\u003e\n\u003cp\u003e\"You want to talk alone?\" I asked.\u003c/p\u003e\n\u003cp\u003eGarrett hesitated, then nodded.\u003c/p\u003e\n\u003cp\u003e\"Buckley,\" Lopez called to the jail deputy. \"I\u0027ll be inside.\"\u003c/p\u003e\n\u003cp\u003e\"One on one?\" Buckley offered.\u003c/p\u003e\n\u003cp\u003eLopez dismissed the offer with a wave, then went through the door.\u003c/p\u003e\n\u003cp\u003eGarrett said, \"You, too, Maia.\"\u003c/p\u003e\n\u003cp\u003eShe started to protest? the look in his eyes stopped her. She followed Lopez inside.\u003c/p\u003e\n\u003cp\u003eGarrett held my eyes long enough to count to twenty.\u003c/p\u003e\n\u003cp\u003e\"I wrote the back door,\" he said. \"It was a diagnostic tool. I used it to check the integrity of files.\"\u003c/p\u003e\n\u003cp\u003eA gust of wind smacked the side of the Justice Department building and reverberated across the jail roof.\u003c/p\u003e\n\u003cp\u003e\"When the leaks started,\" I said, \"you didn\u0027t suspect that was the problem?\"\u003c/p\u003e\n\u003cp\u003e\"The back door was buried, Tres. Nobody had the pass code except me, Jimmy, and Ruby. A saboteur would have to get help from one of us, and even then he\u0027d have to be a technical whiz. I couldn\u0027t believe my partners would sabotage their own company.\u003c/p\u003e\n\u003cp\u003eI thought it was much more likely Pena was bribing employees at the beta test sites.\"\u003c/p\u003e\n\u003cp\u003e\"You should\u0027ve taken the thing out.\"\u003c/p\u003e\n\u003cp\u003e\"I tried, little bro. As things got worse, I went in and pulled the original subroutine, but it was too late. The damage was done. The betatesters were pulling the program off their machines, shutting us out of their systems. I couldn\u0027t fix all the old copies of the program. I was never even sure the back door had been the problem.\"\u003c/p\u003e\n\u003cp\u003e\"Then you should\u0027ve gone to the police.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Because?\"\u003c/p\u003e\n\u003cp\u003eGarrett turned toward the hoop, dribbled twice, shot. The ball whanged high off the backboard and bounced clean away.\u003c/p\u003e\n\u003cp\u003e\"Because I\u0027d used the damn thing myself,\" he said. \"Illegally.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me, his eyes wet green, like windshield wiper fluid.\u003c/p\u003e\n\u003cp\u003eI braced myself. \"Okay. What did you do?\"\u003c/p\u003e\n\u003cp\u003e\"Our betatest customers—one of them was Ticket Time.\"\u003c/p\u003e\n\u003cp\u003e\"The concert ticket company,\" I said. And then it hit me in face. \"You\u0027re not telling me\u003c/p\u003e\n\u003cp\u003e...\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t get anything for free, little bro. I paid. I just . . . put my requests into their computer first. Went to the head of the line. It was a dream, with the summer season about to open up.\u003c/p\u003e\n\u003cp\u003e\"You used the back door for Buffett tickets.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make it sound so goddamn trivial. I got tickets for the whole summer, almost every show—front row, centre aisle, me and Jimmy and Clyde, a couple of other buddies. Starting next week, we were going on a road trip. It seemed harmless enough. It was just that one time, little bro. Never again.\"\u003c/p\u003e\n\u003cp\u003eThe jail guard had retrieved the ball. He called, \"Hey, Navarre, you going to play on the prisoners\u0027 team this year? Guards might just win, you shoot that bad all the time.\"\u003c/p\u003e\n\u003cp\u003eThe deputy threw from the threepoint line, made a basket.\u003c/p\u003e\n\u003cp\u003eI thought about shoving the ball down his throat.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t want to get arrested for scamming Buffett tickets,\" I said. \"And now here you are, for murder.\"\u003c/p\u003e\n\u003cp\u003eGarrett looked toward the windows of the justice building.\u003c/p\u003e\n\u003cp\u003eI wanted to be furious with my brother. I wanted to strangle him. But what he\u0027d done was so ridiculous, so damn . . . Garrett like, I couldn\u0027t muster much more than exasperation.\u003c/p\u003e\n\u003cp\u003e\"If I do what Lopez wants,\" Garrett said, \"if I help the High Tech Unit, chances are pretty good we won\u0027t find anything solid enough to bust Pena. On the other hand, I\u0027ll be going on record for using my own security program for personal gain. If there were any chance I\u0027d ever work programming again, this would nail the coffin. My career would be over.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you what to do,\" I said. \"Not somebody as logical as you.\"\u003c/p\u003e\n\u003cp\u003eThe wind kicked up again, knocking me a few inches sideways. Over in the far corner of the court, the jail guard kept dribbling a steady, slow beat.\u003c/p\u003e\n\u003cp\u003e\"Last day or so,\" Garrett said, \"I\u0027ve had a lot of time to think. I\u0027ve been listening to Clyde and Armand talking about this place they know in the Yucatan—guy can live like a king, never go back to the States. They say they could set me up. Extradition is a joke.\u003c/p\u003e\n\u003cp\u003eI could screw all this, cut my losses, spend my days drinking cerveza by the beach.\"\u003c/p\u003e\n\u003cp\u003eHe looked down at his hands. They were trembling slightly.\u003c/p\u003e\n\u003cp\u003e\"And then I realized—I\u0027m feeling the same way I felt that first night Ruby McBride bought me a drink at Point Lone Star, told me she had ideas for a new startup. I feel the same way I felt when Jimmy taught me to jump trains. I start thinking—I\u0027ve been a sucker my entire goddamn life.\"\u003c/p\u003e\n\u003cp\u003eThere had been times I\u0027d longed to hear Garrett criticize himself that harshly—to admit he didn\u0027t have a realitycheck bone in his body. Now, it brought me no satisfaction.\u003c/p\u003e\n\u003cp\u003e\"You believe in possibilities,\" I told him. \"That\u0027s not all bad.\"\u003c/p\u003e\n\u003cp\u003eGarrett shook his head. \"I keep getting punished for it.\"\u003c/p\u003e\n\u003cp\u003eHe looked worse than I had ever seen him—the black eye, the chopped hair, the prison scrubs. But at that moment I realized I admired Garrett for the same reasons I resented him—his absolute faith in his friends, his unshakable belief that you could dream something and then go right out and do it. And he kept believing that, no matter how much the world kicked the crap out of him.\u003c/p\u003e\n\u003cp\u003eThe more unsettling realization was that, just for a moment, I saw Garrett the way my dad must\u0027ve seen him. For all their fights, their harsh words, their years of not speaking to each other—I suddenly understood why Dad, in the end, had left my brother everything. Garrett needed it more than I did. He was living without a net.\u003c/p\u003e\n\u003cp\u003eGarrett took hold of his armrests, bracing himself as if he were about to get up. \"I spent most of my adult life hoping you didn\u0027t turn out like me, little bro. That\u0027s why I\u0027m impatient when you try to help me. You can\u0027t get pulled into my shit. You got to do better. You got to get your own shit together.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"You getting back together with Maia?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eGarrett glowered at me, letting me know he would not accept indecision.\u003c/p\u003e\n\u003cp\u003e\"You think I should help Lopez?\" he asked me. \"You figure he\u0027s on the level?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. I think you should.\"\u003c/p\u003e\n\u003cp\u003eHe called to the guard, who tried to pass him the ball. Garrett caught it, threw it away.\u003c/p\u003e\n\u003cp\u003e\"Tres— Tell Lopez it\u0027s a go.\"\u003c/p\u003e\n\u003cp\u003eHe winked at me with his good eye, then let the guard escort him inside.\u003c/p\u003e\n\u003cp\u003eI met Lopez by the guard station. He was using their phone, and didn\u0027t seem very happy about the conversation he was having. When he saw me coming, he lowered the receiver to the cradle without saying goodbye.\u003c/p\u003e\n\u003cp\u003e\"Well?\" he asked.\u003c/p\u003e\n\u003cp\u003eI filled him in.\u003c/p\u003e\n\u003cp\u003eLopez shook his head. \"I guess I got to get out my old LPs, take a listen to Son of a Son of a Sailor. I must\u0027ve missed something.\"\u003c/p\u003e\n\u003cp\u003e\"That call anything important?\"\u003c/p\u003e\n\u003cp\u003eLopez glanced at the phone, as if to make sure he\u0027d hung it up properly. \"Nothing you need to worry about.\"\u003c/p\u003e\n\u003cp\u003eWe went down the elevator, now empty. At every locked door on our way out, some unseen guard on an unseen monitor noted our approach and buzzed us through.\u003c/p\u003e\n\u003cp\u003eWhen we got out into the foyer, Lopez reclaimed his gun. I gave back my red lawyer\u0027s tag.\u003c/p\u003e\n\u003cp\u003eMaia Lee was waiting for us at the main entrance.\u003c/p\u003e\n\u003cp\u003eI told her what Garrett had said.\u003c/p\u003e\n\u003cp\u003eShe ran a finger across the glass. \"We need to see Pena, try to break the bastard. I\u0027m not sure Garrett can survive in here long enough to help the High Tech Unit.\"\u003c/p\u003e\n\u003cp\u003e\"Any objections?\" I asked Lopez.\u003c/p\u003e\n\u003cp\u003eLopez straightened his gun belt. He stared out the window at the convict transport vans.\u003c/p\u003e\n\u003cp\u003e\"Detective?\" I asked again.\u003c/p\u003e\n\u003cp\u003eLopez reached into his back pocket and pulled out a writing pad, flipped through pages of messy notes.\u003c/p\u003e\n\u003cp\u003e\"Think I might take some flowers to the hospital,\" he said. \"Deputy Engels has a few things to tell me about W.B. Doebler. He just doesn\u0027t know it yet.\"\u003c/p\u003e\n\u003cp\u003e\"You sure that\u0027s wise?\" I asked. \"You know how tight W.B. is with the sheriff. And you\u0027re still supposed to be on leave.\"\u003c/p\u003e\n\u003cp\u003eLopez put away his notebook, met my eyes. His expression told me he was past the point of caring about wise choices.\u003c/p\u003e\n\u003cp\u003e\"You two go on ahead,\" he said. \"Don\u0027t worry about me.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll keep in touch?\"\u003c/p\u003e\n\u003cp\u003eA small, thin smile. \"Navarre. Counsellor.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-45.html","bookId":2419,"creation":"Oct 5, 2019 3:30:44 PM","modification":"Oct 5, 2019 3:30:44 PM"}
