{"id":76745,"no":46,"title":"Page 46","content":"\u003cp\u003eThen he slipped out the tinted glasses and headed for his car.\u003c/p\u003e\n\u003cp\u003eMaybe it was just the fact that I\u0027d said too many goodbyes that had turned permanent in the course of the week—to Jimmy, to Ruby, almost to Garrett. But I had to fight back a chill as Victor Lopez pulled away—a strange premonition that I wouldn\u0027t be seeing him again.\u003c/p\u003e\n\u003cp\u003eCHAPTER 39\u003c/p\u003e\n\u003cp\u003eHappy hour was under way on Sixth Street. Early evening revellers roamed from pub to pub, bands were setting up, the smells of Mexican food and mesquite barbecue filled the street.\u003c/p\u003e\n\u003cp\u003eInside the Driskill lobby, lights glowed on the marble floors. At the baby grand, a lounge singer was doing Sinatra. I had to hold Maia\u0027s hand as we walked past, just to make sure she didn\u0027t draw her weapon.\u003c/p\u003e\n\u003cp\u003eWe punched the elevator call button.\u003c/p\u003e\n\u003cp\u003eWhen the gold mirror doors slid open, we found ourselves face toface with Matthew Pena, holding a suitcase.\u003c/p\u003e\n\u003cp\u003eHis eyes got very small. \"What—\"\u003c/p\u003e\n\u003cp\u003eI pushed him back into the elevator.\u003c/p\u003e\n\u003cp\u003e\"Not leaving us yet, Pena,\" I said. \"Not by a long shot.\"\u003c/p\u003e\n\u003cp\u003eMaia came in behind me, closed the door, punched fifteen. \"How are you, Matthew?\"\u003c/p\u003e\n\u003cp\u003e\"You—\" He looked like he was swallowing something spiky. \"You, Maia—should be gone. Fired and gone. Ronald Te—\"\u003c/p\u003e\n\u003cp\u003eI punched him in the mouth.\u003c/p\u003e\n\u003cp\u003eThe suitcase clattered to the floor. Pena sank into a crouch.\u003c/p\u003e\n\u003cp\u003eMy hand hurt. I\u0027d cut a knuckle on his incisors.\u003c/p\u003e\n\u003cp\u003eMaia shook her head. \"Gut, Tres. Always the gut.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003ePena pinched his jaw. His teeth were stained with blood. \"What the hell are you thinking, Navarre? You call this private?\"\u003c/p\u003e\n\u003cp\u003eBefore I could ask what he meant, the door binged open. Wrong floor. The tenth.\u003c/p\u003e\n\u003cp\u003eA woman started to come in, did a hasty back step.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going up,\" I told her. \"Can\u0027t you tell?\"\u003c/p\u003e\n\u003cp\u003eMaia pushed the button. The door slid shut.\u003c/p\u003e\n\u003cp\u003eWhen we reached the fifteenth floor, I pulled Pena to his feet. Maia got the suitcase.\u003c/p\u003e\n\u003cp\u003eTogether we escorted Mr. Pena back into his luxury accommodations.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t even going to guess how much Pena was paying for the Cattle Baron Suite.\u003c/p\u003e\n\u003cp\u003eThe decor was cedar and bronze and granite, Lone Star motifs, plush furniture, eighteenfoot ceilings, and massive curtained windows overlooking the nighttime skyline of Austin.\u003c/p\u003e\n\u003cp\u003eTwo steps inside, Pena yanked away from me and landed a haymaker on the side of my face. There wasn\u0027t much force behind it. He tried for a second punch, but I slapped his hand down, kicked his feet out from under him. He landed on the maroon carpet.\u003c/p\u003e\n\u003cp\u003e\"Knock it off,\" I told him.\u003c/p\u003e\n\u003cp\u003eMaia put the suitcase on the bed. She opened the snaps, pulled out several bricks of cash, Pena\u0027s portable computer, and a semiautomatic pistol.\u003c/p\u003e\n\u003cp\u003eShe held up the gun by two fingers. \"New hardsell tactics, Pena?\"\u003c/p\u003e\n\u003cp\u003e\"Get up,\" I told him.\u003c/p\u003e\n\u003cp\u003eHe did, slowly, rubbing his hip. \"I was about to ransom your brother\u0027s worthless life, Navarre.\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" I said. \"How uncharacteristically noble. You want to explain?\"\u003c/p\u003e\n\u003cp\u003eHis eyes were dark and full of motion, not unlike snake pits.\u003c/p\u003e\n\u003cp\u003eMaia ejected the magazine from the pistol. \"I\u0027m disappointed, Matthew. There\u0027s no more than fifty grand here. I would\u0027ve thought you paid better.\"\u003c/p\u003e\n\u003cp\u003eHe put his thumb to his mouth, pulled it back, and looked at the blood. \"The computer, Maia. The cash was the smallest demand—just an appetizer. The real price is an electronic stock transfer.\"\u003c/p\u003e\n\u003cp\u003e\"And who\u0027s doing the demanding?\" she asked.\u003c/p\u003e\n\u003cp\u003ePena picked up an empty bottle from his champagne bucket, regarded it with disgust, dropped it again. \"You need to ask? He just hit me in the mouth.\"\u003c/p\u003e\n\u003cp\u003eMaia and I exchanged looks.\u003c/p\u003e\n\u003cp\u003e\"Um,\" I said. \"Not that I have any aversion to bilking you of your stock portfolio, but what the hell are you talking about?\"\u003c/p\u003e\n\u003cp\u003ePena glared at me. His upper lip was starting to puff up and the blood looked like lipstick. \"The email, Navarre.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. \"Sorry, amigo.\"\u003c/p\u003e\n\u003cp\u003ePena started to respond, then stopped himself.\u003c/p\u003e\n\u003cp\u003eMaia picked up a silk sock, wiped her prints off the gun and the magazine, threw everything back into the suitcase. \"Maybe you should start from the beginning, Matthew. What was this email?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I shouldn\u0027t start at all,\" he said. \"The package you put together—extremely impressive. And don\u0027t tell me it wasn\u0027t one or both of you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you liked it,\" I said. \"Tell us again what we said.\"\u003c/p\u003e\n\u003cp\u003eEye level to us, out the window, a helicopter ruttered by—a police spotlight unit, probably seeking a fledonfoot suspect. The spotlight made Matthew\u0027s white shirt glow.\u003c/p\u003e\n\u003cp\u003e\"The Heismans,\" Pena said. \"The fact I was adopted, the paperwork on my birth parents is a total blank.\"\u003c/p\u003e\n\u003cp\u003eWhen he saw we were not surprised, he seemed to interpret it as guilt.\u003c/p\u003e\n\u003cp\u003e\"Goddamn you,\" he said. \"You went to a lot of work. The Doebler child—the one born in \u002767. The fact that the father died when I was in college, the mother five years ago at a time I happened to be in Austin. Then Jimmy Doebler, and Ruby. The toxicology, the ballistics.\"\u003c/p\u003e\n\u003cp\u003eHe looked at Maia. \"Worst of all, Adrienne. How could you imply that? You know I didn\u0027t kill her.\"\u003c/p\u003e\n\u003cp\u003eLooking at him now, I could understand why so many people had been destroyed by him. If you weren\u0027t careful, you could read anything in his demeanour—concern, caring, mournfulness, vulnerability. You might even think he could be trusted.\u003c/p\u003e\n\u003cp\u003e\"Adrienne was drugged,\" Maia told him. \"Just like the others. Dwight changed his statement, took away your alibi. The only common denominator in all the murders is you.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"The traces on the betatesting. How did you do that?\"\u003c/p\u003e\n\u003cp\u003eI tried to choose my words carefully. \"You admit you sabotaged the program?\"\u003c/p\u003e\n\u003cp\u003ePena laughed. \"Well, I don\u0027t have much choice. It\u0027s all right there—every single time, every session logged. How the hell did you get into my system? Even the emails—those goddamn, hateful emails. Somehow you managed to pin them to my machine. You know I didn\u0027t send anything like that.\"\u003c/p\u003e\n\u003cp\u003eMaia walked to the window, looked out at the Austin skyline. \"You\u0027re saying you never sent me any emails, Matthew?\"\u003c/p\u003e\n\u003cp\u003e\"I called you a few times. I\u0027ll admit I was a little . . . aggressive. But I never sent you anything like—those. I never crashed your system. The rest of the shit you accused me of—breaking into your apartment, all of that—I never did that. It\u0027s just like I told you last year—the crap they claimed I did to that guy in Menlo Park. I didn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003eIt bothered me that I almost believed him. It bothered me more that the package he\u0027d described—the case against Matthew Pena— was exactly what Maia and I had come here to pressure him with, except someone had beat us to it, someone a lot better prepared.\u003c/p\u003e\n\u003cp\u003e\"Matthew,\" I said, \"I\u0027ll suspend disbelief for a moment if you\u0027ll do the same. Let\u0027s say you really did get an email like this—let\u0027s say you\u0027re not luring us into something, and you have been framed up about as well as anybody can be framed. I didn\u0027t send you any email. Neither did Maia.\"\u003c/p\u003e\n\u003cp\u003eThe colour drained from his face. \"Who the hell else would demand I help clear your brother?\"\u003c/p\u003e\n\u003cp\u003e\"What did they want, exactly?\"\u003c/p\u003e\n\u003cp\u003e\"He—\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure it\u0027s a he?\" I asked.\u003c/p\u003e\n\u003cp\u003ePena looked impatient. \"He, she, it—take your pick. He threatened to hand me to the police on a skewer. The level of documentation he\u0027d provide would clear Garrett, make me look like a multiple killer.\"\u003c/p\u003e\n\u003cp\u003e\"With what you described,\" Maia agreed, \"he\u0027s probably right.\"\u003c/p\u003e\n\u003cp\u003e\"He wanted twenty million in stock, fifty thousand cash. The stock he wanted transferred to an anonymous account. In exchange, he wouldn\u0027t use me. He\u0027d make somebody else the scapegoat.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I didn\u0027t care. I was supposed to meet you— him—tonight. At the restaurant marina, Ruby\u0027s place.\"\u003c/p\u003e\n\u003cp\u003e\"And you trusted him?\"\u003c/p\u003e\n\u003cp\u003ePena smiled thinly. \"No, Navarre. You\u0027ll notice the gun. I intended to kill you.\"\u003c/p\u003e\n\u003cp\u003eFor once, I believed him. Little statements like that really build trust.\u003c/p\u003e\n\u003cp\u003eI looked at Maia. She read my thoughts, nodded acquiescence.\u003c/p\u003e\n\u003cp\u003e\"Matthew,\" I said, \"for fifty thousand dollars, you\u0027ve just bought yourself some company.\"\u003c/p\u003e\n\u003cp\u003eDate:Thur 15 Jun 2000 18:40:26 0400 From:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ To:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ Subject: digest for 15 Jun 2000\u003c/p\u003e\n\u003cp\u003eThere is one message in this issue.\u003c/p\u003e\n\u003cp\u003eTopics:\u003c/p\u003e\n\u003cp\u003eI. reunion\u003c/p\u003e\n\u003cp\u003e{#} Replies to this digest are directed to\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eDate:Thur 15 Jun 2000 18:52:26 0100 From: little brother \u0026lt;\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ \u0026gt; Subject: reunion\u003c/p\u003e\n\u003cp\u003eMy last story—the way he found me. And I must be brief, because he requires attention.\u003c/p\u003e\n\u003cp\u003eHe came in the backyard, through the old fence, which I found more than a little ironic.\u003c/p\u003e\n\u003cp\u003eNevertheless, I was grateful he\u0027d parked in the alley. That would make it so much easier, later.\u003c/p\u003e\n\u003cp\u003eHe stood under the tree, stared up at the house through the branches.\u003c/p\u003e\n\u003cp\u003eAnd from my window, I could see the truth finally dawning on him. He walked to the back door.\u003c/p\u003e\n\u003cp\u003eI waited. I never had any doubts that he would come, and when he did, he would come alone. He had no one left to trust.\u003c/p\u003e\n\u003cp\u003eI heard his voice inside. Then his feet on the steps.\u003c/p\u003e\n\u003cp\u003eI stood to one side, in the dark little alcove that had never made any architectural sense to me, but I smiled—remembering that this was where I\u0027d hidden so many times as a child, ready to jump out and seize my playmate.\u003c/p\u003e\n\u003cp\u003eHe got to the top and froze, staring at the room ahead of him. He held a gun, but that didn\u0027t matter. I knew he would hesitate here. There was no avoiding that moment of horrified revelation.\u003c/p\u003e\n\u003cp\u003eI stepped out of the alcove, my blackjack already in motion. He didn\u0027t even have time to register the threat before the heavy end of the sap caught his skull, crumpled him to the floor.\u003c/p\u003e\n\u003cp\u003e\"Tag,\" I said.\u003c/p\u003e\n\u003cp\u003eAnd I took the syringe from my pocket.\u003c/p\u003e\n\u003cp\u003eIt\u0027s just a matter of waiting, now. Hoping the air lasts. Hoping his heart lasts. Hoping you join the reunion in time.\u003c/p\u003e\n\u003cp\u003eBut as I told you, I\u0027m not worried. Drowning is a patient art.\u003c/p\u003e\n\u003cp\u003eCHAPTER 40\u003c/p\u003e\n\u003cp\u003eMaia, Pena, and I sat in the cab of my truck.\u003c/p\u003e\n\u003cp\u003eThere were no signs of life at the marina—just moonlight on the lake, the flicker of moths across the parking lot lights. The warehouse was closed, the two HarleyDavidson hogs still parked under the stairwell. The marina gate was locked, only a few boats left in the slips. Mexican doves roosted on the tines of the forklift.\u003c/p\u003e\n\u003cp\u003eI looked at Maia. \"I could go first, scout it out.\"\u003c/p\u003e\n\u003cp\u003eMaia leaned forward so she could stare at me around Matthew.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think so.\" I looked at Pena. \"You ready, Matthew?\"\u003c/p\u003e\n\u003cp\u003e\"Do I have a choice?\"\u003c/p\u003e\n\u003cp\u003e\"Not really.\"\u003c/p\u003e\n\u003cp\u003e\"Do I get my gun back?\"\u003c/p\u003e\n\u003cp\u003eMaia said, \"Ha.\"\u003c/p\u003e\n\u003cp\u003ePena moistened his fat lip. \"Then I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003eI pulled out Erainya\u0027s Taurus 9 mm. from under the seat, loaded a clip.\u003c/p\u003e\n\u003cp\u003eMaia raised an eyebrow.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get excited,\" I said. \"You\u0027re the one who can shoot worth a damn. Let\u0027s go.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-46.html","bookId":2419,"creation":"Oct 5, 2019 3:30:44 PM","modification":"Oct 5, 2019 3:30:44 PM"}
