{"id":76525,"no":8,"title":"Page 8","content":"\u003cp\u003e\"Clyde\u0027s a bit overprotective,\" Ruby apologized. \"He runs the marina repair shop for me. He\u0027s quite good with boat engines.\"\u003c/p\u003e\n\u003cp\u003e\"I bet. They break, he shoots them.\"\u003c/p\u003e\n\u003cp\u003e\"Which brings us back to the point,\" she said. \"You shouldn\u0027t be here.\"\u003c/p\u003e\n\u003cp\u003e\"You have claim to the property?\"\u003c/p\u003e\n\u003cp\u003e\"I— No. This was always Jimmy\u0027s place. I live on my boat.\"\u003c/p\u003e\n\u003cp\u003e\"Then what were you looking for?\"\u003c/p\u003e\n\u003cp\u003eHer eyes traced the curve of the ceiling. \"Now that Jimmy\u0027s dead, your brother and I have to make some decisions. I wanted to get the company paperwork—documents we might need.\"\u003c/p\u003e\n\u003cp\u003eHer voice was as thin as drum skin. She was lying.\u003c/p\u003e\n\u003cp\u003e\"Matthew Pena,\" I said. \"He\u0027s been pressuring you to sell?\"\u003c/p\u003e\n\u003cp\u003e\"If Matthew Pena were harassing me, it would be bullshit. I\u0027d ignore it.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say harassing.\"\u003c/p\u003e\n\u003cp\u003eI could almost see her mental effort—reinforcing the facade, like a wall of loose blocks.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing to tell. Nothing . . . provable.\"\u003c/p\u003e\n\u003cp\u003e\"Pena offered to buy you out once before. You refused.\"\u003c/p\u003e\n\u003cp\u003e\"You can thank your brother and Jimmy for that.\"\u003c/p\u003e\n\u003cp\u003e\"The security problems started shortly thereafter. Your potential worth took a nosedive. Pena\u0027s made a second offer—a substantially reduced offer—and when you hesitated, Jimmy died.\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t like that,\" she insisted. \"What you\u0027re implying— Look, I know Matthew Pena.\u003c/p\u003e\n\u003cp\u003eI\u0027ve had dinner with him. I\u0027ve gone diving with him. He isn\u0027t a monster.\"\u003c/p\u003e\n\u003cp\u003eI told her about the shotgun case in Menlo Park a year ago. I told her about Pena\u0027s girlfriend Adrienne, who\u0027d also gone diving with him.\u003c/p\u003e\n\u003cp\u003eRuby\u0027s complexion looked like she\u0027d suddenly developed the flu. She stared at the empty gun on the kitchen counter. \"That\u0027s got to be other people, misconstruing the facts. Matthew would have no reason to kill anyone, especially not Jimmy.\"\u003c/p\u003e\n\u003cp\u003eMatthew, I thought. Firstname basis.\u003c/p\u003e\n\u003cp\u003e\"You talked to the police?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"They ask where you were the night Jimmy was killed?\"\u003c/p\u003e\n\u003cp\u003e\"I was working late at the marina. Lots of people saw me.\"\u003c/p\u003e\n\u003cp\u003e\"You mention Pena?\"\u003c/p\u003e\n\u003cp\u003e\"The detective, Lopez, told me not to worry about that. He told me something else, Tres—they\u0027ve already matched Garrett\u0027s gun to the bullet that killed Jimmy.\"\u003c/p\u003e\n\u003cp\u003eIt was my turn to look sick. \"When was this?\"\u003c/p\u003e\n\u003cp\u003e\"Yesterday evening.\"\u003c/p\u003e\n\u003cp\u003eAfter I\u0027d talked with Lopez. I wondered if he really had a ballistics match, or if he had just been trying to press Ruby into making a statement that would hurt Garrett. I tried not to get angry, to remind myself that all homicide detectives played games like that.\u003c/p\u003e\n\u003cp\u003e\"You believe Garrett shot Jimmy?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not.\" She was a good liar, I\u0027ll give her that.\u003c/p\u003e\n\u003cp\u003e\"Your friend Clyde Simms,\" I said. \"Clyde said there was a bastard he wanted to kill months ago. I assume he was talking about Pena?\"\u003c/p\u003e\n\u003cp\u003eHer composure was just about reassembled now—all the blocks in place. She sat back, let the cat rub his face on her diamond ring. \"You should leave now, Tres. I have a lot to do.\"\u003c/p\u003e\n\u003cp\u003e\"Unless you\u0027ve got legal right to kick me out,\" I said, \"you\u0027re the one who should go.\"\u003c/p\u003e\n\u003cp\u003eShe studied me, apparently decided the battle wasn\u0027t worth it. \"Let me get a few things upstairs.\"\u003c/p\u003e\n\u003cp\u003e\"Leave them,\" I said. \"I like you emptyhanded.\"\u003c/p\u003e\n\u003cp\u003eShe managed a sour smile. \"You are related to Garrett, aren\u0027t you? A real Southern gentleman.\"\u003c/p\u003e\n\u003cp\u003e\"See you all at the funeral service?\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t miss it.\"\u003c/p\u003e\n\u003cp\u003eOnce she\u0027d left, I loaded a full clip into the Taurus, so it would be more of a challenge the next time somebody tried to use it on me. Then I set the gun back on the counter and climbed upstairs to the loft.\u003c/p\u003e\n\u003cp\u003eOut the window, through the tree branches, I could see Ruby and Clyde walking down toward the lake. Clyde was speaking emphatically, offering Ruby his open palm, like he really wanted to give her a gift.\u003c/p\u003e\n\u003cp\u003eI thought about what Garrett had said Friday night: Ruby McBride—somebody Jimmy and I knew from way back.\u003c/p\u003e\n\u003cp\u003eI wondered how a woman like Ruby got involved with guys like Jimmy and Garrett, and how she got the loyalty of someone like Clyde Simms. I wondered what Clyde was capable of in the overprotective department.\u003c/p\u003e\n\u003cp\u003eOn Jimmy\u0027s bed was a pink cardboard cake box, the lid open, the contents spilling out.\u003c/p\u003e\n\u003cp\u003eIt contained various memorabilia—love letters signed Ruby? postcards from Jimmy\u0027s friends? dogeared photos, many of which included Garrett. The missing photos from the mantel were here, too—Jimmy and Garrett at the seawall? Jimmy\u0027s mom, Clara Doebler. Why Ruby would\u0027ve wanted these I had no idea, but divorce makes you weird. You get proprietary about odd things.\u003c/p\u003e\n\u003cp\u003eThere were no company records for Techsan.\u003c/p\u003e\n\u003cp\u003eI dug to the bottom of the cake box, came up with an old denimcovered journal. I flipped through the entries quickly—all addressed to Jimmy, each signed by his mother.\u003c/p\u003e\n\u003cp\u003eAfter reading a few lines, I realized the book was a lostchild diary.\u003c/p\u003e\n\u003cp\u003eI sometimes advised my own clients to start such diaries, to keep their hopes up when children had been taken away in custody cases, or kidnapped by exspouses. You chronicle your daily life for your child, as a way of keeping them with you, keeping faith that one day they will be able to read your words. The first entry in Clara\u0027s journal was dated 1963, about the time she\u0027d lost custody of Jimmy to the Doebler family trustees.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t remember the specifics of the court battle—only that she\u0027d had mental health problems. Jimmy had rarely talked about the custody case, at least to me, and the diary told me nothing. The entries seemed mundane—what Clara had done during the day, where she\u0027d eaten, what the weather was like, what birds she\u0027d seen in her backyard. The entries ended in mid1967, when Jimmy would\u0027ve been about ten.\u003c/p\u003e\n\u003cp\u003eThe rest of the journal was blank. Somehow all those empty lined pages, yellowed with age, made a more pathetic statement than the five years Clara had managed to chronicle. I wondered how Jimmy had felt about the journal, and why Ruby would stick it in her take box.\u003c/p\u003e\n\u003cp\u003eI went downstairs, rummaged through the roll top desk—standard bills, paperwork on the incorporation of Techsan, one folder neatly labelled Family.\u003c/p\u003e\n\u003cp\u003eI checked Jimmy\u0027s phone bills first. The police had apparently taken the most recent one, but April\u0027s statement was full of calls to other members of the Doebler clan—a lot of the same numbers I\u0027d called myself on Saturday. I recognized Faye DoeblerIngram\u0027s number. Garrett\u0027s number a dozen times.\u003c/p\u003e\n\u003cp\u003eI folded the list, set it aside.\u003c/p\u003e\n\u003cp\u003eI skimmed through the Family folder and found photocopied requests for county records, listings from the Social Security death index, deeds, marriage certificates, birth certificates. Jimmy had been looking into his own family\u0027s past, but apparently hadn\u0027t been at it very long. Most of the requests were dated only a month ago, barely enough time for any bureaucracy to respond.\u003c/p\u003e\n\u003cp\u003eI thought about what Jimmy had told me the night he died, about wanting to make amends with his family. Maybe the background search he\u0027d wanted me to do was simply that—family history. Still, something about the folder bothered me. I put it aside for later.\u003c/p\u003e\n\u003cp\u003eRobert Johnson was circling my ankles, purring, no doubt asking where his new friends with the weapons had gone.\u003c/p\u003e\n\u003cp\u003eJimmy\u0027s memorial was tonight. Garrett would be there. Ruby McBride would probably talk to him sometime today, let him know\u003c/p\u003e\n\u003cp\u003eI was staying at the dome. Better to face him now, let him know I wasn\u0027t going to stay out of his problems.\u003c/p\u003e\n\u003cp\u003eEither that, or I could make the call I was dreading to San Francisco.\u003c/p\u003e\n\u003cp\u003eRobert Johnson looked up at me smugly, his eyes half closed. \"You\u0027re lucky,\" I told him. \"You never have to visit your siblings.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 8\u003c/p\u003e\n\u003cp\u003eSunday at lunchtime, there shouldn\u0027t have been any rush hour heading into Austin from the lake, but I hit one anyway.\u003c/p\u003e\n\u003cp\u003eIt was fortyfive minutes before I pulled in front of Garrett\u0027s apartment.\u003c/p\u003e\n\u003cp\u003eThe Carmen Miranda was parked by the stairs, which may or may not have meant Garrett was home. If ballistics had come back positive, that might\u0027ve been enough for Lopez to get an arrest warrant, start the indictment process, after which things would happen fast. I ran down all the possibilities I didn\u0027t like—all the things that could\u0027ve gone wrong since I\u0027d left Garrett on Friday afternoon. I hoped he\u0027d gotten himself a lawyer.\u003c/p\u003e\n\u003cp\u003eI parked in the shade, sat with the engine idling, and thought about what to say if Garrett were home. Just checking in. Been indicted yet? Still in debt a few million?\u003c/p\u003e\n\u003cp\u003eWant to grab a beer?\u003c/p\u003e\n\u003cp\u003eI walked up the steps of The Friends.\u003c/p\u003e\n\u003cp\u003eWhen I knocked at Garrett\u0027s door, a woman\u0027s muffled voice said, \"Just a minute.\"\u003c/p\u003e\n\u003cp\u003eEven then, I didn\u0027t see it coming.\u003c/p\u003e\n\u003cp\u003eI stood there stupidly as the door opened, the woman looking down at a fistful of bills, saying, \"I don\u0027t have correct change.\"\u003c/p\u003e\n\u003cp\u003eAnd then she looked up.\u003c/p\u003e\n\u003cp\u003eShe was barefoot, dressed in khaki walking shorts, an army green tank top. Her skin was a rich honey colour, her hair long and glossy black.\u003c/p\u003e\n\u003cp\u003eSome vestigial gland in my body started to work, dumping a few cc\u0027s of acid into my bloodstream—just enough to make every vein burn.\u003c/p\u003e\n\u003cp\u003e\"Hello, Tres,\" Maia Lee said. \"You\u0027re not the pizza man.\"\u003c/p\u003e\n\u003cp\u003eShe wore no makeup, no jewellery. Her eyes glowed with that internal heat which makes her a formidable enemy, or friend. If she was at all ruffled to see me again, after nearly two years, she hid it superbly.\u003c/p\u003e\n\u003cp\u003e\"Okay, I\u0027ll bite,\" I managed. \"Why are you in my brother\u0027s apartment?\"\u003c/p\u003e\n\u003cp\u003e\"Nice to see you, too.\"\u003c/p\u003e\n\u003cp\u003e\"Let me rephrase that. Where the hell is Garrett?\"\u003c/p\u003e\n\u003cp\u003eShe stepped back, out of the doorway, motioned me inside.\u003c/p\u003e\n\u003cp\u003eI brushed past her. Acid kept coursing around my circulatory system. My hands were sweating like an adolescent\u0027s.\u003c/p\u003e\n\u003cp\u003eNobody was in the living room, just Dickhead the parrot up on his windowledge perch.\u003c/p\u003e\n\u003cp\u003eMusic was playing—Buffett\u0027s greatest hits, but set to Maia\u0027s volume level, so soft, intimate, for Garrett\u0027s place that it struck me as insulting.\u003c/p\u003e\n\u003cp\u003eI walked through the kitchen, into the bedroom. No suitcase on the bed. No unpacked Maia clothes.\u003c/p\u003e\n\u003cp\u003eOut on the shoeboxsized deck, Garrett was sitting in a patio chair, the tails of an XXL\u003c/p\u003e\n\u003cp\u003eHawaiian shirt melting around his waist, a John Deere gimme cap shading his eyes.\u003c/p\u003e\n\u003cp\u003ePapers littered the deck around him. He had an open beer at his side, a laptop set up on a TV tray, a joint hanging off the corner of his mouth. Hunter S. Thompson does South Texas.\u003c/p\u003e\n\u003cp\u003e\"I see you made your calls,\" I told him.\u003c/p\u003e\n\u003cp\u003eHe missed a stroke on the keyboard, glared up at me. He spoke with the joint still in his mouth. \"I\u0027m busy. Wait a minute.\"\u003c/p\u003e\n\u003cp\u003eHe went back to typing—the way Garrett always types, with a vengeance, as if the keys needed to learn their lesson.\u003c/p\u003e\n\u003cp\u003eI stepped to the railing, tried to put aside the appealing idea of throwing Garrett\u0027s laptop off the balcony.\u003c/p\u003e\n\u003cp\u003eOf course, I wouldn\u0027t have been the first to have that thought at The Friends. The alley below was littered with broken couches, smashed TVs, mounds of clothes still on hangers.\u003c/p\u003e\n\u003cp\u003eFloorboards creaked behind me.\u003c/p\u003e\n\u003cp\u003eMaia stood in the doorway, her arms crossed, pizza money still crumpled in one hand.\u003c/p\u003e\n\u003cp\u003eThe sunlight through the canopy of branches\u003c/p\u003e\n\u003cp\u003emade her face and shoulders look like camouflage. I resented the fact that she looked even better than I\u0027d remembered. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-8.html","bookId":2419,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
