{"id":109453,"no":14,"title":"Page 14","content":"\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eYOUR PUNY WORM GOD WEAPONS ARE USELESS AGAINST MY SUPERIOR CHRISTMAS KUNG FU\u003c/p\u003e\n\u003cp\u003eMolly slipped out the back door of the cabin and around the outside wall until she could see the tall figure standing before her picture window. The fallen wires had stopped sparking out by the street and the stars and moon barely cut through the darkness at all. Strangely enough, she could clearly see the man by her front window because there was a faint glow shining around him.\u003c/p\u003e\n\u003cp\u003eRadioactive, Molly thought. He wore the long black duster favored by sand pirates. Why, though, would a desert marauder be out in a rainstorm?\u003c/p\u003e\n\u003cp\u003eShe assumed the Hasso No Kamae stance, back straight, the sword held high and tilted back over her right shoulder, the sword guard at mouth level, her left foot forward. She was three steps from delivering a deathblow to the intruder. The sword balanced perfectly in her grip, so perfectly that it seemed to weigh nothing at all. She could feel the wet pine needles under her bare feet and wished that she\u0027d put on shoes before dashing out into the night. The cold rain against her bare skin made her think that maybe a sweater would have been a good idea as well.\u003c/p\u003e\n\u003cp\u003eThe glowing man looked toward the opposite corner of the cabin and Molly made her move. Three soft steps and she stood behind him; the edge of her blade lay across the side of his neck. A quick pull and she would cut him to his vertebrae.\u003c/p\u003e\n\u003cp\u003e\"Move and die,\" Molly said.\u003c/p\u003e\n\u003cp\u003e\"Nuh-uh,\" said the glowing man.\u003c/p\u003e\n\u003cp\u003eThe tip of Molly\u0027s sword extended a foot beyond the stranger\u0027s face. He looked at the blade. \"I like your sword. Want to see mine?\"\u003c/p\u003e\n\u003cp\u003e\"You move, you die,\" Molly said, thinking that it wasn\u0027t the sort of thing you should have to repeat. \"Who are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Raziel,\" said Raziel. \"It\u0027s not the sword of the Lord, or anything. Not for destroying cities, just for fighting one or two enemies at a time, or slicing cold cuts. Do you like salami?\"\u003c/p\u003e\n\u003cp\u003eMolly didn\u0027t quite know how to proceed. This glowing sand pirate seemed perfectly unafraid, perfectly unconcerned, in fact, that she was holding a razor-sharp blade against his carotid artery. \"Why are you looking in my window in the middle of the night?\"\u003c/p\u003e\n\u003cp\u003e\"Because I can\u0027t see through the wooden part.\"\u003c/p\u003e\n\u003cp\u003eMolly snapped her wrists back and smacked Raziel in the side of the head with the flat of her blade.\u003c/p\u003e\n\u003cp\u003e\"Ouch.\"\u003c/p\u003e\n\u003cp\u003e\"Who are you and why are you here?\" Molly said. She snapped her blade back to threaten another smack, and in that instant Raziel stepped away from her, spun, and drew a sword from the middle of his back.\u003c/p\u003e\n\u003cp\u003eMolly hesitated, just a second, then approached and snapped her blade down, this time in a real attack aimed at his shoulder. Raziel parried the blow and riposted. Molly swept his blade aside and came around with her blade for a cut to the left arm. Raziel got his sword around just in time to deflect her blade down his arm instead of across it. The razor-sharp tashi took a long swath of fabric from his coat, as well as a thin slice of flesh down his forearm.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said, looking at his now-flapping sleeve.\u003c/p\u003e\n\u003cp\u003eThere was no blood. Just a dark stripe where the flesh was gone. He started hacking, his sword describing an infinity pattern in the air before him as he drove Molly back through the pine forest toward the road. She quickstepped back, parrying some blows, dodging others, stepping around trees, kicking up wet pine straw as she moved. She could only see her glowing attacker, his sword shining now as well, the darkness around her so complete that she moved only by memory and feel. As she deflected one of the blows, her heel caught on a root and she lost her balance. She started to go over backward and spun as if to catch herself. Raziel\u0027s momentum carried him forward, his sword swinging for a target that a second before had been two feet higher, and he ran right onto Molly\u0027s blade. She was bent over forward; the blade extended back across her rib cage and through Raziel, extending another two feet out his back. They were frozen there for a moment\u0026nbsp; -\u0026nbsp; him bent over her back, stuck together with her sword\u0026nbsp; -\u0026nbsp; like two dogs who needed a bucket of water thrown on them.\u003c/p\u003e\n\u003cp\u003eFrom a crouch, Molly yanked the blade out, then spun, ready to deliver a coup de grace that would cut her enemy from collarbone to hip.\u003c/p\u003e\n\u003cp\u003e\"Ouch,\" said Raziel, looking at the hole in his solar plexus. He threw his sword on the ground and prodded the wound with his fingers. \"Ouch,\" he said again, looking up at Molly. \"You don\u0027t thrust with that kind of sword. You\u0027re not supposed to thrust with that kind of sword. No fair.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re supposed to die now,\" Molly said.\u003c/p\u003e\n\u003cp\u003e\"Nuh-uh,\" said Raziel.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t say nuh-uh to death. That\u0027s sloppy debating.\"\u003c/p\u003e\n\u003cp\u003e\"You poked me with your sword, and cut my coat.\" He held up his damaged arm.\u003c/p\u003e\n\u003cp\u003e\"Well, you came creeping around here in the middle of the night looking in my windows, and you pulled a sword on me.\"\u003c/p\u003e\n\u003cp\u003e\"I was just showing it to you. I don\u0027t even like it. I want to get web slingers for my next mission.\"\u003c/p\u003e\n\u003cp\u003e\"Mission? What mission? Did Nigoth send you? He is no longer my higher power, by the way. This is not the kind of support I need.\"\u003c/p\u003e\n\u003cp\u003e\"Fear not,\" said Raziel, \"for I am a messenger of the Lord, come to bring a miracle for the Nativity.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re what?\"\u003c/p\u003e\n\u003cp\u003e\"Fear not!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not afraid, you nitwit, I just kicked your ass. Are you telling me you\u0027re an angel?\"\u003c/p\u003e\n\u003cp\u003e\"Come to bring Christmas joy to the child.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a Christmas angel?\"\u003c/p\u003e\n\u003cp\u003e\"I bring tidings of great joy, which shall be to all men. Well, not really. This time it\u0027s just to one boy, but I memorized that speech, so I like to use it.\"\u003c/p\u003e\n\u003cp\u003eMolly let her guard down, the tip of her sword pointed at the ground now. \"So the glowing stuff on you?\"\u003c/p\u003e\n\u003cp\u003e\"Glory of the Lord,\" said the angel.\u003c/p\u003e\n\u003cp\u003e\"Oh piss,\" said Molly. She slapped herself in the forehead. \"And I killed you.\"\u003c/p\u003e\n\u003cp\u003e\"Nuh-uh.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t start with the nuh-uh again. Should I call an ambulance or a priest or something?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m healing.\" He held up his forearm and Molly watched as the faintly glowing skin expanded to cover the wound.\u003c/p\u003e\n\u003cp\u003e\"Why in the hell are you here?\"\u003c/p\u003e\n\u003cp\u003e\"I have a mission\u0026nbsp; - \u0026amp;raquo;\u003c/p\u003e\n\u003cp\u003e\"Not here on Earth, here at my house.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re attracted to lunatics.\"\u003c/p\u003e\n\u003cp\u003eMolly\u0027s first instinct was to take his head, but on second thought, she was standing in the middle of a pine forest, in freezing rain and gale-force winds, naked, holding a sword, and talking to an angel, so he wasn\u0027t exactly announcing the Advent. She was a lunatic.\u003c/p\u003e\n\u003cp\u003e\"You want to come inside?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Do you have hot chocolate?\"\u003c/p\u003e\n\u003cp\u003e\"With minimarshmallows,\" said the Warrior Babe.\u003c/p\u003e\n\u003cp\u003e\"Blessed are the minimarshmallows,\" the angel said, swooning a little.\u003c/p\u003e\n\u003cp\u003e\"Come on, then,\" Molly said as she walked away muttering, \"I can\u0027t believe I killed a Christmas angel.\"\u003c/p\u003e\n\u003cp\u003e\"Yep, you screwed the pooch on this one,\" said the Narrator.\u003c/p\u003e\n\u003cp\u003e\"Nuh-uh,\" said the angel.\u003c/p\u003e\n\u003cp\u003e\"Get that piano against the door!\" Theo yelled.\u003c/p\u003e\n\u003cp\u003eThe bolts on the front door had completely splintered away, and the Masonite buffet table was flexing under the blows of whatever the undead were using for a battering ram. The entire chapel shook with each impact.\u003c/p\u003e\n\u003cp\u003eRobert and Jenny Masterson, who owned Brine\u0027s Bait, Tackle, and Fine Wines, started rolling the upright piano from its spot by the Christmas tree. Both had been through some harrowing moments in Pine Cove\u0027s history, and they tended to keep their heads in an emergency.\u003c/p\u003e\n\u003cp\u003e\"Anyone know how to lock these casters?\" Robert called.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll need to brace it just the same,\" Theo said. He turned to Ben Miller and Nacho Nunez, who seemed to have teamed up for the battle. \"You guys look for more heavy stuff to brace the door.\"\u003c/p\u003e\n\u003cp\u003e\"Where did they get a battering ram?\" Tucker Case asked. He was examining the big rubber coasters on the piano, trying to figure out how to lock them.\u003c/p\u003e\n\u003cp\u003e\"Half the forest has blown down tonight,\" said Lena. \"Monterey pines don\u0027t have a taproot. They probably just found one that they could lift.\"\u003c/p\u003e\n\u003cp\u003e\"Turn it on its back,\" Tuck said. \"Brace it against the table.\"\u003c/p\u003e\n\u003cp\u003eThe ram hit the doors and they popped open six inches. The table hooked under the heavy brass handles was bending and beginning to split. Three arms came through the opening, half a face, the eye drooling out of a rotted socket.\u003c/p\u003e\n\u003cp\u003e\"Push!\" Tuck screamed.\u003c/p\u003e\n\u003cp\u003eThey ran the piano up against the braced table, slamming the doors on the protruding limbs. The battering ram hit again, popping the doors open, driving the men back, and rattling their teeth. The undead arms pulled back from the gap. Tuck and Robert shoved the piano against the door and it shut again. Jenny Masterson threw her back against the piano and looked back at the onlookers, twenty or so people who seemed too stunned or too scared to move.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t just stand there, you useless fucks! Help us brace this. If they get in, they\u0027re going to eat your brains, too.\"\u003c/p\u003e\n\u003cp\u003eFive men pointed flashlights at each other in a \"Me? You? Us?\" inspection, then shrugged and ran to help push the piano.\u003c/p\u003e\n\u003cp\u003e\"Nice pep talk,\" said Tuck, his sneakers squeaking on the pine floor as he pushed.\u003c/p\u003e\n\u003cp\u003e\"Thanks, I\u0027m good with the public,\" Jenny said. \"Waitress for twenty years.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, you waited on us at H.P.\u0027s. Lena, it\u0027s our waitress from the other night.\"\u003c/p\u003e\n\u003cp\u003e\"Nice to see you again, Jenny,\" said Lena, just as the battering ram hit the door again, knocking her to the floor. \"I haven\u0027t seen you at yoga class...\"\u003c/p\u003e\n\u003cp\u003e\"Clear the way, clear the way, clear the way!\" called Theo. He and Nacho Nu\u0026amp;ntilde;ez were coming across the floor from the back room carrying an eight-foot-long oak pew. Behind them, Ben Miller was wrestling a pew across the floor by himself. Several of the men who were holding the barricade broke ranks to help him.\u003c/p\u003e\n\u003cp\u003e\"Cantilever these against the piano and nail them to the floor,\" Theo said.\u003c/p\u003e\n\u003cp\u003eThe heavy benches went up on a diagonal against the back of the piano and Nacho Nu\u0026amp;ntilde;ez toenailed them to the floor.\u003c/p\u003e\n\u003cp\u003eThe benches flexed a little with each blow of the battering ram, but they held fast. After a few seconds, the pounding stopped. Again, there was only the noise of the wind and the rain. Everyone played flashlights around the room, waiting for whatever would come next.\u003c/p\u003e\n\u003cp\u003eThen they heard Dale Pearson\u0027s voice at the side of the chapel. \"This way. Bring it this way.\"\u003c/p\u003e\n\u003cp\u003e\"Back door,\" someone shouted. \"They\u0027re carrying it around to the back door.\"\u003c/p\u003e\n\u003cp\u003e\"More pews,\" Theo yelled. \"Nail them up in the back. Hurry, that door\u0027s not as heavy as the front, it won\u0027t take two hits like that.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t they just come through one of the walls?\" asked Val Riordan, who was trying to join in the effort to hold the line, despite the handicap of her five-hundred-dollar shoes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hoping that won\u0027t occur to them,\" Theo said.\u003c/p\u003e\n\u003cp\u003eSupervising the undead was worse than dealing with a construction crew full of drunks and cokeheads. At least his living crews had all of their limbs and most of their physical coordination. This bunch was pretty floppy. Twenty of the undead were hefting a broken pine-tree trunk a foot thick and as long as a car.\u003c/p\u003e\n\u003cp\u003e\"Move the goddamn tree,\" Dale growled. \"What am I paying you for?\"\u003c/p\u003e\n\u003cp\u003e\"Is he paying us?\" asked Marty in the Morning, who was hefting at midtree, on a jagged, broken branch. \"Are we getting paid?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe you ate all the brains,\" Warren Talbot, the dead painter, said. \"That was supposed to be for everyone.\"\u003c/p\u003e\n\u003cp\u003e\"Would you shut the fuck up and get the tree around to the back door,\" Dale yelled, waving his snub-nose revolver.\u003c/p\u003e\n\u003cp\u003e\"The gunpowder gave them a nice peppery flavor,\" Marty said.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t rub it in,\" said Bess Leander. \"I\u0027m so hungry.\"\u003c/p\u003e\n\u003cp\u003e\"There will be enough for everyone once we get inside,\" said Arthur Tannbeau, the citrus farmer.\u003c/p\u003e\n\u003cp\u003eDale could tell this wasn\u0027t going to work. They were too feeble, they couldn\u0027t get enough strength behind the battering ram. The living would be barricading the back door even now.\u003c/p\u003e\n\u003cp\u003eHe pulled some of the more decayed undead off the tree and pushed in those who seemed to have much of their normal strength, but they were trying to run up a narrow set of stairs carrying a thousand-pound tree trunk. Even a crew of healthy, living people wouldn\u0027t be able to get purchase in this mud. The tree trunk hit the door with an anemic thud. The door flexed just enough to reveal that the living had reinforced it.\u003c/p\u003e\n\u003cp\u003e\"Forget it. Forget it,\" said Dale. \"There are other ways we can get to them. Fan out in the parking lot and start looking for keys in the ignition of people\u0027s cars.\"\u003c/p\u003e\n\u003cp\u003e\"Drive-thru snackage?\" said Marty in the Morning. \"I like it.\"\u003c/p\u003e\n\u003cp\u003e\"Something like that,\" Dale said. \"Kid, you with the wax face. You\u0027re a motorhead, can you hot-wire a car?\"\u003c/p\u003e\n\u003cp\u003e\"Not with only one arm,\" Jimmy Antalvo slurred. \"That dog took my arm.\"\u003c/p\u003e\n\u003cp\u003e\"It stopped,\" Lena said. She was checking Tuck\u0027s wounds. Blood was seeping through the bandages on his ribs.\u003c/p\u003e\n\u003cp\u003eTheo turned away from the pilot and looked around the room. The emergency lighting was starting to dim already and his flashlight was panning them like he was looking for suspects. \"No one left their keys in their car, did they?\"\u003c/p\u003e\n\u003cp\u003eThere were murmurs of denial and heads shaking.\u003c/p\u003e\n\u003cp\u003eVal Riordan had a perfectly painted eyebrow raised at him. There was a question there, even if it was unspoken.\u003c/p\u003e\n\u003cp\u003e\"Because that\u0027s what I\u0027d do,\" Theo said. \"I\u0027d get a car up to speed and crash it right through the wall.\"\u003c/p\u003e\n\u003cp\u003e\"That would be bad,\" said Gabe.\u003c/p\u003e\n\u003cp\u003e\"That parking lot had two inches of water and mud the last time I saw it,\" Tucker Case said. \"Not every car is going to get up to speed in that.\"\u003c/p\u003e\n\u003cp\u003e\"Look, we need to get some help,\" Theo said. \"Someone has to go for help.\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t get ten feet,\" Tuck said. \"As soon as you open a door or break a window, they\u0027ll be waiting.\"\u003c/p\u003e\n\u003cp\u003e\"What about the roof?\" said Josh Barker.\u003c/p\u003e\n\u003cp\u003e\"Shut up, kid,\" Tuck said. \"There\u0027s no way up to the roof.\"\u003c/p\u003e\n\u003cp\u003e\"Are we going to cut off his head now?\" said Josh.\u003c/p\u003e\n\u003cp\u003e\"You have to sever the spinal column or they just keep coming.\"\u003c/p\u003e\n\u003cp\u003e\"Look,\" Theo said, playing his flashlight across the center of the ceiling. There was a trapdoor up there, painted over and latched, but it was definitely there.\u003c/p\u003e\n\u003cp\u003e\"It leads to the old bell tower,\" Gabe Fenton said. \"No bell, but it does open onto the roof.\"\u003c/p\u003e\n\u003cp\u003eTheo nodded. \"From the roof someone could tell where they all were before making his move.\"\u003c/p\u003e\n\u003cp\u003e\"That hatch is thirty feet up. There\u0027s no way to get to it.\"\u003c/p\u003e\n\u003cp\u003eSuddenly the high chirp of a barking bat came from above them. A half-dozen flashlights swung around to spotlight Roberto, who was hanging upside down from the star atop the Christmas tree.\u003c/p\u003e\n\u003cp\u003e\"Molly\u0027s tree,\" said Lena.\u003c/p\u003e\n\u003cp\u003e\"It looks sturdy enough,\" said Gabe Fenton.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go,\" said Ben Miller. \"I\u0027m still in pretty good shape. If I have to make a run for it, I can.\"\u003c/p\u003e\n\u003cp\u003e\"Right there, that proves it,\" said Tuck, an aside to Lena. \"No guy with tiny balls would volunteer for that. See how the dead lie.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m driving an old Tercel,\" Ben said. \"I don\u0027t think you want me trying to make a run for help in that.\"\u003c/p\u003e\n\u003cp\u003e\"What we need is a Hummer,\" said Gabe.\u003c/p\u003e\n\u003cp\u003e\"Yeah, or even a friendly hand job,\" said Tuck. \"But that\u0027s later. For now, we need a four-wheel drive.\"\u003c/p\u003e\n\u003cp\u003e\"You really want to try this?\" Theo asked Ben.\u003c/p\u003e\n\u003cp\u003eThe athlete nodded. \"I\u0027ve got the best chance of getting out. Those I can\u0027t outrun I\u0027ll just go through.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, then,\" said Theo. \"Let\u0027s get that tree over to the middle of the room.\"\u003c/p\u003e\n\u003cp\u003e\"Not so fast,\" said Tuck, patting his bandages. \"I don\u0027t care how fast Micro-nads is, Santa still has two bullets in his gun.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stupidest-angel-pine-cove-3/page-14.html","bookId":1562,"creation":"Oct 5, 2019 11:37:37 PM","modification":"Oct 5, 2019 11:37:37 PM"}
