{"id":109454,"no":15,"title":"Page 15","content":"\u003cp\u003eChapter 19\u003c/p\u003e\n\u003cp\u003eUP ON THE ROOFTOP, CLICK, CLICK, CLICK\u003c/p\u003e\n\u003cp\u003eThis is what it\u0027s all been about, thought Ben Miller as he climbed into the tiny bell tower atop the chapel. It had taken ten minutes to saw through the painted-closed seams of the hatch with the bread knife, but finally he\u0027d made it, thrown the latch, and crawled from the top of the Christmas tree into the bell tower. There was just enough room to stand, his feet on narrow ledges around the hatch. Thankfully, the bell had been taken away a long time ago. The bell tower was enclosed by louvered vents and the wind whistled through like there was nothing there at all. He was pretty sure he could kick through the vents, hundred-year-old wood, after all, then make his way across the steep roof, drop off whichever side looked safe, and make it to the parking lot and the red Explorer he was holding the keys for. Thirty miles south to the highway-patrol post and help would be on the way.\u003c/p\u003e\n\u003cp\u003eAll of the years after high school and college when he had continued to train, all the hours of roadwork, all the weights and swimming and high-protein diets, it all came down to this moment. Keeping himself in shape all these years when no one really seemed to care would finally pay off. Anything out there that he couldn\u0027t outrun, he could take out with a lowered shoulder. (He\u0027d played one season as a jay-vee halfback in addition to his varsity track career.)\u003c/p\u003e\n\u003cp\u003e\"You okay, Ben?\" Theo yelled from below.\u003c/p\u003e\n\u003cp\u003e\"Yeah. I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003eHe took a deep breath, braced his back against one side of the bell tower, then kicked at the louvered slats on the opposite side. They broke away on the first kick and he was nearly launched out on the roof feetfirst. He fought to get his balance\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;turned around on his stomach and scooted backward out the opening onto the roof. Facedown, he was looking down the length of the Christmas tree at a dozen hopeful faces below.\u003c/p\u003e\n\u003cp\u003e\"Hold tight. I\u0027ll be back soon with help,\" he said. Then he pushed back until he was on his hands and knees on the peak of the roof, cold wetness cutting everywhere he touched.\u003c/p\u003e\n\u003cp\u003e\"Please, bitch,\" came a voice from right by Ben\u0027s ear. He jumped sideways, and started to slide down the roof. Something caught his sweater, pulling him back, then something hard and cold was pressed against his forehead.\u003c/p\u003e\n\u003cp\u003eThe last thing he heard was Santa saying, \"Pretty fucking tricky for a jock.\"\u003c/p\u003e\n\u003cp\u003eBelow, in the chapel, they heard the gunshot.\u003c/p\u003e\n\u003cp\u003eDale Pearson held the dead track star by the back of the collar, thinking, Eat now, or save it for after the massacre? Below him on the ground, the rest of the undead were begging for treats. Warren Talbot, the landscape painter, had made his way halfway up the pine-tree trunk that Dale had used to climb up on the roof.\u003c/p\u003e\n\u003cp\u003e\"Please, please, please, please,\" said Warren. \"I\u0027m so hungry.\"\u003c/p\u003e\n\u003cp\u003eDale shrugged and let go of Ben Miller\u0027s collar, then gave the body a shove with his boot, sending it sliding down the roof and off the side to the hungry mob. Warren looked behind him at where the body had fallen, then at Dale.\u003c/p\u003e\n\u003cp\u003e\"You bastard. Now I\u0027ll never get any.\"\u003c/p\u003e\n\u003cp\u003eDisgusting sucking sounds were rising from below.\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, the quick and the dead, Warren. The quick and the dead.\"\u003c/p\u003e\n\u003cp\u003eThe dead painter slid back down his tree and out of sight.\u003c/p\u003e\n\u003cp\u003eDale had some revenge to take. He stuck his head inside the bell tower and looked down at the horrified faces below. The wiry little biologist was climbing up the Christmas tree toward the open hatch.\u003c/p\u003e\n\u003cp\u003e\"Come on up,\" screamed Dale. \"We haven\u0027t even gotten to the main course.\"\u003c/p\u003e\n\u003cp\u003eDale spotted his ex-wife, Lena, staring up, and the blond guy who had charged them with the buffet table had his arm around her.\u003c/p\u003e\n\u003cp\u003e\"Die, slut!\" Dale let go of the edge of the bell tower and aimed the .38 down the Christmas tree at Lena. He saw her eyes go wide, then something hit him in the face, something furry and sharp. Claws cut into his cheeks and scratched at his eyes. He grabbed for his attacker and in doing so lost his balance and fell backward. He slid down the side of the roof and off the edge onto his feasting minions.\u003c/p\u003e\n\u003cp\u003e\"Roberto!\" Tuck yelled. \"Get back in here.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s gone,\" said Theo. \"He\u0027s outside.\"\u003c/p\u003e\n\u003cp\u003eTuck started to climb up the Christmas tree behind Gabe. \"I\u0027ll get him. Let me come up and call him.\"\u003c/p\u003e\n\u003cp\u003eTheo grabbed the pilot around the waist and pulled him back. \"Close and lock the hatch, Gabe.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Tuck said.\u003c/p\u003e\n\u003cp\u003eGabe Fenton looked down briefly, then his eyes went wide when he realized how high above the floor he was. He quickly pushed the bell-tower hatch shut and latched it.\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be okay,\" said Lena. \"He got away.\"\u003c/p\u003e\n\u003cp\u003eGabe Fenton backed down the Christmas tree. When he got to the lower branches, he felt some hands at his waist, steadying him down the last few steps. When he hit the floor, he turned around into Valerie Riordan\u0027s arms. He pushed away so as not to smudge her makeup. She pulled him out of the branches of the tree.\u003c/p\u003e\n\u003cp\u003e\"Gabe,\" she said. \"You know when I said you weren\u0027t engaged in the real world?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"I just wanted you to know that. In case our brains are eaten by zombies without me having a chance to say it.\"\u003c/p\u003e\n\u003cp\u003e\"That means a lot to me, Val. Can I kiss you?\"\u003c/p\u003e\n\u003cp\u003e\"No, sweetheart, I left my purse in the car and don\u0027t have any lipstick to touch up. But we can knock out one last stand-up quickie in the basement before we die if you\u0027d like.\" She smiled.\u003c/p\u003e\n\u003cp\u003e\"What about the kid at the Thrifty-Mart?\"\u003c/p\u003e\n\u003cp\u003e\"Squirrel porn?\" She raised a perfectly drawn eyebrow.\u003c/p\u003e\n\u003cp\u003eHe took her by the hand. \"Yes, I think I\u0027d like that,\" he said, leading her to the back room and the stairs.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that smell?\" Theo Crowe said, remarkably glad to turn his attention away from Gabe and Val. \"Anybody smell that? Tell me that\u0027s not\u0026nbsp;\u0026nbsp;- \u0026amp;raquo;\u003c/p\u003e\n\u003cp\u003eSkinner was sniffing the air and whimpering.\u003c/p\u003e\n\u003cp\u003e\"What is that?\" Nacho Nunez was following the smell to one of the barricaded windows. \"It\u0027s coming from over here.\"\u003c/p\u003e\n\u003cp\u003e\"Gasoline,\" said Lena. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-stupidest-angel-pine-cove-3/page-15.html","bookId":1562,"creation":"Oct 5, 2019 11:37:37 PM","modification":"Oct 5, 2019 11:37:37 PM"}
