{"id":82459,"no":1,"title":"Page 1","content":"\u003cp\u003eI was ready to become a vampire. I stood alone in the middle of Dullsville\u0027s cemetery, dressed in a black corset minidress, fishnet stockings, and my signature combat boots. I held a small bouquet of dead black roses in my black fingerless gloves. A vintage midnight- colored lace veil dripped down over my pale face, gracefully shrouding my black lipstick and eye shadow.\u003c/p\u003e\n\u003cp\u003eMy vampire to be, Alexander Sterling, wearing a gray pallbearer\u0027s suit and hat, waited a few yards ahead of me by our gothic altar--a closed coffin adorned with a candelabra and a pewter goblet. The scene was breathtaking. Fog floated through the graveyard like wayward ghosts. Candles flickered atop tombstones and were scattered alongside graves. A group of bats hovered over a cluster of lonely trees. Raindrops began to fall as the faint sound of screeching violins and a discordant harpsichord sent icy chills through my veins.\u003c/p\u003e\n\u003cp\u003eI had waited an eternity for this moment. My childhood fantasy was now coming true--I would be a dark angel of the night. I was as excited as a groupie who was about to marry a rock star.\u003c/p\u003e\n\u003cp\u003eTiny torches lit my path, like a gothic runway. But as I took my first step toward Alexander, I began to wonder if I was making the right choice. My heart started to race as I proceeded forward. Images of the life I would be leaving behind flashed before me. My mom helping me sew a black velvet tote for my home ec. project. I took a step. Watching Dracula on DVD with my dad. Another step. Even my nerdy brother, Billy Boy, kindly helping me with my math homework. Step. My best friend, Becky, and I trying to climb the Mansion\u0027s gate. Step. My new kitty, Nightmare, gently purring in my arms. Step. They all began to haunt me.\u003c/p\u003e\n\u003cp\u003eIn one bite my life would change forever.\u003c/p\u003e\n\u003cp\u003eI was leaving a boring, safe, yet love-filled world of the living and committing an eternity to a dangerous, unknown, darkened world of the undead.\u003c/p\u003e\n\u003cp\u003eAs I continued to walk down the cemetery aisle, I could see the back of Alexander who, now only a few feet away, lifted a goblet from the coffin.\u003c/p\u003e\n\u003cp\u003eI reminded myself I was making the right decision. I wouldn\u0027t have to spend morbidly long daylight hours in Dullsville High. I\u0027d have the ability to fly. And most important, I would be bonding with my true love, for all eternity.\u003c/p\u003e\n\u003cp\u003eI finally reached the coffin and stood alongside Alexander. He slid his white-gloved hand in mine, his plastic spider ring shining in the candlelight. He raised the pewter goblet to the moon and took a long drink. My heart raced as he passed it to me and I hesitantly lifted my veil from over my mouth. My hand was shaking, so the dark liquid wavered in the goblet.\u003c/p\u003e\n\u003cp\u003e\"Maybe you aren\u0027t--,\" Alexander started, and put his hand over the glass.\u003c/p\u003e\n\u003cp\u003e\"I am!\" I argued defiantly. I pulled the goblet back and gulped the sweet, thick liquid.\u003c/p\u003e\n\u003cp\u003eI began to feel light-headed. The fog thickened around us. I could barely see Alexander\u0027s silhouette as he replaced the goblet on the coffin and then turned to me. With his white gloves, he gently lifted the black veil away from my face.\u003c/p\u003e\n\u003cp\u003eNow I could see clearly. Only I wasn\u0027t sure of what I was seeing. Instead of Alexander\u0027s usual long black hair, I noticed light- colored hair poking out from underneath his pallbearer\u0027s hat.\u003c/p\u003e\n\u003cp\u003eI gasped. It couldn\u0027t be!\u003c/p\u003e\n\u003cp\u003e\"Jagger--,\" I exclaimed, frozen.\u003c/p\u003e\n\u003cp\u003eBut when I looked into his eyes, I didn\u0027t see Alexander\u0027s rival\u0027s blue and green eyes that had once hypnotized me by the Mansion\u0027s gazebo. And they weren\u0027t the dark soulful eyes I had fallen in love with. These hypnotic eyes were green, and I\u0027d seen them all my life.\u003c/p\u003e\n\u003cp\u003e\"Trevor!\" I declared, the words barely escaping my lips.\u003c/p\u003e\n\u003cp\u003eMy childhood nemesis flashed a wicked grin, two razor-sharp fangs hanging from his mouth.\u003c/p\u003e\n\u003cp\u003eI stepped back.\u003c/p\u003e\n\u003cp\u003eIt was only last night at Dullsville\u0027s Spring Carnival that Alexander and I had tried to warn Trevor about Jagger\u0027s twin sister, Luna, who was looking to sink her newly formed fangs into the soccer snob\u0027s neck. Jagger had been seeking revenge on Alexander for not turning Luna into a vampire, and now that she\u0027d been turned by another vampire, the nefarious teens were in Dullsville to find her a lifelong partner. But Trevor had failed to heed our warning. When Alexander and I arrived outside the Fun House and searched through the carnival, Trevor was gone.\u003c/p\u003e\n\u003cp\u003eOnly now my nemesis had found me.\u003c/p\u003e\n\u003cp\u003eI tried to run, but Trevor grabbed my hand as I pulled away. \"I\u0027ve got you now, Monster Girl. Forever.\" He licked his lips and leaned into my neck.\u003c/p\u003e\n\u003cp\u003eI looked around for anything to help my escape. But when I reached out for the candelabra, I felt dizzy. Suddenly Trevor\u0027s mouth was on my neck.\u003c/p\u003e\n\u003cp\u003e\"Get off!\" I cried. \"Let go of me!\"\u003c/p\u003e\n\u003cp\u003eHe pulled me into him with the force of a whole soccer team. I wedged my boot between us, and, with all my strength, I managed to push him away.\u003c/p\u003e\n\u003cp\u003eTrevor stumbled back and grabbed my arm. He tried to pull me close, but I bit his hand. I broke free as he stood up confidently and grinned a wicked smile. Blood began to drip from the corner of his mouth.\u003c/p\u003e\n\u003cp\u003eI reached for my neck. My palm felt warm and wet. I gasped. When I held my hand before me, it was covered in blood.\u003c/p\u003e\n\u003cp\u003e\"No!\" I cried.\u003c/p\u003e\n\u003cp\u003eJust then I saw a confused Alexander, also sporting a gray pallbearer\u0027s uniform, running up the cemetery aisle. I turned to Trevor, who just stood and smiled.\u003c/p\u003e\n\u003cp\u003e\"Not you! Not for an eternity!\" I yelled.\u003c/p\u003e\n\u003cp\u003eI sat up, screaming so hard my throat hurt. I opened my eyes to darkness. I could hardly breathe. Where was I? In a coffin? A tomb? An empty grave?\u003c/p\u003e\n\u003cp\u003eSoft material covered my legs, but my eyes couldn\u0027t adjust to my surroundings. I figured I must be wrapped in a burial shroud.\u003c/p\u003e\n\u003cp\u003eMy heart was throbbing. My skin perspiring. My mouth dry.\u003c/p\u003e\n\u003cp\u003eFlashing, bloodred numbers caught my eye: Two fifteen A.M.\u003c/p\u003e\n\u003cp\u003eI breathed a sigh of relief. I wasn\u0027t lying in an unknown coffin in Dullsville\u0027s cemetery but rather in my own bed.\u003c/p\u003e\n\u003cp\u003eWas I as safe as I thought? Maybe this was all part of my nightmare. My fingers shaking, I switched on my Edward Scissorhands lamp and ran to my dresser mirror. I closed my eyes, anticipating what I might not see. When I opened them, my ghostlike reflection stared back. I pulled my bed-head hair away from my shoulders and examined my neck.\u003c/p\u003e\n\u003cp\u003eMy bedroom door flung open and my dad appeared in the doorway, sporting flannel boxers, a Lakers T-shirt, and messy hair. \"What\u0027s wrong?\" he asked, more annoyed than worried.\u003c/p\u003e\n\u003cp\u003e\"Uh, nothing,\" I replied, startled. I dropped my hair and stepped away from the mirror.\u003c/p\u003e\n\u003cp\u003e\"What happened?\" my mom asked, barging in.\u003c/p\u003e\n\u003cp\u003e\"I heard a scream,\" Billy Boy said, nosing his way behind them, his tired eyes heavy.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I woke you guys. I just had a bad dream,\" I confessed.\u003c/p\u003e\n\u003cp\u003e\"You?\" my father asked, raising his eyebrow. \"I thought you loved bad dreams.\"\u003c/p\u003e\n\u003cp\u003e\"I know. Can you believe it?\" I asked, my heart still racing. \"Who knew?\" \"What was it about? You ran out of black lipstick?\" Billy Boy teased.\u003c/p\u003e\n\u003cp\u003e\"Yes. And I found a new one in your dresser drawer.\"\u003c/p\u003e\n\u003cp\u003e\"Dad!\" Billy Boy hollered, ready to pummel me.\u003c/p\u003e\n\u003cp\u003e\"Now I know I\u0027m not dreaming,\" I said, and playfully tousled my brother\u0027s hair.\u003c/p\u003e\n\u003cp\u003e\"All right. Enough excitement for tonight. Let\u0027s all go back to sleep,\" my dad ordered, putting his arm around my brother as they left the room.\u003c/p\u003e\n\u003cp\u003eI settled back into bed.\u003c/p\u003e\n\u003cp\u003e\"So what were you really dreaming about?\" my mom asked curiously.\u003c/p\u003e\n\u003cp\u003e\"It was nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing woke up the whole house?\" she asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head and started for the door.\u003c/p\u003e\n\u003cp\u003e\"Mom...,\" I said, my words stopping her. \"Does my neck look okay to you?\" I whispered, pulling my hair back.\u003c/p\u003e\n\u003cp\u003eShe returned to my bedside. \"Looks like a regular neck to me,\" she said, examining it. \"What were you expecting--a vampire bite?\"\u003c/p\u003e\n\u003cp\u003eI gave her a quick smile. She pulled the covers over me as if I were still a child.\u003c/p\u003e\n\u003cp\u003e\"I remember when you were a little girl and you stayed up all night with your father watching Dracula movies on our black-and- white TV,\" she reminisced fondly.\u003c/p\u003e\n\u003cp\u003eShe handed me my Mickey Malice plush that had fallen beside my bed. \"You never had nightmares then. It was as if you were comforted by vampires the way other kids are comforted by lullabies.\"\u003c/p\u003e\n\u003cp\u003eShe kissed me on top of the head and reached for my lamp.\u003c/p\u003e\n\u003cp\u003e\"Maybe you should leave it on,\" I said. \"Just for tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Now you are scaring me,\" she said, and left my room. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-1.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
