{"id":82468,"no":10,"title":"Page 10","content":"\u003cp\u003eOne block north of Dullsville\u0027s downtown square sat Hatsy\u0027s Diner--a quaint fifties restaurant complete with teal blue and white vinyl booths, a black-and-white-checked tile floor, neon Coke signs, and a menu of cheeseburgers, atomic fries, and the thickest chocolate shakes in town. The waitresses donned red diner uniforms while the waiters dressed as soda jerks. Occasionally Becky and I would frequent Hatsy\u0027s after school when we managed to scrounge enough change to cover an order of onion rings and a mediocre tip.\u003c/p\u003e\n\u003cp\u003eAlexander and I arrived at Hatsy\u0027s. A few families and young couples were scattered around the diner. The soccer players were already gulping down malts and fries at two large tables. All eyes turned to us as we walked through the clean, crisp, bright diner in our usual blackness.\u003c/p\u003e\n\u003cp\u003eA surge of excitement shot through me--I felt like a gothic princess on the arm of her handsome gothic prince, although I knew the stares were from ridicule rather than envy. Alexander studied the framed Bobby Darrin, Ricky Nelson, and Sandra Dee records, too engrossed in his new surroundings to feel self-conscious.\u003c/p\u003e\n\u003cp\u003eMatt and Becky were sitting alone in a corner booth.\u003c/p\u003e\n\u003cp\u003e\"Hey, guys, we\u0027re over here,\" Becky called.\u003c/p\u003e\n\u003cp\u003eAlexander and I nestled into the booth.\u003c/p\u003e\n\u003cp\u003e\"I thought you\u0027d be sitting with the rest of the soccer team,\" I remarked as we grabbed the menus resting behind the chrome napkin holder.\u003c/p\u003e\n\u003cp\u003e\"We thought it might be cozier if it were just us,\" Becky said.\u003c/p\u003e\n\u003cp\u003eA tall waitress with an hourglass figure, a brunette beehive, and white cat\u0027s-eye glasses approached our table, chomping on a wad of pink bubble gum.\u003c/p\u003e\n\u003cp\u003e\"Hi, my name is Dixie,\" she said, cracking her gum. She pulled out an order pad from her white apron. \"What can I get you?\"\u003c/p\u003e\n\u003cp\u003e\"Two vanilla shakes and an order of atomic fries,\" Matt said.\u003c/p\u003e\n\u003cp\u003e\"And we\u0027d like the same, but make the shakes chocolate, please,\" Alexander said.\u003c/p\u003e\n\u003cp\u003eDixie blew a big bubble and popped it with her front teeth.\u003c/p\u003e\n\u003cp\u003eThen she sashayed off toward the kitchen. All the guys in the diner gawked at her, even Alexander and Matt.\u003c/p\u003e\n\u003cp\u003e\"When I grow up, I want to look just like that,\" I said to Alexander. \"You already do,\" he said, putting his arm around me and giving me a squeeze.\u003c/p\u003e\n\u003cp\u003eAlexander\u0027s eyes lit up as he spotted the vintage tabletop jukebox. \"This is cool,\" he said, flipping through the menu of fifties tunes. \"I\u0027ve only seen these in movies.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d forgotten that my boyfriend spent so much of his life hidden away in his attic room, far from the mundane musings of mortals. I got goose bumps seeing him so fascinated in his new surroundings as he examined the list of titles and artists.\u003c/p\u003e\n\u003cp\u003e\"Elvis rocks,\" he said, elated.\u003c/p\u003e\n\u003cp\u003eI dug my hand into my purse and placed a quarter in the jukebox.\u003c/p\u003e\n\u003cp\u003eA moment later, \"Love Me Tender\" played over the speakers.\u003c/p\u003e\n\u003cp\u003eAlexander smiled a sweet smile and squeezed my hand. His leg was touching mine, and I could feel him tapping his combat boots to the beat of the song underneath the table.\u003c/p\u003e\n\u003cp\u003e\"So what have you guys been up to lately?\" Matt asked.\u003c/p\u003e\n\u003cp\u003e\"Hunting for coffins,\" Alexander said.\u003c/p\u003e\n\u003cp\u003eBecky and Matt looked at us oddly.\u003c/p\u003e\n\u003cp\u003e\"The usual,\" I said, smiling.\u003c/p\u003e\n\u003cp\u003eMatt and Becky laughed.\u003c/p\u003e\n\u003cp\u003e\"So how was your game?\" Alexander asked Matt as he put his napkin on his lap.\u003c/p\u003e\n\u003cp\u003e\"We kicked butt. But only because Trevor played.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Becky defended. \"You scored, too.\"\u003c/p\u003e\n\u003cp\u003e\"I thought he was sick,\" I said. \"Well, he managed to show up and score a few goals. As much as I hate to say it, we\u0027re not a winning team without him.\"\u003c/p\u003e\n\u003cp\u003e\"Did he go home?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"No, he\u0027s over there,\" Matt said, pointing behind me.\u003c/p\u003e\n\u003cp\u003eI turned around. Trevor was in the far end of the diner, playing pinball.\u003c/p\u003e\n\u003cp\u003e\"He shouldn\u0027t be out at night,\" I declared.\u003c/p\u003e\n\u003cp\u003eBecky looked perplexed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m using him as my project for health class. The night air isn\u0027t good for a cold. Excuse me, I\u0027ll be back in a sec,\" I said, awkwardly scooting out of the booth.\u003c/p\u003e\n\u003cp\u003eI could feel eyeballs on me as I walked across the diner, but not for the same reason they had been looking at Dixie.\u003c/p\u003e\n\u003cp\u003eI tapped on Trevor\u0027s shoulder. \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003eMy nemesis glanced at me and rolled his eyes. \"Looks like I\u0027m playing pinball.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sick. You shouldn\u0027t be out where you can pick up more germs.\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, with you standing next to me, I\u0027ve already picked up several diseases,\" he said, pressing the flippers with gusto.\u003c/p\u003e\n\u003cp\u003e\"You should be at home,\" I ordered.\u003c/p\u003e\n\u003cp\u003eThe ball hit a bumper, causing the game board to light up. \"You left Monster Boy to talk to me?\" he asked. \"You\u0027ve been to my house twice. I\u0027m beginning to think--\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s best you don\u0027t think. Did you take your garlic?\"\u003c/p\u003e\n\u003cp\u003e\"I had a game, not a date,\" he said, tilting the machine. \"You should be resting.\"\u003c/p\u003e\n\u003cp\u003e\"You sound like my mother,\" he said, banging on the flippers.\u003c/p\u003e\n\u003cp\u003e\"Well, maybe you should listen to her.\"\u003c/p\u003e\n\u003cp\u003e\"Why, so she can tell me not to see Luna? Has my mom been talking to you?\"\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t approve?\" I asked, curious.\u003c/p\u003e\n\u003cp\u003e\"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"Your mother is right this time. Luna isn\u0027t your type. You need a girl with a tiara, not a tattoo.\"\u003c/p\u003e\n\u003cp\u003e\"But do I really? Luna dresses like you and you\u0027ve been trying to convince me for years that you are not a mutant. Did you ever think it wasn\u0027t your clothes that led people to think you were a freak?\"\u003c/p\u003e\n\u003cp\u003e\"So what do you see in her?\" I interrogated.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s the new girl, beautiful and mysterious. Kind of what you liked in Alexander.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s completely different. I like Alexander because he is unlike anyone I\u0027ve ever met and exactly like me. But Luna isn\u0027t your type. She\u0027s too goth.\"\u003c/p\u003e\n\u003cp\u003e\"Just like someone we know...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d risk your popularity for her?\" I whispered with a twinge of jealousy.\u003c/p\u003e\n\u003cp\u003eI hated to admit it, but deep down I did wonder what Trevor saw in Luna that he didn\u0027t see in me.\u003c/p\u003e\n\u003cp\u003e\"Are you kidding? I\u0027ll be even more popular for scoring the new goth girl rather than the old one.\"\u003c/p\u003e\n\u003cp\u003eIt was as if he had just driven a stake into my heart. \"She and Jagger now hang out with me all the time,\" he continued in my face. \"They watch me at practice and games. I\u0027m more popular than ever--a king of both the insiders and the outsiders.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you, your mother is right this time,\" I tried to warn.\u003c/p\u003e\n\u003cp\u003e\"Well, was my mother right about Alexander and his family?\" he asked, referring to the rampant rumors spread throughout Dullsville that the Sterlings were vampires. \"She thought they were weird just because they were different.\"\u003c/p\u003e\n\u003cp\u003e\"So did you,\" I argued.\u003c/p\u003e\n\u003cp\u003e\"She said they were vampires,\" he continued, hitting the ball again. \"Had the whole town believing they were. Especially you.\"\u003c/p\u003e\n\u003cp\u003e\"You were the one who made up and spread those rumors. But in this case, maybe you should believe it.\"\u003c/p\u003e\n\u003cp\u003e\"That Luna is a vampire?\"\u003c/p\u003e\n\u003cp\u003eI paused.\u003c/p\u003e\n\u003cp\u003eThe restaurant went quiet.\u003c/p\u003e\n\u003cp\u003eTrevor let the pinball bounce against the bumpers and drop through the flippers.\u003c/p\u003e\n\u003cp\u003eJust then I felt someone behind me. I turned around.\u003c/p\u003e\n\u003cp\u003eJagger, in a ripped white Bauhaus T-shirt and black jeans, and Luna in a black and pink minidress and pink fishnets, stood before me, glaring. She was beautiful. She looked like a gothic pixie fairy girl, with skinny pale arms dangling black rubber bracelets, her long cotton white hair flowing over her shoulders and bright blue eyes sparkling. Both stood in front of me like they were ready to extract me from the diner.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" she charged. Suddenly, like a gothic Superman, Alexander appeared by my side. As Luna leaned in to me, Alexander bravely stepped between us.\u003c/p\u003e\n\u003cp\u003e\"Good-bye, Monster Girl,\" Trevor said, taking Luna\u0027s hand. \"C\u0027mon, Jagger.\"\u003c/p\u003e\n\u003cp\u003eJagger gave Alexander a deathly stare, then followed the odd couple toward the tables where the soccer snobs were eating.\u003c/p\u003e\n\u003cp\u003eI leaned against the pinball machine as Trevor sat at the head of the table with Luna and Jagger on either side. The soccer snobs inched away as if the Romanian siblings had rabies. The players continued to avoid eye contact and kept the conversation to themselves.\u003c/p\u003e\n\u003cp\u003e\"We have to get to the treehouse,\" Alexander whispered. \"While Jagger and Luna are still here.\"\u003c/p\u003e\n\u003cp\u003eAlexander and I quickly returned to our table to find our order had just arrived.\u003c/p\u003e\n\u003cp\u003e\"What was that about?\" Matt asked.\u003c/p\u003e\n\u003cp\u003e\"We have to go,\" I said, grabbing my purse.\u003c/p\u003e\n\u003cp\u003e\"But we just got our food!\" my best friend argued.\u003c/p\u003e\n\u003cp\u003e\"Becky and I can\u0027t drink four shakes,\" Matt said.\u003c/p\u003e\n\u003cp\u003eI glanced back at Trevor. The star player was shining in his spotlight, back from a cold to save the team. A girl on one side, his new friend on the other. It disgusted me.\u003c/p\u003e\n\u003cp\u003e\"We really have to go--,\" I repeated.\u003c/p\u003e\n\u003cp\u003e\"Just because Trevor and those guys are over there?\" Becky asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said, \"but not for the reason you think. I\u0027ll have to explain it later. Trust me.\" Alexander placed a twenty and a ten on the table. \"Please, it\u0027s on me.\"\u003c/p\u003e\n\u003cp\u003e\"Our lucky night--we can order burgers now,\" Becky joked.\u003c/p\u003e\n\u003cp\u003eI laughed and gave my best friend a quick hug.\u003c/p\u003e\n\u003cp\u003eWhile all eyes were glued to Dixie as she took Jagger and Luna\u0027s order, Alexander and I snuck out of the diner, past Jagger\u0027s hearse, and into the Mercedes.\u003c/p\u003e\n\u003cp\u003e\"We better hurry,\" I said as we bolted through Henry\u0027s backyard.\u003c/p\u003e\n\u003cp\u003eAlexander and I didn\u0027t know how much time we had to remove the coffins before Jagger and Luna returned.\u003c/p\u003e\n\u003cp\u003eI scaled up the treehouse ladder and Alexander met me inside. When I pulled back the black curtain, the coffins remained as we\u0027d seen them before.\u003c/p\u003e\n\u003cp\u003eAlexander stood behind Jagger\u0027s casket. Then he pushed the coffin with all his might.\u003c/p\u003e\n\u003cp\u003eJagger\u0027s bed wouldn\u0027t budge.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s stuck.\"\u003c/p\u003e\n\u003cp\u003e\"Is something in it? Maybe a dead body?\"\u003c/p\u003e\n\u003cp\u003e\"It would have to be several dead bodies. This thing weighs a ton.\"\u003c/p\u003e\n\u003cp\u003eAlexander opened the lid. All that remained inside was a rumpled black blanket and white pillow. He closed the lid and tried to move it again.\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s caught on something.\"\u003c/p\u003e\n\u003cp\u003eI bent over the opposite end, and together we pushed and pulled as hard as we could.\u003c/p\u003e\n\u003cp\u003eBut the coffin wouldn\u0027t move.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s try Luna,\" Alexander said, brushing his dark locks away from his face.\u003c/p\u003e\n\u003cp\u003eI grabbed one end of the pale pink coffin and Alexander held the other. We couldn\u0027t lift Luna\u0027s coffin off the ground.\u003c/p\u003e\n\u003cp\u003eAlexander and I searched the hideout for anything we could use as leverage.\u003c/p\u003e\n\u003cp\u003e\"Check this out,\" I said, pointing to a few nails lying next to Jagger\u0027s duffel bag.\u003c/p\u003e\n\u003cp\u003e\"When I think we\u0027ve thought of everything, so has Jagger,\" Alexander said, frustrated.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have any tools with me,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I think he counted on that,\" Alexander remarked, gently touching my shoulder.\u003c/p\u003e\n\u003cp\u003eJust then we heard the sound of a car driving up the road.\u003c/p\u003e\n\u003cp\u003eAlexander and I quickly escaped from the treehouse as headlights from Jagger\u0027s hearse shined on the driveway.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve heard about nailing a coffin lid shut, but never the whole coffin!\" I said as we made a fast getaway. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-10.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
