{"id":82470,"no":12,"title":"Page 12","content":"\u003cp\u003eI had to admit--I loved being a vampire. Luna not only believed I was part of the Underworld but wanted me as a friend. I felt like I was flying as I raced my bike through downtown and toward my house. I wondered where I would live. Perhaps my understanding parents could remodel our finished basement--board up the windows, remove the white carpeting, and dirty the cement floors with a few bugs and cobwebs. I could sleep in a black coffin with purple seams and silver studs. Or better yet, Alexander and I could live together in the factory with a super-deluxe two-person gothedelic coffin. Plenty of pillows and comfy blankets, with a built-in flat-screen TV in the lid and stereo speakers on the sides.\u003c/p\u003e\n\u003cp\u003eI pulled into my driveway and found Alexander waiting for me on the front steps, looking as dreamy as ever in black vinyl pants and a ripped black long-sleeve shirt.\u003c/p\u003e\n\u003cp\u003e\"Where were you?\" he asked, concerned. \"I got your note about meeting you at the cemetery, but you never showed.\"\u003c/p\u003e\n\u003cp\u003e\"I got a note, too,\" I said, showing him the red envelope. \"To meet you at the park.\"\u003c/p\u003e\n\u003cp\u003e\"But I didn\u0027t write a note.\" \"I know. Neither did I.\"\u003c/p\u003e\n\u003cp\u003e\"Then who did?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Your spurned lover.\"\u003c/p\u003e\n\u003cp\u003e\"Luna? She was never my lover.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I was just teasing.\"\u003c/p\u003e\n\u003cp\u003e\"How did you know it was her?\"\u003c/p\u003e\n\u003cp\u003e\"She told me. When I showed up at the park.\"\u003c/p\u003e\n\u003cp\u003e\"Did she hurt you?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"She wanted to. It was all a plan to confront me about Trevor. She wants me to stay away from him.\"\u003c/p\u003e\n\u003cp\u003e\"This is getting out of hand,\" he said. \"I\u0027ll talk to her.\"\u003c/p\u003e\n\u003cp\u003e\"No, she thinks I\u0027m a vampire,\" I said proudly, placing my hand on his. \"Can you believe it? We chatted forever. Like we were best friends.\"\u003c/p\u003e\n\u003cp\u003e\"Jagger and Luna don\u0027t have best friends. We really have to be careful. There\u0027s no predicting what they\u0027ll do.\"\u003c/p\u003e\n\u003cp\u003e\"But she really liked me,\" I insisted.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure she did,\" he said with a smile. \"We still can\u0027t trust them.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she trusts me.\"\u003c/p\u003e\n\u003cp\u003e\"Because you are trustworthy. I know their family, Raven. They\u0027re not like you. They are vampires, remember. Real ones.\"\u003c/p\u003e\n\u003cp\u003e\"She accepts me as a vampire. And Jagger is convinced I am one, too.\" I paused and looked up at my vampire boyfriend. \"And I like it. Why can\u0027t you accept me as one?\" Alexander\u0027s smile turned into a frown. \"I accept you as you are. I always have.\"\u003c/p\u003e\n\u003cp\u003eHe turned away from me.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t mean to upset you,\" I said, reaching out to him. I gave him a squeeze with all my might. \"I\u0027m getting so caught up in this, I can\u0027t even think straight. You must think I\u0027m so immature.\"\u003c/p\u003e\n\u003cp\u003eAlexander softened and caressed my hair.\u003c/p\u003e\n\u003cp\u003e\"You know how I think of you,\" he said, his chocolate eyes staring into my own. He lifted my chin and kissed me tenderly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how much longer I can go on like this. When will we be together--just us? And not have to worry about Jagger, Luna, and Trevor?\"\u003c/p\u003e\n\u003cp\u003e\"How about now?\" he said, suddenly bright. \"I wanted you to have this.\" He handed me a wooden heart-shaped box that had been sitting on the window ledge.\u003c/p\u003e\n\u003cp\u003eMy eyes lit up. \"You are so sweet! And here I am being selfish.\"\u003c/p\u003e\n\u003cp\u003eI opened the box. Hanging from a silver chain was a pendant-- black lips with a small vampire fang.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a vampire\u0027s kiss,\" he said proudly.\u003c/p\u003e\n\u003cp\u003e\"Alexander, it\u0027s beautiful. I\u0027ll wear it forever.\"\u003c/p\u003e\n\u003cp\u003eAlexander unclasped my onyx necklace and replaced it with the priceless one he had made just for me.\u003c/p\u003e\n\u003cp\u003eHe gave me a long, lingering good-night kiss.\u003c/p\u003e\n\u003cp\u003e\"Tell me. Would it be easier if I were a vampire?\"\u003c/p\u003e\n\u003cp\u003eJust then my dad pulled into the driveway.\u003c/p\u003e\n\u003cp\u003eAlexander quickly stepped back into the shadows. I waited for my dad to come up the front stairs. \"Where did Alexander go? He was just here. I wanted to say hi.\"\u003c/p\u003e\n\u003cp\u003e\"He had to get home before he turns into a pumpkin.\"\u003c/p\u003e\n\u003cp\u003eExhausted, I walked into my darkened bedroom and switched on my Edward Scissorhands lamp.\u003c/p\u003e\n\u003cp\u003eI almost jumped out of my skin. Sitting on my bed, appearing more sinister than ever, was Jagger.\u003c/p\u003e\n\u003cp\u003eI let out a scream.\u003c/p\u003e\n\u003cp\u003eThat only made the creepy teen smile.\u003c/p\u003e\n\u003cp\u003e\"Raven? What\u0027s wrong?\" my mom yelled up from downstairs.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I yelled down to her. \"Just stubbed my toe.\" Then I whispered to Jagger, \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Bats can sneak in anywhere. You should know that by now.\"\u003c/p\u003e\n\u003cp\u003e\"I want you out of here!\" I demanded.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t be long. Luna had a lovely chat with you. She\u0027s very excited. She thinks she\u0027s found a new best friend.\"\u003c/p\u003e\n\u003cp\u003e\"Well, maybe she has.\"\u003c/p\u003e\n\u003cp\u003e\"She said you girls talked about all sorts of girly things. Boys. Hair. Vampire bites.\"\u003c/p\u003e\n\u003cp\u003eI caught myself in my dresser mirror\u0027s reflection and stepped back.\u003c/p\u003e\n\u003cp\u003eJagger played with the nightstand light switch. On. Off. On. Off. \"Stop that!\" I warned. Something was missing. \"Where\u0027s Nightmare?\"\u003c/p\u003e\n\u003cp\u003eI heard scratching coming from my computer desk file drawer.\u003c/p\u003e\n\u003cp\u003eI raced over and opened it up. \"Nightmare!\" I said, picking up my black kitten. \"You poor girl.\"\u003c/p\u003e\n\u003cp\u003e\"Odd,\" he said, leering at me. \"She doesn\u0027t hiss at you.\"\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t hiss at Alexander either,\" I said, gently stroking her fur. \"She has taste.\"\u003c/p\u003e\n\u003cp\u003eJagger lay back on my bed, placing his red Doc Martens on my bedspread. \"This is a cozy bed.\"\u003c/p\u003e\n\u003cp\u003e\"Get your feet off of there!\" I scolded, pushing his shoes off.\u003c/p\u003e\n\u003cp\u003eJagger leaned across the bed and pulled up the comforter from the floor.\u003c/p\u003e\n\u003cp\u003e\"Where is your coffin?\" he asked. \"Not under here.\"\u003c/p\u003e\n\u003cp\u003eHe rose and slithered over to my closet. He slowly opened my closet door. \"Not in here,\" he remarked. \"Maybe you\u0027re hiding it under your dress,\" he said with a wicked grin.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s in the basement.\"\u003c/p\u003e\n\u003cp\u003e\"Funny. I didn\u0027t see it down there.\"\u003c/p\u003e\n\u003cp\u003eMy blood boiled. I felt enraged. Jagger had been slinking around my house with my family inside.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hidden. Now get out--\"\u003c/p\u003e\n\u003cp\u003e\"Sure, but can you show me something?\"\u003c/p\u003e\n\u003cp\u003e\"The door? Or the window?\" I opened the curtain and lifted the window. Jagger remained still.\u003c/p\u003e\n\u003cp\u003e\"Some of Trevor\u0027s friends said you showed up at school. Curious, really. A vampire risking the sunlight.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d believe a bunch of soccer snobs? They spread more rumors than the National Enquirer.\"\u003c/p\u003e\n\u003cp\u003e\"Well, then,\" he said, sizing me up with his mismatched eyes, \"I have noticed their penchant for gossip.\"\u003c/p\u003e\n\u003cp\u003eI felt a sense of relief, but only for a moment.\u003c/p\u003e\n\u003cp\u003e\"At the drive-in I distinctly remember Alexander bit you on the neck. Blood dripping down your neck like a wild river, the sweet smell permeating the air. But Luna said she didn\u0027t see a wound. Maybe I could take a peek.\"\u003c/p\u003e\n\u003cp\u003e\"You can leave. Now.\"\u003c/p\u003e\n\u003cp\u003eHe stepped closer, his ice blue and green eyes piercing my soul.\u003c/p\u003e\n\u003cp\u003e\"Show me your fangs and I\u0027ll show you mine.\"\u003c/p\u003e\n\u003cp\u003e\"I only show Alexander,\" I said, inching back.\u003c/p\u003e\n\u003cp\u003e\"What a waste, really.\" He took another step, pinning me against my computer desk. \"So how do you like living this lie?\"\u003c/p\u003e\n\u003cp\u003e\"Lie?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is a lie,\" he said, staring straight into my eyes. As if he were going to read my soul. \"Pretending to be something you\u0027re not.\"\u003c/p\u003e\n\u003cp\u003eI gasped and looked away. My heart stopped. I bit my black lip.\u003c/p\u003e\n\u003cp\u003eI reached behind me, stretching my fingers across my computer desk in hopes of grabbing something to use as a weapon. At any moment Jagger was going to look into my eyes and hypnotize me and drag me back to Dullsville\u0027s cemetery. I fingered Billy Boy\u0027s two-ton encyclopedia. \"I think you enjoy being deceitful,\" he said, gently touching the vampire\u0027s kiss necklace. \"Making believe to your family that you are still mortal.\"\u003c/p\u003e\n\u003cp\u003eI breathed again and released the book.\u003c/p\u003e\n\u003cp\u003eThere was a knock at the door.\u003c/p\u003e\n\u003cp\u003e\"I need my encyclopedia.\"\u003c/p\u003e\n\u003cp\u003e\"Billy--go away.\"\u003c/p\u003e\n\u003cp\u003e\"You borrowed it two months ago!\"\u003c/p\u003e\n\u003cp\u003e\"Billy. Billy--go away,\" I said sternly.\u003c/p\u003e\n\u003cp\u003eJagger stepped back and I raced around him.\u003c/p\u003e\n\u003cp\u003eBilly Boy opened the door.\u003c/p\u003e\n\u003cp\u003eI turned around. The curtains were gently blowing. Jagger was gone.\u003c/p\u003e\n\u003cp\u003e\"Is something wrong? You never call me Billy.\"\u003c/p\u003e\n\u003cp\u003eI closed the window, rushed over to my brother, and gave him a quick hug. \"I never thought I needed to.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-12.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
