{"id":82471,"no":13,"title":"Page 13","content":"\u003cp\u003eThe next evening, as I turned the corner to walk up Benson Hill, I saw a shadowy figure standing by the gate. Never one to retreat, I crept up the broken sidewalk slowly. I didn\u0027t want to be startled by Trevor or Jagger.\u003c/p\u003e\n\u003cp\u003eAs I got closer, I saw a gothic fairy girl with long white-and- pink-streaked hair leaning against a tree.\u003c/p\u003e\n\u003cp\u003e\"Luna--what are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Raven,\" she said, bouncing over and giving me a huge squeeze. \"I thought I\u0027d find you here.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m meeting Alexander,\" I said, almost apologetically.\u003c/p\u003e\n\u003cp\u003e\"I know, but I thought we could chat for a few.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to keep him...\"\u003c/p\u003e\n\u003cp\u003eI looked up toward the Mansion. The attic window was dark.\u003c/p\u003e\n\u003cp\u003e\"Well...maybe just a sec.\"\u003c/p\u003e\n\u003cp\u003eWe sat on a few rocks outside the Mansion\u0027s gate.\u003c/p\u003e\n\u003cp\u003e\"Trevor has a history test. I won\u0027t see him until this weekend. Jagger told me he saw you last night,\" she confessed.\u003c/p\u003e\n\u003cp\u003e\"Did he tell you where he saw me?\" I charged.\u003c/p\u003e\n\u003cp\u003e\"In your bedroom.\"\u003c/p\u003e\n\u003cp\u003e\"He can\u0027t do that again. He could scare my family.\"\u003c/p\u003e\n\u003cp\u003e\"You did that to Trevor. You snuck into his room.\"\u003c/p\u003e\n\u003cp\u003eLuna had a good point. \"That was different. I have a reputation.\"\u003c/p\u003e\n\u003cp\u003e\"Jagger is a tricky one,\" she said with a hint of pride. \"He\u0027s been teaching me so many things since I\u0027ve been turned.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I hope they are good tricks,\" I warned. \"I love your purse,\" she said, touching the handle of my Corpse Bride clutch. \"Can I see?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\" No one, not even Becky, ever got excited about my clothes or fashion accessories. I was proud to share it with her.\u003c/p\u003e\n\u003cp\u003eShe placed it on her arm and modeled it. \"So gloom! I love it.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. I ordered it online. Maybe I can get you one.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d kill for one,\" she said eagerly. \"Got any candy? I gave my last piece to you yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"I should have some gum.\"\u003c/p\u003e\n\u003cp\u003eLuna unzipped the purse. \"Be careful, it\u0027s a mess in there,\" I warned.\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t be cool any other way,\" she said with a smile.\u003c/p\u003e\n\u003cp\u003eI leaned back and watched the stars twinkling overhead.\u003c/p\u003e\n\u003cp\u003eLuna pulled out a pack of Gabe\u0027s Grape Gross-Out Gum.\u003c/p\u003e\n\u003cp\u003eShe removed two sticks and returned the pack to my purse.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t mind her rooting around. I didn\u0027t have anything to hide in there. Or did I?\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this?\" she asked, pulling out Ruby\u0027s compact.\u003c/p\u003e\n\u003cp\u003eMy heart stopped.\u003c/p\u003e\n\u003cp\u003e\"What do you need a compact for?\" Luna asked skeptically, holding the white plastic compact and stroking the red ruby R.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an heirloom,\" I said, trying to reach for it.\u003c/p\u003e\n\u003cp\u003e\"An heirloom?\" she wondered aloud. \"It doesn\u0027t look that old.\" Just then a Mustang drove up the road and stopped in front of the Mansion.\u003c/p\u003e\n\u003cp\u003eI grabbed the compact and purse and ran to the car.\u003c/p\u003e\n\u003cp\u003e\"Matt! Becky! How are you guys doing?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, Raven, what\u0027s up?\" Matt asked.\u003c/p\u003e\n\u003cp\u003e\"Hi, Beck,\" I said, smiling.\u003c/p\u003e\n\u003cp\u003eLuna inched up next to me. \"Hi, Beck,\" she said, also grinning.\u003c/p\u003e\n\u003cp\u003eBecky\u0027s smile was strained. My normally amiable best friend looked at me with disdain.\u003c/p\u003e\n\u003cp\u003e\"I thought you were hanging out with Alexander,\" Becky said.\u003c/p\u003e\n\u003cp\u003e\"I am; I\u0027m just on my way in.\"\u003c/p\u003e\n\u003cp\u003e\"We just had to have a girl chat before,\" Luna chimed in.\u003c/p\u003e\n\u003cp\u003eI was annoyed. There was no need for Luna to try to make Becky jealous.\u003c/p\u003e\n\u003cp\u003e\"I better go see Alexander now,\" I finally said. \"I\u0027ll see you tomorrow, Becky.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" she said.\u003c/p\u003e\n\u003cp\u003eI stepped away from the car. Luna put her arm around me and waved at Becky.\u003c/p\u003e\n\u003cp\u003eBecky politely waved back.\u003c/p\u003e\n\u003cp\u003eThe Mustang headed down the windy road. Alexander had warned me about the motives of Jagger and Luna.\u003c/p\u003e\n\u003cp\u003e\"Bye, Luna,\" I said, heading for the Mansion as she waited by the street. This time I was the one to disappear. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-13.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
