{"id":82474,"no":16,"title":"Page 16","content":"\u003cp\u003eAlexander and I grabbed the savory desserts Jameson had made--placinta, fried sweet dough filled with chocolate--and headed up to the privacy of his attic room. \"Trevor is taking Luna to the cemetery?\" Alexander immediately asked, shutting the door.\u003c/p\u003e\n\u003cp\u003e\"Jagger is planning a Graveyard Gala on Saturday night,\" I blurted out as we sat with our placintas on his mattress. \"It\u0027s a gothic costume party with the highlight of the evening being a covenant ceremony. Instead of luring Trevor to sacred ground alone,\" I started, too excited to dive into my treat, \"Jagger is inviting Dullsville High. Luna is going to bite Trevor in front of everyone--only no one will know what\u0027s going to happen, not even Trevor himself.\"\u003c/p\u003e\n\u003cp\u003e\"How will he not know what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"Trevor thinks he\u0027s going to be kissed by Luna, not bitten.\"\u003c/p\u003e\n\u003cp\u003e\"They are going to be wearing costumes, right?\" Alexander asked. \"Yes, Trevor is going as the Grim Reaper. It will be dark and all the partygoers will be wearing masks. While they drink, dance, and make out, Luna will finally have her long-awaited covenant ceremony. No one will know what is really happening.\"\u003c/p\u003e\n\u003cp\u003e\"Then we have to stop Trevor from going,\" Alexander said, picking at his dessert.\u003c/p\u003e\n\u003cp\u003e\"He wouldn\u0027t miss this for the world. He will be the star of the show.\"\u003c/p\u003e\n\u003cp\u003e\"Then we have to tell him what the ceremony really is.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll never believe me. Besides, they\u0027ve already passed out flyers. With all of Dullsville High on sacred ground, Luna could easily take someone else.\"\u003c/p\u003e\n\u003cp\u003e\"Then she\u0027ll have to believe she is with Trevor.\"\u003c/p\u003e\n\u003cp\u003e\"Believe? Who will she really be with?\"\u003c/p\u003e\n\u003cp\u003e\"Me. I\u0027ll be dressed as the Grim Reaper, too. I\u0027ll be covered from head to toe. Luna won\u0027t know the difference.\"\u003c/p\u003e\n\u003cp\u003e\"But you told me if a vampire takes another on sacred ground, then they are theirs for eternity. I don\u0027t want her to bite you and then I lose you forever.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t either,\" he said, and squeezed my hand. \"But when I take off my hood, she\u0027ll know Trevor has gone.\"\u003c/p\u003e\n\u003cp\u003e\"Where will he be?\"\u003c/p\u003e\n\u003cp\u003e\"Safe, off sacred ground. At some point you\u0027ll have to distract him and lead him out of the cemetery,\" Alexander explained.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m used to distracting people, just not on purpose. I hope everything goes smoothly. The whole school will be on sacred ground with two vengeful vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Bring some garlic just in case, and I\u0027ll take my antidote.\" \"I don\u0027t want to give you another shot,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Hopefully, you won\u0027t have to.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-16.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
