{"id":82461,"no":3,"title":"Page 3","content":"\u003cp\u003e\"To find a vampire, you have to think like a vampire,\" Alexander said, grabbing his backpack. \"I won\u0027t be gone more than an hour.\" He gave me a quick kiss.\u003c/p\u003e\n\u003cp\u003e\"Gone?\" I asked, following him toward his bedroom door.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have to stay here. I\u0027m going to sacred ground.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going with you. If Jagger thinks I\u0027m a vampire, then I\u0027ll be safe,\" I argued.\u003c/p\u003e\n\u003cp\u003e\"And if he doesn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Then I have this.\" I pulled out my container of garlic powder from my purse.\u003c/p\u003e\n\u003cp\u003eAlexander quickly retreated. \"It\u0027s tightly sealed,\" I said, referring to the time it spilled out in my purse, causing Alexander to have an allergic reaction and forcing me to inject him with an antidote. \"I\u0027ll wait outside,\" I pleaded.\u003c/p\u003e\n\u003cp\u003eAlexander paused. He wiped his flopping rock-star hair away from his gorgeous face and slung his backpack on his shoulder. He glanced at the door, then back at me. Finally he held his pale hand out. While it was hard enough to be separated during the daylight, it was unbearable during the moonlight. As Alexander and I walked down the windy streets and toward the cemetery, I realized it was a dream come true--to be walking with one vampire and searching for another.\u003c/p\u003e\n\u003cp\u003eI\u0027d never seen anyone in the moonlight as handsome as Alexander, vampire or not. His pale face seemed to glow, and his smile seemed to illuminate what the moon and the stars couldn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\" I finally asked.\u003c/p\u003e\n\u003cp\u003e\"Your favorite place.\"\u003c/p\u003e\n\u003cp\u003e\"My favorite place is here--by your side.\"\u003c/p\u003e\n\u003cp\u003e\"Mine too,\" he said, squeezing my hand.\u003c/p\u003e\n\u003cp\u003e\"Will Jagger know I\u0027m still mortal?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not written on your forehead, is it?\" he teased.\u003c/p\u003e\n\u003cp\u003eAs he led me to an unknown destination, he walked with an air of confidence and determination I hadn\u0027t seen before.\u003c/p\u003e\n\u003cp\u003eWe arrived at the entrance to Dullsville\u0027s cemetery.\u003c/p\u003e\n\u003cp\u003e\"Remember when Old Jim took our tickets at the carnival, he accused you of sleeping at the cemetery?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"But I wasn\u0027t,\" I defended. \"I haven\u0027t done that in months!\"\u003c/p\u003e\n\u003cp\u003e\"I know. So if it\u0027s not you, then who do you think it is?\" he asked. I answered like an eager student. \"Jagger.\"\u003c/p\u003e\n\u003cp\u003e\"Trevor is safe for the night--but we\u0027re not.\" Then he paused. \"You better stay outside the cemetery,\" he warned, changing his mind about our plan. \"It\u0027s sacred ground and you would be in danger.\"\u003c/p\u003e\n\u003cp\u003e\"You mean you bring me to the scene of the crime and don\u0027t let me dust for fingerprints? Or at least leave any?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be safe only if you remain on the outside.\" He tenderly brushed my hair away from my face.\u003c/p\u003e\n\u003cp\u003eAs Alexander climbed over the gate, I reluctantly stayed behind. I anxiously dug my boot into the wet grass, feeling as if I were being left out of the adventure of a lifetime. What could I accomplish by staying behind? Alexander and I could cover more terrain if there were two of us searching the graveyard. Besides, if Jagger still thought I was a vampire, it would be more natural for me to be standing inside a cemetery than outside one.\u003c/p\u003e\n\u003cp\u003eI could barely see Alexander\u0027s shrinking silhouette in the distance. Then I quickly climbed the gate and jogged after him.\u003c/p\u003e\n\u003cp\u003eI ran among the tombstones, as quiet as a wandering ghost following Alexander\u0027s shadowy figure.\u003c/p\u003e\n\u003cp\u003eAs I approached him, I realized the figure I was running to was a monument.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t see Alexander anywhere.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\" I called.\u003c/p\u003e\n\u003cp\u003eI wondered where he could have disappeared to so quickly. He must have turned behind the caretaker\u0027s shed.\u003c/p\u003e\n\u003cp\u003eI raced around to the back of the shed, but all I saw was an abandoned shovel.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\" I called again. I continued to walk in the direction of the baroness\u0027s monument. Maybe Alexander was paying his respects to his grandmother as he searched the graveyard. When I approached the monument, however, the only thing visiting the stone memorial was a curious squirrel.\u003c/p\u003e\n\u003cp\u003eI walked on. Underneath a weeping willow tree, I saw a newly dug grave. I carefully walked toward it when I noticed a familiar pattern of dirt. Gravediggers make piles, not circles. I tiptoed closer. Jagger\u0027s stickered coffin could be lying inside, Jagger himself sitting on top, waiting for a mortal to be lured into his trap. I took a deep breath and peered down.\u003c/p\u003e\n\u003cp\u003eThe grave was empty. No stickered coffin. No fang-toothed teen of darkness.\u003c/p\u003e\n\u003cp\u003eWhere was Jagger? And more important, where was Alexander? I was standing in the middle of three acres of sacred ground. I\u0027d picnicked alone a million times at Dullsville\u0027s cemetery, feeling as comfortable as if it were my own home. Tonight, though, I realized I\u0027d perhaps made the biggest mistake of my life. Alexander had been right when he told me to stay outside the cemetery\u0027s gates. If Jagger was lurking in the shadows, he could easily sink his fangs into me before my true love had a chance to realize I was no longer standing by the graveyard\u0027s entrance.\u003c/p\u003e\n\u003cp\u003eMy heart began to throb. My blood pressure soared.\u003c/p\u003e\n\u003cp\u003eI did have some mace, but I wasn\u0027t sure it would work against teen vampires.\u003c/p\u003e\n\u003cp\u003eI stuck my hand in my purse and clutched the container of garlic powder in my sweaty fingers and tiptoed through the tombstones.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\" I whispered.\u003c/p\u003e\n\u003cp\u003eThe howling wind was the only audible sound.\u003c/p\u003e\n\u003cp\u003eI turned around and could barely see the entrance to the cemetery. If I ran at top speed, I could reach the safety of the gate, though I wasn\u0027t sure I could outrun a flying vampire bat. There was no other choice.\u003c/p\u003e\n\u003cp\u003eI took a deep breath, but as I took my first step, a strong hand bore down on my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Let go!\" I cried.\u003c/p\u003e\n\u003cp\u003eI turned around to pry it off with one hand and aim the garlic container with the other.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" a voice shouted.\u003c/p\u003e\n\u003cp\u003eI froze.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" Alexander asked sternly. \"I told you to wait by the entrance.\"\u003c/p\u003e\n\u003cp\u003e\"But I found something--an empty grave encircled with dirt.\"\u003c/p\u003e\n\u003cp\u003e\"I did too,\" he said. \"And I discovered something else.\"\u003c/p\u003e\n\u003cp\u003eI followed Alexander toward the back of the cemetery to a lone, dead sycamore. A brown package was sitting at the foot of the tree. Alexander picked up the package and held it in front of me. In crooked handwriting was marked: Jagger Maxwell.\u003c/p\u003e\n\u003cp\u003eThe upper-left-hand corner was stamped: COFFIN CLUB.\u003c/p\u003e\n\u003cp\u003eIt was the nocturnal gothic club where I\u0027d first encountered Jagger.\u003c/p\u003e\n\u003cp\u003eThe box had been ripped open, as if severed with razor-sharp teeth. Alexander pulled back the flaps and showed me the contents. It was a vampire\u0027s treasure chest: a box full of crystal, pewter, and silver amulets, filled with the sweet red nectar vampires crave. Fresh off the necks of the Coffin Club clubsters, who I\u0027d seen wearing their blood as innocent charms, these vials now in turn were serving as a teen vampire\u0027s nourishment.\u003c/p\u003e\n\u003cp\u003e\"Without a Coffin Club to hide in,\" Alexander explained, \"Jagger could be chased out of town quickly. He couldn\u0027t make his presence known. This was his only means of survival.\"\u003c/p\u003e\n\u003cp\u003eAlexander eyed the amulets like a child eyeing a gumball machine. Instead of returning the box underneath the tree, he stuck it in his backpack.\u003c/p\u003e\n\u003cp\u003e\"Should we wait here until he comes back?\"\u003c/p\u003e\n\u003cp\u003eAlexander grabbed my hand. \"He\u0027s not coming back.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know?\"\u003c/p\u003e\n\u003cp\u003e\"There is only one empty grave. He needs two now.\"\u003c/p\u003e\n\u003cp\u003eAs we quickly walked through the cemetery, I imagined Jagger sitting underneath the dead tree, secluded in the back of the cemetery, waiting for Luna to arrive from Romania. He would be tipping back several amulets, like the tiny bottles of liquor anxious travelers sip on airplanes, while he plotted her visit and their next location.\u003c/p\u003e\n\u003cp\u003e\"Shouldn\u0027t we continue searching for Luna?\" I asked Alexander as we approached my house on our way back from Dullsville\u0027s cemetery. I wasn\u0027t ready for my vampire hunting to end.\u003c/p\u003e\n\u003cp\u003eBut instead of walking hand in hand with Alexander, his hands were buried in his pockets. He seemed unusually cold and distant.\u003c/p\u003e\n\u003cp\u003e\"I think your cemetery searching days are over,\" he said sternly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re mad at me for not listening?\" I asked, sincerely concerned. Alexander stopped and turned to me. \"You put yourself in grave danger. I only want you to be safe.\"\u003c/p\u003e\n\u003cp\u003e\"But if Jagger thinks I am a vampire, I was safer in the cemetery,\" I said, attempting to cozy up to him.\u003c/p\u003e\n\u003cp\u003e\"You may be right. But...\" He folded his arms, leaned against a parked SUV, and looked toward the moon.\u003c/p\u003e\n\u003cp\u003eIt was one thing to push my parents over the edge with my princess of darkness wardrobe, or to stay out past curfew, or even to boss Becky into climbing over the Mansion\u0027s gate or to convince her to sneak into movies, but I\u0027d never felt as rotten as I now did, disappointing the one person who meant the most to me.\u003c/p\u003e\n\u003cp\u003e\"I should have listened,\" I admitted.\u003c/p\u003e\n\u003cp\u003eHe put his hands back in his oversized pockets and avoided eye contact.\u003c/p\u003e\n\u003cp\u003e\"I want so badly to be a part of your world,\" I said, knitting my arms through his. \"I want to taste the adventure alongside you.\"\u003c/p\u003e\n\u003cp\u003eAlexander softened and gently stroked my hair. \"You are already a part of my world,\" he said with a smile that lit up his pale face. \"You know that. I\u0027m just asking you to be careful.\"\u003c/p\u003e\n\u003cp\u003e\"I understand. I just don\u0027t want us to be apart--even for a moment. But I\u0027ll try harder.\"\u003c/p\u003e\n\u003cp\u003eAlexander grabbed my hand and we continued down the street, past houses, trees, and mailboxes.\u003c/p\u003e\n\u003cp\u003e\"Okay now, I have to come up with a plan,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Plan? I\u0027m all about plans! Where do we start?\"\u003c/p\u003e\n\u003cp\u003eAlexander looked buried in thought and led me toward my house. \"I still want to hang out,\" I whined. \"Darkness is our only time together,\" I continued, staring up into his midnight eyes.\u003c/p\u003e\n\u003cp\u003e\"I know, but---\"\u003c/p\u003e\n\u003cp\u003e\"And daylight seems like an eternity without you. I have to endure unbearably boring teachers, classmates who ostracize me, and two yuppie parents who don\u0027t get black lipstick.\"\u003c/p\u003e\n\u003cp\u003e\"I feel the same,\" he revealed, stopping at the bottom of my driveway. \"Except for me it\u0027s not daylight, but starlight and moonlight. During the long midnight hours, I hang out underneath your window and imagine what you\u0027re dreaming of. I used to thrive in the darkness; now I almost resent it.\"\u003c/p\u003e\n\u003cp\u003eAlexander and I walked up my driveway. Instead of taking the path that led to my front door, Alexander escorted me toward my backyard.\u003c/p\u003e\n\u003cp\u003e\"Yay! We can\u0027t let Jagger spoil our night,\" I cheered.\u003c/p\u003e\n\u003cp\u003e\"We do have to be careful,\" he warned. \"But you\u0027re right. I\u0027m not ready to say good-bye just yet,\" he confessed. \"Not now, not ever.\"\u003c/p\u003e\n\u003cp\u003eSuddenly a motion detector light above the garage triggered, illuminating the driveway, Billy Boy\u0027s basketball hoop, Mom\u0027s SUV, and a mortal girl and her vampire boyfriend.\u003c/p\u003e\n\u003cp\u003e\"No!\" Alexander shouted. He quickly shielded his pale face and retreated into the shadows.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" I called, squinting into the darkness.\u003c/p\u003e\n\u003cp\u003eAlexander didn\u0027t answer. I followed him into the grass, toward our east-side neighbor\u0027s fence.\u003c/p\u003e\n\u003cp\u003eIt took a moment for my eyes to adjust, though I still couldn\u0027t see him. \"Alexander, where are you? Are you hurt?\" I heard a fluttering above the power lines behind me. I followed the sound, which continued back over the driveway in the opposite direction from where I had been standing. When I walked through my backyard, there was a rustling in the bushes by our west-side neighbor\u0027s fence. Alexander was standing in front of them.\u003c/p\u003e\n\u003cp\u003e\"How did you get over here so fast?\" I asked curiously, all the while knowing the answer. \"That was cool. It\u0027s like dating a superhero.\"\u003c/p\u003e\n\u003cp\u003eAlexander dusted off his black jeans, unfazed by his unearthly abilities.\u003c/p\u003e\n\u003cp\u003e\"Are you okay?\" I asked. Before he could answer, I was in his arms.\u003c/p\u003e\n\u003cp\u003e\"Now that you are with me,\" he said, caressing my hair.\u003c/p\u003e\n\u003cp\u003e\"I forgot--\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t melt,\" he said. \"I can handle softer light, like candles or lamps. But a burst of high-powered light repels me.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t even think--,\" I began when he pulled back and placed his frosty white index finger on my black lips.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be able to think better out here,\" he said, and stared up to the sky. \"With you, underneath the stars. We don\u0027t have much time.\"\u003c/p\u003e\n\u003cp\u003eHe led me over to the rickety wooden swing set Billy Boy and I had outgrown but my parents hadn\u0027t bothered to get rid of.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been an eternity since I\u0027ve hung out here,\" I told him. I could feel my pale face flush, exhilarated that I was finally able to share a place I\u0027d spent in childhood isolation. \"I used to bury my Barbies over there,\" I said, pointing to a mound of soil underneath an oak tree.\u003c/p\u003e\n\u003cp\u003eWe each sat on a faded yellow plastic swing. I began swinging, but Alexander remained still. He picked up twigs and threw them into the bushes, as if he were tossing Jagger out of Dullsville...\u003c/p\u003e\n\u003cp\u003eI skidded my combat boots into the weathered patches of grass.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" I asked, now standing before him...,\u003c/p\u003e\n\u003cp\u003eAlexander pulled me close. \"It\u0027s hard for me to relax, knowing Jagger and Luna are still plotting revenge.\"\u003c/p\u003e\n\u003cp\u003e\"Well, let\u0027s think like them. If he isn\u0027t in a cemetery and we don\u0027t have a Coffin Club in Dullsville, where could they be?\"\u003c/p\u003e\n\u003cp\u003e\"I know we are both vampires, but our instincts are different. He sees the world in black and red--blood red. I see the world in all different colors.\"\u003c/p\u003e\n\u003cp\u003eI grabbed his icy hand and fingered his spider ring.\u003c/p\u003e\n\u003cp\u003e\"Just because you and Jagger are vampires doesn\u0027t mean you are the same. Look at Trevor and me. We\u0027re human, but total opposites,\" I reassured him.\u003c/p\u003e\n\u003cp\u003eAlexander broke into a smile. \"I just want to be spending the darkness with you; instead I\u0027m thinking of him\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"That\u0027s my fault,\" I insisted. \"I wish I hadn\u0027t gone to the Coffin Club. Then we\u0027d never be in this mess. I led Jagger right to you, and Luna straight to Trevor.\"\u003c/p\u003e\n\u003cp\u003e\"You had nothing to do with this. If I\u0027d said yes to Luna at the covenant ceremony in Romania, none of this would have happened.\"\u003c/p\u003e\n\u003cp\u003e\"Then we wouldn\u0027t be together. And that is the most important thing.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" he said, and pulled me onto his lap. \"But now we have a couple of vampires to catch.\" We gently swung back and forth on the swing. The stars shone in the night sky. The sweet smell of Drakar filled the air. The crickets seemed to be singing for us.\u003c/p\u003e\n\u003cp\u003eJust then my bedroom light switched on.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s in my room?\" I snarled.\u003c/p\u003e\n\u003cp\u003eBilly Boy jumped in front of the window, with his back toward us, hugging himself. From our vantage point, he appeared as if he were making out with a girl.\u003c/p\u003e\n\u003cp\u003eAlexander laughed at my little brother\u0027s antics.\u003c/p\u003e\n\u003cp\u003e\"Get out of my room!\" I yelled.\u003c/p\u003e\n\u003cp\u003eBilly Boy held Nightmare in his hands and waved her paw at me.\u003c/p\u003e\n\u003cp\u003e\"Let her go! You\u0027ll give her fleas!\" I shouted.\u003c/p\u003e\n\u003cp\u003e\"He just wants your attention,\" Alexander said, dragging his boots into the dirt and holding one arm around me like a safety belt. \"It\u0027s cute. He adores you.\"\u003c/p\u003e\n\u003cp\u003e\"Adores me?\"\u003c/p\u003e\n\u003cp\u003e\"He has the coolest sister ever.\"\u003c/p\u003e\n\u003cp\u003eI turned to Alexander and gave him a long kiss. I\u0027d spent my whole life as an outsider. Even though Alexander and I had been dating for a few months, it was still hard to get used to the fact that anyone would think I was normal, much less cool.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s getting late,\" he said. He grabbed my hand and began walking me to the front door. \"You get your rest while I figure out where Jagger is.\"\u003c/p\u003e\n\u003cp\u003e\"The night has just begun,\" I argued.\u003c/p\u003e\n\u003cp\u003e\"Not for someone who has classes at eight in the morning.\" \"They always go on without me,\" I said with a shrug.\u003c/p\u003e\n\u003cp\u003eAlexander smiled at my tireless efforts but then turned serious. \"Jagger\u0027s somewhere out here,\" he began, \"hidden in a dark, secluded area or building big enough for two coffins,\" he said. When we reached the front doorstep, he went on, \"You understand, I\u0027ll have to search for them alone.\"\u003c/p\u003e\n\u003cp\u003e\"Just because I jumped the fence tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t risk putting you in danger again.\"\u003c/p\u003e\n\u003cp\u003e\"But I can\u0027t spend the days and nights without you! And you need me--it\u0027s like Batman without Robin. I know all the creepy places to hide in this town.\"\u003c/p\u003e\n\u003cp\u003e\"Well...you\u0027re right, but not quite--\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s more like Gomez without Morticia,\" he said with a wink.\u003c/p\u003e\n\u003cp\u003eI leaned in to him and gave him a huge squeeze.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll meet at sunset,\" he said, resigned. \"And you can take me to one of those creepy places you are so fond of.\"\u003c/p\u003e\n\u003cp\u003eHe gave me a lingering kiss, the kind that made my knees weak and my heart flutter like a hovering bat.\u003c/p\u003e\n\u003cp\u003eI unlocked the front door. \"Till sunset,\" I said in a romantic daze and slowly turned to him.\u003c/p\u003e\n\u003cp\u003eAlexander had already vanished, just like any great vampire would. I was sitting on my black beanbag chair recording the evening\u0027s events in my journal. I was too preoccupied with thoughts of Luna and Jagger to sleep. I imagined the two of them flying through Dullsville\u0027s night sky together, looking down on Dullsvillians who would look like tiny nobodies as they got stuck in traffic, played golf, and dined in outdoor restaurants. I imagined the twins hiding in a basement-turned-dungeon, Jagger with pet tarantulas, and Luna dolled up in dresses made out of spiderwebs.\u003c/p\u003e\n\u003cp\u003eA scratching sound began outside my window. Nightmare jumped up on my computer desk and hissed at the darkness.\u003c/p\u003e\n\u003cp\u003eI raced to my window. \"Alexander?\" I called softly.\u003c/p\u003e\n\u003cp\u003eThere were no signs of anything living or undead outside.\u003c/p\u003e\n\u003cp\u003eI closed the curtains and held an anxious Nightmare in my arms. There could have been a number of vampires lurking outside my window under the night sky. I just didn\u0027t know which one. I pondered placing a garlic clove on the windowsill, but I might repel the very vampire I wanted to attract. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampireville-vampire-kisses-3/page-3.html","bookId":1868,"creation":"Oct 5, 2019 4:45:07 PM","modification":"Oct 5, 2019 4:45:07 PM"}
