{"id":75795,"no":10,"title":"Page 10","content":"\u003cp\u003eHe circled the entire ship twice before stalking into his office and taking out a bottle of fifty-year-old Highland Park single malt. Without pouring a glass, he set down the bottle and turned his back on it—a personal reminder that he was still very much in control.\u003c/p\u003e\n\u003cp\u003eHis eyes moved instinctively to a heavy, weathered tome on his bookshelf—a gift from a client … the client whom he now wished he’d never met.\u003c/p\u003e\n\u003cp\u003eA year ago … how could I have known?\u003c/p\u003e\n\u003cp\u003eThe provost did not normally interview prospective clients personally, but this one had come to him through a trusted source, and so he had made an exception.\u003c/p\u003e\n\u003cp\u003eIt had been a dead calm day at sea when the client arrived aboard The Mendacium via his own private helicopter. The visitor, a notable figure in his field, was forty-six, clean-cut, and exceptionally tall, with piercing green eyes.\u003c/p\u003e\n\u003cp\u003e“As you know,” the man had begun, “your services were recommended to me by a mutual friend.” The visitor stretched out his long legs and made himself at home in the provost’s lushly appointed office. “So, let me tell you what I need.”\u003c/p\u003e\n\u003cp\u003e“Actually, no,” the provost interrupted, showing the man who was in charge. “My protocol requires that you tell me nothing. I will explain the services I provide, and you will decide which, if any, are of interest to you.”\u003c/p\u003e\n\u003cp\u003eThe visitor looked taken aback but acquiesced and listened intently. In the end, what the lanky newcomer desired had turned out to be very standard fare for the Consortium—essentially a chance to become “invisible” for a while so he could pursue an endeavor far from prying eyes.\u003c/p\u003e\n\u003cp\u003eChild’s play.\u003c/p\u003e\n\u003cp\u003eThe Consortium would accomplish this by providing him a fake identity and a secure location, entirely off the grid, where he could do his work in total secrecy—whatever his work might be. The Consortium never inquired for what purpose a client required a service, preferring to know as little as possible about those for whom they worked.\u003c/p\u003e\n\u003cp\u003eFor a full year, at a staggering profit, the provost had provided safe haven to the green-eyed man, who had turned out to be an ideal client. The provost had no contact with him, and all of his bills were paid on time.\u003c/p\u003e\n\u003cp\u003eThen, two weeks ago, everything changed.\u003c/p\u003e\n\u003cp\u003eUnexpectedly, the client had made contact, demanding a personal meeting with the provost. Considering the sum of money the client had paid, the provost obliged.\u003c/p\u003e\n\u003cp\u003eThe disheveled man who arrived on the yacht was barely recognizable as the steady, clean-cut person with whom the provost had done business the year before. He had a wild look in his once-sharp green eyes. He looked almost … ill.\u003c/p\u003e\n\u003cp\u003eWhat happened to him? What has he been doing?\u003c/p\u003e\n\u003cp\u003eThe provost had ushered the jittery man into his office.\u003c/p\u003e\n\u003cp\u003e“The silver-haired devil,” his client stammered. “She’s getting closer every day.”\u003c/p\u003e\n\u003cp\u003eThe provost glanced down at his client’s file, eyeing the photo of the attractive silver-haired woman. “Yes,” the provost said, “your silver-haired devil. We are well aware of your enemies. And as powerful as she may be, for a full year we’ve kept her from you, and we will continue to do so.”\u003c/p\u003e\n\u003cp\u003eThe green-eyed man anxiously twisted strands of greasy hair around his fingertips. “Don’t let her beauty fool you, she is a dangerous foe.”\u003c/p\u003e\n\u003cp\u003eTrue, the provost thought, still displeased that his client had drawn the attention of someone so influential. The silver-haired woman had tremendous access and resources—not the kind of adversary the provost appreciated having to deflect.\u003c/p\u003e\n\u003cp\u003e“If she or her demons locate me …” the client began.\u003c/p\u003e\n\u003cp\u003e“They won’t,” the provost had assured him. “Have we not thus far hidden you and provided you everything you’ve requested?”\u003c/p\u003e\n\u003cp\u003e“Yes,” the man said. “And yet, I will sleep easier if …” He paused, regrouping. “I need to know that if anything happens to me, you will carry out my final wishes.”\u003c/p\u003e\n\u003cp\u003e“Those wishes being?”\u003c/p\u003e\n\u003cp\u003eThe man reached into a bag and pulled out a small, sealed envelope. “The contents of this envelope provide access to a safe-deposit box in Florence. Inside the box, you will find a small object. If anything happens to me, I need you to deliver the object for me. It is a gift of sorts.”\u003c/p\u003e\n\u003cp\u003e“Very well.” The provost lifted his pen to make notes. “And to whom shall I deliver it?”\u003c/p\u003e\n\u003cp\u003e“To the silver-haired devil.”\u003c/p\u003e\n\u003cp\u003eThe provost glanced up. “A gift for your tormentor?”\u003c/p\u003e\n\u003cp\u003e“More of a thorn in her side.” His eyes flashed wildly. “A clever little barb fashioned from a bone. She will discover it is a map … her own personal Virgil … an escort to the center of her own private hell.”\u003c/p\u003e\n\u003cp\u003eThe provost studied him for a long moment. “As you wish. Consider it done.”\u003c/p\u003e\n\u003cp\u003e“The timing will be critical,” the man urged. “The gift should not be delivered too soon. You must keep it hidden until …” He paused, suddenly lost in thought.\u003c/p\u003e\n\u003cp\u003e“Until when?” the provost prodded.\u003c/p\u003e\n\u003cp\u003eThe man stood abruptly and walked over behind the provost’s desk, grabbing a red marker and frantically circling a date on the provost’s personal desk calendar. “Until this day.”\u003c/p\u003e\n\u003cp\u003eThe provost set his jaw and exhaled, swallowing his displeasure at the man’s brazenness. “Understood,” the provost said. “I will do nothing until the circled day, at which time the object in the safe-deposit box, whatever it may be, will be delivered to the silver-haired woman. You have my word.” He counted the days on his calendar until the awkwardly circled date. “I will carry out your wishes in precisely fourteen days from now.”\u003c/p\u003e\n\u003cp\u003e“And not one day before!” the client admonished feverishly.\u003c/p\u003e\n\u003cp\u003e“I understand,” the provost assured. “Not a day before.”\u003c/p\u003e\n\u003cp\u003eThe provost took the envelope, slid it into the man’s file, and made the necessary notations to ensure that his client’s wishes were followed precisely. While his client had not described the exact nature of the object in the safe-deposit box, the provost preferred it this way. Detachment was a cornerstone of the Consortium’s philosophy. Provide the service. Ask no questions. Pass no judgment.\u003c/p\u003e\n\u003cp\u003eThe client’s shoulders softened and he exhaled heavily. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“Anything else?” the provost had asked, eager to rid himself of his transformed client.\u003c/p\u003e\n\u003cp\u003e“Yes, actually, there is.” He reached into his pocket and produced a small, crimson memory stick. “This is a video file.” He laid the memory stick in front of the provost. “I would like it uploaded to the world media.”\u003c/p\u003e\n\u003cp\u003eThe provost studied the man curiously. The Consortium often mass-distributed information for clients, and yet something about this man’s request felt disconcerting. “On the same date?” the provost asked, motioning at the scrawled circle on his calendar.\u003c/p\u003e\n\u003cp\u003e“Same exact date,” the client replied. “Not one moment before.”\u003c/p\u003e\n\u003cp\u003e“Understood.” The provost tagged the red memory stick with the proper information. “So that’s it, then?” He stood up, attempting to end the meeting.\u003c/p\u003e\n\u003cp\u003eHis client remained seated. “No. There is one final thing.”\u003c/p\u003e\n\u003cp\u003eThe provost sat back down.\u003c/p\u003e\n\u003cp\u003eThe client’s green eyes were looking almost feral now. “Shortly after you deliver this video, I will become a very famous man.”\u003c/p\u003e\n\u003cp\u003eYou are already a famous man, the provost had thought, considering his client’s impressive accomplishments.\u003c/p\u003e\n\u003cp\u003e“And you will deserve some of the credit,” the man said. “The service you have provided has enabled me to create my masterpiece … an opus that is going to change the world. You should be proud of your role.”\u003c/p\u003e\n\u003cp\u003e“Whatever your masterpiece is,” the provost said with growing impatience, “I’m pleased you have had the privacy required to create it.”\u003c/p\u003e\n\u003cp\u003e“As a show of thanks, I’ve brought you a parting gift.” The unkempt man reached into his bag. “A book.”\u003c/p\u003e\n\u003cp\u003eThe provost wondered if perhaps this book was the secret opus the client had been working on for all this time. “And did you write this book?”\u003c/p\u003e\n\u003cp\u003e“No.” The man heaved a massive tome up onto the table. “Quite to the contrary … this book was written for me.”\u003c/p\u003e\n\u003cp\u003ePuzzled, the provost eyed the edition his client had produced. He thinks this was written for him? The volume was a literary classic … written in the fourteenth century.\u003c/p\u003e\n\u003cp\u003e“Read it,” the client urged with an eerie smile. “It will help you understand all I have done.”\u003c/p\u003e\n\u003cp\u003eWith that, the unkempt visitor had stood up, said good-bye, and abruptly departed. The provost watched through his office window as the man’s helicopter lifted off the deck and headed back toward the coast of Italy.\u003c/p\u003e\n\u003cp\u003eThen the provost returned his attention to the large book before him. With uncertain fingers, he lifted the leather cover and thumbed to the beginning. The opening stanza of the work was written in large calligraphy, taking up the entire first page.\u003c/p\u003e\n\u003cp\u003eINFERNO\u003c/p\u003e\n\u003cp\u003eMidway upon the journey of our life\u003c/p\u003e\n\u003cp\u003eI found myself within a forest dark,\u003c/p\u003e\n\u003cp\u003efor the straightforward pathway had been lost.\u003c/p\u003e\n\u003cp\u003eOn the opposing page, his client had signed the book with a handwritten message:\u003c/p\u003e\n\u003cp\u003eMy dear friend, thank you for helping me find the path.\u003c/p\u003e\n\u003cp\u003eThe world thanks you, too.\u003c/p\u003e\n\u003cp\u003eThe provost had no idea what this meant, but he’d read enough. He closed the book and placed it on his bookshelf. Thankfully, his professional relationship with this strange individual would be over soon. Fourteen more days, the provost thought, turning his gaze to the wildly scrawled red circle on his personal calendar.\u003c/p\u003e\n\u003cp\u003eIn the days that followed, the provost felt uncharacteristically on edge about this client. The man seemed to have come unhinged. Nonetheless, despite the provost’s intuition, the time passed without incident.\u003c/p\u003e\n\u003cp\u003eThen, just before the circled date, there occurred a rapid series of calamitous events in Florence. The provost tried to handle the crisis, but it quickly accelerated out of control. The crisis climaxed with his client’s breathless ascent up the Badia tower.\u003c/p\u003e\n\u003cp\u003eHe jumped off … to his death.\u003c/p\u003e\n\u003cp\u003eDespite his horror at losing a client, especially in this manner, the provost remained a man of his word. He quickly began preparing to make good on his final promise to the deceased—the delivery to the silver-haired woman of the contents of a safe-deposit box in Florence—the timing of which, he had been admonished, was critical.\u003c/p\u003e\n\u003cp\u003eNot before the date circled in your calendar.\u003c/p\u003e\n\u003cp\u003eThe provost gave the envelope containing the safe-deposit-box codes to Vayentha, who had traveled to Florence to recover the object inside—this “clever little barb.” When Vayentha called in, however, her news was both startling and deeply alarming. The contents of the safe-deposit box had already been removed, and Vayentha had barely escaped being detained. Somehow, the silver-haired woman had learned of the account and had used her influence to gain access to the safe-deposit box and also to place an arrest warrant on anyone else who showed up looking to open it.\u003c/p\u003e\n\u003cp\u003eThat was three days ago.\u003c/p\u003e\n\u003cp\u003eThe client had clearly intended the purloined object to be his final insult to the silver-haired woman—a taunting voice from the grave.\u003c/p\u003e\n\u003cp\u003eAnd yet now it speaks too soon.\u003c/p\u003e\n\u003cp\u003eThe Consortium had been in a desperate scramble ever since—using all its resources to protect its client’s final wishes, as well as itself. In the process, the Consortium had crossed a series of lines from which the provost knew it would be hard to return. Now, with everything unraveling in Florence, the provost stared down at his desk and wondered what the future held.\u003c/p\u003e\n\u003cp\u003eOn his calendar, the client’s wildly scrawled circle stared up at him—a crazed ring of red ink around an apparently special day.\u003c/p\u003e\n\u003cp\u003eTomorrow.\u003c/p\u003e\n\u003cp\u003eReluctantly, the provost eyed the bottle of Scotch on the table before him. Then, for the first time in fourteen years, he poured a glass and drained it in a single gulp.\u003c/p\u003e\n\u003cp\u003eBelowdecks, facilitator Laurence Knowlton pulled the little red memory stick from his computer and set it on the desk in front of him. The video was one of the strangest things he had ever seen.\u003c/p\u003e\n\u003cp\u003eAnd it was precisely nine minutes long … to the second.\u003c/p\u003e\n\u003cp\u003eFeeling uncharacteristically alarmed, he stood and paced his tiny cubicle, wondering again whether he should share the bizarre video with the provost.\u003c/p\u003e\n\u003cp\u003eJust do your job, Knowlton told himself. No questions. No judgment.\u003c/p\u003e\n\u003cp\u003eForcing the video from his mind, he marked his planner with a confirmed task. Tomorrow, as requested by the client, he would upload the video file to the media.\u003c/p\u003e\n\u003cp\u003eCHAPTER 18\u003c/p\u003e\n\u003cp\u003eViale Niccolò Machiavelli has been called the most graceful of all Florentine avenues. With wide S-curves that serpentine through lushly wooded landscapes of hedges and deciduous trees, the drive is a favorite among cyclists and Ferrari enthusiasts.\u003c/p\u003e\n\u003cp\u003eSienna expertly maneuvered the Trike through each arching curve as they left behind the dingy residential neighborhood and moved into the clean, cedar-laden air of the city’s upscale west bank. They passed a chapel clock that was just chiming 8 A.M.\u003c/p\u003e\n\u003cp\u003eLangdon held on, his mind churning with mystifying images of Dante’s inferno … and the mysterious face of a beautiful silver-haired woman he had just seen wedged in between two huge soldiers in the backseat of the van.\u003c/p\u003e\n\u003cp\u003eWhoever she is, Langdon thought, they have her now.\u003c/p\u003e\n\u003cp\u003e“The woman in the van,” Sienna said over the noise of the Trike’s engine. “You’re sure it was the same woman from your visions?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003e“Then you must have met her at some point in the past two days. The question is why you keep seeing her … and why she keeps telling you to seek and find.”\u003c/p\u003e\n\u003cp\u003eLangdon agreed. “I don’t know … I have no recollection of meeting her, but every time I see her face, I have an overwhelming sense that I need to help her.”\u003c/p\u003e\n\u003cp\u003eVery sorry. Very sorry.\u003c/p\u003e\n\u003cp\u003eLangdon suddenly wondered if maybe his strange apology had been directed to the silver-haired woman. Did I fail her somehow? The thought left a knot in his gut. \u003c/p\u003e","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-10.html","bookId":2415,"creation":"Oct 5, 2019 10:36:24 AM","modification":"Oct 5, 2019 10:36:24 AM"}
