{"id":75842,"no":57,"title":"Page 57","content":"\u003cp\u003eBrüder turned to Sinskey. “Call the local authorities. Whatever we find down there, we’ll need support. When my team arrives, have them radio me for an update. I’ll go down and see if I can get a sense of where Zobrist might have tethered this thing.”\u003c/p\u003e\n\u003cp\u003e“Without a respirator?” Sinskey asked. “You don’t know for a fact the Solublon bag is intact.”\u003c/p\u003e\n\u003cp\u003eBrüder frowned, holding his hand up in the warm wind that was blowing out of the doorway. “I hate to say this, but if this contagion is out, I’m guessing everyone in this city is probably infected.”\u003c/p\u003e\n\u003cp\u003eSinskey had been thinking the same thing but hadn’t wanted to say it in front of Langdon and Mirsat.\u003c/p\u003e\n\u003cp\u003e“Besides,” Brüder added, “I’ve seen what happens to crowds when my team marches in wearing hazmat suits. We’d have full-scale panic and a stampede.”\u003c/p\u003e\n\u003cp\u003eSinskey decided to defer to Brüder; he was, after all, the specialist and had been in situations like this before.\u003c/p\u003e\n\u003cp\u003e“Our only realistic option,” Brüder told her, “is to assume it’s still safe down there, and make a play to contain this.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Sinskey said. “Do it.”\u003c/p\u003e\n\u003cp\u003e“There’s another problem,” Langdon interjected. “What about Sienna?”\u003c/p\u003e\n\u003cp\u003e“What about her?” Brüder demanded.\u003c/p\u003e\n\u003cp\u003e“Whatever her intentions may be here in Istanbul, she’s very good with languages and possibly speaks some Turkish.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“Sienna knows the poem references the ‘sunken palace,’ ” Langdon said. “And in Turkish, ‘sunken palace’ literally points …” He motioned to the “Yerebatan Sarayi” sign over the doorway. “… here.”\u003c/p\u003e\n\u003cp\u003e“That’s true,” Sinskey agreed wearily. “She may have figured this out and bypassed Hagia Sophia altogether.”\u003c/p\u003e\n\u003cp\u003eBrüder glanced at the lone doorway and cursed under his breath. “Okay, if she’s down there and plans to break the Solublon bag before we can contain it, at least she hasn’t been there long. It’s a huge area, and she probably has no idea where to look. And with all those people around, she probably can’t just dive into the water unnoticed.”\u003c/p\u003e\n\u003cp\u003e“Sir?” the doorman called again to Brüder. “Would you like to enter now?”\u003c/p\u003e\n\u003cp\u003eBrüder could see another group of concertgoers approaching from across the street, and nodded to the doorman that he was indeed coming.\u003c/p\u003e\n\u003cp\u003e“I’m coming with you,” Langdon said, following.\u003c/p\u003e\n\u003cp\u003eBrüder turned and faced him. “No chance.”\u003c/p\u003e\n\u003cp\u003eLangdon’s tone was unyielding. “Agent Brüder, one of the reasons we’re in this situation is that Sienna Brooks has been playing me all day. And as you said, we may all be infected already. I’m helping you whether you like it or not.”\u003c/p\u003e\n\u003cp\u003eBrüder stared at him a moment and then relented.\u003c/p\u003e\n\u003cp\u003eAs Langdon passed through the doorway and began descending the steep staircase behind Brüder, he could feel the warm wind rushing past them from the bowels of the cistern. The humid breeze carried on it the strains of Liszt’s Dante Symphony as well as a familiar, yet ineffable scent … that of a massive crush of people congregated together in an enclosed space.\u003c/p\u003e\n\u003cp\u003eLangdon suddenly felt a ghostly pall envelop him, as if the long fingers of an unseen hand were reaching out of the earth and raking his flesh.\u003c/p\u003e\n\u003cp\u003eThe music.\u003c/p\u003e\n\u003cp\u003eThe symphony chorus—a hundred voices strong—was now singing a well-known passage, articulating every syllable of Dante’s gloomy text.\u003c/p\u003e\n\u003cp\u003e“Lasciate ogne speranza,” they were now chanting, “voi ch’entrate.”\u003c/p\u003e\n\u003cp\u003eThese six words—the most famous line in all of Dante’s Inferno—welled up from the bottom of the stairs like the ominous stench of death.\u003c/p\u003e\n\u003cp\u003eAccompanied by a swell of trumpets and horns, the choir intoned the warning again. “Lasciate ogne speranza voi ch’entrate!”\u003c/p\u003e\n\u003cp\u003eAbandon all hope, ye who enter here!\u003c/p\u003e\n\u003cp\u003eCHAPTER 91\u003c/p\u003e\n\u003cp\u003eBathed in red light, the subterranean cavern resonated with the sounds of hell-inspired music—the wail of voices, the dissonant pinch of strings, and the deep roll of timpani, which thundered through the grotto like a seismic tremor.\u003c/p\u003e\n\u003cp\u003eAs far as Langdon could see, the floor of this underground world was a glassy sheet of water—dark, still, smooth—like black ice on a frozen New England pond.\u003c/p\u003e\n\u003cp\u003eThe lagoon that reflects no stars.\u003c/p\u003e\n\u003cp\u003eRising out of the water, meticulously arranged in seemingly endless rows, were hundreds upon hundreds of thick Doric columns, each climbing thirty feet to support the cavern’s vaulted ceiling. The columns were lit from below by a series of individual red spotlights, creating a surreal forest of illuminated trunks that telescoped off into the darkness like some kind of mirrored illusion.\u003c/p\u003e\n\u003cp\u003eLangdon and Brüder paused at the bottom of the stairs, momentarily stalled on the threshold of the spectral hollow before them. The cavern itself seemed to glow with a reddish hue, and as Langdon took it all in, he could feel himself breathing as shallowly as possible.\u003c/p\u003e\n\u003cp\u003eThe air down here was heavier than he’d imagined.\u003c/p\u003e\n\u003cp\u003eLangdon could see the crowd in the distance to their left. The concert was taking place deep in the underground space, halfway back against the far wall, its audience seated on an expanse of platforms. Several hundred spectators sat in concentric rings that had been arranged around the orchestra while a hundred more stood around the perimeter. Still others had taken up positions out on the near boardwalks, leaning on the sturdy railings and gazing down into the water as they listened to the music.\u003c/p\u003e\n\u003cp\u003eLangdon found himself scanning the sea of amorphous silhouettes, his eyes searching for Sienna. She was nowhere in sight. Instead he saw figures in tuxedos, gowns, bishts, burkas, and even tourists in shorts and sweatshirts. The cross section of humanity, gathered in the crimson light, looked to Langdon like celebrants in some kind of occult mass.\u003c/p\u003e\n\u003cp\u003eIf Sienna’s down here, he realized, it will be nearly impossible to spot her.\u003c/p\u003e\n\u003cp\u003eAt that moment a heavyset man moved past them, exiting up the stairs, coughing as he went. Brüder spun and watched him go, scrutinizing him carefully. Langdon felt a faint tickle in his own throat but told himself it was his imagination.\u003c/p\u003e\n\u003cp\u003eBrüder now took a tentative step forward on the boardwalk, eyeing their numerous options. The path before them looked like the entrance to the Minotaur’s labyrinth. The single boardwalk quickly forked into three, each of those branching off again, creating a suspended maze, hovering over the water, weaving in and out of the columns and snaking into the darkness.\u003c/p\u003e\n\u003cp\u003eI found myself within a forest dark, Langdon thought, recalling the ominous first canto of Dante’s masterwork, for the straightforward pathway had been lost.\u003c/p\u003e\n\u003cp\u003eLangdon peered over the walkway’s railing into the water. It was about four feet deep and surprisingly clear. The stone tile floor was visible, blanketed by a fine layer of silt.\u003c/p\u003e\n\u003cp\u003eBrüder took a quick look down, gave a noncommittal grunt, and then raised his eyes back to the room. “Do you see anything that looks like the area in Zobrist’s video?”\u003c/p\u003e\n\u003cp\u003eEverything, Langdon thought, surveying the steep, damp walls around them. He motioned to the most remote corner of the cavern, far off to the right, away from the congestion of the orchestral platform. “I’m guessing back there somewhere.”\u003c/p\u003e\n\u003cp\u003eBrüder nodded. “My instinct as well.”\u003c/p\u003e\n\u003cp\u003eThe two of them hurried down the boardwalk, choosing the right-hand fork, which carried them away from the crowd, in the direction of the farthest reaches of the sunken palace.\u003c/p\u003e\n\u003cp\u003eAs they walked, Langdon realized how easy it would be to hide overnight in this space, undetected. Zobrist could have done just that to make his video. Of course, if he had generously underwritten this week-long concert series, he also could have simply requested some private time in the cistern.\u003c/p\u003e\n\u003cp\u003eNot that it matters anymore.\u003c/p\u003e\n\u003cp\u003eBrüder was striding faster now, as if subconsciously keeping pace with the symphony’s tempo, which had increased into a cascading series of descending semitone suspensions.\u003c/p\u003e\n\u003cp\u003eDante and Virgil’s descent into hell.\u003c/p\u003e\n\u003cp\u003eLangdon intently scanned the steep, mossy walls in the distance to their right, trying to match them up with what they had seen in the video. At each new fork in the boardwalk, they turned right, moving farther from the crowd, heading for the cavern’s most remote corner. Langdon looked back and was astounded by the distance they had covered.\u003c/p\u003e\n\u003cp\u003eThey advanced at almost a jog now, passing a handful of meandering visitors, but by the time they entered the deepest parts of the cistern, the number of people had thinned to nothing.\u003c/p\u003e\n\u003cp\u003eBrüder and Langdon were alone.\u003c/p\u003e\n\u003cp\u003e“It all looks the same,” Brüder despaired. “Where do we start?”\u003c/p\u003e\n\u003cp\u003eLangdon shared his frustration. He remembered the video vividly, but nothing down here leaped out as a recognizable feature.\u003c/p\u003e\n\u003cp\u003eLangdon studied the softly lit informational signs that dotted the boardwalk as they moved ahead. One described the twenty-one-million-gallon capacity of the room. Another pointed out a nonmatching pillar that had been looted from a nearby structure during construction. And still another offered a diagram of an ancient carving now faded from view—the Crying Hen’s Eye symbol, which wept for all the slaves who died while building the cistern.\u003c/p\u003e\n\u003cp\u003eStrangely, it was a sign that bore a single word that now stopped Langdon dead in his tracks.\u003c/p\u003e\n\u003cp\u003eBrüder halted, too, turning. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eLangdon pointed.\u003c/p\u003e\n\u003cp\u003eOn the sign, accompanied by a directional arrow, was the name of a fearsome Gorgon—an infamous female monster.\u003c/p\u003e\n\u003cp\u003eMEDUSA ⇒\u003c/p\u003e\n\u003cp\u003eBrüder read the sign and shrugged. “So what?”\u003c/p\u003e\n\u003cp\u003eLangdon’s heart was pounding. He knew Medusa was not only the fearsome snake-haired spirit whose gaze could turn anyone who looked at her to stone, but was also a prominent member of the Greek pantheon of subterranean spirits … a specific category known as the chthonic monsters.\u003c/p\u003e\n\u003cp\u003eFollow deep into the sunken palace …\u003c/p\u003e\n\u003cp\u003efor here, in the darkness, the chthonic monster waits …\u003c/p\u003e\n\u003cp\u003eShe’s pointing the way, Langdon realized, breaking into a run along the boardwalk. Brüder could barely keep up with him as Langdon zigzagged into the darkness, following the signs for Medusa. Finally, he reached a dead end at a small viewing platform near the base of the cistern’s rightmost wall.\u003c/p\u003e\n\u003cp\u003eThere before him was an incredible sight.\u003c/p\u003e\n\u003cp\u003eRising out of the water was a colossal carved marble block—the head of Medusa—her hair writhing with snakes. Making her presence here even more bizarre was the fact that her head had been placed on her neck upside down.\u003c/p\u003e\n\u003cp\u003eInverted as the damned, Langdon realized, picturing Botticelli’s Map of Hell and the inverted sinners he had placed in the Malebolge.\u003c/p\u003e\n\u003cp\u003eBrüder arrived breathless beside Langdon at the railing, staring out at the upside-down Medusa with a look of bewilderment.\u003c/p\u003e\n\u003cp\u003eLangdon suspected that this carved head, which now served as a plinth supporting one of the columns, had probably been pillaged from elsewhere and used here as an inexpensive building supply. The reason for Medusa’s inverted position was no doubt the superstitious belief that the inversion would rob her of her evil powers. Even so, Langdon could not shake off the barrage of haunting thoughts that assailed him.\u003c/p\u003e\n\u003cp\u003eDante’s Inferno. The finale. The center of the earth. Where gravity inverts itself. Where up becomes down.\u003c/p\u003e\n\u003cp\u003eHis skin now prickling with foreboding, Langdon squinted through the reddish haze that surrounded the sculpted head. Most of Medusa’s serpent-infested hair was submerged underwater, but her eyes were above the surface, facing to the left, staring out across the lagoon.\u003c/p\u003e\n\u003cp\u003eFearfully, Langdon leaned over the railing and turned his head, letting his gaze follow the statue’s out into the familiar empty corner of the sunken palace.\u003c/p\u003e\n\u003cp\u003eIn an instant, he knew.\u003c/p\u003e\n\u003cp\u003eThis was the spot.\u003c/p\u003e\n\u003cp\u003eZobrist’s ground zero.\u003c/p\u003e\n\u003cp\u003eCHAPTER 92\u003c/p\u003e\n\u003cp\u003eAgent Brüder lowered himself stealthily, sliding beneath the railing and dropping down into the chest-deep water. As the rush of cool liquid permeated his clothing, his muscles tensed against the chill. The floor of the cistern was slippery beneath his boots, but it felt solid. He stood a moment, taking stock, watching the concentric circles of water rippling away from his body like shock waves across the lagoon.\u003c/p\u003e\n\u003cp\u003eFor a moment Brüder didn’t breathe. Move slowly, he told himself. Create no turbulence.\u003c/p\u003e\n\u003cp\u003eAbove him on the boardwalk, Langdon stood at the railing, scanning the surrounding boardwalks.\u003c/p\u003e\n\u003cp\u003e“All set,” Langdon whispered. “Nobody sees you.”\u003c/p\u003e\n\u003cp\u003eBrüder turned and faced the huge upside-down head of Medusa, which was brightly lit by a red spotlight. The inverted monster looked even larger now that Brüder was down at her level.\u003c/p\u003e\n\u003cp\u003e“Follow Medusa’s gaze across the lagoon,” Langdon whispered. “Zobrist had a flair for symbolism and dramatics … I wouldn’t be surprised if he placed his creation directly in the lethal sight line of Medusa.”\u003c/p\u003e\n\u003cp\u003eGreat minds think alike. Brüder felt grateful that the American professor had insisted on making the descent with him; Langdon’s expertise had guided them almost immediately to this distant corner of the cistern.\u003c/p\u003e\n\u003cp\u003eAs the strains of the Dante Symphony continued to reverberate in the distance, Brüder took out his waterproof Tovatec penlight and submerged it beneath the water, flipping the switch. A bright halogen beam pierced the water, illuminating the cistern floor before him.\u003c/p\u003e\n\u003cp\u003eEasy, Brüder reminded himself. Don’t disturb a thing.\u003c/p\u003e\n\u003cp\u003eWithout another word, he began his careful journey out into the lagoon, wading in slow motion through the water, moving his flashlight methodically back and forth like an underwater minesweeper.\u003c/p\u003e\n\u003cp\u003eAt the railing, Langdon had begun to feel an unsettling tightness in his throat. The air in the cistern, despite the humidity, tasted stale and oxygen-depleted to him. As Brüder waded carefully out into the lagoon, the professor reassured himself that everything would be fine.\u003c/p\u003e\n\u003cp\u003eWe arrived in time.\u003c/p\u003e\n\u003cp\u003eIt’s all intact. \u003c/p\u003e","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-57.html","bookId":2415,"creation":"Oct 5, 2019 10:36:25 AM","modification":"Oct 5, 2019 10:36:25 AM"}
