{"id":75847,"no":62,"title":"Page 62","content":"\u003cp\u003e“It’s genetic terrorism …” Langdon whispered. “It’s changing who we are, who we’ve always been, at the most fundamental level.”\u003c/p\u003e\n\u003cp\u003e“Bertrand didn’t see it that way. He dreamed of fixing the fatal flaw in human evolution … the fact that our species is simply too prolific. We are an organism that, despite our unmatched intellect, cannot seem to control our own numbers. No amount of free contraception, education, or government enticement works. We keep having babies … whether we want to or not. Did you know the CDC just announced that nearly half of all pregnancies in the U.S. are unplanned? And, in underdeveloped nations, that number is over seventy percent!”\u003c/p\u003e\n\u003cp\u003eLangdon had seen these statistics before and yet only now was he starting to understand their implications. As a species, humans were like the rabbits that were introduced on certain Pacific islands and allowed to reproduce unchecked to the point that they decimated their ecosystem and finally went extinct.\u003c/p\u003e\n\u003cp\u003eBertrand Zobrist has redesigned our species … in an attempt to save us … transforming us into a less fruitful population.\u003c/p\u003e\n\u003cp\u003eLangdon took a deep breath and stared out at the Bosporus, feeling as ungrounded as the boats sailing in the distance. The sirens were growing still louder, coming from the direction of the docks, and Langdon sensed that time was running out.\u003c/p\u003e\n\u003cp\u003e“The most frightening thing of all,” Sienna said, “is not that Inferno causes sterility, but rather that it has the ability to do so. An airborne viral vector is a quantum leap—years ahead of its time. Bertrand has suddenly lifted us out of the dark ages of genetic engineering and launched us headlong into the future. He has unlocked the evolutionary process and given humankind the ability to redefine our species in broad, sweeping strokes. Pandora is out of the box, and there’s no putting her back in. Bertrand has created the keys to modify the human race … and if those keys fall into the wrong hands, then God help us. This technology should never have been created. As soon as I read Bertrand’s letter explaining how he had achieved his goals, I burned it. Then I vowed to find his virus and destroy all traces of it.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” Langdon declared, his voice laced with anger. “If you wanted to destroy the virus, why didn’t you cooperate with Dr. Sinskey and the WHO? You should have called the CDC or someone.”\u003c/p\u003e\n\u003cp\u003e“You can’t be serious! Government agencies are the last entities on earth that should have access to this technology! Think about it, Robert. Throughout all of human history, every groundbreaking technology ever discovered by science has been weaponized—from simple fire to nuclear power—and almost always at the hands of powerful governments. Where do you think our biological weapons come from? They originate from research done at places like the WHO and CDC. Bertrand’s technology—a pandemic virus used as a genetic vector—is the most powerful weapon ever created. It paves the way for horrors we can’t yet even imagine, including targeted biological weapons. Imagine a pathogen that attacks only those people whose genetic code contains certain ethnic markers. It could enable widespread ethnic cleansing on the genetic level!”\u003c/p\u003e\n\u003cp\u003e“I see your concerns, Sienna, I do, but this technology could also be used for good, couldn’t it? Isn’t this discovery a godsend for genetic medicine? A new way to deliver global inoculations, for example?”\u003c/p\u003e\n\u003cp\u003e“Perhaps, but unfortunately, I’ve learned to expect the worst from people who hold power.”\u003c/p\u003e\n\u003cp\u003eIn the distance Langdon could hear the whine of a helicopter shatter the air. He peered through the trees back in the direction of the Spice Bazaar and saw the running lights of an aircraft skimming up over the hill and streaking toward the docks.\u003c/p\u003e\n\u003cp\u003eSienna tensed. “I need to go,” she said, standing up and glancing to the west toward Atatürk Bridge. “I think I can get across the bridge on foot, and from there reach—”\u003c/p\u003e\n\u003cp\u003e“You’re not leaving, Sienna,” he said firmly.\u003c/p\u003e\n\u003cp\u003e“Robert, I came back because I felt I owed you an explanation. Now you have it.”\u003c/p\u003e\n\u003cp\u003e“No, Sienna,” Langdon said. “You came back because you’ve been running your whole life, and you finally realized you can’t run anymore.”\u003c/p\u003e\n\u003cp\u003eSienna seemed to shrink before him. “What choice do I have?” she asked, watching the helicopter scan the water. “They’ll put me in prison as soon as they find me.”\u003c/p\u003e\n\u003cp\u003e“You’ve done nothing wrong, Sienna. You didn’t create this virus … nor did you release it.”\u003c/p\u003e\n\u003cp\u003e“True, but I went to great lengths to prevent the World Health Organization from finding it. If I don’t end up in a Turkish prison, I’ll face some kind of international tribunal on charges of biological terrorism.”\u003c/p\u003e\n\u003cp\u003eAs the thrum of the helicopter grew louder, Langdon looked toward the docks in the distance. The craft was hovering in place, rotors churning the water as its searchlight strafed the boats.\u003c/p\u003e\n\u003cp\u003eSienna looked ready to bolt at any instant.\u003c/p\u003e\n\u003cp\u003e“Please listen,” Langdon said, softening his tone. “I know you’ve been through a lot, and I know you’re scared, but you need to think of the big picture. Bertrand created this virus. You tried to stop it.”\u003c/p\u003e\n\u003cp\u003e“But I failed.”\u003c/p\u003e\n\u003cp\u003e“Yes, and now that the virus is out, the scientific and medical communities will need to understand it fully. You’re the only person who knows anything at all about it. Maybe there’s a way to neutralize it … or do something to prepare.” Langdon’s penetrating gaze bore into her. “Sienna, the world needs to know what you know. You can’t just disappear.”\u003c/p\u003e\n\u003cp\u003eSienna’s slim frame was shaking now, as if the floodgates of sorrow and uncertainty were about to burst wide. “Robert, I … I don’t know what to do. I don’t even know who I am anymore. Look at me.” She put a hand on her bald scalp. “I’ve turned into a monster. How can I possibly face—”\u003c/p\u003e\n\u003cp\u003eLangdon stepped forward and wrapped his arms around her. He could feel her body trembling, feel her frailty against his chest. He whispered softly in her ear.\u003c/p\u003e\n\u003cp\u003e“Sienna, I know you want to run, but I’m not going to let you. Sooner or later you need to start trusting someone.”\u003c/p\u003e\n\u003cp\u003e“I can’t …” She was sobbing. “I’m not sure I know how.”\u003c/p\u003e\n\u003cp\u003eLangdon held her tighter. “You start small. You take that first tiny step. You trust me.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 100\u003c/p\u003e\n\u003cp\u003eThe sharp clang of metal on metal rang through the fuselage of the windowless C-130 transport, causing the provost to jump. Outside, someone was banging the butt of a pistol against the aircraft’s hatch and demanding entry.\u003c/p\u003e\n\u003cp\u003e“Everyone stay seated,” the C-130 pilot commanded, moving toward the door. “It’s the Turkish police. They just drove out to the plane.”\u003c/p\u003e\n\u003cp\u003eThe provost and Ferris exchanged a quick glance.\u003c/p\u003e\n\u003cp\u003eFrom the flurry of panicked calls among the WHO staff on board, the provost sensed that their containment mission had failed. Zobrist carried out his plan, he thought. And my company made it possible.\u003c/p\u003e\n\u003cp\u003eOutside the hatch, authoritative-sounding voices began shouting in Turkish.\u003c/p\u003e\n\u003cp\u003eThe provost jumped to his feet. “Don’t open the door!” he ordered the pilot.\u003c/p\u003e\n\u003cp\u003eThe pilot stopped short, glaring at the provost. “Why the hell not?”\u003c/p\u003e\n\u003cp\u003e“The WHO is an international relief organization,” the provost replied, “and this plane is sovereign territory!”\u003c/p\u003e\n\u003cp\u003eThe pilot shook his head. “Sir, this plane is parked at a Turkish airport, and until it leaves Turkish airspace, it is subject to the laws of the land.” The pilot moved to the exit and threw open the hatch.\u003c/p\u003e\n\u003cp\u003eTwo uniformed men stared in. Their humorless eyes showed not the slightest hint of leniency. “Who is the captain of this aircraft?” one of them demanded in a heavy accent.\u003c/p\u003e\n\u003cp\u003e“I am,” the pilot said.\u003c/p\u003e\n\u003cp\u003eAn officer handed the pilot two sheets of paper. “Arrest documents. These two passengers must come with us.”\u003c/p\u003e\n\u003cp\u003eThe pilot skimmed the pages and glanced over at the provost and Ferris.\u003c/p\u003e\n\u003cp\u003e“Call Dr. Sinskey,” the provost ordered the WHO pilot. “We’re on an international emergency mission.”\u003c/p\u003e\n\u003cp\u003eOne of the officers eyed the provost with an amused sneer. “Dr. Elizabeth Sinskey? Director of the World Health Organization? She is the one who ordered your arrest.”\u003c/p\u003e\n\u003cp\u003e“That can’t be,” the provost replied. “Mr. Ferris and I are here in Turkey trying to help Dr. Sinskey.”\u003c/p\u003e\n\u003cp\u003e“Then you are not doing a very good job,” the second officer replied. “Dr. Sinskey contacted us and named you both as conspirators in a bioterrorism plot on Turkish soil.” He pulled out handcuffs. “You both are coming to headquarters for questioning.”\u003c/p\u003e\n\u003cp\u003e“I demand an attorney!” the provost shouted.\u003c/p\u003e\n\u003cp\u003eThirty seconds later, he and Ferris were shackled, muscled down the gangway, and shoved roughly into the backseat of a black sedan. The sedan raced away, skimming across the tarmac to a remote corner of the airport, where it stopped at a chicken-wire fence that had been cut and pulled apart to allow their car to pass. Once through the perimeter fence, the car bounced across a dusty wasteland of broken airport machinery and came to a halt near an old service building.\u003c/p\u003e\n\u003cp\u003eThe two uniformed men got out of the sedan and scanned the area. Apparently satisfied that they had not been followed, they stripped off their police uniforms and tossed them aside. Then they helped Ferris and the provost out of the car and removed their handcuffs.\u003c/p\u003e\n\u003cp\u003eThe provost rubbed his wrists, realizing that he would not do well in captivity.\u003c/p\u003e\n\u003cp\u003e“The car keys are under the mat,” one of the agents said, motioning to a white van parked nearby. “There’s a duffel in the backseat with everything you requested—travel documents, cash, prepaid phones, clothing, as well as a few other items we thought you might appreciate.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” the provost said. “You guys are good.”\u003c/p\u003e\n\u003cp\u003e“Just well trained, sir.”\u003c/p\u003e\n\u003cp\u003eWith that, the two Turkish men got back into the black sedan and drove off.\u003c/p\u003e\n\u003cp\u003eSinskey was never going to let me walk away, the provost reminded himself. Having sensed as much while flying to Istanbul, the provost had e-mailed an alert to the Consortium’s local branch, indicating that he and Ferris might need an extraction.\u003c/p\u003e\n\u003cp\u003e“You think she’ll come after us?” Ferris asked.\u003c/p\u003e\n\u003cp\u003e“Sinskey?” The provost nodded. “Absolutely. Although I suspect she has other concerns at the moment.”\u003c/p\u003e\n\u003cp\u003eThe two men climbed into the white van, and the provost rummaged through the contents of the duffel, getting their documentation in order. He pulled out a baseball cap and slipped it on. Wrapped inside the cap, he found a small bottle of Highland Park single malt.\u003c/p\u003e\n\u003cp\u003eThese guys are good.\u003c/p\u003e\n\u003cp\u003eThe provost eyed the amber liquid, telling himself he should wait until tomorrow. Then again, he pictured Zobrist’s Solublon bag and wondered what tomorrow would even look like.\u003c/p\u003e\n\u003cp\u003eI broke my cardinal rule, he thought. I gave up my client.\u003c/p\u003e\n\u003cp\u003eThe provost felt strangely adrift, knowing that in the coming days the world would be blanketed with news of a catastrophe in which he had played a very significant role. This would not have happened without me.\u003c/p\u003e\n\u003cp\u003eFor the first time in his life, ignorance no longer felt like the moral high ground. His fingers broke the seal on the bottle of Scotch.\u003c/p\u003e\n\u003cp\u003eEnjoy it, he told himself. One way or another, your days are numbered.\u003c/p\u003e\n\u003cp\u003eThe provost took a deep pull on the bottle, relishing the warmth in his throat.\u003c/p\u003e\n\u003cp\u003eSuddenly the darkness lit up with spotlights and the blue flashing strobes of police cars, which surrounded them on all sides.\u003c/p\u003e\n\u003cp\u003eThe provost looked frantically in every direction … and then sat as still as stone.\u003c/p\u003e\n\u003cp\u003eNo escape.\u003c/p\u003e\n\u003cp\u003eAs armed Turkish police officers approached the van, rifles extended, the provost took a final sip of Highland Park and quietly raised his hands over his head.\u003c/p\u003e\n\u003cp\u003eThis time, he knew, the officers were not his own.\u003c/p\u003e\n\u003cp\u003eCHAPTER 101\u003c/p\u003e\n\u003cp\u003eThe Swiss Consulate in Istanbul is located at One Levent Plaza in a sleek, ultramodern skyscraper. The building’s concave, blue-glass facade resembles a futuristic monolith along the skyline of the ancient metropolis.\u003c/p\u003e\n\u003cp\u003eNearly an hour had passed since Sinskey had left the cistern to set up a temporary command post in the consulate offices. The local news stations hummed with reports of the panicked stampede at the cistern’s final performance of Liszt’s Dante Symphony. No specifics had been reported yet, but the presence of an international medical team wearing hazmat suits had sparked wild speculation.\u003c/p\u003e\n\u003cp\u003eSinskey stared out the window at the lights of the city and felt utterly alone. Reflexively, she reached to her neck for her amulet necklace, but there was nothing to grasp. The broken talisman now lay on her desk in two fractured halves.\u003c/p\u003e\n\u003cp\u003eThe WHO director had just finished coordinating an array of emergency meetings to be held in Geneva in several hours. Specialists from various agencies were already en route, and Sinskey herself planned to fly there shortly to brief them. Mercifully, someone on the night staff had delivered a piping-hot mug of authentic Turkish coffee, which Sinskey had quickly drained.\u003c/p\u003e\n\u003cp\u003eA young man on the consulate staff peered in her open door. “Ma’am? Robert Langdon is here to see you.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” she replied. “You can send him in.”\u003c/p\u003e\n\u003cp\u003eTwenty minutes earlier, Langdon had contacted Sinskey by phone and explained that Sienna Brooks had eluded him, having stolen a boat and fled out to sea. Sinskey had already heard this news from the authorities, who were still searching the area, but so far had come up empty-handed.\u003c/p\u003e\n\u003cp\u003eNow, as Langdon’s tall frame materialized in the doorway, she barely recognized him. His suit was dirty, his dark hair tousled, and his eyes looked weary and sunken.\u003c/p\u003e\n\u003cp\u003e“Professor, are you okay?” Sinskey stood up.\u003c/p\u003e\n\u003cp\u003eLangdon gave her a tired smile. “I’ve had easier nights.”\u003c/p\u003e\n\u003cp\u003e“Please,” she said, motioning to a chair. “Have a seat.”\u003c/p\u003e\n\u003cp\u003e“Zobrist’s contagion,” Langdon began without preamble as he sat down. “I think it may have been released a week ago.” \u003c/p\u003e","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-62.html","bookId":2415,"creation":"Oct 5, 2019 10:36:25 AM","modification":"Oct 5, 2019 10:36:25 AM"}
