{"id":75792,"no":7,"title":"Page 7","content":"\u003cp\u003eSienna slid the phone number over to Langdon along with her cell phone. “You’re on. Do you remember what to say?”\u003c/p\u003e\n\u003cp\u003e“My memory is fine,” he said with a smile as he dialed the number on the slip of paper. The line began to ring.\u003c/p\u003e\n\u003cp\u003eHere goes nothing.\u003c/p\u003e\n\u003cp\u003eHe switched the call to speaker and set the phone on the table so Sienna could hear. A recorded message answered, offering general information about consulate services and hours of operation, which did not begin until 8:30 A.M.\u003c/p\u003e\n\u003cp\u003eLangdon checked the clock on the cell. It was only 6 A.M.\u003c/p\u003e\n\u003cp\u003e“If this is an emergency,” the automated recording said, “you may dial seven-seven to speak to the night duty officer.”\u003c/p\u003e\n\u003cp\u003eLangdon immediately dialed the extension.\u003c/p\u003e\n\u003cp\u003eThe line was ringing again.\u003c/p\u003e\n\u003cp\u003e“Consolato americano,” a tired voice answered. “Sono il funzionario di turno.”\u003c/p\u003e\n\u003cp\u003e“Lei parla inglese?” Langdon asked.\u003c/p\u003e\n\u003cp\u003e“Of course,” the man said in American English. He sounded vaguely annoyed to have been awoken. “How can I help you?”\u003c/p\u003e\n\u003cp\u003e“I’m an American visiting Florence and I was attacked. My name is Robert Langdon.”\u003c/p\u003e\n\u003cp\u003e“Passport number, please.” The man yawned audibly.\u003c/p\u003e\n\u003cp\u003e“My passport is missing. I think it was stolen. I was shot in the head. I’ve been in the hospital. I need help.”\u003c/p\u003e\n\u003cp\u003eThe attendant suddenly woke up. “Sir!? Did you say you were shot? What was your full name again, please?”\u003c/p\u003e\n\u003cp\u003e“Robert Langdon.”\u003c/p\u003e\n\u003cp\u003eThere was a rustling on the line and then Langdon could hear the man’s fingers typing on a keyboard. The computer pinged. A pause. Then more fingers on the keyboard. Another ping. Then three high-pitched pings.\u003c/p\u003e\n\u003cp\u003eA longer pause.\u003c/p\u003e\n\u003cp\u003e“Sir?” the man said. “Your name is Robert Langdon?”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s right. And I’m in trouble.”\u003c/p\u003e\n\u003cp\u003e“Okay, sir, your name has an action flag on it, which is directing me to transfer you immediately to the consul general’s chief administrator.” The man paused, as if he himself couldn’t believe it. “Just hold the line.”\u003c/p\u003e\n\u003cp\u003e“Wait! Can you tell me—”\u003c/p\u003e\n\u003cp\u003eThe line was already ringing.\u003c/p\u003e\n\u003cp\u003eIt rang four times and connected.\u003c/p\u003e\n\u003cp\u003e“This is Collins,” a hoarse voice answered.\u003c/p\u003e\n\u003cp\u003eLangdon took a deep breath and spoke as calmly and clearly as possible. “Mr. Collins, my name is Robert Langdon. I’m an American visiting Florence. I’ve been shot. I need help. I want to come to the U.S. Consulate immediately. Can you help me?”\u003c/p\u003e\n\u003cp\u003eWithout hesitation, the deep voice replied, “Thank heavens you’re alive, Mr. Langdon. We’ve been looking for you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 12\u003c/p\u003e\n\u003cp\u003eThe consulate knows I’m here?\u003c/p\u003e\n\u003cp\u003eFor Langdon, the news brought an instantaneous flood of relief.\u003c/p\u003e\n\u003cp\u003eMr. Collins—who had introduced himself as the consul general’s chief administrator—spoke with a firm, professional cadence, and yet there was urgency in his voice. “Mr. Langdon, you and I need to speak immediately. And obviously not on the phone.”\u003c/p\u003e\n\u003cp\u003eNothing was obvious to Langdon at this point, but he wasn’t about to interrupt.\u003c/p\u003e\n\u003cp\u003e“I’ll have someone pick you up right away,” Collins said. “What is your location?”\u003c/p\u003e\n\u003cp\u003eSienna shifted nervously, listening to the interchange on speakerphone. Langdon gave her a reassuring nod, fully intending to follow her plan exactly.\u003c/p\u003e\n\u003cp\u003e“I’m in a small hotel called Pensione la Fiorentina,” Langdon said, glancing across the street at the drab hotel that Sienna had pointed out moments ago. He gave Collins the street address.\u003c/p\u003e\n\u003cp\u003e“Got it,” the man replied. “Don’t move. Stay in your room. Someone will be there right away. Room number?”\u003c/p\u003e\n\u003cp\u003eLangdon made one up. “Thirty-nine.”\u003c/p\u003e\n\u003cp\u003e“Okay. Twenty minutes.” Collins lowered his voice. “And, Mr. Langdon, it sounds like you may be injured and confused, but I need to know … are you still in possession?”\u003c/p\u003e\n\u003cp\u003eIn possession. Langdon sensed the question, while cryptic, could have only one meaning. His eyes moved to the biotube on the kitchen table. “Yes, sir. I’m still in possession.”\u003c/p\u003e\n\u003cp\u003eCollins exhaled audibly. “When we didn’t hear from you, we assumed … well, frankly, we assumed the worst. I’m relieved. Stay where you are. Don’t move. Twenty minutes. Someone will knock on your door.”\u003c/p\u003e\n\u003cp\u003eCollins hung up.\u003c/p\u003e\n\u003cp\u003eLangdon could feel his shoulders relaxing for the first time since he’d woken up in the hospital. The consulate knows what’s going on, and soon I’ll have answers. Langdon closed his eyes and let out a slow breath, feeling almost human now. His headache had all but passed.\u003c/p\u003e\n\u003cp\u003e“Well, that was all very MI6,” Sienna said in a half-joking tone. “Are you a spy?”\u003c/p\u003e\n\u003cp\u003eAt the moment Langdon had no idea what he was. The notion that he could lose two days of memory and find himself in an unrecognizable situation felt incomprehensible, and yet here he was … twenty minutes away from a rendezvous with a U.S. Consulate official in a run-down hotel.\u003c/p\u003e\n\u003cp\u003eWhat’s happening here?\u003c/p\u003e\n\u003cp\u003eHe glanced over at Sienna, realizing they were about to part ways and yet feeling as if they had unfinished business. He pictured the bearded doctor at the hospital, dying on the floor before her eyes. “Sienna,” he whispered, “your friend … Dr. Marconi … I feel terrible.”\u003c/p\u003e\n\u003cp\u003eShe nodded blankly.\u003c/p\u003e\n\u003cp\u003e“And I’m sorry to have dragged you into this. I know your situation at the hospital is unusual, and if there’s an investigation …” He trailed off.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” she said. “I’m no stranger to moving around.”\u003c/p\u003e\n\u003cp\u003eLangdon sensed in Sienna’s distant eyes that everything had changed for her this morning. Langdon’s own life was in chaos at the moment, and yet he felt his heart going out to this woman.\u003c/p\u003e\n\u003cp\u003eShe saved my life … and I’ve ruined hers.\u003c/p\u003e\n\u003cp\u003eThey sat in silence for a full minute, the air between them growing heavy, as if they both wanted to speak, and yet had nothing to say. They were strangers, after all, on a brief and bizarre journey that had just reached a fork in the road, each of them now needing to find separate paths.\u003c/p\u003e\n\u003cp\u003e“Sienna,” Langdon finally said, “when I sort this out with the consulate, if there’s anything I can do to help you … please.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” she whispered, and turned her eyes sadly toward the window.\u003c/p\u003e\n\u003cp\u003eAs the minutes ticked past, Sienna Brooks gazed absently out the kitchen window and wondered where the day would lead her. Wherever it was, she had no doubt that by day’s end, her world would look a lot different.\u003c/p\u003e\n\u003cp\u003eShe knew it was probably just the adrenaline, but she found herself strangely attracted to the American professor. In addition to his being handsome, he seemed to possess a sincerely good heart. In some distant, alternate life, Robert Langdon might even be someone she could be with.\u003c/p\u003e\n\u003cp\u003eHe would never want me, she thought. I’m damaged.\u003c/p\u003e\n\u003cp\u003eAs she choked back the emotion, something outside the window caught her eye. She bolted upright, pressing her face to the glass and staring down into the street. “Robert, look!”\u003c/p\u003e\n\u003cp\u003eLangdon peered down into the street at the sleek black BMW motorcycle that had just rumbled to a stop in front of Pensione la Fiorentina. The driver was lean and strong, wearing a black leather suit and helmet. As the driver gracefully swung off the bike and removed a polished black helmet, Sienna could hear Langdon stop breathing.\u003c/p\u003e\n\u003cp\u003eThe woman’s spiked hair was unmistakable.\u003c/p\u003e\n\u003cp\u003eShe produced a familiar handgun, checked the silencer, and slid it back inside her jacket pocket. Then, moving with lethal grace, she slipped inside the hotel.\u003c/p\u003e\n\u003cp\u003e“Robert,” Sienna whispered, her voice taut with fear. “The U.S. government just sent someone to kill you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 13\u003c/p\u003e\n\u003cp\u003eRobert Langdon felt a swell of panic as he stood at the apartment window, eyes riveted on the hotel across the street. The spike-haired woman had just entered, but Langdon could not fathom how she had gotten the address.\u003c/p\u003e\n\u003cp\u003eAdrenaline coursed through his system, disjointing his thought process once again. “My own government sent someone to kill me?”\u003c/p\u003e\n\u003cp\u003eSienna looked equally astounded. “Robert, that means the original attempt on your life at the hospital also was sanctioned by your government.” She got up and double-checked the lock on the apartment door. “If the U.S. Consulate has permission to kill you …” She didn’t finish the thought, but she didn’t have to. The implications were terrifying.\u003c/p\u003e\n\u003cp\u003eWhat the hell do they think I did? Why is my own government hunting me?!\u003c/p\u003e\n\u003cp\u003eOnce again, Langdon heard the two words he had apparently been mumbling when he staggered into the hospital.\u003c/p\u003e\n\u003cp\u003eVery sorry … very sorry.\u003c/p\u003e\n\u003cp\u003e“You’re not safe here,” Sienna said. “We’re not safe here.” She motioned across the street. “That woman saw us flee the hospital together, and I’m betting your government and the police are already trying to track me down. My apartment is a sublet in someone else’s name, but they’ll find me eventually.” She turned her attention to the biotube on the table. “You need to open that, right now.”\u003c/p\u003e\n\u003cp\u003eLangdon eyed the titanium device, seeing only the biohazard symbol.\u003c/p\u003e\n\u003cp\u003e“Whatever’s inside that tube,” Sienna said, “probably has an ID code, an agency sticker, a phone number, something. You need information. I need information! Your government killed my friend!”\u003c/p\u003e\n\u003cp\u003eThe pain in Sienna’s voice shook Langdon from his thoughts, and he nodded, knowing she was correct. “Yes, I’m … very sorry.” Langdon cringed, hearing those words again. He turned to the canister on the table, wondering what answers might be hidden inside. “It could be incredibly dangerous to open this.”\u003c/p\u003e\n\u003cp\u003eSienna thought for a moment. “Whatever’s inside will be exceptionally well contained, probably in a shatterproof Plexiglas test tube. This biotube is just an outer shell to provide additional security during transport.”\u003c/p\u003e\n\u003cp\u003eLangdon looked out the window at the black motorcycle parked in front of the hotel. The woman had not yet come out, but she would soon figure out that Langdon was not there. He wondered what her next move would be … and how long it would take before she was pounding on the apartment door.\u003c/p\u003e\n\u003cp\u003eLangdon made up his mind. He lifted the titanium tube and reluctantly placed his thumb on the biometric pad. After a moment the canister pinged and then clicked loudly.\u003c/p\u003e\n\u003cp\u003eBefore the tube could lock itself again, Langdon twisted the two halves against each other in opposite directions. After a quarter turn, the canister pinged a second time, and Langdon knew he was committed.\u003c/p\u003e\n\u003cp\u003eLangdon’s hands felt sweaty as he continued unscrewing the tube. The two halves turned smoothly on perfectly machined threads. He kept twisting, feeling as if he were about to open a precious Russian nesting doll, except that he had no idea what might fall out.\u003c/p\u003e\n\u003cp\u003eAfter five turns, the two halves released. With a deep breath, Langdon gently pulled them apart. The gap between the halves widened, and a foam-rubber interior slid out. Langdon laid it on the table. The protective padding vaguely resembled an elongated Nerf football.\u003c/p\u003e\n\u003cp\u003eHere goes nothing.\u003c/p\u003e\n\u003cp\u003eLangdon gently folded back the top of the protective foam, finally revealing the object nestled inside.\u003c/p\u003e\n\u003cp\u003eSienna stared down at the contents and cocked her head, looking puzzled. “Definitely not what I expected.”\u003c/p\u003e\n\u003cp\u003eLangdon had anticipated some kind of futuristic-looking vial, but the content of the biotube was anything but modern. The ornately carved object appeared to be made of ivory and was approximately the size of a roll of Life Savers.\u003c/p\u003e\n\u003cp\u003e“It looks old,” Sienna whispered. “Some kind of …”\u003c/p\u003e\n\u003cp\u003e“Cylinder seal,” Langdon told her, finally permitting himself to exhale.\u003c/p\u003e\n\u003cp\u003eInvented by the Sumerians in 3500 B.C., cylinder seals were the precursors to the intaglio form of printmaking. Carved with decorative images, a seal contained a hollow shaft, through which an axle pin was inserted so the carved drum could be rolled like a modern paint roller across wet clay or terra-cotta to “imprint” a recurring band of symbols, images, or text.\u003c/p\u003e\n\u003cp\u003eThis particular seal, Langdon guessed, was undoubtedly quite rare and valuable, and yet he still couldn’t imagine why it would be locked in a titanium canister like some kind of bioweapon.\u003c/p\u003e\n\u003cp\u003eAs Langdon delicately turned the seal in his fingers, he realized that this one bore an especially gruesome carving—a three-headed, horned Satan who was in the process of eating three different men at once, one man in each of his three mouths.\u003c/p\u003e\n\u003cp\u003ePleasant.\u003c/p\u003e\n\u003cp\u003eLangdon’s eyes moved to seven letters carved beneath the devil. The ornate calligraphy was written in mirror image, as was all text on imprinting rollers, but Langdon had no trouble reading the letters—SALIGIA.\u003c/p\u003e\n\u003cp\u003eSienna squinted at the text, reading it aloud. “Saligia?”\u003c/p\u003e\n\u003cp\u003eLangdon nodded, feeling a chill to hear the word spoken aloud. “It’s a Latin mnemonic invented by the Vatican in the Middle Ages to remind Christians of the Seven Deadly Sins. Saligia is an acronym for: superbia, avaritia, luxuria, invidia, gula, ira, and acedia.”\u003c/p\u003e\n\u003cp\u003eSienna frowned. “Pride, greed, lust, envy, gluttony, wrath, and sloth.”\u003c/p\u003e\n\u003cp\u003eLangdon was impressed. “You know Latin.”\u003c/p\u003e\n\u003cp\u003e“I grew up Catholic. I know sin.”\u003c/p\u003e\n\u003cp\u003eLangdon managed a smile as he returned his gaze to the seal, wondering again why it had been locked in a biotube as if it were dangerous.\u003c/p\u003e\n\u003cp\u003e“I thought it was ivory,” Sienna said. “But it’s bone.” She slid the artifact into the sunlight and pointed to the lines on it. “Ivory forms in a diamond-shaped cross-hatching with translucent striations; bones form with these parallel striations and darkened pitting.”\u003c/p\u003e\n\u003cp\u003eLangdon gently picked up the seal and examined the carvings more closely. The original Sumerian seals had been carved with rudimentary figures and cuneiform. This seal, however, was much more elaborately carved. Medieval, Langdon guessed. Furthermore, the embellishments suggested an unsettling connection with his hallucinations. \u003c/p\u003e","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-7.html","bookId":2415,"creation":"Oct 5, 2019 10:36:24 AM","modification":"Oct 5, 2019 10:36:24 AM"}
