{"id":74893,"no":18,"title":"Page 18","content":"\u003cp\u003eCasey stood up at her desk, stretched, looked at her watch. It was ten-fifteen. She\u0027d better get some sleep, she thought. After all, she was going to appear on television tomorrow. She didn\u0027t want her mother to call afterward saying, \"Dear, you looked so tired...\"\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eCasey folded up the printout, and put it away.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZero, she thought, was the perfect default value. Because that was what she was coming up with, on this particular night\u0027s work.\u003c/p\u003e\n\u003cp\u003eA big zero.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003e\"A big fat zero,\" she said aloud. \"Means nothing on the line.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to think what it meant - that time was running out, that her plan to push the investigation had failed, and that she was going to end up in front of a television camera tomorrow afternoon, with the famous Marty Reardon asking her questions, and she would have no good answers to give him. Except the answers that John Marder wanted her to give.\u003c/p\u003e\n\u003cp\u003eJust lie. Hell with it.\u003c/p\u003e\n\u003cp\u003eMaybe that was how it was going to turn out.\u003c/p\u003e\n\u003cp\u003eYou \u0027re old enough to know how it works.\u003c/p\u003e\n\u003cp\u003eCasey turned out her desk light, and started for the door.\u003c/p\u003e\n\u003cp\u003eShe said good night to Esther, the cleaning woman, and went out into the hallway. She got into the elevator, and pushed the button to go down to the ground floor.\u003c/p\u003e\n\u003cp\u003eThe button lit up when she touched it.\u003c/p\u003e\n\u003cp\u003eGlowing\"1\"\u003c/p\u003e\n\u003cp\u003eShe yawned as the doors started to close. She was really very tired. It was silly to work this late. She\u0027d make foolish mistakes, overlook things.\u003c/p\u003e\n\u003cp\u003eShe looked at the glowing button.\u003c/p\u003e\n\u003cp\u003eAnd then it hit her.\u003c/p\u003e\n\u003cp\u003e\"Forget something?\" Esther said, as Casey came back into the office.\u003c/p\u003e\n\u003cp\u003e\"No,\" Casey said.\u003c/p\u003e\n\u003cp\u003eShe rifled through the sheets on her desk. Fast, searching. Tossing papers in all directions. Letting them flutter to the floor.\u003c/p\u003e\n\u003cp\u003eRon had said the default was zero, and therefore when you got a zero you didn\u0027t know if the line was used or not. But if there was a 1 ... then that would mean . . . She found the listing, ran her finger down the columns of numbers:\u003c/p\u003e\n\u003cp\u003eAUX\u0026nbsp;\u0026nbsp;1\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 00000000000\u003c/p\u003e\n\u003cp\u003eAUX\u0026nbsp;\u0026nbsp;2\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 00000000000\u003c/p\u003e\n\u003cp\u003eAUX\u0026nbsp;\u0026nbsp;3\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 00000000000\u003c/p\u003e\n\u003cp\u003eAUX COA\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;01000000000\u003c/p\u003e\n\u003cp\u003eThere was a numeral 1! AUX COA had registered a fault, on the second leg of the flight That meant the AUX COA line was being used by the aircraft.\u003c/p\u003e\n\u003cp\u003eBut what was it used for?\u003c/p\u003e\n\u003cp\u003eShe sucked in her breath.\u003c/p\u003e\n\u003cp\u003eShe hardly dared to hope.\u003c/p\u003e\n\u003cp\u003eRon said that AUX COA was a line for Customer Optional Additions. The customer used it for add-ons, like a QAR.\u003c/p\u003e\n\u003cp\u003eThe QAR was the Quick Access Recorder, another flight data recorder installed to help the maintenance crews. It recorded many of the same parameters as a regular DFDR. If a QAR was on this aircraft, it could solve all her problems.\u003c/p\u003e\n\u003cp\u003eBut Ron insisted this plane didn\u0027t have a QAR.\u003c/p\u003e\n\u003cp\u003eHe said he\u0027d looked in the tail, which was where it was usually installed on an N-22. And it wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eHad he ever looked anywhere else?\u003c/p\u003e\n\u003cp\u003eHad he really searched the plane?\u003c/p\u003e\n\u003cp\u003eBecause Casey knew an optional item like the QAR was not subject to FAA regulation. It could be anyplace in the aircraft the operator wanted it - in the aft accessory compartment, or the cargo hold, or the radio rack beneath the cockpit ... It could be just about anywhere.\u003c/p\u003e\n\u003cp\u003eHad Ron really looked?\u003c/p\u003e\n\u003cp\u003eShe decided to check for herself.\u003c/p\u003e\n\u003cp\u003eShe spent the next ten minutes thumbing through thick Service Repair Manuals for the N-22, without any success. The manuals didn\u0027t mention the QAR at all, or at least she couldn\u0027t find any reference. But the manuals she kept in her office were her personal copies; Casey wasn\u0027t directly involved in maintenance, and she didn\u0027t have the latest versions. Most of the manuals dated back to her own arrival at the company; they were five years old.\u003c/p\u003e\n\u003cp\u003eThat was when she noticed the Heads-Up Display, sitting on her desk.\u003c/p\u003e\n\u003cp\u003eWait a minute, she thought. She grabbed the goggles, slipped them on. She plugged them into the CD player. She pressed the power switch.\u003c/p\u003e\n\u003cp\u003eNothing happened.\u003c/p\u003e\n\u003cp\u003eShe fiddled with the equipment for a few moments, until she realized there was no CD-ROM in the machine. She looked in the cardboard box, found a silver platter, and slid it into the player. She pressed the power button again.\u003c/p\u003e\n\u003cp\u003eThe goggles glowed. She was staring at a page from the first maintenance manual, projected onto the inside of the goggles. She wasn\u0027t quite sure how the system worked, because the goggles were just an inch from her eyes, but the projected page appeared to float in space, two feet in front of\u003c/p\u003e\n\u003cp\u003eher. The page was almost transparent; she could see right through it.\u003c/p\u003e\n\u003cp\u003eKorman liked to say that virtual reality was virtually useless, except for a few specialized applications. One was maintenance. Busy people working in technical environments, people who had their hands full, or covered in grease, didn\u0027t have the time or inclination to look through a thick manual. If you were thirty feet up in the air trying to repair a jet engine, you couldn\u0027t carry a stack of five-pound manuals around with you. So virtual displays were perfect for those situations.. And Korman had built one.\u003c/p\u003e\n\u003cp\u003eBy pressing buttons on the CD player, Casey found that she could scroll through the manuals. There was also a search function, that flashed up a keyboard hanging in space; she had to repeatedly press another button to move a pointer to the letter Q, then A, then R. It was clumsy.\u003c/p\u003e\n\u003cp\u003eBut it worked.\u003c/p\u003e\n\u003cp\u003eAfter a moment of whirring, a page hung in the air before her:\u003c/p\u003e\n\u003cp\u003eN-22\u003c/p\u003e\n\u003cp\u003eQUICK ACCESS RECORDER (QAR)\u003c/p\u003e\n\u003cp\u003eRECOMMENDED LOCATIONS\u003c/p\u003e\n\u003cp\u003ePressing more buttons, she scrolled through a sequence of diagrams, showing in detail all the places where the QAR could be located on the N-22 aircraft.\u003c/p\u003e\n\u003cp\u003eThere were about thirty places in all.\u003c/p\u003e\n\u003cp\u003eCasey clipped the player onto her belt, and headed for the door.\u003c/p\u003e\n\u003cp\u003eAIRPORT MARINA\u003c/p\u003e\n\u003cp\u003e10:20 P.M.\u003c/p\u003e\n\u003cp\u003eMarty Reardon was still in Seattle.\u003c/p\u003e\n\u003cp\u003eHis interview with Gates had run long, and he\u0027d missed his plane. Now he was coming down in the morning. Jennifer had to revise the schedule.\u003c/p\u003e\n\u003cp\u003eIt was going to be a difficult day, she realized She\u0027d hoped to start at nine. Now she couldn\u0027t begin until ten at the earliest. She sat in the hotel room with her laptop, figuring it out.\u003c/p\u003e\n\u003cp\u003e9:00-10:00\u0026nbsp;\u0026nbsp;Transfer from LAX\u003c/p\u003e\n\u003cp\u003e10:00-10:45\u0026nbsp;\u0026nbsp;Barker at ofc\u003c/p\u003e\n\u003cp\u003e11:00-11:30\u0026nbsp;\u0026nbsp;King at airport\u003c/p\u003e\n\u003cp\u003e11:30-12:00\u0026nbsp;\u0026nbsp;FAA at airport\u003c/p\u003e\n\u003cp\u003e12:15-1:45\u0026nbsp;\u0026nbsp;Transfer to Burbank\u003c/p\u003e\n\u003cp\u003e2:00-2:30\u0026nbsp;\u0026nbsp;Rogers at Burbank\u003c/p\u003e\n\u003cp\u003e2:30-3:30\u0026nbsp;\u0026nbsp;Stand-up outside Norton\u003c/p\u003e\n\u003cp\u003e4:00-4:30\u0026nbsp;\u0026nbsp;Singleton at Norton\u003c/p\u003e\n\u003cp\u003e4:30-6:00\u0026nbsp;\u0026nbsp;Transfer to LAX\u003c/p\u003e\n\u003cp\u003eToo tight. No time for lunch, for traffic delays, for normal production screwups. And tomorrow was Friday; Marty would want to make the six o\u0027clock plane back to New York. Marty had a new girlfriend, and he liked to spend the weekend with her. Marty would be very pissy if he missed the flight.\u003c/p\u003e\n\u003cp\u003eAnd he was definitely going to miss it.\u003c/p\u003e\n\u003cp\u003eThe problem was that by the time Marty finished with Singleton in Burbank, it would be rush hour. He\u0027d never make his plane. He really should leave Burbank by two-thirty. Which meant pushing Singleton up, and holding off the lawyer. She was afraid she\u0027d lose the FAA guy if she changed him at the last minute. But the lawyer would be flexible. He\u0027d wait until midnight if they asked him to.\u003c/p\u003e\n\u003cp\u003eShe\u0027d talked with the lawyer earlier. King was a blowhard, but he was plausible in short bites. Five, ten seconds. Punchy. Worth doing.\u003c/p\u003e\n\u003cp\u003e9:00-10:00\u0026nbsp;\u0026nbsp;Transfer from LAX\u003c/p\u003e\n\u003cp\u003e10:00-10:45\u0026nbsp;\u0026nbsp;Barker at ofc\u003c/p\u003e\n\u003cp\u003e11:00-11:30\u0026nbsp;\u0026nbsp;FAA at airport\u003c/p\u003e\n\u003cp\u003e11:30-12:30\u0026nbsp;\u0026nbsp;Transfer to Burbank\u003c/p\u003e\n\u003cp\u003e12:30-1:00\u0026nbsp;\u0026nbsp;Rogers at Burbank\u003c/p\u003e\n\u003cp\u003e1:00-2:00\u0026nbsp;\u0026nbsp;Stand-up outside Norton\u003c/p\u003e\n\u003cp\u003e2:00-2:30\u0026nbsp;\u0026nbsp;Singleton at Norton\u003c/p\u003e\n\u003cp\u003e2:30-4:00\u0026nbsp;\u0026nbsp;Transfer to LAX\u003c/p\u003e\n\u003cp\u003e4:00-4:30\u0026nbsp;\u0026nbsp;King at airport\u003c/p\u003e\n\u003cp\u003e5:00-6:00\u0026nbsp;\u0026nbsp;Pad\u003c/p\u003e\n\u003cp\u003eThat would work. In her mind, she reviewed her pullouts. If the FAA guy was good (Jennifer hadn\u0027t met him yet, just talked on the phone), then Marty might run over with him. If it took too long to transfer to Burbank, she\u0027d blow off Rogers, who was weak anyway, and go right to Marty\u0027s stand-up. Singleton would be fast - Jennifer wanted to keep Marty moving there, so he didn\u0027t attack the woman too much. A tight schedule would help.\u003c/p\u003e\n\u003cp\u003eBack to LAX, finish with King, Marty\u0027d leave at six, and Jennifer would have her tape. She\u0027d go to an editing bay at the O and O, cut the segment, and uplink to New York that night. She\u0027d call in and get Dick\u0027s comments Saturday morning, revise it, and uplink it again about noon. That was plenty of time to make air.\u003c/p\u003e\n\u003cp\u003eShe made a note to call Norton in the morning and tell them she needed to move Singleton up two hours.\u003c/p\u003e\n\u003cp\u003eFinally she turned to the stack of faxed background documents Norton had sent her office, for Deborah\u0027s research. Jennifer had never bothered to look at these, and she wouldn\u0027t bother now, except she had nothing better to do. She thumbed through them quickly. It was what she expected -\u0026nbsp;\u0026nbsp;self-justifying papers that said the N-22 was safe, that it had an excellent record ...\u003c/p\u003e\n\u003cp\u003eFlipping from page to page, she suddenly stopped.\u003c/p\u003e\n\u003cp\u003eShe stared.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve got to be kidding,\" she said.\u003c/p\u003e\n\u003cp\u003eAnd she closed the file.\u003c/p\u003e\n\u003cp\u003eHANGAR 5\u003c/p\u003e\n\u003cp\u003e10:30 P.M.\u003c/p\u003e\n\u003cp\u003eAt night, the Norton plant appeared deserted, the parking lots nearly empty, the perimeter buildings silent. But it was brightly lit. Security kept floodlights on all night. And there were video monitors mounted on the corners of all the buildings. As she crossed from Administration to Hangar 5, she heard her footsteps clicking on the asphalt.\u003c/p\u003e\n\u003cp\u003eThe big doors to Hangar 5 were pulled down and locked. She saw Teddy Rawley, standing outside, talking to one of the electrical team. A wisp of cigarette smoke rose up toward the floodlights. She went over to the side door.\u003c/p\u003e\n\u003cp\u003e\"Hey, babe,\" Teddy said. \"Still here, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" she said.\u003c/p\u003e\n\u003cp\u003eShe started through the door. The electrical guy said, \"The building\u0027s closed. Nobody\u0027s allowed in. We\u0027re doing the GET now.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, you can\u0027t,\" the guy said. \"Ron Smith gave strict orders. Nobody\u0027s to go inside. If you touch anything on the airplane - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be careful,\" she said.\u003c/p\u003e\n\u003cp\u003eTeddy looked at her, walked over. \"I know you will,\" he said, \"but you\u0027re going to need this.\" He handed her a heavy flashlight, three feet long. \"It\u0027s dark in there, remember?\"\u003c/p\u003e\n\u003cp\u003eThe electrical guy said, \"And you can\u0027t turn the lights on, we can\u0027t have change in the ambient flux - \"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" she said The test equipment was sensitive; turning on the overhead fluorescents might change readings.\u003c/p\u003e\n\u003cp\u003eThe electrician was still fretting. \"Maybe I better call Ron and tell him you\u0027re going in.\"\u003c/p\u003e\n\u003cp\u003e\"Call whoever you want,\" Casey said.\u003c/p\u003e\n\u003cp\u003e\"And don\u0027t touch the handrails, because - \"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t,\" she said. \"For Christ\u0027s sake, I know what I\u0027m doing.\"\u003c/p\u003e\n\u003cp\u003eShe went into the hangar.\u003c/p\u003e\n\u003cp\u003eTeddy was right; it was dark inside. She felt, rather than saw, the large space around her. She could barely discern the outlines of the plane, looming above her, all its doors and compartments were open, cabling hanging down everywhere. Beneath the tail, the test box sat in a pool of faint blue light. The CRT screen flickered, as systems were activated in sequence. She saw the cockpit lights go on, then off. Then the forward cabin lights, brightly lit, thirty feet above her. Then darkness again. A moment later, the beacon lights on the wing tips and the tail came on, sending hot white strobe flashes through the room. Then darkness again.\u003c/p\u003e\n\u003cp\u003eThe front headlights suddenly glared brightly from the wing, and the landing gear began to retract. Because the plane was mounted above the ground, the landing gear was free to retract and extend. It would happen a dozen times that night.\u003c/p\u003e\n\u003cp\u003eOutside the hangar, she heard the electrician, still talking in a worried tone. Teddy laughed, and the electrician said something else.\u003c/p\u003e\n\u003cp\u003eCasey turned on her flashlight and moved forward. The flashlight cast a powerful glow. She twisted the rim, spreading the beam wider.\u003c/p\u003e\n\u003cp\u003eNow the landing gear was fully raised. Then the gear doors opened, and the landing gear began to extend, the big rubber wheels coming down flat, then turning with a hydraulic whine. A moment later, the insignia light shone up at the rudder, illuminating the tail. Then it went off again.\u003c/p\u003e\n\u003cp\u003eShe headed for the aft accessory compartment in the tail.\u003c/p\u003e\n\u003cp\u003eShe knew Ron had said the QAR wasn\u0027t there, but she felt she had to check again. She climbed the broad stairs rolled up to the back of the plane, being careful not to touch the handrails. Electrical test cables were taped to the handrails; she didn\u0027t want to disturb them, or to cause field fluctuation from the presence of her hand.\u003c/p\u003e\n\u003cp\u003eThe aft accessory compartment, built into the upward slope of the tail, was directly above her head. The compartment doors were open. She shone her light in. The upper surface of the compartment was taken up by the underside of the APU, the turbine generator that served as the auxiliary power unit: a maze of semicircular pipes and white couplings wrapped around the main unit. Below was a cramped series of readout meters, rack slots, and black PCS boxes, each with the milled vanes for heat transfer. If there was a QAR in here as well, she might easily miss it; the QARs were only about eight inches square.\u003c/p\u003e\n\u003cp\u003eShe paused to put on her goggles, and turned on the CD player. Immediately a diagram of the aft accessory compartment hung in space before her eyes. She could see through the diagram to the actual compartment behind. The rectangular block marking the QAR was outlined in red on the diagram. In the actual compartment, the space was taken up by an extra readout meter: hydraulic pressure for a flight control system.\u003c/p\u003e\n\u003cp\u003eRon was right.\u003c/p\u003e\n\u003cp\u003eThere was no QAR here.\u003c/p\u003e\n\u003cp\u003eCasey climbed back down the stairs to the floor, and walked beneath the plane to the forward accessory compartment, just behind the nose wheel. It, too, was open. Standing on the ground, she shone her flashlight up into the compartment, and flicked to the correct manual page. A new image hung in the air. It snowed the QAR located in the right anterior electrical rack, next to the hydraulic activator buses.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t there. The slot was empty, the round connector plug exposed at the back, the shiny metal contact points glinting.\u003c/p\u003e\n\u003cp\u003eIt had to be somewhere inside the plane.\u003c/p\u003e\n\u003cp\u003eShe headed off to the right, where a roll-up staircase led up thirty feet to the passenger door, just behind the cockpit. She heard her feet ring on the metal as she entered the aircraft.\u003c/p\u003e\n\u003cp\u003eIt was dark; she shone her flashlight aft, the beam moving over the cabin. The passenger cabin looked worse than before; hi many places her beam caught the dull silver of the insulation pads. The electrical crews had pulled the ulterior panels around the windows, to get at junction boxes along the walls. She noticed a lingering faint odor of vomit; someone had tried to mask it with a sweet floral spray.\u003c/p\u003e\n\u003cp\u003eBehind her, the cockpit suddenly glowed. The overhead map lights came on, softly illuminating the two seats; then the row of video display screens, the twinkling lights of the overhead panels. The FDAU printer on the pedestal buzzed, printing out a couple of test lines, then was silent. All the cockpit lights went out\u003c/p\u003e\n\u003cp\u003eDark again.\u003c/p\u003e\n\u003cp\u003eCycling.\u003c/p\u003e\n\u003cp\u003eImmediately, the forward galley lights just ahead of her came on; the illuminators for heating and microwaves flashed; the overheat and timer warnings beeped. Then everything went off. Silence.\u003c/p\u003e\n\u003cp\u003eDark again.\u003c/p\u003e\n\u003cp\u003eCasey was still standing just inside the door, fiddling with the CD player at her waist when she thought she heard footsteps. She paused, listening.\u003c/p\u003e\n\u003cp\u003eIt was difficult to tell; as the electrical systems cycled through, there was a continuous succession of soft buzzes and clicks from relays and solenoids in the avionics racks around her. She listened hard.\u003c/p\u003e\n\u003cp\u003eYes, she was sure of it now.\u003c/p\u003e\n\u003cp\u003eFootsteps.\u003c/p\u003e\n\u003cp\u003eSomeone was walking slowly, steadily, through the hangar.\u003c/p\u003e\n\u003cp\u003eFrightened, she leaned out the door and called loudly, \u0027Teddy? Is that you?\"\u003c/p\u003e\n\u003cp\u003eShe listened.\u003c/p\u003e\n\u003cp\u003eNo more footsteps.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eThe clicking of the relays.\u003c/p\u003e\n\u003cp\u003eThe hell with it she decided. She was up here, alone inside this torn-up airplane, and it was getting on her nerves. She was tired. She was imagining things.\u003c/p\u003e\n\u003cp\u003eShe walked around the galley to the left side, where the display showed an additional electrical storage panel, down near the floor. The panel cover had already been removed. She looked at it through the transparent diagram. This was mostly taken up with secondary avionics boxes, and there was little room...\u003c/p\u003e\n\u003cp\u003eNo QAR.\u003c/p\u003e\n\u003cp\u003eShe moved down the cabin, to the midships bulkhead. There was a small storage compartment here, built into the bulkhead frame, just below a slot for magazines. It was a foolish place to install a QAR, she thought, and she was not surprised when she didn\u0027t find one there, either.\u003c/p\u003e\n\u003cp\u003eFour down. Twenty-six to go.\u003c/p\u003e\n\u003cp\u003eNow she moved toward the tail, to the aft interior storage compartment. This was a more likely place: a square service panel that was just to the left of the rear exit door, on the side of the aircraft. The panel didn\u0027t screw down; it flipped up on a hinge, which made it more accessible for crews in a hurry.\u003c/p\u003e\n\u003cp\u003eShe came to the door, which was open. She felt a cool breeze. Darkness outside: she couldn\u0027t see the ground, forty feet below. The panel was just to the left of the door, and it was already open. She looked, seeing it through the diagram. If the QAR was there, it would be in the lower-right corner, next to the breaker switches for the cabin lights and the crew intercom.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t there.\u003c/p\u003e\n\u003cp\u003eThe wing tip lights came on, brilliant strobes flashing repeatedly. They cast harsh shadows in the interior, through the open door and the row of windows. Then off again.\u003c/p\u003e\n\u003cp\u003eClink.\u003c/p\u003e\n\u003cp\u003eShe froze.\u003c/p\u003e\n\u003cp\u003eThe sound had come from somewhere near the cockpit. It was a metallic sound, like a foot kicking a tool.\u003c/p\u003e\n\u003cp\u003eShe listened again. She heard a soft tread, a creak.\u003c/p\u003e\n\u003cp\u003eSomeone was in the cabin,\u003c/p\u003e\n\u003cp\u003eShe pulled the goggles off her head, leaving them hanging around her neck. Silently, she slid to her right, crouching behind a row of seats at the rear of the plane.\u003c/p\u003e\n\u003cp\u003eShe heard footsteps coming closer. A complicated pattern of sound. A murmur. Was there more than one?\u003c/p\u003e\n\u003cp\u003eShe held her breath.\u003c/p\u003e\n\u003cp\u003eThe cabin lights came on, first in front, then midships, then aft. But most of the ceiling lights were hanging, so they cast odd shadows, then went off again.\u003c/p\u003e\n\u003cp\u003eShe gripped the flashlight. The weight felt comforting in her hand. She moved her head to the right, so she could peer between the seats.\u003c/p\u003e\n\u003cp\u003eShe heard the footsteps again, but could see nothing.\u003c/p\u003e\n\u003cp\u003eThen the landing lights came on, and in their reflected glare, a row of hot ovals appeared on the ceiling, from the windows along both sides. And a shadow, blotting out the ovals, one after another.\u003c/p\u003e\n\u003cp\u003eSomeone walking down the aisle.\u003c/p\u003e\n\u003cp\u003eNot good, she thought.\u003c/p\u003e\n\u003cp\u003eWhat could she do? She had the flashlight in her hand, but she had no illusions about her ability to defend herself. She had her cell phone. Her beeper. Her -\u003c/p\u003e\n\u003cp\u003eShe reached down, and silently flicked the beeper off.\u003c/p\u003e\n\u003cp\u003eThe man was close now. She edged forward, her neck aching, and she saw him. He was almost to the rear of the plane, looking in every direction. She could not see his face, but in the reflected landing lights, she could see his red-checked shirt.\u003c/p\u003e\n\u003cp\u003eThe landing lights went out.\u003c/p\u003e\n\u003cp\u003eDarkness in the cabin.\u003c/p\u003e\n\u003cp\u003eShe held her breath.\u003c/p\u003e\n\u003cp\u003eShe heard the faint thunk of a relay, coming from somewhere in the forward compartment. She knew it was electrical, but apparently the man in the red shirt did not. He grunted softly, as if surprised, and moved forward quickly.\u003c/p\u003e\n\u003cp\u003eShe waited.\u003c/p\u003e\n\u003cp\u003eAfter a while, she thought she heard the sound of footsteps on the metal stairs, going down. She wasn\u0027t sure, but she thought so.\u003c/p\u003e\n\u003cp\u003eThe airplane was silent around her.\u003c/p\u003e\n\u003cp\u003eCautiously, she came out from behind the seat. It was time to get out of here, she thought. She moved to the open door, listening. There was no question, the footsteps walking away, the sound diminishing. The nose lights came on, and she saw a long streak of shadow. A man.\u003c/p\u003e\n\u003cp\u003eWalking away.\u003c/p\u003e\n\u003cp\u003eA voice inside said, Get out of here, but she felt the goggles around her neck, and hesitated. She ought to give the man plenty of time to leave the hangar - she didn\u0027t want to go down and find him on the floor. So she decided to look in another compartment.\u003c/p\u003e\n\u003cp\u003eShe pulled on the goggles, pressed the button on the unit. She saw the next page.\u003c/p\u003e\n\u003cp\u003eThe next compartment was nearby, located just outside the rear door, where she was standing. She leaned out the door and, holding on with her right hand, found she could easily look into the panel box. The cover was already open. There were three vertical rows of electrical buses, which probably controlled the two rear doors; they were overrides. And at the bottom...\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eThe Quick Access Recorder.\u003c/p\u003e\n\u003cp\u003eIt was green, with a white stripe around the top. Stenciled lettering: MAINT QAR 041/B MAINT. A metal box about eight inches square, with a plug facing outward. Casey reached in, gripped the box, and pulled gently. With a metallic click it came free of the inner coupling. And she had it in her hand.\u003c/p\u003e\n\u003cp\u003eAll right!\u003c/p\u003e\n\u003cp\u003eShe stepped back inside the doorway, holding die box in both hands now. She was so excited she was trembling. This changed everything!\u003c/p\u003e\n\u003cp\u003eShe was so excited, she did not hear the rush of footsteps behind her until it was too late. Strong hands shoved against her, she grunted, and her hands slipped away, and then her body fell through the door, into space.\u003c/p\u003e\n\u003cp\u003eFalling.\u003c/p\u003e\n\u003cp\u003eTo the floor thirty feet below.\u003c/p\u003e\n\u003cp\u003eToo soon - much too soon - she felt a sharp pain on her cheek - and then her body landed, but something was wrong. There were strange pressure points all over her body. She was no longer falling, but rising. Then falling again. It was like a giant hammock.\u003c/p\u003e\n\u003cp\u003eThe webbing.\u003c/p\u003e\n\u003cp\u003eShe\u0027d hit the safety webbing.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t see it in the darkness, but the black safety webbing was hung beneath the plane, and she had fallen into it. Casey rolled over onto her back, saw a silhouette at the door. The figure turned and ran through the airplane. She scrambled to her feet, but it was difficult to balance. The webbing was slowly undulating.\u003c/p\u003e\n\u003cp\u003eShe moved forward, toward the dull metal expanse of the wing. She heard footsteps clattering on the metal stairs, somewhere forward. The man was coming.\u003c/p\u003e\n\u003cp\u003eShe had to get out.\u003c/p\u003e\n\u003cp\u003eShe had to get off the webbing before he caught her. She moved closer to the wing, and then she heard a cough. It had come from the far edge of the wing, somewhere off to her left.\u003c/p\u003e\n\u003cp\u003eSomeone else was here.\u003c/p\u003e\n\u003cp\u003eDown on the floor.\u003c/p\u003e\n\u003cp\u003eWaiting.\u003c/p\u003e\n\u003cp\u003eShe paused, feeling the gentle swaying of the webbing beneath her. In a moment, she knew, more lights would come on. Then she could see where the man was.\u003c/p\u003e\n\u003cp\u003eSuddenly, the hot strobe lights above the tail flickered rapidly. They were so bright, they illuminated the entire hangar.\u003c/p\u003e\n\u003cp\u003eNow she could see who had coughed.\u003c/p\u003e\n\u003cp\u003eIt was Richman. \u003c/p\u003e","sourceLink":"https://allnovel.net/airframe/page-18.html","bookId":2409,"creation":"Oct 5, 2019 10:33:22 AM","modification":"Oct 5, 2019 10:33:22 AM"}
