{"id":67150,"no":20,"title":"Page 20","content":"\u003cp\u003e\"SLOW DOWN, slow down,\" Angeli said hoarsely. \"I can\u0027t understand a word you\u0027re saying.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Judd said. He took a deep breath. \"I\u0027ve got the answer!\" He was so relieved to hear Angeli\u0027s voice over the phone that he was almost babbling. \"I know who\u0027s trying to kill me. I know who Don Vinton is.\"\u003c/p\u003e\n\u003cp\u003eThere was a skeptical note in Angeli\u0027s voice. \"We couldn\u0027t find any Don Vinton.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know why? Because it isn\u0027t a him - -it\u0027s a who.\"\u003c/p\u003e\n\u003cp\u003e\"Will you speak more slowly?\"\u003c/p\u003e\n\u003cp\u003eJudd\u0027s voice was trembling with excitement. \"Don Vinton isn\u0027t a name. It\u0027s an Italian expression. It means \u0027the big man.\u0027 That\u0027s what Moody was trying to tell me. That The Big Man was after me.\"\u003c/p\u003e\n\u003cp\u003e\"You lost me, Doctor.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t mean anything in English,\" said Judd, \"but when you say it in Italian - doesn\u0027t it suggest anything to you? An organization of killers run by The Big Man?\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence over the phone. \"La Cosa Nostra?\"\u003c/p\u003e\n\u003cp\u003e\"Who else could assemble a group of killers and weapons like that? Acid, bombs - guns! Remember I told you the man we\u0027re looking for would be a Southern European? He\u0027s Italian.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t make sense. Why would La Cosa Nostra want to kill you?\"\u003c/p\u003e\n\u003cp\u003e\"I have absolutely no idea. But I\u0027m right. I know I\u0027m right. And it fits in with something Moody said. He said there was a group of men out to kill me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the craziest theory I\u0027ve ever heard,\" Angeli said. There was a pause, then he added, \"But I suppose it could be possible.\"\u003c/p\u003e\n\u003cp\u003eJudd was flooded with sudden relief. If Angeli had not been willing to listen to him, he would have had no one to turn to.\u003c/p\u003e\n\u003cp\u003e\"Have you discussed this with anyone?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Judd said.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" Angeli\u0027s voice was urgent. \"If you\u0027re right, your life depends on it. Don\u0027t go near your office or apartment.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t,\" Judd promised. He suddenly remembered. \"Did you know McGreavy has a warrant out for my arrest?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Angeli hesitated. \"If McGreavy picks you up, you\u0027ll never get to the station alive.\"\u003c/p\u003e\n\u003cp\u003eMy God! So he had been right about McGreavy. But he could not believe that McGreavy was the brain behind this. There was someone directing him...Don Vinton, The Big Man.\u003c/p\u003e\n\u003cp\u003e\"Can you hear me?\"\u003c/p\u003e\n\u003cp\u003eJudd\u0027s mouth was suddenly dry. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eA man in a gray overcoat stood outside the phone booth looking in at Judd. Was it the same man he had seen before?\u003c/p\u003e\n\u003cp\u003e\"Angeli...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know who the others are. I don\u0027t know what they look like. How do I stay alive until they\u0027re caught?\"\u003c/p\u003e\n\u003cp\u003eThe man outside the booth was staring at him.\u003c/p\u003e\n\u003cp\u003eAngeli\u0027s voice came over the line. \"We\u0027re going straight to the FBI. I have a friend who has connections. He\u0027ll see that you\u0027re protected until you\u0027re safe. OK?\" There was a note of assurance in Angeli\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"OK,\" Judd said gratefully. His knees felt like jelly.\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"In a phone booth in the lower lobby of the Pan-Am Building.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t move. Keep plenty of people around you. I\u0027m on my way.\" There was a click at the other end of the line as Angeli hung up.\u003c/p\u003e\n\u003cp\u003eHe put the phone back on the squad-room desk, a sick feeling deep inside him. Over the years he had become accustomed to dealing with murderers, rapists, perverts of every description, and somehow, in time, a protective shell had formed, allowing him to go on believing in the basic dignity and humanity of man.\u003c/p\u003e\n\u003cp\u003eBut a rogue cop was something different.\u003c/p\u003e\n\u003cp\u003eA rogue cop was a corruption that touched everyone on the force, that violated everything that decent cops fought and died for.\u003c/p\u003e\n\u003cp\u003eThe squad room was filled with the passage of feet and the murmur of voices, but he heard none of it. Two uniformed patrolmen passed through the room with a giant drunk in handcuffs. One of the officers had a black eye and the other held a handkerchief to a bloody nose. The sleeve of his uniform had been ripped half off. The patrolman would have to pay for that himself. These men were ready to risk their lives every day and night of the year. But that wasn\u0027t what made headlines. A crooked cop made headlines. One crooked cop tainted them all. His own partner.\u003c/p\u003e\n\u003cp\u003eWearily he got up and walked down the ancient corridor to the captain\u0027s office. He knocked once and went in.\u003c/p\u003e\n\u003cp\u003eBehind a battered desk pocked with the lighted cigar butts of countless years sat Captain Bertelli. Two FBI men were in the room, dressed in business suits. Captain Bertelli looked up as the door opened. \"Well?\"\u003c/p\u003e\n\u003cp\u003eThe detective nodded. \"It checks out. The property custodian said he came in and borrowed Carol Roberts\u0027 key from the evidence locker Wednesday afternoon and returned it late Wednesday night. That\u0027s why the paraffin test was negative - he got into Dr. Stevens\u0027 office by using an original key. The custodian never questioned it because he knew he was assigned to the case.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know where he is now?\" asked the younger of the FBI men.\u003c/p\u003e\n\u003cp\u003e\"No. We had a tail on him, but he lost him. He could be anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be hunting for Dr. Stevens,\" said the second FBI agent.\u003c/p\u003e\n\u003cp\u003eCaptain Bertelli turned to the FBI men. \"What are the chances of Dr. Stevens staying alive?\"\u003c/p\u003e\n\u003cp\u003eThe man shook his head. \"If they find him before we do - none.\"\u003c/p\u003e\n\u003cp\u003eCaptain Bertelli nodded. \"We\u0027ve got to find him first.\" His voice grew savage. \"I want Angeli brought back, too. I don\u0027t care how you get him.\" He turned to the detective. \"Just get him, McGreavy.\"\u003c/p\u003e\n\u003cp\u003eThe police radio began to crackle out a staccato message: \"Code Ten...Code Ten...All cars...pick up five...\"\u003c/p\u003e\n\u003cp\u003eAngeli switched the radio off. \"Anyone know I picked you up?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"No one,\" Judd assured him.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t discussed La Cosa Nostra with anybody?\"\u003c/p\u003e\n\u003cp\u003e\"Only you.\"\u003c/p\u003e\n\u003cp\u003eAngeli nodded, satisfied.\u003c/p\u003e\n\u003cp\u003eThey had crossed the George Washington Bridge and were headed for New Jersey. But everything had changed. Before, he had been filled with apprehension. Now, with Angeli at his side, he no longer felt like the hunted. He was the hunter. And the thought filled him with deep satisfaction.\u003c/p\u003e\n\u003cp\u003eAt Angeli\u0027s suggestion, Judd had left his rented car in Manhattan and he was riding in Angeli\u0027s unmarked police car. Angeli had headed north on the Palisades Interstate Park-way and exited at Orangeburg. They were approaching Old Tappan.\u003c/p\u003e\n\u003cp\u003e\"It was smart of you to spot what was going on, Doctor,\" Angeli said.\u003c/p\u003e\n\u003cp\u003eJudd shook his head. \"I should have figured it out as soon as I knew there was more than one man involved. It had to be an organization using professional killers. I think Moody suspected the truth when he saw the bomb in my car. They had access to every kind of weapon.\"\u003c/p\u003e\n\u003cp\u003eAnd Anne. She was part of the operation, setting him up so that they could murder him. And yet - he couldn\u0027t hate her. No matter what she had done, he could never hate her.\u003c/p\u003e\n\u003cp\u003eAngeli had turned off the main highway. He deftly tooled the car onto a secondary road that led toward a wooded area.\u003c/p\u003e\n\u003cp\u003e\"Does your friend know we\u0027re coming?\" Judd asked.\u003c/p\u003e\n\u003cp\u003e\"I phoned him. He\u0027s all ready for you.\"\u003c/p\u003e\n\u003cp\u003eA side road appeared abruptly, and Angeli turned the car into it. He drove for a mile, then braked to a stop in front of an electric gate. Judd noticed a small television camera mounted above the gate. There was a click and the gate swung open, then closed solidly behind them. They began driving up a long, curving driveway. Through the trees ahead, Judd caught a glimpse of the sprawling roof of an enormous house. High on top, flashing in the sun, was a bronze rooster.\u003c/p\u003e\n\u003cp\u003eIts tail was missing. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-naked-face/page-20.html","bookId":2354,"creation":"Oct 5, 2019 10:03:51 AM","modification":"Oct 5, 2019 10:03:51 AM"}
