{"id":74766,"no":18,"title":"Page 18","content":"\u003cp\u003e“Fine, and you?” he muttered.\u003c/p\u003e\n\u003cp\u003e“Peyton, come on.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to say? They stripped me of my weapons because they thought I was going to off myself—and you know, I think that logic was very sound. Does that answer your question?”\u003c/p\u003e\n\u003cp\u003eWhen she just stared at him, he cursed. “Sorry.”\u003c/p\u003e\n\u003cp\u003eLowering his eyes, he turned the bottle around in his hands until he could inspect the little English guard on the label. Man, if there was only a way to change places with a two-dimensional drawing—he’d rather like to be nothing more than an image.\u003c/p\u003e\n\u003cp\u003e“Any word about her?” he asked roughly.\u003c/p\u003e\n\u003cp\u003e“Not yet. We’re just out there pacing. Ehlena said it was still going to be a while.”\u003c/p\u003e\n\u003cp\u003e“Is that why you came in here? To tell me that.”\u003c/p\u003e\n\u003cp\u003e“I thought you had a right to know.”\u003c/p\u003e\n\u003cp\u003e“I appreciate that.” He took a shuddering inhale. “You know, I really should have just let you do your damn job.”\u003c/p\u003e\n\u003cp\u003e“Peyton…”\u003c/p\u003e\n\u003cp\u003eDimly, he wondered if she was going to say his name like that for the rest of their lives. Like it was a sob with syllables.\u003c/p\u003e\n\u003cp\u003eShe came forward and sat down in the chair opposite him. “It was a mistake. Some kind of knee-jerk reaction.”\u003c/p\u003e\n\u003cp\u003e“If she dies, I’m a murderer.”\u003c/p\u003e\n\u003cp\u003e“You are not.”\u003c/p\u003e\n\u003cp\u003ePeyton just shook his head. Then he looked at her and made his eyes stay put.\u003c/p\u003e\n\u003cp\u003eThe wisps of blond hair that had escaped her low ponytail glowed in the recessed lights of the ceiling, giving her a halo—and that seemed apt. She was a saint, a female with a heart of gold.\u003c/p\u003e\n\u003cp\u003eAnd then he thought of that crackerjack shot that had blown that lesser’s head apart.\u003c/p\u003e\n\u003cp\u003eOkay, fine, she had a heart of gold and the marksmanship of a sniper.\u003c/p\u003e\n\u003cp\u003eWith abrupt clarity, he remembered her back during orientation, helping him to keep going after he’d eaten those poisoned hors d’oeuvres and gotten sick, pulling him through until he had finally collapsed from exhaustion on the final leg of the brutal endurance test—after which she had kept going. He also had so many images of her in class, always paying attention, working so hard to prepare for tests, asking good questions. She brought the same focus and dedication to every part of the physical training, too, whether it was hand-to-hand combat, pumping iron in the weight room, or running obstacle courses.\u003c/p\u003e\n\u003cp\u003eShe was utterly qualified to do the job she was in.\u003c/p\u003e\n\u003cp\u003eAnd what was more? He was willing to bet she never would have made the call he had back in that alley. She would never have stepped in where she wasn’t needed.\u003c/p\u003e\n\u003cp\u003e“Knee-jerk,” she had called his reaction.\u003c/p\u003e\n\u003cp\u003eNo, it wasn’t that. He’d been protecting her as if she were his female. Putting himself in danger to save her—when in fact, she hadn’t required saving and wasn’t his to worry about. If it had been anyone else tackling that lesser? He would not have interfered.\u003c/p\u003e\n\u003cp\u003eWith a frown, he noticed that she was fiddling with something at her throat. A little charm on a chain. She’d never worn anything like that before, and God knew, her mother’s jewelry was all statement pieces from major houses, not something so dainty and simple.\u003c/p\u003e\n\u003cp\u003eIt had to be from Craeg.\u003c/p\u003e\n\u003cp\u003eWhite gold, probably, he thought. Not even platinum. And yet she no doubt thought it was priceless.\u003c/p\u003e\n\u003cp\u003eAs he watched her slender fingers worry whatever the charm was on its delicate necklace, he had the very clear conviction that he needed to let go of his fantasy.\u003c/p\u003e\n\u003cp\u003e“Listen, Peyton, about what you said last night—”\u003c/p\u003e\n\u003cp\u003e“I said nothing. It was a joke. A bad-timed, stupid-ass joke.”\u003c/p\u003e\n\u003cp\u003eThe silence that followed suggested she had done the math on his Gronk/linebacker move on her in that alley and knew he was lying. But at that moment, sure as if the conversation was being broadcast over loudspeakers, the door opened—and yeah, of course, it was Craeg.\u003c/p\u003e\n\u003cp\u003e“They’re closing her up now,” the male announced in a hard voice.\u003c/p\u003e\n\u003cp\u003eWow, Peyton thought as the male glared at him. That stare could do as much damage as a hollow-point bullet—and he should know, ’cuz he’d been shot in the head in the field.\u003c/p\u003e\n\u003cp\u003e“Is she going to be okay?” Paradise said as she got up and went to her mate. “Is she?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” The embrace the two shared was all about the mutual support—and didn’t it make Peyton feel like an outsider. Appropriately. “She’s in critical condition. But they’re looking for volunteers she can feed from, which has to mean she’s got a chance. Listen, are you okay if I give her my vein—”\u003c/p\u003e\n\u003cp\u003e“Oh, my God, yes. Of course.”\u003c/p\u003e\n\u003cp\u003ePeyton spoke up. “She won’t want it from me.”\u003c/p\u003e\n\u003cp\u003eThose hostile eyes swung back his way. “No one is asking you.”\u003c/p\u003e\n\u003cp\u003eOh, so it’s gonna be like that, Peyton thought. But it wasn’t hard to understand the guy’s position.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eBefore Craeg could throw down, Paradise put herself between them and pushed her boy back, palms to pecs. “Relax, okay? We do not need any more injuries on the team.”\u003c/p\u003e\n\u003cp\u003eShe lowered her voice at that point and there was a private exchange between the two of them, all quick words at a shhh’d volume. And then Craeg punched the door back open and left.\u003c/p\u003e\n\u003cp\u003eParadise took a deep breath. “Look…I think we need to talk.”\u003c/p\u003e\n\u003cp\u003e“No. We don’t and we aren’t.”\u003c/p\u003e\n\u003cp\u003e“Peyton. What happened tonight—”\u003c/p\u003e\n\u003cp\u003e“Will never happen again. Mostly likely because they are going to throw me out of the program, but even if they don’t, I’m not making this mistake again. You’re on your own.”\u003c/p\u003e\n\u003cp\u003e“Wait a minute. Excuse me? I don’t need you looking after me. I can take care of myself.”\u003c/p\u003e\n\u003cp\u003e“I know, I know.” He rubbed his face. Took another swig from the bottle. Wanted to scream. “It’s over, Paradise. Okay? It’s done—and stop looking at me like that.”\u003c/p\u003e\n\u003cp\u003e“Like what.”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eThere was a long quiet. “Peyton, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I was the one who made a mistake, not you.” To cover up the double meaning, he shook his head. “I’ll apologize to Craeg, too. You don’t have to tell me.”\u003c/p\u003e\n\u003cp\u003eThe door swung open again, but this time, the Brother Rhage put his head in. “Okay, Novo’s out of surgery, and at least she’s alive. So you and I need to do an incident debriefing and then we’ll make an appointment for you to get psych eval’d.”\u003c/p\u003e\n\u003cp\u003eWhen Peyton didn’t respond, the Brother nodded at the corridor behind him. “Come on, son, you gotta follow me to the office.”\u003c/p\u003e\n\u003cp\u003eAs Peyton got to his feet, he thought it was a sad commentary on your life when an interruption requiring you to justify an unjustifiable action was a step up from your other option—which happened to be a lively discussion about unrequited love with the object of your unreciprocated affections.\u003c/p\u003e\n\u003cp\u003eAh, yes, choices, choices.\u003c/p\u003e\n\u003cp\u003eOn his way to the exit, he put the Beefeater down on a side table, and as he came up to Paradise, he paused.\u003c/p\u003e\n\u003cp\u003eReaching out, he put his hand on her arm and gave her what he hoped was a reassuring squeeze. “I’m sorry. For everything. It’s all on me, all my fault.”\u003c/p\u003e\n\u003cp\u003eBefore she could respond, he released his hold and walked out.\u003c/p\u003e\n\u003cp\u003eIn the concrete hall, the rest of the trainees, along with a number of Brothers, were milling around the clinical area, and everyone went statue as they saw him, shuffling boots halting, whispering words silenced.\u003c/p\u003e\n\u003cp\u003eHe had no idea what to say to any of them.\u003c/p\u003e\n\u003cp\u003eSo he just ducked his head and kept on going.\u003c/p\u003e\n\u003cp\u003e“You’re going to want to take a right up here at that fork in the road.”\u003c/p\u003e\n\u003cp\u003eAs Saxton spoke, he pointed through the windshield even though the truck’s headlights were already showing the way. Next to him, Ruhn was behind the wheel, one of the male’s big hands resting comfortably at the twelve spot, the other palm on his thigh.\u003c/p\u003e\n\u003cp\u003eBitty’s uncle was a consummate driver. Smooth, steady, in total control of the enormous Ford-whatever-the-heck-it-was even though there was enough iced-over snowpack on the road to rival Alaska.\u003c/p\u003e\n\u003cp\u003eIt was good to feel safe.\u003c/p\u003e\n\u003cp\u003eAnd then there was the fact the male smelled amazing. A clean, powerful scent, which was soap and shampoo and shaving cream, but none of the fancy kind. Then again, on Ruhn? Palmolive was a cologne. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-18.html","bookId":1777,"creation":"Oct 5, 2019 10:32:55 AM","modification":"Oct 5, 2019 10:32:55 AM"}
