{"id":74751,"no":3,"title":"Page 3","content":"\u003cp\u003eBut there was another thing she was good at.\u003c/p\u003e\n\u003cp\u003eAnd even though Novo had no right to care and no reason to notice and zero fucks to give, it was sublimely annoying to watch Peyton sneak those looks and linger in those doorways and pull those double takes whenever the female laughed.\u003c/p\u003e\n\u003cp\u003eThe only thing that was even more irritating? That the shit was on Novo’s radar at all.\u003c/p\u003e\n\u003cp\u003ePeyton, son of Peythone, was nothing she was interested in. After all, some things, like not volunteering for a major limb amputation, were self-evident.\u003c/p\u003e\n\u003cp\u003ePlus hello, personal history.\u003c/p\u003e\n\u003cp\u003eNot with him specifically. But still.\u003c/p\u003e\n\u003cp\u003eSo the fact that she’d even noticed the guy’s addiction to that other female was enough to make Novo want to beat her own ass.\u003c/p\u003e\n\u003cp\u003eAs she turned to head for the shower stalls, she caught sight of herself in a full-length mirror—a fixture she was very sure wasn’t in the males’ locker room.\u003c/p\u003e\n\u003cp\u003eWhich was really just so damned sexist—\u003c/p\u003e\n\u003cp\u003eHer thoughts dropped the mic on that familiar rant as her reflection registered. Her eyes had become hollow pits, and her stomach, left bare between her sports bra and her leggings, was concave, and her legs were swollen with muscle except for the tight bony knots of her kneecaps.\u003c/p\u003e\n\u003cp\u003eNo hips, no tits, no female identifiers…even her long hair was bolted in a braid that hung as if in retreat down the powerful fans on either side of her spine.\u003c/p\u003e\n\u003cp\u003eNovo nodded at herself in approval.\u003c/p\u003e\n\u003cp\u003eShe wouldn’t want things any other way.\u003c/p\u003e\n\u003cp\u003eParadise could keep the chick shit and all the sidelong stares in the world. Far better to be strong as opposed to sensual. The latter got you admired…\u003c/p\u003e\n\u003cp\u003eThe former kept you safe.\u003c/p\u003e\n\u003cp\u003e“Nope,” Peyton said. “Not interrupting anything at all.”\u003c/p\u003e\n\u003cp\u003eAs he smiled at Craeg, he thought, Yuuuuup, it’s totally cool. I just told your girl I loved her while she thought I was still stuck on not wanting her to be in the training program. So yeah, conversationally speaking, we just faced off in a duel, where she had a gun and I had two paper clips and a rubber band. But it’s fine.\u003c/p\u003e\n\u003cp\u003eAlthough, hey, while we’re on the subject, maybe you want to slice my nut sac off and put my two veg in your back pocket? ’Cuz I won’t be needing them anymore after this.\u003c/p\u003e\n\u003cp\u003eBeelining for the door, he didn’t look at Paradise. In fact, there was a good possibility he was never looking at her again. But he was careful to guy-it-up with Craeg as he passed the male, giving him a clap on the shoulder.\u003c/p\u003e\n\u003cp\u003e“Can’t wait for tomorrow out in the field.” Unless he hung himself in the bathroom at home. In which case he was gonna be a no-show. “Good workout tonight. Fan-fucking-tastic.”\u003c/p\u003e\n\u003cp\u003eEspecially if you counted the body slam he just did to his own ego. That little bitch wasn’t getting up again. Probably needed reconstructive surgery and a prosthesis.\u003c/p\u003e\n\u003cp\u003eOut in the corridor, he stopped and cursed. He’d left his fucking duffel in the break room, but he was not going back in there. Nope. No reason to catch the drift of the Paradise/Craeg Reunion Kiss #45,896, which would be followed by the OMG-guess-what-Peyton-just-said’s. The good news? Craeg was so into the program, and team leadership, and fighting the true enemy, that there was a strong possibility his bonded male wouldn’t be reaching for a dagger right now.\u003c/p\u003e\n\u003cp\u003eStill, it was probably a good idea to head down to the parking area. If only to buy himself some lead time on the run-away.\u003c/p\u003e\n\u003cp\u003eEven he wasn’t dumb enough to take on a bonded male. Especially one who was trained to kill things.\u003c/p\u003e\n\u003cp\u003eAs Peyton checked his watch and started striding off to the reinforced steel door at the very far end, he pulled a thank-fuck. Fifteen minutes and the bulletproof bus would be ready in the parking area to take them back to the drop point. If Craeg went apeshit on the ride into town, surely someone would help a guy out. Boone was a straight shooter and would intercede, and maybe—\u003c/p\u003e\n\u003cp\u003eInstantly, Peyton’s entire body went on high alert, his skin flushing with heat, the hair at the back of his neck triggering up, his blood pumping as hard as if he were on a sprint.\u003c/p\u003e\n\u003cp\u003eHe stopped again and turned around slowly.\u003c/p\u003e\n\u003cp\u003eNovo was emerging from the female locker room, her hard body in leathers and a leather jacket, her Nike duffel over one shoulder, her black hair slicked back and braided down her spine.\u003c/p\u003e\n\u003cp\u003e“Hey,” he murmured as she came up to him. “You looked good tonight.”\u003c/p\u003e\n\u003cp\u003eShe always did. And not just with her hand-to-hand form, either.\u003c/p\u003e\n\u003cp\u003e“What you mean”—she kept going past him—“is that I beat you.”\u003c/p\u003e\n\u003cp\u003e“Not how I remember it.”\u003c/p\u003e\n\u003cp\u003e“Huh. Guess my putting you flat on your back caused a little brain damage, then.”\u003c/p\u003e\n\u003cp\u003eAs an arousal punched at the fly of his slacks, Peyton discreetly rearranged himself and fell into her wake. Out in front of him, she moved like the boss she was, all attitude and competence, and yes, he totally looked at her ass—and wanted his hands all over it.\u003c/p\u003e\n\u003cp\u003eHis mouth, too.\u003c/p\u003e\n\u003cp\u003eSomething about her brought out the animal in him, ever since the first night he’d seen her. He didn’t want to make love to her. He wasn’t even interested in sex from her. He wanted straight-out fucking, the kind that left marks on skin, and ruined furniture, and broke lamps.\u003c/p\u003e\n\u003cp\u003e“I won in the end,” he drawled.\u003c/p\u003e\n\u003cp\u003eNow she was the one pulling a halt-and-pivot, that long rope of hair swinging around and hitting her on the hip. “Because I slipped while I was submitting you. My foot slipped. That’s how you got your advantage.”\u003c/p\u003e\n\u003cp\u003e“I still pinned you in the end.”\u003c/p\u003e\n\u003cp\u003e“I took you down.”\u003c/p\u003e\n\u003cp\u003e“And I won.”\u003c/p\u003e\n\u003cp\u003eAs fire lit up her teal-blue eyes and her fangs descended, he focused on her mouth. In his mind, he shoved her back against the hard concrete wall and she fought him and they kissed like they were going to die after they were done banging. Raw. Furious. With orgasms that altered their brain chemistry for nights afterward.\u003c/p\u003e\n\u003cp\u003e“You didn’t win,” she gritted. “I slipped. And if the ball of my foot hadn’t gone out from under me, you would still be on that mat like a carpet.”\u003c/p\u003e\n\u003cp\u003ePeyton moved in closer and lowered his voice. “Excuses, excuses.”\u003c/p\u003e\n\u003cp\u003eWith the way she glared at him, it was clear she wanted to hit him. Break his legs. Stab him.\u003c/p\u003e\n\u003cp\u003eAnd he wanted all of that, too. It was punishment for his dropping that bomb back in the break room. It was self-harm done by someone else, a vital, painful distraction that took his mind off the fact that he gotten way too real with the wrong person, at the very wrong time.\u003c/p\u003e\n\u003cp\u003eShit, had he really just told Paradise he loved her?\u003c/p\u003e\n\u003cp\u003e“So when are we going to fuck,” he said in a guttural voice. “I’m ready to stop ignoring this.”\u003c/p\u003e\n\u003cp\u003eNovo narrowed that stare even harder. “Never. How’s never sound to you?”\u003c/p\u003e\n\u003cp\u003e“You want it.”\u003c/p\u003e\n\u003cp\u003e“Not from you.”\u003c/p\u003e\n\u003cp\u003e“Liar.” He leaned in a little closer. “Coward. What are you afraid of—”\u003c/p\u003e\n\u003cp\u003eHer free hand whipped out and locked on his throat, her thumbnail pressing into his jugular and pinching off the blood supply. “Watch yourself, pretty boy. Or I might do some aesthetic damage they can’t fix.”\u003c/p\u003e\n\u003cp\u003ePeyton closed his eyes and swayed. “I want you to.”\u003c/p\u003e\n\u003cp\u003eCovering her grip with his own, he forced her nail further into his skin until blood welled. And as her eyes flared, he removed her hold and looked at the red smudge on her thumb.\u003c/p\u003e\n\u003cp\u003e“You want a taste?” he drawled, bringing his blood to her mouth. “Open for me.”\u003c/p\u003e\n\u003cp\u003eWhen her jaw flexed like she was clamping down on her molars, he rubbed her own thumb on her lower lip, banking on the temptation becoming too strong for her to resist—\u003c/p\u003e\n\u003cp\u003eHer pink tongue licked out and then she took over from there, sucking her finger in deep and making a show of rolling it around…until he nearly orgasmed in his pants.\u003c/p\u003e\n\u003cp\u003eBut just as things were reaching taking off, she abruptly stepped back and looked away.\u003c/p\u003e\n\u003cp\u003e“Snowstorm, people.”\u003c/p\u003e\n\u003cp\u003eAt the sound of a male voice, Peyton did some f-bomb reps in his head. And then he glared at Axe, who was coming out of the office.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Peyton muttered.\u003c/p\u003e\n\u003cp\u003eTheir fellow trainee sauntered over. Axe was neo-Goth’d, half-tat’d, and a good guy—once you got past the fact that he looked like a serial killer. He’d just settled down with an aristocrat, one of Peyton’s cousins, so now he was in the family so to speak, and Peyton was glad. With everything the way it was going out in the world, at least he knew Elise was not just loved, but safe from the enemy. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-3.html","bookId":1777,"creation":"Oct 5, 2019 10:32:55 AM","modification":"Oct 5, 2019 10:32:55 AM"}
