{"id":74780,"no":32,"title":"Page 32","content":"\u003cp\u003eAs he went to type in a response to that last one, he stopped halfway through—and called instead.\u003c/p\u003e\n\u003cp\u003eOne ring. Two rings…\u003c/p\u003e\n\u003cp\u003eThree.\u003c/p\u003e\n\u003cp\u003eShit, it was going to go to voicemail. Did he hang up or—\u003c/p\u003e\n\u003cp\u003e“So is this a yes?” Novo said in a husky voice.\u003c/p\u003e\n\u003cp\u003eInstant erection. The kind of thing that tested the tensile strength of his tux’s zipper and suggested there was no way he was leaving the loo without giving himself a hand job.\u003c/p\u003e\n\u003cp\u003e“Yes,” he answered. “It is.”\u003c/p\u003e\n\u003cp\u003e“When can you come here?”\u003c/p\u003e\n\u003cp\u003eNow! Fucking right now! his cock said. You get that on that bus and you go to her right now!\u003c/p\u003e\n\u003cp\u003eListen, little Pey-pey, you need to chill—\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003ePeyton shut his eyes and leaned into the agate countertop. “Ah, yeah, sorry—”\u003c/p\u003e\n\u003cp\u003e“Little Pey-pey? I didn’t know you had a younger brother.”\u003c/p\u003e\n\u003cp\u003eIt was more like living with a frat boy who never lifted a finger until he had a bright idea that could burn the house down.\u003c/p\u003e\n\u003cp\u003e“It’s…nothing.” Actually it was more like eight inches. Hard. “And I’ve got a…I’m stuck in a family thing, but it’s just a meal. As soon as it’s done, I’m coming in.”\u003c/p\u003e\n\u003cp\u003e“How long? They said I had to feed before I can leave.”\u003c/p\u003e\n\u003cp\u003e“Not long. An hour. The cheese and fruit course is about to be served, and after that, there will be sorbet.” Thank God it wasn’t Last Meal or there’d be another two hours ahead of them. “I’ll arrange for transport and tell my father I have to go.”\u003c/p\u003e\n\u003cp\u003e“So dependable you are.”\u003c/p\u003e\n\u003cp\u003e“When properly motivated.”\u003c/p\u003e\n\u003cp\u003e“And altruistic, too. Or do you still feel like you owe me?”\u003c/p\u003e\n\u003cp\u003ePeyton looked at himself in that mirror over the gold sink. His eyes were rapt and hungry, a high color of arousal on his cheeks. In the golden glow, he was all tiger in a gilded cage.\u003c/p\u003e\n\u003cp\u003e“You don’t want me to answer that,” he heard himself say in a guttural voice.\u003c/p\u003e\n\u003cp\u003e“Don’t do me any favors.”\u003c/p\u003e\n\u003cp\u003e“Fine. I want you to take from me. I want your mouth on me anywhere I can get it. And I know better than to think you’ll let me fuck you, but just so we’re clear, the entire time, I’ll be back between your legs in my mind. That honest enough for you? Still want me to come…to you?”\u003c/p\u003e\n\u003cp\u003eHe deliberately double-entendre’d that last one because he was a prick. And he wanted her so badly he was losing his frickin’ mind.\u003c/p\u003e\n\u003cp\u003eWhen Novo didn’t say anything, he let his head drop and decided to kick his own ass. Way to be supportive—\u003c/p\u003e\n\u003cp\u003e“Yes,” she said roughly. “I still want you to come.”\u003c/p\u003e\n\u003cp\u003eHoly thundering blood pressure, Batman.\u003c/p\u003e\n\u003cp\u003e“This time…” He bared his descending fangs, his upper lip twitching. “I want your fangs in me, I want the pain and the rush. And I want you at my throat.”\u003c/p\u003e\n\u003cp\u003e“Anything else?”\u003c/p\u003e\n\u003cp\u003eOkay, those two words, in that erotic drawl, were sexier than all the actual sex he’d had for the last year.\u003c/p\u003e\n\u003cp\u003e“Let me inside of you, Novo. You don’t have to explain anything or repeat it, but I just need to know what it’s like to finish in you.”\u003c/p\u003e\n\u003cp\u003e“You’re admitting weakness.”\u003c/p\u003e\n\u003cp\u003e“I’m telling the truth.”\u003c/p\u003e\n\u003cp\u003e“Why start now.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “When have I lied to you?”\u003c/p\u003e\n\u003cp\u003eThere was a pause. “When it comes to Paradise, you’ve been lying to yourself.”\u003c/p\u003e\n\u003cp\u003eOh, no, he thought. That’s a wrong turn off a road he wanted to stay on, heading into a set of brambles he could totally do without.\u003c/p\u003e\n\u003cp\u003e“I’m not in love with her.”\u003c/p\u003e\n\u003cp\u003e“You’re just proving my point about the lying. Remember last night in that alley? Don’t pretend you weren’t being a bonded male with her, putting yourself and everyone else’s best interests aside to protect what you think of as your female.”\u003c/p\u003e\n\u003cp\u003e“Why are we talking about this?”\u003c/p\u003e\n\u003cp\u003e“I really don’t know.”\u003c/p\u003e\n\u003cp\u003eThere was a beat of silence, and before she could change her mind, he jumped into the quiet. “I’ll be there as soon as I can. I just need to get through this dinner with my father. If I could leave, I would, but with him, everything is a goddamn problem.”\u003c/p\u003e\n\u003cp\u003eA soft laugh came over the connection. “That exasperated tone in your voice is probably the only thing we will ever have in common.”\u003c/p\u003e\n\u003cp\u003e“Family problems, too?”\u003c/p\u003e\n\u003cp\u003e“You have no idea.”\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause. “I thought you were having dinner with your sire. Why are you on this phone with me?”\u003c/p\u003e\n\u003cp\u003e“I’m hiding in the bathroom. You’re giving me an excuse to stay a little longer.”\u003c/p\u003e\n\u003cp\u003eThis time, when Novo laughed, it was shockingly natural—and he realized he’d never heard her like that before.\u003c/p\u003e\n\u003cp\u003eLifting his hand, he found himself rubbing away an unexpected ache in his chest.\u003c/p\u003e\n\u003cp\u003e“Come on,” he said. “Spill. It’ll be your humanitarian gesture for the night. Keep me in here some more.”\u003c/p\u003e\n\u003cp\u003eThe exhale was long and slow. “Come when you can. No hurries. Bye.”\u003c/p\u003e\n\u003cp\u003eAs the connection was cut, Peyton refocused on his face in the mirror. Even though he knew the address of the house he was in, the zip code and the street and the number…in spite of the fact that he had been in most every room in the mansion, for all of his life…he was utterly lost.\u003c/p\u003e\n\u003cp\u003eAnd he had been for years.\u003c/p\u003e\n\u003cp\u003eClosing his eyes, he pictured Paradise, with her blond hair and her lovely face and her quick smile. He remembered her laugh coming over the phone, her sorrow and her pain, too. He heard her voice and her accent, her consonants and her vowels.\u003c/p\u003e\n\u003cp\u003eAll those phone calls, all that time, day in and day out, while the raids forced them to stay indoors in their safe houses away from Caldwell.\u003c/p\u003e\n\u003cp\u003eWhat he had fallen in love with was her constancy. Her reliability. Her always-there, and her kindness…and even more than all that, the fact that she had never, ever judged him. He had told her things that had made him feel pathetic and things that had frightened him. He had talked about nightmares and the demons in his own mind. He had related his father’s hatred of him, and his mahmen’s absentee dismissal, his drugs and his drinking, his females and his women.\u003c/p\u003e\n\u003cp\u003eAnd still, she had stood by him. As if none of that ugliness made her think less of him.\u003c/p\u003e\n\u003cp\u003eTalk about family issues. He’d never had that support from his bloodline or the glymera. He had kept his secrets to himself, not because they were particularly unusual or shocking or perverse, but because there had been no one to trust his underbelly with. No one to care. No one to accept him as he was and forgive him for not being perfect.\u003c/p\u003e\n\u003cp\u003eThat was why he had loved her.\u003c/p\u003e\n\u003cp\u003eBut that was less about her, wasn’t it.\u003c/p\u003e\n\u003cp\u003eAnd more about what he’d needed.\u003c/p\u003e\n\u003cp\u003eParadise had been, for a time, the paint on his canvas, the compass in his pocket, the light switch he could flip on when he needed illumination in the scary dark. Her good nature had offered him those salvations, although similarly that was not about him; she would have done that for anybody, because that was the way she was.\u003c/p\u003e\n\u003cp\u003eHe had never been sexually obsessed with her.\u003c/p\u003e\n\u003cp\u003eShe had never been like Novo to him. Novo was a bonfire he wanted to jump into. Wearing a suit of firecrackers and carrying a gas tank on his back.\u003c/p\u003e\n\u003cp\u003eNo, he had stared at Paradise because he had mourned the loss of that tight connection, its absence thrusting him back into this world of gilded frames and plastic smiles and no grounding whatsoever.\u003c/p\u003e\n\u003cp\u003eSometimes gratitude could be mistaken for love. Both were warm feelings that endured. But the former was about friendship…the latter was something else entirely.\u003c/p\u003e\n\u003cp\u003eAnd for some reason, he felt a driving need to explain this all to Novo.\u003c/p\u003e\n\u003cp\u003eTurning away, he reached for the door. He was going to leave the second he could—\u003c/p\u003e\n\u003cp\u003ePeyton jumped back. “Whoa!”\u003c/p\u003e\n\u003cp\u003e“Forgive me,” Romina said softly.\u003c/p\u003e\n\u003cp\u003eThe young female was pale and shaky as she stood before him, and she checked over her shoulder with the paranoia of a field mouse in a cat’s path.\u003c/p\u003e\n\u003cp\u003e“I must speak with you alone.” Her eyes clung to his. “There is little time.”\u003c/p\u003e\n\u003cp\u003eAs Saxton slid the door back into place, the resistance of the panel meeting its jamb was the kind of thing that dimly resonated through his hand and up his arm. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-32.html","bookId":1777,"creation":"Oct 5, 2019 10:32:56 AM","modification":"Oct 5, 2019 10:32:56 AM"}
