{"id":74818,"no":70,"title":"Page 70","content":"\u003cp\u003e“You are so much more than I thought you were.”\u003c/p\u003e\n\u003cp\u003eAnd that was true not just because she had underestimated him from the start. It was because he had this way of hanging in with her, of seeing her, of supporting her without smothering her.\u003c/p\u003e\n\u003cp\u003eIt was an incredible commentary on who he was to her…when the male who she had conceived her young with was not the one she had gone to with the pain of that death. No, it had been Peyton.\u003c/p\u003e\n\u003cp\u003ePeyton was the only one she had wanted. Had trusted. Had needed.\u003c/p\u003e\n\u003cp\u003eShe had fallen in love with him.\u003c/p\u003e\n\u003cp\u003eAnd admitting that didn’t feel scary, actually. Which was a shock.\u003c/p\u003e\n\u003cp\u003e“I will name her and I will go back there,” she said softly. “And maybe you will come with me someday so I can introduce you two.”\u003c/p\u003e\n\u003cp\u003eIn accepting him into her life, she wanted him to go with her back there sometime. It was not only a part of her, but had been the defining term for what had felt like the longest while.\u003c/p\u003e\n\u003cp\u003eTiptoeing into the loo, she shut herself in the toilet room, took care of business, and then washed her hands and dried them. As she looked at her reflection in the mirror, she was surprised that she appeared exactly the same. You’d think some of the inner transformation might have translated into different-colored eyes or hair that was of another style.\u003c/p\u003e\n\u003cp\u003eBut no, it was still her.\u003c/p\u003e\n\u003cp\u003eAnd that was rather the point, wasn’t it. Since the miscarriage, there had been two sides to her: What had happened and the pain, loss, and grief that went along with it—and then everything else. The latter had been responsible for existing and navigating the world at large. The former had been this shadowed entity that had haunted her. And she had protected both with a hard shell.\u003c/p\u003e\n\u003cp\u003eBecause either she kept all the contradictions held in tightly or she wouldn’t have been able to function from the splitting apart, the falling apart.\u003c/p\u003e\n\u003cp\u003eAfter telling Peyton her story and crying it out, the two halves seemed to be integrating a little. She wasn’t sure how to explain it.\u003c/p\u003e\n\u003cp\u003eWho the hell knew.\u003c/p\u003e\n\u003cp\u003e“I’ll see you in class,” she said to Peyton as she came back out and put her boots on.\u003c/p\u003e\n\u003cp\u003eHe mumbled again in his sleep and then roused well enough to properly focus on her. “Class? See you in class?”\u003c/p\u003e\n\u003cp\u003e“Yes. In class.”\u003c/p\u003e\n\u003cp\u003eAs she leaned in and kissed him, she had the urge to say, “I love you”—and the impulse was so strong, she nearly spoke the three words aloud.\u003c/p\u003e\n\u003cp\u003eIn the end, she settled for “I can’t wait.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“Go back to sleep. You have at least an hour, maybe a little longer, before you have to get up.”\u003c/p\u003e\n\u003cp\u003e“Wish you didn’t have to go.”\u003c/p\u003e\n\u003cp\u003e“Me, too,” she parroted.\u003c/p\u003e\n\u003cp\u003eOver at the door, she took one last look at him. His lids were back down and he let out this long, slow exhale as if all were right in his world.\u003c/p\u003e\n\u003cp\u003eShe felt the same way.\u003c/p\u003e\n\u003cp\u003eOut in the hall, she headed down for the stairs, striding along, her head both muddled and strangely clear. There was so much she hadn’t expected, from him and from herself…\u003c/p\u003e\n\u003cp\u003eIt was as she came to the stairway that she realized she had made a mistake. In her distraction, she had gone right instead of left and ended up not at the head of the staff stairs, but rather the main, grand staircase.\u003c/p\u003e\n\u003cp\u003e“And who, may I ask, are you.”\u003c/p\u003e\n\u003cp\u003eShe turned around. The male who had spoken was dressed in a three-piece suit that was dark as a shadow. He had thinning hair that was the same color as Peyton’s and autocratic features that would have been considered handsome but for his expression of total disdain.\u003c/p\u003e\n\u003cp\u003e“Well?” he demanded as he came toward her. “An answer, if you will.”\u003c/p\u003e\n\u003cp\u003eUp closer, she thought…no, Peyton’s father wasn’t as handsome as he appeared to be at a distance.\u003c/p\u003e\n\u003cp\u003e“I’m a friend of your son’s.”\u003c/p\u003e\n\u003cp\u003e“A friend. Of my son’s. Well. Has he paid you for your services, or are you looking to steal the silverware on the way out.”\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003e“You heard me.”\u003c/p\u003e\n\u003cp\u003e“I am not a whore,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Oh. Forgive me,” he drawled. “So you just spent the day with him for free? That must mean you are hoping to become his shellan—but allow me to cut your aspirations short. He is to be mated unto a female of appropriate bloodline this week, so I’m terribly sorry, my dear, but there is no future for you with him.”\u003c/p\u003e\n\u003cp\u003e“Mated?” she whispered. “What are you—”\u003c/p\u003e\n\u003cp\u003e“He has consented and he has met her. And lest you think there will be a role for you on the side, I must disabuse you of that notion. Go ply your wares elsewhere. Off you go. Good night.”\u003c/p\u003e\n\u003cp\u003eShe stumbled back, the words not translating into any comprehensible meaning.\u003c/p\u003e\n\u003cp\u003e“Not that way,” the male barked. “You are not front-door material. You must use the rear stairs—”\u003c/p\u003e\n\u003cp\u003eNovo turned and ran down the grand red and gold carpeted expanse, her feet flying over the steps as Peyton’s father continued to yell after her. At the front door, she fumbled with the locking mechanism, freeing herself just as a male servant came running in from some other place in the house.\u003c/p\u003e\n\u003cp\u003eBursting out into the cold, she slipped and fell in the snow. Got back up and continued to run across the lawn, leaving a messy trail in the pristine snow.\u003c/p\u003e\n\u003cp\u003eHer heart was pounding and her head was swimming. Mostly, she was aware of being in pain once again; the reprieve she’d had, her head popping up out of a proverbial churning ocean for a breath of sustaining air, had lasted no time at all.\u003c/p\u003e\n\u003cp\u003eShe did not cry, however.\u003c/p\u003e\n\u003cp\u003eIt was the cold in her face that coaxed tears from her eyes. Only the cold.\u003c/p\u003e\n\u003cp\u003eSaxton was late for work. As he rushed up the farmhouse’s basement stairs, he was pulling his suit jacket on at the same time he tried to fasten the buttons on his shirt. Things did not go well, any efficiencies lost in the face of attempting to do two jobs at once.\u003c/p\u003e\n\u003cp\u003e“I have your toast!” Ruhn called out by the sink. “And I put your coffee in your mug!”\u003c/p\u003e\n\u003cp\u003eSaxton skidded to a halt. The male was spectacularly naked, and all Saxton could think about was how he had ridden that…posterior region…to very great delight twice during the day. No, three times, including what they had just done in the shower together. Which was the reason for the lateness.\u003c/p\u003e\n\u003cp\u003e“How am I supposed to leave the house with you like that?”\u003c/p\u003e\n\u003cp\u003eRuhn, always a rule abider, for once had no time for flirting. “Come, you will be late! I do not want it to be my fault.”\u003c/p\u003e\n\u003cp\u003eSaxton would have joked about that, but his love was so earnest that such levity was liable to be in poor taste, no matter the intention.\u003c/p\u003e\n\u003cp\u003e“Promise me, when I return, that you will be dressed exactly like this?”\u003c/p\u003e\n\u003cp\u003e“Saxton, eat.”\u003c/p\u003e\n\u003cp\u003eAs a plate was shoved at him and his travel mug waved in his face, he just stood there, shirt half buttoned, jacket askew.\u003c/p\u003e\n\u003cp\u003eAnd p.s., what a great word…“askew.” It sounded just like the disorder it described.\u003c/p\u003e\n\u003cp\u003e“Saxton—”\u003c/p\u003e\n\u003cp\u003e“Promise.”\u003c/p\u003e\n\u003cp\u003e“Fine! I’ll be naked as you please!”\u003c/p\u003e\n\u003cp\u003e“A thank-you.” He bowed a little and quickly righted all that was wrong with himself. “And I am awaiting our reunion with bated breath.”\u003c/p\u003e\n\u003cp\u003e“I shall be here.” Ruhn smiled. “I’m working on the cellar today.”\u003c/p\u003e\n\u003cp\u003e“You are going to have this place like new by the time we leave.”\u003c/p\u003e\n\u003cp\u003e“That is the plan.”\u003c/p\u003e\n\u003cp\u003eSaxton paused. “I love you.”\u003c/p\u003e\n\u003cp\u003eThe kiss Ruhn gave to him was like his breath, easy and necessary. “I love you, too,” the male said. “Now go—wait, your proper coat is over there on the table!”\u003c/p\u003e\n\u003cp\u003e“I don’t need it. I have you to keep me warm.”\u003c/p\u003e\n\u003cp\u003eMinutes later, Saxton dematerialized…and re-formed at the rear entrance of the Audience House. Immediately, as soon as he walked in the kitchen, he knew he was out of sync. The doggen had already taken out the trays of Danish and turned on the restaurant-sized coffeepot, and there were voices down in front, civilians having already arrived for their appointments.\u003c/p\u003e\n\u003cp\u003e“Shit,” he said as he skidded through the staff hallway’s flap door and jumped into his office like it was a pool.\u003c/p\u003e\n\u003cp\u003eThe coffee mug went down on the partner’s desk and it was only then that he realized he’d taken his piece of toast and his plate with him. He put the plate down as well, and threw the toast in his mouth, grabbed the folders, which—thank God—he’d set out before he’d left to go home to— \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-70.html","bookId":1777,"creation":"Oct 5, 2019 10:32:56 AM","modification":"Oct 5, 2019 10:32:56 AM"}
