{"id":74821,"no":73,"title":"Page 73","content":"\u003cp\u003e“—Novo? Hello?”\u003c/p\u003e\n\u003cp\u003eShe snapped to. “I’m sorry, what?”\u003c/p\u003e\n\u003cp\u003eDr. Manello stared down at her for a moment. Then he sank onto his haunches. “You want to tell me what’s really going on here?”\u003c/p\u003e\n\u003cp\u003e“Like I said, nothing. I just ate something funny.”\u003c/p\u003e\n\u003cp\u003e“What was it?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember.” As his expression shifted into seeing-too-clearly territory, she got up and walked around. “Honestly, I’ll be good by tomorrow night.”\u003c/p\u003e\n\u003cp\u003e“You know, if you need to talk to someone—”\u003c/p\u003e\n\u003cp\u003e“I absolutely, positively, do not need to talk to anybody.”\u003c/p\u003e\n\u003cp\u003e“Okay.” He put his hands out. “I’ll back off.”\u003c/p\u003e\n\u003cp\u003eDr. Manello reloaded his little black bag, and then he was back at her door. “Call me, though, if you start to run a fever or actually vomit?”\u003c/p\u003e\n\u003cp\u003e“That is not going to be necessary.” She went over to let him out. “Thank you for coming—”\u003c/p\u003e\n\u003cp\u003e“I’m worried about you. And not from a medical standpoint.”\u003c/p\u003e\n\u003cp\u003eFor some reason, she thought of that patient down in the clinic, the one who screamed all the time. At least if she lost her mind, she thought, they had some experience dealing with the insane.\u003c/p\u003e\n\u003cp\u003eBut that was not going to be her. She just wasn’t going to have it.\u003c/p\u003e\n\u003cp\u003e“I’m not,” she told him. “I’m not worried about me at all.”\u003c/p\u003e\n\u003cp\u003eIf she could live through what had come before? Then getting over the reality that Peyton was exactly who she’d thought he was wasn’t going to be a problem. She’d already trained for it.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eWhere the hell was she?\u003c/p\u003e\n\u003cp\u003eAs Peyton walked into the training center’s weight room forty minutes later, he sifted through the various bodies on the machines and the mats…and came up with a resounding no-Novo.\u003c/p\u003e\n\u003cp\u003eWith a frown, he went over to the Brother Qhuinn. “Hey, have you seen Novo?”\u003c/p\u003e\n\u003cp\u003e“She called in sick. Said she wasn’t feeling well.”\u003c/p\u003e\n\u003cp\u003ePeyton’s first instinct was to get on a rocket ship and race across town. The problem with that? He had no rocket, and he didn’t know her address—but, wait, he had fed her, hadn’t he.\u003c/p\u003e\n\u003cp\u003e“Did she say what was wrong?”\u003c/p\u003e\n\u003cp\u003e“Nope. Just that she was sick to her stomach and staying in. She sounded nauseous, but not at death’s door.”\u003c/p\u003e\n\u003cp\u003e“Could it be something with her heart? A problem from—”\u003c/p\u003e\n\u003cp\u003e“I told Manny, so he went out there and checked her. He said it was garden-variety food poisoning or something. It’s not a problem.” The Brother’s blue and green eyes leveled on him. “Can you think of any other issue that might be bothering her?”\u003c/p\u003e\n\u003cp\u003e“When she left me at nightfall, I—” He clamped his mouth shut. “No, I can’t.”\u003c/p\u003e\n\u003cp\u003e“Maybe she would appreciate a text or a call from a classmate?” the Brother drawled. “Or a visit after class?”\u003c/p\u003e\n\u003cp\u003e“Yeah. That’s a real—may I be excused?”\u003c/p\u003e\n\u003cp\u003e“Yup. Then you gotta work.”\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003ePeyton hightailed it into the locker room and went to where he’d tossed his duffel on the floor, having not even bothered to put it in a locker. Rifling through his change of clothes and his weapons, he snagged his phone. Nothing from her.\u003c/p\u003e\n\u003cp\u003eHis first call went into voicemail. His second…yup, went as well.\u003c/p\u003e\n\u003cp\u003eHe kept the text short and sweet: Are u ok? Can I bring u anything?\u003c/p\u003e\n\u003cp\u003ePeyton waited five minutes. And then he had to go back to class.\u003c/p\u003e\n\u003cp\u003eAn hour and a half later, on the break between the weight room and the target range, he checked his phone again. Nothing. So he called. Texted once more.\u003c/p\u003e\n\u003cp\u003eAnd then he did the same another ninety minutes later as they transitioned into classroom work. Nothing. Not even after he called again. Texted some more.\u003c/p\u003e\n\u003cp\u003eWhat if she had passed out—\u003c/p\u003e\n\u003cp\u003eHe was on the verge of fucking off class and calling for the bus when his phone went off. The text was from her: Fine. See everyone tomoz.\u003c/p\u003e\n\u003cp\u003eThat was it.\u003c/p\u003e\n\u003cp\u003eHis fingers went flying across his phone’s surface, typing out all kinds of I’ll stop by, bring soup, heating pads, etc. etc. etc.\u003c/p\u003e\n\u003cp\u003eNothing came back at him.\u003c/p\u003e\n\u003cp\u003e“You all right?” Craeg asked over at the door out into the corridor. “Everything okay with Novo?”\u003c/p\u003e\n\u003cp\u003ePeyton cleared his throat. “Ah, yeah, it’s fine. She’s great. She’ll be in tomorrow night.”\u003c/p\u003e\n\u003cp\u003eEven though phones weren’t allowed outside of the locker room, he put his into his fleece pocket.\u003c/p\u003e\n\u003cp\u003eWhat the hell was going on?\u003c/p\u003e\n\u003cp\u003eSitting through class was an exercise in torture, but he was relieved that at least he and Novo were paired with Blay and Qhuinn the following evening. They would be the first squad to go back out into the field—like the Brotherhood wanted to do a CTRL/ALT/DEL on the incident in that alley and start the new world order on a good note.\u003c/p\u003e\n\u003cp\u003eAt the rate things were going, it would be the first chance he got to see her.\u003c/p\u003e\n\u003cp\u003eWhen the end of the night finally came, Peyton all but trampled people to get on the bus—which was stupid. It wasn’t like that was going to get him off the property any faster. And Christ, could the butler drive any slower down the mountain?\u003c/p\u003e\n\u003cp\u003eHe didn’t track any of the conversation that happened around him, and people seemed to recognize he was in extremis, leaving him alone.\u003c/p\u003e\n\u003cp\u003eThe second that bus stopped, he was at the door, but as he spilled out into the night, he realized he didn’t know where he was going. Closing his eyes, he sent his instincts forth as his fellow trainees took off one by one.\u003c/p\u003e\n\u003cp\u003eHe located the signal of his blood to the west. And not far away.\u003c/p\u003e\n\u003cp\u003eTraveling in a scatter of molecules, he re-formed in front of a four-story walk-up in a meh part of the city. It wasn’t a dump, but it was certainly not a candidate for Architectural Digest. In the basement…he could sense her in the basement. But how to get in?\u003c/p\u003e\n\u003cp\u003eAs if on cue, a human opened the outer door to its vestibule, and Peyton took the seven steps three at a time. “Hey! Can you catch the inside—”\u003c/p\u003e\n\u003cp\u003e“No prob.” The guy leaned back and kept the inner door open. “You forget your key?”\u003c/p\u003e\n\u003cp\u003e“My girlfriend’s.”\u003c/p\u003e\n\u003cp\u003e“Been there. Later.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003ePeyton walked inside and looked around. There had to be a way to get to the lower level—there. In the far corner.\u003c/p\u003e\n\u003cp\u003eNo one else was around, and so he could just will it unlocked—shit, why hadn’t he thought about that on the outside?\u003c/p\u003e\n\u003cp\u003eWell, because his brain was fucking jacked, thank you very much.\u003c/p\u003e\n\u003cp\u003eGoing over, he tried that mental trick out—but it didn’t work on what proved to be a copper deadbolt. So clearly, there were vampires living among these humans.\u003c/p\u003e\n\u003cp\u003eHe thought about calling her, but things were so weird, he had a feeling Novo wasn’t going to let him in. Maybe that was paranoia, though. Who the fuck knew—\u003c/p\u003e\n\u003cp\u003eThe door swung wide and he jumped back. As he saw who it was, he nearly hugged her. “Novo! It’s you!”\u003c/p\u003e\n\u003cp\u003e“What are you doing here.”\u003c/p\u003e\n\u003cp\u003eThe tone of her voice was as lifeless as a computer’s approximation of same, and she was pale as a ghost, her eyes dead.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asked, reaching out.\u003c/p\u003e\n\u003cp\u003eShe took a sharp step back. “I’m fine. What are you doing here.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong? What…I don’t understand what’s going on?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t feeling well. I am better now. I’ll be back in class tomorrow. I told you.”\u003c/p\u003e\n\u003cp\u003eHer hair was plaited and over her shoulder, her jeans and sweatshirt nothing unusual, her feet in Adidas shower shoes with thick socks on—as if she were just in for a cozy night at home. Her eyes, though. They were as matte as old river stones.\u003c/p\u003e\n\u003cp\u003e“Where are you?” he blurted. “What—”\u003c/p\u003e\n\u003cp\u003eHer hands came up. “Okay, I’m done. I want you to leave. I didn’t invite you here, and I resent the fact that you used my feeding from you as a way to hunt me down.”\u003c/p\u003e\n\u003cp\u003e“Hunt you down? Excuse me?”\u003c/p\u003e\n\u003cp\u003e“You heard it right. I don’t want you to come here ever again.”\u003c/p\u003e\n\u003cp\u003ePeyton ground his molars a couple of times. “Okay, let’s back up here. As far as I knew, when you left my bed at nightfall, everything was cool between us. And now you’re acting like I’m some kind of stalker. I think you owe me an explanation—” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-73.html","bookId":1777,"creation":"Oct 5, 2019 10:32:56 AM","modification":"Oct 5, 2019 10:32:56 AM"}
