{"id":74827,"no":79,"title":"Page 79","content":"\u003cp\u003eRefocusing on Novo, he said, “I would rather be in a hovel with you than a castle with anybody else.”\u003c/p\u003e\n\u003cp\u003eAs she looked up at him, her smile was so resplendent, he basked in it for a moment. Then he held up a forefinger.\u003c/p\u003e\n\u003cp\u003e“And as for your pesky neighbors, I have the solution for that.” Leaning to one side, he took a folded piece of paper out of his pocket. “I’ll just put this on the door.”\u003c/p\u003e\n\u003cp\u003eFlattening the sheet, he turned it around so she could see the note Dr. Manello had written and put on the door to her hospital room back when she’d been recovering.\u003c/p\u003e\n\u003cp\u003e“Oh…” she said as she touched it. “You were going to take this with you.”\u003c/p\u003e\n\u003cp\u003e“I’m a sap. For you, that is.” He smiled at her. “And sooner or later, I was going to cave and come try you again. You’re irresistible to me.”\u003c/p\u003e\n\u003cp\u003e“Even though I’m a bitch sometimes?”\u003c/p\u003e\n\u003cp\u003ePeyton gave her his sauciest wink. “I love a challenge, what can I say.”\u003c/p\u003e\n\u003cp\u003eThey made out for a little bit. And then he linked her arm through his own. “Let’s unload the sofa and blow this Popsicle stand.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a perfect plan.”\u003c/p\u003e\n\u003cp\u003eThey were halfway across the foyer when Novo said, “Hey, will you go as my date to my sister’s wedding…mating…whatever it is.”\u003c/p\u003e\n\u003cp\u003ePeyton stopped and thought about it. “Yeah, but on one condition.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“I get to hit him.”\u003c/p\u003e\n\u003cp\u003e“Who? Oskar?”\u003c/p\u003e\n\u003cp\u003e“Yup. Right in the piehole.” As Novo rolled her eyes and started shaking her head, he put his hands up. “One shot. I promise. And listen, because I’m a stand-up guy, I’ll do it after the pictures are taken. Come on, you’re my female. I gotta take care of you.”\u003c/p\u003e\n\u003cp\u003e“I can take care of myself,” she said sternly.\u003c/p\u003e\n\u003cp\u003e“True. But you have to admit, you’d like to see that. Admit it. Come onnnnnnnnnn.”\u003c/p\u003e\n\u003cp\u003e“Fine,” she muttered. “I would. But you’re not going to hit him…”\u003c/p\u003e\n\u003cp\u003e“Even a little?” he asked as they headed out into the cold. “How about I duct-tape his ass cheeks together? Short-sheet his bed? Ex-Lax his chocolate pudding…? I have other ideas, you know…”\u003c/p\u003e\n\u003cp\u003eNovo put her hands on her hips and tried to keep a straight face. In the end, she cracked and started laughing. “You are out of control.”\u003c/p\u003e\n\u003cp\u003eHe came in for the clinch and she didn’t fight him. “Not any longer. I know what I want and where I want to be. And it is to be with you. You’re my home just like I’m yours.”\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around his neck. “Do we have to unpack the truck before we have sex?”\u003c/p\u003e\n\u003cp\u003e“Fuck that shit.” He grinned. “Actually, I was planning on pulling over and doing you in the front seat on the way across town.”\u003c/p\u003e\n\u003cp\u003e“I like the way you think,” she said as she kissed him long and hard. “You are a male with great plans…”\u003c/p\u003e\n\u003cp\u003eIt was twelve minutes after midnight on the dot when Saxton dematerialized to the rear of the Audience House. He did not enter through the kitchen door. Instead, he turned around and faced the four-bay garage that was set back from the mansion. The Brotherhood’s blacked-out van was parked there, and with a calm that would have shocked him under other circumstances, he started through the snow to the set of exterior stairs leading to the structure’s second level. As he ascended, his breathing was as even as a metronome, his heart rate steady, his eyes unblinking in spite of the cold.\u003c/p\u003e\n\u003cp\u003eFrom what felt like a vast distance, he watched as his hand reached out and turned a knob. Pushing the way open, he stepped inside, into the dim light.\u003c/p\u003e\n\u003cp\u003eThe moans of the human men were muffled by the gags that were in their mouths. There were three of them, weaving on their feet, all with their hands tied behind their backs and their terror making them sweat like meat left out too long in the heat. Two he recognized from the attack behind the restaurant. The other was not one he had seen before, but the fellow was of predictable ilk: big, beefy, short-haired, and ruddy-faced.\u003c/p\u003e\n\u003cp\u003eVishous held one. Blay and Qhuinn the others.\u003c/p\u003e\n\u003cp\u003eThere was plastic sheeting beneath their boots.\u003c/p\u003e\n\u003cp\u003eThe humans struggled even more as his presence registered, and as they jerked against their tethers, he was reminded of hooves stamping in a stable, the rustle-thump of heavy-weighted bodies just the same.\u003c/p\u003e\n\u003cp\u003eNo one said anything.\u003c/p\u003e\n\u003cp\u003eVishous simply nodded over to a workbench. There was a single dagger on it. Black bladed. Was it V’s or Qhuinn’s, he wondered idly as he removed his leather gloves.\u003c/p\u003e\n\u003cp\u003eNo matter, he thought as he went across and palmed it with his bare right hand.\u003c/p\u003e\n\u003cp\u003eFor no particular reason, he looked around the raftered space. There were a number of inset windows that punched out into the roofline, but each was covered with black curtains. There was no glass in the door. None of the neighbors would be able to see this.\u003c/p\u003e\n\u003cp\u003eHe didn’t care if they did.\u003c/p\u003e\n\u003cp\u003eApproaching the first one, the human started to thrash against V’s hold, his nose blowing out liquid, his cheeks puffing up around the gag.\u003c/p\u003e\n\u003cp\u003eAs if the Brother wanted to make things easy, Vishous changed his grip so that his glove-covered hand, the dangerous one, slapped onto the man’s forehead and he pulled back, exposing the throat.\u003c/p\u003e\n\u003cp\u003eA bead of sweat, like a tear, rolled down the human’s cheek as he begged for mercy. Saxton heard none of it. No, all he had were visuals of Ruhn on the floor of that kitchen, his precious blood spilled, his body on a coat that had been his only comfort as he lay dying.\u003c/p\u003e\n\u003cp\u003eSaxton’s arm acted before he was aware of making any kind of mental command. It lifted up the dagger…\u003c/p\u003e\n\u003cp\u003eAnd then it slashed the black blade across that exposed, fragile neck.\u003c/p\u003e\n\u003cp\u003eThe blood flowed quick, spraying out so that it speckled Saxton’s face. And V held the human up off the ground as the man began to spasm such that he tap-danced his way to death.\u003c/p\u003e\n\u003cp\u003eAs Saxton moved on to the second, he found himself opening his mouth and hissing with fully descended fangs. Then he extended his tongue and licked the blade.\u003c/p\u003e\n\u003cp\u003eThe human who was going to die next saw all this and screamed around his gag, fighting to get free of Qhuinn not just because he was going to be killed, but because he had discovered that something was very, very different about the male who was his executioner. In response, the Brother just tightened his hold around that barrel chest and yanked that head back by the hair.\u003c/p\u003e\n\u003cp\u003eSaxton threw the blade out in a fat arc, right across the throat, the cut as clean as the first.\u003c/p\u003e\n\u003cp\u003eAnd then there was the last one, the one who had attacked Ruhn behind the restaurant, whose arm had been broken.\u003c/p\u003e\n\u003cp\u003eBlay’s eyes were stone cold as he jerked the man up a little higher.\u003c/p\u003e\n\u003cp\u003eNow Saxton took his time. Bending in to the man, he pressed the tip of the bloody blade to the flesh over the jugular.\u003c/p\u003e\n\u003cp\u003eThe man was crazed with fear, his legs kicking like he was being electrocuted, his stench that of rank panic.\u003c/p\u003e\n\u003cp\u003e“This is for my love,” Saxton growled. “This is for my mate. This…”\u003c/p\u003e\n\u003cp\u003eOn each sentence, he pressed the tip in further and further and further still, until the geyser was struck.\u003c/p\u003e\n\u003cp\u003e“This is for that which was mine. This is for what you tried to take from me.”\u003c/p\u003e\n\u003cp\u003eWith that, he lowered the dagger, reared back, and bit the side of that throat so hard he hit bone. Ripping the flesh free, he spat it out and watched as the human gasped and heaved and bled his way to his demise.\u003c/p\u003e\n\u003cp\u003eWhen all three were still, their heads lolling to the sides, their bodies no longer animated with life, their debts collected, the fighters let them drop to the floor, one by one, faceup.\u003c/p\u003e\n\u003cp\u003eSaxton wiped his mouth with the back of his coat sleeve. Then he cut his palm, the one that had held the dagger. Going over to each of the bodies, he stood over their sightless, open eyes and put his hand print on their faces with his own blood, marking the kills as they did in the Old Country.\u003c/p\u003e\n\u003cp\u003e“What of them now?” he asked when he was done.\u003c/p\u003e\n\u003cp\u003eVishous spoke up. “We’re going to deliver them to their boss.”\u003c/p\u003e\n\u003cp\u003e“And then we’re going to talk to him,” Qhuinn continued.\u003c/p\u003e\n\u003cp\u003eBlay finished with, “And he is never going to bother Mistress Miniahna again.”\u003c/p\u003e\n\u003cp\u003eSaxton stared at the bodies for a moment. “So shall it be.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-79.html","bookId":1777,"creation":"Oct 5, 2019 10:32:56 AM","modification":"Oct 5, 2019 10:32:56 AM"}
