{"id":74241,"no":12,"title":"Page 12","content":"\u003cp\u003eTHE NEXT MORNING IS GRAY\u003c/p\u003e\n\u003cp\u003eand rainy out and it’s just us three girls, because Daddy’s left a note for us on the refrigerator saying he got called into the hospital, and he’ll see us for dinner that night. Margot’s still jet-lagged, so she got up early and fixed scrambled eggs and bacon. I’m luxuriously spreading eggs on buttered toast and listening to the rain tap on the roof, when I say, “What if I didn’t go to school today, and we did something fun?”\u003c/p\u003e\n\u003cp\u003eKitty brightens. “Like what?”\u003c/p\u003e\n\u003cp\u003e“Not you. You still have to go to school. I’m basically done. No one cares if I go anymore.”\u003c/p\u003e\n\u003cp\u003e“I think Daddy probably cares,” Margot says.\u003c/p\u003e\n\u003cp\u003e“But if we could do anything . . . what would we do?”\u003c/p\u003e\n\u003cp\u003e“Anything?” Margot bites into her bacon. “We’d take the train to New York City and enter the\u003c/p\u003e\n\u003cp\u003eHamilton\u003c/p\u003e\n\u003cp\u003elottery, and we’d win.”\u003c/p\u003e\n\u003cp\u003e“You guys can’t go without me,” Kitty says.\u003c/p\u003e\n\u003cp\u003e“Be quiet, And Peggy,” I say, giggling.\u003c/p\u003e\n\u003cp\u003eShe glares at me. “Don’t call me And Peggy.”\u003c/p\u003e\n\u003cp\u003e“You don’t even know what we’re talking about, so calm down.”\u003c/p\u003e\n\u003cp\u003e“I know you’re cackling about it like a witch. Also, I do so know about\u003c/p\u003e\n\u003cp\u003eHamilton\u003c/p\u003e\n\u003cp\u003e, because you play the soundtrack\u003c/p\u003e\n\u003cp\u003eall day long.” She sings, “Talk less; smile more.”\u003c/p\u003e\n\u003cp\u003e“For your information, it’s a cast recording, not a soundtrack,” I say, and she makes a big show of rolling her eyes.\u003c/p\u003e\n\u003cp\u003eIn truth, if Kitty’s anyone, she’s a Jefferson. Wily, stylish, quick with a comeback. Margot’s an Angelica, no question. She’s been sailing her own ship since she was a little girl. She’s always known who she was and what she wanted. I suppose I’m an Eliza, though I’d much rather be an Angelica. In truth\u003c/p\u003e\n\u003cp\u003eI’m\u003c/p\u003e\n\u003cp\u003eprobably And Peggy. But I don’t want to be the And Peggy of my own story. I want to be the Hamilton.\u003c/p\u003e\n\u003cp\u003e* * *\u003c/p\u003e\n\u003cp\u003eIt rains all day, so as soon as we get home from school, the first thing Kitty and I do is get back into our pajamas. Margot never got out of hers. She’s wearing her glasses, her hair in a knot at the top of her head (it’s too short to stay put), Kitty is in a big tee, and I’m happy it’s cold enough to wear my red flannels. Daddy is the only one still in his day clothes.\u003c/p\u003e\n\u003cp\u003eWe order two large pizzas for dinner that night, plain cheese (for Kitty) and a supreme with the works. We’re on the living room couch, shoving oozy slices of pizza into our mouths, when Daddy suddenly says, “Girls, there’s something I’d like to talk to you about.” He clears his throat like he does when he’s nervous. Kitty and I exchange a curious look, and then he blurts out, “I’d like to ask Trina to marry me.”\u003c/p\u003e\n\u003cp\u003eI clap my hands to my mouth. “Oh my God!”\u003c/p\u003e\n\u003cp\u003eKitty’s eyes bulge, her mouth goes slack, and then she flings her pizza aside and lets out a shriek so loud that Jamie Fox-\u003c/p\u003e\n\u003cp\u003ePickle jumps. She catapults herself at Daddy, who laughs. I jump up and hug his back.\u003c/p\u003e\n\u003cp\u003eI can’t stop smiling. Until I look at Margot, whose face is completely blank. Daddy’s looking at her too, eyes hopeful and nervous. “Margot? You still there? What do you think, honey?”\u003c/p\u003e\n\u003cp\u003e“I think it’s fantastic.”\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003eShe nods. “Absolutely. I think Trina’s great. And Kitty, you adore her, don’t you?” Kitty’s too busy squealing and flopping around on the couch with Jamie to answer. Softly, Margot says, “I’m happy for you, Daddy. I really am.”\u003c/p\u003e\n\u003cp\u003eThe\u003c/p\u003e\n\u003cp\u003eabsolutely\u003c/p\u003e\n\u003cp\u003eis what gives her away. Daddy’s too busy being relieved to notice, but I do. Of course it’s weird for her. She’s still getting used to seeing Ms. Rothschild in our kitchen. She hasn’t gotten to see all the ways Ms. Rothschild and Daddy make sense. To Margot, she’s still just our neighbor who used to wear terry-cloth booty shorts and a bikini top to mow the lawn.\u003c/p\u003e\n\u003cp\u003e“I’ll need your guys’s help with the proposal,” Daddy says. “Lara Jean, I’m sure you’ll have some ideas for me, right?”\u003c/p\u003e\n\u003cp\u003eConfidently I say, “Oh, yeah. People have been doing promposals, so I have lots of inspiration.”\u003c/p\u003e\n\u003cp\u003eMargot turns to me and laughs, and it almost sounds real. “I’m sure Daddy will want something more dignified than ‘Will You Marry Me’ written in shaving cream on the hood of somebody’s car, Lara Jean.”\u003c/p\u003e\n\u003cp\u003e“Promposals have gotten way more sophisticated than in your day, Gogo,” I say. I’m playing along, teasing her so she\u003c/p\u003e\n\u003cp\u003ecan feel normal again after the bomb Daddy just dropped.\u003c/p\u003e\n\u003cp\u003e“\u003c/p\u003e\n\u003cp\u003eMy\u003c/p\u003e\n\u003cp\u003eday? I’m only two years ahead of you.” She tries to sound light, but I can hear the strain in her voice.\u003c/p\u003e\n\u003cp\u003e“Two years is like dog years when it comes to high school. Isn’t that right, Kitty?” I pull her toward me and hug her tight to my chest. She squirms away.\u003c/p\u003e\n\u003cp\u003e“Yeah, both of you guys are ancient beings,” Kitty says. “Can I be a part of the proposal too, Daddy?”\u003c/p\u003e\n\u003cp\u003e“Of course. I can’t get married without you guys.” He looks teary. “We’re a team, aren’t we?”\u003c/p\u003e\n\u003cp\u003eKitty is hopping up and down like a little kid. “Yeah!” she cheers. She’s over the moon, and Margot sees it too, how important this is to her.\u003c/p\u003e\n\u003cp\u003e“When are you going to propose?” Margot asks.\u003c/p\u003e\n\u003cp\u003e“Tonight!” Kitty pipes up.\u003c/p\u003e\n\u003cp\u003eI glare at her. “No! That’s not enough time to think up the perfect way. We need a week at least. Plus you don’t even have a ring. Wait a minute, do you?”\u003c/p\u003e\n\u003cp\u003eDaddy takes off his glasses and wipes his eyes. “Of course not. I wanted to wait and talk to you girls first. I want all three of you to be here for the proposal, so I’ll do it when you come back for the summer, Margot.”\u003c/p\u003e\n\u003cp\u003e“That’s too far away,” Kitty objects.\u003c/p\u003e\n\u003cp\u003e“Yes, don’t wait that long, Daddy,” Margot says.\u003c/p\u003e\n\u003cp\u003e“Well, you’ll have to help me pick out the ring at least,” Daddy says.\u003c/p\u003e\n\u003cp\u003e“Lara Jean has a better eye for that kind of thing,” Margot says serenely. “Besides, I barely know Ms. Rothschild. I\u003c/p\u003e\n\u003cp\u003ehaven’t a clue what kind of ring she’d like.”\u003c/p\u003e\n\u003cp\u003eA shadow crosses over Daddy’s face. It’s the\u003c/p\u003e\n\u003cp\u003eI barely know Ms. Rothschild\u003c/p\u003e\n\u003cp\u003ethat put it there.\u003c/p\u003e\n\u003cp\u003eI rush to put on my best Hermione voice. “You ‘haven’t a clue’?” I tease. “P.S., did you know you’re still American, Gogo? We don’t talk as classy as that in America.”\u003c/p\u003e\n\u003cp\u003eShe laughs; we all do. Then, because I think she saw that brief shadow too, she says, “Make sure to take tons of pictures so I can see.”\u003c/p\u003e\n\u003cp\u003eGratefully Daddy says, “We will. We’ll videotape it, whatever it is. God, I hope she says yes!”\u003c/p\u003e\n\u003cp\u003e“She’ll say yes, of course she’ll say yes,” we all chorus.\u003c/p\u003e\n\u003cp\u003e* * *\u003c/p\u003e\n\u003cp\u003eMargot and I are wrapping slices of pizza in plastic and then double wrapping in foil. “I told you guys two pizzas would be too much,” she says.\u003c/p\u003e\n\u003cp\u003e“Kitty will eat it for her after-school snack,” I say. “So will Peter.” I glance toward the living room, where Kitty and Daddy are snuggled up on the couch, watching\u003c/p\u003e\n\u003cp\u003eTV\u003c/p\u003e\n\u003cp\u003e. Then I whisper, “So how do you really feel about Daddy asking Ms. Rothschild to marry him?”\u003c/p\u003e\n\u003cp\u003e“I think it’s completely bonkers,” she whispers back. “She lives across the street, for pity’s sake. They can just date like two grown-ups. What’s the point of getting\u003c/p\u003e\n\u003cp\u003emarried\u003c/p\u003e\n\u003cp\u003e?”\u003c/p\u003e\n\u003cp\u003e“Maybe they just want it to be official. Or maybe it’s for Kitty.”\u003c/p\u003e\n\u003cp\u003e“They haven’t even been dating that long! How long has it been, six months?”\u003c/p\u003e\n\u003cp\u003e“A little longer than that. But Gogo, they’ve known each other for years.”\u003c/p\u003e\n\u003cp\u003eShe stacks up the slices of foiled pizza and says, “Can you imagine how weird it’ll be to have her living here?”\u003c/p\u003e\n\u003cp\u003eHer question gives me pause. Ms. Rothschild\u003c/p\u003e\n\u003cp\u003eis\u003c/p\u003e\n\u003cp\u003eat the house a lot, but that’s not the same as living here. She has her own ways of doing things, and so do we. Like, she wears shoes at her house, but we don’t wear them here, so she takes them off when she comes over. And, now that I think about it, she’s never slept over here before; she always goes back home at the end of the night. So that might feel a little weird. Also, she stores bread in the refrigerator, which I hate, and to be quite honest, her dog Simone sheds a lot and has been known to pee on the carpet. But the thing is, since I’m not going to\u003c/p\u003e\n\u003cp\u003eUVA\u003c/p\u003e\n\u003cp\u003e, I won’t be around much longer—I’ll be away at college. “Neither of us will be living here full-time though,” I say at last. “Just Kitty, and Kitty’s thrilled to death.”\u003c/p\u003e\n\u003cp\u003eMargot doesn’t respond right away. “Yes, they do seem really close.” She goes to the freezer and makes space for the pizza, and with her back facing me she says, “Don’t forget, we have to go prom-dress shopping before I leave.”\u003c/p\u003e\n\u003cp\u003e“Ooh, okay!” It feels like two seconds ago that we were shopping for Margot’s prom dress, and now it’s my turn.\u003c/p\u003e\n\u003cp\u003eDaddy, who I didn’t realize had walked into the kitchen, pipes up with, “Hey, maybe Trina could go too?” He casts a hopeful look my way. I’m not the one he should be looking at. I already love Ms. Rothschild. It’s Margot she has to win over.\u003c/p\u003e\n\u003cp\u003eI look over at Margot, who is giving me wide panic eyes. “Um . . . ,” I say. “I think it should just be a Song girls thing this time.”\u003c/p\u003e\n\u003cp\u003eDaddy nods like he understands. “Ah. Got it.” Then he says to Margot, “Can the two of us spend a little daughter-dad time together before you leave? Maybe take our bikes on a trail?”\u003c/p\u003e\n\u003cp\u003e“Sounds good,” she says.\u003c/p\u003e\n\u003cp\u003eWhen his back is turned, Margot mouths,\u003c/p\u003e\n\u003cp\u003eThank you.\u003c/p\u003e\n\u003cp\u003eI feel disloyal to Ms. Rothschild, but Margot is my sister. I have to be on her side.\u003c/p\u003e\n\u003cp\u003e* * *\u003c/p\u003e\n\u003cp\u003eI think maybe Margot’s feeling guilty about cutting Ms. Rothschild out of the dress shopping expedition, because she keeps trying to make it more of a thing. When we go to the mall the next day after school, she announces that we’ll each pick two dresses, and I have to try all of them on no matter what, and then we’ll rate them. She even printed out thumbs-up and thumbs-down emojis and made paddles for us to use.\u003c/p\u003e\n\u003cp\u003eIt’s cramped in the dressing room, and there are dresses everywhere. Margot gives Kitty the job of rehanging and organizing, but Kitty’s already given it up in favor of playing Candy Crush on Margot’s phone.\u003c/p\u003e\n\u003cp\u003eMargot hands me one of her picks first—it’s a flowy black dress with fluttery cap sleeves. “You could do your hair up for this one.”\u003c/p\u003e\n\u003cp\u003eWithout looking up, Kitty says, “I would go with beachy waves.”\u003c/p\u003e\n\u003cp\u003eMargot makes a face at her in the mirror.\u003c/p\u003e\n\u003cp\u003e“Is black really me, though?” I wonder.\u003c/p\u003e\n\u003cp\u003e“You should try wearing black more often,” Margot says. “It really suits you.”\u003c/p\u003e\n\u003cp\u003eKitty picks at a scab on her leg. “When I go to prom, I’m going to wear a tight leather dress,” she says.\u003c/p\u003e\n\u003cp\u003e“It can get hot in Virginia in May,” I say, as Margot zips me up. “You could wear a leather dress to homecoming though, since it’s in October.”\u003c/p\u003e\n\u003cp\u003eWe study my reflection in the mirror. The dress is too big in the bodice, and the black makes me look like a witch, but a witch in an ill-fitting dress.\u003c/p\u003e\n\u003cp\u003e“I think you need bigger boobs for that dress,” Kitty says. She holds up the thumbs-down paddle.\u003c/p\u003e\n\u003cp\u003eI frown at her in the mirror. She’s right, though. “Yeah, I think you’re right.”\u003c/p\u003e\n\u003cp\u003e“Did Mommy have big boobs?” Kitty asks suddenly.\u003c/p\u003e\n\u003cp\u003e“Hmm. I think they were on the small side,” Margot says. “Like an A?”\u003c/p\u003e\n\u003cp\u003e“What size do you wear?” she asks.\u003c/p\u003e\n\u003cp\u003e“A B.”\u003c/p\u003e\n\u003cp\u003eEyeing me, Kitty says, “And Lara Jean’s small like Mommy.”\u003c/p\u003e\n\u003cp\u003e“Hey, I’m practically a B!” I protest. “I’m a large A. An almost B. Somebody unzip me.”\u003c/p\u003e\n\u003cp\u003e“Tree has big boobs,” Kitty says.\u003c/p\u003e\n\u003cp\u003e“Are they real?” Margot asks as she pulls down my zipper.\u003c/p\u003e\n\u003cp\u003eI step out of the dress and hand it over to Kitty to hang. “I think so.”\u003c/p\u003e\n\u003cp\u003e“They’re real. I’ve seen her in a bikini, and hers spread when she’s lying down, and that’s how you know. The fake\u003c/p\u003e\n\u003cp\u003eones stay in place like scoops of ice cream.” Kitty picks up Margot’s phone again. “Also, I asked her.”\u003c/p\u003e\n\u003cp\u003e“If they were fake, I doubt she’d tell you that,” Margot says.\u003c/p\u003e\n\u003cp\u003eKitty frowns at her. “Tree doesn’t lie to me.”\u003c/p\u003e\n\u003cp\u003e“I’m not saying she’d lie; I’m saying she might be private about plastic surgery! Which is her right!” Kitty just shrugs coolly.\u003c/p\u003e\n\u003cp\u003eI quickly put on the next dress to get off the subject of Ms. Rothschild’s boobs. “What do you guys think of this one?”\u003c/p\u003e\n\u003cp\u003eThey both shake their heads and reach for the thumbs-down paddle at the same time. At least they are united in their dislike of my dress.\u003c/p\u003e\n\u003cp\u003e“Where’s my pick? Try mine on next.” Kitty’s pick is a skin-tight, white, off-the-shoulder bandage dress I would never in a million years wear, and she knows it. “I just want to see it on you.”\u003c/p\u003e\n\u003cp\u003eI try it on to appease her, and Kitty insists it’s the best dress of all the dresses, because she wants to have the winning pick. In the end, none of the dresses are my style, but I’m not bothered by it. Prom is still more than a month away, and I want to scour vintage shops before I commit to anything from a regular store. I like the idea of a lived-in dress, a dress that has gone places, seen things, a dress that a girl like Stormy might’ve worn to a dance.\u003c/p\u003e\n\u003cp\u003eWhen Margot leaves for Scotland the next morning, she makes me promise to send pictures of potential dresses so she can weigh in. She doesn’t say another word about Ms. Rothschild, but then, she wouldn’t, because that’s not her style. \u003c/p\u003e","sourceLink":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3/page-12.html","bookId":1775,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
