{"id":63800,"no":27,"title":"Page 27","content":"\u003cp\u003eWe passed through the marketplace on our way to the hotel. The bazaar was a dazzling chaos of colors and sounds and scents. Merchants ran up to us, shoving silks and foods and perfumes, while children pulled on our clothing, begging for coins. Haunting songs from the minarets called the faithful to prayer at intervals throughout the day. I watched the shopkeepers stop and prostrate themselves on their rugs and face west to pray.\u003c/p\u003e\n\u003cp\u003eDanilo ignored them. \"This way,\" he said, leading me toward the stalls of the spice market, where one could buy frankincense and myrrh, cinnamon, and the precious attar of roses. Wax candles hung by their wicks from one stall, and an old woman sat in the shadows in front of a tray of glass vials. Some were filled with narcotic drugs: opium and morphine. Danilo pulled me onward, until we came to a young man with frankincense resin.\u003c/p\u003e\n\u003cp\u003eDanilo took a handkerchief out of his pocket and used it to pick up a piece of the resin. \"Dragon\u0027s blood?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" the young man said. \"From the southernmost part of Arabia.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have myrrh as well?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, my lord.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll need some of each.\"\u003c/p\u003e\n\u003cp\u003eI noticed that Danilo seemed reluctant to touch the frankincense, which the empress had used as an antidote to the hemlock poisoning caused by Danilo\u0027s veshtiza sister at Smolni. Militza, too, had used frankincense to poison her veshtiza aunt, Princess Cantacuzene. Did the resin affect him as well? \"What do you need these herbs for?\" I asked innocently as Danilo completed his purchases.\u003c/p\u003e\n\u003cp\u003e\"They are key to the ritual outlined in the papyrus. These are the fragrances that helped souls cross back over to the land of the living.\"\u003c/p\u003e\n\u003cp\u003e\"Whose soul are you planning to aid?\" I asked warily. I wanted no part of this.\u003c/p\u003e\n\u003cp\u003eBut Danilo merely laughed. \"Come, Duchess, no need for you to fret. Let me buy you some food at the other end of the market. Let us enjoy this beautiful weather.\"\u003c/p\u003e\n\u003cp\u003eI looked up at the clear blue sky and took in the dizzying pandemonium swirling around me. Above the sounds of barking dogs and shouting shopkeepers, amid the dusty streets crowded with carts and donkeys and people, it was indeed a beautiful day. Danilo bought two pieces of warm flatbread sold by a shy girl who did not look to be older than eight or nine. She took the coins from him greedily and scampered back to her mother\u0027s bakery stall. The bread was delicious and soft.\u003c/p\u003e\n\u003cp\u003eThe crown prince tried to buy me several trinkets as we walked back toward the entrance of the marketplace. Red silk slippers, silver bracelets, statuettes of ivory and alabaster were all offered to us by loud men and women. I admired the woolen blankets and rugs from Tunis and the damask silks of Arabia. But I would not let Danilo buy me anything expensive, as I had no way of repaying him.\u003c/p\u003e\n\u003cp\u003eI did stop, however, when I saw the bookseller\u0027s stall. Here, stacks and stacks of books and clumsily sewn together folios were being sold by an elderly man in a red fez. I tugged on Danilo\u0027s coat sleeve. \"May I take a look?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" he said politely. \"Let me know if you find anything you like.\"\u003c/p\u003e\n\u003cp\u003eWedged between two piles of Arabic poetry were a few old medical journals. Many were written in Arabic, but one was from England and another from France. They were not too terribly out of date, both written in the past ten years.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the pile, I found a leather-bound reprint of an ancient Greek text about the Alexandrian physician Herophilos. \"How much for this?\" I asked the shopkeeper, sliding the faded brown book out from beneath the others.\u003c/p\u003e\n\u003cp\u003eThe elderly man happily bargained with Danilo for several minutes in Arabic before Danilo finally handed him a paper bill. \"The book is yours, Duchess.\"\u003c/p\u003e\n\u003cp\u003e\"Was it very costly?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be ridiculous. We must rejoin the others.\"\u003c/p\u003e\n\u003cp\u003eI placed my hand on the crown prince\u0027s arm. \"Merci, Danilo.\"\u003c/p\u003e\n\u003cp\u003eHe took my hand and kissed it. \"It is nothing. I am happy to find something here that pleases you.\"\u003c/p\u003e\n\u003cp\u003eMala and the elder Grigori met us at the front gates of the bazaar. \"Did you acquire what you needed, Your Majesty?\" Mala asked with a formal bow.\u003c/p\u003e\n\u003cp\u003e\"Yes. Now it is time to prepare Katerina for the ritual.\"\u003c/p\u003e\n\u003cp\u003e\"Ritual?\" I asked. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003eMala took me gently by the arm and pulled me away from the crown prince. \"You will not be harmed, Duchess.\" In a lower voice she added, \"The necromancer who performs the ritual must be ceremonially pure. She must not have eaten the flesh of any animal, and she must not have consorted with men.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It means that His Majesty needs you to remain a virgin until after the ritual,\" she answered, her eyes sparkling with mischief. \"But after that, he will wish to marry you as soon as possible.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-morning-star-katerina-3/page-27.html","bookId":2655,"creation":"Oct 5, 2019 9:52:15 AM","modification":"Oct 5, 2019 9:52:15 AM"}
