{"id":77101,"no":110,"title":"Page 110","content":"\u003cp\u003e“Okay, we’re ready!” Dr. T calls out. The scientists lower their safety goggles and Balder and Gonzo follow suit. Dr. T offers a sort of space-hero salute, his hand across his chest.\u003c/p\u003e\n\u003cp\u003e“To Higgs Field and beyond. Calabi Yau!”\u003c/p\u003e\n\u003cp\u003e“Calabi Yau!” they shout.\u003c/p\u003e\n\u003cp\u003eGonzo bestows a final fist bump. “Here’s to sand castles and ninjas, dude.”\u003c/p\u003e\n\u003cp\u003eI give the thumbs-up, and Ed closes the door, sealing me in.\u003c/p\u003e\n\u003cp\u003eAt first, it’s quiet and dark. Really dark. Then I hear the Copenhagen Interpretation’s music filling the space around me. “Time is what you make of it. …”\u003c/p\u003e\n\u003cp\u003eThe ground hums; it vibrates till my teeth rattle. The daisy door lights up like a wheel you spin at a carnival, and that’s when I nearly piss myself with fear. Be cool, Cameron. Don’t wanna trip the light fantastic with wet undies. Chafe is chafe in any dimension.\u003c/p\u003e\n\u003cp\u003eIt’s like I’ve been shot out of a superpowered cannon. There’s so much pressure bearing down on me, smashing me flat. It’s like I’m a plastic toy form stuck to a plastic board along with other forms that can be moved around only on that flat board. And then I’m expanding. I can feel myself peeling off that flat board and fluffing out, and it’s like I’ve got as many hidden dimensions as the Calabi Yau toy, all curled up and exponentially huge at the same time. Then—kapow!—I could swear every part of me is coming apart and being rearranged, like the ball bearings in one of those cheap plastic puzzle games you get in a birthday goody bag when you’re a kid. In my ears, the Copenhagen Interpretation’s getting louder. Tiny cells of time zip around me, snapshots constantly being rearranged on the blank pages of a photo album. Sometimes I look and they tell a linear story; other times they don’t seem to make sense or one cell overlaps another. I can make out a few things, though: The CI playing a concert. A big black hole opening above them. Dr. X stepping into his machine. The empty stage. Dr. X and the Copenhagen Interpretation flying through space, and in their wake, something forming. A ball of fire.\u003c/p\u003e\n\u003cp\u003eI’m accelerating, and everything’s getting wonky. Time bends and blends till I can’t tell what’s what anymore: The Copenhagen Interpretation fishing in the snow. Me falling off the Small World ride. Gonzo in a fedora, a huge stuffed albatross on his desk and a gun in his hand. Glory playing hopscotch with a little girl who looks just like her. Dr. X dancing with his wife. Dr. X all alone in his stark white room. Dad with his arm around my shoulders, two moons hanging low in the orange sky. Stars streaking over my head. A crying Dulcie out in the snow, banging her palms against a pane of glass, over and over. Junior Webster’s horn in my hands. The WELCOME TO FLORIDA sign.\u003c/p\u003e\n\u003cp\u003eThe music reaches a crescendo. It’s so much I can’t take it.\u003c/p\u003e\n\u003cp\u003eWhen I come to, everything’s still. The Calabi Yau is smoked as a piece of Buddha Burger jerky. I can move, and since I seem to have stopped traveling, I guess the only thing left to do is open up the Infinity Collider and see what’s on the other side of that door. For all I know, I could be stepping into a world where Rad soda and Parker Day don’t exist, and nobody’s even heard of the Copenhagen Interpretation.\u003c/p\u003e\n\u003cp\u003eThe door opens with a loud pssssht and a cloud of mist, and I hope carnivorous houseplants aren’t waiting with forks and knives and tartar sauce. Blurry forms emerge from the mist. Their edges fill in; Drs. A, T, O, and M stand blinking at me. Gonzo smiles in relief, and Balder removes his helmet and sinks to his knees to offer a prayer of thanks.\u003c/p\u003e\n\u003cp\u003e“Nima Arkani-Hamed!” Dr. T whoops, jumping a full foot off the floor. The scientists hug each other in a victory huddle before running off to test for evidence of XL-gravitrons and maybetrons and perhapsatrons and whatever else they can think up.\u003c/p\u003e\n\u003cp\u003eEd takes my helmet and goggles, offers me juice. Then he reaches into my pocket and takes out the rabbit’s foot, which is now streaked with brown, though I could have sworn it was white when he put it in there.\u003c/p\u003e\n\u003cp\u003e“Huh,” he says, smiling. “Thought so.”\u003c/p\u003e\n\u003cp\u003eAnd it makes about as much sense as anything else.\u003c/p\u003e\n\u003cp\u003eLater, after the scientists have recorded everything they can, after they’ve high-fived each other about a gazillion times and hung up a sign that says PARALLEL UNIVERSE TRAVEL OFFICE-PIA: OPENING FOR BUSINESS SOON! they come to see us off.\u003c/p\u003e\n\u003cp\u003e“Sorry we couldn’t help you find Dr. X,” Dr. O says, pumping my hand. “You’ve been of enormous help to science.”\u003c/p\u003e\n\u003cp\u003e“Hey, Gonzo—you hear that? I’ve been of enormous help to science!”\u003c/p\u003e\n\u003cp\u003e“Tell ’em you want a medal, a big-ass one,” Gonz shouts back through a mouthful of veggie taco, because he swears he’s not getting on the road without a full stomach. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-110.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
