{"id":77110,"no":119,"title":"Page 119","content":"\u003cp\u003eKeith’s slapping Left Guy on the back. “Hey, baby. You wanna screw? No, it’ll be magic, I swear.” He breaks into a kind of chortling that comes out of his nose in snorts and honks. It’s the sort of contagious laughing that ripples out to everyone.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, okay. I was joking. …”\u003c/p\u003e\n\u003cp\u003e“No, no, I’m sorry, man. Here, let me make it up to you,” Keith says, putting his arm around me and trying to get his breathing under control. There are tears streaming from his eyes. “You want a screw?”\u003c/p\u003e\n\u003cp\u003eThat’s all it takes for the whole crew to fall out again like a pack of deranged hyenas, their laughing punctuated only by guttural gasps of “magic” and “screw.” I can see this will be the joke played out at my expense for the next one hundred miles.\u003c/p\u003e\n\u003cp\u003e“I’m gonna get some more firewood.”\u003c/p\u003e\n\u003cp\u003eDulcie follows me out of the campground. “You can get mad. It’s okay. It won’t kill you to say it, Cameron.”\u003c/p\u003e\n\u003cp\u003e“I’m not—” I whip around. “Okay. Fine. Yes. I am mad at you, Dulcie. Satisfied?”\u003c/p\u003e\n\u003cp\u003eShe curls herself up in her wings. “See? You’re still here.”\u003c/p\u003e\n\u003cp\u003e“I’m serious.”\u003c/p\u003e\n\u003cp\u003e“I know. It’s making me swoon. Tell me more.”\u003c/p\u003e\n\u003cp\u003e“I’m mad because you came into my life and totally messed with it so I don’t know what’s what anymore.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“I’m mad because you told me about those guys and now I have to care. I’m mad because you won’t tell what’s going to happen to me. Because you don’t give guarantees.”\u003c/p\u003e\n\u003cp\u003e“True, true.” Her wings open up again.\u003c/p\u003e\n\u003cp\u003e“Jesus. I’m mad because you make me feel like things are possible when they probably aren’t, or maybe they are, I don’t know. I’m mad because …”\u003c/p\u003e\n\u003cp\u003e“Because?”\u003c/p\u003e\n\u003cp\u003e“Because you make me give a shit.”\u003c/p\u003e\n\u003cp\u003eDulcie gets really quiet. “Yeah. Sorry about that.”\u003c/p\u003e\n\u003cp\u003eHer feathers smell like rainwater after a drought. She’s so close I could kiss her. If I weren’t so pissed off at her right now, I might try it. I want to fight with her, then kiss her. “And … and that’s why I’m, you know. Mad.”\u003c/p\u003e\n\u003cp\u003e“Thanks for telling me.”\u003c/p\u003e\n\u003cp\u003e“You’re … welcome.”\u003c/p\u003e\n\u003cp\u003e“Cameron,” she says, her face tilted toward mine. “It’s about time.”\u003c/p\u003e\n\u003cp\u003e“Time for what?” My mouth has gone dry.\u003c/p\u003e\n\u003cp\u003e“Time. Exactly twenty minutes.”\u003c/p\u003e\n\u003cp\u003eWith a thunderous groan, Left Guy sits up, dazed, and barfs hot dogs everywhere.\u003c/p\u003e\n\u003cp\u003e“Destiny’s not fixed, huh?” I say. Dulcie doesn’t answer. “Fuck this.”\u003c/p\u003e\n\u003cp\u003eI tear off the E-ticket wristband and toss it in the weeds.\u003c/p\u003e\n\u003cp\u003e“Cameron, wait!” Dulcie calls out, but I’m already running.\u003c/p\u003e\n\u003cp\u003eI walk in circles for hours, until I’m exhausted. When I come back, the others are passed out. I feed some twigs to the dwindling campfire and sit to think. What Dulcie said has me all messed up inside. Why didn’t she tell me this before? Can she see what’s going to happen?\u003c/p\u003e\n\u003cp\u003eI rub my wrist where the E-ticket used to be. My muscles burn, and I feel a spot of fear laced with hopelessness growing larger.\u003c/p\u003e\n\u003cp\u003eThere’s a rustling sound. At first I think it’s some animal, but then Balder drops next to me by the fire. He’s got Keith’s jacket around his shoulders and a bag of marshmallows in one hand. In his other is the E-ticket, which he places on the thin strip of dirt between us. He squints up at the night sky. “Ah. Do you see Hati chasing Mani? It is the ravenous wolf in relentless pursuit!”\u003c/p\u003e\n\u003cp\u003eThin wisps of gray cloud stretch their jaws across the moon.\u003c/p\u003e\n\u003cp\u003e“That’s the moon. And that’s a cloud. No wolf.”\u003c/p\u003e\n\u003cp\u003e“You’re mistaken!” Balder says cheerily. “It is the—”\u003c/p\u003e\n\u003cp\u003eI slap my hand against the ground making the E-ticket jump. “They’re just f**king stories, okay? Like Santa Claus and the Tooth Fairy. It’s bullshit we tell ourselves so we don’t feel afraid.”\u003c/p\u003e\n\u003cp\u003eBalder turns back to the fire, and I’m sorry for yelling at him. He threads a stick with marshmallows. “Shall I tell you a story?” he asks softly. “You don’t have to believe it if you don’t want to.”\u003c/p\u003e\n\u003cp\u003eI want to say no. Or maybe yes. But my throat’s too tight to make a sound. And then, as if he can read my thoughts, Balder begins.\u003c/p\u003e\n\u003cp\u003e“I wish you could see my homeland. In the winter, the snows greet you with vigor. Every breath you take is a warrior’s breath, fighting against that worthy adversary, the cold. Ice floes drift past our longboats, and the sails are as ghosts in the mist. But in the spring! In the spring, the land is the green of a ribbon plaited in the golden hair of a village girl you’ve glimpsed only once, fleetingly, as your horses lead you on toward battle, but whose face you remember the rest of your days. Golden-grass fields rise and fall to the sea. There are mountains! Great, slumbering giants of rock who wake with a frightful noise from time to time, shaking the earth, belching heat, reminding us that change is always at hand. At the great ash tree, Yggdrasil, which holds our nine worlds, the Norn tend the roots, keeping them nourished that they not decay, deciding men’s fates with a length of string. Above it all, Frigg spins clouds that float in the ever-blue like giants’ eyes watching from a careful distance. And there is Breidablik, where all are welcome and no lies may enter through its stones. My great, gleaming hall.” His voice falters. “My home.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-119.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
