{"id":100837,"no":123,"title":"Page 123","content":"\u003cp\u003eI nod, speechless.\u003c/p\u003e\n\u003cp\u003eShe grabs her pen, all business. “Questionnaire time. Where are you from, Cameron?”\u003c/p\u003e\n\u003cp\u003e“Texas.”\u003c/p\u003e\n\u003cp\u003e“Ride ’em, cowboy!” she says, apropos of nothing. “So, who are your best friends?”\u003c/p\u003e\n\u003cp\u003e“Gonzo and Balder,” I say. I like the way it sounds.\u003c/p\u003e\n\u003cp\u003e“What do you guys like to do?”\u003c/p\u003e\n\u003cp\u003eGo on insane road trips dictated by personal ads in tabloids. Search for fugitive, time-traveling doctors. Evade the cops. Steal money from low-rent druggies. Fight beings from parallel worlds.\u003c/p\u003e\n\u003cp\u003e“Hang out,” I answer.\u003c/p\u003e\n\u003cp\u003e“Mm-kay. Good. Anything interesting you want to add?”\u003c/p\u003e\n\u003cp\u003eI should tell her a bunch of bullshit, but for some reason, I want to be honest.\u003c/p\u003e\n\u003cp\u003e“I’ve got a fatal illness. Creutzfeldt-Jakob.”\u003c/p\u003e\n\u003cp\u003eIphigenia writes something, then scratches it out. “How do you spell that?”\u003c/p\u003e\n\u003cp\u003e“Just put mad cow disease.”\u003c/p\u003e\n\u003cp\u003e“Great!” She jots it down. “Now for the really important questions. Do you drink Rad soda? And if so, how often? Frequently. Often. Rarely. Never.”\u003c/p\u003e\n\u003cp\u003e“Rarely.”\u003c/p\u003e\n\u003cp\u003eThe kitty pen bounces across the page like a deranged pet. “Which of these situations would most increase your thirst for a Rad soda? Hanging with friends. Talking with Mom and Dad. Playing a game of hoops. Going to the mall. Doing homework. Attending a funeral …”\u003c/p\u003e\n\u003cp\u003e“Attending a funeral?”\u003c/p\u003e\n\u003cp\u003eShe shows me the paper and I see the question right there. “New marketing strategy. They’re getting ready to launch a new teen drink? Rad Grief—‘For those times when your thirst needs a friend.’ So, do you think you would drink Rad Grief?”\u003c/p\u003e\n\u003cp\u003eDeath and soda don’t really go together in my head, but it’s getting late and I need to find Gonzo. “Sure. You bet.”\u003c/p\u003e\n\u003cp\u003eIphigenia lets out a little squeak and bops in her chair. “Excellent! You’re my first yes. Hey, Cameron, you’re so nice. Would you like me to get you on one of the shows? They need players for What’s Your Category? today. Whaddaya say?”\u003c/p\u003e\n\u003cp\u003e“I don’t think …”\u003c/p\u003e\n\u003cp\u003e“I could totally hook you up with the producers. You can win a lot of money,” she singsongs.\u003c/p\u003e\n\u003cp\u003eMy brain does a cost analysis: could I win us some cash, find Balder, and get our butts out of here before we’re found out? The Party House crowd doesn’t really watch the news, and the bounty hunters probably aren’t watching YA! TV. It’s a risk, but a risk with a lot of money attached, and we desperately need the money.\u003c/p\u003e\n\u003cp\u003e“Sign me up.”\u003c/p\u003e\n\u003cp\u003e“Nuclear!” Iphigenia says. “Okay, we need to figure out what category you go in.”\u003c/p\u003e\n\u003cp\u003e“Category.”\u003c/p\u003e\n\u003cp\u003e“Yeah, like are you a techno gadgetronic, a Saturday cinephile, sports authority, sex machine, audio boss, comics crusader, party hopper? You know. Where do you fit in?”\u003c/p\u003e\n\u003cp\u003e“What’s an audio boss?”\u003c/p\u003e\n\u003cp\u003eIphigenia gives herself two big twirls in the rolling chair, first going left, then going right. “Somebody who’s obsessed with music. Is that you? You seem sort of audio savvy to me.”\u003c/p\u003e\n\u003cp\u003e“Well, there’s this music store I like back home called Eubie’s Hot—”\u003c/p\u003e\n\u003cp\u003eShe brings the chair to a dead stop. “Great. So audio boss.”\u003c/p\u003e\n\u003cp\u003e“Wait! I don’t know that that’s how I want to be categorized. I mean, maybe I’m a sex machine.”\u003c/p\u003e\n\u003cp\u003eIphigenia taps her pen while looking me up and down. “Doubtful.”\u003c/p\u003e\n\u003cp\u003e“Or a techno gadg-a … gadge …”\u003c/p\u003e\n\u003cp\u003e“Gadgetronic. It’s somebody who’s way into electronics and wants the latest gears gear.” Iphigenia’s mouth forms an excited O. “Didya hear me say that? ‘Gears Gear.’ Omigod. No one’s ever said that here before. So it’s mine! I made it up. I have to fill out the form to make it officially my trademark phrase. Hold on a sec, ’kay?”\u003c/p\u003e\n\u003cp\u003eIphigenia’s fingers fly over the keyboard. She hits Send. “Done. God, that would be so cool, wouldn’t it? I could probably turn that into a clothing line—Gears Gear. Anyway, back to you. So would you say you’re a techno gadgetronic, then?”\u003c/p\u003e\n\u003cp\u003e“No. I mean, not really.”\u003c/p\u003e\n\u003cp\u003eIphigenia’s getting antsy. She taps her fake nails against the tabletop. “Well, you have to be something.”\u003c/p\u003e\n\u003cp\u003e“What if I’m a lot of different somethings?”\u003c/p\u003e\n\u003cp\u003e“No can do. It messes with the marketing plan. Just one thing. If we can’t categorize you, then you can’t play.”\u003c/p\u003e\n\u003cp\u003e“What category are you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-123.html","bookId":2718,"creation":"Oct 5, 2019 9:49:24 PM","modification":"Oct 5, 2019 9:49:24 PM"}
