{"id":77119,"no":129,"title":"Page 129","content":"\u003cp\u003e“Cameron! The Cam-right-answer-man. What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Um, nothing.”\u003c/p\u003e\n\u003cp\u003e“You smoked it today. Good job. Is that the gnome?” The scarf has fallen off Balder’s face. Parker eyes us suspiciously. “What are you up to?”\u003c/p\u003e\n\u003cp\u003e“We … ah … they told us to bring it to the stage,” I lie.\u003c/p\u003e\n\u003cp\u003e“Bullshit. I’m calling security.” Parker reaches for his phone.\u003c/p\u003e\n\u003cp\u003e“Okay!” I shout. “You totally busted us. We just wanted to take some pictures. School prank. You know?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I know. I know that you’re trying to make off with YA! TV property. Gonna need this little guy for promos.” He flicks his finger at Balder’s nose. Balder flinches, but Parker doesn’t notice.\u003c/p\u003e\n\u003cp\u003e“Parker. Please. Just let us take him for pictures.” I fan out the bills in my hands.\u003c/p\u003e\n\u003cp\u003eBalder’s eyes get huge.\u003c/p\u003e\n\u003cp\u003e“Come on, dude,” Gonzo adds. “Don’t make us go home empty-handed. There’s bills riding on this in the locker room. Reputations.”\u003c/p\u003e\n\u003cp\u003eParker tries on a pair of expensive sunglasses and checks himself out in the mirror. “You can have the gnome,” he says, taking off the glasses and pocketing them. “On one condition.”\u003c/p\u003e\n\u003cp\u003e“Anything. You name it,” I say.\u003c/p\u003e\n\u003cp\u003eHe points to Gonzo. “Your friend here does I Double Dog Dare You.”\u003c/p\u003e\n\u003cp\u003eWe are so screwed. Balder shuts his eyes. He knows his fate as a cross-dressing object of destruction has just been sealed.\u003c/p\u003e\n\u003cp\u003e“He can’t, but I can,” I say.\u003c/p\u003e\n\u003cp\u003eParker shakes his head. He pokes through the food tray, taking some grapes and a hunk of cheese. “You’ve already been on. Besides, we’ve never had a dwarf.”\u003c/p\u003e\n\u003cp\u003eI put the four hundred dollars on the table.\u003c/p\u003e\n\u003cp\u003e“I make that in an hour.”\u003c/p\u003e\n\u003cp\u003e“What if I let you dunk me? You could put me back on the show and I’ll miss the question on purpose and …”\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” Gonzo announces with a look of grim determination on his face.\u003c/p\u003e\n\u003cp\u003eParker grins at me and slaps Gonzo hard on the back. “Excellent! Little man, you just bought yourself a yard gnome.”\u003c/p\u003e\n\u003cp\u003eHe puts his arm around Gonzo’s shoulders and ushers him down the hall.\u003c/p\u003e\n\u003cp\u003eGonzo looks back at me. “It’ll be okay,” he says, puffing like a dying man on his inhaler.\u003c/p\u003e\n\u003cp\u003e“You okay, Balder?” I ask, once we’re out of Marisol’s room and sneaking our way out of the Party House.\u003c/p\u003e\n\u003cp\u003e“I have suffered the humiliation of capture, and I am what you call cranky, but I am okay. Thank you,” he says. “I saw you bidding.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome,” I say. “I’m sorry I didn’t realize they’d taken you till we were an hour down the road.”\u003c/p\u003e\n\u003cp\u003e“Neither did I at first. I was asleep. Next thing I knew I woke up in a strange hotel room with those three idiots. They took photographs of me on top of the minibar and e-mailed them to all their friends. Posing me with chocolate bars and soda cans. Can you imagine?”\u003c/p\u003e\n\u003cp\u003e“Shake it off, man. You’re okay now.”\u003c/p\u003e\n\u003cp\u003e“Cameron?” A familiar voice stops me cold. Standing five feet in front me is my sister, Jenna. She’s got on her white capris and a striped shirt. For once, her hair is not in a ponytail but down and curled. She looks different. Older, maybe. Less like a kid.\u003c/p\u003e\n\u003cp\u003e“Cameron!” she shouts, smiling. She runs over and throws her arms around me. “Oh my God! It is you!”\u003c/p\u003e\n\u003cp\u003e“Jenna, hey,” I say, hugging her back as best I can with an armful of yard gnome. I’m not putting Balder down for anything.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she says. Her eyes are wet. She rubs them with the back of her hand.\u003c/p\u003e\n\u003cp\u003e“Top-secret mission,” I say, trying to make her laugh. It’s what I used to do when we were kids.\u003c/p\u003e\n\u003cp\u003e“Cameron …”\u003c/p\u003e\n\u003cp\u003eI hold up a hand. “I know, I know. I’ll explain everything. I promise. But first I’ve got to drop something off in my room. Wait right here.”\u003c/p\u003e\n\u003cp\u003eI try to break away, but she pulls me back. Either I’m really weakening or she’s got a grip that’s even manlier than Chet King’s. “No way,” she says with a determined smile. “I’m going with you.”\u003c/p\u003e\n\u003cp\u003eIt would be impossible to fight her. “Fine.”\u003c/p\u003e\n\u003cp\u003eWe make our way downstairs and push through the packed bodies on the dance floor they’ve built on the beach, walking through the warm sand till we’re at the crappy motel.\u003c/p\u003e\n\u003cp\u003e“Yikes,” Jenna says, taking a look around at the seedy décor—the stained carpet, butt-ugly floral bedspreads, and lack of any amenity, like a minibar or even an ice bucket. She doesn’t step inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-129.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
