{"id":77121,"no":131,"title":"Page 131","content":"\u003cp\u003e“Did you come here by yourself?” I ask. I can’t imagine that. Dad wouldn’t allow it, and Jenna can’t go anywhere without at least two other girls in tow. It’s against her personal bill of rights.\u003c/p\u003e\n\u003cp\u003e“I came with Staci and those guys. Mom said it would be good for me to get away.” Jenna takes a drink of her soda, and we sit for a minute watching some punk-poser band in cutoff work pants and tattoos hop around onstage screaming out a song.\u003c/p\u003e\n\u003cp\u003e“Everybody’s completely freaked out. I mean, Cam, those bounty hunters aren’t fooling around, and Mom and Dad …”\u003c/p\u003e\n\u003cp\u003e“I know. I’m sorry. I promise I’ll be back as soon as I can and make everything right. You’re not going to tell them, are you?”\u003c/p\u003e\n\u003cp\u003eShe gives me a hard look, like I’m material on the blackboard she needs to understand, classify, and master for the test. I never realized how much she’s like Dad in that way. “Yeah. I am. I have to, Cameron. But I’ll give you a head start. I’ll wait till tomorrow when I call in again.”\u003c/p\u003e\n\u003cp\u003e“Fair enough,” I say.\u003c/p\u003e\n\u003cp\u003eSomebody’s done the unthinkable and changed the channel to the news and our story. They cut from our flyer to Arthur Limbaud at the lot of his Resale Beauties. He’s sitting on the hood of one of his best, shiniest models, with his secretary by his side, not missing an opportunity to work it. It doesn’t matter that the sound’s muted, because I know what he’s saying. He’s telling them about us, about the car. They flash a picture of the Caddy up there, and we are in deep shit now.\u003c/p\u003e\n\u003cp\u003eThe drunken idiot guys have stopped playing. They’ve broken out into a real fight. Other people are getting in on it now, either trying to break it up or land a few punches, too. Two guys fall into our table, and the crowd falls with them. Somebody pulls Jenna out of the mix on her side, a big dude in a Midgard University shirt. He’s a good-looking guy.\u003c/p\u003e\n\u003cp\u003e“Careful there,” he says.\u003c/p\u003e\n\u003cp\u003e“Thanks,” Jenna says.\u003c/p\u003e\n\u003cp\u003eHe sticks a hand out. “Name’s David Morae.”\u003c/p\u003e\n\u003cp\u003e“Jenna Smith.”\u003c/p\u003e\n\u003cp\u003e“Nice to meet you, Jenna Smith.”\u003c/p\u003e\n\u003cp\u003eJenna laughs and shakes his hand. He’s got her full attention, and that’s just the opening I need to slip away.\u003c/p\u003e\n\u003cp\u003eRescue Gonzo, pack up, and leave. Now. Immediately. That’s the plan as I make my way through the hordes of spring breakers, trying to find a three-foot-six-inch dwarf sporting the world’s most ridiculous mustache. I don’t see him anywhere. It’s wall-to-wall people. I bump into a blond chick.\u003c/p\u003e\n\u003cp\u003e“Sorry,” I say, trying to move past her.\u003c/p\u003e\n\u003cp\u003e“Cameron? Is that you? Oh. My. God.” Staci Johnson’s standing right in front of me, holding a beer in a plastic cup. “You look so hot!” The next thing I know, Staci Johnson kisses me, and it’s like a mind eraser. “Where were you going?” she asks.\u003c/p\u003e\n\u003cp\u003e“Nowhere,” I say.\u003c/p\u003e\n\u003cp\u003e“Want a beer?”\u003c/p\u003e\n\u003cp\u003e“You bet.”\u003c/p\u003e\n\u003cp\u003eCHAPTER FORTY-THREE\u003c/p\u003e\n\u003cp\u003eIn Which I Discover Eleven Dimensions All in One Person\u003c/p\u003e\n\u003cp\u003eMy whole body has that light, early-drunk feel. I’ve had three beers—not enough to get ugly or sick, just enough to be riding out a pleasant, mellow groove. Staci’s only had two. She’s very giggly. We dance for a few songs, and then Staci suggests we go back to my room. She wants to “see it.”\u003c/p\u003e\n\u003cp\u003e“So, this is it,” I say, letting her in. Balder’s not on the bed. I guess he went out. The bedside lamp is still on; so’s the TV. I flip it off.\u003c/p\u003e\n\u003cp\u003e“Great room,” Staci says, flopping onto the bed.\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say, like I have anything to do with this shithole.\u003c/p\u003e\n\u003cp\u003e“You know I always liked you.” She bites her lip. Her shirt’s fallen off her shoulder. She’s wearing a black bra. “But you seemed like you only went out with those smart, punker kinda girls. Remember when we were lab partners in seventh grade?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eShe traces a circle on my leg. “I gave you my school picture with Love, Staci on it. You were so nice. Hey, you’re not drinking.” She puts her still-full cup to my lips. “Drink, drink, drink.”\u003c/p\u003e\n\u003cp\u003eThe beer’s warm and a little flat. Some of it dribbles down my chin and onto my shirt.\u003c/p\u003e\n\u003cp\u003e“Oops,” she giggles.\u003c/p\u003e\n\u003cp\u003eI abandon the cup on the nightstand. Staci leans back on her elbows, giving me a calculated shy look. “So … did you ever think about me?”\u003c/p\u003e\n\u003cp\u003e“Yeah, sure.”\u003c/p\u003e\n\u003cp\u003e“Shut up!” She swats at me playfully. “For real? Did you ever think about asking me out?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-131.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
