{"id":77129,"no":139,"title":"Page 139","content":"\u003cp\u003e“And then, in the middle of ‘Words for Snow,’ the sky began to frown. The clouds knotted together the way my grandmother scowls at my grandfather when he passes wind and blames the dog.”\u003c/p\u003e\n\u003cp\u003eGonzo snickers.\u003c/p\u003e\n\u003cp\u003e“What happened next?” I prompt, ignoring him.\u003c/p\u003e\n\u003cp\u003e“The sky swirled over our heads. A hole opened. And then we were sucked up and tumbling through tunnels of light, falling into other dimensions.”\u003c/p\u003e\n\u003cp\u003e“Did you ever come across a Dr. X? A scientist?”\u003c/p\u003e\n\u003cp\u003eThere’s more murmuring. The interpreter wants to be sure he’s gotten it right.\u003c/p\u003e\n\u003cp\u003e“At one point,” he says. “We came upon a man in a white lab coat the color of snow you cannot shake from your shoe.”\u003c/p\u003e\n\u003cp\u003e“Dr. X!” I blurt out. “Had to be. Were you guys ever in the same universe at the same time? Do you know where he ended up?”\u003c/p\u003e\n\u003cp\u003e“We did not speak. Only passed each other. You know. The way people do in space.”\u003c/p\u003e\n\u003cp\u003eMy heart sinks at this. I’m out of my chair, pacing. “At Putopia, they told us Dr. X had a theory about music. That it was its own dimension. That the vibrations could punch holes through space and time. Dr. X was playing ‘Words for Snow’ when he stepped into the Infinity Collider. He used this”—I pull the Calabi Yau manifold from my backpack—“to amplify the sound.”\u003c/p\u003e\n\u003cp\u003eThule murmurs to the interpreter, who says, “Looks like macaroni art.”\u003c/p\u003e\n\u003cp\u003e“What if he stepped into the Infinity Collider at the precise moment you were playing at the concert—the same song at the same time, a supersynchronized vibration opening up a passage?”\u003c/p\u003e\n\u003cp\u003eI look to my friends. Balder strokes his beard. Gonzo’s squinting like he’s trying to pay attention in algebra class. Drew laces his fingers with Gonzo’s. Dulcie’s eyes shine.\u003c/p\u003e\n\u003cp\u003eThe keyboard player leans forward and whispers in the interpreter’s ear. “Interesting,” the interpreter says. “Do you want to try the peanut butter? It’s very good.”\u003c/p\u003e\n\u003cp\u003eJust then, a bunch of YA! TV suits show up. It’s time for the second set, and we have to leave. I have so many more questions—about parallel dimensions, Dr. X, time travel, and the wormhole we’re supposed to close—but our audience with the Copenhagen Interpretation is officially over for now.\u003c/p\u003e\n\u003cp\u003eWe all shake hands, and Balder gives the lead singer Thule, a fist bump.\u003c/p\u003e\n\u003cp\u003eWhen we come out again, it’s gotten darker.\u003c/p\u003e\n\u003cp\u003e“What’s that?” A girl points to thick black smoke in the distance. Just behind it is a fierce orange glow. “Is it the wildfires?”\u003c/p\u003e\n\u003cp\u003e“Should we close down?” an assistant asks someone next to him.\u003c/p\u003e\n\u003cp\u003e“Nah, here comes a storm. That should take care of it,” the other guy answers.\u003c/p\u003e\n\u003cp\u003eThe crowd boos at the coming rain. I get a tingly feeling up my arms. The clouds are moving fast, swirling, pulling.\u003c/p\u003e\n\u003cp\u003e“Dulcie …,” I say.\u003c/p\u003e\n\u003cp\u003eHer eyes are wide. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“You think those are wildfires and a passing storm?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. Down on the beach, the wind rips away a hotel awning. It tumbles down the beach before zipping up toward the sky and disappearing.\u003c/p\u003e\n\u003cp\u003e“Dulcie!” I shout over the wind and fire sirens. “I don’t think we can wait. I think we have to try to re-create what happened the night the wormhole was opened.”\u003c/p\u003e\n\u003cp\u003eLightning crackles overhead. Dulcie gives me a push. “Go.”\u003c/p\u003e\n\u003cp\u003eBy the time we reach the stage, the beach is black with smoke and the sky is as dark as a night without stars. A voice comes over the loudspeaker. “Ah, folks, I’m afraid those wildfires are getting a little too close for comfort, and the weather isn’t cooperating too much, either. We’re gonna have to shut down the concert.”\u003c/p\u003e\n\u003cp\u003ePeople boo loudly. A hulking security guard with a shaved head and biceps the size of giant poodles pushes people away from the stage. There’s no way to get closer.\u003c/p\u003e\n\u003cp\u003e“Shit! What do we do now?”\u003c/p\u003e\n\u003cp\u003eDulcie looks around quickly. “I’ll get the crowd stirred up. You try to get the Copenhagen Interpretation to come out for one more song.”\u003c/p\u003e\n\u003cp\u003eJust like that, Dulcie starts zigzagging through the crowd, shouting, “Encore! Encore! ‘Words for Snow!’ C’mon!”\u003c/p\u003e\n\u003cp\u003eA few people take up a chant—“Words for Snow!”—and it swells. I try to slip under the security ropes. The big guy hauls me out without even breathing hard.\u003c/p\u003e\n\u003cp\u003e“I have to talk to the Copenhagen Interpretation!”\u003c/p\u003e\n\u003cp\u003e“Pal, everybody needs to talk to the Copenhagen Interpretation. Back off.” He pushes me back. Lightning zaps one of the hotels and then again near the stage. Car alarms go off. People get a little nervous. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-139.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
