{"id":77007,"no":14,"title":"Page 14","content":"\u003cp\u003eThere’s yet another place where I can feel awkward, resentful, and out of touch?\u003c/p\u003e\n\u003cp\u003e“It means that while you work here, I’m like your daddy. I make the rules. And when I say you need to be here on time or even ten minutes early for your shift, I mean it. You got me?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” I say. Mr. Babcock pats my shoulder. He smiles, and the caterpillar mustache—the envy of state troopers everywhere, I’m sure—straightens out again. I hear that on the weekends, he’s a part-time security guard with mirrored sunglasses and a gun. He probably poses in front of his bathroom mirror to see how he looks saying “Freeze!”\u003c/p\u003e\n\u003cp\u003eMr. Babcock is pleased that I have “heard his message.” I’ll bet he feels all cuddly inside that he may have “put another youth on the path to responsibility.” I make a mental note to write Kick Me on the back of his shirt sometime.\u003c/p\u003e\n\u003cp\u003eI’m working with Lena today. Just great. Lena’s the most literal person I’ve ever met, with the heart and soul of a district attorney. When Lena is shift manager, she expects you to work your ass off—no skipping off to the walk-in for a secret smoke or pretending to clean the bathrooms for thirty minutes. It’s by the book all the way.\u003c/p\u003e\n\u003cp\u003eShe hands me a rag. “Late again, Cameron.”\u003c/p\u003e\n\u003cp\u003e“Just by seven minutes. That’s not really late, Lena.”\u003c/p\u003e\n\u003cp\u003eShe swivels around, hands on hips. “Yeah? That’s seven minutes I had to cover for you. Not cool.”\u003c/p\u003e\n\u003cp\u003e“It’s not that big a deal.” I busy myself stocking the napkin holders on the counters, but I can feel her eyes on me, like she sees straight through to my inner assholian, irresponsible core. I look up and she’s studying me.\u003c/p\u003e\n\u003cp\u003e“Can I ask you a question, Cameron?”\u003c/p\u003e\n\u003cp\u003e“I think you just did. Or did you mean an additional question?”\u003c/p\u003e\n\u003cp\u003eLena doesn’t even bother to dignify this with a new facial expression. “My question is this: What’s wrong with you?”\u003c/p\u003e\n\u003cp\u003eShe’s staring at me with those big brown eyes, waiting. And what I want to say to her is I don’t know. I honestly don’t.\u003c/p\u003e\n\u003cp\u003e“Right. I’ll just go wipe down.”\u003c/p\u003e\n\u003cp\u003eLena shakes her head slowly, judge and jury. And then she does that thing I can’t seem to do. She shakes it off, puts on a smile, and turns to the next customer. “Hi, welcome to Buddha Burger. How can I help you?”\u003c/p\u003e\n\u003cp\u003eOnly six more fun-filled hours to go.\u003c/p\u003e\n\u003cp\u003eThe tables are a mess. Every inch of the fake bamboo tables is covered in the sticky, mushy remnants of Buddha Burgers, Meditation Fries, and Fresh Fruitiful Frothies. People come here because they think it’s healthy and they’re saving the environment while they chomp their fast food. There are lots of framed pictures showing smiling indigenous peoples who are absolutely not being exploited by the corporate office. In the back is a Zen water fountain supposed to induce feelings of peace. Mostly it makes people have to go to the bathroom. New Agey chant music is piped through the speakers. Rug rats run around playing with their Buddha cow toys, making moo sounds and f**king up all my cleaning efforts.\u003c/p\u003e\n\u003cp\u003eLena summons me to the front over the mike. It’s her break time, and she is very, very serious about taking her break at the same time every shift. I take over the register just as Staci Johnson and her crew walk in. On the bell curve of high school humiliation, this rates the top grade.\u003c/p\u003e\n\u003cp\u003e“Lena,” I beg in a whisper. “Can you take this one for me, please?”\u003c/p\u003e\n\u003cp\u003e“Ha! Funny.” She holds up her Star Fighter graphic novel. “I’m on break.”\u003c/p\u003e\n\u003cp\u003e“Look, I’m sorry I was late—”\u003c/p\u003e\n\u003cp\u003e“That makes …” She counts heads. “Five of us.”\u003c/p\u003e\n\u003cp\u003e“Really, really sorry. It won’t happen again. Just please take this one.”\u003c/p\u003e\n\u003cp\u003eShe makes a show of drumming her fingers on her chin like she’s thinking hard. “Hmmm. Let me see. Um. No.”\u003c/p\u003e\n\u003cp\u003e“Lena. Please. Pretty please. I’ll be your best friend.”\u003c/p\u003e\n\u003cp\u003e“I have a best friend. Her name is LaKeesha. You’d know that if you ever paid attention to anyone else.”\u003c/p\u003e\n\u003cp\u003e“Okay. I’m a jerk. A self-involved jerk. But I swear, if you just take this one order, I will get the soy cheese from the walk-in for a week. Promise.”\u003c/p\u003e\n\u003cp\u003eFor a minute, I think she’s considering. Then she flips her book open to the ribbon-marked page. “Sorry. I’m at a good part. The fate of the universe hangs in the balance.” Lena shoves her card into the time clock. I hear the gunshot-hard click-punch of it seal my fate.\u003c/p\u003e\n\u003cp\u003e“Excuse me, could we get some help?” Staci calls out. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-14.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
