{"id":77131,"no":141,"title":"Page 141","content":"\u003cp\u003eI rush the stage. Security comes after me, but the guitar player blocks me with his body. “Here goes everything,” I shout, and hold the Calabi Yau to the speaker with both hands, shifting it into place. The sound that comes out nearly knocks me flat, and for a minute, I feel like I’m back in the Infinity Collider. It’s more than music; it’s a living thing, a portal into dimensions I’ve never even thought about. The music actually drifts high above our heads; I can see it swirling there—an aurora borealis of light and notes and vibrating strings. It drifts into the black hole, and the hole narrows bit by bit. The fire giants howl as the sonic waves push them back. Soon, people begin loosening their death grips on one another. They join hands and sing along. The fire giants grow smaller. With each note, they shrink down to pissant little flickers and then to smoke, which is pulled up into the swirling clouds. The hole is only a dot.\u003c/p\u003e\n\u003cp\u003eOnstage, the Copenhagen Interpretation has stopped playing. The singer looks up, says five words in English. “Shit. Here we go again.”\u003c/p\u003e\n\u003cp\u003eThat hole in the sky sucks them and the Calabi Yau toy right up and closes over. The clouds disperse. It’s an unearthly quiet. The concertgoers are dazed. Slowly, as people realize they’re okay, that we’re all still here, they whoop and hug each other in relief. Then they notice the empty stage.\u003c/p\u003e\n\u003cp\u003eI drop down into the crowd and help Gonzo up, and he helps Balder.\u003c/p\u003e\n\u003cp\u003e“What was that?” Gonzo asks when he finds his voice again.\u003c/p\u003e\n\u003cp\u003eI peer up at the hint of rainbow. “I think we might have just saved the universe.”\u003c/p\u003e\n\u003cp\u003eI look around for Dulcie, but she’s gone. I start to panic. What if she’s been sucked up, too? But then I see her in the crowd, pink and white.\u003c/p\u003e\n\u003cp\u003eI run to her.\u003c/p\u003e\n\u003cp\u003eCHAPTER FORTY-SIX\u003c/p\u003e\n\u003cp\u003eOf What Happens When Balder Has His Day at the Beach\u003c/p\u003e\n\u003cp\u003eAfter a fuel-up of convenience-store corn dogs and soda, we’re packed and ready to head out. Drew’s managed to fix the Caddy, but it looks tired. It’s coated in sand and road dust. Somebody has finger-written WASH ME across the back window. I wish it were coated in more dust. Every cop in Florida’s probably looking for that car now, and I just hope we can stay one step ahead of them.\u003c/p\u003e\n\u003cp\u003eGonzo’s wearing Drew’s I GOT CRABS AT JOE’S SURF \u0026amp; TURF T-shirt.\u003c/p\u003e\n\u003cp\u003e“Mohawk’s cool,” I say.\u003c/p\u003e\n\u003cp\u003eGonzo runs his hand over his head, watching Drew who’s letting Balder take his picture with the Party House in the background.\u003c/p\u003e\n\u003cp\u003e“Hey, you don’t have to come with me, you know,” I say. “If you wanna stay, ride out the rest of spring break, it’s cool.”\u003c/p\u003e\n\u003cp\u003e“He’s got my e-mail and cell and all that.”\u003c/p\u003e\n\u003cp\u003e“Seems like a cool guy,” I say.\u003c/p\u003e\n\u003cp\u003e“He is,” Gonzo says, and there’s a little sigh under it.\u003c/p\u003e\n\u003cp\u003e“You sure you don’t want to stay?”\u003c/p\u003e\n\u003cp\u003eGonzo elbows me in the side. I elbow him back. He elbows me again till I cry “Ow.”\u003c/p\u003e\n\u003cp\u003e“I said I’m riding shotgun, I’m riding shotgun,” he says.\u003c/p\u003e\n\u003cp\u003eI nod, and we stand there watching Balder bark out orders to Drew to crouch lower and lower, till I know his head will be nothing more than a small human icon down in the left-hand corner of the photo.\u003c/p\u003e\n\u003cp\u003eDulcie waves to me from behind a green station wagon. I slip away from the guys and go to her. “You coming along?”\u003c/p\u003e\n\u003cp\u003e“I’ll catch up,” she answers. When I look disappointed, she adds, “Don’t worry. I’ll be sticking close.”\u003c/p\u003e\n\u003cp\u003e“Because I’m a badass who saved the universe, princess?” I brace myself for the smackdown to come.\u003c/p\u003e\n\u003cp\u003e“Yeah.” She laughs and kisses me on the nose. “Something like that.”\u003c/p\u003e\n\u003cp\u003eI made a promise to Balder back on the cul-de-sac that we would get him to the ocean to search for Ringhorn so he could try to get back to his own world. I just didn’t know we’d be so short on time. My E-ticket meter is down to its last bar—Tomorrowland—and fading.\u003c/p\u003e\n\u003cp\u003e“Do not worry about me, Cameron. You must do what is right for your mission.” Balder’s expression is stoic.\u003c/p\u003e\n\u003cp\u003eGonzo gives him a little pat on the back. “You could stay with us, dude. I could teach you to play Captain Carnage.”\u003c/p\u003e\n\u003cp\u003e“Yes. Thank you,” Balder says, trying to smile.\u003c/p\u003e\n\u003cp\u003eBut I can see in Balder’s eyes that he’s homesick, and we’re by the beach right here, right now. “Who wants to play in the surf?” I ask.\u003c/p\u003e\n\u003cp\u003eBalder’s eyes light up. “But your mission, Cameron?”\u003c/p\u003e\n\u003cp\u003e“Can wait for a few hours,” I lie.\u003c/p\u003e\n\u003cp\u003e“When I am once again in the company of Odin and Freya, I shall tell them of the two bravest souls I ever met. Your names shall ring in the golden hall of the gods,” Balder says, sniffling a little. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-141.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
