{"id":77008,"no":15,"title":"Page 15","content":"\u003cp\u003eLena jerks her head in their direction. A smirk pulls at her lips. “Sucks to be you.”\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eResigned, I trudge over to the register, wondering if girls can smell your total fear, like wolves or very experienced serial killers.\u003c/p\u003e\n\u003cp\u003e“Hi, welcome to Buddha Burger. Can I take your order, please?” I say, pulling out a plastic tray and putting a one hundred percent recycled paper liner on it. I avoid eye contact by staring at the useless factoids: DNA, or deoxyribonucleic acid, is the genetic code that makes you uniquely you! Before they’re your cruelty-free burgers, Buddha Burger cows are raised with sunshine and happiness. That’s why they taste so moo-velously good! Recycling is good for the planet—and you and me. Let’s all get recycled!\u003c/p\u003e\n\u003cp\u003e“Excuse me?” one of the girls says, snapping her fingers to get my attention.\u003c/p\u003e\n\u003cp\u003eStaci Johnson and I are separated by a cash register and two feet of counter. “Wow. It’s Cameron Smith. I didn’t know you worked here.” Staci stifles a giggle. “Nice hat.”\u003c/p\u003e\n\u003cp\u003eHere’s a heaping plate of I Hate You. Would you like fries with that?\u003c/p\u003e\n\u003cp\u003eStaci \u0026amp; Co. change their order four times just to mess with me. They all want Fresh Fruitified Frothies, which are a pain to make. It’s February, girls. Order coffee. I’m at the blender for what seems like hours, developing carpal tunnel syndrome, or aggravating the carpal tunnel syndrome I’ve already brought on by frequent self-abuse, which I suppose I could cut back on. Then again, everyone needs a hobby. The Frothie-making must have been harder than I thought, because when I bring out the tray of drinks, my hands start to twitch and jerk. Every muscle in my arms is break dancing. I can’t hold on to the tray. It goes flying, splattering Staci in blueberry-strawberry-peach soy moo.\u003c/p\u003e\n\u003cp\u003eStaci lets out a little scream. “You did that on purpose, Cameron Smith.”\u003c/p\u003e\n\u003cp\u003e“I swear I didn’t,” I say. My left arm is still shaking. I use my right to hold it steady, which makes it look like I’m trying to hug myself.\u003c/p\u003e\n\u003cp\u003e“He totally did do it on purpose,” one of the wannabes says. She rips four or five eco-friendly napkins from the popup dispenser and hands them to Staci.\u003c/p\u003e\n\u003cp\u003e“God, he is such a freak,” Staci mutters just loud enough for everyone to hear. Even the ankle-biters in the joint have stopped running around screaming, more interested in the action going on up front.\u003c/p\u003e\n\u003cp\u003eMr. Babcock struts around the fry vats, hiking up his pants. “What seems to be the trouble?”\u003c/p\u003e\n\u003cp\u003e“He threw our Frothies at us.” Staci shows off her wet shirt.\u003c/p\u003e\n\u003cp\u003e“Cameron? Do you have a problem?” Mr. Babcock says, tearing his eyes away from Staci’s Frothie-drenched chest.\u003c/p\u003e\n\u003cp\u003e“No. It was an accident. I don’t know what happened. It’s like I lost control of my arms or something and—”\u003c/p\u003e\n\u003cp\u003eMr. Babcock holds up his silencing finger. “Never explain or blame, Mr. Smith. Ladies, at Buddha Burger, we take safety seriously. Your meal is on the house. Lena, could you retake these girls’ order?”\u003c/p\u003e\n\u003cp\u003eLena doesn’t look up from her graphic novel. “I’m on break. Fifteen minutes. By law.”\u003c/p\u003e\n\u003cp\u003eMr. Babcock sighs. “Fine. I’ll do it myself. Cameron, I’m gonna have to ask you to hand in your Buddha badge.”\u003c/p\u003e\n\u003cp\u003eEvery pair of eyes is on me as I hand over my Meditating Buddha Cow pin and hat. Only one person isn’t watching. A bronzy girl with pink hair in the far corner eating a Buddha’s Bounty Hot Fudge Sundae. She’s all lit up from the afternoon sun. And she has wings. No, that’s … ohmygodyes! There they are—white, fluffy, big-assed wings tucked behind her back. No, dude, that can’t be right. People do not have wings.\u003c/p\u003e\n\u003cp\u003e“Cameron?”\u003c/p\u003e\n\u003cp\u003e“Huh?” I say, turning back to Mr. Babcock.\u003c/p\u003e\n\u003cp\u003e“Take your things and leave now. Don’t forget to clock out.”\u003c/p\u003e\n\u003cp\u003eStaci and crew form a little huddle. They make it seem like they’re trying not to laugh, but really, they’re enjoying the show. And when I turn back to look at the table in the far corner, it’s empty.\u003c/p\u003e\n\u003cp\u003eCHAPTER SEVEN\u003c/p\u003e\n\u003cp\u003eIn Which I Am Subjected to the Slings and Arrows of Dinner with My Family\u003c/p\u003e\n\u003cp\u003e“I thought maybe we could all go to Luigi’s for an early dinner tonight,” Dad announces. He makes these announcements periodically, the “let’s act like a family” edicts. For all I know, he may make them a lot, but it’s rare that we’re all gathered in the same place at the same time to hear them. We’re like electrons both attracting and repelling each other.\u003c/p\u003e\n\u003cp\u003e“Sorry, Daddy. I can’t,” Jenna says. She bothers to sound apologetic. “I’m going to the movies with Chet and everybody.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-15.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
