{"id":77012,"no":19,"title":"Page 19","content":"\u003cp\u003eMrs. Rector’s mouth hangs open. Mr. Glass, for once, is speechless. Somebody gasps, “Oh my God.”\u003c/p\u003e\n\u003cp\u003eMr. Glass’s mouth snaps back into a tight line. “Mr. Smith, you will leave the classroom.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I … aaaaahhhh!” My body’s on fire with pain. “Goddammit!”\u003c/p\u003e\n\u003cp\u003eMrs. Rector points to the door with dramatic flair. “Leave. My. Classroom. Now.”\u003c/p\u003e\n\u003cp\u003e“It’s okay, Señora Rector,” Stoner Kevin says. “Cameron’s cool. He just ate some wicked mushrooms, that’s all.”\u003c/p\u003e\n\u003cp\u003eYeah, thanks for that, Kev. I try to grab my backpack, but it’s like my muscles are from another planet, jerking and twitching in a bad robot dance that gets more snickering from the class.\u003c/p\u003e\n\u003cp\u003eMrs. Rector’s voice takes on that I’m-above-it-all tone. “I’ve had quite enough. Could someone please escort Mr. Smith to Principal Hendricks’s office?”\u003c/p\u003e\n\u003cp\u003e“Sure thing, Mrs. Rector.” Chet King gets out of his seat and towers over me. “Come on, bro. You’re not being funny anymore.”\u003c/p\u003e\n\u003cp\u003eOn an ordinary day I would hate Chet King both for his prison guard stance and for calling me “bro.” But this is not an ordinary day, and all I can feel is totally freaked out that my body isn’t getting any of my brain’s frantic commands to move. His hand lands on my arm, and it’s like a burn.\u003c/p\u003e\n\u003cp\u003e“Ahh, shit!” I scream. My spastic arm flies out and whacks Chet in the gut. He’s a big guy, but the punch catches him off guard. His knees hit the floor, followed quickly by the rest of him. The jocks are on me at once. Every touch feels like it’s connecting with raw nerve endings. I’m vaguely aware that I’m screaming things that are “inappropriate to a peaceful classroom environment.”\u003c/p\u003e\n\u003cp\u003eI guess that’s why Chet finally hauls off and socks me.\u003c/p\u003e\n\u003cp\u003eThe Calhoun High School behavior code sheet we all have to sign at the beginning of the year is pretty firm about the dos and don’ts of personal conduct. Punching beloved football players in the stomach is definitely a don’t. I’m suspended for five days for unruly behavior and, thanks to Kevin, suspicion of drug use.\u003c/p\u003e\n\u003cp\u003eMom has to come pick me up in the Turdmobile. She’s so mortified and, knowing Mom, worried, that we drive in total silence—total silence being the parental barometer of just how screwed you are. But the real fun is yet to come. There’s the phone call to Dad, which results in his early arrival home (sorry, Raina), which leads to a closed-door discussion, which takes us to the four of us sitting in the family room: Mom, Dad, me, and the disappointment. It’s like I’m a camera cutting from close-ups of Mom—worried, vaguely detached, certain this is all a reflection on her uncertain mothering—and Dad—tight, controlled, pissed off, determined to fix things.\u003c/p\u003e\n\u003cp\u003eMom: We just want to know if you have a problem, Cameron.\u003c/p\u003e\n\u003cp\u003eDad: It’s obvious he has a problem, Mary. That’s not the issue.\u003c/p\u003e\n\u003cp\u003eMom: Well …\u003c/p\u003e\n\u003cp\u003eDad: What are you on, Cameron? Did you think it would be funny to get expelled like that?\u003c/p\u003e\n\u003cp\u003eMom: Is it marijuana, honey? Did you get some bad pot?\u003c/p\u003e\n\u003cp\u003eDad: When colleges look at your transcript now, do you think they’re going to be putting out the welcome mat? Jesus, we’ll be lucky to get you into community college.\u003c/p\u003e\n\u003cp\u003eMom: Honey, you’re not sniffing glue or anything like that, are you? Please. Because that stuff can rot your brain.\u003c/p\u003e\n\u003cp\u003eDad: And punching a kid in the stomach? That’s great. Just great.\u003c/p\u003e\n\u003cp\u003eMom: Oh God. It’s not meth, is it? I saw a special on that. People had to have their noses reconstructed.\u003c/p\u003e\n\u003cp\u003eThe camera cuts to a close-up of teen boy as he debates whether to tell his parents the truth, as he weighs whether they will believe him or not.\u003c/p\u003e\n\u003cp\u003eMe: Mom. Dad. I’m not on drugs. I just—\u003c/p\u003e\n\u003cp\u003eCut to wide shot.\u003c/p\u003e\n\u003cp\u003eMom: Is this why you got fired from Buddha Burger? Because you were doing drugs? Honey, you have to be careful when you’re working with hot oil.\u003c/p\u003e\n\u003cp\u003eDad: Mary. Please.\u003c/p\u003e\n\u003cp\u003eMom: I just wanted to know.\u003c/p\u003e\n\u003cp\u003eDad: It’s beside the point.\u003c/p\u003e\n\u003cp\u003eMom plays with her artsy earrings. Her hair needs a dye job. The roots are frizzy and gray.\u003c/p\u003e\n\u003cp\u003eMe: I don’t know what happened. I felt sick, okay?\u003c/p\u003e\n\u003cp\u003eDad: So you started cursing and punched a classmate. Cameron, that doesn’t make sense.\u003c/p\u003e\n\u003cp\u003eMedium shot of teen boy as he struggles with what to say. It has been too long since he has tried to communicate with his parents, and it’s like they are on the other side of the ocean, speaking a different language. Cut to Mom.\u003c/p\u003e\n\u003cp\u003eMom: Maybe he needs to talk to a therapist, Frank? \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-19.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
