{"id":77015,"no":22,"title":"Page 22","content":"\u003cp\u003e“Nowhere.”\u003c/p\u003e\n\u003cp\u003e“Still? That’s not right.” He takes a good look at me. “You look worn, my friend. Zombified.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Thanks.”\u003c/p\u003e\n\u003cp\u003e“Got no color. You need to get out. Experience things. Play music. Fall in love.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m on it. Night and day,” I say, flipping through a bin of novelty records.\u003c/p\u003e\n\u003cp\u003e“Why you giving me that smart-ass shit? I’m serious,” Eubie says. “Life is short, my friend.”\u003c/p\u003e\n\u003cp\u003e“So they say. Got anything new for me?”\u003c/p\u003e\n\u003cp\u003eEubie puts his hands on the counter and leans forward. “No,” he says. “Unless you want to borrow that Junior Webster record.”\u003c/p\u003e\n\u003cp\u003e“Maybe some other time.”\u003c/p\u003e\n\u003cp\u003e“All right. Not gonna push you. But you missing out. Hey, ch-ch-check it out,” Eubie says, waving a travel itinerary at me. “Got me two tickets to New Orleans for Mardi Gras.”\u003c/p\u003e\n\u003cp\u003e“Who’s the other ticket for?”\u003c/p\u003e\n\u003cp\u003eEubie puts a hand to his chest and staggers backward in mock shock. “Cam-run? Did you just ask a personal question? Did you express an interest in your fellow man, in someone other than your own miserable self? Lord, Jesus! It’s a miracle—that’s what it is!”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah,” I say, pretending it doesn’t bother me. I’m interested in other people. I’m interested in having sex with Staci Johnson. That’s a form of interest.\u003c/p\u003e\n\u003cp\u003e“I’m taking my new lady,” Eubie says, kissing the tickets. “Misty Deanna. Miss D.”\u003c/p\u003e\n\u003cp\u003eI wipe a hand across the back of my neck. I’m sweating and clammy at the same time. “Sounds like a\u0026nbsp; p**n\u0026nbsp; name. Or a drag queen.”\u003c/p\u003e\n\u003cp\u003eEubie holds up a finger. “Don’t start. You got plans tonight?”\u003c/p\u003e\n\u003cp\u003eI shrug.\u003c/p\u003e\n\u003cp\u003e“What’s that mean?”\u003c/p\u003e\n\u003cp\u003eNothing. That’s the glory of a shrug. Totally noncommittal.\u003c/p\u003e\n\u003cp\u003e“There’s a sweet show going down at Buddy’s. Jazz. Some tight cats. I’m sitting in. You want to come? I’ll put you on the list as my guest.”\u003c/p\u003e\n\u003cp\u003e“Nah, thanks. I got stuff I gotta do.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. Like what?”\u003c/p\u003e\n\u003cp\u003e“You know. Stuff.”\u003c/p\u003e\n\u003cp\u003e“Okay, Mr. I Don’t Go Nowhere I Don’t Ever Try Nothin’. But you’re missing a hot show.”\u003c/p\u003e\n\u003cp\u003e“Next time,” I say.\u003c/p\u003e\n\u003cp\u003e“Yeah. Next time,” Eubie says, rolling his eyes.\u003c/p\u003e\n\u003cp\u003eI leave with some blank CDs so I can make copies of my Tremolo LPs. By the time I finish the other half of my J, the streetlights have all twinkled into action. The weed is most excellent, and I’ve copped one hell of a serious buzz that makes everything, including me, seem like it’s both wave and particle. I pedal past campus housing, hopping my bike between street and sidewalk, ignoring stop signs and dodging traffic lights. At the last corner of Mambrino Street, a truck-load of drunken college guys careens around a corner, nearly wiping me out.\u003c/p\u003e\n\u003cp\u003e“What’s your problem?” One of the guys is yelling at me, but mostly I hear my heart beating like a mofo in my ears. They hurl insults and empty beer cans.\u003c/p\u003e\n\u003cp\u003e“Get out of the road, dude!” somebody shouts before they peel away chanting, “Par-ty! Par-ty! Par-ty!”\u003c/p\u003e\n\u003cp\u003eI’m too altered for in-town cycling, so instead, I shoot off onto an old country road that winds past cow pastures and lonely farms. The route’s longer but there’s less traffic, and I can enjoy my buzz in peace. The road’s bordered on both sides by flat, open fields dotted by bales of cotton. The long white rectangles remind me of those newspaper pictures of soldiers’ coffins unloaded from army planes.\u003c/p\u003e\n\u003cp\u003eI stop pedaling and enjoy the feel of the damp wind on my face. It’s going to rain, but I don’t mind. It’s like I’m the only person in the universe right now. Soft rain pecks at my face. I stick out my tongue and taste it.\u003c/p\u003e\n\u003cp\u003eThe wind picks up and pushes harder. Over the cotton fields, the clouds are thickening into a mean gray clump. They’re moving really fast. It’s as if they’re being pulled into the center of the sky by a huge invisible magnet. Seeing it makes my heart double its beat. Suddenly, I don’t want to be out here by myself. It’s about a half-mile to the turnoff that leads back to my house. I’m out of the seat, pumping hard as I can, putting my full weight into each pedal stroke.\u003c/p\u003e\n\u003cp\u003eThat dark cloud mass starts swirling. Tornado, I think. Shit. But it’s weird, because the clouds aren’t pushing out and down; they’re pulling in. There’s a boom of thunder, a zigzag of electricity, and a small, dark hole opens up in the murky center of those clouds, a black eye giving off no light at all. The rest of the sky crackles like a laser light show. A neon spear of lightning strikes a small tree close to the road. With a huge pop, the tree explodes in a shower of flames. I’m startled and lose my balance. My bike skids out and away, and I roll on the gravel, thudding my head against the road. With a hiss, I sit up. My vision’s blurry. The horizon’s doubling. My head aches and my knee’s bleeding. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-22.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
