{"id":77025,"no":32,"title":"Page 32","content":"\u003cp\u003eThe old lady’s lungs rebel. Long, coughing spasms rattle her frail frame.\u003c/p\u003e\n\u003cp\u003e“See? Gotta get you well. Back to bed, Mrs. M,” the orderly says, taking her arm.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I tell the orderly. “She can stay. Really!”\u003c/p\u003e\n\u003cp\u003e“Tell them they’ve got it wrong,” she hisses between coughs as he leads her gently away. “A house by the sea. Tell them!”\u003c/p\u003e\n\u003cp\u003eI fall asleep, but my dreams are full of bad things—fires engulfing the world. A black hole opening above us, pulling everything in without a trace, as if we never even existed. Diseased cattle falling in the fields like gassed soldiers in some long-ago war. The angel in the tarnished armor banging her hands against a window while flecks of snow coat her lashes and hair. I wake up with my heart pounding, unsure of where I am or what’s happened, whether I dreamed the conversation with the old lady.\u003c/p\u003e\n\u003cp\u003eA house by the sea. I’d like to be there now. And I wish there were a button I could press that would get me out of here, that could make this all go away.\u003c/p\u003e\n\u003cp\u003eDAY THIRTEEN\u003c/p\u003e\n\u003cp\u003eGlory’s been off for two days. Today she’s back in her pink scrubs that look good against the dark of her skin. I’m not feeling so great. Sometimes I think I see the punker angel sitting in the corner of the room, reading a comic book with the ill-fated coyote on the cover, an anvil racing for his head. But when I mentioned it to Mom, her eyes got teary, and I haven’t said a word about strange angel sightings since.\u003c/p\u003e\n\u003cp\u003e“Time for your meds,” Glory announces in her no-fanfare way.\u003c/p\u003e\n\u003cp\u003eI wash them down even though they’re getting hard to swallow. My body seems like it’s failing me by degrees.\u003c/p\u003e\n\u003cp\u003e“Okay,” Glory says, once my vital signs have been recorded for posterity. “You need anything else?”\u003c/p\u003e\n\u003cp\u003e“No,” I say, watching her push the cart toward the door. “Yes.”\u003c/p\u003e\n\u003cp\u003eGlory stops, looks at me. There’s no “What is it, sweetheart?” or “Oh, my poor brave bunny.” Nope. She just stands, waiting. And I can tell she’s even a little annoyed. Kind of makes me like her. We speak the same language.\u003c/p\u003e\n\u003cp\u003e“Am I going to get better?”\u003c/p\u003e\n\u003cp\u003eGlory’s ramrod body softens for a minute. “You got to ask your doctor that, Cameron.” I like the way she says my name, like it has three syllables instead of two.\u003c/p\u003e\n\u003cp\u003e“It’s just … nobody tells me anything, you know?”\u003c/p\u003e\n\u003cp\u003eGlory glances toward the hallway, where she has charts to file and patients to check. “That’s cause nobody knows not’ing about how it all works out or why. Why God takes the good or the young or why we suffer. I don’t know why he took my little girl with the cancer when she was only five.” She takes a deep breath, like the pain is still fresh. “I don’t know and I guess I never will.”\u003c/p\u003e\n\u003cp\u003eAll the air has left my lungs. I feel like I should say something, but somehow I don’t think Glory’s the I-want-your-sympathy type.\u003c/p\u003e\n\u003cp\u003e“Just push the button if you need something,” she says, a little softer this time.\u003c/p\u003e\n\u003cp\u003eDAY FIFTEEN\u003c/p\u003e\n\u003cp\u003eChet King’s come for a visit. Even though CJ isn’t really contagious, he’s decked out in full protective gear—white paper gown, mask, and gloves—like a giant medical paranoia snowman or some eccentric pop star addicted to bizarre fashion choices. He raises one hand, and it reminds me of those good luck pandas you see in Chinese restaurants.\u003c/p\u003e\n\u003cp\u003e“Hey there, champ,” he says at last. “Jenna asked me to stop by. Not that I didn’t want to come, you know …” His voice is muffled behind the mask. “Hey! Did you hear? The coaches are letting us dedicate this week’s all-star game to you. Everybody’s praying for you, bro.”\u003c/p\u003e\n\u003cp\u003eI up the volume a bit on the TV. Wouldn’t want to miss a scintillating second of my soaps. Chet clears his throat. “So, uh, how are you doing?” “Good, except for that pesky dying thing.” “That’s sort of what I wanted to talk to you about today.” Chet sounds so serious I actually hit the Mute button. “You know, Cameron, no one ever really dies. Not if they’ve accepted Jesus Christ as their lord and savior.”\u003c/p\u003e\n\u003cp\u003eChet drops to his knees by my bedside and, with a prayer for protection from my noncontagious disease, takes my hand in his massive gloved one, which is, holy shit, like some kind of freaking paw. How come I don’t have manly hands like that? If there is reincarnation on tap somewhere, I’m putting in for big hands.\u003c/p\u003e\n\u003cp\u003e“Lord, I pray that you will lift the fear from Cameron’s mind and forgive him his sins. In the name of your son, our savior, Jesus Christ, Amen. Cam,” Chet says in a low church voice. “You have anything you wanna add?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-32.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
