{"id":77027,"no":34,"title":"Page 34","content":"\u003cp\u003eA quick-cut montage of images set to a Copenhagen Interpretation sound track zips across the screen: a blurred shot of the four band members covered head to toe in heavy coats and hoods, like Antarctic explorers; another blurry image of them in the same outfits playing some festival; another indistinct photo of them in the snow.\u003c/p\u003e\n\u003cp\u003e“And then, one day, at the height of their fame,” Parker’s voice continues as the screen fades to black, “they were simply … gone. In the middle of the Big Benefit Concert for Peace but Against Non-Peace and People Generally Being Not Nice, in the middle of what everyone agreed was a bitchin’ set, they simply vanished. Were they the victims of foul play? Had they grown weary of fame? Were they aliens visiting from a musically advanced planet? Or, as some suggest, had they eaten each other in a drug-induced, hate-fueled orgy of excess—the dark side of celebrity? When we come back, we’ll explore. …”\u003c/p\u003e\n\u003cp\u003eThat’s all I can take of that. Flip to the news. A shellacked anchorman giving the daily grim. Teenaged soldiers carrying guns. Bombed marketplaces tattooed with blood. Crying villagers. Melting ice caps, confused polar bears. Kneeling guys in black hoods behind razor wire. A wildfire in another state. Guys watching it burn, the fire reflected in the mirrored lenses of their sunglasses. Jeez, someone needs to push the reset button on this planet.\u003c/p\u003e\n\u003cp\u003eThe anchorman smiles and they cut to a cute story about a Captain Carnage championship going down.\u003c/p\u003e\n\u003cp\u003eNIGHT\u003c/p\u003e\n\u003cp\u003eI can’t breathe.\u003c/p\u003e\n\u003cp\u003eShit. My lungs. Tight. Can’t take in. More. Than a gasp. Of air. Pain.\u003c/p\u003e\n\u003cp\u003eDad. Getting up. Scared. “Cameron? Cameron!”\u003c/p\u003e\n\u003cp\u003eCan’t say his name. Can’t ask for. Help. No air. Dad’s eyes. So scared. Running out. Shouting.\u003c/p\u003e\n\u003cp\u003eDad. Back. Glory, too, and. Some guy in green. Pulling a cart. Serious machine.\u003c/p\u003e\n\u003cp\u003eGlory. Snapping on. Gloves. Lightning quick. “Okay, baby, hold real still for me.”\u003c/p\u003e\n\u003cp\u003eShe’s never. Shit. Never called me. Baby. Guy in green. Plastic tubing. More people running. Body seizing. Shaking. Can’t. Can’t stop.\u003c/p\u003e\n\u003cp\u003e“Gotta get him tubed,” Glory barks. “Give him that shot, now.”\u003c/p\u003e\n\u003cp\u003eArms. Holding me. Down. Roll to side. Pain. My hip. Shot going in. Medicine. Hot like fire.\u003c/p\u003e\n\u003cp\u003eBreathe, Cameron.\u003c/p\u003e\n\u003cp\u003eGlory’s face. Determined. Grim. “Hold him good.” Fingers. Opening my mouth. Tube. Coming in. Oh f**k. Snaky plastic. Too much. Makes me choke. Want to. Scream. Gagging. Choking. My heart. Frantic general. Screaming. “The hell’s going on out there? Report, soldier, report!”\u003c/p\u003e\n\u003cp\u003eStop. Can’t. Stop. Shaking. All over. Panic. Like a wave. Taking me. Under.\u003c/p\u003e\n\u003cp\u003eGlory. Near. “Easy, easy, it’s okay, baby, don’t fight it, just a minute and it’ll all be over.”\u003c/p\u003e\n\u003cp\u003eScared. So scared. Make it stop. Must stay. Awake. Fight. The old lady said.\u003c/p\u003e\n\u003cp\u003eFocus. Picture. On the wall. Angel.\u003c/p\u003e\n\u003cp\u003eMeds. Make my head. Heavy. Then light.\u003c/p\u003e\n\u003cp\u003eThe picture. The angel. Focus. See.\u003c/p\u003e\n\u003cp\u003eWings. Move. Flutter.\u003c/p\u003e\n\u003cp\u003eLike snow.\u003c/p\u003e\n\u003cp\u003eFalling.\u003c/p\u003e\n\u003cp\u003eCHAPTER FOURTEEN\u003c/p\u003e\n\u003cp\u003eIn Which I Wake Up\u003c/p\u003e\n\u003cp\u003eWhite.\u003c/p\u003e\n\u003cp\u003eAll I see is white.\u003c/p\u003e\n\u003cp\u003eBlink.\u003c/p\u003e\n\u003cp\u003eWhite.\u003c/p\u003e\n\u003cp\u003eBlink, blink.\u003c/p\u003e\n\u003cp\u003eWhite, white.\u003c/p\u003e\n\u003cp\u003eThe white has little pockmarks, like the surface of the moon.\u003c/p\u003e\n\u003cp\u003eBlink again, and the spongy square tiles of the hospital ceiling come into focus. The hospital. I’m still here? What if I’m not? I’m afraid to look. Okay. Take this slowly. Slide eyes to the left. Window and a wall radiator. Eyes to the right. Visitor chairs. Mom and Dad. Sleeping.\u003c/p\u003e\n\u003cp\u003eMom and Dad. Still here. All still here.\u003c/p\u003e\n\u003cp\u003eThank you.\u003c/p\u003e\n\u003cp\u003eIt’s night when I wake again. The first thing I notice is that there’s no tube in my throat anymore. It’s sore and dry, though. Like I’ve been eating gravel for two days straight.\u003c/p\u003e\n\u003cp\u003e“You awake?”\u003c/p\u003e\n\u003cp\u003eA new face appears above my head. I shriek, surprised by the sound of my own scratchy voice.\u003c/p\u003e\n\u003cp\u003e“Oh, sorry, dude. I thought you were awake.”\u003c/p\u003e\n\u003cp\u003eI close my eyes and silently will the hallucination to go away. When I open them again, his face is still next to mine.\u003c/p\u003e\n\u003cp\u003e“You okay, amigo?”\u003c/p\u003e\n\u003cp\u003eI try to talk but my throat is sore and dry. “Could you. Water. Please?”\u003c/p\u003e\n\u003cp\u003e“Oh. Sure. No problem, dude.”\u003c/p\u003e\n\u003cp\u003eIn about three seconds, there’s a cup in my hand. I take a few sips and feel my throat balloon with each one. Better. “Thanks. Sorry if I scared you. It’s just … I thought I might have, um, died. Or something.”\u003c/p\u003e\n\u003cp\u003e“Yeah, no kidding. I was a little freaked out about it myself,” he says. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-34.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
