{"id":77032,"no":39,"title":"Page 39","content":"\u003cp\u003eI stare at it. It’s just a green ticket in a bracelet around my wrist. “And this would protect me … how?”\u003c/p\u003e\n\u003cp\u003eShe licks the rest of the pudding spoon clean and drops it on the tray. “Sorry. That is top-secret angel info.”\u003c/p\u003e\n\u003cp\u003eAll the hope I’d felt vanishes. In a minute, I’ll wake up. I’ll wake up and it will be another day in which I’m living a dream of dying slowly, a dream I hope I’ll wake up from, on and on till it’s over.\u003c/p\u003e\n\u003cp\u003e“Okay, you know what? I’m clearly having some kind of pain-meds-induced hallucination, and I’m sure you’re a very nice hallucination with a supergreat, nonreal personality, but I’m going to go back to sleep now, and when I wake up, you’ll be gone.”\u003c/p\u003e\n\u003cp\u003eShe puts her hand on mine, and it’s as soft as her wings. “Cameron, we’ve exhausted every other option.”\u003c/p\u003e\n\u003cp\u003e“You still haven’t told me who ‘we’ is!”\u003c/p\u003e\n\u003cp\u003eShe sucks air through her teeth, nods. “Yeah. I know. Cameron, you’re our last best hope. I’m asking you to save the world, cowboy.”\u003c/p\u003e\n\u003cp\u003e“Wait,” I say, pushing myself up again. “That’s a line from Star Fighter.”\u003c/p\u003e\n\u003cp\u003eShe gives me that big goofy grin. “Yeah! I couldn’t resist. Great movies, right? Well, the early ones. The later ones … ehhh. Oh. Almost forgot. There’s just one more thing,” she says, biting her lip. “You need to take Gonzo with you.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You need a pal on this trip. Everybody needs a friend.”\u003c/p\u003e\n\u003cp\u003eI drop back against the pillow, fold my arms over my chest. “Not me. I travel solo or not at all.”\u003c/p\u003e\n\u003cp\u003eHer eyes crinkle. “Now who’s quoting Star Fighter?” She deepens her voice, swaggers. “‘Not me, princess. I travel solo or not at all.’ Right. Not the point. The point is, you’re gonna need a mate, a pal, a sidekick and coconspirator. And frankly, Gonzo could use a little help, too. I mean, look at him.”\u003c/p\u003e\n\u003cp\u003eShe parts the curtain a crack. Gonzo’s asleep, mouth open, snoring slightly, a Captain Carnage video game guide crumpled under his chin.\u003c/p\u003e\n\u003cp\u003e“You’d be providing a valuable public service,” Dulcie says.\u003c/p\u003e\n\u003cp\u003e“No, no, and no.” I tick off the reasons this is a bad idea. “One, he’s a compulsive talker. Two, he calls his mom, like, five times a day. Three, he snores. Four, he’s completely phobic and thinks everything’s going to kill him.”\u003c/p\u003e\n\u003cp\u003eDulcie shrugs. “Nobody’s perfect.”\u003c/p\u003e\n\u003cp\u003e“The other day he said there are chemicals used in the processing of toilet paper that can give you rectal cancer. So now he’s bringing his secret stash of special recycled toilet tissue in with him in the mornings. He will never say yes.”\u003c/p\u003e\n\u003cp\u003e“You won’t know until you ask. Besides, his fate is tied to yours. Everything’s connected.”\u003c/p\u003e\n\u003cp\u003e“There’s no such thing as fate.”\u003c/p\u003e\n\u003cp\u003e“Except for random fate.”\u003c/p\u003e\n\u003cp\u003e“That’s … insane.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” She grins. “Insanity. Brilliance. Such a tough call. Look, Cameron, I’m just a messenger. I don’t know everything. But I do know this: you’re being given a chance. Take it and you might live. Stay here and you will surely die.” Dulcie cuddles Mr. Bubbles Kitty, fluffing him with her fingers. “Whaddaya say—you, Gonzo, connecting the dots, finding Dr. X, getting a cure, saving the universe? You down, cowboy?”\u003c/p\u003e\n\u003cp\u003eMy head hurts; it’s almost time for my pain meds. Where’s Glory? I want to check out for a while. Not think or feel. I roll onto my side, away from her. “I’ll think about it.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Dulcie reaches over me and tucks the cat into the crook of my arm. “But Cameron? Don’t think about it too long.”\u003c/p\u003e\n\u003cp\u003eNIGHT\u003c/p\u003e\n\u003cp\u003eMom and Dad and Jenna are here, camped around me. They’re all watching some stupid episode of an even stupider show on YA! TV called What’s Your Category? where kids have to answer questions to prove they know more than anybody else does about a particular stupid topic, and if they get too many wrong, they’re dunked in a stinking pool of mystery yuck.\u003c/p\u003e\n\u003cp\u003e“Dude,” Gonzo whispers without taking his eyes off the TV. “You ever watch I Double Dog Dare You?”\u003c/p\u003e\n\u003cp\u003eI shake my head. It throbs, and I can’t help thinking about what Dulcie said, about those prions attacking my brain being some mysterious agent from another world. It would be so nice to blot this all out with a big fat dose of pain meds, but I can’t have any for another hour, according to Glory, who was here … when? I don’t know. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-39.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
