{"id":77036,"no":43,"title":"Page 43","content":"\u003cp\u003eA hollowed-out, gray-skinned dude who smells like pee sits next to us. It’s the same guy I saw in the parking lot the night we went to Luigi’s. He’s still wearing his tinfoil hat. “What are you boys doing?”\u003c/p\u003e\n\u003cp\u003e“Saving the world,” Gonzo says, scooting away.\u003c/p\u003e\n\u003cp\u003e“Ah. Good. It’s going to end, you know. It’s all going to shit. That’s why I got me one of these.” He points to his wrinkled silvery cap.\u003c/p\u003e\n\u003cp\u003e“Hank, you need to let these boys be, now.” The guy with the mop has reached us.\u003c/p\u003e\n\u003cp\u003e“Piss off,” the old guy snaps. He takes out a bag and inspects the things inside.\u003c/p\u003e\n\u003cp\u003e“’Scuse me,” the janitor says. “Could you lift yer feet, please? I need to get that spot.”\u003c/p\u003e\n\u003cp\u003eDutifully, Gonz and I raise our legs, drawbridge style, and he mops underneath.\u003c/p\u003e\n\u003cp\u003e“Dude, there’s no bus tonight,” Gonzo says. “Give it up.”\u003c/p\u003e\n\u003cp\u003eThe old homeless guy stops rummaging through his bag. “Yes there is. There is one! It’s downstairs waiting.”\u003c/p\u003e\n\u003cp\u003eI look to Mop Guy for confirmation. He stops long enough to wipe his sweaty brow with his arm. “Well, there is one tonight, but it ain’t on the regular schedule. It’s private. The Fleur-de-Lys.”\u003c/p\u003e\n\u003cp\u003e“That sounds like a\u0026nbsp; p**n\u0026nbsp; thing,” Gonzo whispers nervously. “Does that sound\u0026nbsp; p**n y to you?”\u003c/p\u003e\n\u003cp\u003eI ignore him. “Where’s it go?”\u003c/p\u003e\n\u003cp\u003e“Where you think it goes?” the homeless guy says. “New Orleans. That there’s the Mardi Gras bus, son. It’s Mardi Gras time.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“You welcome,” he says. “Might as well have fun before it all ends.”\u003c/p\u003e\n\u003cp\u003e“Gonz,” I say, digging in my pocket for cash. “How do you feel about New Orleans?”\u003c/p\u003e\n\u003cp\u003e“What? You don’t know for sure that’s the right bus.”\u003c/p\u003e\n\u003cp\u003e“No. I don’t. But it’s the only bus. Look, I know this seems a little half-assed …”\u003c/p\u003e\n\u003cp\u003e“No, dude. I’d be thrilled if this plan were half-assed. This is, like, no-assed.”\u003c/p\u003e\n\u003cp\u003e“You’re right. It’s the most no-assed thing I’ve ever done in my life. So am I getting two tickets or one?”\u003c/p\u003e\n\u003cp\u003eGonzo rubs his inhaler pump like a talisman. “All right. I’m in. But if we don’t find this Dr. X in New Orleans and see what he’s got for me, I’m on the first bus back.”\u003c/p\u003e\n\u003cp\u003e“Fair enough.”\u003c/p\u003e\n\u003cp\u003eI open up my wallet. My credit card, the one my dad gave me to teach me fiscal responsibility, is still there. I’ve got a whopping credit limit of five hundred and fifty dollars.\u003c/p\u003e\n\u003cp\u003eI run to the window and rap on the bulletproof glass. The clerk barely looks up. “Yup?”\u003c/p\u003e\n\u003cp\u003e“How much for two tickets on the Fleur-de-Lys?”\u003c/p\u003e\n\u003cp\u003eWith a sigh, the clerk puts his book down. “That’ll be two hundred seventy-eight dollars and fifty-two cents with tax,” he says.\u003c/p\u003e\n\u003cp\u003eHe processes the charge and hands us two tickets, and Gonzo and I race for the last bus of the night.\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHTEEN\u003c/p\u003e\n\u003cp\u003eIn Which We Make a Stop in New Orleans and Gonzo Refuses to Eat Fish, Annoying the Crap out of Me and Our Waitress\u003c/p\u003e\n\u003cp\u003eI mostly sleep on the trip from Texas to New Orleans. Occasionally I open drowsy eyes and catch dreamlike glimpses of the world. Gas stations hawking plastic cups with every fill-up. Cram-packed strip malls featuring the same stores and restaurants. Skeletal dogs picking through trash. Litter-strewn marshes. Crumbling roads snaking under half-finished highways. Factories belching toxic smoke clouds. I take it all in, and for a second, I wonder whether this planet is worth saving. Close to morning, I wake up long enough to see that we’re crossing over some ginormous bridge that seems to stretch out forever. We’re surrounded by water. It’s sort of cool, like I’m floating.\u003c/p\u003e\n\u003cp\u003e“Lake Pontchartrain Causeway,” the lady across the aisle says. She’s wearing a WORLD’S BEST GRANDMA T-shirt, and under her flowered skirt she has on panty-hose support socks that only come up to her knobby knees. She offers me some of her peanuts. I decline, and she puts them away, pulling out a long thin cigarette that she tucks over the top of her ear. “You got family in Nu’walins?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Ever been there?”\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“Well, it’s a mighty special place. Or was. What they let get done to it …” She shakes her head. “But we survive, we survive.” She starts singing a little bit of a song to herself. It sounds old and sad and promises a better day. “Law, I hope we get there soon. I can’t wait to have me a smoke. They say smoking kills you, but I been smoking my whole life and I’m healthy as a horse.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-43.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
