{"id":77037,"no":44,"title":"Page 44","content":"\u003cp\u003eCoughing hard, she turns a matchbook over and over between her fingers, working it like a worry stone. The image on it is familiar, and I c**k my head to get a better look. It’s the cover of the Junior Webster album Eubie showed me.\u003c/p\u003e\n\u003cp\u003e“You heard of the Horn and Ivory Club?” the old lady asks, holding up the book of matches.\u003c/p\u003e\n\u003cp\u003e“No,” I lie. I don’t really want to get drawn into a conversation.\u003c/p\u003e\n\u003cp\u003e“Good place. Here. You take these, honey.” She puts the matches in my hand.\u003c/p\u003e\n\u003cp\u003e“That’s okay.” I try to give them back.\u003c/p\u003e\n\u003cp\u003e“No. Go on and take it. Souvenir of your first trip to the Big Easy. You never know when they might come in handy.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” These matches look ancient. They probably can’t light anything for shit. On the flip side the cover reads The Horn \u0026amp; Ivory Club, 141 N. Rampart Street, with a telephone number that starts with letters. I put them in my pocket, lay my head against the seat back, and stare out the window at that bridge that just keeps going on. After a minute, the lady starts to sing her song again, lulling me to sleep.\u003c/p\u003e\n\u003cp\u003eWe roll into the city about dinnertime. The skyline glitters under a hazy, late-afternoon sun. New Orleans looks as if it’s just appeared out of the water like a myth, a modern Atlantis that shouldn’t exist. The bus hisses into the depot, which is as desolate and dirty as the one we’ve just left. Gonzo and I pour out onto the streets with the other pilgrims. Even though it’s late February, the air’s warm and sticky and a little aggressive—just another character in what promises to be a town full of them.\u003c/p\u003e\n\u003cp\u003eGonzo and I are starving, so we find a diner close to the depot. It’s a total tourist place with lots of fake alligators on the walls and Mardi Gras beads hanging from every hook. It’s noisy and crowded, too, this being Fat Tuesday. After a hellishly long wait, the hostess takes us to a tiny table near the back. The menu is huge and has about forty-eight different kinds of seafood specials on it. I make a quick decision and munch down on the saltines and butter they’ve got on the table. Gonzo’s still hidden behind the accordion door of his menu. His fingers tap nervously against it. A waitress with poufy blond hair puts two waters down in front of us. She has a charm bracelet with about a million charms that jangle when she moves. Around her neck is a cross necklace the size of Rhode Island.\u003c/p\u003e\n\u003cp\u003e“What can I get you fellas?” she asks, taking out a pad and pencil.\u003c/p\u003e\n\u003cp\u003e“Boudreax’s Seafood Special with fries,” I say.\u003c/p\u003e\n\u003cp\u003e“Ketchup with your fries?”\u003c/p\u003e\n\u003cp\u003e“Yes, please.”\u003c/p\u003e\n\u003cp\u003eGonzo finally lowers his menu. The waitress takes note of his Little Person status. It’s like it stalls her out for a minute and she needs to reboot, but the forced smile comes back.\u003c/p\u003e\n\u003cp\u003e“And what about you, dawlin’?”\u003c/p\u003e\n\u003cp\u003eGonzo’s eyes are like saucers. He’s sweating and coughing a little bit, pulling at his collar. I sense a full panic tsunami coming on, though I don’t know why just yet.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” Gonzo says. He puts his menu up in front of his face. It doesn’t block the waitress’s view. It just makes him look like an idiot. “I can’t eat anything on here, man.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“It’s all fish.”\u003c/p\u003e\n\u003cp\u003e“Yeah, no kidding. It’s a seafood restaurant. Jambalaya Café. Says so right out front.”\u003c/p\u003e\n\u003cp\u003e“I can’t eat shellfish. My mom says I could be allergic.”\u003c/p\u003e\n\u003cp\u003e“Could be or are?”\u003c/p\u003e\n\u003cp\u003e“It’s a helluva way to find out, dude. I could go into anaphylactic shock and die right here within seconds, no do-over.”\u003c/p\u003e\n\u003cp\u003eThe waitress’s smile falters. No doubt she’s picturing herself losing tips while she runs for the CPR kit under the counter. Under the fluorescent lights, she looks tired and lined, like one of my mom’s old book bags, and I feel sorry for her and totally pissed at Gonzo.\u003c/p\u003e\n\u003cp\u003e“So order the fried catfish,” I say.\u003c/p\u003e\n\u003cp\u003eThe waitress agrees. “The catfish’s real good. It’s my fav’rite.” Her pen hovers, ready.\u003c/p\u003e\n\u003cp\u003eGonzo shakes his head. “Mercury, man.”\u003c/p\u003e\n\u003cp\u003eI make a show of examining the menu. “Sorry … don’t see the Mercury Special anywhere …”\u003c/p\u003e\n\u003cp\u003e“No, the mercury. In fish, amigo. Some fish have a high concentration of it. It can cause brain and liver damage and all sorts of wicked reactions.”\u003c/p\u003e\n\u003cp\u003e“You know, Gonz, it’s not like they’re back in the kitchen opening thermometers all over the food. Get a grip.”\u003c/p\u003e\n\u003cp\u003e“Dude, this is serious. Do you know how many people die of mercury poisoning each year? It’s some serious sh—” Gonzo steals a glance at our waitress. “It’s a growing concern.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-44.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
