{"id":77038,"no":45,"title":"Page 45","content":"\u003cp\u003ePeople are being seated in our section. People who might want to order lots of fish from the seafood menu and ostensibly leave big tips to go with that. Our waitress taps her pen on her pad. “I can give y’all another minute if you need. …”\u003c/p\u003e\n\u003cp\u003e“Gonzo,” I hiss under my breath. “I’m freaking starving. Just order something, okay?”\u003c/p\u003e\n\u003cp\u003eThe hostess whispers to the waitress that Table A3 is ready to order. She nods.\u003c/p\u003e\n\u003cp\u003e“We’ve got a good salad bar. It’s all-you-can-eat.” The waitress gestures to a food island in the middle of the room where vats of brightly colored food sit on little ice hills under protective glass lit by a jillion lightbulbs. It’s like a small salad city.\u003c/p\u003e\n\u003cp\u003eGonzo narrows his eyes. “How often do you clean that thing?”\u003c/p\u003e\n\u003cp\u003e“Every night,” the waitress answers. Her smile is strained.\u003c/p\u003e\n\u003cp\u003e“That’s it? Do you know how long it takes for Listeria to grow under those hot lamps, even with ice?”\u003c/p\u003e\n\u003cp\u003eHere we go.\u003c/p\u003e\n\u003cp\u003e“It can happen in just five hours. Five hours and you’ve got the salad bar of death!”\u003c/p\u003e\n\u003cp\u003eThe waitress looks confused. “From Listerine?”\u003c/p\u003e\n\u003cp\u003e“Lis-ter-i-a. It’s bacteria that can cause anything from food-poisoning symptoms to coma.”\u003c/p\u003e\n\u003cp\u003eThe waitress’s smile has completely vanished. “Well, my goodness. Are you boys from the health department? ’Cause we passed with flying colors just two months ago. My manager’s got the certificate on file.”\u003c/p\u003e\n\u003cp\u003e“No, ma’am,” I say, flashing Gonzo an I-will-kill-you-if-you-speak look. “Just bring him a grilled cheese sandwich.”\u003c/p\u003e\n\u003cp\u003e“And coffee,” Gonzo adds.\u003c/p\u003e\n\u003cp\u003e“And coffee,” I say.\u003c/p\u003e\n\u003cp\u003e“I’ll put that order right in for you!” The waitress takes our menus and practically runs from the table. A bus boy drops off a cup of steaming java.\u003c/p\u003e\n\u003cp\u003e“How did you get the name Gonzo anyway? Were you born in St. Irony Hospital?” I ask once our waitress has gone to the coffee station where she’s telling the other waitress on duty about Gonzo. She pokes her head around to gawk at us.\u003c/p\u003e\n\u003cp\u003e“Dude, you have to be careful. They say they clean stuff, but they really don’t.” Gonzo empties three packets of sugar into his coffee and stirs it with the end of his fork.\u003c/p\u003e\n\u003cp\u003e“You know, Gonzo, that’s kind of the least of our worries,” I say.\u003c/p\u003e\n\u003cp\u003e“That’s what you say now. When you’re puking up your stomach lining in an hour, you’ll think differently.”\u003c/p\u003e\n\u003cp\u003eI push the saltines away. “Thanks for that visual.”\u003c/p\u003e\n\u003cp\u003e“For real, dude, my mom read a magazine article—investigative journalism—about what goes on in restaurant kitchens. You don’t want to know.”\u003c/p\u003e\n\u003cp\u003e“You’re right. I don’t. Maybe your mom should stop reading stupid crap that exists only to keep people in a state of constant fear.”\u003c/p\u003e\n\u003cp\u003eGonzo’s expression darkens. “You talking shit about my mom? Maybe if your ’rents had been more on their game you wouldn’t have gotten a bad burger or whatever and ended up with holes in your brain.”\u003c/p\u003e\n\u003cp\u003e“Nice.”\u003c/p\u003e\n\u003cp\u003e“I’m just saying.”\u003c/p\u003e\n\u003cp\u003eWe stare at each other over the mostly empty cracker bowl. “You know what? Let’s just not talk,” I say.\u003c/p\u003e\n\u003cp\u003eGonzo shrugs. “Fine by me, pendejo.”\u003c/p\u003e\n\u003cp\u003eThe waitress brings our food and I eat like a man possessed. We haven’t really had anything other than JellyJuice Bears, convenience-store hot dogs, and Corny Doodles since we left the hospital. I’m not usually one of those people who gets all rhapsodic about food, but this fish is amazing—like the first time I’ve ever tasted anything. Gonzo sniffs his grilled cheese sandwich repeatedly and takes tentative bites.\u003c/p\u003e\n\u003cp\u003eBy the time we finish dessert and make our way on foot to the French Quarter, it’s nighttime. Now that my stomach is full and there’s so much excitement on tap, I forget to be annoyed with Gonzo, and I guess he’s over my shit, too. We just keep giving each other these goofy “Whoa! Check that out!” grins. It’s like another world down here—all these old houses with galleries where people sit and watch parades of tourists going by. The streets of New Orleans are like a collage—all kinds of people, things, and colors bumping up against each other, overlapping till they make something new. College kids stagger out of bars still holding hurricane glasses. A ponytailed girl leans against a garbage can, puking. Street musicians compete for attention: a guitarist in a top hat tries to outsing the lady violinist, and both of them are drowned out by the washtub band a few feet down. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-45.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
