{"id":77052,"no":59,"title":"Page 59","content":"\u003cp\u003eIn the corner, the muted TV plays the same cartoon of the roadrunner and coyote chasing each other in and out of doors. The last thing I see is the old lady from across the hall standing at the foot of my bed. She’s dressed in a coat and hat and has a little suitcase with her.\u003c/p\u003e\n\u003cp\u003e“A house by the sea. Don’t forget.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” I say, but I’m not sure anyone hears me.\u003c/p\u003e\n\u003cp\u003eAnd on TV, the coyote waits for the anvil to fall.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-TWO\u003c/p\u003e\n\u003cp\u003eWherein the Angel Discusses the Wonders of Microwave Popcorn and Gonzo Gets Our Asses Stranded in the Middle of Nowhere\u003c/p\u003e\n\u003cp\u003eWhen I wake up, it’s morning, early. The light hasn’t been up much longer than I have. People are asleep. Their heads rest against the windows and seat backs, their jaws spread wide, like the arms of a can opener left on a counter. Through the thin, wet layer of dew on my own window, the countryside rolls past. We’re in Mississippi or maybe Alabama.\u003c/p\u003e\n\u003cp\u003eA gray mist sits on the rooftops of little tar-paper shacks where clotheslines are strung across the front yards. The shirts catch the breeze like they wish they could sail on out of there, out of those small, junky yards with their rusted car shells and broken-down plastic toys. I breathe on the window a few times, watch it fog over and retreat, fog over and retreat.\u003c/p\u003e\n\u003cp\u003eI like the feel of the road under me. The solid thump-thumpthumpthump-thump drum cadence of those big tires. Gonzo’s out cold next to me, that big head of his resting on my shoulder. He mumbles in his sleep, and I wonder what dreams he has.\u003c/p\u003e\n\u003cp\u003e“Peekaboo.” Dulcie’s face peers over the seat in front of me.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” I ask, looking around.\u003c/p\u003e\n\u003cp\u003e“There’s some welcome.”\u003c/p\u003e\n\u003cp\u003e“Look, it’s just …” I lower my voice. “I don’t want people to think I’m opening up a six-pack of crazy here on the bus. I’ll get kicked off.”\u003c/p\u003e\n\u003cp\u003e“Looks like everybody’s sleeping.”\u003c/p\u003e\n\u003cp\u003e“Can anybody else see you besides me?” I ask.\u003c/p\u003e\n\u003cp\u003e“I suppose they could if they wanted to, but maybe what they see isn’t what you see,” Dulcie answers in her typically cryptic fashion. “Hey, check it out.” She unfurls her wings slightly. Cameron rock, they read.\u003c/p\u003e\n\u003cp\u003e“Shouldn’t there be an ‘s’ at the end? Cameron rocks?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I ran out of spray paint. But the sentiment is one hundred percent there.” She rests her chin on the seat top and grips the sides with her hands. It makes her look like she’s been beheaded. “You seem a little tired, cowboy.”\u003c/p\u003e\n\u003cp\u003e“Weird dreams,” I say.\u003c/p\u003e\n\u003cp\u003e“Want to tell me about it? The doctor is in.”\u003c/p\u003e\n\u003cp\u003e“Just stuff about my mom. She was talking about how she used to take me to the library when I was a kid, and I didn’t remember that at all. But just as I woke up, I did remember it. Crystal clear I could see myself sitting in my mom’s lap over near the water fountain, and she was reading some rhyming book about monsters to me. She had on sandals and she smelled good, like shampoo. And I was happy. How did I manage to forget that?”\u003c/p\u003e\n\u003cp\u003e“That’s a nice memory,” Dulcie says.\u003c/p\u003e\n\u003cp\u003eWe listen to the road thumpity-thumping beneath us, and for a few minutes it feels like we’re the only two beings in the entire universe.\u003c/p\u003e\n\u003cp\u003e“Do you have some nice memories?” I ask, offering her some Cheesy Puff Fingers from our open bag. “You know, from before you were …” I gesture to her wings in a completely ineffectual way. “You know.”\u003c/p\u003e\n\u003cp\u003eDulcie gets a funny little smile. “I’m making a nice memory right now.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“Here. With you.” She downs two Cheesy Puff Fingers.\u003c/p\u003e\n\u003cp\u003e“But what were you before you were an angel?” I press.\u003c/p\u003e\n\u003cp\u003eShe takes a sip of my warm soda, makes a face. “Does it matter?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I think it does.”\u003c/p\u003e\n\u003cp\u003e“Okay, then,” she says, taking another drink from the can. “I was somebody else.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?” I say, getting pissed off. “Did you have parents? A dog? A parakeet? A Social Security number? Can you remember? How do you feel? Is there a God? What happens when we die? Will I be like you, spray-painting my wings with misspelled messages and guiding people on stupid, insane missions?”\u003c/p\u003e\n\u003cp\u003e“It’s not stupid, Cameron,” she says softly.\u003c/p\u003e\n\u003cp\u003e“I’m out here on the road looking for some renegade miracle man, totally sticking my neck out for you, and you can’t even answer one single f**king question!”\u003c/p\u003e\n\u003cp\u003eThe guy across the aisle opens one eye for half a second, then turns over, and I lower my voice. “I think you owe me that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-59.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
