{"id":76999,"no":6,"title":"Page 6","content":"\u003cp\u003ePoint Team Jenna.\u003c/p\u003e\n\u003cp\u003eEverybody laughs, and it would be boffo if I could just fade into the lockers right now. But against the uniform pert tan-blondness that is the dance team, my shaggy dark hair, British-musician-on-the-dole pale skin, and six feet of seriously awkward body stand out like a strip of film negatives plopped down on top of their happy group photo.\u003c/p\u003e\n\u003cp\u003eOne of the Hotness Crew smirks. Staci Johnson. I’m not too proud to tell you that it makes me go a little expansive in my Fruit of the Loins. Staci Johnson is a shallow social climber who would never allow me within a ten-foot radius of her rather magnificent body. I know this. But what can I say? My penis is a traitor.\u003c/p\u003e\n\u003cp\u003e“You’ve got mustard on your shirt,” Staci points out.\u003c/p\u003e\n\u003cp\u003e“It was cheeseburger day.”\u003c/p\u003e\n\u003cp\u003e“Oh my God, you don’t actually eat in the cafeteria every day?”\u003c/p\u003e\n\u003cp\u003e“I have a thing going with one of the lunch ladies. Bernice. She’s the one with the hairnet and the mustache. But mum’s the word. Wouldn’t want to spoil the big prom surprise.”\u003c/p\u003e\n\u003cp\u003eSomeone whispers, “God, your brother is so weird.”\u003c/p\u003e\n\u003cp\u003e“Just ignore him,” Jenna says with a sigh. “We do.”\u003c/p\u003e\n\u003cp\u003eChet strides up, all six feet of him, and drapes his arms over my sister like a big daddy gorilla. It’s a clear message to the hallway—She’s mine. Chet nods at me in that ages-old macho greeting: I have acknowledged your existence, peon. Do not ask for more.\u003c/p\u003e\n\u003cp\u003e“What are y’all doing for spring break?” Staci asks, arching her back so that her butt sticks out in a noticeable way.\u003c/p\u003e\n\u003cp\u003e“I’ve got a mission ski trip with my church,” Chet says. “Trying to get Jenna here to come, too.”\u003c/p\u003e\n\u003cp\u003eJenna beams. It would be so tempting right now to say something like, Wait, Jen, don’t you have an abortion scheduled for that week? But Chet would probably kick my ass. Hell, Jenna would probably kick my ass.\u003c/p\u003e\n\u003cp\u003eStaci twirls her hair around one finger. “Well, me and Lisa and Carmen are going to Daytona for the YA! TV Party House.”\u003c/p\u003e\n\u003cp\u003e“Omigod, you are not!” one of the wannabes squeals. “If you get to meet Parker Day I will be so jealous!”\u003c/p\u003e\n\u003cp\u003eYA! TV—Youth America! Television—is the barometer of cool for teens everywhere, and Parker Day, with his highlights, vintage rocker clothes, souped-up sneakers, and sly smile, is its most telegenic host. Half the kids in school walk around spouting his trademarked phrase, “You smoked it!”\u003c/p\u003e\n\u003cp\u003e“Actually, we need a fourth to make it happen,” Staci says. “Jenna, you should come with us.”\u003c/p\u003e\n\u003cp\u003e“To Florida?”\u003c/p\u003e\n\u003cp\u003e“It would be fun.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Jenna says. “But expensive.”\u003c/p\u003e\n\u003cp\u003eStaci sticks her butt out just a little farther, which I didn’t think possible, and my penis, the mutinous bastard, fires up again.\u003c/p\u003e\n\u003cp\u003e“Well, think about it,” Staci says. “It’s gonna be completely mammoth.”\u003c/p\u003e\n\u003cp\u003e“Yo, Cam,” Chet says. “Nice stunt with the cockroach.”\u003c/p\u003e\n\u003cp\u003e“What cockroach?” Jenna asks.\u003c/p\u003e\n\u003cp\u003e“The Cammer here pulled a fast one. He said he saw a cockroach to get out of English class.”\u003c/p\u003e\n\u003cp\u003eJenna gives me a look. The look says, You are disappointing Mom and Dad.\u003c/p\u003e\n\u003cp\u003e“You didn’t miss anything, just more Don Quixote. My pastor thinks we shouldn’t be reading that stuff. Said it can give kids the wrong ideas, make ’em question everything and get all weird. It happened to this one kid he knew, and the parents had to get him straightened out.”\u003c/p\u003e\n\u003cp\u003e“Oh my God,” Staci says, like this bullshit Chet’s telling her is as sad as some little kid dying of cancer.\u003c/p\u003e\n\u003cp\u003e“From books? I don’t believe that,” Jenna says, and I feel a glimmer of hope that she will not fall to the forces of evil.\u003c/p\u003e\n\u003cp\u003e“It’s true!” Chet insists. “Anyway, it’s all good. His folks sent him to this church that’s got everything from a school to a restaurant, so you never have to go outside all that much, and he’s pretty much there all the time, away from negative influences. It’s like what happened to me with my injury.”\u003c/p\u003e\n\u003cp\u003eHere we go. The girls practically swoon.\u003c/p\u003e\n\u003cp\u003e“I could’ve questioned stuff. I could have let it change me. But I didn’t.” He grins. “You’ve gotta stay positive. Right, Cam?”\u003c/p\u003e\n\u003cp\u003eOh, absolutely. I’m big, big, big on the thumbs-up to the positive. I can’t go a day without wanting to draw a happy face on every surface I see.\u003c/p\u003e\n\u003cp\u003e“Right,” I say.\u003c/p\u003e\n\u003cp\u003e“You coming to the game, bro?”\u003c/p\u003e\n\u003cp\u003e“Can’t. It’s against my religion.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-6.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
