{"id":77053,"no":60,"title":"Page 60","content":"\u003cp\u003eDulcie wipes her mouth, but some of the Day-Glo cheese powder clings to her lip. “All right. I’ll answer one of your questions.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“I feel like I swallowed a Magritte.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eDulcie reaches in for another Cheesy Puff Finger. “You asked me how I feel. And my answer is: I feel like I swallowed a Magritte. Like on the inside, I’m made of clouds and floating eyes, green apples, and slowly rising men in bowler hats.”\u003c/p\u003e\n\u003cp\u003e“You are officially the most annoying unreal creature ever.”\u003c/p\u003e\n\u003cp\u003e“Meet a lot of us, do you?”\u003c/p\u003e\n\u003cp\u003e“Lately it’s gotten very weird.”\u003c/p\u003e\n\u003cp\u003e“Cameron.” She puts her hand on my arm. “The point is, you’re alive right now. Look around.” She widens her arms to include the sleeping passengers. “Half the people I see aren’t really aware. They aren’t in the game at all. They never notice how fabulous stuff here is.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like …” She thinks for a few seconds. “Microwave popcorn.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding.”\u003c/p\u003e\n\u003cp\u003e“Think about it. You put this flat bag of kernels in the hopper, wait four minutes …” She opens her mouth and taps her fingers against her taut cheeks, making a popping sound. “And voila! You’ve got a steaming bag of buttery goodness right there.”\u003c/p\u003e\n\u003cp\u003e“This is your miracle of human existence?”\u003c/p\u003e\n\u003cp\u003e“No. But it doesn’t suck. It’s a simple pleasure, okay? You got any of those?”\u003c/p\u003e\n\u003cp\u003e“Sure,” I say.\u003c/p\u003e\n\u003cp\u003eShe folds her arms over her armored chest. “Such as?”\u003c/p\u003e\n\u003cp\u003e“Masturbation.”\u003c/p\u003e\n\u003cp\u003e“Yeah? What else?”\u003c/p\u003e\n\u003cp\u003eI think about it for a good, long minute. “Eubie’s.”\u003c/p\u003e\n\u003cp\u003eDulcie sits, waiting. “And?”\u003c/p\u003e\n\u003cp\u003e“Can’t think of anything else.”\u003c/p\u003e\n\u003cp\u003e“Well, how about pizza—in-restaurant, not delivery. Water fountains. That chill on your arms when you go from an air-conditioned movie theater into the heat. The smell of Laundromats. Snow. CDs …”\u003c/p\u003e\n\u003cp\u003e“No, not CDs, records. Gotta be vinyl.”\u003c/p\u003e\n\u003cp\u003e“Vinyl, then. What else?”\u003c/p\u003e\n\u003cp\u003e“You know I hate that you’ve drawn me into this, don’t you?” The morning light’s falling on Dulcie in a way that makes her glow, and I have the impulse to say, This. Right here. Right now.\u003c/p\u003e\n\u003cp\u003eI shrug. “That’s all I got.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “We’ve got work to do, Bucko.”\u003c/p\u003e\n\u003cp\u003eThe bus driver’s got his signal on. We’re exiting.\u003c/p\u003e\n\u003cp\u003eDulcie gets up. “That’s my cue.”\u003c/p\u003e\n\u003cp\u003e“So, like … when will I see you again?”\u003c/p\u003e\n\u003cp\u003e“Soon,” she says, ducking into the john. “Get out there and make some memories, cowboy. Oh, and don’t forget to save the universe.”\u003c/p\u003e\n\u003cp\u003eFive minutes later, the bus pulls into a rest-stop area. The sign welcomes us to the fine state of Mississippi. A bunch of eighteen-wheelers are parked near the gas pumps. The bus comes to a stop and the driver opens the doors. “Y’all wanna stretch your legs, get some air, go ’head. Just be back on this bus in ten minutes. I got a schedule to keep.”\u003c/p\u003e\n\u003cp\u003eGonzo and I pile out with the rest of the road-weary passengers and head for the big green MegaMart across the parking lot.\u003c/p\u003e\n\u003cp\u003e“Awww, dude! They’ve got the Mega XL Death Captain Carnage!” He runs for the bank of video games beside the tiny ATM machine. “This is just the most awesome game ever! If you get to level three, you get a special battleax that lets you slice-and-dice your way through nursery rhyme characters. Sweet! Hey, you got a buck?”\u003c/p\u003e\n\u003cp\u003eI give Gonz the dollar and in another minute I hear him killing beloved storybook characters with glee. There’s an explosion, and the dish yells, “Run away, Spoon! Save yourself!” I use the ATM. Buy a few more snacks. Get some change.\u003c/p\u003e\n\u003cp\u003e“Gonzo—” I start to ask if I can use his phone, but I know he’s terrified of using up his minutes. “Listen, I gotta make a call. Keep an eye on the bus, okay?”\u003c/p\u003e\n\u003cp\u003e“Sure,” he says, eyes glazed.\u003c/p\u003e\n\u003cp\u003eAround the back is a pay phone. I drop in my coins and punch in the digits I know best. On the fourth ring, Jenna’s sleepy voice answers.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Jenna?”\u003c/p\u003e\n\u003cp\u003e“Cameron? Oh my God, is that you? Where are you?”\u003c/p\u003e\n\u003cp\u003e“Shhh, don’t wake up Mom and Dad.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she says. And I know how hard it is for her to break the good-girl code for me. The line buzzes with static and the occasional click. “How are you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-60.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
