{"id":100835,"no":62,"title":"Page 62","content":"\u003cp\u003e“Where are we, anyway?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I say, wiping the sweat from my forehead with my arm. “Somewhere in Mississippi. Fuck!” I kick at a stone in the road, sending it skittering away through a cloud of dust.\u003c/p\u003e\n\u003cp\u003eGonzo starts coughing. “Dude, I can’t breathe right.”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare panic on me,” I warn.\u003c/p\u003e\n\u003cp\u003e“I’m not,” Gonzo squeaks, holding back a cough that barrels out anyway. “Look, I’ll just call my mom,” he says, whipping out his cell.\u003c/p\u003e\n\u003cp\u003e“Yeah. Absolutely. Wouldn’t want to go another step without input from Mom.”\u003c/p\u003e\n\u003cp\u003eGonzo ignores my snarkiness. “You said if there was an emergency, amigo. This counts as an emergency, right?” Before I can stop him, he pushes number one on his speed dial and in a second I hear him saying, “Mom? ¿Mamí? Sí. Es Gonzo. Jeez, don’t cry, Mom. I’m fine. I promise.”\u003c/p\u003e\n\u003cp\u003e“Yeah, Mom,” I say to the air. “We’re just stuck on a dirt road in the middle of nowhere with no idea where we are or how to get out of here. Everything’s great! Wish you were here!”\u003c/p\u003e\n\u003cp\u003eGonzo peels away from me. “Listen, Mom, we need a little money. … I what? I sound sick? No. I feel fine. Sí.” He coughs. “It’s just dry. No, it’s not pneumonia, Mom. No, I … yeah, I’ve got my inhaler. The prescription’s not more than three months old. Do you think I should get it refilled?”\u003c/p\u003e\n\u003cp\u003e“We’re all gonna die! Die! Die!” For Gonzo’s benefit, I put my hands to my throat, stick out my tongue, and fall to the ground, spazzing.\u003c/p\u003e\n\u003cp\u003eHe covers the mouthpiece of the phone with his hand. “Dude, that shit is so not funny. Mom? What do you mean the tests were inconclusive?”\u003c/p\u003e\n\u003cp\u003eI can’t deal. I wander off the road into the cool grass and let the long, tall blades skim my fingertips. There are a few cows out grazing. They look up, chewing, but I’m not grass, so they ignore me. I inch closer to one. It’s got big wet nostrils that sniff the air around me. Its tail flicks at the flies. We’re nose to nose. She seems soft, and I reach out a hand to stroke her fur, which is warm from the sun. She lets me do it, just goes on munching grass while I smooth my hand across her wide back.\u003c/p\u003e\n\u003cp\u003e“How now, mad cow?” I say.\u003c/p\u003e\n\u003cp\u003e“Cameron!” Gonzo calls out.\u003c/p\u003e\n\u003cp\u003e“Catch you later, Bessie,” I say to the cow, who eats another mouthful of grass in response.\u003c/p\u003e\n\u003cp\u003eWhen I reach Gonzo, he’s pacing, and his face is sweaty. “I knew I shouldn’t have come on this trip,” he says, and he looks like he could cry. “My mom said they found this spot on my lung on the chest X-ray. It could just be a blip on the film or a cyst—or it could be something really bad, like cancer or a mutant virus or bacteria.”\u003c/p\u003e\n\u003cp\u003e“Or it could be your mom freaking out over nothing.”\u003c/p\u003e\n\u003cp\u003eI offer him my hand, but he crawls over to his backpack in the grass and fishes out his inhaler. He pulls deep on it, but he’s having a hard time calming down. He stands, trying to shake it off. “A spot! That doesn’t sound good. What do you think that could mean?”\u003c/p\u003e\n\u003cp\u003eI grab Gonzo’s shoulders a little too hard because he is annoying the crap out of me. “I have bad news, man. You’re going to live. Deal with it.”\u003c/p\u003e\n\u003cp\u003eHe twists out of my grip. “I think we should go back, Cameron.”\u003c/p\u003e\n\u003cp\u003e“No way. I’m not going back.”\u003c/p\u003e\n\u003cp\u003e“I can’t go back by myself, dude. I could be dying.” He pulls deep on his inhaler again.\u003c/p\u003e\n\u003cp\u003e“You’re not the one who’s dying, Gonzo!” I’d like to kick his ass all the way to Florida. He gives me that wounded-puppy look, effectively killing my karate fantasy. “Doesn’t she do this to you all the time?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Scare the bejesus out of you?”\u003c/p\u003e\n\u003cp\u003e“She’s looking out for me, okay? You don’t know her, Cameron. I shouldn’ta left like that. Like my dad.”\u003c/p\u003e\n\u003cp\u003e“You ever think there was a reason your dad left?”\u003c/p\u003e\n\u003cp\u003eHe kicks at a pebble in the road. It skitters sideways into the long grass and disappears. “Me.”\u003c/p\u003e\n\u003cp\u003e“Maybe it wasn’t you.”\u003c/p\u003e\n\u003cp\u003e“She’s the best thing in my life. I know that.”\u003c/p\u003e\n\u003cp\u003eI should just shut up. But I’m so pissed off—about the bus, about the cows, about Gonzo’s crazy mom, about everything—that I just want to slice and dice. “Well, that’s pretty damn sad, then. You ever think that maybe the best thing in your life would be to get the hell away from her before she turns you into a complete emotional cripple?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-62.html","bookId":2718,"creation":"Oct 5, 2019 9:49:24 PM","modification":"Oct 5, 2019 9:49:24 PM"}
