{"id":77068,"no":77,"title":"Page 77","content":"\u003cp\u003e“What are you doing?” I say, putting my finger over the clicker to disconnect him.\u003c/p\u003e\n\u003cp\u003e“I told you, calling my mom. My cell’s dead and I don’t have the charger.”\u003c/p\u003e\n\u003cp\u003e“We can’t afford a phone call to your mom.”\u003c/p\u003e\n\u003cp\u003e“I don’t like this place, man.” Gonzo starts to wheeze.\u003c/p\u003e\n\u003cp\u003e“Calm down, Gonz. You’re okay. It’ll all be fine, I promise. Just breathe, okay?” I say, talking to him like I would if I were his mom. If I can keep him from panicking, he’ll be okay. I’m not even sure he has asthma. I think he just has Freak Out lungs. Gonzo’s not having any of my Zen master shit. He’s tearing through his bag frantically, like a squirrel desperate for its nut.\u003c/p\u003e\n\u003cp\u003e“My inhaler. Dude, it’s gone! Oh my God!” His face is really pale, and even I’m getting a little wigged about him.\u003c/p\u003e\n\u003cp\u003e“Be cool, be cool. Don’t freak on me. It’s here, okay?”\u003c/p\u003e\n\u003cp\u003eGonzo’s nodding, but he’s saying “Shit, shit, shit” under his breath. I’m grabbing around in the bag, but I don’t feel the inhaler.\u003c/p\u003e\n\u003cp\u003e“What if it’s lost for real?” he wheezes. “Or stolen. Shit. Call nine-one-one, man. Call nine-one-one!”\u003c/p\u003e\n\u003cp\u003eI keep pawing through his bag. “I’m not calling nine-one-one. Calm down.”\u003c/p\u003e\n\u003cp\u003e“Dude, I can’t breathe!”\u003c/p\u003e\n\u003cp\u003e“You’re yelling! If you can yell, you can breathe, all right? We call 911 and it’s game over. We go back and I die in a diaper listening to instrumental light rock and the world goes poof and that is not gonna happen, so just get a grip.”\u003c/p\u003e\n\u003cp\u003eThe neon light from the parking lot falls across Gonzo’s face like a strobe effect. His eyes are wide and he’s clutching his chest.\u003c/p\u003e\n\u003cp\u003e“Please. Dude. This could be game over. Call nine-one-one stat! Tell them to bring a nebulizer!”\u003c/p\u003e\n\u003cp\u003eI grab his shoulders hard and shake him. “Gonzo! I am not going to let you die. Okay? I’m not your mom! I am not rushing you into an early grave so I can get on with my life. Okay? Okay?”\u003c/p\u003e\n\u003cp\u003eI’m waiting for him to go medieval on my ass for talking about his mom that way, but surprisingly, he just nods, letting me get back to his bag. This time, I find the L-shaped metal canister. “Here,” I say.\u003c/p\u003e\n\u003cp\u003eGonzo grabs it with both hands, shakes it hard, then positions it at his mouth like a tiny pistol and fires away. His eyes close as he holds his breath, waiting for the medicine to do its work. Exactly thirty seconds later, he takes another hit, holds his breath again until he can’t anymore, and it all comes rushing out of him in a whoosh. There’s a lot of coughing. In another minute, the color returns to his face. The air conditioner clicks on. It pushes the orange balloon back and forth in the artificial breeze.\u003c/p\u003e\n\u003cp\u003e“You okay?” I ask.\u003c/p\u003e\n\u003cp\u003eHe shrugs. He can’t really commit to being okay. It might kill him.\u003c/p\u003e\n\u003cp\u003e“That wasn’t cool, what you said about my mom,” he says quietly.\u003c/p\u003e\n\u003cp\u003e“Okay, sorry,” I say, because I don’t have any fight left in me. “Let’s just crash.”\u003c/p\u003e\n\u003cp\u003eI turn off the lamp and lie down. The room is tomb dark. Only hotel rooms ever get this dark, like they know it’s their function to close you off from the world. When my eyes adjust to the lack of light, though, I can still make out Gonzo sitting on the edge of his bed, not moving.\u003c/p\u003e\n\u003cp\u003eI sigh. “Gonz, you’re not, like, having heart palpitations over there or anything, are you?”\u003c/p\u003e\n\u003cp\u003e“No. I was just thinking.” His voice sounds weird in the dark. Hollow and detached, like he’s as full of air as the orange balloon. “You ever have, like, these totally random memories sometimes?”\u003c/p\u003e\n\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003e“I was thinking about this one time when I was a kid. I was, like, I don’t know, five? Six, maybe? It wasn’t too long after my old man took off. The kids next door had this new swing set. It was ridiculously tricked out: swings, clubhouse, slide, monkey bars. The whole bolo, man. Way cool. To a little kid, anyway.”\u003c/p\u003e\n\u003cp\u003eHe pauses, and I wonder where this little trip down memory lane is taking us. My pillow’s heating up under my head. I flip it over, settle my head against the cool cotton.\u003c/p\u003e\n\u003cp\u003e“Anyway, they told me if I wanted to be in the club, I had to be able to cross the monkey bars without falling. Dude, those bars looked like they were about four thousand feet high. But it was the first time they’d asked me over, so I didn’t want to mess it up. One of the boys gave me a boost and I started making my way across. I was totally sweating it. But I got to the second one and then the third one. By the time I got to the fourth rung, they started cheering for me, telling me to keep going. It was this freakin’ amazing feeling, like … I don’t know how to describe it. I was doing it, you know? I was making it, muchacho. Two more to go and I’d be home free.” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-77.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
