{"id":77070,"no":79,"title":"Page 79","content":"\u003cp\u003eI trip along the access road to the blinking yellow lights of the underpass. On the other side of the freeway, there’s a Gas-It-N-Git all lit up like a fluorescent mirage.\u003c/p\u003e\n\u003cp\u003eThere’s only one car in the lot and no people except the guy behind the counter, who’s watching a little TV he’s got by the register. I’ve got three dollars in change in my pocket and I slide it all into the pay phone. My fingers are stiff. I keep dropping coins that I have to pry off the pavement.\u003c/p\u003e\n\u003cp\u003eThe phone rings a few times. Dad picks up. “Hello?” he says in a barely awake voice. For a second, I don’t say anything. I just listen to his sleep-heavy breathing on the other end of the line.\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003e“Cameron? Is that you? Are you … Say something. Please.”\u003c/p\u003e\n\u003cp\u003eHis voice sounds different to me coming from so far away over thousands of miles of thin wire. It doesn’t sound pissed off and controlled. I hear other notes in it. Fatigue. Hope. Sadness.\u003c/p\u003e\n\u003cp\u003e“Cameron?” he whispers. “I know you can hear me. I don’t care where you are right this second. I just want you to know you are my boy. You’re a part of me and I’m a part of you. Always.”\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003e“Cameron?”\u003c/p\u003e\n\u003cp\u003e“Love you,” I say, just as a big semi roars past on the highway, taking more stuff to more people to pack around the empty spaces of their lives.\u003c/p\u003e\n\u003cp\u003eMom’s waking up. I hear her asking Dad what’s going on, who’s he talking to, did the doctor come in? Dad tells her it’s nothing, go back to sleep.\u003c/p\u003e\n\u003cp\u003e“Cameron?” Dad whispers. “Can you hear me, pal?”\u003c/p\u003e\n\u003cp\u003eA recorded operator voice politely asks me to deposit more change, but I don’t have any more, so I hang up. It feels like there’s a walrus sitting on my chest, and my eyes sting. I’d give anything to get high right now, to get good and numb.\u003c/p\u003e\n\u003cp\u003eThere’s a girl at the other end of the Gas-It-N-Git standing around like she’s waiting for something. She’s got on shorts and a fake fur jacket, even though it’s muggy and my T-shirt’s sticking to my chest in places, leaving those little pellets of sweat, like a giant connect-the-dots. I nod to her on the way in, and she ignores me, which is fine, really.\u003c/p\u003e\n\u003cp\u003eThe unnaturally bright lights hit me like a punch. That and the rancid nacho cheese smell from the big dripper beside the counter is working me over pretty good. The speakers administer a muzak dosage of a Copenhagen Interpretation song. The DJ’s soporific voice follows the end notes. “And that was ‘Words for Snow’ by the Copenhagen Interpretation, from the Wonder Whatever Happened to Them files. …”\u003c/p\u003e\n\u003cp\u003eI move toward the back, stopping to pull the\u0026nbsp; p**n\u0026nbsp; magazines out of their protective plastic coverings. The guy behind the counter’s watching me in the convex We See You So Don’t Even Think of Shoplifting Here mirror. Shit, there’s no way this guy’s gonna let me buy beer. I waste time picking up stuff I have no intention of purchasing: Cheap toy guns. Disposable razors. Cans of beans. Couple of snow globes. Jumbo packs of AlmostReal Fruit Leathers. Finally, I open the cooler, letting the frigid air wash over me, and grab a Rad Xtra Energy drink. If I’m going to be wired, I might as well go all the way. When I go for a bag of Corny Doodles, my coordination goes haywire. My muscles stiffen up; I grab hold of the wire display for support and send the whole row of chips to the ground.\u003c/p\u003e\n\u003cp\u003e“What do you think you are doing?” the clerk shouts in very precise English, like he’s been practicing. His name tag reads EMPLOYEE #12, and I wonder if he’s got a name or if his bosses just don’t give a shit what it is.\u003c/p\u003e\n\u003cp\u003eHe’s yelling at me. “You think this is funny? You think this is a funny joke? Go on. Get out of here!” he shouts, pushing me through the front doors. “You are on drugs. Get going before I call the cops.”\u003c/p\u003e\n\u003cp\u003eBack in the parking lot under the hazy lights, I gulp in the air, trying to calm my body. My E-ticket meter flares, then fades, and when I look, Frontierland has been completely erased. I’m down two health bars, as Gonzo would say. I wish I had my soda. The chick in the fur vest is still standing there, a lollipop in her mouth. Underneath all that makeup, she’s not so old. Maybe fifteen. Sixteen. It’s hard to tell with girls.\u003c/p\u003e\n\u003cp\u003e“Whadjoodo?” she asks.\u003c/p\u003e\n\u003cp\u003e“I beat his high score on Captain Carnage. He’s pissed.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t laugh, and it depresses me.\u003c/p\u003e\n\u003cp\u003eShe takes the lollipop out of her mouth. “If you wanna take something you have to put something on the counter first. Like you put a few candy bars there and ask if you can keep them on the counter while you get the rest of your stuff. They always say sure and then they think you won’t rip them off. They stop watching you.”\u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-79.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
