{"id":77073,"no":82,"title":"Page 82","content":"\u003cp\u003e“This is great,” Tara says. “When I’m a model, I’m buying a house just like this one. Maybe I’ll even buy this one from the McNultys and everybody who was ever mean to me can just eat shit when I’m all famous and everything.”\u003c/p\u003e\n\u003cp\u003e“Baby, you can build your own house,” Justin says.\u003c/p\u003e\n\u003cp\u003e“Yeah, I can, can’t I? Better than this one,” Tara giggles. She swims over to Justin and wraps herself around him, spider style. They float together like that, kissing. I look around the yard like I’m interested in the landscaping.\u003c/p\u003e\n\u003cp\u003eTara laughs. “I think we’re embarrassing Cameron,” she says in a little singsong voice.\u003c/p\u003e\n\u003cp\u003eJustin gently pushes away from Tara and stretches for the side of the pool.\u003c/p\u003e\n\u003cp\u003e“Hey!” Tara says, treading water. “Where you going?”\u003c/p\u003e\n\u003cp\u003e“I gotta take care of business.”\u003c/p\u003e\n\u003cp\u003eJust like that, they climb out and dry off with some towels they take from a neat stack in a cabinet by the back door. They peel off their wet underwear. I look away and pretend I’m not getting another hard-on thinking about riding in an SUV with a girl who’s not wearing any panties.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Tara says once they’ve got their clothes on again.\u003c/p\u003e\n\u003cp\u003e“Hold up a sec.” Justin’s riffling through the sideboard of the grill. He pockets some BBQ sauce and a bottle opener.\u003c/p\u003e\n\u003cp\u003e“Should you take that?” I ask. My head’s starting to clear a little. It’s not as cottony.\u003c/p\u003e\n\u003cp\u003e“They have everything. They won’t miss it.”\u003c/p\u003e\n\u003cp\u003eWhen we get back into the SUV, Justin opens the glove compartment and tosses the bottle opener in there. It joins three more bottle openers, a cigarette case, some photographs of other people’s families, keys, and a dog collar.\u003c/p\u003e\n\u003cp\u003e“You take all that?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I like having their stuff. I like knowing they don’t win all the time.”\u003c/p\u003e\n\u003cp\u003e“Justin,” Tara whines. “We’re gonna miss the party.”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me what to do,” he says, real low and quiet.\u003c/p\u003e\n\u003cp\u003eTara rolls her eyes and squeezes the water out of her pony-tail. “Gimme a cigarette.”\u003c/p\u003e\n\u003cp\u003eWe drive out of the mansion neighborhood through a good-but-not-as-expensive one into an okay one, falling through the pecking order of neighborhoods till we’re in a run-down section with a bunch of ranch houses guarded by crappy, American-made cars and trucks.\u003c/p\u003e\n\u003cp\u003eJustin parks the SUV at the end of a long line of cars. We follow him down the street to the house where all the lights are blazing and party sounds blurp from the backyard. Two kegs are the only furniture in the back. Some kind of metal-rap mix blares from stereo speakers pulled out through the sliding glass doors and parked precariously on the uneven concrete patio.\u003c/p\u003e\n\u003cp\u003eA heavy guy in a black wrestling T-shirt greets Justin with a complicated handshake that ends with them both bumping chests. “Justin. Whassup?”\u003c/p\u003e\n\u003cp\u003eJustin shrugs, hands in his pockets. “Not much, bro. How’s the action?”\u003c/p\u003e\n\u003cp\u003eThe big guy looks around. “So-so. Too many guys, not enough girls. Hey, Tara.”\u003c/p\u003e\n\u003cp\u003e“Hey, Carbine,” Tara says, taking a drag off a new cigarette. “This is Cameron. He’s dying of mad cow disease.”\u003c/p\u003e\n\u003cp\u003eCarbine nods at me. “Cool. Want a beer?”\u003c/p\u003e\n\u003cp\u003e“No, that’s okay.”\u003c/p\u003e\n\u003cp\u003eHe hands me a full cup. “Here you go.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say, taking it.\u003c/p\u003e\n\u003cp\u003eCarbine throws some playful punches to Justin, who fake wrestles him back, and I wonder who decided this was supposed to be the okay male greeting. Hi, good to see you. Let me show you how glad I am by beating the crap out of you.\u003c/p\u003e\n\u003cp\u003eThey stop hitting each other and Carbine says, “Yo, Justin. Can we do a little bidness?”\u003c/p\u003e\n\u003cp\u003e“Lead the way, bro,” Justin says, and they disappear.\u003c/p\u003e\n\u003cp\u003eA guy walks up and takes the beer out of my hand, drinking it and handing me back the empty cup. Tara sees some girls she knows and runs over to whisper with them in a huddle like girls do. It’s in their DNA.\u003c/p\u003e\n\u003cp\u003eI wander through the house. A strip poker game has taken over the kitchen. One girl’s down to her bra and jeans. A guy’s sitting there in his tighty-whiteys. I grab a handful of chips and head into the living room. The guys stand around in clumps, eyeing the girls who sit on the couches, drinking and talking and waiting for the guys to make a move so they can hook up. The ones who do hook up walk to the back rooms and don’t come out. Some poor dude’s out cold on the couch and his friends are writing ASSWIPE across his forehead in permanent marker. The news is on TV. I’m transfixed by pictures of flames tearing through some town. I wish I could hear what the anchorwoman was saying. There’s only the crappy closed captioning, which says something about poasssble asson, which I think means “possible arson.” On the scene, mustachioed guys in mirrored sunglasses and baseball caps stand around taking notes. Somebody switches the channel to wrestling. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-82.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
