{"id":77074,"no":83,"title":"Page 83","content":"\u003cp\u003eI push through the screen door and walk out into the yard, where it’s mostly quiet. You can see stars here. A smiling yard gnome like the one from Dad’s photos keeps watch over a rock garden. This one’s about three feet tall, with white hair and beard, red cheeks, a Viking helmet, brown pants, and a chain-mail tunic.\u003c/p\u003e\n\u003cp\u003eI have no idea where I am or how the hell I’m going to get back to the motel. It’s a good thing Gonzo’s a heavy-duty sleeper, because if he woke up and found himself alone, he’d have a full-blown panic attack. I step back, accidentally toppling the yard gnome.\u003c/p\u003e\n\u003cp\u003e“Sorry, little guy,” I say, righting him.\u003c/p\u003e\n\u003cp\u003e“I’d prefer that you not refer to me as ‘little guy.’”\u003c/p\u003e\n\u003cp\u003eThat pot must have been better than I thought, because I could swear the yard gnome just said something. “Excuse me? Did you just t—”\u003c/p\u003e\n\u003cp\u003e“It’s derogatory. I don’t refer to you as skinny guy, now, do I?”\u003c/p\u003e\n\u003cp\u003eHoly shit. I’m talking to a yard gnome.\u003c/p\u003e\n\u003cp\u003eSomebody barrels down the street too fast, taking off the side mirror on a sedan. I look around but there’s no one I can turn to for verification.\u003c/p\u003e\n\u003cp\u003e“Did you see that? He didn’t even stop,” the yard gnome says without losing his cheery smile. “This neighborhood is going to hell.”\u003c/p\u003e\n\u003cp\u003e“Who … who are you?” I croak.\u003c/p\u003e\n\u003cp\u003e“My captor—the man who stole me from a fraternity house—calls me Grumpy. Of course, he’s also the sort of educated gentleman who pisses on me when he comes home drunk, so there you are.”\u003c/p\u003e\n\u003cp\u003e“Okay. Not loving the name Grumpy. What do you want to be called, then?” I ask.\u003c/p\u003e\n\u003cp\u003e“Ah, a question of identity, ágætr. Who would you be if you didn’t know who you are? How do you put a name to your soul, your essential sjálfr?”\u003c/p\u003e\n\u003cp\u003e“Don’t look at me. My parents named me Cameron after some actor they liked.”\u003c/p\u003e\n\u003cp\u003e“Exactly. You’ve been assigned an identity since birth. Then you spend the rest of your life walking around in it to see if it really fits. You try on all these different selves and abandon just as many. But really, it’s about dismantling all that false armor, getting down to what’s real.”\u003c/p\u003e\n\u003cp\u003e“And what’s that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he says, sounding weary. “But I can tell you what it isn’t. It isn’t standing in somebody else’s yard, smiling and rosy-cheeked while the dogs sniff you for a crap post. It isn’t having teenagers steal you in the night and take you on vacations where they snap your photo in front of the Matterhorn or Old Faithful or a KOA campground just for grins. It isn’t the mailman giving you a kick for fun. It isn’t this.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I’ve never spent a party talking to a yard gnome. In fact, I’m not convinced you’re not a hallucination.”\u003c/p\u003e\n\u003cp\u003e“I give you my word that I am as real as you are. You asked my name.” His voice gets deeper, majestic. “I am Balder, son of Odin, brother of Höðr, friend to all.”\u003c/p\u003e\n\u003cp\u003e“Balder, wasn’t he a Norse god?” I say, remembering all my mother’s bedtime stories.\u003c/p\u003e\n\u003cp\u003e“Indeed.” He sounds pleased. “I am. Or I was. Once, in another time, another world. But Loki, the trickster, cursed me,” he growls. “And I found myself in this false form, forced to travel endlessly the nine worlds of Yggdrasil in the possession of others until I could find one who could understand, who had the sight to see through to my true nature. You are that soul, and now you will guide me to Ringhorn.”\u003c/p\u003e\n\u003cp\u003eThis whole thing is starting to make me wonder if maybe I should get on some serious meds pronto.\u003c/p\u003e\n\u003cp\u003e“Ringhorn is my ship, which waits for me. If I can make it to the sea, to Ringhorn, the curse shall be lifted and I shall be free. At last, I feel the winds of luck have shifted—thank the gods.”\u003c/p\u003e\n\u003cp\u003eA dog comes sniffing through the grass. It gives Balder a quick once-over, lifts its leg, and lets go all over him before trotting away.\u003c/p\u003e\n\u003cp\u003e“Could you turn on the hose, please?” he asks with a heavy sigh.\u003c/p\u003e\n\u003cp\u003eI find the knob for the hose, crank it to medium flow, and follow the green rubber snake of it back to Balder. With my finger over the nozzle so it sprays like a real shower, I give him a good dousing. Finally, he sputters that it’s enough and I turn it off.\u003c/p\u003e\n\u003cp\u003e“Hold on,” I say, running toward the house. “Don’t go anywhere.”\u003c/p\u003e\n\u003cp\u003e“You’re quite the wit,” he grumbles.\u003c/p\u003e\n\u003cp\u003eIn the kitchen, a couple of guys are fighting near some half-dressed girls. Carbine’s shouting, “Break it up! Break it up, dudes!” and pulling them off each other. No one sees me as I grab the roll of paper towels and sprint back outside. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-83.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
