{"id":77076,"no":85,"title":"Page 85","content":"\u003cp\u003eBalder’s face is a mix of terror and sheer pissed-off-ness. Given the chance, he’d run these guys through, I bet.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t do that,” I warn.\u003c/p\u003e\n\u003cp\u003eThe guy closest to Balder shouts, “Yeah? Why not? You gonna kick my ass?”\u003c/p\u003e\n\u003cp\u003eLovely. Gee, I hope we’ll be friends forever. “Naw, man. I just saw this big dog come and take a piss on him.”\u003c/p\u003e\n\u003cp\u003eHe jumps back fast, and the other guys laugh and high-five each other. “Awwww, dude! Close one. Dog piss!”\u003c/p\u003e\n\u003cp\u003eSomebody sticks a head out the door. “Yo! They’re showing Chainsaw Motel on the late show! Get your sorry asses inside.”\u003c/p\u003e\n\u003cp\u003e“All right! Cannibals!” the guys yell, and stumble-run to the house.\u003c/p\u003e\n\u003cp\u003eBalder lets out the breath he was holding. He bows. “That was a nice thing you did. You are indeed noble.” With his chain mail and domed helmet, he reminds me of some weird, courtly little knight. “Please allow me to read your fortune in the runes.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“The runes,” he says, drawing a small leather pouch from his pocket. “We from the North use them as tools of protection and divination. Here.” He offers the pouch. “Draw one.”\u003c/p\u003e\n\u003cp\u003eI pull out a smooth stone with a weird “R” etched into it.\u003c/p\u003e\n\u003cp\u003e“Ah,” Balder says, lighting up. “Raido. The rune of travelers, for it means a journey will be undertaken. The journey will be important and there will be no getting around it.” He puts the pouch back. “You might need the services of a warrior. I would be happy to ride into battle with you, if you chose to take me with you on your journey.” He shoots me a hopeful look.\u003c/p\u003e\n\u003cp\u003eHow the hell am I going to explain this to Gonzo? My cab pulls up to the curb. The driver honks once. I stand up and brush the grass from my jeans. “Okay, here’s the deal: I’m traveling with a friend, Gonzo. You have to talk to him, too, because he already thinks I’m going insane, and I don’t need any more help on that front. Got it?”\u003c/p\u003e\n\u003cp\u003e“Indeed.”\u003c/p\u003e\n\u003cp\u003e“We’re going to Florida. There’s a beach there. I don’t know if your ship will be waiting for you or not—I mean, I can’t promise anything—but it’s a shot.”\u003c/p\u003e\n\u003cp\u003eHe bows deeper this time. “The gods have truly sent a wise one to me. I shall honor your wishes, and I shall make one condition of my own.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“You and your friends are not to take any unauthorized pictures of me. I do not wish to show up on your Internet page posed in front of any national monuments or next to dubious signage with some obnoxious caption underneath. I’ve had quite enough of that.” His expression is as no-fooling as they come.\u003c/p\u003e\n\u003cp\u003e“Got it,” I say.\u003c/p\u003e\n\u003cp\u003eI lift him in my arms like a baby. On the way to the cab, Balder gives one last look at the cul-de-sac—the weedy yard, the rock garden littered with butts, the cars lining the block like conformity guards. He gives a small wave, and I think maybe he’ll miss this place after all, but then his fingers slowly bend till only the middle one’s left standing.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-NINE\u003c/p\u003e\n\u003cp\u003eIn Which I Learn That Two Very Small People Can Add Up to a Major Pain in the Ass and We Nearly Bite It at the Konstant Kettle\u003c/p\u003e\n\u003cp\u003eGonzo’s gotten up in a bad mood. He’s not happy that I went to a party without him. He’s not happy that I don’t have exact change for the soda machine. He’s not happy about getting his lazy ass up before noon, even though the Mister Motel—while being lax about the sort of cretins who rent their rooms—is pretty serious about their eleven o’clock checkout policy, and I am not about to be charged another full day rate so Gonzo can sleep in. But once I introduce Balder, the talking Viking yard gnome, Gonzo is unhappy for a whole new set of reasons.\u003c/p\u003e\n\u003cp\u003e“I’m just gonna verify this one more time, dude: I’m having breakfast with a yard gnome,” he says, once we’re established in a booth at the Konstant Kettle, located conveniently to the right of Mister Motel. He hasn’t touched his breakfast.\u003c/p\u003e\n\u003cp\u003e“I am Balder, god of wisdom, second son of Odin,” Balder explains between sips of tea. He’s wedged in the corner, where no one else can see him eating.\u003c/p\u003e\n\u003cp\u003e“Okay, you’re a delusional yard gnome,” Gonzo says.\u003c/p\u003e\n\u003cp\u003e“Let’s not talk about delusional,” I warn, looking around the place. I’m sure everyone’s noticed us—the twitchy teen, cranky dwarf, and talking yard gnome—but no, people are just going about their business here, digging into their corned-beef hash and eggs. It’s kind of funny and sad how people never really notice what’s going on, just like Dulcie said once. I wonder if I’ll ever see her again. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-85.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
