{"id":77089,"no":98,"title":"Page 98","content":"\u003cp\u003e“What yo’ lookin’ fo’ is just over yonder,” he answers, pointing a shaky hand straight ahead at the DEAD END sign.\u003c/p\u003e\n\u003cp\u003e“There’s no road there,” I say.\u003c/p\u003e\n\u003cp\u003e“You can leave yo’ car heah. Yo’ friends be safe. You go on yonder, now. Got things to see.”\u003c/p\u003e\n\u003cp\u003e“We really have to get back on the highway,” I say, wishing Gonzo’s door wasn’t unlocked. “Thanks again. Have a nice day.”\u003c/p\u003e\n\u003cp\u003eI step on the gas in reverse, and the Caddy shudders and dies.\u003c/p\u003e\n\u003cp\u003eThe old man shuffles over and pops open the hood without even asking. “Go on, now. I’ll take a look at yo’ car.”\u003c/p\u003e\n\u003cp\u003eFor a second, I wonder if I should leave my friends here with a stranger. But this guy is eighty if he’s a day. The worst he could do is take out his teeth and inspire us never to neglect our flossing.\u003c/p\u003e\n\u003cp\u003eI step over the aluminum guardrail and duck into the trees. The rain’s slowed to a blue-gray mist that sticks to my jacket. The ground’s soft with pine needles and the occasional crunch of a cone. The air smells like it’s just been born. Light bleeds through the spaces between the trees. At first, I think it’s the sun coming out, but it’s brighter, like someone just turned on the lights in a stadium. The water droplets on the trees; the brown carpet of pine needles under my feet; my jeans, shirt, and hands—everything glimmers in that strange white light, and then I see the small, worn path off to the right. I follow it through the maze of pines, the light getting stronger all the way, till I find the source of it—a ginormous ash tree, big as a house.\u003c/p\u003e\n\u003cp\u003e“Whoa,” I murmur. The tree takes up the whole clearing. A tangle of branches sticks out in every possible direction, and every one of those branches is alive with about a million different scraps of paper.\u003c/p\u003e\n\u003cp\u003e“Hola, cowboy.” Dulcie steps out from behind the tree. She glows like she’s a part of it. I’m so happy to see her that I have the urge to scoop her up into a big bear hug, but I don’t know if full-body contact with angels is cool or not, and it’s not one of those things I feel like testing.\u003c/p\u003e\n\u003cp\u003e“Hola back. Where’ve you been?” I say instead.\u003c/p\u003e\n\u003cp\u003e“Places. Hey, what do you think of this, huh?” She pats the tree’s milky-colored trunk.\u003c/p\u003e\n\u003cp\u003eI smirk. “It’s called a tree. We have lots of ’em.”\u003c/p\u003e\n\u003cp\u003eDulcie arches an eyebrow, but that grin isn’t far behind, and God, what is it about girls in general and this one in particular that I would sit in a room all day coming up with jokes just for another one of those funky smiles? “I promise you, cowboy, you haven’t seen a tree like this one before. Take a closer look.”\u003c/p\u003e\n\u003cp\u003eI finger one of the scraps of paper on a low-lying branch. On closer inspection, I see it’s actually more like a leaf—like somebody stuck a note on the tree and it grew veins and bloomed there.\u003c/p\u003e\n\u003cp\u003e“Go on. Read it,” Dulcie says.\u003c/p\u003e\n\u003cp\u003eThe paper is so yellowed with age that I’m afraid it’ll crumble in my hands. Even though I’m drenched, it’s somehow dry. The handwriting’s hard to make out.\u003c/p\u003e\n\u003cp\u003e“What does it say?” Dulcie asks.\u003c/p\u003e\n\u003cp\u003e“It says, I wish to marry Tobias Plummer.”\u003c/p\u003e\n\u003cp\u003eShe nods. “Nice one. Read another.”\u003c/p\u003e\n\u003cp\u003eI bend another leaf toward me. This one is fresher, and the words seem as if they’ve been printed out on a computer. “I wish I could get a Game Guy for my birthday.”\u003c/p\u003e\n\u003cp\u003e“Huh,” Dulcie says. “Good luck with that, kid.” She plucks a paper leaf off.\u003c/p\u003e\n\u003cp\u003e“Should you be doing that?” I say, and just like that, it grows back.\u003c/p\u003e\n\u003cp\u003eOne by one, I read them off:\u003c/p\u003e\n\u003cp\u003eI wish my daughter were cured of her sickness.\u003c/p\u003e\n\u003cp\u003eI wish I had a new job.\u003c/p\u003e\n\u003cp\u003eI wish the girl in fourth period at Bethel High School would notice me.\u003c/p\u003e\n\u003cp\u003eI wish I could feel the sun on my face. Nothing feels warm to me anymore.\u003c/p\u003e\n\u003cp\u003eI wish I knew what to wish for.\u003c/p\u003e\n\u003cp\u003e“What are these?” I ask, letting the branch snap back into place.\u003c/p\u003e\n\u003cp\u003e“Wishes. It’s a wishing tree.”\u003c/p\u003e\n\u003cp\u003e“A wishing tree,” I repeat.\u003c/p\u003e\n\u003cp\u003e“It grants wishes,” she says, like I should know this.\u003c/p\u003e\n\u003cp\u003e“So, what? People write out their hopes and dreams and place them on the tree and the tree says, ‘Poof! There you go. A big steaming plate of All Yours. Enjoy!’”\u003c/p\u003e\n\u003cp\u003eDulcie wobbles her hand in an—ish motion. “Sort of.”\u003c/p\u003e\n\u003cp\u003e“Sort of?”\u003c/p\u003e\n\u003cp\u003e“Sort of.” Dulcie picks some pine needles out of her wings, which aren’t decorated with flying cows or painted to look like Holsteins today. They’re just normal. If wings can ever be considered normal. “I’m starving. You got any candy?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-bovine/page-98.html","bookId":2718,"creation":"Oct 5, 2019 3:34:41 PM","modification":"Oct 5, 2019 3:34:41 PM"}
