{"id":112181,"no":2,"title":"Page 2","content":"\u003cp\u003eThomas Winter was twenty-seven two weeks ago. He has one brother, Robert, who is three years his junior. There is no other family.\u003c/p\u003e\n\u003cp\u003eOn March 13 last year Mary and Kenneth Winter - the parents of the boys - died in a car accident just outside London . Mrs Winter and the driver of the van that hit their car died instantly. Mr Winter hung on for a further four and a half days before passing away in hospital.\u003c/p\u003e\n\u003cp\u003eAs the sole beneficiaries of their parent\u0027s joint will, the two boys received equal shares of a substantial estate. Mr Winter had been practical and had made arrangements well in advance which removed much of the burden from the two shell-shocked brothers. By November last year their parent\u0027s properties had been sold, their investments and pensions realised and their bank accounts closed.\u003c/p\u003e\n\u003cp\u003eRobert continued with his studies at university - there he managed to find an oasis of normality when the rest of his world had been tipped on its head. Thomas, on the other hand, left his city office job and bought a modest bungalow in Thatcham, a small fishing village some twenty miles from where he had been brought up.\u003c/p\u003e\n\u003cp\u003eThomas has a girlfriend, Siobhan, who he genuinely adores. When his parents died most of his friends quickly disappeared. Siobhan stayed by his side throughout and remained strong, dedicated and supportive. Even on the nights when Thomas sat alone and cried himself to sleep in the darkness, when he wouldn\u0027t eat or drink and when he\u0027d speak to no-one, she had waited nearby. She knew that he would need her eventually.\u003c/p\u003e\n\u003cp\u003eThe village of Thatcham is on the east coast and is popular with holidaymakers throughout the summer.\u003c/p\u003e\n\u003cp\u003eIt is late August. \u003c/p\u003e","sourceLink":"https://allnovel.net/trust/page-2.html","bookId":2561,"creation":"Oct 6, 2019 12:57:51 AM","modification":"Oct 6, 2019 12:57:51 AM"}
