{"id":87844,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt should have been an entirely triumphant and peaceful night for Darcy. She knew that she had done well. And usually, to go with some of the torture that her existence afforded her, she was able to feel something like serenity and satisfied pleasure at a job well done.\u003c/p\u003e\n\u003cp\u003eBut that night…\u003c/p\u003e\n\u003cp\u003eDinner should have been fun. Penny, Clint, and Carter had all been excited about her find. Clint and Carter had vied for her attention, Penny had studied her like a wise old sage who had known her stuff and was proud as a peacock herself for being the one to insist that Harrison Investigations be called into the house. Even old Sam Arden, caretaker, had seemed to eye her with a new respect. It was almost as if she had become the accepted matriarch of a village, having proven her mettle. None of them seemed ill at ease with her, though both Clint and Carter kept asking, in different ways, just how she had managed to do it. She refused to explain exactly how, just saying that she had researched the story at the library, and put two and two together. Clint, however, shook his head.\u003c/p\u003e\n\u003cp\u003e“Two and two don’t naturally add up to four in a forest! You’re amazing. Simply amazing. You do have a special and unique gift.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to explain how you really found the skull,” Carter told her.\u003c/p\u003e\n\u003cp\u003e“Research,” she told him. But she couldn’t help a smile. “That’s what we do—investigate.”\u003c/p\u003e\n\u003cp\u003e“That ghost in the Lee Room is going to be sorry!” Penny commented.\u003c/p\u003e\n\u003cp\u003e“Maybe you’ve really got to be careful,” Clint said, somewhat worried and subdued then. “I mean, maybe it’s a ghost that doesn’t want to be known, and it will be more violent, because it’s afraid of you.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Carter had said, frowning.\u003c/p\u003e\n\u003cp\u003e“Ghosts only come out because they want to be discovered,” Sam Arden had surprised them all by saying. And when they had stared at him, he had continued with, “Like serial killers. They always taunt the police because somewhere, in their subconscious, they want to be caught.”\u003c/p\u003e\n\u003cp\u003eThere had been a few minutes of unease, but then Clint had announced that he had some special champagne. Darcy accepted her glass and slipped out to take a walk to the porch. Clint found her there.\u003c/p\u003e\n\u003cp\u003e“You know,” he’d told her softly, “he’s only such a jerk because he’s afraid.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Matt. He’s afraid.”\u003c/p\u003e\n\u003cp\u003e“You’ve lost me. Matt is really afraid of ghosts?”\u003c/p\u003e\n\u003cp\u003eThat brought Clint’s devastating, deep-dimpled grin into play along with a spate of laughter. “Matt? Afraid of ghosts? No. He’s not even afraid of whackos with guns and knives. He’s afraid of you.”\u003c/p\u003e\n\u003cp\u003e“Why would he be afraid of me?”\u003c/p\u003e\n\u003cp\u003eClint had joined her against the rail. Tall, lean, charming. And very handsome. She wondered why she couldn’t feel an almost painful physical draw to him.\u003c/p\u003e\n\u003cp\u003eHe’d reached out to smooth down a stray strand of her hair.\u003c/p\u003e\n\u003cp\u003e“Because he really likes you—and respects you—but doesn’t want to. Because you’re a beautiful redhead.”\u003c/p\u003e\n\u003cp\u003eThat had brought a smile from her. “Thank you. That’s sweet. It’s also bull.”\u003c/p\u003e\n\u003cp\u003eClint shook his head. “His wife was a total bitch. She was insane over him at first, but he couldn’t be deterred from the house or his work, and she just wasn’t the kind who could live long without playing hard—all over the globe. Then she started to think that he had lost interest in her, and she tried to make him jealous. Wrong move with Matt. It just turned him off completely. But she did have her ways. So…when the marriage went all to hell, it left a nasty taste in his mouth.”\u003c/p\u003e\n\u003cp\u003e“For redheads.”\u003c/p\u003e\n\u003cp\u003e“A certain kind of redhead.”\u003c/p\u003e\n\u003cp\u003e“Great. I’m a kind of redhead?”\u003c/p\u003e\n\u003cp\u003e“Cool. Smooth. Sophisticated.”\u003c/p\u003e\n\u003cp\u003e“Sophisticated, huh?”\u003c/p\u003e\n\u003cp\u003e“A kind of sophistication that no one can acquire if it isn’t just natural. So…Matt is going to act like a jerk. That’s why you should forget all about him, and realize just how attractive I am.”\u003c/p\u003e\n\u003cp\u003e“You’re very attractive.”\u003c/p\u003e\n\u003cp\u003e“But you’re just not interested. Still…you change your mind, I’m around. Ready to rush to your defense at any moment.”\u003c/p\u003e\n\u003cp\u003e“Hopefully, I won’t need any defenders.”\u003c/p\u003e\n\u003cp\u003e“Don’t crush my crusading spirit!”\u003c/p\u003e\n\u003cp\u003e“If I do need a defender, I’ll be delighted that you’re there. How’s that?”\u003c/p\u003e\n\u003cp\u003e“A crumb!” Clint told her, but he was grinning, and he slipped an arm around her shoulder as he led her back into the house.\u003c/p\u003e\n\u003cp\u003ePenny had hot tea and scones prepared when they got inside. When it had hit eleven, Darcy had yawned, excused herself, and gone to bed. Her room had seemed cold and cavernous that night, despite the warmth outside.\u003c/p\u003e\n\u003cp\u003eShe’d opened the balcony door, certain herself that nothing evil was coming from outside the room.\u003c/p\u003e\n\u003cp\u003eWhatever watched her had a place within.\u003c/p\u003e\n\u003cp\u003eShe watched a late-night show on TV, giving it halfhearted attention.\u003c/p\u003e\n\u003cp\u003eSomething waited within the room.\u003c/p\u003e\n\u003cp\u003eShe did so herself.\u003c/p\u003e\n\u003cp\u003eWell after midnight, she was still certain that Matt hadn’t returned. And still, some time after that, she drifted to sleep.\u003c/p\u003e\n\u003cp\u003eSoon after, she began to dream again, entering into the world of another. Vaguely, in a subconscious place, she knew that she dreamed once again. This time as another…\u003c/p\u003e\n\u003cp\u003eBefore, she had dreamed as a man, coming to the house.\u003c/p\u003e\n\u003cp\u003eThis night, she entered the soul of the woman who had waited.\u003c/p\u003e\n\u003cp\u003eShe’d not begun the evening with any great sense of fear or urgency. Indeed, she’d been angry herself, and ready to fight, argue, speak her mind—and change her life. She’d not thought a thing about going to bed that night.\u003c/p\u003e\n\u003cp\u003eShe was certain that he would not come. All that raged between them was too close, too tense, too passionate.\u003c/p\u003e\n\u003cp\u003eShe was furious!\u003c/p\u003e\n\u003cp\u003eBy the dim light, she sat down at her desk and began to write. He could do what he wanted. She couldn’t stop him.\u003c/p\u003e\n\u003cp\u003eBut he was going to pay.\u003c/p\u003e\n\u003cp\u003eYet, as she set out to write, pulling out a sheet of stationery with her personal emblem, she paused. It was a beautiful night. Cloudless, allowing even the gibbous moon to cast a serene glow over the rolling hills of the countryside beyond the window. For a moment, a sense of hesitance settled over her. There was so much here, so much between them.\u003c/p\u003e\n\u003cp\u003eAh, but…\u003c/p\u003e\n\u003cp\u003eShe had been betrayed. He had betrayed her.\u003c/p\u003e\n\u003cp\u003eShe started to write. From somewhere near, she heard the whinny of a horse. A dog began to howl and bark. Oblivious she set to her task, determined. The die had been cast.\u003c/p\u003e\n\u003cp\u003eThen…\u003c/p\u003e\n\u003cp\u003eA sound.\u003c/p\u003e\n\u003cp\u003eDarcy awoke with a start. The sense of sharing another’s dream, of being that person, reliving the past, fell from her as if she had doffed a cloak from her shoulders.\u003c/p\u003e\n\u003cp\u003eAnd yet, blinking in the shadowed room, she struggled to fathom what had awakened her. Had it been the sound she heard within the dream?\u003c/p\u003e\n\u003cp\u003eNo…\u003c/p\u003e\n\u003cp\u003eShe listened, and was certain that she had heard something.\u003c/p\u003e\n\u003cp\u003eOut on the balcony.\u003c/p\u003e\n\u003cp\u003eFootsteps, slow, quiet, furtive.\u003c/p\u003e\n\u003cp\u003eShe bit into her lower lip, silent and dead still for a moment. Then she slipped from beneath the covers, stepped out of the bed and rose, slowly, quietly. Her bare feet made no sound on the soft Persian rug beneath the bed. She prayed that a floorboard wouldn’t creak.\u003c/p\u003e\n\u003cp\u003eCarefully, she moved across the floor to the balcony. Standing behind the softly billowing drapes, she looked out. Nothing. Nothing, but the moon in the sky, and a gentle breeze. She moved out, one slow step at a time, and still, nothing.\u003c/p\u003e\n\u003cp\u003eWith a sigh, Darcy frowned and walked to the railing.\u003c/p\u003e\n\u003cp\u003eThen she heard it again. Something…just a sound, a scratch…from behind her. She started to turn.\u003c/p\u003e\n\u003cp\u003eShe saw nothing but a whir of darkness. She felt the quick whack of something hard against her head like a bolt of lightning out of the blue.\u003c/p\u003e\n\u003cp\u003eNot hard enough to knock her out. Hard enough, however, to make her stagger, fall to her knees, cry out.\u003c/p\u003e\n\u003cp\u003eAnd see nothing more…\u003c/p\u003e\n\u003cp\u003eShe brought her hand to her head, more furious than hurt. The whack hadn’t been at all deadly, and her head wasn’t spinning. As she staggered up, the balcony doors next to her own burst open.\u003c/p\u003e\n\u003cp\u003eAnd there was Matt. Clad in Calvin Klein black knit boxers, and nothing more. Staring at her as if a lunatic had decided to knock on his door in the middle of the night.\u003c/p\u003e\n\u003cp\u003e“What the hell are you doing?” he demanded.\u003c/p\u003e\n\u003cp\u003ePerhaps it looked a little strange. She realized that she was standing directly in front of his French doors, disheveled and barely dressed. She’d opted for her favorite type of nightgown that night rather than the long T-shirts she often wore to bed. It was white, diaphanous. Sleeveless, with Victorian lace around the bodice. Her hair was all over. She might have resembled the mad Lady of Shalott.\u003c/p\u003e\n\u003cp\u003e“I…there was something out here,” she said.\u003c/p\u003e\n\u003cp\u003eHe lifted a brow, leaned back slightly, and crossed his arms over his chest. “The ghost is hanging around on the balcony?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“You don’t think so?”\u003c/p\u003e\n\u003cp\u003eHe was mocking her, of course. Aggravated herself, she too crossed her arms over her chest and tried for a look of dignity. “I heard something out here. It woke me.”\u003c/p\u003e\n\u003cp\u003e“Did it whisper in your ear?”\u003c/p\u003e\n\u003cp\u003e“Stop that, will you? I think that there was someone out here.”\u003c/p\u003e\n\u003cp\u003e“Alive or dead?”\u003c/p\u003e\n\u003cp\u003e“Someone. Alive.”\u003c/p\u003e\n\u003cp\u003eHe continued to stare at her skeptically, but then stepped past her. She could hear him swearing beneath his breath, but he did at least seem willing to take a look around. He walked the length of the balcony. When he disappeared around the corner, she felt a strange sense of loss and a chill invading her. Time seemed to stand on end, to stretch out, and the cold—despite the balmy night—to seep into her bones. How long could it take him to walk the circumference of the wraparound balcony? Granted, it was a big house, but….\u003c/p\u003e\n\u003cp\u003eShe stared to the left, watching the corner where he had disappeared. Hesitantly, she walked toward it herself, then nearly screamed to high heaven when she felt a touch upon her shoulder. \u003c/p\u003e","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-22.html","bookId":2267,"creation":"Oct 5, 2019 5:25:12 PM","modification":"Oct 5, 2019 5:25:12 PM"}
