{"id":87857,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“So you’re close.”\u003c/p\u003e\n\u003cp\u003e“Very close.”\u003c/p\u003e\n\u003cp\u003e“I should keep watch while you sleep,” Adam said.\u003c/p\u003e\n\u003cp\u003eDarcy hesitated. She shook her head then. “I’m more frustrated than frightened. Honestly. I want to see this through. We should set up equipment, yes, and I probably should have done so a few days ago. But we’re not going to get anything on tape—maybe a little mist. I need to get to the bottom of the dream. I need for the entire sequence of events to play out for me.”\u003c/p\u003e\n\u003cp\u003e“I understand you had a seance here.”\u003c/p\u003e\n\u003cp\u003e“Yes, and there was definitely a feeling of spiritual presence—but not through the medium. The ghosts were probably laughing at us all that night. Except…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“The malignant presence. I felt it that night, as well. But someone was definitely playing tricks that night. Parlor games. Rapping on the table.”\u003c/p\u003e\n\u003cp\u003e“Who did it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eAdam paused on the walkway. “Ah-huh!”\u003c/p\u003e\n\u003cp\u003e“Ah-huh?”\u003c/p\u003e\n\u003cp\u003e“We’re going to recreate the seance.”\u003c/p\u003e\n\u003cp\u003eDarcy grimaced. “Adam, the woman who came was earnest and all that, but not a real medium.”\u003c/p\u003e\n\u003cp\u003e“Don’t be silly. Your ‘medium’ will be here for the seance, of course. We need to recreate it with everyone present who was here that night. Except for this—you’ll be the medium this time.”\u003c/p\u003e\n\u003cp\u003e“You’re going to try to figure out who was rapping on the table? I can tell you right now—both Clint and Carter can be pranksters. And Penny is so determined that Matt believe in ghosts that she might have done it herself.”\u003c/p\u003e\n\u003cp\u003e“I’ll be watching for the table rapper myself,” Adam said. “To get to the bottom of the story with the ghost, we’re going to have to find the mischievous living soul first.”\u003c/p\u003e\n\u003cp\u003eDarcy arched a brow. “There’s something not right. Most of the time, spirits just want us to tell what happened in the past—see the evil culprit named, the truth known. This is all so very strange.”\u003c/p\u003e\n\u003cp\u003e“Let’s see what happens at a seance when you’re doing the communicating and I’m doing the watching,” Adam said. He turned back toward the house, then cast his face back in her direction again. “Enough of a walk for me,” he said cheerfully. “Come along. We’ve a lot of communicating with the living to do this afternoon.”\u003c/p\u003e\n\u003cp\u003e“You want to have the seance tonight?”\u003c/p\u003e\n\u003cp\u003e“Why let grass grow beneath our feet?” he cross-queried. “Sure. Absolutely. If it can be arranged, we’ll plunge right in tonight!”\u003c/p\u003e\n\u003cp\u003eMatt hung up the phone, groaned, and put his head down on his desk.\u003c/p\u003e\n\u003cp\u003eNaturally, Shirley chose that moment to tap, and walk into his office.\u003c/p\u003e\n\u003cp\u003e“Matt?” she cried with concern.\u003c/p\u003e\n\u003cp\u003eHe lifted his head, shaking it, and lifting a hand quickly. “I’m fine. Just ready to jump in a lake.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Shirley was still frowning, disturbed.\u003c/p\u003e\n\u003cp\u003e“It’s nothing. Adam Harrison has arrived, and wants to repeat a seance at the house tonight.”\u003c/p\u003e\n\u003cp\u003eShirley made a thoughtful face, taking up a perch on the corner of his desk. “What’s so bad about that?”\u003c/p\u003e\n\u003cp\u003e“Shirley, you know that I don’t even believe that there is a ghost. I think I’ve got a real live person playing tricks around the place.” He scowled. “Serious tricks.”\u003c/p\u003e\n\u003cp\u003eShirley shook her head slowly. “Any reports back on the wood from the library?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Soda.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“They were weakened by soda. Some kind of cola spilled into them.”\u003c/p\u003e\n\u003cp\u003eShirley was silent for a minute. “Matt, sounds as if some kid was in the library and spilled a drink that they weren’t supposed to have in there in the first place.”\u003c/p\u003e\n\u003cp\u003e“Yeah, that’s what it sounds like, isn’t it?”\u003c/p\u003e\n\u003cp\u003eShirley was silent. “Matt, do you think you’re protesting this a little bit too much?” she asked. “I mean, really, does what happened at the library have to have something to do with anything else going on at Melody House?”\u003c/p\u003e\n\u003cp\u003e“No, it doesn’t.”\u003c/p\u003e\n\u003cp\u003e“And yet you’re still convinced that it does?” Shirley asked softly.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Hunch, I guess.”\u003c/p\u003e\n\u003cp\u003e“Mm,” Shirley said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“What the hell does that mean?”\u003c/p\u003e\n\u003cp\u003e“Let me ask you another question. I heard that your arrival at the library was incredibly opportune. You arrived just in time, before Miss Tremayne gave up her grasp on the wood. How and why do you think you arrived in just the nick of time?”\u003c/p\u003e\n\u003cp\u003eHe scowled. “I probably knew that Darcy was hanging around the library and just wanted to check up on her.”\u003c/p\u003e\n\u003cp\u003e“Oh, Matt, come on. You went there on some kind of a hunch, too. And how is a lot of police work done? Hunches!”\u003c/p\u003e\n\u003cp\u003e“Gut reaction, from what we’ve learned over years,” Matt corrected.\u003c/p\u003e\n\u003cp\u003e“Ah, come on, you’re doing that Shakespearean thing, protesting too much.”\u003c/p\u003e\n\u003cp\u003e“Shirley, please. You don’t believe in ghosts.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what I believe in,” she told him earnestly. “I certainly wouldn’t say oh, yes! There are ghosts, I know it. But I’ve seen far too many strange coincidences not to believe that there may be some form of ESP out there. Experts say we only use a very small section of our brains in our day-to-day lives. Maybe the human mind, or spirit, is capable of far more than the normal person ever gets to know. Hey! Can I come to your seance?”\u003c/p\u003e\n\u003cp\u003e“Shirley, I’m really sorry. Adam Harrison wants to re-create the last seance we had down to the last man and woman, with only himself there as well, observing. But I tell you what—the minute I hear they’re going to pop out a Ouija board, your name is first on the invitation list.”\u003c/p\u003e\n\u003cp\u003eBy eight that night, all those who had attended the first seance had arrived at Melody House. David Jenner had his video set up, and Adam and Darcy had also arranged a small slew of instruments throughout the room, including a gauge to determine the temperature in different parts of the room, as well as an electrometer and magnometer which Adam explained were to measure electric and magnetic forces within the room.\u003c/p\u003e\n\u003cp\u003eMatt had stayed late at work, hoping to avoid most of the hoopla. Still, it was his house, and nothing was going on in it without him being there. He managed to shower and change and be down for eight, just as Adam was arranging the table to his liking.\u003c/p\u003e\n\u003cp\u003eTonight, Darcy was to be the star of the show.\u003c/p\u003e\n\u003cp\u003eHe had tried to behave no differently toward her. After all, Adam was the one who had come to take things over. And he had been entirely earnest the night before in his efforts to understand just what made her believe in all that she did. Try as he might, though, by daylight, he couldn’t help but think that she was living in a world of her own mind, no matter what results she might be able to achieve. He knew that he was offending her with his brief words and marked distance.\u003c/p\u003e\n\u003cp\u003eBut he didn’t like having the seance, and that was that.\u003c/p\u003e\n\u003cp\u003eElizabeth Holmes came to him and spoke softly but reproachfully. “Matt, I really did know what I was doing. I was close, so close. I wish you would have let me try again.”\u003c/p\u003e\n\u003cp\u003e“They’re professionals, Liz,” he told her.\u003c/p\u003e\n\u003cp\u003eHer eyes scanned him. “But you don’t believe in any of this.”\u003c/p\u003e\n\u003cp\u003e“Lizzie, I brought them in to find out what was going on.”\u003c/p\u003e\n\u003cp\u003eMae strode up, giving him a kiss on the cheek. “Oh, Matt! I do thank you for having me again. This is so exciting.”\u003c/p\u003e\n\u003cp\u003e“I had contact! I know I had contact!” Liz continued.\u003c/p\u003e\n\u003cp\u003eJason Johnstone was carrying a scotch as he joined their circle. “I admit I’m intrigued. Hey, Matt, it has been pretty different and amazing since Miss Tremayne arrived. I’m going to cover the ceremony when you bury poor Amy’s skull.”\u003c/p\u003e\n\u003cp\u003e“Great, just great,” Matt said, trying not to sound aggravated.\u003c/p\u003e\n\u003cp\u003e“See, Liz, you never found a skull,” Mae said.\u003c/p\u003e\n\u003cp\u003e“But you were here! I did contact the dead,” Liz insisted.\u003c/p\u003e\n\u003cp\u003eCarter sauntered on over, hand in hand with Delilah Dey. “Our councilwoman is a bit nervous,” he said.\u003c/p\u003e\n\u003cp\u003e“So spooky!” Delilah said with a delicious little shiver.\u003c/p\u003e\n\u003cp\u003eSo asinine! He almost retorted. Somehow, he refrained.\u003c/p\u003e\n\u003cp\u003e“Shall we begin?” Adam called out.\u003c/p\u003e\n\u003cp\u003eThey all began to gather.\u003c/p\u003e\n\u003cp\u003e“Darcy, you’ll take the middle seat,” Adam said. “Clint…Carter, if you would take seats at her side. David, you’ll be filming. Miss Dey…Delilah, if you would sit at Carter’s side? And Matt, next to Delilah. Mr. Johnstone, we’ll put you next to Penny over there, who will be next to Clint. Matt…you and I will take the ends of the table down here, with Mae and Elizabeth down here, between us.”\u003c/p\u003e\n\u003cp\u003eThey all filed into the chairs as Adam directed. Penny jumped up then, though, to lower the lights.\u003c/p\u003e\n\u003cp\u003eAdam remained cordial and cheerful throughout his instructions. Ever calm, casual, down-to-earth. He didn’t advise that the house be darkened to a point of shadow—evidently, the man wanted some light on the situation. Matt had to admit a tug of admiration for the old man, but then again, he knew that Harrison would allow for no charades.\u003c/p\u003e\n\u003cp\u003eWasn’t that why he had allowed Harrison Investigations in from the beginning?\u003c/p\u003e\n\u003cp\u003eNot really, he admitted to himself.\u003c/p\u003e\n\u003cp\u003eHe’d hoped that Adam would show up, and immediately prove that there was a hidden mike in the Lee Room or some such thing. Something Matt just hadn’t seen.\u003c/p\u003e\n\u003cp\u003eBut then…\u003c/p\u003e\n\u003cp\u003eHe was a cop. A good one. He should have found any bugs by now.\u003c/p\u003e\n\u003cp\u003e“If everyone will take hands, we’ll begin,” Adam said.\u003c/p\u003e\n\u003cp\u003eObediently, hands were held around the table.\u003c/p\u003e\n\u003cp\u003eMatt wasn’t sure what he was expecting then. Adam speaking with a Vincent Price spookiness to his voice, maybe.\u003c/p\u003e\n\u003cp\u003eBut Adam was as casual as if they were gathering for a picnic on the beach. “Please remember to keep contact with one another, hands on the table at all times. If anyone should become really frightened, just cry out, and we’ll stop the proceedings.” \u003c/p\u003e","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-35.html","bookId":2267,"creation":"Oct 5, 2019 5:25:12 PM","modification":"Oct 5, 2019 5:25:12 PM"}
