{"id":87875,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What’s the bet?” he asked, but he wasn’t expecting an answer, nor did he want one. “I know, we’ll make it a truth or dare.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“When you sink a ball, you ask a question. I’ll tell you the truth. When I sink a ball, you answer a question. And you have to tell the truth.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous!” Darcy said.\u003c/p\u003e\n\u003cp\u003e“Why?” he asked, his eyes dark. “Are you incapable of telling the truth?”\u003c/p\u003e\n\u003cp\u003e“No. I’ve never lied to you.”\u003c/p\u003e\n\u003cp\u003e“I think that you have,” he said flatly. He racked the balls, but then stepped away. “Ladies first.”\u003c/p\u003e\n\u003cp\u003e“I really can play, you know,” she told him.\u003c/p\u003e\n\u003cp\u003e“I believe you.”\u003c/p\u003e\n\u003cp\u003eShe was afraid that she’d be uneasy, and off. She wasn’t. She shot a clean break, sinking the three.\u003c/p\u003e\n\u003cp\u003e“Ask a question,” he told her.\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Who wanted the divorce, you or Lavinia?”\u003c/p\u003e\n\u003cp\u003eHe arched a brow, as if surprised by her choice of question. “I filed.”\u003c/p\u003e\n\u003cp\u003e“That didn’t really answer the question. Who wanted the divorce?”\u003c/p\u003e\n\u003cp\u003e“I did. Shoot.” He indicated the table.\u003c/p\u003e\n\u003cp\u003eShe sank another ball.\u003c/p\u003e\n\u003cp\u003e“Did you ever really love her?”\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e“Come on, you called it—truth or dare.”\u003c/p\u003e\n\u003cp\u003e“I was absolutely infatuated with her. Did I really love her? I don’t know. We didn’t give ourselves time.”\u003c/p\u003e\n\u003cp\u003eDarcy sank another ball.\u003c/p\u003e\n\u003cp\u003e“Did you ever hate her?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes. Go on, play.”\u003c/p\u003e\n\u003cp\u003eThis time, Darcy missed. Matt picked up his cue. It didn’t seem that he even took the time to check his angle; he sank his first ball with an absolute minimum of effort.\u003c/p\u003e\n\u003cp\u003e“My turn. You swear that you aren’t feigning when you take on another voice?”\u003c/p\u003e\n\u003cp\u003e“I swear that I’m not feigning,” she said flatly.\u003c/p\u003e\n\u003cp\u003e“Maybe without even knowing it?”\u003c/p\u003e\n\u003cp\u003e“Excuse me, I answered the question, shoot!” she said.\u003c/p\u003e\n\u003cp\u003eHe sank another ball. She wasn’t even sure he looked at the table.\u003c/p\u003e\n\u003cp\u003e“Why were you so strange on the porch last night?” he demanded.\u003c/p\u003e\n\u003cp\u003e“Strange?”\u003c/p\u003e\n\u003cp\u003e“You were afraid of me.”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Yes, because I—I thought that I’d been followed out.”\u003c/p\u003e\n\u003cp\u003e“Why did you lie?”\u003c/p\u003e\n\u003cp\u003e“That’s another question. Shoot another ball.”\u003c/p\u003e\n\u003cp\u003eHe started to protest, then shrugged. Again, his ball seemed to slide into the pocket effortlessly.\u003c/p\u003e\n\u003cp\u003e“Why did you lie?” he demanded again.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I don’t know. I supposed I thought that you’d followed me. Maybe to scare me, or something. I don’t really know.”\u003c/p\u003e\n\u003cp\u003e“That’s the truth?” he demanded.\u003c/p\u003e\n\u003cp\u003e“We are playing truth or dare,” she said dryly.\u003c/p\u003e\n\u003cp\u003eA flicker of something passed through his eyes. To her amazement, he missed his next shot.\u003c/p\u003e\n\u003cp\u003eShe quickly took up her own cue, and made a shot.\u003c/p\u003e\n\u003cp\u003e“Where is Lavinia now?” she asked.\u003c/p\u003e\n\u003cp\u003eHe looked puzzled. “How the hell should I know? Maybe Paris, maybe London. If she’s in D.C., I haven’t heard about it. Why?”\u003c/p\u003e\n\u003cp\u003e“It was my question, not yours,” she informed him, and made another shot. She stared at him a long moment.\u003c/p\u003e\n\u003cp\u003e“Well?” he said impatiently.\u003c/p\u003e\n\u003cp\u003e“Did you kill your wife?” she asked quietly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“My question!” she grated.\u003c/p\u003e\n\u003cp\u003e“No, I didn’t kill my wife.”\u003c/p\u003e\n\u003cp\u003eShe looked at the table quickly, took aim, and missed her shot. Matt walked past her with his cue. He made his shot, but didn’t ask a question. He cleaned the table, and set down his cue.\u003c/p\u003e\n\u003cp\u003e“Last question. So that’s it. You think that I killed my wife. You think that the ghost is Lavinia—that I strangled her in the Lee Room?”\u003c/p\u003e\n\u003cp\u003eDarcy opened her mouth, and closed it. “I…no, not really. I just thought that I should make sure. Matt…did you…did you push me into that grave today?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You keep saying that!” she told him, irritated. “I asked you—did you push me in that grave today?”\u003c/p\u003e\n\u003cp\u003e“No. No, a thousand times no. And why the hell didn’t you tell me you were pushed into it?” he demanded.\u003c/p\u003e\n\u003cp\u003eHer eyes fell. “Because I don’t know that I was pushed.”\u003c/p\u003e\n\u003cp\u003e“What the hell does that mean?”\u003c/p\u003e\n\u003cp\u003e“It could have been the wind, it could have been a hand.”\u003c/p\u003e\n\u003cp\u003e“Darcy, that’s ridiculous.”\u003c/p\u003e\n\u003cp\u003e“No, it’s not. The rain had started. The wind was howling. I was running, not watching where I was going, and suddenly, I was toppling into the grave.”\u003c/p\u003e\n\u003cp\u003eHe walked around to where she stood, crossed his arms over his chest, and leaned against the table. “Great. You think that I would push you into a grave, and that I killed my ex-wife.”\u003c/p\u003e\n\u003cp\u003e“No…not really.”\u003c/p\u003e\n\u003cp\u003e“But the suspicions rose in your mind?”\u003c/p\u003e\n\u003cp\u003e“A little.”\u003c/p\u003e\n\u003cp\u003e“Want me to call you a cab?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I think that we actually both hear each other just fine. I said, do you want me to call you a cab. Meaning, are you afraid to drive back with me.”\u003c/p\u003e\n\u003cp\u003eShe shook her head, swallowing hard. “No.”\u003c/p\u003e\n\u003cp\u003e“Are you afraid of me?” he demanded.\u003c/p\u003e\n\u003cp\u003eAgain, his eyes seemed very dark, very intense. She shook her head. “No.”\u003c/p\u003e\n\u003cp\u003eA small smile crooked his lips. “But you think that if you weren’t somewhat taken with me, you would be. You don’t want to be a fool, right?”\u003c/p\u003e\n\u003cp\u003e“I’m not afraid of you, Matt.”\u003c/p\u003e\n\u003cp\u003e“Hm,” he murmured, still watching her. “The suspicions tore at the back of your mind, but they were just teasers, huh?”\u003c/p\u003e\n\u003cp\u003e“More or less.”\u003c/p\u003e\n\u003cp\u003e“Come on, then. Let’s see if we make home.”\u003c/p\u003e\n\u003cp\u003eHe took her cue from her hands and set it on the table.\u003c/p\u003e\n\u003cp\u003e“Mae!” he called out.\u003c/p\u003e\n\u003cp\u003e“I know!” she shouted back. “Bill you!”\u003c/p\u003e\n\u003cp\u003e“Thanks, good night!”\u003c/p\u003e\n\u003cp\u003eEvery once in a while, the very idea that Darcy had even so much as an inkling that he might have actually killed Lavinia made Matt so mad that he was tempted to stop the car, get out of it, and slam a fist into the windshield.\u003c/p\u003e\n\u003cp\u003eSomehow, he refrained.\u003c/p\u003e\n\u003cp\u003eHe had the feeling that she wanted to speak, but she didn’t.\u003c/p\u003e\n\u003cp\u003eNot until they reached the house.\u003c/p\u003e\n\u003cp\u003e“We’re here,” he said.\u003c/p\u003e\n\u003cp\u003eShe nodded, still not making a move for the door.\u003c/p\u003e\n\u003cp\u003e“Whatever it is, say it, Darcy?”\u003c/p\u003e\n\u003cp\u003e“How did you find me?” she asked, and it wasn’t an accusation, but a question.\u003c/p\u003e\n\u003cp\u003eA little voice whispered in my ear.\u003c/p\u003e\n\u003cp\u003eHe couldn’t say it. He just couldn’t.\u003c/p\u003e\n\u003cp\u003e“Darcy, you weren’t with us, and the last place we saw you was the churchyard. You have to admit yourself, it was the obvious place to look.”\u003c/p\u003e\n\u003cp\u003e“I guess…but you found the freshly dug grave—even with the tree over it.”\u003c/p\u003e\n\u003cp\u003e“You shouted out. I heard you.”\u003c/p\u003e\n\u003cp\u003eShe nodded, then flashed him a sudden smile. “Sure.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Darcy, that was no great mystery.”\u003c/p\u003e\n\u003cp\u003e“Right. I agree,” she told him. She was still smiling.\u003c/p\u003e\n\u003cp\u003e“Darcy, don’t go getting weird ideas that you don’t share with me. Why on earth would you suddenly have a suspicion that I had killed Lavinia?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“She left here alive and well.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t she supposed to do some kind of a fund-raiser or something at Melody House, even after you two divorced?” Darcy asked.\u003c/p\u003e\n\u003cp\u003eHe sighed, and looked at his hands. “Darcy, it’s really so cut-and-dried it’s boring. We met, we were attracted, whirlwind, we got married. She thought that I was ready to enter her world. Here I was, the heir to a small Virginian dynasty, founding fathers, all that rot. She thought that she could turn me into what she wanted. I had mistakenly believed that she was done with party after party, and so on. We argued like cats and dogs, and then I knew I’d made the biggest mistake in the world. She’d thought she’d get me into politics, with my heritage and the house, and being a cop and a sheriff. At this particular phase of my life, my interest is here. Keeping the place afloat, taking the town into the future. My fund-raisers are for this place, and then civic—we need money to keep the kids off drugs, even here, and for awareness, and everything else that society faces. We were finally amicable, both realizing that we’d made a mistake, seeing what we wanted to see in one another, and not what was really there. But I really don’t hate her anymore. I feel rather ambivalent toward her. That’s all. Hunt her down, if you feel the need.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I didn’t mean to pry so much…sorry, yes. Maybe I did.”\u003c/p\u003e\n\u003cp\u003eThe front door to the house opened while they were still sitting there. Penny came out on the porch. “Matt? Everything all right? There’s a phone call for you on the main line. Jason Johnstone. Should I tell him to call back?”\u003c/p\u003e\n\u003cp\u003e“No, we’re coming in,” Matt called.\u003c/p\u003e\n\u003cp\u003eDarcy quickly exited her door, asking Penny where Adam was as she walked by her into the house. Matt followed more slowly, telling Penny he’d pick up the line in his upstairs office.\u003c/p\u003e\n\u003cp\u003eDarcy had disappeared by the time he reached the second-floor landing. He walked into his own room, to the desk in the office area of the suite, and punched in the line on the phone.\u003c/p\u003e\n\u003cp\u003e“Jason, hi, Matt. Sorry to have kept you waiting.”\u003c/p\u003e\n\u003cp\u003e“That’s all right. I could have called back. I just wanted to let you know that I did write up what happened today. But I think you’ll like it.”\u003c/p\u003e\n\u003cp\u003eMatt inhaled on a deep breath. “Look, Jason, I know I have a chip on my shoulder about the whole ghost thing. But I mean it—you are a journalist, and a good one. Don’t let me influence what you write.” \u003c/p\u003e","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-53.html","bookId":2267,"creation":"Oct 5, 2019 5:25:12 PM","modification":"Oct 5, 2019 5:25:12 PM"}
