{"id":87876,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eOn the other end of the line, Jason laughed. “Matt, honestly, I wrote what I saw. I think you’ll be fine with it. The only thing is, of course, Max Aubry will see it, and write what he wants to the following day. We are at rival papers.”\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter, Jason. Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“I thought you should be forewarned.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you at the reenactment.”\u003c/p\u003e\n\u003cp\u003e“I’ll be working.”\u003c/p\u003e\n\u003cp\u003e“They’re not making you play your famous ancestor?”\u003c/p\u003e\n\u003cp\u003e“Can’t. I’m still the sheriff here.”\u003c/p\u003e\n\u003cp\u003e“Great. I’ll see you, then.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Jason.”\u003c/p\u003e\n\u003cp\u003eAs he hung up, he thought he heard another click that preceded his own.\u003c/p\u003e\n\u003cp\u003eHe frowned. Who the hell would be listening in on his conversations?\u003c/p\u003e\n\u003cp\u003eAnd why?\u003c/p\u003e\n\u003cp\u003eDarcy dropped by Adam’s room and was dismayed to find him sneezing. Since he had been old for a parent when Josh had been born, she feared for his health now that he was twenty-five years older.\u003c/p\u003e\n\u003cp\u003e“You caught a cold today!” she said.\u003c/p\u003e\n\u003cp\u003e“Never mind me,” he said, waving a hand in the air. “What on earth happened to you in that cemetery today?”\u003c/p\u003e\n\u003cp\u003e“Believe it or not, I really don’t know.”\u003c/p\u003e\n\u003cp\u003e“How can you not know?” he asked.\u003c/p\u003e\n\u003cp\u003e“Because it was pouring, and the wind was howling as if a sudden hurricane had popped up. It was really strong, and you know it. What I said in the Wayside Inn this afternoon was the truth, the whole truth. I was running to jump a wall and get to the cars, and suddenly I was in the hole.”\u003c/p\u003e\n\u003cp\u003e“So the wind blew you in?”\u003c/p\u003e\n\u003cp\u003e“Maybe,” she said.\u003c/p\u003e\n\u003cp\u003e“You were pushed?”\u003c/p\u003e\n\u003cp\u003e“I might have been, but I really don’t know.”\u003c/p\u003e\n\u003cp\u003eHe sneezed again.\u003c/p\u003e\n\u003cp\u003e“Adam, you’re getting sick.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, but he looked worn and tired as well.\u003c/p\u003e\n\u003cp\u003e“I’ve taken some cold stuff, and I’m going straight to bed,” he told her. “I was just waiting up for you to come in.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “I swear to you that I’m just fine. But I am worried about you.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “There was that incident in the library. And now this. I don’t like any of it, Darcy. We’ve had problematic ghosts before, but…there’s something here that’s just not right.”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Adam, did you ever meet Lavinia Harper?”\u003c/p\u003e\n\u003cp\u003e“Once or twice. Why?”\u003c/p\u003e\n\u003cp\u003e“Just curious, I suppose.”\u003c/p\u003e\n\u003cp\u003e“Ah, the ex-wife. Rich, stunning, always throwing parties for some cause or another, but underneath it all, not a truly generous or nice woman,” Adam said.\u003c/p\u003e\n\u003cp\u003e“But a living one, right?”\u003c/p\u003e\n\u003cp\u003eHe frowned. “You’re suggesting she might be dead?”\u003c/p\u003e\n\u003cp\u003e“No,” she said quickly. Too quickly. “I mean…Matt is truly a decent guy. Hardheaded and heavy-handed at times, but ethical, I would swear. Still…”\u003c/p\u003e\n\u003cp\u003e“You think your ghost might be his murdered wife?” Adam sounded very skeptical.\u003c/p\u003e\n\u003cp\u003e“No. I really don’t think that. But I don’t want to be an idiot, either. People say she was supposed to show up here…but that no one heard from her.”\u003c/p\u003e\n\u003cp\u003e“I see what you mean. And very difficult when you’re so infatuated with Matt,” Adam said flatly.\u003c/p\u003e\n\u003cp\u003eShe cast him a frown.\u003c/p\u003e\n\u003cp\u003e“You don’t believe in him?” Adam asked, a slight smile curving his lips.\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“Too much, Adam.”\u003c/p\u003e\n\u003cp\u003e“We’ll check into Lavinia’s whereabouts,” Adam promised her. “Oh, ye of little faith!”\u003c/p\u003e\n\u003cp\u003e“I do have faith!” she protested.\u003c/p\u003e\n\u003cp\u003e“Cover all the bases, Darcy. I’m teasing you. I’ve always told you to cover all the bases, right?” Adam said, smiling at her.\u003c/p\u003e\n\u003cp\u003e“Adam,” she began, then hesitated, and started again. “I’ve seen too many women fall…fall in love. And lose their minds and their senses because of it. I don’t want to be an idiot because…” She shook her head and threw her hands up. “Because I am so infatuated!”\u003c/p\u003e\n\u003cp\u003e“Good girl!” he said. Then he sneezed again.\u003c/p\u003e\n\u003cp\u003e“Get in bed!” she chastised, giving him a kiss on the cheek and then walking to the door. “Good night!” she called to him.\u003c/p\u003e\n\u003cp\u003e“Darcy.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. We’ll find Lavinia,” he told her. “And Darcy, you’ll get me immediately if you need me!” he commanded. Then he sneezed again.\u003c/p\u003e\n\u003cp\u003e“Absolutely,” she promised.\u003c/p\u003e\n\u003cp\u003eIn her own room, she paced awhile, wondering if Matt would come that night.\u003c/p\u003e\n\u003cp\u003eProbably not. He was offended that she had suspected him of foul play in the nonappearance of his wife. She started to put on a T-shirt, then opted for her lacy white gown instead, thinking wryly that, if she did go down the stairway that night, she could convince any onlooker that she was the lady in white.\u003c/p\u003e\n\u003cp\u003eRestless, she watched the late show. But then she fell asleep. She tried very hard to clear her mind before she did so, since the day’s events had prevented Adam from trying hypnotism again.\u003c/p\u003e\n\u003cp\u003eThe dream came again.\u003c/p\u003e\n\u003cp\u003eNot the violence of it, or the murder.\u003c/p\u003e\n\u003cp\u003eJust the woman, a haze of white, staring down at her at first where she lay in the bed. She heard a single whisper. “Please!”\u003c/p\u003e\n\u003cp\u003eThen the woman moved to the door, and slipped through it.\u003c/p\u003e\n\u003cp\u003eAwake, Darcy rose, and hurried after her.\u003c/p\u003e\n\u003cp\u003eOnce again, she waited on the stairway. Halfway down, she waited again. Darcy followed. At the front door she hesitated, remembering all the warnings she had received, and the fear she had felt herself.\u003c/p\u003e\n\u003cp\u003eBut she wanted so desperately to get at the truth.\u003c/p\u003e\n\u003cp\u003eThere were umbrellas in an old stand near the door. She took one, then let herself out.\u003c/p\u003e\n\u003cp\u003eThe ghost waited on the porch steps. Then she started moving again, drifting toward the smokehouse.\u003c/p\u003e\n\u003cp\u003eTonight, she went in.\u003c/p\u003e\n\u003cp\u003eThe old building was in sound repair, and from the scent within, was obviously still used. Darcy opened the door, and stood there, looking into the darkness.\u003c/p\u003e\n\u003cp\u003eGreat. She had an umbrella. No flashlight.\u003c/p\u003e\n\u003cp\u003eAnd still, with only the moonbeams hurtling down for illumination, Darcy could see the ghost. Standing in the middle of the small space.\u003c/p\u003e\n\u003cp\u003e“Please!” she said again.\u003c/p\u003e\n\u003cp\u003eA rustling sound came from behind Darcy. She swung around with her umbrella, ready to strike. She thought that she saw a shadow, disappearing against the stable wall.\u003c/p\u003e\n\u003cp\u003eA feeling of cold wrapped around her shoulders and she heard the whisper again, right against her ear, urgent and quick. “Please!”\u003c/p\u003e\n\u003cp\u003eSuddenly, she knew. Exactly what the ghost was trying to say, and exactly what she wanted. There was an old call bell for the plantation hands on the porch. Darcy ran like a maniac to clang it, then raced back to the smokehouse again.\u003c/p\u003e\n\u003cp\u003eShe ignored the darkness, burst into the center of it, and began to dig, using the point of the umbrella. She’d gotten down no more than a foot, and was so involved in her task, that she screamed when she felt hands on her shoulders.\u003c/p\u003e\n\u003cp\u003eShe spun around.\u003c/p\u003e\n\u003cp\u003eMatt.\u003c/p\u003e\n\u003cp\u003e“What the hell are you doing?” His words sounded like an angry growl. She took a step back, aware of his size, and of the darkness.\u003c/p\u003e\n\u003cp\u003eBut she had rung the bell loudly enough to wake the dead. Naturally, he was out here. And yet, in the small room, it seemed that he was staring at her with malignant eyes.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” The shout came from the house. Penny was running on out. Adam, with a slip cap and robe on, was hurrying along behind her.\u003c/p\u003e\n\u003cp\u003e“She’s here!” Darcy said. “She’s here, I know it!”\u003c/p\u003e\n\u003cp\u003eBy then, Sam Arden, Clint, and Carter had come from the stables. They were all barefoot, dressed in nothing but hastily thrown-on jeans.\u003c/p\u003e\n\u003cp\u003e“What the hell…?” Clint demanded, rubbing his five o’clock shadow.\u003c/p\u003e\n\u003cp\u003eCarter stared at the scene. “She thinks she’s found something,” he murmured to Clint. “Hey, should I get a shovel?”\u003c/p\u003e\n\u003cp\u003e“Yes, please!” Darcy said.\u003c/p\u003e\n\u003cp\u003eMatt threw up his hands. “Hell. Sure. Get a shovel. Let’s dig in the middle of the night.”\u003c/p\u003e\n\u003cp\u003eSam disappeared with Carter. They were back in a minute with two shovels, a portable floodlight, and a pick.\u003c/p\u003e\n\u003cp\u003e“Darcy, move, let me at it,” Carter said, entering the little room, and starting right off with the pick. He loosened the earth, and Matt joined him to start digging, swearing beneath his breath as he did so.\u003c/p\u003e\n\u003cp\u003eThe others looked on. Minutes ticked by, and mounds of dirt came out of the smokehouse.\u003c/p\u003e\n\u003cp\u003eSweating despite the coolness of the wee hour, grimy with dirt, Matt wiped his brow. He glared at her. She forced herself to stand firm, wishing that she didn’t note that his physique remained exceptionally imposing, tanned biceps and chest glistening with sweat, streaked with mud.\u003c/p\u003e\n\u003cp\u003e“Darcy, we’re down several feet.”\u003c/p\u003e\n\u003cp\u003eShe let out an impatient sound and started for the smokehouse herself. He raised a hand to her. “All right, all right!”\u003c/p\u003e\n\u003cp\u003eHe went back to it with a vengeance.\u003c/p\u003e\n\u003cp\u003eStill, it was Carter who gave a sudden cry.\u003c/p\u003e\n\u003cp\u003e“Damn!”\u003c/p\u003e\n\u003cp\u003e“What, what?” Darcy cried.\u003c/p\u003e\n\u003cp\u003e“He probably shoveled his own toe,” Penny murmured.\u003c/p\u003e\n\u003cp\u003eMatt hunkered down with Carter. Clint nosed his way in. Darcy couldn’t get past them.\u003c/p\u003e\n\u003cp\u003e“What is it?” she cried out.\u003c/p\u003e\n\u003cp\u003eMatt rose, tossing down his shovel, glaring at her once again as he started to walk by her. “Don’t anyone touch anything else. I’m getting a team out here.”\u003c/p\u003e\n\u003cp\u003e“A team?” she said.\u003c/p\u003e\n\u003cp\u003eHe stopped walking, hands on his hips, eyes like ebony as he stared down at her. “A forensics team, Darcy. Yes, we found bones.”\u003c/p\u003e\n\u003cp\u003e“Could be an animal,” Penny suggested softly. “It is a smokehouse.”\u003c/p\u003e\n\u003cp\u003eMatt glanced over to her. “It’s human. It appears to be complete, or nearly complete.”\u003c/p\u003e\n\u003cp\u003e“But do you really need a team in the middle of the night?” Penny said, perplexed. “Poor thing has probably been there for hundreds of years.” \u003c/p\u003e","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-54.html","bookId":2267,"creation":"Oct 5, 2019 5:25:12 PM","modification":"Oct 5, 2019 5:25:12 PM"}
