{"id":87883,"no":61,"title":"Page 61","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Stop!” Matt said. “Give me the names again!”\u003c/p\u003e\n\u003cp\u003e“Susan Howell, Catherine Angsley. There’s a Tammy Silvera—hey, have you ever heard of these women?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Matt said dully. “They dated a friend of the family. A man named Carter Sutton.” He looked anxiously around the field. He could see nothing but powder. Darcy had left the house that day with Carter and Clint. He hadn’t seen any of them since, except for Clint, when he lay on the ground after the first volley.\u003c/p\u003e\n\u003cp\u003e“Randy, I’ve got to go. We need APBs out on Carter Sutton, right away. I’ve got to find him. I need you to get to my own men for me—I’ve got to get searching through this crowd.”\u003c/p\u003e\n\u003cp\u003eHe rang off, not waiting for Randy’s reply; he knew the man would take it from there.\u003c/p\u003e\n\u003cp\u003eRight then, he felt a sense of sheer panic.\u003c/p\u003e\n\u003cp\u003eCarter had dated the women, yes. Didn’t mean that Carter had made them disappear.\u003c/p\u003e\n\u003cp\u003eClint, and Carter. They both went through women with total nonchalance.\u003c/p\u003e\n\u003cp\u003eHe felt ill, thinking that Darcy still might be with either of them.\u003c/p\u003e\n\u003cp\u003eActivity was spinning around him. Where the hell were they?\u003c/p\u003e\n\u003cp\u003eThis way.\u003c/p\u003e\n\u003cp\u003eHe almost fell off his horse. The whisper again. He looked toward the trees. Nothing.\u003c/p\u003e\n\u003cp\u003eThis way!\u003c/p\u003e\n\u003cp\u003eThe whisper, urgent, fierce.\u003c/p\u003e\n\u003cp\u003eHe started to ride.\u003c/p\u003e\n\u003cp\u003e“Wait a minute—maybe I am going the wrong way,” Clint said. “I don’t believe this! I’m disoriented myself. Hang on a minute.”\u003c/p\u003e\n\u003cp\u003eClint dismounted and disappeared into the smoke. Darcy waited. At her side, Oola began growling.\u003c/p\u003e\n\u003cp\u003e“What is it, girl?”\u003c/p\u003e\n\u003cp\u003eA moment later, a man emerged from the trees. But it wasn’t Clint. It was Carter.\u003c/p\u003e\n\u003cp\u003e“Hey, lady! You’re going the wrong way!” he called cheerfully.\u003c/p\u003e\n\u003cp\u003eOola growled again.\u003c/p\u003e\n\u003cp\u003e“Shush, girl! It’s only Carter. Where’s Clint?”\u003c/p\u003e\n\u003cp\u003e“I was riding his horse. I gave it back to him. Let me mount up and show you the right way to go.”\u003c/p\u003e\n\u003cp\u003e“Come on up.”\u003c/p\u003e\n\u003cp\u003e“Turn her around,” Carter said. She did so, and they started to trot.\u003c/p\u003e\n\u003cp\u003e“My God, that smoke carries!” Darcy said.\u003c/p\u003e\n\u003cp\u003e“I know. It’s blinding, right.”\u003c/p\u003e\n\u003cp\u003e“Big time!”\u003c/p\u003e\n\u003cp\u003e“Hey, pull up ahead for a minute, will you?”\u003c/p\u003e\n\u003cp\u003e“Sure.” Darcy frowned, trying to see clearly. They had come to the area where the bridge spanned the rushing stream. “Why are we here?”\u003c/p\u003e\n\u003cp\u003e“Sorry, it’s on the way back to the house. We’re meeting up there. But I had to run over and do duty on the bridge after the first engagement. I lost a glove. Do you mind? It will only take a minute for me to feel around for it.” Carter smiled at her, and slipped from the horse’s back. “Hey! How about giving me a hand. It will go faster.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eCarter helped her down.\u003c/p\u003e\n\u003cp\u003e“Go on. Let me just tether Nellie to this tree.”\u003c/p\u003e\n\u003cp\u003eNonchalantly, Carter started toward the bridge. Darcy tethered Nellie to a branch, then turned back. To her amaze ment, Oola started to growl again and went rushing toward the bridge. She heard the dog yelp.\u003c/p\u003e\n\u003cp\u003e“Oola! Carter, what happened?”\u003c/p\u003e\n\u003cp\u003eHalfway to the bridge, she came to a sudden halt. She could see Carter, standing there, waiting for her.\u003c/p\u003e\n\u003cp\u003eShe could also see a strange white form through the mist.\u003c/p\u003e\n\u003cp\u003e“Darcy? What are you waiting for?”\u003c/p\u003e\n\u003cp\u003e“What happened to the dog?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Maybe she stepped on a sharp stone or something.”\u003c/p\u003e\n\u003cp\u003eDarcy didn’t move. The white mist was next to Carter. She couldn’t believe that he didn’t see it, especially against the smoky tinge the day had taken on.\u003c/p\u003e\n\u003cp\u003e“Darcy, what on earth is the matter with you?”\u003c/p\u003e\n\u003cp\u003e“The ghost is there, Carter. Right next to you,” she said.\u003c/p\u003e\n\u003cp\u003eHe jumped, staring around. But he still didn’t see. He turned back to Darcy, his eyes narrowing. “Come here, Darcy.”\u003c/p\u003e\n\u003cp\u003e“Not on your life, Carter.”\u003c/p\u003e\n\u003cp\u003eBut she wasn’t prepared. He ran like a bat out of hell, so suddenly and swiftly that she had barely screamed and turned to run before he was on top of her, grappling her to the ground. “You’re going over the bridge, Darcy. This time, you’re going over. I meant business at the cemetery—but again, I thought you’d be smart enough to get away from here. No, not you. So…before you find the bones again, Darcy, you’ve got to have a real fall.”\u003c/p\u003e\n\u003cp\u003eHe held her down. But her fingers were grasping in the dirt. She managed to get a handful. She got a good grip, and threw it in his eyes. His hold on her eased as he shouted in pain, instinctively bringing his hands to his face as he tried to clear his vision.\u003c/p\u003e\n\u003cp\u003eDarcy took full advantage. She brought her knee to his groin with all her strength. He howled with pain. She shot to her feet.\u003c/p\u003e\n\u003cp\u003eBut before she could run, his fingers wound around her ankle, and he jerked her hard, back down to the earth.\u003c/p\u003e\n\u003cp\u003eThe world spun in black. She felt him picking her up. She knew he meant to take her to the bridge and throw her over. And she would break her neck, or smash her skull, and she would die there, and when they found her…\u003c/p\u003e\n\u003cp\u003eWell, it would look as if she had gotten lost in the black powder. Wandered over the bridge, fallen….\u003c/p\u003e\n\u003cp\u003e“You killed her, the girl in the smokehouse,” Darcy said, praying her strength would return.\u003c/p\u003e\n\u003cp\u003e“Her? Yeah, I killed the girl in the smokehouse.” He looked down at her. “Kind of a sad thing, really. You’re terrific, Darcy. You really are. But you just had to go and find the bones. And open the whole can of worms. I really am sorry, Darcy. But…hopefully,” he said softly, “it will be quick.”\u003c/p\u003e\n\u003cp\u003eShe had gathered her senses again. The world had ceased to spin.\u003c/p\u003e\n\u003cp\u003eShe raised her fist with all her strength against his eye. He grunted, doubling in pain, and she raked her nails down his arm, escaping his hold and falling hard to the ground.\u003c/p\u003e\n\u003cp\u003eThey had come to the bridge.\u003c/p\u003e\n\u003cp\u003eAnd he was scrambling to get ahold of her again.\u003c/p\u003e\n\u003cp\u003eChapter 19\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003eM att raged inwardly at himself for being a fool. Even as he carefully rode Vernon through the crowds of people, he flicked open his phone again and called Thayer. The phone rang and rang. He knew his deputy was in the midst of the throng, and swore, praying that Thayer would hear the call. He had about given up when he heard, “Thayer here.”\u003c/p\u003e\n\u003cp\u003e“Thayer, it’s Matt. I can’t explain but get all our men looking for Carter Sutton. Hold him.”\u003c/p\u003e\n\u003cp\u003e“Hold Carter? On what charge?”\u003c/p\u003e\n\u003cp\u003e“Suspicion of murder.”\u003c/p\u003e\n\u003cp\u003e“Murder? Carter?”\u003c/p\u003e\n\u003cp\u003e“Damn it, Thayer, just do it. Get him, and hold him. And keep an eye out for Darcy Tremayne.”\u003c/p\u003e\n\u003cp\u003e“She murdered someone?”\u003c/p\u003e\n\u003cp\u003e“Thayer, I don’t have time. Just do it.”\u003c/p\u003e\n\u003cp\u003e“I’m right on it, Matt.”\u003c/p\u003e\n\u003cp\u003eHe clicked off, swearing that he should be in the midst of so many people. With the exhibition over, they were thronging over the fields.\u003c/p\u003e\n\u003cp\u003eThayer had been alerted; whether his deputy thought he had gone off the deep end or not, he would see that every man they had was looking for Carter. And just because women Carter had dated were missing did not mean that Carter had murdered. But a number of women Carter had dated were missing, and a skeleton had been discovered on property Carter knew like the back of his hand. Then the skeleton had disappeared. And he didn’t know where Carter was, and he didn’t have Darcy. Carter didn’t know that his game might be up anyway, that Matt had asked the FBI to run a check of missing women. In Carter’s mind, Darcy must surely be dangerous. If he had stolen the bones from the morgue, he must be afraid that Darcy could find them again, wherever he had taken them.\u003c/p\u003e\n\u003cp\u003eAnd there was a voice in his head, telling him which way to go. Insane, but hell, everyone had instinct. And instinct was telling him to follow the voice.\u003c/p\u003e\n\u003cp\u003eHe ignored the sound when he first heard his name called, he was so intent on following his intuition, or the voice.\u003c/p\u003e\n\u003cp\u003eThen he realized that it was Adam Harrison, and he pulled in on the reins.\u003c/p\u003e\n\u003cp\u003e“Matt, there’s no sign of Darcy,” he said. “Clint went to find her. He’d left her in the rear for a better view. Now Clint hasn’t returned. I’m not Darcy, Matt, but I have one damned bad feeling.”\u003c/p\u003e\n\u003cp\u003e“Adam, I have that feeling myself. But don’t worry. I’m going for Darcy.”\u003c/p\u003e\n\u003cp\u003eHe nudged Vernon and moved on. He had cleared the battlefield when he was blocked again by someone on horseback, hazy in the black smoke, but solidly on the trail.\u003c/p\u003e\n\u003cp\u003e“Matt!” she cried.\u003c/p\u003e\n\u003cp\u003eLavinia. On a horse. Lavinia, who hated horses.\u003c/p\u003e\n\u003cp\u003e“Lavinia, what the hell are you doing? Get out of my way.”\u003c/p\u003e\n\u003cp\u003e“Matt! Please, you have to listen to me,” she said.\u003c/p\u003e\n\u003cp\u003e“Not now, Lavinia.”\u003c/p\u003e\n\u003cp\u003e“You have to listen to me. I told Carter I wanted to be with Darcy to watch the show. He said sure, then disappeared. And I can’t find her now. Or Carter. Or Clint! Matt, there are a few things that I never told you. And when I was going through the crowd, I saw some guy in blue with Clint’s horse. They’ve all disappeared. Matt, there’s something I never told you—”\u003c/p\u003e\n\u003cp\u003e“You’re too late, Lavinia, whatever it is. Get out of my way.” He urged Vernon forward, heedless of her presence there.\u003c/p\u003e\n\u003cp\u003e“Wait, Matt!” She grappled for the reins as Vernon forced her horse off the side of the trail. “Please listen to me! I was certain I was wrong, that I had to be wrong…but I’m afraid for Darcy.”\u003c/p\u003e\n\u003cp\u003e“Damn it, I’m afraid for her, too! That’s why I’m trying to find her.”\u003c/p\u003e\n\u003cp\u003eHe went on past her, nudging Vernon into a lope.\u003c/p\u003e\n\u003cp\u003eShe was following him, swearing as she clung to the saddle.\u003c/p\u003e\n\u003cp\u003e“I’m coming with you!” she called out to him.\u003c/p\u003e\n\u003cp\u003e“Go back! You’ll slow me down.”\u003c/p\u003e\n\u003cp\u003e“No, no…I can keep up.”\u003c/p\u003e\n\u003cp\u003e“Do what you want, but stay out of my way.”\u003c/p\u003e\n\u003cp\u003eHe nudged Vernon into greater speed. Nothing seemed to matter anymore except for the voice in his head, guiding him onward. \u003c/p\u003e","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-61.html","bookId":2267,"creation":"Oct 5, 2019 5:25:12 PM","modification":"Oct 5, 2019 5:25:12 PM"}
