{"id":23254,"no":14,"title":"CHAPTER XIII. THE ARROW AND THE PIONEER.","content":"\u0026nbsp;After this Joshua was more careful about annoying Walter. Though he was older, and a little taller than our hero, he had found to his cost that he was not a match for him in strength. He had also made the unwelcome discovery that Walter did not intend to be imposed upon. So, though he ventured to sneer at times, he thought it best to stop short of open insult. There was also another motive which influenced him. His father forbade him in tones more decided than usual to interfere with Walter, whose services he was anxious to retain in the store. Mr. Drummond also had another reason for this command. He thought that Walter might be mistaken as to the state of his father\u0027s affairs, and that a few thousand dollars might be rescued by his executor from the ruin. In that case, there would be a chance[Pg 118] of his obtaining control of Walter\u0027s property during his minority. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The picnic came off on Saturday afternoon. The weather, which often throws a wet blanket upon the festivities of such occasions, was highly propitious, and several hundred persons, young and middle-aged, turned out en masse. The place selected for the picnic was a field of several acres, bordering upon a pond. This had been fitted up by the proprietor with swings, and a roofed building without sides, under which were placed rough board tables for the reception of provisions. A number of oak trees with their broad branches furnished shelter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Besides these arrangements for enjoyment, there were two boats confined by iron chains, which were thrown around trees near the brink of the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After enjoying the swing for a time, there was a proposition to go out in the boats.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boats could comfortably accommodate eight persons each. This number had been obtained, when Joshua came up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going,\" he said unceremoniously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 119]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will have to wait till next time,\" said Ralph Morse. \"We\u0027ve got the full number.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027m going this time,\" said Joshua, rudely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t believe there\u0027s room. We have eight already.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s room for nine. If there isn\u0027t you can wait till next time yourself. Besides, you want me to steer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know how to steer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I do,\" said Joshua, boastfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess we can make room,\" said Mary Meyer, who was always in favor of peaceful measures.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joshua clambered in, and took his place as steersman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other boat had already set off, and, as it happened, under the guidance of Walter Conrad, who had long been accustomed to managing a boat, having had one of his own at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027ve got a great steerer on the other boat,\" said Joshua, sneering.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s your cousin, isn\u0027t it? Doesn\u0027t he know how to steer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 120]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About as well as an old cat. He thinks he does, though.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Attention was thus directed to the other boat, which was making easy progress through the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see but he manages well enough,\" said Rudolph, after watching it for a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s easy enough steering here. Wait till we get out a little way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where are you steering, Joshua?\" asked Ralph, suddenly, for the boat nearly half turned round. The fact was that Joshua himself knew very little about steering. In speaking of Walter\u0027s want of skill, he had precisely described himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand what I\u0027m about,\" answered Joshua, suddenly reversing the direction, and overdoing the matter, so as to turn the boat half way round the other way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you do,\" said Ralph, \"but it don\u0027t look much like it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was looking at the other boat,\" Joshua condescended to explain, \"and the rudder slipped.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter\u0027s boat kept the lead. His perfect steering[Pg 121] made the task easier for the rowers, who got the full advantage of their efforts. Joshua, however, by his uncertain steering, hindered the progress of his boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t we beat the other boat?\" asked Joseph Wheeler, who was rowing. \"I can row as well as either of those fellows.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So can I,\" said Tom Barry; \"let\u0027s try.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boats were about five lengths apart, the rowers in the foremost boat not having worked very hard, when Tom and Joe began to exert themselves. Their intention was soon manifest, and the spirit of rivalry was excited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do your best, boys!\" said Walter. \"They\u0027re trying to catch us. Don\u0027t let them do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The rowers of the two boats were about evenly matched. If anything, however, Tom and Joe were superior, and, other things being equal, would sooner or later have won the race. But Joshua, by his original style of steering, which became under the influence of excitement even more unreliable, caused them to lose perceptibly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 122]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t you steer straight by accident, Joshua?\" asked Tom, in a tone of vexation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know more about steering than you do, Tom Barry,\" growled Joshua, getting red in the face, for he could not help seeing that he was not appearing to advantage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Show it, then, if you do,\" was the reply. \"If we had your cousin to steer us, we could soon get ahead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was very mortifying to Joshua. He did not care to be outdone by any one, but to be outdone by Walter was particularly disagreeable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t the steering, it\u0027s the rowing,\" he said. \"You don\u0027t row even.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you try it, then,\" said Joe, \"and show us what you can do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027d rather steer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joshua considered that the steersman\u0027s place was the place of honor, and he was not disposed to yield it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Walter, from his place in the first boat, watched the efforts of his rivals. He was [Pg 123]determined to keep the lead which he had secured, and had little fear of losing it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give way, boys!\" he cried; \"we\u0027ll distance them, never fear!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Every moment increased the distance between the two boats, to the great satisfaction of those on board the \"Arrow,\" for that was the name of the head boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just at the north-western corner of the pond there was an inlet of considerable length, but narrow. Here the water was shallower than in the remainder of the pond.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall we go in there?\" asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, yes,\" said his fellow-passengers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Accordingly he steered in, and shortly afterwards the \"Pioneer,\" Joshua\u0027s boat, also entered. At this time the distance between the two boats was quite two hundred feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The \"Arrow\" pursued her way steadily to the head of the inlet, a distance of nearly a quarter of a mile; and then making a graceful turn, started on her homeward trip. The width of the inlet here[Pg 124] was very much contracted. After making the turn the \"Arrow\" met the \"Pioneer\" after a little distance. There was abundant room for the boats to pass each other, if they had been properly managed. There was no fault in Walter\u0027s steering, but, by an awkward blunder of Joshua\u0027s, the \"Pioneer\" veered in her course so that the \"Arrow\" struck her, to use a nautical term, amidships. As she was being impelled rapidly at the time, the shock was considerable, and the fright still greater. The girls jumped to their feet screaming, and Joshua himself turned pale with fright, but recovered himself sufficiently to call out angrily, \"What made you run into us, you fool?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s your own fault, Joshua,\" said Tom Barry, angrily. \"You\u0027re the most stupid steerer I ever saw. What made you turn the boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s his fault,\" said Joshua, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let somebody else steer,\" said Joe Wheeler. \"A baby could steer better than he.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So a younger boy was put in Joshua\u0027s place, much to his mortification, and he was degraded, as he considered it, to the rank of a passenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 125]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going ashore,\" he said sourly. \"Let me out up here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Tom Barry. \"I guess we can get along without you. Here, you fellows on the \"Arrow,\" just wait a minute, till we\u0027ve landed Joshua, and we\u0027ll race you back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n True to his determination, Joshua jumped off at the head of the inlet, and the \"Pioneer\" was turned by her new pilot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The \"Arrow\" and the \"Pioneer\" took their places side by side, and the race commenced. The boats were similar, and thus neither had the advantage on this score. But the rowers on the \"Pioneer\" were on the whole stronger and more skilful than those on the \"Arrow.\" On the other hand, Walter steered perfectly, while Joshua\u0027s successor, though he made no bad blunder, was a novice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The result was that the race was a clear one. Finally the \"Arrow\" came in a length ahead, and Walter felt with quiet satisfaction that the victory had been gained by his efforts.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He thought once more of the song he had heard,[Pg 126] and hoped that he would be as successful through life in paddling his own canoe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joshua went home sulky, and was not seen again on the picnic grounds.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3005/82937.html","bookId":296,"creation":"Aug 2, 2019 3:28:57 PM","modification":"Aug 2, 2019 3:28:57 PM"}
