{"id":23256,"no":16,"title":"CHAPTER XV. WAYS AND MEANS.","content":"\u0026nbsp;Having decided to purchase a lottery ticket, the important question suggested itself, \"Where was he to obtain the necessary five dollars?\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To most boys or young men of eighteen this would not have been a difficult question to solve. But to Joshua it was a perplexing problem. If he saved his entire weekly allowance, it would take him twenty weeks to obtain the needed sum. This delay was not to be thought of. Was there any pretext on which he could ask his father for five dollars? He could think of none that would be likely to succeed. Had he been trusted with the purchase of his own clothes, he might have asked for a new coat and misapplied the money; but Mr. Drummond took care to order Joshua\u0027s clothes himself from the village tailor, and never did so without grumbling at the expense he was obliged[Pg 138] to incur. Indeed, Joshua was not able to boast much of his clothes, for his father was not disposed to encourage extravagance in dress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps mother may have the money,\" thought Joshua. \"If she has, I\u0027ll get it out of her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He resolved at once to find out whether any help was to be obtained from this quarter, and with this object turned his steps at once homeward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Drummond was engaged in the homely employment of darning stockings when Joshua entered the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re home early, Joshua,\" she remarked, looking up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, mother. Have you got anything good to eat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I baked a small pie for you in a saucer. I thought that was the best way. The other evening your father noticed that a piece was gone from the half pie that was taken from the supper-table.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How awful mean he is!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shouldn\u0027t say that of your father, Joshua.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s true, mother, and you know it. He\u0027s the meanest man in town.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 139]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t like to hear you talk in that way, Joshua. Don\u0027t forget that he is your father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish he\u0027d treat me like a father, then. I leave it to you, mother, if twenty-five cents a week isn\u0027t a miserable allowance for a fellow of my age.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is rather small,\" said Mrs. Drummond, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Small! I should think it was. It\u0027s just about right for a boy of ten. That\u0027s just the way he treats me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps, if you would speak to your father about it, Joshua—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have spoken to him, and that\u0027s all the good it does. He blows me up for my extravagance. Extravagance on twenty-five cents a week!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll speak to him myself, Joshua,\" said his mother;—a heroic resolve, for she knew that the request would bring anger upon herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t mind your talk any more than mine. But I\u0027ll tell you what you can do to oblige me, mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Joshua?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know of a way to make considerable money,[Pg 140] and all I need to go into it is five dollars. If you\u0027ll lend me that, I\u0027ll pay it back to you as soon as I can. I think it won\u0027t be more than a fortnight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the plan you are thinking of, Joshua?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But upon this subject Joshua thought it best to preserve a discreet silence. He knew that the lottery scheme would not impress his mother favorably, and that she would not lend the money for any such purpose. He was aware in what light lotteries are generally regarded. Still his imagination had been inflamed by the stories he had read of other persons\u0027 luck, and he had succeeded in convincing himself that his own chance would be very good. Thus he referred to it, in speaking to his mother, as if he were sure of obtaining a large amount for his investment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell you just at present, mother,\" he said; \"the fact is, somebody else is concerned in it, and I am not allowed to tell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope, Joshua, you have not allowed yourself to be imposed upon. You know you are not used to business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know what I\u0027m about, mother. I\u0027m not a[Pg 141] baby. All I want is the money. Can you lend me five dollars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could; but you know your father doesn\u0027t allow me much money. I get my dress patterns and most of what I want out of the store, so I don\u0027t need it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have to buy things for the house,—groceries, and so on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We have a bill at the grocery store. Your father pays it quarterly; so no money passes through my hands for that purpose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you haven\u0027t got the money, mother,\" said Joshua, disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t had as much as five dollars in my possession at one time for years,\" answered his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was true that Mr. Drummond kept his wife uncommonly close. She was allowed to obtain a limited amount of goods from the store for her own wardrobe, but apart from that her husband appeared to think she had no need of money. More than once she wished she could have a little money at her control to answer occasional calls for charity.[Pg 142] But on one occasion, having been indiscreet enough to give twenty-five cents and a good meal to a woman, sick and poor, who crawled to her door and asked for help, Mr. Drummond indulged in such a display of ill-humor at her foolish extravagance, as he called it, that she was forced afterwards to deny her generous impulses, or give in the most secret manner, pledging the recipient to silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sorry I can\u0027t oblige you, Joshua,\" said his mother. \"Will you have the pie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Joshua, sullenly, for he was at a loss where next to apply, and felt that his scheme of sudden riches was blighted at its inception. Notwithstanding his disappointment, however, he was able to dispose of the pie. After consuming it, he went out of doors, to reflect upon other ways of raising the necessary money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was his cousin Walter; he was quite sure that he had the money, but quite as sure that he would not lend it. Besides, he would have hesitated to apply, on account of the dislike he had come to entertain for our hero. This dislike had been increased by the result of the boat race between[Pg 143] the \"Pioneer\" and the \"Arrow.\" He had occasion to know that the defeat of the former boat was generally ascribed to his own imperfect steering, and he also knew that Walter had obtained considerable credit for his own performance in the same line. Now Joshua knew in his own heart that he could not steer, but he wanted the reputation of steering well, and it was very irksome to him to have to play second fiddle to Walter. He had indicated his dislike ever since by refusing to notice or speak to Walter, except in so far as it was absolutely necessary. Of course Walter noticed this want of cordiality, and was in a measure sorry for it; still he had become pretty thoroughly acquainted with Joshua\u0027s character by this time, and this knowledge led him to feel that the loss of his friendship was not a very serious one. He had made some other acquaintances, in the village, with boys of his own age, in whose society he found considerable more pleasure than he was ever likely to do in Joshua\u0027s.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He can go his way, and I\u0027ll go mine,\" he said to himself. \"I\u0027ll paddle my own canoe, and he may[Pg 144] paddle his. Perhaps he will succeed better in that than in steering,\" he thought with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Help from Walter, therefore, was not to be expected. Was there any one else to help him?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joshua thought doubtfully of his father\u0027s clerk, young Nichols, who has already been introduced to the reader. He did not think there was much prospect of obtaining a loan from Nichols; still there might be. At any rate there seemed no other resource, and he made up his mind to sound him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped into the store one day when Walter was absent on an errand, and his father was out also.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning, Joshua,\" said the salesman. \"What\u0027s up this morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing that I know of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have an easy time. Nothing to do but to lounge about all day. You aint cooped up in a store fourteen hours a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so; but I suppose I\u0027ll have to begin some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you\u0027re all right. Your father\u0027s getting richer every year.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 145]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I suppose he is; but that doesn\u0027t give me ready money now. The fact is, I\u0027m hard up for five dollars. Can\u0027t you lend it to me for a week? I\u0027ll give it back in a week, or ten days at any rate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You couldn\u0027t come to a worse place for money,\" said Nichols, laughing. \"The fact is, I\u0027m hard up myself, and always am. Old Jones, the tailor, is dunning me for this very suit I have on. Fact is, my salary is so small, I have the hardest kind of work to get along.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you can\u0027t lend me the money? It\u0027s for only a week I want it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve got less than a dollar in my pocket, and I\u0027m owing about fifty dollars to the tailor and shoemaker. Perhaps Walter can lend you the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shan\u0027t ask him,\" said Joshua, shortly. \"I\u0027ll go without first.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you like him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t. He\u0027s a mean fellow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nichols was privately of the opinion that the term described Joshua himself much more aptly, but did not express his opinion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3005/82939.html","bookId":296,"creation":"Aug 2, 2019 3:28:57 PM","modification":"Aug 2, 2019 3:28:57 PM"}
