{"id":23270,"no":30,"title":"CHAPTER XXIX. DANGER THREATENS.","content":"\u0026nbsp;After supper, which the man devoured like a wild animal, he proved more sociable. He tried in a rough, uncouth manner to make himself agreeable, and asked Walter numerous questions. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like peddlin\u0027?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell yet,\" said Walter. \"I haven\u0027t been at it long enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can make money pretty fast?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. Some days I expect to do well, but other days I may not sell any books. But I like travelling about from place to place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know but I should like travellin\u0027 myself,\" said Jack. \"Hey, Meg?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anything better than staying in this miserable hole,\" said the woman. \"I\u0027m sick and tired of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, old woman, maybe we\u0027ll start off soon.[Pg 277] You couldn\u0027t get me a chance in your business, could you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter doubted strongly whether a rough, uneducated man like the one before him would be well adapted for the book business, but he did not venture to say so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you would like to try it,\" he said, \"I can give you the name of the agent in Cleveland. He is authorized to employ agents, and might engage you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would he engage the old woman too?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know whether he has any female agents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t do nothing sellin\u0027 books,\" said Meg, \"nor you either. If it was something else, I might make out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, we\u0027ll think about it. This aint a very cheerful place to live, as you say, and it\u0027s about time for a change.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About nine o\u0027clock Walter intimated a desire to go to bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been walking considerable to-day,\" he said, \"and I feel tired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 278]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll show you the place you\u0027re to sleep in,\" said the woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She lit a candle, and left the room, followed by Walter. She led the way up a rough, unpainted staircase and opened the door of the room over the one in which they had been seated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We don\u0027t keep a hotel,\" said she, \"and you must shift as well as you can. We didn\u0027t ask you to stay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking around him, Walter found that the chamber which he had entered was as bare as the room below, if not more so. There was not even a bedstead, but in the corner there was a bed on the floor with some ragged bedclothes spread over it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s where you\u0027re to sleep,\" said the woman, pointing it out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There isn\u0027t much to thank me for. Good-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-night,\" said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She put the candle on the mantel-piece, for there was no bureau or table in the room, and went out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This isn\u0027t a very stylish tavern, that\u0027s a fact,\" thought Walter, taking a survey of the room. \"I[Pg 279] shall have a hard bed, but I guess I can stand it for one night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something else that troubled him more than the poor accommodations. The ill looks of his host and hostess had made a strong impression upon his mind. The particular inquiries which they had made about his success in selling books, and their strong desire for money, led him to feel apprehensive of robbery. He was in the heart of the woods, far away from assistance, and at their mercy. What could he, a boy of fifteen, do against their combined attack? He would have preferred to sleep in the woods without a shelter, rather than have placed himself in their power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Under the influence of this apprehension, he examined the door to see if there was any way of locking it. But there was neither lock nor bolt. There had been a bolt once, but there was none now.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Next he looked about the room to see if there was any heavy article of furniture with which he could barricade the door. But, as has already been said, there was neither bureau nor table. In fact, there[Pg 280] was absolutely no article of furniture except a single wooden chair, and that, of course, would be of no service.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall I do?\" thought Walter. \"That man can enter the room when I am asleep, and rob me of all my money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a perplexing position to be in, and might have puzzled an older and more experienced traveller than our young hero. He opened his pocket-book, and, taking out the money, counted it. There were sixty dollars and a few cents within.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where shall I hide it?\" he considered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking about the room, he noticed a closet, the door of which was bolted on the outside. Withdrawing the bolt he opened the door and looked in. It was nearly empty, containing only a few articles of little or no value. A plan of operations rapidly suggested itself to Walter in case the room should be entered while he was awake. In pursuance of this plan he threw a few pennies upon the floor of the closet, and then closed the door again. Next he drew from the pocket-book all the money it contained, except a single five-dollar bill. The bank notes thus[Pg 281] removed amounted to fifty-five dollars. He then drew off his stockings, and, laying the bills in the bottom, again put them on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t suspect where they are,\" thought Walter, in a tone of satisfaction. \"If he takes my pocket-book, I can stand the loss of five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He put on his shoes, that he might be ready for instant flight, if occasion required it, and threw himself down on the outside of the coverlid.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If our young hero, who, I hope, will prove such if the danger which he fears actually comes, could have overheard the conversation which was even then going on between Jack and Meg, he would have felt that his apprehensions were not without cause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the woman returned from conducting Walter to his room, she found her husband sitting moodily beside the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Meg,\" he said, looking up, \"where did you put him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the room above.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he\u0027ll sleep sound,\" said Jack, with a sinister smile. \"I\u0027ll go up by and by and see how he rests.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 282]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean to do?\" asked Meg.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has got seventy dollars in that pocket-book of his. It must be ours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His wife did not answer immediately, but looked thoughtfully into the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, what do you say?\" he demanded impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do I say? That I have no objection to taking the money, if there is no danger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What danger is there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He may charge us with the theft.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He can\u0027t see me take it, when his eyes are shut.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he may not be asleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So much the worse for him. I must have the money. Seventy dollars is worth taking, Meg. It\u0027s more money than I\u0027ve had in my hands at one time for years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I like money as well as you, Jack; but the boy will make a fuss when he finds the money is gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So much the worse for him,\" said Jack, fiercely. \"I\u0027ll stop his noise very quick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 283]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t harm the lad, Jack?\" said Meg, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not? What is he to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing, but I feel an interest in him. I don\u0027t want him harmed. Rob him if you will, but don\u0027t hurt him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What should you care about him? You never saw him before to-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He told me his story. He has had ill-luck, like us. His father was very rich, not long since, but he suddenly lost all his property, and this boy is obliged to go out as a book-peddler.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What has that to do with us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t harm him, Jack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you would like to have him inform against us, and set the police on our track.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I wouldn\u0027t, and you know it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he must never leave this cabin alive,\" said Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You would not murder him?\" demanded Meg, horror-struck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I would, if there is need of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I will go up and bid him leave the house.[Pg 284] Better turn him out into the forest than keep him here for that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had got half way to the door when her husband sprang forward, and clutched her fiercely by the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you going to do?\" he growled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shall not kill him. I will send him away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a great mind to kill you,\" he muttered fiercely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Jack, you wouldn\u0027t do that. I\u0027m not a very good woman, but I\u0027ve been a faithful wife to you, and you wouldn\u0027t have the heart to kill me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you know?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know you wouldn\u0027t. I am not afraid for myself, but for you as well as this boy. If you killed him, you might be hung, and then what would become of me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What else can I do?\" asked her husband, irresolutely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Threaten him as much as you like. Make him take an oath never to inform against you. He\u0027s a boy that\u0027ll keep his oath.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What makes you think so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I read it in his face. It is an honest face, and it can be trusted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, old woman, perhaps you are right. The other way is dangerous, and if this will work as well, I don\u0027t mind trying it. Now let us go to bed, and when the boy\u0027s had time to fall asleep, I\u0027ll go in and secure the money.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3005/82953.html","bookId":296,"creation":"Aug 2, 2019 3:28:57 PM","modification":"Aug 2, 2019 3:28:57 PM"}
