{"id":23274,"no":34,"title":"CHAPTER XXXIII. WALTER SHOWS STRATEGY.","content":"\u0026nbsp;Walter followed Meg through the woods. He felt sure that he would not have far to go to reach the open fields. He had been delayed heretofore, not by the distance, but by not knowing in what direction to go. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Few words were spoken between him and Meg. Remembering what had happened at the cabin, and that even now he was fleeing from her husband, he did not feel inclined to be sociable, and her thoughts were divided between the money she was to be paid as the price of her services, and her husband, for whose prolonged absence she could not account.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After walking for fifteen minutes, they came to the edge of the forest. Skirting it was a meadow, wet in parts, for the surface was low.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is the road?\" asked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll have to cross this meadow, and you\u0027ll[Pg 318] come to it. It isn\u0027t mor\u0027n quarter of a mile. You\u0027ll find your way well enough without me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter felt relieved at the prospect of a speedy return to the region of civilization. It seemed to him as if he had passed the previous night far away in some wild frontier cabin, instead of in the centre of a populous and thriving neighborhood, within a few miles of several flourishing villages.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew out a dollar-bill, and offered it to Meg.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is the money I agreed to pay you,\" he said. \"Thank you, besides.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t much cause to thank me,\" she said, abruptly. \"I would have robbed you if I had the chance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry for that,\" said Walter. \"Money got in that way never does any good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Money is sure to do good, no matter how it comes,\" said the woman, fiercely. \"Think of what it will buy!—a comfortable home, ease, luxury, respect. Some time before I die I hope to have as much as I want.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you will,\" said Walter; \"but I don\u0027t think you will find it as powerful as you think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 319]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His words might as well have remained unspoken, for she paid no attention to them. She seemed to be listening intently. Suddenly she clutched his arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hear my husband\u0027s steps,\" she said, hurriedly. \"Fly, or it will be the worse for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you for the caution,\" said Walter, roused to the necessity of immediate action.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t stop to thank me. Go!\" she said, stamping her foot impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He obeyed at once, and started on a run across the meadow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A minute later, Jack came in sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, Meg, are you here?\" he said, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I got anxious about you, because you did not come home. I was afraid something had happened to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What could happen to me?\" he retorted, contemptuously. \"I\u0027m not a baby. Have you seen the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not wait for an answer, for, looking across the meadow, he saw the flying figure of our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There he is, now!\" he exclaimed, in a tone of fierce satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 320]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let him go, Jack!\" pleaded Meg, who, in spite of herself, felt a sympathy for the boy who, like herself, had been unfortunate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He threw off the hand which she had placed upon his arm, saying, contemptuously, \"You\u0027re a fool!\" and then dashed off in pursuit of Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter had the start, and had already succeeded in placing two hundred yards between himself and his pursuer. But Jack was strong and athletic, and could run faster than a boy of fifteen, and the distance between the two constantly diminished. Walter looked over his shoulder, as he ran, and, brave as he was, there came over him a sickening sensation of fear as he met the fierce, triumphant glance of his enemy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop!\" called out Jack, hoarsely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter did not answer, neither did he obey. He was determined to hold out to the last, and when he surrendered it would be only as a measure of necessity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to stop or not? You\u0027d better,\" growled Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Illustration\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter still remained silent; but his heart bounded[Pg 321] with sudden hope as he saw before him a means of possible escape. Only a few rods in advance was a deep ditch, at least twelve feet wide, over which a single plank was thrown as a bridge for foot-passengers. Walter summoned his energies, and sped like a deer forward and over the bridge, when, stooping down, he hastily pulled it over after him, thus cutting off his enemy\u0027s advance. Jack saw his intention, and tried to reach the edge of the ditch soon enough to prevent it. But he was just too late.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Baffled and enraged, he looked across the gulf which separated him from his intended victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Put back that plank,\" he roared, with an oath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would rather not,\" said Walter, who stood facing him on the other side, hot and excited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll kill you if I get at you,\" said Jack, shaking his fist menacingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have I done to you?\" asked Walter, quietly. \"Why do you want to harm me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you lock me up in the closet last night?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wanted to take my money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll have it yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 322]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was all I could do,\" said Walter, who did not wish to excite any additional anger in his already irritated foe. \"I haven\u0027t got but a little money, and I wanted to keep it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Money isn\u0027t the only thing you may lose,\" said the ruffian, significantly. \"Put back that plank. Do you hear me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Walter; \"I hear, but I cannot do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re playin\u0027 a dangerous game, young one,\" said Jack. \"Perhaps you think I can\u0027t get over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think you can,\" said Walter, glancing at the width of the ditch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may find yourself mistaken.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter did not answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you put back that plank?\" demanded Jack, once more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be sorry for it then, you young cub!\" said Jack, fiercely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He walked back about fifty feet, and then faced round. His intention was clear enough. He meant to jump over the ditch. Could he do it? That was the question which suggested itself to the anxious[Pg 323] consideration of our hero. If the ground had been firm on the other side, such a jump for a grown man would not have been by any means a remarkable one. But the soft, spongy soil was unfavorable for a spring. Still it was possible that Jack might succeed. If he did, was there any help for Walter?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero took the plank, and put it over his shoulder, moving with it farther down the edge. An idea had occurred to him, which had not yet suggested itself to Jack, or the latter might have been less confident of success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack stood still for a moment, and then, gathering up his strength, dashed forward. Arrived at the brink, he made a spring, but the soft bank yielded him no support. He fell short of the opposite bank by at least two feet, and, to his anger and disgust, landed in the water and slime at the bottom of the ditch. With a volley of execrations, he scrambled out, landing at last, but with the loss of one boot, which had been drawn off by the clinging mud in which it had become firmly planted. Still he was on the same side with Walter, and the latter was now in his power. This was what he thought; but an[Pg 324] instant later he saw his mistake. Walter had stretched the plank over the ditch a few rods further up, and was passing over it in safety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack ran hastily to the spot, hoping to gain possession of the plank which had been of such service to his opponent, and want of which had entailed such misfortunes upon him. But Walter was too quick for him. The plank was drawn over, and again he faced his intended victim with the width of the ditch between.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked across at Walter with a glance of baffled rage. It was something new to him to be worsted by a boy, and it mortified him and angered him to such an extent that, had he got hold of him at that moment, murder might have been committed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Put down that plank, and come across,\" he called out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter did not reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you answer, you rascal?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You know well enough what I would say,\" said Walter. \"I don\u0027t care to come.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall get hold of you sooner or later.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 325]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you will,\" said Walter; \"but not if I can help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re on the wrong side of the ditch. You can\u0027t escape.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So are you on the wrong side. You can\u0027t get home without crossing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can keep you there all day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can stand it as well as you,\" said Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt bolder than at first, for he appreciated the advantage which he had in possessing the plank. True the situation was not a comfortable one, and he would have gladly exchanged it for one that offered greater security. Still, on the whole, he felt cool and calm, and waited patiently for the issue.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3005/82957.html","bookId":296,"creation":"Aug 2, 2019 3:28:57 PM","modification":"Aug 2, 2019 3:28:57 PM"}
