{"id":65751,"no":22,"title":"Page 22","content":"\u003cp\u003e“Mary and Rafi lead the Midwest branch of a GD rebel group,” Nita says.\u003c/p\u003e\n\u003cp\u003e“Calling it a ‘group’ makes us sound like old ladies playing cards,” Rafi says smoothly. “We’re more of an uprising. Our reach stretches across the country—there’s a group for every metropolitan area that exists, and regional overseers for the Midwest, South, and East.”\u003c/p\u003e\n\u003cp\u003e“Is there a West?” I say.\u003c/p\u003e\n\u003cp\u003e“Not anymore,” Nita says quietly. “The terrain was too difficult to navigate and the cities too spread out for it to be sensible to live there after the war. Now it’s wild country.”\u003c/p\u003e\n\u003cp\u003e“So it’s true what they say,” Mary says, her eyes catching the light like slivers of glass as she looks at me. “The people in the city experiments really don’t know what’s outside.”\u003c/p\u003e\n\u003cp\u003e“Of course it’s true, why would they?” Nita says.\u003c/p\u003e\n\u003cp\u003eFatigue, a weight behind my eyes, creeps up on me suddenly. I have been a part of too many uprisings in my short life. The factionless, and now this GD one, apparently.\u003c/p\u003e\n\u003cp\u003e“Not to cut the pleasantries short,” Mary says, “but we shouldn’t spend much time here. We can’t keep people out for long before they come sniffing around.”\u003c/p\u003e\n\u003cp\u003e“Right,” Nita says. She looks at me. “Four, can you make sure nothing’s happening outside? I need to talk to Mary and Rafi privately for a little while.”\u003c/p\u003e\n\u003cp\u003eIf we were alone, I would ask why I can’t be here when she talks to them, or why she bothered to bring me in when I could have stood guard outside the whole time. I guess I haven’t actually agreed to help her yet, and she must have wanted them to meet me for some reason. So I just get up, taking my knife with me, and walk to the door where Rafi’s guard watches the street.\u003c/p\u003e\n\u003cp\u003eThe fight across the street has died down. A lone figure lies on the pavement. For a moment I think it’s still moving, but then I realize that’s because someone is rifling through its pockets. It’s not a figure—it’s a body.\u003c/p\u003e\n\u003cp\u003e“Dead?” I say, and the word is just an exhale.\u003c/p\u003e\n\u003cp\u003e“Yep. If you can’t defend yourself here, you won’t last a night.”\u003c/p\u003e\n\u003cp\u003e“Why do people come here, then?” I frown. “Why don’t they just go back to the cities?”\u003c/p\u003e\n\u003cp\u003eHe’s quiet for so long that I think he must not have heard my question. I watch the thief turn the dead person’s pockets inside out and abandon the body, slipping into one of the nearby buildings. Finally, Rafi’s guard speaks:\u003c/p\u003e\n\u003cp\u003e“Here, there’s a chance that if you die, someone will care. Like Rafi, or one of the other leaders,” the guard says. “In the cities, if you get killed, definitely no one will give a damn, not if you’re a GD. The worst crime I’ve ever seen a GP get charged with for killing a GD was ‘manslaughter.’ Bullshit.”\u003c/p\u003e\n\u003cp\u003e“Manslaughter?”\u003c/p\u003e\n\u003cp\u003e“It means the crime is deemed an accident,” Rafi’s smooth, lilting voice says behind me. “Or at least not as severe as, say, first-degree murder. Officially, of course, we’re all to be treated the same, yes? But that is rarely put into practice.”\u003c/p\u003e\n\u003cp\u003eHe stands beside me, his arms folded. I see, when I look at him, a king surveying his own kingdom, which he believes is beautiful. I look out at the street, at the broken pavement and the limp body with its turned-out pockets and the windows flickering with firelight, and I know the beauty he sees is just freedom—freedom to be seen as a whole man instead of a damaged one.\u003c/p\u003e\n\u003cp\u003eI saw that freedom, once, when Evelyn beckoned to me from among the factionless, called me out of my faction to become a more complete person. But it was a lie.\u003c/p\u003e\n\u003cp\u003e“You’re from Chicago?” Rafi says to me.\u003c/p\u003e\n\u003cp\u003eI nod, still looking at the dark street.\u003c/p\u003e\n\u003cp\u003e“And now that you are out? How does the world seem to you?” he says.\u003c/p\u003e\n\u003cp\u003e“Mostly the same,” I say. “People are just divided by different things, fighting different wars.”\u003c/p\u003e\n\u003cp\u003eNita’s footsteps creak on the floorboards inside, and when I turn she is standing right behind me, her hands buried in her pockets.\u003c/p\u003e\n\u003cp\u003e“Thanks for arranging this,” Nita says, nodding to Rafi. “It’s time for us to go.”\u003c/p\u003e\n\u003cp\u003eWe make our way down the street again, and when I turn to look at Rafi, he has his hand up, waving good-bye.\u003c/p\u003e\n\u003cp\u003eAs we walk back to the truck, I hear screams again, but this time they are the screams of a child. I walk past snuffling, whimpering sounds and think of when I was younger, crouched in my bedroom, wiping my nose on one of my sleeves. My mother used to scrub the cuffs with a sponge before throwing them in the wash. She never said anything about it.\u003c/p\u003e\n\u003cp\u003eWhen I get into the truck, I already feel numb to this place and its pain, and I am ready to get back to the dream of the compound, the warmth and the light and the feeling of safety.\u003c/p\u003e\n\u003cp\u003e“I’m having trouble understanding why this place is preferable to city life,” I say.\u003c/p\u003e\n\u003cp\u003e“I’ve only been to a city that wasn’t an experiment once,” Nita says. “There’s electricity, but it’s on a ration system—each family only gets so many hours a day. Same with water. And there’s a lot of crime, which is blamed on genetic damage. There are police, too, but they can only do so much.”\u003c/p\u003e\n\u003cp\u003e“So the Bureau compound,” I say. “It’s easily the best place to live, then.”\u003c/p\u003e\n\u003cp\u003e“In terms of resources, yes,” Nita says. “But the same social system that exists in the cities also exists in the compound; it’s just a little harder to see.”\u003c/p\u003e\n\u003cp\u003eI watch the fringe disappear in the rearview mirror, distinct from the abandoned buildings around it only by that string of electric lights draped over the narrow street.\u003c/p\u003e\n\u003cp\u003eWe drive past dark houses with boarded-up windows, and I try to imagine them clean and polished, as they must have been at some point in the past. They have fenced-in yards that must have once been trim and green, windows that must once have glowed in the evenings. I imagine that the lives lived here were peaceful ones, quiet ones.\u003c/p\u003e\n\u003cp\u003e“What did you come out here to talk to them about, exactly?” I say.\u003c/p\u003e\n\u003cp\u003e“I came out here to solidify our plans,” Nita says. I notice, in the glow of the dashboard light, that there are a few cuts on her lower lip, like she has spent too much time biting it. “And I wanted them to meet you, to put a face on the people inside the faction experiments. Mary used to be suspicious that people like you were actually colluding with the government, which of course isn’t true. Rafi, though . . . he was the first person to give me proof that the Bureau, the government, was lying to us about our history.”\u003c/p\u003e\n\u003cp\u003eShe pauses after she says it, like that will help me to feel the weight of it, but I don’t need time or silence or space to believe her. I have been lied to by my government for my entire life.\u003c/p\u003e\n\u003cp\u003e“The Bureau talks about this golden age of humanity before the genetic manipulations in which everyone was genetically pure and everything was peaceful,” Nita says. “But Rafi showed me old photographs of war.”\u003c/p\u003e\n\u003cp\u003eI wait a beat. “So?”\u003c/p\u003e\n\u003cp\u003e“So?” Nita demands, incredulous. “If genetically pure people caused war and total devastation in the past at the same magnitude that genetically damaged people supposedly do now, then what’s the basis for thinking that we need to spend so many resources and so much time working to correct genetic damage? What’s the use of the experiments at all, except to convince the right people that the government is doing something to make all our lives better, even though it’s not?”\u003c/p\u003e\n\u003cp\u003eThe truth changes everything—isn’t that why Tris was so desperate to get the Edith Prior video shown that she allied herself with my father to do it? She knew that the truth, whatever it was, would change our struggle, would shift our priorities forever. And here, now, a lie has changed the struggle, a lie has shifted priorities forever. Instead of working against the poverty or crime that have run rampant over this country, these people have chosen to work against genetic damage.\u003c/p\u003e\n\u003cp\u003e“Why? Why spend so much time and energy fighting something that isn’t really a problem?” I demand, suddenly frustrated.\u003c/p\u003e\n\u003cp\u003e“Well, the people fighting it now probably fight it because they have been taught that it is a problem. That’s another thing that Rafi showed me—examples of the propaganda the government released about genetic damage,” Nita says. “But initially? I don’t know. It’s probably a dozen things. Prejudice against GDs? Control, maybe? Control the genetically damaged population by teaching them that there’s something wrong with them, and control the genetically pure population by teaching them that they’re healed and whole? These things don’t happen overnight, and they don’t happen for just one reason.”\u003c/p\u003e\n\u003cp\u003eI lean the side of my head against the cold window and close my eyes. There is too much information buzzing in my brain to focus on any single part of it, so I give up trying and let myself drift off.\u003c/p\u003e\n\u003cp\u003eBy the time we make it back through the tunnel and I find my bed, the sun is about to rise, and Tris’s arm is hanging over the edge of her bed again, her fingertips brushing the floor.\u003c/p\u003e\n\u003cp\u003eI sit down across from her, for a moment watching her sleeping face and thinking of what we agreed, that night in Millennium Park: no more lies. She promised me, and I promised her. And if I don’t tell her about what I heard and saw tonight, I will be going back on that promise. And for what? To protect her? For Nita, a girl I barely know?\u003c/p\u003e\n\u003cp\u003eI brush her hair away from her face, gently, so I don’t wake her.\u003c/p\u003e\n\u003cp\u003eShe doesn’t need my protection. She’s strong enough on her own.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FOUR\u003c/p\u003e\n\u003cp\u003eTRIS\u003c/p\u003e\n\u003cp\u003ePETER IS ACROSS the room, gathering a stack of books into a pile and shoving them into a bag. He bites down on a red pen and carries the bag out of the room; I hear the books inside it smacking against his leg as he walks down the hallway. I wait until I can’t hear them anymore before I turn to Christina.\u003c/p\u003e\n\u003cp\u003e“I’ve been trying not to ask you, but I’m giving up,” I say. “What’s going on with you and Uriah?”\u003c/p\u003e\n\u003cp\u003eChristina, sprawled across her cot with one long leg dangling over the edge, gives me a look.\u003c/p\u003e\n\u003cp\u003e“What? You’ve been spending a lot of time together,” I say. “Like a lot.”\u003c/p\u003e\n\u003cp\u003eIt’s sunny today, the light glowing through the white curtains. I don’t know how, but the dormitory smells like sleep—like laundry and shoes and night sweats and morning coffee. Some of the beds are made, and some still have rumpled sheets bunched up at the bottom or the side. Most of us came from Dauntless, but I’m struck by how different we are anyway. Different habits, different temperaments, different ways of seeing the world.\u003c/p\u003e\n\u003cp\u003e“You may not believe me, but it’s not like that.” Christina props herself up on her elbows. “He’s grieving. We’re both bored. Also, he’s Uriah.”\u003c/p\u003e\n\u003cp\u003e“So? He’s good-looking.”\u003c/p\u003e\n\u003cp\u003e“Good-looking, but he can’t have a serious conversation to save his life.” Christina shakes her head. “Don’t get me wrong, I like to laugh, but I also want a relationship to mean something, you know?”\u003c/p\u003e\n\u003cp\u003eI nod. I do know—better than most people, maybe, because Tobias and I aren’t really the joking type.\u003c/p\u003e\n\u003cp\u003e“Besides,” she says, “not every friendship turns into a romance. I haven’t tried to kiss you yet.”\u003c/p\u003e\n\u003cp\u003eI laugh. “True.”\u003c/p\u003e\n\u003cp\u003e“Where have you been lately?” Christina says. She wiggles her eyebrows. “With Four? Doing a little . . . addition? Multiplication?”\u003c/p\u003e\n\u003cp\u003eI cover my face with my hands. “That was the worst joke I’ve ever heard.”\u003c/p\u003e\n\u003cp\u003e“Don’t dodge the question.”\u003c/p\u003e\n\u003cp\u003e“No ‘addition’ for us,” I say. “Not yet, anyway. He’s been a little preoccupied with the whole ‘genetic damage’ thing.”\u003c/p\u003e\n\u003cp\u003e“Ah. That thing.” She sits up.\u003c/p\u003e\n\u003cp\u003e“What do you think about it?” I say.\u003c/p\u003e\n\u003cp\u003e“I don’t know. I guess it makes me angry.” She frowns. “No one likes to be told there’s something wrong with them, especially something like their genes, which they can’t change.”\u003c/p\u003e\n\u003cp\u003e“You think there’s really something wrong with you?”\u003c/p\u003e\n\u003cp\u003e“I guess so. It’s like a disease, right? They can see it in our genes. That’s not really up for debate, is it?”\u003c/p\u003e\n\u003cp\u003e“I’m not saying your genes aren’t different,” I say. “I’m just saying that doesn’t mean one set is damaged and one set isn’t. The genes for blue eyes and brown eyes are different too, but are blue eyes ‘damaged’? It’s like they just arbitrarily decided that one kind of DNA was bad and the other was good.”\u003c/p\u003e\n\u003cp\u003e“Based on the evidence that GD behavior was worse,” Christina points out.\u003c/p\u003e\n\u003cp\u003e“Which could be caused by a lot of things,” I retort.\u003c/p\u003e\n\u003cp\u003e“I don’t know why I’m arguing with you when I’d really like for you to be right,” Christina says, laughing. “But don’t you think a bunch of smart people like these Bureau scientists could figure out the cause of bad behavior?”\u003c/p\u003e\n\u003cp\u003e“Sure,” I say. “But I think that no matter how smart, people usually see what they’re already looking for, that’s all.”\u003c/p\u003e\n\u003cp\u003e“Maybe you’re biased too,” she says. “Because you have friends—and a boyfriend—with this genetic issue.”\u003c/p\u003e\n\u003cp\u003e“Maybe.” I know I’m fumbling for an explanation, one I may not really believe, but I say it anyway: “I guess I don’t see a reason to believe in genetic damage. Will it make me treat other people better? No. The opposite, maybe.”\u003c/p\u003e\n\u003cp\u003eAnd besides, I see what it’s doing to Tobias, how it’s making him doubt himself, and I don’t understand how anything good can possibly come from it.\u003c/p\u003e\n\u003cp\u003e“You don’t believe things because they make your life better, you believe them because they’re true,” she points out.\u003c/p\u003e\n\u003cp\u003e“But”—I speak slowly as I mull that over—“isn’t looking at the result of a belief a good way of evaluating if it’s true?” \u003c/p\u003e","sourceLink":"https://allnovel.net/allegiant-divergent-3/page-22.html","bookId":1700,"creation":"Oct 5, 2019 9:58:52 AM","modification":"Oct 5, 2019 9:58:52 AM"}
