{"id":2747,"no":116,"title":"A Singular Exhibition at Somerset House.","content":"“Our Crummie is a dainty cow.”—Scotch Song.\n\u003cbr\u003e \n\u003cbr\u003e On that first Saturday in May,\n\u003cbr\u003e \n\u003cbr\u003e When Lords and Ladies, great and grand,\n\u003cbr\u003e \n\u003cbr\u003e Repair to see what each R.A.\n\u003cbr\u003e \n\u003cbr\u003e Has done since last they sought the Strand,\n\u003cbr\u003e \n\u003cbr\u003e In red, brown, yellow, green, or blue,\n\u003cbr\u003e \n\u003cbr\u003e In short, what’s called the private view —\n\u003cbr\u003e \n\u003cbr\u003e Amongst the guests — the deuce knows how\n\u003cbr\u003e \n\u003cbr\u003e She got in there without a row —\n\u003cbr\u003e \n\u003cbr\u003e There came a large and vulgar dame,\n\u003cbr\u003e \n\u003cbr\u003e With arms deep red, and face the same,\n\u003cbr\u003e \n\u003cbr\u003e Showing in temper not a Saint;\n\u003cbr\u003e \n\u003cbr\u003e No one could guess for why she came,\n\u003cbr\u003e \n\u003cbr\u003e Unless perchance to “scour the Paint.”\n\u003cbr\u003e \n\u003cbr\u003e From wall to wall she forced her way,\n\u003cbr\u003e \n\u003cbr\u003e Elbowed Lord Durham — poked Lord Grey —\n\u003cbr\u003e \n\u003cbr\u003e Stamped Stafford’s toes to make him move,\n\u003cbr\u003e \n\u003cbr\u003e And Devonshire’s Duke received a shove;\n\u003cbr\u003e \n\u003cbr\u003e The great Lord Chancellor felt her nudge,\n\u003cbr\u003e \n\u003cbr\u003e She made the Vice, his Honor, budge,\n\u003cbr\u003e \n\u003cbr\u003e And gave a pinch to Park, the judge.\n\u003cbr\u003e \n\u003cbr\u003e As for the ladies in this stir,\n\u003cbr\u003e \n\u003cbr\u003e The highest rank gave way to her.\n\u003cbr\u003e \n\u003cbr\u003e From number one and number two,\n\u003cbr\u003e \n\u003cbr\u003e She searched the pictures through and through,\n\u003cbr\u003e \n\u003cbr\u003e On benches stood, to inspect the high ones,\n\u003cbr\u003e \n\u003cbr\u003e And squatted down to see the shy ones.\n\u003cbr\u003e \n\u003cbr\u003e And as she went from part to part,\n\u003cbr\u003e \n\u003cbr\u003e A deeper red each cheek became,\n\u003cbr\u003e \n\u003cbr\u003e Her very eyes lit up in flame,\n\u003cbr\u003e \n\u003cbr\u003e That made each looker-on exclaim,\n\u003cbr\u003e \n\u003cbr\u003e “Really an ardent love of art!”\n\u003cbr\u003e \n\u003cbr\u003e Alas! amidst her inquisition,\n\u003cbr\u003e \n\u003cbr\u003e Fate brought her to a sad condition;\n\u003cbr\u003e \n\u003cbr\u003e She might have run against Lord Milton,\n\u003cbr\u003e \n\u003cbr\u003e And still have stared at deeds in oil.\n\u003cbr\u003e \n\u003cbr\u003e But ah! her picture-joy to spoil,\n\u003cbr\u003e \n\u003cbr\u003e She came full butt on Mr. Hilton.\n\u003cbr\u003e \n\u003cbr\u003e The Keeper mute, with staring eyes,\n\u003cbr\u003e \n\u003cbr\u003e Like a lay-figure for surprise,\n\u003cbr\u003e \n\u003cbr\u003e At last this stammered out, “How now?\n\u003cbr\u003e \n\u003cbr\u003e Woman — where, woman, is your ticket,\n\u003cbr\u003e \n\u003cbr\u003e That ought to have let you through our wicket?”\n\u003cbr\u003e \n\u003cbr\u003e Says woman, “Where is David’s Cow?”\n\u003cbr\u003e \n\u003cbr\u003e Said Mr. H—— with expedition,\n\u003cbr\u003e \n\u003cbr\u003e “There’s no Cow in the Exhibition.”\n\u003cbr\u003e \n\u003cbr\u003e “No Cow!”— but here her tongue in verity,\n\u003cbr\u003e \n\u003cbr\u003e Set off with steam and rail celerity —\n\u003cbr\u003e \n\u003cbr\u003e “No Cow! there ain’t no Cow, then the more’s the shame and pity,\n\u003cbr\u003e \n\u003cbr\u003e Hang you, and the R.A.‘s, and all the Hanging Committee!\n\u003cbr\u003e \n\u003cbr\u003e No Cow — but hold your tongue — for you needn’t talk to me —\n\u003cbr\u003e \n\u003cbr\u003e You can’t talk up the Cow, you can’t, to where it ought to be —\n\u003cbr\u003e \n\u003cbr\u003e I haven’t seen a picture high or low, or anyhow,\n\u003cbr\u003e \n\u003cbr\u003e Or in any of the rooms, to be compared with David’s Cow!\n\u003cbr\u003e \n\u003cbr\u003e You may talk of your Landseers, and of your Coopers and your Wards,\n\u003cbr\u003e \n\u003cbr\u003e Why, hanging is too good for them, and yet here they are on cords!\n\u003cbr\u003e \n\u003cbr\u003e They’re only fit for window frames, and shutters and street doors,\n\u003cbr\u003e \n\u003cbr\u003e David will paint ’em any day at Red Lions or Blue Boars —\n\u003cbr\u003e \n\u003cbr\u003e Why, Morland was a fool to him — at a little pig or sow —\n\u003cbr\u003e \n\u003cbr\u003e It’s really hard it ain’t hung up — I could cry about the Cow!\n\u003cbr\u003e \n\u003cbr\u003e But I know well what it is, and why — they’re jealous of David’s fame,\n\u003cbr\u003e \n\u003cbr\u003e But to vent it on the Cow, poor thing, is a cruelty and a shame —\n\u003cbr\u003e \n\u003cbr\u003e Do you think it might hang by and by, if you cannot hang it now?\n\u003cbr\u003e \n\u003cbr\u003e David has made a party up, to come and see his Cow\n\u003cbr\u003e \n\u003cbr\u003e If it only hung three days a week, for an example to the learners —\n\u003cbr\u003e \n\u003cbr\u003e Why can’t it hang up, turn about, with that picture of Mr. Turner’s?\n\u003cbr\u003e \n\u003cbr\u003e Or do you think from Mr. Etty you need apprehend a row,\n\u003cbr\u003e \n\u003cbr\u003e If now and then you cut him down to hang up David’s Cow!\n\u003cbr\u003e \n\u003cbr\u003e I can’t think where their tastes have been, to not have such a creature,\n\u003cbr\u003e \n\u003cbr\u003e Although I say, that should not say, it was prettier than nature!\n\u003cbr\u003e \n\u003cbr\u003e It must be hung — and shall be hung — for, Mr. H— — I vow\n\u003cbr\u003e \n\u003cbr\u003e I daren’t take home the catalogue, unless it’s got the Cow!\n\u003cbr\u003e \n\u003cbr\u003e As we only want it to be seen, I should not so much care,\n\u003cbr\u003e \n\u003cbr\u003e If it was only round the stone man’s neck, a coming up the stair.\n\u003cbr\u003e \n\u003cbr\u003e Or down there in the marble room where all the figures stand,\n\u003cbr\u003e \n\u003cbr\u003e Where one of them three Graces might just hold it in her hand —\n\u003cbr\u003e \n\u003cbr\u003e Or maybe Baily’s Charity the favor would allow,\n\u003cbr\u003e \n\u003cbr\u003e It would really be a charity to hang up David’s Cow.\n\u003cbr\u003e \n\u003cbr\u003e We haven’t nowhere else to go if you don’t hang it here,\n\u003cbr\u003e \n\u003cbr\u003e The Water Color place allows no oilman to appear —\n\u003cbr\u003e \n\u003cbr\u003e And the British Gallery sticks to Dutch, Teniers and Gerard Douw,\n\u003cbr\u003e \n\u003cbr\u003e And the Suffolk Gallery will not do — it’s not a Suffolk Cow:\n\u003cbr\u003e \n\u003cbr\u003e I wish you’d seen him painting her, he hardly took his meals\n\u003cbr\u003e \n\u003cbr\u003e Till she was painted on the board, correct from head to heels:\n\u003cbr\u003e \n\u003cbr\u003e His heart and soul was in his Cow, and almost made him shabby,\n\u003cbr\u003e \n\u003cbr\u003e He hardly whipped the boys at all — or helped to nurse the babby,\n\u003cbr\u003e \n\u003cbr\u003e And when he had her all complete and painted over red,\n\u003cbr\u003e \n\u003cbr\u003e He got so grand, I really thought him going off his head.\n\u003cbr\u003e \n\u003cbr\u003e Now hang it, Mr. Hilton, do just hang it anyhow,\n\u003cbr\u003e \n\u003cbr\u003e Poor David, he will hang himself, unless you hang his Cow.\n\u003cbr\u003e \n\u003cbr\u003e And if it’s inconvenient and drawn too big by half —\n\u003cbr\u003e \n\u003cbr\u003e David shan’t send next year except a very little calf!”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37422.html","bookId":111,"creation":"Aug 1, 2019 4:05:06 AM","modification":"Aug 1, 2019 4:05:06 AM"}
