{"id":2748,"no":117,"title":"Lines to Mary.","content":"Old Bailey Ballads.\n\u003cbr\u003e \n\u003cbr\u003e (At No. 1, Newgate. Favored by Mr. Wontner.)\n\u003cbr\u003e \n\u003cbr\u003e O Mary, I believed you true,\n\u003cbr\u003e \n\u003cbr\u003e And I was blest in so believing;\n\u003cbr\u003e \n\u003cbr\u003e But till this hour I never knew —\n\u003cbr\u003e \n\u003cbr\u003e That you were taken up for thieving!\n\u003cbr\u003e \n\u003cbr\u003e Oh! when I snatch’d a tender kiss,\n\u003cbr\u003e \n\u003cbr\u003e Or some such trifle when I courted,\n\u003cbr\u003e \n\u003cbr\u003e You said, indeed, that love was bliss,\n\u003cbr\u003e \n\u003cbr\u003e But never owned you were transported!\n\u003cbr\u003e \n\u003cbr\u003e But then to gaze on that fair face —\n\u003cbr\u003e \n\u003cbr\u003e It would have been an unfair feeling\n\u003cbr\u003e \n\u003cbr\u003e To dream that you had pilfered lace —\n\u003cbr\u003e \n\u003cbr\u003e And Flint’s had suffered from your stealing!\n\u003cbr\u003e \n\u003cbr\u003e Or when my suit I first preferred,\n\u003cbr\u003e \n\u003cbr\u003e To bring your coldness to repentance,\n\u003cbr\u003e \n\u003cbr\u003e Before I hammer’d out a word,\n\u003cbr\u003e \n\u003cbr\u003e How could I dream you heard a sentence!\n\u003cbr\u003e \n\u003cbr\u003e Or when with all the warmth of youth\n\u003cbr\u003e \n\u003cbr\u003e I strove to prove my love no fiction,\n\u003cbr\u003e \n\u003cbr\u003e How could I guess I urged a truth\n\u003cbr\u003e \n\u003cbr\u003e On one already past conviction!\n\u003cbr\u003e \n\u003cbr\u003e How could I dream that ivory part,\n\u003cbr\u003e \n\u003cbr\u003e Your hand — where I have look’d and linger’d,\n\u003cbr\u003e \n\u003cbr\u003e Altho’ it stole away my heart,\n\u003cbr\u003e \n\u003cbr\u003e Had been held up as one light-fingered!\n\u003cbr\u003e \n\u003cbr\u003e In melting verse your charms I drew,\n\u003cbr\u003e \n\u003cbr\u003e The charms in which my muse delighted —\n\u003cbr\u003e \n\u003cbr\u003e Alas! the lay I thought was new.\n\u003cbr\u003e \n\u003cbr\u003e Spoke only what had been indicted!\n\u003cbr\u003e \n\u003cbr\u003e Oh! when that form, a lovely one,\n\u003cbr\u003e \n\u003cbr\u003e Hung on the neck its arms had flown to,\n\u003cbr\u003e \n\u003cbr\u003e I little thought that you had run\n\u003cbr\u003e \n\u003cbr\u003e A chance of hanging on your own too.\n\u003cbr\u003e \n\u003cbr\u003e You said you pick’d me from the world,\n\u003cbr\u003e \n\u003cbr\u003e My vanity it now must shock it —\n\u003cbr\u003e \n\u003cbr\u003e And down at once my pride is hurled,\n\u003cbr\u003e \n\u003cbr\u003e You’ve pick’d me — and you’ve pick’d a pocket!\n\u003cbr\u003e \n\u003cbr\u003e Oh! when our love had got so far,\n\u003cbr\u003e \n\u003cbr\u003e The banns were read by Doctor Daly,\n\u003cbr\u003e \n\u003cbr\u003e Who asked if there was any bar —\n\u003cbr\u003e \n\u003cbr\u003e Why did not some one shout “Old Bailey”?\n\u003cbr\u003e \n\u003cbr\u003e But when you robed your flesh and bones\n\u003cbr\u003e \n\u003cbr\u003e In that pure white that angel garb is,\n\u003cbr\u003e \n\u003cbr\u003e Who could have thought you, Mary Jones,\n\u003cbr\u003e \n\u003cbr\u003e Among the Joans that link with Darbies?\n\u003cbr\u003e \n\u003cbr\u003e And when the parson came to say,\n\u003cbr\u003e \n\u003cbr\u003e My goods were yours, if I had got any,\n\u003cbr\u003e \n\u003cbr\u003e And you should honor and obey,\n\u003cbr\u003e \n\u003cbr\u003e Who could have thought —“O Bay of Botany!”\n\u003cbr\u003e \n\u003cbr\u003e But oh! — the worst of all your slips\n\u003cbr\u003e \n\u003cbr\u003e I did not till this day discover —\n\u003cbr\u003e \n\u003cbr\u003e That down in Deptford’s prison ships,\n\u003cbr\u003e \n\u003cbr\u003e O Mary! you’ve a hulking lover!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37423.html","bookId":111,"creation":"Aug 1, 2019 4:05:10 AM","modification":"Aug 1, 2019 4:05:10 AM"}
