{"id":2755,"no":124,"title":"Ode to Sir Andrew Agnew, Bart.?","content":"“At certain seasons he makes a prodigious clattering with his bill.”— SELBY.\n\u003cbr\u003e \n\u003cbr\u003e “The bill is rather long, flat, and tinged with green.”— BEWICK.\n\u003cbr\u003e \n\u003cbr\u003e O Andrew Fairservice — but I beg pardon,\n\u003cbr\u003e \n\u003cbr\u003e You never labor’d in Di Vernon’s garden,\n\u003cbr\u003e \n\u003cbr\u003e On curly kale and cabbages intent —\n\u003cbr\u003e \n\u003cbr\u003e Andrew Churchservice was the thing I meant —\n\u003cbr\u003e \n\u003cbr\u003e You are a Christian — I would be the same,\n\u003cbr\u003e \n\u003cbr\u003e Although we differ, and I’ll tell you why,\n\u003cbr\u003e \n\u003cbr\u003e Not meaning to make game,\n\u003cbr\u003e \n\u003cbr\u003e I do not like my Church so very High!\n\u003cbr\u003e \n\u003cbr\u003e When people talk, as talk they will,\n\u003cbr\u003e \n\u003cbr\u003e About your bill,\n\u003cbr\u003e \n\u003cbr\u003e They say, among their other jibes and small jeers,\n\u003cbr\u003e \n\u003cbr\u003e That, if you had your way,\n\u003cbr\u003e \n\u003cbr\u003e You’d make the seventh day\n\u003cbr\u003e \n\u003cbr\u003e As overbearing as the Dey of Algiers.\n\u003cbr\u003e \n\u003cbr\u003e Talk of converting Blacks —\n\u003cbr\u003e \n\u003cbr\u003e By your attacks,\n\u003cbr\u003e \n\u003cbr\u003e You make a thing so horrible of one day,\n\u003cbr\u003e \n\u003cbr\u003e Each nigger, they will bet a something tidy,\n\u003cbr\u003e \n\u003cbr\u003e Would rather be a heathenish Man Friday,\n\u003cbr\u003e \n\u003cbr\u003e Than your Man Sunday!\n\u003cbr\u003e \n\u003cbr\u003e So poor men speak,\n\u003cbr\u003e \n\u003cbr\u003e Who, once a week,\n\u003cbr\u003e \n\u003cbr\u003e P’rhaps, after weaving artificial flowers,\n\u003cbr\u003e \n\u003cbr\u003e Can snatch a glance of Nature’s kinder bowers,\n\u003cbr\u003e \n\u003cbr\u003e And revel in a bloom\n\u003cbr\u003e \n\u003cbr\u003e That is not of the loom,\n\u003cbr\u003e \n\u003cbr\u003e Making the earth, the streams, the skies, the trees,\n\u003cbr\u003e \n\u003cbr\u003e A Chapel of Ease.\n\u003cbr\u003e \n\u003cbr\u003e Whereas, as you would plan it,\n\u003cbr\u003e \n\u003cbr\u003e Wall’d in with hard Scotch granite,\n\u003cbr\u003e \n\u003cbr\u003e People all day should look to their behaviors; —\n\u003cbr\u003e \n\u003cbr\u003e But though there be, as Shakspeare owns,\n\u003cbr\u003e \n\u003cbr\u003e “Sermons in stones,”\n\u003cbr\u003e \n\u003cbr\u003e Zounds! Would you have us work at them like paviors?\n\u003cbr\u003e \n\u003cbr\u003e Spontaneous is pure devotion’s fire;\n\u003cbr\u003e \n\u003cbr\u003e And in a green wood many a soul has built\n\u003cbr\u003e \n\u003cbr\u003e A new Church, with a fir-tree for its spire,\n\u003cbr\u003e \n\u003cbr\u003e Where Sin has prayed for peace, and wept for guilt,\n\u003cbr\u003e \n\u003cbr\u003e Better than if an architect the plan drew;\n\u003cbr\u003e \n\u003cbr\u003e We know of old how medicines were back’d,\n\u003cbr\u003e \n\u003cbr\u003e But true Religion needs not to be quack’d\n\u003cbr\u003e \n\u003cbr\u003e By an Un-merry Andrew!\n\u003cbr\u003e \n\u003cbr\u003e Suppose a poor town-weary sallow elf\n\u003cbr\u003e \n\u003cbr\u003e At Primrose-hill would renovate himself,\n\u003cbr\u003e \n\u003cbr\u003e Or drink (and no great harm)\n\u003cbr\u003e \n\u003cbr\u003e Milk genuine at Chalk Farm —\n\u003cbr\u003e \n\u003cbr\u003e The innocent intention who would balk,\n\u003cbr\u003e \n\u003cbr\u003e And drive him back into St. Bennet Fink?\n\u003cbr\u003e \n\u003cbr\u003e For my part, for my life, I cannot think\n\u003cbr\u003e \n\u003cbr\u003e A walk on Sunday is “the Devil’s Walk.”\n\u003cbr\u003e \n\u003cbr\u003e But there’s a sect of Deists, and their creed\n\u003cbr\u003e \n\u003cbr\u003e Is D—— ing other people to be d —— d —\n\u003cbr\u003e \n\u003cbr\u003e Yeas, all that are not of their saintly level,\n\u003cbr\u003e \n\u003cbr\u003e They make a pious point\n\u003cbr\u003e \n\u003cbr\u003e To send, with an “aroint,”\n\u003cbr\u003e \n\u003cbr\u003e Down to that great Fillhellenist, the Devil.\n\u003cbr\u003e \n\u003cbr\u003e To such, a ramble by the River Lea\n\u003cbr\u003e \n\u003cbr\u003e Is really treading on the “Banks of D——.”\n\u003cbr\u003e \n\u003cbr\u003e Go down to Margate, wisest of law-makers,\n\u003cbr\u003e \n\u003cbr\u003e And say unto the sea, as Canute did,\n\u003cbr\u003e \n\u003cbr\u003e (Of course the sea will do as it is bid,)\n\u003cbr\u003e \n\u003cbr\u003e “This is the Sabbath — but there be no Breakers!”\n\u003cbr\u003e \n\u003cbr\u003e Seek London’s Bishop, on some Sunday morn,\n\u003cbr\u003e \n\u003cbr\u003e And try him with your tenets to inoculate —\n\u003cbr\u003e \n\u003cbr\u003e Abuse his fine souchong, and say in scorn,\n\u003cbr\u003e \n\u003cbr\u003e “This is not Churchman’s Chocolate!”\n\u003cbr\u003e \n\u003cbr\u003e Or, seek Dissenters at their mid-day meal,\n\u003cbr\u003e \n\u003cbr\u003e And read them from your Sabbath Bill some passages,\n\u003cbr\u003e \n\u003cbr\u003e And while they eat their mutton, beef, and veal,\n\u003cbr\u003e \n\u003cbr\u003e Shout out with holy zeal —\n\u003cbr\u003e \n\u003cbr\u003e “These are not Chappet’s sassages!”\n\u003cbr\u003e \n\u003cbr\u003e Suppose your Act should act up to your will,\n\u003cbr\u003e \n\u003cbr\u003e Yet how will it appear to Mrs. Grundy,\n\u003cbr\u003e \n\u003cbr\u003e To hear you saying of this pious bill,\n\u003cbr\u003e \n\u003cbr\u003e “It works well — on a Sunday!”\n\u003cbr\u003e \n\u003cbr\u003e To knock down apple-stalls is now too late,\n\u003cbr\u003e \n\u003cbr\u003e Except to starve some poor old harmless madam; —\n\u003cbr\u003e \n\u003cbr\u003e You might have done some good, and chang’d our fate,\n\u003cbr\u003e \n\u003cbr\u003e Could you have upset that, which ruined Adam!\n\u003cbr\u003e \n\u003cbr\u003e ’Tis useless to prescribe salt-cod and eggs,\n\u003cbr\u003e \n\u003cbr\u003e Or lay post-horses under legal fetters,\n\u003cbr\u003e \n\u003cbr\u003e While Tattersall’s on Sunday stirs its Legs,\n\u003cbr\u003e \n\u003cbr\u003e Folks look for good examples from their Betters!\n\u003cbr\u003e \n\u003cbr\u003e Consider — Acts of Parliament may bind\n\u003cbr\u003e \n\u003cbr\u003e A man to go where Irvings are discoursing —\n\u003cbr\u003e \n\u003cbr\u003e But as for forcing “proper frames of mind,”\n\u003cbr\u003e \n\u003cbr\u003e Minds are not framed, like melons, for such forcing!\n\u003cbr\u003e \n\u003cbr\u003e Remember, as a Scottish legislator,\n\u003cbr\u003e \n\u003cbr\u003e The Scotch Kirk always has a Moderator;\n\u003cbr\u003e \n\u003cbr\u003e Meaning one need not ever be sojourning\n\u003cbr\u003e \n\u003cbr\u003e In a long Sermon Lane without a turning.\n\u003cbr\u003e \n\u003cbr\u003e Such grave old maids as Portia and Zenobia\n\u003cbr\u003e \n\u003cbr\u003e May like discourses with a skein of threads,\n\u003cbr\u003e \n\u003cbr\u003e And love a lecture for its many heads,\n\u003cbr\u003e \n\u003cbr\u003e But as for me, I have the Hydra-phobia.\n\u003cbr\u003e \n\u003cbr\u003e Religion one should never overdo:\n\u003cbr\u003e \n\u003cbr\u003e Right know I am no minister you be,\n\u003cbr\u003e \n\u003cbr\u003e For you would say your service, sir, to me,\n\u003cbr\u003e \n\u003cbr\u003e Till I should say, “My service, sir, to you.”\n\u003cbr\u003e \n\u003cbr\u003e Six days made all that is, you know, and then\n\u003cbr\u003e \n\u003cbr\u003e Came that of rest — by holy ordination,\n\u003cbr\u003e \n\u003cbr\u003e As if to hint unto the sons of men,\n\u003cbr\u003e \n\u003cbr\u003e After creation should come re-creation.\n\u003cbr\u003e \n\u003cbr\u003e Read right this text, and do not further search\n\u003cbr\u003e \n\u003cbr\u003e To make a Sunday Workhouse of the Church.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37430.html","bookId":111,"creation":"Aug 1, 2019 4:05:30 AM","modification":"Aug 1, 2019 4:05:30 AM"}
