{"id":2761,"no":130,"title":"The Sweeps Complaint","content":"“I like to meet a sweep — such as come forth with the dawn, or somewhat earlier, with their little professional notes, sounding like the peep, peep, of a young sparrow.”\n\u003cbr\u003e \n\u003cbr\u003e ESSAYS OF ELIA.\n\u003cbr\u003e \n\u003cbr\u003e ——“A voice cried Sweep no more!\n\u003cbr\u003e \n\u003cbr\u003e Macbeth hath murdered sweep.”\n\u003cbr\u003e \n\u003cbr\u003e SHAKSPEARE.\n\u003cbr\u003e \n\u003cbr\u003e One morning, ere my usual time\n\u003cbr\u003e \n\u003cbr\u003e I rose, about the seventh chime,\n\u003cbr\u003e \n\u003cbr\u003e When little stunted boys that climb\n\u003cbr\u003e \n\u003cbr\u003e Still linger in the street;\n\u003cbr\u003e \n\u003cbr\u003e And as I walked, I saw indeed\n\u003cbr\u003e \n\u003cbr\u003e A sample of the sooty breed,\n\u003cbr\u003e \n\u003cbr\u003e Though he was rather run to seed,\n\u003cbr\u003e \n\u003cbr\u003e In height above five feet.\n\u003cbr\u003e \n\u003cbr\u003e A mongrel tint he seemed to take,\n\u003cbr\u003e \n\u003cbr\u003e Poetic simile to make,\n\u003cbr\u003e \n\u003cbr\u003e DAY through his MARTIN ‘gan to break,\n\u003cbr\u003e \n\u003cbr\u003e White overcoming jet.\n\u003cbr\u003e \n\u003cbr\u003e From side to side he crossed oblique,\n\u003cbr\u003e \n\u003cbr\u003e Like Frenchman who has friends to seek,\n\u003cbr\u003e \n\u003cbr\u003e And yet no English word can speak,\n\u003cbr\u003e \n\u003cbr\u003e He walked upon the fret:\n\u003cbr\u003e \n\u003cbr\u003e And while he sought the dingy job\n\u003cbr\u003e \n\u003cbr\u003e His lab’ring breast appeared to throb,\n\u003cbr\u003e \n\u003cbr\u003e And half a hiccup half a sob\n\u003cbr\u003e \n\u003cbr\u003e Betray’d internal woe.\n\u003cbr\u003e \n\u003cbr\u003e To cry amain he had by rote\n\u003cbr\u003e \n\u003cbr\u003e He yearn’d, but law forbade the note,\n\u003cbr\u003e \n\u003cbr\u003e Like Chanticleer with roupy throat,\n\u003cbr\u003e \n\u003cbr\u003e He gaped — but not a crow!\n\u003cbr\u003e \n\u003cbr\u003e I watched him and the glimpse I snatched\n\u003cbr\u003e \n\u003cbr\u003e Disclosed his sorry eyelids patch’d\n\u003cbr\u003e \n\u003cbr\u003e With red, as if the soot had catch’d\n\u003cbr\u003e \n\u003cbr\u003e That hung about the lid;\n\u003cbr\u003e \n\u003cbr\u003e And soon I saw the tear-drop stray,\n\u003cbr\u003e \n\u003cbr\u003e He did not care to brush away;\n\u003cbr\u003e \n\u003cbr\u003e Thought I, the cause he will betray —\n\u003cbr\u003e \n\u003cbr\u003e And thus at last he did.\n\u003cbr\u003e \n\u003cbr\u003e Well, here’s a pretty go! here’s a Gagging Act, if ever there was a gagging!\n\u003cbr\u003e \n\u003cbr\u003e But I’m bound the members as silenced us, in doing it had plenty of magging.\n\u003cbr\u003e \n\u003cbr\u003e They had better send us all off, they had, to the School for the Deaf and Dumb,\n\u003cbr\u003e \n\u003cbr\u003e To unlarn us our mother tongues, and to make signs and be regularly mum.\n\u003cbr\u003e \n\u003cbr\u003e But they can’t undo natur — as sure as ever the morning begins to peep,\n\u003cbr\u003e \n\u003cbr\u003e Directly I open my eyes, I can’t help calling out Sweep\n\u003cbr\u003e \n\u003cbr\u003e As natural as the sparrows among the chimbley-pots, that say Cheep!\n\u003cbr\u003e \n\u003cbr\u003e For my own part I find my suppressed voice very uneasy,\n\u003cbr\u003e \n\u003cbr\u003e And comparable to nothing but having your tissue stopt when you are sneezy.\n\u003cbr\u003e \n\u003cbr\u003e Well, it’s all up with us! tho’ I suppose we mustn’t cry all up.\n\u003cbr\u003e \n\u003cbr\u003e Here’s a precious merry Christmas, I’m blest if I can earn either bit or sup!\n\u003cbr\u003e \n\u003cbr\u003e If crying Sweep, of mornings, is going beyond quietness’s border,\n\u003cbr\u003e \n\u003cbr\u003e Them as pretends to be fond of silence oughtn’t to cry hear, hear, and order, order.\n\u003cbr\u003e \n\u003cbr\u003e I wonder Mr. Sutton, as we’ve sut-on too, don’t sympathize with us\n\u003cbr\u003e \n\u003cbr\u003e As a Speaker what don’t speak, and that’s exactly our own cus.\n\u003cbr\u003e \n\u003cbr\u003e God help us if we don’t not cry, how are we to pursue our callings?\n\u003cbr\u003e \n\u003cbr\u003e I’m sure we’re not half so bad as other businesses with their bawlings.\n\u003cbr\u003e \n\u003cbr\u003e For instance, the general postmen, that at six o’clock go about ringing,\n\u003cbr\u003e \n\u003cbr\u003e And wake up all the babbies that their mothers have just got to sleep with singing.\n\u003cbr\u003e \n\u003cbr\u003e Greens oughtn’t to be cried no more than blacks — to do the unpartial job,\n\u003cbr\u003e \n\u003cbr\u003e If they bring in a Sooty Bill, they ought to have brought in a Dusty Bob.\n\u003cbr\u003e \n\u003cbr\u003e Is a dustman’s voice more sweet than ourn, when he comes a seeking arter the cinders,\n\u003cbr\u003e \n\u003cbr\u003e Instead of a little boy like a blackbird in spring, singing merrily under your windows?\n\u003cbr\u003e \n\u003cbr\u003e There’s the omnibus cads as plies in Cheapside, and keeps calling out Bank and City;\n\u003cbr\u003e \n\u003cbr\u003e Let his Worship, the Mayor, decide if our call of Sweep is not just as pretty.\n\u003cbr\u003e \n\u003cbr\u003e I can’t see why the Jews should be let go about crying Old Close thro’ their hooky noses,\n\u003cbr\u003e \n\u003cbr\u003e And Christian laws should be ten times more hard than the old stone laws of Moses.\n\u003cbr\u003e \n\u003cbr\u003e Why isn’t the mouths of the muffin-men compell’d to be equally shut?\n\u003cbr\u003e \n\u003cbr\u003e Why, because Parliament members eat muffins, but they never eat no sut.\n\u003cbr\u003e \n\u003cbr\u003e Next year there won’t be any May-day at all, we shan’t have no heart to dance,\n\u003cbr\u003e \n\u003cbr\u003e And Jack in the Green will go in black like mourning for our mischance;\n\u003cbr\u003e \n\u003cbr\u003e If we live as long as May, that’s to say, through the hard winter and pinching weather,\n\u003cbr\u003e \n\u003cbr\u003e For I don’t see how we’re to earn enough to keep body and soul together.\n\u003cbr\u003e \n\u003cbr\u003e I only wish Mr. Wilberforce, or some of them that pities the niggers,\n\u003cbr\u003e \n\u003cbr\u003e Would take a peep down in our cellars, and look at our miserable starving figures,\n\u003cbr\u003e \n\u003cbr\u003e A-sitting idle on our empty sacks, and all ready to eat each other,\n\u003cbr\u003e \n\u003cbr\u003e And a brood of little ones crying for bread to a heartbreaking Father and Mother.\n\u003cbr\u003e \n\u003cbr\u003e They havn’t a rag of clothes to mend, if their mothers had thread and needles,\n\u003cbr\u003e \n\u003cbr\u003e But crawl naked about the cellars, poor things, like a swarm of common black beadles.\n\u003cbr\u003e \n\u003cbr\u003e If they’d only inquired before passing the Act, and taken a few such peeps,\n\u003cbr\u003e \n\u003cbr\u003e I don’t think that any real gentleman would have set his face against sweeps.\n\u003cbr\u003e \n\u003cbr\u003e Climbing’s an ancient respectable art, and if History’s of any vally,\n\u003cbr\u003e \n\u003cbr\u003e Was recommended by Queen Elizabeth to the great Sir Walter Raleigh,\n\u003cbr\u003e \n\u003cbr\u003e When he wrote on a pane of glass how I’d climb, if the way I only knew,\n\u003cbr\u003e \n\u003cbr\u003e And she writ beneath, if your heart’s afeard, don’t venture up the flue.\n\u003cbr\u003e \n\u003cbr\u003e As for me I was always loyal, and respected all powers that are higher,\n\u003cbr\u003e \n\u003cbr\u003e But how can I now say God save the King, if I ain’t to be a Cryer?\n\u003cbr\u003e \n\u003cbr\u003e There’s London milk, that’s one of the cries, even on Sunday the law allows,\n\u003cbr\u003e \n\u003cbr\u003e But ought black sweeps, that are human beasts, to be worser off than black cows?\n\u003cbr\u003e \n\u003cbr\u003e Do we go calling about, when it’s church time, like the noisy Billingsgate vermin,\n\u003cbr\u003e \n\u003cbr\u003e And disturb the parson with “All alive O!” in the middle of a funeral sermon?\n\u003cbr\u003e \n\u003cbr\u003e But the fish won’t keep, not the mackerel won’t, is the cry of the Parliament elves,\n\u003cbr\u003e \n\u003cbr\u003e Everything, except the sweeps I think, is to be allowed to keep themselves!\n\u003cbr\u003e \n\u003cbr\u003e Lord help us! what’s to become of us if we mustn’t cry no more?\n\u003cbr\u003e \n\u003cbr\u003e We shan’t do for black mutes to go a standing at a death’s door.\n\u003cbr\u003e \n\u003cbr\u003e And we shan’t do to emigrate, no not even to the Hottentot nations,\n\u003cbr\u003e \n\u003cbr\u003e For as time wears on, our black will wear off, and then think of our situations!\n\u003cbr\u003e \n\u003cbr\u003e And we should not do, in lieu of black-a-moor footmen, to serve ladies of quality nimbly,\n\u003cbr\u003e \n\u003cbr\u003e For when we were drest in our sky-blue and silver, and large frills, all clean and neat, and white silk stockings, if they pleased to desire us to sweep the hearth, we couldn’t resist the chimbley.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37862.html","bookId":111,"creation":"Aug 1, 2019 4:05:48 AM","modification":"Aug 1, 2019 4:05:48 AM"}
