{"id":2767,"no":136,"title":"The Forlorn Shepherd’s Complaint.?","content":"An Unpublished Poem, from Sydney.\n\u003cbr\u003e \n\u003cbr\u003e “Vell! Here I am — no Matter how it suits\n\u003cbr\u003e \n\u003cbr\u003e A-keeping Company vith them dumb Brutes;\n\u003cbr\u003e \n\u003cbr\u003e Old Park vos no bad Judge — confound his vig!\n\u003cbr\u003e \n\u003cbr\u003e Of vot vood break the Sperrit of a Prig!\n\u003cbr\u003e \n\u003cbr\u003e “The Like of Me, to come to New Sow Wales\n\u003cbr\u003e \n\u003cbr\u003e To go a-tagging arter Vethers’ Tails\n\u003cbr\u003e \n\u003cbr\u003e And valk in Herbage as delights the Flock,\n\u003cbr\u003e \n\u003cbr\u003e But stinks of Sweet Herbs vorser nor the Dock!\n\u003cbr\u003e \n\u003cbr\u003e “To go to set this solitary Job\n\u003cbr\u003e \n\u003cbr\u003e To Von whose Vork vos alvay in a Mob!\n\u003cbr\u003e \n\u003cbr\u003e It’s out of all our Lines, for sure I am\n\u003cbr\u003e \n\u003cbr\u003e Jack Shepherd even never kep a Lamb!\n\u003cbr\u003e \n\u003cbr\u003e “I arn’t ashamed to say I sit and veep\n\u003cbr\u003e \n\u003cbr\u003e To think of Seven Year of keepin Sheep,\n\u003cbr\u003e \n\u003cbr\u003e The spooniest Beast in Nater, all to Sticks,\n\u003cbr\u003e \n\u003cbr\u003e And not a Votch to take for all their Ticks!\n\u003cbr\u003e \n\u003cbr\u003e “If I’d fore-seed how Transports vould turn out\n\u003cbr\u003e \n\u003cbr\u003e To only Baa! and Botanize about,\n\u003cbr\u003e \n\u003cbr\u003e I’d quite as leaf have had the t’other Pull,\n\u003cbr\u003e \n\u003cbr\u003e And come to Cotton, as to all this Vool!\n\u003cbr\u003e \n\u003cbr\u003e “Von only happy moment I have had\n\u003cbr\u003e \n\u003cbr\u003e Since here I come to be a Farmer’s Cad,\n\u003cbr\u003e \n\u003cbr\u003e And then I cotch’d a vild Beast in a Snooze,\n\u003cbr\u003e \n\u003cbr\u003e And pick’d her pouch of three young Kangaroos!\n\u003cbr\u003e \n\u003cbr\u003e “Vot chance haye I to go to Race or Mill?\n\u003cbr\u003e \n\u003cbr\u003e Or show a sneaking Kindness for a Till;\n\u003cbr\u003e \n\u003cbr\u003e And as for Vashings, on a hedge to dry,\n\u003cbr\u003e \n\u003cbr\u003e I’d put the Natives’ Linen in my Eye!\n\u003cbr\u003e \n\u003cbr\u003e “If this whole Lot of Mutton I could scrag,\n\u003cbr\u003e \n\u003cbr\u003e And find a Fence to turn it into Swag,\n\u003cbr\u003e \n\u003cbr\u003e I’d give it all in London Streets to stand,\n\u003cbr\u003e \n\u003cbr\u003e And if I had my pick, I’d say the Strand!\n\u003cbr\u003e \n\u003cbr\u003e “But ven I goes, as maybe vonce I shall,\n\u003cbr\u003e \n\u003cbr\u003e To my old Crib to meet with Jack, and Sal,\n\u003cbr\u003e \n\u003cbr\u003e I’ve been so gallows honest in this Place,\n\u003cbr\u003e \n\u003cbr\u003e I shan’t not like to show my sheepish Face.\n\u003cbr\u003e \n\u003cbr\u003e “It’s wery hard for nothing but a Box\n\u003cbr\u003e \n\u003cbr\u003e Of Irish Blackguard to be keepin’ Flocks,\n\u003cbr\u003e \n\u003cbr\u003e ‘Mong naked Blacks, sich Savages to hus,\n\u003cbr\u003e \n\u003cbr\u003e They’ve nayther got a Pocket nor a Pus.\n\u003cbr\u003e \n\u003cbr\u003e “But folks may tell their Troubles till they’re sick\n\u003cbr\u003e \n\u003cbr\u003e To dumb brute Beasts — and so I’ll cut my Stick!\n\u003cbr\u003e \n\u003cbr\u003e And vot’s the Use a Feller’s Eyes to pipe\n\u003cbr\u003e \n\u003cbr\u003e Vere von can’t borrow any Gemman’s Vipe?”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37868.html","bookId":111,"creation":"Aug 1, 2019 4:06:06 AM","modification":"Aug 1, 2019 4:06:06 AM"}
