{"id":2776,"no":145,"title":"To Henrietta,?","content":"On Her Departure for Calais.\n\u003cbr\u003e \n\u003cbr\u003e When little people go abroad, wherever they may roam,\n\u003cbr\u003e \n\u003cbr\u003e They will not just be treated as they used to be at home;\n\u003cbr\u003e \n\u003cbr\u003e So take a few promiscuous hints, to warn you in advance,\n\u003cbr\u003e \n\u003cbr\u003e Of how a little English girl will perhaps be served in France.\n\u003cbr\u003e \n\u003cbr\u003e Of course you will be Frenchified; and first, it’s my belief,\n\u003cbr\u003e \n\u003cbr\u003e They’ll dress you in their foreign style as à-la-mode as beef,\n\u003cbr\u003e \n\u003cbr\u003e With a little row of beehives, as a border to your frock,\n\u003cbr\u003e \n\u003cbr\u003e And a pair of frilly trousers, like a little bantam cock.\n\u003cbr\u003e \n\u003cbr\u003e But first they’ll seize your bundle (if you have one) in a crack,\n\u003cbr\u003e \n\u003cbr\u003e And tie it with a tape by way of bustle on your back;\n\u003cbr\u003e \n\u003cbr\u003e And make your waist so high or low, your shape will be a riddle,\n\u003cbr\u003e \n\u003cbr\u003e For anyhow you’ll never have your middle in the middle.\n\u003cbr\u003e \n\u003cbr\u003e Your little English sandals for a while will hold together,\n\u003cbr\u003e \n\u003cbr\u003e But woe betide you when the stones have worn away the leather;\n\u003cbr\u003e \n\u003cbr\u003e For they’ll poke your little pettitoes (and there will be a hobble!)\n\u003cbr\u003e \n\u003cbr\u003e In such a pair of shoes as none but carpenters can cobble!\n\u003cbr\u003e \n\u003cbr\u003e What next? — to fill your head with French to match the native girls,\n\u003cbr\u003e \n\u003cbr\u003e In scraps of Galignani they’ll screw up your little curls;\n\u003cbr\u003e \n\u003cbr\u003e And they’ll take their nouns and verbs, and some bits of verse and prose,\n\u003cbr\u003e \n\u003cbr\u003e And pour them in your ears that you may spout them through your nose.\n\u003cbr\u003e \n\u003cbr\u003e You’ll have to learn a chou is quite another sort of thing\n\u003cbr\u003e \n\u003cbr\u003e To that you put your foot in; that a belle is not to ring;\n\u003cbr\u003e \n\u003cbr\u003e That a corne is not the nubble that brings trouble to your toes;\n\u003cbr\u003e \n\u003cbr\u003e Nor peut-être a potato, as some Irish folks suppose.\n\u003cbr\u003e \n\u003cbr\u003e No, No, they have no Murphies there, for supper or for lunch,\n\u003cbr\u003e \n\u003cbr\u003e But you may get in course of time a pomme de terre to munch,\n\u003cbr\u003e \n\u003cbr\u003e With which, as you perforce must do as Calais folks are doing,\n\u003cbr\u003e \n\u003cbr\u003e You’ll maybe have to gobble up the frog that went a wooing!\n\u003cbr\u003e \n\u003cbr\u003e But pray at meals, remember this, the French are so polite,\n\u003cbr\u003e \n\u003cbr\u003e No matter what you eat or drink, “whatever is, is right!”\n\u003cbr\u003e \n\u003cbr\u003e So when you’re told at dinner-time that some delicious stew\n\u003cbr\u003e \n\u003cbr\u003e Is cat instead of rabbit, you must answer ”Tant mi — eux!”\n\u003cbr\u003e \n\u003cbr\u003e For little folks who go abroad, wherever they may roam,\n\u003cbr\u003e \n\u003cbr\u003e They cannot just be treated as they used to be at home;\n\u003cbr\u003e \n\u003cbr\u003e So take a few promiscuous hints, to warn you in advance,\n\u003cbr\u003e \n\u003cbr\u003e Of how a little English girl will perhaps be served in France!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37877.html","bookId":111,"creation":"Aug 1, 2019 4:06:29 AM","modification":"Aug 1, 2019 4:06:29 AM"}
