{"id":2796,"no":165,"title":"An Open Question.","content":"“It is the king’s highway that we are in, and in this way it is that thou hast placed the lions.”— BUNYAN.\n\u003cbr\u003e \n\u003cbr\u003e What! shut the gardens; lock the latticed gate!\n\u003cbr\u003e \n\u003cbr\u003e Refuse the shilling and the Fellow’s ticket!\n\u003cbr\u003e \n\u003cbr\u003e And hang a wooden notice up to state,\n\u003cbr\u003e \n\u003cbr\u003e “On Sundays no admittance at this wicket!”\n\u003cbr\u003e \n\u003cbr\u003e The Birds, the Beasts, and all the Reptile race\n\u003cbr\u003e \n\u003cbr\u003e Denied to friends and visitors till Monday!\n\u003cbr\u003e \n\u003cbr\u003e Now, really, this appears the common case\n\u003cbr\u003e \n\u003cbr\u003e Of putting too much Sabbath into Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e The Gardens — so unlike the ones we dub\n\u003cbr\u003e \n\u003cbr\u003e Of Tea, wherein the artisan carouses —\n\u003cbr\u003e \n\u003cbr\u003e Mere shrubberies without one drop of shrub —\n\u003cbr\u003e \n\u003cbr\u003e Wherefore should they be closed like public-houses?\n\u003cbr\u003e \n\u003cbr\u003e No ale is vended at the wild Deer’s Head —\n\u003cbr\u003e \n\u003cbr\u003e Nor rum — nor gin — not even of a Monday —\n\u003cbr\u003e \n\u003cbr\u003e The Lion is not carved — or gilt — or red,\n\u003cbr\u003e \n\u003cbr\u003e And does not send out porter of a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e The bear denied! the Leopard under locks!\n\u003cbr\u003e \n\u003cbr\u003e As if his spots would give contagious fevers;\n\u003cbr\u003e \n\u003cbr\u003e The Beaver close as hat within its box;\n\u003cbr\u003e \n\u003cbr\u003e So different from other Sunday beavers!\n\u003cbr\u003e \n\u003cbr\u003e The Birds invisible — the Gnaw-way Rats —\n\u003cbr\u003e \n\u003cbr\u003e The Seal hermetically seal’d till Monday —\n\u003cbr\u003e \n\u003cbr\u003e The Monkey tribe — the Family of Cats —\n\u003cbr\u003e \n\u003cbr\u003e We visit other families on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e What is the brute profanity that shocks\n\u003cbr\u003e \n\u003cbr\u003e The super-sensitively serious feeling?\n\u003cbr\u003e \n\u003cbr\u003e The Kangaroo — is he not orthodox\n\u003cbr\u003e \n\u003cbr\u003e To bend his legs, the way he does, in kneeling?\n\u003cbr\u003e \n\u003cbr\u003e Was strict Sir Andrew, in his sabbath coat,\n\u003cbr\u003e \n\u003cbr\u003e Struck all a heap to see a Coati Mundi?\n\u003cbr\u003e \n\u003cbr\u003e Or did the Kentish Plumtree faint to note\n\u003cbr\u003e \n\u003cbr\u003e The Pelicans presenting bills on Sunday? —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e What feature has repulsed the serious set?\n\u003cbr\u003e \n\u003cbr\u003e What error in the bestial birth or breeding,\n\u003cbr\u003e \n\u003cbr\u003e To put their tender fancies on the fret?\n\u003cbr\u003e \n\u003cbr\u003e One thing is plain — it is not in the feeding!\n\u003cbr\u003e \n\u003cbr\u003e Some stiffish people think that smoking joints\n\u003cbr\u003e \n\u003cbr\u003e Are carnal sins ’twixt Saturday and Monday —\n\u003cbr\u003e \n\u003cbr\u003e But then the beasts are pious on these points,\n\u003cbr\u003e \n\u003cbr\u003e For they all eat cold dinners on a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e What change comes o’er the spirit of the place,\n\u003cbr\u003e \n\u003cbr\u003e As if transmuted by some spell organic?\n\u003cbr\u003e \n\u003cbr\u003e Turns fell Hy?na of the Ghoulish race?\n\u003cbr\u003e \n\u003cbr\u003e The Snake, pro tempore, the true Satanic?\n\u003cbr\u003e \n\u003cbr\u003e Do Irish minds — (whose theory allows\n\u003cbr\u003e \n\u003cbr\u003e That now and then Good Friday falls on Monday)—\n\u003cbr\u003e \n\u003cbr\u003e Do Irish minds suppose that Indian Cows\n\u003cbr\u003e \n\u003cbr\u003e Are wicked Bulls of Bashan on a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e There are some moody fellows, not a few,\n\u003cbr\u003e \n\u003cbr\u003e Who, turn’d by Nature with a gloomy bias,\n\u003cbr\u003e \n\u003cbr\u003e Renounce black devils to adopt the blue,\n\u003cbr\u003e \n\u003cbr\u003e And think when they are dismal they are pious:\n\u003cbr\u003e \n\u003cbr\u003e Is’t possible that Pug’s untimely fun\n\u003cbr\u003e \n\u003cbr\u003e Has sent the brutes to Coventry till Monday —\n\u003cbr\u003e \n\u003cbr\u003e Or p’rhaps some animal, no serious one,\n\u003cbr\u003e \n\u003cbr\u003e Was overheard in laughter on a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e What dire offence have serious Fellows found\n\u003cbr\u003e \n\u003cbr\u003e To raise their spleen against the Regent’s spinney?\n\u003cbr\u003e \n\u003cbr\u003e Were charitable boxes handed round,\n\u003cbr\u003e \n\u003cbr\u003e And would not Guinea Pigs subscribe their guinea?\n\u003cbr\u003e \n\u003cbr\u003e Perchance the Demoiselle refused to moult\n\u003cbr\u003e \n\u003cbr\u003e The feathers in her head — at least till Monday;\n\u003cbr\u003e \n\u003cbr\u003e Or did the Elephant, unseemly, bolt\n\u003cbr\u003e \n\u003cbr\u003e A tract presented to be read on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e At whom did Leo struggle to get loose?\n\u003cbr\u003e \n\u003cbr\u003e Who mourns through Monkey tricks his damaged clothing?\n\u003cbr\u003e \n\u003cbr\u003e Who has been hiss’d by the Canadian Goose?\n\u003cbr\u003e \n\u003cbr\u003e On whom did Llama spit in utter loathing?\n\u003cbr\u003e \n\u003cbr\u003e Some Smithfield saint did jealous feelings tell\n\u003cbr\u003e \n\u003cbr\u003e To keep the Puma out of sight till Monday,\n\u003cbr\u003e \n\u003cbr\u003e Because he prey’d extempore as well\n\u003cbr\u003e \n\u003cbr\u003e As certain wild Itinerants on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e To me it seems that in the oddest way\n\u003cbr\u003e \n\u003cbr\u003e (Begging the pardon of each rigid Socius)\n\u003cbr\u003e \n\u003cbr\u003e Our would-be Keepers of the Sabbath-day\n\u003cbr\u003e \n\u003cbr\u003e Are like the Keepers of the brutes ferocious —\n\u003cbr\u003e \n\u003cbr\u003e As soon the Tiger might expect to stalk\n\u003cbr\u003e \n\u003cbr\u003e About the grounds from Saturday till Monday,\n\u003cbr\u003e \n\u003cbr\u003e As any harmless man to take a walk,\n\u003cbr\u003e \n\u003cbr\u003e If saints could clap him in a cage on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e In spite of all hypocrisy can spin,\n\u003cbr\u003e \n\u003cbr\u003e As surely as I am a Christian scion,\n\u003cbr\u003e \n\u003cbr\u003e I cannot think it is a mortal sin —\n\u003cbr\u003e \n\u003cbr\u003e (Unless he’s loose) to look upon a lion.\n\u003cbr\u003e \n\u003cbr\u003e I really think that one may go, perchance,\n\u003cbr\u003e \n\u003cbr\u003e To see a bear, as guiltless as on Monday —\n\u003cbr\u003e \n\u003cbr\u003e (That is, provided that he did not dance)\n\u003cbr\u003e \n\u003cbr\u003e Bruin’s no worse than bakin’ on a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e In spite of all the fanatic compiles,\n\u003cbr\u003e \n\u003cbr\u003e I cannot think the day a bit diviner,\n\u003cbr\u003e \n\u003cbr\u003e Because no children, with forestalling smiles,\n\u003cbr\u003e \n\u003cbr\u003e Throng, happy, to the gates of Eden Minor —\n\u003cbr\u003e \n\u003cbr\u003e It is not plain, to my poor faith at least,\n\u003cbr\u003e \n\u003cbr\u003e That what we christen “Natural” on Monday,\n\u003cbr\u003e \n\u003cbr\u003e The wondrous History of bird and beast,\n\u003cbr\u003e \n\u003cbr\u003e Can be Unnatural because it’s Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e Whereon is sinful fantasy to work?\n\u003cbr\u003e \n\u003cbr\u003e The Dove, the wing’d Columbus of man’s haven?\n\u003cbr\u003e \n\u003cbr\u003e The tender Love-Bird — or the filial Stork?\n\u003cbr\u003e \n\u003cbr\u003e The punctual Crane — the providential Raven?\n\u003cbr\u003e \n\u003cbr\u003e The Pelican whose bosom feeds her young?\n\u003cbr\u003e \n\u003cbr\u003e Nay, must we cut from Saturday till Monday\n\u003cbr\u003e \n\u003cbr\u003e That feather’d marvel with a human tongue,\n\u003cbr\u003e \n\u003cbr\u003e Because she does not preach upon a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e The busy Beaver — that sagacious beast!\n\u003cbr\u003e \n\u003cbr\u003e The Sheep that own’d an Oriental Shepherd —\n\u003cbr\u003e \n\u003cbr\u003e That Desert-ship the Camel of the East,\n\u003cbr\u003e \n\u003cbr\u003e The horn’d Rhinoceros — the spotted Leopard —\n\u003cbr\u003e \n\u003cbr\u003e The creatures of the Great Creator’s hand\n\u003cbr\u003e \n\u003cbr\u003e Are surely sights for better days than Monday —\n\u003cbr\u003e \n\u003cbr\u003e The elephant, although he wears no band,\n\u003cbr\u003e \n\u003cbr\u003e Has he no sermon in his trunk for Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e What harm if men who burn the midnight-oil,\n\u003cbr\u003e \n\u003cbr\u003e Weary of frame, and worn and wan in feature,\n\u003cbr\u003e \n\u003cbr\u003e Seek once a-week their spirits to assoil,\n\u003cbr\u003e \n\u003cbr\u003e And snatch a glimpse of “Animated Nature”?\n\u003cbr\u003e \n\u003cbr\u003e Better it were if, in his best of suits,\n\u003cbr\u003e \n\u003cbr\u003e The artisan, who goes to work on Monday,\n\u003cbr\u003e \n\u003cbr\u003e Should spend a leisure hour among the brutes,\n\u003cbr\u003e \n\u003cbr\u003e Than make a beast of his own self on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e Why, zounds! what raised so Protestant a fuss\n\u003cbr\u003e \n\u003cbr\u003e (Omit the zounds! for which I make apology)\n\u003cbr\u003e \n\u003cbr\u003e But that the Papists, like some fellows, thus\n\u003cbr\u003e \n\u003cbr\u003e Had somehow mixed up Dens with their theology?\n\u003cbr\u003e \n\u003cbr\u003e Is Brahma’s Bull — a Hindoo god at home —\n\u003cbr\u003e \n\u003cbr\u003e A papal bull to be tied up till Monday —\n\u003cbr\u003e \n\u003cbr\u003e Or Leo, like his namesake, Pope of Rome,\n\u003cbr\u003e \n\u003cbr\u003e That there is such a dread of them on Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr\u003e \n\u003cbr\u003e Spirit of Kant! have we not had enough\n\u003cbr\u003e \n\u003cbr\u003e To make religion sad, and sour, and snubbish,\n\u003cbr\u003e \n\u003cbr\u003e But Saints Zoological must cant their stuff,\n\u003cbr\u003e \n\u003cbr\u003e As vessels cant their ballast — rattling rubbish!\n\u003cbr\u003e \n\u003cbr\u003e Once let the sect, triumphant to their text,\n\u003cbr\u003e \n\u003cbr\u003e Shut Nero up from Saturday till Monday,\n\u003cbr\u003e \n\u003cbr\u003e And sure as fate they will deny us next\n\u003cbr\u003e \n\u003cbr\u003e To see the Dandelions on a Sunday —\n\u003cbr\u003e \n\u003cbr\u003e But what is your opinion, Mrs. Grundy?\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37897.html","bookId":111,"creation":"Aug 1, 2019 4:07:27 AM","modification":"Aug 1, 2019 4:07:27 AM"}
