{"id":2667,"no":36,"title":"Ode to the Moon.","content":"1.\n\u003cbr\u003e \n\u003cbr\u003e Mother of light! how fairly dost thou go\n\u003cbr\u003e \n\u003cbr\u003e Over those hoary crests, divinely led! —\n\u003cbr\u003e \n\u003cbr\u003e Art thou that huntress of the silver bow,\n\u003cbr\u003e \n\u003cbr\u003e Fabled of old? Or rather dost thou tread\n\u003cbr\u003e \n\u003cbr\u003e Those cloudy summits thence to gaze below,\n\u003cbr\u003e \n\u003cbr\u003e Like the wild Chamois from her Alpine snow,\n\u003cbr\u003e \n\u003cbr\u003e Where hunter never climb’d — secure from dread?\n\u003cbr\u003e \n\u003cbr\u003e How many antique fancies have I read\n\u003cbr\u003e \n\u003cbr\u003e Of that mild presence! and how many wrought!\n\u003cbr\u003e \n\u003cbr\u003e Wondrous and bright,\n\u003cbr\u003e \n\u003cbr\u003e Upon the silver light,\n\u003cbr\u003e \n\u003cbr\u003e Chasing fair figures with the artist, Thought!\n\u003cbr\u003e 2.\n\u003cbr\u003e \n\u003cbr\u003e What art thou like? — Sometimes I see thee ride\n\u003cbr\u003e \n\u003cbr\u003e A far-bound galley on its perilous way,\n\u003cbr\u003e \n\u003cbr\u003e Whilst breezy waves toss up their silvery spray; —\n\u003cbr\u003e \n\u003cbr\u003e Sometimes behold thee glide,\n\u003cbr\u003e \n\u003cbr\u003e Cluster’d by all thy family of stars,\n\u003cbr\u003e \n\u003cbr\u003e Like a lone widow, through the welkin wide,\n\u003cbr\u003e \n\u003cbr\u003e Whose pallid cheek the midnight sorrow mars; —\n\u003cbr\u003e \n\u003cbr\u003e Sometimes I watch thee on from steep to steep,\n\u003cbr\u003e \n\u003cbr\u003e Timidly lighted by thy vestal torch,\n\u003cbr\u003e \n\u003cbr\u003e Till in some Latmian cave I see thee creep,\n\u003cbr\u003e \n\u003cbr\u003e To catch the young Endymion asleep —\n\u003cbr\u003e \n\u003cbr\u003e Leaving thy splendor at the jagged porch! —\n\u003cbr\u003e 3.\n\u003cbr\u003e \n\u003cbr\u003e Oh, thou art beautiful, howe’er it be!\n\u003cbr\u003e \n\u003cbr\u003e Huntress, or Dian, or whatever named;\n\u003cbr\u003e \n\u003cbr\u003e And he, the veriest Pagan, that first framed\n\u003cbr\u003e \n\u003cbr\u003e A silver idol, and ne’er worshipp’d thee! —\n\u003cbr\u003e \n\u003cbr\u003e It is too late — or thou should’st have my knee —\n\u003cbr\u003e \n\u003cbr\u003e Too late now for the old Ephesian vows,\n\u003cbr\u003e \n\u003cbr\u003e And not divine the crescent on thy brows! —\n\u003cbr\u003e \n\u003cbr\u003e Yet, call thee nothing but the mere mild Moon,\n\u003cbr\u003e \n\u003cbr\u003e Behind those chestnut boughs,\n\u003cbr\u003e \n\u003cbr\u003e Casting their dappled shadows at my feet;\n\u003cbr\u003e \n\u003cbr\u003e I will be grateful for that simple boon,\n\u003cbr\u003e \n\u003cbr\u003e In many a thoughtful verse and anthem sweet,\n\u003cbr\u003e \n\u003cbr\u003e And bless thy dainty face when’er we meet.\n\u003cbr\u003e 4.\n\u003cbr\u003e \n\u003cbr\u003e In nights far gone — ay, far away and dead —\n\u003cbr\u003e \n\u003cbr\u003e Before Care-fretted, with a lidless eye —\n\u003cbr\u003e \n\u003cbr\u003e I was thy wooer on my little bed,\n\u003cbr\u003e \n\u003cbr\u003e Letting the early hours of rest go by,\n\u003cbr\u003e \n\u003cbr\u003e To see thee flood the heaven with milky light,\n\u003cbr\u003e \n\u003cbr\u003e And feed thy snow-white swans, before I slept;\n\u003cbr\u003e \n\u003cbr\u003e For thou wert then purveyor of my dreams —\n\u003cbr\u003e \n\u003cbr\u003e Thou wert the fairies’ armourer, that kept\n\u003cbr\u003e \n\u003cbr\u003e Their burnish’d helms, and crowns, and corslets bright,\n\u003cbr\u003e \n\u003cbr\u003e Their spears, and glittering mails;\n\u003cbr\u003e \n\u003cbr\u003e And ever thou didst spill in winding streams\n\u003cbr\u003e \n\u003cbr\u003e Sparkles and midnight gleams,\n\u003cbr\u003e \n\u003cbr\u003e For fishes to new gloss their ardent scales! —\n\u003cbr\u003e 5.\n\u003cbr\u003e \n\u003cbr\u003e Why sighs? — why creeping tears? — why clasped hands? —\n\u003cbr\u003e \n\u003cbr\u003e Is it to count the boy’s expended dow’r?\n\u003cbr\u003e \n\u003cbr\u003e That fairies since have broke their gifted wands?\n\u003cbr\u003e \n\u003cbr\u003e That young Delight, like any o’erblown flower,\n\u003cbr\u003e \n\u003cbr\u003e Gave, one by one, its sweet leaves to the ground? —\n\u003cbr\u003e \n\u003cbr\u003e Why then, fair Moon, for all thou mark’st no hour,\n\u003cbr\u003e \n\u003cbr\u003e Thou art a sadder dial to old Time\n\u003cbr\u003e \n\u003cbr\u003e Than ever I have found\n\u003cbr\u003e \n\u003cbr\u003e On sunny garden-plot, or moss-grown tow’r,\n\u003cbr\u003e \n\u003cbr\u003e Motto’d with stern and melancholy rhyme.\n\u003cbr\u003e 6.\n\u003cbr\u003e \n\u003cbr\u003e Why should I grieve for this? — Oh I must yearn\n\u003cbr\u003e \n\u003cbr\u003e Whilst Time, conspirator with Memory,\n\u003cbr\u003e \n\u003cbr\u003e Keeps his cold ashes in an ancient urn,\n\u003cbr\u003e \n\u003cbr\u003e Richly emboss’d with childhood’s revelry,\n\u003cbr\u003e \n\u003cbr\u003e With leaves and cluster’d fruits, and flow’rs eterne —\n\u003cbr\u003e \n\u003cbr\u003e (Eternal to the world, though not to me),\n\u003cbr\u003e \n\u003cbr\u003e Aye there will those brave sports and blossoms be,\n\u003cbr\u003e \n\u003cbr\u003e The deathless wreath, and undecay’d festoon,\n\u003cbr\u003e \n\u003cbr\u003e When I am hearsed within —\n\u003cbr\u003e \n\u003cbr\u003e Less than the pallid primrose to the Moon,\n\u003cbr\u003e \n\u003cbr\u003e That now she watches through a vapor thin.\n\u003cbr\u003e 7.\n\u003cbr\u003e \n\u003cbr\u003e So let it be:— Before I lived to sigh,\n\u003cbr\u003e \n\u003cbr\u003e Thou wert in Avon, and a thousand rills,\n\u003cbr\u003e \n\u003cbr\u003e Beautiful Orb! and so, whene’er I lie\n\u003cbr\u003e \n\u003cbr\u003e Trodden, thou wilt be gazing from thy hills.\n\u003cbr\u003e \n\u003cbr\u003e Blest be thy loving light, where’er it spills,\n\u003cbr\u003e \n\u003cbr\u003e And bless?d thy fair face, O Mother mild!\n\u003cbr\u003e \n\u003cbr\u003e Still shine, the soul of rivers as they run,\n\u003cbr\u003e \n\u003cbr\u003e Still lend thy lonely lamp to lovers fond,\n\u003cbr\u003e \n\u003cbr\u003e And blend their plighted shadows into one:—\n\u003cbr\u003e \n\u003cbr\u003e Still smile at even on the bedded child,\n\u003cbr\u003e \n\u003cbr\u003e And close his eyelids with thy silver wand!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/36811.html","bookId":111,"creation":"Aug 1, 2019 4:01:33 AM","modification":"Aug 1, 2019 4:01:33 AM"}
