{"id":2635,"no":4,"title":"The Sea of Death.","content":"A Fragment.\n\u003cbr\u003e \n\u003cbr\u003e —— Methought I saw\n\u003cbr\u003e \n\u003cbr\u003e Life swiftly treading over endless space;\n\u003cbr\u003e \n\u003cbr\u003e And, at her foot-print, but a bygone pace,\n\u003cbr\u003e \n\u003cbr\u003e The ocean-past, which, with increasing wave,\n\u003cbr\u003e \n\u003cbr\u003e Swallow’d her steps like a pursuing grave.\n\u003cbr\u003e \n\u003cbr\u003e Sad were my thoughts that anchor’d silently\n\u003cbr\u003e \n\u003cbr\u003e On the dead waters of that passionless sea,\n\u003cbr\u003e \n\u003cbr\u003e Unstirr’d by any touch of living breath:\n\u003cbr\u003e \n\u003cbr\u003e Silence hung over it, and drowsy Death,\n\u003cbr\u003e \n\u003cbr\u003e Like a gorged sea-bird, slept with folded wings\n\u003cbr\u003e \n\u003cbr\u003e On crowded carcases — sad passive things\n\u003cbr\u003e \n\u003cbr\u003e That wore the thin gray surface, like a veil\n\u003cbr\u003e \n\u003cbr\u003e Over the calmness of their features pale.\n\u003cbr\u003e \n\u003cbr\u003e And there were spring-faced cherubs that did sleep\n\u003cbr\u003e \n\u003cbr\u003e Like water-lilies on that motionless deep,\n\u003cbr\u003e \n\u003cbr\u003e How beautiful! with bright unruffled hair\n\u003cbr\u003e \n\u003cbr\u003e On sleek unfretted brows, and eyes that were\n\u003cbr\u003e \n\u003cbr\u003e Buried in marble tombs, a pale eclipse!\n\u003cbr\u003e \n\u003cbr\u003e And smile-bedimpled cheeks, and pleasant lips,\n\u003cbr\u003e \n\u003cbr\u003e Meekly apart, as if the soul intense\n\u003cbr\u003e \n\u003cbr\u003e Spake out in dreams of its own innocence:\n\u003cbr\u003e \n\u003cbr\u003e And so they lay in loveliness, and kept\n\u003cbr\u003e \n\u003cbr\u003e The birth-night of their peace, that Life e’en wept\n\u003cbr\u003e \n\u003cbr\u003e With very envy of their happy fronts;\n\u003cbr\u003e \n\u003cbr\u003e For there were neighbor brows scarr’d by the brunts\n\u003cbr\u003e \n\u003cbr\u003e Of strife and sorrowing — where Care had set\n\u003cbr\u003e \n\u003cbr\u003e His crooked autograph, and marr’d the jet\n\u003cbr\u003e \n\u003cbr\u003e Of glassy locks, with hollow eyes forlorn,\n\u003cbr\u003e \n\u003cbr\u003e And lips that curl’d in bitterness and scorn —\n\u003cbr\u003e \n\u003cbr\u003e Wretched — as they had breathed of this world’s pain,\n\u003cbr\u003e \n\u003cbr\u003e And so bequeathed it to the world again,\n\u003cbr\u003e \n\u003cbr\u003e Through the beholder’s heart in heavy sighs.\n\u003cbr\u003e \n\u003cbr\u003e So lay they garmented in torpid light,\n\u003cbr\u003e \n\u003cbr\u003e Under the pall of a transparent night,\n\u003cbr\u003e \n\u003cbr\u003e Like solemn apparitions lull’d sublime\n\u003cbr\u003e \n\u003cbr\u003e To everlasting rest — and with them Time\n\u003cbr\u003e \n\u003cbr\u003e Slept, as he sleeps upon the silent face\n\u003cbr\u003e \n\u003cbr\u003e Of a dark dial in a sunless place.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/36779.html","bookId":111,"creation":"Aug 1, 2019 4:00:04 AM","modification":"Aug 1, 2019 4:00:04 AM"}
