{"id":2675,"no":44,"title":"The Plea of the Midsummer Fairies.?","content":"1.\n\u003cbr\u003e \n\u003cbr\u003e ’Twas in that mellow season of the year\n\u003cbr\u003e \n\u003cbr\u003e When the hot sun singes the yellow leaves\n\u003cbr\u003e \n\u003cbr\u003e Till they be gold — and with a broader sphere\n\u003cbr\u003e \n\u003cbr\u003e The Moon looks down on Ceres and her sheaves;\n\u003cbr\u003e \n\u003cbr\u003e When more abundantly the spider weaves,\n\u003cbr\u003e \n\u003cbr\u003e And the cold wind breathes from a chillier clime; —\n\u003cbr\u003e \n\u003cbr\u003e That forth I fared, on one of those still eves,\n\u003cbr\u003e \n\u003cbr\u003e Touch’d with the dewy sadness of the time,\n\u003cbr\u003e \n\u003cbr\u003e To think how the bright months had spent their prime,\n\u003cbr\u003e 2.\n\u003cbr\u003e \n\u003cbr\u003e So that, wherever I address’d my way,\n\u003cbr\u003e \n\u003cbr\u003e I seem’d to track the melancholy feet\n\u003cbr\u003e \n\u003cbr\u003e Of him that is the Father of Decay,\n\u003cbr\u003e \n\u003cbr\u003e And spoils at once the sour weed and the sweet; —\n\u003cbr\u003e \n\u003cbr\u003e Wherefore regretfully I made retreat\n\u003cbr\u003e \n\u003cbr\u003e To some unwasted regions of my brain,\n\u003cbr\u003e \n\u003cbr\u003e Charm’d with the light of summer and the heat,\n\u003cbr\u003e \n\u003cbr\u003e And bade that bounteous season bloom again,\n\u003cbr\u003e \n\u003cbr\u003e And sprout fresh flowers in mine own domain.\n\u003cbr\u003e 3.\n\u003cbr\u003e \n\u003cbr\u003e It was a shady and sequester’d scene,\n\u003cbr\u003e \n\u003cbr\u003e Like those famed gardens of Boccaccio,\n\u003cbr\u003e \n\u003cbr\u003e Planted with his own laurels evergreen,\n\u003cbr\u003e \n\u003cbr\u003e And roses that for endless summer blow;\n\u003cbr\u003e \n\u003cbr\u003e And there were fountain springs to overflow\n\u003cbr\u003e \n\u003cbr\u003e Their marble basins — and cool green arcades\n\u003cbr\u003e \n\u003cbr\u003e Of tall o’erarching sycamores, to throw\n\u003cbr\u003e \n\u003cbr\u003e Athwart the dappled path their dancing shades —\n\u003cbr\u003e \n\u003cbr\u003e With timid coneys cropping the green blades.\n\u003cbr\u003e 4.\n\u003cbr\u003e \n\u003cbr\u003e And there were crystal pools, peopled with fish,\n\u003cbr\u003e \n\u003cbr\u003e Argent and gold; and some of Tyrian skin,\n\u003cbr\u003e \n\u003cbr\u003e Some crimson-barr’d; — and ever at a wish\n\u003cbr\u003e \n\u003cbr\u003e They rose obsequious till the wave grew thin\n\u003cbr\u003e \n\u003cbr\u003e As glass upon their backs, and then dived in,\n\u003cbr\u003e \n\u003cbr\u003e Quenching their ardent scales in watery gloom;\n\u003cbr\u003e \n\u003cbr\u003e Whilst others with fresh hues row’d forth to win\n\u003cbr\u003e \n\u003cbr\u003e My changeable regard — for so we doom\n\u003cbr\u003e \n\u003cbr\u003e Things born of thought to vanish or to bloom.\n\u003cbr\u003e 5.\n\u003cbr\u003e \n\u003cbr\u003e And there were many birds of many dyes,\n\u003cbr\u003e \n\u003cbr\u003e From tree to tree still faring to and fro,\n\u003cbr\u003e \n\u003cbr\u003e And stately peacocks with their splendid eyes,\n\u003cbr\u003e \n\u003cbr\u003e And gorgeous pheasants with their golden glow,\n\u003cbr\u003e \n\u003cbr\u003e Like Iris just bedabbled in her bow,\n\u003cbr\u003e \n\u003cbr\u003e Beside some vocalists, without a name,\n\u003cbr\u003e \n\u003cbr\u003e That oft on fairy errands come and go,\n\u003cbr\u003e \n\u003cbr\u003e With accents magical; — and all were tame,\n\u003cbr\u003e \n\u003cbr\u003e And peckled at my hand where’er I came.\n\u003cbr\u003e 6.\n\u003cbr\u003e \n\u003cbr\u003e And for my sylvan company, in lieu\n\u003cbr\u003e \n\u003cbr\u003e Of Pampinea with her lively peers,\n\u003cbr\u003e \n\u003cbr\u003e Sate Queen Titania with her pretty crew,\n\u003cbr\u003e \n\u003cbr\u003e All in their liveries quaint, with elfin gears,\n\u003cbr\u003e \n\u003cbr\u003e For she was gracious to my childish years,\n\u003cbr\u003e \n\u003cbr\u003e And made me free of her enchanted round;\n\u003cbr\u003e \n\u003cbr\u003e Wherefore this dreamy scene she still endears,\n\u003cbr\u003e \n\u003cbr\u003e And plants her court upon a verdant mound,\n\u003cbr\u003e \n\u003cbr\u003e Fenced with umbrageous woods and groves profound.\n\u003cbr\u003e 7.\n\u003cbr\u003e \n\u003cbr\u003e “Ah me,” she cries, “was ever moonlight seen\n\u003cbr\u003e \n\u003cbr\u003e So clear and tender for our midnight trips?\n\u003cbr\u003e \n\u003cbr\u003e Go some one forth, and with a trump convene\n\u003cbr\u003e \n\u003cbr\u003e My lieges all!”— Away the goblin skips\n\u003cbr\u003e \n\u003cbr\u003e A pace or two apart, and deftly strips\n\u003cbr\u003e \n\u003cbr\u003e The ruddy skin from a sweet rose’s cheek,\n\u003cbr\u003e \n\u003cbr\u003e Then blows the shuddering leaf between his lips,\n\u003cbr\u003e \n\u003cbr\u003e Making it utter forth a shrill small shriek,\n\u003cbr\u003e \n\u003cbr\u003e Like a fray’d bird in the gray owlet’s beak.\n\u003cbr\u003e 8.\n\u003cbr\u003e \n\u003cbr\u003e And lo! upon my fix’d delighted ken\n\u003cbr\u003e \n\u003cbr\u003e Appear’d the loyal Fays. — Some by degrees\n\u003cbr\u003e \n\u003cbr\u003e Crept from the primrose buds that open’d then,\n\u003cbr\u003e \n\u003cbr\u003e Ana some from bell-shaped blossoms like the bees,\n\u003cbr\u003e \n\u003cbr\u003e Some from the dewy meads, and rushy leas,\n\u003cbr\u003e \n\u003cbr\u003e Flew up like chafers when the rustics pass;\n\u003cbr\u003e \n\u003cbr\u003e Some from the rivers, others from tall trees\n\u003cbr\u003e \n\u003cbr\u003e Dropp’d, like shed blossoms, silent to the grass,\n\u003cbr\u003e \n\u003cbr\u003e Spirits and elfins small, of every class.\n\u003cbr\u003e 9.\n\u003cbr\u003e \n\u003cbr\u003e Peri and Pixy, and quaint Puck the Antic,\n\u003cbr\u003e \n\u003cbr\u003e Brought Robin Goodfellow, that merry swain;\n\u003cbr\u003e \n\u003cbr\u003e And stealthy Mab, queen of old realms romantic,\n\u003cbr\u003e \n\u003cbr\u003e Came too, from distance, in her tiny wain,\n\u003cbr\u003e \n\u003cbr\u003e Fresh dripping from a cloud — some bloomy rain,\n\u003cbr\u003e \n\u003cbr\u003e Then circling the bright Moon, had wash’d her car,\n\u003cbr\u003e \n\u003cbr\u003e And still bedew’d it with a various stain:\n\u003cbr\u003e \n\u003cbr\u003e Lastly came Ariel, shooting from a star,\n\u003cbr\u003e \n\u003cbr\u003e Who bears all fairy embassies afar.\n\u003cbr\u003e 10.\n\u003cbr\u003e \n\u003cbr\u003e But Oberon, that night elsewhere exiled,\n\u003cbr\u003e \n\u003cbr\u003e Was absent, whether some distemper’d spleen\n\u003cbr\u003e \n\u003cbr\u003e Kept him and his fair mate unreconciled,\n\u003cbr\u003e \n\u003cbr\u003e Or warfare with the Gnome (whose race had been\n\u003cbr\u003e \n\u003cbr\u003e Sometime obnoxious), kept him from his queen,\n\u003cbr\u003e \n\u003cbr\u003e And made her now peruse the starry skies\n\u003cbr\u003e \n\u003cbr\u003e Prophetical, with such an absent mien;\n\u003cbr\u003e \n\u003cbr\u003e Howbeit, the tears stole often to her eyes,\n\u003cbr\u003e \n\u003cbr\u003e And oft the Moon was incensed with her sighs —\n\u003cbr\u003e 11.\n\u003cbr\u003e \n\u003cbr\u003e Which made the elves sport drearily, and soon\n\u003cbr\u003e \n\u003cbr\u003e Their hushing dances languish’d to a stand,\n\u003cbr\u003e \n\u003cbr\u003e Like midnight leaves, when, as the Zephyrs swoon,\n\u003cbr\u003e \n\u003cbr\u003e All on their drooping stems they sink unfann’d —\n\u003cbr\u003e \n\u003cbr\u003e So into silence droop’d the fairy band,\n\u003cbr\u003e \n\u003cbr\u003e To see their empress dear so pale and still,\n\u003cbr\u003e \n\u003cbr\u003e Crowding her softly round on either hand,\n\u003cbr\u003e \n\u003cbr\u003e As pale as frosty snowdrops, and as chill,\n\u003cbr\u003e \n\u003cbr\u003e To whom the sceptred dame reveals her ill.\n\u003cbr\u003e 12.\n\u003cbr\u003e \n\u003cbr\u003e “Alas,” quoth she, “ye know our fairy lives\n\u003cbr\u003e \n\u003cbr\u003e Are leased upon the fickle faith of men;\n\u003cbr\u003e \n\u003cbr\u003e Not measured out against Fate’s mortal knives,\n\u003cbr\u003e \n\u003cbr\u003e Like human gosamers — we perish when\n\u003cbr\u003e \n\u003cbr\u003e We fade and are forgot in worldly kens —\n\u003cbr\u003e \n\u003cbr\u003e Though poesy has thus prolong’d our date,\n\u003cbr\u003e \n\u003cbr\u003e Thanks be to the sweet Bard’s auspicious pen\n\u003cbr\u003e \n\u003cbr\u003e That rescued us so long! — howbeit of late\n\u003cbr\u003e \n\u003cbr\u003e I feel some dark misgivings of our fate.”\n\u003cbr\u003e 13.\n\u003cbr\u003e \n\u003cbr\u003e “And this dull day my melancholy sleep\n\u003cbr\u003e \n\u003cbr\u003e Hath been so thronged with images of woe,\n\u003cbr\u003e \n\u003cbr\u003e That even now I cannot choose but weep\n\u003cbr\u003e \n\u003cbr\u003e To think this was some sad prophetic show\n\u003cbr\u003e \n\u003cbr\u003e Of future horror to befall us so,\n\u003cbr\u003e \n\u003cbr\u003e Of mortal wreck and uttermost distress,\n\u003cbr\u003e \n\u003cbr\u003e Yea, our poor empire’s fall and overthrow,\n\u003cbr\u003e \n\u003cbr\u003e For this was my long vision’s dreadful stress,\n\u003cbr\u003e \n\u003cbr\u003e And when I waked my trouble was not less.”\n\u003cbr\u003e 14.\n\u003cbr\u003e \n\u003cbr\u003e “Whenever to the clouds I tried to seek,\n\u003cbr\u003e \n\u003cbr\u003e Such leaden weight dragg’d these Icarian wings,\n\u003cbr\u003e \n\u003cbr\u003e My faithless wand was wavering and weak,\n\u003cbr\u003e \n\u003cbr\u003e And slimy toads had trespass’d in our rings —\n\u003cbr\u003e \n\u003cbr\u003e The birds refused to sing for me — all things\n\u003cbr\u003e \n\u003cbr\u003e Disown’d their old allegiance to our spells;\n\u003cbr\u003e \n\u003cbr\u003e The rude bees prick’d me with their rebel stings;\n\u003cbr\u003e \n\u003cbr\u003e And, when I pass’d, the valley-lily’s bells\n\u003cbr\u003e \n\u003cbr\u003e Rang out, methought, most melancholy knells.”\n\u003cbr\u003e 15.\n\u003cbr\u003e \n\u003cbr\u003e “And ever on the faint and flagging air\n\u003cbr\u003e \n\u003cbr\u003e A doleful spirit with a dreary note\n\u003cbr\u003e \n\u003cbr\u003e Cried in my fearful ear, ‘Prepare! prepare!’\n\u003cbr\u003e \n\u003cbr\u003e Which soon I knew came from a raven’s throat,\n\u003cbr\u003e \n\u003cbr\u003e Perch’d on a cypress-bough not far remote —\n\u003cbr\u003e \n\u003cbr\u003e A cursed bird, too crafty to be shot,\n\u003cbr\u003e \n\u003cbr\u003e That alway cometh with his soot-black coat\n\u003cbr\u003e \n\u003cbr\u003e To make hearts dreary:— for he is a blot\n\u003cbr\u003e \n\u003cbr\u003e Upon the book of life, as well ye wot! —”\n\u003cbr\u003e 16.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore some while I bribed him to be mute,\n\u003cbr\u003e \n\u003cbr\u003e With bitter acorns stuffing his foul maw,\n\u003cbr\u003e \n\u003cbr\u003e Which barely I appeased, when some fresh bruit\n\u003cbr\u003e \n\u003cbr\u003e Startled me all aheap! — and soon I saw\n\u003cbr\u003e \n\u003cbr\u003e The horridest shape that ever raised my awe —\n\u003cbr\u003e \n\u003cbr\u003e A monstrous giant, very huge and tall,\n\u003cbr\u003e \n\u003cbr\u003e Such as in elder times, devoid of law,\n\u003cbr\u003e \n\u003cbr\u003e With wicked might grieved the primeval ball,\n\u003cbr\u003e \n\u003cbr\u003e And this was sure the deadliest of them all!”\n\u003cbr\u003e 17.\n\u003cbr\u003e \n\u003cbr\u003e “Gaunt was he as a wolf of Languedoc,\n\u003cbr\u003e \n\u003cbr\u003e With bloody jaws, and frost upon his crown\n\u003cbr\u003e \n\u003cbr\u003e So from his barren poll one hoary lock\n\u003cbr\u003e \n\u003cbr\u003e Over his wrinkled front fell far adown,\n\u003cbr\u003e \n\u003cbr\u003e Well nigh to where his frosty brows did frown\n\u003cbr\u003e \n\u003cbr\u003e Like jagged icicles at cottage eaves;\n\u003cbr\u003e \n\u003cbr\u003e And for his coronal he wore some brown\n\u003cbr\u003e \n\u003cbr\u003e And bristled ears gather’d from Ceres’ sheaves,\n\u003cbr\u003e \n\u003cbr\u003e Entwined with certain sere and russet leaves.”\n\u003cbr\u003e 18.\n\u003cbr\u003e \n\u003cbr\u003e “And lo! upon a mast rear’d far aloft,\n\u003cbr\u003e \n\u003cbr\u003e He bore a very bright and crescent blade,\n\u003cbr\u003e \n\u003cbr\u003e The which he waved so dreadfully, and oft,\n\u003cbr\u003e \n\u003cbr\u003e In meditative spite, that, sore dismay’d,\n\u003cbr\u003e \n\u003cbr\u003e I crept into an acorn-cup for shade;\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the horrid effigy went by:\n\u003cbr\u003e \n\u003cbr\u003e I trow his look was dreadful, for it made\n\u003cbr\u003e \n\u003cbr\u003e The trembling birds betake them to the sky,\n\u003cbr\u003e \n\u003cbr\u003e For every leaf was lifted by his sigh.”\n\u003cbr\u003e 19.\n\u003cbr\u003e \n\u003cbr\u003e “And ever, as he sigh’d, his foggy breath\n\u003cbr\u003e \n\u003cbr\u003e Blurr’d out the landscape like a flight of smoke:\n\u003cbr\u003e \n\u003cbr\u003e Thence knew I this was either dreary Death\n\u003cbr\u003e \n\u003cbr\u003e Or Time, who leads all creatures to his stroke.\n\u003cbr\u003e \n\u003cbr\u003e Ah wretched me!”— Here, even as she spoke,\n\u003cbr\u003e \n\u003cbr\u003e The melancholy Shape came gliding in,\n\u003cbr\u003e \n\u003cbr\u003e And lean’d his back against an antique oak,\n\u003cbr\u003e \n\u003cbr\u003e Folding his wings, that were so fine and thin,\n\u003cbr\u003e \n\u003cbr\u003e They scarce were seen against the Dryad’s skin.\n\u003cbr\u003e 20.\n\u003cbr\u003e \n\u003cbr\u003e Then what a fear seized all the little rout!\n\u003cbr\u003e \n\u003cbr\u003e Look how a flock of panick’d sheep will stare —\n\u003cbr\u003e \n\u003cbr\u003e And huddle close — and start — and wheel about,\n\u003cbr\u003e \n\u003cbr\u003e Watching the roaming mongrel here and there —\n\u003cbr\u003e \n\u003cbr\u003e So did that sudden Apparition scare\n\u003cbr\u003e \n\u003cbr\u003e All close aheap those small affrighted things;\n\u003cbr\u003e \n\u003cbr\u003e Nor sought they now the safety of the air,\n\u003cbr\u003e \n\u003cbr\u003e As if some leaden spell withheld their wings;\n\u003cbr\u003e \n\u003cbr\u003e But who can fly that ancientest of Kings?\n\u003cbr\u003e 21.\n\u003cbr\u003e \n\u003cbr\u003e Whom now the Queen, with a forestalling tear\n\u003cbr\u003e \n\u003cbr\u003e And previous sigh, beginneth to entreat,\n\u003cbr\u003e \n\u003cbr\u003e Bidding him spare, for love, her lieges dear:\n\u003cbr\u003e \n\u003cbr\u003e “Alas!” quoth she, “is there no nodding wheat\n\u003cbr\u003e \n\u003cbr\u003e Ripe for thy crooked weapon, and more meet —\n\u003cbr\u003e \n\u003cbr\u003e Or wither’d leaves to ravish from the tree —\n\u003cbr\u003e \n\u003cbr\u003e Or crumbling battlements for thy defeat?\n\u003cbr\u003e \n\u003cbr\u003e Think but what vaunting monuments there be\n\u003cbr\u003e \n\u003cbr\u003e Builded in spite and mockery of thee.”\n\u003cbr\u003e 22.\n\u003cbr\u003e \n\u003cbr\u003e “O fret away the fabric walls of Fame,\n\u003cbr\u003e \n\u003cbr\u003e And grind down marble C?sars with the dust:\n\u003cbr\u003e \n\u003cbr\u003e Make tombs inscriptionless — raze each high name,\n\u003cbr\u003e \n\u003cbr\u003e And waste old armors of renown with rust:\n\u003cbr\u003e \n\u003cbr\u003e Do all of this, and thy revenge is just:\n\u003cbr\u003e \n\u003cbr\u003e Make such decays the trophies of thy prime,\n\u003cbr\u003e \n\u003cbr\u003e And check Ambition’s overweening lust,\n\u003cbr\u003e \n\u003cbr\u003e That dares exterminating war with Time —\n\u003cbr\u003e \n\u003cbr\u003e But we are guiltless of that lofty crime.”\n\u003cbr\u003e 23.\n\u003cbr\u003e \n\u003cbr\u003e “Frail feeble spirits! — the children of a dream!\n\u003cbr\u003e \n\u003cbr\u003e Leased on the sufferance of fickle men,\n\u003cbr\u003e \n\u003cbr\u003e Like motes dependent on the sunny beam,\n\u003cbr\u003e \n\u003cbr\u003e Living but in the sun’s indulgent ken,\n\u003cbr\u003e \n\u003cbr\u003e And when that light withdraws, withdrawing then; —\n\u003cbr\u003e \n\u003cbr\u003e So do we flutter in the glance of youth\n\u003cbr\u003e \n\u003cbr\u003e And fervid fancy — and so perish when\n\u003cbr\u003e \n\u003cbr\u003e The eye of faith grows aged; — in sad truth,\n\u003cbr\u003e \n\u003cbr\u003e Feeling thy sway, O Time! though not thy tooth!”\n\u003cbr\u003e 24.\n\u003cbr\u003e \n\u003cbr\u003e “Where be those old divinities forlorn,\n\u003cbr\u003e \n\u003cbr\u003e That dwelt in trees, or haunted in a stream?\n\u003cbr\u003e \n\u003cbr\u003e Alas! their memories are dimm’d and torn,\n\u003cbr\u003e \n\u003cbr\u003e Like the remainder tatters of a dream:\n\u003cbr\u003e \n\u003cbr\u003e So will it fare with our poor thrones, I deem; —\n\u003cbr\u003e \n\u003cbr\u003e For us the same dark trench Oblivion delves,\n\u003cbr\u003e \n\u003cbr\u003e That holds the wastes of every human scheme.\n\u003cbr\u003e \n\u003cbr\u003e O spare us then — and these our pretty elves —\n\u003cbr\u003e \n\u003cbr\u003e We soon, alas! shall perish of ourselves!”\n\u003cbr\u003e 25.\n\u003cbr\u003e \n\u003cbr\u003e Now as she ended, with a sigh, to name\n\u003cbr\u003e \n\u003cbr\u003e Those old Olympians, scatter’d by the whirl\n\u003cbr\u003e \n\u003cbr\u003e Of Fortune’s giddy wheel and brought to shame,\n\u003cbr\u003e \n\u003cbr\u003e Methought a scornful and malignant curl\n\u003cbr\u003e \n\u003cbr\u003e Show’d on the lips of that malicious churl,\n\u003cbr\u003e \n\u003cbr\u003e To think what noble havocs he had made;\n\u003cbr\u003e \n\u003cbr\u003e So that I fear’d he all at once would hurl\n\u003cbr\u003e \n\u003cbr\u003e The harmless fairies into endless shade —\n\u003cbr\u003e \n\u003cbr\u003e Howbeit he stopp’d awhile to whet his blade.\n\u003cbr\u003e 26.\n\u003cbr\u003e \n\u003cbr\u003e Pity it was to hear the elfins’ wail\n\u003cbr\u003e \n\u003cbr\u003e Rise up in concert from their mingled dread,\n\u003cbr\u003e \n\u003cbr\u003e Pity it was to see them, all so pale,\n\u003cbr\u003e \n\u003cbr\u003e Gaze on the grass as for a dying bed; —\n\u003cbr\u003e \n\u003cbr\u003e But Puck was seated on a spider’s thread,\n\u003cbr\u003e \n\u003cbr\u003e That hung between two branches of a briar,\n\u003cbr\u003e \n\u003cbr\u003e And ‘gan to swing and gambol, heels o’er head,\n\u003cbr\u003e \n\u003cbr\u003e Like any Southwark tumbler on a wire,\n\u003cbr\u003e \n\u003cbr\u003e For him no present grief could long inspire.\n\u003cbr\u003e 27.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the Queen with many piteous drops,\n\u003cbr\u003e \n\u003cbr\u003e Falling like tiny sparks full fast and free,\n\u003cbr\u003e \n\u003cbr\u003e Bedews a pathway from her throne; — and stops\n\u003cbr\u003e \n\u003cbr\u003e Before the foot of her arch enemy,\n\u003cbr\u003e \n\u003cbr\u003e And with her little arms enfolds his knee,\n\u003cbr\u003e \n\u003cbr\u003e That shows more grisly from that fair embrace;\n\u003cbr\u003e \n\u003cbr\u003e But she will ne’er depart. “Alas!” quoth she,\n\u003cbr\u003e \n\u003cbr\u003e “My painful fingers I will here enlace\n\u003cbr\u003e \n\u003cbr\u003e Till I have gain’d your pity for our race.”\n\u003cbr\u003e 28.\n\u003cbr\u003e \n\u003cbr\u003e “What have we ever done to earn this grudge,\n\u003cbr\u003e \n\u003cbr\u003e And hate —(if not too humble for thy hating?)—\n\u003cbr\u003e \n\u003cbr\u003e Look o’er our labors and our lives, and judge\n\u003cbr\u003e \n\u003cbr\u003e If there be any ills of our creating;\n\u003cbr\u003e \n\u003cbr\u003e For we are very kindly creatures, dating\n\u003cbr\u003e \n\u003cbr\u003e With nature’s charities still sweet and bland:—\n\u003cbr\u003e \n\u003cbr\u003e O think this murder worthy of debating!”\n\u003cbr\u003e \n\u003cbr\u003e Herewith she makes a signal with her hand,\n\u003cbr\u003e \n\u003cbr\u003e To beckon some one from the Fairy band.\n\u003cbr\u003e 29.\n\u003cbr\u003e \n\u003cbr\u003e Anon I saw one of those elfin things,\n\u003cbr\u003e \n\u003cbr\u003e Clad all in white like any chorister,\n\u003cbr\u003e \n\u003cbr\u003e Come fluttering forth on his melodious wings,\n\u003cbr\u003e \n\u003cbr\u003e That made soft music at each little stir,\n\u003cbr\u003e \n\u003cbr\u003e But something louder than a bee’s demur\n\u003cbr\u003e \n\u003cbr\u003e Before he lights upon a bunch of broom,\n\u003cbr\u003e \n\u003cbr\u003e And thus ‘gan he with Saturn to confer —\n\u003cbr\u003e \n\u003cbr\u003e And O his voice was sweet, touch’d with the gloom\n\u003cbr\u003e \n\u003cbr\u003e Of that sad theme that argued of his doom!\n\u003cbr\u003e 30.\n\u003cbr\u003e \n\u003cbr\u003e Quoth he, “We make all melodies our care,\n\u003cbr\u003e \n\u003cbr\u003e That no false discords may offend the Sun,\n\u003cbr\u003e \n\u003cbr\u003e Music’s great master — tuning everywhere\n\u003cbr\u003e \n\u003cbr\u003e All pastoral sounds and melodies, each one\n\u003cbr\u003e \n\u003cbr\u003e Duly to place and season, so that none\n\u003cbr\u003e \n\u003cbr\u003e May harshly interfere. We rouse at morn\n\u003cbr\u003e \n\u003cbr\u003e The shrill sweet lark; and when the day is done,\n\u003cbr\u003e \n\u003cbr\u003e Hush silent pauses for the bird forlorn,\n\u003cbr\u003e \n\u003cbr\u003e That singeth with her breast against a thorn.”\n\u003cbr\u003e 31.\n\u003cbr\u003e \n\u003cbr\u003e “We gather in loud choirs the twittering race,\n\u003cbr\u003e \n\u003cbr\u003e That make a chorus with their single note;\n\u003cbr\u003e \n\u003cbr\u003e And tend on new-fledged birds in every place,\n\u003cbr\u003e \n\u003cbr\u003e That duly they may get their tunes by rote;\n\u003cbr\u003e \n\u003cbr\u003e And oft, like echoes, answering remote,\n\u003cbr\u003e \n\u003cbr\u003e We hide in thickets from the feather’d throng,\n\u003cbr\u003e \n\u003cbr\u003e And strain in rivalship each throbbing throat,\n\u003cbr\u003e \n\u003cbr\u003e Singing in shrill responses all day long,\n\u003cbr\u003e \n\u003cbr\u003e Whilst the glad truant listens to our song.”\n\u003cbr\u003e 32.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore, great King of Years, as thou dost love\n\u003cbr\u003e \n\u003cbr\u003e The raining music from a morning cloud,\n\u003cbr\u003e \n\u003cbr\u003e When vanish’d larks are carolling above,\n\u003cbr\u003e \n\u003cbr\u003e To wake Apollo with their pipings loud; —\n\u003cbr\u003e \n\u003cbr\u003e If ever thou hast heard in leafy shroud\n\u003cbr\u003e \n\u003cbr\u003e The sweet and plaintive Sappho of the dell,\n\u003cbr\u003e \n\u003cbr\u003e Show thy sweet mercy on this little crowd,\n\u003cbr\u003e \n\u003cbr\u003e And we will muffle up the sheepfold bell\n\u003cbr\u003e \n\u003cbr\u003e Whene’er thou listenest to Philomel.”\n\u003cbr\u003e 33.\n\u003cbr\u003e \n\u003cbr\u003e Then Saturn thus; —“Sweet is the merry lark,\n\u003cbr\u003e \n\u003cbr\u003e That carols in man’s ear so clear and strong;\n\u003cbr\u003e \n\u003cbr\u003e And youth must love to listen in the dark\n\u003cbr\u003e \n\u003cbr\u003e That tuneful elegy of Tereus’ wrong;\n\u003cbr\u003e \n\u003cbr\u003e But I have heard that ancient strain too long,\n\u003cbr\u003e \n\u003cbr\u003e For sweet is sweet but when a little strange,\n\u003cbr\u003e \n\u003cbr\u003e And I grow weary for some newer song;\n\u003cbr\u003e \n\u003cbr\u003e For wherefore had I wings, unless to range\n\u003cbr\u003e \n\u003cbr\u003e Through all things mutable, from change to change?”\n\u003cbr\u003e 34.\n\u003cbr\u003e \n\u003cbr\u003e “But would’st thou hear the melodies of Time,\n\u003cbr\u003e \n\u003cbr\u003e Listen when sleep and drowsy darkness roll\n\u003cbr\u003e \n\u003cbr\u003e Over hush’d cities, and the midnight chime\n\u003cbr\u003e \n\u003cbr\u003e Sounds from their hundred clocks, and deep bells toll\n\u003cbr\u003e \n\u003cbr\u003e Like a last knell over the dead world’s soul,\n\u003cbr\u003e \n\u003cbr\u003e Saying, ‘Time shall be final of all things,\n\u003cbr\u003e \n\u003cbr\u003e Whose late, last voice must elegize the whole,’—\n\u003cbr\u003e \n\u003cbr\u003e O then I clap aloft my brave broad wings,\n\u003cbr\u003e \n\u003cbr\u003e And make the wide air tremble while it rings!”\n\u003cbr\u003e 35.\n\u003cbr\u003e \n\u003cbr\u003e Then next a fair Eve-Fay made meek address,\n\u003cbr\u003e \n\u003cbr\u003e Saying, “We be the handmaids of the Spring;\n\u003cbr\u003e \n\u003cbr\u003e In sign whereof, May, the quaint broideress,\n\u003cbr\u003e \n\u003cbr\u003e Hath wrought her samplers on our gauzy wing.\n\u003cbr\u003e \n\u003cbr\u003e We tend upon buds birth and blossoming,\n\u003cbr\u003e \n\u003cbr\u003e And count the leafy tributes that they owe —\n\u003cbr\u003e \n\u003cbr\u003e As, so much to the earth — so much to fling\n\u003cbr\u003e \n\u003cbr\u003e In showers to the brook — so much to go\n\u003cbr\u003e \n\u003cbr\u003e In whirlwinds to the clouds that made them grow.”\n\u003cbr\u003e 36.\n\u003cbr\u003e \n\u003cbr\u003e “The pastoral cowslips are our little pets,\n\u003cbr\u003e \n\u003cbr\u003e And daisy stars, whose firmament is green;\n\u003cbr\u003e \n\u003cbr\u003e Pansies, and those veil’d nuns, meek violets,\n\u003cbr\u003e \n\u003cbr\u003e Sighing to that warm world from which they screen;\n\u003cbr\u003e \n\u003cbr\u003e And golden daffodils, pluck’d for May’s Queen;\n\u003cbr\u003e \n\u003cbr\u003e And lonely harebells, quaking on the heath;\n\u003cbr\u003e \n\u003cbr\u003e And Hyacinth, long since a fair youth seen,\n\u003cbr\u003e \n\u003cbr\u003e Whose tuneful voice, turn’d fragrance in his breath,\n\u003cbr\u003e \n\u003cbr\u003e Kiss’d by sad Zephyr, guilty of his death.”\n\u003cbr\u003e 37.\n\u003cbr\u003e \n\u003cbr\u003e “The widow’d primrose weeping to the moon\n\u003cbr\u003e \n\u003cbr\u003e And saffron crocus in whose chalice bright\n\u003cbr\u003e \n\u003cbr\u003e A cool libation hoarded for the noon\n\u003cbr\u003e \n\u003cbr\u003e Is kept — and she that purifies the light,\n\u003cbr\u003e \n\u003cbr\u003e The virgin lily, faithful to her white,\n\u003cbr\u003e \n\u003cbr\u003e Whereon Eve wept in Eden for her shame;\n\u003cbr\u003e \n\u003cbr\u003e And the most dainty rose, Aurora’s spright,\n\u003cbr\u003e \n\u003cbr\u003e Our every godchild, by whatever name —\n\u003cbr\u003e \n\u003cbr\u003e Spares us our lives, for we did nurse the same!”\n\u003cbr\u003e 38.\n\u003cbr\u003e \n\u003cbr\u003e Then that old Mower stamp’d his heel, and struck\n\u003cbr\u003e \n\u003cbr\u003e His hurtful scythe against the harmless ground,\n\u003cbr\u003e \n\u003cbr\u003e Saying, “Ye foolish imps, when am I stuck\n\u003cbr\u003e \n\u003cbr\u003e With gaudy buds, or like a wooer crown’d\n\u003cbr\u003e \n\u003cbr\u003e With flow’ry chaplets, save when they are found\n\u003cbr\u003e \n\u003cbr\u003e Withered? — Whenever have I pluck’d a rose,\n\u003cbr\u003e \n\u003cbr\u003e Except to scatter its vain leaves around?\n\u003cbr\u003e \n\u003cbr\u003e For so all gloss of beauty I oppose,\n\u003cbr\u003e \n\u003cbr\u003e And bring decay on every flow’r that blows.”\n\u003cbr\u003e 39.\n\u003cbr\u003e \n\u003cbr\u003e “Or when am I so wroth as when I view\n\u003cbr\u003e \n\u003cbr\u003e The wanton pride of Summer; — how she decks\n\u003cbr\u003e \n\u003cbr\u003e The birthday world with blossoms ever-new,\n\u003cbr\u003e \n\u003cbr\u003e As if Time had not lived, and heap’d great wrecks\n\u003cbr\u003e \n\u003cbr\u003e Of years on years? — O then I bravely vex\n\u003cbr\u003e \n\u003cbr\u003e And catch the gay Months in their gaudy plight,\n\u003cbr\u003e \n\u003cbr\u003e And slay them with the wreaths about their necks,\n\u003cbr\u003e \n\u003cbr\u003e Like foolish heifers in the holy rite,\n\u003cbr\u003e \n\u003cbr\u003e And raise great trophies to my ancient might.”\n\u003cbr\u003e 40.\n\u003cbr\u003e \n\u003cbr\u003e Then saith another, “We are kindly things,\n\u003cbr\u003e \n\u003cbr\u003e And like her offspring nestle with the dove —\n\u003cbr\u003e \n\u003cbr\u003e Witness these hearts embroidered on our wings,\n\u003cbr\u003e \n\u003cbr\u003e To show our constant patronage of love:—\n\u003cbr\u003e \n\u003cbr\u003e We sit at even, in sweet bow’rs above\n\u003cbr\u003e \n\u003cbr\u003e Lovers, and shake rich odors on the air,\n\u003cbr\u003e \n\u003cbr\u003e To mingle with their sighs; and still remove\n\u003cbr\u003e \n\u003cbr\u003e The startling owl, and bid the bat forbear\n\u003cbr\u003e \n\u003cbr\u003e Their privacy, and haunt some other where.”\n\u003cbr\u003e 41.\n\u003cbr\u003e \n\u003cbr\u003e “And we are near the mother when she sits\n\u003cbr\u003e \n\u003cbr\u003e Beside her infant in its wicker bed;\n\u003cbr\u003e \n\u003cbr\u003e And we are in the fairy scene that flits\n\u003cbr\u003e \n\u003cbr\u003e Across its tender brain: sweet dreams we shed,\n\u003cbr\u003e \n\u003cbr\u003e And whilst the tender little soul is fled,\n\u003cbr\u003e \n\u003cbr\u003e Away, to sport with our young elves, the while\n\u003cbr\u003e \n\u003cbr\u003e We touch the dimpled cheek with roses red,\n\u003cbr\u003e \n\u003cbr\u003e And tickle the soft lips until they smile,\n\u003cbr\u003e \n\u003cbr\u003e So that their careful parents they beguile.”\n\u003cbr\u003e 42.\n\u003cbr\u003e \n\u003cbr\u003e “O then, if ever thou hast breathed a vow\n\u003cbr\u003e \n\u003cbr\u003e At Love’s dear portal, or at pale moon-rise\n\u003cbr\u003e \n\u003cbr\u003e Crush’d the dear curl on a regardful brow,\n\u003cbr\u003e \n\u003cbr\u003e That did not frown thee from thy honey prize —\n\u003cbr\u003e \n\u003cbr\u003e If ever thy sweet son sat on thy thighs,\n\u003cbr\u003e \n\u003cbr\u003e And wooed thee from thy careful thoughts within\n\u003cbr\u003e \n\u003cbr\u003e To watch the harmless beauty of his eyes,\n\u003cbr\u003e \n\u003cbr\u003e Or glad thy fingers on his smooth soft skin,\n\u003cbr\u003e \n\u003cbr\u003e For Love’s dear sake, let us thy pity win!”\n\u003cbr\u003e 43.\n\u003cbr\u003e \n\u003cbr\u003e Then Saturn fiercely thus:—“What joy have I\n\u003cbr\u003e \n\u003cbr\u003e In tender babes, that have devour’d mine own,\n\u003cbr\u003e \n\u003cbr\u003e Whenever to the light I heard them cry,\n\u003cbr\u003e \n\u003cbr\u003e Till foolish Rhea cheated me with stone?\n\u003cbr\u003e \n\u003cbr\u003e Whereon, till now, is my great hunger shown,\n\u003cbr\u003e \n\u003cbr\u003e In monstrous dint of my enormous tooth;\n\u003cbr\u003e \n\u003cbr\u003e And — but the peopled world is too full grown\n\u003cbr\u003e \n\u003cbr\u003e For hunger’s edge — I would consume all youth\n\u003cbr\u003e \n\u003cbr\u003e At one great meal, without delay or ruth!”\n\u003cbr\u003e 44.\n\u003cbr\u003e \n\u003cbr\u003e “For I am well nigh crazed and wild to hear\n\u003cbr\u003e \n\u003cbr\u003e How boastful fathers taunt me with their breed,\n\u003cbr\u003e \n\u003cbr\u003e Saying, ‘We shall not die nor disappear,\n\u003cbr\u003e \n\u003cbr\u003e But, in these other selves, ourselves succeed\n\u003cbr\u003e \n\u003cbr\u003e Ev’n as ripe flowers pass into their seed\n\u003cbr\u003e \n\u003cbr\u003e Only to be renew’d from prime to prime,’\n\u003cbr\u003e \n\u003cbr\u003e All of which boastings I am forced to read,\n\u003cbr\u003e \n\u003cbr\u003e Besides a thousand challenges to Time,\n\u003cbr\u003e \n\u003cbr\u003e Which bragging lovers have compiled in rhyme.”\n\u003cbr\u003e 45.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore, when they are sweetly met o’ nights,\n\u003cbr\u003e \n\u003cbr\u003e There will I steal and with my hurried hand\n\u003cbr\u003e \n\u003cbr\u003e Startle them suddenly from their delights\n\u003cbr\u003e \n\u003cbr\u003e Before the next encounter hath been plann’d,\n\u003cbr\u003e \n\u003cbr\u003e Ravishing hours in little minutes spann’d;\n\u003cbr\u003e \n\u003cbr\u003e But when they say farewell, and grieve apart,\n\u003cbr\u003e \n\u003cbr\u003e Then like a leaden statue I will stand,\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile their many tears encrust my dart,\n\u003cbr\u003e \n\u003cbr\u003e And with a ragged edge cut heart from heart.”\n\u003cbr\u003e 46.\n\u003cbr\u003e \n\u003cbr\u003e Then next a merry Woodsman, clad in green,\n\u003cbr\u003e \n\u003cbr\u003e Step vanward from his mates, that idly stood\n\u003cbr\u003e \n\u003cbr\u003e Each at his proper ease, as they had been\n\u003cbr\u003e \n\u003cbr\u003e Nursed in the liberty of old Shérwood,\n\u003cbr\u003e \n\u003cbr\u003e And wore the livery of Robin Hood,\n\u003cbr\u003e \n\u003cbr\u003e Who wont in forest shades to dine and sup —\n\u003cbr\u003e \n\u003cbr\u003e So came this chief right frankly, and made good\n\u003cbr\u003e \n\u003cbr\u003e His haunch against his axe, and thus spoke up,\n\u003cbr\u003e \n\u003cbr\u003e Doffing his cap, which was an acorn’s cup:—\n\u003cbr\u003e 47.\n\u003cbr\u003e \n\u003cbr\u003e “We be small foresters and gay, who tend\n\u003cbr\u003e \n\u003cbr\u003e On trees, and all their furniture of green,\n\u003cbr\u003e \n\u003cbr\u003e Training the young boughs airily to bend,\n\u003cbr\u003e \n\u003cbr\u003e And show blue snatches of the sky between; —\n\u003cbr\u003e \n\u003cbr\u003e Or knit more close intricacies, to screen\n\u003cbr\u003e \n\u003cbr\u003e Birds’ crafty dwellings, as may hide them best,\n\u003cbr\u003e \n\u003cbr\u003e But most the timid blackbird’s — she that, seen,\n\u003cbr\u003e \n\u003cbr\u003e Will bear black poisonous berries to her nest,\n\u003cbr\u003e \n\u003cbr\u003e Lest man should cage the darlings of her breast.”\n\u003cbr\u003e 48.\n\u003cbr\u003e \n\u003cbr\u003e “We bend each tree in proper attitude,\n\u003cbr\u003e \n\u003cbr\u003e And founting willows train in silvery falls;\n\u003cbr\u003e \n\u003cbr\u003e We frame all shady roofs and arches rude,\n\u003cbr\u003e \n\u003cbr\u003e And verdant aisles leading to Dryads’ halls,\n\u003cbr\u003e \n\u003cbr\u003e Or deep recesses where the Echo calls; —\n\u003cbr\u003e \n\u003cbr\u003e We shape all plumy trees against the sky,\n\u003cbr\u003e \n\u003cbr\u003e And carve tall elms’ Corinthian capitals —\n\u003cbr\u003e \n\u003cbr\u003e When sometimes, as our tiny hatchets ply,\n\u003cbr\u003e \n\u003cbr\u003e Men say, the tapping woodpecker is nigh.”\n\u003cbr\u003e 49.\n\u003cbr\u003e \n\u003cbr\u003e “Sometimes we scoop the squirrel’s hollow cell,\n\u003cbr\u003e \n\u003cbr\u003e And sometimes carve quaint letters on trees’ rind,\n\u003cbr\u003e \n\u003cbr\u003e That haply some lone musing wight may spell\n\u003cbr\u003e \n\u003cbr\u003e Dainty Aminta — Gentle Rosalind —\n\u003cbr\u003e \n\u003cbr\u003e Or chastest Laura — sweetly call’d to mind\n\u003cbr\u003e \n\u003cbr\u003e In sylvan solitudes, ere he lies down; —\n\u003cbr\u003e \n\u003cbr\u003e And sometimes we enrich gray stems with twined\n\u003cbr\u003e \n\u003cbr\u003e And vagrant ivy — or rich moss, whose brown\n\u003cbr\u003e \n\u003cbr\u003e Burns into gold as the warm sun goes down.”\n\u003cbr\u003e 50.\n\u003cbr\u003e \n\u003cbr\u003e “And, lastly, for mirth’s sake and Christmas cheer,\n\u003cbr\u003e \n\u003cbr\u003e We bear the seedling berries, for increase,\n\u003cbr\u003e \n\u003cbr\u003e To graft the Druid oaks, from year to year,\n\u003cbr\u003e \n\u003cbr\u003e Careful that mistletoe may never cease; —\n\u003cbr\u003e \n\u003cbr\u003e Wherefore, if thou dost prize the shady peace\n\u003cbr\u003e \n\u003cbr\u003e Of sombre forests, or to see light break\n\u003cbr\u003e \n\u003cbr\u003e Through sylvan cloisters, and in spring release\n\u003cbr\u003e \n\u003cbr\u003e Thy spirit amongst leaves from careful ake,\n\u003cbr\u003e \n\u003cbr\u003e Spare us our lives for the Green Dryad’s sake.”\n\u003cbr\u003e 51.\n\u003cbr\u003e \n\u003cbr\u003e Then Saturn, with a frown:—“Go forth, and fell\n\u003cbr\u003e \n\u003cbr\u003e Oak for your coffins, and thenceforth lay by\n\u003cbr\u003e \n\u003cbr\u003e Your axes for the rust, and bid farewell\n\u003cbr\u003e \n\u003cbr\u003e To all sweet birds, and the blue peeps of sky\n\u003cbr\u003e \n\u003cbr\u003e Through tangled branches, for ye shall not spy\n\u003cbr\u003e \n\u003cbr\u003e The next green generation of the tree;\n\u003cbr\u003e \n\u003cbr\u003e But hence with the dead leaves, whene’e they fly —\n\u003cbr\u003e \n\u003cbr\u003e Which in the bleak air I would rather see,\n\u003cbr\u003e \n\u003cbr\u003e Than flights of the most tuneful birds that be.”\n\u003cbr\u003e 52.\n\u003cbr\u003e \n\u003cbr\u003e “For I dislike all prime, and verdant pets,\n\u003cbr\u003e \n\u003cbr\u003e Ivy except, that on the aged wall\n\u003cbr\u003e \n\u003cbr\u003e Prays with its worm-like roots, and daily frets\n\u003cbr\u003e \n\u003cbr\u003e The crumbled tower it seems to league withal,\n\u003cbr\u003e \n\u003cbr\u003e King-like, worn down by its own coronal:—\n\u003cbr\u003e \n\u003cbr\u003e Neither in forest haunts love I to won,\n\u003cbr\u003e \n\u003cbr\u003e Before the golden plumage ‘gins to fall,\n\u003cbr\u003e \n\u003cbr\u003e And leaves the brown bleak limbs with few leaves on,\n\u003cbr\u003e \n\u003cbr\u003e Or bare — like Nature in her skeleton.”\n\u003cbr\u003e 53.\n\u003cbr\u003e \n\u003cbr\u003e “For then sit I amongst the crooked boughs,\n\u003cbr\u003e \n\u003cbr\u003e Wooing dull Memory with kindred sighs;\n\u003cbr\u003e \n\u003cbr\u003e And there in rustling nuptials we espouse,\n\u003cbr\u003e \n\u003cbr\u003e Smit by the sadness in each other’s eyes; —\n\u003cbr\u003e \n\u003cbr\u003e But Hope must have green bowers and blue skies,\n\u003cbr\u003e \n\u003cbr\u003e And must be courted with the gauds of Spring;\n\u003cbr\u003e \n\u003cbr\u003e Whilst Youth leans god-like on her lap, and cries,\n\u003cbr\u003e \n\u003cbr\u003e ‘What shall we always do, but love and sing?’—\n\u003cbr\u003e \n\u003cbr\u003e And Time is reckon’d a discarded thing.”\n\u003cbr\u003e 54.\n\u003cbr\u003e \n\u003cbr\u003e Here in my dream it made me fret to see\n\u003cbr\u003e \n\u003cbr\u003e How Puck, the antic, all this dreary while\n\u003cbr\u003e \n\u003cbr\u003e Had blithely jested with calamity,\n\u003cbr\u003e \n\u003cbr\u003e With mis-timed mirth mocking the doleful style\n\u003cbr\u003e \n\u003cbr\u003e Of his sad comrades, till it raised my bile\n\u003cbr\u003e \n\u003cbr\u003e To see him so reflect their grief aside,\n\u003cbr\u003e \n\u003cbr\u003e Turning their solemn looks to have a smile —\n\u003cbr\u003e \n\u003cbr\u003e Like a straight stick shown crooked in the tide; —\n\u003cbr\u003e \n\u003cbr\u003e But soon a novel advocate I spied.\n\u003cbr\u003e 55.\n\u003cbr\u003e \n\u003cbr\u003e Quoth he —“We teach all natures to fulfil\n\u003cbr\u003e \n\u003cbr\u003e Their fore-appointed crafts, and instincts meet —\n\u003cbr\u003e \n\u003cbr\u003e The bee’s sweet alchemy — the spider’s skill —\n\u003cbr\u003e \n\u003cbr\u003e The pismire’s care to garner up his wheat —\n\u003cbr\u003e \n\u003cbr\u003e And rustic masonry to swallows fleet —\n\u003cbr\u003e \n\u003cbr\u003e The lapwing’s cunning to preserve her nest —\n\u003cbr\u003e \n\u003cbr\u003e But most, that lesser pelican, the sweet\n\u003cbr\u003e \n\u003cbr\u003e And shrilly ruddock, with its bleeding breast,\n\u003cbr\u003e \n\u003cbr\u003e Its tender pity of poor babes distrest.”\n\u003cbr\u003e 56.\n\u003cbr\u003e \n\u003cbr\u003e “Sometimes we cast our shapes, and in sleek skins\n\u003cbr\u003e \n\u003cbr\u003e Delve with the timid mole, that aptly delves\n\u003cbr\u003e \n\u003cbr\u003e From our example; so the spider spins,\n\u003cbr\u003e \n\u003cbr\u003e And eke the silk-worm, pattern’d by ourselves:\n\u003cbr\u003e \n\u003cbr\u003e Sometimes we travail on the summer shelves\n\u003cbr\u003e \n\u003cbr\u003e Of early bees, and busy toils commence,\n\u003cbr\u003e \n\u003cbr\u003e Watch’d of wise men, that know not we are elves,\n\u003cbr\u003e \n\u003cbr\u003e But gaze and marvel at our stretch of sense,\n\u003cbr\u003e \n\u003cbr\u003e And praise our human-like intelligence.”\n\u003cbr\u003e 57.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore, by thy delight in that old tale,\n\u003cbr\u003e \n\u003cbr\u003e And plaintive dirges the late robins sing,\n\u003cbr\u003e \n\u003cbr\u003e What time the leaves are scatter’d by the gale,\n\u003cbr\u003e \n\u003cbr\u003e Mindful of that old forest burying; —\n\u003cbr\u003e \n\u003cbr\u003e As thou dost love to watch each tiny thing,\n\u003cbr\u003e \n\u003cbr\u003e For whom our craft most curiously contrives,\n\u003cbr\u003e \n\u003cbr\u003e If thou hast caught a bee upon the wing,\n\u003cbr\u003e \n\u003cbr\u003e To take his honey-bag — spare us our lives,\n\u003cbr\u003e \n\u003cbr\u003e And we will pay the ransom in full hives.”\n\u003cbr\u003e 58.\n\u003cbr\u003e \n\u003cbr\u003e “Now by my glass,” quoth Time, “ye do offend\n\u003cbr\u003e \n\u003cbr\u003e In teaching the brown bees that careful lore,\n\u003cbr\u003e \n\u003cbr\u003e And frugal ants, whose millions would have end,\n\u003cbr\u003e \n\u003cbr\u003e But they lay up for need a timely store,\n\u003cbr\u003e \n\u003cbr\u003e And travail with the seasons evermore;\n\u003cbr\u003e \n\u003cbr\u003e Whereas Great Mammoth long hath pass’d away,\n\u003cbr\u003e \n\u003cbr\u003e And none but I can tell what hide he wore;\n\u003cbr\u003e \n\u003cbr\u003e Whilst purblind men, the creatures of a day,\n\u003cbr\u003e \n\u003cbr\u003e In riddling wonder his great bones survey.”\n\u003cbr\u003e 59.\n\u003cbr\u003e \n\u003cbr\u003e Then came an elf, right beauteous to behold,\n\u003cbr\u003e \n\u003cbr\u003e Whose coat was like a brooklet that the sun\n\u003cbr\u003e \n\u003cbr\u003e Hath all embroider’d with its crooked gold,\n\u003cbr\u003e \n\u003cbr\u003e It was so quaintly wrought and overrun\n\u003cbr\u003e \n\u003cbr\u003e With spangled traceries — most meet for one\n\u003cbr\u003e \n\u003cbr\u003e That was a warden of the pearly streams; —\n\u003cbr\u003e \n\u003cbr\u003e And as he stept out of the shadows dun,\n\u003cbr\u003e \n\u003cbr\u003e His jewels sparkled in the pale moon’s gleams,\n\u003cbr\u003e \n\u003cbr\u003e And shot into the air their pointed beams.\n\u003cbr\u003e 60.\n\u003cbr\u003e \n\u003cbr\u003e Quoth he — “We bear the gold and silver keys\n\u003cbr\u003e \n\u003cbr\u003e Of bubbling springs and fountains, that below\n\u003cbr\u003e \n\u003cbr\u003e Course thro’ the veiny earth — which when they freeze\n\u003cbr\u003e \n\u003cbr\u003e Into hard crysolites, we bid to flow,\n\u003cbr\u003e \n\u003cbr\u003e Creeping like subtle snakes, when, as they go,\n\u003cbr\u003e \n\u003cbr\u003e We guide their windings to melodious falls,\n\u003cbr\u003e \n\u003cbr\u003e At whose soft murmurings, so sweet and low,\n\u003cbr\u003e \n\u003cbr\u003e Poets have tuned their smoothest madrigals,\n\u003cbr\u003e \n\u003cbr\u003e To sing to ladies in their banquet-halls.”\n\u003cbr\u003e 61.\n\u003cbr\u003e \n\u003cbr\u003e “And when the hot sun with his steadfast heat\n\u003cbr\u003e \n\u003cbr\u003e Parches the river god — whose dusty urn\n\u003cbr\u003e \n\u003cbr\u003e Drips miserly, till soon his crystal feet\n\u003cbr\u003e \n\u003cbr\u003e Against his pebbly floor wax faint and burn\n\u003cbr\u003e \n\u003cbr\u003e And languid fish, unpoised, grow sick and yearn —\n\u003cbr\u003e \n\u003cbr\u003e Then scoop we hollows in some sandy nook,\n\u003cbr\u003e \n\u003cbr\u003e And little channels dig, wherein we turn\n\u003cbr\u003e \n\u003cbr\u003e The thread-worn rivulet, that all forsook\n\u003cbr\u003e \n\u003cbr\u003e The Naiad-lily, pining for her brook.”\n\u003cbr\u003e 62.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore, by thy delight in cool green meads,\n\u003cbr\u003e \n\u003cbr\u003e With living sapphires daintily inlaid —\n\u003cbr\u003e \n\u003cbr\u003e In all soft songs of waters and their reeds —\n\u003cbr\u003e \n\u003cbr\u003e And all reflections in a streamlet made,\n\u003cbr\u003e \n\u003cbr\u003e Haply of thy own love, that, disarray’d,\n\u003cbr\u003e \n\u003cbr\u003e Kills the fair lily with a livelier white —\n\u003cbr\u003e \n\u003cbr\u003e By silver trouts upspringing from green shade,\n\u003cbr\u003e \n\u003cbr\u003e And winking stars reduplicate at night,\n\u003cbr\u003e \n\u003cbr\u003e Spare us, poor ministers to such delight.”\n\u003cbr\u003e 63.\n\u003cbr\u003e \n\u003cbr\u003e Howbeit his pleading and his gentle looks\n\u003cbr\u003e \n\u003cbr\u003e Moved not the spiteful Shade:— Quoth he, “Your taste\n\u003cbr\u003e \n\u003cbr\u003e Shoots wide of mine, for I despise the brooks\n\u003cbr\u003e \n\u003cbr\u003e And slavish rivulets that run to waste\n\u003cbr\u003e \n\u003cbr\u003e In noontide sweats, or, like poor vassals, haste\n\u003cbr\u003e \n\u003cbr\u003e To swell the vast dominion of the sea,\n\u003cbr\u003e \n\u003cbr\u003e In whose great presence I am held disgraced,\n\u003cbr\u003e \n\u003cbr\u003e And neighbor’d with a king that rivals me\n\u003cbr\u003e \n\u003cbr\u003e In ancient might and hoary majesty.”\n\u003cbr\u003e 64.\n\u003cbr\u003e \n\u003cbr\u003e “Whereas I ruled in Chaos, and still keep\n\u003cbr\u003e \n\u003cbr\u003e The awful secrets of that ancient dearth,\n\u003cbr\u003e \n\u003cbr\u003e Before the briny fountains of the deep\n\u003cbr\u003e \n\u003cbr\u003e Brimm’d up the hollow cavities of earth; —\n\u003cbr\u003e \n\u003cbr\u003e I saw each trickling Sea-God at his birth,\n\u003cbr\u003e \n\u003cbr\u003e Each pearly Naiad with her oozy locks,\n\u003cbr\u003e \n\u003cbr\u003e And infant Titans of enormous girth,\n\u003cbr\u003e \n\u003cbr\u003e Whose huge young feet yet stumbled on the rocks,\n\u003cbr\u003e \n\u003cbr\u003e Stunning the early world with frequent shocks.”\n\u003cbr\u003e 65.\n\u003cbr\u003e \n\u003cbr\u003e “Where now is Titan, with his cumbrous brood,\n\u003cbr\u003e \n\u003cbr\u003e That scared the world? — By this sharp scythe they fell,\n\u003cbr\u003e \n\u003cbr\u003e And half the sky was curdled with their blood:\n\u003cbr\u003e \n\u003cbr\u003e So have all primal giants sigh’d farewell.\n\u003cbr\u003e \n\u003cbr\u003e No wardens now by sedgy fountains dwell,\n\u003cbr\u003e \n\u003cbr\u003e Nor pearly Naiads. All their days are done\n\u003cbr\u003e \n\u003cbr\u003e That strove with Time, untimely, to excel;\n\u003cbr\u003e \n\u003cbr\u003e Wherefore I razed their progenies, and none\n\u003cbr\u003e \n\u003cbr\u003e But my great shadow intercepts the sun!”\n\u003cbr\u003e 66.\n\u003cbr\u003e \n\u003cbr\u003e Then saith the timid Fay —“Oh, mighty Time!\n\u003cbr\u003e \n\u003cbr\u003e Well hast thou wrought the cruel Titans’ fall,\n\u003cbr\u003e \n\u003cbr\u003e For they were stain’d with many a bloody crime:\n\u003cbr\u003e \n\u003cbr\u003e Great giants work great wrongs — but we are small,\n\u003cbr\u003e \n\u003cbr\u003e For love goes lowly; — but Oppression’s tall,\n\u003cbr\u003e \n\u003cbr\u003e And with surpassing strides goes foremost still\n\u003cbr\u003e \n\u003cbr\u003e Where love indeed can hardly reach at all;\n\u003cbr\u003e \n\u003cbr\u003e Like a poor dwarf o’erburthen’d with good will,\n\u003cbr\u003e \n\u003cbr\u003e That labors to efface the tracks of ill. —”\n\u003cbr\u003e 67.\n\u003cbr\u003e \n\u003cbr\u003e “Man even strives with Man, but we eschew\n\u003cbr\u003e \n\u003cbr\u003e The guilty feud, and all fierce strifes abhor;\n\u003cbr\u003e \n\u003cbr\u003e Nay, we are gentle as the sweet heaven’s dew,\n\u003cbr\u003e \n\u003cbr\u003e Beside the red and horrid drops of war,\n\u003cbr\u003e \n\u003cbr\u003e Weeping the cruel hates men battle for,\n\u003cbr\u003e \n\u003cbr\u003e Which worldly bosoms nourish in our spite:\n\u003cbr\u003e \n\u003cbr\u003e For in the gentle breast we ne’er withdraw,\n\u003cbr\u003e \n\u003cbr\u003e But only when all love hath taken flight,\n\u003cbr\u003e \n\u003cbr\u003e And youth’s warm gracious heart is hardened quite.”\n\u003cbr\u003e 68.\n\u003cbr\u003e \n\u003cbr\u003e “So are our gentle natures intertwined\n\u003cbr\u003e \n\u003cbr\u003e With sweet humanities, and closely knit\n\u003cbr\u003e \n\u003cbr\u003e In kindly sympathy with human kind.\n\u003cbr\u003e \n\u003cbr\u003e Witness how we befriend, with elfin wit,\n\u003cbr\u003e \n\u003cbr\u003e All hopeless maids and lovers — nor omit\n\u003cbr\u003e \n\u003cbr\u003e Magical succors unto hearts forlorn:—\n\u003cbr\u003e \n\u003cbr\u003e We charm man’s life, and do not perish it; —\n\u003cbr\u003e \n\u003cbr\u003e So judge us by the helps we showed this morn,\n\u003cbr\u003e \n\u003cbr\u003e To one who held his wretched days in scorn.”\n\u003cbr\u003e 69.\n\u003cbr\u003e \n\u003cbr\u003e “’Twas nigh sweet Amwell; — for the Queen had task’d\n\u003cbr\u003e \n\u003cbr\u003e Our skill to-day amidst the silver Lea,\n\u003cbr\u003e \n\u003cbr\u003e Whereon the noontide sun had not yet bask’d,\n\u003cbr\u003e \n\u003cbr\u003e Wherefore some patient man we thought to see,\n\u003cbr\u003e \n\u003cbr\u003e Planted in moss-grown rushes to the knee,\n\u003cbr\u003e \n\u003cbr\u003e Beside the cloudy margin cold and dim; —\n\u003cbr\u003e \n\u003cbr\u003e Howbeit no patient fisherman was he\n\u003cbr\u003e \n\u003cbr\u003e That cast his sudden shadow from the brim,\n\u003cbr\u003e \n\u003cbr\u003e Making us leave our toils to gaze on him.”\n\u003cbr\u003e 70.\n\u003cbr\u003e \n\u003cbr\u003e “His face was ashy pale, and leaden care\n\u003cbr\u003e \n\u003cbr\u003e Had sunk the levell’d arches of his brow,\n\u003cbr\u003e \n\u003cbr\u003e Once bridges for his joyous thoughts to fare\n\u003cbr\u003e \n\u003cbr\u003e Over those melancholy springs and slow,\n\u003cbr\u003e \n\u003cbr\u003e That from his piteous eyes began to flow,\n\u003cbr\u003e \n\u003cbr\u003e And fell anon into the chilly stream;\n\u003cbr\u003e \n\u003cbr\u003e Which, as his mimick’d image show’d below,\n\u003cbr\u003e \n\u003cbr\u003e Wrinkled his face with many a needless seam,\n\u003cbr\u003e \n\u003cbr\u003e Making grief sadder in its own esteem.”\n\u003cbr\u003e 71.\n\u003cbr\u003e \n\u003cbr\u003e “And lo! upon the air we saw him stretch\n\u003cbr\u003e \n\u003cbr\u003e His passionate arms; and, in a wayward strain,\n\u003cbr\u003e \n\u003cbr\u003e He ‘gan to elegize that fellow wretch\n\u003cbr\u003e \n\u003cbr\u003e That with mute gestures answer’d him again,\n\u003cbr\u003e \n\u003cbr\u003e Saying, ‘Poor slave, how long wilt thou remain\n\u003cbr\u003e \n\u003cbr\u003e Life’s sad weak captive in a prison strong,\n\u003cbr\u003e \n\u003cbr\u003e Hoping with tears to rust away thy chain,\n\u003cbr\u003e \n\u003cbr\u003e In bitter servitude to worldly wrong? —\n\u003cbr\u003e \n\u003cbr\u003e Thou wear’st that mortal livery too long!’”\n\u003cbr\u003e 72.\n\u003cbr\u003e \n\u003cbr\u003e “This, with more spleenful speeches and some tears,\n\u003cbr\u003e \n\u003cbr\u003e When he had spent upon the imaged wave,\n\u003cbr\u003e \n\u003cbr\u003e Speedily I convened my elfin peers\n\u003cbr\u003e \n\u003cbr\u003e Under the lily-cups, that we might save\n\u003cbr\u003e \n\u003cbr\u003e This woeful mortal from a wilful grave\n\u003cbr\u003e \n\u003cbr\u003e By shrewd diversions of his mind’s regret,\n\u003cbr\u003e \n\u003cbr\u003e Seeing he was mere Melancholy’s slave,\n\u003cbr\u003e \n\u003cbr\u003e That sank wherever a dark cloud he met,\n\u003cbr\u003e \n\u003cbr\u003e And straight was tangled in her secret net.”\n\u003cbr\u003e 73.\n\u003cbr\u003e \n\u003cbr\u003e “Therefore, as still he watch’d the water’s flow,\n\u003cbr\u003e \n\u003cbr\u003e Daintily we transform’d, and with bright fins\n\u003cbr\u003e \n\u003cbr\u003e Came glancing through the gloom; some from below\n\u003cbr\u003e \n\u003cbr\u003e Rose like dim fancies when a dream begins,\n\u003cbr\u003e \n\u003cbr\u003e Snatching the light upon their purple skins;\n\u003cbr\u003e \n\u003cbr\u003e Then under the broad leaves made slow retire:\n\u003cbr\u003e \n\u003cbr\u003e One like a golden galley bravely wins\n\u003cbr\u003e \n\u003cbr\u003e Its radiant course — another glows like fire —\n\u003cbr\u003e \n\u003cbr\u003e Making that wayward man our pranks admire.”\n\u003cbr\u003e 74.\n\u003cbr\u003e \n\u003cbr\u003e “And so he banish’d thought, and quite forgot\n\u003cbr\u003e \n\u003cbr\u003e All contemplation of that wretched face;\n\u003cbr\u003e \n\u003cbr\u003e And so we wiled him from that lonely spot\n\u003cbr\u003e \n\u003cbr\u003e Along the river’s brink; till, by heaven’s grace,\n\u003cbr\u003e \n\u003cbr\u003e He met a gentle haunter of the place,\n\u003cbr\u003e \n\u003cbr\u003e Full of sweet wisdom gather’d from the brooks,\n\u003cbr\u003e \n\u003cbr\u003e Who there discuss’d his melancholy case\n\u003cbr\u003e \n\u003cbr\u003e With wholesome texts learned from kind nature’s books,\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile he newly trimm’d his lines and hooks.”\n\u003cbr\u003e 75.\n\u003cbr\u003e \n\u003cbr\u003e Herewith the Fairy ceased. Quoth Ariel now —\n\u003cbr\u003e \n\u003cbr\u003e “Let me remember how I saved a man,\n\u003cbr\u003e \n\u003cbr\u003e Whose fatal noose was fastened on a bough,\n\u003cbr\u003e \n\u003cbr\u003e Intended to abridge his sad life’s span;\n\u003cbr\u003e \n\u003cbr\u003e For haply I was by when he began\n\u003cbr\u003e \n\u003cbr\u003e His stern soliloquy in life dispraise,\n\u003cbr\u003e \n\u003cbr\u003e And overheard his melancholy plan,\n\u003cbr\u003e \n\u003cbr\u003e How he had made a vow to end his days,\n\u003cbr\u003e \n\u003cbr\u003e And therefore follow’d him in all his ways.”\n\u003cbr\u003e 76.\n\u003cbr\u003e \n\u003cbr\u003e “Through brake and tangled copse, for much he loathed\n\u003cbr\u003e \n\u003cbr\u003e All populous haunts, and roam’d in forests rude,\n\u003cbr\u003e \n\u003cbr\u003e To hide himself from man. But I had clothed\n\u003cbr\u003e \n\u003cbr\u003e My delicate limbs with plumes, and still pursued,\n\u003cbr\u003e \n\u003cbr\u003e Where only foxes and wild cats intrude,\n\u003cbr\u003e \n\u003cbr\u003e Till we were come beside an ancient tree\n\u003cbr\u003e \n\u003cbr\u003e Late blasted by a storm. Here he renew’d\n\u003cbr\u003e \n\u003cbr\u003e His loud complaints — choosing that spot to be\n\u003cbr\u003e \n\u003cbr\u003e The scene of his last horrid tragedy.”\n\u003cbr\u003e 77.\n\u003cbr\u003e \n\u003cbr\u003e “It was a wild and melancholy glen,\n\u003cbr\u003e \n\u003cbr\u003e Made gloomy by tall firs and cypress dark,\n\u003cbr\u003e \n\u003cbr\u003e Whose roots, like any bones of buried men,\n\u003cbr\u003e \n\u003cbr\u003e Push’d through the rotten sod for fear’s remark;\n\u003cbr\u003e \n\u003cbr\u003e A hundred horrid stems, jagged and stark,\n\u003cbr\u003e \n\u003cbr\u003e Wrestled with crooked arms in hideous fray,\n\u003cbr\u003e \n\u003cbr\u003e Besides sleek ashes with their dappled bark,\n\u003cbr\u003e \n\u003cbr\u003e Like crafty serpents climbing for a prey,\n\u003cbr\u003e \n\u003cbr\u003e With many blasted oaks moss-grown and gray.”\n\u003cbr\u003e 78.\n\u003cbr\u003e \n\u003cbr\u003e “But here upon his final desperate clause\n\u003cbr\u003e \n\u003cbr\u003e Suddenly I pronounced so sweet a strain,\n\u003cbr\u003e \n\u003cbr\u003e Like a pang’d nightingale, it made him pause,\n\u003cbr\u003e \n\u003cbr\u003e Till half the frenzy of his grief was slain,\n\u003cbr\u003e \n\u003cbr\u003e The sad remainder oozing from his brain\n\u003cbr\u003e \n\u003cbr\u003e In timely ecstasies of healing tears,\n\u003cbr\u003e \n\u003cbr\u003e Which through his ardent eyes began to drain; —\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the deadly Fates unclosed their shears:—\n\u003cbr\u003e \n\u003cbr\u003e So pity me and all my fated peers!”\n\u003cbr\u003e 79.\n\u003cbr\u003e \n\u003cbr\u003e Thus Ariel ended, and was some time hush’d:\n\u003cbr\u003e \n\u003cbr\u003e When with the hoary shape a fresh tongue pleads,\n\u003cbr\u003e \n\u003cbr\u003e And red as rose the gentle Fairy blush’d\n\u003cbr\u003e \n\u003cbr\u003e To read the records of her own good deeds:—\n\u003cbr\u003e \n\u003cbr\u003e “It chanced,” quoth she, “in seeking through the meads\n\u003cbr\u003e \n\u003cbr\u003e For honied cowslips, sweetest in the morn,\n\u003cbr\u003e \n\u003cbr\u003e Whilst yet the buds were hung with dewy beads.”\n\u003cbr\u003e \n\u003cbr\u003e And Echo answered to the huntsman’s horn,\n\u003cbr\u003e \n\u003cbr\u003e We found a babe left in the swaths forlorn.\n\u003cbr\u003e 80.\n\u003cbr\u003e \n\u003cbr\u003e “A little, sorrowful, deserted thing,\n\u003cbr\u003e \n\u003cbr\u003e Begot of love, and yet no love begetting;\n\u003cbr\u003e \n\u003cbr\u003e Guiltless of shame, and yet for shame to wring;\n\u003cbr\u003e \n\u003cbr\u003e And too soon banish’d from a mother’s petting,\n\u003cbr\u003e \n\u003cbr\u003e To churlish nurture and the wide world’s fretting,\n\u003cbr\u003e \n\u003cbr\u003e For alien pity and unnatural care; —\n\u003cbr\u003e \n\u003cbr\u003e Alas! to see how the cold dew kept wetting\n\u003cbr\u003e \n\u003cbr\u003e His childish coats, and dabbled all his hair,\n\u003cbr\u003e \n\u003cbr\u003e Like gossamers across his forehead fair.”\n\u003cbr\u003e 81.\n\u003cbr\u003e \n\u003cbr\u003e “His pretty pouting mouth, witless of speech,\n\u003cbr\u003e \n\u003cbr\u003e Lay half-way open like a rose-lipp’d shell;\n\u003cbr\u003e \n\u003cbr\u003e And his young cheek was softer than a peach,\n\u003cbr\u003e \n\u003cbr\u003e Whereon his tears, for roundness, could not dwell,\n\u003cbr\u003e \n\u003cbr\u003e But quickly roll’d themselves to pearls, and fell,\n\u003cbr\u003e \n\u003cbr\u003e Some on the grass, and some against his hand,\n\u003cbr\u003e \n\u003cbr\u003e Or haply wander’d to the dimpled well,\n\u003cbr\u003e \n\u003cbr\u003e Which love beside his mouth had sweetly plann’d,\n\u003cbr\u003e \n\u003cbr\u003e Yet not for tears, but mirth and smilings bland.”\n\u003cbr\u003e 82.\n\u003cbr\u003e \n\u003cbr\u003e “Pity it was to see those frequent tears\n\u003cbr\u003e \n\u003cbr\u003e Falling regardless from his friendless eyes;\n\u003cbr\u003e \n\u003cbr\u003e There was such beauty in those twin blue spheres,\n\u003cbr\u003e \n\u003cbr\u003e As any mother’s heart might leap to prize;\n\u003cbr\u003e \n\u003cbr\u003e Blue were they, like the zenith of the skies\n\u003cbr\u003e \n\u003cbr\u003e Softened betwixt two clouds, both clear and mild; —\n\u003cbr\u003e \n\u003cbr\u003e Just touched with thought, and yet not over wise,\n\u003cbr\u003e \n\u003cbr\u003e They show’d the gentle spirit of a child,\n\u003cbr\u003e \n\u003cbr\u003e Not yet by care or any craft defiled.”\n\u003cbr\u003e 83.\n\u003cbr\u003e \n\u003cbr\u003e “Pity it was to see the ardent sun\n\u003cbr\u003e \n\u003cbr\u003e Scorching his helpless limbs — it shone so warm;\n\u003cbr\u003e \n\u003cbr\u003e For kindly shade or shelter he had none,\n\u003cbr\u003e \n\u003cbr\u003e Nor mother’s gentle breast, come fair or storm.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile I bade my pitying mates transform\n\u003cbr\u003e \n\u003cbr\u003e Like grasshoppers, and then, with shrilly cries,\n\u003cbr\u003e \n\u003cbr\u003e All round the infant noisily we swarm,\n\u003cbr\u003e \n\u003cbr\u003e Haply some passing rustic to advise —\n\u003cbr\u003e \n\u003cbr\u003e Whilst providential Heaven our care espies.”\n\u003cbr\u003e 84.\n\u003cbr\u003e \n\u003cbr\u003e “And sends full soon a tender-hearted hind,\n\u003cbr\u003e \n\u003cbr\u003e Who, wond’ring at our loud unusual note,\n\u003cbr\u003e \n\u003cbr\u003e Strays curiously aside, and so doth find\n\u003cbr\u003e \n\u003cbr\u003e The orphan child laid in the grass remote,\n\u003cbr\u003e \n\u003cbr\u003e And laps the foundling in his russet coat,\n\u003cbr\u003e \n\u003cbr\u003e Who thence was nurtured in his kindly cot:—\n\u003cbr\u003e \n\u003cbr\u003e But how he prosper’d let proud London quote,\n\u003cbr\u003e \n\u003cbr\u003e How wise, how rich, and how renown’d he got,\n\u003cbr\u003e \n\u003cbr\u003e And chief of all her citizens, I wot.”\n\u003cbr\u003e 85.\n\u003cbr\u003e \n\u003cbr\u003e “Witness his goodly vessels on the Thames,\n\u003cbr\u003e \n\u003cbr\u003e Whose holds were fraught with costly merchandise —\n\u003cbr\u003e \n\u003cbr\u003e Jewels from Ind, and pearls for courtly dames,\n\u003cbr\u003e \n\u003cbr\u003e And gorgeous silks that Samarcand supplies:\n\u003cbr\u003e \n\u003cbr\u003e Witness that Royal Bourse he bade arise,\n\u003cbr\u003e \n\u003cbr\u003e The mart of merchants from the East and West:\n\u003cbr\u003e \n\u003cbr\u003e Whose slender summit, pointing to the skies,\n\u003cbr\u003e \n\u003cbr\u003e Still bears, in token of his grateful breast,\n\u003cbr\u003e \n\u003cbr\u003e The tender grasshopper, his chosen crest —”\n\u003cbr\u003e 86.\n\u003cbr\u003e \n\u003cbr\u003e “The tender grasshopper, his chosen crest,\n\u003cbr\u003e \n\u003cbr\u003e That all the summer, with a tuneful wing,\n\u003cbr\u003e \n\u003cbr\u003e Makes merry chirpings in its grassy nest,\n\u003cbr\u003e \n\u003cbr\u003e Inspirited with dew to leap and sing:—\n\u003cbr\u003e \n\u003cbr\u003e So let us also live, eternal King!\n\u003cbr\u003e \n\u003cbr\u003e Partakers of the green and pleasant earth:—\n\u003cbr\u003e \n\u003cbr\u003e Pity it is to slay the meanest thing,\n\u003cbr\u003e \n\u003cbr\u003e That, like a mote, shines in the smile of mirth:—\n\u003cbr\u003e \n\u003cbr\u003e Enough there is of joy’s decrease and dearth!”\n\u003cbr\u003e 87.\n\u003cbr\u003e \n\u003cbr\u003e “Enough of pleasure, and delight, and beauty,\n\u003cbr\u003e \n\u003cbr\u003e Perish’d and gone, and hasting to decay; —\n\u003cbr\u003e \n\u003cbr\u003e Enough to sadden even thee, whose duty\n\u003cbr\u003e \n\u003cbr\u003e Or spite it is to havoc and to slay:\n\u003cbr\u003e \n\u003cbr\u003e Too many a lovely race razed quite away,\n\u003cbr\u003e \n\u003cbr\u003e Hath left large gaps in life and human loving; —\n\u003cbr\u003e \n\u003cbr\u003e Here then begin thy cruel war to stay,\n\u003cbr\u003e \n\u003cbr\u003e And spare fresh sighs, and tears, and groans, reproving\n\u003cbr\u003e \n\u003cbr\u003e Thy desolating hand for our removing.”\n\u003cbr\u003e 88.\n\u003cbr\u003e \n\u003cbr\u003e Now here I heard a shrill and sudden cry,\n\u003cbr\u003e \n\u003cbr\u003e And, looking up, I saw the antic Puck\n\u003cbr\u003e \n\u003cbr\u003e Grappling with Time, who clutch’d him like a fly,\n\u003cbr\u003e \n\u003cbr\u003e Victim of his own sport — the jester’s luck!\n\u003cbr\u003e \n\u003cbr\u003e He, whilst his fellows grieved, poor wight, had stuck\n\u003cbr\u003e \n\u003cbr\u003e His freakish gauds upon the Ancient’s brow,\n\u003cbr\u003e \n\u003cbr\u003e And now his ear, and now his beard, would pluck;\n\u003cbr\u003e \n\u003cbr\u003e Whereas the angry churl had snatched him now,\n\u003cbr\u003e \n\u003cbr\u003e Crying, “Thou impish mischief, who art thou?”\n\u003cbr\u003e 89.\n\u003cbr\u003e \n\u003cbr\u003e “Alas!” quoth Puck, “a little random elf,\n\u003cbr\u003e \n\u003cbr\u003e Born in the sport of nature, like a weed,\n\u003cbr\u003e \n\u003cbr\u003e For simple sweet enjoyment of myself,\n\u003cbr\u003e \n\u003cbr\u003e But for no other purpose, worth, or need;\n\u003cbr\u003e \n\u003cbr\u003e And yet withal of a most happy breed;\n\u003cbr\u003e \n\u003cbr\u003e And there is Robin Goodfellow besides,\n\u003cbr\u003e \n\u003cbr\u003e My partner dear in many a prankish deed\n\u003cbr\u003e \n\u003cbr\u003e To make dame Laughter hold her jolly sides,\n\u003cbr\u003e \n\u003cbr\u003e Like merry mummers twain on holy tides.”\n\u003cbr\u003e 90.\n\u003cbr\u003e \n\u003cbr\u003e “’Tis we that bob the angler’s idle cork,\n\u003cbr\u003e \n\u003cbr\u003e Till e’en the patient man breathes half a curse;\n\u003cbr\u003e \n\u003cbr\u003e We steal the morsel from the gossip’s fork,\n\u003cbr\u003e \n\u003cbr\u003e And curdling looks with secret straws disperse,\n\u003cbr\u003e \n\u003cbr\u003e Or stop the sneezing chanter at mid verse:\n\u003cbr\u003e \n\u003cbr\u003e And when an infant’s beauty prospers ill,\n\u003cbr\u003e \n\u003cbr\u003e We change, some mothers say, the child at nurse:\n\u003cbr\u003e \n\u003cbr\u003e But any graver purpose to fulfil,\n\u003cbr\u003e \n\u003cbr\u003e We have not wit enough, and scarce the will.”\n\u003cbr\u003e 91.\n\u003cbr\u003e \n\u003cbr\u003e “We never let the canker melancholy\n\u003cbr\u003e \n\u003cbr\u003e To gather on our faces like a rust,\n\u003cbr\u003e \n\u003cbr\u003e But glass our features with some change of folly,\n\u003cbr\u003e \n\u003cbr\u003e Taking life’s fabled miseries on trust,\n\u003cbr\u003e \n\u003cbr\u003e But only sorrowing when sorrow must:\n\u003cbr\u003e \n\u003cbr\u003e We ruminate no sage’s solemn cud,\n\u003cbr\u003e \n\u003cbr\u003e But own ourselves a pinch of lively dust\n\u003cbr\u003e \n\u003cbr\u003e To frisk upon a wind — whereas the flood\n\u003cbr\u003e \n\u003cbr\u003e Of tears would turn us into heavy mud.”\n\u003cbr\u003e 92.\n\u003cbr\u003e \n\u003cbr\u003e “Beshrew those sad interpreters of nature,\n\u003cbr\u003e \n\u003cbr\u003e Who gloze her lively universal law,\n\u003cbr\u003e \n\u003cbr\u003e As if she had not form’d our cheerful feature\n\u003cbr\u003e \n\u003cbr\u003e To be so tickled with the slightest straw!\n\u003cbr\u003e \n\u003cbr\u003e So let them vex their mumbling mouths, and draw\n\u003cbr\u003e \n\u003cbr\u003e The corners downward, like a wat’ry moon,\n\u003cbr\u003e \n\u003cbr\u003e And deal in gusty sighs and rainy flaw —\n\u003cbr\u003e \n\u003cbr\u003e We will not woo foul weather all too soon,\n\u003cbr\u003e \n\u003cbr\u003e Or nurse November on the lap of June.”\n\u003cbr\u003e 93.\n\u003cbr\u003e \n\u003cbr\u003e “For ours are winging sprites, like any bird,\n\u003cbr\u003e \n\u003cbr\u003e That shun all stagnant settlements of grief;\n\u003cbr\u003e \n\u003cbr\u003e And even in our rest our hearts are stirr’d,\n\u003cbr\u003e \n\u003cbr\u003e Like insects settled on a dancing leaf:—\n\u003cbr\u003e \n\u003cbr\u003e This is our small philosophy in brief,\n\u003cbr\u003e \n\u003cbr\u003e Which thus to teach hath set me all agape:\n\u003cbr\u003e \n\u003cbr\u003e But dost thou relish it? O hoary chief!\n\u003cbr\u003e \n\u003cbr\u003e Unclasp thy crooked fingers from my nape,\n\u003cbr\u003e \n\u003cbr\u003e And I will show thee many a pleasant scrape.”\n\u003cbr\u003e 94.\n\u003cbr\u003e \n\u003cbr\u003e Then Saturn thus:— shaking his crooked blade\n\u003cbr\u003e \n\u003cbr\u003e O’erhead, which made aloft a lightning flash\n\u003cbr\u003e \n\u003cbr\u003e In all the fairies’ eyes, dismally fray’d!\n\u003cbr\u003e \n\u003cbr\u003e His ensuing voice came like the thunder crash —\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the bolt shatters some pine or ash —\n\u003cbr\u003e \n\u003cbr\u003e “Thou feeble, wanton, foolish, fickle thing!\n\u003cbr\u003e \n\u003cbr\u003e Whom nought can frighten, sadden, or abash —\n\u003cbr\u003e \n\u003cbr\u003e To hope my solemn countenance to wring\n\u003cbr\u003e \n\u003cbr\u003e To idiot smiles! — but I will prune thy wing!”\n\u003cbr\u003e 95.\n\u003cbr\u003e \n\u003cbr\u003e “Lo! this most awful handle of my scythe\n\u003cbr\u003e \n\u003cbr\u003e Stood once a May-pole, with a flowery crown,\n\u003cbr\u003e \n\u003cbr\u003e Which rustics danced around, and maidens blithe,\n\u003cbr\u003e \n\u003cbr\u003e To wanton pipings; — but I pluck’d it down,\n\u003cbr\u003e \n\u003cbr\u003e And robed the May Queen in a churchyard gown,\n\u003cbr\u003e \n\u003cbr\u003e Turning her buds to rosemary and rue;\n\u003cbr\u003e \n\u003cbr\u003e And all their merry minstrelsy did drown,\n\u003cbr\u003e \n\u003cbr\u003e And laid each lusty leaper in the dew; —\n\u003cbr\u003e \n\u003cbr\u003e So thou shalt fare — and every jovial crew!”\n\u003cbr\u003e 96.\n\u003cbr\u003e \n\u003cbr\u003e Here he lets go the struggling imp, to clutch.\n\u003cbr\u003e \n\u003cbr\u003e His mortal engine with each grisly hand,\n\u003cbr\u003e \n\u003cbr\u003e Which frights the elfin progeny so much,\n\u003cbr\u003e \n\u003cbr\u003e They huddle in a heap, and trembling stand\n\u003cbr\u003e \n\u003cbr\u003e All round Titania, like the queen bee’s band,\n\u003cbr\u003e \n\u003cbr\u003e With sighs and tears and very shrieks of woe! —\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, some moving argument I plann’d,\n\u003cbr\u003e \n\u003cbr\u003e To make the stern Shade merciful — when lo!\n\u003cbr\u003e \n\u003cbr\u003e He drops his fatal scythe without a blow!\n\u003cbr\u003e 97.\n\u003cbr\u003e \n\u003cbr\u003e For, just at need, a timely Apparition\n\u003cbr\u003e \n\u003cbr\u003e Steps in between, to bear the awful brunt;\n\u003cbr\u003e \n\u003cbr\u003e Making him change his horrible position,\n\u003cbr\u003e \n\u003cbr\u003e To marvel at this comer, brave and blunt,\n\u003cbr\u003e \n\u003cbr\u003e That dares Time’s irresistible affront,\n\u003cbr\u003e \n\u003cbr\u003e Whose strokes have scarr’d even the gods of old; —\n\u003cbr\u003e \n\u003cbr\u003e Whereas this seem’d a mortal, at mere hunt\n\u003cbr\u003e \n\u003cbr\u003e For coneys, lighted by the moonshine cold,\n\u003cbr\u003e \n\u003cbr\u003e Or stalker of stray deer, stealthy and bold.\n\u003cbr\u003e 98.\n\u003cbr\u003e \n\u003cbr\u003e Who, turning to the small assembled fays,\n\u003cbr\u003e \n\u003cbr\u003e Doffs to the lily queen his courteous cap,\n\u003cbr\u003e \n\u003cbr\u003e And holds her beauty for a while in gaze,\n\u003cbr\u003e \n\u003cbr\u003e With bright eyes kindling at this pleasant hap;\n\u003cbr\u003e \n\u003cbr\u003e And thence upon the fair moon’s silver map,\n\u003cbr\u003e \n\u003cbr\u003e As if in question of this magic chance,\n\u003cbr\u003e \n\u003cbr\u003e Laid like a dream upon the green earth’s lap;\n\u003cbr\u003e \n\u003cbr\u003e And then upon old Saturn turns askance,\n\u003cbr\u003e \n\u003cbr\u003e Exclaiming, with a glad and kindly glance:—\n\u003cbr\u003e 99.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, these be Fancy’s revelers by night!\n\u003cbr\u003e \n\u003cbr\u003e Stealthy companions of the downy moth —\n\u003cbr\u003e \n\u003cbr\u003e Diana’s motes, that flit in her pale light,\n\u003cbr\u003e \n\u003cbr\u003e Shunners of sunbeams in diurnal sloth; —\n\u003cbr\u003e \n\u003cbr\u003e These be the feasters on night’s silver cloth; —\n\u003cbr\u003e \n\u003cbr\u003e The gnat with shrilly trump is their convener,\n\u003cbr\u003e \n\u003cbr\u003e Forth from their flowery chambers, nothing loth,\n\u003cbr\u003e \n\u003cbr\u003e With lulling tunes to charm the air serener,\n\u003cbr\u003e \n\u003cbr\u003e Or dance upon the grass to make it greener.”\n\u003cbr\u003e 100.\n\u003cbr\u003e \n\u003cbr\u003e “These be the pretty genii of the flow’rs,\n\u003cbr\u003e \n\u003cbr\u003e Daintily fed with honey and pure dew —\n\u003cbr\u003e \n\u003cbr\u003e Midsummer’s phantoms in her dreaming hours,\n\u003cbr\u003e \n\u003cbr\u003e King Oberon, and all his merry crew,\n\u003cbr\u003e \n\u003cbr\u003e The darling puppets of romance’s view;\n\u003cbr\u003e \n\u003cbr\u003e Fairies, and sprites, and goblin elves we call them,\n\u003cbr\u003e \n\u003cbr\u003e Famous for patronage of lovers true; —\n\u003cbr\u003e \n\u003cbr\u003e No harm they act, neither shall harm befall them,\n\u003cbr\u003e \n\u003cbr\u003e So do not thus with crabbed frowns appal them.”\n\u003cbr\u003e 101.\n\u003cbr\u003e \n\u003cbr\u003e O what a cry was Saturn’s then! — it made\n\u003cbr\u003e \n\u003cbr\u003e The fairies quake. “What care I for their pranks,\n\u003cbr\u003e \n\u003cbr\u003e However they may lovers choose to aid,\n\u003cbr\u003e \n\u003cbr\u003e Or dance their roundelays on flow’ry banks? —\n\u003cbr\u003e \n\u003cbr\u003e Long must they dance before they earn my thanks —\n\u003cbr\u003e \n\u003cbr\u003e So step aside, to some far safer spot,\n\u003cbr\u003e \n\u003cbr\u003e Whilst with my hungry scythe I mow their ranks,\n\u003cbr\u003e \n\u003cbr\u003e And leave them in the sun, like weeds, to rot,\n\u003cbr\u003e \n\u003cbr\u003e And with the next day’s sun to be forgot.”\n\u003cbr\u003e 102.\n\u003cbr\u003e \n\u003cbr\u003e Anon, he raised afresh his weapon keen;\n\u003cbr\u003e \n\u003cbr\u003e But still the gracious Shade disarm’d his aim,\n\u003cbr\u003e \n\u003cbr\u003e Stepping with brave alacrity between,\n\u003cbr\u003e \n\u003cbr\u003e And made his sore arm powerless and tame.\n\u003cbr\u003e \n\u003cbr\u003e His be perpetual glory, for the shame\n\u003cbr\u003e \n\u003cbr\u003e Of hoary Saturn in that grand defeat! —\n\u003cbr\u003e \n\u003cbr\u003e But I must tell how here Titania, came\n\u003cbr\u003e \n\u003cbr\u003e With all her kneeling lieges, to entreat\n\u003cbr\u003e \n\u003cbr\u003e His kindly succor, in sad tones, but sweet.\n\u003cbr\u003e 103.\n\u003cbr\u003e \n\u003cbr\u003e Saying, “Thou seest a wretched queen before thee,\n\u003cbr\u003e \n\u003cbr\u003e The fading power of a failing land,\n\u003cbr\u003e \n\u003cbr\u003e Who for a kingdom kneeleth to implore thee,\n\u003cbr\u003e \n\u003cbr\u003e Now menaced by this tyrant’s spoiling hand;\n\u003cbr\u003e \n\u003cbr\u003e No one but thee can hopefully withstand\n\u003cbr\u003e \n\u003cbr\u003e That crooked blade, he longeth so to lift.\n\u003cbr\u003e \n\u003cbr\u003e I pray thee blind him with his own vile sand,\n\u003cbr\u003e \n\u003cbr\u003e Which only times all ruins by its drift,\n\u003cbr\u003e \n\u003cbr\u003e Or prune his eagle wings that are so swift.”\n\u003cbr\u003e 104.\n\u003cbr\u003e \n\u003cbr\u003e “Or take him by that sole and grizzled tuft,\n\u003cbr\u003e \n\u003cbr\u003e That hangs upon his bald and barren crown;\n\u003cbr\u003e \n\u003cbr\u003e And we will sing to see him so rebuff’d,\n\u003cbr\u003e \n\u003cbr\u003e And lend our little mights to pull him down,\n\u003cbr\u003e \n\u003cbr\u003e And make brave sport of his malicious frown,\n\u003cbr\u003e \n\u003cbr\u003e For all his boastful mockery o’er men.\n\u003cbr\u003e \n\u003cbr\u003e For thou wast born, I know, for this renown,\n\u003cbr\u003e \n\u003cbr\u003e By my most magical and inward ken,\n\u003cbr\u003e \n\u003cbr\u003e That readeth ev’n at Fate’s forestalling pen.”\n\u003cbr\u003e 105.\n\u003cbr\u003e \n\u003cbr\u003e “Nay, by the golden lustre of thine eye,\n\u003cbr\u003e \n\u003cbr\u003e And by thy brow’s most fair and ample span,\n\u003cbr\u003e \n\u003cbr\u003e Thought’s glorious palace, framed for fancies high,\n\u003cbr\u003e \n\u003cbr\u003e And by thy cheek thus passionately wan,\n\u003cbr\u003e \n\u003cbr\u003e I know the signs of an immortal man —\n\u003cbr\u003e \n\u003cbr\u003e Nature’s chief darling, and illustrious mate,\n\u003cbr\u003e \n\u003cbr\u003e Destined to foil old Death’s oblivious plan,\n\u003cbr\u003e \n\u003cbr\u003e And shine untarnish’d by the fogs of Fate,\n\u003cbr\u003e \n\u003cbr\u003e Time’s famous rival till the final date!”\n\u003cbr\u003e 106.\n\u003cbr\u003e \n\u003cbr\u003e “O shield us then from this usurping Time,\n\u003cbr\u003e \n\u003cbr\u003e And we will visit thee in moonlight dreams;\n\u003cbr\u003e \n\u003cbr\u003e And teach thee tunes, to wed unto thy rhyme,\n\u003cbr\u003e \n\u003cbr\u003e And dance about thee in all midnight gleams,\n\u003cbr\u003e \n\u003cbr\u003e Giving thee glimpses of our magic schemes,\n\u003cbr\u003e \n\u003cbr\u003e Such as no mortal’s eye hath ever seen;\n\u003cbr\u003e \n\u003cbr\u003e And, for thy love to us in our extremes,\n\u003cbr\u003e \n\u003cbr\u003e Will ever keep thy chaplet fresh and green,\n\u003cbr\u003e \n\u003cbr\u003e Such as no poet’s wreath hath ever been!”\n\u003cbr\u003e 107.\n\u003cbr\u003e \n\u003cbr\u003e “And we’ll distil thee aromatic dews,\n\u003cbr\u003e \n\u003cbr\u003e To charm thy sense, when there shall be no flow’rs;\n\u003cbr\u003e \n\u003cbr\u003e And flavor’d syrups in thy drinks infuse,\n\u003cbr\u003e \n\u003cbr\u003e And teach the nightingale to haunt thy bow’rs,\n\u003cbr\u003e \n\u003cbr\u003e And with our games divert thy weariest hours,\n\u003cbr\u003e \n\u003cbr\u003e With all that elfin wits can e’er devise.\n\u003cbr\u003e \n\u003cbr\u003e And, this churl dead, there’ll be no hasting hours\n\u003cbr\u003e \n\u003cbr\u003e To rob thee of thy joys, as now joy flies”:—\n\u003cbr\u003e \n\u003cbr\u003e Here she was stopp’d by Saturn’s furious cries.\n\u003cbr\u003e 108.\n\u003cbr\u003e \n\u003cbr\u003e Whom, therefore, the kind Shade rebukes anew,\n\u003cbr\u003e \n\u003cbr\u003e Saying, “Thou haggard Sin, go forth, and scoop\n\u003cbr\u003e \n\u003cbr\u003e Thy hollow coffin in some churchyard yew,\n\u003cbr\u003e \n\u003cbr\u003e Or make th’ autumnal flow’rs turn pale, and droop;\n\u003cbr\u003e \n\u003cbr\u003e Or fell the bearded corn, till gleaners stoop\n\u003cbr\u003e \n\u003cbr\u003e Under fat sheaves — or blast the piny grove; —\n\u003cbr\u003e \n\u003cbr\u003e But here thou shall not harm this pretty group,\n\u003cbr\u003e \n\u003cbr\u003e Whose lives are not so frail and feebly wove,\n\u003cbr\u003e \n\u003cbr\u003e But leased on Nature’s loveliness and love.”\n\u003cbr\u003e 109.\n\u003cbr\u003e \n\u003cbr\u003e “’Tis these that free the small entangled fly,\n\u003cbr\u003e \n\u003cbr\u003e Caught in the venom’d spider’s crafty snare; —\n\u003cbr\u003e \n\u003cbr\u003e These be the petty surgeons that apply\n\u003cbr\u003e \n\u003cbr\u003e The healing balsams to the wounded hare,\n\u003cbr\u003e \n\u003cbr\u003e Bedded in bloody fern, no creature’s care! —\n\u003cbr\u003e \n\u003cbr\u003e These be providers for the orphan brood,\n\u003cbr\u003e \n\u003cbr\u003e Whose tender mother hath been slain in air,\n\u003cbr\u003e \n\u003cbr\u003e Quitting with gaping bill her darling’s food,\n\u003cbr\u003e \n\u003cbr\u003e Hard by the verge of her domestic wood.”\n\u003cbr\u003e 110.\n\u003cbr\u003e \n\u003cbr\u003e “’Tis these befriend the timid trembling stag,\n\u003cbr\u003e \n\u003cbr\u003e When, with a bursting heart beset with fears,\n\u003cbr\u003e \n\u003cbr\u003e He feels his saving speed begin to flag;\n\u003cbr\u003e \n\u003cbr\u003e For then they quench the fatal taint with tears,\n\u003cbr\u003e \n\u003cbr\u003e And prompt fresh shifts in his alarum’d ears,\n\u003cbr\u003e \n\u003cbr\u003e So piteously they view all bloody morts;\n\u003cbr\u003e \n\u003cbr\u003e Or if the gunner, with his arms, appears,\n\u003cbr\u003e \n\u003cbr\u003e Like noisy pyes and jays, with harsh reports,\n\u003cbr\u003e \n\u003cbr\u003e They warn the wild fowl of his deadly sports.”\n\u003cbr\u003e 111.\n\u003cbr\u003e \n\u003cbr\u003e “For these are kindly ministers of nature,\n\u003cbr\u003e \n\u003cbr\u003e To soothe all covert hurts and dumb distress;\n\u003cbr\u003e \n\u003cbr\u003e Pretty they be, and very small of stature —\n\u003cbr\u003e \n\u003cbr\u003e For mercy still consorts with littleness; —\n\u003cbr\u003e \n\u003cbr\u003e Wherefore the sum of good is still the less,\n\u003cbr\u003e \n\u003cbr\u003e And mischief grossest in this world of wrong; —\n\u003cbr\u003e \n\u003cbr\u003e So do these charitable dwarfs redress\n\u003cbr\u003e \n\u003cbr\u003e The tenfold ravages of giants strong,\n\u003cbr\u003e \n\u003cbr\u003e To whom great malice and great might belong.”\n\u003cbr\u003e 112.\n\u003cbr\u003e \n\u003cbr\u003e “Likewise to them are Poets much beholden\n\u003cbr\u003e \n\u003cbr\u003e For secret favors in the midnight glooms;\n\u003cbr\u003e \n\u003cbr\u003e Brave Spenser quaff’d out of their goblets golden,\n\u003cbr\u003e \n\u003cbr\u003e And saw their tables spread of prompt mushrooms,\n\u003cbr\u003e \n\u003cbr\u003e And heard their horns of honeysuckle blooms\n\u003cbr\u003e \n\u003cbr\u003e Sounding upon the air most soothing soft,\n\u003cbr\u003e \n\u003cbr\u003e Like humming bees busy about the brooms —\n\u003cbr\u003e \n\u003cbr\u003e And glanced this fair queen’s witchery full oft,\n\u003cbr\u003e \n\u003cbr\u003e And in her magic wain soar’d far aloft.”\n\u003cbr\u003e 113.\n\u003cbr\u003e \n\u003cbr\u003e “Nay I myself, though mortal, once was nursed\n\u003cbr\u003e \n\u003cbr\u003e By fairy gossips, friendly at my birth,\n\u003cbr\u003e \n\u003cbr\u003e And in my childish ear glib Mab rehearsed\n\u003cbr\u003e \n\u003cbr\u003e Her breezy travels round our planet’s girth,\n\u003cbr\u003e \n\u003cbr\u003e Telling me wonders of the moon and earth;\n\u003cbr\u003e \n\u003cbr\u003e My gramarye at her grave lap I conn’d,\n\u003cbr\u003e \n\u003cbr\u003e Where Puck hath been convened to make me mirth;\n\u003cbr\u003e \n\u003cbr\u003e I have had from Queen Titania tokens fond,\n\u003cbr\u003e \n\u003cbr\u003e And toy’d with Oberon’s permitted wand.”\n\u003cbr\u003e 114.\n\u003cbr\u003e \n\u003cbr\u003e “With figs and plums and Persian dates they fed me,\n\u003cbr\u003e \n\u003cbr\u003e And delicate cates after my sunset meal,\n\u003cbr\u003e \n\u003cbr\u003e And took me by my childish hand, and led me\n\u003cbr\u003e \n\u003cbr\u003e By craggy rocks crested with keeps of steel,\n\u003cbr\u003e \n\u003cbr\u003e Whose awful bases deep dark woods conceal,\n\u003cbr\u003e \n\u003cbr\u003e Staining some dead lake with their verdant dyes.\n\u003cbr\u003e \n\u003cbr\u003e And when the West sparkled at Phoebus’ wheel,\n\u003cbr\u003e \n\u003cbr\u003e With fairy euphrasy they purged mine eyes,\n\u003cbr\u003e \n\u003cbr\u003e To let me see their cities in the skies.”\n\u003cbr\u003e 115.\n\u003cbr\u003e \n\u003cbr\u003e “’Twas they first school’d my young imagination\n\u003cbr\u003e \n\u003cbr\u003e To take its flights like any new-fledged bird,\n\u003cbr\u003e \n\u003cbr\u003e And show’d the span of winged meditation\n\u003cbr\u003e \n\u003cbr\u003e Stretch’d wider than things grossly seen or heard.\n\u003cbr\u003e \n\u003cbr\u003e With sweet swift Ariel how I soar’d and stirr’d\n\u003cbr\u003e \n\u003cbr\u003e The fragrant blooms of spiritual bow’rs!\n\u003cbr\u003e \n\u003cbr\u003e ’Twas they endear’d what I have still preferr’d,\n\u003cbr\u003e \n\u003cbr\u003e Nature’s blest attributes and balmy pow’rs,\n\u003cbr\u003e \n\u003cbr\u003e Her hills and vales and brooks, sweet birds and flow’rs.”\n\u003cbr\u003e 116.\n\u003cbr\u003e \n\u003cbr\u003e “Wherefore with all true loyalty and duty\n\u003cbr\u003e \n\u003cbr\u003e Will I regard them in my honoring rhyme,\n\u003cbr\u003e \n\u003cbr\u003e With love for love, and homages to beauty,\n\u003cbr\u003e \n\u003cbr\u003e And magic thoughts gather’d in night’s cool clime,\n\u003cbr\u003e \n\u003cbr\u003e With studious verse trancing the dragon Time,\n\u003cbr\u003e \n\u003cbr\u003e Strong as old Merlin’s necromantic spells;\n\u003cbr\u003e \n\u003cbr\u003e So these dear monarchs of the summer’s prime\n\u003cbr\u003e \n\u003cbr\u003e Shall live unstartled by his dreadful yells,\n\u003cbr\u003e \n\u003cbr\u003e Till shrill larks warn them to their flowery cells.”\n\u003cbr\u003e 117.\n\u003cbr\u003e \n\u003cbr\u003e Look how a poison’d man turns livid black,\n\u003cbr\u003e \n\u003cbr\u003e Drugg’d with a cup of deadly hellebore,\n\u003cbr\u003e \n\u003cbr\u003e That sets his horrid features all at rack —\n\u003cbr\u003e \n\u003cbr\u003e So seem’d these words into the ear to pour\n\u003cbr\u003e \n\u003cbr\u003e Of ghastly Saturn, answering with a roar\n\u003cbr\u003e \n\u003cbr\u003e Of mortal pain and spite and utmost rage,\n\u003cbr\u003e \n\u003cbr\u003e Wherewith his grisly arm he raised once more,\n\u003cbr\u003e \n\u003cbr\u003e And bade the cluster’d sinews all engage,\n\u003cbr\u003e \n\u003cbr\u003e As if at one fell stroke to wreck an age.\n\u003cbr\u003e 118.\n\u003cbr\u003e \n\u003cbr\u003e Whereas the blade flash’d on the dinted ground,\n\u003cbr\u003e \n\u003cbr\u003e Down through his steadfast foe, yet made no scar\n\u003cbr\u003e \n\u003cbr\u003e On that immortal Shade, or death-like wound;\n\u003cbr\u003e \n\u003cbr\u003e But Time was long benumb’d, and stood ajar,\n\u003cbr\u003e \n\u003cbr\u003e And then with baffled rage took flight afar,\n\u003cbr\u003e \n\u003cbr\u003e To weep his hurt in some Cimmerian gloom,\n\u003cbr\u003e \n\u003cbr\u003e Or meaner fames (like mine) to mock and mar,\n\u003cbr\u003e \n\u003cbr\u003e Or sharp his scythe for royal strokes of doom,\n\u003cbr\u003e \n\u003cbr\u003e Whetting its edge on some old C?sar’s tomb.\n\u003cbr\u003e 119.\n\u003cbr\u003e \n\u003cbr\u003e Howbeit he vanish’d in the forest shade,\n\u003cbr\u003e \n\u003cbr\u003e Distantly heard as if some grumbling pard,\n\u003cbr\u003e \n\u003cbr\u003e And, like Nymph Echo, to a sound decay’d; —\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the fays cluster’d the gracious Bard,\n\u003cbr\u003e \n\u003cbr\u003e The darling centre of their dear regard:\n\u003cbr\u003e \n\u003cbr\u003e Besides of sundry dances on the green,\n\u003cbr\u003e \n\u003cbr\u003e Never was mortal man so brightly starr’d,\n\u003cbr\u003e \n\u003cbr\u003e Or won such pretty homages, I ween.\n\u003cbr\u003e \n\u003cbr\u003e “Nod to him, Elves!” cries the melodious queen.\n\u003cbr\u003e 120.\n\u003cbr\u003e \n\u003cbr\u003e “Nod to him, Elves, and flutter round about him,\n\u003cbr\u003e \n\u003cbr\u003e And quite enclose him with your pretty crowd,\n\u003cbr\u003e \n\u003cbr\u003e And touch him lovingly, for that, without him,\n\u003cbr\u003e \n\u003cbr\u003e The silkworm now had spun our dreary shroud; —\n\u003cbr\u003e \n\u003cbr\u003e But he hath all dispersed Death’s tearful cloud,\n\u003cbr\u003e \n\u003cbr\u003e And Time’s dread effigy scared quite away:\n\u003cbr\u003e \n\u003cbr\u003e Bow to him then, as though to me ye bow’d,\n\u003cbr\u003e \n\u003cbr\u003e And his dear wishes prosper and obey\n\u003cbr\u003e \n\u003cbr\u003e Wherever love and wit can find a way!”\n\u003cbr\u003e 121.\n\u003cbr\u003e \n\u003cbr\u003e “‘Noint him with fairy dews of magic savors,\n\u003cbr\u003e \n\u003cbr\u003e Shaken from orient buds still pearly wet,\n\u003cbr\u003e \n\u003cbr\u003e Roses and spicy pinks — and, of all favors,\n\u003cbr\u003e \n\u003cbr\u003e Plant in his walks the purple violet,\n\u003cbr\u003e \n\u003cbr\u003e And meadow-sweet under the hedges set,\n\u003cbr\u003e \n\u003cbr\u003e To mingle breaths with dainty eglantine\n\u003cbr\u003e \n\u003cbr\u003e And honeysuckles sweet — nor yet forget\n\u003cbr\u003e \n\u003cbr\u003e Some pastoral flowery chaplets to entwine,\n\u003cbr\u003e \n\u003cbr\u003e To vie the thoughts about his brow benign!”\n\u003cbr\u003e 122.\n\u003cbr\u003e \n\u003cbr\u003e “Let no wild things astonish him or fear him,\n\u003cbr\u003e \n\u003cbr\u003e But tell them all how mild he is of heart,\n\u003cbr\u003e \n\u003cbr\u003e Till e’en the timid hares go frankly near him,\n\u003cbr\u003e \n\u003cbr\u003e And eke the dappled does, yet never start;\n\u003cbr\u003e \n\u003cbr\u003e Nor shall their fawns into the thickets dart,\n\u003cbr\u003e \n\u003cbr\u003e Nor wrens forsake their nests among the leaves,\n\u003cbr\u003e \n\u003cbr\u003e Nor speckled thrushes flutter far apart; —\n\u003cbr\u003e \n\u003cbr\u003e But bid the sacred swallow haunt his eaves,\n\u003cbr\u003e \n\u003cbr\u003e To guard his roof from lightning and from thieves.”\n\u003cbr\u003e 123.\n\u003cbr\u003e \n\u003cbr\u003e “Or when he goes the nimble squirrel’s visitor,\n\u003cbr\u003e \n\u003cbr\u003e Let the brown hermit bring his hoarded nuts,\n\u003cbr\u003e \n\u003cbr\u003e For, tell him, this is Nature’s kind Inquisitor —\n\u003cbr\u003e \n\u003cbr\u003e Though man keeps cautious doors that conscience shuts,\n\u003cbr\u003e \n\u003cbr\u003e For conscious wrong all curious quest rebuts —\n\u003cbr\u003e \n\u003cbr\u003e Nor yet shall bees uncase their jealous stings,\n\u003cbr\u003e \n\u003cbr\u003e However he may watch their straw-built huts; —\n\u003cbr\u003e \n\u003cbr\u003e So let him learn the crafts of all small things,\n\u003cbr\u003e \n\u003cbr\u003e Which he will hint most aptly when he sings.”\n\u003cbr\u003e 124.\n\u003cbr\u003e \n\u003cbr\u003e Here she leaves off, and with a graceful hand\n\u003cbr\u003e \n\u003cbr\u003e Waves thrice three splendid circles round his head;\n\u003cbr\u003e \n\u003cbr\u003e Which, though deserted by the radiant wand,\n\u003cbr\u003e \n\u003cbr\u003e Wears still the glory which her waving shed,\n\u003cbr\u003e \n\u003cbr\u003e Such as erst crown’d the old Apostle’s head,\n\u003cbr\u003e \n\u003cbr\u003e To show the thoughts there harbor’d were divine,\n\u003cbr\u003e \n\u003cbr\u003e And on immortal contemplations fed:—\n\u003cbr\u003e \n\u003cbr\u003e Goodly it was to see that glory shine\n\u003cbr\u003e \n\u003cbr\u003e Around a brow so lofty and benign! —\n\u003cbr\u003e 125.\n\u003cbr\u003e \n\u003cbr\u003e Goodly it was to see the elfin brood\n\u003cbr\u003e \n\u003cbr\u003e Contend for kisses of his gentle hand,\n\u003cbr\u003e \n\u003cbr\u003e That had their mortal enemy withstood,\n\u003cbr\u003e \n\u003cbr\u003e And stay’d their lives, fast ebbing with the sand.\n\u003cbr\u003e \n\u003cbr\u003e Long while this strife engaged the pretty band;\n\u003cbr\u003e \n\u003cbr\u003e But now bold Chanticleer, from farm to farm,\n\u003cbr\u003e \n\u003cbr\u003e Challenged the dawn creeping o’er eastern land,\n\u003cbr\u003e \n\u003cbr\u003e And well the fairies knew that shrill alarm,\n\u003cbr\u003e \n\u003cbr\u003e Which sounds the knell of every elfish charm.\n\u003cbr\u003e 126.\n\u003cbr\u003e \n\u003cbr\u003e And soon the rolling mist, that ‘gan arise\n\u003cbr\u003e \n\u003cbr\u003e From plashy mead and undiscover’d stream,\n\u003cbr\u003e \n\u003cbr\u003e Earth’s morning incense to the early skies,\n\u003cbr\u003e \n\u003cbr\u003e Crept o’er the failing landscape of my dream.\n\u003cbr\u003e \n\u003cbr\u003e Soon faded then the Phantom of my theme —\n\u003cbr\u003e \n\u003cbr\u003e A shapeless shade, that fancy disavowed,\n\u003cbr\u003e \n\u003cbr\u003e And shrank to nothing in the mist extreme,\n\u003cbr\u003e \n\u003cbr\u003e Then flew Titania — and her little crowd,\n\u003cbr\u003e \n\u003cbr\u003e Like flocking linnets, vanished in a cloud.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/36827.html","bookId":111,"creation":"Aug 1, 2019 4:02:01 AM","modification":"Aug 1, 2019 4:02:01 AM"}
