{"id":2637,"no":6,"title":"Lycus the Centaur.","content":"From an Unrolled Manuscript of Apollonius Curius.\n\u003cbr\u003e The Argument.\n\u003cbr\u003e \n\u003cbr\u003e Lycus, detained by Circe in her magical dominion, is beloved by a Water Nymph, who, desiring to render him immortal, has recourse to the Sorceress. Circe gives her an incantation to pronounce, which should turn Lycus into a horse; but the horrible effect of the charm causing her to break off in the midst, he becomes a Centaur.\n\u003cbr\u003e \n\u003cbr\u003e Who hath ever been lured and bound by a spell\n\u003cbr\u003e \n\u003cbr\u003e To wander, fore-doomed, in that circle of hell\n\u003cbr\u003e \n\u003cbr\u003e Where Witchery works with her will like a god,\n\u003cbr\u003e \n\u003cbr\u003e Works more than the wonders of time at a nod —\n\u003cbr\u003e \n\u003cbr\u003e At a word — at a touch — at a flash of the eye,\n\u003cbr\u003e \n\u003cbr\u003e But each form is a cheat, and each sound is a lie,\n\u003cbr\u003e \n\u003cbr\u003e Things born of a wish — to endure for a thought,\n\u003cbr\u003e \n\u003cbr\u003e Or last for long ages — to vanish to nought,\n\u003cbr\u003e \n\u003cbr\u003e Or put on new semblance? O Jove, I had given\n\u003cbr\u003e \n\u003cbr\u003e The throne of a kingdom to know if that heaven,\n\u003cbr\u003e \n\u003cbr\u003e And the earth and its streams were of Circe, or whether\n\u003cbr\u003e \n\u003cbr\u003e They kept the world’s birthday and brighten’d together!\n\u003cbr\u003e \n\u003cbr\u003e For I loved them in terror, and constantly dreaded\n\u003cbr\u003e \n\u003cbr\u003e That the earth where I trod, and the cave where I bedded,\n\u003cbr\u003e \n\u003cbr\u003e The face I might dote on, should live out the lease\n\u003cbr\u003e \n\u003cbr\u003e Of the charm that created, and suddenly cease:\n\u003cbr\u003e \n\u003cbr\u003e And I gave me to slumber, as if from one dream\n\u003cbr\u003e \n\u003cbr\u003e To another — each horrid — and drank of the stream\n\u003cbr\u003e \n\u003cbr\u003e Like a first taste of blood, lest as water I quaff’d\n\u003cbr\u003e \n\u003cbr\u003e Swift poison, and never should breathe from the draught —\n\u003cbr\u003e \n\u003cbr\u003e Such drink as her own monarch husband drain’d up\n\u003cbr\u003e \n\u003cbr\u003e When he pledged her, and Fate closed his eyes in the cup.\n\u003cbr\u003e \n\u003cbr\u003e And I pluck’d of the fruit with held breath, and a fear\n\u003cbr\u003e \n\u003cbr\u003e That the branch would start back and scream out in my ear;\n\u003cbr\u003e \n\u003cbr\u003e For once, at my suppering, I plucked in the dusk\n\u003cbr\u003e \n\u003cbr\u003e An apple, juice-gushing and fragrant of musk;\n\u003cbr\u003e \n\u003cbr\u003e But by daylight my fingers were crimson’d with gore,\n\u003cbr\u003e \n\u003cbr\u003e And the half-eaten fragment was flesh at the core;\n\u003cbr\u003e \n\u003cbr\u003e And once — only once — for the love of its blush,\n\u003cbr\u003e \n\u003cbr\u003e I broke a bloom bough, but there came such a gush\n\u003cbr\u003e \n\u003cbr\u003e On my hand, that it fainted away in weak fright,\n\u003cbr\u003e \n\u003cbr\u003e While the leaf-hidden woodpecker shriek’d at the sight;\n\u003cbr\u003e \n\u003cbr\u003e And oh! such an agony thrill’d in that note,\n\u003cbr\u003e \n\u003cbr\u003e That my soul, startling up, beat its wings in my throat,\n\u003cbr\u003e \n\u003cbr\u003e As it long’d to be free of a body whose hand\n\u003cbr\u003e \n\u003cbr\u003e Was doom’d to work torments a Fury had plann’d!\n\u003cbr\u003e \n\u003cbr\u003e There I stood without stir, yet how willing to flee,\n\u003cbr\u003e \n\u003cbr\u003e As if rooted and horror-turn’d into a tree —\n\u003cbr\u003e \n\u003cbr\u003e Oh! for innocent death — and to suddenly win it,\n\u003cbr\u003e \n\u003cbr\u003e I drank of the stream, but no poison was in it;\n\u003cbr\u003e \n\u003cbr\u003e I plunged in its waters, but ere I could sink,\n\u003cbr\u003e \n\u003cbr\u003e Some invisible fate pull’d me back to the brink;\n\u003cbr\u003e \n\u003cbr\u003e I sprang from the rock, from its pinnacle height,\n\u003cbr\u003e \n\u003cbr\u003e But fell on the grass with a grasshopper’s flight;\n\u003cbr\u003e \n\u003cbr\u003e I ran at my fears — they were fears and no more,\n\u003cbr\u003e \n\u003cbr\u003e For the bear would not mangle my limbs, nor the boar,\n\u003cbr\u003e \n\u003cbr\u003e But moan’d — all their brutalized flesh could not smother\n\u003cbr\u003e \n\u003cbr\u003e The horrible truth — we were kin to each other!\n\u003cbr\u003e \n\u003cbr\u003e They were mournfully gentle, and group’d for relief,\n\u003cbr\u003e \n\u003cbr\u003e All foes in their skin, but all friends in their grief:\n\u003cbr\u003e \n\u003cbr\u003e The leopard was there — baby-mild in its feature;\n\u003cbr\u003e \n\u003cbr\u003e And the tiger, black-barr’d, with the gaze of a creature\n\u003cbr\u003e \n\u003cbr\u003e That knew gentle pity; the bristle-back’d boar,\n\u003cbr\u003e \n\u003cbr\u003e His innocent tusks stain’d with mulberry gore;\n\u003cbr\u003e \n\u003cbr\u003e And the laughing hyena — but laughing no more;\n\u003cbr\u003e \n\u003cbr\u003e And the snake, not with magical orbs to devise\n\u003cbr\u003e \n\u003cbr\u003e Strange death, but with woman’s attraction of eyes;\n\u003cbr\u003e \n\u003cbr\u003e The tall ugly ape, that still bore a dim shine\n\u003cbr\u003e \n\u003cbr\u003e Through his hairy eclipse of a manhood divine;\n\u003cbr\u003e \n\u003cbr\u003e And the elephant stately, with more than its reason,\n\u003cbr\u003e \n\u003cbr\u003e How thoughtful in sadness! but this is no season\n\u003cbr\u003e \n\u003cbr\u003e To reckon them up from the lag-bellied toad\n\u003cbr\u003e \n\u003cbr\u003e To the mammoth, whose sobs shook his ponderous load.\n\u003cbr\u003e \n\u003cbr\u003e There were woes of all shapes, wretched forms, when I came,\n\u003cbr\u003e \n\u003cbr\u003e That hung down their heads with a human-like shame;\n\u003cbr\u003e \n\u003cbr\u003e The elephant hid in the boughs, and the bear\n\u003cbr\u003e \n\u003cbr\u003e Shed over his eyes the dark veil of his hair;\n\u003cbr\u003e \n\u003cbr\u003e And the womanly soul turning sick with disgust,\n\u003cbr\u003e \n\u003cbr\u003e Tried to vomit herself from her serpentine crust;\n\u003cbr\u003e \n\u003cbr\u003e While all groan’d their groans into one at their lot,\n\u003cbr\u003e \n\u003cbr\u003e As I brought them the image of what they were not.\n\u003cbr\u003e \n\u003cbr\u003e Then rose a wild sound of the human voice choking\n\u003cbr\u003e \n\u003cbr\u003e Through vile brutal organs — low tremulous croaking:\n\u003cbr\u003e \n\u003cbr\u003e Cries swallow’d abruptly — deep animal tones\n\u003cbr\u003e \n\u003cbr\u003e Attuned to strange passion, and full-utter’d groans;\n\u003cbr\u003e \n\u003cbr\u003e All shuddering weaken, till hush’d in a pause\n\u003cbr\u003e \n\u003cbr\u003e Of tongues in mute motion and wide-yawning jaws;\n\u003cbr\u003e \n\u003cbr\u003e And I guessed that those horrors were meant to tell o’er\n\u003cbr\u003e \n\u003cbr\u003e The tale of their woes; but the silence told more,\n\u003cbr\u003e \n\u003cbr\u003e That writhed on their tongues; and I knelt on the sod,\n\u003cbr\u003e \n\u003cbr\u003e And pray’d with my voice to the cloud-stirring god,\n\u003cbr\u003e \n\u003cbr\u003e For the sad congregation of supplicants there,\n\u003cbr\u003e \n\u003cbr\u003e That upturn’d to his heaven brute faces of prayer;\n\u003cbr\u003e \n\u003cbr\u003e And I ceased, and they utter’d a moaning so deep,\n\u003cbr\u003e \n\u003cbr\u003e That I wept for my heart-ease — but they could not weep,\n\u003cbr\u003e \n\u003cbr\u003e And gazed with red eyeballs, all wistfully dry,\n\u003cbr\u003e \n\u003cbr\u003e At the comfort of tears in a stag’s human eye.\n\u003cbr\u003e \n\u003cbr\u003e Then I motion’d them round, and, to soothe their distress,\n\u003cbr\u003e \n\u003cbr\u003e I caress’d, and they bent them to meet my caress,\n\u003cbr\u003e \n\u003cbr\u003e Their necks to my arm, and their heads to my palm,\n\u003cbr\u003e \n\u003cbr\u003e And with poor grateful eyes suffer’d meekly and calm\n\u003cbr\u003e \n\u003cbr\u003e Those tokens of kindness, withheld by hard fate\n\u003cbr\u003e \n\u003cbr\u003e From returns that might chill the warm pity to hate;\n\u003cbr\u003e \n\u003cbr\u003e So they passively bow’d — save the serpent, that leapt\n\u003cbr\u003e \n\u003cbr\u003e To my breast like a sister, and pressingly crept\n\u003cbr\u003e \n\u003cbr\u003e In embrace of my neck, and with close kisses blister’d\n\u003cbr\u003e \n\u003cbr\u003e My lips in rash love — then drew backward, and glister’d\n\u003cbr\u003e \n\u003cbr\u003e Her eyes in my face, and loud hissing affright,\n\u003cbr\u003e \n\u003cbr\u003e Dropt down, but swift started away from my sight!\n\u003cbr\u003e \n\u003cbr\u003e This sorrow was theirs, but thrice wretched my lot,\n\u003cbr\u003e \n\u003cbr\u003e Turn’d brute in my soul, though my body was not,\n\u003cbr\u003e \n\u003cbr\u003e When I fled from the sorrow of womanly faces,\n\u003cbr\u003e \n\u003cbr\u003e That shrouded their woe in the shade of lone places,\n\u003cbr\u003e \n\u003cbr\u003e And dash’d off bright tears, till their fingers were wet,\n\u003cbr\u003e \n\u003cbr\u003e And then wiped their lids with long tresses of jet:\n\u003cbr\u003e \n\u003cbr\u003e But I fled — though they stretch’d out their hands, all entangled\n\u003cbr\u003e \n\u003cbr\u003e With hair, and blood-stain’d of the breasts they had mangled —\n\u003cbr\u003e \n\u003cbr\u003e Though they call’d — and perchance but to ask, had I seen\n\u003cbr\u003e \n\u003cbr\u003e Their loves, or to tell the vile wrongs that had been:\n\u003cbr\u003e \n\u003cbr\u003e But I stayed not to hear, lest the story should hold\n\u003cbr\u003e \n\u003cbr\u003e Some hell-form of words, some enchantment, once told,\n\u003cbr\u003e \n\u003cbr\u003e Might translate me in flesh to a brute; and I dreaded\n\u003cbr\u003e \n\u003cbr\u003e To gaze on their charms, lest my faith should be wedded\n\u003cbr\u003e \n\u003cbr\u003e With some pity — and love in that pity perchance —\n\u003cbr\u003e \n\u003cbr\u003e To a thing not all lovely; for once at glance,\n\u003cbr\u003e \n\u003cbr\u003e Methought, where one sat, I descried a bright wonder\n\u003cbr\u003e \n\u003cbr\u003e That flow’d like a long silver rivulet under\n\u003cbr\u003e \n\u003cbr\u003e The long fenny grass — with so lovely a breast,\n\u003cbr\u003e \n\u003cbr\u003e Could it be a snake-tail made the charm of the rest?\n\u003cbr\u003e \n\u003cbr\u003e So I roamed in that circle of horrors, and Fear\n\u003cbr\u003e \n\u003cbr\u003e Walk’d with me, by hills, and in valleys, and near\n\u003cbr\u003e \n\u003cbr\u003e Cluster’d trees for their gloom — not to shelter from heat —\n\u003cbr\u003e \n\u003cbr\u003e But lest a brute-shadow should grow at my feet;\n\u003cbr\u003e \n\u003cbr\u003e And besides that full oft in the sunshiny place\n\u003cbr\u003e \n\u003cbr\u003e Dark shadows would gather like clouds on its face,\n\u003cbr\u003e \n\u003cbr\u003e In the horrible likeness of demons (that none\n\u003cbr\u003e \n\u003cbr\u003e Could see, like invisible flames in the sun);\n\u003cbr\u003e \n\u003cbr\u003e But grew to one monster that seized on the light,\n\u003cbr\u003e \n\u003cbr\u003e Like the dragon that strangles the moon in the night;\n\u003cbr\u003e \n\u003cbr\u003e Fierce sphinxes, long serpents, and asps of the south;\n\u003cbr\u003e \n\u003cbr\u003e Wild birds of huge beak, and all horrors that drouth\n\u003cbr\u003e \n\u003cbr\u003e Engenders of slime in the land of the pest,\n\u003cbr\u003e \n\u003cbr\u003e Vile shapes without shape, and foul bats of the West,\n\u003cbr\u003e \n\u003cbr\u003e Bringing Night on their wings; and the bodies wherein\n\u003cbr\u003e \n\u003cbr\u003e Great Brahma imprisons the spirits of sin,\n\u003cbr\u003e \n\u003cbr\u003e Many-handed, that blent in one phantom of fight\n\u003cbr\u003e \n\u003cbr\u003e Like a Titan, and threatfully warr’d with the light;\n\u003cbr\u003e \n\u003cbr\u003e I have heard the wild shriek that gave signal to close,\n\u003cbr\u003e \n\u003cbr\u003e When they rushed on that shadowy Python of foes,\n\u003cbr\u003e \n\u003cbr\u003e That met with sharp beaks and wide gaping of jaws,\n\u003cbr\u003e \n\u003cbr\u003e With flappings of wings, and fierce grasping of claws,\n\u003cbr\u003e \n\u003cbr\u003e And whirls of long tails:— I have seen the quick flutter\n\u003cbr\u003e \n\u003cbr\u003e Of fragments dissevered — and necks stretch’d to utter\n\u003cbr\u003e \n\u003cbr\u003e Long screamings of pain — the swift motion of blows,\n\u003cbr\u003e \n\u003cbr\u003e And wrestling of arms — to the flight at the close,\n\u003cbr\u003e \n\u003cbr\u003e When the dust of the earth startled upward in rings,\n\u003cbr\u003e \n\u003cbr\u003e And flew on the whirlwind that follow’d their wings.\n\u003cbr\u003e \n\u003cbr\u003e Thus they fled — not forgotten — but often to grow\n\u003cbr\u003e \n\u003cbr\u003e Like fears in my eyes, when I walk’d to and fro\n\u003cbr\u003e \n\u003cbr\u003e In the shadows, and felt from some beings unseen\n\u003cbr\u003e \n\u003cbr\u003e The warm touch of kisses, but clean or unclean\n\u003cbr\u003e \n\u003cbr\u003e I knew not, nor whether the love I had won\n\u003cbr\u003e \n\u003cbr\u003e Was of heaven or hell — till one day in the sun,\n\u003cbr\u003e \n\u003cbr\u003e In its very noon-blaze, I could fancy a thing\n\u003cbr\u003e \n\u003cbr\u003e Of beauty, but faint as the cloud-mirrors fling\n\u003cbr\u003e \n\u003cbr\u003e On the gaze of the shepherd that watches the sky,\n\u003cbr\u003e \n\u003cbr\u003e Half-seen and half-dream’d in the soul of his eye.\n\u003cbr\u003e \n\u003cbr\u003e And when in my musings I gazed on the stream,\n\u003cbr\u003e \n\u003cbr\u003e In motionless trances of thought, there would seem\n\u003cbr\u003e \n\u003cbr\u003e A face like that face, looking upward through mine:\n\u003cbr\u003e \n\u003cbr\u003e With his eyes full of love, and the dim-drownd shine\n\u003cbr\u003e \n\u003cbr\u003e Of limbs and fair garments, like clouds in that blue\n\u003cbr\u003e \n\u003cbr\u003e Serene:— there I stood for long hours but to view\n\u003cbr\u003e \n\u003cbr\u003e Those fond earnest eyes that were ever uplifted\n\u003cbr\u003e \n\u003cbr\u003e Towards me, and wink’d as the water-weed drifted\n\u003cbr\u003e \n\u003cbr\u003e Between; but the fish knew that presence, and plied\n\u003cbr\u003e \n\u003cbr\u003e Their long curvy tails, and swift darted aside.\n\u003cbr\u003e \n\u003cbr\u003e There I gazed for lost time, and forgot all the things\n\u003cbr\u003e \n\u003cbr\u003e That once had been wonders — the fishes with wings,\n\u003cbr\u003e \n\u003cbr\u003e And the glimmer of magnified eyes that look’d up\n\u003cbr\u003e \n\u003cbr\u003e From the glooms of the bottom like pearls in a cup,\n\u003cbr\u003e \n\u003cbr\u003e And the huge endless serpent of silvery gleam,\n\u003cbr\u003e \n\u003cbr\u003e Slow winding along like a tide in the stream.\n\u003cbr\u003e \n\u003cbr\u003e Some maid of the waters, some Naiad, methought\n\u003cbr\u003e \n\u003cbr\u003e Held me dear in the pearl of her eye — and I brought\n\u003cbr\u003e \n\u003cbr\u003e My wish to that fancy; and often I dash’d\n\u003cbr\u003e \n\u003cbr\u003e My limbs in the water, and suddenly splash’d\n\u003cbr\u003e \n\u003cbr\u003e The cool drops around me, yet clung to the brink,\n\u003cbr\u003e \n\u003cbr\u003e Chill’d by watery fears, how that beauty might sink\n\u003cbr\u003e \n\u003cbr\u003e With my life in her arms to her garden, and bind me\n\u003cbr\u003e \n\u003cbr\u003e With its long tangled grasses, or cruelly wind me\n\u003cbr\u003e \n\u003cbr\u003e In some eddy to hum out my life in her ear,\n\u003cbr\u003e \n\u003cbr\u003e Like a spider-caught bee — and in aid of that fear\n\u003cbr\u003e \n\u003cbr\u003e Came the tardy remembrance — Oh falsest of men!\n\u003cbr\u003e \n\u003cbr\u003e Why was not that beauty remember’d till then?\n\u003cbr\u003e \n\u003cbr\u003e My love, my safe love, whose glad life would have run\n\u003cbr\u003e \n\u003cbr\u003e Into mine — like a drop — that our fate might be one,\n\u003cbr\u003e \n\u003cbr\u003e That now, even now — may-be — clasp’d in a dream,\n\u003cbr\u003e \n\u003cbr\u003e That form which I gave to some jilt of the stream,\n\u003cbr\u003e \n\u003cbr\u003e And gazed with fond eyes that her tears tried to smother\n\u003cbr\u003e \n\u003cbr\u003e On a mock of those eyes that I gave to another!\n\u003cbr\u003e \n\u003cbr\u003e Then I rose from the stream, but the eyes of my mind,\n\u003cbr\u003e \n\u003cbr\u003e Still full of the tempter, kept gazing behind\n\u003cbr\u003e \n\u003cbr\u003e On her crystalline face, while I painfully leapt\n\u003cbr\u003e \n\u003cbr\u003e To the bank, and shook off the curst waters, and wept\n\u003cbr\u003e \n\u003cbr\u003e With my brow in the reeds; and the reeds to my ear\n\u003cbr\u003e \n\u003cbr\u003e Bow’d, bent by no wind, and in whispers of fear,\n\u003cbr\u003e \n\u003cbr\u003e Growing small with large secrets, foretold me of one\n\u003cbr\u003e \n\u003cbr\u003e That loved me — but oh to fly from her, and shun\n\u003cbr\u003e \n\u003cbr\u003e Her love like a pest — though her love was as true\n\u003cbr\u003e \n\u003cbr\u003e To mine as her stream to the heavenly blue;\n\u003cbr\u003e \n\u003cbr\u003e For why should I love her with love that would bring\n\u003cbr\u003e \n\u003cbr\u003e All misfortune, like hate, on so joyous a thing?\n\u003cbr\u003e \n\u003cbr\u003e Because of her rival — even Her whose witch-face\n\u003cbr\u003e \n\u003cbr\u003e I had slighted, and therefore was doom’d in that place\n\u003cbr\u003e \n\u003cbr\u003e To roam, and had roam’d, where all horrors grew rank,\n\u003cbr\u003e \n\u003cbr\u003e Nine days ere I wept with my brow on that bank;\n\u003cbr\u003e \n\u003cbr\u003e Her name be not named, but her spite would not fail\n\u003cbr\u003e \n\u003cbr\u003e To our love like a blight; and they told me the tale\n\u003cbr\u003e \n\u003cbr\u003e Of Scylla — and Picus, imprison’d to speak\n\u003cbr\u003e \n\u003cbr\u003e His shrill-screaming woe through a woodpecker’s beak.\n\u003cbr\u003e \n\u003cbr\u003e Then they ceased — I had heard as the voice of my star\n\u003cbr\u003e \n\u003cbr\u003e That told me the truth of my fortunes — thus far\n\u003cbr\u003e \n\u003cbr\u003e I had read of my sorrow, and lay in the hush\n\u003cbr\u003e \n\u003cbr\u003e Of deep meditation — when lo! a light crush\n\u003cbr\u003e \n\u003cbr\u003e Of the reeds, and I turn’d and look’d round in the night\n\u003cbr\u003e \n\u003cbr\u003e Of new sunshine, and saw, as I sipp’d of the light\n\u003cbr\u003e \n\u003cbr\u003e Narrow-winking, the realized nymph of the stream,\n\u003cbr\u003e \n\u003cbr\u003e Rising up from the wave with the bend and the gleam\n\u003cbr\u003e \n\u003cbr\u003e Of a fountain, and o’er her white arms she kept throwing\n\u003cbr\u003e \n\u003cbr\u003e Bright torrents of hair, that went flowing and flowing\n\u003cbr\u003e \n\u003cbr\u003e In falls to her feet, and the blue waters roll’d\n\u003cbr\u003e \n\u003cbr\u003e Down her limbs like a garment, in many a fold,\n\u003cbr\u003e \n\u003cbr\u003e Sun-spangled, gold-broider’d, and fled far behind,\n\u003cbr\u003e \n\u003cbr\u003e Like an infinite train. So she came and reclined\n\u003cbr\u003e \n\u003cbr\u003e In the reeds, and I hunger’d to see her unseal\n\u003cbr\u003e \n\u003cbr\u003e The buds of her eyes that would ope and reveal\n\u003cbr\u003e \n\u003cbr\u003e The blue that was in them; — they oped and she raised\n\u003cbr\u003e \n\u003cbr\u003e Two orbs of pure crystal, and timidly gazed\n\u003cbr\u003e \n\u003cbr\u003e With her eyes on my eyes; but their color and shine\n\u003cbr\u003e \n\u003cbr\u003e Was of that which they look’d on, and mostly of mine —\n\u003cbr\u003e \n\u003cbr\u003e For she loved me — except when she blush’d, and they sank,\n\u003cbr\u003e \n\u003cbr\u003e Shame-humbled, to number the stones on the bank,\n\u003cbr\u003e \n\u003cbr\u003e Or her play-idle fingers, while lisping she told me\n\u003cbr\u003e \n\u003cbr\u003e How she put on her veil, and in love to behold me\n\u003cbr\u003e \n\u003cbr\u003e Would wing through the sun till she fainted away\n\u003cbr\u003e \n\u003cbr\u003e Like a mist, and then flew to her waters and lay\n\u003cbr\u003e \n\u003cbr\u003e In love-patience long hours, and sore dazzled her eyes\n\u003cbr\u003e \n\u003cbr\u003e In watching for mine ‘gainst the midsummer skies.\n\u003cbr\u003e \n\u003cbr\u003e But now they were heal’d — O my heart, it still dances\n\u003cbr\u003e \n\u003cbr\u003e When I think of the charm of her changeable glances,\n\u003cbr\u003e \n\u003cbr\u003e And my image how small when it sank in the deep\n\u003cbr\u003e \n\u003cbr\u003e Of her eyes where her soul was — Alas! now they weep,\n\u003cbr\u003e \n\u003cbr\u003e And none knoweth where. In what stream do her eyes\n\u003cbr\u003e \n\u003cbr\u003e Shed invisible tears? Who beholds where her sighs\n\u003cbr\u003e \n\u003cbr\u003e Flow in eddies, or sees the ascent of the leaf\n\u003cbr\u003e \n\u003cbr\u003e She has pluck’d with her tresses? Who listens her grief\n\u003cbr\u003e \n\u003cbr\u003e Like a far fall of waters, or hears where her feet\n\u003cbr\u003e \n\u003cbr\u003e Grow emphatic among the loose pebbles, and beat\n\u003cbr\u003e \n\u003cbr\u003e Them together? Ah! surely her flowers float adown\n\u003cbr\u003e \n\u003cbr\u003e To the sea unaccepted, and little ones drown\n\u003cbr\u003e \n\u003cbr\u003e For need of her mercy — even he whose twin-brother\n\u003cbr\u003e \n\u003cbr\u003e Will miss him forever; and the sorrowful mother\n\u003cbr\u003e \n\u003cbr\u003e Imploreth in vain for his body to kiss\n\u003cbr\u003e \n\u003cbr\u003e And cling to, all dripping and cold as it is,\n\u003cbr\u003e \n\u003cbr\u003e Because that soft pity is lost in hard pain\n\u003cbr\u003e \n\u003cbr\u003e We loved — how we loved! — for I thought not again\n\u003cbr\u003e \n\u003cbr\u003e Of the woes that were whisper’d like fears in that place\n\u003cbr\u003e \n\u003cbr\u003e If I gave me to beauty. Her face was the face,\n\u003cbr\u003e \n\u003cbr\u003e Far away, and her eyes were the eyes that were drown’d\n\u003cbr\u003e \n\u003cbr\u003e For my absence — her arms were the arms that sought round\n\u003cbr\u003e \n\u003cbr\u003e And claspt me to nought; for I gazed and became\n\u003cbr\u003e \n\u003cbr\u003e Only true to my falsehood, and had but one name\n\u003cbr\u003e \n\u003cbr\u003e For two loves, and call’d ever on ?gle, sweet maid\n\u003cbr\u003e \n\u003cbr\u003e Of the sky-loving waters — and was not afraid\n\u003cbr\u003e \n\u003cbr\u003e Of the sight of her skin; — for it never could be;\n\u003cbr\u003e \n\u003cbr\u003e Her beauty and love were misfortunes to me!\n\u003cbr\u003e \n\u003cbr\u003e Thus our bliss had endured for a time-shorten’d space,\n\u003cbr\u003e \n\u003cbr\u003e Like a day made of three, and the smile of her face\n\u003cbr\u003e \n\u003cbr\u003e Had been with me for joy — when she told me indeed\n\u003cbr\u003e \n\u003cbr\u003e Her love was self-task’d with a work that would need\n\u003cbr\u003e \n\u003cbr\u003e Some short hours, for in truth ’twas the veriest pity\n\u003cbr\u003e \n\u003cbr\u003e Our love should not last, and then sang me a ditty,\n\u003cbr\u003e \n\u003cbr\u003e Of one with warm lips that should love her, and love her\n\u003cbr\u003e \n\u003cbr\u003e When suns were burnt dim and long ages past over.\n\u003cbr\u003e \n\u003cbr\u003e So she fled with her voice, and I patiently nested\n\u003cbr\u003e \n\u003cbr\u003e My limbs in the reeds, in still quiet, and rested\n\u003cbr\u003e \n\u003cbr\u003e Till my thoughts grew extinct, and I sank in a sleep\n\u003cbr\u003e \n\u003cbr\u003e Of dreams — but their meaning was hidden too deep\n\u003cbr\u003e \n\u003cbr\u003e To be read what their woe was; — but still it was woe\n\u003cbr\u003e \n\u003cbr\u003e That was writ on all faces that swam to and fro\n\u003cbr\u003e \n\u003cbr\u003e In that river of night; — and the gaze of their eyes\n\u003cbr\u003e \n\u003cbr\u003e Was sad — and the bend of their brows — and their cries\n\u003cbr\u003e \n\u003cbr\u003e Were seen, but I heard not. The warm touch of tears\n\u003cbr\u003e \n\u003cbr\u003e Travell’d down my cold cheeks, and I shook till my fears\n\u003cbr\u003e \n\u003cbr\u003e Awaked me, and lo! I was couch’d in a bower,\n\u003cbr\u003e \n\u003cbr\u003e The growth of long summers rear’d up in an hour!\n\u003cbr\u003e \n\u003cbr\u003e Then I said, in the fear of my dream, I will fly\n\u003cbr\u003e \n\u003cbr\u003e From this magic, but could not, because that my eye\n\u003cbr\u003e \n\u003cbr\u003e Grew love-idle among the rich blooms; and the earth\n\u003cbr\u003e \n\u003cbr\u003e Held me down with its coolness of touch, and the mirth\n\u003cbr\u003e \n\u003cbr\u003e Of some bird was above me — who, even in fear,\n\u003cbr\u003e \n\u003cbr\u003e Would startle the thrush? and methought there drew near\n\u003cbr\u003e \n\u003cbr\u003e A form as of ?gle — but it was not the face\n\u003cbr\u003e \n\u003cbr\u003e Hope made, and I knew the witch-Queen of that place,\n\u003cbr\u003e \n\u003cbr\u003e Even Circe the Cruel, that came like a Death,\n\u003cbr\u003e \n\u003cbr\u003e Which I fear’d, and yet fled not, for want of my breath.\n\u003cbr\u003e \n\u003cbr\u003e There was thought in her face, and her eyes were not raised\n\u003cbr\u003e \n\u003cbr\u003e From the grass at her foot, but I saw, as I gazed,\n\u003cbr\u003e \n\u003cbr\u003e Her spite — and her countenance changed with her mind\n\u003cbr\u003e \n\u003cbr\u003e As she plann’d how to thrall me with beauty, and bind\n\u003cbr\u003e \n\u003cbr\u003e My soul to her charms — and her long tresses play’d\n\u003cbr\u003e \n\u003cbr\u003e From shade into shine and from shine into shade,\n\u003cbr\u003e \n\u003cbr\u003e Like a day in mid-autumn — first fair, O how fair!\n\u003cbr\u003e \n\u003cbr\u003e With long snaky locks of the adder-black hair\n\u003cbr\u003e \n\u003cbr\u003e That clung round her neck — those dark locks that I prize,\n\u003cbr\u003e \n\u003cbr\u003e For the sake of a maid that once loved me with eyes\n\u003cbr\u003e \n\u003cbr\u003e Of that fathomless hue — but they changed as they roll’d,\n\u003cbr\u003e \n\u003cbr\u003e And brighten’d, and suddenly blazed into gold\n\u003cbr\u003e \n\u003cbr\u003e That she comb’d into flames, and the locks that fell down\n\u003cbr\u003e \n\u003cbr\u003e Turn’d dark as they fell, but I slighted their brown,\n\u003cbr\u003e \n\u003cbr\u003e Nor loved, till I saw the light ringlets shed wild,\n\u003cbr\u003e \n\u003cbr\u003e That innocence wears when she is but a child;\n\u003cbr\u003e \n\u003cbr\u003e And her eyes — Oh I ne’er had been witched with their shine,\n\u003cbr\u003e \n\u003cbr\u003e Had they been any other, my ?gle, than thine!\n\u003cbr\u003e \n\u003cbr\u003e Then I gave me to magic, and gazed till I madden’d\n\u003cbr\u003e \n\u003cbr\u003e In the full of their light — but I sadden’d and sadden’d\n\u003cbr\u003e \n\u003cbr\u003e The deeper I look’d — till I sank on the snow\n\u003cbr\u003e \n\u003cbr\u003e Of her bosom, a thing made of terror and woe,\n\u003cbr\u003e \n\u003cbr\u003e And answer’d its throb with the shudder of fears,\n\u003cbr\u003e \n\u003cbr\u003e And hid my cold eyes from her eyes with my tears,\n\u003cbr\u003e \n\u003cbr\u003e And strain’d her white arms with the still languid weight\n\u003cbr\u003e \n\u003cbr\u003e Of a fainting distress. There she sat like the Fate\n\u003cbr\u003e \n\u003cbr\u003e That is nurse unto Death, and bent over in shame\n\u003cbr\u003e \n\u003cbr\u003e To hide me from her the true ?gle — that came\n\u003cbr\u003e \n\u003cbr\u003e With the words on her lips the false witch had fore-given\n\u003cbr\u003e \n\u003cbr\u003e To make me immortal — for now I was even\n\u003cbr\u003e \n\u003cbr\u003e At the portals of Death, who but waited the hush\n\u003cbr\u003e \n\u003cbr\u003e Of world-sounds in my ears to cry welcome, and rush\n\u003cbr\u003e \n\u003cbr\u003e With my soul to the banks of his black-flowing river.\n\u003cbr\u003e \n\u003cbr\u003e Oh, would it had flown from my body forever,\n\u003cbr\u003e \n\u003cbr\u003e Ere I listen’d those words, when I felt with a start,\n\u003cbr\u003e \n\u003cbr\u003e The life-blood rush back in one throb to my heart,\n\u003cbr\u003e \n\u003cbr\u003e And saw the pale lips where the rest of that spell\n\u003cbr\u003e \n\u003cbr\u003e Had perished in horror — and heard the farewell\n\u003cbr\u003e \n\u003cbr\u003e Of that voice that was drown’d in the dash of the stream!\n\u003cbr\u003e \n\u003cbr\u003e How fain had I follow’d, and plunged with that scream\n\u003cbr\u003e \n\u003cbr\u003e Into death, but my being indignantly lagg’d\n\u003cbr\u003e \n\u003cbr\u003e Through the brutalized flesh that I painfully dragg’d\n\u003cbr\u003e \n\u003cbr\u003e Behind me:— O Circe! O mother of spite!\n\u003cbr\u003e \n\u003cbr\u003e Speak the last of that curse! and imprison me quite\n\u003cbr\u003e \n\u003cbr\u003e In the husk of a brute — that no pity may name\n\u003cbr\u003e \n\u003cbr\u003e The man that I was — that no kindred may claim —\n\u003cbr\u003e \n\u003cbr\u003e “The monster I am! Let me utterly be\n\u003cbr\u003e \n\u003cbr\u003e Brute-buried, and Nature’s dishonor with me\n\u003cbr\u003e \n\u003cbr\u003e Uninscribed!”— But she listen’d my prayer, that was praise\n\u003cbr\u003e \n\u003cbr\u003e To her malice, with smiles, and advised me to gaze\n\u003cbr\u003e \n\u003cbr\u003e On the river for love — and perchance she would make\n\u003cbr\u003e \n\u003cbr\u003e In pity a maid without eyes for my sake,\n\u003cbr\u003e \n\u003cbr\u003e And she left me like Scorn. Then I ask’d of the wave,\n\u003cbr\u003e \n\u003cbr\u003e What monster I was, and it trembled and gave\n\u003cbr\u003e \n\u003cbr\u003e The true shape of my grief, and I turn’d with my face\n\u003cbr\u003e \n\u003cbr\u003e From all waters forever, and fled through that place,\n\u003cbr\u003e \n\u003cbr\u003e Till with horror more strong than all magic I pass’d\n\u003cbr\u003e \n\u003cbr\u003e Its bounds, and the world was before me at last.\n\u003cbr\u003e \n\u003cbr\u003e There I wander’d in sorrow, and shunned the abodes\n\u003cbr\u003e \n\u003cbr\u003e Of men, that stood up in the likeness of Gods,\n\u003cbr\u003e \n\u003cbr\u003e But I saw from afar the warm shine of the sun\n\u003cbr\u003e \n\u003cbr\u003e On the cities, where man was a million, not one;\n\u003cbr\u003e \n\u003cbr\u003e And I saw the white smoke of their altars ascending,\n\u003cbr\u003e \n\u003cbr\u003e That show’d where the hearts of many were blending,\n\u003cbr\u003e \n\u003cbr\u003e And the wind in my face brought shrill voices that came\n\u003cbr\u003e \n\u003cbr\u003e From the trumpets that gather’d whole bands in one fame\n\u003cbr\u003e \n\u003cbr\u003e As a chorus of man — and they stream’d from the gates\n\u003cbr\u003e \n\u003cbr\u003e Like a dusky libation poured out to the Fates.\n\u003cbr\u003e \n\u003cbr\u003e But at times there were gentler processions of peace\n\u003cbr\u003e \n\u003cbr\u003e That I watch’d with my soul in my eyes till their cease,\n\u003cbr\u003e \n\u003cbr\u003e There were women! there men! but to me a third sex\n\u003cbr\u003e \n\u003cbr\u003e I saw them all dots — yet I loved them as specks:\n\u003cbr\u003e \n\u003cbr\u003e And oft to assuage a sad yearning of eyes\n\u003cbr\u003e \n\u003cbr\u003e I stole near the city, but stole covert-wise\n\u003cbr\u003e \n\u003cbr\u003e Like a wild beast of love, and perchance to be smitten\n\u003cbr\u003e \n\u003cbr\u003e By some hand that I rather had wept on than bitten!\n\u003cbr\u003e \n\u003cbr\u003e Oh, I once had a haunt near a cot where a mother\n\u003cbr\u003e \n\u003cbr\u003e Daily sat in the shade with her child, and would smother\n\u003cbr\u003e \n\u003cbr\u003e Its eyelids in kisses, and then in its sleep\n\u003cbr\u003e \n\u003cbr\u003e Sang dreams in its ear of its manhood, while deep\n\u003cbr\u003e \n\u003cbr\u003e In a thicket of willows I gazed o’er the brooks\n\u003cbr\u003e \n\u003cbr\u003e That murmur’d between us and kiss’d them with looks;\n\u003cbr\u003e \n\u003cbr\u003e But the willows unbosom’d their secret, and never\n\u003cbr\u003e \n\u003cbr\u003e I return’d to a spot I had startled forever,\n\u003cbr\u003e \n\u003cbr\u003e Though I oft long’d to know, but could ask it of none,\n\u003cbr\u003e \n\u003cbr\u003e Was the mother still fair, and how big was her son?\n\u003cbr\u003e \n\u003cbr\u003e For the haunters of fields they all shunn’d me by flight;\n\u003cbr\u003e \n\u003cbr\u003e The men in their horror, the women in fright;\n\u003cbr\u003e \n\u003cbr\u003e None ever remain’d save a child once that sported\n\u003cbr\u003e \n\u003cbr\u003e Among the wild bluebells, and playfully courted\n\u003cbr\u003e \n\u003cbr\u003e The breeze; and beside him a speckled snake lay\n\u003cbr\u003e \n\u003cbr\u003e Tight strangled, because it had hiss’d him away\n\u003cbr\u003e \n\u003cbr\u003e From the flower at his finger; he rose and drew near\n\u003cbr\u003e \n\u003cbr\u003e Like a Son of Immortals, one born to no fear,\n\u003cbr\u003e \n\u003cbr\u003e But with strength of black locks and with eyes azure bright\n\u003cbr\u003e \n\u003cbr\u003e To grow to large manhood of merciful might.\n\u003cbr\u003e \n\u003cbr\u003e He came, with his face of bold wonder, to feel,\n\u003cbr\u003e \n\u003cbr\u003e The hair of my side, and to lift up my heel,\n\u003cbr\u003e \n\u003cbr\u003e And question’d my face with wide eyes; but when under\n\u003cbr\u003e \n\u003cbr\u003e My lids he saw tears — for I wept at his wonder,\n\u003cbr\u003e \n\u003cbr\u003e He stroked me, and utter’d such kindliness then,\n\u003cbr\u003e \n\u003cbr\u003e That the once love of women, the friendship of men\n\u003cbr\u003e \n\u003cbr\u003e In past sorrow, no kindness e’er came like a kiss\n\u003cbr\u003e \n\u003cbr\u003e On my heart in its desolate day such as this!\n\u003cbr\u003e \n\u003cbr\u003e And I yearn’d at his cheeks in my love, and down bent,\n\u003cbr\u003e \n\u003cbr\u003e And lifted him up in my arms with intent\n\u003cbr\u003e \n\u003cbr\u003e To kiss him — but he cruel-kindly, alas!\n\u003cbr\u003e \n\u003cbr\u003e Held out to my lips a pluck’d handful of grass!\n\u003cbr\u003e \n\u003cbr\u003e Then I dropt him in horror, but felt as I fled\n\u003cbr\u003e \n\u003cbr\u003e The stone he indignantly hurl’d at my head,\n\u003cbr\u003e \n\u003cbr\u003e That dissever’d my ear — but I felt not, whose fate\n\u003cbr\u003e \n\u003cbr\u003e Was to meet more distress in his love that his hate!\n\u003cbr\u003e \n\u003cbr\u003e Thus I wander’d, companion’d of grief and forlorn\n\u003cbr\u003e \n\u003cbr\u003e Till I wish’d for that land where my being was born\n\u003cbr\u003e \n\u003cbr\u003e But what was that land with its love, where my home\n\u003cbr\u003e \n\u003cbr\u003e Was self-shut against me; for why should I come\n\u003cbr\u003e \n\u003cbr\u003e Like an after-distress to my gray-bearded father,\n\u003cbr\u003e \n\u003cbr\u003e With a blight to the last of his sight? — let him rather\n\u003cbr\u003e \n\u003cbr\u003e Lament for me dead, and shed tears in the urn\n\u003cbr\u003e \n\u003cbr\u003e Where I was not, and still in fond memory turn\n\u003cbr\u003e \n\u003cbr\u003e To his son even such as he left him. Oh, how\n\u003cbr\u003e \n\u003cbr\u003e Could I walk with the youth once my fellows, but now\n\u003cbr\u003e \n\u003cbr\u003e Like Gods to my humbled estate? — or how bear\n\u003cbr\u003e \n\u003cbr\u003e The steeds once the pride of my eyes and the care\n\u003cbr\u003e \n\u003cbr\u003e Of my hands? Then I turn’d me self-banish’d, and came\n\u003cbr\u003e \n\u003cbr\u003e Into Thessaly here, where I met with the same\n\u003cbr\u003e \n\u003cbr\u003e As myself. I have heard how they met by a stream\n\u003cbr\u003e \n\u003cbr\u003e In games, and were suddenly changed by a scream\n\u003cbr\u003e \n\u003cbr\u003e That made wretches of many, as she roll’d her wild eyes\n\u003cbr\u003e \n\u003cbr\u003e Against heaven, and so vanish’d. — The gentle and wise\n\u003cbr\u003e \n\u003cbr\u003e Lose their thoughts in deep studies, and others their ill\n\u003cbr\u003e \n\u003cbr\u003e In the mirth of mankind where they mingle them still.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/36781.html","bookId":111,"creation":"Aug 1, 2019 4:00:08 AM","modification":"Aug 1, 2019 4:00:08 AM"}
