{"id":2638,"no":7,"title":"The Two Peacocks of Bedfont.","content":"1.\n\u003cbr\u003e \n\u003cbr\u003e Alas! That breathing Vanity should go\n\u003cbr\u003e \n\u003cbr\u003e Where Pride is buried — like its very ghost,\n\u003cbr\u003e \n\u003cbr\u003e Uprisen from the naked bones below,\n\u003cbr\u003e \n\u003cbr\u003e In novel flesh, clad in the silent boast\n\u003cbr\u003e \n\u003cbr\u003e Of gaudy silk that flutters to and fro,\n\u003cbr\u003e \n\u003cbr\u003e Shedding its chilling superstition most\n\u003cbr\u003e \n\u003cbr\u003e On young and ignorant natures — as it wont\n\u003cbr\u003e \n\u003cbr\u003e To haunt the peaceful churchyard of Bedfont!\n\u003cbr\u003e 2.\n\u003cbr\u003e \n\u003cbr\u003e Each Sabbath morning, at the hour of prayer,\n\u003cbr\u003e \n\u003cbr\u003e Behold two maidens, up the quiet green\n\u003cbr\u003e \n\u003cbr\u003e Shining, far distant, in the summer air\n\u003cbr\u003e \n\u003cbr\u003e That flaunts their dewy robes and breathes between\n\u003cbr\u003e \n\u003cbr\u003e Their downy plumes — sailing as if they were\n\u003cbr\u003e \n\u003cbr\u003e Two far-off ships — until they brush between\n\u003cbr\u003e \n\u003cbr\u003e The churchyard’s humble walls, and watch and wait\n\u003cbr\u003e \n\u003cbr\u003e On either side of the wide open’d gate,\n\u003cbr\u003e 3.\n\u003cbr\u003e \n\u003cbr\u003e And there they stand — with haughty necks before\n\u003cbr\u003e \n\u003cbr\u003e God’s holy house, that points towards the skies —\n\u003cbr\u003e \n\u003cbr\u003e Frowning reluctant duty from the poor,\n\u003cbr\u003e \n\u003cbr\u003e And tempting homage from unthoughtful eyes:\n\u003cbr\u003e \n\u003cbr\u003e And Youth looks lingering from the temple door,\n\u003cbr\u003e \n\u003cbr\u003e Breathing its wishes in unfruitful sighs,\n\u003cbr\u003e \n\u003cbr\u003e With pouting lips — forgetful of the grace,\n\u003cbr\u003e \n\u003cbr\u003e Of health, and smiles, on the heart-conscious face; —\n\u003cbr\u003e 4.\n\u003cbr\u003e \n\u003cbr\u003e Because that Wealth, which has no bliss beside,\n\u003cbr\u003e \n\u003cbr\u003e May wear the happiness of rich attire;\n\u003cbr\u003e \n\u003cbr\u003e And those two sisters, in their silly pride,\n\u003cbr\u003e \n\u003cbr\u003e May change the soul’s warm glances for the fire\n\u003cbr\u003e \n\u003cbr\u003e Of lifeless diamonds; — and for health denied —\n\u003cbr\u003e \n\u003cbr\u003e With art, that blushes at itself, inspire\n\u003cbr\u003e \n\u003cbr\u003e Their languid cheeks — and flourish in a glory\n\u003cbr\u003e \n\u003cbr\u003e That has no life in life, nor after-story.\n\u003cbr\u003e 5.\n\u003cbr\u003e \n\u003cbr\u003e The aged priest goes shaking his gray hair\n\u003cbr\u003e \n\u003cbr\u003e In meekest censuring, and turns his eye\n\u003cbr\u003e \n\u003cbr\u003e Earthward in grief, and heavenward in pray’r,\n\u003cbr\u003e \n\u003cbr\u003e And sighs, and clasps his hands, and passes by,\n\u003cbr\u003e \n\u003cbr\u003e Good-hearted man! what sullen soul would wear\n\u003cbr\u003e \n\u003cbr\u003e Thy sorrow for a garb, and constantly\n\u003cbr\u003e \n\u003cbr\u003e Put on thy censure, that might win the praise\n\u003cbr\u003e \n\u003cbr\u003e Of one so gray in goodness and in days?\n\u003cbr\u003e 6.\n\u003cbr\u003e \n\u003cbr\u003e Also the solemn clerk partakes the shame\n\u003cbr\u003e \n\u003cbr\u003e Of this ungodly shine of human pride,\n\u003cbr\u003e \n\u003cbr\u003e And sadly blends his reverence and blame\n\u003cbr\u003e \n\u003cbr\u003e In one grave bow, and passes with a stride\n\u003cbr\u003e \n\u003cbr\u003e Impatient:— many a red-hooded dame\n\u003cbr\u003e \n\u003cbr\u003e Turns her pain’d head, but not her glance, aside\n\u003cbr\u003e \n\u003cbr\u003e From wanton dress, and marvels o’er again,\n\u003cbr\u003e \n\u003cbr\u003e That heaven hath no wet judgments for the vain.\n\u003cbr\u003e 7.\n\u003cbr\u003e \n\u003cbr\u003e “I have a lily in the bloom at home,”\n\u003cbr\u003e \n\u003cbr\u003e Quoth one, “and by the blessed Sabbath day\n\u003cbr\u003e \n\u003cbr\u003e I’ll pluck my lily in its pride, and come\n\u003cbr\u003e \n\u003cbr\u003e And read a lesson upon vain array; —\n\u003cbr\u003e \n\u003cbr\u003e And when stiff silks are rustling up, and some\n\u003cbr\u003e \n\u003cbr\u003e Give place, I’ll shake it in proud eyes and say —\n\u003cbr\u003e \n\u003cbr\u003e Making my reverence — ‘Ladies, an you please,\n\u003cbr\u003e \n\u003cbr\u003e King Solomon’s not half so fine as these,’”\n\u003cbr\u003e 8.\n\u003cbr\u003e \n\u003cbr\u003e Then her meek partner, who has nearly run\n\u003cbr\u003e \n\u003cbr\u003e His earthly course — “Nay, Goody, let your text\n\u003cbr\u003e \n\u003cbr\u003e Grow in the garden. — We have only one —\n\u003cbr\u003e \n\u003cbr\u003e Who knows that these dim eyes may see the next?\n\u003cbr\u003e \n\u003cbr\u003e Summer will come again, and summer sun,\n\u003cbr\u003e \n\u003cbr\u003e And lilies too — but I were sorely vext\n\u003cbr\u003e \n\u003cbr\u003e To mar my garden, and cut short the blow\n\u003cbr\u003e \n\u003cbr\u003e Of the last lily I may live to grow,”\n\u003cbr\u003e 9.\n\u003cbr\u003e \n\u003cbr\u003e “The last!” quoth she, “and though the last it were —\n\u003cbr\u003e \n\u003cbr\u003e Lo! those two wantons, where they stand so proud\n\u003cbr\u003e \n\u003cbr\u003e With waving plumes, and jewels in their hair,\n\u003cbr\u003e \n\u003cbr\u003e And painted cheeks, like Dagons to be bow’d\n\u003cbr\u003e \n\u003cbr\u003e And curtsey’d to! — last Sabbath after pray’r,\n\u003cbr\u003e \n\u003cbr\u003e I heard the little Tomkins ask aloud\n\u003cbr\u003e \n\u003cbr\u003e If they were angels — but I made him know\n\u003cbr\u003e \n\u003cbr\u003e God’s bright ones better, with a bitter blow!”\n\u003cbr\u003e 10.\n\u003cbr\u003e \n\u003cbr\u003e So speaking, they pursue the pebbly walk\n\u003cbr\u003e \n\u003cbr\u003e That leads to the white porch the Sunday throng,\n\u003cbr\u003e \n\u003cbr\u003e Hand-coupled urchins in restrain?d talk,\n\u003cbr\u003e \n\u003cbr\u003e And anxious pedagogue that chastens wrong,\n\u003cbr\u003e \n\u003cbr\u003e And posied churchwarden with solemn stalk,\n\u003cbr\u003e \n\u003cbr\u003e And gold-bedizen’d beadle flames along,\n\u003cbr\u003e \n\u003cbr\u003e And gentle peasant clad in buff and green,\n\u003cbr\u003e \n\u003cbr\u003e Like a meek cowslip in the spring serene;\n\u003cbr\u003e 11.\n\u003cbr\u003e \n\u003cbr\u003e And blushing maiden — modestly array’d\n\u003cbr\u003e \n\u003cbr\u003e In spotless white — still conscious of the glass;\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow, that hath made\n\u003cbr\u003e \n\u003cbr\u003e A sable covenant with grief — alas!\n\u003cbr\u003e \n\u003cbr\u003e She veils her tears under the deep, deep shade,\n\u003cbr\u003e \n\u003cbr\u003e While the poor kindly-hearted, as they pass,\n\u003cbr\u003e \n\u003cbr\u003e Bend to unclouded childhood, and caress\n\u003cbr\u003e \n\u003cbr\u003e Her boy — so rosy! — and so fatherless!\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 12.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e Thus, as good Christians ought, they all draw near\n\u003cbr\u003e \n\u003cbr\u003e The fair white temple, to the timely call\n\u003cbr\u003e \n\u003cbr\u003e Of pleasant bells that tremble in the ear. —\n\u003cbr\u003e \n\u003cbr\u003e Now the last frock, and scarlet hood, and shawl\n\u003cbr\u003e \n\u003cbr\u003e Fade into dusk, in the dim atmosphere\n\u003cbr\u003e \n\u003cbr\u003e Of the low porch, and heav’n has won them all,\n\u003cbr\u003e \n\u003cbr\u003e — Saying those two, that turn aside and pass,\n\u003cbr\u003e \n\u003cbr\u003e In velvet blossom, where all flesh is grass.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 13.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e Ah me! to see their silken manors trail’d\n\u003cbr\u003e \n\u003cbr\u003e In purple luxuries — with restless gold —\n\u003cbr\u003e \n\u003cbr\u003e Flaunting the grass where widowhood has wail’d\n\u003cbr\u003e \n\u003cbr\u003e In blotted black — over the heapy mould\n\u003cbr\u003e \n\u003cbr\u003e Panting wave-wantonly! They never quail’d\n\u003cbr\u003e \n\u003cbr\u003e How the warm vanity abused the cold;\n\u003cbr\u003e \n\u003cbr\u003e Nor saw the solemn faces of the gone\n\u003cbr\u003e \n\u003cbr\u003e Sadly uplooking through transparent stone:\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 14.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e But swept their dwellings with unquiet light,\n\u003cbr\u003e \n\u003cbr\u003e Shocking the awful presence of the dead;\n\u003cbr\u003e \n\u003cbr\u003e Where gracious natures would their eyes benight,\n\u003cbr\u003e \n\u003cbr\u003e Nor wear their being with a lip too red,\n\u003cbr\u003e \n\u003cbr\u003e Nor move too rudely in the summer bright\n\u003cbr\u003e \n\u003cbr\u003e Of sun, but put staid sorrow in their tread,\n\u003cbr\u003e \n\u003cbr\u003e Meting it into steps, with inward breath,\n\u003cbr\u003e \n\u003cbr\u003e In very pity to bereaved death.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 15.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e Now in the church, time-sober’d minds resign\n\u003cbr\u003e \n\u003cbr\u003e To solemn pray’r, and the loud chaunted hymn —\n\u003cbr\u003e \n\u003cbr\u003e With glowing picturings of joys divine\n\u003cbr\u003e \n\u003cbr\u003e Painting the mist-light where the roof is dim;\n\u003cbr\u003e \n\u003cbr\u003e But youth looks upward to the window shine,\n\u003cbr\u003e \n\u003cbr\u003e Warming with rose and purple and the swim\n\u003cbr\u003e \n\u003cbr\u003e Of gold, as if thought-tinted by the stains\n\u003cbr\u003e \n\u003cbr\u003e Of gorgeous light through many-color’d panes;\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 16.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e Soiling the virgin snow wherein God hath\n\u003cbr\u003e \n\u003cbr\u003e Enrobed his angels — and with absent eyes\n\u003cbr\u003e \n\u003cbr\u003e Hearing of Heav’n, and its directed path,\n\u003cbr\u003e \n\u003cbr\u003e Thoughtful of slippers — and the glorious skies\n\u003cbr\u003e \n\u003cbr\u003e Clouding with satin — till the preacher’s wrath\n\u003cbr\u003e \n\u003cbr\u003e Consumes his pity, and he glows and cries\n\u003cbr\u003e \n\u003cbr\u003e With a deep voice that trembles in its might,\n\u003cbr\u003e \n\u003cbr\u003e And earnest eyes grow eloquent in light:\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 17.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e “Oh, that the vacant eye would learn to look\n\u003cbr\u003e \n\u003cbr\u003e On very beauty, and the heart embrace\n\u003cbr\u003e \n\u003cbr\u003e True loveliness, and from this holy book\n\u003cbr\u003e \n\u003cbr\u003e Drink the warm-breathing tenderness and grace\n\u003cbr\u003e \n\u003cbr\u003e Of love indeed! Oh, that the young soul took\n\u003cbr\u003e \n\u003cbr\u003e Its virgin passion from the glorious face\n\u003cbr\u003e \n\u003cbr\u003e Of fair religion, and address’d its strife,\n\u003cbr\u003e \n\u003cbr\u003e To win the riches of eternal life!”\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 18.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e “Doth the vain heart love glory that is none,\n\u003cbr\u003e \n\u003cbr\u003e And the poor excellence of vain attire?\n\u003cbr\u003e \n\u003cbr\u003e Oh go, and drown your eyes against the sun,\n\u003cbr\u003e \n\u003cbr\u003e The visible ruler of the starry quire,\n\u003cbr\u003e \n\u003cbr\u003e Till boiling gold in giddy eddies run,\n\u003cbr\u003e \n\u003cbr\u003e Dazzling the brain with orbs of living fire;\n\u003cbr\u003e \n\u003cbr\u003e And the faint soul down-darkens into night,\n\u003cbr\u003e \n\u003cbr\u003e And dies a burning martyrdom to light.”\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 19.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e Oh go, and gaze — when the low winds of ev’n\n\u003cbr\u003e \n\u003cbr\u003e Breathe hymns, and Nature’s many forests nod\n\u003cbr\u003e \n\u003cbr\u003e Their gold-crown’d heads; and the rich blooms of heav’n\n\u003cbr\u003e \n\u003cbr\u003e Sun-ripen’d give their blushes up to God;\n\u003cbr\u003e \n\u003cbr\u003e And mountain-rocks and cloudy steeps are riv’n\n\u003cbr\u003e \n\u003cbr\u003e By founts of fire, as smitten by the rod\n\u003cbr\u003e \n\u003cbr\u003e Of heavenly Moses — that your thirsty sense\n\u003cbr\u003e \n\u003cbr\u003e May quench its longings of magnificence!\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 20.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e “Yet suns shall perish — stars shall fade away —\n\u003cbr\u003e \n\u003cbr\u003e Day into darkness — darkness into death —\n\u003cbr\u003e \n\u003cbr\u003e Death into silence; the warm light of day,\n\u003cbr\u003e \n\u003cbr\u003e The blooms of summer, the rich glowing breath\n\u003cbr\u003e \n\u003cbr\u003e Of even — all shall wither and decay,\n\u003cbr\u003e \n\u003cbr\u003e Like the frail furniture of dreams beneath\n\u003cbr\u003e \n\u003cbr\u003e The touch of morn — or bubbles of rich dyes\n\u003cbr\u003e \n\u003cbr\u003e That break and vanish in the aching eyes.”\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 21.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e They hear, soul-blushing, and repentant shed\n\u003cbr\u003e \n\u003cbr\u003e Unwholesome thoughts in wholesome tears, and pour\n\u003cbr\u003e \n\u003cbr\u003e Their sin to earth — and with low drooping head\n\u003cbr\u003e \n\u003cbr\u003e Receive the solemn blessing, and implore\n\u003cbr\u003e \n\u003cbr\u003e Its grace — then soberly with chasten’d tread,\n\u003cbr\u003e \n\u003cbr\u003e They meekly press towards the gusty door\n\u003cbr\u003e \n\u003cbr\u003e With humbled eyes that go to graze upon\n\u003cbr\u003e \n\u003cbr\u003e The lowly grass — like him of Babylon.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 22.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e The lowly grass! — O water-constant mind!\n\u003cbr\u003e \n\u003cbr\u003e Fast-ebbing holiness! — soon-fading grace\n\u003cbr\u003e \n\u003cbr\u003e Of serious thought, as if the gushing wind\n\u003cbr\u003e \n\u003cbr\u003e Through the low porch had wash’d it from the face\n\u003cbr\u003e \n\u003cbr\u003e For ever! — How they lift their eyes to find\n\u003cbr\u003e \n\u003cbr\u003e Old vanities! — Pride wins the very place\n\u003cbr\u003e \n\u003cbr\u003e Of meekness, like a bird, and flutters now\n\u003cbr\u003e \n\u003cbr\u003e With idle wings on the curl-conscious brow!\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e 23.\n\u003cbr\u003e \n\u003cbr\u003e And she, the lonely widow,\n\u003cbr\u003e \n\u003cbr\u003e And lo! with eager looks they seek the way\n\u003cbr\u003e \n\u003cbr\u003e Of old temptation at the lowly gate;\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array,\n\u003cbr\u003e \n\u003cbr\u003e And painted cheeks, and the rich glistering state\n\u003cbr\u003e \n\u003cbr\u003e Of jewel-sprinkled locks — But where are they,\n\u003cbr\u003e \n\u003cbr\u003e The graceless haughty ones that used to wait\n\u003cbr\u003e \n\u003cbr\u003e With lofty neck, and nods, and stiffen’d eye? —\n\u003cbr\u003e \n\u003cbr\u003e None challenge the old homage bending by.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e 24.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e \n\u003cbr\u003e In vain they look for the ungracious bloom\n\u003cbr\u003e \n\u003cbr\u003e Of rich apparel where it glow’d before —\n\u003cbr\u003e \n\u003cbr\u003e For Vanity has faded all to gloom,\n\u003cbr\u003e \n\u003cbr\u003e And lofty Pride has stiffen’d to the core,\n\u003cbr\u003e \n\u003cbr\u003e For impious Life to tremble at its doom —\n\u003cbr\u003e \n\u003cbr\u003e Set for a warning token evermore,\n\u003cbr\u003e \n\u003cbr\u003e Whereon, as now, the giddy and the wise\n\u003cbr\u003e \n\u003cbr\u003e Shall gaze with lifted hands and wond’ring eyes.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e 25.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e \n\u003cbr\u003e The aged priest goes on each Sabbath morn,\n\u003cbr\u003e \n\u003cbr\u003e But shakes not sorrow under his gray hair;\n\u003cbr\u003e \n\u003cbr\u003e The solemn clerk goes lavender’d and shorn\n\u003cbr\u003e \n\u003cbr\u003e Nor stoops his back to the ungodly pair; —\n\u003cbr\u003e \n\u003cbr\u003e And ancient lips that pucker’d up in scorn,\n\u003cbr\u003e \n\u003cbr\u003e Go smoothly breathing to the house of pray’r;\n\u003cbr\u003e \n\u003cbr\u003e And in the garden-plot, from day to day,\n\u003cbr\u003e \n\u003cbr\u003e The lily blooms its long white life away.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e 26.\n\u003cbr\u003e \n\u003cbr\u003e To feast on feathers, and on vain array\n\u003cbr\u003e \n\u003cbr\u003e And where two haughty maidens used to be,\n\u003cbr\u003e \n\u003cbr\u003e In pride of plume, where plumy Death had trod,\n\u003cbr\u003e \n\u003cbr\u003e Trailing their gorgeous velvets wantonly,\n\u003cbr\u003e \n\u003cbr\u003e Most unmeet pall, over the holy sod;\n\u003cbr\u003e \n\u003cbr\u003e There, gentle stranger, thou may’st only see\n\u003cbr\u003e \n\u003cbr\u003e Two sombre Peacocks.\n\u003cbr\u003e \n\u003cbr\u003e Age, with sapient nod\n\u003cbr\u003e \n\u003cbr\u003e Marking the spot, still tarries to declare\n\u003cbr\u003e \n\u003cbr\u003e How they once lived, and wherefore they are there.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/36782.html","bookId":111,"creation":"Aug 1, 2019 4:00:12 AM","modification":"Aug 1, 2019 4:00:12 AM"}
