{"id":2730,"no":99,"title":"Bianca’s Dream.","content":"A Venetian Story.\n\u003cbr\u003e 1.\n\u003cbr\u003e \n\u003cbr\u003e Bianca! — fair Bianca! — who could dwell\n\u003cbr\u003e \n\u003cbr\u003e With safety on her dark and hazel gaze,\n\u003cbr\u003e \n\u003cbr\u003e Nor find there lurk’d in it a witching spell,\n\u003cbr\u003e \n\u003cbr\u003e Fatal to balmy nights and blessed days?\n\u003cbr\u003e \n\u003cbr\u003e The peaceful breath that made the bosom swell,\n\u003cbr\u003e \n\u003cbr\u003e She turn’d to gas, and set it in a blaze;\n\u003cbr\u003e \n\u003cbr\u003e Each eye of hers had Love’s Eupyrion in it,\n\u003cbr\u003e \n\u003cbr\u003e That he could light his link at in a minute.\n\u003cbr\u003e 2.\n\u003cbr\u003e \n\u003cbr\u003e So that, wherever in her charms she shone,\n\u003cbr\u003e \n\u003cbr\u003e A thousand breasts were kindled into flame;\n\u003cbr\u003e \n\u003cbr\u003e Maidens who cursed her looks forgot their own,\n\u003cbr\u003e \n\u003cbr\u003e And beaux were turn’d to flambeaux where she came;\n\u003cbr\u003e \n\u003cbr\u003e All hearts indeed were conquer’d but her own,\n\u003cbr\u003e \n\u003cbr\u003e Which none could ever temper down or tame:\n\u003cbr\u003e \n\u003cbr\u003e In short, to take our haberdasher’s hints,\n\u003cbr\u003e \n\u003cbr\u003e She might have written over it — “from Flints.”\n\u003cbr\u003e 3.\n\u003cbr\u003e \n\u003cbr\u003e She was, in truth, the wonder of her sex,\n\u003cbr\u003e \n\u003cbr\u003e At least in Venice — where with eyes of brown\n\u003cbr\u003e \n\u003cbr\u003e Tenderly languid, ladies seldom vex\n\u003cbr\u003e \n\u003cbr\u003e An amorous gentle with a needless frown;\n\u003cbr\u003e \n\u003cbr\u003e Where gondolas convey guitars by pecks,\n\u003cbr\u003e \n\u003cbr\u003e And Love at casements climbeth up and down,\n\u003cbr\u003e \n\u003cbr\u003e Whom for his tricks and custom in that kind,\n\u003cbr\u003e \n\u003cbr\u003e Some have considered a Venetian blind.\n\u003cbr\u003e 4.\n\u003cbr\u003e \n\u003cbr\u003e Howbeit, this difference was quickly taught,\n\u003cbr\u003e \n\u003cbr\u003e Amongst more youths who had this cruel jailer,\n\u003cbr\u003e \n\u003cbr\u003e To hapless Julio — all in vain he sought\n\u003cbr\u003e \n\u003cbr\u003e With each new moon his hatter and his tailor;\n\u003cbr\u003e \n\u003cbr\u003e In vain the richest padusoy he bought,\n\u003cbr\u003e \n\u003cbr\u003e And went in bran new beaver to assail her —\n\u003cbr\u003e \n\u003cbr\u003e As if to show that Love had made him smart\n\u003cbr\u003e \n\u003cbr\u003e All over — and not merely round his heart.\n\u003cbr\u003e 5.\n\u003cbr\u003e \n\u003cbr\u003e In vain he labor’d thro’ the sylvan park\n\u003cbr\u003e \n\u003cbr\u003e Bianca haunted in — that where she came,\n\u003cbr\u003e \n\u003cbr\u003e Her learned eyes in wandering might mark\n\u003cbr\u003e \n\u003cbr\u003e The twisted cypher of her maiden name,\n\u003cbr\u003e \n\u003cbr\u003e Wholesomely going thro’ a course of bark:\n\u003cbr\u003e \n\u003cbr\u003e No one was touched or troubled by his flame,\n\u003cbr\u003e \n\u003cbr\u003e Except the Dryads, those old maids that grow\n\u003cbr\u003e \n\u003cbr\u003e In trees — like wooden dolls in embryo.\n\u003cbr\u003e 6.\n\u003cbr\u003e \n\u003cbr\u003e In vain complaining elegies he writ,\n\u003cbr\u003e \n\u003cbr\u003e And taught his tuneful instrument to grieve,\n\u003cbr\u003e \n\u003cbr\u003e And sang in quavers how his heart was split,\n\u003cbr\u003e \n\u003cbr\u003e Constant beneath her lattice with each eve;\n\u003cbr\u003e \n\u003cbr\u003e She mock’d his wooing with her wicked wit,\n\u003cbr\u003e \n\u003cbr\u003e And slash’d his suit so that it matched his sleeve,\n\u003cbr\u003e \n\u003cbr\u003e Till he grew silent at the vesper star,\n\u003cbr\u003e \n\u003cbr\u003e And, quite despairing, hamstring’d his guitar.\n\u003cbr\u003e 7.\n\u003cbr\u003e \n\u003cbr\u003e Bianca’s heart was coldly frosted o’er\n\u003cbr\u003e \n\u003cbr\u003e With snows unmelting — an eternal sheet,\n\u003cbr\u003e \n\u003cbr\u003e But his was red within him, like the core\n\u003cbr\u003e \n\u003cbr\u003e Of old Vesuvius, with perpetual heat;\n\u003cbr\u003e \n\u003cbr\u003e And oft he longed internally to pour\n\u003cbr\u003e \n\u003cbr\u003e His flames and glowing lava at her feet,\n\u003cbr\u003e \n\u003cbr\u003e But when his burnings he began to spout.\n\u003cbr\u003e \n\u003cbr\u003e She stopp’d his mouth, and put the crater out.\n\u003cbr\u003e 8.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile he wasted in the eyes of men,\n\u003cbr\u003e \n\u003cbr\u003e So thin, he seem’d a sort of skeleton-key\n\u003cbr\u003e \n\u003cbr\u003e Suspended at death’s door — so pale — and then\n\u003cbr\u003e \n\u003cbr\u003e He turn’d as nervous as an aspen tree;\n\u003cbr\u003e \n\u003cbr\u003e The life of man is three score years and ten,\n\u003cbr\u003e \n\u003cbr\u003e But he was perishing at twenty-three,\n\u003cbr\u003e \n\u003cbr\u003e For people truly said, as grief grew stronger,\n\u003cbr\u003e \n\u003cbr\u003e “It could not shorten his poor life — much longer.”\n\u003cbr\u003e 9.\n\u003cbr\u003e \n\u003cbr\u003e For why, he neither slept, nor drank, nor fed,\n\u003cbr\u003e \n\u003cbr\u003e Nor relished any kind of mirth below;\n\u003cbr\u003e \n\u003cbr\u003e Fire in his heart, and frenzy in his head,\n\u003cbr\u003e \n\u003cbr\u003e Love had become his universal foe,\n\u003cbr\u003e \n\u003cbr\u003e Salt in his sugar — nightmare in his bed,\n\u003cbr\u003e \n\u003cbr\u003e At last, no wonder wretched Julio,\n\u003cbr\u003e \n\u003cbr\u003e A sorrow-ridden thing, in utter dearth\n\u003cbr\u003e \n\u003cbr\u003e Of hope — made up his mind to cut her girth!\n\u003cbr\u003e 10.\n\u003cbr\u003e \n\u003cbr\u003e For hapless lovers always died of old,\n\u003cbr\u003e \n\u003cbr\u003e Sooner than chew reflection’s bitter cud;\n\u003cbr\u003e \n\u003cbr\u003e So Thisbe stuck herself, what time ’tis told,\n\u003cbr\u003e \n\u003cbr\u003e The tender-hearted mulberries wept blood;\n\u003cbr\u003e \n\u003cbr\u003e And so poor Sappho when her boy was cold,\n\u003cbr\u003e \n\u003cbr\u003e Drown’d her salt tear drops in a salter flood,\n\u003cbr\u003e \n\u003cbr\u003e Their fame still breathing, tho’ their breath be past,\n\u003cbr\u003e \n\u003cbr\u003e For those old suitors lived beyond their last.\n\u003cbr\u003e 11.\n\u003cbr\u003e \n\u003cbr\u003e So Julio went to drown — when life was dull,\n\u003cbr\u003e \n\u003cbr\u003e But took his corks, and merely had a bath;\n\u003cbr\u003e \n\u003cbr\u003e And once he pull’d a trigger at his skull,\n\u003cbr\u003e \n\u003cbr\u003e But merely broke a window in his wrath;\n\u003cbr\u003e \n\u003cbr\u003e And once, his hopeless being to annul,\n\u003cbr\u003e \n\u003cbr\u003e He tied a pack-thread to a beam of lath,\n\u003cbr\u003e \n\u003cbr\u003e A line so ample, ’twas a query whether\n\u003cbr\u003e \n\u003cbr\u003e ’Twas meant to be a halter or a tether.\n\u003cbr\u003e 12.\n\u003cbr\u003e \n\u003cbr\u003e Smile not in scorn, that Julio did not thrust\n\u003cbr\u003e \n\u003cbr\u003e His sorrows thro’—’tis horrible to die!\n\u003cbr\u003e \n\u003cbr\u003e And come down, with our little all of dust,\n\u003cbr\u003e \n\u003cbr\u003e That dun of all the duns to satisfy:\n\u003cbr\u003e \n\u003cbr\u003e To leave life’s pleasant city as we must,\n\u003cbr\u003e \n\u003cbr\u003e In Death’s most dreary spunging-house to lie,\n\u003cbr\u003e \n\u003cbr\u003e Where even all our personals must go\n\u003cbr\u003e \n\u003cbr\u003e To pay the debt of nature that we owe!\n\u003cbr\u003e 13.\n\u003cbr\u003e \n\u003cbr\u003e So Julio liv’d:—’twas nothing but a pet\n\u003cbr\u003e \n\u003cbr\u003e He took at life — a momentary spite;\n\u003cbr\u003e \n\u003cbr\u003e Besides, he hoped that time would some day get\n\u003cbr\u003e \n\u003cbr\u003e The better of love’s flame, howover bright;\n\u003cbr\u003e \n\u003cbr\u003e A thing that time has never compass’d yet,\n\u003cbr\u003e \n\u003cbr\u003e For love, we know, is an immortal light.\n\u003cbr\u003e \n\u003cbr\u003e Like that old fire, that, quite beyond a doubt,\n\u003cbr\u003e \n\u003cbr\u003e Was always in — for none have found it out.\n\u003cbr\u003e 14.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, Bianca dream’d —’twas once when Night\n\u003cbr\u003e \n\u003cbr\u003e Along the darken’d plain began to creep,\n\u003cbr\u003e \n\u003cbr\u003e Like a young Hottentot, whose eyes are bright,\n\u003cbr\u003e \n\u003cbr\u003e Altho’ in skin as sooty as a sweep:\n\u003cbr\u003e \n\u003cbr\u003e The flow’rs had shut their eyes — the zephyr light\n\u003cbr\u003e \n\u003cbr\u003e Was gone, for it had rock’d the leaves to sleep.\n\u003cbr\u003e \n\u003cbr\u003e And all the little birds had laid their heads\n\u003cbr\u003e \n\u003cbr\u003e Under their wings — sleeping in feather beds.\n\u003cbr\u003e 15.\n\u003cbr\u003e \n\u003cbr\u003e Lone in her chamber sate the dark-ey’d maid,\n\u003cbr\u003e \n\u003cbr\u003e By easy stages jaunting thro’ her pray’rs,\n\u003cbr\u003e \n\u003cbr\u003e But list’ning side-long to a serenade,\n\u003cbr\u003e \n\u003cbr\u003e That robb’d the saints a little of their shares;\n\u003cbr\u003e \n\u003cbr\u003e For Julio underneath the lattice play’d\n\u003cbr\u003e \n\u003cbr\u003e His Deh Vieni, and such amorous airs,\n\u003cbr\u003e \n\u003cbr\u003e Born only underneath Italian skies,\n\u003cbr\u003e \n\u003cbr\u003e Where every fiddle has a Bridge of Sighs.\n\u003cbr\u003e 16.\n\u003cbr\u003e \n\u003cbr\u003e Sweet was the tune — the words were even sweeter —\n\u003cbr\u003e \n\u003cbr\u003e Praising her eyes, her lips, her nose, her hair,\n\u003cbr\u003e \n\u003cbr\u003e With all the common tropes wherewith in metre\n\u003cbr\u003e \n\u003cbr\u003e The hackney poets overcharge their fair.\n\u003cbr\u003e \n\u003cbr\u003e Her shape was like Diana’s, but completer;\n\u003cbr\u003e \n\u003cbr\u003e Her brow with Grecian Helen’s might compare:\n\u003cbr\u003e \n\u003cbr\u003e Cupid, alas! was cruel Sagittarius,\n\u003cbr\u003e \n\u003cbr\u003e Julio — the weeping water-man Aquarius.\n\u003cbr\u003e 17.\n\u003cbr\u003e \n\u003cbr\u003e Now, after listing to such laudings rare,\n\u003cbr\u003e \n\u003cbr\u003e ’Twas very natural indeed to go —\n\u003cbr\u003e \n\u003cbr\u003e What if she did postpone one little pray’r —\n\u003cbr\u003e \n\u003cbr\u003e To ask her mirror “if it was not so?”\n\u003cbr\u003e \n\u003cbr\u003e ’Twas a large mirror, none the worse for wear,\n\u003cbr\u003e \n\u003cbr\u003e Reflecting her at once from top to toe:\n\u003cbr\u003e \n\u003cbr\u003e And there she gazed upon that glossy track,\n\u003cbr\u003e \n\u003cbr\u003e That show’d her front face tho’ it “gave her back.”\n\u003cbr\u003e 18.\n\u003cbr\u003e \n\u003cbr\u003e And long her lovely eyes were held in thrall,\n\u003cbr\u003e \n\u003cbr\u003e By that dear page where first the woman reads:\n\u003cbr\u003e \n\u003cbr\u003e That Julio was no flatt’rer, none at all,\n\u003cbr\u003e \n\u003cbr\u003e She told herself — and then she told her beads;\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, the nerves insensibly let fall\n\u003cbr\u003e \n\u003cbr\u003e Two curtains fairer than the lily breeds;\n\u003cbr\u003e \n\u003cbr\u003e For Sleep had crept and kiss’d her unawares,\n\u003cbr\u003e \n\u003cbr\u003e Just at the half-way milestone of her pray’rs.\n\u003cbr\u003e 19.\n\u003cbr\u003e \n\u003cbr\u003e Then like a drooping rose so bended she,\n\u003cbr\u003e \n\u003cbr\u003e Till her bow’d head upon her hand reposed;\n\u003cbr\u003e \n\u003cbr\u003e But still she plainly saw, or seem’d to see,\n\u003cbr\u003e \n\u003cbr\u003e That fair reflection, tho’ her eyes were closed,\n\u003cbr\u003e \n\u003cbr\u003e A beauty-bright as it was wont to be,\n\u003cbr\u003e \n\u003cbr\u003e A portrait Fancy painted while she dozed:\n\u003cbr\u003e \n\u003cbr\u003e ’Tis very natural some people say,\n\u003cbr\u003e \n\u003cbr\u003e To dream of what we dwell on in the day.\n\u003cbr\u003e 20.\n\u003cbr\u003e \n\u003cbr\u003e Still shone her face — yet not, alas! the same,\n\u003cbr\u003e \n\u003cbr\u003e But ‘gan some dreary touches to assume,\n\u003cbr\u003e \n\u003cbr\u003e And sadder thoughts, with sadder changes came —\n\u003cbr\u003e \n\u003cbr\u003e Her eyes resigned their light, her lips their bloom,\n\u003cbr\u003e \n\u003cbr\u003e Her teeth fell out, her tresses did the same,\n\u003cbr\u003e \n\u003cbr\u003e Her cheeks were tinged with bile, her eyes with rheum:\n\u003cbr\u003e \n\u003cbr\u003e There was a throbbing at her heart within,\n\u003cbr\u003e \n\u003cbr\u003e For, oh! there was a shooting in her chin.\n\u003cbr\u003e 21.\n\u003cbr\u003e \n\u003cbr\u003e And lo! upon her sad desponding brow,\n\u003cbr\u003e \n\u003cbr\u003e The cruel trenches of besieging age,\n\u003cbr\u003e \n\u003cbr\u003e With seams, but most unseemly, ‘gan to show\n\u003cbr\u003e \n\u003cbr\u003e Her place was booking for the seventh stage;\n\u003cbr\u003e \n\u003cbr\u003e And where her raven tresses used to flow,\n\u003cbr\u003e \n\u003cbr\u003e Some locks that Time had left her in his rage.\n\u003cbr\u003e \n\u003cbr\u003e And some mock ringlets, made her forehead shady,\n\u003cbr\u003e \n\u003cbr\u003e A compound (like our Psalms) of tête and braidy.\n\u003cbr\u003e 22.\n\u003cbr\u003e \n\u003cbr\u003e Then for her shape — alas! how Saturn wrecks,\n\u003cbr\u003e \n\u003cbr\u003e And bends, and corkscrews all the frame about,\n\u003cbr\u003e \n\u003cbr\u003e Doubles the hams, and crooks the straightest necks,\n\u003cbr\u003e \n\u003cbr\u003e Draws in the nape, and pushes forth the snout,\n\u003cbr\u003e \n\u003cbr\u003e Makes backs and stomachs concave or convex:\n\u003cbr\u003e \n\u003cbr\u003e Witness those pensioners called In and Out,\n\u003cbr\u003e \n\u003cbr\u003e Who all day watching first and second rater,\n\u003cbr\u003e \n\u003cbr\u003e Quaintly unbend themselves — but grow no straighter.\n\u003cbr\u003e 23.\n\u003cbr\u003e \n\u003cbr\u003e So Time with fair Bianca dealt, and made\n\u003cbr\u003e \n\u003cbr\u003e Her shape a bow, that once was like an arrow;\n\u003cbr\u003e \n\u003cbr\u003e His iron hand upon her spine he laid,\n\u003cbr\u003e \n\u003cbr\u003e And twisted all awry her “winsome marrow.”\n\u003cbr\u003e \n\u003cbr\u003e In truth it was a change! — she had obey’d\n\u003cbr\u003e \n\u003cbr\u003e The holy Pope before her chest grew narrow,\n\u003cbr\u003e \n\u003cbr\u003e But spectacles and palsy seem’d to make her\n\u003cbr\u003e \n\u003cbr\u003e Something between a Glassite and a Quaker.\n\u003cbr\u003e 24.\n\u003cbr\u003e \n\u003cbr\u003e Her grief and gall meanwhile were quite extreme,\n\u003cbr\u003e \n\u003cbr\u003e And she had ample reason for her trouble;\n\u003cbr\u003e \n\u003cbr\u003e For what sad maiden can endure to seem\n\u003cbr\u003e \n\u003cbr\u003e Set in for singleness, tho’ growing double.\n\u003cbr\u003e \n\u003cbr\u003e The fancy madden’d her; but now the dream,\n\u003cbr\u003e \n\u003cbr\u003e Grown thin by getting bigger, like a bubble,\n\u003cbr\u003e \n\u003cbr\u003e Burst — but still left some fragments of its size,\n\u003cbr\u003e \n\u003cbr\u003e That, like the soapsuds, smarted in her eyes.\n\u003cbr\u003e 25.\n\u003cbr\u003e \n\u003cbr\u003e And here — just here — as she began to heed\n\u003cbr\u003e \n\u003cbr\u003e The real world, her clock chimed out its score;\n\u003cbr\u003e \n\u003cbr\u003e A clock it was of the Venetian breed,\n\u003cbr\u003e \n\u003cbr\u003e That cried the hour from one to twenty-four;\n\u003cbr\u003e \n\u003cbr\u003e The works moreover standing in some need\n\u003cbr\u003e \n\u003cbr\u003e Of workmanship, it struck some dozens more;\n\u003cbr\u003e \n\u003cbr\u003e A warning voice that clench’d Bianca’s fears,\n\u003cbr\u003e \n\u003cbr\u003e Such strokes referring doubtless to her years.\n\u003cbr\u003e 26.\n\u003cbr\u003e \n\u003cbr\u003e At fifteen chimes she was but half a nun,\n\u003cbr\u003e \n\u003cbr\u003e By twenty she had quite renounced the veil;\n\u003cbr\u003e \n\u003cbr\u003e She thought of Julio just at twenty-one,\n\u003cbr\u003e \n\u003cbr\u003e And thirty made her very sad and pale,\n\u003cbr\u003e \n\u003cbr\u003e To paint that ruin where her charms would run;\n\u003cbr\u003e \n\u003cbr\u003e At forty all the maid began to fail,\n\u003cbr\u003e \n\u003cbr\u003e And thought no higher, as the late dream cross’d her,\n\u003cbr\u003e \n\u003cbr\u003e Of single blessedness, than single Gloster.\n\u003cbr\u003e 27.\n\u003cbr\u003e \n\u003cbr\u003e And so Bianca changed; — the next sweet even,\n\u003cbr\u003e \n\u003cbr\u003e With Julio in a black Venetian bark,\n\u003cbr\u003e \n\u003cbr\u003e Row’d slow and stealthily — the hour, eleven,\n\u003cbr\u003e \n\u003cbr\u003e Just sounding from the tow’r of old St. Mark;\n\u003cbr\u003e \n\u003cbr\u003e She sate with eyes turn’d quietly to heav’n,\n\u003cbr\u003e \n\u003cbr\u003e Perchance rejoicing in the grateful dark\n\u003cbr\u003e \n\u003cbr\u003e That veil’d her blushing cheek — for Julio brought her\n\u003cbr\u003e \n\u003cbr\u003e Of course — to break the ice upon the water.\n\u003cbr\u003e 28.\n\u003cbr\u003e \n\u003cbr\u003e But what a puzzle is one’s serious mind\n\u003cbr\u003e \n\u003cbr\u003e To open; — oysters, when the ice is thick,\n\u003cbr\u003e \n\u003cbr\u003e Are not so difficult and disinclin’d;\n\u003cbr\u003e \n\u003cbr\u003e And Julio felt the declaration stick\n\u003cbr\u003e \n\u003cbr\u003e About his throat in a most awful kind;\n\u003cbr\u003e \n\u003cbr\u003e However, he contrived by bits to pick\n\u003cbr\u003e \n\u003cbr\u003e His trouble forth — much like a rotten cork\n\u003cbr\u003e \n\u003cbr\u003e Grop’d from a long-necked bottle with a fork.\n\u003cbr\u003e 29.\n\u003cbr\u003e \n\u003cbr\u003e But love is still the quickest of all readers;\n\u003cbr\u003e \n\u003cbr\u003e And Julio spent besides those signs profuse\n\u003cbr\u003e \n\u003cbr\u003e That English telegraphs and foreign pleaders,\n\u003cbr\u003e \n\u003cbr\u003e In help of language, are so apt to use,\n\u003cbr\u003e \n\u003cbr\u003e Arms, shoulders, fingers, all were interceders,\n\u003cbr\u003e \n\u003cbr\u003e Nods, shrugs, and bends — Bianca could not choose\n\u003cbr\u003e \n\u003cbr\u003e But soften to his suit with more facility,\n\u003cbr\u003e \n\u003cbr\u003e He told his story with so much agility.\n\u003cbr\u003e 30.\n\u003cbr\u003e \n\u003cbr\u003e “Be thou my park, and I will be thy dear,\n\u003cbr\u003e \n\u003cbr\u003e (So he began at last to speak or quote;)\n\u003cbr\u003e \n\u003cbr\u003e Be thou my bark, and I thy gondolier,\n\u003cbr\u003e \n\u003cbr\u003e (For passion takes this figurative note;)\n\u003cbr\u003e \n\u003cbr\u003e Be thou my light, and I thy chandelier;\n\u003cbr\u003e \n\u003cbr\u003e Be thou my dove, and I will be thy cote:\n\u003cbr\u003e \n\u003cbr\u003e My lily be, and I will be thy river;\n\u003cbr\u003e \n\u003cbr\u003e Be thou my life — and I will be thy liver.”\n\u003cbr\u003e 31.\n\u003cbr\u003e \n\u003cbr\u003e This, with more tender logic of the kind,\n\u003cbr\u003e \n\u003cbr\u003e He pour’d into her small and shell-like ear,\n\u003cbr\u003e \n\u003cbr\u003e That timidly against his lips inclin’d;\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile her eyes glanced on the silver sphere\n\u003cbr\u003e \n\u003cbr\u003e That even now began to steal behind\n\u003cbr\u003e \n\u003cbr\u003e A dewy vapor, which was lingering near,\n\u003cbr\u003e \n\u003cbr\u003e Wherein the dull moon crept all dim and pale,\n\u003cbr\u003e \n\u003cbr\u003e Just like a virgin putting on the veil:—\n\u003cbr\u003e 32.\n\u003cbr\u003e \n\u003cbr\u003e Bidding adieu to all her sparks — the stars,\n\u003cbr\u003e \n\u003cbr\u003e That erst had woo’d and worshipp’d in her train,\n\u003cbr\u003e \n\u003cbr\u003e Saturn and Hesperus, and gallant Mars —\n\u003cbr\u003e \n\u003cbr\u003e Never to flirt with heavenly eyes again.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, remindful of the convent bars,\n\u003cbr\u003e \n\u003cbr\u003e Bianca did not watch these signs in vain,\n\u003cbr\u003e \n\u003cbr\u003e But turn’d to Julio at the dark eclipse,\n\u003cbr\u003e \n\u003cbr\u003e With words, like verbal kisses, on her lips.\n\u003cbr\u003e 33.\n\u003cbr\u003e \n\u003cbr\u003e He took the hint full speedily, and, back’d\n\u003cbr\u003e \n\u003cbr\u003e By love, and night, and the occasion’s meetness,\n\u003cbr\u003e \n\u003cbr\u003e Bestow’d a something on her cheek that smack’d\n\u003cbr\u003e \n\u003cbr\u003e (Tho’ quite in silence) of ambrosial sweetness;\n\u003cbr\u003e \n\u003cbr\u003e That made her think all other kisses lack’d\n\u003cbr\u003e \n\u003cbr\u003e Till then, but what she knew not, of completeness;\n\u003cbr\u003e \n\u003cbr\u003e Being used but sisterly salutes to feel,\n\u003cbr\u003e \n\u003cbr\u003e Insipid things — like sandwiches of veal.\n\u003cbr\u003e 34.\n\u003cbr\u003e \n\u003cbr\u003e He took her hand, and soon she felt him wring\n\u003cbr\u003e \n\u003cbr\u003e The pretty fingers all instead of one;\n\u003cbr\u003e \n\u003cbr\u003e Anon his stealthy arm began to cling\n\u003cbr\u003e \n\u003cbr\u003e About her waist that had been clasp’d by none,\n\u003cbr\u003e \n\u003cbr\u003e Their dear confessions I forbear to sing,\n\u003cbr\u003e \n\u003cbr\u003e Since cold description would but be outrun;\n\u003cbr\u003e \n\u003cbr\u003e For bliss and Irish watches have the pow’r,\n\u003cbr\u003e \n\u003cbr\u003e In twenty minutes, to lose half an hour!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1223/37310.html","bookId":111,"creation":"Aug 1, 2019 4:04:27 AM","modification":"Aug 1, 2019 4:04:27 AM"}
