{"id":26221,"no":18,"title":"Chapter 18","content":"I texted Gene from the taxi. It was 1.08 a.m. but he had leftthe ball at the same time as I did, and had further to travel.\n\u003cbr\u003e Urgent: Run tomorrow 6 a.m. Gene texted back: Sunday at8: Bring Bianca’s contact info. I was about to insist on theearlier date when I realised that I could profitably use the timeto organise my thoughts.\n\u003cbr\u003e It seemed obvious that Rosie had invited me to have sex withher. I was right to have avoided the situation. We had bothdrunk a substantial quantity of Champagne, and alcohol isnotorious for encouraging unwise decisions about sex. Rosie hadthe perfect example. Her mother’s decision, doubtless promptedby alcohol, was still causing Rosie significant distress.\n\u003cbr\u003e My own sexual experience was limited. Gene had advised thatit was conventional to wait until the third date, and myrelationships had never progressed beyond the first. In fact,Rosie and I had technically had only one date – the night ofthe Jacket Incident and the Balcony Meal.\n\u003cbr\u003e 152/290I did not use the services of brothels, not for any moralreason, but because I found the idea distasteful. This was not arational reason, but, since the benefits I was seeking were onlyprimitive, a primitive reason was sufficient.\n\u003cbr\u003e But I now seemed to have an opportunity for what Genewould call‘no-strings-attached sex’. The required conditions were in place:\n\u003cbr\u003e Rosie and I had clearly agreed that neither of us had aninterest in a romantic relationship, then Rosie had indicated thatshe wanted to have sex with me. Did I want to have sex withRosie? There seemed no logical reason not to, leaving me freeto obey the dictates of my primitive desires. The answer wasan extremely clear yes. Having made this completely rationaldecision, I could think of nothing else.\n\u003cbr\u003e On Sunday morning, Gene met me outside his house. I hadbrought Bianca’s contact details and checked her nationality –Panamanian.\n\u003cbr\u003e Gene was very pleased about the latter.\n\u003cbr\u003e Gene wanted full details of my encounter with Rosie, but I haddecided it was a waste of effort to explain it twice: I would tellhim and Claudia together. As I had no other subject to discussand Gene had difficulty in running and speaking concurrently,we spent the next forty-seven minutes in silence.\n\u003cbr\u003e When we returned to Gene’s house, Claudia and Eugenie werehaving breakfast.\n\u003cbr\u003e I sat down and said, ‘I require some advice.’\n\u003cbr\u003e ‘Can it wait?’ said Claudia. ‘We have to take Eugenie tohorseriding and then we’re meeting people for brunch.’\n\u003cbr\u003e ‘No. I may have made a social error. I broke one of Gene’srules.’\n\u003cbr\u003e Gene said, ‘Don, I think the Panamanian bird has flown. Putthat one down to experience.’\n\u003cbr\u003e ‘The rule applies to Rosie, not Bianca. Never pass up a chanceto have sex with a woman under thirty.’\n\u003cbr\u003e ‘Gene told you that?’ said Claudia.\n\u003cbr\u003e 153/290Carl had entered the room and I prepared to defend myselfagainst his ritual attack, but he stopped to look at his father.\n\u003cbr\u003e ‘I thought I should consult with you because you’re apsychologist and with Gene because of his extensive practicalexperience,’ I said.\n\u003cbr\u003e Gene looked at Claudia, then at Carl.\n\u003cbr\u003e ‘In my misspent youth,’ he said. ‘ Not my teens.’ He turnedback to me. ‘I think this can wait till lunch tomorrow.’\n\u003cbr\u003e ‘What about Claudia?’ I asked.\n\u003cbr\u003e Claudia got up from the table. ‘I’m sure there’s nothing Genedoesn’t know.’\n\u003cbr\u003e This was encouraging, especially coming from his wife.\n\u003cbr\u003e ‘You said what?’ said Gene. We were having lunch in theUniversity Club as scheduled.\n\u003cbr\u003e ‘I said that I hadn’t noticed her appearance. I didn’t want herto think I saw her as a sexual object.’\n\u003cbr\u003e ‘Jesus,’ said Gene. ‘The one time you think before you speak isthe one time you shouldn’t have.’\n\u003cbr\u003e ‘I should have said she was beautiful?’ I was incredulous.\n\u003cbr\u003e ‘Got it in one,’ said Gene, incorrectly, as the problem was thatI hadn’t got it right the first time. ‘That’ll explain the cake.’\n\u003cbr\u003e I must have looked blank. For obvious reasons.\n\u003cbr\u003e ‘She’s been eating chocolate cake. At her desk. For breakfast.’\n\u003cbr\u003e This seemed to me to be an unhealthy choice, consistent withsmoking, but not an indicator of distress. But Gene assured methat it was to make herself feel better.\n\u003cbr\u003e Having supplied Gene with the necessary backgroundinformation, I presented my problem.\n\u003cbr\u003e ‘You’re saying she’s not The One,’ said Gene. ‘Not a lifepartner.’\n\u003cbr\u003e 154/290‘Totally unsuitable. But she’s extremely attractive. If I’m going tohave uncommitted sex with anyone, she’s the perfect candidate.\n\u003cbr\u003e She has no emotional attachment to me either.’\n\u003cbr\u003e ‘So why the stress?’ said Gene. ‘You have had sex before?’\n\u003cbr\u003e ‘Of course,’ I said. ‘My doctor is strongly in favour.’\n\u003cbr\u003e ‘Frontiers of medical science,’ said Gene.\n\u003cbr\u003e He was probably making a joke. I think the value of regularsex has been known for some time.\n\u003cbr\u003e I explained further. ‘It’s just that adding a second personmakes it more complicated.’\n\u003cbr\u003e ‘Naturally,’ said Gene. ‘I should have thought of that. Why notget a book?’\n\u003cbr\u003e The information was available on the internet, but a fewminutes of examining the search results on ‘sexual positions’\n\u003cbr\u003e convinced me that the book option would provide a morerelevant tutorial with less extraneous information.\n\u003cbr\u003e I had no difficulty finding a suitable book and, back in myoffice, selected a random position. It was called the ReverseCowboy Position (Variant 2). I tried it – simple. But, as I hadpointed out to Gene, the problem was the involvement of thesecond person. I got the skeleton from the closet and arrangedit on top of me, following the diagram in the book.\n\u003cbr\u003e There is a rule at the university that no one opens a doorwithout knocking first. Gene violates it in my case but we aregood friends. I do not consider the Dean my friend. It was anembarrassing moment, especially as the Dean was accompaniedby another person, but entirely her fault. It was fortunate thatI had kept my clothes on.\n\u003cbr\u003e ‘Don,’ she said, ‘if you can leave off repairing that skeleton fora moment, I’d like you to meet Dr Peter Enticott from theMedical Research Council. I mentioned your work in cirrhosisand he was keen to meet155/290you. To consider a funding package.’ She emphasised the lasttwo words as though I was so unconnected with universitypolitics that I might forget that funding was the centre of herworld. She was right to do so.\n\u003cbr\u003e I recognised Peter instantly. He was the former father candidatewho worked at Deakin University, and who had prompted thecup-stealing incident. He also recognised me.\n\u003cbr\u003e ‘Don and I have met,’ he said. ‘His partner is consideringapplying for the MD programme. And we met recently at asocial occasion.’ He winked at me. ‘I don’t think you’re payingyour academic staff enough.’\n\u003cbr\u003e We had an excellent discussion about my work with alcoholicmice.\n\u003cbr\u003e Peter seemed highly interested and I had to reassure himrepeatedly that I had designed the research so there was noneed for external grants. The Dean was making hand signalsand contorting her face, and I guessed that she wanted me tomisrepresent my study as requiring funding, so that she coulddivert the money to some project that would not be funded onits merits. I chose to feign a lack of comprehension, but thishad the effect of increasing the intensity of the Dean’ssignalling. It was only afterwards that I realised that I shouldnot have left the sexual positions book open on the floor.\n\u003cbr\u003e I decided that ten positions would be sufficient initially. Morecould be learned if the initial encounter was successful. It didnot take long –less time than learning the cha-cha. In terms of reward foreffort, it seemed strongly preferable to dancing and I wasgreatly looking forward to it.\n\u003cbr\u003e I went to visit Rosie in her workplace. The PhD students’ areawas a windowless space with desks along the walls. I countedeight students, including Rosie and Stefan, whose desk wasbeside Rosie’s.\n\u003cbr\u003e Stefan gave me an odd smile. I was still suspicious of him.\n\u003cbr\u003e ‘You’re all over Facebook, Don.’ He turned to Rosie. ‘You’llhave to update your relationship status.’\n\u003cbr\u003e 156/290On his screen was a spectacular photo of Rosie and medancing, similar to the one that the photographer had given meand which now sat by my computer at home. I was spinningRosie, and her facial expression indicated extreme happiness. Ihad not technically been‘tagged’ as I was not registered on Facebook (social networkingnot being an interest of mine) but our names had been addedto the photo: A/Prof Don Tillman of Genetics and RosieJarman, PhD Candidate, Psychology.\n\u003cbr\u003e ‘Don’t talk to me about it,’ said Rosie.\n\u003cbr\u003e ‘You don’t like the photo?’ This seemed a bad sign.\n\u003cbr\u003e ‘It’s Phil. I don’t want him seeing this.’\n\u003cbr\u003e Stefan said, ‘You think your father spends his life looking atFacebook?’\n\u003cbr\u003e ‘Wait till he calls,’ said Rosie. ‘ “How much does he earn?”\n\u003cbr\u003e “Are you screwing him?” “What can he bench press?” ’\n\u003cbr\u003e ‘Hardly unusual questions for a father to ask about a manwho’s dating his daughter,’ said Stefan.\n\u003cbr\u003e ‘I’m not dating Don. We shared a taxi. That’s all. Right, Don?’\n\u003cbr\u003e ‘Correct.’\n\u003cbr\u003e Rosie turned back to Stefan. ‘So you can stick your little theorywhere it fits. Permanently.’\n\u003cbr\u003e ‘I need to talk to you in private,’ I said to Rosie.\n\u003cbr\u003e She looked at me very directly. ‘I don’t think there’s anythingwe need to say in private.’\n\u003cbr\u003e This seemed odd. But presumably she and Stefan sharedinformation in the same way that Gene and I did. He hadaccompanied her to the ball.\n\u003cbr\u003e ‘I was reconsidering your offer of sex,’ I said.\n\u003cbr\u003e Stefan put his hand over his mouth. There was quite a longsilence –I would estimate six seconds.\n\u003cbr\u003e Then Rosie said, ‘Don, it was a joke. A joke.’\n\u003cbr\u003e 157/290I could make no sense of this. I could understand that shemight have changed her mind. Perhaps the problem aroundthe sexual objectification response had been fatal. But a joke?\n\u003cbr\u003e Surely I could not be so insensitive to social cues to havemissed the fact that she was joking.\n\u003cbr\u003e Yes, I could be. I had failed to detect jokes in the past.\n\u003cbr\u003e Frequently. A joke. I had been obsessing about a joke.\n\u003cbr\u003e ‘Oh. When should we meet about the other project?’\n\u003cbr\u003e Rosie looked down at her desk. ‘There is no other project.’\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1840/53300.html","bookId":1000,"creation":"Aug 3, 2019 10:37:12 PM","modification":"Aug 3, 2019 10:37:12 PM"}
