{"id":69088,"no":20,"title":"Page 20","content":"\u003cp\u003eFrank Lonergan\u0027s living room looked as if it had been struck by a miniature hurricane. All the drawers and cabinets had been pulled open and their contents had been scattered over the floor.\u003c/p\u003e\n\u003cp\u003eNick Reese watched Frank Lonergan\u0027s body being removed. He turned to Detective Steve Brown. \"Any sign of the murder weapon?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Have you talked to the neighbors?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. The apartment building is a zoo, full of monkeys. See no evil, hear no evil, speak no evil. Nada. Mrs. Lonergan is on her way back here. She heard the news on the radio. There have been a couple other robberies here in the last six months, and - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not so sure this was a robbery.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Lonergan was down at headquarters the other day to check on Paul Yerby\u0027s things. I\u0027d like to know what story Lonergan was working on. No papers in the drawers?\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"No notes?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"So either he was very neat, or someone took the trouble to clean everything out.\" Reese walked over to the work table. There was a cable dangling off the table, connected to nothing. Reese held it up. \"What\u0027s this?\"\u003c/p\u003e\n\u003cp\u003eDetective Brown walked over. \"It\u0027s a power cable for a computer. There must have been one here. That means there could be backups somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"They may have taken the computer, but Lonergan might have saved copies of his files. Let\u0027s check it out.\"\u003c/p\u003e\n\u003cp\u003eThey found the backup disk in a briefcase in Lonergan\u0027s automobile. Reese handed it to Brown.\u003c/p\u003e\n\u003cp\u003e\"I want you to take this down to headquarters. There\u0027s probably a password to get into it. Have Chris Colby look at it. He\u0027s an expert.\"\u003c/p\u003e\n\u003cp\u003eThe front door of the apartment opened and Rita Lonergan walked in. She looked pale and distraught. She stopped when she saw the men.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Lonergan?\"\u003c/p\u003e\n\u003cp\u003e\"Who are - ?\"\u003c/p\u003e\n\u003cp\u003e\"Detective Nick Reese, Homicide. This is Detective Brown.\"\u003c/p\u003e\n\u003cp\u003eRita Lonergan looked around. \"Where is - ?\"\u003c/p\u003e\n\u003cp\u003e\"We had your husband\u0027s body taken away, Mrs. Lonergan. I\u0027m terribly sorry. I know it\u0027s a bad time, but I\u0027d like to ask you a few questions.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him, and her eyes suddenly filled with fear. The last reaction Reese had expected. What was she afraid of?\u003c/p\u003e\n\u003cp\u003e\"Your husband was working on a story, wasn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003eHis voice echoed in her mind. \"I\u0027m on to something that\u0027s going to blow everybody away - and I mean people in high places. It\u0027s the most exciting story I\u0027ve ever been involved in.\"\u003c/p\u003e\n\u003cp\u003e\"Mrs. Lonergan?\"\u003c/p\u003e\n\u003cp\u003e\"I - I don\u0027t know anything.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know what assignment he was working on?\"\u003c/p\u003e\n\u003cp\u003e\"No. Frank never discussed his work with me.\"\u003c/p\u003e\n\u003cp\u003eShe was obviously lying.\u003c/p\u003e\n\u003cp\u003e\"You have no idea who might have killed him?\"\u003c/p\u003e\n\u003cp\u003eShe looked around at the open drawers and cabinets. \"It - it must have been a burglar.\"\u003c/p\u003e\n\u003cp\u003eDetective Reese and Detective Brown looked at each other.\u003c/p\u003e\n\u003cp\u003e\"If you don\u0027t mind, I\u0027d - I\u0027d like to be alone. This has been a terrible shock.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Is there anything we can do for you?\"\u003c/p\u003e\n\u003cp\u003e\"No. Just...just leave.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be back,\" Nick Reese promised.\u003c/p\u003e\n\u003cp\u003eWhen Detective Reese returned to police headquarters, he telephoned Matt Baker. \"I\u0027m investigating the Frank Lonergan murder,\" Reese said. \"Can you tell me what he was working on?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Frank was investigating the Chloe Houston killing.\"\u003c/p\u003e\n\u003cp\u003e\"I see. Did he file a story?\"\u003c/p\u003e\n\u003cp\u003e\"No. We were waiting for it, when - \" He stopped.\u003c/p\u003e\n\u003cp\u003e\"Right. Thank you, Mr. Baker.\"\u003c/p\u003e\n\u003cp\u003e\"If you get any information, will you let me know?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be the first,\" Reese assured him.\u003c/p\u003e\n\u003cp\u003eThe following morning, Dana Evans went into Tom Hawkins\u0027s office. \"I want to do a story on Frank\u0027s death. I\u0027d like to go see his widow.\"\u003c/p\u003e\n\u003cp\u003e\"Good idea. I\u0027ll arrange for a camera crew.\"\u003c/p\u003e\n\u003cp\u003eLate that afternoon, Dana and her camera crew pulled up in front of Frank Lonergan\u0027s apartment building. With the crew following her, Dana approached Lonergan\u0027s apartment door and rang the bell. This was the kind of interview Dana dreaded. It was bad enough to show on television the victims of horrible crimes, but to intrude on the grief of the stricken families seemed even worse to her.\u003c/p\u003e\n\u003cp\u003eThe door opened and Rita Lonergan stood there. \"What do you - ?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to bother you, Mrs. Lonergan. I\u0027m Dana Evans, with WTE. We\u0027d like to get your reaction to - \"\u003c/p\u003e\n\u003cp\u003eRita Lonergan froze for a moment, and then screamed, \"You murderers!\" She turned and ran inside the apartment.\u003c/p\u003e\n\u003cp\u003eDana looked at the cameraman, shocked. \"Wait here.\" She went inside and found Rita Lonergan in the bedroom. \"Mrs. Lonergan - \"\u003c/p\u003e\n\u003cp\u003e\"Get out! You killed my husband!\"\u003c/p\u003e\n\u003cp\u003eDana was puzzled. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"Your people gave him an assignment so dangerous that he made me leave town because he...he was afraid for my life.\"\u003c/p\u003e\n\u003cp\u003eDana looked at her, appalled. \"What - what story was he working on?\"\u003c/p\u003e\n\u003cp\u003e\"Frank wouldn\u0027t tell me.\" She was fighting hysteria. \"He said it was too - too dangerous. It was something big. He talked about the Pulitzer Prize and the - \" She started to cry.\u003c/p\u003e\n\u003cp\u003eDana went over to her and put her arms around her. \"I\u0027m so sorry. Did he say anything else?\"\u003c/p\u003e\n\u003cp\u003e\"No. He said I should get out, and he drove me to the train station. He was on his way to see some - some hotel clerk.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"At the Monroe Arms.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know why you\u0027re here, Miss Evans,\" Jeremy Robinson protested. \"Lonergan promised me that if I cooperated, there would be no bad publicity about the hotel.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Robinson, Mr. Lonergan is dead. All I want is some information.\"\u003c/p\u003e\n\u003cp\u003eJeremy Robinson shook his head. \"I don\u0027t know anything.\"\u003c/p\u003e\n\u003cp\u003e\"What did you tell Mr. Lonergan?\"\u003c/p\u003e\n\u003cp\u003eRobinson sighed. \"He asked for the address of Carl Gorman, my hotel clerk. I gave it to him.\"\u003c/p\u003e\n\u003cp\u003e\"Did Mr. Lonergan go to see him?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to have that address.\"\u003c/p\u003e\n\u003cp\u003eJeremy looked at her a moment and sighed again. \"Very well. He lives with his sister.\"\u003c/p\u003e\n\u003cp\u003eA few minutes later, Dana had the address in her hands. Robinson watched her leave the hotel, and then he picked up the phone and dialed the White House.\u003c/p\u003e\n\u003cp\u003eHe wondered why they were so interested in the case.\u003c/p\u003e\n\u003cp\u003eChris Colby, the department\u0027s computer expert, walked into Detective Reese\u0027s office holding a floppy disk. He was almost trembling with excitement.\u003c/p\u003e\n\u003cp\u003e\"What did you get?\" Detective Reese asked.\u003c/p\u003e\n\u003cp\u003eChris Colby took a deep breath. \"This is going to blow your mind. Here\u0027s a printout of what\u0027s on this disk.\"\u003c/p\u003e\n\u003cp\u003eDetective Reese started to read it and an incredulous expression came over his face. \"Mother of God,\" he said. \"I\u0027ve got to show this to Captain Miller.\"\u003c/p\u003e\n\u003cp\u003eWhen Captain Otto Miller finished reading the printout, he looked up at Detective Reese. \"I - I\u0027ve never seen anything like this.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s never been anything like this,\" Detective Reese said. \"What the hell do we do with it?\"\u003c/p\u003e\n\u003cp\u003eCaptain Miller said slowly, \"I think we have to turn it over to the U.S. attorney general.\"\u003c/p\u003e\n\u003cp\u003eThey were gathered in the office of Attorney General Barbara Gatlin. With her in the room were Scott Brandon, director of the FBI; Dean Bergstrom, the Washington chief of police; James Frisch, director of Central Intelligence, and Edgar Graves, Chief Justice of the Supreme Court.\u003c/p\u003e\n\u003cp\u003eBarbara Gatlin said, \"I asked you gentlemen here because I need your advice. Frankly, I don\u0027t know how to proceed. We have a situation that\u0027s unique. Frank Lonergan was a reporter for the Washington Tribune. When he was killed, he was in the middle of an investigation into the murder of Chloe Houston. I\u0027m going to read you a transcript of what the police found on a disk in Lonergan\u0027s car.\" She looked at the printout in her hand and started to read aloud:\u003c/p\u003e\n\u003cp\u003e\"\u0027I have reason to believe that the President of the United States has committed at least one murder and is involved in four more - \u0027\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Scott Brandon exclaimed.\u003c/p\u003e\n\u003cp\u003e\"Let me go on.\" She started to read again.\u003c/p\u003e\n\u003cp\u003e\" \u0027I obtained the following information from various sources. Leslie Stewart, the owner and publisher of the Washington Tribune, is willing to swear that at one time, Oliver Russell tried to persuade her to take an illegal drug called liquid Ecstasy.\u003c/p\u003e\n\u003cp\u003e\"\u0027When Oliver Russell was running for governor of Kentucky, Lisa Burnette, a legal secretary who worked in the state capitol building, threatened to sue him for sexual harassment. Russell told a colleague that he would have a talk with her. The next day, Lisa Burnette\u0027s body was found in the Kentucky River. She had died of an overdose of liquid Ecstasy.\u003c/p\u003e\n\u003cp\u003e\"\u0027Then-Governor Oliver Russell\u0027s secretary, Miriam Friedland, was found unconscious on a park bench late at night. She was in a coma induced by liquid Ecstasy. The police were waiting for her to come out of it so that they could find out who had given it to her. Oliver Russell telephoned the hospital and suggested they take her off life support. Miriam Friedland passed away without coming out of the coma.\u003c/p\u003e\n\u003cp\u003e\"\u0027Chloe Houston was killed by an overdose of liquid Ecstasy. I learned that on the night of her death, there was a phone call from the hotel suite to the White House. When I looked at the hotel telephone records to check it, the page for that day was missing.\u003c/p\u003e\n\u003cp\u003e\"\u0027I was told that the president was at a meeting that night, but I discovered that the meeting had been canceled. No one knows the president\u0027s whereabouts that night.\u003c/p\u003e\n\u003cp\u003e\"\u0027Paul Yerby was detained as a suspect in Chloe Houston\u0027s murder. Captain Otto Miller told the White House where Yerby was being held. The following morning Yerby was found hanging in his cell. He was supposed to have hanged himself with his belt, but when I looked through his effects at the police station, his belt was there, intact.\u003c/p\u003e\n\u003cp\u003e\"\u0027Through a friend at the FBI, I learned that a blackmail letter had been sent to the White House. President Russell asked the FBI to check it for fingerprints. Most of the letter had been whited out, but with the aid of an infrascope, the FBI was able to decipher it.\u003c/p\u003e\n\u003cp\u003e\"\u0027The fingerprints on the letter were identified as belonging to Carl Gorman, a clerk at the Monroe Arms Hotel, probably the only one who might have known the identity of the person who booked the suite where the girl was killed. He was away at a fishing camp, but his name had been revealed to the White House. When I arrived at the camp, Gorman had been killed in what appeared to be an accident.\u003c/p\u003e\n\u003cp\u003e\"\u0027There are too many connections for these killings to be a coincidence. I am going ahead with the investigation, but frankly, I\u0027m frightened. At least I have this on the record, in case anything should happen to me. More later.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"My God,\" James Frisch exclaimed. \"This is...horrible.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe it.\"\u003c/p\u003e\n\u003cp\u003eAttorney General Gatlin said, \"Lonergan believed it, and he was probably killed to stop this information from getting out.\"\u003c/p\u003e\n\u003cp\u003e\"What do we do now?\" Chief Justice Graves asked. \"How do you ask the President of the United States if he\u0027s killed half a dozen people?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a good question. Impeach him? Arrest him? Throw him in jail?\"\u003c/p\u003e\n\u003cp\u003e\"Before we do anything,\" Attorney General Gatlin said, \"I think we have to present this transcript to the president himself and give him an opportunity to comment.\"\u003c/p\u003e\n\u003cp\u003eThere were murmurs of agreement.\u003c/p\u003e\n\u003cp\u003e\"In the meantime, I\u0027ll have a warrant for his arrest drawn up. Just in case it\u0027s necessary.\"\u003c/p\u003e\n\u003cp\u003eOne of the men in the room was thinking, I\u0027ve got to inform Peter Tager.\u003c/p\u003e\n\u003cp\u003ePeter Tager put the telephone down and sat there for a long time, thinking about what he had just been told. He rose and walked down the corridor to Deborah Kanner\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"I have to see the president.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in a meeting. If you can - \"\u003c/p\u003e\n\u003cp\u003e\"I have to see him now, Deborah. It\u0027s urgent\"\u003c/p\u003e\n\u003cp\u003eShe saw the look on his face. \"Just a moment\" She picked up the telephone and pressed a button. \"I\u0027m sorry to interrupt you, Mr. President Mr. Tager is here, and he said he must see you.\" She listened a moment. \"Thank you.\" She replaced the receiver and turned to Tager. \"Five minutes.\"\u003c/p\u003e\n\u003cp\u003eFive minutes later, Peter Tager was alone in the Oval Office with President Russell.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s so important, Peter?\"\u003c/p\u003e\n\u003cp\u003eTager took a deep breath. \"The Attorney General and the FBI think you\u0027re involved in six murders.\"\u003c/p\u003e\n\u003cp\u003eOliver smiled. \"This is some kind of joke...\"\u003c/p\u003e\n\u003cp\u003e\"Is it? They\u0027re on their way here now. They believe you killed Chloe Houston and - \"\u003c/p\u003e\n\u003cp\u003eOliver had gone pale. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"I know - it\u0027s crazy. From what I was told, all the evidence is circumstantial. I\u0027m sure you can explain where you were the night the girl died.\"\u003c/p\u003e\n\u003cp\u003eOliver was silent.\u003c/p\u003e\n\u003cp\u003ePeter Tager was waiting. \"Oliver, you can explain, can\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eOliver swallowed. \"No. I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You have to!\"\u003c/p\u003e\n\u003cp\u003eOliver said heavily, \"Peter, I need to be alone.\"\u003c/p\u003e\n\u003cp\u003ePeter Tager went to see Senator Davis in the Capitol.\u003c/p\u003e\n\u003cp\u003e\"What is it that\u0027s so urgent, Peter?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s - it\u0027s about the president.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"The attorney general and the FBI think that Oliver is a murderer.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis sat there staring at Tager. \"What the hell are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re convinced Oliver\u0027s committed several murders. I got a tip from a friend at the FBI.\"\u003c/p\u003e\n\u003cp\u003eTager told Senator Davis about the evidence.\u003c/p\u003e\n\u003cp\u003eWhen Tager was through, Senator Davis said slowly, \"That dumb son of a bitch! Do you know what this means?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. It means that Oliver - \"\u003c/p\u003e\n\u003cp\u003e\"Fuck Oliver. I\u0027ve spent years putting him where I want him. I don\u0027t care what happens to him. I\u0027m in control now, Peter. I have the power. I\u0027m not going to let Oliver\u0027s stupidity take it away from me. I\u0027m not going to let anyone take it away from me!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see what you can - \"\u003c/p\u003e\n\u003cp\u003e\"You said the evidence was all circumstantial?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. I was told they have no hard proof. But he has no alibi.\"\u003c/p\u003e\n\u003cp\u003e\"Where is the president now?\"\u003c/p\u003e\n\u003cp\u003e\"In the Oval Office.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got some good news for him,\" Senator Todd Davis said.\u003c/p\u003e\n\u003cp\u003eSenator Davis was facing Oliver in the Oval Office. \"I\u0027ve been hearing some very disturbing things, Oliver. It\u0027s insane, of course. I don\u0027t know how anyone could possibly think you - \"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t, either. I haven\u0027t done anything wrong, Todd.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you haven\u0027t. But if word got out that you were even suspected of horrible crimes like these - well, you can see how this would affect the office, can\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, but - \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re too important to let anything like this happen to you. This office controls the world, Oliver. You don\u0027t want to give this up.\"\u003c/p\u003e\n\u003cp\u003e\"Todd - I\u0027m not guilty of anything.\"\u003c/p\u003e\n\u003cp\u003e\"But they think you are. I\u0027m told you have no alibi for the evening of Chloe Houston\u0027s murder?\"\u003c/p\u003e\n\u003cp\u003eThere was a momentary silence. \"No.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis smiled. \"What happened to your memory, son? You were with me that evening. We spent the whole evening together.\"\u003c/p\u003e\n\u003cp\u003eOliver was looking at him, confused. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. I\u0027m your alibi. No one\u0027s going to question my word. No one. I\u0027m going to save you, Oliver.\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence. Oliver said, \"What do you want in return, Todd?\"\u003c/p\u003e\n\u003cp\u003eSenator Davis nodded. \"We\u0027ll start with the Middle Eastern peace conference. You\u0027ll call that off. After that, we\u0027ll talk. I have great plans for us. We\u0027re not going to let anything spoil them.\"\u003c/p\u003e\n\u003cp\u003eOliver said, \"I\u0027m going ahead with the peace conference.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis\u0027s eyes narrowed. \"What did you say?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve decided to go ahead with it. You see, what\u0027s important is not how long a president stays in this office, Todd, but what he does when he\u0027s in it.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis\u0027s face was turning red. \"Do you know what you\u0027re doing?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eThe senator leaned across the desk. \"I don\u0027t think you do. They\u0027re on their way here to accuse you of murder, Oliver. Where are you going to make your goddam deals from - the penitentiary? You\u0027ve just thrown your whole life away, you stupid - \"\u003c/p\u003e\n\u003cp\u003eA voice came over the intercom. \"Mr. President, there are some people here to see you. Attorney General Gatlin, Mr. Brandon from the FBI, Chief Justice Graves, and - \"\u003c/p\u003e\n\u003cp\u003e\"Send them in.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis said savagely, \"It looks like I should stick to judging horseflesh. I made a big mistake with you, Oliver. But you just made the biggest mistake of your life. I\u0027m going to destroy you.\"\u003c/p\u003e\n\u003cp\u003eThe door opened and Attorney General Gatlin entered, followed by Brandon, Justice Graves, and Bergstrom.\u003c/p\u003e\n\u003cp\u003eJustice Graves said, \"Senator Davis...\"\u003c/p\u003e\n\u003cp\u003eTodd Davis nodded curtly and strode out of the room. Barbara Gatlin closed the door behind him. She walked up to the desk.\u003c/p\u003e\n\u003cp\u003e\"Mr. President, this is highly embarrassing, but I hope you will understand. We have to ask you some questions.\"\u003c/p\u003e\n\u003cp\u003eOliver faced them. \"I\u0027ve been told why you\u0027re here. Of course, I had nothing to do with any of those deaths.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure we\u0027re all relieved to hear that, Mr. President,\" Scott Brandon said, \"and I assure you that none of us really believes that you could be involved. But an accusation has been made, and we have no choice but to pursue it.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. President, have you ever taken the drug Ecstasy?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eThe group looked at one another.\u003c/p\u003e\n\u003cp\u003e\"Mr. President, if you could tell us where you were on October fifteenth, the evening of Chloe Houston\u0027s death...\"\u003c/p\u003e\n\u003cp\u003eThere was a silence.\u003c/p\u003e\n\u003cp\u003e\"Mr. President?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"But surely you can remember where you were, or what you were doing on that evening?\"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"Mr. President?\"\u003c/p\u003e\n\u003cp\u003e\"I - I can\u0027t think right now. I\u0027d like you to come back later.\"\u003c/p\u003e\n\u003cp\u003e\"How much later?\" Bergstrom asked.\u003c/p\u003e\n\u003cp\u003e\"Eight o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eOliver watched them leave. He got up and slowly walked into the small sitting room where Jan was working at a desk. She looked up as Oliver entered.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath and said, \"Jan, I - I have a confession to make.\"\u003c/p\u003e\n\u003cp\u003eSenator Davis was in an icy rage. How could I have been so stupid? I picked the wrong man. He\u0027s trying to destroy everything Vve worked for. I\u0027ll teach him what happens to people who try to double-cross me. The Senator sat at his desk for a long time, deciding what he was going to do. Then he picked up a telephone and dialed.\u003c/p\u003e\n\u003cp\u003e\"Miss Stewart, you told me to call you when I had something more for you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Senator?\"\u003c/p\u003e\n\u003cp\u003e\"Let me tell you what I want. From now on, I\u0027ll expect the full support of the Tribune - campaign contributions, glowing editorials, the works.\"\u003c/p\u003e\n\u003cp\u003e\"And what do I get in exchange for all this?\" Leslie asked.\u003c/p\u003e\n\u003cp\u003e\"The President of the United States. The attorney general has just sworn out a warrant for his arrest for a series of murders.\"\u003c/p\u003e\n\u003cp\u003eThere was a sharp intake of breath. \"Keep talking.\"\u003c/p\u003e\n\u003cp\u003eLeslie Stewart was speaking so fast that Matt Baker could not understand a word. \"For God\u0027s sake, calm down,\" he said. \"What are you trying to say?\"\u003c/p\u003e\n\u003cp\u003e\"The president! We\u0027ve got him, Matt! I just talked to Senator Todd Davis. The chief justice of the Supreme Court, the chief of police, the director of the FBI, and the U.S. attorney general are in the president\u0027s office now with a warrant for his arrest on charges of murder. There\u0027s a pile of evidence against him, Matt, and he has no alibi. It\u0027s the story of the goddam century!\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t print it.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him in surprise. \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Leslie, a story like this is too big to just - I mean the facts have to be checked and rechecked - \"\u003c/p\u003e\n\u003cp\u003e\"And rechecked again until it becomes a headline in The Washington Post? No, thank you. I\u0027m not going to lose this one.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t accuse the President of the United States of murder without - \"\u003c/p\u003e\n\u003cp\u003eLeslie smiled. \"I\u0027m not going to, Matt. All we have to do is print the fact that there is a warrant for his arrest. That\u0027s enough to destroy him.\"\u003c/p\u003e\n\u003cp\u003e\"Senator Davis - \"\u003c/p\u003e\n\u003cp\u003e\" - is turning in his own son-in-law. He believes the president is guilty. He told me so.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not enough. We\u0027ll verify it first, and - \"\u003c/p\u003e\n\u003cp\u003e\"With whom - Katharine Graham? Are you out of your mind? We run this right now, or we lose it.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t let you do this, not without verifying everything that - \"\u003c/p\u003e\n\u003cp\u003e\"Who do you think you\u0027re talking to? This is my paper, and I\u0027ll do anything I like with it.\"\u003c/p\u003e\n\u003cp\u003eMatt Baker rose. \"This is irresponsible. I won\u0027t let any of my people write this story.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t have to. I\u0027ll write it myself.\"\u003c/p\u003e\n\u003cp\u003e\"Leslie, if you do this, I\u0027m leaving. For good.\"\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027re not, Matt. You and I are going to share a Pulitzer Prize.\" She watched him turn and walk out of the office. \"You\u0027ll be back.\"\u003c/p\u003e\n\u003cp\u003eLeslie pressed down the intercom button. \"Have Zoltaire come in here.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him and said, \"I want to know my horoscope for the next twenty-four hours.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Miss Stewart. I\u0027ll be happy to do that.\" From his pocket, Zoltaire took a small ephemeris, the astrological bible, and opened it. He studied the positions of the stars and the planets for a moment, and his eyes widened.\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003eZoltaire looked up. \"I - something very important seems to be happening.\" He pointed to the ephemeris. \"Look. Transiting Mars is going over your ninth house Pluto for three days, setting off a square to your - \"\u003c/p\u003e\n\u003cp\u003e\"Never mind that,\" Leslie said impatiently. \"Cut to the chase.\"\u003c/p\u003e\n\u003cp\u003eHe blinked. \"The chase? Ah, yes.\" He looked at the book again. \"There is some kind of major event happening. You are in the middle of it. You\u0027re going to be even more famous than you are now, Miss Stewart. The whole world is going to know your name.\"\u003c/p\u003e\n\u003cp\u003eLeslie was filled with a feeling of intense euphoria. The whole world was going to know her name. She was at the awards ceremonies and the speaker was saying, \"And now, the recipient of this year\u0027s Pulitzer Prize for the most important story in newspaper history. I give you Miss Leslie Stewart.\" There was a standing ovation, and the roar was deafening.\u003c/p\u003e\n\u003cp\u003e\"Miss Stewart...\"\u003c/p\u003e\n\u003cp\u003eLeslie shook away the dream.\u003c/p\u003e\n\u003cp\u003e\"Will there be anything else?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Leslie said. \"Thank you, Zoltaire. That\u0027s enough.\"\u003c/p\u003e\n\u003cp\u003eAt seven o\u0027clock that evening, Leslie was looking at a proof of the story she had written. The headline read: MURDER WARRANT SERVED ON PRESIDENT RUSSELL. PRESIDENT ALSO TO BE QUESTIONED IN INVESTIGATION OF SIX DEATHS.\u003c/p\u003e\n\u003cp\u003eLeslie skimmed her story under it and turned to Lyle Bannister, her managing editor. \"Run it,\" she said. \"Put it out as an extra. I want it to hit the streets in an hour, and WTE can broadcast the story at the same time.\"\u003c/p\u003e\n\u003cp\u003eLyle Bannister hesitated. \"You don\u0027t think Matt Baker should take a look at - ?\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t his paper, it\u0027s mine. Run it. Now.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am.\" He reached for the telephone on Leslie\u0027s desk and dialed a number. \"We\u0027re going with it.\"\u003c/p\u003e\n\u003cp\u003eAt seven-thirty that evening, Barbara Gatlin and the others in the group were preparing to return to the White House. Barbara Gatlin said heavily, \"I hope to God it isn\u0027t going to be necessary to use it, but just to be prepared, I\u0027m bringing the warrant for the president\u0027s arrest.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later, Oliver\u0027s secretary said, \"Attorney General Gatlin and the others are here.\"\u003c/p\u003e\n\u003cp\u003e\"Send them in.\"\u003c/p\u003e\n\u003cp\u003eOliver watched, pale-faced, as they walked into the Oval Office. Jan was at his side, holding his hand tightly.\u003c/p\u003e\n\u003cp\u003eBarbara Gatlin said, \"Are you prepared to answer our questions now, Mr. President?\"\u003c/p\u003e\n\u003cp\u003eOliver nodded. \"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. President, did Chloe Houston have an appointment to see you on October fifteenth?\"\u003c/p\u003e\n\u003cp\u003e\"She did.\"\u003c/p\u003e\n\u003cp\u003e\"And did you see her?\"\u003c/p\u003e\n\u003cp\u003e\"No. I had to cancel.\"\u003c/p\u003e\n\u003cp\u003eThe call had come in just before three o\u0027clock. \"Darling, it\u0027s me. I\u0027m lonely for you. I\u0027m at the lodge in Maryland. I\u0027m sitting by the pool, naked.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to do something about that.\"\u003c/p\u003e\n\u003cp\u003e\"When can you get away?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be there in an hour.\"\u003c/p\u003e\n\u003cp\u003eOliver turned to face the group. \"If what I\u0027m about to tell you should ever leave this office, it would do irreparable damage to the presidency and to our relations with another country. I\u0027m doing this with the greatest reluctance, but you leave me no choice.\"\u003c/p\u003e\n\u003cp\u003eAs the group watched in wonder, Oliver walked over to a side door leading to a den and opened it. Sylva Picone stepped into the room.\u003c/p\u003e\n\u003cp\u003e\"This is Sylva Picone, the wife of the Italian ambassador. On the fifteenth, Mrs. Picone and I were together at her lodge in Maryland from four o\u0027clock in the afternoon until two o\u0027clock in the morning. I know absolutely nothing about the murder of Chloe Houston, or any of the other deaths.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-best-laid-plans/page-20.html","bookId":2367,"creation":"Oct 5, 2019 10:12:22 AM","modification":"Oct 5, 2019 10:12:22 AM"}
