{"id":69089,"no":21,"title":"Page 21","content":"\u003cp\u003eDana walked into Tom Hawkins\u0027s office. \"Tom, I\u0027m on to something interesting. Before Frank Lonergan was murdered, he went to the home of Carl Gorman, a clerk who worked at the Monroe Arms. Gorman was killed in a supposed boating accident. He lived with his sister. I\u0027d like to take a crew over there to do a taped segment for the ten-o\u0027clock news tonight.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think it was a boating accident?\"\u003c/p\u003e\n\u003cp\u003e\"No. Too many coincidences.\"\u003c/p\u003e\n\u003cp\u003eTom Hawkins was thoughtful for a moment. \"Okay. I\u0027ll set it up.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. Here\u0027s the address. I\u0027ll meet the camera crew there. I\u0027m going home to change.\"\u003c/p\u003e\n\u003cp\u003eWhen Dana walked into her apartment, she had a sudden feeling that something was wrong. It was a sense she had developed in Sarajevo, a warning of danger. Somebody had been here. She walked through the apartment slowly, warily checking the closets. Nothing was amiss. It\u0027s my imagination, Dana told herself. But she did not believe it.\u003c/p\u003e\n\u003cp\u003eWhen Dana arrived at the house that Carl Gorman\u0027s sister lived in, the electronic news-gathering vehicle had arrived and was parked down the street. The ENG was an enormous van with a large antenna on the roof and sophisticated electronic equipment inside. Waiting for Dana were Andrew Wright, the soundman, and Vernon Mills, the cameraman.\u003c/p\u003e\n\u003cp\u003e\"Where are we doing the interview?\" Mills asked.\u003c/p\u003e\n\u003cp\u003e\"I want to do it inside the house. I\u0027ll call you when we\u0027re ready.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eDana went up to the front door and knocked. Marianne Gorman opened the door. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m - \"\u003c/p\u003e\n\u003cp\u003e\"Oh! I know who you are. I\u0027ve seen you on television.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" Dana said. \"Could we talk for a minute?\"\u003c/p\u003e\n\u003cp\u003eMarianne Gorman hesitated. \"Yes. Come in.\" Dana followed her into the living room.\u003c/p\u003e\n\u003cp\u003eMarianne Gorman offered Dana a chair. \"It\u0027s about my brother, isn\u0027t it? He was murdered. I know it.\"\u003c/p\u003e\n\u003cp\u003e\"Who killed him?\"\u003c/p\u003e\n\u003cp\u003eMarianne Gorman looked away. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Did Frank Lonergan come here to see you?\"\u003c/p\u003e\n\u003cp\u003eThe woman\u0027s eyes narrowed. \"He tricked me. I told him where he could find my brother and - \" Her eyes filled with tears. \"Now Carl is dead.\"\u003c/p\u003e\n\u003cp\u003e\"What did Lonergan want to talk to your brother about?\"\u003c/p\u003e\n\u003cp\u003e\"He said he was from the IRS.\"\u003c/p\u003e\n\u003cp\u003eDana sat there watching her. \"Would you mind if I did a brief television interview with you? You can just say a few words about your brother\u0027s murder and how you feel about the crime in this city.\"\u003c/p\u003e\n\u003cp\u003eMarianne Gorman nodded. \"I guess that will be all right.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Dana went to the front door, opened it, and waved to Vernon Mills. He picked up his camera equipment and started toward the house, followed by Andrew Wright.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never done this kind of thing before,\" Marianne said.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing to be nervous about. It will only take a few minutes.\"\u003c/p\u003e\n\u003cp\u003eVernon entered the living room with the camera. \"Where do you want to shoot this?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll do it here, in the living room.\" She nodded toward a corner. \"You can put the camera there.\"\u003c/p\u003e\n\u003cp\u003eVernon placed the camera, then walked back to Dana. He pinned a lavaliere microphone on each woman\u0027s jacket. \"You can turn it on whenever you\u0027re ready.\" He set it down on a table.\u003c/p\u003e\n\u003cp\u003eMarianne Gorman said, \"No! Wait a minute! I\u0027m sorry. I - I can\u0027t do this.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Dana asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s...it\u0027s dangerous. Could - could I talk to you alone?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Dana looked at Vernon and Wright. \"Leave the camera where it is. I\u0027ll call you.\"\u003c/p\u003e\n\u003cp\u003eVernon nodded, \"We\u0027ll be in the van.\"\u003c/p\u003e\n\u003cp\u003eDana turned to Marianne Gorman. \"Why is it dangerous for you to be on television?\"\u003c/p\u003e\n\u003cp\u003eMarianne said reluctantly, \"I don\u0027t want them to see me.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t want who to see you?\"\u003c/p\u003e\n\u003cp\u003eMarianne swallowed. \"Carl did something he...he shouldn\u0027t have done. He was killed because of it. And the men who killed him will try to kill me.\" She was trembling.\u003c/p\u003e\n\u003cp\u003e\"What did Carl do?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, my God,\" Marianne moaned. \"I begged him not to.\"\u003c/p\u003e\n\u003cp\u003e\"Not to what?\" Dana persisted.\u003c/p\u003e\n\u003cp\u003e\"He - he wrote a blackmail letter.\"\u003c/p\u003e\n\u003cp\u003eDana looked at her in surprise. \"A blackmail letter?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Believe me, Carl was a good man. It\u0027s just that he liked - he had expensive tastes, and on his salary, he couldn\u0027t afford to live the way he wanted to. I couldn\u0027t stop him. He was murdered because of that letter. I know it. They found him, and now they know where I am. I\u0027m going to be killed.\" She was sobbing. \"I - I don\u0027t know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about the letter.\"\u003c/p\u003e\n\u003cp\u003eMarianne Gorman took a deep breath. \"My brother was going away on a vacation. He had forgotten a jacket that he wanted to take with him, and he went back to the hotel. He got his jacket and was back in his car in the garage when the private elevator door to the Imperial Suite opened. Carl told me he saw a man get out. He was surprised to see him there. He was even more surprised when the man walked back to the elevator and wiped off his fingerprints. Carl couldn\u0027t figure out what was going on. Then the - the next day, he read about that poor girl\u0027s murder, and he knew that this man had killed her.\" She hesitated. \"That\u0027s when he sent the letter to the White House.\"\u003c/p\u003e\n\u003cp\u003eDana said slowly, \"The White House?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who did he send the letter to?\"\u003c/p\u003e\n\u003cp\u003e\"The man he saw in the garage. You know - the one with the eye patch. Peter Tager.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-best-laid-plans/page-21.html","bookId":2367,"creation":"Oct 5, 2019 10:12:22 AM","modification":"Oct 5, 2019 10:12:22 AM"}
