{"id":69091,"no":23,"title":"Page 23","content":"\u003cp\u003eMarianne Gorman repeated, \"You know - the one with the eye patch. Peter Tager.\"\u003c/p\u003e\n\u003cp\u003eDana was stunned. \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s hard not to recognize someone who looks like that, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"I need to use your phone.\" Dana hurried over to the telephone and dialed Matt Baker\u0027s number. His secretary answered.\u003c/p\u003e\n\u003cp\u003e\"Mr. Baker\u0027s office.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Dana. I have to talk to him. It\u0027s urgent.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on, please.\"\u003c/p\u003e\n\u003cp\u003eA moment later, Matt Baker was on the line. \"Dana - is anything wrong?\"\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. \"Matt, I just found out who was with Chloe Houston when she died.\"\u003c/p\u003e\n\u003cp\u003e\"We know who it was. It was - \"\u003c/p\u003e\n\u003cp\u003e\"Peter Tager.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" It was a shout.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m with the sister of Carl Gorman, the hotel clerk who was murdered. Carl Gorman saw Tager wiping his fingerprints off the elevator in the hotel garage the night Chloe Houston died. Gorman sent Tager a blackmail letter, and I think Tager had him murdered. I have a camera crew here. Do you want me to go on the air with this?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t do anything right now!\" Matt ordered. \"I\u0027ll handle it. Call me back in ten minutes.\"\u003c/p\u003e\n\u003cp\u003eHe slammed down the receiver and headed for the White Tower. Leslie was in her office.\u003c/p\u003e\n\u003cp\u003e\"Leslie, you can\u0027t print - \"\u003c/p\u003e\n\u003cp\u003eShe turned and held up the mock-up of the headline: MURDER WARRANT SERVED ON PRESIDENT RUSSELL.\u003c/p\u003e\n\u003cp\u003e\"Look at this, Matt.\" Her voice was filled with exaltation.\u003c/p\u003e\n\u003cp\u003e\"Leslie - I have news for you. There\u0027s - \"\u003c/p\u003e\n\u003cp\u003e\"This is all the news I need.\" She nodded smugly. \"I told you you\u0027d come back. You couldn\u0027t stay away, could you? This was just too big to walk away from, wasn\u0027t it, Matt? You need me. You\u0027ll always need me.\"\u003c/p\u003e\n\u003cp\u003eHe stood there, looking at her, wondering: What happened to turn her into this kind of woman? It\u0027s still not too late to save her. \"Leslie - \"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be embarrassed because you made a mistake,\" Leslie said complacently. \"What did you want to say?\"\u003c/p\u003e\n\u003cp\u003eMatt Baker looked at her for a long time. \"I wanted to say goodbye, Leslie.\"\u003c/p\u003e\n\u003cp\u003eShe watched him turn and walk out the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-best-laid-plans/page-23.html","bookId":2367,"creation":"Oct 5, 2019 10:12:22 AM","modification":"Oct 5, 2019 10:12:22 AM"}
