{"id":38297,"no":7,"title":"CHAPTER VII. THE LION HUNT.","content":"Frank selected a charming little glade in a wild tract of forest near the banks of a river.\n\u003cbr\u003e \n\u003cbr\u003e Here he made descent.\n\u003cbr\u003e \n\u003cbr\u003e The airship rested upon the ground, and the travelers were all glad enough to get out and stretch their legs after the long journey in air.\n\u003cbr\u003e \n\u003cbr\u003e But first the Dart was securely anchored to make sure that she did not go off of a sudden and leave them.\n\u003cbr\u003e \n\u003cbr\u003e Then Barney and Pomp brought out their elephant rifles.\n\u003cbr\u003e \n\u003cbr\u003e “Now for sport!” cried Frank. “I presume though, professor, you would prefer to do something else.”\n\u003cbr\u003e \n\u003cbr\u003e “I will remain near the airship and amuse myself,” replied the scientist. “Yonder is a rare species of butterfly I want.”\n\u003cbr\u003e \n\u003cbr\u003e Leaving him to pursue the winged beauty, Frank, with Barney and Pomp, set out upon their hunt.\n\u003cbr\u003e \n\u003cbr\u003e In a very short time they were deep in the forest and having rare sport.\n\u003cbr\u003e \n\u003cbr\u003e Game was almost too plentiful.\n\u003cbr\u003e \n\u003cbr\u003e The abundance of pheasants and hares almost took the edge off of the sport. The trio were soon loaded down.\n\u003cbr\u003e \n\u003cbr\u003e But, as was natural, they now began to consider the feasibility of bagging larger game.\n\u003cbr\u003e \n\u003cbr\u003e Even as they were discussing this an elephant was heard trumpeting in the distance, and at that moment Frank caught sight of some tracks in the soft soil.\n\u003cbr\u003e \n\u003cbr\u003e “A lion has been this way!” he declared. “We could not find greater sport than that.”\n\u003cbr\u003e \n\u003cbr\u003e “Bejabers, I’m wid yez!” cried Barney.\n\u003cbr\u003e \n\u003cbr\u003e “Huh! Don’t be so brave!” sniffed Pomp. “Did yo’ ever the baste!”\n\u003cbr\u003e \n\u003cbr\u003e “Bejabers, no! But me ancisters hunted the Irish elk,” retorted Barney. “Don’t yez be so smart to think ye’re in yez own counthry.”\n\u003cbr\u003e \n\u003cbr\u003e But Frank had already taken the lion’s trail.\n\u003cbr\u003e \n\u003cbr\u003e For some distance it could be plainly followed. Then Frank shrewdly guessed the truth.\n\u003cbr\u003e \n\u003cbr\u003e “The animal was going for water,” he declared. “If we hide somewhere hereabouts he will pass this way again.”\n\u003cbr\u003e \n\u003cbr\u003e They had come out upon the verge of a wide, grassy plain.\n\u003cbr\u003e \n\u003cbr\u003e But a pile of bowlders near afforded a good hiding place as well as a rampart. Here they waited.\n\u003cbr\u003e \n\u003cbr\u003e Frank knew enough about lions to know that this was the safest way to hunt them.\n\u003cbr\u003e \n\u003cbr\u003e The hunters had not to wait long.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly a sound came from the forest which almost made the ground tremble. It gave our hunters a mighty start.\n\u003cbr\u003e \n\u003cbr\u003e It was the roar of a lion. The king of beasts was near.\n\u003cbr\u003e \n\u003cbr\u003e “Sh!” exclaimed Frank, in a whisper. “Don’t let him see you!”\n\u003cbr\u003e \n\u003cbr\u003e The next moment the monster came in sight.\n\u003cbr\u003e \n\u003cbr\u003e And he was a monster. A larger specimen our friends had never seen. He stood just in the verge of the woods.\n\u003cbr\u003e \n\u003cbr\u003e For a moment he sniffed the air as if he scented his foes. Then he came slowly along the path.\n\u003cbr\u003e \n\u003cbr\u003e It was evident that he was going down to the river for water.\n\u003cbr\u003e \n\u003cbr\u003e He would surely pass within twenty yards of the hunters. They were all in readiness. It was a critical moment.\n\u003cbr\u003e \n\u003cbr\u003e Now the lion was just opposite.\n\u003cbr\u003e \n\u003cbr\u003e Frank raised his rifle and took very careful aim. He made the beast’s side just back of the shoulder the mark, hoping to reach the heart.\n\u003cbr\u003e \n\u003cbr\u003e Then he pulled the trigger.\n\u003cbr\u003e \n\u003cbr\u003e However, a movement upon the lion’s part caused the ball to strike in the shoulder. The animal leaped in the air and came down facing the covert from which the shot had come.\n\u003cbr\u003e \n\u003cbr\u003e “Look out!” cried Frank. “He’s coming! Take careful aim!”\n\u003cbr\u003e \n\u003cbr\u003e There was need of this. With a roar which was deafening the lion made a forward spring.\n\u003cbr\u003e \n\u003cbr\u003e But he never reached the covert.\n\u003cbr\u003e \n\u003cbr\u003e Barney and Pomp fired almost in the same moment. One or both bullets struck a vital part, for the beast rolled over upon the ground and lay motionless.\n\u003cbr\u003e \n\u003cbr\u003e “Whurroo!” yelled Barney, delightedly. “We’ve killed the baste!”\n\u003cbr\u003e \n\u003cbr\u003e And he was about to dash out of the covert, when Frank clutched his arm.\n\u003cbr\u003e \n\u003cbr\u003e “Hold on!” cried the young inventor.\n\u003cbr\u003e \n\u003cbr\u003e “Yis, sor.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t be reckless. There may be a mate to that fellow near.”\n\u003cbr\u003e \n\u003cbr\u003e The warning was well timed. Indeed, a frightful roar was heard, and from another thicket a second lion bounded forth.\n\u003cbr\u003e \n\u003cbr\u003e This was too much for Barney. He subsided at once and was submissive as a lamb.\n\u003cbr\u003e \n\u003cbr\u003e The second lion seemed fiercer and larger than the first. The beast remained for some moments stationary, but roaring and lashing its tail.\n\u003cbr\u003e \n\u003cbr\u003e Then suddenly it began to advance until quite near its mate’s side. The scent of the blood was enough.\n\u003cbr\u003e \n\u003cbr\u003e With long strides the monster came straight for the covert where the hunters were confined.\n\u003cbr\u003e \n\u003cbr\u003e Frank had just time to shout:\n\u003cbr\u003e \n\u003cbr\u003e “Look out! He is coming!”\n\u003cbr\u003e \n\u003cbr\u003e Then the beast was upon them.\n\u003cbr\u003e \n\u003cbr\u003e The three rifles cracked almost at point-blank range. But what was most singular was the fact that not one bullet took effect.\n\u003cbr\u003e \n\u003cbr\u003e The lion came on and straight over the pile of bowlders.\n\u003cbr\u003e \n\u003cbr\u003e It had already became evident that the hunters might expect a close encounter. This was a thrilling exigency to face.\n\u003cbr\u003e \n\u003cbr\u003e “Whurroo!” shouted Barney, wildly. “Luk out fer yersilves ivery wan! Shure, the baste is roight here!”\n\u003cbr\u003e \n\u003cbr\u003e This was the truth.\n\u003cbr\u003e \n\u003cbr\u003e The next moment the lion was over the bowlders. Again the hunters fired. But either the bullets went wide or did not strike a vital part.\n\u003cbr\u003e \n\u003cbr\u003e The lion came on, just the same.\n\u003cbr\u003e \n\u003cbr\u003e He struck Barney full force. The Celt went down as if struck by a thunderbolt. The lion, however, was unable to cheek his momentum.\n\u003cbr\u003e \n\u003cbr\u003e He slipped and slid on the rocks for some yards. The quick presence of mind of Frank Reade, Jr., saved the day.\n\u003cbr\u003e \n\u003cbr\u003e The young inventor raised his rifle quick as a flash and fired again.\n\u003cbr\u003e \n\u003cbr\u003e This time the bullet went to the mark. It took effect in the lion’s vitals, and the battle was quickly over.\n\u003cbr\u003e \n\u003cbr\u003e The huge beast tumbled in a heap. Barney was instantly upon his feet.\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, I niver got such a basting as that afore!” he grumbled, rubbing his arm. “Shure, the crather nigh kilt me.”\n\u003cbr\u003e \n\u003cbr\u003e “We can congratulate ourselves upon a very lucky escape,” declared Frank. “There was little chance for us. If the lion had closed his jaws upon any one of us it would have been a serious matter.”\n\u003cbr\u003e \n\u003cbr\u003e It was decided to strip the noble beasts of their skins, and then return to the airship.\n\u003cbr\u003e \n\u003cbr\u003e The hunt had proved a glowing success, and all were well satisfied.\n\u003cbr\u003e \n\u003cbr\u003e It did not take Barney and Pomp long to flay the lions. They were magnificent skins, and would make beautiful robes when properly dressed.\n\u003cbr\u003e \n\u003cbr\u003e Upon returning to the Dart, Professor Gaston was found busily arranging some botanical specimens.\n\u003cbr\u003e \n\u003cbr\u003e He listened to the account of the lion hunt with interest.\n\u003cbr\u003e \n\u003cbr\u003e “There are plenty of sportsmen in America,” he declared, “who would give a large sum for the sport you have just enjoyed, could they purchase it. You are fortunate.”\n\u003cbr\u003e \n\u003cbr\u003e As nothing was to be gained by lingering longer in the vicinity, Frank caused the Dart to rise and the journey was resumed.\n\u003cbr\u003e \n\u003cbr\u003e Once more the airship was speeding over the African wilds.\n\u003cbr\u003e \n\u003cbr\u003e The next day they came in sight of a mighty lake.\n\u003cbr\u003e \n\u003cbr\u003e “Albert Nyanza Lake!” declared Frank. “One of the sources of the Nile.”\n\u003cbr\u003e \n\u003cbr\u003e Professor Gaston was much interested, and took notes of the event. Other lakes were crossed, and the Mountains of the Moon were sighted.\n\u003cbr\u003e \n\u003cbr\u003e Then the airship bore away to the northeastward. It was Frank’s purpose now to reach the North Pole in the quickest possible time.\n\u003cbr\u003e \n\u003cbr\u003e Days passed into weeks.\n\u003cbr\u003e \n\u003cbr\u003e Still the Dart kept on across the Indian Ocean, over India, and the summits of the Himalayas.\n\u003cbr\u003e \n\u003cbr\u003e Then came Indo-China and the Siberian country. The Steppes were passed over and finally the shores of the Arctic were reached in the vicinity of the delta of the Lena river.\n\u003cbr\u003e \n\u003cbr\u003e Here it was deemed best to make a descent, as the engines of the Dart had been running so long at such pressure that they really needed attention.\n\u003cbr\u003e \n\u003cbr\u003e So a descent was made at the verge of a small plateau, which was thickly covered with Arctic firs.\n\u003cbr\u003e \n\u003cbr\u003e “From here,” said Frank, “we shall proceed directly over the Arctic Ocean and locate the North Pole inside of a month. Then we can go home.”\n\u003cbr\u003e \n\u003cbr\u003e “After a most successful trip!” declared Professor Gaston, enthusiastically.\n\u003cbr\u003e \n\u003cbr\u003e “Do not say that as yet,” said Frank. “We have not reached the end of our journey as yet.”\n\u003cbr\u003e \n\u003cbr\u003e “Still you do not apprehend any serious times in locating the North Pole, do you? Are not all of the natives friendly?”\n\u003cbr\u003e \n\u003cbr\u003e “Possibly,” replied Frank, “but there are very many perils to consider. At any moment some accident might happen to the airship and we would then be in a bad fix.”\n\u003cbr\u003e \n\u003cbr\u003e “Ugh! don’t speak of it!” said the professor, shrugging his shoulders. “I don’t like to think of it.”\n\u003cbr\u003e \n\u003cbr\u003e Barney and Pomp were for a time very busy in overhauling the machinery of the Dart.\n\u003cbr\u003e \n\u003cbr\u003e Some of the bearings had to be replaced and there were many little repairs that occupied a couple of days.\n\u003cbr\u003e \n\u003cbr\u003e Then all rested from their labors on the third day, which was the Sabbath. A quiet day was made of it and the arrangement was that the start was to be made the next morning.\n\u003cbr\u003e \n\u003cbr\u003e Barney was the first abroad and was quickly made acquainted with an incident which thrilled him greatly.\n\u003cbr\u003e \n\u003cbr\u003e The river was but a few yards distant. He walked leisurely down to the shore to get a bucket of water when he heard a cry for help.\n\u003cbr\u003e \n\u003cbr\u003e It was rendered in a foreign tongue which he did not understand. Barney looked up in amazement and saw drifting down on the current of the river a raft upon which was a half-naked man.\n\u003cbr\u003e \n\u003cbr\u003e A fearful specimen of humanity he was, and Barney gazed at him in stupefaction.\n\u003cbr\u003e \n\u003cbr\u003e “Mither av mercy!” he gasped. “Phwativer can it be?”\n\u003cbr\u003e \n\u003cbr\u003e Indeed there was good cause for Barney’s horrified remark.\n\u003cbr\u003e \n\u003cbr\u003e The occupant of the raft was a powerful-framed man, evidently a Russian, with full beard and long straggling locks.\n\u003cbr\u003e \n\u003cbr\u003e His face was ghastly white and he clung feebly to the raft and waved his arms wildly.\n\u003cbr\u003e \n\u003cbr\u003e Above his waist he was naked, and to one wrist was fastened a manacle. He was evidently nigh starved and half dead from exposure.\n\u003cbr\u003e \n\u003cbr\u003e “Whist there!” shouted Barney. “Who the mischief are yez?”\n\u003cbr\u003e \n\u003cbr\u003e The man replied, but it was in the Russian tongue which the Celt did not understand.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1927/55360.html","bookId":881,"creation":"Aug 5, 2019 10:25:54 AM","modification":"Aug 5, 2019 10:25:54 AM"}
