{"id":83186,"no":12,"title":"Page 12","content":"\u003cp\u003e“Cinderella,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“The Lord, Lord Worgl, built it as close to the Trieux Royal Palace as he could,” Cinderella said, spearing her makeshift flag in the direction of the palace. The prism-like points of the palace towers could be seen from just about anywhere in Werra, but they were especially close now. “He desired to be close to his lady love, although the princess scorned him. One day when he approached her in the public gardens, the princess’s dog bit him. The bite grew infected, and Lord Worgl was rushed home to his manor in Erlauf. He nearly died from the bite, and he lost a finger in the process. It was not all in vain, for he fell in love with and married the woman who nursed him back to health, earning him the nick-name One-Less-Worgl—the man who is credited with inventing the Erlauf tricorner hat, which can be adjusted without a thumb.”\u003c/p\u003e\n\u003cp\u003e“Do you plan on doing this the whole time?” the Colonel said, his head lolling to the side.\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003eThe Colonel indicated to Cinderella’s flag. “The history lesson. You cannot possibly mean to take me on a guided tour all afternoon.”\u003c/p\u003e\n\u003cp\u003eCinderella batted her eyes. “I only want you to get your money’s worth, sir.”\u003c/p\u003e\n\u003cp\u003e“So this is your part-time job? Historic tours?”\u003c/p\u003e\n\u003cp\u003e“Historic Tours of locations from Erlauf Lore, yes,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“So if I pay you another silver coin, can we stop the tour, discard the chaperon, and go eat?” Friedrich said, turning to stare at the Aveyron housemaid that trailed approximately five feet behind him.\u003c/p\u003e\n\u003cp\u003eOh yes. I really hate him for being rich, Cinderella thought as the housemaid sniffed and fanned herself with a paper fan.\u003c/p\u003e\n\u003cp\u003eCinderella kept her expression pleasant as she spoke. “Forgive me, sir, but it would be improper for us to be without a chaperone, and I could not stand to see you overpay me so.”\u003c/p\u003e\n\u003cp\u003eIt was amazing how intensely the Colonel could stare with one eye. “I see,” he said, the two words dripped with sarcasm. (He must have known she overcharged him a great deal for the “tour,” and that her maid was no proper chaperone, but was there to ensure he did nothing…untoward. Even if it was a little late, Cinderella would try to mind the wisdom of her fellow market stall sellers.) “Is there any way I can convince you this history lesson is unnecessary?”\u003c/p\u003e\n\u003cp\u003e“None whatsoever,” Cinderella said, her voice sunny and bright. “If you look to your left, you will see the Reflective Pool of Serenity. It is empty now, but previously it held a family of gold-scaled fish. Those fish, or their ancestors more correctly, were gifts from the Erlauf King Cristoph II.”\u003c/p\u003e\n\u003cp\u003eThe Colonel didn’t try to mask his impatient sigh, but he trailed behind Cinderella with remarkable perseverance. After the first hour, Cinderella thought she would have shaken him off, but the persistent Erlauf officer stayed with Cinderella until her voice died just before sunset.\u003c/p\u003e\n\u003cp\u003e“And that was why pointed shoes went out of fashion,” Cinderella said, her voice rough like sandpaper. She gave the Aveyron maid a grateful smile when the woman offered her a water skin.\u003c/p\u003e\n\u003cp\u003eThe Colonel squinted at the red horizon. “Are you done now?” he asked as Cinderella drank her fill.\u003c/p\u003e\n\u003cp\u003e“Yes, I think so,” Cinderella said, handing the water skin back to the maid.\u003c/p\u003e\n\u003cp\u003e“You sound like a camel.”\u003c/p\u003e\n\u003cp\u003e“I would not know what a camel sounds like, sir,” Cinderella said, resting a hand on her throat. Never before had she given such an ungodly long tour. She almost bored herself to tears. How did the Colonel endure it?\u003c/p\u003e\n\u003cp\u003e“Excellent. Shall we stop at an inn or pub to get you a drink?” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“I must respectfully decline, sir, for I am expected at home,” Cinderella said, her voice giving out several times.\u003c/p\u003e\n\u003cp\u003eThe Aveyron maid nodded in approval.\u003c/p\u003e\n\u003cp\u003e“Of course,” the Colonel said, as sweet as sour dough.\u003c/p\u003e\n\u003cp\u003e“I hope you enjoyed the tour. Have a good night, sir,” Cinderella said, curtseying. She—and the maid—turned away from the Colonel when the officer called out after her.\u003c/p\u003e\n\u003cp\u003e“Tomorrow, then?”\u003c/p\u003e\n\u003cp\u003eCinderella stopped and turned to face him. She struggled several times to speak before she could make her tired voice say, “I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“I will pay you another silver coin for your afternoon, if you are willing,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella frowned. “You want to do this again?”\u003c/p\u003e\n\u003cp\u003e“I was hoping you would be willing to forgo the history lesson.”\u003c/p\u003e\n\u003cp\u003eCinderella opened her mouth to reply, but the Colonel beat her to the punch. “No, I shall spare your camel-voice and answer for you: you will insist on another sightseeing tour with the chaperone?”\u003c/p\u003e\n\u003cp\u003e“If you wish to spend the afternoon together,” Cinderella said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-12.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
