{"id":83189,"no":15,"title":"Page 15","content":"\u003cp\u003e“This is the fourth day you have been gone from Werra. I thought your absence was an indicator of poor health. Although you seem to be quite well,” the Colonel said, his eyes traveling the length of Cinderella’s body.\u003c/p\u003e\n\u003cp\u003e“I am fine, but I thank you for the inquiry,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eThe Colonel clasped his arms behind his back. “What kept you from the market?”\u003c/p\u003e\n\u003cp\u003e“I was needed here in Aveyron,” Cinderella said, lying through her teeth. Besides deciding what items to sell, there was very little Cinderella could do at Aveyron except get in the way of the servants.\u003c/p\u003e\n\u003cp\u003e“You will soon return to spending your days in Werra?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Cinderella reluctantly said. The extra coin she received from the Colonel kept her fortified for the past few days, but she had to return to Werra for reasons besides money.\u003c/p\u003e\n\u003cp\u003e“I am heartened to hear that. May I place an early reservation on your afternoon—and your maid’s afternoon, I suppose?”\u003c/p\u003e\n\u003cp\u003eCinderella studied the Colonel. “Haven’t you tired of history, or my voice?” Cinderella asked, her tone closer to sincerity than the stiff politeness she usually used.\u003c/p\u003e\n\u003cp\u003e“Not yet,” the Colonel smirked.\u003c/p\u003e\n\u003cp\u003eCinderella briefly closed her eyes. “Very well. I shall see you tomorrow afternoon?”\u003c/p\u003e\n\u003cp\u003e“I eagerly await the moment. Until then, be in good health,” the Colonel said, tipping his hat to Cinderella before he made for the door.\u003c/p\u003e\n\u003cp\u003eThe footman leaped to open the door for the Colonel, and slammed it on the officer’s heels. Although the footman said nothing, the look of distaste on his face was clear.\u003c/p\u003e\n\u003cp\u003e“I agree,” Cinderella said. She shivered in the chill of the chateau and wrapped her arms around herself before she made her way back to the library where the rugs awaited. She was almost out of the entrance when her step-mother, Lady Klara, called.\u003c/p\u003e\n\u003cp\u003e“Cinderella,” she said. Her voice was crystallized ice: sharp, jagged, and as cold as winter.\u003c/p\u003e\n\u003cp\u003e“Yes, Step-Mother?” Cinderella said, brandishing the title like a weapon.\u003c/p\u003e\n\u003cp\u003eLady Klara was just as cold as her voice with icy eyes and hair the color of a stormy sky. She always stood straight, as if she had an icicle pressed to her back, and her expression was cool. Today, probably due to Cinderella’s heavy-handed words, her top lip curled in a sneer. “There was an Erlauf guest?” she asked as she elegantly descended the staircase that led to the second floor of the chateau.\u003c/p\u003e\n\u003cp\u003e“Yes, Step-Mother.”\u003c/p\u003e\n\u003cp\u003e“They did not wish to see me?”\u003c/p\u003e\n\u003cp\u003e“No, Step-Mother. He was here for me,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eLady Klara folded her hands in front of her. “I see. I apologize for detaining you so. Carry on.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Step-Mother,” Cinderella said, curtseying before she fled the room, shivering. Lady Klara had that effect on her. The woman never liked Cinderella’s father, and Cinderella was no better in her eyes.\u003c/p\u003e\n\u003cp\u003eCinderella co-existed with her step—family because their presence made her unmarried state possible. Without them, Cinderella would not be chaperoned, and Aveyron would be snatched from her by the queen of Erlauf before Cinderella could turn eighteen.\u003c/p\u003e\n\u003cp\u003eHowever, whatever positives there were to their presence, Cinderella still disliked them—and the feeling was mutual. Lady Klara was from Erlauf. She was the widow of an army officer who was slain in battle.\u003c/p\u003e\n\u003cp\u003eHousing the enemy, feeding them, and seeing to their desires rankled Cinderella. Thankfully, they seemed to dislike their housing situation as much as Cinderella did, and mostly kept to their rooms or spent all of their time with other Erlauf friends.\u003c/p\u003e\n\u003cp\u003e“It seems those from Erlauf will not give me rest,” Cinderella said. “I wish they would all just leave.”\u003c/p\u003e\n\u003cp\u003e“The Erlauf Count Linz once stayed here. During his visit he…,” Cinderella trailed off as she watched another squad of Erlauf soldiers troop past. They seemed to be out in high numbers today. She would have to wait to perform one of her less-than-legal errands thanks to the sudden influx.\u003c/p\u003e\n\u003cp\u003e“Cinderella?” the Colonel said, shattering Cinderella’s thoughts.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“What did this count do during his stay?” the Colonel said before he yawned.\u003c/p\u003e\n\u003cp\u003e“He broke his toe and hobbled for the rest of his life. This way, please,” Cinderella said, holding up her makeshift flag as she led the Colonel and her maid deeper into the historic district of Werra.\u003c/p\u003e\n\u003cp\u003e“You made that up,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“I did not.”\u003c/p\u003e\n\u003cp\u003e“You must have. You cannot tell me a Trieux history book would contain that kind of information. No Erlauf historic text would.”\u003c/p\u003e\n\u003cp\u003e“It’s true,” Cinderella said, passing five soldiers as she led the Colonel through what remained of the Royal Gardens.\u003c/p\u003e\n\u003cp\u003e“Mademoiselle!”\u003c/p\u003e\n\u003cp\u003eCinderella paused, recognizing the voice.\u003c/p\u003e\n\u003cp\u003e“Mademoiselle Cinderella,” a young boy called as he scurried to catch up.\u003c/p\u003e\n\u003cp\u003eCinderella squinted, recognizing the young boy as a servant from Aveyron. If memory served her correctly he was the youngest shepherd in the duchy. “Yes, Florian?” she asked.\u003c/p\u003e\n\u003cp\u003e“Vitore sent me. She needs assistance,” the young boy said, panting.\u003c/p\u003e\n\u003cp\u003e“Is something wrong?”\u003c/p\u003e\n\u003cp\u003eFlorian shook his head. “Customer bought out all our potatoes for the day.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-15.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
