{"id":83191,"no":17,"title":"Page 17","content":"\u003cp\u003e“What about you? You aren’t a no-name. They could be after you,” the Colonel argued as Cinderella abandoned her flag and indicated he should follow her.\u003c/p\u003e\n\u003cp\u003e“Why would they kill me with Trieux—fletched arrows?” Cinderella asked, jumping a toppled wall before she darted into what once was an office. It was one of the few room in the building in which all four walls were still intact.\u003c/p\u003e\n\u003cp\u003eThe Colonel said nothing, but stepped in front of Cinderella, as if to take the lead. “No you don’t,” Cinderella said, sliding in front of him. “You have no idea where we are. I’m leading.”\u003c/p\u003e\n\u003cp\u003e“The situation has changed, Lady Lacreux. This is no historic tour,” the Colonel said. Somewhere along their flight, he had unsheathed his sword. He held it so naturally at his side Cinderella hadn’t noticed it until he brought it near to her body.\u003c/p\u003e\n\u003cp\u003e“Don’t you think I know that? But you cannot fight five men. We have no choice; we must retreat. You don’t know where we are, and I do; therefore, I lead,” Cinderella said, starting through an open doorway.\u003c/p\u003e\n\u003cp\u003e“You’re a civilian. You aren’t trained in evasion techniques.”\u003c/p\u003e\n\u003cp\u003eCinderella snorted. “I’m certainly a great deal more trained at evading in Werra than you are,” Cinderella said, heading for a winding staircase posted in the corner of the room. It led to the second floor, which was visible through great, gaping holes in the ceiling.\u003c/p\u003e\n\u003cp\u003e“Are you kidding? This cannot be stable enough to hold us,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“Would you stop fussing and just follow me? You’re wasting time,” Cinderella said, halfway up the staircase.\u003c/p\u003e\n\u003cp\u003e“This is insane.”\u003c/p\u003e\n\u003cp\u003e“Walk only where I walk,” Cinderella instructed when the Colonel joined her on the second floor.\u003c/p\u003e\n\u003cp\u003eCinderella edged down the hallway, navigating her way through yawning chasms and weak floors. Although the air was cool, sweat beaded on her forehead. She tensed when a floorboard creaked when the Colonel stepped on it, but it held him.\u003c/p\u003e\n\u003cp\u003eWhen Cinderella heard footfalls on the stairs, she led the Colonel into a side room. Most of the floor was gone. Cinderella thought the Colonel would hiss something at her, but he was quiet and faced the hallway, crouched in a defensive position.\u003c/p\u003e\n\u003cp\u003eCinderella grabbed a ladder that leaned against the closest wall. With the ease brought by practice, she lowered the ladder across the hole. She fixed it between two support beams, creating a precarious bridge.\u003c/p\u003e\n\u003cp\u003e“Come on,” Cinderella said crawling across the hole.\u003c/p\u003e\n\u003cp\u003e“Will it hold me?” the Colonel asked.\u003c/p\u003e\n\u003cp\u003e“I should think so. A quite obese soldier used it once and it didn’t budge then. Come,” Cinderella bid.\u003c/p\u003e\n\u003cp\u003eRather than shuffle across on his knees, as Cinderella had done, the Colonel stooped and leaped from rung to rung, his sword outstretched.\u003c/p\u003e\n\u003cp\u003eThe ladder buckled, but the Colonel safely crossed. Cinderella hauled the ladder across the gap. A lavender fletched arrow struck the ladder from below.\u003c/p\u003e\n\u003cp\u003eThe assailants worked soundlessly. They did not call to one another, but Cinderella could hear the pattern in their footfalls.\u003c/p\u003e\n\u003cp\u003eCinderella slid the ladder across the small bit of floor and threw a rock into the next room. She stepped up onto the crumbling outer wall—which was only a foot or two above the floor—and motioned for the Colonel to join her. When he did, she took another brick and threw it into the room she slid the ladder into.\u003c/p\u003e\n\u003cp\u003eCinderella heard the thud of an arrow embedding into wood in the next room—her mislead had worked—before she picked her way along the crumbling perimeter wall.\u003c/p\u003e\n\u003cp\u003eCinderella and the Colonel shuffled along, traveling the length of the building. When they reached the far end—the same end at which they entered the ruins—Cinderella shimmied down a thick length of ivy.\u003c/p\u003e\n\u003cp\u003eWhen she reached the ground, the Colonel slid halfway done the vine before letting go and dropping with the elegance of a cat.\u003c/p\u003e\n\u003cp\u003eIt was unfortunate, but besides the rubble, Alsace was stranded in an expanse of green lawn. Thankfully, once they cleared the park, soldiers were close.\u003c/p\u003e\n\u003cp\u003e“We go this way,” Cinderella whispered, pointing in the direction of the Royal Trieux Library. “There are more patrols there. We will run into reinforcements faster. Ready?”\u003c/p\u003e\n\u003cp\u003e“Yes,” the Colonel said before he and Cinderella started running.\u003c/p\u003e\n\u003cp\u003eCinderella was grateful for her knee-length skirts—sprinting in a full-length dress would have been torture—although she kicked up pebbles that stung her bare skin.\u003c/p\u003e\n\u003cp\u003eCinderella didn’t hear the soldiers, but the Colonel must have, for he wrenched Cinderella aside just in time to avoid getting hit by an arrow.\u003c/p\u003e\n\u003cp\u003eA soldier with a bow stood on the second floor of the ruins. He fitted another arrow to his bow as one of his companions chased after Cinderella and the Colonel, Trieux sword extended.\u003c/p\u003e\n\u003cp\u003eThe Colonel dragged Cinderella in a serpentine pattern, snaking back and forth. It kept the archer from taking an easy shot, but it let the soldier with the sword catch up. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-17.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
