{"id":83192,"no":18,"title":"Page 18","content":"\u003cp\u003eThe archer shot at the Colonel just before they darted in between two buildings. He missed, but they weren’t safe yet. There were still another two blocks to run before they could join the swirling masses of Werra.\u003c/p\u003e\n\u003cp\u003eCinderella yelped when the pursing soldier caught the hem of her skirts and yanked her backwards.\u003c/p\u003e\n\u003cp\u003eThe Colonel could have left Cinderella there. If he was smart, he would have. Instead, he lunged after her. He sliced through Cinderella’s skirts—shortening the back by several inches but freeing her—and kneed the soldier in the side.\u003c/p\u003e\n\u003cp\u003eHe nailed the soldier in the sternum with the hilt of his sword, driving the man back, before grabbing the soldier by the throat and smashing his head against a wall.\u003c/p\u003e\n\u003cp\u003eThe man wore a helmet—so it did not knock him out—but it jarred him enough that the Colonel was able to kick his feet out from under him and slam him to the ground.\u003c/p\u003e\n\u003cp\u003e“Keep running,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eGuessing what he was about to do, Cinderella turned on her heels and fled.\u003c/p\u003e\n\u003cp\u003eThe Colonel joined her a few moments later, his sword red with blood.\u003c/p\u003e\n\u003cp\u003eCinderella shivered, her blood chilled, but she could hear the noises of activity and animals. She sucked in air before screaming, “HELP!”\u003c/p\u003e\n\u003cp\u003eThe Colonel blew a metal whistle and hauled Cinderella along by her elbow. They ran an additional block before they were surrounded by a sea of Erlauf soldiers wearing the dragon-plate-like armor and dressed in Erlauf burgundy.\u003c/p\u003e\n\u003cp\u003e“Five men. One is down one street back, dead. Two archers, one dagger user, and another swordsman,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eTwo squads peeled off from the mass of soldiers, heading for the ruins of Alsace. The remaining soldiers moved into an organized, protective formation around Cinderella and the Colonel.\u003c/p\u003e\n\u003cp\u003eCinderella stared at the Colonel’s bloodied sword.\u003c/p\u003e\n\u003cp\u003e“Cinderella.”\u003c/p\u003e\n\u003cp\u003eCinderella snapped her head up so fast her neck cracked. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Are you well? Were you hurt?” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” Cinderella said, her voice sounding muffled and echo-y to her ears.\u003c/p\u003e\n\u003cp\u003e“It’s important—the weapons were likely laced with poison. Did the swordsman even graze you?” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella rocked back and forth on her feet. “No. I stumbled in the ruins, but that’s all,” she said, her eyes falling back to the Colonel’s sword. “I don’t feel very well,” she said before her legs gave out underneath her.\u003c/p\u003e\n\u003cp\u003eSomething roared in her ears. All Cinderella could think of was the Colonel’s red sword and the man he killed. She was vaguely aware that the soldiers around her stirred.\u003c/p\u003e\n\u003cp\u003e“—see she receives medical attention for you, sir.”\u003c/p\u003e\n\u003cp\u003e“No, I will take her there myself. It’s just shock, I think. No small wonder. I doubt she was ever chased by assassins before,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella felt arms around her before she was picked off the ground. She would have protested, but her vision was blurry, and it felt like her heart might pop out of her chest.\u003c/p\u003e\n\u003cp\u003e“She didn’t run off and leave you?”\u003c/p\u003e\n\u003cp\u003e“No. I’m ashamed to admit it, but she was the one who noticed…”\u003c/p\u003e\n\u003cp\u003e“—brave little thing.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eCinderella’s head rolled back against her will, and she lost track of the conversation as her stomach heaved. “I’m going to be sick,” she said.\u003c/p\u003e\n\u003cp\u003eThe Colonel and his soldiers didn’t react fast enough.\u003c/p\u003e\n\u003cp\u003eHalf an hour later, Cinderella sat in a guardhouse with a steaming cup of tea in front of her. Two soldiers were posted at the door, stone-faced and holding wicked-looking scythes.\u003c/p\u003e\n\u003cp\u003e“May I go home?” Cinderella meekly asked.\u003c/p\u003e\n\u003cp\u003eThey ignored her.\u003c/p\u003e\n\u003cp\u003eCinderella looked back at her tea, inhaling the soothing, herbal scent.\u003c/p\u003e\n\u003cp\u003eThe Colonel entered the room, his hair damp—probably from bathing—and wearing a fresh uniform.\u003c/p\u003e\n\u003cp\u003eCinderella guilty looked away. “I apologize,” she said.\u003c/p\u003e\n\u003cp\u003e“It was understandable. Normally, I would have let you lie down where you were, but I did not want to leave you so close to danger,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella grimaced, upset with herself and with the Colonel. It wasn’t her fault she couldn’t stand the slaughter. But there was something shameful about throwing up on the man who was carrying her to safety.\u003c/p\u003e\n\u003cp\u003e“The nurse reported you were fine,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella leaned into the steam of her cup. “Yes. May I please go home now?”\u003c/p\u003e\n\u003cp\u003e“Not yet,” the Colonel said, taking a seat across from Cinderella. He clasped his hands together and stared at her with an alarming amount of intensity. “Why?”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“Why did you tell me? You could have made an excuse and left. They would not have followed you. Why did you run with me?” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella pressed her lips together and said nothing.\u003c/p\u003e\n\u003cp\u003eThe silence stretched between them, twisting around Cinderella like a snake.\u003c/p\u003e\n\u003cp\u003e“Why not?” Cinderella finally said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-18.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
