{"id":83194,"no":20,"title":"Page 20","content":"\u003cp\u003e“What is she like?”\u003c/p\u003e\n\u003cp\u003e“She is unexpectedly kind. She hides her hot temper behind pretty words and manners, but her loyalty goes deeper than the oceans,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“Is she beautiful?” Merrich asked, folding his arms across his chest.\u003c/p\u003e\n\u003cp\u003e“She is exotic.”\u003c/p\u003e\n\u003cp\u003e“Funny, I never thought you would be able to like, much less love, a Trieux brat.”\u003c/p\u003e\n\u003cp\u003e“I did not think I would either, but Cinderella…” Friedrich trailed off. “I want her,” he said.\u003c/p\u003e\n\u003cp\u003eMerrich strolled into the office and ruffled Friedrich’s hair. “I’m so happy for you. Congratulations, good boy.”\u003c/p\u003e\n\u003cp\u003e“I’m not a dog,” Friedrich said, kicking his friend away. “And even if I’ve decided on her, she still hates me.”\u003c/p\u003e\n\u003cp\u003e“So you have your work cut out for you? That makes it all the more fun. You’ve always enjoyed a good challenge.”\u003c/p\u003e\n\u003cp\u003e“She’s filled with hate,” Friedrich said, ruefully smiling.\u003c/p\u003e\n\u003cp\u003e“Do you want some help with her?” Merrich asked.\u003c/p\u003e\n\u003cp\u003e“Please, no. You would make her hate me more,” Friedrich said, standing up in a liquid movement of deadly elegance.\u003c/p\u003e\n\u003cp\u003eMerrich chuckled and slapped Friedrich on the back. “When will you tell your men the good news?”\u003c/p\u003e\n\u003cp\u003e“Not for as long as I can avoid it.”\u003c/p\u003e\n\u003cp\u003e“They’re busy bodies. They’ll find out soon enough.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“I can’t wait.”\u003c/p\u003e\n\u003cp\u003eFriedrich slung an arm across Merrich’s shoulders and dragged him into a headlock. “If you tell them, I will pay a social visit to your mother.”\u003c/p\u003e\n\u003cp\u003e“That’s playing dirty,” Merrich said.\u003c/p\u003e\n\u003cp\u003e“Perhaps, but you keep your patty-paws out of my love affairs.”\u003c/p\u003e\n\u003cp\u003e“Got it. I’ll leave the Trieux Troll alone.”\u003c/p\u003e\n\u003cp\u003e“Her name is Cinderella.”\u003c/p\u003e\n\u003cp\u003e“Could you have said that and sounded anymore love-sick?”\u003c/p\u003e\n\u003cp\u003e“Shut up. Let’s go eat.”\u003c/p\u003e\n\u003cp\u003e“After you, lover-boy.”\u003c/p\u003e\n\u003cp\u003e“I hope she slaps you in the face when she meets you,” Friedrich grumbled.\u003c/p\u003e\n\u003cp\u003e“More and more, your descriptions of her intrigue me. You call her exotic and theorize she would punch me. She must be built like an ox.”\u003c/p\u003e\n\u003cp\u003eFriedrich briefly reminisced on Cinderella’s beauty: her adorable button nose and the breath-taking combination of her brilliant red hair, the dusting of freckles, and stormy gray eyes. It was doubtful there was a man alive who would call her anything but beautiful…but Merrich was unfortunately handsome and of the same military rank as Friedrich…\u003c/p\u003e\n\u003cp\u003e“Her build is…,” Friedrich trailed off misleadingly.\u003c/p\u003e\n\u003cp\u003e“Thought so. Why else wouldn’t one of the other Trieux tramps snatch her up for their sons? At least she has that charming personality, eh?” Merrich said.\u003c/p\u003e\n\u003cp\u003e“At least,” Friedrich echoed, a smirk hanging from his lips. He needed time to sweeten Cinderella up to him and his country, but when she finally came around, he was going to take great delight in introducing her to Merrich. “Her gait is…impressive.”\u003c/p\u003e\n\u003cp\u003e“She scuttles, does she? Well, Mutti always said personality and intellect are more important than beauty.”\u003c/p\u003e\n\u003cp\u003e“Did she? Your mother is a wise woman,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“Of course she is. Anyway, you could probably hire trainers or something for your future Trieux misses. They could help. Maybe.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eThe day after the attack against Colonel Friedrich, Cinderella broke into the Trieux Royal Library.\u003c/p\u003e\n\u003cp\u003eAs a result of the increased patrols city-wide, the patrols around the library were lessened to free up soldiers. Cinderella may not get another good chance for her illegal activity, so she waited until the late afternoon before she went to Werra, making her way to the closed library.\u003c/p\u003e\n\u003cp\u003eA kerchief tied over her eye-catching hair served as her poor disguise, but none of the patrolling soldiers looked twice at her, so Cinderella judged the time to be perfect.\u003c/p\u003e\n\u003cp\u003eShe hummed as she walked to the back end of the library, which was pressed against the backside of the Trieux House of Lords—where the Trieux nobility used to meet to vote on matters of the country.\u003c/p\u003e\n\u003cp\u003eBoth buildings were closed, so Cinderella only had to worry about outdoor activities.\u003c/p\u003e\n\u003cp\u003eCinderella kept her gait slow and even, acting unconcerned as she adjusted the basket on her arm. “Rats,” she said when she rounded the corner. The back window she used to squirm indoors was boarded up from the inside.\u003c/p\u003e\n\u003cp\u003eCinderella pushed against the wooden block, testing its strength. It didn’t budge.\u003c/p\u003e\n\u003cp\u003e“So much for that route—although it took them months to figure out that was how I got in. Where else can I…ah-hah,” Cinderella said when she spied an open window. It was higher up, well above Cinderella’s head, but its wooden shutters hung, barely secured enough to shield the open window from the weather. The scarcely useful shutters were casualties from the mistreatment the building suffered when Erlauf marched against the capital. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-20.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
