{"id":83195,"no":21,"title":"Page 21","content":"\u003cp\u003eCinderella traveled the back end of the building to peer around either corner. A patrol wasn’t due for a few minutes, but one could never be too careful.\u003c/p\u003e\n\u003cp\u003eCinderella retreated to the window and pushed a crate against the wall. She was still too short to reach the wooden sill. Cinderella piled several planks on the crate before she tried again.\u003c/p\u003e\n\u003cp\u003eCinderella stood on her tip toes, and still lacked the height. She jumped and her hands brushed the window sill, but she wasn’t strong enough to pull herself up. She hung there for the barest moment before her arms gave out, and she fell back on the crate.\u003c/p\u003e\n\u003cp\u003eShe placed her hand on her hips and glared at the wall before she tried climbing up, wedging her fingers and feet in cracks and gaps between the stone blocks that made up the library.\u003c/p\u003e\n\u003cp\u003eShe climbed up only one layer of the blocks when a voice behind her said, “So you’re the lawbreaker that’s been evading my men for the past year?”\u003c/p\u003e\n\u003cp\u003eCinderella shrieked, lost her grip, and fell back on the crate. She lost her balance and toppled over the side. Cinderella rubbed her stinging side as she boosted herself into an upright position. “Ah, Colonel Friedrich. What a surprise it is to see you here,” Cinderella said when she realized who stood with her in the back alley.\u003c/p\u003e\n\u003cp\u003eIt was her rotten luck he would find her.\u003c/p\u003e\n\u003cp\u003e“This explains those skills of evasion you displayed yesterday. You had months of practice from leading soldiers on long, merry chases whenever they happened upon you clawing your way inside the library,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“What? Do you mean—? No, I would never attempt to break and enter! Why, I was trying to secure the open window, of course. Do you know how much damage the wind and rain could do to the books? It surely is an oversight to leave it open,” Cinderella said, gravely shaking her head as she planned her exit. It made her uneasy to be alone with him.\u003c/p\u003e\n\u003cp\u003eThe Colonel narrowed his eye. “It’s impressive you’ve evaded attention so long with your illicit actions. Although I suppose I cannot blame my men for not finding you. I hardly recognized you myself with your hair covered so skillfully.”\u003c/p\u003e\n\u003cp\u003e“What? Sir, I am offended by your presumptions,” Cinderella said, looking down her nose at the Colonel as he gathered up her basket.\u003c/p\u003e\n\u003cp\u003e“Don’t tell me you go in there to actually use the library?” the Colonel said, going over the contents of her basket: a bottle of cheap, ash-based ink; two quills; matches; and curls of birch bark.\u003c/p\u003e\n\u003cp\u003e“I, sir, am a law-abiding citizen. As such, I would not enter the library as it is currently outlawed,” Cinderella said, brushing off her skirt. “But as you are here, I imagine you can deal with the unsecured window yourself. Would you be so kind as to give me back my things, sir?”\u003c/p\u003e\n\u003cp\u003e“Friedrich,” the Colonel said, setting the basket down. “Come here.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?” Cinderella asked.\u003c/p\u003e\n\u003cp\u003eThe Colonel wriggled his fingers in a come-closer gesture.\u003c/p\u003e\n\u003cp\u003eCinderella minced over to the Colonel. “What,” she started. “Do you want—put me down!” she shrieked when the Colonel picked her up by her waist.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Cinderella hissed as the Colonel climbed the crate.\u003c/p\u003e\n\u003cp\u003e“Helping you break the law. Can you reach the ledge?”\u003c/p\u003e\n\u003cp\u003eHeld higher, the ledge was shoulder-height. “Yes,” Cinderella said, scrambling to grasp the ledge. She set her feet against the stone exterior wall and tried to climb in. She shrieked when the Colonel pushed against her backside—boosting her up and touching her posterior. “Sir! This is highly improper!”\u003c/p\u003e\n\u003cp\u003eThe Colonel only chuckled.\u003c/p\u003e\n\u003cp\u003eCinderella purposely booted him in the neck before she squirmed through the window, falling inside. She landed on a narrow walkway set a foot or two down from the window.\u003c/p\u003e\n\u003cp\u003eCinderella poked her head out the window. “My basket?”\u003c/p\u003e\n\u003cp\u003e“Coming up with me,” the Colonel said, tying the basket to his belt. The Colonel made the climb much more gracefully. He jumped and grabbed the sill before pushing off the wall with his feet like Cinderella had attempted.\u003c/p\u003e\n\u003cp\u003eA few graceful, slithering movements, and the Colonel eased his way inside.\u003c/p\u003e\n\u003cp\u003e“Wow. It’s a disgrace in here,” the Colonel said, squinting at the dust-coated walkway and railings, and the dusty shelves of books that extended before him like a wooden army.\u003c/p\u003e\n\u003cp\u003e“What do you expect? No one has been allowed in since the takeover,” Cinderella said, snatching her basket from the Colonel’s belt.\u003c/p\u003e\n\u003cp\u003eShe marched down the walkway, taking a set of rickety stairs to the base floor.\u003c/p\u003e\n\u003cp\u003e“It’s getting dark. Will you be able to see in here well enough to read?” the Colonel asked.\u003c/p\u003e\n\u003cp\u003eAs he had all but thrown her inside, Cinderella estimated the Colonel wasn’t likely to drag her off to jail. His manners seemed to promise that he would not do anything indecent, even though they were alone, either. So she replied, “There are candles,” as she orientated herself in the library and looked for the places where, in previous trips, she upset clouds of dust.\u003c/p\u003e\n\u003cp\u003e“Funny, you don’t strike me as the reading type,” the Colonel said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-21.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
