{"id":83196,"no":22,"title":"Page 22","content":"\u003cp\u003e“I’m not,” Cinderella said, leading the way between two rows of books.\u003c/p\u003e\n\u003cp\u003e“You must be. Why else would you break in a library? Unless…do you hawk the books?”\u003c/p\u003e\n\u003cp\u003e“What? No! First of all, what kind of lowlife steals from a library? And secondly, all the books have the Trieux royal seal on them. Only a madman would buy something with the Trieux seal these days,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“It does not escape me you have a moral and a practical reason for your lack of black-market selling,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“I’m not here to read for fun, nor am I hear to steal,” Cinderella said, stopping at a shelf partially cleared of dust.\u003c/p\u003e\n\u003cp\u003e“Then what are you here for?”\u003c/p\u003e\n\u003cp\u003e“Research,” Cinderella said, selecting several volumes of leather-bound books before she walked deeper into the library.\u003c/p\u003e\n\u003cp\u003eIn the very center of the library were several desks pushed together to form a work station. There were unlit candles placed in half globes of silver. Cinderella set her books down in the dying light before she dug out the matches from her basket and lit two of the candles.\u003c/p\u003e\n\u003cp\u003eThe silver globes let Cinderella direct the candlelight to make a sort of spotlight, and they sheltered the light from twinkling up to the ceiling—a light source patrolling soldiers were sure to notice.\u003c/p\u003e\n\u003cp\u003eThe Colonel pawed through one of the books Cinderella stacked in front of her. “Farming? You’re researching farming techniques?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Cinderella said, opening her ink set and dipping a quill in it before she started taking notes on the scraps of birch bark.\u003c/p\u003e\n\u003cp\u003e“I don’t understand. Why?”\u003c/p\u003e\n\u003cp\u003e“In case you have forgotten, sir, I am a lady. My upbringing did not include classes on crop rotation, field yields, and formulating fertilizer.”\u003c/p\u003e\n\u003cp\u003e“What about your servants? Don’t they know about farming?”\u003c/p\u003e\n\u003cp\u003e“The basics, yes. But they knew only what we grew. Aveyron’s income came mostly from livestock.”\u003c/p\u003e\n\u003cp\u003e“And that’s no longer an option?”\u003c/p\u003e\n\u003cp\u003e“It still is a main source of income, but the taxes your sweet queen imposes on me do not allow for me to waste acreage. I must use all the resources I have available. We can’t keep doing what we always did. We have to expand and investigate other options. Like winter crops. This was the first season we successfully cultivated them since well before my grandfather’s time,” Cinderella said, turning a page in her book.\u003c/p\u003e\n\u003cp\u003e“You should grow flowers,” the Colonel said. “Everyone from Erlauf is crazy about flowers.”\u003c/p\u003e\n\u003cp\u003e“Mmm,” Cinderella said as she scratched out a list of possible summer crops.\u003c/p\u003e\n\u003cp\u003eThe Colonel studied their darkening surroundings. “Any idea where the map books are?”\u003c/p\u003e\n\u003cp\u003e“Before the takeover, I never once set foot in this building in my life. It took me ages to find the agricultural section. I have no idea where to find any other type of book,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Of course. I’m going to have a look around. I’ll be back shortly, Pet,” the Colonel said, striding off into the shadows of the bookcases.\u003c/p\u003e\n\u003cp\u003eCinderella watched him go with narrowed eyes. She needed to talk to someone about the Colonel’s conduct. He toed the line of propriety, but he did not seem serious in pursuing anything lasting.\u003c/p\u003e\n\u003cp\u003eBut who could she talk to? Marie would only push Cinderella to accept Julien or Marcus. Lady Delattre would be a sympathetic ear, but was unlikely to have any useful advice. Lady Klara would be a source of sound advice, as stiff and proper as she was, but Cinderella had a friendlier relationship with the Colonel than she did with her step-mother.\u003c/p\u003e\n\u003cp\u003eWho could she approach?\u003c/p\u003e\n\u003cp\u003eCinderella shook her head and turned her attention to the books. She was better off pondering her problems at a time less pressing than the present. The Colonel was a rogue, to be sure, but he was controlled enough that he would not do anything dark or dangerous to Cinderella.\u003c/p\u003e\n\u003cp\u003eShe would have to be satisfied with that. For now.\u003c/p\u003e\n\u003cp\u003e“Mademoiselle?”\u003c/p\u003e\n\u003cp\u003eCinderella groaned and covered her head with her arms. It had been a long day. All she wanted to do was doze on her bed. Who cared about dinner?\u003c/p\u003e\n\u003cp\u003e“Mademoiselle?”\u003c/p\u003e\n\u003cp\u003e“What is it, Jeanne?”\u003c/p\u003e\n\u003cp\u003e“Lady Klara requests your presence.”\u003c/p\u003e\n\u003cp\u003eCinderella sat up. “What?”\u003c/p\u003e\n\u003cp\u003e“Lady Klara requests your presence in her private rooms,” Jeanne repeated.\u003c/p\u003e\n\u003cp\u003eCinderella slid off her bed. “Did she say why? Did she seem angry?”\u003c/p\u003e\n\u003cp\u003e“She gave no indication why she needed to see you, Mademoiselle,” Jeanne said as they hurried out of Cinderella’s bedroom.\u003c/p\u003e\n\u003cp\u003eCurse me, it’s as if my ponderings from yesterday brought her attention to me. What does she want now? Cinderella thought.\u003c/p\u003e\n\u003cp\u003eWhen they reached the private parlor situated against Lady Klara’s rooms, they stopped.\u003c/p\u003e\n\u003cp\u003eCinderella tried to shake the worst of the wrinkles from her dress and smoothed her short hair into place.\u003c/p\u003e\n\u003cp\u003eJeanne curtsied to her before she knocked on the door.\u003c/p\u003e\n\u003cp\u003e“Come in,” Lady Klara said, her voice its usual tone of ice and snow. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-22.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
