{"id":83199,"no":25,"title":"Page 25","content":"\u003cp\u003e“True,” Marie acknowledged.\u003c/p\u003e\n\u003cp\u003e“And everyone knows Crown Prince Steffen of Arcainia married a commoner. Yes, she has the title of Marquise because she killed the ogre, or troll, or what-have-you who ruled the lands before her, but it wasn’t inherited,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“You are correct,” Marie said.\u003c/p\u003e\n\u003cp\u003e“But you still don’t approve?” the Colonel said.\u003c/p\u003e\n\u003cp\u003eMarie shrugged. “Truly it is none of my affair. I will always advocate for lovers to follow their hearts.”\u003c/p\u003e\n\u003cp\u003e“What do you think, Cinderella?” the Colonel asked.\u003c/p\u003e\n\u003cp\u003eCinderella stared at the basket in her hands. The Colonel’s beginner but well-constructed base was still intact, but the layers Cinderella added were lopsided and filled with holes. “I think I have no talent for basket weaving.”\u003c/p\u003e\n\u003cp\u003eThe Colonel chuckled as he set his basket aside. “You’ll get better. I’m off. It was good to meet you, Marie Raffin,” he said, standing and bowing to both ladies. “Until next time. Stay safe, Pet,” he said, reaching out to brush Cinderella’s cheek with his hand.\u003c/p\u003e\n\u003cp\u003eCinderella leaned out of his range. “Good day to you, sir.”\u003c/p\u003e\n\u003cp\u003eThe Colonel smiled to Marie. “She plays hard to get, but she enjoys it,” he said before ducking out of the tent to avoid the basket Cinderella threw at him.\u003c/p\u003e\n\u003cp\u003e“That man,” Cinderella seethed.\u003c/p\u003e\n\u003cp\u003eMarie twitched the tent diver aside to watch him go. “He’s not what I expected.”\u003c/p\u003e\n\u003cp\u003e“He’s worse, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“No,” Marie hesitated. “I think he may be serious about you.”\u003c/p\u003e\n\u003cp\u003e“What? If that was a joke, it wasn’t very funny, Marie,” Cinderella said, joining Marie to watch Friedrich disappear into the market. Even though he and Cinderella were on good terms, most of the market vendors treated Friedrich with suspicion, whispering behind his back and watching his movements with narrowed eyes.\u003c/p\u003e\n\u003cp\u003e“I wasn’t jesting.”\u003c/p\u003e\n\u003cp\u003e“It makes no sense. Why would a colonel want a penniless Trieux noble—the daughter of someone he hated? Besides, you saw him. He is a charmer and a player.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Marie said. “But how many charmers have you seen sit down and make baskets with those whose hearts they intend to play with?”\u003c/p\u003e\n\u003cp\u003eCinderella froze in the middle of stacking baskets.\u003c/p\u003e\n\u003cp\u003e“What do you think of him?” Marie asked.\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter what I think of him. He could never afford me,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“You don’t know that. He may be rich,” Marie said.\u003c/p\u003e\n\u003cp\u003e“Everyone knows it is mostly the second and third sons of Erlauf nobility who become officers. He has a high social rank and pocket money enough to live comfortably, but he could not possibly supplement Aveyron’s income,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Does he need to?”\u003c/p\u003e\n\u003cp\u003e“Do you really mean to say you would rather see me with that Erlauf rat than Julien or Marcus?”\u003c/p\u003e\n\u003cp\u003e“No. But…”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“You smiled. Your smile has been a rare thing these days.”\u003c/p\u003e\n\u003cp\u003e“It was a sarcastic smile! I find that man to be indecent and barely tolerable. I cannot believe you would even entertain the idea that he would seek to have my hand, and that I would rejoice over it!”\u003c/p\u003e\n\u003cp\u003eMarie shrugged. “Perhaps you are right.”\u003c/p\u003e\n\u003cp\u003e“Of course I am right,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“But if that is the case, if I were you, I would think about how one would decline the suit of such a high-ranking officer.”\u003c/p\u003e\n\u003cp\u003eCinderella looked her friend in the eye. “He isn’t serious, Marie. I am a toy to him.”\u003c/p\u003e\n\u003cp\u003e“Perhaps, but it would be wise of you to prepare. Just in case,” Marie said.\u003c/p\u003e\n\u003cp\u003eCinderella mulishly tucked her chin to her neck, ready to argue her case. The fight deflated her, though, when she remembered the warnings from the market venders that she hadn’t heeded. “Alright,” she agreed.\u003c/p\u003e\n\u003cp\u003e“Thank you, Cinderella.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Cinderella said, puttering with the baskets.\u003c/p\u003e\n\u003cp\u003e“Personally, I am surprised. He seems much more likeable than I would have estimated.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, likeable? He acts like a half-daft yokel.”\u003c/p\u003e\n\u003cp\u003e“I thought his defense of Prince Severin and his bride was quite endearing,” Marie said, her eyes on the ground.\u003c/p\u003e\n\u003cp\u003eCinderella winced at her callous words. Of course Marie—a duke’s daughter but the wife of a merchant—would be touched by his actions.\u003c/p\u003e\n\u003cp\u003e“It was quite honorable of him,” Cinderella said. “Now, what really brought you here?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes. I wanted to talk to you about Colonel Friedrich. I did not think I would get the chance to meet him.”\u003c/p\u003e\n\u003cp\u003e“My apologies for the experience.”\u003c/p\u003e\n\u003cp\u003eMarie laughed. “Cinderella! At the very least, you must admit he makes a better basket than you.”\u003c/p\u003e\n\u003cp\u003e“Thank you for the reminder. I shall have to keep that in mind if I ever decide to pursue the livelihood of basket weaver.”\u003c/p\u003e\n\u003cp\u003e“I have the report from General Harbach,” Merrich said, entering Friedrich’s office.\u003c/p\u003e\n\u003cp\u003e“What report?”\u003c/p\u003e\n\u003cp\u003e“The one detailing the questioning of your would-be killers—that delightful group of men you ran into with your trollish lady love.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-25.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
