{"id":83200,"no":26,"title":"Page 26","content":"\u003cp\u003eFriedrich ignored the taunt. “And?”\u003c/p\u003e\n\u003cp\u003e“It’s not good,” Merrich said, tossing the report on Friedrich’s desk before he sat down in an empty chair. “You were strategically targeted.”\u003c/p\u003e\n\u003cp\u003eFriedrich snorted. “That is hardly a surprise,” he said, paging through the report.\u003c/p\u003e\n\u003cp\u003e“Yes, but that’s not the bad news.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“They weren’t Trieux rebels or advocates,” Merrich said.\u003c/p\u003e\n\u003cp\u003e“I should think not. Even Trieux citizens would not be so stupid as to murder me with Trieux weapons. It would start another wave of persecution and suspicion. Our government would crack down even harder on them,” Friedrich said, propping his military boots up on a footstool.\u003c/p\u003e\n\u003cp\u003e“I don’t believe you are taking this seriously enough,” Merrich said.\u003c/p\u003e\n\u003cp\u003e“Why would you say that?”\u003c/p\u003e\n\u003cp\u003e“Because if they weren’t Trieux rebels, and no one from Erlauf would hurt a hair on your head, that means we have another enemy out there,” Merrich said.\u003c/p\u003e\n\u003cp\u003e“The assailants were paid a private contract?” Friedrich frowned, skimming the papers.\u003c/p\u003e\n\u003cp\u003e“Yes. They met with a handful of contacts in various countries before receiving you as their elimination assignment. It’s all very cloak-and-dagger. What’s most disconcerting is that they were officially hired and dispatched by a dark mage.”\u003c/p\u003e\n\u003cp\u003e“A mage?”\u003c/p\u003e\n\u003cp\u003e“One exiled by the Veneno Conclave, yes. Worst yet, she was only a representative. She didn’t write the contract out of personal spite.”\u003c/p\u003e\n\u003cp\u003e“Whom did she represent?”\u003c/p\u003e\n\u003cp\u003eMerrich shrugged. “They didn’t know. All they said was that she hired them on behalf of an organization or movement of some sort.”\u003c/p\u003e\n\u003cp\u003eFriedrich grimly leaned back in his chair. “I don’t like it,” he said. “A month ago our southern border was plagued with wraiths. Last week, a company from the Fifth Regiment took out a giant, and now we hear my assassins were hired by a mage?”\u003c/p\u003e\n\u003cp\u003e“That’s too much activity from dark magic to be a coincidence,” Merrich said. “We used to get a handful of evil based entity fights per year. Now they happen almost weekly.”\u003c/p\u003e\n\u003cp\u003e“And yet the parts of Erlauf that used to belong to Trieux remain unscathed,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“You think Trieux is somehow involved?”\u003c/p\u003e\n\u003cp\u003e“No. I think whoever or whatever is doing this is lulling them into a false sense of security. Our troubles are not widely publicized, after all.”\u003c/p\u003e\n\u003cp\u003e“What do we do?”\u003c/p\u003e\n\u003cp\u003eFriedrich tapped his fingers on his desk. “I will speak to the Commander. Before we take any serious action, it would be wise to speak to representatives from the Veneno Conclave. We don’t want to step on their toes, after all.”\u003c/p\u003e\n\u003cp\u003eMerrich nodded. “I will tell Hardbutt.”\u003c/p\u003e\n\u003cp\u003eFriedrich rolled his eyes. “One day General Harbach will catch you on that, and he will string you up by your tongue.”\u003c/p\u003e\n\u003cp\u003eMerrich laughed. “Thank you for your concern, but you had best worry about your own neck first. Which reminds me, I saw Diederick earlier today.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“He said to tell you if you got yourself killed by assassins he would refuse to allocate funds for a gravestone or coffin.”\u003c/p\u003e\n\u003cp\u003eFriedrich winced. “Sometimes I wonder how he obtained his high position with his terrible personality.”\u003c/p\u003e\n\u003cp\u003eMerrich slapped his leg and stood. “He’s good at what he does. But enough of our dreary discussion. Work calls, and I intend to go out tonight. Will you come with? Friedrich?” Merrich asked when his friend didn’t respond.\u003c/p\u003e\n\u003cp\u003e“Sorry, just thinking,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“Of what?”\u003c/p\u003e\n\u003cp\u003eFriedrich hesitated. “I had decided to take additional precautions regarding Cinderella’s safety, but I don’t think it’s enough. I might need to place more soldiers on guard duty around her as well.”\u003c/p\u003e\n\u003cp\u003e“That would be wise. You can bet whatever is behind this flux of darkness will aim for her now that you have made your infatuation with her infallibly clear.”\u003c/p\u003e\n\u003cp\u003e“I don’t think she will warm to the idea of strange men following her around.”\u003c/p\u003e\n\u003cp\u003eMerrich shrugged. “So introduce her to them. I’m off. Read the report before you talk to the Commander, please,” Merrich said before disappearing through the door.\u003c/p\u003e\n\u003cp\u003eFriedrich barely noticed his friend’s exit. “Introduce her? Why not? It’s earlier than I wanted them to know of her, but her safety…” Friedrich trailed off. “I’ll do it,” he decided. “It will take some planning, but I will bring Cinderella to the First Regiment.”\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003e“This isn’t the way to the library,” Cinderella said as she followed the Colonel down a side street in Werra.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“You said we were going to the library.”\u003c/p\u003e\n\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“You said you had an easier way to get into the library.”\u003c/p\u003e\n\u003cp\u003e“I lied.”\u003c/p\u003e\n\u003cp\u003eCinderella stopped walking and folded her arms across her chest.\u003c/p\u003e\n\u003cp\u003eWhen the Colonel realized she wasn’t following him anymore, he stopped and retreated to her side. “It was the only way to get you to leave the stand. I want to introduce you to some of my friends.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-26.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
