{"id":83201,"no":27,"title":"Page 27","content":"\u003cp\u003eCinderella narrowed her eyes. “Why?”\u003c/p\u003e\n\u003cp\u003e“I met Marie; I thought it would pleasant if you met some of my men.”\u003c/p\u003e\n\u003cp\u003e“The soldiers under your command, you mean? Why would I want to meet them?”\u003c/p\u003e\n\u003cp\u003eThe Colonel smirked down at Cinderella. “Why wouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m going back,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“I have a farming book.”\u003c/p\u003e\n\u003cp\u003eCinderella stopped and turned around. “What?”\u003c/p\u003e\n\u003cp\u003e“In my office I have a newly purchased book that details farming and growing techniques. If you come with me, I will give it to you,” the Colonel said, adjusting the brim of his military hat.\u003c/p\u003e\n\u003cp\u003eCinderella thought for several seconds. Books were expensive—that was why she was reduced to breaking into the library. With a reference book, Cinderella might not need to perform that illegal activity so often, which would be a blessing. She suspected some of the patrol leaders deduced she was the culprit. Wherever she went, city patrols dogged her steps.\u003c/p\u003e\n\u003cp\u003e“Alright,” Cinderella agreed.\u003c/p\u003e\n\u003cp\u003eThe Colonel’s smug smile said he knew she would agree to the bargain.\u003c/p\u003e\n\u003cp\u003e“But if you are taking me somewhere indecent to meet these chums of yours…”\u003c/p\u003e\n\u003cp\u003e“We’re going to my regiment’s camp. It will be perfectly safe, and your reputation will remain intact,” the Colonel said once again leading the way.\u003c/p\u003e\n\u003cp\u003eThe Colonel’s camp was outside Werra, stationed on parkland previously owned by the Trieux King. What once was a party pavilion was now a mere field washed with burgundy and gray-colored tents.\u003c/p\u003e\n\u003cp\u003eA battalion of soldiers were practicing with their swords, while a company raced their horses farther out. Men swarmed in and out of the camp, going about their duties and preparing for patrols.\u003c/p\u003e\n\u003cp\u003eAs Cinderella and the Colonel entered the campgrounds, most of the soldiers stopped to gawk.\u003c/p\u003e\n\u003cp\u003e“Colonel, is this her?”\u003c/p\u003e\n\u003cp\u003e“Petite little thing, isn’t she?”\u003c/p\u003e\n\u003cp\u003e“You sure she’s Trieux? I never seen hair like that before.”\u003c/p\u003e\n\u003cp\u003eWords became indistinguishable as men crowded around Cinderella and the Colonel. They saluted before speaking their mind, shouting to be heard over one another.\u003c/p\u003e\n\u003cp\u003eThe Colonel ignored the buzz, and seized a soldier by his shoulder and dragged him out of the crush. “Is Merrich here?” the Colonel asked.\u003c/p\u003e\n\u003cp\u003e“No, Sir. Colonel Merrich was called to the palace this morning.”\u003c/p\u003e\n\u003cp\u003e“Excellent,” the Colonel said with a smile.\u003c/p\u003e\n\u003cp\u003eCinderella edged closer to the Colonel as soldiers jostled around her. They remained a respectful distance from her, but there were so many, and they were loud.\u003c/p\u003e\n\u003cp\u003eThe Colonel put an arm around Cinderella’s shoulders. “Men, listen up. This is Duchess Lacreux of Aveyron. I want you to treat her with the respect and honor she’s due.”\u003c/p\u003e\n\u003cp\u003eCinderella slithered out of the Colonel’s arm, shocked when soldiers started whistling and cat calling.\u003c/p\u003e\n\u003cp\u003e“The Colonel’s got a woman!”\u003c/p\u003e\n\u003cp\u003e“Never thought I’d see the day the Colonel was tamed.”\u003c/p\u003e\n\u003cp\u003eCinderella looked at the Colonel, but he was smiling of all things, as if happy with the soldiers’ observations.\u003c/p\u003e\n\u003cp\u003e“That’s enough. Get back to work, you lazy slugs,” the Colonel said after a few minutes of chatter.\u003c/p\u003e\n\u003cp\u003eThe soldiers departed, gossiping and watching Cinderella and the Colonel with interest.\u003c/p\u003e\n\u003cp\u003e“Who is Colonel Merrich?” Cinderella asked.\u003c/p\u003e\n\u003cp\u003e“My goat-footed best friend. You’ll meet him, someday,” the Colonel said, a pleased smile pasted on his lips as he looked out over his camp.\u003c/p\u003e\n\u003cp\u003e“Humph,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Would you like a tour of the grounds?”\u003c/p\u003e\n\u003cp\u003eCinderella self-consciously smoothed her skirts. “Couldn’t we just go to your office?” she asked. She had been so dazzled by the offer of the book she hadn’t thought the situation through. She was marching into the enemy’s camp. These men had killed Trieux soldiers, and under the orders of their queen and her consort, they had killed nobles, too.\u003c/p\u003e\n\u003cp\u003eThe Colonel studied Cinderella before offering his arm—for once acting like a gentleman. “Just a stroll,” he said.\u003c/p\u003e\n\u003cp\u003eCinderella reluctantly placed her hand on his arm and allowed the Colonel to lead.\u003c/p\u003e\n\u003cp\u003e“Our patrol squads leave from this part of the camp. You can see them getting ready for the changeover,” the Colonel said as they neared a field where six organized patrol squads were lined up.\u003c/p\u003e\n\u003cp\u003e“You use dogs?” Cinderella said, noting the presence of at least one black and brown canine with each squad.\u003c/p\u003e\n\u003cp\u003e“The dogs were recently put on patrol thanks to our scramble in the ruins. They are skilled at tracking and catching,” the Colonel said. “Gustav, Ivo.”\u003c/p\u003e\n\u003cp\u003eTwo men from two different squads jogged up to the Colonel. A dog trotted along with each man.\u003c/p\u003e\n\u003cp\u003e“Colonel,” they said in a chorus, saluting him.\u003c/p\u003e\n\u003cp\u003e“Please introduce your fine companions to Lady Lacreux,” the Colonel said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-27.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
