{"id":83202,"no":28,"title":"Page 28","content":"\u003cp\u003e“Lady,” both soldiers said, bobbing forward in bows.\u003c/p\u003e\n\u003cp\u003e“This here is Valor,” one of the soldiers—the younger one with mud-brown hair—said, crouching next to his black and brown dog. The dog’s triangular ears flicked when it heard its name. “She’s been my partner for two years. She’s got the heart of a lion and is a fine lady,” he said, petting the dog.\u003c/p\u003e\n\u003cp\u003eThe dog’s tail thumped on the ground, and she looked up at the soldier with a dog smile before fixing her brown eyes on Cinderella. Her tail wagged more as she looked hopeful, her body quivering in her desire to be petted.\u003c/p\u003e\n\u003cp\u003e“She’s still a little young,” her handler said.\u003c/p\u003e\n\u003cp\u003e“Just like you,” the other soldier muttered.\u003c/p\u003e\n\u003cp\u003eThe Colonel pet Valor, briefly inspecting her ears and teeth before running his hands down her body. “You’ve taken good care of her,” he said.\u003c/p\u003e\n\u003cp\u003e“Thank you, sir,” the soldier saluted.\u003c/p\u003e\n\u003cp\u003eValor, egged on by the Colonel’s attention, went so far as to nudge Cinderella’s hand. Cinderella stroked the dog’s body. The large canine leaned into her, her curly tail flapping like crazy.\u003c/p\u003e\n\u003cp\u003e“And who is your fine looking companion, Ivo?” the Colonel asked, turning to the second soldier—an older, grizzled man.\u003c/p\u003e\n\u003cp\u003e“This is Mammoth,” the soldier, Ivo, said.\u003c/p\u003e\n\u003cp\u003e“How long have you had Mammoth?” Cinderella asked, studying Ivo’s large dog.\u003c/p\u003e\n\u003cp\u003e“Almost eight years, Your Ladyship,” Ivo said, tipping the brim of his hat to Cinderella.\u003c/p\u003e\n\u003cp\u003eMammoth was more controlled than Valor, and made a point to keep his attention hinged on Ivo—as if disgusted by Valor’s eagerness.\u003c/p\u003e\n\u003cp\u003e“Mammoth, greet the lady properly,” Ivo said.\u003c/p\u003e\n\u003cp\u003eTo Cinderella’s surprise and delight Mammoth slid forward on his front paws, bowing to Cinderella.\u003c/p\u003e\n\u003cp\u003e“That’s a boy,” Ivo gruffly said, placing his hand on Mammoth’s head.\u003c/p\u003e\n\u003cp\u003e“Thank you, soldiers,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eSensing the dismissal, Gustav and Ivo saluted the Colonel, bowed to Cinderella, and headed back to their positions. Their dogs followed them, although Valor shook her tail at Cinderella a few times before she hurried after her handler.\u003c/p\u003e\n\u003cp\u003eCinderella and the Colonel left the outpost and moved on to a wooden structure. Builders swarmed around it, climbing the roof and nailing shingles in place. “This is the mess hall, or what passes for one as they finish building it,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eThe building held an assortment of empty tables, two masonry ovens, an earth oven, and a fleet of men and women.\u003c/p\u003e\n\u003cp\u003eThe Colonel led Cinderella to swarming cooks and their hot ovens located in the back of the building. “Berta is the lord and ruler of the kitchens. We’re fed only because of her diligence. Berta, come meet my lady love, Lady Lacreux.”\u003c/p\u003e\n\u003cp\u003eBerta—a large, red-faced woman—wiped her hands on her apron. “So you’ve finally been bested, eh, Sir?” the woman laughed. “You must be quite the woman to tangle with the Colonel. Welcome to the First Regiment,” Berta said to Cinderella.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Cinderella said, aware of all the other cooks and kitchen help staring at her.\u003c/p\u003e\n\u003cp\u003eBerta turned around and bellowed. “What are you gawking at like a bunch of turkeys? Get back to cookin’ ‘n have the decency not to gossip of the Colonel’s Woman in front of her!”\u003c/p\u003e\n\u003cp\u003e“Thank you, Berta,” the Colonel wryly said.\u003c/p\u003e\n\u003cp\u003e“They’re a talkative lot, but they know the kitchens,” Berta said. “Just finished baking my famous molasses bread. Want a piece, Colonel?” Berta asked, waddling over to a wooden table to hack at a dark brown loaf of bread without waiting for a reply. “What about you, Lady? You’re all skin and bones. You could use some fattening,” she said, cutting a second piece.\u003c/p\u003e\n\u003cp\u003eShe slathered both pieces with butter before presenting them to Cinderella and the Colonel.\u003c/p\u003e\n\u003cp\u003e“There. Don’t that hit the spot?” Berta asked.\u003c/p\u003e\n\u003cp\u003eCinderella took a bite out of the bread. “Fantastic,” she said.\u003c/p\u003e\n\u003cp\u003e“I would join the Army again just to eat your food, Berta,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eBerta’s ruddy face turned a darker shade of red. “Colonel,” she said, sketching a tipsy curtsey.\u003c/p\u003e\n\u003cp\u003e“We’ll get out of the way. Thank you, Berta,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eBerta dipped a second curtsey and waddled back to her minions. “Stoke the fire, and get those dishes washed!” she roared as Cinderella and the Colonel left the mess hall.\u003c/p\u003e\n\u003cp\u003eThe Colonel led Cinderella through the grounds, waving and acknowledging his men, who watched them with ill-disguised interest.\u003c/p\u003e\n\u003cp\u003eCinderella was relieved when the Colonel led the way into a plain but solid building. “This is the regiment’s headquarters. Any visiting colonels stay here, but it’s mostly living quarters and offices for me, the general I serve, and the officers below us.\u003c/p\u003e\n\u003cp\u003e“I see,” Cinderella said, following the Colonel through the building.\u003c/p\u003e\n\u003cp\u003e“Kurt! Kurt, where—oh,” the Colonel said when a huge, hulking soldier stepped out of the shadows in front of him.\u003c/p\u003e\n\u003cp\u003e“This is Ensign Kurt Werlauf. Ensign, Lady Lacreux,” the Colonel said.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Ensign,” Cinderella said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-28.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
