{"id":83204,"no":30,"title":"Page 30","content":"\u003cp\u003eCinderella joined the Colonel at the window. Before meeting the Colonel, it was easy to paint a negative portrait of Erlauf soldiers…but somewhere between helping her break into the library and basket-weaving, Cinderella’s view of the Colonel had altered.\u003c/p\u003e\n\u003cp\u003eSimilarly, it would be easy to look at the soldiers and wonder how many Trieux men they had slain, but it was also easy to see how they were like any other human being.\u003c/p\u003e\n\u003cp\u003e“Nobody wins in war. At least, that was what my Father said,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“I agree,” the Colonel said.\u003c/p\u003e\n\u003cp\u003eCinderella looked to the Colonel, surprised he should feel the same. Even Cinderella wasn’t entirely sure what her Father meant by the phrase. The Colonel’s voice was coated with something. Cinderella couldn’t quite identify it, but it sounded like wistfulness. “But it doesn’t mean Trieux wasn’t wronged in the takeover,” she said.\u003c/p\u003e\n\u003cp\u003e“I suppose you are referring to the taxes?”\u003c/p\u003e\n\u003cp\u003e“The taxes, the slaughter, the exiles, the new laws. If you meant to show me your soldiers are human too, you have succeeded and softened me some. But you have done nothing to convince me your Erlauf Royalty are anything but brutes,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eThe Colonel coughed. “Of course,” he said.\u003c/p\u003e\n\u003cp\u003eThere were a few moments of awkward silence before Cinderella remembered herself. “Thank you for the book—although the content was not what I thought it would be.”\u003c/p\u003e\n\u003cp\u003eThe Colonel grinned. “I managed to fool you, did I? You’re welcome. I hope you can use it. I have something else for you.”\u003c/p\u003e\n\u003cp\u003eCinderella blinked. “Oh?”\u003c/p\u003e\n\u003cp\u003eThe Colonel rolled his eye as he pulled something from a pocket in his jacket. “It is not a book or something for you to sell—you are a merchant at heart, do you know that?”\u003c/p\u003e\n\u003cp\u003e“What is it?” Cinderella asked, ignoring the teasing.\u003c/p\u003e\n\u003cp\u003e“Before I give it to you, you must promise you will wear it always.”\u003c/p\u003e\n\u003cp\u003eCinderella suspiciously eyed the Colonel. “What?”\u003c/p\u003e\n\u003cp\u003e“It is a necklace, a token of my affections,” he said, ignoring Cinderella’s huff of disbelief. “You must wear it, all the time. If you don’t wear it around your neck, I want it tucked in your skirts or something.”\u003c/p\u003e\n\u003cp\u003e“Friedrich,” Cinderella said, shocked by his words.\u003c/p\u003e\n\u003cp\u003e“I am not joking, Cinderella. You must wear this,” the Colonel said, his dark eye weighing on Cinderella like a draft horse stepping on a blade of grass.\u003c/p\u003e\n\u003cp\u003eCurious, Cinderella sighed. “As you wish.”\u003c/p\u003e\n\u003cp\u003eThe Colonel passed over the necklace, which was a simple design of a flying dragon hanging from a chain. The craftsmanship was splendid, but it did not look particularly costly. Perhaps it was a way his men could identify her? Cinderella wouldn’t put it past the Colonel to soak the necklace in some sort of oil the patrol dogs could easily sniff out.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Cinderella said, taking the necklace. “It’s very kind of you.”\u003c/p\u003e\n\u003cp\u003eThe Colonel watched her expectantly, and Cinderella hesitated. The dragon was clearly styled to resemble the royal Erlauf crest—which was also a flying dragon. Hanging such a symbol from her neck felt almost traitorous.\u003c/p\u003e\n\u003cp\u003eCinderella looked back at the Colonel. “You said I have to wear it?” she asked.\u003c/p\u003e\n\u003cp\u003eThe corners of the Colonel’s mouth briefly turned down. “I thought you might balk,” he said. “If you find it unbearable, carrying it on your person will do well enough.”\u003c/p\u003e\n\u003cp\u003eCinderella studied the Colonel, who rewarded her with a wry smile.\u003c/p\u003e\n\u003cp\u003eCinderella had saved his life, and the Colonel had very likely saved hers by taking down the assassin—however little she liked to think of it.\u003c/p\u003e\n\u003cp\u003eCinderella looked down at the dragon and briefly clenched it in her hand. Like it or not, he had become a strange sort of friend or companion, in spite of his heritage.\u003c/p\u003e\n\u003cp\u003e“If it’s so important to you…” Cinderella trailed off as she fastened the necklace around her neck. It was long and dipped under her dress, hiding the dragon from eyesight.\u003c/p\u003e\n\u003cp\u003e“It is. Thank you,” the Colonel said, his smile turning bright.\u003c/p\u003e\n\u003cp\u003eCinderella fiddled with the necklace and her pricey book. “I should go,” she said, feeling awkward.\u003c/p\u003e\n\u003cp\u003e“Yes,” the Colonel agreed.\u003c/p\u003e\n\u003cp\u003eCinderella arched a scarlet-red eyebrow. “So eager to get rid of me? How unusual.”\u003c/p\u003e\n\u003cp\u003e“Not at all. My General and Colonel Merrich-the-goat-foot will be back soon. I would rather avoid you meeting them right now.”\u003c/p\u003e\n\u003cp\u003e“You feel I will embarrass you?”\u003c/p\u003e\n\u003cp\u003e“No, it is quite the reverse. I fear they will embarrass me.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Cinderella asked.\u003c/p\u003e\n\u003cp\u003e“Darn it, now I’ve intrigued you. Please allow me to assure you my General is a force of nature you would rather not meet right now.”\u003c/p\u003e\n\u003cp\u003e“And this Merrich you’ve mentioned?”\u003c/p\u003e\n\u003cp\u003e“Let’s just say I’m the jealous type.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothing. Come along. We can stop at the stables on our way out.”\u003c/p\u003e\n\u003cp\u003e“As you wish.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eChapter 7 \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-30.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
