{"id":83207,"no":33,"title":"Page 33","content":"\u003cp\u003e“Flower seeds.”\u003c/p\u003e\n\u003cp\u003eOn a normal day, Cinderella would hate Friedrich for once again being so free and careless with great amounts of money—signifying his financial wealth, or at the very least independence—but instead Cinderella eyed the seeds with new appreciation. Planting flowers might be grasping at straws, but it was better than waiting for the inevitable. “What kind?”\u003c/p\u003e\n\u003cp\u003e“Sun Skips.”\u003c/p\u003e\n\u003cp\u003e“I haven’t heard of them,” Cinderella said, swiveling to look in the direction of the library.\u003c/p\u003e\n\u003cp\u003e“They’re in the book I gave you, you criminally-minded mademoiselle.”\u003c/p\u003e\n\u003cp\u003e“Oh. Thank you,” Cinderella said. “This looks like a lot of seeds.”\u003c/p\u003e\n\u003cp\u003e“It’s enough for a field. They’re blasted costly to purchase, so I suggest you save the seeds from your flowers when they die. You could plant some next year and sell the rest,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“If they’re ‘blasted costly’ how did you get them?” Cinderella asked, eyeing Friedrich.\u003c/p\u003e\n\u003cp\u003e“Through legal methods. It’s not like you are in a position to look down on me, Lady Break-and-Enter,” Friedrich said, tweaking the tip of Cinderella’s button nose.\u003c/p\u003e\n\u003cp\u003eCinderella laughed. “Thank you, Friedrich,” she said, grateful to be amused even as her world fell apart.\u003c/p\u003e\n\u003cp\u003e“For marrying you?”\u003c/p\u003e\n\u003cp\u003eCinderella rolled her eyes. “For the seeds. For coming,” she said before she stood up and dusted off her dress. She held the pouch of seeds up to the sky. “It’s too early to give up hope. I forgot that. Thank you,” she said, smiling down at the officer.\u003c/p\u003e\n\u003cp\u003eFriedrich tilted his head. “Does this mean you’ll forgive our lovely queen, her wonderful husband, and her charming sons?”\u003c/p\u003e\n\u003cp\u003e“Hardly,” Cinderella sourly said.\u003c/p\u003e\n\u003cp\u003e“I thought as much, but it was worth a try,” Friedrich said as he, too, stood.\u003c/p\u003e\n\u003cp\u003eHe leaned closer and closer to Cinderella, lowering his face towards hers. When he was a hand’s width away, Cinderella asked, “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“I’m going to kiss you.”\u003c/p\u003e\n\u003cp\u003eIn an instant, Cinderella had both her hands clamped over his lips. “No, you aren’t.”\u003c/p\u003e\n\u003cp\u003eFriedrich sighed, his breath warm against Cinderella’s hands. “Why not? Don’t I deserve it?”\u003c/p\u003e\n\u003cp\u003e“Kissing is not a matter of deserving.”\u003c/p\u003e\n\u003cp\u003e“Then what is it?”\u003c/p\u003e\n\u003cp\u003e“It is an easy way to express affection.”\u003c/p\u003e\n\u003cp\u003e“I should have known you would scorn the easy way. You enjoy making things difficult. What’s so bad about the easy way?”\u003c/p\u003e\n\u003cp\u003e“I find it unimaginative, not to mention disloyal to my future.”\u003c/p\u003e\n\u003cp\u003e“Future?”\u003c/p\u003e\n\u003cp\u003e“I don’t know whom my husband will be until the proposal is accepted and the wedding date is picked. A million things could happen before the offer. It has been expected of me to marry Julien Rosseux since my father died. My body is the one thing I truly have to barter with now that Aveyron is swimming in debt. I suspect I’m worth more as long as I remain untouched.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Think of it. If I were to marry you, how would you feel knowing I kissed Julien a great deal?”\u003c/p\u003e\n\u003cp\u003eFriedrich was silent.\u003c/p\u003e\n\u003cp\u003e“And there you have it. Physical affection, for me, is a matter of loyalty and wealth. I will fight for my future, even if I don’t know whom it involves,” Cinderella said, clasping her hands behind her back before she started walking.\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003e“Back to the market.”\u003c/p\u003e\n\u003cp\u003e“You’re just going to leave me?”\u003c/p\u003e\n\u003cp\u003e“Now that I feel better, I have things to do.”\u003c/p\u003e\n\u003cp\u003eFriedrich muttered about headstrong females as he squinted up at the sun.\u003c/p\u003e\n\u003cp\u003e“Friedrich.”\u003c/p\u003e\n\u003cp\u003e“What?” he grumbled.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Cinderella said. She smiled, a gesture that transformed her already pretty features into a vision of gentleness and beauty. “Thank you for coming, and thank you for cheering me up.”\u003c/p\u003e\n\u003cp\u003eFriedrich dumbly nodded “Until tomorrow,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Until tomorrow, my love!” Friedrich called.\u003c/p\u003e\n\u003cp\u003e“Don’t push your luck.”\u003c/p\u003e\n\u003cp\u003e“If I didn’t, I’d be ashamed of myself,” Friedrich shouted as Cinderella left the gardens, a smile on her face and a spring in her steps.\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003eCinderella was the last to arrive to the Delattres’ dinner party. She wore her beloved summer dress—a creation of lavender silk that brought out the stark gray of her eyes and the vivid red hue of her hair.\u003c/p\u003e\n\u003cp\u003eIt was a day costume, so Cinderella was woefully underdressed, but at least she was more presentable than usual. She even had a clean, black shawl she wore for the walk to the manor. As she handed it off to a servant, someone called out for her.\u003c/p\u003e\n\u003cp\u003e“Cinderella!”\u003c/p\u003e\n\u003cp\u003e“Marcus,” Cinderella said with a smile. “My, you’ve grown taller since we last met.”\u003c/p\u003e\n\u003cp\u003eMarcus was all laughter and smiles. “I’m taller than Mama, and I’m nearly taller than you too, I think.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-33.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
