{"id":83208,"no":34,"title":"Page 34","content":"\u003cp\u003e“I think so as well,” Cinderella said, slowly walking in the direction of the sitting room. “Did only you accompany your parents, or are your little brother and sister present as well?”\u003c/p\u003e\n\u003cp\u003e“It’s just me. The littles wanted to come, but Father said they’re too young.” Marcus said before remembered himself and offered his arm to Cinderella, which she took. “Everyone else is already here.”\u003c/p\u003e\n\u003cp\u003e“The Feautres, the Leroys, and the Rosseuxes?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Which of their children did they bring?”\u003c/p\u003e\n\u003cp\u003e“The Leroys arrived with one of their sons and daughters-in-law. No grandchildren, blessings be said and repeated,” Marcus said, wiping his forehead with great exaggeration. “The Rosseuxes brought Julien, of course, but not Cerise, which is a shame. She has this ear-piercing whistle she said she would teach me—ah,” Marcus broke off and cleared his throat. “The Feautres arrived shortly after we did. Their daughters are with them,” Marcus scowled.\u003c/p\u003e\n\u003cp\u003e“All of them?” Cinderella asked in surprise.\u003c/p\u003e\n\u003cp\u003e“No, just the two oldest,” Marcus said, his scowl deepening as they stood just outside the salon.\u003c/p\u003e\n\u003cp\u003eCinderella smiled fondly at the young nobleman. He was doing his best to act mature for her sake, but he was barely fourteen, and as squirrely as a puppy. Cinderella patted Marcus’ arm. “You are spending the night?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“If you have time, tomorrow please stop by Aveyron,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eMarcus dropped his young enthusiasm. “Oh?” he said.\u003c/p\u003e\n\u003cp\u003eAmused, Cinderella inclined her head to the younger boy. “One of the sheep dogs had a litter of puppies four weeks ago. I thought you might enjoy playing with them while your parents have tea or refreshments with the Delattres. I will not likely be around to show you the puppies, but any of Aveyron’s staff members can direct you to them.”\u003c/p\u003e\n\u003cp\u003eCinderella was rewarded with a brilliant smile from Marcus. He kept it intact as they entered the salon, still arm in arm.\u003c/p\u003e\n\u003cp\u003eTheir entrance did not go unnoticed. Julien Rosseux stood and bowed to Cinderella, his eyes flicking between her and Marcus.\u003c/p\u003e\n\u003cp\u003eLady Leroy said with loud horror, “Lady Lacreux, what happened to you?”\u003c/p\u003e\n\u003cp\u003eAs Marcus hadn’t said anything, or even seemed to notice, Cinderella hoped her short hair would pass the observation of the nobles who hadn’t yet seen it. Apparently she was too optimistic. “I beg your pardon?” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Your hair,” Lady Leroy said, aghast.\u003c/p\u003e\n\u003cp\u003eLord Leroy held up a pair of eyeglasses to his eyes. “Eh?” he said.\u003c/p\u003e\n\u003cp\u003eCinderella ruefully ran a hand through her shorter locks. “Ah, yes. I had it cut,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Shorn is closer to the truth,” Lady Feautre said, her voice tight and hateful.\u003c/p\u003e\n\u003cp\u003e“I think its jolly,” Marcus said, impudent and quick to defend Cinderella. “I can’t imagine how hot you ladies are in the summer with the sun and heat.”\u003c/p\u003e\n\u003cp\u003e“Marcus,” Lady Girard warned.\u003c/p\u003e\n\u003cp\u003eMarcus grunted in impatience, but bowed to Cinderella before he left her to stand beside his mother at the fireplace.\u003c/p\u003e\n\u003cp\u003e“It is a cut unfit for a lady of nobility,” Lady Feautre said.\u003c/p\u003e\n\u003cp\u003e“It is quite unseemly,” Rosette, the Feautres’ second daughter, said. She widened her china doll blue eyes as she stared at Cinderella. She sat with her sister, Violette, on a settee.\u003c/p\u003e\n\u003cp\u003eViolette was kinder than her mother and her sister, but she was a mousy, quiet thing. She gave Cinderella a scared look but said not a word.\u003c/p\u003e\n\u003cp\u003e“Now, now. Let us not be unkind to Lady Lacreux,” Lady Delattre said.\u003c/p\u003e\n\u003cp\u003e“It is not unkind to note what she takes no pains to hide,” Lady Feautre said.\u003c/p\u003e\n\u003cp\u003e“What?” Lord Leroy loudly asked, his gray mustache quivering as he leaned forward.\u003c/p\u003e\n\u003cp\u003e“Cinderella has cut her hair,” Lady Leroy shouted into her husband’s ear.\u003c/p\u003e\n\u003cp\u003e“Ah, yes. Lady Lacreux does have bright red hair,” Lord Leroy nodded.\u003c/p\u003e\n\u003cp\u003e“Shameful,” Lady Feautre murmured.\u003c/p\u003e\n\u003cp\u003e“Lady Lacreux looks divine no matter the state of her hair,” Julien said, bowing over Cinderella’s hand.\u003c/p\u003e\n\u003cp\u003e“Thank you, Julien,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eLady Feautre rolled her eyes and huffed.\u003c/p\u003e\n\u003cp\u003e“Now that we have all arrived, shall we proceed with dinner?” Lord Delattre said, diverting the topic.\u003c/p\u003e\n\u003cp\u003e“It’s about time,” Lord Rosseux muttered.\u003c/p\u003e\n\u003cp\u003e“Please sit where your name card has been placed,” Lady Delattre said as she took her husband’s arm and led the way to the dining hall.\u003c/p\u003e\n\u003cp\u003eJulien accompanied Cinderella. The pair was silent as they followed their hosts, and it came as no surprise to either of them that they sat together with Marcus on Cinderella’s other side.\u003c/p\u003e\n\u003cp\u003e“Say, Julien, where is Cerise?” Marcus asked as he sat down.\u003c/p\u003e\n\u003cp\u003e“She claimed she had a headache this evening and asked to remain home,” Julien said, holding Cinderella’s chair out for her.\u003c/p\u003e\n\u003cp\u003e“Faked,” Marcus muttered under his breath. “Talk about unfair.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon, I couldn’t hear that. What did you say?” Julien asked as he slid Cinderella’s chair in for her as she sat. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-34.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
