{"id":83217,"no":43,"title":"Page 43","content":"\u003cp\u003e“You must be the only officer in the whole Army who involves his regiment in his personal relationships,” Cinderella said, slipping out of the arm, although she followed Friedrich away from the building.\u003c/p\u003e\n\u003cp\u003e“You hurt me, but no. I’ll have you know it’s a family tradition. When my Father courted my Mother, he used an even more elaborate system involving his soldiers. However, he didn’t have a regiment under his disposal, so I would like to think I can still beat his antics,” Friedrich said, moving at a rapid pace.\u003c/p\u003e\n\u003cp\u003e“Is there a reason we are running away from your office?”\u003c/p\u003e\n\u003cp\u003e“It’s not my office we’re running from.”\u003c/p\u003e\n\u003cp\u003e“The general you serve?”\u003c/p\u003e\n\u003cp\u003eFriedrich hesitated. “Yes. Yes, it is my general I don’t want you to meet. Certainly. You are so sharp,” Friedrich said, reaching for Cinderella’s hand.\u003c/p\u003e\n\u003cp\u003eCinderella darted out of range. “You’re lying.”\u003c/p\u003e\n\u003cp\u003e“Pet! How could you say such a thing? I am deeply wounded,” Friedrich said, relaxing after they darted behind the mess hall—which was finished and fully operational.\u003c/p\u003e\n\u003cp\u003e“I doubt that. You will be a gloating monster after you hear my news,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“You’ve decided to stop denying your feelings and plan to elope and run away with me?” Friedrich said, perking with interest.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Friedrich said, easing back into a stance of nonchalance. “Then no. I don’t think I will be doing much gloating.”\u003c/p\u003e\n\u003cp\u003e“I am here to humble myself and admit you were right in your advice to plant flowers.”\u003c/p\u003e\n\u003cp\u003e“So they’ve bloomed, then?”\u003c/p\u003e\n\u003cp\u003e“They’ve bloomed, and I sold a batch at the market this morning.”\u003c/p\u003e\n\u003cp\u003e“Sold out already, eh?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“In all fairness, it seemed unlikely you would ever know that about our culture unless you visited Erlauf. As you haven’t many flowers besides wild flowers here, we don’t often get to express our passion,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“All the same, I doubted the wisdom of your words. Thank you for pushing the subject.”\u003c/p\u003e\n\u003cp\u003e“Of course. Anything for you, Cinderella,” Friedrich said, brushing Cinderella’s cheek with his fingers. “Will you make much off them?”\u003c/p\u003e\n\u003cp\u003eCinderella nodded. “A fair amount.”\u003c/p\u003e\n\u003cp\u003e“But not enough to cover the landholding fine?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eFriedrich nodded. “That’s unfortunate.”\u003c/p\u003e\n\u003cp\u003e“I will keep trying. The summer isn’t over yet,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Perhaps our sweet queen would accept a partial payment?”\u003c/p\u003e\n\u003cp\u003e“Your queen is a harpy, and I very much doubt she would bend that much,” Cinderella sourly said.\u003c/p\u003e\n\u003cp\u003e“She’s not so bad,” Friedrich said. “Haven’t you heard? Next week she and the Erlauf Commander—the consort—are reopening the Trieux Royal Library.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Yes. It has been renamed. It’s now the Erlauf Repository of Stories and Education.”\u003c/p\u003e\n\u003cp\u003e“That’s a mouthful.”\u003c/p\u003e\n\u003cp\u003e“They’re calling it the Rose for short. See? I told you flowers are important to us.”\u003c/p\u003e\n\u003cp\u003e“I believe you, now. I am impressed she means to open it again, but it may not help me. If they limit the patronage—as they did when it was under Trieux rule—it might be even more difficult for me to conduct my farming research. Do you know what the membership fee is? Knowing your queen, I should think it to be the price of a good horse,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“No, it’s free.”\u003c/p\u003e\n\u003cp\u003e“Free?”\u003c/p\u003e\n\u003cp\u003eFriedrich nodded. “Free for everyone—commoner, servant, noble, Trieux or Erlauf. Everyone can use it.”\u003c/p\u003e\n\u003cp\u003eCinderella tucked her head, uncertain. “That’s very…generous.”\u003c/p\u003e\n\u003cp\u003e“The patrolling soldiers—mostly from the Second Regiment—were relieved to hear the news. With the library opening again, they no longer need to fear embarrassment by the book thief that persists in evading capture,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“How fortuitous.”\u003c/p\u003e\n\u003cp\u003e“There’s going to be an opening ceremony and everything. You should go,” Friedrich said.\u003c/p\u003e\n\u003cp\u003e“Will you be attending?”\u003c/p\u003e\n\u003cp\u003eFriedrich sighed. “Alas, I cannot. I am being forced to work myself to the bone for the occasion.”\u003c/p\u003e\n\u003cp\u003eCinderella laughed. “You haven’t worked a full day since I’ve met you.”\u003c/p\u003e\n\u003cp\u003e“That isn’t true,” Friedrich objected.\u003c/p\u003e\n\u003cp\u003e“Hah!”\u003c/p\u003e\n\u003cp\u003e“Perhaps I have worked less since becoming acquainted with you. Unfortunately, next week even I cannot weasel my way out of work—though I long to do so.”\u003c/p\u003e\n\u003cp\u003e“It saddens me to be told that, Fred.”\u003c/p\u003e\n\u003cp\u003eFriedrich laughed, a sound that caressed Cinderella’s skin like velvet. “At least you are beginning to acknowledge how you pine for me.”\u003c/p\u003e\n\u003cp\u003e“Speaking of pine, I must return to the market.”\u003c/p\u003e\n\u003cp\u003e“You pine for that loose-mouthed maid of yours?”\u003c/p\u003e\n\u003cp\u003e“No, for our customers’ money.”\u003c/p\u003e\n\u003cp\u003e“Sometimes I worry you will marry me only for my money,” Friedrich said, leaning over her.\u003c/p\u003e\n\u003cp\u003eCorrectly interpreting his movements, Cinderella squirmed to the side before he could kiss her cheek. “One day someone is going to hear the way you moon over me and report back to whatever Erlauf lady your parents have selected for you,” she said.\u003c/p\u003e\n\u003cp\u003e“It makes no difference. My parents already know all about you,” Friedrich said, losing the jesting edge to his voice. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-43.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
