{"id":83219,"no":45,"title":"Page 45","content":"\u003cp\u003e“No, I should think not,” Cinderella agreed.\u003c/p\u003e\n\u003cp\u003e“…Therefore, it is with great joy that I pronounce the Erlauf Repository of Stories and Education to be open and free to all. Let no one keep his fellow man from these halls, and let knowledge pour forth from its doors,” Queen Freja finished.\u003c/p\u003e\n\u003cp\u003eCinderella clapped half-heartedly with her fellow market vendors. The pockets of Erlauf citizens cheered louder, a few even threw yellow Sun Skips—purchased earlier that morning from Aveyron’s market stall—on the library steps.\u003c/p\u003e\n\u003cp\u003e“Well, that’s done,” the milkmaid said.\u003c/p\u003e\n\u003cp\u003e“I would bet my eyeteeth before the week is out there will be some sort of book tax that all property owners who have owned their land for more than five years must pay,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“She is the rotten sort to do that, if you don’t mind me saying, Mademoiselle.”\u003c/p\u003e\n\u003cp\u003e“Not at all,” Cinderella sighed, fluffing her skirts.\u003c/p\u003e\n\u003cp\u003e“Shall we return to the stand, Mademoiselle?”\u003c/p\u003e\n\u003cp\u003e“Not yet. I want to have a look inside first,” Cinderella said, nodding towards the library. “You may go if you like, though. Don’t let me keep you.”\u003c/p\u003e\n\u003cp\u003e“As you wish, Madmoiselle.”\u003c/p\u003e\n\u003cp\u003e“I will go with you, Vitore. I don’t trust Chas with my goats, not for long, anyway. Last time they got into his stand and ate two lengths of rope,” the milkmaid said, referring to the ropemaker.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Cinderella said before the pair disappeared in the push of the crowd.\u003c/p\u003e\n\u003cp\u003eThe consort and his soldiers pushed back the crowds, opening up a pathway to the library. The first through the doors were Erlauf scholars—eager to get their hands on the priceless volumes the Trieux Nobles gathered over the ages.\u003c/p\u003e\n\u003cp\u003eAfter the scholars went Trieux commoners. The library was built and founded decades ago, but it was exclusive in the patronage it allowed, so the average citizen rarely got to see so much as a glimpse inside the decadent building. It was probably why they attended the ceremony—so they could poke their heads inside and gawk at what was once denied to them.\u003c/p\u003e\n\u003cp\u003eCinderella sat on the lip of a large fountain—designed for watering horses—and waited for the crowds to depart.\u003c/p\u003e\n\u003cp\u003eThe consort controlled his soldiers—spacing them out and sending a few into the shadows of the library—with several crisp gestures.\u003c/p\u003e\n\u003cp\u003eCinderella noted with great interest that none of the Erlauf nobles who had relocated to Werra after the takeover attended the ceremony. Apparently they felt no need to pay homage to their rulers, or so Cinderella suspected as she watched Queen Freja stand alone in the shadows of the library.\u003c/p\u003e\n\u003cp\u003eThe tall, stately woman bent over to pick up a Sun Skip. She brushed the yellow petals with her fingertips, and the hard lines of her face softened to an almost humane expression.\u003c/p\u003e\n\u003cp\u003eThe monarch twirled the flower between her fingers as she returned her gaze to the crowds. People poured up the steps, pressing into the library, but the queen was safe, blocked off by soldiers and standing some feet down the front veranda.\u003c/p\u003e\n\u003cp\u003eAs Cinderella watched, a little Trieux girl who wasn’t older than four popped between the stone railings that separated the library veranda from the small courtyard. A soldier moved to intercept the blonde-haired child, but the queen indicated he should remain where he was.\u003c/p\u003e\n\u003cp\u003eThe Trieux girl popped a dirty thumb in her mouth as she stared up at Queen Freja with wide eyes, her pigtails bobbing in the breeze.\u003c/p\u003e\n\u003cp\u003eQueen Freja broke off half the stem of her Sun Skip and, to Cinderella’s surprise, crouched down and wove the flower into one of the little girl’s pigtails. When she was finished, Queen Freja smoothed the child’s hair and smiled.\u003c/p\u003e\n\u003cp\u003eThe little girl returned the smile before she startled and turned around. “Mama,” she called before slipping back through the stone railings, having heard her parent call her name.\u003c/p\u003e\n\u003cp\u003eQueen Freja brushed off her hands and returned to resembling iron and flint when her consort approached her. The two briefly spoke before a squad of soldiers surrounded the queen and bore her away.\u003c/p\u003e\n\u003cp\u003eThe courtyard emptied as everyone smashed inside the library, but Cinderella stood transfixed.\u003c/p\u003e\n\u003cp\u003eShe realized as she sat there, gaping like a fish, that she hadn’t ever seen the queen of Erlauf smile. With great stupefaction, Cinderella also realized when the queen smiled, she bore more than a slight resemblance to Friedrich.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eA week later, Cinderella walked the length of the dwindling Sun Skip field, reminiscing on Queen Freja’s smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-45.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
