{"id":83220,"no":46,"title":"Page 46","content":"\u003cp\u003eThe mystery of Freja and Friedrich’s resemblance was resolved. When Cinderella visited Friedrich the day after the ceremony, she asked about it. Friedrich reported with a wide smile, “You saw it, too? My family is deeply royal. Our lineage goes far, far back—,” Which, as he blathered on about pedigrees and long dead kings, Cinderella took to mean that there was barely any royal blood left in his family, and it was probably more that Queen Freja had mannish facial features.\u003c/p\u003e\n\u003cp\u003eBut the queen’s conduct with the little girl intrigued Cinderella. She thought the queen would scorn any Trieux citizen—regardless of their age. But Freja was soft and almost motherly towards the little girl. Was she really as bad as Cinderella thought her to be?\u003c/p\u003e\n\u003cp\u003e“Mademoiselle?”\u003c/p\u003e\n\u003cp\u003e“Yes, Jeanne?”\u003c/p\u003e\n\u003cp\u003eJeanne bit her lip. “There is a government official here.”\u003c/p\u003e\n\u003cp\u003e“He wishes to see me?”\u003c/p\u003e\n\u003cp\u003e“No, he says he needs nothing. But he’s wandering around and…I would not bother you, but Father is up in the hay fields today,” Jeanne said.\u003c/p\u003e\n\u003cp\u003eCinderella frowned. “He’s just wandering around?”\u003c/p\u003e\n\u003cp\u003e“He said he is taking inventory of future Erlauf Crown assets.”\u003c/p\u003e\n\u003cp\u003eAnger stiffened Cinderella’s spine. “I will see to him. Where is he?”\u003c/p\u003e\n\u003cp\u003e“By the milking barn.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Jeanne.”\u003c/p\u003e\n\u003cp\u003e“Mademoiselle,” Jeanne said. She curtsied, but Cinderella was already walking away, her gray eyes flashing like thunderclouds.\u003c/p\u003e\n\u003cp\u003eCinderella found the greasy-looking fellow—some sort of undersecretary judging by his sweat-stained shirt. “Can I help you, Sir?”\u003c/p\u003e\n\u003cp\u003eThe undersecretary counted the cows. “’fraid not,” he said.\u003c/p\u003e\n\u003cp\u003e“I think you fail to understand me, sir,” Cinderella said. “I am Duchess Lacreux. How can I help you, or if you need me to use common words, what are you doing?”\u003c/p\u003e\n\u003cp\u003e“Ah, sorry,” the undersecretary said, turning from the cows. “I’ve been sent to take inventory of your lands.”\u003c/p\u003e\n\u003cp\u003e“Are all lands being re-evaluated for tax purposes?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then why are you taking inventory?”\u003c/p\u003e\n\u003cp\u003eThe undersecretary scratched his dry scalp. “The crown requested it so plans can be drawn for dividing up the lands and stock after Aveyron reverts to the Crown.”\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eCinderella forced her expression to remain pleasant. “Did the Crown not receive my first down payment against the fine two days ago?” Cinderella asked.\u003c/p\u003e\n\u003cp\u003e“No, it was received and recorded,” the undersecretary said. “But it is the Finance Department’s opinion that if it is all you were able to pay off over the first few months of summer, you have no possibility of paying the remaining balance by the end of the month. The queen has plans for Aveyron and wishes to move forward with them as soon as possible.”\u003c/p\u003e\n\u003cp\u003eThat beast! Cinderella thought, taking back the few kind thoughts she had of Queen Freja. That pushy, greedy, flint-hearted witch!\u003c/p\u003e\n\u003cp\u003e“That may be so, but until the end of the month, Aveyron is mine,” Cinderella said, the controlled coolness of her voice making the undersecretary squirm. “If you have no legal purpose to loiter on my land, I must order you to take your leave. The queen may wait to measure and take inventory until Aveyron belongs to her.”\u003c/p\u003e\n\u003cp\u003e“Oh, but Her Majesty will be so very disappointed—.”\u003c/p\u003e\n\u003cp\u003e“Be gone,” Cinderella said, every inch of her body drawing up in nobility and attitude.\u003c/p\u003e\n\u003cp\u003eThe force of her words, although softly spoken, sent the undersecretary scuttling. “As you wish, Lady,” he said before running from Aveyron.\u003c/p\u003e\n\u003cp\u003eCinderella watched him go with shaking fists.\u003c/p\u003e\n\u003cp\u003eGustav whistled in appreciation as he ducked out from his hiding spot in the barn. “Well said, Your Grace. Even in servants’ dress and dirt, you can issue a command like the Colonel himself. Your Grace?” he said when Cinderella did not acknowledge him and started for Werra.\u003c/p\u003e\n\u003cp\u003eShe had to see Marie.\u003c/p\u003e\n\u003cp\u003eThere was no one in Aveyron Cinderella could speak to. Jeanne was the closest thing she had to a companion, and the young woman made sure to hold Cinderella at an arm’s length.\u003c/p\u003e\n\u003cp\u003eThe servants of Aveyron saw Cinderella go, but they did not stop her, or the three Erlauf soldiers who followed her in the shadows.\u003c/p\u003e\n\u003cp\u003eCinderella’s ears were ringing by the time she reached Marie’s residential home. The maid opened the door and took one look at Cinderella before she ran off, calling, “Madame? Madame Marie!” leaving the door wide open.\u003c/p\u003e\n\u003cp\u003eCinderella stepped inside, her eyes sweeping through the pleasant parlor situated near the entrance. Her shoulders shook with rage and despair, and she almost leaped out of her skin when Marie came around the corner and said, “Cinderella, what happened?”\u003c/p\u003e\n\u003cp\u003eFeeling lost, like the ground had dropped out under her feet, Cinderella shrugged. “I hate her, Marie.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“That wretched queen,” Cinderella said before the tears started falling.\u003c/p\u003e\n\u003cp\u003eMarie sighed. “My darling friend,” she said before folding her arms around Cinderella in a warm embrace. “Your burden is difficult, and I am sorry for it.”\u003c/p\u003e\n\u003cp\u003eWhen Marie led Cinderella to a settee, the story came spilling from her lips in a rush of emotion as wild as the tears that splashed her face. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-46.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
