{"id":83180,"no":6,"title":"Page 6","content":"\u003cp\u003e“I am quite well, now that winter has left. The cold weather makes my old bones ache,” Lady Delattre said as she poured Cinderella a steaming cup of tea. “How is your step-mother?”\u003c/p\u003e\n\u003cp\u003e“I have not seen much of her,” Cinderella reported. “Nor of my step-sisters. They mostly keep to their rooms, and when they venture out, it is to visit friends from Erlauf,” Cinderella said, holding her tea for extra warmth.\u003c/p\u003e\n\u003cp\u003eLady Delattre sniffed. “It’s a crime against goodness, what that woman does. I do not understand how she can live off you like a parasite. To think she refuses to help you pay the taxes you incur through Aveyron—the estate of the man she married.”\u003c/p\u003e\n\u003cp\u003e“She married Papa only because the Queen Freja ordered her to, and she does pay for her and her daughters’ living expenses,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“No woman should allow a child to take on the burdens you have, darling,” Lady Delattre said.\u003c/p\u003e\n\u003cp\u003e“I am seventeen,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eLady Delattre’s sharp features softened. “You are too kind to her, Cinderella.”\u003c/p\u003e\n\u003cp\u003e“Hardly—,” Cinderella started. She cut herself off when Lord Delattre—a rail-thin man who always wore solemn expressions—entered the salon with Lord and Lady Rosseux and their eldest son, Julien Rosseux.\u003c/p\u003e\n\u003cp\u003e“I am telling you, Delattre, they will see the end of us yet,” Lord Rosseux said, his face flushed. “They might not have killed and exiled us like they did to all other Trieux families of nobility, but that is only so they could slowly wring our wealth from us like a rag.”\u003c/p\u003e\n\u003cp\u003e“Lord Rosseux, there are ladies present,” Lady Delattre said.\u003c/p\u003e\n\u003cp\u003e“I beg your pardon,” Lord Rosseux said, throwing himself into an arm chair.\u003c/p\u003e\n\u003cp\u003e“Are the Girards, Feautres, and Leroys not coming tonight?” Lady Rosseux, as soft-spoken as her husband was loud, asked as she seated herself on a settee with her son.\u003c/p\u003e\n\u003cp\u003e“It was too far for the Girards to come at such short notice; the Feautres are indisposed, and the Leroys decided it was best not to come,” Lord Delattre said.\u003c/p\u003e\n\u003cp\u003e“You mean Erlauf’s dogs still watch us for any sign of rebellion,” Lord Rosseux said, covering his eyes. “A meeting of the only six remaining noble families of Trieux would be marked with suspicion, but a meeting between an eligible lady, her chaperon neighbors, and a family with a marriageable son would raise less interest.”\u003c/p\u003e\n\u003cp\u003eJulian, a handsome blonde who was a few months older than Cinderella, cleared his throat and blushed.\u003c/p\u003e\n\u003cp\u003eHe and Cinderella looked in opposite directions and did not acknowledge Lord Rosseux’s observation.\u003c/p\u003e\n\u003cp\u003e“Lord Rosseux, I beg you to rein in your words. You have allowed your emotions to run freely,” Lady Delattre said.\u003c/p\u003e\n\u003cp\u003e“Of course I have. We’ll be forced to lay off more servants to make the tax.”\u003c/p\u003e\n\u003cp\u003eCinderella took a sip of her tea—it was weak. Lady Delattre had probably used the leaves two or three times already. It was a handy way to save on what was becoming an expensive import.\u003c/p\u003e\n\u003cp\u003e“We will sell one of our carriages to minimize the effect of the tax,” Lord Delattre said.\u003c/p\u003e\n\u003cp\u003e“Some Erlauf scum will buy it,” Lord Rosseux grunted.\u003c/p\u003e\n\u003cp\u003e“What will you do, Lady Lacreux?” Julian asked. With his quiet temperament, he took after his mother more than his father.\u003c/p\u003e\n\u003cp\u003eCinderella put her tea cup down. “It won’t affect Aveyron. I sold all our carriages sometime ago.”\u003c/p\u003e\n\u003cp\u003e“You persist in retaining all your servants?” Lady Delattre asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eIn a country that used to brim with lavishly dressed lords and ladies, only six families remained. The rest had been slaughtered in the takeover or exiled. The remaining nobles were left to face an enormous tax burden. Most of the families, like Rosseuxes, made the taxes by lowering the wages of their servants or dismissing them. Cinderella was an extreme opposite. She sold everything she could and kept all of Aveyron’s staff on. The Delattres held the medium ground, dismissing some of their servants and selling some of their possessions.\u003c/p\u003e\n\u003cp\u003eThe taxes were harder on some families. The Delattres owned the least land and the smallest taxable income. Cinderella, on the other hand, possessed the largest estate and the highest title—Duchess. The taxes imposed on Aveyron were the highest in the country.\u003c/p\u003e\n\u003cp\u003e“Did you hear the Erlauf Queen gave the Lefebvre Estate to an Erlauf army officer?” Lord Delattre said.\u003c/p\u003e\n\u003cp\u003e“I did. Lefebvre must be rolling in his grave,” Lord Rosseux said. “The queen is taking her time in handing out the estates. They’ve been in royal possession for two, almost three years.”\u003c/p\u003e\n\u003cp\u003e“I imagine they’re trying to decide which of their army officers to plant where. Their country places the highest importance on military service. Even nobles are required to serve,” Lord Delattre said.\u003c/p\u003e\n\u003cp\u003e“Working, pah,” Lord Rosseux said.\u003c/p\u003e\n\u003cp\u003e“Aren’t most of the officers titled nobles?” Julien said. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-6.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
