{"id":83237,"no":63,"title":"Page 63","content":"\u003cp\u003e“Blast,” Cinderella muttered. “BLAST!” she shouted, making the goats—that were still loose on the lawn—look up at her in wonder.\u003c/p\u003e\n\u003cp\u003e“Father… what would you have done? Oh, I know—you would have run to Loire,” Cinderella said, her heart still smarting from that revelation. “…Or would you?”\u003c/p\u003e\n\u003cp\u003eCinderella sat up, her thoughts racing. Her father bought Windtop Manor in the chaotic month before Erlauf swallowed Trieux into their country. Shortly after the takeover, the mass murdering of the Trieux nobles took place. There was then a few months’ gap before Queen Freja ordered Cinderella’s father to marry Lady Klara.\u003c/p\u003e\n\u003cp\u003eIf her father meant to flee, why didn’t he?\u003c/p\u003e\n\u003cp\u003e“He bought the manor before our servants saved us. After, maybe he decided to stay,” Cinderella said, excited. Her hopeful smile fell from her face. “Or maybe he just didn’t get the chance to leave,” she said.\u003c/p\u003e\n\u003cp\u003eCinderella closed her eyes and recalled her father’s face, his warm smile, and soothing laughter. “Papa wouldn’t have spread hate,” she whispered. “Even when everyone else was taken captive, he said it was our fault for going after Erlauf first.”\u003c/p\u003e\n\u003cp\u003eCinderella scrambled to her feet. “I will never know if my father meant for us to flee to Loire and leave our servants behind, or if he had another plan entirely. What I do know is that he wouldn’t want me to stand by and watch everyone be destroyed.”\u003c/p\u003e\n\u003cp\u003eCinderella shifted her eyes from the great chateau to the distant city lights. “And if that mage meant to murder me, it must mean that I can challenge this shared hatred.”\u003c/p\u003e\n\u003cp\u003eCinderella’s mind buzzed like a humming bird as she stalked to the front of her property. There were a million things she had to do, and she had to do them immediately.\u003c/p\u003e\n\u003cp\u003eAs much as the finances pained her, it was time to hire a few Erlauf servants—perhaps people who knew something of flowers and could assist Cinderella’s poor, over-worked gardener with future flower crops.\u003c/p\u003e\n\u003cp\u003eShe needed to start hosting again—not the elaborate parties of ages past, but simple and tasteful dinners. She could invite Julien and his Erlauf miss, and Marie and Armel, and whatever officers Friedrich could rustle up. The separation had to end.\u003c/p\u003e\n\u003cp\u003eWorst of all, she would have to face Queen Freja and her family. “If we have to forgive, that means I must forgive,” Cinderella said through clenched teeth. “This desire, it’s too big for me. How can I change a country when my reach is only to Werra?”\u003c/p\u003e\n\u003cp\u003e“You should have dropped your illusion and attacked her with your regular magic—regulations or not,” a cheerful, grandmother-y voice said.\u003c/p\u003e\n\u003cp\u003e“I’m already in trouble for using magic in Arcainia. The last thing I need is another broken rule for the Conclave to wave in my face,” said another voice, which was far more youthful and slightly lower pitched.\u003c/p\u003e\n\u003cp\u003e“Yes, but that wretched queen would be safely dead, and the princes wouldn’t be flapping about as barnyard fowl.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t, so our hope rests in Princess Elise. You are sure there is no easy test I can use to sense the strength of her magic?”\u003c/p\u003e\n\u003cp\u003e“Not with that magic type, dearie. It would take a powerful enchanter to probe her limitations. Your master could do it.”\u003c/p\u003e\n\u003cp\u003e“Sybilla.”\u003c/p\u003e\n\u003cp\u003e“I know, I know. Well here is how I see it: Send Elise to face this Queen Clotilde and stand in reserve. If it looks like she will lose, step in, and use your real magic. Sooner or later, you will have to face it anyway.”\u003c/p\u003e\n\u003cp\u003e“As you say so. What are we doing here?”\u003c/p\u003e\n\u003cp\u003e“We’re here to see a girl. My sources tell me the lady of the house had a nasty run in with a mage.”\u003c/p\u003e\n\u003cp\u003e“A black mage?”\u003c/p\u003e\n\u003cp\u003e“You betcha. I would like to question her to see what more we can learn.”\u003c/p\u003e\n\u003cp\u003eThe two speakers rounded the corner of shrubbery that shielded them from Cinderella’s sight, and Cinderella felt her breath leave her.\u003c/p\u003e\n\u003cp\u003eThe first speaker—the grandmother-y voice—was a short, squat woman who wore golden wire eyeglasses. She had salt and pepper hair, but it was soft and shiny like a housecat’s fur. She wore a friendly smile, and every part of her plump person leaked comfort and joy.\u003c/p\u003e\n\u003cp\u003eHer companion was a stark contrast.\u003c/p\u003e\n\u003cp\u003eThe lower pitched speaker was also female, but she was young like a blooming flower and was beautiful enough to steal Cinderella’s breath. Her eyes glittered like brightly polished jewels, her hair looked softer than silk, and she wore an iridescent blue dress, which seemed to turn purple as Cinderella gaped.\u003c/p\u003e\n\u003cp\u003e“Hello there, dearie,” the grandmother-woman said, flapping a hand at Cinderella.\u003c/p\u003e\n\u003cp\u003e“You did not tell me you were here to see Duchess Lacreux,” the beautiful woman said.\u003c/p\u003e\n\u003cp\u003e“I am. How did you know?”\u003c/p\u003e\n\u003cp\u003e“The Duchess is famous for her scarlet-colored hair.”\u003c/p\u003e\n\u003cp\u003e“You’ve been tramping across the earth for how long on your doomed quest, and you still can remember that the Trieux Duchess has red hair?”\u003c/p\u003e\n\u003cp\u003e“It’s a fact I recently learned while I was looking for these,” the beautiful lady said as held a pair of sparkling glass slippers at her companion. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-63.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
