{"id":83241,"no":67,"title":"Page 67","content":"\u003cp\u003eHer heart pounded in her throat, and Cinderella’s mind buzzed. What should she say? What could she say? No one would mistake her for an Erlauf lady, but did everyone know of her brilliant red hair?\u003c/p\u003e\n\u003cp\u003e“I won’t say my name. Not yet. Even if someone in the court does know of my red hair, they must also know I chopped it. Perhaps they will think I wore a wig as part of the masquerade. I don’t think anyone will correctly guess who I am. I haven’t even met any Erlauf nobility besides when I was presented to Queen Freja as the new duchess.”\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003eCinderella felt ill-prepared when the carriage entered Werra. In less time than Cinderella would have liked, the mice-horses pranced to a stop in front of the palace, which glowed with the setting sun.\u003c/p\u003e\n\u003cp\u003eThe carriage door opened, and the goat girl helped Cinderella exit the pumpkin.\u003c/p\u003e\n\u003cp\u003eThe palace entrance was lined with soldiers and guards. Cinderella looked for familiar faces among the men—although she didn’t see any—as she climbed the stairs. They did not blink or even acknowledge her presence. They stood stiffly, their swords unsheathed but lowered.\u003c/p\u003e\n\u003cp\u003eCowed by the silence and swords, Cinderella followed the burgundy runner rugs that lined the floor and led the way to the ballroom.\u003c/p\u003e\n\u003cp\u003eAs the palace—and thus the ballroom—were built and designed by Trieux, the architecture was over the top with extravagance.\u003c/p\u003e\n\u003cp\u003eThe ballroom was two levels—the main floor housed swirling dancers and an orchestra. The second floor was nothing more than a balcony that edged the perimeter of the room, although it held over a hundred guests who strolled, murmured, and admired the views from the full-length windows. On both floors, there were patios and terraces made of the finest white marble that allowed attendees to enjoy the cool evening air and afforded them a lovely outlook of the royal gardens.\u003c/p\u003e\n\u003cp\u003eThe ceiling was vaulted and covered with ornate Trieux murals—typically hunting scenes, the Trieux unicorn rearing beautifully, and meadow scenes. Chandeliers hung from the ceiling like glittering webs, and the floor was Trieux blue, made to compliment the night sky and set off the white marble.\u003c/p\u003e\n\u003cp\u003eThe biggest feat of the room was the throne. The Trieux throne was a monstrosity of white and blue marble, set off by Trieux lavender cushions. The throne was placed on a platform created by the merging of three staircases. Two of the staircases cascaded down from the second floor, and the biggest rose up from the first floor to support the smaller two.\u003c/p\u003e\n\u003cp\u003eChandeliers, blue curtains, and candelabras were arranged around and below the staircases to make the throne look as if it were rising up out of the stars.\u003c/p\u003e\n\u003cp\u003eBefore Cinderella always thought it was beautiful imagery. Now, a member of the working class and responsible for the livelihood of all her employees, she felt the throne—beautiful as it was—was a tacky show of poor spending.\u003c/p\u003e\n\u003cp\u003eQueen Freja stood on the platform, some paces in front of the throne as if to distance herself from it.\u003c/p\u003e\n\u003cp\u003eThe two Erlauf Princes stood at the base of the stairs that breeched the first level, standing in a military style and speaking to those who shuffled forward in the long line, waiting to speak to the queen. The consort was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003eCinderella considered joining the line until she caught whiff of the refreshments. “Food,” Cinderella said, abandoning her goal and following her nose.\u003c/p\u003e\n\u003cp\u003eTables of food were laid out in a connecting room. There was stuffed cabbage, five kinds of smoked sausage, poppy seed rolls, crepes stuffed with nuts and chocolate sauce, chilled cherry soup, sweet plum dumplings, and many more traditional Erlauf dishes Cinderella did not have a hope of recognizing.\u003c/p\u003e\n\u003cp\u003eThere were also tables of wines, brandies, and beer to consume, as well. None of the food or drinks bore even the vaguest hint of Trieux influence.\u003c/p\u003e\n\u003cp\u003eCinderella bit her lip before she sampled a piece of sausage. It was fantastic. So fantastic that Cinderella gathered the courage to try the dishes she did not know. She nibbled on the delicious food, wondering if she could smuggle some home, when she grew aware of someone standing next to her.\u003c/p\u003e\n\u003cp\u003eA young man dressed in the uniform of a Major bowed when Cinderella finally looked at him. “If you would pleasure me with a dance, Lady,” he said, extending his hand.\u003c/p\u003e\n\u003cp\u003eCinderella stared at the soldier.\u003c/p\u003e\n\u003cp\u003eThis wasn’t part of her plan.\u003c/p\u003e\n\u003cp\u003eBesides Friedrich, she was used to being ignored by males from Erlauf. Why was he asking her to dance? Did she look pitiful?\u003c/p\u003e\n\u003cp\u003eCinderella looked nervously around and swallowed the last bit of food she was chewing—an excellent sampling of cheese. “Of course,” she said, taking his hand and allowing herself to be led back to the ballroom and to the dance floor.\u003c/p\u003e\n\u003cp\u003eCinderella tried to study her new companion—wondering if he was one of Friedrich’s men and, thus, had recognized her—but his mask covered at least half his face. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-67.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
