{"id":83244,"no":70,"title":"Page 70","content":"\u003cp\u003eCinderella started estimating how long it would take her to reach the front of the line, counting on her fingers.\u003c/p\u003e\n\u003cp\u003e“Is something wrong, Mademoiselle?” asked a muffled voice.\u003c/p\u003e\n\u003cp\u003eThe voice sounded familiar, so Cinderella automatically raised her eyes.\u003c/p\u003e\n\u003cp\u003eA young man dressed in black with a gray mask that covered his entire face addressed her. A crown was perched on his head. It was smaller and less ornate than the queen’s, and was made of copper or bronze and had only a large ruby surrounded by polished beads of onyx to decorate it.\u003c/p\u003e\n\u003cp\u003eThe air left Cinderella’s lungs as she realized she was addressing one of the Erlauf princes, and she had no idea what either of them were named. “Prince…”\u003c/p\u003e\n\u003cp\u003e“Cristoph. The older one,” the prince said, his voice sounded amused rather than offended.\u003c/p\u003e\n\u003cp\u003e“Prince Cristoph,” Cinderella awkwardly repeated. “I thank you for the attention, but I am fine. I was merely taking note of the hour.”\u003c/p\u003e\n\u003cp\u003e“You were wondering if the wait was worth it to meet Mother?” the prince said. His mask had no opening for his mouth, and the eyeholes were covered with white netting, so Cinderella could see no part of his face. As such, it was hard for Cinderella to tell if he was being sarcastic or not because the mask muffled his voice and made him sound flat. Additionally, he seemed to be speaking oddly, as if he were pitching his voice extra low.\u003c/p\u003e\n\u003cp\u003e“I am sure Her Majesty Queen Freja is worth a wait of any length,” Cinderella firmly said. “But I am not certain I can stay long enough to speak to her.”\u003c/p\u003e\n\u003cp\u003e“Then speak with me, and when you return home, you can report to your family that you did speak to a member of royalty,” Prince Cristoph said.\u003c/p\u003e\n\u003cp\u003eCinderella considered the offer.\u003c/p\u003e\n\u003cp\u003eHe’s not the queen. But I suppose speaking to the Crown Prince is an excellent start.\u003c/p\u003e\n\u003cp\u003e“Very well, if you are not opposed to spending some of your time on me.”\u003c/p\u003e\n\u003cp\u003e“Not at all,” Prince Cristoph said before directing Cinderella out of the line.\u003c/p\u003e\n\u003cp\u003eThe second prince—who wore clothes and a mask identical to Prince Cristoph’s—watched them leave, his face trained in their direction.\u003c/p\u003e\n\u003cp\u003e“Was there anything you wished to discuss with my mother?” Prince Cristoph asked.\u003c/p\u003e\n\u003cp\u003e“Yes, actually,” Cinderella said as she strolled with the prince.\u003c/p\u003e\n\u003cp\u003ePeople cleared the way for them, opening up a walking path wherever Cristoph went. Oddly enough, considering the way men had been kissing her hand and taking up her arm with no hesitation, the Prince did not lay so much as a finger on Cinderella, nor did he offer his arm as they walked.\u003c/p\u003e\n\u003cp\u003e“Did you wish to scold her over the rising taxes?” Prince Cristoph asked.\u003c/p\u003e\n\u003cp\u003eCinderella frowned. “I would not be so rude and poor mannered to address that topic, Your Highness.”\u003c/p\u003e\n\u003cp\u003e“Then what did you plan to discuss with her?”\u003c/p\u003e\n\u003cp\u003e“Trieux.”\u003c/p\u003e\n\u003cp\u003ePrince Cristoph stopped walking for a brief moment. “I see. And what are your concerns?”\u003c/p\u003e\n\u003cp\u003eCinderella took a deep breath and tried to calm her fluttering heart. “I feel the attitude of Erlauf and the remaining Trieux citizens must be addressed. The people are locked in a struggle against each other, and it is not good for a country—even one as strong as Erlauf—to have a portion of it divided.”\u003c/p\u003e\n\u003cp\u003e“You think Queen Freja should reestablish a Trieux government?”\u003c/p\u003e\n\u003cp\u003e“Stars above, no.” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eCinderella paused for a moment, composing her reply. Well, he hasn’t made fun of me yet, she thought.\u003c/p\u003e\n\u003cp\u003e“It has come to my attention that Erlauf is under attack, not by another country, but by sheer evil. Trieux cannot stand against an enemy of that caliber. Releasing Trieux will only bring waste to the land,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“That sounds melodramatic.”\u003c/p\u003e\n\u003cp\u003e“Of this I am aware, but it cannot be denied.”\u003c/p\u003e\n\u003cp\u003e“What proof do you have of this supposed evil?”\u003c/p\u003e\n\u003cp\u003eCinderella grimly considered the question. She had great proof—her own experience, and Friedrich’s words. But she would like to avoid identifying herself. Taking a chance, Cinderella said, “It is no used to pretend otherwise, Your Highness. I have heard of the various attacks against the Erlauf Royal family.”\u003c/p\u003e\n\u003cp\u003ePrince Cristoph neither confirmed nor denied Cinderella’s accusation. “What do you propose?”\u003c/p\u003e\n\u003cp\u003eThis was it!\u003c/p\u003e\n\u003cp\u003e“The separation between those of Erlauf and those of Trieux must be done away with. It is more an operation of attitude than action, but to succeed Queen Freja will need to make a conscious effort,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“You expect her to heal the divide with kindness?”\u003c/p\u003e\n\u003cp\u003e“Hate cannot drive out hate,” Cinderella said, echoing Friedrich. “As long as hate is shared, Trieux and Erlauf will be in an eternal struggle.”\u003c/p\u003e\n\u003cp\u003ePrince Cristoph was silent. “I would not argue that,” he finally said. “But it seems our lovely Queen will be footing the bill for this forgiveness you desire.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-70.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
