{"id":83248,"no":74,"title":"Page 74","content":"\u003cp\u003eWhen the smoke cleared, the elderly goat baaed at Cinderella. The four mice arranged themselves at Cinderella’s feet, shivering, and the young goat stumbled and shook her head.\u003c/p\u003e\n\u003cp\u003eCinderella’s fancy dress was gone. She hadn’t noticed when the white and gray fabric transformed back to her servants clothes, but she was grateful it had. She hurriedly took her apron off and ripped it in half. She ripped the ties off the bottom half and tied them around the leather collars the goats wore. She took the top half of the apron and tied it to her head, covering her hair. She placed the glass slipper—the only reminder of the entire mad evening—on the remaining square of apron fabric. She tied the fabric around it like it was a sack of food that she carried.\u003c/p\u003e\n\u003cp\u003e“Hide for a moment,” Cinderella said to the mice.\u003c/p\u003e\n\u003cp\u003eThey scurried off into the underbrush, doing as they were told.\u003c/p\u003e\n\u003cp\u003eWhen the soldiers entered the woods moments later, they found only a servant girl toting two goats instead of the fleeing coach with the agile carriage horses they were looking for.\u003c/p\u003e\n\u003cp\u003e“Spread out and see if the dogs can pick up the trail,” a lieutenant riding a black horse shouted, holding a torch above his head.\u003c/p\u003e\n\u003cp\u003e“Yes, sir!”\u003c/p\u003e\n\u003cp\u003eThe lieutenant dismounted and approached the girl and her goats—who were baaing and shying at the soldiers and their dogs.\u003c/p\u003e\n\u003cp\u003e“Good evening, miss,” the lieutenant said, dipping the brim of his hat at the girl. “I apologize for the interruption, but did you happen to see a round, gold carriage come through these woods?”\u003c/p\u003e\n\u003cp\u003e“A round carriage?” the girl said, yelping when her buck goat tried to headbutt a dog that was sniffing an unripe pumpkin nearby. “That would certainly be an odd sight. Nope, I haven’t seen anything like that ‘round here,” she said, her eyes wide.\u003c/p\u003e\n\u003cp\u003e“Are you certain?” the lieutenant asked.\u003c/p\u003e\n\u003cp\u003e“I think t’would be rather hard to miss, if you excuse me for saying so,” the goat girl said, a little breathless as her goats yanked her around.\u003c/p\u003e\n\u003cp\u003e“Very well, thank you for your time,” the lieutenant said before he returned to his horse and blew a whistle and addressed his soldiers. “Red Dogs, follow the road with the dogs and search for tracks. Gray Boys, search the woods on both sides. Don’t depend on the dogs. Look for tracks, and keep an eye out for any side trails they may have taken. She can’t have gotten too far, or our scouts on the walls would have seen her leave the trees,” he said.\u003c/p\u003e\n\u003cp\u003eAs the soldiers organized themselves, they ignored the wide-eyed servant girl and her white goats. They didn’t even notice when the girl stopped to let four mice crawl into her sack before she started off, her shoulders stiff and her chin held high.\u003c/p\u003e\n\u003cp\u003eChapter 16\u003c/p\u003e\n\u003cp\u003e“There you are, Cinderella. You have chosen an unlikely spot to sleep in.”\u003c/p\u003e\n\u003cp\u003eCinderella groaned and rolled over, crashing off the settee she had collapsed in the night before.\u003c/p\u003e\n\u003cp\u003e“Ow,” she said. The aches and pains of her body brought the previous night’s events to her mind. Her feet hurt from the dancing and walking without shoes. Her arms hurt from the goats yanking on her the whole way home. As they had popped out on the wrong side of Werra, it had taken over an hour to reach Aveyron. It was all Cinderella could do to put the goats away, free the mice, and collapse in the nearest settee.\u003c/p\u003e\n\u003cp\u003e“Your servants are desperately looking for you. Some officials have arrived—they are asking for you.”\u003c/p\u003e\n\u003cp\u003eCinderella finally recognized Lady Klara’s voice. “Great,” she said into the ground.\u003c/p\u003e\n\u003cp\u003e“I will inform Jeanne of your location, but, Cinderella?”\u003c/p\u003e\n\u003cp\u003e“Hm.”\u003c/p\u003e\n\u003cp\u003e“You looked lovely last night,” Lady Klara said before she was gone with the swish of skirts.\u003c/p\u003e\n\u003cp\u003eThat comment got Cinderella scrambling off the floor. “You saw?” she squeaked. If Lady Klara realized it was her, did anyone else?”\u003c/p\u003e\n\u003cp\u003eLady Klara was already gone, though, and Jeanne barged through the door seconds later.\u003c/p\u003e\n\u003cp\u003e“Mademoiselle,” she said, the closest thing she ever came to chiding Cinderella as she took in Cinderella’s wrinkled, askew clothes. “You must change into something more suitable, now,” she said, hovering around Cinderella in an effort to herd her to her rooms.\u003c/p\u003e\n\u003cp\u003e“Why?” Cinderella asked, rubbing her eyes.\u003c/p\u003e\n\u003cp\u003e“Prince Cristoph has called upon Aveyron, and asks to see you!”\u003c/p\u003e\n\u003cp\u003eCinderella froze. “I beg your pardon, who is here?”\u003c/p\u003e\n\u003cp\u003e“Prince Cristoph! You must get changed—Mademoiselle?”\u003c/p\u003e\n\u003cp\u003eCinderella sprinted out of the room, manners and elegance forgotten.\u003c/p\u003e\n\u003cp\u003e“He’s going to arrest me; he’s going to have me thrown in jail; he’s going to do something!” Cinderella said, darting down the chateau hallways.\u003c/p\u003e\n\u003cp\u003e“Mademoiselle,” various servants called as she charged past them. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-74.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
