{"id":83253,"no":79,"title":"Page 79","content":"\u003cp\u003eCinderella arrived at the palace, late, in a carriage Friedrich sent to pick her up. The footman nor the driver gave her choice of clothing so much a second glance, but the closer they drew to the Palace, the more aware Cinderella was of the declaration her plain clothes made.\u003c/p\u003e\n\u003cp\u003eShe was about to meet Queen Freja, Friedrich’s mother and the ruler of the country. I don’t want to antagonize her…but I will not be made into a pretty Trieux doll that stands at Friedrich’s side. She was wrong to tax Aveyron, to tax Trieux so much. I will not pretend otherwise, Cinderella thought before she popped out of the carriage.\u003c/p\u003e\n\u003cp\u003eA butler escorted Cinderella through the palace. Cinderella’s heart pounded in her throat when the butler stopped in front of a set of doors and threw them open.\u003c/p\u003e\n\u003cp\u003e“Duchess Lacreux,” he announced, stepping aside and bowing.\u003c/p\u003e\n\u003cp\u003eThe room—a parlor—was filled with low-pitched murmurings. The whispers fell silent when Cinderella stepped forward, entering the light of the fire.\u003c/p\u003e\n\u003cp\u003eQueen Freja stood, her face cold and unmoving as granite. Prince Johann was with her, covering his mouth with his jacket sleeve to hide his grin and muffle his laugh. The consort—Commander Lehn—froze in the middle of standing up.\u003c/p\u003e\n\u003cp\u003eOnly Friedrich reacted as if nothing was wrong. “Cinderella, I’m glad you are finally here. I was almost ready to dispatch a squad to track you down,” he said, strolling up to her side.\u003c/p\u003e\n\u003cp\u003e“I was detained,” Cinderella said.\u003c/p\u003e\n\u003cp\u003e“What, was a cow about to calf?” Prince Johann asked.\u003c/p\u003e\n\u003cp\u003e“Johann,” Queen Freja said, her voice sharp.\u003c/p\u003e\n\u003cp\u003eCinderella gave the younger prince her most brilliant smile. “I would be the last person my servants would call upon for such a situation, for I am rather ignorant in that area,” she said, taking Friedrich’s arm. “It seems, though, you have some knowledge of the act?”\u003c/p\u003e\n\u003cp\u003e“Lady Lacreux, how good it is to see you again,” Commander Lehn said before his son could reply, bowing when Cinderella and Friedrich approached the rest of the family.\u003c/p\u003e\n\u003cp\u003eCinderella swallowed as she met Queen Freja’s dark eyes, preparing herself for the verbal war that was likely to commence. This was it. This was her first meeting with the loathed Queen Freja, the woman Cinderella itched to shake and yell at for years. And she was marrying this woman’s son.\u003c/p\u003e\n\u003cp\u003e“Cinderella, I apologize.”\u003c/p\u003e\n\u003cp\u003eCinderella blinked. “I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“I have wronged you,” Queen Freja said. “I singled out Trieux nobles—in particular I singled out you, to tax in order to make up for the country’s deficit. It was ignoble and unforgiveable as a monarch acquainting herself with her new subjects.”\u003c/p\u003e\n\u003cp\u003eCinderella opened and closed her mouth, baffled beyond words.\u003c/p\u003e\n\u003cp\u003e“I have pushed you and your compatriots to the brink out of sheer spite. It pains me to admit it, but I have done a poor job of ruling Trieux. I ask that you would forgive us, forgive me,” Queen Freja said, bowing her head.\u003c/p\u003e\n\u003cp\u003eAll of Cinderella’s anger, hatred, and stored words to shout were gone. As the ultimate ruler of a country, it would be difficult to tell a seventeen-year-old Trieux girl she behaved wrongly.\u003c/p\u003e\n\u003cp\u003eWhen Cinderella’s father accepted the rules and regulations Erlauf threw at them after the war, Cinderella thought he was afraid for their lives. But now, Cinderella understood why he reacted without hate. No matter what he left behind, Cinderella had no doubts of her Father’s heart, because of the words he spoke.\u003c/p\u003e\n\u003cp\u003e“My Father, a kind and noble man, once told me nobody wins in a war,” Cinderella said, finding her voice. “I think I finally, fully understand what he meant. Both Trieux and Erlauf have committed transgressions. I accept your apology, and I offer my forgiveness, if you will look past the pain my country has caused you, My Queen.”\u003c/p\u003e\n\u003cp\u003eQueen Freja smiled with her eyes. “I am glad Friedrich chose you,” she said, her voice low and melodic.\u003c/p\u003e\n\u003cp\u003eFriedrich and Cinderella shared a look. “I knew you would be,” he said, his voice smug as he slid an arm around Cinderella and squeezed her.\u003c/p\u003e\n\u003cp\u003eThe royal family laughed.\u003c/p\u003e\n\u003cp\u003e“…you mentioned a deficit?” Cinderella asked to cover up some of her embarrassment.\u003c/p\u003e\n\u003cp\u003e“To finance the war, we took a loan from Arcainia—a large obligation we have scrambled to fulfill. All of your tax money went straight to Arcainia to pay back what we owe,” Friedrich said. “I’m sorry, Pet, but the kingdom you are about to become Princess over is in debt.”\u003c/p\u003e\n\u003cp\u003eCinderella offered the royal family a weak smile. “If I know anything,” she said, “It is debt and deficits.”\u003c/p\u003e\n\u003cp\u003e“Cinderella, Friedrich has hogged you for entirely too long. Please, tell me about yourself. What are your likes and dislikes?” Commander Lehn said, his kind smile putting Cinderella at ease. “Besides food,” he teased.\u003c/p\u003e\n\u003cp\u003eCinderella laughed. “Food is certainly something I deeply enjoy. I liked horseback riding, although I cannot boast of much skill in that area. Trade interests me, as do current events,” Cinderella said.\u003c/p\u003e\n\u003cp\u003eJohann raised an eyebrow. “So you are a budding scholar?” he asked. “Ouch,” he said when Friedrich kicked him in the back of the knee.\u003c/p\u003e\n\u003cp\u003e“Unfortunately not. I have an abundance of ignorance,” Cinderella sighed. \u003c/p\u003e","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-79.html","bookId":1806,"creation":"Oct 5, 2019 4:50:18 PM","modification":"Oct 5, 2019 4:50:18 PM"}
