{"id":73578,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003e“Your Mom brought me the letter today.” The pain in my chest was so sharp I had to fight to keep from bending over and screaming. “I read every last word. Several times.”\u003c/p\u003e\n\u003cp\u003eThe autumn wind caressed my face but wasn’t enough to dry my tears. The tears were endless. Never ceasing. Swallowing hard, I forced myself to continue. I needed him to hear me. “It isn’t fair you know… a letter isn’t the proper way to say goodbye. It sucks, Josh. It sucks so damn bad.” A sob tore from my chest. I pressed my fist against my heart. How much more pain could it take before it just exploded into a million pieces?\u003c/p\u003e\n\u003cp\u003e“You always told me we’d grow old together. We’d sit on our front porch swing, holding hands and watching our grandkids play in the yard. You promised me that,” I choked out as I pressed my thumb against the tiny diamond solitaire that he’d placed on my finger just six months ago.\u003c/p\u003e\n\u003cp\u003e“You broke your promise. You’ve never broken a promise before. This time you let me down and left me this letter. How do I move on from this, huh? Did you expect me to just read it and everything would be better? Did you expect me to cry a few tears then move on?” I would get no response. Nothing more than the letter weighing heavy in my back pocket. It was so tear-stained now that several of the words were hard to read. Didn’t matter though. I had it all memorized. Every. Last. Word.\u003c/p\u003e\n\u003cp\u003e“I started to write you a letter and bring it to you today. My chance at a few last words— but I couldn’t. I can’t scream and yell in a letter. Words on paper can’t hold the emotions churning inside me.” I reached into my pocket and pulled out the worn letter that would haunt me for the rest of my life.\u003c/p\u003e\n\u003cp\u003e“Instead of writing you a letter I decided I’d respond to yours in person. It’s only fair. No… it isn’t fair,” I spat angrily, “because none of this is fair but this is all I get. This is all you allowed me to have.”\u003c/p\u003e\n\u003cp\u003eI opened the one page letter carefully. I didn’t want to tear it because the words written on it, were all I had left. I began to read aloud:\u003c/p\u003e\n\u003cp\u003e“My Eva Blue.” Fresh tears streamed down my face. Just reading the nickname Josh had given me when we were nine years old was painful. How could I read this entire letter aloud without crumbling to the ground?\u003c/p\u003e\n\u003cp\u003e“The fact I’m writing this letter pains me more than you could ever know. This isn’t something I ever want you to read but I know that you deserve a goodbye. You deserve so much more than that and God willing you will get the perfect life that we’ve spent hours together daydreaming about.” I stopped reading and lifted my eyes from the words on the paper.\u003c/p\u003e\n\u003cp\u003e“We made those plans, Josh. You and me. Those aren’t just my plans. They’re our plans, damn you! How could you just leave me? We had it all figured out. All those nights spent lying under the stars choosing the names of our children, the color of our bedroom, the flowers we’d plant in the pots on our front porch, the summer house we’d have on the beach, ALL OF THAT WAS US!”\u003c/p\u003e\n\u003cp\u003eAnother tear rolled down my face and I quickly swiped it away with my hand before it could drop to the paper below. I had to finish this. As hard as reading this was, I had to finish it. This would never be closure. I’d never get closure. This would be the closest thing I’d ever get to a goodbye.\u003c/p\u003e\n\u003cp\u003e“I’ve loved you since the moment I looked into those pretty blue eyes of yours. Even at five years old, I knew there’d never be a girl that could take your place in my heart. No one would ever compare to you. It would always be you for me, Eva Brooks. Always. Please remember that, you were all that ever mattered to me. No one else ever touched my heart the way you did. My life was marked with every year I grew more and more in love with the wild, crazy, beautiful girl next- door. I lived in awe that this perfect angel wanted me, that this amazing woman would be my wife. The life we planned. The life we dreamed about was what kept me going as long as I did.” Sinking to the ground, I pulled my knees against my chest and sobbed as I forced my eyes to focus on the words I had to read. I had to. I had to.\u003c/p\u003e\n\u003cp\u003e“I pray to God you never have to read this letter. I want this to be a letter I pull out of my box one day for you to read when we are old and gray. We can smile and realize how much we have to be thankful for that this letter was never needed. But Eva, if you do receive this letter from my mom one day, then know: I loved you until my last breath. You were the only thing on my mind when I closed my eyes the last time. Our time together was more perfect than anyone’s life should be. The life I lived was heaven on Earth because I spent it with you.”\u003c/p\u003e\n\u003cp\u003e“Oh God, Josh, I can’t do this without you! I can’t do this without you. I love you so much. Please, please God,” I wept loudly. No one heard me. The graveyard was empty. The last few lines of the letter were the most impossible to accept. How could he even think that his words were possible?\u003c/p\u003e\n\u003cp\u003e“One day you will heal. Life will go on for you. Another guy will be lucky enough to find a place in your heart. When that happens, love him. Move on. Live that life of happiness that you deserve. Know that I loved you. Know that you made my life complete. But move on Eva. Love again. Live your life.”\u003c/p\u003e\n\u003cp\u003eLove,\u003c/p\u003e\n\u003cp\u003eJosh\u003c/p\u003e\n\u003cp\u003eEighteen months later… \u003c/p\u003e","sourceLink":"https://allnovel.net/while-it-lasts-sea-breeze-3/page-1.html","bookId":1987,"creation":"Oct 5, 2019 10:28:23 AM","modification":"Oct 5, 2019 10:28:23 AM"}
