{"id":73595,"no":18,"title":"Page 18","content":"\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eCage\u003c/p\u003e\n\u003cp\u003eEva’s head was thrown back and her long dark curls were fanned out over the pillow as she cried out my name. The tremors that coursed through her body only caused her to press harder against my ready-to-explode dick.\u003c/p\u003e\n\u003cp\u003eSomehow I’d managed to keep from ripping her panties off and shoving my briefs down so I could bury myself inside her and find relief. This was not a position I’d ever been in and it was painful as shit.\u003c/p\u003e\n\u003cp\u003eHer long lashes fluttered open slowly as her body began to relax underneath me. A small smile played on her lips and I suddenly felt like a damn rock star. I might be harder than fucking cement but I’d made her feel damn good. That put a smile on my face.\u003c/p\u003e\n\u003cp\u003e“Wow,” she breathed. Her eyelids were droopy. She’d sleep good tonight. I wouldn’t mind tucking her in like this every night.\u003c/p\u003e\n\u003cp\u003e“You’re gorgeous but when you come it’s beautiful,” I whispered, brushing the hair out of her face.\u003c/p\u003e\n\u003cp\u003e“You sure know the right things to say to a girl,” she said in a low raspy voice.\u003c/p\u003e\n\u003cp\u003ePart of me wanted to get angry at her flippant assumption but I knew she only knew what she’d been told.\u003c/p\u003e\n\u003cp\u003e“Make no mistake. I’ve never stayed around long enough to say ‘thanks’ after I get off. Much less to tell a girl that she was beautiful when she comes. I’ve never cared to watch anyone else.”\u003c/p\u003e\n\u003cp\u003eA small ‘o’ formed on her red swollen lips. I bent down and pressed a kiss to them then lifted myself up off her. I needed to go finish this off in the bathroom. There was no way I’d get any sleep like this.\u003c/p\u003e\n\u003cp\u003e“Where are you going?” she asked sleepily as I stood up.\u003c/p\u003e\n\u003cp\u003e“I got some business to take care of. I’ll be back in a few minutes,” I winked and headed for the bathroom.\u003c/p\u003e\n\u003cp\u003eStepping inside I studied the shower and tried to decide if I should just take a cold shower or if I was so far gone I needed to grab the baby oil.\u003c/p\u003e\n\u003cp\u003e“Cage?” Eva’s called out.\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Can I come in?”\u003c/p\u003e\n\u003cp\u003eFuck. Did she really not realize I’d come in here to beat off?\u003c/p\u003e\n\u003cp\u003eThe door opened and she stepped inside. Her tank top had been put back on but she was still wearing those lacy panties I knew for a fact were soaked. My cock throbbed harder just thinking about it.\u003c/p\u003e\n\u003cp\u003e“Can I do it?” she asked nervously.\u003c/p\u003e\n\u003cp\u003e“Do what?”\u003c/p\u003e\n\u003cp\u003eShe walked over to stand in front of me and slid her hand down over my erection from hell.\u003c/p\u003e\n\u003cp\u003e“I want to make it better,” she whispered.\u003c/p\u003e\n\u003cp\u003eI dropped my attention from her face to her hand on my cock. She moved it up gently squeezing and my knees buckled. Oh fuck, yeah.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I croaked out and leaned back against the wall for support.\u003c/p\u003e\n\u003cp\u003eShe lightly trailed her fingernail down my chest before taking the waistband of my boxers and pushing them down. I stared down in fascination as she knelt in front of me until my underwear was on the floor. I stepped out of them and she moved them away before standing back up and placing a kiss on my chest.\u003c/p\u003e\n\u003cp\u003eIf she kept this up I was going to erupt without her touching me.\u003c/p\u003e\n\u003cp\u003e“Do you have lotion?” she asked, looking up at me through her eyelashes.\u003c/p\u003e\n\u003cp\u003e“Baby oil. Bottom drawer.”\u003c/p\u003e\n\u003cp\u003eShe turned and found the bottle that was rarely used and poured some into both her hands and warmed it up. I watched her with rapt fascination and came real close to begging.\u003c/p\u003e\n\u003cp\u003eShe turned back to me and both of her slippery warm hands covered me and began sliding up and down my swollen dick.\u003c/p\u003e\n\u003cp\u003e“Holy shit,” I groaned, letting my head fall back on the wall.\u003c/p\u003e\n\u003cp\u003eHer warm mouth covered my pierced nipple and I felt my knees start to give out again. I wasn’t going to last long.\u003c/p\u003e\n\u003cp\u003eOpening my eyes I watched as Eva’s tongue flicked my nipple and pulled it every few licks to suck on it. When she moved back to stare down at her hands I followed her gaze. The sight of both her small hands sliding up and down my cock sent me over the edge.\u003c/p\u003e\n\u003cp\u003e“Fuck, I’m gonna come. Move,” I ordered, standing up. She didn’t move. Instead, she pressed me up against the wall with her small body and her grip tightened. I exploded in her hands.\u003c/p\u003e\n\u003cp\u003e“Ahhhhhh!” I cried out as she kept slowly pumping me until there was no more left. I stared down at the mess she was determined to participate in.\u003c/p\u003e\n\u003cp\u003eI couldn’t believe she’d just done that. Hell, I couldn’t believe I’d just let her. When was the last time I’d been jacked-off by a girl? Junior high? Probably. But damn if that wasn’t the hottest thing I’d ever seen. Would everything with Eva be like this? Was it all going to be so much…more?\u003c/p\u003e\n\u003cp\u003e“Oh,” she breathed, smiling up at me. “I liked that.”\u003c/p\u003e\n\u003cp\u003eLaughing, I reached for the nearest towel and started cleaning her up first.\u003c/p\u003e\n\u003cp\u003e“Not as much as I did,” I replied.\u003c/p\u003e\n\u003cp\u003e“Yeah, probably not. You look like you enjoyed it quite a bit,” she teased as I wiped off her hands.\u003c/p\u003e\n\u003cp\u003eEva\u003c/p\u003e\n\u003cp\u003eCage was wrapped around me when I opened my eyes the next morning. His arm held me up tightly against his chest and his leg was threaded through mine. I snuggled closer. This was nice. I’d never slept with a guy before. Except for the night I was drunk and slept with Cage in the barn.\u003c/p\u003e\n\u003cp\u003eLast night had been amazing. I forgot how much I missed being close to someone that way. Josh and I had never had sex but we’d messed around. Although we’d never rubbed against each other until I came, I had helped him get off many times when our kissing and touching had gotten him all worked up. He’d never come on my hands. He always pulled away and covered himself first. With Cage I’d wanted more. Maybe it was because I was older now. I wanted things I’d never wanted back then.\u003c/p\u003e\n\u003cp\u003eIf it wasn’t for the fact I was just one of many for Cage I would have been willing to go all the way. My body had sure wanted to and his desperate declaration about wanting to be inside me had been hard to resist. However, I couldn’t let what was happening between us become too important. Summer would end and he would leave. I needed to look at our time together as a time of healing. I could enjoy it while it lasted.\u003c/p\u003e\n\u003cp\u003e“Mmmmmm you feel good,” Cage whispered into my ear with a husky voice.\u003c/p\u003e\n\u003cp\u003eHis hand trailed down to tickle my stomach and I giggled and squirmed.\u003c/p\u003e\n\u003cp\u003e“No squirming,” he warned and put some space between his erection and my bottom.\u003c/p\u003e\n\u003cp\u003e“Okay, fine. I’ll be good.” I rolled over and stared up at him. He propped his head up with his hand and grinned wickedly down at me.\u003c/p\u003e\n\u003cp\u003e“Just so you know, I felt you up in your sleep,” he admitted.\u003c/p\u003e\n\u003cp\u003e“What!” I asked, sitting up some.\u003c/p\u003e\n\u003cp\u003e“I’m teasing. Well, maybe not completely. I did slip my hand under your top and play with those incredible tits of yours. But you enjoyed it. I was there.”\u003c/p\u003e\n\u003cp\u003eLaughing, I threw my pillow at his head and crawled out of bed.\u003c/p\u003e\n\u003cp\u003e“Hey! Where you going?”\u003c/p\u003e\n\u003cp\u003eI threw my hair back over my shoulder and glanced back at him. “I’m starving. I’m going to see if there is food to eat in this place.”\u003c/p\u003e\n\u003cp\u003eCage groaned, “Food. I forgot to get food.”\u003c/p\u003e\n\u003cp\u003eHe swung his legs off the bed and stood up, then stretched. Every tanned muscle in his body flexed and bulged. Suddenly food no longer seemed important.\u003c/p\u003e\n\u003cp\u003eHe finished and caught me gawking. “I normally charge for that show but you get it for free.” He winked and grabbed a pair of jeans out of his closet.\u003c/p\u003e\n\u003cp\u003eI started to suggest he just leave the jeans off and do that stretchy thing again when a knock at the door interrupted me.\u003c/p\u003e\n\u003cp\u003eWho would be here this early? I stepped back into the room and went over to my bag to find some clothes.\u003c/p\u003e\n\u003cp\u003eCage didn’t bother with a shirt. His jeans hung deliciously on his hips and showcased the two dimples in his lower back. I wanted to lick those next time.\u003c/p\u003e\n\u003cp\u003e“It’s probably Low,” he said, heading for the door and closing it behind him so I could get dressed.\u003c/p\u003e\n\u003cp\u003eI wasn’t sure I wanted to officially meet Low now that I knew who she was. I pulled out the short yellow sundress I’d brought and slipped it on. I’d left my toiletry bag in Cage’s bathroom last night. My hair and teeth both needed a brush.\u003c/p\u003e\n\u003cp\u003eI tried hard to look presentable without going to the trouble of putting on makeup. I pulled my hair over my shoulder and put a ponytail holder in it to keep it from going wild. I would need a shower before we went anywhere.\u003c/p\u003e\n\u003cp\u003eWhen I opened the door and stepped into the kitchen the smell of coffee hit my nose. Thank God.\u003c/p\u003e\n\u003cp\u003e“There she is,” Cage said smiling at me. He was sitting on the counter with a cup of coffee in his hand. Still shirtless and looking too beautiful for his own good. “Low brought food.” He jumped down off the counter and came over to me.\u003c/p\u003e\n\u003cp\u003e“Eva, you remember Low. She committed the great offense of changing my sheets.” Cage was grinning like a little boy at his attempt to be funny.\u003c/p\u003e\n\u003cp\u003eLow laughed and it sounded almost musical. “Leave her alone Cage. It isn’t nice to tease females. You know better,” she scolded him\u003c/p\u003e\n\u003cp\u003eLow held up two large brown paper bags. “I knew he wouldn’t have any food here and I hated for y’all to wake up hungry. So I brought biscuits, sausage, eggs and donuts if you prefer sweets for breakfast.”\u003c/p\u003e\n\u003cp\u003eMy stomach rumbled. I put a hand over it and Cage chuckled, “Come on girl, I’ll feed you.”\u003c/p\u003e\n\u003cp\u003eCage took the bags from Low and began opening them and getting down plates from the cabinet. I turned my attention to Low. “I’m really sorry about how rude I was when we met. I don’t know why I acted so ridiculous over sheets and a towel…” I trailed off hoping she accepted my moment of stupidity.\u003c/p\u003e\n\u003cp\u003eLow smiled and cut her eyes over at Cage. “Don’t worry about it. I completely understand. I shouldn’t have just intruded.”\u003c/p\u003e\n\u003cp\u003eTrying to explain myself would only prove to be embarrassing so I just decided to let it go. Maybe she’d just forget about it eventually.\u003c/p\u003e\n\u003cp\u003e“Your breakfast is served,” Cage said, bringing me a plate of food. “Go sit down and I’ll pour you coffee.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I replied. He’d put some of everything on my plate. I wasn’t about to complain. I was starving.\u003c/p\u003e\n\u003cp\u003e“Coffee with two creams and a sugar right?” he said as he walked toward the coffee pot.\u003c/p\u003e\n\u003cp\u003eI started to reply and stopped. How did he know that? We’d never had coffee together.\u003c/p\u003e\n\u003cp\u003eWhen I didn’t reply he glanced back at me. He saw the question in my eyes and his cocky smirk tugged at his lips.\u003c/p\u003e\n\u003cp\u003e“You told Jeremy once what you wanted in your coffee while you were sitting in the rocking chair on the front porch. He was inside so you called it out. I was unloading the truck and I heard you,” he explained.\u003c/p\u003e\n\u003cp\u003eWow.\u003c/p\u003e\n\u003cp\u003e“Oh,” I replied, feeling Low’s eyes on me. She was watching us closely.\u003c/p\u003e\n\u003cp\u003e“So, you met everyone last night? Are you terrified now?” Low asked in a chipper tone as I sat down at the table across from her.\u003c/p\u003e\n\u003cp\u003e“They were nice. Very entertaining.”\u003c/p\u003e\n\u003cp\u003eCage laughed, “That’s her way of saying my friends are all a bunch of freaks.”\u003c/p\u003e\n\u003cp\u003e“That is not true. I really did like them.”\u003c/p\u003e\n\u003cp\u003eCage walked over and set a cup of coffee down beside my plate then placed a kiss on my head before going back to fix himself something to eat. The curiosity in Low’s face almost made me laugh. Did she not know this man better than anyone else? Surely she wasn’t shocked by anything he said or did.\u003c/p\u003e\n\u003cp\u003e“When do y’all have to go back today?” Low asked\u003c/p\u003e\n\u003cp\u003eI had just taken a bite of my eggs and couldn’t answer her.\u003c/p\u003e\n\u003cp\u003e“I figure we’ll head out about five or so. I want to get her back before her dad gets home. And I need to check the cows before I get in bed.”\u003c/p\u003e\n\u003cp\u003eLow turned her curious gaze off me and she shifted it to Cage. I didn’t need to look up to know they were having a silent conversation. I used to have those with Josh. I understood them. My chest ached a little at the thought of never having that again. But it didn’t hurt nearly as bad as it used to. I was getting better. Maybe someday I would actually be able to move on.\u003c/p\u003e\n\u003cp\u003eCage cleared his throat and I knew that he was letting Low know that their silent conversation was over. Another signal I’d used with Josh.\u003c/p\u003e\n\u003cp\u003e“Well, what are y’all planning on doing today?” Low asked\u003c/p\u003e\n\u003cp\u003eI glanced up from my plate and looked to Cage. I had no idea what all he wanted to do today.\u003c/p\u003e\n\u003cp\u003e“I thought we’d spend a few hours on the beach and that’s about as far as I’ve gotten with plans,” Cage replied.\u003c/p\u003e\n\u003cp\u003e“That sounds like fun.” Low started to say more but her phone began ringing. She glanced down at it and frowned.\u003c/p\u003e\n\u003cp\u003e“Who is it?” Cage asked watching her carefully.\u003c/p\u003e\n\u003cp\u003eLow sighed and stood up. “It’s my sister,”\u003c/p\u003e\n\u003cp\u003eCage scowled. “Want me to get rid of her?”\u003c/p\u003e\n\u003cp\u003eLow shook her head and headed into the other room before I heard her say. “Hello?”\u003c/p\u003e\n\u003cp\u003eCage was watching the door with a strange protective stance. It almost looked like he was ready to snatch the phone out of her hand if her sister said anything to upset her.\u003c/p\u003e\n\u003cp\u003e“Is her relationship with her sister that bad?” I asked, wanting him to relax. He turned his head towards me and his shoulders eased when our eyes met. “Yeah. Her sister’s a bitch. She’s put Low through hell.”\u003c/p\u003e\n\u003cp\u003eBut Low had obviously had a very loyal Cage to fend off the bullies in her life. “If you need to go check on her, it’s okay.”\u003c/p\u003e\n\u003cp\u003eHe studied me a minute then a pleased smile came over his face. “If she needs me she’ll come get me. I’d rather sit in here with you and enjoy my breakfast.” \u003c/p\u003e","sourceLink":"https://allnovel.net/while-it-lasts-sea-breeze-3/page-18.html","bookId":1987,"creation":"Oct 5, 2019 10:28:23 AM","modification":"Oct 5, 2019 10:28:23 AM"}
