{"id":73580,"no":3,"title":"Page 3","content":"\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eCage\u003c/p\u003e\n\u003cp\u003eThis could not be my room. It was the size of the closet in my bedroom at my apartment. I dropped my duffle down onto the twin bed that sat crammed in the corner of the tiny room. On the opposite side, a small, round bedside table barely had enough space to fit between the side of the bed and the wall. Then at the other end of the narrow room was a shower. The cement floor had a drain in the far corner and a small showerhead came out of the wall. A simple rod and dark blue shower curtain were the only barriers between the shower and the bed. I was pretty sure if I got too carried away in the shower I’d get the bed wet. My phone started ringing in my pocket and I pulled it out to see Low’s name lighting up the screen.\u003c/p\u003e\n\u003cp\u003e“Hey, baby,” I replied backing up and sinking down onto the bed. Surprisingly the mattress wasn’t bad.\u003c/p\u003e\n\u003cp\u003e“So, how is everything? Are they nice?” Just hearing Low’s voice made me feel better—not so alone.\u003c/p\u003e\n\u003cp\u003e“I’ve only met the guy’s daughter and the next-door neighbor.”\u003c/p\u003e\n\u003cp\u003e“Oh, so there’s a farmer’s daughter?” The teasing tone in Low’s voice made me chuckle. Yeah, there was a farmer’s daughter alright but it wasn’t what Low was thinking.\u003c/p\u003e\n\u003cp\u003e“There’s a farmer’s daughter but she hated me on sight. Crazy I know, and to think, I thought it was impossible for a female to hate me until after I bagged her then forgot her name in the morning.”\u003c/p\u003e\n\u003cp\u003e“She hates you? That’s… odd.” Low’s voice trailed off like she was in deep thought.\u003c/p\u003e\n\u003cp\u003eThe loud sound of the barn door swinging open caught my attention.\u003c/p\u003e\n\u003cp\u003e“Low, I gotta go baby. I think the old man’s here.”\u003c/p\u003e\n\u003cp\u003e“Okay, be on your best behavior.”\u003c/p\u003e\n\u003cp\u003e“Always,” I replied before hanging up and slipping my phone back into my pocket.\u003c/p\u003e\n\u003cp\u003e“Hello?” a deep burly voice called out.\u003c/p\u003e\n\u003cp\u003eI walked out of the small broom closet they’d stuck me in and headed for the sound of his voice. As I turned the corner, I stopped short. The dude was huge. At least six-foot-seven and three hundred pounds of hard muscle. The straw cowboy hat cocked back on his head showed that he was completely bald.\u003c/p\u003e\n\u003cp\u003e“You Cage York?” he asked. His serious expression reminded me a lot of Coach but that was as far as the similarities went. Coach was not this fucking massive.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I replied and the man’s eyes narrowed and he took a step towards me. It took every last bit of my self-control not to back the hell up.\u003c/p\u003e\n\u003cp\u003e“Boy, your Daddy ever tell you it’s rude not to respect your elders? I expect any kid your age to respond to me with a ‘yes sir’. That understood?”\u003c/p\u003e\n\u003cp\u003eReally? What the hell was Coach thinking? This would never work.\u003c/p\u003e\n\u003cp\u003e“When I ask you a question I expect a response,” the giant growled.\u003c/p\u003e\n\u003cp\u003eFine. I’d give him a fucking response, “No.”\u003c/p\u003e\n\u003cp\u003eHis frown grew deeper and annoyance flickered in his eyes. I had a lot riding on this damn job but I wasn’t one to handle this kind of shit well.\u003c/p\u003e\n\u003cp\u003e“No, what?” he asked in a slow drawl.\u003c/p\u003e\n\u003cp\u003e“No; my daddy didn’t teach me anything but that his fucking fists were bigger than my momma’s and how to skip out on your family,” I replied with a sneer in my voice.\u003c/p\u003e\n\u003cp\u003eThe angry scowl on his face didn’t change. I hadn’t expected it to but then I also hadn’t expected to tell the man my personal shit. It had just come out. My family was something I’d only ever talked about with Low and that had been when we were younger and it still affected me.\u003c/p\u003e\n\u003cp\u003eI watched as he reached up and rubbed the scuff on his jaw, never once taking his eyes off me. I was ready for this meeting to get over with and him to tell me what it was I was supposed to do exactly.\u003c/p\u003e\n\u003cp\u003e“Mack wants to help you. I trust his judgment. But listen here and listen good. I ain’t above kicking your ass off my property if you do any drugs, or drive a vehicle while drinking. That was stupid, kid. Beyond stupid. And most importantly, stay away from my little girl. She’s completely off limits to you. Got that?”\u003c/p\u003e\n\u003cp\u003eConsidering Eva hated me on sight, the man had nothing to worry about. Besides, no girl was worth fucking up my future. Not when there were so many other willing available females in the world I could enjoy.\u003c/p\u003e\n\u003cp\u003e“Got it. I don’t want to lose my scholarship,” I replied with complete honesty.\u003c/p\u003e\n\u003cp\u003eWith a nod of his head he stuck his large hand out toward me, “In that case, I’m Wilson Brooks. Now, let’s get your ass to work.”\u003c/p\u003e\n\u003cp\u003eEva\u003c/p\u003e\n\u003cp\u003e“Boy ain’t got no Dad. Those are the kinds you stay away from,” Daddy said in way of greeting as he opened the screen door and walked into the kitchen. I rolled my eyes as I went back to battering the chicken breasts I was going to fry for dinner.\u003c/p\u003e\n\u003cp\u003e“I mean it Eva. He ain’t had the same upbringing you have and he’s cocky with no respect for authority. Just rubs me the wrong way.” Daddy set his hat down on the table and walked over to fix himself a glass of sweet iced tea.\u003c/p\u003e\n\u003cp\u003e“I wasn’t impressed by him. Stop preaching at me. I’m not on the hunt for a man.” I’d never date again. I had Jeremy and until he met a girl and fell in love, I would have a companion to do things with. The familiar pang in my chest reminded me that I held him back from a life. I hated that he put everything else aside to take care of me. He was always so worried about me. I knew for a fact Chelsea Jacobson had a crush on him. I really needed to do something to push him in her direction.\u003c/p\u003e\n\u003cp\u003e“Hmph,” Daddy mumbled as he sat down at the end of the kitchen table. “I know you aren’t looking for a guy Eva girl but honey, you’re a woman. One day you’re going to have to open your heart again.”\u003c/p\u003e\n\u003cp\u003e“Daddy, don’t please. I just want to fry this chicken, make your favorite blueberry cobbler, and enjoy dinner. Let’s not talk about anything else. Okay?”\u003c/p\u003e\n\u003cp\u003eWith a deep sigh, Daddy finally nodded. He reached for his hat and placed it back on his bald head. “It’s times like this I think I made a mistake not marrying again. Maybe you did need a Momma after all. Because right now I don’t know what to do to fix this for you, baby girl.”\u003c/p\u003e\n\u003cp\u003eI laid the last piece of battered chicken on the plate and washed my hands under the faucet. Then took an extra-long time scrubbing my fingers with the soap before turning to look at my dad. “You were enough. You are enough. Don’t say that anymore. I’m happy just the way things are. I don’t need someone to fill Josh’s place in my life. I don’t want someone to fill his place. Okay?”\u003c/p\u003e\n\u003cp\u003eDaddy closed the distance between us and gave me a quick hard hug before turning and leaving the kitchen through the same door he’d entered. I knew my disinterest in dating other guys and moving on bothered him but I couldn’t. I wouldn’t. Josh had been my future. Now he was gone.\u003c/p\u003e\n\u003cp\u003eThe door swung back open behind me. I wasn’t expecting Jeremy tonight for dinner but I’d made enough just in case.\u003c/p\u003e\n\u003cp\u003eIt wasn’t Jeremy. It was him.\u003c/p\u003e\n\u003cp\u003eCage held up his hands as if to say he came in peace. The easy smile from earlier was gone. He wasn’t looking at me like he wanted to take a bite either. Instead, he looked disinterested.\u003c/p\u003e\n\u003cp\u003e“I just need a drink. Your dad sent me in here and said to ask you. But I can see you’re busy so if you’d point me to the glasses I’ll get my own water.”\u003c/p\u003e\n\u003cp\u003eWas this the same guy from earlier? I forced myself not to continue gawking at him and I turned to get a glass out of the cabinet. I handed it to him. “I keep a pitcher of ice water in the fridge. We have well water here and water from a well tastes better when it’s really cold.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “Thanks.”\u003c/p\u003e\n\u003cp\u003eI turned back around and checked the temperature of the oil on the stove.\u003c/p\u003e\n\u003cp\u003eThe sound of Cage gulping down the water had images flashing in my head of how his throat muscles would move with each swallow. I closed my eyes tightly trying to stop my imagination. I listened as he opened the fridge and poured himself some more water. Then once again he drank it quickly. The silence in the kitchen only intensified the sound of his drinking.\u003c/p\u003e\n\u003cp\u003e“That’s better. I was fu—uh—really thirsty. Thanks for the glass and the water,” Cage sighed and walked to the sink. “You want me to wash it or is that something you’d rather do?”\u003c/p\u003e\n\u003cp\u003e“Uh, I can get it,” I stammered, still completely thrown off balance by his behavior.\u003c/p\u003e\n\u003cp\u003e“Thanks. But I don’t mind washing it.”\u003c/p\u003e\n\u003cp\u003e“No, really I can do it. I’ll just rinse it and stick it in the dishwasher anyway,” I was rambling.\u003c/p\u003e\n\u003cp\u003eThe kitchen door swung open again and I was so thankful for the interruption until Becca Lynn came bouncing into the house all blonde curls and smiles. Normally I enjoyed Becca’s bubbly interruptions in my life but not now. Not when Cage was standing here. Becca was an idiot when it came to attractive guys and Cage York went beyond attractive.\u003c/p\u003e\n\u003cp\u003eHer big brown eyes slowly took him in. I cleared my throat trying to get her attention but she wasn’t aware anyone else was in the room. The tight tank top and cut off shorts complete with cowboy boots was Becca’s summer wardrobe. It was all she ever wore and she wore it well. I shifted my attention from Becca to Cage whose sexy smirk had returned and he was enjoying the view just as much as she was. I couldn’t call Becca Lynn my best friend because Josh had always been my best friend. Nevertheless, she was the closest female friend I’d ever had. Where Josh and Jeremy grew up to the right of me, Becca Lynn grew up on the farm to the left of me. So when I’d needed a partner in crime that wasn’t male, it had been Becca. She and Jeremy had once had a thing back during our sophomore year of school. I was pretty sure she’d been the one to take his virginity. But it was short lived. Jeremy had ended it without an explanation and Becca Lynn had cried on my shoulder a few days then moved on the next week to Benji Fitz.\u003c/p\u003e\n\u003cp\u003e“You didn’t tell me you had company, Eva,” Becca Lynn cooed, twirling one of her long blonde locks around her finger while batting her eyelashes in Cage’s direction. Good Lord she was ridiculous.\u003c/p\u003e\n\u003cp\u003e“I don’t have company Becca,” I retorted, hoping to get her attention but it didn’t work. “This is Daddy’s summer help. He’s working with our cows. Because he got a DUI and he’s serving time.” Maybe that would snap her up out of the worshipful gaze she had on him. It didn’t.\u003c/p\u003e\n\u003cp\u003e“Oh, so you’ll be here all summer?” she asked, still smiling up at Cage like he was a freaking rock star.\u003c/p\u003e\n\u003cp\u003e“Looks that way,” he replied in an amused tone. Great, even the man whore beside me thought she was making a fool of herself.\u003c/p\u003e\n\u003cp\u003e“Well, when you’re not working and get bored I could keep you company—“\u003c/p\u003e\n\u003cp\u003e“Becca Lynn,” I raised my voice to stop her from offering to come warm his damn bed in the barn.\u003c/p\u003e\n\u003cp\u003eFinally, her eyes shifted off Cage to meet my gaze. The twinkle in her eye told me she knew exactly how it sounded and she didn’t care one bit.\u003c/p\u003e\n\u003cp\u003e“Thank you. I’m sure that I’ll be needing someone to show me what to do for entertainment when the work-day is through. I can’t think of anyone else I’d rather have take me around and enlighten me about the things to do out here in the country.” The sexy drawl thing he had going on just pissed me off. It also gave me chill bumps and made my heart race.\u003c/p\u003e\n\u003cp\u003eBecca Lynn’s eyes swung back over to eat Cage alive. “That sounds like a really good plan.” She cooed, closing the distance between them and holding out her perfectly manicured hand. I was sure the hot pink nails that she wiggled in his direction invitingly, matched her toenails. Becca was as high maintenance as they came around here. “I’m Becca Lynn Blevins.”\u003c/p\u003e\n\u003cp\u003eCage closed the small amount of space Becca had left between them and slipped his hand into hers. Did Becca just shiver? “Cage York and it’s a pleasure, Becca.”\u003c/p\u003e\n\u003cp\u003e“Oh,” she breathed out, her head tilted back as she drank him in. I swear, if he kissed her in my kitchen I was going to throw my cobbler batter at him.\u003c/p\u003e\n\u003cp\u003e“I got to get back to work. I’ll be looking for you to come entertain me soon, Becca Lynn,” Cage said in a low whisper then stepped around her and headed out the door without a backward glance.\u003c/p\u003e\n\u003cp\u003eThe second the door closed behind him Becca pulled out a kitchen chair and sank down into it with a loud thump. “OHMYGOD!” she squealed. “I swear I think I just creamed my damn panties.”\u003c/p\u003e\n\u003cp\u003eCringing from the mental image, I shook my head and made a gagging noise. “I was ready for you to lay on my table and spread your legs for him right here. You really need to get a grip on yourself, Becca. You came off as a complete slut.”\u003c/p\u003e\n\u003cp\u003eBecca let out a loud sigh, “Oh, who cares! He was the most incredibly delicious male specimen I have ever laid my eyes on. I want to marry him and have his babies and wash his body and dress him and hell, Eva, I just want to touch his body all day long. I could do it the rest of my life and never grow tired.”\u003c/p\u003e\n\u003cp\u003eBefore I could think of a response that would hopefully be a source of wisdom for her, the door swung open again and Jeremy walked inside. His presence eased me. Just the familiar face that was so much like his brother’s helped remind me I’d had it all once. Jeremy’s eyes found Becca sitting at the table with the dazed expression still on her face. A knowing grin touched his lips.\u003c/p\u003e\n\u003cp\u003e“I see Becca Lynn met Cage.”\u003c/p\u003e\n\u003cp\u003eI nodded and dropped a chicken breast into the oil that was finally bubbling.\u003c/p\u003e\n\u003cp\u003e“I bet he ate you up, Becca. Poor boy got a rude welcome from Eva earlier. Having a female actually drool over him must have been nice for his ego.”\u003c/p\u003e\n\u003cp\u003eJeremy would have to bring that up.\u003c/p\u003e\n\u003cp\u003e“You were rude to THAT piece of perfection?” Becca Lynn asked incredulously.\u003c/p\u003e\n\u003cp\u003eI focused on frying the chicken in front of me. I wasn’t going to talk about this. “You two staying for dinner?” I asked instead.\u003c/p\u003e\n\u003cp\u003e“Is he eating dinner with you?” Becca Lynn asked hopefully.\u003c/p\u003e\n\u003cp\u003e“Of course not. He’s the help. Besides, Daddy isn’t a fan of his. I’ll fix him a plate and send it out to the barn.”\u003c/p\u003e\n\u003cp\u003e“MEMEMEME! Can I take it out to him?” Becca asked. I didn’t have to look back to know she was bouncing up and down in her seat.\u003c/p\u003e\n\u003cp\u003eAn image of Cage York with his shirt off, pressing Becca up against the wall and actually putting his hands on her had me shaking my head no.\u003c/p\u003e\n\u003cp\u003e“Daddy won’t like that. I’ll have Jeremy take it.” I was sure Daddy wouldn’t really care who took it as long as it wasn’t me. For some reason, the idea of Becca touching Cage bothered me. I wasn’t sure why exactly but it did. The idea of my friend pregnant and unmarried with a loser as the baby-daddy was probably the main reason. \u003c/p\u003e","sourceLink":"https://allnovel.net/while-it-lasts-sea-breeze-3/page-3.html","bookId":1987,"creation":"Oct 5, 2019 10:28:23 AM","modification":"Oct 5, 2019 10:28:23 AM"}
