{"id":78496,"no":102,"title":"Page 102","content":"\u003cp\u003e\"Have I asked you to read them into existence? No. This world is so well equipped that you can manage very well without stopping to make up something new every five minutes — although that fool Orpheus thinks otherwise. I hope by now he’s begging in the streets of Ombra — that’d serve him right for making my fairies rainbow-colored!\"\u003c/p\u003e\n\u003cp\u003e\"Beppe, walk for a little, will you?\" Meggie put the boy down, although he resisted, and instead picked up a little girl who was so tired that she could hardly keep on her feet.\u003c/p\u003e\n\u003cp\u003e\"How much farther?\" A question that she had asked Mo so often herself, on those endless drives when they were going to cure another few sick books. Not far now, Meggie! She could almost hear her father’s voice, and for a moment her weariness made her imagine he was putting his jacket around her cold shoulders, but it was only a branch brushing against her back, and when she slipped on the wet leaves that covered the ground like a carpet, only Roxane’s hand kept her from falling.\u003c/p\u003e\n\u003cp\u003e\"Careful, Meggie,\" she said, and for a moment her face seemed as familiar as Resa’s.\u003c/p\u003e\n\u003cp\u003e\"We’ve found the tree!\" Doria appeared in front of them so suddenly that some of the smaller children hid, alarmed, behind the grown-ups. He was drenched with rain and trembling with cold, but he looked happy — happier than he had been for many days.\u003c/p\u003e\n\u003cp\u003e\"Farid stayed there. He’s going to climb the tree and see if the nests are still fit to live in!\" Doria spread his arms wide. \"They’re huge! We’ll have to construct something to help us haul the little ones up, but I have an idea.\"\u003c/p\u003e\n\u003cp\u003eMeggie had never heard him talk so fast or so much before. One of the little girls ran toward him, and Doria picked her up and whirled her around in a circle with him, laughing. \"The Milksop will never find us up there!\" he cried. \"Now we only have to learn to fly and we can live as free as the birds!\"\u003c/p\u003e\n\u003cp\u003eThe children all began talking excitedly, until the Black Prince raised his hand.\u003c/p\u003e\n\u003cp\u003e\"Where is the tree?\" he asked Doria. His voice was heavy with fatigue. Sometimes Meggie feared that the poison had broken something in him, casting a shadow over the light that had always been a part of him before.\u003c/p\u003e\n\u003cp\u003e\"Right ahead, there!\" Doria pointed through the trees that dripped with rain.\u003c/p\u003e\n\u003cp\u003eSuddenly, even the weariest feet could walk again. \"Quiet!\" the Prince warned the children as they shouted louder and louder, but they were too excited to obey, and the forest echoed to the sound of their clear voices.\u003c/p\u003e\n\u003cp\u003e\"There, told you so, didn’t I?\" Suddenly, Fenoglio was walking beside Meggie, his eyes full of his old pride in the world he had written. It was easily aroused.\u003c/p\u003e\n\u003cp\u003e\"Yes, you did.\" Elinor got in before Meggie with the answer. She was obviously feeling cross in her damp clothes. \"But I haven’t seen these fabulous nests of yours yet, and I must say the prospect of perching up at the top of a tree in this weather doesn’t exactly sound enticing.\"\u003c/p\u003e\n\u003cp\u003eFenoglio glared at Elinor with contempt. \"Meggie,\" he asked in a low voice, \"what’s that lad there called? You know, the Strong Man’s brother.\"\u003c/p\u003e\n\u003cp\u003e\"You mean Doria?\"\u003c/p\u003e\n\u003cp\u003eDoria glanced around as she spoke his name, and Meggie smiled at him. She liked the way he looked at her. His glance warmed her heart in a way quite unlike Farid’s.\u003c/p\u003e\n\u003cp\u003eIn a very different way.\u003c/p\u003e\n\u003cp\u003e\"Doria,\" murmured Fenoglio. \"Doria. Sounds somehow familiar to me.\u003c/p\u003e\n\u003cp\u003e\"Hardly surprising,\" said Elinor sarcastically. \"The Dorias were a very famous aristocratic Italian family.\"\u003c/p\u003e\n\u003cp\u003eFenoglio gave her a look that was far from friendly, but he never got a chance to reply.\u003c/p\u003e\n\u003cp\u003e\"There they are!\"\u003c/p\u003e\n\u003cp\u003eIvo’s voice was so loud in the gathering dusk that Minerva instinctively put her hand over his mouth.\u003c/p\u003e\n\u003cp\u003eAnd there they really were.\u003c/p\u003e\n\u003cp\u003eHuman nests.\u003c/p\u003e\n\u003cp\u003eThey looked just as Fenoglio had described them in his book. He had read the passage aloud to Meggie. Gigantic nests in the crown of a mighty tree, with evergreen branches reaching so high into the shy that its top seemed lost in the clouds. The nests were round like fairies’ nests, but Meggie thought she saw bridges between them, ladders and nets made of twining tendrils. The children gathered around the Black Prince and stared up, enchanted, as if he had led them to a castle in the clouds. But Fenoglio looked happiest of all.\u003c/p\u003e\n\u003cp\u003e\"Aren’t they fabulous?\" he cried.\u003c/p\u003e\n\u003cp\u003e\"They’re a very long way up, that’s for sure!\" Elinor sounded far from enthusiastic.\u003c/p\u003e\n\u003cp\u003e\"Well, that’s the whole point!\" replied Fenoglio brusquely, but Minerva and the other women were also looking at the nests in dismay.\u003c/p\u003e\n\u003cp\u003e\"What happened to the people who used to live up there?\" asked Despina. \"Did they fall out of the nests?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not!\" said Fenoglio impatiently, but Meggie could see he hadn’t the faintest idea what had happened to the original nest-dwellers.\u003c/p\u003e\n\u003cp\u003e\"Oh no, I suppose they just wanted to get back to the ground!\" said Jasper in his clear little voice.\u003c/p\u003e\n\u003cp\u003eThe two glass men were sitting in the deep pockets of Darius’s coat. He was the only one who had anything like proper winter clothing, but he was always ready to share his coat generously with a few of the children. He let them slip in under the warm fabric like chicks under a mother hen’s wings.\u003c/p\u003e\n\u003cp\u003eThe Black Prince looked up at the strange dwellings, scrutinized the tree that they would have to climb — and said nothing.\u003c/p\u003e\n\u003cp\u003e\"We can pull the children up in nets,\" said Doria. \"The creepers will make ropes.\u003c/p\u003e\n\u003cp\u003eFarid and I have tried them. They’ll hold.\"\u003c/p\u003e\n\u003cp\u003e\"This is the best possible hiding place!\"\u003c/p\u003e\n\u003cp\u003eIt was Farid’s voice calling to them. Nimble as a squirrel, he came climbing down the trunk as if he had lived in trees in his old life, not in the desert. \"Even if the Milksop’s hounds find us we can defend ourselves from up here!\"\u003c/p\u003e\n\u003cp\u003e\"With luck they won’t find us at all,\" said the Black Prince. \"I hope we’ll be able to hold out up there until..\u003c/p\u003e\n\u003cp\u003eThey all looked at him expectantly. Until — yes, until when?\u003c/p\u003e\n\u003cp\u003e\"Until the Bluejay’s killed the Adderhead!\" said one of the children so confidently that the Prince had to smile.\u003c/p\u003e\n\u003cp\u003e\"Yes, exactly. Until the Bluejay’s killed the Adderhead.\"\u003c/p\u003e\n\u003cp\u003e\"And the Piper!\" added one of the boys.\u003c/p\u003e\n\u003cp\u003e\"Of course, the Piper, too.\" Hope and anxiety were equally balanced in the glance that Battista exchanged with the Black Prince.\u003c/p\u003e\n\u003cp\u003e\"That’s right, he’ll kill them both, and then he’ll marry Her Ugliness, and they’ll reign over Ombra and live happily ever after!\" Despina’s smile was as delighted as if she could already see the wedding before her eyes.\u003c/p\u003e\n\u003cp\u003e\"No, no!\" Fenoglio looked at her, as horrified as if her words might come true the next moment. \"The Bluejay already has a wife, Despina, doesn’t he? Have you forgotten Meggie’s mother?\"\u003c/p\u003e\n\u003cp\u003eDespina glanced at Meggie in alarm and put her hand over her mouth, but Meggie just stroked her smooth hair. \"Sounds like a good story all the same,\" she whispered to the child.\u003c/p\u003e\n\u003cp\u003e\"Start getting ropes up into the tree,\" the Black Prince told Battista, \"and ask Doria just how he plans to haul up the nets. The rest of you, climb to the top of the tree and see which nests are still sound.\"\u003c/p\u003e\n\u003cp\u003eMeggie looked up at the dense thicket of branches. She had never set eyes on a tree like it before. The bark was reddish brown, but as rough as the bark of an oak, and the trunk did not branch until high up in the tree, although it had so many bulges that you could find footholds and handholds everywhere. In some places huge tree fungi formed platforms. Hollows gaped in the towering trunk, and crevices full of feathers showed that human beings were not the only creatures to have nested in this tree. \u003c/p\u003e","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-102.html","bookId":2721,"creation":"Oct 5, 2019 4:09:40 PM","modification":"Oct 5, 2019 4:09:40 PM"}
