{"id":78528,"no":134,"title":"Page 134","content":"\u003cp\u003eIronstone stirred the ink and looked at him anxiously. His fury obviously showed clearly on his face, written there in small beads of sweat.\u003c/p\u003e\n\u003cp\u003eConcentrate, Orpheus, he told himself— and tried again. There were a few words that he could hardly decipher because the letters ran together so unsteadily, drunk with his rage. Why did he feel as if he were reading the words into a void? Why did they seem like pebbles being dropped down a well, where their echo was lost in the darkness? Something was wrong. He’d never felt like this before when he was reading aloud.\u003c/p\u003e\n\u003cp\u003e\"Ironstone!\" he ordered the glass man. \"Run to the Hall of a Thousand Windows and see how the Bluejay is doing. He ought to be doubled up in agony like a poisoned dog by now.\"\u003c/p\u003e\n\u003cp\u003eThe glass man lowered the twig he was using to stir the ink and looked at him in alarm. \"But . . . but, master, I don’t know the way.\"\u003c/p\u003e\n\u003cp\u003e\"Don’t make such a stupid fuss, or do you want me to ask the Night-Mare if it fancies a glass man for a change? Turn right outside this room and then go straight ahead.\u003c/p\u003e\n\u003cp\u003eAsk the guards the way!\"\u003c/p\u003e\n\u003cp\u003eUnhappily, Ironstone set off. Silly creature! Fenoglio really might have thought up a less ridiculous kind of assistant to help scribes. But that was the trouble with this world — at heart, it was childish. Why had he loved the book so much when he was a child? Well, for that very reason! But now he was grown-up, and it was time this world grew up, too.\u003c/p\u003e\n\u003cp\u003eAnother sentence — and once again the strange feeling that the words were dying away even before he spoke them. Damn it!\u003c/p\u003e\n\u003cp\u003eDizzy with rage, he was reaching for the inkwell to throw it at the painted wall when he suddenly heard loud shouts outside. Orpheus put the inkwell back on the table and listened. What was all this? He opened his door and looked down the corridor. There were no guards outside the Adderhead’s bedchamber anymore, and two servants ran past him in a state of great agitation! By all the devils in hell, what did this mean?\u003c/p\u003e\n\u003cp\u003eAnd why was Dustfinger’s fire burning on the walls again?\u003c/p\u003e\n\u003cp\u003eOrpheus hurried out into the passage and stopped outside the Adderhead’s door. It was open, and the Silver Prince lay dead on his bed, his eyes open so wide that it wasn’t difficult to guess what his last sight had been.\u003c/p\u003e\n\u003cp\u003eInstinctively, Orpheus looked around before he went up to the bed, but of course the White Women had left long ago. They had what they’d been waiting so long for. But how? How had it happened?\u003c/p\u003e\n\u003cp\u003e\"Yes, you’ll have to look for a new master, Four-Eyes!\"\u003c/p\u003e\n\u003cp\u003eThumbling came out from behind the hangings of the bed and gave him a hawkish smile. Orpheus saw the ring that the Adderhead had used to seal death sentences on his lean hand.\u003c/p\u003e\n\u003cp\u003eThumbling was also wearing the Silver Prince’s sword.\u003c/p\u003e\n\u003cp\u003e\"Let’s hope the stink washes out!\" he murmured to Orpheus in a confidential tone as he flung his master’s heavy velvet coat over his shoulders. Then he strode away, down the corridor where Dustfinger’s fire whispered along the walls.\u003c/p\u003e\n\u003cp\u003eBut Orpheus stood there feeling the tears run down his nose. All was lost! He’d staked everything on the wrong card, he’d put up with the stench of the rotting prince, bowed low to him, and wasted his time in this dark castle, all for nothing! It wasn’t he who had written the last song but Fenoglio; who else could it have been?\u003c/p\u003e\n\u003cp\u003eAnd presumably the Bluejay featured as the hero again, while Orpheus was the villain. No, worse! He played the ridiculous part of the loser!\u003c/p\u003e\n\u003cp\u003eHe spat in the Adderhead ‘s rigid face and stumbled back to his room, where the useless words still lay on the table. Trembling with rage, he picked up the inkwell and poured its contents over what he had written.\u003c/p\u003e\n\u003cp\u003e\"Master, master! Have you heard?\" The glass man, out of breath, was standing in the doorway. He was quick on his spidery legs, you had to give him that.\u003c/p\u003e\n\u003cp\u003e\"Yes, I know, the Adderhead’s dead! What about the Bluejay?\"\u003c/p\u003e\n\u003cp\u003e\"They’re fighting! He and the Piper are fighting.\"\u003c/p\u003e\n\u003cp\u003e\"Aha. Well, perhaps Silvernose may run him through yet. That would at least be something.\" Orpheus snatched up his things and stuffed them into the fine leather bag he had brought from Ombra: pens, parchment, even the empty inkwell, the silver candelabrum that the Adderhead had given him, and of course the three books —\u003c/p\u003e\n\u003cp\u003eJacopo’s, and the two about the Bluejay. He wasn’t giving up yet, not he.\u003c/p\u003e\n\u003cp\u003eHe picked up the glass man and put him in the pouch at his belt.\u003c/p\u003e\n\u003cp\u003e\"What are you going to do, master?\" asked Ironstone anxiously.\u003c/p\u003e\n\u003cp\u003e\"We’ll summon the Night-Mare and get out of this castle!\"\u003c/p\u003e\n\u003cp\u003e\"The Night-Mare’s gone, master! They say the Fire-Dancer sent it up in smoke!\"\u003c/p\u003e\n\u003cp\u003eDamn, damn, damn. Of course. That was why fire was burning on the walls again!\u003c/p\u003e\n\u003cp\u003eDustfinger had recognized the Night-Mare. He had seen who was breathing there in the heart of darkness! Well, Orpheus, you’ll just have to read yourself another NightMare out of Jacopo’s book, he thought. It wasn’t all that difficult. Only this time he must give it a name that Dustfinger didn’t know!\u003c/p\u003e\n\u003cp\u003eHe listened for sounds in the corridor. Nothing. The rats had deserted the sinking ship. The Adderhead was alone in death. Orpheus went back into the bedchamber where his bloated corpse lay and stole what silver he could find, but Thumbling hadn’t missed much. Then he hurried with the wailing glass man to the tunnel that had brought the Piper to the castle. Water was running down the stone walls as if the passage were sticking in the lake’s moist flesh like a thorn.\u003c/p\u003e\n\u003cp\u003eThe guards posted on the bank to keep watch on the way out were gone, but a few dead soldiers lay among the rocks. In the I end they had clearly killed one another in their panic. Orpheus took a sword from one of the dead men, but threw it away again when he discovered how heavy it was. Instead he took a knife from another dead man’s belt and put the soldier’s coarse cloak over his shoulders. It might look ugly, but it was warm.\u003c/p\u003e\n\u003cp\u003e\"Where are we going, master?\" faltered Ironstone. \"Back to Ombra?\"\u003c/p\u003e\n\u003cp\u003e\"Why would we want to go back there?\" was all that Orpheus replied as he looked up at the dark slopes barring the way to the north.\u003c/p\u003e\n\u003cp\u003eTo the north. . . he had no idea what to expect there. As with so much else in his book, Fenoglio had written nothing about it, and that was just why he would go north. The mountains looked far from inviting, with their snowy peaks and bleak slopes. But it was the best way to go now that Ombra, he supposed, would soon belong to Violante and the Bluejay. To hell with that wretched bookbinder, to the hottest hell the human mind can imagine, he thought. And may Dustfinger freeze in eternal ice until his treacherous fingers break off!\u003c/p\u003e\n\u003cp\u003eOrpheus looked back at the bridge one last time before making —for the trees. There went the Silver Prince’s soldiers, running away. And what were they running away from? Two men and their white guardian angels. And their lords bloated body.\u003c/p\u003e\n\u003cp\u003e\"Master, master, couldn’t you put me on your shoulder? Suppose I fall out of this pouch?\" the glass man wailed.\u003c/p\u003e\n\u003cp\u003e\"Then I’ll need a new glass man!\" Orpheus replied.\u003c/p\u003e\n\u003cp\u003eNorthward into unwritten country. Yes, he thought as his feet, with difficulty, sought a way up the steep slope. Maybe that part —of this world will obey my words.\u003c/p\u003e\n\u003cp\u003eCHAPTER 79\u003c/p\u003e\n\u003cp\u003eLEAVING\u003c/p\u003e\n\u003cp\u003eThe Piper’s sword had cut deep into Resa’s arm, but Brianna had learned a good deal from her mother, even though she liked singing to Violante better than growing herbs in stony fields. \u003c/p\u003e","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-134.html","bookId":2721,"creation":"Oct 5, 2019 4:09:40 PM","modification":"Oct 5, 2019 4:09:40 PM"}
