{"id":78441,"no":47,"title":"Page 47","content":"\u003cp\u003eBut Mo was not there.\u003c/p\u003e\n\u003cp\u003eCHAPTER 24\u003c/p\u003e\n\u003cp\u003eTo BLAME\u003c/p\u003e\n\u003cp\u003eResa waited among the graves until day began to dawn, but Mo did not come back.\u003c/p\u003e\n\u003cp\u003eShe felt Roxane’s pain now, except that she didn’t even have a dead man to mourn.\u003c/p\u003e\n\u003cp\u003eMo was gone as if he had never existed. The story had swallowed him up, and she was to blame.\u003c/p\u003e\n\u003cp\u003eMeggie was crying. The Strong Man held her in his arms while tears ran down his own broad face.\u003c/p\u003e\n\u003cp\u003e\"It’s your fault!\" Meggie had kept shouting, pushing Resa and Farid away, not even letting the Prince comfort her. \"You two persuaded him! Why did I save him after Mortola shot him, if they were going to take him now?\"\u003c/p\u003e\n\u003cp\u003e\"I’m so sorry. I really am so very sorry.\u003c/p\u003e\n\u003cp\u003eOrpheus’s voice still clung to Resa’s skin like something venomously sweet. When the White Women disappeared, he had stood there as if waiting for something, making an effort to hide the smile that kept returning to his lips. But Resa had seen it.\u003c/p\u003e\n\u003cp\u003eIndeed she had.., and so had Farid.\u003c/p\u003e\n\u003cp\u003e\"What have you done?\" He had seized Orpheus by his fine clothes and hammered at the man’s chest with his fists. Orpheus’s bodyguard tried to grab Farid, but the Strong Man held him off.\u003c/p\u003e\n\u003cp\u003e\"You filthy liar!\" Farid had cried, sobbing. \"You double-tongued snake! Why didn’t you ask them anything? You were never going to ask them anything, were you? You just wanted them to take Silvertongue! Ask him! Ask him what else he wrote! He didn’t just write the words he promised Silvertongue, there was a second sheet, too!\u003c/p\u003e\n\u003cp\u003eHe thinks I don’t know what he gets up to because I can’t read—but I can count.\u003c/p\u003e\n\u003cp\u003eThere were two sheets — and his glass man says he was reading out loud last night.\"\u003c/p\u003e\n\u003cp\u003eHe’s right, a voice whispered inside Resa. Oh God, Farid is right!\u003c/p\u003e\n\u003cp\u003eOrpheus, however, had taken great pains to look genuinely indignant. \"What’s all this stupid talk?\" he had cried. \"Do you think I’m not disappointed myself? How can I help it if they took him away with them? I’ve fulfilled my part of the bargain! I wrote exactly what Mortimer asked for! But did I get a chance to ask them about Dustfinger? No! All the same, I won’t ask for my words back. I hope it’s clear to all of you here,\" and he looked at the Black Prince, who still had his sword in his hand,\u003c/p\u003e\n\u003cp\u003e\"that I’m the one who gets nothing out of this deal!\"\u003c/p\u003e\n\u003cp\u003eThe words he had written were still tucked into Resa’s belt. She had been going to throw them after him when he rode away, but then she had kept them after all. The words that were to take them back.., she hadn’t even looked to see what they said.\u003c/p\u003e\n\u003cp\u003eThey had been bought at too high a price. Mo was gone, and Meggie would never forgive her. She had lost them both, again, for the sake of those words. Resa leaned her forehead against the gravestone beside her. It was a child’s grave; a tiny shirt lay on it. I’m so sorry. Once again she remembered Orpheus’s deep, soft voice mingled with her daughter’s sobbing. Farid was right. Orpheus was a liar. He had written what was to happen, and his voice made it come true. He had gotten rid of Mo because he was jealous of him, as Meggie had always said and she had helped him to do it.\u003c/p\u003e\n\u003cp\u003eWith trembling fingers she unfolded the paper that Mo had tucked into her belt. It was damp with dew, and Orpheus’s coat of arms stood above the words, lavish as a prince’s. Farid had told them how he had commissioned it from a designer of crests in Ombra — a crown for the lie that he came from a royal family, a pair of palm trees for the foreign land he claimed to come from, and a unicorn, its winding horn black with ink.\u003c/p\u003e\n\u003cp\u003eMo’s own bookbinder’s mark was a unicorn, too. Resa felt tears coming again. The words blurred before her eyes as she began to read them. The description of Elinor’s house was a little stilted. But Orpheus had found the right words for her homesickness and her fear that this story could make her husband into someone else.\u003c/p\u003e\n\u003cp\u003e, . . How did he know so well what went on in her heart? From you yourself Resa, she thought bitterly. You took all your despair to him. She read on — and stopped short.\u003c/p\u003e\n\u003cp\u003eAnd mother and daughter went away, back to the house full of books, but the Bluejay stayed —promising to follow them when the time came and he had played his part. . .\u003c/p\u003e\n\u003cp\u003e\"I wrote exactly what Mortimer asked for!\" she heard Orpheus saying, his voice full of injured innocence.\u003c/p\u003e\n\u003cp\u003eNo. It couldn’t be true! Mo had wanted to go with her and Meggie. . . hadn’t he?\u003c/p\u003e\n\u003cp\u003eYou’ll never know the answer, she told herself, bent double over the little grave from the pain in her heart. She thought she heard the child inside her weeping, too.\u003c/p\u003e\n\u003cp\u003e\"Let’s go, Resa!\" The Black Prince was there beside her, offering her his hand. His face showed no reproach, although it was sad, very sad. Nor did he ask about the words that Orpheus had written. Perhaps he believed the Bluejay had really been an enchanter after all. The Black Prince and the Bluejay, the two hands of justice — one black, the other white. Now there was only the Prince again. Resa took his hand and rose to her feet with difficulty. Go? Go where? she felt like asking. Bach to the camp, where an empty tent is waiting and your men will bob at me with more hostility than ever?\u003c/p\u003e\n\u003cp\u003eDoria brought her horse. The Strong Man was still standing with Meggie, his big face as tearstained as her daughter’s. He avoided her eyes. So he, too, blamed her for what had happened.\u003c/p\u003e\n\u003cp\u003eGo where? Back?\u003c/p\u003e\n\u003cp\u003eResa was still holding the sheet of paper with Orpheus’s words on it. Elinor’s house.\u003c/p\u003e\n\u003cp\u003eHow would it feel to go back there without Mo? If Meggie would agree to read the words at all. Elinor, I’ve lost Mo. I wanted to protect him, but . . . No, she didn’t want to have to tell that story. There was no going back. There was nothing anymore.\u003c/p\u003e\n\u003cp\u003e\"Come along, Meggie.\" The Black Prince beckoned Meggie over. He was about to put her up with Resa on her horse, but Meggie recoiled.\u003c/p\u003e\n\u003cp\u003e\"No. I’ll ride with Doria,\" she said.\u003c/p\u003e\n\u003cp\u003eDoria brought his horse to her side. Farid gave the other boy a scowl when he lifted up Meggie behind him.\u003c/p\u003e\n\u003cp\u003e\"And why are you still here?\" Meggie snapped at him. \"Still hoping to see Dustfinger suddenly materialize in front of you? He won’t come back, any more than my father will — but I’m sure Orpheus will take you in again, after all you’ve done for him!\"\u003c/p\u003e\n\u003cp\u003eFarid flinched like a beaten dog at every word. Then he turned in silence and went to his donkey. He called for the marten, but Jink didn’t come, and Farid rode away without him.\u003c/p\u003e\n\u003cp\u003eMeggie didn’t watch him go.\u003c/p\u003e\n\u003cp\u003eShe turned to Resa. \"You needn’t think I’m going back with you!\" she said sharply.\u003c/p\u003e\n\u003cp\u003e\"If you need a reader for your precious words, go to Orpheus, like you did before!\"\u003c/p\u003e\n\u003cp\u003eAgain, the Black Prince didn’t ask what Meggie was talking about, although Resa saw the question on his weary face. He stayed at Resa’s side as they rode the long way back. The sun claimed hill after hill for its own, but Resa knew that night would not end for her. It would live in her heart from now on. The same night, forever and ever. Black and white at the same time, like the women who had taken Mo away with them.\u003c/p\u003e\n\u003cp\u003eCHAPTER 25\u003c/p\u003e\n\u003cp\u003eTHE END AND THE BEGINNING\u003c/p\u003e\n\u003cp\u003eThey brought it all back: the memory of pain and fear, of the burning fever and their cold hands on his heart. But this time everything was different. The White Women touched Mo and he did not fear them. They whispered the name that they thought was his, and it sounded like a welcome. Yes, they were welcoming him in their soft voices, heavy with longing, the voices he heard so often in his dreams — as if he were a friend who had been away for a long time but had come back to them at last. \u003c/p\u003e","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-47.html","bookId":2721,"creation":"Oct 5, 2019 4:09:40 PM","modification":"Oct 5, 2019 4:09:40 PM"}
