{"id":78460,"no":66,"title":"Page 66","content":"\u003cp\u003eHeartless glassy little fellow! Fenoglio threw a cork at him, but Rosenquartz was used to such missiles and dodged it. Why had he taken on such a pessimistic glass man? Rosenquartz had his left arm in a sling. After Sootbird’s performance, Fenoglio had persuaded him to go and spy on Orpheus one more time, and Orpheus’s horrible glass man really had pushed the poor creature out of the window. Luckily, Rosenquartz had landed in the gutter, but Fenoglio still didn’t know if the child-catching scene had been Orpheus’s idea. No! He couldn’t possibly have written it!\u003c/p\u003e\n\u003cp\u003eOrpheus could write nothing without the book, and it seemed — for Rosenquartz had discovered this much — that Dustfinger had actually stolen it from him. Anyway, the scene was much too good for that Calf’s-Head to have written, wasn’t it?\u003c/p\u003e\n\u003cp\u003eHe’ll outwit them all.\u003c/p\u003e\n\u003cp\u003eFenoglio went to the window, while the glass man adjusted his sling with a reproachful sigh. Did Mortimer really have a plan? Damn it, how was he to know?\u003c/p\u003e\n\u003cp\u003eMortimer wasn’t really one of his characters, even if he was playing the part of one.\u003c/p\u003e\n\u003cp\u003eWhich is extremely annoying, Fenoglio thought. Because if he had been one of them, presumably I’d know what’s really going on behind those thrice-damned walls.\u003c/p\u003e\n\u003cp\u003eHe stared darkly over the rooftops to the castle. Poor Meggie. And no doubt she’d blame him for everything again. Her mother certainly did. Fenoglio remembered Resa’s pleading look only too well. You must write us back again. You owe us that!\u003c/p\u003e\n\u003cp\u003eYes, perhaps he really should have tried. Suppose they killed Mortimer? Wouldn’t it be better for them all to go back to their world then? What would he want to do here once the Bluejay was dead? Watch the immortal Adder and the Piper tell his story?\u003c/p\u003e\n\u003cp\u003e\"Of course he’s here! Didn’t you hear what she said? Up the stairs. Do you see any other stairs around here? For heaven’s sake, Darius!\"\u003c/p\u003e\n\u003cp\u003eRosenquartz forgot his broken arm and looked at the door.\u003c/p\u003e\n\u003cp\u003eWhat woman’s voice was that?\u003c/p\u003e\n\u003cp\u003eThere was a knock, but before Fenoglio could call, \"Come in,\" the door opened and a rather powerful female form entered his room so impetuously that he instinctively took a step back, knocking his head against the sloping roof. The dress she wore looked as if it had come straight from some cheap theatrical production.\u003c/p\u003e\n\u003cp\u003e\"There we are! This is him, the author!\" she announced, looking him up and down with such contempt that Fenoglio was aware of every hole in his tunic. I’ve seen this woman before, he thought,\u003c/p\u003e\n\u003cp\u003e\"And what’s going on here, may I ask?\" She jabbed her finger into his chest as hard as if to stab him straight to his old heart.\u003c/p\u003e\n\u003cp\u003eAnd he’d seen the thin fellow behind her as well. Of course .\u003c/p\u003e\n\u003cp\u003eWait. .\u003c/p\u003e\n\u003cp\u003e\"Why is the Adderhead’s flag hoisted in Ombra? Who is that frightful fellow with the silver nose? Why were they threatening Mortimer with spears, and since when, for goodness’ sake, has he gone about wearing a sword?\"\u003c/p\u003e\n\u003cp\u003eThe bookworm. Of course! That’s who she was. Elinor Loredan. Meggie had told him about her often enough. Fenoglio had last seen her through bars, stuck in one of the dog pens in the arena where Capricorn’s festivities were held. And the timid man with the owlish look was Capricorn’s stammering reader! Though, with the best will in the world, Fenoglio couldn’t remember his name. What were these two doing here? Were tourist visas for his story being handed out these days?\u003c/p\u003e\n\u003cp\u003e\"I admit I was relieved to see Mortimer alive,\" his uninvited guest went on. (Did she ever stop to get her breath back?) \"And thank goodness he seems to be sound and healthy, although I didn’t like to see him riding into that castle alone at all. But where are Resa and Meggie? And what about Mortola, Basta, and that puffed-up mooncalf Orpheus?\"\u003c/p\u003e\n\u003cp\u003eGood lord, the woman was just as awful as he’d imagined her! Her companion —\u003c/p\u003e\n\u003cp\u003eDarius, yes, that was his name — was staring at Rosenquartz with such a captivated expression that the glass man, flattered, passed a hand over his pale pink hair.\u003c/p\u003e\n\u003cp\u003e\"Quiet!\" thundered Fenoglio. \"Shut up, for heaven’s sake!\"\u003c/p\u003e\n\u003cp\u003eIt had no effect. Not the slightest. \"Something’s happened to them! Admit it! Why was Mortimer alone?\" Once again she jabbed him in the chest. \"I just know something’s happened to Meggie and Resa, something terrible.., a giant has trodden on them, they’ve been impaled on spikes, they —\"Nothing of the kind!\" Fenoglio interrupted. \"They’re with the Black Prince!\"\u003c/p\u003e\n\u003cp\u003e\"The Black Prince?\" Her eyes became almost as large as her bespectacled companion’s. \"Oh!\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and if something terrible happens to anyone here it’s going to be Mortimer.\u003c/p\u003e\n\u003cp\u003eWhich is why. . . ,\" said Fenoglio, grabbing her arm, not very gently, and dragging her to the door,\". . . I want to be left in peace, for heaven’s sake, so that I can think!\"\u003c/p\u003e\n\u003cp\u003eThat really did shut her up. But not for long.\u003c/p\u003e\n\u003cp\u003e\"Something terrible?\" she asked.\u003c/p\u003e\n\u003cp\u003eRosenquartz took his hands away from his ears.\u003c/p\u003e\n\u003cp\u003e\"What do you mean? Who writes what happens here? You do, isn’t that so?\"\u003c/p\u003e\n\u003cp\u003eOh, wonderful! Now her fat fingers were prodding at his sorest point!\u003c/p\u003e\n\u003cp\u003e\"No, definitely not!\" he told her sharply. \"This story is now telling itself, and today Mortimer prevented it from taking a very unpleasant turn! But unfortunately that looks as if it will cost him his neck, in which case I can only advise you to take his wife and daughter and go back with them to where you came from, as fast as possible! Because you’ve obviously found a way, haven’t you?\"\u003c/p\u003e\n\u003cp\u003eWith these words he opened the door, but Signora Loredan simply closed it again.\u003c/p\u003e\n\u003cp\u003e\"Cost him his neck? What do you mean?\" With a jerk, she freed her arm from his grasp. (Heavens above, the woman was as strong as a hippopotamus.)\u003c/p\u003e\n\u003cp\u003e\"I mean that, very regrettably, he’s likely to be hung or beheaded or quartered, or whatever else strikes the Adderhead as the right kind of execution for the man who’s his worst enemy!\"\u003c/p\u003e\n\u003cp\u003e\"His worst enemy? Mortimer?\" She was frowning incredulously — as if Fenoglio were an old fool who didn’t know what he was talking about!\u003c/p\u003e\n\u003cp\u003e\"It was him. He made him into a robber.\"\u003c/p\u003e\n\u003cp\u003eThat was Rosenquartz. The miserable traitor! He was Pointing a glass finger at his master so mercilessly that Fenoglio felt like picking him up from his desk and breaking him in two at the waist.\u003c/p\u003e\n\u003cp\u003e\"It’s the songs,\" murmured Rosenquartz to their two Visitors, as if he’d known them for a lifetime. \"Obsessed by them, that’s what he is, and Meggie’s poor father has been caught up in his fine words like a fly in a spider’s web!\"\u003c/p\u003e\n\u003cp\u003eThis was too much. Fenoglio marched toward Rosenquartz, but the bookworm woman barred his way.\u003c/p\u003e\n\u003cp\u003e\"Don’t you dare do anything to that poor defenseless glass man!\" She was glowering at him like a bulldog. Good God, what a fearsome female! \"Mortimer, a robber? He’s the most peace-loving person I know.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, really?\" Fenoglio’s voice rose to such a pitch that Rosenquartz put his hands over his ridiculously tiny ears again. \"Well, perhaps even the most peace-loving person gets to feel less so when he’s been shot and nearly killed, parted from his wife, and locked in a dungeon for weeks on end. And none of that was my work, whatever this lying glass man may say! Far from it. But for the words I wrote, I imagine Mortimer would be dead by now. \u003c/p\u003e","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-66.html","bookId":2721,"creation":"Oct 5, 2019 4:09:40 PM","modification":"Oct 5, 2019 4:09:40 PM"}
