{"id":34969,"no":23,"title":"Chapter 22 Fire And Ice","content":"\u003cp\u003eTHEWIND SHOOK THE TENT AGAIN, AND I SHOOK WITH IT.\u003c/p\u003e \n\u003cp\u003e　　The temperature was dropping. I could feel it through the down bag, through my jacket. I was fullydressed, my hiking boots still laced into place. It didn’t make any difference. How could it be so cold? Howcould it keep getting colder? It had to bottom out sometime, didn’t it?\u003c/p\u003e \n\u003cp\u003e　　“W-w-w-w-w-what t-t-t-t-time is it?” I forced the words through my rattling teeth.\u003c/p\u003e \n\u003cp\u003e　　“Two,” Edward answered.\u003c/p\u003e \n\u003cp\u003e　　Edward sat as far from me as possible in the cramped space, afraid to even breathe on me when I wasalready so cold. It was too dark to see his face, but his voice was wild with worry, indecision, and frustration.\u003c/p\u003e \n\u003cp\u003e　　“Maybe . . .”\u003c/p\u003e \n\u003cp\u003e　　“No, I’m f-f-f-f-f-fine, r-r-r-really. I don’t w-w-w-want to g-go outside.”\u003c/p\u003e \n\u003cp\u003e　　He’d tried to talk me into making a run for it a dozen times already, but I was terrified of leaving myshelter. If it was this cold in here, protected from the raging wind, I could imagine how bad it would be if wewere running through it.\u003c/p\u003e \n\u003cp\u003e　　And it would waste all our efforts this afternoon. Would we have enough time to reset ourselves when thestorm was over? What if it didn’t end? It made no sense to move now. I could shiver my way through onenight.\u003c/p\u003e \n\u003cp\u003e　　I was worried that the trail I had laid would be lost, but he promised that it would still be plain to thecoming monsters.\u003c/p\u003e \n\u003cp\u003e　　“What can I do?” he almost begged.\u003c/p\u003e \n\u003cp\u003e　　I just shook my head.\u003c/p\u003e \n\u003cp\u003e　　Out in the snow, Jacob whined unhappily.\u003c/p\u003e \n\u003cp\u003e　　“G-g-g-get out of h-h-h-ere,” I ordered, again.\u003c/p\u003e \n\u003cp\u003e　　“He’s just worried about you,” Edward translated. “He’s fine. His body is equipped to deal with this.”\u003c/p\u003e \n\u003cp\u003e　　“H-h-h-h-h-h.” I wanted to say that he should still leave, but I couldn’t get it past my teeth. I nearly bit mytongue off trying. At least Jacob did seem to be well equipped for the snow, better even than the others in hispack with his thicker, longer, shaggy russet fur. I wondered why that was.\u003c/p\u003e \n\u003cp\u003e　　Jacob whimpered, a high-pitched, grating sound of complaint.\u003c/p\u003e \n\u003cp\u003e　　“What do you want me to do?” Edward growled, too anxious to bother with politeness anymore. “Carryher through that? I don’t see you making yourself useful. Why don’t you go fetch a space heater orsomething?”\u003c/p\u003e \n\u003cp\u003e　　“I’m ok-k-k-k-k-k-kay,” I protested. Judging from Edward’s groan and the muted growl outside the tent,I hadn’t convinced anyone. The wind rocked the tent roughly, and I shuddered in harmony with it.\u003c/p\u003e \n\u003cp\u003e　　A sudden howl ripped through the roar of the wind, and I covered my ears against the noise. Edwardscowled.\u003c/p\u003e \n\u003cp\u003e　　“That was hardly necessary,” he muttered. “And that’s the worst idea I’ve ever heard,” he called moreloudly.\u003c/p\u003e \n\u003cp\u003e　　“Better than anything you’ve come up with,” Jacob answered, his human voice startling me. “Go fetch aspace heater,” he grumbled. “I’m not a St. Bernard.”\u003c/p\u003e \n\u003cp\u003e　　I heard the sound of the zipper around the tent door pulling swiftly down.\u003c/p\u003e \n\u003cp\u003e　　Jacob slid through the smallest opening he could manage, while the arctic air flowed in around him, a fewflecks of snow falling to the floor of the tent. I shivered so hard it was a convulsion.\u003c/p\u003e \n\u003cp\u003e　　“I don’t like this,” Edward hissed as Jake zipped the tent door shut. “Just give her the coat and get out.”\u003c/p\u003e \n\u003cp\u003e　　My eyes were adjusted enough to see shapes — Jacob was carrying the parka that had been hanging on atree next to the tent.\u003c/p\u003e \n\u003cp\u003e　　I tried to ask what they were talking about, but all that came out of my mouth was, “W-w-w-w-w-w,” asthe shivering made me stutter uncontrollably.\u003c/p\u003e \n\u003cp\u003e　　“The parka’s for tomorrow — she’s too cold to warm it up by herself. It’s frozen.” He dropped it by the door. “You said she needed a space heater, and here I am.” Jacob held his arms as wide as the tent allowed.\u003c/p\u003e \n\u003cp\u003e　　As usual, when he’d been running around as a wolf, he’d only thrown on the bare essentials — just a pair ofsweats, no shirt, no shoes.\u003c/p\u003e \n\u003cp\u003e　　“J-J-J-J-Jake, you’ll f-f-f-freez-z-z-ze,” I tried to complain.\u003c/p\u003e \n\u003cp\u003e　　“Not me,” he said cheerfully. “I run at a toasty one-oh-eight point nine these days. I’ll have you sweatingin no time.”\u003c/p\u003e \n\u003cp\u003e　　Edward snarled, but Jacob didn’t even look at him. Instead, he crawled to my side and started unzippingmy sleeping bag.\u003c/p\u003e \n\u003cp\u003e　　Edward’s hand was suddenly hard on his shoulder, restraining, snow white against the dark skin. Jacob’sjaw clenched, his nostrils flaring, his body recoiling from the cold touch. The long muscles in his arms flexedautomatically.\u003c/p\u003e \n\u003cp\u003e　　“Get your hand off of me,” he growled through his teeth.\u003c/p\u003e \n\u003cp\u003e　　“Keep your hands off of her,” Edward answered blackly.\u003c/p\u003e \n\u003cp\u003e　　“D-d-d-don’t f-f-f-f-fight,” I pleaded. Another tremor rocked through me. It felt like my teeth were goingto shatter, they were slamming together so hard.\u003c/p\u003e \n\u003cp\u003e　　“I’m sure she’ll thank you for this when her toes turn black and drop off,” Jacob snapped.\u003c/p\u003e \n\u003cp\u003e　　Edward hesitated, then his hand fell away and he slid back to his position in the corner.\u003c/p\u003e \n\u003cp\u003e　　His voice was flat and frightening. “Watch yourself.”\u003c/p\u003e \n\u003cp\u003e　　Jacob chuckled.\u003c/p\u003e \n\u003cp\u003e　　“Scoot over, Bella,” he said, zipping the sleeping bag open farther.\u003c/p\u003e \n\u003cp\u003e　　I stared at him in outrage. No wonder Edward was reacting this way.\u003c/p\u003e \n\u003cp\u003e　　“N-n-n-n-n,” I tried to protest.\u003c/p\u003e \n\u003cp\u003e　　“Don’t be stupid,” he said, exasperated. “Don’t you like having ten toes?”\u003c/p\u003e \n\u003cp\u003e　　He crammed his body into the nonexistent space, forcing the zipper up behind himself.\u003c/p\u003e \n\u003cp\u003e　　And then I couldn’t object — I didn’t want to anymore. He was so warm. His arms constricted aroundme, holding me snugly against his bare chest. The heat was irresistible, like air after being underwater for toolong. He cringed when I pressed my icy fingers eagerly against his skin.\u003c/p\u003e \n\u003cp\u003e　　“Jeez, you’re freezing, Bella,” he complained.\u003c/p\u003e \n\u003cp\u003e　　“S-s-s-s-sorry,” I stuttered.\u003c/p\u003e \n\u003cp\u003e　　“Try to relax,” he suggested as another shiver rippled through me violently. “You’ll be warm in a minute.\u003c/p\u003e \n\u003cp\u003e　　Of course, you’d warm up faster if you took your clothes off.”\u003c/p\u003e \n\u003cp\u003e　　Edward growled sharply.\u003c/p\u003e \n\u003cp\u003e　　“That’s just a simple fact,” Jacob defended himself. “Survival one-oh-one.”\u003c/p\u003e \n\u003cp\u003e　　“C-c-cut it out, Jake,” I said angrily, though my body refused to even try to pull away from him. “N-n-n-nobody really n-n-n-n-needs all ten t-t-t-toes.”\u003c/p\u003e \n\u003cp\u003e　　“Don’t worry about the bloodsucker,” Jacob suggested, and his tone was smug. “He’s just jealous.”\u003c/p\u003e \n\u003cp\u003e　　“Of course I am.” Edward’s voice was velvet again, under control, a musical murmur in the darkness.\u003c/p\u003e \n\u003cp\u003e　　“You don’t have the faintest idea how much I wish I could do what you’re doing for her, mongrel.”\u003c/p\u003e \n\u003cp\u003e　　“Those are the breaks,” Jacob said lightly, but then his tone soured. “At least you know she wishes it wasyou.”\u003c/p\u003e \n\u003cp\u003e　　“True,” Edward agreed.\u003c/p\u003e \n\u003cp\u003e　　The shuddering slowed, became bearable while they wrangled.\u003c/p\u003e \n\u003cp\u003e　　“There,” Jacob said, pleased. “Feeling better?”\u003c/p\u003e \n\u003cp\u003e　　I was finally able to speak clearly. “Yes.”\u003c/p\u003e \n\u003cp\u003e　　“Your lips are still blue,” he mused. “Want me to warm those up for you, too? You only have to ask.”\u003c/p\u003e \n\u003cp\u003e　　Edward sighed heavily.\u003c/p\u003e \n\u003cp\u003e　　“Behave yourself,” I muttered, pressing my face against his shoulder. He flinched again when my cold skintouched his, and I smiled with slightly vindictive satisfaction.\u003c/p\u003e \n\u003cp\u003e　　It was already warm and snug inside the sleeping bag. Jacob’s body heat seemed to radiate from everyside — maybe because there was so much of him. I kicked my boots off, and pushed my toes against hislegs. He jumped slightly, and then leaned his head down to press his hot cheek against my numb ear.\u003c/p\u003e \n\u003cp\u003e　　I noticed that Jacob’s skin had a woodsy, musky scent — it fit the setting, here in the middle of the forest.\u003c/p\u003e \n\u003cp\u003e　　 It was nice. I wondered if the Cullens and the Quileutes weren’t just playing up that whole odor issue becauseof their prejudices. Everyone smelled fine to me.\u003c/p\u003e \n\u003cp\u003e　　The storm howled like an animal attacking the tent, but it didn’t worry me now. Jacob was out of the cold,and so was I. Plus, I was simply too exhausted to worry about anything — tired from just staying awake solate, and aching from the muscle spasms. My body relaxed slowly as I thawed, piece by frozen piece, andthen turned limp.\u003c/p\u003e \n\u003cp\u003e　　“Jake?” I mumbled sleepily. “Can I ask you something? I’m not trying to be a jerk or anything, I’mhonestly curious.” They were the same words he’d used in my kitchen . . . how long ago was it now?\u003c/p\u003e \n\u003cp\u003e　　“Sure,” he chuckled, remembering.\u003c/p\u003e \n\u003cp\u003e　　“Why are you so much furrier than your friends? You don’t have to answer if I’m being rude.” I didn’tknow the rules for etiquette as they applied to werewolf culture.\u003c/p\u003e \n\u003cp\u003e　　“Because my hair is longer,” he said, amused — my question hadn’t offended him, at least. He shook hishead so that his unkempt hair — grown out to his chin now — tickled my cheek.\u003c/p\u003e \n\u003cp\u003e　　“Oh.” I was surprised, but it made sense. So that was why they’d all cropped their hair in the beginning,when they joined the pack. “Then why don’t you cut it? Do you like to be shaggy?”\u003c/p\u003e \n\u003cp\u003e　　He didn’t answer right away this time, and Edward laughed under his breath.\u003c/p\u003e \n\u003cp\u003e　　“Sorry,” I said, pausing to yawn. “I didn’t mean to pry. You don’t have to tell me.”\u003c/p\u003e \n\u003cp\u003e　　Jacob made an annoyed sound. “Oh, he’ll tell you anyway, so I might as well. . . . I was growing my hairout because . . . it seemed like you liked it better long.”\u003c/p\u003e \n\u003cp\u003e　　“Oh.” I felt awkward. “I, er, like it both ways, Jake. You don’t need to be . . . inconvenienced.”\u003c/p\u003e \n\u003cp\u003e　　He shrugged. “Turns out it was very convenient tonight, so don’t worry about it.”\u003c/p\u003e \n\u003cp\u003e　　I didn’t have anything else to say. As the silence lengthened, my eyelids drooped and shut, and mybreathing grew slower, more even.\u003c/p\u003e \n\u003cp\u003e　　“That’s right, honey, go to sleep,” Jacob whispered.\u003c/p\u003e \n\u003cp\u003e　　I sighed, content, already half-unconscious.\u003c/p\u003e \n\u003cp\u003e　　“Seth is here,” Edward muttered to Jacob, and I suddenly understood the point of the howling.\u003c/p\u003e \n\u003cp\u003e　　“Perfect. Now you can keep an eye on everything else, while I take care of your girlfriend for you.”\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t answer, but I groaned groggily. “Stop it,” I muttered.\u003c/p\u003e \n\u003cp\u003e　　It was quiet then, inside at least. Outside, the wind shrieked insanely through the trees. The shimmying ofthe tent made it hard to sleep. The poles would suddenly jerk and quiver, pulling me back from the edge ofunconsciousness each time I was close to slipping under. I felt so bad for the wolf, the boy that was stuckoutside in the snow.\u003c/p\u003e \n\u003cp\u003e　　My mind wandered as I waited for sleep to find me. This warm little space made me think of the earlydays with Jacob, and I remembered how it used to be when he was my replacement sun, the warmth thatmade my empty life livable. It had been a while since I’d thought of Jake that way, but here he was, warmingme again.\u003c/p\u003e \n\u003cp\u003e　　“Please!” Edward hissed. “Do you mind!”\u003c/p\u003e \n\u003cp\u003e　　“What?” Jacob whispered back, his tone surprised.\u003c/p\u003e \n\u003cp\u003e　　“Do you think you could attempt to control your thoughts?” Edward’s low whisper was furious.\u003c/p\u003e \n\u003cp\u003e　　“No one said you had to listen,” Jacob muttered, defiant, yet still embarrassed. “Get out of my head.”\u003c/p\u003e \n\u003cp\u003e　　“I wish I could. You have no idea how loud your little fantasies are. It’s like you’re shouting them at me.”\u003c/p\u003e \n\u003cp\u003e　　“I’ll try to keep it down,” Jacob whispered sarcastically.\u003c/p\u003e \n\u003cp\u003e　　There was a brief moment of silence.\u003c/p\u003e \n\u003cp\u003e　　“Yes,” Edward answered an unspoken thought in a murmur so low I barely made it out. “I’m jealous ofthat, too.”\u003c/p\u003e \n\u003cp\u003e　　“I figured it was like that,” Jacob whispered smugly. “Sort of evens the playing field up a little, doesn’t it?”\u003c/p\u003e \n\u003cp\u003e　　Edward chuckled. “In your dreams.”\u003c/p\u003e \n\u003cp\u003e　　“You know, she could still change her mind,” Jacob taunted him. “Considering all the things I could dowith her that you can’t. At least, not without killing her, that is.”\u003c/p\u003e \n\u003cp\u003e　　“Go to sleep, Jacob,” Edward murmured. “You’re starting to get on my nerves.”\u003c/p\u003e \n\u003cp\u003e　　“I think I will. I’m really very comfortable.”\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t answer.\u003c/p\u003e \n\u003cp\u003e　　 I was too far gone to ask them to stop talking about me like I wasn’t there. The conversation had taken ona dreamlike quality to me, and I wasn’t sure I was really awake.\u003c/p\u003e \n\u003cp\u003e　　“Maybe I would,” Edward said after a moment, answering a question I hadn’t heard.\u003c/p\u003e \n\u003cp\u003e　　“But would you be honest?”\u003c/p\u003e \n\u003cp\u003e　　“You can always ask and see.” Edward’s tone made me wonder if I was missing out on a joke.\u003c/p\u003e \n\u003cp\u003e　　“Well, you see inside my head — let me see inside yours tonight, it’s only fair,” Jacob said.\u003c/p\u003e \n\u003cp\u003e　　“Your head is full of questions. Which one do you want me to answer?”\u003c/p\u003e \n\u003cp\u003e　　“The jealousy . . . it has to be eating at you. You can’t be as sure of yourself as you seem. Unless youhave no emotions at all.”\u003c/p\u003e \n\u003cp\u003e　　“Of course it is,” Edward agreed, no longer amused. “Right now it’s so bad that I can barely control myvoice. Of course, it’s even worse when she’s away from me, with you, and I can’t see her.”\u003c/p\u003e \n\u003cp\u003e　　“Do you think about it all the time?” Jacob whispered. “Does it make it hard to concentrate when she’snot with you?”\u003c/p\u003e \n\u003cp\u003e　　“Yes and no,” Edward said; he seemed determined to answer honestly. “My mind doesn’t work quite thesame as yours. I can think of many more things at one time. Of course, that means that I’m always able tothink of you, always able to wonder if that’s where her mind is, when she’s quiet and thoughtful.”\u003c/p\u003e \n\u003cp\u003e　　They were both still for a minute.\u003c/p\u003e \n\u003cp\u003e　　“Yes, I would guess that she thinks about you often,” Edward murmured in response to Jacob’s thoughts.\u003c/p\u003e \n\u003cp\u003e　　“More often than I like. She worries that you’re unhappy. Not that you don’t know that. Not that you don’tuse that.”\u003c/p\u003e \n\u003cp\u003e　　“I have to use whatever I can,” Jacob muttered. “I’m not working with your advantages — advantageslike her knowing she’s in love with you.”\u003c/p\u003e \n\u003cp\u003e　　“That helps,” Edward agreed in a mild tone.\u003c/p\u003e \n\u003cp\u003e　　Jacob was defiant. “She’s in love with me, too, you know.”\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t answer.\u003c/p\u003e \n\u003cp\u003e　　Jacob sighed. “But she doesn’t know it.”\u003c/p\u003e \n\u003cp\u003e　　“I can’t tell you if you’re right.”\u003c/p\u003e \n\u003cp\u003e　　“Does that bother you? Do you wish you could see what she’s thinking, too?”\u003c/p\u003e \n\u003cp\u003e　　“Yes . . . and no, again. She likes it better this way, and, though it sometimes drives me insane, I’d rathershe was happy.”\u003c/p\u003e \n\u003cp\u003e　　The wind ripped around the tent, shaking it like an earthquake. Jacob’s arms tightened around meprotectively.\u003c/p\u003e \n\u003cp\u003e　　“Thank you,” Edward whispered. “Odd as this might sound, I suppose I’m glad you’re here, Jacob.”\u003c/p\u003e \n\u003cp\u003e　　“You mean, ‘as much as I’d love to kill you, I’m glad she’s warm,’ right?”\u003c/p\u003e \n\u003cp\u003e　　“It’s an uncomfortable truce, isn’t it?”\u003c/p\u003e \n\u003cp\u003e　　Jacob’s whisper was suddenly smug. “I knew you were just as crazy jealous as I am.”\u003c/p\u003e \n\u003cp\u003e　　“I’m not such a fool as to wear it on my sleeve like you do. It doesn’t help your case, you know.”\u003c/p\u003e \n\u003cp\u003e　　“You have more patience than I do.”\u003c/p\u003e \n\u003cp\u003e　　“I should. I’ve had a hundred years to gain it. A hundred years of waiting for her.”\u003c/p\u003e \n\u003cp\u003e　　“So . . . at what point did you decide to play the very patient good guy?”\u003c/p\u003e \n\u003cp\u003e　　“When I saw how much it was hurting her to make her choose. It’s not usually this difficult to control. Ican smother the . . . less civilized feelings I may have for you fairly easily most of the time. Sometimes I thinkshe sees through me, but I can’t be sure.”\u003c/p\u003e \n\u003cp\u003e　　“I think you were just worried that if you really forced her to choose, she might not choose you.”\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t answer right away. “That was a part of it,” he finally admitted. “But only a small part. Weall have our moments of doubt. Mostly I was worried that she’d hurt herself trying to sneak away to see you.\u003c/p\u003e \n\u003cp\u003e　　After I’d accepted that she was more or less safe with you — as safe as Bella ever is — it seemed best tostop driving her to extremes.”\u003c/p\u003e \n\u003cp\u003e　　Jacob sighed. “I’d tell her all of this, but she’d never believe me.”\u003c/p\u003e \n\u003cp\u003e　　“I know.” It sounded like Edward was smiling.\u003c/p\u003e \n\u003cp\u003e　　“You think you know everything,” Jacob muttered.\u003c/p\u003e \n\u003cp\u003e　　“I don’t know the future,” Edward said, his voice suddenly unsure.\u003c/p\u003e \n\u003cp\u003e　　 There was a long pause.\u003c/p\u003e \n\u003cp\u003e　　“What would you do if she changed her mind?” Jacob asked.\u003c/p\u003e \n\u003cp\u003e　　“I don’t know that either.”\u003c/p\u003e \n\u003cp\u003e　　Jacob chuckled quietly. “Would you try to kill me?” Sarcastic again, as if doubting Edward’s ability to doit.\u003c/p\u003e \n\u003cp\u003e　　“No.”\u003c/p\u003e \n\u003cp\u003e　　“Why not?” Jacob’s tone was still jeering.\u003c/p\u003e \n\u003cp\u003e　　“Do you really think I would hurt her that way?”\u003c/p\u003e \n\u003cp\u003e　　Jacob hesitated for a second, and then sighed. “Yeah, you’re right. I know that’s right. But sometimes . .\u003c/p\u003e \n\u003cp\u003e　　.”\u003c/p\u003e \n\u003cp\u003e　　“Sometimes it’s an intriguing idea.”\u003c/p\u003e \n\u003cp\u003e　　Jacob pressed his face into the sleeping bag to muffle his laugher. “Exactly,” he eventually agreed.\u003c/p\u003e \n\u003cp\u003e　　What a strange dream this was. I wondered if it was the relentless wind that made me imagine all thewhispering. Only the wind was screaming rather than whispering . . .\u003c/p\u003e \n\u003cp\u003e　　“What is it like? Losing her?” Jacob asked after a quiet moment, and there was no hint of humor in hissuddenly hoarse voice. “When you thought that you’d lost her forever? How did you . . . cope?”\u003c/p\u003e \n\u003cp\u003e　　“That’s very difficult for me to talk about.”\u003c/p\u003e \n\u003cp\u003e　　Jacob waited.\u003c/p\u003e \n\u003cp\u003e　　“There were two different times that I thought that.” Edward spoke each word just a little slower thannormal. “The first time, when I thought I could leave her . . . that was . . . almost bearable. Because I thoughtshe would forget me and it would be like I hadn’t touched her life. For over six months I was able to stayaway, to keep my promise that I wouldn’t interfere again. It was getting close — I was fighting but I knew Iwasn’t going to win; I would have come back . . . just to check on her. That’s what I would have told myself,anyway. And if I’d found her reasonably happy . . . I like to think that I could have gone away again.\u003c/p\u003e \n\u003cp\u003e　　“But she wasn’t happy. And I would have stayed. That’s how she convinced me to stay with hertomorrow, of course. You were wondering about that before, what could possibly motivate me . . . what shewas feeling so needlessly guilty about. She reminded me of what it did to her when I left — what it still does toher when I leave. She feels horrible about bringing that up, but she’s right. I’ll never be able to make up forthat, but I’ll never stop trying anyway.”\u003c/p\u003e \n\u003cp\u003e　　Jacob didn’t respond for a moment, listening to the storm or digesting what he’d heard, I didn’t knowwhich.\u003c/p\u003e \n\u003cp\u003e　　“And the other time — when you thought she was dead?” Jacob whispered roughly.\u003c/p\u003e \n\u003cp\u003e　　“Yes.” Edward answered a different question. “It will probably feel like that to you, won’t it? The way youperceive us, you might not be able to see her as Bella anymore. But that’s who she’ll be.”\u003c/p\u003e \n\u003cp\u003e　　“That’s not what I asked.”\u003c/p\u003e \n\u003cp\u003e　　Edward’s voice came back fast and hard. “I can’t tell you how it felt. There aren’t words.”\u003c/p\u003e \n\u003cp\u003e　　Jacob’s arms flexed around me.\u003c/p\u003e \n\u003cp\u003e　　“But you left because you didn’t want to make her a bloodsucker. You want her to be human.”\u003c/p\u003e \n\u003cp\u003e　　Edward spoke slowly. “Jacob, from the second that I realized that I loved her, I knew there were onlyfour possibilities. The first alternative, the best one for Bella, would be if she didn’t feel as strongly for me — ifshe got over me and moved on. I would accept that, though it would never change the way I felt. You think ofme as a . . . living stone — hard and cold. That’s true. We are set the way we are, and it is very rare for us toexperience a real change. When that happens, as when Bella entered my life, it is a permanent change. There’sno going back. . . .\u003c/p\u003e \n\u003cp\u003e　　“The second alternative, the one I’d originally chosen, was to stay with her throughout her human life. Itwasn’t a good option for her, to waste her life with someone who couldn’t be human with her, but it was thealternative I could most easily face. Knowing all along that, when she died, I would find a way to die, too.\u003c/p\u003e \n\u003cp\u003e　　Sixty years, seventy years — it would seem like a very, very short time to me. . . . But then it proved muchtoo dangerous for her to live in such close proximity with my world. It seemed like everything that could gowrong did. Or hung over us . . . waiting to go wrong. I was terrified that I wouldn’t get those sixty years if Istayed near her while she was human.\u003c/p\u003e \n\u003cp\u003e　　“So I chose option three. Which turned out to be the worst mistake of my very long life, as you know. I chose to take myself out of her world, hoping to force her into the first alternative. It didn’t work, and it verynearly killed us both.\u003c/p\u003e \n\u003cp\u003e　　“What do I have left but the fourth option? It’s what she wants — at least, she thinks she does. I’ve beentrying to delay her, to give her time to find a reason to change her mind, but she’s very . . . stubborn. Youknow that. I’ll be lucky to stretch this out a few more months. She has a horror of getting older, and herbirthday is in September. . . .”\u003c/p\u003e \n\u003cp\u003e　　“I like option one,” Jacob muttered.\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t respond.\u003c/p\u003e \n\u003cp\u003e　　“You know exactly how much I hate to accept this,” Jacob whispered slowly, “but I can see that you dolove her . . . in your way. I can’t argue with that anymore.\u003c/p\u003e \n\u003cp\u003e　　“Given that, I don’t think you should give up on the first alternative, not yet. I think there’s a very goodchance that she would be okay. After time. You know, if she hadn’t jumped off a cliff in March . . . and ifyou’d waited another six months to check on her. . . . Well, you might have found her reasonably happy. I hada game plan.”\u003c/p\u003e \n\u003cp\u003e　　Edward chuckled. “Maybe it would have worked. It was a well thought-out plan.”\u003c/p\u003e \n\u003cp\u003e　　“Yeah.” Jake sighed. “But . . . ,” suddenly he was whispering so fast the words got tangled, “give me ayear, bl — Edward. I really think I could make her happy. She’s stubborn, no one knows that better than Ido, but she’s capable of healing. She would have healed before. And she could be human, with Charlie andRenée, and she could grow up, and have kids and . . . be Bella.\u003c/p\u003e \n\u003cp\u003e　　“You love her enough that you have to see the advantages of that plan. She thinks you’re very unselfish . .\u003c/p\u003e \n\u003cp\u003e　　. are you really? Can you consider the idea that I might be better for her than you are?”\u003c/p\u003e \n\u003cp\u003e　　“I have considered it,” Edward answered quietly. “In some ways, you would be better suited for her thananother human. Bella takes some looking after, and you’re strong enough that you could protect her fromherself, and from everything that conspires against her. You have done that already, and I’ll owe you for thatfor as long as I live — forever — whichever comes first. . . .\u003c/p\u003e \n\u003cp\u003e　　“I even asked Alice if she could see that — see if Bella would be better off with you. She couldn’t, ofcourse. She can’t see you, and then Bella’s sure of her course, for now.\u003c/p\u003e \n\u003cp\u003e　　“But I’m not stupid enough to make the same mistake I made before, Jacob. I won’t try to force her intothat first option again. As long as she wants me, I’m here.”\u003c/p\u003e \n\u003cp\u003e　　“And if she were to decide that she wanted me?” Jacob challenged. “Okay, it’s a long shot, I’ll give youthat.”\u003c/p\u003e \n\u003cp\u003e　　“I would let her go.”\u003c/p\u003e \n\u003cp\u003e　　“Just like that?”\u003c/p\u003e \n\u003cp\u003e　　“In the sense that I’d never show her how hard it was for me, yes. But I would keep watch. You see,Jacob, you might leave her someday. Like Sam and Emily, you wouldn’t have a choice. I would always bewaiting in the wings, hoping for that to happen.”\u003c/p\u003e \n\u003cp\u003e　　Jacob snorted quietly. “Well, you’ve been much more honest than I had any right to expect . . . Edward.\u003c/p\u003e \n\u003cp\u003e　　Thanks for letting me in your head.”\u003c/p\u003e \n\u003cp\u003e　　“As I said, I’m feeling oddly grateful for your presence in her life tonight. It was the least I could do. . . .\u003c/p\u003e \n\u003cp\u003e　　You know, Jacob, if it weren’t for the fact that we’re natural enemies and that you’re also trying to steal awaythe reason for my existence, I might actually like you.”\u003c/p\u003e \n\u003cp\u003e　　“Maybe . . . if you weren’t a disgusting vampire who was planning to suck out the life of the girl I love . . .\u003c/p\u003e \n\u003cp\u003e　　well, no, not even then.”\u003c/p\u003e \n\u003cp\u003e　　Edward chuckled.\u003c/p\u003e \n\u003cp\u003e　　“Can I ask you something?” Edward said after a moment.\u003c/p\u003e \n\u003cp\u003e　　“Why would you have to ask?”\u003c/p\u003e \n\u003cp\u003e　　“I can only hear if you think of it. It’s just a story that Bella seemed reluctant to tell me about the otherday. Something about a third wife . . . ?”\u003c/p\u003e \n\u003cp\u003e　　“What about it?”\u003c/p\u003e \n\u003cp\u003e　　Edward didn’t answer, listening to the story in Jacob’s head. I heard his low hiss in the darkness.\u003c/p\u003e \n\u003cp\u003e　　“What?” Jacob demanded again.\u003c/p\u003e \n\u003cp\u003e　　“Of course,” Edward seethed. “Of course! I rather wish your elders had kept that story to themselves, Jacob.”\u003c/p\u003e \n\u003cp\u003e　　“You don’t like the leeches being painted as the bad guys?” Jacob mocked. “You know, they are. Thenand now.”\u003c/p\u003e \n\u003cp\u003e　　“I really couldn’t care less about that part. Can’t you guess which character Bella would identify with?”\u003c/p\u003e \n\u003cp\u003e　　It took Jacob a minute. “Oh. Ugh. The third wife. Okay, I see your point.”\u003c/p\u003e \n\u003cp\u003e　　“She wants to be there in the clearing. To do what little she can, as she puts it.” He sighed. “That was thesecondary reason for my staying with her tomorrow. She’s quite inventive when she wants something.”\u003c/p\u003e \n\u003cp\u003e　　“You know, your military brother gave her the idea just as much as the story did.”\u003c/p\u003e \n\u003cp\u003e　　“Neither side meant any harm,” Edward whispered, peace-making now.\u003c/p\u003e \n\u003cp\u003e　　“And when does this little truce end?” Jacob asked. “First light? Or do we wait until after the fight?”\u003c/p\u003e \n\u003cp\u003e　　There was a pause as they both considered.\u003c/p\u003e \n\u003cp\u003e　　“First light,” they whispered together, and then laughed quietly.\u003c/p\u003e \n\u003cp\u003e　　“Sleep well, Jacob,” Edward murmured. “Enjoy the moment.”\u003c/p\u003e \n\u003cp\u003e　　It was quiet again, and the tent held still for a few minutes. The wind seemed to have decided that it wasn’tgoing to flatten us after all, and was giving up the fight.\u003c/p\u003e \n\u003cp\u003e　　Edward groaned softly. “I didn’t mean that quite so literally.”\u003c/p\u003e \n\u003cp\u003e　　“Sorry,” Jacob whispered. “You could leave, you know — give us a little privacy.”\u003c/p\u003e \n\u003cp\u003e　　“Would you like me to help you sleep, Jacob?” Edward offered.\u003c/p\u003e \n\u003cp\u003e　　“You could try,” Jacob said, unconcerned. “It would be interesting to see who walked away, wouldn’t it?”\u003c/p\u003e \n\u003cp\u003e　　“Don’t tempt me too far, wolf. My patience isn’t that perfect.”\u003c/p\u003e \n\u003cp\u003e　　Jacob whispered a laugh. “I’d rather not move just now, if you don’t mind.”\u003c/p\u003e \n\u003cp\u003e　　Edward started humming to himself, louder than usual — trying to drown out Jacob’s thoughts, I assumed.\u003c/p\u003e \n\u003cp\u003e　　But it was my lullaby he hummed, and, despite my growing discomfort with this whispered dream, I sankdeeper into unconsciousness . . . into other dreams that made better sense. . . .\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/148/5965.html","bookId":330,"creation":"Aug 5, 2019 6:02:50 AM","modification":"Aug 5, 2019 6:02:50 AM"}
