{"id":103244,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Not a goddamned thing,” he told her. “I don’t want anything that ship’s carrying. I want the ship itself, because it’s mine.”\u003c/p\u003e\n\u003cp\u003e“Yours?”\u003c/p\u003e\n\u003cp\u003eThe motion of the Valkyrie’s new course made the floor under their feet swing slightly, and they both swayed as they spoke. “Yes,” he said. “It’s mine. I stole it fair and square, years ago, and I want it back.”\u003c/p\u003e\n\u003cp\u003eShe looked frankly puzzled, and she admitted as much. “I’m not sure I understand. It’s only a ship, and as I understand it, it’s not half as nice as this one. You’ve got this one now; why not turn around, call off the chase, and call it a day?”\u003c/p\u003e\n\u003cp\u003eHe nearly bellowed. “Because I don’t want this one!” He kept the volume up when he continued, “And now, since we’re both feeling so chatty—why did Pinkerton send you after us? Who paid them to do it, and why?”\u003c/p\u003e\n\u003cp\u003e“The Union Army,” she said. “And now you likely know more about the situation than I do. I’ll admit, I got a bit sidetracked from my initial task. Look, I had no idea you had any interest in this ship whatsoever until I heard your men aboard it. As far as I knew, it was transporting some kind of supplies to a sanatorium in Louisville, though the sanatorium is actually a front for a weapons laboratory.”\u003c/p\u003e\n\u003cp\u003eWith a puzzled expression that mirrored Maria’s, Hainey said, “Then there’s been a mix-up in your telegrams. Because it’s my former ship that’s making the weapons run, not this shiny black bird. The Valkyrie was on her way to New York City—she’s going to be fitted with a new ball turret.” He quickly clarified, “They were going to stick one on top, up front I suppose. Though now, if it ever makes it that far north and east I guess they’ll have to fix the bottom left one first.”\u003c/p\u003e\n\u003cp\u003eFollowing another moment of mutual uncertainty, their faces both went crafty.\u003c/p\u003e\n\u003cp\u003eHainey said, “You fellows keep her flying straight, and when you think she’s safely over nothing at all, pull us to a stop and hover. Me and Maria Boyd here are going to dig around in the cargo hold and see what we can find.”\u003c/p\u003e\n\u003cp\u003eSimeon and Lamar shrugged at each other, and Simeon’s eyebrow pointed a vigorous indication of confusion.\u003c/p\u003e\n\u003cp\u003eBut the runaway slave and the ex-spy retreated to the cargo hold, where the wind from the busted ball turret nearby was loud and the air was even colder than the un-warmed bridge. Hainey rummaged around in the storage locker and turned up a pair of prybars, one of which he tossed to Maria.\u003c/p\u003e\n\u003cp\u003eHe said to her, “I swear on my mother’s life, I don’t know what’s in any damn one of these boxes. So be careful with the bar. God knows what we’ll turn up.”\u003c/p\u003e\n\u003cp\u003e“The need for caution is duly noted,” she said, and then she said, “I’ll start at this end. You start at that end. We’ll work our way toward the middle.”\u003c/p\u003e\n\u003cp\u003eHe grunted a general agreement and began at the far corner. The captain brought his prybar down into the cracks of the nearest crate’s lid, and Maria did likewise on her end of the hold.\u003c/p\u003e\n\u003cp\u003eOne after another, they bashed and pried their way through the stacks, and when they were finished they’d unveiled a vast assortment of wonders. Their haul included four loads of boot polish, a stash of rough-woven linens, enough lye soap to fill a wagon, some dried and smoked fish and pork, an engineer’s assortment of bolts, screws, and washers, a tobacco pouch that had probably been dropped by a laborer…and two dead mice.\u003c/p\u003e\n\u003cp\u003eThey also found three crates of ammunition, some of which was strung to fuel the ball turret guns. The rest looked ordinary enough, and when Maria stood over this final crate she said, “This can’t possibly be it. This is stocked like a ship that was loaded out of convenience, because it was headed the right direction. There’s nothing special or important about any of it.”\u003c/p\u003e\n\u003cp\u003eHainey nodded. “We’ll keep the ammunition and the foodstuffs, and the rest can go overboard when we stop and hang.”\u003c/p\u003e\n\u003cp\u003e“You’re not surprised?”\u003c/p\u003e\n\u003cp\u003e“Surprised about what?”\u003c/p\u003e\n\u003cp\u003e“That we didn’t find anything significant on board?”\u003c/p\u003e\n\u003cp\u003eHe said, “Nope. Because I’ve already got a real good idea of what the sanatorium’s got on order—and what Pinkerton’s been paid to protect. That’s the point, isn’t it? You’re supposed to distract us long enough to let the Clementine get to Louisville to make this delivery?”\u003c/p\u003e\n\u003cp\u003e“Pretty much. But in Kansas City I met an old friend, a fellow Confederate who possessed, shall we say, somewhat incorrect information. He told me about a weapon being built, something made to fire on Danville…and…and…old loyalties took precedence,” she said defensively.\u003c/p\u003e\n\u003cp\u003eHainey said, “Old loyalties. I know what those are like.”\u003c/p\u003e\n\u003cp\u003e“Really? And to whom might you be loyal?”\u003c/p\u003e\n\u003cp\u003e“Nobody you’d know,” he said. “And nothing I care to elaborate upon. None of it matters, because right now we’ve got an interesting situation between the two of us, don’t you think?”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon? A situation?”\u003c/p\u003e\n\u003cp\u003e“Yes, a situation,” he said grouchily, with a hint of false cheer. “You know about half of what’s going on, and I know about half of what’s going on, and there are spots where our information…” he hunted for a phrase. “Fails to overlap.”\u003c/p\u003e\n\u003cp\u003e“That seems to be the case, yes.” She was half a head shorter than him, and a hundred pounds smaller, but she met his gaze over the contents of the last crate, and she didn’t flinch or retreat.\u003c/p\u003e\n\u003cp\u003eHe sounded almost optimistic when he said, “We could work together, you and me. I could tell you some useful things, and you have permission to go to places I’m not allowed.”\u003c/p\u003e\n\u003cp\u003e“You can take me to Louisville.”\u003c/p\u003e\n\u003cp\u003e“I’m headed that direction anyway.”\u003c/p\u003e\n\u003cp\u003e“And I can tell you where your ship is.”\u003c/p\u003e\n\u003cp\u003eHe was startled, despite himself. “You can what?”\u003c/p\u003e\n\u003cp\u003e“It’s parked at a transient dock outside the city. It may be gone now, but it was there last I heard, maybe an hour or two ago. I don’t think your quarry has quite the lead you think it does.”\u003c/p\u003e\n\u003cp\u003eHainey turned on his heels, crossed the cargo bay, and leaned himself through the doorway that led to the bridge. “Simeon! Where are the nearest transient docks?”\u003c/p\u003e\n\u003cp\u003e“Nearest…to here?”\u003c/p\u003e\n\u003cp\u003e“Nearest to Kansas City!”\u003c/p\u003e\n\u003cp\u003eThe first mate thought about it, then said, “East of here, a little ways. At least, that’s where they used to park and set up. Why?”\u003c/p\u003e\n\u003cp\u003e“Because the Free Crow’s there—or she was quite recently. Adjust course!”\u003c/p\u003e\n\u003cp\u003eLamar said, “But sir, we’re still riding heavy. You going to toss the cargo, or what?”\u003c/p\u003e\n\u003cp\u003eHe said, “Yeah, I’ll toss it. Are we over anything or anybody important?”\u003c/p\u003e\n\u003cp\u003eSimeon said, “No, but we will be soon if we adjust course. So get to dropping sooner, rather than later.”\u003c/p\u003e\n\u003cp\u003eThe captain didn’t answer except to dash back to the hold and say to Maria, “Give that lever over there a yank!”\u003c/p\u003e\n\u003cp\u003eShe grabbed it with both hands and hauled it down; when it clicked at the bottom part of its track, a set of sliding doors retracted in the floor at the back of the hold. “Are we discarding the cargo now? I thought we were going to go low and hover?”\u003c/p\u003e\n\u003cp\u003e“Change of plans. We’re going east, to the only transient docks my first mate knows. On the way, you and me are going to toss this stuff out of the Valkyrie. Sim says we shouldn’t hit anything or anybody important for the next few minutes, so give me a hand. Except for what we talked about, grab anything you can move and kick it out, fast as you can.”\u003c/p\u003e\n\u003cp\u003eMaria pressed herself between the crate of linens and the wall, and she used her back and legs to shove it out into the middle of the room.\u003c/p\u003e\n\u003cp\u003eHainey met her there and ushered her aside; he cast the crate over the lip of the retracted door and let it tumble out, down to the prairie below. Then he reached for the next box, which held part of the soap shipment. He swung it and dragged it over to the edge and this too went freefalling to the dry, brown ground half a mile below.\u003c/p\u003e\n\u003cp\u003eMaria took the next box of linens and worked them over the edge. She went back for a cache of polish, which was almost more than she could move, but she took it and she wiggled it, and skidded it until it was teetering—and she tipped it overboard.\u003c/p\u003e\n\u003cp\u003e“Help me with this one,” the captain said like it was an order, but Maria was getting the impression that this was simply how he talked.\u003c/p\u003e\n\u003cp\u003e“Coming,” she said, and she joined him.\u003c/p\u003e\n\u003cp\u003eSide by side, their backs pressed against the metal-stuffed crate of small tools and hardware. This one dug into the paint on the floor but it moved in jerks and inch-long shrugs until finally it too crashed heavily over the lip and into the sky.\u003c/p\u003e\n\u003cp\u003e“Back to the bridge,” the captain said when the last of the expendable boxes had been expended.\u003c/p\u003e\n\u003cp\u003eArms aching and back throbbing, Maria tagged behind him and took up her familiar seat. She dropped herself down and reached for the straps that would fasten her into place.\u003c/p\u003e\n\u003cp\u003eHainey took up his position with similar haste, asking for a time estimate from his first mate. “How long before the docks are in sight?”\u003c/p\u003e\n\u003cp\u003e“Five minutes. Ten, at the outside,” Simeon said. “But how do we want to approach?”\u003c/p\u003e\n\u003cp\u003e“Guns blazing,” Hainey growled. “We’ve still got a right-side ball turret and I’ll take it up myself, if you two can fly us.”\u003c/p\u003e\n\u003cp\u003e“I’m getting the hang of it, sir,” Lamar said helpfully.\u003c/p\u003e\n\u003cp\u003eThe first mate added, “I’ve found everything I need to steer alone, if I have to. But do you really want to shoot the Crow out of the sky?”\u003c/p\u003e\n\u003cp\u003e“I don’t mind doing her a little damage if it helps us get her back. She’ll forgive us in the morning; she always does.”\u003c/p\u003e\n\u003cp\u003e“What about her?” Simeon asked, aiming an eyebrow in Maria’s direction.\u003c/p\u003e\n\u003cp\u003e“What about her? She needs a ride to Louisville, and we’re going to give her one. She’ll behave herself, I bet. It turns out, we have more in common than we thought. Our goals…overlap,” he used that word again. “We want the Free Crow, she wants what it’s carrying, even if it costs her the shiny new job she’s landed.” \u003c/p\u003e","sourceLink":"https://allnovel.net/clementine-the-clockwork-century-1-1/page-22.html","bookId":1672,"creation":"Oct 5, 2019 10:23:00 PM","modification":"Oct 5, 2019 10:23:00 PM"}
