{"id":103249,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How are we going to play this, Captain?” Lamar wanted to know. “Do we catch them mid-air, or do we let them land?”\u003c/p\u003e\n\u003cp\u003eThe captain said, “Mid-air hasn’t worked so well, so far; but then again, we didn’t have a ship this strong. Still, this time let’s let them land, and we’ll take it out from under them.”\u003c/p\u003e\n\u003cp\u003eSimeon said, “We’re going to take it quiet, and let ’em walk back to Washington?”\u003c/p\u003e\n\u003cp\u003e“Not even if they ask nicely.” Hainey stomped back up the folding stairs that led inside the Valkyrie. “I don’t plan to leave any of the bastards standing. Or this bastard, either,” he indicated the ship he was entering.\u003c/p\u003e\n\u003cp\u003e“Sir?” Lamar asked.\u003c/p\u003e\n\u003cp\u003eThe captain answered from the interior, “Engineer, I want you to unscrew that bottom armor plate along the rear hydrogen tank. Leave it naked, and be careful about it. But be fast.”\u003c/p\u003e\n\u003cp\u003eWhen he descended the stairs again, he had the Rattler slung across his shoulders. It had long since cooled from the assault in Kansas City, and although it was almost out of ammunition, another band of bullets sagged around the captain’s chest like a sash.\u003c/p\u003e\n\u003cp\u003eHe continued, “We want to give them a few minutes to get themselves moored and get comfortable.” Then he asked Simeon, “You don’t think they saw us, do you? This is a big bird, but we’ve got some tree cover and the hill between us.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t say. But I’d guess they didn’t.”\u003c/p\u003e\n\u003cp\u003eHainey stripped the last handful of bullets out of the Rattler and began to thread the new band into its chambers. Lamar was already whacking at the armor with a wrench and a prybar, and they both finished their tasks in less than a minute; but Simeon joined Lamar, and between them they pulled away another crucial strip of plating, widening the vulnerable spot and giving themselves a bigger target.\u003c/p\u003e\n\u003cp\u003e“That ought to do it,” the captain declared. “Let’s leave it for now and go. It’ll be safer to blast it from the sky, anyway, and I think we’ve given Brink and his boys time enough to get our ship secured. Simeon, help me with this thing.”\u003c/p\u003e\n\u003cp\u003eSimeon took the barrel of the large, freshly loaded gun, and helped to carry it as if it were still suspended in a crate. Together they walked through the trees, down the hill, and around the back end of the building where an improvised landing pad had been cleared and a set of uncomplicated pipework docks had been established. From the edge of the clearing where Hainey, Simeon, and Lamar were hunkered and hiding, it looked like there had once been a building in the clearing—and now there was nothing left but its foundation, which made a perfectly serviceable spot in which to park an airship.\u003c/p\u003e\n\u003cp\u003eThe Free Crow—improperly christened the Clementine—sagged on its moorings. None of the lines and clips that held it to the earth were strictly necessary, and none were drawn tight for the ship was so overburdened that without the fight of the engines, it would have sunk to the ground.\u003c/p\u003e\n\u003cp\u003eA pair of large Indian men milled about outside the ship. They looked enough alike to be brothers, but neither Hainey nor either of his crewmembers could guess which tribe they hailed from. Beside them, seated and scowling, was a heavily bandaged man with a wrapped foot, thigh, and hand. He fiddled with a makeshift crutch and swore under his breath.\u003c/p\u003e\n\u003cp\u003eHainey whispered, “I knew I’d got one of them, back in Seattle.”\u003c/p\u003e\n\u003cp\u003eLamar said, “You shouldn’t have fired inside the ship. You could’ve killed us all.”\u003c/p\u003e\n\u003cp\u003eThe captain made half a shrug and said, “I know. But I was mad as hell, and being mad got the better of me. I wonder what man that is,” he said, and he meant that he wondered what position the crewman held. “I think his name is Guise. I know the first mate is a fellow called Parks, but I don’t see him out there.”\u003c/p\u003e\n\u003cp\u003e“He must be inside,” Simeon said.\u003c/p\u003e\n\u003cp\u003eFrom within the ship, a loud, repeated banging sound echoed throughout the hull. The sound had a sharp edge, like a sculptor’s chisel biting into stone; it rang with a timbre that made Hainey think of miners picking their way through coal. He said, “They’re trying to dig it out of her, I bet.”\u003c/p\u003e\n\u003cp\u003e“The diamond?” Lamar asked.\u003c/p\u003e\n\u003cp\u003e“That’s right. They’re digging through the cement in her coffin, trying to reach what she’s wearing. They should’ve started that sooner, rather than leaving it to the last minute like this.”\u003c/p\u003e\n\u003cp\u003eThe first mate said, “Maybe there’s more cement than they bargained for.”\u003c/p\u003e\n\u003cp\u003eAnd Lamar suggested, “Maybe they were too busy running from us.”\u003c/p\u003e\n\u003cp\u003eHainey nodded at the engineer and said, “I like your explanation better. Well, let’s get going.”\u003c/p\u003e\n\u003cp\u003eWith Simeon’s help he hoisted the Rattler up onto his shoulders, and checked the smaller guns that hung on the belt around his waist. They did this with all the quiet they could muster, and they were at barely enough distance that they thought no one would hear them…until Hainey stood up straight, Rattler primed and ready, and found himself face-to-face with one of the Indians who had only a moment before been a hundred feet away.\u003c/p\u003e\n\u003cp\u003eThe native man had a shape that looked like it’d been carved from a tree, and gleaming black hair that hung down almost to his hips. He was dressed like a white man, in a linen shirt tucked into a pair of denim pants.\u003c/p\u003e\n\u003cp\u003eNothing rustled and no part of him moved. He did not even blink.\u003c/p\u003e\n\u003cp\u003eSimeon and Lamar were frozen to the spots where they stood, even though the newcomer appeared unarmed. It was too startling, the speed and silence with which this man had moved into their midst.\u003c/p\u003e\n\u003cp\u003eIt occurred to all three black men at once that there’d actually been two Indians, down by the Free Crow. Their realization came a split second before the injured man beside the craft began to holler, “Where the hell did you two get off to? Eh? What’s going on?”\u003c/p\u003e\n\u003cp\u003eWithin the ship, a man’s voice demanded to know, “What are you barking on about, Guise?”\u003c/p\u003e\n\u003cp\u003e“Them Indians done took off!”\u003c/p\u003e\n\u003cp\u003e“They’ll be back. Now if you’re not going to help in here, at least keep your mouth shut.”\u003c/p\u003e\n\u003cp\u003eAt no point during the exchange had the Indian unfastened his eyes from the captain’s, but once Mr. Guise had sulked himself into quiet he said, very softly, “Hainey.”\u003c/p\u003e\n\u003cp\u003e“That’s me.”\u003c/p\u003e\n\u003cp\u003e“Yours,” he said, pointing at the craft.\u003c/p\u003e\n\u003cp\u003eHainey gathered from the enunciation, or maybe from the brevity, that he was dealing with a fellow who spoke little to no English. He wasn’t sure how to proceed except to say, “Yes.”\u003c/p\u003e\n\u003cp\u003eThe second Indian appeared behind Simeon, close enough that he could’ve harmed the first mate, but he simply stepped to join the man who must’ve been his brother, yes—Hainey could see the resemblance more strongly, when they stood together like that.\u003c/p\u003e\n\u003cp\u003eThe second man said, “Seattle,” but he said it with at least one extra syllable, and he lodged an accent mark into the middle of it.\u003c/p\u003e\n\u003cp\u003eHainey wasn’t sure if this was in reference to the old chief for whom the city was named, or the city itself, so he nodded in general agreement that yes, he’d been in the city; and yes, he knew of the chief. He said, “I got no gripe with him or his tribe, if that’s what you’re asking.”\u003c/p\u003e\n\u003cp\u003e“Brink,” the first one said with disgust. Then the second man said, “You take,” and he pointed at the Free Crow. He said it with finality, and when he turned away, his brother did the same.\u003c/p\u003e\n\u003cp\u003eThey walked into the woods as quietly as they’d emerged, and then they were gone.\u003c/p\u003e\n\u003cp\u003eHainey hadn’t realized he’d been holding his breath, but he had, and he let it out to say, “That was strange.”\u003c/p\u003e\n\u003cp\u003eHis first mate sniffed. “Brink must not be much of a captain. Or maybe he’s all right to his white men, and not the rest.”\u003c/p\u003e\n\u003cp\u003e“There’s no telling,” Hainey said, with a tone that said he didn’t give a damn one way or the other. He strained under the weight of the Rattler, which was hard enough to balance when he was moving about—and as a stationary load, it was even worse to hold. “I wish we could’ve asked them about who else was on board, though.”\u003c/p\u003e\n\u003cp\u003e“They’ve got the one beat-up fellow outside. He won’t give us too much hassle,” Simeon said.\u003c/p\u003e\n\u003cp\u003e“Shot up,” Lamar corrected him. “And Brink, and probably a first mate. It might be three against three.”\u003c/p\u003e\n\u003cp\u003e“Four against three,” Hainey said, and he patted the Rattler. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eThe three men sneaked back behind the airship and then, on the captain’s signal, they rushed down the last of the hill and into the landing zone.\u003c/p\u003e\n\u003cp\u003eSimeon had his revolver up, loaded, and ready to fire; Lamar held a rifle that was poised to blow a hole in the first something or someone that got in his way. Hainey’s footsteps were twice as heavy as usual, and his shoulders screamed as the Rattler dug into them hard, jarring sinew and bone with every stride.\u003c/p\u003e\n\u003cp\u003eThe injured Mr. Guise heard the oncoming rush when Hainey was still ten yards out; but bound in his bandages as he was, there was little he could do except yelp for his captain.\u003c/p\u003e\n\u003cp\u003e“Brink! Captain Brink!” he shouted.\u003c/p\u003e\n\u003cp\u003e“What now?”\u003c/p\u003e\n\u003cp\u003e“Company—” he said, though the last bit of the concluding “y” was sliced off by a bullet from Simeon. The bullet went straight through Guise’s throat and his head snapped back. His body toppled onto the hard foundation and bounced there, and except for the gurgling and the spreading blood, it didn’t otherwise make a scene.\u003c/p\u003e\n\u003cp\u003e“Jesus Christ!” a man declared from within the belly of the Free Crow. “Hold them off, I’ve almost got it!”\u003c/p\u003e\n\u003cp\u003e“They won’t shoot—not in here, not with the hydrogen!”\u003c/p\u003e\n\u003cp\u003eBut outside, the Rattler was warming up. Its telltale whirring hum was cranking up to a faster grade and a higher pitch, and it would take nothing but the squeeze of a trigger to pepper the craft and all its occupants with bullets as long as a man’s palm.\u003c/p\u003e\n\u003cp\u003e“It’s Hainey!” someone announced, and through the front window glass, the captain spied a meaty, dark-haired man with a glare in his eyes and a deep frown cut into his face. \u003c/p\u003e","sourceLink":"https://allnovel.net/clementine-the-clockwork-century-1-1/page-27.html","bookId":1672,"creation":"Oct 5, 2019 10:23:00 PM","modification":"Oct 5, 2019 10:23:00 PM"}
