{"id":103254,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How far, sir?”\u003c/p\u003e\n\u003cp\u003e“How far away do you think I can aim it from?” he asked.\u003c/p\u003e\n\u003cp\u003eLamar didn’t give him a number or a measurement, but he said, “All right. I’ll take us back that far.”\u003c/p\u003e\n\u003cp\u003eThe Free Crow retreated on a slick, easy path, holding the Valkyrie in its sights. As the ship withdrew, the bright-haired figure on the bridge grew tinier and tinier, and its frantic struggles with the controls grew harder and harder to see.\u003c/p\u003e\n\u003cp\u003eHainey said, “Swing us back; bring us point forward with the Valkyrie’s tail.”\u003c/p\u003e\n\u003cp\u003eAnd Simeon made it happen.\u003c/p\u003e\n\u003cp\u003e“Lamar, let me have your seat for a minute.”\u003c/p\u003e\n\u003cp\u003eThe engineer rose and let the captain sit. He pulled the trigger for the front right gun into his lap and flexed his fingers around the molded grip. And, taking his time, he said to Maria, “You see that back armor panel, over the hydrogen tanks?”\u003c/p\u003e\n\u003cp\u003ePuzzled, she said, “No.”\u003c/p\u003e\n\u003cp\u003eAnd he replied, “That’s because we pulled it off.”\u003c/p\u003e\n\u003cp\u003eHe squeezed the trigger and the ship jumped as the big guns fired, squirting shells across the sky in a deadly arc that pitted the side of the Valkyrie…and then stabbed into the hydrogen tanks.\u003c/p\u003e\n\u003cp\u003eIn the span of two seconds, the Valkyrie shook, shimmered, and exploded into a nova of fire that seemed to stretch across the entire windscreen of the Free Crow.\u003c/p\u003e\n\u003cp\u003eA shockwave rocked the ship and everyone within it, and for a moment it swayed and fought against its own engines. But soon with the help of its expert crew, it steadied and rose once more, sliding back across the sky and away from the flaming, falling wreckage of the Union warbird.\u003c/p\u003e\n\u003cp\u003eOver the sanatorium the Free Crow flew, and as it rose Maria ignored the earlier admonition to stay away from the controls—because the windshield was on the other side of the controls and she couldn’t see the world outside unless she stood in front of them. As Captain Hainey returned to his proper seat and Lamar reclaimed his own, the captain asked, “What are you looking at?”\u003c/p\u003e\n\u003cp\u003eShe said, “There, do you see? The sanatorium.”\u003c/p\u003e\n\u003cp\u003e“What about it?”\u003c/p\u003e\n\u003cp\u003e“Look, down there. Those windows at the building’s very bottom—they let light into the basement. They’re open, do you see?” she said, her eyes bright and still, perhaps, a little wet.\u003c/p\u003e\n\u003cp\u003eHainey did see, though he wasn’t sure what he was seeing. “Someone’s emptying the basement then, it looks like to me. They’re throwing things out onto the lawn.”\u003c/p\u003e\n\u003cp\u003e“It’s the weapon,” she told him. “The boy, Edwin—he and Doctor Smeeks are destroying it. They never wanted to build it in the first place, and now they’re disassembling it.”\u003c/p\u003e\n\u003cp\u003eAs the ship hovered, the captain, Maria, and the crew watched as the boy collected the weapon’s parts into a pile on the front yard; and then they observed as an elderly man came to toss a match onto the pile.\u003c/p\u003e\n\u003cp\u003eMaria said, “That’s it, then.” She looked up at the captain and said it again. “That’s it.”\u003c/p\u003e\n\u003cp\u003e“That wasn’t part of your initial mission though, was it?” the captain asked, though he already knew the answer.\u003c/p\u003e\n\u003cp\u003e“Of course it wasn’t. But…but I’m glad I did it, regardless. And besides, my mission for Pinkerton went well enough,” she insisted, stuffing one Colt into her handbag and unfastening the gunbelt form her hips.\u003c/p\u003e\n\u003cp\u003eHainey asked, “How do you figure that? You hitched a ride with the crew you were hired to stop, and then you killed the man whose shipment you were supposed to ensure. You wreaked a fair bit of havoc, Belle Boyd.”\u003c/p\u003e\n\u003cp\u003eMaria didn’t ask how he knew she’d killed Steen.\u003c/p\u003e\n\u003cp\u003eShe only said, “Yes, but technically I was only hired to make sure the shipment arrived at the sanatorium. And I’d like for the record to reflect, the diamond did, in fact, arrive safely at its intended destination.” She did not add that it had a new destination, stashed in her own luggage.\u003c/p\u003e\n\u003cp\u003eMaria planted her feet and folded her arms, daring anyone to argue with her.\u003c/p\u003e\n\u003cp\u003eCroggon Beauregard Hainey put his face in his hand, and his body began to quiver as the laugh he meant to hide worked its way up, and out, and into the bridge of the Free Crow. He laughed louder and harder than he’d ever laughed in his life; and before long, Maria Isabella Boyd joined him with a devious smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/clementine-the-clockwork-century-1-1/page-32.html","bookId":1672,"creation":"Oct 5, 2019 10:23:00 PM","modification":"Oct 5, 2019 10:23:00 PM"}
