{"id":84962,"no":2,"title":"Page 2","content":"\u003cp\u003eShe sniffs. “Whatever. Come over. I want to see you.”\u003c/p\u003e\n\u003cp\u003eI open my garage door. “Nope. I just got home and I don’t want to go back out. You can come here, if you’d like.”\u003c/p\u003e\n\u003cp\u003eThere’s a pause while she considers it. Finally she sighs.\u003c/p\u003e\n\u003cp\u003e“Can’t. I’ve got an early call tomorrow. I don’t want to be a bitch on-set.”\u003c/p\u003e\n\u003cp\u003e“No?” I ask in mock surprise. “Amy Ashby doesn’t want to be a bitch?” She laughs, a husky contrived sound.\u003c/p\u003e\n\u003cp\u003e“You know, I’ve changed my mind. I’m coming over and I’ll be a bitch tonight for you. I know how you like it. Which riding crop should I bring? The leather or the red velvet?”\u003c/p\u003e\n\u003cp\u003eA thrill goes through me at the thought… of being tied up and of Amy Ashby whipping the shit out of me right before she goes down on me.\u003c/p\u003e\n\u003cp\u003eIt’s our favorite thing to do together.\u003c/p\u003e\n\u003cp\u003e“The red velvet,” I answer curtly. “I’ll see you in twenty minutes. Don’t be late.”\u003c/p\u003e\n\u003cp\u003e“On my way,” she purrs.\u003c/p\u003e\n\u003cp\u003eI enter my lavish house and disarm the alarm, before grabbing a tumbler of whiskey and heading out to the back veranda.\u003c/p\u003e\n\u003cp\u003eAs I stand looking down on Hollywood, I ponder my life.\u003c/p\u003e\n\u003cp\u003eIt’s not what it was supposed to be. In high school, this wasn’t what I had in mind when I pictured myself as a grown up. But here I am, at the mature age of twenty-four and I feel like I’ve aged a hundred years. I feel as though everything that could’ve possibly happened to me in life has happened.\u003c/p\u003e\n\u003cp\u003eAnd it’s left its mark. I’ve got so many marks and scars hidden beneath my surface that I can’t even name them all.\u003c/p\u003e\n\u003cp\u003eBut that’s all right. I don’t need to name them all. I need to shove them away and forget about them, like I always do. I need to mask them in a wild kinky night of S\u0026amp;M with Hollywood’s favorite starlet.\u003c/p\u003e\n\u003cp\u003eIn the morning, we’ll go about our lives as normal, both of us pretending to be what we’re not: normal, well-rounded people.\u003c/p\u003e\n\u003cp\u003eThe pretense is how we survive.\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eI duck in the back of my favorite restaurant, Providence, and make my way to my regular table. It’s in the back, in the shadows, and that’s just the way I like it.\u003c/p\u003e\n\u003cp\u003eI’m different from most of the people I know who eat here. Most celebrities like to make an entrance through the front because they enjoy how the fans rush up to them, surrounding them with pleas for autographs or pictures.\u003c/p\u003e\n\u003cp\u003eNot me.\u003c/p\u003e\n\u003cp\u003eThat’s never been me.\u003c/p\u003e\n\u003cp\u003eI’ve barely slid into my booth before a waitress slinks over to me, her bright green eyes lighting up as she sees me.\u003c/p\u003e\n\u003cp\u003e“Dominic,” she exclaims, wrapping an arm around my shoulders and squeezing. I grin up at her, genuinely pleased to see her. Since she’s one of the only women who have ever turned me down, I shouldn’t be so partial to her.\u003c/p\u003e\n\u003cp\u003eBut that’s not the case. I actually like her.\u003c/p\u003e\n\u003cp\u003e“Hey Alex.”\u003c/p\u003e\n\u003cp\u003eShe glances around me. “Where’s Miss Ashby? Should I watch for her?”\u003c/p\u003e\n\u003cp\u003eI shake my head, remembering how I spent most of the night tied up in silk cords and getting my ass beat by her. She’d slipped out of my house before nine a.m.\u003c/p\u003e\n\u003cp\u003e“Nope. She’s at work today. I’m here on my own.”\u003c/p\u003e\n\u003cp\u003e“Just the way I like it,” Alex announces smirking. She sits across the table from me, comfortable now that she knows Amy isn’t coming. “How are things? I haven’t seen you in a couple of weeks.”\u003c/p\u003e\n\u003cp\u003eI shrug. “I’ve been busy. Just wrapped production, and I have a couple of weeks before the next film starts. I’m thinking about going to my brother’s for a weekend or so. It’d be nice to go home for a few days.”\u003c/p\u003e\n\u003cp\u003eAlex shakes her head. “You know that your family has been blessed by the Gods, right? I mean, you’re gorgeous, sexy as hell and you’ve got the freaking world on a string, Dominic. Your brothers are in the most famous band in the world and so you’ve got a built-in soundtrack to your life if you want it.”\u003c/p\u003e\n\u003cp\u003eI have to laugh at that. “Oh really? You think that the Devil’s Own will just stop what they’re doing and write some songs for me? Not hardly. I love my brothers, but Sin and Duncan aren’t going to interrupt a tour schedule just for me. But you’re right. I’ve been blessed and I need to remember that.”\u003c/p\u003e\n\u003cp\u003eI pick up my menu, even though I know exactly what it says. As I peruse the food offering, Alex stares at me, her brow furrowed.\u003c/p\u003e\n\u003cp\u003e“What’s going on with you, dude? You don’t seem like yourself. You seem…off.”\u003c/p\u003e\n\u003cp\u003eI laugh again. “I am off. I’ve been off for a long time, but nothing’s wrong. I’m just feeling a bit tired. I think going home to Chicago will be good for me. It’ll recharge my batteries, so to speak.”\u003c/p\u003e\n\u003cp\u003eAlex continues to examine me, her head cocked. “Okay. If you say so. But if you want anyone to talk to someone who won’t just tell you what you want to hear, you know you can talk to me. I’m not concerned with sleeping with you, so I’ll always be honest with you.”\u003c/p\u003e\n\u003cp\u003e“You’ve got that right,” I tell her wryly. “You’ve never been concerned with sleeping with me.”\u003c/p\u003e\n\u003cp\u003eShe taps her wedding ring. “Sorry, dude. You’re hot and all, but I’m one of the few out there who believes that marriage is sacred. Well, there are only a few here in LA. I’m sure that there are plenty more like me out in the real world. But we Angelinos are a different breed.”\u003c/p\u003e\n\u003cp\u003e“True story,” I agree. “I’ll have the fish tacos.” I fold up the menu and hand it to her. “Thanks, Alex.”\u003c/p\u003e\n\u003cp\u003eAnd by thanks, I mean for offering to listen to me. I do appreciate it. She’s one of the few decent people I’ve met out here.\u003c/p\u003e\n\u003cp\u003e“Sure thing.”\u003c/p\u003e\n\u003cp\u003eShe trots off to the kitchen and I’m left alone once again.\u003c/p\u003e\n\u003cp\u003eBut only for a few minutes.\u003c/p\u003e\n\u003cp\u003eThe hostess, a bleached blonde Barbie-type makes her way over to me a short time later, trying to act casual but I feel sure that she’d bee-lined her way to me as soon as she saw that I was here. She always does.\u003c/p\u003e\n\u003cp\u003e“Dominic,” she purrs, snaking her skinny arm around my shoulders. Unlike when Alex did it, I’m not enjoying this girl’s touch. I shrug out of her grasp.\u003c/p\u003e\n\u003cp\u003e“Hi,” I answer coolly.\u003c/p\u003e\n\u003cp\u003eI’m not trying to be rude, but she’s always annoyed me. She’s an opportunist. She’s trying to make it in the acting world and I know she’d probably take down her own grandmother to get a leg up. Given how poor her acting skills are when she pretends to be casual around me, I don’t think she should quit her day job.\u003c/p\u003e\n\u003cp\u003e“So, are you alone?” she asks bluntly, her lips almost grazing my ear. “Because I’ve got something important to discuss with you.”\u003c/p\u003e\n\u003cp\u003eI arch an eyebrow. “Oh, really? And that is?”\u003c/p\u003e\n\u003cp\u003eShe whispers into my ear. “I’m not supposed to discuss this kind of thing here, but I have a question about the industry.”\u003c/p\u003e\n\u003cp\u003eAnd by industry, she of course means the acting world.\u003c/p\u003e\n\u003cp\u003eI sigh.\u003c/p\u003e\n\u003cp\u003e“Okay, shoot,” I tell her.\u003c/p\u003e\n\u003cp\u003e“How can I go about getting your agent?” She asks seriously, her eyes burning into mine with intensity.\u003c/p\u003e\n\u003cp\u003e“Tally?” I ask in surprise. “He’s got a waiting list ten miles long. He was a friend of my father’s and that’s the only reason why he took me on a few years back.”\u003c/p\u003e\n\u003cp\u003eShe stares at me dubiously. “So there’s no way whatsoever that I could get you to put a good word in for me?”\u003c/p\u003e\n\u003cp\u003eThere’s a light in her eyes now, a particular sexual light that I’ve seen in a thousand women’s eyes. I stare back, unfazed.\u003c/p\u003e\n\u003cp\u003e“Probably not.”\u003c/p\u003e\n\u003cp\u003e“Nothing I can do?” she asks again, her hands trailing from my shoulders down my back and wrapping around to my lap, lightly tracing my crotch. “Can I try?”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “Go for it.”\u003c/p\u003e\n\u003cp\u003eThe hostess glances around, sees that no one is near, and immediately drops to her knees and crawls under the table. I’m startled for a mere second, then as her deft hands unfasten my pants and stroke at me, I allow all cognitive thought to leave my mind. When her mouth replaces her hands, logical thought disappears and I close my eyes.\u003c/p\u003e\n\u003cp\u003eHer hands are cold as she cups my balls, but her lips are warm.\u003c/p\u003e\n\u003cp\u003eHer breath is hot.\u003c/p\u003e\n\u003cp\u003eAnd her tongue teases the tip of my dick.\u003c/p\u003e\n\u003cp\u003eI fight back the urge to moan. She’s hidden by the tablecloth, so it would look odd if anyone happened to notice me moaning to myself in the middle of a restaurant.\u003c/p\u003e\n\u003cp\u003eChrist. I despise women like this, but at the same time, I can’t dismiss their merit. It’s nice to get blown in the middle of the day, in the middle of Providence.\u003c/p\u003e\n\u003cp\u003eSometimes, it pays to be Dominic Kinkaide.\u003c/p\u003e\n\u003cp\u003e“Hey, Melanie hasn’t bothered you yet, has she?” Alex demands, appearing out of nowhere. My eyes snap open and I fight to act normal, which is hard since a very key part of me is buried in Melanie’s throat at this very minute.\u003c/p\u003e\n\u003cp\u003eMelanie tightens her grasp on my balls, as she’s perfectly able to hear every word that Alex says.\u003c/p\u003e\n\u003cp\u003e“Yeah. Stupid chick keeps wanting to assault you… get you to help her out. Just ignore her, Dominic. She’s ridiculous. I have better acting skills than she does. And I’m not an actor.”\u003c/p\u003e\n\u003cp\u003eMelanie’s claws grip me tighter and I grimace. \u003c/p\u003e","sourceLink":"https://allnovel.net/until-we-burn-beautifully-broken-2-5/page-2.html","bookId":2760,"creation":"Oct 5, 2019 5:04:03 PM","modification":"Oct 5, 2019 5:04:03 PM"}
