{"id":84966,"no":6,"title":"Page 6","content":"\u003cp\u003eI nod and we walk from the hotel to a waiting car.\u003c/p\u003e\n\u003cp\u003eThe drive to the airport doesn’t take long and within a few more moments, I’m walking up the stairs and entering the plane. I’m immediately struck with the vision of Amy sitting with two young blondes on a leather sofa.\u003c/p\u003e\n\u003cp\u003eThe two blondes are topless and Amy is in the middle, dressed only in a red leather corset.\u003c/p\u003e\n\u003cp\u003eMy dick tightens in pants.\u003c/p\u003e\n\u003cp\u003eTally slams into me from behind, since I’ve stopped dead-still in the aisle and he swivels around me to see what the hold-up is. I hear him suck in his breath.\u003c/p\u003e\n\u003cp\u003e“You’re a fucking lucky son-of-a-bitch, Kinkaide,” he mutters. “I’ll just…stay up here.”\u003c/p\u003e\n\u003cp\u003eI don’t answer. Instead, I take a step, then another.\u003c/p\u003e\n\u003cp\u003e“What’s this?” I ask nonchalantly, staring down at Amy’s upturned face. She reaches out and trails her fingers down my thigh.\u003c/p\u003e\n\u003cp\u003e“Oh, this?” she asks innocently, glancing at her two friends. “These are my assistants and I’m going to loan them to you for the evening, as well. Anything you need, just ask. They’ll be happy to oblige. And me? I’m in a rare accommodating mood, too. Whatever you desire, no matter what it is… ask. And it’s yours.”\u003c/p\u003e\n\u003cp\u003eAnd now I’m amused. Amy Ashby is stooping to this? For what? Just to fuck me? I have a growing suspicion that it’s less the driving need to fuck me and more about saving her wounded ego because I don’t seem to want to. Her ego is the biggest thing about her.\u003c/p\u003e\n\u003cp\u003e“Well,” I smile. “This could be an interesting evening.”\u003c/p\u003e\n\u003cp\u003eAmy smiles back and pats the seat next to her. The blonde to her left moves over, giving me space to sit. When I do, they each loop a leg over one of mine, effectively holding me down.\u003c/p\u003e\n\u003cp\u003e“Would you like a drink?” the other blonde whispers to me, her full lips mere centimeters from my ear.\u003c/p\u003e\n\u003cp\u003e“Yes,” I answer. “Whiskey. Neat.”\u003c/p\u003e\n\u003cp\u003e“Done,” she answers. She slips away and while she’s gone, her blonde friend massages my thigh, then slips her fingers around to my lower back, soothing my tired muscles.\u003c/p\u003e\n\u003cp\u003eWithin minutes, the other girl comes back with a glass of whiskey on a tray, and a black velvet blindfold.\u003c/p\u003e\n\u003cp\u003e“Amy wants you to wear this,” she says softly. “Let me help you with it.” Bending forward, her soft tits envelop my face as she slides the blindfold over my head. I inhale her feminine scent, soft and flowery.\u003c/p\u003e\n\u003cp\u003e“Now what?” I ask as I lean back, totally blind.\u003c/p\u003e\n\u003cp\u003e“Now, enjoy your flight,” the girl says brightly.\u003c/p\u003e\n\u003cp\u003eAnd I fully intend to.\u003c/p\u003e\n\u003cp\u003eBut as they softly stroke my back, my thighs, my face, my chest… their soothing touches have the opposite effect on me than they intend. Because I’ve been up and on-set for ten hours today, I’m exhausted.\u003c/p\u003e\n\u003cp\u003eInstead of turning me on, their soothing touches put me to sleep.\u003c/p\u003e\n\u003cp\u003eWhen I wake, we’ve landed in Amsterdam and Amy is glaring at me from across the plane.\u003c/p\u003e\n\u003cp\u003e“Seriously?” she demands. “I went out of my way to plan the perfect evening for you. I have everything you could possibly want on board this plane… and you went to sleep? What the hell, Dominic?”\u003c/p\u003e\n\u003cp\u003eI can’t help but grin at this, just a little. She’s pissed.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I tell her as soothingly as I can. “I’m exhausted and jet-lagged. It’s not a reflection on you. Or of your sexy assistants.” I glance at them and find that they’re fully clothed now. “I’m sorry,” I tell them. “I didn’t meant offend you.”\u003c/p\u003e\n\u003cp\u003eThey both smile warmly. “Not a problem,” one says. “We’ll can pick up where we left off later.”\u003c/p\u003e\n\u003cp\u003eI glance at Amy and raise an eyebrow. “Later?”\u003c/p\u003e\n\u003cp\u003eShe nods in satisfaction.\u003c/p\u003e\n\u003cp\u003e“I told you… you’ll fuck me by the time this night is over. We’re all going to Sin’s party. And we all know… if something freaky doesn’t happen at one of his parties, then it’s not meant to happen.”\u003c/p\u003e\n\u003cp\u003eI have to give her that. My brother’s parties are beyond the normal….so far beyond the norm that they’re off the map.\u003c/p\u003e\n\u003cp\u003eI nod, not committing, but not declining, either.\u003c/p\u003e\n\u003cp\u003eAs we deplane, I have a brief memory, a fleeting vision of one other time, years ago, when I’d been at a party and had gotten the worst phone call of my life. The night that had changed my life forever. The night that had crushed my heart into ash.\u003c/p\u003e\n\u003cp\u003eI reach into my pocket, twisting the pendant round and round in my fingers.\u003c/p\u003e\n\u003cp\u003eI can’t feel anything, not anymore. So what I have to do is go through the motions. And if that means trying to do crazy, kinky, sexual things just to be able to feel something, I’ll do it.\u003c/p\u003e\n\u003cp\u003eBecause honestly, I haven’t decided what’s worse: not being able to feel something, or being so stuck in the pain of the past that I’m paralyzed with it. For six years, I’ve held out the hope that I’ll come around. That the pain will stop. That I’ll miraculously become normal.\u003c/p\u003e\n\u003cp\u003eBut slowly, I’m coming to terms with the fact that it isn’t going to happen.\u003c/p\u003e\n\u003cp\u003eI’m not normal.\u003c/p\u003e\n\u003cp\u003eThere’s no use pretending to be.\u003c/p\u003e\n\u003cp\u003eAnd if I’m going to hell for all the shit that I do, I might as well make the crime fits the punishment.\u003c/p\u003e\n\u003cp\u003eUntil I burn in hell, I might as well make every single moment worth it.\u003c/p\u003e\n\u003cp\u003eStarting tonight.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eSin’s penthouse suite is the entire top floor of a glitzy hotel in the center of the city. Sin never does anything understated. He prefers to be the center of attention at any given time and he always pulls it off with panache.\u003c/p\u003e\n\u003cp\u003eAmy, me and her two ‘assistants’ push through the throngs of people lounging, dancing and chattering throughout these rooms. Scantily clad people, half naked people. Drunk people. High people. All kinds of people.\u003c/p\u003e\n\u003cp\u003e“Where’s your brother?” Amy calls over her shoulder to me. I look around. I don’t see him anywhere.\u003c/p\u003e\n\u003cp\u003e“Let’s check his bedroom. He never lets anyone in there…except for certain women.”\u003c/p\u003e\n\u003cp\u003eAnd by certain, I mean whichever women he chose from the crowd at his show. His bouncers would’ve plucked the girls from the throngs, given them backstage passes and then accompanied them to Sin’s after party. It’s just what he does. And he never gets tired of it.\u003c/p\u003e\n\u003cp\u003eWhen we tap on his door and he answers in only his jeans, I can see two naked women in his bed over his shoulder. And I know I’m right.\u003c/p\u003e\n\u003cp\u003e“Dude,” he mutters. “Could you have worse timing?”\u003c/p\u003e\n\u003cp\u003e“Did I interrupt something?” I grin innocently. Sin scowls at me.\u003c/p\u003e\n\u003cp\u003e“Jesus. First you miss my show, then you cock block me. Nice, bro.”\u003c/p\u003e\n\u003cp\u003eI chuckle as Sin throws his door open wide, motioning us inside. “You might as well come inside,” he mutters. Then he glances behind me at Amy and her two friends, and his manner changes. He instantly becomes Sin Kinkaide, charming chick magnet.\u003c/p\u003e\n\u003cp\u003e“Hello, ladies,” he drawls. Amy smiles at him, unfazed by his celebrity status and blatant sexual energy. Her friends, however, are not. They blush and become instantly on edge. Sin grins.\u003c/p\u003e\n\u003cp\u003e“I’ve got a private party goin’ on in here,” he tells them, still grinning. Still shirtless. “It’s very exclusive. Only the most beautiful women in the city get to attend. Would you like to come in?”\u003c/p\u003e\n\u003cp\u003eThey’re in awe now, flattered by the invitation, and without a backward glance, they step into his room. As he closes the door, I see the two girls in the bed scoot over to make room for the two new girls.\u003c/p\u003e\n\u003cp\u003eI turn to Amy, shaking my head.\u003c/p\u003e\n\u003cp\u003e“Well, you lost your accomplices.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and grabs a glass of champagne from the tray of a passing waiter. Running her tongue along the rim, she stares at me over it.\u003c/p\u003e\n\u003cp\u003e“You don’t need them. All you need is me, Dom. By tonight, you’ll realize that.”\u003c/p\u003e\n\u003cp\u003eBefore I can answer or refute that statement, she gazes past me, intent on something across the room.\u003c/p\u003e\n\u003cp\u003e“Hmmm. There’s Tara Linwood. I’ll be back in a minute. Think about me while I’m gone.”\u003c/p\u003e\n\u003cp\u003eAs she brushes past me to chat with the up-and-coming actress across the room, she pushes something into my hand. Glancing down, I see that it’s her panties, a tiny piece of silk and lace meant to turn to me on.\u003c/p\u003e\n\u003cp\u003eIt doesn’t. I prefer my women pantiless… or in red silk. I lay the panties on a nearby table, next to a bowl of mints. They should brighten someone else’s day. Oddly enough, knowing that Amy is pantiless now across the room doesn’t turn me on, either. Which means that it’s probably time to end things.\u003c/p\u003e\n\u003cp\u003eIt’s just as well that she chose to give me this ultimatum.\u003c/p\u003e\n\u003cp\u003eI get bored very easily and apparently, even bitchy A-list actresses don’t hold my attention long.\u003c/p\u003e\n\u003cp\u003eAs I walk toward the open balcony, a young waitress catches my eye from across the room, her eyes lighting up as she recognizes me. She quickly tries to hide her excitement, to act professional and nonchalant as she offers me a drink from her tray, but it’s too late. I already saw it.\u003c/p\u003e\n\u003cp\u003eAnd I’m filing it away for later.\u003c/p\u003e\n\u003cp\u003eI’ll probably be here for several hours. I might get bored later.\u003c/p\u003e\n\u003cp\u003eFor now, I settle onto a cushioned seat in the corner of the darkened veranda, staring down at the bright lights of the city.\u003c/p\u003e\n\u003cp\u003eFrom this position, I can see everything I want to see. I can observe party guests and their drunken behavior, I can look down upon the city, and I can stay to myself and not interact with anyone. \u003c/p\u003e","sourceLink":"https://allnovel.net/until-we-burn-beautifully-broken-2-5/page-6.html","bookId":2760,"creation":"Oct 5, 2019 5:04:03 PM","modification":"Oct 5, 2019 5:04:03 PM"}
