{"id":94059,"no":5,"title":"Page 5","content":"\u003cp\u003eDrizzt slipped down a quiet passageway, the clamor of the wild battle lost behind him. The drow was not worried, for he knew that his 1 shadow, his Guenhwyvar, was padding along silently not too far ahead. Of more concern to Drizzt was Regis, still stubbornly close to his back. Fortunately, the halfling moved as silently as the drow, keeping equally well to the shadows, and did not seem to be a liability to Drizzt.\u003c/p\u003e\n\u003cp\u003eThe need for silence was the only thing that kept Drizzt from questioning the halfling then and there, for if they stumbled on a number of goblins, Drizzt did not know how Regis, who was not skilled in battle, would keep out of harm\u0027s way. Ahead, the black panther paused and looked back at Drizzt. The cat, darker than the darkness, then slipped through an opening and moved to the side into a chamber. Beyond the opening Drizzt heard the unmistakable snarling voices of goblins.\u003c/p\u003e\n\u003cp\u003eDrizzt looked back to Regis, to the red dots that showed the halfling\u0027s heat-sensing infravision. Halflings, too, could see in the dark, but not nearly as well as drow or goblins. Drizzt held one hand up, motioned for Regis to wait in the corridor, then slipped ahead to the entrance.\u003c/p\u003e\n\u003cp\u003eThe goblins, at least six or seven, were huddled near the center of the small chamber, milling about many natural, toothlike pillars.\u003c/p\u003e\n\u003cp\u003eTo the right, along the wall, Drizzt sensed a slight movement and knew it was Guenhwyvar, patiently waiting for him to make the first move.\u003c/p\u003e\n\u003cp\u003eHow wondrous a fighting companion that panther was, Drizzt reminded himself. Always, Guenhwyvar let Drizzt determine the course of battle, then discerned the best way to fit in.\u003c/p\u003e\n\u003cp\u003eThe drow ranger moved to the nearest stalagmite, belly-crawled to another, and rolled behind yet another, ever closer to his prey. He made out nine goblins now, apparently discussing their best course of action.\u003c/p\u003e\n\u003cp\u003eThey had no guard posted, had no clue that danger was near.\u003c/p\u003e\n\u003cp\u003eOne rolled around to put its back against a stalagmite, separated from the others by a mere five feet. A scimitar sliced up through its belly, into its lungs before it could utter a sound.\u003c/p\u003e\n\u003cp\u003eEight remained.\u003c/p\u003e\n\u003cp\u003eDrizzt eased the corpse to the ground and took its place, putting his back to the stone.\u003c/p\u003e\n\u003cp\u003eA moment later, one of the goblins called to him, thinking he was the dead goblin. Drizzt grunted in reply. A hand reached around to pat his shoulder, and the drow couldn\u0027t hide his smile.\u003c/p\u003e\n\u003cp\u003eThe goblin tapped him once, then again, more slowly, then the thing began feeling around the drow\u0027s thick cloak, apparently noticing Drizzt\u0027s taller stature.\u003c/p\u003e\n\u003cp\u003eA curious expression on its ugly face, the goblin peeked around the mound.\u003c/p\u003e\n\u003cp\u003eThen there were seven, and Drizzt leaped out into their midst, scimitars flashing in a flurry that took the two nearest goblins down in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eThe remaining five shrieked and ran about, some colliding with stalagmites, others slapping and falling all over each other.\u003c/p\u003e\n\u003cp\u003eA goblin came straight for Drizzt, its mouth flapping a steady stream of undiscernible words and its hands held wide, as though in a gesture of friendship. Apparently the evil creature only then recognized this dark elf was no potential comrade, for it began to frantically back away. Drizzt\u0027s scimitars crossed in a downward slash, drawing an X of hot blood on the creature\u0027s chest.\u003c/p\u003e\n\u003cp\u003eGuenhwyvar streaked beside the drow and attacked a goblin fleeing toward the far side of the cavern. With a single swipe of the panther\u0027s huge claw, the count was down to three.\u003c/p\u003e\n\u003cp\u003eFinally, two goblins regained their senses enough to come at the drow in a coordinated fashion, weapons drawn. One launched its club in a roundhouse swing, but Drizzt slapped the weapon wide before it ever got close.\u003c/p\u003e\n\u003cp\u003eHis scimitar, the same he had used to deflect the blow, darted left, then right, left and right, and again a third time, leaving the stunned creature with six mortal wounds. It stared dumbfounded as it fell backward to the floor.\u003c/p\u003e\n\u003cp\u003eAll the while, Drizzt\u0027s second scimitar easily parried the other goblin\u0027s many desperate attacks.\u003c/p\u003e\n\u003cp\u003eWhen the drow turned to face this creature fully, it knew it was doomed. It hurled its short sword at Drizzt, again with little effect, and darted behind the nearest stone pillar.\u003c/p\u003e\n\u003cp\u003eThe last of the confused creatures crossed behind it, startling the drow, and securing the other\u0027s escape. Drizzt cursed the goblin\u0027s apparent luck. He wanted none to get away, but these two were, either wisely or fortunately, fleeing in opposite directions. A split second later, though, the drow heard a resounding crack from behind the pillar, and the goblin that had thrown its short sword toppled back out from behind the mound, its skull shattered.\u003c/p\u003e\n\u003cp\u003eRegis, holding his little mace, peeked around the pillar and shrugged.\u003c/p\u003e\n\u003cp\u003eDrizzt was at a loss and simply returned the stare, then spun about to pursue the remaining goblin, which was fast weaving its way around the cavern teeth toward a corridor at the chamber\u0027s far end.\u003c/p\u003e\n\u003cp\u003eThe drow, faster and more agile, gained steadily. He noticed Guenhwyvar, the panther\u0027s maw glowing hot with the blood of a fresh kill, loping along a parallel course and gaining on the goblin with every long stride. Drizzt was confident then that the creature had no chance of escape.\u003c/p\u003e\n\u003cp\u003eAt the corridor\u0027s entrance, the goblin jolted to a stop. Drizzt skidded aside, as did Guenhwyvar, both diving for the cover of pillars, as a series of snapping and sparking explosions ignited all about the goblin\u0027s body. It shrieked and jerked wildly, this way and that; pieces of its clothing and its flesh blew away.\u003c/p\u003e\n\u003cp\u003eThe continuing explosions held the goblin up long after it was dead. Finally, they ended and the creature fell to the floor, trailing thin lines of smoke from several dozen blasted wounds.\u003c/p\u003e\n\u003cp\u003eDrizzt and Guenhwyvar held steady, perfectly silent, not knowing what new monster had arrived.\u003c/p\u003e\n\u003cp\u003eThe chamber lit up suddenly with a magical light.\u003c/p\u003e\n\u003cp\u003eDrizzt, fighting hard to bring his eyes into focus, clutched his scimitars tightly.\u003c/p\u003e\n\u003cp\u003e\"All dead?\" he heard a familiar dwarven voice say. He blinked his eyes open just in time to see the cleric Cobble enter the room, one hand in a large belt pouch, the other holding a shield out before him.\u003c/p\u003e\n\u003cp\u003eSeveral soldiers came in behind, one of them muttering, \"Damn good spell, priest.\"\u003c/p\u003e\n\u003cp\u003eCobble moved to inspect the shattered body, then nodded his agreement. Drizzt slipped out from behind the mound.\u003c/p\u003e\n\u003cp\u003eThe surprised cleric\u0027s hand came whipping out, launching a score of small objects - pebbles? - at the draw. Guenhwyvar growled, Drizzt dove, and the pebbles hit the rock where he had been standing, initiating another burst of small explosions.\u003c/p\u003e\n\u003cp\u003e\"Drizzt!\" Cobble cried, realizing his mistake. \"Drizzt!\" He rushed to the drow, who was looking back to the many scorch marks on the floor.\u003c/p\u003e\n\u003cp\u003e\"Are you all right, dear Drizzt?\" Cobble cried.\u003c/p\u003e\n\u003cp\u003e\"Damn good spell, priest,\" Drizzt replied in his best imitation-dwarf voice, his .smile wide and admiring.\u003c/p\u003e\n\u003cp\u003eCobble clapped him hard on the back, nearly knocking him over. \"I like that one, too,\" he said, showing Drizzt that he had a pouch full of the bomblike pebbles. \"Ye want to carry some?\"\u003c/p\u003e\n\u003cp\u003e\"I do,\" replied Regis, coming around a stalagmite, closer to the tunnel entrance than Drizzt had been.\u003c/p\u003e\n\u003cp\u003eDrizzt blinked his lavender orbs in amazement at the halfling\u0027s prowess.\u003c/p\u003e\n\u003cp\u003eAnother force of goblins, more than a hundred strong, had been positioned in corridors to the right of the main chamber, to come in at the flank after the fighting had begun. With the trap\u0027s failure and Bruenor\u0027s ensuing charge (led by the horrible, silver-streaking arrows), the ettin force\u0027s miserable failure and Dagna\u0027s dwarven troops\u0027 subsequent arrival, even the stupid goblins had been wise enough to turn the other way and run.\u003c/p\u003e\n\u003cp\u003e\"Dwarfses,\" one of the front-running goblins cried out, and the others soon echoed him in calls that shifted from terror to hunger when the creatures came to believe they had stumbled on a small band of the bearded folk, perhaps a scouting party.\u003c/p\u003e\n\u003cp\u003eWhatever the case, these dwarves apparently had no intentions of stopping to fight, and the chase was on.\u003c/p\u003e\n\u003cp\u003eA few twists and turns put the fleeing dwarves and the goblins near a wide, smoothly worked, torchlit tunnel, one that had been cut by the dwarves of Mithril Hall several hundred years before.\u003c/p\u003e\n\u003cp\u003eFor the first time since that long-ago day, the dwarves were there again, waiting.\u003c/p\u003e\n\u003cp\u003ePowerful dwarven hands eased great disks onto a wooden beam, one after another until the whole resembled a solid, cylindrical wheel as tall as a dwarf and nearly as wide as the worked corridor, weighing well over a ton. Completing the structure\u0027s main frame were a few well-placed pegs, a wrapping of sheet metal (with sharp, nasty ridges hammered into it), and two notched handles that ran from the wheel\u0027s side to behind the contraption, where dwarves could man them and push the thing along.\u003c/p\u003e\n\u003cp\u003eA cloth with the full-sized likenesses of charging dwarves painted on it was hung out in front as a finishing touch that would keep the goblins in line until it was too late to retreat.\u003c/p\u003e\n\u003cp\u003e\"Here they come,\" one of the forward scouts reported, returning to the main battle group. \"They\u0027ll turn the corner in a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Are the baiters ready?\" asked the dwarf in charge of the toy brigade.\u003c/p\u003e\n\u003cp\u003eThe other dwarf nodded, and the haulers took up the poles, setting their hands firmly behind the appropriate notches. Four soldiers got out in front of the contraption, ready for their wild run, while the rest of the hundred-dwarf contingent fell into lines behind the haulers.\u003c/p\u003e\n\u003cp\u003e\"The cubbies are a hunnerd feet down,\" the boss dwarf reminded the lead soldiers. \"Don\u0027t ye miss the mark! Once we get this thing a-rolling, we\u0027re not likely to be stopping it!\"\u003c/p\u003e\n\u003cp\u003eFeigned cries of fear came from the fleeing dwarves at the other end of the long corridor, followed by the whooping of the pursuing goblins.\u003c/p\u003e\n\u003cp\u003eThe boss dwarf shook his bearded face; it was so easy to bait goblins. Just let them believe they had the upper hand, and on they\u0027d come.\u003c/p\u003e\n\u003cp\u003eThe lead soldiers began a slow trot, the haulers behind them took up the easy pace, and the army plodded along behind the thunder of the slow-rolling wheel.\u003c/p\u003e\n\u003cp\u003eAnother series of shouts sounded, and mixed in was the unmistakable cry of \"Now!\"\u003c/p\u003e\n\u003cp\u003eThe lead soldiers roared and broke into a run. The massive toy came right behind, pumping dwarven legs setting the devilish wheel into a great roll. Above the thunder, the dwarves began their growling song:\u003c/p\u003e\n\u003cp\u003eTunnel\u0027s too tight,\u003c/p\u003e\n\u003cp\u003eTunnel\u0027s too low,\u003c/p\u003e\n\u003cp\u003eBetter run goblin,\u003c/p\u003e\n\u003cp\u003e\u0027Cause here we go!\u003c/p\u003e\n\u003cp\u003eTheir charge sounded like an avalanche, rumbling undertones to the goblins\u0027 cries. The baiters waved to their approaching kin, then stopped beside the cubbies and turned to hurl insults at their goblin pursuers.\u003c/p\u003e\n\u003cp\u003eThe boss dwarf smiled grimly at the knowledge that he, that the toy, would pass the small alcoves, the only safe places in front of the contraption, a split second before the goblin hosts arrived there.\u003c/p\u003e\n\u003cp\u003eJust as the dwarves had planned.\u003c/p\u003e\n\u003cp\u003eWith no way to turn back, thinking that they had encountered a simple dwarven expedition, the long lines of goblins hooted their battle cries and continued their charge.\u003c/p\u003e\n\u003cp\u003eThe leading dwarven soldiers joined the baiters; together they dove aside into the alcoves, and the toy rumbled by, its disguising canopy making the front goblins slow their pace and wonder.\u003c/p\u003e\n\u003cp\u003eHowls of terror replaced battle cries and echoed down the goblin line. The closest goblin bravely hacked at the bouncing dwarven image, taking the painted canopy down and revealing the disaster an instant before the creature was squashed.\u003c/p\u003e\n\u003cp\u003eThe fearsome dwarves called their war toy, \"the juicer,\" and the puddle of goblin fluid that came out the back side of the crushing wheel showed it was a fitting title.\u003c/p\u003e\n\u003cp\u003e\"Sing, my dwarves!\" commanded the boss, and they took their chant to great crescendos, their rumbling voices echoing above the goblin howls.\u003c/p\u003e\n\u003cp\u003eEvery bump\u0027s a goblins head,\u003c/p\u003e\n\u003cp\u003ePools of blood from the goblin dead.\u003c/p\u003e\n\u003cp\u003eRun, good dwarves, push that toy,\u003c/p\u003e\n\u003cp\u003eSquish the little goblin boys!\u003c/p\u003e\n\u003cp\u003eThe brutal contraption bounced and bumped; the haulers stumbled on goblin piles. But if any dwarf fell away, a dozen more were ready to take up his part of the pole, powerful legs pumping feverishly.\u003c/p\u003e\n\u003cp\u003eThe army behind the contraption began to stretch out, dwarves stopping to finish off those broken goblins that still squirmed. The main host stayed close to the bouncing contraption, though, for as it came farther along the tunnel, it began to pass side tunnels. Predetermined brigades of dwarven soldiers turned down these, right behind the passing toy, slaughtering any goblins still in the area.\u003c/p\u003e\n\u003cp\u003e\"Tight turn!\" the boss dwarf yelled, and sparks flew from the side of the steel-covered outer stone wheels as they screeched along. The dwarves had counted on this region to stop the rolling monstrosity.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t, and around the bend loomed the end of the corridor, a dozen goblins scratching at the unyielding stone, trying to find escape.\u003c/p\u003e\n\u003cp\u003e\"Let it go!\" cried the boss, and the wild-rushing dwarves did, falling all over each other as they continued to bounce along.\u003c/p\u003e\n\u003cp\u003eWith a tremendous explosion that shook the bedrock, the juicer collided with the wall. It wasn\u0027t hard for the cheering dwarves to figure out what had happened to the unfortunate creatures caught in between.\u003c/p\u003e\n\u003cp\u003e\"Oh, good work!\" the boss dwarf said to his charges as he looked back around the bend to the long line of crushed goblins. The dwarven soldiers were still battling, but now they badly outnumbered their enemies, for more than half the goblin force had been squashed.\u003c/p\u003e\n\u003cp\u003e\"Good work!\" the boss reiterated heartily, and by a goblin-hating dwarf\u0027s estimation, it certainly was.\u003c/p\u003e\n\u003cp\u003eBack in the main chamber, Bruenor and Dagna exchanged victorious and wet hugs, \"sharing the blood of their enemies,\" as the brutal dwarves called it. A few dwarves had been killed and many others lay wounded, but neither of the leaders had dared to hope that the rout would be so complete.\u003c/p\u003e\n\u003cp\u003e\"What do ye think o\u0027 that, me girl?\" Bruenor asked Catti-brie when she came over to join him, her long bow comfortably over one shoulder.\u003c/p\u003e\n\u003cp\u003e\"We did as we had to do,\" the woman replied. \"And the goblins were, as expected, a treacherous bunch. But I\u0027ll not back down on me words. We did right in trying to talk first.\"\u003c/p\u003e\n\u003cp\u003eDagna spat on the floor, but Bruenor, the wiser of the two, nodded his agreement with his daughter.\u003c/p\u003e\n\u003cp\u003e\"Tempus!\" they heard Wulfgar cry in victory, and the barbarian, spotting the group, began bounding over to them, his mighty warhammer held high above his head.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still for thinking that ye\u0027re all taking a bit too much pleasure in it all,\" Catti-brie remarked to Bruenor. Apparently not wanting to talk with Wulfgar, she moved away, back to help the wounded.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" Bruenor snorted behind her. \"Suren ye set yer own bow to some sweet singing!\"\u003c/p\u003e\n\u003cp\u003eCatti-brie brushed her auburn locks out of her face and did not look back. She didn\u0027t want Bruenor to see her smile.\u003c/p\u003e\n\u003cp\u003eThe juicer brigade entered the main chamber a half hour later, reporting the right flank clear of goblins. Only a few minutes after them, Drizzt, Regis, and Guenhwyvar came in, the drow telling Bruenor that Cobble\u0027s forces were finishing up in the corridors to the left and the rear.\u003c/p\u003e\n\u003cp\u003e\"Did ye get a few for yerself?\" the dwarf asked. \"After the ettins, I mean?\"\u003c/p\u003e\n\u003cp\u003eDrizzt nodded. \"I did,\" he replied, \"as did Guenhwyvar ... and Regis.\" Both Drizzt and the dwarf turned curious eyes on the halfling, who stood easily, his bloodied mace in hand. Noticing the looks, Regis slipped the weapon behind his back as though he were embarrassed.\u003c/p\u003e\n\u003cp\u003e\"I did not even expect ye to come, Rumblebelly,\" Bruenor said to him. \"I thought ye\u0027d be staying up, helping yerself to more food, while the rest of us did all the fighting.\"\u003c/p\u003e\n\u003cp\u003eRegis shrugged. \"I figured that the safest place in all the world would be beside Drizzt,\" he explained.\u003c/p\u003e\n\u003cp\u003eBruenor wasn\u0027t about to argue with that logic. \"We can set to digging in a few weeks,\" he explained to his ranger friend. \"After some expeditionary miners come through and name the place safe.\"\u003c/p\u003e\n\u003cp\u003eBy this point, Drizzt was hardly listening to him. He was more interested in the fact that Catti-brie and Wulfgar, moving about the ranks of wounded, obviously were avoiding each other.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the boy,\" Bruenor told him, noticing his interest.\u003c/p\u003e\n\u003cp\u003e\"He did not think a woman should be at the battle,\" Drizzt replied.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" snorted the red-bearded dwarf. \"She\u0027s as fine a fighter as we\u0027ve got. Besides, five dozen dwarf women came along, and two of \u0027em even got killed.\"\u003c/p\u003e\n\u003cp\u003eDrizzt\u0027s face twisted with surprise as he regarded the dwarf king. He shook his white shock of hair helplessly and started away to join Catti-brie, but stopped and looked back after only a few steps, shaking his head yet again.\u003c/p\u003e\n\u003cp\u003e\"Five dozen of \u0027em,\" Bruenor reiterated into his doubting expression. \"Dwarf women, I tell ye.\"\u003c/p\u003e\n\u003cp\u003e\"My friend,\" Drizzt answered, moving off once more, \"I never could tell the difference.\"\u003c/p\u003e\n\u003cp\u003eCoble\u0027s forces joined the other dwarves two hours later, reporting rear areas clear of enemies. The rout was complete, as fare as Bruenor and his commanders could discern, with not a single enemy left alive.\u003c/p\u003e\n\u003cp\u003eNon of the dwarven forces had noticed the slender, dark forms- dark elves, Jarlaxle\u0027s spies\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;floating among the stalactites near critical areas of the battle, watching the dwarven movements and battle techniques with more than passive interest.\u003c/p\u003e\n\u003cp\u003eThe goblin threat was ended, but that was the least of Bruenor Battlehammer\u0027s problems. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-legacy-legacy-of-the-drow-1/page-5.html","bookId":2127,"creation":"Oct 5, 2019 6:06:18 PM","modification":"Oct 5, 2019 6:06:18 PM"}
