{"id":94063,"no":9,"title":"Page 9","content":"\u003cp\u003eBeads of glistening sweat rolled along the barbarian\u0027s sculpted arms; shadows of the flickering I hearth drew definitive lines along his biceps I and thick forearms, accentuating the enormous, corded muscles.\u003c/p\u003e\n\u003cp\u003eWith astounding ease, as though he were swinging a tool made for slender nails, Wulfgar brought a twenty-pound sledge down repeatedly on a metal shaft. Bits of molten iron flew with every ringing hit and spattered the walls and floor and the thick leather apron he wore, for the barbarian had carelessly overheated the metal. Blood surged in Wulfgar\u0027s great shoulders, but he did not blink and he did not tire. He was driven by the certainty that he had to work out the demon emotions that had grabbed his heart.\u003c/p\u003e\n\u003cp\u003eHe would find solace in exhaustion.\u003c/p\u003e\n\u003cp\u003eWulfgar had not worked the forge in years, not since Bruenor had released him from servitude back in Icewind Dale, a place, a life, that seemed a million miles removed.\u003c/p\u003e\n\u003cp\u003eWulfgar needed the iron now, needed the unthinking, instinctual pounding, the physical duress to overrule the confusing jumble of emotions that would not let him rest. The rhythmic banging forced his thoughts into a straight line pattern; he allowed himself to consider only a single complete thought between each interrupting bang.\u003c/p\u003e\n\u003cp\u003eHe wanted to resolve so many things this day, mostly to remind himself of those qualities that initially had drawn him to his soon-to-be bride. At each interval, though, the same image flashed to him: Aegis-fang twirling dangerously close to Drizzt\u0027s head.\u003c/p\u003e\n\u003cp\u003eHe had tried to kill his dearest friend.\u003c/p\u003e\n\u003cp\u003eWith suddenly renewed vigor, he sent the sledge pounding home on the metal and again sent lines of sparks flying throughout the small, private chamber.\u003c/p\u003e\n\u003cp\u003eWhat in the Nine Hells was happening to him?\u003c/p\u003e\n\u003cp\u003eAgain, the sparks flew wildly.\u003c/p\u003e\n\u003cp\u003eHow many times had Drizzt Do\u0027Urden saved him? How empty would his life have been without his ebon-skinned friend?\u003c/p\u003e\n\u003cp\u003eHe grunted as the hammer hit home.\u003c/p\u003e\n\u003cp\u003eBut the drow had kissed Catti-brie - Wulfgar\u0027s Catti-brie! - outside Mithril Hall on the day of his return!\u003c/p\u003e\n\u003cp\u003eWulfgar\u0027s breathing came in labored gasps, but his arm pumped fiercely, playing his fury through the smithy hammer. His eyes were closed as tightly as the hand that clenched the hammer; his muscles swelled with the strain.\u003c/p\u003e\n\u003cp\u003e\"That one for throwin\u0027 around corners?\" he heard a dwarf\u0027s voice ask.\u003c/p\u003e\n\u003cp\u003eWulfgar\u0027s eyes popped open and he spun about to see one of Bruenor\u0027s kinfolk shuffling past the partly opened doorway, the dwarf\u0027s laughter echoing as he made his way along the stone-worked corridor. When the barbarian looked back to his work, he understood the dwarf\u0027s mirth, for the metal spear he had been shaping was now badly bowed in the middle from the too-hard slams on the overheated metal.\u003c/p\u003e\n\u003cp\u003eWulfgar tossed the ruined shaft aside and let the hammer drop to the stone floor.\u003c/p\u003e\n\u003cp\u003e\"Why did you do it to me?\" he asked aloud, though, of course, Drizzt was too far away to hear him. His mind held a conjured image of Drizzt and his beloved Catti-brie embraced in a deep kiss, an image the beleaguered Wulfgar could not let go, even though he had not actually seen the two in the act.\u003c/p\u003e\n\u003cp\u003eHe wiped a hand across his sweaty brow, leaving a line of soot on his forehead, and slumped to a seat on the edge of a stone table. He hadn\u0027t expected things to become this complicated, hadn\u0027t anticipated Catti-brie\u0027s outrageous behavior. He thought of the first time he had seen his love, when she was barely more than a girl, skipping along the tunnels of the dwarven complex in Icewind Dale - carelessly skipping, as though all the ever-present dangers of that harsh region, and all the memories of the recent war against Wulfgar\u0027s people simply fell away from her delicate shoulders, bounced off her as surely as did her lustrous auburn tresses.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t take young Wulfgar long to understand that Catti-brie had captured his heart with that carefree dance. He had never met a woman like her; in his male-dominated tribe, women were virtual slaves, cowering to the often unreasonable demands of the menfolk. Barbarian women did not dare to question their men, certainly did not embarrass them, as Catti-brie had done to Wulfgar when he had insisted that she not accompany the force sent to parley with the goblin tribe.\u003c/p\u003e\n\u003cp\u003eWulfgar was wise enough now to admit his own shortcomings, and he felt a fool for the way he had spoken to Catti-brie. Still, there remained in the barbarian a need for a woman - a wife - that he could protect, a wife that would allow him his rightful place as a man.\u003c/p\u003e\n\u003cp\u003eThings had become so very complicated, and then, just to make matters worse, Catti-brie, his Catti-brie, had shared a kiss with Drizzt Do\u0027Urden!\u003c/p\u003e\n\u003cp\u003eWulfgar bounced up from his seat and rushed to retrieve the hammer, knowing that he would spend many more hours at the forge, many more hours transferring the rage from his knotted muscles to the metal. For the metal had yielded to him as Catti-brie would not, had complied to the undeniable call of his heavy hammer.\u003c/p\u003e\n\u003cp\u003eWulfgar sent the hammer down with all his might, and a newly heated metal bar shuddered with the impact. Pong Sparks whipped across Wulfgar\u0027s high cheekbones, one nipping at the edge of his eye.\u003c/p\u003e\n\u003cp\u003eBlood surging, muscles corded, Wulfgar felt no pain.\u003c/p\u003e\n\u003cp\u003e\"Put up the torch,\" the drow whispered.\u003c/p\u003e\n\u003cp\u003e\"Light will alert our enemies,\" Regis argued in similarly hushed tones.\u003c/p\u003e\n\u003cp\u003eThey heard a growl, low and echoing, down the corridor.\u003c/p\u003e\n\u003cp\u003e\"The torch,\" Drizzt instructed, handing Regis a small tinderbox. \"Wait here with the light. Guenhwyvar and I will circle about.\"\u003c/p\u003e\n\u003cp\u003e\"Now I am bait?\" the halfling asked.\u003c/p\u003e\n\u003cp\u003eDrizzt, his senses tuned outward for signs of danger, did not hear the question. One scimitar drawn, Twinkle and its telltale glow waiting poised in its sheath, he slipped silently ahead and disappeared into the gloom.\u003c/p\u003e\n\u003cp\u003eRegis, still grumbling, struck flint to steel and soon had the torch blazing. Drizzt was out of sight.\u003c/p\u003e\n\u003cp\u003eA growl spun the halfling about, mace at the ready, but it was only Guenhwyvar, ever alert, doubling back down a side passage. The panther padded past the halfling, following Drizzt\u0027s course, and Regis quickly shuffled behind, though he could not hope to keep pace with the beast.\u003c/p\u003e\n\u003cp\u003eHe was alone again in seconds, his torch casting elongated, ominous shadows along the uneven walls. His back to the stone, Regis inched on, as quiet as death.\u003c/p\u003e\n\u003cp\u003eThe black mouth of a side passage loomed just a few feel away. The halfling continued walking, holding the torch straight out behind him, his mace leading the way. He sensed a presence around that corner, something inching up to the edge at him from the other direction.\u003c/p\u003e\n\u003cp\u003eRegis carefully laid the torch on the stone and brought his mace in close to his chest, gently sliding his feet to perfectly balance his weight.\u003c/p\u003e\n\u003cp\u003eHe went around the corner in a blinding rush, chopping with the mace. Something blue flashed to intercept; then came the ring of metal on metal. Regis instantly brought his weapon back and sent it whipping in sidelong, lower.\u003c/p\u003e\n\u003cp\u003eAgain came the distinctive ring of a parry.\u003c/p\u003e\n\u003cp\u003eOut came the mace, and back in, deftly along the same course. The halfling\u0027s skilled adversary was not fooled though, and the blocking blade was still in place.\u003c/p\u003e\n\u003cp\u003e\"Regis!\"\u003c/p\u003e\n\u003cp\u003eThe mace twirled above the halfling\u0027s head, ready to dart ahead, but Regis swung it down at arm\u0027s length instead, suddenly recognizing the voice.\u003c/p\u003e\n\u003cp\u003e\"I told you to remain back there with the light,\" Drizzt scolded him, stepping out of the shadow. \"You are fortunate I did not kill you.\"\u003c/p\u003e\n\u003cp\u003e\"Or that I did not kill you,\" Regis replied without missing a beat, and his calm, cold tone made Drizzt\u0027s face contort with surprise. \"Have you found anything?\" the halfling asked.\u003c/p\u003e\n\u003cp\u003eDrizzt shook his head. \"We are close,\" he replied quietly \"Both Guenhwyvar and I are certain of that.\"\u003c/p\u003e\n\u003cp\u003eRegis walked over and picked up his torch, then tucked his mace into his belt, within easy reach.\u003c/p\u003e\n\u003cp\u003eGuenhwyvar\u0027s sudden growl echoed at them from farther down the long corridor, launching them both into a run. \"Don\u0027t leave me behind!\" Regis demanded, and he grabbed hold of Drizzt\u0027s cloak and would not let go, his furry feet skipping, jumping, even skidding along as he tried to keep pace.\u003c/p\u003e\n\u003cp\u003eDrizzt slowed when Guenhwyvar\u0027s yellow-green, glassy eyes reflected back at him from just beyond the leading edge of the torchlight, at a corner where the passageway turned sharply.\u003c/p\u003e\n\u003cp\u003e\"I think we found the dwarves,\" Regis muttered grimly. He handed Drizzt the torch and let go of the cloak, following the drow up to the bend.\u003c/p\u003e\n\u003cp\u003eDrizzt peeked around - Regis saw him wince - then brought the torch into the open, casting light on the dreadful scene.\u003c/p\u003e\n\u003cp\u003eThey had indeed found the missing dwarves, sliced and slaughtered, some lying, some propped against the walls at irregular intervals along a short expanse of worked stone corridor.\u003c/p\u003e\n\u003cp\u003e\"If ye\u0027re not for wearing the apron, then don\u0027t ye be wearing it!\" Bruenor said in frustration. Catti-brie nodded, finally hearing the concession she had wanted from the beginning.\u003c/p\u003e\n\u003cp\u003e\"But, me king,...\" protested Cobble, the only other one in the private chamber with Bruenor and Catti-brie. Both he and Bruenor sported severe holy water headaches.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" the dwarf king snorted to silence the good-intentioned cleric. \"Ye\u0027re not knowing me girl as well as meself. If she\u0027s saying she won\u0027t be wearing it, then all the giants o\u0027 the Spine of the World couldn\u0027t be changing her mind.\"\u003c/p\u003e\n\u003cp\u003e\"Bah yerself!\" came an unexpected call from outside the room, followed by a tremendous knock. \"I know ye\u0027re in there, Bruenor Battlehammer, who calls himself king o\u0027 Mithril Hall! Now be opening yer door and meet your better!\"\u003c/p\u003e\n\u003cp\u003e\"Do we know that voice?\" asked Cobble, he and Bruenor exchanging confused glances.\u003c/p\u003e\n\u003cp\u003e\"Open it, says me!\" came another cry, followed by a sharp rap. Wood splintered as a glove nail, a large spike set into the face of a specially constructed metal gauntlet, wedged itself through the thick door.\u003c/p\u003e\n\u003cp\u003e\"Aw, sandstone,\" came a quieter call.\u003c/p\u003e\n\u003cp\u003eBruenor and Cobble looked to each other in disbelief. \"No,\" they said in unison, wagging their heads back and forth.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Catti-brie asked, growing impatient.\u003c/p\u003e\n\u003cp\u003e\"It cannot be,\" Cobble replied, and it seemed to the young woman that he hoped with all his heart that his words were true.\u003c/p\u003e\n\u003cp\u003eA grunt signaled that the creature beyond the door had finally extracted his spike.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Catti-brie demanded of her father, her hands planted squarely on her hips.\u003c/p\u003e\n\u003cp\u003eThe door burst open, and there stood the most curious-looking dwarf Catti-brie had ever seen. He wore a spiked steel gauntlet, open-fingered, on each hand, had similar spikes protruding from his elbows, knees, and the toes of his heavy boots, and wore armor (custom-fitted to his short, barrellike form) of parallel, horizontal metal ridges half an inch apart and ringing his body from neck to midhigh and his arms from shoulder to forearm. His gray helmet was open-faced, with thick leather straps disappearing under his monstrous black beard, and sported a gleaming spike atop it, nearly half again as tall as the four-foot-high dwarf.\u003c/p\u003e\n\u003cp\u003e\"It,\" Bruenor answered, his tone reflecting his obvious disdain, \"is a battlerager.\"\u003c/p\u003e\n\u003cp\u003e\"Not just \u0027a battlerager\" the curious, black-bearded dwarf put in. \"The battlerager! The most wild battlerager!\" He walked toward Catti-brie and smiled widely with his hand extended toward her. His armor, with every movement, issued grating, scraping noises that made the young woman\u0027s hair stand straight up on the back of her neck.\u003c/p\u003e\n\u003cp\u003e\"Thibbledorf Pwent at yer service, me good lady!\" the dwarf introduced himself grandly. \"First fighter o\u0027 Mithril Hall. Yerself must be this Catti-brie I\u0027ve heared so much tell of back in Adbar. Bruenor\u0027s human daughter, so they telled me, though still I\u0027m a bit shaken at seeing any Battle-hammer woman without a beard to tickle her toes!\"\u003c/p\u003e\n\u003cp\u003eThe smell of the creature nearly overwhelmed Catti-brie. Had he taken that armor off anytime this century? she had to wonder. \"I\u0027ll try to grow one,\" she promised.\u003c/p\u003e\n\u003cp\u003e\"See that ye do! See that ye do!\" Thibbledorf hooted, and he hopped over to stand before Bruenor, the noise of his armor scraping at the marrow of Catti-brie\u0027s bones.\u003c/p\u003e\n\u003cp\u003e\"Me king!\" Thibbledorf bellowed. He fell to a bow - and nearly halved Bruenor\u0027s long, pointy nose with his helmet spike as he did.\u003c/p\u003e\n\u003cp\u003e\"What in the Nine Hells is yerself doing here?\" Bruenor demanded.\u003c/p\u003e\n\u003cp\u003e\"Alive, anyway,\" Cobble added, then he returned Bruenor\u0027s incredulous stare with a helpless shrug.\u003c/p\u003e\n\u003cp\u003e\"It was me belief that ye fell when the dragon Shimmer-gloom took the lower halls,\" Bruenor went on.\u003c/p\u003e\n\u003cp\u003e\"His breath was death!\" Thibbledorf shouted.\u003c/p\u003e\n\u003cp\u003eLook who\u0027s talking, Catti-brie thought, but she kept silent.\u003c/p\u003e\n\u003cp\u003ePwent roared on, dramatically waving his arms about and turning a spin on the floor, his eyes staring at nothing in particular, as though he was recalling a scene from his distant past. \"Evil breath. A deep blackness that fell over me and stole the strength from me bones.\u003c/p\u003e\n\u003cp\u003e\"But I got out and got away!\" Thibbledorf cried suddenly, spinning at Catti-brie, one stubby finger pointing her way. \"Out a secret door in the lower tunnels. Even the likes o\u0027 that dragon couldn\u0027t stop the Pwent!\"\u003c/p\u003e\n\u003cp\u003e\"We held the halls for two more days afore Shimmer-gloom\u0027s minions drove us into Keeper\u0027s Dale,\" Bruenor put in. \"I heared no words o\u0027 yer return to fight beside me father and his father, the then king o\u0027 Mithril Hall.\"\u003c/p\u003e\n\u003cp\u003e\"It was a week afore I got me strength back and got back around the mountain passes to the western door,\" Pwent explained. \"By then the halls were lost.\u003c/p\u003e\n\u003cp\u003e\"Sometime later,\" Pwent continued, parting his impossibly thick beard with one of his glove nails, \"I heared that a bunch of the younger folk, yerself included, had gone to the west. Some said ye were to work the mines o\u0027 Mirabar, but when I got there, I heared not a word.\"\u003c/p\u003e\n\u003cp\u003e\"Two hunnerd years!\" Bruenor growled in Pwenfs face, stealing his seemingly perpetual smile. \"Ye had two hunnerd years to find us, but not once did we hear a word that ye was even alive.\"\u003c/p\u003e\n\u003cp\u003e\"I came back to the east,\" Pwent explained easily. \"Been living - living well, doing mercenary work, mostly - in Sundabar and for King Harbromme of Citadel Adbar. It was back there, three weeks past - I\u0027d been off to the south for some time, ye see - that I first heared o\u0027 yer return, that a Battlehammer had taken back the halls!\u003c/p\u003e\n\u003cp\u003e\"So here I be, me king,\" he said, dipping to one knee. \"Point me at yer enemies.\" He gave Catti-brie a garish wink and poked a dirty, stubby finger toward the tip of his helmet spike.\u003c/p\u003e\n\u003cp\u003e\"Most wild?\" Bruenor asked, somewhat derisively.\u003c/p\u003e\n\u003cp\u003e\"Always been,\" Thibbledorf replied.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call ye an escort,\" Bruenor said, \"so ye can get yerself a bath and a meal.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take the meal,\" Pwent replied. \"Keep yer bath and yer escort. I know me way around these old halls as well as yerself, Bruenor Battlehammer. Better, I say, since ye was but a stubble-chinned dwarfling when we was pushed out.\" He put his hand out to pinch Bruenor\u0027s chin and had it promptly slapped away. His shrieking laughter like a hawk\u0027s cry, his armor squealing like talons on slate, the battlerager stomped away.\u003c/p\u003e\n\u003cp\u003e\"Pleasant sort,\" Catti-brie remarked.\u003c/p\u003e\n\u003cp\u003e\"Pwent alive,\" Cobble mused, and Catti-brie could not tell if that was good news or not.\u003c/p\u003e\n\u003cp\u003e\"Ye\u0027ve never once mentioned that one,\" Catti-brie said to Bruenor.\u003c/p\u003e\n\u003cp\u003e\"Trust me, girl,\" Bruenor replied. \"That one\u0027s not worth mentioning.\"\u003c/p\u003e\n\u003cp\u003eExhausted, the barbarian fell onto his cot and sought some needed sleep. He felt the dream returning before he had even closed his eyes. He bolted upright, not wanting to see again the images of his Catti-brie entwined with the likes of Drizzt Do\u0027Urden.\u003c/p\u003e\n\u003cp\u003eThey came to him anyway.\u003c/p\u003e\n\u003cp\u003eHe saw a thousand sparkles, a million reflected fires, spiraling downward, inviting him along.\u003c/p\u003e\n\u003cp\u003eWulfgar growled defiantly and tried to stand. It took him several moments to realize that the attempt had been futile, that he was still on his cot, and that he was descending, following the undeniable trail of glittering sparkles down to the images.\u003c/p\u003e\n\u003cp\u003eCobble\u0027s forces joined the other dwarves two hours later, reporting the rear areas clear of enemies. The rout was complete, as far as Bruenor and his commanders could discern, with not a single enemy left alive.\u003c/p\u003e\n\u003cp\u003eNone of the dwarven forces had noticed the slender, dark forms - dark elves, Jarlaxle\u0027s spies - floating among the stalactites near critical areas of battle, watching the dwarven movements and battle techniques with more than passing interest.\u003c/p\u003e\n\u003cp\u003eThe goblin threat was ended, but that was the least of Bruenor Battlehammer\u0027s problems. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-legacy-legacy-of-the-drow-1/page-9.html","bookId":2127,"creation":"Oct 5, 2019 6:06:18 PM","modification":"Oct 5, 2019 6:06:18 PM"}
