{"id":90085,"no":22,"title":"Page 22","content":"\u003cp\u003eI shouldn\u0027t have been surprised when I awoke to sunshine and an empty bed, but I was.\u003c/p\u003e\n\u003cp\u003eI\u0027d suspected Adam of being a vampire, a foolish thought in the bright light of day. However, in the bright light of day, he was also gone again.\u003c/p\u003e\n\u003cp\u003ePerhaps the crucifix test was as worthless as the zombie-revealing powder. Although maybe the zombie-revealing powder worked just fine - on an actual zombie.\u003c/p\u003e\n\u003cp\u003eA thought tickled the edge of my mind. Adam had told me I should wear a silver fleur-de-lis chain. Two birds, one stone.\u003c/p\u003e\n\u003cp\u003eFor a guy who was skeptical about vampires, werewolves, and zombies he had an awful lot of paranormal advice to give.\u003c/p\u003e\n\u003cp\u003eI threw on some clothes, didn\u0027t bother with coffee, going directly to the books Cassandra had lent me. Maybe I\u0027d been barking up the wrong tree after all. Pardon the horrible pun.\u003c/p\u003e\n\u003cp\u003eI flipped through one, found nothing. A second yielded the same result as the third. But the fourth -\u003c/p\u003e\n\u003cp\u003e\"Bingo,\" I whispered as the book fell open to an entire chapter on werewolves.\u003c/p\u003e\n\u003cp\u003eWhy is everything always in the last place we look?\u003c/p\u003e\n\u003cp\u003eWerewolves and vampires are alike in that they are both created by the bite of one similarly afflicted. A vampire can take the form of a wolf, and a werewolf can take the form of a human. However, silver will not harm a vampire and a crucifix will not harm a werewolf.\u003c/p\u003e\n\u003cp\u003e\"One stone,\" I muttered, and kept reading.\u003c/p\u003e\n\u003cp\u003eIf a werewolf is touched by silver, fire results.\u003c/p\u003e\n\u003cp\u003eI paused, remembering Cassandra\u0027s knife and the smoke that had risen from Arianna Beasly\u0027s arm. Had that knife been silver? I wouldn\u0027t be surprised.\u003c/p\u003e\n\u003cp\u003eIf shot with a silver bullet, a werewolf will burst into flames.\u003c/p\u003e\n\u003cp\u003e\"I guess we had our vampires and our werewolves all mixed up.\"\u003c/p\u003e\n\u003cp\u003eBut someone didn\u0027t.\u003c/p\u003e\n\u003cp\u003eBoth the person who\u0027d saved us last night and the dead man in the swamp who\u0027d come to New Orleans carrying an automatic rifle and silver bullets.\u003c/p\u003e\n\u003cp\u003eHad Detective Sullivan ever discovered the identity of his strangled swamp victim? If Sullivan had, the information might lead me to the second silver bullet-shooting believer. I really wanted to talk to that person.\u003c/p\u003e\n\u003cp\u003eI pulled out my cell phone and saw several messages from Frank. I\u0027d almost forgotten I was working for the man.\u003c/p\u003e\n\u003cp\u003eDetective Sullivan wasn\u0027t at his desk, so I left a message, then dialed my boss.\u003c/p\u003e\n\u003cp\u003e\"Diana?\" He must have caller ED. \"Did you capture it?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, not yet.\"\u003c/p\u003e\n\u003cp\u003eHis sigh was both annoyed and disappointed. \"I expected better of you.\"\u003c/p\u003e\n\u003cp\u003eNow I was annoyed. Tin doing the best that I can.\"\u003c/p\u003e\n\u003cp\u003e\"Do better. I need that loup-garou.\"\u003c/p\u003e\n\u003cp\u003eThere was that word again.\u003c/p\u003e\n\u003cp\u003e\"Why do you need it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027m paying you for. I hate to waste money.\"\u003c/p\u003e\n\u003cp\u003e\"What are you going to do with a werewolf if you get one?\"\u003c/p\u003e\n\u003cp\u003e\"Werewolf?\" Both surprise and delight lightened his voice. \"You told me there was no such thing. What have you seen to change your mind?\"\u003c/p\u003e\n\u003cp\u003eI hesitated. There was something in the swamp - but was it the same something walking the streets of New Orleans?\u003c/p\u003e\n\u003cp\u003e\"Diana? Tell me.\"\u003c/p\u003e\n\u003cp\u003eFrank\u0027s tension, his urgency, communicated itself over the miles. Not for the first time did I wonder if he were playing with a full deck. But since he was, as he\u0027d so rudely pointed out, paying me, I told him what I knew.\u003c/p\u003e\n\u003cp\u003e\"Disappearances, deaths, walking dead, silver bullets,\" he mused. \"How can you doubt what you\u0027ve seen?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t seen a wolf.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t tell him about my dream of the beast with Adam\u0027s eyes or about Simon. My dreams were none of Frank\u0027s business.\u003c/p\u003e\n\u003cp\u003e\"You will,\" he murmured. \"Then make sure you capture the loup-garou alive.\"\u003c/p\u003e\n\u003cp\u003e\"I hadn\u0027t planned on killing him. Her. It. A dead cryptid won\u0027t help my reputation or Simon\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Frank cleared his throat \"Is there anything else you need?\"\u003c/p\u003e\n\u003cp\u003eI\u0027d planned to ask for a motion sensor camera, but considering the invisible nature of werewolves on film, such a request would no longer do me any good.\u003c/p\u003e\n\u003cp\u003eThat werewolves couldn\u0027t be photographed was an interesting factoid and could explain why there wasn\u0027t much evidence on them. Cryptozoologists are often sent to investigate a photo, which leads to the real thing. But without that picture, no investigation.\u003c/p\u003e\n\u003cp\u003eMy heart danced with excitement that I might be the first scientist to prove the existence of a werewolf.\u003c/p\u003e\n\u003cp\u003e\"A cage,\" I said. \"And a tranquilizer gun. I\u0027ll need the dosage of the darts based on the size of a large male timber wolf. About a hundred and twenty pounds.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Alaskan size.\"\u003c/p\u003e\n\u003cp\u003eFrank knew a lot about wolves. In the lower U.S. eighty pounds was considered big. But considering the tracks I\u0027d seen, the feeling I had, what I was after was one damn big wolf.\u003c/p\u003e\n\u003cp\u003e\"Just do it, Frank.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"Also several portable tree stands. The kind deer hunters use. Black. Metal.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d never gone deer hunting myself and neither had Simon, but we\u0027d studied the best techniques. There aren\u0027t too many animals on earth more easily spooked than a deer. Those who stalked them knew what they were doing, and they always had the best gadgets.\u003c/p\u003e\n\u003cp\u003e\"Should I send everything to the Ruelle Mansion again?\" Frank asked.\u003c/p\u003e\n\u003cp\u003e\"That would be great.\"\u003c/p\u003e\n\u003cp\u003eA momentary silence came over the line; then Frank blurted, \"Have you seen him?\"\u003c/p\u003e\n\u003cp\u003eI\u0027d done a lot more than see Adam, but that wasn\u0027t Frank\u0027s business, either.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\u0027I did some asking around. You\u0027d do best to stay out of his way if you can. He\u0027s a dangerous man.\"\u003c/p\u003e\n\u003cp\u003e\"Dangerous how?\"\u003c/p\u003e\n\u003cp\u003e\"He was trained to kill in the army.\"\u003c/p\u003e\n\u003cp\u003e\u0027Isn\u0027t that what the army does?\"\u003c/p\u003e\n\u003cp\u003e\"Not like this. He\u0027s some uberwarrior. I couldn\u0027t even buy information on what it was that he did.\"\u003c/p\u003e\n\u003cp\u003eOh, no, the government wouldn\u0027t sell info on their top-secret soldiers; what was the world coming to?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be fine,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Stay away from him.\"\u003c/p\u003e\n\u003cp\u003eI doubted that I could. It might be just sex, but it was great sex, and I wasn\u0027t giving that up.\u003c/p\u003e\n\u003cp\u003eAs Frank said good-bye, I considered the unknown man who bad died in the swamp - the one who\u0027d been strangled with someone\u0027s bare hands. Then I thought of Adam\u0027s hands, and I wondered: Would he strangle me one night?\u003c/p\u003e\n\u003cp\u003eI shook off the question. What possible reason could Adam Ruelle have for killing me? What reason could he have for killing anyone?\u003c/p\u003e\n\u003cp\u003eThe mystery man had possessed an illegal rifle with silver bullets. He\u0027d obviously been hunting a werewolf. So why had he been killed by a man? A loup-garou had so many better weapons at its disposal than fingers.\u003c/p\u003e\n\u003cp\u003eI opened one of Cassandra\u0027s books and then another. A few minutes later I found what I was looking for\u003c/p\u003e\n\u003cp\u003eA werewolf can only remain a wolf under the light of the moon. Once the sun breaks the horizon, a lycanthrope becomes human. The beast has no choice.\u003c/p\u003e\n\u003cp\u003eThe information in the book gave me a scenario. Wolf becomes man under the morning sun, and he has nothing with which to defend himself except -\u003c/p\u003e\n\u003cp\u003e\"Hands.\"\u003c/p\u003e\n\u003cp\u003eSuch thoughts made me uneasy. Because if it followed that the stranger had been murdered by someone capable of doing the deed with his bare hands, and the only someone around here of that nature was Adam, didn\u0027t it follow that Adam might be a werewolf?\u003c/p\u003e\n\u003cp\u003e\"Well, you thought he was a vampire, what the hell?\"\u003c/p\u003e\n\u003cp\u003eI had a headache.\u003c/p\u003e\n\u003cp\u003eI decided to go to town, beg a shower, some coffee - or tea, ack - and any food that Cassandra had. Considering my previous ineptitude at making friends, I should feel uncomfortable inviting myself over. But I knew Cassandra would welcome me gladly, as I\u0027d welcome her. Chasing zombies, being confronted by werewolves, and nearly dying in a cemetery made fast friends. Which was probably why I had so few.\u003c/p\u003e\n\u003cp\u003eI reached New Orleans in record time and practically ran into the voodoo shop. Lazarus slithered down the center aisle and stuck his tongue out at me.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" I shouted. \"You wanna corral the reptile?\"\u003c/p\u003e\n\u003cp\u003eThe snake hissed.\u003c/p\u003e\n\u003cp\u003e\"Well, you are.\"\u003c/p\u003e\n\u003cp\u003e\"Insults will only get you in trouble.\" Cassandra scooped up Lazarus and popped him back in the cage.\u003c/p\u003e\n\u003cp\u003eI\u0027d expected her to have a spectacular black eye after Mrs. Beasly\u0027s attack, but I could only discern a faint tinge of blue beneath an impressive makeup job. I suppose having a shiner would not be good for business.\u003c/p\u003e\n\u003cp\u003e\"Why is being called a reptile an insult?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"He thinks he\u0027s a loa.\"\u003c/p\u003e\n\u003cp\u003e\"I know I\u0027m not going to want to hear the answer, but what\u0027s a loa?\"\u003c/p\u003e\n\u003cp\u003eShe turned from the cage with a soft smile. \"You know that vodoun is a religion.\"\u003c/p\u003e\n\u003cp\u003e\"Vodoun?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what practitioners prefer to call voodoo.\"\u003c/p\u003e\n\u003cp\u003e\"Oops.\" I lifted one shoulder. \"Sorry.\"\u003c/p\u003e\n\u003cp\u003e\"No biggie. The word means spirit or deity in the language of what\u0027s now Nigeria. The gods of vodoun are called loas.\"\u003c/p\u003e\n\u003cp\u003eI glanced uneasily at Lazarus. \"He thinks he\u0027s a god?\"\u003c/p\u003e\n\u003cp\u003e\"As much as he can think.\"\u003c/p\u003e\n\u003cp\u003eWhich I happened to believe wasn\u0027t much, but he was her snake.\u003c/p\u003e\n\u003cp\u003e\"What brings you here so bright and early?\" Cassandra asked.\u003c/p\u003e\n\u003cp\u003e\"Desperation.\"\u003c/p\u003e\n\u003cp\u003eHer eyes went shrewd. \"We\u0027re dealing with vampires?\"\u003c/p\u003e\n\u003cp\u003eI opened my mouth, shut it again. So much had happened since I\u0027d left here the last time.\u003c/p\u003e\n\u003cp\u003e\"I meant I was desperate for a shower.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, sure. Help yourself.\" She held up a hand as I moved toward the back of the shop. \"First, tell me what you found.\"\u003c/p\u003e\n\u003cp\u003eSince the reward was hot water and soap, I did.\u003c/p\u003e\n\u003cp\u003e\"You think we were dealing with werewolves, not zombies or vampires?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Was that knife silver?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eI tilted my head. Of course? \"Aren\u0027t those a little rare?\"\u003c/p\u003e\n\u003cp\u003e\"Not in my world,\" she said. \"I\u0027ve learned it never hurts to pack the very best.\"\u003c/p\u003e\n\u003cp\u003eConsidering what happened at the cemetery, I had to agree.\u003c/p\u003e\n\u003cp\u003e\"You think Ruelle\u0027s one of them?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t decide.\"\u003c/p\u003e\n\u003cp\u003e\"What do you know about his background?\"\u003c/p\u003e\n\u003cp\u003e\"I never told you what I learned from Mrs. Beasly?\"\u003c/p\u003e\n\u003cp\u003e\"Before she rose from the dead, then exploded?\"\u003c/p\u003e\n\u003cp\u003eI gave Cassandra a long look.\u003c/p\u003e\n\u003cp\u003e\"Stupid question. Go on.\"\u003c/p\u003e\n\u003cp\u003e\"The Ruelle women haven\u0027t birthed a girl in over a hundred years.\"\u003c/p\u003e\n\u003cp\u003e\"OK. Big whoop.\"\u003c/p\u003e\n\u003cp\u003e\"Adam\u0027s dad and his grandfather killed themselves.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a bigger whoop.\" She frowned. \"I don\u0027t like it\"\u003c/p\u003e\n\u003cp\u003e\"I doubt they liked it much, either.\"\u003c/p\u003e\n\u003cp\u003e\"The Ruelles could be the cursed family of legend. They\u0027ve been in New Orleans for centuries. I bet they had slaves at one time.\"\u003c/p\u003e\n\u003cp\u003e\"If they\u0027re werewolves, how can they kill themselves?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, how can they?\"\u003c/p\u003e\n\u003cp\u003e\"I mean, aren\u0027t they immortal?\"\u003c/p\u003e\n\u003cp\u003e\"Immortal doesn\u0027t mean what it used to.\" I gave her another look, and she explained. \"Vampires can be killed by sunlight, stake through the heart. Werewolves by silver. That\u0027s not immortal. Not really.\"\u003c/p\u003e\n\u003cp\u003e\"I see your point.\"\u003c/p\u003e\n\u003cp\u003e\"How did the Ruelles die?\"\u003c/p\u003e\n\u003cp\u003e\"Blew their brains out\"\u003c/p\u003e\n\u003cp\u003e\"With silver?\"\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t get that specific in the newspaper accounts.\"\u003c/p\u003e\n\u003cp\u003e\u0027I suppose not. We might be able to get our hands on the autopsy reports.\" She went silent for several seconds. \"Mrs. Beasly told you this stuff and the next thing we know she\u0027s climbing out of the family crypt drooling and snarling.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty much.\"\u003c/p\u003e\n\u003cp\u003e\"I think we should talk to the Favreau family.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re right.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-crescent-moon-nightcreature-4/page-22.html","bookId":2091,"creation":"Oct 5, 2019 5:40:32 PM","modification":"Oct 5, 2019 5:40:32 PM"}
