{"id":90090,"no":27,"title":"Page 27","content":"\u003cp\u003eDeesse de la lune.\u003c/p\u003e\n\u003cp\u003eThe words whispered through my mind. I\u0027d heard them before. Now I heard them in Adam\u0027s voice.\u003c/p\u003e\n\u003cp\u003eI fought the heavy veil of sleep, tried to surface, to see. Who was speaking? What had they said and why?\u003c/p\u003e\n\u003cp\u003eBursting awake as if coming from the depths of a rolling ocean and into a silent night, I found myself alone. I glanced toward the window, but nothing was there.\u003c/p\u003e\n\u003cp\u003e\"A dream,\" I murmured.\u003c/p\u003e\n\u003cp\u003eI was so sick of dreams.\u003c/p\u003e\n\u003cp\u003eThe room was dark; the moon had disappeared and the sun hadn\u0027t yet arisen. A secret, lonely hour, which wasn\u0027t night or day or even dawn.\u003c/p\u003e\n\u003cp\u003eThe front door closed. Before I even knew what I was doing, I jumped out of bed and pulled on my clothes. Or what was left of them. My tank top was shredded, so I helped myself to one of Adam\u0027s, but my breasts tumbled out the armholes, since he\u0027d shredded my bra while he was at it.\u003c/p\u003e\n\u003cp\u003eWhat had been incredibly sexy last night was merely an annoyance now. I mumbled curses as I found a T-shirt that might have been white once but was now kind of gray, and tugged it over my head.\u003c/p\u003e\n\u003cp\u003eA quick glance out the window revealed Adam slipping through the shadows and into the tall grass.\u003c/p\u003e\n\u003cp\u003eThis was his place. Where was he going?\u003c/p\u003e\n\u003cp\u003eTime to find out. I raced through the house and out the front door.\u003c/p\u003e\n\u003cp\u003eDid I actually believe I\u0027d be able to follow him through the swamp without his knowing I was there? He\u0027d lived here all his life, and while I\u0027d spent a lot of time in some very odd places, I wasn\u0027t exactly the invisible woman. Nevertheless, I had to try.\u003c/p\u003e\n\u003cp\u003eHead down, he barely looked where he was going as he meandered through the weeds and the standing water. Was he thinking of me? Or the us that could never be? What about the us that might be? Did I dare tell him I wanted to try for more, or would that scare him off for good?\u003c/p\u003e\n\u003cp\u003eConsidering I\u0027d never woken in the daylight with him by my side, no matter what we\u0027d shared in the night, scaring him off wasn\u0027t hard. Why worry about it now?\u003c/p\u003e\n\u003cp\u003eDawn broke, spilling muted sunshine across the land. There was a chill to the morning, but soon the heat would rise. Ahead tires roared across pavement; a horn tooted. I glanced around, uncertain where I was.\u003c/p\u003e\n\u003cp\u003eAdam climbed an embankment, then crossed a highway I didn\u0027t recognize. On the opposite side lay a trailer park.\u003c/p\u003e\n\u003cp\u003eFrowning, I crept forward, catching sight of him just as he opened the door on one of the mobile homes and disappeared.\u003c/p\u003e\n\u003cp\u003eWhat the hell? Was this where he spent his days? Not in a coffin or a grave or a lair but a trailer park? I hadn\u0027t seen that coming.\u003c/p\u003e\n\u003cp\u003eI left the cool shadows of the swamp, slipping and sliding up the embankment, then waiting for a semi truck to pass before I scooted across the two-lane highway.\u003c/p\u003e\n\u003cp\u003eExpecting the trailer park to be run-down, kind of shimmy, I was surprised to find neat plots of grass and flowers planted around the bases of most of the mobile homes. Each was well kept, clean, even shiny.\u003c/p\u003e\n\u003cp\u003eTricycles, Big Wheels, Flintstone cars, resided in nearly every driveway. Where Adam had disappeared, they had one of each.\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. Who lived here? I had a very bad feeling I wasn\u0027t going to like the answer.\u003c/p\u003e\n\u003cp\u003eTempted to bang on the door, I refrained. Just past six in the morning, I didn\u0027t want to be rude. So I slunk around the side and peeked in the window. I didn\u0027t mind being criminal.\u003c/p\u003e\n\u003cp\u003eCartoons spilled across the TV screen. A little boy of perhaps four or five stared avidly at the square yellow blob with a face, legs, and hands that appeared to be dancing under the sea.\u003c/p\u003e\n\u003cp\u003eI craned my neck. A young African-American woman stood in the kitchen, pouring cereal into a bowl. Her hair had been left natural, forming a short, tight, attractive Afro around her pretty face. She couldn\u0027t have been more than eighteen, maybe twenty.\u003c/p\u003e\n\u003cp\u003eI returned my attention to the child - dark hair long and shaggy, his skin kissed by the sun. I couldn\u0027t see his eyes. He could be hers.\u003c/p\u003e\n\u003cp\u003eHers and -\u003c/p\u003e\n\u003cp\u003eThe young woman\u0027s head came up as Adam appeared, his hair slicked back from his face, a towel around his neck. Chest bare, he now wore jeans instead of slacks.\u003c/p\u003e\n\u003cp\u003e\"Daddy!\" the child screeched, and left the cartoons behind to launch himself into Adam\u0027s arms.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t realize I\u0027d stopped breathing until black dots shimmied in front of my eyes. I sucked in air, let it out again. I should sit down, put my head between my legs, or maybe just pound it against the cement. But I couldn\u0027t tear my gaze from Adam and his son.\u003c/p\u003e\n\u003cp\u003eThe child clung to Adam like a monkey, arms tight around his neck, legs clutching his waist, and Adam rubbed his cheek against the boy\u0027s hair. The love on his face caused a tiny sob to escape.\u003c/p\u003e\n\u003cp\u003eAdam looked up and I ducked so fast, I got dizzy again. I crouched below the window, breathing as shallowly as I dared, listening for the creak of a door, but nothing happened.\u003c/p\u003e\n\u003cp\u003eSo I sat on the ground, dangled my head between my knees. I should get out of here. Someone, if not Adam or the little woman, was going to discover me dallying in the patch of grass beneath their living room window and wonder what kind of psycho they were dealing with.\u003c/p\u003e\n\u003cp\u003eA snort of laughter erupted. He\u0027d been angry when he thought I was married and screwing him. What was his excuse?\u003c/p\u003e\n\u003cp\u003e\"Maybe they aren\u0027t married,\" I muttered.\u003c/p\u003e\n\u003cp\u003eWhich was no excuse.\u003c/p\u003e\n\u003cp\u003eHe\u0027d lied to me somewhere along the line. Although I hadn\u0027t asked if he was involved, nevertheless, wasn\u0027t it good form to mention it? He definitely should have mentioned the child.\u003c/p\u003e\n\u003cp\u003eOf course Adam had made certain I was leaving, made clear he didn\u0027t love me and never would. He probably figured I\u0027d be gone long before it mattered that he had a son and a live-in woman. Maybe she didn\u0027t care if he played around. But I did.\u003c/p\u003e\n\u003cp\u003eA thought niggled at the edge of my mind. If I could just get my brain to function past the sight of that little boy\u0027s smile and the sound of his voice shouting, \"Daddy!\"\u003c/p\u003e\n\u003cp\u003eBut I couldn\u0027t From the way I was hyperventilating and clutching my chest, you\u0027d think I\u0027d just caught the love of my life in bed with another woman.\u003c/p\u003e\n\u003cp\u003eI cursed, forced myself to my feet, and took a deep breath. I\u0027d head back to the mansion, gather my things, and move in with Cassandra. Then I\u0027d hire another guide, find the freaking loup-garou, put a leash around its neck, and deliver the beast to Frank. All without ever seeing Adam Ruelle again.\u003c/p\u003e\n\u003cp\u003eI turned and ran right into him.\u003c/p\u003e\n\u003cp\u003eHe glanced from me to the window and back again. Neither one of us spoke.\u003c/p\u003e\n\u003cp\u003eI lifted my chin and tried to walk away. He sidestepped, putting himself directly in front of me.\u003c/p\u003e\n\u003cp\u003e\"What are you doin\u0027 here?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Get bent\"\u003c/p\u003e\n\u003cp\u003e\"You followed me.\"\u003c/p\u003e\n\u003cp\u003e\"Dub.,\" I muttered, which was so constructive but the best I could think of right now.\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t have.\"\u003c/p\u003e\n\u003cp\u003eI was tempted to say \"duh\" again but managed to stop myself. Instead I said nothing.\u003c/p\u003e\n\u003cp\u003eHe grabbed my arm and dragged me away from the mobile home, glancing over his shoulder as if afraid someone might see. I struggled against his hold, for all the good it did.\u003c/p\u003e\n\u003cp\u003e\"You have to go.\"\u003c/p\u003e\n\u003cp\u003e\"Damn straight.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come to de mansion tonight. I\u0027ll explain.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t bother.\" I pulled free.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t understand, cher.\"\u003c/p\u003e\n\u003cp\u003e\"Do not call me cher!\" I shouted, and to my horror, my voice broke.\u003c/p\u003e\n\u003cp\u003eHe reached for me, and I stepped back so fast I tripped over my own feet. My eyes burned. I was going to cry, and I couldn\u0027t let him see. I just couldn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"Diana,\" he murmured. \"It\u0027s not what you think.\"\u003c/p\u003e\n\u003cp\u003e\"Not your son?\"\u003c/p\u003e\n\u003cp\u003eHis lips tightened and he didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I thought.\"\u003c/p\u003e\n\u003cp\u003eAnd suddenly I recalled his incredible lie.\u003c/p\u003e\n\u003cp\u003e\"You said...\" I stared at him wide-eyed. \"You said you couldn\u0027t have children.\"\u003c/p\u003e\n\u003cp\u003eMy fingers itched to touch my stomach, where even now his child might be growing. Why on earth had I ever trusted this man?\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t.\" He rubbed his hand through his hair. \"Not anymore.\"\u003c/p\u003e\n\u003cp\u003e\"And I should believe you?\"\u003c/p\u003e\n\u003cp\u003e\"Why would I want to get you pregnant? I don\u0027t even want - \" He broke off.\u003c/p\u003e\n\u003cp\u003eI could fill in the end of that sentence. He didn\u0027t even want me. Not forever. Not in any way that mattered.\u003c/p\u003e\n\u003cp\u003eI\u0027d deluded myself into thinking I was the type of woman who could have sex without strings, but I wasn\u0027t. The instant I\u0027d had sex, the strings were there. They might be invisible, but that didn\u0027t make them any less real.\u003c/p\u003e\n\u003cp\u003eI must have made a movement toward the road, as if I might take off, as if I had a prayer in hell of outrunning him, and his hand snaked out, his fingers encircling my wrist.\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t supposed to see,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No shit.\"\u003c/p\u003e\n\u003cp\u003e\"Diana.\" He sighed. \"What am I going to do with you?\"\u003c/p\u003e\n\u003cp\u003e\"Not much. Not anymore.\"\u003c/p\u003e\n\u003cp\u003eHis lips thinned again. He was angry. Well, join de club, my mind mocked.\u003c/p\u003e\n\u003cp\u003eI was the injured party here. So why was he making me feel as if I\u0027d done something wrong?\u003c/p\u003e\n\u003cp\u003e\"Who is she?\" I whispered.\u003c/p\u003e\n\u003cp\u003eThe child I could forgive, but a wife... never.\u003c/p\u003e\n\u003cp\u003eAdam\u0027s eyes met mine, startled, a little confused, as if he had no idea who I was talking about, and I snapped. My free hand balled into a fist and I swung at his head.\u003c/p\u003e\n\u003cp\u003eHe ducked, quicker than spit, and I nearly fell when I missed him. My other arm twisted sharply, painfully, when he didn\u0027t let go of my wrist, and I almost went to my knees. Would have, if he hadn\u0027t grabbed me and hauled me against him.\u003c/p\u003e\n\u003cp\u003eDespite everything, my body recognized his. We still fit together so right. How could everything have gone so wrong?\u003c/p\u003e\n\u003cp\u003e\"Daddy?\"\u003c/p\u003e\n\u003cp\u003eOh, yeah. That.\u003c/p\u003e\n\u003cp\u003eAdam tensed. To his credit he didn\u0027t shove me away. He released me slowly, almost gently, and stepped back, turning and putting himself between me and his son, as if he could hide one from the other.\u003c/p\u003e\n\u003cp\u003e\"What are you doin\u0027 out here?\" Adam asked.\u003c/p\u003e\n\u003cp\u003eThe child didn\u0027t answer, instead leaning to the side so he could see me. I was struck with the urge to cover my face, as if that would make me invisible.\u003c/p\u003e\n\u003cp\u003eHe grinned, exposing an adorable gap in his front teeth. If that hadn\u0027t made my heart clutch, the sight of his bright blue eyes would have.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Luc,\" he said. \"Luc Ruelle.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have the Cajun twang of his father, but the South still lived in Luc\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Go inside,\" Adam ordered.\u003c/p\u003e\n\u003cp\u003eThe kid ignored him. I had to admire that Adam wasn\u0027t exactly ignorable.\u003c/p\u003e\n\u003cp\u003e\"You gonna be my mom?\"\u003c/p\u003e\n\u003cp\u003eI choked.\u003c/p\u003e\n\u003cp\u003e\"Luc,\" Adam growled.\u003c/p\u003e\n\u003cp\u003e\"Uh-oh.\" Luc\u0027s gaze shifted to his father, then back to me. \"Now I\u0027m in trouble.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t appear worried, and instead of leaving, he advanced. Adam stepped between us again, and I was tempted to shove him out of the way. Honestly, did he think I was going to gobble up the child like a... a goblin?\u003c/p\u003e\n\u003cp\u003e\"My real mama died. I got sitters. Lots of \u0027em.\" He glanced at Adam. \"Sadie says she\u0027s quittin\u0027.\"\u003c/p\u003e\n\u003cp\u003eAdam groaned as Luc gave a long-suffering sigh. \"I know, another one bites the dust.\"\u003c/p\u003e\n\u003cp\u003eI laughed and Luc smiled again, even as Adam shot me a glare. How could he remain so sour with such a sweet, funny child to enjoy? And why was he treating Luc like a curse and not a blessing?\u003c/p\u003e\n\u003cp\u003eMy head tilted. Curse? Could Luc be... ?\u003c/p\u003e\n\u003cp\u003eNah.\u003c/p\u003e\n\u003cp\u003e\"Get back inside,\" Adam repeated. \"I have to take - \" he broke off and scowled at me again - \"her home.\"\u003c/p\u003e\n\u003cp\u003e\"Who is her?\" Luc asked, undaunted, \"What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Diana.\"\u003c/p\u003e\n\u003cp\u003e\"Deesse de la lune.\"\u003c/p\u003e\n\u003cp\u003eAll urge to laugh fled. I heard again the whisper in the swamp, Adam\u0027s murmur in my mind, Luc\u0027s voice in the sun.\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003eLuc glanced at Adam, concern wrinkling his forehead. \"She don\u0027t know French?\"\u003c/p\u003e\n\u003cp\u003e\"Not everyone does.\"\u003c/p\u003e\n\u003cp\u003eThe child peered at me as if I\u0027d just farted in church. Not to know French - what a cretin!\u003c/p\u003e\n\u003cp\u003e\"Goddess of the moon,\" he chirped. \"Diana.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" I said lamely.\u003c/p\u003e\n\u003cp\u003eInteresting that a child knew all about the power of names.\u003c/p\u003e\n\u003cp\u003e\"Daddy likes the moon.\"\u003c/p\u003e\n\u003cp\u003eMy gaze went to Adam, who stared at me with no expression. \"Does he?\"\u003c/p\u003e\n\u003cp\u003e\"Especially the smiley moon,\" Luc continued. \"Whenever there\u0027s one of those in the sky, he\u0027s gone all night.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-crescent-moon-nightcreature-4/page-27.html","bookId":2091,"creation":"Oct 5, 2019 5:40:32 PM","modification":"Oct 5, 2019 5:40:32 PM"}
