{"id":90100,"no":37,"title":"Page 37","content":"\u003cp\u003eDizziness washed over me and I swayed. \"What - ? Who - ? How - ?\"\u003c/p\u003e\n\u003cp\u003eAdam rushed to the enclosure, saw the lock, and turned. \"The key.\"\u003c/p\u003e\n\u003cp\u003eI was having trouble breathing, so I sat down and put my head between my legs. After a few minutes, the black dots receded.\u003c/p\u003e\n\u003cp\u003eWhen I glanced up, two men, so alike in appearance and yet so different, stared back. Now that they stood together, how could I have thought they were the same? One look into their eyes and I saw the difference. The Adam in the cage was evil; the one who\u0027d brought me here was not.\u003c/p\u003e\n\u003cp\u003e\"Twins?\" I asked.\u003c/p\u003e\n\u003cp\u003eThey shook their heads, and their hair swirled around their shoulders.\u003c/p\u003e\n\u003cp\u003e\"My great-great... well, several-greats-grandfather.\" The Adam outside the cage jerked a thumb toward the one inside. \"Henri Ruelle.\"\u003c/p\u003e\n\u003cp\u003eThe naked man bowed.\u003c/p\u003e\n\u003cp\u003e\"The picture,\" I murmured.\u003c/p\u003e\n\u003cp\u003eHenri smirked. I hated that smirk.\u003c/p\u003e\n\u003cp\u003e\"Obviously taken before you became a loup-garou.\" Considering my trouble photographing them.\u003c/p\u003e\n\u003cp\u003e\"Obviously,\" Henri returned.\u003c/p\u003e\n\u003cp\u003e\"Why would you leave it on the wall where anyone could see?\"\u003c/p\u003e\n\u003cp\u003e\"I only wanted you to see.\"\u003c/p\u003e\n\u003cp\u003e\"Grandpere likes to confuse people.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d confused me all right.\u003c/p\u003e\n\u003cp\u003eI returned my attention to Adam. \"You said your family wasn\u0027t cursed.\"\u003c/p\u003e\n\u003cp\u003e\"No. I said, \u0027Some say we are.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"I specifically asked if you\u0027d been cursed to run as a wolf beneath the crescent moon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"You look so much alike.\" I stared at Adam. \"Couldn\u0027t you at least cut your hair? Make some distinction?\"\u003c/p\u003e\n\u003cp\u003e\"The better to protect me, my dear,\" Henri said.\u003c/p\u003e\n\u003cp\u003eI glanced at him, then back at Adam. \"You protect it?\"\u003c/p\u003e\n\u003cp\u003e\"Hey!\" Henri protested.\u003c/p\u003e\n\u003cp\u003e\"There will always be a loup-garou of Ruelle blood. If Grandpere dies, the next Ruelle male becomes the beast\"\u003c/p\u003e\n\u003cp\u003e\"You.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Then Luc.\"\u003c/p\u003e\n\u003cp\u003eSo many things were starting to make sense.\u003c/p\u003e\n\u003cp\u003e\"Your father and grandfather?\"\u003c/p\u003e\n\u003cp\u003e\"They couldn\u0027t bear knowing what they might become.\"\u003c/p\u003e\n\u003cp\u003e\"Pussies,\" Henri spat.\u003c/p\u003e\n\u003cp\u003e\"Who did you piss off?\" I demanded.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know she was a voodoo queen. She was - \" Henri shrugged. \"A slave. I wanted her; I took her.\"\u003c/p\u003e\n\u003cp\u003e\"You raped her?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Confusion flickered over his face. \"She was mine. I never understood what she was so angry about.\"\u003c/p\u003e\n\u003cp\u003eI rubbed between my eyes. \"Why didn\u0027t she just turn him into a bug and squash him?\"\u003c/p\u003e\n\u003cp\u003e\"Too easy,\" Adam murmured.\u003c/p\u003e\n\u003cp\u003e\"Dismemberment would have been too easy.\"\u003c/p\u003e\n\u003cp\u003e\"She called on the moon goddess to make me a beast\"\u003c/p\u003e\n\u003cp\u003eI lifted my head. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Queen of heavens, mother of creatures, lady of de wild, patron goddess of de outlaw werewolf, the instant I heard your name, deesse de la lune, I knew you were here forme.\"\u003c/p\u003e\n\u003cp\u003eI glanced at Adam, who shrugged. \"He\u0027s been obsessed with you from de beginning, but he couldn\u0027t figure out if you were here to help or hurt him.\"\u003c/p\u003e\n\u003cp\u003e\"Diana is a huntress,\" Henri continued. \"You rule all dark forests; you command de moon. Queen of witches, daughter of Satan.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027ve got the wrong Diana.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m cursed by a woman who calls on a moon goddess, then you show up? How can that be a coincidence?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a hundred and fifty years later!\" I shouted.\u003c/p\u003e\n\u003cp\u003e\"Time means nothing to me.\"\u003c/p\u003e\n\u003cp\u003eI suppose after the first century, that\u0027s true.\u003c/p\u003e\n\u003cp\u003e\"Listen,\" I said. \"My name is just a name. It was my grandmother\u0027s, and you can bet your everlasting life she wasn\u0027t a moon goddess.\"\u003c/p\u003e\n\u003cp\u003e\"Did you come here to make me stronger, to be at my side until we ruled the world?\" Henri asked.\u003c/p\u003e\n\u003cp\u003eDid this guy listen! \"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Then you came to cure me, and you have to die.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"The one thing Grandpere fears is being cured. He likes what he is. He doesn\u0027t want to go back to the way he was.\"\u003c/p\u003e\n\u003cp\u003e\"In life I was at de mercy of forces I could not change - weather, government, stock market, death. Now everyone is at de mercy of me. Like this, I\u0027ll never be hungry or poor again.\"\u003c/p\u003e\n\u003cp\u003eI looked at Adam. \"I thought you were poor now.\"\u003c/p\u003e\n\u003cp\u003e\"I want none of his money.\"\u003c/p\u003e\n\u003cp\u003eCouldn\u0027t say I blamed him.\u003c/p\u003e\n\u003cp\u003e\"I can understand cursing Henri,\" I said, \"but why the entire line?\"\u003c/p\u003e\n\u003cp\u003e\"Curses are funny that way,\" Adam said. \"They tend to hang around for more than a generation.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re certain killing him will curse you?\"\u003c/p\u003e\n\u003cp\u003e\u0027I can\u0027t kill him and find out!\" Adam shoved a hand through his hair. \"I\u0027ve spoken with voodoo experts; they all say de same thing. A curse like this is on every Ruelle born until de curse is lifted. And that I don\u0027t know how to do. No one does.\"\u003c/p\u003e\n\u003cp\u003e\"So what, exactly, is the curse?\"\u003c/p\u003e\n\u003cp\u003e\"He is an evil, soulless thing. A selfish prick who cares only for himself.\"\u003c/p\u003e\n\u003cp\u003e\"Wasn\u0027t he that already?\"\u003c/p\u003e\n\u003cp\u003e\u0027I didn\u0027t know him before,\" Adam shrugged, \"but most likely.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m right here,\" Henri muttered.\u003c/p\u003e\n\u003cp\u003e\"Under de crescent moon he runs as a wolf,\" Adam continued as if Henri hadn\u0027t spoken. \"He murders de innocent and creates more werewolves.\"\u003c/p\u003e\n\u003cp\u003e\"Like Charlie.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"He told me he has to change under the crescent moon.\"\u003c/p\u003e\n\u003cp\u003e\"He does. Many more nights of being a beast that way.\"\u003c/p\u003e\n\u003cp\u003e\"A blessing, not a curse, if you ask me,\" Henri said. \"I like to kill.\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t ask you,\" I snapped. God, he was annoying.\u003c/p\u003e\n\u003cp\u003eSomething occurred to me. \"I saw Charlie under a half-moon.\"\u003c/p\u003e\n\u003cp\u003e\"Charlie was a werewolf; Grandpere is a loup-garou.\"\u003c/p\u003e\n\u003cp\u003e\"My head hurts.\"\u003c/p\u003e\n\u003cp\u003eAdam\u0027s mourn tightened. \"Grandpere wasn\u0027t bitten; he was cursed. Those he bites rise and run as wolves within twenty-four hours - day, night, doesn\u0027t matter. After that, only de full moon compels them to shift. Under any other, it is their choice.\"\u003c/p\u003e\n\u003cp\u003eWhich made as much sense as anything else around here.\u003c/p\u003e\n\u003cp\u003e\"What about him?\" I jerked my thumb toward the cage. \"When the moon isn\u0027t a crescent?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a man - or as much of a man as he can claim to be.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like less of a curse.\"\u003c/p\u003e\n\u003cp\u003e\"The longer he\u0027s in human form, de more violent he becomes when de wolf is upon him.\"\u003c/p\u003e\n\u003cp\u003eI scowled at Henri, who shrugged and examined his fingernails. I considered all that I knew and all I did not\u003c/p\u003e\n\u003cp\u003e\"When did you find out about the curse?\u0027 I asked.\u003c/p\u003e\n\u003cp\u003e\"Luc\u0027s first birthday.\" His face softened. \"Family tradition. By then you\u0027re in love with de boy. You\u0027d do anything to protect him.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t find a record of Luc\u0027s birth,\" I said.\u003c/p\u003e\n\u003cp\u003eAdam cast Henri a suspicious glance, and Henri shrugged. \"Less people know of us, de better.\"\u003c/p\u003e\n\u003cp\u003e\"Once your father told you the truth,\" I continued, \"he killed himself?\"\u003c/p\u003e\n\u003cp\u003eSadness flickered over Adam\u0027s face as he nodded. \"I was old enough to watch over Grandpere, and by then I\u0027d had Special Forces training. Didn\u0027t know I\u0027d need it for this.\"\u003c/p\u003e\n\u003cp\u003e\"Your father left you alone to raise your son, protect that thing, and find a cure? He couldn\u0027t stick around to help?\"\u003c/p\u003e\n\u003cp\u003e\"Knowing what was to come preyed on his mind, drove him over de edge.\"\u003c/p\u003e\n\u003cp\u003eI got the feeling Adam was talking as much about himself as his dad.\u003c/p\u003e\n\u003cp\u003e\"When I was a boy he would be gone certain nights and come home beat to hell. He was a gentle man, a scholar. He didn\u0027t know how to fight; he had no idea how to counteract evil and violence.\"\u003c/p\u003e\n\u003cp\u003eHenri snorted but refrained from comment for a change.\u003c/p\u003e\n\u003cp\u003e\"Your mother?\"\u003c/p\u003e\n\u003cp\u003e\"She left the instant she knew the truth.\"\u003c/p\u003e\n\u003cp\u003eI tilted my head, and Adam looked away, refusing to meet my eyes. No wonder he\u0027d been so worried I\u0027d leave him and Luc behind. Every other woman in his life had.\u003c/p\u003e\n\u003cp\u003e\"My father asked me to enlist,\" he continued. \"I\u0027d always been fascinated with weapons, interested in military history; I believed he wanted me to be happy. Later I understood he wanted me trained to do de family dirty work better than he had been.\"\u003c/p\u003e\n\u003cp\u003e\"You plan on taking the easy way out when Luc\u0027s old enough to protect that monster?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d let de curse fall to me before I\u0027d leave him to suffer.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll like it,\" Henri whispered. \"You\u0027ll see. The power is exhilarating. With one stroke you can kill or impart life everlasting.\"\u003c/p\u003e\n\u003cp\u003e\u0027Unless someone has a silver bullet,\" Adam snapped.\u003c/p\u003e\n\u003cp\u003e\"So few do.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute,\" I said. \"Doesn\u0027t everyone he kills rise again?\"\u003c/p\u003e\n\u003cp\u003e\"No, thank God, or we\u0027d be overrun. If he kills but doesn\u0027t drink their blood or eat their flesh, they become a werewolf. If he partakes of de kill, they\u0027re just dead.\"\u003c/p\u003e\n\u003cp\u003e\"I do so love when they beg for their life,\" Henri murmured. \"I usually give it to them.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, old man,\" Adam said.\u003c/p\u003e\n\u003cp\u003eThe incongruity of calling someone who didn\u0027t appear a day over thirty \"old man\" made me giggle. Hysteria was obviously not far behind.\u003c/p\u003e\n\u003cp\u003eI swallowed the inappropriate laughter and tried to focus. \"Why are there no Ruelle girls?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Adam blinked at the sudden change in subject.\u003c/p\u003e\n\u003cp\u003e\"No girls born for over a century. I checked.\"\u003c/p\u003e\n\u003cp\u003e\"De curse. Grandpere\u0027s voodoo queen wanted only men to suffer. I don\u0027t think she cared too much for them.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine why.\"\u003c/p\u003e\n\u003cp\u003eHenri grabbed the bars and rattled his cage. \"Let me out!\"\u003c/p\u003e\n\u003cp\u003e\"Not so fast,\" Adam said. \"You will leave her alone.\"\u003c/p\u003e\n\u003cp\u003eHenri\u0027s gaze flicked to me. \"What if she tries to kill me? Will you protect me then, Petit-fils? Will you trust her with your soul? What about de boy\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\u0027If she meant to kill you, Grandpere, I\u0027d be dead. She thought I was you.\"\u003c/p\u003e\n\u003cp\u003eHenri frowned. I didn\u0027t think he was the brightest star in the sky. Or should I say the fullest moon on the calendar?\u003c/p\u003e\n\u003cp\u003e\"True,\" he agreed. \"She\u0027d have slipped a silver knife between your ribs while you were doing her. That\u0027s always de best time.\"\u003c/p\u003e\n\u003cp\u003e\"You two seem to have me confused with someone else,\" I murmured. \"A psychopathic serial killer perhaps?\"\u003c/p\u003e\n\u003cp\u003e\"But if she doesn\u0027t want to kill me - \"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t at first, but now that I\u0027ve met you I\u0027ve changed my mind.\"\u003c/p\u003e\n\u003cp\u003e\"Diana - \" Adam began, but Henri interrupted: \"What do you want?\"\u003c/p\u003e\n\u003cp\u003e\"To prove a werewolf exists and show it to the world.\"\u003c/p\u003e\n\u003cp\u003e\"That isn\u0027t going to happen.\" Henri glanced at Adam. \"Right?\"\u003c/p\u003e\n\u003cp\u003eAdam sighed. \"Right\" He let his head fall forward, and his hair sifted over his face.\u003c/p\u003e\n\u003cp\u003eI stood, resisting the urge to shove it back.\u003c/p\u003e\n\u003cp\u003eHe lifted his gaze. \"I need de key.\"\u003c/p\u003e\n\u003cp\u003e\"He wants to kill me, or maybe screw me - \"\u003c/p\u003e\n\u003cp\u003e\"How about both?\" Henri whispered.\u003c/p\u003e\n\u003cp\u003e\"Why you think I said I\u0027d be your guide?\" Adam demanded. \"I wasn\u0027t going to let him hurt you. I still won\u0027t\"\u003c/p\u003e\n\u003cp\u003eSadness filtered through me. Adam hadn\u0027t hung around because of my charms - no kidding - but because he\u0027d wanted to make certain Henri didn\u0027t tear out my throat or worse. And what better way to get close than to pretend he wanted to sleep with me and then do so?\u003c/p\u003e\n\u003cp\u003eI\u0027d been right: This wasn\u0027t love. It wasn\u0027t even lust, just duty.\u003c/p\u003e\n\u003cp\u003eVoices floated on the still morning air, startling us all.\u003c/p\u003e\n\u003cp\u003e\"Frank,\" I muttered. How had he gotten here so fast?\u003c/p\u003e\n\u003cp\u003e\"Hurry up,\" Henri snapped.\u003c/p\u003e\n\u003cp\u003e\"I have to let him go, Diana.\" Adam\u0027s gaze captured mine. \"If they don\u0027t kill him here, they\u0027ll dissect him somewhere else. If he dies and I\u0027m possessed, there\u0027ll be no one to care for Luc.\"\u003c/p\u003e\n\u003cp\u003e\"You think Henri should be free to kill people?\"\u003c/p\u003e\n\u003cp\u003e\"I do my best to contain him. And I spend de nights he can\u0027t shift eliminating those he\u0027s made.\"\u003c/p\u003e\n\u003cp\u003eMy eyes widened. \"You shot Charlie.\"\u003c/p\u003e\n\u003cp\u003eAdam nodded.\u003c/p\u003e\n\u003cp\u003eThere was a shout, much closer, and Adam held out his hand. \"Please.\"\u003c/p\u003e\n\u003cp\u003eI looked into his eyes, saw the shadows and the pain. I also saw his fear, his need, and his son.\u003c/p\u003e\n\u003cp\u003eI gave him the key. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-crescent-moon-nightcreature-4/page-37.html","bookId":2091,"creation":"Oct 5, 2019 5:40:32 PM","modification":"Oct 5, 2019 5:40:32 PM"}
