{"id":93255,"no":41,"title":"Page 41","content":"\u003cp\u003eThe Committee\u0027s investigation on the incident at the Repository called for a public hearing, wherein all the witnesses to the attack were called to testify before The Committee. The hearing took place inside one of the massive courtrooms underneath the Repository. The members of the Conclave sat in a row on a high platform, facing the crowd, Charles Force in the middle. Lawrence Van Alen was seated to the far right, and was already puffing on his customary cigar. The new Chief Warden, Edmund Oelrich, a famous art historian and gallery owner in his public life, ran the proceedings from his seat up on the platform. There was a small podium to the side where witnesses were called, and the inquisitor, The Committee\u0027s official prosecutor, stood across from it.\u003c/p\u003e\n\u003cp\u003eThe seats in the courtroom were filled with almost all the Blue Blood families, and tension ran high as Schuyler, Jack, Bliss, and Oliver described their version of the events one by one. They were seated next to each other in the front row. Mimi was seated next to Jack, and was still waiting for her turn. She was nervous about the investigation, but figured there had to be some way to bluff her way through it. After all, it wasn\u0027t like she had wanted Bliss to be hurt or Priscilla DuPont dead not in the least! She couldn\u0027t have cared less about the old bag. It was just an unfortunate accident. They had to understand that, right? If there was no motive, they couldn\u0027t find her guilty, could they? She reached over to grab her brother\u0027s hand, and Jack gave it a warm squeeze.\u003c/p\u003e\n\u003cp\u003eThe inquisitor called Kingsley Martin to the stand. \"State your name for the records.\"\u003c/p\u003e\n\u003cp\u003e\"Kinsgley Drexel Martin.\"\u003c/p\u003e\n\u003cp\u003e\"And your position.\"\u003c/p\u003e\n\u003cp\u003ePosition? Mimi raised an eyebrow. What was this all about?\u003c/p\u003e\n\u003cp\u003e\"I am a Truth Seeker. A Veritas Venator. I was commissioned by The Committee to investigate the deaths of several Blue Bloods: Aggie Carondolet, Dylan Ward, Summer Armory, Natalie Getty, Landon Schlessinger, and Grayson St. James.\"\u003c/p\u003e\n\u003cp\u003eA murmur ran through the crowd. Older Blue Bloods knew Venators as the highest order of The Committee\u0027s secret police, fearless warriors in the fight to keep the Blue Bloods safe from harm and discovery.\u003c/p\u003e\n\u003cp\u003e\"And your mission?\" The inquisitor prompted.\u003c/p\u003e\n\u003cp\u003e\"I was sent to the Duchesne School to accumulate any evidence that might lead to the detection of the enemy,\" Kingsley said evenly.\u003c/p\u003e\n\u003cp\u003eAnother murmur, this time more agitated. A Venator had been sent to one of their safest sanctuaries Duchesne! What was The Committee thinking, sending one of their powerful assassins to spy upon school children?\u003c/p\u003e\n\u003cp\u003e\"Who were the suspects?\"\u003c/p\u003e\n\u003cp\u003e\"Madeleine Force. Bliss Llewellyn. Schuyler Van Alen.\"\u003c/p\u003e\n\u003cp\u003eThis time there was an audible gasp from the crowd. Kingsley was an undercover agent! A latter day Johnny Depp on 21 Jump Street, an undercover vampire working the teen beat.\u003c/p\u003e\n\u003cp\u003eSchuyler gaped, Bliss couldn\u0027t help but laugh, and Mimi only gnashed her teeth. That little prick.\u003c/p\u003e\n\u003cp\u003e\"And what did your findings show?\"\u003c/p\u003e\n\u003cp\u003e\"I immediately crossed off Schuyler Van Alen. She was a victim of two Silver Blood attacks and did not show any indication of being drawn to the Dark Matter,\" Kingsley said, taking out a small notebook from his jacket pocket and flipping through his notes.\u003c/p\u003e\n\u003cp\u003e\"Bliss Llewellyn was a more promising subject. She has complained of nightmares and delusions, similar to those suffered by Maggie Stanford before her demise. But due to these delusions, I had to conclude that Bliss was a possible victim and not a perpetrator.\"\u003c/p\u003e\n\u003cp\u003e\"And Madeleine?\"\u003c/p\u003e\n\u003cp\u003e\"I have concluded that Madeleine Force harbors the Silver Blood that has been attacking our community,\" Kingsley said, his tone of voice almost casual.\u003c/p\u003e\n\u003cp\u003e\"Quiet! Quiet in the court!\" The Chief Warden admonished, as the crowd became even more angry and agitated. Several vampires stood from their seats, and there was hissing and booing at Kingsley\u0027s testimony. Mimi Force --the Regis\u0027s daughter--Silver Blood accomplice? Was this some kind of joke?\u003c/p\u003e\n\u003cp\u003e\"And the basis for your evidence?\" The Chief Warden grunted from the high platform.\u003c/p\u003e\n\u003cp\u003e\"She expressed a desire to learn more about the Dark Matter. Specifically, she wanted to know how to perform the Incantation Demonata. The call for the Silver Blood.\"\u003c/p\u003e\n\u003cp\u003e\"And why did she say she wanted to do this?\"\u003c/p\u003e\n\u003cp\u003e\"She said she wanted to finish off an enemy,\" Kingsley said, looking straight at Mimi.\u003c/p\u003e\n\u003cp\u003eMimi quavered in her seat. Lies, lies. All lies! Stop talking! Shut up! Shut up! You were my friend! Traitor!\u003c/p\u003e\n\u003cp\u003e\"And that was Bliss Llewellyn.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"No?\" The inquisitor looked mildly surprised.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Who was the intended target?\"\u003c/p\u003e\n\u003cp\u003e\"Schuyler Van Alen.\"\u003c/p\u003e\n\u003cp\u003eThere was another angry buzz among the audience.\u003c/p\u003e\n\u003cp\u003eSchuyler felt herself freeze. So she wasn\u0027t just paranoid--Mimi did want to destroy her. She remembered her dream in which her mother was awake and speaking to her. What had Allegra said? Beware.\u003c/p\u003e\n\u003cp\u003e\"Why did you allow her to perform the incantation?\" The Chief Warden asked.\u003c/p\u003e\n\u003cp\u003e\"I needed the evidence. I thought I could control it, stop her before it happened. But I could not. It was obvious she had done this before. Many times.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Venator.\"\u003c/p\u003e\n\u003cp\u003eKingsley stepped down. Now that his identity was known, he looked much older, the cocky adolescent boy had been a facade, merely a pose. He walked gravely to his seat in the front row next to the Duchesne kids, and they gave him a respectful berth.\u003c/p\u003e\n\u003cp\u003e\"The investigation now calls Charles Force to the stand,\" the Chief Warden announced.\u003c/p\u003e\n\u003cp\u003eThe head of the coven staggered down to the podium from his seat on the high platform. His own daughter, har- boring a Silver Blood! The shame of it was written all over his face. His silver hair looked white under the light, and there were heavy bags under his eyes. He looked like a bro- ken man, not the indefatigable leader of the vampires.\u003c/p\u003e\n\u003cp\u003e\"State your full name for the record,\" The inquisitor ordered.\u003c/p\u003e\n\u003cp\u003e\"Charles Van Alen Force.\"\u003c/p\u003e\n\u003cp\u003e\"Have you witnessed your daughter meddle with the Black Spells?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but...\" Charles answered, wiping his brow with a silk handkerchief.\u003c/p\u003e\n\u003cp\u003e\"Incantations. Forbidden spells.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but...\u003c/p\u003e\n\u003cp\u003e\"That will be all. Thank you,\" the inquisitor said, cutting off his testimony.\u003c/p\u003e\n\u003cp\u003eCharles looked as though he wanted to say something more, but his words died on his tongue. He looked ashen and disheartened. He stepped down and walked back to his seat with the Conclave.\u003c/p\u003e\n\u003cp\u003eNone of the members of the Conclave would look at him, and several in the crowd began to boo and hiss.\u003c/p\u003e\n\u003cp\u003e\"As final evidence against Madeleine Force, we present the Mark. I believe you will find it on the back of her neck,\" the inquisitor declared.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s absolutely ludicrous. I don\u0027t bear the Mark of Lucifer any more than the rest of you,\" Mimi said. She wanted to scream. This was a travesty. She was being set up!\u003c/p\u003e\n\u003cp\u003e\"Lift your hair, please,\" the Chief Warden directed.\u003c/p\u003e\n\u003cp\u003eMimi gathered her hair and lifted it. She had done this for Nan Cutler the night before, when she had come to per- form the test. Nothing had happened, and she was certain she had been cleared.\u003c/p\u003e\n\u003cp\u003eThere was an agitated murmur from the Conclave.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eYour neck, Mimi, there\u0027s something on your neck.\u003c/p\u003e\n\u003cp\u003eJack, you\u0027re scaring me.\u003c/p\u003e\n\u003cp\u003eShe felt the back of her neck with the tips of her fin- gers. Raised flesh. A tattoo. More like a burn, like a cattle brand.\u003c/p\u003e\n\u003cp\u003eJudgment was swift and resolute. Mimi was the perpetrator. She was found guilty of conspiring with a Silver Blood. She would be taken to their ancient prison in Venice, where her blood would be burned, her memories destroyed, with no hope of reincarnation. Bail was set for one million dollars, which her father promptly paid, so that Mimi could be released to his custody.\u003c/p\u003e\n\u003cp\u003eMimi looked at Jack. This can\u0027t be happening...I didn\u0027t do it. You know I didn\u0027t.\u003c/p\u003e\n\u003cp\u003eI know. I know. Jack put an arm around his sister, but his face was lined with anxiety. This was serious. Sentenced to burn! Mimi!\u003c/p\u003e\n\u003cp\u003eThe Force twins waited for Charles to walk down the platform to their side. He still had the same shell-shocked look on his face.\u003c/p\u003e\n\u003cp\u003e\"Father, what can we do now?\" Mimi said. \"Surely...\"\u003c/p\u003e\n\u003cp\u003eCharles Force was aghast. \"There is nothing...\"\u003c/p\u003e\n\u003cp\u003e\"Nothing?\"\u003c/p\u003e\n\u003cp\u003e\"There is only one way to refute the Mark of Lucifer. You must submit to an even more ancient custom. The blood trial. But only Gabrielle--Allegra Van Alen--is able to perform this.\"\u003c/p\u003e\n\u003cp\u003e\"Gabrielle?\" Mimi asked, with a sinking feeling.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eA whole lot of good that was going to do her. Allegra was in a coma and would never wake up.\u003c/p\u003e\n\u003cp\u003e\"So there is nothing I can do to prove my innocence?\" Mimi asked.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/masquerade-blue-bloods-2/page-41.html","bookId":2120,"creation":"Oct 5, 2019 6:01:05 PM","modification":"Oct 5, 2019 6:01:05 PM"}
