{"id":93262,"no":48,"title":"Page 48","content":"\u003cp\u003eComing back home to her stepmother\u0027s Penthouse des R?ves was a bit of a letdown after the pampering at Dr. Pat\u0027s clinic. Bliss had finally been discharged after several weeks, after being kept in observation to make sure she had stabilized and displayed no signs of corruption. She wondered what they were waiting for her to do attack them? Slash her wrists? The nurses at the clinic acted as if they were afraid to come too near, lest something happen.\u003c/p\u003e\n\u003cp\u003eIt was the first day of ski week, and usually the family would be on a plane to Gstaad by now, but Conclave matters had called her father to Venice. BobiAnne had gone with him, but only so she could hit the shops on Via Condotti in Rome. Jordan had accompanied their parents as well, since it was decided she was too young to be left behind. While Bliss was still recovering, she was left in the care of the household staff. Bliss had been at home during Mimi\u0027s trial and sentencing, but she was certain Mimi would come to no harm. It was just too easy to imagine a life without Mimi Force\u0027s dictatorial ways, and there was no way the universe would be so kind as to get rid of her.\u003c/p\u003e\n\u003cp\u003eBliss was bored and alone in the apartment and decided to clean out her closet for want of something better to do. Maybe perform that spring-cleaning ritual women\u0027s magazines always advised: throw out clothes you hadn\u0027t worn in two years, or those that were too shabby or didn\u0027t fit any more--that sort of thing.\u003c/p\u003e\n\u003cp\u003eShe was pulling out an old cable-knit sweater when a long velvet box tumbled to the floor and a necklace fell out of it.\u003c/p\u003e\n\u003cp\u003eIt was the emerald. She had forgotten to return it to her father for safekeeping in the vault after the Four Hundred Ball. Bliss picked it up, still feeling wary at the story behind the jewel. Lucifer\u0027s Bane indeed. As she tucked it back into the box, a picture slipped out from underneath the velvet pillow.\u003c/p\u003e\n\u003cp\u003eBliss reached down to pick it up, studying it. It was a picture of her father, looking young and slim in a hunting jacket and boots, with a woman at his side whom Bliss had always assumed was her mother. Her father kept a faded copy of the picture in his wallet. This one was more well preserved. Bliss noted her mother\u0027s long blond hair and large, doelike eyes. Bliss\u0027s eyes, her father always said. You have your mother\u0027s eyes. Her mother\u0027s eyes were green, like hers, as green as the emerald she held in her hand. Bliss turned over the picture.\u003c/p\u003e\n\u003cp\u003eForsyth Llewellyn and Allegra Van Alen, 1982. Allegra Van Alen?\u003c/p\u003e\n\u003cp\u003eWasn\u0027t that Schuyler\u0027s mother?\u003c/p\u003e\n\u003cp\u003eIt must be a mistake. Her mother\u0027s name was Charlotte Potter.\u003c/p\u003e\n\u003cp\u003eWhat was that all about?\u003c/p\u003e\n\u003cp\u003eBliss was still puzzling over the strange inscription when there was a crash at the window. Glass shattered at her feet and Bliss ran over to see what had happened.\u003c/p\u003e\n\u003cp\u003eThe boy was shivering in the corner, his feet bleeding from the cut glass. He was wearing the same T-shirt and jeans she had last seen him in. His dark hair was wet and matted, but he looked at her with the same sad, hangdog eyes.\u003c/p\u003e\n\u003cp\u003eDylan! It was truly him. He was alive.\u003c/p\u003e\n\u003cp\u003eHe glanced up, his breathing shallow and ragged.\u003c/p\u003e\n\u003cp\u003eShe ran toward him, still holding the emerald in her hand.\u003c/p\u003e\n\u003cp\u003eDylan looked at Bliss, then flinched when he saw what she held aloft, almost as if it had hurt him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re alive!\" Bliss said joyfully. \"But you\u0027re hurt-- let me help you.\"\u003c/p\u003e\n\u003cp\u003eDylan shook his head. \"There\u0027s no time for that now. I know who the Silver Blood is.\"\u003c/p\u003e\n\u003cp\u003eNew York Herald\u003c/p\u003e\n\u003cp\u003eArchives\u003c/p\u003e\n\u003cp\u003eNOVEMBER 23, 1872\u003c/p\u003e\n\u003cp\u003eMISSING HEIRESS FOUND DEAD IN THE RIVER\u003c/p\u003e\n\u003cp\u003eNew York police discover the body of Maggie Stanford two years after she was first reported missing. A suspicion of foul play. Corpse found then missing again.\u003c/p\u003e\n\u003cp\u003eTHE BODY OF A WELL-DRESSED and pretty woman was found this morning floating in the Hudson River. Policeman Charles Langford discovered the body at six o\u0027clock this morning and reported the matter to the Tenth Precinct. The body was taken from the water and carried to the station house. There were marks on her head and body, which led the police to believe that the woman was foully dealt with. She had red hair, green eyes, and was dressed in a white silk ball gown trimmed with pink ribbons. In their efforts to establish the identity of the woman, the police found a white linen handkerchief which bore the initials \"M.S.\" in the pocket of the dress.\u003c/p\u003e\n\u003cp\u003eThe body was subsequently identified as that of Maggie Stanford, the daughter of deceased oil baron Tiberius Stanford and Dorothea Stanford, who passed away two months ago from dementia resulting from her daughter\u0027s disappearance. The clothes Maggie Stanford had reportedly worn to the Patrician Ball the night she went missing match the description of the ball gown worn by the dead woman. The body was inordinately well preserved, with almost no sign of decomposition. The body was sent to the hospital for further examination, but the next day it was reported missing from the morgue. The police continue to be baffled by this strange case. Acknowledgments\u003c/p\u003e\n\u003cp\u003eThis book would not be possible without the constant encouragement and support from my readers. Thank you to everyone who e-mailed, blogged, reviewed, and posted on the Blue Bloods message boards. (Check it out at:[http://z13.invisionfree.com/Blue_Bloods). You guys rock!\u003c/p\u003e\n\u003cp\u003eMany heartfelt thanks to the wonderful team at Hyperion for their patience, support, and enthusiasm: Jennifer Besser, Helen Perelman, Brenda Bowen, Nellie Kurtzman, Jennifer Zatorski, Colin Hosten, Elizabeth Clark, Angus Killick, and Deborah Bass.\u003c/p\u003e\n\u003cp\u003eI am deeply grateful to Richard Abate and Josie Freedman at ICM.\u003c/p\u003e\n\u003cp\u003eLove and thanks to my family and friends, most of whom I have not seen in so long because I have been writing this book (and many others). I hope to have a social life at some point. Thanks especially to my favorite nephews and nieces, who are a joy and an inspiration: Nicholas and Joseph Green, Alexander, Valerie, and Lily Johnston.\u003c/p\u003e\n\u003cp\u003eAs always, I would be nothing without my husband, Mike Johnston, who lives and dreams these books with me, but who hates sentimental speeches so I will spare him one. And finally, much love to our little vampire baby to come, who has been with me every step of the way.\u003c/p\u003e\n\u003cp\u003eMELISSA DE LA CRUZ is the author of many books for teens, including Blue Bloods, The Au Pairs series, Angels on Sunset Boulevard, and the upcoming The Ashleys. Her books for adults include the novel Cat\u0027s Meow and an anthology she coedited with Tom Dolby called Girls Who Like Boys Who Like Boys.\u003c/p\u003e\n\u003cp\u003eShe began her career as a magazine and newspaper journalist, covering the New York City style and social scene, and now writes novels full time. Melissa pides her time between New York and Los Angeles, where she lives with her husband. She is currently working on many sequels (and prequels!) to the Blue Bloods series. While Melissa is not a Blue Blood, she knows many people who are.\u003c/p\u003e\n\u003cp\u003eGo to www.melissa-delacruz.com for more information.\u003c/p\u003e\n\u003cp\u003eTHE END \u003c/p\u003e","sourceLink":"https://allnovel.net/masquerade-blue-bloods-2/page-48.html","bookId":2120,"creation":"Oct 5, 2019 6:01:05 PM","modification":"Oct 5, 2019 6:01:05 PM"}
