{"id":87502,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI can’t stand to think of him scared.\u003c/p\u003e\n\u003cp\u003eSo I think of that gazebo, the next place. Valleyview. My cell rings. I step back into Culler’s room and I turn to the window. The sky is turning a deeper blue. Early evening. I just stare at it for a minute before answering. It’s not Milo. It’s Beth.\u003c/p\u003e\n\u003cp\u003e“Where are you?” she hisses.\u003c/p\u003e\n\u003cp\u003e“How did you get my number?”\u003c/p\u003e\n\u003cp\u003e“That doesn’t matter. Where are you?”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Milo called and told me you’ve run off with some strange boy in Haverfield—”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“That’s what I’d like to know! What are you doing?—”\u003c/p\u003e\n\u003cp\u003e“Okay, Beth,” I say, glancing at the door. “First of all, I’m not with some strange boy. I’m with—” Lie. I don’t know why. That’s what my brain is telling me to do—if not lie, don’t tell the whole truth. “I’m with a friend—”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’m with friends.”\u003c/p\u003e\n\u003cp\u003e“A friend or friends? Who?”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter. Everything is fine.”\u003c/p\u003e\n\u003cp\u003e“Oh.” For once I’ve got Beth completely out of her element. She can only talk to me from there. She can’t stop me from doing anything or tell me what to do. She can’t make me come back. Even better: at any point, I could hang up on her. “But I—”\u003c/p\u003e\n\u003cp\u003e“Everything is fine.”\u003c/p\u003e\n\u003cp\u003e“The way Milo put it—”\u003c/p\u003e\n\u003cp\u003e“Milo was wrong. It’s fine.”\u003c/p\u003e\n\u003cp\u003eI’m not mad at Milo about this. Not right now, anyway. Maybe later. Probably later, when I’m closer. It’s like, this far away from him, I can’t even be mad.\u003c/p\u003e\n\u003cp\u003eI like this distance.\u003c/p\u003e\n\u003cp\u003e“Oh.” I can hear Beth breathing on the other end of the line. “Because your mother can’t take any messing around, Eddie. Not after the stunt you pulled the other night. Do you know what that did to her? Do you know what it would do to her again—”\u003c/p\u003e\n\u003cp\u003e“Beth,” I say impatiently, “I’m not—”\u003c/p\u003e\n\u003cp\u003e“I mean, what is this, Eddie? You just go to Haverfield on a whim, have fun with a few friends, leave Milo to go back on his—”\u003c/p\u003e\n\u003cp\u003e“Beth, I’m hanging up—”\u003c/p\u003e\n\u003cp\u003e“No—don’t you dare. I’m not finished yet—”\u003c/p\u003e\n\u003cp\u003eI stay on the line, white hot fury in my gut.\u003c/p\u003e\n\u003cp\u003e“Then finish.”\u003c/p\u003e\n\u003cp\u003e“When will you be coming back?”\u003c/p\u003e\n\u003cp\u003e“I’m not.” I don’t even think it. Just say it.\u003c/p\u003e\n\u003cp\u003e“What?!”\u003c/p\u003e\n\u003cp\u003eI have to hold the phone away from my ear. The idea has me before I have it. It gets tangled up in my stomach. It feels impossibly urgent. I try to swallow, and I can’t.\u003c/p\u003e\n\u003cp\u003eI’m not coming back.\u003c/p\u003e\n\u003cp\u003eI don’t have to come back.\u003c/p\u003e\n\u003cp\u003e“I’m not coming back.”\u003c/p\u003e\n\u003cp\u003e“You just said—”\u003c/p\u003e\n\u003cp\u003e“I changed my mind,” I say. “I’m not—”\u003c/p\u003e\n\u003cp\u003e“Your mother—”\u003c/p\u003e\n\u003cp\u003e“I don’t care. I’m not coming back.”\u003c/p\u003e\n\u003cp\u003e“Eddie, I will call the police—”\u003c/p\u003e\n\u003cp\u003e“Can she handle that? Mom? If you did that?” This must be that attitude Beth was talking about, but I don’t care. “Would she get out of her housecoat ever again, you think?”\u003c/p\u003e\n\u003cp\u003e“Have you lost your mind? This isn’t funny—”\u003c/p\u003e\n\u003cp\u003e“I’m staying in Haverfield for a few days and you’re going to cover for me—”\u003c/p\u003e\n\u003cp\u003e“Eddie—”\u003c/p\u003e\n\u003cp\u003e“Or I won’t come home at all.”\u003c/p\u003e\n\u003cp\u003eI hang up before she can say anything else. My heart pounds in my chest and when I turn around, Culler is behind me. I feel awake, I feel so awake and alive, like I can breathe after ages of not being able to breathe, and I wonder if this is how Milo felt when he ran away from home in the third grade, like if whatever was suffocating him there just magically stopped as soon as he made that choice—to just go.\u003c/p\u003e\n\u003cp\u003eBut this isn’t running away. Not yet.\u003c/p\u003e\n\u003cp\u003eBut it could be.\u003c/p\u003e\n\u003cp\u003e“I can take you back,” Culler says, and I don’t know how much he’s heard. “Whenever you want to go.”\u003c/p\u003e\n\u003cp\u003e“How about a few days from now?”\u003c/p\u003e\n\u003cp\u003eHe laughs. “As tempting as that is—”\u003c/p\u003e\n\u003cp\u003e“I’m serious.”\u003c/p\u003e\n\u003cp\u003eHe waits for me to continue. I feel nervous, sick. But he’ll say yes to this. I know he will. He has to. He started this. He brought it to me, so he has to.\u003c/p\u003e\n\u003cp\u003e“Because I told them I wasn’t coming home—”\u003c/p\u003e\n\u003cp\u003eHis smile vanishes. “Eddie—”\u003c/p\u003e\n\u003cp\u003e“They’re covering for me.” I bite my lip. That’s a lie, maybe. I don’t know yet if Beth will cover for me. But I think she will, because she knows I’m right. My mom is too fragile for this. She’d break. We’d never be able to put her back together. But if I find what I’m looking for, that’s a risk I’m willing to take. “For a few days, until—”\u003c/p\u003e\n\u003cp\u003e“I could put you up…”\u003c/p\u003e\n\u003cp\u003e“No—”\u003c/p\u003e\n\u003cp\u003e“I’m not going to let you wander around Haverfield without anywhere to stay—”\u003c/p\u003e\n\u003cp\u003e“It’s so we can finish,” I interrupt. Part of me feels really warm at the thought that he wouldn’t just let me fumble, that if I only told him I needed to be away from home, he’d let me be away from home here, with him. “We could do Valleyview, Labelle, and Lissie. Get to those places and see what he left behind. Just get in the car. Go.”\u003c/p\u003e\n\u003cp\u003e“A road trip,” he says. “That’s what you mean.”\u003c/p\u003e\n\u003cp\u003e“I have money,” I say really fast. “I’d pay for everything. Gas, food, motel—whatever. Just—I can’t wait all summer. And when I go back home, I’ll probably be in trouble, so I don’t have a lot of time. You’d have to drive and I can’t and—” I swallow. “You have to be there … I mean, you have to.” I grab his arm, like I could convince him to do this just by touching him. “Culler, it needs to be you.”\u003c/p\u003e\n\u003cp\u003eHe stares at me a long time and for a second, I worry he thinks I’ve lost my mind.\u003c/p\u003e\n\u003cp\u003eBut then he asks, “When should we leave?”\u003c/p\u003e\n\u003cp\u003eMinutes after I tell him we should go. That’s when we decide to leave.\u003c/p\u003e\n\u003cp\u003eIt’s simple. It’s not.\u003c/p\u003e\n\u003cp\u003eCuller packs a bag of things and we realize I need things and a bag to pack them in. I spend an hour on the main street, going into the last of the open stores, buying, buying, buying up, while he gets ready at the apartment. I get an overnight bag and clothes—nothing fancy—toothbrush, deodorant, hairbrush. I think I spend too much, but I need it all and besides, I got something—money—when my dad died. I just never thought I’d be able to spend it.\u003c/p\u003e\n\u003cp\u003eThis way feels okay because it’s for him.\u003c/p\u003e\n\u003cp\u003eFor as quickly as we prepare, it all takes too much time. Culler thinks I’m covered—I told him I was—but I feel Beth hovering. I feel like I’m waiting for her to change her mind. And then I get the text from Milo, and he throws a wrench into all my plans.\u003c/p\u003e\n\u003cp\u003eI’M COMING TO GET YOU.\u003c/p\u003e\n\u003cp\u003eI text him back.\u003c/p\u003e\n\u003cp\u003eALREADY GONE. IT’S OK. I PROMISE.\u003c/p\u003e\n\u003cp\u003eI wait.\u003c/p\u003e\n\u003cp\u003eCAN I CALL?\u003c/p\u003e\n\u003cp\u003eTALK WHEN I’M BACK.\u003c/p\u003e\n\u003cp\u003eBETH ASKED ME TO COVER FOR YOU. SHE’S GIVING YOU A WEEK.\u003c/p\u003e\n\u003cp\u003eI feel a rush of relief. THANK YOU.\u003c/p\u003e\n\u003cp\u003eAnd then: I’M GIVING YOU TWO DAYS.\u003c/p\u003e\n\u003cp\u003e“We have to go,” I tell Culler. “Milo is going to ruin everything.”\u003c/p\u003e\n\u003cp\u003e“Unsurprising development,” he comments.\u003c/p\u003e\n\u003cp\u003e“It’s surprising to me,” I mumble.\u003c/p\u003e\n\u003cp\u003eCuller thinks of all these things I don’t. He packs a cooler full of water and food and sunscreen, so we don’t bake in the car in the day, which I never would have thought of. He packs his camera and tells me it’s the minimum, but a lot of things seem to go with it—extra lenses, lens covers, memory cards, chargers. Just everything. I watch him put it all in the backseat. All this to help him process. I envy him that. I wish I had something to process this through. He even packs the photos my father took. Just in case, he tells me.\u003c/p\u003e\n\u003cp\u003eAnd then everything is in the car except us.\u003c/p\u003e\n\u003cp\u003eWe stand outside the station wagon, neither of us moving. This is a big moment and I don’t think we know how to say it. There are sounds all around us. Haverfield is a different place at night than Branford. People talk and walk the street, laughing. Enjoying the summer.\u003c/p\u003e\n\u003cp\u003e“Okay,” Culler says.\u003c/p\u003e\n\u003cp\u003eThat’s it.\u003c/p\u003e\n\u003cp\u003eWe get in the car.\u003c/p\u003e\n\u003cp\u003eIt feels like being in one of the funeral cars, with my mom. Parked behind the hearse, waiting to pull out in traffic. Holding her hand. It’s not exactly like that, but it feels like that. One of those moments where you know things are going to be so different afterward. When I found my dad, I knew things were going to change forever, but sitting next to her, getting ready to see him buried, I felt it in a different way. Everything ached.\u003c/p\u003e\n\u003cp\u003eThis reminds me of that—how it aches.\u003c/p\u003e\n\u003cp\u003eBut it’s a better ache, too.\u003c/p\u003e\n\u003cp\u003eI’m hopeful.\u003c/p\u003e\n\u003cp\u003eI can’t remember the last time I felt hopeful.\u003c/p\u003e\n\u003cp\u003eThe ride to Valleyview is quiet. Maybe because it’s night and because there are so few cars on the road. Maybe Culler needs to absorb this in silence because it’s happening to him too.\u003c/p\u003e\n\u003cp\u003eSix hours of road are stretched ahead of us and it’s starting to sink in, what I’ve done. Milo texts me as soon as we pass the THANK YOU FOR VISITING HAVERFIELD! sign. It’s like he can sense that I’ve reached that point of no return. We go back and forth.\u003c/p\u003e\n\u003cp\u003ePLEASE LET ME CALL.\u003c/p\u003e\n\u003cp\u003eNOT A GOOD TIME.\u003c/p\u003e\n\u003cp\u003eWHY?\u003c/p\u003e\n\u003cp\u003eON THE ROAD.\u003c/p\u003e\n\u003cp\u003eWHERE?\u003c/p\u003e\n\u003cp\u003eDOESN’T MATTER. EVERYTHING’S OK.\u003c/p\u003e\n\u003cp\u003eMy stomach twists with guilt. Beth probably made it sound bad, what I said to her. But he knows me. He should know I only kind of meant it.\u003c/p\u003e\n\u003cp\u003eStreetlights disappear. The farther we get from Haverfield, the more stars there are. I roll down the window and rest my head against the frame, hoping the mild summer air will keep me awake. I’m crashing, but it wouldn’t be fair to Culler to fall asleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/fall-for-anything/page-25.html","bookId":2265,"creation":"Oct 5, 2019 5:23:02 PM","modification":"Oct 5, 2019 5:23:02 PM"}
