{"id":87507,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“About an hour ago—I’m sorry, what did you say your name was?”\u003c/p\u003e\n\u003cp\u003eI hang up.\u003c/p\u003e\n\u003cp\u003eFourteen hours gives you a lot of time to rationalize.\u003c/p\u003e\n\u003cp\u003eThe more I think about it, the less sense it makes. Culler is not a fuck-and-run type guy. We didn’t even have sex. He just took my picture. So maybe something happened, like a family emergency. The kind that’s so bad, there’s no time to tell anyone about it. You just have to get up and go and hope that the people you ditched will forgive you after you explain to them that it was a matter of life and death. That kind of thing.\u003c/p\u003e\n\u003cp\u003eI search the motel again, for a note, just in case. I check behind the bed where I find—ugh, an old, used condom. I search under the pillows and the mattress, feeling stupider by the second. The nightstand. I find a Bible there, like those motels in the movies, or maybe that’s how motels really are. I check the chairs, behind the TV.\u003c/p\u003e\n\u003cp\u003eThere’s nothing.\u003c/p\u003e\n\u003cp\u003eI bury my face in my hands and think. Just think. This is not right. There is a reason he would do this to me.\u003c/p\u003e\n\u003cp\u003eMaybe—maybe …\u003c/p\u003e\n\u003cp\u003eMaybe he was scared of what we’d find at the church. My heart jolts at this—finally, an answer that seems feasible. Maybe it all got to be too much for him. I’d understand that.\u003c/p\u003e\n\u003cp\u003eIt has to be something like that.\u003c/p\u003e\n\u003cp\u003eBut I wish he’d told me he felt that way, because I’d forgive him that.\u003c/p\u003e\n\u003cp\u003eIf he told me that, I’d forgive him.\u003c/p\u003e\n\u003cp\u003eHow I wait for Milo:\u003c/p\u003e\n\u003cp\u003eI channel surf. I take four showers. I sit on the curb for a while and pretend Milo’s just seconds away from pulling up until a gross-looking girl who might be in her early thirties comes up and asks me if I want to hang out in her room with her and her boyfriend. I go back to my room. I bury myself under the bed covers until I think of the condom I found behind the bed and then I take another shower. And then I decide it doesn’t even matter, because I’ve already slept here. I climb back into bed with all of my clothes on and the TV on and I close my eyes and I go to sleep and the next time I open my eyes, it’s late and someone’s knocking on the door.\u003c/p\u003e\n\u003cp\u003e“Eddie? It’s me.”\u003c/p\u003e\n\u003cp\u003eI crawl out of bed faster than I can wake up. My mouth is dry and my head is heavy. I pad across the room and open the door and Milo stands there, trip-tired and pale, like he didn’t even stop once, but when I glance at the clock on the TV channel guide, I know that must not be true. Before I can say a word, he wraps his arms around me and I think it’s the best thing he could do because then I can pretend I’m holding him up. Like he needs me right now and if I pretend this, I have to make myself forget about everything that’s wrong and just be here for him. Keep it together for him.\u003c/p\u003e\n\u003cp\u003eWhat ends up happening is we both keep telling each other everything’s okay.\u003c/p\u003e\n\u003cp\u003eI dig my fingers into his shirt.\u003c/p\u003e\n\u003cp\u003eWhen we finally manage to let each other go, the first thing Milo does is call home. He asks if I want to talk to anyone. I shake my head. I can’t imagine talking to anyone there. Not Mom. Definitely not Beth. When I think of going home, I try to think of the place; my bed and the house. Things. Not the total mess of people that is waiting for me.\u003c/p\u003e\n\u003cp\u003ePeople who are probably really mad at me.\u003c/p\u003e\n\u003cp\u003eHe goes into the bathroom to make that call. I don’t know why. And then he takes a shower. When he comes out in a T-shirt and shorts, his hair wet and stuck to his head, his eyes drift over the lone bed in the room. He doesn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Do you want something to eat?” I ask awkwardly, after a second. “We can check … maybe something’s open.…”\u003c/p\u003e\n\u003cp\u003e“I just want to sleep.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t look at me.\u003c/p\u003e\n\u003cp\u003e“Milo, I didn’t…”\u003c/p\u003e\n\u003cp\u003eI gesture to the bed, feebly.\u003c/p\u003e\n\u003cp\u003e“Eddie,” he says, “I didn’t ask.”\u003c/p\u003e\n\u003cp\u003eHe crosses the room and digs into his coat pocket. He hands me a small envelope.\u003c/p\u003e\n\u003cp\u003e“What’s this?” I ask.\u003c/p\u003e\n\u003cp\u003e“From Beth,” he says.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “Don’t ask me.”\u003c/p\u003e\n\u003cp\u003e“Not my mom?”\u003c/p\u003e\n\u003cp\u003eHe pauses. “Your mom’s been in her room since she found out.”\u003c/p\u003e\n\u003cp\u003eI try to ignore the guilt that wants to take over. I open the envelope with shaking hands and find a little travel package of … Vitamin C tablets. So Beth. But the note she’s put with them is not so Beth. A folded piece of paper. Inside, her immaculate handwriting:\u003c/p\u003e\n\u003cp\u003eJust come home. We need you here. Beth\u003c/p\u003e\n\u003cp\u003eIt scares me. It makes me want to cry, but I think I’ve cried enough today. Even I’m not stupid enough to overlook that we, because Beth chooses her words carefully. She wouldn’t just put that if she didn’t want to include herself. If she didn’t want to include herself, she’d put something like, your mother needs you here. But she didn’t write that. We.\u003c/p\u003e\n\u003cp\u003eWe need you here.\u003c/p\u003e\n\u003cp\u003eThis must be serious.\u003c/p\u003e\n\u003cp\u003eI put the note and the tablets in my bag. Milo lies on the bed, on top of the comforter. He lies on my side of the bed, not Culler’s. It would be so weird if he was where Culler was. He throws his arm over his eyes. This silence—is so bad. It’s a relief in a way, but it’s bad too.\u003c/p\u003e\n\u003cp\u003eI turn off the lights and lay next to him.\u003c/p\u003e\n\u003cp\u003eI face the wall.\u003c/p\u003e\n\u003cp\u003e“What happened with Culler?”\u003c/p\u003e\n\u003cp\u003e“I woke up and he was gone.”\u003c/p\u003e\n\u003cp\u003eIt does not get easier to say.\u003c/p\u003e\n\u003cp\u003e“What happened before that?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003eI wonder how much I have to tell him. If I have to say the part where, no, we didn’t have sex—don’t worry about that, Milo—but he took photographs and I wasn’t wearing any clothes. And then it feels like there’s a weight on my chest because the last thing Culler did was take my picture when I wasn’t wearing any clothes. No. No. No.\u003c/p\u003e\n\u003cp\u003eThat is not the last time I’m going to see Culler.\u003c/p\u003e\n\u003cp\u003eI’ll find him.\u003c/p\u003e\n\u003cp\u003e“Eddie,” Milo says.\u003c/p\u003e\n\u003cp\u003eI go to the moment before that: the house. I tell Milo about the house and telling him is like being there again, seeing those words stuck in that place and saying those words out loud, they get stuck in my throat. What my father thought of this. Us.\u003c/p\u003e\n\u003cp\u003e“You scared the hell out of me,” he says when I finish.\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“And you’re no one’s burden,” he adds after a while.\u003c/p\u003e\n\u003cp\u003eWe fall silent. It’s amazing the way I am learning silence. My father’s death changed the way I feel it, interpret it. It’s this constantly evolving language I can’t keep up with. A language I don’t want to keep up with.\u003c/p\u003e\n\u003cp\u003e“Did you think I was going to kill myself?” I ask him.\u003c/p\u003e\n\u003cp\u003e“Eddie, don’t.”\u003c/p\u003e\n\u003cp\u003e“What would you have done if I had?” Why do I do this. Why can’t I stop doing this. “What happened after you found me?”\u003c/p\u003e\n\u003cp\u003eI face him. I hear the same sad sounds coming from outside that I heard the night before. People staying up too late and being depressed on the curb.\u003c/p\u003e\n\u003cp\u003eMilo doesn’t say anything for the longest time, but I know this time—he will.\u003c/p\u003e\n\u003cp\u003e“You were holding his hands,” Milo says, and my breath catches in my throat because there really is no preparing for something like this, even when you know it’s coming and you’ve wanted it forever. “You wouldn’t let them go. They were locked … and I had to force each of your fingers from his … each one … and I made you let him go.” He stops. “That’s it. That’s what happened.”\u003c/p\u003e\n\u003cp\u003e“That’s what you wouldn’t tell me.” I want to tell him that’s not awful, that I was expecting worse. Or maybe there was a point before all this where it might have been bad, but everything that’s happened since … it doesn’t even measure up. “You should have told me.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “You don’t understand…”\u003c/p\u003e\n\u003cp\u003eI move closer to him. He seems to tense.\u003c/p\u003e\n\u003cp\u003e“Eddie, it’s like you died that night,” he whispers.\u003c/p\u003e\n\u003cp\u003eSo that’s it. I died.\u003c/p\u003e\n\u003cp\u003eI’ve been dead.\u003c/p\u003e\n\u003cp\u003eI blink back tears and pick at the mattress, but I don’t say anything. I don’t know what I could say to him. I don’t know how to convince him I’m still here when I’m not even sure of it myself anymore.\u003c/p\u003e\n\u003cp\u003eWhen I wake up, I check my phone. Nothing from Culler. It’s like he never existed. There is no evidence of him anywhere. But I know he exists, because I wouldn’t be here if he didn’t. I know he exists because every time I think of him, I want to break things.\u003c/p\u003e\n\u003cp\u003eMilo calls home and tells them we’re on our way. I’m sick about going back again. I’ve barely been away, but everything’s changed. Some small part of me wonders if Mom will wear this experience on her face, on top of Dad’s death, and I won’t be able to recognize her. Or if I will wear it on mine, and whether or not she’ll be able to recognize me.\u003c/p\u003e\n\u003cp\u003eWe pack up my things and put them in the car. Dawn has barely broken. Milo follows me to the clerk’s office, where I return the room key. The clerk doesn’t even look surprised at the addition of Milo, a different boy from the one I came here with.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he says.\u003c/p\u003e\n\u003cp\u003e“Have a good one,” Milo says.\u003c/p\u003e\n\u003cp\u003eWe’re almost to the door when the clerk goes, “Oh! Hey. Wait. You’re the one that asked about the church, aren’t you?”\u003c/p\u003e\n\u003cp\u003eI turn. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Well, you ran off before I could tell you where it was,” he says, and my heart stops. “You take Crispell Street and turn left onto Seals, keep going until you hit the highway. Turn right, first dirt road you see. About fifteen miles down, you’ll find your absolution.”\u003c/p\u003e\n\u003cp\u003eMy stomach lurches. I turn to Milo, but he’s not looking at me. I wipe my palms on my jeans. My heart is beating fast and insistent in my chest. I taste hope. I don’t need Culler for this. Ask him, ask him, ask him, ask him …\u003c/p\u003e\n\u003cp\u003e“Milo,” I say as we pull out of the parking lot. But I don’t know how to ask so I just end up saying his name again: “Milo—”\u003c/p\u003e\n\u003cp\u003e“I know,” he says. But that’s all he says. \u003c/p\u003e","sourceLink":"https://allnovel.net/fall-for-anything/page-30.html","bookId":2265,"creation":"Oct 5, 2019 5:23:02 PM","modification":"Oct 5, 2019 5:23:02 PM"}
