{"id":87482,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI would never make him do anything about it.\u003c/p\u003e\n\u003cp\u003eI don’t know how long I’m sitting in the dirt, fixating on this before I feel like I’m not alone. A chill crawls up my spine and I look up. The roof is empty. I’m too afraid to go up there, even though that’s all I want to do. I want to go up there and see if there are any traces of my dad left, but just the idea makes my palms sweat and I can’t breathe. I tried to, once. I got inside and tried so hard to fumble my way up to the roof in the dark, but I just couldn’t do it.\u003c/p\u003e\n\u003cp\u003eI stand and brush off my jeans. There’s no one on the roof, but I can’t shake that feeling.\u003c/p\u003e\n\u003cp\u003eSomeone’s here, somewhere.\u003c/p\u003e\n\u003cp\u003eI scan the windows because something in my gut is telling me to and that’s when I see it—a face coming through one of the pieces of glass, warped and distorted. I stumble back at the shock of it. I’m not alone. But then I blink and the face is gone.\u003c/p\u003e\n\u003cp\u003eI’ve seen scary movies like this before. This is that moment just before I get killed. I try to pick up my bike, but my dying hands are going out on me and it takes forever to get the thing righted, and by the time I do there’s a voice behind me.\u003c/p\u003e\n\u003cp\u003e“Hey. Wait—”\u003c/p\u003e\n\u003cp\u003eIt’s not a voice I recognize. A boy’s voice. I stop moving, but I don’t turn around. His footsteps crunch across the gravel and dirt and my head is telling me to move but I don’t.\u003c/p\u003e\n\u003cp\u003eThe footsteps stop just short of me. I keep my back to them.\u003c/p\u003e\n\u003cp\u003e“I saw you from the window,” the boy says. “I startled you … sorry.”\u003c/p\u003e\n\u003cp\u003eI’m still startled. I can’t make myself turn around. He sounds okay, but I’m afraid whoever he is—that he won’t have a nice face. The way it came through the window made it seem creepy. But this should be the last thing that worries me. There are so many other reasons to be afraid of a strange guy hanging around an abandoned warehouse outside of town, but …\u003c/p\u003e\n\u003cp\u003eI face him.\u003c/p\u003e\n\u003cp\u003eI don’t know what I’m expecting. Maybe not this. Maybe exactly this. A boy, kind of. Post-boy? He’s definitely older than seventeen, but not twenty-five, and he has a five o’clock shadow and needs to shave. There’s a camera around his neck. A Nikon. He’s wearing jeans and a T-shirt, and the T-shirt he’s wearing has a big white arrow pointing down, so for a second, I’m staring at his crotch when I should be staring at his face.\u003c/p\u003e\n\u003cp\u003eHis face: he has a mop of dirty-blond hair and hazel eyes.\u003c/p\u003e\n\u003cp\u003eThe whole time I’m studying him, he’s studying me.\u003c/p\u003e\n\u003cp\u003eHe takes a step back, a small smile on his mouth.\u003c/p\u003e\n\u003cp\u003eHis eyes travel from my feet, up my legs, lingering on my hips, my waist, past my chest, to my eyes. A voice inside my head tells me I should go because this isn’t safe because awkward moments like these can precede far more sinister things, but instead I ask, “Are you a photographer or are you just pretending?”\u003c/p\u003e\n\u003cp\u003eHe brings his hands to his Nikon but he doesn’t say anything. I wonder if he’s a vulture. If he was somehow aware this was a place my father frequented or if more people come out here to take photographs than I ever knew about. After a second, he wipes his hand on his shirt and holds it out. I don’t move. That makes him laugh.\u003c/p\u003e\n\u003cp\u003e“I’m Culler Evans,” he says. “And you are Eddie Reeves.”\u003c/p\u003e\n\u003cp\u003eI move back. “How do you know my name?”\u003c/p\u003e\n\u003cp\u003e“You look just like your father. I mean, when he was younger.”\u003c/p\u003e\n\u003cp\u003eI lose myself for a minute, absorbing these extraordinary words, and then I search his face for the lie. Culler holds out his hand again.\u003c/p\u003e\n\u003cp\u003e“I’m Culler Evans,” he repeats.\u003c/p\u003e\n\u003cp\u003eI stare at it for a second and then I shake it.\u003c/p\u003e\n\u003cp\u003e“Eddie Reeves.”\u003c/p\u003e\n\u003cp\u003e“I’m…” he pauses. “I am unbelievably sorry about your dad.”\u003c/p\u003e\n\u003cp\u003e“So you knew him.”\u003c/p\u003e\n\u003cp\u003eCuller’s hand comes to his Nikon. “I was his student.”\u003c/p\u003e\n\u003cp\u003e“Oh…” I flush. “Sorry. I didn’t—” I stop. “My dad didn’t really take on students.”\u003c/p\u003e\n\u003cp\u003e“I was an exception,” Culler says. He doesn’t sound like he’s lying. “I’m not all that surprised you haven’t heard of me. I know your dad preferred to keep his work to himself, separate from home … maybe not so much the opposite.” I stare at him blankly. “I mean he loved to talk about you.”\u003c/p\u003e\n\u003cp\u003eI don’t even know what to say to that.\u003c/p\u003e\n\u003cp\u003e“It really wasn’t my intent to startle you.” Culler looks around and then points back to the building. “I know he spent a lot of time here, so I’ve been coming out, just trying to figure it all out, I guess. I mean, to understand why he’d…”\u003c/p\u003e\n\u003cp\u003eHe trails off and my heart gets all excited. Me too, I want to tell him. Every night. Every night, I come here. But I don’t. Not yet. Not yet? And then I realize in the time we’ve been talking, he is standing much closer to me than he was before.\u003c/p\u003e\n\u003cp\u003eI stare at his face. Twenty-one, maybe?\u003c/p\u003e\n\u003cp\u003eTwenty-two?\u003c/p\u003e\n\u003cp\u003e“You’ll never figure it out,” I tell him. “I haven’t yet.”\u003c/p\u003e\n\u003cp\u003eI should be scared. I’m too comfortable around Culler Evans, who says he knows my dad, who says he was his student. Maybe he’s an obsessed fan. My dad used to get fan letters from a woman who said his work was her soul. She sent him naked pictures and she was sixty-five. For a while, my dad stuck them to the fridge. Mom loved that.\u003c/p\u003e\n\u003cp\u003e“We’ll see,” he says.\u003c/p\u003e\n\u003cp\u003e“Culler Evans,” I say, trying to figure out if he is a lie.\u003c/p\u003e\n\u003cp\u003e“I sent a sympathy card. I met your mom once. Robyn.”\u003c/p\u003e\n\u003cp\u003eTwenty-one. Maybe.\u003c/p\u003e\n\u003cp\u003e“How old are you?” I blurt out, and then I feel stupid. Culler stares at me, amused. I don’t know why it even matters. “I mean, you look a little young to be my father’s student…”\u003c/p\u003e\n\u003cp\u003e“Twenty.” He holds up his camera and I cover my face instinctively. He laughs and says, “Camera shy? That’s kind of funny.”\u003c/p\u003e\n\u003cp\u003e“I don’t even know you.”\u003c/p\u003e\n\u003cp\u003e“Fair enough, Eddie Reeves.”\u003c/p\u003e\n\u003cp\u003eHe lowers the camera.\u003c/p\u003e\n\u003cp\u003e“How often do you come out here?” I ask him.\u003c/p\u003e\n\u003cp\u003e“How often do you?” he asks back.\u003c/p\u003e\n\u003cp\u003eI step back. This is insane. I need proof of Culler Evans’s existence before this goes any further. It’s not enough for him to stand in front of me and tell me things like this. I want to hear it from my dad, but I’ll never hear it from my dad.\u003c/p\u003e\n\u003cp\u003e“I should go,” I say abruptly.\u003c/p\u003e\n\u003cp\u003e“Think I’ll stick around,” he says. “The light’s pretty great right now. But it was nice to meet you, Eddie Reeves.” He studies me. “If I figure it out, I’ll let you know.”\u003c/p\u003e\n\u003cp\u003eI don’t say anything. I bike toward the highway, my heart beating hard in my chest, and when I glance back, Culler is standing on the exact spot my father lay, watching me.\u003c/p\u003e\n\u003cp\u003eMom and Beth are reminiscing over wine in the living room and Mom has been wasted for as long as she’s been talking and laughing, so that’s a couple of hours.\u003c/p\u003e\n\u003cp\u003eIt’s creepy, hearing her laugh. I’m so used to her silence.\u003c/p\u003e\n\u003cp\u003eI spend most of the evening avoiding them and looking for the sympathy cards that flooded the mail the first two weeks after Dad died. I have to search the whole house. I can’t ask Mom where they are because I don’t want asking her to be the difference between her being a happy drunk and a sad one, even though I’d rather she not be drunk at all.\u003c/p\u003e\n\u003cp\u003eI eventually find the cards strewn haphazardly in the very back of the junk drawer in the kitchen. I gather them up. They’re still in the envelopes they came in because at some point, we have to send thank-you cards back, I think. Thank you for your sympathy. I set them in a neat pile on the table and find the envelope with Culler’s name and address near the bottom of it. His card is white watercolor paper, folded in half. It’s completely blank on the front.\u003c/p\u003e\n\u003cp\u003eI think I love it.\u003c/p\u003e\n\u003cp\u003eI think I love the idea that my dad’s death could be so far beyond any cheap sentiment you could put on the front of a sympathy card. I hope Culler meant it that way.\u003c/p\u003e\n\u003cp\u003eI open it up.\u003c/p\u003e\n\u003cp\u003eHe is missed.\u003c/p\u003e\n\u003cp\u003eCuller Evans\u003c/p\u003e\n\u003cp\u003eI stare at the card for a long time, tracing over the letters with my finger. That’s how I think it should be. Everything is complicated now but this is simple and true: he is missed. I want to go into the sympathy card business. I want all the cards to be like that. Forget sappy messages about overcoming; I want ones that say NOW YOU’LL BE A LESSER PERSON THAN YOU WERE or WE CANNOT POSSIBLY UNDERSTAND or I CAN UNDERSTAND BECAUSE SOMEONE I KNOW DIED TOO or maybe something about how grief can make your skin feel sore and bruised and electric because that’s how my skin has felt ever since, except for my hands.\u003c/p\u003e\n\u003cp\u003eMom cackles from the living room. I hear the clink of glass against the table and then she’s slurring, “Oh no! No! Oh—God, get a paper towel, Beth!”\u003c/p\u003e\n\u003cp\u003eAnd then a knock on the front door.\u003c/p\u003e\n\u003cp\u003eI hastily put the cards back into the junk drawer.\u003c/p\u003e\n\u003cp\u003e“Someone’s at the door,” I call into the living room. Nobody says anything and the knocking persists. “I said someone’s at the door. Maybe one of you should get it.”\u003c/p\u003e\n\u003cp\u003e“We’re busy.” Beth. “So get it yourself please. And if it’s anyone for your mother, tell them she can’t talk right now.”\u003c/p\u003e\n\u003cp\u003e“I can talk just fine, thank you very much,” Mom insists, dissolving into giggles. “Do you want me to recite the alphabet?”\u003c/p\u003e\n\u003cp\u003eI close my eyes and count to ten.\u003c/p\u003e\n\u003cp\u003eWhoever is outside is still knocking.\u003c/p\u003e\n\u003cp\u003eGo away.\u003c/p\u003e\n\u003cp\u003eMy cell chimes in my pocket. I answer it.\u003c/p\u003e\n\u003cp\u003e“Open the door already.” Milo. “I’m not moving until you do.”\u003c/p\u003e\n\u003cp\u003eI kind of thought so. I hang up and open the front door. He’s there. At first, I cross my arms like I’m mad at him, but I don’t think I am. I mean, I kind of am, but I don’t know. I step onto the porch and close the door behind me.\u003c/p\u003e\n\u003cp\u003e“What?” he asks. “I’m not allowed inside now?”\u003c/p\u003e\n\u003cp\u003e“You don’t want to go in there. Trust me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fall-for-anything/page-5.html","bookId":2265,"creation":"Oct 5, 2019 5:23:02 PM","modification":"Oct 5, 2019 5:23:02 PM"}
