{"id":42692,"no":23,"title":"Chapter xxi.","content":"More Wise Words of Brynhild.\n\u003cbr\u003e \n\u003cbr\u003e Sigurd spake now, “Sure no wiser woman than thou art one may be found in the wide world; yea, yea, teach me more yet of thy wisdom!”\n\u003cbr\u003e \n\u003cbr\u003e She answers, “Seemly is it that I do according to thy will, and show thee forth more redes of great avail, for thy prayer’s sake and thy wisdom;” and she spake withal —\n\u003cbr\u003e \n\u003cbr\u003e “Be kindly to friend and kin, and reward not their trespasses against thee; bear and forbear, and win for thee thereby long enduring praise of men.\n\u003cbr\u003e \n\u003cbr\u003e “Take good heed of evil things: a may’s love, and a man’s wife; full oft thereof doth ill befall!\n\u003cbr\u003e \n\u003cbr\u003e “Let not thy mind be overmuch crossed by unwise men at thronged meetings of folk; for oft these speak worse than they wot of; lest thou be called a dastard, and art minded to think that thou art even as is said; slay such an one on another day, and so reward his ugly talk.\n\u003cbr\u003e \n\u003cbr\u003e “If thou farest by the way whereas bide evil things, be well ware of thyself; take not harbour near the highway, though thou be benighted, for oft abide there ill wights for men’s bewilderment.\n\u003cbr\u003e \n\u003cbr\u003e “Let not fair women beguile thee, such as thou mayst meet at the feast, so that the thought thereof stand thee in stead of sleep, and a quiet mind; yea, draw them not to thee with kisses or other sweet things of love.\n\u003cbr\u003e \n\u003cbr\u003e “If thou hearest the fool’s word of a drunken man, strive not with him being drunk with drink and witless; many a grief, yea, and the very death, groweth from out such things.\n\u003cbr\u003e \n\u003cbr\u003e “Fight thy foes in the field, nor be burnt in thine house.\n\u003cbr\u003e \n\u003cbr\u003e ‘Never swear thou wrongsome oath; great and grim is the reward for the breaking of plighted troth.\n\u003cbr\u003e \n\u003cbr\u003e “Give kind heed to dead men, — sick-dead, Sea-dead, or ~word-dead; deal heedfully with their dead corpses.\n\u003cbr\u003e \n\u003cbr\u003e “Trow never in him for whom thou hast slain father, brother, or whatso near kin, yea, though young he be; ‘for oft waxes wolf in youngling’.\n\u003cbr\u003e \n\u003cbr\u003e “Look thou with good heed to the wiles of thy friends; but little skill is given to me, that I should foresee the ways of thy life; yet good it were that hate fell not on thee from those of thy wife’s house.”\n\u003cbr\u003e \n\u003cbr\u003e Sigurd spake, “None among the sons of men can be found wiser than thou; and thereby swear I, that thee will I have as my own, for near to my heart thou liest.”\n\u003cbr\u003e \n\u003cbr\u003e She answers, “Thee would I fainest choose, though I had all men’s sons to choose from.”\n\u003cbr\u003e \n\u003cbr\u003e And thereto they plighted troth both of them.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1417/42504.html","bookId":1390,"creation":"Aug 11, 2019 6:12:08 AM","modification":"Aug 11, 2019 6:12:08 AM"}
