{"id":70112,"no":12,"title":"Page 12","content":"\u003cp\u003eShe felt encouraged that Steve had phoned her back, but she suspected he regretted it now.\u003c/p\u003e\n\u003cp\u003e“You know what you said earlier?” she began.\u003c/p\u003e\n\u003cp\u003e“I said lots of things earlier. Which particular thing are you referring to?”\u003c/p\u003e\n\u003cp\u003eMeg guessed his sarcasm was warranted. After all, she’d wounded his ego, and he wasn’t giving her the chance to do it again. “About the two of us, you know, dating.”\u003c/p\u003e\n\u003cp\u003e“You said Lindsey wouldn’t like it.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t,” Meg said. “She asked me not to see you again.”\u003c/p\u003e\n\u003cp\u003eHis gaze pinned hers. “Did you agree?”\u003c/p\u003e\n\u003cp\u003e“Not … entirely.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed with a frown. “You’d better explain.”\u003c/p\u003e\n\u003cp\u003e“Well, as you’ve already surmised, Lindsey isn’t keen on me seeing you. Which is exactly the reason you stopped by the house and did your biker routine, right? Well, it worked. She’s worried that you’re the wrong man for me.” It would’ve helped if he hadn’t bragged about his prison record and mentioned his parole officer’s name. But now didn’t seem to be the time to bring that up.\u003c/p\u003e\n\u003cp\u003e“Did you or did you not promise her you wouldn’t see me again?”\u003c/p\u003e\n\u003cp\u003e“Neither.” Meg sipped from the disposable cup and grimaced at the taste of burned coffee.\u003c/p\u003e\n\u003cp\u003e“Then what did you say to her?”\u003c/p\u003e\n\u003cp\u003eMeg lifted one shoulder in a shrug. “That I’d think about it.”\u003c/p\u003e\n\u003cp\u003e“Have you?”\u003c/p\u003e\n\u003cp\u003ePropping her elbows on the table’s edge, Meg swirled the black liquid around the cup and avoided looking at Steve. “I called you, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“I still haven’t figured out why.”\u003c/p\u003e\n\u003cp\u003eThat was the problem: she hadn’t, either. Not really. “I guess it’s because you have a point about seeing each other again.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah?” He gave her a cocky grin.\u003c/p\u003e\n\u003cp\u003eHer anger flared. “Would you stop it?”\u003c/p\u003e\n\u003cp\u003e“Stop what?” he asked innocently.\u003c/p\u003e\n\u003cp\u003e“The next thing I know, you’re going to ask me how much I enjoyed kissing you.”\u003c/p\u003e\n\u003cp\u003eSteve smiled for the first time. “It wouldn’t hurt to know.”\u003c/p\u003e\n\u003cp\u003e“All right, since it means so much to you, I’ll admit it. No man’s ever kissed me the way you do. It scares me—but at the same time I wish it could go on forever.” Having admitted this much, she supposed she might as well say it all. “My marriage left me wondering if I was … if I was capable of those kinds of feelings ….” She paused and lowered her eyes. “I was afraid I was, you know, frigid,” she said in a choked whisper.\u003c/p\u003e\n\u003cp\u003eShe stared down at her coffee, then took a sip, followed by several more, as if the vile stuff were the antidote to some dreaded illness.\u003c/p\u003e\n\u003cp\u003eThe last thing she expected her small confession to provoke in Steve was a laugh. “You’re joking!”\u003c/p\u003e\n\u003cp\u003eShe shook her head forcefully. “Don’t laugh. Please.”\u003c/p\u003e\n\u003cp\u003eHis hand reached for hers and their fingers entwined. “I wasn’t laughing at you, Meg,” he said gently. “You’re one of the most sensual women I’ve ever met. Trust me, if you’re frigid—and there’s a word I haven’t heard in years—then I’m a monk.”\u003c/p\u003e\n\u003cp\u003eMeg looked up and offered him a fragile smile. It astonished her that this man who’d known her for only a few days could chase away the doubts that had hounded her through the years after her divorce.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “I, uh, don’t think you should look at me like that.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like you want me to kiss you.”\u003c/p\u003e\n\u003cp\u003eHer eyes drifted shut. “Maybe I do …. That’s what makes everything so complicated. I’m really attracted to you. I haven’t felt like this before—not ever, not even with my ex-husband, and like I said, that scares me.”\u003c/p\u003e\n\u003cp\u003eHe stood up, still holding Meg’s hand, and tugged her to her feet.\u003c/p\u003e\n\u003cp\u003e“Where are we going?” she asked.\u003c/p\u003e\n\u003cp\u003e“Someplace private,” he said, scanning the store. He led her through the frozen food section, past the bakery and into a small alcove where the wine was kept. With her back to the domestic beer, he brought her into his arms and covered her mouth with his.\u003c/p\u003e\n\u003cp\u003eTheir kiss was rough with need, but she wasn’t sure whose need was greater. Meg could feel Steve’s heart racing as hard as her own. She supposed she should’ve pulled away, ended the kiss, stepped out of his arms. But Meg didn’t want that.\u003c/p\u003e\n\u003cp\u003eSteve yawned. He was so tired. With good reason. It’d been almost three before he’d gone to bed and four before he’d been able to fall asleep. His alarm had gone off at six.\u003c/p\u003e\n\u003cp\u003eHe arrived at the shop and made a pot of coffee. He mumbled a greeting when Gary got in.\u003c/p\u003e\n\u003cp\u003e“I hope you’re in a better mood than you were yesterday,” his foreman told him. “What’s wrong with you, anyway?”\u003c/p\u003e\n\u003cp\u003eSteve checked over the job orders for the day. “Women,” he muttered in explanation and apology.\u003c/p\u003e\n\u003cp\u003e“I should’ve guessed. What’s going on?”\u003c/p\u003e\n\u003cp\u003e“You don’t want to hear this,” he said and headed for the garage.\u003c/p\u003e\n\u003cp\u003e“Sure I do,” Gary said, following him. “I don’t suppose this has anything to do with Nancy, does it?”\u003c/p\u003e\n\u003cp\u003eSteve glared at him. “What do you know about my sister?”\u003c/p\u003e\n\u003cp\u003e“Not much,” Gary said and held up both hands. “Just what you said about her fixing you up with some woman. It’s none of my business, but you and this woman seem to be hitting it off just fine.”\u003c/p\u003e\n\u003cp\u003eSteve continued to glare at him. “What makes you say that?”\u003c/p\u003e\n\u003cp\u003eGary laughed. “I haven’t seen you this miserable in years. Which probably means you’ve fallen for her. Why don’t you put yourself out of your misery? Shoot yourself and be done with it.”\u003c/p\u003e\n\u003cp\u003eFrowning, Steve turned away. The kid was a smartass, although now that Steve thought about it, Gary might have come up with the perfect solution.\u003c/p\u003e\n\u003cp\u003eIt was noon before Steve had a chance to go into his office. He made sure no one was looking, then closed the door and reached for the phone.\u003c/p\u003e\n\u003cp\u003e“Book Ends, Laura speaking,” a woman said in a friendly voice.\u003c/p\u003e\n\u003cp\u003e“Is Meg available?” he asked, sounding as businesslike as possible.\u003c/p\u003e\n\u003cp\u003e“May I ask who’s calling?”\u003c/p\u003e\n\u003cp\u003eSteve hesitated. “Steve Conlan.”\u003c/p\u003e\n\u003cp\u003e“One minute, please.”\u003c/p\u003e\n\u003cp\u003eIt took longer than that for Meg to get on the line. “Steve, hi.” She seemed tired but happy to hear from him. That helped.\u003c/p\u003e\n\u003cp\u003e“How are you?” he asked, struggling to hold back a yawn.\u003c/p\u003e\n\u003cp\u003e“Dead on my feet. I’m not as young as I used to be.”\u003c/p\u003e\n\u003cp\u003e“Does Lindsey know you slipped out of the house last night?”\u003c/p\u003e\n\u003cp\u003e“No, but I should never have stayed out that late.”\u003c/p\u003e\n\u003cp\u003eSteve didn’t have any argument there. They’d left the Albertson’s store when a stock boy stumbled upon them in the wine section, embarrassing Meg no end—although Steve had rather enjoyed the way her blush had brightened her cheeks.\u003c/p\u003e\n\u003cp\u003eWith no other idea of where to take her at that hour, Steve had driven down to Alki Point in west Seattle, where they sat on the beach and talked.\u003c/p\u003e\n\u003cp\u003eThey hadn’t discussed anything of earth-shattering importance, but he discovered that they had a great deal in common. Mostly, he discovered that he liked Meg. He was already well aware of what Meg, the sensuous and beautiful woman, was capable of doing to him physically. Last night, he learned about Meg, the person.\u003c/p\u003e\n\u003cp\u003eThey hadn’t kissed again. Steve was convinced they both knew how dangerous kissing had become. It wouldn’t take much for their kisses to lead to more … a lot more. And when that happened, he didn’t plan to have it take place on a public beach.\u003c/p\u003e\n\u003cp\u003eHe didn’t know where the time had gone, but when he’d looked at his watch he’d been shocked. Meg, too. It was after three in the morning. They’d rushed their farewells without making arrangements to see each other again.\u003c/p\u003e\n\u003cp\u003e“When can we get together?” he asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know ….”\u003c/p\u003e\n\u003cp\u003eWas this how it was going to be? Would they have to start over each and every time they met? “Would you rather we didn’t meet again?” he asked.\u003c/p\u003e\n\u003cp\u003e“No,” she said immediately.\u003c/p\u003e\n\u003cp\u003e“We’ve got to make some decisions,” he said, angry with himself for not saying anything about it on that moonlit beach. They’d discussed so many different things, from politics to movies to lifelong dreams, yet hadn’t talked about their own relationship.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Would tonight work?” he asked. “Same time?”\u003c/p\u003e\n\u003cp\u003eShe hesitated and he gritted his teeth with impatience.\u003c/p\u003e\n\u003cp\u003e“Okay.” The longing in her voice reassured him.\u003c/p\u003e\n\u003cp\u003e“Fine,” he said, relieved. “I’ll pick you up at your house at eleven.”\u003c/p\u003e\n\u003cp\u003e“I have to go now.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Me, too.”\u003c/p\u003e\n\u003cp\u003eSteve replaced the receiver and glanced up to find Nancy standing in his office doorway, her arms folded in disapproval.\u003c/p\u003e\n\u003cp\u003e“Was that Meg?” she demanded.\u003c/p\u003e\n\u003cp\u003e“That’s none of your business,” Steve said sharply.\u003c/p\u003e\n\u003cp\u003e“We need to talk about her and I’m tired of you putting me off.”\u003c/p\u003e\n\u003cp\u003e“I’m not discussing Meg Remington with you.”\u003c/p\u003e\n\u003cp\u003e“How could you date someone like her?” Nancy asked, her face wrinkled in disgust.\u003c/p\u003e\n\u003cp\u003e“Might I remind you that you were the one who introduced us?”\u003c/p\u003e\n\u003cp\u003e“Yes, but she deceived me. Steve, be serious! Can you honestly imagine introducing her to Mom and Dad?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he answered calmly.\u003c/p\u003e\n\u003cp\u003eNancy threw her arms in the air. “This is your problem. You’re thinking with your you-know-what.”\u003c/p\u003e\n\u003cp\u003e“Nancy!”\u003c/p\u003e\n\u003cp\u003e“It’s true!”\u003c/p\u003e\n\u003cp\u003e“Stay out of my business. Understand?”\u003c/p\u003e\n\u003cp\u003e“But … “\u003c/p\u003e\n\u003cp\u003e“I make my own decisions,” Steve said forcefully.\u003c/p\u003e\n\u003cp\u003e“And your own mistakes,” Nancy muttered, walking out of the room.\u003c/p\u003e\n\u003cp\u003e“We’re both crazy,” Meg said, sitting next to Steve in his car. She sipped from a can of cold soda, enjoying the sweet taste of it.\u003c/p\u003e\n\u003cp\u003e“Candidates for the loony bin,” he agreed.\u003c/p\u003e\n\u003cp\u003e“I wasn’t sure I’d be able to get away,” Meg confessed. “Brenda’s spending the night with Lindsey, and those two are going to be up half the night.”\u003c/p\u003e\n\u003cp\u003e“Did you tell them you were leaving the house?”\u003c/p\u003e\n\u003cp\u003e“No,” she said, “but I left them a note. Just in case … Although I’m hoping they won’t come downstairs. Oh, and this time I should remember to bring home some milk.”\u003c/p\u003e\n\u003cp\u003e“I was thinking Lindsey and I should have another meeting,” Steve began. “Only this time I want you to bring her to the shop. I’ll show her around and explain that the whole biker, ex-con routine was a joke.” He waited, then looked at Meg. “What do you think?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid hell hath no fury like a teenager fooled.”\u003c/p\u003e\n\u003cp\u003e“That’s what I was afraid you were going to say.” Steve finished his drink and placed his arm around her shoulder. “One thing’s for sure. I’m through with sneaking around in the middle of the night.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mother-s-wish/page-12.html","bookId":1963,"creation":"Oct 5, 2019 10:15:49 AM","modification":"Oct 5, 2019 10:15:49 AM"}
