{"id":70121,"no":21,"title":"Page 21","content":"\u003cp\u003eHe turned his head when he saw her. His eyes were cold. Unfriendly. Unwelcoming.\u003c/p\u003e\n\u003cp\u003eMeg bit her lip and met his gaze squarely. It took every ounce of resolve she had to move off the porch and take a few steps toward him. She paused halfway across the freshly mowed lawn.\u003c/p\u003e\n\u003cp\u003eSteve rolled down the window. “What?” he demanded.\u003c/p\u003e\n\u003cp\u003eShe blinked, her heart racing.\u003c/p\u003e\n\u003cp\u003e“Lindsey said you had something you wanted to tell me,” he muttered.\u003c/p\u003e\n\u003cp\u003eMeg should’ve known better than to let Lindsey do her talking for her. She opened her mouth, but her throat was clogged with tears. She tried to swallow, refusing to cry in front of him.\u003c/p\u003e\n\u003cp\u003e“Say it!”\u003c/p\u003e\n\u003cp\u003e“I … don’t know if I can.”\u003c/p\u003e\n\u003cp\u003e“Either you say it or I’m leaving.” He turned away from her and started the engine.\u003c/p\u003e\n\u003cp\u003e“Mom, we’re going to lose him,” Lindsey cried from the porch. “Don’t let him go ….”\u003c/p\u003e\n\u003cp\u003e“I … love you,” she whispered.\u003c/p\u003e\n\u003cp\u003eSteve switched off the engine. “Did you say something?”\u003c/p\u003e\n\u003cp\u003e“I love you, Steve Conlan. I’m scared out of my wits. You’re right—I have built a wall around us. I don’t want to lose you. It’s just that I’m … afraid.” Her voice caught on the last word.\u003c/p\u003e\n\u003cp\u003eHis eyes held hers and after a moment, he smiled. “That wasn’t so difficult, now, was it?”\u003c/p\u003e\n\u003cp\u003e“Yes, it was,” she countered. “It was incredibly hard.” He didn’t seem to realize she was standing on her front lawn with half the neighborhood looking on as she told him how much she loved him.\u003c/p\u003e\n\u003cp\u003e“You’re going to marry me, Meg Remington.”\u003c/p\u003e\n\u003cp\u003eShe sniffled. “Probably.”\u003c/p\u003e\n\u003cp\u003eHe got out of his truck, slammed the door and with three long strides eliminated the distance between them. “Will you or will you not marry me?”\u003c/p\u003e\n\u003cp\u003e“I will,” she said, laughing and crying at the same time, then she ran to meet him halfway.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought.” Steve hauled her into his arms and buried her in his embrace. He grabbed her about the waist and whirled her around, then half carried her back into the house.\u003c/p\u003e\n\u003cp\u003eOnce inside, he kicked the door shut and and they leaned against it, kissing frantically.\u003c/p\u003e\n\u003cp\u003eLindsey cleared her throat behind them. “I hate to interrupt, but I have a few important questions.”\u003c/p\u003e\n\u003cp\u003eSteve hid his face in Meg’s neck and mumbled something she couldn’t hear, which was no doubt for the best.\u003c/p\u003e\n\u003cp\u003e“Okay, kiddo, what do you want to know?” Steve asked when he’d regrouped.\u003c/p\u003e\n\u003cp\u003e“We’re getting married?” Lindsey asked. Meg liked the way she’d included herself.\u003c/p\u003e\n\u003cp\u003e“Yup,” Steve assured her. “We’re going to be a family.”\u003c/p\u003e\n\u003cp\u003eLindsey let out a holler that could be heard three blocks away.\u003c/p\u003e\n\u003cp\u003e“Where will we live? Your house or ours?”\u003c/p\u003e\n\u003cp\u003eSteve looked at Meg. “Do you care?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“We’ll live wherever you want,” Steve told the girl. “I imagine staying close to your friends is important, so we’ll take that into consideration.”\u003c/p\u003e\n\u003cp\u003e“Great.” Lindsey beamed him a smile. “What about adding to the family? Mom’s willing, I think.”\u003c/p\u003e\n\u003cp\u003eOnce more Steve looked at Meg, and laughing, she nodded. “Oh, yes,” she murmured, “there’ll be several additions to this family.”\u003c/p\u003e\n\u003cp\u003eSteve’s eyes grew intense, and Meg knew he was thinking the same thing she was. She wanted his babies as much as she wanted this man. She loved him, desired him, anticipating all they could discover together, all they could learn from each other.\u003c/p\u003e\n\u003cp\u003e“One last thing,” Lindsey said.\u003c/p\u003e\n\u003cp\u003eIt was hard to pull her eyes away from Steve, but she wanted to include Lindsey in these important decisions. “Yes, honey?”\u003c/p\u003e\n\u003cp\u003e“It’s just that I’d rather you didn’t go shopping for your wedding dress alone. You’re really good at lots of things, but frankly, Mom, you don’t have any fashion sense.”\u003c/p\u003e\n\u003cp\u003eAs it turned out, Lindsey, Brenda and Steve’s sister, Nancy, were all involved in the process of choosing the all-important wedding dress. Steve, naturally, wasn’t allowed within a hundred feet of Meg and her dress until the day of the ceremony.\u003c/p\u003e\n\u003cp\u003eThe wedding took place three months later, with family and friends gathered around. Lindsey proudly served as her mother’s maid of honor.\u003c/p\u003e\n\u003cp\u003eSteve endured all the formality because he knew it mattered to Meg and to Lindsey. Nancy and his mother seemed to enjoy making plans for the wedding, too. All that was required of him was to show up and say “I do,” which suited Steve just fine.\u003c/p\u003e\n\u003cp\u003eIn his view, this fuss over weddings was for women. Men considered it a necessary evil. Or so he believed until his wedding day. When he saw Meg walk down the aisle, the emotion that throbbed in his chest came as a complete and utter surprise.\u003c/p\u003e\n\u003cp\u003eHe’d known he loved her—he must, to put up with all the craziness that had befallen their courtship. But he hadn’t realized how deep that love went. Not until he saw Meg so solemn and so beautiful. His bride. She stole his breath as he gazed at her.\u003c/p\u003e\n\u003cp\u003eThe reception was a blur. Every time he looked at Meg he found it difficult to believe that this beautiful, vibrant woman was his wife. His thoughts were a jumbled, confused mess as he greeted those he needed to greet and thanked those he needed to thank.\u003c/p\u003e\n\u003cp\u003eIt seemed half a lifetime before he was alone with his wife. He’d booked the honeymoon suite at a hotel close to Sea-Tac airport. The following morning they were flying to Hawaii for two weeks. Meg had never seen the islands. Steve suspected he didn’t need a tropical playground to discover paradise. He would find that in her arms.\u003c/p\u003e\n\u003cp\u003e“My husband.” Meg said the word shyly as Steve fumbled with the key card to unlock their suite. “I like the way it sounds.”\u003c/p\u003e\n\u003cp\u003e“So do I, but not quite as much as I like the sound of wife.” With the door open, he swept Meg into his arms and carried her into the room.\u003c/p\u003e\n\u003cp\u003eHe hadn’t taken two steps before they started to kiss.\u003c/p\u003e\n\u003cp\u003eMeg tasted of wedding cake and champagne, of passion and love. She wound her arms around his neck and enticed him to kiss her again. Steve didn’t need much of an invitation.\u003c/p\u003e\n\u003cp\u003eAt the unbridled desire he read in her eyes, Steve moaned and carried her to the bed. After he’d set her feet on the floor, he kissed her again, slowly, with all the pent-up desire inside him.\u003c/p\u003e\n\u003cp\u003eHe reached behind her for the zipper of her dress. “I haven’t made any secret of how much I want to make love to you.”\u003c/p\u003e\n\u003cp\u003e“That’s true,” she whispered, kissing his jaw. “Thank you for agreeing to wait. It meant a lot to me to start our marriage this way.”\u003c/p\u003e\n\u003cp\u003eHe slipped the sleeve down her arm and kissed the ivory perfection of one shoulder. Then he kissed the other, his lips blazing a trail up the side of her neck to the hollow of her throat.\u003c/p\u003e\n\u003cp\u003e“You make my knees go weak,” she told him in a low voice.\u003c/p\u003e\n\u003cp\u003e“Mine are, too.”\u003c/p\u003e\n\u003cp\u003eTogether they collapsed on the bed. Steve kissed her and loosened his tie. With their lips joined, Meg’s fingers worked at his shirt, undressing him.\u003c/p\u003e\n\u003cp\u003eSoon they were lost in each other, loving each other, immersed in a world of their own. A world from which they didn’t emerge until the summer sun had been replaced by a glittering moon and a sky full of stars.\u003c/p\u003e\n\u003cp\u003eBack at the reception, Lindsey sat with Steve’s sister, Nancy, and licked the icing off their fingertips. “Do you suppose they’ll ever figure it out?”\u003c/p\u003e\n\u003cp\u003eNancy sipped champagne from a crystal flute. “I doubt either of them is thinking about much right now—except each other.”\u003c/p\u003e\n\u003cp\u003e“We made some real mistakes, though.”\u003c/p\u003e\n\u003cp\u003e“We?” Nancy said, eyeing Lindsey.\u003c/p\u003e\n\u003cp\u003e“Okay, me. I’ll admit I nearly ruined everything by pushing the marriage issue. How was I to know my mother would take it so personally? Jeez, she just about had a heart attack, and all because I suggested Steve marry her.”\u003c/p\u003e\n\u003cp\u003e“It worked out, though,” Nancy said, looking pleased with herself. “And I made a few blunders of my own. Getting my friend to go to the shop and say she was Meg wasn’t the smartest thing I’ve ever done. Steve was bound to find out sooner or later that it wasn’t Meg.”\u003c/p\u003e\n\u003cp\u003e“But we had to do something,” Lindsey insisted. “They were both being so stubborn. One of them had to give in. Besides, your ploy worked.”\u003c/p\u003e\n\u003cp\u003e“Better than the flowers I sent.”\u003c/p\u003e\n\u003cp\u003eLindsey sampled another bite of wedding cake. “You know what was the hardest part?”\u003c/p\u003e\n\u003cp\u003e“I know what it was for me. I had one heck of a time keeping a straight face when your mother came to the house dressed in a Tina Turner wig and five-inch heels. Oh, Lindsey, if you could’ve seen her.”\u003c/p\u003e\n\u003cp\u003e“Steve was pretty funny himself, with his leather jacket and that bad-boy smirk.”\u003c/p\u003e\n\u003cp\u003e“Neither one of them’s any good at acting,” Nancy said, still grinning.\u003c/p\u003e\n\u003cp\u003e“Not like us.”\u003c/p\u003e\n\u003cp\u003e“Not like us,” Nancy agreed.\u003c/p\u003e\n\u003cp\u003eFather’s Day\u003c/p\u003e\n\u003cp\u003eDebbie Macomber\u003c/p\u003e\n\u003cp\u003eFor Lois and Bill Hoskins,\u003c/p\u003e\n\u003cp\u003eliving proof that love is\u003c/p\u003e\n\u003cp\u003ebetter the second time around.\u003c/p\u003e\n\u003cp\u003eOne\u003c/p\u003e\n\u003cp\u003e“I can’t believe I’m doing this,” Robin Masterson muttered as she crawled into the makeshift tent, which was pitched over the clothesline in the backyard of her new home.\u003c/p\u003e\n\u003cp\u003e“Come on, Mom,” ten-year-old Jeff urged, shifting to make room for her. “It’s nice and warm in here.”\u003c/p\u003e\n\u003cp\u003eDown on all fours, a flashlight in one hand, Robin squeezed her way inside. Jeff had constructed the flimsy tent using clothespegs to hold up the blankets and rocks to secure the base. The space was tight, but she managed to maneuver into her sleeping bag.\u003c/p\u003e\n\u003cp\u003e“Isn’t this great?” Jeff asked. He stuck his head out of the front opening and gazed at the dark sky and the spattering of stars that winked back at them. On second thought, Robin decided they were laughing at her, those stars. And with good reason. There probably wasn’t another thirty-year-old woman in the entire state of California who would’ve agreed to this craziness.\u003c/p\u003e\n\u003cp\u003eIt was the first night in their new house and Robin was exhausted. They’d started moving out of the apartment before five that morning and she’d just finished unpacking the last box. The beds were assembled, but Jeff wouldn’t hear of doing anything as mundane as sleeping on a real mattress. After waiting years to camp out in his own backyard, her son wasn’t about to delay the adventure by even one night.\u003c/p\u003e\n\u003cp\u003eRobin couldn’t let him sleep outside alone and, since he hadn’t met any neighbors yet, there was only one option left. Surely there’d be a Mother of the Year award in this for her.\u003c/p\u003e\n\u003cp\u003e“You want to hear a joke?” Jeff asked, rolling on to his back and nudging her.\u003c/p\u003e\n\u003cp\u003e“Sure.” She swallowed a yawn, hoping she could stay awake long enough to laugh at the appropriate time. She needn’t have worried.\u003c/p\u003e\n\u003cp\u003eFor the next half hour, Robin was entertained with a series of riddles, nonsense rhymes and off-key renditions of Jeff’s favourite songs from summer camp.\u003c/p\u003e\n\u003cp\u003e“Knock knock,” she said when it appeared her son had run through his repertoire.\u003c/p\u003e\n\u003cp\u003e“Who’s there?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mother-s-wish/page-21.html","bookId":1963,"creation":"Oct 5, 2019 10:15:49 AM","modification":"Oct 5, 2019 10:15:49 AM"}
