{"id":70128,"no":28,"title":"Page 28","content":"\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“He’ll be back in a few minutes, if you’d like to call then. Or if you prefer, I could run and get him, but he said something about sneaking out and going for help and—”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon? What’s Jeff doing?”\u003c/p\u003e\n\u003cp\u003e“Oh, they’re playing in the fort, pretending they’re Houston and Daniel Boone. The fort is now the Alamo.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “I see. No, don’t worry about chasing after him. I’d hate to see you waylaid by the Mexican army.”\u003c/p\u003e\n\u003cp\u003e“I don’t think I’d care for that myself.”\u003c/p\u003e\n\u003cp\u003e“How’s everything going?”\u003c/p\u003e\n\u003cp\u003e“Fine,” she assured him.\u003c/p\u003e\n\u003cp\u003eShe must have sounded rushed because he said, “You’re sure this isn’t a bad time? If you have company … “\u003c/p\u003e\n\u003cp\u003e“No, I’m here alone.”\u003c/p\u003e\n\u003cp\u003eAnother short silence, which was broken by Cole. “So everything’s okay with Blackie? He isn’t causing you any problems, is he?”\u003c/p\u003e\n\u003cp\u003e“Oh, no, everything’s great. Jeff lavishes him with attention. The two of them are together practically every minute. Blackie even sleeps beside his bed.”\u003c/p\u003e\n\u003cp\u003e“As you said, Jeff has a way with animals,” Cole murmured.\u003c/p\u003e\n\u003cp\u003eHis laugh, so tender and warm, was enough to jolt her. She had to pinch herself to remember that Cole was a prominent attorney, wealthy and respected. She was an accountant. A junior accountant at that.\u003c/p\u003e\n\u003cp\u003eThe only thing they had in common was the fact that they lived next door to each other and her son was crazy about his dog.\u003c/p\u003e\n\u003cp\u003eThe silence returned, only this time it had a relaxed, almost comfortable quality, as though neither wanted the conversation to end.\u003c/p\u003e\n\u003cp\u003e“Since Jeff isn’t around,” Cole said reluctantly, “I’ll let you go.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell him you phoned.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t anything important,” Cole said. “Just wanted to let you know when I’ll be back—late Friday afternoon. Will you be home?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“You never know, your friend might talk you into going out with Fred after all.”\u003c/p\u003e\n\u003cp\u003e“It’s Frank, and there isn’t a snowball’s chance in hell.”\u003c/p\u003e\n\u003cp\u003e“Famous last words!”\u003c/p\u003e\n\u003cp\u003e“See you Friday,” she said with a short laugh.\u003c/p\u003e\n\u003cp\u003e“Right. Goodbye, Robin.”\u003c/p\u003e\n\u003cp\u003e“Goodbye, Cole.”\u003c/p\u003e\n\u003cp\u003eLong after the call had ended, Robin stood with her hand on the receiver, a smile touching her eyes and her heart.\u003c/p\u003e\n\u003cp\u003e“Mom, I need my lunch money,” Jeff yelled from the bottom of the stairs.\u003c/p\u003e\n\u003cp\u003e“I’ll be down in a minute,” she said. Mornings were hectic. In order to get to the Glen Park BART station on time, Robin had to leave the house half an hour before Jeff left for school.\u003c/p\u003e\n\u003cp\u003e“What did you have for breakfast?” she hollered as she put the finishing touches on her makeup.\u003c/p\u003e\n\u003cp\u003e“Frozen waffles,” Jeff shouted back. “And don’t worry, I didn’t drown them in syrup and I rinsed off the plate before I put it in the dishwasher.”\u003c/p\u003e\n\u003cp\u003e“Rinsed it off or let Blackie lick it for you?” she asked, as she hurried down the stairs. Her son was busy at the sink and didn’t turn around to look at her.\u003c/p\u003e\n\u003cp\u003e“Blackie, honestly, is that maple syrup on your nose?”\u003c/p\u003e\n\u003cp\u003eAt the sound of his name, the Labrador trotted over to her. Robin took a moment to stroke his thick fur before fumbling for her wallet to give Jeff his lunch money.\u003c/p\u003e\n\u003cp\u003e“Hey, Mom, you look nice.”\u003c/p\u003e\n\u003cp\u003e“Don’t act so surprised,” she grumbled. “I’m leaving now.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Jeff said without the slightest bit of concern. “You won’t be late tonight, will you? Remember Mr. Camden’s coming back.”\u003c/p\u003e\n\u003cp\u003e“I remember, and no, I won’t be late.” She grabbed her purse and her packed lunch, putting it in her briefcase, and headed for the front door.\u003c/p\u003e\n\u003cp\u003eEven before Robin arrived at the subway station, she knew the day would drag. Fridays always did.\u003c/p\u003e\n\u003cp\u003eShe was right. At six, when the subway pulled into the station, Robin felt as though she’d been away forty hours instead of the usual nine. She found herself hurrying and didn’t fully understand why. Cole was scheduled to return, but that didn’t have anything to do with her, did it? His homecoming wasn’t anything to feel nervous about, nor any reason to be pleased. He was her neighbor, and more Jeff’s friend than hers.\u003c/p\u003e\n\u003cp\u003eThe first thing Robin noticed when she arrived on Orchard Street was Cole’s Porsche parked in the driveway of his house.\u003c/p\u003e\n\u003cp\u003e“Hi, Mom,” Jeff called as he raced across the lawn between the two houses. “Mr. Camden’s back!”\u003c/p\u003e\n\u003cp\u003e“So I see.” She removed her keys from her purse and opened the front door.\u003c/p\u003e\n\u003cp\u003eJeff followed her inside. “He said he’d square up with me later. I wanted to invite him to dinner, but I didn’t think I should without asking you first.”\u003c/p\u003e\n\u003cp\u003e“That was smart,” she said, depositing her jacket in the closet on her way to the kitchen. She opened the refrigerator and took out the thawed hamburger and salad makings.\u003c/p\u003e\n\u003cp\u003e“How was your day?” she asked.\u003c/p\u003e\n\u003cp\u003eJeff sat down at the table and propped his elbows on it. “All right, I guess. What are you making for dinner?”\u003c/p\u003e\n\u003cp\u003e“Taco salad.”\u003c/p\u003e\n\u003cp\u003e“How about just tacos? I don’t get why you want to ruin a perfectly good dinner by putting green stuff in it.”\u003c/p\u003e\n\u003cp\u003eRobin paused. “I thought you liked my taco salad.”\u003c/p\u003e\n\u003cp\u003eJeff shrugged. “It’s all right, but I’d rather have just tacos.” Once that was made clear, he cupped his chin in his hands. “Can we rent a movie tonight?”\u003c/p\u003e\n\u003cp\u003e“I suppose,” Robin returned absently as she added the meat to the onions browning in the skillet.\u003c/p\u003e\n\u003cp\u003e“But I get to choose this time,” Jeff insisted. “Last week you picked a musical.” He wrinkled his nose as if to suggest that being forced to watch men and women sing and dance was the most disgusting thing he’d ever had to endure.\u003c/p\u003e\n\u003cp\u003e“Perhaps we can find a compromise,” she said.\u003c/p\u003e\n\u003cp\u003eJeff nodded. “As long as it doesn’t have a silly love story in it.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Robin said, doing her best not to betray her amusement. Their difference in taste when it came to movies was legendary. Jeff’s favorite was an older kids’ film, Scooby Doo, that he watched over and over, which Robin found boring, to say the least. Unfortunately, her son was equally put off by the sight of men and women staring longingly into each other’s eyes.\u003c/p\u003e\n\u003cp\u003eThe meat was simmering in the skillet when Robin glanced up and noted that her son was looking surprisingly thoughtful. “Is something troubling you?” she asked, and popped a thin tomato slice into her mouth.\u003c/p\u003e\n\u003cp\u003e“Have you ever noticed that Mr. Camden never mentions he had a son?”\u003c/p\u003e\n\u003cp\u003eRobin set the paring knife on the cutting board. “It’s probably painful for him to talk about.”\u003c/p\u003e\n\u003cp\u003eJeff nodded, and, with the innocent wisdom of youth, he whispered, “That man needs someone.”\u003c/p\u003e\n\u003cp\u003eThe meal was finished, and Robin was standing in front of the sink rinsing off the dinner plates when the doorbell rang. Robin knew it had to be Cole.\u003c/p\u003e\n\u003cp\u003e“I’ll get it,” Jeff cried as he raced past her at breakneck speed. He threw open the door. “Hi, Mr. Camden!” he said eagerly.\u003c/p\u003e\n\u003cp\u003eBy this time Robin had smoothed her peach-colored sweater over her hips and placed a friendly—but not too friendly—smile on her face. At the last second, she ran her fingers through her hair, striving for the casual I-didn’t-go-to-any-trouble look, then wondered at her irrational behavior. Cole wasn’t coming over to see her.\u003c/p\u003e\n\u003cp\u003eRobin could hear Jeff chatting away at ninety miles an hour, telling Cole they were renting a movie and how Robin insisted that every show he saw had to have the proper rating, which he claimed was totally ridiculous. He went on to explain that she considered choosing the film a mother’s job and apparently a mere kid didn’t have rights. When there was a pause in the conversation, she could envision Jeff rolling his eyes dramatically.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, she stepped into the entryway and smiled. “Hello, Cole.”\u003c/p\u003e\n\u003cp\u003e“Robin.”\u003c/p\u003e\n\u003cp\u003eTheir eyes met instantly. Robin’s first coherent thought was that a woman could get lost in eyes that dark and not even care. She swallowed and lowered her gaze.\u003c/p\u003e\n\u003cp\u003e“Would you like a cup of coffee?” she asked, having difficulty dragging the words out of her mouth.\u003c/p\u003e\n\u003cp\u003e“If it isn’t too much trouble.”\u003c/p\u003e\n\u003cp\u003e“It isn’t.” Or it wouldn’t be if she could stop her heart from pounding so furiously.\u003c/p\u003e\n\u003cp\u003e“Where’s Blackie?” Jeff asked, opening the screen door and glancing outside.\u003c/p\u003e\n\u003cp\u003e“I didn’t bring him over. I thought you’d be tired of him by now.”\u003c/p\u003e\n\u003cp\u003e“Tired of Blackie?” Jeff cried. “You’ve got to be kidding!”\u003c/p\u003e\n\u003cp\u003e“I guess I should’ve known better,” Cole teased.\u003c/p\u003e\n\u003cp\u003eRobin returned to the kitchen and took mugs from the cupboard, using these few minutes to compose herself.\u003c/p\u003e\n\u003cp\u003eThe screen door slammed, and a moment later Cole appeared in her kitchen. “Jeff went to my house to get Blackie.”\u003c/p\u003e\n\u003cp\u003eShe smiled and nodded. “Do you take cream or sugar?” she asked over her shoulder.\u003c/p\u003e\n\u003cp\u003e“Just black, thanks.”\u003c/p\u003e\n\u003cp\u003eRobin normally drank hers the same way. But for some reason she couldn’t begin to fathom, she added a generous teaspoonful of sugar to her own, stirring briskly as though she feared it wouldn’t dissolve.\u003c/p\u003e\n\u003cp\u003e“I hope your trip went well,” she said, carrying both mugs into the family room, where Cole had chosen to sit.\u003c/p\u003e\n\u003cp\u003e“Very well.”\u003c/p\u003e\n\u003cp\u003e“Good.” She sat a safe distance from him, across the room in a wooden rocker, and balanced her mug on her knee. “Everything around here went without a hitch, but I’m afraid Jeff may have spoiled Blackie a bit.”\u003c/p\u003e\n\u003cp\u003e“From what he said, they did everything but attend school together.”\u003c/p\u003e\n\u003cp\u003e“Having the dog has been wonderful for him. I appreciate your giving Jeff this opportunity. Not only does it satisfy his need for a dog, but it’s taught him about responsibility.”\u003c/p\u003e\n\u003cp\u003eThe front door opened and the canine subject of their conversation shot into the room, followed by Jeff, who was grinning from ear to ear. “Mom, could Mr. Camden stay and watch the movie with us?”\u003c/p\u003e\n\u003cp\u003e“Ah …” Caught off guard, Robin didn’t know what to say. After being away from home for several days, watching a movie with his neighbors probably held a low position on Cole’s list of priorities.\u003c/p\u003e\n\u003cp\u003eTo Robin’s astonishment, Cole’s eyes searched hers as though seeking her approval.\u003c/p\u003e\n\u003cp\u003e“You’d be welcome … I mean, you can stay if you’d like, unless … unless there’s something else you’d rather do,” she stammered. “I mean, I’d … we’d like it if you did, but …” She let whatever else she might have said fade away. She was making a mess of this, and every time she tried to smooth it over, she only stuck her foot further down her throat.\u003c/p\u003e\n\u003cp\u003e“What movie did you rent?”\u003c/p\u003e\n\u003cp\u003e“We haven’t yet,” Jeff explained. “Mom and me had to come to an understanding first. She likes mushy stuff and gets all bent out of shape if there’s an explosion or anything. You wouldn’t believe the love story she made me watch last Friday night.” His voice dripped with renewed disgust. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mother-s-wish/page-28.html","bookId":1963,"creation":"Oct 5, 2019 10:15:49 AM","modification":"Oct 5, 2019 10:15:49 AM"}
