{"id":70103,"no":3,"title":"Page 3","content":"\u003cp\u003e“I’m allowed thirty fat grams a day,” Meg informed her. “And one hundred grams of carbohydrates.” Not that her fifteen-year-old daughter was going to dictate what she did and didn’t eat.\u003c/p\u003e\n\u003cp\u003e“I hope Lindsey doesn’t find out about that submarine sandwich you had for lunch.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t help it,” Meg said. “I haven’t been that hungry in years. I don’t think anyone bothered to tell Lindsey and Brenda that one of the effects of a workout is a voracious appetite.”\u003c/p\u003e\n\u003cp\u003e“What was that phone call about earlier?” Laura asked.\u003c/p\u003e\n\u003cp\u003eMeg frowned as she moved books onto the cart. “Lindsey wanted my credit card number for a slinky black dress with a scoop neckline.” Lindsey had sounded rapturous over the dress, describing it in detail, especially the deep cuts up the sides that would reveal plenty of thigh. “She said she found it on sale—and it was a deal too good to pass up.” She paused. “Needless to say, I told her no.”\u003c/p\u003e\n\u003cp\u003e“What would Lindsey want with a slinky black dress?”\u003c/p\u003e\n\u003cp\u003e“She wanted it for me,” Meg said, under her breath.\u003c/p\u003e\n\u003cp\u003e“You?”\u003c/p\u003e\n\u003cp\u003e“Apparently once I fit the proper image, they plan to dress me up and escort me around town.”\u003c/p\u003e\n\u003cp\u003eLaura laughed.\u003c/p\u003e\n\u003cp\u003e“I’m beginning to think you might not be such a good friend after all,” Meg told her employee. “I expected sympathy and advice, not laughter.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Meg. Really.”\u003c/p\u003e\n\u003cp\u003eShe sounded far more amused than she did sorry.\u003c/p\u003e\n\u003cp\u003eMeg cast her a disgruntled look. “You know what your problem is, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Laura was quick to tell her. “I’m married, with college-age children. I don’t have to put up with any of this nonsense and you do. Wait, my dear, until Lindsey gets her driver’s license. Then you’ll know what real fear is.”\u003c/p\u003e\n\u003cp\u003e“One disaster at a time, thank you.” Meg sat on a stool and reached for her coffee cup. “I don’t mind telling you I’m worried about all this.”\u003c/p\u003e\n\u003cp\u003e“Why?” Laura straightened and picked up her own cup, refilling it from the freshly brewed pot. “It’s a stage Lindsey’s going through. Trust me, it’ll pass.”\u003c/p\u003e\n\u003cp\u003e“Lindsey keeps insisting I’ll be lonely when she leaves for college, which she reminded me is in three years.”\u003c/p\u003e\n\u003cp\u003e“Will you be?”\u003c/p\u003e\n\u003cp\u003eMeg had to think about that. “I don’t know. I suppose in some ways I will be. The house will feel empty without her.” The two weeks Lindsey spent with her father every year seemed interminable. Meg wandered around the house like a lost puppy.\u003c/p\u003e\n\u003cp\u003e“So, why not get involved in another relationship?” Laura asked.\u003c/p\u003e\n\u003cp\u003e“With whom?” was Meg’s first question. “I don’t know any single men.”\u003c/p\u003e\n\u003cp\u003e“Sure you do,” Laura countered. “There’s Ed, who has the insurance office two doors down.”\u003c/p\u003e\n\u003cp\u003e“Ed’s single?” She rather liked Ed. He seemed like a decent guy, but she’d never thought of him in terms of dating.\u003c/p\u003e\n\u003cp\u003e“The fact that you didn’t know Ed was single says a lot. You’ve got to keep your eyes and ears open.”\u003c/p\u003e\n\u003cp\u003e“Who else?”\u003c/p\u003e\n\u003cp\u003e“Buck’s divorced.”\u003c/p\u003e\n\u003cp\u003eBuck was a regular customer, and although she couldn’t quite understand why, Meg had never cared for him. “I wouldn’t go out with Buck.”\u003c/p\u003e\n\u003cp\u003e“I didn’t say you had to go out with him, I just said he was single.”\u003c/p\u003e\n\u003cp\u003eMeg couldn’t see herself kissing either man. “Anyone else?”\u003c/p\u003e\n\u003cp\u003e“There are lots of men out there.”\u003c/p\u003e\n\u003cp\u003e“Oh, really, and I’m blind?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Laura said. “If you want the truth, I don’t think Lindsey’s idea is so bad. True, she may be going about it the wrong way, but it wouldn’t hurt you to test the waters. You might be surprised at what you find.”\u003c/p\u003e\n\u003cp\u003eMeg sighed. She’d expected support from her best friend, and instead Laura had turned traitor.\u003c/p\u003e\n\u003cp\u003eBy the time Meg had closed the bookstore and headed home, she was exhausted. So much for all those claims about exercise generating energy. In her experience, it did the reverse.\u003c/p\u003e\n\u003cp\u003e“Lindsey,” she called out, “are you home?”\u003c/p\u003e\n\u003cp\u003e“I’m in my room,” came the muffled reply from the bedroom at the top of the stairs.\u003c/p\u003e\n\u003cp\u003eSomething she couldn’t put her finger on prompted Meg to hurry upstairs to her daughter’s bedroom despite her aching muscles. She knocked once and opened the door to see Lindsey and Brenda sitting on the bed, leafing through a stack of letters.\u003c/p\u003e\n\u003cp\u003eLindsey hid the one she was reading behind her back. “Mom?” she said, her eyes wide. “Hi.”\u003c/p\u003e\n\u003cp\u003e“Hello.”\u003c/p\u003e\n\u003cp\u003e“Hello, Mrs. Remington,” Brenda said, looking decidedly guilty.\u003c/p\u003e\n\u003cp\u003eIt was then that Meg saw the black dress hanging from the closet door. It was the most provocative thing she’d seen in years.\u003c/p\u003e\n\u003cp\u003e“How’d you get the dress?” Meg demanded, angry that Lindsey had gone against her wishes and wondering how she’d managed to do it.\u003c/p\u003e\n\u003cp\u003eThe two girls stared at each other, neither one eager to give her an answer. “Brenda phoned her mother and she put it on her credit card,” Lindsey said at last.\u003c/p\u003e\n\u003cp\u003e“What?” Meg felt ready to explode.\u003c/p\u003e\n\u003cp\u003e“It was only a small lie,” Brenda said quickly. “I told my mom it was perfect and on sale and too cheap to resist. What I didn’t tell her was that the dress wasn’t for me.”\u003c/p\u003e\n\u003cp\u003e“It’s going back right this minute, and then the three of us are paying Brenda’s parents a visit.”\u003c/p\u003e\n\u003cp\u003e“Mom!” Lindsey flew off the bed. “Wait, please.” She had a panicked look in her eyes. “What we did was wrong, but when you wouldn’t agree to buy the dress yourself, we didn’t know what to do. You just don’t have anything appropriate for Chez Michelle.”\u003c/p\u003e\n\u003cp\u003eChez Michelle was one of the most exclusive restaurants in Seattle, with a reputation for excellent French cuisine. Meg had never eaten there herself, but Laura and her husband had celebrated their silver wedding anniversary at Chez Michelle and raved about it for weeks afterward.\u003c/p\u003e\n\u003cp\u003e“You’re not making any sense,” Meg told her daughter.\u003c/p\u003e\n\u003cp\u003eLindsey bit her lip and nodded.\u003c/p\u003e\n\u003cp\u003e“You have to tell her,” Brenda insisted.\u003c/p\u003e\n\u003cp\u003e“Tell me what?”\u003c/p\u003e\n\u003cp\u003e“You’re the one who wrote the last letter,” Lindsey said. “The least you could’ve done was get the dates right.”\u003c/p\u003e\n\u003cp\u003e“It’s tonight.”\u003c/p\u003e\n\u003cp\u003e“I know,” Lindsey snapped.\u003c/p\u003e\n\u003cp\u003e“Would someone tell me what’s going on here?” Meg asked, her patience at its end.\u003c/p\u003e\n\u003cp\u003e“You need that dress, Mom,” Lindsey said in a voice so low Meg had to strain to hear her.\u003c/p\u003e\n\u003cp\u003e“And why would that be?”\u003c/p\u003e\n\u003cp\u003e“You have a dinner date.”\u003c/p\u003e\n\u003cp\u003e“I do? And just who am I going out with?” She assumed this had something to do with Chez Michelle.\u003c/p\u003e\n\u003cp\u003e“Steve Conlan.”\u003c/p\u003e\n\u003cp\u003e“Steve Conlan?” Meg repeated. She said it again, looking for something remotely familiar about the name and finding nothing,\u003c/p\u003e\n\u003cp\u003e“You don’t know him,” Lindsey told her. “But he’s really nice. Brenda and I both like him.” She glanced at her friend for confirmation and Brenda nodded eagerly.\u003c/p\u003e\n\u003cp\u003e“You’ve met him?” Meg didn’t like the sound of this.\u003c/p\u003e\n\u003cp\u003e“Not really. We exchanged a couple of letters and then we e-mailed back and forth and he seems like a really great guy.” The last part was said with forced enthusiasm.\u003c/p\u003e\n\u003cp\u003e“You’ve been writing a strange man.”\u003c/p\u003e\n\u003cp\u003e“He’s not so strange, Mom, not really. He sounds just like one of us.”\u003c/p\u003e\n\u003cp\u003e“He wants to meet you,” Brenda put in.\u003c/p\u003e\n\u003cp\u003e“Me?” Meg brought her hand to her throat. “Why would he want to do that?”\u003c/p\u003e\n\u003cp\u003eThe girls shared a look, reminiscent of the one she’d caught the night before.\u003c/p\u003e\n\u003cp\u003e“Lindsey?” Meg asked. “Why would this man want to meet me?”\u003c/p\u003e\n\u003cp\u003eHer daughter lowered her eyes, refusing to meet Meg’s. “Because when we wrote Steve … “\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Brenda and I told him we were you.”\u003c/p\u003e\n\u003cp\u003eTwo\u003c/p\u003e\n\u003cp\u003eSteve Conlan glanced at his watch. The time hadn’t changed since he’d looked before. He could tell it was going to be one of those nights. He had the distinct feeling it would drag by, one interminable minute after another.\u003c/p\u003e\n\u003cp\u003eHe still hadn’t figured how he’d gotten himself into this mess. He was minding his own business and the next thing he knew … He didn’t want to think about it, because whenever he did his blood pressure rose.\u003c/p\u003e\n\u003cp\u003eNancy was going to pay for this.\u003c/p\u003e\n\u003cp\u003eHe was early, not because he was so eager for tonight. No, he was only eager to get it over with.\u003c/p\u003e\n\u003cp\u003eHe tried not to check the time and failed. A minute had passed. Or was it a lifetime?\u003c/p\u003e\n\u003cp\u003eHis necktie felt as if it would strangle him. A tie. He couldn’t believe he’d let Nancy talk him into wearing a stupid tie.\u003c/p\u003e\n\u003cp\u003eBecause he needed something to occupy his time, he took the snapshot out of his shirt pocket.\u003c/p\u003e\n\u003cp\u003eMeg Remington.\u003c/p\u003e\n\u003cp\u003eShe had a nice face, he decided. Nothing spectacular. She certainly wasn’t drop-dead gorgeous, but she wasn’t plain, either. Her eyes were her best feature. Clear. Bright. Expressive. She had a cute mouth, too. Very kissable. Sensuous.\u003c/p\u003e\n\u003cp\u003eWhat was he supposed to say to the woman? The hell if he knew. He’d read her letters and e-mails a dozen times. She sounded—he hated to say it—immature, as if she felt the need to impress him. She seemed to think that because she ran an eight-minute mile it qualified her for the Olympics. Frankly, he wondered what their dinner would be like, with her being so food conscious and all. She’d actually bragged about how few fat grams and carbs she consumed. Clearly she wasn’t familiar with the menu at Chez Michelle. He couldn’t see a single low-fat or low-carb entrée.\u003c/p\u003e\n\u003cp\u003eThat was another thing. The woman had expensive tastes. Dinner at Chez Michelle would set him back three hundred bucks—if he was lucky. So far he’d been anything but …\u003c/p\u003e\n\u003cp\u003eInvoluntarily his gaze fell to his watch again, and he groaned inwardly. His sister owed him for this.\u003c/p\u003e\n\u003cp\u003eBig time.\u003c/p\u003e\n\u003cp\u003e“I refuse to meet a strange man for dinner,” Meg insisted coldly. There were some things even a mother wouldn’t do.\u003c/p\u003e\n\u003cp\u003e“But you have to,” Brenda pleaded. “I’m sorry, Mrs. Remington, I feel really bad springing this on you, but Steve didn’t do anything wrong. You’ve just got to show up. You have to … otherwise he might lose faith in all women.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“But he’s your date,” Lindsey said. “It would’ve worked out great if …” she paused and scowled at her best friend “… if one of us hadn’t gotten the days mixed up.”\u003c/p\u003e\n\u003cp\u003e“Exactly when did you plan on telling me you’ve been communicating with a strange man, using my name?”\u003c/p\u003e\n\u003cp\u003e“Soon,” Lindsey said with conviction. “We had to … He started asking about meeting you almost right away. We did everything we could to hold him off. Oh, by the way, if he asks about your appendix, you’ve made a full recovery.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mother-s-wish/page-3.html","bookId":1963,"creation":"Oct 5, 2019 10:15:49 AM","modification":"Oct 5, 2019 10:15:49 AM"}
