{"id":70109,"no":9,"title":"Page 9","content":"\u003cp\u003e“Admit it,” he whispered. “You enjoyed the kiss.” His eyes were compelling, she admitted reluctantly, resisting him every step.\u003c/p\u003e\n\u003cp\u003e“How like a man—everything’s about ego,” she said in an effort to make light of what had happened. “Even a silly little kiss.”\u003c/p\u003e\n\u003cp\u003eSteve frowned.\u003c/p\u003e\n\u003cp\u003eThere was a fluttery feeling in the pit of her stomach, the same feeling that had attacked her when he’d kissed her by the staircase. She felt vulnerable and helpless.\u003c/p\u003e\n\u003cp\u003e“It wasn’t little and it wasn’t silly. But it was what we both wanted,” he said in a deceptively normal voice.\u003c/p\u003e\n\u003cp\u003e“You’re crazy,” she murmured, hurrying to assure him that he’d been wrong. Very wrong. She lowered her eyes, but this proved to be a tactical error. Before she realized what he intended, he was kissing her again.\u003c/p\u003e\n\u003cp\u003eMeg wanted to protest. If she’d fought him, struggled, he might have released her. But her one weak objection came in the form of a moan, and it appeared to encourage rather than dissuade him.\u003c/p\u003e\n\u003cp\u003eAll at once it was important to get closer. A moment later she was kneeling on the leather cushion and Steve had slipped his arms around her middle. They didn’t stay there long. He glided his hands along her back, urging her more tightly against him.\u003c/p\u003e\n\u003cp\u003eMeg didn’t require much inducement. Her body willfully molded itself to his. Then, abruptly, her eyes fluttered open and with a determined effort she broke free. Steve’s arms tightened before he relaxed and finally released her.\u003c/p\u003e\n\u003cp\u003eThe look on his face was one of shock.\u003c/p\u003e\n\u003cp\u003eFor her own part, Meg was having a difficult time breathing. Sensations swarmed through her. Unwanted sensations. Steve made her feel as if she’d never been kissed before, never been held or loved. Never been married or shared intimacies with a man.\u003c/p\u003e\n\u003cp\u003eShe blinked, and Steve backed away. He frowned and raked his fingers through his hair, apparently sorting out his own troubled emotions.\u003c/p\u003e\n\u003cp\u003e“I suppose you expect me to admit I enjoyed that,” she said with more than a hint of belligerence. These feelings frightened her. The fact that she’d reacted to him could easily be explained. Good grief, she was a normal woman—but this giddy, end-of-the-world sensation wasn’t anything she’d ever experienced.\u003c/p\u003e\n\u003cp\u003e“You don’t have to admit to a damned thing,” he said. He climbed onto the Hog and revved the engine aggressively.\u003c/p\u003e\n\u003cp\u003e“Stop,” she cried, shouting above the noise. She waved a hand to clear away the exhaust.\u003c/p\u003e\n\u003cp\u003e“What’s wrong now?” he snapped, twisting around to look at her.\u003c/p\u003e\n\u003cp\u003e“Nothing …. Just go slow, all right?”\u003c/p\u003e\n\u003cp\u003eSeparated by only a couple of inches, Meg felt him tense. “I’m not exactly in a slow mood.”\u003c/p\u003e\n\u003cp\u003e“I guessed as much.”\u003c/p\u003e\n\u003cp\u003eShe didn’t know what he intended as he expertly maneuvered the motorcycle out of her driveway. Mortified, Meg glanced up and down the street, wondering how many of her neighbors had witnessed the exchange between her and Steve. Fortunately Lindsey wasn’t at the front window watching as Meg had half feared.\u003c/p\u003e\n\u003cp\u003e“Hang on,” he shouted.\u003c/p\u003e\n\u003cp\u003eShe placed her hands lightly on either side of his waist, hoping to keep the contact as impersonal as possible—until they turned the first corner. From that moment on, she wrapped her arms around him as tightly as she could.\u003c/p\u003e\n\u003cp\u003eMeg was grateful that he chose not to drive far. He stopped at a park less than a mile from her house. After he’d eased into a parking space, he switched off the engine and sat motionless for a couple of minutes.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked after a while.\u003c/p\u003e\n\u003cp\u003e“I’m fine. Great. That was … fun.” She was astonished at her new talent for telling white lies. She was far from fine. Her insides were a mess, although that had almost nothing to do with the motorcycle ride. Her heart refused to settle down to a normal pace, and she couldn’t stop thinking about their kisses. The first time had been traumatic, but it didn’t compare to her nearly suffocating reaction to his second kiss.\u003c/p\u003e\n\u003cp\u003eSteve checked his watch. “We’ll give it another five minutes and then I’ll take you back to the house. That should give Lindsey enough time to worry about you without sending her into a panic.”\u003c/p\u003e\n\u003cp\u003e“Perfect,” she said brightly—a little too brightly.\u003c/p\u003e\n\u003cp\u003e“Then tomorrow afternoon I’ll pick you up after work and you can do your thing with my sister.”\u003c/p\u003e\n\u003cp\u003eAlthough he couldn’t see her, she nodded. Meg only hoped her act for Nancy would be as convincing as Steve’s had been with Lindsey.\u003c/p\u003e\n\u003cp\u003e“After that, we won’t need to see each other again,” Steve said. “As far as I’m concerned, it isn’t a minute too soon.”\u003c/p\u003e\n\u003cp\u003eMeg felt much the same way. She was just as eager to get him out of her life.\u003c/p\u003e\n\u003cp\u003eWasn’t she?\u003c/p\u003e\n\u003cp\u003eIt hadn’t been a good day. Steve would’ve liked to blame his foul mood on work-related problems, but everything at Emerald City Body Shop had run like clockwork. The one reason that presented itself was Meg Remington.\u003c/p\u003e\n\u003cp\u003eHe’d known from the first night that getting involved with her would mean trouble. Sure enough, he was waist-deep in quicksand, and all because he hadn’t wanted to hurt the woman’s feelings.\u003c/p\u003e\n\u003cp\u003eOkay, that accounted for their dinner date, but afterward … what happened was no one’s fault except his own. Donning his leather jacket and jeans and playing the role of the disgruntled ex-con had been fun. But then he had to go and do something stupid.\u003c/p\u003e\n\u003cp\u003eThe stupid part was because of the kiss. He’d been a fool to force Meg to admit how good it had been. This was what he got for allowing his pride to stand in the way.\u003c/p\u003e\n\u003cp\u003eWell, Steve had learned his lesson. The next time he was tempted to kiss Meg, he’d go stand in the middle of the freeway. Man, oh man, she could kiss. Only she didn’t seem to realize it. Much more of that kissing and he would’ve been renting a hotel room.\u003c/p\u003e\n\u003cp\u003eNot Meg, though. Oh, no. She acted as outraged as a nun. Apparently she’d forgotten that men and women did that sort of thing. Enjoyed it, too. Looked forward to doing it again.\u003c/p\u003e\n\u003cp\u003eThe woman was insane, and the sooner he could extract her from his life, the better. He didn’t need this. Who did?\u003c/p\u003e\n\u003cp\u003eOne more night, he assured himself. He was taking Meg to meet Nancy this evening, and when they were finished, it would be over and they’d never have to see each other again. If she played her cards right. He’d done his part.\u003c/p\u003e\n\u003cp\u003eDespite his sour mood, Steve grinned. He’d never forget the look of shock and horror in Lindsey’s eyes when he walked into the house. Her jaw had nearly hit the carpet when he put his arms around Meg’s waist and announced that he was an ex-con. He wouldn’t forget the look in Meg’s eyes, either.\u003c/p\u003e\n\u003cp\u003eSteve laughed outright.\u003c/p\u003e\n\u003cp\u003e“Something funny?” Gary Wilcox asked.\u003c/p\u003e\n\u003cp\u003eSteve glared at his foreman. “Not a thing. Now get back to work.”\u003c/p\u003e\n\u003cp\u003eAt six o’clock, Steve pulled into the parking space in the alley behind Meg’s bookstore. He didn’t like the idea of sneaking around and going to her back door, but that was what Meg wanted and far be it from him to argue. He’d be well rid of the woman—at least that was what he kept trying to tell himself.\u003c/p\u003e\n\u003cp\u003eHe knocked and waited a few minutes, growing impatient.\u003c/p\u003e\n\u003cp\u003eThe door opened and a woman in black mesh nylons and the shortest miniskirt he’d seen in years stood in front of him. She vaguely resembled Tina Turner. She wore tons of makeup and she’d certainly had her hair done at the same salon as Tina.\u003c/p\u003e\n\u003cp\u003e“I’m here for Meg Remington,” he said, annoyed that Meg had made such a fuss about his coming to the back door and then sent someone else to answer it.\u003c/p\u003e\n\u003cp\u003e“Steve,” Meg whispered, “it’s me.”\u003c/p\u003e\n\u003cp\u003e“What the hell?” He jerked his head back and examined her more thoroughly. “We’re meeting my sister,” he reminded her stiffly, “not going to some costume party.”\u003c/p\u003e\n\u003cp\u003e“I took my cue from you,” she said. “Good grief! You arrived at my door looking like a Hell’s Angel—what did you expect me to do?”\u003c/p\u003e\n\u003cp\u003eSteve rubbed his face. Darned if he knew anymore. All he wanted was to get this over with. “Fine. Let’s get out of here.”\u003c/p\u003e\n\u003cp\u003e“Just a minute. I need to change shoes.”\u003c/p\u003e\n\u003cp\u003eShe slipped out of a perfectly fine pair of flats and into spiky high heels that added a good five inches to her height. Steve wondered how she’d manage to walk in those things. She might as well have been on stilts.\u003c/p\u003e\n\u003cp\u003eHe led her around to his car and opened the door. He noticed that she sighed with what sounded like relief once she was inside the car.\u003c/p\u003e\n\u003cp\u003e“I didn’t know what I was going to do if you brought that motorcycle again.” She tugged down her miniskirt self-consciously.\u003c/p\u003e\n\u003cp\u003e“For the record, I don’t often take it out.”\u003c/p\u003e\n\u003cp\u003eShe looked relieved, but why it should matter to her one way or the other, he had no idea.\u003c/p\u003e\n\u003cp\u003e“Just remember,” he said, feeling obliged to caution her. “Nancy’s a few years older than Lindsey. She won’t be as easily fooled.”\u003c/p\u003e\n\u003cp\u003e“I’ll be careful about overkill,” she mumbled, “unlike certain people I know.”\u003c/p\u003e\n\u003cp\u003eThe drive took an eternity, and it wasn’t due to heavy traffic, either. In fact, when Steve looked at his watch he was surprised at what good time they’d made. What made the drive so troublesome—he hated to admit this—was Meg’s legs. She’d crossed them, exposing plenty of smooth, shapely thigh. Her high heels dangled from the ends of her toes.\u003c/p\u003e\n\u003cp\u003eSteve appreciated women as a whole—some more than others, of course. He didn’t focus on body parts. But it was torture to sit with Meg in the close confines of his car and keep his eyes off her legs. The woman looked incredible. If only she’d keep her mouth shut!\u003c/p\u003e\n\u003cp\u003eNancy was standing on the porch when Steve pulled into the driveway.\u003c/p\u003e\n\u003cp\u003e“This is where your sister lives?” Meg asked.\u003c/p\u003e\n\u003cp\u003e“It’s my home,” Steve answered, certain she was about to find something wrong with it.\u003c/p\u003e\n\u003cp\u003e“Your home?” She sounded impressed. “It’s very nice.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” He turned off the engine. “Nancy’s quite a bit younger than I am—a surprise for my mom and dad. She attends college at the University of Washington nine months out of the year. Our parents retired to Montana a couple of years back.”\u003c/p\u003e\n\u003cp\u003e“I see. Does Nancy live with you?”\u003c/p\u003e\n\u003cp\u003e“Not on your life,” he said, climbing out of the car. “She’s in residence during the school year. She got a job here this summer and I agreed to let her stay with me a few months. A mistake I don’t plan to repeat anytime soon.”\u003c/p\u003e\n\u003cp\u003eSteve was watching for his sister’s reaction when he helped Meg out of the car. To her credit, the nineteen-year-old didn’t reveal much, but Steve knew her well enough to realize she was shocked by Meg’s appearance.\u003c/p\u003e\n\u003cp\u003e“You must be Nancy,” Meg said in a low, sultry voice.\u003c/p\u003e\n\u003cp\u003e“And you must be Meg,” Nancy said, coming down the steps to greet her. “I’ve been dying to meet you.”\u003c/p\u003e\n\u003cp\u003e“I hope I’m not a disappointment.” This was said in a soft, cooing tone, as if she couldn’t have tolerated disillusioning Steve’s little sister. She clasped Steve’s arm and he noticed for the first time that her nails—now two inches long—were painted a brilliant fire engine red. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-mother-s-wish/page-9.html","bookId":1963,"creation":"Oct 5, 2019 10:15:49 AM","modification":"Oct 5, 2019 10:15:49 AM"}
