{"id":74108,"no":51,"title":"Page 51","content":"\u003cp\u003eBut here it is.\u003c/p\u003e\n\u003cp\u003eIt’s a gun in the back of my head and a boot pressed down on my back and it’s my mouth full of mud and it’s a million worthless moments I never really lived and it’s all right in front of me. I see it so clearly.\u003c/p\u003e\n\u003cp\u003eSomeone flips me over.\u003c/p\u003e\n\u003cp\u003eThe same someone who held a gun to my head is now pointing it at my face, inspecting me as if trying to read me and I’m confused, I don’t understand his angry gray eyes or the stiff set of his mouth because he’s not pulling the trigger. He’s not killing me and this, this more than anything else is what petrifies me.\u003c/p\u003e\n\u003cp\u003eI need to take off my gloves.\u003c/p\u003e\n\u003cp\u003eMy captor shouts something I don’t catch because he’s not talking to me, he’s not looking in my direction because he’s calling to someone else and I use his moment of distraction to yank off the steel knuckle brace on my left hand only to toss it to the ground. I have to get my glove off. I have to get my glove off because it’s my only chance for survival but the rain has made the leather too wet and it’s sticking to my skin, refusing to come off easily and the soldier spins back too soon. He sees what I’m trying to do and he yanks me to my feet, pulls me into a headlock and presses the gun to my skull. “I know what you’re trying to do, you little freak,” he says. “I’ve heard about you. You move even an inch and I will kill you.”\u003c/p\u003e\n\u003cp\u003eSomehow, I don’t believe him.\u003c/p\u003e\n\u003cp\u003eI don’t think he’s supposed to shoot me, because if he wanted to, he would’ve done it already. But he’s waiting for something. He’s waiting for something I don’t understand and I need to act fast. I need a plan but I have no idea what to do and I’m only clawing at his covered arm, at the muscle he’s bound around my neck and he shakes me, shouts at me to stop squirming and he pulls me tighter to cut off my air supply and my fingers are clenched around his forearm, trying to fight the viselike grip he has around me and I can’t breathe and I’m panicked, I’m suddenly not so sure he’s not going to kill me and I don’t even realize what I’ve done until I hear him scream.\u003c/p\u003e\n\u003cp\u003eI’ve crushed all the bones in his arm.\u003c/p\u003e\n\u003cp\u003eHe falls to the floor, he drops his gun to grab at his arm, and he’s screaming with a pain so excruciating I’m almost tempted to feel remorse for what I’ve done.\u003c/p\u003e\n\u003cp\u003eInstead, I run.\u003c/p\u003e\n\u003cp\u003eI’ve only gotten a few feet before 3 more soldiers slam into me, alerted by what I’ve done to their comrade, and they see my face and they’re alight with recognition. One of them appears vaguely familiar, almost as if I’ve seen his shaggy brown hair before, and I realize: they know me. These soldiers knew me when Warner held me captive. Warner had made a complete spectacle out of me. Of course they’d recognize my face.\u003c/p\u003e\n\u003cp\u003eAnd they’re not letting me go.\u003c/p\u003e\n\u003cp\u003eThe 3 of them are pushing me face-first into the ground, pinning down my arms and legs until I’m fairly certain they’ve decided to rip my limbs off. I’m trying to fight back, I’m trying to get my mind in the right place to focus my Energy, and I’m just about to knock them back but then\u003c/p\u003e\n\u003cp\u003ea sharp blow to my head and I’m rendered almost entirely unconscious.\u003c/p\u003e\n\u003cp\u003eSounds are mixing together, voices are becoming one big mess of noise and I can’t see colors, I don’t know what’s happening to me because I can’t feel my legs anymore. I don’t even know if I’m walking or if I’m being carried but I feel the rain. I feel it fall fast down the planes of my face until I hear the sound of metal on metal, I hear a familiar electric thrum and then the rain stops, it disappears from the sky and I only know 2 things and I only know 1 of those things for certain.\u003c/p\u003e\n\u003cp\u003eI am in a tank.\u003c/p\u003e\n\u003cp\u003eI am going to die.\u003c/p\u003e\n\u003cp\u003eSIXTY-SEVEN\u003c/p\u003e\n\u003cp\u003eI hear wind chimes.\u003c/p\u003e\n\u003cp\u003eI hear wind chimes being blown into hysteria by a wind so violent as to be a legitimate threat and all I can think is that the tinkling sounds seem so incredibly familiar to me. My head is still spinning but I have to stay as aware as possible. I have to know where they’re taking me. I have to have some idea of where I am. I need to have a point of reference and I’m struggling to keep my head straight without making it known that I’m not unconscious.\u003c/p\u003e\n\u003cp\u003eThe soldiers don’t speak.\u003c/p\u003e\n\u003cp\u003eI was hoping to at least glean a bit of information from the conversations they might have but they do not say a word to one another. They are like machines, like robots programmed to follow through with a specific assignment, and I wonder, I’m so curious, I can’t figure out why I had to be dragged away from the battlefield to be killed. I wonder why my death has to be so special. I wonder why they’re carrying me out of the tank toward the chaos of an angry wind chime and I dare to open my eyes just a sliver and I nearly gasp.\u003c/p\u003e\n\u003cp\u003eIt’s the house.\u003c/p\u003e\n\u003cp\u003eIt’s the house, the house on unregulated turf, the one painted the perfect shade of robin’s-egg blue and the only traditional, functioning home within a 500-mile radius. It’s the same house Kenji told me must be a trap, it’s the house where I was so sure I’d meet Warner’s father, and then it hits me. A sledgehammer. A bullet train. A rush of realization crushing my brain.\u003c/p\u003e\n\u003cp\u003eAnderson must be here. He must want to kill me himself.\u003c/p\u003e\n\u003cp\u003eI am a special delivery.\u003c/p\u003e\n\u003cp\u003eThey even ring the doorbell.\u003c/p\u003e\n\u003cp\u003eI hear feet shuffling. I hear creaks and groans. I hear the wind snapping through the world and then I see my future, I see Anderson torturing me to death in every possible way and I wonder how I’m going to get myself out of this. Anderson is too smart. He will probably chain me to the floor and cut off my hands and feet one at a time. He is likely going to want to enjoy this.\u003c/p\u003e\n\u003cp\u003eHe answers the door.\u003c/p\u003e\n\u003cp\u003e“Ah! Gentlemen. Thank you very much,” he says. “Please follow me.” And I feel the soldier carrying me shift his weight under my damp, limp, suddenly heavy body. I’m starting to feel a cold chill seep into my bones and I realize I’ve been running through the pouring rain for too long.\u003c/p\u003e\n\u003cp\u003eI’m shaking and it’s not from fear.\u003c/p\u003e\n\u003cp\u003eI’m burning and it’s not from anger.\u003c/p\u003e\n\u003cp\u003eI’m so delirious that even if I had the strength to defend myself I’m not sure I’d be able to do it right. It’s amazing how many different ways I could meet my end today.\u003c/p\u003e\n\u003cp\u003eAnderson smells rich and earthy; I can smell him even though I’m being carried in someone else’s arms, and the scent is disturbingly pleasant. He closes the front door behind us just after advising the waiting soldiers to return to work. Which is essentially an order for them to go kill more people.\u003c/p\u003e\n\u003cp\u003eI think I’m starting to hallucinate.\u003c/p\u003e\n\u003cp\u003eI see a warm fireplace like the kind I’ve only ever read about. I see a cozy living room with soft, plush couches and a thick oriental rug gracing the floor. I see a mantel with pictures on it that I can’t recognize from here and Anderson is telling me to wake up, he’s saying you need to take a bath, you’ve gotten yourself quite dirty haven’t you, and that won’t do, will it? I’m going to need you to be awake and fully coherent or this won’t be much fun at all, he says, and I’m fairly certain I’m losing my mind.\u003c/p\u003e\n\u003cp\u003eI feel the thud thud thud of heavy footsteps climbing a stairwell and realize my body is moving with it. I hear a door whine open, I hear the shuffle of other feet and there are words being spoken that I can’t distinguish anymore. Someone says something to someone and I’m dropped onto a cold, hard floor.\u003c/p\u003e\n\u003cp\u003eI hear myself whimper.\u003c/p\u003e\n\u003cp\u003e“Be careful not to touch her skin,” is the only sentence I can make out in a single thread. Everything else is “bathe” and “sleep” and “in the morning” and “no, I don’t think so” and “very good,” and I hear another door slam shut. It’s the one right next to my head.\u003c/p\u003e\n\u003cp\u003eSomeone is trying to take my suit off.\u003c/p\u003e\n\u003cp\u003eI snap up so quickly it’s painful; I feel something sear through me, through my head until it hits me square in the eye and I know I’m a mix of so many things right now. I can’t remember the last time I ate anything and I haven’t truly slept in over 24 hours. My body is soaked through, my head is pounding with pain, my body has been twisted and stepped on, and I’m aching in a million different ways. But I will not allow any strange man to take my clothes off. I’d rather be dead.\u003c/p\u003e\n\u003cp\u003eBut the voice I hear isn’t male at all. It sounds soft and gentle, motherly. She’s speaking to me in a language I don’t understand but maybe it’s just my head that can’t understand anything at all. She makes soothing noises, she rubs her hands in small circles on my back. I hear a rush of water and feel the heat rise up around me and it’s so warm, it feels like steam and I think this must be a bathroom, or a tub, and I can’t help but think that I haven’t taken a hot shower since I was back at the headquarters with Warner.\u003c/p\u003e\n\u003cp\u003eI try to open my eyes and fail.\u003c/p\u003e\n\u003cp\u003eIt’s like two anvils are sitting on my eyelids, like everything is black and messy and confusing and exhausting and I can only make out the general circumstances of my situation. I see through little more than slits; I see only the gleaming porcelain of what I assume is a bathtub and I crawl over despite the protests in my ear and clamber up.\u003c/p\u003e\n\u003cp\u003eI topple right into the hot water fully clothed, gloves and boots and suit intact and it’s an unbelievable pleasure I didn’t expect to experience.\u003c/p\u003e\n\u003cp\u003eMy bones begin to thaw and my teeth are slowing their chatter and my muscles are learning to relax. My hair floats up around my face and I feel it tickle my nose.\u003c/p\u003e\n\u003cp\u003eI sink beneath the surface.\u003c/p\u003e\n\u003cp\u003eI fall asleep.\u003c/p\u003e\n\u003cp\u003eSIXTY-EIGHT\u003c/p\u003e\n\u003cp\u003eI wake up in a bed made of heaven and I’m wearing clothes that belong to a boy.\u003c/p\u003e\n\u003cp\u003eI’m warm and comfortable but I can still feel the creak in my bones, the ache in my head, the confusion clouding my mind. I sit up. I look around.\u003c/p\u003e\n\u003cp\u003eI’m in someone’s bedroom.\u003c/p\u003e\n\u003cp\u003eI’m tangled in blue-and-orange bedsheets decorated with little baseball mitts. There’s a little desk with a little chair set off to the side and there’s a set of drawers, a collection of plastic trophies in perfectly straight rows on top. I see a simple wooden door with a traditional brass knob that must lead outside; I see a sliding set of mirrors that must be hiding a closet. I look to my right to find a little bedside table with an alarm clock and a glass of water and I grab it.\u003c/p\u003e\n\u003cp\u003eIt’s almost embarrassing how quickly I inhale the contents.\u003c/p\u003e\n\u003cp\u003eI climb out of bed only to find that I’m wearing a pair of navy gym shorts that are hanging so low on my hips I’m afraid they’re going to fall off. I’m wearing a gray T-shirt with some kind of logo on it and I’m swimming in the extra material. I have no socks. No gloves. No underwear.\u003c/p\u003e\n\u003cp\u003eI have nothing.\u003c/p\u003e\n\u003cp\u003eI wonder if I’m allowed to step outside and I decide it’s worth a shot. I have no idea what I’m doing here. I have no idea why I’m not dead yet.\u003c/p\u003e\n\u003cp\u003eI freeze in front of the mirrored doors.\u003c/p\u003e\n\u003cp\u003eMy hair has been washed well and it falls in thick, soft waves around my face. My skin is bright and, with the exception of a few scratches, relatively unscathed. My eyes are wide; an odd, vibrant mix of green and blue blinking back at me, surprised and surprisingly unafraid.\u003c/p\u003e\n\u003cp\u003eBut my neck. \u003c/p\u003e","sourceLink":"https://allnovel.net/unravel-me-shatter-me-2/page-51.html","bookId":1772,"creation":"Oct 5, 2019 10:30:06 AM","modification":"Oct 5, 2019 10:30:06 AM"}
