{"id":74110,"no":53,"title":"Page 53","content":"\u003cp\u003e“You kids remember each other, right?” Anderson is the only one laughing.\u003c/p\u003e\n\u003cp\u003eWarner is breathing like he’s hiked several mountains, like he can’t understand what he’s seeing or why he’s seeing it and he’s staring at my neck, at what must be the ugly blotchy bruise staining my skin and his face twists into something that looks like anger and horror and heartbreak. His eyes drop to my shirt, to my shorts, and his mouth falls open just enough for me to notice before he’s reining himself in, wiping the emotions off his face. He’s struggling to stay composed but I can see the rapid motions of his chest rising and falling. His voice isn’t nearly as strong as it could be when he says, “What is she doing here?”\u003c/p\u003e\n\u003cp\u003e“I’ve had her collected for us,” Anderson says simply.\u003c/p\u003e\n\u003cp\u003e“For what?” Warner asks. “You said you didn’t want her—”\u003c/p\u003e\n\u003cp\u003e“Well,” Anderson says, considering. “That’s not entirely true. I could certainly benefit from having her around, but I decided at the last moment that I wasn’t interested in her company anymore.” He shakes his head. Looks down at his legs. Sighs. “It’s just so frustrating to be crippled like this,” he says, laughing again. “It’s just so unbelievably frustrating. But,” he says, smiling, “at least I’ve found a fast and easy way to fix it. To put it all back to normal, as they say. It’ll be just like magic.”\u003c/p\u003e\n\u003cp\u003eSomething about his eyes, the sick smile in his voice, the way he says that last line makes me feel ill. “What do you mean?” I ask, almost afraid to hear his response.\u003c/p\u003e\n\u003cp\u003e“I’m surprised you even have to ask, my dear. I mean, honestly—did you really think I wouldn’t notice my son’s brand-new shoulder?” He laughs. “Did you think I wouldn’t find it strange to see him come home not only unharmed, but entirely healed? No scars, no tenderness, no weakness—as if he’d never been shot at all! It’s a miracle,” he says. “A miracle, my son informs me, that was performed by two of your little freaks.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHorror is building inside of me, blinding me.\u003c/p\u003e\n\u003cp\u003e“Oh yes.” He glances at Warner. “Isn’t that right, son?”\u003c/p\u003e\n\u003cp\u003e“No,” I gasp. “Oh, God—what have you done—WHERE ARE THEY—”\u003c/p\u003e\n\u003cp\u003e“Calm yourself,” Anderson says to me. “They are perfectly unharmed. I simply had them collected, just as I had you collected. I need them to stay alive and healthy if they’re going to heal me, don’t you think?”\u003c/p\u003e\n\u003cp\u003e“Did you know about this?” I turn to Warner, frantic. “Did you do this? Did you know—”\u003c/p\u003e\n\u003cp\u003e“No—Juliette,” he says, “I swear—this wasn’t my idea—”\u003c/p\u003e\n\u003cp\u003e“You are both getting agitated over nothing,” Anderson says, waving a lazy hand in our direction. “We have more important things to focus on right now. More pressing issues to deal with.”\u003c/p\u003e\n\u003cp\u003e“What,” Warner asks, “are you talking about?” He doesn’t seem to be breathing.\u003c/p\u003e\n\u003cp\u003e“Justice, son.” Anderson is staring at me now. “I’m talking about justice. I like the idea of setting things right. Of putting order back into the world. And I was waiting for you to arrive so I could show you exactly what I mean. This,” he says, “is what I should’ve done the first time.” He glances at Warner. “Are you listening? Pay close attention now. Are you watching?”\u003c/p\u003e\n\u003cp\u003eHe pulls out a gun.\u003c/p\u003e\n\u003cp\u003eAnd shoots me in the chest.\u003c/p\u003e\n\u003cp\u003eSEVENTY\u003c/p\u003e\n\u003cp\u003eMy heart has exploded.\u003c/p\u003e\n\u003cp\u003eI’m thrown backward, tripping over my own feet until I hit the floor, my head slamming into the carpeted ground, my arms doing little to break my fall. It’s pain like I’ve never known it, pain I never thought I could feel, never would have even imagined. It’s like dynamite has gone off in my chest, like I’ve been lit on fire from the inside out, and suddenly everything slows down.\u003c/p\u003e\n\u003cp\u003eSo this, I think, is what it feels like to die.\u003c/p\u003e\n\u003cp\u003eI’m blinking and it seems to take forever. I see an unfocused series of images in front of me, colors and bodies and lights swaying, stilted movements all blurred together. Sounds are warped, garbled, too high and too low for me to hear clearly. There are icy, electric bursts surging through my veins, like every part of my body has fallen asleep and is trying to wake up again.\u003c/p\u003e\n\u003cp\u003eThere’s a face in front of me.\u003c/p\u003e\n\u003cp\u003eI try to concentrate on the shape, the colors, try to bring everything into focus but it’s too difficult and suddenly I can’t breathe, suddenly I feel like there are knives in my throat, holes punched into my lungs, and the more I blink, the less clearly I’m able to see. Soon I’m only able to take in the tightest breaths, tiny little gasps that remind me of when I was a child, when the doctors told me I suffered from asthma attacks. They were wrong, though; my shortness of breath had nothing to do with asthma. It had to do with panic and anxiety and hyperventilation. But this feeling I’m feeling right now is very similar to what I experienced then. It’s like trying to take in oxygen by breathing through the thinnest straw. Like your lungs are just closing up, gone for the holidays. I feel the dizziness take over, the light-headed feeling take over. And the pain, the pain, the pain. The pain is terrible. The pain is the worst. The pain never seems to stop.\u003c/p\u003e\n\u003cp\u003eSuddenly I’m blind.\u003c/p\u003e\n\u003cp\u003eI feel rather than see the blood, feel it leaking out of me as I blink and blink and blink in a desperate attempt to regain my vision. But I can see nothing but a haze of white. I hear nothing but the pounding in my eardrums and the short, the short, the short frantic gasp gasp gasps of my own breath and I feel hot, so hot, the blood of my body still so fresh and warm and pooling underneath me, all around me.\u003c/p\u003e\n\u003cp\u003eLife is seeping out of me and it makes me think about death, makes me think about how short a life I lived and how little I lived it. How I spent most of my years cowering in fear, never standing up for myself, always trying to be what someone else wanted. For 17 years I tried to force myself into a mold that I hoped would make other people feel comfortable, safe, unthreatened.\u003c/p\u003e\n\u003cp\u003eAnd it never helped.\u003c/p\u003e\n\u003cp\u003eI will have died having accomplished nothing. I am still no one. I am nothing more than a silly little girl bleeding to death on a psychotic man’s floor.\u003c/p\u003e\n\u003cp\u003eAnd I think, if I could do it over again, I’d do it so differently.\u003c/p\u003e\n\u003cp\u003eI’d be better. I’d make something of myself. I’d make a difference in this sorry, sorry world.\u003c/p\u003e\n\u003cp\u003eAnd I’d start by killing Anderson.\u003c/p\u003e\n\u003cp\u003eIt’s too bad I’m already so close to dead.\u003c/p\u003e\n\u003cp\u003eSEVENTY-ONE\u003c/p\u003e\n\u003cp\u003eMy eyes open.\u003c/p\u003e\n\u003cp\u003eI’m looking around and wondering at this strange version of an afterlife. Odd, that Warner is here, that I still can’t seem to move, that I still feel such extraordinary pain. Stranger still to see Sonya and Sara in front of me. I can’t even pretend to understand their presence in this picture.\u003c/p\u003e\n\u003cp\u003eI’m hearing things.\u003c/p\u003e\n\u003cp\u003eSounds are beginning to come in more clearly, and, because I can’t lift my head to look around, I try instead to focus on what they’re saying.\u003c/p\u003e\n\u003cp\u003eThey’re arguing.\u003c/p\u003e\n\u003cp\u003e“You have to!” Warner shouts.\u003c/p\u003e\n\u003cp\u003e“But we can’t—we can’t t-touch her,” Sonya is saying, choking back tears. “There’s no way for us to help her—”\u003c/p\u003e\n\u003cp\u003e“I can’t believe she’s actually dying,” Sara gasps. “I didn’t think you were telling the truth—”\u003c/p\u003e\n\u003cp\u003e“She’s not dying!” Warner says. “She is not going to die! Please, listen, I’m telling you,” he says, desperate now, “you can help her—I’ve been trying to explain to you,” he says, “all you have to do is touch me and I can take your power—I can be the transfer, I can control it and redirect your Energy—”\u003c/p\u003e\n\u003cp\u003e“That’s not possible,” Sonya says. “That’s not—Castle never said you could do that—he would’ve told us if you could do that—”\u003c/p\u003e\n\u003cp\u003e“Jesus, please, just listen to me,” he says, his voice breaking. “I’m not trying to trick you—”\u003c/p\u003e\n\u003cp\u003e“You kidnapped us!” they both shout at the same time.\u003c/p\u003e\n\u003cp\u003e“That wasn’t me! I wasn’t the one who kidnapped you—”\u003c/p\u003e\n\u003cp\u003e“How are we supposed to trust you?” Sara says. “How do we know you didn’t do this to her yourself?”\u003c/p\u003e\n\u003cp\u003e“Why don’t you care?” He’s breathing so hard now. “How can you not care? Why don’t you care that she’s bleeding to death—I thought you were her friends—”\u003c/p\u003e\n\u003cp\u003e“Of course we care!” Sara says, her voice catching on the last word. “But how can we help her now? Where can we take her? Who can we take her to? No one can touch her and she’s lost so much blood already—just look at he—”\u003c/p\u003e\n\u003cp\u003eA sharp intake of breath.\u003c/p\u003e\n\u003cp\u003e“Juliette?”\u003c/p\u003e\n\u003cp\u003eFootsteps stomp stomp stomp the ground. Rushing around my head. All the sounds are banging into each other, colliding again, spinning around me. I can’t believe I’m not dead yet.\u003c/p\u003e\n\u003cp\u003eI have no idea how long I’ve been lying here.\u003c/p\u003e\n\u003cp\u003e“Juliette? JULIETTE—”\u003c/p\u003e\n\u003cp\u003eWarner’s voice is a rope I want to cling to. I want to catch it and tie it around my waist and I want him to haul me out of this paralyzed world I’m trapped in. I want to tell him not to worry, that it’s fine, that I’m going to be okay because I’ve accepted it, I’m ready to die now, but I can’t. I can’t say anything. I still can’t breathe, can hardly shape my lips into words. All I can do is take these torturous little gasps and wonder why the hell my body hasn’t given up yet.\u003c/p\u003e\n\u003cp\u003eAll of a sudden Warner is straddling my bleeding body, careful not to allow any of his weight to touch me, and he shoves up my shirtsleeves. Grabs ahold of my bare arms and says, “You are going to be okay. We’re going to fix this—they’re going to help me fix this and you—you’re going to be fine.” Deep breaths. “You’re going to be perfect. Do you hear me? Juliette, can you hear me?”\u003c/p\u003e\n\u003cp\u003eI blink at him. I blink and blink and blink at him and find I’m still fascinated by his eyes. Such a startling shade of green.\u003c/p\u003e\n\u003cp\u003e“Each one of you, grab my arms,” he shouts to the girls, his hands still gripped firmly around my shoulders. “Now! Please! I’m begging you—”\u003c/p\u003e\n\u003cp\u003eAnd for some reason they listen.\u003c/p\u003e\n\u003cp\u003eMaybe they see something in him, see something in his face, in his features. Maybe they see what I see from this disjointed, foggy perspective. The desperation in his expression, the anguish carved into his features, the way he looks at me, like he might die if I do.\u003c/p\u003e\n\u003cp\u003eAnd I can’t help but think this is an interesting parting gift from the world.\u003c/p\u003e\n\u003cp\u003eThat at least, in the end, I didn’t die alone.\u003c/p\u003e\n\u003cp\u003eSEVENTY-TWO\u003c/p\u003e\n\u003cp\u003eI’m blind again.\u003c/p\u003e\n\u003cp\u003eHeat is pouring into my being with such intensity it’s literally taken over my vision. I can’t feel anything but hot, hot, searing hot heat flooding my bones, my nerves, my skin, my cells.\u003c/p\u003e\n\u003cp\u003eEverything is on fire.\u003c/p\u003e\n\u003cp\u003eAt first I think it’s the same heat in my chest, the same pain from the hole where my heart used to be, but then I realize this heat doesn’t actually hurt. It’s a soothing kind of heat. So potent, so intense, but somehow it’s welcome. My body does not want to reject it. Does not want to flinch away from it, is not looking for a way to protect itself from it. \u003c/p\u003e","sourceLink":"https://allnovel.net/unravel-me-shatter-me-2/page-53.html","bookId":1772,"creation":"Oct 5, 2019 10:30:06 AM","modification":"Oct 5, 2019 10:30:06 AM"}
