{"id":7871,"no":36,"title":"Chapter XXXVI — A Surprising Discovery","content":"\u0026nbsp;\"I suppose I have done all I can,\" said Ben to himself. \"There will be no object in remaining in Montreal any longer.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He immediately purchased a ticket, and took the next train homeward. He arrived in Boston at mid-day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went at once to the store, and was cordially welcomed by the bookkeeper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see you, Ben,\" said the young man. \"My uncle is well pleased with the orders you have sent home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he is satisfied with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I leave him to tell you that. You can go at once into the countingroom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben reported himself as directed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Welcome back, Ben,\" said the old gentleman. \"Have you just arrived?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reached the station twenty minuets ago, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And came directly to the store; I like that. How do you like drumming?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It requires patience, sir; but I like it. I hope you are satisfied with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have exceeded my anticipations. To be candid with you, I doubted the expedience of sending so young a representative.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know that, sir, and it made me work harder.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should have no hesitation in sending you again. In fact, I shall probably send you next month to New York and Philadelphia.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like that very much, sir,\" said Ben, his eyes sparkling. \"I shall try to satisfy you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you will,\" said his employer kindly. \"I never doubted your fidelity. Now I feel assured of your capacity and tact. Have you any orders not yet reported?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two or three small ones, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give them to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This done, Mr. Porter dismissed Ben for the day. \"You need not report for work till to-morrow morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben was glad to go to his boarding-house. On arriving there he received another cordial greeting, this time from Mr. Benton. The old gentleman seemed really delighted to see him, and eager to learn what he had accomplished. Ben began to speak of the orders he had received; but Mr. Benton interrupted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t mean that,\" he said. \"I want to hear about your own affairs. Did you see Mr. Brief the lawyer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you like him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at all, at first, but better before we parted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How was that?\" asked Mr. Benton, showing some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At first he insisted strongly on the claim the estate has against my aunt; but after awhile he said he should not press the matter at present, and recommended us to look for Uncle Matthew\u0027s letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have searched for it, have you not?\" asked Mr. Benton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; but so far without success. Still I haven\u0027t given up all hope of finding it. My motto is, \u0027Wait and Hope.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it will all come out right,\" said the old man. \"Did you see John Tremlett?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell me about him,\" said the old man eagerly. \"Ho does he look?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He looks like a fast young man,\" answered Ben. \"I did not like him at all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think he is spending money fast?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know he is. How much money do you think he has drawn in a month?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two hundred dollars?\" suggested Mr. Benton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had drawn eight hundred and spent it all, for he came into the office to ask for more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The young scoundrel!\" exclaimed Marcus Benton, with an excitement which Ben could not understand. \"Why he is making ducks and drakes of my old friend\u0027s fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you know Uncle Matthew?\" asked Ben quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered the old man. \"I told you so, didn\u0027t I?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, you never told me that. Do you know John Tremlett?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I have seen him. He was a sober, steady young man apparently, who ingratiated himself with Mr. Baldwin, whom he deceived as to his real character.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What relation was he to Uncle Matthew?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very distant, but he seemed near, having been in his employ for several years. He collected rents and attended to other necessary matters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he was ever sober and steady, he has changed a good deal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did Mr. Brief give him the money he asked for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not all he wanted. He gave him one hundred dollars, and reminded him that he was only at liberty to pay over to him the income of the estate—that is, for the first twelve months.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite right!\" murmured Mr. Benton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He lectured him upon his extravagance and fast life, and warned him that he must check himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He did right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What I dislike most about this John Tremlett was the way in which he spoke of Uncle Matthew,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did he speak of him?\" demanded Marcus Benton quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As a tight-fisted old curmudgeon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He did—the young viper!\" exclaimed the old man indignantly. \"Spoke so of the man who left him his fortune!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. I couldn\u0027t help telling him I thought it not very becoming to speak in that way of his benefactor; and he told me to mind my own business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t have believed John Tremlett would act so,\" said Mr. Benton slowly; \"I trusted him so, and always treated him kindly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You trusted him!\" repeated Ben, astonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My boy,\" said Mr. Benton, \"the time has come for me to throw off the mask. I am not Marcus Benton, as you suppose. I am Matthew Baldwin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I thought Mr. Baldwin was dead—committed suicide,\" exclaimed Ben, in wild amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The world thinks so; but the world is mistaken. I will tell you the whole story. I found myself getting old. In all probability I had but a few years to live. By industry and economy I had accumulated a fortune, which I must leave behind me. I was anxious that it should not be squandered. I selected John Tremlett as my heir. So far as I knew he was devoted to my interests, and he seemed steady in his habits. But it occurred to me to try him. Accordingly I sent a letter to my lawyer, Solomon Brief, who had my will in his possession, announcing my intention to commit suicide, and directing him to open the will and carry out the provisions. Then I left Montreal secretly, staying a short time in northern Vermont. Later I came on to Boston and managed to throw myself in your way. Not knowing me, you treated me with kindness and consideration. I became interested in you, and regretted that I had made no provision for you and your aunt. Through you I have learned how unwisely I disposed of my fortune. Thank Heaven it is not too late to remedy that.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This seems like a romance, Mr. Benton—I mean, Uncle Matthew.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; call me uncle. I like to feel that I have somebody to live for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come out to Milltown with me, Uncle Matthew. Aunt Jane will be delighted to see you,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have work to do first,\" said the old man firmly. \"I must go to Montreal, and you must go with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not sure that Jones \u0026amp; Porter will allow me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then throw up your situation. You shall lose nothing by it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When do you wish to start?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-night,\" said Mr. Baldwin resolutely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I must go to the store, at once, and give notice of my absence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben lost no time in going to the store. He explained matters fully, and obtained a week\u0027s leave of absence. Then he bought tickets for his uncle and himself, and they set out on their long journey.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3021/83573.html","bookId":260,"creation":"Aug 1, 2019 8:03:31 AM","modification":"Aug 1, 2019 8:03:31 AM"}
