{"id":7839,"no":4,"title":"Chapter IV — The Boys\u0027 Race","content":"\u0026nbsp;Ben felt that his chances of winning the prize were very good. Among his schoolmates he was distinguished for his superiority in all athletic sports. He could jump farther and run faster than any of the boys of his age; and this was a ground of hope. On the other hand, he could not tell how many contestants there might be. He had measured himself against the boys of his acquaintance; but there were hundreds of other boys in the city, and among them it was quite possible that there might be one who surpassed him. However, Ben was always hopeful, and determined to do his best to win. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One of the committee now came forward and announced the boys\u0027 race. The distance was to be the same, the prize five dollars, and there was a limitation of age. No boy over seventeen years of age was permitted to enter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to compete, James?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess not. I don\u0027t stand any chance against you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know about that. I might stumble or give out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like the five dollars well enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then enter your name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I will. I may as well try.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So Ben and James were the first to enter their names.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you coming in, George?\" asked Ben of George Herman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I lamed myself in jumping yesterday, and am not in condition; my brother, Frank, is going to enter. Of course he won\u0027t stand any chance, for he is too young.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next to put down his name was Radford Kelso.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can\u0027t run, Radford. You\u0027re too fat,\" said George Cormack.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re as fat as I am,\" retorted Radford. \"I stand as much chance as you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Next came Arthur Clark and Frank Jones, both tall and long of limb, and looking as if they might be dangerous rivals. Both were strangers to Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid one of those fellows will outrun me,\" said Ben, aside, to James.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are taller, but perhaps they can\u0027t hold out as well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But the course is only two hundred yards,\" said Ben; \"that is against me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then the announcement was made, on behalf of the committee, that the distance would be increased to three hundred yards, and that there would be a second race of a hundred and fifty yards for boys under fourteen, the prize being two dollars and a half.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Frank,\" said George Herman to his brother, \"you had better wait and enter the second race.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I will and here is Charlie. He can go in, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Edward Kemp, Harry Jones and George Huntingdon next entered their names for the first race. The list was about to be declared complete, when an active, well-made youth advanced, and expressed a wish to compete. He had just reached the grounds, and learned that a race was to be run. He gave his name as John Miles, from Boston.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is he, George? Do you know him?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe he is visiting some friends in Milltown.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He looks as if he might run.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is well made for running. The question is, has he had any training.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s going to decide the matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take your places, boys!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the order, the contestants, whose names have already been given, took their places in line.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Miles glanced carelessly and rather contemptuously at his rivals.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll show them how to run,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind,\" said Frank Jones, who stood next to him. \"We never saw anybody run, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have practiced running in a gymnasium,\" said Miles pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Running is the same all the world over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps it is; but I run on scientific principles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank Jones laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very condescending to run with us, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I go in for all the fun I can get.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you expect to win the prize?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I do. Who is there to prevent? You don\u0027t pretend to run, do you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I\u0027ve always supposed I could run a little, though I have never run in a gymnasium; but there are better runners here than I. That boy\"—pointing to Ben—\"is said to be a good runner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He!\" said John Miles contemptuously. \"Why, I\u0027m a head taller than he. He\u0027s a mere baby.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, we shall see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Time was called, and the signal to start was given.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys started almost simultaneously; Arthur Clark was fastening a girdle about his waist, and that delayed him a little. For a few rods all the boys kept pretty well together. Then three gradually drew away from the rest. These three were John Miles, Frank Jones, and Ben Bradford. Arthur Clark was just behind, but his loss at the start put him at a disadvantage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the race was half over, John Miles led, while, fifteen feet behind, Ben Bradford and Frank Jones were doing their best to overtake him. John Miles wore upon his face the complacent smile of assured victory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At two hundred yards, Frank and Ben had partially closed the gap between themselves and John Miles. Intent though he was on his own progress, Ben had leisure to observe that Miles was beginning to lose ground. It seemed clear that he was inferior to Ben in sustained power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is hope for me yet,\" thought Ben. \"I am not in the least tired. Toward the end I will put on a spurt, and see if I can\u0027t snatch the victory from him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go in and win!\" exclaimed Frank Jones. \"You\u0027re got more wind than I. Don\u0027t let a stranger carry off the prize.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not if I can help it,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was now but four feet behind John, and there were fifty yards to be run.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the first time, John Miles became apprehensive. He turned his head sufficiently to see that the boy whom he had considered beneath his notice was almost at his heels.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t let a baby like that beat me,\" he said to himself, and he tried to increase the distance by a spurt. He gained a temporary advantage, but lost more in the end, for the attempt exhausted his strength, and compelled him to slacken his speed farther on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Twenty yards from the goal the two rivals were neck and neck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now for my spurt!\" said Ben to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He gathered himself up, and darted forward with all the strength that was in him. He gained six feet upon his rival, which the latter tried in vain to make up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The excitement was intense. Popular sympathy was with Ben. He was known to be a Milltown boy, while John Miles was a stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Put on steam, Milltown!\" shouted the crowd.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hurrah for Boston!\" called out two personal friends of John Miles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben crossed the line seven feet in advance of John, amid shouts of applause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank Jones came in an easy third, and Arthur Clark ranked fourth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I congratulate you,\" said Frank to Ben, who stood, flushed and pleased, at the goal. \"You\u0027ve won the prize fairly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Miles stood by, mortified and sullen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Better luck next time!\" said Frank Jones. \"You see we know a little about running.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should have won easily enough if I hadn\u0027t had a sudden attack of cramp,\" said John grumbling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t run as if you had the cramp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You say so, because you don\u0027t know how fast I can run. I didn\u0027t run at all this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s unlucky. I wanted to see some real running.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like to run the race over again,\" said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course, you can\u0027t for the prize has been won.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care about the prize. I\u0027ve got money enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t,\" said Ben; \"I care more for the money than the victory.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here!\" said John. \"I\u0027ll put up five dollars myself, if you\u0027ll run with me again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will?\" exclaimed Ben, his eyes sparkling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you won\u0027t ask me to put up anything?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll run if the committee will let me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A ready permission was obtained from the committee; but it was stipulated that the younger boys should have their race first. To this both contestants readily agreed, since it would give them a chance to recover from the fatigue of the race they had just engaged in.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3021/83541.html","bookId":260,"creation":"Aug 1, 2019 8:02:04 AM","modification":"Aug 1, 2019 8:02:04 AM"}
