{"id":7843,"no":8,"title":"Chapter VIII — Deacon Sawyer\u0027s Liberality","content":"\u0026nbsp;About four o\u0027clock on the afternoon of the third day, Ben completed his job. Not only had he sawed and split the wood, but carried it into the woodshed and piled it up neatly, all ready for use. He surveyed his work not without complacency. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The deacon can\u0027t find fault with that job,\" he said to himself. \"He ought to pay me a good price.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The shed opened out of the kitchen. Ben rubbed his feet carefully on the mat, knowing that housekeepers had a prejudice against mud or dust, and, ascending a couple of steps, entered the kitchen. Miss Nancy was there, superintending her \"help.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Miss Nancy,\" said Ben, \"I\u0027ve finished the wood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you piled it up in the woodshed?\" asked the lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Won\u0027t you come and look at it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nancy Sawyer stepped into the shed, and surveyed the wood approvingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve done well,\" she said. \"And now I suppose you want your money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be convenient,\" admitted Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll have to see father about that,\" said Nancy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can I see him now?\" asked Ben, a little anxiously, for he knew that his aunt\u0027s stock of money had dwindled to ten cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; you may go right into the sitting-room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This room was connected by a door with the kitchen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait a minute,\" said Nancy; and she looked at Ben in rather an embarrassed way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben paused with his hand on the latch, waiting to hear what Miss Nancy had to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father is very careful with his money,\" she said. \"He may not realize how much work there has been in sawing and splitting the wood. He may not pay you what it is worth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben looked serious, for he knew that he needed all he had earned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall I do if he doesn\u0027t?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want you to dispute about it. Take what he gives you, and then come to me. I will make up what is lacking in one way or another.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Miss Nancy. You are very kind,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know about that,\" said Nancy. \"I don\u0027t pretend to be very benevolent; but I want to be just, and in my opinion that is a good deal better. Now you may go in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben lifted the latch, and entered the sitting-room. He found that the deacon was not alone. A gentleman, of perhaps thirty-five, was with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I am not intruding,\" said Ben politely, \"but I have finished with the wood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though Deacon Sawyer was a very \"close\" man, he was always prompt in his payments. So much must be said to his credit. He never thought, therefore, of putting Ben off.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you want to be paid, Benjamin?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, I should like it, if convenient to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lemme see, Benjamin, how long has it taken you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two days and a half, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite. It\u0027s only four o\u0027clock now. Have you just go through?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We didn\u0027t make no bargain, did we?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, I left it to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite right. So you did. Now, Benjamin,\" continued the deacon, \"I want to do the fair thing by you. Two days and a half, at twenty-five cents a day, will make sixty-two cents; or we will say sixty-three. Will that do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Ben! He had calculated on three times that sum, at least.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would only be a dollar and a half a week,\" he said, looking very much disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I used to work for that when I was young,\" said the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At the factory I was paid five dollars a week,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nobody of your age can earn as much as that,\" said the deacon sharply. \"No wonder manufacturin\u0027 don\u0027t pay, when such wages are paid. What do you say, Mr. Manning?\" continued the deacon, appealing to the gentlemen with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Manning\u0027s face wore an amused smile. He lived in the city, and his ideas on the subject of money and compensation were much less contracted than the deacon\u0027s.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Since you appeal to me,\" he answered. \"I venture to suggest that prices have gone up a good deal since you were a boy, Deacon Sawyer, and twenty-five cents won\u0027t go as far now as it did then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right,\" said the deacon; \"it costs a sight for groceries nowadays. Well, Benjamin, I\u0027ll pay you a little more than I meant to. Here\u0027s a dollar, and that\u0027s good pay for two days and a half.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben took the money, but for the life of him he couldn\u0027t thank the deacon very heartily. He had been paid at the rate of forty cents a day, which would amount to two dollars and forty cents a week, for work considerably harder than he had done at the factory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon,\" he said briefly, and reentered the kitchen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nancy Sawyer scanned his face closely as he closed the door of the sitting-room. She was not surprised at his expression of disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" she inquired, \"what did father pay you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wanted to pay me sixty-three cents,\" answered Ben, with a touch of indignation in his tone. \"Twenty-five cents a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course that was much too little. What did he pay you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A dollar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much were you expecting to get?\" asked Nancy, in a business-like tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was hoping to get seventy-five cents a day. That would be less than I got at the factory.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think your work was worth that much myself,\" said the spinster.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben felt encouraged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father is getting old. He forgets that money won\u0027t buy as much as it did in his younger days. He means to be just.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I don\u0027t think he succeeds very well,\" thought Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand such things better,\" proceeded Miss Nancy, \"and I try to make up for father\u0027s mistakes, as far as I can. Now tell me what are you meaning to do with the money you received for this job?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall give it all to Aunt Jane,\" answered Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a good boy,\" said Nancy approvingly. \"And she will buy groceries with it, I suppose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Miss Nancy. It is about all she has to depend upon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so. Now, Ben, I will tell you what I will do. Father keeps me pretty close myself, as far as money goes, but we have plenty in the house of groceries and such things as your aunt will need to have. Now, will it do just as well if I give you the balance that you have earned in that form?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will do just as well, Miss Nancy, and I am very much obliged to you for your kindness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not kind, only just,\" said Nancy. \"I don\u0027t think it honest to pay too little for work, nor father, either, for that matter, only he doesn\u0027t always set the right value on it. Maggie, you may bring me the large covered basket in the back room up-stairs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maggie brought the basket at once, and Miss Nancy went with it into the storeroom, or buttery. She tied up various parcels of sugar, tea, and flour, and added two loaves of bread and a couple of pies, quite filling the basket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There,\" she said, \"I guess you\u0027ll find a dollar and a half\u0027s worth of articles here. Give my love to your aunt, and tell her from me that they are not a gift, but that you have fairly earned them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Miss Nancy,\" said Ben, overjoyed at his good luck. \"You may say you are not kind, but I am sure you are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Nance was really pleased by this recognition of her attempt to do justice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it\u0027s kindness,\" she said, \"you are very welcome. Do you find it hard to get along, Benjamin?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pretty hard, since I have lost my place at the factory, Miss Nancy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell your aunt,\" said Miss Nancy significantly \"that if she ever want to borrow any flour or groceries, to come to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" said Ben gratefully, and he felt sure that Nance had a kind heart, in spite of her prim and formal demeanor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a glad heart, he carried home the basket, and its contents brought great relief to Mrs. Bradford, who, as she told Ben, was \"most out of everything.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3021/83545.html","bookId":260,"creation":"Aug 1, 2019 8:02:15 AM","modification":"Aug 1, 2019 8:02:15 AM"}
