{"id":103993,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Any ideas as to why they would use the Constabulary soldiers and not their own?” Dwayne had wondered about that aspect of the assignment when Maria had told him about the serum.\u003c/p\u003e\n\u003cp\u003e“I’ll let you know in twenty-four hours,” Petra answered, smiling slightly. “I may not be able to get you a direct answer to your question, but I think I can find a back door.”\u003c/p\u003e\n\u003cp\u003eDwayne chuckled. “I should have known you weren’t empty-handed.”\u003c/p\u003e\n\u003cp\u003ePetra lifted her shoulders. “I’m never empty-handed. I just don’t always choose to show what I’m holding.”\u003c/p\u003e\n\u003cp\u003e“You’re trying to figure out what I know, or don’t know,” Dwayne said after a beat.\u003c/p\u003e\n\u003cp\u003e“Do you know anything?”\u003c/p\u003e\n\u003cp\u003e“I know the SWD is veiling itself in secrecy and that I don’t trust them.”\u003c/p\u003e\n\u003cp\u003e“And that is all you will tell me,” Petra said.\u003c/p\u003e\n\u003cp\u003e“And that is all I can tell you,” Dwayne answered.\u003c/p\u003e\n\u003cp\u003eThere was a flicker of annoyance in Petra’s expression, but she didn’t let it seep into her voice as she said, “I will report in as soon as I have more information.”\u003c/p\u003e\n\u003cp\u003eDismissing her with the nod of his head, Dwayne settled back in his chair and let out a low groan as the door slid shut behind Petra. He was beginning to regret not trying to get Maria to reconsider her decision. Her silence was frightening him. Of course, there could be all sorts of reasons why she was not accessing the secret program on her wristlet, but the growing unease within him was not something he could ignore. He trusted his gut.\u003c/p\u003e\n\u003cp\u003eActivating his wristlet, he checked again to see if Maria had left him a message or logged on. She hadn’t. Grimly, Dwayne activated yet another secret program in his wristlet. He sent out a call query and waited.\u003c/p\u003e\n\u003cp\u003eSeconds later, the other party answered.\u003c/p\u003e\n\u003cp\u003e“This is unexpected,” Lindsey said, rubbing sleep out of her eyes.\u003c/p\u003e\n\u003cp\u003e“I need your...skills.”\u003c/p\u003e\n\u003cp\u003eLindsey yawned, then nodded. “You got it. What am I doing?”\u003c/p\u003e\n\u003cp\u003e“Hacking into the SWD.” Dwayne had the utmost confidence that Lindsey could handle it. She was a genius beyond compare.\u003c/p\u003e\n\u003cp\u003eScrunching up her face, Lindsey seemed to contemplate the challenge. After a few seconds, she nodded. “I’ll get right on it. What do you want to know?”\u003c/p\u003e\n\u003cp\u003e“Anything and everything you can find out. Some of our people were transferred over there, including Vanguard Martinez.”\u003c/p\u003e\n\u003cp\u003eLindsey’s eyes widened. “Maria?”\u003c/p\u003e\n\u003cp\u003e“Yes. Can you see what you can uncover?”\u003c/p\u003e\n\u003cp\u003e“You got it.” Lindsey killed the connection.\u003c/p\u003e\n\u003cp\u003eDwayne rubbed his eyes and glanced over his shoulder at the gray city shrouded in rain and mist. He yearned for a world without the Inferi Scourge, but he wasn’t willing to sacrifice Maria to get it.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eAwareness came swiftly and shockingly every time she was roused out of her torpor. Maria hated the lack of control she had over her mind and body. She wasn’t even attuned to the moment when she ceased to function. Each time she woke, she felt as though she was being reborn out of darkness. It was disconcerting. She desperately wanted to return to her room and call Dwayne, but because she had no need to eat or sleep the SWD team kept her busy.\u003c/p\u003e\n\u003cp\u003eSome of the tests were odd. She was made to watch short films on everything from war to parenthood. Some of the images were upsetting, while others were amusing. Her laughter during one film startled her, but appeared to please the male scientist watching over her. He was young with too pale skin and a shock of black hair. She could see his blue eyes watching her every move. More than once she was tempted to pretend to lash out at him and see if he would jump. Though the scientists working with her appeared pleased, she could see they were unnerved by her presence. She couldn’t blame them. She was now Inferi Boon after all.\u003c/p\u003e\n\u003cp\u003eThe hours slid away like water. She lost all track of time as the tests continued. It seemed as though whenever she faded out, she was revived by a new set of scientists ready to send her through a string of tests. Dr. Curran sometimes was in the room overseeing the testing, but other times she was absent.\u003c/p\u003e\n\u003cp\u003eAs the tests progressed, Maria’s restraints were systematically removed until only the shackles around her ankles remained. It was a relief to finally be able to move her arms and upper body. Not because she had been in any sort of pain, but because she had felt like a prisoner. The discomfort she would have felt when alive after being seated for so long was absent.\u003c/p\u003e\n\u003cp\u003eWhen she was finally allowed to write and manipulate a pad, she began to feel more like an actual person than a test subject. When a rifle was placed before her and she was told to field-strip it, clean it and reassemble it, she couldn’t keep from smiling. Though her sense of touch was diminished, she was still able to perform the task efficiently and quickly.\u003c/p\u003e\n\u003cp\u003eWhen she finished, Dr. Curran entered the room and the colorless man with the blue eyes slipped out.\u003c/p\u003e\n\u003cp\u003e“Well, done, Maria. Very impressive.” Dr. Curran sat down across from her and set the pad on the table. For once, Dr. Curran was smiling broadly and genuinely. “You have surpassed our every expectation. Every test result is superb. Words cannot express how excited we all are.” Surprising her, Dr. Curran laid her hand over Maria’s. “You’re the most remarkable woman I have ever met. You’re the hope of the city now.”\u003c/p\u003e\n\u003cp\u003eMaria fidgeted nervously, trying not to pull her hand away from the startling warmth of the scientist’s hand. “I’m doing my job. I believe what I’m doing is right.”\u003c/p\u003e\n\u003cp\u003e“I know you do and it gives me such hope that the others will follow in your footsteps.” Dr. Curran withdrew her hand and tapped her stylus on the pad.\u003c/p\u003e\n\u003cp\u003eThe last of Maria’s restraints retracted.\u003c/p\u003e\n\u003cp\u003eStartled, Maria sat in silence staring at her unencumbered limbs. Slowly, she raised her eyes and said, “You’re not afraid of me? Even though I’m Inferi Scourge.”\u003c/p\u003e\n\u003cp\u003e“You’re not Inferi Scourge, but Inferi Boon. You’re the answer to the hopes of The Bastion.” Dr. Curran was positively glowing. It was rather troubling. “You’re going to be escorted to your room now. Please shower and change into your dress uniform. It’s time to show the upper echelon our future.”\u003c/p\u003e\n\u003cp\u003eMaria slowly slid her chair back and stood. Her balance was a little off, but she adjusted her stance and found her center. For the first time she noticed her boots had been set near the door. Dr. Curran rose and watched as Maria quickly donned her footwear.\u003c/p\u003e\n\u003cp\u003e“I know this has been difficult for you, Maria. Though I sympathize with your predicament, I cannot imagine what you’re going through. Your strength of will is inspiring.”\u003c/p\u003e\n\u003cp\u003e“The perfect test subject?” Maria arched an eyebrow at the scientist. She had been unable to hold back that stinging comment.\u003c/p\u003e\n\u003cp\u003eDr. Curran nodded. “I won’t apologize again for calling you that. The reality is you’re our test subject. You’re the first of your kind. You’re our salvation. You and the other volunteers will give humanity a chance to live and thrive again. I am sorry that we were not forthcoming with the truth of the procedure, but I am proud of the success of this endeavor. I am proud of you.”\u003c/p\u003e\n\u003cp\u003eMaria set her feet apart and tucked her hands behind her back. “I won’t lie, Dr. Curran. You and Mr. Petersen are not my favorite people in this world. But I will do my job to the best of my abilities for the citizens of The Bastion.”\u003c/p\u003e\n\u003cp\u003e“Of that, I have no doubt,” Dr. Curran answered, smiling.\u003c/p\u003e\n\u003cp\u003eAfter all the time spent in the testing rooms, Maria was relieved to finally take a shower and have a little bit of time for herself. To keep her from fading into torpor, the wristlet emitted a pulse every few minutes to keep her senses stimulated. It was a little annoying at first, but she soon became used to it. After scrubbing her body and washing her hair, she stepped out into the small room and stared into the mirror.\u003c/p\u003e\n\u003cp\u003eThere was a slightly bluish shadow around her eyes and mouth, and her irises had a strange cloudy appearance. Otherwise, she looked like herself. If only she felt completely alive again. The faint numbness in her limbs was unnerving.\u003c/p\u003e\n\u003cp\u003eGlancing at her makeup bag, she pondered using concealer to hide the strange discoloration around her eyes, but opted not to. Let them see what she had become to save the last of humanity.\u003c/p\u003e\n\u003cp\u003eShe braided her hair then knotted it on top of her head before starting to dress. Checking the time on her wristlet, she was surprised to see that it was only just past dinner time. It would be a few more hours before she could contact Dwayne safely and discreetly. Despite the many breaks during the testing, she was aware that it had been a very long day.\u003c/p\u003e\n\u003cp\u003eMr. Petersen retrieved her from her room. She regarded him coolly as she stepped into the hallway.\u003c/p\u003e\n\u003cp\u003e“You’re very presentable,” Mr. Petersen said, and flashed a smile that didn’t reach his cold eyes.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Maria answered, her tone slightly wary.\u003c/p\u003e\n\u003cp\u003e“Considering everything you have endured for the last two weeks, I have to say you look remarkably well. Strong, lucid...almost human.”\u003c/p\u003e\n\u003cp\u003e“Two weeks?” Maria lifted her eyebrows at him as they walked down the hall.\u003c/p\u003e\n\u003cp\u003e“Yes. Two weeks. They did tell you, didn’t they? That you have been being tested for the last two weeks?” There was a cruel light in his eyes and his smile was downright serpentine. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-21.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
