{"id":104013,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe listened because he knew she needed him to. There was really nothing for him to say. He couldn’t imagine seeing the Inferi Scourge docile and up close like she was experiencing.\u003c/p\u003e\n\u003cp\u003e“It’s so...intimate,” Maria continued, pulling herself out of her thoughts. “I’m seeing who they were before they died, then setting them free.”\u003c/p\u003e\n\u003cp\u003eDwayne knew they were pushing it on the time limit, but he didn’t want to let her go. He wanted to hear her voice and see her face. He needed to hear her speak and share her thoughts.\u003c/p\u003e\n\u003cp\u003e“Times up,” Maria whispered sadly.\u003c/p\u003e\n\u003cp\u003e“I love you,” Dwayne said.\u003c/p\u003e\n\u003cp\u003e“I love you,” Maria answered, then was gone.\u003c/p\u003e\n\u003cp\u003eSliding off his bed, Dwayne turned on his coffee maker and again sent a message to Lindsey. She still hadn’t responded and he was becoming increasingly concerned. Sleep would be long in returning. He wasn’t even sure he wanted to sleep after what Maria had told him. He was just pouring a hot cup of the freshly made coffee when his wristlet beeped that a message was incoming.\u003c/p\u003e\n\u003cp\u003e“Hello?” he said, answering in voice-only mode.\u003c/p\u003e\n\u003cp\u003e“I got your message,” Lindsey said. Her voice didn’t sound sleepy, but actually quite alert. “I’m working on what you asked for.”\u003c/p\u003e\n\u003cp\u003e“There’s more now.”\u003c/p\u003e\n\u003cp\u003e“Shit. Really? How deep is this rabbit hole?”\u003c/p\u003e\n\u003cp\u003eDwayne grinned despite the situation. “That’s what I’m starting to wonder. The commandant was unavailable today. They’re keeping me in the dark about the Gaia Cult situation.”\u003c/p\u003e\n\u003cp\u003e“That’s because they’re preparing a huge media blitz on the subject. They realized that they can’t keep the news of the gate closure away from the media much longer. The guards on the walls can see it’s closed. Also, if they pull the guards on the wall, then the people in the city will notice.”\u003c/p\u003e\n\u003cp\u003e“They should have thought of all that before,” Dwayne said sourly.\u003c/p\u003e\n\u003cp\u003eLindsey let out a sarcastic snort. “They did, but their initial plan was to eliminate the wall patrols. The president overrode that plan because he didn’t want the population freaking out. He told them to make it work. Now they’re in a quandary. They have to rework their story to the media.”\u003c/p\u003e\n\u003cp\u003e“Interesting.”\u003c/p\u003e\n\u003cp\u003e“Not all is well at the top.”\u003c/p\u003e\n\u003cp\u003e“Which I know all too well,” Dwayne admitted.\u003c/p\u003e\n\u003cp\u003e“So, what more do you have for me?”\u003c/p\u003e\n\u003cp\u003eDwayne told her.\u003c/p\u003e\n\u003cp\u003eLindsey drew in her breath and was silent.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“Well,” Lindsey hesitated. “Well, I’m not sure yet. But I did trace a few communiques from several years back that made it sound like maybe some of the Scrags were acting irregularly. Give me more time. I’ll turn up something.”\u003c/p\u003e\n\u003cp\u003e“Keep me in the loop and don’t go quiet for so long.”\u003c/p\u003e\n\u003cp\u003e“I have a life, you know. But I’ll keep in touch.”\u003c/p\u003e\n\u003cp\u003eThe link went dead.\u003c/p\u003e\n\u003cp\u003eTaking a long sip of his cooling coffee, Dwayne knew for sure he wouldn’t be sleeping anymore that night.\u003c/p\u003e\n\u003cp\u003eChapter 19\u003c/p\u003e\n\u003cp\u003eThe next morning, Dwayne was almost to the monorail station when his wristlet chimed. Activating it, he glanced down to see his eldest daughter’s face. She was the spitting image of her mother when she was the same age and it always startled him. He loved Caitlyn with all his heart, but she also had her mother’s temperament, which made her a bit difficult to deal with at times.\u003c/p\u003e\n\u003cp\u003e“Hey, honey, what’s up?” he asked taking the metal stairs two at a time.\u003c/p\u003e\n\u003cp\u003e“Big news is about to break,” Caitlyn said in a tone that was a little too brisk. It meant she was scared. “I thought I would warn you.”\u003c/p\u003e\n\u003cp\u003eDwayne hesitated as he reached the station. He stepped away from the other commuters. Caitlyn’s job as an assistant to one of the vice president’s secretaries was something she took very seriously. Regardless of him being the Castellan of the Constabulary, she never divulged any information to him. This was unusual for her. The tiny dot in the corner of the screen revealed this was a high security call.\u003c/p\u003e\n\u003cp\u003e“What is it?” Dwayne stared into his daughter’s eyes. They were the only thing she had inherited from him. The same blue, the same intensity.\u003c/p\u003e\n\u003cp\u003eSighing, she leaned forward. “The gate is closed. The official story comes out in an hour. The circumstances surrounding the gate closure are top secret.” Caitlyn hesitated then said, “Daddy, I trust you not only as my father, but as the Castellan. I want you to know that. I don’t know how much they will tell you, but...”\u003c/p\u003e\n\u003cp\u003eDwayne felt his heart seize up. His little girl was afraid. He could see it.\u003c/p\u003e\n\u003cp\u003e“Don’t let them keep you out of the loop,” she said at last.\u003c/p\u003e\n\u003cp\u003eThe call ended.\u003c/p\u003e\n\u003cp\u003eThe face of an Inferi Scourge came into sharp focus as her vision was restored, and she thrust it away. She hated entering torpor so close to the hordes. Observing the rest of the squad, she saw that they were still in their blacked out state. Most laid on the ground to emulate sleep. It was a way to maintain a little distance between the squad and the undead around them.\u003c/p\u003e\n\u003cp\u003eOmondi was seated nearby. She was viewing him when his eyes suddenly focused. Startled, he studied the area, then cast a questioning look at Maria.\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003eThey both checked their wristlets. They had been revived early. The sun was barely piercing the sky above The Bastion.\u003c/p\u003e\n\u003cp\u003e“What the hell?” Omondi muttered.\u003c/p\u003e\n\u003cp\u003eTheir wristlets chimed. A quick message scrolled across the screens. The SWD would be contacting them within five minutes.\u003c/p\u003e\n\u003cp\u003ePointing to an adjacent position, Omondi pulled out the screen from his backpack. In silence, they strode to where he had indicated. Though the squad wouldn’t awaken until the SWD was done with their conference call, room was needed to unroll the screen. Omondi found an old dead tree trunk, and together they spread the screen and fastened it at the corners.\u003c/p\u003e\n\u003cp\u003eUnease had settled into Omondi’s features, and Maria mirrored his feelings. The events of the last two days had been disquieting. The mission was supposed to be a simple endeavor, yet now appeared immensely complicated. It was difficult to put into words the myriad of thoughts that boiled within her mind. The silence between them was not reassuring.\u003c/p\u003e\n\u003cp\u003eOmondi linked his wristlet to the screen, and they waited.\u003c/p\u003e\n\u003cp\u003eExactly five minutes later the screen activated. Mr. Petersen and Dr. Curran appeared, projected in all their holographic glory. Dr. Curran looked exhausted, but Mr. Petersen appeared calm as usual. Unexpectedly, Commandant Pierce of The Bastion Constabulary sat at the conference table as well. Her dark eyes and sharp cheekbones always made Maria think of a hawk. Her silvery-black afro was twisted into spirals that were wrapped into a bun at the nape of her elegant neck. She was beautiful, severe, and, according to Dwayne, borderline paranoid about everything.\u003c/p\u003e\n\u003cp\u003e“Congratulations on the closure of the gate,” Commandant Pierce started.\u003c/p\u003e\n\u003cp\u003e“Thank you. It was a great success for us personally and for The Bastion,” Omondi answered.\u003c/p\u003e\n\u003cp\u003eCommandant Pierce continued, “The death of Special Constable Coleman was an unexpected tragedy. We reviewed the report of his death. Though it was an unfortunate event, we learned new vital information about the Inferi Scourge. That we now know how they identify their prey is of great importance.” She gave Dr. Curran a pointed look.\u003c/p\u003e\n\u003cp\u003eDr. Curran didn’t shrink under the piercing glare. “With the data we’re now receiving from the field we do not anticipate any further setbacks of this kind. Now that we know specifically what stimuli compel the Inferi Scourge to attack, we can plan to avoid such situations again,” Dr. Curran responded, her tone crisp and slightly defensive. “We will be updating the mission specifics accordingly.”\u003c/p\u003e\n\u003cp\u003eCommandant Pierce’s impassive appearance didn’t alter when she spoke again. “I have been asked by the president to inform you that we’re releasing the news of the gate closure to the public, and that a special ops team is destroying the Inferi Scourge. Initially we were going to wait to disclose this information, but the president feels it’s in the best interest of the city if the population knows about the success we’re incurring on the field. The fact that you’re Inferi Boon will not be released to the media. Nor will your names. That aspect of the mission must remain secret. We will determine when to update the population on your progress as time goes on.” The commandant paused, and instinctively, Maria knew what came next wouldn’t be pleasant. “We’re altering your work schedule to twenty hours a day.”\u003c/p\u003e\n\u003cp\u003e“Understood,” Omondi said with a brief nod of his head.\u003c/p\u003e\n\u003cp\u003e“We realize this may be emotionally taxing, but feel that the squad can handle the duress,” Dr. Curran said with a short smile.\u003c/p\u003e\n\u003cp\u003eMaria didn’t think the doctor believed her own words.\u003c/p\u003e\n\u003cp\u003e“Any questions?” Commandant Pierce asked.\u003c/p\u003e\n\u003cp\u003e“The Inferi Scourge from yesterday who spoke-” Omondi started to say.\u003c/p\u003e\n\u003cp\u003e“Vanguard Martinez heard a grunt and her mind interpreted it as a word,” Mr. Petersen said swiftly over him. Mr. Petersen directed his gaze at Maria. “You’re still adapting to your new environment. Your mind will play tricks on you. The Inferi Scourge do look remarkably alive at times, but they’re not capable of speech.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-41.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
