{"id":104019,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDwayne shifted his weight on his creaky stool and regarded her thoughtfully. “On which matter?”\u003c/p\u003e\n\u003cp\u003e“The mission outside the walls,” she answered.\u003c/p\u003e\n\u003cp\u003e“It’s a massive success for the SWD,” Dwayne said with the shrug of his shoulders. “If the news vids are to be believed.”\u003c/p\u003e\n\u003cp\u003e“Exactly,” the commandant said pointedly.\u003c/p\u003e\n\u003cp\u003e“How much do you know about their operation?”\u003c/p\u003e\n\u003cp\u003eShe lifted one shoulder. “Enough.”\u003c/p\u003e\n\u003cp\u003e“We transferred some of our best soldiers to the SWD a few months ago,” Dwayne said, deciding to push a little.\u003c/p\u003e\n\u003cp\u003eThe commandant arched her eyebrow.\u003c/p\u003e\n\u003cp\u003e“The special ops out there are our people, aren’t they?”\u003c/p\u003e\n\u003cp\u003eThere was the tiniest inclination of her chin.\u003c/p\u003e\n\u003cp\u003e“But SWD is getting all the credit.”\u003c/p\u003e\n\u003cp\u003eAgain, the barest of nods.\u003c/p\u003e\n\u003cp\u003e“And you don’t like this.”\u003c/p\u003e\n\u003cp\u003e“I play the game we all participate in.” It was hard to hear her over the chatter of all the people around them and the sizzling of the oil in the big skillets on the stove.\u003c/p\u003e\n\u003cp\u003e“What do you want from me?”\u003c/p\u003e\n\u003cp\u003eIn a voice that was barely audible, she said, “Your help.”\u003c/p\u003e\n\u003cp\u003eDwayne inclined his head toward her. He could see the anger, frustration, and fear in her eyes. “I’m doing as you ask. You’ve seen my reports.”\u003c/p\u003e\n\u003cp\u003e“This is on another matter.” Her eyes met his in an almost defiant way.\u003c/p\u003e\n\u003cp\u003eDwayne sensed she was taking a risk just by broaching the unknown subject with him, even if her words were chosen in such a way that people outside their world wouldn’t understand the true meaning.\u003c/p\u003e\n\u003cp\u003e“You have an uncanny knack of being one step ahead of me,” she continued at a discreet volume. “In the past I have wondered how this happens, but my inquiries always came up short. Maybe you’re a man of hidden talents, or hidden methods. Or maybe you’re just that intuitive. Whatever the case, you always seem to know what you...shouldn’t.” She tilted her head slightly. “Continue this practice.”\u003c/p\u003e\n\u003cp\u003eDwayne sat back, folded his arms over his chest, and stared at her.\u003c/p\u003e\n\u003cp\u003eCommandant Pierce dismissed him with a look and turned her full attention to watching the cooks finish preparing her meal. He was clearly free to go. Dwayne gave her a slight nod that he knew she could see out of the corner of her eye, and slid off his stool.\u003c/p\u003e\n\u003cp\u003eHe strode away into the crowd.\u003c/p\u003e\n\u003cp\u003eThe carrier was not significantly damaged considering the amount of time it had been abandoned and left to the wrath of the Inferi Scourge. A few of the antennas were snapped off and a few of the outside compartments had been pried open, but otherwise the damage was minimal. Maria was impressed by the efficiency of the security system. Scourge bodies were piled up around the vehicle.\u003c/p\u003e\n\u003cp\u003e“Home sweet home,” Denman joked as he walked alongside her.\u003c/p\u003e\n\u003cp\u003e“Doesn’t look bad considering,” Cormier said from behind them. She jogged ahead a few paces to get a closer view. The driver of the carrier flashed a grin their way. “This vehicle is so bad ass. I want to live in it when this is all done.”\u003c/p\u003e\n\u003cp\u003e“We should go joy riding,” Mikado suggested with a grin at Cruz.\u003c/p\u003e\n\u003cp\u003eCruz returned the smile, lightly nudging him with her elbow.\u003c/p\u003e\n\u003cp\u003e“With the numbers down in this area, we could use the blades on the plow to kill the rest of the Scrags,” McKinney suggested. His boyish grin was charming when it appeared on his face.\u003c/p\u003e\n\u003cp\u003eIt had been nearly a week since the Chief Defender had departed. The first day or two had been quiet, but on the third day it was if the pall of grim anxiety had lifted. Without Omondi’s dour presence and the reclusive SWD soldiers shadowing them, the Constabulary soldiers were in higher spirits than before. It was a relief to see them smiling and engaging in fun banter again.\u003c/p\u003e\n\u003cp\u003eTheir duty was taxing on their minds, but every day the valley showed the results of their hard work. Maria had lost count of how many of the Scourge she had personally killed. The totals were transmitted from their weapons to the SWD and some of the soldiers kept a manual count. McKinney and Holm had tracked their every kill, but Maria really didn’t want to know her number. She was tired of death.\u003c/p\u003e\n\u003cp\u003e“Clear the area around the carrier,” Maria ordered.\u003c/p\u003e\n\u003cp\u003eDragging the bodies away from the carrier was an easier task now that the area was cleared of most of the Scourge. Only a few straggler packs remained. By nightfall, they would be gone. Joining the rest of the squad, she helped gather the corpses into piles.\u003c/p\u003e\n\u003cp\u003e“Sir, I should get in there and make sure nothing is too fouled up,” Cormier said. Her frame was virtually vibrating with the need to check out the vehicle.\u003c/p\u003e\n\u003cp\u003e“Give me a full systems report,” Maria answered.\u003c/p\u003e\n\u003cp\u003e“Yes, sir!” Cormier grinned and darted away.\u003c/p\u003e\n\u003cp\u003eHolm and McKinney appeared to be in a competition as they dragged four Scourge each over to the burn piles. Amused, Maria smiled at their cajoling. Looking over her shoulder, she saw Cormier enter the vehicle.\u003c/p\u003e\n\u003cp\u003e“Let’s take a break,” Maria called out.\u003c/p\u003e\n\u003cp\u003eIt was unscheduled, but she needed a moment. They were working harder than ever to destroy the Scourge. Even with half the squad gone, they were making enormous progress. Omondi was pleased with her nightly reports, but never relayed the actions of his own squad. The secrecy was beginning to annoy and frighten her.\u003c/p\u003e\n\u003cp\u003eThe soldiers clustered together in small groups talking and relaxing. She noted Mikado and Cruz sitting aside from everyone else, discreetly holding hands. A few times they had sneaked off together, but they weren’t the only ones. Since Omondi had departed, she had noticed a few clandestine hookups happening. A few jokes about necrophilia had been dropped in the early days, but now people craved to feel connected, to feel human. She didn’t blame them. Her longing for Dwayne seemed to increase every day without him.\u003c/p\u003e\n\u003cp\u003eMentally exhausted, Maria didn’t feel like engaging in small talk. She strolled a short distance away, pulling her hair out of her braid and running her fingers through the silky waves. She was thankful for their recent dip in a pond. They discovered the Scourge avoided water and had been able to spend time washing up and relaxing instead of dragging the depths for the dead.\u003c/p\u003e\n\u003cp\u003eSquatting down, she ran her palm lightly over the soft grass and wildflowers that were growing now that the Scourge had been cleared. In the darkness of her days, the returning beauty of nature was a salve on her tortured thoughts. At times she felt like a ghost drifting through the valley. Separated from her family, friends and Dwayne, she was trapped in her own mind day in and out. Sometimes her mental fatigue was too much to endure. It was the small moments of respite that helped her survive emotionally through the long days.\u003c/p\u003e\n\u003cp\u003eA shadow fell over her and she looked up to see Denman smiling down at her. Crouching, he lightly touched the lavender petals of a wildflower. “Life is returning.”\u003c/p\u003e\n\u003cp\u003e“It gives me hope,” Maria admitted.\u003c/p\u003e\n\u003cp\u003e“Considering how much we’re accomplishing out here, I would think you would feel very hopeful and excited.” Denman cocked his head and stared at her thoughtfully. “More than three-quarters of the valley are cleared.”\u003c/p\u003e\n\u003cp\u003eShe directed her gaze at the fields of green spreading out behind them. “I’m tired of killing. None of this has felt right since the beginning. Omondi leaving after Ryan attacked has me on edge.”\u003c/p\u003e\n\u003cp\u003eDenman nodded solemnly. “About that…”\u003c/p\u003e\n\u003cp\u003e“You’re done with your analysis of your scans?”\u003c/p\u003e\n\u003cp\u003eDrawing in a breath so he could speak, Denman again nodded. “Ryan had been partially eaten. His ribs showed distinct bite marks. Human teeth. At first I thought that maybe when the Scourge tried to infect him they had mangled him, but I am pretty sure he was being consumed when he died.”\u003c/p\u003e\n\u003cp\u003e“He said he was hungry. And I saw Vanguard Stillson have a piece of flesh torn off of him. I swear the Scrag was chewing it.” Maria frowned, her fingers lightly brushing over the grass.\u003c/p\u003e\n\u003cp\u003e“He was even missing three ribs. They were broken and torn out of his body. The Scrags were never reported to consume their victims. I remember from history class that in the first days they were nicknamed zombies because they bit their victims and it was the bite that turned them. But they were never reported as consuming their victims. Never. Something out here has changed some of them.”\u003c/p\u003e\n\u003cp\u003e“Maybe they’re evolving into a more dangerous breed.” Maria frowned. “Is that even possible?”\u003c/p\u003e\n\u003cp\u003e“Maybe. Maybe the virus mutated.” Denman shrugged his shoulders. “Hard to say. It’s not like we have proper equipment out here to make a proper analysis.”\u003c/p\u003e\n\u003cp\u003e“True.”\u003c/p\u003e\n\u003cp\u003e“Are you going to tell Omondi?”\u003c/p\u003e\n\u003cp\u003eMaria could feel Denman’s worried gaze resting on her. “No,” she said after a long pause. “No. I have a feeling he already knows anyway. I don’t want him to know that you scanned the body.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” Denman sighed. “These are bizarre times. But at least within a month or so, we get to go home. All of this will be behind us.”\u003c/p\u003e\n\u003cp\u003e“I never thought we’d make it to this point,” Maria confessed.\u003c/p\u003e\n\u003cp\u003eFor weeks it had felt like the forest of Inferi Scourge was never-ending. The mass of ruined bodies had spread out in every direction, always in her vision, like ghosts haunting her. Then one day, she realized she could look to the south and see nothing but grassy fields and ruined structures. The trees and bushes were green and lush, and, to her surprise, she heard birds singing in the branches. Hope had filled her in that moment. She’d clung to that emotion even when she was in the killing fields. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-47.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
