{"id":104030,"no":58,"title":"Page 58","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“We got some Scrags in pursuit. May I fry them, sir?” Holms voice asked in Maria’s ear bud.\u003c/p\u003e\n\u003cp\u003e“Transmit what you got. Let me look,” Maria answered.\u003c/p\u003e\n\u003cp\u003eImmediately the feed from Holm’s helmet began to play on her screen. The ravaged faces of the Inferi Scourge gave her chills. Their wide, distended mouths and crazed milky eyes would forever haunt her nightmares. Even over the gentle roar of the carrier’s engines and the chatter behind her, she could hear their howls.\u003c/p\u003e\n\u003cp\u003e“Fry ‘em,” Maria answered.\u003c/p\u003e\n\u003cp\u003eImmediately the feed was filled with white hot flames. With satisfaction, Maria watched the creatures enveloped in the inferno dropping away, setting others in their horde on fire. The thrashing fiery bodies fell behind.\u003c/p\u003e\n\u003cp\u003e“That was beast,” Mikado said from behind her.\u003c/p\u003e\n\u003cp\u003eMaria grinned and kept an eye on the screen. The carrier was barreling toward the rendezvous point and sweeping past stirring masses of Scourge. She felt a trickle of sweat slide down her brow and she wiped it away with annoyance. A second later, her eyes widened as she looked down at her gloved hand.\u003c/p\u003e\n\u003cp\u003e“Denman,” she whispered urgently.\u003c/p\u003e\n\u003cp\u003eHe glanced over at her and she pointed to the beads of sweat on her brow. With a gasp, he grabbed his med-pad and rushed to her side. Maria forced herself to focus on the mission at hand and not the steady, slow thumps within her chest. When they had started, she wasn’t sure, but she could feel her heart sluggishly pumping in her chest.\u003c/p\u003e\n\u003cp\u003eDwayne’s feed came back to life. “We can give you limited air support and it looks like you’re going to need it. You burned out the ones that were in pursuit, but there is a mass of several thousand heading to cut you off. I’m redirecting you toward a new rendezvous spot.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” Maria said and shared the information with Cormier.\u003c/p\u003e\n\u003cp\u003e“It’s getting crazy ahead,” Cormier called out.\u003c/p\u003e\n\u003cp\u003e“Just follow the route the Castellan sent us,” Maria answered. Out of the corner of her eye, Denman looked stoic, but she could see that his hand was trembling. She pressed a palm to her neck and felt moist flesh and a slow, steady throb of a pulse. On impulse, she positioned her own feed on her screen and studied her face. Her eyes were vivid and dark again. The murkiness was gone.\u003c/p\u003e\n\u003cp\u003e“This is incredible,” Denman whispered as he finished his scan and studied the readings.\u003c/p\u003e\n\u003cp\u003e“I don’t have time for this right now,” Maria said in hushed tones.\u003c/p\u003e\n\u003cp\u003eDenman leaned toward her, his exhaled breath tickling her ear. “You’re alive, Vanguard.”\u003c/p\u003e\n\u003cp\u003eFear pierced her freshly-beating heart. If she was alive again, then that meant she was probably in more danger than anyone else on the squad. She swallowed hard and stared into Denman’s eyes.\u003c/p\u003e\n\u003cp\u003e“Is there a problem?” Dwayne’s voice asked.\u003c/p\u003e\n\u003cp\u003eMaria returned her attention to the screen before her. The commandant was hovering over Dwayne’s shoulder. “A minor problem that has been resolved, sir.” She gestured to Denman to return to his work station.\u003c/p\u003e\n\u003cp\u003eReluctantly, the medic did as he was ordered.\u003c/p\u003e\n\u003cp\u003eThere was no time to contemplate what was happening within the cells of her body. She was on a mission to save Chief Omondi and his squad and that had to be her priority. Lowering her hand out of view of the camera, she flipped on her armor’s cooling system. She was relieved when it activated. The Boon armor was not standard issue. They had been stripped of some of the systems unnecessary to the Boon.\u003c/p\u003e\n\u003cp\u003e“That Scrag horde is moving in fast, sir,” Cormier said worriedly.\u003c/p\u003e\n\u003cp\u003e“I’m watching them. Maintain top speed and we should bypass them.”\u003c/p\u003e\n\u003cp\u003e“Aircraft is almost to the rendezvous spot,” Dwayne said in the corner of her screen. “It has pulled off a good chunk of Scrags from the wall.”\u003c/p\u003e\n\u003cp\u003eMaria watched the fresh information fill her screen and then swore. “It’s going to make our loop around difficult with them coming in from that angle.”\u003c/p\u003e\n\u003cp\u003e“The tiltrotor will fire at the horde coming from the wall. You just concentrate on evading the one coming from behind.”\u003c/p\u003e\n\u003cp\u003eShe could see the concern in his eyes and the tightening around his mouth. He was apprehensive and so was she.\u003c/p\u003e\n\u003cp\u003eThe images on her screen were growing more and more worrisome as the surge of Scourge continued toward the carrier. Omondi and his people had cleared a lot of the area, but they had been concentrating on clearing a way to the hydroelectric station, not eliminating all the pockets of the Scourge. They had left quite a few clusters with high numbers for Maria’s squad to deal with.\u003c/p\u003e\n\u003cp\u003e“I’m going to have to slow down slightly,” Cormier called out. “I have debris in the road and we don’t need to pop a tread.”\u003c/p\u003e\n\u003cp\u003e“Keep an eye on that horde,” Maria ordered. “We’ll have to risk our treads if we’re going to outrun them.”\u003c/p\u003e\n\u003cp\u003e“This parade is getting bigger,” Holm’s voice said. “We’re picking up a lot more now. Should I blast them?”\u003c/p\u003e\n\u003cp\u003eDwayne and the commandant were deep in a muted conversation. Maria frowned then sighed. “Do it. Contained bursts. We want to get some distance on them, not set the whole area on fire.”\u003c/p\u003e\n\u003cp\u003eThe footage from Holm’s helmet was perturbing. The carrier didn’t exceed fifty-five kilometers per hour. The Scourge were terrifyingly-quick on their feet. A human being could in theory run nearly as fast as the carrier, but would never be able to sustain the pace or the speed. The ISPV eliminated the physical barriers. The Scourge were closing in as Cormier slowed the carrier.\u003c/p\u003e\n\u003cp\u003e“Cormier, I need you to accelerate or we’re going to have a serious problem on our hands in just a few minutes,” Maria barked.\u003c/p\u003e\n\u003cp\u003eThe squad had fallen silent as the tension began to rise. A few were craning their heads to peer out the windshield or view Maria’s screens. The Scourge rushing in from the east was a growing tidal wave of dead flesh that was about to crash onto the path before them.\u003c/p\u003e\n\u003cp\u003e“I have a barbecue back here, but they just keep coming,” Holm’s voice said in Maria’s ear.\u003c/p\u003e\n\u003cp\u003e“Continue with short bursts. Keep them off of us.”\u003c/p\u003e\n\u003cp\u003eThe Scourge set aflame were quickly consumed and fell away, but they were being just as swiftly replaced with fresh bodies.\u003c/p\u003e\n\u003cp\u003e“You’re going to cut this really close, Vanguard,” Dwayne’s voice said as he came back online.\u003c/p\u003e\n\u003cp\u003e“We had some debris in our path.” Maria ran another scan of the road, then keyed in a new path to Cormier. “We’re going to have to off-road it to reach the drop zone.” She deliberately ignored the pack of Scourge that had followed the aircraft toward the rendezvous site.\u003c/p\u003e\n\u003cp\u003eThe carrier bounced off the road and barreled through a gnarled field. It slowed fractionally, allowing a few Scourge close enough to touch the carrier. Maria hit her feed to Holm seconds before Holm opened fire with the flamethrower.\u003c/p\u003e\n\u003cp\u003e“Holm, hold your fire!” Maria shouted.\u003c/p\u003e\n\u003cp\u003eThe weedy field sprang to life, flames sweeping outward from the carrier, setting the world ablaze.\u003c/p\u003e\n\u003cp\u003e“Fuck!”\u003c/p\u003e\n\u003cp\u003e“Report in, Vanguard!” Dwayne’s voice was pure steel.\u003c/p\u003e\n\u003cp\u003e“We have a situation on our hands. We have a brushfire.”\u003c/p\u003e\n\u003cp\u003eMaria watched in horror as the flames spread through the cleared field, burning high and bright. In her ear bud she could hear Holm and McKinney screaming. The flames licked across the surface of the carrier as a claxon rang out. There was a mad scramble behind her as Holm and McKinney dropped through the hatch, their hair on fire. Denman doused them with a fire extinguisher as Cormier activated the carrier fire controls.\u003c/p\u003e\n\u003cp\u003e“Did you disengage the flamethrowers?” Maria shouted the two scorched soldiers lying on the floor.\u003c/p\u003e\n\u003cp\u003eA massive explosion rocked the carrier. The safety straps pressed hard into her armor, making Maria gasp, and the carrier shimmied. Cormier’s inventive swearing filled the carrier as she fought for control of the vehicle.\u003c/p\u003e\n\u003cp\u003e“That was behind the carrier,” Cormier shouted. “It wasn’t us!”\u003c/p\u003e\n\u003cp\u003eSwiveling her chair about, Maria saw Holm holding up her thumb. Unable to talk through her burned lips, the soldier tried to smile.\u003c/p\u003e\n\u003cp\u003e“Good job, Holm.” Maria gave the woman a quick salute.\u003c/p\u003e\n\u003cp\u003eCrouching over the wounded, Denman was already spreading salve on their blistered faces and heads as the other squad members helped them out of their burning armor. The stink of scorched flesh was nauseating.\u003c/p\u003e\n\u003cp\u003e“The fire is diverting that horde,” Dwayne said in a calmer voice.\u003c/p\u003e\n\u003cp\u003e“I have two soldiers with grievous wounds.” Maria could now see the tiltrotor hovering above the road.\u003c/p\u003e\n\u003cp\u003e“I can keep going,” McKinney choked out. “It doesn’t hurt...much. Not being able to feel much is really nice right now.”\u003c/p\u003e\n\u003cp\u003e“Requesting a med-pod for both of them,” Maria continued.\u003c/p\u003e\n\u003cp\u003eShe almost swore when Dwayne’s feed was muted and she could see Mr. Petersen and Commandant Pierce arguing furiously behind him.\u003c/p\u003e\n\u003cp\u003e“I’ll be fine,” McKinney protested. “Ebba just can’t talk. No big loss there.”\u003c/p\u003e\n\u003cp\u003eHolm hit him in the stomach with her fist as Denman continued to treat her badly burned face.\u003c/p\u003e\n\u003cp\u003e“Mikado, Cruz, get ready,” Maria ordered.\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” they chorused. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-58.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
