{"id":104040,"no":68,"title":"Page 68","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“And did you?” Lindsey spat out. “Did you find your fucking cure?”\u003c/p\u003e\n\u003cp\u003eDr. Curran began to laugh, hysteria edging the sound. “I never had to find a cure!”\u003c/p\u003e\n\u003cp\u003eDwayne gripped the armrests, leaning down to gaze into her face, his anger barely held in check. “You’re allowing them to die!”\u003c/p\u003e\n\u003cp\u003e“That’s not what I mean!” Dr. Curran waved her pad at them. “I received some very important intel today that no one but I has seen. The SWD doesn’t possess this information, not that it would change anything.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about, you stupid bitch?” Lindsey shouted.\u003c/p\u003e\n\u003cp\u003e“Stand down, Rooney,” Commandant Pierce ordered, her expression curious.\u003c/p\u003e\n\u003cp\u003eDwayne glared at the scientist. “Make yourself clear. Now.”\u003c/p\u003e\n\u003cp\u003e“The modified virus I gave the Inferi Boon was the closest we had to the original virus.”\u003c/p\u003e\n\u003cp\u003e“Original virus?” Commandant Pierce arched her eyebrows. “The Inferi Scourge Plague Virus?”\u003c/p\u003e\n\u003cp\u003e“No, no.” Dr. Curran poked Dwayne in the chest. “Get out of my face and I’ll tell you.”\u003c/p\u003e\n\u003cp\u003eDwayne complied. It was probably the best idea because he was close to losing his temper. He tried to estimate how much time he might possibly have to start a public groundswell to bring the Inferi Boon back into the city. It would probably take them another few days to completely clear the valley after they killed the Anomalies.\u003c/p\u003e\n\u003cp\u003e“The original virus was a gift. We, humanity, didn’t realize it at the time. A gift that landed in the ocean and every nation on earth raced to discover what had fallen from the heavens and still remained visible on satellite and radar.”\u003c/p\u003e\n\u003cp\u003e“You’re talking about extraterrestrial?” Lindsey said in a dubious tone.\u003c/p\u003e\n\u003cp\u003eDr. Curran nodded. “Oh, yes. It was. What was discovered in international waters was a capsule that contained several strange containers. One had the most beautiful fabric ever seen by human eyes. The others contained mineral specimens. And one contained vials of the virus.” Dr. Curran sighed. “The original virus.”\u003c/p\u003e\n\u003cp\u003e“I don’t remember any of this from history,” Petra said in a cross tone. “I don’t believe it.”\u003c/p\u003e\n\u003cp\u003e“Well, for once the nations of the earth cooperated in keeping humanity in the dark about what had been discovered. The Unified Nations of Earth Council determined that since there was no message within the capsule, we had to regard it as a possible weapon. The virus and other objects were secured at the Unified Nations of Earth Disease Control Laboratory. It wasn’t until nearly a decade later that it was discovered that the virus samples had been stolen one by one over the years. The Inferi Scourge Plague Virus appeared soon after. The virus I used to create the Inferi Boon was recovered from the laboratory of the United Eastern Seaboard States of America. According to the data recovered alongside the virus, it had only been modified slightly.”\u003c/p\u003e\n\u003cp\u003e“What is your point?” Lindsey shouted at her.\u003c/p\u003e\n\u003cp\u003e“My point, little girl, is that we were idiots!” Dr. Curran stood up and held out her pad. “We were fools! We began altering and experimenting with the virus before we even knew what it was meant to do!”\u003c/p\u003e\n\u003cp\u003e“There wasn’t a message. You said so!” Lindsey’s face flushed red beneath her blond hair.\u003c/p\u003e\n\u003cp\u003e“There was a message, wasn’t there?” Commandant Pierce said in a soft, dangerous voice.\u003c/p\u003e\n\u003cp\u003e“The fabric...scientists didn’t realize until much later, when it was far too late, that it was the fabric that held the message. The actual weave itself was a language. The virus was a gift. Immortality, perfect health. The minerals, building blocks for utopia. Somewhere, out there, we have benefactors.” Dr. Curran sighed wistfully. “Though if they have been watching for the last one hundred years, I’m sure they regret their gift. By the time we understood what the virus was for it was too late. No pure sample of the virus remained, and the Inferi Scourge were nearly done finishing us off.”\u003c/p\u003e\n\u003cp\u003e“The virus you gave the Inferi Boon was not altered as much, so what does that mean?” Caitlyn asked.\u003c/p\u003e\n\u003cp\u003e“It means that the virus is doing what it was originally intended to do. It’s restoring the Inferi Boon slowly back to life. I’ve been keeping close tabs on Maria Martinez without the SWD’s knowledge. No, I didn’t trust them either. The virus is restoring her, healing her. Already I have seen some dramatic changes in her scans that she may not even be aware of yet.”\u003c/p\u003e\n\u003cp\u003e“What does that mean for the rest of us?” Petra asked, her hand pressed to her breast. “We’re going to be immortal?”\u003c/p\u003e\n\u003cp\u003e“The last of the virus is in the Inferi Boon. Out there.” Dr. Curran waved her hand. “Everything was destroyed once they were dispatched. All samples of the virus were eliminated. Gone. This was our last ditch effort in every way. If the Inferi Boon failed, we’d all die anyway.”\u003c/p\u003e\n\u003cp\u003e“Immortality is in Maria’s veins and the SWD don’t even know it,” Lindsey said in awe.\u003c/p\u003e\n\u003cp\u003e“No. They don’t. I didn’t even realize it until today. And now it’s too late,” Dr. Curran said with a heavy sigh.\u003c/p\u003e\n\u003cp\u003e“We must have a few days until they clear the valley. If we compile all the information we have and release it to the news media, we can undermine the SWD,” Dwayne said. The passion in his voice revealed that his control had slipped and he struggled to regain it.\u003c/p\u003e\n\u003cp\u003e“Maybe,” Dr. Curran said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“I’ll start right away.” Lindsey snatched her pad back from the still stunned Petra.\u003c/p\u003e\n\u003cp\u003e“It’s already too late,” Caitlyn said softly. “They’re going to wipe out the Inferi Boon today. That was what I was going to tell you. They may already be dead.”\u003c/p\u003e\n\u003cp\u003e“That’s why they sent us out of the command center!” Commandant Pierce’s fury was tangible. “Of course!”\u003c/p\u003e\n\u003cp\u003eDwayne felt his anger fade away into an almost paralyzing numbness. All hope of saving Maria was fading fast.\u003c/p\u003e\n\u003cp\u003e“Her wristlet!” Lindsey shouted at Dwayne! “Call her!”\u003c/p\u003e\n\u003cp\u003eWith trembling fingers, he activated the secret program, praying that he wasn’t too late.\u003c/p\u003e\n\u003cp\u003eChapter 33\u003c/p\u003e\n\u003cp\u003eMaria cleaned the dagger on her armor, her eyes on the approaching tiltrotor. Shoving the blade into the sheath on her armor, she stood with her feet apart to steady herself. She felt slightly lightheaded from the blows Stillson had administered, but the pain he had inflicted was quickly receding.\u003c/p\u003e\n\u003cp\u003eDenman stood beside her, his hand on her shoulder. “We’re almost out of here.”\u003c/p\u003e\n\u003cp\u003eTears pricked at her eyes. Thoughts of Dwayne filled her mind and she longed to feel his arms around her. She wondered how long it would take for the Boon to be returned to life.\u003c/p\u003e\n\u003cp\u003e“I have to admit,” Omondi said in a raspy voice, “that I felt they had abandoned us. But when you came to rescue us with the SWD’s blessing, I knew I was wrong.”\u003c/p\u003e\n\u003cp\u003eThe Boon drew together, some limping, others being carried. Out of the forty that had started together, Maria was horrified to see only ten remained.\u003c/p\u003e\n\u003cp\u003eMcKinney held up both Holm and Cruz, his big boyish face in a grin. “I’m going to get shitfaced the second I’m alive,” he decided.\u003c/p\u003e\n\u003cp\u003eCruz’s tiny frame sank to the ground. Sobs without tears rocked her as she clutched her hands prayerfully before her. “We can’t even bury our dead.”\u003c/p\u003e\n\u003cp\u003eMaria knew she was speaking of Mikado and she reached out to touch the smaller woman’s head gently.\u003c/p\u003e\n\u003cp\u003eCruz gazed up at Maria and whispered, “But it was worth it, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Maria assured her. “It was worth it. We saved humanity.”\u003c/p\u003e\n\u003cp\u003e“We’re heroes,” McKinney declared, relishing the word. “We’re fucking heroes. I want a statue. A big one.”\u003c/p\u003e\n\u003cp\u003eOmondi laughed despite everything. “Well, you deserve it. We all do. Especially our fallen.”\u003c/p\u003e\n\u003cp\u003eHolm tried to speak, but what emerged from her mouth were barely words or sounds. But Maria could make out the gist of it. She had said Cormier’s name.\u003c/p\u003e\n\u003cp\u003e“Gather around,” Omondi ordered, digging into his pack. He withdrew small flares and struck them against the ground. They lit up as he formed a circle around the remaining survivors of the Inferi Boon Special Ops.\u003c/p\u003e\n\u003cp\u003eMaria’s wristlet buzzed against her skin. It wasn’t the jolt sent to activate her nervous system, but the buzz to indicate Dwayne’s call was coming in. Startled, she gazed at the wristlet in confusion. It buzzed again, an urgent sensation against her battered flesh.\u003c/p\u003e\n\u003cp\u003eNo one around her seemed to notice. They were all staring intently at the fleet of tiltrotors whirling over the approaching Inferi Scourge. There was a flash from the lead aircraft and then the earth below it was on fire, the Scourge caught in an inferno. The Boon cheered. More flashes from the other tiltrotors were followed by a conflagration on the ground.\u003c/p\u003e\n\u003cp\u003eMaria’s wristlet kept buzzing. Unsure of what to do, she glanced over her shoulder. The carrier loomed nearby. She hesitated, but a quick look at the squad told her they were too busy watching the beautiful sight of the tiltrotors destroying the mob of Scourge heading their way.\u003c/p\u003e\n\u003cp\u003eAs quietly as possible and trying not to draw attention, Maria hurried toward the carrier. She heard footfalls and cast a quick look over her shoulder to see Denman tailing her with curiosity in his eyes. Ducking around the carrier, she activated the secret program. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-68.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
