{"id":104043,"no":71,"title":"Page 71","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I just hope you don’t get yourself killed,” she said with a sigh.\u003c/p\u003e\n\u003cp\u003e“I’ll get Maria and Denman back in here safe and sound,” Dwayne promised.\u003c/p\u003e\n\u003cp\u003ePetra stared at him for a long moment, then said, “Chances are you won’t. But if anyone can pull this off, you can.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the vote of confidence.” Dwayne dragged the bags to one side of the room and opened them to examine their contents.\u003c/p\u003e\n\u003cp\u003e“Dad, I just got a call. I have to go. They expect me down at the capital.” Caitlyn drew near, running her hands over her blond hair to smooth it.\u003c/p\u003e\n\u003cp\u003eStanding, Dwayne gave his daughter a firm hug. “Take care.”\u003c/p\u003e\n\u003cp\u003e“Don’t die, Dad,” Caitlyn whispered into his shoulder.\u003c/p\u003e\n\u003cp\u003e“I won’t give your mother that satisfaction,” Dwayne said with a wink.\u003c/p\u003e\n\u003cp\u003eCaitlyn laughed. “You’re the best, Dad. I know I don’t tell you enough. But you are.”\u003c/p\u003e\n\u003cp\u003eTouched, Dwayne squeezed her shoulder. “I love you, Caitlyn. And you’ve been a pain in my ass more times than I can count, but I couldn’t be prouder of the woman you’ve become.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Dad.” She pressed a kiss to his cheek then hurried out of the room.\u003c/p\u003e\n\u003cp\u003eDwayne scanned the small room with its banks of work stations. All the vid screens save the ones Petra, Dr. Curran, and Lindsey and Vaja were working on showed the massive crowds descending on the capital. Most of the Constabulary and a big chunk of the SWD security would be occupied taking care of the crowds. He had to move fast to have any chance of saving Maria and Denman.\u003c/p\u003e\n\u003cp\u003eRifling through the bags, he began to organize his armor, weapons, and supplies. He was busy checking the systems on the armor when Dr. Curran’s high heels appeared in his vision. Looking up, he saw her pinched face staring down at him.\u003c/p\u003e\n\u003cp\u003e“Can we speak?”\u003c/p\u003e\n\u003cp\u003e“Certainly.”\u003c/p\u003e\n\u003cp\u003eRising, he stared at her curiously before leading her into the commandant’s ready room. Fresh coffee was bubbling in a pot and heated containers of food waited for the commandant and her staff whenever they were able to get a break. As the door shut behind them, Dwayne and Dr. Curran sat at the small conference table in one corner of the room.\u003c/p\u003e\n\u003cp\u003e“I lied to you,” Dr. Curran said in her point-blank way of speaking.\u003c/p\u003e\n\u003cp\u003eDwayne squinted at her, confused. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“In the SWD it’s very competitive among the scientists. Everyone has been trying to find a cure to the Inferi Scourge Plague. Ever since this city was created, the SWD has tried to find a way out of this horrific mess we’ve made for ourselves. My whole life I dreamed of finding that solution. I never modified the virus I told you I used. It was a small sample, lost in the massive cold storage vaults. That is the one I used on Maria Martinez. The virus administered to the other members of the squad was modified from the one used in the failed attempts.”\u003c/p\u003e\n\u003cp\u003e“What are you saying?”\u003c/p\u003e\n\u003cp\u003e“Denman can’t come back into the city. He will turn into an Anomaly. And Maria can’t return because she has immortality in her veins.” Dr. Curran sighed, rubbing her eyes. “You can’t go out there, risk your life, and bring them back. They both need to die out there. I suppose, ironically, the SWD is right.”\u003c/p\u003e\n\u003cp\u003e“If Maria is the solution to mortality, she should come back into the city!” Dwayne protested.\u003c/p\u003e\n\u003cp\u003e“Why? So another SWD scientist can figure out how she returned to life? I’ve been reviewing my data. I can fool some people with it, but it won’t take long for someone in the SWD to realize that something is amiss. And once they see Maria on the news vids, alive, what do you think will happen?” Dr. Curran stared at him pointedly.\u003c/p\u003e\n\u003cp\u003e“They’ll isolate her. Test her. Maybe if we discover a way to mass infect—”\u003c/p\u003e\n\u003cp\u003e“I am assuming that she is immortal. I don’t know for certain. My data is preliminary. She is back to life, but for how long?” Dr. Curran tapped her pad thoughtfully. Her eyes grew distant as she pondered the situation. “I may be jumping to conclusions, or hoping in vain. Something wonderful is happening to her, but I’m not truly certain of the end results. Maybe after you kill her you can bring me a sample of her tissue and blood.”\u003c/p\u003e\n\u003cp\u003eRegarding the scientist with cold anger, Dwayne didn’t speak. Dr. Curran was already scribbling away on her pad. Dwayne thought of all the lies that had been told from the very beginning. He was also haunted by Gideon, the man who had immediately turned into an Anomaly when given a modified version of the virus. Dr. Curran said the virus given to Maria was without modifications, but what did that mean? For Maria? For the city? Or maybe it was all a lie. Maybe Curran just wanted her handiwork dead and a new sample to work on.\u003c/p\u003e\n\u003cp\u003eDwayne closed his eyes, pressing his knuckles against his lids. “You said you modified it. You can create a cure.”\u003c/p\u003e\n\u003cp\u003e“I modified a virus that was already doomed to fail. I gave Maria the virus from the vault on a reckless whim.” Dr. Curran snorted. “Call it scientific curiosity or just plain stupidity. Neither can be brought into the city. They’re both unsafe.”\u003c/p\u003e\n\u003cp\u003eOpening his eyes, Dwayne fastened his fierce gaze on the woman. “You doomed them all.”\u003c/p\u003e\n\u003cp\u003e“I wanted to save them!” Dr. Curran insisted.\u003c/p\u003e\n\u003cp\u003e“You lied and doomed them. Denman has to die because you lied! Maria can’t come home because she’ll end up in the bowels of the SWD as an experiment because you’re not sure what she has truly become! You fucking lied, Dr. Curran, and people have lost their lives.”\u003c/p\u003e\n\u003cp\u003e“I thought there was hope when Jameson was infected with two different viruses, but he ended up going feral just like the others! I thought there was a chance that I would solve the Inferi Scourge problem and I had to take the risk!”\u003c/p\u003e\n\u003cp\u003eDwayne slammed his fist down on the table, making her jump.\u003c/p\u003e\n\u003cp\u003e“If you go out there, you must kill them both,” Dr. Curran insisted. “I don’t want this, but it’s the truth. I don’t have enough data and if you bring Maria back…”\u003c/p\u003e\n\u003cp\u003e“Maybe you just don’t want someone stealing your specimen!”\u003c/p\u003e\n\u003cp\u003e“Do you really believe the SWD will just roll over and die once the truth is revealed? Mr. Petersen is Black Ops. He planned all of this. Can’t you see that? Hell, Admiral Kirkpatrick is probably just his pawn. He probably has a way to escape prosecution just in case something does go wrong. He’s not going to let go of an asset like Maria once he ascertains what she is. You can’t trust him!”\u003c/p\u003e\n\u003cp\u003e“I can’t trust you!” Dwayne said in a voice close to a growl.\u003c/p\u003e\n\u003cp\u003e“I was wrong, but for all the right reasons. Mr. Petersen and even the president will use Maria for their own means. And if I’m wrong about her virus, then what?”\u003c/p\u003e\n\u003cp\u003eDwayne stared at her, resisting the urge to strike her. “I’m going out there.”\u003c/p\u003e\n\u003cp\u003e“You can’t bring them back! You can’t bring her back. You have to kill both of them.”\u003c/p\u003e\n\u003cp\u003eShaking his head, Dwayne stared at the woman incredulously. “You really don’t feel remorse for what you’ve done, do you?”\u003c/p\u003e\n\u003cp\u003e“She’s contagious.”\u003c/p\u003e\n\u003cp\u003e“With immortality. Or so you suspect.”\u003c/p\u003e\n\u003cp\u003e“She’s contagious, Castellan. Hell, if she kissed you, you would be infected!”\u003c/p\u003e\n\u003cp\u003eHe stared at her.\u003c/p\u003e\n\u003cp\u003e“You and I both know that even if I’m right in my suspicion about her virus, it will only serve the people in power, not the city.”\u003c/p\u003e\n\u003cp\u003eDwayne leaned toward the doctor. “Tell me something, Doctor. If this virus gives you immortality, why did you kill her before administering it?”\u003c/p\u003e\n\u003cp\u003e“To see if it would bring her back...and it did.” Dr. Curran covered her face with her hand. “Ironically, I probably didn’t even have to kill her. I could have given her the virus and it still would have altered her. Probably faster.”\u003c/p\u003e\n\u003cp\u003e“Would she still have been able to walk among the Inferi Scourge?” Dwayne was weighing all she was telling him carefully.\u003c/p\u003e\n\u003cp\u003eThe doctor shrugged. “Maybe. Possibly. Probably. Who knows?”\u003c/p\u003e\n\u003cp\u003eRubbing his face, Dwayne tried to calm his chaotic thoughts. “So what you’re telling me is that you’re not sure that Maria coming into the city is even safe. Not just because you might be wrong, but because you might be right.”\u003c/p\u003e\n\u003cp\u003eDr. Curran pressed her thin lips together, then slightly nodded. “You have to kill them both. Bring me back a sample. Maybe…her legacy can be fulfilled after extensive testing. Maybe after the city has settled down and the coup is behind us, maybe then we would be able to explore the possibility of a virus that grants immortality when minds are rational and not rash.”\u003c/p\u003e\n\u003cp\u003eDwayne looked at her sharply. He suspected the scientist was insane, or worse. Conniving enough to hide the truth to forward her own secret agenda. But what was the truth? He was beginning to suspect that the immortality virus was a lie, too. Maybe Maria wasn’t as special as the doctor claimed. Maybe the doctor just wanted a sample of the Inferi Boon virus since all the others had been destroyed. So many maybes…so little truths.\u003c/p\u003e\n\u003cp\u003e“Keep this between us until I tell you otherwise.”\u003c/p\u003e\n\u003cp\u003e“You have to kill them both!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-71.html","bookId":2486,"creation":"Oct 5, 2019 10:35:06 PM","modification":"Oct 5, 2019 10:35:06 PM"}
