{"id":65149,"no":36,"title":"Page 36","content":"\u003cp\u003e“This isn’t wise.” Alistair could feel the ill will building in the air around them like a brewing tempest. Regmont was inebriated to the point of bravado and stupidity, and Michael was clearly spoiling for a fight.\u003c/p\u003e\n\u003cp\u003eLord Taylor, one of Regmont’s friends, stumbled backward. He bumped Michael, whose cheroot case and kerchief were dislodged from his hand. They fell to the floor, expensive cheroots rolling free of the opened case.\u003c/p\u003e\n\u003cp\u003e“Mind yourself!” Michael snapped, bending to retrieve his belongings.\u003c/p\u003e\n\u003cp\u003eRegmont made a cutting comment to Taylor, then crouched unsteadily to assist Michael. He picked up a cheroot, then the kerchief. He stilled, sobering as he examined the folded linen.\u003c/p\u003e\n\u003cp\u003eMichael held out his hand for it. “Thank you.”\u003c/p\u003e\n\u003cp\u003eThe earl’s thumb stroked over the letters embroidered into the corner. “Interesting monogram.”\u003c/p\u003e\n\u003cp\u003eAlistair looked closer, cursing silently at the unmistakable “H” stitched in red thread.\u003c/p\u003e\n\u003cp\u003e“If you would, please, Regmont,” Michael demanded.\u003c/p\u003e\n\u003cp\u003e“I don’t think I will.” Regmont met Michael’s gaze, then Alistair’s, before tucking the kerchief in his own pocket. “I believe this belongs to me.”\u003c/p\u003e\n\u003cp\u003eThe tension that gripped Michael was palpable. Alistair set his hand on his friend’s shoulder and squeezed a warning. The liquor on the earl’s breath was strong enough to be pervasive, and Alistair recognized the look of mayhem in his bloodshot eyes—the devil was riding Regmont hard, spurring him into a dangerous place.\u003c/p\u003e\n\u003cp\u003eMichael stood. “I want that back, Regmont.”\u003c/p\u003e\n\u003cp\u003e“Come and get it.”\u003c/p\u003e\n\u003cp\u003eMichael’s hands fisted. Remington stepped between the two men. The proprietor was tall and fit, perfectly capable of interceding physically, but he was also flanked by three liveried members of his staff. “You can take this downstairs, gentlemen,” he warned, diverting them to the pugilist rings below, “or you can take it elsewhere, but there will be no violence in here.”\u003c/p\u003e\n\u003cp\u003e“Or we can take it to the field,” Michael challenged. “Name your seconds, Regmont.”\u003c/p\u003e\n\u003cp\u003e“Bloody hell,” Alistair muttered.\u003c/p\u003e\n\u003cp\u003e“Taylor and Blackthorne.”\u003c/p\u003e\n\u003cp\u003eMichael nodded. “Baybury and Merrick will discuss the particulars with them tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I look forward to it,” Regmont said, baring his teeth in a semblance of a smile.\u003c/p\u003e\n\u003cp\u003e“Not nearly as much as I.”\u003c/p\u003e\n\u003cp\u003eChapter 25\u003c/p\u003e\n\u003cp\u003eMy dearest,\u003c/p\u003e\n\u003cp\u003eI confess, I have thought of you all day, in ways I am certain you would enjoy. I pray that you are looking after yourself.\u003c/p\u003e\n\u003cp\u003eAcheron growled from his pillow by Jess’s feet. She paused with the quill suspended above the parchment, then she leaned over to frown down at the tiny pug.\u003c/p\u003e\n\u003cp\u003e“What troubles you?”\u003c/p\u003e\n\u003cp\u003eHe repeated the small sound of disapproval, then bounded to the door leading to the gallery. There, he jumped and spun in circles. As Jess fetched her shawl to take him outside to relieve himself, his ears lay back against his head and he growled again. Then he whimpered pitifully and piddled on the hardwood before she reached him.\u003c/p\u003e\n\u003cp\u003e“Acheron.” Her tone was soft with resignation. The pug whined in response.\u003c/p\u003e\n\u003cp\u003eJess collected a towel from the washstand in the corner and moved to the door. As she neared, she heard a masculine voice raised in anger. She dropped the towel on the tiny puddle and turned the knob. The sound of shouting became clearer without the solid wood barrier, and its source became recognizable—Hester’s rooms.\u003c/p\u003e\n\u003cp\u003e“No wonder you’re upset,” she murmured to Acheron, tossing her shawl on a nearby chair. “Stay here.”\u003c/p\u003e\n\u003cp\u003eShe strode swiftly down the hallway. Regmont’s voice grew louder with every step. Her stomach knotted and her palms grew damp. As familiar fear set in, she fought to breathe in an even cadence.\u003c/p\u003e\n\u003cp\u003e“You’ve humiliated me! All these weeks … the match with Tarley … I will not be cuckolded!”\u003c/p\u003e\n\u003cp\u003eHester’s low replies were indecipherable, but the rapid delivery suggested anger … or panic. When a crash resounded, Jess lunged for the door and threw it open.\u003c/p\u003e\n\u003cp\u003eDear God …\u003c/p\u003e\n\u003cp\u003eHer sister stood in her night rail, her face blanched and lips white. Her eyes were huge in her face and filled with a terror Jess knew all too well. A new bruise was already darkening her temple.\u003c/p\u003e\n\u003cp\u003eRegmont’s back was to the door, his hands fisted at his sides. He was dressed for a night on the town, and he stank of liquor and tobacco. A side table had been overturned, and the decorative urn that graced it lay shattered on the floor. He began to advance. Jess shouted his name.\u003c/p\u003e\n\u003cp\u003eHe stilled, his back stiffening. “Get out, Lady Tarley. This is none of your concern.”\u003c/p\u003e\n\u003cp\u003e“I think you should be the one to depart, my lord,” she retorted, trembling. “Your wife is breeding and has orders from the doctor to abstain from any excitement.”\u003c/p\u003e\n\u003cp\u003e“Is it even mine?” he barked at Hester. “How many men have there been?”\u003c/p\u003e\n\u003cp\u003e“Go, Jess,” Hester pleaded. “Run.”\u003c/p\u003e\n\u003cp\u003eJess shook her head. “No.”\u003c/p\u003e\n\u003cp\u003e“You can’t always be the one who saves me!”\u003c/p\u003e\n\u003cp\u003e“Regmont.” Jess’s voice cracked like a whip. “Please leave.”\u003c/p\u003e\n\u003cp\u003eHe rounded on her then, and her heart stopped. His eyes were bloodshot and filled with the single-minded malevolence Hadley always displayed when determined to use his fists on someone who couldn’t fight back.\u003c/p\u003e\n\u003cp\u003e“This is my house!” he bellowed. “And you … you have come here with your harlot ways and attached scandal to my good name. Now your sister seeks to do the same. I won’t have it!”\u003c/p\u003e\n\u003cp\u003eJess’s ears filled with the sound of roaring blood, muffling his vitriol, but she understood his threat to teach her proper behavior. The room spun. She’d lived through this moment before. Heard those same words. So many times …\u003c/p\u003e\n\u003cp\u003eThe fear receded as swiftly as it had come, leaving an odd calm in its wake. She was not a frightened, lonely girl anymore. Alistair had shown her that she was stronger than she’d given herself credit for. And when he came for her, which he would do as soon as she could send for him, Regmont would pay for his actions this night.\u003c/p\u003e\n\u003cp\u003e“Hitting me,” she said, “would be the biggest mistake you will ever make in your life.”\u003c/p\u003e\n\u003cp\u003eHe laughed and drew his arm back.\u003c/p\u003e\n\u003cp\u003eMichael vaulted onto the back of his horse, then watched Alistair do the same. A raging feeling of helplessness goaded his agitation. He wanted his handkerchief back, damn it. He wanted Hester. And he wanted Regmont dead with a fervor that scared him.\u003c/p\u003e\n\u003cp\u003e“Say something!” he snapped at Alistair, who hadn’t spoken since he’d challenged Regmont.\u003c/p\u003e\n\u003cp\u003e“You’re an idiot.”\u003c/p\u003e\n\u003cp\u003e“Christ.”\u003c/p\u003e\n\u003cp\u003e“So you kill him in a duel. Then what?” Alistair spurred his mount away from Remington’s. “You avoid persecution by fleeing the country. Your family suffers without you. Hester hates you for taking her husband from her. Jessica becomes furious with me for being even remotely attached to this mess. Will you feel better then?”\u003c/p\u003e\n\u003cp\u003e“You’ve no notion of what this is like! How it feels to know she needs looking after and I cannot be the one to do it!”\u003c/p\u003e\n\u003cp\u003e“Don’t I?” Alistair asked softly, glancing aside at him.\u003c/p\u003e\n\u003cp\u003e“No. You do not. Whatever envy you may have harbored for my brother’s good fortune, you at least knew he cared for Jessica and saw to her comfort. He made her happy. You did not have to wonder at every minute of every day if he was raising his hand to her. If she was terrified or hurt or—”\u003c/p\u003e\n\u003cp\u003eAlistair yanked so hard on his reins that his horse reared up with a whinny of protest. The clap of hooves to cobblestone was like a thundercrack in the darkness. The gelding pranced in agitation, turning completely around. “What did you say?”\u003c/p\u003e\n\u003cp\u003e“He beats her. I know he does. From things I’ve observed, and things my mother has observed as well.”\u003c/p\u003e\n\u003cp\u003e“Damn you.” The fury in Alistair’s tone was unmistakable. “And you allowed him to leave? What if he’s at home now?”\u003c/p\u003e\n\u003cp\u003eMichael’s own wrath boiled over. “What can I do? She is his wife. I have no recourse.”\u003c/p\u003e\n\u003cp\u003e“Jessica is there! And her greatest terror is a man’s rage.”\u003c/p\u003e\n\u003cp\u003e“What the devil—?”\u003c/p\u003e\n\u003cp\u003e“Hadley was abusive,” Alistair bit out, pulling his horse around. “He punished the girls as liberally and as painfully as possible.”\u003c/p\u003e\n\u003cp\u003eMichael’s gut twisted. “Jesus.”\u003c/p\u003e\n\u003cp\u003eAlistair kicked his mount into a gallop, bending low over the horse’s arched neck and weaving recklessly through the busy streets. Michael followed close behind him.\u003c/p\u003e\n\u003cp\u003eJess watched Regmont’s arm draw back and steeled herself for the blow, refusing to cower.\u003c/p\u003e\n\u003cp\u003eBut before it came, a sickening thud reverberated through the room. She watched, astonished and confused, as Regmont’s eyes rolled back into his head. He crumpled to the floor in a boneless heap.\u003c/p\u003e\n\u003cp\u003eStartled, she stumbled back. Blood seeped through his blond hair and glistened in the candlelight. A harsh clattering drew Jess’s gaze to the fireplace poker rattling on the floor … dropped from Hester’s lax hand.\u003c/p\u003e\n\u003cp\u003e“Jess …”\u003c/p\u003e\n\u003cp\u003eHer gaze lifted. Her sister doubled over with a sharp cry of pain. There was blood at Hester’s feet, coursing down her legs, rapidly forming a spreading pool. No …\u003c/p\u003e\n\u003cp\u003ePounding footsteps approached. “Jessica!”\u003c/p\u003e\n\u003cp\u003eShe called out to him as she leaped over Regmont toward Hester.\u003c/p\u003e\n\u003cp\u003eAlistair appeared, followed directly by Michael. Both men skid to a halt at Regmont’s body. Jessica caught Hester just as her sister’s knees gave out. Together, they sank to the floor.\u003c/p\u003e\n\u003cp\u003e“Is he dead?” Jess asked as she paced the length of the downstairs parlor. Acheron sprawled beneath the table between the settees, whining softly.\u003c/p\u003e\n\u003cp\u003e“No.” Alistair came to her, bearing a glass of brandy. “Here. Drink this.”\u003c/p\u003e\n\u003cp\u003eShe looked at the amber liquid longingly, wanting the soothing oblivion of liquor with a ferocity that was nearly undeniable. Her throat was dry and her hands unsteady, symptoms she knew would be alleviated by one small drink, but she found the will to shake her head. She wasn’t going backward. The past was behind her. After tonight, she was newly determined to leave it there.\u003c/p\u003e\n\u003cp\u003eHer gaze roamed the room. The cheery yellow décor seemed absurd considering the state of the couple who laid claim to it.\u003c/p\u003e\n\u003cp\u003e“She brained him with the poker,” she murmured, still trying to grasp the enormity of what had transpired and how blind she’d been to the signs of abuse\u003c/p\u003e\n\u003cp\u003e“Good,” Michael said with vehemence.\u003c/p\u003e\n\u003cp\u003eAlistair set the brandy down and came up behind her. He caught her shoulders with his large hands, massaging the painfully tight muscles. “The doctor is seeing to your sister first, but he says Regmont will need stitches.”\u003c/p\u003e\n\u003cp\u003eJess’s heart broke. “She was despondent before. Now that she’s lost the baby …”\u003c/p\u003e\n\u003cp\u003eMichael snatched the brandy from the table and tossed it back in one swallow. His hair was a mess from the relentless raking of his fingers, and his dark eyes were haunted.\u003c/p\u003e\n\u003cp\u003eFinally, Jess saw the love he harbored for her sister. Guilt ate at her like acid. She had steered Hester toward Regmont all the while a man worthy of her was right beneath their noses.\u003c/p\u003e\n\u003cp\u003eShe looked over her shoulder at Alistair. “After we are wed, I would like Hester to stay with us for whatever time she needs. I don’t think she should remain in this house any longer than necessary.”\u003c/p\u003e\n\u003cp\u003e“Of course.” His beautiful eyes were soft and filled with sympathy and love.\u003c/p\u003e\n\u003cp\u003eShe breathed him in, absorbing the soothing scent of sandalwood and musk with that invigorating hint of verbena. She set her hands over his, grateful for him in so many ways. He anchored her in the midst of chaos, giving her the strength she needed to do the same for Hester.\u003c/p\u003e\n\u003cp\u003e“In the interim,” Michael said, “you should both reside with me. You have lived in the house longer than I have, Jessica, and the servants are well versed in your needs. It will be familiar to Hester. And my mother is there for now. She can be a great help, too.”\u003c/p\u003e\n\u003cp\u003eThe report of a pistol broke the silence, followed by a bloodcurdling scream. Jess’s stomach lurched. She was running toward the stairs before she knew what she was about. Michael passed her on the first landing, but Alistair stayed with her, catching her arm just before they reached Hester’s room.\u003c/p\u003e\n\u003cp\u003eDr. Lyon stood in the gallery, grim faced. He pointed at Hester’s door in front of him. “His lordship went in and threw the latch.”\u003c/p\u003e\n\u003cp\u003eOn the other side of the door, Hester was still screaming.\u003c/p\u003e\n\u003cp\u003ePanic stole the strength from Jess’s knees, but Alistair held her up. Michael gripped the doorknob and rammed into the paneled wood with his shoulder. The frame creaked in protest, but the lock held fast.\u003c/p\u003e\n\u003cp\u003eThe doctor spoke in a rush, his volume rising with every word. “He was unconscious in his bedchamber when I began the stitching. Then he woke … became enraged … asked after Lady Regmont. I told him to lower his voice, to calm himself. I explained his wife was resting after losing the babe. He went mad … ran from the room … I tried to follow, but—”\u003c/p\u003e\n\u003cp\u003eMichael rammed into the door again. The doorjamb cracked, but did not give way. Alistair joined him. Together they kicked the portal in unison, and it flew open with a thunderous crack. They rushed inside, followed by the doctor. Jess was swift on their heels, but Alistair pivoted agilely and caught her by the waist, carrying her back out to the gallery.\u003c/p\u003e\n\u003cp\u003e“Don’t go in there,” he ordered.\u003c/p\u003e\n\u003cp\u003e“Hester!” she shouted, struggling to look over his shoulder.\u003c/p\u003e\n\u003cp\u003eHe clutched her trembling body close and held tight. “It was Regmont.”\u003c/p\u003e\n\u003cp\u003eAs the possibilities sank in, Jess felt all the warmth leave her limbs. “Dear God. Hester.”\u003c/p\u003e\n\u003cp\u003eHester curled against Jessica’s side and held on tightly. Cocooned in the counterpane of Jess’s bed in the guest room, she was still so cold.\u003c/p\u003e\n\u003cp\u003eJess’s hand stroked over her head while whispering soft words of comfort. It seemed almost as if they were children again and Jess was providing the sense of safety and love Hester had only ever felt with her. \u003c/p\u003e","sourceLink":"https://allnovel.net/seven-years-to-sin-historical-1/page-36.html","bookId":2663,"creation":"Oct 5, 2019 9:56:56 AM","modification":"Oct 5, 2019 9:56:56 AM"}
