{"id":85488,"no":11,"title":"Page 11","content":"\u003cp\u003eIt was inconceivable to me. If I couldn’t have Eva, I would have no one.\u003c/p\u003e\n\u003cp\u003eHer shoulders went back. Her chin lifted. Then a smile curved her mouth. I could see the acceptance settle over her, a new kind of peace. Whatever she’d needed, she had found it.\u003c/p\u003e\n\u003cp\u003eEva passed by without spotting me, but Raúl joined me.\u003c/p\u003e\n\u003cp\u003e“Awkward,” he said, his attention on Kline as the singer looked up and spotted my wife, his body visibly stiffening.\u003c/p\u003e\n\u003cp\u003e“Perfect,” I replied, as my wife greeted Kline by extending her left hand to him. My ring on her finger sparkled brilliantly, impossible to miss. “Keep me posted.”\u003c/p\u003e\n\u003cp\u003eI left.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eAS my muscles burned through my eightieth push-up, my gaze was on the flash drive lying on the carpet in front of me. The way I’d dealt with Yimara and Kline had been effective but unsatisfying. I was still tense and aggravated, spoiling for a fight.\u003c/p\u003e\n\u003cp\u003eMy eyes stung as rivulets of sweat ran down my forehead. My chest heaved with exertion. Knowing Eva was out clubbing with Cary and some of their SoCal friends only sharpened the edge I hovered on. I knew how primed she got when out drinking and dancing. I loved nailing her when her body was damp and steamy with perspiration, her cunt slick and greedy.\u003c/p\u003e\n\u003cp\u003eJesus. My dick throbbed and hardened further. My arms trembled as I neared the point of muscle fatigue. Veins stood out in harsh relief along my forearms and hands. I needed a cold shower, but I wouldn’t get myself off. I always saved it for Eva. Every thick, creamy drop.\u003c/p\u003e\n\u003cp\u003eThe message app on my laptop pinged and I slowed the vicious pace, hitting one hundred before I pushed to my feet. I grabbed the flash drive and dropped it on the desk, then retrieved the towel I’d hung over the back of the chair. Wiping my face before opening the window on my laptop, I expected to read the latest update on Eva’s evening. What I saw was a text from her.\u003c/p\u003e\n\u003cp\u003eWhat room are you in?\u003c/p\u003e\n\u003cp\u003eI stared at the screen for a moment, processing the question. Another ping announced a text from Raúl: She’s heading toward your hotel.\u003c/p\u003e\n\u003cp\u003eAnticipation shifted my focus from working out to my delectable, clever wife. I typed a reply to her: 4269.\u003c/p\u003e\n\u003cp\u003eI reached for the phone on the desk and called room service. “A bottle of Cristal,” I ordered. “Two flutes, strawberries, and whipped cream. Have it here in ten. Thanks.”\u003c/p\u003e\n\u003cp\u003eReturning the receiver to its base, I slung the towel around the back of my neck. A quick glance at the clock told me it was half past two in the morning.\u003c/p\u003e\n\u003cp\u003eBy the time the doorbell chimed, I’d turned on all the lights in both the living room and bedroom and opened the curtains that had been blocking the view of the moonlit ocean.\u003c/p\u003e\n\u003cp\u003eI went to the door and opened it, finding both Eva and room service waiting. Dressed as I’d seen her earlier, Eva looked like a bad girl, renewing my hard-on in an instant. Her hair was limp and her face shiny, her mascara running slightly. She smelled like clean sweat and alcohol.\u003c/p\u003e\n\u003cp\u003eIf the server hadn’t been standing behind her, I would’ve had her on her back on the foyer tile before she knew what hit her.\u003c/p\u003e\n\u003cp\u003e“Holy fuck,” she breathed, eyeing me from head to toe.\u003c/p\u003e\n\u003cp\u003eI glanced down. I was still overheated, my skin shiny with sweat. The waistband of my sweats was wet with it, drawing attention to the erection I didn’t even try to will away. “Sorry, you caught me midworkout.”\u003c/p\u003e\n\u003cp\u003e“What are you doing in San Diego?” she demanded from the hallway.\u003c/p\u003e\n\u003cp\u003eStepping back, I gestured for her to come in.\u003c/p\u003e\n\u003cp\u003eShe didn’t move. “I’m not getting sucked into your sex-god vortex until you answer me.”\u003c/p\u003e\n\u003cp\u003e“I’m here on business.”\u003c/p\u003e\n\u003cp\u003e“Bullshit.” Her arms crossed.\u003c/p\u003e\n\u003cp\u003eReaching out, I caught her by the elbow and tugged her in. “I can prove it.”\u003c/p\u003e\n\u003cp\u003eRoom service rolled the cart in after her.\u003c/p\u003e\n\u003cp\u003e“You’re way too optimistic,” she muttered, looking at the order as I signed the receipt.\u003c/p\u003e\n\u003cp\u003eI handed the bill and stylus back, waited for the server to leave, then walked over to the phone by the sofa. I dialed Arash’s room.\u003c/p\u003e\n\u003cp\u003e“Are you serious?” he answered, sounding groggy. “Some of us sleep, Cross.”\u003c/p\u003e\n\u003cp\u003e“My wife wants to talk to you.”\u003c/p\u003e\n\u003cp\u003e“What?” Sheets rustled. “Where are you?”\u003c/p\u003e\n\u003cp\u003e“In my room.” I held the receiver out to Eva. “My attorney.”\u003c/p\u003e\n\u003cp\u003e“Are you nuts?” she asked. “It’s five in the morning in New York! On a Sunday!”\u003c/p\u003e\n\u003cp\u003e“He’s in the room next door. Take it. Ask him if I’ve been working today.”\u003c/p\u003e\n\u003cp\u003eShe marched over and snatched the phone out of my hand. “You should get a new job,” she told him. “Your boss is insane.”\u003c/p\u003e\n\u003cp\u003eHe replied and she sighed. “Before.” She glanced at me. “Thank God he’s hot. Still, I might get my head checked. Sorry he woke you up. Go back to sleep.”\u003c/p\u003e\n\u003cp\u003eEva held the phone out to me.\u003c/p\u003e\n\u003cp\u003eI took it and put it to my ear. “As she said, go back to sleep.”\u003c/p\u003e\n\u003cp\u003e“I like her. She gives you shit.”\u003c/p\u003e\n\u003cp\u003eMy gaze slid over her. “I like her, too. Good night.”\u003c/p\u003e\n\u003cp\u003eI hung up and reached for her.\u003c/p\u003e\n\u003cp\u003eShe backed up, avoiding my grasp. “Why didn’t you tell me you were here?”\u003c/p\u003e\n\u003cp\u003e“Didn’t want to cramp your style.”\u003c/p\u003e\n\u003cp\u003e“Don’t you trust me?”\u003c/p\u003e\n\u003cp\u003eMy brows rose. “Asks the wife who tracked my phone to my hotel.”\u003c/p\u003e\n\u003cp\u003e“I was just curious if you were staying in the penthouse or not!”\u003c/p\u003e\n\u003cp\u003eShe pouted when I only continued to eye her. “And . . . I missed you.”\u003c/p\u003e\n\u003cp\u003e“I’m right here, angel.” I opened my arms to her. “Come and get me.”\u003c/p\u003e\n\u003cp\u003eHer nose wrinkled. “I have to shower. I stink.”\u003c/p\u003e\n\u003cp\u003e“We’re both sweaty.” I went to her. This time, she didn’t pull away. “And I love the way you smell. You know that.”\u003c/p\u003e\n\u003cp\u003eI put my hands on her waist, sliding them up until I hugged her delicate rib cage just beneath the full swell of her tits. I cupped them through her top, gently hefting their weight, squeezing softly.\u003c/p\u003e\n\u003cp\u003eI’d never had a fetish for particular parts of the female body, until Eva. I worshipped every inch of her, cherished all of her generous curves.\u003c/p\u003e\n\u003cp\u003eThe pads of my thumbs circled her nipples, feeling them harden. “I love the way you feel.”\u003c/p\u003e\n\u003cp\u003eLowering my head, I found the crook of her neck and nuzzled her, rubbing my damp hair against her.\u003c/p\u003e\n\u003cp\u003eShe moaned. “No fair. You’re all ripped and shiny and mostly naked, and I have no willpower.”\u003c/p\u003e\n\u003cp\u003e“You don’t need any.” I pushed my hands beneath her tank and freed the clasp of her bra. “Let me have you, Eva.”\u003c/p\u003e\n\u003cp\u003eI sucked in a slow, deep breath as she reached under the elastic of my waistband and gripped my cock.\u003c/p\u003e\n\u003cp\u003e“Yum,” she whispered. “Look what I found.”\u003c/p\u003e\n\u003cp\u003e“Angel.” I cupped her ass. “Tell me you want it exactly the way I want to give it to you.”\u003c/p\u003e\n\u003cp\u003eShe looked up at me with heavy-lidded eyes. “And how would that be?”\u003c/p\u003e\n\u003cp\u003e“Here. On the floor. Your jeans caught around one ankle, your shirt pushed up, your underwear shoved to the side. I want my cock inside you, my cum filling you.” I slid my tongue along the racing pulse in her neck. “I’ll take care of you once I get you to bed, but right now . . . I just want to use you.”\u003c/p\u003e\n\u003cp\u003eShe trembled. “Gideon.”\u003c/p\u003e\n\u003cp\u003eBanding one arm behind her thighs, I pulled her feet out from under her and lowered her carefully to the carpet. My mouth found hers soft and hot and wet, her tongue licking mine. Her arms wrapped around my neck, trying to hold me. I let her, my knees straddling her hips, my fingers opening her jeans.\u003c/p\u003e\n\u003cp\u003eHer belly was flat and silky smooth, concaving with a giggle when my knuckles brushed her sides. Her ticklishness made me smile into our kiss, joy filling my chest until it felt too small to contain it.\u003c/p\u003e\n\u003cp\u003e“You’ll stay with me,” I told her. “Wake up with me.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Her hips lifted to help me yank her pants down.\u003c/p\u003e\n\u003cp\u003eI freed one leg and left the other trapped, my hands pushing her thighs open so I could see her. Her panties were skewed from pulling off her jeans, giving her just the look I wanted.\u003c/p\u003e\n\u003cp\u003eShe was my wife. My most valuable possession; I treasured her. But I loved her slutty and dirty, too. A sexual object for my pleasure. The one woman who could silence the memories in my head and set me free.\u003c/p\u003e\n\u003cp\u003e“Angel.” I slid down, lying prone, my mouth watering for the taste of her.\u003c/p\u003e\n\u003cp\u003e“No,” she protested, her hands covering herself.\u003c/p\u003e\n\u003cp\u003eI pinned her wrists at her sides and glared. “I want you like this.”\u003c/p\u003e\n\u003cp\u003e“Gideon—”\u003c/p\u003e\n\u003cp\u003eI licked her through the silk and she arched with a whimper, her heels digging into the carpet and lifting her cunt to my mouth. I pulled her panties aside with my teeth and uncovered the impossibly soft skin. A rough sound left me, my dick hardening to the point of pain.\u003c/p\u003e\n\u003cp\u003eWrapping my lips around her clit, I sucked her, licked her. Felt her tense up. I released her hands, knowing she was mine now, helpless to fight me.\u003c/p\u003e\n\u003cp\u003e“Oh God,” she breathed, writhing. “Your mouth . . .”\u003c/p\u003e\n\u003cp\u003eSpreading her wide with my shoulders, I tongued her, driving her to come. Her fingers pulled at my hair, tugging painfully at the roots, spurring me on until she climaxed with a startled cry. I licked inside her, fucking her, feeling her quiver around my tongue. She grew slicker, hotter.\u003c/p\u003e\n\u003cp\u003eI rubbed against her clit and slid two fingers inside her, grinding my hips into the floor at the feel of her tight plushness. My cock ached to sink into that snug heat, knowing how amazing it felt, craving the constriction.\u003c/p\u003e\n\u003cp\u003e“Please,” Eva begged, grinding into the thrust of my fingers, needing the slide of my dick to fill her.\u003c/p\u003e\n\u003cp\u003eI wanted to fuck. To come. Not because I needed sex, but because I needed her.\u003c/p\u003e\n\u003cp\u003eHer body twisted and tensed with another orgasm, her neck arching as she cried out.\u003c/p\u003e\n\u003cp\u003eWiping my wet mouth on her inner thigh, I rose to my knees and shoved my sweats down. I placed one hand on the floor and used the other to aim my cock, levering over her and notching the throbbing head against her. I thrust hard, putting the weight of my body behind it, surging through the tight clasp with a groan.\u003c/p\u003e\n\u003cp\u003e“Gideon.”\u003c/p\u003e\n\u003cp\u003e“Christ.” I rubbed my sweat-slick forehead against her cheek, wanting her to smell like me. Her nails were in my back, digging in. I wanted them to mark me, scar me.\u003c/p\u003e\n\u003cp\u003eCupping her ass, I lifted her, angled her, digging my feet into the carpet for the leverage I needed to push all the way in. Eva gasped and churned her hips, working to fit me.\u003c/p\u003e\n\u003cp\u003e“Take me,” I hissed through clenched teeth, fighting the need to come before she took all of my cock. “Let me in.”\u003c/p\u003e\n\u003cp\u003eHer cunt rippled, sucking at me. I pinned her shoulder to hold her still and thrust harder. She gave, letting me have her.\u003c/p\u003e\n\u003cp\u003eThe feel of her clutching the entire length of my dick was all I needed. Wrapping myself around her, I held her against me, kissing her roughly, coming with a violence that left me trembling in her arms.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eSTEAM curled around us as I cradled Eva in the suite’s massive sunken tub. Her wet hair clung to my chest, her arms draped over mine where they hugged her waist.\u003c/p\u003e\n\u003cp\u003e“Ace.”\u003c/p\u003e\n\u003cp\u003e“Hmm?” I pressed my lips to her temple.\u003c/p\u003e\n\u003cp\u003e“If we couldn’t be together—not that it would ever happen, just hypothetically—would you sleep with someone who looked like me? I mean, I know I’m not your usual type, but would you want to pretend with someone who reminded you of me?”\u003c/p\u003e\n\u003cp\u003e“I’m not going to speculate on situations that will never occur.”\u003c/p\u003e\n\u003cp\u003e“Gideon.” She leaned to the side, tilting her head back to look at me. “I get it. I tried to think if I would find any comfort in being with someone similar to you. Like maybe if it was dark and his hair was your length—”\u003c/p\u003e\n\u003cp\u003eMy hold tightened. “Eva. Don’t tell me about fantasies of other men.”\u003c/p\u003e\n\u003cp\u003e“God. As usual, you’re not listening.”\u003c/p\u003e\n\u003cp\u003e“What the fuck is this about?” I knew, of course. But there were no avenues in the topic I wanted to explore.\u003c/p\u003e\n\u003cp\u003e“Brett’s sleeping with that girl from the ‘Golden’ video. The one who looks like me.”\u003c/p\u003e\n\u003cp\u003e“No one looks like you.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“She may have your curves,” I conceded, “but she doesn’t sound like you. She doesn’t have your sense of humor, your wit. She doesn’t have your heart.”\u003c/p\u003e\n\u003cp\u003e“Oh, Gideon.”\u003c/p\u003e\n\u003cp\u003eI brushed wet fingertips over her brow. “Turning off the lights wouldn’t help me at all. A random, stacked blonde wouldn’t smell like you. She wouldn’t move the way you do. She wouldn’t touch me the same way, need me the same way.”\u003c/p\u003e\n\u003cp\u003eHer face softened and she pressed her cheek against my shoulder. “That’s what I thought, too. I couldn’t do it. And the moment I saw Brett with that girl, I knew that you wouldn’t do it, either.”\u003c/p\u003e\n\u003cp\u003e“Not with anyone. Ever.” I kissed the tip of her nose. “You’ve changed what sex means to me, Eva. I couldn’t go back. I wouldn’t even try.” \u003c/p\u003e","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-11.html","bookId":1816,"creation":"Oct 5, 2019 5:07:14 PM","modification":"Oct 5, 2019 5:07:14 PM"}
