{"id":85507,"no":30,"title":"Page 30","content":"\u003cp\u003eI waited in the open door as the flustered woman gathered her stuff, and then I moved aside as she stepped out.\u003c/p\u003e\n\u003cp\u003e“I could’ve called security,” Anne said, leaning back against the front of her desk and crossing her arms.\u003c/p\u003e\n\u003cp\u003e“After going to all the trouble of luring me here? You wouldn’t.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you’re talking about. Regardless, it’s good to see you.” She dropped her arms and gripped the edge of her desk in a deliberately provocative pose, exposing her bare thigh as the slit in her blue wrap dress slid open.\u003c/p\u003e\n\u003cp\u003e“I can’t say the same.”\u003c/p\u003e\n\u003cp\u003eHer smile tightened. “Break your toys, then throw them away. Does Eva know her days are numbered?”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003eUnease dimmed her bright eyes and shook her smile. “Is that a threat, Gideon?”\u003c/p\u003e\n\u003cp\u003e“You’d like for it to be.” I stepped closer, watched her pupils dilate. She was becoming aroused and that revolted me as much as the smell of her perfume. “Might make your game more interesting.”\u003c/p\u003e\n\u003cp\u003eShe straightened and came toward me, her hips swaying, her red-soled black stilettos sinking into the plush carpet.\u003c/p\u003e\n\u003cp\u003e“You like to play, too, lover,” she purred. “Tell me, have you tied up your pretty fiancée? Flogged her into a frenzy? Shoved one of your extensive array of dildos into her ass, so that it fucked her while you pounded her pussy for hours? Does she know you, Gideon, the way I do?”\u003c/p\u003e\n\u003cp\u003e“Hundreds of women know me the way you do, Anne. Do you think you were special? The only thing memorable about you is your husband and how it eats at him that I’ve had you.”\u003c/p\u003e\n\u003cp\u003eHer hand swung up to slap me and I didn’t stop her, taking the hit unflinchingly.\u003c/p\u003e\n\u003cp\u003eI wish what I’d said were true, but I had been particularly depraved with her, seeing ghosts of her brother in the curve of her smile, her mannerisms—\u003c/p\u003e\n\u003cp\u003eI caught her wrist when she made a grab for my cock. “Leave Eva alone. I won’t tell you twice.”\u003c/p\u003e\n\u003cp\u003e“She’s the chink in your armor, you heartless piece of shit. You’ve got ice in your veins, but she bleeds.”\u003c/p\u003e\n\u003cp\u003e“Is that a threat, Anne?” I asked, calmly tossing her words back to her.\u003c/p\u003e\n\u003cp\u003e“Absolutely.” She yanked free of my grip. “It’s time to pay, and your billions won’t cover the debt.”\u003c/p\u003e\n\u003cp\u003e“Raising the stakes with a declaration of war? Are you that stupid? Or don’t you care what this will cost you? Your career . . . your marriage . . . everything.”\u003c/p\u003e\n\u003cp\u003eI moved toward the door, my stride leisurely even as fury burned through me. I’d brought this down on Eva. I had to clean it up.\u003c/p\u003e\n\u003cp\u003e“Just watch me, Gideon,” she called after me. “See what happens.”\u003c/p\u003e\n\u003cp\u003e“Have it your way.” I paused with my hand on the doorknob. “You’ve started this, but make no mistake, the final move will be mine.”\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003e“HAVE you had any nightmares since we last saw each other?” Dr. Petersen asked, his demeanor laid back and quietly interested, the requisite tablet in his lap.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“How often would you say you have them?”\u003c/p\u003e\n\u003cp\u003eI sat as comfortably as the easygoing doctor but was irritably restless inside. I had too much to deal with to waste an hour of my time. “Lately, once a week. Sometimes a little longer in between.”\u003c/p\u003e\n\u003cp\u003e“What do you mean by lately?”\u003c/p\u003e\n\u003cp\u003e“Since I met Eva.”\u003c/p\u003e\n\u003cp\u003eHe jotted something down with his stylus. “You’re facing unfamiliar pressures as you work on your relationship with Eva, but the frequency of your nightmares is lessening—at least for now. Do you have any thoughts as to why?”\u003c/p\u003e\n\u003cp\u003e“I thought you were supposed to be explaining that to me.”\u003c/p\u003e\n\u003cp\u003eDr. Petersen smiled. “I can’t wave a magic wand and give you all the answers, Gideon. I can only help you sort through it.”\u003c/p\u003e\n\u003cp\u003eI was tempted to wait for him to say more, make him do most of the talking. But the thought of Eva and her hopes that therapy was going to make some sort of difference goaded me to speak. I’d promised to try, so I would. To a degree. “Things are smoothing out for us. We’re in sync more than we’re not.”\u003c/p\u003e\n\u003cp\u003e“Do you feel that you’re communicating better?”\u003c/p\u003e\n\u003cp\u003e“I think we’re better at gauging the motives behind each other’s actions. We understand each other more.”\u003c/p\u003e\n\u003cp\u003e“Your relationship has moved very quickly. You’re not an impulsive man, but many would say marrying a woman you’ve known such a short time—and one you admit you’re still getting to know—is extremely impulsive.”\u003c/p\u003e\n\u003cp\u003e“Is there a question there?”\u003c/p\u003e\n\u003cp\u003e“An observation.” He waited a moment, but when I didn’t say anything, he went on. “It can be difficult for spouses of individuals with Eva’s history. Her commitment to therapy has helped both of you; however, it’s likely she’ll continue to change in ways you may not expect. It will be stressful for you.”\u003c/p\u003e\n\u003cp\u003e“I’m no picnic myself,” I said dryly.\u003c/p\u003e\n\u003cp\u003e“You’re a survivor of a different sort. Have you ever felt that your nightmares were aggravated by stress?”\u003c/p\u003e\n\u003cp\u003eThe question irritated me. “What does it matter? They happen.”\u003c/p\u003e\n\u003cp\u003e“You don’t feel there are changes that can be made to lessen their impact?”\u003c/p\u003e\n\u003cp\u003e“I just got married. That’s a major life change, wouldn’t you say, Doctor? I think that’s enough for now.”\u003c/p\u003e\n\u003cp\u003e“Why must there be a limit? You’re a young man, Gideon. You have a variety of options available to you. Change doesn’t have to be something avoided. What’s the harm in trying something new? If it doesn’t work out, you always have the option to go back to what you were doing before.”\u003c/p\u003e\n\u003cp\u003eI found that wryly amusing. “Sometimes, you can’t go back.”\u003c/p\u003e\n\u003cp\u003e“Let’s try a simple change now,” Dr. Petersen said, setting his tablet aside. “Let’s go for a walk.”\u003c/p\u003e\n\u003cp\u003eI found myself standing when he did, not wanting to be seated while he towered above me. We stood face-to-face with the coffee table between us. “Why?”\u003c/p\u003e\n\u003cp\u003e“Why not?” He gestured toward the door. “My office may not be the best place for us to talk. You’re a man used to being in charge. In here, I am. So we’ll level the playing field and hit the hallway for a bit. It’s a public space, but most of the individuals who work in this building have gone home.”\u003c/p\u003e\n\u003cp\u003eI exited his office before him, watching as he locked both his inner and outer office doors before joining me.\u003c/p\u003e\n\u003cp\u003e“Ah, well. This is certainly different,” he said, his mouth curving wryly. “Knocks me off my stride a bit.”\u003c/p\u003e\n\u003cp\u003eI shrugged and started walking.\u003c/p\u003e\n\u003cp\u003e“What are your plans for the rest of the evening?” he asked, falling into step beside me.\u003c/p\u003e\n\u003cp\u003e“An hour with my trainer.” And then I said more. “My stepfather is coming over later.”\u003c/p\u003e\n\u003cp\u003e“To spend time with you and Eva? Are you close to him?”\u003c/p\u003e\n\u003cp\u003e“No, to both.” I stared straight ahead. “Something’s wrong. That’s the only reason he ever calls me.”\u003c/p\u003e\n\u003cp\u003eI sensed his gaze on my profile. “Do you wish that were different?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You don’t like him?”\u003c/p\u003e\n\u003cp\u003e“I don’t dislike him.” I was going to leave it at that, but again I thought of Eva. “We just don’t know each other very well.”\u003c/p\u003e\n\u003cp\u003e“You could change that.”\u003c/p\u003e\n\u003cp\u003eI huffed out a laugh. “You’re really pushing that angle tonight.”\u003c/p\u003e\n\u003cp\u003e“I told you, I don’t have an angle.” He stopped, forcing me to stop, too.\u003c/p\u003e\n\u003cp\u003eTipping his chin up, he eyed the ceiling, clearly thinking. “When you’re considering an acquisition or exploring a new avenue of doing business, you bring in people to advise you, right? Experts in their respective fields?” He looked at me again, smiling. “You could think of me the same way, as an expert consultant.”\u003c/p\u003e\n\u003cp\u003e“On what?”\u003c/p\u003e\n\u003cp\u003e“Your past.” He resumed walking. “I help you with that, you can figure out the rest of your life yourself.”\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003e“GET your head in the game, Cross.”\u003c/p\u003e\n\u003cp\u003eMy gaze narrowed. Across the mat, James Cho hopped on his bare feet, taunting me. He grinned evilly, knowing the unspoken challenge would spur me on. Half a foot shorter than me and lighter by at least thirty pounds, the former MMA champion was lethally quick and had the belt to prove it.\u003c/p\u003e\n\u003cp\u003eRolling my shoulders back, I adjusted my stance. My fists came up, closing the opening that had allowed his last punch to connect with my torso.\u003c/p\u003e\n\u003cp\u003e“Make it worth my while, Cho,” I fired back, irritated that he was right. My brain was still back in Dr. Petersen’s office. A switch had been thrown tonight and I couldn’t get a handle on what it was or what it meant.\u003c/p\u003e\n\u003cp\u003eJames and I circled, feinting and striking out, neither of us scoring a hit. As always, it was just the two of us in the dojo. The driving beat of taiko drums rumbled in the background from speakers cleverly hidden in the floor-to-ceiling bamboo paneling.\u003c/p\u003e\n\u003cp\u003e“You’re still holding back,” he said. “Falling in love turn you into a pussy?”\u003c/p\u003e\n\u003cp\u003e“You wish. Only way you’d beat me.”\u003c/p\u003e\n\u003cp\u003eJames laughed, then came at me with a roundhouse kick. I dropped low and swept him, taking him down. He scissored his legs with lightning speed, taking me down with him.\u003c/p\u003e\n\u003cp\u003eWe hopped back up. Squared off again.\u003c/p\u003e\n\u003cp\u003e“You’re wasting my time,” he snapped, his fist lashing out.\u003c/p\u003e\n\u003cp\u003eI ducked to the side. My left fist shot out, grazing his side. His fist hit my ribs straight on.\u003c/p\u003e\n\u003cp\u003e“No one piss you off today?” He came at me in a rush, giving me no option to do anything but defend myself.\u003c/p\u003e\n\u003cp\u003eI growled. Rage was simmering in the back of my mind, tucked away until I had the time and attention to deal with it.\u003c/p\u003e\n\u003cp\u003e“Yeah. I see that fire in your eyes, Cross. Let it out, man. Bring it on.”\u003c/p\u003e\n\u003cp\u003eShe’s the chink in your armor . . .\u003c/p\u003e\n\u003cp\u003eI lashed out with a left/right combo, driving James back a step.\u003c/p\u003e\n\u003cp\u003e“That all you got?” he jeered.\u003c/p\u003e\n\u003cp\u003eI feigned a kick and then threw out a punch, snapping his head back.\u003c/p\u003e\n\u003cp\u003e“Fuck yeah,” he gasped, flexing his arms, getting pumped. “There you are.”\u003c/p\u003e\n\u003cp\u003eShe bleeds . . .\u003c/p\u003e\n\u003cp\u003eSnarling, I lunged forward.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eREFRESHED from a shower, I had barely finished dressing by pulling a T-shirt over my head when my smartphone started ringing. I picked it up off the bed where I’d left it and answered.\u003c/p\u003e\n\u003cp\u003e“A couple things,” Raúl said after greeting me, the background noise of a crowd and music quickly fading, then disappearing completely. “I’ve noticed that Benjamin Clancy is still keeping an eye on Mrs. Cross. Not constantly, but consistently.”\u003c/p\u003e\n\u003cp\u003e“Is that so,” I said quietly.\u003c/p\u003e\n\u003cp\u003e“Are you good with that? Or should I talk to him?”\u003c/p\u003e\n\u003cp\u003e“I’ll deal with him.” Clancy and I were due for a chat. It had been on my list, but I would move it up.\u003c/p\u003e\n\u003cp\u003e“Also—and you may know this already—Mrs. Cross had lunch with Ryan Landon and some of his executives today.”\u003c/p\u003e\n\u003cp\u003eI felt that terrible quiet settle over me. Landon. Fuck.\u003c/p\u003e\n\u003cp\u003eHe’d slid in somewhere I hadn’t been watching.\u003c/p\u003e\n\u003cp\u003e“Thank you, Raúl. I’ll need a private number for Eva’s boss, Mark Garrity.”\u003c/p\u003e\n\u003cp\u003e“I’ll text it to you when I have it.”\u003c/p\u003e\n\u003cp\u003eEnding the call, I shoved the phone in my pocket, barely resisting the urge to throw it at the wall instead.\u003c/p\u003e\n\u003cp\u003eArash had warned me about Landon and I’d brushed his concerns off. I’d been focused on my life, my wife, and while Landon had a wife of his own, his primary focus had always been me.\u003c/p\u003e\n\u003cp\u003eThe ringing of the penthouse phone jolted me. I went to the receiver on the nightstand and answered with an impatient, “Cross.”\u003c/p\u003e\n\u003cp\u003e“Mr. Cross. It’s Edwin at the front desk. Mr. Vidal is here to see you.”\u003c/p\u003e\n\u003cp\u003eJesus. My grip tightened on the receiver. “Send him up.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir. Will do.”\u003c/p\u003e\n\u003cp\u003eGrabbing my socks and shoes, I carried them out to the living room and pulled them on. As soon as Chris left, I was heading home to Eva. I wanted to open a bottle of wine, find one of the older movies she knew by heart, and just listen to her recite the corny lines of dialogue. No one could make me laugh like she did.\u003c/p\u003e\n\u003cp\u003eI heard the elevator car arrive and pushed to my feet, running a hand through my damp hair. I was tense and despised the weakness.\u003c/p\u003e\n\u003cp\u003e“Gideon.” Chris paused on the threshold of the foyer, looking grim and worn, which he so rarely did and only then because of my brother. “Is Eva here?”\u003c/p\u003e\n\u003cp\u003e“She’s at her place. I’m heading over there when you leave.”\u003c/p\u003e\n\u003cp\u003eHe gave a jerky nod, his jaw working but nothing coming out of his mouth.\u003c/p\u003e\n\u003cp\u003e“Come in,” I said, gesturing at the wingback chair by the coffee table. “Can I get you something to drink?”\u003c/p\u003e\n\u003cp\u003eGod knew I needed one myself after the day I’d had so far.\u003c/p\u003e\n\u003cp\u003eHe stepped wearily into my living room. “Anything strong would be great.” \u003c/p\u003e","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-30.html","bookId":1816,"creation":"Oct 5, 2019 5:07:14 PM","modification":"Oct 5, 2019 5:07:14 PM"}
