{"id":85518,"no":41,"title":"Page 41","content":"\u003cp\u003eI leaned forward, offering my mouth, and he took it in a soft, sweet kiss. He had said exactly what I needed to hear.\u003c/p\u003e\n\u003cp\u003eGideon pulled back, nuzzling his nose against mine. “As for the other two . . . You have to understand that Deanna was collateral damage. Fuck. My entire life has been a war zone and some people have gotten caught in the line of fire.”\u003c/p\u003e\n\u003cp\u003eI cupped his jaw, trying to stroke the tension away with soothing brushes of my thumb. I knew just what he meant.\u003c/p\u003e\n\u003cp\u003eHe swallowed hard. “If I hadn’t used Deanna to send a message to Anne that the door was closed between us, she would’ve been just a one-night stand. Over and done with.”\u003c/p\u003e\n\u003cp\u003e“But she’s okay now?”\u003c/p\u003e\n\u003cp\u003e“I think so.” His fingertips brushed my cheek, the touch reflecting the one I’d given him. “Since I’m sharing, I’ll say that I don’t think she’d turn me down if I tried to hook up—which I won’t—but I don’t think she falls in the woman-scorned category any longer.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I knew she’d hit the sheets with you again if she could. Not that I blame her. Do you have to be so damn good in bed? Isn’t it enough that you’re hot, and have an amazing body and a huge cock?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, clearly exasperated. “It’s not huge.”\u003c/p\u003e\n\u003cp\u003e“Whatever. You’re hung. And you know how to use it. And women don’t get awesome sex very often, so when we do, we can go a little nuts over it. I guess that answers my question about Anne, since she had you repeatedly.”\u003c/p\u003e\n\u003cp\u003e“She never had me.” Gideon sat back, slouching. Scowling. “At some point you’re going to get sick of hearing what an asshole I am.”\u003c/p\u003e\n\u003cp\u003eI curled into his side, resting my head on his shoulder. “You’re not the first insanely hot guy on the planet to use women. And you won’t be the last.”\u003c/p\u003e\n\u003cp\u003e“It was different with Anne,” he grumbled. “It wasn’t just about her husband.”\u003c/p\u003e\n\u003cp\u003eI stilled, then forced myself to relax so that I didn’t make him any more nervous than he already was.\u003c/p\u003e\n\u003cp\u003eHe sucked in a quick, deep breath. “She reminds me of Hugh sometimes,” he said in a rush. “The way she moves, some of the things she says . . . There’s a familial resemblance. And more. I can’t explain it.”\u003c/p\u003e\n\u003cp\u003e“Then don’t.”\u003c/p\u003e\n\u003cp\u003e“Sometimes the line between them blurred in my mind. It was like I was punishing Hugh through Anne. I did things to her I’ve never done with anyone else. Things that made me feel sick when I thought about them later.”\u003c/p\u003e\n\u003cp\u003e“Gideon.” I slid my arm around his waist.\u003c/p\u003e\n\u003cp\u003eHe hadn’t told me this. He’d said before that it was Dr. Terrence Lucas he was punishing, and I was sure that was part of it. But now I knew it wasn’t all of it.\u003c/p\u003e\n\u003cp\u003eGideon sat back. “It was twisted between Anne and me. I twisted her. If I could go back and do things differently—”\u003c/p\u003e\n\u003cp\u003e“We’ll deal with it. I’m glad you told me.”\u003c/p\u003e\n\u003cp\u003e“Had to. Listen, angel, you need to tell Raúl the moment you see her anywhere. Even if you’re not sure. And don’t go anywhere alone. I’ll figure out how to deal with her. In the meantime, I need to know that you’re safe.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I wasn’t sure how that plan would work over the long haul. We lived in the same city with the woman and her husband, and Lucas himself had approached me before. They were a problem and we needed a solution.\u003c/p\u003e\n\u003cp\u003eBut we weren’t going to come up with it today. Saturday. One of the two days of the week I most looked forward to because I got to spend so much private time with my husband.\u003c/p\u003e\n\u003cp\u003e“So,” I began, sliding my hand up beneath Gideon’s shirt to touch his warm skin. “Where’s my surprise?”\u003c/p\u003e\n\u003cp\u003e“Well . . .” The sexy rasp in his voice deepened. “Let’s wait a bit before that. How about we start with some wine?”\u003c/p\u003e\n\u003cp\u003eTilting my head back, I looked up at him. “Are you trying to seduce me, ace?”\u003c/p\u003e\n\u003cp\u003eHe kissed my nose. “Always.”\u003c/p\u003e\n\u003cp\u003e“Umm . . . Go right ahead.”\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eI knew something was up when Gideon didn’t join me in the shower. The only time he missed an opportunity to put his hands on me while drenched and dripping was in the mornings, after he’d already had his way with me.\u003c/p\u003e\n\u003cp\u003eWhen I came back out to the living room dressed in shorts and tank top sans bra, he was waiting for me with a glass of red wine. We settled on the couch with 3 Days to Kill, which only proved to me that my husband knew me well. It was just the sort of movie I enjoyed—a bit funny, a lot over-the-top. And it had Kevin Costner, who was always a win for me.\u003c/p\u003e\n\u003cp\u003eStill, as much fun as I had just being lazy with Gideon, the anticipation started to make me twitchy as the hours passed. And Gideon, the devious man, knew it. He built on it. He kept my wineglass full and his hands on me—tangled in my hair, brushing over my shoulder, running along my thigh.\u003c/p\u003e\n\u003cp\u003eBy nine o’clock, I was crawling all over him. I slid into his lap and pressed my lips to his throat, my tongue darting out to stroke over his pulse. I felt it leap, then accelerate, but he made no move in response. He sat as if absorbed in the rerun we’d channel-surfed to after the movie ended.\u003c/p\u003e\n\u003cp\u003e“Gideon?” I whispered in my fuck-me voice, my hand sliding between his legs to find him as hard and ready as always.\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003eI caught the lobe of his ear in my teeth, tugging gently. “Would you mind if I fucked myself on your big cock while you’re watching TV?”\u003c/p\u003e\n\u003cp\u003eHis hand rubbed absently down my back. “I might not be able to see around you,” he replied, sounding distracted. “Maybe you better get on your knees and suck it instead.”\u003c/p\u003e\n\u003cp\u003ePulling back, I gaped at him. His eyes laughed at me.\u003c/p\u003e\n\u003cp\u003eI shoved at his shoulder. “You’re terrible!”\u003c/p\u003e\n\u003cp\u003e“My poor angel,” he crooned. “Are you horny?”\u003c/p\u003e\n\u003cp\u003e“What do you think?” I gestured at my chest. My nipples were hard and tight, straining against the thin cotton in a silent demand for his attention.\u003c/p\u003e\n\u003cp\u003eCupping my shoulders, he pulled me closer and caught the tip of my breast in his teeth, his tongue stroking softly. I moaned.\u003c/p\u003e\n\u003cp\u003eHe released me, his eyes now so dark they were like sapphires. “Are you wet?”\u003c/p\u003e\n\u003cp\u003eI was getting there, fast. Whenever Gideon looked at me like that, my body softened for him, grew moist and eager. “Why don’t you find out?” I teased.\u003c/p\u003e\n\u003cp\u003e“Show me.”\u003c/p\u003e\n\u003cp\u003eThe authoritative bite in his command made me hotter. I slid off him carefully, feeling inexplicably shy. He pushed the coffee table back with one foot, giving me more room to stand in front of him. His gaze slid over me, his face expressionless. The lack of encouragement made me even more anxious, which I guessed was his intention.\u003c/p\u003e\n\u003cp\u003eHe was pushing in that way he had.\u003c/p\u003e\n\u003cp\u003eRolling my shoulders back, I caught his gaze with my own and ran my tongue along my bottom lip. His eyes became heavy-lidded. I slid my thumbs beneath the elastic waistband of my athletic shorts and pushed them down, wriggling my hips a little to make it look more like a striptease and less like I was feeling awkward.\u003c/p\u003e\n\u003cp\u003e“No panties,” he murmured, his gaze on my sex. “You’re a bad girl, angel.”\u003c/p\u003e\n\u003cp\u003eI pouted. “I’m trying to be good.”\u003c/p\u003e\n\u003cp\u003e“Open yourself for me,” he murmured. “Let me see you.”\u003c/p\u003e\n\u003cp\u003e“Gideon . . .”\u003c/p\u003e\n\u003cp\u003eHe waited patiently and I knew that patience would hold. Whether it took me five minutes or five hours, he would wait for me. And that was why I trusted him. Because it was never a question of whether I would submit, but when I was ready to, and that was a decision he most often left to me.\u003c/p\u003e\n\u003cp\u003eI widened my stance and tried to slow the quickness of my breathing. Reaching down with both hands, I touched the lips of my sex and spread them, exposing my clit to the man it ached for.\u003c/p\u003e\n\u003cp\u003eGideon straightened slowly. “You have such a pretty cunt, Eva.”\u003c/p\u003e\n\u003cp\u003eAs he leaned closer, I held my breath. His hands lifted from his thighs, reaching for mine to hold me steady. “Don’t move,” he ordered.\u003c/p\u003e\n\u003cp\u003eThen he licked me in a leisurely glide.\u003c/p\u003e\n\u003cp\u003e“Oh God,” I moaned, my legs shaking.\u003c/p\u003e\n\u003cp\u003e“Sit down,” he said hoarsely, sliding to his knees on the floor as I obeyed.\u003c/p\u003e\n\u003cp\u003eThe glass was cool against my bare buttocks, a sharp contrast to the heat of my skin. My arms stretched back, gripping the far edge of the table for balance as he pressed my thighs wide with his palms, splaying me open.\u003c/p\u003e\n\u003cp\u003eHis breath was hot against my damp flesh, his focus fully on my sex. “You could be wetter.”\u003c/p\u003e\n\u003cp\u003eI watched, panting, as he lowered his head and wrapped his lips around my clit. The heat was searing, the lash of his tongue devastating. I cried out, wanting to writhe but held fast by his grip. My head fell back, my ears ringing with the rush of blood and the sound of Gideon’s groan. His tongue fluttered over the tight bundle of nerves, driving me relentlessly toward orgasm. My stomach tightened as the pleasure built, the soft silk of his hair brushing along my sensitive inner thighs.\u003c/p\u003e\n\u003cp\u003eA low moan escaped me. “I’m going to come,” I gasped. “Gideon . . . God . . . I’m going to come.”\u003c/p\u003e\n\u003cp\u003eHe drove his tongue inside me. My elbows weakened, dropping me lower. His tongue fucked into the clutching opening of my sex, stroking through the sensitive tissues, teasing me with a promise of the penetration I truly craved.\u003c/p\u003e\n\u003cp\u003e“Fuck me,” I begged.\u003c/p\u003e\n\u003cp\u003eGideon pulled back, licking his lips. “Not here.”\u003c/p\u003e\n\u003cp\u003eI made a sound of protest as he stood, so close to orgasm I could taste it. He held his hand out to me, helped me straighten and then stand. When I wobbled, he caught me up, tossing me over his shoulder.\u003c/p\u003e\n\u003cp\u003e“Gideon!”\u003c/p\u003e\n\u003cp\u003eBut then his hand was between my legs, massaging my wet, swollen sex, and I didn’t care how he carried me, as long as he got me someplace where he’d take me.\u003c/p\u003e\n\u003cp\u003eWe reached the hallway and turned, then stopped too quickly to have reached his bedroom. I heard the doorknob turn and then the light flicked on.\u003c/p\u003e\n\u003cp\u003eWe were in the bedroom that was mine. He set me down on my feet, facing him.\u003c/p\u003e\n\u003cp\u003e“Why here?” I asked. Maybe some men would head to the nearest bed, but Gideon had more control than that. If he wanted me in the second bedroom, he had a reason for it.\u003c/p\u003e\n\u003cp\u003e“Turn around,” he said quietly.\u003c/p\u003e\n\u003cp\u003eSomething about his voice . . . the way he looked at me . . .\u003c/p\u003e\n\u003cp\u003eI looked over my shoulder.\u003c/p\u003e\n\u003cp\u003eAnd saw the swing.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eIT wasn’t what I expected.\u003c/p\u003e\n\u003cp\u003eI’d looked up sex swings on the Internet when Gideon had first mentioned one. What I’d found were rickety things you hung from door frames, not-so-rickety things that hung from four-legged frames, and ones that hung from an eyebolt in the ceiling. All of them consisted of some combination of chains and/or straps that acted as slings for various body parts. Pictures of women actually harnessed in the damn things looked uncomfortable.\u003c/p\u003e\n\u003cp\u003eHonestly, I couldn’t see how anyone could get past the awkwardness and fear of collapse, let alone manage an orgasm.\u003c/p\u003e\n\u003cp\u003eI should’ve known Gideon would have something else in mind.\u003c/p\u003e\n\u003cp\u003eTurning, I faced the swing head-on. Gideon had cleared out the bedroom at some point. The bed and furnishings were gone. The only object in the room was the swing itself, suspended from a sturdy cagelike structure. A wide, solid metal platform anchored steel sides and roof, which supported the weight of a padded metal chair and chains. Red leather cuffs for wrists and ankles hung in the appropriate places.\u003c/p\u003e\n\u003cp\u003eHis arms wrapped around me from behind, one hand sliding up beneath my shirt to cup my breast, while the other slid between my legs to push two fingers inside me.\u003c/p\u003e\n\u003cp\u003eNuzzling my hair out of the way, he kissed my throat. “How do you feel, looking at that?”\u003c/p\u003e\n\u003cp\u003eI thought about it. “Intrigued. A little apprehensive.”\u003c/p\u003e\n\u003cp\u003eHis lips curved against my skin. “Let’s see how you feel once you’re in it.”\u003c/p\u003e\n\u003cp\u003eA shiver of expectation and apprehension moved through me. I could see from the position of the cuffs that I would be helpless, unable to move or pull away. Unable to exert any control whatsoever over what might happen to me.\u003c/p\u003e\n\u003cp\u003e“I want to do this right, Eva. Not like that night in the elevator. I want you to feel it when I’m in control and we’re in it together.”\u003c/p\u003e\n\u003cp\u003eMy head fell back against him. Somehow, it was harder giving the consent he wanted. There was less . . . responsibility when he just took charge.\u003c/p\u003e\n\u003cp\u003eBut that was a cop-out.\u003c/p\u003e\n\u003cp\u003e“What’s your safe word, angel?” he murmured, his teeth scoring gently across my throat. His hands were magic, his fingers gliding shallowly inside me.\u003c/p\u003e\n\u003cp\u003e“Crossfire.”\u003c/p\u003e\n\u003cp\u003e“You say the word and everything stops. Say it again.”\u003c/p\u003e\n\u003cp\u003e“Crossfire.”\u003c/p\u003e\n\u003cp\u003eHis dexterous fingers tugged at my nipple, milking it expertly. “There’s nothing to be afraid of. You just have to sit back and take my cock. I’m going to make you come without you having to do a thing.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath. “I feel like that’s always how it is between us.”\u003c/p\u003e\n\u003cp\u003e“Try it this way,” he coaxed, his hands moving to pull my shirt off. “If you don’t like it, we’ll hit the bed instead.” \u003c/p\u003e","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-41.html","bookId":1816,"creation":"Oct 5, 2019 5:07:14 PM","modification":"Oct 5, 2019 5:07:14 PM"}
