{"id":85519,"no":42,"title":"Page 42","content":"\u003cp\u003eFor a moment, I wanted to delay, take more time to let it all settle in. I’d promised the swing, but he wasn’t holding that over me . . .\u003c/p\u003e\n\u003cp\u003e“Crossfire,” he breathed, hugging me from behind.\u003c/p\u003e\n\u003cp\u003eI didn’t know if he was reminding me of my safe word or telling me he loved me so much there were no words for how he felt. Either way, the effect on me was the same. I felt safe.\u003c/p\u003e\n\u003cp\u003eI also felt his excitement. His breathing had quickened the moment I’d spotted the swing. His erection was like steel against my buttocks and his skin was hot against mine. His desire spurred my own, made me want to do whatever it took to give him as much pleasure as he could stand.\u003c/p\u003e\n\u003cp\u003eIf he needed something, I wanted to be the woman who gave it to him. He gave so much to me. Everything.\u003c/p\u003e\n\u003cp\u003e“Okay,” I said softly. “Okay.”\u003c/p\u003e\n\u003cp\u003eHe kissed my shoulder, then stepped beside me, taking my hand in his.\u003c/p\u003e\n\u003cp\u003eI followed him to the swing, studying it intently. The narrow seat hung at waist level for Gideon, which meant he had to turn me to face him, then lift me up into the chair. His mouth touched mine as my bare ass touched the cool leather, his tongue teasing the seam of my lips. I shivered. Whether that was from the chill, his kiss, or anxiety, I didn’t know.\u003c/p\u003e\n\u003cp\u003eGideon pulled away, his gaze heavy-lidded and hot. He eased me into position, holding the chains steady as I leaned into the seat back, which was angled away from him, making me want to stretch my legs out for balance.\u003c/p\u003e\n\u003cp\u003e“You settled?” he asked, watching me intently.\u003c/p\u003e\n\u003cp\u003eI knew the question was about more than my physical comfort. I nodded.\u003c/p\u003e\n\u003cp\u003eHe stepped back, his gaze never leaving my face. “I’m going to secure your ankles. You tell me if anything doesn’t feel right.”\u003c/p\u003e\n\u003cp\u003e“All right.” My voice was breathy, my pulse racing.\u003c/p\u003e\n\u003cp\u003eHis hand slid down my leg, the stroke warm and provocative. I couldn’t look away as he wrapped the crimson leather around my ankle and cinched the metal buckle. The cuff was fit securely but not too tightly.\u003c/p\u003e\n\u003cp\u003eGideon moved quickly and confidently. A moment later, my other leg was suspended as well.\u003c/p\u003e\n\u003cp\u003eHe looked at me. “Okay so far?”\u003c/p\u003e\n\u003cp\u003e“You’ve done this before.” I pouted. His actions seemed too practiced to be those of a beginner.\u003c/p\u003e\n\u003cp\u003eHe didn’t answer. Instead he began to strip as slowly and methodically as he’d restrained me.\u003c/p\u003e\n\u003cp\u003eMesmerized, I greedily drank in every inch of skin he revealed. My husband had such an amazing body. He was so hard and tight, so virile. It was impossible not to become aroused seeing him naked.\u003c/p\u003e\n\u003cp\u003eHis tongue slid along the bottom curve of his mouth in a leisurely, erotic caress. “Still good, angel?”\u003c/p\u003e\n\u003cp\u003eGideon knew exactly what the sight of him did to me, and it turned me on even more that he was arrogant enough to use that weakness against me. God knew I did the same to him when I could.\u003c/p\u003e\n\u003cp\u003e“You are so fucking hot,” I told him, licking my own lips.\u003c/p\u003e\n\u003cp\u003eHe smiled and came toward me, his thick, long cock curving upward to his navel. “I think you’ll really enjoy this.”\u003c/p\u003e\n\u003cp\u003eI didn’t have to ask why he said so, because it was evident as he reached me and took my hands in his. My vantage of him from the swing seat was completely unhindered. From the thighs upward, he was totally exposed between the spread of my legs.\u003c/p\u003e\n\u003cp\u003eHe bent and kissed me again. Softly. Sweetly. I moaned at the unexpected tenderness and the lushness of his flavor.\u003c/p\u003e\n\u003cp\u003eReleasing one of my hands, he reached between us, gripping his cock and angling it downward to stroke between the lips of my sex. The wide head slid through the slickness of my desire, then nudged against my exposed clit. Pleasure rippled through me and I discovered just how vulnerable I was. I couldn’t arch my hips. I couldn’t tighten my inner muscles to chase the sensation.\u003c/p\u003e\n\u003cp\u003eA low whimper escaped me. I needed more, but could only wait for him to give it to me.\u003c/p\u003e\n\u003cp\u003e“You trust me,” he whispered against my mouth.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a question, but I answered anyway. “Yes.”\u003c/p\u003e\n\u003cp\u003eGideon nodded. “Grab the chains.”\u003c/p\u003e\n\u003cp\u003eThere were wrist restraints above my head. I wondered why he didn’t use them, but I trusted him to know best. If he didn’t think I was ready, it was because he knew me so well. In some ways, he knew me better than I knew myself.\u003c/p\u003e\n\u003cp\u003eThe love I felt for him unfurled in my chest until it filled me, pushing aside the vestiges of fear that hovered in the dark corners of my mind. I’d never felt so close to him, never known it was possible to believe in someone so completely.\u003c/p\u003e\n\u003cp\u003eI did as Gideon ordered and gripped the chains. He stepped close again, his abs glistening with the first mist of perspiration. I could see his pulse throbbing in his neck, his arms, his penis. His heart was racing like mine. The head of his cock was as wet with excitement as my sex. The hunger between us was a living thing in the room, sliding sinuously around us, narrowing the world to just the two of us.\u003c/p\u003e\n\u003cp\u003e“Don’t let go,” he ordered, waiting until I nodded my agreement before he proceeded.\u003c/p\u003e\n\u003cp\u003eHe gripped a chain where it met with the seat. His other hand guided his cock to my cleft. The thick crown pressed teasingly against me, taunting me with the promise of pleasure. I was panting as I waited for him to take the step forward that would slide him into me, my core aching with the need to be filled.\u003c/p\u003e\n\u003cp\u003eInstead, he gripped the seat of the chair in both hands and pulled me onto his cock.\u003c/p\u003e\n\u003cp\u003eThe sound that ripped from my throat was inhuman, the savagely erotic feeling of being so deeply penetrated driving me wild. He sank deep in that one easy glide, my body unable to offer any resistance.\u003c/p\u003e\n\u003cp\u003eGideon snarled, a tremor running through his powerful body. “Fuck,” he hissed. “Your cunt is so good.”\u003c/p\u003e\n\u003cp\u003eI started to reach for him, but he pushed the swing back, gliding me off his rock-hard erection. The feeling of being emptied made me moan in distress.\u003c/p\u003e\n\u003cp\u003e“Please,” I begged softly.\u003c/p\u003e\n\u003cp\u003e“I told you not to let go,” he said, with a wicked gleam in his eyes.\u003c/p\u003e\n\u003cp\u003e“I won’t,” I promised, gripping the chains so hard it hurt.\u003c/p\u003e\n\u003cp\u003eHis arms flexed as he pulled me back, sliding me onto his cock. My toes curled. The feeling of weightlessness, of total surrender, was indescribable.\u003c/p\u003e\n\u003cp\u003e“Talk to me,” he bit out. “Tell me you like this.”\u003c/p\u003e\n\u003cp\u003e“Damn it,” I gasped, feeling sweat slide down my nape. “Don’t stop.”\u003c/p\u003e\n\u003cp\u003eOne moment I was held stationary, the next I was swinging fluidly, my sex sliding on and off Gideon’s rigid cock with breathtaking speed. His body worked like a well-oiled machine, his arms, chest, abs, and thighs straining with the exertion of masterfully handling the swing. The sight of his powerful movements, the intensity of his focus on pleasuring us both, the feel of him pumping so deep and fast into me . . .\u003c/p\u003e\n\u003cp\u003eI orgasmed with a scream, unable to contain the rush that surged through me. He fucked me through it, growling roughly, his face flushed and etched with lust. I’d never come so hard, so fast. I couldn’t see or breathe for an endless moment, my body wracked by a pleasure more ferocious than any I’d ever felt before.\u003c/p\u003e\n\u003cp\u003eThe swing slowed, then stopped. Gideon took an extra step toward me that kept him buried inside me. He smelled decadent, primal. Pure sin and sex.\u003c/p\u003e\n\u003cp\u003eHis hands cupped my face. His fingers brushed tendrils of hair off my damp cheeks. My sex spasmed around him, all too aware of how hard and thick he still was.\u003c/p\u003e\n\u003cp\u003e“You didn’t come,” I accused, feeling far too vulnerable after the insanity of my orgasm.\u003c/p\u003e\n\u003cp\u003eGideon took my mouth in a harsh, demanding kiss. “I’m going to restrain your wrists. Then I’m going to come in you.”\u003c/p\u003e\n\u003cp\u003eMy nipples tightened into painful points. “Oh God.”\u003c/p\u003e\n\u003cp\u003e“You trust me,” he said again, his gaze searching my face.\u003c/p\u003e\n\u003cp\u003eI touched him while I still could, my hands sliding over his sweat-slick chest, feeling the desperate beat of his heart. “More than anything.”\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003e“GOOD MORNING, ACE.”\u003c/p\u003e\n\u003cp\u003eI looked over my shoulder at the sound of Eva’s voice, smiling as I watched her circle the island on her way to the coffeemaker. Her hair was a wild tangle, her legs sexy beneath the hem of the T-shirt she wore.\u003c/p\u003e\n\u003cp\u003eReturning my attention to the stove and the French toast I was browning in the pan, I asked, “How are you feeling?”\u003c/p\u003e\n\u003cp\u003e“Umm . . .”\u003c/p\u003e\n\u003cp\u003eI looked at her again and found her blushing.\u003c/p\u003e\n\u003cp\u003e“I’m sore,” she said, inserting a coffee pod into the machine. “Deep inside.”\u003c/p\u003e\n\u003cp\u003eI grinned. The swing had positioned her perfectly, allowing for optimal penetration. I’d never been as deep in her before. I had been thinking about it all morning and decided that I would be speaking to Ash about his plans for the renovations. One of the bedrooms would need to have two closets—one for clothes, the other for the swing.\u003c/p\u003e\n\u003cp\u003e“Jeez,” she muttered, “Look at that cocky smirk. Men are pigs.”\u003c/p\u003e\n\u003cp\u003e“And here I am, slaving over a hot stove for you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah.” She swatted my ass as she passed me with a steaming cup of coffee in hand.\u003c/p\u003e\n\u003cp\u003eI caught her by the waist before she got too far, giving her a quick hard kiss on the cheek. “You were amazing last night.”\u003c/p\u003e\n\u003cp\u003eI’d felt something click into place between us so strongly that the change had been as tangible as the rings I wore on my fingers, and I cherished it as dearly.\u003c/p\u003e\n\u003cp\u003eShe flashed me a dazzling smile, then opened the fridge to pull out the carton of half-and-half. While she took care of that, I plated the finished French toast.\u003c/p\u003e\n\u003cp\u003e“I’ve been wanting to talk to you about something,” she said, joining me at the island and wriggling onto a bar stool.\u003c/p\u003e\n\u003cp\u003eMy brows lifted. “Okay.”\u003c/p\u003e\n\u003cp\u003e“I’d like to become involved with the Crossroads Foundation—financially and administratively.”\u003c/p\u003e\n\u003cp\u003e“That could encompass a lot of things, angel. Tell me what you have in mind.”\u003c/p\u003e\n\u003cp\u003eShrugging, she picked up her fork. “I’ve been thinking about the settlement money I got from Nathan’s dad. It’s just sitting in the bank, and after what Megumi has been through . . . I’ve realized that I need to put that money to work and I don’t want to wait. I’d like to help fund the programs offered by Crossroads and help brainstorm ways to expand them.”\u003c/p\u003e\n\u003cp\u003eI smiled inwardly, pleased to see her moving in the right direction. “All right. We’ll work something out.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” She brightened like the sun, the shining light in my world.\u003c/p\u003e\n\u003cp\u003e“Of course. I’d like to commit more time to it, too.”\u003c/p\u003e\n\u003cp\u003e“We can work together!” She bounced up and down. “I’m excited about this, Gideon.”\u003c/p\u003e\n\u003cp\u003eI let the smile show. “I can tell.”\u003c/p\u003e\n\u003cp\u003e“It just feels like a natural progression for us. An extension of us, really.” She cut into her food and forked a bite to her mouth. She hummed her appreciation. “Yummy,” she mumbled.\u003c/p\u003e\n\u003cp\u003e“I’m glad you like it.”\u003c/p\u003e\n\u003cp\u003e“You’re hot and you can cook. I’m a lucky girl.”\u003c/p\u003e\n\u003cp\u003eI decided not to tell her I’d just downloaded the recipe that morning. Instead, I considered what she’d said.\u003c/p\u003e\n\u003cp\u003eHad I made a tactical error by moving too quickly with Mark? It was possible that if I’d left it alone just a little longer, Eva might have come around to working at Cross Industries on her own.\u003c/p\u003e\n\u003cp\u003eBut did I have the luxury of giving her more time with Landon closing in? Even now, I didn’t think so.\u003c/p\u003e\n\u003cp\u003eSeeking to mitigate any possible fallout, I debated the merits of broaching the topic of Mark’s move to Cross Industries now versus later. Eva had opened the door by talking about us working together. If I didn’t walk through it, I ran the risk of her finding out another way.\u003c/p\u003e\n\u003cp\u003eI had taken that chance on Saturday, knowing Eva and Mark were friends who talked outside work. He could’ve called her at any time, but I’d banked on him thinking it over first, discussing it with his partner, and coming to peace with leaving Waters Field \u0026amp; Leaman.\u003c/p\u003e\n\u003cp\u003e“I have to talk to you about something, too, angel.”\u003c/p\u003e\n\u003cp\u003e“I’m all ears.”\u003c/p\u003e\n\u003cp\u003eShooting for nonchalance, I grabbed the maple syrup and poured some onto my plate. “I offered Mark Garrity a job.”\u003c/p\u003e\n\u003cp\u003eThere was a moment of stunned silence, and then, “You did what?”\u003c/p\u003e\n\u003cp\u003eThe tone of her voice confirmed that I’d been right to be up front sooner rather than later. I looked at her. She was staring at me.\u003c/p\u003e\n\u003cp\u003e“I’ve asked Mark to work for Cross Industries,” I repeated.\u003c/p\u003e\n\u003cp\u003eHer face paled. “When?”\u003c/p\u003e\n\u003cp\u003e“Friday.”\u003c/p\u003e\n\u003cp\u003e“Friday,” she parroted. “It’s Sunday. You’re just bringing this up now?”\u003c/p\u003e\n\u003cp\u003eSince the question was rhetorical, I didn’t reply, choosing to wait for a clearer assessment of the situation before possibly making things worse.\u003c/p\u003e\n\u003cp\u003e“Why, Gideon?”\u003c/p\u003e\n\u003cp\u003eI took the same tack I’d used with Mark—I told the parts of the truth most likely to be accepted. “He’s a solid employee. He’ll bring a lot to the team.”\u003c/p\u003e\n\u003cp\u003e“Bullshit.” The color came back into her face in an angry rush. “Don’t patronize me. You’re putting me out of a job and you didn’t think that was something you should discuss with me first?” \u003c/p\u003e","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-42.html","bookId":1816,"creation":"Oct 5, 2019 5:07:14 PM","modification":"Oct 5, 2019 5:07:14 PM"}
