{"id":85485,"no":8,"title":"Page 8","content":"\u003cp\u003eSylvia Day\u003c/p\u003e\n\u003cp\u003eCrossfire Series Book\u003c/p\u003e\n\u003cp\u003eCrossfire #1: Bared to You\u003c/p\u003e\n\u003cp\u003eCrossfire #2: Reflected in You\u003c/p\u003e\n\u003cp\u003eCrossfire #3: Entwined with You\u003c/p\u003e\n\u003cp\u003eCrossfire #4: Captivated by You\u003c/p\u003e\n\u003cp\u003eAfter all, if his photos were going to include him with women, I wanted at least one of them to be me. And the one I’d chosen was undeniably intimate. We lay on our backs, our temples touching, my face bare of makeup and his relaxed with a smile in his eyes. I dared anyone to look at it and not see that I had a private bond with him the world would never know.\u003c/p\u003e\n\u003cp\u003eI suddenly wanted to call him. So badly that I could almost hear that amazingly sexy voice, as intoxicating as top-shelf liquor, smooth with just a hint of bite. I wanted to be with him, my hand in his, my lips against his throat where the smell of his skin called to something hungry and primitive inside me.\u003c/p\u003e\n\u003cp\u003eIt scared me sometimes, how much I needed him. To the exclusion of everything else. There was no one I wanted to be with more, including my best friend, who was at that moment needing me almost as fiercely.\u003c/p\u003e\n\u003cp\u003e“It’s all good, Cary,” I assured him. “Don’t worry.”\u003c/p\u003e\n\u003cp\u003e“I’d be more worried if I thought you actually believed that.” He shoved the bangs off his forehead with an impatient hand. “It’s too soon, Eva.”\u003c/p\u003e\n\u003cp\u003eI nodded. “But it’ll work out.”\u003c/p\u003e\n\u003cp\u003eIt had to. I couldn’t imagine my life without Gideon in it.\u003c/p\u003e\n\u003cp\u003eCary’s head dropped back and his eyes closed. I might have thought he was succumbing to the motion sickness pills, except his knuckles were white from gripping the armrests too tightly. He was taking the news hard. I didn’t know what I could say to reassure him.\u003c/p\u003e\n\u003cp\u003eYou’re still heading in the wrong direction, Gideon texted.\u003c/p\u003e\n\u003cp\u003eI almost asked him how he knew that, but caught myself. Are you having a good time with the guys?\u003c/p\u003e\n\u003cp\u003eI’d have more fun with you.\u003c/p\u003e\n\u003cp\u003eI grinned. I would hope so. My fingers paused, then: I told Cary.\u003c/p\u003e\n\u003cp\u003eThe answer wasn’t instantaneous. Still friends?\u003c/p\u003e\n\u003cp\u003eHe hasn’t disowned me yet.\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything to that, and I told myself not to read too much into his silence. He was out with his guys. It had been asking a lot to even hear from him at all.\u003c/p\u003e\n\u003cp\u003eStill, I was super happy to get a text from him ten minutes later.\u003c/p\u003e\n\u003cp\u003eDon’t stop missing me.\u003c/p\u003e\n\u003cp\u003eI looked over at Cary and found him watching me. Was Gideon facing similar disapproval from his friends?\u003c/p\u003e\n\u003cp\u003eDon’t stop loving me, I texted back.\u003c/p\u003e\n\u003cp\u003eHis answer was simple and very much Gideon. Deal.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003e“SOCAL, baby, I missed you.” Cary descended the steps from the plane to the tarmac, tilting his head back to look up at the night sky. “God, it’s good to leave that East Coast humidity behind.”\u003c/p\u003e\n\u003cp\u003eI scrambled down after him, eager to get to the tall, dark figure waiting by a shiny black Suburban. Victor Reyes was the kind of male who commanded attention. Part of that was due to his being a cop. The rest was all him.\u003c/p\u003e\n\u003cp\u003e“Dad!” I ran full bore toward him and he unfolded from where he’d been leaning against the SUV and opened his arms to me.\u003c/p\u003e\n\u003cp\u003eHe absorbed the crash of my body into his and lifted me off my feet, squeezing me so tightly I couldn’t breathe. “It’s good to see you, baby,” he said gruffly.\u003c/p\u003e\n\u003cp\u003eCary sauntered up to us. My dad put me down.\u003c/p\u003e\n\u003cp\u003e“Cary.” My dad clasped Cary’s hand, then pulled him in for a quick hug and a hearty slap on the back. “Looking good, kid.”\u003c/p\u003e\n\u003cp\u003e“I try.”\u003c/p\u003e\n\u003cp\u003e“Got everything?” my dad asked. He eyed Raúl, who’d exited the plane first and now stood silently near a black Benz that had been parked and waiting close by.\u003c/p\u003e\n\u003cp\u003eGideon had told me to forget that Raúl was there. That wasn’t easy for me to do.\u003c/p\u003e\n\u003cp\u003e“Yep,” Cary answered, adjusting the weight of his duffel strap on his shoulder. He carried my bag, which was lighter than his, in his hand. Even with all my makeup and three pairs of shoes, Cary had packed more than me.\u003c/p\u003e\n\u003cp\u003eI loved that about him.\u003c/p\u003e\n\u003cp\u003e“You two hungry?” My dad opened the passenger door for me.\u003c/p\u003e\n\u003cp\u003eIt was just past nine in California, but after midnight in New York. Too late for me to eat usually, but we hadn’t grabbed dinner.\u003c/p\u003e\n\u003cp\u003eCary answered before climbing into the backseat. “Starved.”\u003c/p\u003e\n\u003cp\u003eI laughed. “You’re always hungry.”\u003c/p\u003e\n\u003cp\u003e“So are you, sweet cheeks,” he shot back, sliding into the center seat so he could lean forward and be in the mix. “I’ve just got no guilt about it.”\u003c/p\u003e\n\u003cp\u003eWe pulled away from the jet and I watched it grow smaller as we cruised down the tarmac toward the exit. I glanced at my dad’s profile, looking for any hint of his thoughts about the lifestyle I’d be living as Gideon’s wife. The private jets. The full-time bodyguards. I knew how he felt about Stanton’s wealth, but that was my stepdad. I was hoping a husband would be cut some slack.\u003c/p\u003e\n\u003cp\u003eStill, I knew the change in routine was glaring. Previously, we would’ve flown into San Diego’s harbor. We would have headed to the Gaslamp and grabbed a table at Dick’s Last Resort, spending an hour or more laughing at the silliness and enjoying a beer with dinner.\u003c/p\u003e\n\u003cp\u003eThere was tension now that hadn’t been there before. Nathan. Gideon. My mom. They were all hovering between us.\u003c/p\u003e\n\u003cp\u003eIt sucked. Massively.\u003c/p\u003e\n\u003cp\u003e“What about that place in Oceanside with the slushy beer and peanut shells on the floor?” Cary suggested.\u003c/p\u003e\n\u003cp\u003e“Yeah.” I twisted in my seat to give him a grateful smile. “That’d be fun.”\u003c/p\u003e\n\u003cp\u003eLaid-back and familiar. Perfect.\u003c/p\u003e\n\u003cp\u003eI could tell my dad thought so, too, when I looked at him and his mouth quirked. “You got it.”\u003c/p\u003e\n\u003cp\u003eWe left the airport behind. I dug out my phone and turned it on, wanting to sync it to the Suburban’s sound system so we could listen to music that would take us back to less complicated times.\u003c/p\u003e\n\u003cp\u003eTexts popped up so fast, they filled my screen then scrolled off.\u003c/p\u003e\n\u003cp\u003eThe most recent one was from Brett. Call me when you get into town.\u003c/p\u003e\n\u003cp\u003eAnd right on cue, “Golden” started playing on the radio.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eI was climbing the steps of my dad’s tiny porch the next day when my phone started vibrating. I pulled it out of my shorts pocket and felt a tingle of happiness at the sight of Gideon’s picture on the screen.\u003c/p\u003e\n\u003cp\u003e“Good morning,” I answered, settling into one of the two cushioned wrought-iron chairs near the front door. “Did you sleep well?”\u003c/p\u003e\n\u003cp\u003e“Well enough.” The beloved soft rasp of his voice slid sweetly through me. “Raúl says Victor’s coffee could wake a hibernating bear.”\u003c/p\u003e\n\u003cp\u003eI glanced at the Benz parked across the narrow street. The tinted windows were so dark I couldn’t see the man inside. It was a bit freaky that Raúl had somehow managed to talk to Gideon about the coffee I’d just barely taken over to him before I even made it back to the house. “Are you trying to intimidate me with how closely you’re watching me?”\u003c/p\u003e\n\u003cp\u003e“If intimidation were my goal, I wouldn’t be subtle about it.”\u003c/p\u003e\n\u003cp\u003eI picked up the mug I’d dropped off on the small patio table prior to making my java delivery to Raúl. “You do know that tone of voice makes me want to irritate you back, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Because you like the way I rise to the challenge,” he purred, sending little goose bumps across my skin despite the warmth of the summer day.\u003c/p\u003e\n\u003cp\u003eMy mouth curved. “So, what exactly did you guys end up doing last night?”\u003c/p\u003e\n\u003cp\u003e“The usual. Drink. Give each other a hard time.”\u003c/p\u003e\n\u003cp\u003e“Did you go out?”\u003c/p\u003e\n\u003cp\u003e“For a couple of hours.”\u003c/p\u003e\n\u003cp\u003eMy grip tightened on the phone as I pictured a pack of hot guys out on the prowl. “I hope you had fun.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t bad. Tell me your plans for the day.”\u003c/p\u003e\n\u003cp\u003eI picked up the same note of tightness in his words that I’d just had. Unfortunately, marriage wasn’t a cure for jealousy. “When Cary wakes up and rolls his ass off the couch, we’ll grab a quick lunch with my dad. Then we’re going down to San Diego to see Dr. Travis.”\u003c/p\u003e\n\u003cp\u003e“And tonight?”\u003c/p\u003e\n\u003cp\u003eI took a sip of my coffee, steeling myself for an argument. I knew he was thinking about Brett. “The band’s manager sent me an e-mail about where to claim VIP tickets, but I’ve decided not to see the show. I figure Cary can take a friend, if he wants. What I have to say won’t take very long, so either I’ll see Brett tomorrow before I leave or we can chat on the phone.”\u003c/p\u003e\n\u003cp\u003eHe exhaled softly. “I expect you have an idea of what you’re going to tell him.”\u003c/p\u003e\n\u003cp\u003e“I’m gonna keep it simple. With ‘Golden’ and my engagement, I don’t think it’s appropriate for us to see each other socially. I hope we’ll be friends and keep in touch, but e-mail and texts are better, unless you’re with me.”\u003c/p\u003e\n\u003cp\u003eHe was silent long enough that I thought maybe the call had dropped. “Gideon?”\u003c/p\u003e\n\u003cp\u003e“I need to know if you’re afraid to see him.”\u003c/p\u003e\n\u003cp\u003eUneasy, I took another drink. The coffee had cooled, but I barely tasted it anyway. “I don’t want to fight about Brett.”\u003c/p\u003e\n\u003cp\u003e“So your solution is to avoid him.”\u003c/p\u003e\n\u003cp\u003e“You and I have enough shit to fight about without throwing him into the mix. He’s not worth it.”\u003c/p\u003e\n\u003cp\u003eGideon was quiet again. This time, I waited him out.\u003c/p\u003e\n\u003cp\u003eWhen his voice came again, it was confident and decisive. “I can live with that, Eva.”\u003c/p\u003e\n\u003cp\u003eMy shoulders relaxed and something inside me eased. And then, paradoxically, my chest tightened. I remembered what he’d said to me once, that he’d live with me loving another man just so long as he had me.\u003c/p\u003e\n\u003cp\u003eHe loved me so much more than he loved himself. It broke my heart that he’d sell himself short like that. It made it impossible to hold myself back.\u003c/p\u003e\n\u003cp\u003e“You’re everything to me,” I breathed. “I think about you all the time.”\u003c/p\u003e\n\u003cp\u003e“It’s no different for me.”\u003c/p\u003e\n\u003cp\u003e“Really?” I lowered my voice further, trying to keep it down. “Because I have it so bad for you. I get—well, hot. Like I’m overcome with this desperate need to be touching you. My brain scatters and I have to take a minute to ride it out, but it’s so hard to deal. So many times I’ve almost dropped whatever I’m doing to get to you.”\u003c/p\u003e\n\u003cp\u003e“Eva—”\u003c/p\u003e\n\u003cp\u003e“I have fantasies about barging into one of your meetings and just running right into you. Have I told you that? When the craving is really bad, I can almost feel you pulling at me.”\u003c/p\u003e\n\u003cp\u003eI rushed on when I heard him growl softly. “I lose my breath every time I see you. If I close my eyes, I can hear your voice. I woke up this morning and I panicked a little because you’re so far away. I would’ve given anything to be able to get to you. I wanted to cry because I couldn’t.”\u003c/p\u003e\n\u003cp\u003e“Christ. Eva, please—”\u003c/p\u003e\n\u003cp\u003e“If you’re going to worry about anything, Gideon, it should be me. Because I can’t be rational when it comes to you. I’m crazy about you. Literally. I can’t think about a future without you—it freaks me out.”\u003c/p\u003e\n\u003cp\u003e“Goddamn it. You’ll never be without me. We’re going to grow old together. Die together. I’m not going to live a single day without you.”\u003c/p\u003e\n\u003cp\u003eA tear slid from the corner of my eye. I scrubbed it away. “I need you to understand that you’ll never have to settle for pieces of me. You shouldn’t be settling at all. You deserve so much better. You could have anyone—”\u003c/p\u003e\n\u003cp\u003e“That’s enough!”\u003c/p\u003e\n\u003cp\u003eI jumped at the lash of his voice.\u003c/p\u003e\n\u003cp\u003e“You will not ever say anything like that to me again,” he snapped. “Or I swear to God, angel, I will punish you.”\u003c/p\u003e\n\u003cp\u003eShocked silence filled the space between us. The words I’d spoken circled restlessly in my mind, taunting me with how pathetic I could be. I never wanted to be dependent on him, but I already was.\u003c/p\u003e\n\u003cp\u003e“I have to go,” I said hoarsely.\u003c/p\u003e\n\u003cp\u003e“Don’t hang up. For God’s sake, Eva, we’re married. We’re in love. There’s no shame in that. So what if it’s crazy? It’s us. It’s who we are. You need to come to grips with that.”\u003c/p\u003e\n\u003cp\u003eThe screen door squeaked as my dad stepped onto the porch. I looked at him and said, “My dad’s here, Gideon. I’ll have to talk to you later.”\u003c/p\u003e\n\u003cp\u003e“You make me happy,” he said, in the deep firm tone he used when making an unswayable decision. “I’d forgotten what that feels like. Don’t devalue what you mean to me.”\u003c/p\u003e\n\u003cp\u003eGod.\u003c/p\u003e\n\u003cp\u003e“I love you, too.” I ended the call and set the phone down on the table with a shaky hand.\u003c/p\u003e\n\u003cp\u003eMy dad settled into the other chair with his coffee. He wore long shorts and a dark olive T-shirt, but his feet were bare. He’d shaved and his hair was still damp, the ends curling slightly as they dried.\u003c/p\u003e\n\u003cp\u003eHe was my father, but that didn’t stop me from appreciating the fact that he was ridiculously attractive. He kept himself in great shape and had a naturally confident bearing. I could see why my mother hadn’t been able to resist him when they’d met. And apparently still couldn’t.\u003c/p\u003e\n\u003cp\u003e“I heard you talking,” he said without looking at me.\u003c/p\u003e\n\u003cp\u003e“Oh.” My stomach dropped. It was bad enough spilling my guts to Gideon. Knowing that my dad had heard me do it only made it worse. \u003c/p\u003e","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-8.html","bookId":1816,"creation":"Oct 5, 2019 5:07:14 PM","modification":"Oct 5, 2019 5:07:14 PM"}
