{"id":8854,"no":21,"title":"CHAPTER XXI A MINING SETTLEMENT IN MONTANA","content":"\u0026nbsp;Campville was a small mining settlement in Montana. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All the buildings were of a temporary character—generally of one story. There was a long street, after the fashion of most western-pioneer settlements, but the houses on it were not many. The largest was a general store for the sale of such articles as miners need. It was kept by one Joe Loche. He came from Maine to Montana, mined for a while with indifferent success, and then opened a store. This was a business he knew something about, and he succeeded almost immediately. His store was a general rendezvous of miners in the intervals of work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One morning, when four or five persons were in Loche\u0027s store, sitting around on kegs, a young man of about thirty entered. He had a long, thin face and roving eyes, and looked like one whom a prudent man would not care to meet on a dark night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered the store and looked about him curiously. He was a stranger in the settlement, and his glances were returned with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mornin\u0027 stranger!\" said Loche, who always had an eye for a possible customer. \"What can I do for you? What did you say your name was?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This curt answer produced an unfavorable impression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon you\u0027ve got a name, ain\u0027t yer?\" said Joe, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. My name is Ralph Nixon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The statement was received with surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Any relation to old Tom Nixon, who lives on the hill?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question, asked by Joe Loche, voiced the question which all wished to ask.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is my uncle. Can you tell me about him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The old man is pretty sick,\" said Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Like to die?\" asked Ralph, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, well, I don\u0027t know. Men that are always dying live for years sometimes. Haven\u0027t you seen him lately?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I never saw him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He came West when I was a baby.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you come out to see him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I thought the old man might need some one to look after him. Has he got any money—enough to live on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon so. He\u0027s interested in some mines at Eldorado, but he stays in an old tumble-down cabin, and it doesn\u0027t cost him anything to live.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where does he live?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come out and I\u0027ll show you. About a quarter of a mile back of the settlement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph followed Joe Loche out of the store, and received directions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he owns some mines, does he?\" asked the young man, with a covetous gleam in his small, bead-like eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They ought to be worth something,\" he said, meditatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, the old man may be worth near five thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does he live alone?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, quite alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose he was never married?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he has never written East since he left us. It was only lately that we learned where he was. Then father thought I\u0027d better come out here and look him up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon he will be glad to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He ought to be; but I am a stranger to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t seen him round town lately. I guess he\u0027s under the weather.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe went back into the store, and Ralph Nixon made his way over the rough ground to the old cabin which had been pointed out to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shouldn\u0027t wonder if he were a miser,\" he reflected. \"He\u0027s been out here twenty-five years, more or less, and has lived on next to nothing. Even if he hasn\u0027t made much he\u0027s got it all, according to accounts. I\u0027m the only one of his kith and kin that he is likely to see, and he can\u0027t do any better than to leave me what he\u0027s got. If he doesn\u0027t, I\u0027ll stay out here and try my own luck at mining. There\u0027s no chance for me in the East, even if I hadn\u0027t got into trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He reached the cabin, and paused for a short time on the outside. It was a tumble-down affair, and looked by no means like the residence of a rich man. This might have dampened Ralph\u0027s courage, but that he had made up his mind that his uncle was a miser.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally he edged round to the side of the cabin and looked in at the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What he saw was this: in a wooden chair, evidently of home manufacture, sat a decrepit old man. His face was thin, his cheeks hollow, and his hair, perfectly white, scarcely covered his head. His limbs were attenuated, his chest was hollow, and he looked like a very old and infirm man, though he numbered but sixty-five years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a skeleton he is!\" thought Ralph. \"He is just on the verge of the grave, ready to tumble in. It\u0027s a lucky thing I came here, for if he had died those roughs at the store would have taken his money and his relations would never have been the wiser. Well, I\u0027ll go in and scrape acquaintance with the old effigy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He walked round to the door, and without the ceremony of knocking, opened it and made his way into the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thomas Nixon looked up, and seemed alarmed when he saw the intruder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who are you?\" he asked, in a thin, quavering voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was natural that he should be alarmed, for a western mining settlement has generally its share of rough and unscrupulous men, social outlaws, who have made their way thither in search of gain or booty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be alarmed, Uncle Thomas,\" said Ralph, in a reassuring tone. \"I am your nephew Ralph, come from the East to look after you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know of no Ralph. Whose son are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father is Gideon Nixon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My oldest brother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you know where I lived?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A man came to Stamford who had been here. Learning my name, he told us he knew a man named Nixon out here. He said you were old and feeble, and father thought I had better come out and look you up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wasn\u0027t worth while. I am a poor old man, and I can do you no good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you poor?\" asked Ralph, his tone betraying his disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look around you and judge for yourself,\" returned the old man, eying his nephew with a glance of mingled curiosity and shrewdness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was told in the village that you were interested in some mines.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My affairs are known only to myself. If you have come out to help me and supply my old age with comfort, it is a kind and charitable object.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph was much disturbed by these words. He was very much afraid that his uncle was nearly as poor as he claimed. In that case his errand would be bootless. But, looking about him with a feeling of discontent, his eye fell on a tin box such as may be found in grocery stores filled with crackers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll find out what there is in that box,\" he decided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Without answering the old man, he rose, and moving toward the box, lifted the lid.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you doing?\" asked Mr. Nixon, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph did not answer. He had something else to think of. The box was a third full of glittering gold pieces, upon which he gazed as if fascinated.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2987/82361.html","bookId":325,"creation":"Aug 2, 2019 1:46:29 AM","modification":"Aug 2, 2019 1:46:29 AM"}
