{"id":8837,"no":4,"title":"CHAPTER IV THE LOST LETTER","content":"\u0026nbsp;Mrs. Lane\u0027s early life had been embittered by poverty, both before and after her first marriage. It was for this reason she married Mr. Lane, and for this reason also that she rejoiced in the possession of his property. She meant to make up for past privations by living liberally. Already she contemplated a series of journeys with her own son. As for Gerald, she had always disliked him, having an instinctive feeling that he distrusted and disliked her. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Lane\u0027s property was, except the home property, invested in stocks, bonds and bank deposits, and the task of an executor was therefore easy. She had lost no time, after her husband\u0027s death, in making an estimate of the value of the estate. Almost daily she opened the tin box of securities and looked them over. It was a feast for her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After her failure with Gerald\u0027s trunk she gave a few minutes to this congenial task. When it was over a look of pleasure lighted up her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifty thousand dollars!\" she said to herself. \"That is, indeed, a windfall for one who, till two years since, was compelled to subsist on an income of less than twelve dollars a week. The arrangements I have made for Gerald will prevent his being much expense to me, and my husband\u0027s fortune will be under my own control. Within a few hours my son—my dear Abel—will be here, and there will be no further need of concealing his existence. Had Mr. Lane known that I had a son as old as his own it is doubtful if he would have married me. Well, it is all over now! And I shall have Abel with me hereafter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From the bottom of the tin box she drew out a folded paper. It was in Mr. Lane\u0027s handwriting, and was addressed \"To the Executor.\" It ran thus: \"There is a possible claim against my estate, of which it is imperatively necessary that I should speak. Five years since my old friend and school-fellow, John Graves, on the eve of his departure for Australia, placed in my hands, for safekeeping, his entire fortune amounting to thirty thousand dollars. His wife had died; he had no heirs, and he had made up his mind to take a long journey to occupy his mind, and if possible assuage his grief. \u0027I may never come back,\u0027 he said, \u0027and in that case, old friend, the money I leave with you becomes yours. I could not leave it better than to my old schoolmate and friend.\u0027 I was touched by this proof of his confidence in me and assumed the trust. From time to time I heard of him, but for two years no tidings have come of the wanderer. Whether he is still living I cannot tell. If dead, the property is mine. It will more than double any estate I may leave; but I cannot be certain. I sincerely hope that John is still alive. Though two years have passed, he is liable to return at any time and reclaim the sum he placed in my hands. Should this claim be made after my death, it will be the sacred duty of my executor to give him back his own. Even if he has lost the acknowledgment I gave him, this property must be given up on his proving his identity. There will still be left of my own property a sum sufficient to support those whom I leave behind me in modest style.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the paper, signed by Ernest Lane, which Mrs. Lane read with frowning brow. It was the one drop of bitterness in her cup.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thirty thousand dollars!\" she reflected. \"Why, that would leave me only twenty thousand. It would be insufficient to carry out my plans. Probably this man Graves is dead; but should he reappear it would be a terrible disappointment. The money must and shall remain in my possession! I will deny the claim if it is ever made. But should this paper be found—should it remain in evidence—this would be impossible. Better destroy it. It is the only safe way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She locked the box of papers and put it in the safe. The important paper she was about to take and dispose of when there was a cry of terror in the kitchen. Laying the paper on the table temporarily, she ran down-stairs to find that a fierce dog had made his way into the kitchen to the great alarm of the cook. Mrs. Lane was no coward. She seized a broom, and with well-directed blows drove the animal out. Then she went up-stairs to destroy the message from Mr. Lane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was gone!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In much perturbation, Mrs. Lane looked for it. The window was open, and it might have been blown out. With this idea in mind she went out on the lawn and searched carefully, but in vain; the missing paper was nowhere to be found.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Lane sank into a chair in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a fool I was not to take it with me!\" she said to herself. \"I would have destroyed it and no one would have been the wiser. Now, should it fall into the hands of some third person it may be used to my detriment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again she hunted about the room, and searched the lawn. It certainly was very mysterious. She had been gone less than five minutes, yet the paper had disappeared and there was no trace of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If some child found it he would probably tear it up, and this would answer my purpose,\" she thought, \"and all would be safe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked about, hoping to see some child near at hand, but none was visible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Toiling along the road at a little distance was a man, whose outward appearance and shabby habiliments proclaimed him a tramp. Mrs. Lane\u0027s glance fell upon him, but did not connect him with the lost document. Yet it could have been found in one of his inside pockets, where he had carefully placed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This is the way it happened:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mrs. Lane left the room two windows were open, making a draught through the room. In a line between the windows was the table on which she had placed the letter. Scarcely had Mrs. Lane gone down-stairs when the wind, in a frolicsome mood, lifted the paper and wafted it through the front window on the lawn outside. James Skerrett, the tramp, spied it from the road, and it occurred to him that it might be of some value. He entered the gate and a few steps brought him to the paper. He picked it up and put it in his pocket, not as yet knowing what it was. It might, however, be worth something, and it was on the chance of this that he took it. He did not stop to examine it lest he should be observed. Time enough for that later. Indeed, he did not venture upon this till he was a quarter of a mile away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though a tramp, James Skerrett had received a fair education, and was a man of some intelligence. He was qualified to earn a good living in some respectable position, but drink was his enemy and was likely to be through his life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he read the letter, he guessed correctly that it was of importance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will the woman give me anything for it if I return it?\" he asked himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It hardly seemed likely. It would be better for her, perhaps, if it were destroyed. Besides, he had seen her through the open window, and her face had impressed him as that of a very mean woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She would be more likely to charge me with stealing and threaten me with arrest,\" he thought. \"What shall I do? Shall I keep it? That would not pay me, as I may never come this way again. If I could get some one to take it and allow me even a dollar for it, it would be better to get it off my hands at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This thought was strengthened by the knowledge that his whole available stock of money amounted to but seven cents. Lifting his eyes casually, his glance rested on a sign over a small office building on the opposite side of the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the sign:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Enoch Perkins,\n\u003c/div\u003e \n\u003cdiv\u003e\n Attorney-at-Law\n\u003c/div\u003e \n\u003cdiv\u003e\n As a rule, the tramp avoided any person who had any connection with the law, but he was about to pose as a virtuous man returning lost property. Again, a lawyer would know the worth of the paper. At any rate he decided to call upon him and open negotiations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Perkins was sitting at his desk making out a conveyance, when he heard a furtive step at the door of his office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lifting his eyes, he noticed James Skerrett opening the door, with an apologetic look upon his face. Now, a client was always welcome, for Mr. Perkins was a young man, and his business was as yet limited. But the visitor did not look like a client.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want, my man?\" he asked, rather gruffly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you a lawyer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; do you want me to make your will?\" asked Perkins, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, no; not at present. I expect to live a little longer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so. Still, life is uncertain, and if you should die suddenly your property might go into the wrong hands.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so, squire; but I guess there\u0027s no hurry about my will. I wanted to ask your advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly. I am ready to give it for a consideration.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you\u0027re a sharp one!\" said the tramp. \"But I\u0027ll come to the point. I was walkin\u0027 along the street five minutes since, when I saw a folded paper on the sidewalk. I picked it up and I\u0027ll show it to you, for I think the party that lost it might be willin\u0027 to pay me somethin\u0027 for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Enoch Perkins took the paper from his strange client. As he unfolded and read it, he looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did you pick this up?\" he asked, abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little way down the road.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Near a house with two elm trees in front?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" replied Skerrett, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I know the party that lost it. I will take charge of it and return it to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, squire; but there may be a reward.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly. Well, you ought to have some thing for picking it up. Here\u0027s a dollar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said Skerrett, taking the bill with avidity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you are only passing through the town?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t mention finding the paper; it might annoy the lady who lost it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; I\u0027ll remember, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left the office, and the lawyer said to himself:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will keep this letter. It may be worth a good deal to me some time.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2987/82344.html","bookId":325,"creation":"Aug 2, 2019 1:45:41 AM","modification":"Aug 2, 2019 1:45:41 AM"}
