{"id":8842,"no":9,"title":"CHAPTER IX A LUCKY RESCUE","content":"\u0026nbsp;There was no time lost in reaching shore. Gerald and Mr. Crane jumped from the boat and ran to the house. It was a large, handsome house, and presumably the home of a rich man. Most of the houses in Portville were of two stories, but this consisted of three. Alonzo opened the front door, followed closely by Gerald. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the hall was a maid-servant, who was wringing her hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is the fire?\" asked Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the third floor. Poor Mr. Nugent——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, where is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the room where the fire broke out. He is in a faint. He will be suffocated!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alonzo Crane was captain of the fire company in Hillsdale, and had all his wits about him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Follow me, Gerald,\" he said, as he dashed up-stairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He attempted to open the door of the room from the windows of which he had seen the smoke pouring, but Mr. Nugent\u0027s body was lying on the floor in such a position as to prevent the door being opened. But the two, by pushing forcibly, succeeded in getting it open. The muslin curtains of the front windows were in a blaze, and the flames had spread to the neighboring woodwork.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tear down the curtains, Gerald,\" said Mr. Crane. \"You will soon have help. I hear the engine outside. I will attend to the old gentleman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With the strength which might naturally be expected from a blacksmith, he took up the old man in his arms, and carried him down-stairs. It was none too soon. Mr. Nugent was in a faint, and was half-suffocated by the smoke. On his way Alonzo met some of the Portville firemen, whom he directed to the room. Taking the old gentleman down-stairs he laid him on a couch in the sitting-room and summoned the servant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bring me a sponge and some cold water,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were brought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bathed the face of the old man, who presently opened his eyes and said, feebly: \"Where am I?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re in the land of the living, squire,\" answered Crane; \"but you wouldn\u0027t have been long if I hadn\u0027t taken you out of the burning room. Do you know how the fire started?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was my fault,\" said Mr. Nugent, feebly. \"I was lighting my pipe, when I began to feel sick. The match must have ignited the curtains. I staggered to the door, but could go no farther. I sank to the floor, and I remember no more. Is the fire still burning?\" he asked, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The firemen are here, and it will soon be out. Here is some one who will tell us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point Gerald entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is the fire out?\" asked Alonzo.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It soon will be. The firemen are busy in the room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I wish there were a doctor here. I feel overcome!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will call one immediately,\" said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left the room quickly, and soon returned with Dr. Barlow, the village physician.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Nugent,\" he said, \"have you been trying to burn yourself up?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not trying, but I nearly succeeded.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor by a few simple remedies soon relieved his patient. Then he asked: \"Who discovered the fire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Crane and I saw it from the lake?\" answered Gerald. \"We got here as quickly as possible, and found Mr. Nugent lying helpless on the floor of his room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He must have been nearly suffocated. In all probability had you been less prompt he would have died.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To whom am I indebted for my rescue?\" asked the old gentleman. \"The boy I know—it is Gerald Lane—but this gentleman is a stranger to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is the brother of my stepmother,\" said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am deeply indebted to you both. I am not able to make proper acknowledgment now, but will you both come over this evening, when I shall be better?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad to come, squire,\" said the blacksmith; \"Gerald will come too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is this Mr. Nugent?\" asked Mr. Crane, when they reached the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has lived in Portville for some years, but not much is known of him, except that he has the reputation of being very rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did your father know him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As well as any one in the village. I think he consulted father about his affairs occasionally.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, the old gentleman came near passing in his checks this afternoon. He don\u0027t look very rugged. How old is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sixty or more, I should think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How does he pass his time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has a large library and is very fond of reading. He takes many magazines and papers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s easier than bein\u0027 a blacksmith, Gerald.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you be willing to pass your time in the same way, Mr. Crane?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon not. I ain\u0027t very fond of readin\u0027. It makes me sleepy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Probably he would not care to be a blacksmith.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alonzo Crane laughed at the idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t give him twenty-five cents a day for his work,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they reached the house they found that Abel and his mother had returned. In half an hour supper was served.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you pass the time, Alonzo?\" asked his sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I went out rowing with Gerald. Then I took a hand at puttin\u0027 out a fire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where was it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was John Nugent\u0027s house,\" said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did it catch fire? Was much damage done?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These questions were answered partly by Gerald, partly by the blacksmith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know Mr. Nugent,\" said Mrs. Lane. \"He doesn\u0027t go anywhere. Mr. Lane visited him occasionally. He has very few visitors.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will have two this evening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Lane looked an inquiry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has invited Gerald and me to call upon him?\" explained the blacksmith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Lane looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is something unusual,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Crane probably saved his life,\" said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I don\u0027t know,\" said Alonzo, modestly. \"You see I am used to bein\u0027 at fires. I am captain of the Hillsdale fire company,\" he added, with an intonation of pride.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t want to be a fireman,\" said Abel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Firemen are low.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t think so if you are ever in a burning house, Abel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are a very useful class of people,\" said Mrs. Lane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wouldn\u0027t want me to be a fireman, ma, would you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, perhaps not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might be something a great deal worse, nephew,\" said the blacksmith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has Mr. Nugent no family?\" asked Mr. Crane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has a grandson about my age, but he is at a boarding-school somewhere,\" answered Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About half-past seven Gerald rang the bell at Mr. Nugent\u0027s residence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was opened by the servant-maid whom they had seen in the afternoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come in,\" she said, without waiting for them to speak. \"The master is up-stairs in the library.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t got any library in my house, Gerald,\" said the blacksmith, jocosely. \"I hope he won\u0027t tackle me on books.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They found Mr. Nugent sitting in a large easy-chair beside the library table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see you both,\" he said, cordially, offering his hand. \"Our acquaintance has been formed under circumstances very favorable to myself. I am very much indebted to you, Mr. Crane.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it ain\u0027t worth talkin\u0027 about, squire,\" said the blacksmith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem to set a small value on my life, Mr. Crane,\" said the old gentleman, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I don\u0027t mean that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand. You are only showing your modesty. Now let me tell you why I have invited you here. You have placed me under a great obligation. Now can I do anything for you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alonzo\u0027s face lighted up with a sudden idea. But he did not quite like to express it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t like to trouble you, Mr. Nugent,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then there is something. Let me know what it is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, the fact is, squire, I came to Portville to ask my sister—that\u0027s Mrs. Lane—if she would lend me two hundred dollars to rebuild my shop that was badly injured by fire last week, but she says she can\u0027t do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much money do you require, Mr. Crane?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I could manage on two hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your given name?\" asked Mr. Nugent, drawing a check-book from a desk on the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Alonzo Crane is what people call me in our village.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Nugent took the pen and filled out a check, which he passed over to the blacksmith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three hundred dollars!\" ejaculated Alonzo in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; if that isn\u0027t enough, let me know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll set me on my feet,\" said Mr. Crane, his plain face shining with delight. \"I\u0027ll pay it back as soon as I can, squire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite unnecessary, Mr. Crane,\" said the old gentleman, with a pleasant smile. \"I consider your service quite worth three hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The blacksmith tried to thank Mr. Nugent, but the old gentleman prevented him by turning to Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How soon are you going to college, Gerald?\" he asked.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2987/82349.html","bookId":325,"creation":"Aug 2, 2019 1:45:58 AM","modification":"Aug 2, 2019 1:45:58 AM"}
