{"id":102884,"no":23,"title":"Page 23","content":"\u003cp\u003eDragging her carry-on behind her, she was following her fellow passengers onto the escalator when her phone beeped, indicating she had a text message. Assuming it was one of her parents, she didn’t immediately check. About halfway up, she glanced at her phone and saw that the text was from Finn. It shook her up so badly that she dropped the phone. Carrie watched in horror as it went tumbling down the escalator steps. “Please, someone grab that for me!” she cried out in a panic.\u003c/p\u003e\n\u003cp\u003e“Got it,” a woman at the bottom shouted back to her.\u003c/p\u003e\n\u003cp\u003eAs soon as Carrie reached the top, she hurriedly circled around and leaped onto the opposite escalator, racing down the steps, unwilling to stand and wait. The woman remained at the bottom and handed the cell back to her.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Carrie whispered, grabbing hold of it. “Thank you so much.”\u003c/p\u003e\n\u003cp\u003eHer heart raced at a frantic speed as she opened Finn’s text.\u003c/p\u003e\n\u003cp\u003eWhy won’t you write the article?\u003c/p\u003e\n\u003cp\u003eHer fingers moved in a blur as she typed her response. I would be happy to.\u003c/p\u003e\n\u003cp\u003eGood.\u003c/p\u003e\n\u003cp\u003eOnce you give me a face-to-face interview.\u003c/p\u003e\n\u003cp\u003eHis response was immediate. Not going to happen.\u003c/p\u003e\n\u003cp\u003eThen get someone else. She didn’t expect Finn to be thrilled with her stipulation. Seeing her again was the last thing he wanted, because it was sure to be difficult to answer her questions, and, even more so, to send her away.\u003c/p\u003e\n\u003cp\u003eShe waited for a response, but none came.\u003c/p\u003e\n\u003cp\u003eHaving collected her bag, Carrie was standing in the cold outside the airport, waiting to be picked up by her mother, when she heard the ping indicating Finn had responded. Why are you so stubborn?\u003c/p\u003e\n\u003cp\u003eAn involuntary smile came over her as she rushed to answer. Because you lied. You love me.\u003c/p\u003e\n\u003cp\u003eFinn didn’t deny or confirm her text, not that she’d expected he would. After a couple of moments, Carrie placed her phone inside her purse. The ache in her heart was back, stronger than ever. This could quite possibly be the last communication she might ever have with Finn. The thought sent her Christmas spirits spiraling downward.\u003c/p\u003e\n\u003cp\u003eHer mother pulled up to the airport curb, and after sticking her bags in the backseat, Carrie climbed inside the vehicle.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you’re home,” her mother said, and they briefly hugged.\u003c/p\u003e\n\u003cp\u003e“I am, too,” Carrie assured her. They drove off, heading to the family home, where her brother, his wife, and his children would be waiting. Soon they’d all be gathered around the table, and there would be laughter and conversation. Finn had never known this, and Carrie hungered to share her family with him.\u003c/p\u003e\n\u003cp\u003e“You okay, honey?” her mother asked, as they merged into the heavy freeway traffic. “You don’t look so well. It’s Finn, isn’t it?”\u003c/p\u003e\n\u003cp\u003eCarrie nodded.\u003c/p\u003e\n\u003cp\u003e“How much weight have you lost?”\u003c/p\u003e\n\u003cp\u003eCarrie shrugged. “A few pounds is all.”\u003c/p\u003e\n\u003cp\u003eReaching over, her mother gave Carrie’s hand a gentle squeeze. “Mark my words, it will all work out.”\u003c/p\u003e\n\u003cp\u003eCarrie desperately wanted that to be true. Everything seemed so hopeless at the moment.\u003c/p\u003e\n\u003cp\u003e“Time is the great healer,” her mother assured her.\u003c/p\u003e\n\u003cp\u003eShe’d spent an hour on the phone with her mother shortly after her breakup with Finn, pouring out all her hurt and fears. Patty Slayton hadn’t offered empty reassurances or reminded Carrie of her own concerns over this relationship; instead, she’d simply listened. At the end she’d said, “You really do love him, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes.” There was no doubt in Carrie’s mind. Finn Dalton owned her heart. He carried it with him, and now the question, the real question, was what he intended to do with it.\u003c/p\u003e\n\u003cp\u003e“We’re just glad you’re home for the holidays,” her mother said, pulling her back into the present.\u003c/p\u003e\n\u003cp\u003e“So am I.” Carrie didn’t mention that she might be returning to Seattle on a more permanent basis. For the first time since she’d spoken to Nash, she actually considered caving in. That was what Finn wanted her to do in an effort to ease his conscience. He could break her heart and then walk away without guilt because he’d done her a good turn. Writing that blasted article was what everyone hoped she’d do.\u003c/p\u003e\n\u003cp\u003e“I need to run an errand in the morning,” Carrie casually mentioned once she was home and had emptied her suitcase. Dinner was over and her brother and family had returned to their home. “Do you mind if I borrow the car?” she asked her parents.\u003c/p\u003e\n\u003cp\u003e“You going to run off to Alaska?” her father asked.\u003c/p\u003e\n\u003cp\u003e“Nick Slayton,” her mother hissed in a low, warning breath.\u003c/p\u003e\n\u003cp\u003e“Well, if Carrie is going to break up with Finn Dalton, why can’t she do it after we have a chance to meet him?”\u003c/p\u003e\n\u003cp\u003eBoth her mother and Carrie ignored the comment.\u003c/p\u003e\n\u003cp\u003e“I doubt very much that I’ll be going to Alaska,” Carrie said.\u003c/p\u003e\n\u003cp\u003e“Of course you can take the car.” Her mother cast her a questioning glance. “I don’t have any plans for the morning.”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t be gone more than an hour or two,” Carrie assured her.\u003c/p\u003e\n\u003cp\u003eFirst thing the next morning, Carrie contacted Finn’s mother and they set a time to meet. Joan had the front door open before Carrie had reached the end of the short walkway.\u003c/p\u003e\n\u003cp\u003eThe older woman held open the screen door. They briefly hugged before Joan brought Carrie into the house. Her tree was up and decorated with festive ornaments, and her fireplace mantel displayed a wooden Nativity scene. Joan indicated that Carrie should take a seat on the sofa. Finn’s mother had a teapot and two cups out, along with a plate of decorated sugar cookies.\u003c/p\u003e\n\u003cp\u003e“Finn used to help me decorate the cookies every Christmas,” she said as they sat next to each other on the sofa. “He enjoyed it, although his father feared I was turning him into a sissy. My goodness, the boy was only four years old.”\u003c/p\u003e\n\u003cp\u003eJoan handed her a cup of freshly poured tea, which Carrie accepted, holding on to the tiny saucer with one hand and the teacup with the other.\u003c/p\u003e\n\u003cp\u003e“Have you heard from my son?” Joan asked.\u003c/p\u003e\n\u003cp\u003e“Just briefly.” There’d been nothing since their quick text exchanges late yesterday afternoon.\u003c/p\u003e\n\u003cp\u003e“It sounds like Finn is as stubborn as his father.”\u003c/p\u003e\n\u003cp\u003eCarrie was afraid that was the case.\u003c/p\u003e\n\u003cp\u003eJoan exhaled as though emotionally bracing herself for what was coming. “You brought Paul’s wedding band back to me?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m so sorry. I tried.”\u003c/p\u003e\n\u003cp\u003e“I know, dear. I should never have put you in such an awkward position.”\u003c/p\u003e\n\u003cp\u003eCarrie disagreed. “I doubt I could have convinced anyone to fly me to Finn’s cabin without it, so the ring served a purpose.” She dug it out of her purse, and with regret returned it to Finn’s mother, feeling like she’d failed her.\u003c/p\u003e\n\u003cp\u003eJoan’s eyes revealed her disappointment. “I so hoped …”\u003c/p\u003e\n\u003cp\u003e“I know; I did, too.”\u003c/p\u003e\n\u003cp\u003e“I’m confident Paul went to his grave loving me. Unfortunately, pride prevented him from letting me know he wanted me back. He was unwilling to compromise. It could only be his way.”\u003c/p\u003e\n\u003cp\u003eCarrie feared Joan might be right and Finn was like his father. He, too, would be willing to walk away from her and not look back.\u003c/p\u003e\n\u003cp\u003eThey sipped their tea in silence for several moments while Carrie gathered her thoughts. “I’d appreciate your help with something.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eCarrie reached into the bag she’d brought along with her. “I need you to tell me what this is.” She brought out the Christmas gift Finn had left under her Christmas tree. Unable to wait any longer, Carrie had unwrapped his gift before she left Chicago, but she didn’t have a clue as to what it might be. It was a narrow stick of what appeared to be fossilized ivory and was about twenty inches in length.\u003c/p\u003e\n\u003cp\u003eThe night before, Carrie’s father had taken a look at it and shook his head. He didn’t have an answer for her.\u003c/p\u003e\n\u003cp\u003eJoan reached for the object and released a soft “Oh, my.”\u003c/p\u003e\n\u003cp\u003e“What is it?” Carrie asked.\u003c/p\u003e\n\u003cp\u003eJoan reverently ran her hand down the piece, and then raised her eyes to Carrie’s. “My son gave you this for Christmas?”\u003c/p\u003e\n\u003cp\u003e“Yes. What can you tell me about it?”\u003c/p\u003e\n\u003cp\u003eJoan nodded. “It’s an oosik.”\u003c/p\u003e\n\u003cp\u003e“Which is?” This wasn’t helping.\u003c/p\u003e\n\u003cp\u003e“It’s a walrus penis bone.”\u003c/p\u003e\n\u003cp\u003eCarrie gasped. “A what?”\u003c/p\u003e\n\u003cp\u003eJoan laughed at the look that came over Carrie. “Leave it to my son.”\u003c/p\u003e\n\u003cp\u003e“He gave me a toaster and a walrus penis bone?”\u003c/p\u003e\n\u003cp\u003e“This one is rather rare, though, if it’s the same one Paul got all those years ago from an elderly Alaskan native.”\u003c/p\u003e\n\u003cp\u003e“An oosik?” Carrie repeated, the word unfamiliar on her tongue.\u003c/p\u003e\n\u003cp\u003e“This one is a fossilized baculum and comes from an extinct walrus. They’re highly collectible for Alaskan art. It was one of Paul’s most prized possessions. At the time, and remember, this was many years ago, it was valued at around twenty thousand dollars.”\u003c/p\u003e\n\u003cp\u003e“Why would Finn give it to me?” She wanted to clasp it to her breast, but that wouldn’t bring Finn back.\u003c/p\u003e\n\u003cp\u003e“Isn’t it obvious, my dear? He loves you.”\u003c/p\u003e\n\u003cp\u003eIt was too valuable, and it clearly held sentimental value to Joan. “I can’t keep this,” she said sadly, her mind made up. “I’d rather you take it.”\u003c/p\u003e\n\u003cp\u003eAutomatically, Joan shook her head. “Finn wanted you to have it.”\u003c/p\u003e\n\u003cp\u003e“Please,” Carrie whispered. “It should stay with you. And if by chance Finn and I …” Her voice caught, and she had to stop talking for fear her emotions might overwhelm her. “If Finn and I,” she repeated, “manage to get back together, then you can save it to give to one of your grandchildren.”\u003c/p\u003e\n\u003cp\u003eJoan’s eyes filled with unshed tears, and she slowly nodded.\u003c/p\u003e\n\u003cp\u003eDeep down, Carrie believed she wouldn’t hear from Finn again. She’d played her hand, laid down her cards, and her ploy had failed. Finn was unwilling to meet her face-to-face for an interview or anything else. He couldn’t look her in the eye and say the things he had to her while in her kitchen, and they both knew it.\u003c/p\u003e\n\u003cp\u003eChristmas Eve day Carrie helped her mother get everything ready for their annual Christmas buffet. Instead of the big traditional dinner, complete with turkey and stuffing plus all the fixings, her mother served a multitude of longtime family favorites: several salads, casseroles, fried chicken, deviled eggs, and a ham, plus a wide variety of desserts.\u003c/p\u003e\n\u003cp\u003eOn Christmas Day, friends and family would stop by to partake. Carrie always enjoyed this special time working in the kitchen with her mother. It seemed the most important discussions of her life had taken place in front of the stove or the refrigerator.\u003c/p\u003e\n\u003cp\u003eCarrie sliced the cooked potatoes for the potato salad, her father’s favorite, when her mother unexpectedly came to her and hugged her. “I know how hard this year has been for you, honey. Your heart is aching.”\u003c/p\u003e\n\u003cp\u003e“I love him, Mom.”\u003c/p\u003e\n\u003cp\u003e“Talking about him might help. Do you want to tell me what it is that you find so compelling about Finn Dalton?”\u003c/p\u003e\n\u003cp\u003eDiscussing her feelings was exactly what Carrie needed. Everyone else seemed to tiptoe around anything having to do with Finn, afraid to bring up any reference to him. Carrie realized they were simply looking to protect her, but Finn had become the subject everyone had chosen to ignore. \u003c/p\u003e","sourceLink":"https://allnovel.net/starry-night/page-23.html","bookId":2634,"creation":"Oct 5, 2019 10:17:51 PM","modification":"Oct 5, 2019 10:17:51 PM"}
