{"id":23561,"no":11,"title":"THE VEILED MIRROR.","content":"\u0026nbsp;The old year was fast drawing to a close. But a few hours, and the advent of its successor would be hailed by merry shouts and joyful gratulations, mingling with the merry chime of bells ringing out a noisy welcome from church-towers and steeples. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Adam Hathaway, a wealthy merchant, sat in his counting-room, striking a balance between his gains and losses for the year which had nearly passed. From the smile that lighted up his countenance, as he drew near the end of his task, it might safely be inferred that the result proved satisfactory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He at length threw down his pen, after[97] footing up the last column, and exclaimed joyfully,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five thousand dollars net gain in one year! That will do very well,—very well indeed. If I am as well prospered in the year to come, it will indeed be a ‘happy New Year.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His meditations were interrupted by a knock at the door. He opened it, and saw standing before him a man of ordinary appearance, bearing under his arm something, the nature of which he could not conjecture, wrapped up in brown paper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Hathaway, I believe?” was the stranger’s salutation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are correct.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps, if not particularly engaged, you will allow me a few minutes’ conversation with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, certainly,” was the surprised reply; “though I am at a loss to conjecture what can have brought you here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [98]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a wealthy man, Mr. Hathaway, and every year increases your possessions. May I ask what is your object in accumulating so much property?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a very singular question, sir,” said the merchant, who began to entertain doubts as to his visitor’s sanity,—“very singular. I suppose I am influenced by the same motives that actuate other men,—the necessity of providing for my physical wants, and so contributing to my happiness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And this contents you? But your gains are not all devoted to this purpose. This last year, for example, the overplus has amounted to five thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know not where you have gained your information,” said Mr. Hathaway, in surprise. “However, you are right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what do you intend to do with this?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are somewhat free with your questions,[99] sir. However, I have no objection to answering you. I shall lay it up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For what purpose? I need not tell you that money, in itself, is of no value. It is only the representative of value. Why, then, do you allow it to remain idle?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How else should I employ it? I have a comfortable house well furnished: should I purchase one more expensive? My table is well provided: should I live more luxuriously? My wardrobe is well supplied: should I dress more expensively?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To these questions I answer, No. But it does not follow, because you have a good house, comfortable clothing, and a well-supplied table, that others are equally well provided. Have you thought to give of your abundance to those who are needy,—to promote your own happiness by advancing that of others?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must confess that this is a duty which I have neglected. But there are alms-houses[100] and benevolent societies. There cannot be much misery that escapes their notice,” said Mr. Hathaway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shall judge for yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger commenced unwrapping the package which he carried under his arm. It was a small mirror, with a veil hanging before it. He slowly withdrew the veil, and said, “Look!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A change passed over the surface of the mirror. Mr. Hathaway, as he looked at it intently, found that it reflected a small room, scantily furnished; while a fire flickered in the grate. A bed stood in one corner of the room, on which reposed a sick man. By the side of it sat a woman, with a thin shawl over her shoulders, busily plying her needle. An infant boy lay in a cradle not far off, which a little girl called Alice, whose wasted form and features spoke of want and privation, was rocking to sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you hear what they are saying?” asked the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [101]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The merchant nodded acquiescence. Immediately there came to his ear the confused noise of voices, from which he soon distinguished that of the sick man, who asked for some food.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We have none in the house,” said his wife. “But I shall soon get this work finished; and then I shall be able to get some.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The husband groaned: “Oh that I should be obliged to remain idle on a sick bed, when I might be earning money for you and the children! The doctor says, that, now the fever has gone, I need nothing but nourishing food to raise me up again. But, alas! I see no means of procuring it. Would that some rich man, out of his abundance, would supply me with but a trifle from his board! To him it would be nothing; to me, every thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The scene vanished; and gradually another formed itself upon the surface of the mirror.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [102]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a small room, neatly but not expensively furnished. There were two occupants,—a man of middle age, and a youth of a bright, intellectual countenance, which at present seemed overspread with an air of dejection.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Hathaway, to his surprise, recognized in the gentleman Mark Audley, a fellow-merchant and formerly intimate friend, who, but a few months before, had failed in business, and, too honorable to defraud his creditors, had given up all his property. Since his failure, he had been reduced to accept a clerkship.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry, Arthur,” said he to his son, “very sorry, that I could not carry out my intention of entering you at college. I know your tastes have always led you to think of a professional career; but my sudden change of circumstances has placed it out of my power to gratify you. It is best for you to accept the situation which has[103] been offered you, and enter Mr. Bellamy’s store. It is a very fair situation, and will suit you as well as any.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you are right, sir,” said Arthur, respectfully; “though it will be hard to resign the hopes that I have so long cherished. I met Henry Fulham to-day. He was in my class at school, and is to enter college next fall. I couldn’t help envying him. How soon will Mr. Bellamy wish me to enter his store?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Day after to-morrow, I believe,—that is, with the beginning of the year; New Year’s Day being considered a holiday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; you may tell him that I will come at that time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The scene vanished as before. A change passed over the surface of the mirror. Again the merchant looked, and, to his surprise, beheld the interior of his own store. A faint light was burning, by the light of which a young man, whom he recognized[104] as Frank Durell, one of his own clerks, was reading a letter, the contents of which seemed to agitate him powerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The scene was brought so near, that he could, without difficulty, trace the lines, written in a delicate, female hand, as follows:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear Son,—You are not, probably, expecting to hear from me at this time. Alas that I should have such an occasion to write! At the time of your father’s death, it was supposed, that, by the sacrifice of every thing, we had succeeded in liquidating all his debts. Even this consolation is now denied us. I received a call from Mr. Perry this morning, who presented for immediate payment a note given by your father for fifty dollars. Immediate payment! How, with a salary barely sufficient to support us, can you meet such a charge? Can any way be devised? Mr. Perry threatens, if the money is not forthcoming, to seize our furniture. He is a hard man, and I have no hopes of appeasing him. I do not know that you can do any thing to retard it; but I have thought it right to acquaint you with this new calamity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your affectionate mother,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mary Durell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [105]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man laid down the letter with an air of depression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I scarcely know how to provide for this new contingency,” said he, meditatively. “My salary is small; and it requires the strictest economy to meet my expenses. I might ask for an advance; but Mr. Hathaway is particular on that point, and I should but court a refusal. But to have my mother’s furniture taken from the house! The whole amount would hardly cover the debt. There is one resource; but alas that I should ever think of resorting to it! I could take the money from the till, and return it when I am able. But shall I ever be able? It would be no more nor less than robbery. At all events, I will not do it to-night. Who knows but something may turn up to help us?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man blew out the lamp, and left the store. The picture faded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show you another picture, somewhat[106] different from the others: it will be the last,” said the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next scene represented the interior of a baker’s shop. The baker—a coarse-featured man, with a hard, unprepossessing aspect—was waiting on a woman thinly clad in garments more suitable for June than December. She was purchasing two loaves of bread and a few crackers. There was another customer waiting his turn. It was a gentleman, with a pleasant smile on his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Make haste!” said the baker, rudely, to the woman, who was searching for her money to pay for her purchases. “I can’t stop all day; and here’s a gentleman that you keep waiting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh! never mind me: I am in no hurry,” the gentleman said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid,” said the woman, in an alarmed tone, “that I have lost my money. I had it here in my pocket; but it is gone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [107]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you may return the bread. I don’t sell for nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Trust me for once, sir; I will pay you in a day or two; otherwise my children must go without food to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t help that. You shouldn’t have been so careless.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman was about turning away, when the voice of the other customer arrested her steps.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much money have you lost?” he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was but half a dollar,” was the reply; “but it was of consequence to me, as I can get no more for a day or two; and how we are to live till then, Heaven knows.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps that will help you to decide the question.” And he took from his pocket a five-dollar bill, and handed it to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, sir!” said she, her face lighting up with gratitude, “this is indeed generous and noble. The blessings of those you have befriended attend you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [108]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She remained to make a few purchases, and then, with a light heart, departed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The last picture faded from the mirror; and the stranger, wrapping it up, simply said,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have seen how much happiness a trifling sum can produce. Will you not, out of your abundance, make a similar experiment?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger disappeared; and Mr. Hathaway awoke to find his dream terminated by the chime of the New Year’s bells.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is something more than a dream,” said he, thoughtfully. “I will, at all events, take counsel of the mystic vision; and it shall not be my fault if some hearts are not made happier through my means before another sun sets.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the merchant arose on the following morning, it was with the light heart which always accompanies the determination to do right. He was determined that[109] the salutation of “A happy New Year” should not be with him a mere matter of lip-service.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe,” said he to himself, “I will go and see my old friend, Mark Audley. If his son Arthur is really desirous of going to college, what is there to prevent my bearing the expenses? I am abundantly able, and can dispose of my money in no better way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he walked along with this praiseworthy determination in his heart, his attention was drawn towards a little girl, who was gazing, with eager, wistful eyes, into the window of a neighboring shop, where were displayed, in tempting array, some fine oranges. He thought—nay, he was quite sure—that in her he recognized the little girl who figured in the first scene unfolded the evening before by the mysterious mirror. By way of ascertaining, he addressed her in pleasant tone:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your name is Alice,—is it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [110]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said she, looking up, surprised, and somewhat awed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And your father is sick,—is he not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; but he is almost well now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw you were looking at the oranges in that window. Now, I will buy you a dozen, if you will let me help you carry them home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The purchase was made; and the merchant walked along, conversing with his little conductor, who soon lost her timidity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived at the little girl’s home, he found that he had not been deceived in his presentiments. It was the same room that he had seen pictured in the mirror. The sick man was tossing uneasily in bed when Alice entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “See, papa,” said she, joyfully,—“see what nice oranges I have for you! And here is the kind gentleman who gave them to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The merchant, before he left the humble[111] apartment, gave its occupants a timely donation, and made New Year’s Day a day of thanksgiving.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Hathaway soon found himself at the residence of his friend Audley, who gave him a warm welcome. “This is indeed kind,” said he. “The friendship that adversity cannot interrupt is really valuable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Hathaway now introduced the object of his visit, asking, “What do you mean to do with Arthur? He was nearly ready to go to college,—was he not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was; and this is one of the severest trials attending my reversed circumstances, that I am compelled to disappoint his long-cherished wish of obtaining a college education.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must not be,” said Mr. Hathaway. “If you and Arthur will consent, I will myself pay his charges through college.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Hathaway,” said Mr. Audley, in a glow of surprise and pleasure, “this offer[112] evinces a noble generosity on your part that I shall never forget. You must let me tell Arthur the good news.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Audley summoned his son, and, pointing to Mr. Hathaway, said, “This gentleman has offered to send you to college at his own expense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The eyes of the youth lighted up; and he grasped the hand of his benefactor, saying, simply, “Oh! if you but knew how happy you have made me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not deserve your thanks,” was the smiling reply. “I have learned that to make others happy is the most direct way to secure my own happiness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Hathaway took his way to the store. Arrived there, he sought out Frank Durell, and requested him to step into his office, as he wished to speak to him in private.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your salary is five hundred dollars a year, I believe?” said he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [113]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Frank Durell, somewhat surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have come to the conclusion that this is insufficient, and I shall therefore advance it two hundred dollars; and, as a part of it may not be unacceptable to you now, here are a hundred dollars that you may consider an advance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sir,” said Frank Durell, hardly believing his senses, “you cannot estimate the benefit I shall derive from this generosity. My mother, who depends upon me for support, was about to be deprived of her furniture by an extortionate creditor; but this timely gift—for I must consider it so—will remove this terrible necessity. I thank you, sir, from my heart.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are quite welcome,” said the merchant, kindly. “In future, consider me your friend; and, if you should at any time be in want of advice or assistance, do not scruple to confide in me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [114]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At least,” said the merchant, thoughtfully, “I have done something to make this a ‘happy New Year’ for others. The lesson conveyed in the dream of last night shall not be thrown away upon me. I will take care that many hearts shall have cause to bless the vision of The Veiled Mirror.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2956/81299.html","bookId":433,"creation":"Aug 2, 2019 8:15:49 PM","modification":"Aug 2, 2019 8:15:49 PM"}
