{"id":85091,"no":49,"title":"Page 49","content":"\u003cp\u003eI look up at him, losing myself in his dark, dark eyes.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe breathes in sharply. “Yes? You’re sure you want me? You know all of my monsters, Jace. You want me anyway?”\u003c/p\u003e\n\u003cp\u003eI nod, choking up. “I want you because of your monsters,” I tell him. “They’ve made you who you are, and I can’t imagine loving you any more than I do. I’ll want you every day of my life. That’s a promise.”\u003c/p\u003e\n\u003cp\u003eDominic smiles a gentle smile as he slips the ring onto my finger and pulls me into his side. He kisses me slowly and gently before he wraps his arm around my shoulders, and we watch the city passing beneath us.\u003c/p\u003e\n\u003cp\u003eAs we watch it, I think of everything that’s happened… to both of us. We’re both messed up in our own ways, but we’re both overcoming it. It’s a process, but we’re doing it. Everything that’s happened has made us stronger, individually and together.\u003c/p\u003e\n\u003cp\u003eLooking up at Dominic, I brush my fingers along his cheek.\u003c/p\u003e\n\u003cp\u003e“Are you happy? Yes or no?”\u003c/p\u003e\n\u003cp\u003eDominic looks down at me and I see a million promises in his eyes, a million forevers.\u003c/p\u003e\n\u003cp\u003e“Hell, yes.”\u003c/p\u003e\n\u003cp\u003eI smile.\u003c/p\u003e\n\u003cp\u003eThat’s all I needed to hear.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eJacey\u003c/p\u003e\n\u003cp\u003eI race through the tropical flowers, through the plants, and over the twisted path that leads to our little rented cottage off of the most beautiful beach in Hawaii. It’s the perfect place for a honeymoon, a true garden of Eden.\u003c/p\u003e\n\u003cp\u003e“Are you coming?” I call over my shoulder to my husband.\u003c/p\u003e\n\u003cp\u003eMy husband.\u003c/p\u003e\n\u003cp\u003eThe words ring through my head, and even though they sound foreign, they don’t feel that way. Dominic and Jacey Kinkaide. Bound together forever. By love and by lust and by everything in between. That’s what Duncan announced earlier at our ceremony on the beach. He’d gotten his license to perform marriages specifically for this occasion.\u003c/p\u003e\n\u003cp\u003eDominic catches up to me and scoops me into his arms.\u003c/p\u003e\n\u003cp\u003e“You thought you’d walk over the threshold yourself?” he asks impishly. “Not gonna happen.”\u003c/p\u003e\n\u003cp\u003e“But this isn’t our house,” I start to say. But then I drop it. If the man wants to carry me, he can carry me. He scoops me up into his arms and carries me to the bed, a four-poster-covered-in-filmy-gauze bed.\u003c/p\u003e\n\u003cp\u003eSitting me down, he peels me out of my dress, kissing every inch of me as he does. When he’s done, by the time I stand in front of him naked, I’m dying for him.\u003c/p\u003e\n\u003cp\u003e“I need you,” I tell him simply. “Fill me up, Dominic. Make me yours.”\u003c/p\u003e\n\u003cp\u003eHe smiles, the smile I love, the private one… the one just for me. “You’ve always been mine,” he whispers. “You just didn’t know it.”\u003c/p\u003e\n\u003cp\u003eHe pushes me back onto the bed and kisses me again, his tongue so hot and wet and perfect against mine.\u003c/p\u003e\n\u003cp\u003e“And I’ve always been yours,” he adds. “I just didn’t know it. But I know it now, and that’s the important thing.”\u003c/p\u003e\n\u003cp\u003eHe straddles me, bending over me, owning me.\u003c/p\u003e\n\u003cp\u003eHe knows just what to do to make my body sing, to crest me toward the precipice of orgasm as he slides his fingers in all the right places.\u003c/p\u003e\n\u003cp\u003eEmotion wells up in me, overwhelming and hot. Love, lust, and everything in between.\u003c/p\u003e\n\u003cp\u003eI grip Dom’s shoulders, pulling him into me, closer and closer. I wrap my leg around his hip, pulling him deeper inside.\u003c/p\u003e\n\u003cp\u003eHe groans, then drags his tongue along my nipples. He circles them, then sucks, driving me to the brink of madness.\u003c/p\u003e\n\u003cp\u003eI arch upward, pressing against his strong chest, and he groans again as he thrusts, the muscles in his back flexing. I call out and scratch into him, breathing in the smell of his skin as I bury my face in his shoulder.\u003c/p\u003e\n\u003cp\u003e“I love you, Mrs. Kinkaide,” he breathes as he slides in and out of me, slower now, gentle. “Always.”\u003c/p\u003e\n\u003cp\u003eI want to roll my eyes and tell him that he’s so dramatic, that this isn’t a movie script. But I don’t. Because like always, scripted or not, his words are perfect.\u003c/p\u003e\n\u003cp\u003eI arch into him and come, the waves of my orgasm carrying me up and away, far from here. And then he throws his head back and follows me. It’s a few minutes before I return to the present, before I can once again think logical thought.\u003c/p\u003e\n\u003cp\u003e“I love you, too,” I answer finally, when I can catch my breath. “Always.”\u003c/p\u003e\n\u003cp\u003eI fall asleep in his arms.\u003c/p\u003e\n\u003cp\u003eI’m awakened by a sound. The world is dark outside the cottage and the gauzy curtains flutter in the breeze. I sit up and look around, only to be startled by a woman sitting in the chair next to the bed.\u003c/p\u003e\n\u003cp\u003eShe’s humming “Brown Eyed Girl” ever so softly.\u003c/p\u003e\n\u003cp\u003eHer aquamarine eyes meet mine, and I know who she is. Oddly enough, I’m not afraid.\u003c/p\u003e\n\u003cp\u003e“Emma,” I whisper. She nods, her face young and beautiful in the night. “Am I dreaming?”\u003c/p\u003e\n\u003cp\u003eShe smiles. “Are you?”\u003c/p\u003e\n\u003cp\u003eI don’t know. I must be.\u003c/p\u003e\n\u003cp\u003e“I needed you to know something,” she tells me softly, and her voice is like a song, gentle and melodic. She looks down at Dominic, her gaze full of love. “I chose you for him,” she says quietly.\u003c/p\u003e\n\u003cp\u003eI stare at her in confusion. “What?”\u003c/p\u003e\n\u003cp\u003e“You don’t remember me? I met you. Years ago on Goose Beach. I was there with my mom, you were there with your grandma. You got my ice cream money back from a horrible little girl.”\u003c/p\u003e\n\u003cp\u003eThe hazy memory comes back, but I struggle to put the pieces together. “Heather Edel. She was the meanest girl in the sixth grade. You were wearing a red swimsuit.”\u003c/p\u003e\n\u003cp\u003eEmma nods.\u003c/p\u003e\n\u003cp\u003e“She terrified me, but you stood up to her like it was nothing and got my money back.”\u003c/p\u003e\n\u003cp\u003e“You gave me a seashell,” I say slowly, remembering how the little girl had handed it to me and then ran off with her mom. “A white one.”\u003c/p\u003e\n\u003cp\u003eEmma smiles. “I used to collect them.”\u003c/p\u003e\n\u003cp\u003eA memory of the tiny shells in Dominic’s black velvet box comes to mind and the shell on her pendant… I stare at her soundlessly, my breath lingering on my lips.\u003c/p\u003e\n\u003cp\u003e“I was so in awe of you,” she continues. “Of how you were so brave and stood up for someone you didn’t even know. It seemed like you weren’t afraid of anything. You swam out to the buoy line a hundred times that day, while I was afraid to go past the sandbar. After I went home, I never saw you again. But when Dominic needed saving, I knew it had to be you. He needed someone brave and strong, so I brought you to him.”\u003c/p\u003e\n\u003cp\u003eI stare at her, transfixed. “This is a strange dream.”\u003c/p\u003e\n\u003cp\u003eEmma laughs, a tinkling sound in the night.\u003c/p\u003e\n\u003cp\u003e“It’s okay to think that,” she assures me. “There are some things that can’t be explained, so you probably shouldn’t try.”\u003c/p\u003e\n\u003cp\u003e“But how did you ‘bring me to Dominic’?” I ask doubtfully. “Surely that can be explained.”\u003c/p\u003e\n\u003cp\u003eShe smiles patiently. “Wasn’t it strange how drugs ended up in Dominic’s car… when you both swore they weren’t yours? It’s almost as if they just appeared there.”\u003c/p\u003e\n\u003cp\u003eMy eyes widen.\u003c/p\u003e\n\u003cp\u003e“You.” I breathe. “Why?” She smiles and the room seems to glow with it.\u003c/p\u003e\n\u003cp\u003e“Because love eclipses death, Jacey. It’s forever. And because I love him, I want him to be happy. I knew you could make him happy, so I brought you together the only way I knew how. I’m at peace now. Tell him that. Tell him I’m glad that he’s moving on, that he’s forgetting me. Tell him good-bye.”\u003c/p\u003e\n\u003cp\u003e“He’s not forgetting you,” I protest. “He’ll never forget you. You’re a healthy memory now, instead of a painful one. That’s all. And that’s good.”\u003c/p\u003e\n\u003cp\u003eShe smiles and nods. “I know. That’s all I ever wanted. Thank you, Jacey. Thank you for saving him. I knew you would.”\u003c/p\u003e\n\u003cp\u003eShe trails her fingers along his leg as she walks to the door. Once she gets there, she looks back, her face luminescent in the night.\u003c/p\u003e\n\u003cp\u003e“Oh, and Jacey? Take care of him.”\u003c/p\u003e\n\u003cp\u003eI nod, transfixed and in awe. “I will.”\u003c/p\u003e\n\u003cp\u003eShe walks away, humming.\u003c/p\u003e\n\u003cp\u003eDo you remember when, we used to sing… sha-la-la-la-la-la-la-la-la-la-la-te-da… You’re my… brown eyed girl.\u003c/p\u003e\n\u003cp\u003eI try to wake up, but then realize that I’m not sleeping. I have no conscious recollection of waking up. Or if I was ever actually asleep. Everything’s a haze. A blur. Except for the memory of Emma’s striking blue eyes staring at me from two feet away.\u003c/p\u003e\n\u003cp\u003eI sit up in bed, trying to wrap my mind around it.\u003c/p\u003e\n\u003cp\u003eIt couldn’t have… it didn’t… it didn’t happen.\u003c/p\u003e\n\u003cp\u003eI turn to Dominic to wake him up, to share the crazy dream with him, when something catches my eye on the bedside table. Something that glistens pearly white in the light of the moon.\u003c/p\u003e\n\u003cp\u003eA seashell.\u003c/p\u003e\n\u003cp\u003eWhile the curtains rustle with the breeze and the ocean crashes against the beach, my heart pounds. And as the soft wind blows my hair away from my face, I hear it.\u003c/p\u003e\n\u003cp\u003eSha-la-la-la-la-la-la-la-la-la-la-te-da…\u003c/p\u003e\n\u003cp\u003eThe faint strain of “Brown Eyed Girl,” floating in from the water. \u003c/p\u003e","sourceLink":"https://allnovel.net/before-we-fall-beautifully-broken-3/page-49.html","bookId":2761,"creation":"Oct 5, 2019 5:05:30 PM","modification":"Oct 5, 2019 5:05:30 PM"}
