{"id":42847,"no":6,"title":"Chapter 5","content":"\"I don\u0027t mind parties, Norma, not ordinary parties. But that one didn\u0027t look like an ordinary party.\"\n\u003cbr\u003e \n\u003cbr\u003e Norma stood her ground in front of the desk. This, after all, was important \"But, Dr. Haenlingen, we—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t try to persuade me,\" the little old woman said sharply. \"Don\u0027t try to cozen me into something: I know all the tricks, Norma. I invented a good third of them, and it\u0027s been a long time since I had to use a textbook to remember the rest.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m not trying to persuade you of anything.\" The woman wouldn\u0027t listen, that was the whole trouble: in the harsh bright light of morning she sat like a stone statue, casting a shadow of black on the polished desk. This was Dr. Haenlingen—and how did you talk to Dr. Haenlingen? But it was important, Norma reminded herself again: it was perfectly possible that the entire group of people at the party would be downgraded, or at the least get marked down on their records. \"But we weren\u0027t doing anything harmful. If you have a party you\u0027ve got to expect people to—oh, to get over-enthusiastic, maybe. But certainly there was nothing worth getting angry about. There was—\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sure you\u0027ve thought all this out,\" Dr. Haenlingen said tightly. \"You seem to have your case well prepared, and it would be a pleasure to listen to you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Unfortunately,\" the woman continued in a voice like steel, \"I have a great deal of work to do this morning.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Dr. Haenlingen—\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry,\" she said, but she didn\u0027t sound sorry in the least. Her eyes went down to a pile of papers on the desk. A second passed.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ve got to listen to me,\" Norma said. \"What you\u0027re doing is unfair.\"\n\u003cbr\u003e \n\u003cbr\u003e Dr. Haenlingen didn\u0027t look up. \"Oh?\"\n\u003cbr\u003e \n\u003cbr\u003e \"They were just—having fun,\" Norma said. \"There was nothing wrong, nothing at all. You happened to come in at a bad moment, but it didn\u0027t mean anything, there wasn\u0027t anything going on that should have bothered you....\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps not,\" Dr. Haenlingen said. \"Unfortunately, what bothers me is not reducible to rule.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you\u0027re going to act on it,\" Norma said. \"You\u0027re going to—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes?\" Dr. Haenlingen said. \"What am I going to do?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, you—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Downgrade the persons who were there?\" Dr. Haenlingen asked. \"Enter remarks in the permanent records? Prevent promotion? Just what am I supposed to have in mind?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I thought—I—\"\n\u003cbr\u003e \n\u003cbr\u003e \"I plan,\" Dr. Haenlingen said, \"nothing whatever. Not just at present. I want to think about what I saw, about the people I saw. At present, nothing more.\"\n\u003cbr\u003e \n\u003cbr\u003e There was a little silence. Norma felt herself relax. Then she asked: \"At present?\"\n\u003cbr\u003e \n\u003cbr\u003e Dr. Haenlingen looked up at her, the eyes ice-cold and direct. \"What action I determine to take,\" she said, \"will be my responsibility. Mine alone. I do not intend to discuss it, or to attempt to justify it, to you or to anyone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, Dr. Haenlingen.\" Norma stood awkwardly. \"Thank you—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t thank me—yet,\" Dr. Haenlingen said. \"Go and do your own work. I\u0027ve got quite a lot to oversee here.\" She went back to her papers. Norma turned, stopped and then walked to the door. At the door she turned again but Dr. Haenlingen was paying no visible attention to her. She opened the door, went out and closed it behind her.\n\u003cbr\u003e \n\u003cbr\u003e In the corridor she took one deep breath and then another.\n\u003cbr\u003e \n\u003cbr\u003e The trouble was, you couldn\u0027t depend on the woman to do anything. She meant exactly what she had said: \"For the present.\" And who could tell what might happen later?\n\u003cbr\u003e \n\u003cbr\u003e Norma headed for her own cubicle, where she ignored the papers and the telephone messages waiting for her and reached for the intercom button instead. She pushed it twice and a voice said:\n\u003cbr\u003e \n\u003cbr\u003e \"What happened?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s not good, Greta,\" Norma said. \"It\u0027s—well, undecided, anyhow: we\u0027ve got that much going for us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Undecided?\" the voice asked.\n\u003cbr\u003e \n\u003cbr\u003e \"She said she wouldn\u0027t do anything—yet. But she left it open.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh. Lord. Oh, my.\"\n\u003cbr\u003e \n\u003cbr\u003e Norma nodded at the intercom speaker. \"That\u0027s right. Anything\u0027s possible—you know what she\u0027s like.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Lord. Do I.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And—Greta, why did you have to be there, right by the door, with that strange type—as if it had been set up for her? Right in front of her eyes....\"\n\u003cbr\u003e \n\u003cbr\u003e \"An accident,\" Greta said. \"A pure by-God accident. When she walked in, when I saw her, believe me, Norma, my blood ran absolutely cold. Temperature of ice, or something colder than ice.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Just that one look, just that one long look around.\" Norma said, \"and she was gone. As if she\u0027d memorized us, every one of us, filed the whole thing away and didn\u0027t need to see any more.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would have explained. But there wasn\u0027t any time.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know,\" Norma said. \"Greta, who was he, anyhow?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Him?\" Greta said. \"Who knows? A friend of Cendar\u0027s—you know Cendar, don\u0027t you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Albin Cendar?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s the one. He—\"\n\u003cbr\u003e \n\u003cbr\u003e \"But he\u0027s not from Psych.\" Norma said.\n\u003cbr\u003e \n\u003cbr\u003e \"Neither is his friend, I guess,\" Greta said. \"But they come over, you know that—Cendar\u0027s always around.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you had to invite them....\"\n\u003cbr\u003e \n\u003cbr\u003e \"Invite?\" Greta said. \"I didn\u0027t invite anybody. They were there, that\u0027s all. Cendar always shows up. You know that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Great,\" Nonna said. \"So last night he had to bring a friend and the friend got grabby—\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" Greta said. \"He was—well, confused maybe. Never been to a party of ours before, or anyhow not that I remember. I was trying to—loosen him up.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You loosened everybody up,\" Norma said.\n\u003cbr\u003e \n\u003cbr\u003e There was a silence.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry,\" Norma said. \"All right. You couldn\u0027t have known—\"\n\u003cbr\u003e \n\u003cbr\u003e \"I didn\u0027t know anything,\" Greta\u0027s voice said. \"She was there, that\u0027s all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I wonder whether Dr. Haenlingen knew him,\" Norma said. \"The new one, I mean.\"\n\u003cbr\u003e \n\u003cbr\u003e \"His name was Johnny something,\" Greta said.\n\u003cbr\u003e \n\u003cbr\u003e \"We\u0027ll just have to wait and find out,\" Norma said. \"Whatever she\u0027s going to do, there isn\u0027t any way to stop it. I did the best I could—\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sure you did,\" Greta said. \"We know that. Sure.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Cendar and his friends—\" Norma began.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, forget about that,\" Greta said. \"Who cares about them?\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2155/60922.html","bookId":446,"creation":"Aug 11, 2019 6:18:36 AM","modification":"Aug 11, 2019 6:18:36 AM"}
