{"id":68876,"no":11,"title":"Page 11","content":"\u003cp\u003eSeymour Wilson, the chief of medicine at Embarcadero County Hospital, was a frustrated man with an impossible job. There were too many patients, too few doctors and nurses, and too few hours in a day. He felt like the captain of a sinking ship, running around vainly trying to plug up the holes.\u003c/p\u003e\n\u003cp\u003eAt the moment, Dr. Wilson\u0027s immediate concern was Honey Taft. While some doctors seemed to like her a great deal, reliable residents and nurses kept reporting that Dr. Taft was incapable of doing her job.\u003c/p\u003e\n\u003cp\u003eWilson finally went to see Ben Wallace. \"I want to get rid of one of our doctors,\" he said. \"The residents she makes rounds with tell me she\u0027s incompetent.\"\u003c/p\u003e\n\u003cp\u003eWallace remembered Honey. She was the one who had the extraordinarily high grades and glowing recommendation. \"I don\u0027t understand it,\" he said. \"There must be some mistake.\" He was thoughtful for a moment. \"I\u0027ll tell you what we\u0027ll do, Seymour. Who\u0027s the meanest son of a bitch on your staff?\"\u003c/p\u003e\n\u003cp\u003e\"Ted Allison.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Tomorrow morning, send Honey Taft out on rounds with Dr. Allison. Have him give you a report on her. If he says she\u0027s incompetent, I\u0027ll get rid of her.\"\u003c/p\u003e\n\u003cp\u003e\"Fair enough,\" Dr. Wilson said. \"Thanks, Ben.\"\u003c/p\u003e\n\u003cp\u003eAt lunch, Honey told Paige that she had been assigned to make the rounds with Dr. Allison the following morning.\u003c/p\u003e\n\u003cp\u003e\"I know him,\" Paige said. \"He has a miserable reputation.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I hear,\" Honey said thoughtfully.\u003c/p\u003e\n\u003cp\u003eAt that moment, in another part of the hospital, Seymour Wilson was talking to Ted Allison. Allison was a hard-bitten veteran of twenty-five years. He had served as a medical officer in the navy, and he still took pride in \"kicking ass.\"\u003c/p\u003e\n\u003cp\u003eSeymour Wilson was saying, \"I want you to keep a close eye on Dr. Taft. If she can\u0027t cut it, she\u0027s out. Understood?\"\u003c/p\u003e\n\u003cp\u003e\"Understood.\"\u003c/p\u003e\n\u003cp\u003eHe was looking forward to this. Like Seymour Wilson, Ted Allison despised incompetent doctors. In addition, he had a strong conviction that if women wanted to be in the medical profession, they should be nurses. If it was good enough for Florence Nightingale, it was good enough for the rest of them.\u003c/p\u003e\n\u003cp\u003eAt six o\u0027clock the following morning, the residents gathered in the corridor to begin their rounds. The group consisted of Dr. Allison, Tom Benson, who was his chief assistant, and five residents, including Honey Taft.\u003c/p\u003e\n\u003cp\u003eNow, as Allison looked at Honey, he thought, Okay, sister, let\u0027s see what you\u0027ve got. He turned to the group. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eThe first patient in Ward One was a teenage girl lying in bed, covered with heavy blankets. She was asleep when the group approached her.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Dr. Allison said. \"I want you all to take a look at her chart.\"\u003c/p\u003e\n\u003cp\u003eThe residents began to study the patient\u0027s chart. Dr. Allison turned to Honey. \"This patient has fever, chills, general malaise, and anorexia. She has a temperature, a cough, and pneumonia. What\u0027s your diagnosis, Dr. Taft?\"\u003c/p\u003e\n\u003cp\u003eHoney stood there, frowning, silent.\u003c/p\u003e\n\u003cp\u003e\"Well?\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Honey said thoughtfully, \"I would say she probably has psittacosis - parrot fever.\"\u003c/p\u003e\n\u003cp\u003eDr. Allison was looking at her in surprise. \"What ... what makes you say that?\"\u003c/p\u003e\n\u003cp\u003e\"Her symptoms are typical of psittacosis, and I noticed that she works part-time as a clerk in a pet shop. Psittacosis is transmitted by infected parrots.\"\u003c/p\u003e\n\u003cp\u003eAllison nodded slowly. \"That\u0027s ... that\u0027s very good. Do you know what the treatment is?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Tetracycline for ten days, strict bed rest, and plenty of fluids.\"\u003c/p\u003e\n\u003cp\u003eDr. Allison turned to the group, \"Did you all hear that? Dr. Taft is absolutely right.\"\u003c/p\u003e\n\u003cp\u003eThey moved on to the next patient.\u003c/p\u003e\n\u003cp\u003eDr. Allison said, \"If you\u0027ll examine his chart, you\u0027ll find that he has mesothelial tumors, bloody effusion, and fatigue. What\u0027s the diagnosis?\"\u003c/p\u003e\n\u003cp\u003eOne of the residents said, hopefully, \"It sounds like some form of pneumonia.\"\u003c/p\u003e\n\u003cp\u003eA second resident spoke up. \"It could be cancer.\"\u003c/p\u003e\n\u003cp\u003eDr. Allison turned to Honey. \"What is your diagnosis, doctor?\"\u003c/p\u003e\n\u003cp\u003eHoney looked thoughtful. \"Offhand, I\u0027d say it was fibrous pneumoconiosis, a form of asbestos poisoning. His chart shows that he works in a carpet mill.\"\u003c/p\u003e\n\u003cp\u003eTed Allison could not conceal his admiration. \"Excellent! Excellent! Do you happen to know what the therapy is?\"\u003c/p\u003e\n\u003cp\u003e\"Unfortunately, no specific therapy is available yet.\"\u003c/p\u003e\n\u003cp\u003eIt became even more impressive. In the next two hours, Honey diagnosed a rare case of Reiter\u0027s syndrome, osteitis deformans polycythemia, and malaria.\u003c/p\u003e\n\u003cp\u003eWhen the rounds were over, Dr. Allison shook Honey\u0027s hand. \"I\u0027m not easily impressed, doctor, but I want to tell you that you have a tremendous future!\"\u003c/p\u003e\n\u003cp\u003eHoney blushed. \"Thank you, Dr. Allison.\"\u003c/p\u003e\n\u003cp\u003e\"And I intend to tell Ben Wallace so,\" he said as he walked away.\u003c/p\u003e\n\u003cp\u003eTom Benson, Allison\u0027s senior assistant, looked at Honey and smiled. \"I\u0027ll meet you in half an hour, baby.\"\u003c/p\u003e\n\u003cp\u003ePaige tried to stay out of the way of Dr. Arthur Kane - 007. But at every opportunity, Kane asked for Paige to assist him with operations. And each time, he would become more offensive.\u003c/p\u003e\n\u003cp\u003e\"What do you mean, you won\u0027t go out with me? You must be getting it from someone else.\"\u003c/p\u003e\n\u003cp\u003eAnd, \"I may be short, honey, but not everywhere. You know what I mean?\"\u003c/p\u003e\n\u003cp\u003eShe came to dread the occasions she had to work with him. Time after time, Paige watched Kane perform unnecessary surgery and take out organs that were healthy.\u003c/p\u003e\n\u003cp\u003eOne day, as Paige and Kane were walking toward the operating room, Paige asked, \"What are we going to operate on, doctor?\"\u003c/p\u003e\n\u003cp\u003e\"His wallet!\" He saw the look on Paige\u0027s face. \"Just kidding, honey.\"\u003c/p\u003e\n\u003cp\u003e\"He should be working in a butcher shop,\" Paige later said angrily to Kat. \"He has no right to be operating on people.\"\u003c/p\u003e\n\u003cp\u003eAfter a particularly inept liver operation, Dr. Kane turned to Paige and shook his head. \"Too bad. I don\u0027t know if he\u0027s going to make it.\"\u003c/p\u003e\n\u003cp\u003eIt was all Paige could do to contain her anger. She decided to have a talk with Tom Chang.\u003c/p\u003e\n\u003cp\u003e\"Someone should report Dr. Kane,\" Paige said. \"He\u0027s murdering his patients!\"\u003c/p\u003e\n\u003cp\u003e\"Take it easy.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t! It\u0027s not right that they let a man like that operate. It\u0027s criminal. He should be brought up before the credentials committee.\"\u003c/p\u003e\n\u003cp\u003e\"What good would it do? You\u0027d have to get other doctors to testify against him, and no one would be willing to do that. This is a close community, and we all have to live in it, Paige. It\u0027s almost impossible to get one doctor to testify against another. We\u0027re all vulnerable and we need each other too much. Calm down. I\u0027ll take you out and buy you lunch.\"\u003c/p\u003e\n\u003cp\u003ePaige sighed. \"All right, but it\u0027s a lousy system.\"\u003c/p\u003e\n\u003cp\u003eAt lunch, Paige asked, \"How are you and Sye doing?\"\u003c/p\u003e\n\u003cp\u003eHe took a moment to answer. \"I ... we\u0027re having problems. My work is destroying our marriage. I don\u0027t know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure it will work out,\" Paige said.\u003c/p\u003e\n\u003cp\u003eChang said fiercely, \"It had better.\"\u003c/p\u003e\n\u003cp\u003ePaige looked up at him.\u003c/p\u003e\n\u003cp\u003e\"I would kill myself if she left me.\"\u003c/p\u003e\n\u003cp\u003eThe following morning, Arthur Kane was scheduled to perform a kidney operation. The chief of surgery said to Paige, \"Dr. Kane asked for you to assist him in OR Four.\"\u003c/p\u003e\n\u003cp\u003ePaige\u0027s mouth was suddenly dry. She hated the thought of being near him.\u003c/p\u003e\n\u003cp\u003ePaige said, \"Couldn\u0027t you get someone else to ...?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s waiting for you, doctor.\"\u003c/p\u003e\n\u003cp\u003ePaige sighed. \"Right.\"\u003c/p\u003e\n\u003cp\u003eBy the time Paige had scrubbed up, the operation was already in progress.\u003c/p\u003e\n\u003cp\u003e\"Give me a hand here, darling,\" Kane said to Paige.\u003c/p\u003e\n\u003cp\u003eThe patient\u0027s abdomen had been painted with an iodine solution and an incision had been made in the right upper quadrant of the abdomen, just below the rib cage. So far, so good, Paige thought.\u003c/p\u003e\n\u003cp\u003e\"Scalpel!\"\u003c/p\u003e\n\u003cp\u003eThe scrub nurse handed Dr. Kane a scalpel.\u003c/p\u003e\n\u003cp\u003eHe looked up. \"Put some music on.\"\u003c/p\u003e\n\u003cp\u003eA moment later a CD began to play.\u003c/p\u003e\n\u003cp\u003eDr. Kane kept cutting. \"Let\u0027s have something a little peppier.\" He looked over at Paige. \"Start the bovie, sweetheart.\"\u003c/p\u003e\n\u003cp\u003eSweetheart. Paige gritted her teeth and picked up a bovie - an electric cautery tool. She began to cauterize the arteries to reduce the amount of blood in the abdomen. The operation was going well.\u003c/p\u003e\n\u003cp\u003eThank God, Paige thought.\u003c/p\u003e\n\u003cp\u003e\"Sponge.\"\u003c/p\u003e\n\u003cp\u003eThe scrub nurse handed Kane a sponge.\u003c/p\u003e\n\u003cp\u003e\"Good. Let\u0027s have some suction.\" He cut around the kidney until it was exposed. \"There\u0027s the little devil,\" Dr. Kane said. \"More suction.\" He lifted up the kidney with forceps. \"Right. Let\u0027s sew him back up.\"\u003c/p\u003e\n\u003cp\u003eFor once, everything had gone well, yet something was bothering Paige. She took a closer look at the kidney. It looked healthy. She frowned, wondering if ...\u003c/p\u003e\n\u003cp\u003eAs Dr. Kane began sewing up the patient, Paige hurried over to the X-ray in the lighted wall frame. She studied it for a moment and said softly, \"Oh, my God!\"\u003c/p\u003e\n\u003cp\u003eThe X-ray had been put up backward. Dr. Kane had removed the wrong kidney.\u003c/p\u003e\n\u003cp\u003eThirty minutes later, Paige was in Ben Wallace\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"He took out a healthy kidney and left in a diseased one!\" Paige\u0027s voice was trembling. \"The man should be put in jail!\"\u003c/p\u003e\n\u003cp\u003eBenjamin Wallace said soothingly, \"Paige, I agree with you that it\u0027s regrettable. But it certainly wasn\u0027t intentional. It was a mistake, and - \"\u003c/p\u003e\n\u003cp\u003e\"A mistake\u0027? That patient is going to have to live on dialysis for the rest of his life. Someone should pay for that!\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, we\u0027re going to have a peer review evaluation.\"\u003c/p\u003e\n\u003cp\u003ePaige knew what that meant: a group of physicians would review what had happened, but it would be done in confidence. The information would be withheld from the public and the patient.\u003c/p\u003e\n\u003cp\u003e\"Dr. Wallace ...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re part of our team, Paige. You\u0027ve got to be a team player.\"\u003c/p\u003e\n\u003cp\u003e\"He has no business working in this hospital. Or any other hospital.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to look at the whole picture. If he were removed, there would be bad publicity and the reputation of the hospital would be hurt. We\u0027d probably face a lot of malpractice suits.\"\u003c/p\u003e\n\u003cp\u003e\"What about the patients?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll keep a closer eye on Dr. Kane.\" He leaned forward in his chair. \"I\u0027m going to give you some advice. When you get into private practice, you\u0027re going j to need the goodwill of other doctors for referrals. With-1 out that, you\u0027ll go nowhere, and if you get the reputation! of being a maverick and blowing the whistle on your: fellow doctors, you won\u0027t get any referrals. I can promise you that.\"\u003c/p\u003e\n\u003cp\u003ePaige rose. \"So you aren\u0027t going to do anything?\"\u003c/p\u003e\n\u003cp\u003e\"I told you, we\u0027re going to do a peer review evaluation.\"\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s it?\" \"That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not fair,\" Paige said. She was in the cafeteria having lunch with Kat and Honey.\u003c/p\u003e\n\u003cp\u003eKat shook her head. \"Nobody said life has to be fair.\"\u003c/p\u003e\n\u003cp\u003ePaige looked around the antiseptic white-tiled room. \"This whole place depresses me. Everybody is sick.\"\u003c/p\u003e\n\u003cp\u003e\"Or they wouldn\u0027t be here,\" Kat pointed out.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we give a party?\" Honey suggested.\u003c/p\u003e\n\u003cp\u003e\"A party? What are you talking about?\"\u003c/p\u003e\n\u003cp\u003eHoney\u0027s voice was suddenly filled with enthusiasm. \"We could order up some decent food and liquor, and have a celebration! I think we could all use a little cheering up.\"\u003c/p\u003e\n\u003cp\u003ePaige thought for a second. \"You know,\" she said, \"that\u0027s not a bad idea. Let\u0027s do it!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a deal. I\u0027ll organize things,\" Honey told them. \"We\u0027ll do it tomorrow after rounds.\"\u003c/p\u003e\n\u003cp\u003eArthur Kane approached Paige in the corridor. There was ice in his voice. \"You\u0027ve been a naughty girl. Someone should teach you to keep your mouth shut!\" And he walked away.\u003c/p\u003e\n\u003cp\u003ePaige looked after him in disbelief. Wallace told him what I said. He shouldn\u0027t have done that. \u0027If you get the reputation of being a maverick and blowing the whistle on your fellow doctors ...\u0027 Would Ido it again? Paige pondered. Darned right I would!\u003c/p\u003e\n\u003cp\u003eNews of the forthcoming party spread rapidly. All the residents chipped in. A lavish menu was ordered from Ernie\u0027s, and liquor was delivered from a nearby store. The party was set for five o\u0027clock in the doctors\u0027 lounge. The food and drinks arrived at four-thirty. There was a feast: seafood platters with lobster and shrimp, a variety of pates, Swedish meatballs, hot pasta, fruit, and desserts. When Paige, Kat, and Honey walked into the lounge at five-fifteen, it was already crowded with eager residents, interns, and nurses, eating and having a wonderful time.\u003c/p\u003e\n\u003cp\u003ePaige turned to Honey. \"This was a great idea!\"\u003c/p\u003e\n\u003cp\u003eHoney smiled. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eAn announcement came over the loudspeaker. \"Dr. Finley and Dr. Ketler to the ER. Stat.\" And the two doctors, in the middle of downing shrimp, looked at each other, sighed, and hurriedly left the room.\u003c/p\u003e\n\u003cp\u003eTom Chang came up to Paige. \"We ought to do this every week,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Right. It\u0027s - \"\u003c/p\u003e\n\u003cp\u003eThe loudspeaker came on again. \"Dr. Chang ... Room 7. ... Dr. Chang ... Room 7.\"\u003c/p\u003e\n\u003cp\u003eAnd a minute later, \"Dr. Smythe ... ER Two... . Dr. Smythe to ER Two.\"\u003c/p\u003e\n\u003cp\u003eThe loudspeaker never stopped. Within thirty minutes, almost every doctor and nurse had been called away on some emergency. Honey heard her name called, and then Paige\u0027s, and Kat\u0027s.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe what\u0027s happening,\" Kat said. \"You know how people talk about having a guardian angel? Well, I think the three of us are under the spell of a guardian devil.\" Her words proved to be prophetic.\u003c/p\u003e\n\u003cp\u003eThe next Monday morning, when Paige got off duty and went to get into her car, two of the tires had been slashed. She stared at them in disbelief. Someone should teach you to keep your mouth shut!\u003c/p\u003e\n\u003cp\u003eWhen she got back to the apartment she said to Kat and Honey, \"Watch out for Arthur Kane. He\u0027s crazy.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-11.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
