{"id":68877,"no":12,"title":"Page 12","content":"\u003cp\u003eKat was awakened by the ring of the telephone. Without opening her eyes, she reached out for it and put the receiver to her ear.\u003c/p\u003e\n\u003cp\u003e\"H\u0027lo?\"\u003c/p\u003e\n\u003cp\u003e\"Kat? It\u0027s Mike.\"\u003c/p\u003e\n\u003cp\u003eShe sat up, her heart suddenly pounding. \"Mike, are you all right?\" She heard him laugh.\u003c/p\u003e\n\u003cp\u003e\"Never better, sis. Thanks to you and your friend.\"\u003c/p\u003e\n\u003cp\u003e\"My friend?\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Dinetto.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\" Kat tried to concentrate, groggy with sleep.\u003c/p\u003e\n\u003cp\u003e\"Mr. Dinetto. He really saved my life.\"\u003c/p\u003e\n\u003cp\u003eKat had no idea what he was talking about. \" Mike...\"\u003c/p\u003e\n\u003cp\u003e\"You know the fellows I owed money to? Mr. Dinetto got them off my back. He\u0027s a real gentleman. And he thinks the world of you, Kat.\"\u003c/p\u003e\n\u003cp\u003eKat had forgotten the incident with Dinetto, but now it suddenly flashed into her mind: Lady, you don\u0027t know who you\u0027re talking to. You better do what the man says. This is Mr. Lou Dinetto.\u003c/p\u003e\n\u003cp\u003eMike was going on. \"I\u0027m sending you some cash, Kat. Your friend arranged for me to get a job. It pays real good money.\"\u003c/p\u003e\n\u003cp\u003eYour friend. Kat was nervous.. \"Mike, listen to me. I want you to be careful.\"\u003c/p\u003e\n\u003cp\u003eShe heard him laugh again.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about me. Didn\u0027t I tell you everything would be coming up roses? Well, I was right.\"\u003c/p\u003e\n\u003cp\u003e\"Take care of yourself, Mike. Don\u0027t - \"\u003c/p\u003e\n\u003cp\u003eThe connection was broken.\u003c/p\u003e\n\u003cp\u003eKat was unable to go back to sleep. Dinetto! How did he find out about Mike, and why is he helping him?\u003c/p\u003e\n\u003cp\u003eThe following night, when Kat left the hospital, a black limousine was waiting for her at the curb. The Shadow and Rhino were standing beside it.\u003c/p\u003e\n\u003cp\u003eAs Kat started to pass, Rhino said, \"Get in, doctor. Mr. Dinetto wants to see you.\"\u003c/p\u003e\n\u003cp\u003eShe studied the man for a moment. Rhino was ominous-looking, but it was the Shadow who frightened Kat. There was something deadly about his stillness. Under other circumstances, Kat would never have gotten into the car, but Mike\u0027s telephone call had puzzled her. And worried her.\u003c/p\u003e\n\u003cp\u003eShe was driven to a small apartment on the outskirts of the city, and when she arrived, Dinetto was waiting for her.\u003c/p\u003e\n\u003cp\u003e\"Thanks for coming, Dr. Hunter,\" he said. \"I appreciate it. A friend of mine had a little accident. I want you to take a look at him.\"\u003c/p\u003e\n\u003cp\u003e\"What are you doing with Mike?\" Kat demanded.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" he said innocently. \"I heard he was in a little trouble, and I got it taken care of.\"\u003c/p\u003e\n\u003cp\u003e\"How did ... how did you find out about him? I mean, that he was my brother and ...\"\u003c/p\u003e\n\u003cp\u003eDinetto smiled. \"In my business, we\u0027re all friends. We help each other. Mike got mixed up with some bad boys, so I helped him out. You should be grateful.\"\u003c/p\u003e\n\u003cp\u003e\"I am,\" Kat said. \"I really am.\"\u003c/p\u003e\n\u003cp\u003e\"Good! You know the saying \u0027One hand washes the other\u0027?\"\u003c/p\u003e\n\u003cp\u003eKat shook her head. \"I won\u0027t do anything illegal.\"\u003c/p\u003e\n\u003cp\u003e\"Illegal?\" Dinetto said. He seemed hurt. \"I wouldn\u0027t ask you to do anything like that. This friend of mine was in a little accident and he hates hospitals. Would you take a look at him?\"\u003c/p\u003e\n\u003cp\u003eWhat am I letting myself in for? Kat wondered. \"Very well.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in the bedroom.\"\u003c/p\u003e\n\u003cp\u003eDinetto\u0027s friend had been badly beaten up. He was lying in bed, unconscious.\u003c/p\u003e\n\u003cp\u003e\"What happened to him?\" Kat asked.\u003c/p\u003e\n\u003cp\u003eDinetto looked at her and said, \"He fell down a flight of stairs.\"\u003c/p\u003e\n\u003cp\u003e\"He should be in a hospital.\"\u003c/p\u003e\n\u003cp\u003e\"I told you, he doesn\u0027t like hospitals. I can get you whatever hospital equipment you need. I had another doctor who took care of my friends, but he had an accident.\"\u003c/p\u003e\n\u003cp\u003eThe words sent a chill through Kat. She wanted nothing more than to run out of the place and go home, and never hear Dinetto\u0027s name again, but nothing in life was free. Quid pro quo. Kat took off her coat and went to work. \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-12.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
