{"id":68883,"no":16,"title":"Page 16","content":"\u003cp\u003ePaige was on morning rounds with the Beast, as she secretly referred to Dr. Barker. She had assisted him in three cardiothoracic surgeries, and in spite of her bitter feelings toward him, she could not help but admire his incredible skill. She watched in awe as he opened up a patient, deftly replaced the old heart with a donor heart, and sewed him up. The operation took less than five hours.\u003c/p\u003e\n\u003cp\u003eWithin a few weeks, Paige thought, that patient will be able to return to a normal life. No wonder surgeons think they\u0027re gods. They bring the dead back to life.\u003c/p\u003e\n\u003cp\u003eTime after time, Paige watched a heart stop and turn to an inert piece of flesh. And then the miracle would occur, and a lifeless organ would begin to pulsate again and send blood through a body that had been dying.\u003c/p\u003e\n\u003cp\u003eOne morning, a patient was scheduled for a procedure to insert an intraaortic balloon. Paige was in the operating room assisting Dr. Barker. As they were about to begin, Dr. Barker snapped, \"Do it!\"\u003c/p\u003e\n\u003cp\u003ePaige looked at him. \"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a simple procedure. Do you think you can handle it?\" There was contempt in his voice.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Paige said tightly.\u003c/p\u003e\n\u003cp\u003e\"Well, then, get on with it!\"\u003c/p\u003e\n\u003cp\u003eHe was infuriating.\u003c/p\u003e\n\u003cp\u003eBarker watched as Paige expertly inserted a hollow tube into the patient\u0027s artery and threaded it up into the heart. It was done flawlessly. Barker stood there, without saying a word.\u003c/p\u003e\n\u003cp\u003eTo hell with him, Paige thought. Nothing I could ever do would please him.\u003c/p\u003e\n\u003cp\u003ePaige injected a radiopaque dye through the tube. They watched the monitor as the dye flowed into the coronary arteries. Images appeared on a fluoroscopy screen and showed the degree of blockage and its location in the artery, while an automatic motion-picture camera recorded the X-rays for a permanent record.\u003c/p\u003e\n\u003cp\u003eThe senior resident looked at Paige and smiled. \"Nice job.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Paige turned to Dr. Barker.\u003c/p\u003e\n\u003cp\u003e\"Too damned slow,\" he growled.\u003c/p\u003e\n\u003cp\u003eAnd he walked out.\u003c/p\u003e\n\u003cp\u003ePaige was grateful for the days that Dr. Barker was away from the hospital, working at his private practice. She said to Kat, \"Being away from him for a day is like a week in the country.\"\u003c/p\u003e\n\u003cp\u003e\"You really hate him, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a brilliant doctor, but he\u0027s a miserable human being. Have you ever noticed how some people fit their names? If Dr. Barker doesn\u0027t stop barking at people, he\u0027s going to have a stroke.\"\u003c/p\u003e\n\u003cp\u003e\"You should see some of the beauties I have to put up with.\" Kat laughed. \"They all think they\u0027re God\u0027s gift to pussies. Wouldn\u0027t it be great if there were no men in the world!\"\u003c/p\u003e\n\u003cp\u003ePaige looked at her, but said nothing.\u003c/p\u003e\n\u003cp\u003ePaige and Kat went to check on Jimmy Ford. He was still in a coma. There was nothing they could do.\u003c/p\u003e\n\u003cp\u003eKat sighed. \"Dammit. Why does it happen to the good guys?\"\u003c/p\u003e\n\u003cp\u003e\"I wish I knew.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think he\u0027ll make it?\"\u003c/p\u003e\n\u003cp\u003ePaige hesitated. \"We\u0027ve done everything we can. Now it\u0027s up to God.\"\u003c/p\u003e\n\u003cp\u003e\"Funny. I thought we were God.\"\u003c/p\u003e\n\u003cp\u003eThe following day when Paige was in charge of afternoon rounds, Kaplan, a senior resident, stopped her in the corridor. \"This is your lucky day.\" He grinned. \"You\u0027re getting a new medical school student to take around.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, the IN.\"\u003c/p\u003e\n\u003cp\u003e\"IN?\"\u003c/p\u003e\n\u003cp\u003e\"Idiot nephew. Dr. Wallace\u0027s wife has a nephew who wants to be a doctor. They threw him out of his last two schools. We\u0027ve all had to put up with him. Today it\u0027s your turn.\"\u003c/p\u003e\n\u003cp\u003ePaige groaned. \"I don\u0027t have time for this. I\u0027m up to my ...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not an option. Be a good girl and Dr. Wallace will give you brownie points.\" Kaplan moved off.\u003c/p\u003e\n\u003cp\u003ePaige sighed and walked over to where the new residents were waiting to start the rounds. Where\u0027s the IN? She looked at her watch. He was already three minutes late. I\u0027ll give him one more minute, Paige decided, and then to hell with him. She saw him then, a tall, lean-looking man, hurrying toward her, down the hall.\u003c/p\u003e\n\u003cp\u003eHe walked up to Paige, out of breath, and said, \"Excuse me. Dr. Wallace asked me to - \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re late,\" Paige said curtly.\u003c/p\u003e\n\u003cp\u003e\"I know. I\u0027m sorry. I was held up at - \"\u003c/p\u003e\n\u003cp\u003e\"Never mind. What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Jason. Jason Curtis.\" He was wearing a sport jacket.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s your white coat?\"\u003c/p\u003e\n\u003cp\u003e\"My white coat?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t anyone tell you to wear a white coat on rounds?\"\u003c/p\u003e\n\u003cp\u003eHe looked flustered. \"No. I\u0027m afraid I ...\"\u003c/p\u003e\n\u003cp\u003ePaige said irritably, \"Go back to the head nurse\u0027s office and tell her to give you a white coat. And you don\u0027t have a scut book.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Idiot nephew\" doesn\u0027t begin to describe him. \"Meet us in Ward One.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure? I ...\"\u003c/p\u003e\n\u003cp\u003e\"Just do it!\" Paige and the others started off, leaving Jason Curtis staring after them.\u003c/p\u003e\n\u003cp\u003eThey were examining their third patient when Jason Curtis came hurrying up. He was wearing a white coat. Paige was saying, \"... tumors of the heart can be primary, which is rare, or secondary, which is much more common.\"\u003c/p\u003e\n\u003cp\u003eShe turned to Curtis. \"Can you name the three types of tumors?\"\u003c/p\u003e\n\u003cp\u003eHe stared at her. \"I\u0027m afraid I ... I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eOf course not. \"Epicardial. Myocardial. Endocardial.\"\u003c/p\u003e\n\u003cp\u003eHe looked at Paige and smiled. \"That\u0027s really interesting.\"\u003c/p\u003e\n\u003cp\u003eMy God! Paige thought. Dr. Wallace or no Dr. Wallace, I\u0027m going to get rid of him fast.\u003c/p\u003e\n\u003cp\u003eThey moved on to the next patient, and when Paige was through examining him, she took the group into the corridor, out of earshot. \"We\u0027re dealing here with a thyroid storm, with fever and extreme tachycardia. It came on after surgery.\" She turned to Jason Curtis. \"How would you treat him for that?\"\u003c/p\u003e\n\u003cp\u003eHe stood there, thoughtful for a moment. Then he said, \"Gently?\"\u003c/p\u003e\n\u003cp\u003ePaige fought for self-control. \"You\u0027re not his mother, you\u0027re his doctor! He needs continuous IV fluids to combat dehydration, along with IV iodine and antithyroid drugs and sedatives for convulsions.\"\u003c/p\u003e\n\u003cp\u003eJason nodded. \"That sounds about right.\"\u003c/p\u003e\n\u003cp\u003eThe rounds got no better. When they were over, Paige called Jason Curtis aside. \"Do you mind my being frank with you?\"\u003c/p\u003e\n\u003cp\u003e\"No. Not at all,\" he said agreeably. \"I\u0027d appreciate it.\"\u003c/p\u003e\n\u003cp\u003e\"Look for another profession.\"\u003c/p\u003e\n\u003cp\u003eHe stood there, frowning. \"You don\u0027t think I\u0027m cut out for this?\"\u003c/p\u003e\n\u003cp\u003e\"Quite honestly, no. You don\u0027t enjoy this, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Not really.\"\u003c/p\u003e\n\u003cp\u003e\"Then why did you choose to go into this?\"\u003c/p\u003e\n\u003cp\u003e\"To tell you the truth, I was pushed into it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you tell Dr. Wallace that he\u0027s making a mistake. I think you should find something else to do with your life.\"\u003c/p\u003e\n\u003cp\u003e\"I really appreciate your telling me this,\" Jason Curtis said earnestly. \"I wonder if we could discuss this further. If you aren\u0027t doing anything for dinner tonight ...?\"\u003c/p\u003e\n\u003cp\u003e\"We have nothing further to discuss,\" Paige said curtly. \"You can tell your uncle ...\"\u003c/p\u003e\n\u003cp\u003eAt that moment Dr. Wallace came into view. \"Jason!\" he called. \"I\u0027ve been looking all over for you.\" He turned to Paige. \"I see you two have met.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, we\u0027ve met,\" Paige said grimly.\u003c/p\u003e\n\u003cp\u003e\"Good. Jason is the architect in charge of designing the new wing we\u0027re building.\"\u003c/p\u003e\n\u003cp\u003ePaige stood there, motionless. \"He\u0027s ... what?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Didn\u0027t he tell you?\"\u003c/p\u003e\n\u003cp\u003eShe felt her face getting red. Didn\u0027t anyone tell you to wear a white coat on rounds\u0027? Why did you go into this? To tell you the truth, I was pushed into it. By me.\u003c/p\u003e\n\u003cp\u003ePaige wanted to crawl into a hole. He had made a complete fool of her. She turned to Jason. \"Why didn\u0027t you tell me who you were?\"\u003c/p\u003e\n\u003cp\u003eHe was watching her, amused. \"Well, you really didn\u0027t give me a chance.\"\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t give you a chance to what?\" Dr. Wallace asked.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027ll excuse me ...\" Paige said tightly.\u003c/p\u003e\n\u003cp\u003e\"What about dinner tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t eat. And I\u0027m busy.\" And Paige was gone.\u003c/p\u003e\n\u003cp\u003eJason looked after her, admiringly. \"That\u0027s quite a woman.\"\u003c/p\u003e\n\u003cp\u003e\"She is, isn\u0027t she? Shall we go to my office and talk about the new designs?\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\" But his thoughts were on Paige.\u003c/p\u003e\n\u003cp\u003eIt was July, time for the ritual that took place every twelve months at hospitals all over the United States, as new residents came in to begin their journey toward becoming real doctors.\u003c/p\u003e\n\u003cp\u003eThe nurses had been looking forward to the new crop of residents, staking out claims on the ones they thought would make good lovers or husbands. On this particular day, as the new residents appeared, nearly every female eye was fixed on Dr. Ken Mallory.\u003c/p\u003e\n\u003cp\u003eNo one knew why Ken Mallory had transferred from an exclusive private hospital in Washington, D.C., to Embarcadero County Hospital in San Francisco. He was a fifth-year resident and a general surgeon. There were rumors that he had had to leave Washington in a hurry because of an affair with a congressman\u0027s wife. There was another rumor that a nurse had committed suicide because of him and he had been asked to leave. The only thing the nurses were sure of was that Ken Mallory was, without doubt, the best-looking man they had ever seen. He had a tall, athletic body, wavy blond hair, and a face that would have looked great on a movie screen.\u003c/p\u003e\n\u003cp\u003eMallory blended into the hospital routine as though he had been there forever. He was a charmer, and almost from the beginning, the nurses were fighting for his attention. Night after night, the other doctors would watch Mallory disappear into an empty on-call room with a different nurse. His reputation as a stud was becoming legendary around the hospital.\u003c/p\u003e\n\u003cp\u003ePaige, Kat, and Honey were discussing him.\u003c/p\u003e\n\u003cp\u003e\"Can you believe all those nurses throwing themselves at him?\" Kat laughed. \"They\u0027re actually fighting to be the flavor of the week!\"\u003c/p\u003e\n\u003cp\u003e\"You have to admit, he is attractive,\" Honey pointed out.\u003c/p\u003e\n\u003cp\u003eKat shook her head. \"No. I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eOne morning, half a dozen residents were in the doctors\u0027 dressing room when Mallory walked in.\u003c/p\u003e\n\u003cp\u003e\"We were just talking about you,\" one of them said. \"You must be exhausted.\"\u003c/p\u003e\n\u003cp\u003eMallory grinned. \"It was not a bad night.\" He had spent the night with two nurses.\u003c/p\u003e\n\u003cp\u003eGrundy, one of the residents, said, \"You\u0027re making the rest of us look like eunuchs, Ken. Isn\u0027t there anyone in this hospital you can\u0027t lay?\"\u003c/p\u003e\n\u003cp\u003eMallory laughed. \"I doubt it.\"\u003c/p\u003e\n\u003cp\u003eGrundy was thoughtful for a moment. \"I\u0027ll bet I can name someone.\"\u003c/p\u003e\n\u003cp\u003e\"Really? Who\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"One of the senior residents here. Her name is Kat Hunter.\"\u003c/p\u003e\n\u003cp\u003eMallory nodded. \"The black doll. I\u0027ve seen her. She\u0027s very attractive. What makes you think I can\u0027t take her to bed?\"\u003c/p\u003e\n\u003cp\u003e\"Because we\u0027ve all struck out. I don\u0027t think she likes men.\"\u003c/p\u003e\n\u003cp\u003e\"Or maybe she just hasn\u0027t met the right one,\" Mallory suggested.\u003c/p\u003e\n\u003cp\u003eGrundy shook his head. \"No. You wouldn\u0027t have a chance.\"\u003c/p\u003e\n\u003cp\u003eIt was a challenge. \"I\u0027ll bet you\u0027re wrong.\"\u003c/p\u003e\n\u003cp\u003eOne of the other residents spoke up. \"You mean you\u0027re willing to bet on it?\"\u003c/p\u003e\n\u003cp\u003eMallory smiled. \"Sure. Why not?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" The group began to crowd around Mallory. \"I\u0027ll bet you five hundred dollars you can\u0027t lay her.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re on.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet you three hundred.\"\u003c/p\u003e\n\u003cp\u003eAnother one spoke up. \"Let me in on it. I\u0027ll bet you six hundred.\"\u003c/p\u003e\n\u003cp\u003eIn the end, five thousand dollars was bet.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the time limit?\" Mallory asked.\u003c/p\u003e\n\u003cp\u003eGrundy thought for a moment. \"Let\u0027s say thirty days. Is that fair?\"\u003c/p\u003e\n\u003cp\u003e\"More than fair. I won\u0027t need that much time.\"\u003c/p\u003e\n\u003cp\u003eGrundy said, \"But you have to prove it. She has to admit that she went to bed with you.\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\" Mallory looked around the group and grinned. \"Suckers!\"\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, Grundy was in the cafeteria where Kat, Paige, and Honey were having breakfast. He walked over to their table. \"Can I join you ladies -\u0026nbsp;\u0026nbsp;you doctors - for a moment?\"\u003c/p\u003e\n\u003cp\u003ePaige looked up. \"Sure.\"\u003c/p\u003e\n\u003cp\u003eGrundy sat down. He looked at Kat and said apologetically, \"I hate to tell you this, but I\u0027m really mad, and I think it\u0027s only fair that you should know ...\"\u003c/p\u003e\n\u003cp\u003eKat was looking at him, puzzled. \"Know what?\"\u003c/p\u003e\n\u003cp\u003eGrundy sighed. \"That new senior resident who came in - Ken Mallory?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. What about him?\"\u003c/p\u003e\n\u003cp\u003eGrundy said, \"Well, I... God, this is embarrassing. He bet some of the doctors five thousand dollars that he could get you into bed in the next thirty days.\"\u003c/p\u003e\n\u003cp\u003eKat\u0027s face was grim. \"He did, did he?\"\u003c/p\u003e\n\u003cp\u003eGrundy said piously, \"I don\u0027t blame you for being angry. It made me sick when I heard about it. Well, I just wanted to warn you. He\u0027ll be asking you out, and I thought it was only right that you should know why he was doing it.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Kat said. \"I appreciate your telling me.\"\u003c/p\u003e\n\u003cp\u003e\"It was the least I could do.\"\u003c/p\u003e\n\u003cp\u003eThey watched Grundy leave.\u003c/p\u003e\n\u003cp\u003eIn the corridor outside the cafeteria, the other residents were waiting for him.\u003c/p\u003e\n\u003cp\u003e\"How did it go?\" they asked.\u003c/p\u003e\n\u003cp\u003eGrundy laughed. \"Perfect. She\u0027s as mad as hell. The son of a bitch is dead meat!\"\u003c/p\u003e\n\u003cp\u003eAt the table, Honey was saying, \"I think that\u0027s just terrible.\"\u003c/p\u003e\n\u003cp\u003eKat nodded. \"Someone should give him a dickotomy. They\u0027ll be ice skating in hell before I go out with that bastard.\"\u003c/p\u003e\n\u003cp\u003ePaige sat there thinking. After a moment, she said,\u003c/p\u003e\n\u003cp\u003e\"You know something, Kat? It might be interesting if you did go out with him.\"\u003c/p\u003e\n\u003cp\u003eKat looked at her in surprise. \"What?\"\u003c/p\u003e\n\u003cp\u003eThere was a glint in Paige\u0027s eye. \"Why not? If he wants to play games, let\u0027s help him - only he\u0027ll play our game.\"\u003c/p\u003e\n\u003cp\u003eKat leaned forward. \"Go on.\"\u003c/p\u003e\n\u003cp\u003e\"He has thirty days, right? When he asks you out, you\u0027ll be warm and loving and affectionate. I mean, you\u0027ll be absolutely crazy about the man. You\u0027ll drive him out of his mind. The only thing you won\u0027t do, bless your heart, is to go to bed with him. We\u0027ll teach him a five-thousand-dollar lesson.\"\u003c/p\u003e\n\u003cp\u003eKat thought of her stepfather. It was a way of getting revenge. \"I like it,\" Kat said.\u003c/p\u003e\n\u003cp\u003e\"You mean you\u0027re going to do it?\" Honey said.\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003eAnd Kat had no idea that with those words, she had signed her death warrant. \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-16.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
