{"id":68895,"no":22,"title":"Page 22","content":"\u003cp\u003eIn the doctors\u0027 dressing room, half a dozen doctors were waiting for Ken Mallory to appear. When he walked in, Grundy said, \"Hail the conquering hero! We want to hear all the lurid details.\" He grinned. \"But the catch is, buddy, we want to hear them from her.\"\u003c/p\u003e\n\u003cp\u003e\"I ran into a little bad luck.\" Mallory smiled. \"But you can all start getting your money ready.\"\u003c/p\u003e\n\u003cp\u003eKat and Paige were getting into scrubs.\u003c/p\u003e\n\u003cp\u003e\"Have you ever done a procedure on a doctor?\" Kat asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re lucky. They\u0027re the worst patients in the world. They know too much.\"\u003c/p\u003e\n\u003cp\u003e\"Who are you operating on?\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Mervyn \u0027Don\u0027t Hurt Me\u0027 Franklin.\"\u003c/p\u003e\n\u003cp\u003e\"Good luck.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll need it.\"\u003c/p\u003e\n\u003cp\u003eDr. Mervyn Franklin was a man in his sixties, thin, bald, and irascible.\u003c/p\u003e\n\u003cp\u003eWhen Kat walked into his room, he snapped, \"It\u0027s about time you got here. Did the damned electrolyte reports come back?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Kat said. \"They\u0027re normal.\"\u003c/p\u003e\n\u003cp\u003e\"Who says so? I don\u0027t trust the damn lab. Half the time they don\u0027t know what they\u0027re doing. And make sure there\u0027s no mix-up on the blood transfusion.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make sure,\" Kat said patiently.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s doing the operation?\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Jurgenson and I. Dr. Franklin, I promise you, there\u0027s nothing for you to worry about.\"\u003c/p\u003e\n\u003cp\u003e\"Whose brain are they operating on, yours or mine? All operations are risky. You know why? Because half of the damned surgeons are in the wrong profession. They should have been butchers.\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Jurgenson is very capable.\"\u003c/p\u003e\n\u003cp\u003e\"I know he is, or I wouldn\u0027t let him touch me. Who\u0027s the anesthesiologist?\"\u003c/p\u003e\n\u003cp\u003e\"I believe it\u0027s Dr. Miller.\"\u003c/p\u003e\n\u003cp\u003e\"That quack? I don\u0027t want him. Get me someone else.\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Franklin ...\"\u003c/p\u003e\n\u003cp\u003e\"Get me someone else. See if Haliburton is available.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"And get me the names of the nurses in the OR. I want to check them out.\"\u003c/p\u003e\n\u003cp\u003eKat looked him in the eye. \"Would you prefer to do the operation yourself?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" He stared at her a moment, then smiled sheepishly. \"I guess not.\"\u003c/p\u003e\n\u003cp\u003eKat said gently, \"Then why don\u0027t you let us handle it?\"\u003c/p\u003e\n\u003cp\u003e\"Okay. You know something? I like you.\"\u003c/p\u003e\n\u003cp\u003e\"I like you, too. Did the nurse give you a sedative?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"All right. We\u0027ll be ready in a few minutes. Is there anything I can do for you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Teach my stupid nurse where my veins are located.\"\u003c/p\u003e\n\u003cp\u003e\"All right. We\u0027ll be ready in a few minutes. Is there anything else I can do for you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Teach my stupid nurse where my veins are located.\"\u003c/p\u003e\n\u003cp\u003eIn OR Four, the brain surgery on Dr. Mervyn Franklin was going perfectly. He had complained every step of the way from his room to the operating theater.\u003c/p\u003e\n\u003cp\u003e\"Now mind you,\" he said, \"minimal anesthetic. The brain has no feeling, so once you get in there, you won\u0027t need much.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m aware of that,\" Kat said patiently.\u003c/p\u003e\n\u003cp\u003e\"And see that the temperature is kept down to forty degrees. That\u0027s maximum.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s have some fast music on during the operation. Keep you all on your toes.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"And make sure you have a top scrub nurse in there.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eAnd on and on it went.\u003c/p\u003e\n\u003cp\u003eWhen the opening in Dr. Franklin\u0027s skull was drilled, Kat said, \"I see the clot. It doesn\u0027t look too bad.\" She went to work.\u003c/p\u003e\n\u003cp\u003eThree hours later as they were beginning to close the incision, George Englund, the chief of surgery, came into the operating room and went up to Kat.\u003c/p\u003e\n\u003cp\u003e\"Kat, are you almost through here?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re just wrapping it up.\"\u003c/p\u003e\n\u003cp\u003e\"Let Dr. Jurgenson take over. We need you fast. There\u0027s an emergency.\"\u003c/p\u003e\n\u003cp\u003eKat nodded. \"Coming.\" She turned to Jurgenson. \"Will you finish up here?\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\"\u003c/p\u003e\n\u003cp\u003eKat walked out with George Englund. \"What\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003e\"You were scheduled to do an operation later, but your patient has started to hemorrhage. They\u0027re taking him to OR Three now. It doesn\u0027t look as though he\u0027s going to make it. You\u0027ll have to operate right away.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"A Mr. Dinetto.\"\u003c/p\u003e\n\u003cp\u003eKat looked at him aghast. \"Dinetto?\" If Mr. Dinetto dies, you and your fucking family are gonna be wiped out.\u003c/p\u003e\n\u003cp\u003eKat hurried down the corridor that led to OR Three. Approaching her were Rhino and the Shadow.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\" Rhino demanded.\u003c/p\u003e\n\u003cp\u003eKat\u0027s mouth was so dry that it was difficult to speak. \"Mr. Dinetto started hemorrhaging. We must operate right away.\"\u003c/p\u003e\n\u003cp\u003eThe Shadow grabbed her arm. \"Then do it! But remember what we told you. Keep him alive.\" Kat pulled away and hurried into the operating room.\u003c/p\u003e\n\u003cp\u003eBecause of the change in schedule, Dr. Vance was doing the operation with Kat. He was a good surgeon. Kat began the ritual scrub: a half minute on each arm first, then a half minute on each hand. She repeated it and then scrubbed her nails.\u003c/p\u003e\n\u003cp\u003eDr. Vance stepped in beside her and started his scrub. \"How are you feeling?\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" Kat lied.\u003c/p\u003e\n\u003cp\u003eLou Dinetto was wheeled into the operating room on a gurney, semiconscious, and carefully transferred to the operating table. His shaven head was scrubbed and painted with Merthiolate solution that gleamed a bright orange under the operating lights. He was as pale as death.\u003c/p\u003e\n\u003cp\u003eThe team was in place: Dr. Vance, another resident, an anesthesiologist, two scrub nurses, and a circulating nurse. Kat checked to make sure that everything they might require was there. She glanced at the wall monitors - oxygen saturation, carbon dioxide, temperature, muscle stimulators, precordial stethoscope, EKG, automatic blood pressure, and disconnect alarms. Everything was in order.\u003c/p\u003e\n\u003cp\u003eThe anesthesiologist strapped a blood pressure cuff on Dinetto\u0027s right arm, then placed a rubber mask over the patient\u0027s face. \"All right, now. Breathe deeply. Take three big breaths.\"\u003c/p\u003e\n\u003cp\u003eDinetto was asleep before the third breath. The procedure began.\u003c/p\u003e\n\u003cp\u003eKat was reporting aloud. \"There\u0027s an area of damage in the middle of the brain, caused by a clot that\u0027s broken off the aorta valve. It\u0027s blocking a small blood vessel on the right side of the brain and extending slightly into the left half.\" She probed deeper. \"It\u0027s at the lower edge of the aqueduct of Sylvius. Scalpel.\"\u003c/p\u003e\n\u003cp\u003eA tiny burr hole about the size of a dime was made by an electric drill to expose the dura mater. Next, Kat cut open the dura to expose a segment of the cerebral cortex that lay underneath. \"Forceps!\"\u003c/p\u003e\n\u003cp\u003eThe scrub nurse handed her the electric forceps.\u003c/p\u003e\n\u003cp\u003eThe incision was held open by a small retractor which maintained itself in place.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a hell of a lot of bleeding,\" Vance said.\u003c/p\u003e\n\u003cp\u003eKat picked up the bovie and started to cauterize the bleeders. \"We\u0027re going to control it.\"\u003c/p\u003e\n\u003cp\u003eDr. Vance started suction on soft cotton patties that were placed on the dura. The oozing veins on the surface of the dura were identified and coagulated.\u003c/p\u003e\n\u003cp\u003e\"It looks good,\" Vance said. \"He\u0027s going to make it.\"\u003c/p\u003e\n\u003cp\u003eKat breathed a sigh of relief.\u003c/p\u003e\n\u003cp\u003eAnd at that instant, Lou Dinetto stiffened and hi? body went into spasm. The anesthesiologist called out, \"Blood pressure\u0027s dropping!\"\u003c/p\u003e\n\u003cp\u003eKat said, \"Get some more blood into him!\"\u003c/p\u003e\n\u003cp\u003eThey were all looking at the monitor. The curve was rapidly flattening out. There were two quick heartbeat* followed by ventricular fibrillation.\u003c/p\u003e\n\u003cp\u003e\"Shock him!\" Kat snapped. She quickly attached the electric pads to his body and turned on the machine.\u003c/p\u003e\n\u003cp\u003eDinetto\u0027s chest heaved up once and then fell.\u003c/p\u003e\n\u003cp\u003e\"Inject him with epinephrine! Quick!\"\u003c/p\u003e\n\u003cp\u003e\"No heartbeat!\" the anesthesiologist called out a moment later.\u003c/p\u003e\n\u003cp\u003eKat tried again, raising the dial.\u003c/p\u003e\n\u003cp\u003eOnce again, there was a quick convulsive movement.\u003c/p\u003e\n\u003cp\u003e\"No heartbeat!\" the anesthesiologist cried. \"Asystole. No rhythm at all.\"\u003c/p\u003e\n\u003cp\u003eDesperately, Kat tried one last time. The body rose higher this time, then fell again. Nothing.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s dead,\" Dr. Vance said. \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-22.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
