{"id":68903,"no":26,"title":"Page 26","content":"\u003cp\u003ePaige stood there, frozen. Alfred smiled. \"May I come in?\" She was flustered. \"Of... of course. I\u0027m ... sorry.\" She watched Alfred walk into the living room, and she was filled with conflicting emotions. She was happy and excited and angry at the same time. Why am I going on like this? Paige thought. He probably dropped by to say hello.\u003c/p\u003e\n\u003cp\u003eAlfred turned to her. \"I\u0027ve left Karen.\"\u003c/p\u003e\n\u003cp\u003eThe words were a shock.\u003c/p\u003e\n\u003cp\u003eAlfred moved closer to her. \"I made a big mistake, Paige. I never should have let you go. Never.\"\u003c/p\u003e\n\u003cp\u003e\"Alfred...\" Paige suddenly remembered. \"Excuse me.\"\u003c/p\u003e\n\u003cp\u003eShe hurried to the telephone and picked it up. \"Jason?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Paige. About tonight, we could - \"\u003c/p\u003e\n\u003cp\u003e\"I ...I can\u0027t see you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. If tonight is bad, what about tomorrow night?\"\u003c/p\u003e\n\u003cp\u003e\"I ... I\u0027m not sure.\"\u003c/p\u003e\n\u003cp\u003eHe sensed the tension in her voice. \"Is anything wrong?\"\u003c/p\u003e\n\u003cp\u003e\"No. Everything is fine. I\u0027ll call you tomorrow and explain.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" He sounded puzzled.\u003c/p\u003e\n\u003cp\u003ePaige replaced the receiver.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve missed you, Paige,\" Alfred said. \"Have you missed me?\"\u003c/p\u003e\n\u003cp\u003eNo. I just follow strangers on the street and call them Alfred. \"Yes,\" Paige admitted.\u003c/p\u003e\n\u003cp\u003e\"Good. We belong together, you know. We always have.\"\u003c/p\u003e\n\u003cp\u003eHave we? Is that why you married Karen? Do you think you can walk in and out of my life any time you please?\u003c/p\u003e\n\u003cp\u003eAlfred was standing close to her. \"Haven\u0027t we?\"\u003c/p\u003e\n\u003cp\u003ePaige looked at him and said, \"I don\u0027t know.\" It was all too sudden.\u003c/p\u003e\n\u003cp\u003eAlfred took her hand in his. \"Of course you do.\"\u003c/p\u003e\n\u003cp\u003e\"What happened with Karen?\"\u003c/p\u003e\n\u003cp\u003eAlfred shrugged. \"Karen was a mistake. I kept thinking about you and all the great times we had. We were always good for each other.\"\u003c/p\u003e\n\u003cp\u003eShe was watching him, wary, guarded. \"Alfred ...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here to stay, Paige. When I say \u0027here,\u0027 I don\u0027t exactly mean that. We\u0027re going to New York.\"\u003c/p\u003e\n\u003cp\u003e\"New York?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027ll tell you all about it. I could use a cup of coffee.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. I\u0027ll make a fresh pot. It will just take a few minutes.\"\u003c/p\u003e\n\u003cp\u003eAlfred followed her into the kitchen, where Paige began to prepare the coffee. She was trying to get her thoughts in order. She had wanted Alfred back so desperately, and now that he was here ...\u003c/p\u003e\n\u003cp\u003eAlfred was saying, \"I\u0027ve learned a lot in the last few years, Paige. I\u0027ve grown up.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You know I\u0027ve been working with WHO all these years.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"Those countries haven\u0027t changed any since we were kids. In fact, some of them are worse. There\u0027s more disease down there, more poverty ...\"\u003c/p\u003e\n\u003cp\u003e\"But you were there, helping,\" Paige said.\u003c/p\u003e\n\u003cp\u003e\"Yes, and I suddenly woke up.\"\u003c/p\u003e\n\u003cp\u003e\"Woke up?\"\u003c/p\u003e\n\u003cp\u003e\"I realized I was throwing my life away. I was down there, living in misery, working twenty-four hours a day, helping those ignorant savages, when I could have been making a bundle of money over here.\"\u003c/p\u003e\n\u003cp\u003ePaige was listening in disbelief.\u003c/p\u003e\n\u003cp\u003e\"I met a doctor who has a practice on Park Avenue in New York. Do you know how much he makes a year? Over five hundred thousand dollars! Did you hear me? Five hundred thousand a year!\"\u003c/p\u003e\n\u003cp\u003ePaige was staring at him.\u003c/p\u003e\n\u003cp\u003e\"I said to myself, \u0027Where has that kind of money been all of my life?\u0027 He offered me a position as an associate,\" Alfred said proudly, \"and I\u0027m going in with him. That\u0027s why you and I are going to New York.\"\u003c/p\u003e\n\u003cp\u003ePaige stood there, numbed by what she was hearing.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be able to afford a penthouse apartment for us, and to get you pretty dresses, and all the things I\u0027ve always promised you.\" He was grinning. \"Well, are you surprised?\"\u003c/p\u003e\n\u003cp\u003ePaige\u0027s mouth was dry. \"I ... I don\u0027t know what to say, Alfred.\"\u003c/p\u003e\n\u003cp\u003eHe laughed. \"Of course you don\u0027t. Five hundred thousand dollars a year is enough to make anyone speechless.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t thinking of the money,\" Paige said slowly.\u003c/p\u003e\n\u003cp\u003e\"No?\"\u003c/p\u003e\n\u003cp\u003eShe was studying him, as though seeing him for the first time. \"Alfred, when you were working for WHO, didn\u0027t you feel you were helping people?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Nothing can help those people. And who the hell really cares? Would you believe that Karen wanted me to stay down there in Bangladesh? I told her no way, so she went back.\" He took Paige\u0027s hand. \"So here I am. ... You\u0027re a little quiet. I guess you\u0027re overwhelmed by all this, huh?\"\u003c/p\u003e\n\u003cp\u003ePaige thought of her father. He would have been a big success on Park Avenue, but he wasn\u0027t interested in money. His only interest was in helping people.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve already divorced Karen, so we can get married right away.\" He patted her hand. \"What do you think of the idea of living in New York?\"\u003c/p\u003e\n\u003cp\u003ePaige took a deep breath. \"Alfred ...\"\u003c/p\u003e\n\u003cp\u003eThere was an expectant smile on his face. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Get out.\"\u003c/p\u003e\n\u003cp\u003eThe smile slowly faded. \"What?\"\u003c/p\u003e\n\u003cp\u003ePaige rose. \"I want you to get out of here.\"\u003c/p\u003e\n\u003cp\u003eHe was confused. \"Where do you want me to go?\" \"I won\u0027t tell you,\" Paige said. \"It would hurt your feelings.\"\u003c/p\u003e\n\u003cp\u003eAfter Alfred had gone, Paige sat lost in thought. Kat had been right. She had been clinging to a ghost. Helping those ignorant savages, when I could have been making a bundle over here... . Five hundred thousand a year!\u003c/p\u003e\n\u003cp\u003eAnd that\u0027s what I\u0027ve been hanging on to, Paige thought wonderingly. She should have felt depressed, but instead she was filled with a feeling of elation. She suddenly felt free. She knew now what she wanted.\u003c/p\u003e\n\u003cp\u003eShe walked over to the telephone and dialed Jason\u0027s number.\u003c/p\u003e\n\u003cp\u003e\"Hello.\"\u003c/p\u003e\n\u003cp\u003e\"Jason, it\u0027s Paige. Remember telling me about your house in Noe Valley?\"\u003c/p\u003e\n\u003cp\u003e\"Yes ...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to see it. Are you free tonight?\"\u003c/p\u003e\n\u003cp\u003eJason said quietly, \"Do you want to tell me what\u0027s going on, Paige? I\u0027m very confused.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the one who\u0027s confused. I thought I was in love with a man I knew a long time ago, but he\u0027s not the same man. I know what I want now.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I want to see your house.\"\u003c/p\u003e\n\u003cp\u003eNoe Valley belonged to another century. It was a colorful oasis in the heart of one of the most cosmopolitan cities in the world.\u003c/p\u003e\n\u003cp\u003eJason\u0027s house was a reflection of him - comfortable, neat, and charming. He escorted Paige through the house. \"This is the living room, the kitchen, the guest bathroom, the study ...\"He looked at her and said, \"The bedroom is upstairs. Would you like to see it?\"\u003c/p\u003e\n\u003cp\u003ePaige said quietly, \"Very much.\"\u003c/p\u003e\n\u003cp\u003eThey went up the stairs into the bedroom. Paige\u0027s heart was pounding wildly. But what was happening seemed inevitable. I should have known from the beginning, she thought.\u003c/p\u003e\n\u003cp\u003ePaige never knew who made the first move, but somehow they were in each other\u0027s arms and Jason\u0027s lips were on hers, and it seemed the most natural thing in the world. They started to undress each other, and there was a fierce urgency in both of them. And then they were in bed, and he was making love to her.\u003c/p\u003e\n\u003cp\u003e\"God,\" he whispered. \"I love you.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Paige teased. \"Ever since I told you to put on the white coat.\"\u003c/p\u003e\n\u003cp\u003eAfter they made love, Paige said, \"I\u0027d like to spend the night here.\"\u003c/p\u003e\n\u003cp\u003eJason smiled. \"You won\u0027t hate me in the morning?\"\u003c/p\u003e\n\u003cp\u003e\"I promise.\"\u003c/p\u003e\n\u003cp\u003ePaige spent the night with Jason, talking ... making love ... talking. In the morning, she cooked breakfast for him.\u003c/p\u003e\n\u003cp\u003eJason watched her, and said, \"I don\u0027t know how I got so lucky, but thank you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the lucky one,\" Paige told him.\u003c/p\u003e\n\u003cp\u003e\"You know something? I never got an answer to my proposal.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have an answer this afternoon.\"\u003c/p\u003e\n\u003cp\u003eThat afternoon, a messenger arrived at Jason\u0027s office, with an envelope. Inside was the card that Jason had sent with the model house.\u003c/p\u003e\n\u003cp\u003eMine [ ]\u003c/p\u003e\n\u003cp\u003eOurs [ x ]\u003c/p\u003e\n\u003cp\u003ePlease check one. \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-26.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
