{"id":68873,"no":8,"title":"Page 8","content":"\u003cp\u003eHospitals are run by nurses. Margaret Spencer, the chief nurse, had worked at Embarcadero County Hospital for twenty years and knew where all the bodies - literally and figuratively - were buried. Nurse Spencer was in charge of the hospital, and doctors who did not recognize it were in trouble. She knew which doctors were on drugs or addicted to alcohol, which doctors were incompetent, and which doctors deserved her support. In her charge were all the student nurses, registered nurses, and operating room nurses. It was Margaret Spencer who decided which of them would be assigned to the various surgeries, and since the nurses ranged from indispensable to incompetent, it paid the doctors to get along with her. She had the power to assign an inept scrub nurse to assist on a complicated kidney removal, or, if she liked the doctor, to send her most competent nurse to help him with a simple tonsillectomy. Among Margaret Spencer\u0027s many prejudices was an antipathy to women doctors and to blacks. Kat Hunter was a black woman doctor.\u003c/p\u003e\n\u003cp\u003eKat was having a hard time. Nothing was overtly said or done, and yet prejudice was at work in ways too subtle to pin down. The nurses she asked for were unavailable, those assigned to her were close to incompetent. Kat found herself frequently being sent to examine male clinic patients with venereal diseases. She accepted the first few cases as routine, but when she was given half a dozen to examine in one day, she became suspicious.\u003c/p\u003e\n\u003cp\u003eAt a lunch break she said to Paige, \"Have you examined many men with venereal disease?\"\u003c/p\u003e\n\u003cp\u003ePaige thought for a moment. \"One last week. An orderly.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m going to have to do something about this, Kat thought.\u003c/p\u003e\n\u003cp\u003eNurse Spencer had planned to get rid of Dr. Hunter by making her life so miserable that she would be forced to quit, but she had not counted on Kat\u0027s dedication or her ability. Little by little, Kat was winning over the people she worked with. She had a natural skill that impressed her fellow workers as well as her patients. But the real breakthrough happened because of what came to be known around the hospital as the famous pig blood caper.\u003c/p\u003e\n\u003cp\u003eOn morning rounds one day, Kat was working with a senior resident named Dundas. They were at the bedside of a patient who was unconscious.\u003c/p\u003e\n\u003cp\u003e\"Mr. Levy was in an automobile accident,\" Dundas informed the younger residents. \"He\u0027s lost a great deal of blood, and he needs an immediate transfusion. The hospital is short of blood right now. This man has a family, and they refuse to donate any blood to him. It\u0027s infuriating.\"\u003c/p\u003e\n\u003cp\u003eKat asked, \"Where is his family?\" \"In the visitors\u0027 waiting room,\" Dr. Dundas said. \"Do you mind if I talk to them?\" Kat asked. \"It won\u0027t do any good. I\u0027ve already spoken to them. They\u0027ve made up their minds.\"\u003c/p\u003e\n\u003cp\u003eWhen the rounds were over, Kat went into the visitors\u0027 waiting room. The man\u0027s wife and grown son and daughter were there. The son wore a yarmulke and ritual tallis.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Levy?\" Kat asked the woman. She stood up. \"How is my husband? Is the doctor going to operate?\" \"Yes,\" Kat said.\u003c/p\u003e\n\u003cp\u003e\"Well, don\u0027t ask us to give any of our blood. It\u0027s much too dangerous these days, with AIDS and all.\" \"Mrs. Levy,\" Kat said, \"you can\u0027t get AIDS by donating blood. It\u0027s not poss - \"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t tell me! I read the papers. I know what\u0027s what.\"\u003c/p\u003e\n\u003cp\u003eKat studied her a moment. \"I can see that. Well, it\u0027s all right, Mrs. Levy. The hospital is short of blood right now, but we\u0027ve solved the problem.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to give your husband pig\u0027s blood.\"\u003c/p\u003e\n\u003cp\u003eThe mother and son were staring at Kat, shocked.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Pig\u0027s blood,\" Kat said cheerfully. \"It probably won\u0027t do him any harm.\" She turned to leave.\u003c/p\u003e\n\u003cp\u003e\"Wait a minute!\" Mrs. Levy cried.\u003c/p\u003e\n\u003cp\u003eKat stopped. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I, uh ... just give us a minute, will you?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly.\"\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, Kat went up to Dr. Dundas. \"You don\u0027t have to worry about Mr. Levy\u0027s family anymore. They\u0027re all happy to make a blood donation.\"\u003c/p\u003e\n\u003cp\u003eThe story became an instant legend around the hospital. Doctors and nurses who had ignored Kat before made a point of speaking to her.\u003c/p\u003e\n\u003cp\u003eA few days later, Kat went into the private room of Tom Leonard, an ulcer patient. He was eating an enormous lunch that he had had brought in from a nearby delicatessen.\u003c/p\u003e\n\u003cp\u003eKat walked up to his bed. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003eHe looked up and smiled. \"Having a decent lunch for a change. Want to join me? There\u0027s plenty here.\"\u003c/p\u003e\n\u003cp\u003eKat rang for a nurse.\u003c/p\u003e\n\u003cp\u003e\"Yes, doctor?\"\u003c/p\u003e\n\u003cp\u003e\"Get this food out of here. Mr. Leonard is on a strict hospital diet. Didn\u0027t you read his chart?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but he insisted on - \"\u003c/p\u003e\n\u003cp\u003e\"Remove it, please.\"\u003c/p\u003e\n\u003cp\u003e\"Hey! Wait a minute!\" Leonard protested. \"I can\u0027t eat the pap this hospital is giving me!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll eat it if you want to get rid of your ulcer.\" Kat looked at the nurse. \"Take it out.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later, Kat was summoned to the office of the administrator.\u003c/p\u003e\n\u003cp\u003e\"You wanted to see me, Dr. Wallace?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Sit down. Tom Leonard is one of your patients, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\u0027 \"That\u0027s right. I found him eating a hot pastrami sandwich with pickles and potato salad for lunch today, full of spices and - \"\u003c/p\u003e\n\u003cp\u003e\"And you took it away from him.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eWallace leaned forward in his chair. \"Doctor, you probably were not aware that Tom Leonard is on the hospital\u0027s supervisory board. We want to keep him happy. Do you get my meaning?\"\u003c/p\u003e\n\u003cp\u003eKat looked at him and said stubbornly, \"No, sir.\"\u003c/p\u003e\n\u003cp\u003eHe blinked. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"It seems to me that the way to keep Tom Leonard happy is to get him healthy. He\u0027s not going to be cured if he tears his stomach apart.\"\u003c/p\u003e\n\u003cp\u003eBenjamin Wallace forced a smile. \"Why don\u0027t we let him make that decision?\"\u003c/p\u003e\n\u003cp\u003eKat stood up. \"Because I\u0027m his doctor. Is there anything else?\"\u003c/p\u003e\n\u003cp\u003e\"I ... er ... no. That\u0027s all.\"\u003c/p\u003e\n\u003cp\u003eKat walked out of the office.\u003c/p\u003e\n\u003cp\u003eBenjamin Wallace sat there stunned. Women doctors.\u003c/p\u003e\n\u003cp\u003eKat was on night duty when she received a call. \"Dr. Hunter, I think you had better come up to 320.\"\u003c/p\u003e\n\u003cp\u003e\"Right away.\"\u003c/p\u003e\n\u003cp\u003eThe patient in Room 320 was Mrs. Molloy, a cancer patient in her eighties, with a poor prognosis. As Kat neared the door she heard voices inside, raised in argument. Kat stepped inside the room.\u003c/p\u003e\n\u003cp\u003eMrs. Molloy was in bed, heavily sedated, but conscious. Her son and two daughters were in the room.\u003c/p\u003e\n\u003cp\u003eThe son was saying, \"I say we split the estate up three ways.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" one of the daughters said. \"Laurie and I are the ones who have been taking care of Mama. Who\u0027s been doing the cooking and cleaning for her? We have! Well, we\u0027re entitled to her money and - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m as much her flesh and blood as you are!\" the man yelled.\u003c/p\u003e\n\u003cp\u003eMrs. Molloy lay in bed, helpless, listening.\u003c/p\u003e\n\u003cp\u003eKat was furious. \"Excuse me,\" she said.\u003c/p\u003e\n\u003cp\u003eOne of the women glanced at her. \"Come back later, nurse. We\u0027re busy.\"\u003c/p\u003e\n\u003cp\u003eKat said angrily, \"This is my patient. I\u0027m giving you all ten seconds to get out of this room. You can wait in the visitors\u0027 waiting room. Now get out before I call security and have you thrown out.\"\u003c/p\u003e\n\u003cp\u003eThe man started to say something, but the look in Kat\u0027s eyes stopped him. He turned to his sisters and shrugged. \"We can talk outside.\"\u003c/p\u003e\n\u003cp\u003eKat watched the three of them leave the room. She turned to Mrs. Molloy in bed and stroked her head. \"They didn\u0027t mean anything by it,\" Kat said softly. She sat at the bedside, holding the old woman\u0027s hand, and watched her drop off to sleep.\u003c/p\u003e\n\u003cp\u003eWe\u0027re all dying, Kat thought. Forget what Dylan Thomas said. The real trick is to go gentle into that good night.\u003c/p\u003e\n\u003cp\u003eKat was in the middle of treating a patient when an orderly came into the ward. \"There\u0027s an urgent call for you at the desk, doctor.\"\u003c/p\u003e\n\u003cp\u003eKat frowned. \"Thank you.\" She turned to the patient, who was in a full body cast, with his legs suspended on a pulley. \"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eIn the corridor, at the nurses\u0027 station, Kat picked up the desk telephone. \"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Hi, sis.\"\u003c/p\u003e\n\u003cp\u003e\"Mike!\" She was excited to hear from him, but her excitement immediately turned to concern. \"Mike, I told you never to call me here. You have the number at the apartment if - \"\u003c/p\u003e\n\u003cp\u003e\"Hey, I\u0027m sorry. This couldn\u0027t wait. I have a little problem.\"\u003c/p\u003e\n\u003cp\u003eKat knew what was coming.\u003c/p\u003e\n\u003cp\u003e\"I borrowed some money from a fellow to invest in a business ...\"\u003c/p\u003e\n\u003cp\u003eKat didn\u0027t bother asking what kind of business. \"And it failed.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. And now he wants his money.\"\u003c/p\u003e\n\u003cp\u003e\"How much, Mike?\"\u003c/p\u003e\n\u003cp\u003e\"Well, if you could send five thousand ...\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eThe desk nurse was looking at Kat curiously.\u003c/p\u003e\n\u003cp\u003eFive thousand dollars. Kat lowered her voice. \"I don\u0027t have that much. I ... I can send you half and the rest in a few weeks. Will that be all right?\"\u003c/p\u003e\n\u003cp\u003e\"I guess so. I hate to bother you, sis, but you how it is.\"\u003c/p\u003e\n\u003cp\u003eKat knew exactly how it was. Her brother was twenty two years old and was always involved in mysterious deals. He ran with gangs, and God only knew what they were up to, but Kat felt a deep responsibility toward him. It\u0027s all my fault, Kat thought. If I hadn\u0027t run away from home and deserted him ... \"Stay out of trouble, Mike. I love you.\"\u003c/p\u003e\n\u003cp\u003e\"Love you, too, Kat.\"\u003c/p\u003e\n\u003cp\u003eI\u0027ll have to get him that money, somehow, Kat thought. Mike\u0027s all I have in the world.\u003c/p\u003e\n\u003cp\u003eDr. Isler had been looking forward to working with Honey Taft again. He had forgiven her inept performance and, in fact, was flattered that she was in such awe of him. But now, on rounds with her once more, Honey stayed behind the other residents and never volunteered an answer to his questions.\u003c/p\u003e\n\u003cp\u003eThirty minutes after rounds, Dr. Isler was seated in Benjamin Wallace\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the problem?\" Wallace asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Dr. Taft.\"\u003c/p\u003e\n\u003cp\u003eWallace looked at him in genuine surprise, \"Dr. Taft? She has the best recommendations I\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what puzzles me,\" Dr. Isler said. \"I\u0027ve been getting reports from some of the other residents. She\u0027s misdiagnosing cases and making serious mistakes. I\u0027d like to know what the hell is going on.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand. She went to a fine medical school.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you should give the dean of the school a call,\" Dr. Isler suggested.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Jim Pearson. He\u0027s a good man. I\u0027ll call him.\"\u003c/p\u003e\n\u003cp\u003eA few minutes later, Wallace had Jim Pearson on the telephone. They exchanged pleasantries, and then Wallace said, \"I\u0027m calling about Betty Lou Taft.\"\u003c/p\u003e\n\u003cp\u003eThere was a brief silence. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"We seem to be having a few problems with her, Jim. She was admitted here with your wonderful recommendation.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"In fact, I have your report in front of me. It says she was one of the brightest students you ever had.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"And that she was going to be a credit to the medical profession.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Was there any doubt about ...?\"\u003c/p\u003e\n\u003cp\u003e\"None,\" Dr. Pearson said firmly. \"None at all. She\u0027s probably a little nervous. She\u0027s high-strung, but if you just give her a chance, I\u0027m sure she\u0027ll be fine.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I appreciate your telling me. We\u0027ll certainly give her every chance. Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Not at all.\" The line went dead.\u003c/p\u003e\n\u003cp\u003eJim Pearson sat there, hating himself for what he had done.\u003c/p\u003e\n\u003cp\u003eBut my wife and children come first. \u003c/p\u003e","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-8.html","bookId":2365,"creation":"Oct 5, 2019 10:11:31 AM","modification":"Oct 5, 2019 10:11:31 AM"}
