{"id":86497,"no":26,"title":"Page 26","content":"\u003cp\u003eChapter 35\u003c/p\u003e\n\u003cp\u003eDerek\u003c/p\u003e\n\u003cp\u003eI wake up with a hard-on. And my arm around Ashtyn. We’re spooning like a married couple and her long hair is in my face. The flowery smell of her perfume reminds me that while Ashtyn talks tough and is a football player, she’s 100 percent female. I did my best to stay on my side of the bed, but she kept moving closer. And closer. Then she told me she was cold and asked me to hold her, so I did.\u003c/p\u003e\n\u003cp\u003eThat was my first mistake.\u003c/p\u003e\n\u003cp\u003eI quickly take my arm off her and manage to get some space between us. I need to cool off. She was half-asleep when she asked me to hold her, so hopefully she won’t remember. I’m not about to play her temporary boyfriend until we get to Texas.\u003c/p\u003e\n\u003cp\u003ePink-haired Carrie is my type. She pouted after I turned her down when she’d asked if I wanted to spend the night in her tent. I’d told her I had a job to do as Her Highness’s bodyguard.\u003c/p\u003e\n\u003cp\u003eCarrie was looking for a good time.\u003c/p\u003e\n\u003cp\u003eAshtyn is looking for someone who won’t abandon her.\u003c/p\u003e\n\u003cp\u003eWhen she turned to me, was it just because I was a warm body? Or was it because it was me? Doesn’t matter. I unzip the tent and go make a fire. How did I get here? It’s because of that damn pig prank. Fucking pigs are the reason I’m here and not in my dorm room at Regents.\u003c/p\u003e\n\u003cp\u003eThis trip is only a few days. I can do anything for a couple of days, even try to stay as far away from Ashtyn as possible. I hear movement in the tent before she peeks her head out.\u003c/p\u003e\n\u003cp\u003e“Hey,” she says.\u003c/p\u003e\n\u003cp\u003e“Hey.” I point to a Pop-Tarts box on the hood of my car, but I don’t make eye contact with her. Instead, I stare into the flames of the fire I just built. “I got you some breakfast.”\u003c/p\u003e\n\u003cp\u003eShe opens the box. “Thanks,” she mumbles as she takes a bite.\u003c/p\u003e\n\u003cp\u003eI lean forward on my elbows and wonder what I’m gonna say to her. “We should pack up and head out soon,” I say stoically. “We’ve got a lot of drivin’ to do.”\u003c/p\u003e\n\u003cp\u003eWe spend the next twenty minutes packing up. She doesn’t look my way when we pull out of the campground and head to our next destination.\u003c/p\u003e\n\u003cp\u003e“Want to talk about last night?” she asks.\u003c/p\u003e\n\u003cp\u003e“The part where you were flirtin’ with those guys, or the part when you asked me to hold you?”\u003c/p\u003e\n\u003cp\u003e“I was not flirting with those guys. We were talking football.”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s right. You only like guys who play football.”\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?” When I don’t answer, she says, “Maybe we should start with the fact that you were getting all chummy with that girl with the pink hair. She just wanted to hook up.”\u003c/p\u003e\n\u003cp\u003e“That’s what makes it all the better. No emotional involvement. No strings attached. That’s what I call a perfect relationship.”\u003c/p\u003e\n\u003cp\u003e“That’s what I call skanky.” She curls her upper lip in disgust. “I feel sorry for your future wife. She’s destined to be a very lonely woman.”\u003c/p\u003e\n\u003cp\u003e“And I feel sorry for your future husband, who’s destined to disappoint you and your high expectations.”\u003c/p\u003e\n\u003cp\u003e“High expectations? My expectations aren’t high.”\u003c/p\u003e\n\u003cp\u003e“Really? Then don’t expect me to be your heater every night.”\u003c/p\u003e\n\u003cp\u003e“I won’t.”\u003c/p\u003e\n\u003cp\u003eAshtyn insists she needs to practice every day while we’re on the road. The girl is dedicated, I’ll give her that much. She searches for nearby parks on her phone, but nothing comes up, so I end up driving around looking for an open area.\u003c/p\u003e\n\u003cp\u003eWe come upon a high school with a football field out back. “What about there? It’s better than a park because you can actually kick through real goalposts and not imaginary ones.”\u003c/p\u003e\n\u003cp\u003eAshtyn shakes her head. “I can’t practice there. That’s private school property. Besides, there’s a fence around it and it’s locked.”\u003c/p\u003e\n\u003cp\u003eI look at her sideways. “So?”\u003c/p\u003e\n\u003cp\u003e“You’re not thinking about breaking in,” she says.\u003c/p\u003e\n\u003cp\u003e“Yeah, I am.”\u003c/p\u003e\n\u003cp\u003eShe keeps protesting while I park in the lot next to the field. “Come on,” I say. “It’s summer and nobody’s here. Trust me, it’s not a big deal. Nobody’s gonna care.”\u003c/p\u003e\n\u003cp\u003eI walk toward the gate. Ashtyn stays in the car for a few seconds, then follows after grabbing a football and ball holder from the backseat.\u003c/p\u003e\n\u003cp\u003e“This is a bad idea, Derek,” she says in a panicked voice. “I don’t do illegal things. I can’t do illegal things. If we get caught—”\u003c/p\u003e\n\u003cp\u003e“Keep your panties on, Sugar Pie. We’re not gonna get caught.” I examine the lock and know it won’t take me long to get it open. At Regents my friend Sam and I spent weeks practicing how to jimmy locks so we could get into the cafeteria and snatch food from the refrigerators at night.\u003c/p\u003e\n\u003cp\u003e“You are a thug,” Ashtyn says when the lock clicks open and I lead her onto the grassy field.\u003c/p\u003e\n\u003cp\u003eThug or not, she’s now got a place to practice.\u003c/p\u003e\n\u003cp\u003eI lean against the post and watch her set up. “I don’t suppose you want me to show you how to hold the ball so I can kick it from a live person?” she asks.\u003c/p\u003e\n\u003cp\u003e“Nah,” I say. “I’m good.”\u003c/p\u003e\n\u003cp\u003eShe shrugs, then kicks the ball effortlessly from the one yard line. It sails through the posts.\u003c/p\u003e\n\u003cp\u003e“Want to get the ball for me after I kick it?” she asks. “So I don’t have to run after it after every kick? It’ll go much faster.”\u003c/p\u003e\n\u003cp\u003e“Nah,” I say again. “I’m good.”\u003c/p\u003e\n\u003cp\u003e“You’re a lazy ass,” she mumbles as she fetches the ball and sets it up, this time on the five yard line.\u003c/p\u003e\n\u003cp\u003eShe spends over an hour setting up the ball, kicking it, then retrieving it. Each time she kicks, the ball sails through the posts. I see the concentration on her face as she takes a calming breath and calculates how far she’s got to kick it before her foot touches the ball.\u003c/p\u003e\n\u003cp\u003eThe girl is impressive.\u003c/p\u003e\n\u003cp\u003eAfter her practice, we’re back on the road. She’s leaning back with her eyes closed, nodding as she gets lost in the music through her earbuds, oblivious to everything else around her.\u003c/p\u003e\n\u003cp\u003eI drive to the next campground, a small private campground near Oklahoma City. There are only four campsites on the property, and two are vacant. Ashtyn is quiet as we set up our tent in our assigned spot before it gets dark and wash up in the bathrooms at the front of the property.\u003c/p\u003e\n\u003cp\u003eOur site is surrounded by trees. An old couple in a pop-up tent who introduced themselves as Irving and Sylvia are in the campsite next to us. We met the old couple on the way back from the bathrooms, while they were sitting next to their pop-up tent at their fold-out table.\u003c/p\u003e\n\u003cp\u003eIt’s still light as Ashtyn takes footballs out of the car and practices kicking again. She stretches first, and I find myself watching her as if she’s the star of an exercise show and it’s the most entertaining thing on television. She looks back at me. “You watching me?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Come here.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Just . . . come here.”\u003c/p\u003e\n\u003cp\u003eI walk over to her. She picks up one of the footballs by her feet and hands it to me. “You remember how to throw one?”\u003c/p\u003e\n\u003cp\u003eYeah. I look at the ball as if I’ve never held one in my hand before. “Not really.”\u003c/p\u003e\n\u003cp\u003e“Didn’t your dad throw a football around with you when you were a little kid, Derek?”\u003c/p\u003e\n\u003cp\u003e“He was kind of busy protectin’ our country,” I say, although that’s only half-true. He was busy protecting our country most of the time, but he did teach me how to throw a football. I must’ve been three when he first taught me how to throw a football. By the time I was eight, I begged my parents to constantly play football with me so I could practice my perfect spiral. I never stopped throwing the ball after that, and would recruit anyone who was around to go to the field with me so I could practice.\u003c/p\u003e\n\u003cp\u003eI hand the football back to her, but she pushes it in my hands. “Are you a righty or lefty?”\u003c/p\u003e\n\u003cp\u003e“Righty.”\u003c/p\u003e\n\u003cp\u003eShe takes my fingers and places them on the ball, then proceeds to tell me how to throw it. “The key is to let it roll off your fingers. I swear it’ll come back to you once you try it.”\u003c/p\u003e\n\u003cp\u003eI pretend like this is the first time holding a football and try not to crack a smile when she gives overly detailed instructions.\u003c/p\u003e\n\u003cp\u003e“If you’re such an expert at throwin’,” I tell her, “why aren’t you the quarterback?”\u003c/p\u003e\n\u003cp\u003eShe laughs. “I can’t throw as far or as accurately as Landon.” She shrugs. “Some guys are just born to throw footballs. Landon is a natural.”\u003c/p\u003e\n\u003cp\u003e“I’m sure there’s a slew of dudes who’re better.”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen anyone, especially in our division. His dad played professionally.”\u003c/p\u003e\n\u003cp\u003eThe way Ashtyn talks about Landon’s talent, you’d think he was some superhuman quarterback. It almost makes me want to show off my skills. Almost.\u003c/p\u003e\n\u003cp\u003eShe jogs away from me. “Okay, throw it!”\u003c/p\u003e\n\u003cp\u003eIt’s not easy for me to toss a football awkwardly, like I’m rusty, but I manage to do it. The ball tumbles through the air, then bounces on the ground with a thud. It’s not even close to the target.\u003c/p\u003e\n\u003cp\u003e“That was pathetic, Derek.”\u003c/p\u003e\n\u003cp\u003e“I know. I was an average ball player.”\u003c/p\u003e\n\u003cp\u003e“Try again,” she says encouragingly. “Remember to let the ball roll off your fingers as you throw it.”\u003c/p\u003e\n\u003cp\u003eI throw it again, this time managing to get it within ten yards of her but still out of reach.\u003c/p\u003e\n\u003cp\u003e“You sure you were born in America? You sure don’t throw a football like you were.”\u003c/p\u003e\n\u003cp\u003e“Not everyone can be as good as Landon, the ‘God of All Quarterbacks,’ I guess.”\u003c/p\u003e\n\u003cp\u003eShe tucks the balls under her arm. “Lesson over for today. And if you’re jealous of Landon, there’s no shame in admitting it.”\u003c/p\u003e\n\u003cp\u003e“I’m not jealous of him.” With a little practice I bet I could outthrow him.\u003c/p\u003e\n\u003cp\u003eAshtyn holds in a chuckle. “Yeah, right.”\u003c/p\u003e\n\u003cp\u003e“What do you love about the game?”\u003c/p\u003e\n\u003cp\u003e“I’ll explain it to you. To me it’s more than a game.” She touches her chest and says, “When you love something as much as I love football, you just feel it inside. Did you ever love doing something so bad that it consumed you?”\u003c/p\u003e\n\u003cp\u003e“A long time ago.”\u003c/p\u003e\n\u003cp\u003e“That’s what football is to me. It’s my passion, my life . . . my escape. When I play, I forget everything that sucks in my life. And when we win . . .” She looks down, like she’s embarrassed to admit what she’s about to reveal. “I know this is going to sound stupid, but when we win, I think miracles can happen.”\u003c/p\u003e\n\u003cp\u003e“Miracles, huh?”\u003c/p\u003e\n\u003cp\u003eShe nods. “I told you it was stupid.”\u003c/p\u003e\n\u003cp\u003e“It’s not stupid. I guess havin’ hope is better than givin’ up and thinking life will suck forever.”\u003c/p\u003e\n\u003cp\u003eWe start walking back to our campsite when Sylvia waves us over. “Come join us! We’ve got plenty of food. Irv, go get them chairs.”\u003c/p\u003e\n\u003cp\u003eAshtyn and I walk to their small table while Irv does what he’s told and Sylvia dishes out food.\u003c/p\u003e\n\u003cp\u003e“We don’t want to interrupt your dinner,” Ashtyn says, although she’s eyeing the chicken and rice as if it were a gourmet meal. She looks exhausted, but that chicken sure does bring a light to her eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/wild-cards-wild-cards-1/page-26.html","bookId":2770,"creation":"Oct 5, 2019 5:15:19 PM","modification":"Oct 5, 2019 5:15:19 PM"}
