{"id":88190,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eBLACKBURN, CALIFORNIA\u003c/p\u003e\n\u003cp\u003eThe building was in shambles, decades of dry desert weather taking a toll on the exterior. It had started out as a town hall, back when the mining companies had a stake in the land, but those times had long since passed. Now it stood alone, withering away in the dark of night—the sole lasting reminder that the area had once flourished.\u003c/p\u003e\n\u003cp\u003eWhat had been a place of assembly now held another gathering, one more sinister that seven-year-old Haven was learning about for the first time. Her legs shook and stomach churned as she followed her master into the building, staying on his heels but doing her best not to step on his shiny black shoes.\u003c/p\u003e\n\u003cp\u003eThey walked down a dark, narrow hall, passing a few men along the way. Haven kept her gaze on the floor, the sound of their voices as they greeted her master sending chills of fright down her back. These were new men, strangers, people she hadn’t known existed.\u003c/p\u003e\n\u003cp\u003eHe led her through a door at the end of the hallway, and what met them made her stop in her tracks. The stale scent of sweat and mildew saturated the room, heavy cigar smoke burning her nose. Masses of men stood around, talking loudly, as the sound of crying echoed off the walls, hitting the child like a freight train to the chest. She gasped, her heart racing as her eyes darted around looking for the source of the pain, but she couldn’t see past the sea of bodies.\u003c/p\u003e\n\u003cp\u003eHer master grabbed hold of her, forcing her in front of him. She cringed as his hands clamped down on her shoulders and walked again at his command. The crowd parted for them, giving the two a clear path, and Haven obediently made her way to the front. She could feel the men staring, their eyes like lasers that burned down deep, making her blood boil as her face turned bright red.\u003c/p\u003e\n\u003cp\u003eIn the front of the room, on a small stage, a few young girls knelt in a line. Tags were pinned to their ragged clothes, a number scribbled on it in black marker. Haven stood as still as possible, trying to ignore her master’s touch, and watched as the crowd tossed money around. One by one the girls were auctioned off to the highest bidder, tears staining their cheeks as men dragged them away.\u003c/p\u003e\n\u003cp\u003e“Frankie!”\u003c/p\u003e\n\u003cp\u003eHaven turned at the sound of her master’s name and recoiled from the man approaching. His face was like cracked leather and mangled with scars, his eyes a blackened pit of coal. In her frightened mind, she mistook him for a monster.\u003c/p\u003e\n\u003cp\u003eFrankie tightened his grip on her, locking her in place as he greeted the man. “Carlo.”\u003c/p\u003e\n\u003cp\u003e“I see you brought the girl,” Carlo said. “You getting rid of her? Because if so—”\u003c/p\u003e\n\u003cp\u003eFrankie cut him off before he could finish. “No, I just thought it would do her some good to see her own kind.”\u003c/p\u003e\n\u003cp\u003eHer own kind. The words fascinated Haven. She looked back at the stage as a new girl came out, a teenager who looked as if she’d been in a fight with some scissors. Dozens of holes peppered her clothes, and her blonde hair was haphazardly chopped in a pixie cut. She was gagged and shackled, the number 33 affixed to her shirt.\u003c/p\u003e\n\u003cp\u003eHaven wondered—Was she like her? Could they be the same?\u003c/p\u003e\n\u003cp\u003eNumber 33 struggled when the man gripped her arm, resisting more than the others. A split second changed everything as she pulled away, the metal binding her ankles making escape difficult. She jumped off the front of the stage and managed to stay on her feet, bolting for the crowd.\u003c/p\u003e\n\u003cp\u003eChaos erupted like a volcano, violent and sudden. Men shouted, and Haven held her breath as Frankie reacted, his movement fluid as he reached into his coat and pulled out a gun. A shot exploded beside Haven, and she jumped, her ears ringing from the sudden bang. Number 33 dropped, the bullet ripping through her forehead and splattering Haven’s blue-jean dress with fresh blood.\u003c/p\u003e\n\u003cp\u003eHyperventilating, Haven’s chest painfully heaved as she stared at the body on the floor by her bare feet. Blood streamed from the wound, soaking into the cracked wood and painting the girl’s blonde hair a deep shade of red. Her icy blue eyes remained open, boring into Haven like they could see through her skin.\u003c/p\u003e\n\u003cp\u003eFrankie returned the gun to his coat and bent down to Haven’s level. She tried to turn away from the carnage, but he gripped the back of her neck and forced her to look at Number 33.\u003c/p\u003e\n\u003cp\u003e“That’s what happens when people forget their place,” he said, his voice as cold as the dead eyes she stared into. “Remember that.”\u003c/p\u003e\n\u003cp\u003eHe stood, resuming his earlier position as he clutched her shoulders. The auction continued as if nothing had happened—as if an innocent girl weren’t slain in front of them all. Number 33 lay lifeless on the floor, and no one in the room gave her a second thought.\u003c/p\u003e\n\u003cp\u003eNo one, that is, except Haven. The vision of it would haunt her forever.\u003c/p\u003e\n\u003cp\u003eTEN YEARS LATER . . .\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eThe hot, dry air burned Haven’s chest. She gasped, struggling to breathe, as the dust kicked up by her frantic feet made it hard for her to see. It wasn’t as if it would help anyway, since it was pitch black out and she had no idea where she was. Everything appeared the same in every direction, nothing but desert all around.\u003c/p\u003e\n\u003cp\u003eHer feet felt like they were on fire as every muscle in her body screamed for her to stop. It grew harder and harder to continue with each step, her strength deteriorating as her adrenaline faded. A bang rang out, her footsteps faltering as she swung in the direction of the noise, spotting a faint glow of light in the distance. A house.\u003c/p\u003e\n\u003cp\u003eShe darted toward it, trying to yell for help but no sound escaped her throat. Her body revolted against her, giving out when she needed it most. The light grew brighter the harder she ran until all she saw was a flash of white. Blinded, she tripped and collapsed to the ground, pain running through her in waves as the light surrounding her burned out entirely.\u003c/p\u003e\n\u003cp\u003eThe basement was dark and damp, the only exit a set of metal doors locked with heavy chains. With no windows, it was sweltering, the air polluted with the stench of sewer. Dried blood tinged the concrete floor like old splatters of red paint, a grotesque canvas of prolonged misery.\u003c/p\u003e\n\u003cp\u003eHaven lay in the corner, her frail body unmoving, except for the subtle rise and fall of her chest. Her long brown hair, usually somewhat frizzy, was so matted it appeared only half its length. By society’s standards, she was as sickly as they come. Jutting collarbones and limbs like twigs, her ribs could be counted through her bruised and bloodied skin. She thought herself to be healthy, though. She’d seen people worse than her before.\u003c/p\u003e\n\u003cp\u003eThe day had begun like every other. Haven woke up at dawn and spent most of the morning cleaning. In the afternoon she spent some time with her mama, the two of them sitting against the side of the old wooden house. Neither spoke as the sound of the television filtered out of an open window above them. The news told of a hurricane brewing in the south and a war waging in Iraq, the significance of both lost on Haven.\u003c/p\u003e\n\u003cp\u003eHer mama said listening to it was a waste of time, because their slice of the world was barely a blip on the big radar, but Haven couldn’t help herself. The five o’clock news was the highlight of her day. She needed to feel like she was real, that something—or someone—she’d had contact with still existed out in the world, somewhere.\u003c/p\u003e\n\u003cp\u003eScreaming started inside the house, interrupting the news as fighting made its way into the living room. Haven climbed to her feet, not wanting to be caught eavesdropping, when she heard something that stopped her in her tracks. “I want the girl gone!”\u003c/p\u003e\n\u003cp\u003e“I know, Katrina! I’m working on it!”\u003c/p\u003e\n\u003cp\u003e“Not hard enough!” Katrina was the lady of the house, a harsh woman with short black hair and wickedly pointy features. “Get rid of her already!”\u003c/p\u003e\n\u003cp\u003eGet rid of her already. The words suffocated Haven. The fighting moved from the living room to upstairs, their voices fading as tense silence crept in.\u003c/p\u003e\n\u003cp\u003eShe was in serious trouble.\u003c/p\u003e\n\u003cp\u003e“This world’s scary,” her mama whispered. “People will hurt you. They’ll do things to you, sick things . . . the kind of things I hope you never know about. And they’ll trick you. They’ll lie to you. You have to be on guard at all times, baby girl.”\u003c/p\u003e\n\u003cp\u003eHaven didn’t like where the conversation was going. “Why are you telling me this?”\u003c/p\u003e\n\u003cp\u003e“Because you need to know,” she said. “You have to run.”\u003c/p\u003e\n\u003cp\u003eHaven stared at her in disbelief. “Run?”\u003c/p\u003e\n\u003cp\u003e“Yes, tonight. There’s more to life than this, and I’m afraid of what will happen if you stay here.”\u003c/p\u003e\n\u003cp\u003e“But I can’t run, Mama. I don’t know what’s out there!”\u003c/p\u003e\n\u003cp\u003e“People out there can help you.”\u003c/p\u003e\n\u003cp\u003eTears formed in Haven’s eyes. “I can’t leave you.”\u003c/p\u003e\n\u003cp\u003e“It’s the only way,” she said. “You have to get away from here, find someone and tell them who you are. They’ll—”\u003c/p\u003e\n\u003cp\u003e“Save you?” Haven asked, finishing her sentence. “Will they come here?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” Something sparked in her eyes. Hope?\u003c/p\u003e\n\u003cp\u003e“Then I’ll do it,” Haven said, “for you.”\u003c/p\u003e\n\u003cp\u003eAfter nightfall, when Haven thought no one would look for her until morning, she quietly slipped away. She ran for the world outside of the ranch, determined to find help so she’d never have to return.\u003c/p\u003e\n\u003cp\u003eWaking up in the musty basement, she realized she’d failed.\u003c/p\u003e\n\u003cp\u003eA clanking jolted Haven awake, a blinding light assaulting her. Cringing, she noticed the doors open and someone standing a few feet away. A man with olive skin approached, his dark hair slicked back on his head. He wore black pants and a white button-up shirt, the sleeves rolled up to his elbows. Haven gaped at the silver gun holstered to his belt.\u003c/p\u003e\n\u003cp\u003eHer voice cracked. “Are you the police?”\u003c/p\u003e\n\u003cp\u003eThe man knelt near her, setting a small black bag on the floor. He didn’t answer but gave her a bemused smile as he pressed his large palm to her forehead.\u003c/p\u003e\n\u003cp\u003eHaven closed her drowsy eyes and got lost in the silence until the man finally spoke. She opened her eyes again, surprised by his gentle tone, but recoiled when she met a hostile glare.\u003c/p\u003e\n\u003cp\u003eBehind the stranger stood someone she knew well. Michael, or Master as he preferred to be called, scowled at her with his dark eyes, the whites of them dingy yellow. His lip was curled in a sneer, his wiry hair graying around the ears.\u003c/p\u003e\n\u003cp\u003e“Relax, child,” the stranger said. “It’s going to be all right.”\u003c/p\u003e\n\u003cp\u003eShe looked at him, wondering if she could believe it, and panicked when he pulled a needle out of his bag. She whimpered, trying to move away, but he grabbed her and jabbed it into her shoulder blade.\u003c/p\u003e\n\u003cp\u003e“I’m not going to hurt you,” he said, letting go and handing the offending little weapon to Michael. “I’m only trying to help.”\u003c/p\u003e\n\u003cp\u003e“Help?” Her mama had told her people out there would help, but she’d also warned her that some of them would lie. Haven wasn’t sure which group this man fell in to, but she leaned toward the latter.\u003c/p\u003e\n\u003cp\u003e“Yes, help.” The man stood. “You need to rest. Save your energy.”\u003c/p\u003e\n\u003cp\u003eHe walked away, and her master followed him without saying a word. Haven lay there, too drained to make sense of it, and her eyes closed when she heard their voices again.\u003c/p\u003e\n\u003cp\u003e“She looks horrible!” the man yelled, all trace of kindness gone. “How could you let this happen, Antonelli?”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean for it to,” Michael said. “I didn’t know she’d try to run!” \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-1.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
