{"id":88208,"no":19,"title":"Page 19","content":"\u003cp\u003e“You’re welcome,” she said as something from the corner of her eye caught her attention. Dr. DeMarco was staring at her again.\u003c/p\u003e\n\u003cp\u003eThe home phone rang then, and everyone jumped at the shrill sound. Haven hadn’t heard it ring before. Her heart raced as Dr. DeMarco stood to grab it.\u003c/p\u003e\n\u003cp\u003e“What the fuck is that?”\u003c/p\u003e\n\u003cp\u003eHaven saw the baffled expression on Carmine’s face. “It’s the telephone.”\u003c/p\u003e\n\u003cp\u003e“No, I get that, but where did it come from?”\u003c/p\u003e\n\u003cp\u003eShe shrugged as Dr. DeMarco answered the call. “DeMarco residence . . . Wait, slow down . . . How many hits did you say you had?” Haven tried not to listen, but he spoke loudly. “How is that possible?”\u003c/p\u003e\n\u003cp\u003e“Seriously,” Carmine said. “When did we get a phone?”\u003c/p\u003e\n\u003cp\u003eDominic laughed. “Weeks ago.”\u003c/p\u003e\n\u003cp\u003eDr. DeMarco raised his voice more. “Do it again. If it comes out the same the second time, we’ll redo the entire thing, but it has to be wrong. There’s no way it’s true.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t anyone tell me?” Carmine asked.\u003c/p\u003e\n\u003cp\u003e“The better question, bro, is why didn’t you notice?”\u003c/p\u003e\n\u003cp\u003e“Keep it off the record,” Dr. DeMarco continued, speaking over all of them. “I don’t want this getting out until I can make sense of it. Capice?”\u003c/p\u003e\n\u003cp\u003eHe tossed the phone down, ending the call, and pinched the bridge of his nose. His gaze drifted to Carmine and Haven, his expression unreadable, but the raging fire was back in his eyes. Standing, he snatched the cherry Coke right out of Carmine’s hand, spilling some on the floor as he stalked out of the room. A moment later something crashed in the kitchen, the sound of a glass smashing as it was thrown into the metal sink.\u003c/p\u003e\n\u003cp\u003eStunned, Haven glanced at Carmine. “What happened?”\u003c/p\u003e\n\u003cp\u003eHe shrugged, staring at his empty hand. “Beats me. I didn’t even know we had a damn phone.”\u003c/p\u003e\n\u003cp\u003eThe door to the office on the second floor was uncharacteristically left open. Vincent sat behind his desk, his glasses low on his nose as he rummaged through files. Carmine stood in the doorway, watching him. “Who jizzed in your coffee?”\u003c/p\u003e\n\u003cp\u003eVincent’s head snapped up. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“What’s your problem?” Carmine elaborated as he stepped into the room and took a seat, not waiting for an invitation. “You were fine and then suddenly it was like you swallowed someone’s bitter junk.”\u003c/p\u003e\n\u003cp\u003eVincent shook his head. “Must you always be crass?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Carmine said. “Must you always be evasive?”\u003c/p\u003e\n\u003cp\u003e“Only when you ask questions you really don’t want the answers to,” Vincent said. “Did you need something? I have things to take care of.”\u003c/p\u003e\n\u003cp\u003e“Well, for one, I wanna know why you took my drink.”\u003c/p\u003e\n\u003cp\u003e“I was thirsty.”\u003c/p\u003e\n\u003cp\u003e“So you drank it?”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “Any other questions?”\u003c/p\u003e\n\u003cp\u003e“Yeah, why do you have Haven locked in here like she’s on house arrest?”\u003c/p\u003e\n\u003cp\u003e“She’s been outside,” Vincent said, casting him an incredulous look. “She seemed to enjoy herself at your game until you had one of your episodes.”\u003c/p\u003e\n\u003cp\u003e“One of my episodes? Is that what we’re calling them?”\u003c/p\u003e\n\u003cp\u003e“Unless you have a better name for it.”\u003c/p\u003e\n\u003cp\u003e“Whatever,” Carmine said. “The point is she rarely leaves. She doesn’t even have a code.”\u003c/p\u003e\n\u003cp\u003eVincent sighed exasperatedly. “Why do you suddenly care?”\u003c/p\u003e\n\u003cp\u003e“Because she’s a person.”\u003c/p\u003e\n\u003cp\u003e“So is Nicholas Barlow, but you never seem to be concerned about him.”\u003c/p\u003e\n\u003cp\u003e“It’s different. Someone ought to lock him up, but she’s just a girl. She’s harmless.”\u003c/p\u003e\n\u003cp\u003eVincent looked up again at those words, blinking a few times. “Are you suggesting you’ve never hurt a girl before, Carmine? Because I think a few would say differently.”\u003c/p\u003e\n\u003cp\u003eThe room remained silent. Carmine had no response. Vincent pushed his files aside and took off his glasses, sighing. “Look, she’s locked inside because I don’t have the time or the energy to take her anywhere, and there’s no one else to do it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, maybe you’re right,” Carmine said. “I don’t even have enough gas in my car to take myself anywhere right now.”\u003c/p\u003e\n\u003cp\u003e“How do you plan to get to school?”\u003c/p\u003e\n\u003cp\u003eCarmine shrugged. “Siphon the gas from your car while you sleep.”\u003c/p\u003e\n\u003cp\u003eContrary to the tension in the room, Vincent actually laughed at that. “You probably would.”\u003c/p\u003e\n\u003cp\u003eCarmine smirked. He would.\u003c/p\u003e\n\u003cp\u003eVincent opened his top desk drawer and pulled out the silver American Express card. “I tell you what—I’ll make you a deal.”\u003c/p\u003e\n\u003cp\u003eCarmine eyed him skeptically. “I’m listening.”\u003c/p\u003e\n\u003cp\u003e“I’ll give you the credit card back if you make more of an effort.”\u003c/p\u003e\n\u003cp\u003e“What, like keeping my room clean?”\u003c/p\u003e\n\u003cp\u003e“I said an effort, not a miracle. And what I mean is straighten yourself out. Stop the fighting, stop the drugs, pass your classes, and when I ask for a favor, I want you to actually do it.”\u003c/p\u003e\n\u003cp\u003e“Fair enough,” Carmine said, grabbing the credit card before his father could change his mind. “I’ll make an effort.”\u003c/p\u003e\n\u003cp\u003e“Great, because I need a favor.”\u003c/p\u003e\n\u003cp\u003eCarmine stared at him, not at all surprised.\u003c/p\u003e\n\u003cp\u003e“We need groceries,” Vincent said. “Enough stuff to last a while.”\u003c/p\u003e\n\u003cp\u003e“Like food and shit?”\u003c/p\u003e\n\u003cp\u003e“Just food, Carmine. But yes.”\u003c/p\u003e\n\u003cp\u003e“And you want me to get these groceries? On my own?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Vincent said. “Since you’re so concerned, take the girl with you.”\u003c/p\u003e\n\u003cp\u003eCarmine looked between his father and the credit card. “Is this a test? Because not two goddamn hours ago you said I was still cut off.”\u003c/p\u003e\n\u003cp\u003e“Things change, son.”\u003c/p\u003e\n\u003cp\u003e“What changed?”\u003c/p\u003e\n\u003cp\u003eVincent shook his head—evading again. “You want a chance to prove yourself? Do it. But don’t screw up this time, Carmine. If something happens to the girl, there will be more dire consequences than being cut off financially.”\u003c/p\u003e\n\u003cp\u003eCarmine stood up, figuring he needed to leave the room before his father came to his senses. “Does this mean I’m no longer grounded?”\u003c/p\u003e\n\u003cp\u003eVincent sighed. “You’ve been grounded since you were thirteen, and you’ll continue to be grounded for as long as you live under my roof. Not that being grounded has ever stopped you before . . .”\u003c/p\u003e\n\u003cp\u003e“So basically, I’m not really grounded.”\u003c/p\u003e\n\u003cp\u003e“Were you ever?”\u003c/p\u003e\n\u003cp\u003eCarmine laughed. “No.”\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eSunny Oaks Manor, located in the Hyde Park neighborhood of Chicago, looked like an upper-class apartment complex. The only thing that gave away its true nature was the staff, wearing the typical medical scrubs. Everyone was friendly, the facilities modern, but none of that mattered to Gia DeMarco.\u003c/p\u003e\n\u003cp\u003eVincent had done everything in his power to make her comfortable, insuring she had the biggest apartment and as many luxuries as allowed, but she held resentment that she’d been forced to move. Sunny Oaks wasn’t her home, she’d told him, and as far as she was concerned, it never would be.\u003c/p\u003e\n\u003cp\u003eGia sat in her chair at the window in her front room, dressed impeccably in a blue dress and black pumps as she gazed out at the courtyard. Vincent perched on the arm of the chair across from his mother, not surprised in the least when she refused to greet him. Same story, different day.\u003c/p\u003e\n\u003cp\u003e“It’s nice outside,” he said, attempting conversation. “We could go for a walk.”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen you in months, Vincenzo,” Gia said, her voice venomous. “Months.”\u003c/p\u003e\n\u003cp\u003eVincent sighed. “It’s been three weeks.”\u003c/p\u003e\n\u003cp\u003e“Three months, three weeks,” she said. “May as well have been three years. You don’t care.”\u003c/p\u003e\n\u003cp\u003e“I do care, but I don’t live in Chicago anymore, remember?”\u003c/p\u003e\n\u003cp\u003e“Don’t remind me,” she said. “I hate thinking my only son abandoned his family.”\u003c/p\u003e\n\u003cp\u003eVincent knew by family she didn’t mean blood relatives. She was referring to la famiglia, where her true loyalty lay. If ever there was a stereotypical Mafia wife, dedicated to the lifestyle until death, it was his mother.\u003c/p\u003e\n\u003cp\u003e“I didn’t abandon anyone,” Vincent said.\u003c/p\u003e\n\u003cp\u003e“You abandoned me,” Gia said. “You stuck me in this hospital.”\u003c/p\u003e\n\u003cp\u003e“It’s not a hospital. It’s a retirement community.”\u003c/p\u003e\n\u003cp\u003e“I don’t belong here,” she said. “I’m not sick! Your father, God rest his soul, would be ashamed of you.”\u003c/p\u003e\n\u003cp\u003eThat was nothing new. “How about that walk now?”\u003c/p\u003e\n\u003cp\u003e“I don’t care what these quacks say,” she said, ignoring his suggestion for the second time. “They can’t be trusted. They’re all probably working for the government. Kennedy always had it out for your father, you know. He tried to bring him down.”\u003c/p\u003e\n\u003cp\u003e“Kennedy’s dead,” Vincent said. “Has been for a long time.”\u003c/p\u003e\n\u003cp\u003e“I know that,” she spat. “I’m not crazy.”\u003c/p\u003e\n\u003cp\u003eVincent laughed dryly. The jury was still out on that. The doctors suspected Gia DeMarco suffered from early onset dementia, but Vincent leaned toward her simply refusing to move past her glory days. She didn’t want to admit life went on without her, that the world didn’t stop turning the day her husband died.\u003c/p\u003e\n\u003cp\u003eUsually lucid, every now and then she’d slip back to those times when Antonio DeMarco was the most powerful man in Chicago and Vincent still cared about making his parents proud.\u003c/p\u003e\n\u003cp\u003e“Some fresh air would be nice, don’t you think?”\u003c/p\u003e\n\u003cp\u003eGia reached up and rubbed her right ear, ignoring Vincent for the third time. “My ear’s ringing. That old hag Gertrude next door must be talking about me.”\u003c/p\u003e\n\u003cp\u003e“Did you take aspirin today? That can cause ear ringing.”\u003c/p\u003e\n\u003cp\u003e“It’s not the medication,” she said. “It’s her.”\u003c/p\u003e\n\u003cp\u003eHis mother was nothing if not superstitious. “Gertrude doesn’t seem like the gossiping type.”\u003c/p\u003e\n\u003cp\u003e“Like you could tell, Vincenzo. You have the judgment of an imbecile! You and your Irish—”\u003c/p\u003e\n\u003cp\u003e“Don’t start, Ma.” Vincent raised his voice as he cut her off. “I’m not going to listen to it again.”\u003c/p\u003e\n\u003cp\u003eGia was quiet, as if considering whether or not to finish her thought, but finally changed the subject. “Your sister visits me all the time. I see Corrado more than I see you.”\u003c/p\u003e\n\u003cp\u003eIt was a lie, but Vincent let it roll off his back.\u003c/p\u003e\n\u003cp\u003e“Now that’s what I call a good man,” she said. “Corrado’s loyal. Always has been. His only flaw is he never gave your sister any babies. I always wanted grandchildren.”\u003c/p\u003e\n\u003cp\u003e“You have grandchildren,” Vincent said. “Two of them.”\u003c/p\u003e\n\u003cp\u003eGia scoffed but managed to keep her opinion to herself. She stared out the window, shaking her head. “You don’t care about me, Vincenzo. You never even take me outside anymore.”\u003c/p\u003e\n\u003cp\u003eSince the DeMarcos had moved to North Carolina, the boys had thrown a Halloween party every year. Vincent was hesitant to agree this year, but after a bit of pestering and a lot of promising, he caved with one strict rule—Haven was to be watched at all times. \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-19.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
