{"id":88216,"no":27,"title":"Page 27","content":"\u003cp\u003e“I thought all chicks were afraid of snakes.”\u003c/p\u003e\n\u003cp\u003e“Not me.” She laughed. “I grew up with scorpions.”\u003c/p\u003e\n\u003cp\u003e“Are you afraid of anything?”\u003c/p\u003e\n\u003cp\u003e“Of course. Everyone’s afraid of something.”\u003c/p\u003e\n\u003cp\u003e“So what are you afraid of?”\u003c/p\u003e\n\u003cp\u003eShe paused, considering how to answer. “Hope.”\u003c/p\u003e\n\u003cp\u003eHis brow furrowed. “Hope scares you?”\u003c/p\u003e\n\u003cp\u003e“I try not to hope for anything,” she said. “If you expect nothing, you aren’t disappointed when you get nothing.”\u003c/p\u003e\n\u003cp\u003e“That’s . . . sad,” he said. “You don’t have any hope?”\u003c/p\u003e\n\u003cp\u003e“I guess I do a little bit now.” She kicked around in the mud, not wanting to dwell on the fact that she now had the one thing she told herself she’d never succumb to. “What are you afraid of?”\u003c/p\u003e\n\u003cp\u003e“Losing my dad,” he said. “I already lost my mom to this life. I don’t want to lose him, too.”\u003c/p\u003e\n\u003cp\u003eAn ache strangled her chest as she thought through his words. Her mama was still alive, but she felt as though she’d lost her forever.\u003c/p\u003e\n\u003cp\u003e“You should always have hope, you know,” Dominic said.\u003c/p\u003e\n\u003cp\u003e“My mama used to say that all the time.”\u003c/p\u003e\n\u003cp\u003e“Smart woman,” he said. “You knew her?”\u003c/p\u003e\n\u003cp\u003e“Yes. I spent my whole life with her. She told me to run, to try to escape, but I got caught. That’s when your father took me.”\u003c/p\u003e\n\u003cp\u003eDominic stared at her. “My father took you from your mother? Does he know that?”\u003c/p\u003e\n\u003cp\u003e“Yes, he knows.”\u003c/p\u003e\n\u003cp\u003eThey were quiet for a while, Dominic sitting in thought as she stomped around in the creek. “I’m sorry you’re here,” he said eventually. “It stumps me that he’d take you from your mother. That’s wrong.”\u003c/p\u003e\n\u003cp\u003e“It was scary to leave her, but I wouldn’t call it wrong,” she said. “Compared to where I came from, my mama would say he did me a favor.”\u003c/p\u003e\n\u003cp\u003eDominic stared at her in silence for a while before telling her they needed to get back. Although she hadn’t wanted to go inside, she tentatively stepped out of the water. Her feet were covered in mud so she cleaned them off, figuring Dr. DeMarco wouldn’t be happy with a dirty-footed servant scampering around when he had company.\u003c/p\u003e\n\u003cp\u003eThey strolled toward the house in silence, finding a large white box truck now parked in the backyard. The men from last night were unloading boxes, taking them into a door in the side of the house, hidden under vines and green growth, blending into the surroundings.\u003c/p\u003e\n\u003cp\u003e“I didn’t know a door was there,” she said.\u003c/p\u003e\n\u003cp\u003e“It leads to the basement,” he said. “Trust me when I say you don’t want to go down there.”\u003c/p\u003e\n\u003cp\u003eNunzio stepped from behind the truck with a box then, his eyes drifting toward her. Haven moved closer to Dominic and focused her eyes on the ground, not wanting to give him the wrong impression.\u003c/p\u003e\n\u003cp\u003eDominic went to take a shower when they made it inside, while Haven gathered Carmine’s laundry, intending to start her daily cleaning. A foot or so from the top of the steps, she froze when she saw someone heading toward her. Fear ripped through her, so powerful she lost her breath.\u003c/p\u003e\n\u003cp\u003eNunzio.\u003c/p\u003e\n\u003cp\u003eWhat she saw in his eyes alarmed her, hatred and lust thrown into a big frenzy of excited emotion. Her heart pounded fiercely, that voice in the back of her head telling her to get away. She took a few steps back and dropped the hamper, the clothes spilling out into the library as she sprinted to her room. She could hear him behind her as she flung the door closed, his foot blocking it before it could latch.\u003c/p\u003e\n\u003cp\u003eShe backed away, looking around for some protection when he stepped into the room. Nunzio closed the door behind him, and Haven’s knees nearly buckled when the lock clicked into place.\u003c/p\u003e\n\u003cp\u003eShe was trapped.\u003c/p\u003e\n\u003cp\u003eNunzio calmly pulled off his coat and tossed it on the table, the nonchalance when he spoke making it sound as if they were old friends. “Alone at last.”\u003c/p\u003e\n\u003cp\u003eLoosening his tie, he pulled his shirt from his pants and let it hang as he sauntered toward her. Haven let out a scream for help, but Nunzio backhanded her before it could echo from the room. The strike stunned her into silence. “Behave, and I’ll make it worth it for you.”\u003c/p\u003e\n\u003cp\u003eTears flowed from her eyes as she stepped back once more, her legs colliding with the footboard of the bed. “Don’t touch me.”\u003c/p\u003e\n\u003cp\u003e“Aw, don’t be like that.” He smiled vindictively. “Don’t you like making people happy? That’s all you gotta do. Be a good girl and please me. After all, that’s why you exist. It’s all you’re good for. It’s not like anyone could actually love someone like you.”\u003c/p\u003e\n\u003cp\u003eHe closed the distance between them as he unbuckled his belt. She fought the urge to heave, her body trembling. Stepping to the side, she tried to dart around him, but he blocked her path.\u003c/p\u003e\n\u003cp\u003e“Don’t bite, or I’ll knock your teeth out,” he said, his voice gritty. Grabbing her head, he tried to force her to her knees as his other hand snaked into his pants. Out of time, panicked, Haven snatched his gun from his waistband. Using every ounce of strength she could muster, she swung and smacked him across the face with the butt of the gun. Nunzio stumbled, stunned, and let go of her.\u003c/p\u003e\n\u003cp\u003eIt was all Haven needed to slip away.\u003c/p\u003e\n\u003cp\u003eThrowing the gun across the room, she sprinted for the door. Nunzio recovered and came after her, yelling. Her hand grasped the knob as she unlocked the door, but he grabbed her before she could open it. She screamed Dominic’s name as he turned them around, pushing her roughly toward the bed. She fell and scurried away as he stalked toward her, the bang of the door being forced open her saving grace. Dominic ran in, a towel around his waist but still dripping water from his shower, and shoved Nunzio out of the way before helping Haven to her feet. “Are you okay?”\u003c/p\u003e\n\u003cp\u003e“It’s fine.” Haven wiped her tears. “I’m fine.”\u003c/p\u003e\n\u003cp\u003e“He didn’t hurt you, right?”\u003c/p\u003e\n\u003cp\u003eShe shook her head as Nunzio scoffed. “Me, hurt her? That bitch attacked me!”\u003c/p\u003e\n\u003cp\u003eDominic’s face twisted with rage as he snatched the gun from the floor. “Haven, leave. I need to have a talk with my old friend.”\u003c/p\u003e\n\u003cp\u003eHaven ran out and hesitated in the library before darting for Carmine’s room. Locking herself in there, she sat on the edge of the bed and covered her ears to drown out the fighting.\u003c/p\u003e\n\u003cp\u003eCarmine knew something had gone terribly wrong when he made it home from school and walked into a house filled with fighting. Curses and insults flew around in multiple languages, the anger and hostility coming from the kitchen palpable. Stunned, Carmine paused in the doorway, seeing his father sewing up a cut on Nunzio’s face. “What the fuck happened?”\u003c/p\u003e\n\u003cp\u003eDominic walked up behind Carmine, eyeing him warily. “I should’ve watched Haven better. Nunzio cornered her.”\u003c/p\u003e\n\u003cp\u003eCarmine’s stomach dropped as he fought to keep his composure. “Where is she?”\u003c/p\u003e\n\u003cp\u003e“Up in your room,” Dominic said. “She said she was okay.”\u003c/p\u003e\n\u003cp\u003eSighing, Carmine glanced back at his father in the kitchen as Nunzio snickered and pulled away. “That bitch begged for it.”\u003c/p\u003e\n\u003cp\u003eCarmine’s control slipped at those words. “What did you say?”\u003c/p\u003e\n\u003cp\u003eNunzio glared at him. “I said she wanted me.”\u003c/p\u003e\n\u003cp\u003eCarmine leaped right for him, and Vincent blocked the path when Nunzio tried to move. Swinging, Carmine’s fist barely connected with the man’s nose when Sal intervened and dragged him away.\u003c/p\u003e\n\u003cp\u003e“You’re sick!” Carmine yelled as Vincent shoved Nunzio into the counter to continue sewing him up. Sal pulled Carmine into the foyer, not letting go of him until they were near the stairs. “This isn’t right!”\u003c/p\u003e\n\u003cp\u003e“I know, Principe, but didn’t we have a conversation yesterday about feelings having no place in business? He’ll face the consequences for disrespecting your father, but this isn’t a major violation.”\u003c/p\u003e\n\u003cp\u003eCarmine stared at him hard. “So she’s worth nothing to you people? Is that what you’re telling me? Oh, who gives a fuck if he hurts a girl? She’s no one special, because she wasn’t lucky enough to be born into a powerful family!”\u003c/p\u003e\n\u003cp\u003eSal’s expression twisted with anger, the sight of it silencing Carmine. “That girl means more than you understand, but things are black and white to la famiglia. You need to learn how to distinguish between what’s personal and what’s business. You need to learn to follow the code of conduct here”—he smacked him in the back of the head—“and quit following this so much.” He punched Carmine in the chest, over his heart. “The moment you cursed at me yesterday, I knew she’d gotten to you here”—another punch in the chest—“and you’re going to cause problems if you don’t start using this.”\u003c/p\u003e\n\u003cp\u003eA final smack to the head sent Carmine over the edge. “Quit hitting me!”\u003c/p\u003e\n\u003cp\u003eSal shook his head. “You know I think of you as a son. I’ve always treated you like you were my own, and I want what’s best for you. I want you to succeed, to have a good life, the life you’re supposed to have. I’m not telling you not to let the girl in here”—he tapped him lightly on the chest—“but I am telling you not to let those feelings override everything else. You need balance.”\u003c/p\u003e\n\u003cp\u003eCarmine ran his hands down his face, frustrated. “I get it.”\u003c/p\u003e\n\u003cp\u003eSal clapped him on the shoulder. “You’re enamored. These things happen, but it’s a fragile situation that shouldn’t be flaunted. Trust me when I say it’s not the time to ignore reason.”\u003c/p\u003e\n\u003cp\u003e“I just . . . I didn’t realize it was obvious.”\u003c/p\u003e\n\u003cp\u003e“It’s a complicated situation,” Sal said. “Your father has a similar problem. I’ve spent years trying to get him to recognize boundaries, but he still finds himself blurring lines.” A loud bang rang out in the kitchen, and Salvatore sighed. “Now likely being one of those times.”\u003c/p\u003e\n\u003cp\u003eHaven stared at the clock, counting the minutes as they passed. Three. Five. Eight. Twelve. Sixteen. Twenty-two.\u003c/p\u003e\n\u003cp\u003eAfter thirty agonizing minutes, frantic footsteps bounded into the library. Someone tried to turn the locked doorknob, but Haven refused to open it, terrified to move. Keys jingled as the door opened, and Carmine rushed into the room.\u003c/p\u003e\n\u003cp\u003eHe pulled her into his arms, tears still streaming down her cheeks. She wasn’t sure how long he held her before Dr. DeMarco’s voice rang out from the doorway. “Is she okay?”\u003c/p\u003e\n\u003cp\u003eHaven’s vision was blurry, but she could make out his stern expression. He looked irate. She hoped that anger wasn’t directed at her.\u003c/p\u003e\n\u003cp\u003e“She will be,” Carmine said. “Is Nunzio gone?”\u003c/p\u003e\n\u003cp\u003e“Sal’s driving him to the airport now.”\u003c/p\u003e\n\u003cp\u003e“The airport,” Carmine repeated. “He got off too easy. I would’ve killed him.”\u003c/p\u003e\n\u003cp\u003eAll was quiet for a bit, and Haven closed her eyes. She began to wonder if they were alone when Dr. DeMarco’s voice rang out once more. “I would’ve killed him, too.”\u003c/p\u003e\n\u003cp\u003eCarmine lay beside Haven in bed, brushing the hair from her face. Her cries had quieted, her face blotchy from tears. “I’m sorry,” he said. “I should’ve been here to protect you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-27.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
