{"id":88229,"no":40,"title":"Page 40","content":"\u003cp\u003e“To try to break us apart.”\u003c/p\u003e\n\u003cp\u003eThe answer irritated Vincent, and he dropped his fork. “Have you not been listening? You think I get off on toying with others? Do you honestly think your mother would’ve married me had I been that horrible?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I have no idea what was going on in Mom’s head, but I’m sure she wouldn’t be happy about what you’re doing with Haven.”\u003c/p\u003e\n\u003cp\u003e“You were young when she died, and frankly, your view is skewed. I’ve done a lot over the years that would disappoint your mother, but buying the girl isn’t one of them.”\u003c/p\u003e\n\u003cp\u003e“Buying her? You think my mom would be okay with that? You’re sick!”\u003c/p\u003e\n\u003cp\u003eVincent slammed his fist against the table. “Who are you to talk to me like that? Look how you treat everyone!”\u003c/p\u003e\n\u003cp\u003e“And whose fucking fault is that, huh?” Carmine pushed his chair back as he stood. “Whose fault is it I’m fucked up? Whose fault is it I had to watch her die?”\u003c/p\u003e\n\u003cp\u003eVincent glared at him. “Not mine.”\u003c/p\u003e\n\u003cp\u003eA voice cleared beside them as the manager approached. Others stared, disturbed by the commotion. Vincent pulled some cash from his wallet, throwing it down on the table before walking out.\u003c/p\u003e\n\u003cp\u003eNot a word was spoken during the drive. When they reached the house, Carmine tried to get out, but Vincent stopped him.\u003c/p\u003e\n\u003cp\u003e“I had you do it so you’d see what you were getting into. She’s been cut off from everything, Carmine. In the confines of the house, maybe things are great, but that’s not the real world. On the off chance you get to be together, I figured it was better if you had experience dealing with that part of her. It’s going to be there every step of the way, because when you’re raised like she was, you don’t have the know-how to live any other way. I tried to help you, not hurt you.”\u003c/p\u003e\n\u003cp\u003eCarmine opened his mouth to speak, but his father continued before he could. “You think your mother would be disappointed I brought her into this house? I think you’re wrong. Would she like it? No. I don’t even like it. But I think your mother would’ve been disappointed had I thrown the child into the world blindly. Society would’ve eaten her alive. Probably still will.”\u003c/p\u003e\n\u003cp\u003eCarmine had been focused on everything his father was doing wrong and never considered what might be helping Haven.\u003c/p\u003e\n\u003cp\u003e“She needs a semblance of her normal before she can be introduced to ours,” Vincent continued. “You love her? Fine, love her. But don’t contradict me. This isn’t fun, Carmine. I’m not enjoying this, but I’m doing it and that should be enough to earn your respect. You have to stop acting like you’re powerful and wise, because you’re neither. You need to grasp that, son, or I’m going to lose you like I lost your mother.”\u003c/p\u003e\n\u003cp\u003eVincent got out, slamming the door so hard the windows vibrated.\u003c/p\u003e\n\u003cp\u003eHaven lay in the middle of Carmine’s bed, sprawled out on her back when he entered. He took off his coat and shoes before lying down beside her. Haven’s eyes fluttered open. She blinked a few times, smiling when they made eye contact.\u003c/p\u003e\n\u003cp\u003e“La mia bella ragazza,” he said. “Napping in the afternoon?”\u003c/p\u003e\n\u003cp\u003e“I ran out of stuff to do,” she said. “Everything’s clean.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “A nap actually sounds good right now.”\u003c/p\u003e\n\u003cp\u003eShe eyed him curiously. “Bad day?”\u003c/p\u003e\n\u003cp\u003e“It was confusing, but I wouldn’t call it bad,” he said. “Any day that includes lying in bed with you, tesoro, can’t be bad.”\u003c/p\u003e\n\u003cp\u003eShe ran her fingertips across his lips. “I missed you.”\u003c/p\u003e\n\u003cp\u003e“Mi sei mancata,” he said. “That’s ‘I missed you’ in Italian.”\u003c/p\u003e\n\u003cp\u003e“Well, mi sei mancata, too.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “I’m a guy, so you say, mancato. You know, with an o and not an a.”\u003c/p\u003e\n\u003cp\u003e“Mi sei mancato,” she repeated.\u003c/p\u003e\n\u003cp\u003e“There you go! Watch out, look at my girl getting bilingual.”\u003c/p\u003e\n\u003cp\u003eHaven sat back on her knees, humming to herself as she surveyed the sparkling kitchen floor. She’d been scrubbing it for more than an hour, removing the black scuff marks from the marble tile. Dr. DeMarco never spoke to her about cleaning. The rare occasions she forgot to do something, he overlooked it. Sometimes she felt like she was living in another universe with how drastically her life had changed. She never imagined living an existence where she could throw down the broom and put the laundry on hold to catch a television program in the middle of the afternoon.\u003c/p\u003e\n\u003cp\u003eA lot of it happened without her realizing it. Before she had come to the DeMarco house, she was constantly focused on tasks to stay out of trouble, but now she thought about herself more.\u003c/p\u003e\n\u003cp\u003eAnd that was something she had never been allowed to do before.\u003c/p\u003e\n\u003cp\u003eShe stood, catching a glimpse of something when she turned around. Dr. DeMarco stood in the doorway, watching her silently. It was noon, and she hadn’t realized someone was home. “Are you hungry, sir?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “You can make some lunch, dolcezza. We’ll watch TV while we eat.”\u003c/p\u003e\n\u003cp\u003eShe blinked a few times after he walked out. We?\u003c/p\u003e\n\u003cp\u003eAfter making some chicken salad sandwiches and distractedly throwing together two cherry Cokes, Haven headed into the family room. Dr. DeMarco lounged in a chair with his legs stretched out in front of him, his smile falling when he took his lunch.\u003c/p\u003e\n\u003cp\u003eShe sat down on the couch and picked at her sandwich as he took a sip of his drink. “Can I ask you something, child?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003eHe pulled a cherry out of his soda. “Did you make these on your own, or did my son ask you to?”\u003c/p\u003e\n\u003cp\u003e“I made it on my own. I wanted to be nice.”\u003c/p\u003e\n\u003cp\u003e“Interesting.”\u003c/p\u003e\n\u003cp\u003e“Is something wrong with that?” she asked.\u003c/p\u003e\n\u003cp\u003e“No, I was just curious,” he said. “I’m curious about a lot, actually.”\u003c/p\u003e\n\u003cp\u003e“Like?”\u003c/p\u003e\n\u003cp\u003e“Like, how did you know to use the special cleaner on my windows?”\u003c/p\u003e\n\u003cp\u003eHer brow furrowed. “It was written on the bottle.”\u003c/p\u003e\n\u003cp\u003e“So you’re admitting you could read back then?”\u003c/p\u003e\n\u003cp\u003eHer blatant mistake stunned her. She nodded, afraid to speak.\u003c/p\u003e\n\u003cp\u003e“I already knew it at the time, but I was surprised you’d slip up on your first day. You aren’t as slick as you think you are.”\u003c/p\u003e\n\u003cp\u003eQueasiness overtook her. She set her sandwich down. “How did you know I could read?”\u003c/p\u003e\n\u003cp\u003e“I discovered it years ago on a trip to Blackburn. You had a book. Had I not known, though, you would’ve given yourself away anyway. The moment your illiteracy was mentioned, you looked left. That’s your tell. When you’re hiding something, you look to the left.”\u003c/p\u003e\n\u003cp\u003eHaven said nothing, forcing herself to look straight ahead.\u003c/p\u003e\n\u003cp\u003e29\u003c/p\u003e\n\u003cp\u003eCarmine paced the foyer, the sound of his feet against the wooden floor echoing through the downstairs. The sun hadn’t risen and he already couldn’t stand still.\u003c/p\u003e\n\u003cp\u003eAfter what seemed like another hour, although only a few minutes had passed, a car pulled up outside. He swung open the front door so forcefully he was surprised he didn’t rip it from the hinges. “You’re late.”\u003c/p\u003e\n\u003cp\u003eDia pushed him out of the way to step in the house. “You told me six. It’s five forty-five.”\u003c/p\u003e\n\u003cp\u003eHis brow furrowed. “It’s not six yet?”\u003c/p\u003e\n\u003cp\u003e“No, it’s not.” She handed him a piece of paper. “Relax, it’s going to go fine.”\u003c/p\u003e\n\u003cp\u003e“You’re sure? I mean, it’s enough, isn’t it?” Dia raised her eyebrows, her expression causing his foolish panic to surge. “Christ, it’s too much. I’m going overboard.”\u003c/p\u003e\n\u003cp\u003e“She’s going to love it, Carmine.”\u003c/p\u003e\n\u003cp\u003e“I’ve never done any of this before,” he said. “I don’t know what I’m doing.”\u003c/p\u003e\n\u003cp\u003e“I know. It’s sweet of you. I’m more than happy to help.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” he said. “I’ll get some cash in town and pay you for your freelancing.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “No need to. This one’s on me. I’m looking forward to hanging out with her.”\u003c/p\u003e\n\u003cp\u003e“No shit? You actually wanna socialize with a girl in my life?”\u003c/p\u003e\n\u003cp\u003eDia rolled her eyes. “It’s not my fault you used to only bring Moanin’ Lisa around.”\u003c/p\u003e\n\u003cp\u003eHaven picked at her cheese and mushroom omelet, listening as Dia ranted about school as they sat in a booth at Crossroads Diner, a small restaurant in the center of town. Dia had woken her up an hour before and asked Haven to have breakfast with her. She had resisted, afraid to leave the house without permission, but Dominic called Dr. DeMarco to ensure it was okay. She didn’t know why she was there, but she was grateful someone wanted to spend time with her.\u003c/p\u003e\n\u003cp\u003eEven if that person was still a mystery to Haven.\u003c/p\u003e\n\u003cp\u003eAfter Dia finished her pancakes, she excused herself to the restroom. Haven grew nervous as she disappeared. Being in public by herself, surrounded by strangers, put her on edge.\u003c/p\u003e\n\u003cp\u003e“What’s a beauty like you doing eating alone?”\u003c/p\u003e\n\u003cp\u003eShe grew rigid as Nicholas slid into the booth across from her. “I’m with Dia. She went . . . somewhere.”\u003c/p\u003e\n\u003cp\u003e“Cool, it’ll be nice to see her,” he said. “So, I have a question for you.”\u003c/p\u003e\n\u003cp\u003eShe gazed at him apprehensively. “What?”\u003c/p\u003e\n\u003cp\u003eHe reached into his coat pocket and pulled out a small pink box of candy hearts, dumping a few of them in his hand. “What do you call a vampire’s sweetheart?”\u003c/p\u003e\n\u003cp\u003eShe smiled. Another joke. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe popped a piece of candy in his mouth. “A ghoulfriend. Get it? Like girlfriend but a ghoul?”\u003c/p\u003e\n\u003cp\u003eShe stared at him, not seeing what was funny about that.\u003c/p\u003e\n\u003cp\u003eDia returned and slid into the booth beside Nicholas. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Stopped by for some breakfast on my way to the station. I have community service with the police chief.”\u003c/p\u003e\n\u003cp\u003eDia’s brow furrowed. “Shouldn’t you be in school, though?”\u003c/p\u003e\n\u003cp\u003e“Looks who’s talking—shouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“I took the day off,” she said. “Haven and I are getting her ready for her date.”\u003c/p\u003e\n\u003cp\u003eDate? The word caught Haven off guard. Nicholas looked just as surprised. “Date? With who?”\u003c/p\u003e\n\u003cp\u003e“With her boyfriend,” Dia said when Haven remained quiet. “You know—Carmine.”\u003c/p\u003e\n\u003cp\u003eNicholas’s expression fell. “DeMarco?”\u003c/p\u003e\n\u003cp\u003e“What other Carmine is there?” Dia asked. “And don’t be so shocked. He’s not the same person you knew.”\u003c/p\u003e\n\u003cp\u003e“Carmine will never change.” Nicholas’s voice was scathing. “He might pull the wool over your eyes, but I’m not charmed by him like everyone else. Everyone in this ridiculous town still thinks the sun rises and sets on that guy, that he can do no wrong. It’s bizarre.” He paused, fiddling with his candy. “I have to go.”\u003c/p\u003e\n\u003cp\u003eDia scooted out of the booth to let him pass. He put a piece of candy down on the table in front of Haven before stalking away, shoving the door open and leaving the diner without eating.\u003c/p\u003e\n\u003cp\u003eHaven glanced down at the orange candy heart in front of her, reading the words Talk 2 Me faintly written on it in pink. \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-40.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
