{"id":88245,"no":56,"title":"Page 56","content":"\u003cp\u003eHaven blinked away tears as memories assaulted her. Twenty minutes had gone by, so she took a deep breath and started writing. She wrote whatever came to her mind as she thought of her mama, how a good parent never gave up and always encouraged their children to dream.\u003c/p\u003e\n\u003cp\u003eThe instructor called time as Haven put a period on the end of the final sentence. The rest of testing flew by, and they were dismissed at three in the afternoon. The Mazda was waiting in the fire lane with the music blaring, and Haven quietly slipped into the passenger seat.\u003c/p\u003e\n\u003cp\u003eCarmine turned his music down as he pulled from the curb. “How did you do?”\u003c/p\u003e\n\u003cp\u003eShe smiled softly as he offered her his hand. “Okay.”\u003c/p\u003e\n\u003cp\u003eNeither spoke on the drive back to Durante. When they arrived at the house she went right to the kitchen to make something to eat. Carmine sat on the counter beside the stove and watched her as she cooked. “Are you making enchiladas?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “They were, uh . . . my mama liked them.”\u003c/p\u003e\n\u003cp\u003e“Looks good,” Carmine said.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“We can eat and watch a movie or something.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Or maybe we’ll play a game.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Actually, I’m tired, so maybe we’ll go straight to bed.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Probably won’t even fucking eat.”\u003c/p\u003e\n\u003cp\u003e“Uh, okay.”\u003c/p\u003e\n\u003cp\u003eThe room grew silent as Carmine glared at Haven. His shift in demeanor startled her. “Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” he said. “You, I’m not sure about. Since I picked you up, you’ve barely said a dozen words and half of them were okay. Did something happen?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Did you fail?” He raised his eyebrows. “Did you freak out or something?”\u003c/p\u003e\n\u003cp\u003e“No, I think I did okay.” She cringed as she said that word again.\u003c/p\u003e\n\u003cp\u003e“Then what’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I’m just thinking about my mama.”\u003c/p\u003e\n\u003cp\u003e“You wanna talk about her?” he asked, his voice quiet and genuine, all traces of frustration melted away. “You don’t have to keep it to yourself.”\u003c/p\u003e\n\u003cp\u003e“I know, but I don’t know what to say. I miss her, and I’ll probably never see her again. I never got to tell her good-bye or that I love her. It hurts to think about, because I used to wonder if we even loved each other, but I realized today Mama did love me. And I love her, but I never told her that.”\u003c/p\u003e\n\u003cp\u003e“Never?”\u003c/p\u003e\n\u003cp\u003e“Never,” she whispered as Carmine hopped down from the counter to hug her. “I shouldn’t be crying about this to you because you have more reason to grieve. My mama’s alive, and yours is . . .”\u003c/p\u003e\n\u003cp\u003eHe flinched before she could speak the word. She pulled from his arms and tried to apologize, but he pressed his pointer finger to her lips. “My mom lived, Haven. She was free to make her choices, and she did just that. She made fucking stupid decisions, and she died because of it. Your mom has never been able to make a decision, so I think you have more to grieve than I do.”\u003c/p\u003e\n\u003cp\u003eSunny Oaks Manor was anything but sunny today. A storm waged outside, rain steadily falling as gusts of wind bent the flimsy trees around the property. Thunder rumbled as lightning lit up the darkened afternoon sky, making it feel like the middle of the night.\u003c/p\u003e\n\u003cp\u003eVincent stood in his mother’s apartment, watching the ambulance parked outside. The EMTs, in their vivid yellow raincoats, loaded the black body bag into the back. Quietly, he made the sign of the cross and whispered a short prayer.\u003c/p\u003e\n\u003cp\u003e“Don’t pray for that old hag,” Gia said, somehow overhearing him without her hearing aides. “It’s her own fault she’s dead.”\u003c/p\u003e\n\u003cp\u003e“How?” The staff said Gertrude died peacefully in her sleep.\u003c/p\u003e\n\u003cp\u003e“She left her window open last week. I tried to warn her, but she wouldn’t listen. That black bird flew in like it owned the place.”\u003c/p\u003e\n\u003cp\u003eVincent sighed. “I don’t think it was the bird, Ma.”\u003c/p\u003e\n\u003cp\u003eGia waved him off. “What do you know?”\u003c/p\u003e\n\u003cp\u003e“Well, I am a doctor.”\u003c/p\u003e\n\u003cp\u003e“Oh, you quacks never know what you’re talking about,” she said. “You always want to give people pills and take their blood from them when it’s unnecessary. God doesn’t make mistakes, Vincenzo. People die when they deserve to. You know that.”\u003c/p\u003e\n\u003cp\u003eVincent clenched his hand into a fist at the subtle dig about Maura. “What about Dad? Did he deserve it?”\u003c/p\u003e\n\u003cp\u003e“As many goomahs as your father had? I’m surprised his heart lasted as long as it did.”\u003c/p\u003e\n\u003cp\u003eVincent would never understand his mother’s callousness. Sometimes he wondered why he bothered visiting when she obviously didn’t appreciate his company.\u003c/p\u003e\n\u003cp\u003eThe ambulance pulled away from Sunny Oaks, and Vincent’s eyes followed it to the corner in the storm. His gaze lingered there, his stomach dropping as he took in the dark SUV parked less than a block away. He hoped he imagined things, but his instincts told him it was no coincidence. He’d only been joking when he suggested they were watching him, but he realized he’d been right. He was being followed.\u003c/p\u003e\n\u003cp\u003e“Are you listening to me?”\u003c/p\u003e\n\u003cp\u003e“No,” Vincent admitted, turning to his mother. “What did you say?”\u003c/p\u003e\n\u003cp\u003e“I’m not repeating myself for you,” Gia said. “It’ll suck the breath from my lungs and take time off my life. That’s probably what you want, isn’t it? For me to die? Then I wouldn’t be a burden anymore. Your own mother . . . you treat me like garbage.”\u003c/p\u003e\n\u003cp\u003eVincent sighed exasperatedly. “What do you want from me, Ma?”\u003c/p\u003e\n\u003cp\u003e“Nothing, Vincenzo. I want nothing.”\u003c/p\u003e\n\u003cp\u003eHe glanced at his watch, fresh out of patience. “I should go. Dominic and Tess are waiting.”\u003c/p\u003e\n\u003cp\u003eGia narrowed her eyes. “Who are they?”\u003c/p\u003e\n\u003cp\u003e“You know who Dominic is,” he said, trying to keep calm, but he had had about as much of her as he could take. “He’s your grandson, and Tess is his girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Is she Italian?”\u003c/p\u003e\n\u003cp\u003e“No, she’s American. Scottish heritage.”\u003c/p\u003e\n\u003cp\u003e“Scottish? At least that’s better than the Irish. What about that other boy of yours? Does he have an Italian girl?”\u003c/p\u003e\n\u003cp\u003eVincent walked over to his mother and kissed her forehead, heading toward the door without answering.\u003c/p\u003e\n\u003cp\u003eThe week flew by in a blur as Haven and Carmine were left alone. It was easy for them to forget during those days, when it was just the two of them, that barriers stood in their way. It seemed so simple, their lives merging fluidly within the confines of the house; but the outside world was closing in on them fast. A black cloud hovered in the distance, threatening to burst, but the problem was they didn’t know when, where, or how it would come down. It could be an inconvenient drizzle or a flood that washed everything away. There was no way to prepare for the storm when they couldn’t predict what would happen when it struck.\u003c/p\u003e\n\u003cp\u003eIt was Friday afternoon, and they were in the family room watching a movie, their bodies pressed together on the couch, legs entwined as she lay in his arms. His lips wandered down her jaw, his mouth vigorously sucking on the flesh of her neck.\u003c/p\u003e\n\u003cp\u003eThe sound of Haven’s light moans was cut off abruptly when the alarm beeped and the front door slammed. Panicked, Carmine sat up as his father stormed into the room. Instinctively, he shifted his body protectively in front of Haven’s as Vincent clenched his hands into fists. “My office. Now.”\u003c/p\u003e\n\u003cp\u003e“Who?” Carmine asked tentatively as his father walked away.\u003c/p\u003e\n\u003cp\u003e“You.”\u003c/p\u003e\n\u003cp\u003eCarmine stood and pulled Haven to her feet. “Go to my room and stay there while I find out what’s happening.”\u003c/p\u003e\n\u003cp\u003eHaven followed him upstairs, but his legs were longer and she couldn’t keep up with his stride. Carmine went straight for his father’s office, thrusting the door open without bothering to knock. Vincent was hunched over his laptop, typing furiously away at the keys. “They’re coming.”\u003c/p\u003e\n\u003cp\u003eCarmine’s brow furrowed at the vague statement. “Who?”\u003c/p\u003e\n\u003cp\u003e“Ed McMahon and the prize patrol. Who do you think is coming?”\u003c/p\u003e\n\u003cp\u003eThe mocking tone caught him off guard. “Feds?”\u003c/p\u003e\n\u003cp\u003e“I wish.” Vincent shook his head. “It’s probably only a matter of time before they come knocking, but no . . . we’re not that lucky today. I got a call a few minutes ago that Sal hopped a plane to come here with no warning. I don’t know why, and I have no idea what they want.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Vincent opened desk drawers and rifled through files. “I’m hoping it’s unexpected business, but it could be one of you they’re after, so I need you out of here in case. Corrado doesn’t think you should be anywhere without protection.”\u003c/p\u003e\n\u003cp\u003e“I have a gun,” Carmine said.\u003c/p\u003e\n\u003cp\u003eVincent’s head shot up. “A lot of good one gun does you as a nobody. They could kill you and no one would know unless you had one of us by your side.”\u003c/p\u003e\n\u003cp\u003eVincent’s phone vibrated against the desk, and he held his hand up to silence Carmine. He answered it formally, his voice as even as possible. “DeMarco speaking . . . Yes, sir . . . I’ll be here.”\u003c/p\u003e\n\u003cp\u003eHe hung up, tossing the phone down as he eyed his son peculiarly. “Pack some bags. We need to get the ball rolling on things.”\u003c/p\u003e\n\u003cp\u003eHaven paced the floor in Carmine’s bedroom, listening attentively for noises from below, but her ears were met with silence. No yelling. No screaming. No commotion at all.\u003c/p\u003e\n\u003cp\u003eThe stillness only served to fuel her imagination as she conjured up wild scenarios—none of them remotely good. Her hands shook, fear coursing through her as a door slammed on the floor below. Footsteps hurried up the stairs as her heart thumped harder, so frenzied she could feel the blood rushing through her.\u003c/p\u003e\n\u003cp\u003eThe door flung open, slamming the wall with a bang, and Carmine hurried in. He headed straight for his closet and threw things around, tossing two duffel bags onto the bed. “Pack some shit.”\u003c/p\u003e\n\u003cp\u003eShe didn’t move. “What?”\u003c/p\u003e\n\u003cp\u003e“We need to get out of here, Haven.”\u003c/p\u003e\n\u003cp\u003eHaven felt woozy. She wanted to ask what was happening, desperately wanted him to explain, but she knew the answer would terrify her. She staggered to the bed and sat down as Carmine ran to her room, Dr. DeMarco’s words echoing through her mind. She had promised she would never run again. She swore she wouldn’t follow Carmine blindly.\u003c/p\u003e\n\u003cp\u003e“Why are you sitting there?” Carmine asked when he returned, his arms full of clothes. Thoughts swirled madly around her mind as he filled both bags and held his hand out to her. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eThe moment the words rolled from his tongue, her mind was made up. No matter the consequences, she had to go with him.\u003c/p\u003e\n\u003cp\u003eThey hurried downstairs and Carmine pulled her onto the porch, not bothering to close the front door in his haste. Unlocking the car doors, he tossed the bags into the back and motioned for her to get in. As soon as they were settled, Carmine started the car and thrust it into gear. The tires spun and gravel sprayed as he sped away from the house.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Haven asked once they got on the highway, her voice cracking and stomach bubbling. “Why are we running? Did something happen?” \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-56.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
