{"id":88264,"no":75,"title":"Page 75","content":"\u003cp\u003e“I would not believe it, either,” Giovanni said. “Volkov would not take her just to kill her. And in good news, we can cross out everywhere with a lot of windows.”\u003c/p\u003e\n\u003cp\u003e“That’ll still leave a dozen properties,” Carmine said. “How do we know which one to go to?”\u003c/p\u003e\n\u003cp\u003e“We start at the top,” Giovanni said, pointing at a location in the north side of the city. “Work our way down until we find her.”\u003c/p\u003e\n\u003cp\u003eSighing, Carmine ran his hands down his face in frustration. “Why are you helping me, anyway? Everyone else said it was a waste of time, that it was a suicide mission.”\u003c/p\u003e\n\u003cp\u003e“They do not understand.” Giovanni’s voice was quiet as he sat down near Carmine. “I warned them the Russians would make a move, but they did not listen. The Russians invade our streets, and Sal does nothing. They harass our people, and Sal does nothing. They turn our people against us, and Sal does nothing. Now they kidnap a girl, and what does Sal do?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” Carmine said. “He doesn’t do a damn thing.”\u003c/p\u003e\n\u003cp\u003eGiovanni nodded. “If somebody does not do something, they will kill our people next. I, for one, cannot sit back and allow them to.”\u003c/p\u003e\n\u003cp\u003eThe day of the hearing, Vincent’s stress level was at an all-time high. The U.S. Marshals drove him and Corrado in separate cars to the Dirksen Federal Building a few blocks away. Their team of lawyers waited when they walked into the courtroom, taking seats at the defendants’ table. Corrado appeared calm and confident in his black Armani suit, the complete opposite of how Vincent felt. While it was a relief to be out of the prison attire, his button-up shirt choked him.\u003c/p\u003e\n\u003cp\u003eThe government seemed confident, their lackadaisical attitudes making Vincent more nervous. A prosecutor stood, casually fixing his tie as he addressed the court. “Your Honor, we’re talking about racketeering, gambling, extortion, fraud, and conspiracy to commit murder. Each defendant is facing thirty-five counts. Releasing them would be potentially unleashing more of this onto the community. The evidence clearly suggests neither man intends to stop.”\u003c/p\u003e\n\u003cp\u003eTheir lawyers argued their cases when the government was done, citing Fourth Amendment violations and unreasonable searches. They said the evidence was flimsy at best—no surveillance footage, no confessions, no DNA. The most they had were rumors and infamous names, and that wasn’t enough to take a man away from his life. Rocco Borza went on a passionate tirade about how the RICO Acts were being used to railroad innocent individuals, and how much of an injustice it was that they weren’t free. It took everything Vincent had not to laugh. He was guilty as charged, and the man beside him certainly was no saint.\u003c/p\u003e\n\u003cp\u003eThe judge let out a long sigh when both sides were done. “While the government makes a good point, the Fifth Amendment guarantees no one should be deprived of life, liberty, or property without due process of law. We’re innocent until proven guilty in this country, and the defendants have yet to be convicted of any crimes. They can’t be remanded without bail simply because you believe they may commit a crime in the future. Therefore, the defendants’ petition for bail is granted. Fifty thousand dollars, cash bond.”\u003c/p\u003e\n\u003cp\u003e“Your honor,” the prosecutor said, standing. “We ask that the defendants surrender their passports, and that neither be allowed to leave the state.”\u003c/p\u003e\n\u003cp\u003eMr. Borza interjected right away. “One of my clients is a well-known doctor in North Carolina, where his permanent residence is located. Demanding he stay in Illinois isn’t fair.”\u003c/p\u003e\n\u003cp\u003e“Both defendants will surrender their passports,” the judge ordered. “If Dr. DeMarco chooses to return home, he’ll have to submit to electronic monitoring.”\u003c/p\u003e\n\u003cp\u003eCelia gathered the bail money as the men were processed out of the system. It was later that evening when Vincent walked out the front doors of the jail to come face-to-face with his sister, leaning against the side of her car, her face lined with worry as if she had aged a decade over night.\u003c/p\u003e\n\u003cp\u003e“Hey, little brother.” She forced a smile. “You look like hell.”\u003c/p\u003e\n\u003cp\u003e“Look who’s talking,” he said. “You’re starting to look like Ma.”\u003c/p\u003e\n\u003cp\u003eShe laughed awkwardly. “Ouch, low blow. Speaking of Mom, you should call her. She’s worried about you.”\u003c/p\u003e\n\u003cp\u003e“That woman hates me,” Vincent said. “She’s probably worried I’ll publicly disgrace the DeMarco name.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t hate you. She just has a strange way of showing her love. I had to talk her out of calling the Department of Corrections to ask if the foot of your bed faced the door, since it’s bad luck. She was worried your soul would slip out while you slept.”\u003c/p\u003e\n\u003cp\u003eDespite his stress, he managed to smile. “Must be why I got lucky enough to be released today. The bed faced the other way.”\u003c/p\u003e\n\u003cp\u003eThings grew tense as they drove toward Portage Park in silence. “Did Corrado get released?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “He went home an hour ago.”\u003c/p\u003e\n\u003cp\u003eVincent turned to look out the window. He wanted to ask about Carmine, but it was an answer he wasn’t ready to hear. It had been two weeks since the girl disappeared, and Vincent couldn’t imagine what his son was going through.\u003c/p\u003e\n\u003cp\u003eWhen they reached the Moretti’s house, Celia headed inside without waiting for him. He followed, his footsteps faltering when he heard her frantically whispering in Corrado’s office.\u003c/p\u003e\n\u003cp\u003e“I couldn’t do it,” she said. “How am I supposed to tell him?”\u003c/p\u003e\n\u003cp\u003e“You know him better than anyone,” Corrado said. “He’ll take it better coming from you.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter who it comes from—he’s going to flip out.”\u003c/p\u003e\n\u003cp\u003e“That may be true, but someone needs to tell Vincent.”\u003c/p\u003e\n\u003cp\u003eVincent stepped into the doorway. “Tell me what?”\u003c/p\u003e\n\u003cp\u003eCelia stammered. “Carmine was worried. Or, he is worried. He couldn’t just sit around. I suspected what he was going to do, but I couldn’t forbid him. I didn’t even know if I should. He’s an adult, and it’s not what she would want for him, and I knew you’d be upset, but it’s his life. And he was worried, Vincent. You were in jail, and he didn’t know who else to turn to.”\u003c/p\u003e\n\u003cp\u003eHer statements were disjointed, but the gist of them registered with him. “Don’t tell me he . . . No, there’s no way he went to them after everything I did to make sure it didn’t happen.”\u003c/p\u003e\n\u003cp\u003e“He did.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong! He’s not that stupid, Celia!”\u003c/p\u003e\n\u003cp\u003eHer eyes filled with tears. “I’m not wrong.”\u003c/p\u003e\n\u003cp\u003e“Then you misunderstood.”\u003c/p\u003e\n\u003cp\u003e“I didn’t,” she said. “Giovanni was here with him.”\u003c/p\u003e\n\u003cp\u003e“Giovanni? You have to be kidding. If he—”\u003c/p\u003e\n\u003cp\u003e“Vincent,” Corrado said, his harsh voice cutting him off. “You know there are things we cannot and should not say as men of honor, and you’re teetering dangerously close to saying something you’ll later regret.”\u003c/p\u003e\n\u003cp\u003e“But this is Carmine we’re talking about. This is my son!”\u003c/p\u003e\n\u003cp\u003e“Yes, and he’s made his choice. He’s in the life now, and nothing can change that fact.”\u003c/p\u003e\n\u003cp\u003e“There has to be something! Carmine isn’t cut out for this! He’s throwing his life away and why, Corrado? For what?”\u003c/p\u003e\n\u003cp\u003e“For her,” he said, giving him an incredulous look. “How soon you forget. You were once that eighteen-year-old boy, turning to La Cosa Nostra to save the woman you loved.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t save her! She’s dead, and if I would’ve never gotten involved in this, she’d—”\u003c/p\u003e\n\u003cp\u003e“She’d what?” Corrado asked, cutting him off again. “She’d be alive? Even you can’t believe that! She’d still be dead today, but she would’ve died a slave. You gave her a chance. Her life was cut short, but it wasn’t you or La Cosa Nostra that did it. Maura sacrificed herself. You think your son is so much like you, but what you fail to realize is he’s his mother, too. There’s nothing naïve about the decision he made.”\u003c/p\u003e\n\u003cp\u003eBefore he could respond, the phone in the office rang. Corrado grabbed the receiver off the desk in front of him. “Moretti.” He paused. “Yes, we’ll be there.”\u003c/p\u003e\n\u003cp\u003eVincent sighed when he hung up. “Salvatore.”\u003c/p\u003e\n\u003cp\u003e“He wants to see us.”\u003c/p\u003e\n\u003cp\u003e“Carmine’s in too deep,” Vincent said. “He has no idea what he’s doing.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope you’re wrong.” Corrado grabbed his keys. “How long until you need to report in?”\u003c/p\u003e\n\u003cp\u003e“Forty-eight hours.” Vincent had two days to self-surrender to be fitted with an ankle monitor. It wasn’t house arrest, with a curfew or a base restricting him to a certain location, but a precaution to make sure he didn’t try to disappear. It also meant they could keep a log of everywhere he went, which put him in a precarious situation within the organization.\u003c/p\u003e\n\u003cp\u003e“I suppose that means we have forty-eight hours, then.”\u003c/p\u003e\n\u003cp\u003eCorrado started for the door, but Celia stopped him. “It’s good to have you home, so make sure you come back.”\u003c/p\u003e\n\u003cp\u003eHe brushed his hand across her cheek. “I always do, don’t I?”\u003c/p\u003e\n\u003cp\u003eAnger festered inside Vincent as they drove to Salvatore’s house. They went straight to the den when they arrived, where Salvatore sat with a few members of the organization. The younger ones stood out of respect, but Vincent ignored them and took his usual seat.\u003c/p\u003e\n\u003cp\u003eHe ignored the glass of scotch someone tried to hand him, too.\u003c/p\u003e\n\u003cp\u003e“It’s nice to see the two of you,” Salvatore said. “I know you’re both honorable, though, so I’m not worried about any future issues in this case.”\u003c/p\u003e\n\u003cp\u003eVincent stared at him. As usual, Salvatore’s only concern was it coming back on him. He expected them to keep their mouths shut and accept whatever punishment, and the saddest part of all, Vincent thought, was they would do it. The Omertà vow of silence swore just that.\u003c/p\u003e\n\u003cp\u003e“Anyway, on to lighter business,” Sal said. “I assume you’ve heard the good news by now.”\u003c/p\u003e\n\u003cp\u003e“About Carmine?” Vincent clenched his hands into fists in his lap. There was nothing light or good about it.\u003c/p\u003e\n\u003cp\u003e“It’s great to have another generation of DeMarcos working with us. You’ve raised a great son, a loyal man like you. You should be proud.”\u003c/p\u003e\n\u003cp\u003eVincent cleared his throat to force back the words he really wanted to say. “Where is he?”\u003c/p\u003e\n\u003cp\u003e“He’s with Giovanni,” Salvatore said. “They’ve been trying to track down that poor girl. Such a shame she hasn’t been located.”\u003c/p\u003e\n\u003cp\u003e“Have they gotten any information?”\u003c/p\u003e\n\u003cp\u003eSalvatore’s insensitive laughter cut through the room. “Vincent, you know I’ve chosen to remain uninvolved. You’d have to ask them.”\u003c/p\u003e\n\u003cp\u003e“Still? What did my son come to you for?”\u003c/p\u003e\n\u003cp\u003e“Carmine choosing this path is unrelated,” he said, his lips still curved into a sinister smile. “Giovanni volunteered for his little mission, and they have our resources at their disposal, of course, but it has nothing to do with me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-forever-1/page-75.html","bookId":2784,"creation":"Oct 5, 2019 5:27:53 PM","modification":"Oct 5, 2019 5:27:53 PM"}
