{"id":83308,"no":20,"title":"Page 20","content":"\u003cp\u003eBut at the word encrypted, Liz had snatched the journal form my hands and was holding it up to the light.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the pigeons!\" she shouted, and I worried that Tina, Eva, Courtney, and the rest of the junior class might come barging into our suite with crossbows and curling irons.\u003c/p\u003e\n\u003cp\u003e\"This is it,\" Liz said, jabbing her finger onto the page. \"See, look at this. It\u0027s almost more like hieroglyphs in a way. Almost like a -\"\u003c/p\u003e\n\u003cp\u003e\"Language,\" Macey said.\u003c/p\u003e\n\u003cp\u003eLiz\u0027s eyes shone in the dim room. \"Yeah, that exactly it.\"\u003c/p\u003e\n\u003cp\u003e\"And you don\u0027t crack languages - not really,\" Bex said. \"You learn them.\"\u003c/p\u003e\n\u003cp\u003e\"Or you translate them,\" Macey said.\u003c/p\u003e\n\u003cp\u003e\"Exactly. Mr. Solomon didn\u0027t leave a bunch of crazy scribblings on a board . . .\" Liz started.\u003c/p\u003e\n\u003cp\u003e\"He left a key.\" Macey reached out to take the book. She ran her finger over the page. \"Is this Mr. Solomon\u0027s handwriting?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I found myself whisper. \"It\u0027s my dad\u0027s.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Two\u003c/p\u003e\n\u003cp\u003eCovert Operations Report\u003c/p\u003e\n\u003cp\u003e(Translated by Operative Morgan and Sutton)\u003c/p\u003e\n\u003cp\u003eDay 1\u003c/p\u003e\n\u003cp\u003eJoe\u0027s nightmares are back.\u003c/p\u003e\n\u003cp\u003eHe says they\u0027re nothing, but I can hear him screaming down the hall - something about Blackthorne and Vatican City. Last night I ran to his room and found him reaching, half asleep, for a knife.\u003c/p\u003e\n\u003cp\u003eHe says he had an op go bad there. Only problem is, according to Langley, Agent Joseph Solomon has never been to Rome.\u003c/p\u003e\n\u003cp\u003eDay 26\u003c/p\u003e\n\u003cp\u003eI wish someone would tell me that it\u0027s okay to spy on my best friend. I keep this journal in code. I listen to his calls. Tonight I followed him to a dead letter drop in Georgetown.\u003c/p\u003e\n\u003cp\u003eI wish someone would tell me that I\u0027m crazy. It would be far better than being right, because all I can think about is the passport I found in his safety deposit box (yeah, I also broke into his safety deposit box).\u003c/p\u003e\n\u003cp\u003eThree years ago he went to Rome on a passport not issued by the CIA - at the same time that someone tried to kill the Pope.\u003c/p\u003e\n\u003cp\u003eWith a knife.\u003c/p\u003e\n\u003cp\u003eI really hope I\u0027m going crazy.\u003c/p\u003e\n\u003cp\u003eDay 92\u003c/p\u003e\n\u003cp\u003eI think I know what Jose was. What he is?\u003c/p\u003e\n\u003cp\u003eBut . . . no. it can\u0027t be true.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want it to be true.\u003c/p\u003e\n\u003cp\u003eDay 96\u003c/p\u003e\n\u003cp\u003eSome people say the Circle doesn\u0027t exist - that there is no ancient association of spies and assassins out to manipulate the world order, but it turns out they are real.\u003c/p\u003e\n\u003cp\u003eTurns out my roommate is one.\u003c/p\u003e\n\u003cp\u003eTurns out a people are.\u003c/p\u003e\n\u003cp\u003eDay 100\u003c/p\u003e\n\u003cp\u003eJoe told me the truth tonight. Joe told me everything.\u003c/p\u003e\n\u003cp\u003eWe\u0027re going to stop them. It might be the last thing we ever do, but we\u0027ll do it.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t dare linger on those last words - think about what they meant.\u003c/p\u003e\n\u003cp\u003e\"How old were they when they wrote that?\" Bex asked.\u003c/p\u003e\n\u003cp\u003eI looked at the date at the corner of the page and did the math in my head. \"Twenty-three,\" I said, and then I re-did the math, because it didn\u0027t seem right that my father had started chasing the Circle of Cavan before he\u0027d even started dating my mother - that this mission was officially older than I was.\u003c/p\u003e\n\u003cp\u003e\"Turn,\" Liz said, not trying to hide her impatience at being forced to read at a non-speed-of-light pace, but these were the last things my father would ever say to me. I wanted to make every sentence count.\u003c/p\u003e\n\u003cp\u003eDay 219\u003c/p\u003e\n\u003cp\u003eAfter nine months of bureaucracy and protocol, Operatives Morgan and Solomon have concluded that the criminal organization known as the Circle of Cavan has too many double agents placed within official intelligence organizations to be effectively neutralized through official channels.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a good thing Operatives Morgan and Solomon and very good at being unofficial.\u003c/p\u003e\n\u003cp\u003eDay 290\u003c/p\u003e\n\u003cp\u003eAfter two weeks in Rome, The Operatives have ascertained that the Circle\u0027s base of operations here has been shut down or relocated since Operative Solomon was sent to Vatican.\u003c/p\u003e\n\u003cp\u003eThey have also learned that a person will really get sick of pasta. Eventually.\u003c/p\u003e\n\u003cp\u003eDay 407\u003c/p\u003e\n\u003cp\u003eToday, Hungarian officials positively identified the body of the man found in a river in Budapest as the man who was thinking of providing intel to The Operatives about the Circle\u0027s Eastern European operatives.\u003c/p\u003e\n\u003cp\u003eThey killed him.\u003c/p\u003e\n\u003cp\u003eHe was the best lead we\u0027d had in over a year, and they killed him.\u003c/p\u003e\n\u003cp\u003eThe air around us was warmer; it was almost spring; and yet there were goose bumps on our arms. It still felt a long, long way from summer.\u003c/p\u003e\n\u003cp\u003eDay 506\u003c/p\u003e\n\u003cp\u003eThe Deputy Director warned The Operatives again about taking on the Circle themselves, but Operative Solomon insists that the Circle has recruited too long and too well to be effectively targeted by a large-scale operation.\u003c/p\u003e\n\u003cp\u003eThe Circle has spies. Literally. The Circle has spies everywhere.\u003c/p\u003e\n\u003cp\u003eThe Operatives must go alone.\u003c/p\u003e\n\u003cp\u003eThe more I read, the faster I turned the pages until, finally, I flipped to the end, desperate to read the last pages first - as if, maybe, this time it might have a different ending.\u003c/p\u003e\n\u003cp\u003eDay 5,860\u003c/p\u003e\n\u003cp\u003eThe Operatives received word that their asset in Athens had had a breakthrough.\u003c/p\u003e\n\u003cp\u003eOperative Solomon had begun preparations to travel to Greece, but the Deputy Director of the CIA suspects The Operatives are still taking on the Circle on their own, so he has placed Operative Solomon on desk duty. Operative Morgan will go instead.\u003c/p\u003e\n\u003cp\u003eMy father was thirty-nine when he wrote that, and the book was almost out of pages - the story, in a lot of ways, was almost at its end. So I held my breath and turned the page and saw that the handwriting changed. My father\u0027s lazy scrawl was gone - replaced with the precise penmanship that I\u0027d seen scribbled across the sublevel blackboards for the past year and a half.\u003c/p\u003e\n\u003cp\u003eDay 5,869\u003c/p\u003e\n\u003cp\u003eCutout made contact today with word that Operative Morgan did not appear at their meeting. Cutout will follow backup protocols again until Operative Morgan shows.\u003c/p\u003e\n\u003cp\u003eDay 5,878\u003c/p\u003e\n\u003cp\u003eOperative Solomon arrived at Operative Morgan\u0027s safe house in Athens, but it appears he never made it this far. Will begin backtracking immediately.\u003c/p\u003e\n\u003cp\u003eDay 5,892\u003c/p\u003e\n\u003cp\u003eCIA has been contacted. Full force of The Agency is now involved in the search for Operative Morgan.\u003c/p\u003e\n\u003cp\u003eDay 5,900\u003c/p\u003e\n\u003cp\u003eThree weeks of looking and trail has gone cold.\u003c/p\u003e\n\u003cp\u003eHe\u0027s gone.\u003c/p\u003e\n\u003cp\u003eHe\u0027s just gone.\u003c/p\u003e\n\u003cp\u003eSomeone has to tell Rachel.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Three\u003c/p\u003e\n\u003cp\u003eTHINGS THAT WOULD NEVER BE\u003c/p\u003e\n\u003cp\u003eTHE SAME, NEVER, EVER AGAIN\u003c/p\u003e\n\u003cp\u003e(A list my Cameron Morgan)\u003c/p\u003e\n\u003cp\u003e·Macey\u0027s pajama pants: because grass stains and air shaft dirt never come out.\u003c/p\u003e\n\u003cp\u003e·Agent Townsend\u0027s reputation: because if word ever got out that the four of us had done what he\u0027d been trying to do for months, I\u0027m pretty sure they\u0027d take away his double-0\u003c/p\u003e\n\u003cp\u003estatus (If Tina was even right that he had one).\u003c/p\u003e\n\u003cp\u003e·Liz: because the Pigeon Code had opened up a whole new world of cryptography (and she was already pretty obsessed with the old one).\u003c/p\u003e\n\u003cp\u003e·Bex: because her parents had been right.\u003c/p\u003e\n\u003cp\u003e·Bex: because her parents had been wrong.\u003c/p\u003e\n\u003cp\u003e·Me: just because.\u003c/p\u003e\n\u003cp\u003eThe next night I walked toward my mother\u0027s office carrying my father\u0027s journal and my teacher\u0027s secret. I had no idea which one was heavier.\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t Sodium Pentothal, was it?\"\u003c/p\u003e\n\u003cp\u003eI spun at the sound and saw Agent Townsend standing in the Hall of History, staring at me through the protective glow of Gilly\u0027s - I mean Cavan\u0027s - sword.\u003c/p\u003e\n\u003cp\u003e\"In the apple?\" he clarified.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you\u0027re -\" I tried to push past him and into my mother\u0027s office, but his hand was on my arm. His breath was warm in my ear.\u003c/p\u003e\n\u003cp\u003e\"You can try ot lie to me, but I wouldn\u0027t recommend it.\"\u003c/p\u003e\n\u003cp\u003eMy father\u0027s journal was in my backpack, and it felt like a talisman, giving me strength.\u003c/p\u003e\n\u003cp\u003e\"Get your hand off me.\" Townsend eyed me but didn\u0027t move, and I tried to twist free.\u003c/p\u003e\n\u003cp\u003e\"Teachers can\u0027t manhandle students and make wild accusation. The trustees would never\u003c/p\u003e\n\u003cp\u003e-\"\u003c/p\u003e\n\u003cp\u003e\"Oh, but the trustees have been employing a famous double agent for almost two years.\u003c/p\u003e\n\u003cp\u003eThey\u0027re very eager to help.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still a student at this school and -\"\u003c/p\u003e\n\u003cp\u003e\"Now, now, Ms. Morgan. Wither you\u0027re a trained operative I\u0027m supposed to distrust and respect, or a sixteen-year-old girl -\"\u003c/p\u003e\n\u003cp\u003e\"Just turned seventeen,\" I corrected him.\u003c/p\u003e\n\u003cp\u003e\" - I\u0027m supposed to go east on. You can\u0027t have it both ways.\" He released my arm and steeped away. \"I would have thought your precious Mr. Solomon would have taught you better than that.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not my Mr. Solomon.\"\u003c/p\u003e\n\u003cp\u003e\"Sure he is. Isn\u0027t that why you and your little friends tried to hack into my records? Stake out my office? Put some nasty concoction inside the apple of an unsuspecting teacher?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t say a thing.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good; don\u0027t dent it. Denying the undeniable just makes you sound like a fool as well as a liar. In this profession, you can be one - sometimes the other. But never both.\u003c/p\u003e\n\u003cp\u003eHe moved through the Hall of History, eyeing our most prized possessions as if they were trinkets at a fair.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t face me as he asked, \"You believed him, didn\u0027t you? Thought he was a good guy? Well, that\u0027s your mistake. No one - and I do mean no one - in this line of work is ever truly a good guy. It we were, we\u0027d be doing something bloody well different form this.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t know what he was talking about. He didn\u0027t know . . . anything. I started toward my mother\u0027s office, needing her more than ever, desperate to shoe her - to prove that we weren\u0027t fools.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not in there,\" he called across the empty hall. I felt my blood turn cold.\u003c/p\u003e\n\u003cp\u003e\"Where is she?\"\u003c/p\u003e\n\u003cp\u003eHe smiled slightly. \"Gone.\"\u003c/p\u003e\n\u003cp\u003e\"What did you do to her?\"\u003c/p\u003e\n\u003cp\u003e\"Me?\" he laughed. Yes, actual laughage. \"Allow me to clear some things up for you, Ms.\u003c/p\u003e\n\u003cp\u003eMorgan.\" He stepped closer. \"I\u0027m not a member of the Circle. I\u0027ve never even seen Blackthorne. Of course, we probably had something like it - couldn\u0027t rule it out.\" He shook his head. \"But I was never a part of that.\"\u003c/p\u003e\n\u003cp\u003e\"A part of what?\"\u003c/p\u003e\n\u003cp\u003e\"I am the bloody good guy.\"\u003c/p\u003e\n\u003cp\u003eI stood silent, watching him walk away, until . . .\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wrong!\" I yelled, the words echoing down the empty hall. \"You\u0027re wrong about everything!\"\u003c/p\u003e\n\u003cp\u003eAgent Townsend stopped and turned slowly.\u003c/p\u003e\n\u003cp\u003e\"Nine hours ago, a CIA transport team was ambushed outside of Langley. Three guards were killed and Joe Solomon was taken.\" He stared at me down the long corridor. \"Your innocent man is back with the Circle tonight, Ms. Morgan. They have him. He\u0027s free.\"\u003c/p\u003e\n\u003cp\u003eThat night I had the strangest dream. I was standing at the top of the Grand Staircase in a long beautiful dress. I heard the sounds of the Virginia reel come sweeping toward me, and below me, people crowed the foyer floor. But the strangest thing of all was that my father was standing at the bottom of the staircase, waiting.\u003c/p\u003e\n\u003cp\u003eI descended the stairs and took his arm, and together we made our way through the crowd that filled the Grand Hall. There was dancing and drinking. It was a party, but the feeling in the room was that there was no reason at all to celebrate.\u003c/p\u003e\n\u003cp\u003eAnd then suddenly, a man appeared, holding a sword.\u003c/p\u003e\n\u003cp\u003eI knew I had to stop him - I had to make it stop - but the man moved faster toward where I stood. His eyes pulled closer in the dim ballroom, and I stared at a face I knew.\u003c/p\u003e\n\u003cp\u003eA face I\u0027ve kissed.\u003c/p\u003e\n\u003cp\u003e\"No.\" I might have said the word, but I hand was over my mouth. Strong arms were holding me down while I kicked at the covers wrapped tightly around my legs.\u003c/p\u003e\n\u003cp\u003eThen I heard a deep voice whisper my name. \"Cammie, wake up.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/only-the-good-spy-young-gallagher-girls-4/page-20.html","bookId":2749,"creation":"Oct 5, 2019 4:51:06 PM","modification":"Oct 5, 2019 4:51:06 PM"}
