{"id":83310,"no":22,"title":"Page 22","content":"\u003cp\u003eThe sun was coming up over Roseville. I\u0027d never seen it from that window, but it was especially beautiful with the early morning rays reflected in Madame Dabney\u0027s finest crystal. In that moment and that place, almost anything seemed to lie within our grasp.\u003c/p\u003e\n\u003cp\u003eAnd maybe that\u0027s why Bex smiled. \"Well, I have always wanted to see Blackthorne.\"\u003c/p\u003e\n\u003cp\u003eI looked at Liz. \"I just tweaked the van to incorporate solar technology. It really needs a road test for statistical significance, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Us versus Blackthorne?\" Macey said with a smile. \"Yeah, I\u0027m all for that.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t know how to explain it, but right then, things seemed okay. Our mission was clear.\u003c/p\u003e\n\u003cp\u003eWe could go to Blackthorne.\u003c/p\u003e\n\u003cp\u003eWe could get the journal.\u003c/p\u003e\n\u003cp\u003eThen we could find a way to bring Joe Solomon home.\u003c/p\u003e\n\u003cp\u003eYes, in that moment everything was okay. But, of course, that moment could not last.\u003c/p\u003e\n\u003cp\u003eI remember the sound of the door as it swung open, the shocked, surprised look that crossed each of my roommates\u0027 faces as we turned to see the slim, dark silhouette that stood in the open doorway and said, \"So when do we leave?\"\u003c/p\u003e\n\u003cp\u003eMy mother took two steps forward, then turned to stare at Zach. \"Didn\u0027t I tell you to stay in my office?\"\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Six\u003c/p\u003e\n\u003cp\u003eTHINGS THAT REALLY, REALLY SURPRISED ME\u003c/p\u003e\n\u003cp\u003eABOUT THAT PARTICUALR ROAD TRIP:\u003c/p\u003e\n\u003cp\u003e1.That it happened. At all.\u003c/p\u003e\n\u003cp\u003e2.That it happened with a boy.\u003c/p\u003e\n\u003cp\u003e3.That of all the people in the van, Bex spent the most time driving.\u003c/p\u003e\n\u003cp\u003e4.That after a whole day in a vehicle with nothing else to snack on, a person really can sick of Peanut M\u0026amp;M\u0027s.\u003c/p\u003e\n\u003cp\u003e5.That even while sleeping in a van, Macey McHenry\u0027s hair never gets messed up.\u003c/p\u003e\n\u003cp\u003e6.That no one mentioned Mr. Solomon\u0027s name, not even once.\u003c/p\u003e\n\u003cp\u003e7.That no one talked about where we were going.\u003c/p\u003e\n\u003cp\u003e8.That four Gallagher Girls were playing hooky and missing an entire day of class (even with our headmistress\u0027s permission).\u003c/p\u003e\n\u003cp\u003eThat, if you drive all night and only stop for essential, the Blackthorne Institute for Boys is only ten hours away from the Gallagher Academy.\u003c/p\u003e\n\u003cp\u003eSomehow it had always felt much farther.\u003c/p\u003e\n\u003cp\u003e\"Are you still mad at me?\" Zach whispered as we crossed the Pennsylvania border. His leg was pressing against mine, but I didn\u0027t think about how if felt, because my mother (who is a spy) was riding shotgun in the front seat, and my roommates (who are future spies) were surrounding us in the van. And besides, it doesn\u0027t take a lot of training to know that leg-pressing can seriously divert a girl from little things. Like trying not die.\u003c/p\u003e\n\u003cp\u003eSo I didn\u0027t say a word.\u003c/p\u003e\n\u003cp\u003e\"Ohh,\" Zach whispered. \"The silent treatment.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking to you, Zach,\" I whispered, whirling on him, \"because I know you\u0027re not going to really say anything anyway. Should I be asking you more questions you refuse to answer?\"\u003c/p\u003e\n\u003cp\u003eAs I turned and faced forward again, watched the yellow lines of the highway flying by, I expected more excuses. More lies. But instead, Zach just leaned across me and whispered to Liz, \"She\u0027s cute when she\u0027s silent.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t utter a single word.\u003c/p\u003e\n\u003cp\u003eNot when he ate the last of the M\u0026amp;M\u0027s.\u003c/p\u003e\n\u003cp\u003eNot when he put his head only shoulder and tried to take a nap.\u003c/p\u003e\n\u003cp\u003eNot when he and Liz thumb wrestled (despite that fact that I was sitting between them) for better part of the state of Pennsylvania.\u003c/p\u003e\n\u003cp\u003eNot when Liz and Macey finally fell asleep and he leaned close to me and whispered,\u003c/p\u003e\n\u003cp\u003e\"Are you sure you wanna do this, Gallagher Girl?\"\\par\u003c/p\u003e\n\u003cp\u003eNope. Not even then. I didn\u0027t have anything else to say.\u003c/p\u003e\n\u003cp\u003eAt dusk, the silence broke as I heard my mother say, \"Pull over here.\"\u003c/p\u003e\n\u003cp\u003eBex pulled into the parking lot of an old gas station by the side of a narrow two-lane highway. Weeds grew up between abandoned pumps. Rusty machines bore the ancient logos of Coke and Pepsi.\u003c/p\u003e\n\u003cp\u003eWe felt utterly alone, but in a split second, all that changed.\u003c/p\u003e\n\u003cp\u003eA dark car was approaching from the south, traveling way too fast. Tires screeched as it slid sideways into the gravel lot, coming to a stop three feet the bumper of Liz\u0027s van.\u003c/p\u003e\n\u003cp\u003e\"Mom!\" I shouted, bolting upright, blood pounding in my ears. But before I could fully process the worst-case scenario that was playing through my mind, my best friend sat up straighter too and yelled, \"Mom?\" a second later, Bex was throwing open the van door and running to her mother, who was climbing out of the other car.\u003c/p\u003e\n\u003cp\u003e\"Hello, darling,\" Mrs. Baxter said, throwing her arms around her daughter. But I noticed her gaze never left my mother\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"Anything, Grace?\" Mom asked, climbing out of the van.\u003c/p\u003e\n\u003cp\u003eBex\u0027s mother shook her head. \"Nothing. You\u0027re clear.\"\u003c/p\u003e\n\u003cp\u003eAt that moment a white pickup appeared on the deserted road, this time traveling from the north. It pulled into the abandoned station, and somehow I wasn\u0027t surprised at all to see Bex\u0027s father behind the wheel.\u003c/p\u003e\n\u003cp\u003eHe hoped out of the truck. \"All clear on my end, Rachel. You\u0027re free.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Abe.\" She sounded relieved, and to tell you the truth, id didn\u0027t like it. Because for there to relief, there had to have been fear. And fear . . . well . . . I didn\u0027t want to think about that.\u003c/p\u003e\n\u003cp\u003eLiz poked me. \"These are Bex\u0027s parents!\"\u003c/p\u003e\n\u003cp\u003eI looked at my mother, who shrugged. \"You didn\u0027t expect me not to recruit at least a little grown-up back up, did you?\"\u003c/p\u003e\n\u003cp\u003eMacey stood on my other side and exclaimed, \"We\u0027re going on a mission with Bex\u0027s parents!\" as if wondering whether or not we were ready for Baxters to the power of three.\u003c/p\u003e\n\u003cp\u003eBut my mother was shaking her head. \"Actually, girls, for unsanctioned ops, it\u0027s best to minimize the exposure of official agents.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s rule as old as espionage itself: Don\u0027t do yourself what you can get someone else to do for you. There are a million harmless reasons why a bunch of Gallagher Girls might break into Blackthorne (jokes, dares, pranks, etc.). For a bunch of grown-ups, not so much.\u003c/p\u003e\n\u003cp\u003eBex knew all this - I know she did - and yet she was looking from my mother hers and then back again. \"So why are you . . .\" she started, then trailed off.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not here to help us.\" My voice was flat against the wind. \"They\u0027re here to guard me.\" A look passed across my roommates\u0027 faces as if no time at all had passed since November - as if we were still standing on a dark street in D.C.\u003c/p\u003e\n\u003cp\u003e\"Do you have the journal?\" Grace asked.\u003c/p\u003e\n\u003cp\u003e\"No.\" Mom shook her head, then pointed to my roommates and me. \"They beat me to it.\"\u003c/p\u003e\n\u003cp\u003eAnd that was when things got really weird.\u003c/p\u003e\n\u003cp\u003eI mean, my mom had broken into Sublevel Two!\u003c/p\u003e\n\u003cp\u003eMy mom had been after my dad\u0027s journal.\u003c/p\u003e\n\u003cp\u003eMy mom had been person hot on our heels, creeping through the darkness in the depths of our school, which meant, I guess, that Agent Townsend hadn\u0027t been.\u003c/p\u003e\n\u003cp\u003eI was still shaking my head, trying to wrap my mind around that - around everything -\u003c/p\u003e\n\u003cp\u003ewhen another car appeared on the highway, and Macey cried, \"Abby?\"\u003c/p\u003e\n\u003cp\u003eIt almost sounded like a question, and with one glance at my aunt I saw why. Her glossy hair had lost its shine. And when she walked towards us, the bounce that I had come to know in her step was gone.\u003c/p\u003e\n\u003cp\u003e\"Hey, Squirt,\" she said, but it sounded forced. \"Playing hooky, I see.\"\u003c/p\u003e\n\u003cp\u003eI shrugged. \"Maybe this is a CoveOps field exercise?\"\u003c/p\u003e\n\u003cp\u003eShe raised an eyebrow. \"I know Agent Townsend, Cams.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Bex said.\u003c/p\u003e\n\u003cp\u003e\"\"Which is why I am more than willing to take part in this little extracurricular assignment.\" She looked at her sister. \"Well . . . one of the reasons.\"\u003c/p\u003e\n\u003cp\u003eMy mom turned to Mr. Baxter. \"What are our friends at Six saying, Abe?\"\u003c/p\u003e\n\u003cp\u003e\"Same story, different accent. No one has a bloody clue where they\u0027ve taken him. No one seems to bloody care.\"\u003c/p\u003e\n\u003cp\u003e\"I care.\"\u003c/p\u003e\n\u003cp\u003eZach stood on the side of the dusty road, hands in his pockets. When Mrs. Baxter saw him, she smiled a little too wide.\u003c/p\u003e\n\u003cp\u003e\"Hello, Zachary,\" she said. \"It\u0027s very nice to meet you. Rachel has told us . . . It\u0027s very nice to meet you.\"\u003c/p\u003e\n\u003cp\u003eZach mumbled something that sounded like \"You too.\" ( I guess Blackthorne doesn\u0027t have a Madame Dabney.)\u003c/p\u003e\n\u003cp\u003eAnd then the time for pleasantries must have been over because Mrs. Baxter turned to my mom. \"Ready?\"\u003c/p\u003e\n\u003cp\u003eIt seemed like at the perfect question at the time. After all, I was getting ready to break into Blackthorne. I was out of the mansion. I was getting ready to go on a mission. A real mission. With Zach.\u003c/p\u003e\n\u003cp\u003eAnd my mom.\u003c/p\u003e\n\u003cp\u003eWords could not describe the nerves. Or the weirdness.\u003c/p\u003e\n\u003cp\u003eIt occurred to me that I should have been taking notes, savoring every moment. But there was no time.\u003c/p\u003e\n\u003cp\u003eMrs. Baxter started for the truck, climbing in beside her husband as she tossed my mother the keys to the sedan with the dark windows. Abby was already crawling into the SUV as Liz and Macey started for Liz\u0027s van, but my mother waved them away.\u003c/p\u003e\n\u003cp\u003e\"It stays here,\" she said with a shake of her head. \"We can\u0027t take the risk that someone might trace it back to you and the school.\"\u003c/p\u003e\n\u003cp\u003eWhen my mother turned to me and asked, \"Do you have everything?\" she sounded like she was dropping me off at school or at a friend\u0027s house. She sounded almost like a normal mom.\u003c/p\u003e\n\u003cp\u003eWhen I said, \"Yeah, we\u0027re ready,\" I sounded almost like a normal girl.\u003c/p\u003e\n\u003cp\u003eBut as I watched my bodyguards pull onto the highway to monitor the perimeter of the school, normal felt completely overrated.\u003c/p\u003e\n\u003cp\u003eA moment later, my mother left us in a cloud of dust in the middle of nowhere, beside a gas station that had no gas, a van we couldn\u0027t drive, and a boy that some of the best spies in the world were hesitant to trust.\u003c/p\u003e\n\u003cp\u003e\"And what are we supposed to do?\" Macey asked.\u003c/p\u003e\n\u003cp\u003eZach smiled. \"We walk.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Seven\u003c/p\u003e\n\u003cp\u003eIt is a little-known fact about covert operations that you will spend a lot of time with people you can\u0027t really trust. They may be traitors and liars. We call them assets or informants. But mostly, in those days, I called him Zach.\u003c/p\u003e\n\u003cp\u003eThe Operatives made contact with an asset who had firsthand knowledge of the Blackthorne Institute for Boys.\u003c/p\u003e\n\u003cp\u003eThe Asset was also privy to Joe Solomon\u0027s private plans, the Circle\u0027s secrets, and some of the most awesome-smelling soap in the world.\u003c/p\u003e\n\u003cp\u003eThe Operatives, therefore, tried not to trust (or smell) The Asset.\u003c/p\u003e\n\u003cp\u003eWalking across the week-covered lot of the gas station, I could feel the darkness falling.\u003c/p\u003e\n\u003cp\u003eThe air was damp and chilly. I could hear Liz stumbling on the path behind me and knew without looking that Bex was bringing up the rear. I kept my eyes trained on the back of Zach\u0027s head as we walked deeper into the thick woods and closer to Blackthorne.\u003c/p\u003e\n\u003cp\u003eTwenty minutes later, I found myself asking, \"How long until we get to the school?\"\u003c/p\u003e\n\u003cp\u003e\"Not long,\" Zach said, without a breaking a stride.\u003c/p\u003e\n\u003cp\u003e\"How many guards will be there on patrol at our point of entry?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the interval of the security camera sweep?\"\u003c/p\u003e\n\u003cp\u003e\"Hard to say.\"\u003c/p\u003e\n\u003cp\u003eI reached out for his arm in the dark. \"What do you know, Zach?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re on my home turf now, Gallagher Girl.\" His breath was warm on my skin. \"Do you have a problem with that?\"\u003c/p\u003e\n\u003cp\u003e\"Guys . . .\" I heard Liz\u0027s timid voice behind me.\u003c/p\u003e\n\u003cp\u003e\"Maybe I do,\" I snapped back at Zach.\u003c/p\u003e\n\u003cp\u003e\"Cam,\" Bex said, her voice mimicking the concern of Liz\u0027s, but I barely heard.\u003c/p\u003e\n\u003cp\u003e\"Maybe I -\" I started again, but before I could say another word, Bex grabbed my arm. \u003c/p\u003e","sourceLink":"https://allnovel.net/only-the-good-spy-young-gallagher-girls-4/page-22.html","bookId":2749,"creation":"Oct 5, 2019 4:51:06 PM","modification":"Oct 5, 2019 4:51:06 PM"}
