{"id":109664,"no":28,"title":"Page 28","content":"\u003cp\u003eHarry, Ron, and Hermione went up to the Owlery after breakfast on Sunday to send a letter to Percy, asking, as Sirius had suggested, whether he had seen Mr. Crouch lately. They used Hedwig, because it had been so long since she\u0027d had a job. When they had watched her fly out of sight through the Owlery window, they proceeded down to the kitchen to give Dobby his new socks.\u003c/p\u003e\n\u003cp\u003eThe house-elves gave them a very cheery welcome, bowing and curtsying and bustling around making tea again. Dobby was ecstatic about his present.\u003c/p\u003e\n\u003cp\u003e\"Harry Potter is too good to Dobby!\" he squeaked, wiping large tears out of his enormous eyes.\u003c/p\u003e\n\u003cp\u003e\"You saved my life with that gillyweed, Dobby, you really did,\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"No chance of more of those eclairs, is there?\" said Ron, who was looking around at the beaming and bowing house-elves.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve just had breakfast!\" said Hermione irritably, but a great silver platter of eclairs was already zooming toward them, supported by four elves.\u003c/p\u003e\n\u003cp\u003e\"We should get some stuff to send up to Snuffles,\" Harry muttered.\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" said Ron. \"Give Pig something to do. You couldn\u0027t give us a bit of extra food, could you?\" he said to the surrounding elves, and they bowed delightedly and hurried off to get some more.\u003c/p\u003e\n\u003cp\u003e\"Dobby, where\u0027s Winky?\" said Hermione, who was looking around.\u003c/p\u003e\n\u003cp\u003e\"Winky is over there by the fire, miss,\" said Dobby quietly, his ears drooping slightly.\u003c/p\u003e\n\u003cp\u003e\"Oh dear,\" said Hermione as she spotted Winky.\u003c/p\u003e\n\u003cp\u003eHarry looked over at the fireplace too. Winky was sitting on the same stool as last time, but she had allowed herself to become so filthy that she was not immediately distinguishable from the smoke-blackened brick behind her. Her clothes were ragged and unwashed. She was clutching a bottle of butterbeer and swaying slightly on her stool, staring into the fire. As they watched her, she gave an enormous hiccup.\u003c/p\u003e\n\u003cp\u003e\"Winky is getting through six bottles a day now,\" Dobby whispered to Harry.\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s not strong, that stuff,\" Harry said.\u003c/p\u003e\n\u003cp\u003eBut Dobby shook his head. \"\u0027Tis strong for a house-elf, sir,\" he said.\u003c/p\u003e\n\u003cp\u003eWinky hiccuped again. The elves who had brought the eclairs gave her disapproving looks as they returned to work.\u003c/p\u003e\n\u003cp\u003e\"Winky is pining, Harry Potter,\" Dobby whispered sadly. \"Winky wants to go home. Winky still thinks Mr. Crouch is her master, sir, and nothing Dobby says will persuade her that Professor Dumbledore is her master now.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, Winky,\" said Harry, struck by a sudden inspiration, walking over to her, and bending down, \"you don\u0027t know what Mr. Crouch might be up to, do you? Because he\u0027s stopped turning up to judge the Triwizard Tournament.\"\u003c/p\u003e\n\u003cp\u003eWinky\u0027s eyes flickered. Her enormous pupils focused on Harry. She swayed slightly again and then said, \"M - Master is stopped - hic - coming?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Harry, \"we haven\u0027t seen him since the first task. The Daily Prophet\u0027s saying he\u0027s ill.\"\u003c/p\u003e\n\u003cp\u003eWinky swayed some more, staring blurrily at Harry.\u003c/p\u003e\n\u003cp\u003e\"Master - hic - ill?\"\u003c/p\u003e\n\u003cp\u003eHer bottom lip began to tremble.\u003c/p\u003e\n\u003cp\u003e\"But we\u0027re not sure if that\u0027s true,\" said Hermione quickly.\u003c/p\u003e\n\u003cp\u003e\"Master is needing his - hic - Winky!\" whimpered the elf. \"Master cannot - hic - manage - hic - all by himself....\"\u003c/p\u003e\n\u003cp\u003e\"Other people manage to do their own housework, you know, Winky,\" Hermione said severely.\u003c/p\u003e\n\u003cp\u003e\"Winky - hic - is not only - hic - doing housework for Mr. Crouch!\" Winky squeaked indignantly, swaying worse than ever and slopping butterbeer down her already heavily stained blouse. \"Master is - hic - trusting Winky with - hic - the most important - hic - the most secret...\"\u003c/p\u003e\n\u003cp\u003e\"What?\" said Harry.\u003c/p\u003e\n\u003cp\u003eBut Winky shook her head very hard, spilling more butterbeer down herself.\u003c/p\u003e\n\u003cp\u003e\"Winky keeps - hic - her master\u0027s secrets,\" she said mutinously, swaying very heavily now, frowning up at Harry with her eyes crossed. \"You is - hic - nosing, you is.\"\u003c/p\u003e\n\u003cp\u003e\"Winky must not talk like that to Harry Potter!\" said Dobby angrily. \"Harry Potter is brave and noble and Harry Potter is not nosy!\"\u003c/p\u003e\n\u003cp\u003e\"He is nosing - hic - into my master\u0027s - hic - private and secret - hic - Winky is a good house-elf - hic - Winky keeps her silence - hic - people trying to - hic - pry and poke - hic -\"\u003c/p\u003e\n\u003cp\u003eWinky\u0027s eyelids drooped and suddenly, without warning, she slid off her stool into the hearth, snoring loudly. The empty bottle of butterbeer rolled away across the stone-flagged floor. Half a dozen house-elves came hurrying forward, looking disgusted. One of them picked up the bottle; the others covered Winky with a large checked tablecloth and tucked the ends in neatly, hiding her from view.\u003c/p\u003e\n\u003cp\u003e\"We is sorry you had to see that, sirs and miss!\" squeaked a nearby elf, shaking his head and looking very ashamed. \"We is hoping you will not judge us all by Winky, sirs and miss!\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s unhappy!\" said Hermione, exasperated. \"Why don\u0027t you try and cheer her up instead of covering her up?\"\u003c/p\u003e\n\u003cp\u003e\"Begging your pardon, miss,\" said the house-elf, bowing deeply again, \"but house-elves has no right to be unhappy when there is work to be done and masters to be served.\"\u003c/p\u003e\n\u003cp\u003e\"Oh for heavens sake!\" Hermione cried. \"Listen to me, all of you! You\u0027ve got just as much right as wizards to be unhappy! You\u0027ve got the right to wages and holidays and proper clothes, you don\u0027t have to do everything you\u0027re told - look at Dobby!\"\u003c/p\u003e\n\u003cp\u003e\"Miss will please keep Dobby out of this,\" Dobby mumbled, looking scared. The cheery smiles had vanished from the faces of the house-elves around the kitchen. They were suddenly looking at Hermione as though she were mad and dangerous.\u003c/p\u003e\n\u003cp\u003e\"We has your extra food!\" squeaked an elf at Harry\u0027s elbow, and he shoved a large ham, a dozen cakes, and some fruit into Harry\u0027s arms. \"Good-bye!\"\u003c/p\u003e\n\u003cp\u003eThe house-elves crowded around Harry, Ron, and Hermione and began shunting them out of the kitchen, many little hands pushing in the smalls of their backs.\u003c/p\u003e\n\u003cp\u003e\"Thank you for the socks, Harry Potter!\" Dobby called miserably from the hearth, where he was standing next to the lumpy tablecloth that was Winky.\u003c/p\u003e\n\u003cp\u003e\"You couldn\u0027t keep your mouth shut, could you, Hermione?\" said Ron angrily as the kitchen door slammed shut behind them. \"They won\u0027t want us visiting them now! We could\u0027ve tried to get more stuff out of Winky about Crouch!\"\u003c/p\u003e\n\u003cp\u003e\"Oh as if you care about that!\" scoffed Hermione. \"You only like coming down here for the food!\"\u003c/p\u003e\n\u003cp\u003eIt was an irritable sort of day after that. Harry got so tired of Ron and Hermione sniping at each other over their homework in the common room that he took Sirius\u0027s food up to the Owlery that evening on his own.\u003c/p\u003e\n\u003cp\u003ePigwidgeon was much too small to carry an entire ham up to the mountain by himself, so Harry enlisted the help of two school screech owls as well. When they had set off into the dusk, looking extremely odd carrying the large package between them. Harry leaned on the windowsill, looking out at the grounds, at the dark, rustling treetops of the Forbidden Forest, and the rippling sails of the Durmstrang ship. An eagle owl flew through the coil of smoke rising from Hagrid\u0027s chimney; it soared toward the castle, around the Owlery, and out of sight. Looking down, Harry saw Hagrid digging energetically in front of his cabin. Harry wondered what he was doing; it looked as though he were making a new vegetable patch. As he watched, Madame Maxime emerged from the Beauxbatons carriage and walked over to Hagrid. She appeared to be trying to engage him in conversation. Hagrid leaned upon his spade, but did not seem keen to prolong their talk, because Madame Maxime returned to the carriage shortly afterward.\u003c/p\u003e\n\u003cp\u003eUnwilling to go back to Gryffindor Tower and listen to Ron and Hermione snarling at each other, Harry watched Hagrid digging until the darkness swallowed him and the owls around Harry began to awake, swooshing past him into the night.\u003c/p\u003e\n\u003cp\u003eBy breakfast the next day Ron\u0027s and Hermione\u0027s bad moods had burnt out, and to Harry\u0027s relief, Ron\u0027s dark predictions that the house-elves would send substandard food up to the Gryffindor table because Hermione had insulted them proved false; the bacon, eggs, and kippers were quite as good as usual.\u003c/p\u003e\n\u003cp\u003eWhen the post owls arrived, Hermione looked up eagerly; she seemed to be expecting something.\u003c/p\u003e\n\u003cp\u003e\"Percy won\u0027t\u0027ve had time to answer yet,\" said Ron. \"We only sent Hedwig yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not that,\" said Hermione. \"I\u0027ve taken out a subscription to the Daily Prophet. I\u0027m getting sick of finding everything out from the Slytherins.\"\u003c/p\u003e\n\u003cp\u003e\"Good thinking!\" said Harry, also looking up at the owls. \"Hey, Hermione, I think you\u0027re in luck -\"\u003c/p\u003e\n\u003cp\u003eA gray owl was soaring down toward Hermione.\u003c/p\u003e\n\u003cp\u003e\"It hasn\u0027t got a newspaper, though,\" she said, looking disappointed. \"It\u0027s -\"\u003c/p\u003e\n\u003cp\u003eBut to her bewilderment, the gray owl landed in front of her plate, closely followed by four barn owls, a brown owl, and a tawny.\u003c/p\u003e\n\u003cp\u003e\"How many subscriptions did you take out?\" said Harry, seizing Hermione\u0027s goblet before it was knocked over by the cluster of owls, all of whom were jostling close to her, trying to deliver their own letter first.\u003c/p\u003e\n\u003cp\u003e\"What on earth - ?\" Hermione said, taking the letter from the gray owl, opening it, and starting to read. \"Oh really!\" she sputtered, going rather red.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s up?\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s - oh how ridiculous -\"\u003c/p\u003e\n\u003cp\u003eShe thrust the letter at Harry, who saw that it was not handwritten, but composed from pasted letters that seemed to have been cut out of the Daily Prophet.\u003c/p\u003e\n\u003cp\u003eYOU ARE A WICKED GIRL. HARRY POTTER DESERVES\u003c/p\u003e\n\u003cp\u003eBETTER. GO BACK WHERE YOU CAME FROM MUGGLE.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all like it!\" said Hermione desperately, opening one letter after another. \"\u0027Harry Potter can do much better than the likes of you....\u0027 \u0027You deserve to be boiled in frog spawn....\u0027 Ouch!\"\u003c/p\u003e\n\u003cp\u003eShe had opened the last envelope, and yellowish-green liquid smelling strongly of petrol gushed over her hands, which began to erupt in large yellow boils.\u003c/p\u003e\n\u003cp\u003e\"Undiluted bubotuber pus!\" said Ron, picking up the envelope gingerly and sniffing it.\u003c/p\u003e\n\u003cp\u003e\"Ow!\" said Hermione, tears starting in her eyes as she tried to rub the pus off her hands with a napkin, but her fingers were now so thickly covered in painful sores that it looked as though she were wearing a pair of thick, knobbly gloves.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better get up to the hospital wing,\" said Harry as the owls around Hermione took flight. \"We\u0027ll tell Professor Sprout where you\u0027ve gone....\"\u003c/p\u003e\n\u003cp\u003e\"I warned her!\" said Ron as Hermione hurried out of the Great Hall, cradling her hands. \"I warned her not to annoy Rita Skeeter! Look at this one...\" He read out one of the letters Hermione had left behind: \"I read In Witch Weekly about how you are playing Harry Potter false and that boy has had enough hardship and I will be sending you a curse by next post as soon as I can find a big enough envelope.\u0027 Blimey, she\u0027d better watch out for herself.\"\u003c/p\u003e\n\u003cp\u003eHermione didn\u0027t turn up for Herbology. As Harry and Ron left the greenhouse for their Care of Magical Creatures class, they saw Malfoy, Crabbe, and Goyle descending the stone steps of the castle. Pansy Parkinson was whispering and giggling behind them with her gang of Slytherin girls. Catching sight of Harry, Pansy called, \"Potter, have you split up with your girlfriend? Why was she so upset at breakfast?\"\u003c/p\u003e\n\u003cp\u003eHarry ignored her; he didn\u0027t want to give her the satisfaction of knowing how much trouble the Witch Weekly article had caused.\u003c/p\u003e\n\u003cp\u003eHagrid, who had told them last lesson that they had finished with unicorns, was waiting for them outside his cabin with a fresh supply of open crates at his feet. Harry\u0027s heart sank at the sight of the crates - surely not another skrewt hatching? - but when he got near enough to see inside, he found himself looking at a number of flurry black creatures with long snouts. Their front paws were curiously flat, like spades, and they were blinking up at the class, looking politely puzzled at all the attention.\u003c/p\u003e\n\u003cp\u003e\"These\u0027re nifflers,\" said Hagrid, when the class had gathered around. \"Yeh find \u0027em down mines mostly. They like sparkly stuff....There yeh go, look.\"\u003c/p\u003e\n\u003cp\u003eOne of the nifflers had suddenly leapt up and attempted to bite Pansy Parkinson\u0027s watch off her wrist. She shrieked and jumped backward.\u003c/p\u003e\n\u003cp\u003e\"Useful little treasure detectors,\" said Hagrid happily. \"Thought we\u0027d have some fun with \u0027em today. See over there?\" He pointed at the large patch of freshly turned earth Harry had watched him digging from the Owlery window. \"I\u0027ve buried some gold coins. I\u0027ve got a prize fer whoever picks the niffler that digs up most. Jus\u0027 take off all yer valuables, an\u0027 choose a niffler, an get ready ter set \u0027em loose.\"\u003c/p\u003e\n\u003cp\u003eHarry took off his watch, which he was only wearing out of habit, as it didn\u0027t work anymore, and stuffed it into his pocket. Then he picked up a niffler. It put its long snout in Harry\u0027s ear and sniffed enthusiastically. It was really quite cuddly.\u003c/p\u003e\n\u003cp\u003e\"Hang on,\" said Hagrid, looking down into the crate, \"there\u0027s a spare niffler here...who\u0027s missin? Where\u0027s Hermione?\"\u003c/p\u003e\n\u003cp\u003e\"She had to go to the hospital wing,\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll explain later,\" Harry muttered; Pansy Parkinson was listening.\u003c/p\u003e\n\u003cp\u003eIt was easily the most fun they had ever had in Care of Magical Creatures. The nifflers dived in and out of the patch of earth as though it were water, each scurrying back to the student who had released it and spitting gold into their hands. Ron\u0027s was particularly efficient; it had soon filled his lap with coins.\u003c/p\u003e\n\u003cp\u003e\"Can you buy these as pets, Hagrid?\" he asked excitedly as his niffler dived back into the soil, splattering his robes.\u003c/p\u003e\n\u003cp\u003e\"Yer mum wouldn\u0027 be happy, Ron,\" said Hagrid, grinning. \"They wreck houses, nifflers. I reckon they\u0027ve nearly got the lot, now,\" he added, pacing around the patch of earth while the nifflers continued to dive. \"I on\u0027y buried a hundred coins. Oh there y\u0027are, Hermione!\"\u003c/p\u003e\n\u003cp\u003eHermione was walking toward them across the lawn. Her hands were very heavily bandaged and she looked miserable. Pansy Parkinson was watching her beadily.\u003c/p\u003e\n\u003cp\u003e\"Well, let\u0027s check how yeh\u0027ve done!\" said Hagrid. \"Count yer coins! An\u0027 there\u0027s no point tryin\u0027 ter steal any, Goyle,\" he added, his beetle-black eyes narrowed. \"It\u0027s leprechaun gold. Vanishes after a few hours.\"\u003c/p\u003e\n\u003cp\u003eGoyle emptied his pockets, looking extremely sulky. It turned out that Ron\u0027s niffler had been most successful, so Hagrid gave him an enormous slab of Honeyduke\u0027s chocolate for a prize. The bell rang across the grounds for lunch; the rest of the class set off back to the castle, but Harry, Ron, and Hermione stayed behind to help Hagrid put the nifflers back in their boxes. Harry noticed Madame Maxime watching them out other carriage window.\u003c/p\u003e\n\u003cp\u003e\"What yeh done ter your hands, Hermione?\" said Hagrid, looking concerned.\u003c/p\u003e\n\u003cp\u003eHermione told him about the hate mail she had received that morning, and the envelope full of bubotuber pus.\u003c/p\u003e\n\u003cp\u003e\"Aaah, don\u0027 worry,\" said Hagrid gently, looking down at her. \"I got some o\u0027 those letters an all, after Rita Skeeter wrote abou me mum. \u0027Yeh\u0027re a monster an yeh should be put down.\u0027 \u0027Yer mother killed innocent people an if you had any decency you d jump in a lake.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"No!\" said Hermione, looking shocked.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Hagrid, heaving the niffler crates over by his cabin wall. \"They\u0027re jus\u0027 nutters, Hermione. Don\u0027 open \u0027em if yeh get any more. Chuck \u0027em straigh\u0027 in the fire.\"\u003c/p\u003e\n\u003cp\u003e\"You missed a really good lesson,\" Harry told Hermione as they headed back toward the castle. \"They\u0027re good, nifflers, aren\u0027t they, Ron?\"\u003c/p\u003e\n\u003cp\u003eRon, however, was frowning at the chocolate Hagrid had given him. He looked thoroughly put out about something.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter?\" said Harry. \"Wrong flavor?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Ron shortly. \"Why didn\u0027t you tell me about the gold?\"\u003c/p\u003e\n\u003cp\u003e\"What gold?\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"The gold I gave you at the Quidditch World Cup,\" said Ron. \"The leprechaun gold I gave you for my Omnioculars. In the Top Box. Why didn\u0027t you tell me it disappeared?\"\u003c/p\u003e\n\u003cp\u003eHarry had to think for a moment before he realized what Ron was talking about.\u003c/p\u003e\n\u003cp\u003e\"Oh...\" he said, the memory coming back to him at last. \"I dunno...I never noticed it had gone. I was more worried about my wand, wasn\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eThey climbed the steps into the entrance hall and went into the Great Hall for lunch.\u003c/p\u003e\n\u003cp\u003e\"Must be nice,\" Ron said abruptly, when they had sat down and started serving themselves roast beef and Yorkshire puddings. \"To have so much money you don\u0027t notice if a pocketful of Galleons goes missing.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, I had other stuff on my mind that night!\" said Harry impatiently. \"We all did, remember?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know leprechaun gold vanishes,\" Ron muttered. \"I thought I was paying you back. You shouldn\u0027t\u0027ve given me that Chudley Cannon hat for Christmas.\"\u003c/p\u003e\n\u003cp\u003e\"Forget it, all right?\" said Harry.\u003c/p\u003e\n\u003cp\u003eRon speared a roast potato on the end of his fork, glaring at it. Then he said, \"I hate being poor.\"\u003c/p\u003e\n\u003cp\u003eHarry and Hermione looked at each other. Neither of them really knew what to say.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s rubbish,\" said Ron, still glaring down at his potato. \"I don\u0027t blame Fred and George for trying to make some extra money. Wish I could. Wish I had a niffler.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we know what to get you next Christmas,\" said Hermione brightly. Then, when Ron continued to look gloomy, she said, \"Come on, Ron, it could be worse. At least your fingers aren\u0027t full of pus.\" Hermione was having a lot of difficulty managing her knife and fork, her fingers were so stiff and swollen. \"I hate that Skeeter woman!\" she burst out savagely. \"I\u0027ll get her back for this if it\u0027s the last thing I do!\"\u003c/p\u003e\n\u003cp\u003eHate mail continued to arrive for Hermione over the following week, and although she followed Hagrid\u0027s advice and stopped opening it, several of her ill-wishers sent Howlers, which exploded at the Gryffindor table and shrieked insults at her for the whole Hall to hear. Even those people who didn\u0027t read Witch Weekly knew all about the supposed Harry-Krum-Hermione triangle now. Harry was getting sick of telling people that Hermione wasn\u0027t his girlfriend.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll die down, though,\" he told Hermione, \"if we just ignore it....People got bored with that stuff she wrote about me last time.\u003c/p\u003e\n\u003cp\u003e\"I want to know how she\u0027s listening into private conversations when she\u0027s supposed to be banned from the grounds!\" said Hermione angrily.\u003c/p\u003e\n\u003cp\u003eHermione hung back in their next Defense Against the Dark Arts lesson to ask Professor Moody something. The rest of the class was very eager to leave; Moody had given them such a rigorous test of hex-deflection that many of them were nursing small injuries. Harry had such a bad case of Twitchy Ears, he had to hold his hands clamped over them as he walked away from the class.\u003c/p\u003e\n\u003cp\u003e\"Well, Rita\u0027s definitely not using an Invisibility Cloak!\" Hermione panted five minutes later, catching up with Harry and Ron in the entrance hall and pulling Harry\u0027s hand away from one of his wiggling ears so that he could hear her. \"Moody says he didn\u0027t see her anywhere near the judges\u0027 table at the second task, or anywhere near the lake!\"\u003c/p\u003e\n\u003cp\u003e\"Hermione, is there any point in telling you to drop this?\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"No!\" said Hermione stubbornly. \"I want to know how she heard me talking to Viktor! And how she found out about Hagrid\u0027s mum!\"\u003c/p\u003e\n\u003cp\u003e\"Maybe she had you bugged,\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"Bugged?\" said Ron blankly. \"What...put fleas on her or something?\"\u003c/p\u003e\n\u003cp\u003eHarry started explaining about hidden microphones and recording equipment. Ron was fascinated, but Hermione interrupted them.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you two ever going to read Hogwarts, A History\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the point?\" said Ron. \"You know it by heart, we can just ask you.\"\u003c/p\u003e\n\u003cp\u003e\"All those substitutes for magic Muggles use - electricity, computers, and radar, and all those things - they all go haywire around Hogwarts, there\u0027s too much magic in the air. No, Rita\u0027s using magic to eavesdrop, she must be....If I could just find out what it is...ooh, if it\u0027s illegal, I\u0027ll have her...\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t we got enough to worry about?\" Ron asked her. \"Do we have to start a vendetta against Rita Skeeter as well?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not asking you to help!\" Hermione snapped. \"I\u0027ll do it on my own!\"\u003c/p\u003e\n\u003cp\u003eShe marched back up the marble staircase without a backward glance. Harry was quite sure she was going to the library.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the betting she comes back with a box of / Hate Rita Skeeter badges?\" said Ron.\u003c/p\u003e\n\u003cp\u003eHermione, however, did not ask Harry and Ron to help her pursue vengeance against Rita Skeeter, for which they were both grateful, because their workload was mounting ever higher in the days before the Easter holidays. Harry frankly marveled at the fact that Hermione could research magical methods of eavesdropping as well as everything else they had to do. He was working flat-out just to get through all their homework, though he made a point of sending regular food packages up to the cave in the mountain for Sirius; after last summer, Harry had not forgotten what it felt like to be continually hungry. He enclosed notes to Sirius, telling him that nothing out of the ordinary had happened, and that they were still waiting for an answer from Percy.\u003c/p\u003e\n\u003cp\u003eHedwig didn\u0027t return until the end of the Easter holidays. Percy\u0027s letter was enclosed in a package of Easter eggs that Mrs. Weasley had sent. Both Harry\u0027s and Ron\u0027s were the size of dragon eggs and full of homemade toffee. Hermione\u0027s, however, was smaller than a chicken egg. Her face fell when she saw it.\u003c/p\u003e\n\u003cp\u003e\"Your mum doesn\u0027t read Witch Weekly, by any chance, does she, Ron?\" she asked quietly.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Ron, whose mouth was full of toffee. \"Gets it for the recipes.\"\u003c/p\u003e\n\u003cp\u003eHermione looked sadly at her tiny egg.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you want to see what Percy\u0027s written?\" Harry asked her hastily.\u003c/p\u003e\n\u003cp\u003ePercy\u0027s letter was short and irritated.\u003c/p\u003e\n\u003cp\u003eAs I am constantly telling the Daily Prophet, Mr. Crouch is taking a well-deserved break. He is sending in regular owls with instructions. No, I haven\u0027t actually seen him, but I think I can be trusted to know my own superior\u0027s handwriting. I have quite enough to do at the moment without trying to quash these ridiculous rumors. Please don\u0027t bother me again unless it\u0027s something important. Happy Easter.\u003c/p\u003e\n\u003cp\u003eThe start of the summer term would normally have meant that Harry was training hard for the last Quidditch match of the season. This year, however, it was the third and final task in the Triwizard Tournament for which he needed to prepare, but he still didn\u0027t know what he would have to do. Finally, in the last week of May, Professor McGonagall held him back in Transfiguration.\u003c/p\u003e\n\u003cp\u003e\"You are to go down to the Quidditch field tonight at nine o\u0027clock. Potter,\" she told him. \"Mr. Bagman will be there to tell the champions about the third task.\"\u003c/p\u003e\n\u003cp\u003eSo at half past eight that night. Harry left Ron and Hermione in Gryffindor Tower and went downstairs. As he crossed the entrance hall, Cedric came up from the Hufflepuff common room.\u003c/p\u003e\n\u003cp\u003e\"What d\u0027you reckon it\u0027s going to be?\" he asked Harry as they went together down the stone steps, out into the cloudy night. \"Fleur keeps going on about underground tunnels; she reckons we\u0027ve got to find treasure.\"\u003c/p\u003e\n\u003cp\u003e\"That wouldn\u0027t be too bad,\" said Harry, thinking that he would simply ask Hagrid for a niffler to do the job for him.\u003c/p\u003e\n\u003cp\u003eThey walked down the dark lawn to the Quidditch stadium, turned through a gap in the stands, and walked out onto the field.\u003c/p\u003e\n\u003cp\u003e\"What\u0027ve they done to it?\" Cedric said indignantly, stopping dead.\u003c/p\u003e\n\u003cp\u003eThe Quidditch field was no longer smooth and flat. It looked as though somebody had been building long, low walls all over it that twisted and crisscrossed in every direction.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re hedges!\" said Harry, bending to examine the nearest one.\u003c/p\u003e\n\u003cp\u003e\"Hello there!\" called a cheery voice.\u003c/p\u003e\n\u003cp\u003eLudo Bagman was standing in the middle of the field with Krum and Fleur. Harry and Cedric made their way toward them, climbing over the hedges. Fleur beamed at Harry as he came nearer. Her attitude toward him had changed completely since he had saved her sister from the lake.\u003c/p\u003e\n\u003cp\u003e\"Well, what d\u0027you think?\" said Bagman happily as Harry and Cedric climbed over the last hedge. \"Growing nicely, aren\u0027t they? Give them a month and Hagrid\u0027ll have them twenty feet high. Don\u0027t worry,\" he added, grinning, spotting the less-than-happy expressions on Harry\u0027s and Cedric\u0027s faces, \"you\u0027ll have your Quidditch field back to normal once the task is over! Now, I imagine you can guess what we\u0027re making here?\"\u003c/p\u003e\n\u003cp\u003eNo one spoke for a moment. Then -\u003c/p\u003e\n\u003cp\u003e\"Maze,\" grunted Krum.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right!\" said Bagman. \"A maze. The third task\u0027s really very straightforward. The Triwizard Cup will be placed in the center of the maze. The first champion to touch it will receive full marks.\"\u003c/p\u003e\n\u003cp\u003e\"We seemply \u0027ave to get through the maze?\" said Fleur.\u003c/p\u003e\n\u003cp\u003e\"There will be obstacles,\" said Bagman happily, bouncing on the balls of his feet. \"Hagrid is providing a number of creatures...then there will be spells that must be broken...all that sort of thing, you know. Now, the champions who are leading on points will get a head start into the maze.\" Bagman grinned at Harry and Cedric. \"Then Mr. Krum will enter...then Miss Delacour. But you\u0027ll all be in with a fighting chance, depending how well you get past the obstacles. Should be fun, eh?\"\u003c/p\u003e\n\u003cp\u003eHarry, who knew only too well the kind of creatures that Hagrid was likely to provide for an event like this, thought it was unlikely to be any fun at all. However, he nodded politely like the other champions.\u003c/p\u003e\n\u003cp\u003e\"Very well...if you haven\u0027t got any questions, we\u0027ll go back up to the castle, shall we, it\u0027s a bit chilly....\"\u003c/p\u003e\n\u003cp\u003eBagman hurried alongside Harry as they began to wend their way out of the growing maze. Harry had the feeling that Bagman was going to start offering to help him again, but just then, Krum tapped Harry on the shoulder.\u003c/p\u003e\n\u003cp\u003e\"Could I haff a vord?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, all right,\" said Harry, slightly surprised.\u003c/p\u003e\n\u003cp\u003e\"Vill you valk vith me?\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" said Harry curiously.\u003c/p\u003e\n\u003cp\u003eBagman looked slightly perturbed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll wait for you. Harry, shall I?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s okay, Mr. Bagman,\" said Harry, suppressing a smile, \"I think I can find the castle on my own, thanks.\"\u003c/p\u003e\n\u003cp\u003eHarry and Krum left the stadium together, but Krum did not set a course for the Durmstrang ship. Instead, he walked toward the forest.\u003c/p\u003e\n\u003cp\u003e\"What\u0027re we going this way for?\" said Harry as they passed Hagrid\u0027s cabin and the illuminated Beauxbatons carriage.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t vont to be overheard,\" said Krum shortly.\u003c/p\u003e\n\u003cp\u003eWhen at last they had reached a quiet stretch of ground a short way from the Beauxbatons horses\u0027 paddock, Krum stopped in the shade of the trees and turned to face Harry.\u003c/p\u003e\n\u003cp\u003e\"I vant to know,\" he said, glowering, \"vot there is between you and Hermy-own-ninny.\"\u003c/p\u003e\n\u003cp\u003eHarry, who from Krum\u0027s secretive manner had expected something much more serious than this, stared up at Krum in amazement.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" he said. But Krum glowered at him, and Harry, somehow struck anew by how tall Krum was, elaborated. \"We\u0027re friends. She\u0027s not my girlfriend and she never has been. It\u0027s just that Skeeter woman making things up.\"\u003c/p\u003e\n\u003cp\u003e\"Hermy-own-ninny talks about you very often,\" said Krum, looking suspiciously at Harry.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Harry, \"because were friends.\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t quite believe he was having this conversation with Viktor Krum, the famous International Quidditch player. It was as though the eighteen-year-old Krum thought he. Harry, was an equal - a real rival -\u003c/p\u003e\n\u003cp\u003e\"You haff never...you haff not...\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Harry very firmly.\u003c/p\u003e\n\u003cp\u003eKrum looked slightly happier. He stared at Harry for a few seconds, then said, \"You fly very veil. I vos votching at the first task.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" said Harry, grinning broadly and suddenly feeling much taller himself. \"I saw you at the Quidditch World Cup. The Wronski Feint, you really -\"\u003c/p\u003e\n\u003cp\u003eBut something moved behind Krum in the trees, and Harry, who had some experience of the sort of thing that lurked in the forest, instinctively grabbed Krum\u0027s arm and pulled him around.\u003c/p\u003e\n\u003cp\u003e\"Vot is it?\"\u003c/p\u003e\n\u003cp\u003eHarry shook his head, staring at the place where he\u0027d seen movement. He slipped his hand inside his robes, reaching for his wand.\u003c/p\u003e\n\u003cp\u003eSuddenly a man staggered out from behind a tall oak. For a moment, Harry didn\u0027t recognize him...then he realized it was Mr. Crouch.\u003c/p\u003e\n\u003cp\u003eHe looked as though he had been traveling for days. The knees of his robes were ripped and bloody, his face scratched; he was unshaven and gray with exhaustion. His neat hair and mustache were both in need of a wash and a trim. His strange appearance, however, was nothing to the way he was behaving. Muttering and gesticulating, Mr. Crouch appeared to be talking to someone that he alone could see. He reminded Harry vividly of an old tramp he had seen once when out shopping with the Dursleys. That man too had been conversing wildly with thin air; Aunt Petunia had seized Dudley\u0027s hand and pulled him across the road to avoid him; Uncle Vernon had then treated the family to a long rant about what he would like to do with beggars and vagrants.\u003c/p\u003e\n\u003cp\u003e\"Vosn\u0027t he a judge?\" said Krum, staring at Mr. Crouch. \"Isn\u0027t he vith your Ministry?\"\u003c/p\u003e\n\u003cp\u003eHarry nodded, hesitated for a moment, then walked slowly toward Mr. Crouch, who did not look at him, but continued to talk to a nearby tree.\u003c/p\u003e\n\u003cp\u003e\"...and when you\u0027ve done that, Weatherby, send an owl to Dumbledore confirming the number of Durmstrang students who will be attending the tournament, Karkaroff has just sent word there will be twelve....\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Crouch?\" said Harry cautiously.\u003c/p\u003e\n\u003cp\u003e\"...and then send another owl to Madame Maxime, because she might want to up the number of students she\u0027s bringing, now Karkaroff\u0027s made it a round dozen...do that, Weatherby, will you? Will you? Will...\"\u003c/p\u003e\n\u003cp\u003eMr. Crouch\u0027s eyes were bulging. He stood staring at the tree, muttering soundlessly at it. Then he staggered sideways and fell to his knees.\u003c/p\u003e\n\u003cp\u003e\"Mr. Crouch?\" Harry said loudly. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eCrouch\u0027s eyes were rolling in his head. Harry looked around at Krum, who had followed him into the trees, and was looking down at Crouch in alarm.\u003c/p\u003e\n\u003cp\u003e\"Vot is wrong with him?\"\u003c/p\u003e\n\u003cp\u003e\"No idea,\" Harry muttered. \"Listen, you\u0027d better go and get someone -\"\u003c/p\u003e\n\u003cp\u003e\"Dumbledore!\" gasped Mr. Crouch. He reached out and seized a handful of Harry\u0027s robes, dragging him closer, though his eyes were staring over Harry\u0027s head. \"I need...see...Dumbledore....\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" said Harry, \"if you get up, Mr. Crouch, we can go up to the-\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve done...stupid...thing...\" Mr. Crouch breathed. He looked utterly mad. His eyes were rolling and bulging, and a trickle of spittle was sliding down his chin. Every word he spoke seemed to cost him a terrible effort. \"Must...tell...Dumbledore...\"\u003c/p\u003e\n\u003cp\u003e\"Get up, Mr. Crouch,\" said Harry loudly and clearly. \"Get up, I\u0027ll take you to Dumbledore!\"\u003c/p\u003e\n\u003cp\u003eMr., Crouch\u0027s eyes rolled forward onto Harry.\u003c/p\u003e\n\u003cp\u003e\"Who...you?\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a student at the school,\" said Harry, looking around at Krum for some help, but Krum was hanging back, looking extremely nervous.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not...his?\" whispered Crouch, his mouth sagging.\u003c/p\u003e\n\u003cp\u003e\"No,\" said Harry, without the faintest idea what Crouch was talking about.\u003c/p\u003e\n\u003cp\u003e\"Dumbledore\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right,\" said Harry.\u003c/p\u003e\n\u003cp\u003eCrouch was pulling him closer; Harry tried to loosen Crouch\u0027s grip on his robes, but it was too powerful.\u003c/p\u003e\n\u003cp\u003e\"Warn...Dumbledore...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get Dumbledore if you let go of me,\" said Harry. \"Just let go, Mr. Crouch, and I\u0027ll get him....\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Weatherby, and when you have done that, I would like a cup of tea. My wife and son will be arriving shortly, we are attending a concert tonight with Mr. and Mrs. Fudge.\"\u003c/p\u003e\n\u003cp\u003eCrouch was now talking fluently to a tree again, and seemed completely unaware that Harry was there, which surprised Harry so much he didn\u0027t notice that Crouch had released him.\u003c/p\u003e\n\u003cp\u003e\"Yes, my son has recently gained twelve O.W.L.s, most satisfactory, yes, thank you, yes, very proud indeed. Now, if you could bring me that memo from the Andorran Minister of Magic, I think I will have time to draft a response....\"\u003c/p\u003e\n\u003cp\u003e\"You stay here with him!\" Harry said to Krum. \"I\u0027ll get Dumbledore, I\u0027ll be quicker, I know where his office is -\"\u003c/p\u003e\n\u003cp\u003e\"He is mad,\" said Krum doubtfully, staring down at Crouch, who was still gabbling to the tree, apparently convinced it was Percy.\u003c/p\u003e\n\u003cp\u003e\"Just stay with him,\" said Harry, starting to get up, but his movement seemed to trigger another abrupt change in Mr. Crouch, who seized him hard around the knees and pulled Harry back to the ground.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t...leave...me!\" he whispered, his eyes bulging again. \"I...escaped...must warn...must tell...see Dumbledore...my fault...all my fault...Bertha...dead...all my fault...my son...my fault...tell Dumbledore ...Harry Potter...the Dark Lord...stronger...Harry Potter...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get Dumbledore if you let me go, Mr. Crouch!\" said Harry. He looked furiously around at Krum. \"Help me, will you?\"\u003c/p\u003e\n\u003cp\u003eLooking extremely apprehensive, Krum moved forward and squatted down next to Mr. Crouch.\u003c/p\u003e\n\u003cp\u003e\"Just keep him here,\" said Harry, pulling himself free of Mr. Crouch. \"I\u0027ll be back with Dumbledore.\"\u003c/p\u003e\n\u003cp\u003e\"Hurry, von\u0027t you?\" Krum called after him as Harry sprinted away from the forest and up through the dark grounds. They were deserted; Bagman, Cedric, and Fleur had disappeared. Harry tore up the stone steps, through the oak front doors, and off up the marble staircase, toward the second floor.\u003c/p\u003e\n\u003cp\u003eFive minutes later he was hurtling toward a stone gargoyle standing halfway along an empty corridor.\u003c/p\u003e\n\u003cp\u003e\"Sher - sherbet lemon!\" he panted at it.\u003c/p\u003e\n\u003cp\u003eThis was the password to the hidden staircase to Dumbledore\u0027s office - or at least, it had been two years ago. The password had evidently changed, however, for the stone gargoyle did not spring to life and jump aside, but stood frozen, glaring at Harry malevolently.\u003c/p\u003e\n\u003cp\u003e\"Move!\" Harry shouted at it. \"C\u0027mon!\"\u003c/p\u003e\n\u003cp\u003eBut nothing at Hogwarts had ever moved just because he shouted at it; he knew it was no good. He looked up and down the dark corridor. Perhaps Dumbledore was in the staffroom? He started running as fast as he could toward the staircase -\u003c/p\u003e\n\u003cp\u003e\"POTTER!\"\u003c/p\u003e\n\u003cp\u003eHarry skidded to a halt and looked around. Snape had just emerged from the hidden staircase behind the stone gargoyle. The wall was sliding shut behind him even as he beckoned Harry back toward him.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here, Potter?\"\u003c/p\u003e\n\u003cp\u003e\"I need to see Professor Dumbledore!\" said Harry, running back up the corridor and skidding to a standstill in front of Snape instead. \"It\u0027s Mr. Crouch...he\u0027s just turned up...he\u0027s in the forest...he\u0027s asking -\"\u003c/p\u003e\n\u003cp\u003e\"What is this rubbish?\" said Snape, his black eyes glittering. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Crouch!\" Harry shouted. \"From the Ministry! He\u0027s ill or something - he\u0027s in the forest, he wants to see Dumbledore! Just give me the password up to -\"\u003c/p\u003e\n\u003cp\u003e\"The headmaster is busy. Potter,\" said Snape, his thin mouth curling into an unpleasant smile.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got to tell Dumbledore!\" Harry yelled.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you hear me. Potter?\"\u003c/p\u003e\n\u003cp\u003eHarry could tell Snape was thoroughly enjoying himself, denying Harry the thing he wanted when he was so panicky.\u003c/p\u003e\n\u003cp\u003e\"Look,\" said Harry angrily, \"Crouch isn\u0027t right - he\u0027s - he\u0027s out of his mind - he says he wants to warn -\"\u003c/p\u003e\n\u003cp\u003eThe stone wall behind Snape slid open. Dumbledore was standing there, wearing long green robes and a mildly curious expression. \"Is there a problem?\" he said, looking between Harry and Snape.\u003c/p\u003e\n\u003cp\u003e\"Professor!\" Harry said, sidestepping Snape before Snape could speak, \"Mr. Crouch is here - he\u0027s down in the forest, he wants to speak to you!\"\u003c/p\u003e\n\u003cp\u003eHarry expected Dumbledore to ask questions, but to his relief, Dumbledore did nothing of the sort.\u003c/p\u003e\n\u003cp\u003e\"Lead the way,\" he said promptly, and he swept off along the corridor behind Harry, leaving Snape standing next to the gargoyle and looking twice as ugly.\u003c/p\u003e\n\u003cp\u003e\"What did Mr. Crouch say. Harry?\" said Dumbledore as they walked swiftly down the marble staircase.\u003c/p\u003e\n\u003cp\u003e\"Said he wants to warn you...said he\u0027s done something terrible...he mentioned his son...and Bertha Jorkins...and - and Voldemort...something about Voldemort getting stronger....\"\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" said Dumbledore, and he quickened his pace as they hurried out into the pitch-darkness.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not acting normally,\" Harry said, hurrying along beside Dumbledore. \"He doesn\u0027t seem to know where he is. He keeps talking like he thinks Percy Weasley\u0027s there, and then he changes, and says he needs to see you....I left him with Viktor Krum.\"\u003c/p\u003e\n\u003cp\u003e\"You did?\" said Dumbledore sharply, and he began to take longer strides still, so that Harry was running to keep up. \"Do you know if anybody else saw Mr. Crouch?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Harry. \"Krum and I were talking, Mr. Bagman had just finished telling us about the third task, we stayed behind, and then we saw Mr. Crouch coming out of the forest -\"\u003c/p\u003e\n\u003cp\u003e\"Where are they?\" said Dumbledore as the Beauxbatons carriage emerged from the darkness.\u003c/p\u003e\n\u003cp\u003e\"Over here,\" said Harry, moving in front of Dumbledore, leading the way through the trees. He couldn\u0027t hear Crouch\u0027s voice anymore, but he knew where he was going; it hadn\u0027t been much past the Beauxbatons carriage...somewhere around here....\u003c/p\u003e\n\u003cp\u003e\"Viktor?\" Harry shouted.\u003c/p\u003e\n\u003cp\u003eNo one answered.\u003c/p\u003e\n\u003cp\u003e\"They were here,\" Harry said to Dumbledore. \"They were definitely somewhere around here....\"\u003c/p\u003e\n\u003cp\u003e\"Lumos,\" Dumbledore said, lighting his wand and holding it up.\u003c/p\u003e\n\u003cp\u003eIts narrow beam traveled from black trunk to black trunk, illuminating the ground. And then it fell upon a pair of feet.\u003c/p\u003e\n\u003cp\u003eHarry and Dumbledore hurried forward. Krum was sprawled on the forest floor. He seemed to be unconscious. There was no sign at all of Mr. Crouch. Dumbledore bent over Krum and gently lifted one of his eyelids.\u003c/p\u003e\n\u003cp\u003e\"Stunned,\" he said softly. His half-moon glasses glittered in the wandlight as he peered around at the surrounding trees.\u003c/p\u003e\n\u003cp\u003e\"Should I go and get someone?\" said Harry. \"Madam Pomfrey?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Dumbledore swiftly. \"Stay here.\"\u003c/p\u003e\n\u003cp\u003eHe raised his wand into the air and pointed it in the direction of Hagrid\u0027s cabin. Harry saw something silvery dart out of it and streak away through the trees like a ghostly bird. Then Dumbledore bent over Krum again, pointed his wand at him, and muttered, \"Ennervate.\"\u003c/p\u003e\n\u003cp\u003eKrum opened his eyes. He looked dazed. When he saw Dumbledore, he tried to sit up, but Dumbledore put a hand on his shoulder and made him lie still.\u003c/p\u003e\n\u003cp\u003e\"He attacked me!\" Krum muttered, putting a hand up to his head. \"The old madman attacked me! I vos looking around to see vare Potter had gone and he attacked from behind!\"\u003c/p\u003e\n\u003cp\u003e\"Lie still for a moment,\" Dumbledore said.\u003c/p\u003e\n\u003cp\u003eThe sound of thunderous footfalls reached them, and Hagrid came panting into sight with Fang at his heels. He was carrying his crossbow.\u003c/p\u003e\n\u003cp\u003e\"Professor Dumbledore!\" he said, his eyes widening. \"Harry - what the -?\"\u003c/p\u003e\n\u003cp\u003e\"Hagrid, I need you to fetch Professor Karkaroff,\" said Dumbledore. \"His student has been attacked. When you\u0027ve done that, kindly alert Professor Moody -\"\u003c/p\u003e\n\u003cp\u003e\"No need, Dumbledore,\" said a wheezy growl. \"I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003eMoody was limping toward them, leaning on his staff, his wand lit.\u003c/p\u003e\n\u003cp\u003e\"Damn leg,\" he said furiously. \"Would\u0027ve been here quicker...what\u0027s happened? Snape said something about Crouch -\"\u003c/p\u003e\n\u003cp\u003e\"Crouch?\" said Hagrid blankly.\u003c/p\u003e\n\u003cp\u003e\"Karkaroff, please, Hagrid!\" said Dumbledore sharply.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah...right y\u0027are, Professor...\" said Hagrid, and he turned and disappeared into the dark trees, Fang trotting after him.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where Barty Crouch is,\" Dumbledore told Moody, \"but it is essential that we find him.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m onto it,\" growled Moody, and he pulled out his wand and limped off into the forest.\u003c/p\u003e\n\u003cp\u003eNeither Dumbledore nor Harry spoke again until they heard the unmistakable sounds of Hagrid and Fang returning. Karkaroff was hurrying along behind them. He was wearing his sleek silver furs, and he looked pale and agitated.\u003c/p\u003e\n\u003cp\u003e\"What is this?\" he cried when he saw Krum on the ground and Dumbledore and Harry beside him. \"What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"I vos attacked!\" said Krum, sitting up now and rubbing his head. \"Mr. Crouch or votever his name -\"\u003c/p\u003e\n\u003cp\u003e\"Crouch attacked you? Crouch attacked you? The Triwizard judge?\"\u003c/p\u003e\n\u003cp\u003e\"Igor,\" Dumbledore began, but Karkaroff had drawn himself up, clutching his furs around him, looking livid.\u003c/p\u003e\n\u003cp\u003e\"Treachery!\" he bellowed, pointing at Dumbledore. \"It is a plot! You and your Ministry of Magic have lured me here under false pretenses, Dumbledore! This is not an equal competition! First you sneak Potter into the tournament, though he is underage! Now one of your Ministry friends attempts to put my champion out of action! I smell double-dealing and corruption in this whole affair, and you, Dumbledore, you, with your talk of closer international wizarding links, of rebuilding old ties, of forgetting old differences - here\u0027s what I think of you!\"\u003c/p\u003e\n\u003cp\u003eKarkaroff spat onto the ground at Dumbledore\u0027s feet. In one swift movement, Hagrid seized the front of Karkaroff\u0027s furs, lifted him into the air, and slammed him against a nearby tree.\u003c/p\u003e\n\u003cp\u003e\"Apologize!\" Hagrid snarled as Karkaroff gasped for breath, Hagrid\u0027s massive fist at his throat, his feet dangling in midair.\u003c/p\u003e\n\u003cp\u003e\"Hagrid, no!\" Dumbledore shouted, his eyes flashing.\u003c/p\u003e\n\u003cp\u003eHagrid removed the hand pinning Karkaroff to the tree, and Karkaroff slid all the way down the trunk and slumped in a huddle at its roots; a few twigs and leaves showered down upon his head.\u003c/p\u003e\n\u003cp\u003e\"Kindly escort Harry back up to the castle, Hagrid,\" said Dumbledore sharply.\u003c/p\u003e\n\u003cp\u003eBreathing heavily, Hagrid gave Karkaroff a glowering look.\u003c/p\u003e\n\u003cp\u003e\"Maybe I\u0027d better stay here. Headmaster....\"\u003c/p\u003e\n\u003cp\u003e\"You will take Harry back to school, Hagrid,\" Dumbledore repeated firmly. \"Take him right up to Gryffindor Tower. And Harry - I want you to stay there. Anything you might want to do - any owls you might want to send - they can wait until morning, do you understand me?\"\u003c/p\u003e\n\u003cp\u003e\"Er - yes,\" said Harry, staring at him. How had Dumbledore known that, at that very moment, he had been thinking about sending Pigwidgeon straight to Sirius, to tell him what had happened?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll leave Fang with yeh. Headmaster,\" Hagrid said, staring menacingly at Karkaroff, who was still sprawled at the foot of the tree, tangled in furs and tree roots. \"Stay, Fang. C\u0027mon, Harry.\"\u003c/p\u003e\n\u003cp\u003eThey marched in silence past the Beauxbatons carriage and up toward the castle.\u003c/p\u003e\n\u003cp\u003e\"How dare he,\" Hagrid growled as they strode past the lake. \"How dare he accuse Dumbledore. Like Dumbledore\u0027d do anythin\u0027 like that. Like Dumbledore wanted you in the tournament in the firs\u0027 place. Worried! I dunno when I seen Dumbledore more worried than he\u0027s bin lately. An\u0027 you!\" Hagrid suddenly said angrily to Harry, who looked up at him, taken aback. \"What were yeh doin\u0027, wanderin\u0027 off with ruddy Krum? He\u0027s from Durmstrang, Harry! Coulda jinxed yeh right there, couldn he? Hasn\u0027 Moody taught yeh nothin\u0027? \u0027Magine lettin him lure yeh off on yer own -\"\u003c/p\u003e\n\u003cp\u003e\"Krum\u0027s all right!\" said Harry as they climbed the steps into the entrance hall. \"He wasn\u0027t trying to jinx me, he just wanted to talk about Hermione -\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be havin\u0027 a few words with her, an\u0027 all,\" said Hagrid grimly, stomping up the stairs. \"The less you lot \u0027ave ter do with these foreigners, the happier yeh\u0027ll be. Yeh can trust any of \u0027em.\"\u003c/p\u003e\n\u003cp\u003e\"You were getting on all right with Madame Maxime,\" Harry said, annoyed.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027 you talk ter me abou\u0027 her!\" said Hagrid, and he looked quite frightening for a moment. \"I\u0027ve got her number now! Tryin\u0027 ter get back in me good books, tryin\u0027 ter get me ter tell her what\u0027s comin in the third task. Ha! You can\u0027 trust any of\u0027em!\"\u003c/p\u003e\n\u003cp\u003eHagrid was in such a bad mood, Harry was quite glad to say good-bye to him in front of the Fat Lady. He clambered through the portrait hole into the common room and hurried straight for the corner where Ron and Hermione were sitting, to tell them what had happened. \u003c/p\u003e","sourceLink":"https://allnovel.net/harry-potter-and-the-goblet-of-fire-harry-potter-4/page-28.html","bookId":1565,"creation":"Oct 5, 2019 11:41:13 PM","modification":"Oct 5, 2019 11:41:13 PM"}
