{"id":107652,"no":17,"title":"Page 17","content":"\u003cp\u003e17. THE GAME\u003c/p\u003e\n\u003cp\u003eIt was just beginning to drizzle when Edward turned onto my street. Up until that moment, I\u0027d had no doubt that he\u0027d be staying with me while I spent a few interim hours in the real world.\u003c/p\u003e\n\u003cp\u003eAnd then I saw the black car, a weathered Ford, parked in Charlie\u0027s driveway - and heard Edward mutter something unintelligible in a low, harsh voice.\u003c/p\u003e\n\u003cp\u003eLeaning away from the rain under the shallow front porch, Jacob Black stood behind his father\u0027s wheelchair. Billy\u0027s face was impassive as stone as Edward parked my truck against the curb. Jacob stared down, his expression mortified.\u003c/p\u003e\n\u003cp\u003eEdward\u0027s low voice was furious. \"This is crossing the line.\"\u003c/p\u003e\n\u003cp\u003e\"He came to warn Charlie?\" I guessed, more horrified than angry.\u003c/p\u003e\n\u003cp\u003eEdward just nodded, answering Billy\u0027s gaze through the rain with narrowed eyes.\u003c/p\u003e\n\u003cp\u003eI felt weak with relief that Charlie wasn\u0027t home yet.\u003c/p\u003e\n\u003cp\u003e\"Let me deal with this,\" I suggested. Edward\u0027s black glare made me anxious.\u003c/p\u003e\n\u003cp\u003eTo my surprise, he agreed. \"That\u0027s probably best. Be careful, though. The child has no idea.\"\u003c/p\u003e\n\u003cp\u003eI bridled a little at the word child. \"Jacob is not that much younger than I am,\" I reminded him.\u003c/p\u003e\n\u003cp\u003eHe looked at me then, his anger abruptly fading. \"Oh, I know,\" he assured me with a grin.\u003c/p\u003e\n\u003cp\u003eI sighed and put my hand on the door handle.\u003c/p\u003e\n\u003cp\u003e\"Get them inside,\" he instructed, \"so I can leave. I\u0027ll be back around dusk.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want my truck?\" I offered, meanwhile wondering how I would explain its absence to Charlie.\u003c/p\u003e\n\u003cp\u003eHe rolled his eyes. \"I could walk home faster than this truck moves.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to leave,\" I said wistfully.\u003c/p\u003e\n\u003cp\u003eHe smiled at my glum expression. \"Actually, I do. After you get rid of them\" - he threw a dark glance in the Blacks\u0027 direction - \"you still have to prepare Charlie to meet your new boyfriend.\" He grinned widely, showing all of his teeth.\u003c/p\u003e\n\u003cp\u003eI groaned. \"Thanks a lot.\"\u003c/p\u003e\n\u003cp\u003eHe smiled the crooked smile that I loved. \"I\u0027ll be back soon,\" he promised. His eyes flickered back to the porch, and then he leaned in to swiftly kiss me just under the edge of my jaw. My heart lurched frantically, and I, too, glanced toward the porch. Billy\u0027s face was no longer impassive, and his hands clutched at the armrests of his chair.\u003c/p\u003e\n\u003cp\u003e\"Soon,\" I stressed as I opened the door and stepped out into the rain.\u003c/p\u003e\n\u003cp\u003eI could feel his eyes on my back as I half-ran through the light sprinkle\u003c/p\u003e\n\u003cp\u003etoward the porch.\u003c/p\u003e\n\u003cp\u003e\"Hey, Billy. Hi, Jacob.\" I greeted them as cheerfully as I could manage. \"Charlie\u0027s gone for the day - I hope you haven\u0027t been waiting long.\"\u003c/p\u003e\n\u003cp\u003e\"Not long,\" Billy said in a subdued tone. His black eyes were piercing. \"I just wanted to bring this up.\" He indicated a brown paper sack resting in his lap.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I said, though I had no idea what it could be. \"Why don\u0027t you come in for a minute and dry off?\"\u003c/p\u003e\n\u003cp\u003eI pretended to be oblivious to his intense scrutiny as I unlocked the door, and waved them in ahead of me.\u003c/p\u003e\n\u003cp\u003e\"Here, let me take that,\" I offered, turning to shut the door. I allowed myself one last glance at Edward. He was waiting, perfectly still, his eyes solemn.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll want to put it in the fridge,\" Billy noted as he handed me the package. \"It\u0027s some of Harry Clearwater\u0027s homemade fish fry - Charlie\u0027s favorite. The fridge keeps it drier.\" He shrugged.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I repeated, but with feeling this time. \"I was running out of new ways to fix fish, and he\u0027s bound to bring home more tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Fishing again?\" Billy asked with a subtle gleam in his eye. \"Down at the usual spot? Maybe I\u0027ll run by and see him.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I quickly lied, my face going hard. \"He was headed someplace new... but I have no idea where.\"\u003c/p\u003e\n\u003cp\u003eHe took in my changed expression, and it made him thoughtful.\u003c/p\u003e\n\u003cp\u003e\"Jake,\" he said, still appraising me. \"Why don\u0027t you go get that new picture of Rebecca out of the car? I\u0027ll leave that for Charlie, too.\"\u003c/p\u003e\n\u003cp\u003e\"Where is it?\" Jacob asked, his voice morose. I glanced at him, but he was staring at the floor, his eyebrows pulling together.\u003c/p\u003e\n\u003cp\u003e\"I think I saw it in the trunk,\" Billy said. \"You may have to dig for it.\"\u003c/p\u003e\n\u003cp\u003eJacob slouched back out into the rain.\u003c/p\u003e\n\u003cp\u003eBilly and I faced each other in silence. After a few seconds, the quiet started to feel awkward, so I turned and headed to the kitchen. I could hear his wet wheels squeak against the linoleum as he followed.\u003c/p\u003e\n\u003cp\u003eI shoved the bag onto the crowded top shelf of the fridge, and spun around to confront him. His deeply lined face was unreadable.\u003c/p\u003e\n\u003cp\u003e\"Charlie won\u0027t be back for a long time.\" My voice was almost rude.\u003c/p\u003e\n\u003cp\u003eHe nodded in agreement, but said nothing.\u003c/p\u003e\n\u003cp\u003e\"Thanks again for the fish fry,\" I hinted.\u003c/p\u003e\n\u003cp\u003eHe continued nodding. I sighed and folded my arms across my chest.\u003c/p\u003e\n\u003cp\u003eHe seemed to sense that I had given up on small talk. \"Bella,\" he said, and then he hesitated.\u003c/p\u003e\n\u003cp\u003eI waited.\u003c/p\u003e\n\u003cp\u003e\"Bella,\" he said again, \"Charlie is one of my best friends.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe spoke each word carefully in his rumbling voice. \"I noticed you\u0027ve been spending time with one of the Cullens.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I repeated curtly.\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed. \"Maybe it\u0027s none of my business, but I don\u0027t think that is such a good idea.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" I agreed. \"It is none of your business.\"\u003c/p\u003e\n\u003cp\u003eHe raised his graying eyebrows at my tone. \"You probably don\u0027t know this, but the Cullen family has an unpleasant reputation on the reservation.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I did know that,\" I informed him in a hard voice. This surprised him. \"But that reputation couldn\u0027t be deserved, could it? Because the Cullens never set foot on the reservation, do they?\" I could see that my less than subtle reminder of the agreement that both bound and protected his tribe pulled him up short.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s true,\" he acceded, his eyes guarded. \"You seem... well informed about the Cullens. More informed than I expected.\"\u003c/p\u003e\n\u003cp\u003eI stared him down. \"Maybe even better informed than you are.\"\u003c/p\u003e\n\u003cp\u003eHe pursed his thick lips as he considered that. \"Maybe.\" he allowed, but his eyes were shrewd. \"Is Charlie as well informed?\"\u003c/p\u003e\n\u003cp\u003eHe had found the weak chink in my armor.\u003c/p\u003e\n\u003cp\u003e\"Charlie likes the Cullens a lot,\" I hedged. He clearly understood my evasion. His expression was unhappy, but unsurprised.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not my business,\" he said. \"But it may be Charlie\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"Though it would be my business, again, whether or not I think that it\u0027s Charlie\u0027s business, right?\"\u003c/p\u003e\n\u003cp\u003eI wondered if he even understood my confused question as I struggled not to say anything compromising. But he seemed to. He thought about it while the rain picked up against the roof, the only sound breaking the silence.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he finally surrendered. \"I guess that\u0027s your business, too.\"\u003c/p\u003e\n\u003cp\u003eI sighed with relief. \"Thanks, Billy.\"\u003c/p\u003e\n\u003cp\u003e\"Just think about what you\u0027re doing, Bella,\" he urged.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I agreed quickly.\u003c/p\u003e\n\u003cp\u003eHe frowned. \"What I meant to say was, don\u0027t do what you\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003eI looked into his eyes, filled with nothing but concern for me, and there was nothing I could say.\u003c/p\u003e\n\u003cp\u003eJust then the front door banged loudly, and I jumped at the sound.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no picture anywhere in that car.\" Jacob\u0027s complaining voice reached us before he did. The shoulders of his shirt were stained with the rain, his hair dripping, when he rounded the corner.\u003c/p\u003e\n\u003cp\u003e\"Hmm,\" Billy grunted, suddenly detached, spinning his chair around to face his son. \"I guess I left it at home.\"\u003c/p\u003e\n\u003cp\u003eJacob rolled his eyes dramatically. \"Great.\"\u003c/p\u003e\n\u003cp\u003e\"Well, Bella, tell Charlie\" - Billy paused before continuing - \"that we stopped by, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"I will,\" I muttered.\u003c/p\u003e\n\u003cp\u003eJacob was surprised. \"Are we leaving already?\"\u003c/p\u003e\n\u003cp\u003e\"Charlie\u0027s gonna be out late,\" Billy explained as he rolled himself past Jacob.\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Jacob looked disappointed. \"Well, I guess I\u0027ll see you later, then,\u003c/p\u003e\n\u003cp\u003eBella.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I agreed.\u003c/p\u003e\n\u003cp\u003e\"Take care,\" Billy warned me. I didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eJacob helped his father out the door. I waved briefly, glancing swiftly toward my now-empty truck, and then shut the door before they were gone.\u003c/p\u003e\n\u003cp\u003eI stood in the hallway for a minute, listening to the sound of their car as it backed out and drove away. I stayed where I was, waiting for the irritation and anxiety to subside. When the tension eventually faded a bit, I headed upstairs to change out of my dressy clothes.\u003c/p\u003e\n\u003cp\u003eI tried on a couple of different tops, not sure what to expect tonight. As I concentrated on what was coming, what had just passed became insignificant. Now that I was removed from Jasper\u0027s and Edward\u0027s influence, I began to make up for not being terrified before. I gave up quickly on choosing an outfit - throwing on an old flannel shirt and jeans - knowing I would be in my raincoat all night anyway.\u003c/p\u003e\n\u003cp\u003eThe phone rang and I sprinted downstairs to get it. There was only one voice I wanted to hear; anything else would be a disappointment. But I knew that if he wanted to talk to me, he\u0027d probably just materialize in my room.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" I asked, breathless.\u003c/p\u003e\n\u003cp\u003e\"Bella? It\u0027s me,\" Jessica said.\u003c/p\u003e\n\u003cp\u003e\"Oh, hey, Jess.\" I scrambled for a moment to come back down to reality. It felt like months rather than days since I\u0027d spoken to Jess. \"How was the dance?\"\u003c/p\u003e\n\u003cp\u003e\"It was so much fun!\" Jessica gushed. Needing no more invitation than that, she launched into a minute-by-minute account of the previous night. I mmm\u0027d and ahh\u0027d at the right places, but it wasn\u0027t easy to concentrate. Jessica, Mike, the dance, the school - they all seemed strangely irrelevant at the moment. My eyes kept flashing to the window, trying to judge the degree of light behind the heavy clouds.\u003c/p\u003e\n\u003cp\u003e\"Did you hear what I said, Bella?\" Jess asked, irritated.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, what?\"\u003c/p\u003e\n\u003cp\u003e\"I said, Mike kissed me! Can you believe it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s wonderful, Jess,\" I said.\u003c/p\u003e\n\u003cp\u003e\"So what did you do yesterday?\" Jessica challenged, still sounding bothered by my lack of attention. Or maybe she was upset because I hadn\u0027t asked for details.\u003c/p\u003e\n\u003cp\u003e\"Nothing, really. I just hung around outside to enjoy the sun.\"\u003c/p\u003e\n\u003cp\u003eI heard Charlie\u0027s car in the garage.\u003c/p\u003e\n\u003cp\u003e\"Did you ever hear anything more from Edward Cullen?\"\u003c/p\u003e\n\u003cp\u003eThe front door slammed and I could hear Charlie banging around under the stairs, putting his tackle away.\u003c/p\u003e\n\u003cp\u003e\"Um.\" I hesitated, not sure what my story was anymore.\u003c/p\u003e\n\u003cp\u003e\"Hi there, kiddo!\" Charlie called as he walked into the kitchen. I waved at him.\u003c/p\u003e\n\u003cp\u003eJess heard his voice. \"Oh, your dad\u0027s there. Never mind - we\u0027ll talk tomorrow. See you in Trig.\"\u003c/p\u003e\n\u003cp\u003e\"See ya, Jess.\" I hung up the phone.\u003c/p\u003e\n\u003cp\u003e\"Hey, Dad,\" I said. He was scrubbing his hands in the sink. \"Where\u0027s the fish?\"\u003c/p\u003e\n\u003cp\u003e\"I put it out in the freezer.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go grab a few pieces before they freeze - Billy dropped off some of Harry Clearwater\u0027s fish fry this afternoon.\" I worked to sound enthusiastic.\u003c/p\u003e\n\u003cp\u003e\"He did?\" Charlie\u0027s eyes lit up. \"That\u0027s my favorite.\"\u003c/p\u003e\n\u003cp\u003eCharlie cleaned up while I got dinner ready. It didn\u0027t take long till we were sitting at the table, eating in silence. Charlie was enjoying his food. I was wondering desperately how to fulfill my assignment, struggling to think of a way to broach the subject.\u003c/p\u003e\n\u003cp\u003e\"What did you do with yourself today?\" he asked, snapping me out of my reverie.\u003c/p\u003e\n\u003cp\u003e\"Well, this afternoon I just hung out around the house...\" Only the very recent part of this afternoon, actually. I tried to keep my voice upbeat, but my stomach was hollow. \"And this morning I was over at the Cullens\u0027.\"\u003c/p\u003e\n\u003cp\u003eCharlie dropped his fork.\u003c/p\u003e\n\u003cp\u003e\"Dr. Cullen\u0027s place?\" he asked in astonishment.\u003c/p\u003e\n\u003cp\u003eI pretended not to notice his reaction. \"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"What were you doing there?\" He hadn\u0027t picked his fork back up.\u003c/p\u003e\n\u003cp\u003e\"Well, I sort of have a date with Edward Cullen tonight, and he wanted to introduce me to his parents... Dad?\"\u003c/p\u003e\n\u003cp\u003eIt appeared that Charlie was having an aneurysm.\u003c/p\u003e\n\u003cp\u003e\"Dad, are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"You are going out with Edward Cullen?\" he thundered.\u003c/p\u003e\n\u003cp\u003eUh-oh. \"I thought you liked the Cullens.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s too old for you,\" he ranted.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re both juniors,\" I corrected, though he was more right than he dreamed.\u003c/p\u003e\n\u003cp\u003e\"Wait...\" He paused. \"Which one is Edwin?\"\u003c/p\u003e\n\u003cp\u003e\"Edward is the youngest, the one with the reddish brown hair.\" The beautiful one, the godlike one...\u003c/p\u003e\n\u003cp\u003e\"Oh, well, that\u0027s\" - he struggled - \"better, I guess. I don\u0027t like the look of that big one. I\u0027m sure he\u0027s a nice boy and all, but he looks too... mature for you. Is this Edwin your boyfriend?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Edward, Dad.\"\u003c/p\u003e\n\u003cp\u003e\"Is he?\"\u003c/p\u003e\n\u003cp\u003e\"Sort of, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"You said last night that you weren\u0027t interested in any of the boys in town.\" But he picked up his fork again, so I could see the worst was over.\u003c/p\u003e\n\u003cp\u003e\"Well, Edward doesn\u0027t live in town, Dad.\"\u003c/p\u003e\n\u003cp\u003eHe gave me a disparaging look as he chewed.\u003c/p\u003e\n\u003cp\u003e\"And, anyways,\" I continued, \"it\u0027s kind of at an early stage, you know. Don\u0027t embarrass me with all the boyfriend talk, okay?\"\u003c/p\u003e\n\u003cp\u003e\"When is he coming over?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be here in a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Where is he taking you?\"\u003c/p\u003e\n\u003cp\u003eI groaned loudly. \"I hope you\u0027re getting the Spanish Inquisition out of your system now. We\u0027re going to play baseball with his family.\"\u003c/p\u003e\n\u003cp\u003eHis face puckered, and then he finally chuckled. \"You\u0027re playing baseball?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027ll probably watch most of the time.\"\u003c/p\u003e\n\u003cp\u003e\"You must really like this guy,\" he observed suspiciously.\u003c/p\u003e\n\u003cp\u003eI sighed and rolled my eyes for his benefit.\u003c/p\u003e\n\u003cp\u003eI heard the roar of an engine pull up in front of the house. I jumped up and started cleaning my dishes.\u003c/p\u003e\n\u003cp\u003e\"Leave the dishes, I can do them tonight. You baby me too much.\"\u003c/p\u003e\n\u003cp\u003eThe doorbell rang, and Charlie stalked off to answer it. I was half a step behind him.\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t realized how hard it was pouring outside. Edward stood in the halo of the porch light, looking like a male model in an advertisement for raincoats.\u003c/p\u003e\n\u003cp\u003e\"Come on in, Edward.\"\u003c/p\u003e\n\u003cp\u003eI breathed a sigh of relief when Charlie got his name right.\u003c/p\u003e\n\u003cp\u003e\"Thanks, Chief Swan,\" Edward said in a respectful voice.\u003c/p\u003e\n\u003cp\u003e\"Go ahead and call me Charlie. Here, I\u0027ll take your jacket.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Have a seat there, Edward.\"\u003c/p\u003e\n\u003cp\u003eI grimaced.\u003c/p\u003e\n\u003cp\u003eEdward sat down fluidly in the only chair, forcing me to sit next to Chief Swan on the sofa. I quickly shot him a dirty look. He winked behind Charlie\u0027s back.\u003c/p\u003e\n\u003cp\u003e\"So I hear you\u0027re getting my girl to watch baseball.\" Only in Washington would the fact that it was raining buckets have no bearing at all on the playing of outdoor sports.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir, that\u0027s the plan.\" He didn\u0027t look surprised that I\u0027d told my father the truth. He might have been listening, though.\u003c/p\u003e\n\u003cp\u003e\"Well, more power to you, I guess.\"\u003c/p\u003e\n\u003cp\u003eCharlie laughed, and Edward joined in.\u003c/p\u003e\n\u003cp\u003e\"Okay.\" I stood up. \"Enough humor at my expense. Let\u0027s go.\" I walked back to the hall and pulled on my jacket. They followed.\u003c/p\u003e\n\u003cp\u003e\"Not too late, Bell.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, Charlie, I\u0027ll have her home early,\" Edward promised.\u003c/p\u003e\n\u003cp\u003e\"You take care of my girl, all right?\"\u003c/p\u003e\n\u003cp\u003eI groaned, but they ignored me.\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be safe with me, I promise, sir.\"\u003c/p\u003e\n\u003cp\u003eCharlie couldn\u0027t doubt Edward\u0027s sincerity, it rang in every word.\u003c/p\u003e\n\u003cp\u003eI stalked out. They both laughed, and Edward followed me.\u003c/p\u003e\n\u003cp\u003eI stopped dead on the porch. There, behind my truck, was a monster Jeep. Its tires were higher than my waist. There were metal guards over the headlights and tail-lights, and four large spotlights attached to the crash bar. The hardtop was shiny red.\u003c/p\u003e\n\u003cp\u003eCharlie let out a low whistle.\u003c/p\u003e\n\u003cp\u003e\"Wear your seat belts,\" he choked out.\u003c/p\u003e\n\u003cp\u003eEdward followed me around to my side and opened the door. I gauged the distance to the seat and prepared to jump for it. He sighed, and then lifted me in with one hand. I hoped Charlie didn\u0027t notice.\u003c/p\u003e\n\u003cp\u003eAs he went around to the driver\u0027s side, at a normal, human pace, I tried to put on my seat belt. But there were too many buckles.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s all this?\" I asked when he opened the door.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an off-roading harness.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-oh.\"\u003c/p\u003e\n\u003cp\u003eI tried to find the right places for all the buckles to fit, but it wasn\u0027t going too quickly. He sighed again and reached over to help me. I was glad that the rain was too heavy to see Charlie clearly on the porch. That meant he couldn\u0027t see how Edward\u0027s hands lingered at my neck, brushed along my collarbones. I gave up trying to help him and focused on not hyperventilating.\u003c/p\u003e\n\u003cp\u003eEdward turned the key and the engine roared to life. We pulled away from the house.\u003c/p\u003e\n\u003cp\u003e\"This is a... um... big Jeep you have.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Emmett\u0027s. I didn\u0027t think you\u0027d want to run the whole way.\"\u003c/p\u003e\n\u003cp\u003e\"Where do you keep this thing?\"\u003c/p\u003e\n\u003cp\u003e\"We remodeled one of the outbuildings into a garage.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you going to put on your seat belt?\"\u003c/p\u003e\n\u003cp\u003eHe threw me a disbelieving look.\u003c/p\u003e\n\u003cp\u003eThen something sunk in.\u003c/p\u003e\n\u003cp\u003e\"Run the whole way? As in, we\u0027re still going to run part of the way?\" My voice edged up a few octaves.\u003c/p\u003e\n\u003cp\u003eHe grinned tightly. \"You\u0027re not going to run.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to be sick.\"\u003c/p\u003e\n\u003cp\u003e\"Keep your eyes closed, you\u0027ll be fine.\"\u003c/p\u003e\n\u003cp\u003eI bit my lip, fighting the panic.\u003c/p\u003e\n\u003cp\u003eHe leaned over to kiss the top of my head, and then groaned. I looked at him, puzzled.\u003c/p\u003e\n\u003cp\u003e\"You smell so good in the rain,\" he explained.\u003c/p\u003e\n\u003cp\u003e\"In a good way, or in a bad way?\" I asked cautiously.\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Both, always both.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t know how he found his way in the gloom and downpour, but he somehow found a side road that was less of a road and more of a mountain\u003c/p\u003e\n\u003cp\u003epath. For a long while conversation was impossible, because I was bouncing up and down on the seat like a jackhammer. He seemed to enjoy the ride, though, smiling hugely the whole way.\u003c/p\u003e\n\u003cp\u003eAnd then we came to the end of the road; the trees formed green walls on three sides of the Jeep. The rain was a mere drizzle, slowing every second, the sky brighter through the clouds.\u003c/p\u003e\n\u003cp\u003e\"Sorry, Bella, we have to go on foot from here.\"\u003c/p\u003e\n\u003cp\u003e\"You know what? I\u0027ll just wait here.\"\u003c/p\u003e\n\u003cp\u003e\"What happened to all your courage? You were extraordinary this morning.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t forgotten the last time yet.\" Could it have been only yesterday?\u003c/p\u003e\n\u003cp\u003eHe was around to my side of the car in a blur. He started unbuckling me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get those, you go on ahead,\" I protested.\u003c/p\u003e\n\u003cp\u003e\"Hmmm...\" he mused as he quickly finished. \"It seems I\u0027m going to have to tamper with your memory.\"\u003c/p\u003e\n\u003cp\u003eBefore I could react, he pulled me from the Jeep and set my feet on the ground. It was barely misting now; Alice was going to be right.\u003c/p\u003e\n\u003cp\u003e\"Tamper with my memory?\" I asked nervously.\u003c/p\u003e\n\u003cp\u003e\"Something like that.\" He was watching me intently, carefully, but there was humor deep in his eyes. He placed his hands against the Jeep on either side of my head and leaned forward, forcing me to press back against the door. He leaned in even closer, his face inches from mine. I had no room to escape.\u003c/p\u003e\n\u003cp\u003e\"Now,\" he breathed, and just his smell disturbed my thought processes, \"what exactly are you worrying about?\"\u003c/p\u003e\n\u003cp\u003e\"Well, um, hitting a tree -\" I gulped \"- and dying. And then getting sick.\"\u003c/p\u003e\n\u003cp\u003eHe fought back a smile. Then he bent his head down and touched his cold lips softly to the hollow at the base of my throat.\u003c/p\u003e\n\u003cp\u003e\"Are you still worried now?\" he murmured against my skin.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I struggled to concentrate. \"About hitting trees and getting sick.\"\u003c/p\u003e\n\u003cp\u003eHis nose drew a line up the skin of my throat to the point of my chin. His cold breath tickled my skin.\u003c/p\u003e\n\u003cp\u003e\"And now?\" His lips whispered against my jaw.\u003c/p\u003e\n\u003cp\u003e\"Trees,\" I gasped. \"Motion sickness.\"\u003c/p\u003e\n\u003cp\u003eHe lifted his face to kiss my eyelids. \"Bella, you don\u0027t really think I would hit a tree, do you?\"\u003c/p\u003e\n\u003cp\u003e\"No, but I might.\" There was no confidence in my voice. He smelled an easy victory.\u003c/p\u003e\n\u003cp\u003eHe kissed slowly down my cheek, stopping just at the corner of my mouth.\u003c/p\u003e\n\u003cp\u003e\"Would I let a tree hurt you?\" His lips barely brushed against my trembling lower lip.\u003c/p\u003e\n\u003cp\u003e\"No,\" I breathed. I knew there was a second part to my brilliant defense, but I couldn\u0027t quite call it back.\u003c/p\u003e\n\u003cp\u003e\"You see,\" he said, his lips moving against mine. \"There\u0027s nothing to be afraid of, is there?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I sighed, giving up.\u003c/p\u003e\n\u003cp\u003eThen he took my face in his hands almost roughly, and kissed me in earnest, his unyielding lips moving against mine.\u003c/p\u003e\n\u003cp\u003eThere really was no excuse for my behavior. Obviously I knew better by now. And yet I couldn\u0027t seem to stop from reacting exactly as I had the first time. Instead of keeping safely motionless, my arms reached up to twine tightly around his neck, and I was suddenly welded to his stone figure. I sighed, and my lips parted.\u003c/p\u003e\n\u003cp\u003eHe staggered back, breaking my grip effortlessly.\u003c/p\u003e\n\u003cp\u003e\"Damn it, Bella!\" he broke off, gasping. \"You\u0027ll be the death of me, I swear you will.\"\u003c/p\u003e\n\u003cp\u003eI leaned over, bracing my hands against my knees for support.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re indestructible,\" I mumbled, trying to catch my breath.\u003c/p\u003e\n\u003cp\u003e\"I might have believed that before I met you. Now let\u0027s get out of here before I do something really stupid,\" he growled.\u003c/p\u003e\n\u003cp\u003eHe threw me across his back as he had before, and I could see the extra effort it took for him to be as gentle as he was. I locked my legs around his waist and secured my arms in a choke hold around his neck.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t forget to close your eyes,\" he warned severely.\u003c/p\u003e\n\u003cp\u003eI quickly tucked my face into his shoulder blade, under my own arm, and squeezed my eyes shut.\u003c/p\u003e\n\u003cp\u003eAnd I could hardly tell we were moving. I could feel him gliding along beneath me, but he could have been strolling down the sidewalk, the movement was so smooth. I was tempted to peek, just to see if he was really flying through the forest like before, but I resisted. It wasn\u0027t worth that awful dizziness. I contented myself with listening to his breath come and go evenly.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t quite sure we had stopped until he reached back and touched my hair.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s over, Bella.\"\u003c/p\u003e\n\u003cp\u003eI dared to open my eyes, and, sure enough, we were at a standstill. I stiffly unlocked my stranglehold on his body and slipped to the ground, landing on my backside.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" I huffed as I hit the wet ground.\u003c/p\u003e\n\u003cp\u003eHe stared at me incredulously, evidently not sure whether he was still too mad to find me funny. But my bewildered expression pushed him over the edge, and he broke into a roar of laughter.\u003c/p\u003e\n\u003cp\u003eI picked myself up, ignoring him as I brushed the mud and bracken off the back of my jacket. That only made him laugh harder. Annoyed, I began to stride off into the forest.\u003c/p\u003e\n\u003cp\u003eI felt his arm around my waist.\u003c/p\u003e\n\u003cp\u003e\"Where are you going, Bella?\"\u003c/p\u003e\n\u003cp\u003e\"To watch a baseball game. You don\u0027t seem to be interested in playing anymore, but I\u0027m sure the others will have fun without you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going the wrong way.\"\u003c/p\u003e\n\u003cp\u003eI turned around without looking at him, and stalked off in the opposite direction. He caught me again.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be mad, I couldn\u0027t help myself. You should have seen your face.\" He chuckled before he could stop himself.\u003c/p\u003e\n\u003cp\u003e\"Oh, you\u0027re the only one who\u0027s allowed to get mad?\" I asked, raising my eyebrows.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t mad at you.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Bella, you\u0027ll be the death of me\u0027?\" I quoted sourly.\u003c/p\u003e\n\u003cp\u003e\"That was simply a statement of fact.\"\u003c/p\u003e\n\u003cp\u003eI tried to turn away from him again, but he held me fast.\u003c/p\u003e\n\u003cp\u003e\"You were mad,\" I insisted.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But you just said -\"\u003c/p\u003e\n\u003cp\u003e\"That I wasn\u0027t mad at you. Can\u0027t you see that, Bella?\" He was suddenly intense, all trace of teasing gone. \"Don\u0027t you understand?\"\u003c/p\u003e\n\u003cp\u003e\"See what?\" I demanded, confused by his sudden mood swing as much as his words.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m never angry with you - how could I be? Brave, trusting... warm as you are.\"\u003c/p\u003e\n\u003cp\u003e\"Then why?\" I whispered, remembering the black moods that pulled him away from me, that I\u0027d always interpreted as well-justified frustration - frustration at my weakness, my slowness, my unruly human reactions...\u003c/p\u003e\n\u003cp\u003eHe put his hands carefully on both sides of my face. \"I infuriate myself,\" he said gently. \"The way I can\u0027t seem to keep from putting you in danger. My very existence puts you at risk. Sometimes I truly hate myself. I should be stronger, I should be able to -\"\u003c/p\u003e\n\u003cp\u003eI placed my hand over his mouth. \"Don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe took my hand, moving it from his lips, but holding it to his face.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" he said. \"It\u0027s a poor excuse for what I\u0027m doing, but it\u0027s still true.\"\u003c/p\u003e\n\u003cp\u003eIt was the first time he\u0027d said he loved me - in so many words. He might not realize it, but I certainly did.\u003c/p\u003e\n\u003cp\u003e\"Now, please try to behave yourself,\" he continued, and he bent to softly brush his lips against mine.\u003c/p\u003e\n\u003cp\u003eI held properly still. Then I sighed.\u003c/p\u003e\n\u003cp\u003e\"You promised Chief Swan that you would have me home early, remember? We\u0027d better get going.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eHe smiled wistfully and released all of me but one hand. He led me a few feet through the tall, wet ferns and draping moss, around a massive hemlock tree, and we were there, on the edge of an enormous open field in the lap of the Olympic peaks. It was twice the size of any baseball stadium.\u003c/p\u003e\n\u003cp\u003eI could see the others all there; Esme, Emmett, and Rosalie, sitting on a bare outcropping of rock, were the closest to us, maybe a hundred yards away. Much farther out I could see Jasper and Alice, at least a quarter of a mile apart, appearing to throw something back and forth, but I never saw any ball. It looked like Carlisle was marking bases, but could they really be that far apart?\u003c/p\u003e\n\u003cp\u003eWhen we came into view, the three on the rocks rose.\u003c/p\u003e\n\u003cp\u003eEsme started toward us. Emmett followed after a long look at Rosalie\u0027s\u003c/p\u003e\n\u003cp\u003eback; Rosalie had risen gracefully and strode off toward the field without a glance in our direction. My stomach quivered uneasily in response.\u003c/p\u003e\n\u003cp\u003e\"Was that you we heard, Edward?\" Esme asked as she approached.\u003c/p\u003e\n\u003cp\u003e\"It sounded like a bear choking,\" Emmett clarified.\u003c/p\u003e\n\u003cp\u003eI smiled hesitantly at Esme. \"That was him.\"\u003c/p\u003e\n\u003cp\u003e\"Bella was being unintentionally funny,\" Edward explained, quickly settling the score.\u003c/p\u003e\n\u003cp\u003eAlice had left her position and was running, or dancing, toward us. She hurtled to a fluid stop at our feet. \"It\u0027s time,\" she announced.\u003c/p\u003e\n\u003cp\u003eAs soon as she spoke, a deep rumble of thunder shook the forest beyond us, and then crashed westward toward town.\u003c/p\u003e\n\u003cp\u003e\"Eerie, isn\u0027t it?\" Emmett said with easy familiarity, winking at me.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go.\" Alice reached for Emmett\u0027s hand and they darted toward the oversized field; she ran like a gazelle. He was nearly as graceful and just as fast - yet Emmett could never be compared to a gazelle.\u003c/p\u003e\n\u003cp\u003e\"Are you ready for some ball?\" Edward asked, his eyes eager, bright.\u003c/p\u003e\n\u003cp\u003eI tried to sound appropriately enthusiastic. \"Go team!\"\u003c/p\u003e\n\u003cp\u003eHe snickered and, after mussing my hair, bounded off after the other two. His run was more aggressive, a cheetah rather than a gazelle, and he quickly overtook them. The grace and power took my breath away.\u003c/p\u003e\n\u003cp\u003e\"Shall we go down?\" Esme asked in her soft, melodic voice, and I realized I was staring openmouthed after him. I quickly reassembled my expression and nodded. Esme kept a few feet between us, and I wondered if she was still being careful not to frighten me. She matched her stride to mine without seeming impatient at the pace.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t play with them?\" I asked shyly.\u003c/p\u003e\n\u003cp\u003e\"No, I prefer to referee - I like keeping them honest,\" she explained.\u003c/p\u003e\n\u003cp\u003e\"Do they like to cheat, then?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes - you should hear the arguments they get into! Actually, I hope you don\u0027t, you would think they were raised by a pack of wolves.\"\u003c/p\u003e\n\u003cp\u003e\"You sound like my mom,\" I laughed, surprised.\u003c/p\u003e\n\u003cp\u003eShe laughed, too. \"Well, I do think of them as my children in most ways. I never could get over my mothering instincts - did Edward tell you I had lost a child?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I murmured, stunned, scrambling to understand what lifetime she was remembering.\u003c/p\u003e\n\u003cp\u003e\"Yes, my first and only baby. He died just a few days after he was born, the poor tiny thing,\" she sighed. \"It broke my heart - that\u0027s why I jumped off the cliff, you know,\" she added matter-of-factly.\u003c/p\u003e\n\u003cp\u003e\"Edward just said you f-fell,\" I stammered.\u003c/p\u003e\n\u003cp\u003e\"Always the gentleman.\" She smiled. \"Edward was the first of my new sons. I\u0027ve always thought of him that way, even though he\u0027s older than I, in one way at least.\" She smiled at me warmly. \"That\u0027s why I\u0027m so happy that he\u0027s found you, dear.\" The endearment sounded very natural on her lips. \"He\u0027s been the odd man out for far too long; it\u0027s hurt me to see him alone.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t mind, then?\" I asked, hesitant again. \"That I\u0027m... all wrong for him?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She was thoughtful. \"You\u0027re what he wants. It will work out, somehow,\" she said, though her forehead creased with worry. Another peal of thunder began.\u003c/p\u003e\n\u003cp\u003eEsme stopped then; apparently, we\u0027d reached the edge of the field. It looked as if they had formed teams. Edward was far out in left field, Carlisle stood between the first and second bases, and Alice held the ball, positioned on the spot that must be the pitcher\u0027s mound.\u003c/p\u003e\n\u003cp\u003eEmmett was swinging an aluminum bat; it whistled almost untraceably through the air. I waited for him to approach home plate, but then I realized, as he took his stance, that he was already there - farther from the pitcher\u0027s mound than I would have thought possible. Jasper stood several feet behind him, catching for the other team. Of course, none of them had gloves.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Esme called in a clear voice, which I knew even Edward would hear, as far out as he was. \"Batter up.\"\u003c/p\u003e\n\u003cp\u003eAlice stood straight, deceptively motionless. Her style seemed to be stealth rather than an intimidating windup. She held the ball in both hands at her waist, and then, like the strike of a cobra, her right hand flicked out and the ball smacked into Jasper\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"Was that a strike?\" I whispered to Esme.\u003c/p\u003e\n\u003cp\u003e\"If they don\u0027t hit it, it\u0027s a strike,\" she told me.\u003c/p\u003e\n\u003cp\u003eJasper hurled the ball back to Alice\u0027s waiting hand. She permitted herself a brief grin. And then her hand spun out again.\u003c/p\u003e\n\u003cp\u003eThis time the bat somehow made it around in time to smash into the invisible ball. The crack of impact was shattering, thunderous; it echoed off the mountains - I immediately understood the necessity of the thunderstorm.\u003c/p\u003e\n\u003cp\u003eThe ball shot like a meteor above the field, flying deep into the surrounding forest.\u003c/p\u003e\n\u003cp\u003e\"Home run,\" I murmured.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" Esme cautioned, listening intently, one hand raised. Emmett was a blur around the bases, Carlisle shadowing him. I realized Edward was missing.\u003c/p\u003e\n\u003cp\u003e\"Out!\" Esme cried in a clear voice. I stared in disbelief as Edward sprang from the fringe of the trees, ball in his upraised hand, his wide grin visible even to me.\u003c/p\u003e\n\u003cp\u003e\"Emmett hits the hardest,\" Esme explained, \"but Edward runs the fastest.\"\u003c/p\u003e\n\u003cp\u003eThe inning continued before my incredulous eyes. It was impossible to keep up with the speed at which the ball flew, the rate at which their bodies raced around the field.\u003c/p\u003e\n\u003cp\u003eI learned the other reason they waited for a thunderstorm to play when Jasper, trying to avoid Edward\u0027s infallible fielding, hit a ground ball toward Carlisle. Carlisle ran into the ball, and then raced Jasper to first base. When they collided, the sound was like the crash of two massive falling boulders. I jumped up in concern, but they were somehow unscathed.\u003c/p\u003e\n\u003cp\u003e\"Safe,\" Esme called in a calm voice.\u003c/p\u003e\n\u003cp\u003eEmmett\u0027s team was up by one - Rosalie managed to flit around the bases after tagging up on one of Emmett\u0027s long flies - when Edward caught the third out. He sprinted to my side, sparkling with excitement.\u003c/p\u003e\n\u003cp\u003e\"What do you think?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"One thing\u0027s for sure, I\u0027ll never be able to sit through dull old Major\u003c/p\u003e\n\u003cp\u003eLeague Baseball again.\"\u003c/p\u003e\n\u003cp\u003e\"And it sounds like you did so much of that before,\" he laughed.\u003c/p\u003e\n\u003cp\u003e\"I am a little disappointed,\" I teased.\u003c/p\u003e\n\u003cp\u003e\"Why?\" he asked, puzzled.\u003c/p\u003e\n\u003cp\u003e\"Well, it would be nice if I could find just one thing you didn\u0027t do better than everyone else on the planet.\"\u003c/p\u003e\n\u003cp\u003eHe flashed his special crooked smile, leaving me breathless.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m up,\" he said, heading for the plate.\u003c/p\u003e\n\u003cp\u003eHe played intelligently, keeping the ball low, out of the reach of Rosalie\u0027s always-ready hand in the outfield, gaining two bases like lightning before Emmett could get the ball back in play. Carlisle knocked one so far out of the field - with a boom that hurt my ears - that he and Edward both made it in. Alice slapped them dainty high fives.\u003c/p\u003e\n\u003cp\u003eThe score constantly changed as the game continued, and they razzed each other like any street ballplayers as they took turns with the lead. Occasionally Esme would call them to order. The thunder rumbled on, but we stayed dry, as Alice had predicted.\u003c/p\u003e\n\u003cp\u003eCarlisle was up to bat, Edward catching, when Alice suddenly gasped. My eyes were on Edward, as usual, and I saw his head snap up to look at her. Their eyes met and something flowed between them in an instant. He was at my side before the others could ask Alice what was wrong.\u003c/p\u003e\n\u003cp\u003e\"Alice?\" Esme\u0027s voice was tense.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t see - I couldn\u0027t tell,\" she whispered.\u003c/p\u003e\n\u003cp\u003eAll the others were gathered by this time.\u003c/p\u003e\n\u003cp\u003e\"What is it, Alice?\" Carlisle asked with the calm voice of authority.\u003c/p\u003e\n\u003cp\u003e\"They were traveling much quicker than I thought. I can see I had the perspective wrong before,\" she murmured.\u003c/p\u003e\n\u003cp\u003eJasper leaned over her, his posture protective. \"What changed?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"They heard us playing, and it changed their path,\" she said, contrite, as if she felt responsible for whatever had frightened her.\u003c/p\u003e\n\u003cp\u003eSeven pairs of quick eyes flashed to my face and away.\u003c/p\u003e\n\u003cp\u003e\"How soon?\" Carlisle said, turning toward Edward.\u003c/p\u003e\n\u003cp\u003eA look of intense concentration crossed his face.\u003c/p\u003e\n\u003cp\u003e\"Less than five minutes. They\u0027re running - they want to play.\" He scowled.\u003c/p\u003e\n\u003cp\u003e\"Can you make it?\" Carlisle asked him, his eyes flicking toward me again.\u003c/p\u003e\n\u003cp\u003e\"No, not carrying -\" He cut short. \"Besides, the last thing we need is for them to catch the scent and start hunting.\"\u003c/p\u003e\n\u003cp\u003e\"How many?\" Emmett asked Alice.\u003c/p\u003e\n\u003cp\u003e\"Three,\" she answered tersely.\u003c/p\u003e\n\u003cp\u003e\"Three!\" he scoffed. \"Let them come.\" The steel bands of muscle flexed along his massive arms.\u003c/p\u003e\n\u003cp\u003eFor a split second that seemed much longer than it really was, Carlisle deliberated. Only Emmett seemed unperturbed; the rest stared at Carlisle\u0027s face with anxious eyes.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just continue the game,\" Carlisle finally decided. His voice was\u003c/p\u003e\n\u003cp\u003ecool and level. \"Alice said they were simply curious.\"\u003c/p\u003e\n\u003cp\u003eAll this was said in a flurry of words that lasted only a few seconds. I had listened carefully and caught most of it, though I couldn\u0027t hear what Esme now asked Edward with a silent vibration of her lips. I only saw the slight shake of his head and the look of relief on her face.\u003c/p\u003e\n\u003cp\u003e\"You catch, Esme,\" he said. \"I\u0027ll call it now.\" And he planted himself in front of me.\u003c/p\u003e\n\u003cp\u003eThe others returned to the field, warily sweeping the dark forest with their sharp eyes. Alice and Esme seemed to orient themselves around where I stood.\u003c/p\u003e\n\u003cp\u003e\"Take your hair down,\" Edward said in a low, even voice.\u003c/p\u003e\n\u003cp\u003eI obediently slid the rubber band out of my hair and shook it out around me.\u003c/p\u003e\n\u003cp\u003eI stated the obvious. \"The others are coming now.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, stay very still, keep quiet, and don\u0027t move from my side, please.\" He hid the stress in his voice well, but I could hear it. He pulled my long hair forward, around my face.\u003c/p\u003e\n\u003cp\u003e\"That won\u0027t help,\" Alice said softly. \"I could smell her across the field.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" A hint of frustration colored his tone.\u003c/p\u003e\n\u003cp\u003eCarlisle stood at the plate, and the others joined the game halfheartedly.\u003c/p\u003e\n\u003cp\u003e\"What did Esme ask you?\" I whispered.\u003c/p\u003e\n\u003cp\u003eHe hesitated for a second before he answered. \"Whether they were thirsty,\" he muttered unwillingly.\u003c/p\u003e\n\u003cp\u003eThe seconds ticked by; the game progressed with apathy now. No one dared to hit harder than a bunt, and Emmett, Rosalie, and Jasper hovered in the infield. Now and again, despite the fear that numbed my brain, I was aware of Rosalie\u0027s eyes on me. They were expressionless, but something about the way she held her mouth made me think she was angry.\u003c/p\u003e\n\u003cp\u003eEdward paid no attention to the game at all, eyes and mind ranging the forest.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Bella,\" he muttered fiercely. \"It was stupid, irresponsible, to expose you like this. I\u0027m so sorry.\"\u003c/p\u003e\n\u003cp\u003eI heard his breath stop, and his eyes zeroed in on right field. He took a half step, angling himself between me and what was coming.\u003c/p\u003e\n\u003cp\u003eCarlisle, Emmett, and the others turned in the same direction, hearing sounds of passage much too faint for my ears. \u003c/p\u003e","sourceLink":"https://allnovel.net/twilight-twilight-1/page-17.html","bookId":2023,"creation":"Oct 5, 2019 11:11:42 PM","modification":"Oct 5, 2019 11:11:42 PM"}
