{"id":107658,"no":23,"title":"Page 23","content":"\u003cp\u003e23. THE ANGEL\u003c/p\u003e\n\u003cp\u003eAs I drifted, I dreamed.\u003c/p\u003e\n\u003cp\u003eWhere I floated, under the dark water, I heard the happiest sound my mind could conjure up - as beautiful, as uplifting, as it was ghastly. It was another snarl; a deeper, wilder roar that rang with fury.\u003c/p\u003e\n\u003cp\u003eI was brought back, almost to the surface, by a sharp pain slashing my\u003c/p\u003e\n\u003cp\u003eupraised hand, but I couldn\u0027t find my way back far enough to open my eyes.\u003c/p\u003e\n\u003cp\u003eAnd then I knew I was dead.\u003c/p\u003e\n\u003cp\u003eBecause, through the heavy water, I heard the sound of an angel calling my name, calling me to the only heaven I wanted.\u003c/p\u003e\n\u003cp\u003e\"Oh no, Bella, no!\" the angel\u0027s voice cried in horror.\u003c/p\u003e\n\u003cp\u003eBehind that longed-for sound was another noise - an awful tumult that my mind shied away from. A vicious bass growling, a shocking snapping sound, and a high keening, suddenly breaking off...\u003c/p\u003e\n\u003cp\u003eI tried to concentrate on the angel\u0027s voice instead.\u003c/p\u003e\n\u003cp\u003e\"Bella, please! Bella, listen to me, please, please, Bella, please!\" he begged.\u003c/p\u003e\n\u003cp\u003eYes, I wanted to say. Anything. But I couldn\u0027t find my lips.\u003c/p\u003e\n\u003cp\u003e\"Carlisle!\" the angel called, agony in his perfect voice. \"Bella, Bella, no, oh please, no, no!\" And the angel was sobbing tearless, broken sobs.\u003c/p\u003e\n\u003cp\u003eThe angel shouldn\u0027t weep, it was wrong. I tried to find him, to tell him everything was fine, but the water was so deep, it was pressing on me, and I couldn\u0027t breathe.\u003c/p\u003e\n\u003cp\u003eThere was a point of pressure against my head. It hurt. Then, as that pain broke through the darkness to me, other pains came, stronger pains. I cried out, gasping, breaking through the dark pool.\u003c/p\u003e\n\u003cp\u003e\"Bella!\" the angel cried.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s lost some blood, but the head wound isn\u0027t deep,\" a calm voice informed me. \"Watch out for her leg, it\u0027s broken.\"\u003c/p\u003e\n\u003cp\u003eA howl of rage strangled on the angel\u0027s lips.\u003c/p\u003e\n\u003cp\u003eI felt a sharp stab in my side. This couldn\u0027t be heaven, could it? There was too much pain for that.\u003c/p\u003e\n\u003cp\u003e\"Some ribs, too, I think,\" the methodical voice continued.\u003c/p\u003e\n\u003cp\u003eBut the sharp pains were fading. There was a new pain, a scalding pain in my hand that was overshadowing everything else.\u003c/p\u003e\n\u003cp\u003eSomeone was burning me.\u003c/p\u003e\n\u003cp\u003e\"Edward.\" I tried to tell him, but my voice was so heavy and slow. I couldn\u0027t understand myself.\u003c/p\u003e\n\u003cp\u003e\"Bella, you\u0027re going to be fine. Can you hear me, Bella? I love you.\"\u003c/p\u003e\n\u003cp\u003e\"Edward,\" I tried again. My voice was a little clearer.\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"It hurts,\" I whimpered.\u003c/p\u003e\n\u003cp\u003e\"I know, Bella, I know\" - and then, away from me, anguished - \"can\u0027t you do anything?\"\u003c/p\u003e\n\u003cp\u003e\"My bag, please... Hold your breath, Alice, it will help,\" Carlisle promised.\u003c/p\u003e\n\u003cp\u003e\"Alice?\" I groaned.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s here, she knew where to find you.\"\u003c/p\u003e\n\u003cp\u003e\"My hand hurts,\" I tried to tell him.\u003c/p\u003e\n\u003cp\u003e\"I know, Bella. Carlisle will give you something, it will stop.\"\u003c/p\u003e\n\u003cp\u003e\"My hand is burning!\" I screamed, finally breaking through the last of the darkness, my eyes fluttering open. I couldn\u0027t see his face, something dark and warm was clouding my eyes. Why couldn\u0027t they see the fire and put it out?\u003c/p\u003e\n\u003cp\u003eHis voice was frightened. \"Bella?\"\u003c/p\u003e\n\u003cp\u003e\"The fire! Someone stop the fire!\" I screamed as it burned me.\u003c/p\u003e\n\u003cp\u003e\"Carlisle! Her hand!\"\u003c/p\u003e\n\u003cp\u003e\"He bit her.\" Carlisle\u0027s voice was no longer calm, it was appalled.\u003c/p\u003e\n\u003cp\u003eI heard Edward catch his breath in horror.\u003c/p\u003e\n\u003cp\u003e\"Edward, you have to do it.\" It was Alice\u0027s voice, close by my head. Cool fingers brushed at the wetness in my eyes.\u003c/p\u003e\n\u003cp\u003e\"No!\" he bellowed.\u003c/p\u003e\n\u003cp\u003e\"Alice,\" I moaned.\u003c/p\u003e\n\u003cp\u003e\"There may be a chance,\" Carlisle said.\u003c/p\u003e\n\u003cp\u003e\"What?\" Edward begged.\u003c/p\u003e\n\u003cp\u003e\"See if you can suck the venom back out. The wound is fairly clean.\" As Carlisle spoke, I could feel more pressure on my head, something poking and pulling at my scalp. The pain of it was lost in the pain of the fire.\u003c/p\u003e\n\u003cp\u003e\"Will that work?\" Alice\u0027s voice was strained.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Carlisle said. \"But we have to hurry.\"\u003c/p\u003e\n\u003cp\u003e\"Carlisle, I...\" Edward hesitated. \"I don\u0027t know if I can do that.\" There was agony in his beautiful voice again.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your decision, Edward, either way. I can\u0027t help you. I have to get this bleeding stopped here if you\u0027re going to be taking blood from her hand.\"\u003c/p\u003e\n\u003cp\u003eI writhed in the grip of the fiery torture, the movement making the pain in my leg flare sickeningly.\u003c/p\u003e\n\u003cp\u003e\"Edward!\" I screamed. I realized my eyes were closed again. I opened them, desperate to find his face. And I found him. Finally, I could see his perfect face, staring at me, twisted into a mask of indecision and pain.\u003c/p\u003e\n\u003cp\u003e\"Alice, get me something to brace her leg!\" Carlisle was bent over me, working on my head. \"Edward, you must do it now, or it will be too late.\"\u003c/p\u003e\n\u003cp\u003eEdward\u0027s face was drawn. I watched his eyes as the doubt was suddenly replaced with a blazing determination. His jaw tightened. I felt his cool, strong fingers on my burning hand, locking it in place. Then his head bent over it, and his cold lips pressed against my skin.\u003c/p\u003e\n\u003cp\u003eAt first the pain was worse. I screamed and thrashed against the cool hands that held me back. I heard Alice\u0027s voice, trying to calm me. Something heavy held my leg to the floor, and Carlisle had my head locked in the vise of his stone arms.\u003c/p\u003e\n\u003cp\u003eThen, slowly, my writhing calmed as my hand grew more and more numb. The fire was dulling, focusing into an ever-smaller point.\u003c/p\u003e\n\u003cp\u003eI felt my consciousness slipping as the pain subsided. I was afraid to fall into the black waters again, afraid I would lose him in the darkness.\u003c/p\u003e\n\u003cp\u003e\"Edward,\" I tried to say, but I couldn\u0027t hear my voice. They could hear me.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right here, Bella.\"\u003c/p\u003e\n\u003cp\u003e\"Stay, Edward, stay with me...\"\u003c/p\u003e\n\u003cp\u003e\"I will.\" His voice was strained, but somehow triumphant.\u003c/p\u003e\n\u003cp\u003eI sighed contentedly. The fire was gone, the other pains dulled by a sleepiness seeping through my body.\u003c/p\u003e\n\u003cp\u003e\"Is it all out?\" Carlisle asked from somewhere far away.\u003c/p\u003e\n\u003cp\u003e\"Her blood tastes clean,\" Edward said quietly. \"I can taste the morphine.\"\u003c/p\u003e\n\u003cp\u003e\"Bella?\" Carlisle called to me.\u003c/p\u003e\n\u003cp\u003eI tried to answer. \"Mmmmm?\"\u003c/p\u003e\n\u003cp\u003e\"Is the fire gone?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I sighed. \"Thank you, Edward.\"\u003c/p\u003e\n\u003cp\u003e\"I love you,\" he answered.\u003c/p\u003e\n\u003cp\u003e\"I know,\" I breathed, so tired.\u003c/p\u003e\n\u003cp\u003eI heard my favorite sound in the world: Edward\u0027s quiet laugh, weak with relief.\u003c/p\u003e\n\u003cp\u003e\"Bella?\" Carlisle asked again.\u003c/p\u003e\n\u003cp\u003eI frowned; I wanted to sleep. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Where is your mother?\"\u003c/p\u003e\n\u003cp\u003e\"In Florida,\" I sighed. \"He tricked me, Edward. He watched our videos.\" The outrage in my voice was pitifully frail.\u003c/p\u003e\n\u003cp\u003eBut that reminded me.\u003c/p\u003e\n\u003cp\u003e\"Alice.\" I tried to open my eyes. \"Alice, the video - he knew you, Alice, he knew where you came from.\" I meant to speak urgently, but my voice was feeble. \"I smell gasoline,\" I added, surprised through the haze in my brain.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time to move her,\" Carlisle said.\u003c/p\u003e\n\u003cp\u003e\"No, I want to sleep,\" I complained.\u003c/p\u003e\n\u003cp\u003e\"You can sleep, sweetheart, I\u0027ll carry you,\" Edward soothed me.\u003c/p\u003e\n\u003cp\u003eAnd I was in his arms, cradled against his chest - floating, all the pain gone.\u003c/p\u003e\n\u003cp\u003e\"Sleep now, Bella\" were the last words I heard. \u003c/p\u003e","sourceLink":"https://allnovel.net/twilight-twilight-1/page-23.html","bookId":2023,"creation":"Oct 5, 2019 11:11:42 PM","modification":"Oct 5, 2019 11:11:42 PM"}
