{"id":80765,"no":36,"title":"Page 36","content":"\u003cp\u003e“Looks like that rich chick with the Porsche is the bride-to-be,” Butch says in a teasing tone, and I see Paine grip his beer bottle so tightly I’m shocked it doesn’t shatter in his hand.\u003c/p\u003e\n\u003cp\u003eI reach out and grab his bottle as his eyes meet mine. “I’ll hold it for you, boss,” I tell Paine because I know where he’s heading. Straight for the dance floor to get the girl Butch is following. I down my beer and order another, enjoying sitting at the bar by myself. I don’t feel like being social.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes across the bar top, and I check the message. I should turn it off because I know it can only be one person, but like a masochist, I click the message.\u003c/p\u003e\n\u003cp\u003eLaw: Sweets, text me back. You got me worried.\u003c/p\u003e\n\u003cp\u003eHe’s fucking worried? Is he worried while he’s got his dick in some other chick’s cunt? The thought knocks the air out of my lungs. I motion for another drink, and Jake drops it down in front of me moments later.\u003c/p\u003e\n\u003cp\u003ePaine sits down next to me, and I don’t comment on where the little blonde went. Hell, I even see Butch behind me in the mirror over the bar, hitting on some chick. Are all men alike? I can’t believe I let myself think I found something different.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes again.\u003c/p\u003e\n\u003cp\u003eLaw: Damn it, Joey, answer me or I’m going to spank your pussy when I get my hands on you.\u003c/p\u003e\n\u003cp\u003eHow can he fucking talk to me like that when he’s out with another woman!\u003c/p\u003e\n\u003cp\u003eMe: Why don’t you spank the pussy of the blonde you were having dinner with. You know, the one you introduced to your family.\u003c/p\u003e\n\u003cp\u003eWith that, I power off my phone. I don’t want to read his excuses, or worse, see that he doesn’t respond at all. He probably knows he got busted, so I’m sure he’s done with me.\u003c/p\u003e\n\u003cp\u003e“Penelope,” Paine mumbles next to me for the tenth time since he sat down, taking another pull from his beer.\u003c/p\u003e\n\u003cp\u003e“If you say that word one more time, I’m going to knock you off that fucking stool,” I tell him. Can’t we both wallow in our misery in silence? I’m just thankful the bar finally turned the music down since the bachelorette party left.\u003c/p\u003e\n\u003cp\u003e“I fucked up,” Paine says, looking over at me while I fiddle with the paper on my beer bottle. I pull it off and stick it back on, annoyed at everything.\u003c/p\u003e\n\u003cp\u003e“Yeah, you did. You went after something you can’t have and you shouldn’t want,” I tell him as I meet his eyes. We both went after people who were out of our league and in a class we’d never understand. Law may just be a sheriff, but he comes from old money. Hell, his dad is the goddamn Mayor.\u003c/p\u003e\n\u003cp\u003e“Evening, Sheriff. What can I do for you tonight?” the bartender says. My eyes snap to the mirror behind the bar, and I seeing Law standing five feet back from Paine and me. My whole body locks up, and I grab my beer, wanting something to hold on to. Play it cool, I repeat over and over again in my head. I’ve given him enough of myself. I won’t give him anymore. He’s already seen parts of me no one else ever has. The girl who lies beneath my layers. One who is going back into hiding to lick her wounds.\u003c/p\u003e\n\u003cp\u003e“Just checking on things,” Law responds, and I can feel his eyes on me. I try to pretend he’s not there until he speaks right to me. “How you doing, Josephine?”\u003c/p\u003e\n\u003cp\u003eMy heart clenches at the use of my name. It bugged me at first when he called me that, like he knew me, but over the past few weeks, I’ve grown to love it. Crave him saying it. When we’d make love and he’d call it out, it was like the sweetest thing I’ve never known. I still refuse to meet his eyes in the mirror and just go on ignoring him. I can’t believe he’s doing this in the middle of the bar for everyone to see. Before today I wouldn’t have thought it a big deal, but after seeing him out with the other woman, the pieces click into place. He didn’t want people to know we were together. How didn’t I see it before? I was too content to spend our time together just holed up in his home, in his bed.\u003c/p\u003e\n\u003cp\u003eInstead of answering him, I just give him the middle finger. Because that’s what he can do. Fuck off\u003c/p\u003e\n\u003cp\u003e“Josephine, sweets, don’t—”\u003c/p\u003e\n\u003cp\u003e“Sweets—” Paine tries to say interject, but I cut them both off.\u003c/p\u003e\n\u003cp\u003e“What the fuck are you doing here, Anderson? Pretty sure stalking is against the law.”\u003c/p\u003e\n\u003cp\u003eThe bar has become eerily quiet now, and I know everyone is watching what’s happening.\u003c/p\u003e\n\u003cp\u003e“Jake, my sister around? I thought they came in here tonight,” Law says, pissing me off even more. He has a fucking sister? Law knows everything about me, and I didn’t even know he had a goddamn sister. Oh, I know why, there’s no point in introducing Joey because you’ll never meet her. You’re just the Sheriff’s dirty secret he fucks out in his cabin.\u003c/p\u003e\n\u003cp\u003e“She with that bachelorette party?”\u003c/p\u003e\n\u003cp\u003e“That would have been them. She’s the bachelorette.”\u003c/p\u003e\n\u003cp\u003eI almost want to laugh at the irony of Law’s words. Paine and I have been sitting at the bar, moping about a brother and sister who are way out of our range. But I have a feeling that won’t stop Paine. As for me, my ego can’t handle another round. I might shatter.\u003c/p\u003e\n\u003cp\u003e“They left here about two hours ago,” Jake says, pouring a glass of cheap whiskey.\u003c/p\u003e\n\u003cp\u003e“All right, I was just checking in before I head home for the night.”\u003c/p\u003e\n\u003cp\u003eI can’t help but snort at his words, not believing him. “Probably going to be fucking his date tonight since he won’t be fucking me,” I mumble to myself.\u003c/p\u003e\n\u003cp\u003e“Josephine, can I have a word with you outside?” I want to scream at him. Of course, so no one sees the sheriff is slumming it, but I can’t ignore him. He’s still the sheriff. \u003c/p\u003e","sourceLink":"https://allnovel.net/mechanic-breeding-2/page-36.html","bookId":1799,"creation":"Oct 5, 2019 4:29:44 PM","modification":"Oct 5, 2019 4:29:44 PM"}
