{"id":80739,"no":9,"title":"Page 9","content":"\u003cp\u003e“Just checking on things,” he responds, but his eyes stay on Joey’s back. She’s pretending he’s not there. Until he speaks to her. “How you doing, Josephine?”\u003c/p\u003e\n\u003cp\u003eJosephine? Fuck me. This isn’t good. I expect her to stand up and get in Law’s face, but she just raises her hand, giving him the finger. She still hasn’t turned around and refuses to meet his eyes in the mirror.\u003c/p\u003e\n\u003cp\u003e“Josephine, sweets, don’t—”\u003c/p\u003e\n\u003cp\u003e“Sweets—” I try to say something, but she cuts both of us off.\u003c/p\u003e\n\u003cp\u003e“What the fuck are you doing here, Anderson? Pretty sure stalking is against the law.”\u003c/p\u003e\n\u003cp\u003eI watch the Sheriff’s jaw tick. The bar has become eerily quiet now because everyone is watching what’s happening. It seems to make the Sheriff uncomfortable, until he breaks the silence.\u003c/p\u003e\n\u003cp\u003e“Jake, my sister around? I thought they came in here tonight,” Law says, looking to the bartender.\u003c/p\u003e\n\u003cp\u003e“She with that bachelorette party?”\u003c/p\u003e\n\u003cp\u003e“That would have been them.” If Law’s sister was with the bachelorette party, I realize I might have a way to find out who my Penelope is. I start to speak up, but his next words hit me hard. “She’s the bachelorette.”\u003c/p\u003e\n\u003cp\u003eSuddenly everything clicks into place.\u003c/p\u003e\n\u003cp\u003eA distant memory of the Mayor’s daughter coming home from college to marry his lawyer, Scott Winstead, has me clenching my teeth so hard I’m surprised they don’t crack. Scott and I go away back, and the history isn’t fucking good. The guy’s a cocky bastard who thinks his shit doesn’t stink, and he’s just as crooked as the mayor. Two peas in a fucking pod, those two are.\u003c/p\u003e\n\u003cp\u003eAt least I know where to find her now. She’s either at the Mayor’s house or their old family estate. If she’s at fucking Scott’s house, I’ll burn the place to the ground with Scott still in it.\u003c/p\u003e\n\u003cp\u003e“They left here about two hours ago,” Jake says, pouring old Jim at the end of the bar another glass of cheap whiskey.\u003c/p\u003e\n\u003cp\u003e“All right, I was just checking in before I head home for the night.”\u003c/p\u003e\n\u003cp\u003eJoey snorts at his words like she doesn’t believe him. She mumbles something I don’t catch, but before I can ask, Law is speaking to her.\u003c/p\u003e\n\u003cp\u003e“Josephine, can I have a word with you outside?” He shifts back and forth on his feet, looking nervous. Hell, I’d be nervous too if I kept calling Joey ‘Josephine,’ but he says it as if he’s always done it. The two can’t have a ton a history because Joey’s only been here a little over a year now.\u003c/p\u003e\n\u003cp\u003e“Who’s asking?” She motions for Sam to pour another shot. “The Sheriff or Law?”\u003c/p\u003e\n\u003cp\u003e“I’m asking, sweets.”\u003c/p\u003e\n\u003cp\u003e“Then the answer is no. Besides, you don’t like being seen with me in public.” She shrugs her shoulders like she doesn’t give a shit, but I can tell by how tense she is that it’s an act.\u003c/p\u003e\n\u003cp\u003e“That’s not fucking true and you know it.” Law takes a step towards her, but Joey slams her shot back and jumps up from the stool with a little wobble in her step. Both Law and I move at the same time to make sure she doesn’t fall.\u003c/p\u003e\n\u003cp\u003e“Don’t fucking touch her,” Law growls at me, pulling her towards himself in a possessive hold.\u003c/p\u003e\n\u003cp\u003eNormally, I’d tell him to go fuck himself, but Joey can hold her own, and I don’t want to start shit with Penelope’s brother. I already have a fight ahead of me, and I don’t want to throw fuel on the fire just yet. I want to keep my cards as close to my chest as I can.\u003c/p\u003e\n\u003cp\u003eJust as I thought, Joey pushes at Law’s chest and makes him take a step back from her. Joey is small, barely coming up to Law’s chest, but she knows how to defend herself.\u003c/p\u003e\n\u003cp\u003e“You made your choice. Now live with it.” She tries to go past him, but he grabs her by the arm, and she gives him a look that would kill a lesser man.\u003c/p\u003e\n\u003cp\u003e“You’re too drunk to drive.” His words are soft and filled with concern.\u003c/p\u003e\n\u003cp\u003eShe doesn’t even respond to him. Joey just calls out Butch’s name. He’s over at one of the pool tables, but when he hears her calling him, he walks over.\u003c/p\u003e\n\u003cp\u003e“Butch has me,” she says, and her voice is a little smug.\u003c/p\u003e\n\u003cp\u003eLaw clenches his jaw again, but what can he really say? If he knows anything about Joey, he knows she shares a townhouse with Butch. He was friends with her brothers, and he was the reason Joey moved here. She’s been staying at his place since she got here, but as far as I know nothing’s happened between them. But again, I don’t ask a lot of questions.\u003c/p\u003e\n\u003cp\u003e“Pick up your phone,” Law says, but Joey isn’t having it.\u003c/p\u003e\n\u003cp\u003e“Fuck off.” With that, she’s gone, strolling from the bar. Butch gives me a ‘what the fuck?’ look before he follows her out, leaving the Sheriff just standing there looking like a kicked puppy. I’m not so sure he can handle Joey. She might be small, but she makes up for it with attitude and an iron will.\u003c/p\u003e\n\u003cp\u003e“You’re in over your head,’ I tell him, finally turning to look at him head on.\u003c/p\u003e\n\u003cp\u003e“As long as I’m somewhere with her, I’ll take it.” With that, he follows Joey and Butch.\u003c/p\u003e\n\u003cp\u003eShaking my head, I get our tabs and close them out, thankful I didn’t let myself get drunk like I wanted to. No, I need to make sure my sweet Penelope is tucked into her own bed for the night. Alone. Once I get that squared away, maybe I can start to think of a way to dig out of this shitstorm I seem to have landed myself in.\u003c/p\u003e\n\u003cp\u003eThis morning I woke up without a care in the world, and now I don’t know what’s up or down. It’s making me understand now what the Sheriff was saying. I’d rather be in this mess with Penelope than have no Penelope at all. \u003c/p\u003e","sourceLink":"https://allnovel.net/mechanic-breeding-2/page-9.html","bookId":1799,"creation":"Oct 5, 2019 4:29:44 PM","modification":"Oct 5, 2019 4:29:44 PM"}
