{"id":72008,"no":2,"title":"Page 2","content":"\u003cp\u003eThe Sun was a brilliant diamond in the sky, just large enough to the naked eye to be made out as something more than a star; as a tiny white-hot pea-sized globe.\u003c/p\u003e\n\u003cp\u003eOut here in the vastness of space, near the second largest planet of the Solar System, the Sun gave out only one per cent of the light it cast on man\u0027s home planet. It was still, however, the brightest object in the sky, as four thousand full Moons would be.\u003c/p\u003e\n\u003cp\u003eLucky Starr gazed thoughtfully at the visiplate which centered the image of the distant Sun. John Bigman Jones watched with him, an odd contrast to Lucky\u0027s tall and rangy figure. When John Bigman Jones stretched himself to his full height, he stood five foot two exactly. But the little man did not measure himself in inches and he allowed people to call him by his middle name only: Bigman.\u003c/p\u003e\n\u003cp\u003eBigman said, \"You know, Lucky, it\u0027s nearly nine hundred million miles away. The Sun, I mean. I\u0027ve never been out this far.\"\u003c/p\u003e\n\u003cp\u003eThe third man in the cabin, Councilman Ben Wes-silewsky, grinned over his shoulder from his place at the controls. He was another large man, though not as tall as Lucky, and his shock of yellow hair topped a face that had grown space-brown in the service of the Council of Science.\u003c/p\u003e\n\u003cp\u003eHe said, \"What\u0027s the matter, Bigman? Scared way out here?\"\u003c/p\u003e\n\u003cp\u003eBigman squawked, \"Sands of Mars, Wess, you get your hands off those controls and say that again.\"\u003c/p\u003e\n\u003cp\u003eHe had dodged around Lucky and was making for the Councilman, when Lucky\u0027s hands came down on Bigman\u0027s shoulders and lifted him bodily. Big-man\u0027s legs still pumped, as though carrying him toward Wess at a charge, but Lucky put his Mars-born friend back in his original position.\u003c/p\u003e\n\u003cp\u003e\"Stay put, Bigman.\"\u003c/p\u003e\n\u003cp\u003e\"But, Lucky, you heard him. This long cobber thinks there\u0027s more to a man just because there\u0027s more of him. If that Wess is six feet tall, that just means there\u0027s an extra foot of flab... \"\u003c/p\u003e\n\u003cp\u003e\"All right, Bigman,\" said Lucky. \"And, Wess, let\u0027s save the humor for the Sirians.\"\u003c/p\u003e\n\u003cp\u003eHe spoke quietly to both, but there was no questioning his authority.\u003c/p\u003e\n\u003cp\u003eBigman cleared his throat and said, \"Where\u0027s Mars?\"\u003c/p\u003e\n\u003cp\u003e\"On the other side of the Sun from us.\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t you know,\" said the little fellow disgustedly. Then, brightening, \"But hold on, Lucky, we\u0027re a hundred million miles below the plane of the Ecliptic. We ought to be able to see Mars below the Sun; peeking out from behind, sort of.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh, we should. Actually, it\u0027s a degree or so away from the Sun, but that\u0027s close enough for it to be drowned out in the glare. You can make out Earth, though, I think.\"\u003c/p\u003e\n\u003cp\u003eBigman allowed a look of haughty disgust to cross his face. \"Who in space wants to see Earth? There isn\u0027t anything there but people; mostly groundhogs who\u0027ve never even been a hundred miles off the surface. I wouldn\u0027t look at it if that were all there was in the sky to look at. You let Wess look at it That\u0027s his speed.\"\u003c/p\u003e\n\u003cp\u003eHe walked moodily away from the visiplate.\u003c/p\u003e\n\u003cp\u003eWess said, \"Hey, Lucky, how about getting Saturn on and taking a good look at it from this angle? Come on, I\u0027ve been promising myself a treat.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" said Lucky, \"that the sight of Saturn these days is exactly what you might call a treat.\"\u003c/p\u003e\n\u003cp\u003eHe said it lightly, but for a moment silence fell uneasily within the confined pilot room of The Shooting Starr.\u003c/p\u003e\n\u003cp\u003eAll three felt the change in atmosphere. Saturn meant danger. Saturn had taken on a new face of doom to the peoples of the Terrestrial Federation. To six billion people on Earth, to additional millions on Mars, the Moon, and Venus, to scientific stations on Mercury, Ceres, and the outer moons of Jupiter, Saturn had become something newly and unexpectedly deadly.\u003c/p\u003e\n\u003cp\u003eLucky was the first to shrug off that moment of depression, and, obedient to the touch of his fingers, the sensitive electronic scanners set into the hull of The Shooting Starr rotated smoothly on their universal gimbals. As that happened, the field of vision in the visiplate shifted.\u003c/p\u003e\n\u003cp\u003eThe stars marched across the visiplate in steady procession, and Bigman said with a curl of hatred in his upper lip, \"Any of those things Sirius, Lucky?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Lucky, \"we\u0027re working through the Southern Celestial Hemisphere and Sirius is in the Northern. Would you like to see Canopus?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Bigman. \"Why should I?\"\u003c/p\u003e\n\u003cp\u003e\"I just thought you might be interested. It\u0027s the second brightest star and you could pretend it was Sirius.\" Lucky smiled slightly. It always amused him that the patriotic Bigman should be so annoyed because Sirius, home star of the great enemies of the Solar System (though themselves descendants of Earth-men), was the brightest star in Earth\u0027s heavens.\u003c/p\u003e\n\u003cp\u003eBigman said, \"Very funny. Come on, Lucky, let\u0027s see Saturn, and then when we get back to Earth you can get on some comedy show and panic everybody.\"\u003c/p\u003e\n\u003cp\u003eThe stars kept their smooth motion, then slowed and stopped. Lucky said, \"There it is-unmagnified, too.\"\u003c/p\u003e\n\u003cp\u003eWess locked the controls and twirled in the pilot\u0027s seat so that he might see also.\u003c/p\u003e\n\u003cp\u003eIt was a half-moon in appearance, somewhat bulging into more than half, just large enough to be seen as such, bright with a soft yellow light that was dimmer in the center than along the edges.\u003c/p\u003e\n\u003cp\u003e\"How far away are we?\" Bigman asked in astonishment.\u003c/p\u003e\n\u003cp\u003eLucky said, \"About a hundred million miles, I think.\"\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s wrong,\" Bigman said. \"Where are the rings? I\u0027ve been counting on a good look.\"\u003c/p\u003e\n\u003cp\u003eThe Shooting Starr was high above the south pole of Saturn. From that position it should see the rings broad on.\u003c/p\u003e\n\u003cp\u003eLucky said, \"The rings are blurred into the globe of the planet, Bigman, because of the distance. Suppose we magnify the image and take a closer look.\"\u003c/p\u003e\n\u003cp\u003eThe spot of light that was Saturn expanded and stretched in every direction, growing. And the half-moon that it had seemed to be broke up into three segments.\u003c/p\u003e\n\u003cp\u003eThere was still a central globe, half-mooned. Around it, however, touching the globe at no point, was a circularly curved ribbon of light, divided into two unequal halves by a dark line. As the ribbon curved about Saturn and entered its shadow, it was cut off in darkness.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir, Bigman,\" said Wess, lecturing, \"Saturn itself is only seventy-eight thousand miles in diameter. At a hundred million miles, it would just be a dot of light, but count in the rings and there are nearly two hundred thousand miles of reflecting surface from one end to the other.\"\u003c/p\u003e\n\u003cp\u003e\"I know all that,\" said Bigman indignantly.\u003c/p\u003e\n\u003cp\u003e\"And what\u0027s more,\" continued Wess, unheeding, \"at a hundred million miles, the seven-thousand-mile break between Saturn\u0027s surface and the innermost portion of the rings just couldn\u0027t be seen; let alone the twenty-five-hundred-mile break that divides the rings in two. That black line is called Cassini\u0027s division, you know, Bigman.\"\u003c/p\u003e\n\u003cp\u003e\"I said I know,\" roared Bigman. \"Listen, Lucky, that cobber is trying to make out I didn\u0027t go to school. Maybe I didn\u0027t get much schooling, but there isn\u0027t anything he has to tell me about space. Say the word, Lucky; say you\u0027ll let him stop hiding behind you and I\u0027ll squash him like a bug.\"\u003c/p\u003e\n\u003cp\u003eLucky said, \"You can make out Titan.\"\u003c/p\u003e\n\u003cp\u003eAt once Bigman and Wess said in chorus, \"Where?\"\u003c/p\u003e\n\u003cp\u003e\"Right there.\" Titan showed as a tiny half-moon about the size, under current magnification, that Saturn and its ring system had appeared to be without magnification. It was near the edge of the visiplate.\u003c/p\u003e\n\u003cp\u003eTitan was the only sizable moon in the Sarurnian system. But it wasn\u0027t its size that made Wess stare at it with curiosity and Bigman with hate.\u003c/p\u003e\n\u003cp\u003eIt was, instead, that the three were almost certain that Titan was the only world in the Solar System populated by men who did not acknowledge the over-lordship of Earth. Suddenly and unexpectedly it had been revealed as a world of the enemy.\u003c/p\u003e\n\u003cp\u003eIt brought the danger suddenly closer. \"When do we get inside the Saturnian system, Lucky?\"\u003c/p\u003e\n\u003cp\u003eLucky said, \"There\u0027s no real definition as to what is the Saturnian system, Bigman. Most people consider a world\u0027s system to include all the space out to the distance where the farthermost body is moving under the gravitational influence of that world. If that\u0027s so, we\u0027re still outside the Saturnian system.\"\u003c/p\u003e\n\u003cp\u003e\"The Sirians say, though... \" began Wess.\u003c/p\u003e\n\u003cp\u003e\"To Sun-center with the Sirian cobbers!\" roared Bigman, slapping his high boots in anger. \"Who cares what they say?\" He slapped his boots again as though every Sirian in the system were under the force of his blows. His boots were the most truly Martian thing about him. Their raucous coloring, orange and black in a curving checkerboard design, was the loud proclamation that their owner had been born and bred among the Martian farms and domed cities.\u003c/p\u003e\n\u003cp\u003eLucky blanked out the visiplate. The detectors on the ship\u0027s hulls retracted, leaving the ship\u0027s outer skin smooth, gleaming, and unbroken except for the bulge that ringed the stern and held The Shooting Starr\u0027s Agrav* attachment.\u003c/p\u003e\n\u003cp\u003eLucky said, \"We can\u0027t allow ourselves the luxury of the who-cares-what-they-say attitude, Bigman. At the moment the Sirians have the upper hand. Maybe we\u0027ll get them out of the Solar System eventually, but right now the only thing we can do is to play it their way for the while.\"\u003c/p\u003e\n\u003cp\u003eBigman muttered rebelliously, \"We\u0027re in our own system.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, but Sirius is occupying this part of it and, pending an interstellar conference, there isn\u0027t anything Earth can do about it, unless it\u0027s willing to start a war.\"\u003c/p\u003e\n\u003cp\u003eThere was nothing to be said to that. Wess returned to his controls, and The Shooting Starr, with minimum expenditure of thrust, making use of Saturn\u0027s gravity to the maximum, continued to sink rapidly toward the polar regions of the planet.\u003c/p\u003e\n\u003cp\u003eDown, down, deeper into the grip of what was now a Sirian world, its space swarming with Sirian ships some fifty trillion miles from then [1] home planet and only seven hundred million miles from Earth. In one giant step Sirius had covered 99.999 per cent of the distance between itself and Earth and established a military base on Earth\u0027s very doorstep.\u003c/p\u003e\n\u003cp\u003eIf Sirius were allowed to remain there, then in one sudden moment Earth would sink to the status of second-class power at Sirius\u0027s mercy. And the interstellar political situation was such that for the moment all of Earth\u0027s giant military establishment, all of her mighty ships and weapons were helpless to deal with the situation.\u003c/p\u003e\n\u003cp\u003eOnly three men in one small ship, on their own initiative and unauthorized by Earth, were left to try, by skill and craft, to reverse the situation, knowing that if they were caught they could be executed out of hand as spies-in their own Solar System by invaders of that Solar System-and that Earth could not do a solitary thing to save them. \u003c/p\u003e","sourceLink":"https://allnovel.net/lucky-starr-and-the-rings-of-saturn-lucky-starr-6/page-2.html","bookId":1759,"creation":"Oct 5, 2019 10:22:35 AM","modification":"Oct 5, 2019 10:22:35 AM"}
