{"id":100656,"no":11,"title":"Page 11","content":"\u003cp\u003eCinder flashed a smile. “Right.”\u003c/p\u003e\n\u003cp\u003eWith Cinder’s temper finally settling, Perry saw his opportunity. “What happened in the storeroom?”\u003c/p\u003e\n\u003cp\u003e“I just got hungry.”\u003c/p\u003e\n\u003cp\u003e“In the middle of the night?”\u003c/p\u003e\n\u003cp\u003e“I don’t like eating during supper. I don’t know anybody.”\u003c/p\u003e\n\u003cp\u003e“You spent the winter with Roar,” Perry said.\u003c/p\u003e\n\u003cp\u003e“Roar only cares about you and Aria.”\u003c/p\u003e\n\u003cp\u003eAnd Liv, Perry thought. It was true that Roar had few loyalties, but they were unbreakable. “So you snuck into the storeroom.”\u003c/p\u003e\n\u003cp\u003eCinder nodded. “It was dark in there, and so quiet. Then all of a sudden I saw this beast with yellow eyes. It scared me so bad I dropped the lamp I was holding, and next thing I knew there was fire burning across the floor. I tried to put it out, but I was only making it worse, so I ran.”\u003c/p\u003e\n\u003cp\u003ePerry was stuck on the first part of the story. “You saw a beast?”\u003c/p\u003e\n\u003cp\u003e“Well, I thought so. But it was just the stupid dog, Flea. In the dark he looks like a demon.”\u003c/p\u003e\n\u003cp\u003ePerry’s mouth twitched. “You saw Flea.”\u003c/p\u003e\n\u003cp\u003e“It’s not funny,” Cinder said, but he was fighting a smile too.\u003c/p\u003e\n\u003cp\u003e“So Flea, the demon dog, scared you, and the lamp was what made that fire? It wasn’t … what you do with the Aether?”\u003c/p\u003e\n\u003cp\u003eCinder shook his head. “No.”\u003c/p\u003e\n\u003cp\u003ePerry waited for him to say more. There were a hundred things he wanted to know about Cinder’s ability. About who he was. But Cinder would speak when he was ready.\u003c/p\u003e\n\u003cp\u003e“Are you going to make me leave?”\u003c/p\u003e\n\u003cp\u003e“No,” Perry said immediately. “I want you here. But if you’re going to be part of things, you need to be a part of all of it. You can’t run off whenever something goes wrong, or take food in the middle of the night. And you need to earn your way like everyone else.”\u003c/p\u003e\n\u003cp\u003e“I don’t know how,” Cinder said.\u003c/p\u003e\n\u003cp\u003e“How to what?”\u003c/p\u003e\n\u003cp\u003e“Earn my way. I don’t know how to do anything.”\u003c/p\u003e\n\u003cp\u003ePerry studied him. He didn’t know how to do anything? It wasn’t the first time Cinder had said something peculiar like that.\u003c/p\u003e\n\u003cp\u003e“Then we’ve got a lot of ground to cover. I’ll have Brooke get you a bow and start you on lessons. And I’ll talk to Bear tomorrow. He needs all the help he can get. One last thing, Cinder. When you’re ready, I want to hear everything you have to say.”\u003c/p\u003e\n\u003cp\u003eCinder frowned. “Everything I have to say about what?”\u003c/p\u003e\n\u003cp\u003e“You,” Perry said.\u003c/p\u003e\n\u003cp\u003e10\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eYou have a good way with pain,” Molly said.\u003c/p\u003e\n\u003cp\u003eAria looked up from the bandage in her hand. “Thank you. Butter is a good patient.”\u003c/p\u003e\n\u003cp\u003eThe mare blinked lazily in response to her name. Last night’s storm had triggered her flight instinct. Butter had kicked her stall in panic and suffered a gash along her front leg. To help Molly, whose hands were bothering her, Aria had already cleaned the wound and applied an antiseptic paste that smelled like mint.\u003c/p\u003e\n\u003cp\u003eAria resumed rolling the bandage around Butter’s leg. “My mother was a doctor. A researcher, actually. She didn’t work with people often. Or with horses … ever.”\u003c/p\u003e\n\u003cp\u003eMolly scratched the white star at Butter’s forelock with fingers as gnarled as roots. Aria couldn’t help but think of Reverie, where ailments like arthritis had been cured through genetics long ago. She wished there were something she could do.\u003c/p\u003e\n\u003cp\u003e“Was?” Molly said, peering down.\u003c/p\u003e\n\u003cp\u003e“Yes … she died five months ago.”\u003c/p\u003e\n\u003cp\u003eMolly nodded thoughtfully, watching her with warm, soulful eyes the same color as Butter’s chestnut hair. “And now you’re here, away from your home.”\u003c/p\u003e\n\u003cp\u003eAria looked around, seeing mud and straw everywhere. The smell of manure hung in the air. Her hands were cold and reeking of horse and mint. Butter, for the tenth time, nuzzled the top of her hair. This couldn’t have been more different from Reverie. “I’m here. But I don’t know where home is anymore.”\u003c/p\u003e\n\u003cp\u003e“What of your father?”\u003c/p\u003e\n\u003cp\u003e“He was an Aud.” Aria shrugged. “That’s all I know.”\u003c/p\u003e\n\u003cp\u003eShe waited for Molly to say something fantastic, like, I know exactly who your father is, and he’s right over here, hiding behind this stall. She shook her head at her own silliness. Would that even help? Would finding her father take away the airy, gossamer feeling inside her?\u003c/p\u003e\n\u003cp\u003e“Shame to not have family at your Marking Ceremony tonight,” Molly said.\u003c/p\u003e\n\u003cp\u003e“Tonight?” Aria asked, glancing up. She was surprised Perry had scheduled it, right in the aftermath of the storm.\u003c/p\u003e\n\u003cp\u003eButter gave an irritated snort as Wylan walked into the stable.\u003c/p\u003e\n\u003cp\u003e“Look at this. Molly and the Mole,” he said, leaning back against the stall. “You put on a good show last night, Dweller.”\u003c/p\u003e\n\u003cp\u003e“What do you need, Wylan?” Molly asked.\u003c/p\u003e\n\u003cp\u003eHe ignored her, his focus locked on Aria. “You’re wasting your time going north, Dweller. The Still Blue’s nothing more than a rumor spread by desperate people. Better watch yourself, though. Sable’s a mean bastard. Cunning as a fox. He’s not sharing the Still Blue with anyone, let alone a Mole. He hates Moles.”\u003c/p\u003e\n\u003cp\u003eAria stood. “How do you know that—from rumors spread by desperate people?”\u003c/p\u003e\n\u003cp\u003eWylan stepped closer. “As a matter of fact, yes. They say it goes back to the Unity. Sable’s ancestors were Chosen. They were called into one of the Pods, but they were double-crossed and left outside.”\u003c/p\u003e\n\u003cp\u003eIn school, Aria had studied the history of the Unity, the period after the massive solar flare that had corroded the earth’s protective magnetosphere, spreading Aether across the globe. The devastation in the first years had been catastrophic. The polarity of the Earth had reversed over and over again. The world was consumed by fires. Floods. Riots. Disease. Governments had rushed to build the Pods as the Aether storms intensified, striking constantly. Other, scientists had called the alien atmosphere when it first appeared, because it defied scientific explanation—an electromagnetic field of unknown chemical composition that behaved and looked like water, and struck with a potency never seen before. The term evolved to Aether, a word borrowed from ancient philosophers who’d spoken of a similar element.\u003c/p\u003e\n\u003cp\u003eAria had seen footage of smiling families, walking through Pods just like Reverie, admiring their new homes. She’d seen their ecstatic expressions when they’d first worn Smarteyes and experienced the Realms. But she’d never seen footage of what had happened outside. Until a few a months ago, Aether was something other to her—as foreign as the world beyond the safety of Reverie’s walls.\u003c/p\u003e\n\u003cp\u003e“You’re saying Sable hates Dwellers because of something that happened three hundred years ago?” she said. “Everyone couldn’t fit in the Pods. The Lottery was the only way they could make it fair.”\u003c/p\u003e\n\u003cp\u003eWylan snorted. “It wasn’t fair. People were left to die, Mole. You really believe in fairness when the world is ending?”\u003c/p\u003e\n\u003cp\u003eAria hesitated. She’d seen the survival instinct enough times now, and she’d felt it herself. A force that had pushed her to kill—something she’d never thought she’d do. She remembered Hess tossing her out of the Pod to die in order to protect Soren, his son. She could imagine that in the Unity, fairness wouldn’t have counted for much. What had happened wasn’t fair, she realized, but she still believed in it. Believed that fairness was something worth fighting for.\u003c/p\u003e\n\u003cp\u003e“Did you come here to be a nuisance, Wylan?” Molly asked.\u003c/p\u003e\n\u003cp\u003eWylan licked his lips. “I was just trying to warn the Mole—”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Aria interrupted. “I’ll make sure not to ask Sable about his great-great-great-great-grandparents.”\u003c/p\u003e\n\u003cp\u003eHe left with a greasy, curling smile. Molly went back to scratching the mare’s white star. “I like her, Butter. How about you?”\u003c/p\u003e\n\u003cp\u003eLate in the afternoon, Aria went to Perry’s house, wanting a few minutes alone before the Marking Ceremony. Vale’s room—where she’d spent her first night—was much tidier than the rest of the house. A red blanket lay across the foot of the bed, and there was a chest and a dresser, but nothing more. She’d never met Perry’s brother, but she sensed his presence in the room. The intensity she imagined he’d possessed left her feeling uneasy.\u003c/p\u003e\n\u003cp\u003eShe grabbed Perry’s turtle-falcon from the sill in the other room and set it on the nightstand, smiling at the simple solution. Then she changed into a white undershirt with thin straps, sat on the edge of the bed, and looked at her arms. In some ways, getting Markings would feel like an acceptance—an official one—of herself as an Outsider. As an Audile. As her father’s daughter. Had he broken her mother’s heart? Or had they been torn apart for another reason? Would she ever know the answer?\u003c/p\u003e\n\u003cp\u003eOutside, people gathered in the clearing. Their animated voices drifted in through the window. A drum pounded a deep heartbeat rhythm. She’d been at the Tide compound two nights now. On the first, she’d provided the tribe with a source of gossip. Last night, she’d entertained them. What would tonight bring?\u003c/p\u003e\n\u003cp\u003eAria found her Smarteye in her satchel and held it in her palm. She wished she could use it to reach her friends. What would Caleb think of her getting Markings?\u003c/p\u003e\n\u003cp\u003eThe front door opened and then closed with a solid clunk. Aria stuffed her Smarteye back into her satchel and rose from the bed, listening to the floorboards creak as someone approached. Perry appeared at the door, his green eyes intent and serious. They stood looking at each other, his expression growing softer, her pulse pounding harder.\u003c/p\u003e\n\u003cp\u003ePerry’s gaze moved to the figurine on the nightstand, honing in on the small change in the room. “I’ll put it back,” she said.\u003c/p\u003e\n\u003cp\u003eHe stepped inside and picked it up. “No. Keep it. It’s yours.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Aria glanced through the door behind him, to the other room. She felt that strange and unsettling distance between them again—the glass wall keeping them apart, in case someone came into the house.\u003c/p\u003e\n\u003cp\u003eHe set the falcon down and nodded to her satchel. “I thought we’d leave tomorrow at first light.”\u003c/p\u003e\n\u003cp\u003e“Are you sure you should leave? I mean, after what happened?”\u003c/p\u003e\n\u003cp\u003e“Yes, I’m sure,” he said sharply. Perry winced. Then he let out a slow breath and rubbed a hand over his face. “I’m sorry. Reef’s been … Never mind. Sorry.”\u003c/p\u003e\n\u003cp\u003eThe shadows beneath his eyes seemed darker, and his broad shoulders had a tired slant.\u003c/p\u003e\n\u003cp\u003e“Did you sleep at all?” she asked.\u003c/p\u003e\n\u003cp\u003e“No … I can’t.”\u003c/p\u003e\n\u003cp\u003e“You mean you couldn’t?”\u003c/p\u003e\n\u003cp\u003e“No.” His smile was faint and humorless. “I mean I can’t.”\u003c/p\u003e\n\u003cp\u003e“How long?” she asked.\u003c/p\u003e\n\u003cp\u003e“Since I slept a full night?” He lifted his shoulders. “Since Vale.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t believe it. He hadn’t slept a decent night in months?\u003c/p\u003e\n\u003cp\u003e“Aria, this room—” Perry stopped abruptly. He turned and pulled the door shut behind him. Then he leaned against it, hanging his thumbs on his belt, and watched her, waiting, like he expected her to object.\u003c/p\u003e\n\u003cp\u003eShe should have. She’d heard snatches of gossip all day. The Tides were unsettled by the storm, and by what had almost happened to Perry. She didn’t want to add to that. She could just imagine Wylan or Brooke calling her the Mole tramp who had seduced their Blood Lord. But she didn’t care about any of that now. She just wanted to be with him. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-11.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
