{"id":100658,"no":13,"title":"Page 13","content":"\u003cp\u003ePerry looked to Reef, who nodded, their thoughts aligning. The Rose and the Night were two of the largest tribes anywhere, each numbering in the thousands. The Tides barely reached four hundred in number, and that included children. Infants. Elderly. Perry had been preparing the Tides for raids, but against those odds, they wouldn’t have a chance.\u003c/p\u003e\n\u003cp\u003eHe drew an unsatisfying breath, warm and heavy with scents. This far back in the hall, the air festered. “Any sign where they’re going?”\u003c/p\u003e\n\u003cp\u003e“No.” Shade smiled. “No sign of that.”\u003c/p\u003e\n\u003cp\u003ePerry looked over the sea of heads, finding Aria again. Bear took a thin copper rod from the wooden box with the Marking supplies. He held it over a candle, heating the fine tip. In moments he would jab it into Aria’s skin to form her Marking. Used the wrong way, the instrument could be lethal. Perry shook his head, pushing away the thought.\u003c/p\u003e\n\u003cp\u003e“What else?” he asked. Nausea had begun a steady creep up his throat, and a bead of sweat ran down his spine. “What of the Still Blue?”\u003c/p\u003e\n\u003cp\u003e“Ahh … much talk of the Blue out there, Peregrine. Tribes are striking out in search of it. Some going south, across the Shield Valley. Some east, beyond Mount Arrow. The Quince tribe took to the north, beyond the Horns, and came back with nothing more than empty stomachs. Lots of talk, see, but none of it sticks.”\u003c/p\u003e\n\u003cp\u003e“I hear Sable knows where it is,” Perry said.\u003c/p\u003e\n\u003cp\u003eShade shrank back, his clothes jingling. “He says so, yes, but I’m no Scire, like you are, Peregrine. I can’t know if he speaks the truth. If he does know, he’s not telling a soul about it. Word says there’s a boy who can control the Aether—you might want to know that. Such a child would be worth something in a time like this.”\u003c/p\u003e\n\u003cp\u003ePerry kept still despite the jolt to his pulse. How much did Shade know? From the corner of his eye, he saw Cinder pull his hat down. “That’s not possible.”\u003c/p\u003e\n\u003cp\u003e“Yes, well … it is hard to believe.” Shade seemed disappointed to not have drawn any interest, because his next bit of information came readily. “The thaw came early to the north this spring. The pass to Rim is clear. You can go see Olivia now.”\u003c/p\u003e\n\u003cp\u003eLiv. Perry was caught off guard by the mention of his sister. “She didn’t go to the Horns. She never made it there.”\u003c/p\u003e\n\u003cp\u003eShade lifted his eyebrows. “Didn’t she?”\u003c/p\u003e\n\u003cp\u003ePerry froze. “What do you know about Liv?”\u003c/p\u003e\n\u003cp\u003e“More than you, it seems.” Shade smiled. He seemed pleased to have information to bargain with now. But he hadn’t counted on Roar.\u003c/p\u003e\n\u003cp\u003ePerry turned in time to see his friend leap over the table in a dark blur. There was a sudden loud tumble and a rattling of spoons and rings and trinkets. Reef and Gren drew their knives, and then everything stopped. Perry climbed over the table to see Roar pinning Shade.\u003c/p\u003e\n\u003cp\u003e“Where is she?” Roar hissed, pressing his blade to Shade’s throat.\u003c/p\u003e\n\u003cp\u003e“She went to the Horns. That’s all I know!” Shade looked at Perry, terrified. “Tell him, Scire! It’s the truth. I wouldn’t lie to you.”\u003c/p\u003e\n\u003cp\u003eThe hall grew quiet as all eyes turned to the commotion. Perry’s legs felt unsteady as he climbed down. He brought Roar to his feet and caught his friend’s temper, a searing scarlet color.\u003c/p\u003e\n\u003cp\u003e“Walk.” He pushed Roar toward the door. Air. They both needed air before they dealt with Shade. He didn’t need bloodshed tonight.\u003c/p\u003e\n\u003cp\u003e“Sable found her.” Roar’s eyes darted everywhere as Perry shepherded him across the hall. “He had to have. The bastard tracked her down and hauled her back. I have to go there. I need—”\u003c/p\u003e\n\u003cp\u003e“Outside, Roar.”\u003c/p\u003e\n\u003cp\u003eThey left a wake of questioning stares as they made their way across the hall. Perry focused on the door, imagining the cool night air outside.\u003c/p\u003e\n\u003cp\u003eRoar stopped and turned so abruptly that Perry almost crashed into him. “Perry … look.”\u003c/p\u003e\n\u003cp\u003eHe followed Roar’s gaze to Aria. Bear drove the rod into her arm in quick, short stabs, Marking her with the ink. Aria was sweating, and her hair clung to her neck. She looked over, meeting his eyes. Something was wrong.\u003c/p\u003e\n\u003cp\u003eHe was in front of her in a heartbeat. Seeing him, Bear startled and yanked the rod back. A line of blood dribbled down Aria’s arm. Too much blood. Far too much. Part of the Marking was done, the flowing lines of the Aud tattoo reaching halfway across her bicep. The skin around the inked skin was red and swollen.\u003c/p\u003e\n\u003cp\u003e“What is this?” Perry demanded.\u003c/p\u003e\n\u003cp\u003e“She has thin skin,” Bear said defensively. “I’m doing it the way I know.”\u003c/p\u003e\n\u003cp\u003eAria’s face was ghostly pale, and she was slumping. “I can handle it,” she said weakly. She wouldn’t look at him. She kept her gaze on the fire.\u003c/p\u003e\n\u003cp\u003ePerry’s eyes locked on the inkpot just as he smelled something off. He picked up the small copper bowl and brought it to his nose. He inhaled. Beneath the ink he caught a musty, mousy odor.\u003c/p\u003e\n\u003cp\u003eHemlock.\u003c/p\u003e\n\u003cp\u003eFor an instant, his mind couldn’t fit the information together. Then it hit him.\u003c/p\u003e\n\u003cp\u003ePoison.\u003c/p\u003e\n\u003cp\u003eThe ink was poisoned.\u003c/p\u003e\n\u003cp\u003eThe copper pot clacked against the hearth before he realized he’d thrown it. Ink splattered across the mantel, the wall, the floor.\u003c/p\u003e\n\u003cp\u003e“What did you do?” Perry yelled. The drums stopped. Everything stopped.\u003c/p\u003e\n\u003cp\u003eBear’s eyes darted from the rod to Aria’s arm. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eAria pitched forward. Perry dropped to his knees, catching her just before she toppled off the bench. Her skin burned beneath his hands, and her entire weight lay against him, heavy and limp. This couldn’t be happening. He didn’t know what to do. Couldn’t make a decision. Nausea and fear coursed through his body, freezing him to the spot.\u003c/p\u003e\n\u003cp\u003eHe picked her up, pulling her into his arms. Next thing he knew, he was in his house. He barreled into Vale’s room and set her on the bed. Then he yanked his belt off, his knife falling to the floor with a clunk. Perry tied the belt above her bicep, cinching it tight. He had to stop the poison from flowing to her heart.\u003c/p\u003e\n\u003cp\u003eThen he took her face in his hands. “Aria?” Her pupils were so dilated that he could hardly see the gray of her irises.\u003c/p\u003e\n\u003cp\u003e“I can’t see you, Perry,” she murmured.\u003c/p\u003e\n\u003cp\u003e“I’m right here. Right beside you.” He knelt by the bed and took her hand. If he held on tight enough, she’d be fine. She had to be. “You’re going to be all right.”\u003c/p\u003e\n\u003cp\u003eRoar appeared, setting a lamp on the bedside table. “Molly’s on her way. She’s getting what she needs.”\u003c/p\u003e\n\u003cp\u003ePerry stared at Aria’s arm. The veins around her Marking looked corded and deep purple. With every second that passed, her face grew paler. He ran a shaking hand over her forehead and thought of the medical facility at Marron’s. He had nothing here. Never in his life had he felt primitive until now.\u003c/p\u003e\n\u003cp\u003e“Perry,” she breathed.\u003c/p\u003e\n\u003cp\u003eHe squeezed her hand. “Right here, Aria. I’m not going anywhere. I’m right—”\u003c/p\u003e\n\u003cp\u003eHer eyes drifted closed, and he was plunged deep underwater again, in the cold darkness, where there was no up. No air to draw into his lungs.\u003c/p\u003e\n\u003cp\u003e“She’s still breathing,” Roar said behind him. “I hear her. She’s just unconscious.”\u003c/p\u003e\n\u003cp\u003eMolly arrived, carrying a jar with a chalky white paste used for poison rashes.\u003c/p\u003e\n\u003cp\u003e“That won’t work,” Perry snapped. “It’s inside her skin.”\u003c/p\u003e\n\u003cp\u003e“I know,” Molly said calmly. “I hadn’t seen the wound yet.”\u003c/p\u003e\n\u003cp\u003e“What do we do? Should I cut the skin off?” The words had hardly left Perry when his stomach seized.\u003c/p\u003e\n\u003cp\u003eRoar’s hand came down to his knife. “I can do it, Perry.”\u003c/p\u003e\n\u003cp\u003eHe looked at Roar, who was blinking fast, ashen, and couldn’t believe they were talking about cutting into Aria’s arm.\u003c/p\u003e\n\u003cp\u003e“That won’t help,” Molly said. “It’s already in her bloodstream.” She set another glass jar on the nightstand. Leeches cut swiftly through the water, agitated and eager. “These might, if they take to the spoiled blood.”\u003c/p\u003e\n\u003cp\u003eHe fought off another wave of nausea. A belt around her arm. Leeches. Was this the best he could do for her? “Do it. Try them.”\u003c/p\u003e\n\u003cp\u003eMolly plucked a writhing leech from the jar and placed it over Aria’s Marking. When it latched onto her skin, Roar let out a loud exhale, but Perry still couldn’t breathe. Molly took another leech from the jar, and on it went, every second an eternity, until six leeches clung from Aria’s arm. On perfect skin he’d run his fingers across just hours ago.\u003c/p\u003e\n\u003cp\u003ePerry shifted his grip on her hand, threading their fingers together. Aria’s hand tightened, just a faint twitch before it relaxed again. Wherever she was in the unconscious, she was telling him she’d fight.\u003c/p\u003e\n\u003cp\u003eHe watched the leeches grow dark purple, filling with blood. They had to be working. They had to be drawing the poison out of her. Then he couldn’t watch anymore. He put his head down on the bed, his knees aching from kneeling, and felt the passing of time in snatches. From the room outside, Bear’s deep voice, swearing his innocence. Then Cinder, pleading desperately with Reef to let him in. Silence. Then Molly shifting nearby, pulling the blanket over Aria and resting her hand briefly on his head. And silence again.\u003c/p\u003e\n\u003cp\u003eFinally, Perry looked up. Though Aria still hadn’t stirred, he sensed her returning. He stood, swaying in place, his legs stiff. Relief coursed through him, blurring his eyes, but it was overshadowed quickly.\u003c/p\u003e\n\u003cp\u003eHe looked at Roar, who held his knife by the blade.\u003c/p\u003e\n\u003cp\u003e“Go,” Roar said, handing it over. “I’ll stay with her.”\u003c/p\u003e\n\u003cp\u003ePerry took it and strode to the cookhouse.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eAria fractioned to a vast dome, feeling weak and dizzy. Sterile white rows stretched back hundreds of feet. Vegetables and fruits sprouted from them—ordered, perfect bursts of color.\u003c/p\u003e\n\u003cp\u003eHer heart began to pound. This was Ag 6—one of the farming domes in Reverie. She’d been here before in search of information about her mother. Soren had attacked her not far from where she now stood.\u003c/p\u003e\n\u003cp\u003ePaisley had died here.\u003c/p\u003e\n\u003cp\u003eAria’s gaze traveled up. High above, black smoke hissed from the irrigation pipes, tumbling down and pooling around her. She tried to run for the airlock door. Her legs wouldn’t move.\u003c/p\u003e\n\u003cp\u003eA voice broke the silence. “You can’t get out, remember?”\u003c/p\u003e\n\u003cp\u003eSoren. She didn’t see him, but she recognized his taunting voice. “Where are you?” The smoke reached her, stinging her eyes and making her cough, but she couldn’t see anyone else in the dome.\u003c/p\u003e\n\u003cp\u003e“Where are you, Aria?”\u003c/p\u003e\n\u003cp\u003e“You can’t hurt me in here, Soren.”\u003c/p\u003e\n\u003cp\u003e“You mean in a Realm? Is that what you think this is? And you’re wrong. I can hurt you.”\u003c/p\u003e\n\u003cp\u003eA wave of dizziness sent her stumbling. Her knees buckled, and she went down, grabbing her head. Why was her head pounding? What was wrong with her?\u003c/p\u003e\n\u003cp\u003eA burning pressure grew stronger and stronger at her bicep. She looked down. Smoke poured out of her skin, seeping into the air. There was fire inside her. Her blood was burning. She yanked and tore at her skin, but invisible hands trapped her.\u003c/p\u003e\n\u003cp\u003e“Enough, Molly! Get them off her arm!”\u003c/p\u003e\n\u003cp\u003eIt was Roar’s voice, but where was he?\u003c/p\u003e\n\u003cp\u003eSoren’s muscular form appeared above her. “You won’t get away this time.” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-13.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
