{"id":100659,"no":14,"title":"Page 14","content":"\u003cp\u003eShe struggled to tear her arms free. She needed to fight him, but she couldn’t break loose. “I’m not afraid of you!”\u003c/p\u003e\n\u003cp\u003e“You sure about that?” He darted for her, grabbing her around the waist.\u003c/p\u003e\n\u003cp\u003e“It’s me, Aria! It’s all right. It’s me.”\u003c/p\u003e\n\u003cp\u003eRoar’s voice. Soren’s face. Soren’s hands wrapped around her.\u003c/p\u003e\n\u003cp\u003eAria struggled against his grip. She didn’t know what to be afraid of. She had no idea what was real, or why her blood felt like boiling water in her veins. She fell back against the farming rows, kicking, fighting, as her vision turned gray and then black.\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003ePEREGRINE\u003c/p\u003e\n\u003cp\u003ePerry entered the cookhouse and found Wylan standing on a table, facing a small crowd. It was late—only a few stray lamps were lit across the shadowed hall—and most of the tribe had gone to their homes for the night.\u003c/p\u003e\n\u003cp\u003e“He’s a hothead; that’s all he’s ever been,” Wylan said. “He’s with the Dweller. He was keeping that from us. Now he says he’s going north for the Still Blue, but don’t believe that, either. I wouldn’t be surprised if he never comes back!”\u003c/p\u003e\n\u003cp\u003e“I’m back,” Perry said. He felt cold. Completely focused. As sharp as the knife in his hand.\u003c/p\u003e\n\u003cp\u003eWylan whirled and nearly fell off the table. Around Perry, people gasped, their eyes dropping to the blade at his side.\u003c/p\u003e\n\u003cp\u003eBear put up his hands. “I had no idea, Perry. I didn’t. I would never do—”\u003c/p\u003e\n\u003cp\u003e“I know.” Bear’s temper proved his innocence. He’d been just as shocked as Perry had been earlier. Perry inhaled deeply, slashes of blue edging his vision. “Who was it?” He searched the faces around him.\u003c/p\u003e\n\u003cp\u003eNo one answered.\u003c/p\u003e\n\u003cp\u003e“Do you think silence will protect you?” He walked past Rowan and Old Will, moving through the crowd, pumping air into his lungs. Inhaling.\u003c/p\u003e\n\u003cp\u003eSifting.\u003c/p\u003e\n\u003cp\u003eSearching.\u003c/p\u003e\n\u003cp\u003e“Do you have any idea how loud guilt is to me?”\u003c/p\u003e\n\u003cp\u003eHe caught it: the rancid reek of fear. He grabbed the scent like a line and followed it. The tribe recoiled, terrified, stumbling into benches and tables. All except Gray, who stood fixed as a tree. Perry’s vision tunneled, focusing only on him. On the farmer, who shook his head, his face pulled taut with terror.\u003c/p\u003e\n\u003cp\u003e“She’s a Mole! She’s not even one of us! She has no right to be Marked!”\u003c/p\u003e\n\u003cp\u003ePerry lunged, slamming into Gray. They fell together, knocking into people and crashing into the floor. Someone kicked his hand, and the knife tore from his fingers. Hands fell on his shoulders, but they didn’t stop him. He was pure intent. Pure focused power—all the fear inside him releasing through his fist\u003c/p\u003e\n\u003cp\u003eone—\u003c/p\u003e\n\u003cp\u003etwo—\u003c/p\u003e\n\u003cp\u003ethree times before Reef and Bear wrenched him away. Perry fought his way back, cursing, struggling. He’d heard bones crack, but it wasn’t enough. Not enough, because Gray was still alive. Still moving on the floor.\u003c/p\u003e\n\u003cp\u003eBear lifted him off his feet, throwing him backward. “Stop! He’s got sons.”\u003c/p\u003e\n\u003cp\u003ePerry crashed into a table. Reef appeared in front of him, jamming a forearm into his neck, stunning him. “Look at me, Peregrine!”\u003c/p\u003e\n\u003cp\u003eHe forced himself to meet Reef’s eyes.\u003c/p\u003e\n\u003cp\u003e“Let him disperse,” Reef said. “Let him go.”\u003c/p\u003e\n\u003cp\u003ePerry’s gaze went to the two boys, standing in the crowd. Yesterday in the fields they’d been laughing, taking shots with Brooke’s bow. Now they stood pressed together, crying.\u003c/p\u003e\n\u003cp\u003eReef stepped back, releasing him.\u003c/p\u003e\n\u003cp\u003eGray lay on his side a few feet away. Dark blood streamed from his nose and pooled on the floorboards.\u003c/p\u003e\n\u003cp\u003e“Pick him up,” Perry said. Hyde and Straggler hauled him off the floor and held him upright. Gray couldn’t stand on his own. “Why?” Perry asked. “Why did you do it?”\u003c/p\u003e\n\u003cp\u003e“She doesn’t deserve Markings! She’s not even one of us. I am.”\u003c/p\u003e\n\u003cp\u003e“Not anymore,” Perry said. “You lost that right. Be off my land by tomorrow morning.”\u003c/p\u003e\n\u003cp\u003eAs Hyde and Strag dragged Gray away, Perry put his head down and spit out the warm pool of blood in his mouth. He’d taken a punch at some point. Out of the corner of his eye, he caught a flash of Shade’s messy, jangling coat. The gossipmonger had scored a victory tonight.\u003c/p\u003e\n\u003cp\u003e“You’re a liar, Peregrine.”\u003c/p\u003e\n\u003cp\u003ePerry looked up and followed the bitter voice until he found Wylan, buried in the crowd. “You want to come here and say that, Wylan?”\u003c/p\u003e\n\u003cp\u003e“If I do, will you beat me, too?” Wylan shook his head. “You’re worse than Vale,” he said under his breath, and left.\u003c/p\u003e\n\u003cp\u003eTwig shoved Wylan as he passed by. A cheap shot—surprising for someone as honorable as Twig. Perry’s gaze moved across the hall. Hayden braced nearby, and Gren had his knife in his hand. Reef scanned the crowd, a warrior assessing the enemy.\u003c/p\u003e\n\u003cp\u003eThey weren’t the enemy. These were his people. Perry looked around the hall, scenting pity and fear and rage.\u003c/p\u003e\n\u003cp\u003eFinally, Reef spoke. “Go on, all of you. It’s over,” he said.\u003c/p\u003e\n\u003cp\u003eBut Perry knew he was wrong.\u003c/p\u003e\n\u003cp\u003e14\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eSearing pain in Aria’s arm woke her. She blinked in the darkness. Her tongue was stuck to the roof of her mouth, and her head pounded so intensely she was afraid to move. She was on the bed in Vale’s room. Aether light seeped through a small crack between the shutters, blue and cool, like the glow of a full moon.\u003c/p\u003e\n\u003cp\u003eShe looked down, moving her head slowly. A strip of cloth was tied tightly around her bicep. She knew the dark stains on it were blood. Her hand shook wildly as she reached up and touched it. She felt scalded. Not just along her skin but deep inside her veins.\u003c/p\u003e\n\u003cp\u003eShe remembered the ceremony. Bear prodding her arm with the rod, and the terrible sting she’d felt spreading into her muscle. Then the fading of sounds, of voices and drums, and a tilting, tilting hall.\u003c/p\u003e\n\u003cp\u003eShe’d been poisoned.\u003c/p\u003e\n\u003cp\u003eShe pressed her eyes closed. It was so unbelievably medieval that she’d laugh if she could, but then rage and fear collided inside of her. The shaking in her hands spread to the rest of her body as the reality of what had happened sank in. She didn’t know how she could feel so cold with her blood burning, searing inside her veins. Rolling onto her side, she tucked into a ball and squeezed every muscle tight as chills shook her.\u003c/p\u003e\n\u003cp\u003eWho had done this? Brooke? Wylan? Was it Molly? Could it have been the one person she’d begun to trust here? Aria remembered the night she’d sung with Roar in the cookhouse. So many people had smiled at her then. Had they smiled while she’d been poisoned, too?\u003c/p\u003e\n\u003cp\u003eShe licked her dry lips. The bitterness she tasted—was that poison? Her eye caught on the falcon figurine sitting on the nightstand, its small, blunt lines painted blue with Aether. She stared at it as sleep came and swept her away.\u003c/p\u003e\n\u003cp\u003eWhen she woke again, someone had lit a candle by the bedside. She squinted, the brightness of the flame hurting her eyes. Perry was speaking in the next room, his voice hoarse and anxious. Her pulse immediately picked up.\u003c/p\u003e\n\u003cp\u003e“I knew something was wrong,” he said. “I felt sick in there. But I didn’t know it was because of her.”\u003c/p\u003e\n\u003cp\u003eReef responded with no trace of surprise. “You’re rendered to her.” Aria heard the creak of a floorboard and then his soft curse. “I thought you might be. I’ve been praying I was wrong.”\u003c/p\u003e\n\u003cp\u003eAria stared at the door, struggling to understand. Perry had rendered to her?\u003c/p\u003e\n\u003cp\u003e“You think that’s the last time her tempers are going to affect you?” Reef said. “Because it won’t be. You’re rendered to a girl no one wants around. I can’t think of anything worse than that. She’s clouding your judgment—”\u003c/p\u003e\n\u003cp\u003e“She’s not—”\u003c/p\u003e\n\u003cp\u003e“She is, Perry. She can’t stay. You have to see that. And after what you just did, the Tides sure as hell won’t accept her now. You just chose her over one of them.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I did. I can’t allow murder under my nose, no matter who’s involved.”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Reef said, “but people see what they want to see. They’ll come after her again, or worse, they’ll come after you. And don’t tell me you’re going north. The Tides need you here.”\u003c/p\u003e\n\u003cp\u003eShe waited for Perry to disagree. He didn’t.\u003c/p\u003e\n\u003cp\u003eA moment later the door opened, and he walked in, his fingers pressed to his eyes. He looked up, freezing when he saw her awake. Then he shut the door and came to the bed. He took her hand, his green eyes filling with tears.\u003c/p\u003e\n\u003cp\u003e“Aria … I’m sorry. I’m so sorry. There’s no way for me to tell you how sorry I am.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Not you. Not your fault.” She couldn’t find the strength to talk. A red bruise spread over one side of his jaw, and his lower lip was swollen. “You’re hurt.”\u003c/p\u003e\n\u003cp\u003e“It’s nothing. It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003eIt did matter. He was hurt because of her. It mattered.\u003c/p\u003e\n\u003cp\u003e“What time is it?” She had no idea if an hour had passed. A day. A week. Every time she woke, it was dark in the room. Night outside. That was all she knew.\u003c/p\u003e\n\u003cp\u003e“Almost dawn.”\u003c/p\u003e\n\u003cp\u003e“Have you slept?” she asked.\u003c/p\u003e\n\u003cp\u003ePerry lifted his eyebrows. “Sleep?” He shook his head. “No … haven’t even tried.”\u003c/p\u003e\n\u003cp\u003eShe was too tired. Too weak to say what she wanted. Then she realized it would only take one word. She patted the bed. “You.”\u003c/p\u003e\n\u003cp\u003eHe lay down, gathering her close. Aria slumped against him, turning her ear to his chest. She listened to his heartbeat—a good, solid sound—as the warmth of his body melted into her. She’d been in a fog earlier. Hallucinating and searching for what was real. She found it in him. He was real.\u003c/p\u003e\n\u003cp\u003e“We’re together now,” he whispered against her forehead. “The way we should be.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and relaxed her breathing, seeking calm. He was rendered to her. Maybe he’d feel it too. “Sleep, Perry.”\u003c/p\u003e\n\u003cp\u003e“I will,” he said. “With you right here, I will.”\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003ePEREGRINE\u003c/p\u003e\n\u003cp\u003ePerry, wake up!”\u003c/p\u003e\n\u003cp\u003ePerry’s eyes flew open. He was in Vale’s room. He’d never spent a night there in his life. Aria slept soundly, pressed against his chest. He tightened his arms around her as the scents of sweat and blood brought last night crashing back.\u003c/p\u003e\n\u003cp\u003eRoar stood at the door. “You better come outside. Now.”\u003c/p\u003e\n\u003cp\u003eTaking care not to wake her, Perry slipped from the bed and followed Roar outside.\u003c/p\u003e\n\u003cp\u003eHe found the entire tribe in the clearing—a crowd of hundreds. People were crying, yelling insults at each other. On the roof of the cookhouse he saw Hyde and Hayden with their bows nocked, ready to fire. Reef appeared at Perry’s side with his knife drawn, Twig a second later.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Cinder asked.\u003c/p\u003e\n\u003cp\u003ePerry didn’t know. Didn’t understand until Gray came through the crowd.\u003c/p\u003e\n\u003cp\u003eHis face was so swollen it was nearly unrecognizable. He carried a heavy bag over his shoulder. “You chose wrong,” he said simply, and then walked out of the compound. His two sons followed, crying, wiping at their faces.\u003c/p\u003e\n\u003cp\u003eThen Wylan came forward with his own bag across his back. “You killed Vale for dealing with the Dwellers. How’s that any different from what you did?” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-14.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
