{"id":100668,"no":23,"title":"Page 23","content":"\u003cp\u003ePerry moved closer to him, eager to learn what he’d wondered for months. “What does it feel like?”\u003c/p\u003e\n\u003cp\u003e“Most of the time, like right now, I feel hollow and tired. But when I call it, I feel strong and light. I feel like fire. Like I’m part of everything.” He scratched his chin. “I can only hold on to it a little while before I have to push it. That’s all I can do is just bring it to me, and then push it away. I’m not very good, though. Where I’m from—Rhapsody—there were kids who were better at it than me.”\u003c/p\u003e\n\u003cp\u003ePerry’s heart thudded. Rhapsody was a Pod hundreds of miles away, past Reverie. “You’re a Dweller.”\u003c/p\u003e\n\u003cp\u003eCinder shook his head. “I don’t know. I don’t remember much from before I broke out of there. But I guess … I guess I could be. When I met you in the woods and you were with Aria? It didn’t seem like you hated her. That’s why I followed you. I thought maybe you’d be all right with me, too.”\u003c/p\u003e\n\u003cp\u003e“You thought right,” Perry said.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Cinder smiled, a flash in the dimness that faded quickly.\u003c/p\u003e\n\u003cp\u003eA hundred questions buzzed Perry’s mind about how Cinder had escaped Rhapsody. About the other kids, who were like him. But he knew to tread lightly. He knew to let Cinder come to him.\u003c/p\u003e\n\u003cp\u003e“If I could help you with the Aether, I would,” Cinder said, the words sudden and blunt. “But I can’t … I just can’t.”\u003c/p\u003e\n\u003cp\u003e“Because it makes you weak afterward?” Perry asked, remembering the way Cinder had suffered after their encounter with the Croven. By calling the Aether, Cinder had destroyed the band of cannibals. He’d saved Perry’s life, and Aria and Roar’s too, but the act had left him cold as ice and drained to the point of unconsciousness.\u003c/p\u003e\n\u003cp\u003eCinder looked past him, like he was worried Reef would be there.\u003c/p\u003e\n\u003cp\u003e“It’s all right,” Perry said. He could trust Reef with secrets—Cinder’s scent probably already had Reef suspicious—but Perry knew Cinder would only be at ease with him. “Reef’s outside, and he’ll stay there. It’s just us.”\u003c/p\u003e\n\u003cp\u003eReassured, Cinder nodded and replied, “Every time, I feel worse afterward. It’s like the Aether takes part of me away with it. I feel like I can barely breathe, it hurts so much. One day it’ll take everything. I know it will.” He brushed away a tear from his cheek with an angry swipe. “It’s all I have,” he said. “It’s the only thing I can do, and I’m scared of it.”\u003c/p\u003e\n\u003cp\u003ePerry exhaled slowly, absorbing the information. Every time Cinder used his power, he gambled with his life. Perry couldn’t ask that of him. It was one thing to take chances with his own life. But he couldn’t put an innocent boy in that position. Not ever.\u003c/p\u003e\n\u003cp\u003e“You’re well if you don’t use it?” he asked.\u003c/p\u003e\n\u003cp\u003eCinder nodded, his eyes downcast.\u003c/p\u003e\n\u003cp\u003e“Then don’t. Don’t call the Aether. Not for any reason.”\u003c/p\u003e\n\u003cp\u003eCinder peered up. “Does that mean you’re not streaked at me?”\u003c/p\u003e\n\u003cp\u003e“Because you can’t save the Tides for me?” Perry shook his head. “No. Not at all, Cinder. But you’re wrong about something. The Aether isn’t the only thing you have. You’re part of this tribe now, no different from anyone else. And you’ve got me. All right?”\u003c/p\u003e\n\u003cp\u003e“All right,” Cinder said, fighting off a smile. “Thanks.”\u003c/p\u003e\n\u003cp\u003ePerry thumped him on the shoulder. “Maybe one day you’ll let me borrow your hat, if it’s all right with Willow.”\u003c/p\u003e\n\u003cp\u003eCinder rolled his eyes. “That was … that wasn’t …”\u003c/p\u003e\n\u003cp\u003ePerry laughed. He knew exactly what it was.\u003c/p\u003e\n\u003cp\u003eTwig ran up on the trail as they returned to the compound. “Gren is back,” he said, panting for breath. “He’s brought Marron with him.”\u003c/p\u003e\n\u003cp\u003eMarron was here? It didn’t make sense. Perry had sent Gren for provisions. He hadn’t expected his friend to deliver them personally.\u003c/p\u003e\n\u003cp\u003eHe stepped into the clearing and saw a filthy, weather-beaten group, roughly thirty in number. Molly and Willow were giving them water, and Gren stood with them, his face tight with worry.\u003c/p\u003e\n\u003cp\u003ePerry clasped his hand. “Good you’re back.”\u003c/p\u003e\n\u003cp\u003e“I ran into them on my way,” Gren said, “and brought them with me. I knew it was what you’d want.”\u003c/p\u003e\n\u003cp\u003ePerry scanned the crowd and almost missed Marron. He was a different person. Dirt coated his tailored jacket, the ivory silk shirt beneath rumpled and stained with sweat. His blond hair—normally perfectly combed—was matted and darkened by grease and dirt. His face was windburned and had lost all of its roundness. He had withered.\u003c/p\u003e\n\u003cp\u003e“We were overpowered,” Marron said. “There were thousands.” He took a gulping breath, fighting back emotion. “I couldn’t keep them out. There were just too many.”\u003c/p\u003e\n\u003cp\u003ePerry’s heart stopped. “Was it the Croven?”\u003c/p\u003e\n\u003cp\u003eMarron shook his head. “No. It was the Rose and Night tribes. They took Delphi.”\u003c/p\u003e\n\u003cp\u003ePerry studied the people with him. Men and women, huddled together. Half of them were children, so tired they swayed on their feet. “The others?” Marron had commanded hundreds of people.\u003c/p\u003e\n\u003cp\u003e“Forced to stay, some. Others chose to. I don’t blame them. I started with twice this number, but many turned back. We haven’t eaten—”\u003c/p\u003e\n\u003cp\u003eMarron’s blue eyes filled. He pulled a handkerchief from his pocket. It was folded in a perfect square, but the material was as rumpled and dirty as the rest of his clothing. He frowned at it like he was surprised to find it soiled, and returned it to his pocket.\u003c/p\u003e\n\u003cp\u003eHis ragtag group watched in silence. Their expressions were dead, their tempers muted and lifeless. Perry realized this could happen to the Tides if they lost the compound and were forced into the borderlands. His doubts about the cave began to fade.\u003c/p\u003e\n\u003cp\u003e“We have nowhere else to go,” Marron said.\u003c/p\u003e\n\u003cp\u003e“You don’t need to go anywhere else. You can stay here.”\u003c/p\u003e\n\u003cp\u003e“We’re taking them in?” Twig asked. “How’re we going to feed them?”\u003c/p\u003e\n\u003cp\u003e“We are,” Perry said, though he didn’t know how. He barely had enough food for the Tides. But what could he do? He could never turn Marron away.\u003c/p\u003e\n\u003cp\u003e“Get them settled,” he told Reef.\u003c/p\u003e\n\u003cp\u003eHe took Marron to his house. There, Marron’s temper deepened and deepened, becoming something immense, until finally his tears came. Perry sat with him at the table, deeply shaken himself. At Delphi, Marron had had soft beds and the finest food as often as he’d wanted. He’d had a wall protecting him, with archers posted day and night. He’d lost everything.\u003c/p\u003e\n\u003cp\u003eThat night at supper—watered-down fish soup—Perry sat with Marron at the high table and looked across the cookhouse. The Tides wanted nothing to do with Marron’s people. They sat apart, at separate tables, glaring at the newcomers. Perry hardly recognized his tribe anymore. People came and people left. Both were unsettling to the Tides.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Marron said quietly. He knew the strain he’d placed on Perry.\u003c/p\u003e\n\u003cp\u003e“No need for that. Tomorrow I plan to put you to work.”\u003c/p\u003e\n\u003cp\u003eMarron nodded, his blue eyes sparkling, filling with the sharp curiosity Perry remembered. “Of course. Ask anything.”\u003c/p\u003e\n\u003cp\u003e22\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eWhatever Aria had expected from the Horns, it hadn’t been this. She absorbed their settlement in awe as she and Roar approached on a farm road. She had imagined Rim as a compound, like the Tides’, but this was so much more.\u003c/p\u003e\n\u003cp\u003eThe road led them through a valley many times larger than the Tides’. Farmland stepped up mountain slopes that rose to soaring, snowcapped peaks. Here and there she saw the silvery scars of Aether damage. Sable had the same challenges Perry did with growing food. The realization gave her a perverse satisfaction.\u003c/p\u003e\n\u003cp\u003eIn the distance she saw the city: a cluster of towers of varying heights nestled against the sheer side of a mountain. Balconies and bridges connected the towers in a chaotic network, giving Rim a sprawling, jumbled appearance that reminded her of a coral reef. A single structure loomed above the others, with a spired rooftop that looked like a spear. The Snake River skirted the near side of the city, forming a natural moat, with smaller structures and homes spilling along its banks.\u003c/p\u003e\n\u003cp\u003eAether currents flowed bright and fast in the late morning sky, enhancing Rim’s severe appearance. The storm they’d been running from had followed them there.\u003c/p\u003e\n\u003cp\u003eAria lifted an eyebrow. “It’s not the Tide compound, is it?”\u003c/p\u003e\n\u003cp\u003eRoar shook his head, his gaze locked on the city. “No. It’s not.”\u003c/p\u003e\n\u003cp\u003eAs they neared Rim, the road grew crowded with people coming and going, carrying satchels and pushing carts. She noticed that the Marked wore specific clothing that revealed their arms, making their Senses known—vests for the men, and shirts with slits along the sleeves for the women. Adrenaline prickled in Aria’s veins as she ran a hand over her shirt, picturing the botched Marking beneath.\u003c/p\u003e\n\u003cp\u003eRoar kept close as they reached a wide cobbled bridge and slipped into the flow. Snatches of conversation drifted to Aria’s ears.\u003c/p\u003e\n\u003cp\u003e“… just had a storm days ago …”\u003c/p\u003e\n\u003cp\u003e“… find your brother and tell him to get home now …”\u003c/p\u003e\n\u003cp\u003e“… worse growing season than last year …”\u003c/p\u003e\n\u003cp\u003eThe bridge brought them into narrow streets bordered by stone houses that were several stories high. Aria took the lead, following the main road. The way was tight, shadowed as a tunnel and crowded with people, their voices echoing off stone and stone and more stone. Gutters were strewn with filth, and a fetid scent carried to her nose. Rim was large, but she could already tell it was nowhere near as modern as Marron’s.\u003c/p\u003e\n\u003cp\u003eThe streets climbed and turned, and then ended abruptly at the tower. Massive wooden doors opened to a stone chamber that flickered with torchlight. Guards in trim black uniforms with red stag horns embroidered on the chest watched the traffic of people who passed inside.\u003c/p\u003e\n\u003cp\u003eAs she and Roar walked up, a hulking guard with a thick black beard blocked their path. “Your business?” he asked.\u003c/p\u003e\n\u003cp\u003e“We’re here from the Tides to see Sable,” she said.\u003c/p\u003e\n\u003cp\u003e“Stay here.” He disappeared inside.\u003c/p\u003e\n\u003cp\u003eIt felt like an hour passed before another guard arrived, giving Roar a cursory look. “You’re Marked?” he asked. He had close-cropped dark hair, almost shaved, and an impatient look in his eyes. The stag horns at his chest were woven in silver thread.\u003c/p\u003e\n\u003cp\u003eRoar nodded. “An Aud.”\u003c/p\u003e\n\u003cp\u003eThe guard’s gaze turned to her, his impatience disappearing. “And you?”\u003c/p\u003e\n\u003cp\u003e“Unmarked,” she answered. It was true, in part. She was Unmarked on one side.\u003c/p\u003e\n\u003cp\u003eThe guard’s eyebrows lifted slightly, and then his gaze trailed down her body, settling at her belt. “Pretty pair of knives.” His tone was flirtatious and teasing.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Aria answered. “I keep them sharp.”\u003c/p\u003e\n\u003cp\u003eHis mouth curled in amusement. “Follow me.”\u003c/p\u003e\n\u003cp\u003eAria exchanged a look with Roar as they stepped inside. This was it. No turning back now.\u003c/p\u003e\n\u003cp\u003eInside, the wide hall smelled faintly of mold and rancid wine. It was cold and damp. Even with the wooden shutters thrown open, and lamps, the stone corridor was gloomy and shadowed. The faint chatter of voices carried to her ears, growing louder. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-23.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
