{"id":100669,"no":24,"title":"Page 24","content":"\u003cp\u003eRoar prowled beside her, searching every person, every room they passed, with hunger in his eyes. Aria couldn’t imagine how he felt. After so many months of searching, he’d finally see Liv.\u003c/p\u003e\n\u003cp\u003eThey crossed a wide threshold, entering a hall as expansive as the cookhouse at the Tides’ but with high, arched ceilings that reminded her of Gothic cathedrals. A meal was in progress. Dozens of guards were packed around the tables, a sea of black and red spreading out before her. Sable kept his military force close.\u003c/p\u003e\n\u003cp\u003eA stroke of luck, she thought. She’d been worried about Sable reading her temper. Maybe in such a crowd he’d miss scenting the fear swirling inside her.\u003c/p\u003e\n\u003cp\u003e“Which one is Sable?”\u003c/p\u003e\n\u003cp\u003eAt the far end of the hall she saw a dais, where several men and women sat above the rest. None of the men wore a Blood Lord chain.\u003c/p\u003e\n\u003cp\u003e“I don’t see him,” said the guard. “But you might. He has short hair. Blue eyes. He’s about my height. Exactly my height, actually.”\u003c/p\u003e\n\u003cp\u003eThe humor in his tone sent a chill crawling down her spine. She looked at the guard—at Sable—standing beside her.\u003c/p\u003e\n\u003cp\u003eHe was older than she’d expected. In his thirties, she guessed. Average in height and build, with features that were refined and well-proportioned but somehow unremarkable. She’d have thought him bland if it hadn’t been for the look in his steel-colored eyes. That look—confident, cunning, amused—catapulted him from forgettable to appealing.\u003c/p\u003e\n\u003cp\u003eSable smiled, obviously pleased with the trick he’d played on her. “I know you’re from the Tides, but I didn’t catch your names.”\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. “Aria and Roar.”\u003c/p\u003e\n\u003cp\u003eSable’s eyes moved to Roar and narrowed in recognition. “Olivia has spoken of you.”\u003c/p\u003e\n\u003cp\u003e“Where is she?” Roar asked.\u003c/p\u003e\n\u003cp\u003eSeconds passed. The hall bustled with noise around them. Her pulse pounding, Aria watched Sable’s chest expand and contract with a breath and knew he was scenting Roar’s rage. His jealousy. A year’s worth of worrying about Liv.\u003c/p\u003e\n\u003cp\u003e“She’s close,” Sable said finally. “Come. I’ll take you to her now. What a reunion this will be.”\u003c/p\u003e\n\u003cp\u003eThey exited the hall and moved back into the shadowed corridors. Aria tried to memorize their path, but the halls twisted and turned and then climbed narrow stairs and turned again. There were doors and lamps along the walls, but no windows or distinguishing marks to help her remember the way. A trapped feeling crawled over her, reminding her of a labyrinth Realm she’d been in once. An image of a dungeon flashed before her eyes, raising the hair on the back of her neck. Where was Sable keeping Liv?\u003c/p\u003e\n\u003cp\u003e“How is the young Blood Lord of the Tides faring?” Sable asked over his shoulder. She couldn’t see his expression, but the tone in his voice was light and casual. Aria had a feeling he knew Perry had lost part of his tribe. The question seemed to be a test more than a search for information.\u003c/p\u003e\n\u003cp\u003e“Faring,” Roar said tightly.\u003c/p\u003e\n\u003cp\u003eIn the darkness Sable laughed, the sound smooth and engaging. “Carefully put.” He stopped in front of a heavy wooden door. “Here we are.”\u003c/p\u003e\n\u003cp\u003eThey stepped out into a large stone-paved courtyard loud with the cheers of a crowd. Around her the castle—it was the best word she could come up with for Sable’s rambling stronghold—rose up hundreds of feet in the same disjointed arrangement of balconies and walkways she’d seen from afar. The sheer gray face of the mountain soared higher still, sharing the sky with the roiling web of Aether.\u003c/p\u003e\n\u003cp\u003eShe followed Sable toward the crowd gathered at the center, her pulse racing, conscious of Roar moving beside her. Above the cheers, she heard the ting ting of clashing steel. The spectators parted when they saw Sable, stepping aside to let them through. Aria glimpsed flashes of blond hair up ahead.\u003c/p\u003e\n\u003cp\u003eAnd then she saw her.\u003c/p\u003e\n\u003cp\u003eLiv swung a half-sword against a soldier who was her size—nearly six feet tall. Her hair, dark and light streaks of blond, reached halfway down her back. She had wide-set eyes, a strong jaw, and high cheekbones. She wore leather boots, slim pants, and a sleeveless shirt that showed lean, defined muscles.\u003c/p\u003e\n\u003cp\u003eShe was strong. Her face. Her body. Everything about her.\u003c/p\u003e\n\u003cp\u003eHer fighting style was all power, no hesitation. She fought like she was diving into the sea with every move. They’re very alike, Roar had once told her about Perry and Liv. Aria saw that now.\u003c/p\u003e\n\u003cp\u003eLiv looked comfortable and in control, hardly the captive Roar had imagined finding. Aria glanced at him and found his face ashen. She’d never seen him look so shaken. A surge of protectiveness moved over her.\u003c/p\u003e\n\u003cp\u003eLiv ducked to avoid a high, slicing blow from her opponent, but he followed with a forearm that caught her flush across the face. Her head whipped to the side. She recovered in an instant and stepped in where almost anyone would have rolled out, stunning the man with a punch to the gut. When he doubled over, she drove an elbow into the back of his head, unyielding, dropping him to his knees, where he stayed, coughing, reeling from the force she’d put behind the blows.\u003c/p\u003e\n\u003cp\u003eSmiling, Liv nudged his shoulder with her foot. “Come on, Loran. Stand. That can’t be all you’re good for.”\u003c/p\u003e\n\u003cp\u003e“I can’t. You cracked a rib. I’m sure of it.” The soldier lifted his head, looking their way. “Talk to her, Sable. She shows no mercy. It’s no way to train.”\u003c/p\u003e\n\u003cp\u003eSable laughed—the same smooth, seductive sound Aria had heard in the corridors. “Wrong, Loran. It’s the only way to train.”\u003c/p\u003e\n\u003cp\u003eLiv turned, spotting Sable. Her smile widened for an instant. Then she saw Roar. Seconds passed, and she didn’t move. Didn’t look away. Unblinking, she reached up, sheathing her sword at her back.\u003c/p\u003e\n\u003cp\u003eAs she walked over, all Aria could do was stare at a girl she’d been hearing about for months. A girl who controlled her best friend’s heart. Who had the same blood as Perry running in her veins.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she asked. The blow she’d taken across the cheek had left a red welt, but the color had drained from the rest of her face. She looked as pale as Roar.\u003c/p\u003e\n\u003cp\u003e“I could ask you the same.” Roar’s words were cold, but his voice was hoarse with emotion, and the veins at his neck stood out. He was barely holding himself back.\u003c/p\u003e\n\u003cp\u003eSable looked from one to the other, and smiled. “Your friends have come for the wedding, Liv.”\u003c/p\u003e\n\u003cp\u003eAria’s blood went cold.\u003c/p\u003e\n\u003cp\u003eSable saw her surprise. “Didn’t you know?” he asked, his eyebrows lifting. “I sent word to the Tides. You arrived just in time. Liv and I will be married in three days.”\u003c/p\u003e\n\u003cp\u003eMarried. Liv was going to be married. Aria didn’t know why she was so shocked. It was the deal that had been made between Vale and Sable—Liv’s hand in marriage in exchange for food—but something felt terribly wrong.\u003c/p\u003e\n\u003cp\u003eThen she saw how close Liv and Sable stood. How they stood together.\u003c/p\u003e\n\u003cp\u003eSable reached up and brushed his thumb along the welt on Liv’s cheek. His touch lingered, his fingers sliding down her neck, the gesture slow and sensual. “This will be a perfect shade of purple by then.” He slipped his arm around Liv’s waist. “I’d punish Loran, but you’ve done it for me.”\u003c/p\u003e\n\u003cp\u003eLiv’s focus hadn’t left Roar. “You didn’t need to come here,” she said, but her meaning was clear: She didn’t want him there. Liv wanted to marry Sable.\u003c/p\u003e\n\u003cp\u003eRage coursed through Aria. She bit the inside of her lip and tasted blood. Roar had turned to stone beside her. She needed to get him out of there. “Is there someplace we can rest? It was a long trip.”\u003c/p\u003e\n\u003cp\u003eLiv blinked, noticing her for the first time. She looked from Aria to Roar, her breathing focused. “Who are you?”\u003c/p\u003e\n\u003cp\u003e“Excuse my manners,” Sable said. “I thought you knew each other. Liv, this is Aria.” He motioned one of his men over. “Show them to the guest rooms by my quarters,” he said. Then he smiled broadly. “I’ll have supper arranged for the four of us later. Tonight we’ll celebrate.”\u003c/p\u003e\n\u003cp\u003eAria’s room was cold and spare: a simple cot and a chair with a curling backrest made of stag horns. The only light came through a dingy beveled-glass window recessed deep in the stone wall.\u003c/p\u003e\n\u003cp\u003eRoar was given the room adjacent to hers, but he followed her inside. Aria pulled the door shut and wrapped her arms around him. His muscles were tense, trembling.\u003c/p\u003e\n\u003cp\u003e“I don’t understand. Liv let him touch her.”\u003c/p\u003e\n\u003cp\u003eShe winced at the pain in his voice. “I know. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eShe had no better words to give him. She remembered the conversation they’d had days after leaving the Tides. She’d still felt the poison inside her, and she’d been in knots about leaving Perry. Roar had spoken to her of truth. He’d lost a truth today, just as she had months ago when she’d learned she was half Outsider. Her life had rested on a pillar that had suddenly vanished, and she still hadn’t found her balance. Nothing she said would help him, so she stood with him and held him until he was ready to stand on his own again.\u003c/p\u003e\n\u003cp\u003eWhen he drew away, the anger in his brown eyes chilled her. She grasped his hand. Roar, don’t do anything to Sable. He’s expecting it. Don’t give him a reason to hurt you.\u003c/p\u003e\n\u003cp\u003eHe didn’t answer her. For once she wished she could hear his thoughts.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No. You don’t.” He moved away, sitting against the door.\u003c/p\u003e\n\u003cp\u003eShe sat on the bed and looked around the small room. She didn’t know what to do. For the past two weeks, she’d raced to get here. Now that she was here, she felt trapped.\u003c/p\u003e\n\u003cp\u003eRoar pulled his knees up, resting his head in his hands. His forearms were flexed, his hands fisted. In hours, they’d have dinner with Liv and Sable. How would it feel to sit across a dinner table from Perry and another girl? To watch him touch her cheek, the way Sable had touched Liv’s? How would Roar bear it? In their plans, she and Roar had never spoken about leaving Rim without Liv. Not once had they imagined she’d want to stay.\u003c/p\u003e\n\u003cp\u003eAria pulled her satchel into her lap, feeling the small lump inside the lining. Earlier, she’d wrapped the Smarteye in a cloth, with a handful of pine needles to mask the synthetic scent of the device, in case Sable searched their things. She heard the heavy footfalls of guards moving through the corridors, and the door didn’t have a lock. While she was there, contacting Hess—or Soren—would be too dangerous.\u003c/p\u003e\n\u003cp\u003eIt was said that Sable despised Dwellers. She didn’t want to find out.\u003c/p\u003e\n\u003cp\u003eShe rummaged around until she found the falcon carving. An intense pang of longing hit her as she brought it out. She imagined Perry as he’d been the night of her Marking ceremony, leaning against Vale’s door with his thumbs hanging on his belt. She pictured his narrow hips and wide shoulders, and the small tilt of his head. His focus completely on her. Whenever his eyes were on her, she felt so completely seen.\u003c/p\u003e\n\u003cp\u003eShe held the image in her mind, and pretended she could speak with him through the figurine the same way she spoke with Roar.\u003c/p\u003e\n\u003cp\u003eWe’re here, but it’s a mess, Perry. Your sister … I really wanted to like her, but I can’t. I’m sorry, but I can’t. Maybe I was wrong to leave without you. Maybe if you were here, you could talk Liv out of marrying Sable and help us find the Still Blue. But I promise I’ll find a way. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-24.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
