{"id":100673,"no":28,"title":"Page 28","content":"\u003cp\u003eAria sat back against the iron headboard, remembering Perry on their last night together, bruised and beaten after a fight that had happened because of her. The next day, he lost part of his tribe. She didn’t feel weak because of him. She felt too powerful, like every choice she made had the potential to hurt him, and that was the last thing she wanted.\u003c/p\u003e\n\u003cp\u003e“Roar will move on,” Liv said quietly. Her eyes had softened, and Aria knew she’d read her temper. “He’ll forget about me.”\u003c/p\u003e\n\u003cp\u003e“You can’t really believe that.”\u003c/p\u003e\n\u003cp\u003eLiv bit her lower lip. “No,” she said. “I don’t.”\u003c/p\u003e\n\u003cp\u003e“Will you tell him the truth? Roar needs to know what you’re doing. He needs to know why.”\u003c/p\u003e\n\u003cp\u003e“You think it will help?”\u003c/p\u003e\n\u003cp\u003e“No. But you owe it to him.”\u003c/p\u003e\n\u003cp\u003eLiv watched her for a long moment. “All right. I’ll talk to him tomorrow.” She scooted higher on the bed, drawing the blanket over her legs. The sounds of the storm filtered into the room, and a cold draft flowed in beneath the bedroom door. “How is my brother really doing?”\u003c/p\u003e\n\u003cp\u003eJust a short while ago, she had threatened Aria. Now she was close and relaxed. Lost in her thoughts. Hot and cold, Aria thought. She wondered if there was anything in-between with Liv.\u003c/p\u003e\n\u003cp\u003eAria pulled the other side of the blanket over her. The last time she’d seen Perry, he’d been bruised and abandoned by so many people. By her. She hated knowing she’d added to his pain. “It hasn’t been easy.”\u003c/p\u003e\n\u003cp\u003e“It’s so much to do. So much to take care of,” Liv said. “He must be out of his mind missing Talon.”\u003c/p\u003e\n\u003cp\u003e“He is, but we’re getting Talon back,” Aria said before she could stop herself.\u003c/p\u003e\n\u003cp\u003eLiv frowned, her green eyes roaming over Aria’s face. “Where are you from?”\u003c/p\u003e\n\u003cp\u003eAria hesitated. She had the feeling her answer would shape their relationship from that moment on. Should she risk telling Liv the truth? She wanted trust between them, and here, late at night and in the quiet of her room, she just wanted to be herself. She drew a breath and answered. “I’m from Reverie.”\u003c/p\u003e\n\u003cp\u003eLiv blinked at her. “You’re a Dweller?”\u003c/p\u003e\n\u003cp\u003e“Yes.... Well, a half Dweller.”\u003c/p\u003e\n\u003cp\u003eLiv smiled, a small laugh bubbling out of her. “How did that happen?”\u003c/p\u003e\n\u003cp\u003eAria shifted to her side and rested her head on her arm, mirroring Liv. Then she explained how she’d been cast out of the Pod in the fall and met Perry. She told Liv everything that had happened at the Tides’, and how she needed to find the Still Blue to get Talon back. When Aria finished, Liv was silent, and the sounds of the Aether funnels had faded. Rim had seen the worst of the storm.\u003c/p\u003e\n\u003cp\u003e“I’ve heard Sable mention the Still Blue a few times,” Liv said. Her eyes were heavy with sleep. “He knows where it is. We’ll find out and get Talon back.”\u003c/p\u003e\n\u003cp\u003eWe. Such a small word, but it felt huge. Aria felt a grounding, settling sort of thrill. Liv would help.\u003c/p\u003e\n\u003cp\u003eLiv studied her for a long moment. “So you don’t care what happened at the Tides’? That you were poisoned? You’re going back to my brother?”\u003c/p\u003e\n\u003cp\u003eAria nodded. “I care, but I can’t imagine not going back to him.” Lyrics sprang into mind, well-worn in her singer’s memory. “‘Love is a rebellious bird that nobody can tame,’” she said. “It’s from an opera called Carmen.”\u003c/p\u003e\n\u003cp\u003eLiv narrowed her eyes. “Are you the bird, or is my brother?”\u003c/p\u003e\n\u003cp\u003eAria smiled. “I think the bird is the connection between us.... I’d do anything for him,” she said, and realized that it really was that simple.\u003c/p\u003e\n\u003cp\u003eLiv’s gaze grew distant. “It’s a good saying,” she said after a long while. She yawned. “I’m going to sleep here. Sorry if I snore.”\u003c/p\u003e\n\u003cp\u003e“Sure, why don’t you stay? There’s plenty of room if neither one of us moves.”\u003c/p\u003e\n\u003cp\u003e“That won’t be a problem. I can’t move anyway. This dress is like wearing a tourniquet.”\u003c/p\u003e\n\u003cp\u003e“You tied the belt wrong. I’ve worn that style of dress before in the Realms. I could show you the right way.”\u003c/p\u003e\n\u003cp\u003e“No need. It’s a stupid dress.”\u003c/p\u003e\n\u003cp\u003eAria laughed. “It’s not stupid. You look amazing in it. Like Athena.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” Liv yawned again and closed her eyes. “I thought Roar would like it. All right. Show me how to tie the stupid dress tomorrow.”\u003c/p\u003e\n\u003cp\u003eSoon, as promised, Liv snored. It wasn’t loud. Just a soft purr that wove with the sound of the wind, lulling Aria to sleep.\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003ePEREGRINE\u003c/p\u003e\n\u003cp\u003eWhat’s she doing up there?” Perry asked.\u003c/p\u003e\n\u003cp\u003eHe stopped in the clearing and looked to the roof of his house. Kirra’s hair caught his eye like a red flag flapping in the breeze. The sound of hammers pounding carried down to him.\u003c/p\u003e\n\u003cp\u003eHe’d spent the morning at the cavern with Marron, going over plans to grade the bluff that led to the cove. If they could create a switchback path, they’d be able to bring carts and horses down the slope. It would be far better than steps, so it was worth a try, but they’d need more help.\u003c/p\u003e\n\u003cp\u003e“You don’t know about this?” Reef said, beside him.\u003c/p\u003e\n\u003cp\u003e“No. I don’t.” Perry climbed the ladder to the roof. Kirra stood a dozen paces away, watching two of her men, Forest and Lark, rip up roof tiles. As he walked over, Perry’s anger built with every step. He felt more protective over this space than he did about his house. This was his perch.\u003c/p\u003e\n\u003cp\u003eKirra turned to face him, smiling. She rested her hands on her hips and tipped her head to the side.\u003c/p\u003e\n\u003cp\u003e“Good morning,” she said. “I saw the crack in the ceiling last night. I thought we’d take care of it.”\u003c/p\u003e\n\u003cp\u003eShe’d spoken louder than necessary, letting her voice carry. Her men looked over, sizing him up. They’d pulled off a section of stone tiles, exposing the battens beneath. Perry knew a dozen Auds in the clearing had heard her as well. It was no mystery what the tribe would think. Everyone knew that gap was above his loft.\u003c/p\u003e\n\u003cp\u003eHe drew a breath, forcing down his rage. She was changing something that didn’t need to be changed. He’d watched the Aether through that gap for as long as he could remember, but he couldn’t stop the work now. The sliver that had been a few inches wide had grown to a hole more than a foot across, exposing the inner beams. Through it, he could see the blankets in his loft below.\u003c/p\u003e\n\u003cp\u003e“Bear told me about a few other things we could take care of while we’re here,” Kirra said.\u003c/p\u003e\n\u003cp\u003e“Take a walk with me, Kirra,” he said.\u003c/p\u003e\n\u003cp\u003e“I’d love to.” The sound of her voice—sweet as nectar—chafed at his nerves.\u003c/p\u003e\n\u003cp\u003ePerry felt the eyes of people on them as they came down the ladder and crossed the clearing together. He took the trail to the harbor, knowing he’d find it empty. It was too early in the day for the fishermen to be back.\u003c/p\u003e\n\u003cp\u003e“I thought we’d make ourselves useful,” Kirra said when they stopped.\u003c/p\u003e\n\u003cp\u003eIt streaked him that she’d spoken first. “If you want work, come to me, not Bear.”\u003c/p\u003e\n\u003cp\u003e“I tried, but I couldn’t find you.” She lifted an eyebrow. “Does that mean you want us to stay?”\u003c/p\u003e\n\u003cp\u003ePerry had considered it all morning as he’d listened to Marron describe the work needed at the cave. He saw no reason to turn away a band of able-bodied people. If he was right about the Aether, they were on borrowed time.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said. “I want you to stay.”\u003c/p\u003e\n\u003cp\u003eKirra’s eyes widened in surprise, but she recovered quickly. “I was expecting you to fight me a little more. I wouldn’t have minded, actually.”\u003c/p\u003e\n\u003cp\u003eHer words were flirty, but her temper was difficult to read, an odd mixture of warm and cool. Bitter and sweet.\u003c/p\u003e\n\u003cp\u003eShe laughed, tucking a stray lock of her hair behind her ear. “You make me nervous, staring at me with those eyes.”\u003c/p\u003e\n\u003cp\u003e“They’re the only ones I have.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean that I don’t like them.”\u003c/p\u003e\n\u003cp\u003e“I know what you meant.”\u003c/p\u003e\n\u003cp\u003eShe shifted her weight, her scent warming. “Right,” she said, her gaze wandering to his chest and then to the chain at his neck.\u003c/p\u003e\n\u003cp\u003eHer attraction to him was real—there was no hiding that—but he couldn’t shake the feeling that she was trying to bait him.\u003c/p\u003e\n\u003cp\u003e“So where do you want us to work?” she asked.\u003c/p\u003e\n\u003cp\u003e“Finish the roof. I’ll show you the cave tomorrow.” He turned to go.\u003c/p\u003e\n\u003cp\u003eShe touched his arm, rooting him in place. A shot of adrenaline pulsed through his body. “Perry, it’ll be easier if we can find a way to get along.”\u003c/p\u003e\n\u003cp\u003e“We are getting along,” he said, and walked away.\u003c/p\u003e\n\u003cp\u003eAt supper, Kirra’s group was as rowdy as the previous night. The two men who had fixed the hole in Perry’s roof, Lark and Forest, came from the deep south, like Kirra did. They carried on loudly, telling jokes and stories back and forth in a battle of wits. By the time supper ended, they had the Tides cheering for more.\u003c/p\u003e\n\u003cp\u003eKirra fit right in with the Tides. Perry watched her laughing with Gren and Twig, and then later with Brooke. She even spent time talking with Old Will, turning his face red beneath his white beard.\u003c/p\u003e\n\u003cp\u003ePerry wasn’t surprised by how quickly she gained the Tides’ acceptance. He understood how relieved they were to have her there and wished he felt the same way, but everything she said and did made him feel like a target.\u003c/p\u003e\n\u003cp\u003eBear came over when the cookhouse had almost emptied, sitting across from Perry and wringing his huge hands. “Can we talk, Peregrine?”\u003c/p\u003e\n\u003cp\u003ePerry straightened his back at the formal tone in his voice. “Of course. What’s going on?”\u003c/p\u003e\n\u003cp\u003eBear sighed and wove his fingers together. “Some of us have been talking, and we don’t want to move to the cave. There’s no reason for it now. We’ve got food—enough to get us on our feet again—and Kirra’s people to help defend us. It’s all we need.”\u003c/p\u003e\n\u003cp\u003ePerry’s stomach churned. Bear had questioned his decisions before, but this felt different. This felt like something more. He cleared his throat. “I’m not changing my plan. I swore an oath to do what’s right for the tribe. That’s what I’m doing.”\u003c/p\u003e\n\u003cp\u003e“I understand,” Bear said. “I don’t want to go against you. None of us do.” He stood, his thick eyebrows knotted together. “I’m sorry, Perry. I wanted you to know.”\u003c/p\u003e\n\u003cp\u003eLater, at his house, Perry sat around the table with Marron and Reef as the rest of the Six played dice. They were in high spirits from another night of music and entertainment, their hunger sated for the second day in a row.\u003c/p\u003e\n\u003cp\u003ePerry listened absently as they passed around a bottle of Luster, joking with one another. The conversation with Bear had left him uneasy. As much as Wylan’s departure had hurt, watching Bear turn against him would be worse. He liked Bear. Respected him. It was much harder failing someone he cared about.\u003c/p\u003e\n\u003cp\u003ePerry shifted the chain around his neck. Suddenly, loyalty felt like such a fragile thing. He’d never thought he would need to earn it day in and day out. Though he didn’t forgive his brother for what he’d done, Perry was beginning to understand the pressure that had forced Vale to sell off Talon and Clara. He’d sacrificed a few for the good of the whole. Perry tried to imagine trading Willow to the Dwellers for solutions to his problems. Just the thought made him sick. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-ever-night-under-the-never-sky-2/page-28.html","bookId":1658,"creation":"Oct 5, 2019 6:55:20 PM","modification":"Oct 5, 2019 6:55:20 PM"}
