{"id":42500,"no":12,"title":"CHAPTER XII HOW VIVIAN ESCAPED","content":"\u0026nbsp;When Vivian Bell parted from Jim Rawdon he strictly followed the directions of his schoolmate. He went hurriedly to his room, made up a bundle of underclothing, and then crossing the grounds in nervous haste, started on the Bolton Road. \n\u003cdiv\u003e\n He knew the way, for he had often gone in this direction on holidays, usually with a company of his schoolfellows.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had hardly time to consider the importance of the step he was taking. He was animated by a feverish desire to get as far away as possible from the school where he was ill treated.\n\u003c/div\u003e \n\u003cdiv\u003e\n He feared and detested the head master, who, to the best of his remembrance, had never spoken a kindly word to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n He would never of his own impulse have dared to run away, but the stronger will of Jim Rawdon dominated him.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he hurried along on a rustic road between{99} two delightful hedge-rows, he looked backward from time to time with nervous apprehension, almost expecting to see the tall, gaunt figure of Dr. Musgrave following him in hot pursuit, or the red head and malicious face of his young tormentor, Simon.\n\u003c/div\u003e \n\u003cdiv\u003e\n But when a mile away he began to feel less apprehension. He was confident that Rawdon would somehow cover his flight and put the pursuers off his track.\n\u003c/div\u003e \n\u003cdiv\u003e\n An unwonted sense of freedom came to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, if I could get away entirely from Dr. Musgrave!” he thought. “I would be willing to work hard. Perhaps some farmer would engage me. I would not mind hard work as long as I was well treated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It is a very serious thing when a teacher who should be the guardian and guide of his pupils inspires dread and abhorrence. It is difficult to estimate how much unhappiness is occasioned by such unprincipled tyrants as Dr. Peter Musgrave, the head master of Milton School.\n\u003c/div\u003e \n\u003cdiv\u003e\n It seems a pity that they could not for a time change places with some of the pupils they abuse, as is done in the ingenious story, “Vice Versa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Vivian had walked about two miles when he was overtaken by the carrier in his cart.{100}\n\u003c/div\u003e \n\u003cdiv\u003e\n All the boys of Milton School knew Jack Hunt, who was a good-natured man of middle age.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going, Master Bell?” asked the carrier, slackening his speed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Vivian turned round and answered: “Won’t you ever tell, Jack?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I won’t,” answered Jack, stoutly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am running away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t mean it now, Master Bell?” exclaimed Jack, half incredulous.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Jack, it’s true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What! Running away from the schoolmaster?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Jack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll be danged if I blame thee, lad. He’s a brute, he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s treated me brutally, Jack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I say, Master Bell, I didn’t think thee had it in thee. Why, I didn’t think thee had the pluck to run away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I would, Jack, if it hadn’t been for Jim Rawdon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, yes, Rawdon. He’s a plucky lad. He wouldn’t let the master flog him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t think Dr. Musgrave ever flogged Rawdon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he’s flogged thee?”{101}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, many a time,” answered Vivian, shuddering. “Oh, he has beat me cruelly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like to get at him,” said Jack, shutting his teeth firmly together. “I’d like to get at him with a horsewhip, that I would!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But Simon is almost as bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the schoolmaster’s boy. I know that Simon. He’s got an ugly temper, he has. And he’s impudent, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you ever have any trouble with him, Jack?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The carrier laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s had trouble with me,” he answered. “I’ll tell you how it was. I was drivin’ along one day, just as you see me now, when Simon came up, and, just out of ugliness, picked up a stone and fired it at my ’orse. Well, I wouldn’t stand that, you know, so I jumps off my cart and I ran after the boy whip in hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he run away?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; he stood his ground. He thought I wouldn’t dare to hit him. So when I said: ‘Why did you go to do that?’ he answered, impudent like: ‘Because I chose.’ With that I took my whip and slashed him about the legs till he jumped and swore.”{102}\n\u003c/div\u003e \n\u003cdiv\u003e\n “You lashed Simon Musgrave?” asked Vivian, almost incredulous.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I did. Oh, wasn’t he mad, though! He threatened that he would tell his pa, and have me locked up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear that. It does me good! And you really and truly lashed Simon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ask him if I didn’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder he didn’t tell the doctor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told him I would have him arrested for stoning my ’orse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would like to have been there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Vivian Bell was far from being a vindictive boy, but it seemed to do him good to hear that his persistent young persecutor had for once had the same treatment meted out to him that he had so often inflicted upon others.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going, Master Bell?” asked the carrier, with a sudden thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Rawdon told me I’d better go to Farmer Glover’s, and ask him to take me in over-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And a good plan it is; but you’re only half way to Giles Glover’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m not tired, Jack. I shall be able to walk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s no need of walking. I’m going all the way there myself. So just jump up into my{103} cart, Master Bell, and I’ll have you there in a jiffy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Vivian was glad to accept this offer, and in a minute he was in the cart, riding beside Jack, the carrier.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I will get you into trouble, Jack,” said Vivian, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never you think of that, Master Bell. You don’t think the doctor’ll be flogging me, do you, now?” asked the carrier, with a broad grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I don’t think he would do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would like to see him try it, I would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he might refuse to employ you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As I am the only carrier hereabouts he wouldn’t do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you are very kind, Jack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And why wouldn’t I be? I’d help any of the schoolboys. There’s one thing I’d like to help them in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what’s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To flog the schoolmaster. That would be rare fun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So Vivian Bell and his good friend the carrier sped along till they came in sight of the farmhouse occupied by Giles Glover.\n\u003c/div\u003e \n\u003cdiv\u003e\n It so happened that the farmer himself was out in the yard when the carrier drove up.{104}\n\u003c/div\u003e \n\u003cdiv\u003e\n They greeted each other like old friends.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And whom have you got with you, Jack?” asked the farmer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got a boarder for you, farmer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t understand. Isn’t this one of Dr. Musgrave’s boys?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and he’s run away from school.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t say! And what for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because the doctor has been flogging him almost every day, till he’s tired of it. Will you take him in for a night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aye, that I will! But what are you going to do, lad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will wait here till Jim Rawdon comes. He will advise me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aye! I know Rawdon. He is a manly boy, Rawdon is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was he that advised me to run away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But have you any money, lad? You know you can’t get along without money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have a little money. I will pay you for taking me in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, you won’t, lad! Giles Glover wants no pay from a poor, persecuted lad. There’s plenty to eat here, and you’re heartily welcome to it. But have you nothing to live on? Where is your father, lad?”{105}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no father nor mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then who pays your bills?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My guardian.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then why don’t you go to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t. He lives in Bombay. That’s ever so many thousands of miles off. I have written to him, and I hoped to hear from him before this time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wouldn’t it have been better to wait?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t,” said Vivian, wearily. “It is four months since I wrote.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how will you get along?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I can get to London I will go to my guardian’s bankers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I will keep thee at any rate for a night or two, and it sha’n’t cost thee a penny.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon after Vivian’s arrival he sat down to a plentiful supper. He ate heartily, and his courage rose. He was surrounded by humble but cordial friends, and the atmosphere of kindness was as grateful as it was new to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n But it would not be long before his place of concealment would be discovered, and his foes be on his track.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82127.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
