{"id":42509,"no":21,"title":"CHAPTER XXI DEACON CRANE IS PERPLEXED","content":"\u0026nbsp;Mr. Fenwick was sitting at his desk when Deacon Crane called. The deacon expected to find him nervous and agitated, and was surprised to note that he was as calm and placid as usual. \n\u003cdiv\u003e\n “Take a seat, Deacon Crane,” said the minister.\n\u003c/div\u003e \n\u003cdiv\u003e\n The deacon seated himself in a rocking-chair and began to rock. It was his custom when he was excited.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hear, Mr. Fenwick, that your son Guy has got home,” he began.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Mr. Fenwick, with a smile of satisfaction. “Guy has got back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Rather unexpected, wasn’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, unexpected, but very welcome. It has brightened me up a good deal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has it? I thought perhaps you might have been disappointed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Disappointed to see Guy? Oh, no! no!”{173}\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know what I mean,” returned the deacon, with some asperity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean, of course, that it can’t be pleasant to have your son thrown on your hands when you thought he was earnin’ his livin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I must ask you to explain yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you wasn’t a minister, I might say that you seem a little dense,” said the deacon, impatiently. “However, I feel for you. You can’t afford to have a big boy eatin’ you out of house and home. I can find work for him on my farm, though, of course, I shouldn’t feel justified in payin’ much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are considerate, deacon,” said Mr. Fenwick, with a slight smile, “and perhaps I have misled you. Guy is not out of employment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No?” said the deacon, opening his eyes in surprise. “Do you mean to say that he has a position?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is in the employ of Mr. Saunders of Bombay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can that be?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was sent to New York on business by his employer, and took the opportunity of visiting me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This don’t seem a very likely story,” said the deacon, in a tone of disappointment. “Are you sure he isn’t deceivin’ you?”{174}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am quite sure,” answered Mr. Fenwick, with dignity. “Does your son ever deceive you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t neither here nor there. If he told me such a story as Guy has told you I would punish him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Guy doesn’t deceive me,” said the minister, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was annoyed with the deacon for his incredulity, but he understood Mr. Crane’s suspicious nature, also his dislike for Guy, and he was not surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “However,” continued the deacon, “that isn’t what I came over for. I hope you’ve considered the matter, and are resigned to my foreclosin’ the mortgage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not propose to allow the mortgage to be foreclosed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The deacon was surprised and angry. He felt that Mr. Fenwick was trifling with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I apprehend,” he said, “that it isn’t what you allow, Mr. Minister, but what I choose to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are mistaken, Deacon Crane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you goin’ to stop me foreclosin\u0027?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By paying the mortgage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got the money?” asked the deacon, his jaw dropping.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”{175}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who lent it to you? Was it Mr. Ainsworth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think, Deacon Crane, that that is a question which you have any right to ask.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, if you don’t want to tell,” said the deacon, in a tone of disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know that I have any objection to tell you, though, as I said, it is not a question which you have a right to ask. Guy lent it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Guy lent it to you?” repeated the deacon, in an amazement which was almost ludicrous.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Fenwick,” said the deacon, severely, “I thought you’d be above takin’ from Guy his employer’s money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think, Deacon Crane, that you are guilty of great impertinence in hinting such a thing!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This to me?” ejaculated the deacon, wrathfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. You are speaking in a way I shall not permit. We will, if you please, proceed at once to business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Fenwick displayed such unusual spirit that Deacon Crane was electrified.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The minister’s gettin’ on his high horse,” he said to himself. “It’s a mystery to me where Guy got so much money. I won’t rest till I find out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The money was paid, and Mr. Fenwick breathed{176} a sigh of relief when he realized that his little property was at last free from incumbrance.\n\u003c/div\u003e \n\u003cdiv\u003e\n Deacon Crane left the house in a state of bewilderment even exceeding his disappointment. How on earth Guy could have come to his father’s assistance he could not understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n He determined to question the minister’s son at the first opportunity.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had not long to wait.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had walked but two hundred yards when he met Guy sauntering along with a pleasant smile on his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here, you, Guy!” he called out, unceremoniously. “Your father tells me you have lent him five hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you don’t doubt my father’s word,” said Guy, amused by the deacon’s evident perplexity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t doubt it, for I’ve got the money in my wallet. The question is, where did you get it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that is the question.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you got to say for yourself?” demanded the deacon, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only that I was very glad to oblige my dear father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t mean that. Where did you get the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “From my employer.”{177}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aha! That’s what I thought. Don’t you know you’re likely to be arrested for makin’ such poor use of your employer’s money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you’re mistaken, Deacon Crane. It was not my employer’s money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just now you said it was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I didn’t. I said I got it from my employer. The money was mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean to say he gave it to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but not as a gift. I was and am still in his employ.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I s’pose he gives you five or six dollars a week. You can’t save any five hundred dollars out of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true, Deacon Crane. You are a good mathematician. He pays me very handsomely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old be you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seventeen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All that I can say is that he must be a fool to pay a big salary to a boy like you, and you are very foolish to give up all the money you have to your father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a little money left,” said Guy, smiling. “If, now, you were in a tight place, I might be able to lend you a hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am never in a tight place,” returned the deacon, proudly, “but I think it would be wise and{178} prudent for you to put the money in my hands for safe keeping. I’ll be willin’ to pay you three per cent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Deacon Crane, but I can do better than that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seem to be a very reckless boy, Guy Fenwick. You don’t seem to have no judgment. You won’t keep that money long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid, Deacon Crane, you haven’t much confidence in me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I haven’t. Your father ain’t practical, and you take after him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy smiled and passed on.\n\u003c/div\u003e \n\u003cdiv\u003e\n During the afternoon he fell in with Noah Crane, who had heard from his father the astonishing news about Guy’s prosperity. It influenced that young man to seek an intimacy with his fortunate schoolfellow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, Guy,” he began, “is it true that you’ve got a lot of money? Pop tells me you’ve been lending your father five hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you offered to lend pop one hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he declined.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’ll be all the same if you lend it to me,” said Noah, eagerly.{179}\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want to do with it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to buy a bicycle. I can get a safety, second-hand, for seventy-five dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How could you pay me back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess I can get the money out of father next year. Do now, that’s a good fellow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you can get for me your father’s note of hand for the money and interest, say on a year’s time, I might consent to do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he won’t give it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I can’t lend you the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Noah pleaded, but in vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later Guy had a pleasant surprise. Coming up the road from the station he met Captain Grover of the Osprey.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82136.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
