{"id":42511,"no":23,"title":"CHAPTER XXIII ON THE WAY TO NEW BEDFORD","content":"\u0026nbsp;On the way to New Bedford, Guy broached the subject of engaging the Osprey to visit the Agalegas Islands during her next cruise. \n\u003cdiv\u003e\n “Then Mr. Saunders believes in the buried treasure?” said Captain Grover.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He thinks there is a fair chance of it existing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me understand, then. He is willing to pay for the extra time the voyage will be prolonged in order to make this side trip?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, captain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think it will be a wildgoose chase, for my part,” remarked the captain, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, but Mr. Saunders seems willing to take the risk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, he is certainly able to do so. He is a very rich man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any idea how rich?” asked Guy, with natural curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard it conjectured that he is worth a million pounds.”{187}\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is five million dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a great deal of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “True. Of course, it is only conjecture, but it is just as likely that he is worth more as that he is worth less.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think there is no doubt that he will be able to pay me my salary, then,” said Guy, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is not much doubt about that. It occurs to me as strange, since he is so rich, that he should take any trouble about this treasure, which may not exist, after all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I really think, Captain Grover, that Mr. Saunders cares very little about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, then, should he incur such an outlay in searching for it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will tell you what I think. Though of very little importance to him, it is of a great deal of importance to me. I think it is this consideration that influences him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And very properly, too, since you saved his life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be, but I appreciate his kindness, nevertheless.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A little later Guy asked: “Do you think your owners will be willing to make an arrangement for this side voyage?”{188}\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on two things: First, whether Mr. Saunders will pay a sum that will compensate them for their trouble; and secondly, whether he will be able to pay the terms they may ask.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There can be no doubt as to the last.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; and this I will assure them. I have known for years Mr. Saunders’ financial standing, and his strict sense of honor. You have documents to show that you are his accredited agent?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, captain. Besides, I can refer them to Mr. Frazer, his New York correspondent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He, too, is well known. There will be no difficulty on that score.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you seen this Captain Richmond?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; but I shall probably meet him to-day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I were going to sail with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So do I; but you see how I am situated. If you were willing to wait six months——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I could not do that. I could not remain idle for so long. Besides, I don’t think Mr. Saunders will approve it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we will drop that idea. I will introduce you to my owners, and speak a good word for you. I am sure if they agree, they will be reasonable in their charges.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How soon will the Osprey be ready to start again?”{189}\n\u003c/div\u003e \n\u003cdiv\u003e\n “In about two weeks. By the way, Guy, I have a suggestion to make.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose you find the island and the treasure, you can’t take charge of it single-handed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been thinking about that, and it puzzled me. What would you advise me to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I advise you to take two good, strong, reliable men with you who will be able and willing to co-operate with you in carrying out your plans. A boy, single-handed, would be at the mercy of designing or dishonest men.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you were sailing with me, you would need no one else, as I would see that no one interfered with you; but that cannot be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where can I find any such men as you speak of? Do you know anyone you can recommend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Grover looked thoughtful. Finally his face lighted up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said. “I think I can find someone. I have a brother-in-law, Abner Titcomb, living in Vernon, Maine, who is at present out of employment. He is a blacksmith by trade, and naturally a strong, muscular man. I think he would be glad to accept an appointment, if you would feel authorized to pay him good, fair wages.”{190}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would do so. Now as to the second man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will be best to leave the selection to Abner. No doubt he can find some personal friend in the village who will be as well fitted as himself for the work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That strikes me favorably.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; when you have made an arrangement with the owners, and it is fully settled that you will go, I will write to Abner to come right on and talk the matter over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Captain Grover. You are doing me a great service.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know, Guy, I can’t help wondering whenever I think of you, a boy of seventeen, with such a load of responsibility on his shoulders. Why, only a few months ago, I thought of you as a mere schoolboy. Now you are the leader of a very important expedition. There are men who would not be competent to fill the place that has been assigned to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not certain that I am competent myself,” said Guy, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure you will do your best. You are not afraid? You have no misgivings as to the outcome?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. On the contrary, I think I enjoy the prospect.”{191}\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will help you to succeed. But here we are at the station. I will conduct you to the office of my owners, John and Charles Gray.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82138.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
