{"id":42491,"no":3,"title":"CHAPTER III GUY TAKES THE FIRST STEP","content":"\u0026nbsp;Guy drew a long breath when he had read thus far in the manuscript, and then plunged into it again. \n\u003cdiv\u003e\n When I heard this stated I could not help feeling an emotion of pity for the poor fellow who would never have the benefit of the large treasure to which he had become heir. I could not understand exactly why he had revealed all this to me, but he soon made it plain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall not live to enjoy it,” he continued, “but I don’t want the secret to die with me. I would like to have it benefit someone not utterly a stranger. You have been kind to me, and to you I will give all right and will to this great property.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how shall I find it?” I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have prepared a document,” he replied, “in which I describe the island, and the particular part{20} of the island where the treasure is concealed. Put your hand into the pocket of my blouse, and you will feel a folded paper. Take it, and some day I hope you will be fortunate enough to find the place where the booty is secreted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n I thanked him, though I was almost too bewildered to realize that a secret had been communicated to me that might make me fabulously rich.\n\u003c/div\u003e \n\u003cdiv\u003e\n That very night Antonio died. His body was sewed up in a sack, as is the custom, and thrown into the sea. Of all who witnessed it, I was the only one who had a kindly feeling of regret for the poor fellow.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whether I shall ever be able to make any use of this information, I do not know. It would require a considerable outlay in money to fit out an expedition, and I have very little chance of inducing anyone to make this outlay. I have, however, written out an account of the sailor’s revelation to me, in the hope that someone, perhaps after my death, may seek and obtain a treasure which I think must be of fabulous amount.\n\u003c/div\u003e \n\u003cdiv\u003e\n (Signed) George Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy read this letter with breathless interest. He took in the full importance of its contents.\n\u003c/div\u003e \n\u003cdiv\u003e\n He realized that by the death of his uncle he{21} became the next heir to this far-away treasure. What should he do about it? With him there was the same embarrassment and the same difficulty that his uncle had experienced.\n\u003c/div\u003e \n\u003cdiv\u003e\n The treasure he fully believed in, but it was located thousands of miles away on a small island in the Indian Ocean.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was tantalizing to reflect that it existed, and might make him rich, when it seemed wholly beyond his grasp. All the capital he could command was about twenty-five dollars in the Bayport Savings Bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next question was: Should he tell his father of the discovery he had made? It might be his duty to do so. He did not know as to that.\n\u003c/div\u003e \n\u003cdiv\u003e\n His father had given him full permission to open and examine the chest and its contents. Possibly the papers and the secret belonged to him, but he knew very well that they would be of no earthly benefit to a quiet country minister who lived in his books and his study.\n\u003c/div\u003e \n\u003cdiv\u003e\n To him—Guy—on the other hand, it might prove of value. He did not know when or how, but he was young, and to the young all things are possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n So, after thinking the matter over fully, Guy resolved to keep the matter secret.{22}\n\u003c/div\u003e \n\u003cdiv\u003e\n He glanced at the second paper, and found that it was a minute description of the island, but he had not got far enough along to feel interested in this. It would keep.\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy went downstairs slowly, plunged in thought. He hoped his father would not ask about the contents of the chest, but he need not have felt alarmed. The matter had passed entirely out of the minister’s thoughts.\n\u003c/div\u003e \n\u003cdiv\u003e\n In order the better to think over the wonderful revelation, Guy went out for a stroll. Like many older persons, he found a walk was favorable to thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n He walked slowly up the street to the post office. At the corner of the second street, just opposite the dry goods store, he met a boy whom he had never liked.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Noah Crane, the son of Deacon Crane, already referred to as desiring a younger minister.\n\u003c/div\u003e \n\u003cdiv\u003e\n The thought of the deacon’s wish to drive his father from Bayport was not calculated to increase Guy’s friendship for the son. Yet he would be courteous, being naturally a gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going, Guy?” asked Noah.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am only taking a walk.”{23}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some other people may have to take a walk,” said Noah, with a coarse laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” asked Guy, coloring, for he knew to what the deacon’s son referred.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I guess I’d better not tell,” replied Noah, in a tantalizing tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you please,” said Guy, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Noah was disappointed, for he wanted Guy to ask him a question which he was very ready to answer. Guy’s indifference piqued him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll know soon enough,” added Crane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case I will be content to wait.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know that I have any objection to tell, though. I mean your father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take care how you talk about my father,” said Guy, angrily. “I won’t stand it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, is your father so high and mighty that he can’t be spoken about?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He can be spoken about—respectfully.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you think he’s a great man because he’s a minister.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I rank a minister higher than a deacon,” retorted Guy, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You do, hey? Why, my father could buy out your father two or three times over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be; but what does that prove?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It proves that you’d better be careful how you{24} talk. I heard my father say the other day that the people wanted a new minister—a young man that would make things lively. I shouldn’t wonder if your father’d have to take a walk before long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I am certain that you’ll have to walk pretty fast if you don’t want to feel the force of my fists.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy advanced toward Noah so menacingly that the latter took counsel of prudence and retreated hastily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Keep away from me, you bully!” he cried, “or I’ll tell my father!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy laughed, and walked away, not caring to have any difficulty with Noah. What the deacon’s son had said, however, furnished him food for reflection.\n\u003c/div\u003e \n\u003cdiv\u003e\n Things began to look serious. There was evidently a movement on foot to get rid of his father, and this movement was headed by Deacon Crane, a man of influence in the parish and the town.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I could only get hold of this treasure, say within a year,” thought Guy, “I would snap my fingers at the deacon. It would make me rich, and if I were rich my father would be rich, too, and independent of the parish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The “if,” however, though a very short word, was a very important one. It seemed about as{25} practicable to go in search of the treasure as to undertake a journey to the moon, and no more so.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Guy went home to dinner he found Captain Grover, an old schoolmate of his father, a guest at the parsonage.\n\u003c/div\u003e \n\u003cdiv\u003e\n The captain and his family lived in New Bedford, and he was about to start on a voyage from there. Happening to be in Bayport on a little private business, he called on the minister. Unlike some shipmasters, he was a man of a kindly nature, and was a favorite with Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So here is Guy,” he said, as the boy entered. “Bless my soul, Guy, I shouldn’t have known you if I had met you out of Bayport, you have grown so. What are you going to do with him, Brother Fenwick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would like to send him to Harvard, John,” replied the minister, “but there doesn’t seem to be any chance of that,” he added, with a sigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I am not rich enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, college is all very well, but there are other things that are good for a boy. If I had a son, I don’t think I would send him to college.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I agree with you, Captain Grover,” said Guy, promptly.{26}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your uncle George was a sailor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you ever think you would like to go to sea?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I should like to be a sailor, but I should like to go to sea for a single voyage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would do you good. You’d learn more in a year at sea than in double the time on land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I think, sir. When do you start on your next voyage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Next week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In what direction shall you go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall go to India—probably stopping at Bombay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will your course lie through the Indian Ocean?” asked Guy, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I always wished I could sail over the Indian Ocean,” said Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it is an interesting voyage. Are you through school?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I finished last week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll tell you what, Guy; if your father’ll let you go, I’ll take you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, father, may I go?” asked Guy, in a tone of earnest appeal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go to India?” exclaimed the minister, bewildered by the suggestion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; it would make me very happy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the end, Guy, seconded by the captain, carried his point, and obtained his father’s consent. He had, as we know, his own reasons for wishing to make this voyage. It was something more than a boy’s love of adventure.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next week the Osprey sailed with Guy as a passenger. He quickly established himself as a favorite with the sailors. He was so bright, handsome, and intelligent, that he seemed like a gleam of sunshine, making the whole ship cheerful.\n\u003c/div\u003e \n\u003cdiv\u003e\n He cultivated the acquaintance of the crew, plying them with questions, and often might be seen engaged in an animated discussion with veteran sailors who were always ready to spin a yarn for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Grover viewed all this with an indulgent smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid, Guy,” he said one day, with a laugh, “that you are picking up so much knowledge you will try to supersede me on the next voyage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will take more than one voyage to qualify me for a captain,” returned Guy. “Still, if you need help, call on me.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82118.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
