{"id":42523,"no":35,"title":"CHAPTER XXXV THE CRUISE OF THE OSPREY","content":"\u0026nbsp;Guy and his two companions looked at one another, with pale faces and sinking hearts. \n\u003cdiv\u003e\n “What does it mean?” Guy faltered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It means,” said Abner, hoarsely, “that that fiend, Captain Richmond, has served us as he did the poor sailor, John Wolf.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he can’t have gone away for good! He will come back!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy spoke hopefully, but he did not himself believe what he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as we had succeeded, too!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If we had only made the discovery yesterday; but now it is too late!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boys,” said Abner Titcomb, “let us sit down and discuss our position as calmly as we can. If there is any favorable side to it let us try to find it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But is there any?” sighed Luke Clark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; to begin with, we sha’n’t starve. The{277} products of the island will sustain us, as they did John Wolf.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But life won’t be worth sustaining if we have to live as he did. We may be driven, like him, to throw ourselves into the sea.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was alone, and there are three of us. Besides, our fate will be known to the whole ship’s crew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t understand why the mate permitted it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No doubt he protested, but what could he do? In a conflict of authority between the captain and the mate the latter must go to the wall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then what hope is there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As soon as the ship reaches Bombay someone on board will notify Mr. Saunders of what has happened.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Frank Low would do that, if there were no one else,” said Guy, beginning to be hopeful.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and he would send for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But weeks must pass before help can arrive.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “True; and they will seem more like months; but I am sure all will come right in the end.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Meanwhile,” said Guy, recovering in a measure from his depression, “we must adapt ourselves to circumstances, and make ourselves as comfortable as we can.”{278}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us begin, then, by taking lunch. We have been so occupied with the treasure that we have forgotten to eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile the Osprey was speeding from the island, and was already fifty miles away. Everyone on board, even to the humblest sailor, looked grave. Everyone was thinking of poor Guy and his companions on their island prison.\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy was a general favorite, partly on account of his good looks, partly on account of his bright, kindly ways, and indignation against the captain on account of his cruel and inhuman course was general and intense.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the time came for dinner, the captain sat down to it alone. Mr. Forbush, the mate, excused himself on the plea that he had no appetite.\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Richmond was angry, for he penetrated the mate’s objection to sitting down with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you please, Mr. Forbush,” he said, in a tone of irritation, “but you are acting very foolishly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may regard it in that light, if you choose, Captain Richmond,” returned the mate, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you anything to say to me?” asked the captain, defiantly.{279}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have already expressed my opinion of your course,” said Forbush, frigidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know what I am about,” blustered the captain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have said that before. I can only repeat that I am glad of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you mean to dispute my authority,” said the captain, in a quarrelsome tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait till I do, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Richmond swore softly to himself, and eyed the mate with a glance far from friendly.\n\u003c/div\u003e \n\u003cdiv\u003e\n So the day passed, and another dawned.\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Richmond was unusually irritable. He saw that all on board looked at him askance. The sailors obeyed him, so that he had no excuse for complaint, but there was an utter absence of cordiality, and he was in the position of a social outcast who is “sent to Coventry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This is not a pleasant position for anyone, least of all for an arrogant and ill-tempered man like Captain Richmond. While it cannot be said that he regretted his inhuman conduct, he was angry at the unpopularity he had acquired through it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Besides, he could not doubt that it would be reported at Bombay, and the matter perhaps brought to the attention of the American consul. Whenever he thought of this he felt vaguely uncomfortable,{280} but he was too self-willed to retrace his course and thus admit himself to be in the wrong.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is all this going to end, Mr. Forbush?” asked the boatswain one day. “Are those poor fellows to be left to their fate?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered the mate, firmly. “I shall report the matter when we reach Bombay, and I will agree to head an expedition for their relief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how will they get along meanwhile? Won’t they starve?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. Titcomb told me that the island produced enough to sustain life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will not Captain Richmond be punished?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I earnestly hope so. If my representations will effect it, he will lose his command.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man must be a fiend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is getting worse and worse. He does not treat me with ordinary civility, and he is beginning to abuse the men. He has not a pleasant word for anyone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was indeed true that Captain Richmond was becoming more despotic and tyrannical than ever. On the least provocation he would fell a seaman to the deck or launch a volley of curses at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n As a consequence, there were more angry looks than ever directed toward him as he paced the deck{281} with hasty strides, shaking his head, and muttering words that could not be understood.\n\u003c/div\u003e \n\u003cdiv\u003e\n One day he treated with unusual brutality the Italian sailor already referred to, Guido Leporelli.\n\u003c/div\u003e \n\u003cdiv\u003e\n Guido was a short man, not much over five feet in height, and the captain probably regarded him with contempt, as one whom it would be safe to bully. In personal strength, Leporelli was as a mere child compared to the robust captain, but he had his share of the fiery and revengeful spirit that characterizes a large number of his countrymen.\n\u003c/div\u003e \n\u003cdiv\u003e\n On this day the mate caught the glance with which he regarded the captain. It made him shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should not like to make an enemy of Leporelli,” he said to himself. “I think he means mischief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in his mind to warn Captain Richmond of his danger, but he reflected that, should he do so, it would bring upon the Italian worse treatment than ever, and he was not willing to run this risk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The captain must take his chances,” he decided.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was on the morning of the ninth day after leaving the island that Captain Richmond, in pacing the deck, came upon Leporelli. The Italian{282} was moving at a slow pace, for he had a rheumatic affection in his left leg.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Move faster, you lazy hound!” said the captain, roughly, and he dealt the little Italian a cruel blow in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n The eyes of Guido Leporelli blazed with wrath. With a smothered ejaculation in his native tongue he pulled out a murderous-looking knife, which he had been carrying for several days, and in a flash it was buried in the breast of the burly captain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Richmond fell forward, dying almost instantly, for the knife had penetrated his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n A smile of supreme satisfaction overspread the Italian’s face as he saw his brutal tormentor dead at his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am avenged!” he cried. “Now I am ready to die!”\n\u003c/div\u003e \n\u003cdiv\u003e\n With the blood-stained knife still in his hand he ran to the edge of the vessel and sprang into the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n No one tried to prevent him, and no one tried to rescue him. His life was forfeited by his act, and the mate, who was now bending over the captain, felt that his self-punishment was the speediest settlement of a troublesome complication.\n\u003c/div\u003e \n\u003cdiv\u003e\n The captain was raised and carried to his cabin. Restoratives were applied, but in vain. It soon{283} became evident that the Italian’s thrust was fatal. Death had been instantaneous.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a frown on the captain’s face that made it repellent, yet natural, for his countenance in life had been seldom without it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Forbush assumed command, as his position required. The captain’s body was sewed up in sailcloth and committed to the deep, the ex-mate reading the burial service.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the crew were summoned to meet the new captain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Men,” said Captain Forbush, “the captain’s death has made me your commander.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was an attempt at applause, but with a wave of his hand Mr. Forbush stopped it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall try to deserve your confidence and good will,” he continued. “Of the dead let us think and speak only in pity. He had his faults, but he has been terribly punished. It is proper for me to state, as I take command, that I shall immediately reverse the ship’s course and return to the island for Guy Fenwick and his two companions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then there was a burst of approving cheers which Captain Forbush did not check.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82150.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
