{"id":42524,"no":36,"title":"CHAPTER XXXVI RESCUED","content":"\u0026nbsp;Meanwhile, the three prisoners on the island were passing their time dismally enough. There was actually nothing for them to do except to seek enough of the produce of the island to sustain life. \n\u003cdiv\u003e\n This they were able to do, but they soon tired of their monotonous bill of fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would give something for a good New England breakfast,” said Abner Titcomb, one morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Baked beans and brown bread?” suggested Guy, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; or fishcakes, rolls, and coffee—anything substantial, instead of these sweet, cloying fruits.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I agree with you, Abner,” said Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure I do,” added Luke Clark.\n\u003c/div\u003e \n\u003cdiv\u003e\n It may seem strange that they had never made a second visit to the place where the treasure was concealed; but it had lost its attractions for them.\n\u003c/div\u003e \n\u003cdiv\u003e\n They did not even speculate as to its value. It was absolutely worthless to them in their present condition.{285}\n\u003c/div\u003e \n\u003cdiv\u003e\n They spent most of their time on the summit of the hill, looking out to sea in search of a ship. They felt that the Osprey would be sent back for them, but it was long to wait. If they could get off sooner, so much the better.\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner Titcomb had a marine glass with him, and this helped them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Once with his glass he espied a ship, a mere speck in the distance, and there was hope that it would come nearer the island.\n\u003c/div\u003e \n\u003cdiv\u003e\n They tried to signal it, but it was too far away, and no heed was paid to the white sailcloth that they hoisted above the hill on a branch of a tree. This was a severe disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Wolf was here four years without signaling a sail,” said Luke Clark, in a tone of discouragement. “There seems to be little hope for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So day followed day, and each one seemed longer than the last.\n\u003c/div\u003e \n\u003cdiv\u003e\n They liked to sit and talk of their New England homes, and all that made them attractive. They tried to fancy how those who were dear to them were occupied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father is writing his sermon for Sunday,” Guy would say on a Saturday morning. “What would he think if he could know where I am?”{286}\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is well he doesn’t know, since he could do you no good,” rejoined Titcomb.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; it would only make the dear old man unhappy. I don’t want him to know it till he also knows that I am safe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long is it since we were left here?” asked Luke Clark. “Have you kept the record?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, this is the seventeenth day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And we are still alive! Well that’s a comfort, any way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner Titcomb had been using his glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boys!” he said, suddenly, in a tone of excitement, “I see a sail!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?” exclaimed Guy and Luke Clark together.\n\u003c/div\u003e \n\u003cdiv\u003e\n Titcomb pointed in a direction east by south.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look again! Notice if it seems to be approaching the island.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was silence for five minutes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said, “it seems to be coming toward us. Here, Guy, your eyes are better than mine; take the glass, and see whether I am right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy took the glass and turned it in the direction of the ship.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Abner! Luke!” he said, in a tremulous voice. “I think it looks like the Osprey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me the glass—quick!” said Luke.{287}\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a long look seaward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, well! What do you make out?” asked Abner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think Guy is right. It does look like the Osprey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it can’t be! There has not been time for her to go to Bombay and return.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was evident, and they felt that they could not be correct.\n\u003c/div\u003e \n\u003cdiv\u003e\n But half an hour later it was clear that the ship was steering for the island. An hour later all were sure that it was the Osprey.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us raise our signal and then go down to the beach,” said Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n His suggestion was followed. Leaving the signal on the summit of the hill, they made their way downward, through the belt of woods, to the shore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Still one or another looked through the glass until doubt became certainty, and the familiar form of the Osprey was clearly to be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank God!” said Titcomb, fervently.\n\u003c/div\u003e \n\u003cdiv\u003e\n No sooner was the Osprey near enough than a boat was lowered. Among those it bore were Forbush and Frank Low.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they landed, the three prisoners rushed joyfully to greet them.{288}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then Captain Richmond relented?” said Guy. “He repented of his inhuman course?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Captain Richmond is dead,” said Frank Low, gravely. “Mr. Forbush is now captain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how did he die? Was he stricken with disease?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He fell a victim to his brutality. He was stabbed to the heart by Leporelli, whom he had abused.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Captain Forbush who said this.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As soon as I took command I ordered the ship’s course to be reversed, and I came here in search of you. I will give you a reasonable time to find the treasure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Captain Forbush, the treasure is found!” said Guy. “To-morrow I will ask you to lend me the assistance of two of your sailors to carry it on board the Osprey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shall have it,” said the captain, promptly. “I congratulate you, Guy, on your success.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2979/82151.html","bookId":344,"creation":"Aug 11, 2019 6:03:47 AM","modification":"Aug 11, 2019 6:03:47 AM"}
