{"id":73346,"no":5,"title":"Page 5","content":"\u003cp\u003eAnd weirdly, watching my sister do something that made her feel so happy made me feel sane, too.\u003c/p\u003e\n\u003cp\u003eEmma leaned forward and tilted her chin. Ethan moved close. But suddenly, a metal ic clinking noise rang out from the other side of the fence. Emma whipped around and squinted. A long-legged figure slithered between two oak trees.\u003c/p\u003e\n\u003cp\u003e“hello?” she called, her pulse inching up a notch.\u003c/p\u003e\n\u003cp\u003e“Who’s there?”\u003c/p\u003e\n\u003cp\u003eEthan jumped to his feet, jammed a few quarters into the machine, and turned on the lights. They were so bright that Emma had to shade her eyes for a moment. They both scanned the court, the silence deafening. The basketball game had stopped, and there wasn’t even any traffic on the road. How long had it been quiet like this? How loudly had she and Ethan been talking? Had someone heard?\u003c/p\u003e\n\u003cp\u003eWhen the figure emerged from the trees, Emma grabbed Ethan’s arm and stifled a scream. Then her eyes adjusted. She saw a girl in black leggings, a metal ic sports bra, and white sneakers. Her blonde hair was in a high ponytail, and she jogged in place as though she’d just arrived. Emma’s mouth dropped open. It was Laurel.\u003c/p\u003e\n\u003cp\u003eLaurel’s eyes widened at Emma and Ethan. After a moment, she raised her hand and gave a four-finger wave.\u003c/p\u003e\n\u003cp\u003e“Oh, hey, guys!” She said it as though she hadn’t been eavesdropping on them, but Emma knew better.\u003c/p\u003e\n\u003cp\u003eI did, too. Especially when Laurel mouthed Caught ya! , before popping her iPod earbuds back into her ears. Then, ponytail swinging, she darted through the trees and disappeared.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eHOMECOMING\u003c/p\u003e\n\u003cp\u003eHANGOVER\u003c/p\u003e\n\u003cp\u003eOn Monday morning, the Holl ier High campus looked like it was still recovering from Friday night’s Homecoming festivities. The school had a tradition of throwing a Hall oween-themed dance, and remnants of the raucous evening were everywhere. A lone strand of bright-orange crepe paper fluttered from a windowsil outside the gym. A set of discarded fangs lay in a patch of grass. The remains of a burst black ball oon were splattered on the cement sidewalk. And a wad of pink gum was stuck to the loincloth of the granite statue of a Native American that trickled water in the courtyard.\u003c/p\u003e\n\u003cp\u003e“This place looks hungover,” Emma murmured.\u003c/p\u003e\n\u003cp\u003eLaurel, who was sitting next to her in the driver’s seat of the VW Jetta, didn’t even snicker. She was Emma’s ride to school until Emma figured out where Sutton’s car had disappeared to—it had been impounded for unpaid tickets sometime before Sutton went missing, but Sutton had allegedly retrieved it from the impound the night she died.\u003c/p\u003e\n\u003cp\u003eThe car had been missing ever since.\u003c/p\u003e\n\u003cp\u003eEmma had tried to make small talk with Laurel on the ride over—she didn’t dare confront Laurel about spying on her and Ethan in the park on Saturday, even though she was dying to know what she’d heard. But Laurel had just stared stiffly ahead, her jaw set and her eyes narrowed, not wanting to talk about the new Beyoncé single or how Maybel ine Great Lash mascara didn’t hold a candle to DiorShow.\u003c/p\u003e\n\u003cp\u003eSighing, Emma stepped out of the car and veered around a forgotten Mardi Gras mask. She was so sick of Laurel’s hot-and-cold moods. Last week, she and Laurel had gotten along swimmingly, and it seemed that whatever bitter rivalry there’d been between Sutton and Laurel was beginning to dissolve, but Thayer’s appearance had set them back ten paces. Emma missed smiling at Laurel at breakfast, doing their makeup side-by-side at the bathroom mirror in the morning, and singing along to the radio on the drive to school. Laurel had given her a taste of what having a sister could be like, something she’d never had.\u003c/p\u003e\n\u003cp\u003eAs she crossed to the front lawn, she noticed everyone was buzzing excitedly. One name cropped up over and over: Thayer Vega.\u003c/p\u003e\n\u003cp\u003e“Did you hear Thayer was arrested for breaking into the Mercer house?” a girl in a faux-fur vest whispered.\u003c/p\u003e\n\u003cp\u003eEmma froze and ducked behind a column, wanting to hear the conversation.\u003c/p\u003e\n\u003cp\u003eThe girl’s friend, a guy with a pronounced widow’s peak, nodded excitedly. “I heard it was a huge set-up.\u003c/p\u003e\n\u003cp\u003eSutton knew he was coming all along.”\u003c/p\u003e\n\u003cp\u003e“Where do you think he’s been?” Faux Fur asked.\u003c/p\u003e\n\u003cp\u003eWidow’s Peak shrugged. “I heard he went to ll.A. to make it as a male model.”\u003c/p\u003e\n\u003cp\u003e“No way.” A junior girl with frizzy blonde hair had joined Widow’s Peak and Faux Fur. “He was mixed up in a Mexican drug cartel and got shot in the leg. That totally explains the limp.”\u003c/p\u003e\n\u003cp\u003e“That makes sense.” Widow’s Peak nodded sagely.\u003c/p\u003e\n\u003cp\u003e“Thayer probably broke into Sutton’s bedroom to steal her laptop to pay off his drug-lord debt.”\u003c/p\u003e\n\u003cp\u003eFaux Fur rolled her eyes. “You guys are lame. He broke into Sutton’s room because they had unfinished business. She was the reason he left.”\u003c/p\u003e\n\u003cp\u003e“Sutton?”\u003c/p\u003e\n\u003cp\u003eEmma whirled around and saw Charlotte advancing toward her. The three kids who had been talking about Sutton flinched as they spotted Emma behind a column.\u003c/p\u003e\n\u003cp\u003eOther kids passing by stared at her curiously. A couple of guys chuckled.\u003c/p\u003e\n\u003cp\u003eI had a feeling this wasn’t the response I used to get when I walked through the halls of Holl ier. People might have whispered about me, but no one would have dared laugh.\u003c/p\u003e\n\u003cp\u003e“News travels fast, doesn’t it?” Emma said as Charlotte fell in step beside her. Emma tugged at the hem of Sutton’s gray pinstriped short shorts. If she’d known she would be so ogled today, she wouldn’t have worn an outfit quite so revealing.\u003c/p\u003e\n\u003cp\u003e“News like this does.” Charlotte adjusted a wave of silky red hair over her shoulder and handed Emma a Starbucks latte. Then she glared at a goth girl who was gaping at Emma. “Is there a problem?” she asked in a pinched tone.\u003c/p\u003e\n\u003cp\u003eThe goth girl shrugged and slunk away. Emma shot Charlotte a grateful smile as the girls settled on a bench. It was times like this when Emma appreciated Charlotte’s flinty bitchiness. She was the loudest and most controlling of their clique, the kind of girl who you desperately wanted on your side and didn’t dare cross. In Emma’s old life, she’d known plenty of girls like Charlotte, but only from afar.\u003c/p\u003e\n\u003cp\u003eMostly, the Charlottes of the world looked at Emma like she was some kind of foster-girl freak.\u003c/p\u003e\n\u003cp\u003eCharlotte sipped from her own cup of coffee and looked around the lawn. “What a mess,” she murmured.\u003c/p\u003e\n\u003cp\u003eThen her green eyes widened. Emma followed her gaze and saw Madeline stepping from her SUV. She straightened to her full height as she walked through a mob of gaping students.\u003c/p\u003e\n\u003cp\u003e“Mads!” Charlotte called, waving.\u003c/p\u003e\n\u003cp\u003eMadeline turned her head and froze at the sight of Charlotte and Emma. For a split second, Emma thought she was going to spin and run in the opposite direction. But then she strode toward them with all of her ball et-dancer grace and settled next to Charlotte on the bench.\u003c/p\u003e\n\u003cp\u003eCharlotte squeezed her hand. “How are you doing?”\u003c/p\u003e\n\u003cp\u003e“How do you think?” Madeline snapped. She was impeccably dressed in a tight-fitting cashmere sweater and navy shorts ironed within an inch of their life, but her alabaster skin looked even paler than usual. Then Emma noticed a pair of Chanel sunglasses propped on top of her head. They were new shades, even though Emma and Madeline had picked out a vintage pair last week, a very un- Sutton move. Had Mads deliberately chosen not to wear the sunglasses today to show she was pissed at Emma, or was Emma reading too much into things?\u003c/p\u003e\n\u003cp\u003e“Thayer’s arraignment hearing was this morning,” Madeline explained, looking at Charlotte but not at Emma.\u003c/p\u003e\n\u003cp\u003e“His bail is set at fifteen thousand dollars. My mom won’t stop crying. She’s begging my dad to pay his bail, but he refuses—he says he’s not going to waste his money bailing Thayer out because he’s just going to bolt again. I’d bail him out myself, but where am I going to get fifteen grand?” Charlotte draped an arm around Madeline and squeezed her shoulder. “I’m so sorry, Mads.”\u003c/p\u003e\n\u003cp\u003e“At the hearing he just sat there, staring at us.” Madeline’s lower lip trembled. “It’s like he’s become this complete stranger. He has a tattoo he won’t explain, and that crazy limp. He’ll never be able to play soccer again. It was his biggest love—the thing he was best at—and now his future is ruined.”\u003c/p\u003e\n\u003cp\u003eEmma reached out her hand to rest it on Madeline’s.\u003c/p\u003e\n\u003cp\u003e“That’s awful.”\u003c/p\u003e\n\u003cp\u003eMadeline tensed her shoulders and pulled away.\u003c/p\u003e\n\u003cp\u003e“Worst of all, Thayer won’t tell us where he was all this time.”\u003c/p\u003e\n\u003cp\u003e“At least you know where he is now, and that he’s safe,” Emma offered.\u003c/p\u003e\n\u003cp\u003eMadeline whipped around and stared at her. Her blue eyes were puffy, and her mouth was a straight line. “What was he doing in your bedroom?” she asked bluntly.\u003c/p\u003e\n\u003cp\u003eEmma flinched. Charlotte fidgeted with a heart-shaped keychain that hung on her leather Coach purse, avoiding eye contact with both of them.\u003c/p\u003e\n\u003cp\u003e“I already told you I don’t know,” Emma stammered, feeling her stomach muscles bunch up into a tight knot.\u003c/p\u003e\n\u003cp\u003e“Did you know he was coming to your house that night?” Madeline’s eyes narrowed.\u003c/p\u003e\n\u003cp\u003eEmma shook her head. “I had no idea. I swear.” Madeline raised an eyebrow like she wanted to believe her, but couldn’t. “Come on, Sutton. You knew when he was going to take off. You’ve been talking to him while he was gone, right? You knew where he was all along.”\u003c/p\u003e\n\u003cp\u003e“Mads,” Charlotte said. “Sutton wouldn’t—”\u003c/p\u003e\n\u003cp\u003e“Mads, if I had known where he was or was communicating with him, I would have told you,” Emma interrupted. She could only guess at the truth of this. Yes, she hadn’t been talking to Thayer. But had Sutton?\u003c/p\u003e\n\u003cp\u003eI had the sinking suspicion that Emma was right, even if I didn’t want it to be possible that I could have kept that from Mads. I had hurt so many people and kept so many secrets. If only I could remember what they were.\u003c/p\u003e\n\u003cp\u003eMadeline chipped a fleck of gold nail polish from her index finger. “I know what was going on with you guys before he left.”\u003c/p\u003e\n\u003cp\u003eA sharp, bitter taste filled Emma’s mouth. She breathed in to speak, but couldn’t find the words. What was she supposed to say? Maybe you could fill me in?\u003c/p\u003e\n\u003cp\u003eJust then a shril bell blared across the courtyard.\u003c/p\u003e\n\u003cp\u003eCharlotte shot up. “We should go.”\u003c/p\u003e\n\u003cp\u003eBut Madeline just sat there, glaring.\u003c/p\u003e\n\u003cp\u003eCharlotte rested a hand gently on the sleeve of Madeline’s sweater. “The last thing we need is your dad getting a phone call about you being late to class.” Finally, Madeline sighed and slung her bag over her shoulder. Charlotte murmured something about seeing Emma at lunch, then looped her arm through Madeline’s and guided her toward their first class. Even though Emma’s class was in the same direction, she got the distinct impression that she wasn’t invited.\u003c/p\u003e\n\u003cp\u003eA hand clamped down on Emma’s shoulder, and she flinched. When she turned, Ethan smiled sheepishly behind her. “I didn’t mean to scare you,” he said. “I just wanted to know if you’re okay.”\u003c/p\u003e\n\u003cp\u003eEmma reached out for Ethan’s hand, then pulled back.\u003c/p\u003e\n\u003cp\u003eHer eyes swept furtively around the yard. A couple of drama kids were rehearsing a scene near the parking lot. There was a small line for coffee at the kiosk just inside the school doors. No one was looking at them, but she still felt paranoid. Ethan wasn’t part of Sutton’s clique, nor did he want to be. \u003c/p\u003e","sourceLink":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3/page-5.html","bookId":2395,"creation":"Oct 5, 2019 10:27:29 AM","modification":"Oct 5, 2019 10:27:29 AM"}
