{"id":73349,"no":8,"title":"Page 8","content":"\u003cp\u003eQuinlan eyed Thayer. A blue vein at his temple pulsed.\u003c/p\u003e\n\u003cp\u003e“You were back in Tucson in August? Do you know what you put your parents through? What you put this community through? I spent a lot of time and money searching for you, and it turns out you were right here, under our noses!”\u003c/p\u003e\n\u003cp\u003e“That’s not quite true,” Thayer said in a quiet, steady, discomfiting voice.\u003c/p\u003e\n\u003cp\u003eQuinlan crossed his arms over his chest. “Then how about you tell me what is true?” When Thayer didn’t answer, he sighed. “Is there anything you can tell us about the blood on the hood of Ms. Mercer’s car? Or how your ticket ended up in her car?”\u003c/p\u003e\n\u003cp\u003eThayer limped over to where Emma sat. He put both palms on the table, glancing from Emma to Quinlan. He opened his mouth like he was about to give a long speech, but then just shrugged. “Sorry,” he said, his voice creaking as though he hadn’t spoken for days. “But no. There’s nothing I can tell you.”\u003c/p\u003e\n\u003cp\u003eQuinlan shook his head. “So much for being cooperative,” he grumbled, then shot to his feet, grabbed Thayer by his muscular forearm, and dragged him from the room. Just before Thayer slipped out the door, he turned his head and gave Emma a long, eerie look. Emma stared back, her lips slightly parted. Her gaze fell from Thayer’s face to his shackled hands, and then to the rope bracelet around his wrist.\u003c/p\u003e\n\u003cp\u003eI looked at the bracelet, too, and was overcome with a strange snapping feeling. I’d seen that bracelet somewhere. All of a sudden, the pieces fell into place. I saw the bracelet, and then Thayer’s arm, and then his face …\u003c/p\u003e\n\u003cp\u003eand then a setting. More and more dominoes fell over, more and more images flashed into my mind. And before I knew it, I was falling headlong into a full-blown memory …\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eNIGHT HIKING\u003c/p\u003e\n\u003cp\u003eI pull up to the Greyhound station in Tucson just as a silver bus chugs into the parking lot. I roll down my window and the pungent smells of a hot-dog vendor’s cart waft into my British racing-green 1965 Volvo 122. Earlier this afternoon I rescued my car, my baby, from the impound.\u003c/p\u003e\n\u003cp\u003eThe paperwork flutters on the dash, my signature prominent at the bottom, a big, red-stamped AUGUST 31 at the top. It had taken me weeks to save up the money to pay cash to get the car off the impound lot—there was no way I was going to charge it on a credit card, since my parents always saw the statement.\u003c/p\u003e\n\u003cp\u003eThe bus door sighs open, and I crane my neck to scan the exiting passengers. An overweight man with a fanny pack, a teenage girl bopping her head to an iPod, a family who looks shell-shocked from the long journey, all of them holding pillows. Finally, a boy tumbles down the stairs, black hair disheveled, shoelaces untied. My heart leaps. Thayer looks different, slightly scruffier and skinnier. There’s a tear in the knee of the Tsubi jeans I bought him before he left, and his face looks more angular, maybe even wiser. I watch as he scans the parking lot, looking for me. As soon as he spots my car he breaks into his trademark, soccer-star sprint.\u003c/p\u003e\n\u003cp\u003e“You came,” he cries as he wrenches open the door of my car.\u003c/p\u003e\n\u003cp\u003e“Of course I did.”\u003c/p\u003e\n\u003cp\u003eHe climbs inside the car. My arms reach out and wrap around his neck. I kiss him hungrily, not caring who might see us—even Garrett, my so-called boyfriend.\u003c/p\u003e\n\u003cp\u003e“Thayer,” I whisper, feeling the layer of stubble along his jaw rough against my cheek.\u003c/p\u003e\n\u003cp\u003e“I missed you so much,” Thayer answers, pulling me close. His hands are low on the small of my back and his fingers graze the top of my yellow cotton shorts. “Thanks for meeting me.”\u003c/p\u003e\n\u003cp\u003e“Nothing could keep me away,” I say, making myself pull back slightly. I check the plastic alligator-print watch on my wrist. Most of the time, I wear the Cartier tank watch my parents got me for my Sweet Sixteen, but what they don’t know is that I love this cheap thing more. Thayer won it for me at the Tucson County Fair the last day he was in town.\u003c/p\u003e\n\u003cp\u003e“So how much time do we have?” I whisper.\u003c/p\u003e\n\u003cp\u003eThayer’s green eyes shine. “Until tomorrow night.”\u003c/p\u003e\n\u003cp\u003e“And then do you turn into a pumpkin?” I tease. This is a longer visit than usual, but I feel greedy. “Stay another day. I’ll make it worth your while.” I toss my hair over my shoulder. “I bet I’m more fun than wherever it is you run off to.”\u003c/p\u003e\n\u003cp\u003eThayer runs his finger along my jaw line. “Sutton …”\u003c/p\u003e\n\u003cp\u003e“Fine.” I turn away, squeezing the steering wheel.\u003c/p\u003e\n\u003cp\u003e“Don’t tell me where you’ve been. I don’t care.” I reach for the radio dial and turn up the sports channel. Loud.\u003c/p\u003e\n\u003cp\u003e“Don’t be like that.” Thayer’s hand covers mine. His fingers trail along my bare arm until they pause at my neck and uncurl. My skin warms beneath his hands. He leans closer until I can feel his breath against my shoulder. It’s minty, like he chewed a whole pack of gum on the ride here. “I don’t want to fight with you the only day we’re together.”\u003c/p\u003e\n\u003cp\u003eI face him, hating the lump that forms at the back of my throat. “It’s just hard here without you. It’s been months.\u003c/p\u003e\n\u003cp\u003eAnd you said you’d come back for good this time.”\u003c/p\u003e\n\u003cp\u003e“I will, Sutton, you have to trust me. But not quite yet.\u003c/p\u003e\n\u003cp\u003eIt’s not right.”\u003c/p\u003e\n\u003cp\u003eWhy? I want to ask. But I’ve promised not to ask questions. I should be happy that he has left wherever he’s been staying to see me, even if it’s only for twenty-four hours. Coming back here under such secrecy is a risk. So many people are looking for him. So many people would be furious if they knew he was here and hadn’t reached out.\u003c/p\u003e\n\u003cp\u003e“Let’s go somewhere special,” Thayer says, tracing a pattern on my leg. “Want me to drive?”\u003c/p\u003e\n\u003cp\u003e“You wish!” I tease, checking my rearview mirror and revving the engine. And just like that, I feel better. There’s no use in dwelling on what I don’t know and what the future might hold for us. Thayer and I have twenty-four blissful hours, and that’s what matters.\u003c/p\u003e\n\u003cp\u003eI peel from the station’s lot and turn onto a main road.\u003c/p\u003e\n\u003cp\u003eTwo kids wearing cut-off jean shorts and clutching duffel bags who look our age are trying to hitchhike from next to a patch of desert broom. The Catalina Mountains tower in the distance. “How about a night hike?” I ask. “No one else will be out right now—we’ll have the whole mountain to ourselves.”\u003c/p\u003e\n\u003cp\u003eThayer nods and I switch the radio to a scratchy jazz station. Saxophone music filters through the car. I reach to change it, but Thayer stops me.\u003c/p\u003e\n\u003cp\u003e“Leave it,” he says. “It puts me in the mood.”\u003c/p\u003e\n\u003cp\u003e“In the mood for what?” I ask, giving him a sly sideways look. I put my index finger to my lips and tap them like I’m thinking hard. “I bet I can guess.”\u003c/p\u003e\n\u003cp\u003e“You wish, Sutton,” he says with a smirk.\u003c/p\u003e\n\u003cp\u003eI laugh and reach across the seat to punch his arm.\u003c/p\u003e\n\u003cp\u003eWe’re quiet on the rest of the drive to Sabino Canyon.\u003c/p\u003e\n\u003cp\u003eI roll both windows down and wind rushes across our faces.\u003c/p\u003e\n\u003cp\u003eWe pass a coffee shop called the Congress Club that advertises a book reading and open-mic night, a dog groomer’s named Mangy Mutts, and an ice cream shop with a neon sign for make-your-own sundaes. Thayer takes my free hand as we drive along a quiet stretch of the highway. Cacti appear in the distance. The scent of wildflowers wafts into the car.\u003c/p\u003e\n\u003cp\u003eFinally, we ascend the dirt road leading to the canyon and park in a secluded spot by a bunch of metal trash barrels. The night sky is black, the moon a shining orb floating high above our heads. The air is still warm and heavy as we climb from the car and find the entrance to the winding path that leads to the overlook. As we walk, Thayer’s hand brushes my shoulder, trails down my spine and lands on the small of my back. His touch feels hot on my skin. I bite my lip to keep from turning and kissing him\u003c/p\u003e\n\u003cp\u003e—even though I want to, it’s more delicious to resist for as long as possible.\u003c/p\u003e\n\u003cp\u003eWe walk a few more yards in silence up the gravelly path. Technically, the park is closed at night, and there’s not a soul in sight. A slight breeze makes me shiver. The boulders stand out in sharp relief against the moonlight.\u003c/p\u003e\n\u003cp\u003eAnd then, after another minute, I hear it: a crackle of a branch followed by what sounds like a sigh. I freeze. “What was that?”\u003c/p\u003e\n\u003cp\u003eThayer stops and squints in the darkness. “Probably an animal.”\u003c/p\u003e\n\u003cp\u003eI take another step, checking cautiously over my shoulder once more. There’s no one there. No one is following us. No one knows Thayer is here … or that I’m with him.\u003c/p\u003e\n\u003cp\u003eIt’s not long before we reach the overlook. All of Tucson spills out below us, a sea of glittering lights.\u003c/p\u003e\n\u003cp\u003e“Whoa,” Thayer breathes. “How did you find this?”\u003c/p\u003e\n\u003cp\u003e“I used to come here with my dad years ago.” I point to the precarious ground below. “We used to put a little blanket there and camp out with a picnic lunch. Dad’s a big bird-watcher, and he got me into it, too.”\u003c/p\u003e\n\u003cp\u003e“Sounds fun,” Thayer says sarcastically.\u003c/p\u003e\n\u003cp\u003eI cuff him on the arm. “It was.” Sadness fills me, suddenly. I remember how my dad would perch me on top of one of the huge rocks up here and hand me my purple water canteen—the only one I’d use during grade school.\u003c/p\u003e\n\u003cp\u003eWe’d clink our glasses and make up fake toasts. To Sutton, my dad would say, the most agile trailblazer to cross Sabino Canyon since 1962. I’d tap my purple canteen against his, and say, To Dad, your hair is getting kinda gray, but you’re still the fastest climber these parts have ever seen! We’d laugh and laugh as each toast became sillier than the one before.\u003c/p\u003e\n\u003cp\u003eIt feels like ages have passed since my dad and I were close like that, and I know it’s my fault as much as his. I stare up at the stars that dot the dark sky and resolve to try a little harder with him. Maybe I can get our relationship back to the way it used to be.\u003c/p\u003e\n\u003cp\u003eI step carefully to the edge. “Dad had just one rule,” I go on. “I had to stay away from this ledge. There were all kinds of rumors that people fell right over the side. No one could rappel down to get their bodies—the drop is too steep—so there are a bunch of skeletons down there.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Thayer says, wrapping his arms around me. “I won’t let you fall.”\u003c/p\u003e\n\u003cp\u003eMy heart suddenly melts. I lean forward and press my lips to his. His arms wrap around my waist, pulling my body into his. His hands are in my hair as he returns my kiss.\u003c/p\u003e\n\u003cp\u003e“Don’t leave me again,” I plead. I can’t help myself.\u003c/p\u003e\n\u003cp\u003e“Don’t go back to wherever it is you’re hiding.” He kisses my cheek and pulls away to look at me. “I can’t explain right now,” he says. “But I can’t be here—not now. I promise, though, that I won’t be gone forever.” His hands cup my chin. I want to understand. I want to be strong. But it’s so hard. Then I notice a white woven rope bracelet on his wrist. “Where’d you get that?” I ask, pinching the rough twine between my fingers.\u003c/p\u003e\n\u003cp\u003eThayer shrugs and avoids my glance. “Maria made it for me.”\u003c/p\u003e\n\u003cp\u003e“Maria?” I stiffen. “Is she cute?”\u003c/p\u003e\n\u003cp\u003e“She’s just a friend,” Thayer says, his tone gruff and hard.\u003c/p\u003e\n\u003cp\u003e“What kind of friend?” I press. “Where did you meet her?”\u003c/p\u003e\n\u003cp\u003eI feel his muscles tense beneath his gray T-shirt. “It doesn’t matter. Anyway, how’s Garrett doing?” He says the name Garrett like it’s a flesh-eating disease. \u003c/p\u003e","sourceLink":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3/page-8.html","bookId":2395,"creation":"Oct 5, 2019 10:27:29 AM","modification":"Oct 5, 2019 10:27:29 AM"}
