{"id":87926,"no":17,"title":"Page 17","content":"\u003cp\u003e“Oh jeez, Kat. Don’t do this,” Taylor begged.\u003c/p\u003e\n\u003cp\u003e“What did you say to me?” Kylie asked furiously.\u003c/p\u003e\n\u003cp\u003e“He told me how much he truly loved you,” Katherine chose her words carefully.\u003c/p\u003e\n\u003cp\u003e“Shut up! I do not want to hear that you are talking to him. I don’t want to hear anything about Austen from your mouth. Do you understand that?” she hurried into her car. “Why don’t you just go back to California and leave us all alone?” Kylie slammed her door closed and tore away.\u003c/p\u003e\n\u003cp\u003eKatherine sat back down, dejected. She faced Taylor and confessed, “I was only trying to help.”\u003c/p\u003e\n\u003cp\u003e“I know,” Taylor acknowledged. “I just don’t think you should talk about my brother to Kylie. Put yourself in her shoes. How would you feel?”\u003c/p\u003e\n\u003cp\u003eIt was as if a switch flipped in Katherine’s head and her eyes lit up. “I think that’s what your brother was trying to show me last night. I think he wanted me to understand Kylie’s pain. He needed me to really see how she felt about him to truly understand.”\u003c/p\u003e\n\u003cp\u003eKatherine slapped her palm against her forehead, “God, I’m such an idiot.”\u003c/p\u003e\n\u003cp\u003e“Don’t beat yourself up,” Taylor helped pull Katherine to her feet. “We should probably get going.”\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003e“Thank you so much for your hospitality. It was really nice to be here,” Katherine squeezed Taylor’s mom.\u003c/p\u003e\n\u003cp\u003e“It was nice to have you. Come back soon, okay?”\u003c/p\u003e\n\u003cp\u003e“We will,” Katherine promised and turned to Blake, “Don’t forget to come visit us soon. We’ll have so much fun.”\u003c/p\u003e\n\u003cp\u003eBlake blushed and responded quietly, “I will.”\u003c/p\u003e\n\u003cp\u003eKatherine walked out the front door and toward Taylor’s waiting car. She was excited to get back to school, but a little hesitant to see Cooper.\u003c/p\u003e\n\u003cp\u003e“Are you nervous to see Cooper?” Taylor asked her from the driver’s seat.\u003c/p\u003e\n\u003cp\u003e“A little. I don’t know how I’m going to feel when I see him, you know?”\u003c/p\u003e\n\u003cp\u003e“Yeah. But you still like him, right?” Taylor checked.\u003c/p\u003e\n\u003cp\u003e“Of course. He’s perfect. But…it’s just not the same as the way I feel about your brother.”\u003c/p\u003e\n\u003cp\u003eKatherine realized that rationally, she should be head over heels in love with Cooper Donovan. But love wasn’t always rational. And the bond between her and Austen had nothing to do with logic…or ration. It wouldn’t be easy to walk away from him and into Cooper’s arms, even though she assumed it probably should be.\u003c/p\u003e\n\u003cp\u003e“Right. My brother...the guy who isn’t alive,” Taylor forced the words out.\u003c/p\u003e\n\u003cp\u003e“I know it’s crazy. But the way I feel when I’m with your brother is unlike anything I’ve ever known. I can’t explain to you how deep my emotions run. I don’t know how.” She struggled to find the right words, but nothing sounded perfect enough.\u003c/p\u003e\n\u003cp\u003e“Just don’t give up on Cooper, okay? He deserves more from you than that,” Taylor insisted. “Plus, if you let him go, do you know how many stupid girls you’d make happy? They’re too annoying to be that happy.”\u003c/p\u003e\n\u003cp\u003eKatherine laughed, “I’d completely forgotten about all those girls. Listen, I care about Cooper a lot. I just need to see how I feel when I see him.”\u003c/p\u003e\n\u003cp\u003e“Well, here’s your chance.” Taylor pulled her car into the parking lot and noticed Danny immediately. “There they are.”\u003c/p\u003e\n\u003cp\u003eThe dozen red roses he held stood out more than he did in his ripped jeans and tight black t-shirt. Cooper stood next to him in jeans and a dark blue shirt, holding three sunflowers.\u003c/p\u003e\n\u003cp\u003eKatherine felt chills course through her as her heart raced. She rubbed at the goose bumps on her arms. She was definitely still attracted to him.\u003c/p\u003e\n\u003cp\u003e“I’m getting sweaty,” Katherine admitted to Taylor, who laughed in relief.\u003c/p\u003e\n\u003cp\u003e“Thank goodness for that.”\u003c/p\u003e\n\u003cp\u003e“I knew you’d want to know.”\u003c/p\u003e\n\u003cp\u003e“Well, at least you still like the guy.”\u003c/p\u003e\n\u003cp\u003eDanny ran to the Taylor’s side of the car and opened the door. She hopped out and leapt into his arms. “For me?” she gestured toward the roses.\u003c/p\u003e\n\u003cp\u003e“I missed you so much.” Danny handed them to her and proceeded to plant kisses all over her face. Taylor struggled to push him away, but he only tightened his grip.\u003c/p\u003e\n\u003cp\u003e“I just got back…ugh, don’t annoy me already!” she joked.\u003c/p\u003e\n\u003cp\u003e“You love it. You love me, remember?” Danny teased.\u003c/p\u003e\n\u003cp\u003e“I can take that back,” she shot back at him playfully.\u003c/p\u003e\n\u003cp\u003e“Nope. No take-backs.”\u003c/p\u003e\n\u003cp\u003eKatherine’s heart pounded a million miles a minute as she watched Cooper head toward her. “I missed you too. A lot,” his voice smoothly informed her. She smiled, but didn’t respond as he handed her the sunflowers.\u003c/p\u003e\n\u003cp\u003eShe grabbed them as Cooper wrapped his arms around her and pulled her close. He leaned in and his lips pressed against hers. She heard him softly sigh as his tongue slowly found its way inside her mouth. She threw her arms around his neck and kissed him back, but a part of her that felt like she was being unfaithful to Austen. She knew it sounded crazy, but she couldn’t help it. Was this cheating?\u003c/p\u003e\n\u003cp\u003eCooper sensed her hesitation and pulled away. “Is everything okay?” his voice shook with vulnerability.\u003c/p\u003e\n\u003cp\u003e“I’m just really tired. Thank you so much for my flowers. That was really sweet of you. And sunflowers are my favorite! How’d you know?”\u003c/p\u003e\n\u003cp\u003e“I didn’t. The moment I saw them in the store, I thought of you.”\u003c/p\u003e\n\u003cp\u003e“You have good intuition, Mr. Donovan.” She was surprised at how easy it was to fall back into him. There was a level of comfort between them that she genuinely appreciated. It would be so easy to give her whole heart to him, if she had it to give.\u003c/p\u003e\n\u003cp\u003e“Did you have a good time at Taylor’s?” he longed to extend their interaction.\u003c/p\u003e\n\u003cp\u003e“Totally. Her family is so great. It was really nice. How about you?”\u003c/p\u003e\n\u003cp\u003e“Lots of hockey, lots of family, and lots of food. The perfect way to spend any break,” he smiled. “You’re so pretty. I missed your face.”\u003c/p\u003e\n\u003cp\u003e“I missed your eye,” she ran her thumb down the side of his face.\u003c/p\u003e\n\u003cp\u003eIn moments like these, Katherine wished everything could be far less complicated. But she knew for that to happen, it would come at a price she wasn’t willing to pay. Giving up Austen for Cooper wasn’t something she wanted to do. Honestly, it wasn’t something she thought she was capable of doing.\u003c/p\u003e\n\u003cp\u003e“I feel like you’re a million miles away, California,” he sensed the change in her.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Coop. I really am tired.”\u003c/p\u003e\n\u003cp\u003eHe pretended to believe her.\u003c/p\u003e\n\u003cp\u003eShe almost blurted it all out—how she dreamed about Taylor’s dead brother. She wanted to be honest with Cooper, but feared that she couldn’t. Not while the revelations were still so new. She figured he’d ask a million questions that she wouldn’t have the answers to and that wouldn’t be fair to him.\u003c/p\u003e\n\u003cp\u003eShe contemplated her situation. She could do this. She’d see Austen at night when she slept, and be a normal girl during the day like everyone else. She almost laughed out loud at the thought. Nothing about this situation was normal and she questioned if anything about her was? Surely this sort of thing didn’t happen to normal people.\u003c/p\u003e\n\u003cp\u003eCooper broke the silence, “Do you want to get some dinner after practice later?”\u003c/p\u003e\n\u003cp\u003e“Not tonight. I have a paper I need to start writing and I’m probably going to crash early. Maybe tomorrow?” It wasn’t a complete lie. She did have a paper to write and the week at Taylor’s had been emotionally exhausting. But she also really wanted to see Austen again and the only way she could do that was if she was asleep.\u003c/p\u003e\n\u003cp\u003e“All right then. Tomorrow. I’m holding you to it.” He bit his bottom lip the way she loved and leaned in to kiss her goodbye. “I’ll remind you then.”\u003c/p\u003e\n\u003cp\u003e“Remind me...about what?” she questioned with half a smile.\u003c/p\u003e\n\u003cp\u003e“How incredible it is to be with me…cause you’ve obviously forgotten,” he smiled at her, his confidence radiating off his body.\u003c/p\u003e\n\u003cp\u003eShe laughed, “Thanks again for the flowers.”\u003c/p\u003e\n\u003cp\u003eShe watched as Cooper walked toward Danny, grabbed him by the sleeve and practically dragged him away from Taylor while she laughed.\u003c/p\u003e\n\u003cp\u003e“I love her,” Danny smirked.\u003c/p\u003e\n\u003cp\u003e“We know. The whole school knows genius,” Cooper teased.\u003c/p\u003e\n\u003cp\u003e“How was Katherine?”\u003c/p\u003e\n\u003cp\u003eCooper squirmed and his eyes narrowed, “She was weird. Something was off.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Danny wondered.\u003c/p\u003e\n\u003cp\u003e“I don’t know. She’s just different. I hate that I feel like this,” Cooper shook his body.\u003c/p\u003e\n\u003cp\u003e“Feel like what?”\u003c/p\u003e\n\u003cp\u003e“All out of control. Like I have no say in how this girl feels about me. It’s like nothing I do matters to her the way it would to other girls.”\u003c/p\u003e\n\u003cp\u003e“You always said she’s not like other girls,” Danny reminded him.\u003c/p\u003e\n\u003cp\u003e“I know, but I’ve never had to work this hard before. Don’t get me wrong, I want to work this hard for her. But I want her to want me back.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it bro. Maybe you’re reading into it.”\u003c/p\u003e\n\u003cp\u003eCooper agreed, “Maybe you’re right.”\u003c/p\u003e\n\u003cp\u003eTaylor rushed over to Katherine as she held the door open with her foot. Flowers spilled out of their arms.\u003c/p\u003e\n\u003cp\u003e“So? How sweet are our guys?” Taylor asked, her voice smitten.\u003c/p\u003e\n\u003cp\u003e“They are pretty amazing.” Katherine turned to see the Cooper and Danny waving from the Jeep. The girls smiled and waved back. They lugged their bags up to their room and tossed them on the floor.\u003c/p\u003e\n\u003cp\u003e“I think I’m going to head over there after they get done with practice. Did you wanna come with?”\u003c/p\u003e\n\u003cp\u003e“Not tonight. I’m really tired and I have a paper to write.”\u003c/p\u003e\n\u003cp\u003e“Seriously? Is that what you’re telling people?” Katherine gave Taylor a look of confusion, but Taylor saw through it. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“I really am tired, Tay. I feel emotionally wrecked.” She wanted to be brutally honest with Taylor, but she didn’t want to feel judged by her. “And honestly, I really miss your brother.”\u003c/p\u003e\n\u003cp\u003eThere. She’d admitted it. Out loud.\u003c/p\u003e\n\u003cp\u003e“Oh no.”\u003c/p\u003e\n\u003cp\u003e“Oh no, what?”\u003c/p\u003e\n\u003cp\u003e“You can’t start doing this,” Taylor’s voice rose with concern.\u003c/p\u003e\n\u003cp\u003e“Start doing...what exactly?” Katherine asked, dragging out the ‘what’ for emphasis.\u003c/p\u003e\n\u003cp\u003e“You can’t stop living your life, or seeing Cooper, because you want to see my brother. It’s just creepy, Kat.”\u003c/p\u003e\n\u003cp\u003e“I’m not stopping living my life, Taylor. It’s ONE night. And I am tired!” Katherine snapped.\u003c/p\u003e\n\u003cp\u003eShe should have known Taylor wouldn’t understand. How could she? She would just have to keep all things Austen locked inside from now on.\u003c/p\u003e\n\u003cp\u003e“Right. One night will turn into two...and then two will turn into three...and then...”\u003c/p\u003e\n\u003cp\u003e“I get it. It’s not going to happen okay? I think I have a little more self-control than that,” Katherine wasn’t actually sure that she did. “Would you even care that I was doing this if there was no Cooper Donovan in the picture?” \u003c/p\u003e","sourceLink":"https://allnovel.net/in-dreams-the-dream-1/page-17.html","bookId":2783,"creation":"Oct 5, 2019 5:25:46 PM","modification":"Oct 5, 2019 5:25:46 PM"}
