{"id":87913,"no":4,"title":"Page 4","content":"\u003cp\u003e“What the hell are you two doing?” Danny bounced up with Taylor close behind.\u003c/p\u003e\n\u003cp\u003e“Seriously, you two. Get a room. That’s embarrassing!” Taylor teased.\u003c/p\u003e\n\u003cp\u003e“Shut up. I was just looking at the speck in his eye. And...ah, never mind,” Katherine stopped trying to explain.\u003c/p\u003e\n\u003cp\u003e“Kat, this is Danny. Danny, this is my roommate, Kat.” She turned to Cooper and said, “I’m Taylor. What’s your name, eye speck?”\u003c/p\u003e\n\u003cp\u003e“Cute. Cooper.”\u003c/p\u003e\n\u003cp\u003e“Cool name! Hockey?” Taylor spoke quickly, but he kept up.\u003c/p\u003e\n\u003cp\u003e“Yep. But I’m way better than your boy, Danny, here.”\u003c/p\u003e\n\u003cp\u003e“Funny, Coop,” Danny whined.\u003c/p\u003e\n\u003cp\u003e“Let’s be clear…he’s NOT my boy,” Taylor snapped and shot Danny a glance.\u003c/p\u003e\n\u003cp\u003e“YET!” Danny shouted at her.\u003c/p\u003e\n\u003cp\u003e“Dream on, kid,” Taylor teased, “Where’s Kylie?”\u003c/p\u003e\n\u003cp\u003e“Last time we saw her she was upstairs kissing some guy. I assume she’s still there?”\u003c/p\u003e\n\u003cp\u003e“We should get her and head home. This party is about to get broken up anyway. It’s out of control and way too loud.” Taylor grabbed Katherine’s hand and pulled her up the stairs, while Cooper and Danny watched them go, smiles plastered on both their faces.\u003c/p\u003e\n\u003cp\u003eKatherine wasn’t sure how Taylor knew when a party was and wasn’t out of control, but it turned out she was right. As they dragged Kylie away from her boyfriend for the night, campus police rounded the corner.\u003c/p\u003e\n\u003cp\u003e“You’re just going to leave without saying goodbye?” Cooper shouted toward her.\u003c/p\u003e\n\u003cp\u003eKatherine noticed everyone staring at her, so she refused to respond. Her eyes darted from Cooper to the crowd of gawkers and then back to him again. Cooper looked around and quickly jogged to her side.\u003c/p\u003e\n\u003cp\u003eHe slid his arm around her waist and she felt her throat catch. “At least let me walk you home?” He practically begged, but Katherine couldn’t take any more heart-pounding or throat catching.\u003c/p\u003e\n\u003cp\u003eShe wiggled her body free from his hand and relished the air she could once again breathe. “I think we’re fine. Right?” She looked at the girls who shook their heads in unison. “See, we’re fine. I’ll see you in class, Coopertown.”\u003c/p\u003e\n\u003cp\u003e“Bye, Danny-boy,” Taylor shouted back at him as she walked away.\u003c/p\u003e\n\u003cp\u003eThat night before Katherine fell asleep; she wondered if she would see her dream guy again. She wasn’t quite sure why, after the night she’d just had with Cooper, she was even thinking about him at all. She wondered if she associated him with sleep, but knew instinctively it was more than that.\u003c/p\u003e\n\u003cp\u003e“What are you sighing about?” Taylor asked her through a yawn.\u003c/p\u003e\n\u003cp\u003eKatherine looked down from her bed and noticed that Kylie was already fast asleep. “Just wondering if my dream guy will make another appearance tonight.”\u003c/p\u003e\n\u003cp\u003e“Already leaving Cooper in the dust for some guy you don’t even know? You’re one serious heartbreaker, Katherine Johns. But not for nothing, if you do dream about this boy again—that would be pretty awesome!”\u003c/p\u003e\n\u003cp\u003e“I know! Not very realistic though, right?”\u003c/p\u003e\n\u003cp\u003e“Who cares about reality, Kat? Geez, you’re such a downer.”\u003c/p\u003e\n\u003cp\u003eKatherine snickered, “Goodnight, Taylor.”\u003c/p\u003e\n\u003cp\u003e“Goodnight, downer-face!”\u003c/p\u003e\n\u003cp\u003eKatherine lay her head on her pillow and promptly fell asleep. She awoke the next morning to the sound of Kylie rushing out of the dorm room.\u003c/p\u003e\n\u003cp\u003e“Bye, girls! Had a blast! See you soon!” Kylie yelled and then slammed the door.\u003c/p\u003e\n\u003cp\u003e“So? Did we have any appearances last night?” Taylor asked, as she walked out of the bathroom.\u003c/p\u003e\n\u003cp\u003e“Yeah, your dad,” Katherine replied sarcastically.\u003c/p\u003e\n\u003cp\u003e“Oh, you’re hilarious.”\u003c/p\u003e\n\u003cp\u003e“I think so,” Katherine quipped. “But seriously, no dreams at all last night,” she added with a hint of disappointment.\u003c/p\u003e\n\u003cp\u003eTaylor crooked her head, “I’m sorry. Are you sad?”\u003c/p\u003e\n\u003cp\u003eKatherine nodded, “I know it probably sounds dumb, but yeah. A little. I just thought...I don’t know what I thought.”\u003c/p\u003e\n\u003cp\u003e“That you’d see him again?” Taylor asked softly.\u003c/p\u003e\n\u003cp\u003e“Yeah. At least I hoped,” Katherine admitted.\u003c/p\u003e\n\u003cp\u003e“Well, there’s always Cooper. You think he knows he’s playing backup to a dream guy?”\u003c/p\u003e\n\u003cp\u003e“Taylor. Be real.”\u003c/p\u003e\n\u003cp\u003e“I am. Cooper is totally number two in this relationship and Dream Guy is clearly number one. Just saying you should give the poor guy some warning before he goes falling head over heels for you.”\u003c/p\u003e\n\u003cp\u003eThe very thought of it all made Katherine dizzy. Did she want a relationship with Cooper? She barely knew him. Was she willing to give up on Dream Guy because that’s what sane people would do? You can’t hold on the idea of some random guy from a dream your whole life. But then she reminded herself that that was no ordinary dream. Feelings and emotions that intense don’t just happen all the time. It all had to mean something.\u003c/p\u003e\n\u003cp\u003e“Hello?” Taylor waved her hand in front of Kat’s face, “I just meant that he clearly likes you and if...”\u003c/p\u003e\n\u003cp\u003eKatherine cut her off mid-sentence, “I get it, Tay.”\u003c/p\u003e\n\u003cp\u003e“Oh hey, don’t get mad. I’m just playing.”\u003c/p\u003e\n\u003cp\u003e“No, no, I’m sorry. It’s just that this is all too weird for me. And everything about both guys is really intense, really fast, and it’s just all kind of crazy, no?”\u003c/p\u003e\n\u003cp\u003e“In all honesty, yeah. I mean it is crazy. And it is fast. But that doesn’t mean it’s a bad thing. Are you even interested in Cooper? I mean, is he your type?”\u003c/p\u003e\n\u003cp\u003eKatherine remained silent while she stared at Taylor.\u003c/p\u003e\n\u003cp\u003e“I’m only asking because I don’t really know what your type is?” Taylor quipped.\u003c/p\u003e\n\u003cp\u003e“No, I know. I was just thinking,” Katherine responded.\u003c/p\u003e\n\u003cp\u003e“Oh, well continue thinking then,” Taylor smiled.\u003c/p\u003e\n\u003cp\u003e“I’m definitely attracted to him. And I don’t really know him that well, but from what I do know, I love that he’s an athlete because it means he has to do well in school and that he has some sort of work ethic, sense of responsibility and drive,” Katherine paused before continuing.\u003c/p\u003e\n\u003cp\u003e“I really respect people who have passion for things. He seems really nice and funny. I mean, yeah...he definitely doesn’t lack any qualities that I like in a guy. But he also kind of scares me,” she added.\u003c/p\u003e\n\u003cp\u003e“What do you mean? Scares you how?” Taylor wondered.\u003c/p\u003e\n\u003cp\u003e“He makes me super nervous whenever I see him…and he makes me all sorts of sweaty just when he’s around me. No guy has ever had that kind of effect on me before.”\u003c/p\u003e\n\u003cp\u003eTaylor laughed, “Dummy. That just means you’re attracted to him. Think you’re the only one who sweats when a hot guy gets close? It’s called chemistry.”\u003c/p\u003e\n\u003cp\u003e“Well then, we’ve got it in buckets ’cause let me tell you…” Katherine started to laugh. “Thanks for making me feel less stupid about sweating around a hot guy.”\u003c/p\u003e\n\u003cp\u003e“Oh please! That’s what happens. It’s normal. I mean, normal if you’re attracted to him. And really, how could you not be?”\u003c/p\u003e\n\u003cp\u003e“He is ridiculously good looking, right?”\u003c/p\u003e\n\u003cp\u003e“Pretty much. So what’s stopping you from giving him a chance? I mean, he sounds perfect,” Taylor asked sincerely.\u003c/p\u003e\n\u003cp\u003e“In all honesty? I sorta can’t get past the guy from my dream. It’s hard to let go of those feelings once you’ve experienced them.” She took a deep breath, “I feel like if I give Cooper a shot, then I’m giving up on my dream guy. And I’m just not ready to do that yet.”\u003c/p\u003e\n\u003cp\u003e“Fair enough,” Taylor agreed.\u003c/p\u003e\n\u003cp\u003e“You don’t think I’m being stupid?” Katherine looked up at her with eyes that said it all. She wanted—no, needed—Taylor to be on her side with this.\u003c/p\u003e\n\u003cp\u003e“I don’t. I saw you that morning. And I hear the way you talk about him. I wouldn’t give up on him either if it were me.”\u003c/p\u003e\n\u003cp\u003e“Really?” Katherine asked.\u003c/p\u003e\n\u003cp\u003e“Really. I’ve never felt anything like what you described. Besides, he could still be real you know?”\u003c/p\u003e\n\u003cp\u003eA smile spread across Katherine’s face, “You make me want to believe in that.”\u003c/p\u003e\n\u003cp\u003e“Well you never know! Who am I to say what is or isn’t real?”\u003c/p\u003e\n\u003cp\u003e“So what about you? And Danny?” Katherine inquired.\u003c/p\u003e\n\u003cp\u003eTaylor’s face instantly turned rosy. “Oh yeah, he’s right up my alley. He’s adorable, funny and a total wiseass. I love that he can dish it out and take it. Most guys can only do the dishing, you know?”\u003c/p\u003e\n\u003cp\u003e“Totally. So you like him?”\u003c/p\u003e\n\u003cp\u003e“I’ll probably give him a shot.”\u003c/p\u003e\n\u003cp\u003e“Jeez, Taylor, trying to date you is like trying to win the lottery.”\u003c/p\u003e\n\u003cp\u003e“You have to understand the way most guys are out here. They are raised to hide their true selves under a ridiculously manly ego and crazy confidence. It is super annoying. They put on tough guy shows twenty-four hours a day. A girl gets tired of dealing with that all the time.”\u003c/p\u003e\n\u003cp\u003e“That would get annoying. I’d be like, be real already!”\u003c/p\u003e\n\u003cp\u003e“Exactly! But I can see right through Danny. He’s a big softy and he’s not very good at hiding it.”\u003c/p\u003e\n\u003cp\u003eKatherine raised her eyebrows, “Poor guy has no idea what he’s in for.”\u003c/p\u003e\n\u003cp\u003e“I know. Isn’t it great?” Taylor beamed.\u003c/p\u003e\n\u003cp\u003e“You crack me up. I’m starving.”\u003c/p\u003e\n\u003cp\u003e“Let’s go eat our weight in frozen yogurt.”\u003c/p\u003e\n\u003cp\u003e“That sounds so good. And totally normal.”\u003c/p\u003e\n\u003cp\u003e“Well we already know you’re not normal, so why not?” Taylor teased.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eDays turned into weeks and Katherine’s dream guy still hadn’t reappeared. The details of the dream may have gotten fuzzy with time but her feelings were something she could never erase. Not that she wanted to. But she found herself slowly letting go of dream guy and that allowed Cooper in.\u003c/p\u003e\n\u003cp\u003e“I love that you get dolled up for the class we have with Cooper,” Taylor remarked.\u003c/p\u003e\n\u003cp\u003eKatherine stopped curling her long brown hair and asked innocently, “What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“Don’t play coy with me, missy. You’re totally into him. Admit it! You only make yourself this cute when we’re seeing him.”\u003c/p\u003e\n\u003cp\u003eKatherine blushed.\u003c/p\u003e\n\u003cp\u003e“I knew it. You don’t even have to admit it.”\u003c/p\u003e\n\u003cp\u003e“I hate you,” Katherine joked and turned back to the mirror.\u003c/p\u003e\n\u003cp\u003e“No you don’t. But seriously, how great would it be if we dated teammates? We could go to all the games together. And double date all the time. Please just love him already,” Taylor whined.\u003c/p\u003e\n\u003cp\u003e“You’re insane.”\u003c/p\u003e\n\u003cp\u003e“Tell me that wouldn’t be perfect?” Taylor insisted.\u003c/p\u003e\n\u003cp\u003e“It wouldn’t be perfect,” Katherine remarked.\u003c/p\u003e\n\u003cp\u003e“Liar.”\u003c/p\u003e\n\u003cp\u003eKatherine smiled.\u003c/p\u003e\n\u003cp\u003e“And you were right before you know?” Taylor suggestively mentioned.\u003c/p\u003e\n\u003cp\u003eKatherine raised her eyebrows, “About???”\u003c/p\u003e\n\u003cp\u003e“About Cooper being a great guy. I’m over there all the time and he really is everything you thought he was.”\u003c/p\u003e\n\u003cp\u003eKatherine felt her pulse elevate, “Well that’s good to know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/in-dreams-the-dream-1/page-4.html","bookId":2783,"creation":"Oct 5, 2019 5:25:46 PM","modification":"Oct 5, 2019 5:25:46 PM"}
