{"id":83159,"no":15,"title":"Page 15","content":"\u003cp\u003eUnfortunately, Operatives Morgan and Baxter had no way of knowing that.\u003c/p\u003e\n\u003cp\u003e\"Oh, Joe!\" Abby\u0027s voice echoed down the hallway. \"You are going to get me into so much trouble.\"\u003c/p\u003e\n\u003cp\u003eI froze, totally unsure what was more terrifying: the look on Bex\u0027s face or the flirty tone of my aunt\u0027s laugh or the sound of a key being inserted into the lock on Abby\u0027s door.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have a clue what to do. I mean, as a rule, hiding is never a very good idea. When in doubt, get out, Mr. Solomon always says. But I wasn\u0027t exactly sure what he\u0027d say when he is the person who is about to catch you.\u003c/p\u003e\n\u003cp\u003e\"Bed!\" I snapped, grabbing Bex by the back of the neck. \"Now!\"\u003c/p\u003e\n\u003cp\u003eCrawling underneath Aunt Abby\u0027s bed, I couldn\u0027t help but think about the thousands of times in the past four and a half years when I\u0027d wondered where she was and what she was doing. (Note to self: be very, very careful what you wish for.)\u003c/p\u003e\n\u003cp\u003e\"Oh, Joe, stop!\" my aunt cried as the door creaked open. \"What if Rachel found out? She\u0027d never forgive me.\"\u003c/p\u003e\n\u003cp\u003eIn the darkness under the bed, Bex looked at me, her eyes as wide and bright as the moon, as she mouthed the word, \"Solomon!\"\u003c/p\u003e\n\u003cp\u003eI wanted to put my hands in my ears and sing. I wanted to wish myself into another room—another galaxy—but instead I just squeezed my eyes together.\u003c/p\u003e\n\u003cp\u003eAnd that\u0027s probably why I didn\u0027t see the bedskirt fly up and two hands grab my ankles.\u003c/p\u003e\n\u003cp\u003eMy back skidded on the hardwood floors as a great force jerked me from my hiding place.\u003c/p\u003e\n\u003cp\u003eMy aunt stared down and said, \"Hey, squirt.\"\u003c/p\u003e\n\u003cp\u003eThe good news was that Mr. Solomon was nowhere to be found. The bad news was that my aunt had had absolutely no trouble finding us.\u003c/p\u003e\n\u003cp\u003e\"Bex, darling, could you give us a minute?\" Bex looked at me. One of the cardinal rules of being a Gallagher Girl was simple: never leave your sister behind. But this was different, and we both knew it.\u003c/p\u003e\n\u003cp\u003e\"See you upstairs,\" I said as she walked away. The door closed behind her, and Abby turned to me. \"You really have grown up.\"\u003c/p\u003e\n\u003cp\u003e\"Aunt Abby,\" I hurried with the words, \"I\u0027m—\" I had intended to say \"sorry\" but Abby finished for me. \"Busted.\"\u003c/p\u003e\n\u003cp\u003eShe dropped onto the bed and pulled off a black (standard Secret Service-issue) loafer that was covered with mud. I looked around the room. \"Uh… where\u0027s Mr. Solomon?\"\u003c/p\u003e\n\u003cp\u003e\"Heck if I know.\" Abby shrugged. She must have read my confused expression because then she added, \"Oh, Joe,\" mimicking her earlier tone. She laughed. \"Squirt, you should have seen the look on your face.\"\u003c/p\u003e\n\u003cp\u003e\"Was I that obvious?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Oh, no way,\" Abby said, and as crazy as it might sound, I felt a little proud. \"But the bed thing is kind of a Morgan family tradition.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Did my mom—\"\u003c/p\u003e\n\u003cp\u003e\"Oh, not your mom.\" Abby stopped me. She cocked an eyebrow. \"Your dad.\"\u003c/p\u003e\n\u003cp\u003eYour dad, she\u0027d said. She\u0027d just…volunteered it. My father was always with my mother and me, and yet neither of us ever said his name. I realized then that Dad was like a ghost that only Aunt Abby didn\u0027t fear. She walked to the dresser and pulled out a bag of M\u0026amp;M\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Want one?\" she asked, offering me the bag. For a second I thought about the first time I\u0027d met Zach, but the thought quickly vanished.\u003c/p\u003e\n\u003cp\u003e\"Gosh, your dad loved sweets!\" she exclaimed as she sank onto the bed. \"You get that from him, you know. I remember this one time, we were trailing this double agent through a bazaar in Athens, and there was this lady selling chocolates. And they looked so good. And I could see your dad, and it was all he could do to keep his eye on the subject. But your dad was a pavement artist—you know that, right? So he\u0027s following this guy, while I\u0027m up on this second-story balcony getting the whole thing on surveillance and routing it back to Langley. And your dad\u0027s a pro, but I could tell that he wanted something sweet so bad he could hardly stand it. The only problem was…\"\u003c/p\u003e\n\u003cp\u003eI watched my aunt carry on. There was a light in her eyes, an easiness to her words that I don\u0027t think I\u0027d ever heard before. It was just another funny story, an entertaining tale. I mean, sure it was classified and dangerous and she might have been violating about a dozen CIA bylaws by telling me, but still she talked, and I listened.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s the thing you\u0027ve got to know,\" she said as she leaned closer. \"Everything\u0027s so crowded that if you blinked at the wrong time you could lose someone, so it\u0027s a tough tail, you know? And I\u0027m up on this balcony, but housekeeping wants to come in and clean the room. This maid is yelling, and I\u0027m calling back, and I look away for—I don\u0027t know— two seconds. Seriously. No way was it longer than that. And when I look back, your dad\u0027s got chocolate on one side of his face and he\u0027s smiling at me.\"\u003c/p\u003e\n\u003cp\u003eAbby threw her head back, and a part of me wanted to laugh alongside her. I tried to imagine my father alive and half a world away. But the other part of me wanted to cry.\u003c/p\u003e\n\u003cp\u003e\"To this day I don\u0027t know how he did it. I went back and looked at the tapes, too.\" She wiped her hands together as if shaking off the dust of some old mystery she\u0027d given up on solving. \"Not a sign of it.\" Then she looked at me anew. \"He was that good.\"\u003c/p\u003e\n\u003cp\u003eShe pushed herself back onto the bed and told me, \"You\u0027re that good.\" The way she looked at me said she\u003c/p\u003e\n\u003cp\u003ewasn\u0027t speaking as an aunt, she was speaking as a spy.\u003c/p\u003e\n\u003cp\u003eBut I didn\u0027t want to be compared to my father in that place. In that way. I didn\u0027t deserve it, so I said, \"I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, maybe you aren\u0027t,\" Abby said, and despite my protest, a wave of hurt ran through me. But then she cocked an eyebrow. \"But you will be.\"\u003c/p\u003e\n\u003cp\u003eA new feeling coursed through me—relief. I felt…like a girl. Like I didn\u0027t know all the answers and that was okay because I still had time to learn them.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re not going to tell my mom?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Abby looked at me. \"So she can get mad at both of us?\"\u003c/p\u003e\n\u003cp\u003eIt seemed like a fair point until I realized…\u003c/p\u003e\n\u003cp\u003e\"But why would she get mad at you?\"\u003c/p\u003e\n\u003cp\u003e\"For showing you this.\" The sound of a heavy notebook dropping onto her wooden dresser caught me off guard. Sheets of paper almost seemed to whistle as she thumbed through the pages.\u003c/p\u003e\n\u003cp\u003e\"The threat book,\" my aunt told me as I looked at the book. The covers could barely contain it. \"This is just this month. This is just Macey—not even counting the rest of the McHenry family,\" She thumbed through the pages, but I didn\u0027t dare to read the words. \"We keep copies of every letter, every e-mail, every 911 call and crazy floral delivery card. We keep track of everything, Cam, and analyze it and study it and do what it is we do.\"\u003c/p\u003e\n\u003cp\u003eShe thumbed through the thick book one final time as she said again, \"This is just this month.\"\u003c/p\u003e\n\u003cp\u003eEvery spy knows that what you don\u0027t say is just as important—maybe more so—than what you do. Aunt Abby didn\u0027t tell me that what was going on was bigger than four Gallagher Girls in training and a secret room. She didn\u0027t tell me that there were a whole lot of psycho people in this world, and a whole lot of them were fascinated by one of my best friends. But those were maybe the only things I was sure of as I stepped toward the door.\u003c/p\u003e\n\u003cp\u003eStill, there was one thing I had to ask.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this symbol?\" I asked, pointing to the satellite photo of the hand, which had fallen to the floor. My aunt casually glanced my way.\u003c/p\u003e\n\u003cp\u003e\"Not sure. That\u0027s one of the leads we\u0027re tracking down. It\u0027s probably nothing, though. They were too good to make a mistake that could lead us to them.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Bex says.\"\u003c/p\u003e\n\u003cp\u003e\"Bex is good.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I said, turning to leave. Then I stopped. \"I\u0027ve seen it before…before Boston.\"\u003c/p\u003e\n\u003cp\u003e\"You remember where?\" Abby asked. A new light filled her eyes, and I got the feeling we were playing a game of covert chicken, both of us waiting to see if the other would blink first.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll come to me,\" I said, which didn\u0027t exactly answer her question, but that\u0027s okay. I got the impression that it didn\u0027t exactly matter.\u003c/p\u003e\n\u003cp\u003e\"If you remember, let me know,\" she said, and I would have bet the farm (or…well…Grandma and Grandpa\u0027s farm) that she already knew. I was halfway to the door when she called, \"Cam.\" She held out a piece of paper. \"Since you\u0027re here, would you mind giving this to Macey?\"\u003c/p\u003e\n\u003cp\u003eI stood in the hall for a long time, reading the first line over and over, wishing the note were written on Evapopaper, trying to find a way to make the words dissolve.\u003c/p\u003e\n\u003cp\u003eItinerary: Saturday, 5:00 a.m. Peacock departs Gallagher Academy for Philadelphia, PA.\u003c/p\u003e\n\u003cp\u003eThings You Can Do When the Life of One of Your Best Friends May Be at Risk, and She\u0027s Got to Help Her Dad Campaign for Vice President Anyway, and You Really, Really Don\u0027t Want Her to Go:\u003c/p\u003e\n\u003cp\u003e1. Sweet-talk Mr. Mosckowitz into moving up the exercise where the ninth graders (the grade Macey was up to now) are locked in a room and can\u0027t get out until they break the Epstein Equation.\u003c/p\u003e\n\u003cp\u003e2. Hack into Secret Service databases, leaving indications that the aforementioned roommate had been making some incredibly dangerous threats against another protectee, Preston Winters (because she totally had).\u003c/p\u003e\n\u003cp\u003e3. If the roommate were to have an allergic reaction to her mother\u0027s experimental night cream, resulting in a terrible zit outbreak that leaves her very unphotogenic and unlikely to test well with undecided women between the ages of 21 and 42 in the process, then maybe she wouldn\u0027t be required on the campaign trail after all!\u003c/p\u003e\n\u003cp\u003e4. Two words: food poisoning (but only as a last resort).\u003c/p\u003e\n\u003cp\u003eThey really were good plans. After all, Bex and I hadn\u0027t just aced Mr. Solomon\u0027s Logistical Thinking and Planning for Success midterm for nothing. Logistically speaking, we\u0027d been about as covert as we could possibly be without coming right out and hog-tying Macey to her desk chair (a plan that Bex proposed frequently).\u003c/p\u003e\n\u003cp\u003eBut Mr. Mosckowitz wasn\u0027t doing the locked room assignment this year, since he\u0027d developed a case of claustrophobia after a top-secret summer assignment that involved a Porta Potti and two Lebanese hairdressers.\u003c/p\u003e\n\u003cp\u003eAnd it turns out the Secret Service doesn\u0027t take death threats by protectees all that seriously. Especially if they\u0027re girls. Even if they\u0027re Gallagher Girls.\u003c/p\u003e\n\u003cp\u003eAnd we should have known that Macey would never get a pimple. Ever. It goes against the laws of nature or something.\u003c/p\u003e\n\u003cp\u003eAnd worst of all, the last part of our master plan didn\u0027t work because a person can\u0027t possibly get food poisoning if the person no longer eats food.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know if it was nerves or fear or if she really was reverting back to the Macey she had been when she came to us a year before, but night after night we sat at the juniors\u0027 table in the Grand Hall while our roommate pushed the food around on her plate—not eating, not laughing. Just waiting for whatever would come next.\u003c/p\u003e\n\u003cp\u003e\"This is bad,\" Liz said Friday morning as we left Culture and Assimilation. The halls were filling up. And time was running out.\u003c/p\u003e\n\u003cp\u003e\"We could always—\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Liz and I both snapped, not really thinking that was the time or place to be reminded of Bex\u0027s \"no one can get out of my slipknots\" argument, but it was Macey who made us stop.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay, guys,\" Macey said. She turned toward Dr. Fibs\u0027s basement lab. \"Thanks for trying and everything, but I\u0027ve got to go.\" The way she said it, I knew that getting her out of her trip wasn\u0027t really up for debate. She shrugged and added, \"It\u0027s the job.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-judge-a-girl-by-her-cover-gallagher-girls-3/page-15.html","bookId":2748,"creation":"Oct 5, 2019 4:50:16 PM","modification":"Oct 5, 2019 4:50:16 PM"}
