{"id":83150,"no":6,"title":"Page 6","content":"\u003cp\u003eThe sirens finally stopped. My mother said, \"It\u0027s time.\"\u003c/p\u003e\n\u003cp\u003eOkay, here\u0027s the thing you need to know about spy schools— it\u0027s not about hiding them. Nope. Because, let\u0027s face it, spy schools have students, and students have parents, and parents are going to ask questions. According to Liz, non-spy parents are really big on obvious questions like \"so where exactly is your school?\" (Spy parents are far more likely to hack into a government database or put a GPS unit in your tooth or something.) In any case, you kinda need an actual school to present to the world; but like everything else about my life, my school wasn\u0027t exactly what it seemed.\u003c/p\u003e\n\u003cp\u003eFollowing my mother down the sweeping Grand Stairs, I couldn\u0027t help but think that our first line of defense was about to be put to the test, because even though the Gallagher Academy has never exactly hidden (it is a big, honking mansion, after all), my school has never gone looking for the spotlight.\u003c/p\u003e\n\u003cp\u003eWhen Gillian Gallagher converted her family\u0027s home into a school where young women could learn the covert skills that no men would ever teach them, she\u0027d had the good sense not to put \"The Gallagher Academy—Educating Government Operatives Since 1865\" on the sign. Instead she\u0027d called it a finishing school for the most outstanding girls of the day. Our cover has evolved with the times, but our ultimate mission has stayed the same: make sure no one ever knows just how exceptional we really are. Which, let\u0027s face it, is a whole lot easier when there aren\u0027t two dozen national news crews videotaping your every move.\u003c/p\u003e\n\u003cp\u003eWhen we reached the foyer, I could have sworn that the entire student body was holding their breath as my mother pulled open the double doors and stepped outside.\u003c/p\u003e\n\u003cp\u003eWarm sunlight beamed down. My stomach growled, and for a second I wondered what our chef was making for the welcome-back dinner. But when I saw three big black SUVs pulling through the gate, I totally lost my appetite.\u003c/p\u003e\n\u003cp\u003e\"Secret Service,\" my mother whispered to us as they started down the winding lane. I remembered that even Macey\u0027s protectors wouldn\u0027t know what we really do behind our walls.\u003c/p\u003e\n\u003cp\u003eAn efficient-looking man with a touch of gray sprinkled through his dark hair climbed out of one of the vehicles and walked toward us. \"Ms. Morgan? Agent Hughes. We spoke on the phone.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Mom said. \"You\u0027re the agent in charge of the McHenry family\u0027s security detail. That is the term, isn\u0027t it?\" she asked, one hand against her chest as if this were totally new territory for her.\u003c/p\u003e\n\u003cp\u003eThe man smiled and nodded. \"Yes, ma\u0027am,\" he told her. \"Now, I don\u0027t want you to worry about anything. Our agents will be responsible for Ms. McHenry\u0027s security. They\u0027ll answer any questions you have and keep you informed of what the Service needs from you. No one is\u003c/p\u003e\n\u003cp\u003eexpecting you to think like a security professional.\"\u003c/p\u003e\n\u003cp\u003e\"That is a relief,\" my mother told him in the most utterly believable, non-ironic voice I\u0027ve ever heard.\u003c/p\u003e\n\u003cp\u003e(Have I mentioned lately that my mom is the BEST SPY EVER?!)\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m sorry,\" my mother said, looking from Agent Hughes and then to us. \"Please allow me to introduce Macey\u0027s roommates. This is Elizabeth Sutton and Rebecca Baxter, and my daughter, Cammie.\"\u003c/p\u003e\n\u003cp\u003eBut Agent Hughes wasn\u0027t listening. He was too busy staring at me—the girl who is hardly ever stared at.\u003c/p\u003e\n\u003cp\u003e\"You were on the roof?\" he asked, but it wasn\u0027t a question. He stepped closer; his gaze flashed across the bandage on my head, then his eyes searched mine. \"Don\u0027t you worry about anything, young lady. We\u0027re going to take good care of all of you.\"\u003c/p\u003e\n\u003cp\u003eI nodded and looked away, thinking about my cover—I was supposed to be scared and tired and ready to let someone else fight for Macey.\u003c/p\u003e\n\u003cp\u003eThen I remembered that the best covers always have their roots in the truth.\u003c/p\u003e\n\u003cp\u003e\"And the walls circle the entire grounds?\" Agent Hughes asked as we walked around the campus.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" my mom said.\u003c/p\u003e\n\u003cp\u003e\"According to the blueprints, you do have security cameras?\" His gaze drifted along our ivy-covered walls.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Mom said calmly. \"Some.\"\u003c/p\u003e\n\u003cp\u003e(Actually, there are 2,546, but for obvious reasons she didn\u0027t share that.)\u003c/p\u003e\n\u003cp\u003e\"Well,\" the agent went on, \"I\u0027m sure our people can consult with you on how to\"—he seemed to be considering his words—\"tighten things up a bit.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" my mom said with a glance toward me—her daughter, who had been slipping through the Gallagher Academy defenses for years. \"That would be most helpful\"\u003c/p\u003e\n\u003cp\u003eAnd then panic set in. The Secret Service was going to be \"tightening\" things?\u003c/p\u003e\n\u003cp\u003e\"As the advance team told you last week, we\u0027ll be placing one of our agents with Ms. McHenry.\"\u003c/p\u003e\n\u003cp\u003eThe Secret Service was going to be \"placing\" people?\u003c/p\u003e\n\u003cp\u003e\"Full-time,\" Agent Hughes added. \"Someone to go with her to classes. Live here. Accompany her everywhere she goes.\"\u003c/p\u003e\n\u003cp\u003eThe Secret Service was going to be \"accompanying\" us places?\u003c/p\u003e\n\u003cp\u003eI looked at Bex and Liz, watched them swallow the same terror I was feeling. Our school has prepared us for a lot of things, but I had to wonder if anything had prepared us for that.\u003c/p\u003e\n\u003cp\u003eBut the surprises were only just beginning, because then my mother smiled and said, \"Of course.\"\u003c/p\u003e\n\u003cp\u003eThe agent walked ahead, appraising our grounds, our walls, our life. At the end of our long (and heavily protected) lane, satellite dishes rose from news trucks, ready to beam pictures of our school around the world, and I knew the most dangerous thing in our history was about to happen in front of this man\u0027s very eyes.\u003c/p\u003e\n\u003cp\u003eAnd there was nothing any of us could do to stop it.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Agent Hughes said when the gates parted for one last car. \"Right on schedule.\"\u003c/p\u003e\n\u003cp\u003eThe limo turned onto the drive, but instead of pulling closer to the mansion, it stopped. Men in dark suits swarmed the car, and I remembered how, a year ago, a car just like that had brought Macey to us. Like deja vu, Senator and Mrs. McHenry climbed from the backseat and stood framed between our great stone gates.\u003c/p\u003e\n\u003cp\u003eI could hear the reporters\u0027 chatter in the distance. The flashing bulbs of their cameras sparkled even in the summer sun.\u003c/p\u003e\n\u003cp\u003eAnd then the car door opened again.\u003c/p\u003e\n\u003cp\u003eAnd just like that the deja vu was over.\u003c/p\u003e\n\u003cp\u003eA year before, Macey had stepped from the backseat of a nearly identical car, but this time, instead of combat boots, she wore pumps almost exactly like her mother\u0027s. Her short skirt and diamond nose stud were replaced with modest black pants, a sweater, and a sling.\u003c/p\u003e\n\u003cp\u003eAt first I hoped her clothing was the only difference; but I barely recognized the girl who allowed her mother to hug her tightly, who didn\u0027t protest when her father took her good hand and lifted their united fists toward the sky.\u003c/p\u003e\n\u003cp\u003eBex cut me a look that said Are you sure you were the one with head trauma? but I just watched the three McHenrys push past the cameras and the questions and start toward the school. Back to us. I thought about the girl who had come to us last fall and the one who had left last spring and, finally, about the young woman who had shivered by a lake, and I wondered which one of Macey\u0027s cover identities she was going to be now.\u003c/p\u003e\n\u003cp\u003eAs they came closer I waited for her to catch my eye and smile that mischievous smile she\u0027d given me outside her parents\u0027 suite in Boston, but when I stepped forward, a broad body in a dark suit moved to block my path.\u003c/p\u003e\n\u003cp\u003e\"Excuse me, miss,\" the Secret Service agent said. It was the first time any of them had seen me as a threat, but I didn\u0027t take it as a compliment.\u003c/p\u003e\n\u003cp\u003eBehind me, I heard my mother say, \"Senator, Mrs. McHenry, it\u0027s so nice to see you both again. I\u0027m only sorry it has to be under such troubling circumstances.\" She gestured toward the front doors. \"Won\u0027t you come in?\"\u003c/p\u003e\n\u003cp\u003eJust when I felt myself getting pushed out of the picture, the procession stopped. The senior senator from Virginia stepped toward me and said, \"Cammie?\" He placed his large hands on both of my shoulders, gripping tightly.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" he said, and I could have sworn I heard his voice crack. When he looked into my eyes, I couldn\u0027t help myself: I felt my lips tremble. My vision blurred. It was easy to remember what having a father feels like as the senator whispered, \"And I\u0027m so sorry.\"\u003c/p\u003e\n\u003cp\u003eIt might have been about the sweetest, most genuine moment in McHenry family history, if Macey\u0027s mother hadn\u0027t then turned to her daughter and whispered, \"Go to the bathroom and put some concealer on that.\" She pointed to the bruise at the corner of Macey\u0027s eye. \"Really,\" she told her daughter, \"there\u0027s no need to look like a common street thug when there aren\u0027t even any cameras around.\"\u003c/p\u003e\n\u003cp\u003eAnd, like that, the moment was over.\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eThere are many things to love about the welcome-back dinner.\u003c/p\u003e\n\u003cp\u003e1. Hearing what everyone did over their summer vacation (which is probably far more interesting at a school where there\u0027s a very good possibility that the stories include actual gunfire).\u003c/p\u003e\n\u003cp\u003e2. The fact that even though Grandma Morgan probably makes the best chicken and dumplings in the entire world, our chef used to work at the White House, and sometimes a girl just needs a little crème brûlée.\u003c/p\u003e\n\u003cp\u003e3. Gossip.\u003c/p\u003e\n\u003cp\u003eBut that night, neither I nor 2 could really hold a candle to 3. At all.\u003c/p\u003e\n\u003cp\u003e\"So, Cammie,\" Tina Walters said as she squeezed onto\u003c/p\u003e\n\u003cp\u003ethe bench across from me, squishing Liz and Anna Fetterman together, \"I heard you put three of them in the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"Tina,\" I sighed, \"it wasn\u0027t like that.\"\u003c/p\u003e\n\u003cp\u003eEva Alvarez was trying to sign Macey\u0027s cast, which was difficult because the campaign manager didn\u0027t want anything to obscure the big Winters-McHenry sticker already plastered on Macey\u0027s forearm. Bex was picking apart one of the rolls from the basket on the table (even though the teachers hadn\u0027t made their entrance yet and, therefore, eating could be punishable by death—or at the very least some serious Culture and Assimilation extra homework if Madame Dabney caught you.)\u003c/p\u003e\n\u003cp\u003e\"And, Macey\"—Tina whirled on the girl beside me— \"rumor has it you were spotted In a compromising position with a certain future first son.\"\u003c/p\u003e\n\u003cp\u003eAnd just like that, everything got quiet again.\u003c/p\u003e\n\u003cp\u003eThe entire junior class turned and stared, but I kept doing exactly what I had been: studying Macey. The snob who had come to us a year before would have scoffed; the girl who had covered two years\u0027 worth of advanced encryption in nine months might have rolled her eyes; but the girl beside me simply said, \"Someone needs better sources.\"\u003c/p\u003e\n\u003cp\u003eIt was the first time she\u0027d spoken, and something in her tone made me wonder whether or not the girl by the lake was gone for good.\u003c/p\u003e\n\u003cp\u003e\"So, who thinks we\u0027ll have to stay in Code Red all semester?\" Anna Fetterman asked, not even trying to disguise the fear in her voice.\u003c/p\u003e\n\u003cp\u003eMy roommates and I all looked at each other, the scene that we\u0027d witnessed outside playing over all of our faces.\u003c/p\u003e\n\u003cp\u003e\"Well, they are going to give you a full-time Secret Service detail, aren\u0027t they?\" Tina asked.\u003c/p\u003e\n\u003cp\u003eMacey nodded.\u003c/p\u003e\n\u003cp\u003e\"Maybe the Secret Service … you know\"—Liz hesitated and then lowered her voice to a whisper—\"knows.\"\u003c/p\u003e\n\u003cp\u003eBut all I could think about were the agents who had questioned me after Boston, the lies I\u0027d already had to tell to keep our secret safe.\u003c/p\u003e\n\u003cp\u003e\"Mom wouldn\u0027t,\" I started. \"She wouldn\u0027t agree to that.\"\u003c/p\u003e\n\u003cp\u003e\"It would be a pretty good test, though, wouldn\u0027t it?\" Bex asked. I could tell by the tone of her voice that she was already gearing up for the challenge—the thought of bringing the outside world inside our walls, the danger, the risk, the possibility of knocking a member of the United States Secret Service unconscious at some point during the semester. \u003c/p\u003e","sourceLink":"https://allnovel.net/don-t-judge-a-girl-by-her-cover-gallagher-girls-3/page-6.html","bookId":2748,"creation":"Oct 5, 2019 4:50:16 PM","modification":"Oct 5, 2019 4:50:16 PM"}
