{"id":79437,"no":15,"title":"Page 15","content":"\u003cp\u003eMy ears perked up at the sound of her voice like I was a dog and someone just said, \"cookie.\" The shot was halfway to my lips and I held it in place as she took a step forward and shook the hair out of her eyes.\u003c/p\u003e\n\u003cp\u003eHoly shit, she was beautiful. And not beer goggles beautiful. I was pretty sure that if I was sober she’d still look good. Long, wavy brown hair, smooth skin and the most gorgeous brown eyes I’d ever seen.\u003c/p\u003e\n\u003cp\u003e\"Oh shut your yap. You know the Fosters could care less if you drink while you\u0027re on the job. You\u0027re like the daughter they never had.\"\u003c/p\u003e\n\u003cp\u003eThose eyes. There was something about them that made it impossible for me to look away.\u003c/p\u003e\n\u003cp\u003e\"Liz, the Fosters have a daughter.\"\u003c/p\u003e\n\u003cp\u003e\"Patty plays softball and can bench press two hundred and fifty pounds. Her dick is probably bigger than this guy\u0027s,\" she said, hooking her thumb towards Drew.\u003c/p\u003e\n\u003cp\u003e\"Heeeeey,\" Drew said defensively.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t stop staring. I just wanted her to look at me. Why wouldn’t she look at me? Her friend wouldn’t shut up and she wouldn’t look at me.\u003c/p\u003e\n\u003cp\u003e\"Sorry, big guy. I\u0027m sure you have a very nice dick.\"\u003c/p\u003e\n\u003cp\u003e\"Well, thank you. How about you and I…\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t even finish that sentence,\" she said with a roll of her eyes and a shake of her head. \"I saw you sneak into the women\u0027s bathroom to f**k Jerky Jade not more than twenty minutes ago. Are you seriously flirting with me right now?\"\u003c/p\u003e\n\u003cp\u003e\"Jerky Jade? I thought her name was Alison.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re such a man whore. Her name is Jade. She always smells like beef jerky so we call her Jerky Jade. And you stuck it to her. You stuck your penis in her meaty vagina.\"\u003c/p\u003e\n\u003cp\u003eWhile Drew and Blondie continued their verbal sparring, I continued to stare at the quiet one. I wanted to touch her hair and see if it was as soft as it looked. I bet I could use her hair as a pillow, a silky, furry hair pillow that I could finger all night to help me get to sleep.\u003c/p\u003e\n\u003cp\u003eNo, that doesn\u0027t sound creepy at all. I should really stop drinking. Who keeps putting alcohol in my alcohol?\u003c/p\u003e\n\u003cp\u003e\"Jesus, Liz, keep it down. She\u0027s right over there.\"\u003c/p\u003e\n\u003cp\u003eMy ears perked up like a dog’s again when she spoke and pointed in the general direction of the chick that smelled of Slim Jims.\u003c/p\u003e\n\u003cp\u003eI hope I don\u0027t start barking.\u003c/p\u003e\n\u003cp\u003e\"Oh, please, like she doesn\u0027t know about the smell of meat products wafting from her lady parts. I think she rubs bologna down there to attract men. Lunch meat is her sex pheromone.\"\u003c/p\u003e\n\u003cp\u003eThe brunette shook her head in irritation. \"If I do a shot, will you please stop talking about Jade\u0027s disgusting vagina and never, ever use the word meat product in a sentence?\"\u003c/p\u003e\n\u003cp\u003e\"Woof!\"\u003c/p\u003e\n\u003cp\u003eThree sets of eyes all turned to look at me.\u003c/p\u003e\n\u003cp\u003e\"Did I just bark out loud?\"\u003c/p\u003e\n\u003cp\u003eThree heads bobbed up and down in unison.\u003c/p\u003e\n\u003cp\u003e\"I dated a guy once that had wet dreams almost every night. I\u0027d wake up to him humping his pillow and howling in his sleep,\" Liz said wistfully, taking the heat off of me for a minute.\u003c/p\u003e\n\u003cp\u003eThe beautiful one came right up to the bar then and grabbed the shot glass closest to me but still wouldn\u0027t look up. She kept her eyes down in the glass like it held the meaning of life.\u003c/p\u003e\n\u003cp\u003e\"So, what are we drinking to?\" she asked the shot glass.\u003c/p\u003e\n\u003cp\u003e\"Do your shot glasses usually respond?\" I asked with a laugh, throwing her words from earlier back at her.\u003c/p\u003e\n\u003cp\u003eHer eyes shot up to mine and I felt like I had been punched in the gut. Her eyes were so bright and shiny they looked like melted chocolate.\u003c/p\u003e\n\u003cp\u003eFuck. Why the hell was I obsessing about chocolate again? It had been years since I thought about that night and now all of a sudden I couldn\u0027t get away from it. I thought I smelled it earlier and that stupid flashback floated through my mind, and now I was comparing this chick\u0027s eyes to it. It was chocolate for f**k\u0027s sake. It was everywhere. There was nothing special about chocolate.\u003c/p\u003e\n\u003cp\u003eExcept she had smelled like chocolate.\u003c/p\u003e\n\u003cp\u003eAfter that night, I’m ashamed to say I went through a phase for a few months of smelling lotion and soap at every single store I was in but they never smelled exactly right. The only thing that came even remotely close was real chocolate. I used to wonder if she rubbed Hershey\u0027s behind her ears instead of perfume. And then I\u0027d wonder if she tasted like chocolate, and I\u0027d have to rub one out after kicking myself in the ass for not tasting her that night.\u003c/p\u003e\n\u003cp\u003eWho was I kidding? It hadn\u0027t been years since I thought about her. Every f**king time I was within a mile radius of someone eating chocolate I thought about her. Shit. It was all Tasha’s fault that I was here right now obsessing about chocolate. My job relocation was going to give us a brand new start in a new place. The fighting between us those last couple of months were brutal, and we both agreed a change of scenery would do our relationship a world of good. Knowing she was going to make the move to this small town with me made it not seem so shitty. Fucking c**k sucker. Literally. Too bad it was never my c**k she sucked. She did it once and said she had TMJ or some shit and never did it again.\u003c/p\u003e\n\u003cp\u003eTMJ my ass.\u003c/p\u003e\n\u003cp\u003eWomen were the devil. They led you along for years, making you think you would have a future together and then one day you came home and found her on her knees with the neighbor\u0027s dick in her mouth and\u0026nbsp; p**n\u0026nbsp; playing on the television. It was all fun and games until someone else\u0027s dick was in your girlfriend\u0027s TMJ mouth. And it wasn\u0027t even good\u0026nbsp; p**n\u0026nbsp; that was playing. It was Looney Toons\u0026nbsp; p**n . I shit you not folks. She sucked our neighbor off while Daffy Duck took it up the ass from Bugs Bunny shouting, \"P-p-p-p-p-weathe Bugs, harder.\" That is some serious shit that could never be unseen. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-15.html","bookId":1853,"creation":"Oct 5, 2019 4:17:54 PM","modification":"Oct 5, 2019 4:17:54 PM"}
