{"id":79458,"no":38,"title":"Page 38","content":"\u003cp\u003e\"Yes, Mommy, tell us. Are you going to spank Carter for being a bad boy?\" Liz said in her best Marilyn Monroe voice. In the chaos of the shit storm that was happening, I never really got a good look at the kid Claire was holding. His back had been facing me up until a few seconds ago and I hadn’t been paying much attention when I caught him from running away outside. Claire had to shift him to her other arm so she could smack Liz. He was staring right at me now. He was a really good-looking kid. But that wasn\u0027t surprising since he looked just like her. But there was something about him...\u003c/p\u003e\n\u003cp\u003eI cocked my head to the side and he did the same. I realized no one was speaking but I couldn\u0027t take my eyes off of him. The edges of my vision started to turn black and I felt like I was going to pass out. He had my eyes. He had my f**king eyes! I quickly tried to do the math but my brain was a jumbled mess and I couldn’t remember what number comes after potato!\u003c/p\u003e\n\u003cp\u003eWhat the f**k is happening right now? This couldn\u0027t be real. My sperm betrayed me. I suddenly had a vision of my sperm swimming around and talking in Bruce Willis\u0027s voice like in Look Who\u0027s Talking. \"Come on! Swim faster! This little shit has no idea we escaped from the condom! Yippee-ki-yay, motherfucker!\"\u003c/p\u003e\n\u003cp\u003eMy Bruce Willis sperm is bad ass and thinks he\u0027s John McClane from \"Die Hard.\" That is the only explanation for this f**kery.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" I asked the kid with my eyes when I finally found my voice.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Gavin Morgan, who the hell are you?\"\u003c/p\u003e\n\u003cp\u003e11. Good Vibrations\u003c/p\u003e\n\u003cp\u003eOh f**k.\u003c/p\u003e\n\u003cp\u003eMy dad was going to kill Carter before I even got a chance to tell him that he was a father. Although, I was pretty sure that ship has sailed. He\u0027s either mentally challenged or in shock. Or I completely missed the fact that he liked to shout about hairy balls and being spanked.\u003c/p\u003e\n\u003cp\u003eGavin did like to talk about his balls all the time. Could be hereditary…\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" Carter whispered, staring straight at Gavin like he was trying to figure out the square root of pi in his head.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Gavin Morgan, who the hell are you?\"\u003c/p\u003e\n\u003cp\u003e\"GAVIN!\" we all scolded, except for Carter. He still looked like he might throw up.\u003c/p\u003e\n\u003cp\u003eShit, this was so not how I saw this happening. I knew after all of our conversations and how much I’d gotten to know Carter that I was going to have to come clean soon. And I had planned on telling him today, easing him into it.\u003c/p\u003e\n\u003cp\u003eAfter I plied him with enough alcohol to choke a horse.\u003c/p\u003e\n\u003cp\u003e\"This is one of mommy\u0027s friends, buddy,\" I told Gavin. \"Friend\" seemed better than \"the father you never knew you had\" or “the guy who knocked mommy up” at the moment. I could wait until he was a teenager to scar him with that information.\u003c/p\u003e\n\u003cp\u003eGavin started to get bored with the lack of excitement in the room since everyone pretty much just stood there and waited for Carter’s brain to explode. Gavin had the attention span of a two-year-old with ADD on crack. He started to squirm in my arms so I put him down. I held my breath as he stalked right over and stood in front of Carter with his hands on his hips.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re Mommy\u0027s fwiend?\" he questioned.\u003c/p\u003e\n\u003cp\u003eCarter just nodded with his mouth open and no sound coming out. I’m pretty sure he didn’t even hear Gavin. Someone could have asked him if he liked to watch g*y\u0026nbsp; p**n\u0026nbsp; while painting pictures of kittens and he would have nodded his head.\u003c/p\u003e\n\u003cp\u003eBefore anyone could react, Gavin pulled back one of his little fists of fury and slammed it right into Carters manhood. He immediately bent over at the waist, clutching his hands between his legs and gasping for breath.\u003c/p\u003e\n\u003cp\u003e\"Oh my God! Gavin!\" I yelled, as I scrambled over to him, bent down and turned him around to face me while my dad and Liz laughed like hyenas behind me.\u003c/p\u003e\n\u003cp\u003e\"What is wrong with you? We don\u0027t hit people. EVER,\" I scolded.\u003c/p\u003e\n\u003cp\u003eWhile Carter tried to breathe again, my dad managed to stop laughing long enough to apologize.\u003c/p\u003e\n\u003cp\u003e\"Sorry, Claire, that\u0027s probably my fault. I let Gavin watch \"Fight Club\" with me last night.\"\u003c/p\u003e\n\u003cp\u003eI am Claire’s complete mortification.\u003c/p\u003e\n\u003cp\u003e\"Your fwiends got you sick the other night. You said he was your fwiend,\" Gavin explained, like it made all the sense in the world.\u003c/p\u003e\n\u003cp\u003eThis just made my dad laugh even louder.\u003c/p\u003e\n\u003cp\u003e\"Not helping, Dad,\" I growled through clenched teeth.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t make my mommy sick, dicky-punk!\" Gavin yelled at Carter, putting his two little fingers up by his eyes, and then pointing them right at Carter just like Liz had done to him earlier.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ,\" Carter wheezed. \"Did he just threaten me?\"\u003c/p\u003e\n\u003cp\u003e\"Jesus Cwist!\" Gavin repeated back.\u003c/p\u003e\n\u003cp\u003eLiz scurried over then and scooped Gavin up into her arms.\u003c/p\u003e\n\u003cp\u003e\"Okay, little man, how about me, you and Papa go for a walk and talk about big-people words?\" she asked him as she walked over to my dad and grabbed him around the elbow.\u003c/p\u003e\n\u003cp\u003eI stood up and shot her a look of thanks. She just smiled and dragged my dad out the door with Gavin talking her ear off about something he saw on Spongebob.\u003c/p\u003e\n\u003cp\u003eWhen Carter and I were finally alone, I chanced a look at him. He didn\u0027t look pissed. He didn\u0027t look sad. He just looked like he had no idea where he was or what day it was. We stood there looking at each other for several minutes until the silence finally got to me.\u003c/p\u003e\n\u003cp\u003e\"Would you please say something?\" I begged.\u003c/p\u003e\n\u003cp\u003eJust moments ago I was blissfully happy that he finally figured out who I was. He held me close and he was going to kiss me. Now everything was ruined and it was my fault for not telling him sooner. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-38.html","bookId":1853,"creation":"Oct 5, 2019 4:17:54 PM","modification":"Oct 5, 2019 4:17:54 PM"}
