{"id":79469,"no":49,"title":"Page 49","content":"\u003cp\u003e\"I know this doesn\u0027t make up for the shittiness of that night, but I want to make you feel good, Claire. Can I touch you?\" he asked softly against my lips while he looked into my eyes.\u003c/p\u003e\n\u003cp\u003eCould he not feel my quivering loins and the brain screams?\u003c/p\u003e\n\u003cp\u003eI need your fingers inside me!\u003c/p\u003e\n\u003cp\u003eYep, you guessed it.\u003c/p\u003e\n\u003cp\u003e\"Fuck. That was the hottest thing I have ever heard.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have time to be mortified that I’d spoken out loud. He was doing what I asked and his hand was sliding all the way under the edge of my shorts until I felt his fingers slide up the front of my underwear.\u003c/p\u003e\n\u003cp\u003e\"Holy f**k,\" I muttered and jerked my hips into his hand.\u003c/p\u003e\n\u003cp\u003eNo one had ever touched me like this. I thought touch was all the same and brought on the same feelings whether it was a guy or myself fumbling around down there.\u003c/p\u003e\n\u003cp\u003eClearly I was mistaken.\u003c/p\u003e\n\u003cp\u003eCarter’s fingers moving up and down ever so slowly against the thin scrap of satin made me want to scream my head off in pleasure.\u003c/p\u003e\n\u003cp\u003e\"I can feel how wet you are,\" he whispered as his fingers moved to the side and toyed with the edge of my underwear.\u003c/p\u003e\n\u003cp\u003eHearing dirty talk from other people always made me blush and feel embarrassed for them and the weird stuff that came out of their mouths. I mean really, can they hear themselves? It\u0027s corny and all \"fuck me harder big boy\" and \"oh you\u0027re so tight baby\". Who says that crap? Obviously I had been missing out on Carter’s dirty talk. It was hot. And I didn\u0027t want him to stop. He could talk about how tight, wet and fan-fucking-tastic I was all night long. He placed several small kisses to my lips as he took his sweet time working his fingers under the thin scrap of material and used the heal of his hand to push the leg of my shorts open wider to give him better access. I held my breath and tried not to think about the fact that I\u0027d never had a guy touch me like this. That was just sad, really. And even more depressing was the fact that I was feeling sorry for myself when his fingers were getting ready to go for a swim at the Y.\u003c/p\u003e\n\u003cp\u003eI broke up the pity party when I felt two of his fingers come in contact with my bare, wet skin.\u003c/p\u003e\n\u003cp\u003e\"Oh my God,\" I mumbled, letting my head fall back against the wall with a thud.\u003c/p\u003e\n\u003cp\u003eYep, much better than my own fingers. My own fingers were now going to feel like Sinbad\u0027s hands in the movie Houseguest when he gets Novocain all over them and they flop around like dead fish, knocking shit off of the table. His fingers were smooth and soft and holy f**k they were touching me, feeling just how much I wanted this and that Liz forced me get waxed regularly.\u003c/p\u003e\n\u003cp\u003eNote to self: apologize to Liz for calling her a Sadistic Vagina-Nazi Bitch every time she made a Brazilian wax appointment for me. Because of her dedication to my who-ha, Carter doesn\u0027t have to discover a wildebeest in my pants right now and stop what he\u0027s doing to go in search of a weed whacker.\u003c/p\u003e\n\u003cp\u003eHe swooped in and placed an open-mouthed kiss on my neck and slowly pushed a finger inside of me, letting his thumb rest against my clit while he gave me time to adjust to what he was doing.\u003c/p\u003e\n\u003cp\u003eHe held his finger perfectly still inside me, and I clutched harder onto the back of his head and pushed my hips forward, making his finger go in deeper and his thumb slide against me.\u003c/p\u003e\n\u003cp\u003eThis was too much and not enough and I felt like this was going to be over long before I wanted it to because the way he moved his fingers was pure genius. And that was just shocking in and of itself. I always needed a full reel of clips from\u0026nbsp; p**n\u0026nbsp; movies flipping through my mind in order to finish. I couldn\u0027t think about anything but what he was doing to me right now. Naughty Neighbors, MILF Madness - none of those were necessary.\u003c/p\u003e\n\u003cp\u003eHe started pushing and pulling his finger in and out of me slowly and did some glorious maneuver where he curled his finger before he started pulling it out that made me want to pant like a dog and lick the side of his face. His lips and tongue found every inch of my neck and his thumb circled faster until I was rocking my hips into his hand almost forcefully.\u003c/p\u003e\n\u003cp\u003eI was whimpering and moaning and I didn\u0027t have time to be embarrassed that I sounded kind of like a dirty slut or that there was a real live guy who was really touching my vagina because I was really one second away from exploding.\u003c/p\u003e\n\u003cp\u003eReally.\u003c/p\u003e\n\u003cp\u003eHe pulled his finger out of me and used the pad of two fingers to circle my clit until I completely fell apart against his hand.\u003c/p\u003e\n\u003cp\u003e\"Ohhh, oh, God! Fuck. Carter!\"\u003c/p\u003e\n\u003cp\u003eHis fingers didn\u0027t stop and he swallowed my cries with his mouth while I pushed against his hand, never wanting this feeling to stop. I made all kinds of noises into his mouth while he continued to kiss me and pull every ounce of my orgasm out of me until my legs were trembling and I could barely stand. When I stopped moving my hips and the last of my release faded away, he pulled his hand out from my shorts and wrapped his arm around me, kissing me slowly, letting his tongue lazily slide against my own. I didn\u0027t know how long we stood there in the storage room wrapped in each other\u0027s arms kissing. I could have spent hours kissing him and never come up for air.\u003c/p\u003e\n\u003cp\u003eWe finally pulled our mouths apart and stood there staring at each other.\u003c/p\u003e\n\u003cp\u003e\"That was the hottest thing I’ve ever seen. I should have done that five years ago,\" Carter said with a smile.\u003c/p\u003e\n\u003cp\u003e\"Baby, if you would have done that five years ago, I would have handcuffed my vagina to your arm and made you do that to me every single day.\"\u003c/p\u003e\n\u003cp\u003eCarter laughed and then his face immediately got serious.\u003c/p\u003e\n\u003cp\u003e\"Claire, I need to ask you something. And it\u0027s really important.\"\u003c/p\u003e\n\u003cp\u003eOh my God, he was going to ask me to have a threesome. Or tell me he was really from Canada and needed a green card and that\u0027s the only reason he was here. Oh shit, what if he didn\u0027t like my vagina? Did it feel funny? I should have felt around down there more often. My gyno never complained. In fact, he told me I had a very nice uterus. Why the hell didn\u0027t Carter like my vagina? Shit, what if he was into dendrophilia and liked to have sex with trees? \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-49.html","bookId":1853,"creation":"Oct 5, 2019 4:17:54 PM","modification":"Oct 5, 2019 4:17:54 PM"}
