{"id":79474,"no":54,"title":"Page 54","content":"\u003cp\u003eShut up, clowns are scary as f**k.\u003c/p\u003e\n\u003cp\u003eI looked back down at the incredible woman standing in front of me and knew I felt the same way about her.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want the boogey man to get you and I hate clowns,\" I blurted out.\u003c/p\u003e\n\u003cp\u003eShe laughed and patted my cheek in sympathy. I sucked at this. I didn\u0027t do well under pressure. I cared about her and Gavin and I just wanted her to know I wasn\u0027t going anywhere. How f**king hard was that to say?\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I mean. I mean, yes, I hate clowns. They are dumb and creepy and grown men should never wear anything with polka dots or giant shoes.\"\u003c/p\u003e\n\u003cp\u003eGod dammit, stop the word vomit!\u003c/p\u003e\n\u003cp\u003eBefore I could open my mouth and stick a giant clown shoe in any further, Claire covered my mouth with her hand.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay if you\u0027re freaked out. I wouldn\u0027t blame you, believe me. This is a lot to take in,\" she said softly. “All of a sudden you go from single and free to having a built-in family.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath and tried it again, reaching up and pulling her hand away from my mouth and resting it flat against my chest.\u003c/p\u003e\n\u003cp\u003e\"Let me just start off by saying I really, really suck ass at doing the whole \"touchy-feely, talk about my feelings\" shit. Although if you ask Drew, he would surely disagree since he spent five years listening to me whine like a baby about how much I wanted to find you. After all that time and spending years driving everyone around me crazy just trying to find your smell again, I am not about to f**k this up and run screaming into the night.\"\u003c/p\u003e\n\u003cp\u003eHer thumb moved back and forth over my chest and she brought her other hand up to my cheek before leaning forward and placing a soft kiss on my lips. When she pulled her face back, I wrapped my arms around her small waist and rested my forehead against hers.\u003c/p\u003e\n\u003cp\u003e\"I know after I found out I fled the scene like a hit-and-run driver, but I promise you Claire, I will never get spooked again.\"\u003c/p\u003e\n\u003cp\u003eShe pulled back and looked me in the eye, the corners of her mouth turning up in a smile.\u003c/p\u003e\n\u003cp\u003e\"Did you really just quote Cocktail to me right now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, yes I did. If you\u0027d like me to go all crazy Tom Cruise and jump up and down on a couch for you, I\u0027ll totally do it.\"\u003c/p\u003e\n\u003cp\u003e\"ARE YOU KIDDING ME?! I WOULD RATHER TAKE IT UP THE ASS!\"\u003c/p\u003e\n\u003cp\u003eDrew’s booming voice from the living room pulled our attentions away from each other. We took one last look at Gavin before closing his door, and then walked hand in hand down the hall to find everyone sitting around the living room playing a twisted game of \"would you rather\".\u003c/p\u003e\n\u003cp\u003eClaire and I sat down next to each other on the couch. I put my arm around her shoulders and she snuggled into my side. Nothing had felt this perfect in a long time.\u003c/p\u003e\n\u003cp\u003e\"Alright, my turn,\" Drew said. \"Jim, would you rather have your\u0026nbsp; p**n\u0026nbsp; name be Hugh G. Rection or Mike Unstinks?\"\u003c/p\u003e\n\u003cp\u003e15. I’m a Dirty Slut\u003c/p\u003e\n\u003cp\u003e\"Chains and whips excite me...c-c-c-come on, come on...S-S-S-S-M-M-M...\"\u003c/p\u003e\n\u003cp\u003e\"Gavin Allen Morgan, if you don\u0027t stop singing that song I am going to put you on the curb for the garbage men to pick up,\" I yelled for the tenth time today as I finished cleaning up the kitchen from lunch.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s boring,\" Gavin muttered before stomping off to his room.\u003c/p\u003e\n\u003cp\u003e\"Speaking of garbage, when is that Christy guy going to be here?\" my dad asked from his seat at the kitchen table.\u003c/p\u003e\n\u003cp\u003eWhy is everyone determined to get on my nerves today?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s CARTER, Dad. Stop being an ass. He\u0027ll be here when he wakes up.\"\u003c/p\u003e\n\u003cp\u003eMy dad made a production of looking down at his wrist where there wasn’t even a watch.\u003c/p\u003e\n\u003cp\u003e“It’s 12:48. What kind of a slacker is this guy?”\u003c/p\u003e\n\u003cp\u003eI threw the dish towel on the counter and turned to give my dad a dirty look.\u003c/p\u003e\n\u003cp\u003e“He works the nightshift, dad. We’ve been over this already. One more comment out of you and I’m changing your Facebook status to “I love penis.”\u003c/p\u003e\n\u003cp\u003eI walked over to the fridge to add a few things to my shopping list that hung off of the freezer and tried not to glance at the clock. I was definitely anxious to see Carter.\u003c/p\u003e\n\u003cp\u003eI was up to my eyeballs in stuff for the grand opening and Carter was working a lot of overtime so we hadn\u0027t seen each other since the night of dinner a week earlier. But we talked on the phone and he also called a few times just to talk to Gavin, which totally made my heart melt.\u003c/p\u003e\n\u003cp\u003eThoughts of our time in the storage room earned me extra credit in Liz Homework by making my way through my suitcase of \"who needs a man\" products for a second time. Liz got all choked up on the phone when I told her. It was a beautiful moment for the two of us.\u003c/p\u003e\n\u003cp\u003eI was working at the bar tonight so Carter was going to give me a ride up there. I called Liz and told her she and Jim should come so Carter wouldn\u0027t be bored.\u003c/p\u003e\n\u003cp\u003e\"I think maybe I\u0027ll hide behind the couch and jump out when he gets here. Put the fear of George into him,\" my dad said with a nod of his head.\u003c/p\u003e\n\u003cp\u003e\"Not funny. And don\u0027t you mean \"fear of God\"?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Same thing.\"\u003c/p\u003e\n\u003cp\u003eGod said \"Let there be light\" and George Morgan flipped the switch.\u003c/p\u003e\n\u003cp\u003eThis was the most my dad had spoken about Carter since they met. Granted, it wasn\u0027t very flattering but hey, it was progress. At least he was acknowledging his existence and not thinking up new ways to kill him. Dad had been going down the alphabet for a week now and finally stopped at the letter S.\u003c/p\u003e\n\u003cp\u003eDeath by shopping cart suffocation, in case you were wondering.\u003c/p\u003e\n\u003cp\u003eThe doorbell rang and I hurried to answer it. I wiped my hands on the front of my jeans, smoothed my hair and bent forward to reach my hand down the front of my shirt and tug each of the girls up so their prime real estate was on full display. I stood back up, took a deep breath and flung the door open. My heart actually skipped a beat when I saw Carter standing there. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-54.html","bookId":1853,"creation":"Oct 5, 2019 4:17:54 PM","modification":"Oct 5, 2019 4:17:54 PM"}
