{"id":100861,"no":81,"title":"Page 81","content":"\u003cp\u003e\"Claire has pretty boobies,\" Jenny muttered while she looked down the front of her shirt.\u003c/p\u003e\n\u003cp\u003eI attached the boob shot to a blank text message and typed the words, \"We miss you,\" then hit send.\u003c/p\u003e\n\u003cp\u003eThat was empowering! I felt all sorts of Joan of Arc-like now. But maybe more \"The Legend of Billie Jean\" movie version of her. Burning at the stake doesn\u0027t sound like fun. But I could totally rock a short hair cut and get people to chant \"fair is fair\" as they follow me and my outlaw friends across state lines. I turned my phone towards Liz and showed her the text.\u003c/p\u003e\n\u003cp\u003e\"Oh, young grasshopper, it is clear you can be taught,\" Liz said as she wiped a fake tear out of her eye.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t feel very lurid right now,\" Jenny slurred as she flopped onto her back and stared at the ceiling.\u003c/p\u003e\n\u003cp\u003e\"Lucid! It\u0027s lucid, Jenny. For f**k\u0027s sake, someone get this bitch an Encyclopedia Britannica,\" Liz yelled from her spot on the floor.\u003c/p\u003e\n\u003cp\u003e\"FAIR IS FAIR!\" I yelled as I fist pumped.\u003c/p\u003e\n\u003cp\u003eI started folding some more of the flyers while Liz crawled over to Jenny and tried to lead her in a Hooked on Phonics boot camp. While Liz made her do push-ups and repeat words back to her, I got up and went to the kitchen to cut up some cheese and grab a plate of crackers.\u003c/p\u003e\n\u003cp\u003eIn hindsight, wielding a cheese grater when my blood type was currently Merlot positive wasn\u0027t the best idea.\u003c/p\u003e\n\u003cp\u003e\"Kick him in the nut sack!\"\u003c/p\u003e\n\u003cp\u003eI sat down on the couch and rolled my eyes as the UFC fight we watched started a new round.\u003c/p\u003e\n\u003cp\u003e\"Okay, seriously. Enough with the nut kicking talk,\" I scolded.\u003c/p\u003e\n\u003cp\u003eDrew looked at me and pouted, \"Oh come on, your kid isn\u0027t even awake.\"\u003c/p\u003e\n\u003cp\u003eI looked behind me where Gavin had fallen asleep on the couch. His little body was draped over the arm of the couch, his head and arms dangling down towards the floor, his knees pushed into the cushions. How in the hell does he fall asleep like that?\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just trying to save you from the wrath of Claire. Really, it\u0027s for your own safety,\" I told him as I looked at his shirt that showed a couple walking in the sand with the words, \"I enjoy long walks on the beach…after anal.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll put my nuts on all of you,\" Gavin’s muffled voice said from his hanging position off the end.\u003c/p\u003e\n\u003cp\u003eI looked at Drew pointedly.\u003c/p\u003e\n\u003cp\u003e\"Hey, Carter,\" Jim said as he walked back in from the kitchen. \"Why is Claire sending me a picture of her tits with the words, \"Me fish Lou,\" in it?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Drew and I both asked in unison.\u003c/p\u003e\n\u003cp\u003eJim held his cell phone out to me as I leaned forward to see it.\u003c/p\u003e\n\u003cp\u003e\"Seriously? Claire’s tits are on that phone?\" Drew yelled as he jumped up from the couch and tried to grab the phone before I got to it.\u003c/p\u003e\n\u003cp\u003eI panicked, flew off the recliner in the corner and onto Drew’s back, wrapping my arms around his neck.\u003c/p\u003e\n\u003cp\u003e\"What the f**k are you doing? Get off my back you dumbass,\" Drew yelled as he twisted and turned, trying to throw me off.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you even think about looking at that picture, dick licker,\" I threatened as I tried holding on to his neck with one arm and reached for Jim’ phone with the other.\u003c/p\u003e\n\u003cp\u003eThe phone suddenly beeped and Jim pulled it towards him, rolling his eyes at what he saw.\u003c/p\u003e\n\u003cp\u003eDrew stopped moving and we both just stood there. Well, Drew just stood there; I was still hanging from his back like a wet noodle.\u003c/p\u003e\n\u003cp\u003e\"Okay, now Jenny is asking me if I want to eat in China tonight. What the f**k is wrong with your women?\"\u003c/p\u003e\n\u003cp\u003eI dropped off of Drew’s back and Jim handed me his phone. I scrolled to the text from Claire and my jaw dropped.\u003c/p\u003e\n\u003cp\u003eYep, those were her tits. Sweet Jesus. I forwarded the text to my phone, you know, so I could ask her about it later...and stuff.\u003c/p\u003e\n\u003cp\u003eThe phone rang in my hands and caller I.D. said it was Liz.\u003c/p\u003e\n\u003cp\u003e\"Go ahead and answer it. You can ask her why Claire is sending me nudey pictures,\" Jim said with a laugh.\u003c/p\u003e\n\u003cp\u003eI hit \"send\" and put the phone to my ear, quickly pulling it away when I heard muffled screams through the receiver.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ, who\u0027s screaming?\" Drew asked with a cringe.\u003c/p\u003e\n\u003cp\u003eI shook my head and shrugged my shoulders, attempting to put the phone back to my ear.\u003c/p\u003e\n\u003cp\u003e\"I swear to f**king God if you puke in this cab I will punch you in the neck! Stop being a pu**y!\"\u003c/p\u003e\n\u003cp\u003e\"Hey!\" I yelled, trying to be heard over the screams. \"HELLO!\"\u003c/p\u003e\n\u003cp\u003eThe screams continued and the three of us moved into the kitchen so we wouldn\u0027t wake Gavin.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a mother for Christ\u0027s sakes! It\u0027s just a little blood. Will you stop screaming?\"\u003c/p\u003e\n\u003cp\u003e\"LIZ! HELLO!\" I yelled again, once we got to the kitchen.\u003c/p\u003e\n\u003cp\u003eDrew was laughing but I knew those screams. And hearing Liz mention the word \"blood\" freaked me out a little. Was Claire bleeding?\u003c/p\u003e\n\u003cp\u003e\"Drew, call Jenny,\" I said quickly.\u003c/p\u003e\n\u003cp\u003eA few seconds later I heard ringing through my end of the phone call and the sound of Jenny’s voice over Claire’s screams and Liz’s yelling. I hung up since I wasn\u0027t getting anywhere and turned to face Drew.\u003c/p\u003e\n\u003cp\u003e\"Awww, I love you too, Snuggie!\"\u003c/p\u003e\n\u003cp\u003eI punched Drew in the shoulder and indicated that he should get to the point by giving him the finger.\u003c/p\u003e\n\u003cp\u003e\"Hey, baby, what\u0027s going on? Why is Claire screaming?\" he asked, pulling the phone back and hitting the speaker button.\u003c/p\u003e\n\u003cp\u003eThe screaming and arguing burst into the room and we all winced.\u003c/p\u003e\n\u003cp\u003e“Claire’s got nice boobies,\" Jenny said.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-81.html","bookId":1853,"creation":"Oct 5, 2019 9:49:55 PM","modification":"Oct 5, 2019 9:49:55 PM"}
