{"id":79508,"no":92,"title":"Page 92","content":"\u003cp\u003eNext week I was putting my house on the market. It freaked me out just a little. I became a mother in that house. I learned how to love another human being more than my own life in that house. But it was time to say good-bye and move on to bigger and better things. In a few months we would begin our future together and handle whatever life threw our way. I knew we would have hard times. I knew we would have a lot of adjusting to do as we learned how to live with each other, but I also knew we would do whatever it took to make it work.\u003c/p\u003e\n\u003cp\u003eI met a boy at a frat party, beat him at beer pong and let him take my virginity and give me a baby in return. Not a fair trade, but one I wouldn\u0027t change for the world.\u003c/p\u003e\n\u003cp\u003eI turned towards Carter and wrapped both of my arms around his waist and stood on my tip toes to kiss Gavin\u0027s cheek while our friends chatted behind us with my dad.\u003c/p\u003e\n\u003cp\u003e\"Hey Gavin, guess what? Daddy and I have something to tell you.\"\u003c/p\u003e\n\u003cp\u003eCarter looked down at me with a surprised look. We agreed to wait until the time was closer to tell Gavin, but I couldn\u0027t hold it in anymore. I didn\u0027t care if he drove me insane asking if it was time yet. I was happy and excited and I wanted my little man to feel it too.\u003c/p\u003e\n\u003cp\u003eI waited for Carter to give me the go-ahead to continue. I mouthed the words \"I love you\" to him and tried not to cry. This man was everything I had ever dreamed of and more. And he was all mine.\u003c/p\u003e\n\u003cp\u003eHe nodded his head in agreement and his lips formed an \"I love you\" back to me.\u003c/p\u003e\n\u003cp\u003eI reached up and smoothed Gavin\u0027s hair off of his forehead, letting my fingers trail down his cheeks and over his sweet dimples.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to sell our house and then you and I are going to live in Daddy\u0027s house with him,\" I explained.\u003c/p\u003e\n\u003cp\u003eGavin stared at me for a few minutes and then shifted his focus to Carter.\u003c/p\u003e\n\u003cp\u003e\"Really?\" he asked.\u003c/p\u003e\n\u003cp\u003eCarter nodded his head, \"Really, buddy.\"\u003c/p\u003e\n\u003cp\u003eGavin looked back at me and smiled, opening his mouth to hopefully tell us how happy he was.\u003c/p\u003e\n\u003cp\u003e\"HOLY SHIT!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-92.html","bookId":1853,"creation":"Oct 5, 2019 4:17:55 PM","modification":"Oct 5, 2019 4:17:55 PM"}
