{"id":102245,"no":7,"title":"Page 7","content":"\u003cp\u003e“He was your husband?” Although Madame Frederick had obviously loved him deeply, she rarely talked about her marriage.\u003c/p\u003e\n\u003cp\u003e“Yes.” She sighed. “The man who stole my heart. We had thirty happy years together. We fought like cats and dogs and we loved each other. Oh, how we loved each other. One look from that man could curl my toes. He could say to me with one glance what would take three hundred pages in a book.”\u003c/p\u003e\n\u003cp\u003eCarrie added sugar to her tea and stirred. Her hand trembled slightly as her mind drifted back to the kisses she’d shared with Philip in the elevator. She’d taken the stairs ever since. She’d been kissed before, plenty of times, but it had never felt like it had with Philip. What unsettled her was how perfectly she understood what her neighbor was saying about Randolf.\u003c/p\u003e\n\u003cp\u003e“I didn’t remarry after he died,” Madame Frederick said as she slipped into the chair next to Carrie. “My heart wouldn’t let me.” She reached for her teacup. “Not many women are as fortunate as I am to have found a love so great, and at such a tender age.”\u003c/p\u003e\n\u003cp\u003eCarrie sipped her tea and struggled to concentrate on Madame Frederick’s words, although her thoughts were on Philip—and his kisses. She wanted to push the memories out of her mind, but they refused to leave.\u003c/p\u003e\n\u003cp\u003e“I wanted to give you your Christmas present early,” Madame Frederick announced and set a small, wrapped package in her lap.\u003c/p\u003e\n\u003cp\u003e“I have something for you, too, but I was going to wait until Christmas.”\u003c/p\u003e\n\u003cp\u003e“I want you to open yours now.”\u003c/p\u003e\n\u003cp\u003eThe older woman watched as Carrie untied the gold ribbon and peeled away the paper. Inside the box was a small glass bowl filled with dried herbs and flowers. Despite the cellophane covering, she could smell the concoction. Potpourri? The scent reminded her a bit of sage.\u003c/p\u003e\n\u003cp\u003e“It’s a fertility potion,” Madame Frederick explained.\u003c/p\u003e\n\u003cp\u003e“Fertility!” Carrie nearly dropped the delicate bowl.\u003c/p\u003e\n\u003cp\u003e“Brew these leaves as a tea and—”\u003c/p\u003e\n\u003cp\u003e“Madame Frederick, I have no intention of getting pregnant anytime soon!”\u003c/p\u003e\n\u003cp\u003eThe woman smiled and said nothing.\u003c/p\u003e\n\u003cp\u003e“I appreciate the gesture, really I do.” She didn’t want her friend to think she wasn’t grateful, but she had no plans to have a child within the foreseeable future. “I’m sure that at some point down the road I’ll be brewing up this potion of yours.” She took another drink of her tea and caught sight of the time. “Oh, dear,” she said, rising quickly to her feet. “I’m supposed to be somewhere in five minutes.” Mackenzie had generously offered to buy her lunch as a Christmas gift. Philip’s daughter had written the invitation on a lovely card shaped like a silver bell.\u003c/p\u003e\n\u003cp\u003e“Thank you again, Madame Frederick,” she said, downing the last of the tea. She carefully tucked the unwrapped Christmas gift in her purse and reached for her coat.\u003c/p\u003e\n\u003cp\u003e“Come and visit me again soon,” Madame Frederick said.\u003c/p\u003e\n\u003cp\u003e“I will,” Carrie promised. She enjoyed her time with her neighbor, although she generally didn’t understand how Madame chose their topics of conversation. Her reminiscences about her long-dead husband had seemed a bit odd, especially the comment about fearing for her virtue. It was almost as if Madame Frederick knew what she and Philip had been doing in the darkened elevator. Her cheeks went red as she remembered the way she’d responded to him. There was no telling what might have happened had the lights not come on when they did.\u003c/p\u003e\n\u003cp\u003eCarrie hurried out of the apartment and down the wind-blown street to the deli on the corner. It was lovely of Mackenzie to ask her to lunch and to create such a special invitation.\u003c/p\u003e\n\u003cp\u003eThe deli, a neighborhood favorite, was busy. Inside, she was greeted by a variety of mouthwatering smells. Patrons lined up next to a glass counter that displayed sliced meats, cheeses and tempting salads. The refrigerator case was decorated with a plastic swag of evergreen, dotted with tiny red berries.\u003c/p\u003e\n\u003cp\u003e“Over here!” Carrie heard Mackenzie’s shout and glanced across the room to see the teenager on her feet, waving. The kid had been smart enough to claim a table, otherwise they might’ve ended up having to wait.\u003c/p\u003e\n\u003cp\u003eCarrie gestured back and made her way between the tables and chairs to meet her. Not until she reached the back of the room did she realize that Mackenzie wasn’t alone.\u003c/p\u003e\n\u003cp\u003ePhilip sat with his daughter. His eyes revealed his shock at seeing Carrie there, as well.\u003c/p\u003e\n\u003cp\u003e“Oh, good, I was afraid you were going to be late,” Mackenzie said, handing her a menu. “Tell me what you want, and I’ll get in line and order it.”\u003c/p\u003e\n\u003cp\u003eBriefly Carrie toyed with the idea of canceling, but that would’ve disappointed Mackenzie, which she didn’t want to do. Philip had apparently reached the same conclusion.\u003c/p\u003e\n\u003cp\u003e“Remember I’m on a limited budget,” Mackenzie reminded them, speaking loudly to be heard over the hustle and bustle of the deli. “But you don’t have to order peanut butter and jelly, either.”\u003c/p\u003e\n\u003cp\u003e“I’ll take a pastrami on whole wheat, hold the pickle, extra mustard.”\u003c/p\u003e\n\u003cp\u003eCarrie set her menu aside. “Make that two.”\u003c/p\u003e\n\u003cp\u003e“You like pastrami, too?” Mackenzie asked, making it sound incredible that two people actually found the same kind of sandwich to their liking.\u003c/p\u003e\n\u003cp\u003e“You’d better go line up,” Philip advised his daughter.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll be back before you know it.” She smiled before she left, expertly weaving between tables.\u003c/p\u003e\n\u003cp\u003eCarrie unwound the wool scarf from her neck and removed her jacket. She could be adult about this. While it was true that they hadn’t expected to run into each other, she could cope.\u003c/p\u003e\n\u003cp\u003eThe noise around them was almost deafening, but the silence between them seemed louder. When she couldn’t stand it any longer, she said, “It’s very sweet of Mackenzie to do this.”\u003c/p\u003e\n\u003cp\u003e“Don’t be fooled,” he returned gruffly. “Mackenzie knew exactly what she was doing.”\u003c/p\u003e\n\u003cp\u003e“And what was that?” Carrie hated to be defensive, but she didn’t like his tone or his implication.\u003c/p\u003e\n\u003cp\u003e“She set this up so you and I would be forced to spend time together.”\u003c/p\u003e\n\u003cp\u003eHe made it sound like a fate worse than high taxes. “Come on, Philip, I’m not such a terrible person.”\u003c/p\u003e\n\u003cp\u003e“As far as I’m concerned, that’s the problem.”\u003c/p\u003e\n\u003cp\u003eHis words lifted her spirits. She took a bread stick from the tall glass in the middle of the table and broke it in half. “Are you suggesting I actually tempt you?” she asked.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t go that far, so don’t flatter yourself.”\u003c/p\u003e\n\u003cp\u003e“I’m not.” She knew a bluff when she heard one. “If anyone should be flattered it’s you. First, I’m at least eight years younger than you, with endless possibilities when it comes to finding myself a man. What makes you think I’d be interested in an ill-tempered, unfriendly, almost middle-aged grump?”\u003c/p\u003e\n\u003cp\u003eHe blinked. “Ouch.”\u003c/p\u003e\n\u003cp\u003e“Two can play that game, Philip.”\u003c/p\u003e\n\u003cp\u003e“What game?”\u003c/p\u003e\n\u003cp\u003e“I almost believed you, you know. You were taking advantage of the dark? Really, you might’ve been a bit more original.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“But no one’s that good an actor. You’re attracted to me, but you’re scared to let go of the rein you’ve got on your emotions. I’m not sure what your problem is, but my guess is that it has to do with your divorce. So be it. If you’re content to spend the rest of your days alone, far be it from me to stop you.” She took a bite of the bread stick, chomping down hard.\u003c/p\u003e\n\u003cp\u003eMackenzie had their order. She carried the tray above her head as she reversed her previous journey among the tables. Her eyes were bright with excitement when she rejoined them.\u003c/p\u003e\n\u003cp\u003eShe handed one thick ceramic plate to Carrie. “Pastrami on whole wheat, no pickle and extra mustard.”\u003c/p\u003e\n\u003cp\u003e“Perfect,” Carrie said, taking the plate from her. She was grateful Mackenzie had returned when she did, unsure she could continue her own bluff much longer. As it was, Philip had no opportunity to challenge her statement, which was exactly the way she wanted it.\u003c/p\u003e\n\u003cp\u003eMackenzie distributed the rest of the sandwiches, set the tray aside and flopped down in the seat between Carrie and Philip. “Don’t you just love the holidays?” she asked before biting into her sandwich.\u003c/p\u003e\n\u003cp\u003ePhilip’s eyes locked with Carrie’s. “Sure do,” he said, but Carrie saw that he was gritting his teeth.\u003c/p\u003e\n\u003cp\u003eFrom the way Philip tore into the sandwich, anyone would think he hadn’t eaten in a week. It was as though they were taking part in a contest to see who’d finish first.\u003c/p\u003e\n\u003cp\u003ePhilip won. The minute he swallowed the last bite, he stood, thanked his daughter and excused himself.\u003c/p\u003e\n\u003cp\u003e“He’s going back to work,” Mackenzie explained sadly as she watched her father leave. “He’s always going back to the office.”\u003c/p\u003e\n\u003cp\u003e“Inviting us both to lunch was very thoughtful of you,” Carrie said, “but your father seems to think you asked us to suit your own purposes.”\u003c/p\u003e\n\u003cp\u003eMackenzie lowered her gaze. “All right, I did, but is that such a bad thing? I like you better than anyone. It’s clear that my dad’s never going to get married again without my help. My parents have been divorced for three years now and he’s never even gone out on a real date.”\u003c/p\u003e\n\u003cp\u003e“Mackenzie, your father needs time.”\u003c/p\u003e\n\u003cp\u003e“Time? He’s had more than enough time! He can’t keep going through life like this. He’s put everything on hold while he tries to forget what my mother did. I want him to marry you.”\u003c/p\u003e\n\u003cp\u003e“Mackenzie!” Carrie exhaled sharply. She couldn’t allow the girl to believe that dealing with human emotions was this simple. “I can’t marry your father just because you want me to.”\u003c/p\u003e\n\u003cp\u003e“Don’t you like him?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do, very much, but there’s so much more to marriage than me liking your father.”\u003c/p\u003e\n\u003cp\u003e“But he cares about you. I know he does, only he’s afraid to let it show.”\u003c/p\u003e\n\u003cp\u003eCarrie had already guessed as much, but that could be because she wanted to believe it so badly.\u003c/p\u003e\n\u003cp\u003e“My mom is really pretty,” Mackenzie said, and she lowered her gaze to her hands, which clutched a paper napkin. “I think she might’ve been disappointed that I look more like my dad’s side of the family than hers. She’s never said anything, but I had the feeling maybe she would’ve stayed married to my dad if I’d been prettier.”\u003c/p\u003e\n\u003cp\u003e“I’m sure that isn’t true.” Carrie’s heart ached at the pain she heard in the girl’s voice. “I used to feel those kinds of things, too. My dad never wanted anything to do with me. He never wrote or sent me a birthday gift or remembered me at Christmas, and I was convinced it was something I must have done.”\u003c/p\u003e\n\u003cp\u003eMackenzie raised her eyes. “But you were a little kid when your parents divorced.”\u003c/p\u003e\n\u003cp\u003e“It didn’t matter. I felt that somehow I was the one to blame. But it didn’t have anything to do with me. And your parents didn’t divorce because you took after your father’s side of the family. Your parents’ problems had nothing to do with you.”\u003c/p\u003e\n\u003cp\u003eMackenzie didn’t say anything for a long moment. “This is why I want you to marry my dad. You make me feel better. In the past couple weeks you’ve been more of a mom to me than my real mother ever was.” \u003c/p\u003e","sourceLink":"https://allnovel.net/that-holiday-feeling-virgin-river-8/page-7.html","bookId":2632,"creation":"Oct 5, 2019 10:15:43 PM","modification":"Oct 5, 2019 10:15:43 PM"}
