{"id":72164,"no":31,"title":"Page 31","content":"\u003cp\u003e“Leave him alone,” she whispered.\u003c/p\u003e\n\u003cp\u003eSeconds later, more police cars, an ambulance, and a fire truck roared up the drive. Cops leapt from the cars and set up a perimeter around the crime scene. A detective in a gray jacket pulled out a camera and took photos of Gayle’s lifeless figure. A man in a coat that said CORONER on the back examined the body, making sure she was indeed dead. Police dogs yapped on their leashes, saliva dripping off their jaws. The sirens blared relentlessly, giving Emily a headache.\u003c/p\u003e\n\u003cp\u003eThe cop next to Aria, a big burly guy with a bald head, turned to Emily. “You really expect us to believe your story?” he asked.\u003c/p\u003e\n\u003cp\u003e“It’s the truth.” Emily felt defeated. “You can look up my medical records from Jefferson Hospital.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you come to the police when Ms. Riggs allegedly made these threats?”\u003c/p\u003e\n\u003cp\u003eEmily glanced at her friends. Spencer cleared her throat. “She didn’t want her parents to know she was pregnant,” she said. “She thought she could handle things herself.”\u003c/p\u003e\n\u003cp\u003e“And what about this tip you received, saying the baby was here? Who wrote that?”\u003c/p\u003e\n\u003cp\u003eEmily’s stomach flipped. The last thing she wanted to do was tell the cops about A. “I guess it was a hoax. Someone messing with us.”\u003c/p\u003e\n\u003cp\u003e“So why is Ms. Riggs dead?” Lowry snapped.\u003c/p\u003e\n\u003cp\u003e“I have no idea,” Emily whispered.\u003c/p\u003e\n\u003cp\u003e“So you don’t know where that came from?” Lowry pointed at something on the ground.\u003c/p\u003e\n\u003cp\u003eEmily followed his finger. Lying next to Gayle’s elbow was a black gun. It blended in with the dark pavement. She jumped away from it as though it were a rattlesnake. “Oh my God.”\u003c/p\u003e\n\u003cp\u003e“We heard that go off,” Aria said.\u003c/p\u003e\n\u003cp\u003e“Did you see who shot it?” Lowry asked.\u003c/p\u003e\n\u003cp\u003eEveryone exchanged a helpless look. “The fog was too thick,” Emily said. “All we heard were footsteps.”\u003c/p\u003e\n\u003cp\u003e“I saw someone run in front of my car,” Spencer offered, “but I didn’t see a face.”\u003c/p\u003e\n\u003cp\u003eLowry snatched the gun with two gloved fingers, placed it into a plastic bag, and handed it to one of the detectives. The man tapped something into a laptop. Emily shivered next to her friends, trying to convey what she was thinking without speaking. How had this happened? And who killed Gayle? Was it completely unrelated to us or the baby?\u003c/p\u003e\n\u003cp\u003eOr, Emily thought with a shiver, what if the killer was absolutely related? Was it possible Gayle wasn’t A after all? Was it possible that A had killed Gayle?\u003c/p\u003e\n\u003cp\u003eBut why?\u003c/p\u003e\n\u003cp\u003eAfter a few torturous minutes, the detective returned to the girls. “Okay. The weapon was registered to a Gayle Riggs. According to the records, it hadn’t been stolen. Whoever shot it must have taken it from her house.”\u003c/p\u003e\n\u003cp\u003eThe cop holding Aria jutted a thumb into the darkness. “Isaac saw you girls go into the house. Coincidence?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Aria said weakly. “It was someone else.”\u003c/p\u003e\n\u003cp\u003eLowry glanced at Gayle’s body on the ground, which was now covered with a sheet. “We’ll run fingerprints on the gun. The results should take a few hours.” Then he glanced at the girls. “Until then, you four are coming with us.”\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eCONFESSION TIME\u003c/p\u003e\n\u003cp\u003eThe last time Spencer had been at the Rosewood police station was when Darren Wilden brought her and her friends in a year ago—the cops had accused the girls of helping Ian Thomas escape police custody, as well as aiding and abetting in Ali’s murder. The precinct had changed since then, having gotten a fresh coat of paint, new front windows, one of those fancy coffee machines that also made cappuccino and hot chocolate, and a marginally nicer interrogation room. Instead of the banged-up wooden table with the graffiti all over it, there was a shiny new metal one.\u003c/p\u003e\n\u003cp\u003eNot that any of it made Spencer feel more comfortable being here.\u003c/p\u003e\n\u003cp\u003eShe and her friends sat silently around the table. Hanna bit relentlessly at her thumbnail, which was still stained from fingerprinting ink. Aria kept bursting into tears, her mascara streaking down her cheeks. Emily was sucking so hard on her lip it looked like it might disappear. Spencer leapt up and began pacing around the room, the gnawing feeling in her gut too much to bear. What if they were accused of Gayle’s murder? What if they were put away for life?\u003c/p\u003e\n\u003cp\u003eShe stopped pacing. “Guys, maybe we should just tell them that A gave us that tip to go to Gayle’s house. They’re probably going to ask about it again anyway.”\u003c/p\u003e\n\u003cp\u003eAria’s eyes widened. “You know we can’t do that. A will tell on us.”\u003c/p\u003e\n\u003cp\u003eSpencer sat back down in the chair. “But what if A is Gayle’s murderer?”\u003c/p\u003e\n\u003cp\u003eHanna frowned. “But I thought Gayle was A.”\u003c/p\u003e\n\u003cp\u003e“Seriously?” Spencer stared at her. “After what we just witnessed?”\u003c/p\u003e\n\u003cp\u003e“It doesn’t seem likely.” Emily leaned forward on her elbows. “What if A planned all this? Luring us to Mockingbird Drive, everything? It’s possible there wasn’t a baby at her house at all. Maybe it was a recording.”\u003c/p\u003e\n\u003cp\u003eAria squinted. “But why would A kill Gayle?”\u003c/p\u003e\n\u003cp\u003e“To frame us, maybe.” Spencer thought for a moment. “Or maybe A meant to get to us first, but Gayle got in the way. Wasn’t she supposed to be at the fund-raiser?”\u003c/p\u003e\n\u003cp\u003eShe shut her eyes and thought about those terrifying seconds when she’d pulled up the driveway on Mockingbird Lane. A figure had run in front of the car, then darted across the street into the woods. Whoever it was wore all black and had a hood cinched tight—Spencer hadn’t been able to tell if it was a guy or a girl.\u003c/p\u003e\n\u003cp\u003eHanna cleared her throat. “But Gayle is Tabitha’s mom. She was out to steal Violet. She was at Princeton when Spencer was, she infiltrated my dad’s campaign, she threatened me at the race. It makes so much sense that she’s A.”\u003c/p\u003e\n\u003cp\u003e“I agree,” Aria said.\u003c/p\u003e\n\u003cp\u003e“So why is Gayle dead now?” Spencer demanded.\u003c/p\u003e\n\u003cp\u003eThe door swung open, and everyone jumped. Lowry walked through and made a motion for the girls to stand up. There was a pinched look on his face, and he was holding a steaming cup of coffee in his hand. “Well, none of the prints on the gun matched any of yours.”\u003c/p\u003e\n\u003cp\u003eSpencer stood up abruptly. “Whose prints were on the gun?”\u003c/p\u003e\n\u003cp\u003e“Ms. Riggs’s.” Lowry sipped his coffee. “And a set of prints we don’t have on record. They could be her husband’s. He just arrived from New York, and I want all of us to talk together.”\u003c/p\u003e\n\u003cp\u003eSpencer exchanged a terrified look with the others. Gayle’s husband was Tabitha’s father.\u003c/p\u003e\n\u003cp\u003eBefore they could say a word, a tall, thin man entered the room. Spencer recognized him from the news stories about Tabitha, the mourning father who’d do anything to have his daughter back. His eyes were tinged red, and he had a look on his face as though he’d just been struck by lightning. She folded in her shoulders, terrified that he’d know what they’d done to his daughter, but Mr. Clark seemed too catatonic to notice them.\u003c/p\u003e\n\u003cp\u003eLowry curled his hands over the back of an empty chair. “Mr. Clark, I’d like to clear up a story Ms. Fields told us about your wife.” He glanced at Emily, then at Tabitha’s father. “I apologize that we have to do this so soon after her death, but it’s important for our investigation.”\u003c/p\u003e\n\u003cp\u003eHe repeated what Emily had told him about Gayle wanting to adopt her baby this summer, ending in how Emily was worried that Gayle had stolen the baby tonight—they’d heard a baby crying on the back porch. Mr. Clark stared at Emily, looking startled. “She never told me about wanting to adopt a baby last summer,” he said faintly.\u003c/p\u003e\n\u003cp\u003eSpencer squinted at him, hardly believing what she was hearing. How could Gayle not have told her own husband?\u003c/p\u003e\n\u003cp\u003e“She said you knew,” Emily said. Spencer was amazed at her ability to speak—if she was the one being questioned right now, she’d probably hide under the table. “She said she was going to put you on the phone, but she never did.”\u003c/p\u003e\n\u003cp\u003e“Probably because I told her very clearly I didn’t want to adopt.” Mr. Clark rubbed the top of his head. “So what happened? Why didn’t you give her the baby?”\u003c/p\u003e\n\u003cp\u003eEmily’s throat bobbed. “I chose another family. That’s all.”\u003c/p\u003e\n\u003cp\u003eMr. Clark blinked rapidly. “Was it because you never spoke to me? Was it because you thought we weren’t a good match?”\u003c/p\u003e\n\u003cp\u003e“It’s hard to explain,” Emily mumbled, staring at her high heels.\u003c/p\u003e\n\u003cp\u003eMr. Clark’s eyes were vacant and hollow as he stared past the girls at the wall. “Sometimes Gayle gets ideas in her head that she can’t let go of. She can be very determined—even pigheaded—to get what she wants.”\u003c/p\u003e\n\u003cp\u003eHe blew his nose. “I assure you, though, we didn’t kidnap any children. We hadn’t told anyone yet, but Gayle had just taken a pregnancy test last week. It was positive, and she was overjoyed.” He shook his head. “We’d worked so hard to get pregnant. This was our fifth round of fertility treatments. We’d been through so much pain.” His shoulders started to shake. “This can’t be happening. First Tabitha, now Gayle.”\u003c/p\u003e\n\u003cp\u003eTabitha. Just hearing her name was torture. Spencer reached over and took Emily’s hand. Hanna and Aria looked like they were going to explode.\u003c/p\u003e\n\u003cp\u003eEmily shifted her weight. “I’m very sorry about your daughter. That must have been so hard for you two as parents.”\u003c/p\u003e\n\u003cp\u003eMr. Clark’s eyebrows lowered as he turned toward them. “Well, Gayle was Tabitha’s stepmother. It was hard on her, of course, especially since they had some . . . problems. Tabitha had behavioral issues. Gayle pushed to have Tabitha sent away, and I finally relented.”\u003c/p\u003e\n\u003cp\u003eSpencer exchanged a covert, startled look with Emily and the others. Stepmother? That would explain why she was never on the news and had a different last name.\u003c/p\u003e\n\u003cp\u003eMr. Clark put his head in his hands. “I shouldn’t have given into Gayle’s pressure to send Tabitha away. And I made so many mistakes with Gayle, too. I shouldn’t have nagged her about all the boards she was on, all the money she spent on parties. I shouldn’t have yelled at her for that money that went missing last summer. I just want her back. I need her back.”\u003c/p\u003e\n\u003cp\u003eHe let out a low moan. Lowry stood and shooed the girls out of the room, following them out. Once they were far enough away, he put his hands in his pockets and jingled loose change. “I don’t think we need to ask him any more questions about whether he kidnapped your baby, Ms. Fields. I just got a text that the police are done with their search of the house, too. They didn’t find any clues, and they certainly didn’t find any children.”\u003c/p\u003e\n\u003cp\u003eEmily’s throat bobbed as she swallowed. “Okay,” she said quietly.\u003c/p\u003e\n\u003cp\u003eLowry frowned. “Do you know who might have sent you to Ms. Riggs’s house, even as a joke?”\u003c/p\u003e\n\u003cp\u003eEmily shot a nervous look at the others, then shook her head. “I don’t. But I don’t think whoever sent it meant anything by it—or had anything to do with Gayle’s murder. We’re the Pretty Little Liars. People send us fake notes all the time, and this was all just a terrible coincidence.”\u003c/p\u003e\n\u003cp\u003eHer lips trembled. Spencer could tell she hated lying. She almost jumped in to tell the cop everything about A, but then restrained herself. \u003c/p\u003e","sourceLink":"https://allnovel.net/stunning-pretty-little-liars-11/page-31.html","bookId":2387,"creation":"Oct 5, 2019 10:23:15 AM","modification":"Oct 5, 2019 10:23:15 AM"}
