{"id":76706,"no":33,"title":"Page 33","content":"\u003cp\u003eEdmond laughed, remembered Madelyne was sleeping, and softened his voice.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about waking her, Edmond. She sleeps like a well-fed kitten.\"\u003c/p\u003e\n\u003cp\u003e\"Your wife puts in a long day. The food at dinner was exceptional and all because Madelyne demands perfection from her staff. I ate four tarts,\" Edmond admitted. \"And did you know it was Madelyne\u0027s own recipe given to Gerty?\"\u003c/p\u003e\n\u003cp\u003e\"Her staff?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, they are loyal to Madelyne now.\"\u003c/p\u003e\n\u003cp\u003e\"And you, Edmond? Are you loyal to Madelyne?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s my sister now, Duncan. I would give my life to protect her,\" he added.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t doubt you, Edmond,\" Duncan returned when he caught the defense in Edmond\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Then why did you ask?\" Edmond said. He pulled up a chair and sat down, facing his brother. \"Did Gerald bring news concerning Madelyne?\"\u003c/p\u003e\n\u003cp\u003eDuncan started to nod but as soon as he moved his head, Madelyne took up the space under his chin. He smiled. \"Gerald did bring news. Our king is still in Normandy, but Louddon is gathering his troops. Gerald lines with us, of course.\"\u003c/p\u003e\n\u003cp\u003e\"I am bound to return to Baron Rhinehold in just three weeks,\" Edmond remarked. \"Though he has my pledge of fealty, I\u0027m vassal to our king first, you second, Rhinehold third. For that reason, Rhinehold would allow me to stay here as long as I\u0027m needed.\"\u003c/p\u003e\n\u003cp\u003e\"Rhinehold would also line up with Gerald and me against Louddon if it became necessary. Together we can muster over a thousand men.\"\u003c/p\u003e\n\u003cp\u003e\"You forget your alliance with the Scots,\" Edmond reminded Duncan. \"Catherine\u0027s husband could rally eight hundred, perhaps more.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t forgotten, yet I don\u0027t wish to bring Catherine\u0027s family into this feud,\" Duncan answered.\u003c/p\u003e\n\u003cp\u003e\"And if the king sides with Louddon?\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"How can you be so certain?\" Edmond asked.\u003c/p\u003e\n\u003cp\u003e\"There are many misunderstandings about our king, Edmond. I\u0027ve fought by his side many times. He\u0027s thought to have an uncontrollable temper. Yet, once in battle, one of his own men accidentally knocked our king to the ground. Soldiers surrounded William, each vowing to kill the careless vassal. The king laughed over the mishap, slapped the soldier on the shoulder who\u0027d thrown him down, and then bade him to remount his horse and see to his defense.\"\u003c/p\u003e\n\u003cp\u003eEdmond mulled over the story. \"It\u0027s said Louddon has an unusual hold over the king\u0027s mind.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt our king would let anyone rule his mind.\"\u003c/p\u003e\n\u003cp\u003e\"I pray you\u0027re right, brother.\"\u003c/p\u003e\n\u003cp\u003e\"There is another matter I wish to discuss with you, Edmond. The Falcon holding to be exact.\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\" Edmond asked, frowning. The Falcon land was barren but thought to be rich fanning land, owned by Duncan. It consisted of the southernmost area of the Wexton holdings.\u003c/p\u003e\n\u003cp\u003e\"I would like you to oversee that domain, Edmond. Build yourself a fortress there. I would deed the land over to you if it were possible. The king wouldn\u0027t allow it, unless a way was found to gain his pleasure.\"\u003c/p\u003e\n\u003cp\u003eDuncan paused while he considered the complexities of the problem.\u003c/p\u003e\n\u003cp\u003eEdmond was stunned by his brother\u0027s comments. \" \u0027Tis unheard of, this plan you propose,\" he stammered. For the first time in his life, Edmond was actually rattled. And though it was highly improbable, a beacon of hope flamed in his heart. To own his own land, to rule as his own master, why, it was all too overwhelming to take in.\u003c/p\u003e\n\u003cp\u003e\"Why would you want me to take over Falcon land?\" Edmond asked.\u003c/p\u003e\n\u003cp\u003e\"Madelyne.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"My wife listened to Gilard and me discussing the king\u0027s brothers. When Gilard left the hall, Madelyne pointed out how restless Robert and Henry were. She believes it\u0027s because neither was given sufficient responsibility.\"\u003c/p\u003e\n\u003cp\u003e\"Good Lord, Robert was given Normandy,\" Edmond interjected.\u003c/p\u003e\n\u003cp\u003e\"Aye,\" Duncan said, smiling. \"But the king\u0027s youngest brother was given gold and a small, insignificant holding from his father and I can see the restlessness in him. He\u0027s a born leader, denied by birth the right to rule.\"\u003c/p\u003e\n\u003cp\u003e\"If there is a parallel, I am eager to hear it,\" Edmond said.\u003c/p\u003e\n\u003cp\u003e\"Madelyne did start me thinking. You\u0027re vassal to me and to Rhinehold, and those duties must remain intact, yet, if we could gain the king\u0027s grant, then you could take Falcon and make it profitable. You\u0027ve a good head for turning one coin into ten, Edmond.\"\u003c/p\u003e\n\u003cp\u003eThe brother smiled, pleased with the compliment. \"If nought comes of our petition, you\u0027ll still build your home there and act as my overseer. The king will welcome the additional tithing and won\u0027t care which brother makes the contribution.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in agreement with your plan,\" Edmond announced, smiling now.\u003c/p\u003e\n\u003cp\u003e\"Gilard will soon return to Baron Thormont to complete his forty days,\" Duncan interjected.\u003c/p\u003e\n\u003cp\u003e\"Gilard has a way of leading others and will soon become first-in-command just as Anthony has became your first-in-command,\" Edmond said.\u003c/p\u003e\n\u003cp\u003e\"Our brother will have to learn to control his temper first,\" Duncan commented.\u003c/p\u003e\n\u003cp\u003eEdmond nodded in agreement. \"You\u0027ve still to tell me what news Gerald brings us about Madelyne,\" he said then.\u003c/p\u003e\n\u003cp\u003e\"Gerald is convinced that the king\u0027s brother, Henry, might be stirring up mischief. Gerald has been requested to speak with Henry.\"\u003c/p\u003e\n\u003cp\u003e\"When? Where?\"\u003c/p\u003e\n\u003cp\u003e\"The Clares will have Henry as their guest. I don\u0027t know when the meeting will come about.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think Henry will ask Gerald\u0027s loyalty against our king?\" Edmond asked. \"And what of you? Are you also invited to this gathering?\"\u003c/p\u003e\n\u003cp\u003e\"Nay. He knows I\u0027ll stand beside my king,\" Duncan answered.\u003c/p\u003e\n\u003cp\u003e\"You suggest Henry will turn against William then?\"\u003c/p\u003e\n\u003cp\u003e\"If I was convinced of that, I\u0027d stand in front of our leader and give my life for him. I am honor bound to protect him.\"\u003c/p\u003e\n\u003cp\u003eEdmond nodded, satisfied. \"Gerald said that the number of those becoming discontent is growing. There is more than one plot to kill him. That is not unusual. His father had just as many enemies.\"\u003c/p\u003e\n\u003cp\u003eWhen Duncan didn\u0027t comment, Edmond continued. \"Gerald believes he\u0027s been invited to join this gathering because of his friendship to me. He thinks Henry wants to know if I\u0027ll honor him as king in the event of William\u0027s death.\"\u003c/p\u003e\n\u003cp\u003e\"We wait to see what the outcome of this meeting brings?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, we wait.\" Edmond frowned. \"There is much to consider, brother.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me this, Edmond,\" Duncan asked, changing the topic, \"does Gilard still believe himself in love with Madelyne?\"\u003c/p\u003e\n\u003cp\u003eEdmond shrugged. \"He was having a time of it, adjusting to your marriage,\" he admitted. \"But he\u0027s over the infatuation now, I believe. He loves Madelyne, yet she keeps calling him brother, and that puts a damper on his ardor. I\u0027m surprised though that you noticed Gilard\u0027s affliction.\"\u003c/p\u003e\n\u003cp\u003e\"Gilard wears his thoughts on his face,\" Duncan remarked. \"Did you see the way he reached for his sword during the marriage ceremony, when he thought I was forcing Madelyne?\"\u003c/p\u003e\n\u003cp\u003e\"You were forcing her,\" Edmond returned with a grin. \"And yes, I did witness the act. Madelyne also saw his reaction. I think that is the only reason she suddenly agreed to take you for husband.\"\u003c/p\u003e\n\u003cp\u003eDuncan grinned. \"A true observation, Edmond. Madelyne will always try to protect anyone she believes weaker. At that moment she feared I would retaliate.\"\u003c/p\u003e\n\u003cp\u003eDuncan began to caress his wife\u0027s back. Edmond watched the way his brother stroked Madelyne and thought to himself that he probably wasn\u0027t even aware of what he was doing. \"Does Madelyne want us gone then?\" Edmond asked.\u003c/p\u003e\n\u003cp\u003e\"Nay, Edmond. I imagine she\u0027ll become upset and blame me,\" Duncan answered. \"My wife doesn\u0027t understand that your loyalty extends to Rhinehold too.\"\u003c/p\u003e\n\u003cp\u003eEdmond nodded. \"I think Madelyne worries I\u0027ll keep you and Gilard under my control for the rest of your lives and won\u0027t allow either of you to act on any thought of your own.\"\u003c/p\u003e\n\u003cp\u003e\"Your wife has strange ideas,\" Edmond remarked. \"Yet she has changed your life, hasn\u0027t she, Duncan? And ours as well. This is the first time we\u0027ve ever had such a long discussion on any issue. I believe Madelyne has made us a stronger family.\"\u003c/p\u003e\n\u003cp\u003eDuncan didn\u0027t respond to that comment. Edmond stood up and started to walk toward the entrance. \"It\u0027s a shame you know,\" he called over his shoulder.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a shame?\" Duncan asked.\u003c/p\u003e\n\u003cp\u003e\"That I didn\u0027t capture her first.\"\u003c/p\u003e\n\u003cp\u003eDuncan smiled. \"Nay, Edmond, it was a blessing. God\u0027s truth, I would have taken her from you.\"\u003c/p\u003e\n\u003cp\u003eMadelyne awakened just as Duncan made his comment. She struggled to sit up and smiled shyly at her husband. \"What would you have taken away from your brother, Duncan?\" she asked him in a husky voice. She patted her hair and Duncan dodged her elbows before answering.\u003c/p\u003e\n\u003cp\u003e\"Nothing for you to concern yourself with, Madelyne.\"\u003c/p\u003e\n\u003cp\u003e\"You should always share what you have with your brothers,\" Madelyne instructed Duncan.\u003c/p\u003e\n\u003cp\u003eEdmond obviously heard her remark. His laughter trailed behind him.\u003c/p\u003e\n\u003cp\u003eJust then, Adela came tearing into the hall. As soon as Duncan\u0027s little sister spotted Madelyne, she burst into tears. \"Gerald still insists that the contract is valid, Madelyne. What am I going to do? The man still wants to marry me.\"\u003c/p\u003e\n\u003cp\u003eMadelyne jumped off Duncan\u0027s lap just as Adela threw herself into her arms.\u003c/p\u003e\n\u003cp\u003eDuncan stood up and sighed in exasperation over his sister\u0027s near hysteria.\u003c/p\u003e\n\u003cp\u003e\"You should be asking me that question, Adela,\" he snapped. He took hold of Madelyne\u0027s arm, ignoring the fact that Adela was clinging to her like a wet gown, and started pulling Madelyne toward the entrance.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t just leave your sister in such a condition,\" Madelyne protested. Lord, she felt like she were in the middle of a tug-of-war. \"Duncan, you\u0027re pulling my arm off.\"\u003c/p\u003e\n\u003cp\u003eBaron Gerald came rushing into the hall then, disrupting Duncan\u0027s bid to take Madelyne upstairs and deal with Adela\u0027s problem in the morning. Duncan wasn\u0027t in the mood for a long discussion and determined to resolve the matter immediately.\u003c/p\u003e\n\u003cp\u003eBefore Gerald could say a word, Duncan asked, \"Do you still want to marry Adela?\"\u003c/p\u003e\n\u003cp\u003e\"I do,\" Gerald answered. His voice challenged, as did his stance. \"She will be my wife.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve given Adela my word she can stay here for as long as she wishes, Gerald.\"\u003c/p\u003e\n\u003cp\u003eGerald\u0027s face showed his anger. Duncan felt like growling. \"I was wrong to give her such a promise,\" he said, admitting the error in front of Edmond, Madelyne, Adela, and Gerald. It was an amazing confession coming from a man who never admitted any mistake. Duncan smiled over the way his confession stunned everyone.\u003c/p\u003e\n\u003cp\u003eHe turned to Madelyne and whispered, \"Your obsession with telling the truth has affected me, wife. Now, close your mouth, love. All will be well.\"\u003c/p\u003e\n\u003cp\u003eMadelyne slowly nodded. She gave her husband a smile, letting him know she trusted him. He was so pleased that when he turned back to confront Gerald, he was still smiling. Gerald knew Duncan well enough to wait until he was given a full explanation before openly challenging him. Duncan had always been a man of his word in the past.\u003c/p\u003e\n\u003cp\u003e\"Adela,\" Duncan demanded, \"quit screeching like a hen and tell Baron Gerald my exact promise to you.\"\u003c/p\u003e\n\u003cp\u003eHis tone of voice didn\u0027t suggest argument. Adela straightened away from Madelyne and said, \"You said I could live here until I died if that was my wish.\"\u003c/p\u003e\n\u003cp\u003eGerald took a step toward Adela then, but Duncan\u0027s stare stopped him.\u003c/p\u003e\n\u003cp\u003e\"Now then, Gerald? What promise did I give to you?\"\u003c/p\u003e\n\u003cp\u003eDuncan\u0027s voice was mild, giving the impression he was bored with the conversation. Madelyne clutched his hand.\u003c/p\u003e\n\u003cp\u003eGerald answered Duncan with a shout. \"With the king\u0027s blessing, you agreed Adela would become my wife.\"\u003c/p\u003e\n\u003cp\u003eEdmond couldn\u0027t keep silent any longer. \"How in God\u0027s name are you going to honor both pledges?\" he asked Duncan.\u003c/p\u003e\n\u003cp\u003e\"Gerald,\" Duncan said, ignoring Edmond, \"my word to Adela is dependent upon her wish to remain here. I believe it is up to you to change her mind.\"\u003c/p\u003e\n\u003cp\u003e\"Do you suggest…\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a welcome guest in my home for as long as it takes,\" Duncan said.\u003c/p\u003e\n\u003cp\u003eGerald looked startled, then a most arrogant grin transformed his face. He turned to Adela and smiled at her. \"Adela, since you won\u0027t leave, then I shall stay here with you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll what?\"\u003c/p\u003e\n\u003cp\u003eAdela was back to screeching, yet Madelyne couldn\u0027t see fear in her eves, only disbelief and anger.\u003c/p\u003e\n\u003cp\u003e\"As your brother said, for as long as it takes me, Adela, to make you realize I mean to marry you,\" Gerald said. \"Do you hear me?\"\u003c/p\u003e\n\u003cp\u003eOf course she heard him. Madelyne thought the south watchman must have heard Gerald. He shouted his announcement loud enough.\u003c/p\u003e\n\u003cp\u003eMadelyne took a step toward Adela, fully intending to protect her from Gerald\u0027s anger, but Duncan suddenly took hold of her hand again. He jerked her up against his side, and when she opened her mouth to protest, his grip intensified, and Madelyne decided to save her protest for later.\u003c/p\u003e\n\u003cp\u003eAdela was too enraged to speak. She picked up her skirts and rushed over to Gerald. \"You\u0027ll be old and gray and withered, too, before I change my mind, Gerald.\"\u003c/p\u003e\n\u003cp\u003eGerald smiled at Adela. \"You underestimate my abilities, Adela,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the most stubborn man alive,\" Adela blurted out. \"You… you plebeian.\" She turned her back on him then and left the hall.\u003c/p\u003e\n\u003cp\u003eIt was all going to be all right. Madelyne felt it in her heart. Adela was furious, but she wasn\u0027t terrified.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a plebeian?\" Gerald asked Edmond.\u003c/p\u003e\n\u003cp\u003eEdmond shrugged and looked over at Madelyne. \"Another one of your words?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Aye,\" Madelyne admitted.\u003c/p\u003e\n\u003cp\u003e\"Is it as distasteful as Polyphemus?\" Edmond asked.\u003c/p\u003e\n\u003cp\u003eMadelyne shook her head.\u003c/p\u003e\n\u003cp\u003e\"At least Adela places higher value on you, Gerald, than Madelyne placed on me when we first met,\" Edmond said with a grin.\u003c/p\u003e\n\u003cp\u003eMadelyne didn\u0027t know what Edmond was talking about. Duncan bade everyone a good night and dragged Madelyne out of the hall before she could question Edmond.\u003c/p\u003e\n\u003cp\u003eNeither husband nor wife said a word to each other until they reached Duncan\u0027s bedroom. When he opened the door for her, Madelyne was waylaid from asking him about Adela or Edmond. The bedroom drew her attention first. Duncan had moved her possessions from the tower to his chambers. The two chairs now flanked his hearth, the cover now lined his huge bed, and her tapestry was hanging above his hearth. \u003c/p\u003e","sourceLink":"https://allnovel.net/honor-s-splendour/page-33.html","bookId":1841,"creation":"Oct 5, 2019 3:29:58 PM","modification":"Oct 5, 2019 3:29:58 PM"}
