{"id":74126,"no":15,"title":"Page 15","content":"\u003cp\u003eDella\u003c/p\u003e\n\u003cp\u003eIt was a simple question. Sweet, really, that he’d even care. Had anyone ever cared about such trivial things concerning me before? I had never been asked such personal innocent questions. But he’d asked about my teacher and all I could see was my mother.\u003c/p\u003e\n\u003cp\u003eSit here Della. Don’t look out the window. You have to do this work. To be smart you need to read Shakespeare. He will remind you how dangerous the world can be.\u003c/p\u003e\n\u003cp\u003eI shook my head to clear the memories. I couldn’t do this here. Not now.\u003c/p\u003e\n\u003cp\u003eIt’s dark out there Della. Bad things are in the dark. Lock your windows and doors and stay tucked in tight. The monster under your bed will hear you if you get up.\u003c/p\u003e\n\u003cp\u003eNo momma. Go away.\u003c/p\u003e\n\u003cp\u003e“Della, don’t go outside again tonight. The bad is out there waiting on you. Stay with me. Your brother worries about you. He doesn’t want you hurt. Be safe in your bed.”\u003c/p\u003e\n\u003cp\u003e“Della, are you okay?” Strong arms were pulling me close. I went willingly. I needed away from her. I didn’t want to remember that night. I knew I would if she stayed in my head too long.\u003c/p\u003e\n\u003cp\u003e“I’ve got her. Move.” Woods’ voice sent warmth through me. I was breaking free from the memories. They weren’t taking me this time.\u003c/p\u003e\n\u003cp\u003eCool night airbrushed my face and I realized I was being carried. I took a deep calming breath and the tightness in my chest was gone. Woods had brought me out of it. I hadn’t been left to remember alone.\u003c/p\u003e\n\u003cp\u003eI blinked several times and my eyes came back into focus. The darkness was gone.\u003c/p\u003e\n\u003cp\u003eWoods sat down on a bench along the beach boardwalk and kept me firmly in his lap. “You’re back,” he said simply.\u003c/p\u003e\n\u003cp\u003eI nodded. I wasn’t sure what to say. I didn’t want to tell him what had just happened.\u003c/p\u003e\n\u003cp\u003e“Good,” he said simply and brushed my hair out of my face with his free hand. He still held me cradled against his chest with his other.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eWoods’ mouth was in a tight line. He was concerned. I’d scared him. I started to sit up and he held me tighter. “You’re not getting up until you tell me something.”\u003c/p\u003e\n\u003cp\u003eMy stomach knotted up. I’d never told anyone other than Braden and she knew why. I couldn’t tell Woods. I didn’t talk about it.\u003c/p\u003e\n\u003cp\u003e“You don’t have to tell me why that just happened. But does it happen often?”\u003c/p\u003e\n\u003cp\u003eThis wasn’t a fair question. Telling him the truth without telling him about my past would only make him think I was crazy. Maybe I was. No one was sure yet. I could be… she was crazy. I could be too. It was my greatest fear, that I’d snap one day too. Just like she had. I wanted to live life because if that day came I wanted to have lived once.\u003c/p\u003e\n\u003cp\u003e“They’re triggered by certain things,” I told him and moved to get out of his arms again. He let me go this time. I was grateful and yet wished he had fought to hold me longer. Because I needed affection from someone after I had these episodes. It helped me recover quicker.\u003c/p\u003e\n\u003cp\u003e“I triggered it?” he asked.\u003c/p\u003e\n\u003cp\u003eI shrugged and looked out at the gulf instead of at him. His question had triggered it. I wasn’t going to tell him that though.\u003c/p\u003e\n\u003cp\u003eWe sat there in silence for a few minutes. I knew his mind was running through all kinds of possibilities and none of them would be accurate.\u003c/p\u003e\n\u003cp\u003e“I want to know you, Della. I don’t want to stop asking you questions. Next time maybe you can ask me questions that you don’t mind me asking you. That way I won’t ask the wrong thing.”\u003c/p\u003e\n\u003cp\u003eHe wanted to know me. My chest felt like it might burst. Tears stung my eyes and I blinked them back. I couldn’t cry on him now. “Okay,” I replied hoarsely.\u003c/p\u003e\n\u003cp\u003eWoods’ hand reached over and covered mine, holding it firmly in his. He didn’t look at me. His eyes stared straight ahead at the waves crashing on the shore. When his fingers threaded through mine I let him. That simple touch was all I needed. Being here with him pushed back all the darkness. All the pain and sorrow was forgotten. I was okay. It felt good.\u003c/p\u003e\n\u003cp\u003e“Woods? Is she okay?” Bethy’s voice called out and we both turned to look back at her walking out of the club and toward us.\u003c/p\u003e\n\u003cp\u003e“She thinks you had too much to drink,” Woods said quietly beside me. I had forgotten about what everyone else thought of me.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I told her as she walked up to us.\u003c/p\u003e\n\u003cp\u003e“Oh thank God. I was sure I’d made you sick with those lemon shots. They can be fierce if you aren’t used to them.”\u003c/p\u003e\n\u003cp\u003e“She just got overheated. That mixed with the alcohol. The cool air brought her around,” Woods explained for me.\u003c/p\u003e\n\u003cp\u003eBethy’s relief was all over her face. “Thanks Woods. I can stay with her if you want to go back inside.”\u003c/p\u003e\n\u003cp\u003eWoods’ hand tightened around mine. “No, I’m good right here. I needed a break too.”\u003c/p\u003e\n\u003cp\u003eBethy looked worried but finally nodded and went back inside.\u003c/p\u003e\n\u003cp\u003eOnce she was gone I glanced up at Woods. He was watching me. “Thank you for your help tonight. If you hadn’t stepped in that could have been really embarrassing.”\u003c/p\u003e\n\u003cp\u003eWoods’ frown was etched with concern. “I’m glad I was there. What’s bothering me is the fact that you’re traveling all alone. What happens when you’re by yourself and this… this happens. Who helps you then?”\u003c/p\u003e\n\u003cp\u003eNo one. I managed. “I normally get away before it hits me hard and I deal with it.”\u003c/p\u003e\n\u003cp\u003eWoods pulled my hand closer to his leg and instead of saying more or arguing with me about that being a bad idea he turned his attention back to the dark water. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-perfection-perfection-1/page-15.html","bookId":1991,"creation":"Oct 5, 2019 10:30:18 AM","modification":"Oct 5, 2019 10:30:18 AM"}
