{"id":66032,"no":11,"title":"Page 11","content":"\u003cp\u003eHutch said, “he told me he knits himself. I suppose that convinced me.”\u003c/p\u003e\n\u003cp\u003e“Your doctor’s very wise.” Lydia picked up the conversation.\u003c/p\u003e\n\u003cp\u003e“Various studies have shown the health benefits of knitting as a form of relaxation. And from personal experience, I’d say that while our hands are at work on a project, we’re able to quiet our thoughts.”\u003c/p\u003e\n\u003cp\u003eHutch nodded slowly. “Makes sense.”\u003c/p\u003e\n\u003cp\u003e“I think you’ve made an excellent choice. Obviously,” she added with a quick grin.\u003c/p\u003e\n\u003cp\u003e“Dave also said knitting would aid the healing process with my thumb.” He held up his right hand and showed where he’d cut himself. The scar was red and ugly.\u003c/p\u003e\n\u003cp\u003e“Another good point,” Lydia commented.\u003c/p\u003e\n\u003cp\u003e“So I’m here, but I have to tell you I’ve never held a pair of knitting needles in my life.”\u003c/p\u003e\n\u003cp\u003e“That’s not a problem,” Lydia said. “I’ve taught people how to knit since I was a teenager. I’m sure you’ll learn it easily.”\u003c/p\u003e\n\u003cp\u003eHutch grinned. “Your conf idence is reassuring.”\u003c/p\u003e\n\u003cp\u003eLydia turned to Phoebe and gestured toward her. “Phoebe, can you tell us what prompted you to join Knit to Quit?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. Spilling her grief to strangers was more than she was ready to do. She stared up at Lydia. “I was engaged and…”\u003c/p\u003e\n\u003cp\u003eWhat came out next was a complete surprise. She certainly hadn’t intended to lie, although the truth embarrassed and humiliated her. “My f iancé died.”\u003c/p\u003e\n\u003cp\u003eLydia’s eyes softened with sympathy. “Oh, Phoebe, I had no idea. I…I thought—” She stopped abruptly. “It doesn’t matter what I thought. I’m so very sorry.”\u003c/p\u003e\n\u003cp\u003e“I need to get over him,” she said and swallowed hard. Tears clogged her throat and she struggled to hide the fact that she was close to weeping.\u003c/p\u003e\n\u003cp\u003eThankfully no one asked for the details of Clark’s supposed demise.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Alix said. Leaning across the table, she gently squeezed her hand. “I can’t begin to imagine what it would be like if I lost Jordan.”\u003c/p\u003e\n\u003cp\u003ePhoebe avoided their eyes. It was bad enough that she’d lied, but now she’d be obliged to continue with the charade. Everyone’s sympathy only added to her guilt. Although Hutch hadn’t spoken, his gaze was caring, concerned.\u003c/p\u003e\n\u003cp\u003eBlindly Phoebe unwrapped her knitting needles, indicating she was ready for class to begin.\u003c/p\u003e\n\u003cp\u003eResponding to her cue, Lydia held out the scarf pattern. “I chose this Bev Galeskas pattern because I feel everyone can knit this, no matter what level they are. It starts with the basic stitch.”\u003c/p\u003e\n\u003cp\u003eShe reached into a bag behind her and brought out a scarf in soft gray wool. “I knit this up so everyone could see the f inished project.”\u003c/p\u003e\n\u003cp\u003e“I could knit that? ” Hutch asked, sounding shocked.\u003c/p\u003e\n\u003cp\u003e“We all will.”\u003c/p\u003e\n\u003cp\u003e“You’re sure I can do that?”\u003c/p\u003e\n\u003cp\u003eAlix laughed. “I felt the same way in my f irst class when Lydia showed me the baby blanket. I guarantee you’ll be impressed with yourself.”\u003c/p\u003e\n\u003cp\u003e“It’ll impress my sister, anyway.” He smiled at Lydia. “If mine turns out even half as good as yours, I thought I’d give it to her for her birthday.”\u003c/p\u003e\n\u003cp\u003eHis sister? If he’d mentioned his sister rather than his wife, that probably meant he wasn’t married. Phoebe wasn’t in any mood to get romantically involved, but she felt increasingly curious about Hutch. His personality seemed the opposite of Clark’s. He didn’t need to be the center of attention and, instead, listened carefully to everyone else. As far as Phoebe was concerned, that was a rare quality. He might look ordinary but even on short acquaintance she could see that he was anything but.\u003c/p\u003e\n\u003cp\u003eBefore they cast on stitches, Lydia described the pattern and explained that reading it over f irst prevented mistakes later. She also offered to photocopy their patterns to use as “working copies.”\u003c/p\u003e\n\u003cp\u003e“That way the copied sheet can be marked up and carried with the project. Then if it’s lost, the original is always available.”\u003c/p\u003e\n\u003cp\u003eAfter that, Lydia demonstrated how to cast on stitches. The skill came back to Phoebe faster than she’d thought it would. Sitting beside Hutch, Lydia reviewed the technique with him repeatedly. He followed her instructions carefully and although he found it diff icult to hold the needles and yarn and cast on at the same time, he never once lost patience. Phoebe couldn’t picture Clark not throwing the needles and yarn down in disgust. Clark.\u003c/p\u003e\n\u003cp\u003eHow easily he’d slipped into her mind, despite her resolve. Forcing herself to concentrate, she knit methodically to the end of the row. Then the next one…\u003c/p\u003e\n\u003cp\u003eAbout an hour into the class, the phone rang. Lydia excused herself and moved to the front counter.\u003c/p\u003e\n\u003cp\u003eFrom what Phoebe could hear, this call was of a personal nature.\u003c/p\u003e\n\u003cp\u003e“Water balloons in the house?” Lydia gasped at one point, covering her eyes with her free hand.\u003c/p\u003e\n\u003cp\u003eWhen she returned a few minutes later, she looked troubled. Alix was the one who broached the subject. “Is everything all right with Cody and Brad?”\u003c/p\u003e\n\u003cp\u003e“I…I’m not sure. We have a houseguest, and it appears that she’s managed to ruff le a few feathers.”\u003c/p\u003e\n\u003cp\u003e“How long is your guest staying?” Hutch asked.\u003c/p\u003e\n\u003cp\u003e“A week.” She frowned but didn’t volunteer any further information. It was still light out when the class was off icially over. As Phoebe gathered up her knitting bag and her purse, the shop door opened and a clean-cut young man walked in.\u003c/p\u003e\n\u003cp\u003e“Jordan,” Alix said, her voice elevated. “Hi!”\u003c/p\u003e\n\u003cp\u003eThe man went over to Alix and slid his arm around her waist.\u003c/p\u003e\n\u003cp\u003e“I thought I’d stop by and pick you up.”\u003c/p\u003e\n\u003cp\u003eAlix smiled at Hutch and Phoebe. “This is my husband, Jordan Turner.”\u003c/p\u003e\n\u003cp\u003eJordan exchanged handshakes with both of them. “Pleased to meet you.”\u003c/p\u003e\n\u003cp\u003eSeeing the love between Alix and her husband brought an unexpected twinge of pain. Phoebe averted her eyes. She remembered when Clark— She immediately halted her thoughts.\u003c/p\u003e\n\u003cp\u003eNo, she wasn’t going to think about him. While it had been an outright lie to say he was dead, it was, in a manner of speaking, the truth. He was dead to her. The sooner that message went from her head to her heart, the sooner she’d get over him. The sooner this agony would stop.\u003c/p\u003e\n\u003cp\u003ePhoebe wished everyone a good evening and hurried out the door. Hutch was right behind her. A couple of times in the past two hours she’d tried to include him in the conversation. Hutch, however, had been so focused on learning the basic knit and purl stitches that he hadn’t looked up even once. Phoebe admired his persistence.\u003c/p\u003e\n\u003cp\u003e“It was nice to meet you, Phoebe,” he said now, clutching the briefcase that held his yarn and needles.\u003c/p\u003e\n\u003cp\u003eThey stood on the sidewalk facing each other. “You, too,”\u003c/p\u003e\n\u003cp\u003eshe told him.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about your f iancé.”\u003c/p\u003e\n\u003cp\u003e“I know… I am, too.” She glanced away, uncomfortable about perpetuating the lie.\u003c/p\u003e\n\u003cp\u003e“Are you parked close by?” he asked.\u003c/p\u003e\n\u003cp\u003e“Relatively close. I left my car at the parking garage where I work.”\u003c/p\u003e\n\u003cp\u003e“Can I give you a ride there?”\u003c/p\u003e\n\u003cp\u003eIt was a kind offer, but Phoebe refused. “Thanks. I’ll enjoy the walk.”\u003c/p\u003e\n\u003cp\u003e“Sure. See you next week.”\u003c/p\u003e\n\u003cp\u003e“See you then.”\u003c/p\u003e\n\u003cp\u003ePhoebe did enjoy the stroll. It’d been an interesting class and she’d look forward to spending time with Alix, Hutch and Lydia next week. This was the f irst night in a long while that she hadn’t been consumed by the loneliness that haunted her evenings. Her one regret was the lie. Still, it had saved her from diff icult explanations that she preferred not to share. Phoebe entered the condo lobby and headed for the elevator, wondering about Lydia and her situation at home. She’d obviously been disturbed by that phone call and—\u003c/p\u003e\n\u003cp\u003e“Where were you?”\u003c/p\u003e\n\u003cp\u003eShe whirled around to f ind Clark standing directly behind her.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she demanded. No way was she answering his questions.\u003c/p\u003e\n\u003cp\u003e“What do you think I’m doing here? I’ve been waiting for you for the last two hours. Phoebe, this can’t go on. I’m miserable without you. I need you.”\u003c/p\u003e\n\u003cp\u003e“Clark…”\u003c/p\u003e\n\u003cp\u003e“Hear me out. Please.”\u003c/p\u003e\n\u003cp\u003eShe had to close her eyes for fear of being inf luenced by the expression on his face, the pleading in his voice. “Don’t do this.”\u003c/p\u003e\n\u003cp\u003eTo her great relief, the elevator arrived and she dashed inside.\u003c/p\u003e\n\u003cp\u003e“Just go!”\u003c/p\u003e\n\u003cp\u003eClark stuck his arm between the doors, effectively keeping them open. “Answer me one thing and then I’ll leave.” His gaze beseeched hers. “Tell me that while I sat here for two hours, you weren’t out with another man. I couldn’t bear that, Phoebe. I could take anything but that.”\u003c/p\u003e\n\u003cp\u003eWhat he couldn’t take was losing, she thought. After a moment’s hesitation, she decided it was best to tell him the truth.\u003c/p\u003e\n\u003cp\u003e“I…I’m not seeing anyone else.”\u003c/p\u003e\n\u003cp\u003eHe nodded and whispered “Thank you.” Then he stepped back as the elevator doors slid closed.\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003eAnne Marie Roche\u003c/p\u003e\n\u003cp\u003eThey’d been home for a week, but Anne Marie was only now rediscovering the routine of her life. She sat in her small off ice at the store and paid the bills that had accumulated in her absence, although her mind drifted frequently from the task at hand. Memories of Paris were still with her. Sainte Chapelle had taken her breath away. A visit to the magnif icent Nôtre Dame had humbled her and the ride up the Eiffel Tower had thrilled her. Boat trips on the Seine, the Louvre, meals at charming little bistros… The trip had been everything Anne Marie had dreamed and more.\u003c/p\u003e\n\u003cp\u003eEllen had barely been able to absorb it all, and Anne Marie felt the same mixture of awe and wonder. Now that she’d had the experience, all she could think about was returning. Anne Marie was delighted by Ellen’s ability to learn French. She picked it up with ease, hearing words once or twice and remembering them. Anne Marie wanted her to retain as much as possible and Ellen practiced every chance she got, especially on Baxter. Because of their special communication, the dog seemed to understand her, no matter what language Ellen spoke. It was the modulation in the child’s voice that cued the dog, or so Anne Marie assumed. In any case, Baxter had quickly learned assis for “sit” and parle for “speak.”\u003c/p\u003e\n\u003cp\u003eDuring the remainder of the summer Ellen would be going to the day camp associated with the Free Methodist church around the corner. The program was reasonably priced and Ellen seemed to like it. Cody Goetz attended, too. So did Casey, Lydia and Brad’s foster girl, although that was only supposed to be for just a few more days. The church camp sponsored frequent f ield trips, plus craft classes and sports activities. Jordan Turner, Alix’s husband, headed the program, with the assistance of several young staffers.\u003c/p\u003e\n\u003cp\u003eShortly after the adoption, Anne Marie and Ellen had started going to Sunday school and morning worship services. As a new mother, even if her baby was almost nine at the time, Anne Marie felt it was the right thing to do.\u003c/p\u003e\n\u003cp\u003eShe’d fallen out of the habit of church attendance after she’d separated from Robert. Later, when the husband she loved had died—as they were on the verge of reconciling—Anne Marie had been angry with God. So angry… \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-11.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
