{"id":66045,"no":24,"title":"Page 24","content":"\u003cp\u003eThey’d walked to the restaurant, and when they stepped outside, they noticed the evening had cooled considerably. Phoebe had brought a sweater; Hutch held it politely as she slipped her arms into the sleeves.\u003c/p\u003e\n\u003cp\u003e“That was a divine dinner.”\u003c/p\u003e\n\u003cp\u003e“It always is,” Hutch said. “That’s why I chose this restaurant.”\u003c/p\u003e\n\u003cp\u003eThey walked side by side in silence, and then Hutch reached for her hand. “The book said hand-holding is acceptable after the second date,” he told her.\u003c/p\u003e\n\u003cp\u003e“I see,” she said with a nod.\u003c/p\u003e\n\u003cp\u003e“There’s quite a list of rules, you know.”\u003c/p\u003e\n\u003cp\u003e“I guess I didn’t,” she said. “What other rules are there?”\u003c/p\u003e\n\u003cp\u003e“For one thing…” He paused. “Hey, I’m not giving away all my secrets.”\u003c/p\u003e\n\u003cp\u003ePhoebe laughed.\u003c/p\u003e\n\u003cp\u003e“Why do you want to know?” he asked.\u003c/p\u003e\n\u003cp\u003e“Just curious,” she said.\u003c/p\u003e\n\u003cp\u003eThey strolled down the well-lit street, holding hands, swinging them slightly.\u003c/p\u003e\n\u003cp\u003e“Anything in particular that’s arousing your curiosity?”\u003c/p\u003e\n\u003cp\u003e“Actually, yes,” she replied.\u003c/p\u003e\n\u003cp\u003eHutch stopped walking and looked down at her. They’d come to a side street where traff ic was light.\u003c/p\u003e\n\u003cp\u003e“I wondered what the book had to say about kissing.”\u003c/p\u003e\n\u003cp\u003e“Kissing,” he repeated. “According to the rules, it would be within the scope of respectable behavior to…”\u003c/p\u003e\n\u003cp\u003e“To do what?”\u003c/p\u003e\n\u003cp\u003e“To kiss you on the third date.”\u003c/p\u003e\n\u003cp\u003e“The third date? When was this book published?”\u003c/p\u003e\n\u003cp\u003e“1952. I picked it up at a secondhand bookstore—after reading Dating for Dummies. I happen to love old books and I found the advice in the older one more to my liking.”\u003c/p\u003e\n\u003cp\u003eThey had so many of the same likes and dislikes, and she kept discovering new similarities between them. “I love old books, too. I’ve collected them for years.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, as if nothing she said would surprise him.\u003c/p\u003e\n\u003cp\u003e“Me, too. I like old sci-f i novels.”\u003c/p\u003e\n\u003cp\u003e“Old biographies for me,” she said.\u003c/p\u003e\n\u003cp\u003eThey continued walking, and Hutch escorted Phoebe to her door. “I had a great time,” she told him, turning to smile up at him.\u003c/p\u003e\n\u003cp\u003e“I did, too.”\u003c/p\u003e\n\u003cp\u003eHe hesitated, so Phoebe took matters into her own hands. Rising onto the tips of her toes, she slid her arms around his neck and kissed him. Hutch placed his own arms around her waist, then tightened his embrace.\u003c/p\u003e\n\u003cp\u003eThe kiss was magical. Romantic. Sexy. Clark always had to be in charge; Hutch simply let their kiss happen. It felt like something shared, as though it belonged to her as much as him. When he lifted his head, he kept his eyes closed for several seconds. Then he cleared his throat. “That was very…nice.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Phoebe pressed her hand to his heart, feeling the heavy thudding against her palm. “Yes, it was.”\u003c/p\u003e\n\u003cp\u003eHe kissed her again. She wouldn’t have believed it was possible, but the second kiss was even better than the f irst.\u003c/p\u003e\n\u003cp\u003e“Good night, Phoebe.”\u003c/p\u003e\n\u003cp\u003e“Good night, Hutch.” She felt weak with longing as she fumbled with the key and opened the door.\u003c/p\u003e\n\u003cp\u003eSmiling, she set her purse down and immediately noticed the light on her phone. She checked caller ID. No surprise there— the call had come from Clark.\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003eAnne Marie Roche\u003c/p\u003e\n\u003cp\u003e“Where are we going again?” Ellen asked, skipping at Anne Marie’s side as she held Baxter’s leash.\u003c/p\u003e\n\u003cp\u003e“To the park.” Anne Marie hadn’t told her much about their meeting with Tim Carlsen. She still wasn’t sure what to say or how much to explain. She’d mentioned only that they’d be seeing a “friend.”\u003c/p\u003e\n\u003cp\u003e“Can I have some ice cream?” Ellen asked.\u003c/p\u003e\n\u003cp\u003eAnne Marie smiled at her. “I think that can be arranged.”\u003c/p\u003e\n\u003cp\u003e“Goody.”\u003c/p\u003e\n\u003cp\u003eEllen was so easily pleased, her trust complete. Anne Marie prayed she was doing the right thing by introducing her daughter to Tim. Ever since her late-night phone call, she’d been racked with indecision. More times than she could count, she’d picked up the phone, determined to cancel. And then, overcome with doubt, she’d replace the phone, deciding to let this play out.\u003c/p\u003e\n\u003cp\u003eAs recently as an hour ago, she’d been convinced it was a terrible mistake. But now she’d f inally made up her mind—she’d grant Tim the privilege of getting to know Ellen. Tim had suggested meeting at the fountain in the center of the park. Sure enough, there he was, sitting on the circular stone edge. Children raced around the park, their glee and excitement infectious in the afternoon sun.\u003c/p\u003e\n\u003cp\u003eHe stood as they approached, and Anne Marie’s heart felt lodged in her throat.\u003c/p\u003e\n\u003cp\u003e“Hello,” Tim greeted them, his gaze focused on Ellen. Not understanding, the girl looked up at Anne Marie.\u003c/p\u003e\n\u003cp\u003e“Hello, Tim,” she managed to croak out.\u003c/p\u003e\n\u003cp\u003eWhen she didn’t say anything further or make any effort to introduce him, Tim bent down and thrust out his hand. “You must be Ellen. My name is Tim.”\u003c/p\u003e\n\u003cp\u003eEllen edged closer to Anne Marie. “This is Baxter,” she said, motioning toward the Yorkie, who stared curiously at Tim. To Anne Marie’s frequent annoyance, Baxter barked up a mighty storm with just about everyone he encountered for the f irst time. Not with Tim, though. The small dog quietly and without reservation accepted him as a friend.\u003c/p\u003e\n\u003cp\u003e“Mom said she’d buy me an ice cream,” Ellen announced. Tim’s smile was gentle. “What a great idea. I’ll get ice cream for all of us. Why don’t you two sit here and I’ll be right back.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eHe started walking toward the nearby ice-cream vendor’s cart, glancing back to send them another reassuring smile. Anne Marie lowered herself to the stone bench, half listening to the melodic splashing of water behind her. Her mouth had gone dry and it felt as if her tongue was glued to her teeth. Normal conversation seemed impossible. She didn’t know how she was going to get through this ordeal without Ellen sensing that something was very wrong.\u003c/p\u003e\n\u003cp\u003e“Who’s Tim?” Ellen asked, sitting next to her. She brought Baxter onto her lap and waited for Anne Marie’s explanation. If only there was an easy explanation!\u003c/p\u003e\n\u003cp\u003e“A friend,” Anne Marie said again, surprised she was able to answer at all.\u003c/p\u003e\n\u003cp\u003eEllen didn’t speak for a moment. “Is he your…boyfriend?”\u003c/p\u003e\n\u003cp\u003eBecause she hadn’t come up with anything better, Anne Marie nodded. “Sort of.”\u003c/p\u003e\n\u003cp\u003eThat appeared to satisfy Ellen. “I like him.”\u003c/p\u003e\n\u003cp\u003e“You’d like anyone who bought you ice cream,” Anne Marie teased, hoping to make light of the girl’s immediate acceptance of Tim.\u003c/p\u003e\n\u003cp\u003eEllen giggled. “No, I wouldn’t.” She petted the Yorkie, who’d curled up in her lap. “Baxter likes him, too.”\u003c/p\u003e\n\u003cp\u003eThe little traitor, Anne Marie mused. “I saw that.”\u003c/p\u003e\n\u003cp\u003eAs promised, Tim was back within minutes, carrying three icecream bars. Ellen placed Baxter on the ground as he doled them out. “Thank you,” she said, polite as always. Unwrapping the bar, Ellen looked at Tim, her head slightly tilted. “Mom says you’re her boyfriend.”\u003c/p\u003e\n\u003cp\u003eTim’s eyes met hers.\u003c/p\u003e\n\u003cp\u003e“Sort-of boyfriend,” Anne Marie corrected.\u003c/p\u003e\n\u003cp\u003e“Would you like that?” Tim asked Ellen, then took the f irst bite of his ice cream.\u003c/p\u003e\n\u003cp\u003eEllen nodded. “You’re okay.”\u003c/p\u003e\n\u003cp\u003e“Just okay? ” he said, pretending to be insulted. He grinned at Anne Marie, who smiled back stiff ly.\u003c/p\u003e\n\u003cp\u003eEllen laughed. “Baxter thinks you are, too.”\u003c/p\u003e\n\u003cp\u003e“A dog with inf inite good sense.” Tim continued to eat his ice cream and had it half-consumed before Anne Marie had even removed her wrapper.\u003c/p\u003e\n\u003cp\u003e“Is there anything you want to ask me?” Tim directed the question to Ellen. “Since I might be dating your mother,” he added. She nodded again. “Do you have a job?”\u003c/p\u003e\n\u003cp\u003e“I do,” he told her. “I work at an insurance agency with my father. Dad’s retiring next year and I’ll be taking over the business once he does.”\u003c/p\u003e\n\u003cp\u003eEllen looked at Anne Marie for clarif ication. “He’s got a good job,” she explained simply. “He works in an off ice.”\u003c/p\u003e\n\u003cp\u003eEllen’s attention returned to Tim. “Do you drink?”\u003c/p\u003e\n\u003cp\u003eAnne Marie was shocked by that question. Surely Ellen couldn’t recall her own mother’s drinking—could she? She’d never indicated that in any way.\u003c/p\u003e\n\u003cp\u003e“I used to a long time ago but I don’t anymore,” he said in a solemn voice.\u003c/p\u003e\n\u003cp\u003eEllen licked her ice cream while she thought about his response. “That’s good.”\u003c/p\u003e\n\u003cp\u003e“It is for me,” he agreed.\u003c/p\u003e\n\u003cp\u003e“Do you love Jesus?”\u003c/p\u003e\n\u003cp\u003e“Ellen,” Anne Marie whispered, worried that the questions were getting too personal.\u003c/p\u003e\n\u003cp\u003e“I do,” Tim answered. “But I don’t always go to church like I should.”\u003c/p\u003e\n\u003cp\u003eEllen accepted that. “Do you like animals?” she asked without a pause.\u003c/p\u003e\n\u003cp\u003eTim nodded. “I had a dog as a kid.”\u003c/p\u003e\n\u003cp\u003e“Like Baxter?”\u003c/p\u003e\n\u003cp\u003e“Not exactly. He was a big black Lab named Caesar.”\u003c/p\u003e\n\u003cp\u003e“Do you have any pets now?”\u003c/p\u003e\n\u003cp\u003eTim took her rapid-fire questions in stride. “A cat named Bozo.”\u003c/p\u003e\n\u003cp\u003eEllen giggled delightedly. “That’s a funny name for a cat.”\u003c/p\u003e\n\u003cp\u003e“Bozo’s a funny cat.” Tim crossed his legs at the ankles. He seemed relaxed, at ease, comfortable with the girl’s interrogation. Thankfully, Ellen’s questions had distracted him—and Ellen herself—from the fact that Anne Marie had hardly said a word. She couldn’t. If either of them so much as looked at her, Anne Marie was afraid she might just grab her daughter and take off running.\u003c/p\u003e\n\u003cp\u003e“Do you like kids?” Ellen asked next, studying Tim intently.\u003c/p\u003e\n\u003cp\u003e“I like them a lot.”\u003c/p\u003e\n\u003cp\u003e“Little girls, too?”\u003c/p\u003e\n\u003cp\u003e“Little girls, too, especially pretty ones like you.”\u003c/p\u003e\n\u003cp\u003eHis answer made her smile, revealing front teeth that were still a bit too big for her mouth. Anne Marie couldn’t help noticing that Ellen’s dark hair and eyes were nearly a ref lection of Tim’s.\u003c/p\u003e\n\u003cp\u003e“Have you ever thought about having a father in your life, Ellen?” he asked.\u003c/p\u003e\n\u003cp\u003eAnne Marie shot him a warning frown.\u003c/p\u003e\n\u003cp\u003e“That’s on my list!” She set the stick from her ice-cream bar carefully on the fountain’s edge. “Mom and I have a list of twenty wishes,” she said. “Do you know about it?”\u003c/p\u003e\n\u003cp\u003eTim shook his head. “Do you want to tell me?”\u003c/p\u003e\n\u003cp\u003e“Okay.” Ellen was always eager to talk about her wishes, almost as though she was trying to convert everyone she met. “Mom and her friends made these lists of twenty wishes. I made my own list and a bunch of my wishes already came true. I wanted to learn to knit and I did. Mom showed me how and I made a lap robe for my Grandma Dolores. She died.”\u003c/p\u003e\n\u003cp\u003e“I know, and I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“She’s up in heaven with Jesus now. She loved Him, too. Just like us.”\u003c/p\u003e\n\u003cp\u003e“I bet she’s watching over you from up there,” Tim said sympathetically.\u003c/p\u003e\n\u003cp\u003e“That’s what Mom said.”\u003c/p\u003e\n\u003cp\u003e“Anything else on your list?” \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-24.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
