{"id":66049,"no":28,"title":"Page 28","content":"\u003cp\u003e“I doubt he’ll f it in your suitcase,” Anne Marie told her, standing in the doorway of her daughter’s room. “I think you’ll be able to survive one night without him, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Okay,” Ellen said, trying to zip up the small suitcase that bulged on both sides. Baxter slept on the bed, curled up tightly, snoozing away the Friday afternoon.\u003c/p\u003e\n\u003cp\u003eAnne Marie stepped inside the room. “Maybe I should help you close that.”\u003c/p\u003e\n\u003cp\u003e“I can do it,” Ellen insisted, and sure enough, she managed to pull the zipper all the way around, although it was a struggle. Turning, she smiled triumphantly at Anne Marie. “See?”\u003c/p\u003e\n\u003cp\u003eAnne Marie’s mother had agreed to keep Ellen overnight. This wasn’t the f irst night Ellen had spent with her Grandma Laura. Her mother’s wholehearted support of the adoption meant a lot to Anne Marie, especially since their relationship had been a diff icult one for some years.\u003c/p\u003e\n\u003cp\u003e“We’re going to watch movies and have popcorn and then tomorrow Grandma Laura’s taking me to the Pacif ic Science Center and she said I could ride on the monorail.”\u003c/p\u003e\n\u003cp\u003e“You’re going to have fun on Saturday.”\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Ellen asked. Apparently the thought had only now entered her mind.\u003c/p\u003e\n\u003cp\u003e“Well…” Anne Marie had a full schedule, too. “To start with, I’m seeing Tim again.” She’d purposely made it sound like a date. Although they were meeting at a restaurant, this wasn’t a social engagement. Tim had gotten the test results back and had asked to talk to her privately. “Then I’m—”\u003c/p\u003e\n\u003cp\u003e“I like him,” Ellen said, interrupting her. “He’s funny.”\u003c/p\u003e\n\u003cp\u003eAnne Marie responded with a wobbly smile. “He is very nice,”\u003c/p\u003e\n\u003cp\u003eshe agreed reluctantly. Intent on changing the subject, she quickly added, “Then on Saturday afternoon, when I’m f inished at the bookstore, I’m going out with a real estate agent to look at a couple of houses.”\u003c/p\u003e\n\u003cp\u003eEllen’s face fell. “I don’t want to move. I like it here.”\u003c/p\u003e\n\u003cp\u003eAnne Marie was well aware of her daughter’s feelings, which was why she’d delayed leaving the neighborhood. Ellen loved their tiny apartment and the friends she’d made on Blossom Street. For most of her life, she’d been shuff led from foster home to foster home, and then to her Grandma Dolores’s. Understandably Ellen craved permanence and stability, and Anne Marie intended to provide that. Whenever they’d discussed moving from the apartment, Ellen had seemed apprehensive, so Anne Marie had waited. She was trying to handle this carefully to avoid undermining Ellen’s still-fragile sense of security. She’d hoped to f ind a house this summer and move in by the time school started. Clearly, that wasn’t going to happen.\u003c/p\u003e\n\u003cp\u003e“Once we’re in our new house we’ll never move again,” Anne Marie promised.\u003c/p\u003e\n\u003cp\u003eShe could tell that Ellen didn’t want to talk about this anymore.\u003c/p\u003e\n\u003cp\u003e“What else are you doing?” the girl asked.\u003c/p\u003e\n\u003cp\u003e“Saturday afternoon I’ll pick you up and we’ll go see Melissa, Michael and the baby. Brandon’s coming, too.”\u003c/p\u003e\n\u003cp\u003eEllen broke into a smile and clapped her hands. “Oh, goody!”\u003c/p\u003e\n\u003cp\u003eIn the course of the past year, Anne Marie’s relationship with her stepdaughter had gone from hostile, on Melissa’s part, to one of mutual affection and shared conf idences. Robert would be thrilled to know that the two women he’d loved were now close friends. His son, Brandon, had always been a supporter of Anne Marie’s and that hadn’t changed.\u003c/p\u003e\n\u003cp\u003e“You ready to head out?” Anne Marie asked.\u003c/p\u003e\n\u003cp\u003eNodding, Ellen dragged the heavy bag off her bed. On the drive over to her mother’s house, Anne Marie reminded Ellen about her manners, although it wasn’t really necessary, since Ellen was a well-behaved child. Anne Marie stayed only long enough to get her settled. They hugged goodbye and then Ellen stood in the front window, Grandma Laura behind her, waving wildly.\u003c/p\u003e\n\u003cp\u003eNerves twisted Anne Marie’s stomach as she got closer to her destination. She was meeting Tim Carlsen at a restaurant near his insurance agency—and as far from Blossom Street as possible. Forty minutes later, she parked on the street Tim had mentioned. She saw him pacing in front of the old-fashioned diner, waiting for her. Glancing at her watch, she noted that she was right on time, almost to the minute.\u003c/p\u003e\n\u003cp\u003eTim’s eyes met hers as she crossed the street.\u003c/p\u003e\n\u003cp\u003e“Let’s go inside,” he said abruptly.\u003c/p\u003e\n\u003cp\u003e“Fine.” She didn’t know whether the DNA result was good news, or even what def ined good in this situation. All she could tell was that Tim seemed uneasy. That could mean he’d learned he was Ellen’s biological father—or that he wasn’t. They found a booth and slid inside, sitting opposite each other. The waitress brought over a coffeepot and Anne Marie righted her mug, as did Tim. He and the older woman exchanged fond greetings; he was obviously a regular and well-liked, which didn’t surprise Anne Marie.\u003c/p\u003e\n\u003cp\u003e“So?” she asked anxiously. “What did you f ind out?”\u003c/p\u003e\n\u003cp\u003eBefore he could answer, the waitress returned with menus and said, “The special today is chicken-fried steak. Cook uses a recipe he got from his grandmother who was from Texas,” she announced proudly. “The soup’s split pea.”\u003c/p\u003e\n\u003cp\u003eAfter she left, Tim asked, “Are you hungry?”\u003c/p\u003e\n\u003cp\u003eShe shook her head and then, as if to denounce her as a liar, her stomach growled loudly enough for him to hear. He grinned. “The soup’s homemade. I know, because I had it for lunch.”\u003c/p\u003e\n\u003cp\u003eHis smile intrigued Anne Marie. “All right, I’ll have a bowl of the soup, but only if you eat something, too.”\u003c/p\u003e\n\u003cp\u003eHe agreed and when the waitress came back they placed their orders. A moment later, Anne Marie repeated the question that had been burning in her mind ever since his phone call. “So you got the results?”\u003c/p\u003e\n\u003cp\u003eTim nodded, took an envelope out of his pocket and handed it to her. “Ellen’s my daughter,” he said without preamble. Anne Marie went numb. She wasn’t sure what she was supposed to feel, how she was supposed to react. The f irst emotion that struck her was fear.\u003c/p\u003e\n\u003cp\u003e“I’d like to remind you that Ellen’s legally my daughter now,”\u003c/p\u003e\n\u003cp\u003eshe f inally managed. “You have no rights as far as the courts are concerned. You—”\u003c/p\u003e\n\u003cp\u003eTim raised one hand to forestall her. “Don’t worry. I have no intention of trying to take her away from you or proceeding with any form of legal action.”\u003c/p\u003e\n\u003cp\u003eAnne Marie sighed with relief. “Thank you.”\u003c/p\u003e\n\u003cp\u003eStaring down at the table, he unwrapped his silverware, setting it and the paper napkin aside. “I don’t mind telling you the results shook me,” he said in a low voice.\u003c/p\u003e\n\u003cp\u003e“I thought you already knew.”\u003c/p\u003e\n\u003cp\u003eHe glanced at her. “I suspected, but having that suspicion conf irmed jolted me. All the emotions I felt—well, it was kind of a shock.”\u003c/p\u003e\n\u003cp\u003e“How do you mean?”\u003c/p\u003e\n\u003cp\u003eHe f idgeted with the fork, running his f inger over the tines.\u003c/p\u003e\n\u003cp\u003e“Well, for one thing, I felt tremendous guilt at having abandoned Candy.”\u003c/p\u003e\n\u003cp\u003e“As I recall, you didn’t even know she was pregnant.” Because of that, he had no reason to feel guilty, in her view anyway.\u003c/p\u003e\n\u003cp\u003e“That’s true,” he said. “But Candy tried to let me know and that’s been bothering me.”\u003c/p\u003e\n\u003cp\u003eAnne Marie looked at him steadily but didn’t speak.\u003c/p\u003e\n\u003cp\u003e“I had a long talk with my sponsor.”\u003c/p\u003e\n\u003cp\u003e“Your sponsor?”\u003c/p\u003e\n\u003cp\u003e“Sorry. In Alcoholics Anonymous, part of the program includes having a sponsor, someone who’s successfully stayed clean and sober. That person listens and encourages when needed.”\u003c/p\u003e\n\u003cp\u003e“Of course.” She should’ve known that was what he meant. Tim set his fork aside and reached for the spoon. “Knowing I have a child threw me more than anything else since I entered rehab.”\u003c/p\u003e\n\u003cp\u003e“I imagine the guilt and regret is only natural.”\u003c/p\u003e\n\u003cp\u003e“I want to make it up to Ellen somehow and yet I know I can’t,”\u003c/p\u003e\n\u003cp\u003eTim said. “I have a beautiful, intelligent, delightful child I can’t even acknowledge and it’s killing me.” He plowed his hand through his hair. Anne Marie recognized the agony in that gesture. As if he suddenly realized what he’d said, his gaze shot to her.\u003c/p\u003e\n\u003cp\u003e“Please don’t misunderstand me. I don’t blame you. Not in the slightest. If it wasn’t for you in Ellen’s life, I’m sure she wouldn’t be as healthy and happy as she is now. After Dolores died, Ellen could’ve ended up who-knows-where. I can’t even be sure I would’ve found my daughter if not for you or had the chance to conf irm that Ellen’s my child.”\u003c/p\u003e\n\u003cp\u003eDespite everything, Anne Marie was beginning to feel sorry for him. “Did your sponsor help you sort through all these emotions?”\u003c/p\u003e\n\u003cp\u003eTim responded with a nod. “What he said about acknowledging my feelings made sense. At the same time, the fact that Ellen’s my own f lesh and blood hasn’t sunk in.”\u003c/p\u003e\n\u003cp\u003e“Yes, well…”\u003c/p\u003e\n\u003cp\u003e“I’ve only seen Ellen once and I love her. I mean, I love that little girl. There are years of my life that are more or less a blur. Years I squandered on stupid, destructive behavior. And yet out of that whole mess came Ellen. Precious, innocent, perfect Ellen.”\u003c/p\u003e\n\u003cp\u003e“I guess that’s why they say God works in mysterious ways.”\u003c/p\u003e\n\u003cp\u003eTim laughed. “That’s for sure.”\u003c/p\u003e\n\u003cp\u003eThe waitress arrived with their meals, Anne Marie’s soup and chicken-fried steak for Tim. They paused long enough to sample their food.\u003c/p\u003e\n\u003cp\u003eAfter taking a few bites, Tim put down his fork. “Would you allow me to see her again?”\u003c/p\u003e\n\u003cp\u003eAnne Marie hesitated, caught between contradictory impulses—\u003c/p\u003e\n\u003cp\u003ecompassion for Tim and fear for herself.\u003c/p\u003e\n\u003cp\u003e“Not alone or anything. You’d always be there.”\u003c/p\u003e\n\u003cp\u003eAnne Marie knew that once this door was opened, there’d be no closing it. After a moment, she said—felt she had to say—“I think that would be f ine.”\u003c/p\u003e\n\u003cp\u003eFor an instant she saw tears glistening in his eyes. “Thank you,”\u003c/p\u003e\n\u003cp\u003ehe whispered. “You’ve been kind and generous when I haven’t deserved either.”\u003c/p\u003e\n\u003cp\u003e“We’ll go about this very slowly,” she warned.\u003c/p\u003e\n\u003cp\u003e“However you wish.”\u003c/p\u003e\n\u003cp\u003e“Ellen believes you’re my boyfriend, and I feel we should let her continue with that assumption.”\u003c/p\u003e\n\u003cp\u003e“I agree,” Tim said. “How soon before I can ask you two on another date?”\u003c/p\u003e\n\u003cp\u003e“When would you like?”\u003c/p\u003e\n\u003cp\u003e“Would this Sunday work for you?”\u003c/p\u003e\n\u003cp\u003eAnne Marie smiled. “That would work very well.”\u003c/p\u003e\n\u003cp\u003e“I have a sailboat,” Tim said eagerly. “Would you and Ellen enjoy going out on the water with me?”\u003c/p\u003e\n\u003cp\u003eAnne Marie wouldn’t presume to speak for her daughter, but she knew she herself would love it. “Sounds great.”\u003c/p\u003e\n\u003cp\u003e“It’s docked at Lake Washington. I could meet you at the bookstore. Say one-thirty?”\u003c/p\u003e\n\u003cp\u003e“We’ll be ready.”\u003c/p\u003e\n\u003cp\u003eTim ate with renewed vigor. When he’d almost f inished his meal, he stopped and looked directly at Anne Marie. “Thank you,” he said again. “For everything.” \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-28.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
