{"id":66056,"no":35,"title":"Page 35","content":"\u003cp\u003eThat thought stayed with her as she drove home and parked behind the bookstore.\u003c/p\u003e\n\u003cp\u003eOne of the many things Anne Marie liked about Tim Carlsen was the fact that he didn’t ignore social niceties and details. Although Monte’s, the Italian restaurant he’d chosen, was within walking distance, he insisted on picking her up, despite her offer to meet him there.\u003c/p\u003e\n\u003cp\u003eWhen she opened the apartment door to let Tim in, Baxter yelped excitedly. Tim stooped down and paid him due attention, and when he straightened, his eyes widened with appreciation.\u003c/p\u003e\n\u003cp\u003e“You look…wow,” he said.\u003c/p\u003e\n\u003cp\u003e“Thank you.” While Tim played with Baxter, Anne Marie went into her bedroom to get her purse. As she did, she noticed that her hand was trembling.\u003c/p\u003e\n\u003cp\u003eAlthough she’d tried to minimize this dinner date with her friends, she felt nervous. She could hardly remember the last time she’d been on an actual date. Before she’d married Robert, so that was… She decided not to do the math.\u003c/p\u003e\n\u003cp\u003eShe’d dressed carefully in a white eyelet summer dress with a silky pink shawl and pink pumps.\u003c/p\u003e\n\u003cp\u003e“Are you ready?” Tim asked when Anne Marie met him in the living room.\u003c/p\u003e\n\u003cp\u003eShe nodded. Because she felt f lustered, she found herself chattering as they strolled to the restaurant. The evening was perfect, still sunny, with a light breeze scenting the air.\u003c/p\u003e\n\u003cp\u003e“I’ve been looking at houses,” she said. “Ellen doesn’t want to move, but the apartment’s too small.” She went on to tell him that she was considering houses in the same neighborhood as Hallie’s, thinking that if Ellen had a friend close by, the move would be less traumatic.\u003c/p\u003e\n\u003cp\u003eBy the time they reached the restaurant, Anne Marie realized she hadn’t let Tim say a word. This behavior was so uncharacteristic for her, she felt she should explain.\u003c/p\u003e\n\u003cp\u003e“I generally don’t talk this much,” she said, embarrassed. “I guess I’m a little nervous.”\u003c/p\u003e\n\u003cp\u003eTim reassured her with a grin. “So am I,” he admitted. It was such a comforting thing to say that Anne Marie was instantly at ease. The hostess seated them at a nice table near the window. When the waiter came to take their drink order, Tim said he’d stick to water but told Anne Marie she should have a glass of wine. She ordered the house red.\u003c/p\u003e\n\u003cp\u003e“It doesn’t bother you if other people drink?” she asked, feeling awkward.\u003c/p\u003e\n\u003cp\u003e“Not in the least. Other people can handle it. I can’t.”\u003c/p\u003e\n\u003cp\u003eStill, she felt guilty drinking in his presence. “I don’t mind doing without wine,” she said.\u003c/p\u003e\n\u003cp\u003eHe held up his hand. “Please don’t. Sobriety is up to me and me alone.”\u003c/p\u003e\n\u003cp\u003eHis attitude impressed her, and she sipped her wine, almost able to enjoy it.\u003c/p\u003e\n\u003cp\u003eWhen the waiter returned, they placed their dinner orders. Tim asked for the eggplant parmigiano and Anne Marie the clam spaghetti. The waiter left and Anne Marie smoothed her napkin repeatedly in her nervousness, waiting for Tim to speak. So far, she’d dominated the conversation.\u003c/p\u003e\n\u003cp\u003e“I’m hoping now that we’ve had a chance to get to know each other, you’ll be comfortable with me,” he said.\u003c/p\u003e\n\u003cp\u003e“I already feel that way.” Anne Marie took a piece of bread and tore off a bite. “I can hardly believe how much.” She dipped the bread in the small dish of olive oil in the center of the table, not looking at him as she spoke. “You’ve convinced me that you won’t try to take Ellen away from me.”\u003c/p\u003e\n\u003cp\u003e“I’d never do that. The two of you belong together. Dolores got that right. She knew you’d love and care for Ellen better than Candy—or anyone else, for that matter.”\u003c/p\u003e\n\u003cp\u003eShe f lushed, feeling a surge of joy. The fact that he, of all people, had acknowledged this brought her not only gratitude but peace. “Thank you,” she murmured.\u003c/p\u003e\n\u003cp\u003eThey enjoyed their meal immensely, talking about a wide range of subjects from baseball to politics and everything in between. Over spumoni and coffee, Tim grew quiet again. “If it’s okay with you, Anne Marie, I’d like to tell my parents about Ellen.”\u003c/p\u003e\n\u003cp\u003eIt would be self ish to withhold a grandparent’s love from her daughter, so Anne Marie agreed. “That would be f ine.”\u003c/p\u003e\n\u003cp\u003eHis hand cradled the coffee cup, and he nodded solemnly.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You told me Ellen’s their only granddaughter.”\u003c/p\u003e\n\u003cp\u003e“She is, and my mother’s been dying to have a girl to spoil. My younger sister has two boys.”\u003c/p\u003e\n\u003cp\u003e“She sounds just like my mother.”\u003c/p\u003e\n\u003cp\u003eTim stared down at his coffee. “Would you also be willing to let Ellen spend time with me alone?”\u003c/p\u003e\n\u003cp\u003eAnne Marie hadn’t expected this subject to come up quite so soon, yet it was a reasonable request. “Are you asking about visitation?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eStill, she hesitated. “How often were you thinking?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I’ll take whatever you’re willing to give me. I don’t mean to pressure you, Anne Marie. If you’d rather wait, I understand.”\u003c/p\u003e\n\u003cp\u003e“But you wanted to plant the thought in my mind.”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s a good way of putting it.”\u003c/p\u003e\n\u003cp\u003e“You’re asking if you can tell Ellen that you’re her father.”\u003c/p\u003e\n\u003cp\u003eThis was the great unasked question, the one that underlay all the others.\u003c/p\u003e\n\u003cp\u003e“I would like to do that. Even before I got the test results I felt that Ellen was my child.”\u003c/p\u003e\n\u003cp\u003eNow it was Anne Marie’s turn to stare into her coffee. Her ice cream had started to melt, and she pushed it aside. Her f irst inclination, self ish though it might be, was to deny him. She glanced up and found him watching her intently, his eyes relaying a message of hope and expectancy.\u003c/p\u003e\n\u003cp\u003e“I want to be with Ellen when you tell her.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“We’ll begin the visitations slowly. And you can’t tell her until I feel she’s ready.”\u003c/p\u003e\n\u003cp\u003e“Like I said, you’re the one setting the rules.”\u003c/p\u003e\n\u003cp\u003eHe was so agreeable, and that helped soothe her worries.\u003c/p\u003e\n\u003cp\u003e“Would it be all right if I took her one night next week? My parents’ wedding anniversary is coming up and I’d like Ellen to meet them before the big party.”\u003c/p\u003e\n\u003cp\u003eBefore she could f ind an excuse to refuse him, Anne Marie nodded. “But they can’t let her know who they are. What they are to her, I mean.”\u003c/p\u003e\n\u003cp\u003e“I accept that.” His gaze held hers. “Thank you.”\u003c/p\u003e\n\u003cp\u003eThis request probably explained why he’d asked her to dinner on her own, which was more than a little disappointing.\u003c/p\u003e\n\u003cp\u003e“I’m glad we got that settled,” she said briskly.\u003c/p\u003e\n\u003cp\u003e“Actually,” Tim said, “there’s something else.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eHe lowered his eyes. “I’m afraid I might have misled you in the past few weeks.”\u003c/p\u003e\n\u003cp\u003e“Misled me? How?”\u003c/p\u003e\n\u003cp\u003e“I apologize. That was never my intention.”\u003c/p\u003e\n\u003cp\u003eAnne Marie was even more confused. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003eHe inhaled deeply. “I guess the best way to tell you is just to tell you. I’m involved with someone else.”\u003c/p\u003e\n\u003cp\u003eAnne Marie sat unmoving as the shock rippled through her.\u003c/p\u003e\n\u003cp\u003e“You’re…involved.”\u003c/p\u003e\n\u003cp\u003e“Vanessa and I—”\u003c/p\u003e\n\u003cp\u003e“Her name’s Vanessa?”\u003c/p\u003e\n\u003cp\u003e“Yes, and I have to tell you this whole situation has been very difficult for her.”\u003c/p\u003e\n\u003cp\u003eAnne Marie bit off a sarcastic comment. She needed all the self-control she possessed not to reveal how shocked she was by his announcement.\u003c/p\u003e\n\u003cp\u003e“I didn’t want you to—”\u003c/p\u003e\n\u003cp\u003eAnne Marie struggled to remain calm. “Don’t you think you might’ve said something sooner?”\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, then closed it. “Yes, well…perhaps I should have, but there never seemed to be a good time.”\u003c/p\u003e\n\u003cp\u003e“Really?” she muttered. Funny how he’d managed to get what he wanted before telling her this. She felt humiliated. Foolish. Naive. All these weeks she’d allowed the romantic daydream to grow, picturing the three of them as the perfect little family. No wonder he’d never kissed her. If she hadn’t been walking around immersed in her stupid fantasies, she might have caught on earlier.\u003c/p\u003e\n\u003cp\u003e“I apologize if you think I was leading you on.”\u003c/p\u003e\n\u003cp\u003e“Forget it,” she said, focusing some distance beyond him, refusing to meet his eyes. She held herself stiff and couldn’t wait to escape. This was what she got for risking her emotions. It wasn’t worth it; deep down she knew she’d never fall in love again.\u003c/p\u003e\n\u003cp\u003e“I feel it’s important that we remain friends for Ellen’s sake,” he was saying.\u003c/p\u003e\n\u003cp\u003e“We can certainly be cordial.” What seemed most important at the moment, however, was getting away from Tim. She needed to think, to absorb what he’d told her.\u003c/p\u003e\n\u003cp\u003eShe made a show of looking at her watch. “Do we have the check yet?”\u003c/p\u003e\n\u003cp\u003eIn response he raised his hand to catch the waiter’s attention.\u003c/p\u003e\n\u003cp\u003e“I’ll want to meet Vanessa,” Anne Marie said. No way was she letting her daughter go off with someone she’d never met. She didn’t care if Vanessa was “involved” with Tim. That wasn’t any kind of recommendation or guarantee.\u003c/p\u003e\n\u003cp\u003eHe blinked, his expression wary.\u003c/p\u003e\n\u003cp\u003e“If she’s going to be with you when you have Ellen…”\u003c/p\u003e\n\u003cp\u003eTim relaxed. “I suppose she will. Some of the time, anyway.”\u003c/p\u003e\n\u003cp\u003e“In that case, I need to meet her, don’t you agree?” She did her best to keep the irritation out of her voice.\u003c/p\u003e\n\u003cp\u003e“Yes, of course. That’s not a problem.”\u003c/p\u003e\n\u003cp\u003eAnother thought entered her mind, one that set off warning bells. “How did you and…Vanessa happen to meet?”\u003c/p\u003e\n\u003cp\u003e“I don’t think that really matters,” he said, bristling noticeably.\u003c/p\u003e\n\u003cp\u003e“She’s in AA, too?” Anne Marie guessed.\u003c/p\u003e\n\u003cp\u003eReluctantly Tim nodded.\u003c/p\u003e\n\u003cp\u003e“How much sobriety does she have?”\u003c/p\u003e\n\u003cp\u003e“She had three years.”\u003c/p\u003e\n\u003cp\u003e“Had?”\u003c/p\u003e\n\u003cp\u003e“With everything that’s been going on with you and me and Ellen, well…she slipped up.”\u003c/p\u003e\n\u003cp\u003e“Just a minute here,” Anne Marie said, her eyes narrowing.\u003c/p\u003e\n\u003cp\u003e“Not more than an hour ago, you told me you were accountable for your own sobriety. Didn’t I hear you say that?”\u003c/p\u003e\n\u003cp\u003e“Yes…”\u003c/p\u003e\n\u003cp\u003e“Are you now saying that you’re taking responsibility for Vanessa’ s sobriety, too?” she asked. The question appeared to shake him. “No.”\u003c/p\u003e\n\u003cp\u003eAnne Marie held his gaze. “Ellen can meet Vanessa, but I have to be there when she does. Otherwise the deal is off.”\u003c/p\u003e\n\u003cp\u003e“Fine,” he said curtly.\u003c/p\u003e\n\u003cp\u003e“Good. Then we understand each other.”\u003c/p\u003e\n\u003cp\u003eAll at once the room seemed unbearably stuffy. Oppressive. Anne Marie dropped her napkin on the table and stood. “I’ll wait for you outside.”\u003c/p\u003e\n\u003cp\u003eHe stood, too. “I’ll take care of the bill. I won’t be long.”\u003c/p\u003e\n\u003cp\u003eShe needed breathing room. As the night air cooled her fevered skin, Anne Marie resisted the urge to cover her face with both hands. In all her life she’d never felt more embarrassed. How stupid she’d been. What a romantic fool. And worse, Tim knew. He’d read the longing in her heart, saw it in her eyes. He knew. If she could’ve disappeared, simply vanished, she would gladly have done so. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-35.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
