{"id":66060,"no":39,"title":"Page 39","content":"\u003cp\u003eLydia shaded her eyes, peering down at them, then shook her head. “I don’t know.” After a moment she twisted around to speak to Phoebe again. “Anne Marie’s been dating this guy named Tim, but I don’t think that’s him.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Well, mainly because he’s holding hands with the other woman.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eShe craned her neck to get a better view. “The thing is, it sort of looks like him.”\u003c/p\u003e\n\u003cp\u003e“You’ve met him?”\u003c/p\u003e\n\u003cp\u003e“Once, when I dropped into the bookstore to pick something up and he was there.”\u003c/p\u003e\n\u003cp\u003eHutch returned, holding a cardboard container laden with two huge hot dogs slathered with condiments, including sauerkraut and mustard, plus two giant-size sodas and a bag of hot, roasted peanuts.\u003c/p\u003e\n\u003cp\u003e“I hope you’re hungry,” he warned, sitting down beside her.\u003c/p\u003e\n\u003cp\u003e“Starved.”\u003c/p\u003e\n\u003cp\u003e“Did you bring me any chocolate, Mr. Mount Rainier?”\u003c/p\u003e\n\u003cp\u003eMargaret asked, scooting past several other people in order to sit next to her sister. Elise trailed behind her, knitting in hand.\u003c/p\u003e\n\u003cp\u003e“Sorry, no.”\u003c/p\u003e\n\u003cp\u003e“Don’t apologize! I appreciate it.”\u003c/p\u003e\n\u003cp\u003ePhoebe nudged him in the ribs. Ever since the knitting group had heard that he was the head of Mount Rainier Chocolates, Hutch had gotten into the habit of bringing chocolate to class. The Mount Saint Helens bar had launched nationally and, according to Hutch, had been well received. The sales reports were just coming back and he was thrilled with its success so far.\u003c/p\u003e\n\u003cp\u003e“Look!” Cody shouted, leaping to his feet. “We’re on the big screen!”\u003c/p\u003e\n\u003cp\u003ePhoebe swiveled her head to the huge screen, and sure enough, the entire knitting section was on display. Cody, waving both arms, stood out prominently.\u003c/p\u003e\n\u003cp\u003ePhoebe laughed, and then everyone in the group held up their knitting. Unprepared, Hitch and Phoebe scrambled to f launt their sampler scarves. She nearly dumped her hot dog on Margaret’s head in the process, but saved it from catapulting forward in the nick of time.\u003c/p\u003e\n\u003cp\u003eKnitters sat on every side of them and the mood was jovial as they showed one another their current efforts. Several yarn stores had set up booths by the concession stands and Phoebe couldn’t resist looking—and buying.\u003c/p\u003e\n\u003cp\u003eUntil now, she’d resisted purchasing yarn for anything beyond her current project. She’d discovered that she enjoyed knitting; the problem was, she didn’t have enough free time now that she was seeing Hutch almost every day. She’d taken to knitting during her lunch break, which was the only reason she’d been able to keep up with the class.\u003c/p\u003e\n\u003cp\u003eNext Wednesday, the f irst Wednesday of August, would be their last class. She’d be f inished with her scarf, and she wanted to start something new. She chose sock yarn in the Mariners’ colors, thinking she’d take another class—this one on sockknitting taught by Elise—and give the finished product to Hutch.\u003c/p\u003e\n\u003cp\u003e“What did you buy?” Hutch asked when she rejoined him. She opened the bag and proudly revealed her booty. “I’m going to learn to knit socks.”\u003c/p\u003e\n\u003cp\u003e“Terrif ic.”\u003c/p\u003e\n\u003cp\u003e“Do you like the colors?” she asked.\u003c/p\u003e\n\u003cp\u003e“You bet.” He smiled down at her—and kept smiling. For that matter so did Phoebe. Although they were surrounded by thousands of cheering fans, they were gazing only at each other.\u003c/p\u003e\n\u003cp\u003e“I thought I’d knit them for you,” she whispered. He didn’t say anything, but reached for her hand and entwined their f ingers, his grip hard. She squeezed back, wanting him to know she shared the intensity of his feelings.\u003c/p\u003e\n\u003cp\u003e“Excuse me, guys,” Alix said, hurrying past.\u003c/p\u003e\n\u003cp\u003e“Oh, sorry,” Hutch said, standing up so Alix and Jordan could get by.\u003c/p\u003e\n\u003cp\u003e“Where are they off to in such a hurry?” Phoebe asked no one in particular.\u003c/p\u003e\n\u003cp\u003e“No idea,” Margaret answered, her f ingers moving the crochet hook with speed and dexterity. She seemed to be working on an afghan. Casey was crocheting, too, and Lydia was knitting. What most impressed Phoebe was that Lydia could knit without even looking at the needles. Phoebe, on the other hand, watched every single stitch for fear of making a mistake. The thought of having to rip out a row traumatized her, although she’d been forced to do so often enough.\u003c/p\u003e\n\u003cp\u003eA few minutes later, Alix was back, this time without Jordan.\u003c/p\u003e\n\u003cp\u003e“Sorry,” she mumbled as she stepped over Phoebe’s feet. “All of a sudden I had to get to a restroom.” She slipped past the couple sitting next to them.\u003c/p\u003e\n\u003cp\u003eJordan followed soon after, apologizing as he did. He carried one hot dog and a soda, and when he sat down beside Alix, Phoebe noticed that the two of them were sharing the meal. Living on a youth pastor’s salary probably made it diff icult to splurge on dinner out two nights in a single week. Phoebe knew from class yesterday that they’d squabbled, although she didn’t know about what. Apparently that had happened before she’d arrived. At the end of class, Jordan had stopped by to pick up Alix as usual. He’d stood by the door, looking depressed, not at all his normal outgoing self. As soon as Alix saw her husband, she’d set her knitting down and rushed to his side. For a long moment, all they did was stare at each other—and then Jordan had reached out and grabbed Alix with both arms, hugging her close.\u003c/p\u003e\n\u003cp\u003eLater that evening, just as she and Hutch had gone off in different directions, Phoebe caught sight of Alix and Jordan in a burger place, their heads together, eating and talking animatedly. Obviously whatever strain had existed between them yesterday afternoon had passed.\u003c/p\u003e\n\u003cp\u003eTonight’s game ended with the Mariners winning at the bottom of the ninth. The crowd was jubilant as they poured out of Safeco Field. Walking hand in hand, Phoebe and Hutch made their way to the parking lot, where Hutch had left his vehicle. For the f irst time that evening, he seemed somewhat withdrawn. She didn’t need to ask what was troubling him—the lawsuit against Mount Rainier Chocolates. He’d occasionally mentioned it, never disclosing very much. She’d also seen an article about the lawsuit in the paper, but it hadn’t provided any more information than she already had.\u003c/p\u003e\n\u003cp\u003e“How about a cup of coffee at my place?” she suggested. He smiled at her and nodded, making a visible effort to resume his cheerful attitude.\u003c/p\u003e\n\u003cp\u003eShe swallowed painfully. She was going to confess that she’d misled him—and everyone in the knitting class—about her f iancé. She should never have let the pretence go on for this long. But when she was with Hutch there were so many other things to talk about. Still, he’d recently commented on the fact that she didn’t have any pictures of her f iancé around the condo. For a moment his remark had jarred her, until she remembered that he thought Clark was dead.\u003c/p\u003e\n\u003cp\u003eShe trusted that he’d forgive her this foolish deception, which had taken on a life, a momentum, of its own. She also hoped that after tonight’s confession, he’d feel free to share his worries over this lawsuit. In her opinion, the entire matter was frivolous, a waste of time. But whenever she’d asked him about it, Hutch had brushed aside her questions and said his attorney was handling it. He always added that he wasn’t really worried. Only he was. That seemed very clear tonight.\u003c/p\u003e\n\u003cp\u003eOnce they were at her condo, she put away her yarn purchase, ground fresh beans and made a small pot of coffee, just enough for two cups.\u003c/p\u003e\n\u003cp\u003eShe joined Hutch in the living room and handed him his mug.\u003c/p\u003e\n\u003cp\u003e“There’s something I need to tell you,” she began softly. Hutch stiffened, almost as if he knew what was coming—\u003c/p\u003e\n\u003cp\u003ealthough he couldn’t possibly. “Okay,” he said. “Is it serious?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “I’ve been lying to you.”\u003c/p\u003e\n\u003cp\u003eHutch carefully set his mug on the low table beside him. “I’d rather deal with the truth now than later.”\u003c/p\u003e\n\u003cp\u003eShe took a sip of her coffee, then glanced down. “When I signed up for the knitting class, I told everyone I was engaged and that my f iancé died.”\u003c/p\u003e\n\u003cp\u003e“So he’s not dead?” Hutch frowned and anxiety f lared in his eyes. “Please don’t tell me you’re married.”\u003c/p\u003e\n\u003cp\u003eDespite her nervousness, she smiled. “No, he’s not dead and I’m not married. It’s nothing like that.”\u003c/p\u003e\n\u003cp\u003eHis shoulders slumped with relief.\u003c/p\u003e\n\u003cp\u003e“I was engaged and in love with a man who…” She paused, f inding it diff icult to continue. “I broke off the engagement two months ago, when I discovered he’d been arrested for solicitation.”\u003c/p\u003e\n\u003cp\u003eHutch pressed his hand over hers. He didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“It happened before this, too. I took him back the f irst time…”\u003c/p\u003e\n\u003cp\u003e“The f irst time you knew about,” he commented.\u003c/p\u003e\n\u003cp\u003e“Exactly. I have to suspect there were other instances.”\u003c/p\u003e\n\u003cp\u003e“Oh, Phoebe.”\u003c/p\u003e\n\u003cp\u003e“He managed to convince me it would never happen again, and I believed him.” She didn’t mention the pressure she was under from both Clark’s family and her own to forgive and forget.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003eShe licked her lips, which felt dry and cracked. “I did what I had to do, ended the engagement, and although it was painful I don’t regret it, not for a second.” Telling Hutch about Clark’s most recent attempt to get her to take him back would only upset him. Phoebe decided to say nothing.\u003c/p\u003e\n\u003cp\u003e“So when you enrolled in the Knit to Quit class, it was because you were trying to stop loving your f iancé?”\u003c/p\u003e\n\u003cp\u003eLowering her head, Phoebe nodded.\u003c/p\u003e\n\u003cp\u003e“Has it helped?”\u003c/p\u003e\n\u003cp\u003eShe looked up at him and grinned. “More than you’ll ever know. I was crushed, devastated, humiliated, angry. I realize now that while I did love Clark, his actions killed all the feelings I had for him.”\u003c/p\u003e\n\u003cp\u003eHutch brought her close and touched his forehead to hers.\u003c/p\u003e\n\u003cp\u003e“Thank you for telling me.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t lie to you any longer.”\u003c/p\u003e\n\u003cp\u003eHe kissed the tip of her nose, lightly, tenderly, in a way she’d come to adore. His gentleness stirred her more than a dozen passionate caresses. Slipping her arms around his neck, she raised her mouth to his and they kissed for a long time, each kiss connecting them on a deeper level. She leaned against his shoulder, her head spinning with desire. Hutch’s breathing was ragged. They sat like that, satiated and at peace, for a while.\u003c/p\u003e\n\u003cp\u003e“Tell me about the lawsuit,” she f inally said. Hutch exhaled. “There isn’t much to tell.”\u003c/p\u003e\n\u003cp\u003e“You’re worried, though.”\u003c/p\u003e\n\u003cp\u003e“I am. My attorney’s agreed to f ight it but he’d prefer that I settled out of court. I refuse to do that. It would be like an admission of guilt. However, my attorney feels I’m taking a terrible risk letting this case go to trial.” Hutch was silent for a moment. “The suit’s raised a lot of interest nationwide. If I lose, it opens the door for other people to sue the larger companies, claiming chocolate is addictive. And what about alcoholics suing wineries? Or prescription-drug abusers blaming the pharmaceuticals? You see what I mean. There’s a lot more at stake than meets the eye.”\u003c/p\u003e\n\u003cp\u003e“Is it worth all this angst?” she asked, siding with his attorney. In this particular instance it might be best to simply pay off this idiotic woman and be done with it. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-39.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
