{"id":66063,"no":42,"title":"Page 42","content":"\u003cp\u003e“Paula Deen’s baking cookies this morning,” Mom told Casey, who appeared interested in what was happening. That didn’t surprise me, considering the cookies and cakes she’d baked herself.\u003c/p\u003e\n\u003cp\u003eI headed into the bedroom to gather up Mom’s laundry, which I washed for her every week. The washer and dryer were down the hall and shared by the residents on the second f loor.\u003c/p\u003e\n\u003cp\u003e“Lydia was a terrible cook as a child,” I heard my mother say.\u003c/p\u003e\n\u003cp\u003e“I couldn’t trust her in the kitchen.”\u003c/p\u003e\n\u003cp\u003e“Really?” Casey met my gaze, giggling delightedly. I’d heard the story of how, at age eleven, I’d burned peanut butter cookies to a crisp countless times.\u003c/p\u003e\n\u003cp\u003e“I’ll get the clothes into the washer and be right back,” I said. Sometimes Mom had trouble remembering my name, but she recalled in vivid detail a long-ago incident from my youth. Maybe because it had been repeated so often over the years. Judging by Casey’s rapt attention, I doubted either of them heard me leave. After I’d loaded the washer I returned to f ind both Mom and Casey laughing, whether at something on the TV\u003c/p\u003e\n\u003cp\u003eor a shared joke I didn’t know.\u003c/p\u003e\n\u003cp\u003eSince Casey was keeping my mother entertained, I went back into the tiny bedroom to make her bed. Mom would be so embarrassed to realize she’d left it unmade. When I was a kid, my mother had been a real stickler about tucking in the sheets and smoothing out the blankets each and every morning. Having a properly made bed was right up there with brushing my teeth and saying my prayers, and it was a habit I’d never abandoned.\u003c/p\u003e\n\u003cp\u003eAs I worked, I noticed that the laughter between Mom and Casey continued. It was so unusual to hear my mother laugh that I poked my head out the door to see what was so amusing. The TV was actually off, and Casey sat on the f loor at my mother’s feet, doubled over with glee. When she caught sight of me, she pointed in my direction. “You read Margaret’s diary?”\u003c/p\u003e\n\u003cp\u003e“Mom, are you telling tales on me?” I asked in mock outrage. Mom nodded. “Your sister was so upset, she marched into the backyard and burned her diary. Your father said we were fortunate no one called the f ire department.”\u003c/p\u003e\n\u003cp\u003eCasey found that equally hilarious and laughed even harder. Mom did, too. Happy tears rolled down her weathered cheeks until she reached for the handkerchief she kept inside her sweater pocket and dabbed at her eyes.\u003c/p\u003e\n\u003cp\u003eIt was true. At seventeen, I’d snuck into my sister’s bedroom, searched for her diary and read page after page. As luck would have it, my sister had discovered me there, sitting on her bed, completely enthralled with what she’d written. To say she was furious would be an understatement. Margaret had ripped the book from my hands and stormed out of the house, demanding that my parents “do something.”\u003c/p\u003e\n\u003cp\u003eWhat Margaret didn’t understand—or for that matter, my parents, either—was that I was starved for a normal life. In my view Margaret was a normal teenager and I wasn’t because I had cancer. I craved my sister’s life and the only way I could get a glimpse of normal was by reading her journal.\u003c/p\u003e\n\u003cp\u003e“She’s forgiven me now,” I said, then added, “I think.”\u003c/p\u003e\n\u003cp\u003eCasey looked at me archly. “I wouldn’t have.”\u003c/p\u003e\n\u003cp\u003e“Thanks a lot, kid.”\u003c/p\u003e\n\u003cp\u003e“Do you keep a diary?” Mom asked Casey.\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“Good thing.” I said, hands on my hips. “I’d probably read yours, too.”\u003c/p\u003e\n\u003cp\u003eCasey grinned and turned back to my mother, wanting to hear more tales of my sinful past.\u003c/p\u003e\n\u003cp\u003eWe stayed until it was time for Mom to go to the dining room for lunch. She sat at the same table every day with three other widows. They all seemed to get along well and I was grateful she had at least this social interaction, since she rarely participated in events or day trips planned by the staff.\u003c/p\u003e\n\u003cp\u003eCasey escorted her to the dining room while I f inished folding and putting away her clean laundry. Then I hurried downstairs, meeting the two of them as Casey helped Mom into her chair.\u003c/p\u003e\n\u003cp\u003e“Bring Hailey again,” Mom said, smiling up at me. Casey didn’t seem upset that my mother thought she was my niece. “I’ll do that.” I gently hugged her goodbye. This was probably the best visit I’d had with her since the move. She was almost her old self again, and I had Casey to thank for that. The girl had been enthralled with my mother, even when Mom repeated the same stories over and over.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you came with me,” I said as we walked toward the visitor parking lot.\u003c/p\u003e\n\u003cp\u003e“Your mom’s funny.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“I don’t have grandparents,” she said a little sadly. “I mean, I never had one I actually remember.”\u003c/p\u003e\n\u003cp\u003eI wasn’t sure how to comment.\u003c/p\u003e\n\u003cp\u003eWe were driving back to the house when Casey suddenly turned to me. “What was it like to have cancer?” she asked. The question caught me unawares. My mother must have brought up the subject, although I couldn’t guess how much or how little she’d said—or remembered.\u003c/p\u003e\n\u003cp\u003e“It wasn’t a lot of fun, that’s for sure.” I thought it was preferable to keep the details to myself. I recalled how disturbed Mom and Margaret had been when I lost my hair during chemo. Good grief, that was the least of it! The drugs, the vomiting, the horrendous headaches that incapacitated me. Going bald was nothing.\u003c/p\u003e\n\u003cp\u003eNearly a year of my life had been spent in the hospital. I’d be home for short periods of time, and then something else would happen that would force me to return. I didn’t like to think about those years.\u003c/p\u003e\n\u003cp\u003e“How old were you?”\u003c/p\u003e\n\u003cp\u003e“Sixteen. I’d just gotten my driver’s license.” I kept my answers short and considered trying to change the subject. I didn’t, because Casey obviously wanted to understand.\u003c/p\u003e\n\u003cp\u003e“What was the worst part, other than feeling sick all the time?”\u003c/p\u003e\n\u003cp\u003e“The worst part?” I echoed. “I think it was missing out on all the fun in high school.” It was so much more than being unable to attend football games or dances. All my friends were dating and exploring their independence. Not me. Instead I’d been in the hospital for months on end, hooked up to IVs, in such physical and emotional pain that I didn’t have the strength to open my eyes. I’d desperately longed to be like everyone else. I was so sick of being sick.\u003c/p\u003e\n\u003cp\u003e“Did you ever go to a dance?”\u003c/p\u003e\n\u003cp\u003eI nodded. I’d gone with my girlfriends.\u003c/p\u003e\n\u003cp\u003e“Did you have a special dress?”\u003c/p\u003e\n\u003cp\u003eUnexpectedly a lump f illed my throat. “Mom made me one, and it was beautiful.”\u003c/p\u003e\n\u003cp\u003e“A date?”\u003c/p\u003e\n\u003cp\u003eI shook my head and managed a laugh. “The boys in my class tended to date girls who weren’t bald.” I’d generally worn a kerchief, since the wigs I had were so hot and uncomfortable.\u003c/p\u003e\n\u003cp\u003e“You lost your hair?” Casey asked in horror.\u003c/p\u003e\n\u003cp\u003e“Margaret has pictures. I think she took them as revenge for reading her diary.”\u003c/p\u003e\n\u003cp\u003eCasey smiled, but then her expression grew serious again. “It was hard having cancer, wasn’t it?”\u003c/p\u003e\n\u003cp\u003eI could make light of those years but decided on honesty instead. “Yes.”\u003c/p\u003e\n\u003cp\u003eShe was quiet for several minutes. “The cancer came back, didn’t it?” she f inally asked. “That’s what Cody told me before.”\u003c/p\u003e\n\u003cp\u003e“When I was in my early twenties. The fact is, it might still return. Life doesn’t come with a guarantee that just because I’m a nice person the tumors won’t grow again.”\u003c/p\u003e\n\u003cp\u003eWe pulled into the driveway and I turned off the engine. I climbed out of the car and waited, watching as Casey continued to sit there, apparently steeped in thought. A moment later, she joined me.\u003c/p\u003e\n\u003cp\u003e“You’re a brave person,” she said quietly.\u003c/p\u003e\n\u003cp\u003eI laughed because I certainly didn’t think of myself in those terms. Looping my arm around her neck, I brought her head close to mine and kissed her hair. “Oh, yes. That’s me, all right.”\u003c/p\u003e\n\u003cp\u003e“You had cancer twice and you…you still let me live with you this summer.”\u003c/p\u003e\n\u003cp\u003eThat part, at least for this day, was pure joy.\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003e“Hutch” Hutchinson\u003c/p\u003e\n\u003cp\u003eHutch was in love. Everyone around him recognized the signs and didn’t have any qualms about pointing it out. Not that he was trying to hide it.\u003c/p\u003e\n\u003cp\u003eA little while ago—before Phoebe—his sister had attempted to set him up with a girlfriend of hers…Mia, Myra, something like that. He’d forgotten her name just as he was sure she’d forgotten his. Meeting Phoebe had changed everything. The f irst time he’d seen her he’d felt the attraction. She was beautiful, and he wasn’t reacting merely to her appearance. Phoebe was everything he’d ever hoped to f ind in a woman—and she loved him. He could hardly believe it.\u003c/p\u003e\n\u003cp\u003eHutch was, however, somewhat disappointed that it’d taken Phoebe so long to admit that her f iancé wasn’t dead. But although it troubled him, he could understand why she’d lied. In similar circumstances, he might have done the same thing in order to avoid embarrassment and lengthy explanations. It’d been simpler this way, and as she’d said to him, the minute her f iancé agreed to pay for sex with another woman he was dead to her. Hutch wondered about this other man who’d once been a very important part of Phoebe’s life. In the two months they’d been seeing each other Phoebe had never spoken of her engagement or offered up anything but the sketchiest details. All Hutch knew was that the man Phoebe had planned to marry had lied and cheated on her. When the truth came out—the second time—\u003c/p\u003e\n\u003cp\u003eshe’d severed the relationship for good. He realized how deeply hurt she’d been by what her ex-f iancé had done.\u003c/p\u003e\n\u003cp\u003e“I have your attorney on line one,” Gail Wendell said, breaking into his thoughts.\u003c/p\u003e\n\u003cp\u003eNow that the trial date was approaching, he heard from John Custer nearly every day.\u003c/p\u003e\n\u003cp\u003e“Hutch speaking,” he said, picking up the phone. The conversation with John lasted only a few minutes. As soon as he’d f inished, he tried to put the matter out of his mind. It was on days like this that he wanted, no, needed, to talk to Phoebe. As soon as he heard her voice, his blood pressure seemed to decrease. Checking his watch, he reached for his phone again. Quarter to eleven. Phoebe was between clients. They spoke two and three times a day now, and even that wasn’t enough.\u003c/p\u003e\n\u003cp\u003e“Hi,” he said when she answered her cell.\u003c/p\u003e\n\u003cp\u003e“Hi, yourself,” she said. “Did you talk to your attorney?”\u003c/p\u003e\n\u003cp\u003e“I did.” Hutch closed his eyes. He loved hearing the sound of her voice. It f lowed over him, easing his burdens, comforting him.\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003eReality returned and his eyes f lickered open. “We’re scheduled to go to court next week. There doesn’t seem to be any way around that.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003eNo sorrier than Hutch. “I was hoping, foolishly perhaps, that the other attorney would see reason. But from what I hear, Clark Snowden’s conf ident he can win—and in the process make a name for himself.”\u003c/p\u003e\n\u003cp\u003e“Snowden?” she repeated.\u003c/p\u003e\n\u003cp\u003e“Yes, that’s the plaintiff ’s attorney.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eHutch looked down at a f ile on his desk that required his attention. One gratifying consequence of meeting Phoebe was that he’d learned to delegate. This evidence that he trusted his subordinates had improved his relationship with his department heads, as well. “What about dinner tonight?” he asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-42.html","bookId":1938,"creation":"Oct 5, 2019 9:59:45 AM","modification":"Oct 5, 2019 9:59:45 AM"}
