{"id":34827,"no":3,"title":"THE IMPOSTOR I THE GOVERNOR\u0027S NIECE","content":"\u0026nbsp; \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Martha Stirling came slowly down the steps into the garden, pausing for a moment, on each step, lest the Governor hear her; then she sped quickly across the lawn, and, bending over, kissed him on the cheek.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, your Excellency!\" she laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Colonel Sharpe looked up, with a start.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bless me, girl! have some regard for your uncle\u0027s dignity,\" he said, drawing her down on the arm of the chair. \"It seems to me, young lady, that you are a trifle clever in the kissing art, to never have been kissed yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For shame, sir! You, a royal Governor—no, I mean a Lord Baltimore\u0027s Governor—to intimate so scandalous a thing. It may be, sir, that, as to you, I could truthfully not intimate.... Tell me, who is the young man that came with Mr. Dulany.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ho, ho! That is the reason for the kiss: to make me amenable. Why did you not say, \u0027the handsome young man\u0027?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The handsome young man, then; indeed, the very handsome young man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 14]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a stranger in Annapolis.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What my eyes saw—graceful, easy, handsome, a man of the world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you women! Graceful, easy, handsome, a man of the world! You judge by externals.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And pray, sir, what else had I to judge by?\" springing up; \"I but saw him—you spoke with him. How far am I amiss?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Governor smiled. \"Not by the fraction of a hair, so far as I can make it,\" he said. \"He is Sir Edward Parkington, come from London for his pleasure. He brought with him letters of introduction to Mr. Dulany and myself. He seems to have been in a rather hard case, too. He took passage from The Capes to Annapolis in The Sally, a bark of small tonnage and worse sail. They ran into a storm; the bark foundered, and all on board were lost, except Parkington; or, at least, he saw none when, more dead than alive, he was cast ashore near Saint Mary\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The poor fellow! Did he lose everything?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Everything but the letters, which were in his pocket—and his charm of manner and good looks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At least, we shall appreciate the latter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Governor looked at her rather quizzically. \"Yes, I reckon you will,\" he said. \"At least, if you do not, it will be the first time.\" His eyes[Pg 15] fell on one, in the red and blue of the Royal Americans, who just emerged from the house, and was hesitating on the piazza, as though uncertain whether to descend. \"It seems to me there is something familiar in that personage. Do you know him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Martha turned and looked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" she said, \"I do not want to see him. Why does he pester me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nevertheless, my dear, he is there; and I see he is coming here. So take him off and make game of him, playing him this way and that; a bit of encouragement, a vast disdain; and, then, send him off again a little more securely hooked than ever.... Good morning, Captain Herford, were you looking for us, or, rather, were you looking for one of us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles Herford bowed, elaborately, his hand upon his sword-hilt, his hat across his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If your Excellency please, I was,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Which one: Mistress Martha Stirling or Horatio Sharpe?\" asked the Governor, arising.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mistress Stirling, so please you,\" said Herford, with another bow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, I bid you good morning!\" the Colonel laughed, and returned to the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, sir,\" said Miss Stirling, after a moment\u0027s silence, \"what can I do for you—or, rather, what can I do with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Treat me just faintly nice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 16]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh,\" she said, looking at him through half-closed eyes, \"is that it; humble, this morning!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, humble, grovelling, anything to win your favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She turned, and they passed slowly among the flowers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is humbleness the way to win a woman\u0027s favor?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not know. It seems to me the proper way—or, if not proper, the more expedient way. Perchance, you will tell me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A faint smile crossed her lips. \"I?\" she said. \"I can tell you nothing. My favor is not for your winning, Mr. Herford, nor for any one\u0027s else in the Colony.\" She stopped, and plucked a rose. \"Come, come, sir, be sensible! Why cannot you be alone with me without thinking of favor or love? Enjoy the morning, and the flowers, and these beautiful gardens, sweeping away to the Severn, and the golden Severn itself, or the silver Severn, whichever way you will have it; I am not particular.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean,\" he said, with a laugh, \"that I should go down and throw myself off the dock?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, nothing quite so bad as that; you know what I mean. Now, come along, and not another word on the forbidden subject. Here!\" and gave him the rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A thousand thanks!\" he said, and kissed her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 17]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sir Edward Parkington is a very handsome man,\" she observed, presently; \"don\u0027t you think so?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am willing to accept your judgment on him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what is your own judgment?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have not any. I do not know Sir Edward Parkington.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And have not seen him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor ever heard of him,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it possible that you blades of the Coffee-house must come to a woman to learn the last gossip—and him a Sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would seem so,\" he answered. \"Who is this Sir Edward Parkington, and from where?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From London—come to Annapolis with letters to his Excellency and to Mr. Dulany. A very elegant gentleman, indeed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To have gained your favor, he must have been all that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" she said, \"I just saw him for a moment, but it was quite sufficient.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder,\" he said, watching her narrowly, \"I wonder if he has a wife?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She laughed, gaily. \"Meaning that, if he had not, I might be his lady?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Herford bowed. \"Since it may not be in the Colony, best back to London for the Colony\u0027s own good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you not a bit premature? Sir Edward may[Pg 18] be married, and, even if he is not, I may not suit him for a wife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was assuming him to be a man of taste; of \u0027the high kick of fashion\u0027 in all things.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And so he is. I saw him only cross the lawn, to where Colonel Sharpe was standing, but such ease and grace I never have seen exceeded—even your Mr. Dulany appeared awkward, by comparison.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sometime, I hope to meet him and acquire a bit of polish,\" he said, with a laugh in which good nature was just touched with scorn. \"Meanwhile, it were just as well to be a good soldier and retire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not going, Captain Herford.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, going; you are in a teasing mood, this morning. You go to the races to-morrow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly shall.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I may ride beside the coach?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you wish,\" she said; \"with Mr. Paca, and Mr. Hammond and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And a score of others, of course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed over her hand a moment, then strolled away, singing softly the chorus of the old troop song:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then over the rocks and over the steep,\n\u003c/div\u003e \n\u003cdiv\u003e\n Over the waters, wide and deep,\n\u003c/div\u003e \n\u003cdiv\u003e\n We\u0027ll drive the French without delay,\n\u003c/div\u003e \n\u003cdiv\u003e\n Over the lakes and far away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Martha Stirling listened until the singing ceased, then she shrugged her shoulders, and went slowly back to the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 19]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A month before she had come out from England to visit her uncle—Colonel Horatio Sharpe, Governor of Maryland—and instantly became the toast of all the young men of the Colony. There was nothing surprising, possibly, in that; Governor Sharpe\u0027s niece would have been popular if she had been without any particular attraction, but Miss Stirling had attractions in abundance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Under a great mass of jet black hair, piled high on her head, was a face of charming beauty, with blue eyes that warmed and sparkled—though on occasion they could glint cold enough—a perfect nose, and a mouth made for laughter alone. In figure, she was just above the average, slender and lithe. This morning, her gown was of pink linen, and, as she passed up the steps into the mansion, one could see a finely turned silk ankle, with white slippers to match.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Crossing the wide entrance hall, she knocked on a door, waited a moment, and, receiving no reply, knocked again, then entered. It was the Governor\u0027s room, but he was not in presence. As she turned away, old Joshua, the white-haired negro who was his Excellency\u0027s body-servant, appeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is Colonel Sharpe?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gone to the State House, Mis\u0027 Marfa.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She nodded in dismissal and went in, leaving the door open behind her. Seating herself at the great, broad table, her glance fell on a letter, opened and spread wide. Not thinking what she did, she read:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 20]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n London, 10th March, 1766.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My Dear Sir:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This letter will Introduce to you Sir Edward Parkington for Whom I bespeak your most courteous Attention and Regard. Extend him all the Hospitality in your power. I am, Sir,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Your humble and ob\u0027d\u0027t servant,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Baltimore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; His Excellency, Col. Horatio Sharpe,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;Governor of Maryland.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So!\" she said, \"Baltimore himself sponsors Sir Edward Parkington; which may mean much for his responsibilities but little for his morals.... Well, he will serve to irritate Captain Herford; but can I use him to draw Richard Maynadier one little step along?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For a space she sat there, her forehead wrinkled in a frown. She did not hear the voices at the front door, nor the footsteps that crossed the hall, until they entered the room; then she glanced up, and a smile of welcome shone from her eyes, as the man, who was in her thoughts, stood before her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Maynadier!\" she said, extending her hand across the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed over it with easy grace. \"His Excellency leaves a fair deputy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what can that deputy do for you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Much,\" he said. \"Much that I dare not even[Pg 21] hope. So I\u0027ll ask for only that package on the table, there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take it,\" she said—\"take anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anything on the table, that is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The smile rippled into a laugh. \"Take anything in the room,\" she said; \"there is none of them mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew a chair up to the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I,\" he said, \"sit here a moment, while the Council waits?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you wish,\" she answered; \"you will have to answer to the Council.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He leaned back, and looked at her silently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Stirling,\" he said, presently, \"you are a flirt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that to you, sir?\" she demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He ignored the question. \"You have half the young men of Annapolis ready to pink one another, and praying but for an excuse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Again, sir, what is that to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have Mr. Hammond, and Mr. Paca, and Mr. Jennings, and Mr. Constable, and Captain Herford mad about you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She gave him her sweetest smile. \"You have forgotten Mr. Richard Maynadier,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Maynadier is not in the running. He is content to look on——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With an occasional word of advice,\" she cut in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With an occasional word of advice,\" he agreed. \"Meanwhile, content to stand afar off and view the struggle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 22]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She put both elbows on the table and leaned across.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why view it from afar,\" she said, sweetly; \"why not join in the struggle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For several reasons,\" he said. \"First, I am too old.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should never have guessed it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Second, I have not the graces that are requisite.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had not noticed it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And, lastly, I have not the inclination.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That, I should never have guessed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I suppose not. We all are game for a pretty woman. Let a man but bow and kiss her hand, and, behold! another suitor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She sat up sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Maynadier, I will make a compact with you,\" she said. \"You say you are too old, have not the graces, and have not the inclination—so be it. A flirt may have her friends. We will be comrades—I to use no art of coquetry upon you, you to speak no word of love to me. Is it a bargain?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He regarded her with an amused smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you wish it,\" he said. \"I think we both of us are safe enough without it—though, who knows. At any rate, the flag of truce will hold us.... Now, I will back to the Council. I will see you at the races, to-morrow, of course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 23]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; and I have a pistole or two which you may put on Figaro for me,\" she said, accompanying him to the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She stood and watched him, as he went down the walk toward North-East Street, and disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder,\" she said, \"I wonder.... Well, Mr. Richard Maynadier, we shall see if you cannot be taught to have the inclination.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3329/91146.html","bookId":379,"creation":"Aug 5, 2019 5:56:58 AM","modification":"Aug 5, 2019 5:56:58 AM"}
