{"id":34829,"no":5,"title":"III THE RACES","content":"\u0026nbsp;Miss Stirling fastened the cross-shaped watch to the left side of her gown, pressed into place a patch near her eye and another near her dimple, and, with a last look in the glass, arose. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her gown was of blue lustring, long-waisted and laced over a stomacher, exquisitely guimped and pinked. A sacque, of the same material, hung from her shoulders to the ground and formed a train, and on her head was a large chip hat, with feathers and pinks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She crossed to the window and drew aside the curtain. The coach was waiting, and beside it were Mr. Paca and Mr. Worthington and Captain Herford. She went back to the glass, took another survey, dabbed a bit of powder, here and there, on her face, smiled at her reflection, and turned away. It was race day, in Annapolis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Governor was ascending the stairs, as she came out of her room; when he reached the landing, he stopped and looked at her. She made him a bit of a curtsy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will I do?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, you will do,\" he said; \"even I can see that. I am sorry for the macaronies down in front.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 34]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They do not deserve any sympathy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose not,\" he said; \"at least, they do not get much from you. You may take the coach; I shall ride to the course—and do not wait for me. They are sufficient to escort you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She gave him a bright smile, and went down and out to the coach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good afternoon!\" she said, as they sprang forward to meet her.—\"No; we will dispense with anything but a bow.\" They all tried to hand her in, but she waved them aside. \"I cannot choose, so I will let the footman do his office.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young men leaped to horse. There were but two windows to the coach and three men, and Mr. Paca and Mr. Worthington got the places beside them, leaving Captain Herford to ride behind, and sulk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a dream, a perfect vision!\" said Mr. Paca.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An angel, rather!\" Mr. Worthington assured her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not be sensible, and tell the truth. Why not say, I am looking very well, to-day; that would be the truth, more than that is rank exaggeration. One of you let Captain Herford come up; I want to hear what he will say.... Do you hear? I said, one of you give place to Captain Herford.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Paca, you hear?\" said Worthington.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Worthington, you hear?\" said Paca.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 35]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Stirling laughed. \"Meanwhile, Captain Herford rides behind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And is likely to ride behind to the race ground,\" said Worthington.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And should ride behind forever, if we controlled it,\" added Mr. Paca.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They proceeded out of the Governor\u0027s grounds, and along King George Street, to the Ogle corner at Tabernacle Street. Here, the coach was before the door, and Mrs. Ogle and Miss Elizabeth were just about to enter. Miss Stirling waved her hand, and called a greeting, while the young men doffed their hats. The Ogles answered, and then their equipage joined the procession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived at the Course, and occupying the place reserved for the Governor, Miss Stirling was astonished at what she saw. Here was no ordinary gathering, of Annapolitans and their neighbors. Instead, a vast concourse of people, with more than fifteen hundred horses hitched around the track, and not less than one hundred coaches parked within the enclosure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why,\" she said, \"I had no notion it was anything such as this. I thought it would be like the small affairs in England. This rivals Carlisle, itself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Annapolis races are the best in this country,\" said Mr. Worthington. \"We have not only all the families of Maryland represented here, but scores of the gentlemen of Virginia, with not a few[Pg 36] from Pennsylvania. The races last almost a week. Courts are adjourned, schools dismissed—everybody takes a holiday; and the Assembly, which happens to be in session, has risen until they are over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are the entries for the first race?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Paca consulted his card. \"Dr. Hammond\u0027s Figaro, Mr. Hall\u0027s Trial, Mr. Yeldell\u0027s Chester, Mr. Gnatt\u0027s Britannia, Mr. Heath\u0027s Merry Andrew and Major Sims\u0027 Terror.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what are the weights?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rising four years, fourteen hands, eight stone; five years, nine stone; six years, ten stone, and aged, eleven stone; to give and take, at the rate of seven pounds, for every one under or above fourteen hands.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is fourteen hands the average size?\" she asked. \"Rather small, it seems to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They make it up in speed, however,\" said Mr. Worthington; \"and Figaro is fifteen hands. He has run at Carlisle and at Preston, in your country, and won everything. In fact, he has never been beaten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A roar from the crowd announced the appearance of the horses. \"What is the black?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the chestnut?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Chester.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the sorrel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Merry Andrew.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 37]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the bay?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Figaro.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She took six pistoles, from her reticule.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Captain Herford, will you do me the favor to place this on Figaro?—What are the odds?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three to one, last night, at the Coffee-house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very good,\" she said. \"A horse that won at Carlisle and Preston ought not to have much trouble, here. What is the distance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Four times around the track, about three miles,\" said Mr. Paca; \"the best two in three.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jonas Green had taken his place in the judge\u0027s stand, and the horses were forming for the break. The next moment, they thundered down the track, got the word, and were away. A blanket could have covered them, as they swept around the course for the first two times. Then, Terror slowly lagged; and, presently, Merry Andrew and Britannia had followed suit. The other three were running neck to neck. At the turn into the stretch, Chester drew away, and won by length from Figaro, with Trial third.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly there was a turmoil. Chester was a good horse, and the weights were in his favor, but no one had supposed him capable of besting Figaro.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Had I waited, I would have gotten longer odds,\" said Miss Stirling. \"Mr. Paca, see if you can put these five pistoles to better advantage—on Figaro, mind you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think Figaro will win,\" said Mr. [Pg 38]Worthington. \"He has the bottom, and his age will favor him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Paca returned to announce that he had placed the money at two to one, and received, in exchange, a most dazzling smile; whereat Herford swore under his breath. Then there descended upon them all the young women, from the near-by coaches, and the young gentlemen who attended, to make their devoirs to the Governor\u0027s niece.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And, presently, came Colonel Sharpe himself, and with him Sir Edward Parkington. Pinkney had not failed the latter. His coat was of dark blue silk with embroidered cuffs, the breeches and stockings to match; his waistcoat, of white broadcloth, covered with gold lace. His hair was dressed and powdered, and tied in a bagwig behind. A solitaire was round his neck; a kevernois hat, decorated with gold buttons, lace and loop, was under his arm; and a long black rapier lifted the skirt of his coat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear,\" said Colonel Sharpe, \"I want to present Sir Edward Parkington, whom you have heard me mention, and for whom I bespeak your best consideration.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Stirling gave him her hand; Parkington bowed over it with inimitable grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sir Edward is very lucky in his sponsor,\" she said; \"his Excellency\u0027s wishes are our law. Mr. Paca, will you present Sir Edward to our friends.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He met them all, then came back to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 39]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I saw you in the Row, one day last Autumn,\" he said. \"You were riding with Captain Symington, of the Blues; I was riding with my Lord Baltimore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She shook her head. \"I have not the honor of Captain Symington\u0027s acquaintance; it was not I.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be I am mistaken as to Symington, but I cannot be mistaken as to you; once seen is never to be forgotten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you sure it was last Autumn?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perfectly, oh, perfectly!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, you must guess again,\" she said. \"I have not ridden in the Row for a year. I spent all of last Autumn in the North.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I saw you somewhere, sometime,\" he insisted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What matters it?\" she asked; \"since you see me now.—There, the second heat is starting!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This time there were but three—Britannia, Merry Andrew and Terror had been distanced—and, again, the three ran close together until they reached the stretch, for the last time. Then Trial came away, and, under a tremendous drive, won by length from Figaro, with Chester third.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The favorite seems outclassed,\" said Parkington. \"The weight is just a trifle too much, I fancy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You do not know Figaro,\" said Mr. Paca. \"I will wager you five pistoles, that he gets the next heat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 40]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Taken. The weight will tell more upon him the next time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Again, you do not know Figaro!\" laughed Paca. \"It will tell less—or, rather, it will tell on the others more. Figaro has lost two heats, before, but he never lost the third.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Paca says that Figaro has raced in England, at Carlisle and Preston three years ago, and won everything,\" said Miss Stirling. \"Did you know it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Great Heavens!\" exclaimed Parkington. \"This is not that Figaro?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The same,\" said Mr. Paca.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would never have wagered against him, had I known it. However, there is always a chance of the horse falling dead in the stretch, or of something else happening; and past records never win the next race.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will lay you another five pistoles, if you wish,\" offered Mr. Worthington.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I!—And I!\" came from around him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Such unanimity of opinion breeds caution,\" said Parkington, with a laugh; \"and I will profit by it. No more, gentlemen, no more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Captain Herford,\" said Miss Stirling, \"I will have another little bet on Figaro. Will you place these two pistoles for me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At what odds?\" said Herford.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whatever you can get; they ought to be about even, now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 41]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You too, then, believe in Figaro?\" asked Parkington.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do,\" she said; \"six pistoles at three to one, five pistoles at two to one, and two pistoles at even odds—it will keep me in spending money for a few weeks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Or make you without spending money for a month.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall not lose,\" she said; \"I shall not lose.... Ah, Mr. Maynadier, do you know Sir Edward Parkington?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maynadier turned, and, for a moment his eyes rested on Sir Edward with an uncertain and hesitating recognition. Then, he shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not know,\" he said. \"There is something familiar in his face, yet I can not say. I met so many people in London, at one time, that it is difficult to remember. I trust Sir Edward Parkington will understand. But whether or not we have ever met before, I am very glad to meet him now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you are right,\" said Sir Edward, taking Maynadier\u0027s hand; \"or, at least, if we met, I have no recollection of it. Indeed, I have no recollection of having met any one from Annapolis—much, as I see now, to my loss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The horses are at the post!\" exclaimed Miss Stirling, and each was glad for a moment of respite.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This time, Figaro showed his blood. They ran easily enough, and together, but any one could see[Pg 42] that the others had shot their bolts. In the last hundred yards, the red and white of Dr. Hammond went to the front and won handily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is Figaro\u0027s race,\" said Mr. Paca.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he wins the next heat,\" observed Sir Edward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The others are out of it,\" said Paca. \"I am sorry, Sir Edward, but they are, and Figaro will get better; we have seen it happen before, in other races.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Mr. Paca was right. Figaro won the next heat even easier than the last, and Dr. Hammond led him off, while the men cheered, and the ladies waved their handkerchiefs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you ride back with us?\" Miss Stirling asked, as Maynadier made his adieu.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And have myself put down as rival to these young men,\" he said, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you care, since you are not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True enough, but the public would not believe it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The public believes what suits it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so, but it does not suit me that the public should have any cause to believe me smitten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You care for the public?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes and no. No, where there is truth behind it; yes, when it is foundationless.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are frank,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Such was our compact.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And is it, then, so great a disgrace to have it said you rode beside my carriage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 43]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If they would stop with that, no; but they will not. I will ride beside your carriage any time, when you are alone; I will not jostle for a place with any one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you will never ride, I fear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it; I shall never ride.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked at him with an artless smile, that was the refinement of coquetry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall see you at the dance, to-night?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have saved the third for you. You do not deserve it, but I saved it, none the less.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed low. \"Only the third?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only the third,\" she said, as the coach rolled away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what have you saved for me?\" said Parkington, who overheard the last words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whatever you like,\" she answered, \"except the third.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I take as many as I may; I want them all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are modest,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are the first that ever told me so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And am likely to be the last,\" she retorted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You said that you would give no dances before the ball,\" Captain Herford interposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did,\" she admitted; \"but, then, I did not know of our guest from England. The dance I have given Mr. Maynadier, you may charge up to[Pg 44] the right that every woman has to change her mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He leaned down to the carriage door. \"Change your mind for me,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She appeared to ponder, as though undecided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just one,\" he pleaded, \"just one!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just one, then,\" she said, with a captivating smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She turned to Parkington, who rode on the other side of the coach; as a guest, of course, he had the place without a struggle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long are you from London?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ten weeks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who came out with you—any one of prominence?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; mainly shop-keepers and the like—a most uninteresting lot.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must have had a pleasant ten weeks!\" she laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I tried to make the best of it. Some amusement is to be got of a row of graven images, if one try hard enough; and, even a shop-keeper beats a graven image.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell me of your shipwreck,\" said she.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have forgotten,\" he said; \"forgotten everything but the salt water—I swallowed so much, I can taste it still.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It shall be the business of Annapolis to obliterate the taste.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is obliterated, now,\" he said, bending down.[Pg 45] \"Henceforth, Annapolis follows after London, with nothing whatever between—and you are Annapolis.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no! I am not. I have nothing to do with Annapolis, other than as a guest.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That should make you kind to the stranger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If the stranger be kind to me,\" she said, archly; then, before he could make answer, added: \"Take supper with us, this evening. You can retire in time to change your clothes for the Ball.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gladly,\" he exclaimed, \"gladly! Though, as to clothes, this suit will have to pass; Pinkney can get me no more for a day or two. Even this was a great favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You should hope, sir, that the rest will be as becoming,\" she murmured, as the coach drew up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-bye,\" she said, waving her fan to Mr. Paca and Captain Herford and Mr. Worthington; \"I will see you at the Ball, to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And, giving Sir Edward her hand, they went up the steps, and into the mansion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3329/91148.html","bookId":379,"creation":"Aug 5, 2019 5:56:58 AM","modification":"Aug 5, 2019 5:56:58 AM"}
