{"id":2646,"title":"If You Deceive (MacCarrick Brothers #3)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. \u003c/p\u003e\n \u003cp\u003eDo you like this book you can buy books: \u003c/p\u003e\n \u003cp\u003eIf You Deceive (MacCarrick Brothers #3) \u003c/p\u003e\n \u003cp\u003eBurning vengeance... \u003c/p\u003e\n \u003cp\u003eEthan MacCarrick was a heartbreakingly handsome rake until a powerful nobleman ordered him brutally beaten and his face scarred for a crime he didn\u0027t commit. Ethan\u0027s reprisal -- bankrupting the nobleman and forcing his exile -- does little to appease his wrath. Ten years later, a haughty, mysterious beauty enchants Ethan -- the daughter of his enemy. At last, Ethan will have the revenge he\u0027s craved; he\u0027ll promise her marriage, seduce her, then cast her aside. \u003c/p\u003e\n \u003cp\u003eBitter hardships... \u003c/p\u003e\n \u003cp\u003eWhen Madeleine van Rowen\u0027s family was suddenly plunged into destitution and dishonor, she steeled herself against further heartache. She never weakened, never trusted, until a towering, scarred Highlander relentlessly pursues her, breaking down her defenses. \u003c/p\u003e\n \u003cp\u003eAt what price forgiveness? \u003c/p\u003e\n \u003cp\u003eThe passion between them burns hotter than Ethan\u0027s fury, and soon he finds he can\u0027t let her go. But when Madeleine uncovers the truth about him, can Ethan convince her to accept all he now offers -- when he once destroyed everything she had?\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/if-you-deceive-maccarrick-brothers-3.jpg","author":"Kresley Cole","type":"Historical","source":"allnovel","link":"https://allnovel.net/if-you-deceive-maccarrick-brothers-3.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:48:21 AM"}
