{"id":38662,"no":34,"title":"CHAPTER XXXIII","content":"HELLIER returned, slowly and sadly, to the High Street.\n\u003cbr\u003e \n\u003cbr\u003e Assured in his own mind that Klein inhabited the house in St Ann’s Road, hopeless of any help from Freyberger, whom he had put down as a self-conceited man of not very luminous intelligence, he had undertaken the desperate venture of going himself to the house, tackling the occupant if he were at home, and if he were absent exploring the place.\n\u003cbr\u003e \n\u003cbr\u003e He had provided himself with a powerful chisel to prise the verandah door open. He had not to use it, however, for, as we have seen, the door was only held by the catch.\n\u003cbr\u003e \n\u003cbr\u003e It had been an expedition requiring a very great deal of pluck, considering the appalling man with whom he would have had to contend had his suspicions been correct. And it had ended in such a miserable fiasco!\n\u003cbr\u003e \n\u003cbr\u003e When he had lain on the floor of the passage with Freyberger on top of him, he imagined that his last moment had come. He had not even cried out for help, knowing that before help could arrive he would be dead.\n\u003cbr\u003e \n\u003cbr\u003e He had not come badly out of the business, yet he felt depressed with a miserable sense of failure.\n\u003cbr\u003e \n\u003cbr\u003e It was striking nine when he passed the High Street, Kensington, Station; just at the entry a flower-seller, with a basket of early roses and Nice violets, caught his eye. He bought a great bunch, and, calling a passing cab, ordered the driver to take him to the Langham.\n\u003cbr\u003e \n\u003cbr\u003e Violets were Cécile Lefarge’s favourite flowers.\n\u003cbr\u003e \n\u003cbr\u003e Love may be a liar, love may be blind, love may be anything you please, but, whatever else he may be, love is a courtier. No frilled marquess of the old regime, by long study, ever knew his monarch’s predilections as a lover by instinct knows the predilections of his mistress.\n\u003cbr\u003e \n\u003cbr\u003e Hellier bought violets instead of roses, instinctively and not from choice.\n\u003cbr\u003e \n\u003cbr\u003e At the Langham he found that Mademoiselle Lefarge was in, and a few moments later he was in her presence.\n\u003cbr\u003e \n\u003cbr\u003e She advanced to meet him, with hand outstretched.\n\u003cbr\u003e \n\u003cbr\u003e “I have brought you these,” he said, sinking into a chair, whilst she took a seat near him, “and some news—bad news, I am afraid.”\n\u003cbr\u003e \n\u003cbr\u003e “I am used to that,” replied she, “but any news coming from you can not be entirely bad. You, who have done so much and thought so much for me.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish I could have done more,” he replied. Then he told her the events of the day, suppressing nothing, altering nothing.\n\u003cbr\u003e \n\u003cbr\u003e She listened to him attentively. When he had finished she said:\n\u003cbr\u003e \n\u003cbr\u003e “Is that all?”\n\u003cbr\u003e \n\u003cbr\u003e “I think,” he said, “I have told you a good deal. I wish I could have told you less, or more.”\n\u003cbr\u003e \n\u003cbr\u003e “It is a good deal,” she replied. “And you went, alone and unarmed, to face that fearful man?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, and you see the result. I have spoiled everything.”\n\u003cbr\u003e \n\u003cbr\u003e “You have not spoiled my regard for you,” she replied. “You are very brave, and you know, or perhaps you do not know, how a woman can admire bravery in a man. But you are better than brave, you are single-hearted. And you let yourself be depressed by what that man, Freyberger, said to you to-night?”\n\u003cbr\u003e \n\u003cbr\u003e “It has depressed me, for he spoke the truth. He had no motive for speaking otherwise.”\n\u003cbr\u003e \n\u003cbr\u003e Cécile smiled.\n\u003cbr\u003e \n\u003cbr\u003e “Not a motive, perhaps, but a half motive.”\n\u003cbr\u003e \n\u003cbr\u003e “How?”\n\u003cbr\u003e \n\u003cbr\u003e “What makes a woman depreciate the good looks of another woman? Jealousy, my friend.”\n\u003cbr\u003e \n\u003cbr\u003e “But Freyberger—”\n\u003cbr\u003e \n\u003cbr\u003e “Is not a woman. No, but are men never jealous? I watched him last night when you were speaking to him. I could read his mind. The information you gave made his eyes sparkle with pleasure and excitement. Yet he was displeased. He spoke to you almost as if you were an antagonist. He said to himself, ‘This is a professional rival, a clever man who will, perhaps, take from me some of the honour should I bring this case to a successful termination.’\n\u003cbr\u003e \n\u003cbr\u003e “I believe in this Mr Freyberger. He has great qualities, he has perception and determination, but he is human. It is human to be jealous. You have committed no fault that I can see; but, then, I am not Freyberger. Had I met you in the passage of that house to-night, I would have said to you, ‘Your coming here makes no difference if the bird has flown; if the bird has not flown then remain with me, and help to capture him on his return.’ But then, you see, I am just a woman, not a jealous detective.\n\u003cbr\u003e \n\u003cbr\u003e “Do not be depressed, and, above all, do not relax your vigilance, for something tells me that, clever though our friend the detective may be, you will materially help in the completion of this terrible case. The only thing I regret is—”\n\u003cbr\u003e \n\u003cbr\u003e “Yes?”\n\u003cbr\u003e \n\u003cbr\u003e She sighed. “I regret that I have been instrumental in casting the shadow of so much crime and wickedness upon so true a heart as my friend Hellier.”\n\u003cbr\u003e \n\u003cbr\u003e He left her, carrying with him the perfume of her hair and the warmth of her lips.\n\u003cbr\u003e \n\u003cbr\u003e She loved him entirely, and told him so without a word. He could have made her his mistress that night. He would as soon have spat upon the pyx.\n\u003cbr\u003e \n\u003cbr\u003e The only love that is worth a name is the love that builds up barriers, the love that can take yet withholds its hand.\n\u003cbr\u003e \n\u003cbr\u003e The fatal, fatal mistake of the woman who gives herself up to a man before marriage, the fatal mistake is not so much perhaps in yielding to nature as in entertaining the idea that she is loved.\n\u003cbr\u003e \n\u003cbr\u003e To Hellier the idea of love was inseparable from the idea of marriage. He could not think of the woman he loved in any other position than exactly on the same pedestal as himself. His wife before all the world, on a par with his mother and his sisters, respected by them and received as one of themselves.\n\u003cbr\u003e \n\u003cbr\u003e And she was the daughter of an assassin. A cold-blooded murderer, whose crime had shocked Europe.\n\u003cbr\u003e \n\u003cbr\u003e It was not her fault. Leprosy is not the leper’s fault; is it any the less a barrier, shutting happiness out for ever from the afflicted one?\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1933/55491.html","bookId":775,"creation":"Aug 5, 2019 10:43:53 AM","modification":"Aug 5, 2019 10:43:53 AM"}
