{"id":38666,"no":38,"title":"CHAPTER XXXVII","content":"A QUARTER of an hour later he was standing in the presence of his superior.\n\u003cbr\u003e \n\u003cbr\u003e “Good evening, Freyberger,” said the chief.\n\u003cbr\u003e \n\u003cbr\u003e “Good evening, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “There is an express to Birmingham from Paddington at a quarter past midnight.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “I want you to catch it.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “The train stops at Reading.”\n\u003cbr\u003e \n\u003cbr\u003e “So I believe, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “You must get out at Reading and spend the night there. I want you early on the spot to-morrow morning. A murder has been committed.”\n\u003cbr\u003e \n\u003cbr\u003e “At Reading?”\n\u003cbr\u003e \n\u003cbr\u003e “No, at Sonning.”\n\u003cbr\u003e \n\u003cbr\u003e “The village of Sonning-on-Thames?”\n\u003cbr\u003e \n\u003cbr\u003e “Precisely. Do you know it?”\n\u003cbr\u003e \n\u003cbr\u003e “Slightly. I have in fact—”\n\u003cbr\u003e \n\u003cbr\u003e “Yes?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, it is a pleasure resort, a place where young couples—”\n\u003cbr\u003e \n\u003cbr\u003e “Precisely—where a young man might take a young woman.”\n\u003cbr\u003e \n\u003cbr\u003e Freyberger smiled discreetly.\n\u003cbr\u003e \n\u003cbr\u003e “Well,” continued the chief, “I am sending you down there hoping you may meet some one more interesting than a girl.”\n\u003cbr\u003e \n\u003cbr\u003e “And who may that be, sir?” asked Freyberger, a sudden glitter coming into his eye.\n\u003cbr\u003e \n\u003cbr\u003e “Klein.”\n\u003cbr\u003e \n\u003cbr\u003e “Ah!”\n\u003cbr\u003e \n\u003cbr\u003e “Müller, Kolbecker—call him what you will.”\n\u003cbr\u003e \n\u003cbr\u003e “So!”\n\u003cbr\u003e \n\u003cbr\u003e “You do not seem as jubilant as one might expect.”\n\u003cbr\u003e \n\u003cbr\u003e “I am not jubilant, sir; I would swear not to laugh again until I have this man by the shoulder, only the oath would be unnecessary. I am not jubilant, but I am glad. May I have the details of this crime?”\n\u003cbr\u003e \n\u003cbr\u003e “A man named Bronson, a farm-labourer, fifty years of age, has been found stabbed to death in a field at Sonning.”\n\u003cbr\u003e \n\u003cbr\u003e “Stabbed!”\n\u003cbr\u003e \n\u003cbr\u003e “Stabbed; there was no apparent motive for the crime, and the body was hacked as if by a maniac.”\n\u003cbr\u003e \n\u003cbr\u003e “That is he!” said Freyberger.\n\u003cbr\u003e \n\u003cbr\u003e “I suspect so. The only thing that makes me feel doubtful is the use of the knife. A strangler once a strangler always.”\n\u003cbr\u003e \n\u003cbr\u003e “He is frightened,” said Freyberger. “He must assuage his passion for murder, and he has changed his method.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you think you will find him in the neighbourhood of Sonning?”\n\u003cbr\u003e \n\u003cbr\u003e “I think it probable.”\n\u003cbr\u003e \n\u003cbr\u003e “Probable?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “We have a few minutes to spare before you need start to catch your train,” said the chief, who always liked to get at Freyberger’s line of reasoning. “So you can just tell me why you think it probable. I would have put it down only as possible.”\n\u003cbr\u003e \n\u003cbr\u003e “In this way, sir. Why has this murder (if it is one of Klein’s), why has it taken place at Sonning rather than anywhere else? Sonning is a pleasant place enough to spend a day, it would be pleasant enough to spend a week there, but that fact is not an inducement to a murderer. I believe this man commits his crimes within easy reach of some den of his. We know from the house-agent that a man, similar to him, took a house in St Ann’s Road. We have seen that he only furnished one room, and had no servant or help of any sort. He does not want to be spied on.\n\u003cbr\u003e \n\u003cbr\u003e “We may suppose he left London, and for some reason or another took probably a cottage near Sonning, just as he took a cottage on the Fells of Cumberland.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, we may suppose that.”\n\u003cbr\u003e \n\u003cbr\u003e “Well—when was this murder committed—?”\n\u003cbr\u003e \n\u003cbr\u003e “Yesterday morning.”\n\u003cbr\u003e \n\u003cbr\u003e “Then it is probable he is still in the neighbourhood. Leaving aside the assumption that this murder was a sudden affair, the impulse of a moment, and that he had not made plans for leaving Sonning, there is the fact that a murderer of this type has a tendency to cling to the neighbourhood of his crime. Well, we will see. There is one thing I would like to have before I start.”\n\u003cbr\u003e \n\u003cbr\u003e “What is that?”\n\u003cbr\u003e \n\u003cbr\u003e “The sheath of the knife I found at St Ann’s Road.”\n\u003cbr\u003e \n\u003cbr\u003e “You shall have it.”\n\u003cbr\u003e \n\u003cbr\u003e The chief rang, and ordered the officer who answered the summons to bring the article in question, and Freyberger, placing it in his pocket, departed.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1933/55495.html","bookId":775,"creation":"Aug 5, 2019 10:43:53 AM","modification":"Aug 5, 2019 10:43:53 AM"}
