{"id":111205,"no":11,"title":"Page 11","content":"\u003cp\u003e“I don’t know, Dr. Warthrop!”\u003c/p\u003e\n\u003cp\u003eHe stood up, and I fell backward, too weak to rise, too frightened to say any more. I looked into his face and saw a man squeezed tight in the crushing embrace of indecision, caught between two unacceptable courses.\u003c/p\u003e\n\u003cp\u003e“I don’t know enough. God forgive me, I don’t know enough!”\u003c/p\u003e\n\u003cp\u003eHe seemed so large standing over me, a colossus, one of the Nephilim, the race of giants who bestrode the world when the world was young. His eyes darted about the room, as if he were looking for an answer to his impossible dilemma, as if somewhere in the kitchen would be the sign that would show him the way.\u003c/p\u003e\n\u003cp\u003eThen the monstrumologist became very still. His restless eyes came to rest upon my upturned face.\u003c/p\u003e\n\u003cp\u003e“No,” he said softly. “Not God.”\u003c/p\u003e\n\u003cp\u003eHe stepped away quickly, and before I could crane my neck around to see where he had gone, he returned, carrying the butcher knife.\u003c/p\u003e\n\u003cp\u003eHe leaned over, reached out, grabbed my left wrist, yanked me from the floor, dragged me to the kitchen table, slapped my hand upon it, shouted, “Spread your fingers!” pressed his left hand hard over the top of mine, brought high the knife, and slammed it down.\u003c/p\u003e\n\u003cp\u003eChapter Eight: “The One Thing That Keeps Me Human”\u003c/p\u003e\n\u003cp\u003eWould you live?\u003c/p\u003e\n\u003cp\u003eThe smell of lilacs. The sound of water dripping in a basin. The touch of a warm, wet cloth.\u003c/p\u003e\n\u003cp\u003eAnd a shadow. A presence. A shade beyond my shaded eyes.\u003c/p\u003e\n\u003cp\u003eWould you live?\u003c/p\u003e\n\u003cp\u003eI float against the ceiling. Below me is my body. I see it clearly, and sitting next to the bed, the monstrumolost, wringing out the washcloth.\u003c/p\u003e\n\u003cp\u003eThen he covers me. I cannot see his face. He is looking at my other face, my mortal face, the one belonging to the boy in the bed.\u003c/p\u003e\n\u003cp\u003eHe sits back down. I can see his face now. I want to say something to him. I want to answer his question.\u003c/p\u003e\n\u003cp\u003eHe rubs his eyes. He runs his long fingers through his hair. He bends forward, rests his elbows on his knees, and covers his face with his hands. He remains like this but for a moment, and then he is on his feet, pacing to the end of the bed and back again. The lamp flings his shadow upon the floor, and the shadow crawls up the wall as he approaches and then trails behind him as he turns.\u003c/p\u003e\n\u003cp\u003eHe collapses into the chair, and I watch him reach out and lay his hand upon my forehead. The gesture seems absentminded, as if touching me might help him to think.\u003c/p\u003e\n\u003cp\u003eAbove, I watch him touch me. Below, I feel it.\u003c/p\u003e\n\u003cp\u003eThe light burrows deep into my eyes, brighter than a thousand galaxies. Behind the light his eyes, darker than the deepest pit.\u003c/p\u003e\n\u003cp\u003eHis fingers wrapped around my wrist. The press of the cold stethoscope against my chest. My blood flowing into chambers of glass.\u003c/p\u003e\n\u003cp\u003eAnd the light digging into my eyes.\u003c/p\u003e\n\u003cp\u003eWhat did you bring me, Father?\u003c/p\u003e\n\u003cp\u003eI brought you a seed.\u003c/p\u003e\n\u003cp\u003eA seed?\u003c/p\u003e\n\u003cp\u003eYes, a golden seed from the Isle of Bliss, and if you plant it and give it water, it will grow into a golden tree that bears lollipops.\u003c/p\u003e\n\u003cp\u003eLollipops!\u003c/p\u003e\n\u003cp\u003eYes! Golden lollipops! And peppermints and horehound drops and lemon drops. Why are you laughing? Plant it; you’ll see.\u003c/p\u003e\n\u003cp\u003eI see him standing in the doorway. He has something in his hand.\u003c/p\u003e\n\u003cp\u003eRopes.\u003c/p\u003e\n\u003cp\u003eHe drops the ropes into the chair. Reaches into his pocket.\u003c/p\u003e\n\u003cp\u003eRevolver.\u003c/p\u003e\n\u003cp\u003eHe sets the gun on the table by the chair. Do I see his hand shaking?\u003c/p\u003e\n\u003cp\u003eGently he fishes out my arm from beneath the covers, picks up a length of rope—there are three—and ties a knot around my wrist.\u003c/p\u003e\n\u003cp\u003eI float above him. I cannot see his face. He is looking down at the face of the boy.\u003c/p\u003e\n\u003cp\u003eHe whirls away from the bed; the free end of the rope tumbles over the edge.\u003c/p\u003e\n\u003cp\u003eThen he turns back, sweeps the ropes lying in the chair onto the floor, and sits down. For a long moment he does not move.\u003c/p\u003e\n\u003cp\u003eAnd then the monstrumologist takes the other end of the rope, ties it to his wrist, leans back in the chair, and closes his eyes to sleep.\u003c/p\u003e\n\u003cp\u003eWhere did you go this time, Father?\u003c/p\u003e\n\u003cp\u003eI’ve told you, Willy. The Isle of Bliss.\u003c/p\u003e\n\u003cp\u003eWhere is the Isle of Bliss?\u003c/p\u003e\n\u003cp\u003eWell, first you must find a boat. And not just any boat will do. You must find the fastest boat in the world; that is, a boat with a thousand sails, and when you’ve sailed for a thousand days, you will see something that the world hasn’t seen in a thousand years. You’ll swear the sun has fallen into the sea, for every tree on that island is a golden tree, and every leaf a golden leaf, and the leaves shine with a radiance all their own, so even in the darkest night the island seems to burn like a lighthouse beacon.\u003c/p\u003e\n\u003cp\u003e“I have been thinking about your father for some reason,” the monstrumologist said to the boy. “He saved my life once. I don’t think I ever told you.”\u003c/p\u003e\n\u003cp\u003eThe room seemed so empty; I had gone to a place he could not go. It didn’t matter really whether I could hear him. His words were not meant entirely for me.\u003c/p\u003e\n\u003cp\u003e“Arabia, the winter of ’73—or it may have been ’74; I can’t recall now. Late one night our camp was ambushed by a hostile and extremely violent pack of predators—by that I mean Homo sapiens. Bandits. Lost three of our porters—and our guide, a very pleasant bedouin by the name of Hilal. I felt badly about Hilal. He thought the world of me. Even tried to give me one of his daughters—either in marriage or as a slave, I was never quite sure because I was never completely comfortable in the language. At any rate, one moment he was talking to me, smiling, laughing—he was very jolly. Few nomads are glum, Will Henry; if you think about it, you will understand why. And the next moment his head was hacked clean off his shoulders.…\u003c/p\u003e\n\u003cp\u003e“Afterward I told his widow, ‘Your husband is dead, but at least he died laughing.’ I think she took some comfort in that. It is the second-best way to die, Will Henry.” He did not say what the best way was.\u003c/p\u003e\n\u003cp\u003e“At any rate, your father pulled me from harm’s way. I would have stood my ground, if only to avenge Hilal’s death, but I’d been badly wounded in the thigh and was losing a great deal of blood. James threw me over the saddle of his pony and rode all night to the nearest village. Rode that horse until it collapsed, and then carried me the rest of the way.”\u003c/p\u003e\n\u003cp\u003eI want to go, Father. Will you take me there, to the Isle of Bliss?\u003c/p\u003e\n\u003cp\u003eIt’s a very, very long way from here, Will.\u003c/p\u003e\n\u003cp\u003eI don’t care. We’ll find a ship of a thousand sails to carry us there.\u003c/p\u003e\n\u003cp\u003eOh, now, those ships are very difficult to come by.\u003c/p\u003e\n\u003cp\u003eYou found one.\u003c/p\u003e\n\u003cp\u003eYes, I did. I did find that ship.\u003c/p\u003e\n\u003cp\u003e“I was laid up for two weeks—the wound had become infected—slipping in and out of delirium, and all the while your father was by my side. At one point, though, I saw Hilal sitting besidee, dimly, as if through a veil or mist, and I knew to the marrow of my bones that I had come to the lip of the stage, as it were. I was not surprised to see him sitting there, and I was not in the least afraid. I was actually happy to see him. He asked me what I wanted. ‘What do you want, Sheikh Pellinore Warthrop? Ask and it will be done.’\u003c/p\u003e\n\u003cp\u003e“And of all the things I might have asked, I asked him to tell me a joke. And he did, and the devil of it is, I can’t recall it now. It still bothers me. It was a very funny joke. My difficulty is that I have no memory for jokes. My mind does not tend in that direction.”\u003c/p\u003e\n\u003cp\u003eHe was playing with the knot around his wrist. His wan smile faded, and suddenly he was angry—intensely angry.\u003c/p\u003e\n\u003cp\u003e“It is… unacceptable. Intolerable. I will not tolerate it, do you understand? You are forbidden to die. You did not will your parents’ death; you did not ask to come here—it is not your debt; you should not have to pay.”\u003c/p\u003e\n\u003cp\u003eHere, here, now. Do not cry. You’re still very young. You’ll have years and years to find it. Until then I shall be the ship of a thousand sails. Climb aboard me back, me matey, and I shall bear thee to that fabled isle!\u003c/p\u003e\n\u003cp\u003e“I will not suffer you to die,” he said fiercely. “Your father died because of me, and I cannot afford your death too. The debt will crush me. If you go down, Will Henry, you will drag me down with you.” Tugging on the rope.\u003c/p\u003e\n\u003cp\u003eI see it, Father! The Isle of Bliss. It burns like the sun in the black water.\u003c/p\u003e\n\u003cp\u003e“Enough!” he cried. “I forbid you to leave me. Now snap to, get up, stop this foolishness. I have saved you. So snap to, you stupid, stupid boy.”\u003c/p\u003e\n\u003cp\u003eHe brought back the hand connected to mine and slapped me hard across the cheek.\u003c/p\u003e\n\u003cp\u003e“Snap to, Will Henry!” Smack!“Snap to, Will Henry!” Smack!“Snap to, Will Henry!” Smack, smack, smack!\u003c/p\u003e\n\u003cp\u003e“Would you live?” he shouted. “Then, choose to live. Choose to live!”\u003c/p\u003e\n\u003cp\u003eGasping, he fell back toward the chair; the rope connecting us yanked on his arm. Roaring his frustration, he pulled his wrist free of the knot and flung the rope onto my body.\u003c/p\u003e\n\u003cp\u003eHe was spent. All fear, all anger, all guilt, all shame, all pride—gone. He felt nothing; he was empty. Perhaps God waits for us to be empty, so he may fill us with himself.\u003c/p\u003e\n\u003cp\u003eI say this, because next the monstrumologist said this:\u003c/p\u003e\n\u003cp\u003e“Please, do not leave me, Will Henry. I would not survive it. You were nearly right. What Mr. Kendall was, I am always on the brink of becoming. And you—I do not pretend to understand how or even why— but you pull me back from the precipice. You are the one.… You are the one thing that keeps me human.”\u003c/p\u003e\n\u003cp\u003eChapter Nine: “The Final Disposition”\u003c/p\u003e\n\u003cp\u003eYou are the one thing that keeps me human.\u003c/p\u003e\n\u003cp\u003eIn the months that followed—well, years to be completely accurate—the monstrumologist never wavered in his disavowal of saying those words. I must have been delirious; he never said anything like it; or, my favorite, he said something entirely different and I misheard him. This was more like the Pellinore Warthrop I had come to know, and somehow I preferred the familiar version. It was predictable and therefore comforting. My mother, as devout as any New England woman of Puritan stock, loved to speak of the days “when the lion lies down with the lamb.” Though I understand the theology behind it, the image does not bring me peace; it makes me feel sorry for the lion. It strips him of his essence, the fundamental part of his being. A lion that doesn’t behave as a lion is not a lion. It isn’t even the lion’s opposite. It’s a mockery of a lion.\u003c/p\u003e\n\u003cp\u003eAnd Pellinore Warthrop, like that lion—or its Creator!—is not mocked.\u003c/p\u003e\n\u003cp\u003e“I do not deny affirming what I have often said, Will Henry, and that is that, in general, your services have proven more indispensable than not. I have never pretended otherwise. I believe in acknowledging debts where debts are owed. One must take care, however, not to extrapolate anything… well, excessive from it, for lack of a better word.”\u003c/p\u003e\n\u003cp\u003eAnd then he would brusquely change the subject.\u003c/p\u003e\n\u003cp\u003eI forbid you to leave me.\u003c/p\u003e\n\u003cp\u003eIt seemed quite sudden to me, my acquiescence to his demand. One moment I could see myself and see him and see the room—and more, much more. I saw… everything. I saw our house on Harrington Lane; I saw our town of New Jerusalem; I saw New England. I saw oceans and continents and the earth spinning round the sun. I saw the moons of Jupiter and the Milky Way and the unfathomable depths of space. I saw the entire universe. I held it in the palm of my hand.\u003c/p\u003e\n\u003cp\u003eAnd the next moment I was in the bed, my head splitting, my left hand throbbing. And Warthrop was sound asleep in the chair beside me. I cleared my throat; my mouth was desert-dry. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-isle-of-blood-the-monstrumologist-3/page-11.html","bookId":2548,"creation":"Oct 6, 2019 12:20:15 AM","modification":"Oct 6, 2019 12:20:15 AM"}
