{"id":111211,"no":19,"title":"Page 19","content":"\u003cp\u003e“One does not ‘let’ Pellinore Warthrop do anything, Will. Your master, he does all the ‘letting.’”\u003c/p\u003e\n\u003cp\u003e“You could have stopped Mr. Arkwright from going.”\u003c/p\u003e\n\u003cp\u003e“But I wanted him to go. I could not allow Pellinore to go alone.”\u003c/p\u003e\n\u003cp\u003eIt was absolutely the worst thing he could have said, and he knew it.\u003c/p\u003e\n\u003cp\u003e“I will go now,” he said meekly. “But I expect you downstairs for lunch. I will instruct François to whip up something extra special for you, très magnifique!”\u003c/p\u003e\n\u003cp\u003eVon Helrung hurried from the room. I dropped my carpetbag onto the floor, lay down face-first upon the bed, and willed myself to die.\u003c/p\u003e\n\u003cp\u003eIt did not take long for my shock at being cast aside to change to shame (Arkwright is young and very strong and quite clever), or shame to confusion (Do not underestimate him, von Helrung. I would trade a dozen Pierre Lebroques for one William James Henry), and then harden into a white-hot ember of rage. Sneaking off like that without a word of explanation, without even a farewell—fond or otherwise! The bravest man I’d ever known, a coward! How dare he, after all we’d suffered together, after my saving his life more than once. You are the one thing that keeps me human. Yes, I suppose I am, Dr. Warthrop, until you find someone to keep you human in my place. It dumbfounded me; it shook me to the foundations of my being. It did not matter that he had promised to return for me. He had left me; that’s what mattered.\u003c/p\u003e\n\u003cp\u003eToo much time had passed. I’d been too long with him. For two years he had bound me to him, a mote of dust caught in his Jovian gravity. I didn’t even know what the world looked like without the Warthropian lenses through which to view it. Now they were gone, and I was blind.\u003c/p\u003e\n\u003cp\u003e“We shall see how Mr. Arkwright likes it,” I told myself with bitter satisfaction. “‘Snap to, Mr. Arkwright! Snap to!’ Let’s see how he likes being laughed at and scolded and mocked and ordered around like a coolie. Have at it, Mr. Arkwright, and welcome to it!”\u003c/p\u003e\n\u003cp\u003eI refused to eat. I could not sleep. All of von Helrung’s efforts to coax me out of the room failed. I sat in the chair by the fireplace and sulked like Achilles in his tent, while the war of day-to-day life raged on without me. On the evening of the third day von Helrung shuffled in bearing a tray of hot chocolate and pastries and a chessboard.\u003c/p\u003e\n\u003cp\u003e“We will have a nice game of chess, ja? Now, do not tell me Pellinore failed to teach you. I know him better.”\u003c/p\u003e\n\u003cp\u003eHe had. Chess was one of the monstrumologist’s favorite diversions. And, like many who excelled at the game, he never seemed to tire of utterly humiliating his opponent—that is, me. In the first year of our tenancy together, he wasted more than a few hours trying to instruct me in the finer aspects of strategy, attack, counterattack, and defense. I never bested him, not once. He might have chosen generosity over ruthlessness and allowed me to win a game or two, to build up my confidence, but the doctor never had much interest in building up anything in me other than a strong stomach. Besides, destroying an eleven-year-old boy in six moves—in a game he had been playing longer than the boy had been alive—lifted his spirits, like a fine wine at dinner.\u003c/p\u003e\n\u003cp\u003e“I don’t feel like playing.”\u003c/p\u003e\n\u003cp\u003eHe was setting up the board. It was a set made from jade, the pieces carved into the shapes of dragons. The dragon king and queen wore crowns. The dragon bishops clutched shepherd crooks in their talons.\u003c/p\u003e\n\u003cp\u003e“Oh, no, no. We shall play. I shall teach you as I taught Pellinore. Better, so you can beat him when he comes back.” He was humming happily under his breath.\u003c/p\u003e\n\u003cp\u003eI hurled the board against the wall. Von Helrung gave a soft cry, mewling as he picked up the dragon king, who had lost his crown; it had broken off when the piece had hit the floor.\u003c/p\u003e\n\u003cp\u003e“Dr. von Helrung… I’m sorry…”\u003c/p\u003e\n\u003cp\u003e“No, no,” he said. “It is nothing. A gift from my dear wife, may her sleep go undisturbed.” He snuffled. Not knowing how to comfort him, and feeling mortified by my childishness, I awkwardly dropped my hand upon his shoulder.\u003c/p\u003e\n\u003cp\u003e“I worry too, Will,” he confessed. “The days ahead will be dangerous for him, and dark. Remember that when the tide of self-pity threatens to overwhelm you.”\u003c/p\u003e\n\u003cp\u003e“I know that,” I replied. “It’s why I should be with him. He doesn’t need me to cook or clean or take his dictation or care for his horse or any of that. Those things anyone can do, Dr. von Helrung. He needs me for the dark places.”\u003c/p\u003e\n\u003cp\u003eOn the morning of the seventh day, a telegramrived from London:\u003c/p\u003e\n\u003cp\u003eARRIVED SAFE. WILL ADVISE. PXW.\u003c/p\u003e\n\u003cp\u003e“Four words?” von Helrung moaned. “That is all he has to say?”\u003c/p\u003e\n\u003cp\u003e“An overseas cable costs a dollar a word,” I told him. “The doctor is very stingy.”\u003c/p\u003e\n\u003cp\u003eVon Helrung, who was not nearly as wealthy as my master, or as penny-pinching, returned this reply:\u003c/p\u003e\n\u003cp\u003eREPORT AT ONCE ANY FINDINGS.\u003c/p\u003e\n\u003cp\u003eHAVE YOU MET WITH WALKER?\u003c/p\u003e\n\u003cp\u003eANXIOUSLY AWAITING YOUR REPLY.\u003c/p\u003e\n\u003cp\u003eThat reply was long—very long—in coming.\u003c/p\u003e\n\u003cp\u003eAfter two weeks had passed with no discernible improvement in my condition, von Helrung summoned his personal physician, a Dr. John Seward, to have a look at me. For an hour I was poked and prodded, thumped and pinched. I had no fever. My heart and lungs sounded good. My eyes were clear.\u003c/p\u003e\n\u003cp\u003e“Well, he’s underweight, but he is small for his age,” Seward told von Helrung. “He could also use a good dentist. I’ve seen cleaner teeth on a goat.”\u003c/p\u003e\n\u003cp\u003e“I worry, John. He’s eaten little and slept less since he came.”\u003c/p\u003e\n\u003cp\u003e“Can’t sleep, hmmm? I’ll mix up something to help.” He was staring at my left hand. “What happened to your finger?”\u003c/p\u003e\n\u003cp\u003e“Doctor Pellinore Warthrop chopped it off with a butcher knife,” I replied.\u003c/p\u003e\n\u003cp\u003e“Really? And why would he do that?”\u003c/p\u003e\n\u003cp\u003e“The risk was unacceptable.”\u003c/p\u003e\n\u003cp\u003e“Gangrene?”\u003c/p\u003e\n\u003cp\u003e“Pwdre ser.”\u003c/p\u003e\n\u003cp\u003eBaffled, Seward looked at von Helrung, who laughed nervously and waved his hand in a vague circle.\u003c/p\u003e\n\u003cp\u003e“Oh, the children, ja? So robust, their imaginations!”\u003c/p\u003e\n\u003cp\u003e“He cut it off and put it in a jar,” I said, as von Helrung, standing slightly behind Seward, violently shook his head.\u003c/p\u003e\n\u003cp\u003e“Did he? And why did he do that?” Seward asked.\u003c/p\u003e\n\u003cp\u003e“He wants to study it.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t he have done that when it was still attached to your hand?”\u003c/p\u003e\n\u003cp\u003e“My father was a farmer,” von Helrung announced loudly. “And one day a cow would get sick, she would lie down, and no coaxing would bring her back up. ‘There is nothing to be done, Abram,’ my father would tell me. ‘When an animal gives up like that, it has lost its will to live.’”\u003c/p\u003e\n\u003cp\u003e“Is that it?” Seward asked me. “Have you lost your will to live?”\u003c/p\u003e\n\u003cp\u003e“I live here. I don’t want to be here. Is that the same thing?”\u003c/p\u003e\n\u003cp\u003e“It could be melancholia,” surmised the young doctor. “Depression. That would account for the loss of appetite and the insomnia.” He turned to 220;Do you ever have thoughts of killing yourself?”\u003c/p\u003e\n\u003cp\u003e“No. Other people sometimes.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“No, not really,” von Helrung put in. Nein!\u003c/p\u003e\n\u003cp\u003e“And I have.”\u003c/p\u003e\n\u003cp\u003e“You have…”\u003c/p\u003e\n\u003cp\u003e“Killed other people. I killed a man named John Chanler. He was the doctor’s best friend.”\u003c/p\u003e\n\u003cp\u003e“You don’t say!”\u003c/p\u003e\n\u003cp\u003e“I do not think that he did!” von Helrung barked in a voice just shy of a shout. “He has bad dreams. Very bad dreams. Terrible nightmares. Ach! He is talking about the dreams. Aren’t you, Will?”\u003c/p\u003e\n\u003cp\u003eI lowered my eyes and said nothing.\u003c/p\u003e\n\u003cp\u003e“Well, I can’t find anything physically wrong with him, Abram. You may want to consult an alienist.”\u003c/p\u003e\n\u003cp\u003e“To confess, I have been thinking of bringing in an expert in the field.”\u003c/p\u003e\n\u003cp\u003eThe “expert” arrived at the Fifth Avenue brownstone the following afternoon—a soft knock on the door, and then von Helrung poked his mane of white hair into the room, saying over his shoulder to someone in the hall, “Gut, he is presentable.”\u003c/p\u003e\n\u003cp\u003eI heard a woman’s voice next. “Well, I should hope so! You did tell him I was coming, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe stepped lightly to one side, and in charged a dynamo draped in lavender, wearing a fashionable bonnet and carrying a matching umbrella.\u003c/p\u003e\n\u003cp\u003e“So this is William James Henry,” she said in a refined East Coast accent. “How do you do?”\u003c/p\u003e\n\u003cp\u003e“Will, may I present my niece, Mrs. Nathaniel Bates,” said von Helrung.\u003c/p\u003e\n\u003cp\u003e“Bates?” I repeated. I knew that name.\u003c/p\u003e\n\u003cp\u003e“Mrs. Bates, if you please,” she said. “William, I have heard so much about you, I cannot help but feel we’ve known each other for years. But stand up and let me get a look at you.”\u003c/p\u003e\n\u003cp\u003eShe took my wrists into her gloved hands and held my arms out from my sides, and puckered her lips in disapproval.\u003c/p\u003e\n\u003cp\u003e“Much too thin—and how old is he, Uncle? Twelve?”\u003c/p\u003e\n\u003cp\u003e“Thirteen.”\u003c/p\u003e\n\u003cp\u003e“Hmmm. And short for his age. Stunted growth for lack of proper nutrition, I would say.” She squinted down her nose at my face. She had bright blue eyes like her uncle’s. And, like his, they seemed to shine by their own soulful light, insightful, a bit wistful, kind.\u003c/p\u003e\n\u003cp\u003e“I would not speak ill of any gentleman,” she said. “But I am not impressed with the rearing abilities of Dr. Pellinore Warthrop. Uncle, when was the last time this child had a bath?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Will, how long has it been since you’ve bathed?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I answered.\u003c/p\u003e\n\u003cp\u003e“Well, here is the problem as I see it, William, and that is, if one cannot remember the last time one had a bath, it is probably time to take one. What is your opinion?”\u003c/p\u003e\n\u003cp\u003e“I don’t want to take a bath.”\u003c/p\u003e\n\u003cp\u003e“That is a desire, not an opinion. Where are your things? Uncle Abram, where are the boy’s belongings?”\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” I said to von Helrung, somewhat pleadingly.\u003c/p\u003e\n\u003cp\u003e“Emily has generously proffered an invitation for you to stay with her family for a few days, Will.”\u003c/p\u003e\n\u003cp\u003e“But I—I don’t want to spend a few days with her family. I want to stay here with you.”\u003c/p\u003e\n\u003cp\u003e“That is not going so well, though, is it?” Emily Bates asked.\u003c/p\u003e\n\u003cp\u003e“I’ll eat. I promise. I promise to try. And Dr. Seward, he gave me something to help me sleep. Please.”\u003c/p\u003e\n\u003cp\u003e“William, Uncle Abram is many things—some of them wonderful and some I would rather not think about—but he hasn’t the first idea how to raise a child.”\u003c/p\u003e\n\u003cp\u003e“But that’s what I’m used to,” I argued. “And no one is going to raise me. No one has to. The doctor will be coming back soon and—”\u003c/p\u003e\n\u003cp\u003e“Yes, and when he does, we will give you back, safe and sound and clean. Come along now, William. Bring whatever you have; I’m sure it isn’t much, but that can be remedied too. I will wait for you downstairs. It’s very warm in here, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I’ll walk you down,” von Helrung offered. He seemed anxious to remove himself from my presence. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-isle-of-blood-the-monstrumologist-3/page-19.html","bookId":2548,"creation":"Oct 6, 2019 12:20:15 AM","modification":"Oct 6, 2019 12:20:15 AM"}
