{"id":111219,"no":27,"title":"Page 27","content":"\u003cp\u003e“All right,” Arkwright said loudly. “All right! This really is becoming tiresome. I demand to speak to Dr. von Helrung immediately!”\u003c/p\u003e\n\u003cp\u003eTorrance set the lid aside, and then reached inside to remove the nidus, grimacing a bit, not from fear, I think, but, because his forearms were so large, it was a tight fit. He carefully lowered the nest of woven human remains next to the jar, where it glistened wetly in the lamplight.\u003c/p\u003e\n\u003cp\u003e“Spatula, Will,” Torrance murmured. I handed him the flat-bladed tool, which he used to coax off a dime-size amount of the bonding material, the sticky sputum of Typhoeus magnificum.\u003c/p\u003e\n\u003cp\u003e“What is it?” Arkwright shouted. “What are you doing over there?”\u003c/p\u003e\n\u003cp\u003e“You know what I’m doing.”\u003c/p\u003e\n\u003cp\u003e“You do not realize it, sir, but you have made a grievous mistake. A grievous mistake!”\u003c/p\u003e\n\u003cp\u003e“Me? I have made a grievous mistake?” Torrance held up the spatula.\u003c/p\u003e\n\u003cp\u003e“Do you think that frightens me?” Arkwright laughed derisively. “You won’t do it. You can’t do it.”\u003c/p\u003e\n\u003cp\u003e“I can’t do it?” Torrance seemed genuinely puzzled.\u003c/p\u003e\n\u003cp\u003e“No, you can’t—because I don’t have to tell you anything. I won’t tell you anything unless you release me. Ha! Now which shall you choose? If you do this to me, you will never know.”\u003c/p\u003e\n\u003cp\u003e“Never know what? I don’t recall asking you a damn thing.”\u003c/p\u003e\n\u003cp\u003eArkwright tried to laugh. It came out as a strangled hiccup. His hands were locked around the rear legs of the chair, and they were shaking, and so the chair too was shaking. The very air around Thomas Arkwright shook; the dust particles vibrated in sympathy to his terror.\u003c/p\u003e\n\u003cp\u003eTorrance continued: “The absorption rate varies depending on the location of the exposurzleposure to the upper dermis, for example, results in a more prolonged development of symptoms than, say, exposure to the mouth, or eyes, nose—any body cavity, really, such as the ear canal or the anus.”\u003c/p\u003e\n\u003cp\u003eHe was speaking in a very dry monotone, similar to the one I’d heard the doctor use, as if he were addressing some unseen classroom of students.\u003c/p\u003e\n\u003cp\u003e“You’re mad,” Arkwright said matter-of-factly.\u003c/p\u003e\n\u003cp\u003e“No,” Torrance replied. “I’m a monstrumologist. It’s a subtle distinction.”\u003c/p\u003e\n\u003cp\u003eThen he continued with his presentation: “And the symptoms… Well, I probably don’t need to go into all that. If you’re curious, I suppose Will here could describe them to you—what you may expect in the hours to come. He’s seen it up close.”\u003c/p\u003e\n\u003cp\u003eI nodded. I felt light-headed. Blood roared in my ears. And in my heart, the tightly wound thing unwinding.\u003c/p\u003e\n\u003cp\u003e“Will…,” Arkwright echoed. “Will! Will, you can’t do this. Don’t let him do this, Will! Run and find von Helrung. Quick, Will! Go!”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t appeal anything to Mr. Henry if I were you,” said Torrance. “Truth is, all this was his idea.”\u003c/p\u003e\n\u003cp\u003eArkwright stared at me, dumbfounded. I returned his stare frankly; I did not look away.\u003c/p\u003e\n\u003cp\u003e“He’s the one who figured you out for the stinking liar you are. So I wouldn’t be barking orders at Mr. Will Henry, no sir!”\u003c/p\u003e\n\u003cp\u003eHe stepped toward the seated man, and that one step caused Arkwright to jerk violently. The feet of the chair complained against the concrete floor. The gun fell from his lap.\u003c/p\u003e\n\u003cp\u003e“Dear God, I don’t know what you want from me!” he cried, his bravado beginning to break.\u003c/p\u003e\n\u003cp\u003e“Hear that, Will?” inquired Torrance. “That sound like a Long Island accent to you? Doesn’t to me. Sounds English almost.”\u003c/p\u003e\n\u003cp\u003e“I am a British citizen, a servant to the crown of Her Majesty, Queen Victoria, and I will see you hang, sir!”\u003c/p\u003e\n\u003cp\u003e“I doubt that,” Torrance returned easily. He stepped around the chair to stand directly behind Arkwright, moving with startling alacrity for a man his size. He did not hesitate; he did not wait for his prisoner to turn his head; he reached forward with his free hand and pinched shut Arkwright’s nose.\u003c/p\u003e\n\u003cp\u003eThe reaction was immediate. Arkwright bucked and twisted, threw his body impotently against the ropes, whipped his head from side to side in a vain attempt to dislodge Torrance’s viselike grip. Out of the corner of his eye, before it was covered with the palm of his captor’s large hand, he must have seen the gleaming spatula in Torrance’s other hand. His lips were clamped tightly together, but he and Torrance knew it could be maintained for only so long. He could hold his breath until he passed out, but what would that accomplish? It would make Torrance’s job easier; that’s all.\u003c/p\u003e\n\u003cp\u003eHe had little choice. The lady or the tiger? It was a poor analogy.\u003c/p\u003e\n\u003cp\u003eHe opened his mouth and gasped, “My name is not Arkwright.” With his nose clamped tight, he sounded like he had a bad head cold.\u003c/p\u003e\n\u003cp\u003e“I don’t care what your name is.”\u003c/p\u003e\n\u003cp\u003e“You will hang for this!” he shouted. “You and von Helrung and your little bastard assistant.”\u003c/p\u003e\n\u003cp\u003e“Will isn’t my little bastard assistant. Will is Pellinore Warthrop’s little bastard assistant.”\u003c/p\u003e\n\u003cp\u003e“Warthrop? Is that it? You want to know what happened to Warthrop? Warthrop is dead. He died on Masirah, the bloody island of Masirah, in the Arabian Sea, just like I told von Helrung!”\u003c/p\u003e\n\u003cp\u003eTorrance looked across the room at me. I shook my head.\u003c/p\u003e\n\u003cp\u003e“We don’t believe you,” he told Arkwright. “Will, lend me a hand here. He keeps jerking around like this, and I’m going to drop the spatula.”\u003c/p\u003e\n\u003cp\u003eI took the implement from him and watched Torrance wrap his huge forearm around Arkwright’s neck.\u003c/p\u003e\n\u003cp\u003e“You’ve done it now,” Torrance whispered. “See, I might hesitate. I’m at the age where the idea of hanging actually gives me pause, but he’s just a child, and children think they will live forever. He’s got a strong case. He thinks you may have killed Warthrop, you know, and I’m thinking he may be right.”\u003c/p\u003e\n\u003cp\u003e“I didn’t kill him!”\u003c/p\u003e\n\u003cp\u003e“Well, he sure didn’t die the way you described it. My money is on Kearns. Kearns killed him.”\u003c/p\u003e\n\u003cp\u003e“No one killed him—no one. I swear to you, no one!” His eyes fell upon me; I was the one who held death itself—and therefore his life—in my hand.\u003c/p\u003e\n\u003cp\u003e“He’s alive,” he gasped. “There. He’s alive! Is that satisfactory to you?”\u003c/p\u003e\n\u003cp\u003e“First he’s dead; now he’s alive,” Torrance said. “Next you’ll have him appearing in a traveling minstrel show.”\u003c/p\u003e\n\u003cp\u003eHe released Arkwright and snapped his fingers at me. He wanted the pwdre ser.\u003c/p\u003e\n\u003cp\u003eArkwright cried out, “I’m telling you the truth! And I’ll tell you what else. The bastard wouldn’t be alive if it weren’t for me! That’s the ironic thing. Warthrop owes his life to me, and you’re going to take mine for the debt!”\u003c/p\u003e\n\u003cp\u003e“Owes you his life,” Torrance echoed.\u003c/p\u003e\n\u003cp\u003e“Yes, his life. They wanted to kill him. Wanted to kill both of us. But I put a stop to it. I stopped them—”\u003c/p\u003e\n\u003cp\u003e“‘Them,’” said Torrance.\u003c/p\u003e\n\u003cp\u003e“No, no, please. I can’t tell you that.”\u003c/p\u003e\n\u003cp\u003e“‘They wanted to kill him.’”\u003c/p\u003e\n\u003cp\u003e“They’ll kill me. They will hunt me down like a dog and they—”\u003c/p\u003e\n\u003cp\u003eR\u003d\"1em\"16;They.’”\u003c/p\u003e\n\u003cp\u003e“Listen to me!” Arkwright screeched. His eyes were darting back and forth—to me, to Torrance, to me again, back to Torrance. To whom should he appeal? The child who had composed this play, or the actor who was performing it? “If I tell you that, I’m a dead man.”\u003c/p\u003e\n\u003cp\u003e“You’re a dead man if you don’t.”\u003c/p\u003e\n\u003cp\u003eThe lady or the tiger. Perhaps the analogy was not so poor after all.\u003c/p\u003e\n\u003cp\u003eI could contain myself no longer. “Where is Dr. Warthrop?” I blurted out.\u003c/p\u003e\n\u003cp\u003eHe told us, and the answer held no meaning for me. I had never heard of the place, but Torrance had. He stared at Arkwright for a long moment, and then burst into laughter.\u003c/p\u003e\n\u003cp\u003e“Well… all right, then! I like it. It’s… Well, it’s crazy. But it also makes some sense. Inclines me toward some skeptical belief, Arkwright.”\u003c/p\u003e\n\u003cp\u003e“Good! And now you know where he is and you’re letting me go. Aren’t you?”\u003c/p\u003e\n\u003cp\u003eBut Torrance had not finished thinking it through. He had reached the crux of it, the two identical doors.\u003c/p\u003e\n\u003cp\u003e“‘They,’ you said. ‘They wanted to kill him.’ There was Kearns and you and them. Or was it Kearns and you, and then them?”\u003c/p\u003e\n\u003cp\u003e“I don’t even know what you’re saying. Oh, Christ help me!” His eyes rolled in my direction. “Christ, help me,” he whispered desperately.\u003c/p\u003e\n\u003cp\u003eI thought I understood, and stepped in as Torrance’s interpreter. “How do you know John Kearns?”\u003c/p\u003e\n\u003cp\u003e“I don’t know John Kearns from Adam. Never met him, never saw him before, and never heard of him before this bloody business began. And I wish I never had!”\u003c/p\u003e\n\u003cp\u003e“Got it!” Torrance shouted. “It’s Kearns, then them, and then you. Not you and Kearns—not you with Kearns. You’re not with Kearns, and you’re not with them. You’re with…” He stamped his foot. I was reminded of a rambunctious stallion eager to be free of his stall. “Servant to the Crown… Servant to the Crown! I get it now. That’s good.”\u003c/p\u003e\n\u003cp\u003eAll was still then. Even the dust seemed to pause in its fitful ballet. There was Arkwright in his chair and Torrance standing behind him and me against the wall, and there was the lamplight and the nidus and the spatula, and, glistening on the spatula, pwdre ser, the rot of stars that made men rot, and inside each of us das Ungeheuer, the thing unwinding that whispers I AM with the force to break the world in half, the thing in you and the thing in me, the thing in Thomas and the thing in Jacob wall, o doors, two for each of us.\u003c/p\u003e\n\u003cp\u003eJacob chose his door first, reaching down and untying the ropes that bound the hands of Thomas, and Thomas in the chair shivered like a man who opens the front door of his warm house on a cold morning. Jacob chose his door and freed Thomas’s hands, and after he had freed his hands and Thomas knew the bracing wind on his face, the blast that meant he was free, that he’d endured, Jacob yanked back Thomas’s head, and Thomas howled, and his hands came up, but it was too late because Jacob had opened the door; the door was flung wide, and into Thomas’s mouth went the spatula, to the back of his throat, and Thomas gagged.\u003c/p\u003e\n\u003cp\u003eTorrance stepped back as Arkwright went forward, fighting desperately to stand, but his legs were still bound to the chair and he pitched forward onto the cold floor, and his screams were inhuman slaughterhouse screeches. He scuttled across the floor, the chair’s back pushing his chest down and scraping back and forth as he legs jerked and pulled against the ropes, and then he stopped, his back arched, and he emptied his stomach.\u003c/p\u003e\n\u003cp\u003eWhat came next could not have lasted more than a minute:\u003c/p\u003e\n\u003cp\u003e“Will! Will!” Torrance shouted.\u003c/p\u003e\n\u003cp\u003eA slap across my cheek, hard enough to rock me back on my heels.\u003c/p\u003e\n\u003cp\u003e“Get. Out. NOW.”\u003c/p\u003e\n\u003cp\u003eI skittered around Arkwright’s heaving form.\u003c/p\u003e\n\u003cp\u003eSobs and curses were trapped between the chamber walls, echoes smashing against answering echoes, pummeling me, the sound of the world breaking in half. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-isle-of-blood-the-monstrumologist-3/page-27.html","bookId":2548,"creation":"Oct 6, 2019 12:20:15 AM","modification":"Oct 6, 2019 12:20:15 AM"}
