{"id":103822,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“We can’t do this on our own,” Seichan said, striding fast next to him. “A guarded camp ahead of us, mercenary soldiers behind us—not great odds.”\u003c/p\u003e\n\u003cp\u003eGray had already come to the same conclusion. He had to trust his gut that Amanda was here, that there was a reason for such lethal and overt reaction to their presence in the mountains. He shifted his shoulder pack and removed his satellite phone.\u003c/p\u003e\n\u003cp\u003eIt was time to call in the cavalry.\u003c/p\u003e\n\u003cp\u003eThat meant reaching Washington.\u003c/p\u003e\n\u003cp\u003eGray dialed up Sigma command, hoping the quantum encryption built into the phone would keep the call from reaching the wrong ears. After a long moment and a series of passwords, he heard a familiar voice.\u003c/p\u003e\n\u003cp\u003e“Commander Pierce.”\u003c/p\u003e\n\u003cp\u003eGray let out a hard breath of relief. “Director, I believe we’ve found where Amanda was taken. I’m not sure she’s still here, but as a precaution, we should mobilize SEAL Team Six to my coordinates, so they’re ready when—”\u003c/p\u003e\n\u003cp\u003e“Already done,” Painter said, cutting him off. “I got approval from the defense secretary a few minutes ago. The SEAL team is en route to your position with orders to engage only if the president’s daughter is positively identified. They’re about forty minutes out.”\u003c/p\u003e\n\u003cp\u003eForty minutes? That may be too late.\u003c/p\u003e\n\u003cp\u003eConfirming this, the roar of engines in the distance grew steadily louder. Amanda didn’t have forty minutes.\u003c/p\u003e\n\u003cp\u003eA disconcerting question rose in Gray’s mind. “Director, how do you know our position?”\u003c/p\u003e\n\u003cp\u003e“We’ve been monitoring your progress for the past half-hour.”\u003c/p\u003e\n\u003cp\u003eHow?\u003c/p\u003e\n\u003cp\u003eGray searched around him, then saw Tucker send his shepherd running ahead, hugging the forest’s edge.\u003c/p\u003e\n\u003cp\u003eKane …\u003c/p\u003e\n\u003cp\u003eTucker must have left his dog’s camera running since the roadblock.\u003c/p\u003e\n\u003cp\u003e“It was Kat’s idea,” Painter explained.\u003c/p\u003e\n\u003cp\u003eOf course it was. If anyone had the brains to find them without raising an alarm, it was Kat Bryant. She had proved countless times to be an elusive and crafty spider when it came to the intelligence web.\u003c/p\u003e\n\u003cp\u003e“Kat set up a passive search algorithm, set to the wireless frequency of the dog’s camera. Nothing that would trigger any alarm bells. We could watch over your shoulders without giving away your location.”\u003c/p\u003e\n\u003cp\u003eGray was grateful for the covert support, but it also made him vaguely uneasy. In the future, he’d have to make sure to circumvent that ability if he wanted total privacy.\u003c/p\u003e\n\u003cp\u003e“Audio is bad, though,” Painter finished. “Cuts in and out, so keep that in mind. We can see you, but not always hear you.”\u003c/p\u003e\n\u003cp\u003e“Got it.”\u003c/p\u003e\n\u003cp\u003eAhead, Tucker came running back toward him.\u003c/p\u003e\n\u003cp\u003eThat had to mean trouble.\u003c/p\u003e\n\u003cp\u003e“Have to sign off,” Gray said.\u003c/p\u003e\n\u003cp\u003ePainter’s voice went hard. “I can see why. Go. But be—”\u003c/p\u003e\n\u003cp\u003eGray cut him off before he could warn him to be careful.\u003c/p\u003e\n\u003cp\u003eIt didn’t need to be said—shouldn’t be said. It was like wishing an actor good luck instead of break a leg.\u003c/p\u003e\n\u003cp\u003eTucker came up, breathing hard. “Another Land Rover is blocking the road ahead, counted six men around it. Another handful in the camp.” A worried frown creased his face. “Look at this.”\u003c/p\u003e\n\u003cp\u003eTucker held up his phone, displaying a dog’s-eye view of the facility.\u003c/p\u003e\n\u003cp\u003eA large tent-cabin, raised on pilings, stood in the middle of a cold camp. Around it, ash pits marked old bonfires. Garbage, rusted stakes, oil stains, along with a few collapsed tents, abandoned in haste, were all that was left of a large campsite. A few shreds of camouflage netting still draped from the trees at the forest’s edge, but that was it.\u003c/p\u003e\n\u003cp\u003e“Looks like most of the camp bugged out already,” Tucker said. “I’d say no longer than an hour ago.”\u003c/p\u003e\n\u003cp\u003eGray felt the pit of his stomach opening to despair.\u003c/p\u003e\n\u003cp\u003eWere they already too late?\u003c/p\u003e\n\u003cp\u003e“But I did see shadows moving inside that cabin,” Tucker offered. “Someone’s still there.”\u003c/p\u003e\n\u003cp\u003eSeichan overheard. “Maybe they left their victim here, fearing reprisals, and scattered.”\u003c/p\u003e\n\u003cp\u003eGray grasped at this thin hope.\u003c/p\u003e\n\u003cp\u003eKowalski joined them. “So, what are we doing?”\u003c/p\u003e\n\u003cp\u003eJain stood at his shoulder, bearing the same question on her face.\u003c/p\u003e\n\u003cp\u003eThey needed a plan from here.\u003c/p\u003e\n\u003cp\u003eHe ran various scenarios in his head. “We can’t risk panicking the remaining soldiers. We also don’t want to needlessly expose ourselves to the enemy combatants if Amanda has already been moved. We’ll do her no good dead.”\u003c/p\u003e\n\u003cp\u003e“Then what?” Kowalski asked.\u003c/p\u003e\n\u003cp\u003eGray turned his focus upon Tucker. “We need to see inside that cabin.”\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eJuly 2, 3:24 P.M. East Africa Time\u003c/p\u003e\n\u003cp\u003eCal Madow mountains, Somalia\u003c/p\u003e\n\u003cp\u003eTucker lay on his belly with Kane at the edge of the forest. Forty yards of open space stretched between his position and the cabin. With men milling at the entry road and three more soldiers scavenging the grounds ahead for anything of value, any attempt to cross here would be readily spotted.\u003c/p\u003e\n\u003cp\u003eEven a dog on the run.\u003c/p\u003e\n\u003cp\u003eTucker stared through his rifle’s scope, studying the terrain. A lone soldier pushed a dented wheelbarrow past his field of view, stopping occasionally to pick something out of the discarded debris.\u003c/p\u003e\n\u003cp\u003eThe radio scratched in his ear. It was Kowalski, reporting in from his post down the road, acting as rear lookout. “Company has arrived. Trucks—three of ’em—are reaching the turnoff.”\u003c/p\u003e\n\u003cp\u003eGray responded on all channels. “Kowalski, rally back to our position.”\u003c/p\u003e\n\u003cp\u003eThe rest of the team—Gray and the two women—had crept forward through the forest and lay in wait several meters from the lone Land Rover that guarded the ruins of the camp. They all waited for Tucker’s signal. If Amanda was in the tent, they’d ambush the vehicle, trusting the element of surprise and the cover of the jungle to overcome the enemy’s superior odds. If Amanda wasn’t here, they’d all retreat into the woods and regroup.\u003c/p\u003e\n\u003cp\u003eGray spoke with a note of urgency. “Tucker, now or never.”\u003c/p\u003e\n\u003cp\u003e“Still, not clear,” Tucker whispered under his breath.\u003c/p\u003e\n\u003cp\u003eThirty yards away, the man with the wheelbarrow picked up a sleeveless DVD, judged it, then flung it away with a flip of his wrist.\u003c/p\u003e\n\u003cp\u003eIt seemed everyone was a critic.\u003c/p\u003e\n\u003cp\u003eKeep moving, asshole.\u003c/p\u003e\n\u003cp\u003e“Tucker,” Gray pressed, “the other trucks are turning and heading this way. You’ve got two minutes, or we have to start shooting and hope for the best.”\u003c/p\u003e\n\u003cp\u003eTucker stared at the AK-47 slung over the soldier’s shoulder as the man continued sifting through the debris.\u003c/p\u003e\n\u003cp\u003eI’m not going to send Kane out just to be killed.\u003c/p\u003e\n\u003cp\u003eTucker flashed back to that painful moment in Afghanistan. He again felt the pop of his ears as the rescue helicopter lifted off, felt the rush of hot air. He had been clinging to Kane, both bloodied by the firefight, by the exploded ordnance. But Tucker had never taken his eyes off Abel, his partner’s littermate, who’d knocked them both clear before the buried IED detonated. If Kane had been Tucker’s right arm, Abel was his left. He’d trained them both—but he’d never readied himself for this moment.\u003c/p\u003e\n\u003cp\u003eAbel raced below, limping on three legs, searching for an escape. Taliban forces closed in from all directions. Tucker strained for the door, ready to fling himself out, to go to his friend’s aid. But two soldiers pinned him, restraining him.\u003c/p\u003e\n\u003cp\u003eTucker yelled for Abel.\u003c/p\u003e\n\u003cp\u003eHe was heard. Abel stopped, staring up, panting, his eyes sharp and bright, seeing him. They shared that last moment, locked together.\u003c/p\u003e\n\u003cp\u003eUntil a flurry of gunfire severed that bond forever.\u003c/p\u003e\n\u003cp\u003eTucker’s grip tightened on his rifle now, refusing to forget that lesson. He had a small black paw print tattooed on his upper left shoulder, a permanent reminder of Abel, of his sacrifice. He would never waste another life like that, to send another dog to certain slaughter.\u003c/p\u003e\n\u003cp\u003e“I need a distraction,” he radioed back fiercely to Gray. “Something to pull attention away from here. Kane’ll get shot before he can get halfway to the cabin.”\u003c/p\u003e\n\u003cp\u003eThe answer to his desperate plea came from an unexpected location—from directly behind Tucker.\u003c/p\u003e\n\u003cp\u003e“I do it,” said a squeaky voice with the strain of forced bravery. “No want Kane shot.”\u003c/p\u003e\n\u003cp\u003eTucker rolled around in time to see Baashi dart away into the forest. Cursing under his breath, he radioed Gray. “Baashi followed us. Heard me. I think he’s going to do something stupid.”\u003c/p\u003e\n\u003cp\u003eKowalski responded, “See him. I’ll grab him.” Then, seconds later, defeat tinged his voice. “Kid’s a friggin’ jackrabbit.”\u003c/p\u003e\n\u003cp\u003eA shout cracked across the forest, coming from the direction of the narrow road. “ISKA WARAN!” Baashi called out. “HA RIDIN!”\u003c/p\u003e\n\u003cp\u003eTucker pictured him approaching the Land Rover, hands in the air.\u003c/p\u003e\n\u003cp\u003eA rapid exchange followed in Somali.\u003c/p\u003e\n\u003cp\u003eJain translated via the radio. “He’s telling them his mother is sick. He came a long way from his village to see the doctor here.”\u003c/p\u003e\n\u003cp\u003eTucker’s fingers tightened on the stock of his rifle. The three soldiers adrift in the camp moved toward the gate, drawn by the commotion. For better or worse, Tucker got his distraction.\u003c/p\u003e\n\u003cp\u003eHe reached and gave Kane a warm squeeze on his ear. They didn’t have time for their usual good-bye ritual.\u003c/p\u003e\n\u003cp\u003eWith a twinge of foreboding, he flicked his wrist, leaving a finger pointing toward the cabin.\u003c/p\u003e\n\u003cp\u003eKane took off like a shot, dashing low across the open field.\u003c/p\u003e\n\u003cp\u003e“DAAWO!” Baashi called out.\u003c/p\u003e\n\u003cp\u003e“He’s asking for medicine,” Jain said.\u003c/p\u003e\n\u003cp\u003eHe got something else.\u003c/p\u003e\n\u003cp\u003eA savage spat of gunfire burst forth.\u003c/p\u003e\n\u003cp\u003e3:26 P.M.\u003c/p\u003e\n\u003cp\u003eSeichan watched Baashi dance backward, dirt exploding in front of his toes. Laughter followed from the soldiers gathered in front of the Land Rover, enjoying their sport.\u003c/p\u003e\n\u003cp\u003eA hard man with a jagged scar splitting his chin and turning his lower lip into a perpetual scowl waved the others to silence and sauntered with the haughtiness of a reigning conqueror. He had his helmet tilted back, his flak jacket open. He rested a palm on a holstered pistol as he approached Baashi, who cowered, half-bowed under the other’s gaze. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-23.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
