{"id":103825,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe two men exited, but not before Duncan poked a finger into Painter’s chest. “I want a report on my desk within the hour.” He waved to the monitor. “And a copy of this feed. I want a full accounting of this tragedy … every detail on how this all went to hell.”\u003c/p\u003e\n\u003cp\u003eThe two men exited, leaving Painter alone in the conference room.\u003c/p\u003e\n\u003cp\u003eOn the monitor, the smoke cleared. Gray’s face swelled into the camera. His lips moved, but the audio was still down. Then Gray stepped back and lifted a bit of burned fabric into view. He had written something on it.\u003c/p\u003e\n\u003cp\u003eAs Painter read the scribbled words, he stumbled forward in disbelief. He caught himself on the edge of the table.\u003c/p\u003e\n\u003cp\u003eHow could this be?\u003c/p\u003e\n\u003cp\u003eHe stared toward the door, ready to run out, to call the others back. He even took a step in that direction—then stopped, his mind working furiously, running various permutations through his head.\u003c/p\u003e\n\u003cp\u003eHe covered his mouth with his hand.\u003c/p\u003e\n\u003cp\u003eThere remained too many variables, too much unknown and unexplained. The truth revealed on the screen was too valuable to release without thought. But it was also a cruelty beyond words to remain silent.\u003c/p\u003e\n\u003cp\u003eStill, he slowly turned to the table, picked up the remote control, and switched off the monitor. He would have to edit away this last bit of video before he handed it off to Warren Duncan.\u003c/p\u003e\n\u003cp\u003eHe stared at the dark monitor, judging if he was capable of doing this. But his job was to make the hard decisions, no matter who got hurt. And this was one of the hardest.\u003c/p\u003e\n\u003cp\u003eHe pictured Teresa dissolving into despair and grief; he heard again her scream of denial, her railing against what could not be true.\u003c/p\u003e\n\u003cp\u003eIn the end, the First Lady had been right.\u003c/p\u003e\n\u003cp\u003eThough the monitor was off, Gray’s last message still burned in his mind’s eye.\u003c/p\u003e\n\u003cp\u003eGod, forgive me.\u003c/p\u003e\n\u003cp\u003eNo one must know.\u003c/p\u003e\n\u003cp\u003e17\u003c/p\u003e\n\u003cp\u003eJuly 2, 3:48 P.M. East Africa Time\u003c/p\u003e\n\u003cp\u003eAirborne\u003c/p\u003e\n\u003cp\u003eHer senses returned like a bright light that slowly pooled outward, watery at the edges. She felt as if she were a swimmer rising from the depths of a black sea. Faces hovered over her. Voices spoke, muffled and indistinct. Her throat hurt, her tongue was dry, which made it hard to swallow.\u003c/p\u003e\n\u003cp\u003e“… Coming around,” a familiar voice said in a German-Swiss accent.\u003c/p\u003e\n\u003cp\u003eShe made out the severe blond bob, the icy eyes.\u003c/p\u003e\n\u003cp\u003ePetra.\u003c/p\u003e\n\u003cp\u003eThe horror of her situation swelled through her again, sharpening her senses as she surfaced into the cold, hard reality of the moment.\u003c/p\u003e\n\u003cp\u003eAnother face leaned over her. A bright light flashed into her eyes, stinging, searing into the back of her skull. She shied away, turning her head.\u003c/p\u003e\n\u003cp\u003eShe lay in a shallow box, cushioned all around. She heard the drone of jet engines, felt the vibration of flight.\u003c/p\u003e\n\u003cp\u003e“Pupillary response is good,” Dr. Blake said. “She’s tolerating the sedation well. What about the fetus, Petra?”\u003c/p\u003e\n\u003cp\u003e“Heartbeat and oxygenation continue to remain within normal parameters, doctor. With the wireless transmission from the fetal monitor around her midsection, we’ll be able to assess her condition from a distance after we land.”\u003c/p\u003e\n\u003cp\u003e“How long is the flight?”\u003c/p\u003e\n\u003cp\u003e“Another three hours.”\u003c/p\u003e\n\u003cp\u003eDr. Blake’s face pulled away. “No need to revive her fully, then. For now, keep her lightly sedated with a propofol drip. We can send her deeper once we’re in final approach to land.”\u003c/p\u003e\n\u003cp\u003e“We should also allow at least fifteen minutes to secure the royal diplomatic seals around the coffin.”\u003c/p\u003e\n\u003cp\u003eCoffin?\u003c/p\u003e\n\u003cp\u003eAmanda turned her watery focus to the pillowed sides of the box. Fear spiked through her.\u003c/p\u003e\n\u003cp\u003e“You’re right, Petra. Even with all the palms and wheels greased by our benefactors, we don’t want any trouble going through customs with the casket. Luckily everyone now believes she’s dead.”\u003c/p\u003e\n\u003cp\u003eDead?\u003c/p\u003e\n\u003cp\u003eBlake continued, “So no one will be looking for her. With everyone off our backs, we’ll finally have the time to deliver this baby safely. In another couple of hours, it will be good to wash the stink of the jungle off and return to a proper medical lab.” Footsteps retreated. “I’m going to the cabin bar. Can I get you a drink?”\u003c/p\u003e\n\u003cp\u003e“Water, with a sliver of lime.”\u003c/p\u003e\n\u003cp\u003e“Always the professional, Petra,” he scolded with an amused tone. “Stop fretting. We’ll have the package delivered by nightfall. Then maybe you’ll relax.”\u003c/p\u003e\n\u003cp\u003ePetra’s face loomed larger, her breath smelling of cinnamon and cigarette smoke. “I’ll relax once we have her fetus on the vivisection table at the lab.”\u003c/p\u003e\n\u003cp\u003e“I keep forgetting that’s your specialty, my dear. I thought I was skilled with scalpel and forceps … but you put me to shame with your ability to tease a body into so many perfect anatomical sections.”\u003c/p\u003e\n\u003cp\u003e“That’s the easy part,” Petra said, straightening up.\u003c/p\u003e\n\u003cp\u003e“Of course.” A small laugh accompanied his words. “Where you truly shine is how you keep those sections alive.”\u003c/p\u003e\n\u003cp\u003eAlive?\u003c/p\u003e\n\u003cp\u003eWhat did they mean? What were they talking about?\u003c/p\u003e\n\u003cp\u003eAmanda tried not to picture such a horror, but it filled her head anyway. She wanted to clamp her hands over her ears. She had known her baby was under threat—it was why she had fled the States—but she never imagined anything as horrific as this. It went beyond her worst nightmares.\u003c/p\u003e\n\u003cp\u003eI don’t want to hear any more.\u003c/p\u003e\n\u003cp\u003eHer silent plea was answered.\u003c/p\u003e\n\u003cp\u003eThe creak of hinges rasped to the left. A dark shadow rose and fell heavily over her, shutting out all light and sound. The lid of her coffin had been closed.\u003c/p\u003e\n\u003cp\u003eAmanda shuddered in the blackness, praying that this casket truly became her coffin, that she’d suffocate before they landed. Better that than allowing her baby boy to suffer the atrocities planned for him.\u003c/p\u003e\n\u003cp\u003e… how you keep those sections alive …\u003c/p\u003e\n\u003cp\u003eThose dismaying words haunted the darkness—along with an all-consuming question.\u003c/p\u003e\n\u003cp\u003eWhere are they taking me?\u003c/p\u003e\n\u003cp\u003e4:00 P.M.\u003c/p\u003e\n\u003cp\u003eCal Madow mountains, Somalia\u003c/p\u003e\n\u003cp\u003e“She was definitely being held at the camp here,” Gray said, holding the satellite phone to his ear, reporting in to Sigma command. “Tucker’s dog confirmed Amanda’s scent before all hell broke loose.”\u003c/p\u003e\n\u003cp\u003eHis choice of words was appropriate. He stared at the smoldering wreck of the cabin, at the fiery remains of the two Rovers. His other teammates were making sure no other enemy combatants remained a threat. Captain Alden’s helicopter rested across the way, engine idling, rotors turning slowly. A British medic from Alden’s rescue crew worked on Jain’s leg.\u003c/p\u003e\n\u003cp\u003eKowalski looked on, concerned. Despite the differences in size and gender, the pair were two peas out of the same pod. A scary proposition. A female Kowalski.\u003c/p\u003e\n\u003cp\u003eGray had retrieved the satellite phone from the big man’s pack. He didn’t know if Painter had received his frantic handwritten note and wanted to follow up as quickly as possible.\u003c/p\u003e\n\u003cp\u003e“But why do you want to keep Amanda’s survival a secret?” Gray asked, questioning again the need for such a cruel deception. “I understand the fear of an intelligence leak. But to keep the president and his family in the dark … it must be killing them.”\u003c/p\u003e\n\u003cp\u003e“It is, but the administration—if they suspect she’s still alive—will insist on bringing all forces to bear in finding her. And look how that turned out this time around. For Amanda’s sake, we’ve got to restrict this knowledge to as few ears as possible.”\u003c/p\u003e\n\u003cp\u003eGray took a deep breath. It was a ballsy move on the director’s part, but it made brutal sense, especially in light of his own suspicions. He shared them with Painter. “Director, I’m almost certain that events here were purposefully staged to make it look like Amanda was killed.”\u003c/p\u003e\n\u003cp\u003e“Why do you think that?” Painter asked.\u003c/p\u003e\n\u003cp\u003e“The woman in the bed. She was blond, the same size and body shape as Amanda. From the distension of the uterus and belly, she was obviously once pregnant, possibly an equal number of weeks along. But more incriminating, when I removed the oxygen mask, I saw her mouth was a bloody ruin. Someone didn’t want Amanda’s dental records pulled to identify the charred remains.”\u003c/p\u003e\n\u003cp\u003ePainter remained silent, digesting the information.\u003c/p\u003e\n\u003cp\u003e“Even the rushed C-section suggests the same conclusion,” Gray said. “I think they feared any fetal remains might not match those on record from Amanda’s prenatal exams.”\u003c/p\u003e\n\u003cp\u003ePainter’s voice grew hushed at the horror of it all. “So they cut out the baby.”\u003c/p\u003e\n\u003cp\u003e“Exactly. And disposed of it to cover their tracks. I also smelled an accelerant soaked into the bed. I think that’s what the last soldier was doing here, prepping the remains. They wanted to assure the body was burned so thoroughly that no DNA could be extracted. But we caught them off guard before they could complete their task.”\u003c/p\u003e\n\u003cp\u003e“Why would Amanda’s kidnappers go through such effort?” Painter asked, but it sounded more like he was pondering the question, thinking out loud.\u003c/p\u003e\n\u003cp\u003eStill, Gray answered. “They obviously wanted to throw off anyone still looking for her. If the world thinks she’s dead, the hunt ends here.”\u003c/p\u003e\n\u003cp\u003e“True. But I fear our enemy is even smarter than that.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Think about it. They knew you were closing in, forcing their hand. They had to move her, but they turned the situation to their own ends. Staging Amanda’s death—but also achieving another goal.”\u003c/p\u003e\n\u003cp\u003eGray’s mind raced alongside the director’s line of reasoning. He knew everything that had befallen Painter at the White House. He suddenly understood. “The enemy was able to blame Amanda’s death on our operation.”\u003c/p\u003e\n\u003cp\u003e“At least partially.”\u003c/p\u003e\n\u003cp\u003eAs Gray considered who might have such an end goal, his blood went cold. There was only one organization harboring such a vendetta against Sigma.\u003c/p\u003e\n\u003cp\u003e“Director, are you suggesting the Guild is somehow involved in Amanda’s kidnapping?”\u003c/p\u003e\n\u003cp\u003eGray felt his vision narrowing, picturing his mother’s casket lowering into the cold dirt.\u003c/p\u003e\n\u003cp\u003e“Commander Pierce, we don’t know that for certain. But either way, it gives Sigma a black eye—if not a fatal blow.” \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-26.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
