{"id":103833,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJason glanced up at him, his eyes surprised. “How did you know? What does the president’s family—?”\u003c/p\u003e\n\u003cp\u003ePainter cut him off and leaned closer. “Rotate that schematic to get a bird’s-eye view of the island.”\u003c/p\u003e\n\u003cp\u003eJason manipulated a toggle to swerve the view up and over the star-shaped island, to look down upon that crimson corporate tide. The kid whistled appreciatively.\u003c/p\u003e\n\u003cp\u003e“Amazing,” Jason exclaimed. “The pattern forms a perfect cross atop the island.”\u003c/p\u003e\n\u003cp\u003e“A Templar cross,” Painter mumbled, picturing the symbol he’d studied only days ago, the mark of the Guild.\u003c/p\u003e\n\u003cp\u003eDoubt evaporated inside him.\u003c/p\u003e\n\u003cp\u003eThe Gants are the Guild.\u003c/p\u003e\n\u003cp\u003eAnd Gray’s team was sailing blindly toward their newest stronghold.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eJuly 3, 1:20 A.M. Gulf Standard Time\u003c/p\u003e\n\u003cp\u003eDubai City, UAE\u003c/p\u003e\n\u003cp\u003eGray led the others down a long dock that cut through the center of a massive marina. A full moon and the blaze of Dubai’s skyline turned night to day here, while jazz music tinkled across the water from an open-air nightclub. A soft breeze blew gently off the sea, cooling the warm night and smelling of ocean salt and diesel fuel.\u003c/p\u003e\n\u003cp\u003eThe tiny harbor lay at the tip of the man-made island of Palm Jumeirah. They were to meet their escort at a berth in a remote section of the marina, where fewer eyes were likely to pry.\u003c/p\u003e\n\u003cp\u003eTo Gray’s left, the giant trunk of the artificial palm-shaped island stretched two kilometers to shore, sparkling in the night with hotels and residences, divided by an eight-lane motorway. He hadn’t appreciated the sheer magnitude of this archipelago until here on its shores. Each engineered palm frond was a mile long, lined by villas and mansions. And to his right, across the water from the marina, stretched the seven-mile-long breakwater crescent, turned into a playground of hotels and water parks. And two more palm projects were in development, each bigger than the next; the largest would be seven times the size of Palm Jumeirah.\u003c/p\u003e\n\u003cp\u003eAnother of Gray’s party was also fixated by the enormousness of everything in Dubai.\u003c/p\u003e\n\u003cp\u003e“I guess size does matter,” Kowalski said, gaping at the mega-yacht docked at the upcoming berth. It had its own helicopter tied down at the stern, and it wasn’t even the biggest boat here. “Somebody’s compensating for something, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003eSeichan strode alongside him. “We all know what you mean, Kowalski—it’s why none of us have commented on those cigars you keep sucking on.”\u003c/p\u003e\n\u003cp\u003eHe took out his stogie and frowned at her. “Whatcha talking about?”\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003eTucker bent down and unclipped Kane from his leash. The shepherd, freed at last, trotted ahead, nose in the air, tail high. The dog had been confined to a leash while in Dubai, not the most dog-friendly city, but out here in the marina at this late hour, no one was around to complain.\u003c/p\u003e\n\u003cp\u003eHis handler hung behind them, lost in his own thoughts.\u003c/p\u003e\n\u003cp\u003eGray followed Kane down the dock. The number of empty berths grew as they neared the end, leaving the opulence and grandiosity of modern Dubai behind. Moonlight shone off the dark water ahead, no longer competing with the reflected dazzle of the city’s towers and playgrounds. A slight breeze took the edge off of the warm night. Looking out to sea, with stars twinkling and with the call to prayer echoing hauntingly from the shoreline, it was easy to get transported back to another time, to the medieval era of Ali Baba and lost desert kingdoms. Despite the excesses and extravagances of Dubai, the ancient world still glimmered through the cracks, a shimmering mirage of past glories.\u003c/p\u003e\n\u003cp\u003e“About time you all got here,” a voice called out of the shadows of the next berth. The only evidence of his presence was the smoldering tip of a cigar. The figure stepped into a pool of light cast by a pole lamp. He wore a pair of black Bermuda shorts, flip-flops, and an unbuttoned white shirt.\u003c/p\u003e\n\u003cp\u003eOn edge, Gray searched to make sure the man was alone. Kane seemed to have no such qualms. The dog ran forward and greeted the newcomer warmly, bouncing a bit on his front legs.\u003c/p\u003e\n\u003cp\u003e“Stay down, Kane,” Tucker warned.\u003c/p\u003e\n\u003cp\u003e“I don’t mind him at all.” The man leaned over and gave the dog a vigorous rub. “Reminds me of my old dog Elvis. He was a shepherd, too. German, that is. What’s this boy?”\u003c/p\u003e\n\u003cp\u003e“Kane’s a Belgian shepherd,” Tucker said. “A Malinois.”\u003c/p\u003e\n\u003cp\u003e“Hmm. War dog, I’m guessing.”\u003c/p\u003e\n\u003cp\u003e“That’s right. Army. Retired.”\u003c/p\u003e\n\u003cp\u003e“If you don’t mind me asking, what was Kane’s rank?”\u003c/p\u003e\n\u003cp\u003e“Major.”\u003c/p\u003e\n\u003cp\u003eKowalski glanced at Tucker. “Wait? Major Kane? Your dog outranked you?”\u003c/p\u003e\n\u003cp\u003eGray knew that wasn’t unusual. A military dog always ranked one level higher than its handler, so any abuse was a court-martial offense. Not that Tucker would ever harm his partner.\u003c/p\u003e\n\u003cp\u003eStraightening, the man thrust a hand toward Gray. “Jack. Jack Kirkland.”\u003c/p\u003e\n\u003cp\u003eIntroductions followed all around.\u003c/p\u003e\n\u003cp\u003eTheir escort stood over six feet, with salt-and-pepper hair. From the scarring down one side of his body, he’d seen some action in the past. The man also carried his rugged, ageless masculinity with a boyish grace—even Seichan was struck by it.\u003c/p\u003e\n\u003cp\u003eGray had never seen her so enthralled. He heard her giggle at something the man said. Seichan never giggled. It slightly pissed him off. A reaction that caught him by surprise. In a matter of minutes, the man had charmed everyone on his team.\u003c/p\u003e\n\u003cp\u003eOr almost everyone.\u003c/p\u003e\n\u003cp\u003eKowalski shook his hand. “What’re you smoking?”\u003c/p\u003e\n\u003cp\u003eJack glanced at the cigar balanced in his fingers. “Cuban. El Presidente.”\u003c/p\u003e\n\u003cp\u003e“Oh, man …” Kowalski stared at his own stogie, disappointed.\u003c/p\u003e\n\u003cp\u003e“I’ve got a whole case aboard the Ghost.” Jack nodded his chin in the direction of the dark berth. “I’m sure I wouldn’t miss one if it happened to grow legs and walk away.”\u003c/p\u003e\n\u003cp\u003eJack headed off in that direction.\u003c/p\u003e\n\u003cp\u003eKowalski stayed put. “That guy really gets me.”\u003c/p\u003e\n\u003cp\u003eGray shook his head.\u003c/p\u003e\n\u003cp\u003eOkay, now I’ve lost everyone.\u003c/p\u003e\n\u003cp\u003eSeichan sidled up to Gray, brushing his shoulder and leaning closer. “Wow.”\u003c/p\u003e\n\u003cp\u003eThat one word pretty much summarized the man.\u003c/p\u003e\n\u003cp\u003eGray sighed and followed Jack toward the berth. No wonder Painter was so hesitant to drag this guy back into his life. If I were Painter, I wouldn’t want Jack within a thousand nautical miles of Lisa.\u003c/p\u003e\n\u003cp\u003eAt least, the man was wearing a wedding ring.\u003c/p\u003e\n\u003cp\u003e“Here she is,” Jack said, stopping ahead. “My new pride and joy. The Ghost.”\u003c/p\u003e\n\u003cp\u003eGray didn’t see anything moored in the neighboring berth.\u003c/p\u003e\n\u003cp\u003eJack leaped from the dock, as if to plunge into the water, but he landed on a firm surface. Only then did Gray appreciate the docked vessel as it rocked under the man’s weight. Even still, it was hard to discern its presence against the dark water.\u003c/p\u003e\n\u003cp\u003eThe submersible’s bulk remained below the waterline. Only a conning-tower-like hatch protruded above the surface and a fraction of its upper deck. What made it so hard to discern, what made it blend so well with the water, was that it appeared to be sculpted out of glass.\u003c/p\u003e\n\u003cp\u003eJack tapped his toe against the clear surface. “Her shell’s made out of a new borosilicate polymer, strong as steel yet with a low refractive index, perfect for underwater viewing. And the deeper you go, the harder the glass becomes. Up to a point, of course. I’m not planning on testing that limit today.”\u003c/p\u003e\n\u003cp\u003e“I see why you call it the Ghost,” Seichan said.\u003c/p\u003e\n\u003cp\u003e“She’s my new love—comes with all the bells and whistles a guy could want.” He ticked them off proudly. “The latest sonar and communications equipment, fly-by-wire joystick, electronic buoyancy controls, expanded air supply. But what really gets me purring is her sexy curves. I designed her after the old X-1 mini-submarines. Sleek, fast, and seductive.”\u003c/p\u003e\n\u003cp\u003eKowalski snorted at the hyperbole. “Do you need a moment alone with her?”\u003c/p\u003e\n\u003cp\u003e“Do you still want that cigar?” Jack countered.\u003c/p\u003e\n\u003cp\u003eKowalski hung his head a bit. “Sorry, I should know better than to insult another guy’s girl. She’s sexy. Very, very sexy.”\u003c/p\u003e\n\u003cp\u003e“That’s more like it,” Jack encouraged with a huge, bawdy grin. “C’mon aboard. Let’s get you all settled. We have a bit of a jaunt to reach Utopia, but then again, whoever said getting into heaven was easy?”\u003c/p\u003e\n\u003cp\u003eIgnoring the man’s joviality, Gray stared toward the horizon, unable to shed his dark mood, knowing Amanda was not having this much fun.\u003c/p\u003e\n\u003cp\u003e1:30 A.M.\u003c/p\u003e\n\u003cp\u003eThe next contraction wracked her body.\u003c/p\u003e\n\u003cp\u003eAmanda sobbed, tears streaming down her heated face. Waves of nausea swept through her. Sweat soaked her gown to her skin. The worst of the pain was dulled by the miniepidural they’d given her, but not all of it.\u003c/p\u003e\n\u003cp\u003e“Dilated eight centimeters,” Petra reported from between her legs.\u003c/p\u003e\n\u003cp\u003e“Right on schedule.” Dr. Blake stood at her bedside, evaluating a labor monitor. “That was a good contraction. But I’m pushing another bolus of pit.”\u003c/p\u003e\n\u003cp\u003ePit was slang for pitocin, a labor-inducing drug.\u003c/p\u003e\n\u003cp\u003eHe injected the medicine into her IV line, then turned his attention to Amanda. He took her hand, which was strapped in place to the bed, and gave her fingers a squeeze.\u003c/p\u003e\n\u003cp\u003e“Would you like some more ice chips?”\u003c/p\u003e\n\u003cp\u003eFury cut through her. She dug her nails into the tender flesh of his wrist. “Fuck you,” she spat at him. She never swore, but it felt good to do so now. “You goddamned monster.”\u003c/p\u003e\n\u003cp\u003e“I’ll get you some ice chips,” he said, unfazed by her outburst. He gently but firmly freed his arm, then patted her hand. “Everything’s going well. You’re doing great.”\u003c/p\u003e\n\u003cp\u003eOther medical staff worked at the periphery, monitoring vitals, trading out dirty linens that she’d soiled, dragging in equipment. A pair off to the side were preparing a radiant warming crib in anticipation of the newborn’s arrival.\u003c/p\u003e\n\u003cp\u003eBlake returned with a tiny paper cup full of crushed ice chips. He lifted it to her lips. But she turned her head away, refusing to cooperate in even this small measure.\u003c/p\u003e\n\u003cp\u003eShe willed her body to resist, too.\u003c/p\u003e\n\u003cp\u003eI won’t let them have my boy. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-35.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
