{"id":103837,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHer skin still stung.\u003c/p\u003e\n\u003cp\u003eKat had noticed welts on the other inmate’s arms and legs.\u003c/p\u003e\n\u003cp\u003eBastard.\u003c/p\u003e\n\u003cp\u003eRoy snapped his baton off his belt and, with an expert flip of his wrist, extended the weapon to its full length, likely compensating for shortcomings elsewhere.\u003c/p\u003e\n\u003cp\u003e“There’s not going to be any trouble, is there?” Roy sneered in her ear.\u003c/p\u003e\n\u003cp\u003eShe gritted her teeth and hung her head.\u003c/p\u003e\n\u003cp\u003e“That’s more like it.” He rested the baton on her shoulder as he leaned down and undid her cuffs. “Stand up. Keep your hands behind you.”\u003c/p\u003e\n\u003cp\u003eShe obeyed, her head spinning slightly from the aftereffects of the drugs. Cold air blew through the slitted back of her hospital gown as she turned to face Roy. She kept her hands behind her.\u003c/p\u003e\n\u003cp\u003eRoy reached the tip of his baton under her chin, forcing her head up. “That’s more—”\u003c/p\u003e\n\u003cp\u003eKat whipped her arm around and grabbed the baton, yanking it toward her. Roy, caught off guard, got pulled closer. She swung her other arm wide, silver flashing in her fist. She drove the knife into his throat, below the larynx, severing the trachea.\u003c/p\u003e\n\u003cp\u003eRoy’s eyes stared at her, stunned, gurgling, unable to scream—but she understood his silent question.\u003c/p\u003e\n\u003cp\u003eHow?\u003c/p\u003e\n\u003cp\u003eShe answered him in a hiss. “Because this cat has claws.”\u003c/p\u003e\n\u003cp\u003eKat twisted the combat dagger hard. Blood sprayed a full yard across the spotless vinyl floor. In seconds, he bled out, and she let his body tumble to the floor.\u003c/p\u003e\n\u003cp\u003eShe wiped the blade on his clothes and folded it closed. When Roy had first tossed her into the cell, waiting for the sedatives to wear off before stripping her and taking away her clothes, she had fought through the fog, freed her left shoe, and removed the folded combat dagger concealed in the sole. She left the lock pick hidden in her right shoe; unfortunately, her cell door did not offer access to the keyhole outside. As she put her shoe back on, she hid the blade under a fold of the blanket.\u003c/p\u003e\n\u003cp\u003eLater, when they had stripped her, examined her, and poked her full of needles, she waited until she had a moment alone, while putting on her hospital gown. Through the opening in the back, she slipped the folded dagger between her buttocks and held it clamped there—not the most seemly way to conceal a weapon, but sometimes a lady has to do what a lady has to do.\u003c/p\u003e\n\u003cp\u003eThen she had to wait for a time to get Roy alone.\u003c/p\u003e\n\u003cp\u003eShe knew she would have only the one chance.\u003c/p\u003e\n\u003cp\u003eTaking advantage of the moment, Kat worked fast and stripped Roy of his keys, electronic pass card, and baton. She rushed to the other cell and unlocked it.\u003c/p\u003e\n\u003cp\u003eThe young woman came staggering out, staring at the ruin of Roy’s body. “Thank you … my name’s Amy.”\u003c/p\u003e\n\u003cp\u003e“C’mon,” Kat said, encouraging her.\u003c/p\u003e\n\u003cp\u003eShe hurried across the ward toward the pile of her clothes and quickly pulled on her shorts, blouse, and shoes. She pocketed her dagger and handed the baton to Amy.\u003c/p\u003e\n\u003cp\u003eAmy squeezed the weapon in her fingers and glanced toward the exit. “There are armed guards down the hall. I don’t know how we’ll get past them.” She noticed Kat staring at the red steel doors on the other side of the ward. “They … they took my sister through there two weeks ago.”\u003c/p\u003e\n\u003cp\u003e“Then that’s where we’re going,” Kat said.\u003c/p\u003e\n\u003cp\u003eShe wasn’t leaving without finding out what was going on here.\u003c/p\u003e\n\u003cp\u003eAmy remained at Kat’s side, looking ready to follow her lead.\u003c/p\u003e\n\u003cp\u003e“Grab the key card,” Kat ordered. “We’re going to find out what happened to your sister.”\u003c/p\u003e\n\u003cp\u003eAmy gave a sharp nod of acknowledgment.\u003c/p\u003e\n\u003cp\u003eKat used the moment to grab her purse, which had been set aside with the rest of her clothes. She snapped it open and pulled out the surveillance pen she’d activated earlier. She tucked it into her blouse pocket with the camera end poking out.\u003c/p\u003e\n\u003cp\u003eIf I don’t make it, I want some record of all of this.\u003c/p\u003e\n\u003cp\u003eTogether, they sprinted to the other side of the ward. As they reached the doors, Kat took the keycard from Amy and passed it over the electronic reader. A heavy shift of gears rumbled. A red light blinked brightly overhead, likely wired to an alarm at that guard station outside. As secure as this place was, someone knew this vault was opening.\u003c/p\u003e\n\u003cp\u003eHow long until they came to investigate?\u003c/p\u003e\n\u003cp\u003eBefore her, the heavy doors parted wider, accompanied by a soft sigh of pressurized air.\u003c/p\u003e\n\u003cp\u003eKat stared inside—as Amy began screaming.\u003c/p\u003e\n\u003cp\u003e6:18 P.M.\u003c/p\u003e\n\u003cp\u003eWashington, DC\u003c/p\u003e\n\u003cp\u003e“Interview everyone at that damned restaurant.”\u003c/p\u003e\n\u003cp\u003ePainter paced the communications nest at Sigma headquarters, holding his earpiece in place as he directed the security detail in Charleston in the search for Lisa. The team had finally arrived on-site.\u003c/p\u003e\n\u003cp\u003eHe turned next to one of the analysts seated at a console. “How long on getting that feed from the local street cameras?”\u003c/p\u003e\n\u003cp\u003e“Five or ten minutes.”\u003c/p\u003e\n\u003cp\u003eHe turned his back in frustration.\u003c/p\u003e\n\u003cp\u003eLisa, where did you go?\u003c/p\u003e\n\u003cp\u003eAfter ordering her to leave the restaurant, he had expected a return call within minutes, alerting him to her location so his security team could sweep her up. But as time stretched with no word, panic had set in.\u003c/p\u003e\n\u003cp\u003e“Director,” another technician said, pointing to a dark monitor. “I still can’t get anything more from Captain Bryant’s pen camera. The one planted in the clinic’s reception area. Either it’s been discovered or the battery has drained.”\u003c/p\u003e\n\u003cp\u003ePainter nodded, acknowledging the information. He spoke to the head of the security team. “Split off two men. Send them to the fertility clinic. I want a full report on the status there.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir. Also, we finished questioning the restaurant staff. They confirmed a woman matching Dr. Cummings’s description had arrived. She ordered a drink—then suddenly, with no provocation, fled the building. The host saw her talking to three men outside, said she left with them. According to his statement, she informed him that she had been expecting guests.”\u003c/p\u003e\n\u003cp\u003ePainter closed his eyes. Lisa had been expecting his team.\u003c/p\u003e\n\u003cp\u003eIt made no sense.\u003c/p\u003e\n\u003cp\u003e“Widen the search grid,” Painter said. “See if anyone saw where they went.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003eBlood pressure pounded in his ears—but he still heard the deep bass of the voice at the door.\u003c/p\u003e\n\u003cp\u003e“Director Crowe … a word.”\u003c/p\u003e\n\u003cp\u003eHe turned to find his boss, the head of DARPA, General Metcalf, standing at the threshold. The man wore the same suit as this morning, still looking fresh and expertly creased. The same could not be said of the general’s face. He looked worn, his eyes red, his jowls sagging.\u003c/p\u003e\n\u003cp\u003e“Sir?”\u003c/p\u003e\n\u003cp\u003e“We need to talk.”\u003c/p\u003e\n\u003cp\u003eThat statement never ended well. Underscoring the seriousness, Metcalf rarely stepped into Sigma headquarters. He preferred e-mail, faxes, and conference calls. His presence here did not bode well.\u003c/p\u003e\n\u003cp\u003ePainter clenched and unclenched a fist. He didn’t have time for interruptions, but he had no choice. “We can use Captain Bryant’s office.”\u003c/p\u003e\n\u003cp\u003eHe led Metcalf to the windowed space off the communications nest and chased Jason Carter out of Kat’s chair. The young analyst was continuing to work on a private project for Painter.\u003c/p\u003e\n\u003cp\u003e“Give us a few minutes,” Painter told the kid. Once alone, he faced Metcalf. “What’s this about?”\u003c/p\u003e\n\u003cp\u003e“I’ve been in meetings with the secretary of defense and the joint chiefs. The president made a brief appearance.”\u003c/p\u003e\n\u003cp\u003ePainter heard the drums of war beating in time with his heart. “And?” he asked, sensing what was coming.\u003c/p\u003e\n\u003cp\u003e“We’re shutting Sigma down.”\u003c/p\u003e\n\u003cp\u003ePainter shook his head, not in insubordination, just disbelief. He expected a strong negative reaction from the commander in chief, but not this, and certainly not this soon.\u003c/p\u003e\n\u003cp\u003e“When?” he asked.\u003c/p\u003e\n\u003cp\u003eMetcalf wore an expression of regret, but his voice never wavered. “You’re to cease all operations immediately.”\u003c/p\u003e\n\u003cp\u003ePainter felt sucker-punched. “Sir, I’ve got agents in the field, many in dangerous situations.”\u003c/p\u003e\n\u003cp\u003e“Call them back. Turn any of those situations over to local authorities or up the military chain of command.”\u003c/p\u003e\n\u003cp\u003e“And if I refuse … if any agents resist …?”\u003c/p\u003e\n\u003cp\u003e“Any further actions will be considered unsanctioned, disavowed, and criminal charges may be pressed, depending on a case-by-case inquiry.”\u003c/p\u003e\n\u003cp\u003ePainter took a deep breath and stared at the men and women working furiously in the nest beyond the window. From the corner of his eye, he noted the project Jason had been working on—the genealogical map of the Gant family spun slowly there, a spiraling galaxy of power, as cold and relentless as any celestial movement.\u003c/p\u003e\n\u003cp\u003ePainter knew the truth in that moment.\u003c/p\u003e\n\u003cp\u003eThe Guild had won.\u003c/p\u003e\n\u003cp\u003e“Shut it down,” Metcalf ordered. “Pull everyone out of the field.”\u003c/p\u003e\n\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003eJuly 3, 2:18 A.M. Gulf Standard Time\u003c/p\u003e\n\u003cp\u003eOff the coast of Dubai\u003c/p\u003e\n\u003cp\u003eGray crouched with his team at the edge of the dark golf course, hidden in the shadow of its clubhouse. The moon had set while they crossed the greens, hurrying from one patch of palms to another. Despite the dark night, the lighted floors of several of the neighboring towers acted as shining beacons, casting a stark illumination across the rolling lawns.\u003c/p\u003e\n\u003cp\u003eAccording to the pre-mission briefing, most of the island’s security patrolled the shorelines and docks, but they could not discount a stray guard spotting them.\u003c/p\u003e\n\u003cp\u003eBut now they had another problem to address as he lowered the satellite phone. Moments ago, he had checked in with Painter, confirming they’d reached Utopia. And in hindsight, maybe he should never have made that call.\u003c/p\u003e\n\u003cp\u003e“What’s wrong now?” Seichan asked, reading his face.\u003c/p\u003e\n\u003cp\u003e“We’ve been ordered to cease all mission objectives and return to the States,” Gray told the others. “Apparently, the powers-that-be in DC need a scapegoat for the death of the president’s daughter.”\u003c/p\u003e\n\u003cp\u003e“And that would be us,” Kowalski mumbled sourly.\u003c/p\u003e\n\u003cp\u003e“Painter is working on an appeal, but he has to officially instruct us to pull up stakes here.”\u003c/p\u003e\n\u003cp\u003e“But Amanda isn’t even dead,” Tucker said. “Why doesn’t the director tell the president that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-39.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
