{"id":103848,"no":50,"title":"Page 50","content":"\u003cp\u003eWith urgency firing their efforts, the two forced the elevator open. The walls of the shaft blurred past them—then the outer-lobby doors sprang into view. The cage settled to a bobbling, shaking stop there, balanced on the tip of a powerful fountain.\u003c/p\u003e\n\u003cp\u003eBut only for a moment.\u003c/p\u003e\n\u003cp\u003eWater flooded into the open cage, swamping the space and causing it to slowly sink.\u003c/p\u003e\n\u003cp\u003e“Hurry!”\u003c/p\u003e\n\u003cp\u003eGray and Tucker hauled on the outer-lobby doors, cracking them wide enough for the others to evacuate. Seichan helped Kowalski with Amanda’s limp form. All the while, the cage continued to flood and submerge deeper.\u003c/p\u003e\n\u003cp\u003eTucker used a free arm to push Kane through the shrinking doorway—then nodded to Gray. They were both chest-deep in water. Only half the cage was still at the lobby level.\u003c/p\u003e\n\u003cp\u003e“Go!” Tucker said.\u003c/p\u003e\n\u003cp\u003e“Together,” Gray argued.\u003c/p\u003e\n\u003cp\u003eThey didn’t have the luxury of counting to three—both simply dove through the opening, their feet pulling free of the cage just as it sank away down the shaft behind them.\u003c/p\u003e\n\u003cp\u003eGray helped Tucker stand.\u003c/p\u003e\n\u003cp\u003eThey sloshed a few steps, relieved to be alive.\u003c/p\u003e\n\u003cp\u003eSeichan crouched by Kowalski, examining Amanda, checking her condition. When she stood, she wore a worried look.\u003c/p\u003e\n\u003cp\u003e“What?” Gray asked.\u003c/p\u003e\n\u003cp\u003e“She’s had her baby.”\u003c/p\u003e\n\u003cp\u003eTucker splashed closer. “But her belly’s still big.”\u003c/p\u003e\n\u003cp\u003e“Was bigger, I guess.” Kowalski carried her to the steps to get her out of the water.\u003c/p\u003e\n\u003cp\u003e“She’s early,” Seichan said. “Either stress caused her to deliver prematurely or they induced her to get the baby.”\u003c/p\u003e\n\u003cp\u003eTucker stared toward the flooded elevator, his face crushed with guilt. “I didn’t know. If I had, I could’ve searched longer. Tried to find the baby.”\u003c/p\u003e\n\u003cp\u003eGray placed a hand on his shoulder. “We barely made it out as it was. If you’d delayed even another minute, Amanda could have died. We all could have died. And there’s no saying the baby was born alive. Or maybe he was already evacuated out.”\u003c/p\u003e\n\u003cp\u003eTucker looked little comforted by this logic, and stared at the door. His dog came up and nudged his hand with his nose. Tucker rubbed the side of Kane’s face, finding solace there instead of words.\u003c/p\u003e\n\u003cp\u003eGray turned away, splashing across—splashing?\u003c/p\u003e\n\u003cp\u003eHe stared down at his feet, still ankle-deep in water. “Why is it still flooded up here?”\u003c/p\u003e\n\u003cp\u003e“It’s not just here,” Seichan said from a few yards away. She pointed across the lobby to the glass entrance of the Burj Abaadi.\u003c/p\u003e\n\u003cp\u003eGray stared out, shocked.\u003c/p\u003e\n\u003cp\u003eThe starlit park beyond the tower was flooded. Black waves washed through the trees and crashed against the steps of the tower.\u003c/p\u003e\n\u003cp\u003eHe understood immediately. The Guild never took half-measures when it came to covering their tracks. They hadn’t just shattered the one support pylon as a fail-safe.\u003c/p\u003e\n\u003cp\u003eThey had shattered all of them.\u003c/p\u003e\n\u003cp\u003eHe knew what that meant, a dreadful and frightening truth.\u003c/p\u003e\n\u003cp\u003eThe whole island is sinking.\u003c/p\u003e\n\u003cp\u003e29\u003c/p\u003e\n\u003cp\u003eJuly 2, 8:01 P.M. EST\u003c/p\u003e\n\u003cp\u003eOrangeburg, South Carolina\u003c/p\u003e\n\u003cp\u003eThey’d been on the road for an hour, heading west out of Charleston. Kat noted a sign that read ORANGEBURG. Her captors—the head of the fertility clinic, Dr. Paul Cranston, and his three men—kept mostly to the back roads, racing at speeds too fast for the rural areas.\u003c/p\u003e\n\u003cp\u003eCranston spent most of the trip on his cell phone. Kat eavesdropped, but she learned little from his end of the conversations. Plainly he and the others still didn’t know what had happened at the clinic, didn’t know the true source of that fiery destruction sat in the backseat of their Ford Explorer.\u003c/p\u003e\n\u003cp\u003eKat wasn’t about to fill him in, but from the glance over his shoulder, Cranston clearly suspected the cause. But apparently any questions would wait until they reached their destination.\u003c/p\u003e\n\u003cp\u003eShe gleaned that last bit of intelligence from a phone conversation moments later. Cranston sat straighter for that call, the perpetual edge of disdain in his voice gone, his tone turned subservient, frightened.\u003c/p\u003e\n\u003cp\u003eWe’ll bring them both straightaway.\u003c/p\u003e\n\u003cp\u003eWhoever lurked at the other end of the line left the man shaking and ashen. Cranston sat for several long minutes, cell phone on his lap, not moving, staring dully out the window at the passing cotton and tobacco fields.\u003c/p\u003e\n\u003cp\u003eEventually, he snapped out of it and made one last call.\u003c/p\u003e\n\u003cp\u003eTo his wife.\u003c/p\u003e\n\u003cp\u003eI’m fine, sweetheart. I wasn’t even at the clinic when the fire broke out. Maybe a gas leak. I know, I know … but I have a slew of other fires still to put out. Give Michael a kiss for me. Tell him I’ll be back in a couple of days for the parade and fireworks on the Fourth. What’s that? Yeah, sorry, I’m … losing signal. I didn’t hear what you … oh never mind.\u003c/p\u003e\n\u003cp\u003eHe finally surrendered, as reception died out in the backcountry.\u003c/p\u003e\n\u003cp\u003eAs Kat listened, she found it hard to couple this devoted family man to the horrors hidden beneath that research facility.\u003c/p\u003e\n\u003cp\u003eStill, the conversation awakened pangs of longing for her own family. Monk should be getting the babies ready for bed about now, tucking Penny into her footy pajamas, Harriet into her crib with a mobile of bears hanging above it. She thought of Monk sliding his arm around her waist after they both settled down, pulling her close, content to be surrounded by his girls.\u003c/p\u003e\n\u003cp\u003eAs if sensing her thoughts, Lisa squeezed her hand.\u003c/p\u003e\n\u003cp\u003eKat appreciated the gesture, but she intended to return to Monk’s arms—which meant getting free first.\u003c/p\u003e\n\u003cp\u003eThe opportunity to accomplish that grew shorter with every passing mile. Once they reached their destination—the Lodge—she suspected escape would be impossible. Still, she had to be patient. She needed the right moment, the right opportunity.\u003c/p\u003e\n\u003cp\u003eAt last, she got it.\u003c/p\u003e\n\u003cp\u003eThe SUV turned onto a long, lonely stretch of rural road, not a car in sight. The summer sun sat low on the horizon, creating deep pools of shadows under the heavy-limbed oaks that lined the road.\u003c/p\u003e\n\u003cp\u003eShe gave Lisa’s hand an extra-hard squeeze, preparing her. “I have to go to the bathroom,” Kat declared loudly.\u003c/p\u003e\n\u003cp\u003eCranston dismissed her. “You’ll wait.”\u003c/p\u003e\n\u003cp\u003e“I won’t. I’m going now—either outside or back here.”\u003c/p\u003e\n\u003cp\u003eCranston twisted in his seat, eyeing her, judging her determination. She didn’t break eye contact. His gaze flicked to the lonely road around them, then he sighed.\u003c/p\u003e\n\u003cp\u003e“Fine. Stop the car.” His next words were for one of the guards. “She runs … you shoot her.”\u003c/p\u003e\n\u003cp\u003eThe Ford pulled to the shoulder of the road.\u003c/p\u003e\n\u003cp\u003eKat gave Lisa’s hand a small tug, trying to get her to understand.\u003c/p\u003e\n\u003cp\u003eLisa tightened her fingers. “I should go, too … if we’re stopping anyway.”\u003c/p\u003e\n\u003cp\u003eGood girl.\u003c/p\u003e\n\u003cp\u003e“You’ll take turns,” Cranston said. “I’m not taking any chances.”\u003c/p\u003e\n\u003cp\u003eThey piled out of the backseat on the driver’s side, leaving the two men up front. One gunman kept a grip on Lisa’s upper arm, resting a palm on his holstered pistol.\u003c/p\u003e\n\u003cp\u003eKat hiked off to the shadows beneath an oak.\u003c/p\u003e\n\u003cp\u003e“That’s far enough!” Cranston yelled out the open window.\u003c/p\u003e\n\u003cp\u003eHer guard had his pistol out, emphasizing the order.\u003c/p\u003e\n\u003cp\u003eShe squatted in the weeds and slipped her shorts down. After all of the drugs in her system, her bladder had been begging for relief. The guard watched. She stared right back at him, challenging him. Once finished, she stood back up and headed toward the roadside.\u003c/p\u003e\n\u003cp\u003eThe guard kept his pistol pointed, maintaining his distance.\u003c/p\u003e\n\u003cp\u003eThe other gunman pushed Lisa toward the field. “Your turn. Be quick about it.”\u003c/p\u003e\n\u003cp\u003eThat was all Kat needed.\u003c/p\u003e\n\u003cp\u003eShe swung her arm, sharply flicking out her wrist. The hidden baton extended to its full length. She might be out of range of the guard—but the baton wasn’t.\u003c/p\u003e\n\u003cp\u003eBack on the streets of Charleston, Kat had taken the weapon from Amy after hiding her body behind the recycling bin. She had concealed the collapsed length of the baton in the small of her back, tucked into the waistband of her shorts—then tossed her pistol out, appearing unarmed.\u003c/p\u003e\n\u003cp\u003eShe had wanted Lisa a safe distance away from her captors before acting, to wait for their guard to lower.\u003c/p\u003e\n\u003cp\u003eLike now.\u003c/p\u003e\n\u003cp\u003eKat cracked the baton’s hard length across the guard’s wrist, breaking bone. The pistol tumbled from his fingertips.\u003c/p\u003e\n\u003cp\u003eAlready diving forward, Kat caught the weapon before it hit the pavement. She landed on her shoulder and rolled, already firing. She blasted the guard in the knee, twisted to shoot the other gunman in the head, then back to her guard, finishing him off with a round through his throat.\u003c/p\u003e\n\u003cp\u003eKat lunged to the car. Her attack had been so sudden, so savage, the driver barely had time to react. She shoved her gun through the open window and fired point-blank into the side of his head. Skull fragments and blood splattered across the front seat, striking Cranston across chest and face.\u003c/p\u003e\n\u003cp\u003eThe doctor sat stunned, one hand held up, palm open. The other clutched an open cell phone.\u003c/p\u003e\n\u003cp\u003eSorry, bastard, no signal.\u003c/p\u003e\n\u003cp\u003eKat wasn’t taking any chances with him. The good doctor had answers Sigma needed. She intended to deliver him to Painter, all trussed up and tied with a bow.\u003c/p\u003e\n\u003cp\u003e“It’s our turn to drive.”\u003c/p\u003e\n\u003cp\u003e8:12 P.M.\u003c/p\u003e\n\u003cp\u003eLisa guided the Ford Explorer down the country road, trying her best to ignore the gore still staining the seat. As a medical doctor, she seldom found herself squeamish, but the raw brutality of Kat’s attack still shook her. Prior to today, she had known Kat mainly as a mother or a strategist working alongside Painter. She’d never witnessed Kat’s skill in the field, her pure animal cunning and savagery.\u003c/p\u003e\n\u003cp\u003eThough that trait had won them their freedom, it still unnerved her.\u003c/p\u003e\n\u003cp\u003eThat, and the cold blood seeping through the seat of her dress.\u003c/p\u003e\n\u003cp\u003eAfter the roadside attack, Kat had forced Cranston to haul the bodies into a ditch, to hide them from direct sight of the road, though it looked rarely traveled.\u003c/p\u003e\n\u003cp\u003eWhich was turning out to be a problem.\u003c/p\u003e\n\u003cp\u003e“Any signal yet?” Lisa asked.\u003c/p\u003e\n\u003cp\u003e“No,” Kat answered from the backseat.\u003c/p\u003e\n\u003cp\u003eHer friend crouched behind Cranston, a pistol in one hand, the doctor’s cell phone in the other. Cranston still sat in the front passenger seat, his wrists zip-tied to the headrest behind him. An awkward stress position, but Kat ignored his protests. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-50.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
