{"id":103858,"no":60,"title":"Page 60","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThat was a problem.\u003c/p\u003e\n\u003cp\u003eI don’t know anything more than they do.\u003c/p\u003e\n\u003cp\u003eThat is, unless Painter was ignorant of Robert Gant’s involvement with the Guild. Maybe the director suspected the president’s family or inner circle was involved—but he didn’t necessarily know who in the administration was the mole.\u003c/p\u003e\n\u003cp\u003eGray stared down at his hand. He still had one more round. Was it enough to stall, to buy Painter time to find him?\u003c/p\u003e\n\u003cp\u003eA shout rose from the dark hatch. “Leave the rifle! Show your hands!”\u003c/p\u003e\n\u003cp\u003e“Where are you taking me?” he called back, both stalling and trying to get more information.\u003c/p\u003e\n\u003cp\u003eThe answer came as a shock—literally. An electrical jolt burst from his ear, blinding him, triggering his jaw to seize, his knees to buckle, sprawling him flat.\u003c/p\u003e\n\u003cp\u003e“Leave the rifle,” the guard repeated. “Show your hands.”\u003c/p\u003e\n\u003cp\u003eGray belly-crawled and thrust his arms over the open hatch. He breathed heavily, gasping.\u003c/p\u003e\n\u003cp\u003e“Now climb down the service ladder.”\u003c/p\u003e\n\u003cp\u003eGray dawdled—not because it hurt to move but to slow things down. He swung his legs into the opening, fumbling with a toe to find the first rung.\u003c/p\u003e\n\u003cp\u003e“You were warned,” the guard said.\u003c/p\u003e\n\u003cp\u003eGray braced for another shock, but instead a mechanical countdown whispered from his implanted earpiece, arising from the unit itself.\u003c/p\u003e\n\u003cp\u003eTen … nine … eight …\u003c/p\u003e\n\u003cp\u003eIt was the timer for the implanted C-4 bomb in his right ear. Whoever held the transmitter must have stepped beyond his ten-yard limit. They were forcing him to follow, tugging at his electric leash.\u003c/p\u003e\n\u003cp\u003eHe had no choice but to obey. He picked at that packed ear, knowing it wouldn’t do Sigma any good to have half his skull blown away. He had to stay alive, to do his best to learn more—which meant he had to work fast.\u003c/p\u003e\n\u003cp\u003e… seven … six … five …\u003c/p\u003e\n\u003cp\u003eOnce done, he ignored the ladder’s rungs and slid down the frame instead. His feet hit the floor of a concrete corridor as the countdown reached three.\u003c/p\u003e\n\u003cp\u003eThen, thankfully, stopped.\u003c/p\u003e\n\u003cp\u003eA circle of soldiers, all in black, surrounded him, weapons in hand. One dashed back up the ladder, wearing latex gloves, and searched the concrete roost.\u003c/p\u003e\n\u003cp\u003e“Rifle’s there and some blood for a DNA trace,” the man reported and clambered back down. He held the syringe-injection system in one hand and bagged it away, cleaning up any evidence. “All clear.”\u003c/p\u003e\n\u003cp\u003eThe team leader stepped up, a head taller than the others, with a crucifix-shaped tattoo on his neck. He pocketed a device the size of a packet of gum.\u003c/p\u003e\n\u003cp\u003eThe transmitter.\u003c/p\u003e\n\u003cp\u003e“Move out,” he ordered.\u003c/p\u003e\n\u003cp\u003ePistols encouraged Gray forward, down a set of stairs to a subbasement, then through a hidden door into a tunnel system.\u003c/p\u003e\n\u003cp\u003eGray stared behind him as the door sealed, hoping his plan worked.\u003c/p\u003e\n\u003cp\u003eAs his feet dragged, the countdown began again in his ear.\u003c/p\u003e\n\u003cp\u003eTen … nine … eight …\u003c/p\u003e\n\u003cp\u003eLike a dog on a leash, Gray hurried forward obediently.\u003c/p\u003e\n\u003cp\u003eFor now.\u003c/p\u003e\n\u003cp\u003e12:32 P.M.\u003c/p\u003e\n\u003cp\u003e“Report,” Painter said, standing in the communications nest at Sigma headquarters.\u003c/p\u003e\n\u003cp\u003e“We arrived on-site,” his unit commander reported from the field. “Found the bunker empty. No sign of Commander Pierce. Only a sniper rifle and several drops of blood.”\u003c/p\u003e\n\u003cp\u003ePainter closed his eyes and fought against the tide of despair at losing Gray’s trail. He turned his mind instead to what was left behind.\u003c/p\u003e\n\u003cp\u003eA rifle and blood.\u003c/p\u003e\n\u003cp\u003ePainter understood.\u003c/p\u003e\n\u003cp\u003eThey were planning on pinning the assassination on Gray and, in turn, destroying Sigma’s reputation. But as in any chess match, it was now Painter’s turn.\u003c/p\u003e\n\u003cp\u003e“Grab the rifle and bring it here,” he ordered. “Destroy the blood evidence and scour the place clean. But you’ll need to be quick.”\u003c/p\u003e\n\u003cp\u003eIn the aftermath of the attack, chaos still reigned, but it wouldn’t be long before forensic teams discovered the sniper’s hiding place. His team needed to be finished by then. But he refused to let panic distract his focus.\u003c/p\u003e\n\u003cp\u003eHe knew Gray wouldn’t have lost focus, either.\u003c/p\u003e\n\u003cp\u003e“Before you start cleaning,” Painter warned over the radio, “thoroughly search every square inch of that space. If I know Gray, he would try to leave us some clue.”\u003c/p\u003e\n\u003cp\u003e“Understood.”\u003c/p\u003e\n\u003cp\u003ePainter ended the conversation and spoke to Jason Carter, who stood in the doorway to Kat’s office. “Hold down the fort here. Let me know if anything goes wrong.”\u003c/p\u003e\n\u003cp\u003eLike it hadn’t already.\u003c/p\u003e\n\u003cp\u003e“I’ve got things covered,” Jason assured him.\u003c/p\u003e\n\u003cp\u003ePainter hurried out the door and down the stairs, headed for the lowermost floor.\u003c/p\u003e\n\u003cp\u003ePresident James Gant was already down there with his daughter.\u003c/p\u003e\n\u003cp\u003eThe man had arrived in secret a few minutes ago. The Smithsonian Castle had been closed all day, specifically for this purpose. No one paid attention to the shuffle of the janitorial staff into the building; no one saw them enter the special elevator that led down to the command bunkers of Sigma. For now, everyone believed the president was undergoing emergency surgery at George Washington University Hospital, that the likelihood of his survival was extremely poor.\u003c/p\u003e\n\u003cp\u003ePainter had his communications nest monitoring events, making sure the deception remained in place, massaging the press where needed. But such a level of fraud could not last forever without risking exposure. In less than six hours, it would have to end.\u003c/p\u003e\n\u003cp\u003eKnowing time was ticking down, Painter returned to the hospital ward. Two Secret Service agents protected the hall; another manned a post by the elevator. The fourth stood guard inside the small ward.\u003c/p\u003e\n\u003cp\u003ePainter found Gant sitting on the edge of Amanda’s bed, holding her hand. He had stripped out of the janitorial coveralls and wore wrinkled navy-blue slacks and a borrowed gray shirt. Amanda still balanced between moments of lucidity and sedation, monitored by her neurologist, who remained concerned about the subdural hematoma.\u003c/p\u003e\n\u003cp\u003eAt the moment, she slept.\u003c/p\u003e\n\u003cp\u003eGant looked up as he entered. “She spoke a few words when I came in. She’s still worried about her baby.”\u003c/p\u003e\n\u003cp\u003e“We all are.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “What’s the word from your field team? Did they find your man?”\u003c/p\u003e\n\u003cp\u003ePainter hated to dash the gleam of hope in a father’s eyes, but he’d had enough deception for one day. “Already gone. But I’m hoping he left some clue behind. We should know in a few minutes.”\u003c/p\u003e\n\u003cp\u003eGant sighed, turning to his daughter. He spoke slowly, full of regret. “I pulled her into the limelight and made her childhood a spectacle, a target for the press. And I still had no time for her. No wonder she rebelled, lashed out. No wonder she fled without saying a word. What trust have I earned in her life?” He glanced up, wiping a tear, but never let go of her hand. “I promised her I’d find William. Don’t make me let her down again.”\u003c/p\u003e\n\u003cp\u003ePainter stepped over and placed a hand on his shoulder, silently making an oath to do everything he could to help.\u003c/p\u003e\n\u003cp\u003e“What they did to her, to my family …” Gant said. “If I ever find out who orchestrated this, who tortured my baby girl, I will make them regret it for the rest of their days. There will be no quick death. I will make them suffer like no other. I’ll turn their world into a personal hell on earth.”\u003c/p\u003e\n\u003cp\u003ePainter knew that if anyone had the power to do that, it was President James Gant.\u003c/p\u003e\n\u003cp\u003eA commotion drew both their attentions around.\u003c/p\u003e\n\u003cp\u003eJason came flying into the room, winded. “Director.” The young man never stopped moving, continuing past the end of the bed and toward the neighboring medical office. “Linus just got a hit.”\u003c/p\u003e\n\u003cp\u003ePainter got drawn into the wake of his excitement. It took him an extra moment to remember that Linus was Jason’s partner in that vehicle-identification program. Hope flared inside him.\u003c/p\u003e\n\u003cp\u003eHad they found something?\u003c/p\u003e\n\u003cp\u003eHe rushed after Jason into the medical office. The kid was already at the computer, typing fast.\u003c/p\u003e\n\u003cp\u003e“What is it?” Painter asked.\u003c/p\u003e\n\u003cp\u003eThe president stood in the doorway, too, listening in.\u003c/p\u003e\n\u003cp\u003e“I’ll show you,” Jason said, typing as he spoke. “That’s why I came running down here. Linus had been checking all the major thoroughfares leaving Charleston, searching for any further hits on that Ford. The problem is that the farther you get out from the city, the more variables come into play, so many different roads that could be taken, spreading wider and wider like the branches on a tree.”\u003c/p\u003e\n\u003cp\u003e“What did you find?” Painter pressed.\u003c/p\u003e\n\u003cp\u003e“This.” Jason pointed at the screen. A clear photo of the front of a Ford Explorer appeared. “Picked this up from a security camera at a drawbridge outside of Orangeburg, South Carolina.”\u003c/p\u003e\n\u003cp\u003eThrough the windshield, Painter spotted Lisa behind the wheel. His breathing grew heavier, both relieved and terrified. A man sat next to her, his arms awkwardly raised behind him, like he was stretching. Or maybe his hands were bound behind him.\u003c/p\u003e\n\u003cp\u003e“You found her,” Painter mumbled. “How long ago was this taken?”\u003c/p\u003e\n\u003cp\u003eJason looked both apologetic and worried. “Two days ago … the same day Dr. Cummings was kidnapped in Charleston.”\u003c/p\u003e\n\u003cp\u003eThe president spoke at the doorway. “Who is Dr. Cummings?”\u003c/p\u003e\n\u003cp\u003eShe’s everything to me.\u003c/p\u003e\n\u003cp\u003eAloud, Painter replied, “She was one of the operatives sent to investigate the North Charleston Fertility Clinic.”\u003c/p\u003e\n\u003cp\u003eGant’s face grew grim, likely remembering the footage he’d been shown, of women floating in gel-filled tanks.\u003c/p\u003e\n\u003cp\u003eJason drew their attention back to the original still shot and pointed. “This was what got me so excited.”\u003c/p\u003e\n\u003cp\u003ePainter leaned closer. “A license plate.”\u003c/p\u003e\n\u003cp\u003e“Clear as day. I have Linus running a trace on the car’s GPS, to find out where it might be. We should—”\u003c/p\u003e\n\u003cp\u003eA dialog box popped onto the screen.\u003c/p\u003e\n\u003cp\u003e“I think this is it.” Jason tapped on the hyperlink in the box.\u003c/p\u003e\n\u003cp\u003eThe image of the Ford vanished, replaced by a map view. A blinking blue circle narrowed and zoomed, shrinking down toward the border, where a corner of South Carolina pushed between Georgia and North Carolina. The circle finally changed into a small triangle, positioned deep in the Blue Ridge Mountains. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-60.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
