{"id":103874,"no":76,"title":"Page 76","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe patted her hand.\u003c/p\u003e\n\u003cp\u003e“Permanent vegetative state is defined as when you’ve been in this state for longer than a year. We’ll be reaching that milestone, my dear, I assure you of that. I’ve got a private hospital picked out in Charleston. Gant family–owned, of course. They’ll make sure you stay in this state forever, even if more surgery is necessary to make sure you never wake up.”\u003c/p\u003e\n\u003cp\u003eHe gave her hand a reassuring squeeze. “And all of those life-extension research projects that you’ve been running? It seems a distraught husband is going to employ every one of them to make sure you stay like this year after year after year.”\u003c/p\u003e\n\u003cp\u003eHe stood back up, remembering the oath he swore to Painter Crowe if he ever found out who hurt his family: There will be no quick death. I will make them suffer like no other. I’ll turn their world into a personal hell on earth.\u003c/p\u003e\n\u003cp\u003eIf nothing else, James T. Gant was a man of his word.\u003c/p\u003e\n\u003cp\u003eHe bent down, kissed his wife’s forehead, noting a fat tear rolling from her eye. “Welcome to hell, Teresa.”\u003c/p\u003e\n\u003cp\u003e9:30 P.M.\u003c/p\u003e\n\u003cp\u003eTakoma Park, Maryland\u003c/p\u003e\n\u003cp\u003eGray finished washing the dinner dishes, staring out the window to the backyard. A dark gazebo stood in a remote corner, nestled amid overgrown rosebushes and shadowed by the bower of a cherry tree.\u003c/p\u003e\n\u003cp\u003eMovement drew his gaze: a shift of darkness, a glint of steel zipper on a jacket, a pale hint of skin.\u003c/p\u003e\n\u003cp\u003eSeichan stalked back there, as restless as she was thoughtful.\u003c/p\u003e\n\u003cp\u003eHe knew what plagued her.\u003c/p\u003e\n\u003cp\u003eA dead man’s words.\u003c/p\u003e\n\u003cp\u003eSteps sounded behind him. He turned as Mary Benning, the night nurse, returned from upstairs.\u003c/p\u003e\n\u003cp\u003e“Got your father settled,” she said. “Already snoring by the time I was out the door.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” He slipped the last dinner plate into the drying rack. “He seemed good tonight.”\u003c/p\u003e\n\u003cp\u003e“More at peace,” she agreed and smiled softly. “He missed you. But he’s too hardheaded to ever admit it.”\u003c/p\u003e\n\u003cp\u003eNo argument about that.\u003c/p\u003e\n\u003cp\u003eStill, Gray remembered a strange moment when he first got back from the mission. He had come here, expecting the worst after being gone for nearly a week. Instead, he found his father in the kitchen with the sports page. When Gray stepped inside, his father looked him up and down, as if searching for something, then asked a blunt question that was oddly canny.\u003c/p\u003e\n\u003cp\u003eDid you get ’em?\u003c/p\u003e\n\u003cp\u003eGray had answered truthfully. I got ’em, Dad. All of ’em.\u003c/p\u003e\n\u003cp\u003eHis father could have been talking about many things, his inquiry interpreted many different ways, especially with the state of his dementia.\u003c/p\u003e\n\u003cp\u003eNo matter the cause, his father had risen from the table and hugged Gray—as if thanking him for getting the revenge he could not.\u003c/p\u003e\n\u003cp\u003eAnd then, this morning, they’d gone as a family to their mother’s grave. Usually such visits brought tears and storm clouds, followed by a sullen, silent ride home. This morning, there had been tears, but also soft laughter. On the way home, his father told a couple of anecdotes about their mother. Even Kenny had shed his corporate bluster for an easier camaraderie. And more surprising still, his brother had agreed to extend his stay for another two months, mentioning something about telecommuting.\u003c/p\u003e\n\u003cp\u003eSome of that decision might be because Kenny had met a girl.\u003c/p\u003e\n\u003cp\u003eHe was out with her tonight.\u003c/p\u003e\n\u003cp\u003eI’ll take what I can get.\u003c/p\u003e\n\u003cp\u003eMary pointed to the screen door. “You kids enjoy the night. There’s supposed to be a meteor shower. If he gets restless, I’m taping the Nationals game against the Marlins. A little baseball quiets him right down. Unless it’s against the Yankees, then the gloves come off.”\u003c/p\u003e\n\u003cp\u003eGray smiled. “Thanks, Mary.”\u003c/p\u003e\n\u003cp\u003e9:45 P.M.\u003c/p\u003e\n\u003cp\u003eSeichan stood in the dark gazebo, waiting, lost in her own thoughts. It was a balmy night, with crickets chirping in a continuous chorus, and a few fireflies blinking in the bushes and tree limbs.\u003c/p\u003e\n\u003cp\u003eShe stared back at the house, wondering who she would be if she grew up there, picturing a happy childhood of report cards, scraped knees, and first kisses.\u003c/p\u003e\n\u003cp\u003eWould I even be me?\u003c/p\u003e\n\u003cp\u003eShe fingered the silver dragon pendant resting in the hollow of her throat, remembering Robert Gant’s last words.\u003c/p\u003e\n\u003cp\u003eYour mother … escaped … still alive …\u003c/p\u003e\n\u003cp\u003eOver the past week, she’d slowly allowed herself to believe it.\u003c/p\u003e\n\u003cp\u003eIt scared her.\u003c/p\u003e\n\u003cp\u003eEven her father’s death was no more than a dull ache, with no sharp edges to it. She didn’t know him and never really wanted to. Her mother had raised her. The word father had no meaning in her childhood. And a part of her still burned with anger and resentment, for the abuse and horrors she had to endure to become a killer. What father would allow that to happen to his daughter?\u003c/p\u003e\n\u003cp\u003eStill, in the end, Robert Gant had granted her a truer gift than his fatherhood: hope.\u003c/p\u003e\n\u003cp\u003eShe didn’t know what to do with that gift.\u003c/p\u003e\n\u003cp\u003eNot yet.\u003c/p\u003e\n\u003cp\u003eBut she would … with help.\u003c/p\u003e\n\u003cp\u003eGray appeared at the back door, limned against the warmth of the kitchen lights. She liked spying on him when he didn’t know she was watching. She caught glimpses of the boy behind the man, the son of two parents who had loved Gray in very different ways.\u003c/p\u003e\n\u003cp\u003eStill, he was a killer—but not like her.\u003c/p\u003e\n\u003cp\u003eShe was a machine; he was human.\u003c/p\u003e\n\u003cp\u003eShe pictured the girl in the lobby of the Burj Abaadi, a girl broken into a monster. She pictured Petra, a woman molded into one.\u003c/p\u003e\n\u003cp\u003eSeichan was both of them.\u003c/p\u003e\n\u003cp\u003eWhat does he see in me worth holding on to?\u003c/p\u003e\n\u003cp\u003eGray crossed the yard, stirring fireflies. Overhead, a falling star flashed across the dark night. He reached her, a shadow now.\u003c/p\u003e\n\u003cp\u003eShe trembled.\u003c/p\u003e\n\u003cp\u003eHe saw something in her—and she had to trust him.\u003c/p\u003e\n\u003cp\u003eHe held out a hand.\u003c/p\u003e\n\u003cp\u003eOffering everything.\u003c/p\u003e\n\u003cp\u003eShe took it.\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eIt crouches on the rock, basking in the sun, charging its solar cells.\u003c/p\u003e\n\u003cp\u003eIt listens for the sounds of danger, but all it hears is the crash of water over rock, the call of winged creatures. It watches for movement but sees only the shimmer of grass, the shake of leaves. It looks for heat but only finds hot rocks.\u003c/p\u003e\n\u003cp\u003eAs the sunlight fills the hollow hunger inside it, making it stronger, it reviews and remembers.\u003c/p\u003e\n\u003cp\u003eLinked to the others, it had listened as their chorus shrank to nothing.\u003c/p\u003e\n\u003cp\u003eThe silence deafened.\u003c/p\u003e\n\u003cp\u003eIn that silence, it learned a new pattern.\u003c/p\u003e\n\u003cp\u003eTHE END. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-76.html","bookId":1527,"creation":"Oct 5, 2019 10:33:21 PM","modification":"Oct 5, 2019 10:33:21 PM"}
