{"id":80405,"no":26,"title":"Page 26","content":"\u003cp\u003e\"Driving me wild. Verity, you\u0027re twenty-eight years old. Why in hell did you wait this long to go to bed with a man?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged unconcernedly. \"Haven\u0027t you heard? There\u0027s a man shortage.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t give me that bull. Why, Verity?\"\u003c/p\u003e\n\u003cp\u003e\"It never seemed right before,\" she said with simple honesty.\u003c/p\u003e\n\u003cp\u003eHe pulled away so that he could see her face. His eyes searched her expression. \"And it felt right with me?\"\u003c/p\u003e\n\u003cp\u003e\"Mmm.\" She tried to snuggle closer, hungry for the warmth of him.\u003c/p\u003e\n\u003cp\u003eBut Jonas continued to hold her where she was, his face intent. \"Honey, I want you to know you won\u0027t regret it.\"\u003c/p\u003e\n\u003cp\u003e\"Good. I never did believe in useless regrets. When do we do it again?\"\u003c/p\u003e\n\u003cp\u003eHe laughed, the sound deep and husky in the darkness. \"I should have known you\u0027d be a tyrant in bed as well as out of it. Serves me right, I guess.\" He tangled his fingers in the jumbled mass of her hair.\u003c/p\u003e\n\u003cp\u003e\"You know, you remind me of someone.\"\u003c/p\u003e\n\u003cp\u003e\"A former girlfriend?\" Verity was not pleased.\u003c/p\u003e\n\u003cp\u003eJonas shook his head. \"Nope. Not a former girlfriend. It\u0027ll come to me one of these days.\"\u003c/p\u003e\n\u003cp\u003e\"And in the meantime?\" she asked invitingly. She wriggled her toes along his leg.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be damned. I\u0027ve created a monster.\" Jonas\u0027s grin was wicked as he released her with a proprietary slap on her rear and climbed out of bed. \"Stay where you are.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right back,\" he promised, disappearing into the small bathroom.\u003c/p\u003e\n\u003cp\u003eVerity saw the light come on behind the half-closed door and heard water running in the sink. Idly she stretched beneath the sheet, taking inventory of the tiny aches and pains that were the silent protest of formerly unused muscles. She felt languid and happy, eager to explore the wonderful feeling of closeness she had just discovered with Jonas.\u003c/p\u003e\n\u003cp\u003eShe felt as though she had opened the door to a whole new world tonight; a realm in which her relationship with Jonas governed everything. It was as if her life were being realigned along a new axis.\u003c/p\u003e\n\u003cp\u003eDuring the short time she had known him he had dominated her thoughts, intrigued her, compelled her to learn more about him. Tonight he had taken her into the uncharted waters of physical sensation, and she had navigated by hanging on to him. In that moment Verity knew she never wanted to let go of Jonas Quarrel. The intuitive knowledge that he had wanted her and needed her filled her with unlimited delight.\u003c/p\u003e\n\u003cp\u003eShe wondered if this was what it meant to be failing in love. Somehow the notion didn\u0027t seem nearly as anxiety-provoking as it once had.\u003c/p\u003e\n\u003cp\u003eVerity leaned over the edge of the bed and eyed the heap of clothes Jonas had left there. He had been impatient for her, she reflected happily, so impatient that he had left his pants and his shirt in a tangled pile.\u003c/p\u003e\n\u003cp\u003eEnjoying a novel feeling of domesticity, Verity sat up and reached down to pick up Jonas\u0027s clothes. She would fold them neatly and stack them on the chair.\u003c/p\u003e\n\u003cp\u003eAs she picked up the jeans, the earring she had lost two months ago in a Mexican alley fell out of the pocket with a tiny, tinkling clatter. She recognized it instantly when it rolled into the shaft of light that crept out from under the bathroom door.\u003c/p\u003e\n\u003cp\u003eVerity stared down at the golden circlet and her new, bright, sensually warm world began fading around her. Her fingers clenched around the jeans in her hand as she tried to understand what was happening.\u003c/p\u003e\n\u003cp\u003eThere was no sound from the bathroom doorway, but the pattern of light shifted on the floor and Verity looked up to see Jonas watching her. He had a damp washcloth in one hand. His eyes followed hers to the golden earring on the floor. The relaxed, satisfied expression he had worn on the way into the bathroom was gone.\u003c/p\u003e\n\u003cp\u003eVerity stared up at him, asking silent questions with her eyes.\u003c/p\u003e\n\u003cp\u003eJonas exhaled a deep sigh and walked slowly to the bed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a long story,\" he said.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eHE had been careless. Stupid and careless. Too late Jonas realized he\u0027d been so hungry for Verity when he\u0027d emerged from the psychic corridor that he hadn\u0027t even stopped to think about the earring in his pocket or the risks it presented if she discovered it. It had been all he could do just to maintain some semblance of superficial calm when he walked her back to her cabin. When he finally had gotten her into bed, the urgency of his desire had blinded him to everything, including her obvious lack of experience, until it was too late.\u003c/p\u003e\n\u003cp\u003eNot that it would have made any difference in the final outcome if he had known she was a virgin. He\u0027d been consumed with his need to possess her and she had welcomed him. That was more than enough.\u003c/p\u003e\n\u003cp\u003eHe was damned if he would feel guilty on top of everything else.\u003c/p\u003e\n\u003cp\u003eBut he hadn\u0027t expected the violent sexual arousal that had accompanied this latest trip into the dangerous corridor in his mind. He\u0027d never had that particular problem before after making the connection with an ancient object of violence. True, he\u0027d nearly killed a man the last time he\u0027d gone into the corridor, but he hadn\u0027t come back out wanting to throw himself on the nearest woman.\u003c/p\u003e\n\u003cp\u003eThe physical arousal he\u0027d experienced this time must have had some direct link with discovering that Verity too could enter the corridor. The sense of possessiveness he felt toward her now was almost overpowering. He wanted to shout his triumph and exultation to the stars. The indescribable relief at having found her was enough make him lightheaded.\u003c/p\u003e\n\u003cp\u003eBut there was no way to explain it to her yet. She wouldn\u0027t believe him; wouldn\u0027t understand the truth.\u003c/p\u003e\n\u003cp\u003eHe had only the vaguest comprehension of it himself. How could he tell her that she was the key to controlling his talent?\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\" Verity looked down at the earring again. \"I just don\u0027t understand how you could have that earring.\"\u003c/p\u003e\n\u003cp\u003eJonas sat down slowly beside her on the bed, afraid that if he made any fast moves he might panic her.\u003c/p\u003e\n\u003cp\u003e\"I was the other man in the alley the night good old Pedro tried to rape you. I was the one whose face you didn\u0027t see. You never even stopped to look at me. You just turned and ran.\"\u003c/p\u003e\n\u003cp\u003eVerity looked dumbfounded. \"You found my earring and followed me here to Sequence Springs?\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t easy. Took me two months.\"\u003c/p\u003e\n\u003cp\u003e\"But why? It doesn\u0027t make any sense.\"\u003c/p\u003e\n\u003cp\u003eHe tried a smile. It came out crooked. \"Do you believe in love at first sight?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she retorted flatly. \"And I don\u0027t believe in Prince Charming, either. Men don\u0027t follow a woman a couple of thousand miles because they happened to find her shoe or her earring. Besides, you couldn\u0027t possibly have gotten a good look at me that night.\"\u003c/p\u003e\n\u003cp\u003eJonas thought back to that evening in Mexico. He could still hear the raucous calls of the cantina\u0027s patrons as they caught sight of the redheaded gringa in their midst. \"I saw your red hair in the light of the cantina as you stood in the doorway looking for your father. I saw your face and the color of your eyes. I\u0027d never seen eyes that shade of green before.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-26.html","bookId":1797,"creation":"Oct 5, 2019 4:27:07 PM","modification":"Oct 5, 2019 4:27:07 PM"}
