{"id":80434,"no":56,"title":"Page 56","content":"\u003cp\u003eIt was disturbing to know that his memories of that mental corridor were as sharp as her own. They really had shared some sort of mental imagery. He even knew she had tried to ran from him. Somehow he really had been there with her. It was the last thing Verity wanted to admit. Surely there was some rational explanation. If push came to shove, she would vote for a diagnosis of mental telepathy before she agreed with the verdict of psychometry, she decided.\u003c/p\u003e\n\u003cp\u003eTelepathy was bad enough but somehow psychometry was even more difficult to accept.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just get this over with,\" she said between set teeth.\u003c/p\u003e\n\u003cp\u003eJonas gave her a grim glance before reaching across the table for her hand. \"Yes, ma\u0027am,\" he said dryly.\u003c/p\u003e\n\u003cp\u003eEmerson hovered. \"Where do you want me in all this?\" he asked.\u003c/p\u003e\n\u003cp\u003eJonas looked up at him, his expression thoughtful. \"Just stand nearby. If, uh, anything looks like it might get out of control, take the pistol away from me. Once I\u0027m no longer in contact with the gun, the reaction will stop.\"\u003c/p\u003e\n\u003cp\u003eEmerson\u0027s eyes narrowed. \"You going to go crazy on us, Jonas?\"\u003c/p\u003e\n\u003cp\u003eJonas smiled faintly. \"I\u0027ll be okay. I\u0027ve got Verity. Don\u0027t worry. I\u0027ve already touched these pistols briefly and their impact isn\u0027t too bad.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, their impact isn\u0027t too bad?\" Verity demanded.\u003c/p\u003e\n\u003cp\u003e\"I mean I didn\u0027t sense any death associated with them,\" Jonas explained impatiently.\u003c/p\u003e\n\u003cp\u003eVerity shuddered. \"Oh. Well, that\u0027s encouraging. I guess I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003e\"Such enthusiasm.\" But Jonas hesitated no longer. He reached into the case and picked up one of the pistols.\u003c/p\u003e\n\u003cp\u003eJonas felt a faint, glittering flicker of awareness and closed his eyes. He felt the eerie sensation of suddenly having to share his place in time and space with something else that didn\u0027t quite belong there.\u003c/p\u003e\n\u003cp\u003eThe cabin walls began to curve around him.\u003c/p\u003e\n\u003cp\u003eThis was not going to be nearly as intense an experience as handling the rapier had been. But then, he had already known that. The pistol dated from a later time period. Its effect was bound to be less dramatic.\u003c/p\u003e\n\u003cp\u003eThe grip of the gun was warm and solid in his hand. He felt a damp sheen of sweat break out on his forehead.\u003c/p\u003e\n\u003cp\u003eThe tunnel continued to form in his mind.\u003c/p\u003e\n\u003cp\u003eHe started moving along the corridor, aware of the tendrils of old emotion that seemed to be pulling him toward one end. He ignored them for the moment, concentrating on finding Verity first before he tried to deal with the sensations of the past. He could sense her presence somewhere up ahead in the misty shadows that drifted in the endless corridor. With the sure sense of her presence came the feeling of being safely linked to his primary reality.\u003c/p\u003e\n\u003cp\u003eSomething flickered in the darkness ahead. Exultation gripped Jonas. She was there. He caught a tantalizing glimpse of her standing very still, poised to flee but not yet giving in to the fear. Jonas gave her full marks for being in control of herself. The little tyrant was one gutsy lady.\u003c/p\u003e\n\u003cp\u003eBut then, he had always known that. She\u0027d been putting up one hell of a fight when he\u0027d pulled Pedro off of her in that Mexican alley.\u003c/p\u003e\n\u003cp\u003eJonas continued moving forward in the corridor. He took his time, concentrating on the feeling of being in control. On previous occasions when he entered the corridor he had always been forced to deal with the immediate impact of emotions and images that were waiting to swamp him. Entering the corridor had always meant going into battle. But not tonight. A vast relief and a sense of satisfaction poured through Jonas. There was no doubt that Verity\u0027s presence strengthened him in some way.\u003c/p\u003e\n\u003cp\u003eVerity\u0027s presence made it possible to tame the flickering ghosts of the past.\u003c/p\u003e\n\u003cp\u003eHe would connect with Verity in the corridor and then he would turn to confront the ghosts.\u003c/p\u003e\n\u003cp\u003eJonas pushed his way through the last of the shadows and found Verity waiting for him. She stood braced, her hands in small, determined fists at her sides. The feeling of being anchored grew stronger.\u003c/p\u003e\n\u003cp\u003eA part of Jonas had the freedom now to make some observations.\u003c/p\u003e\n\u003cp\u003eOne of the things he noticed was that he and Verity both appeared to be dressed exactly as they had been all evening. Apparently the mental images they constructed in their minds reflected current reality outside the corridor. The main difference was that inside the tunnel they each moved independently. In current time/space, neither one got up from the table, but inside the corridor each had full capability of movement.\u003c/p\u003e\n\u003cp\u003eJonas saw the wariness in Verity\u0027s eyes and tried a reassuring smile. He came to a halt in front of her, not touching her in the corridor.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" he said, wondering if she would break and run.\u003c/p\u003e\n\u003cp\u003e\"Hi, yourself,\" Verity tore her gaze from his face and glanced around. \"So this is it, huh?\"\u003c/p\u003e\n\u003cp\u003e\"This is it. Think of it as a tunnel through the sea. Instead of being surrounded by water, we\u0027re surrounded by time. We\u0027re immersed in it.\"\u003c/p\u003e\n\u003cp\u003eVerity hugged herself and nervously rubbed her upper arms. \"And you think that some bits and pieces of time enter this corridor?\"\u003c/p\u003e\n\u003cp\u003e\"When I handle an object that carries a strong load of emotion from the time frame I seem sensitive to, those emotions seep into the corridor. It\u0027s as if they\u0027re trying to relink with the object itself through me. It\u0027s hard to explain, Verity, but it\u0027s real.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s another explanation,\" she said defensively.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"We might both be going crazy.\"\u003c/p\u003e\n\u003cp\u003eJonas shook his head. \"Believe me, I\u0027ve considered that possibility. But we\u0027re not going crazy. Come with me. I want to see what happens when we face the emotional junk connected with the pistol.\" He held out his hand.\u003c/p\u003e\n\u003cp\u003eVerity hesitated and then gave him her hand. He circled her wrist and tugged her gently down the corridor. He felt her flinch, but she made no protest. She was going to go through with this, just as she had promised. Jonas felt a wealth of gratitude and admiration well up in him.\u003c/p\u003e\n\u003cp\u003eThey didn\u0027t have to go far in the corridor to find what Jonas sought. They hadn\u0027t gone more than a few steps into the swirling mists when the colorful, snaking tendrils appeared and began to curl hungrily around them.\u003c/p\u003e\n\u003cp\u003eThe multicolored ribbons headed first toward Jonas like a pack of dogs cornering a fox. But then something happened. They slowed, veered aside, and slowly turned toward Verity.\u003c/p\u003e\n\u003cp\u003e\"Jonas? What\u0027s happening?\" Verity shifted anxiously as the multicolored manifestations swirled around her. She batted at them with a free hand.\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t hurt you. You\u0027re not sensitive to them in the same way I am. But for some reason you\u0027re a magnet for them. Your presence frees me, Verity. Together we\u0027re a lot stronger than they are. Feel anything?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said quickly and then changed her mind. \"Yes. I don\u0027t know. It\u0027s weird, Jonas.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-56.html","bookId":1797,"creation":"Oct 5, 2019 4:27:07 PM","modification":"Oct 5, 2019 4:27:07 PM"}
