{"id":80473,"no":96,"title":"Page 96","content":"\u003cp\u003eJonas contemplated that for a time and then nodded soberly. \"You\u0027re right. As usual.\" He stretched out his unban-daged arm and pulled her down onto his chest. His lashes lifted and he looked deeply into her eyes. For a moment the gold in his gaze was so hot it could have melted steel. Then Jonas grinned slowly and wickedly. \"You saved my ass, sweetheart. I wouldn\u0027t have made it without you. I owe you.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t owe me, Your ass needed saving because you were busy saving mine at the time.\"\u003c/p\u003e\n\u003cp\u003eHis grin broadened and he gave her derriere a proprietary pat. \"Having saved two such valuable portions of our respective anatomies, we should probably celebrate in an appropriate fashion.\"\u003c/p\u003e\n\u003cp\u003e\"Your arm...\"\u003c/p\u003e\n\u003cp\u003e\"It was not my arm I was proposing to employ in the endeavor.\"\u003c/p\u003e\n\u003cp\u003eShe felt his manhood stirring against her thigh. \"Not yet, Jonas. We have some more talking to do.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\" He ran a finger along the upper curve of her breast.\u003c/p\u003e\n\u003cp\u003e\"About what might have happened if the forces in that corridor had overwhelmed you, for one thing!\"\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t, so let\u0027s not talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t ignore that kind of power, Jonas,\" she said fretfully.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been living with the threat a long time. I\u0027ve survived so far. And now I\u0027ve got you. I\u0027m in better shape than ever.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think you\u0027re the only person on the face of the earth who\u0027s faced with dealing with whatever comes through that corridor?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. There were other people being tested at Vincent College. Maybe one of them had some talent. Right now I don\u0027t know and I don\u0027t particularly care. All I want to do at this moment is make love to you.\"\u003c/p\u003e\n\u003cp\u003e\"Does this mean you\u0027ve decided not to beat me after all for leaving the party to follow Kincaid?\"\u003c/p\u003e\n\u003cp\u003eJonas squeezed her bare buttock. \"Let\u0027s just say I\u0027m feeling indulgent and will probably let you go unscathed this time. Also, with one arm in bandages, it would be hard to administer the kind of spanking you need. Too much like work. Maybe later.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t hold your breath.\" Reluctantly Verity let herself be drawn into his sexy, teasing mood. There were still a lot of questions she wanted to ask, but she sensed that he would only stonewall her if she tried to get answers now. Jonas was making it clear that he did not want to discuss his frightening talent or the future. And this morning she was too glad to have him alive to want to push him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not planning on holding my breath. I much prefer holding you. But in view of my somewhat incapacitated position, you\u0027re going to have to do all the work,\" Jonas told her.\u003c/p\u003e\n\u003cp\u003eVerity smiled with a feeling of sudden triumph. \"I get to do the work? You\u0027ve finally decided I\u0027m not such an innocent after all?\"\u003c/p\u003e\n\u003cp\u003e\"Lady,\" he announced in grave tones, \"this is your chance to prove to me that you have the makings of a siren, a scarlet woman, and a seducer of men. Show me what a heartless temptress you can be.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re on,\" she agreed and yanked the sheet down past his hips. For an instant she stared at the aroused, aggressive fullness she found there. \"No, I take that back. You\u0027re up.\"\u003c/p\u003e\n\u003cp\u003e\"You could say that.\"\u003c/p\u003e\n\u003cp\u003eShe reached out to touch him intimately, loving the contrast between the rock-hardness of his shaft and the velvety skin that covered it. Some of the teasing light left Jonas\u0027s eyes and was replaced by a familiar male hunger.\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, sweetheart,\" he breathed, \"that\u0027s it. Your hands always feel so good. So damn good.\"\u003c/p\u003e\n\u003cp\u003eVerity slipped her fingers down to cup the swelling mounds at the base of his shaft. She leaned forward and dropped a tiny kiss on one male nipple. Jonas\u0027s groan of pleasure came from deep in his chest. His legs shifted under the sheet and his fingers tangled in her hair.\u003c/p\u003e\n\u003cp\u003eVerity gave herself up to the joy of making love to him. She moved over him with growing delight, tasting him with the tip of her tongue, exploring him with fingers that were sensitive to every reaction they elicited.\u003c/p\u003e\n\u003cp\u003eShe slid down the length of him, dropping warm, damp kisses in her wake until she reached the rough, curly hair that framed his manhood. Her own red hair spilled across his flat stomach as she boldly brushed her mouth against the pulsing hardness of him. Jonas\u0027s whole body seemed to clench in reaction. His hips lifted, silently pleading for more of the erotic attention.\u003c/p\u003e\n\u003cp\u003eVerity obliged willingly, thrilled by his response. It was unbelievably exciting to be able to excite this man. It gave her a heady feeling of feminine power that was unlike anything she had known.\u003c/p\u003e\n\u003cp\u003e\"Jonas?\" she whispered softly.\u003c/p\u003e\n\u003cp\u003eHe grunted and used his palm against the back of her head to hold her where he wanted her. She took him into her mouth and Jonas sucked in his breath.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it, babe,\" he gasped. \"That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003eHe tasted hot and male and musky. Verity sampled him carefully and then bravely experimented with her teeth.\u003c/p\u003e\n\u003cp\u003e\"Verity!\"\u003c/p\u003e\n\u003cp\u003eShe freed him and scrambled up to sit astride his thighs. Her fingers splayed across his chest as she gripped him firmly with her legs. \"How am I doing?\" she asked throatily as she eased herself down until he was at the entrance of her small passage.\u003c/p\u003e\n\u003cp\u003eJonas opened his eyes, his expression taut with desire. \"Don\u0027t worry,\" he muttered, \"you have my vote for the Most Wicked Woman of the Year award. Stop tormenting me and get on with the job.\"\u003c/p\u003e\n\u003cp\u003eVerity laughed down at him and then gasped as he tightened his fingers around her legs and pushed her bent knees farther apart. The action forced her to sink quickly, more quickly than she had planned, and he rose to meet her. He thrust himself swiftly and deeply into her.\u003c/p\u003e\n\u003cp\u003e\"Talk about wicked seducers,\" she complained in a thick, husky tone as she tried to adjust to the sudden intrusion.\u003c/p\u003e\n\u003cp\u003e\"Show me how much you want me, sweetheart.\"\u003c/p\u003e\n\u003cp\u003eShe obeyed, glorying in the excitement they created between them, loving the feel of him deep inside her and the sense of possession she felt.\u003c/p\u003e\n\u003cp\u003eWhen their tightly wound spring of passion came apart in a shattering release, Verity collapsed across Jonas, clinging to him as if he were a lifeline in a storm. His body shuddered heavily again and again as he poured himself into her, then he held her fiercely against his damp chest.\u003c/p\u003e\n\u003cp\u003eWhen it was all over Verity opened her eyes and accepted the fact that she was in love with Jonas Quarrel. She was contemplating that when she happened to glance at the clock beside the bed.\u003c/p\u003e\n\u003cp\u003e\"Jonas, the auction! I almost forgot.\" Verity lifted herself quickly, slithering to the side of the bed.\u003c/p\u003e\n\u003cp\u003e\"Hurry. It\u0027s due to start in an hour.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell are you talking about?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-96.html","bookId":1797,"creation":"Oct 5, 2019 4:27:07 PM","modification":"Oct 5, 2019 4:27:07 PM"}
