{"id":81628,"no":10,"title":"Page 10","content":"\u003cp\u003eWhen I finally look at the clock, I notice it\u0027s been seven hours since I ran out on Emily and my feelings. As I look out in front of me, the gray asphalt blurring with yellow and white lines, I make the decision to keep going. I don\u0027t want to be the one to ruin her.\u003c/p\u003e\n\u003cp\u003eNo matter how far I drive, I come to the same conclusion over and over again. I must have given Emily some sign of my feelings for her. It was never my intention. I\u0027m a stock boy at a grocery store. She needs someone to take care of her...buy her all the things she\u0027s never had. She doesn\u0027t need an orphaned schmuck with less money than common sense.\u003c/p\u003e\n\u003cp\u003eUsually, forty-eight hours doesn\u0027t seem like a whole lot. However, it\u0027s the longest I\u0027ve been away from Emily in the time I\u0027ve known her. It\u0027s hard for me to believe I\u0027ve only known her such a short time because she\u0027s my whole life. How can your whole life be consumed by one person you haven\u0027t known your entire life?\u003c/p\u003e\n\u003cp\u003eSince I don\u0027t know the answer to that, I keep driving.\u003c/p\u003e\n\u003cp\u003eIt\u0027s Friday the 13th. I hadn\u0027t actually realized it until I stopped for gas, and the lady in front of me was writing a check. She asked what the date was. The attendant answered her in a gleeful, yet macabre tone. Can one celebrate Friday the 13th? If today is the thirteenth though, that means I\u0027ve been sleeping in my car for six days.\u003c/p\u003e\n\u003cp\u003eSix days without her beautiful eyes.\u003c/p\u003e\n\u003cp\u003eSix days without hearing the slight lilt in her voice.\u003c/p\u003e\n\u003cp\u003eSix days since she told me she loved me, and I left her - like a thief in the night. Six days of thinking about kissing, touching and holding Emily. It\u0027s the only thing I\u0027ve thought about.\u003c/p\u003e\n\u003cp\u003eSuddenly, it hits me: I know exactly what the raccoon from yesterday felt like as the wheels of the truck ahead of me rolled over him crushing him from the outside in.\u003c/p\u003e","sourceLink":"https://allnovel.net/vacant/page-10.html","bookId":1859,"creation":"Oct 5, 2019 4:36:16 PM","modification":"Oct 5, 2019 4:36:16 PM"}
