{"id":81627,"no":9,"title":"Page 9","content":"\u003cp\u003eThe words are ringing in my ears: \"I love you.\"\u003c/p\u003e\n\u003cp\u003eIt occurs to me I may have misheard. It\u0027s the only possible explanation.\u003c/p\u003e\n\u003cp\u003e\"So, you\u0027re okay? Don\u0027t listen to those girls, Emily.\" I\u0027ll just pretend those three little words aren\u0027t hanging in the air - regardless of whether they were actually said.\u003c/p\u003e\n\u003cp\u003e\"Ethan, did you hear what I just said?\"\u003c/p\u003e\n\u003cp\u003eWhat do I say? I have no idea how to approach this, so I just stare at her wide-eyed.\u003c/p\u003e\n\u003cp\u003eAfter a few moments, I feel warmth creeping up my thigh and realize its Emily\u0027s hand. At first, it\u0027s an attempt to get my attention, but as her hand ascends, I realize the intent is not so innocent.\u003c/p\u003e\n\u003cp\u003e\"We have to go. It\u0027s time to go,\" I say, stilted, like Rain Man talking about his Kmart underwear.\u003c/p\u003e\n\u003cp\u003eI grip the steering wheel for dear life because if I don\u0027t, the car and my life will go careening into the abyss. I\u0027ve spent all this time convincing myself that Emily and I could never be anything but friends. Knowing that she may feel the same about me as I feel about her will complicate things, and I suddenly feel trapped.\u003c/p\u003e\n\u003cp\u003eIt\u0027s so quiet as we drive, that I hear a small plinking that would go unnoticed otherwise, but as I near the duplex, the sound the car is making increases. I briefly wonder if it\u0027s because the plink is getting worse or the quiet is just so intense. I make a mental note to find the origin of the plinking before putting too many more miles on the car.\u003c/p\u003e\n\u003cp\u003eI should be thinking about the woman sitting next to me and her recent declaration instead of small pings, but I\u0027m not... I can\u0027t.\u003c/p\u003e\n\u003cp\u003eIf I do... no.\u003c/p\u003e\n\u003cp\u003eI can\u0027t think.\u003c/p\u003e\n\u003cp\u003eI\u0027m not even sure how I get here, but I\u0027m sitting in the middle of my bed, having an argument with myself.\u003c/p\u003e\n\u003cp\u003eIt\u0027s no surprise that I\u0027m winning.\u003c/p\u003e\n\u003cp\u003e\"She told you she loves you.\"\u003c/p\u003e\n\u003cp\u003e\"She says she loves to cook. She loves lots of things.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s in there and you\u0027re in here.\"\u003c/p\u003e\n\u003cp\u003e\"You really need to clean the ceiling fan blades.\"\u003c/p\u003e\n\u003cp\u003eI can\u0027t help but roll my eyes at myself.\u003c/p\u003e\n\u003cp\u003eWhen I finally exit my room, the apartment is dark and quiet. Emily is asleep on the couch with a tight grip on the blankets. Little does she know she\u0027s gripping at my heart the same way.\u003c/p\u003e\n\u003cp\u003eThe notebook on the side table catches my eye, and I can\u0027t help but snoop. As I near it, I see there are several wads of paper strewn across the floor - discarded because they weren\u0027t perfect. The top piece, still clinging to life in its spiral bindings, is flawless.\u003c/p\u003e\n\u003cp\u003eDear Ethan -\u003c/p\u003e\n\u003cp\u003eSitting down to write this, I\u0027ve never felt more like a young girl than I do right now. For the past two years, I\u0027ve looked at you every day in hopes that someday - you\u0027d feel for me, what I feel for you. But now I see that we perceive different things regarding our relationship. Maybe it could be classified on my part as hero worship, but I\u0027d like to think I\u0027m smarter than that. I think I know the difference between infatuation and love.\u003c/p\u003e\n\u003cp\u003eI know there is a difference in our ages, but who cares? My heart has no idea how old your heart is. I just know that if I don\u0027t tell you, it will fester inside me, and I\u0027ll die a slow painful death. I\u0027ve only ever loved my mom and never really knew what it was like to care for another person until I met you.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t fall in love with you that first day, but after many months of learning to appreciate your care and concern, I could see how kind your soul - your whole being is. That\u0027s when I knew another kind of love existed. It isn\u0027t the type of love between family members, or a crush, but a true love that is unconditional and lasting, a love that I can no longer hide.\u003c/p\u003e\n\u003cp\u003eI know you probably don\u0027t return these feelings, but I couldn\u0027t go another second without you knowing. I understand if it makes you uncomfortable, and I\u0027ll find another place to live if you feel like we can no longer be friends.\u003c/p\u003e\n\u003cp\u003eLove always,\u003c/p\u003e\n\u003cp\u003eEmily\u003c/p\u003e\n\u003cp\u003eI tightly clutch the notebook page in my hand.\u003c/p\u003e\n\u003cp\u003eHow can she do this to me?\u003c/p\u003e\n\u003cp\u003eDoesn\u0027t she know what she\u0027s done?\u003c/p\u003e\n\u003cp\u003eNo... it\u0027s not right.\u003c/p\u003e\n\u003cp\u003eNot now, and without any further thoughts, I\u0027m out the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/vacant/page-9.html","bookId":1859,"creation":"Oct 5, 2019 4:36:16 PM","modification":"Oct 5, 2019 4:36:16 PM"}
