{"id":88284,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Let’s have lunch soon,” Bethany suggested. “We’re not diving on Saturday. Can you meet us?”\u003c/p\u003e\n\u003cp\u003e“Sure. Let’s shoot for late afternoon. I don’t open until five on Saturday, when the tourists are filling the bars,” Audrey said. “I give my very best readings to drunks,” she assured them with a trace of wry amusement.\u003c/p\u003e\n\u003cp\u003e“Saturday, then,” Genevieve confirmed. “And, Audrey…thanks.”\u003c/p\u003e\n\u003cp\u003e“Sure. See you two then,” Audrey said.\u003c/p\u003e\n\u003cp\u003eShe stood in the doorway, watching as they left.\u003c/p\u003e\n\u003cp\u003e“That was kind of stupid,” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003e“Seeing Audrey?” Bethany asked.\u003c/p\u003e\n\u003cp\u003e“Seeing Audrey for five minutes,” Genevieve said. “I feel guilty.”\u003c/p\u003e\n\u003cp\u003e“And freaked out,” Bethany added.\u003c/p\u003e\n\u003cp\u003e“I’m not freaked out,” Genevieve protested.\u003c/p\u003e\n\u003cp\u003e“Well, what she said—”\u003c/p\u003e\n\u003cp\u003e“What she said was that she’s a fake,” Genevieve said sternly. “And I feel guilty for not being a better friend and keeping up.”\u003c/p\u003e\n\u003cp\u003e“We’re going to see her for lunch,” Bethany said. “And I’m getting a little worried, even if you’re not.” She held open the wrought-iron gate to the walkway so Genevieve could follow.\u003c/p\u003e\n\u003cp\u003e“That I’m cracking up—or that a ghost is after me?” Genevieve asked wearily, closing the gate behind her as they reached the street.\u003c/p\u003e\n\u003cp\u003eThen she froze.\u003c/p\u003e\n\u003cp\u003eHe was there.\u003c/p\u003e\n\u003cp\u003eThor Thompson. Casually leaning against the wall. He smiled as they saw him, nonchalantly glancing up at the sign that announced Audrey’s business.\u003c/p\u003e\n\u003cp\u003eShe could have held her temper, she told herself afterward. Should have held her temper. He hadn’t said a word.\u003c/p\u003e\n\u003cp\u003eHe didn’t need to. She saw the way he looked at the sign, then looked at her.\u003c/p\u003e\n\u003cp\u003eShe walked up to him furiously. “You followed me,” she accused him.\u003c/p\u003e\n\u003cp\u003eHe seemed a lot taller. She wasn’t short, especially in heels, but he was able to look down at her.\u003c/p\u003e\n\u003cp\u003e“We ordered your drinks for you. We didn’t know where you were. Nothing quite as bad as warm beer.”\u003c/p\u003e\n\u003cp\u003e“You followed me,” she repeated. “You son of a bitch. You had no right.”\u003c/p\u003e\n\u003cp\u003eHe arched a brow. “Maybe I followed Bethany.”\u003c/p\u003e\n\u003cp\u003e“I think Bethany ought to be getting out of here right now,” Bethany said nervously. “If you’ll both excuse me—”\u003c/p\u003e\n\u003cp\u003eThey turned to her simultaneously. “No.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Bethany said, acutely uncomfortable.\u003c/p\u003e\n\u003cp\u003e“For your information, Mr. Thompson, we were just stopping in to say hello to an old friend from school,” Genevieve advised him. “Not that it’s any of your concern.”\u003c/p\u003e\n\u003cp\u003eHe looked up at the sign again, then cast her a disdainful look. “Everything you do right now concerns me. I need you sharp and on the ball.”\u003c/p\u003e\n\u003cp\u003e“You need me sharp and on the ball? Have you forgotten something? I don’t work for you. I work for Marshall.”\u003c/p\u003e\n\u003cp\u003e“You didn’t know?” he asked.\u003c/p\u003e\n\u003cp\u003e“Know what?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Your group got hired because I recommended you,” he said quietly. “Marshall and I make decisions together, sure. That’s how good work is done. But I get the final say. On everything.”\u003c/p\u003e\n\u003cp\u003eGenevieve narrowed her eyes as she stared at him. “Is that a threat?”\u003c/p\u003e\n\u003cp\u003e“I never threaten people. I take action.”\u003c/p\u003e\n\u003cp\u003e“Did you have any difficulties with me today?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Not at all.”\u003c/p\u003e\n\u003cp\u003e“So why did you follow me?” she demanded again. “Never mind. But don’t do it again. I’ll quit before I’ll stand for being treated like a prisoner.”\u003c/p\u003e\n\u003cp\u003eNot a muscle twitched in his face. She was suddenly afraid the man wanted her to quit. “Don’t be melodramatic. It’s immaterial to me whether you stay on or not, but if you do…then it’s important that you live in the real world.”\u003c/p\u003e\n\u003cp\u003e“You son of a—”\u003c/p\u003e\n\u003cp\u003e“Genevieve, whoa. Come on, you two. The others will be missing us by now,” Bethany said lightly. “This was a great day. Can’t we just be happy with that?”\u003c/p\u003e\n\u003cp\u003e“For the moment,” Thor said. His eyes hadn’t left Genevieve’s.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Bethany urged, slipping her arm through Genevieve’s.\u003c/p\u003e\n\u003cp\u003e“Right. Fine,” Genevieve said tightly.\u003c/p\u003e\n\u003cp\u003eShe managed to walk a full five feet before spinning around to point a finger at him. “Stop it. Just stop it.”\u003c/p\u003e\n\u003cp\u003e“Stop what?” he demanded.\u003c/p\u003e\n\u003cp\u003e“Judging me, worrying about me, following me. Thinking that I’m crazy and dangerous and shouldn’t be on this project.”\u003c/p\u003e\n\u003cp\u003eHis hands went to his hips, he tilted his head, and his jaw seemed to lock. “At the moment I’m walking behind you and that’s it. If that disturbs you so much, maybe you shouldn’t be on this project.”\u003c/p\u003e\n\u003cp\u003e“I’m better than you are. I proved it today.”\u003c/p\u003e\n\u003cp\u003eHe arched a brow. “I actually found the gold,” he said quietly.\u003c/p\u003e\n\u003cp\u003eShe gasped. “Of all the insufferable assholes! I led you to it. I knew where we should be digging. I’m the one who made the find.”\u003c/p\u003e\n\u003cp\u003e“Once again, I repeat, I picked it up.”\u003c/p\u003e\n\u003cp\u003e“You’re pathetic. A man of your reputation stooping to such a desperate attempt at glory.”\u003c/p\u003e\n\u003cp\u003e“I picked it up. That’s a simple fact.”\u003c/p\u003e\n\u003cp\u003e“Excuse me, but you two are both missing something. We’re working as a team here. Does it matter who actually picked up the gold?” Bethany demanded\u003c/p\u003e\n\u003cp\u003eIt mattered. Oh, yes, it mattered, Genevieve thought.\u003c/p\u003e\n\u003cp\u003e“We really need to join the others,” Bethany continued. “We might have taken the first step today toward a historic discovery. Let’s go celebrate with a drink. You two can fight later, if you have to.”\u003c/p\u003e\n\u003cp\u003e“You’re right. I can fight with this asshole later,” Genevieve snapped.\u003c/p\u003e\n\u003cp\u003eTo Thor’s credit, he kept his mouth shut, making Genevieve wish she’d had the control to do so, as well.\u003c/p\u003e\n\u003cp\u003eThis time Bethany stepped between them, joining arms with both of them and determinedly making her way down the street.\u003c/p\u003e\n\u003cp\u003eGenevieve strode into the bar quickly. The singer was on break; the sound system was piping out something with a beat, and couples were filling the floor. Without hesitating, she headed straight for Victor, dragging him out on the floor.\u003c/p\u003e\n\u003cp\u003e“Where were you guys?” he asked.\u003c/p\u003e\n\u003cp\u003e“Just down the street,” she said, swirling beneath his arm. One good thing about Victor: they’d known each other forever and danced well together. She didn’t feel badly about using him tonight; he dragged her out on the floor whenever he wanted to make sure some hot female knew he was capable of moving to the music. Right now, spinning about in a high-speed hustle was definitely a good way to release some of the energy she was feeling. And the anger.\u003c/p\u003e\n\u003cp\u003e“What the hell is the matter with you tonight?” Victor asked quizzically. “I’m the one who should be in a huff. You’re my partner, but you wait until you go off with the stud to come up with the goods.”\u003c/p\u003e\n\u003cp\u003eShe turned under his arm and faced him again. “I’d rather dive with you, believe me,” she assured him.\u003c/p\u003e\n\u003cp\u003e“Why didn’t we come up with something before? Oh, right. Because you were busy seeing bodies in the water.”\u003c/p\u003e\n\u003cp\u003e“Can it, Victor.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Boo!”\u003c/p\u003e\n\u003cp\u003e“Victor…”\u003c/p\u003e\n\u003cp\u003e“Come on, Gen. Ease up.”\u003c/p\u003e\n\u003cp\u003eEase up? Yes, she needed to. She didn’t want to quit. He might be in charge, but this was her home. She wanted—deserved—to be a part of this.\u003c/p\u003e\n\u003cp\u003eAnd she was the one who had found the relic.\u003c/p\u003e\n\u003cp\u003e“Gen?” Victor said, breaking into her thoughts.\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Everybody looks ready to move on.”\u003c/p\u003e\n\u003cp\u003e“Let’s go then.”\u003c/p\u003e\n\u003cp\u003eUnfortunately, they had to pass under Audrey’s sign to reach their next destination. Genevieve made a point of ignoring it and walking ahead. She linked arms with Marshall, keeping up with him, ahead of Thor Thompson. She tried to talk with Marshall as casually as she always did, but she could tell she was talking too much. She tried to slow herself down.\u003c/p\u003e\n\u003cp\u003eShe’d never touched a drop of her beer in the first bar. When they entered the second, she hailed the bartender and made a point of buying the first round and delivering the drafts to each member of their party—even Thor.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to remain at the table, but Victor shook his head when she tried to get him out on the floor. When she tried again, he pleaded exhaustion.\u003c/p\u003e\n\u003cp\u003e“I’ll hit the dance floor with you,” Thor said, standing.\u003c/p\u003e\n\u003cp\u003e“Oh, that’s all right.”\u003c/p\u003e\n\u003cp\u003e“No, it’s cool.”\u003c/p\u003e\n\u003cp\u003e“I’m not trying to make anyone dance,” she said.\u003c/p\u003e\n\u003cp\u003e“The hell you’re not,” Victor piped in.\u003c/p\u003e\n\u003cp\u003eFlushing, she found herself spinning out on the floor. The band was playing a rumba. She had no idea what to do, but apparently Thor Thompson had—somewhere, sometime—learned how to dance. He knew what he was doing, leading her, not pushing her around. Under other circumstances he would have been an exceptional partner, even the perfect height for her.\u003c/p\u003e\n\u003cp\u003e“You don’t have to do this,” she murmured.\u003c/p\u003e\n\u003cp\u003e“It’s good music. A nice place.”\u003c/p\u003e\n\u003cp\u003e“This is a great place to live.”\u003c/p\u003e\n\u003cp\u003e“I believe you.”\u003c/p\u003e\n\u003cp\u003e“Strange. You don’t believe much.”\u003c/p\u003e\n\u003cp\u003e“You don’t tell the truth all that often.”\u003c/p\u003e\n\u003cp\u003e“Maybe we all see different things as truth.”\u003c/p\u003e\n\u003cp\u003e“Then you’re not even telling me what you see as the truth,” he informed her.\u003c/p\u003e\n\u003cp\u003e“You don’t want the truth,” she said quickly, looking downward. Then she stared up at him again, “And you’re not great at telling the truth yourself.”\u003c/p\u003e\n\u003cp\u003eHe drew back slightly, looking at her, lips twitching. “Oh?”\u003c/p\u003e\n\u003cp\u003e“I made the find. You lost, but you don’t want to give up your boat, so you’re believing what you want to believe.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-13.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
