{"id":88295,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAnd it was hard to escape when he’d just ordered food.\u003c/p\u003e\n\u003cp\u003e“Hey, hey, hey…so those who discover together sleep together, huh?” Victor teased, taking a seat at the bar alongside Thor and Jack.\u003c/p\u003e\n\u003cp\u003eApparently, it didn’t matter that Jack had been talking about Genevieve; the fact that she had walked into his cottage late last night and walked out that morning might as well have been on wide-screen TV.\u003c/p\u003e\n\u003cp\u003e“As long as our Gen is happy,” Jack said. He was still grinning, but there seemed to be a paternal warning in the words despite the fact that he was working for Thor.\u003c/p\u003e\n\u003cp\u003e“If she’s happy, I’m happy,” Thor said smoothly.\u003c/p\u003e\n\u003cp\u003e“Yeah?” Victor accepted a cup of coffee from the morning bartender and turned to Thor. “But you think she’s crazy, right? What the hell. If I met a stranger who looked like Gen and she was willing, I’d give it a go—even if I questioned her sanity. I mean, you don’t have to be sane in bed. In fact, I think it’s better when there’s a little insanity going on.”\u003c/p\u003e\n\u003cp\u003eScrew breakfast. Thor stood, trying to remember that these people were her friends, that they cared about her. And he had to admit, he was feeling a little guilty.\u003c/p\u003e\n\u003cp\u003ePart of him did want to keep his distance. He didn’t want to find himself inextricably involved with someone who hallucinated on a regular basis.\u003c/p\u003e\n\u003cp\u003e“I have an appointment. I think I’ll skip breakfast,” he said.\u003c/p\u003e\n\u003cp\u003eAlex came walking toward the tiki bar just as he was leaving. “Hey, hey, hey. I hear you’ve got a new thing going.”\u003c/p\u003e\n\u003cp\u003e“Have a great fucking day, Alex,” Thor muttered, and headed for the parking lot.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eA udrey looked pretty and completely normal—just as she had always looked—when they met. They chose Pierre’s, an off-the-beaten-path local place up by the Bahamian village. Anthony, Audrey informed them as they waited for the owner to prepare them a special table, believed in her powers.\u003c/p\u003e\n\u003cp\u003e“What powers?” Bethany asked. “Exactly.”\u003c/p\u003e\n\u003cp\u003e“The powers I don’t have,” Audrey explained ruefully. “Oh, there we go—the table by the fountain.” As they were seated, she introduced them to the tall, thin Bahamian who owned the place.\u003c/p\u003e\n\u003cp\u003eHe smiled and shook Bethany’s hand, first, but when he took Genevieve’s hand, his smile faded and he looked worried.\u003c/p\u003e\n\u003cp\u003e“You’ve come for help,” he said gravely.\u003c/p\u003e\n\u003cp\u003eShe shook her head, suddenly uneasy. “I’m just here for lunch with my friend,” she said lightly. “And what a lovely place. I can’t believe I haven’t been here yet.”\u003c/p\u003e\n\u003cp\u003eHe didn’t take her comment lightly. He didn’t even thank her for the words. He shook his head, muttering something in a language she didn’t understand, then told her, “I will pray for you, our special prayers. We know the dead walk among us. Others are blind. They are afraid. They think pretending not to see things will make them go away. They are mistaken. The dead come back for a reason.”\u003c/p\u003e\n\u003cp\u003eHe nodded somberly at her, then gave himself a shake and offered them a broad white smile. “Enjoy your lunch.”\u003c/p\u003e\n\u003cp\u003eAfter he left, they all sat in stunned silence for a minute.\u003c/p\u003e\n\u003cp\u003eBethany reached across the table, covering Genevieve’s hand with her own.” That was the luck of the draw. He had to say something like that to one of us. He happened to pick you.”\u003c/p\u003e\n\u003cp\u003e“Bull!” Audrey exploded. “Anthony knows things.”\u003c/p\u003e\n\u003cp\u003eBethany stared at her wide-eyed. “You’re a fake. You told us so yourself.”\u003c/p\u003e\n\u003cp\u003eAudrey sighed. “I’m a fake, yes. But that doesn’t mean I don’t know people who are real, that I don’t hear the buzz on people who really do…know things.”\u003c/p\u003e\n\u003cp\u003e“What the hell does that mean?” Bethany asked.\u003c/p\u003e\n\u003cp\u003eAudrey looked at Genevieve. “I’ve taken the liberty of calling in…a man.”\u003c/p\u003e\n\u003cp\u003e“Oh, no,” Genevieve groaned softly.\u003c/p\u003e\n\u003cp\u003eAudrey shook her head. “No, no, you don’t understand. I got his number from a friend who got it from a friend…he handles investigations for the government, for God’s sake. He’s the real thing.”\u003c/p\u003e\n\u003cp\u003eGenevieve sighed. “How do you know that?”\u003c/p\u003e\n\u003cp\u003e“Because I read all the articles, and I go to meetings and…Trust me, the only way I pull off any of this is because I know what’s going on. It’s like any job. I do my research. I know when I’m reading about a bunch of fakes—like me—versus the real thing. Go ahead and look him up yourself. His name is Adam Harrison, Harrison Investigations. He and his company don’t troll for business. He isn’t in it for the money.”\u003c/p\u003e\n\u003cp\u003e“Then why…?” Bethany asked skeptically.\u003c/p\u003e\n\u003cp\u003e“He lost someone years ago. Anyway, he has a knack for knowing when people are seeing someone, getting a message from someone beyond the grave. He doesn’t have the gift himself, but he can recognize it in others. Even though he doesn’t see them himself, he isn’t blind, like Anthony said. He knows.” She reached into her handbag and handed Genevieve a folded sheet of paper she had apparently ripped from one of her psychic journals. “You’ll see, once you read it. Look, weird things are happening to you, right?”\u003c/p\u003e\n\u003cp\u003eTheir waitress arrived, so Genevieve didn’t answer until they ordered.\u003c/p\u003e\n\u003cp\u003e“Yes, weird things are happening to me,” Genevieve murmured once the waitress had gone.\u003c/p\u003e\n\u003cp\u003e“So weird she wound up in a hot new relationship with Thor,” Bethany said, grinning.\u003c/p\u003e\n\u003cp\u003eAudrey stared at Genevieve. “Thor Thompson, huh? Cool. Except that…well, it will probably be different with you.”\u003c/p\u003e\n\u003cp\u003e“What will be different?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“Well, he’s not known for sticking around anywhere,” Audrey murmured. “But then, you’re different.”\u003c/p\u003e\n\u003cp\u003eShe was different, all right. She was worse. Far worse. She was crazy.\u003c/p\u003e\n\u003cp\u003e“Thanks,” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003eAudrey shook her head. “I’m sorry, that came out wrong. You know what’s freaky, though?” Audrey asked her.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Well, you know how I keep telling you I’m a fake? But I don’t even know everything that’s happening to you, but…I get a creepy feeling. As if there’s an aura around you. In fact, when you two left the other night, I was afraid. As if some kind of dark shadow remained when you were gone.”\u003c/p\u003e\n\u003cp\u003e“It’s her, not me,” Bethany said quickly.\u003c/p\u003e\n\u003cp\u003e“Bethany!” Genevieve snapped.\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“Anyway, don’t worry. Like I said, Adam Harrison is coming himself. He’ll talk to you, probably bring in a few investigators.”\u003c/p\u003e\n\u003cp\u003e“Audrey, no! I can’t let that happen. I’ll be thrown off the project so fast you won’t believe it,” Genevieve told her.\u003c/p\u003e\n\u003cp\u003e“These aren’t the kind of people who come in and make a big splash. Trust me. Adam will be discreet.”\u003c/p\u003e\n\u003cp\u003e“You’re acting like you know the man, but you don’t. You got his number from a friend, who got it from their friend,” Genevieve said.\u003c/p\u003e\n\u003cp\u003e“Genevieve, please, have some faith in me,” Audrey implored.\u003c/p\u003e\n\u003cp\u003e“I do. I just wish you hadn’t asked anyone in without talking to me first,” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003e“Do you want to go on just being scared and miserable?” Audrey asked.\u003c/p\u003e\n\u003cp\u003e“It will be okay,” Bethany said quietly. “Look, as long as people are discreet, who’s to know what they’re doing?”\u003c/p\u003e\n\u003cp\u003e“I don’t have a great feeling about this,” Genevieve said doubtfully.\u003c/p\u003e\n\u003cp\u003eAudrey waved a hand in the air. “Most people think ghosts are fun. They enjoy being a little bit scared.”\u003c/p\u003e\n\u003cp\u003e“That’s because they’re not really seeing ghosts,” Genevieve said.\u003c/p\u003e\n\u003cp\u003e“Open up a little. That ghost is probably trying to help you.” Audrey sighed. “I wish a ghost would help me find a treasure.”\u003c/p\u003e\n\u003cp\u003e“I found one coin,” Genevieve said. “Not exactly a treasure.”\u003c/p\u003e\n\u003cp\u003e“But she’s leading you to the treasure. Let her,” Audrey said. She reached down into her bag again and brought out a stack of papers. “I looked into the ship you guys are trying to find. Which I know you already did, but I had my own reasons.” She stared shrewdly at Genevieve. “You don’t believe the woman you’re seeing is the poor dead girl they found on the beach, do you?”\u003c/p\u003e\n\u003cp\u003eGen stared at her in shock. “How did you…? No, never mind. I don’t want to know.”\u003c/p\u003e\n\u003cp\u003e“I knew it,” Audrey said. “So listen, Gasparilla had quite a crush on this one woman. Interesting, because he could kind of plunder, pillage and rape at will. Maybe all guys just want the girl they can’t have. Anyway, apparently he had a real thing for the captain’s daughter, Anne. But even when he got hold of her, she spurned him for her young Spaniard, Aldo. Gasparilla was known for his violent temper and you’re talking about a time when people were hanged for the least offense. Life was cheap. To Gasparilla, execution might have seemed like the right punishment for a woman who spurned him. So maybe your ghost is Anne, the captain’s daughter.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Genevieve heard herself say.\u003c/p\u003e\n\u003cp\u003e“You know it makes sense. She likes you. Maybe she knows you care about more than just the treasure. Whatever. I truly believe once Adam gets here, he’ll find a way to explain things and make you comfortable with what you’re seeing. Your days are going to be a lot better.”\u003c/p\u003e\n\u003cp\u003e“And what do I do about my nights?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“Easy,” Audrey grinned. “Keep sleeping with the stud.”\u003c/p\u003e\n\u003cp\u003eDespite the savage damage done to the body by the sea, salt, exposure and hungry ocean creatures, it was still possible to see that the young woman had been pretty. Once. Even the fact that she had been sewn back together after the autopsy couldn’t hide the fact that she had been blessed with great bone structure. Her hair had been a soft, natural blond. As the M.E. discussed the way the marks at her ankles gave evidence of her desperate effort to free herself, Jay’s phone rang. The M.E. continued speaking unemotionally to Thor, detailing the water in her lungs, and the blood marks in her eyes. Because of the man’s dispassionate tone, Thor was surprised when he met the doctor’s eyes across the width of the gurney and saw sadness there. “Poor thing,” the M.E. said. “All that potential, lost. She was young. She wanted to live,” he added softly. Looking up at Thor, he told him, “I have a daughter just about this age. And as long as I’ve done this, there’s a part of me that is still staggered by man’s inhumanity to man.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-24.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
