{"id":88296,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJay came back into the room. “She has a name,” he said. “Amanda Worth.”\u003c/p\u003e\n\u003cp\u003e“Family?” the M.E. asked.\u003c/p\u003e\n\u003cp\u003eJay shook his head. “None known. We got her name because some guy called in anonymously to tell us who she was. What she was.”\u003c/p\u003e\n\u003cp\u003e“And what was she?” Thor asked.\u003c/p\u003e\n\u003cp\u003eJay looked at him, troubled. “A working girl from Miami. Drifted south from somewhere up north. I guess she started out as a cocktail waitress on the beach, then found out that in certain clubs she could make a lot more money by being a little bit friendlier. The years went by. Younger girls came in. Then guys with the bigger bucks weren’t so interested. Business had begun to slide for her.” He shook his head. “Old and used up—at thirty. She’d picked up a cocaine habit, too, and started hitting the streets.”\u003c/p\u003e\n\u003cp\u003e“None of that seems surprising, even if it’s sad,” Thor said. “She got mixed up with the wrong guy in Miami, I guess. He took her out on a boat and…hell, boats in Miami. There’s a needle in a haystack for you.”\u003c/p\u003e\n\u003cp\u003eJay shook his head. “The caller seemed to know her pretty well. He said she had been all excited about a week or so ago, thought she was going to hook up with someone who might turn out to be more than a john.”\u003c/p\u003e\n\u003cp\u003e“And…?” Thor prodded.\u003c/p\u003e\n\u003cp\u003eJay stared him, then sighed.\u003c/p\u003e\n\u003cp\u003e“According to the caller, she said she’d be heading south. The guy wanted her to see his home. In Key West.” Jay shook his head sorrowfully. “It sucks. I’m looking for a local murderer.”\u003c/p\u003e\n\u003cp\u003e“Then people need to be really careful,” Thor said softly. He was disturbed to feel a deep sense of unease. He tried to talk himself out of his fears. After all, the people he knew, the people he worked with, weren’t hookers and coke addicts. Even so, he found himself thinking with relief that the dead girl was a blonde, not a redhead, like Genevieve, not that that was necessarily even a factor. Besides, Bethany was a blonde, so maybe she needed to be especially careful.\u003c/p\u003e\n\u003cp\u003eHe was bothered by the bizarre turn his thoughts were taking. He found himself realizing he was becoming involved, something he wasn’t sure he’d intended to do, and it made him feel…disturbed. It was the only word he could think of. He was falling for a woman who saw ghosts. And there was a murderer on the streets.\u003c/p\u003e\n\u003cp\u003eNone of it connected, he told himself.\u003c/p\u003e\n\u003cp\u003eHe and Jay thanked the M.E. When they left, he asked, “Think your higher-ups would let me use a police computer?”\u003c/p\u003e\n\u003cp\u003eJay shrugged. “Sure. With your connections…don’t see why not. Just what are you looking for?”\u003c/p\u003e\n\u003cp\u003eThor hesitated. “Disappearances…murders.”\u003c/p\u003e\n\u003cp\u003e“We don’t have much of a crime rate down here,” Jay said, his tone slightly defensive.\u003c/p\u003e\n\u003cp\u003e“Should make it easy, then,” Thor told him.\u003c/p\u003e\n\u003cp\u003eMarshall didn’t know quite what possessed him that day. He knew that any significant discovery could take not just days, but weeks or months. Sure, they had a coin, but the debris field could stretch well over a mile, taking into consideration the battle was fought just before the storm delivered the coup de grâce.\u003c/p\u003e\n\u003cp\u003eHe didn’t believe in diving alone. Even top-ranked divers died that way. And he had a crew, a great crew.\u003c/p\u003e\n\u003cp\u003eA crew that included Genevieve Wallace, who despite having suddenly gone off the deep end on him—no pun intended, he assured himself—had made the first discovery. So…\u003c/p\u003e\n\u003cp\u003eSo everyone had Saturday off. And God knew what they were all doing. Trying to take their minds off things, probably. It wasn’t every day a body washed up on the beach.\u003c/p\u003e\n\u003cp\u003eHis own mood wasn’t great, but the urge to dive was on him. It was like a senseless itch, as if someone were pushing him to do something he didn’t want to and knew he shouldn’t. He fought it for a while. Then, just after lunch, he took off by himself. He found his coordinates, set out a dive flag and plunged in.\u003c/p\u003e\n\u003cp\u003eThe reefs here were familiar to him, as familiar as the back of his hand. For people who spent their time in these waters, there were landmarks, just like tall buildings, statues, even curves in the road. He knew where Genevieve and Thor had found the coin; they had left a bright blue marker to identify the spot.\u003c/p\u003e\n\u003cp\u003eStaghorn coral covered the seabed beneath him. Beds of brain coral also found a home in the area. The fish life was rich and varied, as well. Fish in a myriad of colors darted all around him. He kept close to the bottom, searching the sand for any little ripple or oddity.\u003c/p\u003e\n\u003cp\u003eHe had painstakingly covered about twenty feet of the ocean bed when he felt the first bump against his right thigh.\u003c/p\u003e\n\u003cp\u003eHe straightened instantly, reaching to his calf for his dive knife.\u003c/p\u003e\n\u003cp\u003eHis first thought was, shark.\u003c/p\u003e\n\u003cp\u003eHe wasn’t frightened by the thought; he’d been in the company of sharks—lemons, hammerheads, blue, reef tips—on many occasions. This was the ocean; it was where they lived. They preferred to stay away from divers most of the time. Every once in a while though, a shark would become curious and get close. Sometimes one would even butt a diver. But it was true, in his experience, at least, that clanging a knife against a dive tank or simply landing a good punch on the creature’s nose would quickly send it away, even if it was a pretty big boy.\u003c/p\u003e\n\u003cp\u003eOr it could be a grouper, which could grow to huge sizes. They could be friendly. In fact, divers often found a grouper hanging around the same reef on a daily basis; they would name it, and sometimes tourists would come and pet the damned fish.\u003c/p\u003e\n\u003cp\u003eBut when he looked around, he saw nothing. There was no six-hundred-pound grouper nearby that could have given him a friendly nudge. And if it had been a shark, it had disappeared damned fast.\u003c/p\u003e\n\u003cp\u003eHe took his time, surveying his surroundings in all directions. Nothing. He turned back to his study of the ocean floor. He covered another twenty feet.\u003c/p\u003e\n\u003cp\u003eAnd then it came again.\u003c/p\u003e\n\u003cp\u003eA feeling that he’d been…\u003c/p\u003e\n\u003cp\u003ePushed. Shoved.\u003c/p\u003e\n\u003cp\u003eAnd that he wasn’t wanted here.\u003c/p\u003e\n\u003cp\u003eWhich was absurd. He was too old, too experienced and too levelheaded to believe anything so foolish.\u003c/p\u003e\n\u003cp\u003eBut the sense of unease had settled in, just like the itch to get into the water had settled over him earlier. He told himself that he was a rational man. He held still, listening to the sound of his own breath through the regulator.\u003c/p\u003e\n\u003cp\u003eAfter a moment, he went on once again.\u003c/p\u003e\n\u003cp\u003eThe next shove came almost immediately. And it was hard. It sent him flying through the water.\u003c/p\u003e\n\u003cp\u003eMarshall didn’t pause to think at all. He didn’t even look around. He shot to the surface, then swam for all he was worth until he reached his boat. Even as he threw his flippers up on the dive platform and wrenched off his mask, he felt a tug. On his leg. A forceful pull that threatened to drag him down into the depths…\u003c/p\u003e\n\u003cp\u003eNo, he thought. Not like this.\u003c/p\u003e\n\u003cp\u003eAnother jerk, hard against his ankles…\u003c/p\u003e\n\u003cp\u003e“God, no!”\u003c/p\u003e\n\u003cp\u003eThere was a screaming, keening sound that seemed to tear across the blue sky, scattering the powdery clouds…\u003c/p\u003e\n\u003cp\u003eThe sound was him.\u003c/p\u003e\n\u003cp\u003eThere was no one at the tiki bar when Genevieve and Bethany returned from their lunch. Bethany yawned. “I think I’m going to take a nap,” she said, then looked at Genevieve. “No, no, I’m not. I’m not going to leave you alone.”\u003c/p\u003e\n\u003cp\u003e“Bethany, I’m fine. I can’t spend my entire life around other people,” Genevieve told her.\u003c/p\u003e\n\u003cp\u003e“Yes, but let’s wait until you meet that Adam guy, huh?”\u003c/p\u003e\n\u003cp\u003eGenevieve, staring down the docks, noticed that Marshall’s boat was gone. She turned to Bethany, ignoring her friend’s last comment. “Marshall went out.”\u003c/p\u003e\n\u003cp\u003e“Marshall is impatient,” Bethany said.\u003c/p\u003e\n\u003cp\u003e“He was the one who said we should take things slow, that this job was going to take time, and we shouldn’t forget to have lives, so we wouldn’t get sick of the work,” Genevieve reminded her.\u003c/p\u003e\n\u003cp\u003e“Maybe he went fishing,” Bethany suggested.\u003c/p\u003e\n\u003cp\u003e“Alone?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“How do you know he’s alone?”\u003c/p\u003e\n\u003cp\u003e“Good point. I don’t.”\u003c/p\u003e\n\u003cp\u003eBethany yawned again. “Damn it. Go take a nap,” Genevieve told her.\u003c/p\u003e\n\u003cp\u003e“No, we can do something lazy, like watch a DVD.”\u003c/p\u003e\n\u003cp\u003eLooking around, Genevieve saw that Victor’s door was ajar. “No,” she said firmly. “Look.” She set her hands on Bethany’s shoulders, turning her friend so she could see Victor open the door. “I won’t be alone. I’ll go visit Victor. Quiz him about his latest conquests. He’ll enjoy that. I’ll be fine. You go and take a nap.”\u003c/p\u003e\n\u003cp\u003e“How do you know he isn’t entertaining a conquest right now?” Bethany demanded.\u003c/p\u003e\n\u003cp\u003e“Because his door is open,” Genevieve told her.\u003c/p\u003e\n\u003cp\u003e“Okay, now you have a good point. But if you need me—”\u003c/p\u003e\n\u003cp\u003e“If I need you, I swear, I’ll be on your doorstep. Promise.”\u003c/p\u003e\n\u003cp\u003eBethany at last gave her a hug, yawned again and started off for her own cottage. Genevieve turned to head toward Victor’s.\u003c/p\u003e\n\u003cp\u003eShe walked across the sand, then paused on his porch. There seemed to be a lot of thumping and banging going on inside. As she stood there, debating whether to knock, the door started to open.\u003c/p\u003e\n\u003cp\u003e“Victor,” she said.\u003c/p\u003e\n\u003cp\u003eThen she gasped.\u003c/p\u003e\n\u003cp\u003eHe was standing there with a head in his hands. A mannequin’s head. The hair was stiff and flattened to the skull. Wide, blue, unseeing eyes stared out at Genevieve.\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed instantly as she stared at her friend.\u003c/p\u003e\n\u003cp\u003eVictor appeared stricken. “Genevieve, I’m—”\u003c/p\u003e\n\u003cp\u003e“You son of a bitch,” she said softly, and started to turn.\u003c/p\u003e\n\u003cp\u003e“No!” he cried.\u003c/p\u003e\n\u003cp\u003eHe tried to catch hold of her shoulders, but she shook him off. He raced around in front of her, the offending head still in his hands.\u003c/p\u003e\n\u003cp\u003e“You don’t understand,” he told her anxiously.\u003c/p\u003e\n\u003cp\u003eShe stopped dead, staring at him coldly. “I don’t understand?” she said coolly. “Right. Get away from me, you son of a bitch.”\u003c/p\u003e\n\u003cp\u003e“Genevieve, please, I swear to you. I’m not the one who did it,” he pleaded.\u003c/p\u003e\n\u003cp\u003eShe gritted her teeth, staring at him. She’d known Victor forever, and she wouldn’t have put the joke past him. And the fact that he had fished the mannequin out of the sea, once the real body had surfaced, was only common decency. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-25.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
