{"id":88302,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShortly afterward they all began to split up. Jay left first, hugging Genevieve warmly, thanking her, warning her gruffly to be careful.\u003c/p\u003e\n\u003cp\u003e“I’m always careful,” she assured him. He looked over her shoulder at Thor.\u003c/p\u003e\n\u003cp\u003e“Well, I guess it’s good that…I think,” he murmured.\u003c/p\u003e\n\u003cp\u003eShe smiled. “He’s one of the good guys, I believe,” she said.\u003c/p\u003e\n\u003cp\u003eJay nodded. “Sometimes we have to go on logic and belief, huh?”\u003c/p\u003e\n\u003cp\u003eShe agreed, and bade him good-night, promising him that they were still on for a dinner sometime during the week.\u003c/p\u003e\n\u003cp\u003eAudrey and Uncle Adam were the next to leave.\u003c/p\u003e\n\u003cp\u003eAs Jay had done, Audrey hugged her, but Audrey’s hug was fierce. “You take care. And thank you. This was great. It’s been too long since we spent time together.”\u003c/p\u003e\n\u003cp\u003eGenevieve hugged her back, just as fiercely. “Thank you,” she said.\u003c/p\u003e\n\u003cp\u003eAudrey grinned. “My pleasure. Uncle Adam is cool, huh?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eUncle Adam was the next one to say goodbye. Just feeling his handshake and meeting his eyes made Genevieve feel better. “Tomorrow night, then. We’ll talk.”\u003c/p\u003e\n\u003cp\u003eSuddenly she glanced uneasily over her shoulder, wondering where Thor was.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Adam said. “I’m having breakfast with him.”\u003c/p\u003e\n\u003cp\u003eHer eyes went wide with alarm.\u003c/p\u003e\n\u003cp\u003eBut Adam Harrison shook his head. “Trust me. And don’t worry. I already have people down here to help.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“My son is with me, and there’s a couple at the resort. Nikki and Brent Blackhawk. You’ll like them. He’s worked with me a very long time. And Nikki…Nikki has what it takes. You’ll get to meet them soon. And though I don’t have the gift, I have a hunch. Everything will be fine.”\u003c/p\u003e\n\u003cp\u003eShe stepped up and kissed his cheek. She was surprised and embarrassed. He just smiled, squeezing her hand. “We need to learn how to listen,” he said softly. “That’s all.” Then, arm in arm with Audrey, he was gone.\u003c/p\u003e\n\u003cp\u003eThere was a sudden silence. Genevieve turned around. All her remaining guests were silent, staring after the two who had just left.\u003c/p\u003e\n\u003cp\u003eThen Victor blurted out, “That guy is fucking weird.”\u003c/p\u003e\n\u003cp\u003e“I’ve gotta agree,” Alex said.\u003c/p\u003e\n\u003cp\u003eShe could see Thor standing, grim and silent, just behind the two.\u003c/p\u003e\n\u003cp\u003eHe agreed, as well. She could tell.\u003c/p\u003e\n\u003cp\u003e“Then again,” Jack said, “Audrey’s a little weird herself.”\u003c/p\u003e\n\u003cp\u003e“You’re all nuts,” Genevieve informed them. “To you guys, anyone who isn’t a diver, who doesn’t live to spend half their days underwater, is weird.”\u003c/p\u003e\n\u003cp\u003e“Need any help?” Bethany asked Genevieve. When Gen shook her head, Bethany said, “I guess we should all head back, then. Tomorrow is an early day.”\u003c/p\u003e\n\u003cp\u003e“Lecture day,” Alex groaned.\u003c/p\u003e\n\u003cp\u003e“Lecture day, and let’s pray Marshall shows,” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003e“Marshall will be there,” Victor said, setting a hand on her shoulder. “He’ll show. You know he will.”\u003c/p\u003e\n\u003cp\u003eHe gave her a warm, brotherly hug. She smiled at him. “Right.”\u003c/p\u003e\n\u003cp\u003e“Hey, Victor, don’t you dare leave without me,” Bethany said.\u003c/p\u003e\n\u003cp\u003e“Of course not,” Victor said, rolling his eyes jokingly.\u003c/p\u003e\n\u003cp\u003eGenevieve realized that, amazingly, they had spent the entire day without mentioning that there was an unknown killer loose right there in the Keys.\u003c/p\u003e\n\u003cp\u003eThere was another moment’s silence. “Okay, well, Zach and I are out of here,” Lizzie said firmly. “Genevieve, thanks. This was great.”\u003c/p\u003e\n\u003cp\u003eGenevieve grinned. She liked Lizzie and Zach.\u003c/p\u003e\n\u003cp\u003e“Out, out, everyone out,” she said with a laugh.\u003c/p\u003e\n\u003cp\u003e“Oh, this is so cute,” Alex said with a sigh as everyone headed toward the door. “Look at the lineup—Lizzie and Zach, Bethany and Victor, and me and…Jack.”\u003c/p\u003e\n\u003cp\u003e“Hey, no way I’m sleeping with you, bud,” Jack announced.\u003c/p\u003e\n\u003cp\u003e“Out!” Genevieve said again, laughing even harder.\u003c/p\u003e\n\u003cp\u003eAt last, she managed to close the door on them all. Even without turning back to face him, she felt Thor’s silent presence, felt him watching her.\u003c/p\u003e\n\u003cp\u003eShe turned to stare at him, crossing her arms over her chest, leaning against the closed door. “What?” she asked defensively.\u003c/p\u003e\n\u003cp\u003eHe cocked his head at an angle, staring back, speaking softly, “I hate to agree with Victor, but…”\u003c/p\u003e\n\u003cp\u003eShe pushed away from the door, heading for the kitchen. “I liked him,” she said flatly.\u003c/p\u003e\n\u003cp\u003eShe went to the sink, ready to do the last of the dishes. He followed her, setting his hands on her shoulders. “Don’t you see?” he asked softly. “This guy is…some kind of a…well, let’s get serious. He’s as loony as Audrey. He’ll feed into every fear and fantasy you’ve been breeding.”\u003c/p\u003e\n\u003cp\u003eShe dropped the sponge and turned around. “That’s what you think, isn’t it? That I’ve got an imagination that never ends, and that I’m just letting it run wild.” She hesitated, hating what she saw in his eyes. She thought he cared about her and that what was going on between them was a lot more than sleeping with her. But there was a crystal over his eyes. She could just hear him thinking she was crazy as hell, and he wouldn’t be sticking around if she insisted on keeping it up.\u003c/p\u003e\n\u003cp\u003eShe didn’t want him to go. It hurt like hell to say the words, but she managed to speak them with tremendous dignity. “Don’t let me keep you where you don’t want to be.”\u003c/p\u003e\n\u003cp\u003eHis answer came slowly. “I’m exactly where I want to be,” he said. He let out a long breath. “Look, we’re tired and tomorrow is going to be a long day. And…”\u003c/p\u003e\n\u003cp\u003e“And what?”\u003c/p\u003e\n\u003cp\u003e“There’s a killer out there,” he said very softly.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I don’t want you staying because of that,” she said.\u003c/p\u003e\n\u003cp\u003eThe warmth she so loved and craved touched his eyes again. “I’m kind of big to throw out,” he said.\u003c/p\u003e\n\u003cp\u003eThen he stepped away, as if any more conversation between them could cause him to leave after all. “I’ve got a really early morning. I’m setting the clock for five-thirty. I’ll reset it for six-thirty. Will that work for you?”\u003c/p\u003e\n\u003cp\u003e“Sure,” she told him.\u003c/p\u003e\n\u003cp\u003e“I need to check my e-mail. Mind if I log on in your office?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Unless you want some help down here?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I’ve got it under control. Thanks.”\u003c/p\u003e\n\u003cp\u003eHe left her. She washed up the last few dishes, hesitated, then dried them and put them away. She didn’t like leaving things out, since she might well wind up spending the rest of the week at the resort. Her last few little chores wound up taking longer than she had anticipated, but when she walked up to her bedroom, he still wasn’t there. She was tempted to go into the office and read over his shoulder.\u003c/p\u003e\n\u003cp\u003eShe hesitated, then chose not to. She washed her face, brushed her teeth, then slipped into the shower for a minute; she felt she was wearing the scent of barbecued fish. Once out, she dried and hesitated. Presumptuous to slip into bed naked? Or ridiculous to slip into bed clad?\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, biting her lower lip for a minute. She was falling for him so hard. He was everything she could want in a man, her dream counterpart, sharp, intelligent, fun…a diver, a lover of the sea. And it didn’t hurt that he was built like Atlas, with such striking features, and that he had a way of touching her, of making love, that was exciting beyond measure and still, somehow, achingly tender.\u003c/p\u003e\n\u003cp\u003eShe slipped into bed, turning off the lights, then stared into the darkness. There was light coming in from the hall.\u003c/p\u003e\n\u003cp\u003eAnd he was there, just down that hall. So close to her, and yet so far.\u003c/p\u003e\n\u003cp\u003eShe was just about to get up and turn the lights back on when Thor came in at last. He moved silently in the darkness, not about to wake her if she slept.\u003c/p\u003e\n\u003cp\u003eWhen he, too, had slipped beneath the covers, she rolled against him, fingers light as they moved down his chest. He took her into his arms.\u003c/p\u003e\n\u003cp\u003eHe made love as he always did. Erotically, slowly, teasingly…He elicited and teased, and she lost all fear of the darkness in the madness of desire. She was aware of the feel of his lips against her, so intimately, the tremendous power of his frame, the frantic beat and soar of touching and rising, writhing, thrusting, rocketing into the volatile realms of sex and sensuality. She longed for release, longed to stay forever….\u003c/p\u003e\n\u003cp\u003eAs always, he held her.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eShe sensed something different. He was silent, as if lost in his own thoughts. She was afraid then. Afraid she had lost him, that this was his way of saying goodbye.\u003c/p\u003e\n\u003cp\u003eShe started to inch away, alarmed to realize her heart was so tender, that she was already on the defensive.\u003c/p\u003e\n\u003cp\u003eHe pulled her back, kissed her forehead. She thought words hovered on his lips, but if they did, they went unsaid.\u003c/p\u003e\n\u003cp\u003eThe real thing.\u003c/p\u003e\n\u003cp\u003eThat was how Captain Raul Terry, a good friend in Naval Intelligence, had described Adam Harrison. The real thing.\u003c/p\u003e\n\u003cp\u003eThere was no real damned thing, Thor thought.\u003c/p\u003e\n\u003cp\u003eBut the Internet had yielded the name Adam Harrison in a number of articles concerning unusual occurrences. There had been no Web site for Harrison Investigations. There were no advertisements. In fact, it was impossible to find. Except the articles had referred to the government, so he had hunted until he had found Raul online, and the man’s response had shocked him.\u003c/p\u003e\n\u003cp\u003eThe real thing.\u003c/p\u003e\n\u003cp\u003eImpossible. They were living in the real world.\u003c/p\u003e\n\u003cp\u003eAt his side, Genevieve shifted slightly. He pulled her closer, damning himself in the night. He would not be taken in.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eHe found he was afraid. He had never been under the delusion that his size made him tough, but he believed in his reason and intelligence, and it was frightening to feel with a greater sense on a daily basis that she was slipping away.\u003c/p\u003e\n\u003cp\u003eThat he couldn’t protect her.\u003c/p\u003e\n\u003cp\u003eHe gritted his teeth in the darkness. There was a killer on the loose. Hard, solid fact. The guy was probably a coward, victimizing the weak. There was no reason to believe Genevieve was in any danger. The man had killed a prostitute. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-31.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
