{"id":88306,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It isn’t a matter of light and dark, though ghosts do tend to prefer darkness and shadow,” Brent said levelly. “But they also walk the streets in broad daylight. They frequently have some kind of a mission.”\u003c/p\u003e\n\u003cp\u003eGenevieve winced. Good God, this entire conversation was ridiculous!\u003c/p\u003e\n\u003cp\u003eBrent Blackhawk must have sensed the emotions churning within her. He smiled. “I’ve seen them all my life. I told you that.” He cocked his head at an angle and grinned. “Luckily, I’m half Native American. People think we’re prone to the mystical.” He hesitated. “Sometimes ghosts can’t be helped. They walk the streets because they’re punishing themselves for some evil deed they think they committed, and they have to come to terms with themselves before they can move on. But sometimes there’s something happening in the world of the living that they’re determined to straighten out.”\u003c/p\u003e\n\u003cp\u003eGenevieve nodded, looking from him to Nikki. “They help solve murders,” Nikki said.\u003c/p\u003e\n\u003cp\u003e“But…a seance?” Genevieve said uneasily.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, it’s not like what you’ve seen in movies,” Adam told her.\u003c/p\u003e\n\u003cp\u003e“The table is best,” Audrey said. She shrugged. “It’s where I pretend to contact the dead all the time.”\u003c/p\u003e\n\u003cp\u003eThey formed a circle around the table. Genevieve found herself between Brent and Nikki, and she was certain they’d planned it that way. Just joining hands with the two, she nearly jumped. There seemed to be a flow of electricity going through her.\u003c/p\u003e\n\u003cp\u003e“There are no gimmicks under the table, right, Audrey?” she asked.\u003c/p\u003e\n\u003cp\u003eAudrey looked at her, hurt.\u003c/p\u003e\n\u003cp\u003e“Sorry,” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003e“Not today,” Audrey admitted with dignity.\u003c/p\u003e\n\u003cp\u003e“So…what do we do?” Genevieve asked softly.\u003c/p\u003e\n\u003cp\u003e“Just hold hands. Imagine your vision,” Brent said.\u003c/p\u003e\n\u003cp\u003eShe held tight, all the while thinking it was pointless and that despite the fact she had been the one having the visions—this was really ridiculous, a bunch of mature adults sitting around a table holding hands.\u003c/p\u003e\n\u003cp\u003e“Clear your mind,” Brent said, his tone deep, yet oddly quiet. “Close your eyes for a moment.”\u003c/p\u003e\n\u003cp\u003eOutside, night was coming at last. It was a time that folks waited for: sunset on Key West. The sky would be a burst of beautiful colors. In fact, there were few places in the world where sunset was quite so beautiful. Rays of last light playing atop the water, then diving into it, changing sea and sky at lightning speeds. Shadows falling…\u003c/p\u003e\n\u003cp\u003eShe opened her eyes.\u003c/p\u003e\n\u003cp\u003eAnd there was the woman.\u003c/p\u003e\n\u003cp\u003eJay drove Thor to the lab, which gave him a chance to quiz the police officer.\u003c/p\u003e\n\u003cp\u003e“You might have mentioned your new pals were with Adam Harrison,” he said dryly.\u003c/p\u003e\n\u003cp\u003eJay shot him a glance. “The captain said they were sent by the feds. Harrison wasn’t mentioned.”\u003c/p\u003e\n\u003cp\u003e“Right. And you didn’t suspect anything?”\u003c/p\u003e\n\u003cp\u003eJay shrugged uneasily. “Yes. But what difference does it make? You knew.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I knew.” He was quiet for a moment. “I asked Harrison to stay away, but I guess it’s not going to happen.”\u003c/p\u003e\n\u003cp\u003e“The guy seems decent enough,” Jay commented.\u003c/p\u003e\n\u003cp\u003e“Yeah? Well, the son is a smart-ass.”\u003c/p\u003e\n\u003cp\u003e“The son?” Jay said, sounding surprised.\u003c/p\u003e\n\u003cp\u003e“The man’s son is here, too. Josh Harrison. I met him this morning when I joined his father for breakfast.”\u003c/p\u003e\n\u003cp\u003e“That’s impossible,” Jay said.\u003c/p\u003e\n\u003cp\u003e“What makes you say that?”\u003c/p\u003e\n\u003cp\u003e“Harrison had a son once, all right. And the kid’s name was Josh. I don’t know who or what you saw, but it wasn’t his son. Josh died in a car accident over ten years ago.”\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eT he woman stared at Genevieve. For once her hair and clothing didn’t seem to flow in the water, as they did in the sea and in her dreams.\u003c/p\u003e\n\u003cp\u003eHer eyes were a deep, almost violet, shade of blue. Her hair was the color of sunkissed wheat. Genevieve saw her more clearly than ever before.\u003c/p\u003e\n\u003cp\u003eThe woman looked around the room.\u003c/p\u003e\n\u003cp\u003eGenevieve tried hard to keep her breathing even, tried not to blink. She didn’t want to lose the vision.\u003c/p\u003e\n\u003cp\u003eShe wasn’t alone in seeing the woman, she quickly realized. Brent Blackhawk spoke softly to her. “Hello. Don’t be afraid.”\u003c/p\u003e\n\u003cp\u003eBut the ghost didn’t acknowledge him. She turned to stare again at Genevieve and gave her the usual warning.\u003c/p\u003e\n\u003cp\u003e“Beware.”\u003c/p\u003e\n\u003cp\u003e“Beware of what? Please, help me.”\u003c/p\u003e\n\u003cp\u003eThe woman’s arms stretched out, covered in the silky white cloth of her gown. “Help me,” she whispered. “Help me. Beware.”\u003c/p\u003e\n\u003cp\u003e“I want to help you,” Genevieve assured her. “I want to help you. Tell me how.”\u003c/p\u003e\n\u003cp\u003eThe ghost was suddenly distressed. Afraid.\u003c/p\u003e\n\u003cp\u003eWas it possible for a ghost to be afraid? she wondered.\u003c/p\u003e\n\u003cp\u003ePossible or not, the woman looked around frantically with her huge blue eyes and then began to fade from sight.\u003c/p\u003e\n\u003cp\u003e“Wait! Please!” Genevieve begged.\u003c/p\u003e\n\u003cp\u003eBut the woman was gone. And in her wake she left only the whisper of her warning.\u003c/p\u003e\n\u003cp\u003e“Beware.”\u003c/p\u003e\n\u003cp\u003eThen there was nothing. Nothing, Genevieve realized, or the absence of something. There had been a subtle change in all of them. She looked at Brent, at Nikki, and realized she had nearly broken their hands, she had been gripping them so tightly. At the end of the table, Audrey was staring at her in shock.\u003c/p\u003e\n\u003cp\u003eGenevieve swallowed. “Brent, you saw her.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Nikki?”\u003c/p\u003e\n\u003cp\u003e“Something…I knew she was here.”\u003c/p\u003e\n\u003cp\u003e“Audrey?”\u003c/p\u003e\n\u003cp\u003e“Not a damn thing,” Audrey admitted dolefully. “Some mystic I am.”\u003c/p\u003e\n\u003cp\u003eGenevieve smiled. “It’s just a good living, remember?” she said.\u003c/p\u003e\n\u003cp\u003e“Some of us have great eyesight, and some are born myopic. Some make great acrobats, while others are mathematicians,” Adam said kindly.\u003c/p\u003e\n\u003cp\u003e“Yeah, but…” Audrey said with a sigh.\u003c/p\u003e\n\u003cp\u003e“I wonder why she disappeared the way she did,” Brent mused.\u003c/p\u003e\n\u003cp\u003e“‘Beware’ and ‘help me.’ Not enough to give us much information,” Genevieve said. She was stunned to realize she wasn’t feeling terrified. She felt…relieved. There was a ghost.\u003c/p\u003e\n\u003cp\u003eAudrey brightened. “I know. The poor woman was murdered. She never had a decent burial. We need to have a service.”\u003c/p\u003e\n\u003cp\u003e“Oh, Audrey,” Genevieve said, “we don’t even know who she is.”\u003c/p\u003e\n\u003cp\u003e“Well, she hangs around with pirates a lot—were they here, too, by the way?” Audrey asked.\u003c/p\u003e\n\u003cp\u003eGenevieve shook her head.\u003c/p\u003e\n\u003cp\u003e“Still, you’re looking for the Marie Josephine. She was attacked by pirates before the storm that doomed her. The ghost has to be Anne, the captain’s daughter. We should just have a nice funeral service at sea and let her rest.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure….” Genevieve murmured.\u003c/p\u003e\n\u003cp\u003eNikki Blackhawk shrugged. “It can’t hurt.”\u003c/p\u003e\n\u003cp\u003e“Actually, it could,” Adam commented.\u003c/p\u003e\n\u003cp\u003e“How’s that?” Audrey asked.\u003c/p\u003e\n\u003cp\u003e“Are you sure you want her to disappear?” Adam asked.\u003c/p\u003e\n\u003cp\u003e“Of course! If she’s a ghost…wandering, suffering past pain and trauma, of course I want her to be at peace,” Genevieve said. “Why wouldn’t I?”\u003c/p\u003e\n\u003cp\u003e“She does keep leading you to treasure,” Brent said.\u003c/p\u003e\n\u003cp\u003eGenevieve was thoughtful for a moment. “I don’t want to disappoint the others, but…well, I think it’s obvious we’re on the right track. If there were a way to let her go, I’d gladly do it.”\u003c/p\u003e\n\u003cp\u003e“I can get hold of Father Bellamy,” Audrey offered. “We can hold a funeral service for Anne.”\u003c/p\u003e\n\u003cp\u003e“We should probably get Thor’s permission,” Genevieve said uneasily. “And if the papers got wind of it, I’m not sure it would be a good thing.”\u003c/p\u003e\n\u003cp\u003e“Not true at all. It could be spun into a nice human-interest story,” Nikki said.\u003c/p\u003e\n\u003cp\u003eThey were all startled by a knock at the door. Audrey rose quickly, collecting the papers from her coffee table. “Would you mind getting it?” she asked of no one in particular.\u003c/p\u003e\n\u003cp\u003eGenevieve walked to the door. She was startled, when she opened it, to discover an entire crowd. Bethany, Alex, Victor, Jack, Jay and Thor were all there.\u003c/p\u003e\n\u003cp\u003eThor was wearing his shades, making his expression unreadable.\u003c/p\u003e\n\u003cp\u003e“Hey,” she said, hoping she sounded surprised, but not nervous.\u003c/p\u003e\n\u003cp\u003e“Are we allowed in?” Victor asked.\u003c/p\u003e\n\u003cp\u003e“Uh…”\u003c/p\u003e\n\u003cp\u003e“Sure,” Audrey announced, coming to the door. “Hi, Victor.” She gave him a hug. “Jack…Jay. And you’re Alex, right?” She gave him a hug, too, but she didn’t approach Thor. “Come on in.”\u003c/p\u003e\n\u003cp\u003e“Do we need any introductions?” Adam asked politely as they all entered.\u003c/p\u003e\n\u003cp\u003e“No,” Thor said. “We didn’t all mean to barge in like this. Jay and I were hoping to find Adam, and we just ran into the others along the way.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Adam said. “Well, here I am.”\u003c/p\u003e\n\u003cp\u003e“They have bad information at the police station, and we’re here so you can correct it,” Thor said. “I told Jay I met your son this morning. He didn’t believe me.”\u003c/p\u003e\n\u003cp\u003eAdam Harrison stared at Thor, mouth open in shock. After a moment he regained his composure enough to speak. “My son died ten years ago,” he said very softly.\u003c/p\u003e\n\u003cp\u003eGenevieve thought every single little muscle in Thor’s body must have tightened. His face was like stone.\u003c/p\u003e\n\u003cp\u003e“Then who was with us this morning?”\u003c/p\u003e\n\u003cp\u003eAdam frowned, looking truly perplexed. “Mr. Thompson, no one was with us this morning.”\u003c/p\u003e\n\u003cp\u003e“Come on,” Thor said impatiently. “You had an English muffin, I ordered eggs, your son…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“He didn’t order,” Thor said\u003c/p\u003e\n\u003cp\u003eAdam looked down for a moment. “Others have seen him, too. Sometimes I get the sense of him, but…” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-35.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
