{"id":88308,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Well?” Audrey asked anxiously.\u003c/p\u003e\n\u003cp\u003eThor stared across the table at Genevieve. She hadn’t said a word, but she was looking at him hopefully. He thought about the way she had homed right in on their finds. Directions from a ghost?\u003c/p\u003e\n\u003cp\u003eHe didn’t believe in ghosts.\u003c/p\u003e\n\u003cp\u003eBut apparently she did. And maybe she didn’t want to be shown anything by the undead anymore. He thought it was all in her mind, in her dreams, but there had been that seawater….\u003c/p\u003e\n\u003cp\u003eAnd Adam Harrison might well be playing him for an idiot. Staring at the man, he couldn’t quite get a handle on him. He just didn’t seem like the kind of guy who went around perpetuating elaborate hoaxes.\u003c/p\u003e\n\u003cp\u003eHell, someone had played a trick on Genevieve—a real trick, with a real mannequin—but Harrison hadn’t been here at the time. As far as he knew…\u003c/p\u003e\n\u003cp\u003eMaybe a funeral service could put a stop to all of it.\u003c/p\u003e\n\u003cp\u003eThere was also a real murderer out there, a vicious killer who had allowed a woman to drown with no hope.\u003c/p\u003e\n\u003cp\u003eAnd why the hell did he feel that crime had something to do with the dive?\u003c/p\u003e\n\u003cp\u003eHe stared at Audrey. “We’d better not get any bad press out of it. And, hey,” he said, addressing the others, “I made the call to come in early today, but from now on we’ll be making a minimum of three dives a day. We know we’re in the right area, but we need to find the largest debris fields before the heavy equipment comes in. With or without Marshall.”\u003c/p\u003e\n\u003cp\u003e“Where the bloodly hell is Marshall, do you think?” Alex asked, sounding annoyed.\u003c/p\u003e\n\u003cp\u003e“I don’t know, but at least he’s all right. According to Jay,” Genevieve said. There was a note of worry in her voice, despite her words.\u003c/p\u003e\n\u003cp\u003e“It’s not like him,” Jack said. “I’ve known Marshall since he was a kid. He didn’t get where he is by acting like this.” He shook his head.\u003c/p\u003e\n\u003cp\u003e“Let’s not get going on another anxiety fest, huh?” Alex suggested.\u003c/p\u003e\n\u003cp\u003e“Food’s here!” Victor announced, pointing as two waiters approached them bearing large trays laden with plates, and the conversation moved on.\u003c/p\u003e\n\u003cp\u003e“Your place or mine?” Thor murmured softly, slipping an arm around Genevieve’s shoulders as they left the restaurant.\u003c/p\u003e\n\u003cp\u003eDespite his words and his touch, Genevieve felt a strange reserve in him. She didn’t know what he was really thinking, and it hurt, because she wanted to be close to him even more.\u003c/p\u003e\n\u003cp\u003e“Sure you want to keep sleeping with me?” she asked softly in return.\u003c/p\u003e\n\u003cp\u003e“If you’re sure you want to keep sleeping with me,” he assured her. “By the way, did you know Jay was called out because a garbageman found a dismembered mannequin in the garbage?”\u003c/p\u003e\n\u003cp\u003eHer heart thudded. “I knew he’d been called away suddenly, but not why. Um, a mannequin. Really?” Why was she lying to him? Protecting Victor?\u003c/p\u003e\n\u003cp\u003e“I’m curious—why was Jay called in on it? I think it’s legal to throw away a mannequin.”\u003c/p\u003e\n\u003cp\u003e“Legal, yes,” Thor agreed with a shrug. “But I guess the fact it was in pieces scared the garbageman. And in light of what’s going on…”\u003c/p\u003e\n\u003cp\u003e“So,” she said slowly, “is Jay investigating?”\u003c/p\u003e\n\u003cp\u003e“He’s going to find out if one was stolen or sold to anyone.” He stared at her hard. “The joke was played on you. Don’t you want to know who did it?”\u003c/p\u003e\n\u003cp\u003e“I suppose. Though to tell you the truth, I’m not sure I really care. I mean, everyone sobered up and got mature the minute the real body was found.”\u003c/p\u003e\n\u003cp\u003e“Right. And how many people know the body you saw was not the same body found on the beach? Let’s see—me. And Audrey and Bethany. Who else? Nikki and Brent, I bet. And how many people did Bethany tell?” he queried sharply.\u003c/p\u003e\n\u003cp\u003e“Obviously it has nothing to do with Brent and Nikki. They weren’t here then. And Bethany can keep a secret. Anyway, what difference does it make? It might have been a mean joke, but I’m sure the mannequin was a joke. Nothing more.”\u003c/p\u003e\n\u003cp\u003e“You know more than you’re telling me,” he said softly.\u003c/p\u003e\n\u003cp\u003eShe groaned softly. “I just want…I just want to let it go,” she said.\u003c/p\u003e\n\u003cp\u003eHe didn’t reply, just looked straight ahead. “Let’s see what your funeral service will do tomorrow,” he told her.\u003c/p\u003e\n\u003cp\u003e“What was that little discussion you had going with Adam?” Genevieve asked him.\u003c/p\u003e\n\u003cp\u003e“A little discussion,” he said curtly.\u003c/p\u003e\n\u003cp\u003e“You know more than you’re telling me,” she echoed softly.\u003c/p\u003e\n\u003cp\u003eHe grimaced humorously, still looking straight ahead. “They’re staying at the resort, Nikki and Brent. I saw them before I met them,” he said.\u003c/p\u003e\n\u003cp\u003e“They…they can be helpful,” she said lamely.\u003c/p\u003e\n\u003cp\u003e“At least she can dive,” he muttered.\u003c/p\u003e\n\u003cp\u003eThey had reached the parking area, and everyone started waving goodbye to one another. Adam headed off down Duval Street for his hotel. Victor, Genevieve noticed, had disappeared.\u003c/p\u003e\n\u003cp\u003e“Where’s your roommate?” she asked Bethany.\u003c/p\u003e\n\u003cp\u003e“He saw a blonde,” Bethany replied.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“I don’t think he’s bringing anyone back,” Bethany said. “Although maybe I shouldn’t be there tonight.”\u003c/p\u003e\n\u003cp\u003eAlex laughed. “He would have asked you politely to get the hell out if he’d any such plans,” he assured Bethany. “But you can come to my place, if you want.”\u003c/p\u003e\n\u003cp\u003e“I’ll be fine, but thanks, Alex.”\u003c/p\u003e\n\u003cp\u003e“Good night, Bethany,” Alex said, waving and walking off. “Good night all.”\u003c/p\u003e\n\u003cp\u003eThor’s arm was still around Genevieve’s shoulders. “Which way?”\u003c/p\u003e\n\u003cp\u003e“Your cottage, I guess.”\u003c/p\u003e\n\u003cp\u003eHe nodded. Despite the way he held her, the intimate way he spoke, she still had the terrible sensation she was losing him.\u003c/p\u003e\n\u003cp\u003eInside, with the door locked, she touched his face gently with her palm.\u003c/p\u003e\n\u003cp\u003e“Look, honestly, you don’t have to pretend or feel that you started something and you have to keep it going, that…”\u003c/p\u003e\n\u003cp\u003eHe pulled her close to him. “Do we have to talk?” he asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No.”\u003c/p\u003e\n\u003cp\u003e“Then let’s not.”\u003c/p\u003e\n\u003cp\u003eHis arms wound around her. Ghosts faded away in the vital reality of flesh and blood and the volatile power of his touch.\u003c/p\u003e\n\u003cp\u003eLosers. The guys here were a bunch of losers.\u003c/p\u003e\n\u003cp\u003eAna Maria Strakowsky decided she shouldn’t have come so far south. There had been talk about there being a lot of money in the Keys. So far, she’d seen retirees, beer bellies and men in Speedos who should never, never, be so exposed. She didn’t particularly care about that, but they were cheap. And slow. They didn’t seem to comprehend that she wasn’t looking for entertainment or the charm of their company, just a business deal. Then there were the kids. Lordy. Kids, everywhere. And family men. Guys who might have eyes that strayed from their widening wives, but not guys with the gumption to do anything.\u003c/p\u003e\n\u003cp\u003eAnd the really sharp, good-looking one…\u003c/p\u003e\n\u003cp\u003eHe’d probably never paid in his life. But that had been hours ago. She smiled. His warning had been nice. She didn’t remember the last time anyone had said anything to her that had held the least note of concern. She had come to the States a long time ago. And though she had been barely sixteen, she had known exactly why her “sponsor” had paid for her to get in. Back then, she’d had dreams of using her body as no more than a stepping-stone. In the village where she’d grown up, she could have either married a farmer or gone to the city, where the men were ugly and cheap, anyway.\u003c/p\u003e\n\u003cp\u003eStrange, the American-dream thing. It hadn’t gone quite the way she had expected. So here she was, getting older now….\u003c/p\u003e\n\u003cp\u003eCosmetic surgery could do a lot for that. She had to admit, she looked damned good for her age, but she was no kid anymore. More young girls entered the business on a daily basis. Young. That was the key word. And she’d never quite quit when she should have. When she could have used her earnings for an education, pressed for more….\u003c/p\u003e\n\u003cp\u003eSo here she was. Seeking new ground. And it sucked.\u003c/p\u003e\n\u003cp\u003eAt least, as the night wore on, the kids began to disappear from the streets. As she passed from one bar to the next, she nearly collided with a man.\u003c/p\u003e\n\u003cp\u003eHe apologized quickly, straightening her—his hands lingering on her shoulders as his eyes surveyed her face.\u003c/p\u003e\n\u003cp\u003eNo hesitation there. He smiled immediately.\u003c/p\u003e\n\u003cp\u003e“Well…hello.”\u003c/p\u003e\n\u003cp\u003eShe smiled back. Took note of the way he was dressed. He might not be Trump, but he clearly made a decent income.\u003c/p\u003e\n\u003cp\u003e“Hello.”\u003c/p\u003e\n\u003cp\u003e“Are you, uh, free?”\u003c/p\u003e\n\u003cp\u003e“Not exactly free. But negotiable,” she teased.\u003c/p\u003e\n\u003cp\u003e“Great. I like to negotiate.”\u003c/p\u003e\n\u003cp\u003e“I have a room,” she said huskily, and told him where.\u003c/p\u003e\n\u003cp\u003eHe did like to negotiate, as it turned out. He talked a good line.\u003c/p\u003e\n\u003cp\u003eShe didn’t even notice they weren’t heading in the direction of her room.\u003c/p\u003e\n\u003cp\u003eGenevieve wondered vaguely if she groaned out loud. She was sure, in the distant nether realms of the subconscious, that her sleeping body inched ever closer to the man with whom she was entangled.\u003c/p\u003e\n\u003cp\u003eShe knew they were coming.\u003c/p\u003e\n\u003cp\u003eEven when they were at a distance, she could sense them as if they were marching through a fog and were dimly visible. As if she saw them through a storm at sea.\u003c/p\u003e\n\u003cp\u003eCloser…closer…they marched, then thronged around her.\u003c/p\u003e\n\u003cp\u003eShe was beginning to recognize them. The jawless one in the tattered poet’s shirt with the sword. The fellow in the big, plumed, deteriorating hat. The one with the knee breeches and rough leather boots.\u003c/p\u003e\n\u003cp\u003eAnd the woman. The beautiful blond woman.\u003c/p\u003e\n\u003cp\u003eShe was weary. Not afraid…just weary.\u003c/p\u003e\n\u003cp\u003eWhy? she pleaded silently.\u003c/p\u003e\n\u003cp\u003eShe knew the answer.\u003c/p\u003e\n\u003cp\u003e“Beware.”\u003c/p\u003e\n\u003cp\u003eBeware of what? Please, please, please…\u003c/p\u003e\n\u003cp\u003e“The truth.”\u003c/p\u003e\n\u003cp\u003eWhat truth?\u003c/p\u003e\n\u003cp\u003eJust as the ghost opened her mouth to speak, a look of extreme pain seized her. She seemed to double over in agony, even as she faded from view, her decomposing pirate escort disappearing with her into a field of fog. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-37.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
