{"id":88312,"no":41,"title":"Page 41","content":"\u003cp\u003e“No. Not if you make good to the owner.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t steal it!”\u003c/p\u003e\n\u003cp\u003eThor would be joining them any minute, she knew, and she had to stop this before he got involved. She pushed her way between the two men. “Look, Victor, I’ll pay for the damned thing. Let’s just get it over with.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t steal it.”\u003c/p\u003e\n\u003cp\u003e“I believe you. But let’s just make this end here and now. I’m begging you,” Genevieve pleaded.\u003c/p\u003e\n\u003cp\u003eVictor stared at her, still indignant. “Genevieve, it might be important to find out who did steal it.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I don’t know. I only know that I didn’t do it.”\u003c/p\u003e\n\u003cp\u003e“Let’s just make it go away, please? We have bigger problems. Please, Victor?” she said.\u003c/p\u003e\n\u003cp\u003eHe let out a sigh. From the corner of her eye she saw that Thor was coming. She had to get this settled—now.\u003c/p\u003e\n\u003cp\u003eVictor shook his head. “Fine. I’ll pay for it,” he said.\u003c/p\u003e\n\u003cp\u003e“No, I will,” Genevieve insisted.\u003c/p\u003e\n\u003cp\u003e“Don’t be ridiculous.”\u003c/p\u003e\n\u003cp\u003e“We’ll argue about it later,” she said. “Jay? Good enough?”\u003c/p\u003e\n\u003cp\u003eHe nodded his assent just as Thor strode over to join them.\u003c/p\u003e\n\u003cp\u003e“Any word from Marshall?” Thor asked.\u003c/p\u003e\n\u003cp\u003e“No. But Gen’s going to fill out a missing persons report today. Then we can do more than just have me calling old friends in Miami-Dade and asking for off-the-record help,” Jay said.\u003c/p\u003e\n\u003cp\u003e“Something’s wrong,” Genevieve insisted.\u003c/p\u003e\n\u003cp\u003e“Or right. Maybe he’s found the woman of his dreams,” Victor said.\u003c/p\u003e\n\u003cp\u003eGenevieve shook her head. “This project meant too much to Marshall for him to just walk off it. He’s a responsible person. He’s built up a great reputation. I can’t believe he would slough it off all over some woman.”\u003c/p\u003e\n\u003cp\u003eThor nodded. He, too, was wearing dark glasses, so she couldn’t read his thoughts.\u003c/p\u003e\n\u003cp\u003eAt least he hadn’t commented on the water, or the smell of the sea that permeated his cottage.\u003c/p\u003e\n\u003cp\u003e“I’m going to get some coffee,” Thor said.\u003c/p\u003e\n\u003cp\u003eGenevieve’s eyes followed him, and she saw that Adam was walking toward the tiki bar from the parking lot, and he had met up with the Blackhawks on the way. He looked upset.\u003c/p\u003e\n\u003cp\u003eFrowning, Genevieve hurried toward them.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” she asked.\u003c/p\u003e\n\u003cp\u003e“Probably nothing,” he said, forcibly easing the tension from his features as he tried to smile.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Tell me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure Audrey just overslept—either that, or she simply forgot her appointment with an old man,” he said lightly.\u003c/p\u003e\n\u003cp\u003eGenevieve felt her heart catapult. “You were supposed to meet Audrey?”\u003c/p\u003e\n\u003cp\u003e“For breakfast, yes,” he admitted unhappily.\u003c/p\u003e\n\u003cp\u003e“And you went by her house? And she isn’t answering?” Genevieve demanded.\u003c/p\u003e\n\u003cp\u003e“Please, don’t panic,” Nikki cautioned carefully. “Something important might have cropped up.”\u003c/p\u003e\n\u003cp\u003eGenevieve spun around and rushed back to Jay. “Audrey’s missing,” she said flatly.\u003c/p\u003e\n\u003cp\u003e“Missing?” Victor said impatiently. “Don’t be silly. I walked her home myself last night.”\u003c/p\u003e\n\u003cp\u003e“She was supposed to meet Adam Harrison for breakfast. She didn’t show. And when he went to her house, she didn’t answer the door. Jay, you have to do something.”\u003c/p\u003e\n\u003cp\u003e“I can’t just break into her house,” Jay protested.\u003c/p\u003e\n\u003cp\u003eGenevieve whipped out her cell phone, staring at them all angrily. “What’s the matter with you? Haven’t you noticed that people around here keep disappearing!”\u003c/p\u003e\n\u003cp\u003e“Marshall hasn’t disappeared. He called the station. Adults have the right to take off if they choose,” Jay told her.\u003c/p\u003e\n\u003cp\u003e“That’s a bunch of police crap,” she snapped at him.\u003c/p\u003e\n\u003cp\u003e“I walked Audrey home, and she was fine,” Victor said.\u003c/p\u003e\n\u003cp\u003eGenevieve had already punched in Audrey’s number. It was ringing and ringing. The answering machine came on.\u003c/p\u003e\n\u003cp\u003e“Call me as soon as you get this,” Genevieve said. Then she snapped the phone closed with dread in her heart.\u003c/p\u003e\n\u003cp\u003eSomething was really wrong. Why couldn’t they see it?\u003c/p\u003e\n\u003cp\u003e“I’m going over there,” she said.\u003c/p\u003e\n\u003cp\u003e“Do you have a key?” Jay asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then what are you going to do? If you force your way in, I’ll have to arrest you for breaking and entering,” Jay said wearily.\u003c/p\u003e\n\u003cp\u003e“Please, Jay, I’m worried sick,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eHe looked down. “I’m going to wind up fired after all these years,” he muttered. “You go out on your dive. I’ll go to Audrey’s place, okay? And if she’s angry because I jimmied my way in, I’ll never speak to you again. I won’t be able to, because I’ll be looking for a job slinging hash in a distant city!”\u003c/p\u003e\n\u003cp\u003e“Audrey would never get you in trouble. She’d know we were just worried,” Genevieve promised.\u003c/p\u003e\n\u003cp\u003eJay shook his head and started off. “She missed a breakfast meeting,” he muttered. “As if we all haven’t slept through breakfast at one time or another.”\u003c/p\u003e\n\u003cp\u003e“C’mon. No lectures today. Let’s get on the boats,” Thor called out from the bar, where he was drinking his coffee. He didn’t know anything about Audrey yet, Genevieve thought. Should she tell him, then insist they stay on shore for the day?\u003c/p\u003e\n\u003cp\u003eNo, she decided. Jay would check on Audrey. And there would be some simple explanation. She hadn’t been missing and out of action forever, not like Marshall.\u003c/p\u003e\n\u003cp\u003eShe didn’t need to put a hold on the dive. She could do her work; Jay could do his. He was a cop, and he was also a friend. He wouldn’t let her down.\u003c/p\u003e\n\u003cp\u003e“Move!” Thor called.\u003c/p\u003e\n\u003cp\u003eWhen they reached the dock with their equipment, Thor started giving out their diving instructions for the day.\u003c/p\u003e\n\u003cp\u003e“Jack, stay topside on the police loaner. Bethany and Alex, as usual. Zach and Lizzie, you’re with them. Victor…topside on my boat for the first dive, but we’ll switch around later. Brent and Nikki, keep being a couple. Genevieve, you’re with me. Everybody got it?”\u003c/p\u003e\n\u003cp\u003eThere were nods all around, and they headed to the appropriate boats.\u003c/p\u003e\n\u003cp\u003eGenevieve noted that Adam wasn’t there to watch them leave. She hoped he had gone with Jay and that, between the two of them, they would find Audrey. She fingered her cell phone, in the pocket of her cover-up. She couldn’t take it down with her, but she would tell Victor to answer it if it rang.\u003c/p\u003e\n\u003cp\u003eThor was at the helm. Genevieve chose a seat beside Nikki, who gave her hand a squeeze. “It will be all right.”\u003c/p\u003e\n\u003cp\u003e“Will it?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“Maybe the ghost is at rest.”\u003c/p\u003e\n\u003cp\u003e“She isn’t,” Genevieve said flatly.\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“She still came to me in dreams,” Genevieve said. “And she soaked the room while she was at it.”\u003c/p\u003e\n\u003cp\u003eNikki smiled gravely. “I’m telling you, she’s here to help.”\u003c/p\u003e\n\u003cp\u003e“Great.”\u003c/p\u003e\n\u003cp\u003eBrent joined them in time to overhear the last part of the conversation, sitting next to Genevieve rather than his wife. “There is a reason,” he assured her.\u003c/p\u003e\n\u003cp\u003eVictor sat next to Nikki. “Do ghosts steal mannequins and move things around?” he asked.\u003c/p\u003e\n\u003cp\u003eGenevieve wasn’t sure if the question was genuine, or if he was just mocking them. Looking at him, she thought he was sincere.\u003c/p\u003e\n\u003cp\u003eHe hadn’t been the one to play the joke on her, she thought. But still, the niggling suspicion was there. Especially now that they had been caught getting rid of the mannequin.\u003c/p\u003e\n\u003cp\u003eBrent hesitated, looking at his wife before answering. “They have been known to gain the ability to move objects, but as to stealing a mannequin with a purpose…I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What exactly do you know?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“Please,” she asked, to take the sting out of her words.\u003c/p\u003e\n\u003cp\u003e“Most of the time, spirits remain or return with a purpose. And usually that purpose is to aid the living in some way.”\u003c/p\u003e\n\u003cp\u003e“Time to anchor and dive flag,” Thor shouted, breaking off the conversation.\u003c/p\u003e\n\u003cp\u003eGenevieve quickly found her position and buckled on her tank.\u003c/p\u003e\n\u003cp\u003eOn the platform, she glanced at Thor as she positioned her mask. He looked back at her, but she could read nothing in his eyes.\u003c/p\u003e\n\u003cp\u003eShe realized she was dreading the dive.\u003c/p\u003e\n\u003cp\u003eShe had forgotten her enthusiasm for the project, her love for what she did. All she was doing now was waiting.\u003c/p\u003e\n\u003cp\u003eSomething else was going to happen. She was sure of it.\u003c/p\u003e\n\u003cp\u003eShe stepped out into the water, felt her body fall, felt the rush of the sea around her. Bubbles surrounded her as she released air from her vest and began to sink.\u003c/p\u003e\n\u003cp\u003eThor had moved them out into slightly deeper water today, she realized. They were following a path that led them past the reefs, then dropped down to deeper shelves.\u003c/p\u003e\n\u003cp\u003eShe listened to the sound of her breathing. Slow and easy. She was proud of how long she could go on a single tank of air.\u003c/p\u003e\n\u003cp\u003eLook around, watch, feel, remember everything you love about this, she told herself.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t working. The sense of dread that had first assailed her on the platform was growing. She found herself breathing far too quickly, too heavily. Her heart was hammering.\u003c/p\u003e\n\u003cp\u003eSmall brilliant fish swept by her, unconcerned with anything but their next meal. The sun-kissed yellow of a tang, the stripes of a clown fish. To her side were dozens of pastel anemones, drifting in the easy flow of the current.\u003c/p\u003e\n\u003cp\u003eShe was gaining control. The world beneath the waves was as it should be. A nosy barracuda was tracking them at a distance. Silver in the water, he stuck out his jaw, looking like a belligerent child. A giant grouper swam toward them, took a look, turned away.\u003c/p\u003e\n\u003cp\u003eStaghorn coral rose, followed by a field of brain coral. More anemones. More tiny, colorful, darting fish. A starfish began a slow trek across the sand. A tiny ray was disturbed by their passage and dug deeper into the sand.\u003c/p\u003e\n\u003cp\u003eShe knew, her heart thundering, seconds before the body came into view that she was going to see it. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-41.html","bookId":2269,"creation":"Oct 5, 2019 5:28:01 PM","modification":"Oct 5, 2019 5:28:01 PM"}
