{"id":105459,"no":28,"title":"Page 28","content":"\u003cp\u003e“Tell me about Richard,” I said.\u003c/p\u003e\n\u003cp\u003eThere’s no special trick to conducting an interview. All it requires is a little patience, an ear for the important utterance, and the simple knowledge that to most people the sweetest possible music is the sound of their own voice.\u003c/p\u003e\n\u003cp\u003e“Richard was Merodie’s boyfriend,” Mollie said. “That’s all I really know about him. I don’t think he had a job. He was always around, always entertaining friends. Must have been a million people in and out of his driveway. My ex, the prick, he figured Richard was dealing drugs. Sure, dealing drugs out of a split-level in Anoka. What a laugh.”\u003c/p\u003e\n\u003cp\u003e“Hysterical.”\u003c/p\u003e\n\u003cp\u003eMollie’s eyes grew wide. “You think?”\u003c/p\u003e\n\u003cp\u003e“It’s certainly possible.”\u003c/p\u003e\n\u003cp\u003eMollie didn’t like the sound of that at all. She left her chair and limped to the window, fighting her cast all the way. She gazed out at Merodie’s empty driveway. “You think he might have been a drug dealer?”\u003c/p\u003e\n\u003cp\u003e“You said a year?”\u003c/p\u003e\n\u003cp\u003eAfter a brief pause, Mollie answered, “Huh? A year? Yeah. Richard left after about a year. I didn’t see him no more. Things got real quiet. You wouldn’t have known anyone was even living next door.”\u003c/p\u003e\n\u003cp\u003e“Where did Richard go?”\u003c/p\u003e\n\u003cp\u003eMollie shrugged her ignorance.\u003c/p\u003e\n\u003cp\u003e“Do you know his last name?”\u003c/p\u003e\n\u003cp\u003eMollie shook her head.\u003c/p\u003e\n\u003cp\u003e“Richard is all I know,” she said. “I only heard it during the arguments.”\u003c/p\u003e\n\u003cp\u003e“Did you have any contact with Merodie after Richard left?”\u003c/p\u003e\n\u003cp\u003e“I never had any contact with Merodie before Richard left. Not really. It was like, ‘Hi, how you doing?’ when we met on the street, which wasn’t often. We didn’t sit around the kitchen table drinking coffee or anything.”\u003c/p\u003e\n\u003cp\u003e“You saw her come and go.”\u003c/p\u003e\n\u003cp\u003e“Not lately. As near as I can tell, she was always in her house. She never left it.”\u003c/p\u003e\n\u003cp\u003e“Not to go shopping?”\u003c/p\u003e\n\u003cp\u003e“Well, she must go shopping, for food and stuff, you know? I just never see her.”\u003c/p\u003e\n\u003cp\u003e“The mail gets picked up.”\u003c/p\u003e\n\u003cp\u003eMollie didn’t know what to say to that.\u003c/p\u003e\n\u003cp\u003e“The lawn gets cut.”\u003c/p\u003e\n\u003cp\u003e“She must do that stuff when I’m at work. Truth is, I don’t remember the last time I saw Merodie. Or Eli.”\u003c/p\u003e\n\u003cp\u003e“Eli Jefferson? The deceased?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I was really bummed when I heard he died. He seemed like a nice enough guy.”\u003c/p\u003e\n\u003cp\u003e“You knew him?”\u003c/p\u003e\n\u003cp\u003e“I’ll say. He hit on me. Couple of times.” Mollie smiled at the memory. “The first time was in winter. He helped me shovel the driveway, then invited himself in for hot chocolate, and then tried to invite himself into my bed. I’m saying, ‘What about Merodie,’ and he’s saying real dumb-ass things like, ‘What Merodie doesn’t know won’t hurt her.’ Guy was a jerk. Charming, though. Real charming. The next time, I’m in the backyard working on my tan. I look up and there he is, grinning. He starts talking about Minnesota’s scenic wonders, meaning me, right? He asks if I’ve seen the Split Rock Lighthouse. I say, ‘You mean up by Duluth?’ He says, ‘Oh, it’s much closer than that,’ and then looks down at himself. I say it now and I think, God, what a jerk. Only at the time it made me laugh. I’ll tell you, though. Something I learned from my ex-husband, the prick. For some people, charm is a weapon.”\u003c/p\u003e\n\u003cp\u003e“How long did Jefferson live with Merodie?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Six months?”\u003c/p\u003e\n\u003cp\u003e“Have you seen any activity at the house in the past two weeks?”\u003c/p\u003e\n\u003cp\u003e“Cops asked me the same thing. I really haven’t. Last I saw of anyone over there was two weeks ago Saturday.”\u003c/p\u003e\n\u003cp\u003e“That would be . . .”\u003c/p\u003e\n\u003cp\u003e“August first, but even then all I saw was a car drive up and then leave a few minutes later.”\u003c/p\u003e\n\u003cp\u003e“What kind of car?”\u003c/p\u003e\n\u003cp\u003e“It’s like I told the cops, I don’t know from cars except it was black, a sports car. Now my ex, the prick, he knows cars. If he treated me as well as he treated his car . . . ”\u003c/p\u003e\n\u003cp\u003e“Did you see who drove the car?”\u003c/p\u003e\n\u003cp\u003e“Not really. It could have been anyone.”\u003c/p\u003e\n\u003cp\u003e“What time did you see the car?”\u003c/p\u003e\n\u003cp\u003e“Around noon?”\u003c/p\u003e\n\u003cp\u003e“Is that a guess?”\u003c/p\u003e\n\u003cp\u003e“I remember eating lunch and that’s when I saw the car, so I figured it was around noon. It could’ve been later.”\u003c/p\u003e\n\u003cp\u003eWe talked some more, but nothing new came of it. Mollie offered another Grain Belt, and I was tempted. Instead, I passed, telling myself that a semiprofessional private investigator wouldn’t drink while on the job. I gave Mollie one of the cards I had made up. It read R. MCKENZIE and had my phone numbers printed on it. Mollie set the card on her table and promised if she thought of anything more, she’d call. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-28.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
