{"id":105469,"no":38,"title":"Page 38","content":"\u003cp\u003eThat brought a lot of applause.\u003c/p\u003e\n\u003cp\u003e“I’m not above trying to get some good publicity to further my career. I understand how politics works. But I will be damned if I’ll make a prosecutorial decision based on whether or not it’ll get votes.”\u003c/p\u003e\n\u003cp\u003eMore applause.\u003c/p\u003e\n\u003cp\u003e“Merodie Davies is guilty of murder, and I’m going to see that she spends the rest of her life in prison. Why? Because she’s guilty. Not because it makes me a more desirable candidate. If she weren’t guilty, I would release her, and I wouldn’t care how it looked to the voters.”\u003c/p\u003e\n\u003cp\u003eA heavy hand fell on my shoulder as Tuseman’s supporters erupted into even louder applause.\u003c/p\u003e\n\u003cp\u003e“Well, it was nice chatting with you,” I said, but Tuseman didn’t hear me. The microphone had been switched off.\u003c/p\u003e\n\u003cp\u003eI turned. City of Anoka Police Officer Boyd Baumbach was smiling at me.\u003c/p\u003e\n\u003cp\u003e“This way,” he said.\u003c/p\u003e\n\u003cp\u003eBaumbach hustled me out of the banquet hall, out of the clubhouse, and into the parking lot as if he had done it a dozen times before. He was pushing me forcefully toward his police cruiser when I broke his grip and spun him around.\u003c/p\u003e\n\u003cp\u003e“We going somewhere?” I asked.\u003c/p\u003e\n\u003cp\u003e“Resisting arrest,” he told me. “You’re in for it now.”\u003c/p\u003e\n\u003cp\u003e“Arrest for what?”\u003c/p\u003e\n\u003cp\u003e“Trespassing. Disorderly conduct.”\u003c/p\u003e\n\u003cp\u003e“Really? I thought I was exercising my right to free speech. Or are you as dumb about the Constitution as you are about the law?”\u003c/p\u003e\n\u003cp\u003eBaumbach smiled like a kid with a secret. “We can make all this go away,” he said. “Isn’t that what you told me the other day?”\u003c/p\u003e\n\u003cp\u003e“I was trying to do you a favor.”\u003c/p\u003e\n\u003cp\u003e“Now I’m trying to do a favor for you. If you promise to shuddup about what happened . . .”\u003c/p\u003e\n\u003cp\u003e“Have I signed a complaint? Have I gone to IAD? Have I done any of that shit?”\u003c/p\u003e\n\u003cp\u003e“You told the sarge, and now he’s on me.”\u003c/p\u003e\n\u003cp\u003e“I hope he fires your ass.”\u003c/p\u003e\n\u003cp\u003e“That’s it. You’re going to jail for keeps this time. Now we can do this the easy way”—Baumbach held his cuffs out for me to see—“or we can do it the hard way.” He slid his sixteen-inch-long flashlight out of the loop on his belt and tapped the tip of his shoulder with it. “You choose.”\u003c/p\u003e\n\u003cp\u003e“Let me guess. You’re a manly man who does manly things in a manly way.”\u003c/p\u003e\n\u003cp\u003e“Choose.”\u003c/p\u003e\n\u003cp\u003eI surprised him by stepping in close.\u003c/p\u003e\n\u003cp\u003eHe raised his flashlight over his head.\u003c/p\u003e\n\u003cp\u003eI hit him with two left-hand jabs and at least six straight rights, the last two as he was falling to the asphalt.\u003c/p\u003e\n\u003cp\u003eBaumbach wasn’t unconscious, yet he might as well have been. He opened his mouth, but no sounds came out, and his eyes wouldn’t focus. I grabbed the handcuffs from where they had fallen and clamped them on his wrists. I took the flashlight and reattached it to his belt.\u003c/p\u003e\n\u003cp\u003eAn older gentleman pulling his golf clubs in a three-wheel cart across the parking lot stopped to watch.\u003c/p\u003e\n\u003cp\u003e“How you doing?” I asked him.\u003c/p\u003e\n\u003cp\u003e“He’s a police officer,” he told me.\u003c/p\u003e\n\u003cp\u003e“Appearances can be deceiving.”\u003c/p\u003e\n\u003cp\u003eI grabbed Baumbach by the collar of his thick shirt and dragged him across the asphalt to his car. It was hard work in oppressive heat. By the time I reached the police cruiser, the back of my own shirt was saturated. I propped Baumbach against the front tire and wiped sweat out of my eyes.\u003c/p\u003e\n\u003cp\u003e“Boyd.” I slapped him gently on both cheeks. “Boyd. Hey, Boyd. Are you still with me?”\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” There was genuine fear in his voice. I liked that.\u003c/p\u003e\n\u003cp\u003e“What’s your call sign?”\u003c/p\u003e\n\u003cp\u003e“My what?”\u003c/p\u003e\n\u003cp\u003e“Your handle. What’s your handle?”\u003c/p\u003e\n\u003cp\u003e“Bravo-three. What do you—”\u003c/p\u003e\n\u003cp\u003eI leaned in and activated the microphone attached to the epaulet of his shirt.\u003c/p\u003e\n\u003cp\u003e“Bravo-three,” I said.\u003c/p\u003e\n\u003cp\u003e“Bravo-three, go.”\u003c/p\u003e\n\u003cp\u003e“Bravo-three requires a supervisor at the parking lot of the Greenhaven Golf Course. Is Sergeant Moorhead available?”\u003c/p\u003e\n\u003cp\u003e“Bravo-three. Boyd, you sound funny.”\u003c/p\u003e\n\u003cp\u003e“Bravo-three. Let’s pretend that we’re a professional police organization, shall we? Is Sergeant Moorhead available?”\u003c/p\u003e\n\u003cp\u003e“Bravo-three. Yes, but—”\u003c/p\u003e\n\u003cp\u003e“Dispatch him to the parking lot of the Greenhaven Golf Course immediately. Bravo-three, out.”\u003c/p\u003e\n\u003cp\u003eI straightened up and gazed toward the private road that led to the golf course, half expecting to see Moorhead racing toward me.\u003c/p\u003e\n\u003cp\u003e“You’re in trouble,” Baumbach said, yet there wasn’t much vigor in his words.\u003c/p\u003e\n\u003cp\u003e“One of us is,” I said.\u003c/p\u003e\n\u003cp\u003eSergeant Moorhead’s hand was resting on the butt of his gun when he slipped out of his cruiser. I held up my empty hands and turned slowly, proving that I was unarmed. He moved closer. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-38.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
