{"id":105475,"no":44,"title":"Page 44","content":"\u003cp\u003e“My name is McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said, and continued her journey. A few moments later, she was crawling through the tunnel, using the measuring wheel to mark her journey. Her voice echoed up to me. She was singing.\u003c/p\u003e\n\u003cp\u003e“McKenzie, I just met a boy named McKenzie, and nothing in the worrrrrrld will ever be the saaaaame—again.”\u003c/p\u003e\n\u003cp\u003eI laughed some more. After her voice faded, I ran to the storm drain opening where I had lost my keys and waited for Benny to appear. The wait seemed interminable.\u003c/p\u003e\n\u003cp\u003e“Benny,” I called into the sewer. “Benny, can you hear me?”\u003c/p\u003e\n\u003cp\u003eThere was no reply.\u003c/p\u003e\n\u003cp\u003e“There are no alligators in the sewer system,” I called. “That’s just an urban myth.”\u003c/p\u003e\n\u003cp\u003eA few moments later, Benny appeared beneath the grate.\u003c/p\u003e\n\u003cp\u003e“What took you so long?” I asked.\u003c/p\u003e\n\u003cp\u003e“I thought I heard . . . I thought I heard—something—but it must have been the rats.”\u003c/p\u003e\n\u003cp\u003e“I wish you’d stop talking like that.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“You know.”\u003c/p\u003e\n\u003cp\u003e“You’re not worried about me, are you, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Why would I be worried? There are no alligators in the sewer system, and I don’t even know you. Now would you get the hell out of there.”\u003c/p\u003e\n\u003cp\u003e“You are worried.”\u003c/p\u003e\n\u003cp\u003e“Stop it.”\u003c/p\u003e\n\u003cp\u003e“In a minute.”\u003c/p\u003e\n\u003cp\u003e“And stop smiling.”\u003c/p\u003e\n\u003cp\u003eOnly Benny couldn’t help herself. She continued to smile even as the foul liquid she was digging in flowed over the top of her gloves and around her fingers. After a few moments of searching, she snagged my keys.\u003c/p\u003e\n\u003cp\u003e“Found ’em,” she announced, holding them above her head. “Meet you at the other end.”\u003c/p\u003e\n\u003cp\u003eI watched her disappear into the pipe. A moment later I heard the echo of a loud scream that might have been bloodcurling if it hadn’t been so obviously exaggerated. I waited, looking through the sewer grate, until Benny poked her head back out the tunnel.\u003c/p\u003e\n\u003cp\u003e“Let me guess,’ I said. “It was him.”\u003c/p\u003e\n\u003cp\u003e“No,” said Benny. “It was her.”\u003c/p\u003e\n\u003cp\u003e“Her?”\u003c/p\u003e\n\u003cp\u003e“Haven’t you heard about the giant anaconda that lives down here?”\u003c/p\u003e\n\u003cp\u003e“Well, of course. The sewer snake. It was in all the papers.”\u003c/p\u003e\n\u003cp\u003eA few minutes later I met Benny at the sewer entrance. She held the keys out for me. They were dripping with a brown liquid.\u003c/p\u003e\n\u003cp\u003e“Eww,” I said.\u003c/p\u003e\n\u003cp\u003e“Ahh, wait,” said Benny. She removed the bandanna from her hair.\u003c/p\u003e\n\u003cp\u003e“Don’t do that,” I said, but Benny wiped off the keys anyway and handed them to me. “Terrific,” I said. I actually thought of giving her a hug, but Benny’s boots, coveralls, and hands were smeared with brown sludge, and she smelled like, well, a sewer.\u003c/p\u003e\n\u003cp\u003e“I, ah, don’t know how to thank you,” I told her.\u003c/p\u003e\n\u003cp\u003e“Take me to dinner tonight,” she blurted.\u003c/p\u003e\n\u003cp\u003e“Dinner?”\u003c/p\u003e\n\u003cp\u003e“I promise, I clean up real good.”\u003c/p\u003e\n\u003cp\u003e“A date?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” I said.\u003c/p\u003e\n\u003cp\u003e“You don’t want to be seen with a woman who works in a sewer all day.”\u003c/p\u003e\n\u003cp\u003e“Of course not,” I said, then quickly corrected myself. “No, that’s not what I meant.” Benny was confusing me. I wished she’d stop smiling. “I mean I don’t mind if I’m seen with a woman who works in a sewer.”\u003c/p\u003e\n\u003cp\u003e“Then it’s a date.”\u003c/p\u003e\n\u003cp\u003e“No, Benny . . . Look, you seem like a nice girl.”\u003c/p\u003e\n\u003cp\u003e“I am a nice girl.”\u003c/p\u003e\n\u003cp\u003e“It wouldn’t be fair to you. I’m just coming off this relationship—”\u003c/p\u003e\n\u003cp\u003e“The bitch.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“The woman who hurt you. Point her out. I’ll kick her ass.”\u003c/p\u003e\n\u003cp\u003e“You’ll what?”\u003c/p\u003e\n\u003cp\u003e“Never mind. Violence never solved anything.”\u003c/p\u003e\n\u003cp\u003eI started to laugh again. Just about everything Benny said made me laugh. There was something about her delivery.\u003c/p\u003e\n\u003cp\u003e“About dinner . . .”\u003c/p\u003e\n\u003cp\u003e“I can’t,” I said.\u003c/p\u003e\n\u003cp\u003e“Let me tell you what happened. This woman you were seeing, you dated her for how long? A year? Maybe more?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then you discovered that you couldn’t trust her. You discovered that she couldn’t be depended on when the going got tough, that she wouldn’t be there when you needed her, that she was putting her needs before yours, am I right?”\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003e“But with us—you and me—you already know that you can depend on me. McKenzie, you don’t need a year to find out.”\u003c/p\u003e\n\u003cp\u003e“I know this—how?”\u003c/p\u003e\n\u003cp\u003e“Think about it. How many women do you know would crawl through a filthy, stinking, alligator-infested sewer pipe for you?”\u003c/p\u003e\n\u003cp\u003e“You’re the first.”\u003c/p\u003e\n\u003cp\u003e“Well, then.”\u003c/p\u003e\n\u003cp\u003e“Where do you live?”\u003c/p\u003e\n\u003cp\u003e“Near Lake Nokomis. Only you can pick me up at the Nash Gallery at the U. Do you know where it is?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“In the Regis Art Center?”\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“Rarig Theater? It’s on the West Bank.”\u003c/p\u003e\n\u003cp\u003e“Rarig Theater? I’m not sure . . .”\u003c/p\u003e\n\u003cp\u003e“Okay, now you’re scaring me. It’s next to the Wilson Library.”\u003c/p\u003e\n\u003cp\u003e“I remember the library. Why there?”\u003c/p\u003e\n\u003cp\u003e“You’ll see,” she said. “Eight o’clock?”\u003c/p\u003e\n\u003cp\u003e“Eight o’clock.”\u003c/p\u003e\n\u003cp\u003e“Should I change, or do you think I can get by with what I have on?” she asked.\u003c/p\u003e\n\u003cp\u003eI thought the question was awfully funny. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-44.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
