{"id":105436,"no":5,"title":"Page 5","content":"\u003cp\u003e“Get your hands in the air, get your hands in the air, I want to see your hands!”\u003c/p\u003e\n\u003cp\u003eThe suspect let his hands hang down below his hips. In his left was a paper bag with the store’s logo. In his right was a Smith \u0026amp; Wesson .38. The man didn’t move. He was considering his options.\u003c/p\u003e\n\u003cp\u003e“Don’t think.” I was surprised by how calm my voice sounded. “Drop the gun. Drop it now.”\u003c/p\u003e\n\u003cp\u003eI had trained for hours and hours with the firearms training simulator, going over shoot/don’t shoot scenarios until they all blurred together. This was different. My hands trembled. They had never done that with FATS. And my vision—I could see only what was directly in front of me. It was like looking down a long tunnel.\u003c/p\u003e\n\u003cp\u003e“For God’s sake drop the gun.”\u003c/p\u003e\n\u003cp\u003eThe suspect raised his hands.\u003c/p\u003e\n\u003cp\u003eI fired once.\u003c/p\u003e\n\u003cp\u003eA spread of double-aught buck hit the suspect squarely in the chest. The impact from the blast lifted him off the pavement and hurled him against the glass door of the convenience store. He caromed off the glass. His legs folded and he pitched forward onto his face. He was still holding the gun and the bag shoulder high, away from his body.\u003c/p\u003e\n\u003cp\u003eThe woman screamed.\u003c/p\u003e\n\u003cp\u003eThe man shouted an obscenity.\u003c/p\u003e\n\u003cp\u003eI moved forward slowly, still pointing the shotgun at the suspect. When I reached his unmoving body, I kicked the Smith \u0026amp; Wesson out of his hand.\u003c/p\u003e\n\u003cp\u003e“Four forty, shots fired, suspect down, officer requires assistance.” I was shouting. I didn’t mean to shout. I simply couldn’t help myself.\u003c/p\u003e\n\u003cp\u003e“You killed ’im, you killed ’im,” the woman railed.\u003c/p\u003e\n\u003cp\u003e“He had his hands up,” the man added.\u003c/p\u003e\n\u003cp\u003e“You killed ’im while he was trying to surrender.”\u003c/p\u003e\n\u003cp\u003e“Racist pig.”\u003c/p\u003e\n\u003cp\u003eThey served breakfast, lunch, and dinner on thick brown plastic thermal trays. Each meal was nutritionally balanced, and the portions were certified by a registered dietitian to provide each inmate with approximately 2,200 calories per day, along with all the daily requirements of whatever it was the Minnesota Department of Corrections deemed necessary to a healthy diet. The meals were all quite good, better than some restaurants I could name, and obviously prepared by someone who took pride in his work. There were five meals in all—which is how I kept track of time, by the number of meals.\u003c/p\u003e\n\u003cp\u003eNo one spoke to me, and I refused to give the cops the satisfaction of hearing me ranting and raving and demanding my rights. Instead, I was determined to remain quiet and still, to lie on my mat and stare at the ceiling and do nothing but sing softly to myself.\u003c/p\u003e\n\u003cp\u003eNobody knows the trouble I’ve seen.\u003c/p\u003e\n\u003cp\u003eNobody knows my sorrow.\u003c/p\u003e\n\u003cp\u003eNobody knows the trouble I’ve seen.\u003c/p\u003e\n\u003cp\u003eGlory hallelujah!\u003c/p\u003e\n\u003cp\u003eI must have done that one thirty times. It seemed amusing at first.\u003c/p\u003e\n\u003cp\u003eMy stomach was telling me that I was due for a sixth meal when the door swung open. I stayed on my back, staring at the ceiling, not moving until the officer announced, “You’re free to go.” I rolled off the concrete bed without speaking, taking my time, acting as if the officer had just told me that the dentist was ready to see me now. The officer led me to a desk in the booking station. The sergeant was leaning against the wall behind the desk. His name tag read J. MOORHEAD. I pretended not to see him.\u003c/p\u003e\n\u003cp\u003eThe officer retrieved a large envelope and dumped the contents between us—my belongings. I slowly counted the cash. “It’s all there,” he insisted, so I made a big production of counting it a second time.\u003c/p\u003e\n\u003cp\u003e“Now then, what lesson have we learned?” the sergeant asked.\u003c/p\u003e\n\u003cp\u003e“What’s the name of the woman—the one your officer beat up?”\u003c/p\u003e\n\u003cp\u003eThe sergeant pushed himself off the wall. “Be careful what you say,” he told me.\u003c/p\u003e\n\u003cp\u003e“Did you arrest her, too?”\u003c/p\u003e\n\u003cp\u003eLet it go.\u003c/p\u003e\n\u003cp\u003eThe officer behind the desk handed me a clipboard holding a single sheet of paper. “Sign here,” he said.\u003c/p\u003e\n\u003cp\u003eI took the clipboard and flung it across the room.\u003c/p\u003e\n\u003cp\u003eI intended to say what I had to say quietly, only it came out loud. “I appreciate you standing up for your rookie, but I was doing you both a favor by keeping Baumbach from beating on a suspect—and you put me in jail for it? That’s wrong. You should have checked me out first. You would have learned that I have eleven and a half years on the job with the St. Paul Police Department, five million bucks in the bank, and a bad attitude.”\u003c/p\u003e\n\u003cp\u003eThe sergeant smirked like a guy who’d heard it all before.\u003c/p\u003e\n\u003cp\u003e“Some people need more than one lesson,” he said.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it, Sarge. You’re gonna get more than one.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-5.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
