{"id":105500,"no":70,"title":"Page 70","content":"\u003cp\u003eI entered the branch bank where Debbie Miller worked. The woman who sat at the desk nearest the door greeted me and asked if she could be of assistance. After a moment’s discussion, she motioned to Miller, who had been watching me from her cashier station. Obviously she had been waiting for me. Nye probably called her the moment I left his apartment.\u003c/p\u003e\n\u003cp\u003eDebbie Miller was one of those women that men fell in love with at a distance, aroused like Pavlov’s dogs, not by a bell, but by her shapely figure and lustrous shoulder-length red hair. It was only when they were close enough to plainly see her blemished skin, thin lips, large nose, pointy chin, and eyes that didn’t seem to go together that they had second thoughts. She wore a tight, high-collared dark blue dress that was trimmed from hem to throat with gold buttons that emphasized her generous breasts, thin waist, and narrow hips. Yet there was nothing she could do to flatter her face. It was not even remotely pretty and certainly not helped by the excessive amount of artwork she put in around the eyes and lips.\u003c/p\u003e\n\u003cp\u003eDebbie approached cautiously, as if she were afraid of stepping in something. She was smiling, but only out of professional habit. I introduced myself and said I hoped that she would answer a few questions if it wasn’t too inconvenient.\u003c/p\u003e\n\u003cp\u003e“Certainly,” she said.\u003c/p\u003e\n\u003cp\u003eDebbie glanced about the bank. She spied an empty desk with two chairs in the corner near the windows and pointed the way with her sharp chin. I followed.\u003c/p\u003e\n\u003cp\u003eWe sat in the chairs, turning them so we faced each other. Debbie’s front teeth were stained with peach gloss from chewing on her lower lip, and her eyes were red and flashing. The rest of her face was pasty white and displayed as much animation as the Pillsbury Dough Boy. She began defending Richard Nye before I even asked about him.\u003c/p\u003e\n\u003cp\u003e“He’s a good man,” she said. Her voice was tense and she spoke very low, possibly so her coworkers couldn’t eavesdrop. Or maybe she was embarrassed. Not once did her gaze reach mine.\u003c/p\u003e\n\u003cp\u003e“He’s been in trouble, I know,” Debbie continued. “That’s in the past. That’s behind him now. He wants to start over. People should let him start over.”\u003c/p\u003e\n\u003cp\u003e“Fine with me,” I replied as pleasantly as I could. “I hope he lives long and prospers, or whatever it is that that guy in Star Trek says.”\u003c/p\u003e\n\u003cp\u003eDebbie was surprised by my response. “Really?” she asked.\u003c/p\u003e\n\u003cp\u003e“Why not?” I opened my notebook and balanced it on my knee. “I’m not looking to cause him any trouble. I just want to dot some i’s and cross some t’s for the lawyer I work for, that’s all.”\u003c/p\u003e\n\u003cp\u003e“Oh. But he really is a good man.”\u003c/p\u003e\n\u003cp\u003e“How did you meet?”\u003c/p\u003e\n\u003cp\u003e“It was—It was about a month and a half or so ago, I guess. He had come in to cash his first check from the printshop where he got a job after . . . after he got out of jail. You know about that?”\u003c/p\u003e\n\u003cp\u003e“Yes, I know about that.”\u003c/p\u003e\n\u003cp\u003eDebbie seemed relieved that she didn’t have to tell the story.\u003c/p\u003e\n\u003cp\u003e“Anyway, he made me turn the twenties into tens and the tens into fives and then the entire roll into twenties again while he flirted with me, asking me if I lived alone, asking all kinds of personal questions while he made the other customers wait in line. I wore my hair up and he said, ‘I bet you look gorgeous with your hair down instead of in that silly bun.’ I’m not gorgeous. Even with my hair down. I know that. But I liked it when he said I was. Richard was the first man to show interest in . . . in a long time. I have to admit—I have to admit I enjoyed the attention.\u003c/p\u003e\n\u003cp\u003e“And he never lied to me,” she added quickly. “He invited me to dinner that night and I accepted, and during dinner he told me about. . . about his past, about going to jail. He told me that that was all behind him now and he was looking for a strong, honest woman he could love. A woman who would forgive him his trespasses and help him stay on the straight and narrow while he made something productive of his life. That’s what he said.”\u003c/p\u003e\n\u003cp\u003e“No reason it can’t be true,” I told her, although I could think of several.\u003c/p\u003e\n\u003cp\u003e“He’s a good man,” Debbie told me again. As she spoke, she pulled absently at the collar of her dress, and for a moment I could see bruises around her neck where someone had choked her.\u003c/p\u003e\n\u003cp\u003e“I’m sure,” I said, and smiled my most sincere smile. “I just want to know a couple of things.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“If you can confirm Richard’s alibi, that’s jake with me.”\u003c/p\u003e\n\u003cp\u003eI nearly started to giggle. That’s jake with me? Where did that come from? The phrase seemed to turn the trick, though. Debbie smiled—although it didn’t seem to do her face any good—and leaned back in her chair.\u003c/p\u003e\n\u003cp\u003e“Let’s see,” she said. “You want me to tell you . . .”\u003c/p\u003e\n\u003cp\u003e“Saturday, August first. Everything from the moment you saw him until the moment he left.”\u003c/p\u003e\n\u003cp\u003e“Let’s see.” Debbie closed her eyes and spoke slowly. “Richard stayed over Friday night and didn’t go home until early Sunday morning.”\u003c/p\u003e\n\u003cp\u003e“What did you do during all that time?”\u003c/p\u003e\n\u003cp\u003e“On Friday night we stayed in—We just stayed in.” Debbie was blushing now. “On Saturday we had breakfast at my apartment and then he built a bookcase for me and then—”\u003c/p\u003e\n\u003cp\u003e“Did he bring the materials with him?” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-70.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
