{"id":105509,"no":79,"title":"Page 79","content":"\u003cp\u003e“I’m not?”\u003c/p\u003e\n\u003cp\u003e“I think you spend most of your life trying not to be bored.”\u003c/p\u003e\n\u003cp\u003e“You think I’m an excitement junkie?”\u003c/p\u003e\n\u003cp\u003e“I think you need something to hold your interest.”\u003c/p\u003e\n\u003cp\u003e“You hold my interest.”\u003c/p\u003e\n\u003cp\u003e“You need more.”\u003c/p\u003e\n\u003cp\u003e“All I need is love.”\u003c/p\u003e\n\u003cp\u003e“Love?”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003e“Will you jump-start my car?” Nina said.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Will you mow my lawn, will you clean my gutters, will you give me sex?”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“I love you—the phrase. Sometimes it’s a request. Sometimes it’s an excuse. I love you, but I have to leave now. I love you, but I have to go to work, catch a plane, play golf. It asks questions. ‘We’re all right, aren’t we?’ ‘You love me, too, don’t you?’ It means we’ll go shopping, we’ll go to the party, we’ll visit your mother, we’ll get a cat. It rarely means, ‘I have an intense affectionate concern for you.’ ”\u003c/p\u003e\n\u003cp\u003eI grasped her hands. Holding them in mine was like mending a break in a power line—it allowed electricity to surge through me.\u003c/p\u003e\n\u003cp\u003e“I have an intense affectionate concern for you,” I said.\u003c/p\u003e\n\u003cp\u003e“I have an intense affectionate concern for you, too,” she said.\u003c/p\u003e\n\u003cp\u003eShe leaned in close and we kissed.\u003c/p\u003e\n\u003cp\u003e“I suppose this is all my fault,” she said when we finished. “I won’t marry you because of my previous experience with the institution. You won’t live with me because it’s unfair to my daughter. So we date.”\u003c/p\u003e\n\u003cp\u003e“Girlfriend and boyfriend.”\u003c/p\u003e\n\u003cp\u003e“But since we have no formal commitment, theoretically we’re allowed to see other people, and the freedom scares us. Isn’t that why you were frightened about Daniel?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t frightened.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“I was jealous.”\u003c/p\u003e\n\u003cp\u003e“Big distinction.”\u003c/p\u003e\n\u003cp\u003e“Hmmph.”\u003c/p\u003e\n\u003cp\u003e“Hmmph, what?”\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking lately that when it comes to relationships, we never actually leave high school.”\u003c/p\u003e\n\u003cp\u003e“We’re not kids anymore, McKenzie. We’re mature adults.”\u003c/p\u003e\n\u003cp\u003e“Sometimes I forget.”\u003c/p\u003e\n\u003cp\u003e“In high school, it’s impossible to hold our partners to their promises. There’s just too much future in front of us and it’s too uncertain. Adults—we’re expected to keep our vows.”\u003c/p\u003e\n\u003cp\u003e“What vows are those?”\u003c/p\u003e\n\u003cp\u003e“To have and to hold from this day forward, for better, for worse, for richer, for poorer, in sickness and in health, to love and to cherish, forsaking all others until you tell me otherwise. That vow.”\u003c/p\u003e\n\u003cp\u003e“Or until you tell me otherwise,” I said.\u003c/p\u003e\n\u003cp\u003eNina extended her hand.\u003c/p\u003e\n\u003cp\u003e“Promise?” she said.\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003eWe shook hands and held hands and spent several moments staring at each other.\u003c/p\u003e\n\u003cp\u003e“If we were in high school, I’d want to sit at your table,” I said.\u003c/p\u003e\n\u003cp\u003e“I’d save you a place.”\u003c/p\u003e\n\u003cp\u003eJenness appeared. She set a Bailey’s on the rocks in front of Nina and a Summit Ale in front of me.\u003c/p\u003e\n\u003cp\u003e“So,” she said. “Are you guys good again?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Nina.\u003c/p\u003e\n\u003cp\u003eThat single word filled me with relief and joy that I simply don’t have the words to express.\u003c/p\u003e\n\u003cp\u003e“Then I win,” said Jenness.\u003c/p\u003e\n\u003cp\u003e“Win what?” I asked.\u003c/p\u003e\n\u003cp\u003e“The pool. We were all betting on how long it would take you guys to get back together.”\u003c/p\u003e\n\u003cp\u003e“Really? How much?” I asked.\u003c/p\u003e\n\u003cp\u003e“Fifty-five dollars.”\u003c/p\u003e\n\u003cp\u003e“A tidy sum.”\u003c/p\u003e\n\u003cp\u003e“Don’t you have work to do?” Nina asked.\u003c/p\u003e\n\u003cp\u003e“Ah, love,” Jenness said, and returned to the bar.\u003c/p\u003e\n\u003cp\u003e“Fifty-five bucks,” Nina said. “If I had known there was a pool. . .”\u003c/p\u003e\n\u003cp\u003e“This has all been so silly,” I said.\u003c/p\u003e\n\u003cp\u003e“You’re the one who was parked outside my house.”\u003c/p\u003e\n\u003cp\u003e“You’re the one who went out with some loser.”\u003c/p\u003e\n\u003cp\u003e“You’re the one who stood me up for an important date.”\u003c/p\u003e\n\u003cp\u003e“I told you, I was in jail.”\u003c/p\u003e\n\u003cp\u003e“I told you, it’s always something.”\u003c/p\u003e\n\u003cp\u003e“Arrrrggggggg!”\u003c/p\u003e\n\u003cp\u003eMy cell phone played the opening notes to Beethoven’s “Ode to Joy.” I untangled my fingers from Nina’s—it took much longer than was necessary—and reached into my jacket pocket. I read the name on the caller ID and glanced up at Nina.\u003c/p\u003e\n\u003cp\u003e“I need to take this.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“This is McKenzie,” I said into the mouthpiece.\u003c/p\u003e\n\u003cp\u003eNina leaned forward to listen.\u003c/p\u003e\n\u003cp\u003e“Yes, Debbie. Are you all right? You sound . . . When . . .? Did you call the police? Yes, yes, right now . . . You should . . . Okay . . . Okay, yes, I’m coming . . .”\u003c/p\u003e\n\u003cp\u003eThe tone of my voice told Nina that it was trouble. She rested a reassuring hand on my wrist.\u003c/p\u003e\n\u003cp\u003e“Tell me where you are . . . Where is that?”\u003c/p\u003e\n\u003cp\u003eI pulled a pen from my pocket. Nina slid a napkin in front of me. I nodded my thanks to her and started writing.\u003c/p\u003e\n\u003cp\u003e“Tell me again . . . Yes, I have it. I’m coming, Debbie. I’m coming right now.”\u003c/p\u003e\n\u003cp\u003eI deactivated the cell and turned my attention to Nina. “I need to go.”\u003c/p\u003e\n\u003cp\u003e“McKenzie . . .” She let my name hang there. Then, “Another damsel in distress?”\u003c/p\u003e\n\u003cp\u003e“ ’Fraid so.”\u003c/p\u003e\n\u003cp\u003e“Is there anything I can do?”\u003c/p\u003e\n\u003cp\u003e“Forgive me.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing to forgive.”\u003c/p\u003e\n\u003cp\u003eI stood and moved toward the front door.\u003c/p\u003e\n\u003cp\u003e“McKenzie.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-79.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
