{"id":105513,"no":83,"title":"Page 83","content":"\u003cp\u003e“I don’t need to pay some fancy-ass lawyer to cut a deal,” Nye insisted. “I can make my own deals.”\u003c/p\u003e\n\u003cp\u003e“You have the right to remain silent. Anything you say—”\u003c/p\u003e\n\u003cp\u003e“I know my fucking rights,” Nye said. “I’ve been Mirandized a dozen times already.”\u003c/p\u003e\n\u003cp\u003e“Just so you understand.”\u003c/p\u003e\n\u003cp\u003e“Let’s just get on with it, all right?”\u003c/p\u003e\n\u003cp\u003e“Let’s.”\u003c/p\u003e\n\u003cp\u003eBriggs removed a lacquered pen from his jacket pocket and slowly rotated the barrel to lower the tip into writing position. He turned the yellow pad on the table in front of him until it rested at a perfect angle before reviewing it. Nye beat an impatient rhythm on the tabletop with his fingers while he waited.\u003c/p\u003e\n\u003cp\u003e“First of all, you’re already going to prison for five years,” Briggs said. “That’s prison. Not jail. You violated the terms of your parole the second you picked up the gun.”\u003c/p\u003e\n\u003cp\u003e“Shit,” Nye muttered.\u003c/p\u003e\n\u003cp\u003e“You have a criminal history score of three,” Briggs added. “Do you know about the criminal history score? How it works?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“In Minnesota, the more crimes you’re convicted of, the greater your score.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“The greater your score, the more time you do for each conviction.”\u003c/p\u003e\n\u003cp\u003e“I said I knew. Jesus Christ, get on with it.”\u003c/p\u003e\n\u003cp\u003e“All right,” Briggs said, not flustered at all and in no particular hurry. “We have you for first degree assault—”\u003c/p\u003e\n\u003cp\u003e“First degree?”\u003c/p\u003e\n\u003cp\u003e“Ms. Miller is in Mercy Hospital with a broken nose, fractured jaw, two broken teeth, three cracked ribs, and a ruptured spleen. Where I come from, that constitutes first degree.”\u003c/p\u003e\n\u003cp\u003e“Shit,” Nye said.\u003c/p\u003e\n\u003cp\u003e“With your score, that’s one hundred and twenty-two months. We also have you for two counts of second degree assault for shooting at Ms. Miller and Mr. McKenzie. ‘Course, if you had hit ’em, then it would be first—”\u003c/p\u003e\n\u003cp\u003e“Fuckin’ McKenzie was shooting at me.”\u003c/p\u003e\n\u003cp\u003e“Are you pleading self-defense?”\u003c/p\u003e\n\u003cp\u003e“I’m just saying.”\u003c/p\u003e\n\u003cp\u003e“Well, let’s say that charge holds up. We could go for attempted murder instead. You beat up Miller. Miller calls McKenzie. McKenzie comes running. You ambush him. Yeah, I think I can make a case for attempted murder. How ‘bout you? Want me to try? It’ll screw up the math, but I’m willing.”\u003c/p\u003e\n\u003cp\u003e“Shit.”\u003c/p\u003e\n\u003cp\u003e“ ’Course, if we had been real lucky, McKenzie would have splattered your brains all over the parking lot—he’s done it before.”\u003c/p\u003e\n\u003cp\u003eI continued to shiver behind the glass.\u003c/p\u003e\n\u003cp\u003eNye smiled the uncontrollable smile of a man who knew he was in deep trouble and it was just getting worse.\u003c/p\u003e\n\u003cp\u003e“Something funny, Nye?” Briggs asked.\u003c/p\u003e\n\u003cp\u003eNye shook his head.\u003c/p\u003e\n\u003cp\u003e“I’ll tell ya what I think is funny,” Briggs said. “First degree assault, plus two counts of second degree assault at thirty-four months each, plus the five years for your parole violation . . . Why, Richard. You’re going to prison for twenty-one years.”\u003c/p\u003e\n\u003cp\u003eNye studied Briggs’s beaming face for a moment.\u003c/p\u003e\n\u003cp\u003e“Fourteen years if I get a third off for good time,” he said.\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“Fourteen years if the judge adheres strictly to the Minnesota Sentencing Guidelines.”\u003c/p\u003e\n\u003cp\u003e“They usually do.”\u003c/p\u003e\n\u003cp\u003e“Fourteen years if the sentences are served consecutively.”\u003c/p\u003e\n\u003cp\u003e“Right again.”\u003c/p\u003e\n\u003cp\u003e“The sentences, they all could be served concurrently with the parole violation.”\u003c/p\u003e\n\u003cp\u003e“Could be,” said Briggs.\u003c/p\u003e\n\u003cp\u003e“That would mean I would get out in”—Nye did the math quickly—“six and a half years.”\u003c/p\u003e\n\u003cp\u003e“Six years, eight months to be precise,” Briggs said.\u003c/p\u003e\n\u003cp\u003e“Or less.”\u003c/p\u003e\n\u003cp\u003e“Could very well be less. Especially if you agree to testify in all the meth cases. Except. . .”\u003c/p\u003e\n\u003cp\u003e“Except what?”\u003c/p\u003e\n\u003cp\u003e“Do you see anyone around here willing to make a sentencing recommendation?”\u003c/p\u003e\n\u003cp\u003eNye smiled and leaned across the conference room table. “What if I make it easy for you and cop a plea?”\u003c/p\u003e\n\u003cp\u003e“On what?”\u003c/p\u003e\n\u003cp\u003e“On everything.”\u003c/p\u003e\n\u003cp\u003e“That would make me very happy,” Briggs said. “Save the taxpayers a lot of money in court fees, too.”\u003c/p\u003e\n\u003cp\u003e“How happy?”\u003c/p\u003e\n\u003cp\u003eBriggs rubbed his chin, pretending he was deep in thought, pretending he hadn’t known exactly what he was going to offer Nye before he even entered the room.\u003c/p\u003e\n\u003cp\u003eTuseman muttered something unintelligible, then added, “Get on with it.”\u003c/p\u003e\n\u003cp\u003e“You go down for the nickel plus one,” Briggs said at last. “Six years.”\u003c/p\u003e\n\u003cp\u003e“Five,” said Nye.\u003c/p\u003e\n\u003cp\u003e“Six,” repeated Briggs. “And this time you do every fucking day.”\u003c/p\u003e\n\u003cp\u003e“I can live with that.”\u003c/p\u003e\n\u003cp\u003e“One more thing.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“I want you to tell me the truth about Eli Jefferson.”\u003c/p\u003e\n\u003cp\u003eBehind the one-way mirror, G. K. Bonalay exhaled sharply.\u003c/p\u003e\n\u003cp\u003eDavid Tuseman stepped away from the glass and rested against the opposite wall.\u003c/p\u003e\n\u003cp\u003eI continued to shiver.\u003c/p\u003e\n\u003cp\u003e“I don’t know nothing about Jefferson,” Nye said.\u003c/p\u003e\n\u003cp\u003eBriggs rose abruptly from his chair, snatched the yellow pad off the table, and moved toward the door.\u003c/p\u003e\n\u003cp\u003e“Wait a minute, man,” Nye called to him.\u003c/p\u003e\n\u003cp\u003e“Wait for what? You can do the fourteen.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-83.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
