{"id":105515,"no":85,"title":"Page 85","content":"\u003cp\u003e“Salt of the earth,” I said.\u003c/p\u003e\n\u003cp\u003e“One more thing, David.” G. K. moved close enough to Tuseman that they could have kissed. “I want Merodie released.”\u003c/p\u003e\n\u003cp\u003e“After she serves her thirty days.”\u003c/p\u003e\n\u003cp\u003e“Today, David. I want Merodie out today. If she’s not free by 3:00 P.M., I’ll conduct a press conference outside your office at 3:30 P.M. That should give the TV people plenty of time to prepare for the six o’clock news.”\u003c/p\u003e\n\u003cp\u003e“Are you threatening me, Genny?” Tuseman wanted to know.\u003c/p\u003e\n\u003cp\u003e“You betcha.”\u003c/p\u003e\n\u003cp\u003eThe sun came up like a flamethrower, scorching everything in sight, setting even the shadows on fire. I felt the heat on my wet clothes as G. K. and I left the court building. Water vapor condensed and rose as fog from my shoulders. My clothes were streaked with dirt, and the knees of my jeans looked like I had knelt in a mud puddle, which, of course, I had. I slipped off my now shapeless sports jacket and pulled my shirt away from my skin. I felt like I was breathing through a damp washcloth.\u003c/p\u003e\n\u003cp\u003e“Where are you parked?” G. K. asked.\u003c/p\u003e\n\u003cp\u003eI pointed east on Main Street.\u003c/p\u003e\n\u003cp\u003e“Me, too,” she said.\u003c/p\u003e\n\u003cp\u003e“I didn’t want to say anything in front of the county attorney,” I said as we followed the sidewalk, walking directly into the rising sun.\u003c/p\u003e\n\u003cp\u003e“Always a wise decision,” G. K. said.\u003c/p\u003e\n\u003cp\u003e“I think Nye was telling the truth.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003e“About Eli Jefferson. We have a witness. Priscilla St. Ana. She was on the scene after Nye had his alleged shoving match with Jefferson.”\u003c/p\u003e\n\u003cp\u003e“I like that word—alleged,” G. K. said.\u003c/p\u003e\n\u003cp\u003e“St. Ana said there was no body on the floor when she arrived.”\u003c/p\u003e\n\u003cp\u003e“Forget about St. Ana.”\u003c/p\u003e\n\u003cp\u003e“Forget her?”\u003c/p\u003e\n\u003cp\u003e“Forget everything. Look, McKenzie. I’m not Perry Mason. I’m not here to solve a crime. I don’t even care who committed the crime. My job—and your job—is to show that our client is not guilty of the crime, and yes, we both know that’s not the same thing as being innocent.”\u003c/p\u003e\n\u003cp\u003e“But what if. . .?”\u003c/p\u003e\n\u003cp\u003e“There are no ‘But what ifs.’”\u003c/p\u003e\n\u003cp\u003eG. K. placed a hand on my arm, stopping me. She looked up into my eyes. There was nothing sexual about it. She merely wanted my undivided attention.\u003c/p\u003e\n\u003cp\u003e“When I was young and just starting out, I believed that justice was more important than life.” She spoke as if she had made the same speech before—maybe to herself. “That’s why I wanted to do the work I did, to serve justice. It was only after I became older and wiser that I realized justice belongs to God alone. The best the rest of us can do is serve the law. Well, McKenzie, the law says if there’s reasonable doubt, the defendant goes free. Merodie Davies will go free today because after Richard Nye’s behavior and the remarkable statement he just made there’s plenty of reasonable doubt. Understand?”\u003c/p\u003e\n\u003cp\u003eI understood. That didn’t make me any happier.\u003c/p\u003e\n\u003cp\u003e“You said that justice belongs to God alone,” I said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then where does Mr. Muehlenhaus come in?”\u003c/p\u003e\n\u003cp\u003eG. K. refused to answer. She continued down the sidewalk. She didn’t take half a dozen steps before her cell phone rang.\u003c/p\u003e\n\u003cp\u003e“Speak of the devil,” I said.\u003c/p\u003e\n\u003cp\u003eShe answered the phone without breaking stride, listened for a moment. “Thank you, sir,” she said, and glanced away from me, refusing to meet my eyes.\u003c/p\u003e\n\u003cp\u003e“What did I tell you?” I said.\u003c/p\u003e\n\u003cp\u003e“Yes, sir . . . That’s very kind of you . . . No, sir . . . I appreciate it very much . . . He’s standing right here . . . Not at all. . . Just a moment.”\u003c/p\u003e\n\u003cp\u003eG. K. thrust her phone at me. “He wants to speak with you.”\u003c/p\u003e\n\u003cp\u003eShe didn’t identify who “he” was. There was no need.\u003c/p\u003e\n\u003cp\u003e“Good morning, Mr. Muehlenhaus,” I said.\u003c/p\u003e\n\u003cp\u003e“Good morning, Mr. McKenzie. How are you? No worse for wear, I hope.”\u003c/p\u003e\n\u003cp\u003e“Fit as a fiddle and ready for love.”\u003c/p\u003e\n\u003cp\u003e“That’s my boy.”\u003c/p\u003e\n\u003cp\u003eI didn’t like that he called me “his boy,” but I let it slide.\u003c/p\u003e\n\u003cp\u003e“My sources tell me that Ms. Davies will soon be released,” Muehlenhaus said. “It seems that once again I am in your debt.”\u003c/p\u003e\n\u003cp\u003e“What’s the going rate for such things?” I asked. “The hand of your eldest daughter and half your kingdom?”\u003c/p\u003e\n\u003cp\u003e“Alas, my daughters are all spoken for. I do, however, have a rather attractive granddaughter, if I do say so myself, who I am sure will find you just as fascinating as I do.”\u003c/p\u003e\n\u003cp\u003e“Is she as duplicitous as her grandfather?”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie, there is no need—”\u003c/p\u003e\n\u003cp\u003e“Stop it,” I said. “According to my birth certificate I was born at night, Mr. Muehlenhaus, but I wasn’t born last night. You weren’t the slightest bit interested in getting Merodie off the hook. Nor were you concerned that Tuseman would use her murder trial to get publicity for his campaign. He’ll get plenty from the meth busts—and don’t tell me you didn’t know about them ahead of time. No, you wanted the case kicked to protect someone else, and we both know who. Do I need to say her name?”\u003c/p\u003e\n\u003cp\u003e“No.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-85.html","bookId":2222,"creation":"Oct 5, 2019 10:48:57 PM","modification":"Oct 5, 2019 10:48:57 PM"}
