{"id":72392,"no":11,"title":"Page 11","content":"\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003e\"THAT IS YOU!\" HILLARY SHRIEKED. HER CLUSTER OF FRIENDS turned toward me, perhaps expecting some minor celebrity or long-lost cousin of the Winston-hyphen-Smith clan.\u003c/p\u003e\n\u003cp\u003e\"Uh, hi, Hillary,\" I said mildly, thinking, Not the name! Not the name!\u003c/p\u003e\n\u003cp\u003e\"My God, Hunter! You look completely different!\"\u003c/p\u003e\n\u003cp\u003eThe bald guy was facing me, only yards away, and here was Hillary shouting my name.\u003c/p\u003e\n\u003cp\u003e\"Oh, not really that different.\" Don\u0027t mention the hair!\u003c/p\u003e\n\u003cp\u003e\"Yeah, right. What did you do to your hair, Hunter?\"\u003c/p\u003e\n\u003cp\u003eI could feel the bald guy\u0027s eyes on me, adding up my height and build, the frequently mentioned name (currently number thirty-two in popularity), and finally the hair....\u003c/p\u003e\n\u003cp\u003e\"You should really dress up more often,\" Hillary said, her expression adding one more terrifying thought to all the others going through my head: the possibility that Hillary Hyphen was undergoing a revelation that dorky little skater kid Hunter was growing up into a real cutie.\u003c/p\u003e\n\u003cp\u003eThen she frowned. \"But what\u0027s with the purple hands? Is that supposed to be retro punk or something?\"\u003c/p\u003e\n\u003cp\u003eThere are times when all you can think to say is:\u003c/p\u003e\n\u003cp\u003e\"I have to go now.\"\u003c/p\u003e\n\u003cp\u003eI ignored her surprise and walked away, some anti-starvation autopilot in my brain stuffing the last of the salmon sandwich into my face. I didn\u0027t have to look back as I walked into the Hall of African Mammals, the glassy eyes of dead animals tracking me, knowing me for a marked man.\u003c/p\u003e\n\u003cp\u003eThere was no doubt in my mind: the bald guy was following me.\u003c/p\u003e\n\u003cp\u003eMy phone rang. Still on autopilot, I answered.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003eA deep voice sent a chill through me: \"Hi, Hunter. Like the hair.\"\u003c/p\u003e\n\u003cp\u003eWeaving through the throng still circling the elephants, I glanced backward. He was close, making his slow, powerful way through the crowd.\u003c/p\u003e\n\u003cp\u003e\"We want to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"Uh, call me tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"In person. Tonight.\"\u003c/p\u003e\n\u003cp\u003eI decided to go on the offensive, even as I cowered behind a passel of penguins comparing cummerbunds. \"Where\u0027s Mandy?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s with us now, Hunter.\" He paused. \"Wait a second, I didn\u0027t mean that to sound all creepy.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it did.\"\u003c/p\u003e\n\u003cp\u003eI kept moving, bumped into a woman from behind, and waved an apologetic purple hand when she glared at me.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" I said, pulling away.\u003c/p\u003e\n\u003cp\u003e\"Sorry for what?\" the bald guy\u0027s voice said.\u003c/p\u003e\n\u003cp\u003e\"Not you.\" I looked around, trying to find him again.\u003c/p\u003e\n\u003cp\u003eHe had disappeared.\u003c/p\u003e\n\u003cp\u003eMy eyes darted from gazelles to lions to gorillas, trying to spot the guy again, but his bulky frame and bald head had completely vanished.\u003c/p\u003e\n\u003cp\u003e\"Hunter, this isn\u0027t about Mandy; it\u0027s about the shoes.\"\u003c/p\u003e\n\u003cp\u003eI backed up, trying to look in all directions at once. The guy couldn\u0027t do anything to me in the middle of the party, but I didn\u0027t want him getting any closer. Dressed like a security guard, he could always drag me off, pretending to be throwing an unruly guest out.\u003c/p\u003e\n\u003cp\u003e\"What about the shoes?\" I said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re trying to do a deal. But we have to keep it quiet.\"\u003c/p\u003e\n\u003cp\u003eStill no sign of him among the swirling mass of penguins. The cold glass of a diorama window pressed against my back. I felt pinned.\u003c/p\u003e\n\u003cp\u003e\"So you want to keep me quiet? That sounds pretty creepy too.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not like that, Hunter. We wanted you here to show you what we\u0027re trying to do. This is about more than just shoes.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that.\"\u003c/p\u003e\n\u003cp\u003eA beeping sound screamed in my ear, demanding my attention. I glanced at the phone\u0027s screen.\u003c/p\u003e\n\u003cp\u003eJen.\u003c/p\u003e\n\u003cp\u003e\"Uh, could you hang on? Call waiting.\"\u003c/p\u003e\n\u003cp\u003e\"Hunter, don\u0027t - \"\u003c/p\u003e\n\u003cp\u003eI switched over. \"Jen! I\u0027m so glad - \"\u003c/p\u003e\n\u003cp\u003e\"Turn left, walk.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"Go! He\u0027s closing in.\"\u003c/p\u003e\n\u003cp\u003eI went. Through the door and then down a passage lined with photographs of Antarctica. Then I found myself in a hall of huts and costumes, weapons and tools.\u003c/p\u003e\n\u003cp\u003e\"I seem to be in Africa.\"\u003c/p\u003e\n\u003cp\u003e\"Go all the way through, then take a right and down the stairs.\"\u003c/p\u003e\n\u003cp\u003eCould she see me? There wasn\u0027t time to ask.\u003c/p\u003e\n\u003cp\u003eI came to a red velvet rope at the edge of the party. I looked back.\u003c/p\u003e\n\u003cp\u003e\"Jen?\" I called out.\u003c/p\u003e\n\u003cp\u003eUnless she was disguised as a motionless Yoruba shaman, she wasn\u0027t in this room. But the bald guy was still in sight, following with measured steps and the annoyed expression of an ignored authority figure.\u003c/p\u003e\n\u003cp\u003e\"Just keep going,\" Jen said from my phone. \"I\u0027m looking at a map. Run.\"\u003c/p\u003e\n\u003cp\u003eI ducked under the velvet rope and turned right, dashing through a darkened room full of stuffed birds behind glass. A wide flight of marble steps appeared on my right.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t bother glancing back, knowing the bald guy was right behind me, and plunged down the unlit steps. My hard-soled shoes sent echoes off the marble, pattering like disappointed tongue clicks from every direction.\u003c/p\u003e\n\u003cp\u003eI would have killed for some sneakers about then. Or clothes without plastic tags sticking into me.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the stairs I whispered, \"Where now?\"\u003c/p\u003e\n\u003cp\u003e\"Turn right again. Through the monkey skeletons.\"\u003c/p\u003e\n\u003cp\u003eI entered a long hall that ran through the entire course of human evolution - from slothlike primates in trees to a slothlike Homo remote controllus watching television in his living room - all in about thirty seconds. Among the darkened exhibits I suddenly felt how alone I was (except for the other monkeys) and began to wonder why I\u0027d left the relative safety of the party.\u003c/p\u003e\n\u003cp\u003e\"See any meteorites yet?\" Jen asked.\u003c/p\u003e\n\u003cp\u003e\"Meteorites? Hang on.\"\u003c/p\u003e\n\u003cp\u003eThe next archway opened into a large square room filled with jagged rocks on pedestals.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I whispered. \"But why am I looking at meteorites?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying to get you out of his sight so we can leave without being followed.\"\u003c/p\u003e\n\u003cp\u003e\"But I was safe! They\u0027re not going to do anything while the party\u0027s going.\"\u003c/p\u003e\n\u003cp\u003e\"Parties don\u0027t last forever, Hunter.\"\u003c/p\u003e\n\u003cp\u003eI looked back through the darkness and thought I heard slow, deliberate footsteps descending the marble stairs.\u003c/p\u003e\n\u003cp\u003e\"Jen, where are you, anyway?\"\u003c/p\u003e\n\u003cp\u003e\"Two floors above you, in a gallery overlooking the elephants. You are hiding now, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eI looked back through the monkeys but still couldn\u0027t see anyone. There\u0027d been no sign of other human beings since I\u0027d come down the stairs.\u003c/p\u003e\n\u003cp\u003eStill, hidden was better.\u003c/p\u003e\n\u003cp\u003eNear the center of the room was a meteorite the size of a car. Big enough to crouch behind. I peeked my head out, training an eye on the approach from the hall of monkey skeletons.\u003c/p\u003e\n\u003cp\u003e\"Okay, hidden now.\"\u003c/p\u003e\n\u003cp\u003e\"You think he followed you?\"\u003c/p\u003e\n\u003cp\u003e\"Definitely,\" I whispered. \"But he doesn\u0027t seem to be in a huge hurry to find me. Maybe he\u0027s calling up reinforcements.\"\u003c/p\u003e\n\u003cp\u003e\"Perfect. Just stay hidden. I\u0027ve got a few more things to check out up here now that they\u0027re out of the way.\"\u003c/p\u003e\n\u003cp\u003e\"Uh, hang on, Jen. Are you using me as a diversion?\"\u003c/p\u003e\n\u003cp\u003e\"You can outrun him, can\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"What is it with you and running?\"\u003c/p\u003e\n\u003cp\u003e\"Listen, call me if you need me, Hunter. If you get bored of the meteorites, there\u0027re some really cool gems next door. I love this place.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thrilled.\"\u003c/p\u003e\n\u003cp\u003e\"But you should probably stay put. The gems room is a dead end.\"\u003c/p\u003e\n\u003cp\u003e\"You mean the only way out of here is back the way I came?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. So stay hidden. See you later.\"\u003c/p\u003e\n\u003cp\u003eI stayed hidden, crouching behind the big hunk of iron from outer space. As always when anxious, I filled my head with useless information, stealing glances away from the yawning doorway to read the little plaques around me.\u003c/p\u003e\n\u003cp\u003eIt turned out that the big meteorite had been brought to New York by Robert Peary, the North Pole guy. It weighed the yawning doorwaya whopping thirty-four tons, which had made traveling with it by ship exciting. On top of almost swamping Peary\u0027s vessel, the mass of iron attracted the needle in the ship\u0027s compass, so the navigator never quite knew which direction was which.\u003c/p\u003e\n\u003cp\u003eI could relate to the feeling.\u003c/p\u003e\n\u003cp\u003eI imagined the bald guy whipping out a compass and following it straight to me.\u003c/p\u003e\n\u003cp\u003eBut strangely, crouching in the darkness calmed my nerves, repairing whatever circuits had been damaged by the Poo-Sham planetarium experience. After a few minutes of waiting and pondering, I remembered an old urban legend about a Japanese kids\u0027 TV show. One episode had caused seizures with some kind of flashing effect.\u003c/p\u003e\n\u003cp\u003eI wondered if the story were true. Whatever the flashing lights had triggered was more subtle than epilepsy, but they did have the power to confuse and befuddle.\u003c/p\u003e\n\u003cp\u003eBut why?\u003c/p\u003e\n\u003cp\u003eI was certain of only one thing: Poo-Sham was a pseudo-product. Like the bootleg shoes, it was designed to confuse the order of things, to disrupt the sacred bond between brand and buyer. I looked at my purple hands and wondered if I could ever squidge anything out onto my head again without trepidation. The anti-client was very weird, but I was beginning to see the outlines of an agenda.\u003c/p\u003e\n\u003cp\u003eA few minutes later the bald guy appeared among the monkey skeletons. I hunkered lower, peering out from under the big space rock. His dress shoes glimmered in the darkness.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/so-yesterday/page-11.html","bookId":2699,"creation":"Oct 5, 2019 10:23:56 AM","modification":"Oct 5, 2019 10:23:56 AM"}
