{"id":72400,"no":19,"title":"Page 19","content":"\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eWHEN ENGLISH GENTLEMEN WENT HUNTING A LONG TIME AGO,\u003c/p\u003e\n\u003cp\u003ethey would occasionally cry at the top of their lungs, \"Soho!\" (I\u0027m not sure why. Maybe Soho was Tallyho\u0027s brother or something like that.) Much later, when some fine hunting grounds near London were paved over to build shops, theaters, and nightclubs, some real-estate genius decided to call this cool new neighborhood \"Soho.\"\u003c/p\u003e\n\u003cp\u003eRather later still, a derelict bit of industrial New York just south of Houston Street was being rebuilt with shops, theaters, and nightclubs, and yet another real-estate genius decided to rebrand this cool new neighborhood \"SoHo,\" meaning \"South of Houston.\"\u003c/p\u003e\n\u003cp\u003eSoon everyone was getting into the act. The folks north of Houston said they lived in \"NoHo,\" lower Broadway went by \"LoBro,\" and the area North Of Where Holland\u0027s Entrance Removes Exhausted Suburbanites began to be called, fittingly, NOWHERESville.\u003c/p\u003e\n\u003cp\u003eSo many real-estate geniuses, so little dengue fever.\u003c/p\u003e\n\u003cp\u003eThese days, when young, cool types are hunting for shops, theaters, and nightclubs, they have been known to cry out, \"Dumbo!\" which stands for Down Under Manhattan Bridge Overpass, a landscape of crumbling factories and industrial vistas that is the last refuge of the truly cool. This week.\u003c/p\u003e\n\u003cp\u003eHere\u0027s how to get there:\u003c/p\u003e\n\u003cp\u003eWe rode the F train to York Street, the cutting edge of Brooklyn. The train was pretty quiet, just the usual coolsters carrying guitar cases and laptops, decorated with tattoos and metal and all coming home from their jobs as designers/writers/artists/fashion designers. I even recognized one of them from our coffee shop, probably one of those guys writing a first novel set in a coffee shop.\u003c/p\u003e\n\u003cp\u003eJen and I climbed out of the station and walked up York. To our left, the span of Manhattan Bridge stretched back over the river. For once I didn\u0027t have that vague discomfort of not being in Manhattan. Given that the anti-client was made up of renegade cool hunters, it made sense that the hunt was winding up here. Most of the obvious hipsters on the train had gotten off with us, lighting up cigarettes and cell phones as they disappeared down the old streets and into restored industrial buildings. I earnestly hoped that this neighborhood would still be cool when I moved out from my parents\u0027 place, but I doubted it. I would probably be letting out a hunting cry of \u0026amp;laquo;NewJerZo\u0026amp;raquo; by the time I could afford a place of my own.\u003c/p\u003e\n\u003cp\u003eYork Street curled to the west, leading us to Flushing Avenue and past the Brooklyn Navy Yard, the home of Two-by-Two Productions.\u003c/p\u003e\n\u003cp\u003eI\u0027d seen old pictures of the yard in the Museum of Natural History, during my time among the meteorites. The giant hunk of space iron that had concealed me had spent a few years here about a century ago as people tried to figure out what to do with thirty-four tons of extraterrestrial souvenir. I wondered if it had pulled the compasses of passing ships toward it and if this corner of Brooklyn was one of those mystic spots that had always attracted weird stuff. It was named after a flying elephant, after all.\u003c/p\u003e\n\u003cp\u003eThese days the Brooklyn Navy Yard has no meteorites, no navy, no ships at all. The huge ship-construction buildings have been turned into film studios, offices, and giant open spaces for the companies who create sets for Broadway musicals.\u003c/p\u003e\n\u003cp\u003e\"I wonder why the anti-client needs this much room,\" Jen said as we walked along.\u003c/p\u003e\n\u003cp\u003e\"Scary question. You could hide anything out here. A fleet of airships, a plague of locusts... a suburban house and lawn.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus. And you think I\u0027m wired funny.\"\u003c/p\u003e\n\u003cp\u003eWe wandered into a security office and asked how to find Two-by-Two Productions. The guard pulled his eyes from his tiny TV and looked us up and down.\u003c/p\u003e\n\u003cp\u003e\"Are they casting again?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Thought they were moving out on Monday.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s still the plan,\" Jen said, nodding. \"But they said they wanted to see us right away.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" He reached for a stack of photocopied maps of the navy yard, scrawled a red X on the top one, and handed it over as his eyes drifted back toward the television.\u003c/p\u003e\n\u003cp\u003eOutside, Jen was incensed. \"Casting? I can\u0027t believe he thought we looked like actors.\" (Most Innovators don\u0027t like actors, who are, by definition, imitators.)\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Jen. You gave a pretty convincing performance in there.\"\u003c/p\u003e\n\u003cp\u003eShe glared at me.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" I added, \"they could be shooting an ad for the shoe.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027d be into that, I guess. But the thought that we came over from central casting...\" She shivered.\u003c/p\u003e\n\u003cp\u003eThe navy yard was almost empty on a Saturday, the open spaces dizzying after the narrow streets of Manhattan. We walked under giant arches of rusted metal speckled with flaking paint, crossed paved-over railroad tracks that raised long ripples in the asphalt. We wandered between ancient, empty factories and prefab metal hangars lined with the growling butts of air conditioners.\u003c/p\u003e\n\u003cp\u003e\"Here it is,\" I said.\u003c/p\u003e\n\u003cp\u003eThe name Two-by-Two Productions was stenciled on a huge sliding door set into an old brick building you could have hidden a battleship in.\u003c/p\u003e\n\u003cp\u003eI felt my nerves starting to tingle: this was the moment where Jen would take over, leading us through some roundabout, dangerous, and probably illegal means of entry.\u003c/p\u003e\n\u003cp\u003eBut there was no point resisting fate.\u003c/p\u003e\n\u003cp\u003e\"So how do we get in?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Maybe this way?\" Jen pulled at the huge handle of the door, and it slid open. \"Yeah, that worked.\"\u003c/p\u003e\n\u003cp\u003e\"But that means...\"\u003c/p\u003e\n\u003cp\u003eJen nodded and held up her Wi-Fi bracelet, which sparkled. She fingernailed a tiny switch to douse its light and whispered, \"It means that they\u0027re here, probably packing up for the move. Better be quiet.\"\u003c/p\u003e\n\u003cp\u003eInside, it was pitch black.\u003c/p\u003e\n\u003cp\u003eWe crept among formless shapes, engulfed in a lightless silence. Jen bumped into something that scraped angrily against the concrete floor. We both froze until the echo trailed away, suggesting a vast space around us.\u003c/p\u003e\n\u003cp\u003eAs my eyes grew accustomed to the darkness, the cluster of objects around me felt somehow familiar, as if I had visited this place before. I forced my eyes to resolve shapes from the darkness. We were passing through a small group of tables, a few overturned chairs resting on them.\u003c/p\u003e\n\u003cp\u003eI reached out and brought Jen to a halt with a tug.\u003c/p\u003e\n\u003cp\u003e\"What does this look like to you?\" I whispered.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. A closed restaurant?\"\u003c/p\u003e\n\u003cp\u003e\"Or a set that\u0027s supposed to look like a restaurant. Sort of like the one in the Poo-Sham ad.\" I ran my fingers across one of the chairs, trying to recall the advertisement. \"Where the guy orders lack of ram.\"\u003c/p\u003e\n\u003cp\u003eShe looked around. \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" I squinted into the darkness, letting shapes form before my eyes. \"Are those old theater seats over there?\u003c/p\u003e\n\u003cp\u003e\"Why would they be?\"\u003c/p\u003e\n\u003cp\u003e\"There was a scene in a theater. Where the usher gets all tongue-tied.\"\u003c/p\u003e\n\u003cp\u003e\"Why would they build a theater on a sound stage?\" Jen shook her head. \"We\u0027re in New York, land of theaters, and they couldn\u0027t go on location?\"\u003c/p\u003e\n\u003cp\u003e\"Huh.\" I crossed to the group of seats. It was only five or so rows, maybe ten seats across, with a red velvet curtain hanging as a backdrop. But Jen was right. It seemed like a crazy expense in a city full of real theaters, not to mention restaurants. \"Maybe they wanted a controlled situation. Absolute secrecy.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe they\u0027re just nuts,\" Jen said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one thing I\u0027m pretty sure - \"\u003c/p\u003e\n\u003cp\u003e\"Shhh. \"Jen stood stock-still in the darkness. She cocked her head and pointed to our left.\u003c/p\u003e\n\u003cp\u003eI heard a voice echoing across the cavernous space.\u003c/p\u003e\n\u003cp\u003e\"Is that who I think it is?\" Jen whispered.\u003c/p\u003e\n\u003cp\u003eI peered through the gloom toward the sound, listening intently. The barest sliver of light glimmered from the other side of the cavernous studio, a band of illumination creeping from under a door, wavering along its length as someone walked past on the other side. The voice continued, the words consumed by the distance but the strident tone utterly familiar.\u003c/p\u003e\n\u003cp\u003eIt was Mandy Jenkins, sounding very annoyed.\u003c/p\u003e\n\u003cp\u003eChapter 30\u003c/p\u003e\n\u003cp\u003eI LOWERED MY VOICE BELOW A WHISPER, JUST BREATH: \"KEEP QUIET.\"\u003c/p\u003e\n\u003cp\u003eAmong the shadowy, jumbled shapes, quiet meant slow. We moved like deep-sea divers, taking slow-motion steps, waving our hands in front of us in the darkness. As we grew nearer, eyes still adjusting, the glow from under the door seemed to grow brighter. The texture of the concrete floor became clearer, its pitted surface lit by the sidelong light like craters on the moon.\u003c/p\u003e\n\u003cp\u003eGradually I began to make out that there were other doors along this wall of the studio. Most were dark, but a few showed glints of light under them. More sounds came dully through the wall, grunts and scrapes, the movement of heavy objects across the rough floor. A few metal ladders disappeared up into darkness above us, where a catwalk wound its way around the outside of the studio, accessing a steel framework hung with movie lights and sound equipment.\u003c/p\u003e\n\u003cp\u003eThe door we\u0027d first spotted stood out, the light around its edges glowing fiercely, and I imagined a blinding interrogation lamp pointed at Mandy\u0027s face across a bare table.\u003c/p\u003e\n\u003cp\u003eA sentence formed out of the muffled hum of her voice. \"I think you\u0027ve got this all wrong!\"\u003c/p\u003e\n\u003cp\u003eThe reply was too quiet and steady for me make out any words, but it sounded coolly threatening.\u003c/p\u003e\n\u003cp\u003eThe scrape of a chair came from behind the door, then footsteps.\u003c/p\u003e\n\u003cp\u003eJen threw herself behind some huge piece of equipment, waving frantically for me to follow. The sliver of light grew darker as someone approached.\u003c/p\u003e\n\u003cp\u003eI took a few panicked, silent steps to join Jen, crouching beside her just as the door opened, spilling an arc of light across the huge studio. Cowboy boots and red-and-white client shoes swept across my view -\u0026nbsp;\u0026nbsp;NASCAR Man (also known as Futura Garamond) escorting Mandy across the gray concrete expanse.\u003c/p\u003e\n\u003cp\u003eDarkness wrapped itself around them as the door swung closed, but then illumination poured from overhead, a row of work lights popping on. Jen pulled me farther back behind our hulking piece of equipment just as Futura Garamond looked our way, his hand still on the switch.\u003c/p\u003e\n\u003cp\u003eI swallowed, pressed hard against Jen, my heart beating frantically. Had he heard my footsteps? Seen us?\u003c/p\u003e\n\u003cp\u003e\"Hello?\" he called.\u003c/p\u003e\n\u003cp\u003eWe stayed frozen until he shook his head and guided Mandy to another door a dozen yards away, pulling it open. She went in alone, and Garamond let it swing closed behind her with a click.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back,\" he said through the door, then turned and disappeared up one of the ladders, cowboy boots clanking on metal. Peering upward through the catwalk, we watched him clomp right over our heads. Then his footsteps faded.\u003c/p\u003e\n\u003cp\u003eJen and I stayed still for a moment, still clinging to each other. Was he still up there, looking down? Waiting for us to emerge? Or did the catwalk lead off into some other part of the building?\u003c/p\u003e\n\u003cp\u003eAfter long seconds of waiting Jen said, \"Come on.\"\u003c/p\u003e\n\u003cp\u003eWe crept toward the door through which Mandy had disappeared, me looking up at the dangling work lights. I felt naked in the light, but Garamond, wherever he was, might notice if they clicked off again.\u003c/p\u003e\n\u003cp\u003eWhen we got to the door, Jen reached out and softly grasped the knob, turning it as carefully as a safecracker.\u003c/p\u003e\n\u003cp\u003eShe shook her head. Locked.\u003c/p\u003e\n\u003cp\u003eI put my ear to the cold metal and heard nothing. This must be where they kept Mandy between interrogations. What were they trying to do? Learn the client\u0027s marketing secrets? Dig up dirt on their overseas operations? Find out more about me?\u003c/p\u003e\n\u003cp\u003eWhatever the anti-client wanted from Mandy, now was the time to rescue her. And quickly. Futura Garamond had said he was coming back.\u003c/p\u003e\n\u003cp\u003eJen mimed a knock on the door, a questioning look on her face.\u003c/p\u003e\n\u003cp\u003eI quickly shook my head. The last thing we needed was Mandy calling out, asking who we were. Her sharp voice was famous for its ability to get the attention of unruly focus groups.\u003c/p\u003e\n\u003cp\u003eI made a punching gesture at the door, and Jen nodded agreement. We were going to have to break it down.\u003c/p\u003e\n\u003cp\u003eUnfortunately, we hadn\u0027t remembered to bring a battering ram. The door looked formidable, its metal painted industrial gray. And once the first blow rang out, we were going to have company pretty soon. We would have to crash through, drag Mandy out, and make a run for the other end of the studio.\u003c/p\u003e\n\u003cp\u003eI looked around for something to hit the door with and spotted a fire extinguisher hanging in a corner.\u003c/p\u003e\n\u003cp\u003eJen stepped in front of me, shaking her head. She pointed back to where we\u0027d hidden.\u003c/p\u003e\n\u003cp\u003eIn the work lights I could clearly see the piece of equipment we had crouched behind. It was a camera dolly, a heavy, four-wheeled cart used for filming traveling shots. Attached to its front was a heavy, cranelike arm for holding the camera.\u003c/p\u003e\n\u003cp\u003eI smiled. We did have a battering ram.\u003c/p\u003e\n\u003cp\u003eWe stole quickly back to the dolly and gave it a tentative shove. It glided forward easily on rubber tires designed to provide the camera with a smooth, silent ride.\u003c/p\u003e\n\u003cp\u003eJen and I grinned at each other. Perfect.\u003c/p\u003e\n\u003cp\u003eWe lined it up with the door, aiming the camera crane dead center.\u003c/p\u003e\n\u003cp\u003e\"One... two... three...,\" Jen mouthed, and we leaned our weight against the dolly. Engineered to roll fast, it built speed quickly and quietly moved across the smooth floor.\u003c/p\u003e\n\u003cp\u003eAbout five seconds from collision the door opened.\u003c/p\u003e\n\u003cp\u003eMandy was standing there, a puzzled look on her face, the small room glaringly white behind her. I skidded to a halt, but our battering ram pulled itself from my grasp, rolling unstoppably ahead.\u003c/p\u003e\n\u003cp\u003e\"W-What the...,\" Mandy stammered as the dolly hurtled toward her; j then, at the last instant, she did the sensible thing and slammed the door shut.\u003c/p\u003e\n\u003cp\u003eThe dolly struck with a bright metal crunch, the sound of a car hitting a garbage can at full speed echoing through the vast space. The door crumpled inward, closing around the dolly\u0027s camera crane like a stomach around a fist.\u003c/p\u003e\n\u003cp\u003e\"Mandy!\" I cried, leaping forward.\u003c/p\u003e\n\u003cp\u003eJen and I pulled the dolly back frantically, and the door swung outward, then tumbled from its hinges, crashing to the floor.\u003c/p\u003e\n\u003cp\u003eMandy was standing inside the little room, looking down at us from her perch. I realized she\u0027d jumped up onto a toilet to escape the rampaging dolly - she was in a bathroom. The sounds of flushing noises came from the imperturbable plumbing.\u003c/p\u003e\n\u003cp\u003e\"Are you okay?\" I shouted.\u003c/p\u003e\n\u003cp\u003e\"Hunter? What the hell are you - ?\"\u003c/p\u003e\n\u003cp\u003e\"No time!\" I cried, and pulled her down. Jen was already headed back across the studio floor, out of the pool of work lights and into the darkness. I dragged a very stunned Mandy after me, bruising my shins against shadowy obstacles as we charged for the big sliding stage door.j\u003c/p\u003e\n\u003cp\u003eThe sounds of confusion came from behind me, doors swinging open and light spilling into the studio. If only we could make it back to the security guard at the front entrance or even out into the sunlight...\u003c/p\u003e\n\u003cp\u003e\"Hunter!\" Mandy screamed, a dead weight behind me.\u003c/p\u003e\n\u003cp\u003e\"Just run!\" I yelled, trying to yank her forward, but she planted her heels and pulled me to a stop.\u003c/p\u003e\n\u003cp\u003eI spun and faced her.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" she cried.\u003c/p\u003e\n\u003cp\u003e\"Rescuing you!\"\u003c/p\u003e\n\u003cp\u003eShe looked at me for an endless second, then sighed and shook her head. \"Oh, Hunter, you are so yesterday.\"\u003c/p\u003e\n\u003cp\u003eThen the world exploded, buzzing and powerful banks of film lights hitting us from every direction.\u003c/p\u003e\n\u003cp\u003e\"Oh, shit,\" I heard Jen say.\u003c/p\u003e\n\u003cp\u003eI covered my eyes against the blaze of color, completely blind. Footsteps and the sound of metal skate wheels closed around us.\u003c/p\u003e\n\u003cp\u003eOh, shit, was right. \u003c/p\u003e","sourceLink":"https://allnovel.net/so-yesterday/page-19.html","bookId":2699,"creation":"Oct 5, 2019 10:23:56 AM","modification":"Oct 5, 2019 10:23:56 AM"}
