{"id":106195,"no":7,"title":"Page 7","content":"\u003cp\u003e“Last chance,” she whispered, glancing up at the deck. Jack could not hear footsteps, but her dark eyes had gone wide, and her head was cocked to one side, listening to things he could not hear.\u003c/p\u003e\n\u003cp\u003e“You won’t give me away?” Jack asked. He breathed in deeply, and hers was the first clean scent since he’d boarded the Larsen. She was fresh air, cool and lightly perfumed like a spring day on Mount Diablo. Dangerous thoughts to be having about a woman who might be the captain’s beloved, if one such as Ghost was capable of love.\u003c/p\u003e\n\u003cp\u003eJack pushed past her in the narrow corridor, and for a moment they were both bathed in moonlight from the grille above. It surrounded them, blinding Jack to the shadows beyond, and it was just the two of them, so close that when she exhaled, he inhaled her breath and found it intoxicating.\u003c/p\u003e\n\u003cp\u003eThen, their first contact—she touched his hip and pushed him past her, surprisingly strong. She glanced at the ceiling again, turned from him, and walked along the gangway toward the small door through which he had originally entered the bowels of the ship.\u003c/p\u003e\n\u003cp\u003eWhispers rose from the hold, but Jack barely heard them.\u003c/p\u003e\n\u003cp\u003eSabine opened the small door and slipped through, then glanced back just as she slammed the door behind her, hard. He saw the first smile meant for him. And then footsteps were running above, coming to investigate the bang.\u003c/p\u003e\n\u003cp\u003eJack rushed in the opposite direction and slipped through the door where Sabine had entered and found himself in another gangway, with a steep staircase before him and a shadowy space beyond. He heard the sounds of sleeping men—snoring, groaning, the soft moans of unknown dreams—and he paused for a moment. She reads the sea, Louis had said. Ghost calls it finding order in chaos. She could find people and ships, predict where they would be at any given time.\u003c/p\u003e\n\u003cp\u003eHe wondered just what Sabine had come down here to find.\u003c/p\u003e\n\u003cp\u003eSomeone cried out in his sleep, in a language that Jack could not understand. He moved cautiously to the foot of the steep staircase. To venture fully into the forecastle would be to put himself in too much danger—Sabine had saved him once, and now he owed it to her to return to his small bunk in the galley.\u003c/p\u003e\n\u003cp\u003eHe’d found out enough for one night. And in truth, Sabine’s appearance had distracted him. He scratched a fingernail across a bulkhead, banged his head on the staircase’s underside. His stealth and sensitivity had been disturbed.\u003c/p\u003e\n\u003cp\u003eThe man cried out again, a despairing noise.\u003c/p\u003e\n\u003cp\u003e“He’s crying for home,” a voice said, and Jack gasped in shock.\u003c/p\u003e\n\u003cp\u003eGhost emerged from the shadows to Jack’s left, slipping through a doorway he had not even seen. He seemed to fill Jack’s whole field of vision, bordered by shadow as Sabine had been framed by moonlight.\u003c/p\u003e\n\u003cp\u003e“All of them do, on occasion,” the captain continued. “I come here and listen. Men might be hard, but they’re all babies when they sleep.”\u003c/p\u003e\n\u003cp\u003e“I…,” Jack began, but he had nothing to say. He didn’t want to offer an excuse for his nighttime excursion, or to beg.\u003c/p\u003e\n\u003cp\u003e“I thought I smelled you prowling,” Ghost said. He glanced behind Jack at the closed doorway to the hold. “Found ’em, then?”\u003c/p\u003e\n\u003cp\u003e“You must let them go.”\u003c/p\u003e\n\u003cp\u003e“Must?” Ghost’s single word made Jack feel like a child again.\u003c/p\u003e\n\u003cp\u003e“They’re not animals.”\u003c/p\u003e\n\u003cp\u003e“Not animals, no. Less important than that.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to give them something more than bread and water,” Jack said.\u003c/p\u003e\n\u003cp\u003eGhost pondered for a moment and then gave an uncaring shrug. “You can bring them scraps from the kitchen tomorrow, if it pleases you.”\u003c/p\u003e\n\u003cp\u003eJack nodded. Perhaps if he had time alone with the other prisoners, they could conceive some plan of escape.\u003c/p\u003e\n\u003cp\u003e“You’re not going to thank me?” Ghost asked curiously, studying Jack as he might some laboratory specimen.\u003c/p\u003e\n\u003cp\u003e“I’ll thank you quite effusively when you’ve put us all ashore, alive and well.”\u003c/p\u003e\n\u003cp\u003eGhost smiled thinly. “You’re brave, young Jack. I’ll give you that.”\u003c/p\u003e\n\u003cp\u003eThe menace in his tone, and the malicious implications of his words, were unmistakable.\u003c/p\u003e\n\u003cp\u003eWhat am I to do? Jack thought, panic descending. If it came to it, he would kill this man in order to survive. He had killed the Wendigo. Surely he could kill a pirate? Yet Ghost was more than just a pirate, that much was clear. And though the Wendigo had a savage, wild hunger and ferocity unlike anything Jack had ever encountered, the captain of the Larsen had all that and one thing more—cunning. Ghost exuded power and strength, and out here on the wild ocean, they were all alone.\u003c/p\u003e\n\u003cp\u003e“Come,” Ghost said. “It’s the last night we can talk for a while. And I have a question.” He climbed the staircase to the deck, not doubting for an instant that Jack would follow.\u003c/p\u003e\n\u003cp\u003eAnd Jack, confused and disturbed by the terrible man’s presence, could only climb up after him.\u003c/p\u003e\n\u003cp\u003eCHAPTER FOUR\u003c/p\u003e\n\u003cp\u003eNOBLEST OF ALL\u003c/p\u003e\n\u003cp\u003eThe moon was a sliver away from being full. Pale light washed over the Larsen’s deck, casting the ship in shades of silver. The night sky was clear, the stars infinite, lighting their way toward whatever fates and destinations awaited. The sails were full, and the vessel knifed through the Pacific as though it were some creature of myth, born to water instead of beaten together by the hands of men.\u003c/p\u003e\n\u003cp\u003e“Your anger fascinates me,” Ghost said, drawing on his pipe and letting out a plume of smoke.\u003c/p\u003e\n\u003cp\u003eJack’s heart slammed and his temples throbbed to its pulse. Ghost had known he was down in the hold, knew that he had discovered the other prisoners from the Umatilla, and yet he had issued no punishment. Beneath the captain’s calm veneer, his savagery waited, dormant, and might erupt at any moment. Jack had seen it happen. But Ghost kept trying to draw him in, urging him to speak his mind.\u003c/p\u003e\n\u003cp\u003eSo be it, Jack thought. He had wearied of watching his tongue.\u003c/p\u003e\n\u003cp\u003e“Is there some reason I should be anything but angry?” Jack asked.\u003c/p\u003e\n\u003cp\u003eGhost raised an eyebrow, clearly surprised and pleased that Jack had engaged him at last. He pressed the pipe stem between his lips, tobacco flaring orange in the night, and let the smoke curl slowly from his nostrils. Jack could not help but see Satan in this devil’s face.\u003c/p\u003e\n\u003cp\u003eCareful, he thought. You’re sparring with Lucifer.\u003c/p\u003e\n\u003cp\u003e“You believe you have some right to be treated as more than an animal—”\u003c/p\u003e\n\u003cp\u003e“I am more than an animal,” Jack said.\u003c/p\u003e\n\u003cp\u003e“You have been raised to believe in a morality that is a construct of those who wish to control the bestial nature of mankind, in order to protect themselves and what they own,” the captain said. “In your life, young Jack, you will encounter two sorts of people: those who are stronger than you, and those who are weaker. And I do not mean only physical strength and weakness. I am stronger, and if there is something you possess, why should I not take it from you?”\u003c/p\u003e\n\u003cp\u003eJack looked him full in the face for the first time, meeting him eye to eye. “Taking what does not belong to you is stealing. If you want something, you ought to earn it for yourself. The effort makes the reward much sweeter, and you will have accomplished something, instead of simply appropriating the accomplishments of others.”\u003c/p\u003e\n\u003cp\u003e“I should not steal from you because it is ‘wrong’?” Ghost chuckled. “Surely you can do better than that.”\u003c/p\u003e\n\u003cp\u003eBut Jack found that he could not, and it troubled him.\u003c/p\u003e\n\u003cp\u003e“If I am stronger,” Ghost continued, “and I take what you have earned, then have I not also earned it, but in my own fashion? We’re animals, young Jack. The strong eat the weak. It has always been that way, and always shall be.”\u003c/p\u003e\n\u003cp\u003e“But you kill,” Jack said.\u003c/p\u003e\n\u003cp\u003eGhost considered this for a moment, the word hanging in the night air around them as he drew on the pipe again. Then he nodded.\u003c/p\u003e\n\u003cp\u003e“Killing is expedient. Sometimes it’s necessary. I have never taken a life purely for amusement’s sake, but murder is a tool.”\u003c/p\u003e\n\u003cp\u003e“How can you be so cold-blooded?” Jack asked, his voice rising.\u003c/p\u003e\n\u003cp\u003eGhost bristled and glanced around. Apparently it was one thing for Jack to challenge his philosophy privately, but quite another to do so within the crew’s earshot. The two Scandinavian sailors were close by, one at the wheel and the other in the crow’s nest. They seemed always to be near when Ghost walked the deck. The captain spoke softly, keeping their conversation private—perhaps so that the crew would not overhear his opinions challenged—but the presence of the bearded, blond twins did not seem to trouble him, reinforcing Jack’s suspicion that they spoke no English.\u003c/p\u003e\n\u003cp\u003e“Your precious humanity is an illusion, boy,” Ghost growled. “Human nature is animal nature. The rest is nothing but putting on airs, feigning a tenderness that is little more than a mask. You would kill if circumstances forced your hand. You would steal if your belly gnawed at you long enough.”\u003c/p\u003e\n\u003cp\u003eJack glanced away, but too late to prevent Ghost from seeing the flicker of recognition in his eyes.\u003c/p\u003e\n\u003cp\u003eThe captain laughed softly, almost a snarl. “Ah, well, that’s just delicious. You’re a thief yourself.”\u003c/p\u003e\n\u003cp\u003e“Not by choice—”\u003c/p\u003e\n\u003cp\u003eGhost gripped his arm, forced Jack to meet his gaze again. “It’s all choice, Jack. Embrace the wildness inside you, or attempt to deny it.”\u003c/p\u003e\n\u003cp\u003e“I have seen something of the wild,” Jack said. “More than you can know. I’ve fought for my life against a thing more monster than beast, and its blood stains my hands. I found the wild thing inside myself and embraced it. Mastered it.”\u003c/p\u003e\n\u003cp\u003eGhost regarded him anew, cocking his head to one side before nodding slowly.\u003c/p\u003e\n\u003cp\u003e“I knew I saw something in you,” the captain said. He tapped the pipe out on the railing, and the ash was carried away on the wind. “But you say you’ve ‘mastered’ it? Impossible. You may have caged it, but that doesn’t make you its master. There’s only one way to make peace with your animal nature, and that’s to surrender to it.”\u003c/p\u003e\n\u003cp\u003eJack’s earlier observation that Ghost was Lucifer now seemed so apt that he almost spoke it aloud. Lucifer’s curse was that he thought more than the other angels and did not understand the way in which heaven had defined morality. He’d had differing views and refused to bow to the beliefs of others.\u003c/p\u003e\n\u003cp\u003e“Have you read Aristotle, Captain?” Jack asked.\u003c/p\u003e\n\u003cp\u003e“Would it surprise you to learn that I have?”\u003c/p\u003e\n\u003cp\u003e“It would not,” Jack replied. And now he realized for sure that this was why Ghost had kept him alive. Not as crew. Not as cook. The captain lorded over the demons of his hell ship, but they were minions, far beneath him in every way.\u003c/p\u003e\n\u003cp\u003eHe had kept Jack because he desired such conversation; he wanted someone to challenge his philosophy that humans were savage by nature. Jack wondered who, precisely, the captain was attempting to persuade—his prisoner or himself.\u003c/p\u003e\n\u003cp\u003e“Go on,” Ghost urged.\u003c/p\u003e\n\u003cp\u003e“The great philosopher wrote that ‘at his best, man is the noblest of all animals; separated from law and justice he is the worst.’”\u003c/p\u003e\n\u003cp\u003eGhost smiled, a cruel glint in his eyes. He prodded Jack with a finger.\u003c/p\u003e\n\u003cp\u003e“So you admit that you’re an animal,” the captain said.\u003c/p\u003e\n\u003cp\u003e“You mistake my meaning—”\u003c/p\u003e\n\u003cp\u003e“I understand your meaning perfectly,” Ghost interrupted. “You insist on confining your nature with concepts of justice and civility.”\u003c/p\u003e\n\u003cp\u003e“Both of which are necessary for the survival of the species.”\u003c/p\u003e\n\u003cp\u003eGhost snorted. “What of Darwin’s concept of ‘survival of the fittest’?”\u003c/p\u003e\n\u003cp\u003eJack knew then that the conversation could never end. It was a circle of dueling philosophies, and perhaps Ghost enjoyed the debate so much that he would never allow it to end.\u003c/p\u003e\n\u003cp\u003e“Stripped of conscience, ‘survival of the fittest’ will make any man a monster.”\u003c/p\u003e\n\u003cp\u003e“Ah, now we get down to the crux of the matter,” Ghost said, savoring the argument. “Am I a monster? Or am I simply an animal? Let me ask you, Jack, what separates man from the animals?”\u003c/p\u003e\n\u003cp\u003e“The ability to reason,” Jack said instantly. “Self-awareness. Faith.”\u003c/p\u003e\n\u003cp\u003e“Faith,” Ghost snarled, dismissing the concept with a shake of his head. He held up his hands and waggled his thumbs. “What of these, Jack? Are these what separate us from animals? They make us far more efficient killers, for sure. But apes have them.” He touched his fingers to his lips. “And what of this? The complexity of language? Though perhaps all we need to know we can learn from one another without words. No. We deceive ourselves with the idea that we are anything but beasts.”\u003c/p\u003e\n\u003cp\u003eA lull in the wind caused the sails to sag. The guylines swayed and the blocks clanked, and Ghost stepped away from the railing and barked orders. The Scandinavians moved to obey, even as Maurilio and Tree appeared nearby to lend a hand. Jack studied them, and for the first time he noticed how edgy and skittish they seemed, like dogs sensing an oncoming storm.\u003c/p\u003e\n\u003cp\u003eWhat do they know that I don’t? he wondered.\u003c/p\u003e\n\u003cp\u003e“You’d best go below and get some sleep, young Jack,” Ghost said. “You’ve only a few hours before you need to begin preparing breakfast. And you don’t want to see this crew if they’re not fed properly. They’re absolutely ravenous.”\u003c/p\u003e\n\u003cp\u003eThe captain’s eyes lit up with some private amusement and he turned away, watching his crew at work. Jack had given him the intellectual stimulation he wanted, and now he was dismissed. It was frustrating—he’d wanted to reason with Ghost to put the Umatilla prisoners ashore the next time the ship made port, him included. But the opportunity had not arisen. Ghost’s philosophy made clear that no logic would convince him to release them unless there was some benefit to himself. Jack had to figure out a way to persuade Ghost that it was in his best interests to set them free.\u003c/p\u003e\n\u003cp\u003eHe was beginning to think that escape would never be easy. For now, he needed rest. There’s time yet, he thought. Days, at least, before we make port anywhere.\u003c/p\u003e\n\u003cp\u003eHe would think of something.\u003c/p\u003e\n\u003cp\u003eThe fight broke out shortly after breakfast. The whole crew saw it start—heard shouting as the fat Demetrius dressed someone down for his sloppy reefing of the mizzen sail—and coming up from the galley, Jack turned aft to see what it was about. The sight of Finn brought him up short, and he stared in astonishment at the man. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sea-wolves-the-secret-journeys-of-jack-london-2/page-7.html","bookId":1538,"creation":"Oct 5, 2019 10:54:50 PM","modification":"Oct 5, 2019 10:54:50 PM"}
