{"id":44676,"no":10,"title":"Exact date unknown","content":"Towards the end of\n\u003cbr\u003e the Christmas vacation.\n\u003cbr\u003e Exact date unknown\n\u003cbr\u003e \n\u003cbr\u003e Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e Is it snowing where you are? All the world that I see from my tower\n\u003cbr\u003e is draped in white and the flakes are coming down as big as pop-corns.\n\u003cbr\u003e It\u0027s late afternoon--the sun is just setting (a cold yellow colour)\n\u003cbr\u003e behind some colder violet hills, and I am up in my window seat\n\u003cbr\u003e using the last light to write to you.\n\u003cbr\u003e \n\u003cbr\u003e Your five gold pieces were a surprise! I\u0027m not used to receiving\n\u003cbr\u003e Christmas presents. You have already given me such lots of things--\n\u003cbr\u003e everything I have, you know--that I don\u0027t quite feel that I\n\u003cbr\u003e deserve extras. But I like them just the same. Do you want to know\n\u003cbr\u003e what I bought with my money?\n\u003cbr\u003e \n\u003cbr\u003e I. A silver watch in a leather case to wear on my wrist and get me\n\u003cbr\u003e to recitations in time.\n\u003cbr\u003e \n\u003cbr\u003e II. Matthew Arnold\u0027s poems.\n\u003cbr\u003e \n\u003cbr\u003e III. A hot water bottle.\n\u003cbr\u003e \n\u003cbr\u003e IV. A steamer rug. (My tower is cold.)\n\u003cbr\u003e \n\u003cbr\u003e V. Five hundred sheets of yellow manuscript paper. (I\u0027m going\n\u003cbr\u003e to commence being an author pretty soon.)\n\u003cbr\u003e \n\u003cbr\u003e VI. A dictionary of synonyms. (To enlarge the author\u0027s vocabulary.)\n\u003cbr\u003e \n\u003cbr\u003e VII. (I don\u0027t much like to confess this last item, but I will.)\n\u003cbr\u003e A pair of silk stockings.\n\u003cbr\u003e \n\u003cbr\u003e And now, Daddy, never say I don\u0027t tell all!\n\u003cbr\u003e \n\u003cbr\u003e It was a very low motive, if you must know it, that prompted the\n\u003cbr\u003e silk stockings. Julia Pendleton comes into my room to do geometry,\n\u003cbr\u003e and she sits cross-legged on the couch and wears silk stockings\n\u003cbr\u003e every night. But just wait--as soon as she gets back from vacation\n\u003cbr\u003e I shall go in and sit on her couch in my silk stockings. You see,\n\u003cbr\u003e Daddy, the miserable creature that I am but at least I\u0027m honest;\n\u003cbr\u003e and you knew already, from my asylum record, that I wasn\u0027t perfect,\n\u003cbr\u003e didn\u0027t you?\n\u003cbr\u003e \n\u003cbr\u003e To recapitulate (that\u0027s the way the English instructor begins every\n\u003cbr\u003e other sentence), I am very much obliged for my seven presents. \n\u003cbr\u003e I\u0027m pretending to myself that they came in a box from my family\n\u003cbr\u003e in California. The watch is from father, the rug from mother,\n\u003cbr\u003e the hot water bottle from grandmother who is always worrying for fear\n\u003cbr\u003e I shall catch cold in this climate--and the yellow paper from my\n\u003cbr\u003e little brother Harry. My sister Isabel gave me the silk stockings,\n\u003cbr\u003e and Aunt Susan the Matthew Arnold poems; Uncle Harry (little Harry is\n\u003cbr\u003e named after him) gave me the dictionary. He wanted to send chocolates,\n\u003cbr\u003e but I insisted on synonyms.\n\u003cbr\u003e \n\u003cbr\u003e You don\u0027t object, do you, to playing the part of a composite family?\n\u003cbr\u003e \n\u003cbr\u003e And now, shall I tell you about my vacation, or are you only interested\n\u003cbr\u003e in my education as such? I hope you appreciate the delicate shade\n\u003cbr\u003e of meaning in `as such\u0027. It is the latest addition to my vocabulary.\n\u003cbr\u003e \n\u003cbr\u003e The girl from Texas is named Leonora Fenton. (Almost as funny\n\u003cbr\u003e as Jerusha, isn\u0027t it?) I like her, but not so much as Sallie McBride;\n\u003cbr\u003e I shall never like any one so much as Sallie--except you. I must\n\u003cbr\u003e always like you the best of all, because you\u0027re my whole family\n\u003cbr\u003e rolled into one. Leonora and I and two Sophomores have walked \u0027cross\n\u003cbr\u003e country every pleasant day and explored the whole neighbourhood,\n\u003cbr\u003e dressed in short skirts and knit jackets and caps, and carrying shiny\n\u003cbr\u003e sticks to whack things with. Once we walked into town--four miles--\n\u003cbr\u003e and stopped at a restaurant where the college girls go for dinner. \n\u003cbr\u003e Broiled lobster (35 cents), and for dessert, buckwheat cakes and maple\n\u003cbr\u003e syrup (15 cents). Nourishing and cheap.\n\u003cbr\u003e \n\u003cbr\u003e It was such a lark! Especially for me, because it was so awfully\n\u003cbr\u003e different from the asylum--I feel like an escaped convict every\n\u003cbr\u003e time I leave the campus. Before I thought, I started to tell\n\u003cbr\u003e the others what an experience I was having. The cat was almost\n\u003cbr\u003e out of the bag when I grabbed it by its tail and pulled it back. \n\u003cbr\u003e It\u0027s awfully hard for me not to tell everything I know. I\u0027m a very\n\u003cbr\u003e confiding soul by nature; if I didn\u0027t have you to tell things to,\n\u003cbr\u003e I\u0027d burst.\n\u003cbr\u003e \n\u003cbr\u003e We had a molasses candy pull last Friday evening, given by the\n\u003cbr\u003e house matron of Fergussen to the left-behinds in the other halls. \n\u003cbr\u003e There were twenty-two of us altogether, Freshmen and Sophomores and\n\u003cbr\u003e juniors and Seniors all united in amicable accord. The kitchen is huge,\n\u003cbr\u003e with copper pots and kettles hanging in rows on the stone wall--\n\u003cbr\u003e the littlest casserole among them about the size of a wash boiler. \n\u003cbr\u003e Four hundred girls live in Fergussen. The chef, in a white cap\n\u003cbr\u003e and apron, fetched out twenty-two other white caps and aprons--\n\u003cbr\u003e I can\u0027t imagine where he got so many--and we all turned ourselves\n\u003cbr\u003e into cooks.\n\u003cbr\u003e \n\u003cbr\u003e It was great fun, though I have seen better candy. When it was\n\u003cbr\u003e finally finished, and ourselves and the kitchen and the door-knobs\n\u003cbr\u003e all thoroughly sticky, we organized a procession and still in our\n\u003cbr\u003e caps and aprons, each carrying a big fork or spoon or frying pan,\n\u003cbr\u003e we marched through the empty corridors to the officers\u0027 parlour,\n\u003cbr\u003e where half-a-dozen professors and instructors were passing\n\u003cbr\u003e a tranquil evening. We serenaded them with college songs and\n\u003cbr\u003e offered refreshments. They accepted politely but dubiously. \n\u003cbr\u003e We left them sucking chunks of molasses candy, sticky and speechless.\n\u003cbr\u003e \n\u003cbr\u003e So you see, Daddy, my education progresses!\n\u003cbr\u003e \n\u003cbr\u003e Don\u0027t you really think that I ought to be an artist instead\n\u003cbr\u003e of an author?\n\u003cbr\u003e \n\u003cbr\u003e Vacation will be over in two days and I shall be glad to see the\n\u003cbr\u003e girls again. My tower is just a trifle lonely; when nine people occupy\n\u003cbr\u003e a house that was built for four hundred, they do rattle around a bit.\n\u003cbr\u003e \n\u003cbr\u003e Eleven pages--poor Daddy, you must be tired! I meant this to be\n\u003cbr\u003e just a short little thank-you note--but when I get started I seem\n\u003cbr\u003e to have a ready pen.\n\u003cbr\u003e \n\u003cbr\u003e Goodbye, and thank you for thinking of me--I should be perfectly\n\u003cbr\u003e happy except for one little threatening cloud on the horizon. \n\u003cbr\u003e Examinations come in February.\n\u003cbr\u003e Yours with love,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e PS. Maybe it isn\u0027t proper to send love? If it isn\u0027t, please excuse. \n\u003cbr\u003e But I must love somebody and there\u0027s only you and Mrs. Lippett\n\u003cbr\u003e to choose between, so you see--you\u0027ll HAVE to put up with it,\n\u003cbr\u003e Daddy dear, because I can\u0027t love her.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59732.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
