{"id":44679,"no":13,"title":"Chapter","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e This is an extra letter in the middle of the month because I\u0027m\n\u003cbr\u003e rather lonely tonight. It\u0027s awfully stormy. All the lights are\n\u003cbr\u003e out on the campus, but I drank black coffee and I can\u0027t go to sleep.\n\u003cbr\u003e \n\u003cbr\u003e I had a supper party this evening consisting of Sallie and Julia\n\u003cbr\u003e and Leonora Fenton--and sardines and toasted muffins and salad\n\u003cbr\u003e and fudge and coffee. Julia said she\u0027d had a good time, but Sallie\n\u003cbr\u003e stayed to help wash the dishes.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e I might, very usefully, put some time on Latin tonight but,\n\u003cbr\u003e there\u0027s no doubt about it, I\u0027m a very languid Latin scholar. \n\u003cbr\u003e We\u0027ve finished Livy and De Senectute and are now engaged with De\n\u003cbr\u003e Amicitia (pronounced Damn Icitia).\n\u003cbr\u003e \n\u003cbr\u003e Should you mind, just for a little while, pretending you are\n\u003cbr\u003e my grandmother? Sallie has one and Julia and Leonora each two,\n\u003cbr\u003e and they were all comparing them tonight. I can\u0027t think of\n\u003cbr\u003e anything I\u0027d rather have; it\u0027s such a respectable relationship. \n\u003cbr\u003e So, if you really don\u0027t object--When I went into town yesterday,\n\u003cbr\u003e I saw the sweetest cap of Cluny lace trimmed with lavender ribbon. \n\u003cbr\u003e I am going to make you a present of it on your eighty-third birthday.\n\u003cbr\u003e \n\u003cbr\u003e ! ! ! ! ! ! ! ! ! ! ! !\n\u003cbr\u003e \n\u003cbr\u003e That\u0027s the clock in the chapel tower striking twelve. I believe\n\u003cbr\u003e I am sleepy after all.\n\u003cbr\u003e Good night, Granny.\n\u003cbr\u003e I love you dearly.\n\u003cbr\u003e Judy\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59735.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
