{"id":44698,"no":32,"title":"4th February","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e Jimmie McBride has sent me a Princeton banner as big as one end\n\u003cbr\u003e of the room; I am very grateful to him for remembering me, but I\n\u003cbr\u003e don\u0027t know what on earth to do with it. Sallie and Julia won\u0027t\n\u003cbr\u003e let me hang it up; our room this year is furnished in red, and you\n\u003cbr\u003e can imagine what an effect we\u0027d have if I added orange and black. \n\u003cbr\u003e But it\u0027s such nice, warm, thick felt, I hate to waste it. \n\u003cbr\u003e Would it be very improper to have it made into a bath robe? \n\u003cbr\u003e My old one shrank when it was washed.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027ve entirely omitted of late telling you what I am learning,\n\u003cbr\u003e but though you might not imagine it from my letters, my time is\n\u003cbr\u003e exclusively occupied with study. It\u0027s a very bewildering matter\n\u003cbr\u003e to get educated in five branches at once.\n\u003cbr\u003e \n\u003cbr\u003e `The test of true scholarship,\u0027 says Chemistry Professor,\n\u003cbr\u003e `is a painstaking passion for detail.\u0027\n\u003cbr\u003e \n\u003cbr\u003e `Be careful not to keep your eyes glued to detail,\u0027 says History\n\u003cbr\u003e Professor. `Stand far enough away to get a perspective of the whole.\u0027\n\u003cbr\u003e \n\u003cbr\u003e You can see with what nicety we have to trim our sails between\n\u003cbr\u003e chemistry and history. I like the historical method best. \n\u003cbr\u003e If I say that William the Conqueror came over in 1492, and Columbus\n\u003cbr\u003e discovered America in 1100 or 1066 or whenever it was, that\u0027s a mere\n\u003cbr\u003e detail that the Professor overlooks. It gives a feeling of security\n\u003cbr\u003e and restfulness to the history recitation, that is entirely lacking\n\u003cbr\u003e in chemistry.\n\u003cbr\u003e \n\u003cbr\u003e Sixth-hour bell--I must go to the laboratory and look into a little\n\u003cbr\u003e matter of acids and salts and alkalis. I\u0027ve burned a hole as big\n\u003cbr\u003e as a plate in the front of my chemistry apron, with hydrochloric acid. \n\u003cbr\u003e If the theory worked, I ought to be able to neutralize that hole\n\u003cbr\u003e with good strong ammonia, oughtn\u0027t I?\n\u003cbr\u003e \n\u003cbr\u003e Examinations next week, but who\u0027s afraid?\n\u003cbr\u003e Yours ever,\n\u003cbr\u003e Judy\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59754.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
