{"id":44703,"no":37,"title":"11th April","content":"Dearest Daddy,\n\u003cbr\u003e \n\u003cbr\u003e Will you please forgive me for the letter I wrote you yesterday? \n\u003cbr\u003e After I posted it I was sorry, and tried to get it back, but that\n\u003cbr\u003e beastly mail clerk wouldn\u0027t give it back to me.\n\u003cbr\u003e \n\u003cbr\u003e It\u0027s the middle of the night now; I\u0027ve been awake for hours\n\u003cbr\u003e thinking what a Worm I am--what a Thousand-legged Worm--\n\u003cbr\u003e and that\u0027s the worst I can say! I\u0027ve closed the door very softly\n\u003cbr\u003e into the study so as not to wake Julia and Sallie, and am sitting\n\u003cbr\u003e up in bed writing to you on paper torn out of my history note-book.\n\u003cbr\u003e \n\u003cbr\u003e I just wanted to tell you that I am sorry I was so impolite\n\u003cbr\u003e about your cheque. I know you meant it kindly, and I think you\u0027re\n\u003cbr\u003e an old dear to take so much trouble for such a silly thing as a hat. \n\u003cbr\u003e I ought to have returned it very much more graciously.\n\u003cbr\u003e \n\u003cbr\u003e But in any case, I had to return it. It\u0027s different with me than\n\u003cbr\u003e with other girls. They can take things naturally from people. \n\u003cbr\u003e They have fathers and brothers and aunts and uncles; but I can\u0027t\n\u003cbr\u003e be on any such relations with any one. I like to pretend that you\n\u003cbr\u003e belong to me, just to play with the idea, but of course I know you\n\u003cbr\u003e don\u0027t. I\u0027m alone, really--with my back to the wall fighting the world--\n\u003cbr\u003e and I get sort of gaspy when I think about it. I put it out of my mind,\n\u003cbr\u003e and keep on pretending; but don\u0027t you see, Daddy? I can\u0027t accept\n\u003cbr\u003e any more money than I have to, because some day I shall be wanting\n\u003cbr\u003e to pay it back, and even as great an author as I intend to be won\u0027t\n\u003cbr\u003e be able to face a PERFECTLY TREMENDOUS debt.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027d love pretty hats and things, but I mustn\u0027t mortgage the future\n\u003cbr\u003e to pay for them.\n\u003cbr\u003e \n\u003cbr\u003e You\u0027ll forgive me, won\u0027t you, for being so rude? I have an awful\n\u003cbr\u003e habit of writing impulsively when I first think things, and then\n\u003cbr\u003e posting the letter beyond recall. But if I sometimes seem thoughtless\n\u003cbr\u003e and ungrateful, I never mean it. In my heart I thank you always\n\u003cbr\u003e for the life and freedom and independence that you have given me. \n\u003cbr\u003e My childhood was just a long, sullen stretch of revolt, and now I am\n\u003cbr\u003e so happy every moment of the day that I can\u0027t believe it\u0027s true. \n\u003cbr\u003e I feel like a made-up heroine in a story-book.\n\u003cbr\u003e \n\u003cbr\u003e It\u0027s a quarter past two. I\u0027m going to tiptoe out to post this\n\u003cbr\u003e off now. You\u0027ll receive it in the next mail after the other;\n\u003cbr\u003e so you won\u0027t have a very long time to think bad of me.\n\u003cbr\u003e Good night, Daddy,\n\u003cbr\u003e I love you always,\n\u003cbr\u003e Judy\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59759.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
