{"id":44711,"no":45,"title":"10th September","content":"Dear Daddy,\n\u003cbr\u003e \n\u003cbr\u003e He has gone, and we are missing him! When you get accustomed to\n\u003cbr\u003e people or places or ways of living, and then have them snatched away,\n\u003cbr\u003e it does leave an awfully empty, gnawing sort of sensation. \n\u003cbr\u003e I\u0027m finding Mrs. Semple\u0027s conversation pretty unseasoned food.\n\u003cbr\u003e \n\u003cbr\u003e College opens in two weeks and I shall be glad to begin work again. \n\u003cbr\u003e I have worked quite a lot this summer though--six short stories and\n\u003cbr\u003e seven poems. Those I sent to the magazines all came back with the\n\u003cbr\u003e most courteous promptitude. But I don\u0027t mind. It\u0027s good practice. \n\u003cbr\u003e Master Jervie read them--he brought in the post, so I couldn\u0027t\n\u003cbr\u003e help his knowing--and he said they were DREADFUL. They showed\n\u003cbr\u003e that I didn\u0027t have the slightest idea of what I was talking about. \n\u003cbr\u003e (Master Jervie doesn\u0027t let politeness interfere with truth.)\n\u003cbr\u003e But the last one I did--just a little sketch laid in college--\n\u003cbr\u003e he said wasn\u0027t bad; and he had it typewritten, and I sent it\n\u003cbr\u003e to a magazine. They\u0027ve had it two weeks; maybe they\u0027re thinking\n\u003cbr\u003e it over.\n\u003cbr\u003e \n\u003cbr\u003e You should see the sky! There\u0027s the queerest orange-coloured light\n\u003cbr\u003e over everything. We\u0027re going to have a storm.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e It commenced just that moment with tremendously big drops and all\n\u003cbr\u003e the shutters banging. I had to run to close the windows, while Carrie\n\u003cbr\u003e flew to the attic with an armful of milk pans to put under the places\n\u003cbr\u003e where the roof leaks and then, just as I was resuming my pen,\n\u003cbr\u003e I remembered that I\u0027d left a cushion and rug and hat and Matthew\n\u003cbr\u003e Arnold\u0027s poems under a tree in the orchard, so I dashed out to get them,\n\u003cbr\u003e all quite soaked. The red cover of the poems had run into the inside;\n\u003cbr\u003e Dover Beach in the future will be washed by pink waves.\n\u003cbr\u003e \n\u003cbr\u003e A storm is awfully disturbing in the country. You are always having\n\u003cbr\u003e to think of so many things that are out of doors and getting spoiled.\n\u003cbr\u003e \n\u003cbr\u003e Thursday\n\u003cbr\u003e \n\u003cbr\u003e Daddy! Daddy! What do you think? The postman has just come\n\u003cbr\u003e with two letters.\n\u003cbr\u003e \n\u003cbr\u003e 1st. My story is accepted. $50.\n\u003cbr\u003e \n\u003cbr\u003e ALORS! I\u0027m an AUTHOR.\n\u003cbr\u003e \n\u003cbr\u003e 2nd. A letter from the college secretary. I\u0027m to have a scholarship\n\u003cbr\u003e for two years that will cover board and tuition. It was founded\n\u003cbr\u003e for `marked proficiency in English with general excellency in\n\u003cbr\u003e other lines.\u0027 And I\u0027ve won it! I applied for it before I left,\n\u003cbr\u003e but I didn\u0027t have an idea I\u0027d get it, on account of my Freshman\n\u003cbr\u003e bad work in maths and Latin. But it seems I\u0027ve made it up. I am\n\u003cbr\u003e awfully glad, Daddy, because now I won\u0027t be such a burden to you. \n\u003cbr\u003e The monthly allowance will be all I\u0027ll need, and maybe I can earn\n\u003cbr\u003e that with writing or tutoring or something.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027m LONGING to go back and begin work.\n\u003cbr\u003e Yours ever,\n\u003cbr\u003e Jerusha Abbott,\n\u003cbr\u003e \n\u003cbr\u003e Author of When the Sophomores Won\n\u003cbr\u003e the Game. For sale at all news\n\u003cbr\u003e stands, price ten cents.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59767.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
