{"id":44712,"no":46,"title":"26th September","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e Back at college again and an upper classman. Our study is better\n\u003cbr\u003e than ever this year--faces the South with two huge windows and oh!\n\u003cbr\u003e so furnished. Julia, with an unlimited allowance, arrived two days\n\u003cbr\u003e early and was attacked with a fever for settling.\n\u003cbr\u003e \n\u003cbr\u003e We have new wall paper and oriental rugs and mahogany chairs--\n\u003cbr\u003e not painted mahogany which made us sufficiently happy last year,\n\u003cbr\u003e but real. It\u0027s very gorgeous, but I don\u0027t feel as though I belonged\n\u003cbr\u003e in it; I\u0027m nervous all the time for fear I\u0027ll get an ink spot in the\n\u003cbr\u003e wrong place.\n\u003cbr\u003e \n\u003cbr\u003e And, Daddy, I found your letter waiting for me--pardon--I mean\n\u003cbr\u003e your secretary\u0027s.\n\u003cbr\u003e \n\u003cbr\u003e Will you kindly convey to me a comprehensible reason why I should\n\u003cbr\u003e not accept that scholarship? I don\u0027t understand your objection\n\u003cbr\u003e in the least. But anyway, it won\u0027t do the slightest good for you\n\u003cbr\u003e to object, for I\u0027ve already accepted it and I am not going to change! \n\u003cbr\u003e That sounds a little impertinent, but I don\u0027t mean it so.\n\u003cbr\u003e \n\u003cbr\u003e I suppose you feel that when you set out to educate me, you\u0027d like to\n\u003cbr\u003e finish the work, and put a neat period, in the shape of a diploma,\n\u003cbr\u003e at the end.\n\u003cbr\u003e \n\u003cbr\u003e But look at it just a second from my point of view. I shall owe my\n\u003cbr\u003e education to you just as much as though I let you pay for the whole of it,\n\u003cbr\u003e but I won\u0027t be quite so much indebted. I know that you don\u0027t want me\n\u003cbr\u003e to return the money, but nevertheless, I am going to want to do it,\n\u003cbr\u003e if I possibly can; and winning this scholarship makes it so much easier. \n\u003cbr\u003e I was expecting to spend the rest of my life in paying my debts,\n\u003cbr\u003e but now I shall only have to spend one-half of the rest of it.\n\u003cbr\u003e \n\u003cbr\u003e I hope you understand my position and won\u0027t be cross. The allowance\n\u003cbr\u003e I shall still most gratefully accept. It requires an allowance\n\u003cbr\u003e to live up to Julia and her furniture! I wish that she had been\n\u003cbr\u003e reared to simpler tastes, or else that she were not my room-mate.\n\u003cbr\u003e \n\u003cbr\u003e This isn\u0027t much of a letter; I meant to have written a lot--but I\u0027ve\n\u003cbr\u003e been hemming four window curtains and three portieres (I\u0027m glad you\n\u003cbr\u003e can\u0027t see the length of the stitches), and polishing a brass desk\n\u003cbr\u003e set with tooth powder (very uphill work), and sawing off picture\n\u003cbr\u003e wire with manicure scissors, and unpacking four boxes of books,\n\u003cbr\u003e and putting away two trunkfuls of clothes (it doesn\u0027t seem believable\n\u003cbr\u003e that Jerusha Abbott owns two trunks full of clothes, but she does!)\n\u003cbr\u003e and welcoming back fifty dear friends in between.\n\u003cbr\u003e \n\u003cbr\u003e Opening day is a joyous occasion!\n\u003cbr\u003e \n\u003cbr\u003e Good night, Daddy dear, and don\u0027t be annoyed because your\n\u003cbr\u003e chick is wanting to scratch for herself. She\u0027s growing up\n\u003cbr\u003e into an awfully energetic little hen--with a very determined\n\u003cbr\u003e cluck and lots of beautiful feathers (all due to you).\n\u003cbr\u003e Affectionately,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59768.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
