{"id":44713,"no":47,"title":"30th September","content":"Dear Daddy,\n\u003cbr\u003e \n\u003cbr\u003e Are you still harping on that scholarship? I never knew a man\n\u003cbr\u003e so obstinate, and stubborn and unreasonable, and tenacious,\n\u003cbr\u003e and bull-doggish, and unable-to-see-other-people\u0027s-point-of-view,\n\u003cbr\u003e as you.\n\u003cbr\u003e \n\u003cbr\u003e You prefer that I should not be accepting favours from strangers.\n\u003cbr\u003e \n\u003cbr\u003e Strangers!--And what are you, pray?\n\u003cbr\u003e \n\u003cbr\u003e Is there anyone in the world that I know less? I shouldn\u0027t recognize\n\u003cbr\u003e you if I met you in the street. Now, you see, if you had been a sane,\n\u003cbr\u003e sensible person and had written nice, cheering fatherly letters to your\n\u003cbr\u003e little Judy, and had come occasionally and patted her on the head,\n\u003cbr\u003e and had said you were glad she was such a good girl--Then, perhaps,\n\u003cbr\u003e she wouldn\u0027t have flouted you in your old age, but would have obeyed\n\u003cbr\u003e your slightest wish like the dutiful daughter she was meant to be.\n\u003cbr\u003e \n\u003cbr\u003e Strangers indeed! You live in a glass house, Mr. Smith.\n\u003cbr\u003e \n\u003cbr\u003e And besides, this isn\u0027t a favour; it\u0027s like a prize--I earned it by\n\u003cbr\u003e hard work. If nobody had been good enough in English, the committee\n\u003cbr\u003e wouldn\u0027t have awarded the scholarship; some years they don\u0027t. Also--\n\u003cbr\u003e But what\u0027s the use of arguing with a man? You belong, Mr. Smith,\n\u003cbr\u003e to a sex devoid of a sense of logic. To bring a man into line,\n\u003cbr\u003e there are just two methods: one must either coax or be disagreeable. \n\u003cbr\u003e I scorn to coax men for what I wish. Therefore, I must be disagreeable.\n\u003cbr\u003e \n\u003cbr\u003e I refuse, sir, to give up the scholarship; and if you make any\n\u003cbr\u003e more fuss, I won\u0027t accept the monthly allowance either, but will\n\u003cbr\u003e wear myself into a nervous wreck tutoring stupid Freshmen.\n\u003cbr\u003e \n\u003cbr\u003e That is my ultimatum!\n\u003cbr\u003e \n\u003cbr\u003e And listen--I have a further thought. Since you are so afraid that by\n\u003cbr\u003e taking this scholarship I am depriving someone else of an education,\n\u003cbr\u003e I know a way out. You can apply the money that you would have spent\n\u003cbr\u003e for me towards educating some other little girl from the John Grier Home. \n\u003cbr\u003e Don\u0027t you think that\u0027s a nice idea? Only, Daddy, EDUCATE the new\n\u003cbr\u003e girl as much as you choose, but please don\u0027t LIKE her any better than me.\n\u003cbr\u003e \n\u003cbr\u003e I trust that your secretary won\u0027t be hurt because I pay so little\n\u003cbr\u003e attention to the suggestions offered in his letter, but I can\u0027t\n\u003cbr\u003e help it if he is. He\u0027s a spoiled child, Daddy. I\u0027ve meekly given\n\u003cbr\u003e in to his whims heretofore, but this time I intend to be FIRM.\n\u003cbr\u003e \n\u003cbr\u003e Yours,\n\u003cbr\u003e With a mind,\n\u003cbr\u003e Completely and Irrevocably and\n\u003cbr\u003e World-without-End Made-up,\n\u003cbr\u003e \n\u003cbr\u003e Jerusha Abbott\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59769.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
