{"id":44716,"no":50,"title":"20th December","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e I\u0027ve just a moment, because I must attend two classes, pack a trunk\n\u003cbr\u003e and a suit-case, and catch the four-o\u0027clock train--but I couldn\u0027t\n\u003cbr\u003e go without sending a word to let you know how much I appreciate\n\u003cbr\u003e my Christmas box.\n\u003cbr\u003e \n\u003cbr\u003e I love the furs and the necklace and the Liberty scarf and the gloves\n\u003cbr\u003e and handkerchiefs and books and purse--and most of all I love you! \n\u003cbr\u003e But Daddy, you have no business to spoil me this way. I\u0027m only human--\n\u003cbr\u003e and a girl at that. How can I keep my mind sternly fixed on a\n\u003cbr\u003e studious career, when you deflect me with such worldly frivolities?\n\u003cbr\u003e \n\u003cbr\u003e I have strong suspicions now as to which one of the John Grier\n\u003cbr\u003e Trustees used to give the Christmas tree and the Sunday ice-cream.\n\u003cbr\u003e He was nameless, but by his works I know him! You deserve to be\n\u003cbr\u003e happy for all the good things you do.\n\u003cbr\u003e \n\u003cbr\u003e Goodbye, and a very merry Christmas.\n\u003cbr\u003e Yours always,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e PS. I am sending a slight token, too. Do you think you would\n\u003cbr\u003e like her if you knew her?\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e 11th January\n\u003cbr\u003e \n\u003cbr\u003e I meant to write to you from the city, Daddy, but New York\n\u003cbr\u003e is an engrossing place.\n\u003cbr\u003e \n\u003cbr\u003e I had an interesting--and illuminating--time, but I\u0027m glad I don\u0027t\n\u003cbr\u003e belong to such a family! I should truly rather have the John Grier\n\u003cbr\u003e Home for a background. Whatever the drawbacks of my bringing up,\n\u003cbr\u003e there was at least no pretence about it. I know now what people\n\u003cbr\u003e mean when they say they are weighed down by Things. The material\n\u003cbr\u003e atmosphere of that house was crushing; I didn\u0027t draw a deep breath\n\u003cbr\u003e until I was on an express train coming back. All the furniture\n\u003cbr\u003e was carved and upholstered and gorgeous; the people I met were\n\u003cbr\u003e beautifully dressed and low-voiced and well-bred, but it\u0027s the truth,\n\u003cbr\u003e Daddy, I never heard one word of real talk from the time we arrived\n\u003cbr\u003e until we left. I don\u0027t think an idea ever entered the front door.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Pendleton never thinks of anything but jewels and dressmakers\n\u003cbr\u003e and social engagements. She did seem a different kind of mother from\n\u003cbr\u003e Mrs. McBride! If I ever marry and have a family, I\u0027m going to make them\n\u003cbr\u003e as exactly like the McBrides as I can. Not for all the money in the\n\u003cbr\u003e world would I ever let any children of mine develop into Pendletons. \n\u003cbr\u003e Maybe it isn\u0027t polite to criticize people you\u0027ve been visiting? \n\u003cbr\u003e If it isn\u0027t, please excuse. This is very confidential, between you\n\u003cbr\u003e and me.\n\u003cbr\u003e \n\u003cbr\u003e I only saw Master Jervie once when he called at tea time,\n\u003cbr\u003e and then I didn\u0027t have a chance to speak to him alone. \n\u003cbr\u003e It was really disappointing after our nice time last summer. \n\u003cbr\u003e I don\u0027t think he cares much for his relatives--and I am sure they\n\u003cbr\u003e don\u0027t care much for him! Julia\u0027s mother says he\u0027s unbalanced. \n\u003cbr\u003e He\u0027s a Socialist--except, thank Heaven, he doesn\u0027t let his hair grow\n\u003cbr\u003e and wear red ties. She can\u0027t imagine where he picked up his queer ideas;\n\u003cbr\u003e the family have been Church of England for generations. He throws\n\u003cbr\u003e away his money on every sort of crazy reform, instead of spending it\n\u003cbr\u003e on such sensible things as yachts and automobiles and polo ponies. \n\u003cbr\u003e He does buy candy with it though! He sent Julia and me each a box\n\u003cbr\u003e for Christmas.\n\u003cbr\u003e \n\u003cbr\u003e You know, I think I\u0027ll be a Socialist, too. You wouldn\u0027t mind,\n\u003cbr\u003e would you, Daddy? They\u0027re quite different from Anarchists;\n\u003cbr\u003e they don\u0027t believe in blowing people up. Probably I am one by rights;\n\u003cbr\u003e I belong to the proletariat. I haven\u0027t determined yet just which\n\u003cbr\u003e kind I am going to be. I will look into the subject over Sunday,\n\u003cbr\u003e and declare my principles in my next.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027ve seen loads of theatres and hotels and beautiful houses. \n\u003cbr\u003e My mind is a confused jumble of onyx and gilding and mosaic floors\n\u003cbr\u003e and palms. I\u0027m still pretty breathless but I am glad to get back\n\u003cbr\u003e to college and my books--I believe that I really am a student;\n\u003cbr\u003e this atmosphere of academic calm I find more bracing than New York. \n\u003cbr\u003e College is a very satisfying sort of life; the books and study\n\u003cbr\u003e and regular classes keep you alive mentally, and then when your\n\u003cbr\u003e mind gets tired, you have the gymnasium and outdoor athletics,\n\u003cbr\u003e and always plenty of congenial friends who are thinking about the\n\u003cbr\u003e same things you are. We spend a whole evening in nothing but talk--\n\u003cbr\u003e talk--talk--and go to bed with a very uplifted feeling, as though we\n\u003cbr\u003e had settled permanently some pressing world problems. And filling\n\u003cbr\u003e in every crevice, there is always such a lot of nonsense--just silly\n\u003cbr\u003e jokes about the little things that come up but very satisfying. \n\u003cbr\u003e We do appreciate our own witticisms!\n\u003cbr\u003e \n\u003cbr\u003e It isn\u0027t the great big pleasures that count the most; it\u0027s making\n\u003cbr\u003e a great deal out of the little ones--I\u0027ve discovered the true\n\u003cbr\u003e secret of happiness, Daddy, and that is to live in the now. \n\u003cbr\u003e Not to be for ever regretting the past, or anticipating the future;\n\u003cbr\u003e but to get the most that you can out of this very instant. \n\u003cbr\u003e It\u0027s like farming. You can have extensive farming and intensive\n\u003cbr\u003e farming; well, I am going to have intensive living after this. \n\u003cbr\u003e I\u0027m going to enjoy every second, and I\u0027m going to KNOW I\u0027m enjoying\n\u003cbr\u003e it while I\u0027m enjoying it. Most people don\u0027t live; they just race. \n\u003cbr\u003e They are trying to reach some goal far away on the horizon, and in the\n\u003cbr\u003e heat of the going they get so breathless and panting that they lose\n\u003cbr\u003e all sight of the beautiful, tranquil country they are passing through;\n\u003cbr\u003e and then the first thing they know, they are old and worn out,\n\u003cbr\u003e and it doesn\u0027t make any difference whether they\u0027ve reached the goal\n\u003cbr\u003e or not. I\u0027ve decided to sit down by the way and pile up a lot\n\u003cbr\u003e of little happinesses, even if I never become a Great Author. \n\u003cbr\u003e Did you ever know such a philosopheress as I am developing into?\n\u003cbr\u003e Yours ever,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e PS. It\u0027s raining cats and dogs tonight. Two puppies and a kitten\n\u003cbr\u003e have just landed on the window-sill.\n\u003cbr\u003e \n\u003cbr\u003e Dear Comrade,\n\u003cbr\u003e \n\u003cbr\u003e Hooray! I\u0027m a Fabian.\n\u003cbr\u003e \n\u003cbr\u003e That\u0027s a Socialist who\u0027s willing to wait. We don\u0027t want the social\n\u003cbr\u003e revolution to come tomorrow morning; it would be too upsetting. \n\u003cbr\u003e We want it to come very gradually in the distant future, when we\n\u003cbr\u003e shall all be prepared and able to sustain the shock.\n\u003cbr\u003e \n\u003cbr\u003e In the meantime, we must be getting ready, by instituting industrial,\n\u003cbr\u003e educational and orphan asylum reforms.\n\u003cbr\u003e Yours, with fraternal love,\n\u003cbr\u003e Judy\n\u003cbr\u003e Monday, 3rd hour\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59772.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
