{"id":44718,"no":52,"title":"5th March","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e President Cuyler made a speech this evening about the modern\n\u003cbr\u003e generation being flippant and superficial. He says that we are\n\u003cbr\u003e losing the old ideals of earnest endeavour and true scholarship;\n\u003cbr\u003e and particularly is this falling-off noticeable in our disrespectful\n\u003cbr\u003e attitude towards organized authority. We no longer pay a seemly\n\u003cbr\u003e deference to our superiors.\n\u003cbr\u003e \n\u003cbr\u003e I came away from chapel very sober.\n\u003cbr\u003e \n\u003cbr\u003e Am I too familiar, Daddy? Ought I to treat you with more dignity\n\u003cbr\u003e and aloofness?--Yes, I\u0027m sure I ought. I\u0027ll begin again.\n\u003cbr\u003e \n\u003cbr\u003e My Dear Mr. Smith,\n\u003cbr\u003e \n\u003cbr\u003e You will be pleased to hear that I passed successfully my mid-year\n\u003cbr\u003e examinations, and am now commencing work in the new semester. I am\n\u003cbr\u003e leaving chemistry--having completed the course in qualitative analysis--\n\u003cbr\u003e and am entering upon the study of biology. I approach this subject with\n\u003cbr\u003e some hesitation, as I understand that we dissect angleworms and frogs.\n\u003cbr\u003e \n\u003cbr\u003e An extremely interesting and valuable lecture was given in the\n\u003cbr\u003e chapel last week upon Roman Remains in Southern France. I have\n\u003cbr\u003e never listened to a more illuminating exposition of the subject.\n\u003cbr\u003e \n\u003cbr\u003e We are reading Wordsworth\u0027s Tintern Abbey in connection with our\n\u003cbr\u003e course in English Literature. What an exquisite work it is,\n\u003cbr\u003e and how adequately it embodies his conceptions of Pantheism! \n\u003cbr\u003e The Romantic movement of the early part of the last century,\n\u003cbr\u003e exemplified in the works of such poets as Shelley, Byron, Keats,\n\u003cbr\u003e and Wordsworth, appeals to me very much more than the Classical\n\u003cbr\u003e period that preceded it. Speaking of poetry, have you ever read\n\u003cbr\u003e that charming little thing of Tennyson\u0027s called Locksley Hall?\n\u003cbr\u003e \n\u003cbr\u003e I am attending gymnasium very regularly of late. A proctor\n\u003cbr\u003e system has been devised, and failure to comply with the rules\n\u003cbr\u003e causes a great deal of inconvenience. The gymnasium is equipped\n\u003cbr\u003e with a very beautiful swimming tank of cement and marble, the gift\n\u003cbr\u003e of a former graduate. My room-mate, Miss McBride, has given me\n\u003cbr\u003e her bathing-suit (it shrank so that she can no longer wear it)\n\u003cbr\u003e and I am about to begin swimming lessons.\n\u003cbr\u003e \n\u003cbr\u003e We had delicious pink ice-cream for dessert last night. \n\u003cbr\u003e Only vegetable dyes are used in colouring the food. The college\n\u003cbr\u003e is very much opposed, both from aesthetic and hygienic motives,\n\u003cbr\u003e to the use of aniline dyes.\n\u003cbr\u003e \n\u003cbr\u003e The weather of late has been ideal--bright sunshine and clouds\n\u003cbr\u003e interspersed with a few welcome snow-storms. I and my companions\n\u003cbr\u003e have enjoyed our walks to and from classes--particularly from.\n\u003cbr\u003e \n\u003cbr\u003e Trusting, my dear Mr. Smith, that this will find you in your usual\n\u003cbr\u003e good health,\n\u003cbr\u003e I remain,\n\u003cbr\u003e Most cordially yours,\n\u003cbr\u003e Jerusha Abbott\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59774.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
