{"id":44724,"no":58,"title":"3rd October","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e Back at college and a Senior--also editor of the Monthly. \n\u003cbr\u003e It doesn\u0027t seem possible, does it, that so sophisticated a person,\n\u003cbr\u003e just four years ago, was an inmate of the John Grier Home? \n\u003cbr\u003e We do arrive fast in America!\n\u003cbr\u003e \n\u003cbr\u003e What do you think of this? A note from Master Jervie directed\n\u003cbr\u003e to Lock Willow and forwarded here. He\u0027s sorry, but he finds that\n\u003cbr\u003e he can\u0027t get up there this autumn; he has accepted an invitation\n\u003cbr\u003e to go yachting with some friends. Hopes I\u0027ve had a nice summer\n\u003cbr\u003e and am enjoying the country.\n\u003cbr\u003e \n\u003cbr\u003e And he knew all the time that I was with the McBrides, for Julia\n\u003cbr\u003e told him so! You men ought to leave intrigue to women; you haven\u0027t\n\u003cbr\u003e a light enough touch.\n\u003cbr\u003e \n\u003cbr\u003e Julia has a trunkful of the most ravishing new clothes--an evening\n\u003cbr\u003e gown of rainbow Liberty crepe that would be fitting raiment for the\n\u003cbr\u003e angels in Paradise. And I thought that my own clothes this year\n\u003cbr\u003e were unprecedentedly (is there such a word?) beautiful. I copied\n\u003cbr\u003e Mrs. Paterson\u0027s wardrobe with the aid of a cheap dressmaker,\n\u003cbr\u003e and though the gowns didn\u0027t turn out quite twins of the originals,\n\u003cbr\u003e I was entirely happy until Julia unpacked. But now--I live to see Paris!\n\u003cbr\u003e \n\u003cbr\u003e Dear Daddy, aren\u0027t you glad you\u0027re not a girl? I suppose you think\n\u003cbr\u003e that the fuss we make over clothes is too absolutely silly? It is. \n\u003cbr\u003e No doubt about it. But it\u0027s entirely your fault.\n\u003cbr\u003e \n\u003cbr\u003e Did you ever hear about the learned Herr Professor who regarded\n\u003cbr\u003e unnecessary adornment with contempt and favoured sensible,\n\u003cbr\u003e utilitarian clothes for women? His wife, who was an obliging\n\u003cbr\u003e creature, adopted `dress reform.\u0027 And what do you think he did? \n\u003cbr\u003e He eloped with a chorus girl.\n\u003cbr\u003e Yours ever,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e PS. The chamber-maid in our corridor wears blue checked gingham aprons. \n\u003cbr\u003e I am going to get her some brown ones instead, and sink the blue\n\u003cbr\u003e ones in the bottom of the lake. I have a reminiscent chill every\n\u003cbr\u003e time I look at them.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59780.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
