{"id":44725,"no":59,"title":"17th November","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e Such a blight has fallen over my literary career. I don\u0027t know\n\u003cbr\u003e whether to tell you or not, but I would like some sympathy--\n\u003cbr\u003e silent sympathy, please; don\u0027t re-open the wound by referring to it\n\u003cbr\u003e in your next letter.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027ve been writing a book, all last winter in the evenings, and all\n\u003cbr\u003e the summer when I wasn\u0027t teaching Latin to my two stupid children. \n\u003cbr\u003e I just finished it before college opened and sent it to a publisher. \n\u003cbr\u003e He kept it two months, and I was certain he was going to take it;\n\u003cbr\u003e but yesterday morning an express parcel came (thirty cents due)\n\u003cbr\u003e and there it was back again with a letter from the publisher, a very nice,\n\u003cbr\u003e fatherly letter--but frank! He said he saw from the address that I\n\u003cbr\u003e was still at college, and if I would accept some advice, he would\n\u003cbr\u003e suggest that I put all of my energy into my lessons and wait until I\n\u003cbr\u003e graduated before beginning to write. He enclosed his reader\u0027s opinion. \n\u003cbr\u003e Here it is:\n\u003cbr\u003e \n\u003cbr\u003e `Plot highly improbable. Characterization exaggerated. \n\u003cbr\u003e Conversation unnatural. A good deal of humour but not always\n\u003cbr\u003e in the best of taste. Tell her to keep on trying, and in time\n\u003cbr\u003e she may produce a real book.\u0027\n\u003cbr\u003e \n\u003cbr\u003e Not on the whole flattering, is it, Daddy? And I thought I was\n\u003cbr\u003e making a notable addition to American literature. I did truly. \n\u003cbr\u003e I was planning to surprise you by writing a great novel before\n\u003cbr\u003e I graduated. I collected the material for it while I was at\n\u003cbr\u003e Julia\u0027s last Christmas. But I dare say the editor is right. \n\u003cbr\u003e Probably two weeks was not enough in which to observe the manners\n\u003cbr\u003e and customs of a great city.\n\u003cbr\u003e \n\u003cbr\u003e I took it walking with me yesterday afternoon, and when I came\n\u003cbr\u003e to the gas house, I went in and asked the engineer if I might borrow\n\u003cbr\u003e his furnace. He politely opened the door, and with my own hands\n\u003cbr\u003e I chucked it in. I felt as though I had cremated my only child!\n\u003cbr\u003e \n\u003cbr\u003e I went to bed last night utterly dejected; I thought I was never\n\u003cbr\u003e going to amount to anything, and that you had thrown away your\n\u003cbr\u003e money for nothing. But what do you think? I woke up this morning\n\u003cbr\u003e with a beautiful new plot in my head, and I\u0027ve been going about\n\u003cbr\u003e all day planning my characters, just as happy as I could be. \n\u003cbr\u003e No one can ever accuse me of being a pessimist! If I had a husband\n\u003cbr\u003e and twelve children swallowed by an earthquake one day, I\u0027d bob\n\u003cbr\u003e up smilingly the next morning and commence to look for another set.\n\u003cbr\u003e Affectionately,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59781.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
