{"id":44726,"no":60,"title":"14th December","content":"Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e I dreamed the funniest dream last night. I thought I went into\n\u003cbr\u003e a book store and the clerk brought me a new book named The Life\n\u003cbr\u003e and Letters of Judy Abbott. I could see it perfectly plainly--\n\u003cbr\u003e red cloth binding with a picture of the John Grier Home on the cover,\n\u003cbr\u003e and my portrait for a frontispiece with, `Very truly yours, Judy Abbott,\u0027\n\u003cbr\u003e written below. But just as I was turning to the end to read the\n\u003cbr\u003e inscription on my tombstone, I woke up. It was very annoying! \n\u003cbr\u003e I almost found out whom I\u0027m going to marry and when I\u0027m going\n\u003cbr\u003e to die.\n\u003cbr\u003e \n\u003cbr\u003e Don\u0027t you think it would be interesting if you really could read the story\n\u003cbr\u003e of your life--written perfectly truthfully by an omniscient author? \n\u003cbr\u003e And suppose you could only read it on this condition: that you\n\u003cbr\u003e would never forget it, but would have to go through life knowing\n\u003cbr\u003e ahead of time exactly how everything you did would turn out,\n\u003cbr\u003e and foreseeing to the exact hour the time when you would die. \n\u003cbr\u003e How many people do you suppose would have the courage to read it\n\u003cbr\u003e then? or how many could suppress their curiosity sufficiently\n\u003cbr\u003e to escape from reading it, even at the price of having to live\n\u003cbr\u003e without hope and without surprises?\n\u003cbr\u003e \n\u003cbr\u003e Life is monotonous enough at best; you have to eat and sleep about\n\u003cbr\u003e so often. But imagine how DEADLY monotonous it would be if nothing\n\u003cbr\u003e unexpected could happen between meals. Mercy! Daddy, there\u0027s a blot,\n\u003cbr\u003e but I\u0027m on the third page and I can\u0027t begin a new sheet.\n\u003cbr\u003e \n\u003cbr\u003e I\u0027m going on with biology again this year--very interesting subject;\n\u003cbr\u003e we\u0027re studying the alimentary system at present. You should see\n\u003cbr\u003e how sweet a cross-section of the duodenum of a cat is under\n\u003cbr\u003e the microscope.\n\u003cbr\u003e \n\u003cbr\u003e Also we\u0027ve arrived at philosophy--interesting but evanescent. I prefer\n\u003cbr\u003e biology where you can pin the subject under discussion to a board. \n\u003cbr\u003e There\u0027s another! And another! This pen is weeping copiously. \n\u003cbr\u003e Please excuse its tears.\n\u003cbr\u003e \n\u003cbr\u003e Do you believe in free will? I do--unreservedly. I don\u0027t agree\n\u003cbr\u003e at all with the philosophers who think that every action is the\n\u003cbr\u003e absolutely inevitable and automatic resultant of an aggregation\n\u003cbr\u003e of remote causes. That\u0027s the most immoral doctrine I ever heard--\n\u003cbr\u003e nobody would be to blame for anything. If a man believed in fatalism,\n\u003cbr\u003e he would naturally just sit down and say, `The Lord\u0027s will be done,\u0027\n\u003cbr\u003e and continue to sit until he fell over dead.\n\u003cbr\u003e \n\u003cbr\u003e I believe absolutely in my own free will and my own power to accomplish--\n\u003cbr\u003e and that is the belief that moves mountains. You watch me become\n\u003cbr\u003e a great author! I have four chapters of my new book finished\n\u003cbr\u003e and five more drafted.\n\u003cbr\u003e \n\u003cbr\u003e This is a very abstruse letter--does your head ache, Daddy? \n\u003cbr\u003e I think we\u0027ll stop now and make some fudge. I\u0027m sorry I can\u0027t\n\u003cbr\u003e send you a piece; it will be unusually good, for we\u0027re going\n\u003cbr\u003e to make it with real cream and three butter balls.\n\u003cbr\u003e Yours affectionately,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e PS. We\u0027re having fancy dancing in gymnasium class. You can see\n\u003cbr\u003e by the accompanying picture how much we look like a real ballet. \n\u003cbr\u003e The one at the end accomplishing a graceful pirouette is me--I mean\n\u003cbr\u003e I.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59782.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
