{"id":44728,"no":62,"title":"12th Jan.","content":"Dear Mr. Philanthropist,\n\u003cbr\u003e \n\u003cbr\u003e Your cheque for my family came yesterday. Thank you so much! \n\u003cbr\u003e I cut gymnasium and took it down to them right after luncheon,\n\u003cbr\u003e and you should have seen the girl\u0027s face! She was so surprised\n\u003cbr\u003e and happy and relieved that she looked almost young; and she\u0027s only\n\u003cbr\u003e twenty-four. Isn\u0027t it pitiful?\n\u003cbr\u003e \n\u003cbr\u003e Anyway, she feels now as though all the good things were coming together. \n\u003cbr\u003e She has steady work ahead for two months--someone\u0027s getting married,\n\u003cbr\u003e and there\u0027s a trousseau to make.\n\u003cbr\u003e \n\u003cbr\u003e `Thank the good Lord!\u0027 cried the mother, when she grasped the fact\n\u003cbr\u003e that that small piece of paper was one hundred dollars.\n\u003cbr\u003e \n\u003cbr\u003e `It wasn\u0027t the good Lord at all,\u0027 said I, `it was Daddy-Long-Legs.\u0027\n\u003cbr\u003e (Mr. Smith, I called you.)\n\u003cbr\u003e \n\u003cbr\u003e `But it was the good Lord who put it in his mind,\u0027 said she.\n\u003cbr\u003e \n\u003cbr\u003e `Not at all! I put it in his mind myself,\u0027 said I.\n\u003cbr\u003e \n\u003cbr\u003e But anyway, Daddy, I trust the good Lord will reward you suitably. \n\u003cbr\u003e You deserve ten thousand years out of purgatory.\n\u003cbr\u003e Yours most gratefully,\n\u003cbr\u003e Judy Abbott\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e 15th Feb.\n\u003cbr\u003e May it please Your Most Excellent Majesty:\n\u003cbr\u003e \n\u003cbr\u003e This morning I did eat my breakfast upon a cold turkey pie\n\u003cbr\u003e and a goose, and I did send for a cup of tee (a china drink)\n\u003cbr\u003e of which I had never drank before.\n\u003cbr\u003e \n\u003cbr\u003e Don\u0027t be nervous, Daddy--I haven\u0027t lost my mind; I\u0027m merely quoting\n\u003cbr\u003e Sam\u0027l Pepys. We\u0027re reading him in connection with English History,\n\u003cbr\u003e original sources. Sallie and Julia and I converse now in the language\n\u003cbr\u003e of 1660. Listen to this:\n\u003cbr\u003e \n\u003cbr\u003e `I went to Charing Cross to see Major Harrison hanged,\n\u003cbr\u003e drawn and quartered: he looking as cheerful as any man could\n\u003cbr\u003e do in that condition.\u0027 And this: `Dined with my lady who is\n\u003cbr\u003e in handsome mourning for her brother who died yesterday of spotted fever.\u0027\n\u003cbr\u003e \n\u003cbr\u003e Seems a little early to commence entertaining, doesn\u0027t it? A friend\n\u003cbr\u003e of Pepys devised a very cunning manner whereby the king might pay\n\u003cbr\u003e his debts out of the sale to poor people of old decayed provisions. \n\u003cbr\u003e What do you, a reformer, think of that? I don\u0027t believe we\u0027re so bad\n\u003cbr\u003e today as the newspapers make out.\n\u003cbr\u003e \n\u003cbr\u003e Samuel was as excited about his clothes as any girl; he spent\n\u003cbr\u003e five times as much on dress as his wife--that appears to have\n\u003cbr\u003e been the Golden Age of husbands. Isn\u0027t this a touching entry? \n\u003cbr\u003e You see he really was honest. `Today came home my fine Camlett\n\u003cbr\u003e cloak with gold buttons, which cost me much money, and I pray God\n\u003cbr\u003e to make me able to pay for it.\u0027\n\u003cbr\u003e \n\u003cbr\u003e Excuse me for being so full of Pepys; I\u0027m writing a special topic\n\u003cbr\u003e on him.\n\u003cbr\u003e \n\u003cbr\u003e What do you think, Daddy? The Self-Government Association has\n\u003cbr\u003e abolished the ten o\u0027clock rule. We can keep our lights all night\n\u003cbr\u003e if we choose, the only requirement being that we do not disturb others--\n\u003cbr\u003e we are not supposed to entertain on a large scale. The result is a\n\u003cbr\u003e beautiful commentary on human nature. Now that we may stay up as long\n\u003cbr\u003e as we choose, we no longer choose. Our heads begin to nod at nine\n\u003cbr\u003e o\u0027clock, and by nine-thirty the pen drops from our nerveless grasp. \n\u003cbr\u003e It\u0027s nine-thirty now. Good night.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e Sunday\n\u003cbr\u003e \n\u003cbr\u003e Just back from church--preacher from Georgia. We must take care, he says,\n\u003cbr\u003e not to develop our intellects at the expense of our emotional natures--\n\u003cbr\u003e but methought it was a poor, dry sermon (Pepys again). It doesn\u0027t\n\u003cbr\u003e matter what part of the United States or Canada they come from,\n\u003cbr\u003e or what denomination they are, we always get the same sermon. \n\u003cbr\u003e Why on earth don\u0027t they go to men\u0027s colleges and urge the students\n\u003cbr\u003e not to allow their manly natures to be crushed out by too much\n\u003cbr\u003e mental application?\n\u003cbr\u003e \n\u003cbr\u003e It\u0027s a beautiful day--frozen and icy and clear. As soon as dinner\n\u003cbr\u003e is over, Sallie and Julia and Marty Keene and Eleanor Pratt (friends\n\u003cbr\u003e of mine, but you don\u0027t know them) and I are going to put on short\n\u003cbr\u003e skirts and walk \u0027cross country to Crystal Spring Farm and have a fried\n\u003cbr\u003e chicken and waffle supper, and then have Mr. Crystal Spring drive\n\u003cbr\u003e us home in his buckboard. We are supposed to be inside the campus\n\u003cbr\u003e at seven, but we are going to stretch a point tonight and make it eight.\n\u003cbr\u003e \n\u003cbr\u003e Farewell, kind Sir.\n\u003cbr\u003e I have the honour of subscribing myself,\n\u003cbr\u003e Your most loyall, dutifull, faithfull and obedient\n\u003cbr\u003e servant,\n\u003cbr\u003e J. Abbott\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59784.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
