{"id":44675,"no":9,"title":"19th December","content":"19th December\n\u003cbr\u003e Dear Daddy-Long-Legs,\n\u003cbr\u003e \n\u003cbr\u003e You never answered my question and it was very important.\n\u003cbr\u003e \n\u003cbr\u003e ARE YOU BALD?\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e I have it planned exactly what you look like--very satisfactorily--\n\u003cbr\u003e until I reach the top of your head, and then I AM stuck. I can\u0027t\n\u003cbr\u003e decide whether you have white hair or black hair or sort of sprinkly\n\u003cbr\u003e grey hair or maybe none at all.\n\u003cbr\u003e \n\u003cbr\u003e Here is your portrait:\n\u003cbr\u003e \n\u003cbr\u003e But the problem is, shall I add some hair?\n\u003cbr\u003e \n\u003cbr\u003e Would you like to know what colour your eyes are? They\u0027re grey,\n\u003cbr\u003e and your eyebrows stick out like a porch roof (beetling, they\u0027re\n\u003cbr\u003e called in novels), and your mouth is a straight line with a tendency\n\u003cbr\u003e to turn down at the corners. Oh, you see, I know! You\u0027re a snappy\n\u003cbr\u003e old thing with a temper.\n\u003cbr\u003e (Chapel bell.)\n\u003cbr\u003e 9.45 p.m.\n\u003cbr\u003e \n\u003cbr\u003e I have a new unbreakable rule: never, never to study at night no matter\n\u003cbr\u003e how many written reviews are coming in the morning. Instead, I read\n\u003cbr\u003e just plain books--I have to, you know, because there are eighteen\n\u003cbr\u003e blank years behind me. You wouldn\u0027t believe, Daddy, what an abyss\n\u003cbr\u003e of ignorance my mind is; I am just realizing the depths myself. \n\u003cbr\u003e The things that most girls with a properly assorted family and a home\n\u003cbr\u003e and friends and a library know by absorption, I have never heard of. \n\u003cbr\u003e For example:\n\u003cbr\u003e \n\u003cbr\u003e I never read Mother Goose or David Copperfield or Ivanhoe or\n\u003cbr\u003e Cinderella or Blue Beard or Robinson Crusoe or Jane Eyre or Alice\n\u003cbr\u003e in Wonderland or a word of Rudyard Kipling. I didn\u0027t know that Henry\n\u003cbr\u003e the Eighth was married more than once or that Shelley was a poet. \n\u003cbr\u003e I didn\u0027t know that people used to be monkeys and that the Garden\n\u003cbr\u003e of Eden was a beautiful myth. I didn\u0027t know that R. L. S. stood\n\u003cbr\u003e for Robert Louis Stevenson or that George Eliot was a lady. \n\u003cbr\u003e I had never seen a picture of the `Mona Lisa\u0027 and (it\u0027s true but you\n\u003cbr\u003e won\u0027t believe it) I had never heard of Sherlock Holmes.\n\u003cbr\u003e \n\u003cbr\u003e Now, I know all of these things and a lot of others besides,\n\u003cbr\u003e but you can see how much I need to catch up. And oh, but it\u0027s fun! \n\u003cbr\u003e I look forward all day to evening, and then I put an `engaged\u0027 on the\n\u003cbr\u003e door and get into my nice red bath robe and furry slippers and pile\n\u003cbr\u003e all the cushions behind me on the couch, and light the brass student\n\u003cbr\u003e lamp at my elbow, and read and read and read one book isn\u0027t enough. \n\u003cbr\u003e I have four going at once. Just now, they\u0027re Tennyson\u0027s poems and\n\u003cbr\u003e Vanity Fair and Kipling\u0027s Plain Tales and--don\u0027t laugh--Little Women. \n\u003cbr\u003e I find that I am the only girl in college who wasn\u0027t brought up on\n\u003cbr\u003e Little Women. I haven\u0027t told anybody though (that WOULD stamp me\n\u003cbr\u003e as queer). I just quietly went and bought it with $1.12 of my last\n\u003cbr\u003e month\u0027s allowance; and the next time somebody mentions pickled limes,\n\u003cbr\u003e I\u0027ll know what she is talking about!\n\u003cbr\u003e \n\u003cbr\u003e (Ten o\u0027clock bell. This is a very interrupted letter.)\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e Saturday\n\u003cbr\u003e Sir,\n\u003cbr\u003e \n\u003cbr\u003e I have the honour to report fresh explorations in the field of geometry. \n\u003cbr\u003e On Friday last we abandoned our former works in parallelopipeds\n\u003cbr\u003e and proceeded to truncated prisms. We are finding the road rough\n\u003cbr\u003e and very uphill.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e Sunday\n\u003cbr\u003e \n\u003cbr\u003e The Christmas holidays begin next week and the trunks are up. \n\u003cbr\u003e The corridors are so filled up that you can hardly get through,\n\u003cbr\u003e and everybody is so bubbling over with excitement that studying is\n\u003cbr\u003e getting left out. I\u0027m going to have a beautiful time in vacation;\n\u003cbr\u003e there\u0027s another Freshman who lives in Texas staying behind,\n\u003cbr\u003e and we are planning to take long walks and if there\u0027s any ice--\n\u003cbr\u003e learn to skate. Then there is still the whole library to be read--\n\u003cbr\u003e and three empty weeks to do it in!\n\u003cbr\u003e \n\u003cbr\u003e Goodbye, Daddy, I hope that you are feeling as happy as am.\n\u003cbr\u003e Yours ever,\n\u003cbr\u003e Judy\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e PS. Don\u0027t forget to answer my question. If you don\u0027t want\n\u003cbr\u003e the trouble of writing, have your secretary telegraph. He can\n\u003cbr\u003e \n\u003cbr\u003e just say:\n\u003cbr\u003e Mr. Smith is quite bald,\n\u003cbr\u003e \n\u003cbr\u003e or\n\u003cbr\u003e \n\u003cbr\u003e Mr. Smith is not bald,\n\u003cbr\u003e \n\u003cbr\u003e or\n\u003cbr\u003e \n\u003cbr\u003e Mr. Smith has white hair.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e And you can deduct the twenty-five cents out of my allowance.\n\u003cbr\u003e \n\u003cbr\u003e Goodbye till January--and a merry Christmas!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2106/59731.html","bookId":520,"creation":"Aug 11, 2019 7:56:04 AM","modification":"Aug 11, 2019 7:56:04 AM"}
