{"id":99959,"no":24,"title":"Page 24","content":"\u003cp\u003eHis claws grow restless now that I’ve put him on the spot. They click out a nervous message of apology against the tabletop. “I do care for you, Sirantha. You are…the most important person in my life. But…that is…I cannot—”\u003c/p\u003e\n\u003cp\u003eI let him off the hook, listing the reasons why it’s not going to happen. “You’re not ready for a romantic relationship. You remember what it was like with Adele. Then you lost her. And you don’t want to feel like that again. Plus, you’re still healing.”\u003c/p\u003e\n\u003cp\u003eI understand this about Vel. It’s too bad March doesn’t. And then I realize…he doesn’t know. He sees only our closeness without understanding the context.\u003c/p\u003e\n\u003cp\u003e“Why do I love such an idiot?” I mumble.\u003c/p\u003e\n\u003cp\u003e“I imagine he asks himself the same question.”\u003c/p\u003e\n\u003cp\u003eI sit up. “Ouch. Are you pissed off at me?”\u003c/p\u003e\n\u003cp\u003e“No. But neither of you is perfect.”\u003c/p\u003e\n\u003cp\u003e“True enough. Would you mind if I told him about Adele?” It’s his story, but it will go a long way toward easing March’s mind and helping him understand that Vel’s not a threat to him…at least, not during his lifetime.\u003c/p\u003e\n\u003cp\u003eIt could take eighty turns before Vel is ready to move on. I might be grieving myself by that point, and he’ll be there to help me through it. Then there will be an endless future together, so long as my nanites are still working, and who knows what will happen that far down the road? Not me. I can’t even wrap my head around it. Most days, it’s all I can do to handle the here and now.\u003c/p\u003e\n\u003cp\u003e“I do not mind if you reveal the bones,” he answers at length. “But some of the story, I spoke for your ears alone, Sirantha.”\u003c/p\u003e\n\u003cp\u003e“Understood. I’ll just tell him the basics, and that you need a friend. Which I am.”\u003c/p\u003e\n\u003cp\u003e“I have never known one dearer,” he says.\u003c/p\u003e\n\u003cp\u003e“I should go wake him up. There won’t be time to talk in the morning, and I don’t think he’d get over it if we left things like this, and something happened to me.”\u003c/p\u003e\n\u003cp\u003eDespite my ability to heal wounds that would end anyone else, I’m not immortal or indestructible. The nanites can’t grow me a new head or rebuild me if I’m charred to ash. I can still die; it just takes more to kill me.\u003c/p\u003e\n\u003cp\u003e“He would not.” He runs a claw down my cheek. “Nor would I. And who knows, perhaps someday—”\u003c/p\u003e\n\u003cp\u003e“You don’t have to make me any promises. Just be there. That’s all.”\u003c/p\u003e\n\u003cp\u003e“I will be.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry you got dragged into this. It’s…” I shake my head. Words fail me.\u003c/p\u003e\n\u003cp\u003e“It was…diverting, to say the least. I have never been the seductive third in a love triangle.” And he’s smirking again. “It is not a role I have played before.”\u003c/p\u003e\n\u003cp\u003e“I imagine not.”\u003c/p\u003e\n\u003cp\u003e“Tell me, Sirantha, what is it about me that you find irresistible? Is it my gleaming chitin? My eyes? My mandible? No, I have it. My talons drive you wild.”\u003c/p\u003e\n\u003cp\u003e“You’re never going to let me live this down, are you?”\u003c/p\u003e\n\u003cp\u003e“Probably not. It is possible, however, that in five hundred turns, neural decay will set in, and I will no longer recall how hilarious this is.”\u003c/p\u003e\n\u003cp\u003e“You’re an evil, evil Bug.”\u003c/p\u003e\n\u003cp\u003e“Occasionally. Off you go now.”\u003c/p\u003e\n\u003cp\u003eI shoot him a dirty look as I head out. At this hour, I encounter only Constance, who’s walking toward comms. She never sleeps for obvious reasons; she just plugs in now and then to recharge.\u003c/p\u003e\n\u003cp\u003e“How’s Sasha doing?”\u003c/p\u003e\n\u003cp\u003e“At his lessons, brilliantly. In other regards, I am concerned.” Her words match her grandmotherly façade. Maybe she really does worry.\u003c/p\u003e\n\u003cp\u003e“He wants to fight.”\u003c/p\u003e\n\u003cp\u003e“I know. We’ve talked about it. He’s fascinated by the children’s brigade. Not that he sees himself as a child.”\u003c/p\u003e\n\u003cp\u003e“What do you think?”\u003c/p\u003e\n\u003cp\u003e“It is not without precedent…yet as Commander March says, Sasha is young. I am not qualified to render psychological analysis in this scenario.”\u003c/p\u003e\n\u003cp\u003e“You must have an opinion, though.” I tilt my head, inviting the truth.\u003c/p\u003e\n\u003cp\u003e“I do. In your service, Sirantha Jax, I have learned to respect free will. You let me choose whether I wanted to be in the sphere, part of a ship, or in a physical body. You never told me I was wrong for using the resources and processes available to me to make that choice. You gave me freedom.” She meets my gaze in a most un-AI fashion, as if she’s a real person inside those circuits and wires. “I think it is wrong to deny Sasha his own choices even if he is but a young sentient being. His mistakes should be his own.”\u003c/p\u003e\n\u003cp\u003e“Even if they prove costly?” I ask.\u003c/p\u003e\n\u003cp\u003e“Commander March should not deny the boy out of his own fear.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the opinion. I’m on my way to talk to him now.” I realize the AI can’t make decisions as a human would; her thought processes are alien, and they’re morally gray as applied to this particular situation. Yet I think it pleased her that I asked.\u003c/p\u003e\n\u003cp\u003eShe taps a few panels in the comm suite, and informs me, “The commander is watching vids in his quarters.”\u003c/p\u003e\n\u003cp\u003e“You can tell that?”\u003c/p\u003e\n\u003cp\u003e“Yes, from the energy consumption.”\u003c/p\u003e\n\u003cp\u003eI point out, “He might’ve fallen asleep with the console playing.”\u003c/p\u003e\n\u003cp\u003e“A possibility. But I don’t imagine you’ll let that dissuade you.”\u003c/p\u003e\n\u003cp\u003e“No. This can’t wait.”\u003c/p\u003e\n\u003cp\u003eIn wartime, there’s no guarantee of tomorrow, so it’s best not to leave things unsaid.\u003c/p\u003e\n\u003cp\u003eCHAPTER 27\u003c/p\u003e\n\u003cp\u003eHe’s not asleep, but despite what I told Constance, I didn’t think he would be. March answers the door, looking haggard. “I wasn’t sure if I’d see you before you left.”\u003c/p\u003e\n\u003cp\u003e“Did you want to?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“There are some things we need to talk about.”\u003c/p\u003e\n\u003cp\u003eHe steps back, inviting me into my old quarters with a gesture. “By all means.”\u003c/p\u003e\n\u003cp\u003e“I need to tell you a story.”\u003c/p\u003e\n\u003cp\u003eHis brow furrows. “Now?”\u003c/p\u003e\n\u003cp\u003e“There’s no better time.”\u003c/p\u003e\n\u003cp\u003eIn as few words as possible, I explain that Vel had a human lover—that they were happy together on Gehenna for many turns, until she made him leave her so he wouldn’t have to watch her age. Then I tell March how she died, not so long ago, and that Ithtorians mourn for a long time. When I come to the end of my recitation, I ask, “Do you understand why I’m telling you this?”\u003c/p\u003e\n\u003cp\u003e“Because she remains at the center of his heart…and I’m jealous for nothing.”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003e“I gather he told you that we talked?” A hot flush steals over his cheeks, making him look feverish, as well as weary and heartsick.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t have interfered like that. I don’t know why I did. I just…I don’t know. I went a little crazy or something. I could only see that I’m not making you happy. We fight a lot. I thought maybe—”\u003c/p\u003e\n\u003cp\u003e“See, that’s your mistake…thinking you need to make me happy. I’m in charge of my own moods. Yes, we’re fighting more, but it’s because we’re talking. There are no secrets with you in my head, but before now, you haven’t told me how you feel about what you see there. And I don’t have your facility at poking around in people’s minds. That said, I haven’t been good about sharing, either. It’s something we both need to work on.” I take a breath before continuing, “I do apologize for interfering about Sasha. I wasn’t thinking like a parent at the time…because I’m not one, so I get why you went ballistic.”\u003c/p\u003e\n\u003cp\u003eHe nods, stepping toward me as if he’s afraid of being rebuffed. There’s no prickle in my brain. He won’t intrude since I forced him out. “I have a bad habit of only bringing things up when I’m already mad about something else. So I put my fears in the worst possible way, and I hurt you.”\u003c/p\u003e\n\u003cp\u003e“Words are weapons,” I say softly.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry for what I said. I don’t think you break everything you touch.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“I already told Sasha, but you should hear it as well. If his feelings on joining the resistance haven’t changed in a turn or two, then I won’t stand in his way.”\u003c/p\u003e\n\u003cp\u003e“Is he content with that?” It’s a huge step for March, hating the idea as he does, fearing for his nephew’s safety. I know he wanted a future devoid of violence for Sasha; he doesn’t want the kid going down his road.\u003c/p\u003e\n\u003cp\u003eMarch nods. “He thinks it’s a fair compromise.”\u003c/p\u003e\n\u003cp\u003e“And meanwhile, you’ll train him? Loras has some plan for a Special Forces unit. Maybe you can—”\u003c/p\u003e\n\u003cp\u003e“I already volunteered to put it together.”\u003c/p\u003e\n\u003cp\u003ePleasure but not surprise rolls through me. He always wants to be in the vanguard, but life doesn’t always permit our dreams to come true. So we cling to them in tatters and threads, until the colors fade beyond all recognition.\u003c/p\u003e\n\u003cp\u003e“I wish you were coming with me,” I say softly.\u003c/p\u003e\n\u003cp\u003eHis smile layers exhaustion, tension, and desire. “As do I. You’ve no idea how weary I am of being left behind.”\u003c/p\u003e\n\u003cp\u003e“It isn’t always me, leaving…or it hasn’t been.” I figure I might as well get it all out in the open.\u003c/p\u003e\n\u003cp\u003e“Are you talking about when I stayed to fight on Lachion?”\u003c/p\u003e\n\u003cp\u003eI nod. “And then when you went to look for Sasha while I sat in prison.”\u003c/p\u003e\n\u003cp\u003eHe flinches as if I’ve stabbed him. “I thought you understood.”\u003c/p\u003e\n\u003cp\u003eI recall speaking those precise words to him about why I couldn’t stay on Nicu Tertius and play at motherhood. By his pallor, he recalls it, too. This exchange is less raw, less heated, but no less candid. March squares his shoulders.\u003c/p\u003e\n\u003cp\u003e“I did, but that doesn’t take away the sting. You know that.”\u003c/p\u003e\n\u003cp\u003e“I hurt you,” he says, as if this is a revelation.\u003c/p\u003e\n\u003cp\u003e“Yeah, but that’s fair. I’ve been breaking your heart since the day you met me.”\u003c/p\u003e\n\u003cp\u003eMarch sits down heavily on the bunk. “It’s why you don’t trust me. All this time, I’ve told myself that’s just the way you are…you don’t lean on people. But you do rely on Vel…and that’s why I envy him so much.”\u003c/p\u003e\n\u003cp\u003e“I thought I explained—”\u003c/p\u003e\n\u003cp\u003eHe goes on as if I haven’t spoken, “You just don’t lean when you’re unsure.”\u003c/p\u003e\n\u003cp\u003e“I do love you,” I say.\u003c/p\u003e\n\u003cp\u003e“But you doubt that you can depend on me. Because at the start of things, I put duty first. I chose Lachion…and then my sister’s child.”\u003c/p\u003e\n\u003cp\u003e“I didn’t ask you to put me ahead of honor or family obligation.”\u003c/p\u003e\n\u003cp\u003e“But I have to, don’t I? If I want your trust, that’s how it has to be.”\u003c/p\u003e\n\u003cp\u003eI can’t lie to him. “Yes. Right now, we have love, but we don’t have faith. One of us is always keeping an eye on the horizon.”\u003c/p\u003e\n\u003cp\u003e“Because I left you, when the time came, you chose not to stay with me.”\u003c/p\u003e\n\u003cp\u003e“No, that’s not why. Even if you had been perfectly steadfast, I wouldn’t have stayed on Nicu Tertius. That’s not the life for me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/endgame-sirantha-jax-6/page-24.html","bookId":1651,"creation":"Oct 5, 2019 6:49:03 PM","modification":"Oct 5, 2019 6:49:03 PM"}
