{"id":77515,"no":21,"title":"Page 21","content":"\u003cp\u003e‘Coward!’ he whispered. ‘Oh, what a coward you are, Dustfinger!’ He bit his lips until they hurt. ‘Come on!’ he told himself. ‘This may be your last chance, you fool! Once Capricorn has the book he’ll never let you look at it again.’ Once more, he opened the book, leafed rapidly through to about the middle – and closed it again, with a sound loud enough to make Meggie give a little start in her sleep and bury her head under the covers. Dustfinger waited motionless beside the bed until she was breathing regularly again, then leaned over her treasure chest with a deep sigh and put the book back under the others.\u003c/p\u003e\n\u003cp\u003eSoundlessly, he closed the lid.\u003c/p\u003e\n\u003cp\u003e‘Did you see that, Gwin?’ he whispered to the marten. ‘I just dare not look. Wouldn’t you rather find a braver master? Think it over.’ Gwin chattered softly in his ear, but if that was an answer Dustfinger didn’t understand it.\u003c/p\u003e\n\u003cp\u003eFor a moment he went on listening to Meggie’s quiet breathing, then stole back to the door. ‘Well, what does it matter?’ he muttered when he was out in the corridor. ‘Who wants to know the end of a story in advance?’\u003c/p\u003e\n\u003cp\u003eHe climbed up to the attic bedroom Elinor had given him and lay down on the narrow bed with the crates of books towering around it. But he could not sleep until morning came.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eGoing Further South\u003c/p\u003e\n\u003cp\u003eThe Road goes ever on and on\u003c/p\u003e\n\u003cp\u003eDown from the door where it began.\u003c/p\u003e\n\u003cp\u003eNow far ahead the Road has gone,\u003c/p\u003e\n\u003cp\u003eAnd I must follow, if I can,\u003c/p\u003e\n\u003cp\u003ePursuing it with weary feet,\u003c/p\u003e\n\u003cp\u003eUntil it joins some larger way\u003c/p\u003e\n\u003cp\u003eWhere many paths and errands meet.\u003c/p\u003e\n\u003cp\u003eAnd whither then? I cannot say.\u003c/p\u003e\n\u003cp\u003eJ.R.R. Tolkien\u003c/p\u003e\n\u003cp\u003eThe Lord of the Rings: The Fellowship of the Ring\u003c/p\u003e\n\u003cp\u003eAfter breakfast next morning Elinor spread a crumpled road map out on the kitchen table. ‘Right, three hundred kilometres south of here,’ she said with a wary glance at Dustfinger. ‘So show us exactly where we have to look for Meggie’s father.’\u003c/p\u003e\n\u003cp\u003eMeggie looked at Dustfinger, her heart thudding. There were dark shadows round his eyes, as if he had slept very badly. Hesitantly, he came over to the table, rubbing his stubbly chin. He bent over the map, scrutinised it for what seemed an eternity, and finally pointed with his finger.\u003c/p\u003e\n\u003cp\u003e‘There,’ he said. ‘Capricorn’s village is just there.’\u003c/p\u003e\n\u003cp\u003eElinor looked over his shoulder. ‘Liguria,’ she said. ‘Aha. And what is the name of this village, if I may ask? Capricornia?’ She was examining Dustfinger’s face as if tracing his scars with her eyes.\u003c/p\u003e\n\u003cp\u003e‘It doesn’t have a name.’ Dustfinger responded to her gaze with unconcealed dislike. ‘I expect it had one once, but the name was already forgotten before Capricorn settled there. You won’t find it on this map, or any other either. To the rest of the world the village is just a collection of tumbledown houses reached along what can hardly be called a road.’\u003c/p\u003e\n\u003cp\u003e‘Hmm.’ Elinor bent closer to the map. ‘I’ve never been in that region. I was in Genoa once. I bought a very fine edition of Alice in Wonderland there, in good condition and for half what it was worth.’ She looked enquiringly at Meggie. ‘Do you like Alice in Wonderland?’\u003c/p\u003e\n\u003cp\u003e‘Not particularly,’ said Meggie, staring at the map. Elinor shook her head at such childish folly, and turned back to Dustfinger.\u003c/p\u003e\n\u003cp\u003e‘What does this Capricorn do when he’s not stealing books and abducting people’s fathers?’ she asked. ‘If I understand Meggie correctly, you know him pretty well.’\u003c/p\u003e\n\u003cp\u003eDustfinger avoided her eyes and ran his finger along a blue river winding its way through the green and pale brown of the map. ‘We come from the same place,’ he said. ‘But apart from that we don’t have much in common.’\u003c/p\u003e\n\u003cp\u003eElinor looked at him so penetratingly that Meggie would not have been surprised to see a hole suddenly appear in his forehead. ‘There’s one thing that strikes me as strange,’ she said. ‘Meggie’s father wanted to keep Inkheart safe from this Capricorn. So why bring the book here to me? He was practically running into Capricorn’s arms!’\u003c/p\u003e\n\u003cp\u003eDustfinger shrugged his shoulders. ‘Well, perhaps he just thought your library would be the safest hiding-place.’\u003c/p\u003e\n\u003cp\u003eA memory stirred in Meggie’s mind. At first, she couldn’t identify it, but then it all came flooding back to her, perfectly clearly, as vivid as a picture in a book. She saw Dustfinger standing beside their camper van at the gate of the farmhouse, and it was almost as if she heard his voice again …\u003c/p\u003e\n\u003cp\u003eShe looked at him in horror. ‘You told Mo that Capricorn was in the north!’ she said. ‘He specially asked, and you said you were sure of it.’\u003c/p\u003e\n\u003cp\u003eDustfinger examined his fingernails.\u003c/p\u003e\n\u003cp\u003e‘Well, yes … yes, that’s right,’ he admitted, without looking at Meggie or Elinor. He just went on staring at his nails. Finally, he rubbed them on his sweater as if to remove an ugly mark. ‘You don’t trust me,’ he said hoarsely, still without looking at them. ‘Neither of you trust me. I—I can understand that, but I wasn’t lying. Capricorn has two main headquarters, and several smaller hideouts in case things get too hot for him, or one of his men needs to disappear for a while. He usually spends the summer months in the north and doesn’t come south until October, but this year he’s obviously spending the summer down in the south. How would I know why? Perhaps he had trouble with the police in the north? Perhaps he has business of some kind in the south and wants to see to it personally?’ His voice sounded injured, like the voice of a child unjustly accused. ‘In any case, his men drove south with Meggie’s father, I saw them go myself, and when Capricorn is in the south he always does anything of importance in that village. He feels safe in it, safer than anywhere else. He’s never had any trouble with the police there, he can act like a king, as if the whole world belonged to him. He makes the laws, he decides what happens, he can do or not do anything he likes. His men take care of that. Believe you me, I understand these things.’ Dustfinger smiled. It was a bitter smile. It seemed to be saying: if only you knew! But you don’t know anything. You don’t understand anything.\u003c/p\u003e\n\u003cp\u003eMeggie felt unease spread through her again. It was not caused by what Dustfinger said, but by what he wasn’t saying. Nothing is more frightening than a fear you cannot name.\u003c/p\u003e\n\u003cp\u003eElinor seemed to be feeling the same. ‘For heaven’s sake, don’t make such a mystery of it!’ she snapped. ‘I’m asking you again, what does this Capricorn do? How does he earn his money?’\u003c/p\u003e\n\u003cp\u003eDustfinger crossed his arms. ‘You won’t get any more information out of me. Ask him yourself. Even taking you to his village could cost me dear, so am I going to tell you about Capricorn’s business? Not likely!’ He shook his head. ‘I warned Meggie’s father. I advised him to take Capricorn the book of his own free will, but he wouldn’t listen. If I hadn’t warned him, Capricorn’s men would have found him much sooner. Ask Meggie! She was there when I warned him. Right, I didn’t tell him everything I knew. So what? I talk about Capricorn as little as possible, I try not even to think of him, and you take my word for it, once you know him you’ll feel the same.’\u003c/p\u003e\n\u003cp\u003eElinor wrinkled her nose as if such an idea were too ridiculous for her to waste a single word on it. ‘So I assume you can’t tell me why he’s so keen to get hold of this book?’ she asked, folding up the road map. ‘Is he some kind of collector?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/inkheart-inkworld-1/page-21.html","bookId":2719,"creation":"Oct 5, 2019 3:38:15 PM","modification":"Oct 5, 2019 3:38:15 PM"}
