{"id":64108,"no":14,"title":"Page 14","content":"\u003cp\u003e“Perfect, Love. Are your injuries smarting at all?”\u003c/p\u003e\n\u003cp\u003e“Not a bit. She has such a smooth walk.”\u003c/p\u003e\n\u003cp\u003e“Yes. She’s my best mare. A real prize. Do you feel up to trying to trot?”\u003c/p\u003e\n\u003cp\u003eI nodded, already wanting to move faster.\u003c/p\u003e\n\u003cp\u003e“Walk her to me.”\u003c/p\u003e\n\u003cp\u003eI did, and she obeyed perfectly. James patted her coat, then rubbed his hand up my leg, smiling. “We’re going to start with posting. This is where you will lift from the horse for one beat, then sit on the next, as she trots. Do you understand?”\u003c/p\u003e\n\u003cp\u003eI shook my head. I had not a clue.\u003c/p\u003e\n\u003cp\u003eHe put a hand on my butt, the other on my hip. He pushed lightly, and I stood slightly in the stirrups at his touch.\u003c/p\u003e\n\u003cp\u003e“You’ll move with her movement, up and down like this.”\u003c/p\u003e\n\u003cp\u003eHe pushed me back down.\u003c/p\u003e\n\u003cp\u003e“It’s rather like being on top when you have sex,” he said with a grin. “Just pretend you’re making love to the saddle.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTEEN\u003c/p\u003e\n\u003cp\u003eI blinked at him, wondering if he was being perverted and funny, or perverted and serious.\u003c/p\u003e\n\u003cp\u003eHe grinned wickedly. “That’s right. You wouldn’t know about being on top. I’ll have to let you ride me later, then I can really demonstrate what I’m trying to explain. In the meantime, move all the way forward in the saddle, and keep your feet deep in the stirrups, okay?”\u003c/p\u003e\n\u003cp\u003eI nodded, obeying carefully.\u003c/p\u003e\n\u003cp\u003eI yelped in surprise as he vaulted up behind me. Princess shied a little, taking several steps back, but he had her stilling as he commanded her to in a soothing tone. He pressed in close behind me, and I felt his obvious arousal.\u003c/p\u003e\n\u003cp\u003eI shot him an arch look over my shoulder. “Are you always hard?”\u003c/p\u003e\n\u003cp\u003eHe gave a little shrug. “I can’t watch you straddle something and grind yourself against it and not get turned on. So sue me.” He gripped my hips tight, grinding against me from behind.\u003c/p\u003e\n\u003cp\u003eI glanced down at our legs. His dangled behind mine with no stirrups. He somehow made the precarious position look natural.\u003c/p\u003e\n\u003cp\u003eHe slapped my ass lightly. “Pay attention,” he commanded. “Look forward and correct your seat.”\u003c/p\u003e\n\u003cp\u003eI wriggled, trying to obey. It was challenging with an aroused James grinding into me. “You’re in the way. Or rather, your cock is.”\u003c/p\u003e\n\u003cp\u003eHe laughed, rubbing against me. “You’ll have to manage to ignore it. I’m up here to show you the rhythm. Like this.” He lifted my hips, then lowered them, clicking the horse into the trot. I supposed it was a lot like being on top. Princess trotted up and down, up and down, and James moved me with her momentum.\u003c/p\u003e\n\u003cp\u003eHe was, of coarse, using the demonstration to his advantage, grinding against me every time I touched back down on the saddle. “You could go even higher, and it would still be a good trot. Try it.”\u003c/p\u003e\n\u003cp\u003eI did, and the exaggerated motion felt even more natural to me.\u003c/p\u003e\n\u003cp\u003e“Okay, now sit deep in the saddle and lean back a bit. We’re going to try a sitting trot next. You’ll keep in the saddle and just move with her. It’s a lot like learning to canter, so you’ll be prepared when I start teaching you that.”\u003c/p\u003e\n\u003cp\u003eI did as he instructed, and found the sitting trot a little more challenging. James leaned his chest against my back, hands on my hips. “Just move with her. Accept her rhythm and relax. Yes, perfect, Love.”\u003c/p\u003e\n\u003cp\u003eHe leaned in, whispering roughly in my ear. “I’m going to fuck you on horseback soon. You’re going to straddle me while I ride, and we can fuck to this rhythm. It’s gonna be so hard and rough that you’ll be sore when we’re done. Would you like that?”\u003c/p\u003e\n\u003cp\u003eMy mind went a little hazy and soft at his visual. “Yes. Can we do that?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes. But not on Princess. We’ll take my stallion, Devil. He’s a huge beast of a horse, more than up to the task.”\u003c/p\u003e\n\u003cp\u003eHis hand moved to my breast as he spoke, cupping it softly, his fingers finding my nipple as it hardened in response.\u003c/p\u003e\n\u003cp\u003eIt was hard for me to focus after that, and James didn’t help, caressing me every time he corrected me.\u003c/p\u003e\n\u003cp\u003eHe called a halt to the lesson some time later. I was aching and needy by then, the last half of the lesson a blur of sensual teasing.\u003c/p\u003e\n\u003cp\u003e“You’re a tease,” I told him, my tone breathless.\u003c/p\u003e\n\u003cp\u003eHe hopped off the back of my horse in a smooth motion. He met my gaze with raised brows. “That’s a silly thing to say, when I’m about to make you come over and over again. Let’s work on your dismount.\u003c/p\u003e\n\u003cp\u003eSwing your other leg over.”\u003c/p\u003e\n\u003cp\u003eI did, standing on just one side of the horse.\u003c/p\u003e\n\u003cp\u003eHe grabbed me, pulling me down the rest of the way. “She’s too tall. You’ll need a mounting block if I’m not here to lift you. My horses are particularly tall breeds, for the most part. With those long legs of yours, though, you’d be able to mount almost any other kind of horse from the ground.” He spoke into my ear after he’d lowered me, pressing into my back. He made the words sound dirty, even though they weren’t. The man could make anything sound dirty.\u003c/p\u003e\n\u003cp\u003eHe caressed my breasts from behind, kissing and sucking on my neck. ”We’re going to fuck like animals in the horse stalls, and you’re going to love it.”\u003c/p\u003e\n\u003cp\u003eI gasped. “Aren’t there people around? Working?”\u003c/p\u003e\n\u003cp\u003e“I dismissed them all before I found you. I plan to make love to you in as many areas of this ranch as we can in one trip.”\u003c/p\u003e\n\u003cp\u003eI licked my lips. He’d never used the term make love before. I found it peculiar that he would do so now. “Make love? Isn’t what we do called fucking?” I asked him.\u003c/p\u003e\n\u003cp\u003e“Why can’t it be both?” James growled against me.\u003c/p\u003e\n\u003cp\u003eI didn’t have an answer for that. Instead, I thought of another question. The question embarrassed me, but I asked it anyways. My curiosity always seemed to win out on my pride where James was concerned. “How many women have you brought to this ranch?”\u003c/p\u003e\n\u003cp\u003e“Just you, Bianca. I usually come here to get some peace. The only properties I’ve ever brought women to were my New York and Vegas homes. Do you want me to buy new beds and such at those homes?\u003c/p\u003e\n\u003cp\u003eWould that make you feel more comfortable?”\u003c/p\u003e\n\u003cp\u003eI thought he might be crazy, not for the first time. “Are you offering to get rid of anything in your homes that you might have used to fuck other women?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I assume everything’s been cleaned thoroughly?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Well, then that would be wasteful, and silly. Those beds have to be ungodly expensive.”\u003c/p\u003e\n\u003cp\u003e“I think the fact that you didn’t answer is an answer in itself,” he murmured.\u003c/p\u003e\n\u003cp\u003eI elbowed him softly. “Your beds look like works of art. I wouldn’t want you to get rid of them. I like them. How often do you get new beds just to humor a girl?”\u003c/p\u003e\n\u003cp\u003eHe bit me hard enough to make me yelp. “There you go, belittling us again. You must know by now that I’ve never done any of this for anyone else. I was a slut once with my body, but I’ve never been a slut with my heart.”\u003c/p\u003e\n\u003cp\u003eHe swung me into his arms suddenly, cradling me. “How are your injuries?”\u003c/p\u003e\n\u003cp\u003eI was surprised to realize that I had forgotten about them completely. “Good. Great.”\u003c/p\u003e\n\u003cp\u003e“Good. We’ll go take one of the trails tomorrow, with Princess and Devil.” As he spoke, he carried me into an empty stall. I realized that he’d been serious about where we were going to fuck. I shouldn’t have been surprised. He seemed to be a man of his word. Even when he said something I thought was a complete joke, he’d always followed through, so far. I tried not to linger on that thought, since he’d said some pretty outrageous things in just the last day.\u003c/p\u003e\n\u003cp\u003eHe set me down. “Take off your helmet. And your pants,.” he ordered, leaving the stall.\u003c/p\u003e\n\u003cp\u003eI obeyed, feeling very odd undressing in a horse stall.\u003c/p\u003e\n\u003cp\u003eHe returned with a huge blanket, laying it on a thick pile of hay. I was just getting to my actual pants, having to first remove my chaps and boots. He lounged on his back on the blanket, peeling off his shirt.\u003c/p\u003e\n\u003cp\u003eHe left his pants on, just pulling his breeches down to expose his hard length.\u003c/p\u003e\n\u003cp\u003e“Come ride me,” he ordered, his tone casual. “I want to see what you learned today.”\u003c/p\u003e\n\u003cp\u003eI approached his lounging figure, placing my feet on either side of his hips and lowering myself to my knees. I felt almost more exposed than I did when I was completely naked, with just my bottom half bare.\u003c/p\u003e\n\u003cp\u003e“Sit on my cock. I want to feel you. Now,” he said roughly when I hesitated.\u003c/p\u003e\n\u003cp\u003eI complied, lowering myself slowly, guiding him to my entrance with my hand. I impaled myself, inch by thick inch, shuddering as I did so. All of his teasing caresses had left me more than wet enough to accommodate his entrance.\u003c/p\u003e\n\u003cp\u003e“Good,” he said, when I’d seated myself to the hilt. “Now fix your seat and post.”\u003c/p\u003e\n\u003cp\u003eI thought he might be joking. I just couldn’t tell, but I did it nevertheless. I positioned my knees for best leverage, put my shoulders back, arched my back, and began to post. I moved up and forward, then down and back in big motions. I moved until only his tip was inside of me, then pushed back down in a jerky motion.\u003c/p\u003e\n\u003cp\u003eI rode him for long minutes, working myself more slowly towards my climax than James usually did.\u003c/p\u003e\n\u003cp\u003eMy hands stroked over his magnificent chest covetously as I rode. It felt so good, unbelievably good, but when he was in control, it just did something for me that nothing else could. I watched him as I posted.\u003c/p\u003e\n\u003cp\u003eHe had his hands folded behind his head in a casual pose, his lids heavy, watching me. I thought that this position must not quite be his preferred method, either.\u003c/p\u003e\n\u003cp\u003e“You’re bored,” I accused him, still moving, my voice a gasp.\u003c/p\u003e\n\u003cp\u003eHe grinned, a wicked grin. I clenched around him just looking at it.\u003c/p\u003e\n\u003cp\u003e“Never. I would love to do this all day. It just so happens that I also could. It’s a lot easier for me to keep from coming when you’re in control. I’m sure I don’t have to explain why to you.”\u003c/p\u003e\n\u003cp\u003eHe didn’t. What his control did for me, it did for him as well. In bed, we couldn’t have been more perfect for each other.\u003c/p\u003e\n\u003cp\u003e“Your post is extraordinary, Love. Especially considering your inexperience. Now for the sitting trot,”\u003c/p\u003e\n\u003cp\u003e“Seat yourself to the hilt,” he instructed.\u003c/p\u003e\n\u003cp\u003eI did it on a gasp.\u003c/p\u003e\n\u003cp\u003e“Now just enjoy the ride.” He smiled, and took over the movement, bucking me up and down, his hands gripping my thighs. I caught his rhythm, but that was all. He was on the bottom, but he had suddenly taken all of the control. It was all that I needed.\u003c/p\u003e\n\u003cp\u003eI climaxed within seconds, crying out loudly enough to disturb any horses left in the stables. I started to go limp.\u003c/p\u003e\n\u003cp\u003eJames slapped my ass, hard. “Keep your seat. I’m not done with you.”\u003c/p\u003e\n\u003cp\u003eAnd he wasn’t. He worked me from below for long minutes, grabbing my hips and thrusting up, again and again. He was so tireless. Like a machine, I thought, as he bucked high, bouncing me with the force.\u003c/p\u003e\n\u003cp\u003eMy head fell back, my hands clutching his on my hips. I couldn’t reach anything else at that point in the wild ride. He reached up to pinch a nipple hard enough to bring tears to my eyes. My gaze went to his.\u003c/p\u003e\n\u003cp\u003e“Don’t look away. I need to see your eyes as you fall to pieces.” His voice was a harsh growl, his breathing heavy. \u003c/p\u003e","sourceLink":"https://allnovel.net/mile-high-up-in-the-air-2/page-14.html","bookId":1927,"creation":"Oct 5, 2019 9:53:32 AM","modification":"Oct 5, 2019 9:53:32 AM"}
