{"id":64096,"no":2,"title":"Page 2","content":"\u003cp\u003e“Okay. We’ll make it a foursome. Murphy will no doubt have an opinion on where to eat,” Damien said cheerfully. His attitude reassured me. I’d been half-worried he was trying to corner me into some kind of a date.\u003c/p\u003e\n\u003cp\u003eWe found the other two men chatting with each other in our crew hotel’s large, crowded bar. Everyone agreed on the Cuban restaurant easily enough. It did have killer food.\u003c/p\u003e\n\u003cp\u003eWe split up to change for dinner, meeting back in the lobby twenty minutes later. I just threw on some shorts and a tank top.\u003c/p\u003e\n\u003cp\u003eWe walked to the restaurant, the men joking constantly, making me laugh. They really were good company.\u003c/p\u003e\n\u003cp\u003eI ordered black bean soup and rice at the restaurant. It was a simple, if fattening, meal. I didn’t care. It was my version of comfort food. I gorged myself, as I rarely did. I even ordered a second order of the meal to go. It was a great breakfast, if you added orange juice. I did, grabbing a carton from the mini- mart a block away from the hotel.\u003c/p\u003e\n\u003cp\u003eStephan carried everything for me without a word. Awkward as it was between us, he was still a gentleman to his core. His unusual mormon upbringing had ingrained in him a need to shelter me that I’d never been able to talk him out of. I accepted him too much to even try at this point. I just thanked him when he unburdened me of the bags.\u003c/p\u003e\n\u003cp\u003eUnexpectedly, he gripped my hand as we walked. I squeezed his hand back instantly. I couldn’t stand distance between us.\u003c/p\u003e\n\u003cp\u003e“Are you mad at me?” I asked him. We walked just a few feet in front of Murphy and Damien, so I pitched my voice very low.\u003c/p\u003e\n\u003cp\u003eHe sent me a wide-eyed, surprised look. “Of course not, Buttercup. I’m terrified that you’re angry with me for keeping in contact with James.”\u003c/p\u003e\n\u003cp\u003eI squeezed his hand again. “No. I understand very well how hard it is to ignore that man. He is persistent. I was just worried that you were mad at me for keeping you away from Melvin this week.”\u003c/p\u003e\n\u003cp\u003eHis mouth tightened. “Not at all. I’ve come to realize that Melvin isn’t relationship material. He admitted to hooking up with another guy last week, even though we had said we were going to take it slow, but be exclusive. And I also think he tried to talk to the press about you and I. I feel bad that my judgement was so off about him. I was so attracted at first that I just saw what I wanted to see. You know what I mean?”\u003c/p\u003e\n\u003cp\u003eI cringed. “Sadly, I know exactly what you mean,” I said, thinking of James.\u003c/p\u003e\n\u003cp\u003eHe shook his head, giving my hand a little squeeze. “James isn’t the same as Melvin, Bee. I’m sure of it. I just wish you could see it, too.”\u003c/p\u003e\n\u003cp\u003eI just gave him a look. It was my ‘drop it’ look.\u003c/p\u003e\n\u003cp\u003eMurphy and Damien wanted to go bar hopping on South Beach.\u003c/p\u003e\n\u003cp\u003eI declined their invitation quickly. Stephan followed suit. Murphy turned to his phone, texting the rest of our crew. We had seen the three other flight attendants at the pool briefly earlier, but they seemed to be a room-bound lot for the evening. Murphy looked crestfallen. An antisocial crew was his worst nightmare.\u003c/p\u003e\n\u003cp\u003e“A movie? There’s a theatre less than ten minutes away.”\u003c/p\u003e\n\u003cp\u003eStephan sent me a questioning look.\u003c/p\u003e\n\u003cp\u003eI just shrugged. What I wanted was to go to my room and crawl under my covers until morning, but I knew I would just drive myself crazy if I went that route. A movie seemed the lesser evil.\u003c/p\u003e\n\u003cp\u003e“Okay. Just let me a grab a sweatshirt. I always get cold in that theatre,” I agreed finally.\u003c/p\u003e\n\u003cp\u003eMy room was down the hall from Stephan’s. Unfortunately, the hotel hadn’t been able to accommodate us with adjoining rooms, as we preferred.\u003c/p\u003e\n\u003cp\u003eHe handed me my bags of food and juice as we split up. I put the food in my mini-fridge, and grabbed a sweatshirt from my suitcase.\u003c/p\u003e\n\u003cp\u003eI set my phone on the end table by my bed, plugging it in to charge. Reluctantly, I turned it on. I was just intending to set my alarm for the morning, then leave the phone in my room, charging.\u003c/p\u003e\n\u003cp\u003eThere were several missed texts and calls. There always were, lately. Most were from James, of course, though a few were from other friends, and a few were from a strange Vegas 702 number that kept popping up lately. I wondered briefly who that strange number could be, as it kept showing up more and more in my missed call log. I’d even taken the call once, though there’d just been a few seconds of background noise followed by an abrupt hangup.\u003c/p\u003e\n\u003cp\u003eMy mind changed courses when, in a sudden total loss of self-control, I checked my latest missed text. I wasn’t at all surprised to see that it was from James, but my heart still skipped a beat just seeing his name.\u003c/p\u003e\n\u003cp\u003eJames: Just checking in to see how you’re doing. I miss you.\u003c/p\u003e\n\u003cp\u003eI was texting back before I could stop myself.\u003c/p\u003e\n\u003cp\u003eBianca: Doing fine. Please stop worrying about me. Just hanging out with the crew. Hope things are well with you.\u003c/p\u003e\n\u003cp\u003eHe responded immediately.\u003c/p\u003e\n\u003cp\u003eJames: Well enough. I’ll be in London for most of next week, so please don’t skip out on New York again just to avoid me. When can I see you again?\u003c/p\u003e\n\u003cp\u003eMy heart ached with longing at just the thought of seeing him, but my heart wasn’t doing a good job of steering me in the right direction lately.\u003c/p\u003e\n\u003cp\u003eBianca: I need more time. I’m sorry. I just seem to lose all self-control when I get near you. I need to get myself grounded again.\u003c/p\u003e\n\u003cp\u003eJames: We can meet however you want. You make the terms. I would agree to anything, just to see you for five minutes. I mean that literally. I could meet up with your crew or we could meet up for coffee. Just tell me what you want and I’ll do it. I’m desperate to see you.\u003c/p\u003e\n\u003cp\u003eI swallowed, feeling at sea. How I wanted to see him, even if only for five minutes. I should be able to control myself, if it were only five minutes… Bianca: Let me think about it. You know my schedule. Let me know when we’re in the same city and I’ll try to find a brief, neutral way that we can meet up.\u003c/p\u003e\n\u003cp\u003eJames: Don’t tempt me so, Love. I’ll be on a plane in thirty minutes if you really mean that.\u003c/p\u003e\n\u003cp\u003eMy gut clenched.\u003c/p\u003e\n\u003cp\u003eBianca: Don’t do that. I meant if your schedule takes you to the same city. Please don’t travel on my account.\u003c/p\u003e\n\u003cp\u003eJames: I need to take a business trip to Vegas soon. I’d like to see you when I’m there. Tell me the time and place and I’ll work my schedule around it.\u003c/p\u003e\n\u003cp\u003eBianca: Stephan and I are meeting up with some friends a week from monday. We haven’t decided on a time or place, but I’ll let you know when we do. You can join us if you want.\u003c/p\u003e\n\u003cp\u003eJames: I very much want. Give me the details when you have them. I’ll count the days, my love.\u003c/p\u003e\n\u003cp\u003eI turned my phone off after that.\u003c/p\u003e\n\u003cp\u003eWe all met back up in the lobby. I was the last to arrive. I felt bad that I had made them all wait, but no one seemed to mind.\u003c/p\u003e\n\u003cp\u003eThey were having a good-natured argument about whether we should walk or share a taxi.\u003c/p\u003e\n\u003cp\u003eI wrinkled my nose at Murphy, who seemed to think it was worth it to take a taxi the short distance.\u003c/p\u003e\n\u003cp\u003e“It’s less than a mile,” I told him. “It’s a waste of money. Especially since it’s so nice out.”\u003c/p\u003e\n\u003cp\u003eDamien poked Murphy’s oversized belly. “It seems like you could use a walk, mate.”\u003c/p\u003e\n\u003cp\u003eMurphy poked Damien’s belly. “Don’t foist your body image issues on me, mate. I’m sexy. When I want a six pack, I go to the liquor store. It’s a hell of a lot more fun than spending three hours a day at the gym, like Mr. Universe here.”\u003c/p\u003e\n\u003cp\u003eWe all laughed.\u003c/p\u003e\n\u003cp\u003eMurphy saw that he was outvoted, so we walked.\u003c/p\u003e\n\u003cp\u003eThe walk was pleasant, but once there, we had a hard time deciding on what to see. For some odd reason, the pilots were insisting on a romantic comedy. Stephan and I wanted to see a newly released Sci-Fi horror flick. I didn’t like romantic comedies as a rule, but I particularly refused to see the one they were pointing out. It was starring a young red-headed actress whom I’d seen photographed with James.\u003c/p\u003e\n\u003cp\u003eIf I watched the movie, I knew I’d just obsess about him and get depressed all over again. When I suggested that we just watch two different movies, the pilots finally caved.\u003c/p\u003e\n\u003cp\u003e“But if I get nightmares after this, Damien is getting a roommate tonight. I am always the big spoon. No exceptions,” Murphy warned.\u003c/p\u003e\n\u003cp\u003eStephan and I laughed, but Damien just gave him a disgruntled look, as though he was genuinely worried Murphy would try it. That look just made me laugh harder.\u003c/p\u003e\n\u003cp\u003eI thought the movie was great, but Murphy didn’t agree. “That scene where that chick cut the alien out of her…I can’t stop seeing that in my head. I’m going to be scarred for life now. You guys owe me for that.\u003c/p\u003e\n\u003cp\u003eI’m making you all watch a lighthearted comedy next time,” Murphy threatened as we walked back to the hotel.\u003c/p\u003e\n\u003cp\u003eDark had fallen while we watched the movie, but the streets were well-lit and many people still walked along the popular street.\u003c/p\u003e\n\u003cp\u003eI noticed that Stephan had tensed up, and I followed his stare to a man taking pictures of us. I held his arm firmly, continuing to walk. Stephan looked about ready to punch the guy.\u003c/p\u003e\n\u003cp\u003e“We’re going to have to just learn to ignore that sort of thing,” I told him quietly. “We can’t stop them from taking pictures, and we can’t control what they say, so ignoring them is our only recourse.”\u003c/p\u003e\n\u003cp\u003eHe gave me an assessing glance. “Maybe you are suited to James’s lifestyle. It’s pretty impressive that you’re already accustomed to the paparazzi, considering that you’ve only been dealing with them for a few weeks.”\u003c/p\u003e\n\u003cp\u003eI gave my little shrug. “It’s not the end of the world. I could do without all of the horrible things they’ll print along with the pictures, but I really just need to learn to stop reading it. It’s all garbage. Before I dated James, I never would have even glanced at any of it. I need to get back to that mindset.”\u003c/p\u003e\n\u003cp\u003eStephan nodded firmly. “Me, too. I have Google alerts on you and James now. I need to quit torturing myself. It’s not like we can stop any of it.”\u003c/p\u003e\n\u003cp\u003e“If you see me looking up garbage gossip sites online, you need to stop me. This has gotten out of hand.”\u003c/p\u003e\n\u003cp\u003e“Ditto, Buttercup.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THREE\u003c/p\u003e\n\u003cp\u003eThe days passed slowly, as I looked forward to seeing James. Despite my reservations, I almost called him to arrange a meeting sooner several times.\u003c/p\u003e\n\u003cp\u003eIn the end, I had hardly any contact with James, only texting him briefly the Sunday before I was due to see him. I just told him where everyone had decided to meet. It was a work affair that I wasn’t particularly enthused about attending. But Stephan wouldn’t go anywhere without me lately, and I was tired of keeping him home. I knew he loved to go out, so I had agreed to attend the work party almost two weeks before.\u003c/p\u003e\n\u003cp\u003eBianca: We’re meeting at 6pm at The Dime Lounge. It’s just off of the strip, on the east side of Tropicana. It’s going to be a lot of flight attendants and pilots.\u003c/p\u003e\n\u003cp\u003eJames: I’ll be there.\u003c/p\u003e\n\u003cp\u003eI started getting ready at 3:30, which was early for me. Giving myself more than an hour to get ready was unusual, so taking over two hours meant that I was nervous. Nervous and excited.\u003c/p\u003e\n\u003cp\u003eIt took me an uncharacteristically long time to choose an outfit. I finally settled on a black mini-skirt that showed a lot of leg. I paired it with a sleeveless black button-up silk top that showed a tasteful but generous hint of cleavage. The all-black outfit put me in the mood for some loud shoes, so I dug out a pair of wedge sandals that were a bright mix of colors that didn’t go with anything but black. They were a mix of orange, yellow, pink and blue that made me smile. They laced up my ankles in wide satin ribbons, and I tied them in neat little bows there. I never got a chance to wear the impulsive purchase, and I was pleased with the overall look of the outfit. \u003c/p\u003e","sourceLink":"https://allnovel.net/mile-high-up-in-the-air-2/page-2.html","bookId":1927,"creation":"Oct 5, 2019 9:53:32 AM","modification":"Oct 5, 2019 9:53:32 AM"}
