{"id":64135,"no":41,"title":"Page 41","content":"\u003cp\u003e“Of course,” I answered without hesitation.\u003c/p\u003e\n\u003cp\u003e“See. I told you she would. Three hours, tops, and I’ll take you again. I’m not that much of a tease,”\u003c/p\u003e\n\u003cp\u003eStephan said in a low voice to Javier. It made me blush down to my toes, but I stayed alertly watching out the window.\u003c/p\u003e\n\u003cp\u003e“You are a tease,” Javier muttered, sounding sullen. “Three hours is forever.”\u003c/p\u003e\n\u003cp\u003eI spotted the pilots in the lobby. “Pilots incoming,” I said, sounding a little panicked even to my own ears.\u003c/p\u003e\n\u003cp\u003eStephan sat up, releasing Javier. I glanced back at Stephan. He grinned at me shamelessly. I couldn’t help it. I grinned back. Javier looked more perturbed but still happy. His blush was like a happy glow around him. His words hadn’t shown me that, but his face did. He gave me a shy smile. “Sorry,” he muttered to me.\u003c/p\u003e\n\u003cp\u003eI smiled back. “Don’t be sorry. I’ve never seen Stephan like this. I think you guys are beautiful together.”\u003c/p\u003e\n\u003cp\u003eThat made him truly glow. Javier had it bad. It took one to know one, and I knew that lovesick look because a certain Mr. Beautiful had the same effect on me. I was relieved to see it. I wanted Javier to feel that kind of love for Stephan. He wouldn’t want to hurt someone he loved that much.\u003c/p\u003e\n\u003cp\u003e“Quit making him blush, Bianca. That’s my job,” Stephan said, ruffling Javier’s hair affectionately.\u003c/p\u003e\n\u003cp\u003eSure enough, Javier blushed harder.\u003c/p\u003e\n\u003cp\u003eI turned around, shaking my head with a strange smile on my face. I had never seen this side of Stephan, didn’t know he had it in him.\u003c/p\u003e\n\u003cp\u003eThe Saturday morning flight into Vegas was hectic, as it always was. Stephan took his ten minutes with the meeting with Javier in the bathroom that I had expected. Both men emerged looking flushed and happy. We all grinned at each other like fools before Stephan and I got back to work and Javier returned to his seat.\u003c/p\u003e\n\u003cp\u003eStephan and I clutched hands as we landed, grinning at each other. We didn’t say much, just enjoying the moment.\u003c/p\u003e\n\u003cp\u003eI texted James as we taxied in.\u003c/p\u003e\n\u003cp\u003eBianca: Just landed in Vegas. How r u?\u003c/p\u003e\n\u003cp\u003eJames: Fine. Keeping busy with work, but still missing you like crazy.\u003c/p\u003e\n\u003cp\u003eI hesitated, then just said to hell with it.\u003c/p\u003e\n\u003cp\u003eBianca: I miss you too.\u003c/p\u003e\n\u003cp\u003eJames: Call me when you get to your house.\u003c/p\u003e\n\u003cp\u003eI put my phone away after that, since I’d be contacting him again soon enough.\u003c/p\u003e\n\u003cp\u003eThe drive home was a jovial affair, with Stephan and Javier smiling about just about everything. My expression matched theirs. I couldn’t seem to help myself.\u003c/p\u003e\n\u003cp\u003eI was met at my front door by the security guard, Paterson. A woman I’d never met before was standing beside him, looking grim. She was short and stocky, and I knew at a glance that she was a tough woman.\u003c/p\u003e\n\u003cp\u003eShe had dark hair held back in a short, no-nonsense braid. Her face was round and pale, but her eyes were hard and assessing. She didn’t wear a scrap of makeup, I doubted she ever did, and her mouth was set in a grim line.\u003c/p\u003e\n\u003cp\u003eHer body could have been bulky or just big-boned. It was impossible to say with the baggy, short- sleeved mens button-up shirt she was wearing over wide-legged slacks. She was like the agents, in her own way. Just looking at her made you think of law enforcement.\u003c/p\u003e\n\u003cp\u003ePaterson gave me a polite nod as I approached my front door. I could feel Stephan hovering behind me.\u003c/p\u003e\n\u003cp\u003eI didn’t have to ask to know that he wouldn’t leave until he knew I was settled into my house, safe and secure. He had done so ever since the attack.\u003c/p\u003e\n\u003cp\u003e“Ms. Karlsson, this is Blake. She’s new to the team, but I’ve known her for years. She’s the best.\u003c/p\u003e\n\u003cp\u003eShe’ll be your personal bodyguard detail for public excursions. It’s been very clearly brought to my attention that I had overlooked your security in public restrooms.”\u003c/p\u003e\n\u003cp\u003eI flushed, recalling the incident in the restroom. Of course James would take extra measures after that. I should have seen it coming. I nodded to Blake. “Nice to meet you, Blake,” I said. I wouldn’t protest the extra security. I certainly couldn’t argue that I needed it.\u003c/p\u003e\n\u003cp\u003eShe nodded back solemnly. “A pleasure, Ms. Karlsson.”\u003c/p\u003e\n\u003cp\u003eI wondered if I could get her to call me by my first name. I had sort of given up on trying that with the security after Clark. He’d stubbornly refused in spite of my prompting.\u003c/p\u003e\n\u003cp\u003e“Please, allow us to secure the house before you proceed inside,” she said solemnly.\u003c/p\u003e\n\u003cp\u003eI nodded, unlocking the door and going inside to punch in the security code. Both Paterson and Blake sucked in a breath when I stepped into the house first. I saw how I had erred, and apologized. The least I could do for my bodyguards was make it easy for them to do their job. “I’ll get you guys some copies of my keys and give you my security codes to make it easier.”\u003c/p\u003e\n\u003cp\u003ePaterson cleared his throat, but it was Stephan that spoke. “I already did, Bee. I got copies for them, and for James.”\u003c/p\u003e\n\u003cp\u003eI imagined that they were all holding their breath, waiting for me to throw some kind of tantrum, but I wasn’t unreasonable. Stephan might have been a tad premature, but it was only a convenience at this point. “Thank you,” I said. I thought I heard all three of them let out relieved breaths. What has the security team been told about me? I wondered.\u003c/p\u003e\n\u003cp\u003ePaterson and Blake asked me to stay near the front entrance while Blake hovered near me and Paterson did a rather long search of the house. I was too distracted by the new additions to my living room to care much. A Mac with a large screen had taken residence in the spot where my old computer had been. I just stared at it for awhile, blinking, my tired mind blank. “What happened to my old computer?” I asked out loud.\u003c/p\u003e\n\u003cp\u003eStephan answered. “It’s gone. That one has everything you need. I wiped the other one and put everything on this one for you. James asked me to do it so he wouldn’t have to hire a stranger to go through your computer.” His voice held a sheepish apology.\u003c/p\u003e\n\u003cp\u003eI sighed, becoming more and more resigned to James’s constant need to buy me things. “That was nice of you. Thank you.”\u003c/p\u003e\n\u003cp\u003e“You aren’t mad?”\u003c/p\u003e\n\u003cp\u003e“It seems silly to get mad about getting a new computer, doesn’t it? I’m growing accustomed to this sort of thing.” I looked at Stephan as I spoke.\u003c/p\u003e\n\u003cp\u003eHe grinned at me. “It was no trouble at all. James bought me one, too.”\u003c/p\u003e\n\u003cp\u003eI thought of all the things I needed to tell him. There just hadn’t been any time. “I have so much to tell you. Will you come over tonight?” Javier had already gone to Stephan’s house and was waiting for him.\u003c/p\u003e\n\u003cp\u003eThe two men seemed inseparable. “Can we get a little while to talk, just the two of us? Then we could have dinner with Javier, unless you two want to be alone.” It felt awkward to have to request his exclusive company, but I told myself to get used to it.\u003c/p\u003e\n\u003cp\u003eHe gave me a chastising look. “Of course. I’ll come over right after a nap. Just text me when you wake up. And yes, we’ll all have dinner. At my place. I’ll cook. I’ve missed you, Bee. I know I need to get used to it, but just a few days without you is tough. You never have to ask when you want to spend time with me. You give me the time and the place and I’ll be there. Always.”\u003c/p\u003e\n\u003cp\u003eI moved to him, and he opened his arms. I walked right into them, barely aware that we weren’t alone.\u003c/p\u003e\n\u003cp\u003eHis words had touched an emotional chord in me. “Go get some sleep. As you can see, I’m in good hands. I’ll text you when I wake up.”\u003c/p\u003e\n\u003cp\u003eHe kissed the top of my head. “Good night,” he murmured. I walked him to the door.\u003c/p\u003e\n\u003cp\u003eBlake was studying me when I turned back into the room. She quickly schooled her face into a carefully blank expression.\u003c/p\u003e\n\u003cp\u003e“All clear,” Paterson said as he strode back into the room. He addressed me, “If you have any problems, any problems at all, one of us will be right across the street, in a black SUV, at all times.”\u003c/p\u003e\n\u003cp\u003e“I have a spare room. I don’t mind if you guys want to sleep in there. There’s only a twin bed, but it’s better than sleeping in a car.”\u003c/p\u003e\n\u003cp\u003ePaterson and Blake shared a look, but not before I saw the surprise in both of their eyes.\u003c/p\u003e\n\u003cp\u003e“Thank you for the kind offer, Ms. Karlsson,” Blake said.\u003c/p\u003e\n\u003cp\u003e“I’ll discuss it with Mr. Cavendish,” Paterson said.\u003c/p\u003e\n\u003cp\u003eOf course control freak Cavendish would have the rule that he had to approve all decisions.\u003c/p\u003e\n\u003cp\u003ePaterson cleared his throat. “Mr. Cavendish has also asked me to tell you to please answer your phone.” Paterson’s voice was carefully polite, but I’d have been willing to bet that James hadn’t been when he made the request. My phone was buried somewhere in my flight bag and I dreaded seeing how many calls I had missed since I’d left the plane.\u003c/p\u003e\n\u003cp\u003e“Excuse me, please. I need to go take a nap,” I told the two security guards awkwardly. I wasn’t used to having staff, and my first instinct was to treat them as guests in my home.\u003c/p\u003e\n\u003cp\u003eThey both nodded rather deferentially, as though it had been taught to them amidst all of the other training they must have been through. “As I said, we’ll be just outside. And my number is in your phone, under ‘Security.’”\u003c/p\u003e\n\u003cp\u003eI thanked them both politely before I went into my room, shutting my door gratefully behind me. I meant to call James, my mind was on him even as I got half undressed and fell facedown on top of my covers.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-EIGHT\u003c/p\u003e\n\u003cp\u003eA barrage of strange noises woke me up. It took me long disoriented minutes to sort them all out.\u003c/p\u003e\n\u003cp\u003eThe most persistent noise came from my bedside table, in the form of an Ipad I hadn’t even known existed. I recognized the thin object, but I certainly didn’t know what one was doing in my bedroom, or how I hadn’t noticed it before I went to sleep. I had passed out rather quickly, I remembered. It was letting out a loud chiming noise, over and over again.\u003c/p\u003e\n\u003cp\u003eI decided that wasn’t my biggest problem as someone knocked, rather frantically, at my bedroom door. I felt fear curl in my stomach until I realized that any real threat would hardly be knocking at an unlocked door.\u003c/p\u003e\n\u003cp\u003e“Yes?” I called, my voice still full of sleep.\u003c/p\u003e\n\u003cp\u003eThe door burst open and Blake stood framed in it. She had apparently taken my yes as an invitation to enter. Her eyes darted around my room, looking for threats. When she deducted that there was none, her eyes shifted to me. She quickly looked away uncomfortably.\u003c/p\u003e\n\u003cp\u003eI realized that I was basically naked, wearing only a pair of panties and one errant stocking. I had managed to pull a corner of the covers over most of my torso in my sleep, thank god, but it was obvious that I was nearly naked underneath.\u003c/p\u003e\n\u003cp\u003eA muffled sound from my flight bag drew my attention briefly, and a I realized that my phone had been going off constantly, just like the the mysterious Ipad.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” I asked Blake. I figured she had to have a better idea than I did.\u003c/p\u003e\n\u003cp\u003e“Mr. Cavendish has been unable to get ahold of you. He was…concerned. He said you were supposed to contact him when you got to your home, and you did not.” Her voice held a world of condemnation, as though forgetting to make a phone call were the worst sort of offense.\u003c/p\u003e\n\u003cp\u003eI studied her. She wore only a tight navy T-shirt and athletic shorts, her shoulder holster and gun clearly visible. I realized that instead of being stocky, as I’d originally thought, her figure was solidly covered in stark muscles. I couldn’t remember ever seeing a woman quite so ripped up with muscle. She could have been a female body builder. \u003c/p\u003e","sourceLink":"https://allnovel.net/mile-high-up-in-the-air-2/page-41.html","bookId":1927,"creation":"Oct 5, 2019 9:53:32 AM","modification":"Oct 5, 2019 9:53:32 AM"}
