{"id":16134,"no":2,"title":"ACT drop SECOND ACT SCENE","content":"Garden at the Manor House.\u0026nbsp; A flight of grey stone steps leads up to the house.\u0026nbsp; The garden, an old-fashioned one, full of roses.\u0026nbsp; Time of year, July.\u0026nbsp; Basket chairs, and a table covered with books, are set under a large yew-tree.\n\u003cbr\u003e \n\u003cbr\u003e [Miss Prism discovered seated at the table.\u0026nbsp; Cecily is at the back watering flowers.]\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Calling.]\u0026nbsp; Cecily, Cecily!\u0026nbsp; Surely such a utilitarian occupation as the watering of flowers is rather Moulton’s duty than yours?\u0026nbsp; Especially at a moment when intellectual pleasures await you.\u0026nbsp; Your German grammar is on the table.\u0026nbsp; Pray open it at page fifteen.\u0026nbsp; We will repeat yesterday’s lesson.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Coming over very slowly.]\u0026nbsp; But I don’t like German.\u0026nbsp; It isn’t at all a becoming language.\u0026nbsp; I know perfectly well that I look quite plain after my German lesson.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Child, you know how anxious your guardian is that you should improve yourself in every way.\u0026nbsp; He laid particular stress on your German, as he was leaving for town yesterday.\u0026nbsp; Indeed, he always lays stress on your German when he is leaving for town.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Dear Uncle Jack is so very serious!\u0026nbsp; Sometimes he is so serious that I think he cannot be quite well.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Drawing herself up.]\u0026nbsp; Your guardian enjoys the best of health, and his gravity of demeanour is especially to be commended in one so comparatively young as he is.\u0026nbsp; I know no one who has a higher sense of duty and responsibility.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I suppose that is why he often looks a little bored when we three are together.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Cecily!\u0026nbsp; I am surprised at you.\u0026nbsp; Mr. Worthing has many troubles in his life.\u0026nbsp; Idle merriment and triviality would be out of place in his conversation.\u0026nbsp; You must remember his constant anxiety about that unfortunate young man his brother.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I wish Uncle Jack would allow that unfortunate young man, his brother, to come down here sometimes.\u0026nbsp; We might have a good influence over him, Miss Prism.\u0026nbsp; I am sure you certainly would.\u0026nbsp; You know German, and geology, and things of that kind influence a man very much.\u0026nbsp; [Cecily begins to write in her diary.]\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Shaking her head.]\u0026nbsp; I do not think that even I could produce any effect on a character that according to his own brother’s admission is irretrievably weak and vacillating.\u0026nbsp; Indeed I am not sure that I would desire to reclaim him.\u0026nbsp; I am not in favour of this modern mania for turning bad people into good people at a moment’s notice.\u0026nbsp; As a man sows so let him reap.\u0026nbsp; You must put away your diary, Cecily.\u0026nbsp; I really don’t see why you should keep a diary at all.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I keep a diary in order to enter the wonderful secrets of my life.\u0026nbsp; If I didn’t write them down, I should probably forget all about them.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Memory, my dear Cecily, is the diary that we all carry about with us.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, but it usually chronicles the things that have never happened, and couldn’t possibly have happened.\u0026nbsp; I believe that Memory is responsible for nearly all the three-volume novels that Mudie sends us.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Do not speak slightingly of the three-volume novel, Cecily.\u0026nbsp; I wrote one myself in earlier days.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Did you really, Miss Prism?\u0026nbsp; How wonderfully clever you are!\u0026nbsp; I hope it did not end happily?\u0026nbsp; I don’t like novels that end happily.\u0026nbsp; They depress me so much.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; The good ended happily, and the bad unhappily.\u0026nbsp; That is what Fiction means.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I suppose so.\u0026nbsp; But it seems very unfair.\u0026nbsp; And was your novel ever published?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Alas! no.\u0026nbsp; The manuscript unfortunately was abandoned.\u0026nbsp; [Cecily starts.]\u0026nbsp; I use the word in the sense of lost or mislaid.\u0026nbsp; To your work, child, these speculations are profitless.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Smiling.]\u0026nbsp; But I see dear Dr. Chasuble coming up through the garden.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Rising and advancing.]\u0026nbsp; Dr. Chasuble!\u0026nbsp; This is indeed a pleasure.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Canon Chasuble.]\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; And how are we this morning?\u0026nbsp; Miss Prism, you are, I trust, well?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Miss Prism has just been complaining of a slight headache.\u0026nbsp; I think it would do her so much good to have a short stroll with you in the Park, Dr. Chasuble.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Cecily, I have not mentioned anything about a headache.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; No, dear Miss Prism, I know that, but I felt instinctively that you had a headache.\u0026nbsp; Indeed I was thinking about that, and not about my German lesson, when the Rector came in.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; I hope, Cecily, you are not inattentive.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, I am afraid I am.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; That is strange.\u0026nbsp; Were I fortunate enough to be Miss Prism’s pupil, I would hang upon her lips.\u0026nbsp; [Miss Prism glares.]\u0026nbsp; I spoke metaphorically.—My metaphor was drawn from bees.\u0026nbsp; Ahem!\u0026nbsp; Mr. Worthing, I suppose, has not returned from town yet?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; We do not expect him till Monday afternoon.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Ah yes, he usually likes to spend his Sunday in London.\u0026nbsp; He is not one of those whose sole aim is enjoyment, as, by all accounts, that unfortunate young man his brother seems to be.\u0026nbsp; But I must not disturb Egeria and her pupil any longer.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Egeria?\u0026nbsp; My name is L?titia, Doctor.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; [Bowing.]\u0026nbsp; A classical allusion merely, drawn from the Pagan authors.\u0026nbsp; I shall see you both no doubt at Evensong?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; I think, dear Doctor, I will have a stroll with you.\u0026nbsp; I find I have a headache after all, and a walk might do it good.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; With pleasure, Miss Prism, with pleasure.\u0026nbsp; We might go as far as the schools and back.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; That would be delightful.\u0026nbsp; Cecily, you will read your Political Economy in my absence.\u0026nbsp; The chapter on the Fall of the Rupee you may omit.\u0026nbsp; It is somewhat too sensational.\u0026nbsp; Even these metallic problems have their melodramatic side.\n\u003cbr\u003e \n\u003cbr\u003e [Goes down the garden with Dr. Chasuble.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Picks up books and throws them back on table.]\u0026nbsp; Horrid Political Economy!\u0026nbsp; Horrid Geography!\u0026nbsp; Horrid, horrid German!\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman with a card on a salver.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Mr. Ernest Worthing has just driven over from the station.\u0026nbsp; He has brought his luggage with him.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Takes the card and reads it.]\u0026nbsp; ‘Mr. Ernest Worthing, B. 4, The Albany, W.’\u0026nbsp; Uncle Jack’s brother!\u0026nbsp; Did you tell him Mr. Worthing was in town?\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, Miss.\u0026nbsp; He seemed very much disappointed.\u0026nbsp; I mentioned that you and Miss Prism were in the garden.\u0026nbsp; He said he was anxious to speak to you privately for a moment.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Ask Mr. Ernest Worthing to come here.\u0026nbsp; I suppose you had better talk to the housekeeper about a room for him.\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, Miss.\n\u003cbr\u003e \n\u003cbr\u003e [Merriman goes off.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I have never met any really wicked person before.\u0026nbsp; I feel rather frightened.\u0026nbsp; I am so afraid he will look just like every one else.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Algernon, very gay and debonnair.]\u0026nbsp; He does!\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Raising his hat.]\u0026nbsp; You are my little cousin Cecily, I’m sure.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You are under some strange mistake.\u0026nbsp; I am not little.\u0026nbsp; In fact, I believe I am more than usually tall for my age.\u0026nbsp; [Algernon is rather taken aback.]\u0026nbsp; But I am your cousin Cecily.\u0026nbsp; You, I see from your card, are Uncle Jack’s brother, my cousin Ernest, my wicked cousin Ernest.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Oh! I am not really wicked at all, cousin Cecily.\u0026nbsp; You mustn’t think that I am wicked.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; If you are not, then you have certainly been deceiving us all in a very inexcusable manner.\u0026nbsp; I hope you have not been leading a double life, pretending to be wicked and being really good all the time.\u0026nbsp; That would be hypocrisy.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Looks at her in amazement.]\u0026nbsp; Oh!\u0026nbsp; Of course I have been rather reckless.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I am glad to hear it.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; In fact, now you mention the subject, I have been very bad in my own small way.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think you should be so proud of that, though I am sure it must have been very pleasant.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; It is much pleasanter being here with you.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I can’t understand how you are here at all.\u0026nbsp; Uncle Jack won’t be back till Monday afternoon.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; That is a great disappointment.\u0026nbsp; I am obliged to go up by the first train on Monday morning.\u0026nbsp; I have a business appointment that I am anxious . . . to miss?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Couldn’t you miss it anywhere but in London?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; No: the appointment is in London.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Well, I know, of course, how important it is not to keep a business engagement, if one wants to retain any sense of the beauty of life, but still I think you had better wait till Uncle Jack arrives.\u0026nbsp; I know he wants to speak to you about your emigrating.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; About my what?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Your emigrating.\u0026nbsp; He has gone up to buy your outfit.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I certainly wouldn’t let Jack buy my outfit.\u0026nbsp; He has no taste in neckties at all.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think you will require neckties.\u0026nbsp; Uncle Jack is sending you to Australia.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Australia!\u0026nbsp; I’d sooner die.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Well, he said at dinner on Wednesday night, that you would have to choose between this world, the next world, and Australia.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Oh, well!\u0026nbsp; The accounts I have received of Australia and the next world, are not particularly encouraging.\u0026nbsp; This world is good enough for me, cousin Cecily.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, but are you good enough for it?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I’m afraid I’m not that.\u0026nbsp; That is why I want you to reform me.\u0026nbsp; You might make that your mission, if you don’t mind, cousin Cecily.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I’m afraid I’ve no time, this afternoon.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, would you mind my reforming myself this afternoon?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It is rather Quixotic of you.\u0026nbsp; But I think you should try.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I will.\u0026nbsp; I feel better already.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You are looking a little worse.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; That is because I am hungry.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; How thoughtless of me.\u0026nbsp; I should have remembered that when one is going to lead an entirely new life, one requires regular and wholesome meals.\u0026nbsp; Won’t you come in?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Thank you.\u0026nbsp; Might I have a buttonhole first?\u0026nbsp; I never have any appetite unless I have a buttonhole first.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; A Marechal Niel?\u0026nbsp; [Picks up scissors.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; No, I’d sooner have a pink rose.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Why?\u0026nbsp; [Cuts a flower.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Because you are like a pink rose, Cousin Cecily.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think it can be right for you to talk to me like that.\u0026nbsp; Miss Prism never says such things to me.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Then Miss Prism is a short-sighted old lady.\u0026nbsp; [Cecily puts the rose in his buttonhole.]\u0026nbsp; You are the prettiest girl I ever saw.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Miss Prism says that all good looks are a snare.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; They are a snare that every sensible man would like to be caught in.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, I don’t think I would care to catch a sensible man.\u0026nbsp; I shouldn’t know what to talk to him about.\n\u003cbr\u003e \n\u003cbr\u003e [They pass into the house.\u0026nbsp; Miss Prism and Dr. Chasuble return.]\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; You are too much alone, dear Dr. Chasuble.\u0026nbsp; You should get married.\u0026nbsp; A misanthrope I can understand—a womanthrope, never!\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; [With a scholar’s shudder.]\u0026nbsp; Believe me, I do not deserve so neologistic a phrase.\u0026nbsp; The precept as well as the practice of the Primitive Church was distinctly against matrimony.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Sententiously.]\u0026nbsp; That is obviously the reason why the Primitive Church has not lasted up to the present day.\u0026nbsp; And you do not seem to realise, dear Doctor, that by persistently remaining single, a man converts himself into a permanent public temptation.\u0026nbsp; Men should be more careful; this very celibacy leads weaker vessels astray.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; But is a man not equally attractive when married?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; No married man is ever attractive except to his wife.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; And often, I’ve been told, not even to her.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; That depends on the intellectual sympathies of the woman.\u0026nbsp; Maturity can always be depended on.\u0026nbsp; Ripeness can be trusted.\u0026nbsp; Young women are green.\u0026nbsp; [Dr. Chasuble starts.]\u0026nbsp; I spoke horticulturally.\u0026nbsp; My metaphor was drawn from fruits.\u0026nbsp; But where is Cecily?\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Perhaps she followed us to the schools.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Jack slowly from the back of the garden.\u0026nbsp; He is dressed in the deepest mourning, with crape hatband and black gloves.]\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Mr. Worthing!\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Mr. Worthing?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; This is indeed a surprise.\u0026nbsp; We did not look for you till Monday afternoon.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Shakes Miss Prism’s hand in a tragic manner.]\u0026nbsp; I have returned sooner than I expected.\u0026nbsp; Dr. Chasuble, I hope you are well?\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Dear Mr. Worthing, I trust this garb of woe does not betoken some terrible calamity?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; My brother.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; More shameful debts and extravagance?\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Still leading his life of pleasure?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Shaking his head.]\u0026nbsp; Dead!\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Your brother Ernest dead?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Quite dead.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; What a lesson for him!\u0026nbsp; I trust he will profit by it.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Mr. Worthing, I offer you my sincere condolence.\u0026nbsp; You have at least the consolation of knowing that you were always the most generous and forgiving of brothers.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Poor Ernest!\u0026nbsp; He had many faults, but it is a sad, sad blow.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Very sad indeed.\u0026nbsp; Were you with him at the end?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; No.\u0026nbsp; He died abroad; in Paris, in fact.\u0026nbsp; I had a telegram last night from the manager of the Grand Hotel.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Was the cause of death mentioned?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; A severe chill, it seems.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; As a man sows, so shall he reap.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; [Raising his hand.]\u0026nbsp; Charity, dear Miss Prism, charity!\u0026nbsp; None of us are perfect.\u0026nbsp; I myself am peculiarly susceptible to draughts.\u0026nbsp; Will the interment take place here?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; No.\u0026nbsp; He seems to have expressed a desire to be buried in Paris.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; In Paris!\u0026nbsp; [Shakes his head.]\u0026nbsp; I fear that hardly points to any very serious state of mind at the last.\u0026nbsp; You would no doubt wish me to make some slight allusion to this tragic domestic affliction next Sunday.\u0026nbsp; [Jack presses his hand convulsively.]\u0026nbsp; My sermon on the meaning of the manna in the wilderness can be adapted to almost any occasion, joyful, or, as in the present case, distressing.\u0026nbsp; [All sigh.]\u0026nbsp; I have preached it at harvest celebrations, christenings, confirmations, on days of humiliation and festal days.\u0026nbsp; The last time I delivered it was in the Cathedral, as a charity sermon on behalf of the Society for the Prevention of Discontent among the Upper Orders.\u0026nbsp; The Bishop, who was present, was much struck by some of the analogies I drew.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Ah! that reminds me, you mentioned christenings I think, Dr. Chasuble?\u0026nbsp; I suppose you know how to christen all right?\u0026nbsp; [Dr. Chasuble looks astounded.]\u0026nbsp; I mean, of course, you are continually christening, aren’t you?\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; It is, I regret to say, one of the Rector’s most constant duties in this parish.\u0026nbsp; I have often spoken to the poorer classes on the subject.\u0026nbsp; But they don’t seem to know what thrift is.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; But is there any particular infant in whom you are interested, Mr. Worthing?\u0026nbsp; Your brother was, I believe, unmarried, was he not?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Oh yes.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; [Bitterly.]\u0026nbsp; People who live entirely for pleasure usually are.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; But it is not for any child, dear Doctor.\u0026nbsp; I am very fond of children.\u0026nbsp; No! the fact is, I would like to be christened myself, this afternoon, if you have nothing better to do.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; But surely, Mr. Worthing, you have been christened already?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I don’t remember anything about it.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; But have you any grave doubts on the subject?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I certainly intend to have.\u0026nbsp; Of course I don’t know if the thing would bother you in any way, or if you think I am a little too old now.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Not at all.\u0026nbsp; The sprinkling, and, indeed, the immersion of adults is a perfectly canonical practice.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Immersion!\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; You need have no apprehensions.\u0026nbsp; Sprinkling is all that is necessary, or indeed I think advisable.\u0026nbsp; Our weather is so changeable.\u0026nbsp; At what hour would you wish the ceremony performed?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Oh, I might trot round about five if that would suit you.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Perfectly, perfectly!\u0026nbsp; In fact I have two similar ceremonies to perform at that time.\u0026nbsp; A case of twins that occurred recently in one of the outlying cottages on your own estate.\u0026nbsp; Poor Jenkins the carter, a most hard-working man.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Oh!\u0026nbsp; I don’t see much fun in being christened along with other babies.\u0026nbsp; It would be childish.\u0026nbsp; Would half-past five do?\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; Admirably!\u0026nbsp; Admirably!\u0026nbsp; [Takes out watch.]\u0026nbsp; And now, dear Mr. Worthing, I will not intrude any longer into a house of sorrow.\u0026nbsp; I would merely beg you not to be too much bowed down by grief.\u0026nbsp; What seem to us bitter trials are often blessings in disguise.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; This seems to me a blessing of an extremely obvious kind.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Cecily from the house.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Uncle Jack!\u0026nbsp; Oh, I am pleased to see you back.\u0026nbsp; But what horrid clothes you have got on!\u0026nbsp; Do go and change them.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Cecily!\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; My child! my child!\u0026nbsp; [Cecily goes towards Jack; he kisses her brow in a melancholy manner.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; What is the matter, Uncle Jack?\u0026nbsp; Do look happy!\u0026nbsp; You look as if you had toothache, and I have got such a surprise for you.\u0026nbsp; Who do you think is in the dining-room?\u0026nbsp; Your brother!\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Who?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Your brother Ernest.\u0026nbsp; He arrived about half an hour ago.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; What nonsense!\u0026nbsp; I haven’t got a brother.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, don’t say that.\u0026nbsp; However badly he may have behaved to you in the past he is still your brother.\u0026nbsp; You couldn’t be so heartless as to disown him.\u0026nbsp; I’ll tell him to come out.\u0026nbsp; And you will shake hands with him, won’t you, Uncle Jack?\u0026nbsp; [Runs back into the house.]\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; These are very joyful tidings.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; After we had all been resigned to his loss, his sudden return seems to me peculiarly distressing.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; My brother is in the dining-room?\u0026nbsp; I don’t know what it all means.\u0026nbsp; I think it is perfectly absurd.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Algernon and Cecily hand in hand.\u0026nbsp; They come slowly up to Jack.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Good heavens!\u0026nbsp; [Motions Algernon away.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Brother John, I have come down from town to tell you that I am very sorry for all the trouble I have given you, and that I intend to lead a better life in the future.\u0026nbsp; [Jack glares at him and does not take his hand.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Uncle Jack, you are not going to refuse your own brother’s hand?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Nothing will induce me to take his hand.\u0026nbsp; I think his coming down here disgraceful.\u0026nbsp; He knows perfectly well why.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Uncle Jack, do be nice.\u0026nbsp; There is some good in every one.\u0026nbsp; Ernest has just been telling me about his poor invalid friend Mr. Bunbury whom he goes to visit so often.\u0026nbsp; And surely there must be much good in one who is kind to an invalid, and leaves the pleasures of London to sit by a bed of pain.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Oh! he has been talking about Bunbury, has he?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, he has told me all about poor Mr. Bunbury, and his terrible state of health.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Bunbury!\u0026nbsp; Well, I won’t have him talk to you about Bunbury or about anything else.\u0026nbsp; It is enough to drive one perfectly frantic.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Of course I admit that the faults were all on my side.\u0026nbsp; But I must say that I think that Brother John’s coldness to me is peculiarly painful.\u0026nbsp; I expected a more enthusiastic welcome, especially considering it is the first time I have come here.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Uncle Jack, if you don’t shake hands with Ernest I will never forgive you.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Never forgive me?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Never, never, never!\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, this is the last time I shall ever do it.\u0026nbsp; [Shakes with Algernon and glares.]\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; It’s pleasant, is it not, to see so perfect a reconciliation?\u0026nbsp; I think we might leave the two brothers together.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; Cecily, you will come with us.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Certainly, Miss Prism.\u0026nbsp; My little task of reconciliation is over.\n\u003cbr\u003e \n\u003cbr\u003e Chasuble.\u0026nbsp; You have done a beautiful action to-day, dear child.\n\u003cbr\u003e \n\u003cbr\u003e Miss Prism.\u0026nbsp; We must not be premature in our judgments.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I feel very happy.\u0026nbsp; [They all go off except Jack and Algernon.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; You young scoundrel, Algy, you must get out of this place as soon as possible.\u0026nbsp; I don’t allow any Bunburying here.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; I have put Mr. Ernest’s things in the room next to yours, sir.\u0026nbsp; I suppose that is all right?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; What?\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Mr. Ernest’s luggage, sir.\u0026nbsp; I have unpacked it and put it in the room next to your own.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; His luggage?\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, sir.\u0026nbsp; Three portmanteaus, a dressing-case, two hat-boxes, and a large luncheon-basket.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I am afraid I can’t stay more than a week this time.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Merriman, order the dog-cart at once.\u0026nbsp; Mr. Ernest has been suddenly called back to town.\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, sir.\u0026nbsp; [Goes back into the house.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; What a fearful liar you are, Jack.\u0026nbsp; I have not been called back to town at all.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Yes, you have.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I haven’t heard any one call me.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Your duty as a gentleman calls you back.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; My duty as a gentleman has never interfered with my pleasures in the smallest degree.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I can quite understand that.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, Cecily is a darling.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; You are not to talk of Miss Cardew like that.\u0026nbsp; I don’t like it.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, I don’t like your clothes.\u0026nbsp; You look perfectly ridiculous in them.\u0026nbsp; Why on earth don’t you go up and change?\u0026nbsp; It is perfectly childish to be in deep mourning for a man who is actually staying for a whole week with you in your house as a guest.\u0026nbsp; I call it grotesque.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; You are certainly not staying with me for a whole week as a guest or anything else.\u0026nbsp; You have got to leave . . . by the four-five train.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I certainly won’t leave you so long as you are in mourning.\u0026nbsp; It would be most unfriendly.\u0026nbsp; If I were in mourning you would stay with me, I suppose.\u0026nbsp; I should think it very unkind if you didn’t.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, will you go if I change my clothes?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Yes, if you are not too long.\u0026nbsp; I never saw anybody take so long to dress, and with such little result.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, at any rate, that is better than being always over-dressed as you are.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; If I am occasionally a little over-dressed, I make up for it by being always immensely over-educated.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Your vanity is ridiculous, your conduct an outrage, and your presence in my garden utterly absurd.\u0026nbsp; However, you have got to catch the four-five, and I hope you will have a pleasant journey back to town.\u0026nbsp; This Bunburying, as you call it, has not been a great success for you.\n\u003cbr\u003e \n\u003cbr\u003e [Goes into the house.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I think it has been a great success.\u0026nbsp; I’m in love with Cecily, and that is everything.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Cecily at the back of the garden.\u0026nbsp; She picks up the can and begins to water the flowers.]\u0026nbsp; But I must see her before I go, and make arrangements for another Bunbury.\u0026nbsp; Ah, there she is.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, I merely came back to water the roses.\u0026nbsp; I thought you were with Uncle Jack.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; He’s gone to order the dog-cart for me.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, is he going to take you for a nice drive?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; He’s going to send me away.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Then have we got to part?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I am afraid so.\u0026nbsp; It’s a very painful parting.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It is always painful to part from people whom one has known for a very brief space of time.\u0026nbsp; The absence of old friends one can endure with equanimity.\u0026nbsp; But even a momentary separation from anyone to whom one has just been introduced is almost unbearable.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Thank you.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; The dog-cart is at the door, sir.\u0026nbsp; [Algernon looks appealingly at Cecily.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It can wait, Merriman for . . . five minutes.\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, Miss.\u0026nbsp; [Exit Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I hope, Cecily, I shall not offend you if I state quite frankly and openly that you seem to me to be in every way the visible personification of absolute perfection.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I think your frankness does you great credit, Ernest.\u0026nbsp; If you will allow me, I will copy your remarks into my diary.\u0026nbsp; [Goes over to table and begins writing in diary.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Do you really keep a diary?\u0026nbsp; I’d give anything to look at it.\u0026nbsp; May I?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh no.\u0026nbsp; [Puts her hand over it.]\u0026nbsp; You see, it is simply a very young girl’s record of her own thoughts and impressions, and consequently meant for publication.\u0026nbsp; When it appears in volume form I hope you will order a copy.\u0026nbsp; But pray, Ernest, don’t stop.\u0026nbsp; I delight in taking down from dictation.\u0026nbsp; I have reached ‘absolute perfection’.\u0026nbsp; You can go on.\u0026nbsp; I am quite ready for more.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Somewhat taken aback.]\u0026nbsp; Ahem!\u0026nbsp; Ahem!\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, don’t cough, Ernest.\u0026nbsp; When one is dictating one should speak fluently and not cough.\u0026nbsp; Besides, I don’t know how to spell a cough.\u0026nbsp; [Writes as Algernon speaks.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Speaking very rapidly.]\u0026nbsp; Cecily, ever since I first looked upon your wonderful and incomparable beauty, I have dared to love you wildly, passionately, devotedly, hopelessly.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think that you should tell me that you love me wildly, passionately, devotedly, hopelessly.\u0026nbsp; Hopelessly doesn’t seem to make much sense, does it?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Cecily!\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; The dog-cart is waiting, sir.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Tell it to come round next week, at the same hour.\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; [Looks at Cecily, who makes no sign.]\u0026nbsp; Yes, sir.\n\u003cbr\u003e \n\u003cbr\u003e [Merriman retires.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Uncle Jack would be very much annoyed if he knew you were staying on till next week, at the same hour.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Oh, I don’t care about Jack.\u0026nbsp; I don’t care for anybody in the whole world but you.\u0026nbsp; I love you, Cecily.\u0026nbsp; You will marry me, won’t you?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You silly boy!\u0026nbsp; Of course.\u0026nbsp; Why, we have been engaged for the last three months.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; For the last three months?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, it will be exactly three months on Thursday.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; But how did we become engaged?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Well, ever since dear Uncle Jack first confessed to us that he had a younger brother who was very wicked and bad, you of course have formed the chief topic of conversation between myself and Miss Prism.\u0026nbsp; And of course a man who is much talked about is always very attractive.\u0026nbsp; One feels there must be something in him, after all.\u0026nbsp; I daresay it was foolish of me, but I fell in love with you, Ernest.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Darling!\u0026nbsp; And when was the engagement actually settled?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; On the 14th of February last.\u0026nbsp; Worn out by your entire ignorance of my existence, I determined to end the matter one way or the other, and after a long struggle with myself I accepted you under this dear old tree here.\u0026nbsp; The next day I bought this little ring in your name, and this is the little bangle with the true lover’s knot I promised you always to wear.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Did I give you this?\u0026nbsp; It’s very pretty, isn’t it?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, you’ve wonderfully good taste, Ernest.\u0026nbsp; It’s the excuse I’ve always given for your leading such a bad life.\u0026nbsp; And this is the box in which I keep all your dear letters.\u0026nbsp; [Kneels at table, opens box, and produces letters tied up with blue ribbon.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; My letters!\u0026nbsp; But, my own sweet Cecily, I have never written you any letters.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You need hardly remind me of that, Ernest.\u0026nbsp; I remember only too well that I was forced to write your letters for you.\u0026nbsp; I wrote always three times a week, and sometimes oftener.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Oh, do let me read them, Cecily?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, I couldn’t possibly.\u0026nbsp; They would make you far too conceited.\u0026nbsp; [Replaces box.]\u0026nbsp; The three you wrote me after I had broken off the engagement are so beautiful, and so badly spelled, that even now I can hardly read them without crying a little.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; But was our engagement ever broken off?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Of course it was.\u0026nbsp; On the 22nd of last March.\u0026nbsp; You can see the entry if you like. [Shows diary.]\u0026nbsp; ‘To-day I broke off my engagement with Ernest.\u0026nbsp; I feel it is better to do so.\u0026nbsp; The weather still continues charming.’\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; But why on earth did you break it off?\u0026nbsp; What had I done?\u0026nbsp; I had done nothing at all.\u0026nbsp; Cecily, I am very much hurt indeed to hear you broke it off.\u0026nbsp; Particularly when the weather was so charming.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It would hardly have been a really serious engagement if it hadn’t been broken off at least once.\u0026nbsp; But I forgave you before the week was out.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Crossing to her, and kneeling.]\u0026nbsp; What a perfect angel you are, Cecily.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You dear romantic boy.\u0026nbsp; [He kisses her, she puts her fingers through his hair.]\u0026nbsp; I hope your hair curls naturally, does it?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Yes, darling, with a little help from others.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I am so glad.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; You’ll never break off our engagement again, Cecily?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think I could break it off now that I have actually met you.\u0026nbsp; Besides, of course, there is the question of your name.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Yes, of course.\u0026nbsp; [Nervously.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; You must not laugh at me, darling, but it had always been a girlish dream of mine to love some one whose name was Ernest.\u0026nbsp; [Algernon rises, Cecily also.]\u0026nbsp; There is something in that name that seems to inspire absolute confidence.\u0026nbsp; I pity any poor married woman whose husband is not called Ernest.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; But, my dear child, do you mean to say you could not love me if I had some other name?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; But what name?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Oh, any name you like—Algernon—for instance . . .\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; But I don’t like the name of Algernon.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, my own dear, sweet, loving little darling, I really can’t see why you should object to the name of Algernon.\u0026nbsp; It is not at all a bad name.\u0026nbsp; In fact, it is rather an aristocratic name.\u0026nbsp; Half of the chaps who get into the Bankruptcy Court are called Algernon.\u0026nbsp; But seriously, Cecily . . . [Moving to her] . . . if my name was Algy, couldn’t you love me?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Rising.]\u0026nbsp; I might respect you, Ernest, I might admire your character, but I fear that I should not be able to give you my undivided attention.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Ahem!\u0026nbsp; Cecily!\u0026nbsp; [Picking up hat.]\u0026nbsp; Your Rector here is, I suppose, thoroughly experienced in the practice of all the rites and ceremonials of the Church?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, yes.\u0026nbsp; Dr. Chasuble is a most learned man.\u0026nbsp; He has never written a single book, so you can imagine how much he knows.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I must see him at once on a most important christening—I mean on most important business.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh!\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I shan’t be away more than half an hour.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Considering that we have been engaged since February the 14th, and that I only met you to-day for the first time, I think it is rather hard that you should leave me for so long a period as half an hour.\u0026nbsp; Couldn’t you make it twenty minutes?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I’ll be back in no time.\n\u003cbr\u003e \n\u003cbr\u003e [Kisses her and rushes down the garden.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; What an impetuous boy he is!\u0026nbsp; I like his hair so much.\u0026nbsp; I must enter his proposal in my diary.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; A Miss Fairfax has just called to see Mr. Worthing.\u0026nbsp; On very important business, Miss Fairfax states.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Isn’t Mr. Worthing in his library?\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Mr. Worthing went over in the direction of the Rectory some time ago.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Pray ask the lady to come out here; Mr. Worthing is sure to be back soon.\u0026nbsp; And you can bring tea.\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Yes, Miss.\u0026nbsp; [Goes out.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Miss Fairfax!\u0026nbsp; I suppose one of the many good elderly women who are associated with Uncle Jack in some of his philanthropic work in London.\u0026nbsp; I don’t quite like women who are interested in philanthropic work.\u0026nbsp; I think it is so forward of them.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Miss Fairfax.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Gwendolen.]\n\u003cbr\u003e \n\u003cbr\u003e [Exit Merriman.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Advancing to meet her.]\u0026nbsp; Pray let me introduce myself to you.\u0026nbsp; My name is Cecily Cardew.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Cecily Cardew?\u0026nbsp; [Moving to her and shaking hands.]\u0026nbsp; What a very sweet name!\u0026nbsp; Something tells me that we are going to be great friends.\u0026nbsp; I like you already more than I can say.\u0026nbsp; My first impressions of people are never wrong.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; How nice of you to like me so much after we have known each other such a comparatively short time.\u0026nbsp; Pray sit down.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Still standing up.]\u0026nbsp; I may call you Cecily, may I not?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; With pleasure!\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; And you will always call me Gwendolen, won’t you?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; If you wish.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Then that is all quite settled, is it not?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I hope so.\u0026nbsp; [A pause.\u0026nbsp; They both sit down together.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Perhaps this might be a favourable opportunity for my mentioning who I am.\u0026nbsp; My father is Lord Bracknell.\u0026nbsp; You have never heard of papa, I suppose?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I don’t think so.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Outside the family circle, papa, I am glad to say, is entirely unknown.\u0026nbsp; I think that is quite as it should be.\u0026nbsp; The home seems to me to be the proper sphere for the man.\u0026nbsp; And certainly once a man begins to neglect his domestic duties he becomes painfully effeminate, does he not?\u0026nbsp; And I don’t like that.\u0026nbsp; It makes men so very attractive.\u0026nbsp; Cecily, mamma, whose views on education are remarkably strict, has brought me up to be extremely short-sighted; it is part of her system; so do you mind my looking at you through my glasses?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh! not at all, Gwendolen.\u0026nbsp; I am very fond of being looked at.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [After examining Cecily carefully through a lorgnette.]\u0026nbsp; You are here on a short visit, I suppose.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh no!\u0026nbsp; I live here.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Severely.]\u0026nbsp; Really?\u0026nbsp; Your mother, no doubt, or some female relative of advanced years, resides here also?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh no!\u0026nbsp; I have no mother, nor, in fact, any relations.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Indeed?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; My dear guardian, with the assistance of Miss Prism, has the arduous task of looking after me.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Your guardian?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes, I am Mr. Worthing’s ward.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Oh!\u0026nbsp; It is strange he never mentioned to me that he had a ward.\u0026nbsp; How secretive of him!\u0026nbsp; He grows more interesting hourly.\u0026nbsp; I am not sure, however, that the news inspires me with feelings of unmixed delight.\u0026nbsp; [Rising and going to her.]\u0026nbsp; I am very fond of you, Cecily; I have liked you ever since I met you!\u0026nbsp; But I am bound to state that now that I know that you are Mr. Worthing’s ward, I cannot help expressing a wish you were—well, just a little older than you seem to be—and not quite so very alluring in appearance.\u0026nbsp; In fact, if I may speak candidly—\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Pray do!\u0026nbsp; I think that whenever one has anything unpleasant to say, one should always be quite candid.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Well, to speak with perfect candour, Cecily, I wish that you were fully forty-two, and more than usually plain for your age.\u0026nbsp; Ernest has a strong upright nature.\u0026nbsp; He is the very soul of truth and honour.\u0026nbsp; Disloyalty would be as impossible to him as deception.\u0026nbsp; But even men of the noblest possible moral character are extremely susceptible to the influence of the physical charms of others.\u0026nbsp; Modern, no less than Ancient History, supplies us with many most painful examples of what I refer to.\u0026nbsp; If it were not so, indeed, History would be quite unreadable.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I beg your pardon, Gwendolen, did you say Ernest?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Yes.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, but it is not Mr. Ernest Worthing who is my guardian.\u0026nbsp; It is his brother—his elder brother.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Sitting down again.]\u0026nbsp; Ernest never mentioned to me that he had a brother.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; I am sorry to say they have not been on good terms for a long time.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Ah! that accounts for it.\u0026nbsp; And now that I think of it I have never heard any man mention his brother.\u0026nbsp; The subject seems distasteful to most men.\u0026nbsp; Cecily, you have lifted a load from my mind.\u0026nbsp; I was growing almost anxious.\u0026nbsp; It would have been terrible if any cloud had come across a friendship like ours, would it not?\u0026nbsp; Of course you are quite, quite sure that it is not Mr. Ernest Worthing who is your guardian?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Quite sure.\u0026nbsp; [A pause.]\u0026nbsp; In fact, I am going to be his.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Inquiringly.]\u0026nbsp; I beg your pardon?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Rather shy and confidingly.]\u0026nbsp; Dearest Gwendolen, there is no reason why I should make a secret of it to you.\u0026nbsp; Our little county newspaper is sure to chronicle the fact next week.\u0026nbsp; Mr. Ernest Worthing and I are engaged to be married.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Quite politely, rising.]\u0026nbsp; My darling Cecily, I think there must be some slight error.\u0026nbsp; Mr. Ernest Worthing is engaged to me.\u0026nbsp; The announcement will appear in the Morning Post on Saturday at the latest.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Very politely, rising.]\u0026nbsp; I am afraid you must be under some misconception.\u0026nbsp; Ernest proposed to me exactly ten minutes ago.\u0026nbsp; [Shows diary.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Examines diary through her lorgnettte carefully.]\u0026nbsp; It is certainly very curious, for he asked me to be his wife yesterday afternoon at 5.30.\u0026nbsp; If you would care to verify the incident, pray do so.\u0026nbsp; [Produces diary of her own.]\u0026nbsp; I never travel without my diary.\u0026nbsp; One should always have something sensational to read in the train.\u0026nbsp; I am so sorry, dear Cecily, if it is any disappointment to you, but I am afraid I have the prior claim.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It would distress me more than I can tell you, dear Gwendolen, if it caused you any mental or physical anguish, but I feel bound to point out that since Ernest proposed to you he clearly has changed his mind.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Meditatively.]\u0026nbsp; If the poor fellow has been entrapped into any foolish promise I shall consider it my duty to rescue him at once, and with a firm hand.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Thoughtfully and sadly.]\u0026nbsp; Whatever unfortunate entanglement my dear boy may have got into, I will never reproach him with it after we are married.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Do you allude to me, Miss Cardew, as an entanglement?\u0026nbsp; You are presumptuous.\u0026nbsp; On an occasion of this kind it becomes more than a moral duty to speak one’s mind.\u0026nbsp; It becomes a pleasure.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Do you suggest, Miss Fairfax, that I entrapped Ernest into an engagement?\u0026nbsp; How dare you?\u0026nbsp; This is no time for wearing the shallow mask of manners.\u0026nbsp; When I see a spade I call it a spade.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Satirically.]\u0026nbsp; I am glad to say that I have never seen a spade.\u0026nbsp; It is obvious that our social spheres have been widely different.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Merriman, followed by the footman.\u0026nbsp; He carries a salver, table cloth, and plate stand.\u0026nbsp; Cecily is about to retort.\u0026nbsp; The presence of the servants exercises a restraining influence, under which both girls chafe.]\n\u003cbr\u003e \n\u003cbr\u003e Merriman.\u0026nbsp; Shall I lay tea here as usual, Miss?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Sternly, in a calm voice.]\u0026nbsp; Yes, as usual.\u0026nbsp; [Merriman begins to clear table and lay cloth.\u0026nbsp; A long pause.\u0026nbsp; Cecily and Gwendolen glare at each other.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Are there many interesting walks in the vicinity, Miss Cardew?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh! yes! a great many.\u0026nbsp; From the top of one of the hills quite close one can see five counties.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Five counties!\u0026nbsp; I don’t think I should like that; I hate crowds.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Sweetly.]\u0026nbsp; I suppose that is why you live in town?\u0026nbsp; [Gwendolen bites her lip, and beats her foot nervously with her parasol.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Looking round.]\u0026nbsp; Quite a well-kept garden this is, Miss Cardew.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; So glad you like it, Miss Fairfax.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; I had no idea there were any flowers in the country.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh, flowers are as common here, Miss Fairfax, as people are in London.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Personally I cannot understand how anybody manages to exist in the country, if anybody who is anybody does.\u0026nbsp; The country always bores me to death.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Ah!\u0026nbsp; This is what the newspapers call agricultural depression, is it not?\u0026nbsp; I believe the aristocracy are suffering very much from it just at present.\u0026nbsp; It is almost an epidemic amongst them, I have been told.\u0026nbsp; May I offer you some tea, Miss Fairfax?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [With elaborate politeness.]\u0026nbsp; Thank you.\u0026nbsp; [Aside.]\u0026nbsp; Detestable girl!\u0026nbsp; But I require tea!\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Sweetly.]\u0026nbsp; Sugar?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Superciliously.]\u0026nbsp; No, thank you.\u0026nbsp; Sugar is not fashionable any more. [Cecily looks angrily at her, takes up the tongs and puts four lumps of sugar into the cup.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Severely.]\u0026nbsp; Cake or bread and butter?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [In a bored manner.]\u0026nbsp; Bread and butter, please.\u0026nbsp; Cake is rarely seen at the best houses nowadays.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Cuts a very large slice of cake, and puts it on the tray.]\u0026nbsp; Hand that to Miss Fairfax.\n\u003cbr\u003e \n\u003cbr\u003e [Merriman does so, and goes out with footman.\u0026nbsp; Gwendolen drinks the tea and makes a grimace.\u0026nbsp; Puts down cup at once, reaches out her hand to the bread and butter, looks at it, and finds it is cake.\u0026nbsp; Rises in indignation.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; You have filled my tea with lumps of sugar, and though I asked most distinctly for bread and butter, you have given me cake.\u0026nbsp; I am known for the gentleness of my disposition, and the extraordinary sweetness of my nature, but I warn you, Miss Cardew, you may go too far.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Rising.]\u0026nbsp; To save my poor, innocent, trusting boy from the machinations of any other girl there are no lengths to which I would not go.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; From the moment I saw you I distrusted you.\u0026nbsp; I felt that you were false and deceitful.\u0026nbsp; I am never deceived in such matters.\u0026nbsp; My first impressions of people are invariably right.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It seems to me, Miss Fairfax, that I am trespassing on your valuable time.\u0026nbsp; No doubt you have many other calls of a similar character to make in the neighbourhood.\n\u003cbr\u003e \n\u003cbr\u003e [Enter Jack.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Catching sight of him.]\u0026nbsp; Ernest!\u0026nbsp; My own Ernest!\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Gwendolen!\u0026nbsp; Darling!\u0026nbsp; [Offers to kiss her.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Draws back.]\u0026nbsp; A moment!\u0026nbsp; May I ask if you are engaged to be married to this young lady?\u0026nbsp; [Points to Cecily.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Laughing.]\u0026nbsp; To dear little Cecily!\u0026nbsp; Of course not!\u0026nbsp; What could have put such an idea into your pretty little head?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Thank you.\u0026nbsp; You may!\u0026nbsp; [Offers her cheek.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Very sweetly.]\u0026nbsp; I knew there must be some misunderstanding, Miss Fairfax.\u0026nbsp; The gentleman whose arm is at present round your waist is my guardian, Mr. John Worthing.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; I beg your pardon?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; This is Uncle Jack.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Receding.]\u0026nbsp; Jack!\u0026nbsp; Oh!\n\u003cbr\u003e \n\u003cbr\u003e [Enter Algernon.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Here is Ernest.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Goes straight over to Cecily without noticing any one else.]\u0026nbsp; My own love!\u0026nbsp; [Offers to kiss her.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Drawing back.]\u0026nbsp; A moment, Ernest!\u0026nbsp; May I ask you—are you engaged to be married to this young lady?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Looking round.]\u0026nbsp; To what young lady?\u0026nbsp; Good heavens!\u0026nbsp; Gwendolen!\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Yes! to good heavens, Gwendolen, I mean to Gwendolen.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Laughing.]\u0026nbsp; Of course not!\u0026nbsp; What could have put such an idea into your pretty little head?\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Thank you.\u0026nbsp; [Presenting her cheek to be kissed.]\u0026nbsp; You may.\u0026nbsp; [Algernon kisses her.]\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; I felt there was some slight error, Miss Cardew.\u0026nbsp; The gentleman who is now embracing you is my cousin, Mr. Algernon Moncrieff.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Breaking away from Algernon.]\u0026nbsp; Algernon Moncrieff!\u0026nbsp; Oh!\u0026nbsp; [The two girls move towards each other and put their arms round each other’s waists as if for protection.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Are you called Algernon?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I cannot deny it.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; Oh!\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Is your name really John?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Standing rather proudly.]\u0026nbsp; I could deny it if I liked.\u0026nbsp; I could deny anything if I liked.\u0026nbsp; But my name certainly is John.\u0026nbsp; It has been John for years.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [To Gwendolen.]\u0026nbsp; A gross deception has been practised on both of us.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; My poor wounded Cecily!\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; My sweet wronged Gwendolen!\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Slowly and seriously.]\u0026nbsp; You will call me sister, will you not?\u0026nbsp; [They embrace.\u0026nbsp; Jack and Algernon groan and walk up and down.]\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Rather brightly.]\u0026nbsp; There is just one question I would like to be allowed to ask my guardian.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; An admirable idea!\u0026nbsp; Mr. Worthing, there is just one question I would like to be permitted to put to you.\u0026nbsp; Where is your brother Ernest?\u0026nbsp; We are both engaged to be married to your brother Ernest, so it is a matter of some importance to us to know where your brother Ernest is at present.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Slowly and hesitatingly.]\u0026nbsp; Gwendolen—Cecily—it is very painful for me to be forced to speak the truth.\u0026nbsp; It is the first time in my life that I have ever been reduced to such a painful position, and I am really quite inexperienced in doing anything of the kind.\u0026nbsp; However, I will tell you quite frankly that I have no brother Ernest.\u0026nbsp; I have no brother at all.\u0026nbsp; I never had a brother in my life, and I certainly have not the smallest intention of ever having one in the future.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; [Surprised.]\u0026nbsp; No brother at all?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Cheerily.]\u0026nbsp; None!\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; [Severely.]\u0026nbsp; Had you never a brother of any kind?\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Pleasantly.]\u0026nbsp; Never.\u0026nbsp; Not even of any kind.\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; I am afraid it is quite clear, Cecily, that neither of us is engaged to be married to any one.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; It is not a very pleasant position for a young girl suddenly to find herself in.\u0026nbsp; Is it?\n\u003cbr\u003e \n\u003cbr\u003e Gwendolen.\u0026nbsp; Let us go into the house.\u0026nbsp; They will hardly venture to come after us there.\n\u003cbr\u003e \n\u003cbr\u003e Cecily.\u0026nbsp; No, men are so cowardly, aren’t they?\n\u003cbr\u003e \n\u003cbr\u003e [They retire into the house with scornful looks.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; This ghastly state of things is what you call Bunburying, I suppose?\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Yes, and a perfectly wonderful Bunbury it is.\u0026nbsp; The most wonderful Bunbury I have ever had in my life.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, you’ve no right whatsoever to Bunbury here.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; That is absurd.\u0026nbsp; One has a right to Bunbury anywhere one chooses.\u0026nbsp; Every serious Bunburyist knows that.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Serious Bunburyist!\u0026nbsp; Good heavens!\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, one must be serious about something, if one wants to have any amusement in life.\u0026nbsp; I happen to be serious about Bunburying.\u0026nbsp; What on earth you are serious about I haven’t got the remotest idea.\u0026nbsp; About everything, I should fancy.\u0026nbsp; You have such an absolutely trivial nature.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, the only small satisfaction I have in the whole of this wretched business is that your friend Bunbury is quite exploded.\u0026nbsp; You won’t be able to run down to the country quite so often as you used to do, dear Algy.\u0026nbsp; And a very good thing too.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Your brother is a little off colour, isn’t he, dear Jack?\u0026nbsp; You won’t be able to disappear to London quite so frequently as your wicked custom was.\u0026nbsp; And not a bad thing either.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; As for your conduct towards Miss Cardew, I must say that your taking in a sweet, simple, innocent girl like that is quite inexcusable.\u0026nbsp; To say nothing of the fact that she is my ward.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I can see no possible defence at all for your deceiving a brilliant, clever, thoroughly experienced young lady like Miss Fairfax.\u0026nbsp; To say nothing of the fact that she is my cousin.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I wanted to be engaged to Gwendolen, that is all.\u0026nbsp; I love her.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, I simply wanted to be engaged to Cecily.\u0026nbsp; I adore her.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; There is certainly no chance of your marrying Miss Cardew.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I don’t think there is much likelihood, Jack, of you and Miss Fairfax being united.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Well, that is no business of yours.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; If it was my business, I wouldn’t talk about it.\u0026nbsp; [Begins to eat muffins.]\u0026nbsp; It is very vulgar to talk about one’s business.\u0026nbsp; Only people like stock-brokers do that, and then merely at dinner parties.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; How can you sit there, calmly eating muffins when we are in this horrible trouble, I can’t make out.\u0026nbsp; You seem to me to be perfectly heartless.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Well, I can’t eat muffins in an agitated manner.\u0026nbsp; The butter would probably get on my cuffs.\u0026nbsp; One should always eat muffins quite calmly.\u0026nbsp; It is the only way to eat them.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I say it’s perfectly heartless your eating muffins at all, under the circumstances.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; When I am in trouble, eating is the only thing that consoles me.\u0026nbsp; Indeed, when I am in really great trouble, as any one who knows me intimately will tell you, I refuse everything except food and drink.\u0026nbsp; At the present moment I am eating muffins because I am unhappy.\u0026nbsp; Besides, I am particularly fond of muffins.\u0026nbsp; [Rising.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Rising.]\u0026nbsp; Well, that is no reason why you should eat them all in that greedy way. [Takes muffins from Algernon.]\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; [Offering tea-cake.]\u0026nbsp; I wish you would have tea-cake instead.\u0026nbsp; I don’t like tea-cake.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Good heavens!\u0026nbsp; I suppose a man may eat his own muffins in his own garden.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; But you have just said it was perfectly heartless to eat muffins.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; I said it was perfectly heartless of you, under the circumstances.\u0026nbsp; That is a very different thing.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; That may be.\u0026nbsp; But the muffins are the same.\u0026nbsp; [He seizes the muffin-dish from Jack.]\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Algy, I wish to goodness you would go.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; You can’t possibly ask me to go without having some dinner.\u0026nbsp; It’s absurd.\u0026nbsp; I never go without my dinner.\u0026nbsp; No one ever does, except vegetarians and people like that.\u0026nbsp; Besides I have just made arrangements with Dr. Chasuble to be christened at a quarter to six under the name of Ernest.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; My dear fellow, the sooner you give up that nonsense the better.\u0026nbsp; I made arrangements this morning with Dr. Chasuble to be christened myself at 5.30, and I naturally will take the name of Ernest.\u0026nbsp; Gwendolen would wish it.\u0026nbsp; We can’t both be christened Ernest.\u0026nbsp; It’s absurd.\u0026nbsp; Besides, I have a perfect right to be christened if I like.\u0026nbsp; There is no evidence at all that I have ever been christened by anybody.\u0026nbsp; I should think it extremely probable I never was, and so does Dr. Chasuble.\u0026nbsp; It is entirely different in your case.\u0026nbsp; You have been christened already.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Yes, but I have not been christened for years.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Yes, but you have been christened.\u0026nbsp; That is the important thing.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Quite so.\u0026nbsp; So I know my constitution can stand it.\u0026nbsp; If you are not quite sure about your ever having been christened, I must say I think it rather dangerous your venturing on it now.\u0026nbsp; It might make you very unwell.\u0026nbsp; You can hardly have forgotten that some one very closely connected with you was very nearly carried off this week in Paris by a severe chill.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Yes, but you said yourself that a severe chill was not hereditary.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; It usen’t to be, I know—but I daresay it is now.\u0026nbsp; Science is always making wonderful improvements in things.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; [Picking up the muffin-dish.]\u0026nbsp; Oh, that is nonsense; you are always talking nonsense.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Jack, you are at the muffins again!\u0026nbsp; I wish you wouldn’t.\u0026nbsp; There are only two left.\u0026nbsp; [Takes them.]\u0026nbsp; I told you I was particularly fond of muffins.\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; But I hate tea-cake.\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; Why on earth then do you allow tea-cake to be served up for your guests?\u0026nbsp; What ideas you have of hospitality!\n\u003cbr\u003e \n\u003cbr\u003e Jack.\u0026nbsp; Algernon!\u0026nbsp; I have already told you to go.\u0026nbsp; I don’t want you here.\u0026nbsp; Why don’t you go!\n\u003cbr\u003e \n\u003cbr\u003e Algernon.\u0026nbsp; I haven’t quite finished my tea yet! and there is still one muffin left.\u0026nbsp; [Jack groans, and sinks into a chair.\u0026nbsp; Algernon still continues eating.]\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1523/45435.html","bookId":658,"creation":"Aug 2, 2019 7:31:53 AM","modification":"Aug 2, 2019 7:31:53 AM"}
